{"title": "A New Running Club Is Taking Over The Streets Of Detroit—And Bringing People Together", "pub_date": "2019-08-22 12:32:12-04:00", "text": "Every Tuesday evening, Dean Hildreth laces up his running shoes, grabs a bottle of water and heads out to run the streets of Detroit.\n\nThe 28-year-old meets up with about a hundred runners outside of The Griot Music Lounge, a black-owned vinyl music lounge in the city’s Midtown neighborhood. They stretch for about five minutes, and when they’re done, they yell: “We run Detroit. We run Detroit. We run 313!”\n\nWith Rick Ross blasting in his AirPods, he takes off with the group for their 2-Mile Tuesday run.\n\nWe Run 313, a newly formed running club based in Michigan’s largest city, is growing rapidly. Nearly 200 people, newcomers and experienced runners alike, run along a set course. The club’s name derives from Detroit’s famous area code, 313.\n\nThe founders of the running club, Lance Woods and Joe Robinson, were already running long before they met one another. But when mutual friends encouraged them to meet, the pair quickly hit it off. They officially kicked the running club off in May.\n\n“We both were running individually, but we didn’t know each other. The reason why I wanted to start it with Joe was for accountability purposes,” Woods, a 31-year-old educator, told HuffPost. “You can only go so far by yourself, and we wanted to bring people together to show the community what running was doing for us.”\n\nWoods says running was doing so much for him mentally, spiritually and emotionally, so he wanted to share that with others.\n\nWe Run 313 The running club brings it in for their call: \"We run Detroit. We run Detroit. We run 313!”\n\nDetroiters are nearly twice as likely to die from cardiovascular disease than other Americans. In a city with high rates of cardiovascular disease, We Run 313 hopes to create a culture of health that will encourage runners of all ages and levels of experience to run with them.\n\n“Detroit is an 83% black city. If you talk about the things that are killing black people, a lot of them are preventive and self-inflicted diseases,” Robinson, a 28-year-old entrepreneur, told HuffPost. “You can talk about guns and violence, but none of that stuff adds up to heart disease, hypertension, diabetes.”\n\nParticipants have three options: They can join in for the 2-mile runs on Tuesdays, opt for longer runs with 5K and 10K runs on Thursdays, try their luck at a distance run on Saturdays, or all three.\n\nWe Run 313 Joe Robinson and Lance Woods, founders of We Run 313.\n\nAlthough runners at any level can join, the founders receive help from other experienced runners that can offer newbies advice and useful tips. Asia Rawls and Michael Berry both ran track in college, and now they run with the group often.\n\nBerry, 31, says the running club is one of the best experiences he’s had. “The encouragement, the love, every time I’m around them, there’s nothing but positivity,” the former Alabama State University track star said. “I love it and I wish more people would join.”\n\n“We want people to know you don’t have to be a super athlete, you don’t have to be Usain Bolt to come out and run with us,” Rawls, who ran track at Eastern Michigan University, said. “I think when people in the community see African American leaders running, it gives them hope and the opportunity to do something different.”\n\nWe Run 313 The club poses after completing a run.\n\nWoods and Robinson’s efforts aren’t going unnoticed. The running club has become so popular, the Detroit City Council awarded the pair with a Spirit of Detroit award in July. The recognition highlights any person or organization for their “outstanding achievement or service to the citizens of Detroit.”\n\nThe native Detroiters have no plans of stopping anytime soon. We Run 313 is only a few months old, but they’ve already been approached for partnership opportunities. For now, however, the two are just focused on encouraging more people to grab their running shoes and join in.\n\nTo anyone that’s nervous about running, Woods offers this advice: “Greatness is on the other side of fear. When you actively approach the things you’re afraid of, that’s when you’ll start to do great things.”", "img": "https://img.huffingtonpost.com/asset/5d5ecbf63c000032004347e1.jpeg?ops=1778_1000"}