{"title": "Donald Trump Jr. Mocks Bernie Sanders Boxing Stunt And Gets Whomped By Twitter", "pub_date": "2019-08-29 12:45:45-04:00", "text": "Donald Trump Jr. came out swinging against Bernie Sanders’ boxing skills ― and ended up getting pummeled by Twitter users.\n\nOn Thursday, the president’s son tweeted a video of Sanders jokingly showing off his boxing skills at the Muhammad Ali Center in Louisville, Kentucky. The clip features Sanders slamming his bare fist into a punching bag, which rebounds and bonks him on the head.\n\nSanders took the blow with good humor.\n\nBut Trump Jr. used the clip to suggest world leaders might do the same if Sanders were to win the 2020 election instead of his dear old dad, Donald Trump.\n\nThis wouldn’t exactly strike fear in the minds of our adversaries. Imagine this guy sitting accross the table negotiating with world leaders? pic.twitter.com/FdErYWwAyo — Donald Trump Jr. (@DonaldJTrumpJr) August 28, 2019\n\nBoth politics and boxing can be pretty brutal, but Trump Jr. apparently posted the video before realizing he was setting himself up ― once again ― as a punching bag for Twitter users.\n\nAnd they were happy to pile on:\n\nI'm trying to wrap my head around the one-two combo of, \"god forbid an old man have a sense of humor about himself\" and \"obviously donald trump is in peek physical condition\". — CSPAM2 (@cspamus1) August 29, 2019\n\nImagine this guy: pic.twitter.com/h5OD7OsLUv — King of Juice (@KingofJuice3) August 28, 2019\n\nHilarious that he thinks his obese joke of a dad who needed a golf cart while every other world leader walked strikes fear or respect, we have seen the photos where he is sitting alone while everyone else is talking, making deals while he sits arms crossed and pouts pic.twitter.com/xpBpH7jKPn — Diana Garcia (@guinea_wrangler) August 28, 2019\n\nTry again, Junior! Last weekend we saw your toddler dad @realdonaldtrump at the G7 #SpoiledBratInChief pic.twitter.com/RQqia8dwTy — 🇺🇸Les Breeding 🌻🗽 (@LesBreeding1) August 29, 2019\n\nMaybe this would strike fear in their hearts... pic.twitter.com/sYhPeEf3jJ — Mochahontas Dee ❄️ (@Mochahontas1982) August 28, 2019\n\nOne guy had a pointed question for Trump Jr.\n\nyou know who the current president is, right? — basic white dude (@mediumcooI) August 29, 2019\n\nAnd one woman wondered if Trump Jr. wanted a tweet do-over.\n\nI don’t think he got out of that what he intended. 😂😂 — Lori Hendry (@Lrihendry) August 28, 2019", "img": "https://img.huffingtonpost.com/asset/5d67ef4b250000710a743820.jpeg?cache=4b6awxnp2w&ops=1778_1000"}