{"pub": "independent", "url": "https://independent.co.uk/life-style/gadgets-and-tech/news/draconids-meteor-shower-when-date-shooting-stars-a9147251.html", "downloaded_at": "2019-10-08 15:08:07.935751+00:00", "title": "Draconids meteor shower 2019: When and how to watch celestial spectacle", "language": "en", "text": "The 2019 Draconids meteor shower is set to light up the night’s sky on Tuesday, 8 October, with up to 50 “shooting stars” expected to be visible every hour.\n\nNamed after the constellation Draco, the annual event usually peaks in the first week of October and is best viewed after sunset in an area with a clear sky.\n\nIt is caused by the Earth passing through a cloud of space debris left behind by Comet Giacobini-Zinner and is usually visible to people on the ground for around four days. Meteors burning up through the Earth’s atmosphere is what gives the impression of shooting stars.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHow impressive the spectacle is depends on a variety of factors, including how close Earth passes inside the comet’s orbit.\n\nThe most spectacular October Draconids took place in 1933 and 1946, when thousands of meteors were visible each hour.\n\nShape Created with Sketch. Nasa's most stunning pictures of space Show all 30 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Nasa's most stunning pictures of space 1/30 Solar Flare An image from Nasa's Solar Dynamics Observatory (SDO) shows a 200,000 mile long solar filament ripping through the Sun's corona in September 2013 Nasa 2/30 Nasa Celebrates 50 Years of Spacewalking For 50 years, NASA has been \"suiting up\" for spacewalking. In this 1984 photograph of the first untethered spacewalk, NASA astronaut Bruce McCandless is in the midst of the first \"field\" tryout of a nitrogen-propelled backpack device called the Manned Maneuvering Unit (MMU) Nasa 3/30 A Hubble Cosmic Couple The spectacular cosmic pairing of the star Hen 2-427 — more commonly known as WR 124 — and the nebula M1-67 which surrounds it ESA/Hubble & NASA 4/30 Veil Nebula Supernova Remnant Nasa's Hubble Space Telescope has unveiled in stunning detail a small section of the Veil Nebula - expanding remains of a massive star that exploded about 8,000 years ago 5/30 The Soyuz TMA-15M rocket launch The Soyuz TMA-15M rocket launches from the Baikonur Cosmodrome in Kazakhstan on Monday, Nov. 24, 2014, carrying three new astronauts to the International Space Station. It also took caviar, ready for the satellite's inhabitants to celebrate the holidays Nasa 6/30 Earth from the ISS From the International Space Station, Expedition 42 Flight Engineer Terry W. Virts took this photograph of the Gulf of Mexico and U.S. Gulf Coast at sunset Nasa 7/30 Black Hole Friday Nasa celebrated Black Friday by looking into space instead — sharing pictures of black holes Nasa 8/30 NuSTAR X-rays stream off the sun in this image showing observations from by NASA's Nuclear Spectroscopic Telescope Array, or NuSTAR, overlaid on a picture taken by NASA's Solar Dynamics Observatory (SDO) Nasa 9/30 Cassiopeia A c A false colour image of Cassiopeia A comprised with data from the Spitzer and Hubble Space Telescopes and the Chandra X-Ray observatory Nasa 10/30 Orion Capsule splashes down The Orion capsule jetted off into space before heading back a few hours later — having proved that it can be used, one day, to carry humans to Mars Nasa 11/30 Earth Observations From Gemini IV in 1965 This photograph of the Florida Straits and Grand Bahama Bank was taken during the Gemini IV mission during orbit no. 19 in 1965. The Gemini IV crew conducted scientific experiments, including photography of Earth's weather and terrain, for the remainder of their four-day mission following Ed White's historic spacewalk on June 3 12/30 Frosty slopes of Mars This image of an area on the surface of Mars, approximately 1.5 by 3 kilometers in size, shows frosted gullies on a south-facing slope within a crater. The image was taken by Nasa's HiRISE camera, which is mounted on its Mars Reconaissance Orbiter Nasa 13/30 Yellowstone from space NASA astronaut Reid Wiseman shared this image of Yellowstone via his twitter account Nasa 14/30 Saturn This near-infrared color image shows a specular reflection, or sunglint, off of a hydrocarbon lake named Kivu Lacus on Saturn's moon Titan Nasa 15/30 Worlds Apart Although Mimas and Pandora, shown here, both orbit Saturn, they are very different moons. Pandora, \"small\" by moon standards (50 miles or 81 kilometers across) is elongated and irregular in shape. Mimas (246 miles or 396 kilometers across), a \"medium-sized\" moon, formed into a sphere due to self-gravity imposed by its higher mass Nasa 16/30 Solar Flare An X1.6 class solar flare flashes in the middle of the sun in this image taken 10 September, captured by NASA's Solar Dynamics Observatory Nasa 17/30 Large Magellanic Cloud galaxy An image of the Large Magellanic Cloud galaxy seen in infrared light by the Herschel Space Observatory. Regions of space such as this are where new stars are born from a mixture of elements and cosmic dust Nasa 18/30 Mars Rover Spirit Nasa's Mars Rover Spirit took the first picture from Spirit since problems with communications began a week earlier. The image shows the robotic arm extended to the rock called Adirondack Nasa 19/30 Morning Aurora From the Space Station Nasa astronaut Scott Kelly captured this photograph of the green lights of the aurora from the International Space Station 20/30 Launch of History - Making STS-41G Mission in 1984 The Space Shuttle Challenger launches from Florida at dawn. On this mission, Kathryn Sullivan became the first U.S. woman to perform a spacewalk and Marc Garneau became the first Canadian in space. The crew of seven was the largest to fly on a spacecraft at that time, and STS-41G was the first flight to include two female astronauts 21/30 A Fresh Perspective on an Extraordinary Cluster of Galaxies Galaxy clusters are often described by superlatives. After all, they are huge conglomerations of galaxies, hot gas, and dark matter and represent the largest structures in the Universe held together by gravity 22/30 Hubble Sees a Galactic Sunflower The arrangement of the spiral arms in the galaxy Messier 63, seen here in an image from the Nasa Hubble Space Telescope, recall the pattern at the center of a sunflower ESA/Hubble & NASA 23/30 Pluto image Four images from New Horizons’ Long Range Reconnaissance Imager (LORRI) were combined with colour data from the Ralph instrument to create this enhanced colour global view of Pluto 24/30 Fresh Crater Near Sirenum Fossae Region of Mars The HiRISE camera aboard Nasa's Mars Reconnaissance Orbiter acquired this closeup image of a \"fresh\" (on a geological scale, though quite old on a human scale) impact crater in the Sirenum Fossae region of Mars. This impact crater appears relatively recent as it has a sharp rim and well-preserved ejecta 25/30 Hubble Peers into the Most Crowded Place in the Milky Way This Nasa Hubble Space Telescope image presents the Arches Cluster, the densest known star cluster in the Milky Way NASA & ESA 26/30 An Astronaut's View from Space Nasa astronaut Reid Wiseman tweeted this photo from the International Space Station on 2 September 2014 27/30 Giant Landform on Mars On Mars, we can observe four classes of sandy landforms formed by the wind, or aeolian bedforms: ripples, transverse aeolian ridges, dunes, and what are called “draa” 28/30 Expedition 39 Landing A sokol suit helmet can be seen against the window of the Soyuz TMA-11M capsule shortly after the spacecraft landed with Expedition 39 Commander Koichi Wakata of the Japan Aerospace Exploration Agency (JAXA), Soyuz Commander Mikhail Tyurin of Roscosmos, and Flight Engineer Rick Mastracchio of NASA near the town of Zhezkazgan, Kazakhstan (NASA/Bill Ingalls) 29/30 Jupiter's Great Red Spot Viewed by Voyager I Jupiter is the largest planet in the solar system and perhaps the most majestic. Vibrant bands of clouds carried by winds that can exceed 400 mph continuously circle the planet's atmosphere 30/30 Chandra Observatory Sees a Heart in the Darkness This Chandra X-Ray Observatory image of the young star cluster NGC 346 highlights a heart-shaped cloud of 8 million-degree Celsius gas in the central region 1/30 Solar Flare An image from Nasa's Solar Dynamics Observatory (SDO) shows a 200,000 mile long solar filament ripping through the Sun's corona in September 2013 Nasa 2/30 Nasa Celebrates 50 Years of Spacewalking For 50 years, NASA has been \"suiting up\" for spacewalking. In this 1984 photograph of the first untethered spacewalk, NASA astronaut Bruce McCandless is in the midst of the first \"field\" tryout of a nitrogen-propelled backpack device called the Manned Maneuvering Unit (MMU) Nasa 3/30 A Hubble Cosmic Couple The spectacular cosmic pairing of the star Hen 2-427 — more commonly known as WR 124 — and the nebula M1-67 which surrounds it ESA/Hubble & NASA 4/30 Veil Nebula Supernova Remnant Nasa's Hubble Space Telescope has unveiled in stunning detail a small section of the Veil Nebula - expanding remains of a massive star that exploded about 8,000 years ago 5/30 The Soyuz TMA-15M rocket launch The Soyuz TMA-15M rocket launches from the Baikonur Cosmodrome in Kazakhstan on Monday, Nov. 24, 2014, carrying three new astronauts to the International Space Station. It also took caviar, ready for the satellite's inhabitants to celebrate the holidays Nasa 6/30 Earth from the ISS From the International Space Station, Expedition 42 Flight Engineer Terry W. Virts took this photograph of the Gulf of Mexico and U.S. Gulf Coast at sunset Nasa 7/30 Black Hole Friday Nasa celebrated Black Friday by looking into space instead — sharing pictures of black holes Nasa 8/30 NuSTAR X-rays stream off the sun in this image showing observations from by NASA's Nuclear Spectroscopic Telescope Array, or NuSTAR, overlaid on a picture taken by NASA's Solar Dynamics Observatory (SDO) Nasa 9/30 Cassiopeia A c A false colour image of Cassiopeia A comprised with data from the Spitzer and Hubble Space Telescopes and the Chandra X-Ray observatory Nasa 10/30 Orion Capsule splashes down The Orion capsule jetted off into space before heading back a few hours later — having proved that it can be used, one day, to carry humans to Mars Nasa 11/30 Earth Observations From Gemini IV in 1965 This photograph of the Florida Straits and Grand Bahama Bank was taken during the Gemini IV mission during orbit no. 19 in 1965. The Gemini IV crew conducted scientific experiments, including photography of Earth's weather and terrain, for the remainder of their four-day mission following Ed White's historic spacewalk on June 3 12/30 Frosty slopes of Mars This image of an area on the surface of Mars, approximately 1.5 by 3 kilometers in size, shows frosted gullies on a south-facing slope within a crater. The image was taken by Nasa's HiRISE camera, which is mounted on its Mars Reconaissance Orbiter Nasa 13/30 Yellowstone from space NASA astronaut Reid Wiseman shared this image of Yellowstone via his twitter account Nasa 14/30 Saturn This near-infrared color image shows a specular reflection, or sunglint, off of a hydrocarbon lake named Kivu Lacus on Saturn's moon Titan Nasa 15/30 Worlds Apart Although Mimas and Pandora, shown here, both orbit Saturn, they are very different moons. Pandora, \"small\" by moon standards (50 miles or 81 kilometers across) is elongated and irregular in shape. Mimas (246 miles or 396 kilometers across), a \"medium-sized\" moon, formed into a sphere due to self-gravity imposed by its higher mass Nasa 16/30 Solar Flare An X1.6 class solar flare flashes in the middle of the sun in this image taken 10 September, captured by NASA's Solar Dynamics Observatory Nasa 17/30 Large Magellanic Cloud galaxy An image of the Large Magellanic Cloud galaxy seen in infrared light by the Herschel Space Observatory. Regions of space such as this are where new stars are born from a mixture of elements and cosmic dust Nasa 18/30 Mars Rover Spirit Nasa's Mars Rover Spirit took the first picture from Spirit since problems with communications began a week earlier. The image shows the robotic arm extended to the rock called Adirondack Nasa 19/30 Morning Aurora From the Space Station Nasa astronaut Scott Kelly captured this photograph of the green lights of the aurora from the International Space Station 20/30 Launch of History - Making STS-41G Mission in 1984 The Space Shuttle Challenger launches from Florida at dawn. On this mission, Kathryn Sullivan became the first U.S. woman to perform a spacewalk and Marc Garneau became the first Canadian in space. The crew of seven was the largest to fly on a spacecraft at that time, and STS-41G was the first flight to include two female astronauts 21/30 A Fresh Perspective on an Extraordinary Cluster of Galaxies Galaxy clusters are often described by superlatives. After all, they are huge conglomerations of galaxies, hot gas, and dark matter and represent the largest structures in the Universe held together by gravity 22/30 Hubble Sees a Galactic Sunflower The arrangement of the spiral arms in the galaxy Messier 63, seen here in an image from the Nasa Hubble Space Telescope, recall the pattern at the center of a sunflower ESA/Hubble & NASA 23/30 Pluto image Four images from New Horizons’ Long Range Reconnaissance Imager (LORRI) were combined with colour data from the Ralph instrument to create this enhanced colour global view of Pluto 24/30 Fresh Crater Near Sirenum Fossae Region of Mars The HiRISE camera aboard Nasa's Mars Reconnaissance Orbiter acquired this closeup image of a \"fresh\" (on a geological scale, though quite old on a human scale) impact crater in the Sirenum Fossae region of Mars. This impact crater appears relatively recent as it has a sharp rim and well-preserved ejecta 25/30 Hubble Peers into the Most Crowded Place in the Milky Way This Nasa Hubble Space Telescope image presents the Arches Cluster, the densest known star cluster in the Milky Way NASA & ESA 26/30 An Astronaut's View from Space Nasa astronaut Reid Wiseman tweeted this photo from the International Space Station on 2 September 2014 27/30 Giant Landform on Mars On Mars, we can observe four classes of sandy landforms formed by the wind, or aeolian bedforms: ripples, transverse aeolian ridges, dunes, and what are called “draa” 28/30 Expedition 39 Landing A sokol suit helmet can be seen against the window of the Soyuz TMA-11M capsule shortly after the spacecraft landed with Expedition 39 Commander Koichi Wakata of the Japan Aerospace Exploration Agency (JAXA), Soyuz Commander Mikhail Tyurin of Roscosmos, and Flight Engineer Rick Mastracchio of NASA near the town of Zhezkazgan, Kazakhstan (NASA/Bill Ingalls) 29/30 Jupiter's Great Red Spot Viewed by Voyager I Jupiter is the largest planet in the solar system and perhaps the most majestic. Vibrant bands of clouds carried by winds that can exceed 400 mph continuously circle the planet's atmosphere 30/30 Chandra Observatory Sees a Heart in the Darkness This Chandra X-Ray Observatory image of the young star cluster NGC 346 highlights a heart-shaped cloud of 8 million-degree Celsius gas in the central region\n\nFor this year’s Draconids meteor shower, a full moon will make it harder to see some of the duller meteors, while clouds over the UK on Tuesday and Wednesday will obscure the sky.\n\nThe sky is expected to clear later in the week, with Thursday night perhaps offering the best opportunity for stargazers.\n\nThe National Space Centre described the Draconids as hit or miss when it comes to the intensity of the shooting stars.\n\n“While the Draconids are normally quite a minor meteor shower, they have been known to produce spectacular outbursts of hundreds or even thousands of meteors per hour,” the organisation wrote in a blog post.\n\n“We’re not expecting any outbursts in 2019, but meteor shower outbursts are notoriously hard to predict, so you never know.”\n\nWhile best viewed from the Northern Hemisphere, the Draconids will also be visible to a lesser extent in the Southern Hemisphere.\n\nThe shower will also coincide with the more modest Southern Taurids, which will peak on Wednesday night and are best viewed from the Southern Hemisphere.\n\nAccuWeather astronomy blogger Dave Samuhel described the Draconids as a “good shower for younger stargazers, especially since the shower peaks on a school night”.\n\nLater in October will see the arrival of the Orionid meteor shower, which is expected to peak on Monday, 21 October.", "description": "The 2019 Draconids meteor shower is set to light up the night’s sky on Tuesday, 8 October, with up to 50 “shooting stars” expected to be visible every hour. Named after the constellation Draco, the annual event usually peaks in the first week of October and is best viewed after sunset in an area with a clear sky.", "authors": ["Anthony Cuthbertson"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/08/12/draconids-meteor-shower-2019-when-where.jpg", "published_at": "2019-10-08"}