{"pub": "thenextweb", "url": "https://thenextweb.com/hardfork/2019/10/04/consensys-acquires-infura-the-centralizing-tech-powering-ethereum-dapps", "downloaded_at": "2019-10-05 13:09:22.172399+00:00", "title": "ConsenSys acquires Infura, the centralizing tech powering Ethereum dapps", "language": "en", "text": "Ethereum-focused software firm ConsenSys has fully acquired Infura, the company that’s previously been described as the network’s most centralized layer.\n\nThe company announced the acquisition news via a blog post today.\n\n“…We’ve decided that a future inside ConsenSys is the best future for our team, our users and this rapidly emerging ecosystem,” the post reads.\n\n“As a result, we are pleased to announce that ConsenSys has formally acquired all of the rights to Infura and Infura will continue as a wholly owned business unit within ConsenSys,” it adds.\n\nWhile the acquisition may indeed spell good news for both companies involved, it’s likely it will ruffle feathers among decentralization supporters, following claims about Infura’s alleged centralization.\n\nFor one, ConsenSys was founded by Ethereum ETH co-founder Joseph Lubin, who had previously invested in Infura.\n\nFurther, as of December last year, Infura was thought to handle approximately 13 billion code requests per day, underpinning most apps running on the Ethereum blockchain.\n\nMichael Wuehler, the company‘s co-founder, told CoinDesk at the time that the firm accounted for “somewhere between 5 and 10 percent of the nodes.”\n\nOn one hand, ConsenSys acquiring Infura makes sense, considering it’s the software firm powering Ethereum’s development. It remains to be seen, however, if addressing how centralizing Infura is for the network becomes a priority.\n\nWant more Hard Fork? Join us in Amsterdam on October 15-17 to discuss blockchain and cryptocurrency with leading experts.", "description": "Ethereum-focused software firm ConsenSys has fully acquired Infura, the company that’s previously been described as the network’s most centralized layer.", "authors": ["Yessi Bello Perez", "October"], "top_image": "https://img-cdn.tnwcdn.com/image/hardfork?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2FUntitled-design-90.jpg&signature=e70bac94ffb55f1b7615808519888ab5", "published_at": "2019-10-04"}