{"pub": "reuters", "url": "https://in.reuters.com/article/britain-bodies-journey/from-bubble-tea-to-disaster-how-one-vietnamese-dreamer-apparently-met-her-fate-idINKBN1X602W", "downloaded_at": "2019-10-27 04:05:57.993988+00:00", "title": "From bubble tea to disaster: How one Vietnamese dreamer apparently met her fate", "language": "en", "text": "HANOI (Reuters) - In Berlin she posed outside a beer garden, a beaming smile upon her face. In Brussels she sipped sugary bubble tea and posed on the steps of the old stock exchange.\n\nA relative shows a picture taken in Berlin of Anna Bui Thi Nhung (R), a Vietnamese suspected to be among dead victims found in a lorry in Britain, at her home in Nghe An province, Vietnam October 26, 2019. REUTERS/Kham\n\nTo anyone else, she was another tourist.\n\nBut Vietnamese 19-year-old Bui Thi Nhung, whose family believe she was one of the 39 people found dead in a refrigerated truck near London on Wednesday, it was the make-or-break trip of a lifetime.\n\n“Being grown up means having to hide your sadness in the dark, and keeping a smile on your face,” Nhung wrote in an Oct. 21 Facebook post, days before her family lost contact with her and the news of the doomed shipping container emerged.\n\nFrom interviews with her family, and a series of messages left on her social media accounts, Reuters has pieced together the last movements of one of the young Vietnamese migrants thought by relatives to be among the dead.\n\nNhung was from Nghe An, a poor province 300 km (190 miles) south of Hanoi, Vietnam’s rapidly developing capital.\n\nOn Saturday evening, Catholic priest Anthony Dang Huu Nam led around 500 worshippers in prayers for the dead as they held lit candles in the modest, white-walled church in Yen Thanh, Nhung’s hometown.\n\nMany have made the same fateful journey. Britain’s ambassador to Vietnam wrote in an opinion piece published last month by local papers that the dangers were clear.\n\n“In recent years, hundreds of potential Vietnamese victims of trafficking have been identified in the UK,” Ambassador Gareth Ward wrote in the Sept. 29 column.\n\n“There are cases of illegal immigrants suffering injuries when being chased. There are cases of death due to extreme cold, lack of oxygen inside lorries. Many never even set foot in the ‘promised land’,” Ward wrote, referring to guarantees made by Vietnamese people smugglers to resettle migrants in Britain.\n\nNhung’s family said she first left Nghe An on her journey overseas in August. She went to China first, before eventually making her way to Germany, then Belgium, where they believe she boarded the fated truck.\n\nOfficials in Britain have not yet identified the dead.\n\n“I just want a peaceful life,” Nhung wrote in a caption beneath a photo of her smiling in a green field a few weeks after leaving Vietnam.\n\n“The happiest thing in life is finding someone who doesn’t abandon you during your hardest time,” she said, on Aug. 27.\n\n‘LIVING FREELY’\n\nLate on Saturday night, Nhung’s family, devoid of hope, set up an altar in her memory, with her photo next to her father’s.\n\nHer father died of cancer a few years ago. Her mother was unable to work because of health complications and so her loved ones clubbed together to finance a new life overseas, Nhung’s family told Reuters.\n\n“Nhung didn’t have the qualifications to get a good job with handsome pay. Nor do her friends and many others here,” said Nhung’s uncle, Hoang Binh. “Going abroad and sending back money was the only choice,” he added.\n\nIt was not clear what sort of work was lined up for Nhung.\n\nSome 70% of Vietnamese trafficking cases in the UK between 2009 and 2016 were for labour exploitation, including cannabis production and work in nail bars, according to a British government report last year.\n\n“Women and girls from rural areas are also considered more susceptible to trafficking,” the report said.\n\nBy early September, it was not clear where she was, but Nhung was already well into her trip, and reflecting on her next steps.\n\nBeside a stock image of two children flying kites at sunset, she posted:\n\n“As I grow up, I see that life is not as peaceful as I used to think. When I grow up, I want to go back to my childhood, when I lived freely”.\n\nPINK TO BLACK\n\nIn one of her first pictures more clearly taken from the start of her adventure in Europe, Nhung posed in front of a German beer garden. Days later, in late September, she posted photos of Vietnamese noodle dishes she said she had cooked for friends in Berlin.\n\n“If anyone wants to buy one, I’ll ship it to you,” she joked in the Facebook post.\n\nTon Quang Tuan, one of Nhung’s friends living in Berlin, said that “We went out a few times when Nhung was in Berlin” and added that “she was in a good mood, very happy,” but they lost contact after she said she had to leave for Britain.\n\nIt was not clear how Nhung had travelled from the Vietnamese countryside to China and then Berlin, but the German capital has emerged in recent years as a staging ground for Vietnamese and other migrants looking to start new lives in Britain.\n\n“I feel lonely in the place I used to dream of everyday,” Nhung wrote on Sept. 25.\n\nIt was unclear where she was - Vietnamese smugglers are said to advise their subjects to live discreetly and not to give away too many clues in order to evade detection from the authorities.\n\n“I don’t know when I can get used to my current life, but I do know one thing for sure. At this moment, I miss you dad. I miss you like crazy.”\n\nA few days later, Nhung was pictured outside Berlin Cathedral with a cup of bubble tea in her hands. The sweetened, milky tea filled with balls of chewy jelly is hugely popular amongst Vietnamese youth.\n\nBy late October, Nhung was in Belgium. She posted photos of herself, again with a cup of bubble tea in her hand, excitedly exploring the sights of Brussels, including the old stock exchange and the bustling Rue Auguste Orts thoroughfare.\n\nIt was from the Belgian port of Zeebrugge that the doomed container eventually departed. Her family believe that she was on board.\n\nIn Berlin, Nhung wrote:\n\n“Back in Vietnam, I thought Europe was pink”.\n\n“But it turns out it’s black”.", "description": "In Berlin she posed outside a beer garden, a beaming smile upon her face. In Brussels she sipped sugary bubble tea and posed on the steps of the old stock exchange.", "authors": ["James Pearson", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191027&t=2&i=1445381513&w=1200&r=LYNXMPEF9Q05A", "published_at": "2019-10-27"}