{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/stocks/15-third-tier-tech-stocks-ripe-for-shorting-15139789", "downloaded_at": "2019-10-24 23:52:19.819158+00:00", "title": "15 'Third-Tier' Tech Stocks Ripe for Shorting", "language": "en", "text": "Third-tier tech. I recommended shorting that subsector in a Real Money column two weeks ago, and now, as I am benefiting from those trades, I should explain what I meant by that label.\n\nI don't think anyone needs a primer on the denizens of the first-tier tech strata. The MAFANG names - Microsoft (MSFT) , Apple (AAPL) , Facebook (FB) , Amazon (AMZN) , Netflix (NFLX) , Alphabet (GOOGL) (parent company of Google) -- represent one-sixth of the value of the S&P 500. That cohort includes the numbers 1, 2, 3,4, and 7-8 (Alphabet is counted twice owing to its multi-class share structure) largest stocks in the S&P 500. Netflix is only No. 40 on that list, but since it's included as part of these acronyms, I will stick with MAFANG and include Netflix with the big boys.\n\nSecond-tier tech would include a number of the semis (Texas Instruments (TXN) , Nvidia (NVDA) , etc.) Oracle (ORCL) , Broadcom (AVGO) , and a few others. Not large enough to be systemically important as the MAFANGs are, but profitable and worth following, nonetheless. Broadcom is the 50th largest stock in the S&P 500, and carries a current market cap of $110 billion, so let's limit the second-tier techs to those with market caps in excess of $100 billion.\n\nSo, in the market cap bracket between $5 billion and $100 billion sit some of the most egregiously overvalued, economically inefficient bubble stocks in this peaking market. Several of them are new: Uber Technologies (UBER) , Lyft (LYFT) , Slack (WORK) , Peloton (PTON) and the poster child for overvaluation, Beyond Meat (BYND) . Every single one has crashed following its 2019 IPO.\n\nAs BYND shares are being rightfully eviscerated, losing more than a third of their value in the past three weeks, one could question whether the Beyond Burger qualifies as a tech product. When BYND was trading above $220 as recently as July, though, the market was certainly valuing it as a \"disruptive\" name, so I include it on this list.\n\nWhat about the more established names?\n\nWell, \"established\" is in the eye of the beholder, but I would certainly put Snap Inc. (SNAP) -- in the IPO class of March 2017 -- on that list. I took a bearish position in SNAP shares into its Tuesday night earnings report and was listening to the group SNAP!'s seminal 1990 hit \"I Got the Power\" all day on Wednesday.\n\nTwitter (TWTR) , IPO class of 2013, also falls into that category, and I am kicking myself for not having a bearish position ahead of TWTR's awful earnings report Thursday morning.\n\nMaking profitable trades does indeed give one the power, but, as I often note in my Real Money columns, the most important play is the next play.\n\nSo, what third-tier techs are ripe for shorting -- I prefer to write options contracts against them, also a bearish strategy, as I did with Snap -- in this quarter's earnings season?\n\n\"All of them\" is not a great answer, although I wouldn't fight anyone on that response, but here are some more specific ideas:\n\nApplication Software\n\nIn more than a quarter century of following stocks, I have only seen a group so ridiculously overvalued once -- dotcom names in 2000. According to research from Crescat Capital, the application software group is currently trading at an astounding 66x enterprise value-to-free cash flow multiple. That's bananas, so take your pick among this group.\n\nI made terrific profits on a bearish position in Workday (WDAY) going into its fiscal second-quarter earnings, and I look to short again when the company reports (no date announced yet) third-quarter earnings. WDAY shares are rising Thursday on the back of an analyst upgrade, and that is the perfect time to initiate a short position.\n\nOther names in this sector are Atlassian Corp. (TEAM) , Nutanix (NTNX) , Cloudera (CLDR) and Twilio (TWLO) , and I am looking to get short in front of reports from as many names as I can.\n\nSoftware-as-a-Service\n\nSoftware as a service may be au courant, but those companies, as Warren Buffett would say, have no moat. Beyond Meat also has no barriers to entry in its market (nor even a contract for supply of its key feedstock, yellow peas) and fellow 2019 IPOs Zoom Video Communications (ZM) , Pinterest (PINS) and CrowdStrike Holdings (CRWD) also seem to lack moats in their industries. I believe there is more downside in each of those names.\n\nSo, that's a non-comprehensive list of 15 third-tier tech names. I have already made profit betting against SNAP this quarter, and will continue to scour those other 14 names for the exact entry points (the day before an earnings release is usually a good one) for bearish positions on them, as well.", "description": "15 'Third-Tier' Tech Stocks Ripe for Shorting...MSFT", "authors": ["Jim Collins", "'Third-Tier' Tech Stocks Ripe For Shorting", "In The Market Cap Bracket Between", "Billion", "Billion Sit Some Of The Most Egregiously Overvalued", "Economically Inefficient Bubble Stocks In This Peaking Market.", "Stocks Quotes In This Article", "Jim Cramer", "James", "Rev Shark"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/7520a5c2-cf14-11e9-805f-4f34949680b7.jpg", "published_at": "2019-10-24"}