{"pub": "independent", "url": "https://independent.co.uk/life-style/mental-health-day-jessica-kellgren-fozard-happiness-youtube-disabilities-a9150091.html", "downloaded_at": "2019-10-10 15:23:56.184253+00:00", "title": "World Mental Health Day: YouTuber with physical disabilities shares secrets to happiness", "language": "en", "text": "YouTuber Jessica Kellgren-Fozard has teamed up with emotional wellbeing organisation The School of Life to reveal her “secrets to happiness” in a short film narrated by philosopher and author Alain de Botton.\n\nKellgren-Fozard, who has more than 557,000 subscribers on YouTube, is deaf, partially visually impaired and has a nerve disorder, hereditary neuropathy with liability to pressure palsy (HNPP). She also has a rare autoimmune condition, mixed connective tissue disease (MCTD).\n\nDue to her medical conditions, Kellgren-Fozard sometimes has to use a mobility aid, such as a wheelchair.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nNow, along with several other YouTube creators, Kellgren-Fozard has shared the seven things that make her happy, including finding human connections and showing appreciation for the positive parts in life.\n\n“Because I’ve had health problems, I’ve had to learn to find happiness when my body is trying to bring me down,” she explains in the film. “As such, I’ve developed a pretty unique perspective on what actually makes us happy.”\n\nShape Created with Sketch. Sow Ay illustrations on mental health Show all 18 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Sow Ay illustrations on mental health 1/18 2/18 3/18 4/18 5/18 6/18 7/18 8/18 9/18 10/18 11/18 12/18 13/18 14/18 15/18 16/18 17/18 18/18 1/18 2/18 3/18 4/18 5/18 6/18 7/18 8/18 9/18 10/18 11/18 12/18 13/18 14/18 15/18 16/18 17/18 18/18\n\nAnother one of Kellgren-Fozard’s seven keys to happiness is acceptance. “I accept my limitations, because by setting a limit, I also set my self free within that framework that I’ve created,” she explains.\n\nFinding small pleasures is also important, Kellgren-Fozard adds, explaining that enjoying indulgences such as soaking in a warm bath or buying a beautiful dress can be hugely beneficial.\n\nFinally, Kellgren-Fozard touches on the importance of feeling love and being loved, whether that be with a romantic partner or a family member, and having modest aspirations. “I find happiness in the smallest things,” Kellgren-Fozard explains. “My wife’s smile, my puppy’s excitement, a walk on the beach at sunset, what could be happier than that?”\n\nThe short video concludes with Kellgren-Fozard pontificating about happiness, which she compares to health.\n\n“It should be something we prioritise and acknowledge takes work,” she says.\n\n“We’ve all been dealt different cards in life but only through acceptance of our misfortunes and what we’re missing can we truly see the beautiful things that we do have in life. And goodness, isn’t that lovely?”", "description": "YouTuber Jessica Kellgren-Fozard has teamed up with emotional wellbeing organisation The School of Life to reveal her “secrets to happiness” in a short film narrated by philosopher and author Alain de Botton.", "authors": ["Olivia Petter"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/10/10/happiness2.png", "published_at": "2019-10-10"}