{"pub": "yahoo", "url": "https://finance.yahoo.com/news/square-welcomes-pot-businesses-digital-190416023.html", "downloaded_at": "2019-10-05 00:00:49.270472+00:00", "title": "Square Enters CBD Business to Ride a Booming Industry", "language": "en", "text": "(Bloomberg) -- Square Inc. has become one of the first U.S. payments platforms doing business with CBD providers, just as the industry is booming.\n\nThe company this week started allowing U.S. businesses to sell cannabidiol products on its platform while keeping track of payment and inventory management. CBD derived from hemp was legalized last year, while the intoxicating THC compound remains illegal at the federal level.\n\n“We saw this as an opportunity to make our tools available to sellers” in the industry, Square said in a statement.\n\nThe move comes as more states legalize marijuana, unleashing a surge in demand. The legal marijuana market, estimated at $13.8 billion globally last year, is expected to increase at 24% annually by 2025, according to Grand View Research. Payment is also getting easier. Last month, the U.S. House advanced a bill designed to let banks do business with cannabis companies in states that permit marijuana sales, a step that some supporters see as helping to pave the way to nationwide legalization.\n\nShares of Square climbed 3.7% as of 2:41 p.m. in New York, extending their gains for the year to 11%.\n\n(Corrects to show Square is doing business with CBD providers.)\n\n--With assistance from Kristine Owram.\n\nTo contact the reporter on this story: Jarrell Dillard in New York at jdillard11@bloomberg.net\n\nTo contact the editors responsible for this story: Courtney Dentch at cdentch1@bloomberg.net, Lu Wang, Catherine Larkin\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Square Inc. has become one of the first U.S. payments platforms doing business with CBD providers, just as the industry is booming.The company this week started allowing U.S. businesses to sell cannabidiol products on its platform while keeping track of payment and inventory management", "authors": ["Jarrell Dillard"], "top_image": "https://s.yimg.com/uu/api/res/1.2/r.WPo4Bn9IfHJgZN3nt13w--~B/aD0xMzMzO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/228adc416f17c9215e384db57994962e", "published_at": "2019-10-03"}