{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/mom-tracking-companies-at-risk-of-salary-default-salary-claims-dipped-in-2018 ", "downloaded_at": "2019-10-11 06:57:40.131877+00:00", "title": "MOM tracking companies at risk of salary default; salary claims dipped in 2018", "language": "en", "text": "SINGAPORE employers deemed to be at higher risk of defaulting on salaries are now required to declare to the Manpower Ministry (MOM) whether they have been paying salaries on time.\n\nThe ministry has sent out about 200 letters per quarter this year to such employers identified using data analytics - from red flags such as paying foreign worker levies late, or being in financial difficulty.\n\nIf the companies declare they are up to date in salary payments but workers later lodge claims, the companies can be punished for making false declarations.\n\nIn a pilot run last year involving 100 construction companies, 123 salary arrear cases were detected in four companies before workers approached the Tripartite Alliance for Dispute Management (TADM) for assistance, and S$300,000 in salary arrears was recovered early.\n\nsentifi.com Market voices on:\n\nThis is among new enforcement strategies besides physical inspections, taken by the MOM to raise compliance with the Employment Act, listed in the inaugural Employment Standards Report released on Friday by MOM and TADM.\n\nAnother strategy is for TADM to place more weight on workers' evidence or claims during disputes, if employers do not keep or produce legally required documents such as on working hours.\n\nSince six months ago, employers with less severe offences must attend corrective clinics by the Tripartite Alliance for Fair and Progressive Employment Practices, where they are educated on their legal obligations.\n\nTADM general manager Kandhavel Periyasamy said the response to errant companies is decided on a case-by-case basis. For instance, for minor offences such as not issuing itemised payslips even though salaries are paid, if the ministry were to prevent the company from hiring new foreign workers, it may be unable to secure new projects and this would affect the livelihoods of its workers.\n\n\"We need to look at the nature of the offence, is there also going to be impact on the workers as well...but if you deliberately try to harm workers, you don't pay salary, the impact is large, (you) will not get away with it,\" he said at a media briefing on Wednesday.\n\nThe new report looks at the situation from April 1, 2017, when TADM was set up, to the end of last year. TADM mediates employment disputes before claims are lodged with the Employment Claims Tribunals (ECT).\n\nA total of 17,038 employment claims and appeals were lodged with the ministry and TADM over that period, 87 per cent of which were salary-related.\n\nThe incidence of salary claims was similar in both years, at 2.42 per 1,000 employees in 2018 and 2.49 per 1,000 employees in 2017.\n\nBut the incidence was much higher among foreign workers. Last year, it was 4.45, compared with 1.43 for local employees.\n\nForeigners made up about half of all claimants in the period covered, and about 60 per cent of them were from the construction industry, which has been suffering because of fewer public sector projects.\n\nTheir claims filed typically ranged from two to 6.5 months of salary. For local employees, the claims were mostly lower, at 0.5 to two months of salary.\n\nThe situation appears to have improved for locals. The incidence of salary claims among locals last year at 1.43 per 1,000 employees was lower than the 1.55 per 1,000 employees seen in 2017. The report attributes this to good business conditions, particularly in the manufacturing and service sectors which contributed to the bulk of local salary claims.\n\nThe most common type of salary claim lodged by foreign workers from April 2017 to December 2018 was for basic salary, which made up 90 per cent of all salary claims, followed by overtime pay, which was in 59 per cent of claims.\n\nThe report noted that one contributing factor to foreigners' claims for basic salary is employers' illegal downward adjustments of workers' salaries without their consent and without informing MOM.\n\nFor locals, the biggest problem was also basic salary, which made up 70 per cent of claims, but the next most common problem was salary in lieu of notice, which was in 26 per cent of claims.\n\nOverall, 85 per cent of salary claims were concluded within two months. When employers agreed or were ordered to make payment, 88 per cent of employees fully recovered their salaries - S$29 million in total - at TADM or ECT. The average amount they recovered was about S$4,400.\n\nFor those who only received partial or no payment, the average amount received was about S$6,900.\n\nLow-income employees who are unable to recover their salaries in full may get financial help through the MOM's Short Term Relief Fund or the Migrant Workers' Centre's Migrant Workers' Assistance Fund.\n\nMs Christine Loh, director of MOM's employment standards enforcement department, said paying employees' salaries correctly and in a timely manner is a basic responsibility of any employer.\n\n\"MOM will continue to raise awareness of good employment practices among employers and educate employees on their rights. MOM will also look at improving enforcement and dispute management mechanisms to address various workplace issues and raise Singapore's employment standards,\" she said.\n\nTHE STRAITS TIMES", "description": ": THE BUSINESS TIMES Government & Economy - SINGAPORE employers deemed to be at higher risk of defaulting on salaries are now required to declare to the Manpower Ministry (MOM) whether they have been paying salaries on time. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/all/themes/custom/businesstimes/images/BTdefault800.png", "published_at": "2019-10-11"}