{"pub": "yahoo", "url": "https://news.yahoo.com/mom-delights-6-yearold-daughter-by-wearing-unicorn-costume-at-school-bus-stop-230058245.html", "downloaded_at": "2019-09-17 23:31:06.780770+00:00", "title": "Mom delights 6-year-old daughter by wearing unicorn costume at school bus stop", "language": "en", "text": "A mother of two — and a self-described \"big kid for life\" — may have just made her daughter's entire school year when she waited for her at her school bus stop in a full unicorn costume.\n\nSomer Scandridge of Spring, Texas, has a Halloween tradition with their family. Every year, her husband matches his costume with their son, Hudson, 4, while Somer matches with their daughter, Madison, 6.\n\nThis year, Madison decided that their mother-daughter theme would be unicorns, a mythical creature of which she's become enamored.\n\nOn Friday, right before Madison was set to arrive home from school, Somer received her unicorn costume in the mail, according to KTRK.\n\n\"When I got my costume in the mail, I decided to get her from the bus stop in it,\" Somer told the station. \"She loved it!\"\n\nThe footage of the moment was captured by her husband and shared on Facebook.\n\n\"When your daughter is young enough to think you’re still cool and not embarrassing,\" Somer captioned the post.\n\nThe bus driver, spotting the dancing unicorn, started to honk their horn, supporting the creative outfit choice for the bus stop. Madison, who just happened to be sporting a unicorn backpack and headband, was all smiles as she rushed to hug her mom.\n\n\"We're a super close family and do a lot of stuff together,\" Somer said. \"I'm the mom who's a big kid at heart, so [my daughter] wasn't at all surprised that I dressed up and ran out to the bus to get her.\"\n\nSomer did not immediately respond to Yahoo Lifestyle’s requests for comment.\n\nRead more from Yahoo Lifestyle:\n\nFollow us on Instagram, Facebook, Twitter and Pinterest for nonstop inspiration delivered fresh to your feed, every day.", "description": "A mother of two surprised her 6-year-old daughter at her school bus stop by rocking an inflatable unicorn costume.", "authors": ["Hope Schreiber"], "top_image": "https://s.yimg.com/uu/api/res/1.2/C1ekYavIhb2Wx6BGVllHRg--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/video/video.wpvi.abc.news.com/576b3b539a5ae6c104e4ff8882d48db6", "published_at": "2019-09-17"}