{"pub": "reuters", "url": "https://reuters.com/article/us-harley-davidson-results/harley-davidson-tops-forecasts-as-international-sales-improve-idUSKBN1X117R", "downloaded_at": "2019-10-22 13:23:45.440058+00:00", "title": "Harley-Davidson tops forecasts as international sales improve", "language": "en", "text": "FILE PHOTO: Harley-Davidson's new electric motorcycle, LiveWire, is shown in this handout photo released by Harley-Davidson. Harley-Davidson Motor Company/Handout via REUTERS\n\n(Reuters) - Harley-Davidson Inc (HOG.N) reported better-than-expected quarterly profits on Tuesday and stuck to its full-year shipment forecast, allaying fears of another hit from European import tariffs and a further slump in sales in its main U.S. market.\n\nShares of the company rose 5.2% in premarket trading as it reported the first rise in international sales in a year and a dip of just 3.6% in U.S. retail motorcycle sales, its smallest quarterly decline in nearly three years.\n\nHarley, which has been criticized by President Donald Trump for its plan to shift some U.S. production overseas, has been battling the effects of global trade wars on its business while sales at home dwindle as its core customers age.\n\nEarlier this year, Harley said retaliatory import duties imposed by the European Union on its bikes would cost the company between $100 million and $120 million in 2019.\n\nIt still reported a 24% drop in quarterly profit, but excluding items the company earned 70 cents per share, beating analysts’ expectations of 52 cents per share.\n\nRevenue from motorcycles and related products overall fell 4.9% to $1.07 billion.\n\nInternational retail sales rose 2.7% to 23,619 motorcycle in the third quarter, the first rise in a year.", "description": "Harley-Davidson Inc reported better-than-expected quarterly profits on Tuesday and stuck to its full-year shipment forecast, allaying fears of another hit from European import tariffs and a further slump in sales in its main U.S. market.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191022&t=2&i=1443707316&w=1200&r=LYNXMPEF9L0XC", "published_at": "2019-10-22"}