{"pub": "breitbart", "url": "https://breitbart.com/faith/2019/10/29/three-abrahamic-religions-sign-landmark-text-condemning-euthanasia", "downloaded_at": "2019-10-29 13:58:50.524222+00:00", "title": "Three ‘Abrahamic’ Religions Sign Landmark Text Condemning Euthanasia", "language": "en", "text": "ROME — Leaders of the Jewish, Christian, and Muslim faiths signed a joint declaration in the Vatican Monday condemning euthanasia and assisted suicide as “inherently” evil acts that should be prohibited.\n\n“The three Abrahamic monotheistic religions share common goals and are in complete agreement in their approach to end-of-life situations,” says the document, which was submitted to Pope Francis.\n\n“We oppose any form of euthanasia – that is the direct, deliberate and intentional act of taking life – as well as physician-assisted suicide – that is the direct, deliberate and intentional support of committing suicide – because they fundamentally contradict the inalienable value of human life, and therefore are inherently and consequentially morally and religiously wrong, and should be forbidden without exceptions,” it reads.\n\nThe text also explicitly supports religious liberty and conscientious objection to immoral actions, insisting that medical professionals should never be forced into acting against moral conscience.\n\n“No health care provider should be coerced or pressured to either directly or indirectly assist in the deliberate and intentional death of a patient through assisted suicide or any form of euthanasia, especially when it is against the religious beliefs of the provider,” the document states.\n\n“Moral objections regarding issues of life and death certainly fall into the category of conscientious objection that should be universally respected,” it added.\n\nThe document was signed by representatives of the three “Abrahamic religions,” a term deriving from the Old Testament biblical figure Abraham, who is recognized by Jews, Christians, Muslims and others.\n\nOriginally proposed by Rabbi Avraham Steinberg — bioethicist, pediatrician, neurologist, and co-president of Israel’s National Bioethics Council — the text was signed by Archbishop Vincenzo Paglia for the Vatican, David Rosen for the American Jewish Committee, a representative for the Orthodox Church, and Samsul Anwar from the Indonesian Muhammadiyah, an Islamic association.\n\nAccording to Archbishop Paglia, president of the Pontifical Academy of Life, the document represents “a clear, precise affirmation that we do not want to procure the death of a patient or help them to die.”\n\nAvraham Steinberg underscored the historic nature of the text.\n\n“I think it’s by itself an historic event that the three major religions come together, talk to each other, agree on something and even sign on it,” Steinberg told a press conference.\n\nIn a letter of support, Sephardic Chief Rabbi Yitzhak Yosef wrote: “Killing terminal patients is certainly included under the prohibition ‘You shall not murder’ in the Ten Commandments. Happy is man — every man — that he was created in the Divine Image. Life is a gift from the Creator of the world which we cannot take – Heaven forfend! – from others.\n\n“However, every effort must be made to ease the suffering and the pain of patients approaching death, medically, spiritually and materially, without hastening their death,” Yosef wrote.\n\nAshkenazi Chief Rabbi David Lau wrote: “There is a severe prohibition on causing the death of any person even if he is in a difficult and terminal situation. In certain cases, it is possible to discuss refraining from prolonging life but no action may be carried out to shorten life. Whoever kills the dying, kills.”\n\nMarsudi Syuhud, secretary general of the influential Islamic association Nahdlatul Ulama, said: “Protecting life is one of the purposes of Islamic law, that’s why we don’t stop protecting life until the end of our life.”\n\nThe text itself, while denouncing euthanasia and assisted suicide, declares the moral duty to provide palliative care for terminally ill patients and to surround them with care and assistance.\n\n“We encourage and support validated and professional palliative care everywhere and for everyone,” it reads. “Even when efforts to continue staving off death seems unreasonably burdensome, we are morally and religiously duty-bound to provide comfort, effective pain and symptoms relief, companionship, care and spiritual assistance to the dying patient and to her/his family.”\n\nFollow @tdwilliamsrome", "description": "Leaders of the Jewish, Christian, and Muslim faiths signed a joint declaration condemning euthanasia and assisted suicide.", "authors": ["Thomas D. Williams"], "top_image": "https://media.breitbart.com/media/2019/10/assisted-suicide-640x335.jpg", "published_at": "2019-10-29"}