{"pub": "investing.com", "url": "https://uk.investing.com/news/stock-market-news/prudential-mg-to-spend-350-million-on-october-split-1969839", "downloaded_at": "2019-09-25 23:42:01.549801+00:00", "title": "Prudential, M&G to split in October into two FTSE 100 firms", "language": "en", "text": "By Carolyn Cohn\n\nLONDON (Reuters) - Prudential (L: ) will spin off its UK and European insurance and asset management business M&G in October, Britain's largest insurer said in a prospectus published on Wednesday, dividing the insurance giant into two large-cap stocks.\n\nPrudential, founded in 1848 to provide loans to professional workers, announced the plan to hive off its UK arm last year. The split follows a trend among insurance and asset management businesses such as Old Mutual (J: ) and Standard Life Aberdeen (L: ) to break up and simplify their operations.\n\nPrudential is planning to focus on its Asia business, while the split will allow M&G to expand globally, M&G chief executive John Foley told Reuters by phone.\n\n\"We are going to scale up operations at pace in Europe,\" Foley said, adding that the company would also look to grow in Asia and the United States.\n\nThe break-up of Prudential and M&G was \"what the market has wanted for years,\" analysts at Shore Capital said in a note, reiterating their buy rating on the stock.\n\nBut a UK fund manager said the M&G business might look in time to separate insurance and asset management, as the combination was \"an awkward hybrid\".\n\nThe split, which will leave Prudential with a one-off pre-tax bill of 350 million pounds, will be completed by Oct. 21, the prospectus said.\n\nM&G is targeting cash generation of 2.2 billion pounds over three years and dividends will be stable or increase in absolute terms over time, it said in a separate prospectus.\n\nPrudential shareholders will receive one M&G share, with both firms expected to list on the FTSE 100 index ( ).\n\nM&G directors expect to declare a 2019 ordinary dividend of 310 million pounds and a one-off dividend of 100 million pounds. Prudential expects to declare a second interim ordinary dividend of around 510 million pounds, equivalent to around 19.6 pence per share.\n\nPrudential shares were down 0.5% at 1516 GMT, compared with a 0.2% drop in the FTSE 100.", "description": "Prudential, M&G to split in October into two FTSE 100 firms", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8O183_L.jpg", "published_at": "2019-09-25"}