{"pub": "afr", "url": "https://afr.com/policy/foreign-affairs/morrison-speaks-trade-truths-to-trump-and-china-20190927-p52vha", "downloaded_at": "2019-10-05 05:58:57.200644+00:00", "title": "Morrison speaks trade truths to Trump and China", "language": "en", "text": "Prime Minister Scott Morrison had a good week. He looked assured on the biggest diplomatic stages in the White House and the UN General Assembly. He asserted Australia’s independence of thinking from both Washington and Beijing in making some important points on the trade war and how to get it resolved.\n\nThe Prime Minister did not change his language to suit his powerful hosts. He explained that our history with China is very different from that of the US. Australia does not accept the more extreme view in Washington that China is a threat to be contained. Australia’s modern prosperity came from selling the raw materials that built China into a superpower. Now the world needs China and the US to settle the differences that have come from that rise. We want to keep rules-based global trade when many around Donald Trump wish to throw the system out as hopelessly gamed. We want China to follow new rules that are more realistic, and for the US to return to a negotiated multilateral framework. Mr Morrison agrees existing rules are outdated and must reflect that China is a “newly developed country”. This is a truth that has to be dealt with, he says. Chinese officials say that’s ”absurd” when the wealth of China’s average citizen is a fraction of that of an American or an Australian. But Mr Morrison rightly says that China’s massive overseas investments, its influence on world markets and finance, and its military might – which will be on full display on next Tuesday’s anniversary of the founding of the People's Republic just seven decades ago – ‘‘are not the actions of a developing country, they are the actions of the second-largest economy in the world’’.\n\nScott and Jenny Morrison with Donald and Melania Trump in the White House corridors of power. Alex Ellinghausen\n\nThere is of course more to this fight than just WTO trading terms. Mr Morrison agrees that any new Sino-US deal has got to be ‘‘sustainable’’, which means it must deal with deeper US complaints about theft of intellectual property and the hobbling of US investors in China. This will be very hard. They go to the existential fears that are driving both sides in this fight. But China should note from this Washington visit that Mr Morrison is an interlocutor who speaks in matter-of-fact terms and tells it like he sees it. If China wants to find a way out of this trade maze, then it could do worse than issue an overdue invitation to Mr Morrison to visit Beijing.\n\nIn the long run, it is better to be inside the White House tent than outside it, even when Mr Trump is the occupant.\n\nMany allies that have been forthright with Mr Trump have been showered with Twitter abuse for their trouble. Mr Morrison has instead cemented his relationship with the world’s most unpredictable leader. The President even left Washington to appear with Mr Morrison on his American heartland turf in Ohio, at the site of a major Australian investment. As political editor Phillip Coorey noted on these pages, that can turn you into a prop for a Trump election rally. In the long run, it is better to be inside the White House tent than outside it, even when Mr Trump is the occupant. But it can become a political liability.\n\nTwo days after leaving Mr Morrison, Mr Trump suddenly faced potential impeachment. A president who thinks that rules are for other people has inevitably risked serious transgression. Did he hint that arms for the Ukrainian President to defend his country depended on digging up dirt on Mr Trump’s domestic rival Joe Biden and his son? The question may not get the political legs to affect next year’s election. Or voters may find the rule-bending of a brash outsider like Mr Trump less worrying than the hypocrisy of an insider like Mr Biden. But even if it led to, say, president Elizabeth Warren, the substance of the relationship and Australia’s zeal for trade reform should count in Washington. Barack Obama left Tony Abbott without even lunch, but the historic link survived.\n\nClimate was the other global issue that sparked anger this week as teen activist Greta Thunberg raged at the UN’s climate summit, a session Mr Morrison skipped. Mr Morrison was less sure-footed on this, because in a decade we have failed to reconcile climate and energy. But he won an election by rejecting huge renewable energy targets at any cost. We need to negotiate a compromise at home for that, too.", "description": "Scott Morrison did not change his language to suit powerful hosts. China should take note of this.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5298%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_68/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/81cbbd1bd0001863e8af3b2319fa12b848c07ad6", "published_at": "2019-09-27"}