{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/29/former-team-sky-doctor-richard-freeman-to-admit-he-told-a-lot-of-lies", "downloaded_at": "2019-10-29 15:08:05.246857+00:00", "title": "Former Team Sky doctor Richard Freeman to admit he told ‘a lot of lies’", "language": "en", "text": "The former British Cycling and Team Sky doctor Richard Freeman will admit to telling “a lot of lies” and ordering the banned supplement testosterone, an independent medical tribunal heard on Tuesday.\n\nSpeaking at the start of the rescheduled tribunal, which was postponed from February, Freeman’s representative, Mary O’Rourke QC, added that her client could previously “not bring himself to tell the truth, even to his lawyers”, before finally making a witness statement last month.\n\nQuoting Freeman, who was sat alongside her at the Manchester hearing, she added: “I am here now and this is the truth.”\n\nDuring a preliminary discussion held before the case formally opens, the Medical Practitioners Tribunal Service in Manchester heard that Freeman planned to admit many of the charges against him, including ordering 30 sachets of Testoge in May 2011 to be sent to the Manchester velodrome – and then trying to cover his tracks.\n\nFreeman, who worked for Team Sky and British Cycling between 2009 and 2017 before resigning, is also expected to accept that he made false statements and failed to keep proper records. However he is expected to deny the testosterone was purchased for a rider - and instead maintain that it was for a member of staff, who he insists needed it for medical reasons. If Freeman loses the case, which has been brought by the General Medical Council, he faces losing his doctor’s licence.\n\nMuch of the discussion on Tuesday morning centred on the charge that Freeman ordered the gel to be given to an athlete. Simon Jackson QC, for the General Medical Council said: “Your motive was to obtain testosterone to give to an athlete to improve an athlete’s performance.”\n\nHowever, Miss O’Rourke responded: “The burden is on the GMC to prove the motive they attribute. The GMC aren’t going to believe whatever he says, they are bent on saying it was doping.”\n\nMiss O’Rourke said the only GMC witness she required to cross examine was the former Team Sky coach Shane Sutton, who was also personal coach to Sir Bradley Wiggins. The GMC will call on an expert endocrinologist and will say that the member of staff had no need for the substance.\n\nThe hearing, before Chair Neil Dalton, is expected to formally open later on Tuesday and is scheduled to run until 20 December.", "description": "The former British Cycling and Team Sky doctor Richard Freeman will admit to telling ‘a lot of lies’ and ordering the banned supplement testosterone, an independent medical tribunal has heard", "authors": ["Sean Ingle"], "top_image": "https://i.guim.co.uk/img/media/d5614979453aa415e07c58c483d78d354a468039/0_376_3456_2074/master/3456.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=c4d93ec7b4ee96087f8eda7e57e02abc", "published_at": "2019-10-29"}