{"pub": "cbs", "title": "Here's what the hurricane categories mean", "url": "https://secure-fly.cbsnews.com/news/hurricane-categories-what-the-ratings-scale-means", "language": "en", "published_at": "2018-09-13", "downloaded_at": "2019-09-02 07:19:44.406024+00:00", "text": "Hurricane Dorian intensified Sunday to an extremely powerful Category 5. Hurricanes are rated on the Saffir-Simpson Hurricane Wind Scale, which includes five categories based on the storm's sustained wind speeds. It also estimates possible damage to property, ranging from \"some damage\" to \"catastrophic.\"\n\nIf a storm is a Category 3, 4 or 5, it is deemed a \"major\" hurricane due to the potential for \"significant loss of life and damage,\" the National Hurricane Center says. Hurricanes that fall into categories 1 or 2 are still considered dangerous, the center says.\n\nHere is how the scale breaks down, according to the National Hurricane Center:\n\nCategory 5 (major hurricane)\n\nSustained wind speed: 157 mph or higher\n\n\"Catastrophic damage will occur: A high percentage of framed homes will be destroyed, with total roof failure and wall collapse. Fallen trees and power poles will isolate residential areas. Power outages will last for weeks to possibly months. Most of the area will be uninhabitable for weeks or months.\"\n\n\n\nCategory 4 (major hurricane)\n\nSustained wind speed: 130-156 mph\n\n\"Catastrophic damage will occur: Well-built framed homes can sustain severe damage with loss of most of the roof structure and/or some exterior walls. Most trees will be snapped or uprooted and power poles downed. Fallen trees and power poles will isolate residential areas. Power outages will last weeks to possibly months. Most of the area will be uninhabitable for weeks or months.\"\n\n\n\nCategory 3 (major hurricane)\n\nSustained wind speed: 111-129 mph\n\n\"Devastating damage will occur: Well-built framed homes may incur major damage or removal of roof decking and gable ends. Many trees will be snapped or uprooted, blocking numerous roads. Electricity and water will be unavailable for several days to weeks after the storm passes.\"\n\n\n\nCategory 2\n\nSustained wind speed: 96-110 mph\n\n\"Extremely dangerous winds will cause extensive damage: Well-constructed frame homes could sustain major roof and siding damage. Many shallowly rooted trees will be snapped or uprooted and block numerous roads. Near-total power loss is expected with outages that could last from several days to weeks.\"\n\n\n\nCategory 1\n\nSustained wind speed: 74-95 mph\n\n\"Very dangerous winds will produce some damage: Well-constructed frame homes could have damage to roof, shingles, vinyl siding and gutters. Large branches of trees will snap and shallowly rooted trees may be toppled. Extensive damage to power lines and poles likely will result in power outages that could last a few to several days.\"\n\n\n\nIn the midst of an unusually ferocious string of hurricanes in 2017, there was some speculation about whether storms could hit a Category 6. There is officially no such thing as a Category 6 hurricane. But the idea of revising or adding to the scale has reportedly been discussed by some climate scientists who believe the current categories may not be adequate for increasingly extreme storms in the future.\n\nThis is an updated version of a story originally published September 13, 2018.", "description": "The Saffir-Simpson Hurricane Wind Scale​ rates hurricanes on a scale from 1 to 5", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/08/26/999d5759-fe74-49ff-a2b9-e6fda33bedf1/thumbnail/1200x630/034bd5f0fc85d2e88ed02872dc70f1c1/cbsn-fusion-noaa-says-dont-use-nukes-on-hurricanes-report-president-trump-asked-nuclear-weapons-thumbnail-1920341.jpg"}