{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/million-california-customers-face-power-outages-191024093330631.html", "downloaded_at": "2019-10-24 16:30:44.910701+00:00", "title": "Over half a million California customers may face power outages", "language": "en", "text": "More than half a million homes and businesses in the US state of California could lose power this week as utilities, including Pacific Gas & Electric (PG&E) and Southern California Edison (SCE), cut off electricity as a preventive measure against wildfires.\n\nOver 308,000 customers in seven counties, including Los Angeles, San Bernardino and Ventura in southern California, are under the Public Safety Power Shutoffs (PSPS) consideration, SCE said.\n\nShutoffs from SCE could start early Thursday.\n\nMeanwhile, PG&E has shut off power in 15 counties, affecting about 178,000 customers in those areas.\n\nThe company said additional power shutoffs for parts of San Mateo County and Kern County were expected to begin at about 1am (08:00 GMT) on Thursday, affecting more than 1,000 customers.\n\nSan Diego Gas & Electric Co has also identified more than 41,000 customers under PSPS consideration but has not implemented any power shutoffs on Thursday.\n\n\n\n\n\nForecaster Marc Chenard said the worst of the winds would arrive on Thursday afternoon and into Friday.\n\n\"It looks like at its worst, southern California will see wind gusts of 55mph [88.5km/h]. Down in some of the coastal areas, the winds could reach 75mph [121km/h] later today,\" he said.\n\nPower lines could be knocked down and start fires among dry trees and vegetation, according to earlier forecasts.\n\nBankrupt Californian power producer PG&E cut off electricity to more than 730,000 homes and workplaces in northern California earlier this month to try to reduce wildfire risks posed by extremely windy and dry weather.\n\nChenard added that northern California could experience dangerous wind gusts of up to 72km/h (45mph). \"This is not going to abate until at least this weekend.\"\n\nWildfires were also growing through the night in Sonoma County, about 105 kilometres (65 miles) north of San Francisco, which is popular with tourists visiting wine-producing areas in California.\n\nEvacuation warnings were issued before midnight in some communities as the wind-driven fires moved towards the tourist towns of Healdsburg and Geyserville, officials said.", "description": "Electricity suppliers in California to shut off power as a preventive measure against wildfires.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/24/04e88283e2794924bedc60dadb52f930_18.jpg", "published_at": "2019-10-24"}