{"pub": "fox", "url": "https://foxbusiness.com/money/what-to-know-online-shopping-returns", "downloaded_at": "2019-10-02 00:32:43.048802+00:00", "title": "What to know about online shopping returns", "language": "en", "text": "Nowadays, consumers shop online for just about everything. So you've likely experienced the stinging disappointment when a TV, piece of furniture or something else you ordered finally arrives on your doorstep — damaged.\n\nContinue Reading Below\n\nHere's what you should do if your delivery comes in less-than-optimal shape.\n\n1. EXAMINE THE ITEM (THOROUGHLY)\n\nAs soon as you receive a dented box or open a package only to discover broken merchandise, get to work. Take pictures to document the condition of the delivery when it arrived — retailers may want proof. Hang onto any enclosed packing slips and return labels.\n\nIf the item is brought into your home as opposed to being left on your porch, inspect it for damage before you're asked to sign off on the delivery. This procedure is common with large products such as a couch or dining set.\n\n2. CONTACT THE RETAILER (QUICKLY)\n\nMost businesses have return policies on their websites, and there will typically be a section within that policy that addresses damaged or defective items. With a quick Google search, you can pull up such policies for big-name retailers like Amazon, Overstock, Wayfair and Best Buy.\n\nLook for information about how the damaged product should be handled. The return policy at Lowe's advises contacting customer care within three days of receiving a damaged item.\n\nBest Buy's policy says customers can return products that were defective or damaged in shipping either to a store location or through the mail during the return and exchange time period. The retailer says to call for return-by-mail instructions and it'll cover \"all reasonable and customary ground shipping fees.\"\n\nReport the broken item right away so the retailer doesn't think you're responsible for the damage, advises Kevin Brasler, executive editor at the nonprofit Consumers' Checkbook.\n\nIf you don't notice the damage for weeks, instead of shipping the item back to the retailer for a replacement, you may need to ship it to the manufacturer for repair.\n\n\"If it's a defective item, the store should just step up and make it right, get you a replacement item as fast as possible,\" Brasler says. \"If it's a warranty issue — if the thing has broken since you've taken delivery — now you have to deal with the manufacturer and possibly their warranty underwriter.\"\n\n3. UNPACK THE ISSUE (CALMLY)\n\nOnce you get on the phone with a retailer — or hop into a chat with an online representative — clearly articulate how you'd like the problem resolved, says Nicole Leinbach, founder of Retail Minded and an author of \"Retail 101: The Guide to Managing and Marketing Your Retail Business.\"\n\n\"Understand what you want from that conversation so that you can best lead that conversation to a resolution,\" she says.\n\nRemaining calm can greatly benefit your interaction with a customer service rep. Acknowledge that your frustration is not directed at the agent, but rather at the situation, Leinbach says.\n\nOnce you conclude the call, see the process through to completion. Ship the product back, if you're asked to, and stay on top of the retailer to ensure your replacement arrives in a timely manner.\n\nIf the seller isn't willing to work with you on a legitimate issue, tell them you will report them to the Better Business Bureau, recommends Charles R. Taylor, a marketing professor at Villanova School of Business.\n\nIf that doesn't change their minds, and you paid for the item with a credit card, you can dispute the charge. Check with your credit card company for full details, but Brasler says 9 times out of 10, the credit card issuer will side on your behalf.\n\n4. READ RETURN POLICIES (PROACTIVELY)\n\nTo save yourself time and hassle in the future, Leinbach recommends reading return policies before making a purchase. That's particularly important for large items such as furniture, which may be more of a logistical challenge to send back.\n\nUnderstanding the return policy upfront is so important to any online purchase decision. - Nicole Leinbach, founder of Retail Minded and an author of \"Retail 101: The Guide to Managing and Marketing Your Retail Business\"\n\n\"Understanding the return policy upfront is so important to any online purchase decision,\" Leinbach says.\n\nSimilarly, keep time frames in mind. Ask yourself questions like, when is the product expected to be delivered? Will you be home? Will you be able to inspect it before the return window passes?\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nEven if a damaged product arrives on your porch before you've done your due diligence, you can still follow the steps above to make things right. The good news? Taylor says many companies have favorable policies.\n\nIt'll just take a little extra work on your end to follow them.\n\n___________________________________\n\nThis column was provided to The Associated Press by the personal finance website NerdWallet. Courtney Jespersen is a writer at NerdWallet. Email: courtney@nerdwallet.com. Twitter: @courtneynerd.", "description": "Here's what you should do if your delivery comes in less-than-optimal shape.", "authors": [], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2018/02/0/0/662fb5df7e264fd5b54297c86385be67-1.jpg?ve=1&tl=1", "published_at": "2019-10-01"}