{"pub": "reuters", "url": "https://ca.reuters.com/article/topNews/idCAKBN1X91QT", "downloaded_at": "2019-10-30 16:12:12.180910+00:00", "title": "Chile says it can't host trade and climate summits after protests", "language": "en", "text": "FILE PHOTO: Chile's President Sebastian Pinera addresses the 74th session of the United Nations General Assembly at U.N. headquarters in New York City, New York, U.S., September 24, 2019. REUTERS/Carlo Allegri/File Photo\n\nSANTIAGO (Reuters) - Chile has withdrawn as host of the APEC trade summit in November and the COP25 climate summit in December after several weeks of violent unrest, President Sebastian Pinera announced on Wednesday.\n\nThe APEC summit was scheduled to bring together 20 world leaders, including U.S. President Donald Trump and Chinese President Xi Jinping, over Nov. 16-17. The COP25 program was due to run between Dec. 2 and Dec. 13.\n\n“This has been a very difficult decision, a decision that causes us a lot of pain, because we fully understand the importance of APEC and COP-25 for Chile and for the world,” Pinera said in a brief statement from La Moneda palace in Santiago.\n\nRiots, arson and protests over inequality this month have left at least 18 dead, 7,000 arrested and Chilean businesses hit with losses of around $1.4 billion. The capital city’s metro public transport suffered nearly $400 million in damages.\n\nWith Pinera’s popularity at an all-time low, Chileans were calling for new protests and the United Nations was sending a team to investigate allegations of human rights abuses.\n\nThe cancellation of the trade summit caught the Trump administration by surprise, a White House official told Reuters.\n\nThe official said Washington learned about the decision from news reports and is seeking more information.", "description": "Chile has withdrawn as host of the APEC trade summit in November and the COP25 climate summit in December after several weeks of violent unrest, President Sebastian Pinera announced on Wednesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191030&t=2&i=1446564102&w=1200&r=LYNXMPEF9T1A8", "published_at": "2019-10-30"}