{"pub": "dailymail", "url": "https://dailymail.co.uk/money/markets/article-7617181/Softbank-pumps-510m-finance-firm-Greensill-kill-payday-lenders.html", "downloaded_at": "2019-10-27 00:57:56.024768+00:00", "title": "Softbank pumps £510m into finance firm Greensill that could kill off payday lenders", "language": "en", "text": "Japanese conglomerate Softbank is set to inject another £510million into British online finance firm Greensill as part of plan to launch a new service that aims to wipe out controversial payday loans.\n\nCity sources said Greensill, set up by former Morgan Stanley banker Lex Greensill, is in advanced talks to buy FreeUp, a technology company that should enable the firm to offer ordinary workers early payment of their wages.\n\nSoftBank’s Vision Fund, led by maverick entrepreneur Masayoshi Son, is pouring in more than half a billion pounds to support the expansion strategy.\n\nSources said the deals could be announced as soon as this week.\n\nSoftBank’s Vision Fund is led by maverick entrepreneur Masayoshi Son (pictured)\n\nThe investment from SoftBank shows that Masayoshi Son’s voracious appetite for dealmaking continues unabated despite criticism for its failed investment in WeWork, the troubled office space start-up founded by Adam Neumann.\n\nSoftBank has taken control of WeWork after it emerged it was running out of cash and unable to float on the stock market.\n\nThe Japanese firm had to agree to pay Mr Neumann $1.7billion (£1.3billion) to get him to sever his ties with the embattled business.\n\nOther more successful investments by Masayoshi Son include Uber, which floated on the American stock exchange earlier this year with a valuation of $82billion (£64billion), messaging firm Slack and UK online bank OakNorth.\n\nEarlier this year SoftBank invested £625million in Greensill, whose advisers include former Prime Minister David Cameron, and received less than 10 per cent of the financial technology business as part of the deal.\n\nSources said this latest £510million investment values Greensill at around £3.1billion, making it one of Britain’s largest tech start-ups. Until now Greensill specialised in providing small and medium-sized businesses with access to so-called working capital finance to run their day-to-day operations.\n\nSoftBank has taken control of WeWork after it emerged it was running out of cash and unable to float on the stock market\n\nThis means offering early payment to cover invoices due to be paid at a later date by large companies and Government agencies, including Vodafone and the NHS.\n\nThe digital finance house charges the businesses seeking early payment a fee of about 1 per cent of the sum provided. Then Greensill is paid in full by the suppliers’ customers when invoices are settled.With this latest investment, Greensill plans to branch out to offering early payment to employees of companies – putting it in direct competition with payday lenders.\n\nHowever, Greensill is not planning to offer loans. The company is merely looking at advancing workers’ wages that have already been earned and the employees will not be charged for early payment.\n\nQuickQuid collapsed into administration after being hit by thousands of complaints\n\nThe move comes at a tough time for the payday lending industry, which has come under pressure for its controversial practices.\n\nOn Friday the UK’s largest payday lender, QuickQuid, collapsed into administration after being hit by thousands of complaints.\n\nCustomers complained they had been given loans they could not afford to repay. More than a million customers were left facing uncertainty over whether their claims for compensation would be paid.\n\nIts exit from Britain follows the collapse of Wonga last year. The Money Shop went under in June after facing complaints.\n\nPayday lenders have been hit by a crackdown that forced them to conduct affordability checks and cap charges to stop customers paying back more in fees and interest than the sum they initially borrowed.", "description": "City sources said Greensill is in advanced talks to buy FreeUp, a technology company that should enable the firm to offer ordinary workers early payment of their wages.", "authors": ["Ben Harrington For The Mail On Sunday", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/19/20223138-0-image-a-201_1572115966121.jpg", "published_at": "2019-10-26"}