{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/corruption-in-the-courtroom-a-sordid-tale-of-sex-gambling-poachers-and-payoffs-20180922", "downloaded_at": "2019-10-30 10:48:22.491501+00:00", "title": "Corruption in the courtroom: A sordid tale of sex, gambling, poachers and payoffs", "language": "en", "text": "Sam Sole for amaBhungane\n\nFour angry women have propelled a three-year investigation which is set to shake the foundations of the magistracy in KwaZulu-Natal and raise wider questions about the credibility of our lower courts.\n\nBy next week KwaZulu-Natal regional court president Eric Nzimande must provide reasons to the Magistrate’s Commission as to why he should not be suspended, pending the finalisation of misconduct proceedings.\n\nThe commission has been tight-lipped about the nature of the charges, but amaBhungane has had sight of several documents that give an indication of what has been found – and what a struggle it has been to get the investigation to this point.\n\nIt should be noted that the evidence is untested and amaBhungane’s knowledge is partly based on an incomplete draft of the investigation report as it stood at May 2017 – but still, in the words of one source close to the investigation, the picture is “scary”.\n\nIn summary, Nzimande is suspected of offering acting magistrate positions in the regional courts in exchange for cash, which he seemingly needed to feed a gambling habit.\n\nWorse, it appears he enabled – directly or indirectly – the formation of a network of judicial officers who are allegedly using their position to pervert justice on behalf of criminals.\n\nIn particular, Nzimande’s alleged patronage network appears to overlap partially with a group of court officials in northern KwaZulu-Natal who are alleged to have taken bribes – particularly around poaching cases, although, as we shall see, this was exposed because of a rape case.\n\nNzimande, through his attorney, was provided with detailed allegations for his comment. He failed to respond.\n\nThe delays in finalising the Magistrate’s Commission probe raise questions about the commitment and structure of the commission as the statutory body that exercises discipline over magistrates.\n\nThe full response of the commission is here.\n\nAngry woman No 1\n\nThinake Gumede is the person who first blew the whistle on Nzimande – though she is no heroine.\n\nGumede, a lawyer who was one of the acting magistrates appointed under Nzimande’s watch, was herself investigated by the Magistrate’s Commission after she was arrested in March 2015 for defeating the ends of justice.\n\nAccording to a later report in the Natal Witness, Gumede entered a police station premises and spoke to a witness who was due to testify in a rape case against one of her relatives.\n\nGumede was allowed to continue serving as an acting regional court magistrate even though a criminal case was opened against her.\n\nIndeed, she seemed to think she was untouchable.\n\nWhen the Witness revealed in June 2015 that Pietermaritzburg’s regional court prosecutors had unanimously lodged a complaint accusing her of being “discourteous and unprofessional”, she hit back, accusing her colleagues of incompetence and declaring that the dispute had its roots in jealously “between permanent district court magistrates and outsiders who they believe ought not to be awarded acting posts in the regional court”.\n\nIt appears it was only when her acting-appointment was terminated that she turned against Nzimande.\n\nOn June 30 2015, Gumede’s acting appointment was not renewed by the deputy minister of justice, who makes such appointments on the recommendation of the regional court president – in this case Nzimande.\n\nOn that same day, Gumede mailed a formal complaint against Nzimande and copied in the minister’s office and the Magistrate’s Commission.\n\nThe allegations were pretty devastating. They included claims that:\n\n- Nzimande was a compulsive gambler and that he had a gambling problem;\n\n- Nzimande had extorted money from her since her appointment and had borrowed more than R140 000 from her;\n\n- At times when she refused to lend him money, he would threaten to take away her contract and informed her that the minister might sign it, but that he (Nzimande) had the last say;\n\n- Other colleagues had been subjected to the same treatment;\n\n- Her transgressions relating to not keeping office hours occurred with Nzimande’s knowledge;\n\n- She was sexually harassed by Nzimande; and\n\n- The department of justice wanted to get rid of her because they wanted to hide Mr Nzimande’s skeletons.\n\nGiven Gumede’s own tainted reputation, the commission moved, initially, with commendable speed.\n\nBy July 30, 2015 the commission had appointed two senior magistrates to investigate her allegations: Eddie Mashile, then chief magistrate of Johannesburg, and Teresa Swart, then acting senior magistrate at Germiston.\n\nAngry woman No 2\n\n“Teresa Swart is the hero in this story,” says Jamie Joseph, who is a high-profile environmental activist and journalist – and also angry woman number 3.\n\n“She [Swart] is up against the old guard… In her words, they have no balls,” says Joseph (of whom more later).\n\nSwart, when contacted, proffered a more diplomatic “no comment”, but her leaked May 2017 draft report offers some insight into the obstacles she faced.\n\nAccording to the draft, the investigators subpoenaed the departmental computer that Gumede had used and also approached Gumede through her lawyer for an affidavit.\n\nThe investigators did not attempt to open the computer because they did not want to interfere with the chain of evidence, given that it was likely to become a criminal case and “because of the allegations made by Ms Gumede that the Department of Justice is assisting to hide Mr Nzimande’s wrong doings”.\n\nBy early 2016, they had Gumede’s preliminary affidavit which broadened the allegations, including claims that Nzimande would make sexual advances and insinuate that Gumede was indebted to him for her employment; he would allegedly tell her of other magistrates who would engage in granting him sexual favours in return for employment perks, such as being given less work.\n\nThe investigators had also subupoenaed Nzimande’s gambling records from Durban’s Tsogo Sun and Sibaya casinos.\n\nThe evidence led them to the view that they were obliged, under the Prevention and Combatting of Corrupt Activities Act (Precca) to report the matter to the police.\n\nNo directive\n\nGiven the sensitivity of the case, on May 25 2016 investigators Mashile and Swart requested a directive from the commission on reporting the matter to the police and for guidance on the investigative and legal challenges it posed.\n\nOn July 31 2016, the investigators requested a response on the directive they requested in May 2016.\n\nNo directive was forthcoming and, on August 18 2016, Mashile withdrew as investigator. He sent a letter to the commission providing his reasons but declined to share them with amaBhungane, telling us it was for the commission to disclose.\n\nThe commission did not respond to a question about Mashile’s withdrawal.\n\nIn September 2016, City Press splashed Gumde’s allegations against Nzimande under the headline, “Judge in sex, cash-for-job scandal”.\n\nSwart notes caustically in her draft: “No directive was forthcoming in four months from the Commission but then on 13 September 2016 the above matter appeared in the local Sunday newspapers.”\n\nEarlier the commission took the view that “this matter is not to be reported to the SAPS in terms of Precca. Mr Nzimande is to be first afforded an opportunity to respond to the allegations before any further steps be taken.”\n\nAfter the article appeared, criminal charges were laid and it was decided that “the progress of this matter be reported upon to the Chairpersons of the Magistrate’s Commission and the Ethics Committee on a weekly basis”.\n\nThe commission is chaired by Judge Frans Legodi and the ethics committee by advocate Cassim Moosa.\n\nMoosa, on behalf of the commission, denied “any allegation of dilatory conduct on its part in relation to the allegations of misconduct on the part of Mr Eric Nzimande”.\n\nHe said the commission followed due process regarding the allegations of misconduct, as it was required to do. See his full response.\n\nDuring November 2016, subpoenas were served by the police to obtain bank records for Nzimande and Gumede and the regional magistrates’ office in KwaZulu-Natal.\n\nSwart also travelled to KwaZulu-Natal and pulled Gumede’s leave files as well as the court logs for her cases at Pietermaritzburg and Camperdown.\n\nBy May 2017, the police had received some of the bank statements for Nzimande and Gumede and given Swart access to them. The draft report, dated May 22, reflects her effort to pull together the evidence available at that point. It is not a pretty picture.\n\nGambling\n\nThe evidence as analysed by Swart shows that someone using Nzimande’s non-transferable “loyalty card” visited the Durban Tsogo Sun more than 830 times between February 2003 and October 2015, including on 122 days in 2008.\n\nNzimande’s cash “buy in” amounted to R2 356 406. His approximate net losses amounted to R409 995 – including R88 000 in 2013.\n\nOn more than 100 days he was there before 4pm on a weekday – and on more than 120 separate days he was there until after midnight on a weekday.\n\nRecords for the Sibaya Sun from July 2007 to November 2015 do not have time records of the transactions but show he was there 342 times on weekdays.\n\nA tarnished whistleblower\n\nThe evidence supported many of Gumede’s allegations, but also showed she was deeply complicit.\n\nSwart reported that on March 19 2012, Gumede had paid R30 000 into Nzimande’s account, and on April 1 2012 she was appointed by the deputy minister’s office as an acting regional court magistrate.\n\nThe records assembled by Swart show that Gumede abused her position. She was constantly absent but was paid. She took leave despite occupying an acting post, meaning she was not entitled to paid leave.\n\nThe evidence suggests that Nzimande must have been aware of these blatant abuses – and indeed received complaints from prosecutors more than once.\n\nSwart noted that in her view “Mr Nzimande breached his managerial duties and his oath of office. There is a corrupt motive for these payments.”\n\nThe maladministration of justice\n\nThe draft report analyses many examples of the delays caused by Gumede’s alleged dereliction of duty. Two examples of prosecutor comments noted in the court log give a taste.\n\n“[The] matter was on the roll for trial all the witnesses were present. Ms Gumede informed the accused that the matter was crowded out in court. She wrote on the record that the witness had to complete a programme. The witness in this matter was 12 years old.”\n\n“Crowding out” occurs when too many cases are set down for one day, but Gumede seems just to have used this as an excuse.\n\nIn another matter that had been set down for judgment, Swart records: “Ms Gumede entered on the charge sheet that the prosecutor crowded the matter out. Where in truth the prosecutor was ready and never addressed her. The prosecutor notes in her report: ‘I am so disappointed on the reflection of the court’.”\n\nIn one matter cited by Swart involving a rape where the victim was nine years old, the case was postponed 34 times – 14 of those because the magistrate was absent.\n\nGumede did not respond to an emailed request for comment.\n\nA network of corruption?\n\nThe probe Gumede set in motion revealed that her example was not an isolated case.\n\nOn the contrary, the evidence gathered by Swart suggests Nzimande was at the centre of a web of people who bought their positions of trust – and some who sold out the victims of crime for cash.\n\nThe draft report identifies a string of suspicious payments into Nzimande’s accounts, including from a number of other court officials, including magistrates and prosecutors.\n\nShe widened the investigation to include allegations that Nzimande would receive payments from potential acting regional court magistrates and in return he would ensure that they were appointed.\n\nShe noted a further leg of inquiry: concerns that the acting magistrates that had entered into a corrupt relationship with Nzimande “would at times be placed by Mr Nzimande in a specific court to ensure a specific outcome for the accused person, for e.g. a murder matter would be placed before one of these magistrates and the accused would be acquitted or receive a suspended sentence or the matter would be struck off the roll”.\n\nShe cited examples that she uncovered. We have not identified some of those implicated because we could not contact them for a response.\n\nMagistrate A\n\n“11 May 2015 [Ms A] made a payment in Mr Nzimande’s bank account in the amount of R5,000… On 11 June 2015 Mr Nzimande send a motivation for [A] to be appointed…\n\n“30 June 2015 [Ms A] makes another deposit in his bank account in the amount of R4,800… On 28 September 2015 he sends in another motivation to appoint [A].”\n\nThere is no evidence presented that Ms A abused her position in court.\n\nMagistrate B\n\n“Ms [B] was appointed as a Regional Court Magistrate about 3 years ago. She was a district court magistrate… with very limited criminal Court experience\n\n“She was placed in a specialized Sexual Offences Court… by the Regional Court President [KwaZulu-Natal] Mr E Nzimande. It was apparent to all that she was out of her depth dealing with Sexual Offences matters.\n\n“Her average [travel allowance] per month is R21,000… A concern is that the officer, is using the [case] as a ruse to ensure the State pays for her visits to her home...”\n\nIt is not clear from the draft report whether Ms B paid any money to Nzimande. There is no evidence presented that she abused her position in court.\n\nMagistrate C\n\nFrom the draft report, there appears to be evidence that he deposited R85 750 into Gumede’s bank account (or perhaps paid Nzimande via Gumede – the report is ambiguous) between June 2014 and June 2016.\n\nThere is no evidence presented that Mr C abused his position in court.\n\nProsecutor D\n\nEvidence is presented that Ms D, a regional court prosecutor, paid a total of R66 550 into Nzimande’s account: R16 650 in 2012; R11 600 in 2013; R9 700 in 2014; R17 200 in 2015; and R11 400 in 2016.\n\nThere is no evidence presented that Ms D abused her position in court.\n\nThe Rhino ring\n\nIt is clear that as Swart pursued her investigation, she became aware that some of those who had paid money into Nzimande’s account were connected to a series of poaching cases in northern KwaZulu-Natal – including the controversial matter of alleged poaching “kingpin” Dumisani Gwala.\n\nGwala was arrested in December 2014 after an eight-month intelligence-driven operation in which he was sold rhino horn by undercover cops. When they tried to arrest him Gwala put up a fight, attempted to drive over a policeman and was shot in the leg.\n\nIn these cases, there are indeed allegations – unproven and in some instances vigorously contested – that court officials abused their position to violate the justice system and benefit criminals.\n\nAttorney ZW Ngwenya\n\nThe man at the centre of these allegations is attorney Welcome Ngwenya, who also served stints as an acting magistrate – seemingly courtesy of Nzimande.\n\nThe draft report discloses five payments Ngwenya allegedly made into Nzimande’s bank account between December 2013 and December 2014, totalling R30 000.\n\nSwart also identifies cases where Ngwenya was appearing as a defence attorney in poaching matters in Zululand at the same time he was supposed to be an acting magistrate clearing the case backlog in Pietermaritzburg.\n\nShe notes: “When comparing the dates in the charge sheets… I found that during Mr Ngwenya’s acting stint in the Regional court in [Pietermaritzburg], he was legally representing an accused person who is to be alleged as the Rhino Kingpin.\n\n“No leave forms were submitted by Mr Ngwenya during the days he represented the accused persons in court. Neither was any money deducted from his salary.”\n\nNgwenya could not be reached for comment and appears to have gone to ground. We will see shortly why that might be so.\n\nAttorney Mpume Linda\n\nSwart’s draft report notes that Linda made a R3 000 payment into Nzimande’s account on February 7 2015 after she had been appointed for a three-month stint as an acting magistrate in the sexual offences court.\n\nSwart notes: “I notice although she was in the sexual offences court she dealt with two corruption matters, one that includes money laundering… In case [XXX] all the accused was found not guilty… A certain attorney by the name of [SS] appeared for one [of] the accused. A payment was made into Mr Nzimande’s bank account by a [SS]. This specific payment has not yet been investigated.”\n\nThe draft report also notes that Linda appeared as the defence attorney on September 5 2016 in a rhino poaching matter that “was the same case that Mr Ngwenya appeared in when he was an acting Regional court magistrate in Pietermaritzburg”.\n\nLinda did not respond to emailed requests for a response to detailed allegations.\n\nIt was the rhino connections that led Swart’s investigative path to intersect with the fierce bushwhacking advocacy of Jamie Joseph.\n\nAngry Woman No 3.\n\nJoseph was born in Zimbabwe and grew up in South Africa. The biography on her Saving the Wild website says her “childhood days spanned the national parks of both countries, and these great wild places imprinted on her from a very young age”.\n\nIt adds: “As a teenager growing up in the height of the ecstasy rave revolution, she stumbled into the dark side and gained insights into a criminal syndicate where money talked, and dealers walked. Her fleeting dance with the devil prepared her for an unexpected life as a wildlife activist twenty years later.”\n\nAfter stints in London and New Zealand, Joseph returned to South Africa in 2014 “to join the war on elephant and rhino poaching”.\n\nShe created the Saving the Wild platform and began “writing stories from the frontline”, the website notes, adding: “Since the start of 2016 she has been exposing a notorious rhino poaching syndicate led by the accused rhino poaching kingpin of Zululand, Dumisani Gwala.”\n\nIt is true that no one has done more than Joseph to put a spotlight on the networks of corruption decimating Zululand’s rhino population – and she was highlighting the easy bail and lenient sentences enjoyed by poachers in some Zululand courts long before anyone else had heard of Welcome Ngwenya.\n\nIn January 2016, she wrote: “Magistrate Ngcobo has a long history of letting off rhino poachers with a slap on the wrist or a small fine. Gwala’s defence attorney is Ngwenya, the same attorney that defends most of the poachers in KwaZulu-Natal. How these poverty stricken poachers can afford an attorney is still a mystery.”\n\nA year later Joseph’s high profile and her willingness to call out Ngwenya made her a natural harbour for two whistle-blowers who claimed to know Ngwenya’s secrets.\n\nAngry Woman No 4\n\nThis heroine can’t be identified – she is known only as “Tortoise” – but she set in motion the exposure of Ngwenya in a more profound way than Swart’s collection of bank statements could ever achieve. She connected Joseph to another source “Fresh” – the hero of this story.\n\nJoseph sets out the events in an affidavit she prepared for the police.\n\n“During the beginning of 2017, I was contacted through our NGO website, savingthewild.com, by a person claiming to have information on corruption related to the Gwala case.\n\n“I immediately called state advocate Yuri Gangai who is prosecuting the case. He instructed detective warrant officer J P van Zyl Roux to accompany me to meet with the sources...\n\n“Van Zyl Roux recorded their affidavits during February 2017. In the affidavits accusations regarding corruption between magistrates, prosecutors and police are highlighted…\n\n“To confirm the content of the affidavits by the sources we arranged a polygraph test and both deponents were tested on the truthfulness of the contents… No deception was indicated.”\n\nAccording to Joseph, for Tortoise the last straw was another case, the rape case, which Ngwenya was alleged to be manipulating to protect the alleged rapist.\n\nThat led Tortoise to contact Joseph and introduce her to Fresh, who claimed to be at the pit-face of bribing court officials.\n\nOne hero\n\nFresh’s affidavit is hair-raising – and worth quoting at some length. He alleges that Ngwenya set himself up as the “go to guy” in Zululand for criminals wishing to buy themselves out of trouble.\n\nFresh states: “During the end of 2014 beginning 2015 [Ngwenya] asked me if I know anything about poaching. I said I knew the meaning but had never done it. He told me there was a guy called Gwala who was very rich, I asked rich with what. [Ngwenya] told me that Gwala was involved in rhino horns…\n\n“He told me that Gwala had been arrested. He wanted to do these cases because he was tired of the white people thinking that they were born with these rhino. Nobody is born with rhino in the hand. As long as these guys would continue poaching and paying him he would represent them to stop the white people from owning the rhino…\n\n“He was not worried and said he knew all the magistrates and prosecutors and they would win all the cases one way or another. As long as he got paid well he would look after his friends. All the poachers had to tell their friends it was Ngwenya, the hero, who was going to get them out.”\n\nMagistrate Deuteronomy Ngcobo\n\nFresh claimed to know a lot about Ngcobo, the magistrate that Joseph criticised for his supposed leniency with poachers.\n\nIn his affidavit, Fresh states: “At that stage I also knew the magistrate who first worked on the Gwala case, Ngcobo. I had met Ngcobo at [Ngwenya's] house when he had visited... During 2015 I was paying Magistrate Ngcobo on other cases where [Ngwenya] was representing the accused. [Ngwenya] would give me the money after which I would hand it to Ncgobo at the courts toilets at either Mtubatuba or Ingwavuma court. The amounts varied between ten thousand and fifteen thousand rand. Ngcobo would make sure that I counted the money in front of him in the toilet.”\n\nFresh was also aware of a controversial case where Ngcobo had acquitted a crime intelligence police officer from Josini who had been arrested in another sting operation.\n\nHis affidavit states: “I accompanied [Ngwenya] to Mtubatuba court where he spoke to Magistrate Ngcobo about the … case. It was agreed that he would acquit [the crime intelligence officer] in exchange for a payment of R30,000-00. After Mr Ngcobo acquitted [the officer] in court, I accompanied [Ngwenya] to Ngcobo’s house in Mtubatuba where [Ngwenya] handed me the money which I handed to magistrate Ngcobo. [Ngwenya] had brought a bottle of Hennessey along which they drank together to celebrate.”\n\nThe Teresa Swart draft report also discloses that a separate complaint was registered at the commission against Ngcobo, and he is currently being investigated for an alleged corrupt relationship with Ngwenya.\n\nDetailed allegations were put to Ngcobo by amaBhungane.\n\nIn an email, he said: “In response to your correspondence I still maintain that the matter is still under investigation. I resort under the domain of the Magistrates Commission and I am subject to the Constitution of the Republic of South Africa and various relevant Prescripts that regulate the appointment and conduct of the magistrates.\n\n“I therefore refrain to comment and or answer any questions posed to me without the express and or written prior approval and authorization by the Magistrates Commission.”\n\nMagistrate Muntukayise Khumalo\n\nFresh’s affidavit states: “Ngcobo and Khumalo, magistrates at Ingwavuma, became comfortable with me. With every case [Ngwenya] would ask me to contact the presiding magistrate and make arrangements for the handing over of the money in return for the magistrates handing down a lenient sentence or acquitting the accused.\n\n“Ngwenya and the magistrates would either meet at [Ngwenya’s] house in Pongola or in the parking area at Spar in Ingwavuma where they would discuss the cases. I would also be present during these discussions…\n\n“On another rhino matter at Ingwavuma Regional Court, where three accused were appearing, they paid Ngwenya R65,000-00 of which I was handed R15,000-00 to hand over to Mister Khumalo, the regional Court Magistrate. This was arranged at [Ngwenya’s] house. Khumalo met him there.\n\n“Before the trial [Ngwenya] handed me R15,000-00 and tasked me to proceed to Ingwavuma Bridge where I would meet magistrate Khumalo and hand over the money to him… I did as instructed… After the trial [Ngwenya] was very angry with Khumalo who had not acquitted the accused as arranged, but had handed down more lenient sentences to them.”\n\nSwart’s draft report notes that on December 7 2013 an M Khumalo paid R10 000 into regional court president Nzimande’s bank account.\n\nDetailed allegations were put to Khumalo by email. He did not respond.\n\nThe Gwala case and Magistrate Kwazi Shandu\n\nFresh states: “[When the] Gwala case was moved to Ngwelezane court [Ngwenya] handed the defence over to Mpume Linda. He was keeping a low profile because of a reporter, Jamie Joseph, who was making life difficult for him. He however was still influencing the case.\n\n“I was present when the magistrate presiding over the case at Ngwelezane court, Mister Shandu, arrived at [Ngwenya's] house in Pongola. Mpume Linda was present as well. They discussed the case and it was agreed that Shandu prolong the case until the state would make mistakes and he could acquit Gwala.\n\n“If it did not work out he would sentence Gwala to a light sentence of community service. I was given R3000-00 to give to Shandu as an initial payment so that Shandu would not be too hard on Mpume Linda in court. Further payments would be made if the case proceeded. I did as instructed and handed the money over to Magistrate Shandu.”\n\nIt should be noted that Fresh’s credibility and believability as a witness are undermined by his alleged criminal actions – as he described them – and the fact that his identity is withheld. Meanwhile, Shandu, who eventually transferred the case to another court, vigorously disputes it.\n\nHe earlier told the BBC, which first gave prominence to the matter: “These allegations are not coming to my ears for the first time. I have heard them before and nobody had the decency to give me the opportunity to respond before.\n\n“I never attended such a meeting. I don’t even know where the meeting was held. I don’t know the person making the allegations. I don’t know the place. I don’t even know Pongola.\n\n“I have only driven down the main road, I have never been to a residence there. I never ever attended such a meeting. I never received a bribe. Nobody sought to influence me. I have been a presiding officer for thirty years and this is the first time totally false allegations have been made against me in all that thirty years.\n\n“Nobody has ever approached me for a bribe in my whole career of thirty years and I will never pay such a bribe.”\n\nSpeaking to amaBhungane, Shandu added that anyone could look at the transcript of the Gwala case and see that he had acted without fear or favour as he had done throughout his career.\n\nThe child rape case\n\nFresh states: “There is another prosecutor [XXX]. She is well befriended with [Ngwenya]. She helps him with a lot of cases in the district court. The last case I remember is where a young boy of fourteen years old, was raped by a man called [S].\n\n“Mpume Linda called me and told me to inform Ngwenya about the case. We went to see him. The man told Ngwenya that he had raped the boy but wanted the case to be over or disappear. The man told Ngwenya he had a lot of money. Ngwenya asked the man for R150 000-00 to which the man agreed. His sister paid an initial amount of R40 000-00 in cash.\n\n“She handed over the money to me at Pongolo Engen garage, at the Wimpy. I handed the money to Ngwenya who called [XXX]. She first said she did not want to help as she had her own children. Ngwenya persuaded her. They agreed that the suspect lay low for a week after which he would be given bail. The suspect was granted bail as planned…”\n\nIt was this case that caused Tortoise to come forward.\n\nHow high does it go?\n\nIn May 2017 Warrant Officer Van Zyl Roux, who had taken the affidavits from Tortoise and Fresh, passed them on to his superior, Colonel Jason McGray.\n\nHe knew McGray was conducting a criminal corruption investigation that overlapped with the allegations made by Tortoise and Fresh.\n\nMeanwhile the Gwala case dragged on and prosecutor Yuri Gangai eventually resolved to bring an application for the recusal of Magistrate Shandu, based on the allegations by Fresh.\n\nTo this end, he contacted Joseph, Van Zyl Roux and McGray to prepare affidavits in support of the recusal application.\n\nJoseph states in her blog: “Myself and two investigating police officers were requested to write affidavits in support of Advocate Gangai’s application for the recusal of Magistrate Shandu. On Friday 6 October we all made sworn police affidavits.”\n\nMcGray states in his affidavit: “I am presently investigating the allegations of corruption mentioned between police, prosecutors and magistrates and I have brought these allegations to the attention the magistrates commission and the head of detectives Major General B Naidoo who has reported the matter to the Department of Public Prosecutions head KwaZulu Natal…”\n\nHe notes: “I do believe from the specific cases mentioned and the intimate knowledge the deponent possesses of these incidents, the deponent must have been personally present or involved in the specific acts referred to, due to the fact that the cases and details of the suspects referred to were not all public knowledge…”\n\nReferring to Fresh’s claim that Magistrate Shandu, who was presiding over the Gwala case, had accepted cash from Ngwenya, McGray stated: “I cannot disprove these allegations at this stage and based on the authenticity of the other allegations in the affidavit, it is believed that it would be in the interest of justice to avoid any semblance of corruption or bias to have the matter moved and tried before a magistrate who will be deemed totally independent.”\n\nBased on these affidavits, Joseph says, prosecutor Gangai was preparing to launch the recusal application on Monday, October 9 2017.\n\nJoseph writes in her blog: “On Saturday 7 October, Advocate Gangai called me to tell me I no longer need to be at court on Monday as, in the final hour of Friday, he was replaced as the prosecutor on the Gwala case. The order came straight from the top…”\n\nThat decision leaves a bad taste, seeing as Gangai has previously handled most of the high-profile poaching cases in KwaZulu-Natal.\n\nResponding to queries, provincial director of public prosecutions advocate Moipone Noko said the move was not unusual and was taken in the interests of the “fair allocation of cases and to ensure that a pool of skill/knowledge is maintained in the province…” See her full response.\n\nShe added: “Prosecutors do not own cases nor do they have interests in cases and can thus be re-allocated to other cases if there are reasons to… Re the recusal application issue, the case as it then stood had neither evidence nor valid grounds to base a recusal of the magistrate application on.”\n\nFollowing publication of some of the allegations by Fresh and the resultant public outcry, the case ended up being transferred to a different court for trial, though the allegations against Shandu were never raised or tested in court.\n\nThe case has now been postponed some 20 times and will now only go to trial on November 26 after a new senior prosecutor was appointed.\n\nWhere are the balls?\n\nThe police have been resolutely uncommunicative about the broader criminal investigation.\n\nMcGray would not return calls, but one senior police source told amaBhungane the investigation had reached a critical stage and there would be action within a few weeks.\n\nIndications are that Noko has appointed three senior advocates to manage the Gwala case, but her previous stance invites some scepticism.\n\nMeanwhile, by late May or early June 2017 the Tortoise and Fresh affidavits had made their way to the Magistrate’s Commission.\n\nSometime after that, Teresa Swart also withdrew from the investigation.\n\nIt is understood she was only persuaded to resume involvement in the investigation following the chair of the commission, Judge Frans Legodi, taking a personal interest in the matter.\n\nThis again suggests that Swart was, at the very least, not provided with the resources and support to investigate a complex set of cases that go to the heart of the administration of justice in the magistracy.\n\nAdvocate Dawood, on behalf of the commission, did not respond to specific questions about the reason for Swart’s temporary withdrawal.\n\nHe did emphasise that the misconduct charges finally presented to Nzimande on September 4 this year excluded the corruption allegations.\n\n“In this regard kindly be advised that the aforementioned allegations were duly reported by the Magistrate’s Commission, to the South African Police Services for further investigation... Accordingly, I am of the view that the Commission has acted with due diligence in this regard.\n\n“The matter is currently with the SAPS and the Director of Public Prosecutions. I am therefore, unable to comment regarding their processes…\n\n“Kindly be advised further that in terms of the ‘poaching ring cases’ the Commission is not in possession of any allegation of misconduct against Mr Nzimande.\n\n“Hence, in the circumstances, I wish to reiterate that the matter is with the relevant authorities for investigation and action, and does not currently form part of any misconduct proceedings against Mr Nzimande at this stage. These allegations will be revisited once the Commission is privy to the outcome of the criminal investigation.”\n\nGiven what Swart uncovered, the commission’s pedantic diffidence seems criminally complacent.\n\nThey have information. The real question is: do they have the balls?", "description": "Rhino killers and other criminals have allegedly been bribing court officials in KwaZulu Natal. It’s a sordid tale of sex, gambling, poachers and payoffs. But there are three heroines (and one tainted hero).", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7972/77246544b81c47bb9b067c9b89de5599.jpg", "published_at": "2018-09-22"}