{"pub": "yahoo", "url": "https://finance.yahoo.com/news/crypto-daily-movers-shakers-28-032239724.html", "downloaded_at": "2019-10-29 08:44:55.228713+00:00", "title": "The Crypto Daily – Movers and Shakers -28/10/19", "language": "en", "text": "Bitcoin rose by 3.2% on Sunday. Following on from a 6.82% rally on Saturday, Bitcoin ended the day at $9,571.8.\n\nA bearish start to the day saw Bitcoin fall to an early morning intraday low $9,121.2 before making a move.\n\nSteering clear of the first major support level at $8,461.87, Bitcoin rallied to a late afternoon intraday high $9,823.9.\n\nWhile falling short of the first major resistance level at $10,279.97, Bitcoin broke through the 38.2% FIB of $9,734.\n\nA bearish end to the day, however, left Bitcoin at $9,500 levels to limit the upside on the day.\n\nFor the week, a 3rd consecutive day in the green gave Bitcoin a 15.9% gain, Monday through Sunday.\n\nFor the bulls, the extended bullish trend remained intact in spite of failing to break out from the 38.2% FIB of $9,734. Bitcoin has continued to hold above the 62% FIB of 7,245.\n\nThe Rest of the Pack\n\nAcross the rest of the top 10 cryptos, it was a bullish day for the majors on Sunday.\n\nEOS led the way, rallying by 6.23%, with Litecoin rising by 5.31%.\n\nStellar’s Lumen (+3.18%), Bitcoin Cash ABC (+2.45%), and Ethereum (+2.44%) also saw solid gains.\n\nBinance Coin (+1.89%), Ripple’s XRP (+1.59%), and Bitcoin Cash SV (+0.06%) saw more modest gains on the day.\n\nFor the week, however, it was Bitcoin Cash SV that led the way, surging by 48.5%.\n\nBitcoin Cash ABC and EOS saw double-digit gains of 16.8% and 13.9% respectively.\n\nLitecoin (+9.0%), Ethereum (+5.1%), and Binance Coin (+4.5%) also made solid gains.\n\nRipple’s XRP and Stellar’s Lumen trailed the pack, with gains of 1.42% and 3.28% respectively.\n\nThrough the week, the total crypto market cap rose from a Wednesday low $202.69bn to a Saturday high $262.07bn. At the time of writing, the total market cap stood at $257.28bn.\n\nBitcoin’s dominance jumped back to 68% levels off the back of a 16.5% rally on Friday and solid gains through the weekend.\n\nThis Morning\n\nAt the time of writing, Bitcoin was up by 1.77% to $9,741.0. A bullish start to the day saw Bitcoin rise from an early morning low $9,566.6 to a high $9,948.9 before easing back.\n\nBitcoin broke through the 38.2% FIB of $9,734 and the first major resistance level at $9,890.07 early on.\n\nElsewhere, Binance Coin was on the charge early on, rallying by 8.13% to lead the way.\n\nEOS (+3.31%), Bitcoin Cash ABC (+3.25%), Stellar’s Lumen (+2.50%), and Litecoin (+2.19%) also saw solid gains.\n\nRipple’s XRP and Ethereum trailed the pack, with gains of 0.82% and 1.12% respectively.\n\n[fx-image src=https://www.tradingview.com/x/qjukvrRt/ originalWidth=761 ratio=1.3 data-zoom-target=https://www.tradingview.com/x/qjukvrRt/]\n\nFor the Bitcoin Day Ahead\n\nFor the day ahead, Bitcoin would need to hold above the 38.2% FIB to support another run at the first major resistance level at $9,890.07.\n\nSupport from the broader market would be needed, however, for Bitcoin to break back through to $10,000 levels.\n\nBarring an extended rally through the day, Bitcoin would likely come up short of the second major resistance level at $10,208.33.\n\nFailure to hold above the 38.2% FIB of $9,734 could see Bitcoin hit reverse.\n\nA fall through to sub-$9,500 levels would bring the first major support level at $9,187.37 into play before any recovery.\n\nBarring a crypto meltdown, Bitcoin should steer well clear of sub-$9,000 levels on the day.\n\nThis article was originally posted on FX Empire\n\nMore From FXEMPIRE:", "description": "It’s a bullish start to the week, following last week’s rally. Bitcoin will need to take a run at $10,000 to avoid a pullback.", "authors": ["Bob Mason"], "top_image": "https://s.yimg.com/uu/api/res/1.2/3sXKRCLQVfTTrx28SdcSjg--~B/aD00MTA7dz02MTU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/fx_empire_176/56a0edab565cb7b53fe4ab306c205fb2", "published_at": "2019-10-28"}