{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Culture/bachelor-paradise-recap-caelynn-faces-tough-choice-blake/story?id=65384285", "downloaded_at": "2019-09-04 23:48:15.414633+00:00", "published_at": "2019-09-04", "title": "'Bachelor in Paradise' recap: Caelynn faces a tough choice; Blake asks for a second chance", "language": "en", "text": "No one understands \"Bachelor in Paradise\" better than former cast member Krystal Nielson, who met her now-husband, Chris Randone, during production of the show last summer. Their nuptials were televised on \"Bachelor in Paradise\" last week. Every Wednesday, Nielson will recap \"Bachelor in Paradise\" for \"Good Morning America,\" weighing in on her favorite couples and all the jaw-dropping drama.\n\nInterested in The Bachelor? Add The Bachelor as an interest to stay up to date on the latest The Bachelor news, video, and analysis from ABC News. Add Interest\n\n\"Paradise\" is winding down and now the couples on the island are imagining how life will be when they leave the sandy shores of Puerto Vallarta. While time is running out, there is still plenty of drama being dished out as relationships ponder this big question: \"Will we be strong enough to make it outside of Paradise?\"\n\nThe double standard\n\nIf it's OK for him to be here why is it not OK for me to be here?\" - Angela\n\nAngela is now officially in Paradise and came in with a bang ... and a hair flip. Up until Angela's entrance on the island, Nicole and Clay seemed like one of the strongest couples in Paradise, but that took a tailspin when Clay went into a panic that his ex would come to the beach. This is the first time we've seen Clay sweat, and that's saying A LOT after his altercation with the hot-headed Christian!\n\nAs much as Clay has told Nicole -- and all of Paradise for that matter -- how much he's over Angela, you can see how uncomfortable he is at the mere mention of her being there.\n\nSide note: Angela shares in an interview that she and Clay spoke at my wedding the night before and he never mentioned he had a girlfriend.\n\nInteresting…\n\nBack on the island, Nicole ends up pulling Angela aside to warn her \"to stay away from Clay.\" The talk goes well and Angela handles herself with grace and class. She stated that she is not there to break up their relationship but instead, have her own chance to find love.\n\nAngela ends up taking Mike on a date where she shares that Clay was her \"greatest love and then it [suddenly] didn't work out.\" She says that there is a double standard that Clay can come to Paradise to find love but she shouldn't be given the same opportunity.\n\n\"Clay said it was easier for him [to come to Paradise] because he never said 'I love you,'\" Mike reveals to Angela, leaving her stunned and hurt.\n\nBack at the beach, Nicole spirals out, calling Angela \"desperate, crazy and a psycho\" with \"creepy hair and a creepy smile.\" This is OBVIOUSLY Nicole projecting her own insecurities, and while there is something to say in defending your man, name-calling and acting catty isn't a good look for anyone.\n\nI've got to hand it to Angela for having the confidence and courage to go to Paradise knowing that she was going to get heat and stood her ground with grace and class when she was attacked for \"ulterior motives\" in her chance at finding love.\n\nDerek leaves Paradise brokenhearted\n\n\"All I want is someone to reciprocate how much I care.\" - Derek\n\nI was rooting for Derek to finally find his happy ending with someone and I thought Tayshia would be his girl. Tayshia has always impressed me with how mature and intelligent she is and I felt that Derek provided the stability that any girl would look for in a serious relationship. I was straight SHOOK when Tayshia broke things off with Derek and chose the goofy and playful John Paul Jones instead.\n\nJPJ said that he saw Tayshia being someone he could spend his life with, and so much so that it scared him. Tayshia, on the other hand, admitted that she has a lot of fun with JPJ but she couldn't see it working out \"long term.\"\n\nWhich makes me wonder ... What is Tayshia really here for?\n\nChasing Angela\n\n\"If I see other guys taking Angela on a date it'll be a tough pill for me to swallow.\"- Clay\n\nChase McNary from JoJo's season is the first guy to arrive this week … and boy is he on a mission. Without speaking to any other woman, Chase pulls Angela and asks her on a date after hitting it off at the wedding. She agrees to go and this sends Clay on a deeper downward spiral further questioning not only his relationship with Nicole, but whether or not he should even be in Paradise.\n\n\"Nicole is great, but it's going to be tough for the rest of Paradise seeing [Angela] date other people … if this continues, I might leave Paradise,\" Clay shares.\n\nI think Clay still has deep feelings for Angela and her coming back into his life is stirring up suppressed feelings that he hasn't dealt with. As Clay watches the men chase after Angela, perhaps he is now realizing what he had.\n\nDouble dates\n\n\"Oh my gosh, my mom's gonna frickin kill me.\" - Matt\n\nMatt Donald and Luke Stone from Hannah's season of \"The Bachelorette\" also arrive in Paradise this week with a double date card and they take Kristina and Sydney.\n\nHow much Luke S resembles Nick Viall is quite remarkable and Kristina is having a fun time dating her ex's doppelganger.\n\nMatt and Sydney hit it off but Matt is so concerned about what his mom will think of his behavior that it inhibits him from making a move, leaving Sydney feeling frustrated. The next day, Matt finally builds up the confidence (thank you to whatever producer gave him a pep talk) and he goes in for the MOST EPIC kiss scene in the history of Paradise as the entire beach cheers him on.\n\nBlake's 'all in' with Kristina\n\n\"There's a reason we've gravitated towards each other this entire time … because there's something here. I know this is crazy because I thought I just wanted to be friends with you but I can't stop thinking about you.\" - Blake\n\nThe night before the rose ceremony, we see Blake freaking out that he might go home. In his interview, he suddenly realizes that he has feelings for Kristina … and tells her.\n\nKristina is wary of Blake and isn't sure that she can trust him after the incident at Stagecoach with Caelynn.\n\n\"You don't need to open the door, just unlock it,\" Blake pleads.\n\nKristina says that she needs to sleep on it and will talk to him the following evening at the rose ceremony where she ends up giving her rose to Blake and tells him she \"would like our friendship to take a step further and see where this goes.\"\n\nIs Blake being genuine or is this a Hail Mary attempt to stay one more week in Paradise?\n\nWhile Blake has made morally questionable decisions, I would like to see him learn and grow from his mistakes because, as my husband and I know, your hard times don't have to define you, but can be an important stepping stone in your personal growth.\n\nNo more mustaches for Caelynn\n\nJohn Fleenor/ABC\n\n\"With Connor, it feels good to know that I have something safe and good. And I completely forget about Dean.\"- Caelynn\n\nCaelynn and Connor's relationship is taking off.\n\nCaelynn shares with Hannah G that they will take their relationship to the next level and have decided to go into the boom-boom room.\n\nIn case you're not familiar, these rooms are dedicated villas for couples to spend the night together and explore their relationship in a more intimate setting.\n\nLast year, Chris and I had our very own \"boom-boom room\" and what I loved most about it was that it allowed us to experience what going to bed and waking up as a normal couple would look and feel like.\n\nParadise has been a rough ride for Caelynn and I'm so happy to see her finally get a break….\n\nAlthough not for long...\n\nDean's back\n\n\" I have no idea what this dude is about to do, but here he is with no mustache. Dean means business\" - Dylan\n\nDean arrives back in Paradise clean-shaved and determined. The entire cast is speechless as Dean pulls Caelynn to go and talk.\n\n\"I made a decision that I thought was the best for you but it wasn't fair for me to be making that. Then I flew back to San Diego and the entire flight back I couldn't stop thinking about you,\" Dean tells her.\n\nHe then goes on to share that he drove to the Grand Canyon and all he could do was think about how much he missed her and wanted her to be with him.\n\n\"After a lot of introspection, self- reflection and thought I've decided that I need to stop running away from the good things in life.\" - Dean\n\nCaelynn is overwhelmed, crying and just utterly confused. All she wanted from Dean was for him to be all-in with her so that she could let her guard down and open her heart fully to him.\n\nBut what about her budding relationship with Connor?\n\nAs this week's episode ends, Dean reveals to Caelynn the reason he came back to Paradise was to ask her to leave Paradise with him ... right now.\n\n\"I have the dangerous guy and the perfect man. I literally have no idea what to do.\" - Caelynn\n\nWill Caelynn play it safe with Connor, or take a chance with free-spirited Dean?\n\nWill Clay be able to maintain his cool while Angela continues her relationship with Chase?\n\nAnd will Blake get a second chance at love with Kristina?\n\nI guess we can only hope and see what happens next week on \"Bachelor in Paradise\"!", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/bachelor-paradise-abc-jef-190830_hpMain_16x9_992.jpg"}