{"pub": "foxnews", "url": "https://foxnews.com/politics/trump-holds-presser-amid-explosive-transcript-release-dems-impeachment-push", "downloaded_at": "2019-09-25 23:27:01.444686+00:00", "title": "Trump turns tables on Biden amid impeachment push, claims Dems threatened Ukraine", "language": "en", "text": "A defiant President Trump said during a press conference in New York Wednesday that he wants \"full transparency\" not only over the \"so-called whistleblower\" allegations leveled against him, but also \"from Joe Biden and his son Hunter on the millions of dollars that have been quickly and easily taken out of Ukraine and China.\"\n\nTrump additionally demanded \"transparency from Democrats who went to Ukraine and attempted to force the new president ... to do things that they wanted under the form of political threat. They threatened him if he didn't do things -- now that's what they're accusing me of, but I didn't do it.\"\n\nThe aggressive move signaled that the White House would seek to turn the tables against Democrats who have initiated an impeachment inquiry, following the whistleblower's complaint that Trump had improperly pressured Ukrainian President Volodymyr Zelensky to investigate Biden. Zelensky, speaking across from Trump just an hour earlier, told reporters he did not feel \"pushed\" at all in his conversations with the president.\n\nWATCH: UKRAINE PRESIDENT BACKS UP TRUMP, SAYS HE WASN'T PRESSURED\n\nEarlier in the day, the White House released a transcript of Trump's July call with Zelensky, showing Trump sought a review of Biden family dealings in the country. But the transcript also did not demonstrate that Trump leveraged military aid to Ukraine to obtain a \"promise\" on a Biden investigation, as a widely cited report in The Washington Post had claimed.\n\nAt the press conference, Trump specifically called attention to a little-discussed CNN report from May, which described how Democratic Sens. Robert Menendez, Dick Durbin, and Patrick Leahy pushed Ukraine’s top prosecutor not to close four investigations perceived as critical to then-Special Counsel Robert Mueller's Russia probe -- and, by Democrats' current logic, seemingly implied that their support for U.S. aid to Ukraine was at stake.\n\n\"The Democrats have done what they're accusing me of doing,\" Trump said.\n\nThe Democratic senators wrote in a letter to Ukraine's leader at the time: \"In four short years, Ukraine has made significant progress in building [democratic] institutions despite ongoing military, economic, and political pressure from Moscow. We have supported [the] capacity-building process and are disappointed that some in Kyiv appear to have cast aside these [democratic] principles to avoid the ire of President Trump.\"\n\nThe senators called for the top prosecutor to “reverse course and halt any efforts to impede cooperation with this important investigation.”\n\nThe Post's Marc Thiessen initially flagged the letter on Tuesday, calling it evidence of a \"double standard\" among Democrats.\n\n\"Senator Chris Murphy literally threatened the president of Ukraine that if he doesn't do things right, they won't have Democrat support in Congress,\" Trump added.\n\nThat was a reference to the Connecticut Democrat's comments at a bipartisan meeting in Kiev earlier this month, when Murphy called U.S. aid the “most important asset” of Ukraine -- then issued a warning.\n\n\"I told Zelensky that he should not insert himself or his government into American politics,\" Murphy said, according to The Hill. \"I cautioned him that complying with the demands of the President's campaign representatives to investigate a political rival of the President would gravely damage the U.S.-Ukraine relationship. There are few things that Republicans and Democrats agree on in Washington these days, and support for Ukraine is one of them.\"\n\nREAD THE TRANSCRIPT OF THE TRUMP PHONE CALL\n\nResponding to Trump's statements, Murphy said that \"in the meeting Republican Senator Ron Johnson and I had with President Zelensky three weeks ago, I made it clear to him that Ukraine should not become involved in the 2020 election and that his government should communicate with the State Department, not the president's campaign. I still believe this to be true.\"\n\nBut in colorful language, Trump told reporters that the evidence clearly showed Democrats were disingenuously attacking him for political gain.\n\n\"We have the greatest economy we've ever had,\" The president said. \"When you see little [House Intelligence Committee Chair] Adam Schiff go out and lie and lie and stand at the mic, smart guy by the way. ... Then he goes into a room with [House Judiciary Committee Chair Jerry] Nadler, and they must laugh their asses off.\"\n\n\"They must laugh their asses off.\" — President Trump, referring to Democrats Jerry Nadler and Adam Schiff\n\nNot all Democrats in the House have been on board with impeachment. 2020 presidential candidate Rep. Tulsi Gabbard, D-Hawaii, said Wednesday that the Ukraine transcript did not present a \"compelling\" reason to impeach the president.\n\nTaking the fight to the Democrats over the scores of Democrats who do support an impeachment inquiry could pay dividends for Republicans ahead of next year's elections. The National Republican Congressional Committee indicated Wednesday that its fundraising was up 608 percent after Democrats' impeachment push.\n\nAnd the Trump reelection campaign and GOP announced they had raised a combined $5 million in just 24 hours.\n\nTrump, accompanied by Secretary of State Mike Pompeo and Treasury Secretary Steve Mnuchin, also slammed the media for focusing so heavily on a whistleblower's allegation that he improperly pressured Zelensky for political reasons.\n\nWATCH: PELOSI ADMITS SHE HASN'T READ THE UKRAINE TRANSCRIPT\n\n\"We've made some fantastic deals, like with Japan, for farmers -- and that doesn't get covered, because you waste your time on nonsense,\" Trump said. \"It's very sad what Democrats are doing to this country -- they're dividing, they're demeaning.\"\n\nPompeo and Mnuchin each discussed progress on trade, including the ongoing trade war with China, as well as Iran policy.\n\nTrump's comments came shortly after he wrapped up a joint media appearance with Zelensky -- who flatly told reporters that he did not feel \"pushed\" to investigate Joe Biden.\n\n“We had a great phone call,” Zelensky said earlier, as he sat across from Trump. “It was normal.”\n\nZelensky's comments did little to quiet a growing call among Democrats to press ahead with the impeachment inquiry announced Tuesday by House Speaker Nancy Pelosi.\n\nAlso on Wednesday, Acting Director of National Intelligence Joseph Maguire flatly contradicted another report in the Post, and maintained he never considered resigning over the matter.\n\n\"The Amazon Washington Post put out a fake article that [Maguire] was going to quit, blaming the White House for something they wouldn't let him talk openly about -- and I was shocked,\" Trump said at the presser.\n\nThe transcript of Trump's call with Zelensky, declassified by Trump a day earlier, indicates that the call – which Trump made from the White House residence -- took place July 25 from 9:03 a.m. to 9:33 a.m. The document begins with the president congratulating Zelensky on his election victory, before asking for a “favor” in the form of Ukraine providing information about the hacking of a Democratic National Committee (DNC) server in 2016 as part of apparent election interference efforts.\n\nUKRAINE TRANSCRIPT SHOWS NO EXPLICIT QUID PRO QUO\n\nTrump referenced CrowdStrike, a cyber firm used by the DNC to investigate the attacks.\n\nSeparately, the transcript shows, the president then pushed for a closer look at Biden's own dealings in Ukraine.\n\nJoe Biden has acknowledged on camera that, when he was vice president, he successfully pressured Ukraine to fire its top prosecutor, Viktor Shokin, who was investigating the natural gas firm Burisma Holdings — where Hunter Biden was on the board. Shokin himself had separately been accused of corruption.\n\nMeanwhile, political scientist Ian Bremmer said the real scandal wasn't Biden's pressure to get rid of Shokin, but Hunter Biden's lucrative business work in Ukraine.\n\nHunter Biden took a key position at Burisma shortly after Joe Biden visited Ukraine in 2014 and pushed officials there to greatly increase natural gas production. Hunter made tens of thousands of dollars a month but had no relevant credentials.\n\n\"Impossible to justify $50k/month for Hunter Biden serving on a Ukrainian energy board w zero expertise unless he promised to sell access,\" Bremmer wrote.\n\n\"That’s a problem for the Vice President, but completely unrelated to Biden urging Ukraine President to fire his Special Prosecutor,\" Bremmer continued. \"[The prosecutor] was corrupt, refused to investigate anyone, and who Dems and GOP agreed needed to go.\"\n\nTrump said in the phone call with the Zelensky that he was focused primarily on the circumstances surrounding Shokin's termination.\n\n“There’s a lot of talk about Biden’s son, that Biden stopped the prosecution and a lot of people want to find out about that so whatever you can do with the Attorney General would be great,” Trump said in the phone call with the Zelensky. “Biden went around bragging that he stopped the prosecution so if you can look into it…It sounds horrible to me.”\n\nBIDEN UKRAINE DEALINGS: 7 ESSENTIAL FACTS\n\nAt the presser, Trump broadened the scope of his concerns to the Biden's business dealings generally, and said that he was reluctant to release the transcript because he was concerned about setting the \"precedent\" of releasing private calls with foreign leaders to \"the fake news media.\"\n\n\"But you folks were saying such lies about a call that was so innocent and so nice,\" Trump said, that he felt compelled to act.\n\nOn Wednesday, just prior to his press conference, Trump tweeted that he had told Republicans he supported a closer look into the Bidens' dealings in Ukraine.\n\n\"I have informed @GOPLeader Kevin McCarthy and all Republicans in the House that I fully support transparency on so-called whistleblower information but also insist on transparency from Joe Biden and his son Hunter, on the millions of dollars that have been quickly and easily taken out of Ukraine and China,\" Trump wrote.\n\n\"Additionally, I demand transparency from Democrats that went to Ukraine and attempted to force the new President to do things that they wanted under the form of political threat,\" he added.\n\nBipartisan efforts are underway for the whistleblower to testify before Congress.\n\nThe Justice Department – in a new letter from the Office of Legal Counsel obtained by Fox News –pushed back Wednesday on the claim that the whistleblower brought out something of “urgent concern” that would have to be turned over to Congress.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe letter also said the intelligence community inspector general found “some indicia of an arguable political bias on the part of the complainant in favor of a rival political candidate,” but still said the allegations “appeared credible.” Fox News previously reported that, according to a source, the individual also did not have “firsthand knowledge” of the phone call.\n\nSources, meanwhile, said the original allegations spoke to a possible campaign finance violation, but the DOJ concluded that Trump’s request for an investigation did not qualify as a “thing of value” for his campaign – and therefore did not constitute a criminal violation.\n\nFox News’ Alex Pappas, Ed Henry, Jake Gibson, Catherine Herridge, Kevin Corke and Brooke Singman contributed to this report.", "description": "A defiant President Trump said during a press conference in New York Wednesday that he wants \"full transparency\" not only over the \"so-called whistleblower\" allegations leveled against him, but also \"from Joe Biden and his son Hunter on the millions of dollars that have been quickly and easily taken out of Ukraine and China.\"", "authors": ["Gregg Re", "President Trump", "Referring To Democrats Jerry Nadler", "Adam Schiff", "Gregg Re Is A Lawyer", "Editor Based In Los Angeles. Follow Him On Twitter"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/25/694940094001_6089296565001_6089294552001-vs.jpg", "published_at": "2019-09-25"}