{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/girls-jaw-ripped-horse-riding-20538319", "downloaded_at": "2019-10-08 15:15:25.000262+00:00", "title": "Girl's jaw ripped off in horse riding injury doctor said was 'like a war wound'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA teenage girl's horror facial injuries in a horse-riding accident were among the worst a doctor had ever seen outside of a war zone.\n\nEmily Eccles, 15, was left with just one centimetre of skin keeping her jaw attached to the rest of her head after she smashed into a gatepost while out riding near Baslow, in Derbyshire, in August.\n\nEmily was taken to Sheffield Children's Hospital after finding herself on the floor, holding what remained of the bottom of her face in her own hands.\n\nBut consultant facial reconstructive surgeon Ricardo Mohammed-Ali rebuilt her face in a five-and-a-half hour long operation which was such a success that the teenager was back at school for the start of term, just a month after the accident.\n\nNow, two months on, Emily is seeing her scars fade by the day and hoping to persuade her parents to let her ride again.\n\n(Image: PA)\n\nShe explained how she had been out riding with a friend and her family when her horse was spooked by an exhaust popping on a car.\n\nThe horse galloped along a country path but, after her feet came out of the stirrups and she fell to one side, her head hit a wooden post.\n\nEmily said she remembers catching something red which flashed in front of her face as she fell.\n\n\"I just looked down and I was like, 'I don't know what that is',\" she told the PA news agency.\n\n(Image: PA)\n\n(Image: PA)\n\nShe said that, once in the ambulance: \"I just looked down and I could see teeth and bone and I said, 'is that my jaw?'.\"\n\nMr Mohammed-Ali pieced together Emily's face using three titanium plates, more than 160 stitches and managing to save all but one of her teeth.\n\nThe teenager, who is studying GCSEs at Wales High School, near Sheffield, and is also a talented skier, said that her horrified friends thought her injuries were like \"some kind of zombie\".\n\nEmily said she first tried not to look, but accidentally switched on her selfie camera as she was messaging a friend.\n\n\"It was like something you see in a film, it was really quite horrific,\" she said.\n\n(Image: PA)\n\n(Image: PA)\n\n\"At first I was thinking, I don't know what I'm going to do, I'm not going to look like me, I'm not going to have the same kind of life as I did before.\"\n\nNow the teenager is thanking Mr Mohammed-Ali for a recovery her mother has called \"miraculous\".\n\n\"He said that in a year's time, from speaking distance, you won't even be able to tell that anything's happened,\" Emily said.\n\nShe said: \"We can't thank him enough. Everything that he's done in his career up to that point led up to him being on call that night.\n\n\"If anything had gone any differently, I might not have had a bottom jaw.\"\n\n(Image: PA)\n\nEmily said she has written to the Queen to get the surgeon a knighthood and received a personal letter straight back from her secretary saying it had been referred to the relevant body.\n\n\"Saving people's lives and getting them back to normality definitely deserves some sort of recognition,\" she said.\n\n(Image: PA)\n\nEmily lives in a village just outside Sheffield with her teacher parents Michelle, 50, and Chris, 48; her brother Sam, 17, and their two dogs.\n\nShe said \"I'm not a horse rider\", but insisted: \"I'd like to ride a horse again it's my parents I have to convince.\"\n\nMrs Eccles said she was \"still thinking about it\".\n\nMr Mohammed-Ali said: \"It could have been worse, but it is one of the most significant injuries that I have seen in a child outside of areas of conflict.\"\n\nHe said: \"Emily's injury was significant in that the entire left side of her lower jaw from the front of the jaw to the joint was pulled away from the face and only retained by a small strip of skin.\n\n\"The nerves that supply sensation to the lip and chin was torn on both sides.\n\n\"Branches of the facial nerve that move the muscles of the lower lip were severed on both sides.\n\n\"The lower part of Emily's face was only attached by a piece of skin.\"\n\n(Image: PA)\n\nHe added: \"I am extremely pleased with her recovery so far.\"\n\nThe family said they are determined to support The Children's Hospital Charity's fundraising to help improve the Emergency Department and provide a helipad above the hospital.\n\nThe air ambulance was called to Emily's accident but it was decided to go by road, partly because the helicopter currently has to land in a park opposite the building, her family said.", "description": "WARNING - GRAPHIC IMAGES: Emily Eccles, 15, was left with just one centimetre of skin keeping her jaw attached after she smashed into a gatepost while out riding near Baslow, Derbyshire", "authors": ["Dave Higgens", "Image", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20538346.ece/ALTERNATES/s1200/0_Emily-Eccles-jaw-injury.jpg", "published_at": "2019-10-08"}