{"pub": "financialpost", "url": "https://business.financialpost.com/transportation/autos/gm-resumes-production-at-oshawa-plant-despite-continued-strike-in-u-s", "downloaded_at": "2019-10-19 10:55:26.569728+00:00", "title": "GM resumes production at Oshawa plant despite continued strike in U.S.", "language": "en", "text": "General Motors Canada resumed vehicle production at its Oshawa, Ont. facility on Friday despite the continued labour conflict in the United States, where 48,000 workers will continue to strike for at least one more week as the United Auto Workers members vote whether to ratify the tentative agreement with the automaker.\n\nGM Canada was forced to scale back production at its plants in Oshawa and St. Catharines, Ont. during the strike given the integrated, just-in-time nature of North America’s auto manufacturing industry. It closed the Oshawa plant first, halting car and truck production and sending about 2,100 workers home one month ago.\n\n“I can confirm that we called all workers back at Oshawa today and will be resuming car production,” GM Canada spokeswoman Jennifer Wright said in an email.\n\n“Our CAMI plant in Ingersoll continues to operate regular production building the Chevrolet Equinox and the St. Catharines transmission line and Oshawa Stamping continues to operate supplying CAMI.”\n\nAbout two thirds of the 1,100 hourly workers at St. Catharines remained off the job Friday, with the remaining third continuing to work on transmissions destined for the Ingersoll plant, which was not affected by the strike.\n\n“In Canada we are working hard to get all three GM Canada operations back to normal operations as soon as possible,” Wright said.\n\nThe return to work comes earlier than expected by the Canadian workers’ union, Unifor. It also arrives as the Oshawa plant prepares to wind down vehicle production permanently by the end of the year. It was one of the North American plants slated for closure in a massive restructuring announced last year, a plan that in part sparked the labour action over fears of moving production jobs from the U.S. to Mexico.\n\nIn a statement, GM said its goal throughout bargaining was to ensure the future of the company.\n\n“The agreement reflects our commitment to U.S. manufacturing through the creation of new jobs and increased investment,” GM stated.\n\nStill, stable work in Ontario will be contingent on the U.S. operations resuming. Picketing will end next week if UAW members ratify the deal in a series of votes that will take place between Saturday and Friday.\n\nThe union’s leadership, which recommended that members accept the deal, believes it will pass muster, according to a statement from UAW vice president Terry Dittes.\n\nThe strike cost GM between US$50 million to $100 million daily, according to analysts’ estimates that peg the total cost at well over $1 billion.", "description": "GM had closed the Oshawa plant a month ago, affecting 2,100 workers", "authors": [], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/oshawa.jpg", "published_at": "2019-10-18"}