{"pub": "yahoo", "url": "https://finance.yahoo.com/news/tencent-mystery-drop-traders-eyeing-041823968.html", "downloaded_at": "2019-10-23 08:39:00.036299+00:00", "title": "Tencent Shares Risk Losing Support Level as Losses Accelerate", "language": "en", "text": "(Bloomberg) -- Tencent Holdings Ltd.’s shares are dangerously close to losing a key support level.\n\nThe biggest stock in Asia was 2.1% lower at 3:13 p.m. in Hong Kong despite no immediately apparent trigger. Theories circulating round some trading floors included souring sentiment from investors in China, as well as concern that Tencent’s decision to air National Basketball Association games may backfire.\n\nThe declines briefly pushed the stock’s price below HK$320, which has provided a floor for declines on three occasions this year. Holding above that level through the close would be key, especially as the stock’s successively smaller bounces suggest the support is at risk of breaking. The stock recovered Wednesday to HK$320.60.\n\nTencent decided to live stream NBA games from Wednesday, putting it at odds with a decision from China’s state broadcaster to stick to its boycott. Tencent also drew the ire of Hong Kong when Blizzard, partly owned by the company, banned a gamer for endorsing Hong Kong’s pro-democracy movement.\n\nMainland-based investors sold a net $54 million of Tencent shares through trading links with Hong Kong in the two days through Tuesday, according to the city’s exchange data. The stock has lost almost 20% since its April peak, with three weeks to go before the company reports quarterly earnings.\n\n(Updates with performance in second and third paragraph.)\n\n--With assistance from Lulu Yilun Chen.\n\nTo contact the reporter on this story: Elena Popina in Hong Kong at epopina@bloomberg.net\n\nTo contact the editor responsible for this story: Sofia Horta e Costa at shortaecosta@bloomberg.net\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Tencent Holdings Ltd.’s shares are dangerously close to losing a key support level.The biggest stock in Asia was 2.1% lower at 3:13 p.m. in Hong Kong despite no immediately apparent trigger. Theories circulating round some trading floors included souring sentiment from investors in China", "authors": ["Elena Popina"], "top_image": "https://s.yimg.com/uu/api/res/1.2/sJOfepYyjSqGsXEYW4A5UA--~B/aD0xMzM0O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_technology_68/9de260b0247a1ad383efc529e5c78b89", "published_at": "2019-10-23"}