{"pub": "yahoo", "url": "https://news.yahoo.com/know-trumps-withdrawal-northern-syria-232143049.html", "downloaded_at": "2019-10-09 00:48:14.193713+00:00", "title": "What we know about Trump's withdrawal from northern Syria as critics argue it abandons Kurdish allies", "language": "en", "text": "Donald Trump has doubled down on his unexpected decision to pull U.S. troops out of northern Syria despite backlash from critics on all sides, who argue he is leaving Kurdish allies open to an attack from Turkish forces.\n\nThe announcement and criticism come as the president is facing an impeachment inquiry into his dealings with Ukraine's leader.\n\nHere's what we know about the announcement that has even Trump's closest allies in shock:\n\nTrump announces his decision to pull out of northern Syria\n\nOn Sunday, the White House said that the U.S. would withdraw troops from a region of northern Syria that borders Turkey. This comes ahead of a Turkish military incursion into Syria against those it considers terrorist threats.\n\nAmong those perceived threats are Kurdish fighters, part of the Syrian Democratic Forces, who have been allied with the United States in fighting the Islamic State, or ISIS.\n\nMore: 'A stain on America's honor': Lindsey Graham says Trump's Syria pullout abandons Kurds, helps ISIS\n\nTrump defended the move as an attempt to fulfill a campaign promise to end U.S. involvement in wars such as in Syria.\n\n\"I campaigned on the fact that I was going to bring our soldiers home,\" Trump told reporters of the decision.\n\nThe White House said the announcement came after Trump talked to Turkish President Recep Tayyip Erdogan, who believes that Kurdish forces are allied with insurgents inside Turkey, on the phone.\n\nU.S. relationships with Kurdish and Turkish forces\n\nThe United States has fought alongside the Syrian Democratic Forces against the Islamic State, capturing thousands of terrorists in the region.\n\n\"We may be in the process of leaving Syria, but in no way have we Abandoned the Kurds, who are special people and wonderful fighters,\" Trump said Tuesday.\n\nA State Department official said that Trump’s decision to withdraw two military units from the border was based on two goals: He does not want U.S. forces to be seen as greenlighting Turkey’s plans, and he does he not want Americans in the line of fire if Erdogan goes through with his threat.\n\nThe Kurdish fighters said in a statement that their U.S. allies \"did not fulfill their obligations.\"\n\n....almost 3 years, but it is time for us to get out of these ridiculous Endless Wars, many of them tribal, and bring our soldiers home. WE WILL FIGHT WHERE IT IS TO OUR BENEFIT, AND ONLY FIGHT TO WIN. Turkey, Europe, Syria, Iran, Iraq, Russia and the Kurds will now have to..... — Donald J. Trump (@realDonaldTrump) October 7, 2019\n\nTrump first announced his intention to withdraw U.S. troops from Syria in 2018. Amid a backlash, he later agreed to keep a residual American presence there. Trump's announced withdrawal from Syria in late 2018 also led to the resignation of then-Defense Secretary Jim Mattis.\n\nForeign policy experts have warned that allowing Turkey into the region could lead to a massacre of the Kurds and would be seen as an American betrayal of a vital military ally.\n\nTrump tweeted on Monday, \"WE WILL FIGHT WHERE IT IS TO OUR BENEFIT, AND ONLY FIGHT TO WIN.\"\n\nWho are the Kurds?: A Middle Eastern people with 'no friends but the mountains'\n\nWhat is Turkey expected to do next?\n\nAccording to the White House, the move from the United States does not signal support of the Turkish mission to invade Syria.\n\n\"Turkey will soon be moving forward with its long-planned operation into Northern Syria. The United States Armed Forces will not support or be involved in the operation,\" the White House said.\n\nTurkey has long expressed its intentions to quell perceived threats in the region.\n\nThe White House says that captured ISIS fighters will now be under Turkey's control. If they're released, they could return to the battlefield.\n\nTrump said that Turkey \"must, with Europe and others\" guard over the captured Islamic State fighters held by the Syrian Democratic Forces if Erdogan sends his forces into Syria.\n\nThe SDF warned that Turkey's planned \"invasion\" would \"have a major negative impact on our war on ISIS and will destroy all the stability achieved during the past years.\"\n\nThe Kurdish fighters said they \"will not hesitate for a moment to defend ourselves\" and they called on \"Arabs Kurds, Syrians and Assyrians to join forces and stand with their legitimate forces to defend our country against this Turkish aggression.\"", "description": "In a decision that has drawn bipartisan condemnation, President Donald Trump announced the U.S. would withdraw troops from northern Syria.", "authors": ["Jeanine Santucci", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/AIshepa51hiTab9hx9dkxw--~B/aD0yMzM0O3c9MzUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/8113414c6fb500483eda1409cac80422", "published_at": "2019-10-08"}