{"pub": "businessinsider", "url": "https://businessinsider.com/us-auto-workers-union-strike-gm-uaw-walk-out-2019-9", "downloaded_at": "2019-09-15 23:11:01.519739+00:00", "title": "The US auto workers union just decided to walk out on GM — here's why they're striking", "language": "en", "text": "General Motors' 46,000 employees represented by the United Auto Workers will strike Sunday night, the first major labor action in over a decade against a US carmaker and the largest walkout since 1982.\n\nThe current GM contract with the UAW, under negotiation all summer long, lapsed with no extension at midnight on Saturday; pro forma extensions were agreed to with Ford and Fiat Chrysler Automobiles, both of whom were awaiting the outcome of the GM deal, which would form a template for a new four-year agreement between the union and the Detroit Big Three.\n\n\"We stood up for General Motors when they needed us most. Now we are standing together in unity and solidarity for our Members, their families and the communities where we work and live,\" UAW Vice-President Terry Dittes said in a statement, alluding the the UAW's role in GM 2009 bailout and bankruptcy during the financial crisis.\n\nGM countered with its own statement, taking the unusual step of disclosing the details of its position. \"We presented a strong offer that improves wages, benefits and grows US jobs in substantive ways and it is disappointing that the UAW leadership has chosen to strike at midnight tonight,\" the company said. \"We have negotiated in good faith and with a sense of urgency. Our goal remains to build a strong future for our employees and our business.\"\n\nRead more: 5 reasons why Elon Musk should rescue a GM factory in Ohio\n\nHealth care costs, temporary workers, and closed factories\n\nGM CEO Mary Barra and Trump at the White House. Getty Images\n\nThe situation was intense, as UAW negotiators meet with GM representatives in Detroit Sunday morning to hammer out a bargain. But a strike has been in the air since 2018, after GM \"unallocated\" its Lordstown factory in Ohio, where the carmaker had been building its slow-selling Chevy Cruze sedan on a single shift. GM also announced plans to unallocate three other plants, citing concerns about the cost of under-utilized manufacturing capacity.\n\nThe UAW was enraged — and President Donal Trump, who captured the Ohio district where Lordstown is located in the 2016 election, jumped in, pressuring GM and CEO Mary Barra to keep the plant open, possibly by committing a new vehicle to the facility (GM provided relocation and reemployment opportunities to Lordstown's approximately 1,500 workers).\n\nCombined with other legacy issues — mainly health-care costs and policies around hiring temporary workers at a lower wage than UAW members — the Lordstown decision set the stage for a lot of serious saber-rattling by the union. The UAW has been signaling that it's ready for a walkoff since before the contract negotiations began.\n\nA focused GM versus a UAW rocked by scandal — and a booming US auto market\n\nUnited Auto Workers (UAW) union Vice-President Terry Dittes addresses delegates during the 'Special Convention on Collective Bargaining' in Detroit. Reuters\n\nA new contract would actually be straightforward to achieve. GM's UAW membership pays just 3% of its healthcare cost; they don't have the Cadillac of insurance plans — they have a Rolls-Royce, as even GM's white-color workforce pays for a third of its coverage. From its statement, GM looks to be supporting the existing plan; its statement stressed that the company offered \"nationally leading\" health care. So ongoing negotiations could center on the UAW accepting a higher level of temporary hiring to better align GM's cost with the so-called foreign transplant automakers such as Toyota and BMW, who operate plants in the non-union US South.\n\nGM indicated that it would sweeten the pot by improving its profit-sharing formula, improving a system that put almost $11,000 in workers' pockets this year, after GM posted another hefty annual surplus in 2018. The company also said it had proposed to invest $7 billion and add 5,400 jobs in the US.\n\nThe automaker perhaps missed a golden opportunity to deflect the UAW's ire over Lordstown when it decided to fire-up production of its new Chevy Blazer at a factory in Mexico, where hourly labor costs are a fraction of what they are in the US. But GM likely expects Mexico to be an important market going forward, and the hangover of the carmaker's 2009 bailout and bankruptcy have shaped its strategies; Barra is determined to make sure GM doesn't face another crisis and has been making a series of tough calls, such as selling its faltering European division while simultaneously ramping up investment in autonomous mobility and electric vehicles.\n\nThe strike is no shock\n\nThe strike could be longer than 2007's. Thomson Reuters\n\nIn this context, a strike isn't surprising. After nearly a decade of expansion, the US auto industry is riding high despite concerns about a downturn, so if the UAW doesn't flex its muscle now, it might not get a chance in four years.\n\nThe union, however, is in a weak position, with its leadership rocked by scandals. Most recently, UAW President Gary Jones' home was reportedly raided by the FBI in connection with an investigation into embezzlement by union officials. The Detroit News reported that Jones last week dodged efforts to remove him from his role.\n\nThe big question now is whether the UAW is putting all its cards on the table against a determined GM, in the hope that a full strike convinces the company that it needs to give more ground than it's been willing to. A short action, similar to 2007, isn't likely to alter GM's position, and that could be why the union has been preparing its membership for a more extended strike for much of 2019.\n\nThe UAW might also be counting on President Trump to leap into the fray, taking up the membership's cause and bucking traditional Republican anti-unionism so that he can fire up his Midwestern base.\n\nUnless a strike drags on, consumers outside the Midwest aren't likely to notice, given that it's late in the year. But GM, like all automakers, likes to finish a year with strong sales doesn't want to see its long run of annual profits snapped, so an extended strike could cause the largest US carmaker to endure some pain, testing Barra's now-legendary discipline.\n\nThis story has been updated.", "description": "The UAW ordered its membership to strike General Motors on Sunday night after contract negotiations broke down.", "authors": ["Matthew Debord"], "top_image": "https://amp.businessinsider.com/images/5d7e61d22e22af02a4751d72-2732-1366.jpg", "published_at": "2019-09-15"}