{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugby-world-cup-2019/article-7599815/Steve-Hansen-braces-Blacks-England-kicking-contest-Rugby-World-Cup-semi-final-ends-level.html", "downloaded_at": "2019-10-22 15:17:13.868426+00:00", "title": "Steve Hansen braces All Blacks for England kicking contest if Rugby World Cup semi-final ends level", "language": "en", "text": "All Blacks coach Steve Hansen is leaving nothing to chance in his Rugby World Cup semi-final against England, even the unlikely possibility of a kicking contest to decide the game.\n\nNew Zealand will face England in an expected evenly contested semi-final in Yokohama on Sunday, with neither side red-hot favourites for a place in the Nov. 2 final.\n\nUnder tournament rules if a knockout match is locked at full time, the sides will play two 10-minute periods of extra time.\n\nSteve Hansen says New Zealand are preparing for all possibilities in their semi-final vs England\n\nIf they are still deadlocked a further sudden-death period of 10 minutes will be played where the first points scorers win.\n\nAfter that, five players from each team will take shots at goal from pre-determined positions on the field before it then goes to sudden death.\n\n'It's unlikely it will be decided that way,' Hansen told reporters in Tokyo on Tuesday when he was asked about the possibility of the scenario.\n\n'Have we prepared for that? We know those are the rules, so yes. You'd be foolish if you hadn't prepared for it.\n\n'But I would be highly surprised if after 80 minutes, then 10 minutes each way, then sudden-death extra-time - by which time there'll be bugger all people standing - that someone hasn't scored some points.\n\nHansen said it would be foolish not to prepare his side for the unlikely kicking contest decider\n\n'But funnier things have happened, eh?'\n\nFunnier things did happen earlier this year in another World Cup match between New Zealand and England.\n\nWith the scores tied after the regular 50 overs and then sudden-death super over, New Zealand's cricketers lost the final to England in July 14 on a count back of boundaries hit during the game and Hansen was not impressed with the ending.\n\n'I don't know if they got the cricket one right really,' he said with a wry grin.\n\nWhile the responsibility of the kick-off is likely to fall to the backs, lock Scott Barrett, whose brothers Beauden and Jordie are regular goal kickers in the team, also backed himself if called upon.\n\n'I'm sure there'd be a few backs first,' said Barrett, who added he was sharing a room with Beauden this week for the first time since 2002. 'We'd have to be quite short.\n\n'(But) out of the forwards, I'd definitely back myself.'", "description": "New Zealand coach Steve Hansen is preparing his team of all possibilities in his side's Rugby World Cup semi-final clash against England, even the unlikely possibility of a kicking contest.", "authors": ["Greg Stuchbury"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/10/20028544-0-image-a-3_1571736902344.jpg", "published_at": "2019-10-22"}