{"pub": "fox", "url": "https://foxnews.com/science/life-on-mars-microorganisms-humanity-survive", "downloaded_at": "2019-10-01 15:27:33.581987+00:00", "title": "Life on Mars? Researcher wants microbes in space to help humans survive 'barren sterile planets'", "language": "en", "text": "A controversial new paper suggests that in order for humanity to survive \"barren sterile planets\" such as Mars, researchers have to send other forms of life there first — in the form of microbes.\n\nHumanity needs to find out whether terrestrial microorganisms can survive in an extraterrestrial environment so that mankind can colonize planets like Mars, the study suggests.\n\n\"Life as we know it cannot exist without beneficial microorganisms,\" Jose Lopez, a professor at Nova Southeastern University, said in a statement. \"They are here on our planet and help define symbiotic associations — the living together of multiple organisms to create a greater whole. To survive on a barren (and as far as all voyages to date tell us) sterile planets, we will have to take beneficial microbes with us.\"\n\nUFO VIDEOS ARE FOOTAGE OF REAL 'UNIDENTIFIED' OBJECTS, US NAVY ACKNOWLEDGES\n\n\"This will take time to prepare, discern and we are not advocating a rush to inoculate, but only after rigorous, systematic research on Earth,\" Lopez added.\n\nThe study is at odds with regulations from across the globe that prohibit introducing microbes from Earth on other planets.\n\n\"The United States is a signatory to an international treaty that stipulates that exploration must be conducted in a manner that avoids harmful contamination of celestial bodies,\" NASA wrote on its website concerning planetary protection protocols.\n\nFox News has reached out to NASA with a request for comment for this story.\n\nDespite that seemingly major obstacle, Lopez and the other researchers believe it is \"inevitable\" that microbes will be introduced into outer space.\n\n\"Mainly, microbial introduction should not be considered accidental but inevitable,\" the study's abstract reads.\n\nThe abstract adds that although it is imperative to control and track these microbes, \"we also believe that we must discuss the role of microbes as primary colonists and assets, rather than serendipitous accidents, for future plans of extraterrestrial colonization.\"\n\nLopez and the other researchers argue that microbes will be necessary to terraform the planet, just as they have done on Earth. Not only will this save money and time, but it can also help researchers further understand microorganisms and the roles they play on Earth.\n\n\"Life on Earth started with relatively simple microorganisms which have the capacity to adapt and evolve to extreme conditions, which defined earth's habitats in the ancient past,\" Lopez added. \"Cyanobacteria, for example, provided most of the oxygen we now breath more than two billion years ago. To find the best microbial candidates, we will have to confer with many microbiologists and carry out research here on our home planet to find the optimal microbial species.\"\n\nThe research has been published in the journal FEMS Microbiology Ecology.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM", "description": "A controversial new research paper suggests that in order for humanity to survive \"barren sterile planets\" such as Mars, we have to send other forms of life there first — in the form of microbes.", "authors": ["Chris Ciaccia"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/07/L868HCTDT8ueAXXrcyXoWc.jpg", "published_at": "2019-10-01"}