{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/30/a-capsule-look-at-the-brewers-nationals-playoff-ga", "downloaded_at": "2019-10-01 04:29:02.904954+00:00", "title": "A capsule look at the Brewers-Nationals playoff game", "language": "en", "text": "A look at the National League wild-card game between the Milwaukee Brewers and Washington Nationals:\n\n___\n\nSchedule: Tuesday, at Washington, 8:08 p.m. EDT (TBS).\n\n___\n\nSeason Series: Brewers won 4-2.\n\n___\n\nProjected Lineups:\n\nBrewers: RF Trent Grisham (.231, 6 HRs, 24 RBIs), C Yasmani Grandal (.246, 28, 77, 109 walks), 3B Mike Moustakas (.254, 35, 87), LF Ryan Braun (.285, 22, 75), 2B Keston Hiura (.303, 19, 49), 1B Eric Thames (.247, 25, 61), CF Lorenzo Cain (.260, 11, 48) or Ben Gamel (.248, 7, 33), SS Orlando Arcia (.223, 15, 59).\n\nNationals: SS Trea Turner (.298, 19, 57, 37 2Bs, 35 SBs, 96 runs), RF Adam Eaton (.279, 15, 49, 15 SBs, 103 runs), 3B Anthony Rendon (.319, 34, 126, 44 2Bs, 117 runs, 1.010 OPS), LF Juan Soto (.282, 34, 110, 110 runs, .949 OPS), 1B Howie Kendrick (.344, 17, 62), 2B Asdrúbal Cabrera (.235, 12, 51 in 93 games with Texas; .323, 6, 40 in 38 games with Washington), CF Victor Robles (.255, 17, 65, 28 SBs), C Kurt Suzuki (.264, 17, 63).\n\n___\n\nStarting Pitchers:\n\nBrewers: RH Brandon Woodruff (11-3, 3.62 ERA, 143 Ks, 121 2/3 IP; went 2 innings in each of two starts since returning from injured list in September).\n\nNationals: RH Max Scherzer (11-7, 2.92, 243 Ks, 172 1/3 IP).\n\n___\n\nRelievers:\n\nBrewers: LH Josh Hader (3-5, 2.62 ERA, 37/44 saves, 138 Ks, 75 2/3 IP), RH Junior Guerra (9-5, 3.55, 3 saves), RH Matt Albers (8-6, 5.13, 4 saves), LH Brent Suter (4-0, 0.49), RH Jordan Lyles (12-8, 4.15, 33 starts with Pirates and Brewers), LH Drew Pomeranz (2-10, 4.85 with Giants and Brewers).\n\nNationals: LH Sean Doolittle (6-5, 4.05, 29/35 saves), RH Stephen Strasburg (18-6, 3.32, 251 Ks, NL-high 209 IP in 33 starts), LH Patrick Corbin (14-7, 3.25, 238 Ks, 202 IP), RH Daniel Hudson (6-3, 3.00, 2 saves with Toronto; 3-0, 1.44, 6 saves with Washington), RH Fernando Rodney (0-2, 9.42 with Oakland; 0-3, 4.05, 2 saves with Washington), RH Hunter Strickland (0-1, 8.10, 2 saves with Seattle; 2-0, 5.14 with Washington); RH Tanner Rainey (2-3, 3.91), RH Wander Suero (6-9, 4.54, 1 save).\n\n___\n\nMatchups:\n\nFirst postseason meeting between the Brewers and Nationals, who moved to Washington from Montreal before the 2005 season. Winner faces the NL West champion Dodgers in a best-of-five Division Series beginning Thursday in Los Angeles. … This is a study in contrasting approaches: The Nationals’ success is built on a terrific rotation and despite a worst-in-the-majors bullpen, while the Brewers go about things completely differently, often using an opener and then mixing and matching a series of strong relievers the rest of the way. … Moustakas (.379, 4 HRs) had the most success against the Nationals in 2019, while Braun batted .429 against them, with a couple of home runs. … Scherzer has dominated Braun and Cain: The outfielders are a combined 0 for 29 with 12 strikeouts against the right-hander across their careers. … Braun, the 2011 NL MVP, and Cain are both dealing with late-season injuries. Brewers manager Craig Counsell made clear that he expects Braun to start in left field even though he’s been troubled recently by a strained left calf, while things are less certain with Cain, who sprained his left ankle. Cain had that ankle taped up as he walked around the visitors’ clubhouse at Nationals Park on Monday and said he was hoping to play Tuesday. … Washington set a franchise record with 231 homers this season. … Dave Martinez makes his postseason debut as a manager; his Nationals club went 82-80 and missed the playoffs in his rookie season as a skipper in 2018. … Washington’s 5.66 bullpen ERA was worst in the majors. … Robles ranked fourth in the majors with 12 outfield assists.\n\n___\n\nBig Picture:\n\nBrewers: Milwaukee lost its best player, 2018 NL MVP Christian Yelich, for the rest of the season with a broken kneecap in September and still managed to finish strong and go from third place in the NL Central to a playoff berth. This is a playoff-tested team that made it to Game 7 of the NL Championship Series a year ago before losing to the Dodgers. … Milwaukee was 68-66 in late August but went on an 18-2 tear to move into contention. The Brewers even went into the final weekend with a chance to catch St. Louis for the division title but got swept in Colorado to end up with an 89-73 record and the second wild card. … Milwaukee batters led the NL with 692 walks and were third in the league with 250 homers, but otherwise the offense was hardly what opponents worried about, especially after Yelich, who went deep 44 times in 2019, went down. It was Milwaukee’s pitching, specifically the bullpen, that carried the team down the stretch.\n\nNationals: Surged to a playoff spot for the fifth time in eight years by turning things around after a dismal start; they were 19-31 after a May 23 loss to the Mets completed a four-game sweep. Washington is the first team in more than a century to fall 12 games below .500 and finish with 93 wins or more. … There were plenty of early calls for Martinez to be dismissed, but GM Mike Rizzo never wavered in his public support of the skipper. In the end, Washington (93-69) won 11 more games than in 2018, when it missed the playoffs after two straight NL East titles under manager Dusty Baker, who then got fired. … Success is built mainly on the starting rotation, which is among the best in the majors, led by Scherzer, Strasburg and Corbin. Those three all ranked in the top 10 in the NL in ERA, strikeouts and opponents’ batting average and would figure to give Washington a shot in a Division Series against the NL-best Dodgers if the Nationals can get past the wild-card game. … Since moving to Washington from Montreal, the franchise has yet to advance in the playoffs, losing Division Series in 2012, 2014, 2016 and 2017. That includes an 0-3 record in win-or-go-home Game 5s, each time at home. … This is the Nationals’ first appearance as a wild-card team. … Martinez missed three games and part of a fourth because of a heart problem in September. He had a medical procedure and was back in the dugout a few days later.\n\n___\n\nWatch For:\n\n- Mad Max. Scherzer makes his 14th career postseason start and 17th appearance for Washington or Detroit; the three-time Cy Young Award winner is 4-5 with a 3.73 ERA and 100 strikeouts in 82 innings. The last time Washington was in the playoffs, in the 2017 NLDS against the Chicago Cubs, Scherzer appeared in relief in the fifth inning of Game 5 at home and allowed four runs, two earned, and was charged with the loss in a 9-8 defeat that eliminated the Nationals. The righty has pitched in four playoff games for Washington - and the team has lost all four.\n\n- Open-And-Shut Case. Woodruff missed about two months with a strained left oblique and only threw four innings after returning in September, although he didn’t allow a hit. That fits the Brewers‘ way of doing things, though: Put a pitcher on the mound to get things going, but then start shuttling guys in and out. Counsell has a tremendously deep bullpen, full of lefties such as Suter and Pomeranz he can turn to before he even goes to shutdown closer Hader and his swing-and-miss stuff.\n\n- Rendon’s Bat. Martinez has lobbied for Rendon to get MVP consideration and there’s no doubt who Washington’s best hitter has been all season. He led the NL in RBIs and was second in OPS and in the top five in batting average.\n\n- Offensive Offense. Without Yelich, the Brewers really could use a healthy and effective Braun and Cain, because they don’t boast a lot of other run-producers. Only one NL playoff team, St. Louis, scored fewer runs than Milwaukee this season - and the Brewers‘ full-season numbers include what Yelich did before getting injured.\n\n___\n\nMore AP MLB: https://apnews.com/tag/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "A look at the National League wild-card game between the Milwaukee Brewers and Washington Nationals:", "authors": ["The Washington Times Http", "The Associated Press"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/30/brewers_nationals_preview_baseball_56167_c0-104-2482-1551_s1770x1032.jpg?e2477739534fc76431782d6c717392e6dbb8531c", "published_at": "2019-09-30"}