{"pub": "huffpost", "url": "https://huffpost.com/entry/what-happened-skinny-pete-el-camino-police_n_5da109f4e4b06ddfc519f0e1", "downloaded_at": "2019-10-18 01:06:13.033441+00:00", "title": "What Happened To Skinny Pete In 'El Camino'? This Real-Life Police Officer Knows", "language": "en", "text": "In finally showing what happened to Jesse Pinkman (Aaron Paul), “El Camino” tied up major loose ends from “Breaking Bad.” But the show’s epilogue also left us with more questions, perhaps most notably: What the heck happened to Skinny Pete?\n\nIn “El Camino,” Skinny Pete (Charles Baker) helps Jesse by giving him a replacement ride for his stolen El Camino just before the cops arrive. Jesse manages to get away as a line of police cars head toward Pete’s house, but we never get to see what happens.\n\nTo get to the bottom of this, we enlisted the help of a real-life criminal investigator, Albuquerque police officer Simon Drobik.\n\nOn the first day that “Breaking Bad” started filming in Albuquerque, Drobik and his police department were there to shut down the streets for production, he told HuffPost. All these years later, he was recruited by series creator Vince Gilligan to serve as a police adviser on “El Camino.” Drobik has also made appearances in “Better Call Saul” and the new movie, showing up as one of the police responders at Ed’s (Robert Forster) vacuum store:\n\nNetflix Simon Drobik in \"El Camino.\"\n\nDrobik was asked to choreograph the “El Camino” police scenes to make sure they felt authentic and, in doing so, he told us there was a deleted scene explaining what really happened to Skinny Pete.\n\n“We did a really good SWAT scene when we hit Skinny Pete’s house. I’m sure that’ll be on the extras at some point, but it just didn’t make the cut because they were just trying to crunch it down,” Drobik said. “We choreographed a SWAT team of them entering and arresting Skinny Pete. Basically, when he’s out there with the El Camino waiting for the cops to show up, the next moment would be showing up and hitting his house with the SWAT team.”\n\nYou can see part of the aftermath of the scene in one of the trailers as Skinny Pete gets interrogated by police.\n\n“He would have definitely been interviewed,” Drobik added. “The trailer had him being interviewed, so it did allude to him being taken into custody. But Skinny Pete, being the faithful dude that he is, he just plays the part ― doesn’t give up the goods.”\n\nSo what happened to Pete? Drobik said he faced much more than an interrogation.\n\n“He had a stolen car on his property, and I think he took the fall for that. So he’d be looking at a felony receiving and transferring of a stolen motor vehicle. I’m sure Skinny Pete would’ve done some time,” the officer said. “But I’m sure that’s not hard for him because of his background.”\n\nBesides giving us the skinny on Pete, Drobik also pointed out some of the details that were added to make “El Camino” look realistic.\n\nThe line of cops headed to Skinny Pete’s house could be a real-world response.\n\nNetflix Scene from \"El Camino.\"\n\n“Vince wanted something really intense, and you kind of feel that, like, ‘Oh man, is he about to get popped?’” Drobik said of the line of police cars passing Jesse.\n\nIf the events in the “Breaking Bad” finale happened in real life, they might actually elicit that type of all-hands-on-deck response, the officer said.\n\n“If something were to happen that ... that type of shooting, the whole city’s really going to start showing up,” he said.\n\nCars do get dumped hundreds of miles away to throw off police.\n\nNetflix Badger on his way to throw police off the scent.\n\nIn the movie, Badger (Matt Jones) attempts to leave Skinny Pete’s car near the Mexican border, trying to convince police that Jesse had driven south in it to escape. Drobik called that detail a “brilliant” addition by Gilligan.\n\n“That’s true life stuff,” Drobik said. “That does happen. Cars get stashed in places. Where we find them ... we get the prints, we dust it, try to figure out where it’s from, and putting all the pieces together.”\n\nIf you look closely, Todd’s apartment shows signs that it’s been thoroughly searched.\n\nNetflix Jesse Pinkman arrives at Todd's apartment in \"El Camino.\"\n\nBecause the police search Todd’s (Jesse Plemons) apartment before Jesse arrives in “El Camino,” Drobik said a lot of care was taken to stage it as if the cops had actually been there.\n\n“The warrant’s up on the door ... you can’t really see it, but there’s detailed stuff where the warrants are on the table,” Drobik said. “There’s a lot of fingerprint dust. For narcotics guys, we look really hard, so we removed all the plates from the walls to see if there’s trap doors.”\n\nThose were real cops posted outside the Pinkman house.\n\nNetflix Mr. and Mrs. Pinkman (Tess Harper and Michael Bofshever) receive a call from Jesse in \"El Camino.\"\n\nIn order to take some guns from his parents’ house, Jesse draws them away, pretending that he needs his mom and dad to pick him up so he can turn himself in. When they leave, presumably undercover officers trail behind them.\n\n“If we’re looking for a suspect, we’re going to go to his girlfriend’s house and mom’s house, see if he shows up. Most people return to what they know,” Drobik said.\n\nBut not all the officers left the house. To make it more authentic, Drobik said the officers still stationed outside the Pinkman house were actual police officers.\n\n“When it comes to detail, they wanted cops who could walk the walk and talk the talk, hold guns right and look the part,” Drobik said. “It’s so incredibly detailed behind the scenes of every single shot, like they really do their homework and really know what they want. They just don’t want some random guy in there pretending. They want the real thing.”", "description": "And other behind-the-scenes secrets from cop Simon Drobik, who also stars in the \"Breaking Bad\" sequel.", "authors": ["Entertainment Editor"], "top_image": "https://img.huffingtonpost.com/asset/5da70b48210000150e34a1b7.png?cache=sjgqa8yysn&ops=1778_1000", "published_at": "2019-10-17"}