{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/guterres-warns-money-pay-staff-month-191008201234597.html", "downloaded_at": "2019-10-09 00:28:57.096206+00:00", "title": "Guterres warns UN may not have money to pay staff next month", "language": "en", "text": "The United Nations may not have enough money for staff salaries next month if member states do not pay what they owe, UN Secretary-General Antonio Guterres has warned.\n\nHe told the 193-member UN General Assembly's budget committee on Tuesday that if he had not worked since January to cut spending then \"we would not have had the liquidity to support\" the annual gathering of world leaders last month.\n\n\"This month, we will reach the deepest deficit of the decade. We risk ... entering November without enough cash to cover payrolls,\" said Guterres. \"Our work and our reforms are at risk.\"\n\n190526122705767\n\nThe US is the largest contributor - responsible for 22 percent of the more than $3.3bn regular budget for 2019, which pays for work including political, humanitarian, disarmament, economic and social affairs and communications.\n\nWashington owes some $381m for prior regular budgets and $674m for the 2019 regular budget.\n\nThe US mission to the UN confirmed the figures. It did not immediately respond to a request for comment on when it might pay.\n\nUS President Donald Trump has said Washington is shouldering an unfair burden of the cost of the UN and has pushed for reforms of the world body. Guterres has been working to improve UN operations and cut costs.\n\nUN spokesperson Stephane Dujarric said so far 129 countries had paid their dues for 2019, which amounted to almost two billion dollars.\n\nGuterres said he introduced extraordinary measures last month to cope with the shortfall - vacant posts cannot be filled, only essential travel is allowed, some meetings may have to be cancelled or deferred.\n\nUN operations in New York, Geneva, Vienna and Nairobi and at regional commissions will be affected.\n\nUN peacekeeping missions are funded by a separate budget, which was a $6.7bn peacekeeping budget for the year to June 30, 2019, and $6.51bn for the year to June 30, 2020.\n\nThe US is responsible for nearly 28 percent of the peacekeeping budget but has pledged to pay only 25 percent - as required by US law.\n\nWashington currently owes some $2.4bn for peacekeeping missions.\n\nThe top contributing countries are Ethiopia, India, Bangladesh, Nepal and Rwanda. They pay their troops according to their national salary scales and are reimbursed by the UN.\n\nAs of July 2019, the UN paid $1,428 a month to each soldier.\n\nThe UN says its peacekeeping operations cost less than one-half of one percent of world military expenditures.", "description": "UN will reach the 'deepest deficit of the decade' if member states don't pay what they owe, secretary-general warns.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/8/075606ffbba245fca7c9cd7e1117671f_18.jpg", "published_at": "2019-10-08"}