{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7622883/Defense-lawyer-high-school-student-fatally-stabbed-classmate-says-totally-justified.html", "downloaded_at": "2019-10-30 00:09:01.128587+00:00", "title": "Defense lawyer of high school student who fatally stabbed classmate says he was 'totally justified'", "language": "en", "text": "The attorney who defended a high school student who fatally stabbed his classmate after enduring 'years of bullying for being gay' has claimed his actions were 'totally justified'.\n\nRobert Feldman branded Abel Cedeno, 20, who was sentenced to 14 years in prison last month for killing 15-year-old Matthew McCree and critically injuring another pupil in September 2017, a 'fierce queen'.\n\nCedeno's legal team argued that the teen was acting in self defense and brought the knife used in the attack to school for protection from bullies who had tormented him for years.\n\nThe defendant told the judge that he was punched in the face multiple times on the day of the deadly confrontation at the now-closed Urban Assembly School for Wildlife Conservation in the Bronx, New York.\n\nRobert Feldman branded Abel Cedeno, 20, who was sentenced to 14 years in prison last month for killing 15-year-old Matthew McCree and critically injuring another pupil in 2017, a 'fierce queen'\n\nBut he was found guilty of manslaughter, assault and weapon possession in July, and sentenced in Bronx Supreme Court on September 10.\n\nSpeaking in the first episode of the new BBC Three documentary series - Love and Hate Crime: Killing in the Classroom, which airs on BBC One tonight - Mr Feldman admits he would have 'tried to run' if he was in Cedeno's shoes.\n\n'That's one fierce queen, that's one fierce kid,' he says. 'I know if I was in his position I would just try to run, he said, \"Guess what b******, you're going try to beat me up, try to kill me?\" He was fierce; as you know, one stab to the heart and Mr McCree was history, and Abel was totally justified.'\n\nThe documentary shows how the complicated case divided the city, pitting the black community against the gay community.\n\nSpeaking on a new BBC Three documentary - Love and Hate Crime: Killing in the Classroom, which airs on BBC One tonight - Mr Feldman admits he would have 'tried to run' if he was in Cedeno's shoes\n\nCedeno, who was 18 at the time of the attack, is also interviewed (pictured), and confesses it's 'hard to live with' what he did\n\nFilmed with access to the accused and the victim's family in the run-up to the trial, cameras follow the lawyers on both sides as they battle it out in the press and the court of public opinion.\n\nCedeno, who was 18 at the time of the attack, is also interviewed, and confesses it's 'hard to live with' what he did.\n\n'To me life is precious no matter what it is, who it is, you know?' he explains.\n\n'I have never and never will kill an animal, like a mouse even. Even though everyone's telling me it was self-defense, it's still a horrible tragic thing, it's hard to live with, I'm never going to forget about that, it's something I'm going to take to my own grave.'\n\nPrior to his sentencing, Cedeno told the court that he felt 'horrible' about the pain he caused both victims' families.\n\n'I'll have to live with that for the rest of my life,' he said. 'I regret it so much, and I wish that I could take it all back.'\n\nMr Lynn and Mr Feldman tried to argue that Matthew was a dangerous gang member - something his mother Louna Dennis (pictured) has always strenuously denied\n\nCedeno was found guilty of manslaughter, assault and weapon possession in July for fatally stabbing 15-year-old Matthew McCree (left) and critically injuring 16-year-old Ariane LaBoy (right) at the Urban Assembly School for Wildlife Conservation in September 2017\n\nCedeno's case was picked up by gay rights lawyer Christopher Lynn, who claims he identified with Cedeno after seeing him be 'paraded' out the school by police officers and listening to his side of the story\n\nSpeaking about why he was carrying the switchblade, Cedeno claims it was 'normal' to go to school with a knife and reveals he bought his on Amazon for $20.\n\n'The gang members did that and normal people did that too, because you'd be like, \"I have this so don't mess with me\",' he says.\n\n'The knife was a ticket for me to finally be myself out in the open, for me to not be judged anymore.'\n\nHe adds: 'When I first heard of Matthew's passing, it was heartwrenching. I couldn't believe he had passed away. The knife was legal, how can a little thing do so much damage?'\n\nCedeno claims he lashed out due to 'fight or flight instinct', knowing in his head it was 'me or him'.\n\nChristopher Lynn said Cedeno was branded an 'hysterical queen who whipped out the knife and went psycho'\n\nHis case was picked up by gay rights lawyer Christopher Lynn, who claims he identified with Cedeno after seeing him be 'paraded' out the school by police officers and listening to his side of the story, in which he insists he was attacked by Matthew McCree.\n\n'Any gay guy would look at that situation and say, \"That's me\", and if they don't say that they're not being truthful,' he argues.\n\n'The mob scene with the pitch forks and the torches, that's what it was. Someone's life is there, a real kid who the entire city hates and is going to villify, they're going to burn him at the stake like Joan of Arc, gleefully.\n\n'The gay kid is a hysterical queen who whipped out the knife, and went psycho, and he's like that and all gay people are like that, they're all psycho queens who can't wait to kill you.'\n\nMr Lynn and Mr Feldman tried to argue that Matthew was a dangerous gang member - something his mother Louna Dennis has always strenuously denied.\n\nChris Vasquez, a former school teacher where the attack took place, also maintains that Matthew, whom he knew from the age of 13, was 'a sweetheart' and disputes Cedeno's claims that he was bullied\n\n'Imagine if I found out he was in a gang. Matthew would never dare,' she says in the documentary.\n\n'The biggest thing that I'm really dealing with, I'm going to be honest, is the fact that I wasn't there for him.\n\n'You know, like... he died and I wasn't there. I didn't get to see him, I didn't get to tell him I loved him, I didn't get to hear him tell me he loved me. He was such a happy kid.'\n\nChris Vasquez, a former school teacher where the attack took place, also maintains that Matthew, whom he knew from the age of 13, was 'a sweetheart' and disputes Cedeno's claims that he was bullied.\n\nAriane LaBoy, who barely survived the attack by Cedeno, joined his mother Felicia LaBoy at the sentencing. Felicia told reporters her son hasn't been the same since the incident\n\n'Matthew was not a bully, he was a sweetheart, everyone loved Matthew and he would defend his friends, he would defend a teacher, he wasn't a bully. That whole narrative was made up,' Chris insists.\n\n'Abel was never bullied. This whole thing about being bullied was just fabricated, I don't know when, I don't know from who, but there's no evidence of him being bullied, the students in the classroom could testify he wasn't being bullied, the teachers as well.\n\n'He has been in the school for more than four years, if he was being bullied there would be evidence all over the place.'\n\nCedeno tells a very different story, claiming he had been targeted since middle school when he first started struggling with being gay, and told 'a couple' of school faculty members that he was being tormented by other pupils.\n\nCedeno showed little emotion as the sentence was handed down. Prior to his sentencing, Cedeno told the court that he felt 'horrible' about the pain he caused both victims' families\n\nCedeno's defense team tried to convince the judge that the teen was acting in self defense, arguing that he brought the knife used in the attack to school for protection from bullies who had tormented him for years. The defendant is pictured in court on July 15\n\n'Eventually I just stopped because they weren't doing anything, they weren't helping me, they're not telling the other kids to stop and even sometimes when I did and they told other kids to stop it just made it worse,' he says.\n\n'Some of the threats were viscious, they'd say \"I'm going to wait for you outside, I'm going to make you bleed, since you like being f***** in the a**, we're gonna do that with a steel pole\".\n\n'They came to pushing me, tripping me, pulling my hair, kicking me on the floor, hitting me on the shoulder, my stomach... doesn't sound like a school, it's almost like a prison really.\n\n'It was scary and the were dark moments, there were dark times where I thought about committing suicide and hurting myself. There were two or three times where I tried to overdose.'\n\nCedeno's lawyers said he brought a knife (pictured) to school for protection after being bullied and argued that he was acting in self defense when he stabbed the students\n\nIn a statement after the verdict was handed down, Bronx District Attorney Darcel Clark said: 'A 15-year-old boy was slain, and another youth's life is forever changed by this defendant's crime.\n\n'There was no evidence at trial that Matthew McCree or Ariane LaBoy had ever bullied the defendant.\n\n'His explosion of rage has left so many lives in ruins, including his own. Now he will spend many years in prison. We, as a society, must do everything to prevent violence in our schools.'\n\nFelicia LaBoy, whose son Ariane was the other boy caught up in the assault, said the mental and physical damage he sustained has had a lasting impact.\n\n'The Ariane who returned from the hospital in October of 2017 is not the Ariane I sent to school on September 27, 2017,' she said.\n\nCedeno's family are suing the New York City public school system, alleging that more could have been done to prevent the alleged bullying and incident\n\nThe trial saw testimony from several students and teachers who witnessed the deadly attack, and from a doctor who examined the deceased victim.\n\nDr John Hayes, from the Office of the Chief Medical Examiner, described McCree's chest wound as 'gaping and complex,' reported New 12 The Bronx.\n\nHe told the court that Cedeno's blade pierced the teenager's heart about 3-inches deep and caused one of his lungs to collapse.\n\nIn the documentary, Mr Vasquez plays a recording of a witness statement he gathered during his own investigation, in which the woman says Cedeno was going to leave the room when he ran back in after a paper ball was thrown at him, and told Matthew to 'pull up' - a slang term for starting a fight - before stabbing him.\n\nCedeno's family are suing the New York City public school system, alleging that more could have been done to prevent the alleged bullying and incident.\n\nMatthew's mother has hired civil-rights lawyer Sandy Rubenstein to sue the City for $25m for failing to protect her son.\n\nLove and Hate Crime: Killing in the Classroom airs on BBC One at 10:35pm tonight.", "description": "Robert Feldman defended Abel Cedeno, sentenced to 14 years in prison last month for killing 15-year-old Matthew McCree and critically injuring another pupil at a school in the Bronx, New York in 2017.", "authors": ["Hayley Richardson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/09/20317214-0-image-a-263_1572340653767.jpg", "published_at": "2019-10-29"}