{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/25/facebook-will-not-delete-politicians-posts-even-if", "downloaded_at": "2019-09-25 23:30:07.642013+00:00", "title": "Politicians get pass on content guidelines, Facebook says", "language": "en", "text": "Social media giant Facebook said Tuesday its content moderation standards will not be exercised on politicians, arguing their posts are “newsworthy” and should not be deleted.\n\n“From now on we will treat speech from politicians as newsworthy content that should, as a general rule, be seen and heard,” Nick Clegg, the site’s vice president of global affairs and communications said in a D.C. speech released as a company statement.\n\nMr. Clegg announced this as Facebook’s official stance, adding that politicians’ posts aren’t even submitted to their third-party content moderators, even if flagged as fake or misleading.\n\n“We do not submit speech by politicians to our independent fact-checkers, and we generally allow it on the platform even when it would otherwise breach our normal content rules,” Clegg said during the speech.\n\n“Of course, there are exceptions,” he added. “Broadly speaking they are two-fold: where speech endangers people; and where we take money, which is why we have more stringent rules on advertising than we do for ordinary speech and rhetoric.”\n\nMr. Clegg said he knows some people think that they “should go further” to block these posts, but he thinks that’s better than the “reverse.”\n\n“Would it be acceptable to society at large to have a private company in effect become a self-appointed referee for everything that politicians say?” he said. “I don’t believe it would be. In open democracies, voters rightly believe that, as a general rule, they should be able to judge what politicians say themselves.”\n\nAnother social media giant, Twitter, announced in June they would be adding a warning label to public officials’ tweets with a warning label if they violate their terms of service.\n\nThey said they will place “a screen you have to click or tap through” to see a Tweet from a politician that may violate their Terms of Service.\n\n“There are certain cases where it may be in the public’s interest to have access to certain Tweets, even if they would otherwise be in violation of our rules,” they said.\n\nPresident Trump has accused Facebook, Twitter and other social media companies of “trying to rig the election” against him, claiming in June they “make it very hard for people to join me in Twitter, and they make it very much harder for me to get out the message.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Social media giant Facebook said Tuesday its content moderation standards will not be exercised on politicians, arguing their posts are \"newsworthy\" and should not be deleted.", "authors": ["The Washington Times Http", "Bailey Vogt"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/07/24/earns_facebook_71581_c0-95-3095-1899_s1770x1032.jpg?c0f834d7d5c4330d6d080608563dc56b5c251667", "published_at": "2019-09-25"}