{"pub": "fox", "url": "https://foxnews.com/entertainment/lori-loughlin-bob-saget-nashville-squares", "downloaded_at": "2019-10-30 09:14:36.621798+00:00", "title": "Lori Loughlin's co-star Bob Saget speaks out on college admissions scandal: 'I don't cut people out'", "language": "en", "text": "Bob Saget wants to make it clear where he stands on the college admissions scandal surrounding his former “Fuller House” co-star Lori Loughlin.\n\n“I love the people I love, and people go through life, and stuff happens,” the 63-year-old told Fox News. “For a while, I was saying, 'No comment,' and now there’s just no point in talking about it because I’ve answered it. What I would say is, I love the people I love, and I have empathy for people that are in my life for 35 years. I don’t cut people out.”\n\n“I’ve never had any friends growing up,” added Saget. “So, I’m lucky to have any in the first place.”\n\nThe actress, her fashion designer husband and nine other parents were slapped with new federal charges earlier this month in a scandal involving dozens of wealthy parents accused of bribing their children’s way into elite universities or cheating on college entrance exams.\n\nLORI LOUGHLIN 'TERRIFIED,' 'STRESSED' ABOUT NEW COLLEGE ADMISSIONS SCANDAL CHARGES: SOURCE\n\nFELICITY HUFFMAN DOING 'REALLY WELL' ONE WEEK INTO PRISON SENTENCE: REPORT\n\nLoughlin, 55, and her husband Mossimo Giannulli, 57, are accused of paying $500,000 to get their two daughters into USC as recruits on the crew team, even though neither participated in the sport. The couple has pleaded not guilty.\n\n'I love the people I love, and I have empathy for people that are in my life for 35 years. I don’t cut people out.' — Bob Saget on Lori Loughlin\n\nSaget shared he’s thankful for the people he has befriended while filming “Full House” from 1987 until 1995, as well as the Netflix reboot, “Fuller House,” which launched in 2016. Season 5, which is premiering later this year, will be the last.\n\n'FULLER HOUSE' SEASON 5 STARS BEGIN PRODUCTION WITHOUT EMBATTLED LORI LOUGHLIN\n\n“I’ve got my house on possible fire [due to the California wildfires] and John Stamos was texting me… ‘Are you OK? Do you want to stay here?’ And I’m like, ‘No, I lived with you in that house in San Francisco long enough,’” joked Saget. “‘I’m not staying in your home.’ But we’ve done that before where we’ve stayed at each other’s houses because we’re good friends. I’m a fortunate guy. I have people that are valuable to me in my life, and then I get to go and share it with other people.”\n\nAs for the end of “Fuller House,” the timing to end the series just felt right.\n\n“We got one more ‘Fuller House’ coming up to film in a couple of weeks,” he shared. “It’ll be the last one of the 18 episodes for the fifth season. That’ll be the first half, which will be at the end of the year. And then the beginning of the new year will be the other nine. It’s bittersweet, but there’s a lot of love amongst everybody there.”\n\nTANYA TUCKER SAYS 'LAST LOVE SONG' TO GLEN CAMPBELL MEANT NO HARM TO HIS WIDOW\n\nMARIE OSMOND ON REMARRYING FIRST HUSBAND STEVE CRAIG: ‘NOTHING IS AN ACCIDENT’\n\nThese days, Saget is keeping busy doing what he loves best — entertaining others. The comic is now the host of CMT’s “Nashville Squares,” which puts a country music twist on the classic game show \"Hollywood Squares.\" The original, which aired from 1965 until 1980, was hosted by Peter Marshall.\n\nCelebrity contestants include Jana Kramer, Tanya Tucker and Marie Osmond — just to name a few. In addition, the show highlights dance choreography from the Dallas Cowboys Cheerleaders.\n\nFORMER DALLAS COWBOYS CHEERLEADERS TELL ALL ON ‘DEBBIE DOES DALLAS’ SCANDAL, SUPPORTING THE TROOPS\n\nFORMER CHARGETTES CHEERLEADER RECALLS PLAYBOY SCANDAL IN DOC: ‘I SPENT 40 YEARS OF MY LIFE WITH GUILT’\n\n“I was offered ‘Hollywood Squares’ over the years, and it seemed more scripted than I wanted it to be,” Saget explained. “This just got offered out of the blue and I said, ‘You know, I’ll do this.’”\n\n“I’m happy,” he continued. “With all the craziness in the world, I’m just trying to entertain people… It’s fun and that’s what I think, even in my standup, I’m trying to do more of that. Just stuff that doesn’t go and get us into any political discussions. It’s just out-and-out fun.”\n\nBut Saget also has another reason to celebrate. In October of this year, he celebrated his one-year anniversary with his wife, Kelly Rizzo.\n\n“Kelly’s amazing,” Saget gushed about the 39-year-old. “She really, really is… She’s just a great person. She’s really smart and really talent… Our anniversary was the 28th, which is a good day. We’ll be celebrating it for another year. We have a lot of good plans. We have a lot of good holiday plans with her family, and my daughters for Thanksgiving and for Christmas. So it’ll be a nice time.”\n\nARNOLD SCHWARZENEGGER AMONG STARS FORCED TO EVACUATE HOMES AS CALIFORNIA WILDFIRES RAGE\n\n'HOLLYWOOD SQUARES' HOST PETER MARSHALL EXPLAINS WHY THE ICONIC GAME SHOW ENDED\n\n“I was divorced for 23 years from my first wife, and she’s a good person,” said Saget. “And a great baby momma. That’s the country in me … Kelly and she get along. We don’t double date, but Kelly’s just cool. I’m really lucky.”\n\nCMT's \"Nashville Squares\" premieres Nov. 1. The Associated Press contributed to this report.", "description": "Bob Saget wants to make it clear where he stands on the college admissions scandal surrounding his former “Fuller House” co-star Lori Loughlin.", "authors": ["Stephanie Nolasco", "Bob Saget On Lori Loughlin"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/bob-saget-lori-loughlin-getty.jpg", "published_at": "2019-10-29"}