{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/19/its-in-the-dna-new-zealand-feels-strain-ahead-of-all-blacks-opener-in-rugby-world-cup", "downloaded_at": "2019-09-19 06:02:32.956035+00:00", "title": "'It’s in the DNA': New Zealand feels strain ahead of All Blacks opener in Rugby World Cup", "language": "en", "text": "For some, watching the game will be too much, and the only option is to drive until you lose mobile reception\n\nWhen the All Blacks run out to face South Africa in their opening Rugby World Cup fixture on Saturday, Brian “Mad Dog” Morgan will drive more than 40km into the bush, switch off the ignition and sit in absolute silence for several hours until he is satisfied the game is over.\n\nWhy? Morgan, a rabid All Blacks supporter, cannot bear the thought of his team ever losing and doesn’t trust his already weak heart to cope if they don’t win.\n\n“It’s the same every big game they play, worse if it’s the World Cup, I just don’t think I could handle a loss and would rather not know,” he tells the Guardian from a shed on his Canterbury farm, decorated in Silver Fern flags and the odd splash of black paint.\n\nRugby World Cup: All Blacks cover up tattoos in Japan to tackle yakuza link Read more\n\n“When the All Blacks were in the 2011 final I was a nervous wreck the whole week leading up to the game. Just before kick off I drove and drove and drove until I saw I didn’t have mobile reception any more and then just lay down on the ground looking at the stars … I tell you it was a sweet feeling when I was back in civilisation and I saw messages from my mates telling me they had won.”\n\nIf Morgan has an acute dose of All Blacks fever then it is fair to say it is a condition shared by a large proportion of his fellow New Zealanders, and the symptoms have flared up in the weeks leading up to the World Cup opener.\n\nFacebook Twitter Pinterest The All Blacks won when the teams met in the last Rugby World Cup. Photograph: David Davies/PA\n\n“It feels like it’s us against the world,” says Andrea Siddall, who made headlines in 2015 when she and husband Dave Bell spent $75,000 on watching the All Blacks play in the Rugby World Cup in England. “For me, it’s in the DNA,” says Siddall. “My grandmother loved it, my mother loved it and I am with a man who loves it.\n\nThe superfans, who remortaged their house to pay for the 2015 pilgrimage, will be sticking closer to home for the Japan tournament, watching the games on a giant 82-inch television bought for the occasion.\n\nBut what will happen if the All Blacks fail to make it three world cup titles in a row? “I will cope … I think,” she says.\n\nAnd so for now the nation holds its collective breath while it waits for the All Blacks to embark on its attempt at making rugby history.\n\nSilver fern flags fly proudly from flag poles and cars, classroom walls are plastered with paintings of children’s favourite players, office sweepstakes have been drawn and supermarkets and shops are stocking everything from All Blacks-branded cereal and chocolate to baby bibs and dog beds.\n\nFacebook Twitter Pinterest Key All Blacks playmaker Beauden Barrett Photograph: Hannah Peters/Getty Images\n\nThe bibs might come in handy for those babies born during a World Cup final, like in 2015 when Jane Tait went into labour so she and her “rugby fanatic” midwife pushed a small television blaring the game into the delivery suite. Happily, the All Blacks won. “They had to win. We didn’t want our baby to be born when the All Blacks lost,” Tait said at the time.\n\nBut what about those for whom the All Blacks, and rugby in general, is of little interest?\n\nSome may choose to spend the next month or more at home with the curtains drawn and good book at hand, while others might go the way of New Zealand writer Sara Young. She had “zero” interest in rugby until 2011 when she had to take part in a writers festival that featured a play about the All Blacks.\n\n“I had to watch it ‘for research’ with my hubby as my guide and by the time the final came around I was hooked,” she says.\n\n“Now my eyes no longer roll when I read headlines like ‘the poetry of rugby’.”", "description": "For some, watching the game will be too much, and the only option is to drive until you lose mobile reception", "authors": ["Angela Cuming"], "top_image": "https://i.guim.co.uk/img/media/7072004f3d4fa85280341bd14efd1610dd0ae0fb/0_240_3600_2160/master/3600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=20c28ea0e27b784cbc83f49bcb1f638b", "published_at": "2019-09-19"}