{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7619985/Kieman-Shipka-sexy-red-devil-Netflixs-Halloween-bash-Chilling-Adventures-Sabrina.html", "downloaded_at": "2019-10-28 01:33:03.878256+00:00", "title": "Kiernan Shipka is a sexy red devil at Netflix's Halloween bash for Chilling Adventures Of Sabrina", "language": "en", "text": "Kiernan Shipka proved Halloween is her holiday this weekend.\n\nShipka, who has played reluctant witch Sabrina Spellman in Netflix's Chilling Adventures Of Sabina for two seasons, donned a devilish disguise to celebrate her spooky show on Saturday.\n\nThe 19-year-old made the most of her night while attending the soiree with her Sabrina pals.\n\nSexy smile: Kiernan Shipka, 19, who plays reluctant witch Sabrina Spellman in Netflix's Chilling Adventures Of Sabina dressed as a red devil at a Halloween bash for Sabrina on Saturday\n\nShe shared Instagram snaps of herself and director Christian Coppola, 26, dressed as red devils complete with horns.\n\nThis will likely fuel the rumor that the pair are dating.\n\nThe beautiful brunette captioned a shot of herself, saying: 'tfw [that feeling when] you dress up as your dad for Halloween.'\n\nShe is referring to her father in Sabrina, the Dark Lord, which was the bombshell revelation at the end of season two.\n\nNow she knows: 'tfw [that feeling when] you dress up as your dad for halloween' she wrote referring to the bombshell revelation at the end of season two that her father is the Devil\n\nDressing alike: The 19-year-old and director Christian Coppola, 26, both went as red devils, which will no doubt feed rumors that the two are dating\n\nAustralian actor Luke Cook, who plays Lucifer Morningstar aka Satan in the scarefest, looked very different dressed as a woman in a long white wig.\n\nThe 32-year-old, who stands an imposing 6ft 5ins, picked up petite Kieman and swung her around as they danced.\n\nAll three posed for a single Instagram shot.\n\nNew romance?: Kieman shared this shot of Christian planting a kiss on Luke Cook's face, who was dressed as a woman. Luke, 32, plays Lucifer Morningstar aka Satan aka Sabrina's dad\n\nBig hug: Wearing a huge white wig, Luke moved in to dance with Kieman\n\nTake a dip: The actress smiled as Luke held her firmly by the waist\n\nThey were joined at the bash by Gavin Leatherwood, 25, who plays warlock Nickolas Scratch; Tyler Cotton who plays young warlock Melvin.\n\nAlso there: Scottish actress Michelle Gomez, 52, who plays Mary Wardwell aka Madam Satan.\n\nBrit Lucy Davis, 46, plays witch Hilda Spellman; and Ross Lynch, 23, plays Sabrina's beau Harvey Kinkle who has no idea he is descended from a long line of witch hunters\n\n'And now all is complete': Tyler Cotton, who plays young warlock Melvin, morphed into Hilda\n\nCups up: Ross Lynch, 23, who plays Sabrina's beau Harvey Kinkle, Australian actor Sam Corlett, 19, as a cheerleader and Josiah Olsen toast the holiday\n\nMeanwhile, non Sabrina guests included Australian Sam Corlett, 19, who was dressed as a cheerleader.\n\nAnd Skye P. Marshall, who co-stars in This Is Us, came in a uniform that may have been from her days in the US Air Force.\n\nNetflix has yet to reveal the release date of the third series of Chilling Adventures Of Sabrina although a late 2019 date has been mooted.\n\nWhat a shot: Sam proved he really is a cheerleader at heart when he lifted his long leg onto the kitchen counter\n\nDon't mess with her: Skye P. Marshall, who co-stars in This Is Us, came in a uniform that may have been from her days in the US Air Force", "description": "Kiernan Shipka proved Halloween is her holiday this weekend, suiting up in a devilish red disguise for a Netflix-hosted Chilling Adventures Of Sabina soiree.", "authors": ["Bobbie Whiteman For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/22/20255704-0-image-a-22_1572216008831.jpg", "published_at": "2019-10-28"}