{"pub": "independent", "url": "https://independent.co.uk/voices/extinction-rebellion-climate-crisis-bhp-mining-coal-colombia-a9167601.html", "downloaded_at": "2019-10-23 15:15:01.121230+00:00", "title": "Extinction Rebellion must decide if it is anti-capitalist – and this greenwashing mining company shows us why", "language": "en", "text": "Extinction Rebellion is facing a crunch point. If it is serious about addressing the root causes of environmental crises, it must either concede that some (indigenous, poor, black) lives are disposable – or else adopt an explicitly anti-capitalist stance. Only when it does the latter will the struggle begin in earnest.\n\nIn the meantime, the climate justice movement is being used for greenwashing, and indigenous people are facing serious repercussions.\n\nTake the example of mining company BHP Billiton. This month it announced it had a new purpose: to “bring people and resources together to build a better world.” The brief mentioned BHP’s “strong record” on responsible business practice, the “billions of dollars” spent on social investment, its status as the only company in its sector with an “A” rating for climate disclosures. BHP also emphasised “respecting indigenous peoples” as a renewed priority.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nAlvaro Ipuana, an indigenous leader from La Guajira, Colombia, tells a different story. Ipuana lives in the shadow of Cerrejón, the largest open cast coal mine in Latin America, co-owned by BHP. Its expansion over the last 20 years has forcibly displaced the Afro-descendant Tabaco people. According to campaigners and academics, it has also decimated the capacity for subsistence agriculture for its remaining indigenous Wayuu communities and polluted the rivers that once provided drinking water.\n\nThe region has been drought-stricken for years, and a 2017 Human Rights Watch report described the Wayuu as being in the throes of a “humanitarian crisis”. The locals lay the blame squarely at the feet of the multinationals.\n\nShape Created with Sketch. Extinction Rebellion protesters shut down London roads Show all 59 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Extinction Rebellion protesters shut down London roads 1/59 London, UK Trafalgar Square Angela Christofilou/The Independent 2/59 Angela Christofilou/The Independent 3/59 Angela Christofilou 4/59 Trafalgar Square Angela Christofilou/The Independent 5/59 Angela Christofilou/The Independent 6/59 Trafalgar Square Angela Christofilou/The Independent 7/59 Angela Christofilou 8/59 Trafalgar Square Angela Christofilou/The Independent 9/59 Angela Christofilou 10/59 Angela Christofilou 11/59 Trafalgar Square Angela Christofilou/The Independent 12/59 Angela Christofilou/The Independent 13/59 Trafalgar Square Angela Christofilou/The Independent 14/59 Angela Christofilou 15/59 Trafalgar Square Angela Christofilou/The Independent 16/59 Angela Christofilou 17/59 Angela Christofilou 18/59 Angela Christofilou/The Independent 19/59 Trafalgar Square Angela Christofilou/The Independent 20/59 Trafalgar Square Angela Christofilou/The Independent 21/59 Angela Christofilou/The Independent 22/59 Trafalgar Square Angela Christofilou/The Independent 23/59 Angela Christofilou 24/59 Angela Christofilou 25/59 Trafalgar Square Angela Christofilou/The Independent 26/59 Trafalgar Square Angela Christofilou/The Independent 27/59 Angela Christofilou 28/59 Trafalgar Square Angela Christofilou/The Independent 29/59 Angela Christofilou/The Independent 30/59 Angela Christofilou/The Independent 31/59 Trafalgar Square Angela Christofilou/The Independent 32/59 Angela Christofilou 33/59 Angela Christofilou/The Independent 34/59 Angela Christofilou 35/59 Trafalgar Square Angela Christofilou/The Independent 36/59 Trafalgar Square Angela Christofilou/The Independent 37/59 Trafalgar Square Angela Christofilou/The Independent 38/59 Angela Christofilou/The Independent 39/59 Angela Christofilou 40/59 Angela Christofilou 41/59 Angela Christofilou 42/59 Angela Christofilou 43/59 Angela Christofilou 44/59 Angela Christofilou 45/59 Angela Christofilou 46/59 Angela Christofilou 47/59 Angela Christofilou 48/59 Angela Christofilou 49/59 Angela Christofilou 50/59 Angela Christofilou 51/59 Angela Christofilou 52/59 Angela Christofilou 53/59 Angela Christofilou 54/59 Angela Christofilou 55/59 Angela Christofilou 56/59 Angela Christofilou 57/59 Angela Christofilou 58/59 Angela Christofilou 59/59 Angela Christofilou 1/59 London, UK Trafalgar Square Angela Christofilou/The Independent 2/59 Angela Christofilou/The Independent 3/59 Angela Christofilou 4/59 Trafalgar Square Angela Christofilou/The Independent 5/59 Angela Christofilou/The Independent 6/59 Trafalgar Square Angela Christofilou/The Independent 7/59 Angela Christofilou 8/59 Trafalgar Square Angela Christofilou/The Independent 9/59 Angela Christofilou 10/59 Angela Christofilou 11/59 Trafalgar Square Angela Christofilou/The Independent 12/59 Angela Christofilou/The Independent 13/59 Trafalgar Square Angela Christofilou/The Independent 14/59 Angela Christofilou 15/59 Trafalgar Square Angela Christofilou/The Independent 16/59 Angela Christofilou 17/59 Angela Christofilou 18/59 Angela Christofilou/The Independent 19/59 Trafalgar Square Angela Christofilou/The Independent 20/59 Trafalgar Square Angela Christofilou/The Independent 21/59 Angela Christofilou/The Independent 22/59 Trafalgar Square Angela Christofilou/The Independent 23/59 Angela Christofilou 24/59 Angela Christofilou 25/59 Trafalgar Square Angela Christofilou/The Independent 26/59 Trafalgar Square Angela Christofilou/The Independent 27/59 Angela Christofilou 28/59 Trafalgar Square Angela Christofilou/The Independent 29/59 Angela Christofilou/The Independent 30/59 Angela Christofilou/The Independent 31/59 Trafalgar Square Angela Christofilou/The Independent 32/59 Angela Christofilou 33/59 Angela Christofilou/The Independent 34/59 Angela Christofilou 35/59 Trafalgar Square Angela Christofilou/The Independent 36/59 Trafalgar Square Angela Christofilou/The Independent 37/59 Trafalgar Square Angela Christofilou/The Independent 38/59 Angela Christofilou/The Independent 39/59 Angela Christofilou 40/59 Angela Christofilou 41/59 Angela Christofilou 42/59 Angela Christofilou 43/59 Angela Christofilou 44/59 Angela Christofilou 45/59 Angela Christofilou 46/59 Angela Christofilou 47/59 Angela Christofilou 48/59 Angela Christofilou 49/59 Angela Christofilou 50/59 Angela Christofilou 51/59 Angela Christofilou 52/59 Angela Christofilou 53/59 Angela Christofilou 54/59 Angela Christofilou 55/59 Angela Christofilou 56/59 Angela Christofilou 57/59 Angela Christofilou 58/59 Angela Christofilou 59/59 Angela Christofilou\n\nCerrejón claims it has invested $19.6m to improve water access for affected Wayuu communities, and blames regional government for the continued plight of the Tabaco people displaced by its mine.\n\nBut, as Ipuana explains, “The resources that have been assigned to counter the impacts caused by the mining were not definitive solutions to the problem. Their concept of development isn’t functional for indigenous communities.”\n\nThis explanation cuts to the core of an emerging tension in the rejuvenated climate justice movement. While Extinction Rebellion’s focus on net zero carbon emissions is understandable, it ignores extractivism – the large-scale exploitation of natural resources for export – which often makes up the core of “green infrastructure” projects. This has fatal consequences.\n\nCerrejón is just one example of BHP’s “social investment” MO. The company is currently fighting one of the biggest legal claims ever filed in a British court over the worst environmental disaster in Brazil’s history. When a tailings dam burst at Samarco, whole villages were wiped out by the waste sludge from the iron ore plant. Rejecting all charges leveled at the company for accountability, co-owner BHP instead set up a foundation to dispense compensation at its own discretion.\n\nNow BHP wants to wear the clothes of the climate activists. Its chair Ken MacKenzie even claimed at last week’s AGM that “mining is the locomotive of the future on climate change”. Minerals like lithium, cobalt and copper are key for many of the alternatives to fossil fuel-based infrastructure. But large-scale “greening” projects that rely heavily on unsustainable mining for finite minerals under indigenous land necessarily entail exploitation – of nature and of people.\n\nAs Extinction Rebellion protests drew headlines, Ipuana joined activists from Chile and Brazil in protest at that AGM in Westminster. The Latin-American representatives accuse the multinational of “greenwashing” – plastering over its exploitation of people and resources with buzzwords and empty gestures.\n\nThe briefing released of the meeting shows that companies like BHP recognise the need to placate investor concerns around climate breakdown, and so are trying to rebrand themselves as ethical companies committed to a transition towards green industry. It doesn’t seem to matter that black and brown communities have been fighting this battle for generations with their bodies on the line. The investor is the ultimate customer and, increasingly, today’s investors want to believe their money isn’t funding their grandchildren’s death warrant.\n\nAcross Europe, Extinction Rebellion has succeeded against the odds in making climate breakdown a public priority. Its broad-church approach of remaining avowedly “apolitical” (i.e. not anti-capitalist) made sense initially, bringing together a wide coalition from across the political spectrum. As the national conversation begins to move towards specific policy and infrastructure objectives, however, what I see as XR’s reluctance to tackle extractivism threatens to give carte blanche to governments and corporations who are happy to shift the burden of climate destruction onto poor and indigenous communities of colour in the global South.\n\nIn solidarity with those risking violence and incarceration on the front lines, XR needs to ensure that the relentless extractivism that damages lives, livelihoods and ecosystems in parts of the global South is not the basis of its fight for net zero carbon emissions here in the UK.\n\nAnd yet extractivism is a necessary component of an economic model predicated on exponential growth. It is impossible to combat without identifying its roots in colonial capitalism.\n\nThis leaves Extinction Rebellion with a choice to make: either it ignores the ecological devastation wreaked by corporations, or it commits itself to tackling the root cause of that devastation. If it is truly internationalist, it must recognise that climate struggle is class struggle. If it values all bodies equally, it must denounce capitalism itself.", "description": "Extinction Rebellion is facing a crunch point. If it is serious about addressing the root causes of environmental crises, it must either concede that some (indigenous, poor, black) lives are disposable – or else adopt an explicitly anti-capitalist stance. Only when it does the latter will the struggle begin in earnest.", "authors": ["Amardeep Dhillon"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/18/14/red-hands-xr.jpg", "published_at": "2019-10-23"}