{"pub": "thehill", "url": "https://thehill.com/homenews/campaign/465045-biden-trump-should-be-impeached", "downloaded_at": "2019-10-09 18:43:02.997423+00:00", "title": "Biden calls for Trump to be impeached", "language": "en", "text": "Former Vice President Joe Biden Joe BidenPelosi hits back at Trump over letter: 'Only the latest attempt to cover up his betrayal of our democracy' Clinton jokes she could 'obviously' beat Trump in 2020 'rematch' Gowdy in talks to join Trump's impeachment defense team MORE on Wednesday for the first time said President Trump Donald John TrumpPelosi hits back at Trump over letter: 'Only the latest attempt to cover up his betrayal of our democracy' Trump directed Perry, State Dept. officials to talk to Giuliani on Ukraine: report Murkowski warns against rushing to conclusions on Trump impeachment MORE should be impeached.\n\n\"Donald Trump has violated his oath of office, betrayed this nation and committed impeachable acts,\" Biden told a crowd of supporters in Rochester, N.H. \"To preserve our Constitution, our democracy, our basic integrity, he should be impeached.\"\n\n\"That's not only because of what he's done. The answer to whether he has committed acts sufficient toward impeachment is obvious,\" he continued.\n\nADVERTISEMENT\n\n\"We see it in Trump's own words. We see it in the texts from State Department officials that have been made public. We see it in his pulling much of the United States government into his corrupt schemes, individuals within the government, his appointees,\" Biden said. \"We have to remember that impeachment isn't only about what the president has done. It's about the threat the president poses to the nation.\"\n\nBiden, a 2020 Democratic presidential contender, has until now held back on directly calling for impeachment, though he has supported an inquiry into Trump.\n\nTrump responded to Biden minutes after the remarks, calling him \"pathetic.\"\n\n\"So pathetic to see Sleepy Joe Biden, who with his son, Hunter, and to the detriment of the American Taxpayer, has ripped off at least two countries for millions of dollars, calling for my impeachment - and I did nothing wrong. Joe’s Failing Campaign gave him no other choice!\" Trump said in a tweet.\n\nBiden responded a short time later, telling Trump to stop stonewalling on requests from House Democrats as a part of the broader impeachment inquiry.\n\n\"Thanks for watching. Stop stonewalling the Congress. Honor your oath. Respect the Constitution. And speaking of taxpayers, I’ve released 21 years of my tax returns. You?\" Biden tweeted.\n\nHouse Democrats announced last month they would launch an impeachment inquiry into Trump amid allegations from a whistleblower that Trump sought to persuade Ukraine to investigate Biden and his son Hunter Biden.\n\nTrump has ramped up his attacks against Biden, focusing on the former vice president's efforts to pressure Ukraine to dismiss a senior prosecutor who at one point had investigated an energy company where Hunter Biden had served as a board member.\n\nThere is no evidence, however, demonstrating that Biden advocated for the prosecutor's removal as a means of protecting his son.\n\nThe president publicly encouraged Ukraine and China to investigate Biden and his son after Trump alleged that Biden thwarted an investigation into his son's work at a Ukrainian energy company.\n\nUpdated: 2:29 p.m.", "description": "Former Vice President Joe Biden on Wednesday for the first time said President Trump should be impeached.", "authors": [], "top_image": "https://thehill.com/sites/default/files/newsletter-biden_092519getty.jpg", "published_at": "2019-10-09"}