{"pub": "yahoo", "url": "https://news.yahoo.com/famed-ancient-skeletons-buried-hand-130137132.html", "downloaded_at": "2019-09-13 18:11:01.606402+00:00", "title": "Famed ancient skeletons buried hand-in-hand revealed to be two men", "language": "en", "text": "By Hugo Greenhalgh\n\nLONDON, Sept 13 (Thomson Reuters Foundation) - A pair of ancient skeletons known as the \"Lovers of Modena\" after being found in Italy buried hand-in-hand were actually two men, Italian scientists have found.\n\nDiscovered in 2009 in the northern city of Modena, the remains, dating from between the 4th and 6th centuries AD, had degraded so much it was thought impossible to determine their gender and it was assumed to be a man and a woman.\n\nBut now, through examining protein present in tooth enamel, scientists from the University of Bologna have proved the skeletons were those of two men.\n\n\"We were able to extract proteins from the dental enamel of both individuals ... and to confidently classify them as males,\" the 20 scientists involved in the project wrote in a paper published in the journal Scientific Reports.\n\nThe scientists said it was impossible to determine the sexual orientation of the two skeletons. They could have been friends, brothers, or war comrades.\n\n\"Although we cannot exclude that these two individuals were actually in love, it is unlikely that people who buried them decided to show such bond by positioning their bodies hand in hand,\" the scientists wrote in their report.\n\nContemporary attitudes towards homosexuality suggested a relationship between the two was unlikely, the scientists said.\n\nUnder the reign of Justinian, the Eastern Roman emperor between 527 and 565 AD, same-sex relations between men were considered a crime. (Reporting by Hugo Greenhalgh, Editing by Belinda Goldsmith Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters that covers humanitarian news, women's and LGBT+ rights, human trafficking, property rights, and climate change. Visit http://news.trust.org)", "description": "A pair of ancient skeletons known as the \"Lovers of Modena\" after being found in Italy buried hand-in-hand were actually two men, Italian scientists have found.  Discovered in 2009 in the northern city of Modena, the remains, dating from between the 4th and 6th centuries AD, had degraded so", "authors": ["Hugo Greenhalgh", "Thomson Reuters Foundation"], "top_image": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "published_at": "2019-09-13"}