{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/pace-helps-provide-answers-for-environmental-chall", "downloaded_at": "2019-10-09 00:33:50.723606+00:00", "title": "PACE helps provide answers for environmental challenges", "language": "en", "text": "ANALYSIS/OPINION:\n\nThe answers to the environmental challenges of the 21st Century aren’t top-down mandates or exploiting teenaged pawns for manipulating swing voters. In order to achieve a bold vision of a cleaner energy future, more cities and states need to move at the local level to advance upgrades that can protect properties and saves lives. But despite a recent groundswell of political support for green initiatives, sustainability and resiliency upgrades remain limited and unaffordable for most Americans.\n\nOne such solution is Property Assessed Clean Energy (PACE), a little-known finance tool for green-building requirements highlighted recently in The New York Times. The intent is to apply free-market economics to environmental solutions. Created in 2008 to fund more sustainable, more resilient properties, PACE has become incredibly popular with more than $5.1 billion in projects for 220,000 homes in its first 10 years, according to PACENation.\n\nPACE enables property owners to pay for such projects through a voluntary property assessment over five to 25 years. It’s administered at the city and county level, so it’s better suited to adapt to the specific needs of an area than a top-down, one-size-fits-all approach from the federal government.\n\nPACE loans are better than conventional debt used for similar upgrades, its boosters say, because it’s usually cheaper, with a fixed interest rate and terms are 20 to 30 years rather than three to five, The NYT article continued. Developers can borrow up to 20 percent of a project’s cost in PACE funds, which helps bridge the gap of investment capital, since banks typically finance only about 60 percent of a project’s cost. Moreover, PACE is replacing more costly financing, notably mezzanine debt, where interest rates are a nasty 12 percent (or more), while rates for PACE rates hover around 7 percent.\n\nUpgrading buildings is particularly topical right now, as we’re in the throes of the 2019 Atlantic hurricane season. Every $1 invested in storm-mitigation funding saves $6 in post-disaster costs, according to a report by the National Institute of Building Sciences, to say nothing of potentially saving people from harm. But resiliency improvements are expensive, so a funding model that makes upgrades more affordable is a welcome one indeed.\n\nPACE can play an important role in blunting the devastation of hurricanes. In Florida, according to the Sun Sentinel, a $275 million investment in hurricane resiliency upgrades made through PACE has avoided losses so far of $500 million in property damage costs and $135 million in temporary relocation costs. According to a recent report from the University of Southern California Schwarzenegger Institute, just 12,000 hurricane-preparedness, PACE-building improvements in Florida — such as storm-proofing windows and doors — over 20 years could save a further $500 million in avoided disaster losses, plus $700 million in future insurance premiums.\n\nCredit where it’s due, the model came out of Berkeley, California — a part of the country that conservatives like to point to for its civic failures and excrement-ridden streets. Berkeley originated the PACE model to help residents pay for solar panels and similar energy modifications, with commercial financing programs following close behind. To date, 36 states and Washington, D.C., have passed legislation so commercial properties can finance with PACE.\n\nThe Trump administration has not been as friendly as it could be toward PACE, making it potentially more difficult for homeowners to resell properties with PACE assessments. But PACE has drawn support from Republicans as an example of a model program: Operated at the local level, funded by private capital, improving properties without high upfront costs, and all without government subsidies.\n\nStewardship of the planet is an important responsibility and free-market solutions like PACE provide the model of how it can be done.\n\n• Jared Whitley has worked in the White House, the U.S. Senate, and the defense industry.\n\nSign up for Daily Opinion Newsletter Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The answers to the environmental challenges of the 21st Century aren't top-down mandates or exploiting teenaged pawns for manipulating swing voters.", "authors": ["The Washington Times Http", "Jared Whitley"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/08/B3-WHIT-Building-Gr_c0-0-1092-637_s1770x1032.jpg?71f0c8598b87483e854dea91280d673d8c777bf9", "published_at": "2019-10-08"}