{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-myanmar-rohingya-bangladesh/rohingya-in-bangladesh-face-tide-of-hostility-as-welcome-turns-to-fear-idUKKBN1W20EH", "downloaded_at": "2019-09-17 08:28:56.349421+00:00", "title": "Rohingya in Bangladesh face tide of hostility as welcome turns to fear", "language": "en", "text": "COX’S BAZAR, Bangladesh (Reuters) - When more than 730,000 Rohingya fled into Bangladesh from Myanmar in 2017, Bangladeshi journalist Sharif Azad was sympathetic to the plight of his fellow Muslims, survivors of a military-led crackdown the United Nations has branded genocide.\n\nBangladeshi journalist Sharif Azad is pictured inside his office in Ukhia Upazila, Bangladesh August 27, 2019. REUTERS/Poppy Mcpherson\n\nThe reporter, from the southern corner of Bangladesh that has become home to the world’s largest refugee settlement, said he wrote accounts of the traumatized, exhausted Rohingya and did what he could to help.\n\n“All the people did it,” said Azad, in his office near a bustling market outside the town of Cox’s Bazar.\n\n“We provided the food. We provided land.”\n\nTwo years on, Azad runs a campaign against the Rohingya, aiming to see them confined to their camps behind barbed wire until they can be sent back to Myanmar.\n\n“We will continue our movement until repatriation happens,” said Azad, who said his group now has 1,000 members, and is one of several that have sprung up with the same aims.\n\nMost Rohingya Muslims are denied citizenship in Buddhist-majority Myanmar, where they are regarded as interlopers, illegal immigrants from South Asia.\n\nRohingya were driven from their villages in Myanmar into Bangladesh in the 1970s and again in the 1990s, fleeing what they said was persecution at the hands of the Myanmar military.\n\nBut the latest influx has been the biggest.\n\nMyanmar denies accusations of genocide. It says its armed forces have carried out legitimate operations against Rohingya militants who attacked security forces.\n\nIn Bangladesh, the deterioration of relations between the “host” community and the newcomers has been so precipitous some now fear serious violence.\n\n“I’ve lived to see three influxes and this is the worst,” said Bangladeshi labourer Khadir Hussein, 60, in a tea shop in the border town of Teknaf.\n\n“We feel if they attack us, how will we survive? We’re a minority in our land.”\n\n‘TAKING MEASURES’\n\nMany Bangladeshis accuse the Rohingya of crime, taking jobs and pushing down wages.\n\nOnce-lush forests have been cleared for the camps and the road to Cox’s Bazar, the nearest major town, is clogged with aid trucks. A trip that used to take an hour can now take four on rutted, broken roads.\n\nRecently, a hundreds-strong mob blocked roads and destroyed shops frequented by Rohingya as well as some U.N. offices, in a protest against the killing of a Bangladeshi ruling party youth leader.\n\nSeveral Rohingya accused of involvement in the murder were later shot dead in what the police said were gunfights.\n\nSenior Cox’s Bazar police official Iqbal Hossain said there had been a rise in crime, though the rate among refugees was no higher than that among Bangladeshis.\n\nHe acknowledged the growing animosity towards the refugees.\n\n“This is going to be tough to control so many people,” he said. “The government is taking measures to prevent any untoward situation.”\n\nIn a bamboo camp shelter, four refugees who asked not to be identified said they had fled from their homes after the recent mob attack, scrambling to gather children and belongings, in a state of terror they likened to their panicked flight from Myanmar.\n\n“When we came here, we came to save our lives,” said one refugee, his voice shaking,\n\n“But here, we’re not safe. We’re very afraid.”\n\nBangladesh has said all of the Rohingya must go home but not one agreed to last month in a second bid to get a repatriation process going. Refugees cite fears of violence and persecution back in Myanmar.\n\n‘BAD ELEMENTS’\n\nWith tension between the communities rising, authorities have clamped down, cutting the internet in the camps and trying to confiscate phones, citing security concerns.\n\nThe sale of phone SIM cards to refugees has been forbidden.\n\nH.T. Imam, an adviser to Prime Minister Sheikh Hasina, accused “foreign forces” of mobilising the Rohingya against Bangladesh’s interests. He called the role of international aid agencies “mysterious”.\n\n“It is becoming clear there are unwanted people and bad elements among the Rohingyas, and they have been used by foreign forces,” he said.\n\n“The camps should be surrounded by barbed wire to stop all ... criminal activities.”\n\nUNHCR spokeswoman Caroline Gluck said in an email the agency “would recommend the adoption of security measures that do not impact upon the ability of refugees to access basic services and rights and live safely”.\n\nRegarding the communication restrictions, she said: “Technology has been an important way for the refugees to communicate with family and friends, and humanitarian agencies to disseminate and access information.”\n\nBut technology has also been used to fuel fear and suspicion.\n\nA flurry of rumours about Rohingya and international aid groups has appeared on Facebook and in newspapers.\n\nIn August, Azad posted a photo on Facebook showing piles of sharp objects and accused a non-governmental group of hiring the shop making them to arm refugees. The post was shared hundreds of times.\n\nBut staff at the shop told Reuters the tools were not weapons and the Bangladeshi NGO caught up in the affair said they were weeding tools for villagers.\n\nThe febrile atmosphere is contributing to a sense of despair.\n\n“They have the pen, they have the gun, they have a country. I have nothing,” one Rohingya man told Reuters.\n\n“Please pray for us,” he said.", "description": "When more than 730,000 Rohingya fled into Bangladesh from Myanmar in 2017, Bangladeshi journalist Sharif Azad was sympathetic to the plight of his fellow Muslims, survivors of a military-led crackdown the United Nations has branded genocide.", "authors": ["Poppy", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190917&t=2&i=1430711224&w=1200&r=LYNXMPEF8G09W", "published_at": "2019-09-17"}