{"pub": "nymag", "url": "https://vulture.com/2019/10/breaking-bad-recap-el-camino-movie.html", "downloaded_at": "2019-10-10 18:25:43.641423+00:00", "title": "30 Breaking Bad Moments You’ll Definitely Need to Remember for El Camino", "language": "en", "text": "Previously on Breaking Bad… Photo: AMC\n\nIt’s been six years since the Breaking Bad finale, so you’d be forgiven if you watched the trailer for El Camino: A Breaking Bad Movie and thought to yourself: “Jeez, Jesse, what the hell happened to you?”\n\nThe answer is a whole lot — especially given the show’s established timeline, which takes place over the course of approximately two years, the stretch between Walter White’s 50th and 52nd birthdays.\n\nA bunch of characters made big impressions over the course of Breaking Bad, but key to El Camino is Jesse Pinkman (Aaron Paul), the young man recruited as Walter’s partner when the cancer-stricken science teacher decided to get into the meth business. While Walter’s fate at the end of the series is pretty clear, Jesse’s journey seemed far from over, so, as we ready ourselves to find out what happens next to the guy whose catchphrases include “YEAH SCIENCE!”, let’s dig into the key events of the original series from Jesse’s point of view. If you need a Breaking Bad refresher ahead of El Camino’s premiere on Friday, just remember these 30 things.\n\n1) Prior to the events of Breaking Bad, young Jesse Pinkman was a student at J. P. Wynne High School, where he notably failed a chemistry class taught by Walter White. (Based on some crude artwork Jesse once drew on the back of a test, Mr. White was not one of Jesse’s favorite teachers.)\n\n2) Jesse had descended into the local drug scene as a teenager, leaving his parents’ house and moving in with his aunt, who was dying of cancer. He became her prime caretaker during her illness, and after her death continued to live in her house.\n\n3) He also made meth under the alias of Captain Cook (his signature being the addition of a little chili powder), but one day, the home where he was cooking with a partner got busted by the DEA. His partner was arrested, but he happened to be having sex with an unnamed woman in the house next door when agent Hank Schrader’s (Dean Norris) team busted in, and he was able to escape.\n\n4) However, he was spotted by Mr. White, Hank’s brother-in-law, who happened to tag along to watch the bust that day.\n\nIt all went downhill from here. Photo: AMC\n\n5) Mr. White blackmailed Jesse into a deal: The pair would team up to cook meth together, because Jesse “knows the business, and I know the chemistry.” Jesse is more than skeptical about whether Mr. White is up to breaking the law, but has little choice but to agree. (While over the course of the series Jesse almost always calls his former teacher “Mr. White,” which is sweet as hell, “Walt” is shorter so we’re going to go with that going forward.)\n\n6) Jesse and Walt’s first foray into cooking together goes well, with Jesse impressed by Walt’s skills as a chemist. Their first attempt to sell, however, leads to the deaths of two small-time dealers — and, thanks to a flawed effort to dissolve one of the bodies in a porcelain bathtub, serious property damage to Jesse’s house.\n\n7) Walt pushes Jesse to bring them deeper into the Albuquerque drug world in search of dealers who will pay them enough money for Walt’s family to live comfortably, should the worst happen with his cancer. They start making decent cash, but only by working for meth-crazed Tuco (Raymond Cruz), who nearly kills Jesse and Walt before Hank ends up gunning him down.\n\n8) Jesse tries to come home to his parents, but frustrated by his long-standing drug use, they end up kicking him out again. Later, they try an even tougher-love approach by evicting him from his aunt’s house, leaving him functionally homeless.\n\n9) With his remaining cash, Jesse gets a duplex apartment next door to Jane (Krysten Ritter), an artist and recovering addict who quickly figures out that he’s a drug dealer. They begin a relationship.\n\n10) Jesse and Walt are now running their own operation to both make and distribute their drugs. To sell their product on the streets, Jesse enlists three friends — Combo (Rodney Rush), Badger (Matt Jones), and Skinny Pete (Charles Baker) — to help out.\n\nThe Four Methketeers: Skinny Pete, Badger, Jesse, and Combo. Photo: AMC\n\n11) When Combo gets killed by rival dealers (an operation that isn’t afraid to use 11-year-old kids as gunmen), Jesse takes the loss hard and starts using drugs more often. Jane ends up not just relapsing, but indoctrinating Jesse into the world of heroin.\n\n12) Walt tries to escalate their business by teaming up with a new distributor, but his attempts to engage Gus Fring (Giancarlo Esposito) are complicated by Jesse’s further descent into heroin, because Gus does not like having junkies on the payroll.\n\n13) This climaxes when Walt breaks into Jesse’s apartment after a drug-fueled Jane and Jesse attempt to blackmail Walt into delivering some money. Walt witnesses Jane overdose in bed right beside a comatose Jesse, but does nothing to stop her from choking on her own vomit.\n\n14) Walt takes Jesse to rehab after Jane’s death, paying for it himself. Jesse gets clean for a time, Walt convinces Gus to hire Jesse as his assistant instead of the ultranerdy Gale (David Costabile).\n\nSee? Walt really didn’t like Gale. Photo: AMC\n\n15) Jesse gets a new girlfriend named Andrea (Emily Rios), who has a young son named Brock and a slightly older boy named Tomas, who turns out to be the kid who killed Combo. When Jesse finds out the gang that pushed Tomas to kill Combo also works for Gus, he demands they stop using kids as assassins. That leads to Tomas being killed, because this show is brutal.\n\n16) After that, Gus wants Jesse out and Gale back in. To prevent that from happening — because he trusts Jesse a whole lot more than Gale — Walt tells Jesse to kill Gale.\n\n17) Jesse knocks on Gale’s door and shoots him point-blank in the head. This understandably messes him up to a considerable degree.\n\n18) But in the meantime, thanks to Walt’s tutelage, Jesse has become one hell of a meth cook — perhaps even his mentor’s equal. Which means that as Gus becomes less a fan of Walt, he starts relying on Jesse more.\n\n19) Jesse and Andrea eventually break up but remain friendly, and Jesse gives her money for her living expenses.\n\nAndrea, Brock, and Jesse back in better times. Photo: AMC\n\n20) The conflict between Walt and Gus reaches a head (to be specific, blowing off half of Gus’s head), and Jesse’s prowess makes him an unstable element in the equation. Jesse for a time suspects Walt of poisoning and nearly killing Andrea’s son, Brock, but he’s eventually convinced otherwise and helps Walt destroy Gus’s lab.\n\n21) Before long, Jesse and Walt reunite as partners, alongside Gus’s former associate Mike (Jonathan Banks). Their joint venture gets dark fast, though: A young boy is killed when they rob a train containing a key ingredient for their meth.\n\n22) The man who murdered that boy was Todd (Jesse Plemons), a new associate whose criminal relatives just so happen to have swastika tattoos on their necks. Todd, for the record, drives a 1978 Chevrolet El Camino, which will come up again in a bit!\n\nOnly one of these guys hasn’t tried to murder a child. Photo: AMC\n\n23) After the methylamine robbery and Todd murdering that kid, both Mike and Jesse decide it’s time to get out of the game and cash out their shares of the business. Walt, though, is not so into them bowing out, which leads him to cutting deals with Todd’s white supremacist buddies.\n\n24) Jesse finally realizes that Walt was behind Brock’s poisoning after all. Although he’s never been the biggest fan of Hank, the two of them join forces to try to get Walt arrested.\n\n25) Unfortunately, Walt responds to their trap by enlisting the help of his new Nazi friends, which leads to Hank’s death. The Nazis let Walt go after taking nearly all of his money, and with the assistance of professional “relocator,” Ed (Robert Forster), Walt holes up in New Hampshire for a few months.\n\n26) The Nazis fail to produce drugs of Jesse and Walt quality, so their international distributor Lydia (Laura Fraser) has been freaking out. Which is very bad news for Jesse: After they let Walt go, they literally cage Jesse up for months and force him to make Heisenberg-level meth.\n\nJesse cooking meth for Todd, Uncle Jack, and the Nazis. Photo: AMC\n\n27) Jesse tries to escape at one point. After he gets caught, the Nazis unchain him, put him in a car, and drive him to Andrea’s house, where Todd shoots her in the head. (Note: These guys might be bad guys.)\n\n28) Living in a literal hole in the ground, Jesse seems completely without hope, until Walt returns to Albuquerque with a car trunk full of machine-gun vengeance.\n\n29) After Walt shields Jesse from the gunfire with his own body (at the sacrifice of his own life), Jesse strangles Todd, one of the few survivors of Walt’s assault, with his handcuffs. He also has his chance to kill Walt, but tells him to “do it yourself.”\n\n30) Remember that 1979 El Camino? That’s the car Jesse uses to blast through the gates of the Nazi compound where he’s been trapped for so long. But his ultimate fate at the end of Breaking Bad is unknown.\n\nIn El Camino, Jesse Pinkman still might have a chance at true escape. As we saw in Breaking Bad, his family is estranged, his love life is a death trap, he desperately needs a shave and a haircut, and his best friend’s most noble act was setting him free. That last fact suggests that the future isn’t completely hopeless for Albuquerque’s best living meth cook. But after everything that’s happened to Jesse, he should definitely consider a new line of work.", "description": "If you need a Breaking Bad refresher ahead of El Camino’s premiere on Netflix, just remember these 30 essential Jesse moments from the original series. While Walter’s fate at the end of Breaking Bad was pretty clear, Jesse’s journey is far from over.", "authors": ["Liz Shannon Miller"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/10/breaking-bad-refresher/10-breaking-bad-refresher-lede.w1200.h630.jpg", "published_at": "2019-10-10"}