{"pub": "businessinsider", "url": "https://businessinsider.com/knives-out-review-rian-johnson-shows-off-original-storytelling-talents-in-2019-9", "downloaded_at": "2019-09-08 23:31:30.995050+00:00", "title": "'Knives Out' is a delightful whodunit from 'The Last Jedi' director, who proves he can still make a great original story", "language": "en", "text": "There's nothing better than a whodunit mystery movie, but in the hands of a writer-director like Rian Johnson, the enjoyment is heightened.\n\nComing off directing \"Star Wars: The Last Jedi\" (and taking a break from building a whole new trilogy for the saga), Johnson has returned to the original storytelling that built him a loyal fanbase before a galaxy far, far away came calling.\n\nWith \"Knives Out,\" which had its world premiere Saturday at the Toronto International Film Festival (it opens in theaters November 27), Johnson delivers a murder mystery that has all the intrigue and tangled guessing game you would find in an Agatha Christie detective novel mixed with a dark humor that feels a distant cousin of the great 1985 adaptation of the board game, \"Clue.\" And all done with the help of a great all-star cast.\n\nRead more: The director of \"Hustlers\" describes the 3-year struggle to make her gritty gangster movie, and not let it turn into \"'Ocean's 8' with strippers\"\n\nJohnson sets the story at the palatial estate of noted crime novelist Harlan Thrombrey (played by Christopher Plummer). Following a party for his 85th birthday on the grounds, Harlan is found dead of an apparent suicide. Police lieutenant Elliott (Lakeith Stanfield) and state trooper Wagner (Noah Segan) show up to question the family. Benoit Blanc (Daniel Craig), a noted private investigator who has been hired to find out if Harlan had actually been murdered, tags along.\n\nAnd there the fun begins as Craig's Blanc takes center stage, talking in a terrific southern accent which just heightens his theatrics as a know-it-all detective.\n\nChris Evans in \"Knives Out.\" Lionsgate The scenery-chewing performances don't end with Craig. The whole cast is in on the over-the-top fun. There's Jamie Lee Curtis as Linda, the demanding \"self-made\" daughter of Harlan. Don Johnson plays Richard, Linda's lapdog husband. Toni Collette plays Joni, who was married into the family and has stuck around since her husband's passing. Michael Shannon plays Walt, the son of Harlan and the one who handles the business side of his father's publishing empire. And then there's Chris Evans as Ransom, Harlan's grandson and the black sheep of the family.\n\nThrough the story, we learn that each of them could have a motive for killing Harlan, and we go on the trail with Blanc to discover what actually happened.\n\nThe big challenge for a movie with such a large (and talented) ensemble is not leaving anyone out of their screen time, and Johnson molds a story where all these actors get their time to shine. But the standout is Craig. The Blanc character is a fun caricature of the detectives we have grown up on, from Angela Lansbury's Jessica Fletcher in \"Murder She Wrote\" to Christie's Hercule Poirot. What makes him even more entertaining is most of the time you're not actually sure if Blanc has any idea if he's onto something or just biding time until it falls in his lap (\"Columbo\" style).\n\nIf you are looking for a good time at the movies this holiday season (perhaps searching for a way to escape the family for a few hours), \"Knives Out\" is certainly one you shouldn't miss.\n\nThe business details:", "description": "After being submerged in all things \"Star Wars\" for years, director Rian Johnson returns with an original story that shows off his many talents.", "authors": ["Jason Guerrasio"], "top_image": "https://amp.businessinsider.com/images/5d74eeb82e22af532e3b33a4-1136-568.jpg", "published_at": "2019-09-08"}