{"pub": "news24", "url": "https://news24.com/World/News/leaked-report-calls-indigenous-womens-deaths-a-canadian-genocide-20190531", "downloaded_at": "2019-10-30 16:03:54.060457+00:00", "title": "Leaked report calls indigenous women's deaths a 'Canadian genocide'", "language": "en", "text": "Ottawa - A public inquiry report leaked to Canada's public broadcaster Friday called the disappearances and slayings of possibly thousands of indigenous women over recent decades a \"Canadian genocide.\"\n\nThe report concluded that through \"state actions and inactions rooted in colonialism and colonial ideologies\" indigenous women and girls faced a disproportionately high level of violence.\n\n\"We do know that thousands of Indigenous women, girls and 2SLGBTQQIA (two-spirit, lesbian, gay, bisexual, transgendered, queer, questioning, intersex and asexual) have been lost to the Canadian genocide to date,\" said the report, titled \"Reclaiming Power and Place.\"\n\n\"The fact that First Nations, Inuit and Metis Peoples are still here and that the population is growing should not discount the charge of genocide.\"\n\nThe National Inquiry into Missing and Murdered Indigenous Women and Girls's 1 200-page final report is set for public release on Monday at a ceremony attended by Prime Minister Justin Trudeau - who has made reconciliation with Canada's 1.6 million indigenous peoples a government priority - and families of the victims.\n\nCBC said it contains more than 230 recommendations.\n\nThe inquiry was the culmination of years of lobbying by native leaders, activists and victims' families seeking to know why possibly thousands of indigenous women were murdered or have gone missing over the past three decades.\n\nIndigenous women represent four percent of Canada's population but accounted for up to 16-24%of homicide victims during the period, said the report's authors.\n\nAccording to official estimates, almost 1 200 women and girls went missing or were killed between 1980 and 2012.\n\nBut inquiry commissioners have said that figure is probably too low.\n\nThe commissioners held 24 hearings across Canada over the past 2.5 years and heard from more than 2,000 witnesses, including family members of missing or murdered women, survivors of violence, experts and officials.", "description": "A public inquiry report leaked to Canada's public broadcaster called the disappearances and slayings of possibly thousands of indigenous women over recent decades a \"Canadian genocide.\"", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/1257/deecd8d40e3f43918583ba959e88ca39.jpg", "published_at": "2019-06-01"}