{"pub": "yahoo", "url": "https://news.yahoo.com/secret-russian-assassination-squad-proven-141342412.html", "downloaded_at": "2019-10-09 19:04:36.524494+00:00", "title": "A secret Russian assassination squad has proven 'they can get to anyone' in Europe but there's just one problem — they're really sloppy about it", "language": "en", "text": "FILE PHOTO: Russian President Vladimir Putin chairs a meeting with members of the government in Moscow, Russia September 25, 2019. Sputnik/Alexei Druzhinin/Kremlin via REUTERS More\n\nReuters\n\n\n\n\n\nA newly discovered Russian assassination squad called \"Unit 29155\" has \"proven they can get to anyone,\" a source told Insider. But their sloppy tradecraft has meant their \"secret\" operations are almost immediately noticed in the West.\n\n\"Some people will point to the sloppiness of some of their operations but in each case they were able to hit the target and in some cases even eliminate it. The real issues seem to come in trying to make an escape without being detected,\" a counterintelligence official told us.\n\nSpies in Europe and the US are hoping they'll screw up some more in the future.\n\nRevelations of an alleged Russian intelligence operation to murder opponents and spread chaos across the European Union were met with a mix of wonder and derision in the intelligence community. Russia's decision to return to formalized violent operations in the West has \"proven they can get to anyone,\" a source told Insider. But in many cases, the Russians' sloppy tradecraft has meant their \"secret\" operations are almost immediately noticed.\n\nTwo current European intelligence officials described the scoop by the New York Times about a unit of Russian military intelligence, commonly called the GRU, tasked with murdering Russia's enemies in Europe and helping sow political and military chaos, as \"credible.\" It's \"confirmation of something we have long suspected: There is a plan,\" one told Insider.\n\nThe NYT piece, which ran Tuesday, used a mix of open-source documentation and intelligence gathered across Europe in the wake of half a dozen killings to determine that many of the international incidents involving Russia involve \"Unit 29155\" of the GRU, a previously unknown unit. It appears to be specifically tasked with irregular operations directed at Europe, including a failed coup in Montenegro and the attempted poisonings of an arms dealer in Bulgaria and a GRU defector in Salisbury, England.\n\nRussia has been re-fighting the Cold War since 2008\n\nThe intelligence officials said confirmation of a long-time suspicion that these operations were centrally organized had only come in the past few months and was a tightly guarded secret among NATO and EU intelligence services. They had been monitoring the unit, and past cases or incidents, for connections.\n\n\"It's been clear since 2008 at least that Russia was reconstituting modern versions of units and techniques they considered useful during the Cold War era,\" said one intelligence official, who is based in Brussels and does not have permission to openly discuss the issue with the media.\n\n\"Some people will point to the sloppiness of some of their operations but in each case they were able to hit the target and in some cases even eliminate it. The real issues seem to come in trying to make an escape without being detected,\" said the official.\n\n\"They have proven they can get to anyone but they've also proven that at least so far — and everyone is going back and reopening cold cases to determine if there were other hits — that it's obvious when the Russians are involved,\" the official added.\n\n\"This unit has operated for over a decade\"\n\nThe second official described a recent push to re-evaluate old intelligence and evidence against this \"new official framework for covert activities.\"\n\n\"Our indications are this unit has operated for over a decade and prior to the new report we have been trying to establish if any of our unsolved cases bear any connection,\" said the second official, who actively works in counterintelligence in a Central European nation.\n\n\"There will be more cases linked to this group,\" the second official said of the possibility that other attacks have taken place but direct Russian involvement went unnoticed.\n\nNone of this, according to the officials, is much a surprise. And one analyst points to the GRU's long history, which dates back to the founding of the Soviet state, as very consistent with such operations.", "description": "Everything you need to know about \"Unit 29155\".", "authors": ["Mitch Prothero"], "top_image": "https://s.yimg.com/uu/api/res/1.2/3PnpmnSxQp4rbzPOQkemyw--~B/aD0yNzMyO3c9MzY0MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/business_insider_articles_888/5b5e29467e999880810527fb03112bdf", "published_at": "2019-10-09"}