{"pub": "thehill", "url": "https://thehill.com/homenews/administration/467201-trump-says-us-is-building-a-wall-in-colorado", "downloaded_at": "2019-10-24 00:34:40.543571+00:00", "title": "Trump says US is building a wall in Colorado", "language": "en", "text": "President Trump Donald John TrumpGraham to introduce resolution condemning House impeachment inquiry Support for impeachment inches up in poll Fox News's Bret Baier calls Trump's attacks on media 'a problem' MORE declared Wednesday that the U.S. is building a border wall in Colorado despite the fact that the Western state does not sit on the U.S-Mexico border.\n\n\"You know why we're going to win New Mexico? Because they want safety on their border. And they didn't have it,\" Trump said during a speech at the Shale Insight conference in Pittsburgh.\n\n\"And we’re building a wall on the border of New Mexico,\" he continued. \"And we’re building a wall in Colorado. We’re building a beautiful wall, a big one that really works that you can’t get over, you can’t get under.\"\n\nADVERTISEMENT\n\nHe added, \"And we’re building a wall in Texas. And we’re not building a wall in Kansas, but they get the benefit of the walls we just mentioned. And Louisiana’s incredible.”\n\nPresident Trump: \"We're building a wall on the border of New Mexico and we're building a wall in Colorado.\" pic.twitter.com/f9ZIdxOhXt — The Hill (@thehill) October 23, 2019\n\nColorado sits directly on top of New Mexico, and aside from Trump’s comments, there are no reports that his administration is building a wall in the state.\n\nThe White House did not immediately respond to a request for comment from The Hill.\n\nThere is a piece of the border wall being built along the Colorado River in Arizona, which shares a border with Mexico.\n\nLawmakers and other officials knocked Trump for his comments, with Sen. Patrick Leahy Patrick Joseph LeahySenators have chance to double funding for women entrepreneurs—they should take it On The Money: Trump dismisses 'phony Emoluments Clause' after Doral criticism | Senate Dems signal support for domestic spending package | House panel to consider vaping tax Senate Dems signal they'll support domestic spending package MORE (D-Vt.) tweeting a photo of a U.S. map with a Sharpie outline along the Colorado border.\n\nFormer Colorado Gov. John Hickenlooper John HickenlooperThe Hill's 12:30 Report: Trump seeks distance from Syria crisis Gardner dodges questions about Trump's call for Biden probe 2020 Presidential Candidates MORE (D) tagged New Mexico Sens. Martin Heinrich Martin Trevor HeinrichSenate confirms Trump's Air Force secretary pick Commerce Department to develop stats on income inequality Senators take fundraising efforts to Nats playoff games MORE (D) and Tom Udall Thomas (Tom) Stewart UdallSenate Dems ask Trump Organization for information on dealings with Turkey The Hill's Morning Report - Presented by Better Medicare Alliance - Trump's impeachment plea to Republicans Bennet, Udall aim to conserve 30 percent of US lands by 2030 MORE (D) in a tweet, saying, “Do one of you want to break it to @realDonaldTrump that Colorado's border is with New Mexico, not Mexico...or should I?”\n\nHey @TeamHeinrich & @tomudall\n\ndo one of you want to break it to @realDonaldTrump that Colorado's border is with New Mexico, not Mexico...or should I? https://t.co/8Qqe59Oep4 — John Hickenlooper (@Hickenlooper) October 23, 2019\n\nGeorge Conway George Thomas ConwayLawmakers, social media users praise photo of Pelosi confronting Trump George Conway accuses Trump of being a 'sociopath' George Conway donates to Trump challenger Joe Walsh MORE, husband to White House counselor Kellyanne Conway Kellyanne Elizabeth ConwayTrump has floated Mnuchin, Conway for White House chief of staff: report Trump embarks on Twitter spree amid impeachment inquiry, Syria outrage The Hill's Campaign Report: Biden camp faces new challenges MORE and an outspoken Trump critic, tweeted that “we can confidently say that Mexico is never going to pay for a wall with Colorado.”", "description": "Colorado sits directly on top of New Mexico, and aside from Trump’s comments, there are no reports that his administration is building a wall in the state.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_10232019getty.jpg", "published_at": "2019-10-23"}