{"pub": "news24", "url": "https://news24.com/World/News/john-conyers-longest-serving-black-us-congressman-dies-at-90-20191028", "downloaded_at": "2019-10-29 00:23:28.859232+00:00", "title": "John Conyers, longest-serving black US congressman, dies at 90", "language": "en", "text": "Former US Representative John Conyers, one of the longest-serving members of Congress whose resolutely liberal stance on civil rights made him a political institution in Washington and back home in Detroit despite several scandals, died on Sunday. He was 90.\n\nThe former legislator died at his home in Detroit, said police spokesman Dan Donakowski. The death \"looks like natural causes\", Donakowski told the Associated Press news agency.\n\nConyers had served as a congressman for more than 50 years before retiring in late 2017 amid sexual misconduct allegations that he denied.\n\nConyers was first elected to Congress in 1964, becoming one of only six African Americans House members at the time. He later helped found the Congressional Black Caucus, which works to \"ensure that African Americans and other marginalised communities in the US have the opportunity to achieve the American Dream\". He also became the first black legislator to serve as House Judiciary Committee chairman.\n\nHis dogged pursuit of civil rights causes and progressive policies made him a political institution in Washington, DC, and in his home city of Detroit, despite several scandals that marred his career, including the conviction of his wife, a city councilwoman in Detroit, who pleaded guilty to bribery in 2009.\n\nIn one of his most notable achievements, Conyers won passage of legislation making the birthday of the Reverend Martin Luther King Jr a national holiday. Conyers introduced the legislation the day after King was assassinated in Memphis, Tennessee, in 1968, but fought 15 years for its eventual passage.\n\nHe also regularly introduced a bill, starting in 1989, that called for a commission to study the harm caused by slavery, while assessing the possibility of reparations for slaves' descendants. However, that bill never moved passed the subcommittee phase.\n\nFollowing his death, Reverend Jesse Jackson, a civil rights icon who had been with King on the day he was assassinated, praised Conyers, saying that without the legislator there would be no holiday to honour the civil rights icon.\n\nJackson told the Associated Press that Conyers's death, along with the recent death of Representative Elijah Cummings of Baltimore, have been \"real painful\".\n\n\"It's like a hole in the sky,\" he said.\n\nConyers's congressional career came to an abrupt end amid allegations of sexual misconduct in 2017. A former staffer alleged she was fired because she rejected his sexual advances. Others came forward following the allegation, saying they witnessed Conyers inappropriately touching female staffers or requesting sexual favours.\n\nThe House Ethics Committee launched an investigation, as Conyers maintained that his office had resolved a harassment case with a payment but no admission of guilt.\n\nConyers finally resigned amid pressure from Democratic colleagues, who were in the midst of reviewing how Congress handles such harassment complaints. Conyers said the allegations were \"not true\" , but stepped down citing health reasons.\n\nDetroit institution\n\nBorn and raised in Detroit, the son of a union organiser in the auto industry, Conyers served in the National Guard and with the US Army Corps of Engineers during the Korean War before earning his bachelor's and law degrees from Wayne State University in the late 1950s.\n\nThroughout his career, the legislator maintained an impassioned base of support in his home city, which he represented during the riots of July 1967, when hostilities between African American residents and Detroit's mostly white police force came to a head. His district office was gutted by fire during the unrest.\n\nThe plight of US inner cities remained one of Conyer's main causes.\n\n\"In Detroit you've got high unemployment, a poverty rate of at least 30 percent, schools not in great shape, high illiteracy, poor families not safe from crime, without health insurance, problems with housing,\" he told The Associated Press in 2004. \"You can't fix one problem by itself - they're all connected.\"\n\nWhen Detroit declared bankruptcy in 2013, Conyers was fiercely opposed to the city's finances being taken over by a state-appointed emergency manager. Conyers sought a federal investigation and congressional hearings, arguing it was \"difficult to identify a single instance\" where such an arrangement, in which local officials are stripped of most of their power, succeeds.\n\nDetroit's mayor, Mike Duggan, in a statement on Sunday, said that he was \"deeply saddened\" by the death of Conyers.\n\nHe added that Conyers's \"impact on our city and nation will never be forgotten\".\n\nTributes from colleagues\n\nFormer congressional colleagues praised Conyers's career and offered condolences to his wife and two sons, who survive him.\n\nChairman of the House Judiciary Committee Jerry Nadler, a Democrat, said in a Twitter post he was \"very sad\" to learn of Conyer's death.\n\n\"His legacy, as a champion of civil rights and progressive values, is one I try to build upon every day,\" he wrote.\n\nFellow Michigan Congresswoman Rashida Tlaib, on Twitter, called Conyers \"our congressman forever\".\n\nSenator Kamala Harris, a Democratic presidential hopeful, also took to social media to remember the legislator.\n\n\"For over 50 years, Congressional Black Caucus Co-Founder John Conyers Jr., reminded us to fight for jobs, justice, and peace and ensured we never forget Martin Luther King Jr.'s sacrifice,\" Harris wrote. \"We carry on his fight today. My prayers are with his family today.\"\n\nAnother presidential hopeful, Senator Bernie Sanders, said Conyers was \"a champion of civil rights ... and long before it was popular, he knew that healthcare was a human right.\"", "description": "Conyers, who left office following sexual misconduct allegations, has been hailed as a \"champion of civil rights\".", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/6758/cd30858429e54b13a042daded5d0d42b.jpg", "published_at": "2019-10-28"}