{"pub": "reuters", "url": "https://ca.reuters.com/article/topNews/idCAKCN1VU034-OCATP", "downloaded_at": "2019-09-09 06:53:28.575194+00:00", "title": "Australia blocks access to eight websites showing video of New Zealand mosque attacks", "language": "en", "text": "FILE PHOTO: A policeman stands guard as members of the Muslim community visit Al-Noor mosque after it was reopened in Christchurch, New Zealand, March 23, 2019. REUTERS/Edgar Su/File Photo\n\nSYDNEY (Reuters) - Australia has ordered internet service providers to block access to eight websites still showing footage of deadly attacks on two mosques in New Zealand earlier this year.\n\nA lone gunman armed with semi-automatic weapons attacked Muslims attending Friday prayers in Christchurch on New Zealand’s South Island on March 15, killing 51 people in the country’s worst mass shooting. The attacker broadcast the shooting live on Facebook, and footage was widely shared.\n\nMost websites quickly removed links to the video, but Australia’s eSafety commissioner Julie Inman Grant said on Sunday eight local sites had defied her requests for the content to be deleted.\n\n“We cannot allow this heinous material to be used to promote, incite or instruct in further terrorist acts,” Grant said in an emailed statement.\n\nThe blocking of the eight websites comes amid a concentrated effort by Australia to clamp-down on the sharing of violent content online.\n\nAustralia in April passed legislation that allowed Canberra to fine social media companies up to 10% of their annual global turnover and imprison executives for up to three years if violent content is not removed “expeditiously”.\n\nIt is now an offense in Australia for companies such as Facebook Inc and Alphabet Inc’s Google, which owns video sharing site YouTube, not to remove any videos or photographs that show murder, torture or rape without delay.\n\nCompanies must also inform Australian police within a “reasonable” timeframe.", "description": "Australia has ordered internet service providers to block access to eight websites still showing footage of deadly attacks on two mosques in New Zealand earlier this year.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190909&t=2&i=1427776423&w=1200&r=LYNXNPEF8802Q-OCATP", "published_at": "2019-09-09"}