{"pub": "politico", "title": "Von der Leyen looks to overhaul Commission power structure", "url": "https://politico.eu/article/ursula-von-der-leyen-looks-to-overhaul-european-commission-power-structure-vice-presidents", "language": "", "published_at": "2019-08-28", "downloaded_at": "2019-09-02 07:10:08.294755+00:00", "text": "Ursula von der Leyen is considering plans to revamp the structure of the next European Commission.\n\nThe biggest change in a draft plan being mulled by the incoming Commission president, according to several EU officials who spoke to POLITICO, would be to give greater influence to the Commission's vice presidents. In the current structure, vice presidents have fancy job titles (and pay packets) but little in the way of real power.\n\nThe plan now under consideration would see the executive's top vice presidents get direct access to Commission staff, which would give them more power to inform and set legislation than now.\n\nThe existing system \"wasn't well thought out,\" said a Commission official speaking on condition of anonymity.\n\nIn the outgoing Commission of Jean-Claude Juncker, his former chief of staff Martin Selmayr, the powerful head of the Commission secretariat who was recently ousted from his job, devised a system that apportioned portfolios ranging from energy and climate to finance and digital policy to five vice presidents who were nominally supposed to oversee commissioners.\n\nThe reform ideas are part of a broader effort to reflect geographical and political diversity in the executive's leadership.\n\nBut the vice presidents didn't have direct access to Commission staffers working on the nuts and bolts of policy. Instead, they had to rely on a smaller pool of officials from the Secretariat-General, the Commission's in-house bureaucracy.\n\nThe idea was to balance power between newer and older member states, big and small nations, and different political groupings. But it ended up creating frustration and power clashes.\n\nThat’s because vice presidents were often overshadowed by more powerful commissioners — more often than not from Western and Nordic countries — who were in direct control of policy departments. One example is what happened with Vice President for Energy Union Maroš Šefčovič, a Slovak, who was sidelined by Spanish Energy and Climate Commissioner Miguel Arias Cañete.\n\nThat's now being rethought.\n\nA senior Commission official grabbed a sheet of paper and sketched out what the new Commission's organizational structure might look like.\n\nUnder an agreement on the top EU posts hashed out by the bloc's leaders in July, Dutch Socialist Frans Timmermans and Margrethe Vestager, the Danish liberal competition commissioner, will both be given first vice president posts. Plans under consideration now would give them much more sway than the current setup, being in charge of project teams of commissioners and their policy officials.\n\nFor example, according to an official with knowledge of the matter, plans would see Timmermans put in charge of efforts to come up with a Green New Deal — something von der Leyen promised to present within her first 100 days in office.\n\nRelevant policy areas possibly grouped under this banner would include transport, energy, and research and development. Timmermans could get a policy department under his direct supervision, meaning he'd be able to direct those bureaucrats, as well as access to resources of the Secretariat-General.\n\nVon der Leyen's transition team didn't respond to requests for comment.\n\nMénage à trois\n\nHowever, the structure of the new Commission is still in flux, including nominations for additional vice presidents, and how much power they'll have. Vestager could be in charge of topics such as EU industry and competition policy. Officials cautioned that both Timmermans and Vestager are keen on the climate portfolio, one of von der Leyen's big priorities.\n\nThe reform ideas are part of a broader effort to reflect geographical and political diversity in the executive's leadership, and to better coordinate issues that don't fit easily into a single Commission portfolio. Climate is a good example, as it affects everything from energy to transport, agriculture, health and more.\n\nBut breaking down policy silos relies on bureaucratic infighting skills. Revamping the system will depend on \"how powerful, and how convincing\" the new vice presidents are in disrupting the \"cottage industries\" of existing portfolios, the senior official said.\n\nThe pieces of the next Commission are slowly being put together; von der Leyen this week is meeting candidates for commissioner posts and hopes to come up with a complete list in the coming weeks.\n\nOn Monday afternoon, she met Margaritis Schinas, the Greek commissioner candidate and former chief spokesperson of the Commission. On Tuesday, she interviewed Helena Dalli, Malta’s EU affairs minister and that country's candidate. On Wednesday, she's set to meet other commissioner hopefuls, including Věra Jourová, the Czech who is currently justice commissioner, Kadri Simson from Estonia and Stella Kyriakides from Cyprus, as well as Timmermans.\n\nThe need to rethink how the Commission functions is a result of the political compromises that saw von der Leyen catapulted from German defense minister to nominee for Commission president in a surprise last-minute deal, edging out Timmermans and Vestager. In order to preserve the balance between her European People's Party, Timmermans' Socialists and Vestager's liberals, the two defeated candidates have to be given powerful positions.\n\nOne senior EU official dubbed it the \"enlightened triumvirate of presidents\" — born out of political necessity to ensure majority backing for policy proposals. For now, it's unclear how von der Leyen, Vestager and Timmermans will share power.\n\n\"You cannot have three presidents, but you need a bizarre love triangle,\" the senior official said.", "description": "The intention is to give vice presidents more real power.", "authors": ["Kalina Oroschakoff", "Jacopo Barigazzi", "Maïa De La Baume", "Zosia Wanat", "Isabella Borshoff"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/07/GettyImages-1155826497-1200x628.jpg"}