{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/jeffrey-epstein-reportedly-reaped-tax-benefits-deutsche-bank-nonprofit-2019-9-1028523938", "downloaded_at": "2019-09-13 19:26:40.563670+00:00", "title": "Jeffrey Epstein reportedly used a murky nonprofit account with Deutsche Bank to reap tax benefits", "language": "en", "text": "Reuters\n\nJeffrey Epstein's Gratitude America foundation reported a number of charitable donations since its founding in 2012, but several listed recipients never received the funds, the Wall Street Journal reported.\n\nThe discrepancy places a greater focus on Deutsche Bank's activities, as it handled Gratitude America's finances. The foundation reported more than $1.8 million in charitable contributions between 2016 and 2017.\n\nBanks often watch wealthy clients and their foundations with increased scrutiny, as falsified charitable donations can yield massive tax benefits.\n\nEpstein had long been a Deutsche Bank client, and had access to its exclusive Key Client Partners group, according to the WSJ.\n\nVisit the Markets Insider homepage for more stories.\n\nJeffrey Epstein established his Gratitude America foundation in 2012, and a Wall Street Journal report on Thursday detailed how the nonprofit was possibly used to generate tax benefits through suspicious donations.\n\nGratitude America reportedly made more than $1.8 million in charitable contributions between 2016 and 2017, yet several listed recipients said they never received the funds. The foundation banked with Deutsche Bank, where Epstein had been a customer in its exclusive Key Client Partners group.\n\nBanks tend to monitor wealthy customers' charities with greater scrutiny, as charitable donations can lend massive tax breaks.\n\nThe foundation's purpose was to \"support the expression of gratitude for the ideals of America,\" according to its incorporation records. The disgraced financier was listed as the nonprofit's president in its foundation and for several years after, WSJ reported.\n\nEpstein reportedly tried to use the foundation to make a charitable donation to a nonprofit in the US Virgin Islands, where he owns two islands. The payment was made in hopes of resolving a fine from the islands' government, according to the WSJ, citing people familiar with the matter.\n\nInstead of paying the fine, Gratitude America and another Epstein foundation each wrote $160,000 checks out to the St. Thomas Historical Trust, a non-profit based in the islands. Representatives of the St. Thomas Historical Trust told WSJ they never received the checks.\n\nMarkets Insider is looking for a panel of millennial investors. If you're active in the markets, CLICK HERE to sign up.\n\nThe Gratitude America check came from a Deutsche Bank account, and both checks were signed by one of Epstein's lawyers. The attorney also served on the foundation's board, and eventually signed a check from the other Epstein foundation to pay the government's fine.\n\n\"The representatives of Mr. Epstein would have liked the settlements to include the payments as charitable donations,\" Virgin Islands planning department spokesman, Jamal Nielsen, told the WSJ. \"However, the department rejected the offer. The settlement had to be paid to the department.\"\n\nGratitude America listed several other organizations as recipients of charitable donations, but many of them said they never received money from the nonprofit. The foundation's 2017 tax return lists a $15,000 donation to an Elton John charity with the same address as the Elton John AIDS Foundation, yet the charity said it has no record of a contribution from Gratitude America or Epstein.\n\nEpstein's nonprofit also said it made a $75,000 donation to the Cancer Research Wellness Institute in California. Yet a representative with the institute said it never received the money, the WSJ found.\n\nGratitude America listed 27 charitable donations across its 2016 and 2017 tax returns, WSJ reported. Some listed recipients, such as the Icahn School of Medicine, noted they received contributions from Epstein himself, and not Gratitude America.\n\nGratitude America was cut off from the bank's services in recent months, according to the WSJ, citing sources familiar with the subject.\n\nEpstein committed suicide in his Manhattan jail cell August 10 while facing charges for federal sex-trafficking. Since then, the investor's finances and relationship with Deutsche Bank have fallen under the purview of an ongoing federal investigation.\n\nNow read more markets coverage from Markets Insider and Business Insider:\n\nGoldman Sachs slaps Apple with the lowest price target of any major research firm as analysts predict TV+ will eat iPhone profits\n\nBrooklyn Nets guard Spencer Dinwiddie is planning to release a digital token for others to invest in his contract\n\nGoldman Sachs is offering buyouts to encourage partners to leave as CEO David Solomon works to shrink one of the most elite clubs on Wall Street", "description": "Jeffrey Epstein's Gratitude America foundation reported a number of charitable donations since its founding in 2012, but several listed recipients never r...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d7bde782e22af243e751337-2400/2019-09-13t142617z1lynxnpef8c1ikrtroptp4people-jeffrey-epstein.jpg", "published_at": "2019-09-10"}