{"pub": "cbc", "url": "https://cbc.ca/sports/football/nfl/antonio-brown-patriots-sexual-assault-lawsuit-1.5278669", "downloaded_at": "2019-09-11 07:25:48.782608+00:00", "title": "Sports-no-CBC", "language": "en", "text": "New England Patriots wide receiver Antonio Brown has been accused of rape by a former trainer.\n\nBritney Taylor says Brown sexually assaulted her on three occasions, according to a lawsuit filed Tuesday in the Southern District of Florida.\n\nBrown has denied the allegations. Darren Heitner, a lawyer representing Brown, told The Associated Press his client plans to countersue.\n\n\"He will pursue all legal remedies to not only clear his name, but to also protect other professional athletes against false accusations,\" Heitner said in a statement.\n\nHeitner said Brown and Taylor had \"a consensual personal relationship.\"\n\nThe New York Times first reported about the lawsuit.\n\nThe AP does not ordinarily name the alleged victims of sex assaults, but Taylor was identified in the federal lawsuit and was quoted in a statement provided by her lawyer, David Haas.\n\n\"As a rape victim of Antonio Brown, deciding to speak out has been an incredibly difficult decision,\" Taylor said. \"I have found strength in my faith, my family, and from the accounts of other survivors of sexual assault. Speaking out removes the shame that I have felt for the past year and places it on the person responsible for my rape.\"\n\nTaylor also said in the statement she will co-operate with the NFL and any other agencies.\n\nNFL declines comment\n\nA spokesman for the NFL declined comment. A message was left seeking comment from the Patriots.\n\nThe 31-year-old Brown, a Miami native, was released by Oakland last week after clashing with the team throughout training camp. He agreed to a contract with New England on Saturday, but has yet to play for the Patriots.\n\nBrown and Taylor met through a Fellowship of Christian Athletes group at Central Michigan University, according to the suit.\n\nTaylor said Brown reached out to her via Facebook in June 2017 and asked the former gymnast for help with improving his strength and flexibility.\n\nAccording to the lawsuit, Taylor was sexually assaulted by Brown on separate training trips to Pittsburgh and Florida that same month. The suit includes what it says are text messages from Brown bragging about the second assault.\n\nTaylor says in the suit she then cut off ties with Brown. But she agreed to work with him again after she says he apologized and agreed to provide hotel accommodations for each training trip.\n\nMay 2018 incident\n\nAccording to the lawsuit, Taylor and Brown were in Miami in May 2018 when he raped her in a bedroom at his home. Taylor says she shouted \"no\" and \"stop,\" but Brown refused.\n\nHeitner said in his statement Taylor invited herself to join Brown and his friends on a night out on the town, and then came on to Brown before they engaged in consensual sex at his residence.\n\nBrown was approached by Taylor in 2017, according to Heitner, about making a $1.6 million US investment in a business project. But he declined.\n\nHeitner said Taylor reached out to Brown again last year, and she travelled to his residences on multiple occasions. Heitner said she asked for tickets to a Pittsburgh Steelers game.\n\n\"Mr. Brown, whose hard work and dedication to his craft has allowed him to rise to the top of his profession, refuses to be the victim of what he believes to be a money grab,\" Heitner said in his statement.\n\nBrown was originally traded from Pittsburgh to Oakland in the off-season. But a bizarre foot injury, fight with the NFL over his helmet, skipped practices, multiple fines, a run-in with general manager Mike Mayock and his social media posts ultimately led to the decision to release him.\n\nBrown agreed to a deal with the defending Super Bowl champions hours after the Raiders let him go, granting his request.", "description": "Britney Taylor says Brown sexually assaulted her on three occasions, according to a lawsuit filed Tuesday in the Southern District of Florida.", "authors": [], "top_image": "https://i.cbc.ca/1.5278670.1568167672!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/brown-antonio.jpg", "published_at": "2019-09-11"}