{"pub": "huffpost", "title": "People On Twitter Are Horny For The New Host Of 'Blue's Clues'", "url": "https://huffpost.com/entry/blues-clues-joshua-dela-cruz-hot_n_5d693cdae4b0488c0d13add2", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 06:59:19.430666+00:00", "text": "Many people on Twitter have recently discovered that they’re very attracted to Joshua Dela Cruz, the new host of Nickelodeon’s “Blue’s Clues” reboot, and it’s led to some pretty horny tweets.\n\nWhile the network announced the casting of Dela Cruz on the show “Blue’s Clues & You” last fall and released a sneak peek in May, the Filipino American star has only recently begun to light up social media.\n\nFrom the looks of some thirsty tweets, it seems that interest was piqued once images from Dela Cruz’s Instagram page started circulating.\n\nLook at this shot... hubba hubba, much?\n\nAnyway, Dela Cruz’s new role doesn’t hit screens until November, so we’ll have to wait until then to, uh, tune in to the children’s show.\n\nIn the interim, let’s read some horny tweets about him:\n\nyo i’m horny for the new host of blues clues y’all — ✿maddie✿ 🎀 || ia bc uni (@harrysenpaidesu) August 28, 2019\n\nthe new blues clues host is so cute it should be a crime — Shoona Browning🦈✨ (@shoonabee) August 27, 2019\n\nTHE NEW BLUES CLUES HOST IS SEXY. STEVE COULD NEVER. — Olivia 🦋 (@obsessioncherry) August 28, 2019\n\nI thrist followed the new blues clues host... pic.twitter.com/vVN0J4QQ1G — &🦘 😇🅾️ 🔝ℹ️🆕 (@TheAndrewTops) August 28, 2019\n\nliterally me with josh, the new host of blues clues pic.twitter.com/M2AhXOH5Pi — ✿maddie✿ 🎀 || ia bc uni (@harrysenpaidesu) August 29, 2019\n\nok fine josh the new blues clues host is a hooootttieee — Klar Chen (@klar_chen) August 29, 2019\n\nWatching Blues Clues only to to thirst the new host pic.twitter.com/9ZGo2qHLeV — HELA MAZING (@theTitanGil) August 30, 2019\n\nI SAID IT I FUCKING SAID IT BUT ALL MY FRIENDS WANTED TO SAY I WAS WEIRD CUZ HES THE NEW BLUES CLUES HOST FUCK YALL HES FINE AS FUCK https://t.co/fRfTM67EFC — 𝓀𝒾𝓉𝓉 ♥ (@ughitskitt) August 29, 2019\n\nig users: omg 😔 this is Not my blues clues. the original is better. my childhood is ruined. i hate this.\n\ntwt users: THE NEW HOST IS SO HOT 🤪 — 𝙢𝙪𝙙𝙖 (@freshpandesaI) August 30, 2019", "description": "Joshua Dela Cruz is making waves on social media after fans found his Instagram page and decided the \"Blue's Clues & You\" star is \"so hot.\"", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d6940642500004b04750cd8.png?cache=nehc4fa9mm&ops=1778_1000"}