{"pub": "investingcom", "url": "https://ph.investing.com/news/stock-market-news/global-marketsasian-shares-inch-up-investors-pin-hopes-on-uschina-talks-60078", "downloaded_at": "2019-10-01 04:35:04.513155+00:00", "title": "GLOBAL MARKETS-Asian shares inch up, investors pin hopes on U.S.-China talks", "language": "en", "text": "GLOBAL MARKETS-Asian shares inch up, investors pin hopes on U.S.-China talks\n\n* Nikkei up 0.7%, ex-Japan Asia up 0.24%\n\n* U.S.-listed Chinese shares bounce after Friday's fall\n\n* China markets begin one-week holiday closure\n\n* Euro near 2 1/2-year low\n\n* Asian stock markets: https://tmsnrt.rs/2zpUAr4\n\n\n\nBy Hideyuki Sano\n\nTOKYO, Oct 1 (Reuters) - Asian share prices ticked up on\n\nTuesday as some investors clung to hopes that the fourth quarter\n\nwill bring progress in resolving the United-States trade war\n\nthat's cast a shadow over the global economy.\n\nJapan's Nikkei rose 0.74% while MSCI's broadest\n\nindex of Asia-Pacific shares outside Japan\n\ninched up 0.24% and Australia's benchmark by 0.25%.\n\nChinese markets will be shut for a week, starting on\n\nTuesday, to mark 70 years since the founding of the People's\n\nRepublic of China.\n\nU.S. stock futures rose 0.35% in Asia, a day after\n\nthe S&P 500 gained 0.50%.\n\nTechnology sectors led New York gains on Monday while\n\nU.S.-listed shares of Chinese firms bounced up a tad, after big\n\nfalls on Friday, with Alibaba BABA.N up 0.75% and Baidu\n\ngaining 1.53%.\n\nDuring the July-September quarter, the S&P500 advanced\n\n1.21%.\n\nIn Europe, the benchmark stock index gained 2.15%\n\nin the quarter to end at a 16-month high, thanks in part to a\n\nweak euro.\n\nWhite House trade adviser Peter Navarro dismissed reports\n\nthat the Trump administration was considering delisting Chinese\n\ncompanies from U.S. stock exchanges as \"fake news\", giving\n\nshort-term players an excuse to buy back risk assets.\n\n\"Whether it was a fake news or not, it is becoming harder to\n\nknow exactly what the U.S. administration will be doing,\" said\n\nTakashi Hiroki, chief strategist at Monex Securities.\n\nChina and the United States are due to resume high-level\n\ntrade talks next week in Washington.\n\n\"It's not clear how the U.S.-China talks will progress,\n\ngiven there are hard-liners against China in the administration.\n\nBut if there's no further escalation in the upcoming meeting,\n\nmarkets will be relieved,\" Hiroki said.\n\nWhile the tussle over trade and technology between the\n\nworld's two largest economies has intensified, some investors\n\nare sticking to hopes of a compromise.\n\nThey say a tentative deal could be reached by the end of\n\nthis year, given that President Donald Trump's administration\n\nwould strive to avoid the U.S. economy falling into a recession\n\nin an election year.\n\n\"While we ought not to have preconception, for Trump, not\n\nhaving made a deal with China could be increasingly seen as\n\nnegative ahead of the election next year,\" said Tomoo Kinoshita,\n\nchief global strategist at Invesco Asset Management in Tokyo.\n\nIn the currency market, the euro extended its decline on\n\nworries about sluggish growth in the currency bloc.\n\nThe euro traded at $1.0888 , having slipped to a near\n\n2 1/2-year low of $1.0885 in U.S. trade on Monday.\n\nThe yen was slightly weaker at 108.24 yen to the dollar\n\n, not far from last month's low of 108.48.\n\nThe Japanese currency showed no reaction to the Bank of\n\nJapan's tankan survey showing business confidence at big\n\nJapanese manufacturers worsened in the three months to September\n\nto its lowest level in six years. The Australian dollar fetched $0.6739 AUD=D4 , down 0.2%\n\nand near three-week low of $0.6739 touched last month ahead of a\n\nlikely rate cut by the Reserve Bank of Australia later in the\n\nday.\n\nA majority of 35 economists polled by Reuters expect the RBA\n\nto cut the cash rate for the third time this year.\n\nThe New Zealand dollar slipped to a four-year low of $0.6238\n\nNZD=D4 , following Monday's weak local business sentiment data.\n\nGold fell to a two-month low on the back of a robust U.S.\n\ndollar, last trading at $1,468.50 per ounce .\n\nOil prices rebounded in early Asian trade on Tuesday after\n\nproduction at the world's largest oil producers fell in the\n\nthird quarter, although demand concerns continued to keep a keep\n\na lid on prices.\n\nU.S. West Texas Intermediate (WTI) crude fell 3.3% on\n\nMonday before rise 0.39% early on Tuesday to $54.28 per barrel.\n\n\n\n(Editing by Richard Borsuk)\n\n", "description": "GLOBAL MARKETS-Asian shares inch up, investors pin hopes on U.S.-China talks", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/STOCK-EXCHANGE-RUSSIAN-TRADING-SYSTEMS_800x533_L_1414427815.jpg", "published_at": "2019-10-01"}