{"pub": "breitbart", "url": "https://breitbart.com/news/n-c-s-first-democratic-female-senator-kay-hagan-dies-at-66", "downloaded_at": "2019-10-29 00:19:25.296465+00:00", "title": "N.C.’s first Democratic female senator, Kay Hagan, dies at 66", "language": "en", "text": "Oct. 28 (UPI) — North Carolina’s first female Democratic Senator Kay Hagan died Monday at age 66.\n\nHagan died in her sleep in her Greensboro home after battling encephalitis for three years.\n\n“We are heartbroken to share that Kay left us unexpectedly this morning,” the Hagan family said in a statement. “Kay meant everything to us, and we were honored to share her with the people of North Carolina whom she cared for and fought for so passionately as an elected official.”\n\nHagan served in the North Carolina Senate for a decade and was elected to the U.S. Senate in 2008, beating incumbent Republican Sen. Elizabeth Dole to become the first female Democratic senator in the state, and serving one term in office. In 2014, she lost her re-election bid to Republican Sen. Thom Tillis.\n\n“Susan and I are absolutely heartbroken by Senator Kay Hagan’s sudden passing and extend our condolences and prayers to her loving family and many friends,” Tillis tweeted. “We join all North Carolinians in remembering her dedicated and distinguished record of public service to our state & nation.”\n\nRepublican Rep. Mark Walker also tweeted a post honoring Hagan’s service to the state and expressing condolences to the family.\n\n“My heart goes out to [her husband] Chip Hagan and the entire Hagan family in the passing of Kay,” Walker tweeted. “Sen. Hagan was dedicated to serving North Carolinians and especially to the men and women of the Armed Forces in America’s most military friendly state.”\n\nThe News and Record reported Hagan was in Washington in December of 2016 when she became sick and had to go to the hospital for encephalitis, which is a brain inflammation caused by a virus. Her family said that the Powassan virus transmitted by ticks caused the condition.\n\nAlong with her husband, Chip; other survivors include her children, Jeanette Hagan, Tilden Hagan and Carrie Hagan Stewart; father, Joe Ruthven; two brothers; and five grandchildren.\n\n“We are deeply grateful for the support shared with our family as Kay worked to regain her strength these last few years after her illness, and we appreciate your continued prayers,” Hagan’s family said.", "description": "Oct. 28 (UPI) — North Carolina’s first female Democratic Senator Kay Hagan died Monday at age 66. Hagan died in her sleep in her Greensboro", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-28"}