{"pub": "investing.com", "url": "https://uk.investing.com/news/economy/top-5-things-to-know-in-the-market-on-friday-1985426", "downloaded_at": "2019-10-25 17:06:10.327147+00:00", "title": "Top 5 Things to Know in the Market on Friday", "language": "en", "text": "© Reuters.\n\n1. Prime delivery roll-out hurts Amazon's profits\n\nInvesting.com -- Amazon's earnings fall for the first time in two years, while Indonesia formally blames Boeing for the 737 MAX Lion Air crash and Anheuser-Busch Inbev struggles with a drop in Chinese demand for beer. Here's what you need to know in financial markets on Friday, 25th October.\n\nAmazon.com's (NASDAQ: ) fell 26% on the year in the three months to September, the first annual decline in two years and the second quarter in a row that it’s missed analysts’ expectations. Revenue rose 24% to $70 billion, which beat analysts’ forecasts, but the shares are set to open sharply lower, after falling over 7% in after-hours trading on Thursday.\n\nThe figures reflected another heavy increase in investment, this time to pay for the roll-out of same-day delivery for its Prime subscription service. Global shipping costs were up 46% on the year. Revenue and profit growth at its cloud hosting unit AWS, which has been the company's cash cow in recent years, also came in below expectations.\n\nAmazon said it expected its fourth-quarter operating profit to fall to between $1.2 and $2.9 billion, well short of the $4.2 billion expected previously by analysts.\n\n2. Stocks set to open mixed\n\nWall Street is set to open mixed, with the Amazon news offset by better-than-expected results after the bell last night from both Visa (NYSE: ) and Intel (NASDAQ: ).\n\nBy 6:15 AM ET, were unchanged, while were up 0.1% and the contract was up 0.2%.\n\nToday’s earnings roster is led by Verizon (NYSE: ), which is due to report before the opening along with Charter Communications (NASDAQ: ), Illinois Tool Works (NYSE: ), refiner Phillips 66 (NYSE: ) and Aon (NYSE: ).\n\nIt's a light day on the data front, with only the University of Michigan's final figures for in October due. In Europe, there were further signs that Germany, the region's largest economy, may be bottoming out. The closely-watched index stayed unchanged at 94.6.\n\n3. Pound stumbles as Johnson gambles\n\nThe and U.K. both fell after Prime Minister Boris Johnson called for a general election to break the deadlock over his Brexit bill.\n\nJohnson’s last move reflected a lack of confidence that the bill would pass as planned, after rising signs of concern amid lawmakers that it doesn’t banish the likelihood of a disorderly no-deal Brexit either this year or at the end of the supposed transitional period at the end of 2020.\n\nJohnson was forced by parliament at the weekend to ask the EU for another extension to the Oct. 31 deadline, and while the EU has been sympathetic to the request, Reuters reported Friday that it will not take a decision on how long an extension to grant until parliament votes on Johnson’s request for an election on Monday. The opposition has signalled that it won’t support an election before the risk of No Deal is completely removed.\n\n4. Trouble brewing for Bud\n\nShares in Anheuser Busch Inbev (NYSE: ), the world’s largest brewer, tumbled by over 9% in Europe after the company reported weak sales in China in the third quarter and slashed its profit forecast for the year.\n\nThe brewer now sees only a ‘moderate’ increase in underlying earnings instead of the ‘strong’ increase it expected earlier, noting that it expects the headwinds to continue through the end of the year.\n\nThere was better news from the luxury sector, where both Gucci owner Kering (PA: ) and Italy's Moncler (MI: ) both reported robust increases in Asian sales, shrugging off the troubles that hit their boutiques in Hong Kong over the summer.\n\n5. Boeing blamed for Lion Air crash\n\nIndonesia rounded off a miserable week for Boeing (NYSE: ) by formally blaming it for the Lion Air 737 MAX crash earlier this year in the final report of officials investigating the disaster\n\nIt said the design and certification of the MCAS flight control system were “not adequate” and said the airplane maker had relied on false assumptions. It also faulted Boeing for giving airlines inadequate guidance on how to respond to problems with MCAS.\n\nBoeing promised again to fix the problems as soon as possible.", "description": "Top 5 Things to Know in the Market on Friday", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEE1B0L3_L.jpg", "published_at": "2019-10-25"}