{"pub": "huffpost", "url": "https://huffpost.com/entry/donald-trump-rudy-giuliani-corruption-twitter_n_5db38bdee4b079eb95a3bc45", "downloaded_at": "2019-10-26 02:11:01.463474+00:00", "title": "Trump Says Giuliani 'Looks For Corruption.' Twitter Users Know Where He Can Find It.", "language": "en", "text": "President Donald Trump stood up for his pal and personal attorney Rudy Giuliani Friday, telling reporters that the former New York City mayor is a “great gentleman” and a “great crime fighter” who “looks for corruption wherever he goes.”\n\nTrump was defending Giuliani amid a widening investigation into Giuliani’s role in an alleged shadow campaign pressing Ukraine to launch a probe into Trump’s political rival Joe Biden and his son. Investigators are now also examining whether Giuliani covertly represented foreign interests, as well as his links to associates charged with illegal campaign contributions.\n\nTwitter users were particularly taken by Trump’s boast about Giuliani looking for corruption. They had suggestions about where the attorney might find it.\n\nHe should look in his bank account. https://t.co/vsdNNGhNXi — Renato Mariotti (@renato_mariotti) October 25, 2019\n\nIt certainly follows him wherever he goes. — Robbie Sherwood (@RobbieSherwood) October 25, 2019\n\nI think @realDonaldTrump meant to say, “He generates corruption wherever he goes...” understandable mistake given #Individual1’s difficulty with the English language. Perhaps it would have been easier for him to say it in Russian. — DianeNamm (@DianeNamm) October 25, 2019\n\nDid Trump mean, Rudy, he looks like corruption wherever he goes. — Colleen Hamilton (@Colleen_ham1) October 25, 2019\n\nI’m sure he does, and then keeps it all in a safe to be used at a convenient time. 🤨 — Lisa (@sweedypy) October 25, 2019\n\nAnd he finds it - usually when he sees his reflection — Chris L. Owens (@sonicshrew) October 25, 2019\n\nHas he checked his bank statements? — Chris (@ChristineCSE) October 25, 2019", "description": "People on Twitter urged the president's attorney, who is under investigation, to check the mirror — or his bank statements.", "authors": ["Trends Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5db38c32210000df2c34b171.jpeg?cache=dwkx69wpda&ops=1778_1000", "published_at": "2019-10-26"}