{"pub": "mirror", "url": "https://mirror.co.uk/news/weird-news/home-bargains-shoppers-mistake-fake-20572154", "downloaded_at": "2019-10-13 18:29:47.561918+00:00", "title": "Home Bargains shoppers mistake fake Halloween scar for something very explicit", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nHalloween costumes have regularly been making the transition from spooky to sexy in recent years.\n\nFashion Nova's release of a very revealing range of Toy Story-inspired outfits prove that not even our favourite childhood characters are safe from the trend.\n\nFortunately, fangs, witches hats and fake blood are all still available for those of us who prefer to stick to tradition.\n\nBut one gory prop on sale at Home Bargains is gaining attention for a different reason altogether, as reported by Devon Live .\n\n(Image: Extreme Couponing and Bargains UK group)\n\nThe 99p latex scars have been shared online, with people saying they can't unsee its resemblance to a vagina.\n\nA post on the Spotted Newton Abbot Facebook group attracted a lot of cheeky comments, including \"Glad you said it's Home Bargains, I thought it was Ann Summers.\"\n\nAnother said \"I’m not the only one. I thought I was being a pervert.\"\n\nIt wasn't all fun and games though, with one commenter demanding it to be taken off sale after it was shared on a couponing and bargains group.\n\nIt read: \"Disgusting! It should be removed from the shelves. Young kiddies just think its a deep wound but adults know what it looks like.\n\n\"Shop assistants should have reported this to their manager.\"\n\nHome Bargains were approached for a comment, but a spokesperson told Devon Live the company was not able to comment.", "description": "Some saw the funny side but another has demanded the Halloween prop be removed from the shelves", "authors": ["Colleen Smith", "Luke Matthews", "Image", "Extreme Couponing", "Bargains Uk Group"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20572297.ece/ALTERNATES/s1200/1_Home-Bargains-fake-Halloween-scar-reminds-shoppers-of-something-far-more-explicit.jpg", "published_at": "2019-10-13"}