{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7599629/Lori-Loughlins-daughters-drop-USC-mother-awaits-trial-admissions-scandal.html", "downloaded_at": "2019-10-22 13:35:02.464934+00:00", "title": "Lori Loughlin's daughters drop out of USC as their mother awaits trial in admissions scandal", "language": "en", "text": "Lori Loughlin's daughters are no longer enrolled at the University of Southern California.\n\nProsecutors in the college admissions scandal claim that Loughlin, 55, paid a $500,000 bribe for her daughters, Olivia Jade, 20, and Isabella Giannulli, 21, to be accepted to the university.\n\nBut the university registrar has revealed that the sisters aren't enrolled at the school anymore, according to USA Today.\n\nLori Loughlin's daughters are no longer enrolled at the University of Southern California\n\nProsecutors in the college admissions scandal claim that Loughlin, 55, paid a $500,000 bribe for her daughters, Olivia Jade, 20, and Isabella Giannulli, 21, (pictured) to be accepted to the university\n\nThey were not able to provide any other information because of student privacy laws.\n\nUSC is currently reviewing the admissions of 33 of their students which have been linked to the scandal.\n\nLoughlin and her fashion-designer husband, Mossimo Giannulli, 56, have pleaded not guilty and their trials are due to begin next year.\n\nThey stand accused of making it look as though their daughters were crew recruits even though neither of them took part in the sport.\n\nAnd they even got the girls to pose for pictures on rowing machines, which they sent to the university alongside fake athletic profiles.\n\nAnd actress Felicity Huffman, 56, is currently serving a 14-day prison sentence after being found guilty of paying admissions consultant Rick Singer $15,000 to fake the answers for her now 19-year-old daughter, Sophia.\n\nLoughlin (pictured with her daughters) and her fashion-designer husband, Mossimo Giannulli, 56, have pleaded not guilty and their trials are due to begin next year.\n\nUSC is currently reviewing the admissions of 33 of their students which have been linked to the scandal\n\nHuffman still has 250 hours of community service to complete and must stay in prison for the next nine days.\n\nLoughlin is planning on asking the ex-Desperate Housewife about her stay in prison in case she has to serve time.\n\n'She’s definitely hoping that Felicity’s time in prison will go easy for her, because that will be a positive sign that, if Lori has to serve time, that she’ll be able to weather it as well,' a source told People.\n\n'She wants to debrief Felicity after jail to find out what it was like and what her advice would be.'", "description": "Olivia Jade, 20, and Isabella Giannulli, 21, are no longer enrolled at the University of Southern California. Mother Lori Loughlin, 55, is accused of paying a $500,000 bribe for their admission.", "authors": ["Isabella Nikolic For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/11/20030608-0-image-a-3_1571740523951.jpg", "published_at": "2019-10-22"}