{"pub": "realclearpolitics", "url": "https://issuesinsights.com/2019/10/04/impeachment-comments-democrats-would-rather-you-forget", "downloaded_at": "2019-10-04 12:32:14.674724+00:00", "title": "Impeachment Comments Democrats Would Rather You Forget", "language": "en", "text": "I&I Editorial\n\nMore than 20 years ago, when President Bill Clinton was being impeached for lying to a grand jury – then as now a documented fact that no one can credibly dispute – some Democrats who today want to impeach and have the Senate remove President Donald Trump from office ASAP, were whistling a very different tune.\n\nBack then they strongly argued:\n\nThere was no bipartisan consensus. An impeachment would be traumatic for the country and distract Congress from solving major domestic and foreign policy problems.\n\nHouse Speaker Nancy Pelosi:\n\n“We are here today because the Republicans in the House are paralyzed with hatred of President Clinton. And until the Republicans free themselves of this hatred, our country will suffer.”\n\nFormer Vice President Joe Biden (then a U.S. senator):\n\n“It would have been wrong for Richard Nixon to have been removed from office based upon a purely partisan vote. No president should be removed from office merely because one party enjoys a commanding lead in either house of the Congress …\n\n“It is our constitutional duty to give the president the benefit of the doubt on the facts …\n\n“Brett Kavanaugh, who was associate independent counsel in Ken Starr’s office for three years, put this argument most succinctly in a recent article he published in the Georgetown Law Journal: ‘The President is not simply another individual. He is unique. He is the embodiment of the federal government and the head of a political party. If he is to be removed, the entire government likely would suffer, [and] the military or economic consequences to the nation could be severe’ …\n\n“To remove a president is to decapitate another branch and to undermine the independence necessary for it to fulfill its constitutional role … To remove a duly-elected president clashes with democratic principles in a way that simply has no constitutional parallel …\n\n“Federalist 65 also sounds a warning – again, it is a warning that has been invoked over and over again – that impeachments inevitably risk being hijacked by partisan political forces …\n\n“Given the essentially anti-democratic nature of impeachment and the great dangers inherent in the too-ready exercise of that power, impeachment has no place in our system of constitutional democracy except as an extreme measure – reserved for breaches of the public trust by a president who so violates his official duties, misuses his official powers or places our system of government at such risk that our constitutional government is put in immediate danger by his continuing to serve out the term to which the people of the United States elected him …\n\n“For one branch to remove the head of a co-equal branch unavoidably harms our constitutional structure …\n\n“I cautioned that we remember Alice’s plight when the Queen declared ‘sentence first, verdict afterwards’ …\n\n“The country is not well served when either policy disagreements or personal animosities drive the process …\n\n“I am here today to call for bipartisanship in the impeachment process. It is a concept many will say they agree with. But actions speak louder than words.\n\n“The Framers of the Constitution knew that the greatest danger associated with impeachment was the presence of partisan factions that could dictate the outcome.\n\n“It is clear from the debates and from the commentaries on the Constitutional Convention that the Framers were concerned that anything less than bipartisanship could, and would, do great damage to our form of government. They knew that to contemplate an action as profound as undoing a popular election requires at a minimum that members of both parties find that the alleged wrong is grave enough to overturn the will of the majority of the American people.\n\n“The Framers also understood the sentiment expressed nearly 200 years later by Congresswoman Barbara Jordan during the impeachment proceedings of Richard Nixon. She said, ‘it is reason, and not passion, which must guide our deliberations, guide our debate, and guide our decision’ …\n\n“In the case of an impeachment, fair means bipartisan … Once the election is held, our leaders hold office until the next election. It is simply antithetical to our constitutional democracy to use impeachment to overturn an election on partisan grounds. It violates the independence of the presidency and it usurps the people’s voice …\n\n“Permit one branch of government to subjugate another to its partisan wishes, and you permit the kind of concentration of power that can lead to tyranny. So the system the Framers established is utterly incompatible with the idea that sharp partisan divisions could be sufficient to impeach …\n\n“Impeachment can be legitimate if and only if it emanates from a bipartisan conviction that the president has committed high crimes and misdemeanors – when people of opposing viewpoints can come together in agreement over the seriousness of the offense and the appropriateness of the sanction …\n\n“Look back at the Nixon impeachment. It took on legitimacy when a core of Republicans on the House Judiciary Committee were moved by the nature of President Nixon’s offenses to break party ranks and vote for articles of impeachment … There was bipartisan consensus that what Nixon did was impeachable …\n\n“Bipartisanship should not wait until the matter reaches the Senate chamber …\n\n“The Constitution provides that ‘the Senate shall have sole power to try all impeachments.’ Some consider this provision to impose a duty upon the Senate to try or adjudicate all impeachments. Even if the Constitution imposes such a duty, the Senate has not understood this duty to adjudicate as necessarily requiring a formal trial. There is precedent for the Senate considering dispositive motions that would allow the Senate to render a judgment without holding a trial.”\n\nHouse Judiciary Committee Chairman Jerrold Nadler of New York:\n\n“Benjamin Franklin called impeachment, ‘a substitute for assassination’ …\n\n“The effect of impeachment is to overturn the popular will of the voters as expressed in a national election. We must not overturn an election and remove a president from office except to defend our very system of government or our constitutional liberties against a dire threat. And we must not do so without an overwhelming consensus of the American people and of their representatives in Congress of the absolute necessity …\n\n“There must never be a narrowly voted impeachment or an impeachment substantially supported by one of our major political parties and largely opposed by the other. Such an impeachment would lack legitimacy, would produce divisiveness and bitterness in our politics for years to come. And will call into question the very legitimacy of our political institutions … We have no right to overturn the considered judgment of the American people …\n\n“To impeach the president would subject the country to the trauma of a trial in the Senate. It would paralyze the government for many months while the problems of Social Security, Medicare, and a deteriorating world economy, and all our foreign concerns fester without proper attention …\n\n“The president’s accusers must go beyond hearsay and innuendo and beyond demands that the president prove his innocence of vague and changing charges. They must provide clear and convincing evidence of specific impeachable conduct. …\n\n“Some say that if we do not impeach the president, we treat him as if he is above the law. Is the president above the law? Certainly not. He is subject to the criminal law, to indictment and prosecution when he leaves office like any other citizen, whether or not he is impeached.”\n\nHouse Foreign Affairs Committee Chairman Eliot Engel of New York:\n\n“An impeachment inquiry which will turn into an open-ended fishing expedition … The American people are smarter. They want this politically motivated witch hunt to end … Let’s stop the politics. Let’s really talk about bipartisanship.”\n\nSenate Minority Leader Chuck Schumer of New York (then a member of the House):\n\n“Whether you cite The Federalist Papers or legal scholars like Justice [Joseph] Story, the president’s actions, while wrong and inappropriate and possibly illegal, are clearly not impeachable…\n\n“I’d support a motion of censure or a motion to rebuke, as President Ford suggested yesterday, not because it is politically expedient to do but because the president’s actions cry out for punishment and because censure or rebuke, not impeachment, is the right punishment.\n\n“It is time to move forward … the world economy is in crisis and cries out for American leadership … the American people cry out for us to solve the problems facing America like health care, education and ensuring that seniors have a decent retirement.”\n\nSenate Minority Whip Dick Durbin of Illinois:\n\n“In 1798, Thomas Jefferson wrote to James Madison: ‘History shows that in England, impeachment has been an engine more of passion than justice.’\n\n“Jefferson feared that even our process for impeachment could be a formidable partisan weapon. He feared that a determined faction in Congress would use it ‘… for getting rid of any man whom they consider as dangerous to their views, and I do not know that we could count on one-third in an emergency.’”\n\nSenate Finance Committee ranking Democrat Ron Wyden of Oregon:\n\n“This impeachment is a deadly plant that has flowered in the toxic soil of partisanship. Given the highly contentious nature of the charges against the president, there is no question in my mind that the congressional leadership should have first established a bipartisan process for investigating the serious allegations …\n\n“In my view, the House didn’t even try to locate the common ground … the fact is that by the end of last year, our two major political parties were at war with each other over the allegations against the president.\n\n“This toxic partisanship is not, in my view, what public service is all about….\n\n“The framers of the Constitution tried to give us a heads-up, a warning about how the impeachment process could become unduly partisan. Alexander Hamilton, in Federalist 65, said that the types of crimes for which impeachment is the appropriate remedy are ‘political.’ And he added, ‘the prosecution of them, for this reason, will seldom fail to agitate the passions of the whole community, and to divide it into parties, more or less friendly, or inimical, to the accused’ …\n\n“My colleagues and friends, it doesn’t have to be all partisan all the time. There is an alternative to slash-and-burn government … the public is tired of us being at each other’s throats. They are tired of Beltway politics that places toxic partisanship over the public interest…\n\n“Congress has not once removed a president, not once in 211 years. The Constitution places the burden for such a grave step very high. Such a showing is not only to protect our nation from partisan prosecution, but also to impose safeguards that are necessary, given the severity of the potential punishment – a political death penalty, as House Manager Lindsey Graham said.\n\n“When I say ‘punishment,’ I am not only referring to the punishment imposed on the president, but in particular to the destructive impact of such an action to our nation as a whole …\n\n“If the evidence required to convict a president of the United States in an impeachment trial is allowed to be less than that required in a shoplifting trial, the constitutional foundation for the presidency will disintegrate before our very eyes. That is something that a few future presidents in this body ought to consider for just a moment …\n\n“My friends, let the toxic partisanship end. Let it end here, and let it end now.”\n\nSen. Patty Murray of Washington state:\n\n“If we are to remove a President for the first time in our nation’s history, none of us should have any doubts.\n\n“We must also ask ourselves how it would affect the country to remove this president after such a partisan process. A conversation I had with a constituent not long ago really struck a chord with me. He said to me,\n\n“’I am old enough to remember President Nixon’s resignation. I know how deeply it affected the psyche of an entire generation. I know it made many of us cynical of politics for a long, long time. Please don’t put us all through that turmoil again.’ This country would be punished and hurt by a presidential removal. This country doesn’t deserve to be punished for this president’s behavior …\n\n“In the past year, despite the scandal that ran on the front page nearly every day, our country has prospered. Our economy is growing. Our waters and air are cleaner. Our communities are safer. Our education system is stronger. America is not poised on the brink of disaster.”\n\nHouse Financial Services Committee Chairwoman Maxine Waters of California:\n\n“Democracy is threatened when a fair legal process is sacrificed to appease the passions of a few … The power to impeach a president should not be casually used to remove a president, overturn an election, simply because we don’t like him or his policies.”\n\nRep. Sheila Jackson-Lee of Texas:\n\n“The Framers of the Constitution never intended the availability of impeachment as a license for a fishing expedition.”\n\nRep. John Lewis of Georgia:\n\n“Mr. Speaker, we should be standing here debating the future of Social Security. We should be standing here debating health care. We should be standing here debating education for our children and how we can protect the environment.\n\n“Instead, we are participating in a political charade. Republicans want to do what they could not do in an election – defeat Bill Clinton. Well, I have news for you. The American people are watching. Beware the wrath of the American people, Mr. Speaker, beware.”\n\nHouse Appropriations Committee Chairwoman Nita Lowey of New York:\n\n“I want to appeal to you, my colleagues, as a woman, as a mother, as a grandmother and as a lawmaker. Let us have a formal rebuke of this behavior, but then let us move forward in this House, because I want to make it very clear that we believe it is immoral not to be rebuilding our schools, not to be taking care of our children, not to be focusing on health care, and not to preserve Social Security and Medicare.”\n\n— Written by Thomas McArdle\n\nNote to Readers: Issues & Insights is a new site launched by the seasoned journalists behind the legendary IBD Editorials page. Our mission is to use our decades of experience to provide timely, fact-based reporting and deeply informed analysis on the news of the day.\n\nWe’re doing this on a voluntary basis because we think our approach to commentary is sorely lacking both in today’s mainstream media and on the internet. If you like what you see, feel free to click the Tip Jar over on the right sidebar. And be sure to tell your friends!\n\nShare this...\n\n\n\n\n\nReddit\n\nLinkedin\n\nemail", "description": "Some Democrats who stood by Bill Clinton during his impeachment are still in politics two decades later, and their words are coming back to haunt them.", "authors": [], "top_image": "https://i2.wp.com/issuesinsights.com/wp-content/uploads/2019/10/Congressional-Record-1-e1570058138507.png?fit=411%2C231&ssl=1", "published_at": "2019-10-04"}