{"pub": "nymag", "url": "https://vulture.com/2019/10/snl-recap-season-45-episode-3-chance-the-rapper.html", "downloaded_at": "2019-10-28 00:26:29.401966+00:00", "title": "Saturday Night Live Recap: Second Chance", "language": "en", "text": "Saturday Night Live Chance the Rapper Season 45 Episode 4 Editor’s Rating 3 stars * * * * * « Previous Next Photo: Will Heath/NBC\n\nTwo years ago, when Chance the Rapper appeared as SNL host and musical guest for the first time, he ticked a lot of boxes. He dished out the right measure of affable charm and silliness to keep the show bouncing along. He played well with others, and when he broke, he let the audience know he was in the moment and enjoying himself. As Chance’s new record, The Big Day, is only a few months old, it makes sense that he’d land at 8H now. Though there may not have been as many inspired moments as there were during Chance’s first big show, he exhibited the same joy and playfulness that made his first visit a success, which was buttressed by plenty of unexpected drop-ins, and a bit of unpredictability, too.\n\nAs usual, this week’s sketches are presented here in order from best to worst.\n\nLove at First Sight\n\nWhile drinking away heartache, Jennifer (Cecily Strong) and her girlfriends (Ego Nwodim, Heidi Gardner) notice someone checking Jennifer out. The suave guy (Chance) flirts with Jennifer, and soon they’re in love and literally flying — okay, so it’s maybe more of a “low hover.” They’re also terrible at controlling it, bashing into the bar and smashing seafood towers to the floor. Then they kiss, and the magic dies. This sketch is a highlight not only for the giggling, but also the X-factor of the rigging and the excessive destruction that couldn’t be perfectly choreographed. The lighthearted chaos keeps everyone breaking and sadly, the online version seems to be the dress rehearsal, which doesn’t feature the excessive amount of vamping on the part of Strong and the others while Beck Bennett was being outfitted with the flying rig. It was the sort of live moment that keeps SNL feeling lively.\n\nJudge Barry\n\nOn reality show First Impressions Court, Judge Barry (Chance) takes just seconds before rendering his verdicts; he can identify guilty parties by their appearance only. When a defendant comes in looking a bit like a cartoon pimp, or with only half of their hair in cornrows, Barry knows just who to sentence. After a series of male exotic dancers and mafia drones with ventriloquist dummies, an old lady (Kate McKinnon) triumphs over her former live-in nurse (Jason Momoa). Chance anchors this funny bit with nice timing and a calm, authoritative distance. (Bowen Yang’s exit as a pink-clad, mop-coiffed exotic dancer does break Chance for a hot second.) And a tip of the hat to the costume department for delivering a parade of really distinctive and disparate outfits here.\n\nAlbuquerque Rally Cold Open\n\nDonald Trump (Alec Baldwin) holds yet another rally, welcoming guests while forcing his adoring crowds to echo his talking points. Some of those who drop by to wish Trump well include Lindsey Graham (McKinnon), Mark Zuckerberg (Alex Moffat), Bill Clinton (Darrell Hammond), Turkish President Recep Tayyip Erdogan (Fred Armisen), and a member of ISIS (Pete Davidson) freed by Turkish incursions into Syria. The open again feels like a rehashing of the news that simply piles on as many impressions as it can carry, but it does have some nice moments. McKinnon’s sudden Tennessee Williams monologue wins, and Moffat’s Zuckerberg continues to be keenly observed — even if it doesn’t exactly translate to laughs. Hammond’s drop-in as Clinton, and the chatty, casual conversation that ensues about sexual misdeeds, is incisive.\n\nWeekend Update\n\nColin Jost and Michael Che begin with Trump and the state of the impeachment inquiry, including some tweets Trump sent just an hour prior to airtime. After Rudy Giuliani was caught butt-dialing an NBC reporter, Che wonders what happened to the former New York bigwig: “He went from being the mayor of 9/11 to the 9/11 of mayors.” Mikey Day and Alex Moffat come on as Donald Trump Jr. and Eric Trump, arguing that their ability to profit from their father’s title is somehow different from that of Hunter Biden. The man-child Eric can’t quite understand nepotism (in his world, “nippleteasin’”) and thinks the witch hunt should involve Hermione Granger. At one point, Moffat seems to surprise Day by grabbing his hand out of brotherly affection; it looks spontaneous, but even if it isn’t, the gesture nicely underscores the nature of the actors’ partnership.\n\nThe shorter second half begins with Che’s current take on Kanye. Because Ye will be substituting G-rated lyrics to all his old songs, likes Trump, and wears sweatpants and orthopedic sneakers to events, Che believes he is turning into “an old white lady.” It’s a funny and unlikely bit, though it seems Che has to bail out on the last turn of it when the audience doesn’t seem keen on his analogy about Caitlyn Jenner. In another bit, Jost mentions a poll that found Brett Kavanaugh is now the best-known justice, the way “the best-known sandwich mascot is Jared Fogle.” Without another guest appearance, this section remains pretty snappy and has a few smart gags.\n\nDance Rehearsal\n\nPotential dancers for Earth, Wind & Fire learn moves for an upcoming tour. When the moon drifts into the studio window, choreographer Tony Chalice (Kenan Thompson) must close the drapes and hide his face; he is, in fact, wolfing out. Unfortunately for Chalice, there are several windows in the studio, and each of them has its own sort of uncooperative window dressing. Several dancers do their best to stick it out even as Tony unmistakably becomes a bloodthirsty werewolf. Any sketch that gives Thompson free rein to chew the scenery is going to be worthwhile, and in this 10-to-1 slot, the slaphappy nature of the thing takes over.\n\nChoir Fashion\n\nTwo teachers who create costumes for choir concerts (Aidy Bryant and McKinnon) pitch their wares. Whether the kids are singing Messiah or an “ill-advised” rendition of “Frim-Fram Sauce,” they need to look good. Some of the looks available: “Amish bat mitzvah,” and “Sexual hat.” Three of the school’s male choir members (Chance, Pete Davidson, Chris Redd) awkwardly shuffle off to Buffalo as they tout outfits that make it seem they’re “going to a prom where the theme is virginity.” This is a nice addition to the expanding canon of Bryant and McKinnon hawking some kind of product or service side by side. Even if some of the observations won’t mean much to the less theatrically inclined, the physical bits and improvisational moments are funny on their own terms.\n\nE-Sports Reporter\n\nDuring Chance’s last SNL gig, a sketch featured the confused Knicks correspondent Lazlo Holmes (Chance) forced to feign interest in hockey. This time around, Lazlo muddles through an even stranger situation: Color commentary for a League of Legends tournament at MSG. While two announcers (Day and Mooney) cue Lazlo to talk about kills and characters respawning, he wonders whether the tournament’s participants need to leave the house more. The first edition of the sketch played on demographic facts about the whiteness of hockey; the parallels about race aren’t as clear here, and that may be why the writing (and the performances) don’t hit as hard this time. Still, there are some fun jabs at the popularity of these games and the people who play them.\n\nTasty Toaster Tarts\n\nWhen all the kids come over to their friend’s house for snacks, Jason (Chance) offers them everything in the cupboard: Gummy Tummies, Cheese Balls, and Candy Beans, too. It’s weird, as Jason’s parents are strict, churchgoing folk who never used to let Jason eat this kind of garbage. Though Jason says his parents are on vacation, the kids all notice the funny smell, the red stains by the mop bucket and, finally, the mysteriously duct-taped fridge door. This dark take on cheery kids’ commercials feels perfect for Halloween.\n\nSpooky Song\n\nWhen two horny kids wander into the graveyard at night, their tryst is interrupted by a bunch of ghosts dancing and singing spooky songs about how they died. An old sea captain (Thompson) was eaten by sharks after falling overboard, and a miner (Day) lit up a stick of dynamite thinking it was a cigar. One reluctant specter (Chance) is resistant to tell his tale, which involves putting a pole up his butt and getting struck by lightning for fun. The material isn’t subtle, but Chance keeps the exercise light and silly by really walking the line between a willing participant and an embarrassed perv.\n\nSpace Mistakes\n\nIn the tradition of big space epics such as Apollo 13, The Martian, and Ad Astra, filmmakers offer a new movie about those on-the-job errors that really could mean life or death. One astronaut (Chance) has to do his job, despite the fact that his wife and son are worried about what might happen up there. Another astronaut forgets to buckle his seatbelt, and things only get worse (and gorier) from there. Space epics often forget the dumb little details that the rest of us are dealing with on Earth every day, and it’s fun to watch our finest explorers stumble over their own feet and fail to remember which way screws are tightened. Not sure if it was planned, but the clip was given a bit more resonance by the ad for For All Mankind that played immediately afterward.\n\nChance the Rapper Monologue\n\nAs Chance the Rapper loves his hometown of Chicago, a.k.a. the Second City, it follows that he might also love other things that come in second. In a bouncy little rap, he dismisses Google, McDonald’s, and Harry Potter in favor of Bing, Burger King, and Percy Jackson. Kyle Mooney plays along, pushing not only love of Scrappy Doo and Redbox, but a preference for isthmuses over islands. Once the conceit is laid out, there aren’t a lot of big laugh lines, but Chance delivers with enough charisma to keep it engaging.\n\nWhile this outing doesn’t have as many memorable moments as Chance the Rapper’s first gig as host (and musical guest), there are still some worthy bits. The rigging in “Love at First Sight,” brought a playful unpredictability to the evening, and “Judge Barry” was a fun concept, well executed by players and crew, too. The political material still lacks some bite, as Trump fatigue weighs on all us, not just Alec Baldwin and SNL writers. Though he had relatively few lines, Bowen Yang popped into several sketches and made a splash each time; the first-year SNL performer is quickly shaping up to be one of the MVPs of the season. It was confirmed on-air that Kristen Stewart would be back to host on 11/2, so we’ll return next week!\n\nVULTURE NEWSLETTER Keep up with all the drama of your favorite shows! Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.", "description": "Chance the Rapper makes a solid return to the dual role of Saturday Night Live host and musical guest, assisted by some unexpected drop-ins and a bit of unpredictability. A recap of SNL Season 45 Episode 4, featuring host Chance the Rapper.", "authors": ["Matthew Love"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/27/27-snl-recap.w1200.h630.JPG", "published_at": "2019-10-27"}