{"pub": "reuters", "url": "https://af.reuters.com/article/sportsNews/idAFKBN1WP1UM-OZASP", "downloaded_at": "2019-10-10 15:18:28.085678+00:00", "title": "Kipchoge compares sub-two hour marathon to going to the moon", "language": "en", "text": "VIENNA (Reuters) - Kenya’s world record holder Eliud Kipchoge has compared running a sub two-hour marathon to going to the moon before his unofficial attempt in Vienna on Saturday to become the first athlete to break the barrier.\n\nEliud Kipchoge (white vest), world record holder, Olympic champion poses with his dream team of pacemakers in Vienna, Austria October 9, 2019. Kipchoge prepares for his attempt to become the first man in history to run a sub two hour marathon in the INEOS 1:59 Challenge in Vienna on Saturday 12 October 2019. The INEOS 1:59 Challenge/Bob Martin via REUTERS\n\n“I am running to make history, to show that no human is limited. It’s not about money, it’s about showing a generation of people that there are no limits,” Kipchoge, who will make his second attempt to break the two-hour mark, told reporters.\n\nThe 34-year-old Olympic champion set the world record of 2:01.39 at the Berlin marathon last September, smashing the previous one by 78 seconds, but said Saturday’s race is a completely different challenge.\n\n“Running Berlin and running Vienna are different. Running Berlin is for winning and running a world record, Vienna is like going to the moon,” he added.\n\nA 41-man pacing squad will support Kipchoge, who missed out by 26 seconds in Monza, Italy, in May 2017.\n\nKipchoge said he had chosen Vienna as it was a “sporting city”, the course was fast and because of the Prater park. “It’s a natural environment,” he said.\n\n“I am feeling well. I have run on the course and it is a good course. It is flat and very fast and in the park where we can enjoy the environment. I am ready for Saturday,” he said.\n\nNOT RECOGNISED\n\nThe sport’s governing body, the International Association of Athletics Federations (IAAF), will not recognise the run as an official record because it is not in open competition and it uses in and out pacemakers.\n\nIn Monza, Kipchoge also received drinks from a moving motorbike rather than having to collect them from a table.\n\nBut IAAF president Sebastian Coe told Reuters in an interview last month the milestone would still be important.\n\n“If there’s an exciting attempt for getting under two hours for the marathon I’m not sure that most people are going to be sitting there going, ‘Well, it wasn’t sanctioned as a world record because it wasn’t in open competition,’, said Coe.\n\n“I just don’t think it matters. It’s just a big milestone being met and our sport has space for all sorts of things and I think it will appeal and add value.”\n\nOrganisers of the event, dubbed the INEOS 1.59 challenge, said the exact start time would depend on the weather forecast and would be announced on Friday.\n\n“The current conditions are looking to be optimal for temperature, humidity, wind and precipitation for this Saturday morning,” said Robby Ketchell, who leads the weather analysis.\n\nHe said the temperature was expected to be between five and nine degrees Celsius between 0500 and 0800 local time on Saturday when the run is likely to take place.\n\n“After 0800 the temperature is looking like it will rise slightly, and humidity will drop slightly. For the Challenge we need a 24-hour window of no rain to keep all the surfaces dry and that is currently looking to be the case for Saturday too.”", "description": "Kenya's world record holder Eliud Kipchoge has compared running a sub two-hour marathon to going to the moon before his unofficial attempt in Vienna on Saturday to become the first athlete to break the barrier.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439267904&w=1200&r=LYNXMPEF9918O-OZASP", "published_at": "2019-10-10"}