{"pub": "politico", "url": "https://politico.com/news/2019/10/02/liberal-justice-democrats-judges-015880", "downloaded_at": "2019-10-02 12:47:04.844650+00:00", "published_at": "2019-10-02", "title": "Democrats chastise liberal judicial group for ‘way out of line’ attacks", "language": "en", "text": "“That was way out of line,” Dick Durbin of Illinois, the No. 2 Democrat in the Senate, said. “I called Chris personally and told him that I stood behind his decision.”\n\nDurbin added that some of Demand Justice’s complaints against Democratic senators are “really inaccurate” and noted that he too voted for many of the judges the group flagged.\n\nThe senators’ frustration highlights a broader tension between lawmakers and progressive groups that seek to push Democrats further to the left on issues ranging from income inequality to climate change. It also demonstrates renewed attention on the left to the federal judiciary, an area where many Democrats feel they've lost to Republicans.\n\n“I personally would prefer that they didn’t” go after Coons, said Sen. Mazie Hirono (D-Hawaii,) whom Demand Justice has praised for voting against Trump judges.\n\nBut Brian Fallon, executive director of Demand Justice and an alumnus of Hillary Clinton’s 2016 presidential campaign, isn’t apologizing and said the group is just getting started.\n\n“We plan to invest in Delaware a lot more heavily in the coming months, assuming Chris Coons continues voting for Trump judges,” said Fallon, who was once a spokesman for Senate Minority Leader Chuck Schumer. “If that’s a record he’s proud of and feels like he can defend then he has nothing to worry about from our ads.”\n\nWhen asked about Demand Justice, Coons responded, “I’ve got other stuff to worry about.”\n\nDemand Justice’s message on judges is simple: Democrats should reject all Trump’s judges. Fallon argues that Republicans blocked President Barack Obama’s judicial nominees and that Democrats should take a page from their playbook. Like the conservative Judicial Crisis Network, Demand Justice uses ads to pressure Democratic senators on their voting records.\n\n“We think that the idea of doing horse trading with this administration is not worth it,” Fallon said. ”It is not worth it to let two bad Federalist Society judges through in exchange for getting somebody that is a buddy of one of these Democratic senators.”\n\n\"The idea of doing horse trading with this administration is not worth it.\" - Brian Fallon, executive director of Demand Justice.\n\nBut some senators say Demand Justice’s hard line on judges isn’t productive and insist that their caucus members are not the problem. They also argue that there’s not a lot Democrats can do to block judicial appointments when they’re in the minority.\n\n“When you’re shining a spotlight on the judicial conveyor belt that the Republican donors are running right now that is a very worthy purpose,” Sen. Sheldon Whitehouse (D-R.I.) said. But, he added, “expecting senators to vote against Trump appointees they have recommended to the president stretches at a bit much and is a targeting error.”\n\n“They’re doing half the job,” Sen. Brian Schatz (D-Hawaii.) said. “One part of the job is to exert pressure on Democrats to do more, but you’ve got to do the hard work of organizing the constituency behind it. ... They scratch a political itch but it doesn’t solve the structural problem of us not having enough votes.”\n\nFallon argues that Demand Justice is working at the grassroots level — with activists going to presidential candidate town halls and the New Hampshire State Party Convention. The group, Fallon says, wants Democrats to make the federal judiciary a top issue.\n\nSome Democratic senators recognize the value of fighting against Trump judges. Sen. Richard Blumenthal (D-Conn.), another member of the Senate Judiciary Committee, said “full-throated and vigorous advocacy is a good thing,” while Sen. Sherrod Brown (D-Ohio) said the more attention the group brings to “young right wing judges,” the better for Democrats.\n\nSen. Tim Kaine (D-Va.) said he likes Fallon and that Demand Justice provides senators “very good data” about the quality of the Trump judicial nominees, while Sen. Dianne Feinstein, the top Democrat on the Judiciary Committee, said in a statement she takes “input from all groups seriously” and “will continue to do so.”\n\nDemand Justice has also made a point to highlight the records of 2020 presidential candidates and judges, thanking those who they agree with but harshly judging those they don’t. Demand Justice gave Sens. Amy Klobuchar (D-Minn.) and Michael Bennet (D-Colo.) an “F” for their votes in support of Trump judicial nominees in the previous Congress. Demand Justice even took out ads against Bennet. Asked recently about Demand Justice, Bennet said, “I don’t think about them.”\n\nSens. Mazie Hirono, Kirsten Gillibrand and Kamala Harris have all been praised by Demand Justice for their voting records on Trump-appointed judges. | Alex Wong/Getty Images\n\nThe group also bought digital ads earlier this year praising Sens. Kamala Harris (D-Calif.) and Kirsten Gillibrand (D-N.Y.) for their pledges to oppose all Trump appellate nominees. Demand Justice also tracks the voting records for Democratic senators and has noted that in this current session of Congress, Democrats are voting less frequently for Trump judicial nominees compared with the previous Congress.\n\nIn addition to its campaign for Democrats to vote against Trump nominees, Demand Justice has pushed to expand the Supreme Court and was at the forefront of the fight against Brett Kavanaugh’s nomination to the high court. Since the Kavanaugh vote, Demand Justice has also taken out ads against Republican Sen. Susan Collins of Maine, who is up for re-election in 2020 and was a critical vote for Kavanaugh’s confirmation.\n\n“You have seen the rise on the fringes, on the far left and the far right, of outside third party groups that are increasingly controlling the debate and that are diminishing, ironically, the role of the parties,” Collins said. “I mean look at, I hate to show that I know his name, but look at Brian Fallon from Demand Justice and how he went after Democrats who were thinking of voting for Brett Kavanaugh.”\n\nKaine said the pressure to vote “no” on Kavanaugh right away from liberal judicial groups isn't always effective and that many senators don’t like to feel forced into voting for someone.\n\n“If you’re going to have a strategy to muscle you better understand the people enough to know that it’ll work,” Kaine said. On Collins, he said, “there was an opening possibly — possibly — to get her vote but you’re not going to get it by muscle tactics. You’ll guarantee she’ll vote the other way.”\n\nBut Fallon isn’t fazed by the criticism.\n\n“I hope that they’re thinking about us,” Fallon said. “I hope that they’re thinking about us in the cloakroom. I hope they’re thinking about us in the well of the Senate when they’re voting.”\n\nBurgess Everett contributed to this report.\n\n", "description": "", "authors": ["-", "Brian Fallon", "Executive Director Of Demand Justice."], "top_image": "https://static.politico.com/f1/8f/980826a647e4a6baee7bd15bae49/191001-chris-coons-gty-773.jpg"}