{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/16/judge-hhs-cannot-require-abortion-transgender-care", "downloaded_at": "2019-10-16 21:01:34.989081+00:00", "title": "Judge: HHS cannot require abortion, transgender care", "language": "en", "text": "A federal judge in Texas has ruled that the Department of Health and Human Services cannot require medical facilities to provide abortions and gender transition services under an Obama-era definition of “sex” discrimination.\n\nU.S. District Judge Reed O’Connor on Tuesday issued a permanent injunction against an Obama-era HHS rule that defined “sex” discrimination to include denying persons access to abortions and transgender care.\n\nThe judge in 2016 issued a preliminary injunction against the HHS rule, saying it violated the religious beliefs of private health providers who do not provide those services.\n\n“The Court granted HHS two years to complete its review and amend the Rule at issue,” Judge O’Connor said Tuesday in a 25-page opinion. “Despite HHS’s better efforts, the rule remains on the books.”\n\nThe Trump administration had asked the court for more time to rework the rule, but Judge O’Connor on Tuesday said time was up.\n\nTexas, other states and Christian health provider Franciscan Alliance had filed a lawsuit alleging that HHS had misused terminology in the 1964 Civil Rights Act and violated the Religious Freedom Restoration Act by saying “sex” as a protected class — historically understood as men and women — included LGBTQ persons.\n\nTexas Attorney General Ken Paxton cheered the ruling.\n\n“HHS lacked the legal authority to re-write a number of federal laws that prevent sex discrimination and protect religious freedom, especially when it sought to do so by forcing doctors to perform — and American taxpayers to pay for — controversial medical procedures that are contrary to the religious and moral beliefs of millions across our nation,” Mr. Paxton said in a written statement.\n\nAdvocates for transgender rights condemned the ruling, which they said will permit discriminatory practices.\n\n“Our transgender family has God-given dignity and deserve respect and access to the care they need,” said the Rev. Jennifer Butler, CEO of Faith in Public Life. “This immoral ruling denies transgender people necessary care, putting their lives at risk.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "A federal judge in Texas has ruled that the Department of Health and Human Services cannot require medical facilities to provide abortions and gender transition services under an Obama-era definition of \"sex\" discrimination.", "authors": ["The Washington Times Http", "Christopher Vondracek"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/05/abortion_restrictions_texas_82894_c0-99-3900-2374_s1200x700.jpg?09c38d6aa10be98185e6e6731c4a8808be61d5a8", "published_at": "2019-10-16"}