{"pub": "bbc", "url": "https://bbc.com/news/uk-politics-48826360", "downloaded_at": "2019-09-09 23:20:06.087081+00:00", "title": "Backstop: Why is the Irish border blocking Brexit?", "language": "en", "text": "Media playback is unsupported on your device Media caption Would you notice if you crossed the Irish border?\n\nPrime Minister Boris Johnson insists \"there is a way\" to avoid checks along the Irish border after Brexit.\n\nBut why has the Irish border remained a major sticking point in the Brexit negotiations?\n\nWhat's the problem?\n\nIf Brexit happens, the 310-mile Irish border will represent the only land border between the UK and the EU.\n\nAs well as no longer being in the EU, Northern Ireland is likely to end up with different rules and standards to its neighbour, the Republic of Ireland.\n\nThat's because the UK intends to leave the customs union and single market - arrangements designed to make trade easier between EU countries.\n\nLorries travelling to the EU from Northern Ireland would be required to stop at the border for document checks and some product inspections. This would be to ensure their goods meet EU standards.\n\nFollowing incidents like foot-and-mouth disease and the horse meat scandal, the EU is very strict about these requirements.\n\nIn theory, such checks would mean things like cameras and security posts, creating a so-called \"hard border\".\n\nConcerns have been raised that the return of a hard border could jeopardise the Good Friday Agreement. This helped bring the period of violence in Northern Ireland known as \"The Troubles\" to an end.\n\nImage copyright Getty Images Image caption Boris Johnson says there are \"abundant\" technological solutions\n\nSo why hasn't it been sorted yet?\n\nUK and EU Brexit negotiators came up with a solution - known as the Irish backstop - to avoid border checks.\n\nIf used, the backstop would keep the UK in a very close relationship with the EU until a trade deal permanently avoiding the need for checks is agreed.\n\nHowever, the backstop proved unacceptable to many Conservative MPs, who feared the UK would be trapped in it indefinitely.\n\nTheir opposition eventually led to Theresa May's resignation as prime minister.\n\nBoris Johnson, the new prime minister, said a revised Brexit deal must include \"the abolition of the backstop\".\n\nHe says the current solution would mean \"signing away\" the UK's \"economic independence\".\n\nMedia playback is unsupported on your device Media caption Confused by Brexit jargon? Reality Check unpacks the basics.\n\nCan technology solve the problem?\n\nA \"wealth of solutions\" including technology could replace the the backstop and avoid the need for a hard border, Boris Johnson said during the Tory leadership campaign.\n\nSupporters say custom checks could be done at warehouses before lorries set off. Mobile phone technology or microchips on lorries, would track goods and avoid the need for border posts.\n\nHowever, the EU does not currently share a single border with a non-EU country where checks have been completely eliminated.\n\nThat includes Norway (not in the EU) and Sweden (an EU member) - which share one of the most technologically advanced borders in the world. Their main crossing point processes about 1,300 lorries a day, with each waiting 20 minutes on average.\n\nThe EU has said it will consider other solutions to the Irish border problem, but only once the current Brexit deal has been signed off. It has also expressed doubts about a technological solution.\n\nThe problem with just relying on technology, is that EU law also require some products to be physically checked - chemicals and food are among them.\n\nSo what else could be done?\n\nAlongside technology, Mr Johnson has also talked about a trusted trader scheme. Businesses would be allowed to by-pass checks once they've proven to be trustworthy and have met certain standards.\n\nFor it to work, the UK would need to persuade the EU to recognise it.\n\nBut setting up such a scheme would a take a lot of time and cost a lot of money. The UK would also need to come up with an effective way of enforcing it and prevent smuggling.\n\nNorthern Ireland exported almost £3bn of goods to Republic of Ireland in 2017 Trade in £ millions\n\nCould checks take place away from the border?\n\nAnother solution that has been proposed is to allow agriculture checks to take place in \"mobile units away from the border\".\n\nHowever, existing EU law states that animal checks must take place at designated Border Inspections Posts (BIPs) \"in the immediate vicinity of the point of entry\" - which would include the Irish border.\n\nThe EU says \"geographic constraints\" are the only exception (eg mountains, cliffs, valleys, rivers). In these cases, \"a certain distance from the point of introduction may be tolerated.\"\n\nSo getting the EU to allow checks to take place away from the border, for non-geographic reasons, would require a change in the rules.\n\nImage copyright Getty Images Image caption DUP leader Arlene Foster also believes technology and other solutions can prevent a hard border after Brexit\n\nBack to a Northern Ireland-only backstop?\n\nMr Johnson has also suggested the idea of an all-Ireland food standards zone. In other words, Northern Ireland would keep the same food and animal standards as the Republic of Ireland after Brexit.\n\nHowever, it's unclear how food and animal products would be separated from other trade in order to prevent smuggling. If smuggling was to occur, it could threaten the integrity of the single market.\n\nBut some say the UK could go further and agree a Northern Ireland-only backstop. This would see Northern Ireland remain in the customs union and parts of the single market - eliminating the need for any cross-border checks.\n\nBut the DUP, which supports the Conservatives in government, has previously rejected the idea of a Northern Ireland backstop on the basis it would create checks between Great Britain and Northern Ireland.\n\nWho will build the border posts?\n\nNo-one has started building border posts and the UK and Irish governments say they do not want a hard border.\n\nSo there is a very real question, in the event of a no-deal Brexit, about who would actually install the border posts if the EU insist they're necessary.\n\nBoris Johnson and the border blocking Brexit\n\nRead more from Reality Check\n\nSend us your questions\n\nFollow us on Twitter", "description": "Boris Johnson says he can solve the Irish border Brexit problem", "authors": ["Tom Edgington", "Bbc Reality Check"], "top_image": "https://ichef.bbci.co.uk/images/ic/1024x576/p05pr60s.jpg", "published_at": "2019-09-09"}