{"pub": "cbc", "url": "https://cbc.ca/news/world/shelling-syrian-town-turkish-u-s-ceasefire-1.5325652", "downloaded_at": "2019-10-18 11:39:39.104097+00:00", "title": "Shelling heard around Syrian town after Turkish-U.S. ceasefire deal | CBC News", "language": "en", "text": "Shelling and gunfire resounded around the northeast Syrian town of Ras al-Ayn ​​​​​on Friday, a day after Turkey agreed with the United States to pause its offensive in Syria for five days to let Kurdish forces withdraw.\n\nMachine-gun fire and shelling could be heard from the Turkish town of Ceylanpinar across the border from the town, and smoke rose from one part of the Syrian town.\n\nA spokesperson for the Kurdish-led Syrian Democratic Forces (SDF) said the town remained besieged and is being shelled by Turkey and its allied forces.\n\nMervan Qamishlo said Friday his group's militia members would not withdraw in accordance with the ceasefire deal reached overnight because Ras al-Ayn remains besieged. He said Turkey and allied fighters continue to target the town.\n\nWhen asked about plans to pull fighters back to vacate border areas, Qamishlo ​​​​​​said: \"So far there is nothing.\" He added that \"it seems under this deal [Turkey] want to commit more massacres.\"\n\nMustafa Bali, head of the SDF press office, tweeted Friday that Turkey is violating the ceasefire agreement by continuing to attack the town since last night.\n\nDespite the agreement to halt the fighting, air and artillery attacks continue to target the positions of fighters, civilian settlements and the hospital in Serêkaniyê/Ras al-Ayn. Turkey is violating the ceasefire agreement by continuing to attack the town since last night. —@mustefabali\n\nMeanwhile, the Kurdish Red Crescent, a humanitarian aid organisation associated with the International Red Cross, said its vehicles can't reach Ras al-Ayn to evacuate the wounded.\n\n5-day truce brokered a day earlier\n\nUS Vice President Mike Pence and Turkish President Recep Tayyip Erdogan before their meeting in Ankara, Turkey on Thursday. The two leaders brokered the peace deal to allow Syrian-Kurdish forces to withdrawal from a proposed 30 kilometre 'safe-zone' near the Turkish border. (Turkish Presidential Press Office/EFE/EPA)\n\nThe truce announced Thursday by U.S. Vice-President Mike Pence after talks in Ankara, the Turkish capital, with President Tayyip Erdogan. Turkey agreed to the five-day pause to let the Kurdish-led SDF militia withdraw from a \"safe zone\" Ankara had sought to capture.\n\nThe deal was praised by U.S. President Donald Trump, who said it would save \"millions of lives,\" while Turkey cast it as a complete victory.\n\nIf implemented, the deal would achieve all the main objectives Turkey announced when it launched its assault on Oct. 9: control of a strip of Syria more than 30 kilometres deep, with the SDF — once U.S. allies in the years long fight against Islamic State (ISIS) — obliged to pull out.\n\nRepublican and Democratic senators accused Trump of having betrayed the Kurdish allies who were vital in fighting Islamic State militants, of brushing aside the humanitarian costs of Turkey's invasion and of being outwitted by Ankara.\n\nIt was unclear what if any damage came from the shelling heard on Friday.\n\nIt was also unclear whether the SDF would fully comply with the agreement, which would leave Turkish forces in charge of a swath of territory that the Kurds once held with U.S. military support.", "description": "Shelling and gunfire resounded around the northeast Syrian town of Ras al Ain on Friday, a day after Turkey agreed with the United States to pause its offensive in Syria for five days to let Kurdish forces withdraw.", "authors": ["Thomson Reuters"], "top_image": "https://i.cbc.ca/1.5325653.1571386031!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1176485867.jpg", "published_at": "2019-10-18"}