{"pub": "investing.com", "url": "https://ph.investing.com/news/commodities-news/gold-sinks-as-markets-await-fed-palladium-moves-beyond-1800-74876", "downloaded_at": "2019-10-30 04:17:27.275769+00:00", "title": "Gold Sinks as Markets Await Fed; Palladium Moves Beyond $1,800", "language": "en", "text": "© Reuters.\n\nInvesting.com – The much-awaited Fed rate decision is fewer than 24 hours away, but it’s palladium that soared for the day, not gold.\n\nPalladium, the auto-catalyst metal in chronically short supply, hit record highs above $1,800 an ounce for the first time ever, before profit-taking took it into negative territory. Gold, the top hedge in the event of a rate cut, meanwhile, sunk deeper beneath its key bullish mark of $1,500.\n\n“Palladium has been an unstoppable force in precious metals this year and rightly so because of the increasing regulations on auto emissions and the dire short supply of the metal, which is the solution for that,” said Philip Streible, commodities strategist at RJO Futures in Chicago.\n\n“In gold’s case, other than the 25-basis-point rate cut we’re expecting tomorrow, there’s very little to look forward to unless the Fed turns incredibly dovish in its outlook language,” Streible said. “For now, there’s very little hope for a December cut, too, because many think the Fed is done here.”\n\nThe , reflective of physical trades, hit a record high of $1,804.40 before consolidating at below $1,785 in New York’s late-afternoon trade.\n\nThe most-active contract on New York Mercantile Exchange’s Comex settled down $24.20, or 1.3%, at $1,755.10 per ounce after hitting an all-time high at $1,779.30.\n\nfor December delivery settled down $5.10, or 0.3%, at $1,490.70. In post-settlement trade it was down $3.75, or 0.3%, at $1,492.05 by 3:10 PM ET (19:10 GMT).\n\n, which tracks live trades in bullion, was down $2.62, or 0.2%, at $1,489.89.\n\nA CNBC Fed survey said that 63% believe the U.S. central bank will pause for the rest of the year after its October easing. On average, the respondents, who include fund managers, economists and strategists, think the next cut will come in February. Even so, 40% believe the Fed might stay even through 2020.\n\nShould gold drop lower post-Fed, it may have to sink as low as $1,450 to really attract strong buying, TD Securities said in a note.\n\n“We expect the Fed to communicate patience, (so) prices near recent lows would not be surprising in the short term, until weakness in the data and resumed rate cuts into 2020 support a further gold rally,” it said. “Given the recent stalling of the gold rally, the strength of positive momentum signals have been waning.”", "description": "Gold Sinks as Markets Await Fed; Palladium Moves Beyond $1,800", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEA680GO_L.jpg", "published_at": "2019-10-29"}