{"pub": "investing.com", "url": "https://za.investing.com/news/commodities-news/preciousgold-treads-water-as-focus-shifts-to-sinous-talks-fed-minutes-1964122", "downloaded_at": "2019-10-07 20:15:28.591386+00:00", "title": "PRECIOUS-Gold dips 1% as trade hopes lifts dollar, stocks", "language": "en", "text": "© Reuters. PRECIOUS-Gold dips 1% as trade hopes lifts dollar, stocks\n\n* U.S. Fed minutes due on Wednesday\n\n* Trade talks scheduled in Washington on Oct. 10-11\n\n* Specs slash bullish bets on COMEX gold -CFTC (Recasts, adds comment, updates prices)\n\nBy Asha Sistla and Brijesh Patel\n\nOct 7 (Reuters) - Gold slipped nearly 1% on Monday as equities rose and the dollar firmed after positive comments from both Beijing and Washington fueled optimism over a bilateral trade deal ahead of this week's high-level talks.\n\nwas down 0.9% at $1,491.50 per ounce as of 2:44 p.m. EDT (1844 GMT). U.S. GCcv1 settled 0.6% lower at $1,504.4 an ounce.\n\n\"The fact that gold fell sharply on what was a dubious 'positive' trade headline and was unable to recover suggests the market remains long and frustrated from last week after the payrolls release failed to signal imminent danger,\" said Tai Wong, head of base and precious metals derivatives trading at BMO.\n\nChinese Commerce Ministry said China was ready for a deal with the United States on parts of negotiations both sides agree upon, according to a FOX reporter tweet. White House economic adviser Larry Kudlow said there could be progress during the talks in Washington and that delisting Chinese companies traded on U.S. exchanges 'is not on the table.' signals from both sides calmed nerves over the outcome of this week's trade talks and lifted U.S. stocks. MKTS/GLOB\n\nFurther weighing on gold's appeal, the dollar rose 0.2% against a basket of major currencies. USD/\n\nAlso on investors' radar was the Federal Reserve Open Market Committee's minutes from its September meeting on Wednesday.\n\nA string of weak U.S. economic data, including sluggish manufacturing activity and a sharp slowdown in services industry growth, heightened recession fears, although Friday's decent jobs report halted bullion's upside. week was getting fairly bullish for gold with the ISM and non-manufacturing numbers, but the jobs number was not terrible and that sort of dampened the bullishness in gold,\" said Ryan McKay, a commodity strategist at TD Securities.\n\nSpeculators slashed their bullish positions in COMEX gold and trimmed bullish bets on silver contracts in the week to Oct. 1, the U.S. Commodity Futures Trading Commission (CFTC) said on Friday. CFTC/\n\n\"Gold continues to get appraised against the U.S. bond yields and what the Fed is going to do next,\" said AxiTrader market strategist Stephen Innes in a note.\n\n\"So, while price action seems supportive enough to suggest a long bias remains intact, ... market participants likely need further evidence from the Fed Board that they are shifting to an easing bias to push prices significantly higher.\"\n\nLower interest rates tend to increase investor interest in non-yielding bullion.\n\nElsewhere, silver dipped 0.8% to $17.42 an ounce.\n\nPlatinum rose 0.2% to $877.81 and palladium edged 0.1% higher to $1,666.87.\n\nhttps://tmsnrt.rs/2IvOB8i\n\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^>", "description": "PRECIOUS-Gold dips 1% as trade hopes lifts dollar, stocks", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB7C067_L.jpg", "published_at": "2019-10-07"}