{"pub": "cbc", "url": "https://cbc.ca/news/world/ny-trump-tax-returns-1.5311596", "downloaded_at": "2019-10-07 20:03:03.010976+00:00", "title": "Access Denied", "language": "en", "text": "A federal judge rejected President Donald Trump's challenge to the release of eight years of his tax returns for a New York state criminal probe, saying on Monday that he could not grant such a \"categorical and limitless assertion of presidential immunity.\"\n\nTrump's lawyers immediately appealed to the 2nd U.S. Circuit Court of Appeals, and it granted a temporary stay of the judge's ruling \"pending expedited review\" by the court.\n\nJudge Victor Marrero called Trump's claim of a broad immunity \"extraordinary.\"\n\n\"As the court reads it, presidential immunity would stretch to cover every phase of criminal proceedings, including investigations, grand jury proceedings and subpoenas, indictment, prosecution, arrest, trial, conviction, and incarceration,\" Marrero wrote. \"That constitutional protection presumably would encompass any conduct, at any time, in any forum, whether federal or state, and whether the president acted alone or in concert with other individuals.\"\n\nThe judge said he \"cannot endorse such a categorical and limitless assertion of presidential immunity from judicial process as being countenanced by the nation's constitutional plan, especially in the light of the fundamental concerns over excessive arrogation of power that animated the Constitution's delicate structure and its calibrated balance of authority among the three branches of the national government, as well as between the federal and state authorities.\"\n\nThe returns had been sought by Manhattan District Attorney Cyrus R. Vance Jr. His office is investigating the Trump Organization's involvement in buying the silence of two women who claimed to have had affairs with the president.\n\nTrump's lawyers have said the investigation is politically motivated and that the quest for his tax records should be stopped because he is immune from any criminal probe as long as he is president.\n\nTrump in a tweet Monday blamed what he called \"radical left Democrats\" for \"pushing local New York City and State Democrat prosecutors to go get President Trump.\"\n\nAccounting firm has said it will comply with rulings\n\nVance subpoenaed personal and corporate tax returns from 2011 to 2018 and other records from Trump's longtime accounting firm Mazars USA as part of a criminal probe into the president and his family business.\n\nLast week, Justice Department lawyers in Washington urged Marrero to delay deciding the issue.\n\nVance began his probe after federal prosecutors in Manhattan completed their investigation into payments that Trump's former personal lawyer, Michael Cohen, arranged to be paid to porn actress Stormy Daniels and model Karen McDougal to keep them silent during the presidential race. The Trump Organization later reimbursed Cohen.\n\nCohen is serving a three-year prison sentence.\n\nTrump was never charged, though prosecutors said publicly that he was aware of and directed the illegal payments. Justice Department policy has long been that sitting presidents cannot be charged criminally.\n\nGrand jury proceedings and records in New York are secret. If Vance gains access to Trump's returns through a grand jury investigation, that doesn't mean that their contents will be disclosed publicly.\n\nIt is unclear what Trump's returns might have to do with the criminal investigation.\n\nMazars has in the past said it would comply with its legal obligations, and as a matter of policy did not comment on its work for clients.\n\nTrump has steadfastly refused to make his tax returns public, breaking from a custom the majority of presidential candidates have followed since the 1970s.\n\nThe president is separately trying to block Deutsche Bank AG from handing over financial records, which the bank has said include tax returns, sought by committees of the U.S. House of Representatives.\n\nOral arguments in that case were heard by the federal appeals court in Manhattan on Aug. 23. It has yet to rule.", "description": "A federal judge rejected President Donald Trump's challenge to the release of eight years of his tax returns for a New York state criminal probe, saying on Monday that he could not grant such a \"categorical and limitless assertion of presidential immunity.\"", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5311633.1570458720!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/usa-trump.jpg", "published_at": "2019-10-07"}