{"pub": "investing.com", "url": "https://investing.com/news/stock-market-news/alitalia-gets-qualified-thumbsup-from-atlantia-state-railways-1996801", "downloaded_at": "2019-10-15 23:15:23.270306+00:00", "title": "Alitalia gets qualified thumbs-up from Atlantia, state railways", "language": "en", "text": "By Francesca Landini\n\nMILAN (Reuters) - Italian loss-making airline Alitalia won a commitment from toll-road operator Atlantia (MI: ) and state railways Ferrovie dello Stato (FS) on Tuesday to come to its rescue provided a number of conditions were met.\n\nThe green light will avert the threat of liquidation hanging over the ailing carrier as an Oct. 15 deadline set by the industry ministry for a deal expires.\n\nTwo sources close to the matter said the Industry Ministry was expected to extend the deadline to give the sides time to iron out certain issues. It was not possible to obtain an immediate comment from the ministry.\n\nSeveral hurdles still must be overcome before the third turnaround attempt in Alitalia's history can be launched.\n\nThe state-driven plan involves setting up a new company to hold the good assets of Alitalia and receive a cash injection expected to be around 1 billion euros ($1.1 billion) from the rescuers.\n\nIn two separate statements on Tuesday Atlantia, controlled by the Benetton family, and FS said they would proceed with binding offers for the airline as long as a leading carrier was also willing to invest in the flagship carrier.\n\nAtlantia and FS have been in talks since July with Delta Air Lines (N: ) but on Tuesday mentioned neither the U.S. carrier nor German carrier Lufthansa (DE: ) which has recently said it could be interested.\n\nThe two Italian investors said they were each ready to take a minority stake in the new Alitalia but added more work was needed to find a deal on a business plan and a governance structure.\n\nAn investment by Atlantia in the airline could help mend fences with Rome following threats by the ruling coalition 5-Star Movement to revoke the group's motorway concessions after a bridge collapse last year that killed 43 people.\n\nAtlantia runs half of Italy’s 6,000 kilometers of toll roads through its ASPI unit which generates one-third of core profit.\n\nIn their statements on Tuesday, Atlantia and FS asked for European Union clearance for financing provided to Alitalia by the state since 2017, which amounts to 900 million euros ($992.8 million) so far.\n\nSources have said the airline might need more cash to survive until the rescue plan kicks in.\n\nThe two companies also asked for further help from the government for possible job cuts relating to the turnaround of Alitalia.\n\nAlitalia has been run by special administrators since May 2017 after going through two previous unsuccessful rescue attempts in 2009 and 2014.", "description": "Alitalia gets qualified thumbs-up from Atlantia, state railways", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF9E21F_L.jpg", "published_at": "2019-10-15"}