{"pub": "wsj", "url": "https://barrons.com/articles/divorce-is-costly-divorce-in-retirement-is-costly-and-complicated-51569758402?mod=rsswn", "downloaded_at": "2019-09-29 23:31:21.215697+00:00", "title": "Divorce Is Costly. Divorce in Retirement Is Costly and Complicated.", "language": "en", "text": "Text size\n\nMy wife and I have made some big financial decisions over our 38-year marriage, but the most consequential was staying together.\n\nFew things savage your personal finances more than divorce. The closer you are to retirement, the worse the damage.\n\n“You’ve got a couple that planned their whole retirement to look one way,” says Nancy Hetrick of Phoenix, a divorce financial analyst, “and now the same money that was going to do one retirement has to do two of them.”\n\nThe divorce rate for Americans over 50 began climbing in the early 1990s and has remained above historical norms while the rates for other age groups has declined.\n\nAbout 1% of married Americans over age 50 get divorced each year, says Susan Brown, a sociology professor at Bowling Green State University who has published research on divorce. “The picture is pretty grim,” Dr. Brown says.\n\n“ Especially in a gray divorce, you have only one shot to get it right. ” —Diane Pappas, divorce financial analyst in the Boston area\n\n“Especially in a gray divorce, you have only one shot to get it right,” says Diane Pappas, a divorce financial analyst in the Boston area. “The husband and wife have to understand their expenses. The only way to live within their means is to understand what they’re spending and how much income they will have.”What’s more, women are disproportionately affected financially by divorces: The average woman sees her standard of living decline by 45% after a split; the average man sees it go down 21%.\n\nWhy do women fare so much worse? Carol Lee Roberts, president of the Institute for Divorce Financial Analysts, which trains people in divorce financial planning, has seen many splits where the man takes the retirement account and the woman gets the house. The result is the man receives assets to help fund his retirement and the woman is saddled with the maintenance costs and property taxes of a house.\n\n“Often keeping a house, or any large asset that isn’t giving you an income stream, isn’t the best idea,” Roberts says.\n\nWomen who stay home to raise children also often pay a Social Security penalty in retirement. If they didn’t work enough to qualify for benefits on their own, they receive half the Social Security benefits of their husband if married 10 years or more.\n\nAnother big area of impact when couples split: Many people receive employer-sponsored health coverage through their spouse’s employer, and they often lose it in divorce.\n\n“The No. 1 issue that keeps people up at night is health insurance,” says Jennifer Failla, an Austin, Texas, divorce financial analyst. People losing employer-sponsored insurance can get coverage for up to three years through a federal program called Cobra, but it is expensive.\n\nFailla helps clients find private health coverage to save money but says they typically end up paying $500 to $800 a month for worse coverage than they had previously with the employee-sponsored plan.\n\nEven upscale couples feel the pinch in a split-up. Justin Reckers, a divorce financial analyst in San Diego, handled a case where the main source of income, the husband, earned more than $500,000 a year. The 54-year-old wife had quit working seven years earlier to raise their children. She received roughly $3 million in assets as part of the divorce settlement, enough to give her $7,000 a month for life after taxes, but that pales in comparison to the $15,000 or more a month the couple was spending before the divorce.\n\nHetrick, the Phoenix divorce financial analyst, encounters a lot of couples where the romance died a long time ago but they are staying together because they think they can’t afford separate houses. “They don’t hate each other,” she says. “They’re just kind of roommates and have been for a long time.”\n\nWhen a couple comes in preparing for divorce, planners generally make two lists. One has all their income; the other all their expenses. “Especially in a gray divorce, you have only one shot to get it right,” says Diane Pappas, a divorce financial analyst in the Boston area. “The husband and wife have to understand their expenses. The only way to live within their means is to understand what they’re spending and how much income they will have.”\n\nPappas sometimes counsels people who are still on the fence about divorce. She recently talked to a couple in their late 60s who had amassed $3 million in assets, but the husband felt he didn’t have enough to retire. That reluctance to retire was causing friction with his wife, who wanted to “start enjoying life.”\n\nShe told the husband he could afford to retire. So he did, and the couple is still together.\n\nQuestions? Comments? Write to us at retirement@barrons.com", "description": "Few things savage your personal finances more than divorce. The closer you are to retirement, the worse the damage. That’s why it pays to be mindful of common problems.", "authors": ["Neal Templin", "Diane Pappas", "Divorce Financial Analyst In The Boston Area"], "top_image": "https://images.barrons.com/im-110400/social", "published_at": "2019-09-29"}