{"pub": "reuters", "url": "https://uk.reuters.com/article/us-usa-stocks/futures-edge-higher-on-hopes-of-monetary-stimulus-idUKKCN1VU17Y", "downloaded_at": "2019-09-09 11:47:13.221806+00:00", "title": "Futures edge higher on hopes of monetary stimulus", "language": "en", "text": "FILE PHOTO: Traders work on the floor at the New York Stock Exchange (NYSE) in New York, U.S., September 5, 2019. REUTERS/Brendan McDermid\n\n(Reuters) - U.S. stock index futures ticked higher on Monday, as mixed global economic data drove expectations of monetary stimulus from central banks, including the U.S. Federal Reserve.\n\nStocks were set to extend gains from last week, which ended with Fed Chairman Jerome Powell saying the Fed would “act as appropriate” to sustain economic expansion, a phrase that financial markets have read as signs of an interest rate cut ahead.\n\nBets of a potential rate cut by the Fed gained ground after data showed the U.S. economy added fewer-than-expected jobs in August.\n\nTraders see a 91.2% chance of a quarter percentage point cut in Fed’s September policy meeting, up from 90% on Friday, according to CME’s FedWatch.\n\nThe European Central Bank is also expected to cut rates later this week.\n\nThe benchmark S&P 500 .SPX gained 1.8% last week as a slew of positive global economic news, including China's decision to slash bank reserve requirements, more than offset mixed set of domestic economic data.\n\nIn company news, shares of Boeing Co (BA.N) fell 1% after it suspended load testing of its new widebody 777X aircraft over the weekend as media reports said a cargo door failed in a ground stress test.\n\nAt 7:03 a.m. ET, Dow e-minis 1YMcv1 were up 54 points, or 0.2%. S&P 500 e-minis EScv1 were up 7.25 points, or 0.24% and Nasdaq 100 e-minis NQcv1 were up 16.75 points, or 0.21%.\n\nAmong other stocks, drugmaker Amgen Inc (AMGN.O) fell 4.2% and was the biggest loser among S&P 500 stocks in premarket trading.", "description": "U.S. stock index futures ticked higher on Monday, as mixed global economic data drove expectations of monetary stimulus from central banks, including the U.S. Federal Reserve.", "authors": ["Uday Sampath Kumar", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190909&t=2&i=1427927770&w=1200&r=LYNXNPEF8812U", "published_at": "2019-09-09"}