{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7548575/Priyanka-Chopra-shows-curves-figure-hugging-turquoise-ensemble-steps-dog-NYC.html", "downloaded_at": "2019-10-08 02:17:37.506911+00:00", "title": "Priyanka Chopra shows curves in figure-hugging turquoise ensemble as she steps out with dog in NYC", "language": "en", "text": "She's been traveling in India to promote her Hindi-language film The Sky Is Pink.\n\nBut on Monday, Priyanka Chopra was back in the States where she was seen out and about in New York City.\n\nThe actress, 37, headed out in a skintight turquoise ensemble and carrying a small dog wearing a turquoise collar.\n\nHome: She's been traveling in India to promote her Hindi-language film The Sky Is Pink. But on Monday, Priyanka Chopra was back in the States where she was seen in New York City\n\nPriyanka paired a figure-hugging turtleneck with a mini skirt that showcased her curves.\n\nShe went bare-legged in pointed-toe brown heels.\n\nHer hair was loose around her shoulders and styled with a center parting and she was made-up with mascara, purple eye-shadow and matte red lip color.\n\nCanine companion: The actress, 37, headed out in a skintight turquoise ensemble and carrying a small dog wearing a turquoise collar\n\nStepping out: Priyanka paired a figure-hugging turtleneck with a mini skirt that showcased her curves and she went bare-legged in pointed-toe brown heels\n\nShe was later seen without the dog on her evening out in Manhattan.\n\nThe Sky Is Pink marks Priyanka's return to Bollywood after a three-year hiatus during which she grew her US profile with the TV series Quantico and married musician Nick Jonas.\n\nAlthough it is in Hindi, the movie has got a North America release on October 11.\n\nShe stars with Indian actor Farhan Akhtar in the story of a couple's relationship as narrated by their dead daughter.\n\nDitched the dog: The former Quantico star was later seen without the dog on her evening out in Manhattan\n\nNight out: Her hair was loose around her shoulders and styled with a center parting and she was made-up with mascara, purple eye-shadow and matte red lip color\n\nNew movie: She's been traveling in India to promote her Hindi-language film The Sky Is Pink which will also get a US release in theatres this Friday\n\nSpeaking about the movie, Priyanka recently told the Times of India that it requires the audience to invest both their 'brain and heart'.\n\n'This is a very special film based on a special real-life couple who thrive through extraordinary circumstances,' she said.\n\n'I feel like in a cynical world today where we live our own lives, this film shows you what it can do when you have a family, family support.'\n\nThe actress married Jonas Brother Nick, 27, in December 2018 in a lavish extravaganza of a ceremony in Jodhpur, India.\n\nDuring her most recent trip to her homeland, she took some time out to offer prayers to the Hindu goddess Durga while in Mumbai.\n\nPriyabka posed for photos in traditional dress at the shrine to the goddess of war erected for the 72nd North Bombay Sarbojanin Durga Puja Samiti festival in Mumbai.\n\nDevotions: During her most recent trip to her homeland, Priyanka, who is married to Nick Jonas, took some time out to offer prayers to the Hindu goddess Durga while in Mumbai", "description": "Her hair was loose around her shoulders and styled with a center parting and she was made-up with mascara, purple eye-shadow and matte red lip color.", "authors": ["Rachel Mcgrath For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/02/19421548-0-image-a-60_1570497979253.jpg", "published_at": "2019-10-08"}