{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/oct/01/sajid-javid-brexit-the-people", "downloaded_at": "2019-10-01 15:18:01.800866+00:00", "title": "Sajid Javid says everyone wants to get Brexit done. That’s patently not true | Zoe Williams", "language": "en", "text": "You develop a certain immunity to the news these days. You can’t succumb to despair every time the prime minister lies or the leader of the House of Commons makes a debasing remark about parliament, there simply isn’t time. I find it quite surprising, now, to feel depressed by the Today programme.\n\nAnd yet on Monday the Saj did reawaken that political nerve, on a tour of the broadcast studios to preview his unmemorable conference speech. “Everyone on the doorstep,” the chancellor proclaimed, “is saying, ‘get Brexit done’. They don’t say, ‘cancel the result’. They don’t say, ‘have a second referendum’. They say, ‘get Brexit done’.” As a matter of observable fact, this can’t be right: what about the 6 million who signed the petition to revoke article 50? Or the 16 million-plus who voted remain? Or the young voters who came of age after 2016? And on and on. Sajid Javid would have been safer sticking to the formula deployed by the Conservative party chairman, James Cleverly. He told an audience in Manchester this week that he had been “knocking on very traditional Victorian terraced houses” in Darlington, where he met a guy who said: “You’re that Tory. I’m going to vote for you lot.” It might not get past a creative writing tutor, but at least it’s not immediately falsifiable.\n\nOf course, the chancellor didn’t literally mean “everyone on the doorstep”. He was using a new parlance, in which “everyone” doesn’t mean “all the citizens” but “all the authentic citizens”. How can you tell which citizens are the authentic ones? They’re the ones who agree with the proposition that we must Get Brexit Done.\n\nAt root, this is an old political trick – nicely described by the cultural theorist Stuart Hall in 2012: “Politicians always think they know what people feel. It’s a fallacy, because there is no such thing as ‘the people’. It is a discursive device for summoning the people that you want. You’re constructing the people, you’re not reflecting the people.”\n\nOur current politics deploys that technique on ketamine: slower, dumber, more intense. It is now considered reasonable to stand up and say: “I’ve met all the real people, and they all agree with me.” The habit has spread from politicians to commentators, so it’s not unusual to see 20-something rightwing thinktankers on TV current affairs programmes confidently telling everyone what “the people” want – to which one is tempted to reply, “mate, which people? Who have you even met, ever, in your whole life?” Which of course misses the point. It’s a construction, not a reflection.\n\nPlay Video 0:38 'We are leaving the EU': Sajid Javid says it's full steam ahead on Brexit – video\n\nBut where once, as Hall notes, it constructed a shared view of “common sense”, now its purpose is the obliteration of reasonable difference or dissent. If you don’t adhere to the view that “the people” are said to hold – no matter how extreme – you’re not merely wrong. You are simply not real.\n\nThe invocation of this all-powerful imaginary “people” has put predictable pressure on those opinion canvassers of the media who think of themselves as neutral – the BBC and other broadcasters, with their ever-more controversial vox pops. There are, it transpires, some surprisingly radical views in the nation at large: among the eyebrow-raisers have been the man who told the BBC in January that it will be character building for us to run short of food, and the guy who signalled his willingness to pay even with his own life for a no-deal Brexit, should it cause him to run short of the medication he needs.\n\nSetting aside the questionable significance of these individual views, there are endless methodological questions around the sampling of “random” vox pops. The notion – presented with a straight face by a BBC news presenter in Stoke last week – that a few people you corral at midday in a shopping centre represent “a cross-section of voters” is obviously absurd.\n\nFundamentally, though, the spectre of what any given group ought to think haunts the reporters. When they’re in a “leave area” and someone gives the “wrong” answer – suggesting, for instance, that Boris Johnson should resign – they are no longer representative of the area, and the reporter has to set off in search of another person who can say the right thing for “balance”.\n\nIs the rise of the unscientific vox pop a fresh take on news or just plain laziness? | Catherine Bennett Read more\n\nThere is no such thing as a neutral survey in the world of the vox pop: the TV camera brings an invitation to strike a pose, but it also reflects the expectation of the person behind the camera from the exchange and the thousand subtle ways in which they convey it. I was always struck, when I went on reporting trips to a town at the same time as other journalists, how we would all come back with a different man-on-the-street. One would always meet the people who felt displaced by immigrants; another would unfailingly meet the one who hated Jeremy Corbyn; and I would come back with a weird story about someone’s daughter-in-law who was obsessed with colouring-in books, and it would turn out she had an anxiety disorder, and then it would transpire that she was on a zero-hours contract.\n\nThe point is not that they were biased and I was neutral and this paper is better than all the others: it’s interesting precisely because we unintentionally and in good faith dig for the stories we’re interested in. It is, in the end, not an encounter between a scientist and a specimen – but two people trying to connect. What is produced is always idiosyncratic, and only revealing insofar as you’re prepared to consider what it reveals about both sides of the encounter.\n\nThis isn’t to say that interviewing people is corrupted simply because the interviewers are human too. What’s problematic is the politically expedient contention that there are opinions that are held by all members of a demographic group – from northerners, women, millennials, pensioners, all the way up to “the people”. When we recognise that as a fallacy, we might finally be able to hear one another.\n\n• Zoe Williams is a Guardian columnist", "description": "When politicians say they speak for ‘the people’ they’re using an old political trick, says Guardian columnist Zoe Williams", "authors": ["Zoe Williams"], "top_image": "https://i.guim.co.uk/img/media/1453317e9c6bb2fa0d1dd7046bf6e954c9e97ab5/0_303_5026_3015/master/5026.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=bd8c2ce3ea49545cf1cbe992307a6f1f", "published_at": "2019-10-01"}