{"pub": "washingtonpost", "url": "https://washingtonpost.com/weather/2019/10/04/pm-update-legitimately-cool-tonight-saturday-then-milder-with-showers-possible-sunday", "downloaded_at": "2019-10-04 23:51:02.812751+00:00", "title": "PM Update: Legitimately cool tonight and Saturday, then milder with a shower possible Sunday", "language": "en", "text": "\n\nPurple sky over Rosslyn at sunset. (Edward Wood/Flickr)\n\nIt was an all-around pleasant day with lots of sun and plummeting levels of humidity. Temperatures reaching the upper 70s to around 80 still ended up on the warm side, given averages now falling into the low 70s, but the breeze made up for it. If you’re looking for even more fall-like conditions, tonight and tomorrow are for you.\n\nListen to our daily D.C. forecasts: Apple Podcasts | Amazon Echo | More options\n\nThrough tonight: It’s a mostly clear and beautiful evening. We stay clear overnight, as well, although you may feel chilly with time. Most spots are in the 40s for lows. Some elevated locations well north and west may even touch the upper 30s. In the city, we might make only 50 or so. Winds die off considerably after sunset, blowing lightly from the north thereafter.\n\nView the current weather at The Washington Post.\n\nTomorrow (Saturday): Sunshine dominates our somewhat-crisp morning. As the sun rises, temperatures don’t soar too fast, but you’ll still feel the warmth of those rays. Highs head mainly for the mid-60s, although a few spots may edge upward into the upper 60s or near 70. Some clouds should tend to filter into the area by late afternoon or evening. A couple of showers are possible overnight with lows in the 50s.\n\nSunday: We’ve got a lot of clouds around Sunday as a cold front approaches from the west. I don’t think we’ll see many raindrops, but a few showers are possible, especially early in the day and late. There should be at least a few peeks of sun, as well. Highs are in the 70s.\n\nSee Camden Walker’s forecast through the beginning of next week. And if you haven’t already, join us on Facebook and follow us on Twitter and Instagram. For related traffic news, check out Gridlock.\n\nPollen update: Weed pollen and mold spores are low/moderate. Tree and grass pollen is low.\n\nWant our 5 a.m. forecast delivered to your email inbox? Subscribe here.", "description": "Temperatures are in the 40s most spots tonight and the 60s tomorrow.", "authors": ["Ian Livingston", "October At Pm", "Ian Livingston Is A Forecaster Photographer", "Information Lead For The Capital Weather Gang. Day", "Ian Is A Defense", "National Security Researcher At A D.C. Think Tank."], "top_image": "https://www.washingtonpost.com/resizer/_hUR6lRCCDo1nEZUyHOcALzUj-s=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WOZVC2IRF5HMNCORBKXSBF6DIY.jpg", "published_at": "2019-10-04"}