{"pub": "businessinsider", "url": "https://businessinsider.com/patrick-day-in-a-coma-hospital-following-10th-round-ko-2019-10", "downloaded_at": "2019-10-13 08:51:15.780336+00:00", "title": "A 27-year-old American boxer was knocked out in the 10th round of a fight, left on a stretcher, and is now in a coma", "language": "en", "text": "Patrick Day suffered a 10th round knockout in Chicago on Saturday.\n\nThe American received medical attention in the ring, left on a stretcher, and had seizures en route to a nearby hospital.\n\nHe underwent emergency brain surgery and is in a coma.\n\nVisit Business Insider's homepage for more stories.\n\nA 27-year-old American boxer was knocked out in the 10th round of a fight, left the ring on a stretcher, and is now in a coma.\n\nPatrick Day, from New York, was competing against Charles Conwell on Saturday, October 12 in Chicago's Wintrust Arena, an event headlined by Oleskandr Usyk's heavyweight debut against Chazz Witherspoon.\n\nDay was dominated by Conwell, knocked down by right hands in the fourth and eighth rounds, and then knocked out in the 10th, according to ESPN.\n\nThe Athletic's boxing expert Mike Coppinger tweeted at the time that \"Day was unconscious after [his] head hit the mat,\" adding that Chris Mannix on DAZN said an \"oxygen mask was applied as he left [the] ring on a stretcher.\" A breathing tube was used at hospital.\n\nPatrick Day left the ring on a stretcher. Photo by Dylan Buell/Getty Images\n\nESPN reports that Day was on the canvas for several minutes where he received medical attention.\n\nHe was taken to Northwestern Memorial Hospital in an ambulance, a three mile drive from the arena, but reportedly suffered seizures before he arrived.\n\nDay then went into a coma, though ESPN says it is unclear if this was medically-induced. He also had emergency brain surgery.\n\nMatchroom Sport group managing director Eddie Hearn, who organized the event, offered prayers on social media.\n\nHeavyweight debutant Usyk won the main event, knocking Witherspoon out in the seventh round.", "description": "Patrick Day, 27, was quickly taken to hospital after his brutal defeat to Charles Conwell on Saturday, October 12 at the Wintrust Arena in Chicago.", "authors": ["Alan Dawson"], "top_image": "https://image.businessinsider.com/5da2d7104af90932fa475dc2?width=1200&format=jpeg", "published_at": "2019-10-13"}