{"pub": "thestreet", "title": "Down From the Peak - Everest Re Group Is Weak on the Charts", "url": "https://realmoneypro.thestreet.com/investing/down-from-the-peak-everest-re-group-is-weak-on-the-charts-15073305", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-03 00:57:39.676127+00:00", "text": "After writing about American International Group ( AIG earlier today, I thought about looking at the charts of Everest Re Group, Ltd. ( RE ) , and I found a similar weak pattern on their charts.\n\nIn this daily bar chart of RE, below, we can see that prices have rolled over since early May. Prices were bouncing off of a \"neckline\" around $242 but that tentative support has given way and RE is testing the rising 200-day moving average line. This month prices have been failing at the underside of the declining 50-day moving average line.\n\nThe On-Balance-Volume (OBV) line made its high in May and its subsequent decline the past four months tells me that sellers have been more aggressive.\n\nThe trend-following Moving Average Convergence Divergence (MACD) oscillator has declined below the zero line for an outright sell signal.\n\nWe can see more sell signals on this weekly bar chart of RE, below. Prices are close to a test of the rising 40-week moving average.\n\nThe weekly OBV line is pointed down and the MACD oscillator on this longer time frame has crossed to a take profits sell signal.\n\nIn this Point and Figure chart of RE, below, we can see a possible downside price target of $217 being projected.\n\nBottom line strategy: RE is on the defensive now. Stand aside.", "description": "RE is on the defensive now. Stand aside....AIG", "authors": ["Bruce Kamich", "Down The Peak - Everest Re Group Is Weak On The Charts", "Re Is On The Defensive Now. Stand Aside.", "Stocks Quotes In This Article", "James", "Rev Shark", "Jim Collins", "Eric Jhonsa", "Paul Price", "Kevin Curran"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/518375ac-aa1e-11e7-a2b5-abff68ec8804.png"}