{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/29/europe-accuses-facebook-of-being-slow-to-remove-fake-accounts", "downloaded_at": "2019-10-29 13:58:15.150428+00:00", "title": "EU disputes Facebook's claims of progress against fake accounts", "language": "en", "text": "Commissioner says ‘still some way to go’ in battle against disinformation on social media\n\nFacebook and other major social media platforms have been accused by the European commission of giving a misleading picture of their efforts to remove fake accounts spreading politically motivated disinformation.\n\nThe security commissioner, Julian King, told the Guardian on the publication of the sites’ self-assessment reports to the EU’s executive that there remained a “disconnect” between the claims of progress from social media companies and “the lived experience”.\n\nFacebook, whose founder and chief executive, Mark Zuckerberg, recently gave evidence to a US Senate committee looking at disinformation, has said it disabled 2.2bn fake accounts in the first three months of 2019 and removed about 7,600 accounts, pages and groups engaged in “inauthentic behaviour”.\n\nDemocracy is under threat from the malicious use of technology. The EU is fighting back | Julian King Read more\n\nBut King said there had remained “too much disinformation” around the European elections in May, and that the debate about regulation of social media was developing at pace on both sides of the Atlantic.\n\nHe pointed to a study from George Washington university that found that in the run-up to and during the European elections, the far-right Alternative für Deutschland (AfD) party in Germany, which took 11% of the vote overall, received 86% of total shares and 75% of all comments on party political content in Germany posted on Facebook. That was four times the comments and six times the shares of all the other parties combined.\n\n“The vast majority of likes and shares came from a cluster of 80,000 accounts which were busily retweeting this stuff and they have many of the features of fake accounts,” King said. “In particular the most active – around 20,000 accounts – had random two letter first and last names. For example MX, CH, EW, which as it happens would not be legal names if you tried to register on a birth certificate in Germany.”\n\nHe added: “If a platform like Facebook with their resources and their knowledge can’t figure out that thousands of coordinated accounts with random two-letter names are suspicious and are engaging in this kind of activity in the context of the election, when we have put all that focus on it, then we still have some way to go.”\n\nKing was speaking as the commission published reports compiled by Google, Facebook, Twitter, Microsoft and Mozilla, all signatories to a voluntary EU code of practice. The commission said in an accompanying summary that while there had been some progress there were “serious further steps” to be made.\n\nThe efforts to advise consumers on what they were reading and who was behind it were said to be “patchy” although the commission praised Facebook’s clear policy to label ads with “paid for by” disclaimers.\n\nIndependent researchers tasked with finding disinformation on sites were not, however, being given the access they needed to allow them to do their jobs. The commission said it was also concerned that various companies were continuing to sell “fake account activity” for a few hundred euros.\n\n“There is a kind of stock and flow problem,” King said of Facebook, which admits to hosting some 120m fake accounts. “They are definitely affecting the flow, they are stopping some of this stuff being set up. But there is still quite a lot of this stuff there. It can have a disproportionate impact because a relatively small number of fake accounts can generate an enormous amount of activity.”\n\nKing said the platforms would need to open themselves to greater scrutiny to outside organisations if the EU was to stand by the voluntary code of conduct. A further report in January will reveal EU member states’ reactions to the platforms’ efforts over the past 12 months.\n\nKing said there were “negative examples” where “what platforms say and lived experience does not entirely align”.\n\n“If we are really going to make progress on this then we are going to have to have a step-change in the amount of outside scrutiny that the platforms are going to tolerate,” he said.\n\n“Do you need, because of the questions it raises about the integrity of government, to think about some form of regulation? We are not there yet but we have to have that debate.\n\nMore than 250 employees have signed a letter to Zuckerberg decrying Facebook’s decision to allow politicians to post ads on the platform that include false claims, it was reported on Monday.\n\nThe letter, posted on an internal communication message board for the company, said: “Misinformation affects us all. Our current policies on factchecking people in political office, or those running for office, are a threat to what FB stands for.”", "description": "Commissioner says ‘still some way to go’ in battle against disinformation on social media", "authors": ["Daniel Boffey"], "top_image": "https://i.guim.co.uk/img/media/0f75be590094a0490cb8d2b1117c134f975b2967/0_182_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=35159e02c61220fc0a46cbd61cf783c7", "published_at": "2019-10-29"}