{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/10/16/cnn-actually-deserves-a-round-of-applause-for-pressing-beto-on-his-gun-confiscation-scheme-n2554896", "downloaded_at": "2019-10-17 01:48:04.686168+00:00", "title": "CNN Actually Deserves a Round of Applause For Pressing Beto On His Gun Confiscation Scheme", "language": "en", "text": "It's easy for conservatives to launch attacks on CNN. After all, they spend the majority of their time pushing their liberal, anti-Trump narrative. But Alisyn Camerota deserves praise for pushing 2020 Democratic presidential candidate Beto O'Rourke on his gun confiscation scheme. He had previously said he expected gun owners to hand over their \"weapons of war\" (or what the rest of us normal folks refer to as AR-15s). O'Rourke had the stupid idea that people would willingly hand over their firearms because, you know, gun owners are law-abiding.\n\nCamerota pointed out the absurdity in O'Rourke's views and reminded him that mass shooters don't follow the law, so his desire to ban \"assault weapons\" is useless.\n\n\"I expect my follow Americans to follow the law,\" Beto told the CNN host.\n\n\"You expect mass shooters to follow the law?\" she asked, clearly puzzled.\n\nIt was obvious he was caught off guard by the question.\n\n\"Our fellow Americans will follow the law, yes,\" he replied.\n\n\"Congressman, mass shooters, by definition, don't follow the law,\" Camerota explained. \"The mass shooters in Parkland, in El Paso – I could go on for 10 minutes – they don't follow the law, by definition.\"\n\nBeto attempted to explain how \"courageous\" it is to pass gun control measures but failed to get to the root of the issue: criminals.\n\n\"There are so many instances where the proposals we've made, whether it's a universal background check or a red flag law or ending the sales of weapons of war or buying those that are out there back, would have stopped many of the shootings that we see in a country that loses 40,000 people a year to gun violence,\" Beto said. \"Would it stop every single shooting? No. But that should be no excuse for not taking action now while we have the opportunity to do the right thing. And we also shouldn't be limited by the politics or the conventional political wisdom or the polling or the consultant class or the NRA on finally taking decisive action.\"\n\nPut Camerota pressed him further, reminding him that mass shooters, by their very definition, are criminals. And they don't follow the law.\n\n\"No, understood. And I think what Mayor Buttigieg was saying – yeah, think high, shoot for something aspirational – but it doesn't make sense that people are going to hand over their assault weapons,\" she explained. \"If they're mass shooters, if they want to do harm to people, they're not going to follow the law. So then what's your plan?\"\n\nAnd, at the end of the day, Beto admitted what we all knew to be true: firearm confiscation doesn't address the issues of criminals obtaining guns on the black market or their desire to carry out mass carnage. But he plans to \"stop them.\"\n\n\"I don't know that you make any law or stop making any law because you fear some people will not follow the law in any part of American life,\" he said. \"So, yes, if someone has an assault weapon, a weapon of war, and posses a danger to people in their lives or people in their community or people in our lives then we're going to stop them.\"\n\n\"Meaning what? You're going to go to their house?\" Camerota asked. \"Just tell us how it works. If someone doesn't voluntarily hand over their assault weapon you're going to go to their house and then what?\"\n\nOf course, Beto went back to the idea that criminals will suddenly decide to follow the law.\n\n\"If we pass this law, then I expect our fellow Americans to follow the law,\" he replied. \"And this is not speculation. We've seen other countries do this.\"\n\n\"Yeah, but law-abiding people follow the law,\" she reminded him. \"Law-abiding people follow the law but our problem is with mass shooters who don't.\"\n\nCNN actually presses Beto on his ridiculous gun confiscation scheme. Took them long enough. It was worth watching him squirm though. pic.twitter.com/AKnK4Yd2PH — Beth Baumann (@eb454) October 16, 2019\n\nFormer National Rifle Association Spokeswoman Dana Loesch reminded people of one important tidbit: she made the exact same point as Camerota during a town hall following the tragic shooting in Parkland, Florida.\n\nWherein CNN finally admits gun control laws won’t work, 18 months after I said the same thing on their network to which they vehemently disagreed. https://t.co/6UBU3lrn1u — Dana Loesch (@DLoesch) October 16, 2019\n\nGun rights advocates have long pointed out that disarming law-abiding Americans doesn't suddenly make a criminal wake up and decide to follow the law. The very definition of a criminal is someone who breaks the law. Taking away firearms from those who follow the rules just makes them sitting ducks.\n\nIt took CNN awhile – and I do mean a looonnnggg while – to realize gun confiscation doesn't address the issue of mass shooters or other criminal acts. Maybe, just maybe, if Second Amendment advocates continue to praise people like Camerota for actually asking the question average Americans have, they'll ask these hard hitting questions and not just push their typical liberal agenda.", "description": "Gotta give credit where credit is due..10/16/2019 21:44:45PM EST.", "authors": ["Beth Baumann", "Bronson Stocking", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/266/01c44d5e-eb6d-4d92-9297-0e1c7ae1cd4c.png", "published_at": "2019-10-16"}