{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/lidl-launches-new-hyaluronic-acid-skincare-range-and-its-cheap-10870053", "downloaded_at": "2019-10-07 09:12:09.300831+00:00", "title": "LIDL launches new hyaluronic acid skincare range – and it’s cheap", "language": "en", "text": "LIDL’s new skincare range (Picture: Lidl)\n\nBeing obsessed with skincare is up there with liking avocados and being locked out of the property market as a classic staple of the millennial experience.\n\nSkincare can, famously, be pretty pricey – but we have good news for broke or stingy people who still don’t want to look like a withered husk.\n\nBudget supermarket chain Lidl is launching a new skincare range – including cleansers, gels and micellar water – that’s as friendly to your wallet as it is to your pores.\n\nThe Hydro Expert range is centred around the ingredient hyaluronic acid – although this sounds like something you might use to dissolve a body in a bathtub, it’s actually an extremely effective moisturiser which is commonly found in high-end products from the likes of Glossier (whose version would set you back a whopping £24 a bottle.)\n\nThis could be yours (Picture: Lidl)\n\nWith Lidl’s prices starting at £1.49 and capped at £3, however, this magical ingredient will finally be accessible to those of us on a tight budget.\n\nAdvertisement\n\nAdvertisement\n\nThis is happening at a good time – during the cold winter months, when there is a lack of humidity in the air, dry skin is a common problem. As well as using moisturisers like Lidl’s range, there are a few things you can do to help this.\n\nFor a start, using an air humidifier in your home can make a difference, as can taking extra care to stay hydrated (as tempting as it can be to hibernate with a glass of wine during the winter months – this doesn’t help) and avoiding harsh toners.\n\nMORE: Bride uses dad's ashes for her wedding day nails\n\nMORE: Harrods has just opened a massive new beauty emporium\n\nMORE: Stunning photos show men’s beauty pageant contestants decked out in national dress\n\nAdvertisement Advertisement", "description": "Supermarket Lidl is launching a range of skincare products which use the ingredient hyaluronic acid.", "authors": ["James Greig"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_88794312_1570437656.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}