{"pub": "cbs", "url": "https://cbsnews.com/news/harris-county-sheriffs-deputy-sandeep-dhaliwal-killed-first-sikh-officer-funeral-today-2019-10-02", "downloaded_at": "2019-10-03 07:31:25.994127+00:00", "published_at": "2019-10-02", "title": "Slain Sikh deputy remembered for his compassion at funeral service", "language": "en", "text": "Harris County Sheriff's Deputy Sandeep Dhaliwal, center, seen Friday, September 27, 2019 AP\n\nA Texas sheriff's deputy who was described as \"a trailblazer\" for being the first Sikh deputy in his agency is being remembered for his compassion, warm smile and for a life marked by service to others. Funeral services were held Wednesday near Houston for Harris County Sheriff's Deputy Sandeep Dhaliwal. The 42-year-old was fatally shot Friday during a traffic stop.\n\nHarris County Sheriff Ed Gonzalez said Dhaliwal was \"a man of dedication, faith, love and compassion.\"\n\n\"There are no words to speak to how heartbroken we are, how devastated,\" Gonzalez added.\n\nThousands of people, including law enforcement personnel from the U.S. and Canada, attended the services, held at a sports arena.\n\nKHOU-TV said there were two funeral services, a procession and a 21-gun salute with a flyover. Many wore navy blue at the request of the Sikh National Center, just like the uniform Dhaliwal proudly wore, the station added.\n\nNew Jersey Attorney General Gurbir Grewal, the nation's first Sikh state's attorney general, said Dhaliwal \"inspired an entire generation of Sikhs to public service.\"\n\nA teacher brought small U.S. flags to honor Dhaliwal.\n\nA teacher from Cy-Fair ISD brought the small American flags, a 5 y/o holds tightly onto them while his grandma stands beside him... these are just some of the folks we’re meeting.\n\nALL here to honor & pay their respects to #DeputyDhaliwal. #KHOU11 #htownrush #SandeepDhaliwal pic.twitter.com/oKe3acvlpe — Michelle Choi (@MichelleKHOU) October 2, 2019\n\nThe Southlake Police Department shared a photo of some of its officers with their colleagues at the funeral, according to CBS Dallas/Fort Worth. The department said it \"was honored to attend the funeral of hero deputy Sandeep Dhaliwal in Houston. Sargeant Diehl and Detective Roberson attended the funeral. We offer our deepest condolences for Deputy Dhaliwal's family and the Harris County Sheriff's Office.\"\n\nSouthlake police officers among officers at funeral for Harris County DeputySandeep Dhaliwal. Southlake Police Department via CBS Dallas/Fort Worth\n\nDonations for Dhaliwal's family may be made in his name to the Harris County Sheriff's Office Benevolence Association or via GoFundMe, KHOU-TV reported. Dhaliwal was the father of three children.\n\nThe suspect charged with Dhaliwal's murder remains jailed.\n\nDhaliwal is the second Texas deputy to die while making a traffic stop this year. El Paso County Deputy Peter Herrera was fatally shot during a March traffic stop in San Elizario, about 25 miles southeast of El Paso. Both occupants of the car were charged with capital murder and await trial.", "description": "Sandeep Dhaliwal, 42, was described as \"a trailblazer\" and was remembered for his compassion, warm smile and life of service to others", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/10/02/e60cc3ed-e6ab-43fb-a338-10f28c1552aa/thumbnail/1200x630/7668cb14968e88a1b761b5bca7ea622c/dhaliwal-horizontal.png"}