{"pub": "investing.com", "url": "https://za.investing.com/analysis/us-putting-china-through-the-hoops-200431342", "downloaded_at": "2019-10-09 11:06:54.226881+00:00", "title": "US Putting China Through The Hoops", "language": "en", "text": "While China has stopped showing NBA preseason games after a team owner commented unfavourably on Hong Kong, the US is undoubtedly putting China through hoops of its own before the trade talks main event starts tomorrow.\n\nAfter putting 20 Chinese public security organisations and 8 Chinese companies on their \"entity\" list yesterday, restricting their access to US technology without government approval, the US announced visa restrictions on eight unnamed officials associated with them. The US tactics are undoubtedly a high risk, seeking to pressure the Chinese trade delegation before the main event really gets underway. Financial markets certainly thought so with Wall Street a sea of red and oil saved only by protests in Iraq and Ecuador. The very real danger is the whole process backfires with the trade talks fouled for a double dribble before they even begin.\n\nElsewhere the IMF threw their pennies worth into the ring forecasting grim economic times ahead unless the US and China come to a mutually acceptable trade agreement. The Fed Chairman, Jerome Powell, announced they would buy a limited amount of bonds to ease the crunch in the short-end repo market while stating the Fed stood ready to act to external events such as trade and Brexit.\n\nIn Australia, Westpac Consumer Confidence has plunged to -5.5% this morning, adding to the procession of woeful domestic data from the not so lucky country. Markets appear to be locked and loaded for a further rate cut from the RBA with a failure to make any progress in Washington DC this week, likely the final piece of the puzzle for not just the RBA, but many other central banks around the world.\n\nThe Asia data calendar is light to non-existent today, meaning the market will concentrate on the US \" upset the Chinese as much as possible before the negotiations strategy.\" The gloom from North American is, therefore, unlikely to lift today.\n\nEquities\n\nThe as yet unexplained rally across Asian stock exchanges yesterday quickly fizzled out in Europe and sentiment turned directly South in North America. Trade risks, of course, were the driver, with the falling 1.56%, the falling 1.67% and the Jones easing by 1.20%.\n\nAsia is following New York's game plan today to the surprise of no one, although the negative sentiment hasn't reached Wall Street's dark proportions overnight. Shanghai is 0.20% lower, the is 0.70% lower, and the ASX (ASX: ) has fallen 0.85%. South Korea is closed for a public holiday.\n\nCurrencies\n\nTrade uncertainty saw the dollar mostly rise overnight as investors moved into the safety of US Treasuries. The rising 0.15% to 99.12. Among the exceptions were fellow haven currencies the CHF and JPY. fell 0.17% to 0.9935 and the fell 0.15% to 107.10.\n\nAlthough FX markets are quiet in Asia today, regional currencies are likely to feel some pressure against the dollar as trade worries gain in volume.\n\nOil\n\nBoth Crude and WTI were on the back foot unsurprisingly, overnight as the US administration ratcheted up the political pressure on China ahead of the trade talks. Although both contracts moved lower, the damage was limited to some extent by the continuation of violent protests across OPEC members Ecuador and Iraq. In Ecuador's case, it has got so bad that the government has moved from the capital Quito to the coastal city of Guayaquil. Brent cruse finished 0.50 % lower at $58.40 a barrel and WTI fell 0.40% to $52.65 a barrel.\n\nThe API Crude Inventories posted a massive 4.1 million increase overnight, but the effects on oil were mitigated by an equally significant drawdown of 5.4 million barrels in gasoline stocks.\n\nPolitical turmoil amongst OPEC members will provide only a temporary panacea for oil prices; the event risk of US-China trade is much larger. Oil has already started to move lower in Asia with Crude and WTI both falling 0.35% to $58.05 a barrel and $52.40 a barrel respectively.\n\nTrade uncertainty provided a welcome relief for beleaguered gold longs overnight as haven flows saw gold rise 0.80% to $1505.00 an ounce. Once again, the story was not a gold story, but a haven flow story meaning that golds next move up or down will not be defined by golds fundamentals, instead of its position as a risk hedge.\n\nGold is unchanged in Asian trading this morning and is likely to find plenty of buyers ion any dips back to $1500.00 an ounce while the trade outlook in the short-term looks are so gloomy. Gold has resistance at $1520.00 an ounce which will be a challenging level to break in the near-term unless the Washington DC talks take an official turn for the worse.", "description": "Market Overview Analysis by Jeffrey Halley covering: USD/JPY, USD/CHF, XAU/USD, S&P 500. Read Jeffrey Halley's latest article on Investing.com South Africa.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-09"}