{"pub": "mirror", "url": "https://mirror.co.uk/news/us-news/tesla-driver-burnt-death-car-20710095", "downloaded_at": "2019-10-24 00:36:33.651765+00:00", "title": "Tesla driver burned to death in front of policeman 'who couldn't work unusual handle'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA Tesla driver burned to death in his car because of the vehicle's futurist handles, it has been claimed.\n\nOmar Awan, a 48-year-old anesthesiologist, died in his Tesla Model S after he lost control and crashed it into a palm tree.\n\nA police officer couldn’t open the doors because the handles were retracted and bystanders watched helplessly as the car filled with smoke and flames, according to a wrongful death lawsuit filed in state court in Broward County, Florida.\n\nIt is alleged the fire in February originated with the car’s battery.\n\nThe door handles on the Model S are flush with the car and pop out when they detect that the key fob is nearby.\n\nThe suit, filed on October 10, says: “Fire engulfed the car and burned Dr Awan beyond recognition - all because the Model S has inaccessible door handles, no other way to open the doors, and an unreasonably dangerous fire risk\".\n\n(Image: Getty Images)\n\nThe complaint lists the cause of death as smoke inhalation and states that Awan had sustained no internal injuries or broken bones in the crash.\n\nTesla are yet to comment on the lawsuit.\n\nConsumer Reports said in 2015 that broken door handles were one of the most common problems with the Model S, reports Bloombeg.\n\nAwan’s Tesla continued to burn for hours, reigniting several times even after firefighters had extinguished the flames and the car had been towed, according to the complaint.\n\n(Image: Getty Images)\n\nThey are seeking more than $15,000 in damages.\n\nAs a failsafe, the emergency guide advises: \"If the door handles do not function, open the door manually by reaching inside the window and using the interior door handle.\"", "description": "Omar Awan, a 48-year-old anesthesiologist, died in his Tesla Model S  in Florida when he lost control and crashed into a palm tree", "authors": ["Tom Davidson", "Image", "Nurphoto Via Getty Images", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20710009.ece/ALTERNATES/s1200/0_Tesla-Store-In-Barcelona.jpg", "published_at": "2019-10-23"}