{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/boris-johnson-trump-harry-dunn-romeo-anne-sacoolas-meeting-white-house-diplomat-a9159766.html", "downloaded_at": "2019-10-17 11:35:18.717955+00:00", "title": "Harry Dunn: Boris Johnson denies asking Trump to arrange 'ambush' with grieving parents and Anne Sacoolas", "language": "en", "text": "Downing Street has denied Donald Trump‘s claim that Boris Johnson asked him to arrange a meeting between the grieving family of British teenager Harry Dunn and the American woman allegedly responsible for his death.\n\nThe prime minister’s spokeswoman said he was not aware the US president planned to bring the couple to the White House at the same as Anne Sacoolas, who fled the UK following the car crash which killed the 19-year-old in August.\n\nThe family’s lawyer accused Mr Trump of having “ambushed” Dunn's parents by inviting them to the Oval Office and then revealing Ms Sacoolas, whose husband is a US intelligence official, was in the next room.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe president later claimed: “I spoke with Boris, he asked me if I’d do that and I did it.”\n\nBut a Number 10 spokeswoman said on Thursday: “The PM and the president spoke last Wednesday and the PM asked the president to do all he could to resolve the issue.\n\n“During the conversation, the president raised a possibility of a meeting with Anne Sacoolas at the White House but at that stage we weren’t aware of any plans for the family to go [to the US] so it wasn’t discussed further.”\n\nMore follows…", "description": "Downing Street has denied Donald Trump‘s claim that Boris Johnson asked him to arrange a meeting between the grieving family of British teenager Harry Dunn and the American woman allegedly responsible for his death.", "authors": ["Chris Baynes"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/09/26/17/breaking-4.png", "published_at": "2019-10-17"}