{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/20/joe-biden-backers-lose-confidence-electability", "downloaded_at": "2019-10-21 02:23:50.415418+00:00", "title": "Voters lose confidence in Joe Biden's aura of inevitability", "language": "en", "text": "Rebecca Taylor was all-in for Joseph R. Biden when she caught the former vice president during a June swing through Iowa, citing his experience and saying his kind of “moderate” approach is exactly what the nation will need to heal and unify in a post-Trump era.\n\nNow she has second thoughts.\n\n“I am not going to say I am 100% with Joe Biden, where I felt more like I was 100% when he came out,” Ms. Taylor told The Washington Times.\n\nHer evolution is emblematic of how Mr. Biden’s support has softened across the early primary states, cutting into his image as the most electable candidate in the field and raising questions about whether the 76-year-old can rebound from his well-documented struggles.\n\nMs. Taylor said Mr. Biden, who is slated to return to the Iowa campaign trail this week, no longer looks like the only candidate addressing her top concern of ending the political polarization tearing apart America.\n\n“I think Pete Buttigieg is trying to preach the same message,” she said. “Right now, I am going to keep my options open.”\n\nMr. Biden started the campaign with a bang. He raked in over $6 million over his first 24 hours in the race and led national and early state primary polls, which also showed him as doing the best of all the Democratic hopefuls in hypothetical matchups with President Trump.\n\nSince then, though, his record has been picked apart by a more left-wing Democratic base, he has underwhelmed on the stump and the debate stage, and his son Hunter Biden’s business dealings in Ukraine and China have muddled his message.\n\nAlso, it is clear on the fundraising front that he is struggling to capture the imaginations of voters and energize activists to the same degree agree of his top rivals, including Mr. Buttigieg and Sens. Elizabeth Warren of Massachusetts and Bernard Sanders of Vermont.\n\nMr. Sanders drew an estimated 26,000 people to a campaign rally Saturday in New York, where he received the formal endorsement of Rep. Alexandria Ocasio-Cortez.\n\nMr. Biden raised less money than those three over the past three months and has far less cash on hand as well.\n\nThe campaign sounded the alarm in a recent fundraising email.\n\n“I hate to say it, but our opponents are way ahead of us when it comes to money in the bank,” said Elana Firsht, Mr. Biden’s only fundraising guru. “If we don’t pick up the pace here, we might have to make budget cuts that could seriously hurt our momentum in this primary.”\n\nMr. Biden held a pair of fundraisers over the weekend in New York and one in Greenwich, Connecticut, where he touted his experience and record of working across party lines and said Mr. Trump is scared of him.\n\n“He is spending over $10 million of special interest money to try to defeat me in a primary,” Mr. Biden said at one stop. “It’s interesting how he’s all of a sudden so interested in the Democratic primary, isn’t he? Because I want to tell you, he knows if I’m the nominee, I will beat him like a drum.”\n\nMr. Biden this week has penciled in two days of campaign events in Iowa, where his team has sought to tamp down expectations in case he doesn’t emerge as the winner when the state holds its caucuses, the first real contest of the 2020 election race, on Feb. 3.\n\nThe latest Real Clear Politics average of polls shows Mr. Biden running second behind Ms. Warren in Iowa and New Hampshire, which holds the first primary in the nation eight days later.\n\nJoAnn Hardy, chair of Cerro Gordo County Democrats, said Mr. Biden still has a deep reservoir of goodwill in Iowa and can rebound.\n\n“We like him because we know him,” she said. “He is sort of like the grandpa who will put his arm around your shoulder and make things better.”\n\nOthers in Iowa say Mr. Biden’s image has been dented.\n\nBryce Smith, chair of the Dallas County Democrats, said Mr. Biden’s “age shows dramatically” and is “not a selling point to younger voters and a new generation of political activists.”\n\n“He looks like he is 80 years old, and he sounds like it too,” Mr. Smith said. “Bernie Sanders looks like he is 80, but he doesn’t sound like it.”\n\nTom Courtney, co-chair of the Des Moines County Democratic Party, said he thinks Mr. Biden would make a great president but he is afraid of what will happen if he faces Mr. Trump in a one-on-one debate.\n\n“I can see Donald Trump saying a few things and Biden not saying things with assurance and Joe looking like a dummy on stage,” Mr. Courtney said. “When Trump says stuff, you have to be able to recover quickly, and I don’t see Joe recovering quickly. I see him getting flustered.”\n\nMr. Courtney said Mr. Biden is slipping.\n\n“I don’t think he is as popular as he was when this started,” he said.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Joe Biden's support has softened across the early primary states, cutting into his image as the most electable candidate in the field and raising questions about whether the 76-year-old can rebound from his well-documented struggles.", "authors": ["The Washington Times Http", "Seth Mclaughlin"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/17/Election_2020_Joe_Biden_33151.jpg-df499_c0-1415-3087-3215_s1200x700.jpg?7de19caaa81ade9d31a80db6fbe35a905ba2f7fc", "published_at": "2019-10-20"}