{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7560739/Clarinda-eyesore-three-units-built-transmission-tower-Melbourne-suburb.html", "downloaded_at": "2019-10-11 00:56:00.341368+00:00", "title": "Clarinda eyesore as three units built around transmission tower in Melbourne suburb", "language": "en", "text": "Angry residents have lashed out over a new housing development that has been built around an enormous electrical tower.\n\nThree units have been constructed around the 50-metre high eyesore at Clarinda, in south-east Melbourne.\n\nThough part of the base of the transmission tower stands in the backyard of one of the units and is only metres away from its backdoor, The Herald Sun reported.\n\nNeighbours have complained the site is not only unpleasant to the eye, but also a safety hazard for children.\n\nThree units have been constructed around the 50-metre high eyesore at Clarinda, in south-east Melbourne\n\n'There's no way you could stop kids from climbing up onto it,' resident Salma Thani (pictured) said\n\n'It looks bad, and the tower is dangerous to live near. We can hear the buzzing whenever it's windy or raining,' resident Narvada Seebaluck said.\n\nThe base of the tower has been left unfenced and its panels are well within reach of children.\n\n'There's no way you could stop kids from climbing up onto it,' resident Salma Thani said.\n\nNeighbour Bill Manning told 7 News little common sense was shown when the units were constructed so closely to the transmission tower.\n\n'Common sense would suggest that perhaps it shouldn't be built in a situation where it can be as vulnerable as it is out the back.'\n\nKingston City Council initially approved the planning permits in 2014 and its planning and development general manager Jonathan Guttmann argued residents were asked for their input.\n\nThough he claims no objections were raised and development went ahead.\n\n'While this is an unusual case, there are a number of residential properties built near power towers like this one and there are no planning regulations that prohibit residential developments near transmission towers,' he told Daily Mail Australia.\n\n'There are several towers within Clarinda and across Kingston on both private land and on public land in areas where people use the surrounding land as public open space.'\n\nThe planning permits were also approved as long as the developer followed the guidelines of the electrical company that operated the tower, AusNet Services.\n\nKingston City Council initially approved the planning permits in 2014 and its planning and development general manager Jonathan Guttmann argued residents were asked for their input (pictured, before the units were built)\n\nMr Guttmann claimed AusNet Services had signed off on the safety requirements.\n\nAn AusNet Services spokesperson said in a statement its main role was to make sure all electrical safety regulations were met.\n\n'This particular transmission tower has been in place since 1964. It was originally constructed and remains half on privately owned land and half on a council reserve.\n\n'The siting of the tower is based on the easement we have for the electricity transmission line.\n\n'Our role in relation to approvals is to ensure that all electrical safety regulations are adhered to. Decisions around the placing of a backyard around the tower are made by the developer in conjunction with planning permits they have received from the local council.'", "description": "Three units have been constructed around the 50-metre high transmission tower at Clarinda, in south-east Melbourne, with part of the base standing in the backyard of one of the units.", "authors": ["Aidan Wondracz For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/01/19565596-0-image-a-6_1570753676977.jpg", "published_at": "2019-10-11"}