{"pub": "reuters", "url": "https://reuters.com/article/us-indonesia-politics-president/indonesias-widodo-faces-test-on-reform-credentials-in-second-term-idUSKBN1WZ090", "downloaded_at": "2019-10-20 12:26:51.888118+00:00", "title": "Indonesia's Widodo faces test on reform credentials in second term", "language": "en", "text": "JAKARTA (Reuters) - Indonesian President Joko Widodo was sworn in on Sunday for a second five-year term leading the world’s third-biggest democracy, after an election dominated by economic issues but also the growing influence of conservative Islam.\n\nIndonesian President Joko Widodo is sworn in during his presidential inauguration for the second term, at the House of Representatives building in Jakarta, Indonesia, October 20, 2019. Adi Weda/Pool via REUTERS\n\nWidodo, 58, has pledged to cut red tape and keep building infrastructure to underpin growth in southeast Asia’s largest economy, but also made improving education a top priority to encourage investment and create jobs for a youthful population of 260 million people.\n\n“This will be a big problem if we fail to create enough job opportunities,” Widodo told parliament after his inauguration, where he cited his dream of Indonesia becoming one of the world’s top five economies by 2045 with a GDP worth $7 trillion.\n\nThe president said he would push two bills to replace laws that have hampered job creation, as well as warning he could sack underperforming civil servants.\n\nHe said he would name his cabinet on Monday morning.\n\nThere was tight security at parliament for his swearing-in alongside his vice president, Islamic cleric Ma’ruf Amin.\n\nMore than 30,000 security personnel were deployed following recent student demonstrations and after the country’s security minister was stabbed by a suspected Islamist militant earlier this month.\n\nThe inauguration was attended by regional leaders including Australian Prime Minister Scott Morrison, Malaysia’s Mahathir Mohamad and Singapore’s Lee Hsien Loong.\n\nWidodo grew up in a riverside slum and was the first national leader to come from outside the political and military elite.\n\nPopularly known as Jokowi, his everyman image has resonated with ordinary voters, though he has been criticized for being too beholden to powerful party backers and surrounding himself with former generals from the era of late strongman leader Suharto.\n\n“The president wants to improve the investment environment but is likely to face implementation woes when planned reforms are confronted by the interests of power brokers in his coalition,” Achmad Sukarsono, a political analyst at Control Risks, said in a note.\n\nAPPROVAL RATING\n\nLast month, Indonesia saw the biggest student demonstrations since Suharto stepped down in 1998 amid anger over bills parliament had tried to push through that critics say threaten democracy, intrude into privacy and hurt the fight against graft.\n\nStill, so far Widodo’s popularity appears to be holding up. A survey published last week by Indonesia’s biggest newspaper Kompas showed his approval rating dipping only slightly to 58.8%.\n\nIn April’s election, Widodo defeated former general Prabowo Subianto by a double-digit margin, but the poll revealed a split with more moderate Muslims and minorities backing Widodo and conservative Muslim regions backing his rival.\n\nViolent rioting broke out in Jakarta when Prabowo contested the poll results over claims of cheating, but the Constitutional Court upheld Widodo’s victory and there have since been talks to bring some opposition figures into the government.\n\nThe make-up of Widodo’s cabinet is being closely watched to see the proportion of technocrats versus party affiliated posts and there has been speculation that Prabowo or other members of the opposition could join the cabinet.\n\nThere are expected to be 34 ministers in the cabinet and Widodo said around 16 would come from political parties.\n\nSlideshow (7 Images)\n\nThe president’s $33 billion plan to relocate Indonesia’s capital from sinking, congested Jakarta on Java island to the island of Borneo has grabbed headlines. But it has also raised questions about how it would be financed and its environmental impact.\n\nIndonesia’s economic growth is forecast to slow for the first time in four years in 2019 and some independent observers warn of a further slowdown amid a global downturn.", "description": "Indonesian President Joko Widodo was sworn in on Sunday for a second five-year term leading the world's third-biggest democracy, after an election dominated by economic issues but also the growing influence of conservative Islam.", "authors": ["Tabita Diela", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191020&t=2&i=1442994046&w=1200&r=LYNXMPEF9J0DS", "published_at": "2019-10-20"}