{"pub": "independent", "url": "https://independent.co.uk/news/uk/home-news/manchester-airport-evacuation-bomb-squad-suspicious-package-latest-a9116321.html", "downloaded_at": "2019-09-23 10:35:36.806224+00:00", "title": "Manchester Airport: Bomb squad carries out controlled explosion after suspicious package discovered", "language": "en", "text": "A naked man running in and out of Manchester Airport buildings on Monday morning reportedly led to police to evacuate the coach and train station while bomb disposal squads carried out a controlled explosion on a “suspicious package”.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe incident has sparked travel chaos with long queues on roads and passengers and cabin crews have struggled to reach the departure terminal.\n\nFlights have so-far remained unaffected by the incident.\n\n“Officers are currently responding to reports of a suspicious package at Manchester Airport transport interchange,” Greater Manchester Police said in a statement.\n\n“Further enquiries are being carried out and bomb disposal officers are on their way to assist with these enquiries.\n\nShape Created with Sketch. The 10 most beautiful airport landings in the world for 2019 Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The 10 most beautiful airport landings in the world for 2019 1/10 Donegal airport in Ireland grabbed the top spot for the second year running in PrivateFly's 2019 poll of the most scenic landings in the world. Owen Clarke 2/10 The Outer Hebrides' Barra airport in Scotland claimed second place. Ewen Weatherspoon 3/10 Nice, France, took third place. 4/10 Orlando Melbourne in the US came fourth. 5/10 St Maarten in the Caribbean ranked fifth thanks to a dramatic approach. 6/10 Saba in the Caribbean swings into sixth position. 7/10 Queenstown, New Zealand, is seventh most scenic. 8/10 Canada's Toronto Billy Bishop was voted eighth most beautiful. 9/10 The UK gets a second spot in the top 10 with London City airport, which claims ninth place. 10/10 Aosta in Italy bags 10th place with its mountain views. 1/10 Donegal airport in Ireland grabbed the top spot for the second year running in PrivateFly's 2019 poll of the most scenic landings in the world. Owen Clarke 2/10 The Outer Hebrides' Barra airport in Scotland claimed second place. Ewen Weatherspoon 3/10 Nice, France, took third place. 4/10 Orlando Melbourne in the US came fourth. 5/10 St Maarten in the Caribbean ranked fifth thanks to a dramatic approach. 6/10 Saba in the Caribbean swings into sixth position. 7/10 Queenstown, New Zealand, is seventh most scenic. 8/10 Canada's Toronto Billy Bishop was voted eighth most beautiful. 9/10 The UK gets a second spot in the top 10 with London City airport, which claims ninth place. 10/10 Aosta in Italy bags 10th place with its mountain views.\n\n“A man has been detained by police at the scene.\n\n“A cordon is in place at Manchester Airport transport interchange and people are encouraged to follow directions from officers,”\n\n“Trams, trains and buses are currently suspended to and from the airport interchange.”\n\nIn a later statement the force added: “Bomb disposal officers are at Manchester Airport transport interchange to assist GMP with enquiries.\n\n“As part of their assessment to ensure the package is safe, a controlled explosion took place.\n\n“The cordon will remain in place as a precautionary measure as enquiries continue.”\n\nAs parts of the airport coach station was cordoned off, a coach driver reported seeing a naked man running in and out of the building.\n\nCaroline Watson told the Manchester Evening News: “Some of the air cabin crew that park there have been turned away. It is like a mass exodus. All hell has broken loose.\n\n“The guy was running around with his arms waving in the air, going up and down.\n\n“He was running back and forth. He was going in and out of the terminus.\n\n“He had no clothing on whatsoever. It is not what you expect to see at 6.10am on a Monday morning.”\n\nA spokesperson for Manchester Airport told The Independent that despite the evacuations of the train and coach stations and road closures, flights are unaffected.\n\nThough there were reports of passengers and cabin crew struggling to reach planes, there have been no cancellations or delays to flights, they said.", "description": "A naked man running in and out of Manchester Airport buildings on Monday morning reportedly led to police to evacuate the coach and train station while bomb disposal squads carried out a controlled explosion on a “suspicious package”.", "authors": ["Harry Cockburn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/23/10/Manchester-airport-bomb-squad.jpg", "published_at": "2019-09-23"}