{"pub": "reuters", "url": "https://uk.reuters.com/article/us-southeastasia-payments-analysis/southeast-asias-mobile-payments-face-shakeout-as-market-booms-idUKKBN1WV2V7", "downloaded_at": "2019-10-16 23:44:47.093639+00:00", "title": "Southeast Asia's mobile payments face shakeout as market booms", "language": "en", "text": "HO CHI MINH CITY/HONG KONG/SINGAPORE (Reuters) - Just next to Ho Chi Minh City’s financial district, two dozen street vendors’ stalls display colourful adverts for e-wallets backed by private equity firm Warburg Pincus, ride-hailing firm Grab and Singapore sovereign wealth fund GIC, among others. Between them, the stalls - selling everything from crab soup to Vietnamese Banh My sandwiches - accept payment from most of Vietnam’s 28 different e-wallets, which also allow users to make cash transfers through their mobile phones.\n\nMobile e-payment logos are seen at a street food stall in Ho Chi Minh city in Vietnam, October 15, 2019. REUTERS/Yen Duong\n\nThe wallets, which hope to take advantage of Vietnam’s plan to become a cashless economy by 2027, compete fiercely to gain many users to help them to turn a profit, a battle for market share replicated across Southeast Asia.\n\nNot all of them will survive. Already, the region’s crowded mobile payments sector is starting to shrink, with each national market expected to support only two mass e-wallets, according to consultancy Oliver Wyman.\n\n“The e-wallets spend a lot of money on attracting customers and retaining them, getting them to use the wallet in their daily life,” said Duncan Woods, head of Oliver Wyman’s Asia Pacific retail and business banking practice.\n\n“When you’ve got so many of them out there, it’s about who’s got the deepest pockets,” he said.\n\nSoutheast Asia has at least 150 e-wallet licence holders, and firms including Grab, Go-Jek, Tencent Holdings (0700.HK), Ant Financial, Singapore Telecom (STEL.SI), AirAsia (AIRA.KL) and dozens of fintech firms are fighting for dominance.\n\nMany have the cash. Grab plans to invest $500 million (389.7 million pounds) in its Vietnam business, with payments a focus area. Softbank’s Vision Fund and GIC invested $300 million in e-wallet VNPAY’s parent company in July, and e-wallet Momo raised $100 million from Warburg Pincus in January, according to news publication DealStreetAsia.\n\nSome are using the cash to build scale, others to buy it, as they race to secure a dominant position in a mobile payments market estimated by Nomura to grow seven-fold to $109 billion by 2025.\n\nMERGER MANIA\n\nSoftbank-backed Grab is in talks to merge its Indonesian digital payments firm, OVO, and Ant Financial-backed Dana, both of which are among Indonesia’s top five e-wallets, to bulk up and power ahead of rival Gojek, sources said. In Vietnam, e-wallet Vimo merged with payment processor mPOS and rebranded as NextPay in June - and kicked off a $30 million fundraising round and an ambitious growth plan.\n\n“We expect to be present across Vietnam and win 50% of the market with 300,000 acceptance points by 2023 from 60,000 merchants now,” NextPay’s CEO Nguyen Huu Tuat said, while noting that getting customers to change their habits was a challenge.\n\nStreet sellers in Ho Chi Minh City echoed this view, despite government efforts to change behaviour.\n\nSome wallets, including the partnership between local firm Moca and Grab, offer buyers discounts of up to 30% if they use their wallet, stallholders said.\n\n“I want to comply with the government’s cashless plan although I’m not very fond of it, so I offer ‘morning cash, afternoon card’” one merchant, Huong, said when Reuters visited her noodle stall.\n\nDIFFERENT STRATEGIES Attracting users is essential as a tipping point looms.\n\n“E-wallet consolidation at a regional and local level is highly likely as products mature and consumers migrate to those who offer the most services,” said Phil Pomford, an APAC general manager at fintech firm FIS.\n\n“One likely play would involve one of the big global and/or regional super apps consolidating services across South East Asia.”\n\nThe region’s largest players, including ride hailing-turned super apps Grab and Go-Jek, are betting that becoming the main payment method will bind consumers into their networks and offer them higher margin services — a model that Alibaba and Tencent pioneered in China.\n\n“One of the reasons our payments business has seen such success is because we’ve had a very intentional strategy of developing the largest merchant network, whether it’s offline, it’s online or whether it’s on-demand,” Grab’s president, Ming Maa told Reuters.\n\nOthers have looked to use an e-wallet as an add-on to their existing businesses. Users of AirAsia’s BigPay wallet can earn AirAsia travel rewards by using the wallet, which they also hope can become a mainstream payment method.\n\nTencent and Alibaba and its affiliates have primarily focused on Chinese tourists using their wallets in Southeast Asia and have also each invested in wallets in almost every market in the region.\n\nGrab says it is the only digital payments provider in Southeast Asia with access to e-money licences in six major economies, making it the furthest on with a regional approach.\n\nSome observers are still sceptical however.\n\n“Many e-wallets’ business model seems to be: 1) gain a lot of customers and their data. 2) question mark. 3) be very profitable,” said Dmitry Levit a partner at VC firm Cento, which has invested into several payment-processing companies, but stayed away from wallets.\n\nSlideshow (3 Images)\n\nGo-Jek is not worried about competition from other wallets or incumbents, said Aldi Haryopratomo, CEO of Go-Pay, the company’s payment platform.\n\n“By being the payments provider that connects the driver to the bank, we are able to make sufficient margin. And if you always think about competition and threat from the banks, then you are thinking that the pie is fixed,” said Haryopratomo.\n\n“But in Indonesia, the pie is actually getting bigger.”", "description": "Just next to Ho Chi Minh City's financial district, two dozen street vendors' stalls display colourful adverts for e-wallets backed by private equity firm Warburg Pincus, ride-hailing firm Grab and Singapore sovereign wealth fund GIC, among others. Between them, the stalls - selling everything from crab soup to Vietnamese Banh My sandwiches - accept payment from most of Vietnam's 28 different e-wallets, which also allow users to make cash transfers through their mobile phones.", "authors": ["Phuong Nguyen", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191016&t=2&i=1441654690&w=1200&r=LYNXMPEF9F21G", "published_at": "2019-10-16"}