{"pub": "axios", "url": "https://hbr.org/2019/10/how-doctors-can-help-prevent-gun-violence", "downloaded_at": "2019-10-28 09:50:15.420122+00:00", "title": "How Doctors Can Help Prevent Gun Violence", "language": "en", "text": "Since 1996, when the now-infamous “Dickey Amendment” prohibited the U.S. Centers for Disease Control and Prevention from using funds “to advocate or promote gun control,” total federal funding for firearm injury prevention research has been almost nil. Meanwhile, the rate of firearm injuries and deaths began to increase. In the absence of federal support for research, Physicians and health care provider organizations have a key role to play in reduce gun injuries including partnering with experts to learn best practices in firearms injury prevention; continuing to pressure the federal government to provide funding; continuing to work closely with affected communities to staunch the frequency of and impact of shooting; and working with electronic health record companies, the technology and insurance industries, and the larger business community to collect and analyze data.\n\nShana Novak/Getty Images\n\nAlmost exactly one year ago, the National Rifle Association tweeted that “self-important anti-gun doctors [should] stay in their lane.” Thousands of physicians and other healthcare professionals responded with graphic pictures and stories that underscored why the prevention and treatment of firearm injury is very much “in our lane.” In the week after the tweet, the hashtag #ThisIsOurLane went viral, an open letter in response to the NRA from physicians and their colleagues with The American Foundation for Firearm Injury Reduction in Medicine (AFFIRM Research) garnered over 40,000 signatures, and physician leaders of the movement — including the two of us — found themselves with an unexpected platform to advocate for change. Since the explosion of this hashtag, our work to reframe the debate about firearm injury prevention has accelerated. But there is still far to go.\n\nWe will start with a recap: what was this tweet, where did it come from, and why did it attract such a strong reaction from the healthcare community?\n\nSince 1996, when the now-infamous “Dickey Amendment” prohibited the U.S. Centers for Disease Control and Prevention from using funds “to advocate or promote gun control,” total federal funding for firearm injury prevention research has been almost nil. Concurrent with the lack of CDC or NIH funding, a public health approach to firearm injury disappeared. Most medical societies went silent on the issue, new projects virtually ceased, and a generation of bright young physicians and researchers were discouraged from pursuing firearm injury prevention.\n\nThe Sandy Hook school shooting in 2012 marked a turning point for many medical and public health practitioners and organizations, who redoubled efforts to engage the broader healthcare community in demanding a public health approach to firearm injury prevention. Just as research-based approaches to auto safety helped cut the annual U.S auto fatality rate by more than half since 1980, it’s common sense that research into the causes and prevention of firearm injury should be a key strategy in efforts to reduce gun injuries and death.\n\nInsight Center Innovating in Health Care Sponsored by Medtronic Improving patient outcomes and experience.\n\nAs part of this work, last fall, the American College of Physicians — one of the country’s largest physician organizations — updated a position paper outlining their largely evidence-based recommendations for firearm injury prevention. It was this new paper that provoked the NRA tweet. And when the NRA tweeted, the doctors and nurses and medics who had been working to restart the public health approach were ready.\n\nWe were already tired of taking care of victims and of being told that there was nothing we could do to stop their coming through our doors. We were already tired of seeing our communities caught in endless cycles of violence. We were already tired of seeing our own colleagues injured and killed, be it by suicide, domestic violence, or as first responders. We were already tired of the emotional toll of this epidemic. And this tweet reminded us just how much our experiences mattered. We responded en masse with impassioned speeches and op-eds, and with unified fundraising efforts in honor of our patients and colleagues.\n\nTo outsiders, it may seem that this movement arose out of thin air. But #ThisIsOurLane was in fact just a catalyst for a movement that was already well under way. Given new energy by the hashtag in the past year, many of these efforts have grown in strength and power. The American College of Surgeons held a interdisciplinary summit of more than 40 medical and public health organizations, in which they restated their joint commitment to the public health approach. In the glaring absence of substantial federal funding, private funding for firearm injury research has increased by more than 300%, with the National Collaborative on Gun Violence Research, Kaiser Permanente, and AFFIRM Research together creating dozens of new projects that would not have been possible without it. Physician education and guideline development has also accelerated: the American Medical Association launched a free online program, UC Davis developed the “What You Can Do” initiative, and the NIH-funded FACTS consortium and Johns Hopkins both launched online curricula. Hospital systems and states are also stepping up to the plate: New Jersey funded a major research consortium, the governors of multiple states (including Dr. Ranney’s home state of Rhode Island) have committed to collaborative research, California is slated to fund a statewide medical education curriculum (led by Dr. Garen Wintemute, who directs the Violence Prevention Research Program at UC Davis Medical Center), and Washington State has funded a new research program based out of the University of Washington-Harborview. In the past year, approximately $15 million dollars have been newly committed.\n\nBeyond the surge of engagement that the hashtag #ThisIsOurLane inspired, we’re seeing an important new development: These medically based efforts are at last being welcome beyond the medical community. Staying true to the public health approach, this work is engaging all of those affected by the epidemic, including gun owners, minority youth, domestic violence survivors, and school administrators. New initiatives such as the Colorado Firearm Safety Coalition’s online map showing where people can legally store guns outside of the home if any occupants are at risk of injury and AFFIRM’s collaboration with firearm training instructors are two of dozens of examples. Other efforts — like the Health Alliance for Violence Intervention — have gained in strength. These often hospital-based programs collaborate with communities to reduce the risk factors that drive the cycle of violence affecting inner-city youth. And the American College of Surgeons’ Stop the Bleed program for out-of-hospital bleeding control has been adopted and delivered to over one million people nationwide.\n\nFinally, the firearm injury prevention movement is increasingly collaborating with business and military to decrease risk. These groups understandably resist initiatives that seem partisan or political. But through the transformative, big-tent approaches outlined above, they have begun to appreciate that we can, indeed, address firearm injury prevention while also respecting the culture of our communities. This movement — which includes but is not limited to the #ThisIsOurLane hashtag — is not Democratic or Republican, and it’s not anti-gun. It’s anti-firearm-injury. Many of the physicians involved own guns. The focus is on stopping shootings before they happen and on saving lives.\n\nAlthough we applaud private funders and individual donors for stepping up to the plate, we need a much greater investment to address this epidemic. Traditionally, the public health response has been led by the federal government, including the CDC and NIH. While the NIH is now funding firearm research (albeit without dedicated funds or programs), the CDC is still silenced. The Senate recently declined to include the House’s request for $50 million of firearm injury prevention research funding in their health appropriations bill.\n\nIn the meantime, as leaders in this movement, we and our organizations will work collaboratively with private groups to jumpstart the necessary response. We draw parallels to our work from the early HIV/AIDS response. Long before the National Institutes of Health dedicated funds to researching the prevention and treatment of HIV/AIDS, private groups like the Ryan White Foundation and the Rock Hudson Foundation provided funding. Healthcare groups are now doing the same, supporting private initiatives while we push the government to act.\n\nAll this said: we are not naïve. There is no single solution to this epidemic, and there is much work to be done. But without continued commitment to implementing what we already know works — and to researching what we don’t yet know — we will not make further progress. Critical next steps include healthcare systems working with those of us with firearm injury prevention expertise to teach best practices to healthcare providers; continuing to pressure the federal government to provide funding; and continuing to work closely with affected communities to staunch the frequency of and impact of shootings. It also includes working with electronic health record companies, the technology and insurance industries, and the larger business community to collect and analyze data. Our patients and our communities deserve better than a haphazard approach to the epidemic. We need data-driven solutions.\n\nIf we have learned anything over the last year, it’s the power of the “white coat” to encourage good science, adequate funding, and a sustained, comprehensive public health approach to firearm injury prevention. We are enthused by the acceleration the medical community has made over the past year — but we need the support of the private community and of government to ensure that we don’t run out of gas before we reach the finish line.\n\nClick here to see Dr. Ranney’s TEDx talk “How the Public Health Approach Can Solve Gun Violence,” and here to see Dr. Betz’s TEDx talk “How to Talk About Guns and Suicide.”", "description": "Health care professionals have an important role to play.", "authors": [], "top_image": "https://hbr.org/resources/images/article_assets/2019/10/Oct19_24_1165885863.jpg", "published_at": "2019-10-24"}