{"pub": "yahoo", "url": "https://news.yahoo.com/dominican-republic-announces-safety-measures-043845536.html", "downloaded_at": "2019-09-13 18:20:53.216943+00:00", "title": "Dominican Republic Announces New Safety Measures After Deaths of 11 American Tourists", "language": "en", "text": "Officials from the Dominican Republic gathered in New York City, along with the U.S. Ambassador, on Thursday to announce new safety measures months after 11 American tourists died in several resorts there last spring.\n\nJavier Garcia, the Dominican Republic’s Minister of Tourism, told reporters at the Four Seasons Hotel in Manhattan that these new safety measures were put in place to specifically address safety at resorts that were at the center of the coverage.\n\nThe measures introduced include reinforcing mandates that require emergency information and the availability of 911 in every guest room, and a new emergency tourist center in Bávaro in Punta Cana, where multi-lingual specialists can communicate with tourists and their families.\n\nThe Ministry of Tourism also announced that it partnered with Ecolab, a United States-based water, hygiene and energy technology lab to provide training and certification to all Department of Tourism Services and Companies inspectors.\n\nGarcia also announced that an additional 4,000 agents have been hired for both the tourist security agency and the national police, and that 3,000 more public security cameras have been installed.\n\nU.S Ambassador to the Dominican Republican Robin Bernstein said that an “unfounded negative campaign” contributed to a “tourism crisis” on the island, and pointedly noted that the U.S. State Department has maintained a level-two advisory to the Dominican Republic — similar to that of countries including Spain, Denmark, and Belgium.\n\n“American tourists should feel safe and secure,” she said. “I am totally comfortable with safety level, it is one of the safest tourist destinations I have ever visited. In fact, it has now become an even safer place to come because of the initiatives.”\n\nBernstein also specifically addressed reports that tainted alcohol led to the deaths, noting that if there were a problem with alcohol there would be far more reports of deaths.\n\n“If it was alcohol people would be dropping like flies,” Bernstein said. “It is not alcohol.”\n\nEarlier this year there were multiple high-profile cases involving American tourists who died while staying in the Dominican Republic. Seven deaths have been attributed to tourists becoming ill and dying of health-related issues. The FBI is still conducting toxicology tests in three specific cases and has not yet released the results.\n\nAccording to the State Department, there has been no evidence of foul play and no sign that the deaths are connected.\n\nBefore the measures were announced, Garcia took the time to lambast the news media, saying the coverage of the deaths of the American tourists was overblown and aimed to damage the Dominican Republic’s stellar reputation as a “model” tourist country.\n\nThe State Dept. confirmed that in 2018, 13 U.S. citizens died while traveling to the Dominican Republic; the number was 17 in 2017. More than 2.7 million U.S. tourists visited the island in 2017, making the island the fourth-most popular travel destination for Americans.\n\nGarcia later said “the damage is done” from the slew of reports that focused on the island, but that Dominican Republic officials are still committed to fixing their image, with their main focus now being on the truth.\n\nAccording to InSight Crime’s 2018 Homicide Round-Up, statistics show that the Dominican Republic recorded 10.4 homicides per 100,000 people –– compared to 81.4 in Venezuela, 25 in Mexico and 11.7 in Costa Rica.", "description": "'American tourists should feel safe and secure,' an official said", "authors": ["Gina Martinez"], "top_image": "https://s.yimg.com/uu/api/res/1.2/gtSCaEadz9BbEy4ZYphRIQ--~B/aD0zMDI0O3c9NDAzMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/time_72/a1668c40aab6e01ad57295209bed2149", "published_at": "2019-09-13"}