{"pub": "yahoo", "url": "https://news.yahoo.com/enemies-seek-sow-discord-between-iran-iraq-khamenei-082610693.html", "downloaded_at": "2019-10-07 09:13:49.473807+00:00", "title": "'Enemies seek to sow discord' between Iran and Iraq: Khamenei", "language": "en", "text": "Tehran (AFP) - Iran's supreme leader Ayatollah Ali Khamenei said \"enemies\" were trying to drive a wedge between Tehran and Baghdad in a tweet on Monday following deadly unrest in neighbouring Iraq.\n\n\"#Iran and #Iraq are two nations whose hearts & souls are tied together... Enemies seek to sow discord but they've failed & their conspiracy won't be effective,\" Khamenei was quoted as saying on his office's Twitter account.\n\nState news agency IRNA said the supreme leader was reacting to recent violence in Iraq.\n\nMore than 100 people have been killed in Iraq since clashes erupted last week between protesters and security forces, the majority of them demonstrators struck by bullets.\n\nThe Iraqi authorities have accused \"saboteurs\" and unidentified snipers of targeting the protesters.\n\nTehran has close but complicated ties with Baghdad, with significant influence among its Shiite political groups.\n\nThe two countries fought a bloody war from 1980 to 1988 and Iran's influence in Iraq grew after the US-led invasion toppled veteran dictator Saddam Hussein in 2003.\n\nIran has urged its citizens planning to take part in a major Shiite pilgrimage in Iraq to delay their travel into the country over the violence.\n\nLast week, Iran shut the Khosravi border crossing with Iraq at the request of Iraqi authorities as the protests raged.\n\nThe post was reopened on Monday morning and Iranians were making their way towards holy shrines in Iraq, an official said in a report by ISNA news agency.\n\nA top military adviser to Khamenei said those behind the unrest would be unable to deter Iranian pilgrims.\n\n\"They want to scare people into not going to Arbaeen, but even if it rains arrows and stones, Hussein's lovers will not be afraid,\" Major General Yahya Rahim Safavi was quoted as saying by Tasnim news agency.\n\nIranians are heading to the Iraqi holy city of Karbala for the pilgrimage that will culminate on October 17 with the annual Arbaeen commemoration.\n\nArbaeen is one of the world's biggest religious festivals and marks the end of the 40-day mourning period for the seventh-century killing of Imam Hussein by the forces of the Caliph Yazid.", "description": "Iran's supreme leader Ayatollah Ali Khamenei said \"enemies\" were trying to drive a wedge between Tehran and Baghdad in a tweet on Monday following deadly unrest in neighbouring Iraq.  \"#Iran and #Iraq are two nations whose hearts & souls are tied together... Enemies seek to sow discord", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/40sGDehx5h1Y4LJHnORwvQ--~B/aD01Mjk7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/6f84bce8a023bdc7b1230e02e5f6e095ab0e5a3c.jpg", "published_at": "2019-10-07"}