{"pub": "yahoo", "url": "https://sports.yahoo.com/kavion-pippen-trying-own-name-033902943.html", "downloaded_at": "2019-10-10 15:52:04.949564+00:00", "title": "How Kavion Pippen is trying to make his own name in Warriors tryout", "language": "en", "text": "\"I wouldn't want to be you guys if I had to, because of all the expectations that you have to deal with.\"\n\nMichael Jordan said a lot of memorable stuff during his infamous Hall of Fame speech a decade ago. Early on, he made it clear that, while his children appeared to live enviable lives, they did not in many ways.\n\nJordan won six NBA championships alongside fellow Hall of Famer Scottie Pippen. Just like Jordan, Pippen has younger relatives -- basketball players, in fact -- who had no choice but to grow up in his shadow.\n\nScroll to continue with content Ad\n\nPippen's nephew, Kavion, is a 6-foot-10 center who recently signed with the Warriors. Much like Jordan's children, he must define his own persona outside of his notable last name.\n\n\"He was a big part of my life,\" Kavion said of his uncle (via the Mercury News). \"I looked up to him. Everyone in my area looked up to him. He was like a figure everyone looked up to and wanted to be, so it helped me out and he was kind of the father figure that I looked up to.\"\n\nScottie was a top-10 draft pick coming out of Central Arkansas. Kavion was recruited by his uncle's alma mater, but opted to attend junior college before choosing to play at Southern Illinois. It was a conscious decision to allow him to create his own separate identity.\n\n\"Just be my own person,\" Kavion said. \"Not focus on my last name.\"\n\nAfter going undrafted in 2019, Kavion now finds himself with a great opportunity in Golden State. With injuries to Willie Cauley-Stein, Kevon Looney and rookie Alen Smailagic, the Warriors needed some big-bodied reinforcements.\n\nEnter Pippen.\n\nStory continues\n\n\"The big thing is we're just so beaten up at the center spot, so we need him to help us get through camp,\" Warriors coach Steve Kerr said Tuesday of Pippen. \"He's a young and athletic kid. He's been here two days now, so he's six or seven days behind, but he's trying to get acclimated as quickly as possible. We need him because we hardly have enough bodies. It's great experience for him.\"\n\nBefore signing with the Warriors, Kavion's uncle gave him some advice.\n\n\"He said, ‘Focus in. Attain as much knowledge from the veterans here, and just play hard and get better,'\" Kavion recalled.\n\n[RELATED: Trump's Kerr remarks prove sports, politics are inseparable]\n\nWhile Pippen's chances of making the Warriors' regular-season roster are quite slim due to their salary cap restrictions, he is enjoying the opportunity nonetheless.\n\n\"Just to be here is eye-opening. It is so, so amazing. I can't believe it,\" he said. \"It still seems like all a dream.\"\n\nHow Kavion Pippen is trying to make his own name in Warriors tryout originally appeared on NBC Sports Bay Area", "description": "It can't be growing up in your uncle's shadow when he's an NBA Hall of Famer.", "authors": ["Brian Witt"], "top_image": "https://s.yimg.com/ny/api/res/1.2/ye6nx6gjbYs4bmQfiBoDgg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/RK_XzhmtyndLE_7r3BzpQA--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/csnbayarea.com/d7d25d48dd33efba4fc14540c53fb1b7", "published_at": "2019-10-10"}