{"pub": "cbs", "url": "https://cbsnews.com/news/michelle-kolts-arrest-florida-obsessed-with-attacks-arrested-pipe-bombs-2019-10-04", "downloaded_at": "2019-10-04 23:44:44.694892+00:00", "title": "Florida woman \"consumed\" by Oklahoma City and Columbine attacks arrested with arsenal of weapons", "language": "en", "text": "Tampa, Florida — Police were called to a Tampa-area home where inside they discovered an arsenal of two dozen metal-stuffed pipe bombs and fuses as well as a cache of guns and other weapons, according to Hillsborough County Sheriff Chad Chronister.\n\nChronister said \"it's frightening to think of the catastrophic damage and loss of life\" that could have been done with the weapons.\n\nTwenty-seven-year-old Michelle Kolts who works at this maintenance supply business was arrested early Friday morning. She's charged with 24 counts of making a destructive device with intent to harm. There were also books and DVDs focused on murder, mass killings, domestic terror and bomb-making found in the home. Kolts lives with her parents, who turned her in.\n\n\"Every law enforcement officer in the world always says if you see something, say something,\" Chronister said. \"I couldn't applaud these parents more for having the courage to do just that.\"\n\nWeapons found in Michelle Kolts' home. Hillsborough County Sheriff's Office\n\nInvestigators say Kolts was obsessed with the Oklahoma City bombing and the Columbine mass shooting.\n\nLast year, police went to the Kolts' home after receiving a tip that she had placed an online order for material on pipe bomb construction. But they determined she was not a threat. Kolts' parents said Friday she is undergoing mental health treatment.\n\nKolts is now being held in the county jail.", "description": "Suspect Michelle Kolts, 27, lives with her parents, who turned her in", "authors": ["Courtney Zubowski"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/10/04/79c29bec-d6f5-4401-915f-e94dce31798a/thumbnail/1200x630/0cb8a9b91d80055df48963ecc5f4a925/credit-hillsborough-county-sheriffs-office-6.jpg", "published_at": "2019-10-04"}