{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/is-scott-leaving-hollyoaks-and-does-he-die-11012755", "downloaded_at": "2019-10-30 23:24:40.309231+00:00", "title": "Is Scott leaving Hollyoaks and does he die?", "language": "en", "text": "Scott and Mitchell have been growing closer… (Picture: LIMEPICTURES)\n\nScott Drinkwell (Ross Adams) and Mitchell Devereaux (Imran Adam) have been left in a dire situation after a horrifying disaster in Hollyoaks’ infamous stunt week.\n\nIn previous scenes, Tony (Nick Pickard) tried to escape from the murderous Breda’s (Moya Brady) car as she drove him from where she’d been holding him captive back into town.\n\nHis escape attempt proved to be enough of a distraction for her that she crashed her car into a crane, which in turn caused the crane – which was on unstable ground as it was – to collapse, putting Mitchell and Scott in danger…\n\nIs Scott leaving Hollyoaks and does he die?\n\nWe aren’t able to say whether or not Scott – or indeed anyone else caught up in the danger of the crane collapse – will make it out of this ordeal alive.\n\nBefore the crane fell, girders came crashing down to earth when a drunken and despairing Luke (Gary Lucy) climbed into the machinery.\n\nAdvertisement\n\nAdvertisement\n\nThese girders crashed into the florists in which Scott, dressed as Anita, and Mitchell were secretly kissing.\n\nWith Scott having been left for dead, only time will tell if he survives.\n\nAs bystanders begin to gather at the scene, including Mitchell’s girlfriend Cleo (Nadine Mulkerrin), will Mitchell’s romance with Scott be cut tragically short?\n\nEven if they do survive, what will they tell Cleo about why they were in the florists together in the first place?\n\nHollyoaks continues tonight at 7pm on E4.\n\nMORE: Hollyoaks spoilers: A horrifying disaster leaves several residents for dead\n\nMORE: Hollyoaks spoilers: James Nightingale plots revenge as Harry Thompson is laid to rest\n\nAdvertisement Advertisement", "description": "Scott Drinkwell and Mitchell Devereaux have been left in a dire situation after a horrifying disaster in Hollyoaks' infamous stunt week.", "authors": ["Aidan Milan"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/09/PRI_85485825_1572451831.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}