{"pub": "independent", "url": "https://independent.co.uk/sport/football/womens_football/chelsea-women-tottenham-wsl-attendance-figures-manchester-derby-fixtures-a9097286.html", "downloaded_at": "2019-09-09 10:25:18.716232+00:00", "title": "The WSL returns as women’s football shows signs of progress after World Cup", "language": "en", "text": "There will come a time when a big crowd at a women’s football match will be a footnote, not a headline. That will be the time when the sport can be truly said to have arrived in England’s sporting landscape.\n\nThat time is still some years off so the focus at Stamford Bridge on Sunday was as much on the stands as the pitch. How many of the 42,000 who had claimed a free ticket would turn up? Would it eclipse the 31,213, most of whom paid, that watched the first Manchester derby of the professional era on Saturday, in the process smashing the old WSL record of 5,265 set by Brighton-Arsenal at the Amex in May?\n\nIn the event 26,564 strolled off the Kings Road to watch Chelsea Women defeat their Tottenham counterparts 1-0, meaning 15,000 ticket holders found alternative entertainment. Nevertheless, the attendance still shattered Chelsea’s previous best of 4,670, set in a Champions League semi-final five months ago, and if the club were disappointed they did a good job of hiding it.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nEmma Hayes, Chelsea’s manager, said: “Just as kick off happens and the Chelsea fans make an atmosphere the Spurs fans start chanting. I thought, ‘Happy days. This is what we worked for’. An atmosphere, people coming to the game. We can be cynical, and say ‘free tickets’, but we have built on the momentum of the World Cup.”\n\nCrowds were up elsewhere too, albeit not so spectacularly. Bristol City, playing at Ashton Gate, pulled in 3,041 for the goalless draw with Brighton, more than five times last season’s average. The Birmingham-Everton match at Solihull Moors’ Damson Park produced a 45 per cent increase on the identical opening fixture last year. Liverpool, at Tranmere’s Prenton Park, nearly trebled their average at the same venue last year while WSL champions Arsenal had a 53 per cent rise on last year’s opener. That said, none of those three gates reached 2,000.\n\nShape Created with Sketch. Women's World Cup best pictures Show all 32 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Women's World Cup best pictures 1/32 Womens World Cup best pictures AFP/Getty Images 2/32 Womens World Cup best pictures Getty Images 3/32 Womens World Cup best pictures AFP/Getty Images 4/32 Womens World Cup best pictures Getty Images 5/32 Womens World Cup best pictures AFP/Getty Images 6/32 Womens World Cup best pictures Getty Images 7/32 Womens World Cup best pictures Getty Images 8/32 Womens World Cup best pictures Getty Images 9/32 Womens World Cup best pictures Getty Images 10/32 Womens World Cup best pictures Getty Images 11/32 Womens World Cup best pictures AFP/Getty Images 12/32 Womens World Cup best pictures AFP/Getty Images 13/32 Womens World Cup best pictures AFP/Getty Images 14/32 Womens World Cup best pictures AFP/Getty Images 15/32 Womens World Cup best pictures AFP/Getty Images 16/32 Womens World Cup best pictures AFP/Getty Images 17/32 Womens World Cup best pictures AFP/Getty Images 18/32 Womens World Cup best pictures AFP/Getty Images 19/32 Womens World Cup best pictures AFP/Getty Images 20/32 Womens World Cup best pictures AFP/Getty Images 21/32 Womens World Cup best pictures AFP/Getty Images 22/32 Womens World Cup best pictures AFP/Getty Images 23/32 Womens World Cup best pictures AFP/Getty Images 24/32 Womens World Cup best pictures AFP/Getty Images 25/32 Womens World Cup best pictures AFP/Getty Images 26/32 Womens World Cup best pictures AFP/Getty Images 27/32 Womens World Cup best pictures AFP/Getty Images 28/32 Womens World Cup best pictures AFP/Getty Images 29/32 Womens World Cup best pictures AFP/Getty Images 30/32 Womens World Cup best pictures AFP/Getty Images 31/32 Womens World Cup best pictures AFP/Getty Images 32/32 Womens World Cup best pictures Australia celebrate beating Brazil in their Group C tie Getty 1/32 Womens World Cup best pictures AFP/Getty Images 2/32 Womens World Cup best pictures Getty Images 3/32 Womens World Cup best pictures AFP/Getty Images 4/32 Womens World Cup best pictures Getty Images 5/32 Womens World Cup best pictures AFP/Getty Images 6/32 Womens World Cup best pictures Getty Images 7/32 Womens World Cup best pictures Getty Images 8/32 Womens World Cup best pictures Getty Images 9/32 Womens World Cup best pictures Getty Images 10/32 Womens World Cup best pictures Getty Images 11/32 Womens World Cup best pictures AFP/Getty Images 12/32 Womens World Cup best pictures AFP/Getty Images 13/32 Womens World Cup best pictures AFP/Getty Images 14/32 Womens World Cup best pictures AFP/Getty Images 15/32 Womens World Cup best pictures AFP/Getty Images 16/32 Womens World Cup best pictures AFP/Getty Images 17/32 Womens World Cup best pictures AFP/Getty Images 18/32 Womens World Cup best pictures AFP/Getty Images 19/32 Womens World Cup best pictures AFP/Getty Images 20/32 Womens World Cup best pictures AFP/Getty Images 21/32 Womens World Cup best pictures AFP/Getty Images 22/32 Womens World Cup best pictures AFP/Getty Images 23/32 Womens World Cup best pictures AFP/Getty Images 24/32 Womens World Cup best pictures AFP/Getty Images 25/32 Womens World Cup best pictures AFP/Getty Images 26/32 Womens World Cup best pictures AFP/Getty Images 27/32 Womens World Cup best pictures AFP/Getty Images 28/32 Womens World Cup best pictures AFP/Getty Images 29/32 Womens World Cup best pictures AFP/Getty Images 30/32 Womens World Cup best pictures AFP/Getty Images 31/32 Womens World Cup best pictures AFP/Getty Images 32/32 Womens World Cup best pictures Australia celebrate beating Brazil in their Group C tie Getty\n\nMarketing is a big factor in a sport still gaining awareness and Chelsea made an effort with an eight-page supplement in Friday’s London Evening Standard and a series of activities in and around the ground, including a DJ set by Marvin Humes of JLS. The result was a decent atmosphere that combined elements of Big Day Out excitement with more traditional chanting and cheering. “We have a blueprint of how to market this game which we’ll pass on,” said Hayes.\n\nThe match itself was similar to the Manchester derby, a promoted side acquitting themselves well against title contenders and only beaten by a stunning goal. After Caroline Weir’s screamer at the Etihad for City, it was Bethany England, newly capped by her namesake nation, who rifled in a shot from fully 25 yards.\n\nAs only four minutes had elapsed, the fear was Spurs would concede six or seven which even Hayes said would have been bad for the game, but they hung in, settled, then produced threatening attacks of their own. Chelsea should have won by more – Drew Spence and impressive new signing Guro Reitan even hit the woodwork in the same incident. But Tottenham’s performance highlighted the WSL’s growing depth with central defenders Jenna Schillaci and Hannah Godfrey excellent and keeper Becky Spencer outstanding.\n\nSchillaci joined Spurs as a teenager in 2000 when they were in the Greater London League and players turned up to train already in kit as the changing facilities were so grim. And they paid subs to play.\n\nBack then even few close relatives watched the team. Now strangers wear player names on the back of their shirts. That is a measure of how far Spurs, and the sport, has come. “If I look back five years I didn’t even think I’d still be playing,” added the 35-year-old, “never mind leading the team out in front of a crowd like this.”\n\nFuture event matches include West Ham-Spurs at the London Stadium (29 September) and Spurs-Arsenal at the new Tottenham stadium (17 November). Given the venue, the latter match could establish a new WSL attendance record. More significant will be the crowds at club’s regular home grounds on Premier League weekends as the season wears on, the weather declines, and the nights draw in.\n\nChelsea’s next match is at their usual home of Kingsmeadow, which they share with AFC Wimbledon, against West Ham on 22 September. If a fifth of yesterday’s crowd turn up Chelsea will sell-out – but will they? Achieving that, on a regular basis, is the club’s next target.", "description": "There will come a time when a big crowd at a women’s football match will be a footnote, not a headline. That will be the time when the sport can be truly said to have arrived in England’s sporting landscape.", "authors": ["Glenn Moore"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/09/10/chelsea-women.jpg", "published_at": "2019-09-09"}