{"pub": "fox", "url": "https://foxbusiness.com/technology/venmo-texting-scam-what-to-know", "downloaded_at": "2019-09-18 07:25:12.694821+00:00", "title": "Venmo texting scam: Here’s what you need to know about the new con", "language": "en", "text": "If you use Venmo, there's a new scam to watch out for.\n\nContinue Reading Below\n\nThe scam has been sending Venmo users text messages, working under the guise of the same colors and fonts of the mobile payment service’s app, officials have warned.\n\nPeople have received texts saying that their accounts are about to be charged, but if they want to cancel the withdrawal, they must log into their accounts, according to a Facebook post from the Massachusetts-based Dighton Police Department.\n\nAccording to the police department, the text allows users to sign in using any phone number and password but asks for personal financial information, including a bank card, to verify the identity of the user.\n\n“Do not use the pages provided by the text to enter into your account,” the Dighton Police Department said in its post. “Go to your Venmo app or use the internet site.”\n\nAdvertisement\n\nOfficials are warning of a new scam affecting Venmo users. (Photo Illustration by Omar Marques/SOPA Images/LightRocket via Getty Images)\n\nOfficials also warned that people who already entered their information should let their bank or credit card lender know.\n\nVenmo, which is owned by PayPal, told FOX Business that customers who think they may have been targeted by scammers posing as Venmo should contact spoof@paypal.com.\n\n\"The security of our customer's account information is always a top priority,\" a spokesperson told FOX Business in an emailed statement. \"When we become aware of phishing scams, we proactively work with law enforcement agencies, industry partners and use our own systems to detect fraud and mitigate the issue.\"\n\nTicker Security Last Change %Chg PYPL PAYPAL HOLDINGS INC. 107.50 +0.98 +0.92%\n\n\"We encourage customers to always be vigilant of who the text, social media message or email is from to protect themselves when clicking links or opening attachments,\" the spokesperson added.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nThe company also has additional information on how customers can protect their information on its website.", "description": "A new scam is going around where Venmo users are being asked to send personal financial information over text, officials have warned.", "authors": ["Ann Schmidt"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/06/0/0/venmo-Getty.jpg?ve=1&tl=1", "published_at": "2019-09-18"}