{"pub": "independent", "url": "https://independent.co.uk/news/uk/home-news/abortion-northern-ireland-stormont-petition-dup-a9161886.html", "downloaded_at": "2019-10-21 07:37:40.697623+00:00", "title": "Northern Ireland abortion law: DUP to protest against decriminalisation as Stormont recalled", "language": "en", "text": "The Stormont Assembly will sit for the first time in almost three years on Monday to discuss the decriminalisation of abortion in Northern Ireland after a petition prompted the gathering.\n\nMPs resoundingly backed the right to abortion in Northern Ireland in a vote in July and the procedure will be decriminalised there unless a devolved executive at Stormont is restored by Monday.\n\nThe petition is an eleventh-hour bid to stop the law – which even bans abortions in cases of rape or incest – being changed.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBut the meeting is not thought to be able to stop abortion from being decriminalised and politicians have dismissed it as a publicity stunt engineered by the DUP.\n\nThe first task of the assembly is believed to be electing a new speaker so it remains to be seen whether they will even be capable of debating abortion reform. The assembly has not sat for almost three years due to the ongoing impasse between unionist and nationalist parties.\n\nShape Created with Sketch. Northern Ireland abortion protest in Westminster Show all 7 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Northern Ireland abortion protest in Westminster 1/7 Derry Girls cast members Siobhan McSweeney and Nicola Coughlan (right) join MPS and women impacted by Northern Ireland's strict abortion laws PA 2/7 Heidi Allen (second right) joins the protest PA 3/7 A luggage tag on a suitcase, symbolising the women who travel from Northern Ireland to England for terminations PA 4/7 The campaigners march across Westminster Bridge PA 5/7 Counter-protesters Rebecca Morgan (left) and her daughter Helen, one, demonstrate in favour of Northern Ireland's current laws Getty Images 6/7 Protesters supporting Northern Ireland's abortion laws at Parliament Square Getty Images 7/7 Demonstrators pull suitcases to symbolise the women who travel from Northern Ireland to England for a termination AFP/Getty Images 1/7 Derry Girls cast members Siobhan McSweeney and Nicola Coughlan (right) join MPS and women impacted by Northern Ireland's strict abortion laws PA 2/7 Heidi Allen (second right) joins the protest PA 3/7 A luggage tag on a suitcase, symbolising the women who travel from Northern Ireland to England for terminations PA 4/7 The campaigners march across Westminster Bridge PA 5/7 Counter-protesters Rebecca Morgan (left) and her daughter Helen, one, demonstrate in favour of Northern Ireland's current laws Getty Images 6/7 Protesters supporting Northern Ireland's abortion laws at Parliament Square Getty Images 7/7 Demonstrators pull suitcases to symbolise the women who travel from Northern Ireland to England for a termination AFP/Getty Images\n\nNorthern Ireland peer Baroness O’Loan and anti-abortion campaign organisation Both Lives Matter are behind the petition which garnered signatures from 27 DUP MLAs, TUV leader Jim Allister, Ulster Unionist leader Robin Swann and his fellow party members Robbie Butler and Roy Beggs.\n\nChris Hazzard, a Sinn Fein MP, branded it a “pantomime” – saying his party would not be attending the discussion.\n\n“Arlene Foster thinks that she is going to walk into Stormont, all of the parties are going to follow her behind, and we’re all going to somehow dance to her tune,” he told the BBC’s The View programme. “Sinn Fein certainly won’t be playing that game.”\n\nThe DUP have consistently voiced their anger about the landslide vote to liberalise abortion law – arguing it should have been an issue for people in Northern Ireland to decide via their elected representatives.\n\nThere is currently a ban on abortion in almost all cases in Northern Ireland, and women seeking a termination can face life imprisonment. Women can only terminate their pregnancy in Northern Ireland if there is either a risk to their life or of them suffering permanent mental or physical harm.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nKatherine O’Brien, of the British Pregnancy Advisory Service (BPAS), the UK’s largest abortion provider, said: “Every day at BPAS, our staff care for women from Northern Ireland who have been forced to travel overseas, away from their loved ones, to access the essential healthcare that is denied to them at home.\n\n“For those women making that lonely journey today, and the thousands who have already done so, these last-minute manoeuvres will be particularly painful to witness. These women are being used as a political football by politicians who refuse to acknowledge the suffering their actions are causing to their constituents. It is simply cruel.\n\n“Rulings from the UN Committee for the Elimination of Discrimination Against Women have made it clear the UK government has a legal duty to decriminalise abortion in Northern Ireland under their human rights obligations. The people of Northern Ireland support abortion law reform, and clinicians desperately want to be able to provide the care their patients need. For the sake of the women of Northern Ireland, we hope that this attempt to block safe, legal abortion care does not succeed.”\n\nEarlier in the month, a High Court in Belfast ruled Northern Ireland’s strict abortion law infringes Britain’s human rights obligations. The case was brought by Sarah Ewart, who was forced to travel to England for an abortion after being told there was no way her unborn child would survive.\n\nMPs also voted to legalise same-sex marriage in Northern Ireland in July and laws around this will also change on Monday unless devolution is restored.", "description": "The Stormont Assembly will sit for the first time in almost three years on Monday to discuss the decriminalisation of abortion in Northern Ireland after a petition prompted the gathering. MPs resoundingly backed the right to abortion in Northern Ireland in a vote in July and the procedure will be decriminalised there unless a devolved executive at Stormont is restored by", "authors": ["Maya Oppenheim"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/01/08/17/Stormont.jpg", "published_at": "2019-10-21"}