{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/video/trump-tweets-fighting-syria-66265797", "downloaded_at": "2019-10-14 23:25:41.279598+00:00", "title": "Trump tweets about fighting in Syria Video", "language": "en", "text": "Transcript for Trump tweets about fighting in Syria\n\nIn guys on we move on to Washington want to bring in Mona coasts are Abdi. At the white house with more and Mona good to see you you know the president's stance on Twitter. Is that he doesn't want to be engaged in these never ending wars but is this the only approach. Right Kimberly as he mentioned the president is doubling down on his decision. To pull US troops out of northern Syria this morning declaring it never ending wars will end the president has betrayed the Middle East. As an area a riddled with perpetual conflict despite years of American military involvement in financial investment. He also stated that we are not going into another war between people. Live in fighting with each other for 200 years now isn't the message came in an early morning tweet where the president also question. If people really think the US should go to war with. NATO member Turkey instead the president appears to be set. Ongoing distinctions route tweeting big sanctions on Turkey coming soon now his administration threat and sit. Devastate Turkey's economy if even a single ice as prisoners escaped. But we heard Ian say it there and also the AP reporting that hundreds of ice to supporters have done just that over the weekend. And because of prisons that have been a left on guarded but the president also suggesting this morning that. Perhaps. Kurdish forces are purposefully releasing some these prisoners to and to drag the US. Into this conflict with Turkey again the Kurds a longstanding ally with the United States. Yen you've been talking to people on the radio calls what are people most concerned with in regards in the situation. So what I'm hearing is a lot of questions regarding exactly what are these new sanctions people in L the president. And his administration is threatening that they are able to cripple Turkey's economy devastate their economy. Noting that they are putting a financial institutions or any person or entity related to Turkey on notice. But his administration has also been. Very vague about what these new sanctions exactly our Steve minutes and was on this week would Jon Karl just yesterday saying that. The sanctions could possibly be small and it could also be maximum pressure insinuating that they could cripple turkeys economy. But as for the delay in the nation's sad that this situation is he called a complicated and a developing situation. And also it's not clear then. What line Turkey will have to caught with took cross in order to get the truck administration to actually imposed. The sanctions and again what range of from small sets maximum pressure they will. And post conflict. RA Mona car sat costar Abby right there at the White House with the updates there thank you.\n\nThis transcript has been automatically generated and may not be 100% accurate.", "description": "President Donald Trump tweeted that he would sanction Turkey and that", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/191014_abcnl_debrief_mona_hpMain_16x9_992.jpg", "published_at": "2019-10-14"}