{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/09/nationals-are-outs-away-nlcs-so-how-will-they-get-them", "downloaded_at": "2019-10-09 12:02:38.745140+00:00", "title": "The Nationals are 27 outs away from the NLCS. How will they get them?", "language": "en", "text": "\n\nDaniel Hudson has been the anchor of the Nationals’ pitching plans this postseason. (Julio Cortez/Associated Press)\n\nLOS ANGELES — It is rare for a manager to publicly lay out an ideal pitching plan and, some hours later, watch it unfold it exactly how he wished. And it’s especially rare in October.\n\nBut that’s what happened at Nationals Park on Monday night. Nationals Manager Dave Martinez described what he saw as a perfect world: seven innings from Max Scherzer. The ace hands the ball to relievers Sean Doolittle and Daniel Hudson. Boom. Ballgame. Then Scherzer went seven, Doolittle and Hudson handled the final six outs and, with a 6-1 win, the Nationals forced a decisive Game 5 against Dodgers in Los Angeles on Wednesday night. Just how Martinez drew it up.\n\nNow the manager has one more puzzle on his hands. He has Stephen Strasburg starting on full rest. Strasburg dominated the Dodgers in Game 2, striking out 10 in six innings, and has a career 0.64 ERA in the postseason. But that win was polished off by a combination of Scherzer, Doolittle and Hudson. It’s almost certain that Scherzer will be unavailable just one full day after throwing 109 pitches. The Nationals’ master plan has been very simple: Avoid using anyone but Scherzer, Strasburg, Patrick Corbin, Aníbal Sánchez, Doolittle or Hudson on the mound. And the reason is apparent in the results.\n\n[In this Game 5, the Nationals can embrace possibility, not fear failure]\n\nIn the Nationals’ two wins over the Dodgers, only Strasburg, Scherzer, Doolittle and Hudson have pitched. The same was true for the wild-card game, in which Scherzer, Strasburg and Hudson completed nine innings. But in their two losses to Los Angeles, Sánchez and Corbin started, and Corbin, Wander Suero, Fernando Rodney, Tanner Rainey and Hunter Strickland have struggled out of the bullpen. So the pressing question remains: How will the Nationals record the 27 outs needed to advance? Which pitchers could lead them to their first NLCS appearance?\n\nFirst, before the bullpen is even considered, Martinez can sub Strasburg’s name into his “perfect world” theory. If he can go seven innings against the Dodgers’ daunting lineup, then Doolittle and Hudson would be set up for the finish. But that’s still a big expectation in the playoffs. Strasburg was near perfect in Game 2, setting down the first 14 batters he faced, and was at 85 pitches when he exited. It’s conceivable that he could have gone deeper if he weren’t on short rest, and if the Nationals weren’t planning to pitch Doolittle against the Dodgers’ best lefties and use Scherzer in the eighth.\n\nStrasburg is capable of handling a heavy workload. He topped 100 pitches in 22 of his 33 starts this season. He topped 110 in six of them. If he’s going well — and history suggests that he will be — then Martinez will have critical decisions to make in the later innings. The offense will be up against Walker Buehler and, behind him, the Dodgers’ entire pitching staff. That includes Clayton Kershaw out of the bullpen. The margin for error will be razor thin.\n\n“It’s something that you train for, you dream about as a kid, and you want to have those opportunities to just see how your stuff stacks up,” Strasburg said Monday of his October success. “When you’re in the moment and stuff it’s a great feeling, just going out there and competing against the best.”\n\nThe Dodgers are able to stack their lineup with left-handed threats. In Game 2, Manager Dave Roberts started Joc Pederson, Cody Bellinger, Max Muncy, Corey Seager and Gavin Lux against Strasburg. Bellinger and Muncy hit fourth and fifth, leading Martinez to use Doolittle to match up with them in the seventh. Against Scherzer in Game 4, Roberts went with Pederson, Muncy, Bellinger, Seager, Matt Beaty and Lux. That put a lefty in the Nos. 1, 2, 4, 5, 6 and 7 spots in their order. If Roberts goes with a similar number of lefties from the beginning, then there’s a good chance Doolittle sees right-handed pinch hitters off the bench. If he goes with a healthier lefty/righty balance, then late-game matchups get a bit more complicated.\n\n[Ovechkin and Zimmerman, D.C.’s longest-running bromance, stole the show at Nats Park]\n\nAnd this is where another interesting subplot comes in: Martinez could view Corbin as an option if Strasburg doesn’t get the ball to Doolittle and Hudson. His most logical spot is to face lefties at any point before the eighth. Doolittle is the logical option against Muncy, Bellinger and Seager. Both he and Hudson are able to pitch more than one inning. But Martinez has yet to ask them to combine for more than two innings.\n\nCorbin had a disastrous relief appearance in Game 3, giving up six runs while Roberts countered with three righties off the bench. Having to use him, or Sánchez, would likely mean Strasburg didn’t pitch as Washington hoped. But it’s likely a smarter contingency plan than leaning on Rainey, Suero, Rodney or Strickland, who have all proven unreliable in this series. Corbin is still the lefty who had a 3.25 ERA in 33 starts this year. He will be two days removed from throwing 35 pitches. Sánchez’s arsenal of off-speed pitches flustered the Dodgers in five sharp innings of Game 3. He will be two days removed from throwing 87 pitches.\n\nMartinez has expressed, repeatedly, that the Nationals will do anything to win. They will worry about tomorrow later. All hands are on deck. They got to Game 5 by avoiding the pitchers who have weighed them down. They got here because Scherzer and Strasburg carried out creative winning formulas. Now, with the season on the line, they just need to figure out one more.\n\nRead more about the Nationals:\n\nRyan Zimmerman’s goose-bump moment sends Nats to L.A. with Stephen Strasburg and plenty of hope\n\n‘It’s my job’: Trea Turner serves as Nationals’ rally starter in Game 4 win\n\nRyan Zimmerman’s home run will be most remembered, but these four at-bats set the stage perfectly", "description": "Stephen Strasburg will start Game 5 against the Dodgers on Wednesday night. Washington will need a big performance.", "authors": ["Jesse Dougherty", "Reporter Covering The Washington Nationals.", "October At Am", "Jesse Dougherty Covers The Washington Nationals."], "top_image": "https://www.washingtonpost.com/resizer/lCdi-wfJYQDdjOp9OzMYtZJB0l0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/7DL2B7HJOEI6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-09"}