{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/23/a-scalable-plan-for-onboarding-your-first-500-employees", "downloaded_at": "2019-10-23 23:21:21.875831+00:00", "title": "A scalable plan for onboarding your first 500 employees – TechCrunch", "language": "en", "text": "Employee onboarding isn’t all desk balloons and company T-shirts — it’s a critical moment when new hires begin integrating into the culture and workflows of their new company. So, it’s no surprise that one of the most frequently-asked questions among first-time founders is how to run a successful onboarding process.\n\nIt’s a delicate balance. Founders don’t want to immediately throw new employees into the deep end. But, at the same time, they must help recent hires develop an understanding of the company’s history, vision, structure and goals, as well as introduce them to all the tools, processes, projects and information they’ll need to get started. When it’s done well, employees should find the process professional, rewarding and motivating.\n\nResearch shows that 28% of turnover happens during the first 90 days of employment and that structured onboarding programs increase retention by 82%. In my own experience working in recruiting at tech companies Twilio and AirBnb and in talent for venture firms Andreessen Horowitz and Lerer Hippeau, I’ve seen this to be true first-hand.\n\nOnboarding looks different at each stage of a growing startup and responsibilities change hands over time. Here’s a breakdown of who’s typically in charge of the process at each phase of growth in a startup’s journey, as well as a pro tip from a company currently operating at that stage.\n\n0-10 employees\n\nIn the very early days, the founder or CEO is the appropriate person to lead employee onboarding. It’s usually she or he that gave the employee the initial offer. This person should make sure that new employees have guidance regarding how to find their place within the lean team. The new hire should be introduced to everyone, shown how employees communicate within the company, be given the rundown on policies, shown where to sit and helped with their computer and benefits setup. Plus, they should receive a personalized, warm welcome that makes them excited to be part of the brand-new venture.\n\n“The little things matter: the welcome email, the Slack announcement that it’s their first day, bios including fun facts about them, the company swag on their desk, buying their favorite snack for the office and more all help to make them feel welcomed, which helps support a successful onboarding process,” says Florent Peyre, co-founder of Small Door, a tech-enabled veterinary practice.\n\n10-50 employees\n\nAt this stage, a startup is adding real headcount and its leadership team should be thinking about hiring its first dedicated HR or People person. After the company brings on a recruiter or HR manager, she or he can take over the bulk of the onboarding responsibilities, which should begin before new staffers’ official start dates.\n\n“One typical mistake is thinking that onboarding starts on someone’s first day,” says Nora Apsel, co-founder of online mortgage broker Morty. “In the week prior to starting, we send new teammates an onboarding document customized to their role which includes everything from resources on the finance and mortgage industry to the services that we use at Morty, what their first week will look like and who on the team they’ll be working with.”\n\n50-100 employees\n\nOnce a company starts approaching 100 employees, its HR leader will likely need additional support. That’s when it’s time to make a second HR hire—typically an HR assistant or coordinator. She or he will handle administrative tasks such as managing the HRIS (Human Resource Information System), filing paperwork, helping run onboarding for all new hires and assisting with recruiting efforts, such as posting open roles.", "description": "Employee onboarding is a critical moment when new hires begin integrating into the culture and workflows of their new company.", "authors": ["Amanda Mulay", "Amanda Mulay Is The Senior Talent Manager At Lerer Hippeau", "Where She Helps Connect Founders With Top-Tier Talent. She Previously Held Talent Roles At Andreessen Horowitz"], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/GettyImages-695810000.jpg?w=553", "published_at": "2019-10-23"}