{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7551621/San-Jose-cops-hunt-thieves-mistook-bag-four-snakes-lizard-camera-equipment.html", "downloaded_at": "2019-10-09 01:20:51.249591+00:00", "title": "San Jose cops hunt thieves who 'mistook a bag of four snakes and a lizard for camera equipment'", "language": "en", "text": "Evangelical leader Jerry Falwell has settled a lawsuit with a former pool boy at Miami's Fontainebleau hotel who claimed he was promised a stake in a 2013 real estate deal involving the $4.7million purchase of Miami Hostel.\n\nGordon Bello, 28 – now an legislative aide for the Miami-Dade County Commission - obtained an undisclosed 'monetary sum' after he claimed in a 2017 lawsuit that he and his builder father, Jett, gave Falwells the idea after they were introduced by his high school friend Giancarlo Granda.\n\nGordon said in the lawsuit that he started a personal relationship with Rebecca Falwell after meeting her in 2012 at the Loews Miami Beach hotel and while Granda was given a 25 percent stake in the business - and even flew on corporate jets with them – he was left out.\n\nJerry Falwell has settled a lawsuit with a former pool boy at a Miami hotel who claimed he was promised a stake in the Miami Hostel on South Beach after meeting and forming a personal relationship with Rebecca Falwell (left). Daughter Caroline appears on August 1, 2018\n\nMiami Hostel was purchased for $4.7million in 2013 and is situated on South Beach, Florida\n\nFalwell's legal team had argued Bello had no emails, texts or documents to prove their case.\n\nGordon Bello claimed in a 2017 lawsuit that he and his builder father, Jett, gave the Falwells the idea for the hostel after they were introduced by his high school friend\n\nBello and his father had changed their names from Jesus Fernandez Jr. and Sr in 2016 and claim it was 'due to a matter directly related to the subject matter of this lawsuit'.\n\nThe father told the Miami Herald the decision was based on 'major concerns' and those concerns were 'based on threats'.\n\nThe settlement came after last month students from Liberty University in Lynchburg, Virginia, protested in the wake of news reports containing allegations that Mr Falwell, the school president, improperly benefited from the institution and disparaged students in emails.\n\nStudents joined together at the private evangelical university known for being an influential hub in conservative politics and held up signs calling for accountability and an investigation.\n\nGiancarlo Granda (left) was given a 25 percent stake but the Bellos got nothing in the deal\n\nFalwell's lawyer declined to comment but said: 'At this juncture, there remains judicial labor to be undertaken in the case and therefore I abide by my policy to refrain from discussing pending litigation'\n\nLiberty was founded in 1971 by Jerry Falwell Sr. with just 154 students. It now boasts an enrollment of more than 100,000, including those in its massive online education program.\n\nFalwell Jr.'s early and ardent support of President Donald Trump created a rift on campus during the presidential campaign and has sparked controversy since.\n\nFalwell's lawyer, Joshua Spector, declined to comment on Monday telling the Herald: 'At this juncture, there remains judicial labor to be undertaken in the case and therefore I abide by my policy to refrain from discussing pending litigation.'\n\nStudents at Liberty University gathered to protest in the wake of news articles alleging that school president Jerry Falwell Jr. 'presides over a culture of self-dealing' and improperly benefited from the institution", "description": "Jerry Falwell purchased Miami Hostel for $4.7million in 2013, a year after he and Rebecca Falwell met Gordon Bello who worked at the Fontainebleau hotel in Florida.", "authors": ["Leah Simpson For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/21/19461654-0-image-a-52_1570567974181.jpg", "published_at": "2019-10-08"}