{"pub": "washingtonpost", "url": "https://washingtonpost.com/realestate/craving-a-home-with-a-history-these-10-historic-houses-may-be-for-you/2019/09/26/5a13a244-dca7-11e9-bfb1-849887369476_story.html", "downloaded_at": "2019-10-01 11:43:59.841460+00:00", "title": "Craving a home with a history? These 10 historic houses may be for you.", "language": "en", "text": "$6.5 million\n\n3327 N St. NW, Washington 20007\n\n5 bedrooms, 9 bathrooms.\n\nSquare footage: 7,175.\n\nLot size: 0.10 acre.\n\nFeatures: The 1817 Federal house, built by Col. John Cox, is part of Cox’s Row — a group of five houses considered one of Georgetown’s finest examples of Federal-period architecture. The home’s facade, with its dormers and decorative swags in recessed panels, is registered by the Foundation for the Preservation of Historic Georgetown. The double parlor has two fireplaces with Egyptian marble mantels and two Tiffany chandeliers. The house has two staircases and an elevator. The tiles in the garden room were reclaimed from a renovation of the White House in the 1800s. The private outdoor space behind the house resembles an English garden and has an ornamental fish pond.\n\nListing agent: Margaret Heimbold, Long & Foster.\n\n$695,000\n\n9205 Marshall Corner Rd., Pomfret, Md. 20675\n\n5 bedrooms, 5 bathrooms.\n\nSquare footage: 3,335.\n\nLot size: 4.89 acres.\n\nFeatures: Pleasant Hill was constructed and expanded by the Spalding family, a prominent Charles County family who owned the property from 1713 to 1911. John Spalding bought 200 acres in 1713. His grandson Basil Spalding built the basement and first floor of the main house circa 1760. “Although Pleasant Hill has changed over time, the building still retains integrity of location, design, setting, workmanship, feeling and association,” wrote Betty Bird, an architectural historian, in 1997 when submitting the registration form for its inclusion on the National Register of Historic Places. A west wing and hyphen were added to the home in 1992.\n\nListing agent: Gary Gestson, Long & Foster.\n\n$1.2 million\n\n605 E. Beverley St., Staunton, Va. 24401\n\n7 bedrooms, 7 bathrooms.\n\nSquare footage: 6,751.\n\nLot size: 1.31 acres.\n\nFeatures: Oakdene was built in 1893 for Edward Echols, a former lieutenant governor of Virginia and president of National Valley Bank. When nominating Oakdene for the National Register of Historic Places, H. Bryan Mitchell, executive director of the Virginia Historic Landmarks Commission, wrote, “This visually arresting house represents the late 19th-century Queen Anne style at its freest and most imaginative.” The house retains many of its period features, including leaded glass windows, an oak-paneled library, pocket doors, embrasured shutters and a call-bell system used to summon the butler. An elevator was added in the 1960s.\n\nListing agents: Jenny Mitchell and Beverly Stermer, Nest Realty.\n\n$3 million\n\n700 S. Juniper St., Escondido, Calif. 92025\n\n4 bedrooms, 3 bathrooms.\n\nSquare footage: 3,200.\n\nLot size: 0.45 acre.\n\nFeatures: The 1896 Queen Anne Victorian is the most ornate and decorative Queen Anne in Escondido. The house was home to many prominent San Diegans, including inventor H.A. Putnam. The restoration of the house was featured on the PBS show “Restore America.” When nominating the A.H. Beach House for the National Register of Historic Places, Judy Wright and Mary Stoddard wrote, “This house cannot be recreated. It is one of the treasures of Escondido and San Diego County.” The house is covered under the Mills Act, a California law that allows local governments to reduce property taxes by as much as 70 percent in exchange for preserving historic properties.\n\nListing agent: Amy Ali, Compass.\n\n$3 million\n\n13 Yelping Hill Rd., West Cornwall, Conn. 06796\n\n5 bedrooms, 5 bathrooms.\n\nSquare footage: 3,550.\n\nLot size: 61 acres.\n\nFeatures: The 1820 Greek Revival farmhouse has wide-plank wood floors, wood paneling in the library, and fireplaces in the living room, dining room and library. The property includes a two-bedroom guesthouse, a barn registered with the Connecticut Trust for Historic Preservation, a two-story entertainment barn with a projection theater, a pool house barn and a gunite swimming pool. In 1921, six families of professors at Vassar and Yale bought Yelping Hill Farm and established a summer literary colony known as Yelping Hill. Henry Seidel Canby, founder of the Saturday Review and the book of the month club, was one of the founders.\n\nListing agents: Elyse Harney Morris and Liza Reiss, Elyse Harney Real Estate.\n\n$725,000\n\n417 Fayette Park, Lexington, Ky. 40508\n\n9 bedrooms, 4 bathrooms.\n\nSquare footage: 5,568.\n\nLot size: 0.57 acre.\n\nFeatures: The 1889 Romanesque house was designed by architects H.W. Aldenburg and J.R. Scott for thoroughbred breeder Daniel Swigert, founding owner of Elmendorf Farm, which produced three Kentucky Derby winners. The floors on the main level feature four types of wood laid in intricate designs. The stairs have ornately carved newel posts. Wood trim in oak, walnut, maple and mahogany is found throughout the house. The house has a vintage steam shower, gas chandeliers and porcelain bathtubs.\n\nListing agent: Pamela Stilz, Bluegrass Sotheby’s Realty.\n\n$349,000\n\n504 Encino St., Tularosa, N.M. 88352\n\n3 bedrooms, 3 bathrooms.\n\nSquare footage: 2,757.\n\nLot size: 0.42 acre.\n\nFeatures: The circa-1880 adobe home is in the Tularosa historic district, which was included in the National Register of Historic Places in 1979. The town, at the foot of the Sacramento Mountains, gets its name from the Spanish description of the red or rose-colored reeds growing along the banks of the Rio Tularosa. The house has three kiva fireplaces and 18-inch-thick adobe walls. Some of the hardwood flooring is original. The property includes a walled courtyard and a one-bedroom casita.\n\nListing agent: Annie Daniels, Future Real Estate.\n\n$329,000\n\n317 W. Main St., Ilion, N.Y. 13357\n\n5 bedrooms, 4 bathrooms.\n\nSquare footage: 5,300.\n\nLot size: 2.83 acres.\n\nFeatures: The 1873 Italianate style house was built for Thomas Richardson, who was born in England and came to the United States in 1854. He became an attorney for E. Remington & Sons — maker of rifles, farm equipment, sewing machines and typewriters — and later was counsel for the Ilion National Bank. Black walnut, cherry and chestnut woods are used throughout the interior of the house for the stairs, window and door surrounds, and bookcases. The second-floor bathroom is tiled, ceiling to floor, with imported Venetian porcelain tiles. The frieze tiles have a moulded floral and swag design in bas-relief highlighted with rose and blue glaze. The property, which is listed on the National Register of Historic Places, includes the original carriage barn southeast of the house.\n\nListing agent: John Brown, Coldwell Banker Faith Properties.\n\n$499,900\n\n125 Country Club Dr., Edenton, N.C. 27932\n\n4 bedrooms, 2 bathrooms.\n\nSquare footage: 4,300.\n\nLot size: 1.84 acres.\n\nFeatures: Athol, a circa-1840 Greek Revival plantation house, was built for Joshua Skinner, a prominent plantation owner in Chowan County. When nominating Athol for the National Register of Historic Places, Drucilla Haley wrote that the antebellum mansion has “unusual form and handsome detail. Fashionable classicism, regional forms, and the personal style of an unknown builder combine to create a house of distinctive individuality.” Athol was once a 1,368-acre plantation, of which 800 acres were cultivated to produce corn, wheat, peas and butter.\n\nListing agent: David McCall, All Seasons Realty.\n\n$799,000\n\n221 10th St., La Crosse, Wis. 54601\n\n5 bedrooms, 5 bathrooms.\n\nAD\n\nAD\n\nSquare footage: 6,500.\n\nLot size: 0.48 acre.\n\nFeatures: The 1886 Queen Anne house was built for W.W. Crosby, an early La Crosse lumberman. F. Drake and Son built the house for $2,670, replacing Crosby’s earlier house on the site. Perhaps because Crosby owned a log company and sawmill, a variety of woods, including redwood, oak, cherry and mahogany, were used for the elaborately carved woodwork. The ornate stairs are a piece of art. The house has stained and painted glass windows. The current owners undertook a complete renovation in 1992, preserving the house’s historic integrity. The original carriage house was connected to the main house in 1994.\n\nListing agent: Nancy Gerrard, Gerrard-Hoeschler Realtors.\n\nAD", "description": "Here’s a peek at 10 historic homes across the country that are for sale.", "authors": ["Kathy Orton", "Reporter", "Editor Covering The Washington Metropolitan Area Housing Market"], "top_image": "https://www.washingtonpost.com/resizer/IQpmwxB8auUbUQOs2qAwSmmgg4A=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2ZSOI4G3BAI6TLDDGALHCFKD7Y.jpg", "published_at": "2019-09-26"}