{"pub": "usatoday", "url": "https://usatoday.com/story/travel/flights/2019/05/29/j-d-powers-best-airlines-customer-satisfaction-2019-southwest-jetblue-alaska/1256499001", "downloaded_at": "2019-10-05 13:15:17.207435+00:00", "title": "Southwest, JetBlue top J.D. Power airline rankings", "language": "en", "text": "CLOSE These airlines are the top 4 according to a study based on factors like cost, service and crew. USA TODAY\n\nYou wouldn't know it from scrolling through the steady stream of passenger complaints on Twitter, but travelers' satisfaction with airlines continues to grow.\n\nThe latest evidence: the industry's customer satisfaction score increased for the seventh consecutive year in the 15th annual J.D. Power North America Airline Satisfaction Study released Wednesday.\n\nThe 10 airlines in the survey scored an average 773 out of 1,000, up from 762 in 2018. The score was below 700 as recently as 2013. Just two of the 10 airlines saw their scores fall from a year ago.\n\n\"This is probably the best time in modern history in which to fly,'' said Michael Taylor, head of travel intelligence at the research and consulting firm.\n\nTaylor credits, among other things, high-tech improvements in reservations and airport check-in, ticket value, relatively smooth operations and better in-flight amenities. The latter, though, could still use some improvement, he said. Today's travelers demand speedy Wi-Fi and power outlets, and those features are far from the standard on every plane.\n\nMore: Delta to test free Wi-Fi\n\nThe J.D. Power study, based on responses from 5,966 business and vacation travelers who flew on a major North American airline between March 2018 and March 2019, measures satisfaction in seven areas: cost and fees, in-flight services, aircraft, boarding/deplaning/baggage, flight crew, check-in and reservations.\n\nThe survey size shrank considerably from recent years, when it topped 11,000 travelers. Taylor said the change is not statistically significant.\n\nSouthwest, JetBlue, Alaska took the top three spots\n\nJetBlue and Southwest, longtime leaders in the study, tied for first in overall satisfaction in 2019, according to J.D. Power.\n\nEach scored 817 out of 1,000. JetBlue's score was up five points from 2018, Southwest's fell a point.\n\nAlaska was next, with a score of 801, up a hefty 26 points.\n\nRounding out the top five: Delta (788) and American (764).\n\nAmerican shows the most improvement\n\nAmerican gained the most points in customer satisfaction from a year ago, jumping from 729 to 764. The airline boosted its free in-flight entertainment in the past year.\n\nThe airlines and their scores:\n\nNo. 1 (tie): Southwest: 817, down from 818\n\nNo. 1 (tie): JetBlue: 817, up from 812\n\nNo. 3: Alaska: 801, up from 775\n\nNo. 4: Delta: 788, up from 767\n\nNo. 5: American: 764, up from 729\n\nNo. 6: WestJet: 758, up from 747\n\nNo. 7: United: 723, up from 708\n\nNo. 8: Air Canada, 729, down from 734\n\nNo. 9: Spirit Airlines, 711, Spirit wasn't included in 2018\n\nNo. 10: Frontier: 702, up from 693\n\nAllegiant was included in 2018 but was excluded this year because there were not enough responses about the carrier.\n\nRead or Share this story: https://www.usatoday.com/story/travel/flights/2019/05/29/j-d-powers-best-airlines-customer-satisfaction-2019-southwest-jetblue-alaska/1256499001/", "description": "The annual J.D. Power North America AIrline Satisfaction Study asks travelers to rank airlines in seven key categories, from check in to baggage.", "authors": ["Dawn Gilbertson", "Published A.M. Et May"], "top_image": "https://www.gannett-cdn.com/presto/2019/05/28/USAT/e89ba059-355a-454e-be1e-5b93ba0b471f-pjimage_1.jpg?crop=1801,1013,x51,y40&width=3200&height=1680&fit=bounds", "published_at": "2019-05-29"}