{"pub": "fox", "url": "https://foxnews.com/politics/aoc-backs-sanders-at-new-york-rally-credits-him-with-fundamentally-changing-politics", "downloaded_at": "2019-10-20 00:07:31.144238+00:00", "title": "AOC backs Sanders at New York rally, credits him with ‘fundamentally’ changing politics", "language": "en", "text": "Rep. Alexandria Ocasio-Cortez, D-N.Y. gave her endorsement to Sen. Bernie Sanders, I-Vt., for the 2020 Democratic presidential nomination at a New York rally on Saturday, claiming that his 2016 bid had “fundamentally changed” U.S. politics -- as the 78-year-old lawmaker spoke at his first campaign rally since heart surgery this month.\n\nOcasio-Cortez, who has quickly become one of the most prominent left-wing House lawmakers since taking office in January, backed Sanders formally at the rally in Long Island City. She credited Sanders with having inspired her to embark on her own long-shot political bid, in which she ousted longtime Rep. Joe Crowley last year.\n\nOCASIO-CORTEZ, OMAR, TLAIB TO ENDORSE BERNIE SANDERS\n\n\"It wasn't until I heard of a man by the name of Bernie Sanders that I began to question and assert and recognize my inherent value as a human being that deserves health care, housing, education and a living wage,” she said.\n\nIn her remarks, she talked about her own personal story of growing up in New York and painted a grim picture of America, telling the crowd: “We are all always, it feels like, one accident from everything falling apart and we have to change the fundamental logic of a system and a politics that puts corp profit ahead of all human and planetary costs.”\n\nBut she said Sanders had spent decades for fighting for those things to make life for her better, such as the Children’s Health Insurance Plan (CHIP), universal health care, and student debt forgiveness.\n\n“Bernie Sanders did not do these things because they were popular and that’s what we need to remember,” she said. “No one wanted to question this system and in 2016 he fundamentally changed politics in America.”\n\nMICHAEL MOORE ENDORSES BERNIE SANDERS: 'HE ISN'T AFRAID TO SAY CAPITALISM IS THE PROBLEM'\n\n“We right now have one of the best Democratic presidential primary fields in a generation and much of that is thanks to the work that Bernie Sanders has done throughout his entire life,” she said.\n\nThe endorsement from Ocasio-Cortez, along with other members of The Squad, -- the progressive group of freshman lawmakers -- marks a needed win for Sanders during a difficult few weeks for his campaign.\n\nHe has found himself trailing behind both former Vice President Joe Biden and Sen. Elizabeth Warren, D-Mass., in a number of polls, and has been recovering from surgery after a heart attack. The latter has raised questions about his stamina for not only the grueling presidential race, but also at least a term in the White House.\n\nIn his remarks on Saturday, Sanders sought to quash doubts about whether he could continue, stressing his commitment to continuing his “political revolution”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“I am happy to report to you that I am more than ready, more ready than ever to carry on with you the epic struggle that we face today. I am more than ready to assume the office of president of the United States,” he said to cheers from the crowd.\n\n“I am more than ready to take on the greed and corruption of the corporate elite and their apologists. I am more ready than ever to help create a gov based on the principles of justice, economic justice, racial justice, social justice and environmental justice,” he said.\n\n“To put it bluntly, I am back.” he added.", "description": "Rep. Alexandria Ocasio-Cortez, D-N.Y. gave a hearty endorsement of Sen. Bernie Sanders, I-Vt., for the 2020 Democratic presidential nomination -- claiming that his 2016 bid had “fundamentally changed” U.S. politics.", "authors": ["Adam Shaw"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/AP19292707743753.jpg", "published_at": "2019-10-19"}