{"pub": "businessinsider", "url": "https://businessinsider.co.za/south-africa-homeloans-fnb-property-barometer-more-south-african-homeloans-2019-9", "downloaded_at": "2019-09-12 07:34:29.522648+00:00", "title": "More (mostly rich) South Africans are now getting home loans – here’s why", "language": "en", "text": "More South Africans are getting home loans, a new report by FNB says.\n\nCompetition between mortgage lenders, and buyers less depressed about South Africa, helped push up the number of loans, though mostly at the higher-priced end of the market.\n\nCheaper homes are much in demand, while homes worth R10 million and more are struggling to sell.\n\nFor more stories go to www.BusinessInsider.co.za.\n\nMore South Africans are getting home loans, a new report by FNB says.\n\nThe FNB Property Barometer, released last week, shows that the total value of mortgages extended to South Africans grew by 4.3% the first half of 2019, compared to 3.4% for the same period in 2018.\n\nThis is higher than the 3.6% house-price growth in South Africa for August 2019 compared to August 2018, which is pretty unusual.\n\n“Except for the brief period in the beginning of 2018 ('Ramaphoria'), we have not seen mortgage lending outpacing house prices since June 2011,” said FNB economist Siphamandla Mkhwanazi.\n\nMkhwanazi said the growth in loans can be attributed to a couple of factors:\n\na decrease in buyer despondency following the elections\n\nan increase in bargain hunting amid attractive pricing\n\nan increase in competition between mortgage lenders,\n\nand lower interest rates.\n\n\n\nIncreased lending, however, has been more skewed towards the higher-priced segments, he said.\n\n“Activity in the lower end is being hindered by lack of affordability, primarily due to the scarcity of adequately priced properties in prime locations.”\n\nAlso read: How to master AirBnb and rise up the search rankings in South Africa\n\nMkhwanazi said demand from people with loaned money to spend had been offset by new housing stock and “emigration-related sales.”\n\nThe R700,000 to R1.8 million and R1.8 million to R3.5 million brackets were the best performing segments, growing by 5% and 2.4% respectively in the first half of this year.\n\nPrice growth was most noticeable in the lower end of the property market while properties in the top 20% of sales showed a price decline.\n\nAndrew Golding, chief executive of the Pam Golding Property group, said it had found that the most transactions occured in the market for properties priced below R3 million, with strong demand from first-time buyers.\n\n\n\nIn the luxury segment, with properties priced above R10 million, it takes longer to sell properties while properties are often sold below asking prices, he said.\n\nThe FNB Property Barometer is compiled from FNB’s valuations database from properties financed over the past 18 years.\n\nThe report estimates that easing global financial conditions, weak domestic demand and contained inflation will allow the South African Reserve Bank to further decrease the prime inflation rate by 25 percentage points.\n\nReceive a daily email with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "Except for a brief period in the beginning of 2018, home loan growth has not outpaced property value growth since 2011.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9350/d1c5e7f1bd1c4b0f93466301065d3406.png", "published_at": "2019-09-12"}