{"pub": "theverge", "url": "https://theverge.com/2019/10/29/20939183/hbo-max-interface-warnermedia-disney-netflix-launch-date-ui-gallery", "downloaded_at": "2019-10-30 02:24:39.208729+00:00", "title": "Here’s what HBO Max looks like", "language": "en", "text": "HBO Max, AT&T’s upcoming $15 a month streaming video service, looks nothing like its HBO Now counterpart.\n\nHere’s a brief tour:\n\nGrid View Profile selection. HBO\n\nPersonal page for each account. HBO\n\nWhat browsing through titles looks like. HBO\n\nThese are “highlights.” These are chosen by human curators.\n\nAnother highlight package. HBO\n\nLike Disney+, there are also groups based on franchises, networks, and studios. HBO\n\nA title page. Note the download option! HBO\n\nA personal list, as seen on mobile. HBO\n\nA lock will appear under a child’s account. HBO\n\nHBO\n\nAT&T and WarnerMedia showed off the first look at its product interface at a special investor event today, with Andy Forssell, executive vice president and general manager, speaking about the importance of human curation, instead of simply relying on algorithms like Netflix and other competitors. That’s why HBO’s “Recommended by Humans” feature, something the company rolled out earlier this year, is getting a big lift on HBO Max. Celebrities will now have pages where they can list their own recommendations. HBO Max customers can then use those recommendation pages to select a movie or TV show directly from that celebrity’s profile.\n\nA new function, called “highlight,” is designed to help people not have to worry about scrolling through an app to choose something to watch. Users spend about nine minutes just scrolling through options, and HBO Max is designed to cut through that. Highlights, as seen in the photo below, are curated and packaged together to offer subscribers more specific choices. For example, Friends has highlight packages based on celebrity cameos, in case customers specifically want to watch the Brad Pitt episode again.\n\nHBO Max will also offer a shared viewing experience, one where you can create a combined shared account with other people you watch with, to improve the kind of recommendations each of you might individually see. With other streaming services, sharing an account can often lead to strange recommendations; HBO says it added the feature because of those concerns.\n\nHBO Max will offer podcasts based on certain shows (HBO’s Chernobyl was used in the example). These podcasts will exist on the app, and can be listened to on the go. Those podcasts will also lead to suggested recommendations based on the show the podcast talks about.\n\nExecutives at the company spoke about how integral having an easy-to-use interface and clean look will be to HBO Max’s success. Netflix initially set the tone for what a streaming service should look and feel like, although Apple TV Plus and Disney+ have offered their own unique takes on laying out its titles since. The Verge had the opportunity to go hands-on with Disney+ during the company’s biennial D23 fan convention in Anaheim and noticed that while it was elegant and sleep, it also felt empty. We wrote at the time:\n\nThe biggest takeaway from going hands-on with Disney+ is that it feels familiar. Between Netflix and Hulu (not to mention the myriad niche services), streaming users have grown accustomed to a fairly standardized interface and set of features on streaming platforms. As the streaming wars heat up — as WarnerMedia’s HBO Max, NBCUniversal, and even Apple prepare to launch their own streaming services — it feels like apart from price and content, the user experience will be one of the biggest factors in determining who comes out on top.\n\nApple TV+ doesn’t have the same catalogue of films and TV shows that HBO Max and Disney+ will launch with, so it’s instead focused on its limited series, but HBO Max is launching with more than 10,000 titles, including Max Originals, past WarnerMedia titles, and licensed series like the entire South Park catalogue and the Studio Ghibli collection of animated films.\n\nHBO’s new streaming service is aiming to have half of its programming targeted at young millennials, and the other half split between family entertainment and series targeted at adults.\n\nHBO Max will launch in 2020.", "description": "HBO Max, AT&T’s upcoming $15 a month streaming video service, looks nothing like its HBO Now counterpart. The streaming service comes with celebrity recommendations, new highlight packages, and even shared profiles.", "authors": ["Julia Alexander", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/qrm4pevTow0J4jcc8U8gvcGMCMY=/0x29:1498x813/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19330043/Screen_Shot_2019_10_29_at_7.41.53_PM.png", "published_at": "2019-10-29"}