{"pub": "dailymail", "url": "https://dailymail.co.uk/money/cars/article-7371639/Supremely-rare-McLaren-F1-engine-bay-bathed-GOLD-sells-record-19-8m.html", "downloaded_at": "2019-10-05 08:17:18.970658+00:00", "title": "Supremely rare McLaren F1 LM sells for a record $19.8m", "language": "en", "text": "Advertisement\n\nA limited-edition McLaren road car has become the British manufacturer's most expensive vehicle to sell at auction.\n\nThe 1994 McLaren F1 LM - standing for Le Mans - went under the hammer on Friday during RM Sotheby's Monterey auction in California - which is widely regarded as the calendar's biggest and most expensive sale of collectible vehicles.\n\nBefore the auction, the unique car had been given an estimated sale price of $21million to $23million - the higher of which would have made it the most expensive British-built car to sell at auction on record.\n\nHowever, the hammer dropped well below that landmark figure, with the winning bidder paying - a still utterly staggering - $19.8million (£16.2m).\n\nWhile it missed out on the overall British-car record, it was still the most money anyone has ever handed over for a McLaren at auction.\n\nGoing for gold: This limited-edition F1 LM has become the most expensive McLaren ever sold at auction\n\nThe McLaren F1's party piece is its gold-lined engine bay. The precious metal helps to dissipate the generated by the ferocious 6.1-litre engine\n\nThe car went under the hammer on Friday as part of the RM Sotheby's Monterey sale in California - considered one of the biggest vehicle auctions of the year\n\nJust 106 McLaren F1 road cars were built, though this one is like no other.\n\nThe silver two-door supercar spent the first six years of its life as a standard F1 but was upgraded by McLaren to the LM specifications - usually reserved for the car firm's endurance racers - in 2000.\n\nIt is one of just two road cars to be given the LM specifications by McLaren and was awarded the honor in tribute to the car's victory in the 1995 24-hour Le Mans race.\n\nIn order to bring the car up to LM spec, its V12 680bhp engine was upgraded, as were its brakes and exhaust system.\n\nBut the standout feature of the model is the incredible gold-coated engine bay, which isn't just for aesthetics.\n\nThe precious metal helps to dissipate the heat that is generated by the 6.1-litre engine, therefore improving performance over prolonged periods.\n\nOther notable upgrades for the LM-upgraded model include a higher-spec transmission cooler and two additional radiators.\n\nThis 1995 model is just one of two road cars that were upgraded to racing LM (Le Mans) spec\n\nThe McLaren is now the third most expensive British-built car to go under the hammer in history\n\nThe silver two-door spent the first six years of its life as a standard F1 but was upgraded by McLaren to the LM specifications in 2000\n\nIt was given the Le Mans specification by McLaren, after one won the famous 24-hour race in 1995\n\nBetter heat management of the engine means the BMW-developed V12 engine car run at peak performance levels for longer periods of time\n\nWhile the performance mods have made it accelerate, turn and stop like a ferocious racer, McLaren also went to work to make it more comfortable for use on the road.\n\nIt upgraded the air-conditioning, a radio was added to the CD player and the headlamps were changed to gas-discharge units.\n\nFinally, the standard 17-inch wheels were replaced by 18-inch GTR wheels wrapped with specialist racing tyres.\n\nAlexander Weaver, a car specialist with RM Sotheby's, had described the one-off vehicle as 'the ultimate supercar', adding that it had 'long been regarded as the benchmark by which all others are compared'.\n\nHe added: 'This particular example has always been my favourite and one that is widely regarded as the most desirable of all specifications.\n\n'No other car stirs more emotions and evokes more excitement.\n\n'The level of ownership exclusivity and 'holy grail' admiration associated with the F1 is second only to the Ferrari 250 GTO, making this an excellent follow up to our 2018 sale.\n\n'It truly is an opportunity not to be missed.'\n\nInterest was high in the stunning car and if you manage to win the auction. The winning bidder also got a bespoke luggage set\n\nAlexander Weaver, a car specialist with RM Sotheby's described it as 'the ultimate supercar'\n\nAccording to the odometer, the car has covered just 21,439km, which is around 13,320 miles\n\nThe cabon-fibre rear spoiler is one of the additions give to the 200mph-plus supercar and is designed to improve downforce in fast corners\n\nThe auctioneer's car specialist added that the McLaren supercar has long been regarded as the benchmark by which all others are compared\n\nThe previous record price paid for a McLaren was another F1 that was sold by Bonhams - also during Monterey Car Week - in 2017 for $15,620,000\n\nAs well as setting a new record for the marque, the F1 LM has also become the third most expensive British motor ever sold to a highest bidder.\n\nThe mantle of the priciest goes to a 1956 Aston Martin DBR1 which sold for a then £22.6million in August 2017 and a 1955 Jaguar D-Type which sold for $21.8million a year earlier - both at the annual RM Sotheby's Monterey showpiece sale.\n\nThe second LM-specification F1 sold with RM Sotheby's for $13,750,000 (£11.3m) in 2015, though the previous record had been held by the first F1 imported to the US.\n\nBuilt a year later in 1995, it sold for $15,620,000 (£12.8m) at a Bonhams' rival sale in 2017, which is also held during Monterey Car Week in California.\n\nA 1965 Aston Martin DB5 ordered by Eon Productions to promote James Bond films Goldfinger and Thunderball was sold at the same event by RM Sotheby's just 24 hours earlier for $6.4million.", "description": "This 1994 F1 LM (Le Mans) with a gold-plated engine bay has become the most expensive McLaren ever sold at auction and the third priciest British-built motor of all time.", "authors": ["Rob Hull For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/08/19/14/17445142-0-image-a-17_1566219892448.jpg", "published_at": "2019-08-19"}