{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7552677/Universities-offer-workshops-sexual-consent-combat-rise-harassment-complaints.html", "downloaded_at": "2019-10-09 02:18:36.128788+00:00", "title": "Universities offer workshops on sexual consent to combat rise in harassment complaints", "language": "en", "text": "Students at almost two thirds of universities are being offered ‘consent workshops’, according to an official report.\n\nUniversities UK, which represents vice chancellors, said that the change had come because of pressure to tackle harassment.\n\nIt surveyed 100 institutions on how they were dealing with harassment and found that major universities including Oxford, Edinburgh and Durham were running ‘consent training’ for freshers.\n\nUniversities UK surveyed 100 institutions on how they were dealing with harassment. They found that major universities including Oxford (All Souls College, Oxford, pictured) were running ‘consent training’ for freshers\n\nThe students are taught how to establish that a sexual encounter is consensual, how to ask for consent and how to recognise circumstances where consent cannot be given.\n\nSome universities made the workshops a compulsory part of freshers’ week.\n\nSince 2016, eight in ten universities have updated their disciplinary policies and more than half have added to the rules students must follow.\n\nStudents at Edinburgh University are offered classes for those who have experienced domestic or sexual abuse, as well as a workshop called ‘How to be good in bed’.\n\nUniversities have come under fire for failing to protect students after a surge in allegations of sexual harassment.\n\nA BBC report found that incidents of rape, sexual assault and harassment had more than trebled last year compared with 2016.\n\nStudents at Edinburgh University (pictured) are offered classes for those who have experienced domestic or sexual abuse, as well as a workshop called ‘How to be good in bed’\n\nHowever improvements in how students can report such incidents may account for some of the rise. The report, Changing the Culture, found that universities were not doing enough to stop hate incidents including those in which offence was caused by mistake.\n\nIt said there had been a steep rise in student complaints over harassment in the past few years.\n\nAnd it said while there had been progress in dealing with sexual misconduct claims, more needed to be done on other harassment, such as hate crimes and incidents.\n\nThe report says a hate incident should still be dealt with seriously at a senior level even if no law has been broken and the perpetrator offended someone by mistake.\n\nIt says a hate incident can also be described as a ‘micro-aggression’, which is ‘an instance of indirect, subtle, or unintentional discrimination’. In response to the report, universities minister Chris Skidmore warned vice chancellors that there must be a ‘zero-tolerance culture’ to all types of harassment.\n\nHe said: ‘Any form of harassment, violence or hate crime is abhorrent and unacceptable.’", "description": "Universities UK surveyed 100 institutions on how they were dealing with harassment. They found that major universities including Oxford were running 'consent training' for freshers.", "authors": ["Daily Mail Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/01/19468886-0-image-a-52_1570581480830.jpg", "published_at": "2019-10-09"}