{"pub": "news24", "url": "https://city-press.news24.com/Trending/the-plight-of-women-in-radio-20191027", "downloaded_at": "2019-10-27 04:45:47.766851+00:00", "title": "The plight of women in radio", "language": "en", "text": "Trending The plight of women in radio\n\nOnline content hub CliffCentral recently hosted a podcast starring Bonang Matheba, Kuli Roberts, Unathi Nkayi and Masechaba Ndlovu.\n\nThese women have built remarkable empires and made their marks as powerful voices on and off the wireless.\n\nOn listening to the podcast and interviewing three distinguished women in radio, who spoke off-the-record about their experiences, I realised that there’s one contentious and common thread among their stories: the rife patriarchy and misogyny they continue to experience in the radio industry.\n\nThe breakfast and drive-time slots garner the most engagement and listenership and they have the numbers to back it up. They are naturally the slots with the most activity and largest audiences, as people are either driving to or returning from work during these times. When assessing representation on these major slots, one thing that is made immediately clear is that women face prejudice.\n\n“Women are discriminated against, especially on these two slots. We have Anele Mdoda who is doing well on Highveld, Thando Thabethe on 5FM, Joanne Joseph on 702 and Refilwe Moloto hosting the breakfast show on Cape Talk radio. They are only a handful and the other radio stations don’t seem to be catching on. The industry is male-dominated and women are made to feel inferior and that they have to learn from the men, instead of being strong matriarchs,” said one presenter.\n\nThis was echoed by Ndlovu who said on the podcast: “Commercial radio was the first time I found that women’s voices are diminished. You’re not allowed to have an opinion. You have to count your words. You don’t have a position of power. You just have to be pretty and cute and say something funny and speak from an entertainment point of view. You’re not allowed to have a stance on things that matter.”\n\nNkayi agreed with this, citing an incident in 2015 when she was suspended from the breakfast show on Metro FM after swearing at someone on a private platform which was then put on a public platform, whereas her male colleagues swore at people on a public platform and nothing happened to them.\n\n“The station’s general manager at the time said that these are men and I’m a woman so I’m not allowed to behave like that, and that’s why I got suspended and they didn’t,” she recalled.\n\nThere are views that people don’t want to hear women’s voices in the morning and prefer to listen to men because their voices are deeper and stern and, as such, they should anchor these major slots. These patriarchal views are also carried through to other slots such as lunchtime, which is often reserved for women because the content is lighter and less serious.\n\n“The assumption is that, because I anchor the lunchtime slot, I don’t possess the ability to cover more hard news stories and when I do touch on these topics during my slot I’m told to avoid being ‘too serious or too deep’,” said a lunchtime presenter. These views seem to be endorsed by station managers and decision-makers who decide on the line-up and the talent paired with each slot.\n\n“Presenters are decided on by considering a myriad of elements: whether they have the energy levels to match the listeners’, their knowledge and insight especially on current affairs, their depth on various subject matters to a certain extent, and their popularity, as well as their emotional intelligence,” explained one station manager.\n\nAlthough presenters may not tick all the boxes, she explained that one criterion can supersede the other.\n\nShe went on to say that women are an afterthought when these decisions are made; something they risk or try out to bring in a missing element, but it has very little to do with women anchoring and holding the fort.\n\n“If women are placed in these slots, they are always a sidekick to loud male voices that drown them out. They don’t get paid as much as the men and they don’t have negotiating power,” she said.\n\n“People who make these decisions don’t like it when the talent has a bigger following than them. They lack vision and don’t see things the way listeners do. Women get the worst of it. There’s always a raw deal for women,” she added.\n\nNdlovu had a similar experience, stating that when she was on Power FM she quickly realised that she was being paid far less than her male counterparts. She also cited her tenure at Metro FM where she generated numbers and the station went on to receive their first award for drive-time, yet she felt that she still was not paid her dues and got suspended.\n\n“They don’t care if you surpass your key performance indicators or double the numbers. I couldn’t understand their changes and why they messed with a formula that worked. Their reasons also did not make sense; how was budget an issue?” she exclaimed.\n\nNkayi recalled that for three years she was paid less than her co-host Glen Lewis at Metro FM and each year she was refused a raise despite her doubling the numbers during her tenure there. It was not until she demanded that HR be informed, that she received an 85% increment.\n\nThese situations are not isolated. Another example is Relebogile Mabotja who was a co-host on the Fresh Breakfast Show on that same station and hosted it for some time. After DJ Fresh’s exit she was replaced by Moeti “Mo Flava” Tsiki and the show was then renamed the Morning Flava breakfast show. The final nail in the coffin was when Mabotja was placed as a newsreader on the afternoon drive show anchored by two men, Siphesihle “Sphectacula” Ngwenya and Lebogang “DJ Naves” Naves. The decision to replace DJ Fresh with MoFlava, despite Mabotja’s experience as a host on the show, is very telling.\n\n“There is an unwillingness to change. Radio stations need to be more deliberate about their choices of putting women first. There are lots of talented women deserving of the work but they’re simply not being given the opportunities,” said a station manager.\n\n“The gatekeepers of the industry need to learn how to treat talent,” said Matheba. She emphasised that management needs to start treating their talent more positively because creatives flourish where they feel loved and valued.\n\nUnathi emphasised that top management is often filled with men who are insecure and threatened by successful women and that throughout her journey she has learnt to say “no” more than she says “yes”.\n\nRoberts encouraged women to demand their worth and not be afraid to assert it and Ndlovu advised women to do their research and ensure that they are being paid what they deserve and treated in a way that honours them.", "description": "Moroetsana Serame explores how South African women of the airwaves navigate the male-dominated minefield in which they are still underrepresented, underpaid and undermined.", "authors": ["Moroetsana.Serame Citypress.Co.Za"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9514/a581c06736a943dba0fda67e977a88ce.jpg", "published_at": "2019-10-27"}