{"pub": "yahoo", "url": "https://news.yahoo.com/bannon-teams-chinese-group-thinks-091021131.html", "downloaded_at": "2019-10-19 12:32:43.678317+00:00", "title": "Bannon Teams Up With Chinese Group That Thinks Trump Will Bring on End-Times", "language": "en", "text": "After trying to launch his own cryptocurrency and failing to turn an Italian monastery into a training camp for Europe’s far right, former Trump adviser Steve Bannon has a new plan: teaming up with a Chinese spiritual movement that reportedly believes Trump will bring about Judgment Day.\n\nOn Saturday night, viewers of the rabidly pro-Trump cable news channel One America News Network will witness the premiere of Bannon’s latest effort, a ripped-from-the-headlines political thriller modeled after the real-life legal battle that ensued following the arrest of an executive for Chinese tech company Huawei in Canada.\n\nBannon didn’t exact for subtlety as the executive producer of the film, Claws of the Red Dragon. Chinese communist officials in the movie meet in shadowy rooms to discuss the utmost importance of their “secret plan,” while an intrepid reporter investigating Huawei stand-in “Huaxing” finds a dead cat left on her car in warning. In a Bannonian touch at the end, viewers are left with an Edmund Burke quote warning that evil triumphs when “good men do nothing.”\n\nThe message is obvious: Chinese executives and officials are intent on undermining other countries, and Western institutions have been too cowardly or greedy to stand up to them.\n\nWhat will be less clear to OANN’s viewers is that the movie’s funder, digital video company New Tang Dynasty, is closely tied to a spiritual movement that reportedly believes Donald Trump, Bannon’s former boss, will help usher in the end times.\n\nNew Tang Dynasty is part of the Epoch Media Group, a collection of far-right media outlets linked to Falun Gong, a Chinese spiritual movement that has been repressed by the Chinese government. The group’s members apparently now see Trump’s presidency and Chinese trade war as a fateful moment.\n\nIn August, NBC News reported on the company’s attempts through its newspaper, The Epoch Times, to promote Trump through huge Facebook ad buys and increased links to pro-Trump officials and conservative media.\n\nBut Falun Gong practitioners also see Trump as more than just a convenient political ally, according to the NBC report. Former members of Falun Gong told NBC News that the group’s adherents “think the world is headed toward a judgment day” in which communists are going “to a kind of hell.”\n\n“Trump is viewed as a key ally in the anti-communist fight,” the NBC News report reads.\n\nBannon, who said he helped expand the film’s distribution, plans to expand it to Brazil, Italy, and Poland. Bannon wasn’t concerned about his new ally’s reportedly apocalyptic views of Trump.\n\n“If they think Donald Trump is something special, then they think Donald Trump is something special,” he said. “It’s kind of like some of the deplorables,’ right?”\n\nTeaming up with the Epoch Times may be unusual, but it makes sense for Bannon, who has repeatedly railed against Chinese trade practices and economic influence.\n\nThe film is light on references to the Epoch Times, and appears to contain no references to Falun Gong, aside from a throwaway line about the harsh treatment doled to some Chinese citizens.\n\nAt one point, the reporter character picks up a copy of a free Chinese-government-funded newspaper and complains about its lack of accuracy. In the background, an Epoch Times newspaper box stands as a silent point of comparison.\n\nOANN president Charles Herring told The Daily Beast that his company doesn’t have any business relationship with New Tang Dynasty.\n\n“One America News has extensively reported on espionage and cyber warfare concerns against the United States by Huawei and the Chinese Government,” Herring said in a statement. “Leading experts and policy makers on both sides of the aisle argue that implementation of 5G technology using American infrastructure suppliers is critical to protecting US national security interests. Claws of the Red Dragon highlights these concerns and the different interests and conflicts in fundamental beliefs involved.”\n\nNew Tang Dynasty and Bannon didn’t respond to requests for comment.\n\nClaws ends with Canada poised on the brink of a clash with China, with Canadian citizens arrested in China in retaliation for the Huaxing executive’s own detention (as happened in the real world). A Canadian Huaxing executive contemplates suicide, while his girlfriend, the reporter, sees her parents arrested in China as retaliation for her articles exposing Canada’s efforts to appease the Chinese government.", "description": "Photo Illustration by The Daily Beast / Photos Getty/Courtesy Claws of The Red DragonAfter trying to launch his own cryptocurrency and failing to turn an Italian monastery into a training camp for Europe’s far right, former Trump adviser Steve Bannon has a new plan: teaming up with a Chinese spiritual", "authors": ["Will Sommer"], "top_image": "https://s.yimg.com/uu/api/res/1.2/TAOPexhnRC_RPxh72VQggg--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/cc6a94a04ddfab101767937626218e3e", "published_at": "2019-10-19"}