{"pub": "investing.com", "url": "https://ng.investing.com/analysis/4-things-now-pressuring-oil-prices-19949", "downloaded_at": "2019-10-03 09:43:12.516764+00:00", "published_at": "2019-10-03", "title": "4 Things Now Pressuring Oil Prices", "language": "en", "text": "prices appear to have recovered after the attack on Saudia Arabia oil installations caused a spike mid-September. Immediately following the strike just two and a half weeks ago, hit a 4-month high of $69.02. By Oct. 2, the price of Brent fell below $58.66—the same price it opened at exactly a month earlier, on Sept. 2.\n\nBrent Oil Futures Weekly Chart\n\nQuestions remain regarding Saudi Arabia’s ability to supply its customers with certain desirable crude grades, but, overall, the market shrugged off the implications of the attack on global oil supply. In fact, the primary indicators are all pushing prices down.\n\n1. Demand Forecasts Revised Down\n\nThe International Energy Agency (IEA) is planning to revise its forecasts for oil demand growth down. On Tuesday the IEA Executive Director Fatih Birol told Bloomberg that the organization is currently predicting demand growth of only 1.1 million bpd—lower than the 1.4 million bpd of growth it predicted in May 2019—and this forecast will likely be revised even lower.\n\nThere is more cause for concern with September U.S. manufacturing activity falling to a 10-year low according to the survey of manufacturing activity released by the on Tuesday. A slowdown in U.S. manufacturing negatively impacts oil demand.\n\n2. Geopolitical Tensions In Persian Gulf\n\nAlthough Saudi Arabia was vocal in blaming Iran for the attacks on its Abqaiq and Khurais oil facilities, tensions between the two countries actually seem to be calming down. The speaker of the Iranian Parliament is open to the idea of starting a dialogue with Saudi Arabia and prefers diplomacy to military action as a means to resolve “security and political problems.”\n\nCrown Prince Mohammed bin Salman also said he supports “a political solution” with Iran in comments he made in a 60 Minutes interview. Meanwhile, Iranian oil minister Bijan Zanganeh referred to the Saudi oil minister, Prince Abdulaziz bin Salman (half-brother to Crown Prince Mohammed bin Salman) as “a friend for over 22 years.” The relationship between the two oil ministers began when they shared the stage at an energy conference in Moscow.\n\nWhile face-to-face talks between Saudi Arabia and Iran or the U.S. and Iran are not expected in the short-term, tensions have decreased. Two weeks ago, pundits were talking about the possibility of war breaking out and contemplating potential U.S. involvement in a violent conflict in the Persian Gulf. In a short time, the atmosphere has shifted and oil prices are reacting accordingly.\n\n3. Over-Production By Russia, Iraq\n\nRussia continues to over-produce from its agreed-to OPEC+ production quota. After agreeing to cut output to comply with its 11.17 million bpd quota at the September gathering of OPEC+ ministers, the latest data reveals that Russia reduced production only slightly from 11.29 million bpd to 11.25 million bpd, but claims it will fully comply with its quota in October.\n\nIraq is also reportedly overproducing after pledging to cut production to comply with its September OPEC quota. While Argus says Iraq is cutting production at its Majnoon oil field by 75,000 bpd, S&P Global Platts reports that Iraq overproduced the OPEC quota by 370,000 bpd. Like Russia’s September cut, Iraq’s cut is symbolic, but not a significant curtailment of supply. A new issue to keep abreast of in Iraq is the emergence anti-corruption and anti-Iran protests.\n\n4. U.S. Oil And Gasoline Production\n\nOil’s decline was also fueled by this week’s EIA report, which revealed a 3.1 million barrel build in last week. Refinery runs were also down by nearly 500,000 bpd. As refinery maintenance season in the United States gets started, these numbers are to be expected. Last week also saw similar builds in inventories and lower refinery runs.\n\nHowever, unplanned outages experienced in several California refineries are also contributing to lower refinery utilization rates and higher crude oil storage numbers according to GasBuddy.\n\nCrude Oil WTI Futures Weekly Chart\n\nConclusion\n\nLooking ahead, some of these factors are more likely to weigh on oil prices than others. Gloomy economic data will continue to dominate headlines and push oil demand forecasts lower for 2019 unless October trade negotiations between the U.S. and China surprise with positive results.\n\nGeopolitically, the Persian Gulf remains a potential hotbed, but tensions are just as likely to recede as they are to escalate. OPEC and OPEC+ will be meeting again at the beginning of December, and although production quotas are locked in through March, they may attempt to implement deeper cuts. Full compliance, especially from Russia and Iraq, is likely to remain as elusive as ever. The low refinery utilization numbers in the United States are seasonally appropriate and should resolve as usual.", "description": "Commodities Analysis by Investing.com (Ellen R. Wald, Ph.D.) covering: Brent Oil Futures, Crude Oil WTI Futures. Read Investing.com (Ellen R. Wald, Ph.D.)'s latest article on Investing.com UK.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg"}