{"pub": "yahoo", "url": "https://news.yahoo.com/house-democrats-said-still-expected-former-u-ambassador-082713341--abc-news-topstories.html", "downloaded_at": "2019-10-11 12:46:59.754533+00:00", "title": "House panels to question former US ambassador to Ukraine in impeachment probe", "language": "en", "text": "House panels to question former US ambassador to Ukraine in impeachment probe originally appeared on abcnews.go.com\n\nThe former U.S. ambassador to Ukraine, Marie Yovanovitch, is expected to appear on Capitol Hill Friday for a closed-door deposition with House committees looking into whether President Donald Trump committed impeachable offenses in asking a foreign country to investigate his political rivals, according to multiple congressional officials with knowledge of the probe.\n\n(MORE: State Dept. officials frustrated, angry with Pompeo over Ukraine, ambassador's treatment: Sources)\n\nYovanovitch’s scheduled appearance comes as the State Department has instructed multiple officials not to testify before Congress and the White House has refused to cooperate with the Democrats’ investigation, calling it a “dangerous” effort to “overturn the results of the 2016 election.”\n\nPHOTO: U.S. Ambassador to Ukraine Marie Yovanovitch, center, sits during her meeting with Ukrainian President Petro Poroshenko in Kyiv, Ukraine, March 6, 2019. (Mikhail Palinchak/AP, FILE) More\n\nThe State Department could still demand that she not appear, as it did earlier this week with U.S. Ambassador to the European Union Gordon Sondland. That refusal came just hours before Sondland, a Trump mega donor, was to appear.\n\nYovanovitch, who was recalled from her post in May after coming under attack from Trump’s personal lawyer Rudy Giuliani and other conservatives with unsubstantiated allegations that she tried to hold up anti-corruption efforts in the Ukraine, is still a member of the foreign service.\n\nDemocrats have sought to question Yovanovitch, who was abruptly recalled last spring, for her insight into the Trump administration’s relationship with Ukraine.\n\nPHOTO: Former Special Envoy to Ukraine Kurt Volker departs following a closed-door deposition led by the House Intelligence Committee on Capitol Hill, Oct. 3, 2019, in Washington, DC. (Zach Gibson/Getty Images) More\n\nShe is one of a handful of current and former diplomats and administration officials Democrats have sought to question about events surrounding Trump’s July phone call with Ukrainian President Volodymyr Zelenskiy, his attempts to encourage Zelenskiy to investigate former Vice President Joe Biden’s son Hunter, and the initial withholding of military aid to Ukraine.\n\nThe call, first revealed in a complaint from an intelligence community whistleblower, coupled with a resulting inquiry by the intelligence community inspector general, prompted House Democrats to open an impeachment inquiry, which could lead to a vote to impeach Trump by the end of the year.\n\nABC News has also learned that the president’s former Russia adviser Fiona Hill has agreed to sit down with congressional investigators on Monday. She is expected to face questions about her knowledge, if any, of the Ukraine episode.\n\nHill recently left her White House post at the National Security Council, and her testimony on Capitol Hill would come after an appearance by Kurt Volker, the former U.S. special envoy to Ukraine.\n\nPHOTO: President Donald Trump and Ukrainian President Volodymyr Zelenskiy looks on during a meeting in New York on September 25, 2019, on the sidelines of the United Nations General Assembly. (Saul Loeb/AFP/Getty Images) More\n\nVolker, who appeared on Capitol Hill last week, provided 67 pages of texts to Congress that show an apparent effort by Trump officials to force Ukrainian officials to look into possible corruption by Biden and his son, Hunter, who served on the board of an oligarch-run Ukrainian energy company.\n\n(MORE: 'Crazy to withhold security assistance' to Ukraine for political campaign: Top US diplomat)\n\nPresident Trump, despite admitting that he wanted the Bidens investigated, has said he did nothing wrong.", "description": "The former U.S. ambassador to Ukraine, Marie Yovanovitch, is expected to appear on Capitol Hill Friday for a closed-door deposition with House committees looking into whether President Donald Trump committed impeachable offenses in asking a foreign country to investigate his political rivals, according", "authors": ["Benjamin Siegel", "Katherine Faulders", "Conor Finnegan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/N2j.9l4gtVIZsV3KP4v4ag--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.gma.com/marie-yovanovitch-file-ap-jef-191010_hpMain_16x9_992.jpg", "published_at": "2019-10-11"}