{"pub": "usatoday", "url": "https://usatoday.com/story/sports/cycling/2019/10/08/julian-alaphilippe-ends-stellar-season-skips-il-lombardia/40281459", "downloaded_at": "2019-10-08 10:26:11.118439+00:00", "title": "Julian Alaphilippe ends stellar season, skips Il Lombardia", "language": "en", "text": "CLOSE\n\nBRUSSELS (AP) — French cyclist Julian Alaphilippe has prematurely ended his highly successful season during which he wore the Tour de France's yellow jersey for 14 days and won the Milan-San Remo classic.\n\nAlaphilippe, who rides for the Belgian team Deceuninck - Quick-Step, has been one of the top riders this year and is being considered for the Velo d'Or award as the best rider of 2019.\n\nBut he has been running out of energy in recent weeks. After a disappointing showing at the world championships last month, Alaphilippe was expected to finish the year with a couple of races in Italy, including the prestigious Il Lombardia classic.\n\n\"I am really sad to tell you that I will not be racing Milano-Torino and Il Lombardia this week and that my incredible 2019 season has come to an end,\" said Alaphilippe.\n\n\"It makes sense that I start my post-season recovery now, in order to be in the best possible shape for the start of next year.\"\n\nAlaphilippe's showmanship skills and unpredictable style of racing gained him many admirers at the Tour, during which he won two stages. The 27-year-old also won the Strade Bianche and the Fleche Wallonne.\n\n___\n\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports\n\nCopyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "French cyclist Julian Alaphilippe has prematurely ended a highly successful season during which he wore the Tour de France's yellow jersey for 14 days and won the Milan-San Remo classic", "authors": ["Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/sites/usatoday/images/favicon.png", "published_at": "2019-10-08"}