{"pub": "washingtonpost", "url": "https://washingtonpost.com/national-security/putin-and-hungarys-orban-helped-sour-trump-on-ukraine/2019/10/21/a0af1e9c-f40b-11e9-ad8b-85e2aa00b5ce_story.html?tid=pm_pop", "downloaded_at": "2019-10-22 13:30:43.702366+00:00", "title": "Putin and Hungary’s Orban helped sour Trump on Ukraine", "language": "en", "text": "Neither of those foreign leaders specifically encouraged Trump to see Ukraine as a potential source of damaging information about Democratic presidential candidate Joe Biden, nor did they describe Kyiv as complicit in an unsubstantiated 2016 election conspiracy theory, officials said.\n\nAD\n\nAD\n\nBut their disparaging depictions of Ukraine reinforced Trump’s perceptions of the country and fed a dysfunctional dynamic in which White House officials struggled to persuade Trump to support the fledgling government in Kyiv instead of exploiting it for political purposes, officials said.\n\nThe role played by Putin and Orban, a hard-right leader who has often allied himself with the Kremlin’s positions, was described in closed-door testimony last week by George Kent, a deputy assistant secretary of state, before House impeachment investigators, U.S. officials said.\n\nKent cited the influence of those leaders as a factor that helped sour Trump on Ukrainian President Volodymyr Zelensky in the months leading up to their July 25 phone call — a conversation that triggered an extraordinary whistleblower complaint as well as a House impeachment inquiry.\n\nAD\n\nAD\n\nU.S. officials emphasized that while Putin and Orban denigrated Ukraine, Trump’s decision to seek damaging material on Biden was more directly driven by Trump’s own impulses and Kyiv conspiracy theories promoted by his attorney Rudolph W. Giuliani.\n\nIn their early May phone call, Putin “did what he always does” in seeking to undercut the United States’ relationship with Ukraine, said a former U.S. official familiar with details of the conversation. “He has always said Ukraine is just a den of corruption.”\n\nThe efforts to poison Trump’s views toward Zelensky were anticipated by national security officials at the White House, officials said. But the voices of Putin and Orban took on added significance this year because of the departure or declining influence of those who had sought to blunt the influence of Putin and other authoritarian leaders over Trump.\n\nAD\n\nAD\n\nOfficials cited the departures of Defense Secretary Jim Mattis and White House Chief of Staff John F. Kelly, both of whom had backed U.S. military assistance to Ukraine but were no longer in position to protect that stream of funding when it was suspended in the weeks leading up to Trump’s July 25 phone call.\n\nNational security adviser John Bolton was also seen as a fervent backer of Ukraine in its conflict with Russia, but his relationship with Trump deteriorated rapidly this year before he was pushed out of the White House last month.\n\n“Over time you just see a wearing down of the defenses,” a former White House official said, describing the struggle to contest the influence of Giuliani, Putin and Orban.\n\nAD\n\nThe House impeachment inquiry is centered on Trump’s alleged attempt to use the power of his office to coerce Ukraine into taking measures that the president hoped would help him in the 2020 election.\n\nAD\n\nThere is no evidence that Putin spoke about Biden or endorsed Giuliani’s unsubstantiated claims that it was Ukraine — and not Russia — that had interfered in the 2016 election. Still, officials said that treating Ukraine as a pawn is consistent with Putin’s approach toward the former Soviet republic.\n\nAmerican policy has for years been “built around containing malign Russian influence” in Eastern Europe, a U.S. official said. Trump’s apparent susceptibility to the arguments he hears from Putin and Orban is “an example of the president himself under malign influence — being steered by it.”\n\nAD\n\nThe official and others spoke on the condition of anonymity, citing the sensitivity of internal discussions at the White House and the ongoing impeachment inquiry.\n\nThe White House did not respond to requests for comment.\n\nAD\n\nIn his testimony, Kent indicated that U.S. officials were encouraged by Trump’s initial phone call with Zelensky after his April election and hoped the president would see the new leader as a potential partner in long-standing U.S. efforts to help Ukraine fend off Russian aggression and battle internal corruption.\n\nInstead, Kent testified, Trump’s view of Zelensky and Ukraine seemed to sour in the ensuing months, with Trump voicing disdain for Kyiv, ordering the U.S. ambassador to Ukraine removed, blocking Vice President Pence from attending Zelensky’s inauguration and suspending the flow of $391 million in military and other aid to the country.\n\nAD\n\nTrump spoke with Putin by phone and met with Orban at the White House in the weeks between Zelensky’s April 21 election and his May 20 inauguration. Trump also spoke with Putin on June 28, during a global summit in Japan, and by phone on July 31, days after the call in which he solicited a “favor” from Zelensky.\n\nAD\n\nTrump has consistently refused to accept evidence that Russia interfered on his behalf in the 2016 election. Last week, acting White House chief of staff Mick Mulvaney confirmed that Trump had ordered aid to Ukraine suspended in part to compel Kyiv to investigate a debunked conspiracy theory that a hacked Democratic National Committee computer server was taken to Ukraine in 2016 to hide evidence that it was that country, not Russia, that interfered in the presidential election.\n\nIn a heated exchange at the White House last week, House Speaker Nancy Pelosi (D-Calif.) confronted Trump by saying, “With you, all roads lead to Putin.”\n\nAD\n\nTrump turned to Putin for guidance on the new leader of Ukraine within days of Zelensky’s election. In a May 3 call, Trump asked Putin about his impressions of Zelensky, according to a Western official familiar with the conversation. Putin said that he had not yet spoken with Zelensky but derided him as a comedian with ties to an oligarch despised by the Kremlin.\n\nAD\n\nBefore running for president, Zelensky starred in a television sitcom in which he portrayed the Ukrainian president.\n\nThe May conversation with Putin coincided with a White House visit by Orban that many in the administration had opposed because of the Hungarian leader’s moves to undercut democratic institutions in that country and his combative relations with U.S. allies in Europe.\n\nAD\n\n“I can tell you, knowing the president for a good 25 or 30 years, that [Trump] would love to have the situation that Viktor Orban has, but he doesn’t,” David Cornstein, Trump’s ambassador to Hungary, said in an interview published by the Atlantic this spring.\n\nThe May visit from Orban began with an hour-long meeting between Trump and the Hungarian leader with no note-takers, officials said. Bolton and the Hungarian foreign minister joined afterward.\n\nAD\n\nSenior U.S. diplomats said they had limited insight into the private conversation between Trump and Orban, let alone how Trump’s views of Ukraine have formed. But one official familiar with the encounter said that it became “clear that the meeting with Orban had solidified” Trump’s pessimistic view about Kyiv and Zelensky.\n\nOrban’s grievances toward Ukraine are grounded in a historic border dispute and the claimed mistreatment of a Hungarian-speaking minority that resides in Ukraine. But Orban’s animosity toward Zelensky is also ideological, officials said, noting that Zelensky has positioned himself in opposition to Orban as a Western-leaning reformer.\n\nWhite House and State Department officials had sought to block an Orban visit since the start of Trump’s presidency, concerned that it would legitimize a leader often ostracized in Europe. They also worried about Orban’s influence on the U.S. president.\n\n“Basically, everyone agreed — no Orban meeting,” said a former White House official involved in internal discussions. “We were against it because [we] knew there was a good chance that Trump and Orban would bond and get along.”\n\nThe effort to keep distance between Trump and Orban began to fray earlier this year with the departures of senior officials and the emergence of new voices around the president. Among the most important was Mulvaney, who became acting chief of staff in January and was seen as sympathetic to Orban’s hard-right views and skepticism of European institutions. In Congress, Mulvaney’s former Freedom Caucus colleagues last year backed Orban’s efforts to kill a small U.S. grant designed to nurture independent media outlets in Hungary.\n\nMulvaney’s involvement in approving the Orban visit was one of several instances in which he overruled national security officials, officials said. At the same time, Mulvaney also facilitated an arrangement in which Trump directed other diplomats, including the U.S. ambassador to the European Union, Gordon Sondland, to work with Giuliani on his Ukraine agenda.", "description": "The Russian and Hungarian leaders reinforced Trump’s view of Ukraine as a hopelessly corrupt country.", "authors": ["Greg Miller", "National Security", "Intelligence", "Greg Jaffe", "National Security Reporter", "John Hudson", "National Security Reporter Focusing On The State Department", "Ellen Nakashima"], "top_image": "https://www.washingtonpost.com/resizer/0gksYWFkjirlbs2nMRNYdRKTzLo=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/X6QDUZDY3EI6TPJFZGEVKXTXMY.jpg", "published_at": "2019-10-21"}