{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7627985/Flesh-eating-bug-Daintree-ulcer-spreading-like-wildfire-Australia-doctors-NO-IDEA-stop-it.html", "downloaded_at": "2019-10-30 00:15:47.459672+00:00", "title": "Flesh-eating Daintree ulcer spreading in Australia and doctors have NO IDEA how to stop it", "language": "en", "text": "Another warning has been issued as a flesh-eating bug continues to spread across Australia.\n\nDaintree ulcer is an ulcerative skin disease caused by the bacterium Mycobacterium ulcerans.\n\nAnother person has been struck down with the bug in Far North Queensland, the fifth confirmed case in the region this year.\n\nAlso known as Bairnsdale Ulcer, it starts as abnormal tissue growth before eating through flesh and leaving nasty wounds.\n\nScroll down for video\n\nDaintree ulcer is an ulcerative skin disease caused by the bacterium Mycobacterium ulcerans (stock image)\n\nThe flesh-eating ulcer was previously confined to the Daintree and Mossman rivers, north of Cairns, but is spreading in Victoria too\n\nThe flesh-eating ulcer was previously confined to the Daintree and Mossman rivers, north of Cairns, the Cairns Post reported.\n\nBut the vicious flesh-eating disease has since moved south to Victoria's Mornington Peninsula, with at least 213 people falling victim to it this year.\n\nTropical Public Health Cairns physician Dr Richard Gair said research has been conducted to determine how the disease only exists in certain regions.\n\n'As yet we have no definite explanation for why it is found in any area including the areas in Victoria nor the Daintree Mossman area,' he said.\n\nThere is currently not much known about the infection, but it is believed to be spread by mosquitoes, from possums to humans.\n\nThere is currently not much known about the infection, but it is believed to be sprad by mosquitoes (stock image)\n\n'Work has been underway to investigate the disease for many years in the Mossman Daintree area, in collaboration with James Cook University and the World Health Organisation collaborating centre in Victoria,' Mr Gair said.\n\nMicrobiologist Tim Stinear of the University of Melbourne is worried the disease will spread more.\n\n'I agree that's a real shift… it might suggest that the (infection) reservoir has shifted. I think that's cause for concern and definitely needs investigation,' he told The Australian.\n\nThe bacteria destroys skin cells, small blood vessels and even fat under the skin which causes the nasty ulcer and loss of skin.\n\nThe bacteria destroys skin cells, small blood vessels and even fat under the skin which causes the nasty ulcer and loss of skin (stock image)\n\nThe ulcer gets larger over time which is why early diagnosis is critical to minimise skin loss.\n\nJames Cook University professor John McBride said he was concerned about the spread of the disease.\n\n'You might take the view that the first case was an anomaly, but the second and third cases make you think it is spreading,' he said.\n\nAn article published in the Medical Journal of Australia (MJA) in April last year, reports the tissue-destroying infection which has spread in Australia by more than 400% since 2010.", "description": "Another person has been struck down with the bug in Far North Queensland, the fifth confirmed case in the region this year.", "authors": ["Lauren Ferri", "Sahar Mourad For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/22/20350600-0-image-a-3_1572388099724.jpg", "published_at": "2019-10-29"}