{"pub": "indiatimes", "url": "https://timesofindia.indiatimes.com/blogs/mind-the-gap/denmarks-international-reputation-is-being-spoiled-by-those-who-lack-knowledge-of-danish", "downloaded_at": "2019-10-09 18:29:58.932307+00:00", "title": "Denmark’s international reputation is being spoiled by those who lack knowledge of Danish", "language": "en", "text": "Travelling from Copenhagen, the capital city of Denmark, to four Australian cities like Sydney, Melbourne, Adelaide and Brisbane, is equal to embarking on the longest and farthest journey to any cities in the world. With a few exceptions of cities in New Zealand, one simply cannot get any further by airplane, a bit unadvisable, some would say, when we are facing a climate crisis. You may have to take a short course on how to keep the blood circulation in your legs stable, because the quickest one-stop flight to Australia from Denmark takes close to 24 hours.\n\nYet, journalists from faraway cities and countries do come to visit Denmark to discover the mystery of how to be one of the happiest countries in the world. Hamish Macdonald from ABC News Australia visited Denmark this summer, and yesterday he published a short documentary with the title, “The State of Denmark” on ABC News’s Facebook site. It has already gone viral and it may tarnish the glamorous image of Denmark, because it portrays a a country being totally overtaken by right-wing politicians.\n\nHamish Macdonald can be excused for having travelled so far and for having attempted to understand a country that is located so far away from his homeland, because despite its homogeneous population, its culture, climatic conditions, and history are very different from Australia. The other complexity is language. Understanding Denmark without understanding Danish often leaves you at the mercy of interpretation and translators.\n\nHamish Macdonald’s video is a classic example of how journalists should avoid the pitfalls of drawing broad and sweeping conclusions based on exceptions. Rasmus Paludan, a right-wing Danish politician, gets more than necessary exposure in his documentary, now available for the global audience to see and form an opinion about. In the recently held elections in Denmark, Rasmus Paludan, who advocates throwing all Muslim immigrants out of the country, was not granted one single seat in Parliament. The Danes rejected his politics outright in a democratic exercise. What Denmark has refused, is to curb his freedom of speech. This is a credit and not a subject of criticism, as Hamish Macdonald uses Paludan’s speech, among a few other interviews, to portray Denmark as a country that mistreats its minorities. It is literally as far from the truth as Melbourne is from Copenhagen.\n\nThe Danes have recently shown that they value freedom of speech as one of the most fundamental human rights, and in the recent history of the country, both politicians and the Supreme Court of Denmark have refused stubbornly to curtail anyone’s right to free speech. Hence Rasmus Paludan gets to publicly state that Muslims are not welcome in Denmark, and is allowed to play football or handball by kicking The holy book of the Muslims, The Koran. This is detestable to many Danes, as well, but the perception of free speech in Denmark inculcates the idea that even religious thoughts can be challenged, criticized, mocked and laughed at.\n\nIn most democracies in the world, such acts would be considered blasphemous, and banned. Denmark, in trying to stay in line with their historical approach of applauding freedom of speech has allowed caricature drawing of the prophet Muhammad in the newspaper Jyllands-Posten, resulting in the biggest foreign policy crisis of the country. Once again, some interpreted the caricature drawing of the prophet Muhammad in Danish newspapers as blasphemy. Some Muslim countries like Pakistan even saw demonstrations demanding death penalty for the cartoonists who made those drawings. Since then, many of the cartoonists have gone underground and vanished from public life for security reasons.\n\nWhen Hamish Macdonald and ABC news of Australia make a sweeping judgement of Denmark based on Rasmus Paludan and by interviewing another member of a political party known for strict immigration policies, DPP, the Danish People’s Party, he forgot to tell something important here that the international audience needs to know. As previously mentioned, Paludan’s party, Stram kurs, did not win a single seat and DPP was decimated in the last election and lost 21 seats. Martin Henriksen from DPP, who gives an interview to Hamish Macdonald, did not get back his seat in the parliament.\n\nOn the other hand, the Danish electorate voted for many new politicians and many young women candidates. In fact, Denmark has the youngest prime minister in its history, Mette Frederiksen, and she is probably one of the youngest prime ministers in the world. But these candidates who entered the parliament and won the sympathy of the voters do not get any voice in the documentary, “The State of Denmark”.\n\nIn a less serious mode, it is time for ABC News to revise the ABC of journalism. There are exceptions that prove the rule but there are exceptions to this rule, as well. So it is always a good idea to take the nuances and also interview people who are part of the mainstream media and politics.\n\nDenmark has accepted and integrated far more refugees than most other developed countries in the world. It has also received a record number of migrants from other Western countries, including Australia, who love to be here because of its generous welfare state. Denmark is a democracy and a monarchy at the same time. The Danish crown prince has married an Australian woman, referred to respectfully as kronprinsesse Mary. The fear of mass expulsion is exaggerated, as Denmark is a signatory to most of the human rights conventions of the United Nations. Mass expulsions, judicially speaking is impossible for Denmark.\n\nYes, Hamish Macdonald is right, Denmark, like Australia and the rest of the Western world, has tightened its immigration rules. It is a tiny country of five million people, and there is now a political consensus in the country to take a smaller number migrants and refugees so as to facilitate their integration.\n\nDenmark wants to avoid falling into the pitfalls of Germany and Sweden, which received a larger number of refugees and migrants and are now seeing the mushrooming of ghettos, where crime and unemployment rates are inconceivably high. Unfortunately, the documentary, “The State of Denmark” states more about how inadequate linguistic skills and lack of proper fieldwork result in hasty generalizations, and says very little about Denmark.", "description": "Travelling from Copenhagen, the capital city of Denmark, to four Australian cities like Sydney, Melbourne, Adelaide and Brisbane, is equal to embarking on the longest and farthest journey to any cities in the world. With...", "authors": ["Mrutyuanjai Mishra"], "top_image": "https://timesofindia.indiatimes.com/blogs/wp-content/uploads/2015/04/mmprofile.jpg", "published_at": "2019-10-09"}