{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/10/04/fake-news-email-reveals-lapse-by-fox-newss-chris-wallace", "downloaded_at": "2019-10-04 16:53:32.411183+00:00", "title": "‘Fake news’: Email reveals lapse by Fox News’s Chris Wallace", "language": "en", "text": "Media critic\n\nJournalists commonly take leave of their senses when they communicate with sources via email. They toss out insincere compliments, they make vague and unseemly promises, they disengage from all those refresher sessions on journalistic ethics.\n\nAnd they use terms they don’t like to cozy up to government officials. At least, that’s what Fox News host Chris Wallace did back in December 2017 in correspondence with then-Treasury Department spokesman Tony Sayegh. The host of “Fox News Sunday” was engaging in a little competitive one-upmanship, criticizing a question by CNN “State of the Union” host Jake Tapper. “Is this right?” wrote Wallace, in an email obtained by Democracy Forward via a Freedom of Information Act request and published by the Hollywood Reporter’s Jeremy Barr. “Was the first question Tapper asked the secretary about the special counsel?”\n\nAccording to the transcript, yes: In an interview with Treasury Secretary Steven Mnuchin on Dec. 17, 2017, Tapper started out with this inquiry: “Would it alarm you if President Trump fired [Special Counsel Robert] Mueller?”\n\nMnuchin responded, “I haven’t heard the president — I was with the — at dinner last night with the president and vice president. I haven’t heard anything about this, any firing. But we have got to get past this investigation. It’s a giant distraction. Nobody has said that in any way this impacted the outcome of the election.” He also said that dismissing Mueller would be “up to” President Trump. There was immediate context for the question about the special counsel, considering that Trump World was apoplectic about a move by Mueller’s team to obtain emails from Trump’s presidential transition operation. Legal experts, said Tapper, opined that the controversy could serve as a “pretext” for Mueller’s firing.\n\nIn his correspondence with Sayegh, Wallace thought Tapper’s question was off base: “As much as I hate the expression ‘fake news’ — this is a perfect example of it — especially on the week the country gets a massive overhaul of the tax code,” he wrote back to Sayegh. Such blandishments reflect the hypercompetitive nature of the Sunday public affairs shows, which jockey among each other for the best guests.\n\nWallace has spoken out against the demonization of media during the Trump era. As further proof that he doesn’t like the term he deployed, Wallace in November 2018 pressed Trump on his anti-media rhetoric in an interview. After the president dodged accountability for his words, Wallace went straight at him: “But, sir, leaders in authoritarian countries like Russia, China, Venezuela, now repress the media using your words.”\n\nRight! The Erik Wemple Blog can stomach a lot of depravity in emails between journos and sources — those communications, after all, aren’t a finished journalistic product, which should determine the reputation of news folk. Invoking “fake news” to tar the work of a peer, however, is far worse. “Fake news,” remember, applies to deliberately false stories posted on the Internet to draw fungible clicks and stoke political division — despite Trump’s attempts to widen the term’s purview. No one in Trump’s orbit needs encouragement — especially from a towering figure like Wallace — to unsheathe this poisonous term.\n\nIn any case, history has endorsed Tapper’s instincts here, as he was alighting on what may survive as Trump’s most naked attempt to abuse his executive authority. Approximately one month after Tapper quizzed Mnuchin about the special counsel’s job security, the New York Times’s Michael S. Schmidt and Maggie Haberman reported that Trump in June 2017 had indeed ordered the firing of Mueller, via White House counsel Donald McGahn.\n\nJust how did Trump greet that investigative report? “Fake news, folks,” he said. “Fake news. A typical New York Times fake story.” So the president and Wallace appeared to agree on this.\n\nThe Mueller report, which surfaced in April, disagreed, however. It confirmed the New York Times story point by scandalous point. “Substantial evidence … supports the conclusion that the President went further and in fact directed McGahn to call Rosenstein to have the Special Counsel removed,” it found.\n\nAsked about the situation, a Fox News spokesperson responded that Wallace is “proud of the tough and probing interview he did with Treasury Secretary Mnuchin in which he asked at least 10 questions about the tax bill that had just been passed, including whether wealthy Americans need all of those tax breaks and if the GOP tax plan will create a more complicated tax system.”\n\nNo doubt: Wallace’s session with Mnuchin was a model of interview-accountability journalism, chockablock with numbers and research and a polite but stern skepticism. “The president was on the South Lawn … and said, four, five or six percent growth. We do not really believe that, do you?” he asked of Mnuchin, in what turned out to be a prescient question.\n\nIt’s unclear from the email why Wallace thought a question about firing Mueller was “fake news.” Perhaps his decades in Washington journalism have taught him that presidents of the United States just don’t sink to such a level of corruption. We’re all learning on the job here.\n\nA CNN spokesperson issued this statement: “Turns out Chris Wallace is no different than many of his peers at Fox News. It’s disappointing that he’d need to take cheap shots at another journalist to curry favor with this administration.” Actually, Chris Wallace is much different from many of his peers at Fox News, which is why this “fake news” moment comes as such a surprise.\n\nRead more:\n\nAnn Telnaes: Trump takes aim at a free press\n\nJennifer Rubin: How you know Trump is in a full panic\n\nErik Wemple: Fox News claims scoop that was buried in a New York Times story months ago\n\nPaul Waldman: How right-wing media will shape the impeachment battle\n\nJennifer Rubin: Standing up for the First Amendment", "description": "Tells treasury official that a question posed by Tapper was 'fake news.'", "authors": ["Erik Wemple", "Media Critic With A Focus On The Ups", "Downs", "Downs Of The Cable-News Industry.", "Media Critic", "October At Am", "The Washington Post'S Media Critic", "Focuses On The Cable-News Industry. Before Joining The Post", "He Ran A Short-Lived", "Much Publicized Local Online News Operation"], "top_image": "https://www.washingtonpost.com/resizer/RMycjMwy8QSeeISjHTNu3vZij2I=/1484x0/d1i4t8bqe7zgj6.cloudfront.net/11-17-2017/t_1510948272419_name_20171117_walllace.jpg", "published_at": "2019-10-04"}