{"pub": "wsj", "url": "https://wsj.com/articles/flooded-missouri-river-towns-wrestle-with-their-futures-11568194201?mod=rsswn", "downloaded_at": "2019-09-11 13:55:25.251518+00:00", "title": "Flooded Missouri River Towns Wrestle With Their Futures", "language": "en", "text": "March flooding left nearly 200 homes uninhabitable and abandoned in the housing development of Paradise Lakes in eastern Nebraska. The town plans to demolish it.\n\nWINSLOW, Neb.—Six months after floods submerged this tiny community in eastern Nebraska, many residents want to pick up the entire village and move it to higher ground.\n\n“I’m all for it if we can get it done. I don’t want to go through this again,” said Jeremy Woodring, a 46-year-old truck driver. Five feet of water in the main floor of his house destroyed furniture and appliances, and the saggy floors are still littered with debris.\n\nAcross an unpaved street shaded by large trees, Don Heinke, 72, lost three vehicles in the flood but wants to remain in his home of 33 years. “I’m not going anywhere,” he said. “They couldn’t get me out of here with a crowbar.”\n\nRecord flooding in the Midwest this spring was made worse by the frozen ground, snow pack, heavy rain and ice jams on rivers, putting some areas under water for the first time in decades. Now many residents are wrestling with whether to stay and rebuild, or start fresh somewhere else.\n\nTheir decisions—complicated by uncertainty about how much federal and state aid will be available for rebuilding or relocating—will ultimately determine whether some communities themselves survive.\n\nRalph Weatherly is repairing his flood-damaged home in Winslow, Neb.\n\nIn March, flooding on the Platte and Missouri Rivers forced more than 400 people to evacuate Pacific Junction, Iowa, about 20 miles south of Omaha, Neb.\n\nCatie Nuss and her husband, Chris Nuss, have been repairing their 4,900-square-foot house in Pacific Junction while living out of a recreational vehicle in their driveway, along with her mother-in-law, their three sons and three dogs. “I feel like I’m living in a room and the walls are closing in,” she said.\n\nThe spring 2019 outlook from the National Oceanic and Atmospheric Administration contained a warning: portions of the Midwest were due for major flooding. WSJ talks with a National Weather Service representative to learn what’s behind the prediction. Photo: Getty Images\n\nThe family received just under $35,000 in assistance through the Federal Emergency Management Agency, the maximum amount for 2019, for repairs, Ms. Nuss said. They have tapped savings and retirement accounts to spend $60,000 so far on work that she estimates could total $120,000.\n\nMs. Nuss, who recently took a job at a Harley-Davidson dealership to help pay the costs, said she and her husband, a diesel technician, hope to move back in by October and continue doing work.\n\n“We can’t afford to go anywhere else,” said Ms. Nuss, 33 years old, standing in the gutted rooms of what she called her “forever home.”\n\nPacific Junction, Iowa\n\nPacific Junction, Iowa, before flood | Missouri River, Aug. 10, 2018 Photo: DigitalGlobe/Maxar\n\nPacific Junction, Iowa, during flood | Missouri River, March 18, 2019 Photo: DigitalGlobe/Maxar\n\nMany who left Pacific Junction, where houses were underwater for nearly a month, don’t plan to return. Only 28 families have said they would rebuild, while 146 have said they would prefer to be bought out and move away and others remain undecided, said Korrena Neppl, the city clerk.\n\nMs. Neppl’s home, her office downtown and a restaurant called the Rusty Rail that she was about to open all were damaged by the flood. The town isn’t in a flood zone and hadn’t flooded in decades, according to Ms. Neppl, 58. She wants to stay and rebuild, while her husband wants to move.\n\nShare Your Thoughts What would you do in this situation? Rebuild or move, and why? Join the conversation below.\n\n“He’s afraid of re-flooding,” said Ms. Neppl, standing in her restaurant where the water left its mark 8 feet up the walls paneled with barn wood she had salvaged. “I tell him there’s no guarantees in life anywhere. He just thinks it’s plain stupid.”\n\nMs. Neppl said she and her husband, who didn’t have flood insurance, received $32,000 in flood relief from FEMA and have so far spent about $15,000 on repairs.\n\nBuyouts will complicate the town’s recovery. Under a program funded largely by FEMA, homeowners can sell land to communities and either demolish or relocate houses. In both cases, the land can’t be built on again, and some residents worry that a host of buyouts would leave the town studded with empty lots.\n\n“We’ll recover. It’s just going to be hard,” said Mayor Andy Young, as he worked on his daughter’s house, whose new plasterboard walls had yet to be painted.\n\nOther communities face uncertain futures. In nearby Bellevue, Neb., a housing development called Paradise Lakes is now abandoned and weed-strewn. The town plans to demolish it.\n\nIn Winslow, water from the Elkhorn River swept past a levee and a barrier residents set up. The last time any homes here flooded was 1996, residents say.\n\nRick Addink, Ed Nelson and Jeremy Woodring in Winslow, which flooded in March.\n\nZachary Klein, a village trustee, said he hopes to save the community by picking up houses and moving them several miles away, possibly in 2021. He said the state will help cover a large portion of the cost of moving a house and that private donors could help buy one of several parcels being considered for the relocation.\n\nToday, about 25 of the more than 100 people who once lived there remain in the village, and only about 7 of 50 homes are occupied. All of them had flood damage. The village’s real estate has been valued at roughly $1.8 million, compared with $2.3 million before the flood, and it will likely cost several million dollars to purchase land and move the structures, Mr. Klein said.\n\nHe acknowledged there is rift among residents over relocating, but said most are in favor of it.\n\n“It does hurt me. I like my small town,” he said. “We’re trying to do the right thing by those who want to stay.”\n\nMany houses in Winslow are uninhabitable.\n\nWrite to Kris Maher at kris.maher@wsj.com", "description": "Six months after floods submerged towns in eastern Nebraska and western Iowa, some residents say they never will return while a few want to pick up their entire village and move it to higher ground.", "authors": ["Kris Maher", "Photographs Alex Wroblewski For The Wall Street Journal", "Kris.Maher Wsj.Com"], "top_image": "https://images.wsj.net/im-105727/social", "published_at": "2019-09-11"}