{"pub": "yahoo", "url": "https://news.yahoo.com/us-consumer-has-been-rattled-101104165.html", "downloaded_at": "2019-09-25 13:41:59.219433+00:00", "title": "The US consumer has been rattled: Morning Brief", "language": "en", "text": "Wednesday, September 25, 2019\n\nGet the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. Subscribe\n\nIt’s grim all around\n\nConsumer spending is the most important driver of U.S. economic growth.\n\nAnd recent data suggests this year's blockbuster run for shoppers could be coming to an end.\n\nOn Tuesday, The Conference Board's September reading on consumer confidence showed confidence sharply declined in September.\n\nBut the headline reading of 125.1 — which is still elevated by historical standards — belies more troubling drops in confidence regarding consumers’ view of the labor market and their expectations for the economy.\n\nThe Conference Board’s expectations index dropped to 95.8 in September, the lowest reading since January. And the “jobs plentiful” component of the report, which measures the proportion of consumers who think jobs are easy to find, logged its 5th-largest monthly decline on record in September, according to Bespoke Investment Group.\n\n\"The escalation in trade and tariff tensions in late August appears to have rattled consumers,\" said Lynn Franco, senior director of economic indicators at The Conference Board.\n\n\"In one line: Grim all round,\" wrote Ian Shepherdson, chief U.S. economist at Pantheon Macroeconomics following Tuesday's report.\n\n\"[The] proportion of people expecting conditions to worsen over the next six months rose to a six-year high,\" Shepherdson added. \"It’s now in line with the readings seen just before the recessions of 1990, 2001, and 2007, so it needs to be watched closely.\"\n\n\"Despite the continued low level of jobless claims, the net share of consumers reporting jobs are hard to get eased back to -33.2 from -38.3,\" noted Michael Pearce, senior U.S. economist at Capital Economics.\n\n\"The survey also suggests that those short-term worries are more than offsetting any boost to spending from lower interest rates. The share of consumers with plans to buy a house, a vehicle or major appliances have all trended lower over recent months.\"\n\nThe report's present situation index also dropped sharply in September, which Neil Dutta at Renaissance Macro notes has typically been a useful gauge in judging big changes in employment.\n\n\"The message today is not especially encouraging,\" Dutta writes. \"Consumers see slower jobs growth.\"\n\nTwo weeks ago, we highlighted work from economists at Deutsche Bank who argued the economy was close to a \"tipping point.\"\n\nDeutsche Bank’s thesis was simple: an escalating trade fight was likely to lead to slower job growth. And slower job growth would lead to slower consumer spending.\n\nRight now, consumer spending is what’s keeping this expansion alive. In the second quarter, consumption grew at annualized rate of 4.7%, the best reading since the crisis.\n\nBut if consumers are starting to view the labor market less favorably, a resulting pullback in spending puts continued economic growth at risk.\n\nBy Myles Udland, reporter and co-anchor of The Final Round. Follow him @MylesUdland\n\nWhat to watch today\n\nEconomy\n\n7 a.m. ET: MBA Mortgage Applications, week ended September 20 (-0.1% prior)\n\n10 a.m. ET: New Home Sales, August (656,000 expected, 635,000 in July); New Home Sales quarter-on-quarter, August (3.6% expected, -12.8% in July)\n\nFrom Yahoo Finance\n\nReporter Melody Hahm hosts the next installment of Breakouts with Reddit COO Jenn Wong. Watch it live from Subculture in New York City at 5 p.m. ET on Yahoo Finance.\n\nRead more\n\nTop News\n\nFILE - In this Feb. 13, 1999, file photo, a woman views newspaper headlines announcing the acquittal of President Bill Clinton in Sacramento, Calif. Donald Trump joins a small group of fellow presidents now that he's the subject of an official impeachment inquiry in the House of Representatives. Only three of his predecessors underwent similar proceedings: Andrew Johnson and Bill Clinton, who were acquitted after trials in the Senate, and Richard Nixon, who resigned to avoid being impeached in connection with the Watergate scandal. (AP Photo/Bob Galbraith, File) More\n\nTrump’s potential impeachment and the stock market: What history tells us [Yahoo Finance]\n\nNike earnings, sales top Wall Street's expectations for 1Q 2020 [Yahoo Finance]\n\nChina's Aug rare earth magnets exports to U.S. hit highest since at least 2016 [Reuters]\n\nAramco is set to formally announce listing plan next month [Bloomberg]\n\nYAHOO FINANCE HIGHLIGHTS\n\nThe Bernie Sanders billionaire-eradication plan\n\nMore millennials have higher salaries than Gen Xers, boomers\n\nNestlé-owned Sweet Earth launches plant-based Awesome Burger\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.", "description": "Top news and what to watch in the markets on Wednesday, September 25, 2019.", "authors": ["Myles Udland", "Markets Reporter"], "top_image": "https://s.yimg.com/uu/api/res/1.2/54ZkNYJQ697UmaDLizBx7A--~B/aD0zMjY0O3c9NDkyODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/a1eb7650-df0e-11e9-96bf-d6d26778406e", "published_at": "2019-09-25"}