{"pub": "nytimes", "url": "https://nytimes.com/2019/10/28/opinion/economic-growth-statistics.html", "downloaded_at": "2019-10-28 13:24:07.522689+00:00", "title": "Opinion | The Way We Measure the Economy Obscures What Is Really Going On", "language": "en", "text": "In the decades following World War II, national accounts provided a measure that reflected economic progress throughout the country. From 1963 to 1979, as the economy grew, people at all levels — rich, poor, middle class — saw their income grow at about the same rate. Over that period, the economy grew at an average of 1.7 percent annually and most Americans’ income growth stayed closed to the average. In fact, the poorest saw their incomes rise much faster than the average while the richest saw their incomes rise much slower. Incomes among the bottom half rose by 2.6 percent per year while the top 1 percent saw theirs rise by 1 percent.\n\nKuznets never intended for his national account scheme to become the country’s most relied upon measure of economic progress. In his original report to Congress, he wrote: “The welfare of a nation can, therefore, scarcely be inferred from a measurement of national income.” Kuznets understood that the tools he gave policymakers were limited. They didn’t take into account all the aspects a true measure of economic well-being would. By definition, national accounts tabulate only goods with a price tag, leaving out all the things we do for each other, like the unpaid time that parents spend caring for their children, or the unpaid time adult children spend caring for their aging parents.\n\nThere are other problems as well. When a factory spews toxic fumes into the surrounding air, this doesn’t get subtracted from national income, and we don’t count the negative effect on the lungs of all the people nearby. Worse yet, the money that is spent to clean up the air — and the money that is spent to care for the rise in asthma for the local population — gets counted as an increase in output.\n\nRising economic inequality since Kuznets’s era has made gross domestic product even less informative. Back then, an upward shift meant that incomes grew across the nation; today a rise is more likely to indicate sharp spikes in income for a relative few at the top.\n\nThe economists Thomas Piketty, Emmanuel Saez and Gabriel Zucman have done groundbreaking work to disaggregate the national accounts data to show how those at all income levels were faring year to year and over a longer span of time. Their data show that in the decades since 1980 (ending in 2016, the most recent year for which data are available), the aggregate measure of national income grew at an average of 1.3 percent annually — but this aggregate income growth went disproportionately to those at the top of the income ladder. For those in the top 10 percent, income rose by 2 percent while the top 1 percent enjoyed a whopping 2.9 percent rise in annual income. The bottom 90 percent saw its income rise by 1 percent.", "description": "By looking mainly at the big picture, we are missing the reality of inequality — and a chance to level the playing field.", "authors": ["Heather Boushey"], "top_image": "https://static01.nyt.com/images/2019/10/24/opinion/24Boushey/24Boushey-facebookJumbo.jpg", "published_at": "2019-10-28"}