{"pub": "abcnews", "url": "https://abcnews.go.com/US/viral-beer-money-request-reportedly-generates-million-donations/story?id=65783221", "downloaded_at": "2019-09-22 23:12:08.399759+00:00", "title": "Viral 'beer money' request reportedly generates $1 million in donations for children's hospital", "language": "en", "text": "A college football fan who made a social media plea for \"beer money\" and turned the humorous request into a fundraising effort for a children’s hospital has now reportedly reached $1 million in donations.\n\n\"We just reached a million in total contributions,\" Carson King, the man who launched the fundraising effort, tweeted on Sunday, along with \"Let’s goooo!\" and \"We’re not done yet!\"\n\nKing said the money is being raised through his Venmo account.\n\nIt all started as a joke when King, 24, waved a sign that read \"Busch Light Supply Needs Replenished,\" under which he'd scrawled his Venmo handle in black Sharpie, on Sept. 14 during ESPN's \"College GameDay.\"\n\n\"I thought it would just be a joke,\" King told \"Good Morning America,\" on Friday. \"I didn't think anyone would actually see it.\"\n\nCarson King\n\nWhen his Venmo account hit $600, he spoke to his family for advice and decided to change course. He took to social media to announce that after covering the cost of a case of Busch Lite, he would be donating the rest of the proceeds to the University of Iowa Stead Family Children's Hospital.\n\nAfter the \"GMA\" broadcast, money transfers and donations flooded his Venmo account. Within hours, he'd received more than 2,000 notifications, King told \"GMA.\"\n\nBusch Beer and Venmo announced on Twitter that they would match King’s donation. As of Friday, King had raised $157,000.\n\nKing told \"GMA\" he intends to keep his Venmo account open for donations as they continue to appear until the end of the month. After that, he will cut a check from the money in his account and present it to the hospital in person, where he will go on a tour of the hospital facilities and get to meet some of the kids who will benefit from the massive donation.\n\n\"We can’t think – our minds are blown by this,\" tweeted an account which states is the official Twitter account of University of Iowa Stead Family Children's Hospital. \"Thank you to everyone who helped reach this milestone! We’re so grateful!\"\n\nABC News’ Laura Laughead contributed to this report", "description": "Carson King, 24, in a tweet said that donations just hit the $1 million mark.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/CarsonKing_190918_CA3_hpMain_16x9_992.jpg", "published_at": "2019-09-22"}