{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Wellness/woman-sisters-surrogate-breast-cancer-diagnosis/story?id=53276034", "downloaded_at": "2019-10-28 09:51:13.367600+00:00", "title": "Woman becomes sister’s surrogate after breast cancer diagnosis", "language": "en", "text": "October is Breast Cancer Awareness Month. To mark the month, we’re sharing stories of breast cancer journeys.\n\nRandi Fishman said she was devastated to be told by doctors before the age of 30 that she should look into surrogacy after a recurrence of breast cancer.\n\n“It was really hard,” Fishman, now 34, told \"Good Morning America.\" “I definitely always thought it was something I was going to be able to do and the thought of someone else carrying my own child, I couldn’t even imagine it.”\n\nRandi Fishman\n\nNearly seven years later, Fishman is the mother of an 11-week-old daughter who was delivered by Fishman’s sister, Erin Silverman.\n\nRandi Fishman\n\n“I’m her sister. If I can have a baby for her, why not. Of course, I was going to do it,” Silverman told ABC News. “It’s not even a question. It’s the least I can do.”\n\nThe 35-year-old said she always told her younger sister, who lives just minutes away from her in Potomac, Maryland, that she would be her surrogate as soon as she was done having her own children.\n\nThe mother of two daughters, ages 3 and 2, started the surrogacy process for her sister in 2016. She underwent months of medical tests and shots to make sure she was healthy enough to carry Fishman’s baby.\n\nSilverman is the only one of three daughters in her family to not carry the BRCA1 gene, which can greatly increase a woman’s risk of developing cancer, particularly breast and ovarian cancers, according to the National Cancer Institute.\n\nErin Silverman\n\nFishman, who has the gene, was diagnosed with breast cancer at age 28. She underwent a double mastectomy and then multiple rounds of radiation after she was diagnosed with a recurrence of breast cancer nearly one year after her mastectomy.\n\nAfter her first diagnosis, Fishman decided to freeze her embryos, which were tested for the BRCA1 gene. Only the embryos that were negative were used for implantation, according to Fishman.\n\nShe and her husband used a surrogate in Wisconsin to welcome their first child, a now 3-year-old daughter, Parker.\n\nFishman said she felt extremely lucky to be able to not only have her sister carry her second child but to be there by her side as she went through the pregnancy.\n\nErin Silverman\n\n“With our first surrogate, I wasn’t there and had to just trust her with everything,” she said. “With my sister, I got to go to every doctor’s appointment and help her as much as I could.”\n\nThe situation with Fishman watching over Silverman even became comical at points, like when the families went to dinner together and Fishman caught herself monitoring her sister’s food.\n\n“We were out to dinner and she ordered a Caesar salad and I yelled at her, ‘That has raw eggs in it. You can’t eat that,’” Fishman recalled. “And she was like, ‘I know what I’m doing.’”\n\nFishman was also there to help Silverman as she was put on bed rest in the final weeks before delivering Fishman’s daughter, Austyn Harli, on December 8, 2017.\n\nErin Silverman\n\n“It was the most incredible gift that I’ve ever given to anybody,” said Silverman, who also credits her husband with getting her through the pregnancy. “I want to share my story to inspire others, even if one other person does what I did.”\n\nDr. Jeanne O’Brien, who oversaw the care of Fishman and Silverman at Shady Grove Fertility in Maryland, said in her practice \"very few\" gestational carrier pregnancies involve a direct family member.\n\n\"This was an amazing experience to help a couple facing a devastating diagnosis preserve their ability to not only have children but children that would not face the genetic cancer risk of the BRCA gene,\" O'Brien told ABC News. \"The involvement of Randi’s sister strengthened the shared commitment to achieving another successful pregnancy. I’m grateful to have been their physician.\"\n\nFishman recently underwent a full hysterectomy to prevent the risk of ovarian cancer. She said going through a \"couple of crazy, hard years\" following her breast cancer diagnosis has paid off.\n\nErin Silverman\n\n\"It’s crazy to me,\" she said. \"I didn’t think I would be able to have a family with kids and I had pictured that my entire life.\"\n\nShe continued: \"When I got the diagnosis, I didn’t know what was going to happen with my life, and it’s just unreal today that I have these two amazing, healthy babies. It’s the best gift ever.\"\n\nThis report was originally published on February 23, 2018.", "description": "Randi Fishman was diagnosed with breast cancer at age 28 and didn't think she would ever have kids.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Health/erin-silverman-austyn-ht-jc-180223_16x9_992.jpg", "published_at": "2019-10-28"}