{"pub": "cbc", "url": "https://cbc.ca/radio/nowornever/how-to-get-out-of-your-social-bubble-1.5296995", "downloaded_at": "2019-10-27 00:01:35.023141+00:00", "title": "CBC Radio", "language": "en", "text": "Studies have found about one in five Canadians experience loneliness or social isolation. Some experts have even argued that being lonely for long periods could be more harmful than smoking 15 cigarettes a day.\n\nThat's why Now or Never is hoping to nudge you to step outside your social bubble — and meet the strangers that are all around.\n\nWho do you want to meet? Tell us by filling out our Now or Never Nudge... and we might even send you a merit badge!\n\nNot sure where to start? Here's how this week's guests are bravely bursting their social bubbles:\n\nBaşak Büyükçelen’s monthly dinners help build bonds — one supper at a time. 1:40\n\nBaşak Büyükçelen's monthly Supper Society dinners help newcomers build bonds with established Canadians — one meal at a time. Büyükçelen, who came to Canada from Turkey, was inspired by one magical supper she shared:\n\n\"I was invited to a Thanksgiving dinner by a friend of a friend.\" \"It turned out to be this lovely elderly couple who had been to Turkey, and they treated me like a true guest of honour. It was beautiful to see how I was not a stranger to them. It wasn't about me not knowing them or them not knowing me. It was all about making me feel at home. I spent three beautiful hours in their house.\" - Başak Büyükçelen, Supper Society founder\n\nUse amateur radio to connect with the world\n\nAmateur radio operator Therese Mair explains the hobby to Julieanne Scales at a workshop in Charlottetown, PEI. (Stephanie vanKampen/CBC)\n\nNearly every morning and every night, Therese Mair — who goes by the call sign VY2 TAM — uses her ham radio to send her voice from Georgetown, PEI out in to the atmosphere. Her hope? That someone in this big beautiful world might hear her voice and say hello back.\n\n\"Sometimes you feel like you're losing hope. You can get so negative feeling about humanity. But I think the radio has made me feel that there is hope in humanity. That there are caring people around the world, just wanting to connect.\" - Therese Mair, amateur radio enthusiast\n\nMake a new friend at school\n\nWhen Shaemoore Thompson (right) began high school last week he didn't know anybody... Until John Bautista (left) reached out and made a connection. (Bridget Forbes/CBC)\n\nShaemoore Thompson didn't know anyone when he walked into Maples Collegiate in Winnipeg two weeks ago. The shy 18-year-old had just arrived from Jamaica, where it had taken him years to come out of his shell and make friends at his old school. But he's determined it will be different here in Canada.\n\n\"I still feel shy, but I'm just like 'Am I going to talk to someone today, or will I wait till next week or tomorrow?' I just want to leave a mark. I'm only here for one year so make someone remember me.\" - Shaemoore Thompson, new student at Maples Collegiate in Winnipeg\n\nGet out and go for a walk\n\nNew friends Colin and Adrian at the 2019 Walk to End Social Isolation in Vancouver. (Vivian Luk/CBC)\n\nVancouver's Walk to End Social Isolation aims to help people find some new friends and feel less isolated in the big city. Adrian Jonklaas, a self-described introvert, came to the walk hoping to connect with others like him.\n\n\"I feel fortunate that I have a partner, at least, and a wonderful daughter at home.\" \"But I don't ever think that's necessarily enough, and it also puts an undue burden on your family, too, if you're looking to them for all the emotional support that you need. So it's good to have other people outside of that circle.\" - Adrian Jonklaas, Vancouver entrepreneur\n\nPay attention to the people you see every day\n\nRick says that crossing guard Sandra always brightens his day - so Now or Never convinced him to get out of his car and say hello. (Elizabeth Hames/CBC)\n\nEvery weekday morning, Rick Bergh drives the same route home from his favourite coffee shop. And every drive, his day is brightened by seeing the same enthusiastic school crossing guard. So Now or Never nudged Rick to finally get out of his car and tell her what she means to him.\n\n\"[She] encourages me to do the same thing. To think about people who I might be in contact with and might not even speak with. It encourages me to be a little bit like her, being friendly and kind.\" - Rick Bergh of Victoria\n\nTalk to a stranger every single day... for a year\n\nMeri Spencer is an Ottawa schoolteacher who felt isolated after retiring. So she decided to do something about it and for the last year, has committed to talking to a different stranger every single day — and blogging about it.", "description": "Some experts have even argued that being lonely for long periods could be more harmful than smoking 15 cigarettes a day. That's why Now or Never is hoping to nudge you to step outside your social bubble — and meet the strangers that are all around.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5298503.1569521052!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/bubble-badge.jpg", "published_at": "2019-09-27"}