{"pub": "abcnews", "url": "https://abcnews.go.com/US/wireStory/texas-wife-calls-lawyer-spouse-reports-suspect-death-65938729", "downloaded_at": "2019-09-29 23:32:41.647996+00:00", "published_at": "2019-09-29", "title": "Texas wife calls lawyer before spouse reports suspect death", "language": "en", "text": "The wife of a Dallas man charged in the fatal shooting of someone they thought was a burglar contacted a lawyer before the husband called 911 to report a home invasion, according to police documents.\n\nJames Michael Meyer was charged with murder in Thursday's shooting, with bond set at $150,000, The Dallas Morning News reported. Online jail records had no information about an attorney to speak for Meyer, who was no longer in custody Sunday.\n\nMeyer told police he heard a noise outside around 5 a.m. Thursday and saw someone with a pickax trying to break into his storage shed, according to an arrest warrant affidavit. Meyer told police that he grabbed his gun, went out and yelled at the person to stop and not come closer or he'd shoot.\n\nMeyer told investigators the person took several steps toward him, so he fired and the burglar dropped his pickax and ran toward a nearby park.\n\nMeyer said he fired an additional shot \"into the night\" in the direction of the park, even though \"from the suspect's accounts, the threat of serious bodily injury against him was over when the complainant dropped the pickax and ran off,\" the affidavit said.\n\nMeyer, who said he didn't know whether he'd shot anyone, went back to bed. He got up around 7 a.m. Thursday and thought he saw \"a black bag\" in the park. Upon closer inspection, he found the man's body.\n\nMeyer's wife called an attorney, seeking advice, before her husband called 911 to report he was the victim of a crime and that medical help was needed, according to the affidavit.\n\nThe Dallas County Medical Examiner's Office on Sunday had no details on the case and referred questions about the unidentified suspect to police. Spokesman Sgt. Warren Mitchell said he did not have access to the arrest affidavit Sunday.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": ""}