{"pub": "afr", "url": "https://afr.com/companies/retail/metcash-challenger-irexchange-falls-into-administration-20191023-p533ei", "downloaded_at": "2019-10-23 08:36:09.910788+00:00", "title": "Metcash challenger IRExchange falls into administration", "language": "en", "text": "IRExchange aimed to disrupt the grocery, liquor and pharmacy wholesaling markets by enabling independent retailers and pharmacies to order stock directly from suppliers through an online trading platform, bypassing wholesalers such as Metcash.\n\nThe company had been planning an initial public offering later this year after being forced to pull the plug on a $17 million IPO in March and resolving a $1 million legal claim from convertible noteholder James Baillieu.\n\nA company associated with two IRExchange non-executive directors, John Ayre and Mr Hicks, and a former chairman, Alan Goodfellow, agreed to pay more than $1.2 million to Mr Baillieu.\n\nMr Baillieu launched legal action in January, alleging IRExchange made false representations about customer numbers when he invested $1 million in August 2017. He also alleged it made false claims about active customer numbers in the prospectus for a proposed $17 million initial public offering which would have valued the business at about $74 million.\n\nIRExchange issued a supplementary prospectus after ASIC put an interim stop order on the original prospectus, but eventually pulled the plug on the IPO and refunded subscriptions.\n\nIn the prospectus, IRExchange claimed it had signed up more than 600 independent retailers – 50 per cent of whom were trading on the platform regularly – and 70 food, grocery and liquor suppliers including Unilever, Procter & Gamble, Reckitt Benckiser and Carlton & United Breweries.\n\nHow IRExchange works. Supplied\n\nAdvertisement\n\nThe company, which had raised more than $30 million from investors and spent at least $20 million on product and technology development, had also signed a memorandum of understanding with pharmacy wholesaler Sigma, which had taken an equity stake in the business.\n\nChaired by former Coca-Cola Amatil and Lion Dairy and Drinks executive Andrew Reeves, IRExchange aimed to achieve at least $4 billion in gross sales as retailers and suppliers shifted to its online portal to reduce costs.\n\nAccording to the last available accounts, it generated sales of $13 million in 2018 but lost $16.2 million, taking accumulated losses to $43 million.\n\nIt is understood Metcash, which has established an online supply portal known as indieDirect, is not interested in buying IRExchange.\n\nThe first meeting of creditors is expected to be held on October 29 or 30.", "description": "IRExchange, an online grocery wholesaler, has gone into administration after being sued by investors unhappy about a proposed recapitalisation.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_1%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_386%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/23e017224ab7ae7501074cf759b09f5b4964a386", "published_at": "2019-10-23"}