{"pub": "yahoo", "url": "https://news.yahoo.com/snoozing-crew-raises-specter-criminal-035320811.html", "downloaded_at": "2019-09-13 18:31:19.695535+00:00", "title": "Snoozing crew raises specter of criminal charge in boat fire", "language": "en", "text": "FILE - This Wednesday, Sept. 4, 2019, file photo provided by Santa Barbara County shows divers and support crews from many agencies working the scene of the Conception dive boat fire off Santa Cruz Island, Calif. Federal investigators say all six crew members were asleep when a fire broke out in the scuba diving boat off the coast of California, killing 34 people. (Santa Barbara County via AP, File)\n\nLOS ANGELES (AP) — Federal investigators identified a violation of Coast Guard regulations that could trigger criminal charges in the California dive boat disaster that killed 34 people.\n\nThe National Transportation Safety Board said Thursday that all crew members on the boat Conception were asleep when the pre-dawn fire broke out Sept. 2 off the coast of Santa Barbara. The boat was required to have a crew member on lookout duty, according to Coast Guard rules.\n\n\"A member of the vessel's crew shall be designated by the master as a roving patrol at all times, whether or not the vessel is underway, when the passenger's bunks are occupied,\" the boat's inspection certificate said as a condition of operation.\n\nThe Conception's burned-out wreckage was in Port Hueneme Friday morning, according to ship-tracking website marinetraffic.com , a naval base more than 60 miles (97 kilometers) northwest of Los Angeles.\n\nFederal investigators are searching for the cause of fire and looking into possible criminal charges that would likely focus on an obscure federal law known as the seaman's manslaughter statute.\n\nUnder the pre-Civil War law that can bring penalties up to 10 years in prison, prosecutors only need to show negligence or that the captain or crew committed misconduct or neglected their duties.\n\nDefense lawyers and law professors said that failure to appoint a night watchman or falling asleep on the job could be enough to bring charges.\n\n\"No watch? A boat that far offshore?\" attorney Michael Turndorf said. \"I think that fits the statute. I would be surprised, if those are the real circumstances, that somebody doesn't get charged.\"\n\nThe law was put in place to punish captains, engineers and pilots responsible for deadly steamboat accidents that killed thousands in the 19th century.\n\nA lawyer for Conception captain Jerry Boylan said he didn't believe his client had spoken with the NTSB yet and declined to answer questions about what his client did the night of the tragedy.\n\n\"I would say that he's emotionally devastated,\" attorney Michael Lipman said.\n\nAttorney James Mercante, who handles maritime law, said seaman's manslaughter law is dangerous for boat owners and officers, and it's often in their interest not to talk with investigators.\n\n\"You want to cooperate with authorities when there's a casualty. But you have to draw that fine line,\" Mercante said. \"It comes down to a decision between cooperation and incrimination.\"\n\nThe captain and four crew members were asleep on the vessel's upper deck and survived. The sixth, a 26-year-old deckhand named Allie Kurtz, was sleeping below deck and perished with the boat's 33 passengers.\n\nKurtz's grandmother, Doris Lapporte, said she was too distraught to comment on the NTSB findings, issued days before the family planned to scatter her granddaughter's ashes at sea.\n\n\"I have nightmares every day about her going up in flames,\" Lapporte said, crying. \"This isn't the time to talk about how angry I am or how I feel.\"\n\nThe victims on the Conception were a diverse collection, including a girl celebrating her 17th birthday with her parents and a friend, a marine biologist who was leading the three-day scuba diving excursion, an Indian-born dentist and her husband from Connecticut, an environmental scientist, and a professional photographer.\n\nDouglas Schwartz, an attorney for the Conception's owner, Truth Aquatics Inc., attempted to cast doubt on the NTSB's conclusion that the crew was sleeping, saying in a released statement that a witness \"seems to contradict\" that notion.\n\nA crew member was awake shortly before the fire started and checked the galley and surrounding area around 2:30 a.m., Schwartz said. The first mayday call from the captain was transmitted at 3:14 a.m.\n\nSchwartz refused to answer follow-up questions, including whether that crew member was assigned to night watch and went back to sleep after inspecting the galley.\n\nThe parents of Charles McIlvain, 44, a visual effects designer who was onboard with his neighbor, said they were greatly disturbed to hear there was no roving watchman.\n\n\"Early detection may have made an incredible difference in outcome,\" Clark and Kathleen McIlvain said in a statement.", "description": "Federal investigators identified a violation of Coast Guard regulations that could trigger criminal charges in the California dive boat disaster that killed 34 people.  The National Transportation Safety Board said Thursday that all crew members on the boat Conception were asleep when the pre-dawn fire", "authors": ["Stefanie Dazio", "Brian Melley"], "top_image": "https://s.yimg.com/uu/api/res/1.2/4vZrlE5dIgfoO2mJ.Wz3FQ--~B/aD0yMDU0O3c9Mjc0NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/3edb6876ff174f864f4943920ac1b632", "published_at": "2019-09-13"}