{"pub": "yahoo", "url": "https://news.yahoo.com/hong-kong-leaders-apologize-mosque-041124088.html", "downloaded_at": "2019-10-21 07:38:50.812832+00:00", "title": "Hong Kong leaders apologize for water cannon use at mosque", "language": "en", "text": "Hong Kong Chief Executive Carrie Lam, center, leaves a mosque in Hong Kong, Monday, Oct. 21, 2019. Lam and other officials apologized to leaders of the Kowloon Mosque after riot police sprayed the building's gate and some people nearby with a blue-dyed liquid from a water cannon as they tried to contain pro-democracy demonstrations Sunday. (AP Photo)\n\nHONG KONG (AP) — Hong Kong officials apologized to Muslim leaders Monday after riot police sprayed a mosque and bystanders with a water cannon while trying to contain pro-democracy demonstrations in the semiautonomous Chinese city.\n\nThe city's leader, Chief Executive Carrie Lam, and its police chief visited the Kowloon Mosque to say sorry to the chief imam and Muslim community leaders.\n\nThey left without commenting but the mosque leaders told reporters that the officials apologized.\n\n\"Our mosque is not damaged, nothing is done wrong. Only thing is that they should have not done it. For that they apologized so we accept it,\" said Saeed Uddin, honorary secretary of the Islamic Community Fund of Hong Kong.\n\nDuring Sunday's protest, a police water cannon truck that was passing by the mosque suddenly sprayed a stinging blue-dyed liquid at a handful of people standing in front of its gate, according to video of the incident by pro-democracy lawmaker Jeremy Tam.\n\nThe mosque's front steps, metal gate and sidewalk outside were stained with the blue liquid while the people caught in the plume were left gagging, coughing and trying to rinse the solution from their eyes, the video shows.\n\nVolunteers later arrived to help clean up, and by Monday morning the blue coating was largely gone.\n\nTam said on his Facebook page that he and two others, an Indian businessman and the head of a charity for ethnic minorities, went to the hospital to check for injuries.\n\nLocal broadcaster RTHK reported the people outside the mosque were there to guard it.\n\nHong Kong authorities scrambled to minimize the fallout from the incident, which protesters seized on as the latest example of what they call unnecessarily harsh police tactics.\n\nPolice used the water cannon along with tear gas and pepper spray to battle protesters who remained on the streets after the end of an unauthorized rally, vandalizing and setting fire to shops with mainland China ties. They were rallying to call for broader political rights and police accountability, in the latest turmoil to grip the financial center since early June.\n\nHong Kong is home to more than 300,000 Muslims, according to the Islamic Community Fund, which runs the city's five mosques and two Muslim cemeteries. They first arrived in the 19th century after being recruited in India by British colonizers.\n\nPolice said Sunday the spraying was an accident and sent representatives to meet with mosque leaders.\n\n\"It is most unfortunate that the dispersal operation has caused unintended impact on the Kowloon Mosque,\" the force said on its Facebook page.\n\nLater Monday, organizers planned an evening sit-in at a suburban train station on the three-month anniversary of a violent attack there on protesters by men with suspected organized crime ties.\n\nHong Kong's subway operator said it would close the station by early afternoon in an apparent bid to foil the protesters, who have trashed and torched subway facilities in anger at the operator's support for authorities.\n\n___\n\nFollow Kelvin Chan at twitter.com/chanman", "description": "Hong Kong officials apologized to Muslim leaders Monday after riot police sprayed a mosque and bystanders with a water cannon while trying to contain pro-democracy demonstrations in the semiautonomous Chinese city.  The city's leader, Chief Executive Carrie Lam, and its police chief visited the Kowloon", "authors": ["Kelvin Chan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/fOb8FcshcUkH0gQN5C6x4w--~B/aD0yMDA0O3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/01fdb44148d5bc70bb674feb148ed27e", "published_at": "2019-10-21"}