{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/27/tony-romo-could-make-cut-safeway-open-chagrin-darren-rovell-cbs", "downloaded_at": "2019-09-27 16:24:21.335832+00:00", "title": "Tony Romo could make the cut at Safeway Open, to the chagrin of Darren Rovell and CBS", "language": "en", "text": "\n\nTony Romo, PGA Tour competitor. (Jonathan Ferrey/Getty Images)\n\nTry as he might, Tony Romo has never made the cut at a PGA Tour event. Frankly, he’s never come particularly close in three tournaments, his best effort an 8-over-par 150 at last year’s Byron Nelson that still fell six shots short on a Trinity Forest course he had played countless times as a member.\n\nRomo is taking another crack at it this week at the Safeway Open in California, and the thinking was that neither he nor CBS Sports would have to worry about him missing Sunday’s NFL game between the Bears and Vikings in Chicago because of his history and because of the fact that the field is surprisingly stout for an early-season tournament: Patrick Cantlay, Adam Scott, Bryson DeChambeau, Justin Thomas and Phil Mickelson are all on hand. SuperBook USA golf oddsmaker Jeff Sherman responded accordingly, giving Romo astronomical 10,000-to-1 odds of winning the tournament, and the Action Network’s Darren Rovell promised to erase himself from Twitter if the former Cowboys quarterback was atop the leader board at the end of play Sunday.\n\nIf Tony Romo wins the Safeway Open, I will delete my Twitter account. — Darren Rovell (@darrenrovell) September 25, 2019\n\nSo of course Romo went out and shot a 2-under 70 in Thursday’s first round, putting him in a tie for 28th and only five strokes behind leaders Adam Scott and Andrew Landry. That would be a stroke better than Thomas, the 2017 PGA Championship winner, and a full five shots better than Mickelson, who has five major championship trophies, three of them accompanied by green jackets.\n\nRomo seemed to be headed to his usual place at the bottom of the leader board after consecutive bogeys at Nos. 3 and 4 — his 12th and 13th holes of the day — put him at 1 over, but he responded with a birdie at the par-5 fifth and then finished off his round with birdies at Nos. 8 and 9.\n\nRomo rolled in 122 feet worth of putts for the day.\n\n“Same thing I did in football,” Romo told PGATour.com after his round when asked how he cobbled together his round. “You just start from the beginning. You’re not very good, not very good, and then all of a sudden you make the leap somewhere and all of a sudden you can be more efficient and you can do things a little bit better.\n\n“It’s embarrassing to stink,” Romo continued. “I stunk a lot, so just trying to continue to improve and get better.”\n\nThe full-time PGA Tour golfers on the course seemed to welcome this new challenger.\n\n“I need to start making some birdies. I don’t want to lose to a guy that does TV but I did,” Thomas said with a laugh. “No, but it’s awesome. I’m happy for him. It’s a lot of pressure for him to play out here, and everyone’s kind of expecting him to fail and not play well.\n\n“I hope he plays well [Friday],” Thomas added. “It’d just be kind of a smack in the face to all those people that were giving him crap before he teed off. He’s a competitor.”\n\nShould Romo make the cut, he will be replaced by Boomer Esiason in the CBS Sports booth alongside Jim Nantz for Sunday’s Bears-Vikings game. His second round tees off at 4:25 p.m. Eastern on Friday.\n\nRead More:\n\nHe snagged a historic home run ball. Now it is in the Hall of Fame, in memory of his late son.\n\nA 7-year-old’s touchdown went viral as he fought cancer. Six years later, he’s playing for real.\n\nBaker Mayfield vs. Rex Ryan might be the NFL season’s most fun, unexpected battle", "description": "Tied for 28th after one round, he’s in good shape.", "authors": ["Matt Bonesteel", "Reporter For The Early Lead", "September At Am", "Matt Bonesteel Spent The First Years Of His Washington Post Career Writing", "Editing. In", "Bonesteel Pivoted The Newspaper To Online", "Now He Blogs For The Early Lead", "Other Web-Based Products Owned The Post."], "top_image": "https://www.washingtonpost.com/resizer/IkrNGxO1D5wqQYo-V7QjKYxvPQ0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GO6X74XASQI6TPT7JTEFAF6DN4.jpg", "published_at": "2019-09-27"}