{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/colleges/gus-malzahn-auburn-texas-aandm-football/2019/09/20/8efd3c5e-dbb7-11e9-bfb1-849887369476_story.html", "downloaded_at": "2019-09-21 03:39:32.708943+00:00", "title": "Gus Malzahn rides a perpetual seesaw into Auburn-Texas A&M game", "language": "en", "text": "● He’s a noted hub of fan-base grumbling. Yes, this understated 53-year-old gent with the storybook story and the non-storybook personality upholds an American tradition: the coach who’s good enough to stay but debatable enough to allow for the gathering of grumblers.\n\nHe’s 56-27 in his seventh Auburn season, a .675 winning percentage, and he hasn’t had a losing season since his inaugural 1992 team at Hughes (Ark.) High went 4-6. Yet he’s 28-20 (.583) in the SEC for a fan base that does not view itself as a .583 SEC fan base; 6-13 (.316) against the resented neighbors Alabama, Georgia and LSU for a fan base that does not view itself as a .316 fan base against resented neighbors; and 2-4 (.333) in bowl games for a fan base that does not view itself as a .333 bowl fan base.\n\n● He’s a noted hub of fan-base grumbling, but it’s hard to see anybody all that much better waiting out there. Yes, Malzahn joins the long history of coaches who have toiled at their jobs while some fans have pined away for distant coaches, whether or not those distant coaches have any interest in coaching, either at said university or at all. Everybody knows who’s the best next coach, except that nobody knows.\n\nOf course, there’s always the chance that if Auburn fired Malzahn and went for some obscure but charismatic position coach, that coach could turn out to be the next Dabo Swinney, the obscure but charismatic position coach Clemson chose in 2008 who has since gone 100-15 over the past nine seasons at Clemson, including 58-4 in the past five, with four College Football Playoff appearances and two national titles.\n\nThere’s always the chance, but the chance is always wee.\n\nBarry Svrluga: NCAA should hear state lawmakers’ message on amateurism instead of fighting it\n\n● He’s still a remarkable, uniquely American story. All scholars or prospective scholars on the subject of Malzahn should prove conversant in what happened in the most recent 14 years of his Arkansas-raised life. One biographical detail always has shouted loudest: On Oct. 28, 2005, Malzahn turned 40 as a high school football coach, and while that’s plenty noble, that’s less lucrative than what followed.\n\nIn 1991, this future paragon of offense had become a defensive coordinator because that’s the opening they had, in eastern Arkansas near the Mississippi River, near Memphis and down the road from renowned Greasy Corner at little Hughes High in Hughes, Ark. (pop. 1,810 at the time). In 1994, he coached the Blue Devils into the state final. “Nobody ever sees us,” Malzahn told his 23-strong team in the pregame speech, as George Schroeder wrote in the Arkansas Democrat-Gazette. It lost achingly, 17-13, to Lonoke.\n\nIn the middle of this decade, Hughes named its field after Malzahn but then had to fold its school in another familiar American theme: dwindling population forcing a consolidation. By then, with his fast offense in a fast-offense world, Malzahn had been to two more Arkansas high schools (1996-2005, three state champions, one of which outscored opponents 664-118), to Arkansas (2006), Tulsa (2007-08) and Auburn (2009-11) as offensive coordinator (with Cam Newton’s national title), to Arkansas State (2012) as head coach and back to Auburn as head coach.\n\nIn a whoosh, he had ridden all the way from nobody-ever-sees-us to everybody-sees-the-hell-out-of-us.\n\n● His story shows how, in a tough world, fleeting bursts of euphoria can suffice just enough. What makes the Malzahn-Auburn era so curious is that when fortunes have risen, they have surged into a wonderland.\n\nIn 2013, Auburn followed a loss to LSU with nine straight wins that ran it all the way to the lead with 79 seconds left in the national championship game. That included three of the damnedest wins: over Georgia on one of the most remarkable plays in college football history, over Alabama on a play more remarkable than that and over Missouri in the SEC championship by 59-42 behind 545 rushing yards.\n\nThe next 46 games across 3 1/ 2 seasons went 28-18, including numbers that always land with a thud in college football programs of a certain status: “8-5” or “7-6.” Finally, on Oct. 14, 2017, in Baton Rouge, Auburn ran 32 second-half plays for 73 yards as leads of 20-0 and 23-7 dissolved into a closing deficit of 27-23, whereupon Malzahn said, “It’s not the end of the world.”\n\nThat statement caused mass consternation despite proving accurate.\n\nAlso, Auburn went on a five-game streak of a soaring prowess, mauling Texas A&M on the road and Georgia and Alabama at home before hitting an 8-7 patch that restored grumbles and featured an SEC championship loss to Georgia, a Peach Bowl loss to UCF and five more losses in 2018.\n\n● He embodies how while college football is always nutty, it always maintains the capacity for nuttier. Between the Georgia loss and the UCF loss and with the Arkansas job open, Malzahn signed a famed seven-year extension worth $49 million or so. He signed with a university president who had been around the university only eight-plus months and who had gotten into something of a disquiet himself while president of Iowa State after he, a pilot, flew a university plane into some damage at an airport in Illinois, which fomented debate about whether he used the plane for personal reasons and led to his assurance he wouldn’t fly university planes anymore.\n\n“Strength and stability go hand-in-hand, and we have both in Coach Malzahn,” the president, Steven Leath, trained originally as a plant scientist, said in December 2017 — or, of course, 18 months before Leath departed Auburn after spending 27 months on the job and $49 million or so on Malzahn.\n\nNow Malzahn has a promising freshman quarterback in Bo Nix, son of former Auburn quarterback Patrick Nix, and he has a 27-21 opening win over Oregon on Nix’s 26-yard touchdown pass to Seth Williams with nine seconds left, and he’s still going. He’s still looking to his latest biggest game of his tenure with Monday pearls to Auburn reporters such as, “First of all, we’re glad to be 3-0,” and, “You can kind of tell a different excitement” with this game, and: “You’ve got to keep in mind, too, that was [Nix’s] third game to play college football [last week]. He’s still a freshman. You’ve got to keep that in mind.”\n\nA win will make Auburn 4-0 and stir some national chatter through its next sequence of games: Mississippi State, at Florida, at Arkansas, at LSU. A win might even signal another round of fleeting euphoria, always preferable to no euphoria at all.\n\nRead more:\n\nA ‘College GameDay’ sign asked for beer money. It sparked a children’s hospital fundraiser.\n\nTulane’s fake kneel-down and last-second win is the college football ending of the year\n\nJohn Feinstein: College football is better with Les Miles coaching. He could be ... running for president?", "description": "In his seventh season, the Tigers coach has inspired grumbling, euphoria and seemingly not a lot between those poles.", "authors": ["Chuck Culpepper", "Reporter Who Covers National College Football", "College Basketball", "Tennis", "Golf", "International Sports."], "top_image": "https://arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WNODUWW32AI6TP5RQSMIONUUOY.jpg", "published_at": "2019-09-20"}