{"pub": "aljazeera", "url": "https://aljazeera.com/ajimpact/trump-reportedly-concessions-china-trade-talks-191010015008793.html", "downloaded_at": "2019-10-10 06:56:36.810580+00:00", "title": "Trump reportedly makes concessions to China before trade talks", "language": "en", "text": "With trade talks between the United States and China resuming this week, the US appears to have made some concessions that could help reduce tensions between the world's top two economies.\n\nThe New York Times newspaper reported that the US was considering issuing licences to American companies allowing them to supply non-sensitive components to Chinese telecoms giant Huawei. In May, US President Donald Trump had proposed to ban Huawei from buying parts and technology from US suppliers citing national security concerns.\n\nBut the paper, citing unidentified sources, says Trump gave the green light in early October for the issuance of licences to US companies to supply Huawei with some equipment.\n\nThe top negotiators from the two sides are set to meet on Thursday for the first time since late July to try to find a way out of a 15-month trade war that has forced companies to alter supply chains and been a drag on the global economy.\n\nSeparately, the US is also considering a currency pact with China as part of a partial trade deal, the Bloomberg news agency reported, also quoting unidentified sources.\n\nTariffs that are due to increase next week could also be suspended as part of this deal, it reported.\n\nThe currency accord was something the US said had been agreed to earlier in the year before trade talks broke down. It is meant to be followed by further negotiations on core issues such as intellectual property and forced technology transfers, Bloomberg reported.\n\nChinese Vice Premier Liu He is scheduled to lead the Chinese delegation in trade talks with US Trade Representative Robert Lighthizer and Treasury Secretary Steven Mnuchin on Thursday and Friday in Washington, DC.\n\nBut just hours earlier, the upcoming talks were reportedly cut short by a day as lower-level discussions had failed to come to an agreement on key issues, unnamed sources told the South China Morning Post (SCMP).\n\nOne of the stumbling blocks was the issue of forced technology transfers, which the Chinese delegation refused to broach, SCMP reported.\n\nThe discussions concerning an interim deal come after the Trump administration this week further ramped up pressure on Beijing by blacklisting Chinese technology firms over their alleged role in oppression in the far west region of Xinjiang. The US also placed visa bans on officials linked to the mass detention of Muslims from the region.\n\nAt the same time, a fight over free speech between China and the US National Basketball Association (NBA), triggered by a tweet by the Houston Rockets general manager backing Hong Kong’s protesters, has underscored the tensions.\n\nTariffs are working: US\n\nMeanwhile, US Secretary of Commerce Wilbur Ross said on Thursday that tariffs on Chinese goods and services are working as they are forcing China to pay attention to US concerns.\n\nRoss said the US would have preferred not to implement tariffs against Chinese goods more than a year ago, which ignited a trade war that slowed global commerce and threatened decades-old systems, but added that it has forced Beijing into action.\n\n\"We do not love tariffs, in fact, we would prefer not to use them, but after years of discussions and no action, tariffs are finally forcing China to pay attention to our concerns,\" Ross said in a speech while on an official visit to Australia.\n\nWithout a significant breakthrough, Trump is set to raise the tariff rate on $250bn worth of Chinese goods by an extra five percent to 30 percent next Tuesday.\n\nFurther tariffs are scheduled to come into effect on December 15.\n\nOn Wednesday, a Chinese official said that the country was still open to reaching a partial trade deal with the US that may include large purchases of US commodities, but added that success was contingent on Trump halting further tariffs.\n\nRoss added that the US was \"not opposed\" to trade with China but said that China's trade practices have \"gotten worse\" and that the country needed to abide by global trade regulations.", "description": "Trump is reportedly considering partially lifting ban on sales to Chinese tech giant Huawei and making a currency deal.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/8/13/67231ee72a1a47e181e8517ba6d7ce3f_18.jpg", "published_at": "2019-10-10"}