{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7631149/La-Liga-president-Javier-Tebas-labels-El-Clasico-national-problem.html", "downloaded_at": "2019-10-30 16:12:09.070684+00:00", "title": "La Liga president Javier Tebas labels El Clasico a 'national problem'", "language": "en", "text": "The postponement of El Clasico between Barcelona and Real Madrid is a 'state problem,' according to La Liga president Javier Tebas.\n\nThe match between the two rivals was due to take place at the Nou Camp on October 26 but was postponed due to ongoing unrest in the region over political protests.\n\nGiven both sides rejected the proposal from the league to reverse the fixtures so their first meeting could take place in Madrid, the decision was made by the Spanish FA to rearrange the fixture for December 18.\n\nBarcelona will welcome Real Madrid in El Clasico on December 18, the RFEF have announced\n\nLa Liga president Javier Tebas feels El Clasico's postponement has become a 'state problem'\n\nThat is a midweek date and has not been warmly received given there was hope it would fall on a weekend to maximise it's accessibility across the globe.\n\nFor Tebas, this issue is far bigger than just the two clubs involved.\n\n'El Clasico issue is a state problem, I don't see it as only a Barcelona problem,' Tebas said, as cited by ESPN FC.\n\n'What we knew from the police and from our information was the it was dangerous to play on October 26. I don't know what data Barcelona have to say that this date, December 18, could be more dangerous.\n\nCatalan protests have turned violent with police shown keeping protesters at distance\n\nProtests in Barcelona have escalated, with crowds gathering in large groups and lighting fires\n\n'For us, it is important that it was played at the weekend and in midday but it was not to be, the kick-off time for the first El Clasico is always selected taking Asia into account.\n\n'Now as it will be a night-time game, there are many countries that will miss it. From Saudi Arabia to Japan and all the way to Australia they will be sleeping.'\n\nLa Liga released a lengthy statement following the decision by the Spanish FA to detail that they will be challenging the date of December 18.\n\nThe Spanish top-flight believes the game should be held on December 4 to ensure it is played as soon as possible.\n\nLa Liga's statement read: 'It is surprising in this situation that the RFEF Competition Committee values ​​sports criteria of other competitions, without taking into account the sports criteria of the national competition, which must be defended.\n\n'There is no rule, neither of public law, nor federative, nor of La Liga, which establishes that, after the suspension of a match of the professional competition for exceptional reasons, it is the clubs that have, by agreement, the power to set the new date of that (match).'\n\nLa Liga have threatened legal action should the game indeed go ahead on December 18.\n\nThe sides are now due to meet at the Nou Camp on December 18 - but La Liga will appeal that", "description": "The decision by the Spanish FA to postpone El Clasico between Barcelona and Real Madrid is a 'state problem,' according to outspoken La Liga president Javier Tebas.", "authors": ["Nathan Salt For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/15/20075748-0-image-a-86_1572449401940.jpg", "published_at": "2019-10-30"}