{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7628975/Hundreds-rare-koalas-feared-dead-Australia-bushfire.html", "downloaded_at": "2019-10-30 10:09:27.654820+00:00", "title": "Hundreds of rare koalas feared dead in Australia bushfire", "language": "en", "text": "Hundreds of koalas are feared to have burned to death in an out-of-control bushfire on Australia's east coast, wildlife authorities said Wednesday.\n\nA bushfire believed to have been sparked by a lightning strike on Saturday some 248 miles (400 kilometres) north of Sydney has ravaged an area of over 4,942 acres (2,000 hectares) with authorities battling to bring it under control.\n\nWildlife rescuers in northern New South Wales state hold grave fears for a 'very rare' population of hundreds of koalas living in the fire zone.\n\n'The special importance of those koalas is that they are very genetically diverse,' Sue Ashton, president of the Port Macquarie Koala Hospital, said.\n\nHer fears are that 'hundreds' in the known koala breeding area 'have perished in the fire'.\n\nFirefighters battling bushfires in Angourie, northern New South Wales, in September that swept through the state\n\nWildlife rescuers in northern New South Wales state hold grave fears for hundreds of koalas\n\n'It's a national tragedy because this koala population is so unique,' she added.\n\nLand clearing and development over time has meant a loss of habitat for the tree-dwelling koalas, leading to less connectivity between populations, increased inbreeding and reduced genetic diversity of the marsupial.\n\nMore than 70 fires continue to burn across the state of New South Wales, which has been battling severe drought.\n\nAuthorities say conditions are easing near Port Macquarie, where large air tankers are being used to battle the out-of-control blaze.\n\n'The fire will continue to burn throughout the night, however there are significant resources in the area protecting properties,' New South Wales Rural Fire Service said in their latest update.\n\nMore than 70 fires continue to burn across the state of New South Wales, which has been battling severe drought\n\nNearly 1,200 firefighters were battling 85 blazes around the state last week as vast areas of the bush were burned.\n\nAshton said wildlife volunteers would join firefighters in the area either Thursday or Friday to assess the scale of loss and begin a rescue operation for the surviving koalas.\n\n'What happens to a koala in a fire is that they climb up to the top of the tree and they curl up into a little ball. If the fire goes through quickly and just singes their fur, they are fine the fur will grow back,' she said.\n\nBut if the fire intensifies and continues to burn up the tree 'they'll perish', she added.\n\n'So we won't really know until we get in there and start to look.'", "description": "A bushfire believed to have been sparked by a lightning strike some 248 miles north of Sydney has ravaged an area of over 4,942 acres with authorities battling to bring it under control.", "authors": [], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/09/20365124-0-image-a-11_1572428254389.jpg", "published_at": "2019-10-30"}