{"pub": "yahoo", "url": "https://news.yahoo.com/son-says-mother-89-missing-052603620.html", "downloaded_at": "2019-10-11 20:20:27.056486+00:00", "title": "Authorities order 100,000 evacuated in California wildfire", "language": "en", "text": "LOS ANGELES (AP) — A wildfire raged out of control along the northern edge of Los Angeles early Friday, forcing tens of thousands of people from their homes as firefighters battled flames from the air and on the ground.\n\nPolice Chief Michel Moore said about 100,000 people in over 20,000 homes were ordered to evacuate.\n\nFire Chief Ralph Terrazas said the fire had grown to more than 7 square miles (18 square kilometers) and at least 25 homes had been damaged. A middle-aged man who was near the fire went into cardiac arrest and died, the chief said, but he did not have details. A death was also confirmed at an earlier wildfire east of Los Angeles.\n\nThe Los Angeles blaze erupted around 9 p.m. Thursday along the northern tier of the San Fernando Valley as powerful Santa Ana winds swept through Southern California. Smoke streamed across the city and out to sea.\n\nTerrazas said there were sustained winds of 20-25 mph (32-40 kph) with gusts over 50 mph (80 kph) and relative humidity levels had fallen as low as 3%.\n\n\"As you can imagine the embers from the wind have been traveling a significant distance which causes another fire to start,\" Terrazas said.\n\nThe fire erupted in Sylmar, the northernmost portion of the valley, and spread westward at a rate of 800 acres (324 hectares) an hour into Granada Hills and Porter Ranch, where subdivisions crowd against the foothills of the Santa Susana Mountains. The cause wasn't immediately known.\n\nPorter Ranch, an upper middle-class suburb that was the backdrop for the 1982 movie \"E.T.\" is no stranger to evacuations. Four years ago, a blowout at an underground natural gas well operated by Southern California Gas Co. in the neighboring Aliso Canyon storage facility drove 8,000 families from their homes.\n\nIn Northern California , the lights were back on Friday for more than half of the 2 million residents who lost electricity after the Pacific Gas and Electric Co. utility switched it off on Wednesday to prevent its equipment from sparking wildfires during dry, windy weather.\n\nPG&E restored the power after workers inspected power lines to make sure it was safe to do so. Officials had worried the winds might topple transmission lines and start wildfires.\n\nHelicopters made repeated water drops as crews in Los Angeles attacked flames in and around homes. Water- and retardant-dropping airplanes joined the battle after daybreak. About 1,000 firefighters were on the lines.\n\nEdwin Bernard, 73, said he and his wife were forced to leave their four cats behind as they fled their Sylmar home.\n\nBernard, standing outside the evacuation center at the Sylmar Recreation Center on Friday, said they were only able to grab their three dogs. During a previous wildfire, they'd had time to find their passports and photo albums, but not Thursday night.\n\n\"The fireman said, 'go, go, go!'\" Bernard said. \"It was a whole curtain of fire,\" he said. \"There was fire on all sides. We had to leave.\"\n\nEvacuations were also still in effect in the inland region east of Los Angeles where a fire erupted Thursday and raged through a mobile home park in the Calimesa area of Riverside County.\n\nSeventy-four buildings were destroyed and 16 others were damaged.\n\nCal Fire spokeswoman Cathey Mattingly said Friday that one person was killed and others reported injuries, but she did not know the number or severity. The dead person was not immediately identified.\n\nThe missing included Don Turner's 89-year-old mother.\n\nLois Arvickson called her son from her cellphone to say she was evacuating shortly after the blaze was reported in the small city of Calimesa, Turner said while with relatives at an evacuation center.\n\n\"She said she's getting her purse and she's getting out, and the line went dead,\" he said.\n\nArvickson's neighbors saw her in her garage as flames approached, according to Turner. A short time later the neighbors saw the garage on fire, but they didn't know if she'd managed to escape, he said.\n\nMelissa Brown said she moved to the mobile home complex earlier this year from Arizona, in part to help take care of her mother who has since died. Brown said she now also faces the loss of her home.\n\n\"The hardest part is my mom's remains are in there,\" she said Friday morning, choking back tears.\n\nFire danger is high throughout Southern California after the typically dry summer and early fall, and the notorious Santa Ana winds — linked to the spread of many wildfires — bring a dangerous mix of witheringly low humidity levels and powerful gusts.", "description": "A wildfire raged out of control along the northern edge of Los Angeles early Friday, forcing tens of thousands of people from their homes as firefighters battled flames from the air and on the ground. Police Chief Michel Moore said about 100,000 people in over 20,000 homes were ordered to evacuate. Fire", "authors": ["Stefanie Dazio", "John Antczak"], "top_image": "https://s.yimg.com/uu/api/res/1.2/CpHFsUOlo8oTP.pFKU0wRA--~B/aD0xNzMzO3c9MjYwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/d8cbdc86e0eaa62e97d850aaef1fb8ae", "published_at": "2019-10-11"}