{"pub": "thestreet", "url": "https://realmoney.thestreet.com/investing/intuitive-surgical-s-charts-are-bullish-here-s-our-strategy-for-profits-15139378", "downloaded_at": "2019-10-24 14:59:00.140595+00:00", "title": "Intuitive Surgical's Charts Are Bullish, Here's Our Strategy for Profits", "language": "en", "text": "Are the medical device makers coming back into style? Jim Cramer said during his Mad Money program Wednesday night that after a long hiatus, he thinks investors are eager for the kind of growth the medical device makers can deliver.\n\nShares of Intuitive Surgical (ISRG) are up 138% over the past three years for good reason, Cramer told viewers. This company not only makes money selling its surgical robots, but also from all of the supplies each machine consumes with every procedure. The company last posted a 44-cents-a-share earnings beat and Cramer said he's still a fan at 38 times earnings given Intuitive Surgical's accelerating growth rate.\n\nIn this daily bar chart of ISRG, below, we can see that prices shot higher a few days ago and have subsequently pulled back to fill a gap and retest the breakout area. Prices are above the rising 50-day moving average line and the bullish 200-day line.\n\nThe daily On-Balance-Volume (OBV) line has been in an uptrend the past 12 months and all that aggressive buying should translate into much higher prices.\n\nThe Moving Average Convergence Divergence (MACD) is above the zero line in a bullish configuration.\n\nIn this weekly bar chart of ISRG, below, we can see that prices have been in a sideways trading range since the middle of 2018. Prices are currently above the rising 40-week moving average line.\n\nThe weekly OBV line is steady and could soon turn higher in the weeks ahead.\n\nThe trend-following MACD oscillator just moved back above the zero line for an outright buy signal.\n\nIn this Point and Figure chart of ISRG, below, we can see an accumulation pattern with an upside price projection of $662.\n\nBottom line strategy: Risking below $510 for now traders could approach ISRG from the long side. $600 and then the $650-$662 area are our upside price targets.", "description": "Let's review the charts and indicators of ISRG....ISRG", "authors": ["Bruce Kamich", "Intuitive Surgical'S Charts Are Bullish", "Here'S Our Strategy For Profits", "Let'S Review The Charts", "Indicators Of Isrg.", "Stocks Quotes In This Article", "Stephen Guilfoyle", "Chris Versace", "Bob Lang", "Carolyn Boroden"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/9962bb8e-d51a-11e7-bfc8-45eda2eb2189.png", "published_at": "2019-10-24"}