{"pub": "guardian", "url": "https://theguardian.com/stage/2019/oct/18/blank-review-alice-birch-donmar-warehouse-london", "downloaded_at": "2019-10-18 10:36:46.061877+00:00", "title": "[Blank] review – Alice Birch's build-your-own-play experiment", "language": "en", "text": "Alice Birch’s new play, whose title comes with built-in parentheses, is both a challenge and a provocation. It consists of 100 scenes from which each director is allowed to make a pick-and-mix choice. Maria Aberg has selected 22 in a production marking 40 years of Clean Break – a company that works with women affected by the criminal justice system – and, while there are individually powerful scenes, the result is like a jigsaw puzzle with several pieces missing.\n\nMostly the play is formed of a series of short, sharp vignettes. A daughter breaks into the family home and robs her mother. A woman, fleeing a violent man, is refused sheltered accommodation. Another woman seeks to explain her motives for stabbing her two daughters. But there is one long dinner-party scene in which a group of affluent, professional women, who live in their own liberal bubble, find their assumptions questioned by a mutinous guest. How, she asks, can change ever be achieved if we do not accept that people should be held responsible for their actions?\n\nYou can see the influence of Caryl Churchill on that scene and more generally on Birch’s experiment with form. The problem is that Birch’s build-your-own-play approach ends up giving us slivers of information rather than a coherent whole. There are recurring themes, especially to do with the cyclical nature of abuse and the inadequacy of penal institutions in dealing with the root causes of criminality. But it is only in the one sustained scene – and quite late in the course of it – that you feel any debate is taking place about the big issue: whether it is possible to break patterns of behaviour and overcome our genetic inheritance.\n\nAberg’s skilfully marshalled production makes good use of Rosie Elnile’s multi-levelled set and is strongly acted by an all-female cast including Shona Babayemi, Joanna Horton, Thusitha Jayasundera, Kate O’Flynn and Jemima Rooper. But, for all the play’s momentary insights, it still feels like fragments of a mosaic.", "description": "The playwright throws down the gauntlet to directors, and the result is a show full of ideas but lacking unity", "authors": ["Michael Billington"], "top_image": "https://i.guim.co.uk/img/media/16a523fda03be3d623e1ad717594721148b0dc8e/0_343_6600_3960/master/6600.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTMucG5n&enable=upscale&s=b692900ea48941fcfb5850c470ba858f", "published_at": "2019-10-18"}