{"pub": "yahoo", "url": "https://finance.yahoo.com/news/1-china-lift-business-curbs-122429588.html", "downloaded_at": "2019-10-17 06:07:43.966069+00:00", "title": "UPDATE 2-China to scrap business curbs on foreign banks, brokerages", "language": "en", "text": "* China will lift curbs on foreign banks, brokerages and funds\n\n* To support local govt efforts to attract more foreign investment\n\n* Give foreign firms more leeway in borrowing from overseas (Adds background, detail)\n\nBEIJING, Oct 16 (Reuters) - China will remove business restrictions on foreign banks, brokerages and fund management firms, a cabinet meeting chaired by Premier Li Keqiang said on Wednesday, state television reported.\n\nBut the move, which comes nearly 18 years after China joined the World Trade Organization (WTO), could have limited impact on the competitive landscape of an industry dominated by China's state firms.\n\nChina has stepped up efforts to open its financial sector amid a festering trade war with the United States, with increased access to its financial sector among a host of demands from Washington.\n\nLast week, China announced a firm timetable for opening its futures, brokerage and mutual fund sectors fully to foreign investors next year, as Beijing and Washington reached a tentative deal to resolve their trade dispute.\n\nThe cabinet did not elaborate on what effect the removal of the curbs would have. On Tuesday, the cabinet relaxed management rules for foreign insurers and banks, giving them easier access to China, and wider business scope.\n\nChina will also support local governments' efforts to attract more foreign investment and allow foreign companies to be more flexible in choosing how they borrow funds from abroad, the cabinet said.\n\nChina will not allow forced technology transfers by foreign firms, it said.\n\nStabilising foreign investment is part of Beijing's policies to support the slowing economy that has been hit by the country's trade war with the United States.\n\n\n\n\n\nSMALL MARKET SHARE\n\nIn 2007, HSBC Holdings, Standard Chartered Bank , Bank of East Asia and Citigroup became the first foreign banks allowed to set up locally-incorporated subsidiaries in China as Beijing gradually opened up the sector.\n\nBut hampered by numerous restrictions on business scopes and operations such as outlet openings, the roughly 40 foreign banks with local units operating in China account for a tiny fraction of a market dominated by state-owned rivals such as Industrial and Commercial Bank of China and Bank of China .\n\n\"Many people say 'the wolves are coming', but my observation is that...through opening, Chinese regulators intend to introduce technology and talents, but it doesn't mean foreign players can grab a big market share in China,\" Xin He, Societe Generale's China head of global markets told a financial conference over the weekend.\n\nHe added that the French bank has retreated from its retail business in China after realising that \"foreign banks cannot compete with Chinese players in this business segment.\"\n\nIn the securities sector, China last year relaxed rules to allow foreign brokerages to own a majority stake in Chinese ventures. China said last week foreign ownership limits in the sector will be scrapped completely on Dec. 1, 2020. UBS Group , JPMorgan Chase and Japan's Nomura Holdings have obtained regulatory approval to set up majority-owned China ventures.\n\nBut China has yet to open more sensitive areas of its financial industry. U.S. payments card giants Mastercard Inc and Visa Inc are still awaiting regulatory approval to conduct yuan clearing business in the country.\n\nChina's economic growth is expected to slow to a near 30-year low of 6.2% this year and cool further to 5.9% in 2020, a Reuters poll showed, even as Beijing steps up policy stimulus.\n\nThe government has been leaning heavily on fiscal stimulus to support the economy, including rolling out big tax cuts and increased spending on infrastructure investment.\n\nTax and fee cuts amounted to 1.5 trillion yuan ($211.32 billion) in the first eight months, which has helped ease the burden on firms, boost incomes and employment, with full-year reductions set to exceed 2 trillion yuan, the cabinet said.\n\nThe government will also support local governments facing fiscal difficulties to ensure wage payments, the cabinet said. ($1 = 7.0984 Chinese yuan) (Reporting by Beijing Monitoring Desk and Kevin Yao; Additional reporting by Samuel Shen; Editing by Alison Williams and Jacqueline Wong)", "description": "China will remove business restrictions on foreign banks, brokerages and fund management firms, a cabinet meeting chaired by Premier Li Keqiang said on Wednesday, state television reported.  China has stepped up efforts to open its financial sector amid a festering trade war with the United States, with", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-16"}