{"pub": "reuters", "url": "https://reuters.com/article/us-soccer-worldcup-iran/iran-thrash-cambodia-14-0-on-marquee-night-for-female-fans-idUSKBN1WP2O5", "downloaded_at": "2019-10-10 18:52:18.371475+00:00", "title": "Iran thrash Cambodia 14-0 on marquee night for female fans", "language": "en", "text": "HONG KONG (Reuters) - Iran made it a night to remember for female fans allowed into the Azadi Stadium for a World Cup qualifying match for the first time since the Islamic Revolution as they inflicted a record-breaking 14-0 thrashing on Cambodia on Thursday.\n\nStriker Karim Ansarifard scored four goals and Sardar Azmoun hit a hat-trick as the Iranians handed Cambodia their heaviest ever defeat.\n\nThe win came as 3,500 female fans were permitted to buy tickets for the game, the first time women have been allowed into the stadium in Tehran for a World Cup qualifier in more than four decades.\n\nIt took just five minutes for Ahmad Nourollahi to put Marc Wilmots’s side in front when his shot from distance clipped the underside of Keo Soksela’s crossbar before crossing the line.\n\nAzmoun slotted his first into the bottom corner six minutes later before Hossein Kanaani headed home Ramin Rezaeian’s curling cross from the right with barely 18 minutes on the clock.\n\nMehdi Taremi made it 4-0 when his shot was deflected over Soksela and, with 10 minutes left in the half, Azmoun grabbed his second when he slotted in from close range after a handling error by the Cambodian goalkeeper.\n\nAnsarifard scored his side’s sixth five minutes before the interval after Cambodia had conceded an indirect free kick seven yards from goal and the home team took a seven-goal lead into the break when Azmoun struck from close range.\n\nIran goalkeeper Alireza Beiranvand kept out Keo Sokpheng’s penalty soon after the interval for the hapless visitors and two further goals from Ansarifard either side of Mehdi Taremi’s effort gave Iran a 10-0 lead on the hour mark.\n\nMohammed Mohebi added two more before substitute Mehrdad Mohammadi put his strike into the corner and Ansarifard completed the rout two minutes from time.", "description": "Iran made it a night to remember for female fans allowed into the Azadi Stadium for a World Cup qualifying match for the first time since the Islamic Revolution as they inflicted a record-breaking 14-0 thrashing on Cambodia on Thursday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-10"}