{"pub": "blastingnews", "url": "https://us.blastingnews.com/sports/2019/10/nebraska-football-begins-pointing-fingers-at-one-another-after-latest-loss-003006733.html", "downloaded_at": "2019-10-28 00:24:52.721845+00:00", "title": "Nebraska football begins pointing fingers at one another after latest loss", "language": "en", "text": "The Nebraska football team lost another game on Saturday. The loss, a 38-31 defeat to Indiana dropped the team to 4-4 on the season.\n\nWhile the Husker coaches and players have been relatively stoic in the face of losses but they admitted to being quite frustrated on Saturday night. That frustration bubbled over in post-game press conferences as factions formed in the locker room.\n\nSince the Cornhuskers hired head coach Scott Frost, he's talked about changing the culture at Nebraska.\n\nIt was a running theme in his first season during 2018. He also claimed near the end of last year that the culture had been largely fixed.\n\nNow he's started talking about some players not having want to again. The difference between last season and this season is his team being a little more forthcoming about which players aren't buying in. Which players aren't happy with just being \"ok\" and which ones want more.\n\nYoung vs old\n\nWhile Frost didn't lay out exactly who he felt was buying in and who wasn't, Wan'Dale Robinson shed some light on what's been going on inside the Nebraska football locker room. During his post-game press conference, the true freshman said he's, “in older guys heads about trying to buy into the culture Scott Frost wants to build.\"\n\nFans and members of the media took that to mean that players Frost and company didn't recruit are still having issues getting motivated.\n\nDon’t miss the latest news! Click on the topic you interest most. We'll keep you updated with all the news you shouldn't miss. NFL\n\nIt’s all heart. The young have the heart. The older guys gave up a long time ago. Just going through the motions It’s very obvious. This staff is bringing a different type of player. It’s going to take time but also I do think coaching needs to take a little bit — phillip tidwell (@phillip1030) October 27, 2019\n\nSome fans felt it was \"very obvious\" there was a divide forming in the lockerroom. Robinson seemed to confirm the freshmen and sophomores on the team were having to convince the juniors and seniors to get on board with Frost's approach.\n\nNew arrival Dedrick Mills agrees with his head coach and Robinson. He talked about how he's seen a lack of effort by some of his Nebraska teammates.\n\nNebraska football just ok\n\nFrost really started talking about the culture being a problem again during the team's bye week. He said he saw a lack of want-to in some of his players. Mills explained what Scott was talking about after the loss to Indiana.\n\n\"Some guys just jog and do whatever. That’s the ‘just OK’ attitude he’s talking about. It’s not acceptable on this team.” Defender JoJo Domann echoed those sentiments after the latest loss.\n\nHe talked first about the fact that he thought the problems were solved. He said that there was so much excitement around the season that everyone seemed to be on the same page. Now, there are players on the team he and others are pointing out as not being on board. “We gotta improve our preparation, improve our practice habits, improve our overall focus and attention to detail going forward,” Domann said according to the Omaha World-Herald.\n\nHow the team rebounds, with some members of the Nebraska football team pointing at others and blaming them, is unknown.", "description": "The Huskers started talking about culture again after losing to Indiana but also began singling out groups of players not buying in.", "authors": ["Music Crowns", "Zeegee Cecilio", "Read More On The Same Topic Oliver Vandervoort", "Penn State Writer Still Believes Nebraska Sportsmanship Keeps It 'A Cut Above'", "Nebraska Football", "Darrion Daniels Challenges Fan After", "Teddy Bear", "Former Nebraska Football Star Zatechka Explains Why The Huskers' Offense 'Sucks' In"], "top_image": "https://staticr1.blastingcdn.com/media/photogallery/2019/10/27/os/b_1200x630/nebraska-football-has-started-quite-a-bit-of-infighting-image-via-kileywikimedia-commons_2345505.jpg", "published_at": "2019-10-27"}