{"pub": "yahoo", "url": "https://finance.yahoo.com/news/many-aligning-signals-gold-071959900.html", "downloaded_at": "2019-10-16 05:14:53.517354+00:00", "title": "The Many Aligning Signals in Gold", "language": "en", "text": "Let’s start this week with a bigger update on multiple gold charts. There are so many reasons due to which gold is likely to decline in the following months – we’ll start with last week’s closing day analysis.\n\nPMs on Friday\n\nGold, silver, and mining stocks declined, and the way in which they did, was very informative. Gold closed both the day and the week below the $1,500 level and the volume increased as gold declined. In fact, Friday’s volume was the highest one that we saw so far this month.\n\nAnd gold stocks’ strength that we saw on Thursday? Gone and invalidated. Friday’s decline in the HUI Index erased almost the entire October upswing. Neither in silver nor in gold have we seen the same kind of weakness. The miners’ underperformance is huge and it serves as a major bearish confirmation.\n\nOf course, that’s just the tip of the signal iceberg.\n\nLet’s consider what gold did in the previous cases when it topped while forming a few lower tops.\n\nThe Message of Gold’s Lower Highs\n\nThe similar cases are characterized by the declining green lines and the thing that we would like you to focus on is the price of gold compared to the green lines and the 50-day moving average. The latter can be useful for many things, and in this case it’s helpful in determining whether gold declined significantly enough for the move to be the start of a bigger downswing.\n\nThere was practically only one case when gold moved above one of its previous highs and it was in 2018. Back then, gold moved to a new high before starting the decline. But where did gold decline before this move? Only slightly below the 50-day moving average and the MA was far from the declining green resistance line.\n\nIn 2016 and earlier in 2019 when the declining resistance line moved to the 50-day moving average, and gold declined below the latter, there was no new high and gold’s decline continued. In early 2019, it continued only for some time, but in 2016, it was followed by a major and sharp slide. The latter happened in October, by the way. All in all, it seems more likely than not that the counter-trend upswing is already over. And if it isn’t, then it’s very likely that gold won’t rally to new highs before declining significantly.\n\nStory continues", "description": "Precious metals moved strongly on Friday, and did so on significant volume. The reversals we have seen on Thursday got resolved with a heavy thud. Let’s dive into the many charts and perspectives and explore how well they support the upcoming move across the sector.", "authors": ["Przemysław Radomski"], "top_image": "https://s.yimg.com/uu/api/res/1.2/MLj8m6G4JGttPLTicUhgwg--~B/aD0xNDY3O3c9ODAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/fx_empire_176/434fed9161f8d3fc15d5445d49fda979", "published_at": "2019-10-15"}