{"pub": "cnn", "url": "https://cnn.com/2019/10/25/business/pence-nike-nba/index.html", "downloaded_at": "2019-10-25 16:29:31.020489+00:00", "title": "Mike Pence blasts the NBA and Nike", "language": "en", "text": "London (CNN Business) The United States and China may be moving toward a \"phase one\" trade deal, but a hawkish speech by Vice President Mike Pence on Thursday is a reminder of the deep divide between the world's two biggest economies — a chasm that is unlikely to be bridged any time soon.\n\nWhat Pence said: The vice president chided Beijing for economic and human rights abuses. He also used the occasion to take aim at the NBA and Nike, its official apparel partner.\n\nPence accused the NBA of acting \"like a wholly-owned subsidiary of the authoritarian regime\" in China, adding that the league is \"siding with the Chinese Communist Party and silencing free speech.\" Nike, Pence claimed, \"promotes itself as a so-called 'social-justice champion'\" but prefers \"checking its social conscience at the door\" on Hong Kong.\n\nThe NBA, which sees China as a major growth market, recently came under fire in the United States after initially failing to back Houston Rockets general manager Daryl Morey. Morey had tweeted his support for protesters in Hong Kong, sparking an outcry in China. Nike later pulled Houston Rockets merchandise from some store shelves in China, according to a Reuters report.\n\nNike NKE shares have had a rough week (the company announced Wednesday that its CEO will leave the company in January). But they're still beating the S&P 500 year-to-date.\n\nRead More", "description": "The United States and China may be moving toward a \"phase one\" trade deal, but a hawkish speech by Vice President Mike Pence on Thursday is a reminder of the deep divide between the world's two biggest economies — a chasm that is unlikely to be bridged any time soon.", "authors": ["Julia Horowitz", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191025101724-mike-pence-1024-super-tease.jpg", "published_at": "2019-10-25"}