{"pub": "independent", "title": "Novi Sad guide: Where to eat, drink, shop and stay in Serbia’s second city", "url": "https://independent.co.uk/travel/48-hours-in/novi-sad-city-guide-serbia-things-to-do-best-hotels-restaurants-bars-a8985996.html", "language": "en", "published_at": "2019-07-03", "downloaded_at": "2019-09-02 07:50:53.678228+00:00", "text": "Serbia’s second city has a pleasingly laid-back air about it, although visitors to Novi Sad’s massive Exit Festival might never see this relaxed side. This year marks Exit’s 20th anniversary (4-7 July), and this attractive university city on the Danube is also the 2019 European Youth Capital. It’s good practice for when Novi Sad becomes the first non-EU city to take over as European Capital of Culture in 2021.\n\nIt’s not hard to spot the Habsburgs’ legacy in this former corner of the Austro-Hungarian empire – Baroque pastel-coloured townhouses line Novi Sad’s stately streets and squares, particularly in the pedestrianised centre. With so many café terraces filling the car-free thoroughfares, inviting you to stop for coffee and palačinke (Serbian pancakes), it’s no surprise that the pace here is alluringly unhurried.\n\nWhat to do\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nGo for an amble\n\nStart in the main square, Trg Slobode, topped and tailed with the impressive neo-Renaissance city hall and the graceful neo-Gothic Church of the Name of Mary. Dive into Zmaj Jovina, one of the main café-filled arteries of the old town and an agreeable place to stop and indulge in some people-watching. When you reach the monumental Secessionist-style Bishop’s Palace, veer right into Dunavska street, which – like Zmaj Jovina – offers an appealing mix of cafés, shops and restaurants. Carry on to Dunavski Park for a stroll through greenery before reaching the Danube and the hulking Petrovaradin Fortress on the opposite hillside.\n\nShape Created with Sketch. Novi Sad city guide Show all 8 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Novi Sad city guide 1/8 Novi Sad plays host to Exit Festival Adam Batterbee 2/8 Take a dip in the Danube from Strand beach Adam Batterbee 3/8 Novi Sad is Serbia's second city Getty 4/8 Petrovaradin Fortress is an impressive sight Adam Batterbee 5/8 The regal Hotel Leopold I Hotel Leopold I 6/8 Novi Sad's fish market also sells fresh produce Adam Batterbee 7/8 Passage Four is crammed with cute bars Adam Batterbee 8/8 The ultimate meat platter at Sokace Adam Batterbee 1/8 Novi Sad plays host to Exit Festival Adam Batterbee 2/8 Take a dip in the Danube from Strand beach Adam Batterbee 3/8 Novi Sad is Serbia's second city Getty 4/8 Petrovaradin Fortress is an impressive sight Adam Batterbee 5/8 The regal Hotel Leopold I Hotel Leopold I 6/8 Novi Sad's fish market also sells fresh produce Adam Batterbee 7/8 Passage Four is crammed with cute bars Adam Batterbee 8/8 The ultimate meat platter at Sokace Adam Batterbee\n\nGet your culture fix\n\nGet a handle on the fascinating history of the Vojvodina region – the most multi-ethnic in the former Yugoslavia – at the Museum of Vojvodina opposite Dunavski Park. The stars of its antiquities section are three Roman helmets made of gold, and the rest of the museum offers glimpses into why the region became home to Hungarians, Croats, Slovaks, Romanians and Ruthenians over the centuries.\n\nFor a crash course in Serbian art in the Vojvodina region, explore the extensive collection at the Gallery of Matica Srpska. Artworks from the 18th and 19th centuries, as well as 20th-century modernism, are elegantly displayed in this handsome 19th-century building, along with copies of frescoes from monasteries in nearby Fruška Gora.\n\nHead to the beach\n\nTake a dip in the Danube in the Štrand, a sandy beach just south of the city centre. It’s a lovely 2km walk there along a wide pedestrian riverside path flanked by a cycle lane and a jogging trail. Once you arrive, it’s only a nominal 50 dinar (40p) charge to get into the beach (and free for kids under seven). At this fantastically family-friendly mini resort you can swim, laze on the sands, check out the many restaurants, cafés and food stalls and let the kids romp in the various play areas.\n\nWhere to stay\n\nIt’s hard not to feel a bit regal at four-star Hotel Leopold I, set in the Baroque former army barracks within Petrovaradin Fortress, overlooking the Danube. It’s all very Habsburg within, with opulent lounges, bars and a restaurant. You might want to upgrade to the traditionally furnished superior rooms with a river view, as the classic ones can be a bit spartan. Doubles from 10,800 dinars (£81), B&B.\n\nIt’s about a 20-minute walk from the old town, but five-star Prezident Hotel offers a smart, contemporary place to chill out, especially when the summer temperatures kick in. Thanks to the hotel’s large wellness area with indoor and outdoor pools, hot tubs and saunas, this is very achievable. Doubles from 7,382 dinars (£56), B&B.\n\nSet in a 19th-century townhouse right in the old town, three-star Hotel Veliki is in an excellent location just minutes from the main sights. Rooms are simple but come with kitchenettes, and it’s worth upgrading to an apartment with a separate living room. The brick-lined restaurant is a popular place to try Vojvodinan cuisine. Doubles from 6,600 dinars (£50), B&B.\n\nWhere to eat\n\nNovi Sad’s plentiful restaurants lean towards typically meat-heavy Serbian cuisine, although fish lovers can try the Mediterranean-influenced menu at Fish & Zeleniš. Within this endearingly cluttered restaurant, you can feast on grilled trout for less than £6, fried calamari or risotto.\n\nIts nearby sister restaurant, Project 72, succeeds brilliantly at putting new twists on classic Serbian dishes, and is one of the few places where the words “small plates” doesn’t send you running for cover. While their take on sarmice (small cabbage rolls) and ćevapi (meat rissoles) is delicious enough, wait till you’ve tried their savoury ice cream made from ajvar, a spicy red pepper relish. Truly divine.\n\nFor an old-fashioned, traditional Serbian meat blowout, head to Sokače, tucked into a little courtyard a few minutes’ walk from Synagogue Novi Sad (now used for cultural events). Its interior is like stepping into the 19th century, as you try to do justice to huge platters of grilled meats – ćevapi, pork neck and kobasice (piquant sausages) among them.\n\nWhere to drink\n\nWhen you’re walking along Zmaj Jovina, look out for little passages that lead to shaded gardens crammed with bars and restaurants. Wedged in among the restaurants in Passage Four is friendly little Bezec, where a glass of Serbian wine or beer costs about £1.20. On the other side of Zmaj Jovina, look out for the Rakija Bar sign over another passage filled with colourful street art and lively bars.\n\nNovi Sad’s buzziest night-time spot is the collection of bars and clubs along Laza Telečkog, off Zmaj Jovina. Head to PUBeraj, on a little side street called Mite Ružića, where there’s a very inviting garden out back.\n\nWhere to shop\n\nNovi Sad has an impressive number of independent retailers, including the beautifully crafted leather handbags on sale at the Manual Company on Zmaj Jovina.\n\nOutdoor food markets are all over the city, and one of the most central is the Fish Market on Trg Republike just north of Dunavski Park. Once the fish stalls pack up mid morning, the other stalls selling fresh local produce carry on for most of the day.\n\nIf you’re visiting the Petrovaradin Fortress across the Danube, pop into Werkstat Art & Craft Concept Store at Štrosmajerova 10. Among quirky souvenirs you’ll find some pretty handmade jewellery.\n\nArchitectural highlight\n\nLooming over the Danube’s right bank is Petrovaradin Fortress, built by the Austrians from 1692 to 1780 to ward off further attacks by the Turks. At one time the vast network of underground galleries was used as a prison, but you can now tour them with a guide. Above ground is the Novi Sad Museum, chronicling the city’s history, and the fortress’ extensive grounds are the setting for the Exit Festival.\n\nNuts and bolts\n\nWhat currency do I need?\n\nSerbian dinars.\n\nWhat language do they speak?\n\nSerbian.\n\nShould I tip?\n\nIt’s a good idea to add a 10 per cent tip to restaurant bills.\n\nWhat’s the time difference?\n\nAn hour ahead of the UK.\n\nFlight time from the UK?\n\nTwo hours and 40 minutes: Air Serbia flies direct from London Heathrow twice daily while Wizz Air flies once a day direct from London Luton.\n\nPublic transport\n\nNovi Sad’s centre is small enough to get around on foot, although there are buses. The train line between the city and Belgrade, Serbia’s capital, is closed while it’s being upgraded, but buses connect the two cities.\n\nBest view\n\nCross the Danube to the Clock Tower at Petrovaradin Fortress, where the wide terrace offers sweeping views of the city and the river. One look at the clock face will reveal why it’s nicknamed the Drunken Clock – its hands are the wrong way round and it never quite tells the right time.\n\nInsider tip\n\nIt’s just a 20-minute bus ride to visit Sremski Karlovci, a Danube winemaking town that’s one of the prettiest in Serbia.\n\nnovisad.travel/en", "description": "Serbia’s second city has a pleasingly laid-back air about it, although visitors to Novi Sad’s massive Exit Festival might never see this relaxed side. This year marks Exit’s 20th anniversary (4-7 July), and this attractive university city on the Danube is also the 2019 European Youth Capital. It’s good practice for when Novi Sad becomes the first non-EU city to take over as", "authors": ["Mary Novakovich"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/07/03/12/novi-sad.jpg"}