{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7623863/Jennifer-Hawkins-6m-Newport-house-Satellite-images-reveal-star-built-mansion-dirt.html", "downloaded_at": "2019-10-29 02:29:36.823171+00:00", "title": "Jennifer Hawkins' $6m Newport house: Satellite images reveal how the star built mansion from dirt", "language": "en", "text": "Advertisement\n\nNew satellite images show how Jennifer Hawkins and her husband Jake Wall spent years building their dream family home on Sydney's Northern Beaches before welcoming their first child, daughter Frankie Violet Hawkins Wall, last Tuesday.\n\nAfter purchasing two adjacent waterfront lots in Newport for a cool $4 million in 2014, the couple embarked on a gruelling $2 million project, transforming a vast dusty block of land into a multi-million dollar mansion.\n\nBack in 2014, the blocks were flat and empty, with just a small shack situated in the centre of the barren and bleak site.\n\nFamily: Jennifer Hawkins and husband Jake Wall welcomed their first child, daughter Frankie Violet Hawkins Wall, last Tuesday, before taking the little girl home to their $6 million mansion on Sydney's Northern Beaches\n\nLess than one year later the shack was gone, as Wall's property development business, J Group Projects, excavated the terrain, laid the foundations and began building the mega mansion.\n\nBy March 2016, the four-level, five bedroom home had taken shape, with features such as the couple's indoor elevator and infinity pool installed.\n\n‹ Slide me › Before and after: The couple spent years building the perfect family home in Newport. Swipe right for the $4 million empty plot of land they bought in 2014, and swipe left to see the home taking shape in 2016 during their $2 million build\n\nWow: The exterior of the four-level, five bedroom house, with infinity pool and dreamy views of Pittwater, was completed in 2018. Pictured: The finished property in 2019\n\nThe latest satellite images, taken in 2019, show the exterior of sprawling property complete, after the couple added finishing touches to the interior when they moved from their North Curl Curl home and into the property, in 2017.\n\nInside, the finished 3,252sqm home boasts a staircase that lights up, huge floor-to-ceiling windows and an infinity swimming pool overlooking picturesque Pittwater.\n\nTimber and concrete materials feature throughout, with sandstone walls, modern fixtures and state-of-the-art furnishings.\n\nPrivacy: The finished 3,252sqm home overlooks picturesque Pittwater. Pictured: The house during renovation in 2017\n\nHidden away: Property development business, J Group Projects, previously shared this picture of the home stunning front entrance\n\nTour: Inside, the couple's dining room is decorated with resort-style drop lights, a 16-seat table and immaculate flooring\n\nThe couple's impressive dining room is neatly decorated with resort-style drop lights, a 16-seat dining table and immaculate flooring. There is also a home gym, home theatre, huge entertainment area and four-car garage.\n\nLast year, Jennifer also shared a glimpse of her designer shoe closet, featuring rows and rows of pricey heels, on Instagram.\n\nIn May, the model stunned fans when she revealed she was pregnant, by posting a picture taken inside the house of husband Jake cradling her growing bump.\n\nWhat a dream! The finished 3,252sqm home also boasts a staircase that lights up, huge floor-to-ceiling windows and an infinity swimming pool, with Jennifer regularly sharing pictures to Instagram from inside\n\nReady to entertain! The house has a home gym, theatre, huge entertainment area and four-car garage\n\nAmazing! Last year, Jennifer shared a glimpse of her designer shoe closet, featuring rows and rows of pricey heels, on Instagram\n\nThe timing of the mansion's completion couldn't have been better, as last week Jennifer and Jake welcomed their first child, a daughter named Frankie Violet Hawkins Wall.\n\nThe 35-year-old former Myer ambassador took to Instagram on Tuesday to share photos of the new arrival.\n\nCaptioning her Instagram post, Jennifer wrote: 'Frankie Violet Hawkins Wall. Dream come true! So thankful to be holding our beautiful, healthy baby girl! We couldn't be more in love.'\n\nNew addition: Jennifer and Jake welcomed their first child, a daughter named Frankie Violet Hawkins Wall, last week", "description": "New satellite images show how Jennifer Hawkins and her husband Jake Wall spent years building their dream family home on Sydney's Northern Beaches", "authors": ["Joshua Fox For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/23/20304272-0-image-a-58_1572305919493.jpg", "published_at": "2019-10-29"}