{"pub": "investing.com", "url": "https://ng.investing.com/news/stock-market-news/argentina-pursues-5-billion-lng-project-amid-political-havoc-45189", "downloaded_at": "2019-09-05 00:07:06.513880+00:00", "title": "Argentina Pursues $5 Billion LNG Project Amid Political Havoc", "language": "en", "text": "© Reuters. Argentina Pursues $5 Billion LNG Project Amid Political Havoc\n\n(Bloomberg) -- Argentina’s state-run oil company, YPF SA, is pushing ahead with plans to build a $5 billion export terminal despite the political and financial chaos racking the nation.\n\nThe driller, which has led development of the nation’s Vaca Muerta shale trove, is in talks with potential international and domestic partners over designs for a liquefied facility. But the backdrop for those discussions has shifted dramatically after opposition candidate Alberto Fernandez beat market-friendly President Mauricio Macri in a key primary vote last month, sending shares of Argentine companies tumbling on concerns that a more protectionist government will take power.\n\nYPF executives, however, remain bullish about Argentina’s chances of becoming an established member of the small but growing club of LNG-exporting countries. “We can’t put the cart before the horse by distracting ourselves with current events,” said Marcos Browne, YPF’s executive vice president for and power. “This is the direction we need to move in.”\n\nArgentina faces stiff competition for LNG buyers as suppliers from the U.S. to Australia increase exports, adding to a global glut and sending prices for the fuel tumbling. But the YPF terminal could benefit from its location in the southern hemisphere, where seasonal gas use ebbs when it’s coldest in Asia and Europe, boosting heating demand in those regions.\n\nThe Tango floating LNG facility, which chills gas into liquid for shipment overseas, has been ramping up production on Argentina’s Atlantic coast as it readies the nation’s first full cargo of the fuel, to sail at the end of October. Tankers will leave the Bahia Blanca port every 40 days or so until May 2020, when Argentina’s winter starts and domestic gas demand surges. Exports will resume this time next year.\n\nBut the barge can only produce 500,000 metric tons a year of LNG, compared with global trade of about 290 million metric tons in 2017. A larger terminal that gives Argentina access to big importers in Asia is key to unlocking production in Vaca Muerta, where drillers face poor demand for much of the year.\n\nIt’s still unclear whether the LNG facility would be onshore or offshore, and where it would be built. Options include anchoring several floating liquefaction units like the Tango in a row, similar to Golar LNG Ltd.’s project in Cameroon, Browne said.\n\nAt YPF, a new government will likely mean management changes, and it’s unclear what the political situation will look like when final plans for the terminal are ready in about two years. But Fernandez is expected to keep supporting development of shale fields because Argentina desperately needs export dollars to shore up its currency, the peso.\n\n“The LNG terminal will be a machine for bringing in dollars,” said Sebastian Mocorrea, YPF’s executive vice president for corporate affairs. “Nobody in their right mind would meddle with it.”", "description": "Argentina Pursues $5 Billion LNG Project Amid Political Havoc", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEBAJ13K_L.jpg", "published_at": "2019-09-04"}