{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-soccer-france-ami-lyo-report/lyon-held-lille-win-ahead-of-champions-league-start-idUKKCN1VY2A3", "downloaded_at": "2019-09-14 01:45:39.711512+00:00", "title": "Lyon held, Lille win ahead of Champions League start", "language": "en", "text": "Soccer Football - Ligue 1 - Amiens SC v Olympique Lyonnais - Stade de la Licorne, Amiens, France - September 13, 2019 Olympique Lyonnais' Moussa Dembele in action with Amiens' Aurelien Chedjou REUTERS/Gonzalo Fuentes\n\nPARIS (Reuters) - Olympique Lyonnais’s stuttering start to the Ligue 1 season continued when they conceded a last-gasp equaliser in a 2-2 draw at Amiens on Friday ahead of their Champions League debut, while Lille enjoyed a 2-1 home win over Angers.\n\nFormer Lyon player Mathieu Bodmer scored two minutes into stoppage time to rescue a point for Amiens after Moussa Dembele struck twice following Christophe Jallet’s opener for the hosts, leaving OL in sixth place with eight points from five games.\n\nJallet put Amiens ahead after seven minutes with a free kick but two minutes later Dembele levelled with a cross-shot.\n\nDembele was on target again 11 minutes from the break when he deflected a Bertrand Traore cross into the net with his knee for his fifth goal of the season.\n\nHowever, Bodmer equalised for Amiens with a low close-range shot, denting Lyon’s confidence before they host Zenit St Petersburg in the Champions League on Tuesday.\n\nLast season’s runners-up Lille had earlier geared up for their clash at Ajax Amsterdam in Europe’s elite club competition with a convincing victory against Angers.\n\nVictor Osimhen and Luiz Araujo scored either side of halftime to secure the points as the northerners moved up to fourth in the standings on nine points from five games.\n\nThey trail leaders Paris St Germain, who play Racing Strasbourg at the Parc des Princes on Saturday, on goal difference.\n\nAngers, who had reduced the arrears with a late Stephane Bahoken goal, are also on nine points, in fifth place.", "description": "Olympique Lyonnais's stuttering start to the Ligue 1 season continued when they conceded a last-gasp equaliser in a 2-2 draw at Amiens on Friday ahead of their Champions League debut, while Lille enjoyed a 2-1 home win over Angers.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190913&t=2&i=1429574025&w=1200&r=LYNXNPEF8C280", "published_at": "2019-09-13"}