{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/aap/article-7629241/Drought-hits-food-bills-Aussie-homes.html", "downloaded_at": "2019-10-30 06:54:23.518734+00:00", "title": "Drought hits food bills for Aussie homes", "language": "en", "text": "Drought ravaging crucial parts of Australia's food bowl is driving prices up for shoppers amid growing political angst about relief for farmers.\n\nThe Australian Bureau of Statistics' latest inflation figures show the cost of meat and seafood, dairy, bread and cereals rose in the past quarter.\n\nMeat and seafood was up 1.7 per cent, dairy rose 2.2 per cent and bread and cereal products lifted 1.3 per cent.\n\n\"Despite the price falls for fruit and vegetables this quarter, the drought is impacting on the prices for a range of food products,\" ABS senior economist Bruce Hockman said.\n\nBIS Oxford senior economist Sean Langcake said lamb and beef prices were 14 and seven per cent higher than this time last year.\n\n\"Higher meat prices are the result of higher water and feed costs faced by producers. Additionally, smaller herd sizes after years of challenging conditions may be contributing to lower supply,\" he said.\n\nFarmers and consumers are feeling the pinch, as the federal government weighs its next move to help communities grappling with the prolonged dry spell.\n\nThere's confusion around payments for drought-affected farmers, with Labor accusing the government of being in chaos as senior ministers struggle to sing the same tune.\n\nLegislation is before parliament to provide lump sum payments of $13,000 for couples and $7500 for singles who reach the end of the four years on the Farm Household Allowance.\n\nDrought Minister David Littleproud muddied the waters by saying no farmer reaching the end of the four-year limit would be kicked off the payment.\n\nBut that's not government policy, with Deputy Prime Minister Michael McCormack saying \"watch this space\" when asked on Wednesday about a second round of lump sum payments.\n\nMr Littleproud's office has pointed to the draft laws before parliament which allow the government to make further payments beyond the allowance's life span.\n\nMr McCormack also hinted that mechanism could be used to ensure people reaching the end of four years get extra support.\n\n\"The legislation allows us to make supplementary payments,\" he told Sky News.\n\n\"We'll continue to do that. It's very, very important that people know the federal government has their back.\"\n\nOpposition agriculture spokesman Joel Fitzgibbon said the debate had sent mixed messages to drought-affected farming families.\n\n\"A confusion created because the government is at war with itself,\" he said.\n\nCabinet met in Sydney on Wednesday to thrash out a range of proposals to support drought-affected producers and communities.\n\nSenior ministers will meet again next week, when an announcement about the next round of drought relief is likely to be made.\n\n\"We've got a good package of announcements to be made and that will continue,\" Mr McCormack said.", "description": "Drought ravaging crucial parts of Australia's food bowl is driving prices up for shoppers amid growing political angst about relief for farmers.The...", "authors": ["Australian Associated Press"], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-30"}