{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7550207/Now-experts-say-pollution-cause-hair-loss-Tiny-pollutants-decrease-hair-growth-proteins.html", "downloaded_at": "2019-10-09 01:07:59.770973+00:00", "title": "Now experts say pollution may cause hair loss! Tiny pollutants 'decrease hair growth proteins'", "language": "en", "text": "Pollution could be making your bald by decreasing levels of crucial proteins for hair growth, scientists fear.\n\nFor the first time, researchers have shown tiny toxic particles can damage chemical processes within cells that promote hair growth.\n\nThis 'could lead to baldness', the scientists claim. However, further trials are needed because their studies were on human cells in the lab.\n\nThe work focused on common air pollutants known as particulate matter (PM), which are emitted by car exhausts, industry and household heating.\n\nPM is at the centre of a public health storm, having been linked to serious problems including asthma, heart and lung disease.\n\nBut evidence of its effects on skin is still in its infancy - despite a growing market for anti-pollution cosmetics.\n\nPollution could hair loss by decreasing the levels of crucial growth proteins, scientists say\n\nThe research was conducted by The Future Science Research Centre in the Republic of Korea, led by Hyuk Chul Kwon.\n\nThe team harvested cells from the human scalp at the base of hair follicles, known as dermal papilla cells (DPs).\n\nDPs sit at the base of a hair follicle, underneath the scalp, and work alongside skin surface cells to control the formation of the hair shaft.\n\nThese cells are responsible for hair growth and hair retention and need proteins to to function.\n\nThe DPs were exposed to various concentrations of PM10, which are particles with a diameter of ten micrometres or smaller, including diesel and dust.\n\nAfter 24 hours the researchers detected the levels of specific proteins in the cells using a scientific process known as western blotting.\n\nThe test can identify which proteins are present and in what quantities, depending on how they bind to specific antibodies.\n\nWHAT ARE THE CAUSES OF HAIR LOSS? It is perfectly normal for people to lose small amounts of hair as it replenishes itself and, on average, people can shed between 50 and 100 hairs per day. However, if people start to lose entire patches of hair or large amounts of it it can be more distressing and potentially a sign of something serious. Pattern baldness is a common cause of hair loss as people grow older. At least half of men over the age of 50 will lose some of their hair just through the ageing process, according to the British Association of Dermatologists. Women may lose their hair as they grow older, too. Other, more concerning causes of hair loss include stress, cancer treatment such as chemotherapy or radiotherapy, weight loss or an iron deficiency. Most hair loss is temporary, however, and can be expected to grow back. Specific medical conditions which cause the hair to fall out include alopecia, a disorder of the immune system; an underactive or overactive thyroid; the skin condition lichen planus or Hodgkin's lymphoma, a type of cancer. People should visit their doctor if their hair starts to fall out in lumps, falls out suddenly, if their scalp itches or burns, and if hair loss is causing them severe stress.\n\n\n\nResults showed the levels of beta-catenin had dropped, a protein which is responsible for triggering hair growth.\n\nThe study also revealed that the levels of three other proteins - cyclin D1, cyclin E and CDK2 - were decreased by PM10, which would affect both hair growth and retention.\n\nDr Hyuk Chul Kwon said: 'Our research explains the mode of action of air pollutants on human follicle dermal papilla cells, showing how the most common air pollutants lead to hair loss.\n\n'The results suggest that particulate matter may causes hair loss.\n\n'It is therefore possible to hypothesise that at certain levels of exposure, this could lead to baldness. But further population-based research needs to be undertaken to confirm this.\n\n'While the link between air pollution and serious diseases such as cancer, COPD [chronic obstructive pulmonary disease] and CVD [cardiovascular disease] are well established there is little to no research on the effect of particular matter exposure on the human skin and hair in particular.'\n\nPM is made up of a mixture of solid particles and droplets found in the air that are so small they can be inhaled.\n\nPM2.5 are the smallest particles, with a diameter of 2.5 micrometres or smaller - finer than a human hair.\n\nBoth PM10 and PM2.5 are considered to be major pollutants, alongside nitrogen oxide, ammonia and sulphur dioxide.\n\nAlmost 40 per cent of PM emissions that originate in the UK come from burning wood and coal in domestic open fires and solid fuel stoves. Some 16 per cent is from industrial combustion.\n\nPM has the ability to travel large distances. Therefore, what is emitted into the atmosphere in one country can end up in another.\n\nExperts have warned even low levels of exposure to pollution is dangerous, suggesting current air quality guidelines don't protect public health.\n\nOutdoor air pollution is estimated to kill 4.2million people every year, according to The World Health Organization.\n\nBut the effects on the skin and hair are not as well established as disease burden.\n\nThe beauty industry is saturated with 'anti-pollution' products with claims of preventing premature ageing and lifeless hair.\n\nBut the manufactures are generally referring to free radicals when they mention 'pollution'.\n\nFree radicals are generated by smog, cigarette smoke and chemicals in the house. When there is an imbalance in the body, it can cause oxidative stress.\n\nOxidative stress has been linked to ageing and other diseases because damage takes place in DNA and proteins.\n\nDr Kapil Bhargava, a consultant dermatologist and British Skin Foundation spokesperson, said: 'Pollutants seems to be exacerbating a number of skin conditions such as pigmentation or hair loss.\n\n'More and more evidence is emerging regarding pollution and the skin - pollutants will cause damage to skin cells by the formation of free radicals or other chemicals.\n\n'However pollution specific conditions are not yet clearly defined.\n\n'Products to combat the pollution related changes are being widely sold but there is little evidence that they work to prevent the damage from pollution to the skin.'\n\nThe research was presented today at the 28th European Academy of Dermatology and Venereology Congress in Madrid and has not been published yet.", "description": "Scientists in the Republic of Korea studied particulate matter (PM), one of the main pollutants. They said its effects 'could lead to baldness', but further studies need to confirm this.", "authors": ["Vanessa Chalmers Health Reporter For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/15/19445482-0-image-a-18_1570544141852.jpg", "published_at": "2019-10-08"}