{"pub": "yahoo", "url": "https://news.yahoo.com/rudy-giuliani-lawyer-john-dowd-comic-sans-letter-010609958.html", "downloaded_at": "2019-10-08 02:18:54.705900+00:00", "title": "Ex-Trump Lawyer Issues Formal Legal Notice To Congress... In Comic Sans.", "language": "en", "text": "Two of Rudy Giuliani’s associates will not comply with a congressional committee’s deadline to appear and produce documents relating to their work in Ukraine, according to a letter written by their lawyer in a rather unusual font.\n\n“Comic Sans” was trending Monday on Twitter when a legal notice written by lawyer John Dowd, who was President Donald Trump’s lead attorney in the Russian interference investigation, was made public.\n\nHe wrote a letter in Comic Sans, printed it out, signed it, scanned it, then e-mailed the scan.\n\n\n\nI kind of admire his consistency, such a ridiculous process and ugly appearance befits the frivolous arguments made in the letter. https://t.co/Tej5lBlWfy — Max Kennerly (@MaxKennerly) October 7, 2019\n\nDowd’s notice, which was dated Oct. 3, informed the House Intelligence Committee that his clients Lev Parnas and Igor Fruman would not meet the Monday deadline to voluntarily turn over documents relating to their activities with Giuliani, Trump’s personal lawyer.\n\nDowd labeled the request and time frame provided as “unduly burdensome,” adding that he believed the Democratic committee members’ intent was to “harass, intimidate and embarrass” his clients.\n\nDemocrats working on the intensifying impeachment inquiry into the president said the two businessmen’s decision to ignore the request would lead to subpoenas. Giuliani was subpoenaed last month for documents relating to the inquiry.\n\nParnas and Fruman were cited (although not by name) in the government whistleblower complaint alleging misconduct by the president. The two Soviet-born South Florida businessmen introduced Giuliani to top Ukrainian political circles, according to reports.\n\nParnas told the Miami Herald that, thanks to his friendship with Giuliani, he and Fruman were able to provide the Trump administration with information on alleged wrongdoing by Trump’s 2020 rival Joe Biden and his son Hunter Biden.\n\nThere has been no evidence of wrongdoing by the Bidens, and the unfounded allegations are instead being investigated as an attempt by Trump to enlist foreign assistance in order to smear his potential rival for the presidency in 2020.\n\nOn Monday, Twitter users were in awe that an attorney of Dowd’s status and experience would write a letter of such gravity in a font widely considered to be childlike and, well, just the worst:\n\nIt's a little-known fact that a lawyer who emails the scan of a signed printout of a legal letter originally typed out in Comic Sans is automatically disbarred pursuant to Judiciary Law § 90(2) https://t.co/Rwakta4Gk3 — Letters of Note (@LettersOfNote) October 7, 2019\n\nIt really is impressive that John Dowd has built up such a solid career that he can write official letters in comic sans and not lose all of his clients https://t.co/SHr19URPCl — Robert Maguire (@RobertMaguire_) October 7, 2019\n\nVIA E-MAIL in comic sans this is the extremely good lawyerin’ shit https://t.co/zKmizbjDDZ — kilgore trout will be the hero (@KT_So_It_Goes) October 7, 2019\n\nFriends don’t let friends use comic sans https://t.co/74gHPluZKg — Mollie Bryant (@MollieEBryant) October 7, 2019\n\nNothing says quality legal representation like Comic Sans https://t.co/MXEggSnnRU — Brendan Nyhan (@BrendanNyhan) October 7, 2019\n\nOthers thought the font was befitting for the letter’s content and the times in which we currently live:\n\nOh my god The Stupidest Timeline has finally hit Comic Sans https://t.co/HR0iPAVgYI — Laura Hudson (@laura_hudson) October 7, 2019\n\nThis whole administration was written in comic sans — Jeffrey Burr (@JeffreyFBurr) October 7, 2019\n\nI know that \"hating Comic Sans\" has become emblematic of a kind of boring and extremely online snobbery, but honestly I think this might be the most fitting use for it possibly ever? https://t.co/a1rnXMeqlX — andi zeisler (@andizeisler) October 7, 2019\n\nHistorians will call our time “the Comic Sans Era.” https://t.co/DmGJsYK58V — John M. Donnelly (@johnmdonnelly) October 7, 2019\n\nAnd some pointed out the font seemed to be a favorite of Dowd’s for formal communications:\n\nLove HuffPost? Become a founding member of HuffPost Plus today.\n\nJohn Dowd still writes his letters in comic sans. (He also the used the font in a January 2018 letter to Robert Mueller when he was representing President Trump: https://t.co/snlSFyyzH6) https://t.co/Z1QNWJ0ZVR — Gabe Fleisher (@WakeUp2Politics) October 7, 2019\n\nComic Sans appears to be John Dowd’s preferred font. https://t.co/jPzb8s9rYo https://t.co/zIR4Qu0hkx — Ryan J. Reilly (@ryanjreilly) October 7, 2019\n\nRelated Coverage\n\nRudy Giuliani Declares His Mission Is 'To Disrupt The World'\n\nTrump Allies Pressed Ukraine Over Gas Firm\n\nPentagon And Budget Office Subpoenaed In House Impeachment Probe\n\nThis article originally appeared on HuffPost.", "description": "John Dowd, who is representing Rudy Giuliani's associates in impeachment investigations, is being eaten alive on Twitter for a very weird reason.", "authors": ["Josephine Harvey"], "top_image": "https://s.yimg.com/uu/api/res/1.2/pSlkIG7xd1cEOo1IWs6ieg--~B/aD0zMDAwO3c9MTk5MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://img.huffingtonpost.com/asset/5d9bb5342100009004abac30.jpg", "published_at": "2019-10-08"}