{"pub": "investing.com", "url": "https://investing.com/analysis/bces-bell-mobility-extends-broadband-connectivity-in-canada-200467485", "downloaded_at": "2019-09-24 15:25:17.576481+00:00", "title": "BCE's Bell Mobility Extends Broadband Connectivity In Canada", "language": "en", "text": "Bell Mobility, the wireless service provider and subsidiary of BCE Inc. (TSX: ) , has extended its broadband service in Nunavut — the northernmost territory of Canada — as part of the company’s commitment to provide wireless network connectivity across rural and remote locations of the country. The sparsely populated region that forms most of the Canadian Arctic Archipelago will, thus, gain access to mobile data speeds of up to 100 megabits per second (“mbps”).\n\n\n\nAs the leading telecommunications service provider in Canada, Bell is aiming to bring Internet service in smaller towns and rural communities across the country that were hitherto unserved by any carrier. Under the Wireless Home Internet program, the company is targeting to serve about 1 million rural households across Atlantic Canada, Québec, Ontario and Manitoba.\n\n\n\nBCE, the parent firm of Bell, is likely to benefit from robust activities in the wireless business, strong subscriber additions, drop in churn rates and focus on technology upgrades. The company continues to focus on six strategic areas, including investment in broadband network and services, accelerating wireless services, leveraging wireline momentum, expanding media coverage, improving customer service and achieving a competitive cost structure. These initiatives are expected to generate higher revenues per user and attract new customers in the future.\n\n\n\nNotably, BCE and TELUS Corporation (NYSE: ) recently extended their LTE-M coverage in the United States with a strategic tie-up with AT&T (NYSE: ) . The reciprocal agreement also enables AT&T subscribers to enjoy their LTE-M network while roaming in Canada.\n\n\n\nLTE-M or Long-Term Evolution, category M1 is the technology that supports low-power IoT applications with enhanced coverage, longer battery life and lower operating costs. It helps IoT devices connect directly to a 4G network without a gateway, and is compatible with 5G deployments. These networks operate within a licensed spectrum, with carrier-grade security and support firmware and software updates. In addition, these allow low-power devices such as smart wearables, trackers and industrial sensors to operate across continents.\n\n\n\nWhile Bell was the first Canadian carrier to launch the LTE-M network in early 2018, TELUS rolled out the service in October the same year. On one hand, Bell’s LTE-M networks support a wide array of large-scale IoT innovations, such as asset tracking, fleet management, smart sensors, smart city applications and municipal water-system management. On the other hand, TELUS’ LTE-M network is built on licensed cellular standards-based technology, which offers high-quality service, greater reliability and carrier-grade security.\n\n\n\nBy collaborating with a premier global carrier to activate LTE-M roaming facilities, both Bell and TELUS have unlocked newer business opportunities for their users for accelerated growth in the IoT space. The Canadian carriers also expect to benefit immensely from the increased 5G deployment of AT&T.\n\n\n\nBCE currently carries a Zacks Rank #2 (Buy). Another top-ranked stock in the same space is Cincinnati Bell Inc (NYSE: ) , also carrying a Zacks Rank #2. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\n\n\nCincinnati Bell has a long-term earnings growth expectation of 2%.\n\n\n\nToday's Best Stocks from Zacks\n\n\n\nWould you like to see the updated picks from our best market-beating strategies? From 2017 through 2018, while the gained +15.8%, five of our screens returned +38.0%, +61.3%, +61.6%, +68.1%, and +98.3%.\n\n\n\nThis outperformance has not just been a recent phenomenon. From 2000 – 2018, while the S&P averaged +4.8% per year, our top strategies averaged up to +56.2% per year.\n\n\n\nSee their latest picks free >>", "description": "Stocks Analysis by Zacks Investment Research covering: S&P 500, AT&T Inc, Cincinnati Bell Inc, BCE Inc.. Read Zacks Investment Research's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-24"}