{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/tea-with-zille-no-word-from-malema-yet-on-invite-to-discuss-sas-future-20191001", "downloaded_at": "2019-10-05 11:53:29.386114+00:00", "title": "Tea with Zille: Malema spurns invite to discuss SA's future", "language": "en", "text": "EFF leader Julius Malema has rejected an invitation from former premier of the Western Cape, Helen Zille, to discuss the future of the country.\n\n\n\nOn Tuesday morning, Zille tweeted an invitation to Malema to appear as a guest on her podcast \"for a no-holds barred discussion on South Africa's future prospects\".\n\nZille's podcast, Tea with Helen, has seen her joined by notable South African minds such as former Public Protector Thuli Madonsela, Wits vice-chancellor Adam Habib as well as journalists Ferial Haffajee and Max du Preez.\n\nThe one-time DA leader, who is now a senior policy fellow for the Institute for Race Relations, initially posted a Twitter poll on Monday calling for public input as to who she should interview next on her show - former president Thabo Mbeki or Malema.\n\nSeemingly, Malema won out and Zille sent out the call to the EFF leader.\n\n\n\nQuestions sent to the EFF's communications team by News24 went unanswered at the time of writing, but Malema responded in a tweet to Zille.\n\nTwitter users had various reactions to the invitation.\n\nOne user suggested it \"… somehow extends unity between people of colour in South Africa\".\n\nAnother user suggested the invitation was part of a ploy to launch the podcast.\n\nOne Twitter user said they \"encourage the CIC to attend this session, provided that the tea will not be spilled on him and the session scandalised\".", "description": "EFF leader Julius Malema has rejected an invitation from former premier of the Western Cape, Helen Zille, to discuss the future of the country.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9336/2399c6354ba9451ba7e7e4f5d7268bed.jpg", "published_at": "2019-10-01"}