{"pub": "marketwatch", "url": "https://marketwatch.com/story/millennials-and-generation-z-are-more-likely-to-quit-their-jobs-over-mental-health-issues-2019-10-10", "downloaded_at": "2019-10-10 18:25:00.463088+00:00", "title": "Millennials and Generation Z are more likely to quit their jobs over mental-health issues", "language": "en", "text": "World Mental Health Day on Oct. 10 is a day for global mental-health education and advocacy to reduce the social stigma of mental-health issues.\n\nThree in four members of Generation Z and half of millennials say they have voluntarily quit jobs due in part to mental-health symptoms, according to survey research released ahead of Thursday’s World Mental Health Day and featured in the Harvard Business Review.\n\nThat’s compared to 20% of overall respondents who reported having left a job for mental-health reasons, and less than 10% of baby boomers who said the same, according to the national online survey conducted by the mental-health nonprofit Mind Share Partners of 1,500 people working in for-profit, nonprofit and government organizations.\n\nThis disparity signals a “generational shift in awareness” of mental-health issues, the report’s authors wrote in the Harvard Business Review. Indeed, some have suggested that younger generations are more accepting of people with mental-health conditions, more inclined to try therapy and more willing to discuss mental health openly — perhaps making them more aware of the issue.\n\nThe share of adolescents and young adults experiencing serious psychological distress, major depression or suicidal thoughts has seen a significant increase over the past decade, according to separate American Psychological Association research published in March. Among adults 26 and over, those trends were “weak or non-existent,” said the study’s lead author, who suggested digital media use and poor sleep among younger people could be factors.\n\nMeanwhile, young people have grown increasingly likely to seek treatment for mental health: For example, utilization of college counseling centers rose by 30% to 40% on average between fall 2009 and spring 2015, even as enrollment inched up just 5%, according to a 2018 report by Penn State University’s Center for Collegiate Mental Health.\n\nThe present study’s findings demonstrate that the experience and impact of mental-health problems can vary by demographic group, the report’s authors wrote, including racial and ethnic groups, gender, age, sexual orientation, and parents versus non-parents. “The experience of mental health at work is not uniform,” they wrote, citing the experiences of some LGBTQ, black and Hispanic respondents.\n\nStill, there was no significant difference across seniority levels in the symptoms reported, the survey found.\n\nThe authors, pointing to their finding that nearly six in 10 respondents had experienced at least one mental-health symptom in the past year, suggested that government estimates do not capture the full scope of the problem. The Substance Abuse and Mental Health Services Administration estimated in 2015 that about one in five American adults (or 43.4 million people) had experienced mental illness within the previous year.\n\nOrganizations can hang on to their talent by paying more attention to mental-health issues, the report suggested — particularly those impacting minority employees.\n\n“Employees feel unequipped and unsupported at work and, thus, don’t get help,” the authors wrote. “Our findings highlight the need for greater leadership support for mental health, company-wide awareness and training, and workplace policies and practices that are consistent with this message.”\n\nJust 41% of respondents to the Mind Share Partners survey thought their company prioritized mental health relative to other concerns, and 39% said their manager would be well-equipped to help in the event of their having a mental-health condition.\n\nThe report also shed light on the continued stigma surrounding mental health in the workplace: Less than one-third of respondents said they felt comfortable seeking support, even though about twice as many said they felt comfortable providing such support to coworkers.\n\nNearly six in 10 respondents said they’d “never” spoken with colleagues about their mental health over the past year, with baby boomers and Generation Xers far more likely than their younger counterparts to report not discussing it. Just 48% of those who had a workplace conversation about their mental health deemed it a positive experience, while 30% said it was “neutral,” 15% said it was negative and 3% said they didn’t receive any response.", "description": "The finding signals a ‘generational shift in awareness,’ say the authors of a new report.", "authors": ["Meera Jagannathan"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT070_mental_ZG_20191010123212.jpg", "published_at": "2019-10-10"}