{"pub": "usatoday", "url": "https://usatoday.com/story/money/2019/10/07/3-smart-social-security-moves-you-can-make-right-now/40243077", "downloaded_at": "2019-10-07 12:04:56.106419+00:00", "title": "3 smart Social Security moves you can make right now", "language": "en", "text": "CLOSE\n\nEven if retirement is still far off, these strategic moves could boost your benefits.\n\n(Photo: Getty Images)\n\nSocial Security benefits can play a major role in retirement, particularly if your savings alone aren't enough to cover all your expenses.\n\nAlthough relying on your monthly checks for the majority of your retirement income isn't recommended, your benefits can significantly help pay the bills. In order to make the most of your money, though, you'll need to have a Social Security strategy going into retirement. Even if retirement is still decades away, there are a few smart Social Security moves you can make right now to prepare.\n\n1. Check your estimated benefit amount\n\nYou don't have to wait until you file for benefits to find out how much you'll be receiving. In fact, you can see an estimate of your future benefit amount simply by creating a mySocialSecurity account to check your statements online.\n\nYour estimated benefit amount is based on your real earnings, but keep in mind that it can change depending on how many more years you intend to work. Your basic benefit amount is based on an average of the 35 highest-earning years of your career, so if you haven't worked 35 years yet, your benefit amount will probably look a little low. But if you're close to retirement and don't expect your annual earnings to change much between now and then, your benefit estimate will be more accurate.\n\nMark Oct. 10 on your calendar: Here's why it's Social Security's most important day of the year\n\nLook out for scams: Social Security scammers invented wild cover stories, posed as dead relatives, feds say\n\nIf you've worked at least 35 years and your benefit amount is less than you expected, you have the power to change that by working a few years longer. You're likely earning more per year now than you were early on in your career, so by working longer you can replace some of your earlier, lesser-earning years with higher-earning years to bring up your average -- and thus increase your benefit amount. You may even choose to pick up a side job to further increase your income, which can also give your benefits a boost.\n\n2. Think about what age you want to claim at\n\nYour highest-earning working years aren't the only thing that impact your benefit amount; the age at which you claim also makes a significant difference.\n\nYou can begin claiming your benefits at age 62 or anytime thereafter, but the only way to receive your full benefit amount is to claim at your full retirement age (FRA). For those born in 1960 or later, your FRA is age 67. Anyone born before 1960 has an FRA of either 66 or 66 and a few months, depending on exactly what year you were born in. You can also receive additional benefits each month by waiting to claim until after your FRA. While you can claim at any age after 62, the additional benefits run out at age 70 – so there's no reason to wait until after that age to claim.\n\nDepending on how early or late you claim, it could decrease or increase your benefits by hundreds of dollars per month. For instance, say your FRA is age 67 – if you claim then, you'll be receiving $1,800 per month. Claim at age 62, and your checks will be reduced by 30%, leaving you with $1,260 per month. Or if you wait until age 70 to file for benefits, you'll receive an extra 24% each month, or $2,232.\n\nYou don't have to retire and claim benefits simultaneously, but the age at which you claim can impact the age you choose to retire. If your savings are falling short, you may choose to delay retirement and claim benefits to give yourself more time to save and also earn those bigger checks each month. Or if you have a healthy retirement fund and don't need the extra cash you'd receive by holding off on claiming benefits, you might choose to retire and claim early. By thinking about this decision long before you retire, it gives you more time to determine which option is right for you.\n\n3. Double-check how much you expect to rely on your benefits\n\nYour Social Security benefits are only intended to cover about 40% of your pre-retirement wages, so they're not designed to be your primary or sole source of retirement income. As you're planning for retirement, double-check that you're not going to be relying on your benefits too heavily.\n\nWhen you know how much you can expect to receive each month as well as how the age you begin claiming affects that amount, you'll have a good idea of how much Social Security can help pay your retirement bills. In turn, that will help you determine how much you need to save on your own to bridge the gap.\n\nFor example, if you expect to receive around $1,800 per month in benefits and you estimate you'll need roughly $3,500 per month to pay all your bills in retirement, that means the other $1,700 per month will need to come from your savings. With this figure in mind, you can then determine how much you'll need to save total by retirement age.\n\nKeep in mind that it's a good idea to be conservative here and assume you should probably save more than you think. There's a chance Social Security benefits may be reduced in the relatively near future, and if that happens, you don't want to be just a few short years from retirement only to find out you haven't saved enough.\n\nSocial Security benefits are an essential part of your retirement plan, but you don't have to wait until you retire to start maximizing them. By making these Social Security moves now, you can develop a smart retirement strategy to make the most of your money.\n\nThe Motley Fool has a disclosure policy.\n\nThe Motley Fool is a USA TODAY content partner offering financial news, analysis and commentary designed to help people take control of their financial lives. Its content is produced independently of USA TODAY.\n\nOffer from the Motley Fool: The $16,728 Social Security bonus most retirees completely overlook\n\nIf you're like most Americans, you're a few years (or more) behind on your retirement savings. But a handful of little-known \"Social Security secrets\" could help ensure a boost in your retirement income. For example: one easy trick could pay you as much as $16,728 more... each year! Once you learn how to maximize your Social Security benefits, we think you could retire confidently with the peace of mind we're all after. Simply click here to discover how to learn more about these strategies.\n\nRead or Share this story: https://www.usatoday.com/story/money/2019/10/07/3-smart-social-security-moves-you-can-make-right-now/40243077/", "description": "In order to make the most of your money, you'll need to have a Social Security strategy going into retirement.", "authors": ["Katie Brockman", "The Motley Fool", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/9e1f6e2ee20f44aa1f3be4f71e9f3e52b6ae2c7e/c=0-110-2121-1303/local/-/media/2019/10/04/USATODAY/usatsports/social-security-calculator-card-statement.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-07"}