{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/27/democratic-party-pares-down-presidential-debate-to", "downloaded_at": "2019-09-28 01:19:13.083263+00:00", "title": "Democratic Party pares down presidential debate to one night only", "language": "en", "text": "The days of 20-plus Democratic presidential hopefuls are dwindling. The Democratic National Committee revealed Friday that it will stage only a single debate to accommodate a dozen candidates who made the cut.\n\n“To address several inquiries we have received we are writing to let you know that, pending a final decision after the certification deadline, it is the intention of the DNC and our media partners to hold the October debate over one night on Tuesday October 15th,” the organization said in an email.\n\nCNN serves as the host this time around. The party’s fourth-sanctioned primary debate will air live on the network at 8 p.m. ET from Otterbein University in Westerville, Ohio, with anchors Erin Burnett and Anderson Cooper and New York Times national editor Marc Lacey serving as moderators.\n\nThe 12 lucky participants: former Vice President Joseph R. Biden; Sens. Cory A. Booker of New Jersey, Kamala D. Harris of California, Amy Klobuchar of Minnesota, Bernard Sanders of Vermont, and Elizabeth Warren of Massachusetts; former South Bend, Indiana, Mayor Pete Buttigieg; former Housing and Urban Development Secretary Julián Castro; Rep. Tulsi Gabbard of Hawaii; former Texas Rep. Beto O’Rourke; and businessmen Tom Steyer and Andrew Yang.\n\n“At this time, no other candidate appears close to reaching the polling and fundraising thresholds by the October 1 deadline. To receive an invitation to the debate, candidates need to meet a 2% polling threshold in four DNC-approved polls and at least 130,000 unique donors, including 400 donors per state from at least 20 states, to qualify,” CNN noted in a statement.\n\nThat marks a change from the first two Democratic debates, where 20 qualifying candidates were randomly divided into two groups of 10, over two nights.\n\n“A DNC official said several factors were taken into account in deciding to focus on one night,” noted CNN, which hosted a Democratic debate in Detroit in midsummer.\n\n“Our goal has always been to expand viewership, and we also believe that one night worked well for this last debate,” said the official, speaking on background.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The days of 20-plus Democratic presidential hopefuls are dwindling. The Democratic National Committee revealed Friday that it will stage only a single debate to accommodate a dozen candidates who made the cut.", "authors": ["The Washington Times Http", "Jennifer Harper"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/08/17/Election_2020_Democrats_Debate_45768.jpg-2fdd2_c0-0-3000-1749_s1770x1032.jpg?4ec8ef4b5df28140b7ab4a06fbd1165bdd086b07", "published_at": "2019-09-27"}