{"pub": "wsj", "url": "https://wsj.com/articles/graduate-students-to-lose-unionization-rights-under-nlrb-rule-11569008311?mod=rsswn", "downloaded_at": "2019-09-20 22:54:12.923515+00:00", "title": "Graduate Students to Lose Unionization Rights Under NLRB Rule", "language": "en", "text": "Graduate students, who often teach the bulk of university classes, would lose their status as employees and their rights to join a union, under a proposed rule approved Friday by the National Labor Relations Board.\n\nIf the rule passes a final vote as expected, graduate students won’t be covered by the National Labor Relations Act of 1935 and therefore won’t have the right to unionize.\n\n“University administrators will support this rule making because it would supply a level of certainty that they can operate under,” said Robert Duston, a partner at the Washington, D.C., law firm of Saul Ewing Arnstein & Lehr. Mr. Duston represents university administrators.\n\nA 60-day public comment period must pass before the board can take a final vote. Graduate student union leaders said they would use the time to mount a campaign to stop the rule.\n\nThe five members of the NLRB are appointed by the White House and over the past 20 years the board has become a partisan battleground. This proposed rule was passed Friday by a vote of 3 to 1; there is one vacant seat. The three board members who support it were appointed by President Trump. The only dissent came from an Obama appointee.\n\nMatthew Taft, co-chair of the graduate student union at Duke University, said the decision was a setback but students would continue making their case.\n\n“This should not be viewed in isolation but as part of a broader attempt by the Republican Party and the Trump administration to undermine workers’ rights across the country,” he said.\n\nThe status of graduate students has been a partisan issue for decades. Graduate students at private colleges and universities were considered students until 2000 when the NLRB, then controlled by appointees of President Bill Clinton, ruled that they were employees. When board members appointed by President George W. Bush assumed control of the board, they reversed course and said graduate students should not be considered employees. That decision was overturned in 2016 by a board controlled by appointees of President Barack Obama.\n\nWrite to Douglas Belkin at doug.belkin@wsj.com", "description": "Graduate students, who often teach the bulk of university classes, would lose their status as employees and their rights to join a union, under a proposed rule approved by the National Labor Relations Board.", "authors": ["Douglas Belkin"], "top_image": "https://images.wsj.net/im-109393/social", "published_at": "2019-09-20"}