{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-eu-johnson-farage/pm-johnson-says-no-to-election-pact-with-brexit-party-idUKKBN1W82N1", "downloaded_at": "2019-09-24 01:22:01.876523+00:00", "title": "PM Johnson says no to election pact with Brexit Party", "language": "en", "text": "NEW YORK (Reuters) - British Prime Minister Boris Johnson said on Monday his governing Conservative Party would not agree an election pact with Nigel Farage’s Brexit Party, which has offered a deal if Johnson agrees to a clean break from the European Union.\n\nFILE PHOTO: British Prime Minister Boris Johnson attends a roundtable at Downing Street in London, Britain, September 19, 2019. REUTERS/Henry Nicholls/Pool\n\nWith parliament deadlocked and divided over the terms of Britain’s exit from the bloc, a general election is widely expected to take place within the coming months, although the timing of it is uncertain.\n\nFarage, one of the main forces behind the campaign for Brexit for many years but also usually a vitriolic critic of the Conservatives, has offered Johnson an electoral pact to ensure Brexiteers remain in power to deliver the divorce come what may.\n\n“The Conservative Party is the oldest, most successful political party in the world and we will be contesting the next election ... as Conservatives and not in an alliance, or a pact ... ,” Johnson said during a visit to New York for the UN General Assembly.\n\nFarage has proposed not standing against Conservative candidates in return for having a free run in 80 to 90 parliamentary seats in Wales, the Midlands and the North East of England, where his party hopes to beat the opposition Labour Party.\n\nJohnson, who has lost his working majority in the House of Commons, said “of course” when asked whether the Conservatives would contest every seat in an election.\n\nJohnson, who has lost his working majority in the House of Commons, wants to hold an election but parliament has ordered him to ask the EU to delay Brexit until 2020 unless he can strike a transition deal at an EU summit on Oct. 17-18.\n\nHaving vowed to take Britain out of the European Union at the end of October with or without an exit deal, Johnson has twice tried and failed to break the logjam by getting parliament’s approval to hold an early election.\n\nOpposition lawmakers do not want to agree to an election until they are sure the possibility of Britain leaving without an agreement has been eliminated.\n\nEarlier this month parliament passed a law which requires Johnson to delay Brexit if he does not reach a deal with the EU’s 27 other members, but he has said he will not ask for an extension.\n\nIf Johnson is thwarted in his attempt to deliver Brexit by the end of October, Brexit-supporting voters could abandon his party for Farage’s party, which rode a wave of anger over the delay to Brexit to win May’s European elections in Britain.", "description": "British Prime Minister Boris Johnson said on Monday his governing Conservative Party would not agree an election pact with Nigel Farage's Brexit Party, which has offered a deal if Johnson agrees to a clean break from the European Union.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190923&t=2&i=1433100850&w=1200&r=LYNXMPEF8M240", "published_at": "2019-09-23"}