{"pub": "dailymail", "url": "https://dailymail.co.uk/money/podcast/article-7289945/Will-Boris-bounce-Brexit-hangover-Money-podcast.html", "downloaded_at": "2019-10-07 20:44:57.617612+00:00", "title": "Will there be a Boris bounce or Brexit hangover? This is Money podcast", "language": "en", "text": "Out go Theresa May and Philip Hammond, in come Boris Johnson and Sajid Javid – will it result in your finances falling out of top gear, or going on a grand tour?\n\nThat's the question editor Simon Lambert, assistant editor Lee Boyce and host Georgie Frost tackle this week, as we have a new Prime Minister at the helm, and a new Chancellor as his sidekick.\n\nBoris has hinted at a stamp duty cut, an income tax cut, a fix for the social care crisis and promised more police officers and better infrastructure. Can he deliver on all that?\n\nAnd, more pertinently, will Mr Johnson manage to succeed when it comes to Brexit by Halloween?\n\nWe discuss all this and what other tricks may he have up his sleeve to help your finances?\n\nMeanwhile, we reveal why you may want to think twice before logging into public wifi at coffee shops and hotels.\n\nAnd there are top tips on how you can fight the financial fear of the school holidays.\n\nAnd we also discuss why going for a classic car maybe a better investment when it comes to convertibles and celebrate the mundane vehicles that used to be a common sight on our roads, but no longer are.", "description": "Out go Theresa May and Philip Hammond, in come Boris Johnson and Sajid Javid - will it result in your finances falling out of top gear, or going on a grand tour?", "authors": ["This Is Money", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/07/26/15/16539062-0-image-a-4_1564150682474.jpg", "published_at": "2019-07-26"}