{"pub": "afr", "url": "https://afr.com/policy/economy/jobless-rate-dips-to-5-2pc-20191017-p531i6", "downloaded_at": "2019-10-17 01:49:40.136638+00:00", "title": "Jobless rate dips to 5.2pc", "language": "en", "text": "The Reserve Bank has repeatedly said that it is \"reasonable to expect that an extended period of low interest rates would be required in Australia to reach full employment.\"\n\nThe central bank regards the full employment rate as being 4.5 per cent.\n\nThe all-important NAB Business survey employment index, which the Reserve Bank monitors closely, edged up in September and is now above average.\n\nBased on historical relationships, that survey suggests employment will rise about 18,000 jobs per month over the next six months – more than the survey suggested last month when it forecast growth of 16,000 more jobs a month.\n\nReserve Bank deputy governor Guy Debelle said on Thursday that despite an expected further decline in dwelling investment some job losses could be avoided.\n\n\"Some large developers tell us that they are prepared to retain their employees through the coming trough in activity,\" Dr Debelle said.\n\n\"That said, the outlook for smaller contractors, which are quite prevalent in the housing sector, is not so great in the period ahead.\"\n\nOne of the big issues the Reserve Bank is grappling with, is whether those that have been employed in the housing sector will be able to find new work in the broader construction industry as states ramp up their infrastructure spending.\n\nDr Debelle was asked on Thursday whether a ‘chippie installing kitchens’ is going to be hired on a complex infrastructure project.\n\nHe said there had been a “decent amount” of workers that have been able to transfer out of residential construction but it depends on the skill set and not all of them are completely transferable.", "description": "The unemployment rate has decreased to 5.2 per cent in September from 5.3 per cent in August despite only 14,700 new jobs created last month – slightly below the number economists were expecting.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.1898%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/f3228e157cc1dc2958e7d096ceb8be04bcd36a13", "published_at": "2019-10-17"}