{"pub": "dailymail", "url": "https://dailymail.co.uk/debate/article-7590133/PETER-OBORNE-vital-British-patriots-prevail-today.html", "downloaded_at": "2019-10-19 11:48:22.373129+00:00", "title": "PETER OBORNE: It's vital that British patriots prevail today", "language": "en", "text": "Not long ago, Boris Johnson compared Brexit to the eternal torment of Greek god Prometheus having his liver pecked out by an eagle.\n\nToday, that torment could be over.\n\nRegardless whether Johnson prevails in the Commons this afternoon, there is no doubt about the magnitude of his achievement.\n\nAlmost all commentators said that this week’s deal with Brussels would never happen.\n\nWhat MPs decide between now and October 31 will shape the history of this country not for decades but centuries to come. Boris Johnson is pictured with EU leaders at a summit in Brussels\n\nEven key players such as Irish prime minister Leo Varadkar and chief EU negotiator Michel Barnier said it was near impossible.\n\nYet our Prime Minister pulled it off with a verve, charm and enthusiasm which won over his fellow European leaders.\n\nA charm, it should be said, which contrasted with the well-meaning but ultimately stumbling performance over Brexit of his predecessor Theresa May.\n\nI have long said that I believe Mr Johnson is the most gifted politician of our generation.\n\nRegardless whether Johnson prevails in the Commons this afternoon, there is no doubt about the magnitude of his achievement. Almost all commentators said that this week’s deal with Brussels would never happen\n\nHe has displayed an awesome ability to solve political problems that lesser men and women found intractable. Only he could have pulled off the deal.\n\nAnd in doing so he has baffled and bamboozled his political opponents with audacity and skill. Just look at how they trail in his wake.\n\nAs recently as the spring, Nigel Farage looked capable of destroying the Tory Party.\n\nIn the European elections, his Brexit Party condemned the Conservatives to their worst result at the ballot box for nearly 200 years. It polled 31 per cent, leaving the Tories in fifth place on just nine per cent.\n\nPredictably, Farage claims that Johnson’s deal is a sell-out. He’s not all wrong as, in some ways, it is. But the truth is that Johnson has shot Farage’s fox.\n\nFor all our faults, I believe that the UK has been a force for good ever since all our nations came together in 1801. The four nations which comprise this great country are richer and stronger united\n\nOnce Brexit has happened on Johnson’s terms, Farage can protest as much as he likes but as a catalyst, and no more, for Brexit, his influence has gone. If he’s wise, Johnson should offer Farage the place in the Lords he undoubtedly deserves.\n\nAnd what about the hapless Labour leader Jeremy Corbyn?\n\nMost adroitly, Johnson has placed him in an impossible dilemma. Corbyn cannot bring himself to support the Government.\n\nYet if he wrecks the Johnson deal, Labour risks being seen as the party that defied the wishes of the British people and could be out of power for a generation.\n\nOn a third front, Boris Johnson also appears to have reunited the Conservative Party.\n\nWhen 21 Tory MPs were brutally stripped of the whip after voting against the Government two months ago because they refused to countenance a No Deal Brexit, it looked like the worst split in the party since the divisions that tore it apart over the Corn Laws in 1846.\n\nI have long said that I believe Mr Johnson is the most gifted politician of our generation. He has displayed an awesome ability to solve political problems that lesser men and women found intractable. Only he could have pulled off the deal\n\nMost of the 21 look like voting with Johnson today. They will be welcomed back into the fold with open arms. They would be accommodated, too, without alienating the hardline No Deal ‘Spartans’ who brought down Mrs May.\n\nBoris Johnson has achieved all this in just eight weeks.\n\nYet in doing so, does he risk paying a huge price?The truth is that I worry deeply about the law of unintended consequences. I am fearful that the price of this Brexit deal could be the break-up of the United Kingdom.\n\nThere is no escaping the fact that the integrity of the Union is in peril by putting a customs and regulatory border down the Irish Sea and separating Northern Ireland from the rest of the UK.\n\nOn the plus side, this would remove any need for customs posts, which it is widely believed would become targets for the men of violence who have, in the main, disappeared since the Good Friday Agreement was signed 20 years ago.\n\nBut the downside is very troubling. A border in the Irish Sea cuts off Northern Ireland economically from Great Britain. It places the North under EU regulatory control.\n\nOnce Brexit has happened on Johnson’s terms, Farage can protest as much as he likes but as a catalyst, and no more, for Brexit, his influence has gone. If he’s wise, Johnson should offer Farage the place in the Lords he undoubtedly deserves\n\nThis is why this plan has horrified Ulster’s Unionists, who feel betrayed. Although one of the architects of the Irish peace process, Lord Trimble, hailed Johnson’s agreement as a ‘great step forward’ and urged Democratic Unionist Party (DUP) MPs to vote for it.\n\nLast year, Johnson himself addressed the DUP’s annual conference and explicitly said he was against having a sea border because of the potential damage to the Union.\n\nHe said it would ‘leave Northern Ireland behind as an economic semi-colony of the EU’ and would damage the fabric of the Union.\n\nWith typical fervour, he stressed: ‘No British Conservative government could or should sign up to any such arrangement.’\n\nAnd yet, this week, Johnson has done exactly what he promised he would never do.\n\nSome of the PM’s admirers praise him for this cold-blooded ruthlessness on the grounds that such a sacrifice is essential to get Brexit ‘over the line’.\n\nLet’s hope and pray that this characteristically Johnsonian risk doesn’t backfire. But this is not the only downside.\n\nNicola Sturgeon and her Scottish National Party colleagues are watching events like hawks.\n\nQuite understandably, they are asking why Scotland can’t have the same favoured economic deal with the EU as would be enjoyed by Northern Ireland — especially as 62 per cent of Scots voted Remain.\n\nA strong feeling of pique will increase and momentum towards a second Scottish independence referendum will grow.\n\nTheresa May, a passionate unionist, understood all this and the risks involved. She often pointedly reminded audiences that she was ‘leader of the Conservative and Unionist Party’.\n\nThis explains why she vehemently opposed the creation of a customs border in the Irish Sea.\n\nOf course, there are some Tories who think such a risk is worth it. Indeed, an opinion poll in the summer found that almost two-thirds of Tory Party members would be willing to allow Scotland to leave the UK — and 59 per cent would rather Northern Ireland split away, than Brexit did not happen.\n\nAs a diehard Unionist, I find those figures profoundly unsettling. For all our faults, I believe that the UK has been a force for good ever since all our nations came together in 1801.\n\nThe four nations which comprise this great country are richer and stronger united.\n\nYes, life would go on if the Union was fractured, but we would be gravely diminished. Brexit apart, this is why today’s Commons vote is so very, very important.\n\nWhat MPs decide between now and October 31 will shape the history of this country not for decades but centuries to come.\n\nThat’s why all 650 MPs who are entitled to vote this afternoon need to forget about personal and selfish interests and vote for patriotic reasons.\n\nFundamentally, though, the fact cannot be ignored that 17.4 million people voted for Britain to leave the European Union. That’s not to doubt the patriotism of those who voted Remain.\n\nThis is not a moment — Jeremy Corbyn, please note — to extract short-term or narrow political advantage.\n\nNothing less than the destiny of the United Kingdom is at stake.\n\nTheresa May, a passionate unionist, understood all this and the risks involved. She often pointedly reminded audiences that she was ‘leader of the Conservative and Unionist Party’. This explains why she vehemently opposed the creation of a customs border in the Irish Sea\n\nHeart-warming legacy of Diana\n\nFive years ago my family travelled to the Hindu Kush mountain range in northern Pakistan to meet the ancient Kalash tribal people.\n\nWe received the same warm welcome as William and Kate did this week and we also met a young woman called Diana, named after the late Princess of Wales.\n\nHow heart-warming to learn from the Mail’s report of the royal visit that Diana now has her own son called William.\n\nSome of the royals have been criticised — justly and unjustly — over recent months. But William and Kate spread joy wherever they went.\n\nTheir trip to Pakistan was a reminder that our Royal Family does far more good to Britain’s reputation abroad than any number of visits by publicity hungry politicians.", "description": "PETER OBORNE: Boris Johnson has displayed an awesome ability to solve political problems that lesser men and women found intractable. Only he could have pulled off the deal.", "authors": ["Peter Oborne For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/00/19906820-0-image-a-36_1571440910586.jpg", "published_at": "2019-10-18"}