{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/stocks/let-s-make-a-mini-deal--15122880", "downloaded_at": "2019-10-11 00:54:54.496277+00:00", "title": "Let's Make a ... Mini-Deal?", "language": "en", "text": "The futures market traded erratically overnight Wednesday as various rumors about China trade negotiations circulated, but there have been no tweets or rumors since negotiations commenced at 10 a.m. ET on Thursday in Washington.\n\nSpeculation has been building that there is likely to be a mini-deal of some sort. President Donald Trump is scheduled to meet with the Vice Premier at the White House on Friday, so we should have some interesting movement when the news hits at that time.\n\nOverall, the market seems to have embraced the idea of a mini-deal and will probably be relieved just to have the tedious matter put aside for a little while. In some ways, it is a market-positive to always have the potential for more deals in the future, so incremental deal-making may not be a market negative.\n\nThe big question that the market will face Friday is whether we will have a \"sell the news\" reaction to the announcement of a China deal. If there is no deal, it is obvious that there will be a sell-off, but what will be the reaction to a mini-deal? No matter what happens, President Trump will likely spin it as positive and with most market players weary of this issue, there may be a celebration just because we won't have to hear about it again for a while.\n\nNo matter what happens on trade, the good news is that we will have a little higher level of certainty Friday, and that will make for a better trading environment.\n\nHave a good evening. I'll see you Friday.", "description": "The big question that the market will face Friday is whether we will have a 'sell the news' reaction to the announcement of China trade deal -- even a tiny one.", "authors": ["James", "Rev Shark", "Let'S Make A ... Mini-Deal", "The Big Question That The Market Will Face Friday Is Whether We Will Have A 'Sell The News' Reaction To The Announcement Of A China Trade Deal -- Even A Tiny One.", "Doug Kass", "Jim Cramer", "Bruce Kamich", "Bob Lang", "Helene Meisler", "Jim"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/7cfef3aa-765d-11e9-9035-ad9797fcaa7b.jpg", "published_at": "2019-10-10"}