{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7526273/Tennessee-mom-charged-child-abuse-Facebook-Live.html", "downloaded_at": "2019-10-05 08:29:54.151949+00:00", "title": "Tennessee mom is charged with child abuse after Facebook Live", "language": "en", "text": "The infant is now in the care of Sexton's mother\n\nTybresha Sexton was arrested Sunday in Chattanooga, Tennessee, and charged with aggravated child abuse\n\nA Tennessee mother has been charged after posting a Facebook Live video showing her smoking in the face of her one-month-old daughter and bench pressing her.\n\nTybresha Sexton was arrested Sunday at her home in Chattanooga after several people reported the video to police, showing the mother picking the child up and dropping her in the 30-minute Facebook Live video.\n\nThe disturbing video also showed Sexton lighting something she was smoking with one hand while holding the baby in the other.\n\nAccording to police documents, when officers arrive Sexton loudly told them she, 'didn't want that f***in' baby anyway,' and said she 'already told them that.'\n\nSexton has been charged with aggravated child abuse.\n\nSexton posted a Facebook Live showing her carelessly lifting her one-month-old daughter with one arm and dropping her while smoking with the other hand\n\nWhen police arrived she told them she 'didn't want that f***in' baby anyway'\n\nWhen police arrived at the Bayberry Apartments Sunday, Sexton reportedly told the officers the reports were not true and allowed a cop to check on the infant.\n\nThat officer said Sexton's breath wreaked of alcohol and said she was making irrational statements.\n\nReports also show there were several empty liquor bottles lying around.\n\nThe police report says several neighbors came to the apartment while officers were there and showed them the clip.\n\nThe video shows Sexton shaking the infant, picking her up by the arm and dropping her.\n\nThe disturbing video shows Sexton carelessly tossing the one month old down\n\nAn officer said Sexton's breath wreaked of alcohol and there were empty liquor bottles lying on the floor\n\nIt also shows her carelessly life the child with one hand while smoking with the other.\n\nIn addition to aggravated child abuse, Sexton was also charged with resisting arrest and disorderly conduct.\n\nOnce she was the police station, she reportedly continued to cause a disorder and announced again to the officers that she didn't want the baby.\n\nThe baby girl is now in the care of Sexton's mother.\n\nSexton is due in court on October 4.", "description": "Tybresha Sexton was arrested Sunday in Chattanooga, Tennessee, and charged with aggravated child abuse.", "authors": ["Kayla Brantley For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/01/20/19170516-0-image-a-35_1569958204452.jpg", "published_at": "2019-10-01"}