{"pub": "investing.com", "url": "https://uk.investing.com/news/economy/eyeing-elections-labour-plan-care-spending-boost-1967422", "downloaded_at": "2019-09-22 23:16:25.557252+00:00", "title": "Eyeing elections, Labour plan care spending boost", "language": "en", "text": "By William James\n\nBRIGHTON, England (Reuters) - Britain's opposition Labour Party will on Monday set out a 6 billion pound per year plan to help look after elderly people, as it pitches its economic agenda for a socialist-run country at the party's annual conference.\n\nLabour is hoping to use the Brexit chaos engulfing Prime Minister Boris Johnson's Conservative government to win control of Britain's $2.8 trillion economy at an early election expected to be called later this year.\n\nPresenting himself as Britain's finance minister in waiting, veteran left-winger John McDonnell will set out a series of policies to reshape the pro-business, free-market orthodoxy that has guided the British economy for decades.\n\nExtracts of the speech released late on Sunday highlighted a pledge to pump billions into the country's social care system, aimed primarily at providing the elderly with free assistance for basic tasks like cooking meals and bathing.\n\n\"Nothing is more important than dignity in retirement for those who have built our country and given younger generations the world we live in today,\" McDonnell will say.\n\nThe 68 year-old, once considered on the extremes of Britain's political spectrum after a lifetime spent campaigning to tear up the capitalist system, is now seen by investors as a possible custodian of the world's fifth largest economy.\n\nThe care policy is estimated to cost 6 billion pounds in 2020/21, rising to 8 billion pounds per year by 2030/31.\n\nThe party did not explicitly set out how this would be funded, but pointed to its manifesto at the last election which set out tax rises to pay for more funding for the wider social care system.\n\nMcDonnell has already backed new taxes on Britain's financial services sector, and, in the 2017 election campaign, said he would raise income taxes on the highest earners.\n\n\"We're going to re-shape the economy,\" McDonnell told an anti-austerity rally in Brighton on Sunday on the eve of his speech, promising to have a budget and legislative agenda ready if Labour wins power.\n\n\"I think this must be the important one (election) that we'll face in generations. Both in terms of how we overturn all the austerity measures of the last nine years, and also in terms of how we take control of our economy.\"\n\nThe Labour party's plans for widespread nationalisation, higher public spending, higher taxes and forcing large corporations to give workers shares, have provoked deep concern among investors and business lobby groups.\n\nBut, with Johnson fighting a battle to keep his divided party together over Brexit and huge uncertainty over how and when Britain will leave the EU - if it ever does - the result of a national election is hard to predict.\n\nThe personal care policy strikes at a raw nerve for Britain's ageing population - a demographic that votes in high numbers and has the power to swing election outcomes.\n\nIn the 2017 election a Conservative policy that was seen as unfairly penalising dementia sufferers prompted a dramatic decline in the party's poll rating and is cited as a major factor behind a disastrous result for then-prime minister Theresa May.", "description": "Eyeing elections, Labour plan care spending boost", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8L0V7_L.jpg", "published_at": "2019-09-22"}