{"pub": "rt", "url": "https://rt.com/sport/472034-southampton-players-donate-wages-charity-leicester-defeat", "downloaded_at": "2019-10-28 13:32:51.351452+00:00", "title": "‘The game was a sh*tshow, but fair play’: Southampton players donate wages to charity after 9-0 humiliation against Leicester", "language": "en", "text": "Southampton players will donate one day's wages to charity following their disastrous 9-0 home defeat to Leicester City on Friday in an effort to make amends to their supporters after the embarrassing scoreline.\n\nSouthampton gave up the biggest Premier League margin of victory in 24 years in the home defeat to Leicester in which both Jamie Vardy and Ayoze Perez claimed hat-tricks against the relegation-threatened club.\n\nCoach Ralph Hasenhuttl branded the performance a \"disaster\" in the aftermath of the game but the club, apparently not satisfied with their manner of their own apology, went a step further in announcing that both players and staff will donate some of their wages towards a good cause.\n\n\"The group has decided that they wish to donate their wages from the day of the Leicester game to Saints Foundation, in order to help the vital work that is conducted by the charity,\" a statement which appears on the club's official website reads.\n\n#SaintsFC’s first-team players and coaching staff have decided to donate their wages from last Friday to @SFC_Foundation: https://t.co/EMVlHTrjr6 — Southampton FC (@SouthamptonFC) October 27, 2019\n\nSaints Foundation is the official charity associated with Southampton whose goal is to raise funds to help \"children, young people, and adults at risk across Southampton and surrounding areas.\" To date more than £2 million ($2.6 million) has been fundraised to help people in the local community.\n\nNeeding some #MondayMotivation?\n\n\n\nWhy not watch all 9⃣ goals from Friday again? 🤤 pic.twitter.com/77XhCLsdQQ — Leicester City (@LCFC) October 28, 2019\n\nWhile some supporters will no doubt put the case forward that this money might be best spent in consolidating and improving the playing squad, most will be satisfied that at least some good has come from their astonishing defeat.\n\nFair play to the lads. The game itself was a shitshow, but they really didn't have to do this. 👏 — Southampton Page (@SouthamptonPage) October 27, 2019\n\nDonating goals to opposition as well as money to charity, respectable 🤝 — Rob (@rjcSFC) October 27, 2019\n\nThe result of Friday's game was the biggest defeat suffered by an English top flight club since Andy Cole scored five times as Manchester United beat Ipswich Town at Old Trafford in 1995. Interestingly, Peter Schmeichel was in goal for Manchester United that day while his son Kasper was between the sticks for Leicester during their win.", "description": "Southampton players will donate one day's wages to charity following their disastrous 9-0 home defeat to Leicester City on Friday in an effort to make amends to their supporters after the embarrassing scoreline.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5db6e5b285f540334c2819ba.jpg", "published_at": "2019-10-28"}