{"pub": "yahoo", "url": "https://news.yahoo.com/harry-dunn-mother-us-diplomat-wife-crash-114941750.html", "downloaded_at": "2019-10-13 18:49:52.813845+00:00", "title": "Mother of Harry Dunn says 'sorry doesn't cut it' ahead of meeting with US diplomat's wife", "language": "en", "text": "The mother of Harry Dunn, Charlotte Charles, speaks to the media after meeting with Foreign Secretary Dominic Raab this week. (Getty)\n\nHarry Dunn’s mother has said “sorry doesn’t cut it” ahead of a meeting with the woman involved in a car crash which killed her son.\n\nCharlotte Charles and Tim Dunn are set to travel to the US to meet with Anne Sacoolas, the wife of an American diplomat, who has been at the centre of a scandal surrounding the teenager’s death.\n\nMs Sacolas said she wants to meet the couple to \"express her deepest sympathies and apologies\" after she crashed into the 19-year-old’s motorbike outside RAF Croughton on 27 August.\n\nBut Ms Charles told Sky News on Sunday that her apology “won’t be quite enough”.\n\nCharlotte Charles with her son Harry Dunn who died after his motorbike collided with a car near RAF Croughton in Northamptonshire on August 27. (PA) More\n\n\"My opinion on Anne Sacoolas now wanting to come forward and say sorry - to be perfectly honest, yes it's the start of some closure for our family,” Ms Charles said.\n\n\"Having said that, as it's nearly seven weeks now since we lost our boy, sorry just doesn't cut it.\n\n\"That's not really quite enough. But I'm still really open to meeting her, as are the rest of us. I can't promise what I would or wouldn't say, but I certainly wouldn't be aggressive.\"\n\nREAD MORE FROM YAHOO NEWS UK:\n\n\"Hopefully we'll get the answers we are seeking,\" She added.\n\nEarlier on Sunday the family said the Foreign and Commonwealth Office (FCO) has written to them to say a US suspect in the case does not have diplomatic immunity.\n\nThe family’s spokesman Radd Seiger said the Foreign Secretary Dominic Raab has written to Mr Dunn’s family about Mrs Sacoolas, saying: “The US have now informed us that they too consider that immunity is no longer pertinent.”\n\nThe letter, sent by Dominic Raab to the family, said: “We have pressed strongly for a waiver of immunity, so that justice can be done… Whilst the US government has steadfastly declined to give that waiver, that is not the end of the matter.\n\n“We have looked at this very carefully… the UK Government’s position is that immunity, and therefore any question of waiver, is no longer relevant in Mrs Sacoolas’ case, because she has returned home.”\n\nMr Raab added that the matter was now “in the hands” of Northamptonshire Police and the CPS.\n\nMeanwhile, Mrs Sacoolas’s legal representative Amy Jeffress, from the law firm Arnold and Porter, said: “Anne is devastated by this tragic accident.\n\n“No loss compares to the death of a child and Anne extends her deepest sympathy to Harry Dunn’s family.”\n\nMr Seiger said in a statement that he had spoken with Ms Jeffress and the pair had agreed “to get together asap… to discuss how we are going to achieve a solution”.\n\nHe added that he was studying the FCO letter “with legal and political experts” to “fully understand where that leaves us”.", "description": "Charlotte Charles and Tim Dunn will meet Anne Sacolas early next week in an attempt to \"get some closure for their family\".", "authors": ["George Martin"], "top_image": "https://s.yimg.com/uu/api/res/1.2/QqW87q5tQfuOKJm8mYOVmw--~B/aD0zMjgwO3c9NDkyODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/35f04bf0-ed83-11e9-a7f5-bb9ddb9fb530", "published_at": "2019-10-13"}