{"pub": "investing.com", "url": "https://in.investing.com/analysis/lower-high-completed-in-nifty--banknifty-200432302", "downloaded_at": "2019-10-07 04:10:39.272361+00:00", "title": "Lower High Completed In Nifty / BankNifty", "language": "en", "text": "Two weeks back, no one was ready to work for the long side and both indexes were trading in a range. On Finance Minister’s rate cut announcement, the market has given a big spike and closed around day high. On 19th September 2019 has given Breakdown and the next day it has given Breakout, only because of rate cut news. On this Friday RBI has reduced repo rate by 0.25% and this rate cut market has taken negatively.\n\nTechnical Overview of : In the below daily chart, we can see a breakout to Triple Top on the news day. The next day Nifty has opened the gap up and tried to cross its next resistance i.e. 11650 but not succeeded. The closing was below resistance and chart pattern was Spinning Top that was the first signal of Bears. In that whole week, Nifty has maintained the same levels and on the weekly chart, it has made the Star Doji. In last week index price has fallen too fast and tried to take the support of 200 DMA. However, on the last trading day, the price has broken 200 DMA and closed below. If we see a weekly chart then Evening Star has been created on the chart. Now again overall sentiments are negative for the short to medium term.\n\nImmediate support around 11100 and our view is sell on every rise or bounce. Looking targets of the coming days are 11100-10900.\n\nTechnical Overview of NiftyBank: The next day of announcement, Bank Nifty has also opened the gap up and closed above its next resistance. As per the chart analysis, many banking stocks has given breakout to their resistance. However, another large-cap stocks did not stop its down trend and breakout did not worked. Bank Nifty has broken down its support before 2 trading days and closed below 200 DMA. We can say that the banking stocks are lead to a market for both sides. On a weekly chart, Evening Star has been created and currently closed near the next support i.e. 27600.\n\nAs per our view, it is looking like sell on every rise with chart confirmation and looking target of 26600.\n\nORIGINAL POST\n\n----------------------------------------------------------------------------------------------------------------\n\nDisclaimer: The contents produced here are purely for educational purpose. They should not be construed as buy/sell recommendations. I am not a SEBI registered Analyst or Investment Advisor. Readers are advised to consult their Investment advisor before taking any decisions based on the above write-up.\n\n----------------------------------------------------------------------------------------------------------------", "description": "Market Overview Analysis by Sagar Rajput covering: Nifty 50. Read Sagar Rajput's latest article on Investing.com India.", "authors": [], "top_image": "https://in.investing.com/analysis/not found", "published_at": "2019-10-07"}