{"pub": "telegraph", "url": "https://telegraph.co.uk/art/reviews/frieze-london-review-regents-park-fine-art-hobnobbing-showing", "downloaded_at": "2019-10-05 13:36:51.885302+00:00", "title": "Frieze London review, Regent's Park: the fine art of hobnobbing and showing off", "language": "en", "text": "It can be tiring traipsing around the annual Frieze London art fair in Regent’s Park – which is why, when you pass Tokyo gallery Taro Nasu’s booth, you may find yourself drawn to a black vending machine.\n\nIf you’re after refreshment, though, prepare for disappointment – because this automated device is an installation by British conceptual artist Ryan Gander, dispensing random artworks, at £500 a pop, instead of fizzy drinks.\n\nFlash your credit card for this high-rolling game of lucky dip, and you could win a tiny “sculpture” embellished with a diamond.\n\nMore likely, though, the machine will spit out a black resin cast of a Casio wristwatch wrapped around a rock.\n\nOther “prizes” include, in the words of an attendant, “natural stones” – which I think means, simply, “stones”.\n\nGander had wanted each artwork to cost £1,000. In the run-up to the fair, though, it turned out that the machine’s limit was much lower, so he settled on half that sum. A bargain, you might think. Still, when I visited, late on the fair’s opening day, only one person had opened their wallet – and their card was rejected.\n\nThis is the thing about Frieze: if you’re going to buy, you need a generous credit limit.", "description": "It can be tiring traipsing around the annual Frieze London art fair in Regent’s Park – which is why, when you pass Tokyo gallery Taro Nasu’s booth, you may find yourself drawn to a black vending machine.", "authors": ["Alastair Sooke", "Chief Art Critic"], "top_image": "https://www.telegraph.co.uk/content/dam/art/2019/10/03/TELEMMGLPICT000211753810-xlarge_trans_NvBQzQNjv4BqXLf5rZYUXGKwZgSx01hvqM6T_jUvnMCoL5ZYVvOIg50.jpeg?imwidth=1200", "published_at": "2019-10-03"}