{"pub": "news24", "url": "https://food24.com/News-and-Guides/Features/kitchen-confidence-how-to-cook-for-a-big-crowd-and-pull-it-off-like-a-ninja-20190412", "downloaded_at": "2019-10-09 07:13:38.876753+00:00", "title": "Kitchen confidence: How to cook for a big crowd and pull it off like a ninja", "language": "en", "text": "Kitchen confidence: How to cook for a big crowd and pull it off like a ninja Having family or friends over for Easter? Keep these tips in mind and be ready to blow them away! by: Jess Spiro | 12 Apr 2019\n\n\n\n\n\nThere is likely a lengthy list of things people would choose to do than cook for a large group of people. Unless you have that Jewish grandmother-esque sensibility (who else do we know that whips a 3-course meal for 10+ people EVERY FRIDAY NIGHT?), cooking for more than 3 people can be nerve-wracking. But, it doesn’t have to be. There are certain things you can do (and shouldn’t do) to set yourself up for crowd-cooking success.\n\n\n\nThink bigger (cut) picture\n\nLet’s get one thing straight: now is not the time to be faffing with individual portions of anything. So you make a mean steak for 2? That doesn’t mean it won’t cause you immense, unnecessary stress cooking for 12.\n\nInstead, make friends with your butcher (which you’ve ideally done long before reading this article) and pick out something you can slow cook. The reason slow cooking is a winning approach is that you a) you have the option of cooking the main component of your meal way in advance and b) you don’t need to fiddling around with internal temperatures or worrying if something is cooked. These more braise-friendly cuts also tended to be cheaper, so you won’t bankrupt yourself by buying fillet for everyone and then worrying about if it’s overdone. Generally, something tender and meltingly soft is the sign it’s ready.\n\nIn a dream dinner party set up, you’ll pop your protein (be it beef, lamb, chicken or fish) into the oven at a medium-ish heat and forget about it for a little bit while you get on with something else.\n\nOutsource\n\nI’d like to think you’re inviting over reasonable humans who will inevitably ask ‘what can I bring?’ and this is where you act strategically. If your guests are culinarily-inclined, ask them to bring a course, such as a simple soup or a side salad. If they’re not, ask them to bring something specific that takes one thing off of your list – like crackers and preserves for a cheese platter or ice cream and toppings for dessert.\n\nDo-it-your-damn-self\n\nYour friends love you and don’t want you to freak out, so capitalise on this by having some kind of DIY element. Put out a big-batch cocktail for them to help themselves to, or a spritz station so that you don’t have to keep an eye on empty glasses. Similarly, skip the first course and set out bowls of dips, pâté and seasoned ricotta cheese, crudites and crackers, so that you know no one is starving and you can focus on finishing mains.\n\nPlan your menu cleverly\n\nAssuming you’re following my ‘stick something in the oven’ advice, cement your success by planning the rest of your meal around the available cooking space. Make sure the stove top isn’t being completely overcrowded with pots, but equally make sure you’re not jamming too many things into the oven to roast. Think of dishes that incorporate sauteed or steamed elements, or even raw ones – a clear counter top encourages a clear mind. Also, think of what can be done in advance – for example, most braises can be cooked the day before and reheated to serve, and salad dressings and dips can be thrown together and stored in the fridge.\n\nKeep it simple\n\nProbably the most important piece of advice is this one – keep it simple. These are your loved ones, who won’t judge you for not serving something complicated and fiddly – we have many, many restaurants who do this so we don’t have to. Generally, the formula of a braise (or a slow roast chicken), with a starchy side (such as roasted potatoes, or polenta), sauteed veggies and a punchy salad are all you need. You don’t need 3-courses, and you certainly don’t need 7 different elements on a plate.\n\nOff you go and conquer!\n\nALSO READ: Tips on how much booze to buy for a party\n\nRead more on: features | cooking tips", "description": "Having family or friends over for Easter? Keep these tips in mind and be ready to blow them away!", "authors": ["Jess Spiro"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8616/d5727e2526c5412a8da44eec1ee98ed6.png", "published_at": "2019-04-12"}