{"pub": "breitbart", "url": "https://breitbart.com/news/the-latest-putin-says-others-should-respect-syrias-borders", "downloaded_at": "2019-10-13 12:21:07.496218+00:00", "title": "The Latest: Putin says others should respect Syria’s borders", "language": "en", "text": "BEIRUT (AP) — The Latest on Turkey’s offensive in Syria (all times local):\n\n2:35 p.m.\n\nRussia’s president says all foreign troops should leave Syria unless the Syrian government asks them to stay.\n\nVladimir Putin said in an interview with three Arabic television stations that was released Sunday that “all foreign nations” should withdraw their troops unless they have been asked by the Syrian government to stay there.\n\nHe said that Russia, which has a significant military presence there as well as an air and a naval bases, would also leave if President Bashar Assad asks it to.\n\nPutin, a staunch backer of Assad, stopped short of condemning Turkey for sending its troops across the border into northeastern Syria earlier this week, but said that other nations should respect Syria’s sovereignty and territorial integrity.\n\n___\n\n2:20 p.m.\n\nA U.S. official says the situation in northeast Syria is “deteriorating rapidly” as Turkey-backed forces advance and could isolate American forces on the ground.\n\nThe official said Sunday the development is quickly increasing the risk of a confrontation between Turkey-backed and U.S. forces in the area. The official spoke to The Associated Press on condition of anonymity because they were not authorized to brief reporters.\n\nPresident Donald Trump has said U.S. troops in northern Syria would pull back ahead of a Turkish offensive, now in its fifth day, to take the force out of harm’s way.\n\nSince Saturday, Turkey-backed fighters have moved with Turkish airstrikes toward the town of Ain Eissa, an administrative town for the Kurdish-led forces and where a major U.S. base is located.\n\nThe official said U.S. forces and their Kurdish allies no longer control ground lines of communication and have no control over Turkish aircraft overhead.\n\n— By Sarah El Deeb\n\n___\n\n1:40 p.m.\n\nPope Francis has appealed for a new effort at dialogue after U.S. forces pulled back from northeastern Syria, clearing the way for Turkey’s offensive against Syrian Kurds there.\n\nFrancis said civilians including Christian families “had been forced to abandon their homes as a result of military action.”\n\nSpeaking Sunday at the end of a Mass, Francis urged the international community to work with “sincerity, honesty and transparency” toward finding “efficient solutions.”\n\nPresident Donald Trump drew broad criticism from his evangelical Christian base for removing U.S. forces from northeastern Syria. Critics say he has risked the lives of Syrian Kurdish allies who helped bring down the Islamic State group in Syria.\n\nTrump defends the move as fulfilling a campaign promise to bring home U.S. troops.\n\n___\n\n1:15 p.m.\n\nSyrian Kurdish officials say more than 700 Islamic State supporters have escaped from a camp for displaced people in northeastern Syria as Turkish forces advance on the area.\n\nThe Kurdish-led administration said detainees attacked Ain Eissa camp’s gates and fled Sunday amid intense fighting nearby and Turkish airstrikes.\n\nThe camp is home to some 12,000 people, including nearly 1,000 foreign women with links to IS and their children.\n\nThe town of Ain Eissa, some 35 kilometers (20 miles) south of the border, is also home to one of the largest U.S.-led coalition bases in northeastern Syria.\n\nThe Kurdish forces, who partnered with the U.S. in the fight against IS, say they may not be able to maintain detention facilities holding thousands of militants as they struggle to stem the Turkish advance.\n\n___\n\n12:45 p.m.\n\nThe United Nations says at least 130,000 people have been displaced by the fighting in northeastern Syria with many more likely on the move as a Turkish offensive in the area enters its fifth day.\n\nMeanwhile, the local Kurdish-led administration warned Sunday of a “humanitarian disaster” as aid and service delivery to northern Syria is hampered by the fighting. The fighting has reached the main highway that runs between Hassakeh, a major town and logistical hub, and Ain Eissa, the administrative center of the Kurdish-led areas.\n\nThe UN said its technical teams have not been able to access a water pumping station in Hassakeh town damaged from shelling, leaving 400,000 people, including 82,000 residents of displaced camps affected by the suspension of water.\n\nAirstrikes, artillery shells and intense clashes have reached as far as 30 kilometers (19 miles) south of the Turkish-Syrian border.\n\n___\n\n12:05 p.m.\n\nSyrian Kurdish officials say Islamic-State supporters have escaped from a camp for displaced people in northeastern Syria after shells landed nearby.\n\nTurkish forces have been advancing toward the town of Ain Eissa, some 35 kilometers (20 miles) south of the border, as part of their offensive against Kurdish-led forces. The town is home to a camp housing some 12,000 people, including nearly 1,000 foreign women with links to IS and their children. The administrative hub is also home to a U.S.-led coalition base.\n\nThe Britain-based Syrian Observatory for Human Rights says Turkish warplanes struck villages near Ain Eissa camp on Sunday. It says some camp residents fled as intense clashes broke out between Turkey-backed Syrian fighters and Kurdish forces.\n\nIt was not immediately clear how many camp residents escaped. The Kurdish forces, who partnered with the U.S. to capture vast areas of eastern Syria from IS, say they may not be able to maintain detention facilities holding thousands of militants as they struggle to stem the Turkish advance.\n\n___\n\n11:15 a.m.\n\nTurkey’s official news agency says allied Syrian forces have captured the town Suluk in the fifth day of the Turkish offensive in northeast Syria.\n\nAnadolu news agency said Sunday the town’s center — located at a strategic crossroads about 10 km south of the border — was cleared of Syrian Kurdish People’s Protection Units, or YPG.\n\nTurkey considers the group a threat for links to a decades-long Kurdish insurgency at home.\n\nA Kurdish official on condition of anonymity said the clashes in Suluk were ongoing.\n\nTurkey’s Defense Ministry tweeted 480 YPG fighters were “neutralized” since Wednesday. The number couldn’t be independently verified.\n\nSeveral shells fired from Syria hit the Turkish border towns Akcakale and Suruc in Sanliurfa province. Anadolu news agency said one person was wounded Sunday in Suruc.", "description": "BEIRUT (AP) — The Latest on Turkey's offensive in Syria (all times local): 2:35 p.m. Russia's president says all foreign troops should leave Syria unless", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/13/57f25c_syria-32364-in-saturday-oct-12-2019-photo-turkey-backed-syrian-fighters-640x335.jpg", "published_at": "2019-10-13"}