{"pub": "investingcom", "url": "https://investing.com/news/economy/years-of-forex-market-calm-sends-currency-funds-to-the-wall-1972254", "downloaded_at": "2019-09-08 12:11:03.879375+00:00", "title": "Years of forex market calm sends currency funds to the wall", "language": "en", "text": "By Olga Cotaga\n\nLONDON (Reuters) - The Chinese yuan's tumble is stirring hopes of a long-awaited volatility boost for forex markets but any rise will be too late for the currency funds that have shut down this year, and it may be too small to hold out much hope for those that remain.\n\nCurrency traders who wring out more profits when prices move wildly consider themselves cursed by the prolonged calm in forex markets brought about by rock-bottom interest rates and central banks moving more or less in tandem on monetary policy.\n\nThe yuan's Aug. 12 plunge below 7-per-dollar lifted vol - shorthand for the implied volatility gauges embedded in currency options - to eight-month highs.\n\nBut the spike proved short-lived: A Deutsche Bank (DE: ) index of three-month implied volatility weighted across major currencies has slipped back to 7.52 after surging to 8.11 immediately after the yuan move.\n\n(Graphic: FX volatility link: https://fingfx.thomsonreuters.com/gfx/mkt/12/5599/5549/FX%20volatility.png)\n\n(Graphic: subdued FX link: https://fingfx.thomsonreuters.com/gfx/mkt/12/5600/5550/subdued%20FX.png)\n\nFor currency investment funds it was yet another episode of volatility gauges flickering to life briefly, then subsiding.\n\nSuch vehicles which focus on buying and selling currencies, FX futures and swaps, have seen money-making opportunities dwindle, and last year saw $2.34 billion flow out of FX mutual funds - the most since 2015.\n\nThe outflow has eased somewhat this year, with $159.08 million draining out from January to July, according to fund research firm Morningstar. But total net assets at currency mutual funds worldwide have fallen to $6.86 billion, having declined every year but one after peaking in 2012 at almost $18 billion.\n\nNow with vol on most major currencies bumping along near record lows, more fund managers may be tempted to throw in the towel.\n\n\"If the audience doesn't embrace it, eventually you have to pull that plug,\" said Axel Merk, CIO of Merk Investments, which this summer closed an absolute return currency fund aimed at retail punters. He described returns as \"fairly modest\".\n\nMerk's $6.7 million fund was one of the 10 currency mutual funds to shut this year, following 17 closures in 2018, Morningstar said.\n\nMerk, who has one other FX fund, said recent volatility increases meant this year was shaping up better than 2018, but he added: \"It's not like our phone is ringing off the hook\".\n\nHedge funds, which borrow and invest to juice up returns, have been hit hard, too: just 49 now actively trade currency futures and cash forwards in the interbank market, according to the BarclayHedge index. That's down from 145 in 2008 and 53 at the end of 2018.\n\n(Graphic: Currency hedge funds in decline png link: https://fingfx.thomsonreuters.com/gfx/editorcharts/CURRENCY-FUNDS-VOLATILITY/0H001QEV287Z/eikon.png)\n\nCurrency-specific hedge funds have earned returns of 2.38% this year, well below 7.56% returns at multi-strategy macro funds, data from Hedge Fund Research shows. Clearly those able to invest in different assets could generate higher profits than those restricted to currencies.\n\nSuch macro funds are increasingly retreating from currency trading, focusing on government bonds instead, people familiar with the sector say.\n\nIMPORTANCE OF VOL\n\nForex traders aim to profit from arbitraging between markets and betting how one currency might move against another; the mix of different expectations and positions can create unexpected price swings, sparking volatility.\n\nBut years of low or sub-zero interest rates, trillions of dollars in stimulus and perhaps most crucially, the almost total lack of policy divergence between the world's big central banks, has all but eliminated such opportunities.\n\nThis year for instance, as the Federal Reserve turned tail on policy tightening, forex markets were gripped by hopes of a vol turnaround. Those were dashed pretty much immediately as other central banks followed the Fed's cue. Volatility tumbled to almost five-year lows:\n\ntmsnrt.rs/2V7E5Iw\n\nAsset manager QTS Capital Management decided around that time to ditch spot forex trading via its flagship hedge fund, where assets had shrunk to $11 million, down from $20 million three years ago. It now trades currency futures.\n\n\"(Spot FX) strategy can only work when there are healthy interest rates,\" QTS portfolio manager Ernest Chan said.\n\nThe vol doldrums have claimed big names too, including two funds run by Franklin Templeton's high-profile manager Michael Hasenstab. The U.S.-listed Global Currency Fund closed to investors in June and is to be liquidated in October, while a sister fund listed in Luxembourg will shutter in September.\n\nThe funds, investing in assets offering long or short exposure to currencies, were closing because they were \"very small\", a Franklin Templeton spokesperson said.\n\nThe Luxembourg fund had assets of $8.78 million as of July 31, roughly the same as at inception three years ago, the spokesperson said, adding: \"We didn't see interest in it... We didn't see it grow.\"\n\nSimilarly, the U.S. fund had $32.83 million under management as of the end of July, down 11% this year and a staggering 88% versus five years ago, when it held $270.35 million, Morningstar data shows. Over the past five years it posted a 2.7% loss, the company website says.\n\nThe GAM Star Discretionary FX fund closed in February, having seen its total net assets slump to below $1 million versus more than $100 million two years ago, according to Morningstar.\n\nThe fund's timing was unfortunate: It opened in 2009, just as central banks embarked on a quantitative easing (QE) spree, printing money to boost economies battered by the 2008 crisis.\n\n\"Having a standalone currency fund wasn't working in a world of QE,\" said Adrian Owens, who managed the GAM fund.\n\nWhether currencies are eventually shocked out of their stupor is unclear, but many say a rebound is only a matter of time. Once, and if, volatility returns, investors waiting on the sidelines will likely get back into the game.\n\n\"I'm not expecting any real volatility spike, but it was so low for so long that the probability it increases is getting bigger,\" said Andreas Koenig, head of global FX at Amundi Asset Management.", "description": "Years of forex market calm sends currency funds to the wall", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXNPEF851AP_L.jpg", "published_at": "2019-09-06"}