{"pub": "cnbc", "url": "https://cnbc.com/select/the-best-credit-cards-for-building-credit", "downloaded_at": "2019-10-29 23:55:52.366225+00:00", "title": "The best credit cards for building credit of October 2019", "language": "en", "text": "If you lack a credit history or have poor credit, opening a credit card can be a smart way to build or rebuild credit — as long as you practice responsible financial behavior.\n\nWhile there are thousands of credit cards available, most require some sort of credit history in order to qualify. This can make it hard for people with less than stellar credit (typically, a credit score below 580), or no credit at all, to qualify for a card.\n\nSecured credit cards are one of your best chances at qualifying for credit. They're similar to traditional cards (they extend credit, charge interest and may offer rewards) but require you to make a deposit (typically $200) in order to access a credit limit. Whatever amount of money you deposit becomes your credit limit. If you want a higher credit limit, you'll need to deposit more money.\n\nYour security deposit acts as collateral if you fail to make payments. But don't worry about losing that money; your deposit is refundable if you pay your balance in full and close your account.\n\nIn addition to secured cards, there are some other credit card options for people with no credit or poor credit who don't want to — or are unable to — put down a deposit. While a credit card can be an easy way to build a strong credit history, you need to make sure you use it responsibly. After you open a credit card, make sure you spend within your means and pay your balance on time and in full.\n\nCNBC Select analyzed 27 credit cards that are marketed toward consumers with no or poor credit to determine the best cards for building or rebuilding your credit. We considered a number of factors, including security deposit minimums, fees, rewards programs and APR. (See our methodology for more information on how we choose the best cards.)\n\nHere are CNBC Select's picks for the top credit cards for building or rebuilding your credit:", "description": "We analyzed 27 credit cards that are marketed toward consumers with no or poor credit to determine the best cards for building or rebuilding your credit.", "authors": ["Alexandria White"], "top_image": "https://image.cnbcfm.com/api/v1/image/106207681-1572280227696gettyimages-946934542.jpg?v=1572280260", "published_at": "2019-10-29"}