{"pub": "axios", "url": "https://nytimes.com/interactive/2016/11/23/us/dakota-access-pipeline-protest-map.html", "downloaded_at": "2019-10-07 01:11:34.353854+00:00", "title": "The Conflicts Along 1,172 Miles of the Dakota Access Pipeline", "language": "en", "text": "The pipeline has to travel across hundreds of waterways. At least 22 of these crossings, highlighted in blue, have to be drilled deep under large bodies of water.\n\nThe pipeline crosses disputed Sioux land that was promised to the tribe in the 1851 Treaty of Fort Laramie but was later taken away.\n\nAn alternative route north of Bismarck, N.D., was proposed but rejected because of its proximity to areas that supply water.\n\nThere have been large protests at the Lake Oahe crossing over potential water contamination and the damage of sacred tribal sites. The Missouri River is the Standing Rock Sioux Tribe’s primary source of drinking water.\n\nThe crossing at the James River was rerouted to avoid three other bodies of water, which made the pipeline two miles longer.\n\nIn September, the Yankton Sioux Tribe filed a lawsuit against the Army Corps of Engineers, challenging the authorization of the pipeline construction.\n\nThe route near Sioux Falls, S.D., was initially rejected by the City Council because of its proximity to a landfill west of town.\n\nThe Iowa Utilities Board granted around 200 parcels of land, highlighted in yellow, for pipeline use under eminent domain. The owners of 17 parcels sued.\n\nIn early November, protesters set up an encampment to block construction near the Des Moines River crossing.\n\nAnother protest camp was set up near the Mississippi River crossing in late August and lasted until construction there was completed.", "description": "A detailed map showing the Dakota Access Pipeline, the site of months of clashes near the Standing Rock Sioux Reservation in North Dakota.", "authors": ["Gregor Aisch", "K.K. Rebecca Lai"], "top_image": "https://static01.nyt.com/images/2016/11/23/us/dakota-access-pipeline-1479877294784/dakota-access-pipeline-1479877294784-facebookJumbo.jpg", "published_at": "2016-11-23"}