{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7559605/France-look-beat-Iceland-Euro-2020-qualifier-without-Paul-Pogba-Kylian-Mbappe.html", "downloaded_at": "2019-10-10 19:07:37.046659+00:00", "title": "France look to beat Iceland in Euro 2020 qualifier without Paul Pogba and Kylian Mbappe", "language": "en", "text": "Didier Deschamps must cope without some of his big-name stars as France look to boost their Euro 2020 qualifying hopes with victory in Iceland on Friday night.\n\nFrance are without the injured Paul Pogba and Kylian Mbappe while captain Hugo Lloris is also ruled out for an unspecified period after dislocating his elbow in Tottenham's recent defeat to Brighton.\n\nMarseille goalkeeper Steve Mandanda will replace Lloris in the starting line-up as Deschamps' men search for the win which will take them into Monday's crucial clash with Group H rivals Turkey in good heart.\n\nFrance are without injured Paul Pogba and Kylian Mbappe while captain Hugo Lloris is out too\n\nDefender Raphael Varane acknowledged the importance of the two games and urged his team-mates to shrug off the unfortunate absence of Lloris in particular.\n\nVarane told the French Football Federation website: 'These are two very important games and playing in Iceland is never easy because it's a great opportunity for them.\n\n'Our captain will not be there and that will be a loss for us because he is a very important player.\n\nLloris reacts after sustaining an injury as Brighton and Hove Albion's Neal Maupay scored\n\n'But we have a lot of important players and we have to show good character in order to qualify for the finals. We need solid matches and we need to play at a good level.'\n\nIceland are also without their captain Aron Einar Gunnarsson due to injury and are desperate to bounce back from a disappointing 4-2 defeat in Albania in their last qualifying match last month.\n\nCoach Erik Hamren told a press conference: 'Playing against France will be a very interesting challenge and it will be very complicated, but we have nothing to lose.\n\n'Everyone expects France to win but miracles and surprises exist in football, so why not? Iceland might never have beaten France, but inevitably there must be a first time.'", "description": "France are without the injured Pogba and Kylian Mbappe while captain Hugo Lloris is also ruled out for an unspecified period after dislocating his elbow in Tottenham's recent defeat to Brighton.", "authors": ["Pa Sport Staff"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/17/19548392-0-image-a-59_1570723900451.jpg", "published_at": "2019-10-10"}