{"pub": "npr", "url": "https://npr.org/2019/10/03/766927027/lauren-groffs-literary-mission-recovering-a-lost-short-story-master", "downloaded_at": "2019-10-04 23:45:55.501420+00:00", "title": "Lauren Groff's Literary Mission: Recovering A Lost Short Story Master", "language": "en", "text": "Lauren Groff's Literary Mission: Recovering A Lost Short Story Master\n\nThe writer Lauren Groff — best known for her novel, Fates and Furies, and her collection of short stories, Florida -- wants you to know that she's on a rescue mission.\n\nThe object of her efforts is also a writer: Nancy Hale. And if you've never heard of her, that's precisely the point.\n\nPublished by Library of America and edited by Groff, Where the Light Falls: Selected Stories of Nancy Hale includes 25 of Hale's short stories and aims to reintroduce the once celebrated, now forgotten author to contemporary readers.\n\n\"She creates these lines that are full of humming electricity, and her structures are so deep and so thoughtful that you don't really understand what you're reading until maybe a couple of days later when you realize exactly the craft that went into creating [each] short story,\" Groff says.\n\nNancy Hale published her first short story in The New Yorker when she was 21 years old. From there, she became a regular contributor, publishing more than 80 stories in the magazine over the course of her life. In fact, she holds the record for the author with the most stories in the magazine in a single year: 12 of them, between July 1954 and July 1955.\n\nShe also put out seven novels and was a 10-time recipient of the O. Henry Prize for short fiction. Her writing is progressive and tackles issues such as infidelity, abortion, domestic abuse, motherhood, mental illness and female sexuality. \"They span the gamut,\" says Groff. \"There are some that are highly lyrical. Other ones are satirical and very funny.\"\n\nEnlarge this image toggle caption Nancy Hale Papers, Sophia Smith Collection, Smith College Nancy Hale Papers, Sophia Smith Collection, Smith College\n\nAnd despite this, most readers of short stories haven't even heard the name Nancy Hale. In the three decades since her death in 1988, her work has faded almost entirely from public consciousness. Until now, her stories and books have been largely out of print.\n\nFor Hale superfans at Library of America, who have been fortunate enough to stumble upon her work in short story anthologies or magazine archives, it was time to stage a recovery effort. The Library is known for reissuing the work of canonical greats like Kurt Vonnegut — but they also focus on excellent but obscure writers, like Hale.\n\n\"There are a lot of Nancy Hale fans in our office,\" says John Kulka, editorial director for the Library of America. \"Staff here have known about her work for a long time. The staff here is always looking backwards.\"\n\nWhen the idea for a collection of Hale's stories was floated again at an editorial meeting in March 2018, Kulka decided to reach out to Groff to see if she would be interested in editing a new compilation of Hale's work.\n\ntoggle caption Megan Brown/Lauren Groff\n\nOver these months of living with Hale's voice in my head, I have asked myself over and over how we could have turned our eyes from her.\n\nShe was. Groff had first encountered Hale's writing in 2015, when her short story, \"At The Round Earth's Imagined Corners\" was published alongside one of Hale's stories, \"Those Are As Brothers,\" as part of 100 Years of The Best American Short Stories.\n\nWhen Groff first read that story, she couldn't believe its writer had been forgotten. And as she spent more time with Hale's work, her disbelief continued to grow. In the introduction to Where the Light Falls, Groff writes, \"Over these months of living with Hale's voice in my head, I have asked myself over and over how we could have turned our eyes from her.\"\n\nThere's no one reason as to why the world forgot Nancy Hale. \"Did the stories fall out of favor? Did [Hale] lack a publisher who was willing to do enough for her?\" says Kulka. \"Or was it just that there wasn't at the time, the same kind of interest in literary fiction by women writers? It is hard to say, but I suspect it is some combination.\"\n\nSelecting the stories featured in Where the Light Falls was incredibly difficult, says Groff. With so many to choose from — well over 100 — Groff joined forces with Kulka and the Library of America's in-house editor for the book, Reggie Hui.\n\n\"We had multiple really long debates and conversations about which stories to include,\" Groff says. \"And there were many passionate speeches on all sides, particularly mine.\" In the end, they settled on 25 stories, not all stories that they absolutely loved, but those that they felt showed the variety of Hale's work, and how her skill and style developed over time.\n\nBits of Nancy Hale's life can be found in all of her stories. \"Every story that a fiction writer writes has something of them in it,\" says Groff. \"[Hale] wrote so close to the bone, to her own life. In many ways, you can see herself in her characters in these stories.\"\n\ntoggle caption Nancy Hale Papers, Sophia Smith Collection, Smith College\n\nShe was born in Boston on May 6, 1908, to bohemian parents (though her father was from what Groff calls \"Boston Brahmin stock\"), and her upbringing was privileged but lonely. Both of her parents were impressionist painters, at times more focused on their art than on their child.\n\nThe Hale family was also a family of writers. Her father's side included Hale's grandfather, Edward Everett Hale, author of \"The Man Without a Country,\" and great aunts Harriet Beecher Stowe, author of Uncle Tom's Cabin, and Lucretia Peabody Hale, who wrote The Peterkin Papers.\n\nAccording to her granddaughter, Norah Hardin Lind, both art and writing were in Hale's blood. \"To be in the Hale family meant that you could write,\" says Lind. \"They were all writers ... and the women wrote right along with the men. There wasn't any sort of discrimination for women's writing in the family.\"\n\nThe family spent their summers on the New England shore, and a love of the rocky coast is clearly reflected in many of Hale's stories, including \"Flotsam\" and Groff's favorite, \"To The North.\" In her late teens, Hale became a debutante; she drew on that experience for stories like \"Crimson Autumn,\" which describes the youthful Boston society of the '20s, full of college football games, dances, car rides and a young woman who resigns herself to marrying her rich yet problematic boyfriend because she knows that she really has no other choice.\n\nI think that she was able to see as an artist the world in which she lived without necessarily buying into a lot of the privilege that she was given.\n\nWhile Hale was immersed in a world of wealth and privilege, it did not stop her from criticizing it. \"Especially with her Boston stories, there's this very fine sense of satire running beneath all of her stories,\" says Groff. \"I think that she was able to see as an artist the world in which she lived without necessarily buying into a lot of the privilege that she was given.\"\n\nBoston isn't the only place that figures largely in Hale's work. As an adult, she lived in Virginia and New York, two more distinct worlds that are just as central to her as Boston.\n\nIn addition, many of Hale's stories focus on women and the expectations set for them by society. \"Women's lives have not traditionally been deemed fit for microscopic vision,\" says Groff. \"[There are] some rich women, some privileged women, also some very ordinary women. And she sees the moments of transcendence and beauty within that.\"\n\ntoggle caption Nancy Hale Papers, Sophia Smith Collection, Smith College\n\nHale's granddaughter, Norah Lind Hardin, who has spent a significant amount of time researching her grandmother's work, agrees that her stories can all in some way be traced back to her personal experiences, even the harrowing. \"I knew her very well. She had my father when she was 22 and [I] was born before she was 50,\" Lind says. \"She was a fabulous grandmother, but she was plagued by difficulties.\"\n\nIn 1941, after seven years of difficult writing, Hale published her most celebrated novel, The Prodigal Women, which Lind says was based in part on her struggling second marriage. She and her husband divorced that same year and shortly after the novel's completion, Hale had a nervous breakdown. She checked herself into a sanitarium and stayed there for 2 1/2 years. And while she recovered, her later work reflects a preoccupation with psychoanalysis, the teachings of Freud and psychiatric treatment.\n\nThe Library of America's new collection hasn't been the only effort to recovery Hale's work. A small cohort of writers and English professors has been writing about and re-publishing selections of her work for the past decade. Phong Nguyen, a professor of creative writing at the University of Missouri, is one such Hale superfan. He first came across her work while browsing through old issues of Harper's Magazine at used book stores in Boston, where he found Hale's story, \"That Woman.\"\n\nIt was simultaneously timeless and contemporary despite being written almost a century before.\n\n\"It was simultaneously timeless and contemporary despite being written almost a century before,\" Nguyen remembers. Years later, when it was time for him to propose a poet for the Pleiades Press Unsung Masters series, he asked if they could do a short story writer instead: Nancy Hale.\n\nNguyen teamed up with Hale's granddaughter Lind and fellow writer and superfan Dan Chaon to co-edit an edition of Hale's work that was published in 2012. \"She engages with contradictions and paradoxes. And the way that she is able to explore these inchoate yearnings,\" he says. \"The things that we feel that we don't yet have the language to express ... We recognize the familiarity of these emotions, but I think she does that better than nearly every other author I know.\"\n\ntoggle caption Nancy Hale Papers, Sophia Smith Collection, Smith College\n\nNot only was Hale a skilled writer, she was a great teacher, Nguyen adds — he says he frequently refers to her 1962 book, The Realities of Fiction: An Author Talks About Writing, when instructing his students.\n\n\"The way that she treats all of the elements of fiction as harmonious and not as separate is distinct from the way that fiction writing is often taught,\" says Nguyen. \"Character, plot, setting, point of view, she saw them as units of a whole and objected to the idea that you can separate them into elements.\"\n\nHe's excited that with the Library of America collection, Hale's short stories will now be more readily available to teach in the classroom. \"She is not trying to make writers out of students ... but she does say some things that are inspirational to a life-long writer,\" he says. \"She says that the best writing is the product of self-doubt. She had great respect for self-criticism. Whether you wonder if you are any good — your ability to question yourself is your talent.\"\n\nBy publishing this way with fanfare and Lauren, what we wanted to say ... is, 'Pay attention. This is an important writer, a very good writer, a writer you should know.'\n\nGrowing up, Lind was always writing poetry. When she showed her writing to her grandmother (and her grandmother's third husband), \"they would deal with me as if I were a fellow writer,\" she recalls. \"It was totally peer-oriented. You weren't made to feel as if it wasn't as good. It would simply be constructive criticism ... It was astonishing to me.\"\n\nAnd Lauren Groff says that rather than be intimidated by the near perfection of Hale's stories, she's let the writing inspire her. \"In some of these stories, I think that there's ... a black hole in the center of the room that she is writing about and her characters live at the edges struggling against it. It's never mentioned, but you can feel the force drawing them in,\" she says. \"I think that is a really extraordinary way to write. And I think that anyone who attempts to do something like that, it's fascinating to watch.\"\n\nWithin a year, Library of America editorial director Kulka says they're hoping to roll out a paperback edition of the book, making it even more accessible. \"By publishing this way with fanfare and Lauren, what we wanted to say [to readers] is, 'Pay attention. This is an important writer, a very good writer, a writer you should know.'\"\n\nAubri Juhasz and Justine Kenin produced this story for radio, and Petra Mayer adapted it for the Web.", "description": "Nancy Hale won multiple literary prizes, and her writing shaped the early identity of The New Yorker. Now, she's mostly forgotten, but that may change with the release of a new edition of her work.", "authors": ["Aubri Juhasz", "Mary Louise Kelly", "Lauren Groff", "Phong Nguyen", "John Kulka"], "top_image": "https://media.npr.org/assets/img/2019/10/04/where-the-light-falls-pem_wide-c966815d73a82989f74f10d6a66a54fc16032603.jpg?s=1400", "published_at": "2019-10-03"}