{"pub": "cbs", "url": "https://cbsnews.com/news/alexei-leonov-died-cosmonaut-first-man-to-walk-in-space-dead-age-85-cause-of-death-not-released-2019-10-11", "downloaded_at": "2019-10-11 12:33:01.408436+00:00", "title": "Alexei Leonov, the first human to walk in space, has died at age 85", "language": "en", "text": "Alexei Leonov, a Soviet-era cosmonaut who was the first human to conduct a spacewalk in 1965, died Friday in Moscow aged 85, his assistant said. \"He died today in Moscow at the Burdenko hospital after a long illness,\" Natalia Filimonova told AFP.\n\nThe Russian space agency Roscosmos said it was saddened to announce the death of \"cosmonaut No 11\" who was twice decorated with the country's top honor, the Hero of the Soviet Union.\n\nAlexei Leonov listens to Danish astronaut Andreas Mogensen speak at the London Science Museum ahead of the launch of space mission Principia on December 15, 2015 in London, United Kingdom. Ben Pruchnie / Getty Images\n\nLeonov was a close friend of Yury Gagarin, who became the first human to go to outer space in 1961.\n\nEarlier this year, two Russian cosmonauts honored Leonov on his 85th birthday. They wore placards on their spacesuit backpacks, one saying \"Leonov No. 1\" and the other \"Happy Birthday, Alexey Arkhipovich.\"\n\nLeonov chalked up one of Russia's major space triumphs on March 18, 1965, when he ventured outside his Voskhod 2 spacecraft to carry out history's first spacewalk.\n\nConnected to the Voskhod by an 18-foot-long tether, Leonov spent 12 minutes floating outside before struggling to get back inside his spacecraft. In the vacuum of space, his suit had ballooned to the point that it would not fit through the hatch. After opening a valve to bleed off pressure, Leonov finally managed to squeeze back inside.\n\nNASA astronaut Ed White became the first American spacewalker three months later.\n\nIn 1975, Leonov took part in the historic Soyuz-Apollo spaceflight which, put an end to the \"space race\" between the U.S. and Soviet Union.\n\nCommander of the Soviet crew of Soyuz, Alexei Leonov (L) and commander of the American crew of Apollo, Thomas Stafford (R), shake hands 17 July 1975 in the space, somewhere over Western Germany, after the Apollo-Soyuz docking maneuvers. Afp / AFP/Getty Images\n\nCBS News' Bill Harwood contributed to this report.", "description": "Alexei Leonov, a Soviet-era cosmonaut who was the first man to conduct a spacewalk in 1965, died Friday in Moscow aged 85, his assistant said", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/10/11/6b7d1998-8ff0-41ac-a9d9-9d45b76d8b77/thumbnail/1200x630/b67d7a25aa33044e5985161321652e23/alexei-leonov-gettyimages-51504238.jpg", "published_at": "2019-10-11"}