{"pub": "thehill", "url": "https://thehill.com/policy/defense/464481-pentagon-works-to-distance-itself-from-trumps-ukraine-scandal", "downloaded_at": "2019-10-07 00:08:23.380187+00:00", "title": "Pentagon distances itself from Ukraine controversy", "language": "en", "text": "The Pentagon is working to distance itself from the controversy surrounding President Trump Donald John TrumpTrump criticizes supposed second whistleblower North Korea missile test raises fears of new capabilities Window narrows for Trump trade deals MORE's communications with Ukraine that has plunged Washington into an impeachment crisis.\n\nDepartment officials in the past week have sought to avoid the political fray, downplaying the administration’s holdup of military aid to Ukraine and preemptively ordering employees to turn over for preservation any documents and communications having to do with it.\n\nQuestions remain about whether the Pentagon was involved in or even aware of the decision to withhold the money. Officials have declined to answer questions, citing the confidentiality of conversations between the department and the White House. Pentagon officials also have insisted there is a “solid working relationship” between the two.\n\n“It looks bad in one sense, to be out of the loop,” said Michael O’Hanlon, a senior fellow at the Brookings Institution.\n\n“It looks good in another sense, because then they aren’t implicated themselves in any chicanery.”\n\nDemocratic lawmakers backed by an internal whistleblower's report allege Trump pressured Ukrainian President Volodymyr Zelensky during a July 25 call to investigate his political rival, 2020 presidential candidate and former Vice President Joe Biden Joe BidenTrump criticizes supposed second whistleblower North Korea missile test raises fears of new capabilities Trump told House Republicans that he made Ukraine call because of Perry: Report MORE. Nearly $400 million in aid to Ukraine was being withheld at the time, and while the whistleblower's report said the individual was not certain of the connection, text messages between Trump administration officials that were released this week have made it clear that some held this concern.\n\nThe intrigue has engulfed Secretary of State Mike Pompeo Michael (Mike) Richard PompeoTrump defense head says US has stepped up attacks on Taliban since talks broke down Defense chief on Ukraine: 'My aim is to keep the department apolitical' Trump rails against whistleblower, impeachment inquiry MORE, who on Wednesday confirmed that he had listened in on the call after days of brushing aside questions as to whether he was aware of what Trump said in the conversation.\n\nHouse committees have also accused Pompeo of seeking to hinder lawmaker efforts to gather testimonies from five current and former State Department officials tied to the controversy.\n\nChief Pentagon spokesman Jonathan Hoffman on Thursday told reporters that no one from the Defense Department was on the July 25 call.\n\n“To my knowledge, no one from the Department of Defense was on that call. I’ve specifically asked the Secretary of Defense that question and he was not on that call,” Hoffman said, referring to Pentagon chief Mike Esper.\n\nHoffman added that DOD’s general counsel has directed all offices to provide any pertinent documents and records related to the Ukrainian aid for “cataloging and review.”\n\nHe called it “a fairly standard practice” adding that there was interest from Congress and the Pentagon inspector general for a possible investigation.\n\n“Out of an abundance of caution, they’ve taken the steps to have documents be preserved,” Hoffman said, adding that the saved records will include any communications between DOD and other departments and agencies.\n\nThe Pentagon on Friday released the official Oct. 3 memo directing the documents be saved.\n\n“In light of heightened interest in the Ukraine Security Assistance Initiative (USAI), I write to request your assistance and cooperation in identifying, preserving, and collecting documents and other records” regarding the aid, Defense Department General Counsel Paul Ney wrote.\n\nNey noted that the records were needed “in responding to anticipated requests for such materials.”\n\nEsper himself has sought to downplay the delay, brushing aside the length of the postponement. The department on June 18 announced the aid, but it was held up until Sept. 11.\n\n“At this point most of the money is out the door. And at no time or at any time has any delay in this money, this funding, affected U.S. national security,” Esper said Sept. 27 at the Pentagon.\n\nAsked on Friday if there was a moment that he was aware of or had discussed the aid freeze, Esper once again sought to keep the Pentagon out of the controversy, telling reporters that he was \"not going to add any fuel to the fire at this point in time.\" \"Congress is looking in to this obviously, an inquiry's underway and we'll deal with this, and answer all these questions in due course. But right now I'm trying to keep DOD out of this issue; it's a very political issue. And I want to just keep it at that right now,\" he said while traveling back to Washington from Louisville, Ky. Hoffman emphasized on Thursday that, \"As the secretary stated, the brief pause in obligating funds did not negatively affect our national security.” O’Hanlon said such a message would presumably help the White House, as it suggests \"that any delay was short and relatively inconsequential for the actual flow of materiel.\" Trump, on his part, has acknowledged he delayed the money, citing alternate concerns about corruption or because he believes Europe is not contributing enough to Ukraine, though the Pentagon in a May letter said that Defense Department had certified that the nation had taken action against corruption.\n\nBut it is still unknown whether the White House directed the Pentagon to freeze its portion of the aid and when such a call would have come.\n\nReports have emerged that the Office of Management and Budget (OMB) directed the Pentagon to hold the money sometime before the July call, as Trump had ordered the office to do so to gain leverage over Ukraine.\n\nHoffman could not say what triggered the money’s delay, and would not discuss the timing of conversations. He also would not confirm that the direction came from OMB.\n\n“That's going to be one of the things I'm not going to be able to get into, particularly between conversations between the department and the White House, in terms of the timing of notices or what was conveyed in that,” he said.\n\n“There’s been no hint or allegation of any type of change in our process here at the department,” he said later, referring to the aid's approval process.\n\nO’Hanlon said such a message from the Pentagon was smart, “not only to protect itself, but to drive home the idea that . . . whatever holdup may have occurred with aid disbursements presumably wasn’t all that serious or significant, since an agency that has some hand in the implementation of the actual policy wasn’t even aware of any delays.”\n\nPressed by reporters on Esper’s awareness of the call — which took place two days after he was sworn in as Defense secretary — Hoffman stressed that the Pentagon chief “has a solid working relationship with the president, with [Pompeo], with the national security adviser ... that’s not a concern.”\n\n“The secretary has an incredibly busy schedule and is working on a number of different issues at any one time. He doesn’t spend most of his days sitting in on other people’s phone calls,” Hoffman said.\n\nHoffman added that DOD is not planning any additional internal investigation into the matter.", "description": "The Pentagon is working to distance itself from the controversy surrounding President Trump's communications with Ukraine that has plunged Washington into an impeachment crisis.", "authors": [], "top_image": "https://thehill.com/sites/default/files/espermark_100419getty.jpg", "published_at": "2019-10-06"}