{"pub": "yahoo", "url": "https://yahoo.com/entertainment/fox-news-neil-cavuto-praises-131326733.html", "downloaded_at": "2019-10-10 02:53:14.581729+00:00", "title": "Fox News' Neil Cavuto praises Don Lemon, Chris Cuomo after Ellen DeGeneres defends Bush friendship", "language": "en", "text": "Fox News' Neil Cavuto wholeheartedly agrees with Ellen DeGeneres' sentiment that \"We’re all different\" and \"we've forgotten that that’s OK.\"\n\nThe comedian responded to criticism that she took in Sunday's Dallas Cowboys/Green Bay Packers game next to former President George W. Bush on her talk show Tuesday.\n\nDeGeneres, who said she and Bush were \"friends,\" reminded her audience: \"When I say 'be kind to one another,' I don’t mean only the people that think the same way that you do. I mean be kind to everyone. Doesn’t matter.\"\n\nCavuto shared his similar beliefs on Tuesday's “Your World,” in a segment called \"Common Sense.\"\n\n\"We live in a very polarizing world. Now, I don't think all that is new. What's new this time is how polarizing things are,\" he said. \"So much so sides don’t just disagree, they must be disagreeable, and they must stick to script.\"\n\nGeorge W. Bush 'appreciated' Ellen DeGeneres going to bat for friendship after backlash\n\nEllen DeGeneres' witty reply to George Bush photo and 5 more times she's hit back at critics\n\nFox News' Neil Cavuto More\n\nSpeaking of TV personalities, he said: \"Like Ellen, like President Bush, they’re more than what you see or what you think you see or what you think you know. It’s true. They may sound polarizing, but I am telling you they’re not. I guess I'm saying we're not. None of us are. Just like none of you are.\n\n\"Take cable news,\" Cavuto continued, \"now I know a lot of the characters here and elsewhere, some better than others … Let me tell you something, most are good people. In fact, most are really good people.\"\n\nCavuto lauded several of his colleagues, including Shepard Smith, \"one of the most kindest and decent people in any profession,\" and Sean Hannity, who Cavuto said would \"give you the shirt off his back if you were down and out, whether you were a liberal or a conservative.\"\n\nCavuto also rattled off compliments for Brian Kilmeade, Steve Doocy, Bret Baier, Martha MacCallum and Bill Hemmer.\n\n“And it's not just here at Fox,\" Cavuto went on. \"Though I don't know them all personally, I can personally vouch for how good Rachel Maddow is to her staff, because they tell me, and how much she cares for what she does, because they tell me that too. And that's important. Or how funny Don Lemon can be making fun of himself, or how even funnier Chris Cuomo can be making fun of Don.\"\n\nMatt Lauer accused of rape; 'Today' show hosts call allegations 'shocking and appalling'\n\nCheck out Neil's latest Common Sense pic.twitter.com/udHJGV1zdR — Neil Cavuto (@TeamCavuto) October 8, 2019\n\nCuomo and Lemon weighed in on Cavuto's comments on \"Cuomo Prime Time\" and \"CNN Tonight.\"\n\nCuomo introducing a clip from \"Your World,\" referred to Cavuto as his \"mentor and friend.\"\n\n\"He said something that everybody needs to hear,\" the CNN anchor assured viewers.\n\n\"You gotta be good to people. You've got to be kind,\" said Cuomo. \"Even when you disagree, you've got to do it with decency, and we need that more from the people in high places.\"\n\nLemon also had kind words for the Fox News anchor, saying he's \"always admired\" him.\n\n\"I think his message is right, and he's right about Rachel,\" Lemon said. \"He's right about other folks. He's right about, even some of the folks at Fox News, who I know, who I disagree with. I think that if I was really in a jam or in a bind, honestly, I think I could call Sean Hannity and say I need some help, and I think he would do it.\"\n\nContributing: Cydney Henderson\n\nMeghan McCain on husband Ben Domenech: 'Conservative men have better family values'\n\nThis article originally appeared on USA TODAY: Fox News' Neil Cavuto compliments Lemon, Cuomo after Ellen speaks out", "description": "Fox News' Neil Cavuto wholeheartedly agrees with Ellen DeGeneres' sentiment that \"We’re all different\" and \"we've forgotten that that’s OK.\"", "authors": ["Erin Jensen", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/2jnmYMoJdsxCVrrciTnwug--~B/aD0zMDcyO3c9NDUzNDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_entertainment_893/a7e9857b405db97181437f09ea5342e8", "published_at": "2019-10-09"}