{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/ap/article-7559085/Boxer-Errol-Spence-seriously-injured-Dallas-Ferrari-crash.html", "downloaded_at": "2019-10-10 19:08:08.046950+00:00", "title": "Boxer Errol Spence seriously injured in Dallas Ferrari...", "language": "en", "text": "DALLAS (AP) - Welterweight boxing champion Errol Spence crashed a speeding Ferrari in Dallas early Thursday and was badly injured but is expected to survive, police said.\n\nThe crash happened just before 3 a.m., when Spence's Ferrari crossed a median into oncoming traffic and flipped over several times, ejecting Spence, who wasn't wearing a seatbelt, police said. Spence was taken to a hospital and placed in the intensive care unit.\n\n\"His injuries are not life-threatening. His parents are with him at the hospital,\" Tim Smith, a spokesman for Spence's promotor, Premier Boxing Champions, told The Associated Press.\n\nPolice said they're still investigating the cause of the crash, but they noted that the Ferrari was speeding at the time.\n\nLast month, the 2012 U.S. Olympian added the WBC welterweight title to his IBF strap with a thrilling split-decision victory over Shawn Porter in Los Angeles.\n\nWith his rangy athleticism and virtuosic skill, Spence, who is 26-0 with 21 knockouts, has captured fans with a series of crisp victories in recent years. He won the IBF title in 2017 by stopping Kell Brook in England, and he defended it three times, culminating in a one-sided thrashing of undersized Mikey Garcia in March.\n\nFILE - IN this Sept. 28, 2019, file photo, Errol Spence Jr., center, celebrates his victory over Shawn Porter during the WBC & IBF World Welterweight Championship boxing match in Los Angeles. Authorities say welterweight boxing champion Spence was seriously injured but is expected to survive after crashing his Ferrari in Dallas. Dallas police say the crash happened just before 3 a.m. Thursday, Oct. 10, 2019, when Spence's Ferrari crossed the median into oncoming traffic and flipped over several times. (AP Photo/Ringo H.W. Chiu, File)\n\nSpence, 29, emerged victorious from his bout with the veteran brawler Porter (30-3-1), which featured several wild exchanges and had the Staples Center crowd of 16,702 on its feet throughout the 12th round and roaring for both fighters when they embraced after the final bell.\n\nHeading into the fight in which he was a heavy favorite, Spence had a lot of attractive options ahead, including a possible fight with the resurgent Manny Pacquiao and a potential bout with fellow unbeaten champion Terrence Crawford after that.", "description": "DALLAS (AP) - Welterweight boxing champion Errol Spence crashed a speeding Ferrari in Dallas early Thursday and was badly injured but is expected to survive,...", "authors": ["Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/17/wire-19549368-1570724875-396_636x382.jpg", "published_at": "2019-10-10"}