{"pub": "guardian", "url": "https://theguardian.com/sport/2019/sep/12/england-australia-ashes-fifth-test-day-one-match-report", "downloaded_at": "2019-09-13 00:57:30.836184+00:00", "published_at": "2019-09-12", "title": "Jos Buttler keeps England afloat after familiar collapse against Australia", "language": "en", "text": "Two contrasting half-centuries kept England afloat – just about – on an another engaging day of Test cricket. Joe Root dutifully grafted away without inspiration in the first half of the day, while Jos Buttler for the first time in the series unfurled some of his one-day magic in the final session. The upshot was that England finished the day on 271 for eight; Australia will not be too disappointed by that; England might be relieved given that they had sunk to 226 for eight before Buttler and Jack Leach combined under the floodlights.\n\nEngland’s chief tormentor would not have been predicted at the start. Mitch Marsh, in his first outing of the summer in the Tests, which may explain the onset of cramp, produced his best figures in Test cricket, ending the day with four for 35. The surface, which has a green tinge, offered him some assistance. However, it remains sluggish and it is hard to predict what constitutes a good total. The likelihood is that England have not reached that number yet.\n\nJoe Root wants England to send off Trevor Bayliss with an Ashes victory Read more\n\nThe toss was probably unnecessary. Tim Paine, to mild surprise, opted to field while Root hinted that he would have batted. Australia had included Marsh to reduce the burden on their pacemen. Given this decision it was also a surprise that they omitted their most attacking bowler, Mitchell Starc, and recalled Peter Siddle. It all began sedately enough. In fact, there was an odd feel to proceedings. There was no sense that an England wicket would fall at any moment - at least in the early part of their innings.\n\nIn fact, Rory Burns and Joe Denly posted the highest opening partnership of the series, whether England or Australia were batting. They added 27 together before Denly edged to second slip, where Steve Smith juggled and then caught the ball. The indefatigable Pat Cummins was the bowler.\n\nBriefly Root seemed to be restored to his old self since the runs came easily at the start of his innings. In part this was because Siddle was slightly off target, allowing the England captain to punch the ball away square of the wicket off the back foot. However, any suggestion that batting for Root was suddenly going to be a breeze again was soon dispelled once he reached 24. At this point he was dropped on the long leg boundary by Siddle when top-edging a pull shot against Cummins. On 25 he edged against the same bowler and Paine, diving to his right, spilt the catch.\n\nFacebook Twitter Pinterest Joe Root looks at the stumps after losing his wicket for 57 runs during the first day of the final Ashes Test. Photograph: Adrian Dennis/AFP/Getty Images\n\nSo he was fortunate to still be there at lunch when England sat prettily on 86 for one. All the while Burns had progressed reassuringly, looking at home on his home ground with the odd cover drive and flicks off his legs in between competent defence. Burns still averages under 30 in Test cricket but he is the nearest England have to a barnacle. Soon Root, now on 30, was dropped again, this time by the usually reliable Smith diving to his right. Hereafter Root was inclined to graft and the Australian bowlers gave him little alternative.\n\nTwo wickets fell in the afternoon session, both against shortish balls that possessed little venom. Burns flapped ineffectually at a short ball from Josh Hazlewood and spooned the ball to mid-on; Ben Stokes, having looked comfortable and assured at number four, somehow did something similar against Marsh and this time the ball lobbed to cover.\n\nEven so, the situation did not look so bleak at tea, 169 for three. Root had passed 7,000 runs in Test cricket, Jonny Bairstow 4,000 and there was the prospect of a significant Yorkshire partnership. But it never materialised. After the interval Cummins intervened yet again with the crucial wicket, that of Root, with another pearler. Perhaps Root could have pushed out further, but the ball straightened and kept a little low before hitting his off stump. Root departed slowly as if betrayed by the number of superb deliveries that he has attracted this summer. Mind you, Cummins bowls a lot of those.\n\nNow the procession commenced. Bairstow was almost bundled to the turf as an inswinger from Marsh smacked into his left pad. The review was fruitless.\n\nHeavy sits the crown of captaincy on Joe Root after ugly half-century | Barney Ronay Read more\n\nEnter Sam Curran, who seems to have been waiting for this chance all summer; certainly he appeared adrenalin-fuelled. His second scoring shot was a pulled six which just cleared the long-on fielder; then he was given lbw to Cummins, but a no ball was revealed from the TV replay. This was followed by a wild Curran drive against his old playmate from Zimbabwe days and he was duly caught at slip off Marsh.\n\nChris Woakes was promptly lbw to Marsh and Jofra Archer, who has not quite settled into the rhythm of batting in Test cricket yet, attracted a fine delivery from Hazlewood. England were sinking fast. Now at last Buttler did what Buttler does best. He served notice by suddenly whacking two sixes over long-on in one over against Hazlewood and soon another was rifled over the square-leg boundary. His staunch ally in an unbroken 45-run partnership was Jack Leach, who seems to have been permanently elevated above Stuart Broad in the order.\n\nLeach moved stoutly into line against the quick bowlers and there was the distinct impression that he was trying to mimic his old Somerset colleague, Chris Rogers, the former Australian opening batsman – though this may be the consequence of a vivid imagination. This pair had not had so much fun at the crease since batting together for Somerset under-12s a decade and a half ago.", "description": "Jos Buttler’s unbeaten 64 helped England reach 271 for eight on the first day of the final Ashes Test", "authors": ["Vic Marks"], "top_image": "https://i.guim.co.uk/img/media/7f090d33b4bc63b2397e41119be9a718293af52b/0_213_5472_3283/master/5472.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=101f90beb2b829635821f1e430654181"}