{"pub": "breitbart", "url": "https://breitbart.com/tech/2019/10/30/u-of-michigan-to-eliminate-bias-response-team-as-part-of-free-speech-lawsuit-settlement", "downloaded_at": "2019-10-30 16:01:58.819289+00:00", "title": "U. of Michigan to Eliminate ‘Bias Response Team’ as Part of Free Speech Lawsuit Settlement", "language": "en", "text": "In a blow to the leftist stranglehold on speech policies on American campuses, the University of Michigan announced this week that it will be shutting down its “bias response team,” which accepted complaints from students for minor speech offenses by their peers.\n\nAccording to a report by Campus Reform, the University of Michigan is shutting down its “Bias Response Team,” a campus system that was designed to allow mostly leftist students to air their grievances about microaggressions they experienced or overhead on campus. “Bias Response Teams” have become a popular feature of campuses and universities around the country.\n\nA First Amendment watchdog group called Speech First filed a lawsuit against the University of Michigan in 2018 to highlight the unconstitutionality of the “Bias Response Teams,” which can punish students for innocent remarks and jokes.\n\nThe DOJ published a Statement of Interest on the case in 2018, pointing out that the “Bias Response Team” expressly encouraged students to report students that hurt their “feelings.” The DOJ stated that the exercise “chills protected speech” by giving University of Michigan officials the authority to discipline students for their speech.\n\nThe United States also argues that the University’s Bias Response Policy chills protected speech through its Bias Response Team. The Bias Response Team, which consists of University administrators and law enforcement officers, has the authority to subject students to discipline and sanction. It encourages students to report any suspected instances of bias, advising them: “[t]he most important indication of bias is your own feelings.” According to the plaintiff, the Bias Response Team has responded to more than 150 alleged incidents of bias in the last year.\n\nAs a part of the settlement with Speech First, the University of Michigan agreed to shut down the “Bias Response Team.” Speech First President Nicole Neily said that the settlement should encourage others to sue public universities that violate First Amendment rights.\n\n“Speech First is thrilled that the University of Michigan has finally agreed to respect the First Amendment rights of its students,” Neily said. “Speech First’s victory paves the way for college students who may have been too fearful or intimidated to express their opinions to finally embrace their free speech rights and engage in true academic discourse. While our battle is far from over, we are pleased that the administration will no longer maintain policies that have both the purpose and the effect of chilling student speech.”\n\nStay tuned to Breitbart News for more updates on this story.", "description": "In a blow to the leftist stranglehold on speech policies on American campuses, the University of Michigan announced this week that it will be shutting down its \"bias response team,\" which accepted complaints from students for minor speech offenses by their peers.", "authors": ["Tom Ciccotta"], "top_image": "https://media.breitbart.com/media/2019/02/Demand-Democracy-free-speech-protest.jpg", "published_at": "2019-10-30"}