{"pub": "yahoo", "url": "https://news.yahoo.com/chinese-journalists-xi-jinping-loyalty-test-132152808.html", "downloaded_at": "2019-09-23 00:17:04.030283+00:00", "title": "Chinese Journalists Will Soon Be Tested On Their 'Loyalty' To Xi Jinping", "language": "en", "text": "Chinese Journalists Will Soon Be Tested On Their 'Loyalty' To Xi Jinping\n\nIn China, considered one of the most restrictive countries to work as a member of the press, thousands of journalists will soon reportedly be required to pass a test grading their understanding of President Xi Jinping’s political teachings, as well as their loyalty to the Chinese leader. If they’re unable to pass the test after two tries, their press credentials could be at risk.\n\nAs first reported by China Media Project and South China Morning Post, journalists working in Chinese state media were recently notified of the impending test by the country’s media regulator. The test will be based on teachings found in a controversial app ― loosely translated as “Study Xi, Strong Nation” — introduced by the government earlier this year.\n\n#China 🇨🇳: Journalists in Chinese state media are to be tested on loyalty to Xi Jinping. Updated press cards will only be issued to journalists who have passed the exam. #shame #PressFreedom https://t.co/CvCSJoep8M via @scmpnews — IFJ (@IFJGlobal) September 20, 2019\n\nThe app, which has been compared to the late Chairman Mao Zedong’s “Little Red Book,” contains articles, video clips and other media about Xi’s political philosophy, according to the Morning Post.\n\nThe app, which Chinese citizens have been strongly encouraged to use by Xi’s government, scores users on a point system and keeps track of users’ progress.\n\nThe most downloaded app in China feeds its users propaganda in a bid to build up Xi's cult of personality. pic.twitter.com/mPxQWOZpwT — SCMP News (@SCMPNews) April 15, 2019\n\nThe test for journalists is not expected to be very difficult, but will include questions on Xi’s “teachings on socialism for the new era” and “important thoughts on propaganda,” The Guardian reported, citing Media Reform, a news account on the Chinese social media platform WeChat.\n\nSome 10,000 reporters and editors are expected to sit for “pilot tests” in early October before nationwide tests are conducted, the Morning Post said.\n\nThe country’s media regulator said in its notice that journalists will need to pass the test in order to renew their press credentials. If they fail the first time, they’ll be allowed to retake the test just once.\n\n“From the top down to the bottom, I don’t think anyone will be able to escape it,” a reporter from a broadcaster in eastern Shandong province told The Guardian of the exam.\n\nChina is ranked 177 out of 180 in Reporters Without Borders’ 2019 World Press Freedom Index, surpassing only Eritrea, North Korea and Turkmenistan.\n\nAlso on HuffPost\n\nLove HuffPost? Become a founding member of HuffPost Plus today.\n\nThis article originally appeared on HuffPost.", "description": "The country's media regulator reportedly notified journalists working in state media that they'll need to pass the test before their press cards can be renewed.", "authors": ["Dominique Mosbergen"], "top_image": "https://s.yimg.com/uu/api/res/1.2/LH1WpRGxozdl3y4nXwtwlQ--~B/aD0zMDAwO3c9NDUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://img.huffingtonpost.com/asset/5d872f5b230000d000d45bfc.jpg", "published_at": "2019-09-22"}