{"pub": "dailybeast", "url": "https://thedailybeast.com/iowans-flirting-with-2020-democratic-long-shots-eyeing-elizabeth-warrens-rise-in-the-polls", "downloaded_at": "2019-09-23 09:07:18.034274+00:00", "title": "Iowans Flirting With 2020 Long Shots, Eyeing Warren’s Rise in the Polls", "language": "en", "text": "DES MOINES, Iowa—Asking an Iowa woman wearing a Steve Bullock T-shirt who she supports for president is not a straightforward question.\n\nIt could be Bullock, the Montana governor who likes his steak medium rare. Or it could be Amy Klobuchar, the Minnesota senator who tried to make a joke about building a “Blue Wall” around President Trump happen.\n\nBut realistically, it could be someone entirely different.\n\nThat’s the lure of the Polk County Steak Fry, one of the longest-standing political events in the influential caucus state. Sure, some attendees gathered here for hours on an overcast Saturday have already selected their candidates. But they’re also actively sampling the biggest Democratic field in modern history. And for more than five hours, many were in no rush to choose just one.\n\nFrom recorded interviews to freewheeling sidebars, some Iowans—including those wearing campaign garb promoting long-shot candidates—mused that while they like said dark horses, they’re likely to shift allegiances to candidates they feel have a better chance at securing the nomination.\n\n“I’m expecting to see a pretty big crowd,” Dale Millizer, a 70-year-old Burlington resident supporting former Vice President Joe Biden, speculated about turnout on caucus night.\n\nBiden’s showing in his past two presidential runs has been paltry. But his supporters here are adamant he’ll pull through on caucus day in early February, with some even arguing the logistics of the grueling, hours-long process works in his benefit. So far, Biden has captured a sizable chunk of older loyalists.\n\n“It’s more for people that are retired,” Beth De La Rosa, a Davenport resident who is also supporting Biden, said about the caucuses.\n\nOn Saturday, many of Biden’s younger enthusiasts showed up in various capacities as volunteers, fellows, and organizers. “He doesn’t reach out to the younger population,” Everett Waechter, an 18-year-old supporter, reflected. “That’s definitely a worry for him.” When approached for interviews, a few said they’re not permitted to talk to the media.\n\nWaechter’s candor, while directed at Biden, highlights a growing tension arising from an increased level of support for his closest rival in the field here: Sen. Elizabeth Warren (D-MA), who has arguably the best ground game operation in Iowa, took the lead in a new Des Moines Register Iowa poll on Saturday night. For the first time in the Democratic nominating contest, Warren led both Biden and Sen. Bernie Sanders (I-VT) in the poll.\n\n“Biden’s not even calling for impeachment yet,” said Jessica Wiederspan, an Ankeney resident who is supporting Warren. “I am shocked that really only Elizabeth Warren talked about it at the beginning of the speech. To me it’s a national crisis.”\n\nWarren, who now leads at 22 percent, with Biden following at 20 percent and Sanders at 11 percent, immediately started with an impassioned call to ramp up proceedings to systematically remove the president from office.\n\n“I’m here today to stand up for the constitution,” Warren said. “Congress failed to act and now Donald Trump has shown he is above the law.”\n\nThat sense of push-pull—the grassroots-oriented progressive fire from Warren versus a steady return-to-normalcy approach from Biden—is at the heart of the current state of play here. Sanders, who has occupied the No. 2 spot in Iowa polls, has in recent weeks faced a series of staffing shake-ups that raise new questions about the direction of his campaign in the must-win state.\n\nBut candidates and supporters of rival campaigns believe the race is far from locked down here, with aides often noting the early and unpredictable nature of the race.\n\nSupporters of Sen. Kamala Harris (D-CA), who received loud cheers after joining a well-choreographed drum routine, were a visible presence at the event, signaling months of preparation. Harris bought some 1,000 tickets, organizers estimated, effectively guaranteeing she’d have a strong showing. At any given moment, crowds of mustard yellow shirts emblazoned with “KAMALA HARRIS FOR THE PEOPLE” took up space.\n\n“I don’t know if you guys heard, I’m planning on moving to Iowa!” the California Democrat joked as she opened her speech to loud applause, echoing the rather more explicit ‘I'm fucking moving to Iowa’ line delivered to a Senate colleague.\n\n“What I’m saying is: You’re going to be hearing from me a lot more!” Will Dubbs, Harris’ Iowa state director, wrote in a fundraising email titled “Steak Fry” on Sunday. In it, Dubbs detailed several of the campaign pledges Harris’ team announced to reaffirm her commitment here, including hiring dozens of new organizers and physically showing up each week in October.\n\nPrior to Saturday’s festival, Harris hadn’t been in the state in over a month—a source of some contention among Iowans who place a premium on retail politics.\n\n“If she wants to run in Iowa, run in Iowa,” Rose Oster, a Des Moines resident deciding among several candidates but leaning toward Bullock, said.\n\nWhen asked by The Daily Beast what to make of Harris’ new pledge to Iowa, some undecided voters remained skeptical.\n\n“I think it’s PR,” Oster added. “She’s saying this because she’s been criticized for it.”\n\nNick Maybanks, a lawyer from Cedar Rapids, echoed that sentiment. “I’m a prosecutor and I don’t even know what her message is,” he said. Maybanks, a politically active Democrat, says he was first excited about the prospect of Harris’ candidacy when she made a trip to the state in October 2018.\n\nSharing the same umbrella legal profession as Harris once held, Maybanks has since taken a second look at Klobuchar, who is also a former prosecutor. He is also eyeing South Bend Mayor Pete Buttigieg.\n\n“I’ve personally been to a lot of events for several of the candidates and she’s been notably absent,” Maybanks said of Harris.\n\nButtigieg’s campaign rallied a large activist base to Saturday’s event, in what they hope is a glimpse into a strong final showing in the caucus. One vocal Buttigieg supporter said the campaign encouraged fans to come from out of state for the day’s festivities.\n\nThe South Bend mayor is viewed favorably by 69 percent of respondents in the new Des Moines Register poll, second only to Warren, who came in at 75 percent. And as the field continues to narrow, Buttigieg took a recent swipe at Warren over the details of her health-care plan, saying during a cable news interview that she is “known for being straightforward and was extremely evasive when asked that question.”\n\nStill, Buttigieg was hardly alone in jabbing the Democrat on the rise. Bullock, who appeared to have a larger showing of support at the event than what translates to poll numbers, seemed to entertain a mild critique of Warren.\n\n“I can’t just put out plans for press releases, I actually have to get things done,” he told reporters after manning a grilling station.\n\nAsked by The Daily Beast if the word “plans” was a subtle dig at Warren, whose campaign slogan “I have a plan” has guided her progressive bid, Bullock demurred.\n\n“Nah, look,” he started. “This comes down to math. If we can’t connect with rural areas, we’re just wasting our time.”", "description": "They may be dallying with Klobuchar or Bullock, but some Iowans who talked to The Daily Beast say they’re likely to switch to a candidate who can win—like Biden or Warren.", "authors": ["Hanna Trudo"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2250,w_4000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569215308/190922-hannah-dems-iowa-embed-2_rcy7ef", "published_at": "2019-09-23"}