{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/avivagen-announces-tsx-venture-exchange-approval-for-extension-of-warrants", "downloaded_at": "2019-10-23 10:55:03.224499+00:00", "title": "Avivagen Announces TSX Venture Exchange Approval for Extension of Warrants", "language": "en", "text": "OTTAWA, Ontario — Avivagen Inc. (TSXV:VIV) (“Avivagen” or the “Corporation”), a life sciences corporation focused on developing and commercializing products for livestock, companion animal and human applications that safely support immune function, promote general health and performance, announces that it has received approval by the TSX Venture Exchange to extend the expiry date of certain of its outstanding warrants.\n\nThe first set of extended warrants are exercisable to purchase 1,163,738 common shares at $1.00 per share. These warrants were issued by Avivagen on December 16, 2014 by way of a private placement and had been set to expire on October 30, 2019. The new expiry date for these warrants is December 16, 2019. The second set of extended warrants are exercisable to purchase 2,774,991 common shares at $0.90 per share. These warrants were issued by Avivagen on June 1, 2016 by way of a private placement and had also been set to expire on October 30, 2019. The new expiry date for these warrants is March 31, 2020.\n\nAll other terms and conditions of the warrants remain unchanged. The Company’s intention to seek extension of these warrants was previously announced on October 15, 2019.\n\nAbout Avivagen\n\nAvivagen is a public corporation traded on the TSX Venture Exchange under the symbol VIV and is headquartered in Ottawa, Canada, based in partnership facilities of the National Research Council of Canada and Charlottetown, Prince Edward Island. For more information, visit www.avivagen.com. The contents of the website are expressly not incorporated by reference in this press release.\n\nAbout OxC-beta™ Technology and OxC-beta™ Livestock\n\nAvivagen’s OxC-beta™ technology is derived from Avivagen discoveries about carotenoids, compounds that give certain fruits and vegetables their bright colours, and is a non-antibiotic means of maintaining optimal health and growth. OxC-beta™ Livestock is a proprietary product shown to be effective and economic in replacing the antibiotics commonly added to livestock feeds. OxC-beta™ Livestock is currently registered and available for sale in the U.S. (GRAS), the Philippines, Taiwan, Thailand, New Zealand, Mexico and Australia.\n\nAvivagen’s OxC-beta™ Livestock product is safe, effective and could fulfill the global mandate to remove all in-feed antibiotics as growth promoters. Numerous international livestock trials with poultry and swine using OxC-beta™ Livestock have proven that the product performs as well as, and, sometimes, in some aspects, better than in-feed antibiotics.\n\nForward Looking Statements\n\nThis news release includes certain forward-looking statements that are based upon the current expectations of management. Forward-looking statements involve risks and uncertainties associated with the business of Avivagen Inc. and the environment in which the business operates. Any statements contained herein that are not statements of historical facts may be deemed to be forward-looking, including those identified by the expressions “aim”, “anticipate”, “appear”, “believe”, “consider”, “could”, “estimate”, “expect”, “if”, “intend”, “goal”, “hope”, “likely”, “may”, “plan”, “possibly”, “potentially”, “pursue”, “seem”, “should”, “whether”, “will”, “would” and similar expressions. Statements about the potential for OxC-beta™ Livestock to fulfill the global mandate to remove all in-feed antibiotics as growth promoters as set out in this news release are forward- looking statements. Forward-looking statements are subject to a number of risks and uncertainties that could cause actual results or events to differ materially from current expectations. Except as required by law, Avivagen assumes no obligation to update the forward-looking statements, or to update the reasons why actual results could differ from those reflected in the forward-looking statements.\n\nNeither TSX Venture Exchange nor its Regulation Services Provider (as that term is defined in the policies of the TSX Venture Exchange) accepts responsibility for the adequacy or accuracy of this release.\n\nCopyright © 2019 Avivagen Inc. OxC-beta™ is a trademark of Avivagen Inc.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191023005045/en/\n\nContacts\n\nAvivagen Inc.\n\nDrew Basek\n\nDirector of Investor Relations\n\n100 Sussex Drive, Ottawa, Ontario, Canada K1A 0R6\n\nPhone: 416-540-0733\n\nE-mail: d.basek@avivagen.com\n\nKym Anthony\n\nChief Executive Officer\n\n100 Sussex Drive, Ottawa, Ontario, Canada K1A 0R6\n\nHead Office Phone: 613-949-8164\n\nWebsite: www.avivagen.com", "description": "OTTAWA, Ontario — Avivagen Inc. (TSXV:VIV) (“Avivagen” or the “Corporation”), a life sciences corporation focused on developing and commercializing products for livestock, companion animal and human applications that safely support immune function, promote general heal...", "authors": [], "top_image": "https://cts.businesswire.com/ct/CT", "published_at": "2019-10-23"}