{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/child-abuse-victims-denied-compensation-20656583", "downloaded_at": "2019-10-20 00:22:04.955572+00:00", "title": "Child abuse victims denied compensation after committing crimes themselves", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nHundreds of victims of child sexual abuse have been denied compensation because they have later gone on to commit crimes.\n\nThe funds are normally available to help deal with issues arising from being attacked – such as paying for counselling, improving security or moving away from their attacker.\n\nBut campaigners say the Criminal Injuries Compensation Authority is denying help to victims even when their offending was triggered by being abused.\n\nIn the past four years 323 claims have been rejected.\n\n(Image: Getty Images/iStockphoto)\n\nLeading abuse solicitor Alistair Smith said: “These are very damaged people who are often being led to offend by the difficult pasts they have had.\n\n“Often they are relatively minor offences, but they are being denied the help they need.”\n\nIn 2015-16 there were 26 claims rejected, which almost doubled to 46 a year later.\n\nBy 2017-18 that had risen to a high of 140. Applications can be refused if a victim has a criminal record – meant to stop serious criminals getting money off the state. But the rule means compensation can also be withheld for petty crimes.\n\nAlistair previously helped overturn a controversial rule that blocked compensation for abuse by family members who lived with the victim.\n\nFigures also show 658 victims have been denied compensation because they did not lodge their claim within two years of the complaint.\n\nAlistair said: “The police don’t want people to put the application in because a cross-examination could say, ‘You’re only in this for the money.’\n\n“It ends up that trials go on for years – for one client, it was six years until she got justice. By the time it comes to put in a claim, it’s too late.”", "description": "EXCLUSIVE: Campaigners say the Criminal Injuries Compensation Authority is denying help to victims even when their offences are triggered by the abuse they endured", "authors": ["Alan Selby", "Image", "Getty Images", "Getty Images Istockphoto"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20654689.ece/ALTERNATES/s1200/0_Image-of-teenage-boy-hacker-silhouette-sat-by-laptop-computer.jpg", "published_at": "2019-10-19"}