{"pub": "businessinsider", "url": "https://businessinsider.com/youtube-verification-badges-checkmarks-youtubers-millions-2019-9", "downloaded_at": "2019-09-19 23:05:34.134730+00:00", "title": "Here are the popular YouTubers with millions of fans that are losing their verified status and coveted grey checkmark thanks to a policy change", "language": "en", "text": "Popular YouTube creators are lashing out against the company after many of them were told Thursday they would be losing the verification checkmarks on their channels.\n\nYouTube announced Thursday that it would be updating the eligibility requirements for its verification program — essentially, which channels YouTube decides will get gray checkmarks next to their names. Those checkmarks have become something of a status symbol among top YouTube creators.\n\nYouTube's reasoning for tightening its verification criteria is to \"reduce confusion about what being verified means.\" Currently, any channel with more than 100,000 subscribers is eligible for verification, but it seems YouTube will be stricter in deciding who actually gets a coveted checkmark moving forward.\n\nUnder its new policies rolling out in late October, YouTube will prioritize \"prominent channels that have a clear need for proof of authenticity\" above all else, specifically those belonging to \"highly searched\" figures and those that have a \"strong presence online\" outside of YouTube.\n\nHowever, it didn't take long for verified YouTubers to take to social media and share emails they received from the company saying that under the new criteria, they were no longer eligible to have a checkmark on their channels. Some of these YouTubers who said they received these emails have hundreds of thousands — and even millions — of subscribers.\n\n\"Your channel no longer meets the criteria to be verified,\" screenshots of the emails sent to unverified YouTubers show. \"We realize this might be disappointing, but we believe these updates will make channel verification more consistent for users and creators across YouTube.\"\n\nIt's unclear exactly when these checkmarks will be removed from YouTube channels, since many of these YouTubers who were notified about their de-verification still have checkmarks visible on their profiles. YouTube did say its new verification criteria is taking effect \"starting in late October,\" but YouTubers like Jake Paul have already had checkmarks disappear from their channels.\n\nIn response to a request for comment, YouTube directed Business Insider to its blog post, which has been updated with some clarifications. YouTube wrote that \"no one lost a verification badge today,\" and those that received an email about getting unverified could still appeal the decision before it takes effect.\n\nTake a look at some of the popular creators who have been told they will be un-verified under YouTube's new criteria:", "description": "Some of these YouTubers who are being told their channels will be un-verified have hundreds of thousands — and even millions — of subscribers.", "authors": ["Paige Leskin"], "top_image": "https://amp.businessinsider.com/images/5d83f2b52e22af3f012b1c85-1334-667.jpg", "published_at": "2019-09-19"}