{"pub": "nymag", "url": "https://thecut.com/2019/09/genteel-southern-gentlemen-stole-the-emmys-red-carpet.html", "downloaded_at": "2019-09-23 17:16:35.200246+00:00", "title": "Genteel Southern Gentlemen Stole the Emmy’s Red Carpet", "language": "en", "text": "Photo: Getty Images\n\nMen’s red-carpet looks are historically a waste of time because pants and jackets are historically boring. These pants are gray. Those pants are a different gray. Enough. But thanks in large part to Billy Porter, Timmy Chalamet, and the Queer Eye cast, the pants and jackets community seems to be having a little more fun this year. There’s a ball gown here, an embroidered bib there, plus that one human head, courtesy of Jared Leto. And while last night’s Emmy Awards brought us the usual wash of black tuxedos, we got a pleasant surprise in the form of two genteel southern gentlemen:\n\nGenteel southern men are trending at the Emmys pic.twitter.com/7tCBvdbCSt — Sarah Spellings (@SJSpellings) September 22, 2019\n\nJeremy Strong and James Van Der Beek were dressed in all the finery of a dashing Cotillion escort. And cheers to them for mixing it up with such charming, Bible Belt–inspired looks. Strong stepped out in a squirrel-colored three-piece suit à la Mr. Frog from Wind in the Willows. “He looks like he’s leading a tour of the Mississippi river,” my colleague Sarah Spellings commented, “all he needs is a straw hat.” If only!\n\nJames Van Der Beek was equally debonair in a double-breasted jacket in a dusky rose velvet. A vision in pink, the Dancing With the Stars actor completed the look with sleek combover and an actual carnation pinned to his lapel. Unfortunately, I must link to my own tweet.\n\nBoth actors sported pretty satin bow-ties and are expected at my house for Sadies Hawkins pictures at 6:30 p.m.", "description": "Jeremy Strong and James Van Der Beek stole the Emmy’s Red Carpet. “He looks like he’s leading a tour of the Mississippi river.”", "authors": ["Sangeeta Singh-Kurtz"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/23/23-jeremy-strong-james-van-der-beek.w1200.h630.jpg", "published_at": "2019-09-23"}