{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/supreme-court-hesitant-expand-employment-discrimin", "downloaded_at": "2019-10-09 00:51:45.664003+00:00", "title": "Supreme Court hesitant to expand discrimination protection to LGBTQ employees", "language": "en", "text": "Supreme Court justices Tuesday questioned if expanding discrimination protection to transgender workers would soon mean grappling with men in the women’s room or men playing women’s sports.\n\nThe issue came before the court through several legal battles brought by LGBTQ employees, who say they were fired from their jobs based on their sexual orientation and gender identity. They argue the Civil Rights Act of 1964 protects LGBTQ employees against sex discrimination in the workplace.\n\nThe justices, though, seemed divided on ideological lines, with Justice Neil M. Gorsuch swinging between both sides. He suggested the LGBTQ advocates had good arguments about the law’s text, but asked if it should be up to Congress to resolve issues related to “massive social upheaval.”\n\n“The question is the matter of the judicial role and modesty,” Justice Gorsuch said.\n\nJustice Samuel A. Alito Jr. said it’s up to Congress to change the law or pass the Equality Act, which is geared at protecting LGBTQ individuals in the workplace.\n\n“If the court takes this up and interprets this 1964 statute to prohibit discrimination based on sexual orientation, we will be acting exactly like a legislature. We might as well just take the Equality Act and issue that as our opinion,” he said.\n\nThe justices also quizzed the lawyers on how a ruling in favor of the LGBTQ advocates would affect future litigation, referring to bathroom and school locker room policies that conflict with transgender rights.\n\nJustice Alito also asked if it’s discriminatory to prohibit a transgender woman from playing on a woman’s college sports team.\n\nDavid Cole, the lawyer representing a transgender worker who was fired from her job at a funeral home after gender transitioning, told the court the sports issue is covered by an entirely different section of the law.\n\n“Title IX is a different statute with regulations that explicitly permit sex-segregated teams when competitive skill or — or contact sports are involved,” he said.\n\nAnd Pamela Karlan, who represents two gay men who were fired by their employers, said the bathroom issue is removed from the employment discrimination context.\n\n“It is hard to see, quite honestly, how requiring men to use a men’s room and women to use a women’s room denies them employment opportunities,” she said.\n\nThe cases dealing with Title VII of the Civil Rights Act are some of the biggest facing the justices in a term that is already shaping up to be momentous.\n\nOne of the advocates in Tuesday’s battle is the estate of Donald Zarda, a gay skydiving instructor who was fired from his job in 2010 after he revealed his sexuality to a customer.\n\nThe customer later reported the interaction to Zarda’s boss. Zarda said he was fired because of the incident, though the company, Altitude Express, denies the allegation.\n\nZarda died in a skydiving mishap in 2014, but his sister is fighting the case on behalf of his estate.\n\nZarda won at the 2nd U.S. Circuit Court of Appeals, which overturned its own precedent and decided that the Civil Rights Act did cover discrimination based on sexual orientation.\n\nAltitude Express appealed. It told the Supreme Court that the 2nd Circuit broke not only with its own previous rulings but also with decades of precedent in other appeals courts. The company said it’s up to Congress to rewrite the law.\n\nThe Trump administration agrees with Altitude Express. In briefs filed in August, the Justice Department argued that Congress was clear on what it intended in discrimination law and that didn’t include sexual orientation.\n\n“The issue is not whether Congress can or should prohibit employment discrimination because of sexual orientation. The issue, rather, is whether it did so when it prohibited discrimination because of sex. It did not,” Solicitor General Noel Francisco told the justices.\n\nCongress has considered a number of bills to do just that, and all of them have failed.\n\nThe four Democrat-appointed justices, though, appeared ready to step in where lawmakers have not and ensure LGBTQ rights were shielded by the law.\n\n“At what point does a court continue to permit invidious discrimination against groups?” Justice Sonia Sotomayor asked.\n\nGerald Bostock is another employee whose case was before the justices Tuesday.\n\nMr. Bostock says Clayton County, Georgia, fired him from his job as a child welfare service coordinator after the court system learned he was gay and played in a gay sports league. The court system says he was fired because he mismanaged funds.\n\nThe third case dealt with gender identity.\n\nThomas Rost, a devout Christian who owns a funeral home, fired a funeral director who started presenting as a woman after six years of employment.\n\nMr. Rost argued that was a problem for his business, which had a long-standing dress code for men and a different dress code for women. He said a reversal could be jarring for grieving families and that a funeral director’s chief role is to blend into the background.\n\n“Treating women and men equally does not mean employers have to treat men as women. That is because sex and transgender status are independent concepts,” said John Bursch, an attorney representing Mr. Rost.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Supreme Court justices Tuesday questioned if expanding discrimination protection to transgender workers would soon mean grappling with men in the women's room or men playing women's sports.", "authors": ["The Washington Times Http", "Alex Swoyer"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/08/Supreme_Court_LGBT_Rights_27000.jpg-94554_c0-229-5472-3419_s1770x1032.jpg?6f9ce78ee1a3a25672569ab4bf84dc3559d8855e", "published_at": "2019-10-08"}