{"pub": "fox", "url": "https://foxbusiness.com/markets/record-label-executive-resigns-after-offensive-run-dmc-costume", "downloaded_at": "2019-10-16 21:14:50.168139+00:00", "title": "Record label executive resigns after 'offensive' Run DMC costume", "language": "en", "text": "The president of Atlantic Records UK announced on Wednesday he is resigning after dressing up as a member of the hip hop group Run DMC in 2012.\n\nContinue Reading Below\n\nBen Cook, who is white, said he dressed up as a black musician \"to honour a musical hero.\"\n\n\"I recognise my appearance was offensive and I made a terrible mistake,\" he said in a statement.\n\nCook became president in 2014 and was instrumental in the success of popular acts including Ed Sheeran and Clean Bandit, MusicWeek reported.\n\n\"Ben Cook is leaving Atlantic UK and this will be his last week in the office,\" a Warner Music Group spokesperson told FOX Business. Atlantic Records is a label owned by Warner Music.\n\nNeither Cook's spokesman nor Warner Music would confirm that the costume included blackface.\n\nFOX Business' inquiry to Run DMC's official social media was not immediately returned.\n\nAtlantic is the legendary music label behind artists including Aretha Franklin and Led Zeppelin.\n\nYou can read Cook's full statement here:\n\nIt is with great sadness that today I announce I am stepping down as President of Atlantic Records, UK.\n\nSeven years ago, at a birthday party where guests were asked to come dressed as their favourite musical icon, I came as a member of Run DMC. Late last year rumours began to circulate about my appearance at that event, many of which are simply untrue. While my intention was to honour a musical hero, I recognise my appearance was offensive and I made a terrible mistake.\n\nAs a consequence of this, I readily agreed to disciplinary actions by my employer last year. Since then however, allegations surrounding the party have continued to be made against me. Moreover, they have been used against a wonderful company and the label I love. I have therefore come to the conclusion that I should make this statement and step down, with immediate effect.\n\nI am devastated that this mistake has caused upset and has called into question my commitment to diversity, equality and inclusion, values which I have championed throughout my career. I have learned a great deal from this event and will resolutely continue to champion these values moving forward.\n\nIt has been an incredible privilege to have worked with the immensely talented artists, managers and team at Atlantic and the wider Warner family.\n\nI unreservedly apologise to anyone who has been hurt.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "Ben Cook became president in 2014 and was instrumental in the success of popular acts including Ed Sheeran and Clean Bandit.", "authors": ["Evie Fordham"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/Run-DMC-Getty.jpg?ve=1&tl=1", "published_at": "2019-10-16"}