{"pub": "foxbusiness", "url": "https://foxbusiness.com/economy/us-budget-deficit-tops-1-trillion", "downloaded_at": "2019-09-13 00:57:32.275362+00:00", "published_at": "2019-09-12", "title": "US budget deficit tops $1 trillion", "language": "en", "text": "The U.S. budget deficit has topped $1 trillion for the first time in seven years, the Treasury Department said Thursday.\n\nContinue Reading Below\n\nThe federal government’s budget deficit rose by $200 billion in August to $1.067 trillion. It’s up 19 percent, or $169 billion, from the October to August period of last year.\n\n“Outlays for Military active duty and retirement, Veteran’s benefits, Supplemental Security Income, and Medicare payments to Health Maintenance Organizations and prescription drug plans accelerated into August, because September 1, 2019, the normal payment date, fell on a non-business day,” the Treasury Department said.\n\nRevenue for the month was up 4 percent versus a year ago to nearly $228 billion as expenditures fell by 1.1 percent to $428.3 billion.\n\nThursday's report comes less than two months after the White House Office of Management and Budget forecast the federal deficit would exceed $1 trillion this year.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nThe national debt now stands at $22.5 trillion, up 13 percent since Trump took office in January 2017.\n\nMichael Peterson, CEO of the Peterson Foundation, said the U.S. must reverse course sooner than later — or else.\n\n“Absent more responsible budgets, the deficit and interest costs will continue to grow rapidly, diminishing America’s future. The longer we wait, the more costly and difficult it will be to put our nation on a stronger path,” he said.", "description": "It was the first time in seven years the deficit topped $1 trillion.", "authors": ["Jonathan Garber"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/05/0/0/white-house-cash-capitol.png?ve=1&tl=1"}