{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/11/texas-admirer-of-poet-robert-frost-donates-land-to", "downloaded_at": "2019-09-11 13:53:21.593529+00:00", "title": "Texas admirer of poet Robert Frost donates land to school", "language": "en", "text": "HOUSTON (AP) - When Vincent D’Amico read earlier this year that his alma mater, University of St. Thomas in Houston, planned to open a campus in nearby Conroe in 2020, the 89-year-old made a quick decision.\n\n“I got excited,” said D’Amico, who graduated from the college’s second class in 1952. “(I decided) I was going to do something and that it’s going to make me excited until I die - a campus in the woods.”\n\nThe Houston Chronicle reports that in April, shortly after the new campus was announced, D’Amico transferred more than 50 acres of his land to Houston’s only private Catholic university.\n\n“Within 48 hours, my attorney said, ‘It’s done,’” said D’Amico, who called it an “ironclad transfer” for the university’s nursing program and a donation that the university can use to raise capital for its new campus.\n\nLocated at FM 1485 and Waukegan Road in East Montgomery just 9 miles outside of Conroe, D’Amico’s picturesque parcel drips with roadways that rise and fall, twist, turn, and roll, much like the imagery in a Robert Frost poem - which is a major reason he bought the land in the first place, he said.\n\nD’Amico, who has donated about $250,000 in endowed scholarships to university programs - including music, education, communications, environmental studies, creative writing, and nursing - said his most recent donation would not have been possible without the lauded poet.\n\nSince his St. Thomas days, D’Amico, a longtime Houston Independent School District educator, has become a dedicated Frost scholar - visiting about 40 literary sites that related to Frost, including his birthplace and his eight farms, all of which are located in scenic parts of New England. And only after visiting with “The Road Not Taken” poet and seeing Frost’s land did D’Amico decide to purchase his own.\n\nAfter earning a bachelor’s degree in English with minors in philosophy and history at St. Thomas, D’Amico, a Renaissance man of sorts who grew up Catholic, tried out a year of law school before deciding that it wasn’t for him and enlisting in the Army for two years.\n\nD’Amico returned to St. Thomas for a semester in 1956, where he worked to get his teacher certification, and he began teaching English - and later, Latin - at Luther Burbank Junior High School.\n\nD’Amico said he loved teaching the seventh-grade, where students studied a textbook featuring Frost as the principal poet. Frost’s material, with vivid imagery, proved relevant and engaging for students who lived in semi-rural areas and were familiar with various species of trees and flowers, livestock and other animals.\n\n“They were seeing images that (Frost mentioned) every day, like stands of trees in a pasture,” D’Amico said. His method of teaching - engaging students with their surroundings through poetry - began working, he said. C-students quickly transformed into B-students.\n\n“I taught them how to shape poetry and how rhyme scheme is really as rhythmic as your heartbeat,” D’Amico said.\n\n“Put your finger on your vein,” he remembers advising them. “Do you remember nursery rhymes that go with the rhythm of your veins as you feel your heart pump?\n\n“I laugh about it now, but it’s kind of an emotional story for me,” D’Amico said, his voice quivering.\n\nDuring his 42 years as an educator, D’Amico spent school breaks during different seasons researching Frost and learning about his life, works and the various literary sites in Vermont, New Hampshire, Massachusetts and Maine. He spent two years building an itinerary to follow.\n\nAnd in 1958, D’Amico set out on his Frost-themed journey, toting a clipboard with a list of things he’d set out to see and photograph, like apple trees, grape vines and spider webs.\n\nFrost’s world in New England - where much of his writing was set - was breathtaking, D’Amico said.\n\n“After driving through three New England states for that first summer of 1958, . everywhere I went was this gorgeous greenery and wildflower,” said D’Amico adding that he was inspired by “how language can be enriched by a keen eye.”\n\nAnd every day, D’Amico gave himself an assignment.\n\n“I would find one out of 10 things that I was looking for. It took me years to find a spider web the size I wanted to go with a poem that I wanted someone to hear,” D’Amico said.\n\nWith the many photos he took, D’Amico created postcards and slides that he’d show his students and display in exhibits - many of which would be shown at Frost’s established museums.\n\nD’Amico first met Frost on Aug. 14, 1958. That meeting, he said, is one of his fondest memories. And all these decades later, it’s not unusual for D’Amico to keep a photo of the two of them in his coat pocket.\n\n“He was relaxed with me as (he was with) an old friend,” D’Amico said, recalling Frost’s curiosity and concern about the lack of recognition given to secondary school educators and his great appreciation for the Lone Star state.\n\n“He loved Texas. He almost became a summer resident here, but the temperature was too warm,” D’Amico said. “He loved San Antonio. He loved Hill Country, and as a result, he knew Texas well.”\n\nUpon coming back to his home in Houston, D’Amico decided he’d do what the poet did: acquire acres of land, which would allow him to see water by a creek, to see trees that were centuries old, and to have a high-profile property that could be refined.\n\nNow, that land will be transferred to St. Thomas‘ recently announced Conroe campus - benefiting the nursing program will be both an ode to his mother, who always wanted to be a nurse, and those working within the industry today.\n\n“My personal experience with nurses in recent years convinces me, they deserve it,” he said. And the memory of Frost and the things his work allowed D’Amico to see live on.\n\n“When I went to St. Thomas, the campus was only a year old, and here I am, at an inception of another,” said D’Amico, moved to tears. “This is a very great thrill of my life.”\n\n___\n\nInformation from: Houston Chronicle, http://www.houstonchronicle.com\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "When Vincent D'Amico read earlier this year that his alma mater, University of St. Thomas in Houston, planned to open a campus in nearby Conroe in 2020, the 89-year-old made a quick decision.", "authors": ["The Washington Times Http", "Brittany Britto"], "top_image": "", "published_at": "2019-09-11"}