{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKCN1VR05J-OCASP", "downloaded_at": "2019-09-06 12:08:09.885507+00:00", "title": "NFL notebook: Raiders create chaos before opener", "language": "en", "text": "The Oakland Raiders plan to suspend wideout Antonio Brown after he “got into it” with general manager Mike Mayock, multiple outlets reported Thursday.\n\nFILE PHOTO: Aug 15, 2019; Glendale, AZ, USA; Oakland Raiders wide receiver Antonio Brown (84) looks on during the first half against the Arizona Cardinals during a preseason game at State Farm Stadium. Mandatory Credit: Matt Kartozian-USA TODAY Sports\n\nMultiple outlets reported Brown had to be held back from Mayock by teammates. NFL Network reported that Brown told Mayock he would hit him in the face, then punted a football and said, “Fine me for that.”\n\nTheir exchange occurred Wednesday after Brown went on Instagram and posted a letter he received from Mayock detailing the $53,950 in fines he accrued while missing time in training camp.\n\nHead coach Jon Gruden declined to get into details after practice, telling reporters the team would have “an official announcement later.”\n\n—Atlanta Falcons wide receiver Julio Jones did not play in the preseason and said he is “trying to be ready” to face the Minnesota Vikings in Week 1, but stopped short of saying he would be on the field in Minneapolis.\n\nJones and the Falcons have been negotiating toward a new contract for months.\n\nOwner Arthur Blank said in March the team wanted a deal done before training camp. General manager Thomas Dimitroff set a goal of the start of the season — which is Sunday.\n\n—Cleveland Browns wide receiver Odell Beckham Jr. said he plans to play Sunday despite an ongoing hip injury that prevents him from “opening up and sprinting.”\n\nBeckham updated reporters on the status of an ailment he has been dealing with for weeks. He did not play in the preseason.\n\n“It’s like an extremely fast car with like a little alignment or something off,” he said. “And it’s right in the center of what you need. Now, the car can still go, but it’s dangerous, you know what I mean?”\n\n—Washington Redskins running back Adrian Peterson could be a healthy scratch for the first time in his career in Sunday’s opener at the Philadelphia Eagles.\n\nHead coach Jay Gruden said a decision hadn’t been made on how many backs will be active, or if Peterson — who doesn’t play special teams — will be one of them. The decision also will depend on health elsewhere, with five Washington players either sitting out or limited in practice this week.\n\nDerrius Guice, a 2018 second-round pick who is healthy after missing his rookie season with a torn ACL, is slated to start.\n\n—Ezekiel Elliott might not be on a snap count Sunday against the New York Giants after all.\n\nAccording to head coach Jason Garrett, the Dallas Cowboys will wait at least another day before deciding whether Elliott should be limited in Week 1 after missing five weeks of preseason work during a contract holdout.\n\nElliott reported to the team Wednesday, signed a $90 million contract and was in meetings from sunrise to sunset to get up to speed on some of the essentials of the team’s game plan for the Giants. He was officially limited in practice, but Garrett said that was by design.\n\n—The Cowboys likely will not offer big money to wide receiver Amari Cooper anytime soon.\n\n“There haven’t been a lot of negotiations with Amari (Cooper), period,” Cowboys executive vice president Stephen Jones said Thursday, via Michael Gehlken of the Dallas Morning News. “And I’m not free to be able to share why. I think at some point we’ll start that. I don’t know what their parameters will be.”\n\nUnlike Elliott, Cooper was not holding out in search of a new deal. He’s expected to play when the Cowboys meet the Giants on Sunday.\n\n—San Francisco 49ers defensive back Jimmie Ward could miss Sunday’s season opener at the Tampa Bay Buccaneers after breaking a finger in Wednesday’s practice.\n\nDefensive coordinator Robert Saleh and cornerback Richard Sherman both confirmed the injury to reporters.\n\n—Minnesota Vikings wide receiver Stefon Diggs returned to practice after he was out a day earlier.\n\nThe Vikings are hopeful Diggs will be on the field for Sunday’s regular-season opener with the Atlanta Falcons in Minneapolis.\n\n—Atlanta Falcons rookie offensive lineman Kaleb McGary could start Sunday’s season opener against the Minnesota Vikings, just five weeks after undergoing a heart procedure.\n\nHead coach Dan Quinn said the first-round pick (31st overall) will be on the active roster, according to the Atlanta Journal-Constutition. McGary, 24, had a cardiac ablation on July 31, a procedure designed to correct heart rhythm issues.\n\n—The Los Angeles Rams and tight end Tyler Higbee agreed to terms on a four-year extension through 2023.\n\nThe deal has a base value of $31 million (more than $36 million with incentives) and includes $15 million in guarantees, NFL Network’s Ian Rapoport reported. Higbee, 26, was entering the final year of his four-year, $2.9 million rookie contract signed in 2016.\n\n—More than 38 million Americans — 15 percent of the country’s population — are expected to place bets on the National Football League this season, according to the American Gaming Association (AGA).\n\nBased on a study conducted by Morning Consult, the AGA report stated that millions of Americans now have access to regulated betting within the United States. The report also said that 24 percent of the population would plan to wager on NFL games if it were legal to do so in their state.\n\n—Field Level Media", "description": "The Oakland Raiders plan to suspend wideout Antonio Brown after he \"got into it\" with general manager Mike Mayock, multiple outlets reported Thursday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190906&t=2&i=1426738791&w=1200&r=LYNXNPEF85065-OCASP", "published_at": "2019-09-06"}