{"pub": "metro", "url": "https://metro.co.uk/2019/10/22/emotional-true-story-racial-discrimination-injustice-behind-michael-b-jordan-jamie-foxx-film-just-mercy-10962273", "downloaded_at": "2019-10-22 13:33:06.455699+00:00", "title": "Just Mercy: True story behind emotional Jamie Foxx film", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nMichael B Jordan and Jamie Foxx are bringing the story of Walter McMillian and Bryan Stevenson to the screen in Just Mercy – but there is a heartbreaking true story of racial discrimination and injustice behind the film.\n\nBased on Stevenson’s 2014 New York Times best-selling memoir, Just Mercy: A Story of Justice and Redemption, the film, also starring Brie Larson, explores Stephenson’s work as a human rights lawyer and his battle to free wrongfully convicted McMillian, who served six years on death row for a murder he didn’t commit.\n\nAdvertisement\n\nAdvertisement\n\nIn 1987 Walter McMillian (played by Foxx) was convicted of killing a white woman who was shot multiple times in the back at a dry cleaners.\n\nFollowing his death penalty sentence, Stevenson took on McMillian’s case which revealed inherent injustices and racial discrimination McMillian was subjected to throughout his indictment and trial.\n\nMcMillian – who died in 2013 – was sentenced to death following a day-and-a-half trial, with the predominantly-white jury finding him guilty despite numerous alibi witnesses.\n\nMcMillian, who was married to Minnie McMillian for twenty-five years and had nine children, held two jobs and had ‘no criminal record other than a misdemeanour charge stemming [from] a barroom fight’ prior to his conviction.\n\nHowever when, on 1 November 1986, 18-year-old dry-cleaning clerk Ronda Morrison was murdered in Monroeville, Alabama, despite insisting he was at a church fish dry with dozens of witness, including a police officer, he was seen as a suspect.\n\nJordan plays Stevenson (Picture: Warner Bros)\n\nArrested in June 1987 by newly elected Sheriff Tom Tate who was supposedly under pressure to find a suspect, McMillian was immediately sent to Alabama’s Death Row, in Holman State Prison, Atmore.\n\nSpeaking of his alibi of the fish fry, McMillian had explained to Sheriff Tate shortly after his arrest where he was, however it was reported Tate replied: ‘I don’t give a damn what you say or what you do. I don’t give a damn what your people say either. I’m going to put twelve people on a jury who are going to find your goddamn black a** guilty.’\n\nIt’s an emotional story (Picture: Warner Bros)\n\nFor the next 15 months he remained on death row awaiting trial, while Judge Robert E Lee Key, Jr relocated the trial from Monroe County, that was 40% black to Baldwin County where 86% of the residents were white.\n\nAdvertisement\n\nAdvertisement\n\nMcMillian insisted he was ‘known’ due to having an affair with a white woman, Karen Kelly, and because one of his sons had married a white woman. Both McMillian and his 1987 attorney ‘contended that McMillian’s relationships alone had made him a suspect’ in the case.\n\nIn a prison interview in 1993, McMillian said: ‘The only reason I’m here is because I had been messing around with a white lady and my son married a white lady.’\n\nIn the December, McMillian, along with career criminal Ralph Bernard Myers were jointly indicted for Morrison’s murder. Following the trial, Myers pleaded guilty as a conspirator and received a 30-year prison term.\n\nOn 17 August, 1988, a jury of eleven whites and one African American found McMillian and recommended a life sentence. This was based on the testimony of four informants found by the prosecution with two of the witnesses claiming to have seen McMillian’s ‘low-rider’ truck outside the dry cleaner’s around the time that the crime allegedly occurred.\n\nMcMillian was exonerated after six years (Picture: Warner Bros)\n\nThis sentence was overridden by the judge, who imposed the death penalty.\n\nIt was said the jury ‘ignored multiple alibi defence witnesses, who were black, who testified under oath that he was at a fish fry at the time of the crime’. There was no physical evidence implicating McMillian.\n\nIn November 1988 Stevenson, who was the director of the Alabama Capital Representation Resource Centre visited McMillian in prison, who was maintaining his innocence on death row.\n\nAdvertisement\n\nBuilding his case, the lawyer visited McMillian’s community and met those who were with this condemned man at the time the crime took place 11 miles away.\n\nBryan, centre, with Just Mercy’s cast (Photo by George Pimentel/WireImage)\n\nMcMillian appealed the case numerous times between 1990 and 1993, with the Alabama Court Of Criminal Appeals turning down four appeals. In 1991 his death sentence was affirmed on appeal.\n\nIt took six years from the original trial for the court to find that the prosecutor, District Attorney Theodore Pearson, and the judge practiced ‘intentional racial discrimination’ in selecting the predominantly-white jury.\n\nAfter his own sentencing, Myers admitted the testimony he gave against McMillian was ‘false’, adding that he knew nothing about the crime, that he was not present when the crime was committed, that he had been ‘told what to say by certain law enforcement officers’, and that he had testified falsely against McMillian ‘because of pressure from the officers’.\n\nWalter spent six years on death row (Picture: RTE)\n\nFollowing this, McMillian’s attorneys filed a petition for a new trial alleging various constitutional violations, including ‘that a key state witness had recanted his testimony, that the appellant’s conviction had been obtained by perjured testimony, and that the evidence of perjury was newly discovered’.\n\nThe petition also alleged that the state of Alabama ‘violated his constitutional rights by withholding exculpatory and impeachment information,’ but yet again, in 1992, the attorney’s claims were denied by the court.\n\nA breakthrough occurred in February 1993 when all judges concurred that the state suppressed evidence that had been requested by the defence and McMillian was denied due process of law. His conviction and death sentence was reversed and he was given a new trial.\n\nAdvertisement\n\nVarious evidence pertaining to McMillian’s innocence was uncovered, including that McMillian’s truck, supposedly seen by witnesses at the scene of the crime, had not been converted to a ‘low-rider’ until six months after the crime took place. It also emerged that District Attorney Theodore Pearson ‘had concealed evidence proving McMillian’s innocence’ after a witness had seen Morrison alive after the time when prosecutors claimed that McMillian had killed her.\n\nThe two witnesses who had testified that they had seen McMillian’s truck retracted their testimony, and admitted that they lied at trial, committing perjury.\n\nIt emerged that Sheriff Tate and investigators had ‘pressured [Myers] into lying’ about McMillian with his attorneys obtaining the original recording of Myers’ confession, in which he complained that he was being forced to implicate McMillian, whom he did not know, for a crime neither of them committed.\n\nDistrict Attorney Thomas Chapman, who had represented the state in McMillian’s previous appeals, told Stevenson: ‘I want to do everything I can so that your client will not have to spend a single day more than he already has on death row. I feel sick about the six years that [McMillian] has spent in prison and the part I played in keeping him there.’\n\nOn 2 March 1993 he was finally exonerated following his fifth appeal, in a unanimous vote.\n\nAfter returning to his family and hometown in Monroeville, McMillian filed a civil suit against Tate, Larry Ikner, an investigator with the District Attorney’s office in Monroe County, and Simon Benson, an investigator with the Alabama Bureau of Investigation, for his wrongful conviction.\n\nWhile a county sheriff could not be sued for monetary damages, McMillian settled with other officials for an undisclosed amount and his case served as a catalyst for Alabama’s compensation statute, passed in 2001.\n\nSpeaking about taking on the monumental role of Stephenson, Jordan was embarrassed to admit that he’d never heard of the activist before landing the role, but was determined to play the role after researching his story.\n\n‘I felt a sense of responsibility to run toward this story and use my platform to get it out to the masses,’ Michael told Entertainment Weekly, ‘because I think he’s a real-life superhero.’\n\nJust Mercy is released in UK cinemas 24 January, 2020.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Even Daniel Craig has no idea how he’ll exit James Bond as director films three different endings\n\nMORE: Killer ‘murdered one woman, had sex with her corpse, then filmed himself killing a second victim’", "description": "True story of racial discrimination and injustice behind Michael B Jordan and Jamie Foxx film Just Mercy.", "authors": ["Mel Evans"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_91058712_1571749157.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-22"}