{"pub": "metro", "url": "https://metro.co.uk/2019/10/15/london-hotel-now-suites-filled-houseplants-help-connect-nature-10923039", "downloaded_at": "2019-10-15 16:26:51.604484+00:00", "title": "London hotel now has suites filled with houseplants", "language": "en", "text": "The Leman Locke Hotel in London is opening three plant-packed suites to help people get back to nature (Picture: Thejoyofplants.co.uk)\n\nFancy a relaxing stay that lets you get in touch with nature… without having to schlep across the country to somewhere remote?\n\nFor London-dwellers who desperately need some greenery, there’s an answer.\n\nFrom 19 October, three studio suites at Leman Locke will open to the public.\n\nBut as you’ve probably guessed, these aren’t your average hotel rooms. Each of the three suites has been transformed into lush indoor jungles filled with gorgeous houseplants, all in an effort to help Londoners reconnect with nature.\n\nThe plant-based makeovers are the work of designer and architect Oliver Heath, This Morning’s Mr Plant Geek Michael Perry, and creative designer and founder of Grace & Thorn Nik Southern.\n\nEach suite has a different theme, with the plants and design carefully selected to inspire a certain mood – either productivity, passion, or peace.\n\nThe productivity suite is filled with plants that are said to inspire focus and creativity (Picture: Thejoyofplants.co.uk)\n\nThe Productivity Suite is designed by Oliver Heath and intended for business travellers and anyone who can work remotely.\n\nAdvertisement\n\nAdvertisement\n\nIt’s decked out with Boston ferns, peace lilies, and snake plants, all of which apparently have productivity-inducing properties.\n\nGuests in this suite will also get to enjoy ‘soundwave therapy’ designed to sharpen focus and stimulate creativity, and rather than booze the mini bar is filled with plant-based power snacks and a CBD oil shot.\n\nCan you see yourself getting loads of work done here? (Picture: Thejoyofplants.co.uk)\n\nThe second suite is the Romance Suite, designed by Nik Southern.\n\nThis one’s all about sensuality, and comes complete with a botanical canopy that cocoons couples (or solo snoozers, if you fancy some self-love) in a lush green blend of cascading plants. There’s also a ‘love-boosting’ cocktail to enjoy.\n\nThis is the romance suite. There’s a leafy canopy above the bed (Picture: Thejoyofplants.co.uk)\n\nIt’s meant for couples, but we wouldn’t judge you for booking a solo stay (Picture: Thejoyofplants.co.uk)\n\nThen, finally, there’s the Tranquil Suite, designed by Mr Plant Geek.\n\nThis one’s a full-on indoor jungle with tropical plants, designed to give guests a forest-bathing experience in the middle of London. You’re encouraged to meditate in the bathroom then enjoy a peaceful slumber among the world’s most air-purifying plants. Dreamy.\n\nAnd finally, the Tranquil Suite, designed to bring peace and calm (Picture: Thejoyofplants.co.uk)\n\nThis is the Tranquil Suite’s bedroom. Calming, right? (Picture: Thejoyofplants.co.uk)\n\nGuests will be given tips on bringing plants into their own homes (Picture: Thejoyofplants.co.uk)\n\nHouseplant experts Thejoyofplants came up with the idea of plant-filled hotel rooms after their research discovered that 34% of people spend less than 17 minutes outside per day during the winter months, despite 39% of us recognising that spending more time in nature would make us happier.\n\nAdvertisement\n\nAdvertisement\n\nSo we know we should be spending more time in green spaces – just last week new research suggested GPs should offer ‘nature prescriptions’ for those struggling with mental health issues – but we’re still finding it tricky to spend time outdoors.\n\nJamming houseplants in every corner of our homes is one solution, but for those with pets (yes, they will eat those leaves. Yes, they will get sick) or cursed with killing every plant they’re responsible for, that’s not an option.\n\nThe bathroom in the Tranquil Suite has been made to feel like you’re bathing in a forst (Picture: Thejoyofplants.co.uk)\n\nThe living wall (Picture: Thejoyofplants.co.uk)\n\nA dedicated plant-themed hotel room can provide some respite from the hustle and bustle of the city and get you back in touch with nature, without you having to tear yourself away from Netflix or deal with the crowds of teens in your local park.\n\nIf you book a stay, you’ll also be given tips for bringing houseplants into your own home, so you can bring that zen back to your flat without worrying about drooping stalks and withered leaves.\n\nThe hotel suites will be open for booking from 19 October to 10 November 2019. If you book by emailing thejoyofplants@lockeliving.com, you’ll get 15% off your stay. Exciting times.\n\nAdvertisement\n\nMORE: How to prepare your plants for cold weather\n\nMORE: The best houseplants for your bedroom to help you sleep\n\nMORE: Plants are now being prescribed to help people with anxiety and depression\n\nAdvertisement Advertisement", "description": "Thejoyofplants has teamed up with the Leman Locke hotel in London to offer three suites designed to connect you with nature.", "authors": ["Ellen Scott"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/Oliver-Living-Room-a211_1571155298.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-15"}