{"pub": "cnbc", "url": "https://cnbc.com/2019/09/05/fascinating-revelations-from-uber-tell-all-book-super-pumped.html", "downloaded_at": "2019-09-06 12:13:38.343537+00:00", "title": "5 of the most fascinating revelations from new Uber tell-all book 'Super Pumped'", "language": "en", "text": "Few tech start-ups have enjoyed a rise as meteoric as Uber's. At the same time, few companies have weathered a path as turbulent as the ride-hailing giant's on its way to becoming a public company valued north of $50 billion.\n\nA new book from New York Times technology reporter Mike Isaac follows Uber's astounding rise to ubiquity as well as the many ups and downs the Silicon Valley company has navigated since its founding in 2009, including scandals, user boycotts, regulatory battles and the eventual ouster, in 2017, of founder and former CEO Travis Kalanick amid claims of systemic sexism at the company.\n\nIsaac's book, \"Super Pumped: The Battle for Uber,\" is out on Tuesday, and it covers the past decade of volatility at Uber, from the company's founding to its disappointing 2019 IPO. Isaac conducted \"hundreds of interviews\" with current and former Uber employees to write the book. And he takes an especially close look at the downfall of Kalanick, whom Isaac describes as a \"hard-charging CEO\" who turned Uber into a Silicon Valley darling worth billions seemingly overnight before he succumbed to the mounting scandals and controversies that forced him out of the company.\n\nHere are five of the most fascinating stories and quotes from \"Super Pumped.\" Uber and Kalanick did not immediately respond to CNBC Make It's request for comment.\n\n1. Uber made almost $500 million on its 'safe rides fee'\n\nIn 2014, Uber announced a new additional $1 charge on users' fares that the company called its \"safe rides fee.\" Uber said at the time that the company would use the charge to fund improved background checks for its drivers as well as driver safety education and mobile app safety features. However, according to Isaac's book, employees who worked on the \"safe rides fee\" project at Uber say the main goal of the charge was to increase the company's profit.\n\nIn fact, court documents from a lawsuit filed against the company by riders reportedly say the company generated nearly $449 million in revenue from the \"safe rides fee\" over the first two years of implementing the charge, according to Bloomberg. What's more, that money was never specifically tagged for spending on initiatives to improve riders' safety, Isaac writes, citing Uber employees who worked on the project. That class action lawsuit resulted in Uber agreeing to pay $32.5 million as part of a settlement.\n\n2. Years before Uber, Isaac says, Kalanick was 'an entrepreneurial failure'\n\nKalanick turned just 33 the year that he and fellow entrepreneur Garrett Camp founded Uber in 2009. Within four years, Uber had raised over $300 million and was valued at roughly $3.5 billion overall — a number that continued to swell in the ensuing years.\n\nBut Kalanick's previous ventures did not get off to such a fast start, Isaac notes in the book. In fact, Isaac describes Kalanick as \"an entrepreneurial failure\" over much of his career before he launched Uber. In 1998, Kalanick dropped out of UCLA to co-found Scour, which developed a multimedia search engine that also allowed users to share music and media files.\n\nDespite raising $4 million in venture capital, the start-up filed for bankruptcy within two years of its founding after multiple entertainment industry groups, including the Motion Picture Association of America and the Recording Industry Association of America, sued Scour and dozens of other file-sharing companies for $250 billion in damages, alleging copyright infringement. The lawsuit against Scour was eventually dismissed as a result of the company filing for Chapter 11 bankruptcy protection.\n\nKalanick's next start-up, another file-sharing company called Red Swoosh, fared better. After starting Red Swoosh in 2001, Kalanick and co-founder Michael Todd sold it to competitor Akamai Technologies for $19 million in 2007, and Kalanick personally walked away with \"roughly $2 million,\" according to Isaac's book.\n\nBut even that relatively small victory came after years of struggling to make Red Swoosh a success. Isaac describes a cycle during that period in which Red Swoosh and Kalanick \"would run out of money\" only to secure a last-minute investment to stay alive a little bit longer (at one point, Mark Cuban even invested $1.8 million). While running Red Swoosh, Kalanick reportedly lived more than three years without taking a salary, which forced him to move into his parents' house. Running Red Swoosh, Isaac writes, had forced Kalanick to \"work around the clock for peanuts, looking for the next deal while living in his parents' house and eating ramen and other treats from the bargain bin at Safeway.\"\n\n3. Confronted with controversial behavior, Kalanick reportedly said, 'I'm a terrible person'\n\nIsaac describes a scene from 2017 in which a group of Uber executives met to discuss negative public perception of Uber after a string of scandals that included a former female engineer at the company writing a blog post alleging systemic sexism, gender bias and sexual harassment at Uber. During the meeting, Uber communications executives showed Kalanick a newly published report on him by Bloomberg News that included a viral video of Kalanick dismissively arguing with an Uber driver.\n\n\"'This is really bad. ... What is wrong with me?'\" Kalanick reportedly said after viewing himself in the viral video, according to Isaac, who also writes that the then-Uber CEO also began \"writhing around on the floor.\" Later in the meeting, after Kalanick reportedly insulted the Uber communications executives present, one of them, Uber's SVP of marketing and public affairs, Jill Hazelbaker, confronted him. \"How dare you!\" she reportedly told Kalanick, according to past and current Uber employees interviewed by Isaac. \"I've walked through fire for you and this company! You did this to yourself!\"\n\nEven after the executives adjourned to Hazelbaker's home later in the day for a more informal meeting complete with pizza and beer, Isaac writes, Kalanick continued to melt down over the negative publicity. \"Kalanick kept repeating the same thing over and over: 'I'm a terrible person. I'm a terrible person. I'm a terrible person,'\" Isaac writes.\n\nKalanick later sent an internal memo to Uber employees apologizing for treating the Uber driver \"disrespectfully,\" in which the Uber CEO wrote that \"the criticism we've received is a stark reminder that I must fundamentally change as a leader and grow up.\"", "description": "The new book from New York Times tech reporter Mike Isaac details Uber's meteoric rise and the scandals that led to the ouster of founder and CEO Travis Kalanick.", "authors": ["Tom Huddleston Jr."], "top_image": "https://image.cnbcfm.com/api/v1/image/104954001-Travis_Kalanick_Attends.jpg?v=1532563698", "published_at": "2019-09-05"}