{"pub": "townhall", "url": "https://townhall.com/columnists/brentbozellandtimgraham/2019/09/11/cbs-flatters-itself-for-60-minutes-n2552881", "downloaded_at": "2019-09-11 07:26:16.395320+00:00", "title": "CBS Flatters Itself for '60 Minutes'", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nThink of the media's daily disgust at President Trump's patting himself on the back. Then watch something like \"60 Minutes\" and find CBS aerobically praising its own genius and celebrating the career of its retiring correspondent Steve Kroft in an hourlong episode on Sept. 8. Not only did Lesley Stahl toast Kroft for his allegedly fascinating interviews and brilliant writing style but she also remembered that when he arrived 30 years ago, \"giants roamed the halls.\"\n\nCBS: a legend in its own mind.\n\nNobody spent a second on how this show housed accused serial sexual harassers Charlie Rose and executive producer Jeff Fager. Only the legend is allowed.\n\nWhen you retire from the coal mine or the meatpacking plant, you might get a cake, or a round of beers. At television networks, they air a pile of your video clips for the entire country to watch and suggest the world would be a dismal place without your amazing talents.\n\nSteve Kroft is best known for his scads of interviews with candidate and President Barack Obama. Even CBS acknowledged this. But it did not admit that Kroft's questions were typically soft-foam word pillows, starting with \"Do you think the country's ready for a black president?\" and \"Did you play basketball on Super Tuesday?\"\n\nWe did the math. Of the 49 Kroft questions in the first four CBS interviews during the 2008 presidential campaign, 42 were personal or horse-race questions. Only seven focused on issues -- five on foreign policy and two on trade -- with no real focus on any domestic issues. Kroft avoided every social issue from abortion to gay rights, every policy concern about taxes and spending, and even nationalization of the health care system.\n\nKroft never focused a question on Obama's scandals before he was elected or his record in the Illinois legislature. There was nothing about Chicago scandal figures from Rev. Jeremiah Wright, to Tony Rezko, to Bill Ayers. Kroft couldn't even raise the radical reverend when Obama protested against people hinting he is Muslim by insisting he was \"a devout Christian who's been going to the same church for the last 20 years.\"\n\nWhen Obama won -- with assistance from CBS -- Kroft shifted the ring kissing to his campaign manager, David Axelrod, saying: \"You ran an incredibly effective and disciplined campaign, maybe the most effective, I mean, certainly one of the most effective presidential campaigns that's ever been run. ... How did you manage that? Even the Republicans were in awe.\"\n\nOn this same \"news\" program in the fall of 2008, Scott Pelley hammered John McCain for letting Wall Street executives sail away on their yachts after they wrecked the economy, and Lesley Stahl recounted to then-Supreme Court Justice Antonin Scalia that people said of him: \"He's evil\"; \"He's a Neanderthal\"; \"He's going to drag us back to 1789.\"\n\nAfter Obama's election, CBS turned its softball interviews into an Obama-promoting DVD titled \"Obama All Access: Barack Obama's Road to the White House.\" Obama backers were told they could watch \"the rising political superstar on the campaign trail, the confident candidate poised for victory.\"\n\nThis pattern of what we called \"Syrupy Minutes\" continued throughout the Obama presidency. In reviewing his oleaginous oeuvre, Stahl softly asked Kroft, \"Did you ever feel that you should have pushed harder?\" Kroft preposterously claimed, \"I think that that criticism came from the fact that I didn't get angry with him.\"\n\nKroft repeatedly flattered Obama, and yet Stahl claimed he has \"old-school standards\" and just \"showed the office respect.\" With spin like this, it's self-evident just how foolish they think we are, that they think we accept all this televised silliness as the facts.\n\nL. Brent Bozell III is the president of the Media Research Center. Tim Graham is director of media analysis at the Media Research Center and executive editor of the blog NewsBusters.org.", "description": "Think of the media's daily disgust at President Trump's patting .09/11/2019 3:26:17AM EST.", "authors": ["Brent Bozell", "Tim Graham", "Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2017/257/97f77d46-1904-446c-854f-e187da2c6b94.jpg", "published_at": "2019-09-11"}