{"pub": "cnbc", "url": "https://cnbc.com/2019/10/29/mattel-shares-spike-after-earnings-beat-new-cfo-named-whistleblower-probe-ends.html", "downloaded_at": "2019-10-30 00:01:23.371901+00:00", "title": "Mattel shares spike after earnings beat, CFO to step down, whistleblower probe ends", "language": "en", "text": "Shares of Mattel jumped as much as 20% in extended trading Tuesday after the company posted better-than-expected earnings for the third quarter and announced it would be hiring a new chief financial officer.\n\nThe company also said auditors had completed their investigation into allegations that the company had made accounting errors in historical periods.\n\nAuditors determined that income tax expense was understated by $109 million in the third quarter of 2017, and overstated by $109 million in the fourth quarter of 2017, with no impact for the full year, the company said.\n\nThe company will amend its 2018 annual report to restate its financial results for the third and fourth quarters of 2017 and said it would work to identify weaknesses in its internal control over financial reporting.\n\nThe whistleblower letter had been made public in August as Mattel was nearing a sale of senior notes due in 2027. Shares fell sharply as investors reacted to Mattel having to halt the bond offering.\n\nBy wrapping up the investigation without finding any fraud, Mattel can now go back and do a new bond offering,\n\n\"We plan to return to the debt market to refinance the $250 million of senior notes maturing in October 2020,\" CFO Joseph Euteneuer said during the earnings call.\n\nAlso on Tuesday, the company said Euteneuer would step down from his post after a transition period of up to six months. Mattel is now conducting a search for its next CFO.\n\n\"Joe has been a valued member of our leadership team since joining Mattel two years ago,\" Ynon Kreiz, chairman and CEO of Mattel, said in a statement. \"He has played a key role in our structural simplification program which is nearing completion, and made meaningful contributions to the significant progress we have made in the first phase of our strategy to restore profitability.\"\n\nMattel said it earned $70.6 million, or 20 cents a share, in the quarter, compared with $6.3 million, or 2 cents a share, in the year-ago period.\n\nExcluding one-time items, the company earned 26 cents a share. Analysts had forecast earnings of 16 cents per share.\n\nRevenue rose to $1.48 billion, beating the $1.43 billion estimate analysts had forecast, according to Refinitiv.\n\nThe earnings beat is good news for Mattel, which has been working on a strategic turnaround plan since bringing Kreiz to the helm in 2018. Still, brands like American Girl and Fisher-Price continue to weigh on sales.\n\nWhile sales of Barbie were up 10% in the quarter, American Girl sales fell 14%. The company's infant, toddler and preschool category also saw sales slump 11%.\n\nAction figures, building sets and games saw combined growth of 12%, the company said. And the vehicles segment rose 13% during the quarter, with sales of Hot Wheels up 25%.﻿", "description": "Shares of Mattel jumped as much as 20% in extended trading Tuesday after the company posted better-than-expected earnings for the third quarter and announced it would be hiring a new chief financial officer in the wake of a whistleblower investigation.", "authors": ["Sarah Whitten"], "top_image": "https://image.cnbcfm.com/api/v1/image/106057477-1572025837996barbie3.jpg?v=1572025878", "published_at": "2019-10-29"}