{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/manchester-street-lock-two-men-arrested-terror-offences-11014827", "downloaded_at": "2019-10-30 23:22:25.863858+00:00", "title": "Manchester Street on lock down after two men arrested on terror offences", "language": "en", "text": "A bomb disposal unit was called to inspect suspicious items found in this car (Picture: PA Wire)\n\nPolice cordoned off a section of Manchester City Centre after two men were arrested on suspicion of terror offences.\n\nOfficers were called to Chapel Street at about 2.30pm this afternoon after reports of suspicious behaviour.\n\nDramatic footage from the scene shows a police van boxing in a Range Rover and pulling out two men, who were pinned to the ground and arrested.\n\nGreater Manchester Police (GMP) said ‘suspicious items’ were found in the car and have been extensively examined by a bomb disposal unit.\n\nThese were not considered to be a danger to the public and the cordon has now been removed.\n\nPolice were called to reports of men acting suspiciously in this car (Picture: London News )\n\nPassengers in the car were pinned down and arrested on suspicion of terror offences (Picture: KrisMeredith/Twitter/PA Wire)\n\nGMP said it was keeping an ‘open mind’ as to the nature of the incident and stressed there was no evidence to suggest any threat to the public at this time.\n\nAdvertisement\n\nAdvertisement\n\nThey two men remain in custody for questioning on suspicion of commission, preparation or instigation of acts of terrorism.\n\nA GMP spokesperson said: ‘Anyone with information should call police on 101 quoting incident number 1558 of 30/10/2019, or the independent charity Crimestoppers, anonymously,on 0800 555 111.’", "description": "Police cordoned off a section of Manchester City Centre after two men were arrested on suspicion of terror offences. Officers were called to Chapel Street at about 2.30pm this afternoon...", "authors": ["Faye Brown"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_94036954_1572472379.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}