{"pub": "businessinsider", "url": "https://businessinsider.com/navy-repaired-ford-carrier-problem-question-over-who-pays-2019-9", "downloaded_at": "2019-09-06 12:20:31.785501+00:00", "title": "The US Navy finally repaired its broken supercarrier, but there's still a question of who is going to pay for it", "language": "en", "text": "The US Navy finally completed the repair work on the propulsion system on its new supercarrier, but two defense contractors are still trying to figure out who has to pay the Navy back for repairs likely to reach into the millions.\n\nHuntington Ingalls Industries Inc., the shipbuilder, and subcontractor General Electric Co. are in a dispute over who is responsible for covering the costs incurred by the Navy for fixing the propulsion system, which, among other problems, has delayed delivery of the USS Gerald R. Ford amid rising costs for the already over-budget carrier, Bloomberg reported Wednesday.\n\nThe service announced recently that the repair work for the propulsion system on the Ford, the first of a new class of aircraft carrier, has been completed. Whether or not it works remains to be seen, as it still needs to be tested.\n\nThe Ford first began experiencing problems with its propulsion system in April 2017, but it started having problems again during sea trials in January 2018, when the crew identified what was later characterized as a \"manufacturing defect.\"\n\nThe January incident was tied to a problem with a \"main thrust bearing,\" with the Navy concluding in a March 2018 assessment that the failure was caused by \"machining errors\" attributed to General Electric, Bloomberg reported last year.\n\nMore propulsion plant problems were detected in May of last year, when the ship was forced to return to port early to be repaired. Then, in March of this year, the Navy revealed that the Ford would spend an additional three months at the shipyard undergoing maintenance, partially due to continued problems with the propulsion system.\n\nAfter repairs, the system is said to be good to go, but there are questions about who is going to pay the Navy back after it picked up the tab for those repairs with taxpayer funds. And right now, the Navy won't say how much the repairs cost, with one spokesman telling Bloomberg that publishing \"cost information could jeopardize the pending negotiations.\"\n\nHuntington Ingalls signaled its intent last year to seek compensation from General Electric, but the issue reportedly remains unresolved. Huntington Ingalls told Insider that \"we continue to work with appropriate stakeholders to support resolution of this situation.\" General Electric declined to comment.\n\n\"As a first-in-class ship, some issues were expected,\" the Navy explained last month when it announced that the Ford's propulsion system has been repaired. Indeed, the carrier has been something of a problem child as the Navy tries to get leap-ahead technology to work to the high standards of reliability needed for combat operations.\n\nFor example, there have been issues with the aircraft launch and arresting gear, and there continue to be problems with the weapons elevators designed to move munitions more rapidly to the flight deck.\n\nThe Ford is billions of dollars over budget with a total cost above $13 billion, and lawmakers have been fuming over the many issues with this project.\n\nSen. Jim Inhofe, the Republican who chairs the Senate Armed Services Committee, sharply criticized the Navy in July, saying that its failures \"ought to be criminal.\"", "description": "The Navy picked up the tab for the repairs — the cost of which is unknown, and now there's a question about who has to pay them back for the work.", "authors": ["Ryan Pickrell"], "top_image": "https://amp.businessinsider.com/images/5a9843a4aae60531008b4761-1136-568.jpg", "published_at": "2019-09-05"}