{"pub": "axios", "url": "https://axios.com/wouldnt-know-found-another-earth-e573d754-d448-4915-9400-fec0aa620756.html", "downloaded_at": "2019-10-08 12:53:42.878722+00:00", "title": "Researchers can't tell if any newfound worlds could sustain life", "language": "en", "text": "These exoplanets — worlds outside of our solar system — are typically found when they pass in front of their star, allowing spacecraft like NASA's TESS to detect minuscule dips in light that happen during those transits.\n\nOther telescopes have detected exoplanets by measuring the small wobbles of a star created by a planet's gravity.\n\nMost exoplanets we've identified are more massive than Earth, and many aren't orbiting stars like our sun.\n\nThat leaves about 20 planets so far that are thought to be small enough and the right distance from their stars to be potentially habitable.\n\nBetween the lines: Using current methods, scientists can track a planet's orbit and even get a decent measurement of its mass, but beyond that, it's hard to know exactly what's happening on a small planet like our own.\n\nIt's not enough to know if an exoplanet is in its host star's habitable zone — the orbit where liquid water could, in theory, be sustained on the surface.\n\nScientists still need information about a planet's composition, atmosphere and geology to make an educated guess at habitability.\n\nEven an exoplanet's core would have bearing on its habitability in that a liquid iron core like Earth's could help produce magnetic fields that would shield a planet's surface from incoming radiation.\n\nSome of the most convincing evidence that a planet is Earth-like may come if scientists can detect atmospheric water vapor.\n\nHowever, today's most powerful telescopes aren't sensitive enough to parse out the composition of a relatively small exoplanet's atmosphere.\n\n\"I absolutely believe there's life somewhere else. I just can't point to the planet yet and tell you which one it is,\" says NASA exoplanet scientist Steve Howell.\n\nWhat's next? Scientists need new tools in order to know if they've found a world truly like our own.\n\nNASA's James Webb Space Telescope (JWST), expected to launch in 2021, might be able to investigate the atmospheres of small planets, though it's likely best suited for dissecting the atmospheres of larger, gaseous planets.\n\nIt will probably take until the generation of telescopes after JWST to enable scientists to find a truly habitable exoplanet.\n\nThe Large UV/Optical/IR Surveyor is a NASA concept for a space-based observatory that could directly image a small planet's atmosphere for the first time.\n\nWhile the public and other researchers might be impatient to find another Earth, exoplanet scientists are in it for the long haul.", "description": "Some of the most convincing evidence that a planet is Earth-like may come if scientists can detect atmospheric water vapor.", "authors": [], "top_image": "https://images.axios.com/d-gUtzFJCWl5UY3h8EbH5MGtGMI=/0x0:1280x720/1920x1080/2019/05/07/1557249137148.gif", "published_at": "2019-05-07"}