{"pub": "guardian", "url": "https://theguardian.com/uk-news/2019/oct/02/ira-spy-and-20-others-could-be-prosecuted-for-troubles-era-crimes", "downloaded_at": "2019-10-03 07:30:13.533555+00:00", "published_at": "2019-10-02", "title": "British spy in IRA and 20 others could be charged with Troubles-era crimes", "language": "en", "text": "A police inquiry into one of the biggest spy scandals in the history of British intelligence has recommended that more than 20 people including senior security force personnel and ex-IRA members be considered for prosecution, the Guardian has learned.\n\nOperation Kenova, the multimillion-pound investigation into “Stakeknife” – the army agent at the heart of the IRA during the Northern Ireland Troubles – has now sent files identifying military commanders and at least one IRA veteran with a so-called “get-out-of-jail” card to the Public Prosecution Service (PPS) in Belfast.\n\nSources close to the inquiry have also revealed that its head, Jon Boutcher, the ex-chief constable of Bedfordshire, has had access to all secret briefing papers given to every prime minister from Margaret Thatcher onwards that related to the running of Stakeknife within the IRA.\n\nTop lawyer hired to bring IRA double agent to justice Read more\n\nStakeknife stands accused of overseeing the murder of alleged informers within the IRA while at the same time working as one of Britain’s most important spies within the Irish republican movement.\n\nIt is understood that the man accused of being Stakeknife, alleged to be Belfast bricklayer Freddie Scappaticci, is among those named by Boutcher. Sources said Scappaticci and the others on the files form “part of the evidence to be considered” by the PPS.\n\nScappaticci has always denied that he is Stakeknife ever since he was allegedly outed as a British agent in 2003. He is alleged to have been the IRA’s chief spycatcher, the head of its internal security unit known within Irish republican circles as “the nutting squad” or “the head-hunters”. The unit was the most feared and supposedly secretive branch of the IRA during the conflict.\n\nThe Stakeknife scandal centres on the allegation that while he was working for the British Army’s intelligence branch, the Force Research Unit (FRU), the agent was allowed by his military handlers to commit crimes including torture and murder.\n\nIt is alleged that Stakeknife is directly linked to 18 murders of IRA members accused of being informers and that the mole-hunting unit he headed was responsible for 30 deaths overall.\n\nA number of families of IRA members shot dead after being accused of treachery have made separate complaints to Northern Ireland’s police ombudsman, claiming that Stakeknife’s handlers in the security forces failed to use their agent to prevent the killings.\n\nA spokesperson for Operation Kenova and Boutcher confirmed that files have now been sent to the PPS in Belfast. The spokesperson based at the Bedfordshire constabulary declined to confirm or deny that Scappaticci and more than 20 others have been named as potential suspects for the PPS to charge.\n\nThe spokesperson said: “Jon Boutcher, the head of Operation Kenova, and his team has prepared files containing evidence regarding a number of offences in the investigation’s terms of reference – including murder, kidnap, torture, malfeasance in a public office and perverting the course of justice. Those files are now in the process of being made available to the Public Prosecution Service for consideration.\n\n“It would not be appropriate to go into further detail regarding that evidence, or the number of individuals involved, until that consideration has taken place. A full report of Operation Kenova’s finding will be published at the conclusion of all legal proceedings.”\n\nThe general officer commanding the British army in Northern Ireland between 1983 and 1990, Gen Sir John Wilsey, has described Stakeknife as “the golden egg” of military intelligence’s agents during the Troubles. General Wilsey claimed Stakeknife saved “hundreds and hundreds of lives”.\n\nWilsey, who once secretly met Stakeknife in Belfast to reassure him he was not going to be outed as an agent, revealed in a book that one of his officers from the Devonshire and Dorset regiment originally recruited Scappaticci, a former IRA internee prisoner, as an agent in 1976.\n\nThe soldier spy recruiter who was later seconded to the Force Research Unit was awarded the Queen’s Gallantry medal partly for recruiting and running Stakeknife. The recruited agent would go on to leak high-grade information about senior IRA commanders, including the late Martin McGuinness, to army intelligence.\n\nFrom Margaret Thatcher onwards successive prime ministers as well as Northern Ireland secretaries received regular briefings based on the intelligence Stakeknife handed over to his military handlers. Much of this information was also filtered through MI5 and RUC Special Branch.\n\nThe Guardian has learnt that Boutcher was given full access to all the cabinet papers related to Stakeknife intelligence that every prime minister was shown since the end of the 1970s. Boutcher was also able to read MI5, FRU and RUC files detailing the information Stakeknife was providing as well as his own role in the IRA’s “nutting squad”.\n\nBoutcher’s report and files to the PPS will also rekindle the row over so-called on-the-run or get-out-of-jail letters that Tony Blair’s government gave to dozens of IRA fugitives and suspects during the peace process.\n\nThe cards were given to IRA activists as part of a secret concession to Sinn Féin that a large number of republicans would not be pursued for past Troubles-related crimes. The scheme outraged unionists and a number of terrorist victims campaign groups.\n\nAt least one man named in the Kenova files being handed over to the PPS in Belfast is an IRA suspect who has one of the on-the-run letters.\n\nOne source close to the Kenova investigation said “it makes no difference” to Boutcher and the Kenova detectives if anyone he has named to the PPS has an on-the-run letter from the Blair government.\n\nThe PPS in Northern Ireland now has to make the final decision whether to prosecute any of those named in Boutcher’s report. This could lead to Britain’s key spy within the IRA appearing in court and, the risk of him exposing his handlers and the way FRU ran covert intelligence operations during the Troubles.\n\nSources close to the Kenova investigation said they now expect after a “high level of access and co-operation” that the “honeymoon period is coming to an end” between its detectives and the security forces as the political-military establishment seeks to protect some of its most senior officers who operated covertly in the undercover war during the conflict.", "description": "Belfast prosecutors considering action against ‘Stakeknife’ and his British army handlers", "authors": ["Henry Mcdonald"], "top_image": "https://i.guim.co.uk/img/media/58315915b5ed08ce613588f154285c4f287825ff/0_160_2656_1594/master/2656.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=121132906fcf4f5d606e8ed145c618d4"}