{"pub": "wsj", "url": "https://wsj.com/articles/president-says-he-had-no-involvement-in-pence-stay-at-trump-branded-hotel-in-ireland-11567629517?mod=rsswn", "downloaded_at": "2019-09-05 00:11:52.928246+00:00", "title": "President Says He Had ‘No Involvement’ in Pence Stay at Trump-Branded Hotel in Ireland", "language": "en", "published_at": "2019-09-04", "text": "WASHINGTON—President Trump said he wasn’t involved in Vice President Mike Pence ’s decision to stay at the president’s golf resort during Mr. Pence’s official visit to Ireland.\n\n“I had no involvement, other than it’s a great place,” Mr. Trump told reporters on Wednesday. “I heard he was going there, but it wasn’t my idea for Mike to go there. Mike went there because his family’s there. That’s my understanding of it.”\n\nMr. Pence and his entourage of aides and Secret Service agents spent two nights at the resort in Doonbeg, County Clare, which is located on the west coast of Ireland, on the opposite side of the country from Dublin. Mr. Pence flew across the country to Dublin on Tuesday for official meetings.\n\nThe itinerary prompted criticism from Democrats and others that the vice president had spent taxpayer money to enrich Mr. Trump’s business. Mr. Trump and his allies have regularly stayed at his properties. Mr. Trump retained ownership of the Trump Organization after taking office.\n\nMr. Pence’s chief of staff, Marc Short, told reporters on Air Force Two on Tuesday that the vice president was traveling to Doonbeg because he had family ties there. He said the stay had been approved by the State Department and noted that the trip was originally planned for just one night.\n\nAsked if the president requested that Mr. Pence stay there, Mr. Short said, “I don’t think it was a request, like a command,” adding “I think that it was a suggestion.”\n\nThe vice president’s office later issued a statement saying: “At no time did the President direct our office to stay at his Doonbeg resort and any reporting to the contrary is false.”\n\nAsked on Wednesday whether he had suggested Mr. Pence stay at the property, Mr. Trump said, “I don’t suggest anything.”\n\nThe president said Wednesday he hadn’t spoken with Attorney General William Barr about his reported plans to host a holiday party at the Trump International Hotel in Washington, D.C.\n\n“I have a lot of hotels all over the place and people use them because they’re the best,” Mr. Trump said.\n\nWrite to Andrew Restuccia at Andrew.Restuccia@wsj.com and Catherine Lucey at catherine.lucey@wsj.com\n\nCorrections & Amplifications The photo of Vice President Mike Pence and Karen Pence showed their arrival at Shannon Airport in Ireland on Monday. A caption in an earlier version of this article said the photo was taken Tuesday. (Sept. 4, 2019)", "description": "President Trump said he wasn’t involved in Vice President Mike Pence’s decision to stay at the president’s golf resort during Mr. Pence’s official visit to Ireland.", "authors": ["Andrew Restuccia", "Catherine Lucey", "Andrew.Restuccia Wsj.Com", "Catherine.Lucey Wsj.Com"], "top_image": "https://images.wsj.net/im-104017/social"}