{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/boxing/article-7615237/Tyson-Fury-reveals-retirement-plans-Gypsy-King-sets-sights-just-three-fights.html", "downloaded_at": "2019-10-26 00:05:46.117581+00:00", "title": "Tyson Fury reveals retirement plans as Gypsy King sets sights on just three more fights", "language": "en", "text": "Undefeated heavyweight Tyson Fury has admitted he expects to retire from boxing after three more fights.\n\nThe 31-year-old is preparing to take on Braun Strowman at WWE's Crown Jewel event in Saudi Arabia on Thursday.\n\nAfter swapping boxing for professional wrestling, the 'Gypsy King' is set to return to his usual sport on February 22 to do battle with Deontay Wilder - and it could be the start of his boxing farewell.\n\nTyson Fury has revealed plans to wind down his boxing career with just three more fights\n\nThe Gypsy King has said that it is a 'young man's game' and he's had his time in the sun\n\n'I don't think I will have many more fights,' he said. 'Maybe another three maximum. That's it.'\n\nHe became unified heavyweight champion in November 2015 with a stunning unanimous decision win over Wladimir Klitschko in Germany.\n\nWhile the Ukrainian finished his career at the age of 41 with 64 wins from 69 fights, Fury is thinking of calling it a day in the not too distant future after 30 bouts, 29 victories and one controversial draw with Wilder last year.\n\n'I don't know what Klitschko's motivation was. I think I am coming to the tail end of my boxing career at the ripe old age of 31,' he said.\n\n'It's a young man's game. I've had my time in the sun. A few more fights and I will relax on the beach somewhere.'\n\nFor many boxers the desire to hold all the belts is a big motivation, but Fury has already had that privilege after beating Klitschko four years ago and in the process becoming lineal heavyweight champion of the world.\n\nFury is set to take on Braun Strowman at WWE's Crown Jewel event in Saudi Arabia this month\n\nHe subsequently had to relinquish all the belts and currently Wilder holds the WBC title and Andy Ruiz - who shocked Anthony Joshua in December - has the WBA, IBF and WBO titles.\n\nAsked if he wanted to take Wilder's belt in February, Fury responded: 'His belt doesn't mean anything to me because alphabetical titles don't mean anything to me. I am above all that.\n\n'When you are the lineal heavyweight champion, you are the best of your era.\n\n'There have been 44 lineal heavyweight champions and I am number 44, so whatever alphabetical titles exist out there - and there are a lot of them - I am not interested in them. I have won every one.\n\nThe Gypsy King is also penciled in to rematch Deontay Wilder after their close draw last year\n\n'Every big organisation belt I have won before; including The Ring Magazine and everything else. The belts, I am not interested in. Whoever says Tyson Fury is not interested in winning belts, they are correct.\n\n'I have tonnes of belts at home and plenty that I hang my trousers with. Belts are very useful and the most useful belt is the one I am wearing today to hold my trousers up.\n\n'I don't need a belt to be considered the best. I am the lineal heavyweight champion of the world, 44th in history.'\n\nFury simply wants to keep defending his lineal championship after five defences so far against Sefer Seferi, Francesco Pianeta, Wilder, Tom Schwarz and Otto Wallin.", "description": "After swapping boxing for professional wrestling, the 'Gypsy King' is set to return to his usual sport on February 22 to do battle with Deontay Wilder - and it could be the start of his boxing farewell.", "authors": ["Pa Sport Staff"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/22/20198548-0-image-a-41_1572037896220.jpg", "published_at": "2019-10-25"}