{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/23/WS5daf997ca310cf3e35571fcd.html", "downloaded_at": "2019-10-23 08:50:32.479567+00:00", "title": "Either-or choice they give retailers will harm e-commerce platforms", "language": "en", "text": "China Daily | Updated: 2019-10-23 08:06\n\nA self-employed entrepreneur manages his online shop in Hangzhou, Zhejiang province, on May 10, 2019. [Photo/IC]\n\nA new e-commerce platform recently revealed that one of its retailers said it had to cut a number of jobs due to the \"either-or choice\" it was forced to make by another platform. Beijing News comments:\n\nThe \"either-or\" ultimatums are an \"exclusive\" means of competition among e-commerce platforms, meaning a platform will often force stores to make a choice between it and other platforms and sell goods and services of only those stores that deal exclusively with it. The e-commerce platforms usually succeed in forcing stores to make such a choice through compulsory means such as \"flow restriction\" and \"search shielding\". According to media reports, when platforms launch such measures, a store with a monthly sale of 10 million yuan ($1.41 million) can be reduced to zero and disappear from the sight of customers.\n\nOn the surface, this is just a commercial competition between enterprises and there is no problem in platforms being encouraged to participate in the competition with better services and technology upgrading, so as to obtain \"exclusive cooperation\" with retailers. However, if the \"punishment\" is carried out as a means of coercion, it will violate the rules of normal competition.\n\nThe booming development of the internet in China over the past 20 years is the result of encouraging full and fair competition in the reform of its socialist market economy. Taking e-commerce as an example, from Taobao to Jingdong, Tmall and Pinduoduo, they have all achieved strong development through innovation in a fully competitive environment. Behind their boom is an open and inclusive approach to the internet, which ultimately leads to the improvement of the circulation efficiency of goods and services.\n\nThe established internet giants should respect users and carry out competition based on the premise that it is beneficial to consumers. Internet companies which benefit from a free and easy market environment should work to promote healthy competition that benefits all rather than seeking a monopoly that will stifle innovation.", "description": "A NEW E-COMMERCE PLATFORM recently revealed that one of its retailers said it had to cut a number of jobs due to the \"either-or choice\" it was forced to make by another platform. Beijing News comments:", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/23/5daf997ca310cf3e97a28213.jpeg", "published_at": "2019-10-23"}