{"pub": "yahoo", "url": "https://finance.yahoo.com/news/roche-boosts-outlook-third-time-070150173.html", "downloaded_at": "2019-10-16 07:30:49.051389+00:00", "title": "Roche Boosts Outlook for Third Time as New Drugs Gain Traction", "language": "en", "text": "(Bloomberg) -- Roche Holding AG for the third time this year said sales and profit may be better than expected as its push outside cancer pays off.\n\nSales and core earnings per share will rise by a percentage in the high-single digits this year, the Basel, Switzerland-based drugmaker said in a statement. It previously expected growth in the mid- to high-single-digits.\n\nKey Insights\n\nGrowth drivers Ocrevus for multiple sclerosis and Hemlibra for blood clotting continued to perform last quarter, with sales of the latter gaining after U.S. regulators cleared it for use in the largest group of hemophilia patients.Roche says planned acquisition of Spark Therapeutics still expected to close by year-end despite delays.The erosion in sales for aging blockbuster cancer drugs Avastin and Herceptin wasn’t as bad as some feared in the third quarter after rivals Amgen Inc. and Allergan Plc introduced biosimilar versions of the medicines in the U.S. in July. New competition for another older drug, Rituxan, is expected to pick up in the fourth quarter.\n\nMarket Reaction\n\nRoche’s stock has climbed about 16% so far this year, roughly in line with its Basel, Switzerland-based neighbor Novartis AG and the Bloomberg European pharma index.\n\nGet More\n\nFor more details on the news, click here.To read the statement, click here.\n\nTo contact the reporter on this story: Tim Loh in Munich at tloh16@bloomberg.net\n\nTo contact the editors responsible for this story: Eric Pfanner at epfanner1@bloomberg.net, Marthe Fourcade\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Roche Holding AG for the third time this year said sales and profit may be better than expected as its push outside cancer pays off.Sales and core earnings per share will rise by a percentage in the high-single digits this year, the Basel, Switzerland-based drugmaker said in a statement", "authors": ["Tim Loh"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Ys3U4tq1jJFjDeDdOb6UnA--~B/aD0yNjY3O3c9NDAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/333146bc0f113fb99acb82928f8997b0", "published_at": "2019-10-16"}