{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/14/russian-shadow-falls-over-syria-as-kurds-open-door-for-assad", "downloaded_at": "2019-10-14 23:22:19.114414+00:00", "title": "Russian shadow falls over Syria as Kurds open door for Assad", "language": "en", "text": "With the US gone, the implications of their departure is beginning to sink in across the Middle East\n\nThe moment that changed the Middle East arrived with a sudden silence. Just before 7pm on Sunday, the internet was cut across north-eastern Syria where, for half an hour, the Kurds of the region had been digesting a news flash. The Syrian government was returning to two towns, Manbij and Kobane. The implication quickly sunk in.\n\nThe regional capital, Qamishli, soon emptied; streets that had bustled with minibuses and shoppers became eerie and still. With the internet down phones were no help and nor were officials who had vanished along with the traffic. Air seemed to be suddenly vacuumed from the city, and the few people still around knew exactly what it meant: this was the moment power changed hands. It was a time to be scared.\n\n“You must leave now,” one man said, avoiding eye contact. “There are regime checkpoints to the east and it isn’t safe to stay.” He, and other Kurds had lived all their lives, except for the past seven years, under the control of the government in Damascus, and the prospect of their return left him pale and worried.\n\nThe Syrian army had maintained a presence in central Qamishli ever since Bashar al-Assad gave the Kurds semi-autonomy in 2012. They had always been toothless next to a larger and better armed rival. But could they be emboldened now? Their base was only 200 metres away.\n\nFacebook Twitter Pinterest Turkey-backed Syrian fighters kneel to pray as they gather near the village of Qirata on the outskirts of the Manbij. Photograph: Aaref Watad/AFP via Getty Images\n\nA black sky covered the road to the border, the sparkling white lights of Turkey to the left and the Syrian army somewhere in the darkness to the right. Usually diligent Kurdish checkpoint guards had left their posts, or were preoccupied. Lone speeding cars and belching lorries without headlamps rumbled through the night, perhaps the last to make the journey before the conquerors arrived.\n\nA day later, the ramifications of the momentous week that preceded the Kurds allowing the Assad regime to retake the province is still sinking in, across Syria and far beyond in Riyadh, Baghdad, Cairo and the Gulf.\n\nSomething far bigger was at play here; the end of US influence in Syria and the plunge in its status elsewhere. The public handover on show was that between the Assad regime and the Kurds, but the real power shift was between Washington – whose fighting troops have all but left the region, 16 years after invading Iraq – and Moscow, whose reach and influence across the Middle East has now been cemented.\n\nFacebook Twitter Pinterest King Salman bin Abdulaziz Al Saud with President Putin before talks on Monday. Photograph: Mikhail Metzel/Tass\n\nAs if to celebrate the moment, Vladimir Putin arrived in Riyadh for a state visit on Monday, his first in 12 years, hosted by Saudi Arabia’s Crown Prince, Mohammed bin Salman, who three weeks earlier had similarly felt the humiliation of abandonment by US allies.\n\nAfter Iran launched an attack against the kingdom’s oil production centres, the crown prince was expecting a US retaliation. None was forthcoming, and he felt abandoned by an ally that had sworn to protect Saudi interests. “Did you see what they [the US] did to us?” the crown prince asked Iraqi leaders in Riyadh a fortnight ago. “It was unbelievable.”\n\nIn northern Syria, the US decision to abandon the Kurds, who had helped lead the global fight against Isis, had bewildered locals and left them with very few options. “It’s better to go for compromise than genocide,” said Muzlum Abdi, commander in chief of the US-raised force, formerly known as the SDF.\n\nKurds, led by leaders of the Kurdistan Workers party (the PKK) had held talks with Russian officials in Qamishli in recent days about the terms of their pact with Damascus. Fighting Turkey to the north, and left without a protector after Donald Trump ordered the US military to leave, the Kurds held a very weak hand.\n\n“The Russians have been accusing us of allowing the Americans into the region in the first place,” said Arshan Mizgin Ahmed. “We have paid a heavy political price for that.”\n\nShe added: “We will do whatever is in our best interests.”\n\nAs the US withdrew, what remained of its authority was increasingly tested. A jet buzzed a US base near Ain Issa – the US military won’t say who it was. Up the road, Turkish Arab proxies, who had executed a Kurdish politician on a highway a day earlier were setting up base.\n\nAs time ticked away on the last vestige of Kurdish rule, the Syrian military arrived – packed into cattle trucks – in the town of Tal Tamir, where Kurdish fighters had been bringing their wounded only hours earlier.\n\nTheir arrival would have likely heartened one of the country’s most recent refugees, Ahmad Mahmoud Hussein, who a day before had raged against Turkey’s proxies – Arabs from elsewhere in Syria, who had just forced him from his home in the town of Ras al-Ayn. “They are mercenaries, hired guns,” he claimed. “They are all ex-convicts and drug addicts and they have no honour or mercy. Those who fall for what Turkey are offering them will do anything for money. I don’t care if I’m sleeping on this school floor for one year, two years, or 10. I’m not going back while they’re still there.”\n\nThe dying days of the war in all its horror and contradictions played out on television screens across the Kurdish north, where normal transmissions had resumed after Sunday’s Big Brother-like shutdown. In the border town of Derik, drivers watched with looks of resignation as Kurdish families threw rice at the feet of Assad’s soldiers. “He’s acting,” said one of the men watching another Kurd on the television. “No he isn’t, he’s relieved,” said another.\n\nPast scorched brown hills, along undulating roads to the border, the faces of the vanquished showed a similar mixture of resignation, and confusion. For the Kurds the dream of autonomy has ground to a halt. The new alliances taking shape on the ruins of their ambitions will be felt for generations in what remains of Syria.\n\n“Iran and Russia are the dominant foreign powers now,” said Arshan. “They will dictate terms in this region. Things have really changed.”\n\nAdditional reporting by Mohammed Rasool", "description": "With the US gone, the implications of their departure is beginning to sink in across the Middle East", "authors": ["Martin Chulov"], "top_image": "https://i.guim.co.uk/img/media/884c76e933a730d0321ae2f3d704845ab8901ec9/0_377_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5529168ba21a408fe490e2b8d0986007", "published_at": "2019-10-14"}