{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/birmingham-fans-attack-stewards-violence-20656292", "downloaded_at": "2019-10-19 19:07:15.796243+00:00", "title": "Birmingham fans 'attack stewards' as violence mars defeat at Leeds United", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nBirmingham fans allegedly attacked stewards after their match with Leeds as officers tried to apprehend a fan that ran onto the pitch.\n\nFans are alleged to have punched and kicked stewards as they attempted to find the fan that made his way onto the pitch during the game.\n\nA video has surfaced online that showed some Blues fans chanting and singing towards Leeds fans after their 1-0 defeat, while others pointed and hollered for police in attendance to back down to the bottom of the stand.\n\nOthers appeared to goad police officers are they came closer.\n\n(Image: EMPICS Sport)\n\n(Image: EMPICS Sport)\n\nFans then continued chanting and gesturing towards the home fans as alleged clashes with stewards continued.\n\nFootage also appeared to show one steward sat down on the pitch, appearing to receive treatment or help from a concerned colleague, while another steward appeared to be on the floor at the bottom of the stand.\n\nWest Yorkshire Police say that there has so far been no reports of any arrests from the game.\n\n(Image: EMPICS Sport)\n\nLeeds triumphed on home soil thanks to a strike from Kalvin Phillips on the 65th minute, finally breaking down the Blues' strong defensive resistance.\n\nMarcelo Bielsa's side had chances in the first half but couldn't find the finish before Phillips' winner.\n\nThe midfielder latched onto Jack Harrison's through ball before slotting past Lee Camp in the Birmingham goal.\n\nBirmingham had chances for their own, but found Kiko Casilla difficult to beat.\n\nLeeds' victory means they sit second in the Championship, two points behind league leaders West Brom. Birmingham are in 12th.", "description": "The alleged clash took place at the end of the Championship match between Birmingham and Leeds United on Saturday night", "authors": ["Adam Payne", "Image", "Empics Sport"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20656495.ece/ALTERNATES/s1200/0_Screen-Shot-2019-10-19-at-183401.png", "published_at": "2019-10-19"}