{"pub": "yahoo", "url": "https://news.yahoo.com/russia-plans-build-helicopter-aircraft-230000651.html", "downloaded_at": "2019-10-09 07:12:40.776918+00:00", "title": "Russia Plans to Build New 'Helicopter' Aircraft Carriers", "language": "en", "text": "Key point: While helicopter carriers aren't the same as regular aircraft carriers, they still provide mobile air support for ground troops.\n\nFor the first time since the 1990s, Russia’s helicopter carriers are coming back.\n\nRussia will begin building two helicopters carriers as of May 2020, according to Russian news agency TASS, citing unnamed sources. And in a slap at the West, the ships will be built in a shipyard in the Crimea, forcibly annexed from Ukraine in 2014, which led to Western sanctions against Russia.\n\n\"Two amphibious assault ships, with water displacement of up to 15,000 tons, will for the first time in Russian history be laid down at the Zaliv shipyard in Kerch in 2020,\" one source said. The first vessel is slated to be delivered before Russia’s current 10-year arms procurement plan ends at the end of 2027.\n\n“The ships will be able to carry over 10 helicopters of various types and will be equipped with a dock-type chamber for landing craft utilities (LTU),” TASS said. How many troops will be carried wasn’t specified, though TASS noted that such ships carry from a few hundred to more than a thousand soldiers.\n\nThe U.S. Navy operates eight Wasp-class amphibious assault ships, each about 41,000 tons. They carry almost 2,000 Marines, plus up to a dozen landing craft, 30 M-1 tanks and AAV7A1 amphibious armored vehicles, eight towed 155-millimeter howitzers, and almost a hundred trucks, Humvees and other support vehicles. That ground force is supported by a powerful mixed air unit comprising about 20 to 30 transport and attack helicopters, MV-22 Osprey tilt-rotor aircraft, AV-8B Harrier jets and F-35B short-takeoff and vertical landing (STOVL) stealth fighters.\n\nThe Wasps give the United States the capability to land a Marine Expeditionary Unit (essentially a reinforced infantry battalion) by sea or air, backed by armor and air support. Deployed around the world as the centerpiece of Amphibious Ready Groups complete with escort warships, such groups have allowed America to land troops at global hotspots at short notice.\n\nBut the Russian vessels seem closer to France’s Mistral-class amphibious assault ships. The 21,000-ton Mistrals accommodate up to 900 troops, 40 Leclerc tanks, 16 transport and attack helicopters, and a few amphibious landing vehicles. France operates three, while Egypt has two.\n\nRead the original article.", "description": "Vital for power projection.", "authors": ["Michael Peck"], "top_image": "https://s.yimg.com/uu/api/res/1.2/GEu2qHXvVGTIGHKZ3uCRMA--~B/aD04NzA7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_national_interest_705/8c0db1101d0ce6193360e77692b3e597", "published_at": "2019-10-08"}