{"pub": "yahoo", "url": "https://news.yahoo.com/video-game-improve-social-aptitude-autistic-children-095941857.html", "downloaded_at": "2019-10-04 02:40:21.061194+00:00", "title": "Can a video game improve social aptitude in autistic children?", "language": "en", "text": "A researcher from the Department of Information and Communication Technologies (DTIC) at the Universitat Pompeu Fabra in Barcelona has developed a video game eliciting \"full-body interaction\" designed to facilitate social interaction for autistic children.\n\nFor this study, published online in Research in Autism Spectrum Disorders, 15 children aged from four to six years diagnosed with autism spectrum disorders participated in four sessions playing \"Pico's Adventure,\" as well as with traditional toys (balls, dolls, carriages, etc.).\n\nIn collaboration with researchers from the Sant Joan de Déu Hospital and Mutua Terrassa University Hospital, \"Pico's Adventure\" creator Narcís Parés analyzed the children's behavior while they played. This observational study compared the social interactions generated by the video game with those of the sessions' other activities.\n\nAs Parés explains, \"the first experimental studies proved effective as a complement to conventional therapies. Since then, 'Pico's Adventure' has become an important benchmark in the search for ICT-based tools to promote social interaction conduct in children with ASD.\"\n\n\n\nIn the study, the video game was shown to be more effective in improving the children's gestural expression, especially in reducing the repetitive movements that are frequent in autism spectrum disorders. The researchers also noted greater social interaction during \"Pico's Adventure\" than in free play.\n\nVideo games could be considered \"a suitable tool to foster social behavior as well as being useful as a complement to traditional treatments,\" the study suggested, but Narcís Parés pointed out that \"future work is needed in order to obtain further data that support this hypothesis.\"", "description": "For this study, published online in Research in Autism Spectrum Disorders, 15 children aged from four to six years diagnosed with autism spectrum disorders participated in four sessions playing \"Pico's Adventure,\" as well as with traditional toys (balls, dolls, carriages, etc.).  In collaboration", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/kYJ6Rum8ZfjWFrpgCNh3xA--~B/aD0xOTI0O3c9Mjg5NDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_US/News/US-AFPRelax/istock_867856148.d24bd095308.original.jpg", "published_at": "2019-10-03"}