{"pub": "reuters", "url": "https://in.reuters.com/article/uk-cricket-test-ind-zaf-kohli/batsman-kohli-credits-india-captaincy-for-change-in-mindset-idINKBN1WS0EZ", "downloaded_at": "2019-10-13 18:50:44.499199+00:00", "title": "Batsman Kohli credits India captaincy for change in mindset", "language": "en", "text": "MUMBAI (Reuters) - India’s Virat Kohli believes his mindset as a batsman changed after being handed the captaincy and the extra responsibility is the reason for his imperious run-scoring ability.\n\nIndia's captain Virat Kohli gestures during a news conference at the Board of Control for Cricket in India (BCCI) headquarters in Mumbai, India, May 21, 2019. REUTERS/Francis Mascarenhas\n\nKohli notched up his first double hundred in his 42nd test against West Indies in 2016 while his 254 against South Africa at Pune was his seventh in his 81st test match.\n\nIn his 50th test as captain, the 30-year-old went past batting great Sachin Tendulkar and former opener Virender Sehwag as the Indian batsman with most the double centuries while he also passed 7,000 runs in the format during his innings.\n\n“It’s getting the responsibility of being captain,” Kohli said at the presentation ceremony on Sunday after being named man of the match as India won by an innings and 137 runs.\n\n“If you go out planning a double hundred you will not get it but if you just go out planning to play five sessions for your team you invariably cross that 200 mark as well.\n\n“The mindset is always to help the team as much as possible, play at a tempo the team requires you to and in that process big scores come. The mindset change is the only reason behind getting the big scores.”\n\nKohli was handed the test captaincy in abrupt fashion at the start of 2015 when long-serving skipper Mahendra Singh Dhoni retired from test cricket midway through a series in Australia.\n\nHe already has more test wins than Dhoni while leading the side in fewer matches.\n\nThe knock of 254 against South Africa was Kohli’s personal best in test cricket while he also has an astounding 43 centuries in the 50-over format.\n\n“I am at a stage in my career now where I am just happy to be playing the way I am and contributing for my team,” he said. “Putting the team in a commanding position is the only goal and that’s the only thing I strive for.\n\n“I love scoring runs but if they come in a winning cause that’s the most important thing.”\n\nHis South African counterpart Faf du Plessis was amazed by Kohli’s hunger for runs and felt it was a lesson for other batsmen.\n\n“As a captain you are trying to think of ways, how you can change little field placements, bowlers but he was too good in this test match,” Du Plessis said.\n\n“All the questions and all the stuff that we threw at him, he had answers for. It’s just relentless, for me what stuck out was the hunger for runs.\n\n“He was determined to score big and it’s great value for us as batters. When you are on top of your game, making sure you are really hungry and making sure you put in big performances.”", "description": "India's Virat Kohli believes his mindset as a batsman changed after being handed the captaincy and the extra responsibility is the reason for his imperious run-scoring ability.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191013&t=2&i=1440371376&w=1200&r=LYNXMPEF9C0F4", "published_at": "2019-10-13"}