{"pub": "mirror", "url": "https://mirror.co.uk/money/woman-who-bought-house-19-20537609", "downloaded_at": "2019-10-08 15:14:14.884285+00:00", "title": "Woman who bought a house at 19 tells how she made her dream a reality", "language": "en", "text": "Get the biggest money stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA young woman who managed to buy her first home at just 19 has explained how she turned her dream into a reality, despite having minimal savings.\n\nApprentice, Megan Stafford, bought a two-bed townhouse in Rushcliffe, Nottingham, in April - but she says she stumbled onto the opportunity by accident.\n\nAt the time, she was working at estate agent Royston and Lund, where she found out about shared ownership - a scheme that allows you to get on the property ladder by buying just 25% of a home - which you can then extend by 'staircasing'.\n\nThe property set her and partner Dale Dickinson back £180,000 - and she says it's a dream come true.\n\nAfter leaving college, Megan started researching apprenticeship schemes where she first got a job at the property company.\n\nWhilst completing her apprenticeship, she became familiar with the process of buying a house where she discovered shared ownership.\n\n(Image: Getty)\n\nShared ownership is a Government-backed scheme that allows you can buy between a quarter and three-quarters of a property instead of the full amount.\n\nYou then rent the rest at a reduced rate - and since launching, it's been hugely popular for struggling first-time buyers.\n\nIn short, you pay a mortgage on a fraction of the property - typically 25% - and then rent plus interest to a housing association on the rest.\n\nBefore deciding if the scheme is for you though, you'll need to consider what you can afford, what deposit you can save and understand the monthly payment breakdown.\n\n\"Before leaving school I wasn't aware of shared ownership, despite it being a help to buy scheme regulated by the government. I think the ‘Help to Buy’ scheme is much more widely advertised than shared ownership,\" Megan explained.\n\n\"One of the things that put me off as a young first-time buyer was that I thought I would need to put down a large deposit when actually I found out I could put down as little as 5%.\n\n\"If more people knew how much money they could save through buying instead of renting, I think it would encourage them to explore this option.\"\n\n(Image: SUPPLIED)\n\nMegan and her boyfriend were living at home with their parents at the time - when they decided they wanted their own place.\n\nWith hard work and saving, by cutting back on non-essential items, the pair were able to put down a 5% deposit on a two-bed town house, priced at around £180,000.\n\nThey currently own 35% percent of the property value with the option to buy more in the future.\n\n\"There’s no timescale on saving money for a mortgage, but it is possible. Being aware of how much you want to save from the beginning really helps you stay on track and knowing you’ll be buying a house is a great incentive,\" she said.\n\n“If we hadn’t found out about shared ownership, we would still be living with family and struggling to save for a large deposit.”\n\nVal Shakespeare, director of estate agent Royston & Lund, said: \"For many young people who dreaming about getting on the property ladder, shared ownership might not be on their radar.\n\n\"However, buying your first home early is a brilliant step and can help you save money in the long run instead of trying to rent and save up for a deposit simultaneously.\"\n\nTalking about how first-time buyers can get on the scheme, Megan said it's important to get advice from the right people - and ask as many questions as you can.\n\n\"My advice for young first-time buyers would be to ask estate agents, financial advisors and/or solicitors as many questions as possible and make sure you shop around before you buy.\n\n\"Getting onto the property ladder can be difficult if you aren’t aware of what schemes are available. Many people my age are not ready to buy a property, but if you know what you want to achieve, anything is possible,” Megan said.\n\nAnd speaking on what she wishes she was warned about beforehand, Megan said it's worth looking into the time frames.\n\n\"The shared ownership process from start to completion day took three to four months but I have known the process to be a lot quicker than this.\n\n\"One of the reasons why it took longer was because my property wasn't built throughout the process I had to wait for it to be built.\"", "description": "Megan and her boyfriend were living at home with their parents until six months ago - when they decided they wanted their own place", "authors": ["Emma Munbodh", "Image", "Supplied", "Getty"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20537671.ece/ALTERNATES/s1200/0_THP_CHP_081019Slug_10517JPG.jpg", "published_at": "2019-10-08"}