{"pub": "marketwatch", "url": "https://marketwatch.com/story/no-slowdown-in-sight-investors-are-swapping-defensive-stocks-for-cyclicals-2019-10-29", "downloaded_at": "2019-10-29 15:08:46.583244+00:00", "title": "No slowdown in sight: Investors are swapping defensive stocks for cyclicals", "language": "en", "text": "Getty Images We said “cyclicals,” not “cycles!”\n\nAre we past the rough patch in markets? Investors may think so, if fund flows from last week are any indication.\n\nIn the week ending October 25, the bulk of investor money flowing into exchange-traded funds went to sectors that do better in a growing economy, while those favored in downturns saw outflows, according to a report from Jefferies Equity Research.\n\n“Although fund flows were muted this past week, under the surface we are seeing some significant changes,” said Jefferies strategist Steven DeSanctis.\n\nThe most recent week’s activity continues a trend that started earlier in the month, DeSanctis noted. Since October 4, funds with cyclical strategies have received inflows of $1.5 billion, while bond proxies have seen outflows of $1 billion.\n\nSee: It’s reflation that’s turning the ‘Great Rotation,’ these analysts say\n\nCyclical sectors include information technology, energy, and consumer discretionary stocks, among others. In the October 25 week, the SPDR S&P Oil & Gas Exploration & Production XOP, +0.85% fund had inflows of 2.3%, Jefferies noted.\n\nBond proxies, meanwhile, are relatively safe stock-market sectors that investors look to for income and stability, particularly during times of market volatility. Utilities and real estate are two of the most common proxies for bonds, but consumer staples, which can be defensive and often offer dividends, are sometimes lumped into the category. The Consumer Staples Select SPDR fund XLP, +0.20% saw outflows of 2% in the October 25 week, for example.\n\nRelated: Stock-market investors’ appetite for ‘bond proxies’ is waning\n\nMeanwhile, momentum funds lost money in the most recent week, adding to an overall loss of $714 million so far this year.\n\nInvestors prefer so-called momentum funds and stocks when they think the business cycle is in its later innings. In contrast to value plays, which require buying securities at low prices and waiting for them to blossom, momentum suggests buying assets whose prices have already been bid up, in the belief that others will pile into the same trade.\n\nRelated: What is factor investing?\n\nWhat is an ETF?\n\nWhat is asset allocation?", "description": "In a sign that investors see more upside for the business cycle, fund flows for October show money flowing out of sectors that do better in downturns for...", "authors": ["Andrea Riquier"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GI337_bicycl_ZG_20180501154204.jpg", "published_at": "2019-10-29"}