{"pub": "afr", "url": "https://afr.com/technology/apple-shares-rise-on-holiday-forecast-powered-by-watches-airpods-20191031-p53605", "downloaded_at": "2019-10-30 23:20:20.372729+00:00", "title": "Apple shares rise on holiday forecast powered by Watches, AirPods", "language": "en", "text": "In an interview with Reuters, Cook said that the revenue guidance was based on strong sales of services and wearables, as well as promising early sales for the iPhone 11, iPhone 11 Pro and iPhone 11 Pro Max released last month.\n\nCook said the forecast also reflects the company's belief that the United States and China will resolve their trade dispute.\n\n\"I don't know every chapter of the book, but I think that will eventually happen,\" Cook told Reuters. \"I certainly hope it happens during the quarter, but we'll see about that.\"\n\nThe forecast comes as Apple said it generated $US33.36 billion in iPhone sales for its fiscal fourth quarter ended in September, which compares with analyst expectations of $US32.42 billion, according to Refinitiv data.\n\nThe results mark the fourth straight quarter of year-over-year declining iPhone sales as the Cupertino, California-based company tries to shift its business away from reliance on the flagship product and toward a broader product mix.\n\nBut the above-expectations forecast for the holiday shopping quarter - traditionally Apple's biggest sales quarter of the year - suggested that Apple's price cuts on many iPhones were helping it regain momentum.\n\nIn September, the company unveiled a lineup that included the new iPhone 11 priced at $US699, $US50 lower than the debut price of its predecessor, the iPhone XR.\n\nAdvertisement\n\nMoreover, Apple has broken with its past practice of offering few discounts by continuing to run aggressive trade-in deals that lower upgrade prices for existing iPhone owners in the United States.\n\n\"The starting price of $US699 is a factor in bringing more people into the market and giving people just another reason to upgrade,\" Cook told Reuters. \"In China specifically ... we picked locally relevant price points that were more similar to the price points that had great success with earlier.\"\n\nApple's revenue is increasingly coming from accessories such as the Apple Watch and AirPods as well as new services such as its Apple Card credit card and a streaming television service set to begin on Friday.\n\nApple said its services and accessories segments generated $US12.51 billion and $US6.52 billion in fourth-quarter revenue, respectively, topping analyst estimates of $US12.15 billion and $US6 billion, according to Refinitiv data.\n\nApple now has 450 million subscribers to its own or third-party services on its devices, and sales of wearables were up 54 per cent versus the previous year.\n\n\"It was an incredible quarter for wearables,\" Cook said. \"It was a very broad range of services that set new all-time records, from our payment services to the search ad business to Apple Music, Apple Care, the App Store and cloud services - almost every kind of service we're in.\"\n\nApple also earlier this year lowered iPhone prices in China, which had risen beyond the reach of many buyers there because of currency fluctuations. The move helped slow mid-year sales declines for Apple in China, and Apple sales for its Greater China region dropped a relatively modest 2.4 per cent to $US11.13 billion in Apple's fiscal fourth quarter ended in September.\n\nAdvertisement\n\nApple's Cook said that iPhone sales in China ticked up toward the end of the quarter, which includes several days of sales of the new iPhone 11 models. Cook also said the company saw double-digit services revenue growth in China and wearables revenue in China grew at a higher rate than the companywide figure.\n\n\"IPhone had a remarkable comeback from the way we performed earlier in the year,\" Cook said.\n\nFor fiscal 2020 Q1, Apple expects gross margins between 37.5pc and 38.5pc, compared with analyst expectations of 37.55pc.\n\nApple's holiday-quarter forecast comes amid a trade conflict between the United States and China, where Apple assembles most of its products and where many of its suppliers are located. Tariffs on imports that would include Apple accessories took effect in September, though Apple has not said whether it has been affected or would pass the cost to consumers.\n\nTariffs might hit more categories of goods including Apple's iPhone on December 15, though US and Chinese negotiators were working to try to agree on a deal in time for US President Donald Trump and Chinese President Xi Jinping to sign in the coming weeks.\n\nApple said its revenue for the fiscal fourth quarter was $US64.04 billion, compared with analyst expectations of $US62.99 billion, according to Refinitiv data. Earnings per share were $US3.03 versus expectations of $US2.84.\n\nFor the fiscal first quarter of 2020, Apple said it expects gross margins of between 37.5 per cent and 38.5 per cent, compared with analyst expectations of 37.55 per cent. The company forecasted first-quarter operating expenses of $US9.6 billion to $US9.8 billion, compared with expectations of $US9.4 billion, and an effective tax rate of 16.5 per cent, compared to expectations of 16.49 per cent.\n\nReuters", "description": "CEO Tim Cook said revenue guidance for the current, crucial shopping quarter also reflected promising early sales for the new range of iPhone 11s.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.4657%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_232%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/fcd96bd1394fa7bf17253af6fe21c12340b3af96", "published_at": "2019-10-30"}