{"pub": "townhall", "title": "US Soccer Pushes Back, Claims Women Are Paid More Than Male Players", "url": "https://townhall.com/entertainment/cortneyobrien/2019/07/30/us-soccer-pushes-back-claims-women-are-paid-more-than-male-players-n2550894", "language": "en", "published_at": "2019-07-30", "downloaded_at": "2019-09-02 07:20:11.891946+00:00", "text": "Before we heard the surprising news on Tuesday that Jill Ellis is stepping down as the U.S. Women's National Soccer team coach, the U.S. Soccer Federation released a fact sheet to prove that it does not gender discriminate when it comes to salaries. Twenty-eight players on the USWNT sued US Soccer back in March claiming as such and demanding pay equity. A few months later, and the federation has released some statistics to upend their argument.\n\nAccording to US Soccer Federation President Carlos Cordeiro's numbers, the women are paid more than their male counterparts. There are a few factors to account for this. The ladies' contract, for instance, is operating under a different pay structure.\n\nGuaranteed salary for women—Under their CBA, the women have chosen to have a guaranteed salary; U.S. Soccer therefore pays each WNT contracted player a base salary of $100,000 per year.(In contrast, the men’s national team players have no guaranteed salary and are only paid for the training camps they attend and the games they play, plus game bonuses.)In addition, U.S. Soccer also pays WNT contracted players a $67,500-$72,500 salary for playing in the National Women’s Soccer League.(In contrast, we do not pay salaries for men who play in Major League Soccer or any other men’s professional league).In other words, U.S. Soccer guarantees WNT contracted players who also play in the NWSL a base salary of $167,500-$172,500 per year, atop which they can earn game and tournament bonuses.Again, although players on our Men’s National Team can earn larger bonuses, they are guaranteed nothing; they have a different contract structure.\n\nThe women, Cordeiro added, also have guaranteed benefits, including fully-paid health, dental and vision insurance, severance, a 401(k) retirement plan, paid maternity leave, and childcare assistance.\n\nThe only pay inequity the USSF did find was when it came to FIFA prize money. But, as they note, that's out of their hands.\n\nUSWNT spokeswoman Molly Levinson issued a quick retort.\n\n\"The numbers the USSF uses are utterly false, which, among other things, inappropriately include the NWSL salaries of the players to inflate the women's players' compensation,\" she said, according to ESPN. \"Any apples-to-apples comparison shows that the men earn far more than the women.\"\n\nUSWNT players like Megan Rapinoe will tell you the same thing. Since winning the 2019 World Cup with her teammates on July 7, Rapinoe has been meeting with U.S. lawmakers in her campaign to win her fellow female soccer players more money. If nothing else, she appears to have the fan support. After the championship game in France earlier this month, the crowd could be heard chanting, \"equal pay!\"\n\nThe USWNT is currently gearing up for its 5-game victory tour, which kicks off on August 3 against the Republic of Ireland. Ellis will be sticking around until then.", "description": "Before we heard the surprising news on Tuesday that Jill .09/02/2019 3:20:11AM EST.", "authors": ["Cortney O'Brien", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/191/a6c10740-52bf-4614-b11b-ea0b7fa723e1.png"}