{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Wellness/workout-apps-fit-fall/story?id=58051386", "downloaded_at": "2019-09-25 08:44:35.204335+00:00", "title": "5 workout apps to keep you fit through fall", "language": "en", "text": "So you’ve been working on that \"summer bod,\" but alas, winter is coming, yet again. Just like choosing a gym or a trainer or a class, it can be pretty daunting to sift through the many fitness apps out there.\n\nHere are five fitness apps guaranteed to keep you focused on being fit through fall. There's a host of new innovative options out there, including audio-guided fitness and live classes built for every fitness goal imaginable.\n\nRUNKEEPER\n\nWith over 50 million users in their running community, Runkeeper not only tracks your runs and workouts, it helps you set realistic goals. You can save and discover new running routes, compare your progress against your friends, and the app integrates with your Spotify playlists. Ideal for hiking, walking or training for an endurance run, Runkeeper has built-in push notifications that appear based on when you’ve used the app most and when you've have had the most success completing and exceeding your goals.\n\nThe basic app download comes with the ability to track and log your activities. Weather insights, live tracking and prescribed workouts are included with the premium version.\n\nhandout\n\nAAPTIV\n\nExtra motivation to the beat of your favorite jams -- AAPTIV sports trainers paired with music’s top artists to give you a “perfectly timed and paced workout.” You can choose a workout based on duration, trainer or music, and the app will help you find programs and workouts based on your fitness goals. The audio-led instruction under hit music certainly brings a different energy than having to keep your eyes glued to a screen.\n\nAAPTIV comes with a 30-day free trial and then you’re billed $14.99 monthly for unlimited workouts.\n\nAaptiv Inc.\n\nPELOTON DIGITAL\n\nNo bike? No problem! Peloton Digital has become a one-stop destination for \"best-in-class fitness,\" enabling a larger audience to be part of their Peloton community. In the Digital subscription, there’s a mix of cycling, running, boot camp, floor and outdoor workouts -- up to 20 live studio classes daily, all available without needing Peloton “hardware”: a bike or treadmill. If you do have one of the two pieces of Peloton hardware, the digital membership is included.\n\nThe free trial doesn’t start until your first workout and the monthly subscription is $19.49.\n\nPeloton Interactive, Inc\n\nNIKE+ TRAINING CLUB\n\nNike joins the spectrum of fitness apps providing audio-guided workouts that keep you focused on accomplishing your fitness goals, no matter how demanding those goals are. Nike Training Club boasts over 100 workouts lead by their own Nike trainers and athletes. Workout options as short as 15 minutes adapt with the app -- amping up a workout if you’ve been hitting your goals. If you choose a workout plan in the app, it will incorporate specific workouts into that plan. An extra benefit of the app is that you can add your own activities and exercises that you might do outside of what the app offers, letting you track your fitness and workouts in a more wholesome way. The app also connects with Apple’s Health app, where you can stay on top of your workouts and Activity Rings.\n\nThe app is free and partners with the Nike+ Run Club app.\n\nNike Inc.\n\nCLASS PASS LIVE\n\nBacked by the popular Class Pass program offered in over 50 cities across the country, Class Pass Live lets you now take these classes wherever you are. It’s available as a monthly subscription and once purchased, you’ll be sent a \"Starter Kit,” with a Google Chromecast and heart rate monitor. What’s more, no matter if you are taking a live class or an on-demand class, your live metrics and where you land on the leaderboard for your class will still show up.\n\nClass Pass Live offers a 30-day free trial. After that it's $15 a month plus a one-time $70 for the Starter Kit. If you already have a Google Chromecast, the Starter Kit fee is only $40.\n\nClass Pass Live\n\nEditor's Note: This story was originally published on October 2, 2018.", "description": "Like choosing a gym or trainer or class, it can be pretty daunting to sift through the many fitness apps out there.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Health/fitness-gty-rc-180927_hpMain_16x9_992.jpg", "published_at": "2019-09-25"}