{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/21/india-visa-workers-raise-funds-to-launch-attack-ads-on-u-s-politicians", "downloaded_at": "2019-10-22 13:32:11.006380+00:00", "title": "India’s Visa Workers Raise Funds to Launch Attack Ads on U.S. Politicians", "language": "en", "text": "India’s contract workers in the United States are raising funds to run attack ads against the Democrat Senator who is blocking their demand for fast-track green cards.\n\nThe fundraising campaign is being run by an Indian-run group titled Immigration Voice, and it is targeting Illinois Democrat Sen. Dick Durbin.\n\nDurbin is being targeted because he is blocking Utah GOP Sen. Mike Lee’s S.386 green card giveaway bill, which would put roughly 300,000 imported Indian workers and their families on a fast-track to green cards.\n\nBut Durbin is not trying to protect U.S. college graduates from the roughly 800,000 Indian college graduates imported by the U.S.-India Outsourcing Economy. Instead, Durbin is using the promise of green cards for cheap Indian workers as a carrot to have business groups pressure the GOP into approving an amnesty, perhaps in 2021.\n\n“I think it is outrageous to see those attacks on a U.S. Senator Durbin by these people,” said Dawn Collins, an American tech professional who helped found Protect US Workers and who is opposing Lee’s giveaway bill.\n\n“They’re not even citizens, but they have been given so much by the United States, and yet they come in demanding all the [employer-nominated] green cards for the next ten years,” she said. “It completely outrageous and it is racist towards the rest of the world,” which would be denied green cards until all the Indian visa workers and their spouses — perhaps 800,000 Indians — get the cards they were deceptively promised by outsourcing employers, she said.\n\nImmigration Voice posted its fundraising pitch on Fundrazr.com and quickly raised $124,000 from 1,416 contributors, nearly all of whom are working in the high-tech jobs taken from American graduates.\n\nA group of 60 Chinese investors who are trying to buy citizenship via the EB-5 program also added $2,800, or $47 per citizenship.\n\nThe donors’ funding implied agreement with the IV’s pitch, which said Durbin is “misinformed” and hostile to the Indian contract workers:\n\nAs more reasonable people find out that Senator Dick Durbin has been attacking Indian immigrants over the years, they are speaking-up and asking him to stop his racial overtones. With this aim in mind, we are launching a campaign to tell more people the truth about Dick Durbin’s anti-Indian immigrant position during his time in the Senate.\n\nThe appeal, which is written by Indians and which reflects India’s caste-vs-caste political rivalries, says Durbin “resents” the Indian contract workers who would benefit from Lee’s giveaway bill:\n\nThough Senator Durbin gets furious and red-faced whenever anyone tries to add our kids, who are in danger of losing their legal status once they age out in the backlog, to his Dream act so that they too have legal protection once they age out—he has no trouble or shame sabotaging this bill because he resents the people who it will help, which includes children like Manhitha, Uma Shreya, and Ankitnoor.\n\nIndian workers cheered the appeal. Anonymous and named contributors wrote: “I need to contribute to my fellow [Indian] citizens,” “Screw Dick,” “In IV We Trust,” and “Together we will win!”\n\n.@SenatorDurbin from here you have two options either you remove the hold one s386 or we will escalate our campaign. Every day more and more volunteers are joining the demand for fairness. The best things is the ball is in your court. — Nagendra Chakka (@nagi1) October 22, 2019\n\nThe Chinese donors added their message: “ This is a grassroots donation pooled together by 60 Chinese EB5 investors. We believe S386 and Green Card equality will prevail. Together we will witness the end of birthplace discrimination.”\n\nThe Chinese group contributed because Mike Lee’s bill also opens up a fast-track for wealthy Chinese to get green cards. His change would help the real estate industry, which is allowed to use the EB-5 fees as construction loans. That business is now blocked because the backlog of Chinese investors waiting for visas means the investors cannot provide fast-track green cards to the next wave of Chinese buyers.\n\nOne Indian donor, Hildingur Mahanti, contributed $1,000 and amplified his call on Twitter:\n\nWith the excitement of the ad & the fundraiser, don’t forget to call the Racist from Illinois tomorrow. Maximum Pressure until he lets our bill go! https://t.co/nIw2uoLF1y — Hildingur Mahanti (@thehildingur) October 21, 2019\n\nThe Indians want the funds to buy more advertising against Durbin.\n\nBut several groups of U.S. professionals are setting up a fundraising campaign to protect Americans from the outsourcing industry. They include Collins Protect U.S. Workers, as well as White-Collar Workers of America, the American Workers Coalition, and Progressives for Immigration Reform, which raises funds at the U.S. Tech Workers site.\n\nOn October 20, Immigration Voice bought a half-page ad in the Chicago Tribune to portray their cause as merely an effort to help unlucky children.\n\nSome media outlets are willing to portray the Indians’ hard-edged campaign for fast-track green cards as merely an effort to aid stranded children. This campaign would deny green cards to people from everywhere else in the world for several years, but Daniel Block at Washington Monthly accepted the script:\n\nDisha Kanekar came to the United States from India when she was six years old. Her mother had just gotten a job as an IT consultant near New York City, so the family relocated to New Jersey. At the time, Kanekar didn’t understand why they had moved. “I was just a little kid,” she said. Her attention was instead focused on typical childhood activities—going to school, playing, making friends. She knew little about her family’s immigration status, let alone her own. “I just made a home for myself here,” Kanekar, now eighteen, told me. “I never thought I would have to go.” But, after graduating from high school this past summer, she found herself with little choice. Kanekar’s … visa doesn’t expire until she turns twenty-one, it also doesn’t allow her to work here.\n\nIn reality, the fight over India’s contract workers will have a huge impact on the nation’s economy, on millions of college graduate Americans, and on millions of their children.\n\nWatch GOP Sen. Mike Lee publicly urge Indian contract-workers to lobby US Senators for a bill offering fast-track citizenship to Indian grads if they take jobs (at low wages) from US grads. No GOP Sen. has rebuked him & no anti-GOP journos 'pounce.' Weird. https://t.co/A5VOsuyOVt — Neil Munro (@NeilMunroDC) October 18, 2019\n\nThe U.S.-India Outsourcing Economy:\n\nRoughly 800,000 Indian college graduate visa workers now hold a wide variety of U.S. jobs in technology, health care, accounting, and business. Moreover, these visa workers have helped to move more than one million additional U.S. jobs back to teams of graduates working in India.\n\nThis onshore/offshore process is described in a discrimination lawsuit against one of the Indian-owned outsourcing firms, Larson & Toubro Infotech.\n\nThe firm won a technology support contract from Iconix Brand Group Inc. in New York. The support was managed by one American employee of Larson & Toubro, according to the lawsuit filed by the D.C. firm of Kotchen & Low. The single American ran a New York team, which consisted of roughly eight Indians who likely arrived with H-1B work visas, the lawsuit says. But the single American also ran a team of 20 Indians in India, and he reported to two Indian managers in India. So the visa programs allowed the Indian company to take roughly 30 good jobs from U.S. white-collar workers with just eight visas, according to the lawsuit.\n\nThe lawsuit noted that “from 2013 to 2018, LTI received 9,785 new H-1B visas (or visa amendments) and almost 200 new L-1 visas (or visa amendments) – far more positions than could actually exist given that LTI only employs about 7,500 employees in the U.S.” The surplus of visa workers allows the company to sideline American job seekers and instead hire lower-wage Indian visa workers.\n\nThe use of cheaper Indian labor created payroll savings for Iconix and profits for Larson. In turn, those profits boosted the company’s stock values for U.S. investors, including the Vanguard International Stock Index.\n\nThis outsourcing economy has helped to deny jobs to millions of American graduates and to cut salaries earned by American graduates, both young and old, just as blue-collar wages crashed when U.S. investors used free-trade rules to transfer factories workers into China. The outsourcing pressure helps to explain why white-collar salaries are growing slower than wages for blue-collar jobs in President Donald Trump’s economy.\n\nIn fact, the U.S.-India Outsourcing Economy has grown so much that it has clogged the U.S. immigration system. The clog is forcing many of the contract workers to wait more than a decade to get the green cards they were promised by employers in exchange for taking Americans’ jobs.\n\nThat long wait helps the companies by keeping their many contract workers stuck in their jobs, tied to their employers — often at substandard wages.\n\nBut the long wait also makes it difficult for outsourcing companies to recruit more Indian workers. After all, fewer Indians will sign up for the outsourcing industry if the companies cannot deliver the fast-track green cards.\n\nThat green card clog is also a huge problem for India’s government because its entire economic strategy is built around the export of workers into foreign economies.\n\nMany high-tech companies and investors want India’s government to help them get into Indian’s growing marketplace, especially as the trade war with China heats up. So Amazon’s Jeff Bezos, Facebook’s Mark Zuckerberg, and Apple’s Tim Cook, and many other corporations are working with GOP Sen. Mike Lee to unclog the outsourcing and recruiting process by removing the “country caps” that delay the award of green cards to Indian visa workers.\n\nThe pipeline of Indian workers into the United States is built on the H-1B program.\n\nThe H-1B program is uncapped for non-profit employers, but companies can get 85,000 new H-1B workers into the United States per year. Each H-1B worker must go home after six years, so capping the companies’ workforce of H-1B workers at around roughly 480,000 workers. That workforce provides companies with roughly equal to one Indian worker for every nine Americans who graduate with skilled degrees each year.\n\nBut that resident H-1B workforce is just a start.\n\nIn 1990, Congress decided to let workers in the H-1B program — and in the smaller, lesser-known L-1 program — to apply for green cards. This 1990 decision created the huge citizenship prize, which is pulling many Indians into the H-1B program and ensuring they will brave low wages, tough conditions, and often illegal working conditions to win the prize.\n\nFew Americans appreciate the huge value of green cards and citizenship. Yet Congress allows U.S and Indian investors to freely trade this citizenship prize to 10,000 Indian graduates every year in exchange for a decade or more of profitable work. Of course, millions of foreigners will accept that giveaway deal — and millions of foreigners feel a moral duty to shove Americans out of their jobs, homes, and careers so they can grab the fantastic prize for their spouses, children, and grandchildren.\n\nLee’s bill will allow companies to make that barter with roughly 60,000 Indian graduates per year, up from 10,000 per year under current “country cap” rules.\n\nGOP Sen. Kennedy blocks Dem Sen. Durbin's bill to skyrocket transfer of US college-jobs to Indian grads. Durbin's plan is much worse than Sen. Mike Lee's @S386 for US college grads & families. Part-Kabuki, but estb. journos act like frogs in a boiling pot. https://t.co/ZktjKG04MR — Neil Munro (@NeilMunroDC) October 17, 2019\n\nBut the federal government has quietly created many other programs that allow foreigners to easily take jobs in the United States, regardless of whether Americans want those jobs.\n\nFederal law allows an unlimited number of Indians to get jobs in the United States via the B1 visa for foreign workers, the TN program for businesses based in Canada and Mexico, as well as the uncapped “Optional Practical Training” and “Curricular Practical Training” work permit programs for foreign students and graduates at U.S. colleges.\n\nThe mass of OPT and CPT workers in the United States have their own sweatshop economy, where they crowd into shared housing while they work as temporary contract workers for the middlemen subcontractors, which are quietly hired by brand-name Fortune 500 firms. But many Indian graduates do not want to join the OPT sweatshop economy — unless they can also get promoted into the L-1 or H-1B program to get green cards.\n\nSo if Lee unclogs the green card pipeline, then more Indian graduates will flood into the feeder pipelines created by the B-1, TN, OPT, and CPT programs so they can get green cards after being promoted into the L-1 and H-1B programs.\n\nCurrent data shows that roughly 800,000 Indians work in the United States — including many who are working-and-waiting for more than 15 years to get one of the 10,000 green cards issued to Indians each year. If companies can offer 60,000 cards a year, then more Indians will rationally work-and-wait for those cards.\n\nU.S. companies will also use those extra Indians to move more jobs back to India.", "description": "India's visa workers in the U.S. are raising funds for attack ads against the Senator who is blocking their push for fast-track green cards.", "authors": ["Neil Munro"], "top_image": "https://media.breitbart.com/media/2018/08/Indian-High-Tech-Workers-Associated-Press.png", "published_at": "2019-10-21"}