{"pub": "financialpost", "url": "https://business.financialpost.com/news/retail-marketing/new-shareholder-calls-bakers-hbc-offer-clearly-inadequate", "downloaded_at": "2019-10-05 05:47:04.639251+00:00", "title": "New minority shareholder calls Baker's HBC offer 'clearly inadequate'", "language": "en", "text": "A minority shareholder of Hudson’s Bay Co. is asking the special committee of the company’s board to get an appraisal of the retailer’s “incredibly valuable” real estate and take other measures “to ensure that minority shareholders receive fair value for their investment.”\n\nThe special committee of directors is in the midst of evaluating a $9.45 a share privatization proposal from a group led by HBC chairman Richard Baker.\n\nParadise Developments, a Toronto-based private equity investment and real estate development company that became a shareholder of HBC in August and owns 1. 2 million common shares, called the Baker group’s offer “clearly inadequate.”\n\n“At $9.45 per share, the … offer doesn’t come close to cover the value of HBC’s real estate and any of its upside potential, which may be realized through development, joint ventures and spinoff scenarios,” Paradise Developments said in a letter to the special committee, which it made public on Wednesday.\n\n“If we are to be deprived of the opportunity to participate in this upside due a takeover of the company, then we, and indeed all minority shareholders, have a right to be adequately compensated by receiving a fair price for our shares.”\n\nHBC’s real estate has drawn keen interest from several minority shareholders critical of the Baker group’s bid, including activist shareholder Jonathan Litt, whose Land & Buildings Investment Management has been a long-time critic of Baker’s stewardship of the retailer. The iconic Canadian retail chain has stores in historic buildings in the heart of downtown shopping districts across North America.\n\nThe group led by Baker that is proposing to privatize Hudson’s Bay owns about 45 per cent of HBC’s issued and outstanding common shares. A majority of the remaining issued and outstanding common shares would be needed to vote down the privatization proposal. The Baker group has a majority stake in HBC on a fully diluted basis, which includes convertible preferred shares.\n\nThe letter from Paradise Developments says the investment and development firm believes HBC is worth “a significant premium” to what the Baker group has offered, and urges the special committee to direct its advisors J.P. Morgan Securities and Centerview Partners LLC to prepare or obtain an appraisal of the real estate owned by the company.\n\nThe letter also urges the committee to ensure that the advisors’ valuation of the company “incorporates the imminent and material value and benefits which can be realized through development, joint ventures and potential spin-off of the real estate assets … whereby ALL shareholders can realize the maximum value they are entitled to.”\n\nIf we are to be deprived of the opportunity to participate in this upside due a takeover of the company, then we, and indeed all minority shareholders, have a right to be adequately compensated… Paradise Developments' letter to the special committee\n\nIn August, Litt’s Land & Buildings published an open letter to shareholders calling the price tag attached to HBC shares by the Baker-led buyout group “woefully inadequate.”\n\nPrivate equity firm Catalyst Capital, meanwhile, disclosed in August that it had acquired more than 18 million shares in HBC for an average price of $10.11. A September regulatory filing revealed Catalyst had accumulated a stake just shy of 16 per cent of HBC’s common shares.\n\nIn public statements, Catalyst has said the firm is committed to working with the special committee and HBC’s board, but is pushing the firm “to seek out every alternative that can maximize value for all shareholders, whether through a sale process, dividend distributions of the cash to be realized from the sale of the company’s key European assets or otherwise.”\n\nLitt’s group has been more forceful, calling for Baker’s removal from the board over the privatization proposal.\n\nA spokesperson for Baker’s group declined to comment on the letter sent to the special committee by Paradise Developments.\n\nA representative of Sard Verbinnen & Co., the New York-based public relations firm representing HBC’s special committee, also declined to comment.", "description": "Paradise Developments: 'Offer doesn’t come close to cover the value of HBC’s real estate and any of its upside potential'", "authors": [], "top_image": "https://financialpostcom.files.wordpress.com/2017/10/hudson_s_bay-2.jpg", "published_at": "2019-10-02"}