{"pub": "cnbc", "url": "https://cnbc.com/2019/10/03/plunge-in-mortgage-rates-could-save-homeowners-and-buyers-big-money.html", "downloaded_at": "2019-10-03 23:28:27.510263+00:00", "published_at": "2019-10-03", "title": "New plunge in mortgage rates could save borrowers thousands of dollars", "language": "en", "text": "Fall homebuyers are getting a bonus. The sell-off in the stock market is causing an unexpected turnaround in mortgage rates.\n\nMortgage rates fell throughout much of the summer but then made a sharp jump higher in September. Now rates are headed back down, along with the Dow Jones Industrial Average, which fell more than 800 points total on Tuesday and Wednesday, the two first days of October.\n\nThe average rate on the popular 30-year fixed mortgage was at 3.75% last Friday. By Thursday, it had dropped to 3.62%, according to Mortgage News Daily. This is an average for borrowers with solid credit scores and at least a 20% down payment.\n\nMore dramatic is the comparison with a year ago. Rates are now about 1.25 percentage point lower than they were at this time last year. For the average borrower taking out a $300,000 mortgage, that is a savings of about $225 on the monthly payment, or $2,700 per year. That is big savings for borrowers refinancing their loans, and it gives buyers significantly more purchasing power in an already pricey housing market.\n\nLower rates are already boosting sales for the nation's homebuilders. Lennar posted higher-than-expected new orders in the third quarter as interest rates dropped.\n\n\"The market for new homes has been improving from last year's pause, as lower interest rates have stimulated demand and improved affordability, while the overall fundamentals of the economy have remained strong,\" Lennar Executive Chairman Stuart Miller said on a call with analysts.\n\nHe also said low rates outweighed concern over a potential recession.\n\n\"I know that there is a lot of question about upcoming potential recession and things like that. Our customers don't seem to be viewing it that way, and I think that the housing market in general seems solid and strong and continuing to improve,\" Miller added.\n\nAt an open house in Atlanta last weekend, buyers definitely had mortgage rates in mind. The home was listed at $215,000, just below the national median price. That made it ripe for both first-time buyers and investors.\n\n\"You can't beat a good rate, especially with the speculating of a pending bubble burst. I think now is a good time to get in if you're looking to purchase a property,\" said Andrew Hughes, a real estate investor touring the home.\n\nNadia and Bryant Mormon want to stop wasting money on their rental and make a solid investment. They see an opportunity with low rates and a slight cooling in home price appreciation.\n\n\"If you're waiting, waiting, oh this might happen, or that might happen, it would be a year, 2 years from now, and this beautiful home that's at a very affordable price point now will be $300,000, and then it's out of your budget,\" said Bryant. \"You can't be paralyzed by what may happen and what may not happen.\"\n\n\"You can't be paralyzed by fear, that's for sure,\" added Nadia.\n\nHome prices are still rising, but the gains have been cooling. More demand could reheat those gains again, especially given the low supply of homes for sale.\n\nMortgage applications to refinance a home loan jumped 14% last week, according to the Mortgage Bankers Association. That was before the move even lower this week. Most lenders recommend that if a borrower can lower their rate by at least 75 basis points, a refinance is probably worth the work and the fees.\n\nMortgage rates generally follow the yield on the 10-year Treasury, which is now the lowest in about a month. Friday's monthly employment report could push it even lower or just the reverse, depending on what the report says about the strength of the economy.", "description": "Fall homebuyers are getting a bonus. The sell-off in the stock market is causing an unexpected turnaround in mortgage rates.", "authors": ["Diana Olick", "In Dianaolick"], "top_image": "https://image.cnbcfm.com/api/v1/image/103733398-GettyImages-486088999.jpg?v=1570118434"}