{"pub": "dailymail", "url": "https://dailymail.co.uk/money/news/article-7518315/UKs-pensions-bail-fund-faces-huge-bill-European-Court-Justice-ruling.html", "downloaded_at": "2019-10-05 06:01:31.796260+00:00", "title": "UK's pensions bail-out fund faces huge bill after European Court of Justice ruling", "language": "en", "text": "Britain’s bail-out fund for final salary pension schemes could face ruinous costs as a result of an obscure European Court of Justice (ECJ) ruling.\n\nOliver Morley, chief executive of the Pensions Protection Fund (PPF), warns that if the ECJ decision goes the wrong way then the fund, which is well-financed, could face a bill for tens of billions of pounds.\n\nIt would be a major blow for the PPF, which has been very successful in preventing tens of thousands of workers and pensioners from falling into poverty in their old age.\n\nBritain's Pensions Protection Fund could face a bill for tens of billions of pounds after a European Court of Justice (pictured) ruling\n\nThe fund was set up to protect employees whose firms go under after the scandal over the late newspaper baron Robert Maxwell’s pension fund, which left members facing the loss of their entire nest-eggs.\n\nUnder the European Union’s 2002 Insolvency Directive, to which Britain is a party, the rules governing the pension lifeboat fall under the jurisdiction of Brussels and the European courts.\n\nAt the moment, the PPF cuts the pensions of those who have not yet retired by 10 per cent. Those who are already receiving their pension will normally continue to be paid in full.\n\nThis 10 per cent haircut was applied to employees in most of the 13 funds for Carillion employees, and to thousands of others whose employer has gone under leaving a black hole in the pension fund.\n\nThe PPF is financed by a levy on company pension funds. At the moment, it has plenty of money at its disposal to meet obligations to current and future pensioners. But top brass fear a case brought by Gunther Bauer, a worker for a defunct German company, could prove devastating for its finances.\n\nThe Bauer case – which is before the ECJ in Luxembourg – asserts that under human rights law and the Insolvency Directive, pension bail-out funds have no right to cut benefits and should pay in full.\n\nIf successful, the PPF would be required not just to upgrade future payments by 10 per cent but also, at huge cost, to back date to the date when schemes entered the PPF.\n\nMorley admitted such a verdict would benefit retirees. ‘If you are a pensioner you would see the ECJ coming in as a white knight’, he said, even though it would cast a cloud over the future of the fund.", "description": "Oliver Morley, chief executive of the Pensions Protection Fund warns that if the ECJ decision goes the wrong way then the fund could face a bill for tens of billions of pounds.", "authors": ["Alex Brummer For The Daily Mail", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/09/29/20/19081608-0-image-a-7_1569785502328.jpg", "published_at": "2019-09-29"}