{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7626879/Kim-Kardashian-sisters-Khloe-Kourtney-unveil-fragrance-collection.html", "downloaded_at": "2019-10-30 00:14:27.748515+00:00", "title": "Kim Kardashian and sisters Khloe and Kourtney unveil fragrance collection", "language": "en", "text": "She released her first perfume under KKW Fragrance on November 23, 2017 with a trio of scents: Original, Oud and Citrus.\n\nAnd two years later, Kim Kardashian announced her latest fragrances - with the help of her sisters Khloe and Kourtney Kardashian.\n\nThe collaboration, called the Diamonds Collection by Kourtney x Kim x Khloe, was revealed alongside a snap from the photo shoot - with Khloe rocking brunette tresses.\n\nWow: im Kardashian announced her latest fragrances - with the help of her sisters Khloe and Kourtney Kardashian; The collaboration, called the Diamonds Collection by Kourtney x Kim x Khloe, was revealed alongside a snap from the photo shoot - with Khloe rocking brunette tresses\n\nThe reality star, 39, revealed the big news on Tuesday morning with the stunning snap, adding in the caption: 'I'm so excited to announce the new @kkwfragrance Diamonds Collection by Kourtneyt X Kim X Khloe!!!'\n\nAdding: 'This collection is really special because it's the first fragrance collaboration I've done with Kourtney and Khloe for my line. Each of the fragrances really capture us individually.'\n\nKim continued: 'My scent is fresh and floral and becomes warmer as I wear it throughout the day. I can't wait for you guys to smell how amazing these scents are!!!'\n\nThe mother of four added that the new Diamonds Collection is set to launch on November 8, 2019 at 12 pm PST at KKWFragrance.com.\n\nGorgeous: The collaboration, called the Diamonds Collection by Kourtney x Kim x Khloe, was revealed alongside a snap from the photo shoot - with Khloe rocking brunette tresses\n\nKim stands in the center of the Diamonds Collection shoot while rocking an off-white turtleneck jumpsuit; Kourtney poses in a cream one-piece and Khloe in a pink one.\n\nThe three sister sport matching wild curls and coordinating smoky eye makeup wtih nude lipstick.\n\nKhloe, who is known for rocking her blonde tresses, donned a brunette wig for the shoot.\n\nKim later tweeted out: 'I love Khloe as a brunette! I love that she changed it for this shoot! #DiamondsCollection #KKWFragrance.'\n\nSo fun: Kim loved Khloe's locks for the glamorous shoot\n\nKim's fragrance is called the Diamond, and is described as a 'fresh white floral bouquet: 'Dripping in diamonds. Catching the light in ways you've never dreamed of, white diamonds is the ultimate self-indulgence.'\n\nThe Diamond fragrance has a base of coconut milk cream, heavenly white musk and solar white floral; it opens with a signature, tropical floral faceted with notes of wild armoise and sugar-coated ginger.\n\nThe heart of the fragrance features a bouquet of ylang, orange flower and sampaguita bloom.\n\nKhloe's, which is a pink hue, is described as a transparent floral bouquet: 'pink diamond lights us a room with hues of soft, romantic pink and nuances of sheer sensuality.'\n\nFamily: Adding: 'This collection is really special because it's the first fragrance collaboration I've done with Kourtney and Khloe for my line. Each of the fragrances really capture us individually'\n\nKhloe, 35, took to her Instagram to describe her namesake fragrance in the collection: 'I wanted to create a fragrance that feels feminine, sexy and strong when I wear it. It's such a dreamy scent with a mix of sweet florals and musk that can be worn from day to night. I've been wearing this non-stop and love it more and more every day.'\n\nHer pink diamond fragrance has a base of cloud musks, white moss and sundrenched driftwood; it opens with Italian bergamot with a heart of jasmine, lilac and tuberose.\n\nKourtney's, which is a yellow hue, is described as 'a sparkling oriental gourmand': 'Drenched in radiance. A dazzling extraordinary yellow light that radiates with a captivating intensity that sparkles only the way a diamond can.'\n\nKourtney, 40, wrote on her Instagram: 'Working with my sisters for this collection was so nostalgic. Fragrance is so personal, so being able to create my own scent from start to finish was an exciting experience. I wanted to created a vibrant one that matches my classic, playful vibe. The combination of Golden Berries, Jasmine and Vanilla is refreshing.\n\nKourtney's yellow diamond has a base of Tonka bean, whipped vanilla and patchouli while opening with golden currant berries; the hear of the fragrance is jasmine, iris and magnolia.\n\nEach fragrance in the Diamonds Collection retails for $40 but you can buy the trio bundle for $110, which saves you $10.\n\nHere it is: Each fragrance retails for $40 but you can buy the trio bundle for $110, which saves you $10; from L To R: Kourtney's fragrance, then Kim's and finally Khloe's\n\nKim's last KKW Fragrance launch was in mid-September with her candle, inspired by her favorite scent she has made - Crystal Gardenia.\n\nShe released the Crystal Gardenia Collection on November 23, 2017 with three fragrances: Original, Oud and Citrus.\n\nKim previously worked with sister Kylie Jenner, 22, for a fragrance collaboration that launched in August.\n\nThe Kylie Jenner By KKW Fragrance featured three scents - all in bottles shaped like lips; the red, pink and nude scents each retails for $40.\n\nLast month, Kim launched her new shapewear line - Skims Solutionwear; she released her first products on September 10 on Skims.com.\n\nSmells like success: Her last KKW Fragrance launch was in mid-September with her candle, inspired by her favorite scent she has made - Crystal Gardenia\n\nFragrant: She released the Crystal Gardenia Collection on November 23, 2017 with three fragrances: Original, Oud and Citrus\n\nPose: Kim previously worked with sister Kylie Jenner for a fragrance collaboration that launched in August\n\nCreative: The Kylie Jenner By KKW Fragrance featured three scents - all in bottles shaped like lips; the red, pink and nude scents each retails for $40\n\nAccording to TMZ, Kim made $2 million in just the few minutes after the launch of Skims; all of the pieces sold out on launch day but has since been restocked.\n\nSince then, she has expanded the brand to bras and underwear as well as a cotton collection.\n\nIn addition to KKW Fragrance and Skims, Kim also has KKW Beauty; she launched her KKW X Winnie Harlow makeup collection last month under her KKW Beauty brand.\n\nKylie has worked with Kim, Khloe and Kourtney separately for collections for her Kylie Cosmetics brand.\n\nEntrepreneur: Her new candle comes just after she launched her new shapewear line - Skims Solutionwear; she released her first products on September 10 on Skims.com\n\nExpanding her brand: Since then, she has expanded the brand to bras and underwear as well as a cotton collection\n\nPose: In addition to KKW Fragrance and Skims, Kim also has KKW Beauty; she launched her KKW X Winnie Harlow makeup collection last month under her KKW Beauty brand", "description": "She released her first perfume under KKW Fragrance on Nocember 23, 2017 with a trio of scents. And two years later, Kim Kardashian announced a new collection.", "authors": ["Sarah Sotoodeh For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/16/20335830-0-image-a-14_1572367031892.jpg", "published_at": "2019-10-29"}