{"pub": "townhall", "url": "https://townhall.com/columnists/kurtschlichter/2019/10/07/liberals-hate-free-speech-when-we-presume-to-use-it-n2554237", "downloaded_at": "2019-10-07 04:08:31.862226+00:00", "title": "Liberals Hate Free Speech When We Presume To Use It", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nI have a confession to make: I hate the pseudo-conservative scribblings of David French with the same kind of smoldering loathing I reserve for foot fungus, movies about spunky young women who triumph over the patriarchy, and the music of Maroon 5. With rare exceptions explicable due only to the vagaries of chance, I hate his prose, his premises, his conclusions and his insufferable fussiness. I contend that his writings are fit only to be served up to traitors and terrorists at Gitmo to wring out confessions, and the only thing I enjoy about his terrible, terrible views is that they validate my longstanding negative impression of Army JAGs. But it has never occurred to me that David French should be barred from writing whatever the hell he pleases.\n\nThe whole idea that, simply because his opinions make me long for the joyous peace of death, he should be in any way prevented from sharing them with those people who inexplicably wish to endure them, and those unfortunate enough to stumble upon them unawares, is utterly foreign to me and to all actual conservatives. Censorship, to us, is both alien and appalling, like an Oberlin College feminist hot oil twerk-off.\n\nWe default to free speech. Until recently, we just sort of assumed the First Amendment would always be a thing, with a few infamous exceptions in academia. But now our whole country seems to be morphing into one big college campus, albeit one with a much lower admission standard than our universities.\n\nBasically, the admission standard for our country is that you sneak over the border, which brings us to our first example of the new speech gestapo-ization of America. In New York, some sort of government “human rights” agency has decreed that calling illegal aliens “illegal aliens” is a crime. You can be charged for saying something, just like in grim police states such as Cuba, Red China and the UK.\n\nSimilarly, Scat Francisco decided to officially label the NRA a “terrorist organization,” with all sorts of attendant sanctions appended thereto. Now, I’ve been out of law school for about a quarter century, but I seem to remember that there’s this thing called the Second Amendment, and you would think that people are allowed to exercise the First Amendment in order to speak freely in support of an actually-existing, non-penumbra-riffic, non-emanating hunk of the Bill of Rights. But apparently, in the Street Feces Capital of the West, the municipal government feels fine attempting to punish you for saying things its city’s pinko population dislikes.\n\nThat’s really the key – the fact that our garbage elite and its pathetic minions are horrified that people like you and me might dare to say unapproved things. Back in the day, a little dissent was tolerable. The elite had the NYT and WaPo, AP and UPI, and NBC, CBS and ABC, and if they gate-kept you out of them you were basically relegated to running off inky handbills on the ditto machine in your garage. Dissent was domesticated, controlled and, critically, absolutely no threat to the status quo.\n\nFast forward to today. After schooling by visionaries like Andrew Breitbart, we have leveraged new technologies and new forums, such as social media, to not merely break open the elite’s guarded gates but to throw down their walls altogether. Anyone can talk, and anyone does – BTW, follow me on Twitter and check out my non-traditional books – which means the elite’s monopoly on information, the source of its greatest power, is shriveling up and blowing away in the winds of change.\n\nAnd look at what happens when unapproved ideas escape into the public consciousness – you get unapproved leaders such as Donald Trump instead of licensed, chipped and neutered meat marionettes like that puppy-tormenting, passive-aggressive sissy Mitt Romney. You get people who noticed that the ice age they were promised in the 70s was never delivered and therefore now doubt that Gaia’s wrath is truly bearing down upon us for our carbon sins. You get people pointing out that Gropey Joe’s Bogota fairy dust-whiffing, bro’s wife-scoring son maybe possibly perhaps did not possess the kind of in-depth expertise in Ukrainian gas exploration engineering that might justify his $50K a month payday.\n\nThis wrong-thinking cannot be allowed to happen. Free speech was supposed to be a tool for the liberal elite to acquire and maintain power, not for the likes of you and me to exercise the prerogatives of citizenship.\n\nSo, we now have executive ordertrix Kamala Harris taking a break from busting moms of teens who cut math class to demand that giant corporations stifle the ability of liberals’ political opponents to communicate with the voters. She wants Twitter to cut off Donald Trump because she doesn’t like what he says.\n\nWe have some guy in the New York Times explaining that “Free Speech Is Killing Us,” which would seem like an odd position for a newspaper to embrace until you remember that there are no journalists in the mainstream media, only liberal transcriptionists trying to get the respect due neutral truth tellers while also acting as flacks for the Dems.\n\nWe have some people babbling about arresting climate deniers – “There is no climate and never was, dagnabit!” – while others, like Chuck Todd and a bunch of media outlets merely announce that they will ignore those who dissent by pointing out inconvenient truths, such as how the weather cultists have literally never been right about a single one of their apocalyptic predictions.\n\nLet’s not even get into the active censorship practiced by the complicit comrades of Silicon Valley with the blessing of the ruling caste. Their goal is to set boundaries on our thought and our expression that are coextensive with the personal preferences of the average 23-year-old, daddy issue-having SJW gender studies grad.\n\nThe liberal elite never really believed in free speech, at least not for you. It was always a pose. And now that you are able to effectively exercise that right, they are livid that we peasants can point out as our nation’s nominal leadership class’s unbroken track record of failure.\n\nSo, don’t be like the David Frenchs of the world, always ascribing pure motives to the bad guys and being all “Oh well I never!” when we Normals fight back against the oppression the ruling caste heaps upon us. Get woke. Understand our enemy. Understand its objectives. Understand that in its hive mind, you have no rights, only the obligation to conform and obey the liberal elite.\n\nIt’s no surprise that the Second Amendment follows right on the heels of the First. The liberal elitists certainly get it. The only right they hate more than your right to say what you think is your right to own the kind of firepower you need to defend your right to say what you think.\n\nWhat if they win? What if the liberals achieve their dream of an America with them in undisputed, unchallenged command? Scary, huh? Well, read my action-packed yet hilarious novels of America torn apart by liberal fascism, People's Republic, Indian Country and Wildfire (plus Book Number IV comes out this November)! The cruise-shilling hacks of Conservative, Inc., give them four “Ahoys!”", "description": "I have a confession to make: I hate the pseudo-conservative .10/07/2019 0:06:40AM EST.", "authors": ["Kurt", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/137/324c31a7-93da-4105-93f6-770a8e0f59c8.png", "published_at": "2019-10-07"}