{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/mum-mercilessly-trolled-after-pulling-20564488", "downloaded_at": "2019-10-12 07:30:08.097963+00:00", "title": "Mum mercilessly trolled after pulling son out of school over tuna sandwich", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA mum who was mercilessly trolled after pulling her son out of school in a row over a tuna sandwich has sent him back to avoid being fined.\n\nStacy Jarvis, 31, said she was furious after finding out her nine-year-old son, Jayden, missed out on a hot lunch because he \"took his time in the toilet\" while doing a poo.\n\nThe Year 5 pupil, from Hull, was late to the canteen and it had run out of hot food by the time he arrived, and he turned down the tuna sandwich because he doesn't like the fish.\n\nMiss Jarvis had vowed to keep Jayden out of school until she received an apology, but she backed down and sent him back after being warned she would be fined if she kept him at home, HullLive reports.\n\nThe pregnant mum-of-three has faced cruel comments while being mocked on social media after taking her claims to a local newspaper.\n\n(Image: HullLive/WS)\n\nMiss Jarvis had rowed with the head teacher at Thanet Primary School after he was left \"all day without food\" following the incident on Thursday.\n\nAfter sending him back to school on Friday, she claimed the school had \"backed down\" and assured her it would not happen again.\n\nMiss Jarvis has been trolled on social media after the initial story went viral, but she has no regrets about taking her claims public.\n\nShe said: \"Everyone is entitled to their own opinion but at the end of the day, he's my bain.\n\n\"He's still getting an education, he was not sat at home doing nothing, he was with his nanna doing his history, he's got til December to finish it but he's done it all.\n\n(Image: HullLive/WS)\n\n\"A lot of people have said your nine-year-old would get bullied because you said he was on the toilet - but is it not natural to have a poo?\n\n\"People have called them fussy eaters, well no, they choose what meals they will have before from the menu. If they don’t like it then I’ll do a pack up.\n\n\"And all these comments about my brows and not one person has offered to microblade them for me.\n\n\"I'm one to say it how it is, I don’t stand and scream and shout, it comes out exactly as it is, I said you're not feeding my child, and I'm not happy, that's it.\n\n\"Anyway he's gone back to school like nowt's happened.\"\n\n(Image: HullLive/WS)\n\nMiss Jarvis said she decided to send Jayden back to school because she didn't want to face a fine.\n\nShe said: \"The education teacher from the school rang me on Thursday to ask why Jayden is not at school but said 'obviously I know why he's not at school'. To be honest she is lovely.\n\n\"She said to me I will get a big fine. That’s down to me as a parent to deal with.\n\n\"She said she thinks it's in Jayden's best interests to come back into school, so I said 'yes I do think that too, but only if he will be fed'. She agreed with that. I said 'I’ll think about it'.\"\n\nMiss Jarvis is a stay-at-home mum and her children are entitled to free school meals.\n\nWhen she took Jayden back to school he had a packed lunch with him, a weekly ritual because he does not like the fried fish which is served every Friday.\n\nShe claims the head teacher called her later to discuss the incident.\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nShe said: \"She went 'Hi, how can I help you?'\n\n\"So I said 'the whole situation', so she said she thought it had been resolved and I was like 'no, we haven't spoke for it to be solved'.\n\n\"She said 'I can see that Jayden is back', so I said 'yes but he was upset'. So she said 'I can assure you it will never happen again, if there ever is an issue like this again we will give you a call'.\n\n\"But that's all I asked her to do in the first place. That is exactly what I asked for, not to be told that he’s had no lunch all day.\n\n\"It’s a situation that could have been resolved on that Wednesday afternoon if she had just said that.\"\n\nMiss Jarvis, also mum to Alisha, seven, and Cole, five, said no-one from the school apologised.\n\nShe added: \"I think that they’ve done wrong and its taken them a while to admit they’ve done wrong and I don’t think my bain is the only bain that has been there.\n\n\"I saw an old dinner lady had put something on [ Facebook ] saying 'I used to work here and there's not enough meals for the children' - so how long has this been going on?\n\n\"I'm not alone and I know I'm not alone because a few people have private messaged me and said they have gone through the same but they didn’t dare speak out.\n\n\"I’m hoping now Thanet won't do it to another child at that school.\"\n\nA spokesperson for Thanet Primary School said: \"We expect all of our pupils to attend school on a regular basis to make sure they have the best possible chance to achieve.\n\n“A good record of attendance impacts upon successful further education and good career prospects, and we want to ensure that every pupil has a chance to achieve this.”", "description": "Stacy Jarvis, 31, says her son Jayden, nine, missed out on a hot lunch because he \"took his time in the toilet\"", "authors": ["Joanna Lovell", "Image", "Hulllive Ws"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20549732.ece/ALTERNATES/s1200/0_East-Hull-mum-pulls-son-out-of-school-after-row-with-head-teacher-over-a-tuna-sandwichJayden-Hunter.jpg", "published_at": "2019-10-12"}