{"pub": "thehill", "url": "https://thehill.com/blogs/in-the-know/in-the-know/464932-maggie-rogers-shares-letter-from-huge-fans-barack-and-michelle", "downloaded_at": "2019-10-09 00:32:12.666571+00:00", "title": "Maggie Rogers shares letter from 'huge fans' Barack and Michelle Obama", "language": "en", "text": "Musician Maggie Rogers on Tuesday shared an image of a letter she received from former President Barack Obama Barack Hussein ObamaTrump's former ISIS envoy slams Syria decision: 'Donald Trump is not a Commander-in-Chief' Where are questions of economic and political inequality in the Democratic debates? Rep. Joe Kennedy has history on his side in Senate bid MORE and first lady Michelle Obama Michelle LeVaughn Robinson ObamaFormer Michelle Obama chief of staff Tina Tchen named new head of Time's Up Michelle Obama to release companion book to 'Becoming' Barack Obama to Michelle on 27th anniversary: 'It's getting better all the time' MORE.\n\nThe Obamas told the Maryland native they are “huge fans” and lamented missing her shows in Washington.\n\nADVERTISEMENT\n\nRogers played Monday night at The Anthem music venue in Washington and has another show slated for Tuesday night, both of which the Obamas will miss.\n\n“Good luck on the next part of your journey – looking forward to decades of great music from you! And we hope you and your crew enjoy spending a little time in D.C.,” the couple wrote.\n\nRogers shared an image of the letter on Twitter, writing that she “has never cried at the sight of my full name.”\n\n“I love you mr + mrs o. this is my grammy,” Rogers tweeted.\n\ni have never before cried at the sight of my full name. i love you mr + mrs o. this is my grammy. pic.twitter.com/KgHPpWX4gR — Maggie Rogers (@maggierogers) October 8, 2019\n\nRogers’ track “Burning” previously appeared on Barack Obama’s summer playlist that he shared in August.", "description": "Musician Maggie Rogers on Tuesday shared an image of a letter she received from former President Barack Obama and first lady Michelle Obama.", "authors": [], "top_image": "https://thehill.com/sites/default/files/newsletter-obamas_082219getty.jpg", "published_at": "2019-10-08"}