{"pub": "rt", "url": "https://rt.com/news/470843-hong-kong-protesters-metro-station", "downloaded_at": "2019-10-13 18:47:06.667101+00:00", "title": "Masked Hong Kong protesters SMASH UP metro station with metal bars and hammers in defiance of emergency order (VIDEO)", "language": "en", "text": "A mob of masked demonstrators vandalized a metro station in Hong Kong, as the city scrambles to restore order. Police deployed tear gas in an attempt to disperse the violent protesters.\n\nDramatic video published by Ruptly shows activists using metal bars and hammers to smash up ticket machines, turnstiles and other infrastructure inside the Sha Tin Mass Transit Railway (MTR) station on Sunday. Nearly all of the vandals wore masks, in defiance of an October 4 emergency order that bans all face coverings during public assemblies.\n\nBystanders can be seen hurrying out of the station as the mob descends upon the public transport hub. After the mob's attempts at destroying the station’s interior, police are seen advancing on the protesters, firing tear gas in hopes of quelling the riot. One clip shows the protesters spraying fire extinguishers and water hoses in the station.\n\nA proposed extradition bill with mainland China sparked peaceful demonstrations in March. Since then, the protests have grown increasingly violent, with activists adopting a broader anti-China agenda. Videos documenting brazen assaults carried out by the protesters against civilians and police alike have gone largely overlooked by mainstream media.\n\nBeijing has repeatedly accused Washington and its allies of providing direct and indirect support to the violent activists. On Sunday, Chinese President Xi Jinping said that any attempt to split up China “will end in crushed bodies and shattered bones.”\n\n“Any external forces backing such attempts at dividing China will be deemed by the Chinese people as pipe-dreaming,” he added.\n\nAlso on rt.com Pakistani PM Khan slams media’s ‘double standard’ on Hong Kong and Kashmir\n\nThink your friends would be interested? Share this story!", "description": "A mob of masked demonstrators vandalized a metro station in Hong Kong, as the city scrambles to restore order. Police deployed tear gas in an attempt to disperse the violent protesters.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5da31e4d85f5401b44349e21.png", "published_at": "2019-10-13"}