{"pub": "reuters", "url": "https://in.reuters.com/article/us-britain-regulator-investment/uk-asset-managers-face-tougher-checks-on-investment-policy-green-credentials-idINKBN1X22U0", "downloaded_at": "2019-10-23 23:20:35.765235+00:00", "title": "UK asset managers face tougher checks on investment policy, green credentials", "language": "en", "text": "LONDON (Reuters) - Asset managers in Britain face tougher checks on how they hold companies and other assets they invest in to account, and must for the first time consider environmental, social and governance factors like climate change.\n\nFILE PHOTO: A sailing boat moves past the Canary Wharf financial district on the River Thames in London, Britain August 11, 2019. REUTERS/Simon Dawson/File Photo\n\nThe Financial Reporting Council (FRC) published what it called a fundamentally strengthened Stewardship Code on Thursday which reflects greater demand from investors to invest in more “sustainable” assets that don’t harm the environment.\n\nThe existing, nine-year old code simply asks funds to outline their investment policies.\n\nThe revised code requires a more detailed, yearly submission to the FRC for the first time to not only set out what steps asset managers took to engage with the assets they invest in, but the outcomes as well.\n\n“The FRC will be holding signatories to account by regular review of adoption of the new code and the quality of the reporting against its principles,” said FRC Chief Executive Jon Thompson.\n\nA government-backed review last year that recommended replacing the FRC with a more powerful watchdog, said the “ineffective” code should be beefed up.\n\n“If this cannot be achieved, and the code remains simply a driver of boilerplate reporting, serious consideration should be given to its abolition,” the review said.\n\nKingman said that while he fully supports the new code, the “proof is in the pudding”, meaning it needs to deliver in practice.\n\nFor the first time the revised code will apply to advisers of asset managers, pension funds, insurers, private equity, fixed income, infrastructure, and investments outside Britain.\n\n“The most significant change will come from the new reporting requirements, enabling investment managers to demonstrate the tangible change their engagement with companies can bring and allowing savers and investors to judge the outcomes they deliver on their behalf,” said the Investment Association, an asset management industry body.\n\nSignatories will have to show what checks were made by internal auditors and outside parties on their efforts to meet the code.\n\nThe Chartered Institute of Internal Auditors said its members will need to “step up” on how they provide assurance.\n\nAround 300 asset managers are signed up to the existing code. The revised code comes into force in January, giving industry a year to prepare before making their first submission in early 2020 on compliance.\n\nThe FRC will scrutinize the submissions and decide if firms can remain signatories, a de facto requirement for winning investment mandates in some cases.\n\nThe watchdog will publish the names of firms that meet the standards of the new code so that investors can compare them with current signatories.\n\nThe FRC published proposals earlier this year for revising its stewardship code, and the final version has been shortened to improve clarity.", "description": "Asset managers in Britain face tougher checks on how they hold companies and other assets they invest in to account, and must for the first time consider environmental, social and governance factors like climate change.", "authors": ["Huw Jones", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191023&t=2&i=1444288318&w=1200&r=LYNXMPEF9M27E", "published_at": "2019-10-23"}