{"pub": "yahoo", "url": "https://news.yahoo.com/pelosi-seeks-broader-syria-briefing-201758241.html", "downloaded_at": "2019-10-30 23:31:44.240105+00:00", "title": "Pelosi seeks broader Syria briefing after secret session on Baghdadi raid", "language": "en", "text": "The House still needs a broader briefing on Syria from the Trump administration after a classified session largely focused on last weekend's raid that killed Islamic State leader Abu Bakr al-Baghdadi, Speaker Nancy Pelosi said Wednesday.\n\nCongressional leaders have pressed the administration to brief lawmakers in the days following President Donald Trump's move to withdraw troops from northern Syria and Turkey's military assaults against Kurdish forces there, which earned bipartisan scorn.\n\n\"We're privileged to get the briefing on the successful ... special forces killing of al-Baghdadi, but ... we have yet to get the other briefing,\" the California Democrat told reporters at the Capitol.\n\n\"We still want the briefing on Syria,\" she said.\n\nIn separate sessions Wednesday, Defense Secretary Mark Esper, Joint Chiefs Chairman Gen. Mark Milley and other top administration officials, equipped with some video clips from the Baghdadi raid, briefed members of both the House and Senate.\n\nRep. Don Bacon (R-Neb.) said \"90 percent\" of the House presentation was related to the raid, with some lawmakers pressing on the broader Syria situation.\n\n\"They've got a second brief planned to come back and talk more about Syria in general,\" Bacon said. \"But the focus of this was all on the raid.\"\n\n\"It was good, though,\" he said of the presentation. \"Lot of good video.\"\n\nHouse Armed Services Chairman Adam Smith (D-Wash.) said that the classified session also touched on the broader Syria situation and that lawmakers \"did get a pretty decent overview of what's going on in Syria and what the plan is going forward.\"\n\n\"I think they are developing a new plan,\" Smith said. \"What we were hoping is that there would be a dialogue with Congress as to how that plan has evolved, and that's what they were pressed on.\"", "description": "The House still needs a broader briefing on Syria from the Trump administration after a classified session largely focused on last weekend's raid that killed Islamic State leader Abu Bakr al-Baghdadi, Speaker Nancy Pelosi said Wednesday.  Congressional leaders have pressed the administration to brief", "authors": ["Connor O Brien"], "top_image": "https://s.yimg.com/uu/api/res/1.2/_5dsIrQ2aD7LhfZQsWD3Fg--~B/aD03NzM7dz0xMTYwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/politico_453/49f4aa046cdb9769617443806d111444", "published_at": "2019-10-30"}