{"pub": "yahoo", "url": "https://finance.yahoo.com/news/report-iranian-tanker-offloads-oil-160000993.html", "downloaded_at": "2019-09-07 03:41:20.834649+00:00", "title": "Report: Iranian Tanker Offloads Oil At Syrian Port", "language": "en", "text": "The now notorious Iranian oil tanker Adrian Darya 1 has offloaded its crude oil cargo to a port in Syria, Middle East Eye reported on Friday, quoting two sources.\n\nA total of 55 percent of the tanker’s crude oil cargo of 2.1 million barrels had been unloaded by late in the evening on Thursday, one of the sources told Middle East Eye.\n\nAdrian Darya 1, under her former name Grace 1, was detained by the British overseas territory Gibraltar in early July on suspicion of violating the European Union sanctions on Syria. Last month, Gibraltar released the Iranian tanker after Tehran gave assurances its oil cargo wouldn’t go to Syria.\n\nDays after the U.S. warned, again, that anyone dealing with the Iranian oil tanker released by Gibraltar would face sanctions, Iran said last week that it had sold the crude oil cargo aboard the now notorious tanker.\n\nSince leaving Gibraltar in the middle of August, the Iranian tanker has been roaming in the Mediterranean, frequently changing course. The U.S. continued to warn everyone against having anything to do with the tanker.\n\nThis past weekend, tanker-tracking service providers said that Adrian Darya 1 was near Syria, possibly for a ship-to-ship oil transfer. The tanker went dark on Monday while in the Mediterranean offshore Syria, ship-tracking data showed, suggesting that the tanker may be now in Syrian waters.\n\nThis week, reports emerged that the United States had offered several million dollars to the captain of the Iranian oil tanker to steer it to a port in a country that would detain the ship on behalf of the United States, the Financial Times reported, citing emails that the top U.S. envoy for Iran had sent to the vessel’s captain.\n\nOther reports suggested that Adrian Darya 1 is having problems with its captain, Fox News has reported, citing unnamed “intelligence sources.” According to the report, the captain, Akhilesh Kumar, “has been refusing to cooperate with a planned oil delivery and has asked to be dismissed or replaced.”\n\nBy Tsvetana Paraskova for Oilprice.com\n\nMore Top Reads From Oilprice.com:\n\nRead this article on OilPrice.com", "description": "The now notorious Iranian oil tanker Adrian Darya 1 has offloaded its crude oil cargo to a port in Syria", "authors": ["Tsvetana Paraskova"], "top_image": "https://s.yimg.com/os/mit/media/p/common/images/favicon_new-7483e38.svg", "published_at": "2019-09-06"}