{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/21/five-keys-redskins-their-monday-night-game-against-chicago", "downloaded_at": "2019-09-23 17:22:47.279377+00:00", "title": "Five keys for the Redskins in their Monday night game against Chicago", "language": "en", "text": "\n\nKhalil Mack is a dangerous pass rusher who can disrupt Washington's offense. (David Zalubowski/AP)\n\nAt 0-2, the Washington Redskins desperately need a victory Monday night against the Chicago Bears. That won’t be an easy task; the Bears have one of the league’s toughest defenses, led by pass rusher Khalil Mack, who has had at least 10 1/2 sacks in each of the past four seasons.\n\nChicago’s offense has struggled to move the ball, however, and could offer relief for a Washington defense that was battered in consecutive losses against the NFC East rival Philadelphia Eagles and Dallas Cowboys. Here are five keys for the Redskins in Monday’s game:\n\nMake defensive stands\n\nThe Eagles and Cowboys combined to convert 64 percent of their third downs against the Redskins, giving Washington the worst third-down defense in the league. Performances like that won’t win many games. Washington’s strength is, in theory, its defense, and that defense has to be able to get off the field. The Redskins have done a better job of that early in their first two games, but their play has appeared to fall off as games go on.\n\nChicago has the league’s third-worst offense in terms of yards, averaging just 263.5, and entered Week 3 with just 328 passing yards, fifth fewest in the league. Monday is an ideal time for the struggling Washington pass defense to find itself.\n\n[In a pivotal season, Redskins Coach Jay Gruden has ramped up the intensity]\n\nGet to Trubisky\n\nThe Redskins didn’t generate much of a pass rush in their first two games. But they were going up against two of the NFL’s best offensive lines and facing quarterbacks who can pick apart secondaries. Chicago’s line hasn’t been nearly as good as the ones in Philadelphia and Dallas, and quarterback Mitchell Trubisky has struggled, with a passer rating of 65.0 and no touchdown throws.\n\nWashington has not gotten the surge it hoped to generate up the middle since Jonathan Allen went down in the season opener, and the outside rushers, including rookie Montez Sweat, haven’t made an impact. This could be a chance for them to come to life.\n\nControl Khalil Mack\n\nThe Bears pass rusher has just one sack and one forced fumble, but he is a game-changing talent. He will be a test for the rebuilt left side of the Redskins’ offensive line: Tackle Donald Penn and guard Ereck Flowers have held up reasonably well in the first two games.\n\nWashington quarterback Case Keenum has hit on some big plays and has shown he can be elusive. But he can’t be distracted by looking out for Mack. If the Redskins can neutralize him, they should have a chance to move the ball.\n\n[Jon Bostic is the voice of a Redskins defense scrambling for answers]\n\nHit on big throws\n\nThe Redskins’ running game has struggled, and with tight end Jordan Reed still a question mark as he recovers from a concussion, their best offensive moments have come from several big throws. Rookie wide receiver Terry McLaurin has proved to be a dangerous deep threat, and coaches believe it’s only a matter of time before Trey Quinn, Paul Richardson Jr. and Kelvin Harmon break out.\n\nAlready, they are finding ways to use speedy wideout Steven Sims Jr. as both a pass catcher and runner. Against an aggressive Bears defense, they will have to hit on some long throws and find creative ways to get the ball into the hands of their quick, young wide receivers.\n\nWin the field position battle\n\nIt can be argued that Washington’s most important player is punter Tress Way, who continues to give the Redskins a chance by booting opponents into terrible starting positions. Way ranks first in the NFL in average yards per punt and second in net average. This shapes up to be the kind of game in which field position will be significant.\n\nLast week, Washington did a good job of forcing Dallas to start deep in its own territory. The Cowboys, however, marched right through the Redskins’ defense. Chicago doesn’t have the same kind of offense. If the Redskins can force the Bears to start drives close to their own end zone and the defense can improve on third down, they have a chance to give their offense a major field-position boost.\n\nMore Redskins coverage:\n\nTony Wyllie, Redskins’ head of communications, is leaving the organization\n\nEreck Flowers knows he has a long way to go, but with Redskins, he’s enjoying football again\n\nSally Jenkins: Case Keenum is part of the solution, but the Redskins’ problem might be too big\n\nFor the Redskins, 0-3 would mean doom. Here’s what they need to fix.\n\nRedskins Coach Jay Gruden demands more out of team’s ‘vanilla’ defense", "description": "Five keys for the Redskins in their Monday night game against the Chicago Bears", "authors": ["Les Carpenter", "Reporter Covering Washington Redskins", "Les Carpenter Returned To The Washington Post In", "Writes About The Washington Redskins."], "top_image": "https://www.washingtonpost.com/resizer/XGVL_m9VJnrX74Q_9ZmjxxbpydQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NVPIXBGYVMI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-21"}