{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/09/how-to-make-your-own-stuffed-crust-pizza", "downloaded_at": "2019-09-23 02:31:22.378752+00:00", "title": "How To Make Your Own Stuffed Crust Pizza", "language": "en", "text": "The greatest gift that home cooking has to give is happiness, and few things make people happier than a slice of pizza. So, I’d like to talk about just how easy it is to make pizza at home — even a fully loaded, stuffed-crust monstrosity.\n\nWhatever anxiety or scepticism you have about homemade pizza, I promise that it doesn’t have to be like that. It doesn’t take a zillion-dollar custom oven or a fancy sheet of stainless steel or a pizza stone or even a cast iron pan to make truly fantastic pizza; if all you have is an aluminium sheet pan and a normie oven, you still got this.\n\nYou don’t have to ferment your dough for three days or crush your own garden tomatoes for sauce, either (unless you really want to). A quick, no-knead dough and a briefly simmered sauce are the perfect foundation for any and all of the wild-arse toppings your heart desires.\n\nBut the real reason to make pizza at home is that it’s secretly the single most crowd-pleasing way to clean out a sad fridge, combining the satisfaction of using up neglected leftovers with the dopamine rush of ordering delivery. And for me, one style reigns supreme: the humble nonna — or grandma — pie.\n\nI’ve become a nonna pie devotee over the years and I’m here to convert you. If you’re the kind of person who’d rather argue over what is and is not pizza than eat a delicious pile of carbs, cheese, and tomato sauce, you may find this proposition upsetting. For one thing, my homemade pizza is rectangular, not circular.\n\nThe sauce is rich, intensely garlicky, and — I’m not sorry — spiked with a good amount of sugar, then dolloped on top of the cheese. The crust is towards the thick end of the spectrum, basically fried on the bottom, and stuffed with a solid border of gooey, stretchy mozzarella. Honestly, this pizza is designed to instantly whisk you back in time to the days when low-budget Pizza Hut parties were the highlight of your social calendar. Some will find this delightful (me!) and others will find it distasteful or perhaps pedestrian. Those people are definitely not invited to my pizza party.\n\nFor the rest of us, I have great news. If you can stir a bowl of dough and sauté garlic, you can make pizza entirely from scratch at home. The dough comes together in about five minutes and rises in less than two hours, but you can also stick it in the fridge for a few days if you like. The sauce takes 20 minutes max, and can be made while the dough rises or several days ahead.\n\nA few small adjustments to equipment and technique — namely, putting a rack on the actual floor of your oven and the sauce on top of the cheese and toppings — ensure that even the wimpiest ovens turn out crispy-bottomed, perfectly cooked pies, every time. Once you have the basics down, this is a recipe that’s destined to become a staple in your repertoire. Maybe soon you too will keep a block of cheap mozzarella in your fridge and a bucket of pizza sauce in your freezer just for emergency pizza nights.\n\nEasy Stuffed Crust Pizza\n\nPhoto: A.A. Newton\n\nIf you think that homemade pizza is an all-day ordeal, this recipe should change your mind; you can have a perfect, piping hot pizza ready to eat in a little over two hours. Making the dough and sauce a few days ahead saves on prep time, but keep in mind that cold dough takes longer to relax enough to fill the pan.\n\nFor the dough:\n\n5 cups (650 grams) all-purpose flour\n\n3 teaspoons instant yeast\n\n3 teaspoons table salt\n\n3 teaspoons granulated sugar\n\n2 cups (450 grams) lukewarm water\n\n1/4 cup (50-55 grams) extra-virgin olive oil\n\nFor the sauce:\n\n1/4 cup (50-55 grams) extra-virgin olive oil\n\n2-3 garlic cloves, thinly sliced\n\n2 tablespoons tomato paste\n\nA big pinch of crushed red pepper flakes, or more to taste\n\n1/2 teaspoon table salt, plus more to taste\n\n1 teaspoon granulated sugar, plus more to taste\n\n(Optional) Dried oregano, marjoram, rosemary, or other herbs, to taste\n\n800g can of tomatoes, any variety\n\nPinch of baking soda\n\nTo stuff the crust and assemble the pizza:\n\n2-3 tablespoons extra-virgin olive oil\n\n350g package of string cheese sticks\n\n1/2-3/4 of the sauce\n\n1/2 cup grated hard cheese like Pecorino Romano or Parmesan\n\n250g mozzarella, fresh or low-moisture, grated or torn into pieces\n\nToppings of choice (I like pepperoni, jalapeños and pineapple)\n\nFirst, make the dough: whisk all the dry ingredients together in a large bowl, then pour in the water and oil and stir with a flexible spatula until all the flour absorbs. Cover the bowl with plastic wrap and set in a warm spot to rise for an hour, or until it’s noticeably puffy and bubbly but not quite doubled in volume.\n\nOil your hands lightly. Pull handfuls of dough from the bottom of the bowl upwards, stretching them over the top and pressing them into the centre. Rotate the bowl slightly and repeat until you have a rough-looking ball. Flip the whole ball over and replace the plastic wrap. At this point you can either let the dough rise for another 45 minutes to an hour or refrigerate it for up to 3 days.\n\nPull, stretch, and tuck the dough in on itself to form a rough ball... (Photo: A.A. Newton)\n\n...rotating as you go... (Photo: A.A. Newton)\n\n...until it looks more or less like this. (Photo: A.A. Newton)\n\nWhile the dough rises, make the sauce. Pour the olive oil into a cold, heavy-bottomed pan with a lid — like a Dutch oven — and add the garlic. Turn the heat to medium-low and cook for three to five minutes, until the garlic sizzles and browns a bit around the edges. Add the tomato paste and increase the heat to medium.\n\nCook for another five minutes or so, stirring frequently, until the tomato paste starts to stick to the bottom of the pan. Stir in the red pepper, salt, sugar, herbs and tomatoes, crushing them with the back of your spoon if they’re whole. Put the lid on and bring the sauce to a boil over medium-high heat, then reduce the heat to medium and simmer, covered, for ten minutes.\n\nIf necessary, smooth the sauce out with a stick blender, then simmer with the lid off for another five minutes or so — it should be pretty thick. Stir in the baking soda (it neutralises that acidic, tinny taste that canned tomatoes have), then taste and adjust the seasoning.\n\nLet the sauce cool until you’re ready to make the pizza. You can also make it 3 or 4 days ahead of time and keep it in the fridge — or make a double batch and freeze half for future pizza emergencies.\n\nNow it’s time to assemble the pizza. Place a rack as close to the bottom of your oven as you can. Set the other rack in the upper third and preheat your oven to 250 degrees Celsius.\n\nPour 2-3 tablespoons of olive oil into a half-size aluminium sheet pan, or any aluminium pan that’s roughly 50cm by 30cm. Scrape the dough directly into the puddle of oil in the pan and turn it over a few times so it’s evenly coated with oil. Use your fingers to press and stretch the dough into a rough rectangle; it won’t go all the way to the edges just yet, and that’s OK.\n\nPhoto: A.A. Newton\n\nPhoto: A.A. Newton\n\nLet it rest for 20-30 minutes — say, while you run to the store for ranch dressing and ginger ale to complete your pizza party menu — and try again. Repeat as needed. (If your dough came out of the fridge, this part will take up to two hours; you may want to cover the dough with plastic wrap while it warms up.)\n\nOnce the dough easily fills the pan, press 10 sticks of string cheese into the sides: 3 per long side, 2 per short side. Leave small gaps in between the sticks as needed.\n\nPhoto: A.A. Newton\n\nNow, carefully pull the edges of the dough up and over the string cheese sticks, tucking and rolling and pressing everything together as tightly as you can — you wanna really seal ‘em in there. Dock the bottom of the dough all over with a fork.\n\nPhoto: A.A. Newton\n\nSpread on the thinnest possible layer of sauce; I used maybe 3 tablespoons total. Sprinkle on most of the grated hard cheese, then all the mozzarella, then your toppings. Dollop some (or all!) of the rest of the sauce over top and finish with the rest of the hard cheese.\n\nThe first layer of sauce needs to be really, really thin. (Photo: A.A. Newton)\n\nBut once the cheese goes on, you can really load it up—that cheese-stuffed border can handle it. (Photo: A.A. Newton)\n\nBrush the crust with olive oil, then place the pizza in the oven on the bottom rack. Bake for 20-25 minutes, until bubbling and lightly browned on top. Transfer to the top rack and bake for another 10 minutes to finish browning the crust and toppings. Set the pan on a wire rack and cool for at least 5 minutes before cutting.\n\nSlice your pizza into big squares and serve with all the pizza party fixins: any remaining pizza sauce and bottled ranch for crust dunking, hot sauce and a two-litre bottle of soft drink or plenty of beer. Ice cream is optional, but if it’s a party, why not go all out? (For once, I didn’t, and I regret it. I guess I’ll have to make up for it next time.)", "description": "The greatest gift that home cooking has to give is happiness, and few things make people happier than a slice of pizza. So, I’d like to talk about just how easy it is to make pizza at home — even a fully loaded, stuffed-crust monstrosity....", "authors": ["Emily Price", "David Murphy"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/oao9syu5oml0tydk3g9y.jpg", "published_at": "2019-09-23"}