{"pub": "arirang", "url": "https://arirang.com/News/News_View.asp?nseq=245818", "downloaded_at": "2019-10-16 23:13:29.381950+00:00", "title": "News View :: The World On Arirang", "language": "en", "text": "As the first snow of the season fell on Paekdusan Mountain, North Korean leader Kim Jong-un was pictured riding on a trail atop an elegant white horse.Kim also visited a special tourist zone under construction in Samjiyon County at the foot of the mountain, and according to North Korea's state media, Kim lashed out at the U.S. for its sanctions on the regime, and called for national unity.He said we should not listen to temptation nor seek anyone's help. He stressed the only way to improve self-development and self-prosperity is to follow the path of constant development and carry the banner of self-renewal as it is now.The visits are also raising anticipation a big announcement could be in the works as these two places were frequented by Kim ahead of grand political or diplomatic decisions.Foreign media outlets are closely following his visits.CNN reported that the trip comes amid high tensions on the Korean Peninsula.The New York Times noted how the trip follows failed working-level talks with the U.S. in Sweden, and predicts a major change in Kim's approach to the denuclearization negotiations.The Wall Street Journal speculated that the North Korean leader is trying to show firmly that the deadline for negotiations is the end of this year.Others say the photo of Kim riding a horse on Paekdusan Mountain is his way of showing his absolute grip on power.The Washington Post noted how the photo of Kim is strikingly similar to Russian President Vladimir Putin's famous shirtless pose while riding a horse.Responding to Kim's trip to the two sites, U.S. Assistant Secretary of State for the Bureau of East Asian and Pacific Affairs, David Stilwell, acknowledged Kim's criticism of U.S. sanctions, but reaffirmed they will stay in place until the North denuclearizes.While the foreign media outlets covered different angles of the story, there was a common theme in all of them, namely Kim appears on the brink of making a major decision that could shape the nuclear talks going forward.Lee Seung-jae, Arirang News.", "description": "한국을 대표하는 글로벌 방송! The World On Arirang!", "authors": ["The Korea International Broadcasting Foundation"], "top_image": "http://www.arirang.com/arirang_blue.png", "published_at": "2019-10-16"}