{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7613647/Grieving-ex-Formula-One-champion-Jody-Scheckter-wife-release-photo-daughter-Ila.html", "downloaded_at": "2019-10-25 17:02:55.261576+00:00", "title": "Grieving ex-Formula One champion Jody Scheckter and his wife release a photo of their daughter Ila", "language": "en", "text": "Formula One legend Jody Scheckter and his wife have released a photo of their 21-year-old daughter Ila two days before she died from a suspected accidental drug overdose.\n\nFormer world champion Scheckter, 69, and his devastated family this week revealed Ila, who was battling addiction following major brain surgery, died in her sleep at her family's farm in Overton, near Basingstoke, Hampshire.\n\nIla, who passed away the night before she was due to start treatment, battled 'extreme anxiety' and a fear of seizures after the surgery to operate on her brain tumour.\n\nNow her grieving family have released a photograph of 'beautiful' and 'smart' Ila smiling and looking 'well and gorgeous' two days before her death so 'people have more empathy for addicts'.\n\nIla Sheckter, pictured just two days before her death. Her grieving family released the photograph of 'beautiful' and 'smart' Ila smiling and looking 'well and gorgeous' so 'people have more empathy for addicts'\n\nHer mother, Clare Scheckter, said: 'Addiction is such a misunderstood mental health condition so I hope by explaining and seeing the photos of someone who looked so well and gorgeous, people might have a little more empathy for addicts.'\n\nMrs Scheckter added: 'Nobody chooses to be an addict.\n\n'It is a very frightening disease which, at Narcotics Anonymous, they state ''the only outcome is jails, institutions or death'' unless the person can achieve total abstinence of any mood altering substance or behaviour.'\n\nIt comes as well-wishers have raised more than £7,300 in memory of former Ferrari driver Mr Scheckter's daughter.\n\nPictured: Ila, fourth from right, with (left to right): brother Freddie, sister Poppy, father Jody, brother Toby, brother Hugo (behind), mother Clare and brother Tomas celebrating the 40th anniversary of Jody's F1 Championship win at the Italian Grand Prix in Monza last month\n\nYounger sister Poppy, a model, shared touching family photos as she wrote movingly about how addiction had 'stolen' her 'beautiful' big sister from her. Pictured, a childhood photo shared by Poppy showing herself and Ila, left, with brothers Freddie and Hugo\n\nIla, the fifth of Mr Scheckter's six children, developed epilepsy in recent months which led to her experiencing extreme anxiety.\n\nShe was due to study psychology for counselling at the University of Westminster, London, as she wanted to be able to help others who suffered with mental health issues.\n\nMrs Scheckter also said: 'If any family member is concerned about a person's addiction, they could think of getting support from Alcoholic Anonymous or Families Anonymous.\n\n'I learnt the most about addiction from going to Narcotics Anonymous open meetings and listening to people share and talk openly about their disease.\n\nIla cradles her nephew in a photo with brother Freddie, sister Poppy and mother Clare\n\nDespite being 'really unwell', Ila 'bravely and determinedly' joined her parents and five siblings at the Italian Grand Prix last month. Pictured, Ila smiling next to her father in his racing car\n\n'They are such a compassionate and welcoming and supportive group of people and no question is too stupid or too ignorant to ask.\n\n'The more a family member understands, the better they can support the suffering person. They can never cure it, they did not cause and they cannot control it but love, acceptance and understanding is a priceless gift to someone in active addiction.'\n\nThis week, in a statement revealing Ila passed away, her family said: 'Ila was a larger than life character in many ways - funny, wacky, outrageous, beautiful, smart, compassionate, empathetic, loyal and with a smile that could light up a room.\n\n'In September, despite being really unwell, she bravely and determinedly joined her parents, four brothers and younger sister in Monza for the 40th anniversary of Jody's F1 World Championship.\n\n'Ila has been taken from our lives too soon and the pain our family feel at her loss is unbearable.'", "description": "Ila died in her sleep at her family's farm in Overton, near Basingstoke, Hampshire after what is thought to be an accidental overdose. Her family released this picture of her two days before her death.", "authors": ["Henry Martin For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/14/20181068-0-image-a-16_1572010999031.jpg", "published_at": "2019-10-25"}