{"pub": "fox", "url": "https://foxnews.com/media/how-i-realized-the-n-y-times-kavanaugh-story-was-a-train-wreck", "downloaded_at": "2019-09-17 10:38:16.637130+00:00", "title": "How I realized the NY Times Kavanaugh story was a train wreck", "language": "en", "text": "All the political players were ready to pounce, from the 2020 Democrats calling for Brett Kavanaugh to be run off the Supreme Court to President Trump saying the media were telling lies about him.\n\nBut the New York Times story that triggered the partisan potshots was fatally flawed.\n\nSo flawed, in fact, that early Sunday morning I was agonizing over whether I should cover the story on “Media Buzz.” I told my staff I was torn because the piece was so thinly sourced that I wasn’t sure whether I wanted to help trumpet allegations of this magnitude against a sitting justice.\n\nAfter all, in an opinion-section essay adapted from their forthcoming book, reporters Robin Pogrebin and Kate Kelly cited only one second-hand source. They didn’t even talk to that source, a former Yale classmate named Max Stier, directly. They got his account from two unnamed “officials” who had spoken to him.\n\nNYT UPDATES KAVANAUGH 'BOMBSHELL' TO NOTE ACCUSER DOESN'T RECALL ALLEGED ASSAULT\n\nOn this flimsy basis, the story charged that Kavanaugh had exposed himself at a second drunken dorm party nearly four decades ago. (A similar allegation during his bitter confirmation hearings, by Deborah Ramirez, was never corroborated.) What’s more, the story said Kavanaugh was pushed toward a female student, who inadvertently touched his genitals while trying to swat him away.\n\nWith two hours before airtime, two things changed my mind. One was the tweets by the president, which denounced the allegations as “lies,” said Kavanaugh should start suing people and, in a strange aside, said the Justice Department should rescue him. (The Kavanaugh camp, by contrast, chose not to give the story any oxygen by commenting.)\n\nThe second factor was when I got on the phone and was able to get a source to give me the key pages from the book, “The Education of Brett Kavanaugh: An Education.”\n\nI was stunned to find that the alleged victim -- the woman who would have been exposed as Kavanaugh supposedly pulled down his pants -- not only wouldn’t comment on the incident, but “several of her friends said she does not recall it.”\n\nThat eye-popping sentence, which in my view completely undercuts the allegation, appears nowhere in the Times story by the same reporters. The woman presumably would have remembered such a traumatic incident.\n\nOn that basis, I went on the air and harshly criticized the Times story. Many of the journalism controversies I cover have shades of gray; this one was not a close call.\n\nSUBSCRIBE TO HOWIE'S MEDIA BUZZMETER PODCAST, A RIFF OF THE DAY'S HOTTEST STORIES\n\nThe Times admitted its mistake yesterday with an editor’s note saying the information about alleged victim (who is named in the book, but who I see no reason to identify) should have been included in the story. But that decision must have been made late, as the correction appears only online, not in the print edition.\n\nThere was little pickup on Sunday of these egregious shortcomings in the Times story, in part because I believe many journalists are reluctant to take on the so-called paper of record, and the Kavanaugh allegations seemed juicy. In fact, many news outlets just repeated the Times account—New charges against Justice Kavanaugh! Trump responds!—without even noting the shaky sourcing.\n\nWhat’s more, the book pages I’d obtained acknowledged that at least two members of the Senate Judiciary Committee knew of the allegation last year and did nothing with it. Even some Democrats on the panel, I’ve learned, didn’t think it was worthy of mentioning.\n\nBy the time I was back on the air yesterday morning, I’d gotten the first public comment from the justice’s camp. A source close to Kavanaugh said of the Times piece: “This was a disgusting effort to smear Justice Kavanaugh to sell a few books. There is nothing new here: The woman who supposedly experienced this incident does not remember it. And Senate Democrats had this information before Justice Kavanaugh was confirmed but never said a word about it.”\n\nAnd it turns out another major newspaper passed on the allegations:\n\n“The Washington Post last year confirmed that two intermediaries had relayed such a claim to lawmakers and the FBI. The Post did not publish a story in part because the intermediaries declined to identify the alleged witness and because the woman who was said to be involved declined to comment.”\n\nThere were other details—such as Max Stier being described only as a respected lawyer, but not as someone who defended Bill Clinton against sexual allegations—that felt like tipping the scales.\n\nSeveral Democratic presidential candidates—Elizabeth Warren, Kamala Harris, Beto O’Rourke, Cory Booker and others—seized on the story to demand Kavanaugh’s impeachment. That, of course, is a legitimate part of the story, but I wonder if they will regret having rushed to judgment before seeing the book. As Mitch McConnell noted on the Senate floor yesterday, even after the correction, none of the 2020 contenders has backed off.\n\nOne final point: I still can’t believe that the Times promoted the story with the following disgusting tweet:\n\n“Having a penis thrust in your face at a drunken dorm party may seem like harmless fun. But when Brett Kavanaugh did it to her, Deborah Ramirez says, it confirmed that she didn’t belong at Yale in the first place.”\n\nHarmless fun?\n\nThe paper’s deputy editorial page editor, James Dao, apologized, calling the posting “clearly offensive.” He’s got that right.", "description": "All the political players were ready to pounce, from the 2020 Democrats calling for Brett Kavanaugh to be run off the Supreme Court to President Trump saying the media were telling lies about him.", "authors": ["Howard Kurtz", "Howard Kurtz Is A Fox News Analyst", "The Host Of"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/16/694940094001_6086803045001_6086802304001-vs.jpg", "published_at": "2019-09-16"}