{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7548501/Repeat-scripts-common-antibiotics-banned-battle-stop-spread-superbugs.html", "downloaded_at": "2019-10-08 02:17:40.256272+00:00", "title": "Repeat scripts for common antibiotics to be banned in battle to stop the spread of superbugs", "language": "en", "text": "Doctors could be banned from issuing repeat scripts amid fears the rise of medicine-resistant superbugs risks a return to a pre-antibiotics era.\n\nThe Pharmaceutical Benefits Advisory Committee has recommended doctors be restricted from handing out repeat scripts for common antibiotics such as Keflex and Amoxocillan when they weren't medically needed.\n\nThe advice came after it was found infection-causing microbes such as e.coli were building resistance to common antibiotics, leading to a rise in superbugs.\n\nThe committee said limiting the availability of antibiotics would help reduce the spread of antibiotic-resistant infections.\n\nDoctors will be banned from handing out repeat antibiotic scripts after experts warn the rise of medicine-resistant superbugs risks a return to a pre-antibiotics era (stock image)\n\nThe Royal Australian College of GPs president Harry Nespolon told The Australian the recommendations kick-started a much-needed change.\n\n'Antimicrobial resistance is a public health policy crisis that needs to be taken extremely seriously ... (We are) risking a return to the pre-antibiotics era of the 19th ­century,' he said.\n\nUnder the new rules, the Pharmaceutical Benefits Scheme would no longer subsidise repeat prescriptions, forcing patients to make a new appointment if one course of antibiotics failed to clear an infection.\n\nJohn Turnidge, senior medical adviser at the Australian Commission on Safety and Quality in Healthcare, said the recommendations represented a huge milestone.\n\n'Anything we can do to reduce the number of scripts and the number of repeats, and overall the total volume that we use, will be extremely welcome as we move towards trying to get responsible antibiotic prescribing across the board in Australia.'\n\nThe publication also reported part of the issue stemmed from doctors prescribing medication for viruses that do not respond to antibiotics, and that software GPs use to create prescriptions automatically include repeats.\n\nThe advice came after it was found infection-causing microbes such as e.coli were building resistance to common antibiotics, leading to a rise in superbugs (stock image)\n\nMicrobiologist Peter Collignon, a professor at the ANU Medical School, said shorter courses of antibiotics were often more effective.\n\n'All the moves with antibiotics at the ­moment is to take shorter courses, and the advantage of that is then there's less total exposure to antibiotics and you overall get less ­resistance.'\n\nThe recommendations will need to be implemented by the federal government.\n\nHealth Minister Greg Hunt said he is in favour of the changes.", "description": "Experts warned infection-causing microbes such as e.coli were building resistance to common antibiotics, and the over-prescribing medication risked a return to a pre-antibiotics era.", "authors": ["Charlotte Karp For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/02/19421540-0-image-a-16_1570497965959.jpg", "published_at": "2019-10-08"}