{"pub": "cbc", "url": "https://cbc.ca/news/canada/manitoba/patrik-laine-nhl-jets-winnipeg-1.5286365", "downloaded_at": "2019-09-17 23:24:57.683977+00:00", "title": "Frustrated Patrik Laine wants to be on top line, play with high-skilled centre | CBC News", "language": "en", "text": "Patrik Laine believes if he was on another NHL team, his linemates would be the best players available, but in Winnipeg, he's stagnating on a second line with a rotating roster, says a Finnish journalist who has followed the star's career.\n\n\"I felt he was really frustrated … especially five-on-five and with whom he's playing,\" said Pekka Jalonen, a sportswriter for Iltalehti, one of the largest newspapers and most popular websites in Finland.\n\nHe has followed Laine's career from junior superstar to his first few seasons in Winnipeg and recently spoke with him in Europe, where Laine is practising with Swiss club SC Bern as contract negotiations with the Jets continue.\n\nLaine expressed his dissatisfaction with the line combinations and opportunities he was getting last season but didn't name anyone, Jalonen said.\n\nHe only said \"somewhere other than Winnipeg he would have the chance to play with the best players,\" Jalonen said.\n\nPatrik Laine celebrates a first-period goal against St. Louis in Game 1 of the 2018-19 NHL playoffs. (John Woods/The Canadian Press)\n\nThe Finnish superstar spun heads in his first season in 2016-17 by scoring 36 goals and adding 28 assists and being named one of three finalists for the Calder Trophy, awarded to the NHL's top rookie.\n\nHe followed that up with 44 goals in his sophomore season, the second-highest total in the league.\n\nThe 2018-19 season started phenomenally with 18 goals in 12 games in November — giving him 21 goals in the first 24 games.\n\nThen Laine hit quicksand. He scored just nine goals the rest of the year and struggled defensively, coughing up the puck and losing battles on the boards. He ended the year with a –24 plus-minus rating.\n\nBad blood?\n\nJalonen believed Laine wants to be on a line centred by Mark Scheifele but has instead been teamed on the second line with centres Andrew Copp, Adam Lowry and Bryan Little over the years.\n\nIf he can't be on the top line, he would like a more highly skilled centreman, Jalonen said.\n\n\"I have never heard him speak like this before in public. I'm not sure if the Jets have to be concerned about this because of course, this can make some bad blood between the two sides,\" he said.\n\n\"But the Jets know the situation. They need a second-line centre. They have traded two first-round picks to get a second-line centre, so they know what the problem is there.\"\n\nJets captain Blake Wheeler says Laine's comments are a non-issue. (JetsTV)\n\nWinnipeg has brought in two high-profile centres in the past two years, both of whom only played a few months in a Jets uniform. They were essentially rental players for the playoffs.\n\nPaul Stastny was brought in at the end of the 2017-18 season, playing 19 games until the team's playoff drive ended in the Western Conference finals against Las Vegas. He then left for Vegas in the off-season.\n\nThe Jets brought in Kevin Hayes the following year. He played 20 games at the end of the season before he was traded to the Philadelphia Flyers that off-season.\n\nSpeaking to reporters on Tuesday, Lowry shrugged when asked about his teammate's remarks.\n\n\"I think everyone's entitled to their own opinion,\" he said. \"He's a premier goal-scorer so maybe he's just trying to use that as some leverage for his contract. I wouldn't put too much weight into those comments.\"\n\nAsked if, overall, Laine is happy in Winnipeg, Jalonen said \"I think he is. He loves the city and he knows he can be a really, really good player there. He knows he can score 50 goals when he has the right guy with him as a centre.\n\n\"He is just so hard on himself that he wants to have that opportunity to play with a good player so he can score that 50 goals, or more.\n\n\"But he is prepared to play somewhere else if the negotiations don't go his way.\"\n\nNo big deal, captain says\n\nJets captain Blake Wheeler lauded Laine's skills but noted his success isn't a solo act, suggesting he has been playing with quality teammates.\n\n\"He's a young kid that's certainly had a lot of success in three years [but] he's definitely not doing it by himself, I can guarantee you that,\" he said.\n\n\"He's a guy that has certainly had a huge part in what we've done here, and helped get us to the point where we can be talked about as a Stanley Cup contender.\"\n\nAnd Laine's fire to be the best is a welcome attribute, Wheeler said.\n\n\"It's a great trait to have — to want more, to want more ice time, more playing time.You want guys that are hungry for more and not content with where he's at.\"\n\nPatrik Laine had an outstanding start to last season but struggled through the second half. (Michael Dwyer/Associated Press)\n\nWheeler said he doesn't know if there is a better way for Laine to have handled his frustration than speaking out publicly.\n\n\"I'm not him. I'm not in his shoes, I don't know exactly how he's feeling,\" he said. \"I'm sure there are parts of that that are not exactly how he meant it and blown out of proportion.\"\n\nWheeler said his role as captain is to make every teammate feel empowered, to bring out their best abilities and to realize everyone needs to buy into the role they have to play.\n\n\"You're gonna need that if you're gonna take those steps to be a complete team,\" he said.\n\nAsked if it the current ripples would become a non-issue once the contract is settled and Laine is back in the dressing room, Wheeler said \"it's a non-issue today, none whatsoever.\n\n\"It's not a big deal. We'll wake up tomorrow with new headlines,\" he said. \"I'm literally going to walk out of this room and not think about it ever again.\"\n\n'His own worst critic'\n\nJalonen acknowledged the hardball being played by Laine could be a tactic to put public pressure on the Jets while they are in contract negotiations.\n\n\"But usually when Patrik speaks something, when he tells something to you, he means what he says.\"\n\nAt exit meetings with media at the end of last season, Laine revealed he played with a back injury for much of the year. (John Woods/The Canadian Press)\n\nRumours swirled last year that part of the reason a promising Jets season came to a screeching half in the first round of the playoffs — to the eventual Stanley Cup champions St. Louis Blues — was because of discord in the dressing room between the veteran players and younger ones.\n\nIf that was true, it wouldn't have rattled Laine much, Jalonen said.\n\n\"I heard that Blake Wheeler is really hard sometimes to the whole team, especially the young players, but it's not bothering Patrik because he is his own worst critic. He is hard on himself,\" Jalonen said.\n\n\"He wants somebody to kick his ass to be a better player. He wants to be the best player and he is doing everything he can to be that guy.\n\n\"Of course, when the pucks don't go in, he's a little bit frustrated and hard on himself.\"\n\nAt the end of last season, as players met media for exit scrums at Bell MTS Place, Laine revealed he played with a back injury for much of the season. He also said a groin injury had slowed his ability in the playoffs.\n\nThose ailments are no longer a concern, Jalonen said.\n\n\"He has been working like a horse during the summer. His back is now OK and he is very confident he can play really good hockey.\"", "description": "Patrik Laine believes if he was on another NHL team, his linemates would be the best players available, but in Winnipeg, he's stagnating on a second line with a rotating roster, says a Finnish journalist who has followed the star's career.", "authors": ["Reporter Editor", "Darren Bernhardt Spent The First Dozen Years Of His Journalism Career In Newspapers", "First At The Regina Leader-Post Then The Saskatoon Starphoenix. He Has Been With Cbc Manitoba Since", "Specializes In Offbeat", "Local History Stories", "Features. Story Idea", "Email", "Darren.Bernhardt Cbc.Ca"], "top_image": "https://i.cbc.ca/1.5286384.1568733230!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/hkn-jets-training-camp-20180914.jpg", "published_at": "2019-09-17"}