{"pub": "realclearpolitics", "url": "https://realclearinvestigations.com/articles/2019/10/23/giuliani-style_shadow_diplomacy_par_for_the_course_of_us_history_120883.html", "downloaded_at": "2019-10-23 15:00:14.923977+00:00", "title": "Giuliani-Style 'Shadow' Diplomacy: Par for the Course of U.S. History", "language": "en", "text": "Above, Coca-Cola boss J. Paul Austin visits Fidel Castro in 1977. The next year he was Jimmy Carter's personal envoy to Cuba, even though he had a personal business interest.\n\nBy Eric Felten, RealClearInvestigations\n\nOctober 23, 2019\n\nRudolph Giuliani didn’t hide the fact that he was investigating whether Ukraine interfered in the 2016 U.S. presidential race. Yet most media have treated Giuliani’s efforts as sneaky and suspect because he acted at the personal behest of the president and not as an official representative of the bureaucracy. The New York Times, for example, claimed Giuliani was conducting “a shadow foreign policy campaign.”\n\nIn fact, presidents since George Washington have turned to individuals without formal government positions to pursue foreign policy interests and objectives. Private citizens, often acting as special envoys, have helped negotiate issues ranging from trade to war. While critics deride such efforts as “back-door,” “secret,” or “shadow” undertakings, many presidents have found it useful to dispatch people they trust, who can think and operate outside the constraints of official channels in handling delicate matters.\n\nGouverneur Morris: Shadow diplomat for George Washington.\n\nPrivate representatives were essential in the early days of the republic in part because the federal government was small. During his first year in office, President Washington wrote to one of the Founders most responsible for penning the Constitution, Gouverneur Morris, who was on business in France. The president said he needed to know the “sentiments and intentions of the court of London” toward “a treaty of commerce.” Washington was looking for someone who could act with subtlety: “It appears to me most expedient to have these inquiries made informally, by a private agent.” Washington told Morris he looked forward to “the result of your agency.”\n\nFranklin D. Roosevelt called kitchen cabinet adviser Harry Hopkins “the perfect ambassador for my purposes” after sending Hopkins on wartime missions to Great Britain and the Soviet Union. “He doesn’t even know the meaning of the word ‘protocol,’’’ FDR added. “When he sees a piece of red tape, he just pulls out those old garden shears of his and snips it.”\n\nIn modern times, Jesse Jackson pursued freelance foreign policy for decades before President Clinton made him Special Envoy for the Promotion of Democracy in Africa. Armand Hammer used his far-flung business interests to facilitate his “citizen diplomacy.” Although Hammer was particularly solicitous of the Soviet Union, presidents including Richard Nixon and Ronald Reagan tolerated – or more than tolerated -- his personal diplomacy. Reagan once wrote Hammer, ''I value your insights on our policy toward the Soviet Union.” Clinton turned to Congressman Bill Richardson to be his “informal undersecretary for thugs,” as Richardson jokingly referred to himself, negotiating with dictators in places such as Iraq, Cuba, North Korea, and Haiti.\n\n\"Informal undersecretary for thugs\": Bill Richardson in 3-D glasses at a trade show in North Korea.\n\nBy the 20th century, presidents had far more institutional assets to rely on, but continued to look to independent diplomats to pursue their policies. During the early days of World War I, before America’s entry into the conflict in Europe, President Woodrow Wilson was at odds with his secretary of state, William Jennings Bryan. (Wilson and his top diplomat disagreed about what a policy of neutrality entailed; when a German U-boat sank the Lusitania, Bryan resigned over the president’s response). Wilson’s thinking, however, was in sync with that of Texas businessman Edward M. House, a friend and adviser who was so close that they had their own telegraph code. “You are the only one in the world to whom I can open my mind freely,” Wilson told House.\n\nIn both 1915 and 1916, Wilson sent House to Britain, Germany and France on peace-seeking missions. After the armistice he had a more formal role as a U.S. delegate at the talks that led to the Treaty of Versailles.\n\nEdwar M. House: He became Woodrow Wilson's go-to envoy because the President was at odds with his secretary of state, William Jennings Bryan.\n\nThe next president would also rely on an informal diplomat. Republicans were split, after the war, between internationalists and those who would keep America out of European entanglements. Warren G. Harding faced a Congress of his own party, but which largely opposed sending ambassadors who would get the U.S. mired in negotiations over such things as war reparations. Throughout the 1920s, Republican presidents would avoid conflict with Republican lawmakers by relying on freelancers.\n\nAmong them was James A. Logan Jr. According to historian John M. Carroll, “[i]t was Logan, and unofficial diplomats like him, who made it possible for the United States to carry out a constructive foreign policy of involvement in European affairs during the 1920s.” Carroll argues this arrangement wasn’t just expedient but had advantages over the stiff traditions of the striped-trouser crowd: “In general, Logan, not restrained by the usual diplomatic protocol, won the confidence of European as well as American leaders through his forthright and candid reports and conversations.”\n\nThe most influential and consequential of the informal diplomats would come in Franklin Roosevelt’s presidency. After running several New Deal agencies and doing a stint as secretary of commerce, Harry Hopkins settled into a role even more powerful – presidential confidant. “Everything has to seep through Harry Hopkins into the White House,” complained Cabinet member Harold Ickes. “It is bad for the country to get the impression that any one person, no matter how strong and able he may be, is sharing in the President’s councils to the exclusion of all others and perhaps influencing his judgment unduly.”\n\n1945: Harry Hopkins and FDR chat in Saki in the Crimea before heading to the Yalta Conference with Stalin and Churchill.\n\nHopkins may have been “the back door to the White House,” but he occupied even more prestigious real estate by actually living in the White House, the halls of which he would stroll in a silk robe. Hopkins had been in charge of various alphabet-soup agencies during the New Deal, including the WPA. But he had far more power, as the New York Times Magazine described him, “as a White House guest and the man closest to the president.” Time magazine went further: “Harry Hopkins,” read a profile from April 1944, “comes closest to being the real assistant president of the U.S.”\n\nPersonal envoys who aren’t official diplomats have always rankled the State Department, which sees itself as holding a monopoly on forming foreign policy and negotiating to secure American interests (even if its workings aren't completely transparent, as with Secretary of State Hillary Clinton's private email setup, to take a recent notable example). Foggy Bottom doesn’t view its role as simply fulfilling the president’s druthers, which can be frustrating for a president. So it’s no surprise that President Trump might feel the need to do an end-run around State, a department he trusts perhaps even less than it trusts him.\n\nBut even a president as responsible for creating Washington bureaucracies as FDR felt the need to go around his official officials. In a 2015 biography of Hopkins, Christopher O’Sullivan wrote that by sending Hopkins to meet with Joseph Stalin in 1941, FDR “would bypass the State Department with its anti-Soviet officials whom Hopkins deemed too consumed with their ideological hostility to the USSR to focus on the larger goal of defeating Hitler.”\n\nWas that a good idea? Perhaps not, if Hopkins was the communist sympathizer, dupe, or even Soviet agent he has variously been alleged to have been. Hopkins was also accused of using his relationship with the president as a vehicle for collecting boodle abroad. It was widely reported that the Brit in charge of war materiel had given Hopkins’ wife, Louise, an emerald necklace worth $500,000. She denied it, which did little to silence critics. Michigan Republican Congressman Roy O. Woodruff sneered that “some people regard it as significant that Mrs. Hopkins specifically stipulated that Lord Beaverbrook had given her no emeralds, instead of making her denial cover diamonds, gems, or other gifts of great value.” If Giuliani is accused of profiting from his role as an independent envoy, he won’t be the first.\n\nJ. Paul Austin (above and top with Fidel Castro): He wanted to help a President. He also wanted to open a Coca-Cola bottling plant in Cuba.\n\nEven those with official diplomatic credentials can get outside of their lanes. Ronald Reagan named his friend William A. Wilson ambassador to the Vatican. But instead of focusing his official efforts on representing the U.S. before the Holy See, Wilson met on the QT with representatives of Libya. Secretary of State George Shultz was not happy with Wilson’s independent initiative.\n\nGiuliani’s freelancing has been characterized by many Republicans as an effort to get at the truth. Democrats and most media describe his actions differently – as “unlawfully wielding political influence,” a blatant conflict of multiple interests, representing not only the president but also “clients with cases to plead before the Justice Department.”\n\nWhether such conflicts are unlawful will perhaps be sorted out. But potential conflicts are a standard hazard of freelance diplomacy. An example that is both typical and extreme: In February 1978, President Carter sent not just a private envoy to Cuba but one who had significant personal business interests in normalizing relations between Washington and Havana. The unofficial diplomat was Carter’s old Georgia friend and booster, J. Paul Austin, the CEO of Coca-Cola.\n\nAccording to “Back Channel to Cuba” by William LeoGrande and Peter Kornbluh, Austin had already been to Havana in the summer of 1977 where he “met with Fidel Castro to discuss the possibility of opening a Coca-Cola bottling plant in Cuba” – a literal instance of what was jokingly called “Coca-Cola diplomacy.”\n\nBefore Austin returned to Cuba in 1978 on behalf of Carter, the president first sent him in 1977 on a mission to Egypt. There he acted as an unofficial presidential envoy, engaging in “wide-ranging talks with Egyptian President Anwar Sadat.”\n\nRudy Giuliani with Ukrainian President Petro Poroshenko, left, in Kiev in 2017. If Giuliani is accused of profiting from his role as an independent envoy, he won’t be the first.\n\nCarter used Austin in part because official government entities were busy trying to further their own policy agendas instead of promoting the president’s goals. Austin’s 1978 mission to Havana came amid Cuba’s expansion of its influence in Africa: The “State Department and NSC [were] battling over how to respond.” Carter wanted an envoy who would represent him, not Foggy Bottom. “I asked Paul to go down as my emissary,” Carter said to LeoGrande and Kornbluh. “I felt that this would be a good way for me to have a direct assessment of what Castro’s commitment was.”\n\nAustin overdid it. He proposed to Castro not only a summit in the United States but that the Cuban dictator come join the Carters for Christmas in Plains. A Carter-Castro Christmas never came off, and the affair left official officials rolling their eyes. “It was a good lesson not to rely on non-professionally trained people to conduct private negotiations,” recounted Carter’s national security adviser, Zbigniew Brzezinski, “because there was a real disconnect between what the guy was sent to talk about and what he came back with.”\n\nThat may be the prime liability found in a century of independent diplomacy – what a president gains in nimbleness and flexibility he loses in organized, consistent policy. Perhaps some wrongdoing will be found to attach to Giuliani in the Kiev controversy. But the bigger problem for the Trump administration is that the president has had so little trust in his official advisers and factotums that he has had to turn to outside loyalists.", "description": "Above, Coca-Cola boss J. Paul Austin visits Fidel Castro in 1977. The next year he was Jimmy Carter's personal envoy to Cuba, even though he had a personal business interest. \nBy Eric Felten,...", "authors": ["Jean-Antoine Houdon Wikimedia", "Ap Photo David Guttenfelder", "William Orpen", "Goshow Wikimedia", "Fabian Bachrach Wikimedia", "Mikhail Palinchak", "Presidential Press Service Pool Photo Via Ap"], "top_image": "https://assets.realclear.com/images/49/492024_5_.jpg", "published_at": "2019-10-23"}