{"pub": "marketwatch", "url": "https://marketwatch.com/story/a-letter-from-a-reader-on-the-poverty-line-i-know-what-it-means-to-go-hungry-for-five-days-until-you-get-your-next-paycheck-2019-08-25?mod=rsswn", "downloaded_at": "2019-09-13 07:16:20.631179+00:00", "title": "‘This money has been a life changer’ — a woman living on the poverty line inherited $150K and shares her financial plan", "language": "en", "text": "This woman from Texas, then 36, wrote to the Moneyist in September 2018. She didn’t have a college degree, said she would never earn more than $30,000 a year, and worked full-time for $15 an hour, in addition to a part-time job at $10 an hour. She paid $1,050 a month in rent.\n\nThe reason for her letter: She was about to inherit $150,000. It was more money than she had ever had in her life. She had grown up in a family that had experienced generations of poverty. It was a life-changing opportunity for her, and she didn’t want to waste it.\n\nShe wanted to get dental work done, invest some money and, if she could afford to, buy a house. “I feel like this money is my chance to finally be financially safe and maybe have a shot at retiring. I’m just not sure which one will get me there safely and hopefully before I’m 70,” she wrote.\n\nYou can read her original letter and the Moneyist’s advice here.\n\nShe sent this letter this month (August 2019) to say what she did with the money.\n\nHere is an edited version of her letter:\n\nDear Moneyist,\n\nFirstly, thank you for your advice. I took all of it to heart and really sat down and considered my options, and, after some really detailed research online, I did come up with a plan on how to spend the money. Secondly, to anyone who laughed at my letter, and the notion that $150,000 could somehow change my life: My life might seem small to you, but I know what it costs to live in this country.\n\n‘Maybe if I had learned something useful in school I would have made a better go of it and not been so far down on the economic ladder that my mouth hit the floor at the thought of having $150,000 handed to me.’\n\nIt’s a price I’ve been struggling to pay since I was 17, and I will not be lectured by people who don’t know what it means to go hungry for five days until you get your next paycheck because you need that $20 you have left for gas to get to the job that will give you that paycheck.\n\nLet me begin by explaining that I was born into poverty. In many cases in this country, poverty is generational, and my family epitomizes this. I didn’t have a bad childhood, but our single-wide trailer certainly wasn’t glamorous. And my birthday and Christmas presents (if I got any) were definitely bought at a garage sale or at the thrift store. My parents tried, but they were both high-school dropouts. By 17, I was on my own.\n\nMaybe if I had learned something useful in school I would have made a better go of it and not been so far down on the economic ladder that my mouth hit the floor at the thought of having $150,000 handed to me.\n\nMaybe if instead of teaching me about Shakespeare and Orson Welles, our public education system taught me the power of compound interest, I wouldn’t be middle-aged and a low-income worker now. Maybe if instead of learning algebra or calculus, I had learned how to change a tire or do an oil change, and l could have saved myself a little money here and there to put toward an IRA or an investment account. Maybe if instead of having to take art or European history, I had learned how to balance a checkbook or even how to coupon; I could have a nice little retirement account now.\n\nMaybe if instead of having to take chemistry and physics, I had been taught some type of computer skill, and I would have a better job.\n\nDon’t miss: During stock-market volatility, how would you invest $100,000?\n\nSadly, our education system only cares if we are able to have an intelligent conversation about the Renaissance or the effect of the Enlightenment on the evolution of European politics and attitudes towards monarchial systems of government. Yep, I definitely needed to know all that. Those pearls of wisdom have done me loads of good in the real world. Not.\n\n‘Sadly, our education system only cares if we are able to have an intelligent conversation about the Renaissance or the effect of the Enlightenment on the evolution of European politics.’\n\nUnfortunately, as the U.S. public education system did absolutely nothing to prepare me for the real world, and my parents definitely weren’t acing it and had nothing of value to teach me, I learned the old-fashioned way: trial and error. I made mistakes and paid for every one of them — most of them on payment plans, but I paid.\n\nI was finally debt-free and content with my modest little savings of $7,981.33, but when I learned I was going to be getting roughly $150,000, I freely admit I had to sit down or I’d fall down. I felt a sense of hope, the kind of hope I’d never known. I’ve always been one small misstep away from homeless. I have, in fact, lived out of a car at various points in my life.\n\n‘This money has been a life changer for me’\n\nThis money has been a life changer for me. Well, for starters, the final amount I got was $157,998.14. I decided against moving. I do really love my job and got a promotion as an incentive to stay. So I now make $16 an hour. I also decided against buying a house. Instead, I took three weeks off and spent $5,600 to go to this DIY build-a-tiny-house camp a few states away. I built my own off-grid tiny house for about $31,000, and that includes the cost of the camp.\n\n‘I built my own off-grid tiny house for about $31,000, and that includes the cost of the camp. I have a solar roof and two small wind turbines that generate all the power.’\n\nI have a solar roof and two small wind turbines that generate all the power, and a rainwater harvesting/purification system with a water heater and a recirculating shower that ensures I never run out of clean or hot water. Most of the tiny house is made from repurposed materials I got off of Craigslist. Pretty much everything — stove, microwave, sinks, vinyl siding, etc. — I got on Craigslist. I finished it a little over six months ago and have been living in it ever since.\n\nI am also able to park it for free. I found an advertisement on Craigslist posted by a group of people who all co-owned 50 acres with horses. They were looking to hire someone to go there once a day to feed and water the horses, and check up on them for $100 a week. They agreed to let me park there, and they are still paying me the $100 a week. So I now have no rent, and no electric or water bill. My monthly expenses have gone way down. And the horses are really nice.\n\nI now only have to pay for food, gas, car insurance, health insurance and my cell phone. So my monthly bills come to about $700 to $800, and half of that is life insurance. I took people’s advice to get my dental work done in Mexico. I spent about $7,000 on my teeth, and it was so worth it. I have a beautiful smile now!\n\n‘I spent some money on what I would call frivolous things’\n\nI also spent some money on what I would call frivolous things. I bought about $500 in massage and chiropractic Groupons throughout the Dallas–Fort Worth metroplex. I started taking violin lessons online for $15 for 30 minutes, twice a week. I bought a used violin from a reputable dealer in Dallas for $375. I also gave a few friends and family some money to help them out: I paid $1,600 for one of my friends to go to dental-assistant school. I bought new tires for my brother, and I paid $1,900 for another friend to get dental work done with me in Mexico.\n\n‘I took people’s advice to get my dental work done in Mexico. I spent about $7,000 on my teeth and it was so worth it. I have a beautiful smile now!’\n\nBy the time everything was said and done I had $111,723.02 left. I maxed out my IRA last year and this year, and then I invested $10,000 between very safe dividend stocks and ETFs.\n\nI did do something pretty risky, which I hope pays off in the long run. After reading every single investment article and book I could get my hands on, I invested primarily in emerging markets instead of the U.S. stock market. I put $30,000 into them. Not putting in any more. They either pay off, or they don’t. I now am able to put $1,600 a month away into my savings and investment portfolio between my two jobs and the horse-care income.\n\nAlso see: Should I sell my $565,000 duplex and invest the money — or continue to collect rent?\n\nI am looking to quit my second job here in a few months. With the raise from my primary job and the $400 a month I make taking care of the horses, and my reduced living expenses, I can afford to stop working 60- to 70-hour weeks. As of this exact moment I have no debt; my car is paid off with only 42,000 miles. I own my tiny home free and clear. I have more than $70,000 in a high-yield online savings account, making a little over $100 a month in interest. I have $4,500 in my checking account, and I have a retirement/investment portfolio with more than $40,000.\n\n‘I did something pretty risky, which I hope pays off in the long run. I invested primarily in emerging markets instead of the U.S. stock market. I put $30,000 into them.’\n\nI’m in a better position than I ever thought I would be, and, after 20 years of working two to three jobs at a time, I think I’ve earned a 35- to 40-hour work week. I’ll still be able to put about $800 a month away in savings and investments.\n\nSo that’s what I did with the money, and it most certainly did change my life. My new hope for the future is to find a nice little rundown three-bedroom farmhouse on a few acres in the country that I can buy for cheap and restore myself. That way, when I’m 55, I can retire with no debt and get a few horses of my own. I just want to live out the rest of my life never having to worry about bills again. I don’t need fancy vacations to Europe or a Cadillac. I just want to finally not have to work anymore, and maybe have a few horses I can ride every day and a comfortable home to come back to each night.\n\nIt might seem like a small and sad little life to some people, but it’s the kind of life I never dreamed of having when I was younger. Now, it’s coming true.\n\nSincerely,\n\nStill Low-Income in Texas, But Definitely Feeling Rich Now\n\nDo you have questions about inheritance, tipping, weddings, family feuds, friends or any tricky issues relating to manners and money? Send them to MarketWatch’s Moneyist and please include the state where you live (no full names will be used).\n\nWould you like to sign up to an email alert when a new Moneyist column has been published? If so, click on this link.", "description": "This woman told MarketWatch: ‘I know what it means to go hungry for five days until you get your next paycheck.’", "authors": ["Quentin Fottrell", "Personal Finance Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ881_WomanP_ZG_20190908141225.jpg", "published_at": "2019-08-25"}