{"pub": "politico", "url": "https://politico.com/story/2019/09/16/california-republicans-trump-campaign-stop-1497447", "downloaded_at": "2019-09-16 23:12:57.208029+00:00", "title": "Trump’s California fundraisers are drenched in cash — and secrecy", "language": "en", "text": "President Donald Trump’s California fundraisers have attracted a new set of Republican donors and bundlers eager to be in the room with him in Northern and Southern California events. | Mark Wilson/Getty Images White House Trump’s California fundraisers are drenched in cash — and secrecy Donors are snapping up tickets, even if they don’t know exactly where the events are being held.\n\nSAN FRANCISCO — Donald Trump remains unpopular in the state where he lost to Hillary Clinton by a landslide: his job approval ratings in California are among his worst in the country.\n\nBut among state Republicans here, it’s a different story. And they’ve snapped up tickets to four sold-out, high-dollar fundraisers for the president.\n\nStory Continued Below\n\nThe events are shrouded in secrecy to a large extent, necessitated by the deep hostility many in the state feel toward the president.\n\nStill, the tickets have sold “faster than Mick Jagger,’’ laughs former state party chair Shawn Steel, a Republican National Committee member and a Trump bundler.\n\n“There’s a lot of love here for him,” says Steel, pointing to more than 1,000 Republicans, “donors at every level,” who have clamored for tickets to four events within the next 24 hours including a lunch in Silicon Valley, two events in the Los Angeles/Beverly Hills area — a dinner Wednesday and a breakfast Thursday — and another lunch in San Diego on Thursday.\n\nAlready, state donors have given generously to his re-election campaign and the joint fundraising committee with the RNC, ponying up $6.5 million in checks from January to June of this year alone. At the Sept. 17 luncheon stop in the Bay Area, ticket prices range from $1,000 to $100,000.\n\nThis week, Trump’s California fundraisers have attracted a new set of Republican donors and bundlers eager to be in the room with him in Northern and Southern California events, which could raise upward of $15 million, party insiders say.\n\n“My husband and I have maxed out — and I’ve never maxed out for anybody, ever,’’ said San Francisco attorney Harmeet Dhillon, a former vice-chair of the party, who is hosting two tables at the Silicon Valley event. She says she has been deluged by requests for tickets from Republicans — big and small donors — who are desperate to be part of the scene.\n\nCalifornia Playbook newsletter Our must-read briefing on politics and government in the Golden State. Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\n“I’ve had to say no to at least 50 people in the last few hours,’’ said Dhillon, as she made the rounds at last week’s state GOP convention in Indian Wells. “I sold out four tables very easily, and a lot of them are big donors,’’ she said. “I could have sold another $100,000 worth of tickets.”\n\n“There are many more people who wanted to attend than we have capacity,’’ noted Dhillon, who was recently introduced by Trump at the White House during an event for social media insiders. “They’re excited because we’ve had surrogates like Don Jr. come out — but this is the real thing.’’\n\nAttendees at Tuesday’s event are not being provided with the address of the actual lunch — they are being told to meet at a shuttle location, sources said.\n\nThe concern comes after news of the Hollywood-area fundraiser sparked controversy when actors Debra Messing and Eric McCormack called for outing attendees. Demonstrators have been trying to ferret out locations of the fundraisers, promising to stage protests and appearances by the giant “baby Trump” balloon. The president’s last campaign foray to the Bay Area, at an April 2016 GOP convention in Burlingame, didn’t go so well — it featured the sight of Trump climbing a highway median to avoid protesters who blocked his hotel entry.\n\nDhillon said the Trump team is “taking no chances after the San Jose situation,’’ a reference to a different 2016 incident when Trump supporters were attacked outside of his rally at the San Jose Convention Center prior to the election. Tuesday’s Bay Area lunch, originally scheduled for tony Atherton, apparently changed venues.\n\n“We originally got word he was coming [to Atherton], and the last update I got was that he was not coming,” Dan Larsen, a sergeant with the Atherton Police Department, told the Mercury News Friday.\n\nWhile the White House and Trump re-election campaign declined to confirm the actual location, sources familiar with the event say the Bay Area fundraiser will be held at the Woodside estate of private equity firm CEO Saul Fox, who hosted Trump at his home for a 2016 fundraiser. Fox, who heads the firm Fox & Paine, is the GOP mega-donor behind Children of Israel LLC, whose $884,000 in contributions has made it “the second-most generous ‘ghost corporation’ in the 2016 cycle,’’ according to The Intercept.\n\nThe wealthy Peninsula community that’s home to Fox’s estate is also home to tech giants like Larry Ellison and Democratic venture capital star John Doerr, who famously hosted President Obama and tech titans — including Steve Jobs and Mark Zuckerberg — at a 2011 dinner in his nearby Woodside mansion.\n\nThe San Mateo County Sheriff’s Department referred calls on the matter to the White House press office.\n\nAfter his Bay Area stop, the president will fly to Southern California for an evening event in the Beverly Hills-Bel Air 90210 area code. The fundraiser, held during Emmy Week — when awards celebrating the television industry, a favorite target of Trump’s commentary, are handed out — is hosted by a longtime supporter, billionaire real estate mogul Geoffrey Palmer.\n\nPalmer, who donated more than $4 million to GOP causes in the 2018 cycle, is one of the early donors to Rebuilding America Now, the pro-Trump SuperPAC founded by former Trump campaign manager Paul Manafort — now serving time for fraud — and Trump business ally Tom Barrack.\n\nTickets go from $1,000 to $10,000 per couple for a photo op at the event which, according to an invite, is also hosted RNC chairwoman Ronna McDaniel, RNC co-chairman Tommy Hicks Jr., campaign manager Brad Parscale and Trump Victory finance chairman Todd Ricketts.\n\nLanhee Chen, a former adviser to presidential candidates Mitt Romney and Marco Rubio, says California Republicans of all stripes are eager to get in on the president’s first big fundraising foray here. One reason is their support for his contentious relationship with the state’s Democratic leaders, who have filed more than 50 lawsuits against his administration.\n\n”They’re energized by these fights between him and the left-leaning Democrats,''' Chen said, \"and they think he’s taking it to them.”\n\nAmong those eager Republicans ready to write checks to Trump’s campaign are Celeste Grieg, a former head of the California Republican Assembly — one of the most conservative grassroots groups in the GOP — who will be at his event in Bel Air.\n\n“I’m going because he’s done a great job, maybe not perfect — but a great job,’’ said Grieg. “Yes, he’s pissed some people off, but that’s what he is...people have to get over that.’’\n\nGrieg says attendees have been promised appearances by Clint Eastwood — a movie icon who also served as the former mayor of Carmel, California — and Mel Gibson, another conservative Hollywood voice. And that, she says, is a welcome counter to high-profile Democratic Hollywood voices like Messing.\n\nThe next day, the president hits the San Diego area for another sold out fundraiser that insiders say is slated to raise $4 million for the Trump re-election campaign.\n\nCalifornia GOP chair Jessica Millan Patterson says that Trump’s successful fundraising here underscores how Republicans in solidly blue California are clearly uniting behind the president as 2020 approaches — and how Trump’s popularity has translated into more money for the state party as well.\n\nPOLITICO Playbook newsletter Sign up today to receive the #1-rated newsletter in politics Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nAccording to the most recent poll from the Public Policy Institute of California, Trump’s approval rating among Republican likely voters is 89 percent. Among all likely voters, his approvals are just 38 percent.\n\n“We certainly are on the right track. We were obviously outspent in 2018 by $100 million,’’ she said in regards to fundraising. “[But] so far, there’s 6,400 new donors on the smaller level, and 72 large scale major donors...so we’re on the right track. And “we’re $1.3 million ahead in commitments than we were in 2017,’’ she says.\n\nBill Whalen, a Hoover Institution fellow who advised former GOP Gov. Pete Wilson, says that despite California’s solidly blue status and the state GOP’s collapse here, “people tend to forget that nearly 4 million voted for him in California in 2016..so it’s not like he’s without friends here.’’\n\n\"No sane political consultant thinks that Trump has a chance to win in California in 2020,’’ Whalen says. But the sold-out fundraisers reveal GOP appreciation of the president’s engagement on California issues that matter to them such as homelessness, energy or auto emissions standards.\n\nThe question coming out of these event for Trump, he said, will be: “Is this a one-off, or will there be any lingering presence in California?\"\n\nSteele predicts that the demand for tickets, and the size of Trump re-election multi-million dollar campaign haul from California this week is “going to be enough to encourage him to keep coming back.”", "description": "Donors are snapping up tickets, even if they don’t know exactly where the events are being held.", "authors": ["Carla Marinucci"], "top_image": "https://static.politico.com/a9/3e/d606c5a744ca80cfd4dd901d088c/190916-trump-hand-getty-773.jpg", "published_at": "2019-09-16"}