{"pub": "bbc", "url": "https://bbc.co.uk/news/entertainment-arts-49837511", "downloaded_at": "2019-09-26 14:51:53.533868+00:00", "title": "BBC gives more detail on Naga Munchetty ruling", "language": "en", "text": "Image copyright Getty Images\n\nThe BBC has released more detail on its decision to uphold a complaint against news presenter Naga Munchetty.\n\nThe BBC Breakfast host was found to have breached guidelines by criticising President Donald Trump after he said four female politicians should \"go back\" to \"places from which they came\".\n\nThe corporation said its editorial guidelines \"do not allow for journalists to... give their opinions about the individual making the remarks or their motives for doing so - in this case President Trump\".\n\nThe statement added: \"It was for this reason that the complaint was partially upheld. Those judgements are for the audience to make.\"\n\nIt also said that President Trump's comments were \"widely condemned as racist, and we reported on this extensively\".\n\nA letter to the complainant revealed the BBC had said that by commenting on Trump's \"possible motive\" and the \"potential consequences\" of his statement, Munchetty had gone \"beyond what the guidelines allow for\".\n\nThe BBC added in the letter that \"audiences should not be able to tell\" the opinions of its journalists on matters of public policy.\n\nThe corporation also released a full transcript of the 17 July broadcast.\n\nMunchetty's comments came after an interview with a supporter of the president.\n\nAddressing the \"go home\" comment, presenter Dan Walker said: \"That was the most telling quote for me last night. I can't remember who said it but she said I've been told to go home many times to go back to where I've come from in my life but never by the man sitting in the Oval office.\"\n\nShe said: \"Every time I have been told, as a woman of colour, to go back to where I came from, that was embedded in racism.\n\n\"Now I'm not accusing anyone of anything here, but you know what certain phrases mean.\"\n\nImage copyright Getty Images\n\nWalker then said: \"You're sitting here not giving an opinion, but how do you feel as someone when you've been told that before, and when you hear that from him?\"\n\nTo which Munchetty replied: \"Furious. Absolutely furious. And I imagine a lot of people in this country will be feeling absolutely furious that a man in that position feels it's okay to skirt the lines with using language like that.\"\n\nWalker then asked: \"So you feel his use of that then legitimises other people to use this...\"\n\n\"Yes.. yes,\" replied Munchetty.\n\n\"It feels like a thought-out strategy, to strengthen his position,\" noted Walker.\n\nMunchetty added: \"And it is not enough to do it just to get attention… he's in a responsible position.\"\n\nImage copyright Getty Images Image caption Dan Walker replaced Bill Turnbull as a BBC Breakfast presenter in 2016\n\nShe has received messages of support after the corporation's complaints unit, the ECU, partially upheld the complaint against her.\n\nOn Thursday, Labour leader Jeremy Corbyn described the decision as \"astonishing\".\n\nExplaining their thinking, the BBC's letter continued: \"Due impartiality does not require absolute neutrality on every issue or detachment from fundamental democratic principles. And the president's remarks were widely regarded as racist and condemned in the UK across the political spectrum.\n\n\"Ms Munchetty had been pressed to comment by her co-presenter and had a legitimate, personal reason for feeling strongly on this issue. She was therefore in our view entitled to give a personal response to the phrase 'go to back to your own country', as it was rooted in her own experience of racism and in a generally accepted interpretation of that phrase.\"\n\nAdding: \"But it is also evident that Ms Munchetty, despite at the end of the exchange acknowledging 'I am not here to give my opinion', did comment directly and critically on the possible motive for, and potential consequences of, the president's conduct, which by their nature were a matter for legitimate discussion and debate. This, in our view, went beyond what the Guidelines allow for under these circumstances, and on those grounds I am therefore upholding your complaint.\"\n\nThe BBC's spokeswoman said Munchetty was not available for comment.\n\nA summary of the complaint and the ECU's decision on what action to take, if any, will be published on the BBC's online complaints pages and will \"include a note of any action taken as a result of the finding\", the BBC added.\n\nFollow us on Facebook, or on Twitter @BBCNewsEnts. If you have a story suggestion email entertainment.news@bbc.co.uk.", "description": "The corporation says its journalists should not give personal opinions on public matters.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/F2D7/production/_108976126_nagagetty20.jpg", "published_at": "2019-09-26"}