{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/10/07/biden-campaign-spox-hunter-had-permission-to-serve-on-ukrainian-gas-companys-bo-n2554315", "downloaded_at": "2019-10-07 23:32:05.810548+00:00", "title": "Biden Campaign Spox: Hunter Had Permission to Serve on Ukrainian Gas Company's Board", "language": "en", "text": "Former Vice President Joe Biden's Deputy Campaign Manager, Kate Bedingfield, appeared on MSNBC to talk about the veep's opinion piece in the Washington Post. During the interview she made a rather shocking admission: Hunter Biden received permission from the Obama White House to sit on the Ukrainian oil company's board of directors. Remember: Hunter was being paid $50,000 a month even though he had no natural energy experience and his father was working on foreign relations with Ukraine at the time.\n\n“There were unfounded claims against him. For example, in this Washington Post report he writes, and we read it, he talks about ‘He will not go after my family, he will not take down my family or destroy my family. But he doesn’t get explicit about Hunter himself. Why is that, Kate?” host Hallie Jackson asked.\n\n\"He has. He’s been asked and he said, ‘Look, every single independent outlet that’s looked into this has said there was no issue of wrongdoing here.’ And you know in 2014 the White House cleared Hunter serving on that board,\" Bedingfield said. \"So he has absolutely been asked that question and he’s answered it many times.\"\n\nAccording to Bedingfield, the Biden campaign refuses to \"play by Donald Trump's rule book.\" She said she anticipates Trump trying \"to change the subject and we’re not going to let them do that. We’re not going to let them do that. We’re going to hold them accountable and we will remind voters what kind of administration Donald Trump is running.”\n\nBedingfield's statement runs contradictory to what Biden has previously said. He previously said he never spoke of business dealings with his son. If Hunter received permission to serve on the board of directors, how did this not come up in conversation between the father and son pair?\n\n\n\n", "description": "Bombshell..10/07/2019 19:30:17PM EST.", "authors": ["Beth Baumann", "Guy Benson", "Timothy Meads", "Julio Rosas", "Cortney O'Brien", "Sarah Lee"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/276/8be9d20b-6f41-4341-8dc9-4312049fbc0f.png", "published_at": "2019-10-07"}