{"pub": "afr", "url": "https://afr.com/policy/economy/does-china-have-us-over-a-barrel-20191011-p52zq1", "downloaded_at": "2019-10-11 05:10:37.728422+00:00", "title": "Does China have us over a barrel?", "language": "en", "text": "Little examined, however, is whether the conventional wisdom is right. There is little doubt that China has the will and the means to sanction Australia but there is scant discussion of the other side of the ledger, of the willingness of China to absorb the damage such measures would inflict on itself.\n\nWith ties in such disarray, the fear of coercion is entirely rational. In recent years, Beijing has used its growing economic weight to sanction numerous countries, most notably South Korea in 2017 in retaliation over its deployment of a US missile shield that China said infringed on its sovereignty.\n\nChina and Australia are kind of in a multi-scrotum clutch on iron ore. They are not going to hurt us. We are not going to hurt them. — Anonymous Australian mining executive\n\nBeijing restricted rare earths exports to Japan in 2010 after a territorial dispute flared up. The same year, Norwegian salmon imports were cut when a Chinese dissident was awarded the Nobel Peace Prize.\n\nThe Philippines suffered in 2012 and 2016 when their disputes with Beijing in the South China Sea were reignited. Visits by the Dalai Lama have often been followed by cancellations of export orders.\n\nAustralia might be considered especially vulnerable right now. Much of the country’s recent GDP growth is due to higher exports, as China’s ambassador in Canberra pointedly noted in a newspaper interview to mark the 70th anniversary of the People’s Republic.\n\nIf Australia does manage a budget surplus, it will be made in China, courtesy of higher-than-expected iron ore prices, driven by strong steel production in China and supply disruptions in Brazil. About 40 per cent of Australia’s goods exports in July went to China, a record.\n\nChina is already engaged in low-level coercion, conducting go-slows on the unloading of Australian thermal coal and leaving the threat of anti-dumping duties hanging over local barley exporters.\n\nAdvertisement\n\nNone of it so far, though, is the stuff of day-to-day headlines.\n\nAt the moment, few Australian miners lose sleep about Beijing cutting iron ore imports to pressure Australia. Along with Brazil, Australia has the market locked up, as reliable, high-quality sources are not available elsewhere.\n\n“China and Australia are kind of in a multi-scrotum clutch on iron ore,” one of Australia’s best-known mining executives told me. “They are not going to hurt us. We are not going to hurt them.” The same goes for metallurgical, or steel-making, coal.\n\nSooner or later, Australia will be tested. It will be at a time and in a sector of Beijing’s choosing.\n\nChina could limit the flow of students, though this would both be difficult bureaucratically and run against the notion that middle-class Chinese families have the right to educate their children overseas.\n\nLikewise, with tourists, most of whom fly here on state-owned Chinese airlines from state-owned airports, none of which want to be forced out of what they see as a valuable, prestigious business.\n\nOn top of that, punishing Australia would reverberate in other countries re-negotiating their ties with China, such as Germany, France and Canada, and cause them to harden their own views towards Beijing.\n\nStill, it would be foolhardy to think that China will not try to extract an economic price at some stage. Beijing is courting Latin American countries, such as Brazil and Argentina, as well as building its Belt & Road initiative in Eurasia.\n\nAdvertisement\n\nBoth regions are rich in resources and fertile farmlands, qualities that are already proving useful for China as it looks to diversify suppliers for products that it now imports from the US and Australia.\n\nBeijing might not be able to tip Australia into a depression, but there is little doubt that Beijing has the tools to punish Australia in ways that would hurt jobs and hit the budget.\n\nGiven the febrile nature of local politics, Beijing could easily cause a momentary political panic simply by targeting areas of rapidly growing trade, such as meat, wine and vitamins, all with the power to lobby Canberra to change China policy.\n\nAustralia may yet pull off the trick of pushing back against China, through greater military spending and anti-foreign interference measures, while maintaining a healthy trade relationship at the same time.\n\nBut sooner or later, and well before such an equilibrium is reached, Australia will be tested. It will be at a time and in a sector of Beijing’s choosing. Only then will Australians will see if the tough-on-China talk is bluster.\n\nRichard McGregor is a Senior Fellow at the Lowy Institute in Sydney.", "description": "It is a mistake to think that our economic ties to China won't get politically tested at some point.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_1.6335%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_215%2C$y_388/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/b59bdb54ca210002ccdaeb924837af6e1d4cea98", "published_at": "2019-10-11"}