{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/question-time-julia-hartley-brewer-20556350", "downloaded_at": "2019-10-11 00:18:33.415220+00:00", "title": "Question Time: Julia Hartley-Brewer slammed for 'quasi-religious death cult' barb", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nControversial columnist Julia Hartley-Brewer has been slammed for describing the Extinction Rebellion as a 'quasi-religious death cult' on Question Time.\n\nMrs Hartley-Brewer clashed with Extinction Rebellion spokesman Rupert Read after he issued a warning about the unfolding climate catastrophe on the BBC debate show last night.\n\nMr Read defended climate change activists over their current protests in London and dismissed concerns about the demonstrations inconveniencing normal people.\n\nHe warned that the 'real disruption' would come in the form of crop failures and children's fears for their future, although Mrs Hartley-Brewer said he was 'scaremongering'.\n\nTwitter users blasted Mrs Hartley-Brewer for making up 'desperate' claims about the movement and said they were tuning out because of her rant.\n\nMr Read said: \"Forget about polar bears and penguins, precious and beautiful though they are.\n\n\"This is about us now. This is about the fact that last summer the crops in this country were failing as they baked in the fields.\n\n\"This is about the vulnerability of our food supply. This is not even about our children or our grandchildren anymore. This is about the intense vulnerability of our whole society to this catastrophe that is already descending on us.\"\n\nHe added that the movement planned to carry out non-violent civil disobedience, drawing inspiration from the suffragettes, Martin Luther King and Gandhi.\n\nJulia Hartley-Brewer, a newspaper columnist and Talk Radio host, said: \"There is nothing in any of the science nothing in any of the IPCC reports that suggests we are heading towards a catastrophe, a crisis, mass extermination or anything of the sort.\n\n\"This is scaremongering of the worst kind. What we've got with Extinction Rebellion, I'm afraid, is not a sensible debate based on science or the facts it is to all intents and purposes a quasi-religious death cult.\"\n\nMr Read jokingly apologised for not being a member of a cult in response to her tirade.\n\nHe said the International Monetary Fund had warned of 'catastrophic and irreversible disaster, implying potentially infinite costs of unmitigated climate change, including, human extinction'.\n\nThe University of East Anglia professor added: \"You want to see real disruption, crop failures, children not knowing whether they are going to have a future at all, that's the real disruption.\"\n\nMrs Hartley-Brewer hit back by describing his statements as 'Malthus on crack cocaine', referring to the 19th century political theorist Thomas Malthus who proposed controversial methods of population control.\n\nShe said: \"This is nonsense... this sort of nihilistic 'the world is going to end' stuff.\n\n\"You have the cheek to talk about the suffragettes and the civil rights movement in the United States.\n\n\"Women didn't have the vote and neither did black people in America that's why they had to resort to that sort of action. You have the ballot box.\"\n\nThe columnist was slammed on social media for her attack on the Extinction Rebellion.\n\nOne Twitter user said: \"That's not a bad way to run your life. Every decision you ever have to make, just think 'what would Julia Hartley-Brewer do?' then do the exact opposite!\"\n\nSue Tibballs added: \"'Quasi-religious death cult' says Julia Hartley Brewer of @ExtinctionR on @bbcquestiontime Good grief. Can’t bear it. Going to bed.\"\n\nAnother tweeted: \"She’s just called Extinction Rebellion a 'quasi-religious death cult' on question time. So much hatred and bilge in this person. So sad.\"\n\nPhilip Churm wrote: \"On #bbcqt … @JuliaHB1 is making up strange and desperate claims about #ExtinctionRebellion to try and counter the considerably more sensible @GreenRupertRead - These include describing it as a 'quasi-religious death cult'!\"", "description": "Julia Hartley-Brewer said Extinction Rebellion spokesman Rupert Read was 'scaremongering' and described his Question Time speech as 'Malthus on crack cocaine'", "authors": ["Matthew Dresch"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20556357.ece/ALTERNATES/s1200/0_SDC_00034.jpg", "published_at": "2019-10-10"}