{"pub": "reuters", "url": "https://in.reuters.com/article/uk-hongkong-property-mortgages/loosened-lending-rules-in-hong-kong-stoke-optimism-for-small-apartment-sales-idINKBN1WW0YD", "downloaded_at": "2019-10-17 09:18:24.845858+00:00", "title": "Loosened lending rules in Hong Kong stoke optimism for small apartment sales", "language": "en", "text": "HONG KONG (Reuters) - Relaxed mortgage rules in Hong Kong that allow buyers to take on bigger loans will drive small-to-medium flat sales, property agents say, with the changes already prompting some sales.\n\nA general view shows residential apartment blocks in Hong Kong, China, June 26, 2019. REUTERS/Thomas Peter/File Photo\n\nHong Kong’s leader Carrie Lam on Wednesday expanded borrowers’ power by reducing the size of down payments required for home purchases as part of a slew of measures aimed at alleviating the city’s housing shortage.\n\nUnder the Mortgage Insurance Programme, borrowers can carry a loan-to-value ratio (LTV) as high as 90% on properties worth up to HK$8 million ($1 million). Before, such a high ratio was only permitted on properties worth half as much.\n\nBorrowers can get an LTV of 80% on properties worth as much as HK$10 million, previously capped at HK$6 million.\n\nThis means prospective home buyers will not need so much money up front; for example, the down payment on an HK$8 million home will fall to HK$800,000 from HK$3.2 million.\n\n“Last evening, our agents sold three apartments in Fanling (in the New Territories), which was a lot because there haven’t been 3 transactions for a whole month,” said Centaline Property Agency Asia Pacific residential chief executive Louis Chan.\n\nHe said that the transactions ranged from HK$4 million to HK$6 million and that the buyers hastened their decision after Lam’s announcement. The sellers also cut their price by 2-3%.\n\n“The new mortgage policy will help the secondary market for flats below HK$10 million,” Chan said. “In the last 8 years the demand for this segment has been suppressed by the restrictive policies and the transaction volumes have been very low.”\n\nPreviously, buyers were more likely to consider new homes, for which developers provided high LTV loans.\n\nSammy Po, residential chief executive of property agency Midland Hong Kong, said that about 10% of sellers of apartments valued below HK$8 million were raising their price by 3-5%, and that he expected a 2-3% price rise in small to mid-sized apartments in the fourth quarter.\n\nProperty developers plan to push out new launches faster on the news, with China Evergrande Group (3333.HK) expected to release the price list for its new development this week.\n\nMidland’s Chan, however, stuck with his original forecast of a 5% decline in home prices over the rest of the year, as the current protests and trade tensions between the U.S. and China weigh on the market.", "description": "Relaxed mortgage rules in Hong Kong that allow buyers to take on bigger loans will drive small-to-medium flat sales, property agents say, with the changes already prompting some sales.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191017&t=2&i=1441802250&w=1200&r=LYNXMPEF9G0LZ", "published_at": "2019-10-17"}