{"pub": "zdnet", "url": "https://www.zdnet.com/article/slack-says-it-now-has-12-million-daily-active-users", "downloaded_at": "2019-10-11 00:18:44.366309+00:00", "title": "Slack says it now has 12 million daily active users", "language": "en", "text": "Slack said on Thursday that it now has 12 million daily active users (DAUs) on its workplace collaboration platform, while also suggesting that its user base is more engaged than those on its biggest rival Microsoft Teams.\n\nSlack last issued updated user figures in January, when it claimed to have 10 million DAUs. But in July, Microsoft claimed to be beating Slack with 13 million daily active users on its Teams platform, further intensifying the collaboration-chat war between the two companies.\n\nHowever, Slack is now making the case that not all user numbers are created equal, citing \"deep engagement\" among its DAUs as evidence of its significant market penetration. Among its paid customers, Slack said users spend more than 9 hours a day connected to its service, including spending around 90 minutes per day actively using the platform.\n\n\"What does this active use look like? It adds up to more than 5 billion actions weekly on average, including reading and writing messages, uploading and commenting on files, performing searches, and, most importantly to us on the Platform team, interacting with apps,\" said Brian Elliott, Slack's VP and GM of platform, in a blog post.\n\nSlack doesn't name drop Microsoft Teams outright in that blog post, but background information sent by a Slack spokesperson highlights Slack's perceived competitiveness over its rival. For instance, a recent Okta report showed that, among Okta customers who use Office 365, Slack usage had grown from 11% to 31% between October 2018 to June 2019. Meanwhile, a Productiv case study showed Slack engagement in one customer was 10 times greater than in Teams.\n\nSlack said it's seeing similar levels of engagement across its customer base, including its top 50 customers, of which at least 70% are Office 365 customers and using Slack's Office 365 integrations.\n\nMicrosoft's 13 million DAU tally for Teams seemingly does not factor in user engagement. In fact, that figure is potentially inflated due to the way Microsoft bundles its Office 365 subscription. Essentially, anyone with an Office 365 license is counted as a Teams customer when they run any Office 365 software.\n\nTherefore, Slack can argue that its user numbers, while officially smaller than Microsoft Teams, reflect greater user engagement overall.\n\n\"While our DAU numbers continue to grow, we measure our success by the value our customers derive from Slack and that value is evident in how deeply they are engaged with our product,\" said Elliott. \"It's not a successful collaboration tool if people don't use it.\"\n\nRELATED STORIES:", "description": "The company is also citing \"deep engagement\" among its DAUs as evidence of its significant market penetration.", "authors": ["Natalie Gagliordi"], "top_image": "https://zdnet4.cbsistatic.com/hub/i/r/2019/04/27/0774d80e-e81d-47b1-ac80-876124592ef8/thumbnail/770x578/ef498de5866f6c917413bbd45219009f/slack.jpg", "published_at": "2019-10-10"}