{"pub": "bbc", "url": "https://bbc.com/news/uk-politics-50133448", "downloaded_at": "2019-10-23 08:42:51.677612+00:00", "title": "with problems and opportunities", "language": "en", "text": "Here it is. And here we go. The government has now published the pages and pages of new laws that need to be passed to make our departure from the EU happen.\n\nForget the meaningful vote, to get Brexit done - as the prime minister never tires of saying - this whole bundle of legislation has to pass.\n\nThe European Union (Withdrawal Agreement) Bill is a document of 110 pages that details exactly how Parliament is expected to put the deal that the prime minister agreed with his counterparts around the continent into UK law.\n\nFor Brexit watchers it is a big moment.\n\nTheresa May's government never got this far, stumbling too many times on getting Parliament to agree to the overall deal.\n\nBoris Johnson's government, having failed even to be able to ask MPs for a straightforward \"yes or no\" to the shape of the agreement, has now published the whole lot, which gives them both an opportunity, and two big problems.\n\nFirst, the opportunity.\n\nBoris Johnson is closer to getting MPs to agree to leave the EU than Theresa May ever was.\n\nMinisters and Tory MPs dare to believe that they just about have the backing of enough on the green benches to pass the actual deal, to win the principle in Parliament that on the terms agreed in Brussels last week Brexit can happen.\n\nAnd they will, not surprisingly given Boris Johnson's repeated public commitment to stick to the Halloween deadline for departure, do as much as they possibly can to make it happen.\n\nThey have failed though, twice now, to manage to hold a vote simply asking MPs for a straight yes or no to the overall shape of the agreement.\n\nRage in the Commons\n\nSo now, the government needs to try to persuade MPs to pass the whole lot - the complete bill.\n\nAnd that's where the government runs into problems.\n\nFirst off, scrutinising pages and pages of new laws. MPs like to take time to do that.\n\nAnd just as there is impatience among Brexiteers, there is rage tonight in the Commons at the pace at which the government is trying to get it through.\n\nMinisters have planned for sittings in the Commons until midnight; one minister suggesting earlier they could sit through the night if needs be over the next few days in order to stick to the prime minister's deadline.\n\nImage copyright Getty Images Image caption Speaker John Bercow told the government it could not hold a vote on its deal on Monday\n\nDon't forget it is not just Boris Johnson's self-imposed political deadline, 31 October is by law the current date when we are due to leave - unless and until the EU decides to grant an extension.\n\n(There's not that much doubt that the other 27 countries would grant an extension if the Brexit deal isn't done by then, but right now it is still an assumption, rather than something we can be completely sure of.)\n\nBut to pass the whole bundle of new laws by then is much harder for the government to do than agreeing the concept of the deal.\n\nProblem one is the timetable.\n\nThere is no question that the government wants to get the legislation extremely fast.\n\nMPs have been spitting chips in the Commons about the speed at which ministers are trying to move, as it gives them less time to look properly and understand what it all means.\n\nWhen the government needs to hold together a relatively fragile coalition of support without a majority, anything that makes MPs grumpy is a risk.\n\nYou might wonder after three-and-a-half years what more MPs have to say about Brexit? In one sense that's quite understandable.\n\nAs we read through the agreement in green and black, (not black and white this time), there is nothing at this stage that will come as an gigantic surprise.\n\nBut there is no question that the agreement in its full version will give MPs who are cross or worried about certain aspects of the plan more evidence to complain.\n\nBoris Johnson's Brexit deal\n\nImage copyright AFP\n\nKEY POINTS: What's new in the deal?\n\nPEOPLE'S VIEW: Do voters support the deal?\n\nEXPLAINED: What is the Withdrawal Agreement Bill?\n\nIN GRAPHICS: What happens now?\n\nYet with any legislation, once it is written down with the full terms and conditions, it takes on a different level of being real.\n\nAnd without question, for a piece of new law that has such consequences, the timetable the government is trying to pursue is rapid and therefore controversial.\n\nDiscussing hypotheticals about Brexit has gone on for a long, long time. Debating the realities of actual legislation is a different task.\n\nAnd before the proper debates can even get going tomorrow there will be a vote on the timetable that's needed if the government has a hope of sticking to the breakneck schedule.\n\nLose that and the chances of meeting 31 October look slim indeed.\n\nAnd chatter tonight about using aggressive tactics to force it through could put the frighteners on some of the MPs who are wobbly about voting with the government at all.\n\nBut one of the reason the government's rivals are so cross relates to the second problem for the government.\n\nThe opposition parties and different tribes of MPs will use this week as a chance to get their way on Brexit.\n\nThey don't have much time to work out the best way of making the changes they would like.\n\nBut as they debate the new legislation line by line, they do have the opportunity to try to remove the bits they don't approve of and add ideas that they do.\n\nStand by, therefore, for amendments from the different groups who are vying to change the course of what happens next.\n\nWhether it is another push for a second referendum, a move to a customs union, or a plan to make sure that MPs have a lock on leaving the transition period (the immediate period after Brexit, when the status quo more or less remains) to stay in the Brexit departure lounge until a free trade agreement has been concluded.\n\nIt is not certain that the rival factions in Parliament have enough numbers to make any of those big changes happen, or to remove any unpopular parts of the deal.\n\nBut it means the government will have to fight votes on issue after issue, debate after debate, with no guarantee of holding off their opponents.\n\n'No way on earth'\n\nIf, though, MPs change the agreement so much that it becomes unrecognisable to what was agreed with the 27 other member states, the prime minister is likely to pull the bill, give up on this part of the process, and try again to push for an election.\n\nOne Cabinet minister told me there was just \"no way on earth\" the government could go back to the EU and ask for something radically different in the treaty that has just been agreed.\n\nThere may be amendments that affect what the UK would do in future that ministers would be relatively relaxed about accepting.\n\nBut anything that puts a stick in the spokes of getting this deal through this Parliament, don't be surprised if before too long, Parliament is not in a row about this deal, but in an argument about whether or not it is time for a general election.\n\nPS we are now trawling through the details of the actual bill. It's quite possible that by the morning some nasties may have emerged that have not been obvious in the first few hours of reading!", "description": "Theresa May never got this far, but there is rage among MPs about how quickly No 10 wants to get its deal through.", "authors": ["Laura Kuenssberg", "Political Editor"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/FF0B/production/_109319256_img_0683.jpg", "published_at": "2019-10-21"}