{"pub": "investingcom", "url": "https://ph.investing.com/news/commodities-news/malaysia-pm-says-cant-provoke-beijing-on-south-china-sea-uighur-issue-59225", "downloaded_at": "2019-09-28 12:09:41.462153+00:00", "title": "Malaysia PM says can't provoke Beijing on South China Sea, Uighur issue", "language": "en", "text": "Malaysia PM says can't provoke Beijing on South China Sea, Uighur issue\n\nKUALA LUMPUR, Sept 28 (Reuters) - Malaysia does not want to\n\ntake a confrontational stance towards China over the disputed\n\nSouth China Sea and Beijing's alleged mistreatment of its\n\nminority Uighur Muslims, Prime Minister Mahathir Mohamad said in\n\nan interview published on Saturday.\n\nMalaysia is too small to face up to the Asian powerhouse,\n\neven though Chinese ships surveying its waters for oil and gas\n\nin South China Sea do so without permission, he told an online\n\nnews service during a visit to New York this week.\n\n\"We watch what they are doing, we report what they are\n\ndoing, but we do not chase them away or try to be aggressive,\"\n\nMahathir told BenarNews https://www.benarnews.org/english/news/malaysian/question-answer-09272019150003.html.\n\n\"The Malay states have existed near China for the past 2,000\n\nyears. We have survived because we know how to conduct\n\nourselves. We don't go around trying to be aggressive when we\n\ndon't have the capacity, so we use other means.\"\n\nHe said that in the past Malaysia used to send to China\n\n\"gold and silver flowers every year as a symbol of our being\n\npractically, well, subservient to them\".\n\nThis month, China and Malaysia agreed to set up a joint\n\ndialogue mechanism for the South China Sea, as ties between the\n\ncountries improve. China is Malaysia's biggest trading partner.\n\nChinese President Xi Jinping has been overseeing a sweeping\n\nplan to refurbish its army as the country ramps up its presence\n\nin the South China Sea and around self-ruled Taiwan, rattling\n\nnerves around the region and in Washington. Mahathir also said China's might was the reason\n\nMuslim-majority Malaysia did not speak out much against\n\nBeijing's alleged repression of Uighur Muslims.\n\n\"You don't just try and do something which would fail\n\nanyway, so it is better to find some other less violent ways not\n\nto antagonise China too much, because China is beneficial for\n\nus,\" he said.\n\n\"Of course it's is a big trading partner of ours and you do\n\nnot want to do something that will fail, and in the process,\n\nalso, we will suffer.\"\n\nThe United Nations says at least 1 million ethnic Uighurs\n\nand other Muslims have been detained in what China describes as\n\n\"vocational training centers\" to stamp out extremism and give\n\npeople new skills.\n\nThe 94-year-old leader also said Malaysia's police was\n\ntrying to ascertain if fugitive financier Low Taek Jho was in\n\nChina. Investigators have named Low, better known as Jho Low, as\n\na key figure in the scandal at 1Malaysia Development Bhd (1MDB),\n\nwhich U.S. and Malaysian prosecutors say was used to siphon out\n\nhundreds of millions of dollars.", "description": "Malaysia PM says can't provoke Beijing on South China Sea, Uighur issue", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/indicatornews_6_800x533_L_1412601562.jpg", "published_at": "2019-09-28"}