{"pub": "reuters", "url": "https://reuters.com/article/us-brazil-politics-bolivia/brazil-president-urges-recount-of-bolivian-vote-after-morales-claims-win-idUSKBN1X21Z8", "downloaded_at": "2019-10-24 02:25:55.135983+00:00", "title": "Brazil president urges recount of Bolivian vote after Morales claims win", "language": "en", "text": "FILE PHOTO: Brazil's President Jair Bolsonaro looks on during a ceremony ahead of Aviator's Day at Brasilia Air Base in Brasilia, Brazil October 18, 2019. REUTERS/Adriano Machado/File Photo\n\nBRASÍLIA (Reuters) - Brazilian President Jair Bolsonaro on Wednesday called for a recount of the votes in the Bolivian election, in which leftist Evo Morales claims to have secured another term as president.\n\nSpeaking to reporters in Tokyo where he is on an official visit, the right-wing Bolsonaro said a delay in publishing vote counts for the Sunday election was “suspicious.”\n\n“Almost at the end of the vote count there was a suspension. After the count resumed, the incumbent won the election. I think everyone is concerned about an election being held in that way,” Bolsonaro said.\n\nThe Brazilian president added that the Organization of American States had also questioned the outcome of the election after Morales said he had won the first-round vote.\n\nMorales on Wednesday repeated his claim of victory, accusing the opposition of trying to orchestrate a coup after mass opposition-led protests claimed the counting was rigged.\n\nThe latest official vote count showed Morales with 46.49% with nearly 97% of the ballots processed, 9.5 points ahead of main rival Carlos Mesa, but still just short of the 10-point lead necessary to win outright and avoid a second round run-off.\n\nThe uncertainty over the election has rocked Bolivia, which has gone through almost 14 years of relative stability and growth since Morales came to power in 2006 as the country’s first indigenous leader.", "description": "Brazilian President Jair Bolsonaro on Wednesday called for a recount of the votes in the Bolivian election, in which leftist Evo Morales claims to have secured another term as president.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191024&t=2&i=1444333582&w=1200&r=LYNXMPEF9M1F2", "published_at": "2019-10-24"}