{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/31/WS5dba252aa310cf3e355748d5.html", "downloaded_at": "2019-10-31 00:08:36.125845+00:00", "title": "Shanghai helps fuel Tesla's electric car dreams", "language": "en", "text": "By Li Fusheng | China Daily | Updated: 2019-10-31 08:04\n\nA factory of electric carmaker Tesla Inc is seen in Shanghai. [Photo/Agencies]\n\nTao Lin, vice-president of Tesla Inc, was right when she said the US electric carmaker had made the right choice in 2018 by choosing to build its first overseas plant in Shanghai.\n\n\"Thanks to the outstanding business environment in Shanghai, many of our innovative ideas have become realities. From what we have achieved, it is a correct choice,\" Tao told reporters on Tuesday in Shanghai.\n\nTesla's Shanghai story is more than just innovative. The plant broke ground in January 2019 and started trial production in October, without CEO Elon Musk pitching a sleeping bag in the factory to supervise the progress, as he frequently did in the US.\n\nTo cap it, the $2 billion plant was around 65 percent less expensive to build than its Model 3 production system in the US, said Tesla in its third-quarter financial statement.\n\nTao said the plant will soon start production of its Model 3 sedans after it goes through final approval procedures. \"They will be world-class,\" she said. The initial capacity will be 3,000 cars a week and deliveries would start in the first quarter of 2020.\n\nBookings for the model, with a mileage of 460 km, started from Friday at a list price of 355,800 yuan ($50,398). Tesla is also offering two other versions of Model 3 sedans that are imported from the United States.\n\n\"China is by far the largest market for mid-sized premium sedans. With Model 3 priced on par with gasoline powered mid-sized sedans, we believe China could become the biggest market for Model 3,\" Tesla said in its quarterly financial statement.\n\nThe prospects are not limited to the Model 3 alone. Despite a 25 percent import duty, the country is already the company's second-largest market, just behind the US and ahead of Norway and the Netherlands.\n\nTesla's third-quarter financial statement shows that its sales revenue in China surged 64 percent to $669 million in the quarter, while the figure in the United States fell 39 percent to $3.13 billion.\n\nBloomberg estimated that the US demand will probably cool as federal tax credits for Tesla cars expire, but China's market for electric cars has remained strong since it overtook the United States as the world's largest new energy vehicle market in 2015.\n\nStatistics from the China Association of Automobile Manufacturers show that their sales totaled 872,000 units in the first three quarters of this year, up 20.8 percent year-on-year, despite the overall car market declining for 15 months in a row.\n\nYale Zhang, managing director of Shanghai-based consulting firm Automotive Foresight, said the arrival of localized Tesla models is of great significance.\n\nThe plant sends a clear signal of the country's intent to further open up its automotive industry to the world and will be the country's first fully foreign-owned car manufacturing facility.\n\nChina decided to allow establishment of such units in 2018 in the new energy vehicle sector and plans to allow the same in commercial vehicles and passenger cars by 2020 and 2022.\n\n\"China said it and has kept its word,\" said Zhang.\n\nHe said Tesla will also help improve the competitiveness of local new energy vehicle makers by forcing those incompetent ones out of business, some of which have been over-reliant on the government's financial stimuli, and inspire serious and ambitious companies to do a better job.\n\nMa Fanglie, president of BJEV, China's most popular electric car brand, said Chinese companies have something to learn from Tesla.\n\n\"It is not eligible for subsidies in China but its sales have been impressive. That's because its products offer great experiences that draw wows from its customers. We should develop such products as well,\" he said at an industry forum earlier this month.", "description": "Tao Lin, vice-president of Tesla Inc, was right when she said the US electric carmaker had made the right choice in 2018 by choosing to build its first overseas plant in Shanghai.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/31/5dba252aa310cf3e97a39f23.jpeg", "published_at": "2019-10-31"}