{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7611935/Outrage-studio-advertises-pole-dancing-classes-children-ads-pulled-violent-threats.html", "downloaded_at": "2019-10-26 00:20:55.822923+00:00", "title": "Outrage as a studio advertises pole dancing classes for children - ads pulled over 'violent threats'", "language": "en", "text": "A pole dancing studio has been slammed by concerned parents after advertising classes for children as young as 10.\n\nThe operators of Pole Dance Addiction, a studio in Blackburn, Melbourne, say they were forced to change their class times after being threatened.\n\nThe fitness-oriented studio had advertised pole-dancing classes for girls and boys as young as 10 on social media.\n\nOnline advocacy group Collective Shout - which campaigns against the sexualisation of girls - said the classes were problematic as pole dancing has a long-standing association with the sex industry.\n\nThe operators of Pole Dance Addiction (advertisement pictured), a studio in Blackburn, Melbourne, claim they were forced to change their class times after being threatened\n\n'Pole dancing is a sex industry practice that has gone mainstream,' campaign manager Caitlin Roper told Daily Mail Australia on Friday.\n\n'So we are seeing pole dancing companies offering classes to girls saying it's about fun and fitness.\n\n'But there's plenty of ways for kids to get active and moving without looking to the sex industry for inspiration.'\n\nMs Roper said pole dancing was an activity mainly undertaken in strip clubs by nearly naked women for the entertainment of fully clothed men.\n\n'Encouraging girls to take up pole dancing is a form of grooming and sexualising girls.'\n\nConcerned parents also expressed their unease about the classes.\n\nMother-of-two Sarah Santilli of Blackburn South said she was shocked that children could take pole dancing classes.\n\n'I think it's quite degrading,' she told the Leader.\n\nPole dancing at Pole Dance Addiction. Studio owner Melissa Comb said its youth classes were 'age-appropriate' and children were not allowed in the studio during adult classes. Pictured: Adult dancers at Pole Dance Addiction\n\nPoll Do you think pole dancing is appropriate for children? Yes No Do you think pole dancing is appropriate for children? Yes 16 votes\n\nNo 12 votes Now share your opinion\n\n\n\n\n\n'There's so many other ways young girls can keep fit.'\n\nPole Dance Addiction owner Melissa Comb said she had to take the post advertising the classes down less than two hours after it was put up due to 'violent threatening and crude messages' from outraged critics.\n\nThe studio is still holding the afternoon youth classes but Ms Comb said she had to change the advertised times for fear of being attacked.\n\nPole Dance Addiction's Facebook page shows its classes are focused on fitness. Pictured: Adult dancers at Pole Dance Addiction\n\n'We were concerned that the violent abusive messages may result in physical conflict at the studio and we wanted to keep children away from any such issues,' Ms Comb told the Herald Sun.\n\n'Pole dancing is a sex industry practice that has gone mainstream,' Collective Shout's Caitlin Roper (pictured)\n\nPole Dance Addiction said its children's classes were 'completely age-appropriate' and children were not allowed in the studio during adult classes.\n\nOwner Ms Comb said youth classes were open to both boys and girls just as swimming or gymnastics classes are, and that the studio had only introduced them after a series of requests by parents.\n\nOne of the parents, a mother whose daughter featured in the advertisement, defended the classes.\n\nThe mother said her daughter wanted to do pole dancing after seeing Kristy Sellars' winning performing on Australia's Got Talent.\n\n'I know my child and I know that the classes are right for her, that is all that is important to me,' she told the Leader.\n\n'The classes are pitched perfectly at her age group with qualified instructors who are focused on health, safety and wellbeing.'\n\nDaily Mail Australia has contacted Pole Dance Addiction for comment.", "description": "The operators of Pole Dance Addiction, a studio in Blackburn, Melbourne, claim they were forced to change their class times after being threatened.", "authors": ["Alison Bevege For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/06/20165940-0-image-a-31_1571979612581.jpg", "published_at": "2019-10-25"}