{"pub": "abcnews", "url": "https://abcnews.go.com/International/hong-kongs-embattled-leader-withdraws-bill-sparked-months/story?id=65383159", "downloaded_at": "2019-09-04 23:40:20.701744+00:00", "published_at": "2019-09-04", "title": "Hong Kong's embattled leader withdraws bill that sparked months of unrest; protesters say 'too little, too late'", "language": "en", "text": "Almost three months into Hong Kong’s worst political crisis since its return to Chinese control, the city’s embattled leader Carrie Lam agreed to formally withdraw the extradition bill that drove millions of people to the streets in protest some 13 weeks ago.\n\nInterested in China? Add China as an interest to stay up to date on the latest China news, video, and analysis from ABC News. Add Interest\n\nIn a pre-taped televised address, a weary-looking Lam addressed the city from behind a desk and said the government will formally withdraw the bill “to fully allay public concerns.”\n\n“Incidents over these past two months have shocked and saddened Hong Kong people,” Lam said it her video statement. “We are all very anxious about Hong Kong, our home. We all hope to find a way out of the current impasse and unsettling times.”\n\nWhile Lam suspended work on the bill, which would have allowed suspected criminals to be extradited to mainland China, days after massive crowds of mostly young people held their first demonstration, the measure was never fully taken off the table and its withdrawal has remained a key demand of the protests.\n\nBut as the summer of discontent drew on in one of the world’s financial capitals, which returned to Chinese control in 1997 after 156 years of British rule, the focus of the protests broadened into what has become known as the \"Five Demands.\" Those include a call for direct elections, amnesty for protestors and an independent inquiry into alleged police misconduct.\n\nChris Mcgrath/Getty Images\n\nChants of “Five Demands, Not One Less” have filled the streets every weekend since June, and appear in graffiti and posters plastered all over the city.\n\nProtesters regularly flood the city center and earlier this summer shut down the city's busy international airport for two days. The demonstrations have been largely peaceful -- and protesters make a point of dispatching teams to clean up after every action -- though they have become increasingly tense as they have gone and grown more disruptive.\n\nWhile the bill’s withdrawal might once have seemed like a major concession earlier in the summer, after weeks of violence, arrests and threatening rhetoric from Beijing about direct intervention by its People’s Liberation Army, it has lately been seen as merely the most politically feasible move. Even Lam’s pro-Beijing allies in Hong Kong have said it was time to withdraw the bill.\n\nOn the streets of Hong Kong, Lam's announcement was seen as, too little, too late.\n\nVincent Yu/AP\n\n“If we accept what the government offers now and give up the fight for the Five Demands, our comrades who have sacrificed their lives for the movement would never forgive us,” a frontline protestor ABC News calls ‘Citizen X’ said Wednesday.\n\nCitizen X, a male student who insists on anonymity, was likely referencing the at least 7 deaths by suicide, hundreds of injured and over a thousand fellow protestors arrested since the protests began in June.\n\n“Answering to only one demand is meaningless,” he said. “Five Demands, Not One Less!”\n\nLate on Wednesday, two masked protestors held a press conference in front of the Hong Kong’s legislative building that protestors stormed two months ago and where the “Five Demands” were first announced.\n\nKin Cheung/AP\n\n“Applying a Band-Aid months later on to rotting flesh simply will not cut it,” one of the masked protestors said.\n\n“If [Lam] wants to listen to what to listen to what Hong Kong people want, she only needs to go down to protest sites,” said the other. “Protesters are not difficult to reach. On weekends, we’re out on the streets.”\n\n“Only when all five of our demands are met will we stop our fight,\" he said.\n\nWednesday's news came after the Reuters news agency reported that Beijing's unwillingness to concede to the protestors' demands has hampered attempts by Hong Kong's government to cool things down.\n\nIn her address, Lam went through each of the Five Demands, explaining why they were unfeasible and made her own call for dialogue.", "description": "Hong Kong's embattled leader Carrie Lam withdraws extradition bill that sparked months of unrest; protesters say 'too little, too late'", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/International/hong-kong-Lam-nc-jt-190904_hpMain_16x9_992.jpg"}