{"pub": "reuters", "url": "https://af.reuters.com/article/worldNews/idAFKBN1WI0IE", "downloaded_at": "2019-10-03 08:32:57.312315+00:00", "published_at": "2019-10-03", "title": "Eleven people killed in southern Iraq protests overnight", "language": "en", "text": "Demonstrators set on fire the Hikma movement building during a protest over unemployment, corruption and poor public services, in Najaf, Iraq October 2, 2019. REUTERS/Abdullah Dhiaa al-Deen\n\nBAGHDAD, Iraq (Reuters) - Eleven people were killed during protests overnight in two southern Iraqi cities, including a policeman, police and medical sources said on Thursday, raising the death toll to 18 since anti-government protests turned violent two days ago.\n\nSeven protesters and a policeman died in Nassiriya during clashes between demonstrators and security forces. Four more people were killed in the city of Amara, the sources said.\n\nTroops patrolled central areas of Baghdad early on Thursday to enforce a curfew ordered by Prime Minister Adel Abdul Mahdi, but sporadic demonstrations continued in some parts of the Iraqi capital, Reuters witnesses said.\n\nThe unrest spread quickly from small-scale protests in Baghdad on Tuesday over jobs, services and government corruption. At least two people were killed that day as security forces opened live fire and shot water cannon and tear gas. Five more were killed on Wednesday, including a child. Hundreds have been wounded including demonstrators and police.\n\nAbdul Mahdi ordered a curfew in Baghdad from 5:00 a.m. (0200 GMT) on Thursday until further notice.\n\nThe protests are the biggest against Abdul Mahdi’s government which took office nearly a year ago, and the biggest in the country since September 2018.\n\nTravelers to and from Baghdad airport, ambulances, government employees in hospitals, electricity, and water departments, and religious pilgrims are exempt from the curfew, the statement said. It was up to provincial governors to decide whether to declare curfews elsewhere.", "description": "Eleven people were killed during protests overnight in two southern Iraqi cities, including a policeman, police and medical sources said on Thursday, raising the death toll to 18 since anti-government protests turned violent two days ago.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191003&t=2&i=1436543024&w=1200&r=LYNXMPEF920CP"}