{"pub": "afr", "url": "https://afr.com/companies/mining/new-chairman-says-south32-will-keep-rightful-voice-in-coal-lobby-20191022-p5337v", "downloaded_at": "2019-10-27 12:03:09.566344+00:00", "title": "New chairman says South32 will keep rightful voice in coal lobby", "language": "en", "text": "South32 has set itself a goal of achieving net zero carbon emissions by 2050 but that does not include customer emissions, known as scope 3 emissions. These are now being looked into by BHP and Rio Tinto at the urging of activist investor groups.\n\nMs Wood said scope 3 emissions were important to South32 and it was listening closely to what BHP and others said on the issue.\n\nIllawarra operations\n\nShe said scope 3 emissions would be a factor when South32 had to make a final investment decision on the Eagle Downs project in Queensland’s Bowen Basin, which would add to its resurgent Illawarra coal operations in NSW.\n\nMs Wood left the door open to South32 to include scope 3 targets in an update of the company’s climate change policy due in 2021 and hinted it might mirror the BHP approach that earned a tick from Market Forces.\n\n“I do think the approach that BHP is talking about, which is to work collaboratively with customers, makes sense,” she said.\n\n“Whether we are at a stage where we embrace that in our next five-year plan is something we are still working through.”\n\nSouth32 chief executive Graham Kerr backed the NSW Minerals Council advertising campaign that was credited as a factor in the NSW government ordering a review of the Independent Planning Commission.\n\nAdvertisement\n\n“If we are doing a large investment, you are looking for some kind of certainty or at least understanding of the process,” he said.\n\n“When you think about the review in NSW on the independent body, for us it is not about whether it approves or disapproves a thermal coal mine. You can argue whether they are good projects or not based on the economics and community impact.\n\n“For us, it is more about clarity of process and accountability.”\n\nBoard recruitment\n\nMr Kerr said the same theory would apply in Queensland, where he noted that most of the key permits and approvals for the Eagles Downs project were already in place.\n\nMs Wood, who has kept a low profile since taking the reins as chairman in April, told the South32 general meeting last Thursday the company was looking for a new director with experience in developing large resource projects in North America.\n\nThe board recruitment is another sign of how bullish the company is about its high-grade zinc, lead and silver Hermosa project, which it acquired for $US1.4 billion from Arizona Mining last year.\n\nMr Kerr told shareholders South32 continued drilling to understand the size and grade of the deposit but was very pleased with the acquisition.\n\nAdvertisement\n\nSouth32 is also sweating on drilling results and a breakthrough on new road access before a January deadline to commit another $US75 million under an option with Trilogy Metals to increase its interest in a big Alaskan land package to 50 per cent.\n\nThe two known deposits in the land package are Arctic, a high-grade polymetallic resource, and Bornite, a large copper resource.\n\nMr Kerr said South32 would base its investment decision on an analysis of drilling results due in the next month and progress on plans from Alaskan authorities to build a new 340-kilometre road connecting the remote Ambler region to the highway network.", "description": "Karen Wood breaks her silence to back membership of pro-coal industry groups.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5802%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_396%2C$y_735/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/5c6e292b5971e3266664a1ceb61e16bc8a96d6c2", "published_at": "2019-10-22"}