{"pub": "investing.com", "url": "https://benzinga.com/general/biotech/19/09/14442683/igm-biosciences-ipo-what-you-need-to-know", "downloaded_at": "2019-09-17 23:35:13.266238+00:00", "title": "IGM Biosciences IPO: What You Need To Know", "language": "en", "text": "A pre-phase 1 biotech working on antibodies targeting blood cancer is seeking a public listing this week, with a recent amendment to the S-1 filing revealing an increase in the number of shares the company plans to offer.\n\nThe IPO Terms\n\nMountain View, California-based IGM Biosciences, Inc. proposes to offer 10.938 million shares in an IPO at an estimated price range of $15-$17 per share, according to a S-1/A filing. The offering has been upsized from the previously revealed 7.8 million shares.\n\nAt the mid-point of the price range, the offering is likely to raise gross proceeds of $175 million.\n\nThe company's shares have been approved for listing on the Nasdaq under the ticker symbol IGMS.\n\nInvest in IPO shares before the stock hits the market with ClickIPO. Check it out here\n\nJefferies, Piper Jaffray, Stifel and Guggenheim Securities are the underwriters for the offering.\n\nThe Company\n\nIGM is a biotech company involved in the development of engineering IgM antibodies for the treatment of cancer patients. The IgM antibodies, according to the company, have the tendency to bind more strongly to cancer cells than comparable IgG antibodies.\n\nThe company's lead product candidate IGM-2323 is a bispecific T cell engaging IgM antibody targeting CD20 and CD3 proteins.\n\nIt is planning to dose the first patient in a Phase 1 trial of IGM-2323 in relapsed/refractory B cell Non-Hodgkin's lymphoma patients in 2019.\n\nThe company is also planning to file an IND with the FDA in 2020 for a second product candidate, a IgM antibody targeting Death Receptor 5 proteins for treating solid and hematologic malignancies.\n\nIGM's proprietary IgM platform expands upon the inherent properties of IgM antibodies and allow for the rapid development of therapeutic antibodies.\n\nThe Finances\n\nIGM hasn't reported revenues yet, while for the fiscal year 2017 the company reported a net loss of $11.05 million and a net loss of $22.71 million for the fiscal year 2018.\n\nR&D expenses accounted for roughly 83% of the total operating expenses of $22.79 million for 2018.\n\nThe company reported a loss of $7.14 million for the six-month period ending June 30, 2018, compared to a loss of $18.15 million in the same period this year.\n\nRelated Links:\n\nThe Daily Biotech Pulse: Acceleron Shelves Muscular Dystrophy Drug Trial, Aclaris Aces Late-Stage Study\n\nAnalyst: DBV's Peanut Allergy Drug Could Outscore Aimmune's On Safety Front", "description": "A pre-phase 1 biotech working on antibodies targeting blood cancer is seeking a public listing this week, with a recent amendment to the S-1 filing ...", "authors": ["Shanthi Rexaline", "Following", "Follow"], "top_image": "https://cdn1.benzinga.com/files/imagecache/bz2_opengraph_meta_image_400x300/images/story/2012/blood-1813410_1280_3.jpg", "published_at": "2010-01-01"}