{"pub": "guardian", "url": "https://theguardian.com/technology/2019/oct/23/apple-watch-series-5-review-the-king-of-smartwatches", "downloaded_at": "2019-10-23 08:42:51.555662+00:00", "title": "Apple Watch Series 5 review: the king of smartwatches", "language": "en", "text": "Always-on screen completes the package kicking competitors to the curb and becoming a top reason to buy an iPhone\n\nWhen Apple launched its smartwatch in 2015 to a lukewarm reception, some critics claimed it would never take off like the iPod or iPhone. But sales of the Apple Watch quickly eclipsed every other smartwatch and with wearable technology sales soaring it is expected this year to outsell all of the Swiss watchmakers combined.\n\nThe latest Apple Watch Series 5 iteration, though still pricey at £399 and up, looks likely to continue the firm’s domination of the smartwatch market and deservedly so.\n\nIf you are unfamiliar with Apple’s smartwatches, they only work if you also have an Apple iPhone 6S or newer connecting to the smartphone via Bluetooth. It’s a genius link-up that ties buyers into the Apple ecosphere, while adding an important alternative revenue stream as people hold onto their phones. But that doesn’t take away from the extraordinary qualities of this watch.\n\nFacebook Twitter Pinterest Each of the watch faces, such as the Numerals Duo shown here, now has a low-power version that displays when you’re not actively using the watch. Photograph: Samuel Gibbs/The Guardian\n\nThe Series 5 builds on last year’s larger-screen redesign of the Apple Watch, making one small but important change: the screen now stays on all the time.\n\nIt’s a feature every other smartwatch has had for years and is important for actually telling the time, which is absolutely essential for something to have a permanent place on my wrist.\n\nUntil now Apple Watch owners had to either tap the face or do an elaborate wrist rotation gesture to get the screen to light up – and it never worked when I really needed it to, such as when running for a train. Now you can see the time at a glance at any time or angle.\n\nThe rest of the Apple Watch has always been top notch. Equipped with the right strap – if you haven’t tried the Sport Loop or one of its many clones you absolutely must – the Apple Watch is the most comfortable timepiece I’ve had the pleasure of strapping to my wrist, beating some of the very best the Swiss watchmakers have to offer.\n\nFacebook Twitter Pinterest The Apple Watch is just over 1cm thick, but wears its depth well, fitting under most shirt cuffs. Photograph: Samuel Gibbs/The Guardian\n\nIt’s neither heavy nor light, and hides the heart rate sensor in a curved lump on its belly comfortably sitting atop your wrist. It fits easily under shirt cuffs, which some larger smartwatches don’t. It’s water resistant to depths of 50m, which means you’ll likely never have to worry about it when you take a dip in the pool.\n\nThe screen is bright and crisp, clearly visible in all circumstances. I’ve never been a massive fan of the rectangular shape, preferring my watches to be of the circular variety, but the Series 5 has won me round over the last month.\n\nApple still leads the way on haptics – the little vibrations and taps the watch makes to let you know something has happened. I loved them with the original in 2015, and they’re still miles better than anything else on the market five generations later.\n\nVictim of its own success\n\nFacebook Twitter Pinterest The digital crown, side button and the ability to press harder into the screen to activate functions augment simple taps and swipes on the touchscreen. Photograph: Samuel Gibbs/The Guardian\n\nOne thing you might not appreciate until you strap one to your wrist is that there are so many of them out there in the wild, all looking the same. I’m not one to conform to any particular fashion or club, so I often get that twinge of embarrassment you feel when you walk into a room and spot someone wearing the same shirt or dress.\n\nIt’s made a little better with the Series 5 now you can have the screen on all the time and pick a slightly different face, but by putting one on you instantly become one of the Apple Watch people.\n\nApple provides loads of watch faces, which are all infinitely tweakable in colour, with many having dial customisation. Then there’s a sizeable collection of widgets for things like timers, the weather, activity and others called “complications”. But I’ve found there’s always something not quite perfect about each face that I can’t change. I love the new Numerals Duo face, but I wish it could have the date on it too. I really like the Meridian analogue face too, but wish it had an option for numerals not just ticks.\n\nI also find the round analogue faces hard to read at a glance even on the 44mm Series 5 because they’re just bit too small. I’m being picky here, but that’s the thing about something you wear – if it’s not quite how you want it you’re going to notice it and be annoyed by it over and over.\n\nApps and things\n\nFacebook Twitter Pinterest There’s a calculator. It’s a bit small, but will do in a pinch. Photograph: Samuel Gibbs/The Guardian\n\nOf course the Apple Watch does more than just tell the time.\n\nNotifications are a high point. A little tap on the wrist and you know something has happened. Most you can interact with in some way. All of Apple’s apps work well, of course, but so do third-party apps. The Nest and Ring apps show photos of events from cameras for instance.\n\nMessaging apps including Signal and WhatsApp can be marked as read or replied to straight from your wrist. You can dictate what you want to Siri, draw out letters one at a time or send canned responses or emojis.\n\nMost Apple Watch apps aren’t up to much, but one that bucks the trend is the Spotify app, which gives you full control of playback on your iPhone from your wrist, including volume control using the digital crown. But it can’t store music offline unlike the Apple Music app.\n\nApple Pay and Siri\n\nFacebook Twitter Pinterest Siri on the Apple Watch is unsurprisingly similar to Siri on the iPhone, with the same strengths and weaknesses. Photograph: Samuel Gibbs/The Guardian\n\nApple Pay on your wrist is great too. Double press the big side button to bring up the card and then just put it near the reader as you would a phone or contactless credit card.\n\nSiri is great when it works, but can be hamstrung by poor network conditions.\n\n“Hey, Siri” works fine, but activates fairly often when I don’t want it to, ditto for raising your wrist to speak to Siri. I deactivated both features and didn’t miss them. Setting timers, reminders, alarms and other bits via Siri work great, but things start to fall apart with more complex tasks or questions. It’s the same on an iPhone, more or less.\n\nThere’s no Google Maps app on the Apple Watch, which is disappointing. Apple Maps is getting better, but it’s really not that great in the UK. Citymapper offers an Apple Watch app, which is certainly better for getting around London and other major cities.\n\nHealth\n\nFacebook Twitter Pinterest The Apple Watch is one of the best consumer heart trackers available. Photograph: Samuel Gibbs/The Guardian\n\nApple has slowly turned its smartwatch into one of the best multipurpose fitness trackers available. You name it, the Apple Watch can track or record it, apart from one glaring omission: sleep.\n\nThe workout app has modes to track a huge list of activities and sports, from your usual running, walking, hiking, cycling and swimming to yoga, tai chi, dance, football, badminton, hockey, table tennis and even fishing.\n\nThe Apple Watch automatically looks out for some workouts too. I get a notification to track an outdoor walk twice a day on my commute, which I found annoying enough to turn the feature off.\n\nFor running the Apple Watch is surprisingly good, tracking everything a mid-range dedicated Garmin running watch would, including performance stats such as VO2 Max. It’s got a long enough battery life with everything going to track a marathon, but I certainly feel it more as a lump on my wrist than my go-to Garmin Forerunner 235. There’s a dedicated Strava app for the Apple Watch if that’s your jam.\n\nDay-to-day health tracking is solid. The heart rate sensor measures your beats per minute throughout the day, logging it upwards of 12 times an hour or on-demand for you to view in the newly revitalised health app on your phone. But it can also notify you of abnormal heart rates, which are typically high when you’re not doing anything.\n\nYou can also manually take an electrocardiogram (ECG) by placing your finger on the crown for 30 seconds or so. The apps shows you the waveform in real time and notifies you if your heart beat looks irregular.\n\nFacebook Twitter Pinterest The noise app helps you be aware of noisy environments that may permanently damage your hearing. Photograph: Samuel Gibbs/The Guardian\n\nOther daily activity tracking takes the form of Apple’s activity rings: move in calories, exercise in minutes and stand in hours, complete with nags to stand up each hour if you haven’t already. Steps and distance are also recorded, along with flights of stairs climbed, and you get awards if you beat your goals. Exporting your activity is fairly restricted, but as all the data is stored in Apple Health you can connect to third-party apps.\n\nIncluded too are menstrual cycle tracking and fall detection. New for the Series 5 is the noise app, which monitors environmental noise and warns you if you’re in conditions that could damage your health. It also measures headphone volume on the iPhone, which may be just as useful for those listening to music too loudly.\n\nBattery life\n\nFacebook Twitter Pinterest The Series 5 uses the same magnetic wireless charging puck as the first generation. Photograph: Samuel Gibbs/The Guardian\n\nBattery life was the key worry for the Apple Watch with an always-on screen. Thankfully, I can report in day-to-day usage I was left with no less than 40% battery at the end of a day. It won’t manage two 7am till 11pm days, but it won’t fail you if you go for a run during the day or similar.\n\nAn 18-minute, 4km run with GPS, heart rate monitoring, pace alerts and the screen always on consumed only 3% battery so marathons should be no bother.\n\nObservations\n\nFacebook Twitter Pinterest Swapping out straps is super quick and easy with quick-release buttons on either side of the watch. Photograph: Samuel Gibbs/The Guardian\n\nThe default app view is still the old honeycomb matrix of apps, which is hard to use, but can be switched to an easier and faster simple list with a hard press\n\nTaking calls on your wrist is novel and works amazingly well, but embarrassing when people stare at you in public (which is similar to attempting to talk to Siri)\n\n4G is only useful if you happen to go out without your phone, so you can stay in touch seeing notifications, receiving messages and calls, or using maps if you’re lost\n\nPrice\n\nThe Apple Watch Series 5 comes in two sizes, various different materials and models with the option of 4G.\n\nThe aluminium or Nike versions are available with or without 4G. The 40mm costs £399 or £499 with 4G. The 44mm costs £429 or £529 with 4G.\n\nAll other Apple Watch versions support 4G. The stainless steel model costs £699 (40mm) or £749 (44mm), while the titanium Edition starts at £799, the ceramic Edition starts at £1,299 and the Hermes starts at £1,249.\n\nFor comparison, Samsung’s Galaxy Watch Active 2 starts at £269, the Fossil Gen 5 smartwatch starts at £279, the Huawei Watch GT 2 costs £200 and the Fitbit Versa 2 starts at £200.\n\nVerdict\n\nSince its second generation the Apple Watch has been the best smartwatch for the iPhone. But for the Series 5 that’s changed. It’s not just the best smartwatch for the iPhone. The Apple Watch is now a solid reason to buy an iPhone in the first place.\n\nThe screen being on all the time that was the last piece in the Apple Watch puzzle. What started out as a bit of a let down in 2015 has since been refined, sped up and had meaningful features added to it that make it far more than the sum of its parts.\n\nAfter five generations Apple has finally nailed it, but that’s not to say the Series 5 is perfect. It would be great to have sleep tracking to close the circle on health tracking. It would be better if it lasted at least two days so you could go on a weekend away without bringing the charger.\n\nI wish there was a circular version too for variety, and it would be better for everyone if they didn’t all look the same like some sort of clone army. Strap one of these to your wrist and you become part of a tribe: the Apple Watch wearers.\n\nThen there’s the price. At £399 and up the Apple Watch Series 5 is in no way cheap. The Series 3 is still on sale from £199, but doesn’t do it for me with that mostly-off screen. With the competition mostly coming in at under £300 the Series 5 has Apple’s typical premium – but it’s a premium anyone considering an Apple Watch has already paid for their iPhone.\n\nSimply put, the Apple Watch Series 5 is the best smartwatch you can buy right now. You might just need to also buy an iPhone to get it.\n\nPros: excellent haptics, always-on screen, ECG, great health tracking, great activity tracking, solid running watch, 50m water resistance, all-day battery life, offline music, loads of watch faces, quick-swap straps, comfortable, Apple Pay Cons: expensive, only works with an iPhone, no sleep tracking, too popular\n\nFacebook Twitter Pinterest You can alter lots of things on each watchface, but somehow they’re never quite perfect. Photograph: Samuel Gibbs/The Guardian\n\nOther reviews\n\nThis article contains affiliate links, which means we may earn a small commission if a reader clicks through and makes a purchase. All our journalism is independent and is in no way influenced by any advertiser or commercial initiative. By clicking on an affiliate link, you accept that third-party cookies will be set. More information.", "description": "Always-on screen completes the package kicking competitors to the curb and becoming a top reason to buy an iPhone", "authors": ["Samuel Gibbs"], "top_image": "https://i.guim.co.uk/img/media/af9814d4f9dd5943e526aa600aafe92b59adea6f/0_0_4469_2682/master/4469.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTUucG5n&enable=upscale&s=b0f660fa0d7f8f9600c35251757f6123", "published_at": "2019-10-23"}