{"pub": "fox", "url": "https://foxnews.com/media/don-jr-adam-schiff-democrats-ukraine-impeachment-hannity", "downloaded_at": "2019-10-03 07:29:28.640215+00:00", "published_at": "2019-10-03", "title": "Donald Trump Jr. blasts Adam Schiff, Democrats over ongoing impeachment push", "language": "en", "text": "Donald Trump Jr. claimed House Intelligence Committee Chairman Adam Schiff, D-Calif., is a habitual liar who went unchallenged by the media after offering a \"parody\" account of President Trump's call with Ukraine's leader.\n\nTrump Jr. told \"Hannity\" Wednesday that if he offered a similar parody before Congress, he would be imprisoned for perjury and lambasted in the media.\n\n\"If I lied even a little bit in front of those guys like Adam Schiff has lied to the American people, and in front of Congress the other day, they'd throw me in jail for perjury,\" he claimed\n\nTRUMP SAYS SCHIFF 'HELPED WRITE' WHISTLEBLOWER COMPLAINT, AFTER HOUSE PANEL ADMITS ADVANCE KNOWLEDGE\n\n\"Adam Schiff has never been afraid of a microphone. He has never met a camera he didn't love, and frankly, he has never met a camera he didn't lie to.\"\n\nTrump Jr. claimed that if a Republican chairman offered a fabricated account of a phone call and then claimed it was a parody, the media would tear into that lawmaker.\n\n\"The American people see it -- they get it,\" he said. \"[Democrats] haven't done anything in three years. The reality is this: they hate Trump more than they love America.\"\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nRegarding allegations of unsubstantiated wrongdoing against former Vice President Joe Biden and his son Hunter, Trump Jr. said if he earned money in China the way the younger Biden did, he would be critiqued in the media.\n\n\"If I went to China and I did that, Sean, and I came back with 1.5 dollars, not $1.5 billion, 1.5 dollars, we'd solve the media problem because their heads would explode -- there'd be no 'fake news' media left,\" he said.\n\n\"The whole thing is ridiculous, Sean,\" he added. \"Do you think they'd let Donald Trump Jr. get away with that?\"", "description": "Donald Trump Jr. claimed House Intelligence Committee Chairman Adam Schiff is a habitual liar who went unchallenged by the media after offering a \"parody\" account of President Trump's call with Ukraine's leader.", "authors": ["Charles Creitz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Trump-Hannity.jpg"}