{"pub": "morningstar", "url": "https://morningstar.com/articles/911687/a-good-world-stock-fund-just-got-better", "downloaded_at": "2019-09-05 11:26:23.595948+00:00", "title": "A Good World-Stock Fund Just Got Better", "language": "en", "text": "The following is our latest Fund Analyst Report for American Funds SMALLCAP World. Morningstar Premium Members have access to full analyst reports such as this for more than 1,000 of the largest and best mutual funds. Not a Premium Member? Gain full access to our analyst reports and advanced tools immediately when you try Morningstar Premium free for 14 days.\n\nAmerican Funds Smallcap World's Morningstar Analyst Rating has increased to Silver from Bronze because it now has a better shot to scour the globe for promising small- and mid-cap stocks.\n\nAmerican Funds' parent Capital Group has long divided itself into smaller subsidiaries to manage money. Two of those, Capital Research Global Investors and Capital World Investors, split this fund's roughly $40 billion asset base until July 2018, when the firm directed assets to Capital International Investors, too. The equity divisions have the same fundamentals-based, long-term-oriented investment philosophy but do not share investment ideas. This adds the potential for greater diversification in the fund's nearly 800-stock portfolio, as of year-end 2018.\n\nThe subsidiary addition coincided with a reshuffling of the fund's 14-person management team, albeit one characterized by significant continuity. Three managers switched subsidiaries while remaining on the fund, including Julian Abdey, who left CWI to head up CII's four-person team. That CII team includes Dylan Yolles, a contrarian who rejoined the fund. His return helps offset the loss of Mark Denning, a fellow value-oriented investor who was one of three managers to leave in 2018's second half.\n\nThe fund's tendency to overweight economically sensitive parts of the market, recently software, has led it to struggle when value stocks do better than their growth counterparts. In the early-2000s bear market, its 62.4% peak-to-trough cumulative loss trailed the index by 20.2 percentage points. When value stocks again led in 2016, the fund’s 5.8% gain was roughly half what the index returned that year.\n\nYet, investors who have held on through these bouts of underperformance have done well. Through December 2018, the fund has an annualized 1.2-percentage-point edge since the MSCI All-Country World Small Index's mid-1994 inception and beats that bogy as well as the world small/mid-stock Morningstar Category norm over the past decade. Risk-tolerant investors should continue to reap long-term rewards here.\n\nProcess Pillar: Positive | Alec Lucas, Ph.D. 01/31/2019\n\nThe fund's divide-and-conquer approach earns a Positive Process Pillar rating.\n\nIn the liquidity-constrained arena of small-cap investing, the fund aims to circumvent its girth by dividing its $40 billion asset base between 14 managers and three analyst teams. Their independently run portfolios range in size from about $1 billion to $2.5 billion. Those are reasonable levels, given the fund’s global mandate and its focus on stocks with a market cap up to $6 billion. New purchases have to be below that cap, as do 80% of the fund’s overall assets. Provided the latter guideline is followed, managers can hold on to picks until their market caps hit $48 billion.\n\nAmerican's multimanager approach also lets the managers play to their strengths. For example, Noriko Chen invests in firms with outsize growth potential, while Dylan Yolles buys stocks whose price reflects extreme skepticism. With their distinct styles, the managers can invest in their best ideas or hold cash and wait for compelling opportunities. Meanwhile, the combination of separately managed sleeves enhances diversification and mutes the fund’s overall volatility to a degree. That’s important here, as managers can invest significantly in emerging-markets names. The managers eschew high turnover and often buy stocks that may take several years to work out, rather than worrying about finding near-term catalysts to propel returns.\n\nThe portfolio holds 700-800 stocks, which keeps security-specific risk to a minimum. While 80% of the fund’s assets must be invested in stocks with a market cap below $6 billion, the managers regularly take advantage of the freedom to hold on to stocks until their market caps hit $48 billion. As a result, large-cap names often appear in the fund’s top-20 holdings, and its average market cap tends to be well above the MSCI All Country World Small Index’s.\n\nDespite its larger-cap tilt, the fund’s risk profile is not superior to the benchmark’s. That’s largely because of its heavy emerging-markets investment. Since 2009, the fund’s had a roughly 15%-25% emerging-markets stake (including South Korea and Taiwan), versus about 5%-15% for the index. Developed-markets exposure leans toward the United States but has varied from a high of about 60% of assets in late 2001 to a low of about 25% in late 2007. The index’s U.S. exposure tends to hover around 50%.\n\nThe fund often treads heavily in consumer discretionary and healthcare. Its overweighting in the latter sector topped 10 percentage points in March 2015 but has recently been about half that. The fund’s stake in software stocks like RingCentral RNG has surged to 8.7% in late 2018, versus the index’s 3.8%.\n\nCash is typically 5%-10% of assets but can reach the mid- to upper teens in extreme market conditions, like late 2007.\n\nPerformance Pillar: Positive | Alec Lucas, Ph.D. 01/31/2019\n\nThe fund's Performance rating merits an upgrade to Positive from Neutral. Through December 2018, the fund outpaced the MSCI All-Country World Small Index and placed in the world small/mid-stock category’s top quintile over the past five and 10 years. Its risk-adjusted results were superior over those trailing periods, too.\n\nGranted, the fund has had it struggles when value stocks do better than their growth counterparts. In the early-2000s bear market, its 62.4% peak-to-trough cumulative loss trailed the index by 20.2 percentage points. When value stocks once again led in 2016, the fund’s 5.8% calendar-year gain was roughly half what the index returned that year.\n\nYet, investors who have held on through these bouts of underperformance have done well. The fund has an annualized 1.2-percentage-point edge since the index’s mid-1994 inception. In total, there have six full market cycles in which the index has shed at least a fifth of its value from a prior peak. The fund has outperformed in four of the six, including the two most recent. In the cycle from Oct. 2, 2011, to Feb. 11, 2016, fund lost more than the index in that downturn, but its 52.6% cumulative gain still beat the index by 4.6 percentage points. In the cycle from Feb. 12, 2016, to Dec. 21, 2018, the fund did better in the up and down markets, leading to a 37.6% cumulative gain, versus the index’s 32.1% return.\n\nPeople Pillar: Positive | Alec Lucas, Ph.D. 01/31/2019\n\nAmerican Funds’ multimanager approach helps to handle this fund’s $40 billion asset base, the world small/mid-stock category’s biggest. The fund’s Positive People rating reflects its systemic strengths as well as the managers’ experience, ability, and aligned interests.\n\nCapital Group, the parent of American Funds, has split the fund's assets between equity subsidiaries Capital Research Global Investors, Capital World Investors, and Capital International Investors since July 2018. Gregory Wendt heads up the whole fund and CRGI's team, which includes Claudia Huntington, Bradford Freer, Harold La, and Aidan O'Connell. Jonathan Knowles oversees CWI's team of Brady Enright, Andraz Razen, Leo Hee, and Roz Hongsaranagon. Julian Abdey heads up CII’s side, composed of Peter Eliot, Noriko Chen, and Dylan Yolles. The managers, based in the United States, England, and Asia, each oversee a separate sleeve of the portfolio, with Wendt, Knowles, and Abdey helping to ensure that their investing styles complement one another. Hongsaranagon is the least experienced team member, and yet her 16 years at Capital Group includes five years as a manager here and eight prior years as an analyst. The CRGI, CWI, and CII teams each draw on about 50 analysts. Each analyst group also oversees its own slice of the portfolio.\n\nEach manager has at least $100,000 invested the fund and three more than $1 million each.\n\nParent Pillar: Positive | Alec Lucas, Ph.D. 02/28/2018\n\nAs a standard-bearer in asset management, Capital Group earns a Positive Parent rating. Widely known in the U.S. for its American Funds open-end lineup, the active manager boasts some of the industry's more reliable equity and allocation offerings. The firm's multimanager system is key to its success. Dividing each fund into independently run sleeves lets managers invest in line with their styles, enhancing diversification and reducing the overall portfolio's volatility. The funds' analyst-led research portfolios help develop the next generation and recruit top talent with the promise of running money from the start. The result is an investment culture marked by lengthy tenures, strong manager fund ownership, and competitive long-term records.\n\nCapital Group has improved its fixed-income approach through greater coordination, external hires, and enhanced risk management. The firm now has the tools to compete with best-in-class fixed-income shops, though its investment professionals could become more seasoned in their use.\n\nInvestors have shown renewed interest in American Funds amid the firm's efforts to expand in Europe, Australia, and Asia. The potential for these investors to pour money into the same strategies should incline Capital Group to clarify what would cause it to close a strategy to protect current shareholders, something the firm has said it would be willing to do.\n\nPrice Pillar: Positive | Alec Lucas, Ph.D. 01/31/2019\n\nComparatively modest fees earn the fund a Positive Price rating. The A shares’ 1.04% expense ratio, which applies to more than half the fund's assets, is 20 basis points below the world-stock, front-load peer median and is competitive with the price tag of most no-load options. Plus, 10 of the fund’s 16 other share classes sported low or below average expense ratios versus similarly distributed rivals. Trading costs were also modest. Brokerage fees of 0.04% of average net assets in fiscal 2018 fell well below the 0.14% category median.\n\nCapital gains distributions in four of the past five years have hurt investors in taxable accounts, however. Those distributions peaked at nearly 10% of the fund's net asset value in December 2014. They were close to 7% of NAV in December 2018.", "description": "We've upgraded our Morningstar Analyst Rating of American Funds Smallcap World to Silver.", "authors": [], "top_image": "https://images.contentstack.io/v3/assets/blt4eb669caa7dc65b2/blt449bfc4a860d66a6/5cf68f9f592114fc054aa4d1/Rating_Fund_1x1.svg", "published_at": "2019-02-07"}