{"pub": "marketwatch", "url": "https://marketwatch.com/story/why-this-overlooked-black-swan-poses-a-monstrous-risk-to-the-stock-market-2019-09-11", "downloaded_at": "2019-09-12 07:22:05.037162+00:00", "title": "Why this overlooked ‘black swan’ poses a ‘monstrous’ risk to the stock market", "language": "en", "text": "The stock market’s been looking fairly strong lately, with the Dow Jones Industrial Average DJIA, +0.85% rallying for the sixth session in a row. But with each uptick, and each unsettling headline, there seems to be an increasing call for caution.\n\nTD Ameritrade’s Oliver Renick just joined the chorus.\n\n“What’s disconcerting is that it’s remarkably easy to imagine a series of events that by nature should not necessarily pose great risk, but taken together could cause some major shocks to the S&P 500 due to current investor positioning,” he explained in a post on LinkedIn this week.\n\nHe pointed to this SocGen chart, in which he marked up (not with a Sharpie) to show what he considers the most troubling for investors:\n\n“A sharp market repricing should be the fattest swan on that diagram,” Renick continued. “The greatest risk to investors, the economy, and the tenuous state of geopolitics, is the price of the S&P 500 SPX, +0.72% . That does not mean it is the most likely risk — what it means is that the ripple effect of a sizable selloff in stocks right now is monstrous.”\n\nWhat could cause such a ripple?\n\nRenick painted this bearish scenario: The economy improves enough so that the Fed doesn’t cut rates, investors get spooked, assets pull back in a highly-correlated march, no cash pours in from the sidelines and the bottom falls out. “If no one’s there to buy because they’ve already bought, hedges don’t work because they’re all tied to the same events, liquidity exacerbates swings and the president realizes his cow-prod is on the verge of breaking, watch out below,” he wrote.\n\nNothing like that this week. The Dow was up triple digits at last check, while the S&P and Nasdaq COMP, +1.06% were also logging solid gains.", "description": "The market’s been looking fairly strong lately, with the Dow Jones Industrial Average rallying for the sixth session in a row. But with each uptick, there...", "authors": ["Shawn Langlois", "Social-Media Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR133_swan_ZG_20190911145656.jpg", "published_at": "2019-09-11"}