{"pub": "independent", "url": "https://independent.co.uk/arts-entertainment/tv/news/snl-harry-styles-host-guest-episode-when-a9169856.html", "downloaded_at": "2019-10-25 00:07:31.140010+00:00", "title": "SNL: Harry Styles lands rare gig as both host and musical guest", "language": "en", "text": "Harry Styles will perform double duty on Saturday Night Live as both host and musical guest.\n\nThe singer is scheduled to appear on the sketch show on 16 November.\n\nHis Twitter account made the announcement on Thursday in the traditional SNL format. The series typically makes casting announcement by sharing images of three sticky notes arranged in a vertical column. The first one features the episode’s date, the second one reveals the host’s name, and the third designates the musical guest.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn Styles’s case, the second and third sticky notes both bear his name, indicating that he’ll be filling both slots.\n\nStyles was previously featured on SNL in April 2017, but on this occasion, he was just the musical guest while hosting duties were performed by Jimmy Fallon.\n\nShape Created with Sketch. The 10 best cold opens on Saturday Night Live Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The 10 best cold opens on Saturday Night Live 1/10 First presidential debate Before Alec Baldwin’s Donald Trump, there was Will Ferrell’s George W Bush. Ferrell’s brashness as the then-presidential candidate, as well as Darrell Hammond’s uncanny portrayal of Gore, are comedy gold. What’s truly amazing, though, is that this skit seems to imply that Bush is too stupid to win the presidency – which he of course did, a month to the day after the sketch aired. Sounds familiar, right? 2/10 Sarah Palin and Hillary Clinton address the nation Tina Fey’s portrayal of Sarah Palin made history for a reason – it was perfect in every way and could only be magnified by the addition of Amy Poehler as Hillary Clinton . Under the guise of presenting a nonpartisan message about the 2008 presidential campaign (the skit aired on 13 September, 2008, two months before Barack Obama’s victory), Palin, who was John McCain’s running mate, tries to pitch herself as the perfect candidate for the presidency. Poehler’s Clinton, in turn, exclaims: “Noooo mine!” 3/10 The wolverines SNL’s first skit was also one of its best. In this inaugural sketch, which aired on 11 October, 1975, John Belushi teams up with his fellow original cast member Michael O’Donoghue to play a foreign man trying to learn English, only for his tutor to display an unsettling fixation on wolverines. Both apparently drop dead before a denim-clad Chevy Chase steps in to deliver the now-iconic line: “Live from New York, it’s Saturday night!” Absurd, goofy and slightly odd, this sequence set the tone of the sketch show for decades to come. 4/10 Joint session In March 1991, George H W Bush addressed Congress on the end of the Gulf War, prompting several bouts of rapturous applause in the process. That moment, naturally, was spoofed on SNL that same month with Dana Carvey as a self-congratulatory president and Michael J Fox as his confused vice-president Dan Quayle, who struggles to clap at the right times. 5/10 Steve Martin does a musical Before Alec Baldwin took the record for most appearances as SNL host, Steve Martin held the honour despite never being a regular cast member. As you can see in this cold open, he just wasn’t that bothered about joining full-time. The skit opens in his dressing room where he becomes nostalgic over his old King Tut costume. From there, he bursts into a Broadway-style performance reminisces about the good old days. 6/10 The Bush twins While Will Forte did an admirable impression of President George W Bush, it was Tina Fey and Amy Poehler who stole the show as the Bush twins, who communicate in a secret language by adding the letter “b” to everything. “B-what b-about the b-weapons b-of b-mass b-destruction?!” 7/10 Donald Trump, president-elect press conference He may have hated acting out Donald Trump's creepy, bizarre mannerism, but Alec Baldwin's portrayal of 45 won him an Emmy and plenty of acclaim. For good reason: Baldwin's version of Trump is so good it's actually rather unpleasant to watch. 8/10 Sean Spicer press conference Melissa McCarthy was a better Sean Spicer than Sean Spicer ever was. From the giant stick of gum to the low mutter of “oh boy” before trying to read out the name of the leader from “central Asia”, she mastered every single tick the former White House Communications Director had. Arguably the best moment is “Spicer” raging at New York Times reporter, Glen. Trying to flog some of Ivanka Trump’s jewellery comes a close second. 9/10 Democratic debate Before he drew acclaim for his portrayal of a pouting, tantrum-throwing Trump, Alec Baldwin nailed his impression of former US senator Jim Webb. He’s not the highlight of this cold open, though. That honour goes to Larry David as Bernie Sanders, who is uncanny in his likeness of the presidential candidate. 10/10 Ford on the phone Chevy Chase’s turn as a fumbling Gerald Ford made such an impact that the real president joined a subsequent episode of SNL on 17 April, 1976. In this 8 November, 1975 skit, Chase’s Ford, while attempting to address the nation and comment on Ronald Reagan’s announcement that he would run for president, presses a full glass of water against his ear instead of his phone handset, struggles to transfer a call, mishandles charts, and takes a momentous tumble over his own desk. Delightful. 1/10 First presidential debate Before Alec Baldwin’s Donald Trump, there was Will Ferrell’s George W Bush. Ferrell’s brashness as the then-presidential candidate, as well as Darrell Hammond’s uncanny portrayal of Gore, are comedy gold. What’s truly amazing, though, is that this skit seems to imply that Bush is too stupid to win the presidency – which he of course did, a month to the day after the sketch aired. Sounds familiar, right? 2/10 Sarah Palin and Hillary Clinton address the nation Tina Fey’s portrayal of Sarah Palin made history for a reason – it was perfect in every way and could only be magnified by the addition of Amy Poehler as Hillary Clinton . Under the guise of presenting a nonpartisan message about the 2008 presidential campaign (the skit aired on 13 September, 2008, two months before Barack Obama’s victory), Palin, who was John McCain’s running mate, tries to pitch herself as the perfect candidate for the presidency. Poehler’s Clinton, in turn, exclaims: “Noooo mine!” 3/10 The wolverines SNL’s first skit was also one of its best. In this inaugural sketch, which aired on 11 October, 1975, John Belushi teams up with his fellow original cast member Michael O’Donoghue to play a foreign man trying to learn English, only for his tutor to display an unsettling fixation on wolverines. Both apparently drop dead before a denim-clad Chevy Chase steps in to deliver the now-iconic line: “Live from New York, it’s Saturday night!” Absurd, goofy and slightly odd, this sequence set the tone of the sketch show for decades to come. 4/10 Joint session In March 1991, George H W Bush addressed Congress on the end of the Gulf War, prompting several bouts of rapturous applause in the process. That moment, naturally, was spoofed on SNL that same month with Dana Carvey as a self-congratulatory president and Michael J Fox as his confused vice-president Dan Quayle, who struggles to clap at the right times. 5/10 Steve Martin does a musical Before Alec Baldwin took the record for most appearances as SNL host, Steve Martin held the honour despite never being a regular cast member. As you can see in this cold open, he just wasn’t that bothered about joining full-time. The skit opens in his dressing room where he becomes nostalgic over his old King Tut costume. From there, he bursts into a Broadway-style performance reminisces about the good old days. 6/10 The Bush twins While Will Forte did an admirable impression of President George W Bush, it was Tina Fey and Amy Poehler who stole the show as the Bush twins, who communicate in a secret language by adding the letter “b” to everything. “B-what b-about the b-weapons b-of b-mass b-destruction?!” 7/10 Donald Trump, president-elect press conference He may have hated acting out Donald Trump's creepy, bizarre mannerism, but Alec Baldwin's portrayal of 45 won him an Emmy and plenty of acclaim. For good reason: Baldwin's version of Trump is so good it's actually rather unpleasant to watch. 8/10 Sean Spicer press conference Melissa McCarthy was a better Sean Spicer than Sean Spicer ever was. From the giant stick of gum to the low mutter of “oh boy” before trying to read out the name of the leader from “central Asia”, she mastered every single tick the former White House Communications Director had. Arguably the best moment is “Spicer” raging at New York Times reporter, Glen. Trying to flog some of Ivanka Trump’s jewellery comes a close second. 9/10 Democratic debate Before he drew acclaim for his portrayal of a pouting, tantrum-throwing Trump, Alec Baldwin nailed his impression of former US senator Jim Webb. He’s not the highlight of this cold open, though. That honour goes to Larry David as Bernie Sanders, who is uncanny in his likeness of the presidential candidate. 10/10 Ford on the phone Chevy Chase’s turn as a fumbling Gerald Ford made such an impact that the real president joined a subsequent episode of SNL on 17 April, 1976. In this 8 November, 1975 skit, Chase’s Ford, while attempting to address the nation and comment on Ronald Reagan’s announcement that he would run for president, presses a full glass of water against his ear instead of his phone handset, struggles to transfer a call, mishandles charts, and takes a momentous tumble over his own desk. Delightful.\n\nThe singer, who recently released a new song titled “Lights Up”, isn’t the only entertainer to get the honour of a double billing this season.\n\nChance The Rapper is also scheduled to act as both host and musical guest this weekend, on 26 October.\n\nOther stars who have filled both roles in the past have included Taylor Swift, Lady Gaga and Ariana Grande.", "description": "Harry Styles will perform double duty on Saturday Night Live as both host and musical guest. The singer is scheduled to appear on the sketch show on 16 November.", "authors": ["Clémence Michallon"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/24/16/gettyimages-1141783372-1.jpg", "published_at": "2019-10-24"}