{"pub": "cnbc", "url": "https://cnbc.com/2019/10/04/stock-market-goes-from-worried-to-rally-mode-on-friday.html", "downloaded_at": "2019-10-04 23:51:04.886557+00:00", "title": "Stock market goes from worried to rally mode on Friday", "language": "en", "text": "The market is in a slow melt-up mode on Friday.\n\nThere was a volume spike at 11:30 a.m. as European markets closed and as the S&P 500 passed the earlier highs of the day at 10:00 a.m. ET, a technical move in-line with typical momentum action, JP Morgan's Marko Kolanovic noted in remarks to clients: \"If the market can move ~50bps higher during the day, it could spark a significant rally driven by the trend followers (CTAs) [Commodity Trading Advisors] and the same put options that helped push the market lower earlier in the week.\"\n\nBehind the rally: a jobs report sufficient to cool down some, but not all, of the talk about a recession in 2020.\n\nThe other big question: Did it cool the Fed's likely path to cutting rates again at the end of October? Most feel it did not and the Fed will still likely cut for the third time this year.\n\n\"It's not strong enough to allay fears that there isn't a slowdown, but not weak enough to confirm the bear narrative,\" Alec Young, managing director, global markets research at FTSE Russell told me. \"We need stronger data to get the recession risk off the table.\"\n\nWhat's next? Trade and tariffs. The president confirmed a China delegation will be in Washington next week to resume negotiations. Expectations are low, but there is an urgency due to the recent weaker economic stats.\n\nAfter next week we get earnings reports, and there will be comments on how the fourth quarter is looking, beginning with J.P. Morgan Chase and Wells Fargo on October 15th.\n\nIn a note to clients this morning, Morgan Stanley's bank analyst team, led by Betsy Graseck, noted that the third quarter was difficult for banks, marred by rate pressure, trade tensions, and a slowing global economic growth outlook. The team noted that a half-point decline in 10-year bond yields would weigh on bank results, though consumer loan growth and mortgage applications were strong.\n\nRounding out the first big week of earnings is Johnson & Johnson, also on October 15th, IBM on October 16th, and large global Industrial names Honeywell and Textron on the 17th.", "description": "The market is in a slow melt-up mode on Friday.", "authors": ["Bob Pisani"], "top_image": "https://image.cnbcfm.com/api/v1/image/106083903-1565988707468nyse.jpg?v=1570209509", "published_at": "2019-10-04"}