{"pub": "dailybeast", "url": "https://thedailybeast.com/two-more-women-accuse-extra-host-aj-calloway-of-sexual-assault-he-thought-it-was-a-game", "downloaded_at": "2019-10-21 08:54:51.582183+00:00", "title": "‘Extra’ Host A.J. Calloway Accused of Sexual Assault by Two More Women: ‘He Thought It Was a Game’", "language": "en", "text": "Last June, Sil Lai Abrams’ Me Too story finally went public. And her testimony, which included sexual-assault allegations against Russell Simmons and Extra co-host A.J. Calloway, was an exceptional one.\n\nAs reported in The Hollywood Reporter, Abrams’ attempt to speak out was nearly derailed. In January, Abrams taped an interview with MSNBC’s Joy Reid. After months of waiting, Abrams eventually came to learn that the network—a subsidiary of NBC, which aired Extra—had passed on her segment. Reflecting on her experience with NBC, Abrams told THR, “They took away my voice.”\n\nAbrams’ allegations eventually came to light thanks to the thoroughly reported June exposé. But the writer and domestic-violence awareness activist is still disturbed by the lack of impact, specifically when it comes to her allegations against Calloway. And now, two more women have come forward to The Daily Beast alleging that Calloway sexually assaulted them—one of whom reported her claim to the police on Dec. 24.\n\nCalloway co-hosts Extra, a syndicated entertainment news show that was once considered an NBC “staple.” But the network, which has been implicated in multiple damning reports in the Me Too era, from its refusal to run Ronan Farrow’s Harvey Weinstein investigation to Matt Lauer, recently declined to renew the show. Beginning in fall 2019, Extra will move to Fox-owned stations in five major markets.\n\nMeanwhile, Abrams’ testimony doesn’t appear to have derailed Calloway’s career—he can still be seen dancing with the Rockettes on Extra and interviewing celebrities on the Women in Media Awards red carpet. Calloway has talked to Gloria Steinem, Ashley Judd, and Gretchen Carlson about sexual harassment and abuse. In October 2017, he discussed the importance of speaking out and supporting women of color. “I spoke to a lot of women today, and that’s one thing that they said, they said that African-American women are sexually harassed more than women of other races, or white women,” Calloway told theGrio. “We’ve got to support our sisters. We have to stand up for them.”\n\nIn her 2007 memoir, No More Drama: Nine Simple Steps to Transforming a Breakdown into a Breakthrough, Abrams says she used pseudonyms for both Russell Simmons and A.J. Calloway. She referred to Calloway as a “Well-spoken B-list celebrity” named Ray, whom she recruited for a charity event.\n\nAfter the event, Abrams thanked Calloway for his participation, and they discussed her dream of starting her own non-profit. They proceeded to speak weekly on the phone about the non-profit. Abrams wrote that Calloway would repeatedly bring up the topic of sex; she explained, “Although his behavior could be annoying at times, I chose to focus on his willingness to assist with my project instead of his inappropriate boundary testing.”\n\nThe day after Christmas 2006, Abrams and Calloway met for a drink. Afterwards, he offered to drive her home. In her memoir, she recounts in detail how Calloway exposed himself to her in the car and then threw himself on her despite her protestations. Abrams narrates, “Pushing him away, I hissed, ‘Let go…I said let me go…’ as he started groping my right breast. My heart was racing…all I wanted was to grab my purse and bag and get out of the car. But he wasn’t having any of that. ‘Touch it…,’ he said hoarsely, exposing himself again. ‘This is so wrong…just stop…’ I pleaded. He then tried to push my head down into his lap, but I wrested myself away. ‘Just touch it…,’ he begged again, grabbing my hand and returning it to his rigid member. I gave up. Our struggle had been going on for close to six minutes and I figured he would leave me alone if I just let him do what he wanted. Ray continued to stroke himself for another minute until he climaxed, all over my hand and his. Reaching across me, he opened the glove compartment and pulled out a stack of napkins.”\n\nThe THR piece repeated this testimony, and referenced two friends who confirmed that Abrams told them about the attack shortly after it occurred. In her memoir, Abrams writes that she reported the incident to the police—which was corroborated by THR: “She filed a report and Calloway was arrested; Abrams still has copies of four orders of protection, and THR has reviewed them. (These orders of protection are restraining orders issued to prevent alleged perpetrators from harassing their accusers.) The statutes cited in the ‘charges’ section of the orders indicate that Calloway was charged under the sections of New York law related to forcible touching and attempted sexual misconduct offenses.”\n\nThe case was reportedly dismissed “on procedural grounds.” Calloway’s attorney told THR that, “These decade-old allegations are false. They were false when they were first made and are false now. Mr. Calloway fully cooperated with law enforcement from the beginning, denied the allegations, and the case was completely dismissed in November 2007. After the case was dismissed, the court records were sealed as a matter of law and are no longer available.”\n\nAbrams told The Daily Beast, “When they say my case was dismissed on a technicality, that is the most vague answer possible. It was dismissed because his lawyer was able to invoke the Sixth Amendment after the Assistant District Attorney handling my case asked for one too many continuances and as a result violated his right to a fair and speedy trial. So the case was dismissed on a technicality, but I was willing to go to court and we were prepping to go.”\n\nCalloway denied the allegations in a statement, saying, “I was disappointed to read the false allegations about me in The Hollywood Reporter. As I have maintained from the beginning, these allegations are not true. When I was first notified about these allegations by law enforcement more than a decade ago, I fully cooperated from the beginning and the case was dismissed.”\n\nHis attorney Lisa E. Davis told The Daily Beast, “With respect to the allegations by Ms. Abrams, Mr. Calloway has no further comment beyond his previous denial.”\n\nAbrams, who began speaking out over a decade ago, hasn’t stopped. “I mean, in order to manufacture my allegations, I would have had to retroactively put them in my book in 2007 without naming them, hoping that a movement like Me Too would happen? I would have to have had the foresight to anticipate the Me Too movement and go on Al Jazeera and talk about my experience with Russell when I was being asked why women waited 25, 30 years to come forward during the Bill Cosby trial.”\n\n“ What is the win in me going public about him? A criminal trial? I already tried to go through the justice system and it failed me. ”\n\n“What is the win in me going public about him? A criminal trial? I already tried to go through the justice system and it failed me,” she continues. “A civil lawsuit? Please. This has never been about money or notoriety. If that were the case, I certainly wouldn’t have chosen to become a full-time advocate and activist.”\n\nKim Masters, the THR journalist who broke Abrams’ story, told The Daily Beast that neither Extra nor Warner Bros. Television, which produces the syndicated show, responded to requests for comment on the allegations. “That is unprecedented in my experience,” Masters continued. “We just reported a story on allegations involving the Showtime series SMILF and we had a substantive response from ABC Studios, which produces the series, and a no comment from Showtime. From Extra and Warner TV, we did not even get a no comment regarding A.J.”\n\n“I do have to wonder whether race has something to do with this,” adds Masters. “I’m willing to say that on the record because it’s so unusual to me, and you know, this is a black woman making an on-the-record allegation in a reputable publication, where there’s been an arrest, [so] I have to wonder whether race was an element in this.”\n\n“Quite frankly,” Abrams explained, “Ryan Seacrest went through an ‘investigation’ and the network issued a statement. Are you telling me that A.J. Calloway does not need to be held to the same standard as Ryan Seacrest? Are they ignoring us because we’re women of color, is that why Warner Bros. refuses to comment? There’s an inconsistency which is occurring here and I can’t wrap my head around why.”\n\nAbrams told The Daily Beast that in the wake of the Hollywood Reporter piece, she’s been contacted by other women with sexual-misconduct allegations against Calloway. She puts the current count at 10 accusers, herself included. “I spoke to these women, and they’re terrified of coming forward...So when I was writing my Huffington Post piece about the impact coming forward has had on my life, I emailed Blake Bryant, the head of publicity at Warner Bros. Television—the same guy who Kim Masters reached out to when she was working on her piece for The Hollywood Reporter—asking him why they haven’t issued any statements. I let him know that I’d spoken with multiple women and there are multiple alleged victims of A.J. I was thinking, Warner Bros. has got to say something, I mean, what are they going to do? I got no response.”\n\nThe Daily Beast reviewed this July email, in which Abrams mentioned that both she and Kim Masters had been approached by several accusers. Masters confirmed to The Daily Beast that, “I spoke to three other women about AJ. I want to be really clear that while these women have stories that seemed potentially credible, we did not vet and report them.” In her email, Abrams emphasized, “I’m specifically asking if any internal investigation has been taken and if Warner Brothers has any intention to comment on the allegations against Mr. Calloway.” Abrams told The Daily Beast, “Warner Bros.’ response is no response.”\n\nWhen reached for comment, Warner Bros. Television’s Blake Bryant told The Daily Beast that, “ A.J. issued a personal statement last year which is public and available for your use.”\n\n“The complete absence of comment and refusal to even acknowledge these allegations is worse,” Abrams continued. “What Warner Bros. is saying is that the trauma of sexual violence is so inconsequential that we won’t even deign to comment on it. And this is a horrible message to send to survivors and to the public at large.”\n\nOf the additional accusers, Calloway’s lawyer, Lisa E. Davis, told The Daily Beast, “We cannot comment on vague secondhand allegations beyond that Mr. Calloway firmly denies any claim that he assaulted someone.”\n\nAn accuser who wished to remain anonymous told The Daily Beast that she brought her allegation of sexual assault against A.J. Calloway to the West Orange Police Department in New Jersey on December 24. She explained that she spoke with multiple officers on that date, and was told that a detective would be reaching out to interview her.\n\nShe explained that she first reached out to Abrams in December “ because the first person I told didn’t believe me, and I just happened to Google to see if anybody else had the same experience with the same person and her name popped up. So she was actually the first person I told him after the actual incident who actually believed me.” She decided to go to the police “when I found out I wasn’t the only one.” The West Orange Police Department confirmed that a complaint of aggravated sexual assault was filed on December 24. Due to the nature of the allegations, they were unable to release any further details on the complaint.\n\nAnother woman who reached out to Sil Lai Abrams agreed to talk to The Daily Beast on the condition of anonymity. “I’m terrified about coming forward,” Talia* explained. “I don’t want it to affect my future, everything that I’ve worked hard for—and A.J. is someone that would try to do that.”\n\nTalia told The Daily Beast that she first became aware of Calloway through mutual friends; they proceeded to connect on social media. “He started messaging me in 2011,” she began. “He wanted to take me out to dinner and I kept telling him no, I wouldn’t entertain his advances.” The Daily Beast reviewed screenshots of messages between Talia and Calloway that seem to confirm his romantic pursuit of her. Talia said that she was wary of their age gap—she was in her early twenties, and he was in his late thirties at the time. “After him asking me out repeatedly I agreed to go, because it got to a point where he started to get upset that I was actually not willing to go out with him. He was kind of like, do you know who I am?”\n\n“ That’s when I started to realize, oh my God, this is serious. Like, he’s really going to try and force me to have sex with him. ”\n\nAccording to Talia, she and Calloway went out for dinner. She recalled her date drinking heavily, and proceeding to invite “a group of people to his home to party.” Calloway was driving Talia that night. Once they arrived at his home with the group, she noticed that “he made everyone put their belongings on the kitchen table.” The party proceeded downstairs to the entertainment room, which Talia said was complete with a home theater and a bar.\n\nAt around three in the morning, Talia remembered, Calloway walked the other guests out. When he came back, she recalled, “We started making out. And I knew I wasn’t having sex—I knew adamantly I wasn’t having sex because I won’t have sex unless I’m in a committed relationship. So, you know, even though I’m kissing him, I’m thinking, this is the first date, we’re just making out a little bit—because I’ve never even had sex on the first night with someone.”\n\n“Even though he’s tall and he looks skinny, he has some weight to him,” she explained. “He’s heavy, you know, and he put his whole body weight on top of me. He kept trying to open my blouse. He really was going for my skirt, and I was literally pulling my skirt down because I was not going to allow him to go any further. And he thought it was a game or something because he kept laughing and giggling and I’m like, no, stop, stop. And the more I said stop the more he got aggressive, and that’s when I started to realize, oh my God, this is serious. Like, he’s really going to try and force me to have sex with him.”\n\n“I just remember trying to push him off of me, and this went on for 40 minutes straight,” she continued. “Me attempting to push him off of me and fighting to keep him from taking my clothes off. Eventually he got tired, and I think it’s because he was so intoxicated—it was wearing him out.”\n\n“And I just remember him pulling his penis out and he began stroking himself and he kept trying to put my hand on his penis and eventually he ejaculated on my hands.”\n\nTalia recalled wanting to “get out of there” but she didn’t have a ride home. “After what happened he said, ‘I’ll take you home in the morning, I promise.’ It was like he was in denial about what he just did to me. And I didn’t know what else to do, so I just agreed. I remember that the whole night he wrapped his legs around me, so I couldn’t get away. I just remember trying to move and position myself where I could breathe because my face was in his chest, his legs were wrapped around me, his arms were wrapped around me, and that’s how he slept the whole night until morning.”\n\nAfterwards, Talia disconnected from the mutual friends she shared with Calloway, because she didn’t “want to risk ever having to see him again.”\n\n“I never wanted to tell anyone because I didn’t think people would believe me because he was a celebrity and I was just a regular girl,” she said. “I thought that it’s just one of those situations that happen and you just have to move forward with your life.”\n\nThat was until she saw the article about Calloway featuring Sil Lai Abrams’ testimony. “When I saw it and I read what happened to Miss Abrams, I knew right then and there she wasn’t lying. I was 150 percent sure that she wasn’t lying because what she described was almost identical to what happened to me.”\n\nTalia reached out to Abrams to “let her know that I believed her because he did it to me, too.”\n\n“I wanted her to know that even if billions of people don’t believe you, there’s someone who can vouch that what you said is really true.”\n\nTalia was shocked to learn that other women had reached out to Abrams with allegations against Calloway. “It was crazy because this whole time I thought my assault was an isolated incident because I had never heard anything about him that was negative after what he did to me.”\n\n“I think the hardest part for me is every time I turn the TV on, he was on the television. He’s on Extra, he’s doing the Soul Train Awards or something and it would make me feel like—not just disgusted, but low and defeated, like he gets to do whatever he wants and hurt people, and I have to live with the shame and pain of what he did to me.”", "description": "Two more women have joined Sil Lai Abrams in alleging that the television host attacked them—and one of them recently reported her claim to the police. Will Warner Bros. listen?", "authors": ["Amy Zimmerman", "Entertainment Reporter"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1546592005/181224-zimmerman-aj-accusations-tease_p9yazx", "published_at": "2019-01-04"}