{"pub": "guardian", "url": "https://theguardian.com/film/2019/sep/07/venice-film-festival-shock-and-awe-as-joker-and-roman-polanski-triumph", "downloaded_at": "2019-09-08 11:55:33.040900+00:00", "title": "Venice film festival: shock and awe as Joker – and Roman Polanski – triumph", "language": "en", "text": "Joker, Todd Phillips’ mordant spin on Gotham’s grinning antihero, has won the Golden Lion award at the 76th Venice film festival.\n\nThe film, which stars Joaquin Phoenix as a would-be standup comic, was ecstatically received at its premiere on the Lido last weekend, with critics immediately tipping it to be the first superhero film to take the best picture Oscar.\n\nRecent Golden Lion recipients include Roma and The Shape of Water, both of which went on to triumph at the Academy Awards.\n\nJoker review – Joaquin Phoenix’s villain has last laugh in twisted tale Read more\n\nIn his speech on Saturday, Phillips, whose previous films include the Hangover trilogy, thanked Warner Bros for entrusting him with the DC property.\n\nA sequel is rumoured to be in the works, as well as a film in which Phoenix’s Joker encounters Robert Pattinson, who was recently chosen to replace Ben Affleck as Batman.\n\nAlthough Joker was a hit with reviewers and Phoenix is something of a festival darling, the result was nonetheless perceived to be an unusually mainstream choice for Lucrecia Martel’s jury.\n\nYet more surprising, given Martel’s disparaging remarks about its director at the opening press conference, was the awarding of the grand jury prize to Roman Polanski’s An Officer and a Spy.\n\nAn Officer and a Spy review – Polanski's iron-heeled inquest into 1890s antisemitism Read more\n\nThe film, which stars Jean Dujardin and Louis Garrel, is based on Robert Harris’s novel about the Dreyfus affair in 1895 France. Yet despite the continued controversy surrounding its director, that film also met with highly positive reviews.\n\nPolanski did not travel to the festival to promote the drama, nor did he attend the closing night ceremony to pick up his prize.\n\nLuca Marinelli won best actor for Martin Eden, and Ariane Ascaride took the best actress prize for the the French domestic drama Gloria Mundi.\n\n\n\n", "description": "Comic book movie starring Joaquin Phoenix takes top award and An Officer and a Spy wins grand jury prize", "authors": ["Staff"], "top_image": "https://i.guim.co.uk/img/media/724d1b4198854d8ddbb73b2db2355ed5fcaff856/0_129_3072_1843/master/3072.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=17b0f3da0c8cd7bb5e89d8a0d3580387", "published_at": "2019-09-07"}