{"pub": "vice", "url": "https://i-d.vice.com/en_us/article/a35apz/instagram-is-banning-plastic-surgery-effect-filters", "downloaded_at": "2019-10-22 13:23:11.326375+00:00", "title": "instagram is banning plastic surgery-effect filters", "language": "en", "text": "Eighth Grade (2018)\n\nThis article originally appeared on i-D UK.\n\nIf you can’t stomach getting lip-fillers and cheek implants, but like to entertain the idea of seeing what you might look like if you did, Instagram's Effect gallery of face filters have been doing a solid job of making us look snatched since the feature debuted earlier this year. Over the past few months, you’ll most likely have noticed how popular they’ve proven. Digital designer Teresa Fogolari’s Plastica filter, which will shrink your nose, raise your cheekbones and give you a dangerously big pout, has been used over 200 million times.\n\n\n\nBut the company behind Instagram’s AR face filter feature, Spark AR, have just announced their plans to root out and ban these filters that give user's a plastic surgery-esque aesthetic, in an attempt to curb the spread of body dysmorphia throughout the platform.\n\n“We want Spark AR effects to be a positive experience and are re-evaluating our existing policies as they relate to well-being,” the company said in a statement posted to Facebook, before mentioning that they’d be removing all of the current effects associated with plastic surgery, postponing the approval of any new ones, while removing as many policy-violating effects as they’re identified for the foreseeable future.\n\nWhile it might seem like an excuse to spoil a bit of online fun, a 2018 study showed that “exposure to idealized Instagram images (attractive peers, celebrities) has a detrimental impact on body image”. So pair that with the opportunity to completely switch-up your face, and the effects are bound to intensify. Spark haven’t stated when the mass deletion will formally kick off, but with the pressure to formally tackle issues of self-esteem being felt from all sides, you can expect filters like Plastica to disappear from your IG stories sooner rather than later.\n\nThis article originally appeared on i-D UK.", "description": "It's the latest attempt to counter Insta-dysmorphia.", "authors": [], "top_image": "https://video-images.vice.com/articles/5dadb3236518eb000a8da653/lede/1571667928104-tumblr_pl1zowCkLr1u850vmo4_500.jpeg?crop=0.9457777777777778xw:1xh;center,center&resize=1200:*", "published_at": "2019-10-21"}