{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-thomas-cook-grp-investment-tunisia/thomas-cook-owes-tunisian-hotels-60-million-euros-minister-idUKKBN1W812M", "downloaded_at": "2019-09-23 11:56:37.339727+00:00", "title": "Thomas Cook owes Tunisian hotels 60 million euros - minister", "language": "en", "text": "Passengers are seen at Enfidha-Hammamet International Airport, Tunisia September 23, 2019. REUTERS/Zoubeir Souissi\n\nTUNIS (Reuters) - Thomas Cook owes Tunisian hotels 60 million euros (52.92 million pounds) for stays in July and August, Tourism Minister Rene Trabelsi told Reuters on Monday, adding that 4,500 British Thomas Cook customers are still in the country.\n\nTourism is a vital sector for Tunisia’s economy and a key source of foreign currency, and the government had expected another 50,000 Thomas Cook customers to visit this year, he added.\n\n“I will have a meeting on Tuesday with the British Embassy in Tunisia and the hotel owners to see how debt could be redeemed,” Trabelsi said.\n\nThe collapse of Thomas Cook, one of Britain’s oldest companies, has stranded more than half a million tourists around the world. It ran hotels, resorts and airlines for 19 million people a year in 16 countries.\n\nBritain’s Civil Aviation Authority (CAA) said the government had a fleet of planes ready to bring home British customers over the next two weeks and they should not go to the airport until they had been informed they were due on a return flight.\n\nThe British regulator is also contacting hotels hosting Thomas Cook customers to tell them that they will be paid by the government, through an insurance scheme.\n\nSome British tourists said a hotel in Tunisia briefly stopped them leaving on Saturday night, demanding they settle bills that Thomas Cook owed for their stay. The Tunisian government said it was a misunderstanding.\n\nMajor European tour operators only started to return to Tunisia last year after militants killed 39 tourists, mostly British, in an attack on a beach in Sousse and 21 people in the Bardo National Museum in the capital Tunis.\n\nTourism accounts for around 8% of Tunisia’s economy and employs 400,000 people. It had expected to receive a record 9 million tourists by the end of 2019 after recovering from the impact of the 2015 attacks.", "description": "Thomas Cook owes Tunisian hotels 60 million euros (52.92 million pounds) for stays in July and August, Tourism Minister Rene Trabelsi told Reuters on Monday, adding that 4,500 British Thomas Cook customers are still in the country.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190923&t=2&i=1432933381&w=1200&r=LYNXMPEF8M0V9", "published_at": "2019-09-23"}