{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/sportsnews/article-7625725/British-Cycling-doctor-Richard-Freeman-admit-telling-lot-lies.html", "downloaded_at": "2019-10-29 14:26:56.330218+00:00", "title": "Ex-British Cycling and Team Sky doctor Richard Freeman will admit to telling 'a lot of lies'", "language": "en", "text": "The doctor at the centre of the mystery testosterone delivery to British Cycling and Team Sky headquarters will admit to telling a 'lot of lies' - and that he ordered the banned substance.\n\nRichard Freeman attended a rescheduled medical tribunal in Manchester on Tuesday morning after failing to appear at a previous date due to health reasons.\n\nAnd in stunning early legal arguments his representative, Mary O'Rourke QC, said her client admitted to previously telling a lot of lies but had now told the truth via his witness statement - which was only submitted last month.\n\nLeft: Ex-British Cycling doctor Richard Freeman is pictured during his time with Team Sky; Right: Freeman helps Sir Bradley Wiggins after a crash in 2011\n\nIt also emerged that Dr Freeman will admit that he was behind the order of Testogel but will deny that he asked for it so that it could be given to an athlete to improve their performance.\n\nHe is accused of ordering 30 sachets of the banned substance from Fit4Sport Limited in Oldham to the Manchester Velodrome on May 16, 2011.\n\nDr Freeman is also alleged to have made untrue statements when he denied making the order, suggesting that it had been made by mistake.\n\nHowever, on an explosive morning before a three-person tribunal panel at the Medical Practitioners Tribunal Service (MPTS), Miss O'Rourke said he would admit ordering the Testogel but would deny it was for an athlete.\n\nDr Freeman's witness statement declaring the above was made on September 24 this year.\n\nFreeman is accused of ordering 30 sachets of the banned substance Testogel to the Manchester Velodrome (pictured) in May 2011 - something he has denied until now\n\nMiss O'Rourke also disclosed that her client could previously 'not bring himself to tell the truth, even to his lawyers', before finally making his statement last month.\n\nQuoting Freeman, who was sat alongside her at the Manchester hearing, she added: 'I am here now…this is the truth.'\n\nMuch of the discussion centred around the charge that Freeman ordered the gel to be given to an athlete.\n\nIn discussions around potential changes to the charges Simon Jackson QC, for the General Medical Council said: 'Your motive was to obtain testosterone to give to an athlete to improve an athlete's performance.'\n\nHowever, Miss O'Rourke responded: 'It does not matter for Mr Jackson what the motive is because the burden of proof is on the GMC to prove the motive they assert…that's the burden they have given themselves.'\n\nMiss O'Rourke said the only GMC witness she required to cross examine was former Team Sky coach Shane Sutton, who was also personal coach to Sir Bradley Wiggins.\n\nFormer Team Sky coach Shane Sutton (left), who was also personal coach to Sir Bradley Wiggins (right), will be called as a witness in the hearing\n\nDr Freeman is expected to argue that the testosterone was ordered for a non-athlete member of staff.\n\nThe GMC will call on an expert endocrinologist and will say that the member of staff had no need for the substance.\n\nMr Jackson also urged the panel to look at the history of what had been said by Dr Freeman prior to the submission of his statement in September to highlight what they deem inconsistencies.\n\nMiss O'Rourke objected to words like prescribed and patient, and said that Freeman was not an endocrinologist and his level of knowledge was more that of a GP.\n\nThe hearing is scheduled to run to December 20.", "description": "The doctor at the centre of the mystery testosterone delivery to British Cycling and Team Sky headquarters will admit to telling a 'lot of lies' - and that he ordered the banned substance.", "authors": ["Mike Keegan For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/12/20323358-0-image-a-6_1572350680701.jpg", "published_at": "2019-10-29"}