{"pub": "independent", "url": "https://independent.co.uk/voices/mea-culpa-may-might-guide-style-impeachment-per-cent-check-cheque-geolocation-location-a9113326.html", "downloaded_at": "2019-09-22 02:00:15.366537+00:00", "title": "Mea Culpa: Jo Swinson never fought Vince Cable for Lib Dem leadership", "language": "en", "text": "An actual mea culpa from me. I am a bit ropey on “may” and “might” and got it wrong last week when I discussed why Jo Swinson failed to stand for the Liberal Democrat leadership straight after after the 2017 election.\n\nI said that Vince Cable was a strong candidate and that “she may not have beaten” him. Thanks to Richard Thomas for pointing this out. It has been changed to “she might not have beaten him”. The “may” implies a contest that took place, the result of which remains unknown, while “might” refers to a contest that could have taken place but didn’t.\n\nHundred per cent: In a report about plans for heavier taxes on private schools we said “43 per cent of the 100 most influential news editors and broadcasters” were educated privately. As Bob Erskine reminded us, “per cent” means “per 100”, so just “43 of the 100” was all that we needed.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nLocation, location, geolocation: Bob Erskine also raised an eyebrow about our report of Israel’s alleged spying in Washington. The allegation concerns devices that “can extract identifying information from mobile phones, including their geolocation”. What’s the difference, he asked, between the geolocation of a mobile phone and its location?\n\nWell, strictly, its geolocation is where the technique known as geolocation guesses it is from GPS (the Global Positioning System that uses satellites) and mobile phone masts. As anyone who uses “Find My iPhone” knows, it is pretty accurate, and I so don’t think it mattered whether we had the “geo-” or not.\n\nChequemate: We reported new research from Shelter, the housing charity, under this headline: “Nearly half of private renters ‘one pay check away from losing home’.” This was a direct quotation from Shelter, who are entitled to use the American spelling if they wish, but our style is to spell it “pay cheque”. Thanks to John Schluter for pointing it out.\n\nIt’s a familiar enough phrase, I suppose, but as hardly anyone gets paid by cheque these days it might have been better to have ditched it altogether and to say something like “one month’s pay away from losing home”.\n\nTrumped up charges: Time for another reminder that impeaching Donald Trump does not mean removing him as president. A president can be removed only if convicted – of a “high crime or misdemeanour” – and the whole process is entirely political. Impeachment requires the vote of a simple majority in the lower chamber of congress. Conviction requires a two-thirds majority in the Senate, which requires Republican votes and is therefore much less likely.\n\nBill Clinton, for example, was impeached by the House but acquitted by the Senate.\n\nWe made this clear in our report that the House of Representatives moved closer to impeaching the president by voting to set the rules for hearings, noting that “the Republican-led Senate is unlikely to convict him and remove him from office”.\n\nBut we tripped up by referring to the possibility that the House might recommend “impeachment charges against the president”. Impeach means charge. We might have said “impeaching the president” or “draw up articles of impeachment against the president”.", "description": "An actual mea culpa from me. I am a bit ropey on “may” and “might” and got it wrong last week when I discussed why Jo Swinson failed to stand for the Liberal Democrat leadership straight after after the 2017 election.", "authors": ["John Rentoul"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/20/14/Jo-Swinson-Vince-Cable.jpg", "published_at": "2019-09-21"}