{"pub": "reuters", "url": "https://reuters.com/article/us-australia-economy-salesfigures/australian-car-sales-slump-again-in-september-as-banks-tighten-lending-idUSKBN1WI0DU", "downloaded_at": "2019-10-03 07:50:24.029955+00:00", "published_at": "2019-10-03", "title": "Australian car sales slump again in September as banks tighten lending", "language": "en", "text": "SYDNEY (Reuters) - New car sales in Australia fell for the 18th consecutive month in September, suggesting back-to-back interest rate cuts in June and July had failed to lift consumer spending as banks contain their lending.\n\nData released by the Federal Chamber of Automotive Industries (FCAI) on Thursday showed total sales for September skidded nearly 7% to 88,181 vehicles from a year earlier. For January-September were down about 8% from the same period in 2018.\n\nThe weak data will disappoint the Reserve Bank of Australia (RBA), which cut interest rates for a third time this year on Tuesday to a record low of 0.75% in an effort to revive employment growth, consumer spending and inflation.\n\nThe June and July cuts led banks to reduce mortgage rates, lifting the housing market out of its doldrums. But there have been few signs so far that those cuts boosted other businesses.\n\nIn a statement, FCAI chief executive Tony Weber said slower car sales are “in line with the broader economic environment in Australia” while also noting stringent lending standards as a factor.\n\n“Of particular concern to the industry is the restrictive regulatory lending conditions currently facing consumers,” he said.\n\nWeber also said sales figures raise the question of whether “we have made it too difficult for people to finance basic purchases”.\n\nAnnual loan growth in Australia fell to an eight-year low of 2.9% in August and total credit card debt was the lowest level in nine years.\n\n“Responsible lending” has become a significant issue in recent days with the government as well as the RBA governor urging banks to loosen their purse strings.\n\nTreasurer Josh Frydenberg told a property forum in Sydney that a balance needs to be struck while making loans as an “unduly restrictive application of these obligations can do as much harm as an overly lax one.”\n\n“It is in everyone’s interest that the aspirations of hard working families are not collateral damage in this regulatory process,” he added.\n\nThursday’s data showed Toyota (7203.T) held its top spot in the Australian car market with a 17.2% share followed by Mitsubishi (8058.T) at 10.2% and Mazda (7261.T) at 9.3%.", "description": "New car sales in Australia fell for the 18th consecutive month in September, suggesting back-to-back interest rate cuts in June and July had failed to lift consumer spending as banks contain their lending.", "authors": ["Swati Pandey", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png"}