{"pub": "metro", "url": "https://metro.co.uk/2019/10/27/dreamcatcher-london-review-short-sweet-blend-heavy-metal-meets-k-pop-10984640", "downloaded_at": "2019-10-27 12:58:23.560237+00:00", "title": "Dream Catcher in London review: K-Pop meets heavy metal", "language": "en", "text": "Dreamcatcher performing in France in 2018 (Picture: Getty)\n\nBefore K-Pop girl group Dreamcatcher took to the stage in London on Thursday night, the energy was palpable. Their fans, called InSomnias, rushed to the barricade right at the front, gifts and homemade signs of their faves held aloft, to be as close as possible.\n\nThe outpouring of love began before the six members even stepped on stage and kept going throughout, even the slight pause at the start due to an unfortunate technical difficulty was filled with supportive screams from the fandom at ULU Live.\n\nNo other K-Pop group, male or female, is doing what Dreamcatcher does. Sweet pop vocals and schoolgirl-style outfits shouldn’t match with gothic heavy metal but the group owned it.\n\nAs the floor thudded to the sounds of Chase Me, What, and the haunting Goodnight, members JiU, Yoohyeon, Siyeon, SuA, Dami and Gahyeon (their seventh member, Handong, was unable to join because of ‘schedule conflicts’) pulled off their poised, witchy dance moves with enthusiasm, clearly happy to be in London for a second time in front of a bigger crowd.\n\nAdvertisement\n\nAdvertisement\n\nDreamcatcher’s versions of Bad Boy by Red Velvet and TT by TWICE showed they can easily turn their hands to any style; but Siyeon and SuA’s sultry unit stage made you want to see more of what Dreamcatcher can do.\n\nDream Catcher looked happy to be back in London again\n\nThe members brought a cutout of Handong, who couldn’t be there because of ‘schedule conflicts’\n\nAnd what they can do – very well – are standout numbers like Wonderland, a hypnotising love song with a threatening baseline; and showboating flourishes like Dami twirling a silver cane mid-song or a vampiric neck bite slotted seamlessly into a routine. And the chilled, reggae-inspired July 7th displayed some serious vocal talent from JiU in particular.\n\nWith six albums under their belts, there was scope for the show to run longer than a zippy two hours without the need for covers, or a raffle for albums and signed flags. The latter was a well-meaning addition that took advantage of the small venue, but was ultimately chaotic as a mix up with numbers meant winner after winner failed to come forward. But it was a small blip for InSomnia, who were soon back screaming again through You And I, Over The Sky and their furious comeback single Deja Vu.\n\nAdvertisement\n\nAdvertisement\n\nThe encore of Wake Up and Mayday, a pop punk track pulled straight from a time when the likes of Simple Plan were at their peak, saw one lucky fan manage to snap a Polaroid of Siyeon posing straight down the lens. She looked close to tears with happiness.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nFor her, all the hiccups beforehand were blown out of the water. Even if Dreamcatcher ended up with no music for the whole gig, no doubt the fandom would have stepped in, belting out every word – in Korean and English – by heart. And they would have left with smiles just as big.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: The Big Bang Theory’s Kunal Nayyar breaks social media silence after four months to celebrate Diwali\n\nMORE: X Factor: Celebrity fans call for The Chase star Jenny Ryan to sing next James Bond theme as she lands Safe Chair", "description": "Dream Catcher in London review: K-Pop meets heavy metal in short and sweet show", "authors": ["Sarah Deen"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-924561608_1572177470.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-27"}