{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7573845/Formula-1-star-Daniel-Ricciardo-goes-one-prank-war-Ferrari-rookie-Charles-Leclerc.html", "downloaded_at": "2019-10-15 08:01:29.087213+00:00", "title": "Formula 1 star Daniel Ricciardo goes one up in his prank war with Ferrari rookie Charles Leclerc", "language": "en", "text": "Australian Formula 1 racer Daniel Ricciardo has outdone Ferrari rookie Charles Leclerc during a prank war.\n\nLeclerc, 21, instigated the latest battle in the ongoing 'feud' between the pair over Instagram.\n\nHe started an Instagram story showing Ricciardo sleeping before Leclerc reached out and touched his rival's nose.\n\nAustralian Formula 1 racer Daniel Ricciardo (left) has outdone Ferrari rookie Charles Leclerc (right) during a prank war\n\n'Hello mate,' the Monégasque said.\n\nThe video was seen by Leclerc's 2.4 million followers.\n\nHowever Ricciardo didn't let the lighthearted prank go unanswered - he later ambushed the Ferrari driver as he got out of the toilet.\n\nAs Leclerc stepped out of the bathroom Ricciardo walked up behind him.\n\n'Thirty minutes man, what were you doing in there,' Ricciardo asked.\n\nLeclerc started an Instagram story with his face filling up the screen before turning it to 30-year-old Ricciardo (pictured), who was sleeping\n\nThe video was shared with the racer's 2.5 million followers with the caption: 'I never know what he's doing.'\n\nLeclerc took a moment to register what had happened before the pair burst into laughter.\n\nDuring the Japanese Grand Prix on Saturday Ricciardo finished in sixth place while Leclerc finished just behind him.\n\nRicciardo told Channel 4 the racing season so far has been tough.\n\n'That is where the hate comes in for the sport. It's a love/hate a lot of the time. It's hard and it's frustrating,' he said.\n\nHowever the Renault didn't let the lighthearted prank go unanswered - he later ambushed the Ferrari driver as he got out of the toilet\n\n'You can prepare as well as you can, come into a weekend and say you feel amazing and the headspace is good then something happens.\n\n'That's the part that can really take the wind out of your sails, but fortunately I'm able to sleep it off and wake up the next day and go again.'\n\nHe said he knows moping around doesn't help much, however.\n\nRicciardo joined the sport as a test driver for Scuderia Toro Rosso.\n\nHe made his debut at the 2011 British Grand Prix.", "description": "Australian Formula 1 racer Daniel Ricciardo has outdone Ferrari rookie Charles Leclerc during a prank war.", "authors": ["Claudia Poposki For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/06/19724284-0-image-a-74_1571117233867.jpg", "published_at": "2019-10-15"}