{"pub": "afr", "url": "https://afr.com/markets/equity-markets/asx-to-rally-as-us-jobless-rate-hits-50-year-low-20191006-p52y0n", "downloaded_at": "2019-10-06 07:26:49.968641+00:00", "title": "ASX to rally as US jobless rate hits 50-year low", "language": "en", "text": "\"It either gets worse and we go into a recession, or we bounce from here. We're leaning to the latter at this point,\" said Munro Partners chief investment officer Nick Griffin.\n\n\"Nothing suggests we're heading into a financial crisis. We see volatility ahead, but don't see a major draw down in markets. These cross-currents are probably likely to continue for some time [though].\"\n\nWhile the slowdown in the services sector is still cause for some concern, investors say it's unlikely to be signalling the start of a serious downturn.\n\nChristopher Cuesta says a US recession is unlikely. Christopher Pearce\n\n\"The decline in non-manufacturing ISM's is a concern, but similar declines occurred in 2014 and 2016 and did not precede a recession,\" said ‎THB Asset Management chief executive Christopher Cuesta.\n\n\"ISM and payrolls are reflecting some relative weakness, but nothing which would signal a strong downward shift in US economic activity.\"\n\nThe market is still betting the gentle slide in the US economy will be enough to prompt the Fed to cut rates, with the central bank keen to get ahead of the curve.\n\n“The stepped-down pace of payroll growth continues, but the pace of labour market tightening won't last,\" said T. Rowe Price chief US economist Alan Levenson.\n\nAdvertisement\n\n\"The Federal Open Market Committee leadership may argue that the risk of cutting this month is less than the risk of deferring.”\n\nThe market is pricing in a 76.4 per cent chance the FOMC cuts rates when it meets on October 31, with investors suggesting the Fed will try to maintain some momentum as the economy slows.\n\nLachlan Hughes says the Fed will be keen to stay ahead of the curve. James Brickwood\n\n\"Momentum is a very important aspect to consider for central banks,\" said Swell Asset Management chief investment officer Lachlan Hughes.\n\n\"Consumers can become fearful very quickly so it's important for the Fed to stay ahead of the curve.\"\n\nThe Fed will also have to consider just how long consumers can support the US economy, with the fall in factory activity likely to feed through the rest of the economy as big manufacturing companies lay off their workers due to a lack of work.\n\nThe ongoing trade war between Washington and Beijing looms as a key issue for the US economy, with a resolution likely to set the US economy and global markets soaring.\n\n\"Leading into a presidential [election] year next year, you could never underestimate the possibility the trade war gets called off and Trump declares a huge victory,\" said Bell Asset Management chief investment officer Ned Bell.\n\nAdvertisement\n\n\"There would be a lot of pent up demand that would come into the market and there could be a huge rally. Trump's main barometer of success is the stock market so there's nothing he'd love to see more than the market rally 20 to 30 per cent.\"\n\nPresident Trump could get a chance to soothe markets further this week, with officials from the US and China set to meet in Washington.\n\nNAB senior market strategist Gavin Friend suggested a breakthrough was unlikely but the promise of additional purchases of US agricultural goods or an extension on further tariffs could prove positive.\n\n\"The latter in particular will be important for market sentiment,\" he said.\n\nThe local sharemarket movements are set to be dictated heavily by news from the US, with a quiet week of domestic market and economic events ahead.", "description": "The Australian sharemarket is poised to rebound from a poor week after Friday's jobs report allayed fears the US economy was in dire straits.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5298%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/3f91d38e1a4c2f4fccb655f81c26e649ae94d89a", "published_at": "2019-10-06"}