{"pub": "financialpost", "url": "https://business.financialpost.com/news/retail-marketing/a-canadian-cup-half-empty-tim-hortons-struggle-to-stay-relevant-to-a-new-generation?utm_source=rss&utm_medium=feed&utm_campaign=truncated_content&utm_content=news_retail-marketing&utm_term=devika_desai", "downloaded_at": "2019-10-29 14:00:11.192145+00:00", "title": "A cup half empty: Tim Hortons’ struggle to stay relevant to a new generation of Canadians", "language": "en", "text": "In May 2018, it seemed as if the reputation of Tim Hortons was done for. Swept up in a year of bad business decisions, angry franchise owners and internal acrimonious rows, all laid out on a public platform, left the coffee chain’s image in shambles.\n\nHowever, in the span of a year, the corporation had managed to — somewhat — begin to turn things around. Yet marketing experts say they are doubtful as to whether Tim Hortons can fully recover the iconic popularity it enjoyed among Canadians, especially millennials.\n\nIt took the shine out of Tim Hortons' Canadiana\n\n“When you look at five years of Tim Hortons and some of the challenges they’ve faced, particularly with the franchise lawsuit, I think what it did was give Canadians a glimpse inside of how these franchise organizations work,” said Robert Carter, an NPD industry analyst.\n\n“It took the shine out of Tim Hortons’ Canadiana.”\n\nAs of last year, the coffee chains’ parent company, Restaurant Brands International, announced a new marketing strategy, ‘Winning Together’, to help improve the chain’s relationships with franchise owners, better customer experience and counter the negative media received last year.\n\n“(It’s) a return to the classic Tim’s kind of communication,” said Alan Middleton, who teaches at the Schulich business school. “Use of a couple of local hockey stars, very much a part of Tim’s character, they put a lot of effort into going back out to the franchises to bring them on board and they slowed down the pace of new meal introduction so it was more handleable. It’s a positive struggle to get back to where they were.”\n\nThe efforts partially paid off. IPSOS, a global market research company, reported that the chain made its way back into the top 10 most influential brands in 2018, after dropping down to 16th place the year before.\n\nSales at the Canadian Tim Hortons locations also grew by 2.2 per cent for the quarter ended Dec. 31, 2018, the strongest growth in the last 10 quarters.\n\nHowever, recently posted same-store metrics for the quarter ended September 30 indicated that the chain is still in a slump. Sales decreased by 0.1 per cent and same store-sales, by 1.4 per cent — contrary to a rise of 0.6 per cent last year.\n\nOn the other hand, sister brands Popeye and Burger King saw same-store sales increase by 9.7 per cent and 4.8 per cent respectively, notably due to the launch of the Popeye chicken sandwich and Burger King’s plant-based burger. Tim Hortons’ own similar products were not as successful.\n\n“They were late,” said Middleton. “And competitors move so fast nowadays and you don’t necessarily have to be the first out, but if you’re going to be behind them then you better have a better a better value proposition …. (and) there was nothing different about their late response so they had the worst of both worlds.”\n\n“The market has changed so dramatically,” said Carter. “It doesn’t make sense for them to focus on the Canadiana and the hockey rink, even though it’s popular. Over the next seven years, our population is going to one million due to immigration, there’s a changing demographic.”\n\nThat also includes catering to the younger generation of millennials and Gen Z. The current strategy “doesn’t go that far,” he adds. “There’s opportunity for it to be more aggressive … is it going to take the company into the next generation?”\n\nAccording to Patricia McQuillian, Canadian branding consultant, millennials and Gen Z “are more discerning in their product affiliation.” “What the product stands for and how it threads through their organization,” she said. “Tim’s has that ability but they need to get it out there.”\n\nCompetitors such as McDonalds and Starbucks are already ahead in the game. “They’re at least building on childhood memories and appealing to younger kids, with their happy meals and fast service,” she said. “Tim’s is more of a stodgy brand.”\n\nShe believes the answer lies in product innovation. “There seemed to be a shift when they moved into coffee beverages but they didn’t seem to keep going on with product development. And the challenge here is how do you the strength of the Tim Hortons and their product offerings beyond diversifying their specialty coffee.”\n\nA good example, she suggests, is doughnuts. “Monster Doughnuts, a shop in Hamilton, is an example that caters to millennials,” she said. “Matcha latte doughnuts, lavender doughnuts, vegan doughnuts, apple fritters that will blow your mind.”\n\nAs Starbucks, for instance, was successful with their specialty lattes, so Tim’s has the same opportunity with their doughnuts. “Go beyond the birthday sprinkle doughnut and offer funkier options,” she said.", "description": "As Canadiana as a backyard hockey rink, the coffee chain needs more to get millennials and Gen Z through the door, experts say", "authors": [], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/tim-hortons3.jpg", "published_at": "2019-10-29"}