{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7604951/Meghan-Markle-unveiled-cover-star-Tatlers-310th-anniversary-edition.html", "downloaded_at": "2019-10-23 17:25:26.159727+00:00", "title": "Meghan Markle is cover star of Tatler's 310th anniversary edition", "language": "en", "text": "Tatler has unveiled the Duchess of Sussex as the cover star for its 310th anniversary edition.\n\nThe society bible used an old photo of the Duchess taken during a photoshoot with the Canadian business website Bay Street Bull in 2015, to go with an interview about her now-defunct lifestyle website The Tig.\n\nHowever, it apparently Photoshopped out the chunky gold earrings the Duchess was wearing in the original image.\n\nThe magazine, which goes on sale on Thursday 31st October, will feature comment pieces from four writers, including Lionel Shriver and Lynn Barber, discussing whether Meghan 'divides or conquers'.\n\nRichard Dennen, Editor-in-Chief of Tatler, said: 'It was fascinating delving into the archives for this anniversary issue and seeing how the cast of characters has changed.\n\nTatler has unveiled the Duchess of Sussex as the cover star for its 310th anniversary edition\n\n'Dynasties rise and fall, new money sashays in, celebrities of the day dazzle. As the Duchess of Sussex knows well, every generation has its struggles - but it’s always cool to be on the right side of history.\n\n'I think the Duchess of Sussex is fabulous. I love that she is independent and not afraid of doing things her own way.\n\n'I like her fashion choices, which are chic, sophisticated and grown-up, and the way she is bringing a breath of California cool to the drab and dusty corridors of the old guard.'\n\nIt's not the first time Meghan has appeared on the cover of the magazine, having graced the society bible in May 2018 - two months before her wedding Prince Harry.\n\nMeghan Markle, 38, suffered the awkward blunder while attending the One Young World summit at the Royal Albert Hall last night\n\nIt comes amid a dramatic week for Meghan who has admitted she is struggling with life in the spotlight as a member of the royal family.\n\nOne Sunday, ITV aired an emotional interview with broadcaster Tom Bradby, where Meghan revealed her struggles to cope with the pressures of her new life since marrying Harry in May 2018.\n\nAnd, earlier today, a source close to Harry and Meghan told CNN that the couple are 'single-handedly' modernising the monarchy, before slamming the 'institution around the royal family' for being unable to harness the couple's full value.\n\nThey then hit out at the 'hysterical' media reaction to the comments made by Prince Harry in an ITV documentary on Sunday about his brother William.\n\nThe couple are said to have a full schedule of engagements until mid-November - before taking six weeks off from royal duties over Christmas.\n\nIt is understood their family time will include them flying to Los Angeles next month to spend the Thanksgiving holiday with Meghan's mother, Doria Ragland.", "description": "The society bible used an old photo of the Duchess taken during a photoshoot with the Canadian business website Bay Street Bull in 2015, to go with an interview about her lifestyle website The Tig.", "authors": ["Siofra Brennan For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/13/20083522-0-image-a-15_1571835306218.jpg", "published_at": "2019-10-23"}