{"pub": "yahoo", "url": "https://news.yahoo.com/liam-payne-says-continuing-one-direction-killed-232211706--abc-news-celebrities.html", "downloaded_at": "2019-10-16 23:47:22.522453+00:00", "title": "Liam Payne says continuing with One Direction 'would have killed me'", "language": "en", "text": "Liam Payne says continuing with One Direction 'would have killed me' originally appeared on goodmorningamerica.com\n\nLiam Payne is opening up about the negative impact of One Direction's success.\n\nOn an episode of the podcast \"Table Manners with Jessie Ware,\" Payne says since the band went on hiatus in 2015, he’s regained control of his life.\n\n\"It was really scary at first,\" he said of taking a break from 1D. \"But I needed to stop, definitely. It would have killed me. One hundred percent.\"\n\nHe added, \"There's no stop button. You've got no control over your life. That's why I lost complete control of everything ... We were definitely overworked. I had no personal life. I learned nothing about myself.\"\n\n(MORE: Liam Payne talks One Direction: 'I miss being with the boys')\n\nNow, with a successful solo career, his two-year-old son Bear, with ex Cheryl Cole, and a new girlfriend, Maya Henry, Payne, 26, says he’s “the happiest I’ve ever been.”\n\nAs for whether he and his 1D bandmates have stayed close, he admits they haven’t.\n\n“You have people you associate yourself with at work but you don’t see them outside of work and we won’t really have a job together anymore,” he said. “So with someone like Harry [Styles] for example, I just don’t really have much in common with the boy.”", "description": "Liam Payne is opening up about the negative impact of One Direction's success.  On an episode of the podcast \"Table Manners with Jessie Ware,\" Payne says since the band went on hiatus in 2015, he’s regained control of his life.  \"It was really scary at first,\" he said of taking", "authors": ["Gma Team"], "top_image": "https://s.yimg.com/uu/api/res/1.2/X5Dnw_A3PQ0C6Ml6A2JjXg--~B/aD01NTg7dz05OTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/gma/us.abcnews.gma.com/liam-payne-file-gty-jef-191016_hpMain_16x9_992.jpg", "published_at": "2019-10-16"}