{"pub": "independent", "url": "https://independent.co.uk/voices/julian-castro-democratic-debate-2020-campaign-joe-biden-elizabeth-warren-a9162161.html", "downloaded_at": "2019-10-19 11:27:14.152774+00:00", "title": "Let's talk about what we'd be talking about if Julian Castro was white", "language": "en", "text": "Though he did not have what many would categorize as a “breakout moment” during the most recent Democratic presidential primary debate, Julián Castro did offer another reminder of why his candidacy has been essential to the primary itself — even if most observers have failed to recognize it.\n\nWhen one of the moderators, CNN’s Anderson Cooper, asked Castro about handgun violence, he offered much-needed nuance to the debate with the invocation of the police and how their collective behavior influences his views on gun policy. Explaining why he doesn’t support mandatory buybacks, Castro said, “I’m not going to give these police officers another reason to go door-to-door in certain communities because police violence is also gun violence.” Castro then cited Atatiana Jefferson, a 28-year-old who was in her bedroom when she was shot and killed by Fort Worth police officer Aaron Dean. Jefferson’s neighbor, James Smith, dialed the Fort Worth Police Department’s non-emergency line after he noticed Jefferson’s lights were on and her front door was open.\n\nNo one else had said her name. No one else had invoked the role police play in gun violence — namely against black and brown people. And this incident took place mere weeks after Dallas police officer Amber Guyger was sentenced to 10 years in prison for murdering Botham Jean in his home a year ago. How many more minutes would have been wasted had Castro not brought that vital perspective onto that stage?\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nI felt similarly about the necessity of Castro earlier this month when he escorted a group of asylum-seekers across the border bridge to Texas from Mexico, where they were all sent under the Trump administration’s “Remain in Mexico” policy. That group consisted of eight gay and lesbian asylum-seekers from Cuba, Guatemala and Honduras, as well as a deaf Salvadoran woman and her three relatives. As the Los Angeles Times reported, “All had earlier tried to cross here with a lawyer after being returned to Mexico to await court hearings, and all had been sent back by US Customs officers. Some had already waited four months.”\n\nAnd then there was his call this summer to consider trans people in the debate about reproductive justice.\n\nSince April, many political observers have written about Castro’s need for that breakout “defining moment” in order to draw wider attention to his campaign — but perhaps the larger problem is the public don’t care enough about many of the types of people Castro has been advocating for throughout the decade. That includes people like Castro himself. Him being the sole Latinx candidate in the race should have garnered him more attention, but that has not proven to be the case.\n\n“This should be Julián Castro’s moment,” David Freedlander wrote for Politico in August. “At a time when issues of immigration and family separation, race and the border are front and center in the national consciousness, the story of a third-generation Mexican American would seem tailor-made to resonate emotionally with voters.”\n\nFreelander was right to highlight that Castro has struggled with Latinx voters, too, but in the earliest months of a primary campaign, much of a presidential contender’s chances lie on name recognition: either having it already or garnering the media attention necessary to build it.\n\n“Castro is an heir to Obama, having served as secretary of Housing and Urban Development from 2014 to 2017,” Freelander continued. “He is young, just 44 at a time when many in the party are looking for a new generation. He is a policy wonk, a former mayor who can speak as fluently about zoning, gentrification and housing affordability at a time when those issues have risen to the fore among the party’s young and urban base.”\n\nSomehow, Mayor Pete Buttigieg was hailed as “the smart candidate” early on, despite openly dismissing the need of policy details earlier in the race (yes, I laughed at him trying to attack Elizabeth Warren on being evasive on policy proposals, too.) It’s funny how that label wasn’t given to Castro, someone whose resume and proposed policies are far more impressive on paper.\n\nAnd while we’re on double standards, I’m equally tickled how Castro was condemned as being “classless” for the way he spoke to Joe Biden at the third debate, yet none of those same people had anything to say about Biden yelling at Elizabeth Warren at the fourth as he tried to take credit for her work. I wonder what could be the difference? Perhaps we can ask Cory Booker and Kamala Harris, who faced similar scolding about how they challenged Biden, too.\n\nShape Created with Sketch. The Democrat challengers to Trump in 2020 Show all 22 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The Democrat challengers to Trump in 2020 1/22 Bernie Sanders The Vermont senator has announced that he will be running again in 2020 after losing out to Hilary Clinton in the 2016 Democratic primaries. He intends to run on a similar platform of democratic socialist reform Getty 2/22 Joe Biden The former vice president - poised to be a frontrunner - has announced his run. He recently faced scrutiny for inappropriate touching of women, but was thought to deal with the criticism well EPA 3/22 Elizabeth Warren The Massachusetts Senator has formally launched her bid for president in 2020. A progressive Democrat, she is a major supporter of regulating Wall Street. Reuters 4/22 Bill De Blasio The New York mayor announced his bid on 16 May 2019. He emerged in 2013 as a leading voice in the left wing of his party but has struggled to build a national profile and has suffered a number of political setbacks in his time as mayor AFP/Getty 5/22 Pete Buttigieg The Indiana mayor and war veteran will be running for president. If elected, he would be the first openly LGBT+ president in American history Getty 6/22 Beto O'Rourke The former Texas congressman formally launched his bid for the presidency in March. He intends to run on a progressive platform, stating that the US is driven by \"gross differences in opportunity and outcome\" AP 7/22 Steve Bullock The Montana governor announced his bid on 14 May. He stated \"We need to defeat Donald Trump in 2020 and defeat the corrupt system that lets campaign money drown out the people's voice, so we can finally make good on the promise of a fair shot for everyone.\" He also highlighted the fact that he won the governor's seat in a red [Republican] state Reuters 8/22 Cory Booker The New Jersey Senator has announced that he will be running for the presidency in 2020. If he secures the nomination he said finding a female vice president would be a priority Getty 9/22 Wayne Messam Mayor of the city of Miramar in the Miami metropolitan area, Wayne Messam has announced his bid. He intends to run on a progressive platform against the \"broken\" federal government. He favours gun regulations and was a signatory to a letter from some 400 mayors condemning President Trump's withdrawal from the Paris Climate Accord Vice News 10/22 Kirsten Gillibrand The New York Senator formally announced her presidential bid in January, saying that “healthcare should be a right, not a privilege” Getty 11/22 Kamala Harris The former California attorney general will be running for president in 2020. Introduced to the national stage during Jeff Sessions’ testimony, she has endorsed Medicare-for-all and proposed a major tax-credit for the middle class AFP/Getty 12/22 John Delaney The Maryland congressman was the first to launch his bid for presidency, making the announcement in 2017 AP 13/22 Tulsi Gabbard The Hawaii congresswoman announced her candidacy in January, but is likely to face tough questions on her past comments on LGBT+ rights and her stance on Syrian President Bashar al-Assad Getty 14/22 Andrew Yang The entrepreneur has announced his presidential candidacy, and has pledged that he would introduce a universal basic income of $1,000 a month to every American over the age of 18 Getty 15/22 Julian Castro The former San Antonio mayor announced his candidacy in January and said that his running has a “special meaning” for the Latino community in the US Getty 16/22 Marianne Williamson The author and spiritual adviser has announced her intention to run for president. She had previously run for congress as an independent in 2014 but was unsuccessful Getty 17/22 Eric Swalwell One of the younger candidates, Swalwell has served on multiple committees in the House of Representatives. He intends to make gun control central to his campaign Getty 18/22 Seth Moulton A Massachusetts congressman, Moulton is a former US soldier who is best known for trying to stop Nancy Pelosi from becoming speaker of the house Getty 19/22 Amy Klobuchar Klobuchar is a Minnesota senator who earned praise for her contribution to the Brett Kavanaugh hearings Getty 20/22 Jay Inslee Inslee has been governor of Washington since 2013. His bid centres around climate change AFP/Getty 21/22 John Hickenlooper The former governor of Colorado is running on a sensible ticket. He aims to sell himself as an effective leader who is open to compromise and evidences this with his experience as governor Getty 22/22 Tim Ryan Ohio representative Tim Ryan will be running a campaign that hinges on his working class roots Getty 1/22 Bernie Sanders The Vermont senator has announced that he will be running again in 2020 after losing out to Hilary Clinton in the 2016 Democratic primaries. He intends to run on a similar platform of democratic socialist reform Getty 2/22 Joe Biden The former vice president - poised to be a frontrunner - has announced his run. He recently faced scrutiny for inappropriate touching of women, but was thought to deal with the criticism well EPA 3/22 Elizabeth Warren The Massachusetts Senator has formally launched her bid for president in 2020. A progressive Democrat, she is a major supporter of regulating Wall Street. Reuters 4/22 Bill De Blasio The New York mayor announced his bid on 16 May 2019. He emerged in 2013 as a leading voice in the left wing of his party but has struggled to build a national profile and has suffered a number of political setbacks in his time as mayor AFP/Getty 5/22 Pete Buttigieg The Indiana mayor and war veteran will be running for president. If elected, he would be the first openly LGBT+ president in American history Getty 6/22 Beto O'Rourke The former Texas congressman formally launched his bid for the presidency in March. He intends to run on a progressive platform, stating that the US is driven by \"gross differences in opportunity and outcome\" AP 7/22 Steve Bullock The Montana governor announced his bid on 14 May. He stated \"We need to defeat Donald Trump in 2020 and defeat the corrupt system that lets campaign money drown out the people's voice, so we can finally make good on the promise of a fair shot for everyone.\" He also highlighted the fact that he won the governor's seat in a red [Republican] state Reuters 8/22 Cory Booker The New Jersey Senator has announced that he will be running for the presidency in 2020. If he secures the nomination he said finding a female vice president would be a priority Getty 9/22 Wayne Messam Mayor of the city of Miramar in the Miami metropolitan area, Wayne Messam has announced his bid. He intends to run on a progressive platform against the \"broken\" federal government. He favours gun regulations and was a signatory to a letter from some 400 mayors condemning President Trump's withdrawal from the Paris Climate Accord Vice News 10/22 Kirsten Gillibrand The New York Senator formally announced her presidential bid in January, saying that “healthcare should be a right, not a privilege” Getty 11/22 Kamala Harris The former California attorney general will be running for president in 2020. Introduced to the national stage during Jeff Sessions’ testimony, she has endorsed Medicare-for-all and proposed a major tax-credit for the middle class AFP/Getty 12/22 John Delaney The Maryland congressman was the first to launch his bid for presidency, making the announcement in 2017 AP 13/22 Tulsi Gabbard The Hawaii congresswoman announced her candidacy in January, but is likely to face tough questions on her past comments on LGBT+ rights and her stance on Syrian President Bashar al-Assad Getty 14/22 Andrew Yang The entrepreneur has announced his presidential candidacy, and has pledged that he would introduce a universal basic income of $1,000 a month to every American over the age of 18 Getty 15/22 Julian Castro The former San Antonio mayor announced his candidacy in January and said that his running has a “special meaning” for the Latino community in the US Getty 16/22 Marianne Williamson The author and spiritual adviser has announced her intention to run for president. She had previously run for congress as an independent in 2014 but was unsuccessful Getty 17/22 Eric Swalwell One of the younger candidates, Swalwell has served on multiple committees in the House of Representatives. He intends to make gun control central to his campaign Getty 18/22 Seth Moulton A Massachusetts congressman, Moulton is a former US soldier who is best known for trying to stop Nancy Pelosi from becoming speaker of the house Getty 19/22 Amy Klobuchar Klobuchar is a Minnesota senator who earned praise for her contribution to the Brett Kavanaugh hearings Getty 20/22 Jay Inslee Inslee has been governor of Washington since 2013. His bid centres around climate change AFP/Getty 21/22 John Hickenlooper The former governor of Colorado is running on a sensible ticket. He aims to sell himself as an effective leader who is open to compromise and evidences this with his experience as governor Getty 22/22 Tim Ryan Ohio representative Tim Ryan will be running a campaign that hinges on his working class roots Getty\n\nInfuriatingly, even when Castro takes on a more popular position — say, impeaching Trump — he isn’t typically given credit for being the first candidate to bring it up.\n\nAs it stands now, Castro may not make the November date. If that is the case, it will be to our own collective loss. Castro has consistently used his position to highlight issues plaguing the most vulnerable of Americans. There is a thoughtfulness to his campaign that has consistently felt more in tune with where this country is going than many of his competitors’. In a crowded race stuffed with moderate bores with no chance of winning given their names on the ballot are Ambien to nonwhites and young people, he has been a worthy addition.\n\nIt is disappointing to say the least that Castro has not been treated like a viable option. I can’t think of anything he should have done differently. But I can say I believe that if Castro were a white candidate with the same credentials, saying the exact same things as he has been, this race would have gone differently for sure.", "description": "Though he did not have what many would categorize as a “breakout moment” during the most recent Democratic presidential primary debate, Julián Castro did offer another reminder of why his candidacy has been essential to the primary itself — even if most observers have failed to recognize it.", "authors": ["Michael Arceneaux"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2016/06/19/18/julian-castro-ap.jpg", "published_at": "2019-10-18"}