{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7593483/Steve-Bannon-says-Trump-impeached-six-weeks-Nancy-Pelosi-focused.html", "downloaded_at": "2019-10-20 17:12:11.315048+00:00", "title": "Steve Bannon says Trump 'can be impeached in six weeks because \"Nancy Pelosi is very focused'", "language": "en", "text": "President Donald Trump's former chief strategist and ex-Breitbart News chairman Steve Bannon (pictured) is warning the administration that impeachment is a certainty\n\nSteve Bannon says President Donald Trump will be impeached in six weeks.\n\nThe president's former chief strategist and ex-Breitbart News chairman issued a direct warning to the Trump administration Saturday, warning the White House wasn't taking the threat of impeachment seriously enough.\n\nBannon says House Speaker 'Nancy Pelosi is very focused,' about getting the process of impeachment started, and that even if Trump manages to avoid being removed from office, there are even greater threats waiting as the 2020 presidential election approaches.\n\nTrump and Vice President Mike Pence could find themselves facing off Mike Bloomberg and Hillary Clinton, the 65-year-old Bannon told the New York Post.\n\nThe current slate of Democratic candidates vying for the party's nomination in the upcoming presidential race doesn't have a chance against the Republican incumbent.\n\n'This is serious. As sure as the turning of the earth, he (President Donald Trump, pictured) is going to be impeached,' says Bannon, urging the administration to take the threat more seriously\n\nBannon says House Speaker 'Nancy Pelosi (pictured) is very focused,' about getting the process of impeachment started, and even if Trump manages to avoid being removed from office, there are even greater threats waiting as the 2020 presidential election approaches\n\n'Nobody on that stage can beat Trump at least as far as right now. The only person that could beat Trump that is currently in the field is Trump,' said Bannon, still bullish about his former boss's chances of winning re-election.\n\nBannon, however, urges caution.\n\nHe see former Democratic front-runner Joe Biden imploding and Elizabeth Warren, who currently leads, to suffer a backlash from centrists, that will end up killing both their campaigns by the end of the year.\n\n'Nobody on that stage can beat Trump at least as far as right now. The only person that could beat Trump that is currently in the field is Trump,' says Bannon of the current slate of Democratic candidates vying for the party's nomination in the 2020 presidential race\n\nBillionaire and former New York City Mayor Mike Bloomberg (left) and Hillary Clinton, the former first lady, US senator and secretary of state (right) are likely to step up because weaker Democrats cannot defeat Trump, says Bannon\n\nThat, Bannon, says, opens the door for Bloomberg, and Clinton. 'Bloomberg and Clinton, both will … get into the race,' he tells the Post.\n\nThe often controversial Bannon dropped out of the Trump administration only seven months after the president's win in 2016. However the the populist nationalist has continued delivering his message, speaking publicly and meeting with wealthy power brokers.\n\nThe often controversial Bannon dropped out of the Trump administration only seven months after the president's win in 2016. However the the populist nationalist has continued delivering his message, speaking publicly and meeting with wealthy power brokers\n\nNow watching the administration from the outside in, he says he fears nothing will stand in the way of impeachment, which he called a 'moral threat.'\n\n'This is serious. As sure as the turning of the earth', he tells the post.\n\nBannon says he's observed a lack of coordination in the administration's response to the threat.\n\n'I don't feel comfortable when I see the chief of staff, Mick Mulvaney,' Bannon said, in a reference to Mulvaney's confirmation on Thursday that Trump's decision to withhold military aid to Ukraine was part of a quid pro quo, and that such a strategy was not uncommon. He has since backed off the explosive remarks.\n\n'The problem we have is that the president needs a team around him and somebody has got to step up and make a play. Trump can't do everything,' Bannon said. 'There is just no coordination with the team.\n\n'The fake news and witch hunt stuff is not working.'\n\nBannon urged Trump to 'augment the legal team' and cited that what helped the administration during Robert Mueller probe into Russian interference in the 2016 election 'was bifurcation of the White House Counsel's office. You need … a team put together than can focus on [impeachment] 24/7'.\n\nBannon added to his sense of urgency by noting that he fully expects Senate leader Mitch McConnell (center), an adversary, will go through with what will likely be a long, drawn-out impeachment trial of the president\n\nHe added to his sense of urgency by noting that he fully expects Senate leader Mitch McConnell, an adversary, will go through with what will likely be a long, drawn-out impeachment trial of the president.\n\nBannon remained bullish overall about Trump's chances in 2020, dismissing the current crop of Democratic candidates.\n\nEven in the event if he's wrong, Bannon says Trump still must be prepared for a true competitive challenge in 2020, because it may come from Bloomberg and Clinton.\n\nBannon says he expects former vice president Joe Biden's campaign will implode by the end of the year. The Democratic presidential candidate is pictured above speaking to supporters in Davenport Iowa Wednesday\n\nMassachusetts Senator and Democratic presidential hopeful Elizabeth Warren will end up suffering a backlash from centrists, says Steve Bannon, which will hurt her chances running against Trump in the 2020 election\n\nIf Biden goes down, as he predicts, and Warren appears likely to land the nomination, Bannon says the electorate can expect, 'Bloomberg and Clinton, both will … get into the race'.\n\nAnd none of the other Democrats have a chance, he adds.\n\n'The Cory Bookers and Kamala Harrises haven't gotten enough traction to compete with Warren. The hedge fund investment banking corporatist community of the Democratic Party is not prepared to have them', he tells the Post.\n\nBannon 'The Cory Bookers and Kamala Harrises haven't gotten enough traction,' to compete with Elizabeth Warren whom he expects will also suffer a backlash from centrists in her bid for the party's nomination in the 2020 presidential race (Booker and Harris are pictured)\n\n'Bloomberg or Clinton could be very competitive,' he said. 'She is a very formidable candidate and I think Bloomberg would be very formidable.'\n\nTipping off what Democrats should do, Bannon said the party should focus on beating trump along his 'southern arc' in potential swing states like Arizona, Texas, Georgia and the Carolinas.\n\nThe Democratic nominee for president also has to 'live in Pennsylvania, Michigan, Wisconsin,' he said. Clinton lost those states, where Democrats have traditionally won majority support, after she failed to spend enough time focusing on them in 2016.", "description": "Steve Bannon, President Donald Trump's former chief strategist, wants his administration to take the threat of impeachment more seriously because he's certain the House will go through with it.", "authors": ["Ralph R. Ortega For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/14/19955726-0-image-a-18_1571578071696.jpg", "published_at": "2019-10-20"}