{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/arab-joint-list-recommends-benny-gantz-for-prime-minister-momentous-decision", "downloaded_at": "2019-10-23 15:10:39.307264+00:00", "title": "Arab Joint List Recommends Benny Gantz for Israeli Prime Minister: Understanding Momentous Decision", "language": "en", "text": "Benny Gantz, head of the Blue and White party, speaks following the announcement of exit polls in Israel’s parliamentary election in Tel Aviv, Israel, April 10, 2019. (Corinna Kern/Reuters)\n\nThe List’s support of Benny Gantz for PM reflects the improving fortunes of Israel’s Arabs and their desire to further integrate into Israeli society.\n\nAfter last month’s Israeli election, under the leadership of Ayman Odeh, the majority of the Arab Joint List recommended Benny Gantz to be the country’s next prime minister. They made this unprecedented decision even though he was the military leader of the last Gaza war. Indeed, this was the reason why the nationalist Balad party broke from Odeh and refused to back Gantz’s candidacy. This essay will detail the background that led the other Joint List parties to support him.\n\nAdvertisement\n\nAdvertisement\n\nAt the beginning of the 21st century, Arab Israelis had separate lives in underfunded towns with deplorable transportation and inferior schools. In response, the Arab community strongly embraced the 2006 Future Visions report that called for Israeli-Arab autonomy. It was a wake-up call to the Jewish elite.\n\nTo increase Arab female employment, the government funded training programs, improved educational support, subsidized employment, expanded transportation networks, and built industrial parks near Arab towns. As a result, the labor-force-participation rate of Arab women between 30 to 39 years old increased from 24 percent in 2005 to 34 percent in 2010. Targeted funding of Arab schools has also led to a 79 percent increase in Arab enrollment in bachelor’s degree programs since 2010. By 2017, Arab students make up 17 percent of all students in these programs.\n\nThere have also been successful efforts to increase Arab participation in the tech sector. By 2016, Arab enrollment at the Technion — considered Israel’s MIT — reached 22 percent, equally divided between men and women. To aid retention, counseling resources were added, and the university began publishing all significant college materials in Arabic for its Arab students. The initiatives were a success: Ha’aretz recently reported that, “In 2008, there were 350 Israeli Arab high-tech engineers, all of them men. Now there are 6,600, one fourth of them women.”\n\nAdvertisement\n\nWhen the Future Visions report was issued, Arabs composed only 5 percent of government employees. To increase that number, the government required at least 30 percent of new hires to be Arabs. Since then, Arab government employment has increased by 88 percent, and Arabs now are 10 percent of all government workers.\n\nAdvertisement\n\nIn 2007, a national-service option was created. It pays female Arab high-school graduates for up to two years to perform social services in their home communities. Palestinian nationalists fiercely attacked the program. “Anyone who volunteers for national service will be treated like a leper and will be vomited out of Arab society,” Jamal Zahalka, a lawmaker with Balad, told a rally in 2008. Balad’s intimidation efforts initially met with some success, but as more Arab-Israeli women reaped its benefits, the program became more popular. By 2017, there were 4,500 Arab women enrolled, up from 600 in 2010.\n\nDue to a lack of trust, only a few mayors actively supported the initial government efforts to improve Arab towns. Mayors aligned with Odeh’s Hadash party, such as former long-time Nazareth mayor Ramiz Jaraisy, were the most willing to work with government efforts, while those aligned with Balad were the least willing. But general Arab-Israeli skepticism of the efforts changed when the population realized the substantial benefits that had begun coming to them.\n\nAdvertisement\n\nThese continuous improvements led many Arab citizens to move away from the confrontational nationalist stance of Balad and embrace a more constructive engagement with the Israeli government. New York Times reporter Jodi Rudoren suggested that one reason for Arab voter apathy in the January 2013 election was “a growing frustration with Arab lawmakers’ focus on the Israeli-Palestinian conflict rather than local concerns like crime, poverty, and unemployment.”\n\nAdvertisement\n\nIn 2015, the Joint List entered the Knesset. With a mandate from the Arab public, it has continued to seek reform legislation. Its efforts have led the Knesset to change its discriminatory municipal funding formula. To further correct for past underfunding, Government Decision 922 dedicated additional resources to Arab communities. Transportation reforms required, for the first time, that all buses throughout the country must have Arabic signage.\n\nBeginning in 2014, government initiatives have substantially increased the number of Arab teachers in the Jewish school system. During the 2018–19 school year, 964 Arab teachers taught in Jewish schools, an increase of 107 percent from 2013–14. These teachers have humanized Arabs in the eyes of many Jewish children and their parents, and this trend will grow as a recent campaign to incorporate Arab-Israeli history into the Jewish school curriculum moves forward. As more Israeli Jews have come to know Israeli Arabs, opposition to their participation in a ruling coalition has declined substantially, from two-thirds to just below one-half.\n\nAdvertisement\n\nAll of these changes have raised Arab hopes for the future. By 2017, two-thirds of Arab Israelis polled had a “good” or “very good” outlook. In 2019, two-thirds of Arabs stated that they were proud to be Israelis, and three-quarters looked favorably on the prospect of the Joint List becoming part of a ruling coalition.\n\nThough these improvements are meaningful, Israeli society is a long way from providing equal opportunity to all its citizens. Despite past efforts, more can be done to recruit Arabs to the police force, enabling it to better combat the growing violence in Arab towns. Despite improved overall numbers, too many other government ministries still have virtually no Arab employees. While overall Arab high-tech employment is robust, discriminatory hiring practices still prevail in many Israeli firms. But the decision of most of the Joint List to back Gantz — even if its members have no intention of sitting in a government with him and wish above all to throw Prime Minister Benjamin Netanyahu from power — reflects the improving situation of Arab citizens of Israel and their desire to further integrate themselves into Israeli society.", "description": "The Arab Joint List’s support of Benny Gantz for prime minister reflects the improving fortunes of Israel’s Arabs and their desire to further integrate into Israeli society.", "authors": ["Robert Cherry", "Tobias Hoonhout", "Robert Verbruggen", "Andrew C. Mccarthy", "Rich Lowry", "George Will", "Scot Bertram", "Michael Brendan Dougherty", "Wesley J. Smith", "Read More"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/benny-gantz.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-23"}