{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/9/ac-milan-hires-stefano-pioli-as-coach-replaces-gia", "downloaded_at": "2019-10-09 12:03:42.185928+00:00", "title": "AC Milan hires Stefano Pioli as coach, replaces Giampaolo", "language": "en", "text": "MILAN (AP) - AC Milan hired Stefano Pioli as coach on Wednesday to replace the fired Marco Giampaolo.\n\nPioli, who has previously coached city rival Inter Milan, agreed to a two-year contract. Milan announced the news in a brief statement .\n\nPioli, who is an Inter fan, coached the Nerazzurri during the 2016-17 season but was fired after losing 10 of 27 matches. He then went on to coach Fiorentina but left the club in April after a slew of poor results.\n\nThe 53-year-old Pioli has never won a trophy in his managerial career, although he did lead Lazio into the Champions League playoffs.\n\nPioli becomes Milan’s ninth coach since Massimiliano Allegri was fired in January 2014. During that time, Milan has also had three different owners and a multitude of directors in a period of instability.\n\nMilan has also failed to qualify for the Champions League during that period.\n\nGiampaolo was hired by Milan in June as a replacement for Gennaro Gattuso, who stepped down as coach after a fifth-place finish left the team out of the Champions League. However, Milan has lost four of his seven matches in charge.\n\nHis dismissal on Tuesday meant his tenure in charge was the shortest of any coach in the club’s history.\n\n___\n\nMore AP soccer: https://apnews.com/apf-Soccer and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "AC Milan hired Stefano Pioli as coach on Wednesday to replace the fired Marco Giampaolo.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/09/italy_soccer_ac_milan_coach_86626_c0-83-2000-1249_s1770x1032.jpg?dc2de1c8909ff8deb251977349395aa0414518db", "published_at": "2019-10-09"}