{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7546703/Three-week-old-baby-boy-dies-five-days-knife-attack-Newcastle-flat.html", "downloaded_at": "2019-10-07 20:46:21.611649+00:00", "title": "Three-week-old baby boy dies five days after knife attack in Newcastle flat", "language": "en", "text": "A three-week-old baby boy has died after he was stabbed during a knife attack in Newcastle.\n\nThe child was stabbed at an address in Wallsend, Newcastle, last week and Northumbria Police have now said the youngster has died in hospital.\n\nA man aged in his 20s, who is known to the victims, was arrested at the address on suspicion of attempted murder on October 2.\n\nAfter the attack the mother, 21, was also admitted to hospital with life-threatening injuries.\n\nPolice were called to the property in Wallsend, near Newcastle, at around 2.15pm on October 2 to reports of a serious assault. Pictured: Police at the scene\n\nShe is still in hospital, but is now in a stable condition, Northumbria Police confirmed to MailOnline.\n\nThe baby, who has not yet been named for legal reasons, required round the clock care and died yesterday.\n\nDenis Erdinch Beytula, 27, who police say is known to the victims, was arrested at the address and charged with two counts of attempted murder.\n\nIt is now thought that his charges will be updated to reflect the death of the child and that this will happen when he appears at crown court on October 31.\n\nDenis Erdinch Beytula, 27, (pictured) who police say is know to the victims, was charged last week with two counts of attempted murder\n\nForensic teams were pictured outside the property on October 2 after the alleged attack took place\n\nPolice say specialist Family Liaison Officers continue to offer the baby's family support.\n\nDetective Chief Inspector Dave Cole, of Northumbria Police, said: 'This is a devastating time for the baby's family. Specialist officers continue to offer them support and I know the community in Wallsend are by their side too.\n\n'It is impossible to imagine what they are going through and I would ask the public to continue to respect the family's privacy at this time.\n\n'A man has been charged in relation to the incident and we will continue to work closely with the Crown Prosecution Service (CPS) as the case moves forward.'\n\nBeytula, also of Portland Place, was last week charged with two counts of attempted murder.\n\nHe appeared in North Tyneside Magistrates' Court last Thursday where he was remanded in custody and will appear at Newcastle Crown Court at a future date.\n\nAfter the alleged attack a security cordon was put in place and officers investigated what they say is an isolated incident.\n\nAnyone with information about the incident which could assist police is asked to call officers on 101 quoting log 539 02/10/19.", "description": "A three-week-old baby boy who was stabbed at an address in Wallsend, Newcastle, last week has died in hospital, Northumbria Police said.", "authors": ["Terri-Ann Williams For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/15/19399508-0-image-a-5_1570457996784.jpg", "published_at": "2019-10-07"}