{"pub": "breitbart", "url": "https://breitbart.com/local/2019/10/17/police-7-year-old-caught-vaping-cbd-oil-wisconsin-school", "downloaded_at": "2019-10-18 03:25:24.448529+00:00", "title": "Police: 7-Year-Old Caught Vaping CBD Oil at Wisconsin School", "language": "en", "text": "A seven-year-old boy was caught vaping CBD oil in the middle of class this month at his Wisconsin elementary school, police said.\n\nNicole Hearold, who has a kid at Country Dale Elementary School in Franklin, said she was shocked to hear something like that happen at her child’s school.\n\n“That’s terrible. I mean, I can’t even imagine,” Hearold told WISN. “Obviously, the child has seen an adult or someone else doing that to even know what to do.”\n\nThe boy said he got the vaping device from his mother’s purse. Investigators say he was using a “SMOK Novo” device,” which looks like a USB flash drive, WKOW reported.\n\nThe boy’s mother confirmed with authorities that the device contained CBD oil.\n\nA social worker with Child Protective Services picked up the boy from school and took him to a local hospital for examination. Doctors said he was okay. Authorities then returned the child to his mother.\n\nPolice said they would not be filing charges in this incident. School officials said they threw the vaping device in the trash.\n\n“The safety and integrity of students and families is paramount,” District Administrator Dr. Judy Mueller said in a statement.\n\n“As a school community, we have concern about the national vaping epidemic, especially when we see the impact on our Franklin students and families. We are continuously working to stay on top of the latest findings and expert recommendations,” she added.\n\nVaping has become a nationwide public health issue, as many children have become addicted to the e-cigarettes which the CDC has stated can cause “severe lung problems.”\n\nTo combat the issue, President Donald Trump has talked about banning flavored e-cigarettes and California has enacted legislation banning smoking and vaping at its state parks and beaches.", "description": "A seven-year-old boy was caught vaping CBD oil in the middle of class this month at his Wisconsin elementary school, police said.", "authors": ["Katherine Rodriguez"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-687441698-640x335.png", "published_at": "2019-10-17"}