{"pub": "fox", "url": "https://foxnews.com/media/tom-del-beccaro-warns-california-blackouts-fire-spread-cautionary-tale", "downloaded_at": "2019-10-27 00:16:15.545147+00:00", "title": "California's blackouts are a cautionary tale, warns former CA Republican Party Chairman", "language": "en", "text": "California power company PG&E is coming for residents' tax money and you could be next, former Chairman of the California Republican Party Tom Del Beccaro warned Saturday.\n\nAppearing on \"Fox & Friends: Weekend\" with host Ed Henry, Del Beccaro said that the power blackouts in northern California are costing the state and its residents.\n\nIn a new Fox News op-ed, he wrote that PG&E's \"drastic measures\" have resulted in \"billions lost -- just in October alone.\"\n\nArguing that \"Democrats seeking their party’s 2020 presidential nomination have already embraced some of the same Big Government and radical environmental policies that have brought blackouts to California – and could bring power outages and shortages to our entire nation should one of them become the next president.\"\n\nPG&E WORKER TARGETED IN 'DELIBERATE ATTACK' IN CALIFORNIA\n\nPG&E is now admitting it may have sparked one of the state's largest wildfires after a new video revealed the moment the Kincade fire broke out in wine country near a high voltage power line.\n\nNow, the company is announcing some 2.5 million people could lose power for over 48 hours starting this weekend. But, they're not giving a timeframe to residents.\n\n\"The last shutdown cost over $2 billion to the economy of the Bay Area. Now, this is a fight between PG&E and the legislature,\" he explained.\n\nCALIFORNIA UTILITY PG&E COULD CUT POWER TO 850,000 HOUSEHOLDS OVER 'HISTORIC WIND EVENT'\n\n\"PG&E is held liable, even if they're not fully responsible for these fires. Supposedly they have $30-40 billion in new liabilities for house burning and the like,\" said Del Beccaro.\n\nHowever, Del Beccaro says that the \"real issue here is that PG&E is a government-controlled monopoly\" that haven't done maintenance for years.\n\n\"Well, at least in part, PG&E's never going to be able to recruit this money. So, the national aspect of this starts with -- they're going to need a federal bailout,\" he told Henry. \"They're coming for your tax money.\"\n\nHe urged voters to remember that California is the \"crown jewel of Elizabeth Warren, Bernie Sanders, Kamala Harris.\"\n\n\"They think California's a great social justice state,\" he said.\n\nCLICK HERE TO CHECK OUT THE FOX NEWS APP\n\n\"In California...they're forcing PG&E to do social justice work instead of their core mission. Don't let your state turn your power companies into green plants where they have to buy expensive energy at the expense of maintenance,\" he told Fox News viewers.\n\n\"That's a coming thing for America and it will cause defaults like you have with PG&E,\" Del Beccaro predicted.", "description": "California power company PG&E is coming for residents' tax money and you could be next, former Chairman of the California Republican Party Tom Del Beccaro warned Saturday.", "authors": ["Julia Musto", "Julia Musto Is A Reporter For Foxnews.Com"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Tom-Del-Beccaro-Fire-FOX-AP.jpg", "published_at": "2019-10-26"}