{"pub": "breitbart", "url": "https://breitbart.com/news/chinas-trade-with-us-shrinks-again-in-september", "downloaded_at": "2019-10-14 06:37:34.208845+00:00", "title": "China’s trade with US shrinks again in September", "language": "en", "text": "BEIJING (AP) — China’s trade with the United States fell by double digits again in September amid a tariff war that threatens to tip the global economy into recession.\n\nExports to the United States, China’s biggest foreign market, fell 17.8% to $36.5 billion, a deterioration from August’s 16% decline, customs data showed Monday. Imports of American goods sank 20.6% from the year before to $10.6 billion, a slight improvement over August’s 22% decline.\n\nPresident Donald Trump agreed Friday to put off an additional tariff hike planned for this week on Chinese imports. In exchange, he said Beijing agreed to buy up to $50 billion of American farm goods. But they reported no agreements on disputes over China’s trade surplus and technology policies that brought on the 15-month-old fight.\n\n“The external environment facing China’s foreign trade development is still complicated and severe. Instability and uncertainty are increasing,” a customs agency spokesman, Li Kuiwen, said at a news conference.\n\nTit-for-tat tariff hikes on billions of dollars of each other’s goods have battered manufacturers and farmers on both sides and disrupted supply chains worldwide. Uncertainty has prompted some companies to postpone investments, adding to downward pressure on global growth and fueling financial market jitters.\n\nChina’s global exports fell 1.4% from a year earlier to $218.1 billion. Imports fell 5.8% to $178.5 billion.\n\nThe slump adds to pressure on President Xi Jinping’s government to shore up cooling economic growth and prevent politically risky job losses.\n\nChinese growth fell to its lowest level in at least 26 years in the quarter ending in June, decelerating to 6.2% over a year earlier.\n\nForecasters expect growth in the July-September quarter, due to be reported this week, to fall further to as low as 5.9%, sinking below the ruling Communist Party’s official target for the year of at least 6%.\n\n“While import growth should start to recover soon, it will take longer before export growth bottoms out,” said Martin Lynge Rasmussen of Capital Economics in a report. “The mini U.S.-China trade deal reached on Friday doesn’t alter the outlook significantly.”\n\nThe country’s politically sensitive trade surplus with the United States contracted by 16.5% from a year earlier but stood at $25.9 billion.\n\nIncreased exports to Britain and other European countries and developing markets such as Vietnam helped to offset some of the losses. China’s global trade surplus expanded by 42.2% to $39.7 billion.\n\nFor the first nine months of the year, Chinese imports of American goods were off 26.4% at $90.6 billion. Exports to the United States were off 10.7% at $312 billion.\n\nTrump put off a tariff hike planned for Tuesday on $250 billion of Chinese goods. But Washington still is planning a Dec. 15 tariff hike on $160 billion of smartphones and other imports.\n\nBefore then, Trump and Chinese President Xi Jinping are due to attend an economic conference in Chile in mid-November. That is raising hopes a face-to-face meeting might produce progress.\n\nTalks broke down in May over Beijing’s insistence that Trump’s punitive tariffs had to be lifted once a deal took effect. Washington says some must remain in place to ensure Chinese compliance. Trump and Xi agreed in June to resume negotiations but they have announced no breakthroughs.", "description": "BEIJING (AP) — China's trade with the United States fell by double digits again in September amid a tariff war that threatens to tip the global economy", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/13/92befc_china-trade-95154-women-shop-shanghai-disney-flagship-store-hongqiao-railway-640x335.jpg", "published_at": "2019-10-13"}