{"pub": "reuters", "url": "https://ca.reuters.com/article/businessNews/idCAKBN1X31V7-OCABS", "downloaded_at": "2019-10-24 15:03:37.817502+00:00", "title": "Canadian dollar steadies near three-month high as rate decisions loom", "language": "en", "text": "FILE PHOTO: A Canadian dollar coin, commonly known as the \"Loonie\", is pictured in this illustration picture taken in Toronto January 23, 2015. REUTERS/Mark Blinch\n\nTORONTO (Reuters) - The Canadian dollar was unchanged against its U.S. counterpart on Thursday, pulling back from an earlier three-month high as investors turned their attention to interest rate decisions next week by the Bank of Canada and the U.S. Federal Reserve.\n\nAt 9:37 a.m. (1337 GMT), the Canadian dollar CAD=D4 was unchanged at 1.3070 to the greenback, or 76.51 U.S. cents. The currency touched its strongest intraday level since July 22 at 1.3053.\n\nInvestors expect Canada’s central bank will leave its benchmark interest rate on hold at 1.75% on Oct. 30 and over the coming months, as the domestic economy shows resilience and the election of a minority federal government adds to prospects of growth-boosting fiscal spending next year.\n\nIn contrast, the Fed is expected to cut interest rates next week for the third time this year. That could lower the range for the Fed’s benchmark rate below the equivalent rate for the Bank of Canada of 1.75%.\n\nU.S. Trade Representative Robert Lighthizer met this week with Democratic lawmakers to try to resolve their concerns about the United States-Mexico-Canada (USMCA) trade agreement as Republicans increased pressure to get the deal passed by the end of 2019.\n\nCanada sends about 75% of its exports to the United States, including oil.\n\nU.S. crude oil futures CLc1 were up 0.1% at $56.02 a barrel, supported by a surprise drop in U.S. crude inventories and the prospect of further action by OPEC and its allies to support the market.\n\nCanadian government bond prices were mixed across the yield curve, with the two-year CA2YT=RR down 1 Canadian cent to yield 1.629% and the 10-year CA10YT=RR rising 2 Canadian cents to yield 1.516%.", "description": "The Canadian dollar was unchanged against its U.S. counterpart on Thursday, pulling back from an earlier three-month high as investors turned their attention to interest rate decisions next week by the Bank of Canada and the U.S. Federal Reserve.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191024&t=2&i=1444518938&w=1200&r=LYNXMPEF9N19U-OCABS", "published_at": "2019-10-24"}