{"pub": "metro", "url": "https://metro.co.uk/2019/10/15/bill-turnbull-calls-cannabis-law-changes-taking-drug-new-documentary-cancer-battle-10921054", "downloaded_at": "2019-10-15 09:42:53.515654+00:00", "title": "Bill Turnbull calls for cannabis law changes after new cancer documentary", "language": "en", "text": "Bill Turnbull takes cannabis in his new documentary (Picture: Channel 4)\n\nBill Turnbull believes there should be changes to the law surrounding medicinal cannabis after taking the drug for a new documentary about his cancer battle.\n\nThe 63-year-old broadcaster revealed his prostate cancer diagnosis in March 2018, with his battle against the disease the subject of new Channel 4 documentary Bill Turnbull: Staying Alive.\n\nIn the documentary, Turnbull tries numerous products derived from cannabis with comical results – including a moment which leaves him struggling to deliver a line to camera.\n\n‘I cannot compose a sentence,’ Turnbull says after smoking cannabis on camera. ‘I just can’t do it.’\n\nBill Turnbull is left all giggly after taking cannabis (Picture: Channel 4)\n\nTurnbull has called for changes to the law (Picture: Channel 4)\n\nCannabis has been illegal in the UK since 1928, with Turnbull acknowledging how he’s breaking the law by taking it, but under the circumstances, explains he’s willing to ‘break the rules, just this once’.\n\nAdvertisement\n\nAdvertisement\n\nSpeaking at a Q&A session, Turnbull called for changes to the law when it comes to medicinal cannabis.\n\n‘I do think we need to have a proper conversation in this country about the use of cannabis for medicinal purposes,’ Turnbull said.\n\n‘Because it’s legal to a greater or lesser extent for medicinal purposes in I think more than 20 countries now. In quite intelligent, advanced countries, and I think we should be one of them.\n\nBill Turnbull revealed his diagnosis in 2018 (Picture: Channel 4)\n\n‘We have something that has been used for thousands of years for medicinal purposes, which has only been illegal for 100 years. And we need to start having conversations about how we can usefully get the best out of what could be very beneficial to us, without causing damage to other people.\n\n‘I’m not talking about recreational use, I’m simply talking about it for medicinal reasons.’\n\nThe documentary also shows the effect the diagnosis has had on his family – wife of 31 years Sarah McCombie, and their three children.\n\nTurbull made his diagnosis public during a celebrity version of The Great British Bake Off for Stand Up To Cancer, detailing the moment where he was diagnosed by doctors.\n\n‘It’s like a dark cloud comes down, it’s a difficult moment,’ Turnbull said.\n\nAdvertisement\n\nAdvertisement\n\n‘Those first few days were probably the worst days of my life. Horrible moment. That first moment is a real shell shock.’\n\nBill Turnbull: Staying Alive airs Thursday 24 October on Channel 4 at 10pm.\n\nMORE: Bill Turnbull to try cannabis amid prostate cancer battle for new documentary\n\nMORE: Bill Turnbull will host radio show to keep dogs calm during fireworks and it sounds adorable", "description": "Bill Turnbull reveals the struggles of his cancer battle in a new documentary.", "authors": ["Adam Starkey"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_89902835_1571131914.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-15"}