{"pub": "hotair", "url": "https://hotair.com/archives/john-s-2/2019/10/03/immigration-court-backlog-exceeds-1-million-cases", "downloaded_at": "2019-10-04 00:07:12.231785+00:00", "published_at": "2019-10-03", "title": "Immigration court backlog exceeds 1 million cases", "language": "en", "text": "The surge of migrants claiming asylum at the border has resulted in a massive backlog of cases for the nation’s immigration courts. Syracuse University, which tracks active cases, announced two weeks ago that the number had surpassed one million. And that total does not include over 300,000 pending cases which have not been added yet:\n\n“The latest case-by-case court records through the end of August 2019 show the court’s active case backlog was 1,007,155,” according to the clearinghouse’s report released Wednesday. “If the additional 322,535 cases which the court says are pending but have not been placed on the active caseload rolls are added, then the backlog now tops 1.3 million.” While a Justice Department spokesman said in a statement to CNN that the department “does not certify data from third parties,” the spokesman added: “This report and DOJ’s own data further confirms there is a crisis at the border. This Administration is taking aggressive steps to increase productivity, close loopholes, and hire a record number of judges to address the backlog with our existing authorities.”\n\nAs a result of the huge backlog, wait times now hover around 700 days. This chart produced by Syracuse University shows the wait times have gone up substantially from a decade ago:\n\nIn an effort to decrease the number of people making asylum claims, President Trump has instituted the Migrant Protection Protocols, better known as the remain in Mexico policy. As a result, migrants claiming asylum are returned to Mexico to await their court date:\n\nThis policy forces migrants to wait in Mexico for their U.S. immigration court hearings. This policy had been used in San Diego and El Paso, but never before in South Texas where the vast numbers of migrants are apprehended… Based on Border Report interviews with immigration advocates and MPP migrants who were apprehended throughout the four-county South Texas region, it appears that following their apprehension and processing they are being driven by officials with U.S. Customs and Border Protection and/or U.S. Immigration and Customs Enforcement to Brownsville, where they are dropped off at the Gateway International Bridge and told to wait in Matamoros, Mexico. ICE Acting Director Matt Albence said his agency has released “close to 450,000 family units this year,” and he said this new MPP policy “reduces the incentive” for these migrants to come and seek asylum when they do not meet the criteria. “So there is an impact as far as restoring integrity to our system,” Albence said at a news conference following a media tour of the South Texas Residential Family Detention Facility on Aug. 23 in Dilley, Texas.\n\nAccording to Syracuse University, only about 10 percent of the backlog of cases added in FY19 involved migrants who are part of the remain in Mexico policy. However that number has been ramping up substantially each month. Migrants now have their court hearings in a tent judiciary structure erected in Brownsville. Immigration judges run the hearings via videoconference.\n\nThe most important number at this point is the decline in the number of people crossing the border each month, which has dropped sharply since May: “Through the month of August, the total number of people apprehended or found to be inadmissible was 64,006; this is a 22% decline from 82,055 in July and a 56% decline since the May peak of 144,255.” The number of apprehensions in September will be released sometime in the next week. In the past two months, those numbers have leaked to the media a few days before the official release. So we’ll probably only have to wait a few more days to see if the numbers continue to decline. Even if they do, the numbers for FY19 will still be higher than the previous two years and the backlog of cases could still take nearly two years to clear out.", "description": "\"This report and DOJ's own data further confirms there is a crisis at the border.\"", "authors": ["John Sexton", "Ed Morrissey", "Jazz Shaw", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/asylum-seekers.jpg"}