{"pub": "axios", "url": "https://espn.com/nba/story/_/id/27867216/nba-commissioner-adam-silver-says-financial-losses-china-substantial", "downloaded_at": "2019-10-18 01:09:42.775971+00:00", "title": "NBA commissioner Adam Silver says financial losses in China 'substantial'", "language": "en", "text": "NBA commissioner Adam Silver said Thursday that the league is already dealing with \"fairly dramatic\" financial consequences from Houston Rockets GM Daryl Morey's support of Hong Kong's anti-government protesters.\n\n\"The losses have already been substantial,\" Silver said at the Time 100 Summit, in his first public comments about the NBA's relationship with China since he returned to the U.S. from China earlier this week. \"Our games are not back on the air in China as we speak, and we'll see what happens next.\n\n\"I don't know where we go from here. The financial consequences have been and may continue to be fairly dramatic.\"\n\nSilver also addressed criticism of the league for its initial response to Morey's tweet, a statement that used the word \"regrettable.\" That drew strong responses from some lawmakers, who saw it as the league acquiescing to the demands of the Chinese government rather than backing Morey's right of free speech. Silver said the word \"regrettable\" referred to the reaction of the Chinese government and its people, not the tweet itself.\n\n\"Maybe I was trying too hard to be a diplomat,\" Silver said. \"I didn't see it as my role as the commissioner of the NBA to weigh in on the substance of the protest.\"\n\nThe league's follow-up comments stressed that the league supported Morey's right to speak on an issue.\n\n\"We made clear that we were being asked to fire him, by the Chinese government, by the parties we dealt with, government and business,\" Silver said. \"We said there's no chance that's happening. There's no chance we'll even discipline him.\"\n\nAfter Morey's original tweet on Oct. 4, China's state television, CCTV, canceled plans to broadcast two exhibition games played in China, and several companies and state-run offices severed ties with the NBA. Silver said the NBA is coping with that financial fallout.\n\n\"These American values -- we are an American business -- travel with us wherever we go,\" Silver said. \"And one of those values is free expression. We wanted to make sure that everyone understood we were supporting free expression.\"", "description": "NBA commissioner Adam Silver said that the league is already dealing with \"fairly dramatic\" financial consequences from Rockets GM Daryl Morey's support of Hong Kong's anti-government protesters.", "authors": ["Andrew Lopez", "Tim Bontemps", "Jonathan Givony", "Adrian Wojnarowski", "Dave Mcmenamin", "Espn.Com Staff"], "top_image": "https://a3.espncdn.com/combiner/i?img=%2Fphoto%2F2019%2F0920%2Fr601056_1296x729_16%2D9.jpg", "published_at": "2019-10-18"}