{"pub": "nytimes", "url": "https://nytimes.com/2019/10/23/opinion/GQ-men-masculinity.html", "downloaded_at": "2019-10-23 10:52:50.669437+00:00", "title": "Opinion | Not Your Father’s Masculinity", "language": "en", "text": "John Wayne, that repository of testosterone — now considered an illicit substance in many states — once played a character who said, “You have to be a man first, before you’re a gentleman.” Who knows what, exactly, he meant by it? It sounded like a fine thing to say, back when men were unabashed “men.” Now, we have #MeToo, and toxic males, and even such a once man-friendly rag as Gentlemen’s Quarterly (i.e., GQ), which has historically celebrated men, seems to be just sick about them, eager to atone for their Y chromosome.\n\nAs a subscriber for decades — and as a biological male — I eagerly delved into GQ’s “New Masculinity” issue. I’ve historically read the magazine that “meets millions of modern men where they live” for high-grade long-form journalism, or to settle existential quandaries such as, “What the hell is face serum and do I need to use it?” Still, one generally doesn’t turn to men’s magazine editors with soft hands who fret about conquering “your complex pant-shoe relationship” for instruction on the meaning of manhood. Not to pick on GQ, which, after all, helps us perform vital functions, such as how to “salute the celebrity mustache.”\n\nBut after years of #MeToo scandals, which have revealed weirdos and perverts and sex criminals (and that’s just R. Kelly), “toxic masculinity” is now regarded as tautology in some quarters. In more than a few tellings today, just to be a man is to be toxic.\n\nSo GQ’s newish editor in chief, Will Welch, is taking a crack at overhauling our benighted gender, presenting an issue in which, as he puts it, “traditional notions of masculinity are being challenged” and “overturned.” In doing so, he holds, we can be more generous, empathetic humans, even to ourselves, since “toxicity simply cannot thrive in the golden presence of genuine self-love.” Tell that to Harvey Weinstein, who allegedly “self-loved” into a potted plant in front of one of his trapped victims.", "description": "Meet the “new man”: whatever others say he is.", "authors": ["Matt Labash"], "top_image": "https://static01.nyt.com/images/2019/10/23/opinion/23labash2/23labash2-facebookJumbo.jpg", "published_at": "2019-10-23"}