{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/shoppers-queue-5am-rain-expecting-20654727", "downloaded_at": "2019-10-19 16:21:28.210753+00:00", "title": "Shoppers queue from 5am in rain expecting 'closing down sale' but are left raging", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nHundreds of shoppers who camped out in downpours from 5am in anticipation a department store was to hold a \"closing down sale\" were left fuming.\n\nThe eager shoppers hoped to grab final bargains from Watt Brothers, an iconic department store in Glasgow city centre.\n\nBut when they found out prices weren't slashed, some told customers Daily Record they felt \"conned\".\n\n\"It was all over the news last night that there was going to be a closing down sale,\" one punter said.\n\n\"Myself and lots of other people started queuing here about 5am. It was pouring down but we knew we'd need to be here early to get good deals.\"\n\n\"I couldn't believe it when it finally opened at 10am and people started coming out saying there was no sale on. Everything was the same price as it was before they said they were shutting down.\n\nWere you in the Watt Brothers queue? Get in touch webnews@mirror.co.uk\n\n(Image: dailyrecord.co.uk/)\n\n\"I'm furious. I feel like they've conned us.\"\n\nWatt Brothers announced on Friday it had gone into administration with hundreds of people being made redundant.\n\nOf the 306 employees 229 have been made redundant with immediate effect by administrators KPMG.\n\n(Image: dailyrecord.co.uk/)\n\nBlair Nimmo and Alistair McAlinden, of KPMG UK LLP , have been appointed as joint administrators.\n\nBlair Nimmo, joint administrator and UK head of restructuring at KPMG, said: \"Despite the director's tireless efforts to increase margins, cut costs and recapitalise the business, Watt Brothers continued to incur trading losses as a result of the well-publicised challenges being experienced across the retail sector.\n\n\"Ultimately this has led to the unfortunate demise of a well-known and highly-regarded business.\n\n\"We will be holding a stock clearance event, and are grateful to the remaining staff for their efforts and assistance at this difficult time.\"", "description": "Hundreds braved downpours in Glasgow anticipating Watt Brothers to slash prices but found there was no sale", "authors": ["Lynn Love", "Image", "Dailyrecord.Co.Uk"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20654815.ece/ALTERNATES/s1200/0_THP_CHP_191019Slug_10966JPG.jpg", "published_at": "2019-10-19"}