{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/gabrielle-union-reveals-butt-workout-183900316.html", "downloaded_at": "2019-10-07 20:24:43.334737+00:00", "title": "Gabrielle Union Reveals the Butt Workout She Does for Insanely Toned Glutes at 46", "language": "en", "text": "Rob: As Rudy Giuliani was pushing Ukrainian officials last spring to investigate one of Donald Trump's main political rivals, a group of individuals with ties to the president and his personal lawyer were also active in the former Soviet republic. Their aims were profit, not politics. This circle of businessmen and Republican donors touted connections to Giuliani and Trump while trying to install new management at the top of Ukraine's massive state gas company. Their plan was to then steer lucrative contracts to companies controlled by Trump allies, according to two people with knowledge of their plans. Their plan hit a snag after Ukrainian President Petro Poroshenko lost his reelection bid to Volodymyr Zelenskiy, whose conversation with Trump about former Vice President Joe Biden is now at the center of the House impeachment inquiry of Trump. But the effort to install a friendlier management team at the helm of the gas company, Naftogaz, would soon be taken up with Ukraine's new president by U.S. Energy Secretary Rick Perry, whose slate of candidates included a fellow Texan who is one of Perry's past political donors. It's unclear if Perry's attempts to replace board members at Naftogaz were coordinated with the Giuliani allies pushing for a similar outcome, and no one has alleged that there is criminal activity in any of these efforts. And it's unclear what role, if any, Giuliani had in helping his clients push to get gas sales agreements with the state-owned company. But the affair shows how those with ties to Trump and his administration were pursuing business deals in Ukraine that went far beyond advancing the president's personal political interests. It also raises questions about whether Trump allies were mixing business and politics just as Republicans were calling for a probe of Biden and his son Hunter, who served five years on the board of another Ukrainian energy company, Burisma. n Friday, according to the news site Axios, Trump told a group of Republican lawmakers that it had been Perry who had prompted the phone call in which Trump asked Zelenskiy for a \"favor\" regarding Biden. Axios cited a source saying Trump said Perry had asked Trump to make the call to discuss \"something about an LNG (liquefied natural gas) plant.\" While it's unclear whether Trump's remark Friday referred specifically to the behind-the-scenes maneuvers this spring involving the multibillion-dollar state gas company, The Associated Press has interviewed four people with direct knowledge of the attempts to influence Naftogaz, and their accounts show Perry playing a key role in the effort. Three of the four spoke on condition of anonymity for fear of retaliation. The fourth is an American businessman with close ties to the Ukrainian energy sector. A spokeswoman for the U.S. Energy Department said Perry, a former Texas governor and Republican presidential candidate, was not advancing anyone's personal interests. She said his conversations with Ukrainian officials about Naftogaz were part of his efforts to reform the country's energy sector and create an environment where Western companies can do business. The Trump and Giuliani allies driving the attempt to change the senior management at Naftogazt, however, appear to have had inside knowledge of the U.S. government's plans in Ukraine. For example, they told people that Trump would replace the U.S. ambassador there months before she was actually recalled to Washington, according to three of the individuals interviewed by the AP. One of the individuals said he was so concerned by the whole affair that he reported it to a U.S. Embassy official in Ukraine months ago. Ukraine, a resource-rich nation that sits on the geographic and symbolic border between Russia and the West, has long been plagued by corruption and government dysfunction, making it a magnet for foreign profiteers. At the center of the Naftogaz plan, according to three individuals familiar with the details, were three such businessmen: two Soviet-born Florida real estate entrepreneurs, Lev Parnas and Igor Fruman, and an oil magnate from Boca Raton, Florida, named Harry Sargeant III. Parnas and Fruman have made hundreds of thousands of dollars in political donations to Republicans, including $325,000 to a Trump-allied political action committee in 2018. This helped the relatively unknown entrepreneurs gain access to top levels of the Republican Party — including meetings with Trump at the White House and Mar-a-Lago. The two have also faced lawsuits from disgruntled investors over unpaid debts. During the same period they were pursuing the Naftogaz deal, the two were coordinating with Giuliani to set up meetings with Ukrainian government officials and push for an investigation of the Bidens. Sargeant, his wife and corporate entities tied to the family have donated at least $1.2 million to Republican campaigns and PACs over the last 20 years, including $100,000 in June to the Trump Victory Fund.", "description": "We’ll take this as our cue to hit the gym now.", "authors": ["Nicol Natale"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ZfD9.Gr0.PT75UMvJeQcPQ--~B/aD00OTA7dz05ODA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/hearst_prevention_66/66e24dc0a588637043cc701528af2789", "published_at": "2019-10-07"}