{"pub": "yahoo", "url": "https://news.yahoo.com/syrias-assad-vows-support-kurds-against-turkey-assault-141207671.html", "downloaded_at": "2019-10-24 06:56:36.622345+00:00", "title": "Syria's Assad vows support for Kurds against Turkey assault", "language": "en", "text": "Syrian soldiers cheer President Bashar al-Assad during his visit to the southern outskirts of rebel-held Idlib province in the country's northwest (AFP Photo/-)\n\nDamascus (AFP) - Syrian President Bashar al-Assad on Tuesday said the regime would support Kurdish fighters in the northeast of the war-torn country against Turkish soldiers and their Syrian proxies.\n\n\"We are prepared to support any group carrying out popular resistance against the Turkish aggression,\" he said in a video shared by the presidency.\n\n\"This is not a political decision... We are not taking any political decisions now,\" he told government troops on the frontline in the province of Idlib.\n\n\"It is a constitutional duty and a national duty,\" he said.\n\nTurkey and its Syrian proxies on October 9 launched a cross-border attack against Kurdish fighters in northeastern Syria after an announced US military pullout.\n\nTurkey wants to set up a buffer zone in Syrian soil along the length of its southern frontier to keep Kurdish forces it views as \"terrorists\" at bay.\n\nUnder a US-brokered truce deal announced last week, the Kurds have until late Tuesday to pull out their fighters from a 120-kilometre (70-mile) long strip along the frontier that it has largely overrun during the operation.\n\nThe Kurdish-led Syrian Democratic Forces have been a key ally of the United States in the battle against Islamic State group in Syria, at the cost of 11,000 fighters.\n\nThe US pullout has largely been seen as a betrayal of Syria's Kurds, who have spent most of the country's civil war working towards autonomy.\n\nDamascus has previously accused Kurds of treason over their alliance with Washington.\n\nThe Turkish attack forced the Kurds to seek aid from the regime and make a deal to deploy Assad's forces in some northeastern areas for the first time in years.\n\nThe regime has since deployed in the border town of Kobane as well as the town of Manbij further south, without clashing with Turkish forces.\n\nAssad has repeatedly said he would eventually restore government control over all parts of Syria, driving out rebels and jihadists.", "description": "Syrian President Bashar al-Assad on Tuesday said the regime would support Kurdish fighters in the northeast of the war-torn country against Turkish soldiers and their Syrian proxies.  Turkey and its Syrian proxies on October 9 launched a cross-border attack against Kurdish fighters in northeastern Syria", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/gQR2CM8i3bT2AW5x2dFjDQ--~B/aD01MTE7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/1bcdcad8ab49fcf7272a9d36f7d6c051d8c6d78f.jpg", "published_at": "2019-10-22"}