{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-autos-electric-nuerburgring/tesla-takes-on-porsche-with-battle-on-germanys-toughest-circuit-idUKKBN1W32OM", "downloaded_at": "2019-09-18 23:29:18.989552+00:00", "title": "Tesla takes on Porsche with battle on Germany's toughest circuit", "language": "en", "text": "FRANKFURT (Reuters) - Tesla TSLA wants to steal Porsche’s bragging rights by testing its Model S on the northern loop of Germany’s Nuerburgring circuit, using a marketing tool that German carmakers have long used to tout the superiority of their products.\n\nFILE PHOTO: The logo of Tesla carmaker is seen inside a car at the Top Marques fair in Monaco May 30, 2019. REUTERS/Eric Gaillard/File Photo\n\nGermany’s Auto Motor und Sport this week published photographs of a Tesla with “100D+” markings on the track where according to the magazine, it clocked an unofficial time of 7 minutes and 23 seconds, beating the recently launched electric Porsche Taycan’s lap time of 7 minutes 42 seconds.\n\nA formally timed record attempt was due to take place on Wednesday, with another attempt scheduled for Saturday, Auto Motor und Sport said.\n\nTesla is using the Nordschleife, as the track is known, to market its “Plaid” mode on a 7-seater Tesla Model S, CEO Elon Musk confirmed on Twitter.\n\n“We expect these track times to be beaten by the actual production 7 seat Model S Plaid variant that goes into production around Oct/Nov next year,” Musk said on Tuesday.\n\nSetting a new record time for four-door electric cars would give the U.S.-based manufacturer’s ageing Model S a new lease of life just as Audi, Mercedes-Benz, BMW and Porsche prepare to launch electric cars.\n\nThe Nordschleife is one of the world’s most treacherous thanks to its length of just over 20 km (12.5 miles), slanted cambers and an altitude difference of 300 meters (yards) between its highest and lowest point.\n\nPorsche says its 919 Evo hybrid racecar currently holds the record with a lap time of 5 minutes 19 seconds, set in 2018 by keeping up an average speed of 234 km (146.3 miles) an hour, despite blind corners, narrow bends and limited safety run-off zones.\n\nPorsche, BMW, Mitsubishi, Nissan, Cadillac and Aston Martin have used the racetrack as a boot camp to hone reliability and handling and to benchmark their vehicles against top competitors.\n\n“If you take the same corner, on the same road, at the same speed, in two different cars, you can see how your car measures up to the competition,” said driver Dirk Schoysman, who set a Nordschleife lap record in 1996 in a Nissan Skyline with a time of 7 minutes 59 seconds.\n\nFor Nissan, the new record underscored the Skyline R33 GT-R’s global status as a serious sportscar, proving that Japanese brands could be as competitive as vehicles made by Germany’s finest manufacturers.\n\nThe circuit opened in June 1927 to become an important battleground where legendary drivers like Tazio Nuvolari and Juan Manuel Fangio drove some of their most memorable races.\n\nIn 1935 senior Nazi officials gathered at the German Grand Prix ready to cheer the home team, only to see Italy’s Nuvolari beat the Mercedes-Benz W25 and the Auto Union Typ B in an Alfa Romeo Tipo B P3.\n\nThe track remained a venue for Grand Prix races until 1976 when a horrendous crash almost killed driving ace Niki Lauda, leading to the opening of a shorter, wider Nuerburgring track with improved facilities in May 1984.\n\nBut carmakers have continued to use the older circuit’s 40 right-hand and 33 left-hand turns through the Eifel region’s forested hills to develop their regular vehicles.\n\n“Cars cannot keep secrets here, mistakes and problems will eventually rise to the surface,” Schoysman said.\n\nAt the Hatzenbach corner, cars enter a dip forcing them over a series of undulations with their suspension compressed, testing the chassis to the limit.\n\n“If the car changes its line in that corner it may be a tire flexing, the suspension bushes that have gone through their stroke, or a problem with the stiffness of the car body, or its electronic stability program,” Schoysman explained.\n\nSlideshow (2 Images)\n\nThese development tweaks continue to be relevant for electric cars as well as for marketing purposes.\n\nUnderstanding the circumstances of the test lap will be crucial for evaluating Tesla’s achievement, Schoysman said.\n\n“Getting a new lap record shows the know-how of the company but there are always questions: Are the cars realistic copies of what the customer finds in a showroom? Or were they modified?”", "description": "Tesla wants to steal Porsche's bragging rights by testing its Model S on the northern loop of Germany's Nuerburgring circuit, using a marketing tool that German carmakers have long used to tout the superiority of their products.", "authors": ["Edward Taylor", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190918&t=2&i=1431343378&w=1200&r=LYNXMPEF8H1S7", "published_at": "2019-09-18"}