{"pub": "independent", "url": "https://independent.co.uk/voices/andrew-adonis-gay-lgbt-rights-a9173071.html", "downloaded_at": "2019-10-27 12:57:41.862057+00:00", "title": "Like Andrew Adonis I too came out as gay after decades in the closet", "language": "en", "text": "I had heard on the grapevine that Andrew Adonis had come out as gay. He and I were colleagues at the same time, working for Tony Blair in 10 Downing Street in the early 2000s. We were both deeply closeted at the time. Andrew’s interview in The i last week, recounting the pressures he had experienced to conceal his true sexuality, resonated powerfully with me.\n\nI had my first same-sex experience, with a school friend, at the age of 10. The year was 1957 and the next time I had sex with another male was some 50 years later. I was a product of my Roman Catholic upbringing, the law and societal attitudes at the time. Sexual activity between men was a crime in England, punishable by imprisonment and hard labour. It was drilled into me that what I had done must never ever happen again.\n\nSo, growing into my teens, and at university, I knew I was more attracted to other boys, not to girls. But I didn’t dare to admit it to myself, let alone “come out” to anyone. No one came out as gay. Some led their lives in secret, others were “outed” – and paid a price.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nWhen parliament debated – and eventually agreed – the partial decriminalisation of same-sex activity in 1967, none of the MPs who were later known to be gay declared their sexuality. Instead, they took the line that homosexuals were unfortunate misfits who should not be punished for an affliction they had not chosen.\n\nFrom university, I joined Her Majesty’s Diplomatic Service. The Foreign Office, shaken by the Cambridge-spy scandals of the early 60s, and worried by Soviet cold-war blackmail, would not grant security clearance to anyone who was avowedly homosexual. Had I, I was asked by a retired police detective during my security-vetting interview, ever had any homosexual experience? “Yes”, I said, “with another boy when I was 10”. Laughter. “Did I have any homosexual tendencies?” I gulped. And lied: “No”, I replied. I passed the test, but at the price of telling myself that I would have to fight my impulses and take the secret of my sexuality to the grave.\n\nShape Created with Sketch. 20 best pictures of India celebrations following gay sex court ruling Show all 20 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. 20 best pictures of India celebrations following gay sex court ruling 1/20 Someone celebrates underneath a rainbow-coloured flag as the Supreme Court in India rules that gay sex is longer a crime. AFP/Getty Images 2/20 People celebrate in the street following the ruling. The Chief Justice of India stated that the outlawing of gay sex had been \"irrational, arbitrary and indefensible\". AFP/Getty Images 3/20 Up until now, gay sex in India had been punishable by up to 10 years in prison under Section 377 of the Indian constitution. AFP/Getty 4/20 The law was originally imposed during the Victorian era while India was still under the rule of the British Empire. AFP/Getty Images 5/20 \"Any consensual sexual relationship between two consenting adults - homosexuals, heterosexuals or lesbians - cannot be said to be unconstitutional,\" said Dipak Misra, Chief Justice of India. AFP/Getty Images 6/20 Members and supporters of the LGBT+ community in India were overjoyed by the decision, with the celebrations awash with rainbow-coloured paraphernalia. AFP/Getty Images 7/20 \"They have opened the door to discussing rights,\" Anjali Gopalan, founder of the Naz Foundation charity that has been fighting against Section 377 told The Independent. \"They have apologised to the gay community, and they have said copies of the judgement will be handed to every police station. It is the best judgement we could have hoped for.\" AFP/Getty Images 8/20 People were dancing and smiling as the Supreme Court's ruling was announced. AFP/Getty Images 9/20 Bismaya, an activist with the Delhi brand of LGBT+ advocacy group Impulse, told The Independent: \"I'm so happy, it's overwhelming. I cried when we heard the news. I'm gay and I'm not afraid of that. It's something I used to say, but now for the first time I have the legal backing.\" AFP/Getty Images 10/20 The rain did little to dampen people's spirits as they celebrated the historic ruling in New Delhi. AFP/Getty Images 11/20 A woman exclaims with joy as she holds hands with others on the day of the ruling. AFP/Getty Images 12/20 Members of the LGBT+ community in India hold a placard reading \"Love is genderless\" while standing outside the Supreme Court in New Delhi. AFP/Getty Images 13/20 The celebrations in India were bright, colourful and full of happiness. AFP/Getty Images 14/20 Bismaya, activist for LGBT+ advocacy group Impulse, said: \"It's great for me but it's also a great day for the whole of India. Acceptance in wider society will take time, because we cannot expect change overnight. It has been a battle for two decades for this judgement. If now we get full acceptance in a couple of years, that would be great.\" AFP/Getty Images 15/20 Members and supporters of the LGBT+ community in member celebrate the landmark ruling in Siliguri with a cake and confetti. AFP/Getty Images 16/20 People join in the jubilant festivities in Kolkata. AFP/Getty Images 17/20 A woman cries with happiness in Chennai as the ruling made by the Supreme Court in India is announced. AFP/Getty Images 18/20 The celebrations in Kolkata were full of happiness and energy. AFP/Getty Images 19/20 A group of people stand in heavy rainfall in New Delhi as they celebrate the outlawing of the outdated ban on gay sex in India. AFP/Getty Images 20/20 The movement to reconsider Section 377 started in 2001 with a legal challenge made to the Delhi High Court from the Naz Foundation. AFP/Getty Images 1/20 Someone celebrates underneath a rainbow-coloured flag as the Supreme Court in India rules that gay sex is longer a crime. AFP/Getty Images 2/20 People celebrate in the street following the ruling. The Chief Justice of India stated that the outlawing of gay sex had been \"irrational, arbitrary and indefensible\". AFP/Getty Images 3/20 Up until now, gay sex in India had been punishable by up to 10 years in prison under Section 377 of the Indian constitution. AFP/Getty 4/20 The law was originally imposed during the Victorian era while India was still under the rule of the British Empire. AFP/Getty Images 5/20 \"Any consensual sexual relationship between two consenting adults - homosexuals, heterosexuals or lesbians - cannot be said to be unconstitutional,\" said Dipak Misra, Chief Justice of India. AFP/Getty Images 6/20 Members and supporters of the LGBT+ community in India were overjoyed by the decision, with the celebrations awash with rainbow-coloured paraphernalia. AFP/Getty Images 7/20 \"They have opened the door to discussing rights,\" Anjali Gopalan, founder of the Naz Foundation charity that has been fighting against Section 377 told The Independent. \"They have apologised to the gay community, and they have said copies of the judgement will be handed to every police station. It is the best judgement we could have hoped for.\" AFP/Getty Images 8/20 People were dancing and smiling as the Supreme Court's ruling was announced. AFP/Getty Images 9/20 Bismaya, an activist with the Delhi brand of LGBT+ advocacy group Impulse, told The Independent: \"I'm so happy, it's overwhelming. I cried when we heard the news. I'm gay and I'm not afraid of that. It's something I used to say, but now for the first time I have the legal backing.\" AFP/Getty Images 10/20 The rain did little to dampen people's spirits as they celebrated the historic ruling in New Delhi. AFP/Getty Images 11/20 A woman exclaims with joy as she holds hands with others on the day of the ruling. AFP/Getty Images 12/20 Members of the LGBT+ community in India hold a placard reading \"Love is genderless\" while standing outside the Supreme Court in New Delhi. AFP/Getty Images 13/20 The celebrations in India were bright, colourful and full of happiness. AFP/Getty Images 14/20 Bismaya, activist for LGBT+ advocacy group Impulse, said: \"It's great for me but it's also a great day for the whole of India. Acceptance in wider society will take time, because we cannot expect change overnight. It has been a battle for two decades for this judgement. If now we get full acceptance in a couple of years, that would be great.\" AFP/Getty Images 15/20 Members and supporters of the LGBT+ community in member celebrate the landmark ruling in Siliguri with a cake and confetti. AFP/Getty Images 16/20 People join in the jubilant festivities in Kolkata. AFP/Getty Images 17/20 A woman cries with happiness in Chennai as the ruling made by the Supreme Court in India is announced. AFP/Getty Images 18/20 The celebrations in Kolkata were full of happiness and energy. AFP/Getty Images 19/20 A group of people stand in heavy rainfall in New Delhi as they celebrate the outlawing of the outdated ban on gay sex in India. AFP/Getty Images 20/20 The movement to reconsider Section 377 started in 2001 with a legal challenge made to the Delhi High Court from the Naz Foundation. AFP/Getty Images\n\nThe Diplomatic Service frowned on single men who were not married. One of my ambassadorial bosses even advised me, when I was about 27, that it was time I married in order to further my career. I did marry. It was not a cynical act. I met and married a wonderful girl. I was convinced marriage would “cure” me. I repressed my true sexuality, burying myself in work. I was hard wired to be gay, but my sense of self-esteem, family pressures, love, loyalty, religious faith and career prospects all pushed me into a heterosexual mould.\n\nOnly when I stopped full-time work at around 60 did a combination of sexual frustration and determination to be open about the true “me” lead me to come out. It devastated and ended my marriage, causing huge hurt to my wife. But the burden of years of concealment had been lifted.\n\nPeople congratulated me on my “courage”. But it was those who had come out earlier in life who were the brave ones. I had cowered in the closet. I was determined to make up lost ground. Initially, I was only out to family and friends. Then the BBC World Service invited me to take part in a radio programme on LGBT+ issues that had a large audience in Nigeria, where it is a grave offence, both legally and socially, to be gay.\n\n“Why me?”, I asked the producer. “Because,” he replied, “you are a pillar of the establishment and a ‘Sir’. Few people in Nigeria will think it possible to be those things and gay as well”. And so, I outed myself to the world.\n\nTalk to many gay men of my generation and you will hear similar stories, that of the man who is now my husband, among them: he would have been sacked from his post as a senior consultant at a children’s hospital had it been known he was gay. We were constrained to lives against our nature because society required it and refused to accept us for who we are. We have to make sure those precious and hard-won rights are not reversed.\n\nStephen Wall is a former British Ambassador to the EU and the chair of Kaleidoscope Trust", "description": "I had heard on the grapevine that Andrew Adonis had come out as gay. He and I were colleagues at the same time, working for Tony Blair in 10 Downing Street in the early 2000s. We were both deeply closeted at the time. Andrew’s interview in The i last week, recounting the pressures he had experienced to conceal his true sexuality, resonated powerfully with me.", "authors": ["Stephen Wall"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/24/07/andrew-adonis.jpg", "published_at": "2019-10-27"}