{"pub": "usatoday", "url": "https://usatoday.com/story/news/nation/2019/10/16/rachelle-bergeron-fbi-probes-slaying-yap-micronesia-prosecutor/4005112002", "downloaded_at": "2019-10-17 05:14:58.091306+00:00", "title": "FBI to investigate slaying of American prosecutor in Micronesia", "language": "en", "text": "CLOSE\n\nThis Aug. 2015, photo posted on Facebook shows Rachelle Bergeron sitting a desk after taking on her new role as assistant attorney general of Yap State, on the Federated States of Micronesia. Bergeron was shot and killed outside her home on Yap on Oct. 14, 2019. (Yap State Government via AP) (Photo: AP)\n\nHAGATNA, Guam – The acting attorney general of Yap in the Pacific nation of Micronesia was killed in an attack this week, authorities say.\n\nRachelle Bergeron, 33, a native of Wisconsin, was pronounced dead on arrival at Yap Memorial Hospital Monday evening, Constantine Yowbalaw, director of Yap’s Department of Youth and Civic Affairs, said in a telephone interview.\n\nThe Associated Press reported that Bergeron was shot and killed as she returned home from a run with her dog.\n\n\"Yap's community and spirit is broken,\" Yowbalaw said. \"Yap's pride and reputation is tarnished.\"\n\nThe FBI will be sending a team to Yap as quickly as possible to assist the Yap police in the investigation, FBI spokesperson Michelle Ernst said Tuesday,\n\nVisa overstays: Trump's crackdown on targets mostly African, Asian nations\n\nThe attack occurred at about 7 p.m. Monday, at Bergeron's home, Yowbalaw said.\n\n\"Our prayers are with her family, friends and community here and abroad,\" Yowbalaw told Pacific Daily News.\n\nBergeron’s husband, Simon Hammerling, was inside the couple’s house Monday night baking brownies with a local child the couple was helping to care for when somebody fired three shots at Bergeron as she pulled up and opened the back of her Subaru hatchback, killing both her and her dog, said a friend, Amos Collins.\n\nAuthorities say they’re investigating the crime but haven’t yet arrested any suspects.\n\nBergeron was a native of Waukesha, Wisconsin. Her father, Thomas Bergeron of Germantown, said he was in shock after learning of Bergeron’s death.\n\n“It's been a very, very difficult time to lose someone like her,\" he said.\n\nRachelle's vitality, love and kindness are what he'll miss most, her father said.\n\n\"She was very loving and cared about people, and was a good person to have on your team,\" he said.\n\nYap, located about three-quarters of the way from Hawaii to Indonesia, home to 11,000 people.\n\nRachelle Bergeron arrived there in August 2015 to work as assistant attorney general. She became acting attorney general in January.\n\nShe previously worked with the International Justice Mission and Sanctuary for Families on human trafficking. She had lived in Washington, D.C., New York and India.\n\nBergeron married Hammerling, a missionary pilot with Pacific Mission Aviation, in Yap on Oct. 25, 2018.\n\nThey had been helping to care for two girls on the island, Thomas Bergeron said.\n\nRachelle Bergeron grew up as the oldest of four in Waukesha, then went on to attend the University of Florida's Fredric G. Levin College of Law.\n\n\"She was very courageous,\" Thomas Bergeron said. \"She loved to defend those who were mistreated and was willing to take a stand for them.\"\n\nFollow Haidee Eugenio Gilbert on Twitter @haidee_eugenio.\n\nContributing: Hannah Kirby, Milwaukee Journal Sentinel; The Associated Press\n\nRead or Share this story: https://www.usatoday.com/story/news/nation/2019/10/16/rachelle-bergeron-fbi-probes-slaying-yap-micronesia-prosecutor/4005112002/", "description": "Rachelle Bergeron reportedly was shot and killed as she returned home from a run with her dog in Yap, Micronesia.", "authors": ["Haidee Eugenio Gilbert", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/15/PGUA/c837904e-ee25-49d5-a1e8-b437d5aa3b8f-Yap_Acting_AG_Rachelle_Bergeron.jpg?crop=718,404,x0,y192&width=3200&height=1680&fit=bounds", "published_at": "2019-10-16"}