{"pub": "cbs", "url": "https://cbsnews.com/news/michael-walker-ex-army-medic-pleads-guilty-wifes-love-triangle-murder-catherine-walker-ailsa-jackson", "downloaded_at": "2019-09-24 13:37:44.765075+00:00", "title": "Ex-Army medic pleads guilty in wife's love triangle murder", "language": "en", "text": "Honolulu — A former Army medic stationed in Hawaii pleaded guilty Monday to the murder of his wife, about a week before a trial was about to begin in a case involving porn, sex charges and a love triangle.\n\nMichael Walker pleaded guilty to second-degree murder and said he arranged for the woman with whom he was having an affair to kill his wife while he was working in the emergency room at Tripler Army Medical Center in Honolulu so he would have an alibi.\n\nIn 2015, Ailsa Jackson pleaded guilty to murder, describing in court how she stabbed Catherine Walker and then waited a half-hour to make sure she was dead.\n\nAfter meeting through an online dating site in September 2014, Michael Walker told Jackson he was married and that his \"deepest desire\" was to have his wife gone, but he couldn't divorce her, Assistant U.S. Attorney Tom Brady said.\n\nBy gone, he meant, \"I wanted her dead, ma'am,\" he told a judge Monday.\n\nMichael Walker and Catherine Walker in undated family photo KGMB-TV\n\nWalker also had other affairs, including with men who paid him for sex, Brady said. Walker told one of the men he had sex with, but didn't receive money from, that his wife didn't know he was bisexual and was having affairs with men.\n\n\"I just want to be free to live life how I want to,\" Walker said in a text message to the man.\n\nIn a November 2014 interrogation that CBS Honolulu affiliate KGMB-TV obtained video of, Walker admits to cheating on his wife, but says Jackson killed her. He also admits to having multiple other affairs and taking payment from men for sex.\n\n\"I have a problem. I'm a sex addict,\" Walker says, adding that Jackson threatened his wife's life.\n\nBrady said Monday that Walker told Jackson he couldn't simply divorce his wife because of financial concerns and because he stood to receive $400,000 in life insurance.\n\nThey plotted the killing in emails, during in-person discussions and in text messages in which they called each other \"daddycakes\" and \"babygirl,\" according to Walker's plea agreement.\n\nOn Nov. 14, 2014, they met in a military reservation's gym parking lot, where Jackson said she would kill Catherine Walker that night, Brady said, describing how the two came up with a text messaging code to let Jackson know whether she should enter the home through a window or use a key left in the gravel near the back door. If Michael Walker texted, \"good,\" that would mean use the window and \"bad\" would mean the key.\n\nWalker texted \"bad,\" Brady said, and at about midnight Jackson walked to the Walkers' house at Aliamanu Military Reservation and found the key, Brady said.\n\nJackson said in court she \"went inside and grabbed a knife and went upstairs and stabbed her.\"\n\nWalker knew that Jackson was mentally ill and heard voices, Brady said.\n\nJackson and Walker are scheduled to be sentenced on Feb. 10. She's expected to be sentenced to 30 to 33 years in prison. Walker is expected to receive a sentence of about 24 to 30 years.\n\nIn 2016, a military court found Walker guilty of child pornography charges that surfaced during the murder investigation.\n\nAnd then in 2017, Walker was convicted of sexually abusing a child, physically assaulting a child, and wrongfully communicating a threat. He was reduced in rank from sergeant to private, sentenced to 10 years confinement, and received a dishonorable discharge, the Army said.\n\nMichael Walker grew up in Bennington, Vermont, while his wife grew up in Albany, New York, her sister Jennifer Plotz said. The couple married in Albany and were active in The Church of Jesus Christ of Latter-day Saints, Plotz said from Phoenix.\n\n\"They went to church together every Sunday,\" Plotz said. She declined to discuss the case.\n\nWalker's attorney, Birney Bervar, said previously his client did have an affair but loved his wife. He said the couple were about to undergo in vitro fertilization after about a decade of trying to have a baby.", "description": "Self-described \"sex addict\" Michael Walker admitted he arranged for his lover to kill his wife; he and prosecutors say he also had many other affairs, including with men", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/24/9d7ba74a-db8f-4816-b68e-d92a008ffe6e/thumbnail/1200x630/716368906d5113aeff23ba8e9c2d7fdb/michael-walker-catherine-walker.jpg", "published_at": "2019-09-24"}