{"pub": "dailybeast", "url": "https://thedailybeast.com/rudy-giulianis-twitter-feed-is-a-boomer-conspiracy-theory-shtshow", "downloaded_at": "2019-10-17 10:32:59.057452+00:00", "title": "Rudy Giuliani’s Twitter Feed Is a Boomer Conspiracy Theory Sh*tshow", "language": "en", "text": "When Rudy Giuliani logs into Twitter, he’s presented with a world where the recent California power outages were staged by military operatives rooting out cannibal-pedophiles deep in their underground bunkers.\n\nIt’s a place where President Donald Trump only betrayed the Kurds because they were running black sites for a global deep-state cabal; where former Trump Russia adviser Fiona Hill ran an anti-Trump spy ring out of the White House; where former Hillary Clinton campaign chair John Podesta eats children; and where the pope is about to seize world power, and maybe already has.\n\nIt is the worst that the right-wing internet fever swamp has to offer, and it is all right there, waiting for Giuliani to consume.\n\nWith the president’s personal lawyer now in hot water for helping to orchestrate an apparent pressure campaign to get the Ukrainian leadership to launch investigations beneficial to Trump’s domestic political needs, the question being routinely asked is what compelled him to act in these ways. To answer that question, it’s worth examining the dozen of hardcore conspiracy theory accounts that populate Giuliani’s Twitter timeline.\n\nGiuliani, after all, has become a fairly regular user of the platform, having posted to it more than 1,000 times and routinely favoriting content during the course of any given day. But he only follows 224 people (as of Wednesday). A good chunk of those follows are conventional Trumpworld figures, including the president himself (Trump was Giuliani’s earliest follow), Judicial Watch chief Tom Fitton, opinion writer John Solomon, and former Trump adviser Sebastian Gorka.\n\nBut many of those 224 dabble in far darker realms of the far-right conspiracy theory internet than the usual rantings of a Fox News primetime broadcast. For instance, Giuliani follows writer Ella Cruz—the author of an Amazon self-published book called Ring of the Cabal: The Secret Government of The Royal Papal Banking Cabal, which alleges that the New World Order will soon impose the “mark of the beast” on all humanity. In August, Cruz tweeted at Giuliani, warning him that Hillary Clinton murdered pedophile financier Jeffrey Epstein.\n\nThough Giuliani doesn’t often RT or even like the content produced by the people he follows his taste for conspiracy theories does occasionally shine through, such as in August, when he quote-tweeted conspiracy theorist Matt Couch, a prolific promoter of the baseless idea that former Democratic National Committee staffer Seth Rich was murdered by Hillary Clinton. Couch has become so vocal in his attacks on the Rich family that Rich’s brother filed a defamation suit against him.\n\nGiuliani promoted a tweet from Couch questioning the police narrative about Rich’s 2016 murder, and later told The Daily Beast there are “legitimate questions” about the investigation.\n\nGiuliani follows a number of accounts that promote the QAnon conspiracy, which alleges that Trump is engaged in a secret war against cannibal-pedophiles in the Democratic Party, Hollywood, and Wall Street. Nearly 5 percent of the accounts that Giuliani follows have explicit QAnon references permanently on their Twitter pages, either in the form of pinned tweets, Twitter names, bios, or header images.\n\nMany more of them frequently tweet and retweet QAnon messages from popular promoters of the conspiracy theory. Several accounts Giuliani follows recently retweeted a video, shot in a dimly lit, anonymous living room, starring a man claiming that Navy SEALs and Marines had recently rescued “2,100 children from California Underground bases.” There is no evidence that this is actually true.\n\nOther accounts that Giuliani follows are prone to promoting a wild potpourri of various conspiracy theory claims. Among them are that Barack Obama is engineering the Trump impeachment process to install Michelle Obama in the White House, or that Hillary Clinton plans to kill off each Democratic presidential candidate so she can become president herself. Others allege that Justice Ruth Bader Ginsburg secretly died months ago, but that her death is being covered up.\n\nTaken together, the accounts circle around a few popular right-wing targets: the Clintons, the Obamas, Rep. Ilhan Omar (D-MN). Several accounts Giuliani follows recently claimed, without any proof, that Omar had donned a disguise to take part in a gathering of left-wing antifascist activists. Another promoted a long-discredited idea that a photograph proves Omar attended a terrorist training camp (in fact, the picture was taken years before Omar was even born).\n\nMany of the accounts Giuliani follows have just a few hundred or thousand followers, raising questions about how he became aware of them in the first place. But Giuliani also follows some of Twitter’s leading right-wing conspiracy theorists. Giuliani follows SGT Report, a sort of clearing house for anti-vaccine activists and other conspiracy theorists that has more than 500,000 subscribers on YouTube.\n\nThe degree to which Rudy’s Twitter consumption informs his world view is inherently unknowable. Giuliani hasn’t favorited any of tweets from the conspiracy theory accounts. Reached for comment, he declined to say why so many obscure conspiracy theory Twitter accounts make up the relatively small number of total accounts that he follows on Twitter.\n\n“Never saw any of that,” Giuliani wrote in a text message.\n\nBut there is some anecdotal evidence that Giuliani has embraced or, at a minimum, begun to echo the world that he has built for himself on that platform and it is not just because of his penchant for promoting conspiracy theories about billionaire George Soros and former Vice President Joe Biden. Earlier this month, Giuliani appeared on an internet TV radio show hosted by Bill Mitchell, a diehard Trump fan who has frequently promoted QAnon online. Asked ahead of the interview why he was going on the show, given Mitchell’s QAnon connection, Giuliani asked for proof that Mitchell supports QAnon. After The Daily Beast sent Giuliani one article proving Mitchell’s support for QAnon, the former prosecutor stopped responding to text messages.\n\nGiuliani’s own Twitter use has accelerated since he took on a starring role in Trump’s Ukraine scandal, according to social media analytics site SocialBlade. In October 2018, Giuliani had 29 average monthly tweets. A year later, he averages 132 tweets a month, according to SocialBlade.\n\nMany of the fringe accounts Giuliani follows have rallied to his defense as the Ukraine investigation heats up and echo his most conspiratorial insinuations about the Biden family. One account Giuliani follows, for example, regularly urges him and Trump to sue Speaker Nancy Pelosi (D-CA) over impeachment.\n\nSeveral of the conspiracy theorist Twitter users that Giuliani follows have, in turn, cited their social media connection to the former New York City mayor as a way of burnishing their credibility.\n\n“It’s an honor that he follows me,” Couch, the Seth Rich conspiracy theorist, told The Daily Beast.", "description": "The president’s lawyer has baffled a lot of people with his recent behavior. Perhaps his social media habits can explain why.", "authors": ["Will Sommer"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_675,w_1200,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1571259477/191016-SOMMER-Rudy-twitter_eed3xa", "published_at": "2019-10-17"}