{"pub": "npr", "title": "'We Live With It Every Day': Parkland Community Marks 1 Year Since Massacre", "url": "https://npr.org/2019/02/14/694688365/we-live-with-it-every-day-parkland-community-marks-one-year-since-massacre", "language": "en", "published_at": "2019-02-14", "downloaded_at": "2019-09-02 07:20:10.033025+00:00", "text": "'We Live With It Every Day': Parkland Community Marks 1 Year Since Massacre\n\nEnlarge this image toggle caption Wilfredo Lee/AP Wilfredo Lee/AP\n\nUpdated at 5:32 p.m. ET\n\nAt 2:21 p.m. on Feb. 14, 2018, the first gunshots began to reverberate through the hallways of Marjory Stoneman Douglas High School, leaving 14 students and three educators dead; 17 others were wounded.\n\nOne year later at 10:17 a.m., silence descended on Florida's schools.\n\nEnlarge this image toggle caption Terry Spencer/AP Terry Spencer/AP\n\nBroward County Public Schools Superintendent Robert Runcie said the time was chosen because most students would be in class and for the symbolism of 17 minutes after the hour honoring the 17 killed and the 17 injured.\n\nMarjory Stoneman freshman Jayden Jaus, 14, told The Associated Press that the moment of silence was \"a bit emotional and a little intense.\" The principal read the victims' names over the public address system.\n\nEnlarge this image toggle caption Wilfredo Lee/AP Wilfredo Lee/AP\n\nThe high school did not hold regular classes; rather, it hosted a \"Day of Service and Love.\" Students were invited to participate in projects including serving breakfast to first responders and packing meals for underprivileged children.\n\nSome students arrived at school Thursday wearing the signature burgundy #MSDStrong T-shirts.\n\nGrief counselors and therapy dogs were available.\n\nInspirational messages painted on stones placed at an outdoor memorial included \"Be positive / Be passionate / Be proud,\" \"Be here now\" and \"Communities that paint together heal together.\"\n\nSophomore Julia Brighton told the AP that she could not bear to enter the school, opting to set flowers at the outdoor memorial instead. She said it \"felt like it would be a better experience for me instead of being at school and putting myself through that.\"\n\nEnlarge this image toggle caption Wilfredo Lee/AP Wilfredo Lee/AP\n\nThe school closed for the day by noon.\n\nThe Broward County School Board sponsored community service projects at a park. At the Coral Springs Museum of Art, free \"relaxing\" activities including music, massage and a mini-petting zoo were also on offer.\n\nCandlelit and prayer vigils were scheduled throughout the day to give people a chance to gather and mourn communally.\n\nFor Linda Beigel Schulman, the pain of losing her son is just as sharp one year on.\n\n\"I walked down the path today and it was just like reliving last year when we walked down the path,\" she said at a Parkland news conference. Her son, Scott Beigel, a geography teacher and cross-country coach, was shot dead after unlocking his door to let in fleeing students.\n\nThe days that have passed since Feb. 14, 2018, have been marked by shock, by physical recovery, by outrage and by activism.\n\nSurviving students formed March for Our Lives, a national movement to end gun violence and mass shootings, helping propel dozens of gun safety laws at the state level.\n\nAmong the changes, Florida raised the minimum firearm purchasing age from 18 to 21 and enacted a \"Red Flag\" law empowering authorities to temporarily remove guns from someone believed to pose a threat.\n\nBut with partisan logjams thwarting change at the federal level, the National Rifle Association remaining a powerful force for gun rights, and school shootings a continued reality, activists say much work remains.\n\nOn Thursday, however, March for Our Lives leaders put down their megaphones and stepped back from social media.\n\nJaclyn Corin, a senior at Marjory Stoneman Douglas and a co-founder of March for Our Lives, told NPR that survivors of other school shootings had advised her and her friends to press pause. \"We don't know how we're going to feel,\" said Corin said of the first anniversary. \"I think it's the proper thing to go dark — actually spend that day to ourselves in our own thoughts.\"\n\nSurvivor David Hogg, one of the movement's most prominent leaders, said he will be taking a three-day break from Twitter. \"Please remember the people [who were] stolen from us that day; they are why we fight for peace.\"\n\n\"We don't need [the anniversary] to remind us what happened,\" Andrew Pollack told the AP. He has become an advocate for school safety since his 18-year-old daughter, Meadow, was killed in the attack. \"We live with it every day.\"\n\nOn Thursday, Fred Guttenberg was thinking about the morning a year ago when he sent his two children off to school and only one came home.\n\n\"I am forever haunted by my memory of that morning, rushing my kids out the door rather than getting one last minute. Did I say I love you?\"\n\nGuttenberg, who who has become another prominent gun safety activist, said he would be visiting Jaime's grave on Thursday.\n\nMeantime, across the country in New Mexico, a shot was fired Thursday morning at a suburban Albuquerque school. Students were evacuated from V. Sue Cleveland High School and anxious parents were kept away awaiting word about their kids. Police said nobody was injured and a suspect, who is a student at the school, was taken into custody. A handgun was recovered inside the school.\n\n\"It was extremely scary,\" said Rio Rancho Police Chief Stewart Steele. \"It sent my heart in my throat and I wasn't in the school. So I can't imagine being a student.\"\n\nAlbuquerque Mayor Tim Keller noted the timing of the scare coinciding with the Parkland anniversary. \"We cannot keep accepting this as normal,\" he tweeted.\n\nPresident Trump sought to sound a note of unity in a statement released Thursday, remembering the shooting.\n\n\"Today, as we hold in our hearts each of those lost a year ago in Parkland, let us declare together, as Americans, that we will not rest until our schools are secure and our communities are safe.\"\n\nThe statement said \"tremendous strides\" have been made, including the administration's banning bump stocks and signing school violence and criminal background check bills into law.\n\nBut Trump has come under criticism for initially taking a stronger stand on gun control just after the Parkland attack and then later an approach more in line with the NRA in his proposals.\n\nThursday, in Trump's tweet linking to his Parkland remembrance, a reference to gun violence was changed in the tweet to \"school violence.\"", "description": "Following a year of outraged activism, some survivors went silent Thursday. Marjory Stoneman Douglas High School invited students to participate in community service projects.", "authors": ["Amy Held"], "top_image": "https://media.npr.org/assets/img/2019/02/14/ap_19045482279168_wide-410328f344dadbcae442d9da5123930a54484597.jpg?s=1400"}