{"pub": "reuters", "url": "https://reuters.com/article/us-china-usa-drugs/u-s-official-believes-china-is-committed-to-curbing-fentanyl-idUSKBN1WB08A", "downloaded_at": "2019-09-26 05:23:50.869688+00:00", "title": "U.S. official believes China is 'committed' to curbing fentanyl", "language": "en", "text": "BEIJING (Reuters) - A senior White House official on Thursday said he believed China was “absolutely committed” to cooperating with the United States to curb illicit fentanyl, a drug which has played a major role in a devastating U.S. opioid crisis.\n\nFILE PHOTO: Plastic bags of Fentanyl are displayed on a table at the U.S. Customs and Border Protection area at the International Mail Facility at O'Hare International Airport in Chicago, Illinois, U.S. November 29, 2017. REUTERS/Joshua Lott/File Photo\n\nThe remarks by Jim Carroll, the Director of National Drug Control Policy, reflect a shift in tone after U.S. President Donald Trump accused Chinese President Xi Jinping in August of not living up to his pledges to crack down on the drug.\n\nAt the time, China labeled that “blatant slander”, and it has argued that the United States needs to do more at home to fight fentanyl abuse and reduce demand for the highly addictive drug.\n\n“I am absolutely convinced the Chinese, starting with President Xi down through the Minister of Public Security Zhao (Kezhi), are absolutely committed to doing this,” Carroll, who oversees the U.S. government’s response to the opioid crisis, told reporters in Beijing after meeting his Chinese counterparts.\n\n“I fully believe that what we learned on this trip is that the Chinese government, the Chinese people, are committed to this issue, both to save lives in the United States, but also to save lives in China,” Carroll said.\n\nCarroll, accompanied by Acting Commissioner for U.S. Customs and Border Protection Mark Morgan and Chief Postal Inspector Gary Barksdale, called the visit “ground-breaking”.\n\nGoing forward, U.S. officials would have routine conversations and intelligence sharing at a higher level with Chinese authorities to ensure the two sides are “truly eradicating” traffickers, he said.\n\nMorgan said he was encouraged by Chinese plans to build additional labs, and that the United States would be sharing data from new pollen signature chemical tests that can help identify fentanyl origin countries.\n\nU.S. officials have said China is the main source of illicit fentanyl, a cheap, opioid painkiller 50 times more potent than heroin, and related substances trafficked into the United States, much of them through international mail.\n\nBeijing, which in May expanded controls to include the more than 1,400 known and future fentanyl analogues, has cited U.S. statistics to deny that most of the fentanyl entering the United States originates in China.\n\nEarlier this month, Liu Yuejin, Vice Commissioner of the China National Narcotics Control Commission, said that the two countries had only limited cooperation to stop fentanyl smuggling.\n\nThe row over fentanyl comes as the United States is in the middle of a bruising trade war with China, and some experts believe that may have been hampering meaningful cooperation on trafficking.\n\nThe U.S. Treasury Department imposed sanctions on three Chinese men accused of illegally trafficking fentanyl in August, but U.S. officials have been frustrated that China has not arrested the suspects.\n\nThe National Institute of Drug Abuse reported earlier this year that 130 people die every day in the United States after overdosing on opioids, which include prescription pain relievers, heroin and synthetic drugs like fentanyl.", "description": "A senior White House official on Thursday said he believed China was \"absolutely committed\" to cooperating with the United States to curb illicit fentanyl, a drug which has played a major role in a devastating U.S. opioid crisis.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190926&t=2&i=1433984760&w=1200&r=LYNXMPEF8P04U", "published_at": "2019-09-26"}