{"pub": "aljazeera", "url": "https://aljazeera.com/ajimpact/malaysia-presents-smaller-budget-revenue-falling-191011092827254.html", "downloaded_at": "2019-10-11 12:52:12.394933+00:00", "title": "Malaysia presents smaller budget as revenue seen falling", "language": "en", "text": "Malaysia's government has unveiled a smaller budget for next year as revenue is expected to fall, but said it would raise development spending to offset a slowdown in global demand.\n\nAs expected, the government also said on Friday it would run a larger fiscal deficit of 3.2 percent of gross domestic product (GDP) - compared with an initial target of three percent but lower than this year's 3.4 percent - to help spur economic activity.\n\nSoutheast Asia's third-largest economy bucked a global cooling trend and grew faster than expected in the first half of 2019, but analysts say the trade war between China and the United States and expanding protectionist policies around the world will eventually drag on the export-reliant country.\n\nThe government, nevertheless, forecast economic growth of 4.8 percent next year, slightly higher than this year's projection of 4.7 percent, and pencilled in a very modest improvement in exports.\n\n\"Domestic demand will anchor growth with the external sector expanding moderately against the backdrop of a challenging global environment,\" the government said in its Economic Outlook report, released along with the second budget of Prime Minister Mahathir Mohamad's ruling coalition.\n\nThe government budgeted 297.02 billion ringgit ($70.85bn) in spending for 2020, six percent lower than the 316 billion ringgit ($75.49bn) earmarked for this year.\n\nRevenue is forecast at 244.53 billion ringgit in 2020, down 7.1 percent from this year's projection. Unlike this year, there will be no repeat of a 30 billion ringgit ($7.1bn) one-off payout to the government by state energy firm Petronas.\n\nThe government's operating budget will drop sharply to 241.02 billion ringgit ($57.5bn) next year from 262.26 billion ringgit ($62.6bn) allocated for this year.\n\nBut development spending will expand to 56 billion ringgit ($13.37bn) from 53.7 billion ringgit ($12.83bn) in 2019, to fund the government's plan to boost economic activity, invest in education and training, and \"revitalise public institutions and public finances\".\n\nAnalysts had expected the government to unveil an expanded budget overall, but it is grappling with a 1 trillion ringgit ($238.9bn) debt pile left behind by its predecessors, limiting its room to manoeuvre.\n\nIn an accompanying fiscal outlook report, the government said it would also set aside an additional 3 billion ringgit ($716.7bn) to speed up ongoing major infrastructure projects.\n\nFinance Minister Lim Guan Eng had flagged it would be a \"challenge\" to meet its earlier deficit target for 2020, due to uncertainties tied to the protracted Sino-US trade war.", "description": "Analysts say the US-China trade war and protectionist policies around the world will drag on the export-reliant country.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/11/54873fccfa6f4bfdb43c0b7f628cd1c0_18.jpg", "published_at": "2019-10-11"}