{"pub": "businessinsider", "url": "https://businessinsider.com/how-to-know-if-your-relationship-is-moving-too-fast-2019-10", "downloaded_at": "2019-10-09 01:02:00.531048+00:00", "title": "5 questions to ask yourself to determine if your relationship is moving too fast", "language": "en", "text": "When you're navigating a brand-new relationship, it's easy to get caught up in the excitement of it all before realizing things are moving too quickly.\n\nThough committing to another person is a fulfilling experience, there are ways to tell if you should take a step back and slow down, Rachel Sussman, a New York City-based therapist, told Insider.\n\n\"We should take our time to know a person and make sure they are who they appear to be,\" Sussman said. She added that trust is earned over time and through experience, so rushing into something won't allow trust to form naturally.\n\nThese are the questions to ask yourself if you think your new relationship may be moving too fast.\n\nHow many dates do you go on each week?\n\nWhile going on dates is a great way to get to know someone, Sussman said that planning too many get-togethers can be a sign that you're moving too fast.\n\nConstantly being in contact with a potential partner could be a sign things are moving too fast. Shutterstock\n\n\"You want to be able to process it and think about that person after the date, and miss them even,\" Sussman said, adding that going on lots of dates in a short time span won't allow for that processing period. She recommended one date per week when you're just starting to see a new person.\n\nHow often do you text or call each other?\n\nConstantly being in contact with a potential partner could also be a sign things are moving too fast.\n\nRead more: How to know if someone is a serial cheater or if they've actually made a mistake, according to a therapist\n\nSussman said you shouldn't be afraid to lessen the frequency of texting, calling, or emailing if you feel overwhelmed. On the other hand, if you feel like you have to be in constant contact because you're worried the person will lose interest or refuse to commit to you, it's time to reevaluate your relationship with them, Sussman said.\n\nTo better understand a person's level of commitment, you can look for signs that suggest they aren't serious about the relationship. These signs include never introducing you to their family or friends, not following through with plans, and refusing to talk about the future, Insider previously reported.\n\nYou shouldn't be afraid to lessen the frequency of texting, calling, or emailing if you feel overwhelmed. Getty Images\n\nHave you met their parents or discussed moving in together?\n\nWhile meeting a person's family and friends is an important step in a new relationship, Sussman said doing so too soon could raise some red flags. Before you meet your partner's inner circle, you should establish a close connection with them and clearly define your relationship status. The same rule applies when you're thinking about cohabitation.\n\nRead more: The 5 steps all couples need to take if they want to repair their relationship after cheating\n\nOne March 2012 study looked at more than 3,000 married men and women and found that those who dated long enough to define their relationship status and long-term commitment to each other were more satisfied once they moved in together compared with those who figured out where their relationship was going after they cohabited.\n\nSussman generally tells people to give it about three months before meeting parents and friends. \"If you had three dates and they're like, 'My parents are in town, want to meet?' It's too early,\" Sussman said.\n\nWhen it comes to moving in together, you shouldn't even consider the prospect until you've both discussed finances, know each other's close friends and family, and feel comfortable doing embarrassing things around each other, Insider previously reported.\n\nHow long ago was your last relationship?\n\nIf your new relationship is following another relationship you recently ended, it could be a sign you need to slow down. There is no specific amount of time you should take between relationships, but you do need to come to terms with why your relationship ended and resolve any feelings (both positive and negative) you have about your ex, Susan Winter, a New York City-based relationship expert, previously told Insider.\n\nIf your new love interest won't stop telling you how much they want to hit a major milestone with you, and it makes you uncomfortable, that's a red flag. Shutterstock/Dodokat\n\n\"Take it slow because if you fall for someone, they can end it at any time,\" Sussman said. \"Ask yourself if you're in a space to handle that.\"\n\nHow far in the future are you planning your lives together?\n\nIt's one thing to know you want to eventually get married and have children, but planning your life with someone you are only starting to know could be a sign you need to reevaluate how quickly your relationship is moving.\n\nRead more: The 2 types of difficult conversations all couples should have before marriage\n\nIn the same vein, if your new love interest won't stop telling you how much they want to buy a house or hit another major milestone with you, and it makes you uncomfortable, that's a huge red flag.\n\nIf you notice yourself or your partner are showing any of these signs, it's not too late to slow things down. Encouraging yourself and your new partner to take a lot of time for yourselves, set boundaries, and even see a therapist could help you keep your relationship on a slow but steady pace.", "description": "A new relationship can be exhilarating, but moving too fast can cause you to overlook who the person really is.", "authors": ["Julia Naftulin"], "top_image": "https://image.businessinsider.com/5d93afc42e22af673c73ef86?width=1200&format=jpeg", "published_at": "2019-10-08"}