{"pub": "yahoo", "url": "https://news.yahoo.com/gop-sen-johnson-says-trump-200623931.html", "downloaded_at": "2019-10-05 23:04:04.988491+00:00", "title": "GOP Sen. Johnson says Trump blocked Ukraine aid", "language": "en", "text": "WASHINGTON (AP) A Republican senator said Friday he learned from a U.S. ambassador that President Donald Trump was tying military aid for Ukraine to an investigation of the 2016 election. But when the senator asked Trump if he could assure the Ukraine leadership the money would be coming, the president blocked him from carrying that message.\n\nSen. Ron Johnson of Wisconsin, a leader of the Senate's Ukraine caucus, made several trips to the Eastern European ally this year after the election of President Volodymyr Zelenskiy. He told the Wall Street Journal that Gordon Sondland, the U.S. Ambassador to the European Union, told him the Ukraine aid, which is part of the country's defenses against Russia, was being linked to Trump's desire to have Zelenskiy's team investigate the 2016 U.S. elections.\n\nSeparately, Johnson told reporters in Sheboygan, Wis., that Trump had blocked his suggestion that he carry a message to Ukraine's president assuring him that U.S. military aid was on the way.\n\n\"I was surprised by the president's reaction and realized we had a sales job to do,\" Johnson told reporters.\n\nThe senator's remarks fill in more details about events at the heart of the Democrats' impeachment inquiry. The probe deepened this week with the release of text messages in which Sondland and other diplomats tried to broker a meeting between Trump and Zelenskiy, on the condition that Ukraine open an investigation into a gas company where Joe Biden's son had served on the board.\n\nJohnson has largely stood by Trump and told reporters in Washington last week that he thinks the whole complaint against the president, sparked by a government whistleblower's allegations, has been \"blown way out of proportion.\"\n\nThe senator told Washington reporters last week that he briefed Trump before and after the Ukraine visits and understood the president's desire to root out corruption that has long plagued the Eastern European ally. He also agrees with Trump's desire to have NATO allies contribute more money toward their security.\n\n\"I'm completely sympathetic with President Trump wanting to get the truth, where did this Russia narrative begin?\" Johnson said about the 2016 election.\n\n\"I take what President Trump is saying at face value,\" said Johnson, who's leading some of those investigations, including calling on the Justice Department to probe a Ukrainian company affiliated with Biden's son. He said Trump is \"concerned about corruption and continues to say European allies need to step up.\"\n\nJohnson was among those who traveled to Ukraine in May, with Energy Secretary Rick Perry, for Zelenskiy's inauguration after Vice President Mike Pence was unable to make the trip.\n\nOn his return, Johnson joined others to brief Trump in the Oval Office.\n\nJohnson recalled Friday that he and others were confident in the new Ukrainian president and wanted to share their enthusiasm with Trump.\n\n\"We were trying to encourage the president to show a great deal of support\" in backing the new leader, he told reporters in Wisconsin.\n\nAhead of his next trip to Ukraine, in September, he told the Wall Street Journal he was informed by Sondland of the tie-in to the military aid.\n\n\"At that suggestion, I winced,\" Johnson told the Journal. \"My reaction was: Oh, God. I don't want to see those two things combined.\"\n\nSondland would have known what was under way. It was about that time, in August, that the top diplomat and two others were scrambling to prevent their attempt to broker a meeting between Trump and Zelenskiy spiral into a quid-pro-quo for the military aid, according to text messages released by the chairmen of the House oversight committees in the impeachment inquiry.\n\nJohnson said that in a call with Trump the next day he tried to convince the president to let him tell Zelinskiy the military aid would be coming but was rebuffed.\n\nRepublicans has been reluctant to break with Trump, and Johnson also suggested he was standing by the president.\n\n\"I certainly understood President Trump had real concern about corruption in general,\" Johnson said Friday.\n\n\"I'm very sympathetic to the fact what he's been dragged through,\" he said about the 2016 election investigations. \"He'd like to understand what happened.\"", "description": "A Republican senator said Friday he learned from a U.S. ambassador that President Donald Trump was tying military aid for Ukraine to an investigation of the 2016 election. Sen. Ron Johnson of Wisconsin, a leader of the Senate's Ukraine caucus, made several trips to the Eastern European ally this", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/uQUeYxkIpt6wqiZnwi9P_g--~B/aD0yODYwO3c9NDI5MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/f360b145102befc2d3670a3f32eecf0f", "published_at": "2019-10-05"}