{"pub": "npr", "url": "https://npr.org/2019/10/02/764434881/turning-the-tables-celebrating-eight-women-who-invented-american-popular-music", "downloaded_at": "2019-10-02 15:28:19.851048+00:00", "published_at": "2019-10-02", "title": "Turning The Tables: Celebrating Eight Women Who Invented American Popular Music", "language": "en", "text": "Turning The Tables: Celebrating Eight Women Who Invented American Popular Music\n\nYouTube\n\nWhose faces would you put on a musical Mount Rushmore? The question amounts to a facile parlor game, but for the team behind the annual series Turning the Tables – an annual collaboration between NPR Music and Lincoln Center dedicated to recalibrating music history so that underrepresented, overlooked and hidden-in-plain-sight pioneers get their due – it opened up a set of possibilities as wide as a whole mountain range.\n\nThis year, Turning the Tables focused on music's \"founding mothers,\" eight women without whose contributions jazz, blues and myriad other musical styles would be unrecognizable: Bessie Smith, Billie Holiday, Maybelle Carter, Marion Anderson, Ella Fitzgerald, Mary Lou Williams, Celia Cruz and Sister Rosetta Tharpe. Over eight weeks, NPR Music shared essays, videos and reported stories illuminating the rich histories of these women. The season-opening concert produced by Jill Sternheimer and the team at Lincoln Center Out of Doors was itself an historic occasion bringing together three generations of stellar musicians and writers.\n\nMusical director Terri Lyne Carrington, herself well on the way to legend status via her own compositions and dazzling drumming, assembled a band that navigated from the Appalachian country of the Carter Family to \"Guantanamera,\" the unofficial Cuban anthem and a favorite of salsa pioneer Cruz. The night's mood ranged from down and dirty to sacred and funky to dramatic and somber as some of the best singers working today shared the microphone on some of the finest songs in the American repertoire. Lizz Wright stunned with her meditative version of \"Strange Fruit.\" Rhiannon Giddens got everyone dancing with the gospel roof-raiser \"Up Above My Head.\" Americana's rising star Courtney Marie Andrews shared the program with the venerable jazz pianist Amina Claudine Myers. With something for everything, from Charenée Wade's savvy spin on \"Cotton Tail\" to Valerie Simpson's no-holds-barred breakdown on Bessie Smith's \"Send Me to the 'Lectric Chair,\" the concert showed that women indeed laid the floorboards upon which we all dance.\n\nFeatured performers: Courtney Marie Andrews, Rhiannon Giddens, Xiomara Laugart, Valerie Simpson, Charenée Wade, Lizz Wright.\n\nBand:\n\nLea-Lorién Alomar (voice)\n\nGerardo Contino (voice)\n\nTerri Lyne Carrington (drums and bandleader)\n\nJeremy Bosch (flute)\n\nTanya Darby (trumpet and backing voice)\n\nLakecia Benjamin (saxophone and backing voice)\n\nEdmar Colón (saxophone, piano and backing voice)\n\nFelicia Collins (guitar)\n\nAdam Rogers (guitar)\n\nJon Cowherd (keyboard and piano)\n\nAlex Tosca Laugart (piano)\n\nBen Williams (bass)\n\nCrystal Vargas (percussion)", "description": "This year, Turning the Tables focused on music's \"founding mothers.\" Watch the season-opening concert at Lincoln Center Out of Doors, featuring Rhiannon Giddens, Lizz Wright and more.", "authors": ["Ann Powers"], "top_image": "https://media.npr.org/assets/img/2019/09/30/fullcut_thumb03_wide-913583cb50678678f299d31f470fa43665a95eb3.jpg?s=1400"}