{"pub": "americanconservative", "url": "https://lifesitenews.com/news/judge-rules-dad-will-have-say-in-gender-transition-of-7-year-old", "downloaded_at": "2019-10-25 21:57:53.463544+00:00", "title": "Judge rules dad will have say in gender ‘transition’ of 7-year-old", "language": "en", "text": "NewsFreedom, Gender, Politics - U.S.\n\nDALLAS, Texas, October 24, 2019 (LifeSiteNews) – The judge presiding over the case of Jeffrey Younger, the father who is trying to protect his seven-year-old son, James, from chemical castration via a gender “transition,” ruled today that the parents will have joint conservatorship over James, which includes making joint medical decisions for the child.\n\nJudge Kim Cooks of the 255th district also put a gag order on both parents so that they cannot speak to the press about the case and decided that the father is not required to pay attorney fees. The judge’s decision means that the Save James website will have to be shut down.\n\nMr. Younger and his ex-wife, Dr. Anne Georgulas, were in court last week fighting over custody and decision-making abilities for James and his twin, Jude. Dr. Georgulas wants to continue to “transition” James “into” a girl called “Luna.” Mr. Younger wanted to take a “wait and see” approach rather than start the child on puberty blockers.\n\nEleven out of 12 jurors decided Monday that Mr. Younger should not be granted Sole Managing Conservatorship over his twin boys. Dr. Georgulas admitted in court she is not actually the twins’ biological mother and used in-vitro fertilization via an egg donor to gestate them.On Monday, a jury ruled 11-1 that the current Joint Managing Conservatorship should be replaced by a Sole Managing Conservatorship – and that Mr. Younger should not be that person.\n\nJudge Cooks’ ruling was originally scheduled for Wednesday afternoon but was delayed. When a seasoned civil court journalist from the Dallas Morning News asked the court clerk for the ruling schedule and provided her with the specific case number, she confirmed the day but refused to share the time of the ruling.\n\nSince kindergarten, Dr. Georgulas has enrolled James in school as a girl under the name “Luna.” She began telling him he’s a girl when he was just three, and testified in court that she began to believe that when he liked a McDonald’s toy meant for girls. James’ pediatrician records also indicate Dr. Georgulas has met with GENECIS, a medical “transition” clinic in Dallas and is considering “hormone suppression” when James is closer to eight or nine years old.\n\nWatch this exclusive video with Jeffrey Younger given right before the judge issued the gag order:\n\nPrior to this case, Dr. Georgulas had exclusive rights to make decisions regarding psychological and psychiatric care for James and Jude. She needed to inform Mr. Younger of her decisions, but he couldn’t weigh in on or change the decisions. GENECIS wouldn’t begin James on puberty blockers without Mr. Younger’s consent.\n\nDr. Georgulas and Mr. Younger’s messy custody dispute entailed, in part, the latter filing a counter-petition to the court requesting sole managing conservatorship in order to obtain the ability to make decisions on psychological and psychiatric care. This would have given him the ability to prevent James’ from starting puberty blockers or cross-sex hormones.\n\nMr. Odeneal told supporters that an appeal “takes about a year” and it would be very difficult to overturn a jury ruling.\n\nThere were only three news agencies present throughout the trial: LifeSiteNews, The Texan, and Channel One (a Russian News Agency). After the jury ruling, the public outcry has been immense. Blogger Matt Walsh started the hashtag #protectjamesyounger on twitter. It has been used in tweets over 41,000 times. Additionally, other conservative news agencies are beginning to pick up the story.\n\nA petition created by LifeSiteNews in support of Jeffrey Younger’s efforts to protect his son from being transitioned into a girl has been signed by over 65,000 people.\n\nFollow all LifeSiteNews coverage of the James Younger case here.\n\n_____\n\nFamily court records aren't easily accessible like those of civil court – journalists must be there or \"be square.\" Because of the financial support from our readers, we have been able to be in the courtroom reporting on this important case. If you would like to invest more deeply in our pro-life and pro-family reporting by helping to cover the costs of sending our journalists to report on-the-ground, at a moment's notice, on important stories like this, please consider making a donation today. Click here to donate now. If you would like to support our efforts on a monthly basis to provide this kind of coverage 365 days a year, click here.", "description": "The judge ruled today that James Youngers parents will have joint guardianship over him, which includes making joint medical decisions.", "authors": ["Madeleine Jacob"], "top_image": "https://assets.lifesitenews.com/images/made/images/remote/https_www.lifesitenews.com/images/local/Jeff_Younger_with_James_1024_512_75_s_c1.jpg", "published_at": "2019-10-24"}