{"pub": "washingtonpost", "url": "https://washingtonpost.com/entertainment/theater_dance/these-dance-influencers-are-taking-center-stage-online/2019/10/17/82bc95f0-ef87-11e9-b2da-606ba1ef30e3_story.html", "downloaded_at": "2019-10-20 23:25:26.572363+00:00", "title": "Janet Jackson hired her as a backup dancer. Instagram made her a star.", "language": "en", "text": "And it’s no longer in the background.\n\n\n\nTouring as a backup dancer for an artist like Jackson or Justin Bieber used to be a commercial dancer’s dream. Now, that kind of work is a steppingstone to an even bigger prize: a robust social media account.\n\nDancers who break through on Instagram, YouTube and TikTok, the relatively new app for short videos, can reap personal, artistic and financial rewards far beyond the paychecks for executing someone else’s moves and pounding the stage behind a pop star. Internet popularity can be a dancer’s entree to choreographing and starring in her own viral videos, traveling the world as a guest artist and teacher, and inking lucrative brand deals and endorsements.\n\n\n\nAD\n\nAD\n\n“It used to be that your résumé was a sheet of paper that you would hand in at auditions,” says Hatala, who specializes in hip-hop and is known as @tayd_dance on Instagram. “Now it’s our social media. My Instagram is my résumé, and my Twitter is my résumé. . . . People say, ‘We saw your Instagram and this is why we wanted you.’ ”\n\nUnlike many dance influencers, who live in this sunny mecca of production studios and agents, Hatala’s home is Edmonton, Alberta, in Western Canada, with her parents and younger sister, Reese, a dancer who also has a growing social media following. Of course, an Instagrammer needs little more than the camera on her phone and some clear floor space to record her videos, so location doesn’t matter much. Still, Hatala comes home from school a couple of times a month to hear her mom announce that they’re off to Los Angeles, right away, for a job.\n\n\n\nShe was here recently to shoot a promo for the Netflix movie “Tall Girl.” Hatala and her mother, Teresa, stopped in at a North Hollywood dance studio early one morning for an interview and a hip-hop-animation demo before heading to the airport. Tall and willowy, Hatala is a powerful dancer with a refined quality, every move beautifully clear, whether it’s a sharp pop or the flutter of an arm like a breath of wind.\n\nAD\n\nAD\n\nWhen she speaks, she’s disarmingly open. There isn’t much about her world that she hasn’t analyzed.\n\nHer life is “chaotic,” she says, and she loves it. But like most dancers, Hatala is a perfectionist. This puts her in a bind with the ethos of her era.\n\n“Sometimes I stress out about it because in our generation, if something doesn’t interest you in the first two seconds, you scroll past it,” she says. “I have a constant battle with it, because everything I put out I want to be perfect. I want to be proud of it.\n\n“But at the same time, personally, I appreciate dancers who are raw over their social media. And it’s important to me to still show my fans that I am human. I’m not fake. I make mistakes and I mess up as a dancer.”\n\nThere you have the key issues for these young performers to juggle: How to hook their fans. How to keep luring new ones. How to post top-notch, original work five or more days a week. How to balance awesomeness and relatability, the chief currency to a digital audience. That’s especially true at the younger end of the millennial spectrum, those 18- to 25-year-olds — so coveted by marketers, so difficult to reach — who want to see themselves in their heroes.\n\nAD\n\nAD\n\n“Everyone in this industry is trying to figure out what goes viral,” Hatala says with a sigh. “Most of the time the videos that I put the hardest work into only get so many views. And a lot of the videos that have gone viral have just been, literally, me dancing and having so much fun in the studio, not expecting anything out of it. Or just with my dad and his phone.”\n\n“You have to stay on top of it,” she adds. “You have to be looking at your insights, and just see what your followers like.”\n\nStaying on top in the digital landscape is more art than science, even though science can help. Analytics show what demographic they’re reaching, where their fans are, what posts keep their attention.\n\nAD\n\n“They’re the first generation of dancers that combine the pixie dust and the data,” says Larry Shapiro, chief executive of Ensemble Digital Studios, an artist management company. Among his clients is Kaycee Rice, a 17-year-old hip-hop dancer with fierce energy and extraordinary flexibility. She has more than 2 million Instagram followers and two YouTube channels, where, she says, she gains 200 to 500 subscribers a day.\n\nAD\n\n“The difference between Paula Abdul at her start and Kaycee Rice is that Kaycee analyzes the data behind her videos, like engagement and retention rate,” Shapiro says.\n\nThis means that Rice can get the brands that sponsor her — Nike, Under Armour and others — before more eyeballs.\n\nAD\n\n“You have an entire generation around the world who identifies with her,” Shapiro says. “Kaycee is reaching 13- to 18-year-old kids and shaping what kind of entertainment they like. So when she grows up and produces bigger projects, she’ll have fans whose values she’s shaped.”\n\nThat’s a lot of power in these dancers’ hands. Industry experts see them changing the music industry, too, as the public appetite for dance grows across social media. Once upon a time, record labels insisted that dancers take down videos they had created without getting permission to use the music. That impulse has evolved, says John Shahidi, who runs Shots Studios, an Internet talent management company.\n\nAD\n\nOne of his clients is Delaney Glazer, 23, a dancer who toured with Bieber and now posts short dance videos for her 1.4 million followers on Instagram (who know her as @deeglazer) and makes longer, high-quality ones for her YouTube channel, often with a narrative arc and shot on locations around Los Angeles.\n\nAD\n\n“Every week we get one or two songs from a label saying, ‘What can Delaney do with this?’ ” Shahidi says. “They’re looking at social media creators as a platform. Instead of asking us to take it down, they’re embracing us.”\n\nInfluencers in general tend to have a bad reputation — all flash and no substance. “The word ‘influencer’ confuses people,” says Glazer, who likes to think of herself as “using dance to bring life and happiness and energy, instead of just products.”\n\nIndeed, social media’s dance stars defy the judgment of shallowness. To start with, their skills look superhuman. Their talent is obvious and easy to appreciate.\n\nAD\n\nYou don’t have to be a connoisseur to admire, for instance, KidatheGrea t’s effortless popping moves in the videos he makes with his buddies. He shoots them in his kitchen. His Instagram posts are like little dance parties, where the cool kids are hanging out between the stove and the sink. Their relaxed vibe is irresistible. (Fair warning: The song lyrics aren’t always G rated.)\n\nAD\n\n“The kitchen, it’s perfect for dance,” says Kida, 17, whose full name is Leon Burns. “And my gut told me just do it. Just stay in the kitchen.”\n\nHe whips up the choreography in about 15 minutes.\n\n“I ask my friends, ‘What song are you guys feeling right now?’ ” he says. “I come up with the song literally minutes before they get to my house, and then we make the magic.”\n\nIn 2016, Kida was the Season 13 winner of the Fox show “So You Think You Can Dance.” He also has toured with Usher, performed in Chris Brown’s “Party” video and traveled the world teaching master classes. But strange as it may seem, dancing in his kitchen is how he supports his family.\n\nAD\n\nAD\n\nSince his SYTYCD win, Kida has amassed nearly 4 million followers on Instagram. Experts say that number can translate into five and six figures per product deal.\n\nIt’s about time, says the dance community, which has been historically undervalued everywhere, even in the glamour world of Hollywood and television.\n\n“I’ve seen the millions of dollars that many of these dance influencers can earn,” says Aris Golemi, a ballet-dancer-turned-agent and founder of Xcel Talent Agency and Dance Influencers, a global platform. “I represented one dancer who made $9,000 just posting a selfie with a watch.”\n\nGolemi had a breakthrough eight years ago when his client Marquese Scott — soon to be one of the biggest dancers on social media — created an iconic solo video, where his body seemed to melt and reform with every measure, to the song “Pumped Up Kicks.”\n\nAD\n\n“We ended up traveling the world, making all this money with Google and YouTube,” Golemi says. “I could have 10 dancers working with Taylor Swift for a week and we wouldn’t make that kind of money. I never thought that would be possible with just dancing. But social media changed everything.”\n\nThe independent, inspiring spirit of these dancers is a big part of their appeal. What they offer their audience is individual creativity, sometimes loud and raw, or goofy and sweet, sexy and strong, with a heavy beat.\n\n“I don’t want to wait for an artist to hire me. I want to be my own artist,” says James Derrick, known as @Bdash_2. A former competitor on NBC’s “World of Dance,” he has a unique, exquisitely smooth style that blends krumping, popping and animation. At 30, he’s an outlier among the younger set of influencers and doesn’t have as many followers — his hover around 300,000 on Instagram, more on TikTok. Still, he’s making money on a few product deals. More important, Bdash is a prime example of the layered creativity that’s possible for dancers in the digital realm. He creates his own music, and aspires to build his following as a musical artist/dancer.\n\n“With these platforms, at the end of the day you don’t need a label, all you need is fans,” Bdash says. “That’s why social media is golden for people like us, because you can become an artist without anyone holding us back and telling us what to do.”\n\n“Dancers get done wrong,” he says, recalling the time he was called to shoot a TV commercial and ended up waiting around for six hours, only to be told he wasn’t needed after all.\n\n“That’s how they look at us. I wanna change that, ’cause it’s not cool. So you’ve got to have people like me and the others say, ‘We’re stars, too.’", "description": "How teenagers Taylor Hatala, Kidathegreat, Kaycee Rice and others are changing how we see and think about dance in the digital age.", "authors": ["Sarah L. Kaufman", "Dance Critic Covering Arts"], "top_image": "https://www.washingtonpost.com/resizer/2xZLEcnoEEInFbzrxr0FUokEz2U=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MFWYVVHLSYI6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-17"}