{"pub": "investing.com", "url": "https://investing.com/news/economy/treasury-yield-curve-may-be-back-to-normal-but-us-economy-is-not-2001327", "downloaded_at": "2019-10-22 15:40:02.900524+00:00", "title": "Treasury yield curve may be back to normal but U.S. economy is not", "language": "en", "text": "Treasury yield curve may be back to normal but U.S. economy is not\n\nBy Jonnelle Marte\n\nNEW YORK (Reuters) - A closely watched part of the U.S. bond market that is widely viewed as a recession indicator has recently stopped flashing red. But investors and economists say the economy is still not in the clear.\n\nThe so-called \"inverted yield curve,\" in which yields on short-term bonds are higher than those on long-term bonds, reverted back to normal on October 11. The shift could be interpreted as a sign that investors are feeling more optimistic about the economy.\n\nBut there are also some technical reasons for the move, leading some experts to caution that the economy may still be fragile.\n\n\"There's no guarantee that we are in the safety zone,\" said Nikol Hearn, a macro strategist with TS Lombard. \"There's so much that can happen within the next few years.\"\n\nRECESSION WATCH\n\nYields on longer-term bonds are usually higher than those on shorter-term bonds because investors generally demand to be paid more for locking up their savings for longer periods.\n\nSometimes, the yields on long-term bonds are lower than yields on short-term bonds. That inversion is often viewed as a sign that investors are so worried about the future that they are willing to hold long-term bonds, which are usually viewed as a safer alternative to stocks and other investments, even when the payouts are low.\n\nIt's not just the upside-down yields that spook investors, it's what happens next. The yield curve has inverted before every U.S. recession since 1955, although sometimes the inversion happens a few years before the start of a downturn.\n\n(Graphic: The spread between 3-month and 10-year Treasuries, https://fingfx.thomsonreuters.com/gfx/mkt/12/7679/7610/Pasted%20Image.jpg)\n\nThat correlation has put some investors on high alert over the past year as various parts of the yield curve have inverted, then steepened and reverted again.\n\nIn late May, yields on 3-month Treasury bills began to exceed yields paid by 10-year Treasury bonds -- sounding the alarm in a part of the yield curve that was found to be the most \"reliable\" predictor of recessions, according to research published last year by the Federal Reserve Bank of San Francisco.\n\nCAUTIOUS OPTIMISM\n\nThe yield curve between 3-month and 10-year Treasuries stayed inverted until October 11, when greater optimism about the global economy led to a slight increase longer-term yields.\n\nU.S. and China trade negotiators said that day that they are working on a \"Phase 1\" trade deal, increasing the chances that tensions between the world's two largest economies could improve. Days later, British Prime Minister Boris Johnson introduced a Brexit deal package with the European Union, which still needs parliament approval.\n\nStrategists point out that negotiations on both of those fronts are still ongoing.\n\n\"Recent developments have served to lift the fog of uncertainty,\" said Mark Cabana, head of U.S. rates strategy at Bank of America Merrill Lynch (NYSE: ). Still, he said the uncertainties are still there, and that they are making businesses and consumers nervous about making big investments.\n\nA drop in retail sales and a contraction in manufacturing are also raising worries about a slower U.S. economy.\n\nFED FACTORS\n\nAnother driver of the recent shift in the yield curve has little to do with what investors expect from the economy and more to do with what they expect from the Federal Reserve. On Oct. 11, the Fed announced that it would start buying $60 billion a month in short-term Treasury bills to increase liquidity in money markets.\n\nThose purchases are increasing prices for short-term bills and lowering their yields, analysts say, with yields falling when prices rise and vice versa.\n\nThat drop on the short end, combined with a rise in yields on the long end, caused the yield curve to steepen, said Tendayi Kapfidze, chief economist for LendingTree. The shift is a reminder that movements in the yield curve can happen for reasons unrelated to economic outlooks, he said.\n\nAnother factor that may have contributed: overseas investors. Many are turning to Treasury bonds to seek refuge from negative bond yields in countries such as Germany and Japan, and that is pushing down yields on long term Treasury bonds, said Gregory Daco, chief U.S. economist for Oxford Economics.\n\nIt is worth noting that the yield curve does not have to stay inverted to be a precursor to a recession, since yield curves can often steepen after signs of a downturn become clear and the Fed starts to cut interest rates.\n\nAfter inverting during the summer of 2006, the yield curve reverted back to positive during the spring of 2007 and stayed that way throughout the Great Recession. The yield curve also steepened shortly before the start of the 2001 recession.\n\nFed officials will be factoring the yield curve in to varying degrees when they meet Oct. 29-30 to chart the course for future monetary policy.\n\nSan Francisco Fed President Mary Daly said last week that any warning sign delivered by the yield curve may not be as reliable as it used to be in this low-rate environment.\n\n\"I'm cautious of saying, this time is different,\" Daly told reporters in Los Angeles on the day that the Fed began purchasing T-bills. \"But I think that's a factor where these small perturbations around a normal yield curve may not be as informative as they once were.\"", "description": "Treasury yield curve may be back to normal but U.S. economy is not", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/indicatornews_1_800x533_L_1413124982.jpg", "published_at": "2019-10-22"}