{"pub": "atlantic", "url": "https://theatlantic.com/entertainment/archive/2019/10/julie-andrews-memoir-home-work-tells-hollywood-story/600031", "downloaded_at": "2019-10-16 13:37:27.679426+00:00", "title": "The Charming Candor of Julie Andrews’s New Memoir", "language": "en", "text": "Looking back at her career now, Andrews, who’s 84, told me in October—when she called from her home in Long Island to discuss Home Work—that what surprises her most is how arduous it all was. “What I learned from writing the book was how hard I was working on any given day, whether I was doing the movie or learning the choreography or perfecting something or doing a costume fitting,” she said. Andrews has lived in the U.S. now for longer than she lived in England, but her diction is still markedly precise and she occasionally blesses humble words with more syllables than they typically get to contain. (Hawaii is pronounced huh-why-YEE, while “mum” is thrillingly continuant, like mumm.) Andrews is a dame of the British Empire, an Academy Award winner, an author with what she describes as a “small, you know, imprint,” and No. 59 on the BBC’s polled list of the 100 Greatest Britons, 11 spots ahead of Jane Austen. At this point in life, she’s settled into her status as one of the most regal, gracious, and reassuring presences in entertainment, serenely embracing “dear Lady Gaga” onstage at the 2015 Oscars, and spoofing her own reputation by voicing the cruel matriarch Marlena Gru (“the worst lady I’ve ever played”) in the Despicable Me franchise. What she wants to make clear now isn’t that Mary and Maria were characters, but that they were work.\n\nHome Work, her second memoir (this one co-published with her eldest daughter, Emma Walton Hamilton), is an account of what happened between Andrews’s film debut in 1964’s Mary Poppins and her performance in the 1982 movie Victor/Victoria. The motivation for the book, Andrews told me, was twofold. After the 2008 publication of her first memoir, Home, which detailed her difficult childhood and her earliest days as a performer, fans and friends had urged her to dive into the next phase. “The first one ended as I was heading to Hollywood,” she said, “so of course everybody said, ‘When, when, when are you going to do the next one?’ Because they wanted to hear all that.” Home, in other words, ended right before the moment when Andrews took the role that would change her life.\n\nThe book is a dance between candor and diplomacy, as Andrews navigates the imperative of honesty with the courteousness that seems to be her governing instinct. Implicit in the book’s title is a reminder: For most of us, Mary Poppins and Maria von Trapp are pleasures, diaphanous cultural entities, but for Andrews, they were jobs—demanding, exhausting work. The steel panels of the harness Andrews wore to film flying scenes for Mary Poppins left her hips badly bruised, and in one scene, the wires suspending her failed, leading to a catastrophic fall. For the opening scene of The Sound of Music, in which an aerial camera swoops in from above over verdant alpine scenery to reveal Andrews’s Maria, the shot was captured from a helicopter, and every time it completed a take and rose up to return to its original position, the downdraft from the engine flung Andrews to the ground. “I’d haul myself up, spitting mud and grass and brushing it off my dress, and trek back to my starting position,” she writes. “Each time the helicopter encircled me, I was flattened again.”", "description": "In Home Work, the legendary actor comes to terms with an acting career she couldn’t always control.", "authors": ["Sophie Gilbert"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/GettyImages_1171944229/facebook.jpg?1571155963", "published_at": "2019-10-16"}