{"pub": "bbc", "title": "Proms 2019: Shanghai Orchestra plays Hey Jude in their debut performance", "url": "https://bbc.com/news/entertainment-arts-49549383", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:56:27.465450+00:00", "text": "Media playback is unsupported on your device Media caption Shanghai Symphony Orchestra plays Hey Jude\n\nChina's oldest symphony orchestra played their first ever BBC Prom on Sunday, and brought along a \"little gift\" for the audience.\n\nAfter playing pieces by Rachmaninov and Mozart, the Shanghai Symphony Orchestra launched into a raucous version of The Beatles' Hey Jude in a surprise encore.\n\nConductor Long Yu encouraged Prommers to sing along, which they did, before giving the players a standing ovation.\n\n\"We're very happy,\" said Yu. \"Please accept our warm wish from Shanghai.\"\n\nThe concert marked the end of the orchestra's 140th anniversary tour, which began in the US three weeks ago.\n\nFounded in 1879 as the Shanghai Public Band, it is one of China's most successful symphony orchestras, touring extensively and appearing on several film soundtracks, including the Oscar-winning Crouching Tiger, Hidden Dragon.\n\nIt has been re-energised and re-vitalised since Long Yu's appointment in 2009.\n\nIn his first year, he replaced a quarter of the orchestra after international blind auditions held in New York, saying he intended to impose \"international standards\" on its players.\n\nSince then, the orchestra's formerly flagging international profile has been restored, and they recently played at the Switzerland's Lucerne Festival, Amsterdam's Concertgebouw and the Edinburgh Festival.\n\n\"Every year there's been improvement,\" bassoonist Timothy Chen told the BBC. \"There's been more depth in the orchestra until we've reached a level where we can be comfortable playing at a venue like BBC Proms. It's really exciting to be a part of that.\"\n\n'Tragic and lonely music'\n\nYu's ambition for the orchestra is to draw on both Eastern and Western musical culture, inspired by Shanghai's openness to outside influences.\n\n\"Shanghai is a very mixed-feeling city, \" he told Radio 3, \"somewhere between a Chinese and European-feeling city.\"\n\nLast year, the orchestra signed a deal with the renowned Deutsche Grammophon label, and recently released the first in a series of albums featuring works by important Chinese composers.\n\nIt included Qigang Chen's Wu Xing (The Five Elements), with which they opened their Proms performance on Sunday morning; followed by Mozart's piano concerto 23 in A major.\n\nFor the latter, they were joined by 21-year-old pianist Eric Lu, who won the 2018 Leeds International Piano Competition.\n\nImage copyright Chris Christodoulou Image caption Eric Lu was born in New York and has family connections in Shanghai\n\n\"This is a piece I grew up with, listening from a child,\" he told BBC Radio 3, \"so it's really meaningful to me to be able to perform it as my first time at the Proms.\n\n\"The second movement is... really deeply tragic and lonely music. It's so beautiful, it can make you cry.\"\n\nAfter a brief interval, the orchestra showcased their virtuosity with an expressive version of Rachmaninov's Symphonic Dances; illuminated by Liu Zhongping's incandescent saxophone solos.\n\nThe surprise encore exemplified the orchestra's East-meets-West philosophy, opening with Jasmine Flower, a traditional Chinese song that dates back to 18th Century, before morphing into a rambunctious interpretation of Hey Jude - and the audience laughed in recognition as Liu Zhongping stood to play the opening melody.\n\nLong Yu described the performance as \"a little gift, dedicated to the UK.\"\n\nThe full concert was broadcast live on BBC Radio 3, and filmed for broadcast on BBC Four this Friday, 6 September.\n\nFollow us on Facebook, or on Twitter @BBCNewsEnts. If you have a story suggestion email entertainment.news@bbc.co.uk.", "description": "The Chinese ensemble play The Beatles' Hey Jude as a \"little gift\" at their first-ever Prom.", "authors": ["Mark Savage", "Bbc Music Reporter"], "top_image": "https://ichef.bbci.co.uk/images/ic/1024x576/p07m81g1.jpg"}