{"pub": "investing.com", "url": "https://uk.investing.com/news/stock-market-news/day-ahead--top-3-things-to-watch-1979868", "downloaded_at": "2019-10-16 23:18:57.191076+00:00", "title": "Day Ahead - Top 3 Things to Watch", "language": "en", "text": "© Reuters.\n\nInvesting.com - Here's a preview of the top 3 things that could rock markets tomorrow\n\n1. Economic Data Deluge Due\n\nWith weaker data reported Wednesday raising some concern that the consumer may not be able to continue to keep the U.S. economy afloat, traders will turn attention to a slew of data on housing, manufacturing and industrial production for further insight into the economic backdrop.\n\nThe Commerce Department will report on housing starts and building permits for September at 8:30 AM ET (12:30 GMT).\n\nEconomists expect that fell 8.6% to an annual rate of 1.320 million last month.\n\nBuilding permits, an indication of future demand, are predicted to show a decline of 5.6% to 1.340 million.\n\nOn the heels of the housing data, the Philadelphia Federal Reserve Bank will release its measure of manufacturing activity in the region. The is expected to have fallen to a reading of 7.3 from 12.0 last month, as manufacturing activity has been dogged by the ongoing U.S.-China trade war.\n\nThe Labor Department, meanwhile, releases its weekly count of people who filed for unemployment insurance last week. Economists forecast that rose to 212,000 from 210,000 previously.\n\nElsewhere, U.S. activity for September due at 9:15 AM ET (13:15 GMT) is expected to have declined 0.1%.\n\n2. Crude Oil Set for Fifth-Straight Weekly Build?\n\nThe petroleum report due Wednesday, will likely prove a timely distraction as the uncertainty around the US-China trade deal has done little to ease investors concerns about falling demand amid a slowing global economy.\n\nThe EIA is expected to report a build in crude stockpiles of 2.88 million barrels for the week ended Oct. 11. Domestic crude inventories have increased for four-straight weeks.\n\nrose 1% to settle at $59.34 a barrel on Wednesday amid hopes that OPEC and its allies will decide to cut output further at a meeting in December;\n\nAhead of the EIA report, the American Petroleum Institute released data - which often serves as an early indication of weekly petroleum levels - that showed weekly crude stockpiles rose by 10.5 million barrels last week, compared with an estimate of about 2.9-million-barrel build.\n\nOil prices moved lower in response.\n\n3. Netflix Earnings Cheer; IBM Results Do Not\n\nAfter Wednesday's close, Netflix (NASDAQ: ) shares moved up more than 8% after the streaming media giant reported that beat estimates. Netflix reported 6.8 million new subscribers. Its estimate of 7.6 million new subscribers in the fourth quarter was lower than the expectation for 9.5 million new subscribers.\n\nThe upside is that the lower estimate wasn't as bad as feared. Netflix faces a host of new video streaming competition from the likes of Walt Disney (NYSE: ), Apple (NASDAQ: ), Comcast (NASDAQ: ) and others.\n\nNetflix) said a fee increase has enabled the company to maintain a stable revenue stream and that's expected to continue.\n\nIBM (NYSE: ), meanwhile, reported $2.68 a share in that beat the Investing.com estimate of $2.67. Revenue was a tad lighter than expected.\n\nShares fell about 4.5% after hours. IBM (NYSE: ) has been slowly building up its cloud-computing offerings and reducing its concentration in its traditional mainframe business.", "description": "Day Ahead - Top 3 Things to Watch", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB6J11A_L.jpg", "published_at": "2019-10-16"}