{"pub": "cbc", "url": "https://cbc.ca/news/politics/ndp-greens-nantel-ferland-1.5284779", "downloaded_at": "2019-09-16 11:59:06.509280+00:00", "title": "NDP recruits former Quebec Green Party leader to take on NDPer who defected to Greens | CBC News", "language": "en", "text": "The NDP has recruited a former leader of the Green Party of Quebec to run against a former New Democrat MP who defected to the Greens.\n\n\n\nÉric Ferland will run in the riding of Longueuil-Saint-Hubert to unseat Pierre Nantel, who left Jagmeet Singh's NDP Party to join Elizabeth May's Greens.\n\nThe tit-for-tat move comes as Green support in opinion polls has swept to near-parity with the New Democrats, as the parties compete for ecofriendly votes on the left.\n\nNantel was first elected to the House of Commons in the NDP \"Orange Wave\" of 2011 and held it by a narrow margin in 2015.\n\nNantel left NDP in August after flirting with Greens\n\nHe was ousted from the NDP in August after the party learned he was talking to the Greens about switching parties. He briefly sat as an Independent.\n\nWhen he joined the Greens, he said May was the only leader willing to tackle the climate change challenge.\n\nHowever, Nantel caused May to face some awkward questions last week when he declared Quebec should become Independent \"as fast as possible.\" When May said he wasn't a separatist, and she wouldn't allow candidates that advocating breaking up the country to run for her party, Nantel told reporters \"of course I'm a sovereignist.\"\n\nEarlier in September, some former New Brunswick provincial NDP candidates and members issued a statement and held a news conference to announce they were joining the Greens and supporting the federal Green Party.\n\nHowever, some of those named in the statement said they had not agreed to the move. The controversy touched off an exchange of accusations between the parties.\n\nEric Ferland led the Green Party of Quebec in the mid-1990s and is set to run for the federal NDP. (Ecosphere)\n\nFerland led the Quebec Greens from 1994 to 1996. He ran unsuccessfully for the federal Green Party in a 1995 byelection and was later elected as a town councillor in Frelighsburg, Que. He also founded his own green technology company, Ecosphere, with the aim of helping communities reduce their environmental footprint.\n\nSingh will make the official announcement of Ferland's candidacy Monday at an event in the riding.\n\nBefore Nantel took Longueuil-Saint-Hubert in 2011, the area was predominately held by the Bloc Québécois.\n\nThe last Conservative to hold the riding was Nic Leblanc, who resigned from the PC caucus after the failure of the Meech Lake Accord and joined the Bloc in 1990.\n\nThe Liberals (who haven't held the riding since the early 1980s) hope to woo voters by running Réjean Hébert, a former provincial cabinet minister for the Parti Québécois, as their candidate.", "description": "Green Party support has surged to near parity with the NDP and the two are fishing in the same vote pool. Now they have, in a sense, swapped candidates in the riding of Longueuil-Saint-Hubert.", "authors": [], "top_image": "https://i.cbc.ca/1.5284817.1568602510!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/nantel-ferland-composite.jpg", "published_at": "2019-09-16"}