{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3069493&cloc=joongangdaily|home|newslist1", "downloaded_at": "2019-10-27 12:54:49.002801+00:00", "title": "Korean carriers begin to export 5G expertise", "language": "en", "text": "Sim Sang-soo, vice president and head of the infra business office at SK Telecom, center, shakes hands with Now Corporation Chairman Thomas Aquino, left, and Now Telecom Chairman Mel V. Velarde, right. [SK TELECOM]\n\nKorea’s three mobile carriers are increasing their presence in the global mobile market following their successful launches of the world’s first commercial 5G networks.SK Telecom on Sunday announced that it has teamed up with the Philippines-based Now Corporation and its affiliate Now Telecom to support its development of a 5G network and pave the way to export solutions based on 5G. Now Corporation is the largest fixed wireless access (FWA) broadband provider in the Philippines.Now Corporation operates businesses in high-speed internet, internet protocol television, software service and business-to-business (B2B) solutions. It has expanded to mobile telecommunications through its subsidiary Now Telecom.As a strategic partner, SK Telecom said it will be offering consulting service on launching and running a 5G network. It will also offer B2B solutions, including in-building solutions for the Philippines firm, according to the SK Telecom.Now Corporation initially intends to use 5G to create a high-speed internet service targeted at FWA users, not mobile users, but SK Telecom hopes to one day expand the service to mobile customers as well.By early next year, SK Telecom plans to establish the roadmap for the 5G network, design infrastructure and offer training on key 5G technologies. After that, SK Telecom will build a commercial infrastructure based on a standalone version of 5G and develop a 5G-based B2B service.“After becoming the first to commercialize a 5G network in the world, we have been actively discussing cooperation in regards to 5G network with foreign companies in Europe and Southeast Asia,” said a spokesperson for SK Telecom in a statement. “We will work to enter the overseas markets with local 5G equipment manufacturers.”Last week, KT CEO Hwang Chang-gyu delivered a special lecture on 5G at the Swiss Federal Institute of Technology in Zurich in Switzerland. Hwang has been passionate about promoting 5G abroad, earning the title “Mr. 5G.”During the lecture, Hwang said 5G could bring amazing changes to the world through its high speed, low latency and super connectivity. On-site accidents will be cut by 50 percent while productivity will jump 40 percent through the wider use of 5G solutions, according to Hwang.He added that 5G needs to be combined with data-based artificial intelligence (AI) for the network to truly realize its potential. He urged lecture attendees to create social value and solve social issues utilizing 5G and AI.On Oct. 18, Korea’s smallest carrier LG U+ said it signed a partnership with China Telecom to boost collaboration centering on 5G, such as offering 5G content and solutions.Virtually dating popular celebrities and observing their dance moves are some of the content LG U+ said it offered.China Telecom is currently building a 5G network in major cities like Beijing and Shanghai. LG U+ said it hopes to lead the 5G market through its partnership with the Chinese firm, which offers telecommunications services to more than 300 million people.BY JIN MIN-JI [jin.minji@joongang.co.kr]", "description": "", "authors": [], "top_image": "https://pds.joins.com/jmnet/koreajoongangdaily/_data/photo/2019/10/27205916.jpg", "published_at": "2019-10-27"}