{"pub": "businessinsider", "url": "https://businessinsider.com/goodrx-launching-virtual-care-service-2019-10", "downloaded_at": "2019-10-01 15:35:55.068435+00:00", "title": "GoodRx is breaking into the telemedicine market with a new virtual care service", "language": "en", "text": "This story was delivered to Business Insider Intelligence Digital Health Pro subscribers earlier this morning.\n\nTo get this story plus others to your inbox each day, hours before they're published on Business Insider, click here.\n\nCalifornia-based drug-comparison unicorn GoodRx is branching out beyond pointing consumers toward low-cost prescription drugs with the launch of a telemedicine platform, dubbed GoodRx Care, giving it inroads to a market that's expected to hit $64 billion by 2025 in the US. Business Insider Intelligence\n\nThe service was unveiled alongside news that GoodRx acquired HeyDoctor — a San Francisco-based startup that has conducted more than 100,000 consultations in the two years it's been up and running. With GoodRx Care, customers can virtually consult a physician, who can send prescriptions paired with GoodRx coupons to consumers' pharmacy of choice.\n\nAdding a telemedicine service is a smart move for GoodRx since it grants it access to another touchpoint in the patient journey. GoodRx is working to cut costs and up transparency for its customers —addressing two major patient headaches — so it likely won't have trouble roping in consumers who are looking for a cheaper one-stop-shop for care: It prides itself on saving its average customer $276 a year on their prescriptions, for example.\n\nNow, GoodRx lists the telemedicine services it offers as well as how much they cost online so its customers will know exactly how much they need to shell out for care. Services and tools that stomp down spending and confusion about how much services cost should come as a relief, since patients will be on the hook for a swelling portion of their healthcare costs: Out-of-pocket spending on physician care is projected to rise from $185 in 2017 to $266 in 2027 per capita, and out-of-pocket spending on prescription drugs is expected to reach $210 per capita from $144 in the same time frame, per Kaiser Family Foundation.\n\nAnd GoodRx is following in the footsteps of others in the space that have been hopping on the telemedicine bandwagon. We've seen other players working in the prescription drug sphere tap telemedicine as a means of boosting business: Direct-to-consumer drug delivery startups Roman and Hims both offer virtual consultations to provide users with tailored regimens. And CVS tied up with Teladoc to offer consumers access to virtual care. We think we'll see pharmacy startups — especially those without brick-and-mortar locations — lean on telemedicine to broaden offerings as consumers continue to seek fast and convenient healthcare options.\n\nWe should see telemedicine finally gain the momentum it needs to lift off as companies with vast consumer bases and mindshare continue to invest in virtual care offerings. Telemedicine has been on the brink of taking off for several years, but the strides it's made thus far have been within a small pool of consumers, with only about seven out of every 1,000 insured US patients holding telemedicine visits in 2017.\n\nBut we're seeing trusted companies with troves of consumers offering telemedicine services, which could fuel speedier growth: GoodRx reports 10 million monthly users — so that could mean wide-scale, increased telemedicine use, even if only a fraction opt for the new offering. And other big names are betting on the tech, too: Just last week, we covered Amazon's rollout of Amazon Care, a virtual care service for its mass of employees, which we think could extend to the broader population down the line.\n\nWe think we'll continue to see major companies rely on telemedicine to get consumers connected with fast, low-cost care — and we expect consumer adoption to swell faster than ever in the year ahead.\n\nWant to read more stories like this one? Here's how to get access:", "description": "GoodRx Care allows customers to virtually consult a physician, who can send prescriptions paired with GoodRx coupons to consumers' pharmacy of choice.", "authors": ["Zoë Larock"], "top_image": "https://image.businessinsider.com/5d93592f2e22af3b14139f33?width=1200&format=jpeg", "published_at": "2019-10-01"}