{"pub": "euronews", "url": "https://euronews.com/2019/10/07/u-s-says-it-will-stand-aside-turkey-moves-syria-n1063106", "downloaded_at": "2019-10-07 04:42:02.911828+00:00", "title": "U.S. says it will stand aside as Turkey moves into Syria", "language": "en", "text": "The White House said Sunday night that Turkey would soon begin operations in northeastern Syria to resettle Syrian refugees — and that U.S. forces wouldn't be there to help or stop them.\n\nIn a statement issued late Sunday, the White House said Turkey would \"soon be moving forward\" with its operation in northern Syria and that the United States wouldn't be involved.\n\nThe statement was issued after Turkish President Recep Tayyip Erdogan spoke by phone with President Donald Trump earlier on Sunday.\n\nThe statement didn't mention the Turkish government's announcement earlier in the day that Trump and Erdogan had agreed to meet in Washington next month.\n\nDuring the phone call, Erdogan expressed frustration with what Turkey sees as the failure of the United States to implement an agreement to establish a so-called safe zone east of the Euphrates River, Reuters reported.\n\nOn Saturday, Turkey signalled its intention to begin operations, saying an incursion was \"imminent\" in the region, where U.S. troops have been seeking to broker an agreement between Turkey and the Syrian Kurds.\n\nThe U.S. statement made it clear that the United States wouldn't interfere, saying U.S. forces \"will no longer be in the immediate area.\"\n\nThe White House said it was now up to Turkey to figure out what to do with ISIS fighters who have been captured in the area. Many of those fighters had been held by Kurdish-led forces, but Turkey considers the Kurds an enemy. The White House said Washington had urged the captured fighters' native countries — specifically citing France, Germany and other European nations — \"to take them back, but they did not want them and refused.\"\n\n\"The United States will not hold them for what could be many years and great cost to the United States taxpayer,\" it said.\n\n\"Turkey will now be responsible for all ISIS fighters in the area captured over the past two years in the wake of the defeat of the territorial 'Caliphate' by the United States,\" the White House said.\n\nA bipartisan congressional report last month urged the White House not to draw down troops in Syria to counter Iran's influence and halt a resurgence by ISIS.\n\nThe report by the 12-member Syria Study Group warned that the war in Syria is far from over and that ISIS is still a threat, contradicting the White House's claim on Sunday night that ISIS had been defeated.", "description": "Trump and Erdogan spoke by phone, but the White House didn't confirm Turkey's announcement that they will meet next month.", "authors": [], "top_image": "https://static.euronews.com/articles/4213454/1000x563_nbc-181116-trump-erdogan-al-1227_df1b2ee9bb89bbdf02fa0da8766bfdd9.jpg", "published_at": "2019-10-07"}