{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-hurricane-dorian-alabama-twitter-storm-winds-weather-forecast-latest-a9089901.html", "downloaded_at": "2019-09-03 23:43:00.571334+00:00", "title": "Trump insists meteorologists are wrong and he is right to say Hurricane Dorian could have hit Alabama", "language": "en", "published_at": "2019-09-03", "text": "Donald Trump has insisted he is right - and meteorologists are wrong - over his repeated claim Hurricane Dorian could strike parts of Alabama.\n\nForecasters, including the government’s own National Weather Service, were forced to correct the US president after he warned in a tweet on Sunday morning that Alabama would “most likely” be hit by the record-breaking tropical storm, which is currently devastating the Bahamas.\n\n“Alabama will NOT see any impacts from Dorian. We repeat, no impacts from Hurricane Dorian will be felt across Alabama. The system will remain too far east,” the NWS tweeted.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThree other states – Florida, South Carolina and Georgia – are all ordering part or full evacuations of their coastal areas and North Carolina has declared a state of emergency, but there are no evacuation orders in place in Alabama.\n\nMoments after the NWS tweet, Mr Trump again said the southern state would “get a piece” of the hurricane, and repeated the claim on Sunday afternoon during a Federal Emergency Management Agency (Fema) briefing.\n\nShape Created with Sketch. \"Huge damage\" as record Hurricane Dorian hits Bahamas: In pictures Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. \"Huge damage\" as record Hurricane Dorian hits Bahamas: In pictures 1/15 A road is flooded during the passing of Hurricane Dorian in Freeport, Grand Bahama. AP 2/15 Hurricane Dorian's eye taken by Nasa astronaut Nick Hague, from aboard the International Space Station. The station orbits more than 200 miles above the Earth. Hurricane Dorian, which made landfall on the Bahamas as category 5 and now reclassified as category 4, is expected to continue on its projected path towards the Florida coast. Nasa/EPA 3/15 Buildings damaged by Hurricane Dorian are swept by deep floodwater in the Abaco Islands in The Bahamas. Latrae Rahming 4/15 Tropical Storm Dorian as it approached the Bahamas. NOAA/AFP/Getty 5/15 Strong winds blow the tops of trees while whisking up water from the surface of a canal that leads to the sea in Freeport, Grand Bahama AP 6/15 A woman walks in a flooded street after the effects of Hurricane Dorian arrived in Nassau, Bahamas. REUTERS 7/15 Uprooted trees, fallen power lines and debris scatter a road as Hurricane Dorian sweeps through Marsh Harbour in The Bahamas Ramond A King via Reuters 8/15 Buildings damaged by Hurricane Dorian are swept by deep floodwater in the Abaco Islands in The Bahamas Latrae Rahming 9/15 A building is strewn with debris after its roof was torn off by Hurricane Dorian in the Abaco Islands in The Bahamas Latrae Rahming 10/15 Uprooted trees, fallen power lines and debris scatter a road as Hurricane Dorian sweeps through Marsh Harbour in The Bahamas Ramond A King via Reuters 11/15 Hurricane Dorian is pictured from a plane flying inside the eye of the storm Garrett Black/US Air Force 12/15 Inmates from a Florida jail fill sandbags to hand out to residents ahead of Hurricane Dorian in Cocoa, Florida on September 1 EPA 13/15 Residents stock up at Wal-Mart in preparation for Hurricane Dorian in Orlando, Florida Getty 14/15 A shop is boarded-up ahead of Hurricane Dorian in Cocoa, Florida on September 1 Reuters 15/15 Waves batter a pier in Marsh Harbour in The Bahamas on September 1e Mark Hall vie Reuters 1/15 A road is flooded during the passing of Hurricane Dorian in Freeport, Grand Bahama. AP 2/15 Hurricane Dorian's eye taken by Nasa astronaut Nick Hague, from aboard the International Space Station. The station orbits more than 200 miles above the Earth. Hurricane Dorian, which made landfall on the Bahamas as category 5 and now reclassified as category 4, is expected to continue on its projected path towards the Florida coast. Nasa/EPA 3/15 Buildings damaged by Hurricane Dorian are swept by deep floodwater in the Abaco Islands in The Bahamas. Latrae Rahming 4/15 Tropical Storm Dorian as it approached the Bahamas. NOAA/AFP/Getty 5/15 Strong winds blow the tops of trees while whisking up water from the surface of a canal that leads to the sea in Freeport, Grand Bahama AP 6/15 A woman walks in a flooded street after the effects of Hurricane Dorian arrived in Nassau, Bahamas. REUTERS 7/15 Uprooted trees, fallen power lines and debris scatter a road as Hurricane Dorian sweeps through Marsh Harbour in The Bahamas Ramond A King via Reuters 8/15 Buildings damaged by Hurricane Dorian are swept by deep floodwater in the Abaco Islands in The Bahamas Latrae Rahming 9/15 A building is strewn with debris after its roof was torn off by Hurricane Dorian in the Abaco Islands in The Bahamas Latrae Rahming 10/15 Uprooted trees, fallen power lines and debris scatter a road as Hurricane Dorian sweeps through Marsh Harbour in The Bahamas Ramond A King via Reuters 11/15 Hurricane Dorian is pictured from a plane flying inside the eye of the storm Garrett Black/US Air Force 12/15 Inmates from a Florida jail fill sandbags to hand out to residents ahead of Hurricane Dorian in Cocoa, Florida on September 1 EPA 13/15 Residents stock up at Wal-Mart in preparation for Hurricane Dorian in Orlando, Florida Getty 14/15 A shop is boarded-up ahead of Hurricane Dorian in Cocoa, Florida on September 1 Reuters 15/15 Waves batter a pier in Marsh Harbour in The Bahamas on September 1e Mark Hall vie Reuters\n\nABC News correspondent Jon Karl later pointed out that Mr Trump “misstated the storm’s possible trajectory”, which all experts have said never had a chance of falling on Alabama.\n\nOn Monday evening, having apparently watched the segment from his golf course in Virginia, Mr Trump angrily claimed “lightweight reporter” Mr Karl had given a “phony (sic) hurricane report”.\n\n“I suggested yesterday at FEMA that, along with Florida, Georgia, South Carolina and North Carolina, even Alabama could possibly come into play, which WAS true,” Mr Trump tweeted.\n\n“They made a big deal about this when in fact, under certain original scenarios, it was in fact correct that Alabama could have received some ‘hurt.’\n\n“Always good to be prepared! But the Fake News is only interested in demeaning and belittling. Didn’t play my whole sentence or statement. Bad people!”\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nIt is unclear where Mr Trump got his incorrect belief Alabama could be hit, but White House press secretary Stephanie Grisham told CNN the president had been informed the “expanse of the windfield is large” and that there was “a lot of uncertainty”.\n\n“His comments were simply noting those points, and with Alabama's proximity to Florida it makes sense,” she added.\n\nAlabama, though bordering Florida, does not have any eastern coastline, and at its closest point is still around 250 miles from the Atlantic.", "description": "Donald Trump has insisted he is right - and meteorologists are wrong - over his repeated claim Hurricane Dorian could strike parts of Alabama.", "authors": ["Tom Embury-Dennis"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/03/07/AFP-1JX8BM.jpg"}