{"pub": "axios", "url": "https://axios.com/what-amazon-knows-about-you-2df28404-b975-4bc8-b2da-ac702e601cf8.html", "downloaded_at": "2019-10-06 00:20:26.872160+00:00", "title": "What Amazon knows about you", "language": "en", "text": "Details: As with Google or Facebook, what Amazon knows depend on how much you rely on its services. That said, these days Amazon's services are all around us. Here are some of the different types of information gathered by various Amazon services.\n\nAmazon.com : Everything you have bought, plus the things you have just put in your cart, or searched for, or added to a wish list, or just browsed on Amazon (and Amazon-owned sites like Zappos and Diapers.com). And they know all of your addresses and the names and addresses of anyone you've ever sent stuff to.\n\n: Everything you have bought, plus the things you have just put in your cart, or searched for, or added to a wish list, or just browsed on Amazon (and Amazon-owned sites like Zappos and Diapers.com). And they know all of your addresses and the names and addresses of anyone you've ever sent stuff to. Kindle (digital books) and Audible (audio books): All the books you've read, plus how far into the book you got. Amazon also knows which books you have browsed or sampled, and what passages you've highlighted in Kindle.\n\n(digital books) and (audio books): All the books you've read, plus how far into the book you got. Amazon also knows which books you have browsed or sampled, and what passages you've highlighted in Kindle. Fire tablets : Amazon's tablets run a custom version of Android, providing the company with lots of data since it, not Google, powers the browsing and app store on the devices. For search, users have a choice of Bing, Yahoo, Google or DuckDuckGo.\n\n: Amazon's tablets run a custom version of Android, providing the company with lots of data since it, not Google, powers the browsing and app store on the devices. For search, users have a choice of Bing, Yahoo, Google or DuckDuckGo. Prime Video (streaming video): What you've watched, browsed and search for.\n\n(streaming video): What you've watched, browsed and search for. Twitch (streaming game videos): What you've watched, browsed and searched for.\n\n(streaming game videos): What you've watched, browsed and searched for. Ring (smart doorbells and security gear): For customers with a paid recording plan, Amazon stores videos for 30 to 120 days depending on location, or until a customer manually deletes the video. Recordings for those who don't subscribe to a plan are deleted automatically unless a customer posts a video to the publicly available Neighbors app.\n\n(smart doorbells and security gear): For customers with a paid recording plan, Amazon stores videos for 30 to 120 days depending on location, or until a customer manually deletes the video. Recordings for those who don't subscribe to a plan are deleted automatically unless a customer posts a video to the publicly available Neighbors app. Eero (wi-fi routers): One of Amazon's most recent acquisitions, Eero sells a mesh wi-fi router system. To do its job, like any home router, Eero's device knows every Web site you go to, but the company says it doesn't collect or store this information. (Eero detailed its practices in a blog post after the Amazon acquisition.)\n\n(wi-fi routers): One of Amazon's most recent acquisitions, Eero sells a mesh wi-fi router system. To do its job, like any home router, Eero's device knows every Web site you go to, but the company says it doesn't collect or store this information. (Eero detailed its practices in a blog post after the Amazon acquisition.) IMDB (movie and TV database): Although this is probably one of the lesser privacy concerns in Amazon world, your taste in movies can say a lot about you.\n\n(movie and TV database): Although this is probably one of the lesser privacy concerns in Amazon world, your taste in movies can say a lot about you. Goodreads (book-centric social network): The focus may be on books, but Amazon is also building a social graph of the service's bookworm members, in addition to getting more details on what sort of topics members are interested in.\n\n(book-centric social network): The focus may be on books, but Amazon is also building a social graph of the service's bookworm members, in addition to getting more details on what sort of topics members are interested in. Whole Foods (grocery store): Now that Amazon owns the upscale supermarket, if you shop here Amazon knows your grocery list, too. Whole Foods already offers deals to Prime members, linking the purchases of its best online customers with those buying offline.\n\nAlexa\n\nAmazon's virtual assistant is worthy of its own section as its implications are so broad. Of course Alexa knows all the things you ask it — but that's only the beginning.\n\nAmazon isn't recording everything you say, but rather starts recording when it hears Alexa summoned via a specific wake word (Alexa, Amazon, Computer or Echo). But there are instances where Alexa gets activated inadvertently and collects audio you had no intention of sending Amazon's way.\n\nOne recent controversy arose over just who at Amazon is listening to these audio snippets and for what purpose. Bloomberg reported in April that a team of Amazon workers and contractors across the globe listens to consumers conversations with Alexa, stoking existing concerns about a device that is always listening.\n\nAmazon told Axios that it only reviews \"an extremely small number of interactions from a random set of customers in order to improve the customer experience,\" including improvements to speech recognition, and that access to such data is tightly controlled and limited to a small number of employees.\n\nA limited number of employees also have access to location information in order to improve location-specific features, such as \"Where is the nearest coffee shop?\" (Click here for more on the Alexa-specific privacy policy.)\n\nWhat else\n\nKey by Amazon: An optional delivery service for Prime members that literally invites the Everything Store into your home, car or garage to deliver goods ordered online. Amazon stresses that no one enters your premises without explicit permission, that delivery personnel don't themselves get access codes, and all of them undergo background checks.\n\nAmazon Go: The company's cashier-less stores rely on deep surveillance of its aisles to allow customers to buy products without a formal checkout process. To do that, Amazon uses an array of cameras and sensors to determine who is taking what off the shelves.\n\nAdvertising: One of Amazon's fastest-growing businesses is serving up ads, a testament to just how much it knows about you.\n\nAmazon says: \"We create audience segments and serve interest-based ads based on a variety of anonymized shopping activities such as browse and purchase behaviors.\"\n\nAmazon says it sometimes includes third-party audience information to increase the relevance of its ads.\n\nBut Amazon gives customers the opportunity to opt out by selecting “do not show me interest-based ads from Amazon” on its advertising preferences page.\n\nAmazon Web Services: Amazon's cloud-computing service leads the market, capturing 32% of the global spend. But, as is the norm in the cloud industry, Amazon doesn't access any of the data stored on its services by businesses, with limited exceptions for court orders or security investigations.\n\nWhat you can do\n\nDelete your browsing history . Amazon offers some options to limit its information- gathering. For example, you can delete your browsing history and turn off the collection of browsing data.\n\n. Amazon offers some options to limit its information- gathering. For example, you can delete your browsing history and turn off the collection of browsing data. Mute Alexa and delete recordings . Amazon's Alexa-powered Echo devices have a physical microphone-off button that can be pressed to ensure no recording takes place. Amazon also offers an option to delete the Alexa recordings it has made.\n\n. Amazon's Alexa-powered Echo devices have a physical microphone-off button that can be pressed to ensure no recording takes place. Amazon also offers an option to delete the Alexa recordings it has made. Choose alternatives. No other store offers quite as broad a selection as Amazon, but there are other mega-stores, such as Target and Walmart, as well as other options for digital media, smart home gear and physical retail outlets.\n\nGo deeper: Read the rest of the series.", "description": "If you use it much, the online retailer may know more about you than any other company does.", "authors": [], "top_image": "https://images.axios.com/s_9YzZ4Pr_pdtdsekMPqhRfVhTk=/0x0:1920x1080/1920x1080/2019/04/26/1556307278716.jpg", "published_at": "2019-05-02"}