{"pub": "yahoo", "url": "https://news.yahoo.com/pennsylvania-lawmaker-charged-possession-child-032245485.html", "downloaded_at": "2019-09-18 23:29:26.746236+00:00", "title": "Child porn found on phone of Pennsylvania state Sen. Mike Folmer, prosecutor says", "language": "en", "text": "YORK, Pa. – A Pennsylvania state senator has been charged with possession of child pornography, according to the state attorney general’s office.\n\nRepublican state Sen. Mike Folmer, 63, represents parts of Lebanon, Dauphin and York counties.\n\nAccording to a release from Attorney General Josh Shapiro's office, Folmer was arrested Tuesday night after images of child pornography were found on his phone when police searched his home after obtaining a warrant.\n\nThe investigation began after a tip reported that an individual had uploaded an image of child pornography to the social networking website Tumblr.\n\nFolmer was charged with sexual abuse of children, possession of child pornography and criminal use of a communication facility, Shapiro said in the release.\n\n“I will continue to say it – no one is above the law, no matter what position of power they hold,” Shapiro said. “I will continue to work to protect children and hold those who abuse them accountable.”\n\nFolmer has yet to release a statement on the charges.\n\nBail was set at $25,000, but it was not immediately clear if Folmer had posted it, the attorney general’s office said.\n\nA native of Lebanon, Folmer was first elected to the Pennsylvania senate in 2006 and was re-elected to his fourth term in November.\n\nContributing: The Associated Press\n\nThis article originally appeared on York Daily Record: Mike Folmer: Pennsylvania state senator faces child pornography charge", "description": "GOP state Sen. Mike Folmer of Pennsylvania was arrested Tuesday after images of child porn were found on his phone, the state’s attorney general said.", "authors": ["Matt Allibone", "York Daily Record"], "top_image": "https://s.yimg.com/uu/api/res/1.2/m2yzxj2ZkhUukL3mJw5ghg--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/1009217/fd695dc3-db9f-4dd8-9dad-da5e1550f923/5cee3584-6215-590c-83c1-cee08ad61145/data_3_0.jpg?s=3aceb76cdb0969b1752117eb2ac81f6f&c=3c6fd58d64f9e3df453c1c125eafdf7a&a=tripleplay4us&mr=0", "published_at": "2019-09-18"}