{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/09/03/why-wouldnt-mike-pence-stay-doonbeg", "downloaded_at": "2019-09-03 23:41:04.811885+00:00", "title": "Why wouldn’t Mike Pence stay at Doonbeg?", "language": "en", "published_at": "2019-09-03", "text": "\n\n'Tis I'll be here in sunshine or in shadow! (Griff Witte/The Washington Post)\n\nColumnist\n\nI think a better question than “Why would the vice president stay at Trump International Golf Links in Doonbeg when his meeting was in Dublin?” or “Why would he pay for this visit out of pocket?” is “Why would anyone, at any time, stay anywhere that was not Doonbeg?”\n\nConsider the facts. Doonbeg is a paradise on Earth. It has everything that an International Golf Links ought to have: the Trump name on it, in big letters, and also, I am sure, many other benefits invisible to the untrained eye.\n\nBesides, Dublin is a wretched spot. It is the home of undesirables like Jonathan Swift — a man with bold proposals for dealing with unwanted populations but sadly little follow-through — and Oscar Wilde, about whom the less said the better. The vice president might unknowingly spend unsupervised time with the ghost of Molly Malone and involuntarily violate the Graham Rule. There is a craic epidemic, drinking there is somewhat whiskey and the river seems a li’l Liffey.\n\nContrast this to Doonbeg, a comfortable three hours away from the meeting the vice president was attending, a commute that allowed him critical time for peaceful reflection. Should we force the vice president to languish in Dublin, far from any Trump properties, when one is a scant three hours away? In a lifetime, really, what is six hours, round trip?\n\nAnd don’t worry, the vice president is paying out of pocket to stay there! As is his right! (The Secret Service isn’t, as is theirs!) Why shouldn’t he? If he thinks the president is doing a good job and deserves higher compensation, he ought to be allowed to pay the president some of his own money, just to say thanks. Money is Trump’s love language, and the vice president has to think it makes a nice change for him to every once in a while get an emolument from a patriot who loves America rather than a sinister foreign entity.\n\nAlso, to be fair, President Trump suggested this would be a good place to stay. But just because the decision to stay at Trump International Golf Links in Doonbeg was made at the president’s suggestion does not mean that it was not the best possible idea. If the president told you to grab a Trump-branded life buoy to save yourself, would you refuse? Well, that is what Doonbeg is.\n\nIt is a lifesaver. It is a rare honor to be vouchsafed the ability to stay there in the best of times. It is paradise on Earth. Is it Trump’s fault that he is the owner and beneficiary of what is, invariably, the most beautiful, pleasant, convenient place to stay in many cities across the globe? That is his genius. Should he be punished for having the good fortune to choose only the best spots in the world?\n\nOr perhaps the explanation is simpler: Mike Pence is paying to stay at Doonbeg in the hope of being able to have some influence on the Trump administration, just like everyone else.\n\nRead more from Alexandra Petri:\n\nTrump has a plan! His plan is for nothing to go wrong.\n\nLet nothing stand in your way, Trump tells people building wall\n\nI am a bedbug and would like to be kept out of this mess", "description": "In a lifetime, really, what is six hours, round trip?", "authors": ["Alexandra Petri", "Columnist Offering A Lighter Take On The News", "Opinions Of The Day", "September At Pm", "Alexandra Petri Is A Washington Post Columnist Offering A Lighter Take On The News", "Opinions Of The Day. She Is The Author Of", "A Field Guide To Awkward Silences."], "top_image": "https://www.washingtonpost.com/resizer/MDCwDV7riAB9vYyr3S4h3Bnuuvc=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FEE3XTXJTEI6NEB5TMI627MNFI.jpg"}