{"pub": "zdnet", "title": "Dell Latitude E4300", "url": "https://www.zdnet.com/article/dell-latitude-e4300", "language": "en", "published_at": "2010-10-21", "downloaded_at": "2019-09-02 07:10:41.528985+00:00", "text": "Featherweight Face-off: Dell Latitude versus Toshiba Portege Don't let the toy-like appearance of the Toshiba Portege A600 fool you, this fully featured portable laptop is packed full of features.\n\nDell's Latitude E4300 shares many of the exciting features of its larger siblings, but also sacrifices a lot in exchange for portability.\n\nDesign\n\nIt's not every day you see a blue business laptop, but that's exactly what Dell delivered to us with the Latitude E4300. Dell seem to have broken from the rule that all business products must suit the decor of the Death Star. While we like the blue, and also the optional red, Dell will charge you an extra AU$83 for the privilege of that extra bit of attitude in the board room.\n\nFunny metaphors aside, the Latitude series are nicely designed laptops. We are particularly fond of the backlit keyboard, which is comfortable to type on. As is common in many laptops, the Latitude series feature both a 'nipple' mouse and a trackpad. Dell's Latitude trackpads are worth commenting on, as they feature a range of different options, including circular scrolling. The trackpad features can be customised from a central interface.\n\nThe 13.3 inch display on the E4300 has a 1,280x800 native resolution, and comes with a matte finish. At the base of the display is the ambient light sensor, which is a handy feature for conserving battery life. If you prefer your display bright, you can simply disable it via keyboard shortcut. Like every laptop we have seen in recent history, there is a webcam at the top of the display.\n\nOn the far right below the keyboard is a fingerprint reader, which is thankfully placed far enough away that you don't brush it when you're typing. There are no external speakers on the E4300, unlike its larger sibling the E6500. This means tinny sound from an internal speaker, but that's a small price to pay for a comfortable keyboard on a laptop only slightly bigger than a netbook.\n\nPerformance and Features\n\nThe E4300 features the same strange, graphical BIOS we saw in the E6500, which we assume to be Linux-powered. It also features \"Latitude On\", which is accessed by a small button next to the power button on the top right-hand side. Latitude On allows you to quickly access your Microsoft Outlook contacts, calendar and email, as an alternative to having to wait for Windows to boot. Our test of the system took less than ten seconds. However, by moving to an SSD hard drive, you may find the boot time on this laptop so zippy that you won't use it much.\n\nPort options on the E4300 are a mixed bag, with a number of ports lost compared to the larger E6500, such as Display Port. There's no dial-up modem, but we're not sure if anyone will miss it. You also only get one USB port, which could be a real pain. Dell compromises by offering a dual eSATA/USB port on top of this, which allows you to plug in external devices as if they were an internal SATA II device.\n\nThis means that external storage finally sees good speeds, not only reducing the amount of time you need to spend transferring files, but also makes running applications off external drives a pleasure, whether installed normally or using software such as VMWare's ThinApp. Other port options include a FireWire (IEEE 1394) port and 3.5mm audio in/out jacks.\n\nThere's also an optical drive, a positive as these start to disappear when laptops approach this size. On the front of the device there is a MicroSD card reader, while on the left hand side there is an SC card slot, along with a contactless SC reader next to the mouse pad.\n\nDell's Latitude series adheres to Intel's Centrino 2 platform, meaning you can expect wireless N as standard, along with better power management, performance, and graphics capabilities. Our system came configured with an Intel Core 2 Duo SP9400 at 2.5GHz (a grunty 45nm Penryn generation CPU), and 2GB of 1066MHz DDR3 RAM. This makes it quite a performer for its size, delivering a PCMark05 score of 4,513.\n\nThose seeking more performance can upgrade to 4GB of RAM for AU$235, but sadly there is no 64-bit Windows option on the Dell site to take full advantage of this. Those seeking a 64-bit OS will need to upgrade and re-install.\n\nAn unfortunate side effect of the power of this laptop is the considerable amount of heat it puts out. After using this laptop for the best part of a day, you will find it uncomfortably hot on your lap. Left-handers might also find it uncomfortable, as the placement of the air vent means it will jet very hot air onto your hand if you use an external mouse.\n\nThere are three different batteries available on the E4300, a 4-cell standard battery, a 6-cell which sticks out the back, and an additional 6-cell \"battery slice\" which adds more thickness to base of the laptop. You can combine the battery slice with either of the other two for extra battery power. Our system came with a single 56 Whr, 6-cell battery.\n\nIn order to test battery life, we set screen brightness to 50 per cent and then played a DVD. This is a taxing test, and the E4300 gave an above average result of 200 minutes. One might extrapolate from this that the dual 6-cell configuration would give up to 400 minutes of battery life, which is an absurdly massive amount. However bear in mind that the addition of a the battery slice would increase the weight of the laptop considerably.\n\nOne unfortunate feature of the E4300 is the 160GB HDD which came with our review model, which is on the small side. Hard drive upgrade options max out at a 250GB 7500 RPM SATA II drive for an additional AU$263. If your surname happens to be Soros, Buffett or Branson, you might want to also consider the 64GB SSD for an additional AU$1,511.\n\nOur system came with a Windows Vista Business license with Windows XP (SP3) pre-installed as a \"downgrade\". Ultimate is available for an additional sum of AU$216. Pre-installed software includes the Google Desktop and Toolbar (which seems to be ubiquitous on Dell's PCs), Roxio DVD burning software and a few other small inclusions. Dell gets points for not installing any trial software on the system.\n\nGraphics on the system are provided by Intel's GS45 chipset, which forms part of the Centrino 2 platform. While the new chip is much improved from previous generations, this is still no gaming or graphics machine. If you want strong graphics performance consider a different, and likely larger system.\n\nVerdict\n\nThe Latitude family from Dell is a big family of laptops, and those looking for a travelling laptop might want to consider the 12.1-inch E4200. Its specs are more limited, but it comes with an SSD as standard and it's cheaper. Those looking to go for a premium machine should look to the E6500, which contains a plethora of bells and whistles and a 15.4-inch display. As it stands, the E4300 is a good compromise between portable and fully featured. However even with the dual eSATA/USB port, you might still run out of ports fast.\n\nWhile the Latitude family is flashy, it's also pricy. Our close to base model came in at AU$3,366 — this is a premium laptop. Dell's covers the E4300 with a basic three year, next business day, on site warranty. Which is great, but again reflects the absolutely premium price of the Latitude line. Those looking to save money by culling features should probably considers Lenovo's latest ThinkPad line, which is also high quality. Dell also offers a cheaper line for SMBs, the Vostro range.", "description": "Dell's Latitude E4300 shares many of the exciting features of its larger siblings, but also sacrifices a lot in exchange for portability.", "authors": ["Alex Serpo"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2014/08/29/fd28e6ca-2f47-11e4-9e6a-00505685119a/thumbnail/770x578/244f5428d7859fec382cc3157439504c/dell-latitude-e43001.jpg"}