{"pub": "reuters", "url": "https://ca.reuters.com/article/businessNews/idCAKBN1WJ2CG-OCABS", "downloaded_at": "2019-10-05 00:09:07.435692+00:00", "title": "PG&E says it has $34.45 billion in debt financing for reorganization", "language": "en", "text": "SAN FRANCISCO (Reuters) - PG&E Corp said in court papers on Friday it has debt financing commitments of $34.35 billion for a planned Chapter 11 bankruptcy reorganization, countering a group of noteholders that has proposed its own reorganization plan for the California power producer.\n\nFILE PHOTO: PG&E crew work on power lines to repair damage caused by the Camp Fire in Paradise, California, U.S. November 21, 2018. REUTERS/Elijah Nouvelage/File Photo\n\nPG&E in a filing in U.S. Bankruptcy Court in San Francisco said the commitments are from leading money center banks and have terms superior to those in the plan the noteholders want to file.\n\nThe commitments will “fully fund” a reorganization plan so PG&E can have one confirmed by June 30, 2020, the company said.\n\nPG&E has also obtained more than $14 billion in equity commitments from other investors and has struck an $11 billion settlement with an insurers group and a $1 billion settlement with a group of local governments and public entities hit hard by the wildfires that pushed the company to file for bankruptcy.\n\nSan Francisco-based PG&E filed for Chapter 11 bankruptcy protection in January in the aftermath of blazes in 2017 and 2018 blamed on its equipment.\n\nAt the time, PG&E anticipated wildfire-related liabilities of more than $30 billion.\n\nA group of PG&E noteholders, including Apollo Capital Management and Elliott Management Corp among others, last week unveiled a revised version of their proposed reorganization plan. It would put $29.2 billion in new money into PG&E, up from a prior $28.4 billion offer, in exchange for new debt and a controlling equity stake.\n\nThe committee representing individual wildfire victims in PG&E’s bankruptcy supports the noteholders’ plan as it would create a $14.5 billion trust to pay their claims.\n\nPG&E has proposed funding a trust to compensate the victims capped at $8.4 billion.\n\nLawyers for the wildfire victims committee and the noteholders group will ask U.S. Bankruptcy Judge Dennis Montali at a hearing on Monday for an order that would allow the noteholders group to file its reorganization plan.\n\nPG&E in its filing on Friday objected to that request, arguing it should remain the only party in its bankruptcy with the right to file a reorganization plan, adding its plan will pay the company’s debtholders in full.\n\nThe power provider also proposed a mediator be appointed to help it and its stakeholders try to craft a plan they can all support.\n\nIf PG&E resolves its bankruptcy by the end of next June, it can participate in a recently enacted, $21 billion state fund to help California’s investor-owned utilities pay for future wildfires liabilities.\n\nPG&E has said that taking part in the fund, which the utilities would help support with contributions, will enhance its finances over the long term.\n\nLenders putting up debt financing for PG&E’s planned reorganization are JPMorgan Chase Bank NA, Bank of America NA, BofA Securities Inc, Barclays Bank PLC, Citigroup Global Markets Inc, Goldman Sachs Bank USA and Goldman Sachs Lending Partners LLC, according to a commitment letter attached to Friday’s filing.", "description": "PG&E Corp said in court papers on Friday it has debt financing commitments of $34.35 billion for a planned Chapter 11 bankruptcy reorganization, countering a group of noteholders that has proposed its own reorganization plan for the California power producer.", "authors": ["Jim Christie", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191004&t=2&i=1437186550&w=1200&r=LYNXMPEF931MC-OCABS", "published_at": "2019-10-04"}