{"pub": "news24", "url": "https://sport24.co.za/Rugby/RugbyWorldCup2019/clinical-all-blacks-thrash-toothless-ireland-in-rwc-qf-20191019", "downloaded_at": "2019-10-19 12:30:55.709177+00:00", "title": "Clinical All Blacks thrash toothless Ireland in RWC QF", "language": "en", "text": "Cape Town - The defending champion All Blacks were far too strong for a toothless Ireland in Saturday's Rugby World Cup quarter-final in Tokyo, emerging as 46-14 winners.\n\nThe New Zealanders scored seven tries on the day and took a 22-0 lead into half-time as the sizeable Irish support in the crowd looked on helplessly.\n\nBy the time Robbie Henshaw crossed the whitewash for Ireland's first try of the game late in the second half, the match was already over as a contest.\n\nIt means that New Zealand will now meet England in next weekend's first semi-final in Yokohama after Eddie Jones' men beat Australia 40-16.\n\nScorers:\n\nNew Zealand 46 (22)\n\nTries: Aaron Smith (2), Beauden Barrett, Codie Taylor, Matt Todd, George Bridge, Jordie Barrett\n\nConversions: Richie Mo'unga (4)\n\nPenalty: Mo'unga\n\nIreland 14 (0)\n\nTries: Robbie Henshaw, Penalty Try\n\nConversion: Joey Carbery\n\nTeams:\n\nNew Zealand\n\n15 Beauden Barrett, 14 Sevu Reece, 13 Jack Goodhue, 12 Anton Lienert-Brown, 11 George Bridge, 10 Richie Mo'unga, 9 Aaron Smith, 8 Kieran Read (captain), 7 Sam Cane, 6 Ardie Savea, 5 Sam Whitelock, 4 Brodie Retallick, 3 Nepo Laulala, 2 Codie Taylor, 1 Joe Moody\n\nSubstitutes: 16 Dane Coles, 17 Ofa Tuungafasi, 18 Angus Ta'avao, 19 Scott Barrett, 20 Matt Todd, 21 TJ Perenara, 22 Sonny Bill Williams, 23 Jordie Barrett\n\nIreland\n\n15 Rob Kearney, 14 Keith Earls, 13 Garry Ringrose, 12 Robbie Henshaw, 11 Jacob Stockdale, 10 Johnny Sexton, 9 Conor Murray, 8 CJ Stander, 7 Josh van der Flier, 6 Peter O'Mahony, 5 James Ryan, 4 Iain Henderson, 3 Tadhg Furlong, 2 Rory Best (captain), 1 Cian Healy\n\nSubstitutes: 16 Niall Scannell, 17 Dave Kilcoyne, 18 Andrew Porter, 19 Tadgh Beirne, 20 Rhys Ruddock, 21 Joey Carbery, 22 Chris Farrell, 23 Jordan Larmour", "description": "The All Blacks were far too strong for Ireland in their Rugby World Cup quarter-final clash in Tokyo on Saturday.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7947/866400e1e463409a9c54ebea7d95cb00.jpg", "published_at": "2019-10-19"}