{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/line-duty-creator-teases-return-20545633", "downloaded_at": "2019-10-09 18:54:22.505257+00:00", "title": "Line of Duty creator teases return of show and it could be sooner than we thought", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLine of Duty had the nation gripped this summer as season five came to an end with a dramatic 90 minute finale.\n\nFans were able to breathe a huge, collective sigh of relief as Ted Hastings was cleared of any wrongdoing and it was proved he had been framed for the murder of John Corbett, as he had claimed all along.\n\nWe also finally had an answer for who the corrupt police officer H was - kind of.\n\nRather than hiding the identity of one 'bent copper', DS Steve Arnott was able to decipher Dot Cottan’s dying declaration that there was in fact four members of the force in league with organised crime.\n\nDot Cottan, Derek Hilton, Gill Biggeloe had all been rumbled but one more remained at large.\n\nThe series finished on a cliffhanger as we were left in the dark over the unknown officer was - setting up the show perfectly for season six.\n\nWe were forced to wait two years between series last time as show creator Jed Mercurio focused his attention on the hugely-successful BBC drama Bodyguard.\n\nThe good news for Line of Duty fans is it looks like we won't have to wait that long again as Jed revealed he's aiming to get series six aired 'sometime in 2020', as reported by the Radio Times .\n\n(Image: BBC)\n\n\"I would hope it’s sometime in 2020, next year,\" he said.\n\n\"But that’s not something that we’re able to confirm.”\n\nTalking about when production might begin, he added: \"That’s something that we have at the planning stage, so we are working towards a date. We can’t confirm everything until things are in place.\"\n\nWith the previous three series beginning in March, there would have to be a quick turnaround to have it all done before spring 2020.\n\nWhenever it does eventually hit our screens, we're more than ready for our lives to be consumed wondering 'who is H?' all over again.", "description": "Warning: Contains Line of Duty season five spoilers", "authors": ["Luke Matthews", "Image", "Bbc"], "top_image": "https://i2-prod.dailyrecord.co.uk/incoming/article18344236.ece/ALTERNATES/s1200/1_JS180799579.jpg", "published_at": "2019-10-09"}