{"pub": "yahoo", "url": "https://news.yahoo.com/trump-letting-china-beat-american-093502408.html", "downloaded_at": "2019-10-11 13:12:40.733251+00:00", "title": "Trump is letting China beat up American businesses", "language": "en", "text": "NBA coach Steve Kerr isn't the U.S. secretary of state or a special envoy to China. Nor is the basketball league run out of some bureau within the State Department. American business interests shouldn't be expected to represent the leading edge of American foreign policy — especially if it requires taking risks that Washington itself won't.\n\nYes, the NBA's initial response to China's effort to limit free speech by employees was craven, even shameful. It also made the league a perfect target for President Trump. In a press conference, Trump mocked Kerr, an outspoken liberal critic of the president, for his hazy answer to a question about a Houston Rockets official's pro-Hong Kong democracy tweet. \"[Kerr] was like a little boy,\" the president said. \"He was so scared to be even answering the question.\"\n\nTrump was then asked if he was \"Okay with the China pressuring the NBA over Hong Kong?\" Now it's unlikely that anyone watching expected the president to offer a ringing and eloquent defense of freedom of speech, complete with requisite Founding Father quote. (\"Whoever would overthrow the liberty of a nation must begin by subduing the freeness of speech,\" by Benjamin Franklin is a good one.)\n\nTrump, however, couldn't even muster a weak hand–wave in that general direction. \"They have to work out their own situation. The NBA, they know what they're doing,\" he briefly responded, before resuming his attack on Kerr.\n\nSo a Trumpian modification, then, on America First. \"We take care of our own\" — nationalist populists often say this — but only if you're a member of Team Trump. Some Americans are more equal than others. Trump-friendly farmers get tens of billions in aid to offset China's retaliatory tariffs, yet not even a supportive word or tweet for a Trump-critical basketball league getting muscled by Beijing when its coaches and players act like freedom-loving American citizens. Look no further for a real-world example of how nationalism breeds cronyism.\n\nBut the situation might be far worse than that. China's attack on the NBA is happening against the backdrop of the Trump trade war meant to fulfill his protectionist economic agenda. And according to a CNN report, Trump last June promised Chinese President Xi Jinping that the U.S. would remain quiet on pro-democracy protests in Hong Kong while trade talks continued.\n\nSo in exchange for China maybe ordering more sorghum and soybean purchases and Trump getting a needed political win, Beijing gets a freer hand in Hong Kong. This, combined with the betrayal of our Kurdish allies in Syria, vividly shows the price that the America First ideology extracts both in blood and honor.\n\nThere's a growing domestic political consensus that America needs to counter China's growing economic, military, and political influence — especially as China drifts toward a more extreme authoritarianism. And given the deep economic ties between the two nations, American business will be on the front lines, even if all the current tariffs are removed. How will Washington help?\n\nFor instance: Chinese pressure may have effectively forced Apple and Google to remove apps associated with the Hong Kong protests from their digital stores. (Apple says it's following its own internal policies.) While Google exited China back in 2010, China remains a critical manufacturing element in Apple's supply chain, as well as a big market for Apple products. Yet if Apple shifted its operations to other Asian countries to be less vulnerable to Chinese pressure, it could easily find itself tangled in new Trump tariffs on those economies that run trade surpluses with America.\n\nThen there's the censorship issue. Influential technology analyst Ben Thompson correctly suggests, \"[a]ttempts by China to leverage market access into self-censorship by U.S. companies should also be treated as trade violations that are subject to retaliation.\" But Trump himself tends to see trade deals in almost purely economic terms, as evidenced by that conversation with Xi, although the rest of his administration more seriously considers other aspects such as national security. Preventing censorship is a more worthy goal of trade policy than eliminating trade deficits.\n\nDuring the 1980s, there was a significant cultural boycott of South Africa over its racist apartheid policy. China's internal repression as well as its effort to export censorship may eventually justify such actions today. Maybe Dwayne \"The Rock\" Johnson should skip any Shanghai premier of his next film. Maybe Kerr should speak out against the NBA running training camps in the same region where the Uighur population is being detained in camps. But bold stances would be easier with a president who at least pretended to care, if only on Twitter.\n\nWant more essential commentary and analysis like this delivered straight to your inbox? Sign up for The Week's \"Today's best articles\" newsletter here.", "description": "NBA coach Steve Kerr isn't the U.S. secretary of state or a special envoy to China. Nor is the basketball league run out of some bureau within the State Department. American business interests shouldn't be expected to represent the leading edge of American foreign policy -- especially if it requires", "authors": ["James Pethokoukis"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-11"}