{"pub": "nationalreview", "url": "https://nationalreview.com/corner/okay-sohrab-ahmari-but-why-did-you-snap", "downloaded_at": "2019-10-05 06:56:06.893973+00:00", "title": "Sohrab Ahmari's Kavanaugh \"Snap\" Moment", "language": "en", "text": "Supreme Court Associate Justice Brett Kavanaugh speaks at a ceremonial swearing-in at the White House, October 8, 2018. (Jim Bourg/Reuters)\n\nOne of my biggest problems with the worldview that Sohrab Ahmari outlines in the course of criticizing David French — and, for that matter, with the general tenor of the Deneen-inspired “anti-liberalism” that First Things is presently indulging — is that it gets extremely fuzzy when it reaches the questions, “What do we actually want?” and “How do we intend to get there?” Ahmari says he wants to “fight the culture war with the aim of defeating the enemy and enjoying the spoils in the form of a public square re-ordered to the common good and ultimately the Highest Good.” Okay. But what does that actually mean in practice? What does a “defeated enemy” look like? By what mechanism is the “public square re-ordered to the common good and ultimately the Highest Good”? Which “public square”? — there are many in America. And what is the “common good and ultimately the Highest Good”? Who decides? Ahmari? The Pope? Nicolás Maduro?\n\nAdvertisement\n\nAdvertisement\n\nI must confess that I am not entirely sure that Ahmari and his compatriots know. And this justification for his present approach — provided by Ahmari on Twitter yesterday — has deepened that suspicion:\n\nKavanaugh snapped something in me. — Sohrab Ahmari (@SohrabAhmari) May 30, 2019\n\nI have heard from a lot of people that the Kavanaugh affair “snapped something in” them. That’s understandable. Indeed, if you look back at my writing at the time, I was absolutely outraged by what happened — and how. But the thing is, we won the Kavanaugh fight. And, crucially, the supposedly supine David French was unsparing in his defense of Kavanaugh. If that was the moment that Ahmari resolved to don a pith helmet and run to the barricades, he shouldn’t have shunned David French for his uselessness, but immediately linked arms with him. I can’t think of an incident that provoked behavior in David that was further from Ahmari’s straw man. He was unblenching.\n\nMoreover, I struggle to remember an incident that better highlighted the need for (classical) liberalism. Ultimately, it was precisely the insistence upon classically liberal values such as cross-examination, hard evidence, and the presumption of innocence that won the day for Kavanaugh, against the sort of ends-oriented illiberalism that Ahmari seems increasingly to admire. The person who secured Kavanaugh’s confirmation, remember, was . . . Susan Collins, and the (correct) reason she gave for her vote was that nothing had been proven and that that was unacceptable to her. She said:\n\nBut certain fundamental legal principles—about due process, the presumption of innocence, and fairness—do bear on my thinking, and I cannot abandon them. In evaluating any given claim of misconduct, we will be ill served in the long run if we abandon the presumption of innocence and fairness, tempting though it may be. We must always remember that it is when passions are most inflamed that fairness is most in jeopardy. The presumption of innocence is relevant to the advice and consent function when an accusation departs from a nominee’s otherwise exemplary record. I worry that departing from this presumption could lead to a lack of public faith in the judiciary and would be hugely damaging to the confirmation process moving forward.\n\nThis is a David French argument. It is not a Sohrab Ahmari argument.\n\nAdvertisement\n\nOr is it? In his essay, Ahmari knocks David for his focus on individualism. But was it not precisely a belief in individual rights that angered so many people at the Kavanaugh hearing — and, dare I say, led them to snap? Those leading the attack against Kavanaugh asked, cynically, “why not just pick another judge?” And the answer was because a man’s reputation was at stake, and because in our culture — our “tradition,” in Ahmari’s formulation — that matters. If the aim were purely to advance the ball on questions that are important to him, Ahmari wouldn’t have cared much about Kavanaugh. Instead, he’d have recommended dropping him and picking another justice who was acceptable to the editors at First Things. But he didn’t. He “snapped” at the injustice of it all.\n\nWhy?", "description": "I have heard from a lot of people that the Kavanaugh affair \"snapped something in\" them.", "authors": ["Charles C. W. Cooke", "Andrew C. Mccarthy", "Alexandra Desanctis", "Kevin D. Williamson", "John Yoo", "Jim Geraghty", "Kyle Smith", "David French", "Mairead Mcardle", "Victor Davis Hanson"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2018/10/brett-kavanaugh-confirmation.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-05-30"}