{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nfl/chiefs/2019/10/25/patrick-mahomes-chiefs-qb-not-play-sunday-against-packers/2459974001", "downloaded_at": "2019-10-25 23:43:40.255976+00:00", "title": "Kansas City Chiefs rule out QB Patrick Mahomes for Sunday's game vs. Green Bay Packers", "language": "en", "text": "CLOSE SportsPulse: Trsyta Krick chatted one-on-one with the Chiefs star tight end about the emotions he felt when he saw the gruesome injury to quarterback Patrick Mahomes. USA TODAY\n\nKANSAS CITY, Mo. (AP) — The Kansas City Chiefs have ruled quarterback Patrick Mahomes out for Sunday night's showdown against the Green Bay Packers because of his dislocated right kneecap.\n\nMahomes, who hurt his knee last Thursday night in Denver, was a limited participant in practice all week. The Chiefs decided to give the reigning league MVP at least one game off as he recovers from an injury that can sometimes sideline a player for several months.\n\nChiefs coach Andy Reid said after Friday's walk-through that Matt Moore would start against Green Bay. Rookie quarterback Kyle Shurmur will serve as the backup.\n\nIn all, the Chiefs have ruled out six players for a showdown between division leaders.\n\nDefensive end Frank Clark is out with a neck injury, cornerback Kendall Fuller with a broken thumb, left tackle Eric Fisher and defensive tackle Chris Jones with groin injuries and left guard Andrew Wylie with a sprained ankle.\n\nIf you love talking football, we have the perfect spot for you. Join our Facebook Group, The Ruling Off the Field, to engage in friendly debate and conversation with fellow football fans and our NFL insiders.", "description": "The Chiefs have ruled quarterback Patrick Mahomes out for Sunday night's showdown against the Packers because of his dislocated right kneecap.", "authors": ["Associated Press", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/25/USAT/105662fb-c9d5-4c20-9688-678d5c814b4f-USATSI_13528226.jpg?crop=3898,2193,x0,y359&width=3200&height=1680&fit=bounds", "published_at": "2019-10-25"}