{"pub": "afr", "url": "https://afr.com/world/europe/jeremy-corbyn-warned-over-boris-johnson-s-election-trap-20191010-p52zi6", "downloaded_at": "2019-10-10 15:08:24.911237+00:00", "title": "Jeremy Corbyn warned over Boris Johnson’s election ‘trap’", "language": "en", "text": "Labour’s attitude to another plebiscite is crucial because if Mr Johnson fails to strike a new Brexit deal with the EU — or fails to get any such deal through parliament by October 19 — he could try to collapse the government by calling a vote of no confidence. In those circumstances, however, under the Fixed-Term Parliaments Act, Mr Johnson would need a positive vote from two-thirds of the House of Commons.\n\nWhile the Scottish National party and the Liberal Democrats would be likely to back the move, many Labour MPs are hostile — not least because some fear losing their own seats.\n\n“We would be massacred in an election. I reckon we would lose over 100 seats,” said one Labour MP.\n\nIn Westminster, it has long been assumed that Labour would not wriggle out of a chance to go to the polls and some pro-Corbyn colleagues, including shadow aid secretary Dan Carden, argued at the shadow cabinet meeting on Tuesday that Labour should get on the front foot by demanding an election.\n\nMr Carden told the meeting that Labour would be seen to be “hiding from democracy, hiding from voters” if it resisted the idea of going to the polls.\n\nBut, according to people at the private meeting, Mr Starmer joined Mr McDonnell in sounding surprisingly hostile towards the idea of an election. “There were people saying we need to move into an immediate election mode . . . John and Keir both sounded quite cautious about an immediate move,” said one attendee.\n\nAnother person around the table said they had been “shocked” by Mr Starmer’s stance, saying: “Keir seemed to have no intention of talking about wanting a general election.”\n\nAdvertisement\n\nMr Starmer told the room that he had been canvassing at the weekend in north London and had received a “bad” response from voters.\n\n“He said we haven’t got back the Remain voters that we lost to the Lib Dems,” said one member of the shadow cabinet who listened to him.\n\nOne reason for the caution is a belief that Labour voters will not turn out to vote in the winter.\n\n“Historically, we don’t support elections in November or December because it’s cold and wet. Labour voters don’t come out. That’s why we prefer them in the spring,” said one member of the shadow cabinet.\n\nFinancial Times", "description": "The Labour leader has been warned by senior members of the shadow cabinet that it faces a heavy defeat at the hands of Boris Johnson.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3184%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_78%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/b864ff887aeeaa774fe674fd756ca325aa745fe4", "published_at": "2019-10-10"}