{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7629901/Amber-Rudd-QUITS-Commons-despite-making-peace-Boris-Johnson.html", "downloaded_at": "2019-10-30 10:49:50.742749+00:00", "title": "Amber Rudd QUITS the Commons despite making peace with Boris Johnson", "language": "en", "text": "Former Cabinet minister Amber Rudd announced she is quitting the Commons today - despite making peace with Boris Johnson.\n\nThe Hastings and Rye MP gave up the Conservative whip in solidarity with 21 Remainer rebels who were expelled by the PM last month.\n\nHowever, 10 of the MPs were brought back into the fold last night as Mr Johnson gears up for the looming election battle.\n\nMs Rudd said this morning she would not be standing in the poll on December 12 - despite expectations that she will have the whip restored this afternoon.\n\nThe ex-minister had a wafer-thin majority of just 346 in the 2017 election - meaning her seat is one of Labour's top targets.\n\nHowever, the constituency voted 56 per cent for Leave, suggesting that a Brexiteer Conservative candidate might have better prospects.\n\nAmber Rudd has become the latest senior parliamentarian to announce she will not stand at the forthcoming general election\n\n'I'm not finished with politics, I'm just not standing at this election,' Ms Rudd told the Evening Standard.\n\nShe added: 'I spoke to the Prime Minister and had a good meeting with him a few days ago.\n\n'I'm really confident of my position.\n\n'I will be leaving the House of Commons on perfectly good terms with the Prime Minister and I want him to succeed.'\n\nMs Rudd said she will meet Chief Whip Mark Spencer today and ask for the whip back.\n\n'I'm happy to leave the House of Commons as a Conservative MP,' she said.", "description": "Former Cabinet minister Amber Rudd has become the latest senior parliamentarian to announce she will not stand at the forthcoming general election.", "authors": ["James Tapsfield", "Political Editor For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/10/20368638-0-image-a-5_1572430713209.jpg", "published_at": "2019-10-30"}