{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7623283/Duchess-Cornwall-joins-jockey-Khadijah-Mellah-screening-new-film-London.html", "downloaded_at": "2019-10-28 23:42:39.586384+00:00", "title": "Duchess of Cornwall joins jockey Khadijah Mellah at a screening of a new film in London", "language": "en", "text": "The Duchess of Cornwall was all smiles as she joined jockey Khadijah Mellah on the red carpet at the launch of a film about her sporting achievement in London this evening.\n\nInspirational Khadijah Mellah, 18, made sporting history this summer when she stormed across the line at Glorious Goodwood to scoop the famous Magnolia Cup on August 1 - barely four months after sitting on a racehorse for the first time.\n\nThe first woman jockey to win a race wearing a hijab spoke tonight of her pride at becoming a role model for young Muslim women.\n\nCamilla, 72, joined the sporting hero for the premiere of new ITV film Riding A Dream, which will be broadcast on Saturday, at the Ritzy Cinema in Brixton, south west London.\n\nThe Duchess of Cornwall, 72, attended the screening of a film about 18-year-old Khadijah Mellah's life. She is the first woman jockey to win a race wearing a hijab (pictured together)\n\nThe Duchess was seen exchanging some heartfelt words with Khadijah (pictured), who learnt to ride at the Ebony Horse Club - a charity offering riding to inner city children, that has the Duchess as its patron\n\nCamilla is president of the Ebony Horse Club, a charity riding centre for inner city school children, where Khadijah first got the bug for riding.\n\nThe royal, who invited the former Sydenham High School student to a reception at Clarence House a few weeks before her victory and personally wrote to her afterwards, greeted her warmly and told the young amateur jockey how proud she was of her.\n\nWearing a chic monochrome skirt and top, she also chatted at length to Khadijah’s proud family, from Peckham, south London, before they watched the 25-minute documentary together.\n\nThey were joined by the film’s producer Oli Bell and directors Mattia Reiniger and Tommy Bolwell - while other guests included ITV newsreader, Alastair Stewart.\n\nCharting her journey from the charity Ebony Horse Club in Brixton, where she first learnt to ride, the documentary follows Khadijah as she prepares to compete in the Magnolia Cup - an all-female charity race against the likes of Olympian Victoria Pendleton, model Vogue Williams, and professional event rider Sophie van der Merwe.\n\n‘I cant really describe how I am feeling,' Khadijah said, speaking before the event. I am just buzzing.'\n\n'I never thought I would ever get to this stage or even get into racing, let alone that I would end up doing a race, winning a race. It came out of nowhere, really.'\n\nKhadijah stunned in a bold purple outfit while Camilla opted for a monchrome dress and smart black blazer\n\nCamilla and the successful jockey were seen making a warm exchange outside the glamorous Ritzy Cinema in Brixton, London today\n\nKhadijah (pictured with the Duchess of Cornwall) revealed that she hadn't gone into horse racing to become a role model but is glad to be a positive example of Islam\n\n‘I had been riding horses for quite a while but racehorses only since April. After i won the race I was overloaded with emotion, I just broke down. I was crying with happiness and relief. It was incredible, an incredible day. ‘\n\nKhadijah added that while she hadn’t gone into the event intending to become a role model, she was glad that there was a positive example of Islam in the news.\n\n‘I am just glad there is a positive news story out there,' she explained. 'With everything that is going on regarding ISIS at the moment and the horrible representation of Islam at the moment... it is justified yes, but it is very sad [to have my religion represented in that way.]\n\n'So I am just glad there is a positive role model. That there is a Muslim girl who isn’t doing anything negative and it is such a positive story.\n\n‘I hadn’t realised the enormity of it until two weeks before the race. It wast ever intentional, i just happened to be Muslim and wearing a hijab.'\n\nThe teenager went on to praise her family for being very supportive but made no bones about the pressure she would be under.\n\n‘My father was very supportive but my family were like \"this is a lot of pressure, make sure that you represent the Islamic community as accurately as possible,\" she added. 'So I am trying my best.'\n\nCamilla was all smiles as she stepped out of a chauffeur-driven car before heading inside to the glitzy event\n\nCamilla, pictured entering the venue in Brixton, London, warmly told the young amateur jockey how proud she was of her achievements\n\nThe Duchess of Cornwall styled her hair in loose waves, completing her look with minimal make-up and accessories\n\nShe continued: ‘But they are completely ecstatic that I am racing and the Islamic community is getting more involved, that girls are getting more involved that women of colour are getting more involved.'\n\nKhadijah has just left her Peckham home to go to Brighton to study engineering, but hopes to continue her racing career as well, study permitting.\n\n‘I have just completed my first four weeks,' she said. 'I am hopefully looking to continue my racing, we will see how it goes. In engineering the workload is steadily increasing.’\n\nAnd the successful jockey also offered her advice for another young girl - Muslim or otherwise - who dreams of riding.\n\n‘I was lucky enough to be approached but not everyone is going to have that chance, so just reach out,' she explained.\n\nThe Duchess of Cornwall seemed in good spirits as she posed for photographs with Khadijah at the screening\n\nKhadijah who has recently left London to go to Brighton to study engineering, hopes to continue her racing career\n\nThe jockey advised other young girls to reach out for support in pursuing their dreams, instead of waiting to be approached\n\n'There are loads of people out there to support and help you. Keep persevering. If it doesn’t quite work out as planned, keep going.\n\n'I have been riding for seven years, I have fallen off, I have had broken broken. But i still love it. Keep going.‘\n\nShe also praised Camilla for her support for Ebony and revealed that she had written to her after her historic win.\n\n‘To have the duchess's support, it's amazing,' she said. 'It is so incredible to have the royal family’s support for Ebony and my story. They have been so supportive.'\n\n'The duchess wrote to me afterwards and I have the letter framed! She hand-wrote it - she is amazing.'\n\nBased in Brixton, Ebony Horse Club is a community riding centre teaching riding and horse care with the aim of helping children to learn new skills, develop aspiration and take on new responsibilities.\n\nThrough youth services work, the charity mentors children, giving support to those that need it most. This year, Ebony has provided 1700 rides to 110 riders per week.\n\nHer Royal Highness became President of Ebony Horse Club in 2009.\n\nThe Duchess of Cornwall sat next to Khadijah Mellah during the premiere of Riding A Dream at the Ritzy Cinema in Brixton\n\nThe Royal shared with popcorn with the 18-year-old racer while they watched the film alongside other viewers", "description": "Camilla, 72, joined Khadijah Mellah, 18, for the screening of an ITV film about her life in Brixton, London today. She won the Magnolia cup on 1st August 2019.", "authors": ["Rebecca English Royal Correspondent For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/20/20296012-0-image-a-68_1572293507867.jpg", "published_at": "2019-10-28"}