{"pub": "cnn", "url": "https://cnn.com/2019/09/04/investing/uber-lyft-ipo-market/index.html", "downloaded_at": "2019-09-05 10:29:33.854361+00:00", "title": "Uber and Lyft both hit all-time lows and continue to struggle since their IPOs", "language": "en", "text": "New York (CNN Business) Uber and Lyft have been huge flops since they debuted on Wall Street earlier this year. Shares of both companies are trading more than 30% below their initial public offering prices.\n\nplunged more than 7% Tuesday and hit a new all-time low Wednesday before recovering a bit.dropped nearly 6% Tuesday to hit a record low before rebounding a bit Wednesday.\n\nInvestors want \"evidence of light at the end of the profitability tunnel,\" said Daniel Morgan, senior portfolio manager with Synovus Trust Company.\n\nBoth companies recently lost massive amounts of money — Uber posted a more-than $5.2 billion loss in the second quarter, while Lyft reported a loss of nearly $650 million . Neither company is expected to be profitable in 2020 or 2021 either.\n\nLyft did post stunning revenue growth, however. Sales were up more than 70% from the same quarter a year ago. But Uber's revenue increased by a far more pedestrian rate of 13% from last year's second quarter.\n\nUber is much larger than Lyft, so it's not a surprise that its sales aren't growing as rapidly as Lyft's. But with all the hype surrounding Uber's IPO, it is disappointing that revenue isn't increasing at a faster rate, Morgan said.\n\nUnicorns without wings\n\nCan Uber and Lyft ever live up to the hype that surrounded them before their IPOs?\n\nMorgan's firm still has small positions in both companies. But he remains skeptical about their valuations — even after their massive drops. \"How will either Uber of Lyft get to profitability? There are still concerns about froth in their stock prices,\" he said.\n\nFacebook FB Amazon AMZN Sure, some may remember how shares inalso flopped in the first few months after its IPO in 2012 — it has since surged because strong sales and profit growth.lost money for years before finally becoming profitable.\n\nSo if you are an investor planning for long-term goals like retirement, it could be worth taking a flier on Uber and Lyft. They very well could become market darlings for the next few decades.\n\nBut Facebook and Amazon are undeniable market leaders — and they were even when they went public.\n\nUber and Lyft are in a very different spot. First, they are formidable threats to one another. Uber also has to contend with competition from Didi, Ola, Grab and Careem in international markets.\n\nGrubHub GRUB And outside of ridesharing, the UberEats delivery business still has big rivals in DoorDash and\n\nUber won't break even until 2023, predicts Stifel analyst Scott Devitt, who has a \"hold\" rating on the company.\n\nInvestors are also growing skeptical about the ability of Uber, Lyft and many other high profile unicorns to earn a profit in the foreseeable future, Morgan noted.\n\nProfits needed to justify the hype\n\nIt's not just consumer companies like Uber and Lyft that are bleeding red ink.\n\nSlack WORK , whose messaging tools are the darling of many workplaces ( including CNN ) continues to lose money. It's expected to report a quarterly loss of nearly $270 million on Wednesday when it reveals its first financial results since its direct listing.\n\nAnd We Company, the owner of WeWork, revealed in its recent IPO filing that it lost more than $900 million in the first half of 2019.\n\nThese losses might not be a problem if not for the fact that the US economy appears to be slowing. Many experts fear that a recession is possible sometime in 2020.\n\n\"The pessimism surrounding WeWork is affecting Uber and Lyft,\" Morgan said. \"These are all companies with no earnings. What happens if the economy turns south?\"", "description": "Uber and Lyft have been huge flops since they debuted on Wall Street earlier this year. Shares of both companies are trading more than 30% below their initial public offering prices.", "authors": ["Paul R. La Monica", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190904092522-lyft-car-super-tease.jpg", "published_at": "2019-09-04"}