{"pub": "cbc", "url": "https://cbc.ca/sports/basketball/basketball-world-cup-canada-jordan-recap-1.5274710", "downloaded_at": "2019-09-07 13:40:07.000337+00:00", "title": "Sports-no-CBC", "language": "en", "text": "A FIBA record for three-point shots. And a thoroughly dominant victory that will help Canada's chances of earning a ticket to Tokyo.\n\nIn a FIBA World Cup that hasn't gone Canada's way, finally things are falling in their favour.\n\nKyle Wiltjer poured in seven threes in a 29-point performance, and Canada shot the virtual lights out in a 126-71 rout of Jordan in their penultimate World Cup game, improving their tournament record to 2-2.\n\n\"It's fun to watch when our team is letting it fly like that,\" said guard Kevin Pangos. \"We have a lot of guys who can shoot it. Everyone was just encouraging each other to let it fly.\"\n\nMelvin Ejim had 13 points, Cory Joseph chipped in with 11, and Pangos finished with 10 for the No. 23-ranked Canadians, who ran roughshod over No. 49 Jordan.\n\nWorld Cup record\n\nCanada's 24 three-pointers was a FIBA World Cup record, beating the 19 threes made by the American team twice in 1994. The Canadians shot 56 per cent from three on the night, and 65 per cent from the field.\n\nThe \"fun\" night was welcome relief for a team who faced an uphill battle in China, drawn into the tournament's toughest group that all but eliminated any hope for advancing and earning an automatic berth for next summer's Olympics.\n\nRelegated to the classification round — which determines 16th to 32nd place — after losses to powerhouses Lithuania and Australia, the Canadians' focus shifted to simply earning a spot in one of the four second-chance Olympic qualifying tournaments next summer.\n\n\"For us, our main goal is to make the Olympics, so every game we have to get better as a program, so I think we did that today, and just building that camaraderie going forward,\" Wiltjer said.\n\nWiltjer on fire\n\nWiltjer was 7-for-9 from deep on Saturday, and was asked in the post-game press conference if he holds the family scoring record. Wiltjer's dad Greg played for Canada.\n\n\"Probably. [My dad] was more of a rebounder. I'll talk a little smack tonight with him,\" Wiltjer said with a laugh.\n\nThe Canadians were coming off an 82-60 victory over Senegal to end the preliminary round, the country's first World Cup win since 2002. They wrap up the World Cup on Monday against Germany.\n\nThe Canadians thoroughly dominated a Jordan team that was outscored by 77 points in the preliminary round and looked disinterested and unorganized on defence on Saturday. They left Canada's shooters wide open on the perimeter and allowed them to waltz their way in for easy lay-ups and dunks.\n\n\"I thought our guys did a good job, took a real professional approach, we're trying to play tough defence as much as we can and share the ball on offence, play a driving and kicking out to three-point style offence, and today that was going pretty well obviously,\" said coach Nick Nurse. \"I'm just glad I think every guy we put out on the floor went out there and played with some energy, some focus, and real professionalism.\"\n\nCrowd roars with delight at shooting spectacle\n\nCanada shot 6-for-8 from behind the arc in the first quarter, and when Joseph connected on a half-court shot at the buzzer, the enthusiastic crowd of mostly high school kids at Shanghai Oriental Sports Centre roared with delight. Canada led 31-13 to end the first.\n\nThe Canadians never let up in what looked like a virtual clinic, hitting threes and throwing down dunks including a rare Wiltjer alley-oop dunk from Joseph late in the first half. Canada took a 63-35 lead into the halftime break, and led 99-50 after three quarters.\n\nTheir smooth ball movement — Canada had 37 assists — had Jordan on its heels all night.\n\n\"I think it's great when most of your shots are a good percentage,\" Nurse said. \"I think assisted baskets hold up in tough games, assisted baskets hold up in tournament-style play, etc., so it's always a big focus.\"\n\nDespite Saturday's rout, the World Cup will be deemed a disappointment for Canada, with a narrative dominated by who didn't show up to play. While Canada is bursting with young basketball talent, winning the U19 World Cup in 2017 and boasting the second most players in the NBA outside of the U.S., the wealth of talent hasn't translated to the senior men's side. Joseph and Khem Birch are Canada's only NBA players in China.\n\nCanada's only hope of a Tokyo berth now is playing in a one of the four second-chance tournaments — and winning it. The Olympic tournament has only 12 teams, and all but four of the Tokyo berths will be decided at the World Cup.\n\nThe Canadian men haven't played on the Olympic stage since the 2000 Games. They played a second-chance tournament in 2016 but lost to France in the final.", "description": "Kyle Wiltjer had seven three-pointers and 29 points to lead Canada's men's basketball team to a 126-71 rout of Jordan at the FIBA World Cup on Saturday.", "authors": [], "top_image": "https://i.cbc.ca/1.5274713.1567859139!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/china-basketball-world-cup.jpg", "published_at": "2019-09-07"}