{"pub": "cnn", "url": "https://cnn.com/2019/10/27/world/five-things-october-27-trnd/index.html", "downloaded_at": "2019-10-28 07:35:39.370911+00:00", "title": "News this week: Start your Monday smart", "language": "en", "text": "If your day doesn't start until you've gotten up to speed on the latest headlines, then let us introduce you to your new favorite morning fix. Sign up here for the '5 Things' newsletter.\n\nGet '5 things' in your inbox\n\n(CNN) Here's what you need to know to Start Your Week Smart .\n\n(You can also get \"5 Things You Need to Know Today\" delivered to your inbox daily. You give us five minutes, and we give you five things you must know for your weekday, plus a Sunday edition to get your week started smart. Sign up here .)\n\nTODAY\n\nTo those who celebrate: May your life be as colorful, shimmering and magical as the lights of Diwali! We hope the glow of the Festival of Lights shines on you all year long.\n\nIt's been one year since the massacre at a Pittsburgh synagogue. Memorial events are scheduled in the Squirrel Hill community under tight security . Almost a third of US respondents to a recent poll have avoided wearing or displaying things in public that would identify them as Jews , while the incidence of harassment of Jews remains high.\n\nAll the victims from the Pittsburgh synagogue shooting\n\nAll the victims from the Pittsburgh synagogue shooting 02:02\n\nAll the victims from the Pittsburgh synagogue shooting\n\n• The Bidens appear on '60 Minutes.' for the Democratic presidential nomination and his wife spoke with CBS. The interview broadcasts The front-runner for the Democratic presidential nomination and his wife spoke with CBS. The interview broadcasts at 7:30 p.m. ET\n\nJUST WATCHED CNN poll: Biden leading over 2020 Democratic rivals Replay More Videos ... MUST WATCH CNN poll: Biden leading over 2020 Democratic rivals 03:37\n\nJUST WATCHED Controversy over Dave Chappelle's Michael Jackson comments Replay More Videos ... MUST WATCH Controversy over Dave Chappelle's Michael Jackson comments 01:50\n\nMONDAY\n\nJUST WATCHED Missouri rules against state's last abortion clinic (June) Replay More Videos ... MUST WATCH Missouri rules against state's last abortion clinic (June) 00:58\n\n• A Missouri abortion clinic's fate is debated. Planned Parenthood and the state's Republican governor go head-to-head over the clinic's license. State officials reportedly have Planned Parenthood and the state's Republican governor go head-to-head over the clinic's license. State officials reportedly have asked for enhanced security ahead of the administrative hearing. At issue is a law that effectively would shutter an abortion clinic, making Missouri the only state without such a medical site.-\n\n• A key witness testifies in the impeachment inquiry. Ex-Deputy Assistant to the President for National Security Affairs Charles Kupperman is expected to appear in a closed session. He reportedly listened in on Ex-Deputy Assistant to the President for National Security Affairs Charles Kupperman is expected to appear in a closed session. He reportedly listened in on the call between Donald Trump and Ukraine's President that's at the center of the probe.\n\nJUST WATCHED McConnell on call: You'll have to ask him, I don't recall Replay More Videos ... MUST WATCH McConnell on call: You'll have to ask him, I don't recall 00:55\n\n• Trial starts for a suspect in a Colorado mom's death. Patrick Frazee Patrick Frazee is due in court . He's accused of killing Kelsey Berreth, his fiancée and the mother of his young daughter. His girlfriend, who is cooperating with prosecutors, has told investigators that Frazee killed Berreth, then disposed of her remains.\n\nJUST WATCHED Charges filed in missing Colorado mom case Replay More Videos ... MUST WATCH Charges filed in missing Colorado mom case 00:49\n\nWEDNESDAY\n\n• The Fed chair speaks. In what is always an anticipated moment, Jerome Powell is In what is always an anticipated moment, Jerome Powell is set to take the mic following a two-day Federal Open Market Committee meeting. Experts expect another rate cut\n\nJUST WATCHED Federal Reserve cuts interest rates again (September) Replay More Videos ... MUST WATCH Federal Reserve cuts interest rates again (September) 00:52\n\nTHURSDAY\n\n• The Brexit deadline lands. This has long been circled as the date the UK would depart the EU. But Prime Minister Boris Johnson has This has long been circled as the date the UK would depart the EU. But Prime Minister Boris Johnson has conceded that he won't meet the deadline . He wants lawmakers to agree to a December 12 election in return for more time to debate his Brexit proposal. Meantime, the EU must grant an extension, or the UK will bounce out of the union in a dreaded \"no-deal\" scenario.\n\nJUST WATCHED Here's what you need to know about Brexit Replay More Videos ... MUST WATCH Here's what you need to know about Brexit 03:17\n\n• Another impeachment inquiry witness appears. Timothy Morrison, a top Russia and Europe adviser on the National Security Council, is due to Timothy Morrison, a top Russia and Europe adviser on the National Security Council, is due to corroborate that Trump pressed Ukraine for political help in return for US aid.\n\nJUST WATCHED Making sense of quid pro quo and the people involved Replay More Videos ... MUST WATCH Making sense of quid pro quo and the people involved 02:35\n\n• Happy Halloween! It's all It's all costumes and candy as we mere mortals mark a holiday that tests the bounds of what's real.\n\nJUST WATCHED Behind the scenes of a haunted house attraction Replay More Videos ... MUST WATCH Behind the scenes of a haunted house attraction 04:27\n\nFRIDAY\n\nJUST WATCHED Experience the Day of the Dead in Mexico Replay More Videos ... MUST WATCH Experience the Day of the Dead in Mexico 01:50\n\n• The US economy gets its health results. The The October jobs report is released, along with a manufacturing report . Both are seen as key indicators of the health of the American economy.\n\nJUST WATCHED How to read the jobs report Replay More Videos ... MUST WATCH How to read the jobs report 01:31\n\n• A new binge-watching option arrives. Apple TV+ Apple TV+ launches . The new streaming service will include original content from Oprah, a new show starring Reese Witherspoon and Jennifer Aniston, and collaborations with Steven Spielberg and J.J. Abrams.\n\nJUST WATCHED 'Oprah's Book Club' is coming to Apple TV+ Replay More Videos ... MUST WATCH 'Oprah's Book Club' is coming to Apple TV+ 01:20\n\nSATURDAY\n\n• The Rugby World Cup champ is crowned. They've survived pounding rain in host nation Japan and repeated hammering by their rivals. The world's greatest They've survived pounding rain in host nation Japan and repeated hammering by their rivals. The world's greatest will emerge in the final\n\nJUST WATCHED 'Rock-and-roll' rugby to seeking to capitalize on World Cup success Replay More Videos ... MUST WATCH 'Rock-and-roll' rugby to seeking to capitalize on World Cup success 01:20\n\n• UFC 244 comes to Madison Square Garden. takes center stage at the famed New York venue. Watch starting at 10 p.m. ET Mixed martial arts takes center stage at the famed New York venue. Watch starting at 10 p.m. ET on ESPN+", "description": "Missouri abortion law, impeachment, Patrick Frazee, Brexit, Halloween. Here's what the next six days will bring.", "authors": ["Michelle Krupa"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191023131551-trick-or-treater-stock-super-tease.jpg", "published_at": "2019-10-27"}