{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/apple-wants-to-freak-you-out", "downloaded_at": "2019-09-26 23:48:28.465689+00:00", "title": "Apple Wants To Freak You Out", "language": "en", "text": "Photo: Alex Cranz, Gizmodo\n\nHere we go again.\n\nIn a new notice that surfaced on its support page this week, Apple says that its newest generation of iPhones will now prominently display a message meant to deter third-party display repairs. It’s a move that again stresses the reality that Apple and Apple alone wields the power to decide who is and is not allowed to repair your iPhone.\n\nIf you need a display repair on your iPhone, the notice states, “it’s important for certified technicians who use genuine Apple display parts to repair it.” Those certified technicians include Apple, Authorised Service Providers, or Independent Repair Providers who have been approved by — you guessed it — Apple to perform repairs using OEM parts and tools.\n\n“Replacements not performed by Apple, authorised service providers, or certified technicians might not follow proper safety and repair procedures and could result in improper function or issues with display quality or safety,” Apple said. “Apple displays are designed to fit precisely within the device. Additionally, repairs that don’t properly replace screws or cowlings might leave behind loose parts that could damage the battery, cause overheating, or result in injury.”\n\nImage: Apple\n\nA lot of what Apple claims here appear to be big “what ifs,” namely that injury during a repair could occur if not performed by Apple or one of its partners, or that improperly replaced parts could result in injury or damage to the device. Apple says that issues that may occur with a non-genuine display include issues with display-specific iOS updates, Multi-Touch performance, display colour and brightness, and True Tone functionality. (iFixit noted in its iPhone 11 teardown that True Tone would be disabled during repair without Apple’s special tools but added that “at least the display is still user-swappable.”)\n\nOn its newest generation of iPhones — iPhone 11, iPhone 11 Pro, and iPhone 11 Pro Max — Apple says that displays that are unable to be verified by the device will deliver an “important display message” about it that will linger on the lock screen for four days, appear in Settings for 15 days, and display indefinitely in the About section in General. You know, just in case you missed it.\n\nThis freaky display message is not the first that Apple has used to spook its users into deferring to Apple-approved repair outfits rather than, say, a yet-to-be-certified independent repair outfit or doing the repair yourself. Just last month, both The Art of Repair and iFixit surfaced another service message that appears on the iPhone XR, XS and XS Max when a replacement battery has not been authenticated to the device, indicating that Apple is essentially software-locking batteries to its phones.\n\nLike the display message, the battery message informs the user that the device is not able “to verify this iPhone has a genuine Apple battery.” When this message appears, users are unable to access important information about their battery health. Moreover, and proving that Apple believes it alone gets to decide who can repair the stuff you own, iFixit found that the issue persisted even with a legitimate Apple battery. (We reached out to Apple to see if the same would apply to display replacements and did not immediately hear back. iFixit reported that it does.)\n\nIn a somewhat surprising move, Apple announced last month that it would begin supplying independent repair shops with the necessary OEM tools, diagnostics, parts and training to repair its iPhones.\n\nWhile a welcome shift away from its previous pearl-clutching monopoly on repair, independent repair outfits must apply to join the program, and Apple said it “reserves the right to reject any application without comment.” Plus, while the move widens the pool of options you have for where to have your phone repaired, it stops short of allowing you to do the repair yourself (or to have someone of your choosing with the technical know-how to do it for you).\n\nWhile this latest notice doesn’t seem particularly surprising coming from a company with a history of hostile aversion to right to repair, it does serve as a reminder that Apple still maintains a stupid amount of control over the device you rightfully own.", "description": "Here we go again.", "authors": ["Sarah Basford", "Catie Keck"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/eui3d3pvkr198ff8qqkh.jpg", "published_at": "2019-09-26"}