{"pub": "fox", "url": "https://foxnews.com/media/hannity-blasts-adam-schiff-trump-impeachment-inquiry-democrats", "downloaded_at": "2019-10-24 04:32:56.285909+00:00", "title": "Hannity blasts Adam Schiff, says he doesn't want impeachment transcripts public for fear of exposing 'corrupt narrative'", "language": "en", "text": "Sean Hannity on Tuesday night slammed House Intelligence Committee Chairman Adam Schiff, D-Calif., claiming closed-door Trump impeachment inquiry hearings he is overseeing remain hidden from many Republicans, the White House and the public because of the \"corrupt narrative\" they could expose.\n\nHannity said former Presidents Richard Nixon and Bill Clinton faced much more transparent impeachment proceedings, with then-House Speaker Newt Gingrich using the 1970s as a model for his caucus' inquiry into Clinton.\n\nHowever, Schiff's hearings, though secretive, are not going well for the Democrats, the \"Hannity\" host claimed.\n\nHannity said he has sources who claim the impeachment inquiry proceedings are, \"blowing up in the corrupt Schiff's face.\"\n\nLAWMAKER LEADING CHARGE TO CENSURE ADAM SCHIFF SAYS HE'S ENGINEERING 'TOTAL POLITICAL HIT JOB' ON TRUMP\n\n\"Nothing is transparent,\" he said.\n\n\"Democrats don't want these transcripts to become public because it will destroy this phony, corrupt narrative. Instead, they want to control all the information so they can selectively leak that one sentence that they think helps them.\"\n\nHannity accused Schiff and other top Democrats of \"editorializing\" testimony in order to garner further opposition to President Trump.\n\n\"The whole process is more corrupt, lacking all due process, all constitutionality, and constitutional protections. It is based on utter and complete nonsense. All the president is really guilty of is faithfully executing the laws of this land and fulfilling his constitutional duty,\" he said.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe host also claimed Schiff and other Democrats involved in the inquiry are \"a lawless mob\" that continues to disregard the truth and reject legislative norms.\n\nClaiming Schiff is operating in a cowardly manner, Hannity said the impeachment proceedings must be rejected in order to ensure the U.S. continues to be a functioning Republic.\n\n\"We better stop or we're not going to have a country, and yes it's that serious,\" he said.\n\n\"Adam Schiff -- he is holding secret hearings, secret meetings, that result in secret transcripts all hidden from the American people.\"", "description": "Sean Hannity on Tuesday night slammed House Intelligence Committee Chairman Adam Schiff, D-Calif., claiming closed-door Trump impeachment inquiry hearings he is overseeing remain hidden from many Republicans, the White House and the public because of the \"corrupt narrative\" they could expose.", "authors": ["Charles Creitz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/694940094001_6096898958001_6096890350001-vs.jpg", "published_at": "2019-10-23"}