{"pub": "yahoo", "url": "https://news.yahoo.com/ethiopia-pm-abiy-warns-ethnic-violence-could-worsen-195343070.html", "downloaded_at": "2019-10-27 00:35:45.166004+00:00", "title": "Ethiopia PM Abiy warns ethnic violence could worsen", "language": "en", "text": "Ethiopia's Prime Minister Abiy Ahmed, pictured October 23, 2019, has raised the prospect of more ethnic violence (AFP Photo/Sergei CHIRIKOV)\n\nAddis Ababa (AFP) - Ethiopian Prime Minister Abiy Ahmed warned Saturday of further instability and vowed to bring to justice those responsible for violence that left at least 67 people dead this week.\n\n\"The crisis we have faced will become even more fearsome and difficult if Ethiopians don't unite and stand as one,\" Abiy said in a statement issued by his office, his first remarks since the violence broke out.\n\n\"We will unswervingly work to ensure the prevalence of the rule of law and to bring perpetrators to justice.\"\n\nThis year's Nobel Peace Prize laureate also noted that what began as protests against his government had quickly morphed into clashes that took on an ethnic and religious dimension.\n\n\"There has been an attempt to turn the crisis into a religious and ethnic one. In the process our comrades have become victims in terrible circumstances,\" he said.\n\nHe added that homes, businesses and places of worship had been destroyed, and that an untold number of Ethiopians had been displaced.\n\nViolence erupted in Addis Ababa, the capital, and in much of Ethiopia's Oromia region on Wednesday after a high-profile activist accused security forces of trying to orchestrate an attack against him -- a claim police officials denied.\n\nThe activist, Jawar Mohammed, is credited with promoting the protests that swept Abiy to power last year but he has recently become critical of some of the premier's policies.\n\nBoth men are from the Oromo ethnic group, Ethiopia's largest, and their feud highlights divisions within Abiy's Oromo support base that could complicate his bid for a five-year term when Ethiopia votes in elections currently planned for May 2020.\n\nOn Friday, Oromia police chief Kefyalew Tefera said 67 people had been killed there, including five police officers.\n\nHe said most of the dead had lost their lives in \"clashes between civilians\" rather than at the hands of security forces.\n\nHe also claimed that calm had been restored but the defence ministry announced Friday that it was deploying forces to seven hotspots to restore order, and reports of violence persisted through Friday night and into Saturday.\n\nAbiy was in Sochi, Russia, for the Russia-Africa summit when Jawar's supporters first started mobilising in Addis Ababa.\n\nPrior to Saturday's statement, he was facing criticism for saying nothing about the unrest.\n\nIn an interview with AFP Friday, Jawar accused Abiy of acting like a dictator and said he could challenge his former ally in next year's elections.\n\nBut Jawar said he could also end up backing Abiy if he changes course.\n\nUnited States Ambassador Michael Raynor said in a statement Saturday that Washington was \"deeply troubled by the recent hatred, inflammatory language, and violence.\n\n\"For Ethiopia to build the peaceful, prosperous, and politically inclusive future that so many of you tell us you want to see, Ethiopians must unify around, and work toward, that vision,\" Raynor said.\n\n\"Anyone who undercuts these efforts undercuts the best interests of all Ethiopians, now and in the future.\"", "description": "Ethiopian Prime Minister Abiy Ahmed warned Saturday of further instability and vowed to bring to justice those responsible for violence that left at least 67 people dead this week.  \"The crisis we have faced will become even more fearsome and difficult if Ethiopians don't unite and stand as", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/wnsJFpPc_B6S_okQEMh_QQ--~B/aD01MTA7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/bcbb417f3961edd280b53f80fd5a22316c95b4f8.jpg", "published_at": "2019-10-26"}