{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7590875/Janet-Jackson-53-keeps-comfy-bright-orange-jacket-lands-JFK.html", "downloaded_at": "2019-10-19 12:33:47.623678+00:00", "title": "Janet Jackson, 53, keeps it comfy in a bright orange jacket as she lands at JFK", "language": "en", "text": "She's a doting mother to her son Eissa, two, and has recently been touring.\n\nSo Janet Jackson is naturally keen to keep things comfortable where she can - as proved when she made her way through JFK airport in New York City on Friday.\n\nThe singer, 53, wrapped herself up from the cold in her travel uniform of a bright orange puffer jacket for the third time this month.\n\nWrapped up: Janet Jackson, 53, kept it casual at JFK airport in New York City on Friday as she donned a bright orange puffer jacket and black sweatpants\n\nJanet looked relaxed in black sweatpants with a long tie at the waist and donned a pair of platform sneakers to boost her petite frame.\n\nShe accessorised her on-the-go ensemble with a pair of dark aviator sunglasses and wore a black beanie hat over her curly locks.\n\nAs the mother-of-one left the airport she toted a black leather backpack with a silver zip and wrapped a black scarf around her neck.\n\nJanet was also seen wearing the same uniform on October 6 and 9, proving that comfort really is key for frequent fliers.\n\nComfy: The singer accessorised her look with dark sunglasses a beanie and and warm scarf\n\nMissing from Janet's trip was her Eissa Al Mana, whom she shares with her ex-husband, Qatari businessman Wissam Al Mana.\n\nThe star has previously admitted that it can be challenging juggling life in the spotlight with raising Eissa.\n\n'It is hard being a working mother. I don't have a nanny, I do it all myself,' she told Stellar magazine. 'Of course, when I'm working someone watches him, but it's my baby and me,' Janet added.\n\nSolo: Missing from her plane trip was her two-year-old son Eissa, whom she shares with ex-husband Wissam Al Mana; pictured together in 2013\n\nThe five-time Grammy Award-winner went on explain that fame isn't for everybody.\n\nShe added: 'You really have to be thick-skinned for this. You can really go in the wrong direction, there's so much temptation, all kinds of crazy things.'\n\nThe Grammy-winning artist has been touring to commemorate the 30th anniversary of her album Rhythm Nation 1814.\n\nOld flame: Janet and Wissam (pictured in 2015) married in 2012, but they clashed over his conservative beliefs, which required her to wear baggy clothing\n\nThis was her top-selling album that spawned a series of hits including the title track, Miss You Much, Escapade, Come Back to Me and Love Will Never Do (Without You).\n\nJanet is among the ranks of big names to undertake Las Vegas residencies with her Metamorphosis show at the Park MGM, which ran from May to August.\n\nThe sister of the late Michael Jackson has amassed one of the most impressive resumes in entertainment, including two Emmys and a Golden Globe.\n\nShe was nominated for an Oscar for 1993 ballad Again from the drama Poetic Justice, which she made with late legends John Singleton and Tupac Shakur.", "description": "The singer, 53, wrapped herself up from the cold in her airport uniform of a bright orange puffer jacket and a beanie, which she has worn at least three times this month, as she landed at JFK on Friday.", "authors": ["Bryony Jewell For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/10/19916948-0-image-a-89_1571478356729.jpg", "published_at": "2019-10-19"}