{"pub": "breitbart", "url": "https://breitbart.com/2020-election/2019/10/23/donald-trump-wheres-the-whistleblower", "downloaded_at": "2019-10-24 02:36:01.287462+00:00", "title": "Donald Trump: ‘Where’s the Whistleblower?’", "language": "en", "text": "President Donald Trump questioned Wednesday the sudden disappearance of the anonymous “whistleblower” who triggered Democrats to launch an impeachment inquiry against him.\n\n“Where’s the Whistleblower?” he asked on Twitter.\n\nThe anonymous “whistleblower” and his accusation against the president was the focus of Democrats and the establishment media for weeks until it was learned House intelligence chairman Adam Schiff had contact with him prior to filing his complaint.\n\n“Where is the Whistleblower?” Trump wrote again on Wednesday morning on Twitter. “The Do Nothing Dems case is DEAD!”\n\nThe identity of the “whistleblower” remains hidden from the public. Democrats have vowed to protect the identity of the “whistleblower” but Republicans question whether or not the person even meets the criteria of a whistleblower.\n\n“There is no whistleblower,” Rep. Paul Gosar wrote on Twitter Wednesday. “There is a leaker who illegally released information. Calling a traitor a ‘whistleblower’ does not make it so.”\n\nTrump continues challenging the “whistleblower’s” claim of a “quid-pro-quo” case of the president withholding federal aid from Ukraine until they publicly announced an investigation into former Vice President Joe Biden’s son Hunter Biden’s role in a Ukrainian energy company and Ukrainian meddling in the 2016 election.\n\nTrump also dismissed the “whistleblower’s” accusation last week while speaking with reporters at the White House, noting Schiff no longer wanted him to testify in front of Congress.\n\n“The whistleblower didn’t know what he was talking about, or was given false information, or it was even worse than that,” Trump said. “Now, all of a sudden, Schiff doesn’t want to talk to the whistleblower.”\n\nWhere’s the Whistleblower? — Donald J. Trump (@realDonaldTrump) October 23, 2019\n\nRepublicans are going to fight harder than ever to win back the House because of what the Do Nothing Democrats have done to our Country! — Donald J. Trump (@realDonaldTrump) October 23, 2019", "description": "President Donald Trump questioned Wednesday the sudden disappearance of the anonymous whistleblower who triggered Democrats.", "authors": ["Charlie Spiering"], "top_image": "https://media.breitbart.com/media/2019/06/GettyImages-1156794020-640x335.jpg", "published_at": "2019-10-23"}