{"pub": "investing.com", "url": "https://investing.com/news/forex-news/these-asia-hold-outs-are-one-shock-away-from-quantitative-easing-2003834", "downloaded_at": "2019-10-25 03:35:14.477725+00:00", "title": "These Asia Hold Outs Are One Shock Away From Quantitative Easing", "language": "en", "text": "(Bloomberg) -- A trio of central banks that weathered the global financial crisis without having to resort to unorthodox measures now confront the prospect that they might have little alternative if their economies get any worse.\n\nIt’s a sobering prospect for policy makers from South Korea, Australia and New Zealand, whose economies’ trade ties with China helped shield them in 2008-09.\n\nAll three have cut interest rates to record lows to try to spur economic growth and rekindle inflation. But the muted response so far has fueled expectations they will inevitably have to follow the Federal Reserve, European Central Bank and Bank of Japan down the path to quantitative easing.\n\n“The probability of at least one of them doing QE is now quite high,” said Shane Oliver, chief economist at AMP Capital Investors Ltd. in Sydney, who late last year led the field in predicting Australia would resume easing in 2019. “Central banks have mandates, and when they’re not delivering on those mandates, they have to do something. QE is something they can do.”\n\nWhile officials from the Bank of Korea and the reserve banks of Australia and New Zealand publicly acknowledge that they are reviewing options for unorthodox measures, they’ve also made clear they would be reluctant participants in such a venture.\n\nIn a packed room of officials, economists and investors in Washington last week, RBA Governor Philip Lowe pushed back against a suggestion that unorthodox policy was inevitable in his country.\n\n“I don’t think it’s the right assumption to make that we are going to have a lot more work to do to get inflation back to target and growth back to trend,” he said during a session at the International Monetary Fund’s annual meetings.\n\nThe RBA board held its first formal discussion of unconventional options at its August meeting, with members reviewing the experience of overseas peers. The key topics were negative rates, forward guidance, lowering risk-free rates via bond purchases, providing long-term funding to banks to support credit creation, purchasing private-sector assets and currency-market intervention.\n\nNew Zealand has sounded slightly less reticent, especially after shocking markets with a half-point rate cut in August. The RBNZ says nothing is off the table after canvassing options along the lines of those reviewed by the RBA.\n\nIt’s a similar story in Seoul. Governor Lee Ju-yeol insisted after cutting to a fresh record this month that Korea doesn’t currently need unconventional measures to support growth and prices. Yet he also suggested that tools like quantitative easing might have a place by adding that the BOK was exploring alternative options should its room for maneuver shrink.\n\nWhile economists see the benefits of buying bonds in the case of a shock or financial crisis, the benefits of purchasing debt to stimulate the economy and boost risk appetite among investors is less clear, especially when long-term yields are already low.\n\n“With tough economic conditions, South Korea’s yield curve is chronically flat,” said Cho Yong-gu, a fixed-income strategist at Shinyoung Securities, casting doubt on the advantages of buying bonds under current conditions. “It makes sense to question whether there’s any point in doing it.”\n\nWith the RBA’s cash rate at 0.75%, New Zealand at 1% and South Korea at 1.25%, scope for conventional action is narrowing. And with the IMF projecting the weakest global growth since the financial crisis, small open economies like South Korea, Australia and New Zealand are vulnerable to some sort of offshore upheaval.\n\n“It is undeniable that these countries are running out of space for a normal response to a global shock,” said Shaun Roache, Asia-Pacific Chief Economist, S&P Global Ratings.\n\nThe BOK cut last week after consumer prices dropped for the first time on record in September. Exports plunged 20% in the first 20 days of this month, putting the trade-dependent economy on track for an 11th monthly decline.\n\nThe RBA also cut this month, bringing total reductions since June to 75 basis points. Yet major banks only passed on three quarters of that total to mortgage holders.\n\nLowe estimates Australia’s lower bound is around the level reached by the Bank of Canada, Bank of England and Fed: 0.25-0.5%.\n\nFor AMP’s Oliver, the logic of QE is that unemployment and under-employment -- or underutilization -- are at 13.5% and Lowe wants to lift wages growth to 3%; yet in the U.S., he notes, it has taken under-utilization of 6.9% to get those sorts of pay gains.\n\nCompounding that, Australia’s population is rising rapidly, meaning the economy needs to expand at 3% or more to soak up labor market slack. Annual economic growth was just 1.4% in the most recent reading and inflation has been stuck below the bottom of the RBA’s 2-3% target for much of the past five years.\n\n“On current policy settings, I can’t see us getting there,” Oliver said. “Therefore, they’ve got to do something else.”\n\nGoldman Sachs Group Inc (NYSE: ). estimates the RBA could reach its inflation and employment goals by reducing rates to their lower bound -- estimated at 0-0.25% -- and implementing a QE program worth around A$200 billion ($137 billion).\n\nAcross the Tasman Sea, economists predict Governor Adrian Orr will cut New Zealand’s official cash rate to 0.75% in November. The most recent data suggest growth is slowing and while third-quarter inflation was a touch firmer than expected, the annual rate of 1.5% is below the RBNZ’s 2% target.\n\n“Their room for additional cuts is clearly shrinking,” said Alicia Garcia Herrero, chief Asia-Pacific economist at Natixis SA in Hong Kong. “In the case of Korea, the case for QE is specially strong since it might be specially costly not to follow major central banks in further easing as the economy cannot really bear a stronger won.”", "description": "These Asia Hold Outs Are One Shock Away From Quantitative Easing", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/pic07ddcab1bb375a549daad8b4cb93d82d.png", "published_at": "2019-10-24"}