{"pub": "indiatimes", "url": "https://indiatimes.com/technology/news/indian-origin-engineer-creates-ai-based-eye-scanner-to-detect-diabetes-with-95-accuracy-378051.html", "downloaded_at": "2019-10-18 07:06:38.471082+00:00", "title": "Indian-Origin Engineer Creates AI-Based Eye Scanner To Detect Diabetes With 95% Accuracy", "language": "en", "text": "Indian-origin engineer and his team has developed an AI-based screening system that can detect diabetic retinopathy with a 95.5 percent accuracy.\n\nReuters/Eyenuk\n\nThe developed system is capable enough of detecting it by itself without the need of any consultation from an expert ophthalmologist. The system is capable of delivering a reading in just one minute.\n\nThis was presented at the 123rd meeting of the American Academy of Ophthalmology.\n\nIn case you didn't know, diabetic retinopathy can develop over time with patients suffering from diabetes, especially ones who don't have a proper control over their blood sugar levels.\n\nHigh blood sugar levels can cause damage to tiny blood vessels behind the eye. This sometimes results in tiny budges protruding from these vessels, releasing fluid and blood straight into the retina.\n\nDon't Miss 430 SHARES\n\nThe constant release of this fluid results in swelling - also referred to as an edema - in a section of the retina that is crucial for our vision. If one ignores this and doesn't continue with the treatment, it can lead to permanent blindness.\n\nTreatments for diabetic retinopathy exist, but they work best when this condition is detected in the early stages. Due to this, ophthalmologists recommend getting tested every year to be on a safer side.\n\nReuters\n\nThe AI system dubbed EyeArt, (developed by Eyenuk Inc-- Founded by Indian-origin Engineer Kaushal Solanki) has shown positive results in previous studies. The system screened 893 patients with diabetes at 15 different medical locations. Results were later cross-verified by certified graders to get accurate results.\n\nUsing images of undialated pupils of the patients EyeArt's system was 95.5 percent accurate, with a specificity of 86 percent. Only some eyes required to be dilated to get accurate results, which revealed better results with 86.5-percent specificity and 97.4 percent accuracy.\n\nOverall more than 90 percent of the eyes scanned using EyeArt's AI system had diabetic retinopathy or some other eye disease as per reference standard.", "description": "Indian-origin engineer and his team has developed an AI-based screening system that can detect diabetic retinopathy with a 95.5 percent accuracy. The developed system is capable enough of detecting it by itself without the need of any consultation from an expert ophthalmologist. The system is capable of delivering a reading in just one minute.", "authors": ["Monit Khanna"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/eyeart_1571379522_800x420.jpg", "published_at": "2019-10-18"}