{"pub": "theverge", "url": "https://theverge.com/2019/10/11/20909475/microsoft-office-key-emoji-key-keyboards", "downloaded_at": "2019-10-11 12:30:10.732926+00:00", "title": "Microsoft has put dedicated Office and emoji keys on its new keyboards", "language": "en", "text": "Microsoft’s latest keyboards now include dedicated Office and emoji keys. The software giant was previously experimenting with an Office key on keyboards earlier this year, and now the company is launching a new Ergonomic and slim Bluetooth Keyboard that include the dedicated button. The Office key replaces the right-hand Windows key, and it’s used to launch the Office for Windows 10 app that acts as a hub for Microsoft’s productivity suite. You can also use the Office key as a shortcut to launch Word, Excel, PowerPoint, and more. Office key + W opens Word for example, while Office key + X opens Excel.\n\nAlongside the Office key, there’s also a new emoji key on these new keyboards. It will launch the emoji picker inside Windows 10, but you won’t be able to assign it to a specific emoji or even create shortcuts, unfortunately. An emoji key on a new Microsoft keyboard certainly seems unusual, but the company is really targeting this new hardware at businesses where Office is prevalent and emoji use is increasingly on the rise.\n\nWhile Microsoft is pushing these new Office and emoji keys, it’s not clear whether other third-party keyboards will ever adopt them. Most keyboards ship with the dedicated Windows key, and Microsoft has a licensing agreement in place for the use of the Windows key to ensure the appearance is the same everywhere. Microsoft has not yet revealed a similar licensing program for its new Office key.\n\nMicrosoft quietly launched these new keyboards at the company’s Surface hardware event last week, but they’ll be available in stores on October 15th. The Microsoft Ergonomic Keyboard will be priced at $59.99, and includes a fabric palm rest and is wired to a PC via a USB port. Microsoft’s smaller Bluetooth Keyboard is priced at $49.99, and it has Bluetooth 5.0 support with up to 3 years of battery life.", "description": "Microsoft’s latest keyboards come with new Office and emoji keys. The Office key can launch a hub for Microsoft’s productivity apps, or shortcuts to apps like Excel, Word, and more. The emoji key launches Windows 10’s emoji picker", "authors": ["Tom Warren", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/Tup8QwWpUs18W2jtOiLaK5dPN4o=/0x184:2640x1566/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19278253/twarren_microsoftkeyboard_1.jpg", "published_at": "2019-10-11"}