{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/07/nationals-reliever-roenis-elas-has-grade-right-hamstring-strain", "downloaded_at": "2019-09-08 11:39:18.467539+00:00", "title": "Nationals reliever Roenis Elías has a Grade 1 right hamstring strain", "language": "en", "text": "\n\nRoenis Elías has made just four appearances for the Nationals due to lingering hamstring pain. (John McDonnell/The Washington Post)\n\nATLANTA — Roenis Elías will miss more time, maybe weeks, with the same injury that kept him out for most of August. The Washington Nationals reliever has another Grade 1 hamstring strain, an MRI exam revealed, and soon will head north to visit with team doctors in Washington. That slims the bullpen down to just one left-hander, Sean Doolittle, and keeps Manager Dave Martinez from having the full list of options he expected for the stretch run of the season.\n\n“He’s a little less sore than he was last time, so that’s a good sign,” Martinez said, when asked how long Elías will be sidelined. “But we’ll know more after he sees the doctor.”\n\nElías first injured his hamstring Aug. 2 in his team debut. He was acquired from the Seattle Mariners at the trade deadline and had retired the first two hitters he faced. That led Martinez to keep him in the game for a second inning, but doing so meant Elías had to hit. Martinez told him not to hit — later saying he delivered the instructions in English and Spanish — but Elías did anyway, chopping a grounder over the pitcher’s mound. Then he sprinted toward first. Then he slowed down and grabbed his hamstring, and that’s when this whole process began.\n\nThe second injury came Thursday in the eighth inning of a 4-2 loss to the Atlanta Braves. Elías threw a pitch, his right leg seemed to buckle once he planted it, and he immediately called for Martinez and a team trainer to come check on him. He exited after a short conversation on the mound. The Nationals waited a day to give him an MRI, giving the swelling a chance to go down, then got unwanted news with a repeat of the Grade 1 strain. Because the roster has expanded for September and Washington is carrying 34 players, the Nationals don’t need to worry about placing Elías on the injured list. He has made just four appearances since joining the club.\n\nThe Nationals traded for Elías because they need a reliable lefty aside from Doolittle. They have since designated both Tony Sipp and Matt Grace for assignment. And even if Elías has struggled against lefties this season, an aberration compared to his career splits, Washington doesn’t have many matchup options. Doolittle is one, but Martinez hopes he will eventually take back the closer role. Wander Suero is another, but he’s a right-hander who has had an up-and-down season. The Nationals were banking on Elías improving against lefties and becoming a high-leverage specialist, a gamble that didn’t cost them much July 31.\n\nBut the worst-case scenario has reemerged. They again could have to wait awhile to see Elías back on the field.\n\nLINEUPS\n\nNationals (78-62)\n\nTrea Turner SS\n\nAdam Eaton RF\n\nAnthony Rendon 3B\n\nJuan Soto LF\n\nAsdrúbal Cabrera 2B\n\nRyan Zimmerman 1B\n\nVictor Robles CF\n\nYan Gomes C\n\nAustin Voth P\n\nBraves (88-54)\n\nRonald Acuna Jr. CF\n\nOzzie Albies 2B\n\nFreddie Freeman 1B\n\nJosh Donaldson 3B\n\nBrian McCann C\n\nMatt Joyce RF\n\nAustin Riley LF\n\nAdeiny Hechavarria SS\n\nJulio Teheran P\n\nRead more on the Washington Nationals:\n\nNationals unable to get key hit when they need it, fall again to Braves\n\nAfter a miracle comeback from a broken arm, Aaron Barrett aims to prove he belongs in MLB\n\nNats fan who snagged Kurt Suzuki’s walk-off homer: ‘I blacked out and then I caught the ball’\n\nPerspective: The Nationals have been fun for months now, but you wouldn’t know it by looking at the stands", "description": "Roenis Elías missed most of August with a hamstring strain. Then he re-injured it in a loss to the Atlanta Braves on Thursday night.", "authors": ["Jesse Dougherty", "Reporter Covering The Washington Nationals.", "September At Pm", "Jesse Dougherty Covers The Washington Nationals."], "top_image": "https://www.washingtonpost.com/resizer/X0NSugBeuuqLX2teC2cbK9iRMSA=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DGD7E3GPRMI6TJRABKIWK3L5WY.jpg", "published_at": "2019-09-07"}