{"pub": "breitbart", "url": "https://breitbart.com/news/saudi-fans-delight-in-west-bank-game-shrug-off-geopolitics", "downloaded_at": "2019-10-14 03:49:41.855311+00:00", "title": "Saudi fans delight in West Bank game, shrug off geopolitics", "language": "en", "text": "Riyadh (AFP) – Saudi football fans are delighted about their national team’s historic match Tuesday against their Palestinian “brothers” in the occupied West Bank, but dismiss suggestions it marks a gradual normalisation of ties between the kingdom and Israel.\n\nArab clubs and national teams have historically refused to play in the Palestinian territories — occupied by the Jewish state since 1967 — as it requires obtaining entry permits to Israel, a country most of them do not recognise.\n\n“This is not a normalisation. It is still occupied Palestine. For Saudi Arabia, there is no state called Israel,” football fan Saad told AFP, his eyes locked on a screen playing a Saudi match in a cafe along Tahlia street, a restaurant-lined thoroughfare.\n\n“It is a good thing to support sport in Palestine given the situation there,” said the 27-year-old. “The Palestinian cause remains a fundamental one for Saudi Arabia.”\n\nAfter defeating Singapore 3-0 last week, the Saudi national team will face Palestine on their home turf in the West Bank in the Asian qualifiers for the 2022 World Cup.\n\nThe game marks a change in policy for the kingdom, which has previously played matches against Palestine in third countries in line with a decades-long Arab boycott of the Jewish state.\n\nHowever, in recent years, common concerns over Iran are widely seen as having brought Gulf powerhouse Saudi Arabia and Israel — both staunch US allies — closer together.\n\n– No politics please –\n\nAccording to the Saudi Sports Authority, the decision to play in the West Bank was “at the request of the brothers in the Palestinian federation” and to ensure the team is “not deprived the chance to play at home and among its fans”.\n\nFor another of the Saudi football fans watching the match against Singapore, the historic match-up has nothing to do with politics.\n\n“For the Saudis and the Palestinians, the goal of the match is to qualify for the World Cup,” said 30-year-old Hazzaa, who sported a trimmed beard and a traditional red and white keffiyeh headdress.\n\nAbu Abdallah, a Saudi businessman, said he believed it was an honour for his country’s team to play the Palestinians amongst their people.\n\n“This is something rare to happen, and the kingdom would not take any step unless it was in the interest of the Palestinian people or Saudi Arabia,” he said.\n\n– ‘Balancing act’ –\n\nPalestinian football association chief Jibril Rajoub said on Thursday that the game, to be played at the Al-Ram Stadium which is recognised by FIFA, would not breach the boycott.\n\nStill, the Palestinian-led boycott, divestment and sanctions (BDS) movement said that while the match is not technically a breach, it came “in the context of dangerous official normalisation”.\n\nThe Popular Front for the Liberation of Palestine also said it “rejected normalisation through sport”.\n\nOfer Zalzberg, senior analyst with the International Crisis Group, said Saudi Arabia was attempting a “balancing act” of quietly moving closer to Israel while also seeking to keep the Palestinians satisfied.\n\n“The Saudis are yielding to Ramallah’s request of playing in the West Bank in order to offset a sense that they are normalising with Israel while ignoring Palestinian needs,” he told AFP, adding that official recognition of the Jewish state was unlikely.\n\nMajed, dressed in traditional white thobe robes and an NBA cap at the cafe screening the match, said he absolutely rejected normalisation of ties with Israel.\n\n“The occupied Palestinian territories must be returned to its people,” he told AFP.\n\n“I do hope that sports will bring peace to the region,” he added, right before jumping up to celebrate Saudi Arabia’s first goal.", "description": "Riyadh (AFP) – Saudi football fans are delighted about their national team’s historic match Tuesday against their Palestinian", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/13/08eab0_palestinian-women-saudi-arabia-national-football-team-flowers-saudi-fans-640x335.jpg", "published_at": "2019-10-13"}