{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/1/blame-it-on-the-juice-pitchers-set-for-homer-fille", "downloaded_at": "2019-10-01 09:27:12.595302+00:00", "title": "Blame it on the juice: Pitchers set for homer-filled October", "language": "en", "text": "Justin Verlander didn’t intend to alter his pitching strategy, not after 14 seasons as a major league ace. But then the home runs stopped making sense.\n\nA long drive by Yankees slugger Aaron Judge? The Houston Astros ace can live with that. This season, though, was full of surprises. Like when spindly utility man Ehire Adrianza drove a fastball into the right field party deck in Minnesota. Or the time light-hitting Angels infielder David Fletcher nearly put one into a parking lot beyond left field during a series in Monterrey, Mexico. Routine fly balls had become wall-scraping homers, and every hitter was suddenly strong enough to reach the second deck.\n\n“The game has changed completely,” Verlander said.\n\nExpect more of the same this October.\n\nHitters smashed a record 6,776 home runs in 2019, soaring past the previous high of 6,105 from two years earlier. It’s a rise of over 60% from 2014, a year before a seismic home run spike attributed to tweaks in the baseballs. Major League Baseball commissioned a study in 2018 that concluded there was less drag on the ball causing all those extra homers, but Commissioner Rob Manfred has insisted MLB doesn’t know why. He has also denied accusations from Verlander and other pitchers that the balls have been deliberately altered.\n\nManfred told Forbes last week he has reconvened the scientists from the 2018 study and expects to issue another report after the World Series. His goal: “predictable, consistent performance from the baseball.”\n\nFirst, though, may come the juiciest postseason yet.\n\nAcross the 10 playoff rosters, only three qualified hitters connected for fewer than 15 home runs this season - St. Louis’ Kolten Wong (11), Milwaukee’s Lorenzo Cain (11) and Houston’s Josh Reddick (14). There were 21 such hitters on postseason teams in 2014.\n\nVerlander has been critical of structural changes to the baseball since 2017, when pitchers and coaches from the Astros and Dodgers complained that World Series balls were slicker than ones used in the regular season. They moaned and groaned while the clubs combined for a Series-record 25 homers, but fans largely oohed and awed - especially during Game 5, a topsy-turvy classic featuring seven home runs.\n\nVerlander has called this year’s balls a “joke.” He’s given up a career-most 36 homers, yet he’s neck-and-neck with teammate Gerrit Cole for the AL Cy Young Award. How’d he do that?\n\n“I used to pitch to weak contact,” he said. “I no longer try to miss barrels. I try to miss bats.”\n\nAfter years of seeking quick outs to keep his pitch count low, Verlander has gone whole hog on punchouts. The 36-year-old totaled 300 of them in a season for the first time and surpassed 3,000 for his career in his final start. He avoided the middle of the plate at all costs, especially with runners on base - 28 of his homers were solo shots.\n\nOf course, strikeouts have surged everywhere - the majors set a record for the 12th consecutive season with 42,823 of them in 2019. There are varied reasons for that, including stronger arms and aggressive bullpen management, but pitchers say distrust in the baseball is a factor.\n\n“There’s been an adaptation in the way I pitch that correlates with the ball, I just didn’t necessarily realize I was doing it because of the ball,” Verlander said. “You can no longer give in to a fastball away because 99% of players in Major League Baseball now can take an away fastball and hit a homer opposite field.\n\n“So what’s my defense to that? My defense is I have to have you swing and miss.”\n\nIn the clubhouse of the NL East-champion Braves, every pitcher seems to remember at least one home run this year that looked like a pop fly off the bat.\n\n“(Christian) Yelich, he went straight-center off me,” starter Mike Foltynewicz said.\n\n“(Pete) Alonso, on a changeup,” added rotation-mate Mike Soroka.\n\n“You just know sometimes you might make your pitch and it’s not going to matter,” All-Star reliever Shane Greene said.\n\nThose pitchers aren’t as concerned about strategizing around the homers as they are with steeling themselves against the frustration of it all. Soroka had the lowest home run rate of any qualified NL starter, and he credits that to an effective sinker and a willingness to be “stubborn.”\n\n“The way guys are hitting them out now, every time the ball goes in the air you think it has a chance,” Braves manager Brian Snitker said. “They experience all that on a daily basis over the course of the season. The ones that are successful are the ones who can handle that adversity.”\n\nThe postseason is a different game though, and not just because of the extra scrutiny and pressure. There are 26 hitters on postseason rosters who hit at least 30 home runs this season - not including Yelich, the Brewers’ NL MVP contender who will miss the postseason with a broken kneecap. Four teams bypassed the previous season record for homers, with the Twins (307) and Yankees (306) becoming the first clubs to reach 300.\n\n“There’s certain ballparks and certain times that you have to be patient,” Oakland manager Bob Melvin said. “Because you know there are going to be a few more runs scored and balls are going to leave the ballpark.”\n\nStressful stuff for pitchers and managers, no doubt, but if the 2017 World Series is an indication, it could be wild fun for fans, too. This year’s postseason participants combined to win 73 times in the regular season when trailing after seven innings. When no lead is safe, no game can be boring, right?\n\nMaybe. Some are concerned that this year’s big fly bonanza might have been too much even for the thrill-seekers in the seats.\n\n“Before, it was like the big wreck at a NASCAR race,” Greene said. “You might see one, and everybody showed up to see that one homer. Now, you’re going to see six.”\n\nManagers have learned to live with all that carnage. Snitker maintained the baseball won’t affect his decision-making, a sentiment echoed by Astros manager AJ Hinch. Yankees skipper Aaron Boone isn’t sure what to anticipate, except he’s pretty sure hitters will keep finding ways to connect.\n\n“The team that ends up winning the World Series,” Boone said, “will do a good job of holding offenses down and will probably hit a lot of balls in the seats when they have traffic to create some big innings off of elite pitchers.\n\n“What it ends up looking like, I don’t know how to predict that.”\n\n___\n\nAP freelancer Chris Talbott contributed from Seattle.\n\n___\n\nFollow Jake Seiner: https://twitter.com/Jake_Seiner\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Justin Verlander didn't intend to alter his pitching strategy, not after 14 seasons as a major league ace. But then the home runs stopped making sense.", "authors": ["The Washington Times Http", "Jake Seiner"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/29/astros_angels_baseball_51574_c0-132-3148-1967_s1770x1032.jpg?e0d642edeb610ca29e9c291d11db8671fec07064", "published_at": "2019-10-01"}