{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/virginia-politics/former-trump-defense-official-to-seek-gop-nod-to-challenge-vas-spanberger/2019/09/30/b6ec2fc6-e39c-11e9-a331-2df12d56a80b_story.html", "downloaded_at": "2019-10-01 11:45:04.466795+00:00", "title": "Former Trump defense official to seek GOP nod to challenge Va.’s Spanberger", "language": "en", "text": "Republican Andrew F. Knaggs is running for a U.S. House seat in Virginia’s 7th District. (Knaggs campaign)\n\nA former defense official in the Trump administration and first-generation American plans Tuesday to add his name to the list of Republicans seeking the nomination to challenge freshman House Democrat Abigail Spanberger in the Richmond suburbs.\n\nAndrew F. Knaggs traveled the world for two years as the deputy assistant secretary of defense for special operations and combating terrorism and was deployed twice to Iraq as a Green Beret.\n\nHe joins three other Republicans vying for the nomination to run against Spanberger, part of the 2018 class of Democrats who won control of the House.\n\nAlso running are Tina Ramirez, who leads a nonprofit organization focused on religious rights; Jason Roberge, a veteran from Spotsylvania; and Peter Greenwald, a retired Navy commander who previously ran for the nomination in 2014.\n\nThe 7th District seat was reliably Republican until Spanberger turned it blue on the strength of her background as a former CIA officer and a promise to be an independent check on President Trump.\n\nKnaggs’s announcement comes about a week after Spanberger co-authored an op-ed article supporting an impeachment inquiry into Trump, but he said he has been planning to run for some time. He said there is not enough evidence to start an impeachment inquiry.\n\nA first-time candidate, Knaggs said he left his position at the Defense Department in September to run for the seat and is in the process of moving to the congressional district.\n\nA self-described “lifelong conservative,” Knaggs, 45, said he wants better enforcement of border security to address immigration and does not favor new laws to address gun violence, such as expanded background checks.\n\n“I am running for office because I believe the Democrats’ vision for this country is wrong,” he said in an interview Monday. “I think it’s not aligned with principles our nation was founded on. Congresswoman Spanberger’s principles are not aligned with the voters of the 7th District.”\n\nKnaggs was born in New York City and grew up in Springfield, N.J., the son of a Haitian father and Barbadian mother who became naturalized citizens.\n\nHe graduated from the U.S. Military Academy at West Point with a civil engineering degree and spent three years as a combat engineer.\n\nThe 9/11 attacks occurred during his training to join the Army Special Forces, and he was twice deployed to Iraq, where he commanded an operational detachment whose 12 members returned home, he said. He was awarded the Bronze Star.\n\nAfter his military service, Knaggs went to William & Mary Law School, where he was president of the school’s chapter of the Federalist Society. He worked for about a year at a Richmond law firm before moving to the Defense Department.\n\nThere he worked for the Joint Improvised Explosive Device Defeat Organization, known as JIEDDO, where he built a research and engineering division and was responsible for developing new technology to counter IEDs, then the biggest threat to troops in Iraq and Afghanistan.\n\nAs a division chief, he managed more than 100 programs, a $300 million budget and a staff of scientists, engineers and financial analysts, according to his official biography.\n\nHe and his wife and their twins lived in Hanover for about a decade while Knaggs commuted to Northern Virginia. Hanover, a conservative stronghold north of Richmond, was part of the 7th District but was removed when lines were redrawn in 2016.\n\nIn 2017, Knaggs joined the Trump administration and moved his family to Fairfax. As a deputy assistant secretary, he was responsible for the Defense Department’s policies for special operations, with a focus on counterterrorism, irregular warfare and information operations, he said.\n\nThe job took him to Africa, the Middle East, Europe and South America, where he met foreign commanders and militaries; he also represented the secretary of defense on various interagency working groups.\n\n“On the basis of the interactions I’ve had around the world,” he said, “there’s a high degree of confidence in the United States with our partners around the world. It was an honor to be able to participle in that.”\n\nThe local GOP committee will hold a convention — a party-led meeting of activists and committed Republicans — next year to choose the Republican nominee.\n\nRead more:\n\nLocal newsletters: Local headlines (8 a.m.) | Afternoon Buzz (4 p.m.)\n\nLike PostLocal on Facebook | Follow @postlocal on Twitter | Latest local news", "description": "The former Green Beret and West Point graduate, who is a first-generation American, joins three other Republicans seeking the U.S. House seat held by the freshman Democrat.", "authors": ["Jenna Portnoy", "Reporter Covering Virginia", "Maryland", "D.C. Congressional Delegations", "October At Am"], "top_image": "https://www.washingtonpost.com/resizer/78r2UKjAid2DdvDqr5I66nETLRQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YAWDWRHDWAI6TMFGHUBXEG4F54.jpg", "published_at": "2019-09-30"}