{"pub": "cbc", "url": "https://cbc.ca/news/politics/french-language-tva-trudeau-1.5273089", "downloaded_at": "2019-09-07 02:26:06.317592+00:00", "title": "French-language TVA debate to go ahead after Trudeau agrees to participate | CBC News", "language": "en", "text": "After some uncertainty, Prime Minister Justin Trudeau on Friday agreed to participate in a French-language debate hosted by TVA alongside the leaders of the Conservative, NDP and Bloc Québécois parties.\n\nThe television network, among the most-watched in Quebec, has scheduled the debate for Oct. 2 in Montreal — a day after a foreign policy-focused debate hosted by Munk Debates is slated to take place. TVA did not invite Green Party Leader Elizabeth May or People's Party Leader Maxime Bernier to participate.\n\nMay said it was \"shocking\" that TVA would exclude her from the contest given the \"distinct dent\" the party has made in Quebec polls in recent weeks. She called on the other leaders to boycott the debate until all leaders are allow to participate.\n\n\"Green Party Deputy Leader Daniel Green placed ahead of the Conservatives and the Bloc Quebecois in the Outremont by-election earlier this year. In most polls, Greens are ahead of the NDP in Quebec. Quebec sitting MP Pierre Nantel is a Green candidate What possible justification can TVA offer for this discrimination?\" May said in a statement to CBC News.\n\nWhile keen to participate in multiple debates in 2015, Trudeau has already ruled out participating in the Munk debate and the Maclean's/Citytv debate scheduled for Sept. 12.\n\nHowever, Rudyard Griffiths, moderator of the Munk Debates, told CBC News Friday he hasn't formally heard a yes or no, or received a \"courtesy call,\" from the Liberal Party as of yet.\n\n\"It's been radio silence,\" Griffiths said. \"We remain hopeful that the prime minister would consider our invitation — he has until Sept. 23 to accept.\"\n\nTrudeau has agreed to participate in debates organized by the Leaders' Debate Commission, a body established by his Liberal government after the last election and chaired by former governor general David Johnston.\n\nDuring the 2015 election campaign, then-prime minister Stephen Harper refused to participate in the English-language debate being run by the consortium of broadcasters, the predecessor to the commission.\n\nThe opposition at the time criticized Harper's decision to snub the English-language consortium debate in favour of smaller debates, some of which were only streamed online, as a move that prevented the largest possible audience from viewing the exchanges between party leaders.\n\nTVA is the only major Canadian network not included in the debate production group.\n\n\"The commission was established after the last election where the [previous] governing party tried to game the system and make sure the fewest number of Canadians engaged in the debates. We think that's wrong,\" Daniel Lauzon, the Liberals' director of communications and policy for the campaign, said in a statement.\n\nTrudeau has now agreed to participate in only one English exchange with his opponents, while he will do so twice in the country's other official language.\n\nOpposition critical\n\nTrudeau's political opponents have pounced on his decision to skip the debates.\n\n\"We know Justin Trudeau is a formidable debater, as he proved in the last election. The only reason he would have for not wanting to attend all the debates is that he's afraid to defend his record,\" a spokesperson for the Conservative Party said.\n\n\"We're disappointed. Canadians deserve better. This is not the new politics Mr. Trudeau promised,\" NDP Leader Jagmeet Singh said in a statement. \"It's hard to know which questions Mr. Trudeau didn't want to be accountable to. Why did you buy a pipeline? Why did you give the Weston family $12 million for fridges but yet can't find the money for a pharmacare program? Why do you care more about helping your wealthy friends than hard-working families?\"\n\nGreen Party Leader Elizabeth May said she has mixed feelings.\n\nMay said she supports the purpose of the debate commission since she had been left off the stage in past years.\n\n\"Debates are a constant source of backroom dealing and anti-democratic collusion,\" she told CBC News.\n\nHowever, May said, she would rather see more debates than fewer, and called Trudeau's decision to skip out on the Munk and Maclean's/Citytv debates a \"shame.\"\n\nThe first English-language commission debate will be held on Oct. 7 followed by the French-language commission debate on Oct. 10.\n\nThe broadcasters taking part in the commission are:", "description": "After some uncertainty, Prime Minister Justin Trudeau on Friday agreed to participate in a French-language debate hosted by TVA alongside the leaders of the Conservative, NDP and Bloc Québécois parties.", "authors": ["Parliamentary Bureau", "John Paul", "J.P.", "Tasker Is A Reporter In The Cbc'S Parliamentary Bureau In Ottawa. He Can Be Reached At John.Tasker Cbc.Ca.", "Follow J.P. On Twitter"], "top_image": "https://i.cbc.ca/1.3182537.1438925869!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/fedelxn-debate-20150806.jpg", "published_at": "2019-09-06"}