{"pub": "reuters", "url": "https://in.reuters.com/article/us-alaska-seals/alaska-seal-die-off-spurs-government-investigation-idINKCN1VY072", "downloaded_at": "2019-09-13 08:29:13.903001+00:00", "title": "Alaska seal die-off spurs government investigation", "language": "en", "text": "ANCHORAGE, Alaska (Reuters) - U.S. government biologists are investigating the deaths of nearly 300 Arctic ice seals found on Alaska beaches since last summer, federal officials said on Thursday.\n\nFILE PHOTO: A dead seal is seen on a beach near a cyclist, in Nome, Alaska, U.S. July 16, 2019. REUTERS/Yereth Rosen\n\nThe National Oceanic and Atmospheric Administration on Thursday declared the seal die-off an “unusual mortality event,” a designation that allows extra resources to be used to determine the cause.\n\nSo far, 282 seal carcasses have been discovered since June 2018. Fewer than half - 119 - were found last year, NOAA said. That is five times the normal morality rate for such seals, according to NOAA.\n\nThe carcasses likely account for a small fraction of the total number of dead seals, as scientists assume the majority of stricken animals would sink after dying or otherwise never make it to shore, said Julie Speegle, an Alaska spokeswoman for NOAA’s Fisheries Service.\n\nThe die-off comes as Arctic Alaska sea ice is scarce and sea temperatures are unusually high - conditions most scientists attribute to global warming brought on by human-caused increases of heat-trapping greenhouse gases in Earth’s atmosphere.\n\nThose warm conditions may be a possible cause of the die-off, Speegle said.\n\n“That’s definitely one of a number of factors,” she said.\n\nThe die-off has affected bearded seals and ringed seals, which are listed as threatened under the U.S. Endangered Species Act, and spotted seals, which are not. All three species depend on floating sea ice for resting, pup-rearing and other critical life functions.\n\nAs with other recent die-offs in Alaska, some of the seals have appeared to be undernourished, Speegle said.\n\nBiologists also are testing for toxins the animals may have ingested from algae blooms stoked by warm conditions.\n\nThe Bering Sea has seen rising water temperatures since late 2013, said Brian Brettschneider, a climatologist with the International Arctic Research Center at the University of Alaska, Fairbanks.\n\nWaters off Alaska were empty of ice much earlier than normal this year, allowing the water to absorb more solar heat, which inhibits future freezing, leading more open water to absorb heat, Brettschneider said.\n\n“It feeds on itself,” he said.\n\nBiologists are also investigating a mass die-off of gray whales along the U.S. West Coast, and the fifth consecutive year of mass bird deaths in Alaska.\n\nSo far this year, according to NOAA data, 212 dead gray whales have been found in Pacific waters from Mexico to Alaska. Forty-four of those have been in Alaska, Speegle said.\n\nSlideshow (3 Images)\n\nThis population of gray whales feeds mostly during the Arctic summers in the Bering and Chukchi seas off northwestern Alaska.\n\nBiologists suspect that warming seas there have disrupted the food chain, preventing the whales from eating enough in Alaska waters last summer to carry them through this year’s migration.\n\nMass seabird deaths, which started in 2015 in Alaska, are likewise linked to unusually warm conditions in the oceans. Affected species include common murres, puffins, northern fulmars and short-tailed shearwaters.", "description": "U.S. government biologists are investigating the deaths of nearly 300 Arctic ice seals found on Alaska beaches since last summer, federal officials said on Thursday.", "authors": ["Yereth Rosen", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190913&t=2&i=1429291256&w=1200&r=LYNXNPEF8C08G", "published_at": "2019-09-13"}