{"pub": "investing.com", "url": "https://in.investing.com/news/commodities-news/preciousgold-holds-steady-as-uschina-tradetalk-optimism-ebbs-2005446", "downloaded_at": "2019-10-15 08:02:37.733736+00:00", "title": "PRECIOUS-Gold steady as trade optimism ebbs, palladium hits record high", "language": "en", "text": "© Reuters. PRECIOUS-Gold steady as trade optimism ebbs, palladium hits record high\n\n(Adds details, updates prices)\n\n* Palladium hits record high of $1,726.74/oz\n\nBy Karthika Suresh Namboothiri\n\nOct 15 (Reuters) - Gold held steady on Tuesday as optimism surrounding U.S.-China trade talks faded and investors awaited the outcome of crucial discussions that will determine how Britain leaves the European Union, while deficit-hit palladium touched a record high.\n\nSpot gold edged down 0.1% to $1,490.70 per ounce as of 0711 GMT. U.S. GCcv1 were 0.2% lower at $1,494.80 per ounce.\n\n\"Markets enjoyed a good risk-on rally, but on Monday news came out saying that China required more negotiation and talks before they find any deal, which is very disappointing,\" said Margaret Yang Yan, a market analyst at CMC (NS: ) Markets.\n\nA Bloomberg report on Monday, citing sources, said China wants more talks as soon as the end of October to hammer out the details of U.S. President Donald Trump's phase 1 deal before Chinese President Xi Jinping agrees to sign it. data from China reinforced the case for Beijing to unveil further stimulus as manufacturing cools on weak demand and U.S. trade pressures. China's factory gate prices declined at the fastest pace in more than three years in September. on Friday, the United States outlined the first phase of a trade deal and suspended this week's scheduled tariff hikes on Chinese goods, but existing tariffs remained in place and officials on both sides said much more work was needed before an accord could be agreed.\n\nAsian stocks and Wall Street futures inched higher as some investors held out hope that Britain still had a chance to avoid a messy exit from the European Union. MKTS/GLOB\n\nOfficials from Britain and the EU will meet at a make-or-break summit on Thursday and Friday that will determine whether Britain is headed for a so-called no-deal Brexit.\n\n\"The Brexit narrative seems to be playing as a basic risk on/off catalyst, with echoes into bond yields driving near-term gold swings,\" said Ilya Spivak, a senior currency strategist at DailyFx.\n\n\"The markets remain priced for a far more dovish Fed outlook than the central bank has signed up for.\"\n\nThe U.S. Federal Reserve will meet later in the month and the markets are on the lookout for signs the central bank will cut interest rates, earlier than the expected December cut.\n\nPalladium jumped to a peak of $1,726.74 an ounce. Concerns that supply of the metal used in car exhaust systems could run out has helped lift prices more than 36% this year.\n\nSilver dropped 0.2% to $17.61 per ounce and platinum declined 0.1% to $891.77.", "description": "PRECIOUS-Gold steady as trade optimism ebbs, palladium hits record high", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEA5N0EK_L.jpg", "published_at": "2019-10-15"}