{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/15/arsenal-wsl-joe-montemurro-small-squad", "downloaded_at": "2019-10-15 12:53:50.695122+00:00", "title": "Will Montemurro’s small squad come back to haunt Arsenal this season? | Suzanne Wrack", "language": "en", "text": "It was telling that it was two substitutes combining to deliver Chelsea’s 2-1 humbling of the reigning Women’s Super League champions Arsenal on Sunday.\n\nThe strategy of the Chelsea manager, Emma Hayes, has always been to build a strong, deep squad, not just to have quality on the bench but also to provide as competitive an environment in training as possible.\n\nChelsea recover from early blow to end Arsenal’s unbeaten run Read more\n\nThat paid off in 2017-18 as Chelsea won the double, Nick Cushing’s Manchester City struggling to keep up with the Londoners as they fought relatively comfortably on all fronts.\n\nAt the end of that season Cushing pointed to the difficulties posed by the switch from a summer to winter season but also to the lack of depth in his squad. “Listen, people will always question the teams that don’t win because ultimately the standard is set by the teams that win, I get that,” he said. “Maybe we learnt a little bit about the season last year, changing to a winter season meant we played Champions League football within our season which meant that we played an extra eight to 10 games than we did the year before. So yes, squad depth is definitely something we’ve reflected on and acted on.”\n\nLast summer City recruited to bolster the areas shown to be the weakest in the previous campaign. “We’ve acted on different areas where we feel we may have lost physical fitness and freshness,” he reflected. “Because not only did we play 40-plus games last year (City also got to the League Cup final and the semi-finals of the Women’s FA Cup that season), but our players also played every international fixture.”\n\nIt made a difference. In came Lauren Hemp, Gemma Bonner, Caroline Weir, Tessa Wullaert and Janine Beckie and City romped to a domestic cup double last season. They also pushed Arsenal to the penultimate game of the season. This time, it was Arsenal’s squad that almost buckled under the pressure of a freakishly large injury list, but they crawled over the line to lift a first league title in seven years.\n\nFootball on BT Sport (@btsportfootball) If you're going to win a London derby, this is the way to do it! 😮\n\n\n\nMaria Thorisdottir is the hero for Chelsea as they down Arsenal late. pic.twitter.com/I4LvVlWMQK\n\nExcept unlike Cushing, after a season of being stretched to breaking point, Arsenal manager Joe Montemurro has chosen not to significantly bolster his numbers.\n\nIn fact, it is very much a preference to have a smaller squad to work with. “It’s a balance because I’m synonymous with not working with big groups, I don’t like working with 24-25 players,” he said on the eve of the new season. “When player 22 knows that someone has to get injured to even get on the bench? That’s not fair to someone. So I do take the risk. And I think I work better with a smaller group. I think I can give them that attention that they need.”\n\nWith Danielle Carter rupturing the same anterior cruciate ligament that ruled her out for the entirety of the previous season, and Tabea Kemme injured, his 20-player squad is already reduced to 18, and this time they have Champions League football added into the mix as well.\n\n“Rotation, I think is a bit of a false thing because it doesn’t work, you’re asking a player who’s not always involved to come in for that game knowing that they’re going to be out for the next game. So I don’t want to have that. I want everyone to feel that they’ve got an opportunity and that they’re close, that they are one bad game away from someone in their position. That keeps the stimulus high, that keeps the level high and that keeps the attitude high.”\n\nHowever, looking at the benches on Sunday and the impact of the Chelsea substitutes it is hard not to think that this strategy could come back to haunt the Gunners. Where the Blues had a bench of seven littered with experience and international talent, including the Swiss forward Ramona Bachmann, who set up fellow substitute Maria Thorisdottir for the winner, Arsenal could only name six, with 17-year-olds Ruby Grant and Melissa Filis two of those listed.\n\nWith Chelsea in the ascendancy in the match, Hayes swapped experienced heavy legs for experienced fresh ones, while Montemurro’s one switch saw the recovering Lia Walti make way for the similarly returning Jordan Nobbs.\n\nA unusually frustrated Montemurro pointed to the strength of the Chelsea squad as a reason why they should be challenging when he said: “With the individual talent they’ve got and with the size of the squad that they’ve got they should be up there every year. So today is obviously an indication of who they are, they’re a good team, they’re a powerful team. They’ve got a big squad, 25-26 players who are internationals and we have probably 18 players but that’s not an excuse that’s how we’ve chosen to be.”\n\nHayes, meanwhile, was extremely philosophical about how she juggles the numbers. “I’ve learned a lot this weekend about the value of the whole,” she said. “When you’ve got a top group of players picking 11 is really challenging. Because there’s world class talent sat on the bench. Managing that is even more difficult and I’m someone who thinks I manage it quite well.”\n\nMontemurro is a winner. But with Hayes and Cushing both having learned the lessons of difficult campaigns and chomping at his title-winning side’s heels – in an increasingly competitive league – his small squad is going to be tested like never before and soon. They play Slavia Prague over two legs this month with the visit of Manchester City to Borehamwood on 27 October added to the mix.\n\nWomen’s Super League: talking points from the weekend’s action Read more\n\nHayes, meanwhile, has her first big win of the season, a stronger squad than any other and no Champions League football to stretch the calendar.\n\nTalking points\n\n• The BBC has reported that the Reign FC manager, Vlatko Andonovski, is in line to replace the outgoing Jill Ellis as head coach of the US women’s national team. The 43-year-old will lead Reign, who boast World Cup hero Megan Rapinoe and England’s Jodie Taylor in their ranks, in their NWSL play-off semi-final against reigning champions North Carolina Courage on 20 October.\n\n• Orlando Pride defender Toni Pressley received a standing ovation as she took to the field for the first time since being diagnosed with breast cancer three months ago and undergoing a double mastectomy in August.\n\n• Hibernian will play Glasgow City in their defence of the Scottish Women’s Cup after the Edinburgh side beat Motherwell 4-1. City came from behind against Rangers to ensure victory by the same margin.\n\n• Everton forward Chloe Kelly has been named Barclays WSL player of the month for September after she helped fire the Blues to successive league wins. Everton only picked up three wins across the whole of last season. Tottenham duo Karen Hills and Juan Amoros were named joint manager of the month after Spurs put in a strong performance in their defeat to Chelsea at Stamford Bridge before wins over Liverpool and West Ham.", "description": "Chelsea beat Arsenal 2-1 in the WSL on Sunday with two world-class substitutes coming on to change the game", "authors": ["Suzanne Wrack"], "top_image": "https://i.guim.co.uk/img/media/e697927fcb5e28ef59566d29a464de8e4174ac9e/0_224_3649_2190/master/3649.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a6ff64fa404204ec313b3ad42e260057", "published_at": "2019-10-15"}