{"pub": "afr", "url": "https://afr.com/policy/economy/fed-right-to-resist-pressure-from-trump-markets-on-monetary-policy-20191008-p52ylg", "downloaded_at": "2019-10-08 09:37:33.954538+00:00", "title": "Fed right to resist pressure from Trump, markets on monetary policy", "language": "en", "text": "Mr Brufsky was also critical of the reaction among some fund managers and traders to Federal Reserve policy decisions, comparing it to attempts by politicians to wield influence over monetary policy.\n\n\"I think it's the market that's always trying to tell them that they're wrong, and then doing something different. There are also politicians telling them often that perhaps what they're doing isn't keeping pace with all the economies in the world,\" he said.\n\nHowever, Mr Brufsky acknowledged competing opinions within the Fed about the trajectory of growth in the world's largest economy that could complicate policy making.\n\n\"I don't think there's a unanimous decision when the Federal Reserve governors meet, they all have their own opinions,\" he said. \"That's why there are different voting governors and why they rotate their vote.\"\n\nFor example, during the September meeting, the central bank's board was split on cutting rates, with two dissenters arguing to keep rates unchanged and another for a more significant cut.\n\n'It's a tie' on QE\n\nMr Brufsky declined to pass judgement on the Reserve Bank of Australia's approach to monetary policy but said he remained on the fence regarding quantitative easing – an unconventional approach that may see more cash injected into the economy through possible purchases of government bonds.\n\nRBA governor Philip Lowe endorsed quantitative easing on Tuesday in a Bank of International Settlements report, saying it worked as long as broader fiscal policies were adopted.\n\nAdvertisement\n\n\"It's a tie [between support and opposition to quantitative easing],\" Mr Brufsky said.\n\n\"With capital the way that it is [capital is cheap], you should probably see higher growth rates for the availability of capital. However, there is always a spectre hanging behind.\n\n\"You went through the financial crisis. You don't want to go through that again. Even though capital is cheap, I'm still going to hold onto it as if it's not.\n\n\"I think [quantitative easing] has done what it's done by smoothing out some of those rougher parts of the system, but I don't think it has done its job in actually generating growth,\" he said.\n\nMr Brufsky, nevertheless, was upbeat about the prospects for the Australian economy, which has not experienced a recession since the early 1990s.\n\nA new credit fund launched in partnership with Fidante, which is owned by Challenger, could offer a way for Australian investors to diversify their exposure beyond Australia, he suggested.\n\n\"What this will bring to the Australian investors is, is an international product,\" said Nick Hamilton, Challenger's chief executive of funds management.\n\n\"So it actually will diversify the Australian investor away from domestic policy or domestic asset exposure.\"", "description": "Ares Management, a $210 billion global credit manager, backed the Federal Reserve's interest rate cuts but questioned if quantitative easing generates growth.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2119%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_110/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/7b119099a73e0ec9c9b7e4ef70d4be269e026af8", "published_at": "2019-10-08"}