{"pub": "bbc", "url": "https://bbc.co.uk/news/health-49516252", "downloaded_at": "2019-09-03 23:45:42.627390+00:00", "title": "Life-saving organ transplant opportunities being missed", "language": "en", "published_at": "2019-09-03", "text": "Image copyright Angie Matthews Image caption Bill Moore's family faced a difficult decision after his sudden death\n\nAs many as 2,500 more organs could be made available for transplant in the UK if families spoke more openly about donating after death, says the NHS Blood and Transplant organisation.\n\nIt is hoped the more that people talk about their wishes, the easier it will be for relatives to agree to donations.\n\nLast year there was a record number of donors - 1,600 in total.\n\nBut about a third of the newly-bereaved families who were asked decided against their loved-one's organs being reused.\n\nFamilies are being urged to talk about their wishes around organ donation before a loved one dies.\n\nAround 6,000 people in the UK are waiting for a transplant, but 400 will die before an operation can go ahead.\n\nWales, England and Scotland have introduced new laws on consent for organ donation to boost donor numbers.\n\nFamilies have the final say on whether or not organ donation goes ahead, even if the patient has expressed a wish to become a donor.\n\nLast year, more than two-thirds (2,181) of the families of potential organ donors agreed to a donation.\n\nBut 835 families did not want to, mostly because they had never discussed organ donation with their loved one.\n\nThere were a further 229 families who turned down the request, saying that their relative had made his or her views clear.\n\nBill's story\n\nThe family of Bill Moore found they faced a difficult choice following his sudden death.\n\nHis daughter Angie Matthews told the BBC their decision on whether to donate his organs was complicated by not knowing exactly what Bill wanted.\n\n\"It was really difficult to make that decision at the time, we were on such a rollercoaster of emotions.\n\nImage caption Bill Moore's daughter Angie\n\n\"And I think not knowing his wishes made it even harder.\n\n\"If we had known that he had said that he wanted to donate his organs, it would have made things a whole lot easier.\"\n\nIn the end Bill's family did give their consent.\n\nAngie's husband recalled a conversation he had had with Bill while playing golf a few months before, where he had said he would be happy to become an organ donor.\n\nThat reassured the family they had made the right decision.\n\nBill's donation helped at least eight people, which his daughter Angie says is a huge comfort.\n\nImage copyright Angie Matthews Image caption Bill Moore with his wife\n\n\"It was amazing to think that he lived on and that his gift of life meant so much to them.\n\n\"It's just absolutely life-changing.\"\n\nMissed opportunities\n\nThe new laws around organ donation have already taken effect in Wales, and England and Scotland will follow suit next year, but Northern Ireland will not be adopting it.\n\nThe changes mean that consent to donation will be assumed, so people will have to opt out of the scheme, rather than the current system of opting in.\n\nBut families will still have a veto, even if the wishes of the patient were that they clearly wanted to become a donor.\n\nAnthony Clarkson is director of organ donation and transplantation at NHS Blood and Transplant, the body that oversees the service in the UK.\n\nHe said: \"Even after the law around organ donation changes in England and Scotland next year, families will still be approached before organ donation goes ahead.\n\n\"We urge everyone to register their organ donation decision on the NHS Organ Donor Register and tell your family the choice you have made.\n\n\"If the time comes, we know families find the organ donation conversation with our nurses much easier if they already know what their relative wanted.\"", "description": "Families are being urged to discuss donation to boost transplant numbers.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/CA35/production/_108556715_bill_moore2.jpg"}