{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7577081/Michael-Douglas-reveals-feared-going-lose-son-Cameron-drug-addiction-spiraled.html", "downloaded_at": "2019-10-15 23:04:55.834207+00:00", "title": "Michael Douglas reveals he feared he was going to lose son Cameron as his drug addiction spiraled", "language": "en", "text": "Michael Douglas has revealed he feared he was going to lose his son Cameron as his drug addiction spiraled out of control.\n\nCameron, 40, abused cocaine, heroin, and eventually landed behind bars for conspiracy to distribute meth and cocaine.\n\nFortunately, the actor has been able to turn his life around, and reflected on that particularly painful chapter alongside his father Michael in an interview with People.\n\nPainful memories: Michael Douglas opened up about his son Cameron's drug addiction in an interview with People (pictured November 2017 in New York)\n\nThere were times when Michael nearly lost all hope, as he attempted to get help for his son alongside Cameron's mother, Diandra Luker.\n\nUnfortunately, their efforts were in vein.\n\n'There were moments when hope dwindled... and then it's just a train out of the station,' Michael told the publication. 'Life became a series of crises. I thought I was going to lose him.'\n\nEven Cameron was aware just how destructive his addiction had become.\n\nFather-son: Douglas with his son during dinner at Craig's in February 2019\n\nThough he hated it, he was unable to stop.\n\nThe drug abuse eventually grew so bad Cameron began suffering seizures as a result of the consumption.\n\nBy this time, Cameron was shooting up cocaine on a daily basis, and had realized he was facing two options in his life.\n\n'There's prison and then there's death': Cameron realized he was facing two options in his life (pictured 2006)\n\n'When you get that far down the rabbit hole, there are a couple options: there's prison and then there's death,' he said.\n\nCameron eventually was sentenced to five years in prison for conspiracy to distribute meth and cocaine.\n\nThe actor spent a total of eight years behind bars, after his sentence was increased for possession during incarceration.\n\nFamily man: Now Cameron and his girlfriend Viviane Thibes are proud parents to daughter Lua Izzy Douglas\n\nIn 2010, Douglas said on Today that he viewed the prison sentence as a fresh start.\n\nThe actor assumed blame for 'being a bad father', but said without the intervention of prison, his son 'was going to be dead or somebody was gonna kill him. I think he has a chance to start a new life, and he knows that.'\n\nCameron was released in 2016 and welcomed daughter Lua Izzy Douglas a year later with his yoga instructor girlfriend Viviane Thibes.\n\nBy publishing his memoir Long Way Home, the actor hopes to help other addicts 'seek help - and maybe save a life.'\n\nLong Way Home will be released October 22, 2019.", "description": "Fortunately, the 40-year-old actor has been able to turn his life around, and reflected on that particularly painful chapter alongside his father Michael in an interview with People .", "authors": ["Christine Rendon For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/22/19758514-0-image-a-27_1571174622523.jpg", "published_at": "2019-10-15"}