{"pub": "realclearpolitics", "url": "https://prospect.org/power/democrats-should-heed-the-lessons-of-2004", "downloaded_at": "2019-10-18 01:06:10.330951+00:00", "title": "Democrats Should Heed the Lessons of 2004", "language": "en", "text": "× Expand Gerald Herber/AP Photo Former Democratic presidential candidate Senator John Kerry delivering a speech in Santa Fe, New Mexico, October 11, 2004\n\nPerhaps the one thing the entire Democratic presidential field can agree on is the absolute necessity of not rerunning the 2016 election. Some would say that means nominating someone without a historically bad favorability rating, or actually campaigning in swing states, or running on ambitious policy proposals. For others, it means limiting appeasement of an increasingly vocal left flank, maximizing intraparty comity, and focusing on the ever-important “electability.” Presumably, for all, it means not getting wiped out at all three levels of the federal government again.\n\nFor a significant percentage of the Democratic establishment, the person who satisfies most of these counts is Joe Biden. Staffers from the Obama and Clinton campaigns have flocked to work for him, while big-money bundlers have proven more than willing to throw considerable financial support behind his candidacy. And while his poll numbers seem to be dropping (fairly precipitously, depending on who you ask), he’s sported a sizable lead throughout the primary season. At worst, he’s still firmly ensconced in the top tier.\n\nBiden champions probably aren’t wrong. His elocution may be a bit lacking, but he’s got some OK policies, and he hasn’t been quite as prominently scandal-plagued for quite as many years as Clinton (though Donald Trump and Rudy Giuliani are determined to change that). He’s played nicer with organized labor. He probably wouldn’t make the same tactical gaffes as Team Hillary.\n\nBut if the Democratic establishment is making moves that indicate it may have learned from 2016’s debacle, it’s also showing troubling signs of rerunning the electoral disaster of 2004, and Biden is flashing more than a few John Kerry–like traits.\n\n[More from Alexander Sammon]\n\nIf you’ve forgotten just how shambolic the 2004 campaign was, here’s a quick review. The Republican opponent, an unimpressive scion of a dynastically wealthy family, was nearing the end of a first term he’d secured after losing the popular vote. In the year of his re-election campaign, he sported a favorability rating under 50 percent . Among his signature policies were a massive tax cut that proved to be a wildly regressive giveaway to the wealthy, the expansion of a largely unchecked immigration enforcement agency, and some congressionally unapproved warmongering in the Middle East, at least partially in service of setting the table for a larger military blowout with Iran. His advisers repeatedly lied before Congress and were defiant and contemptuous of any and all oversight, with seemingly total impunity. Much of his appeal was based on a supposedly booming economy, juiced up by widespread debt and not yet evincing some troubling underlying indicators.\n\nThat was George W. Bush, in case you were wondering.\n\nLosing to that guy once was shameful enough, so the Democratic Party leadership swore to do whatever it took to prevent that outcome from happening twice. As Democratic primary season kicked off in 2003, they dedicated themselves to the pursuit of “electability.”\n\nThere were other players in that Democratic primary, but the essential drama unfolded between the eventual candidate and a politician from Vermont who had a reputation for yelling a lot and an ambitious plan for a dramatic expansion of publicly provisioned health care, which he called “a moral imperative.” That plan, he noted, could be paid for in part by repealing some highly unpopular, recently enshrined tax cuts.\n\nThat was Howard Dean, in case you were wondering.\n\nDean had a zealous grassroots organizing network, buoyed by youthful organizers. He had a major advantage in smaller-dollar fundraising thanks to his embrace of internet-based donations.\n\nOpposite him was John Kerry, a war hero whose career in politics had been largely inoffensive to that point. He had that elusive “it” factor the Democratic leadership identified as electability, which translated into muted policy ambitions and a biographical backstory that might endear him to Republican swing voters if they squinted hard enough. That all dovetailed conveniently with the Democratic Leadership Council’s mantra of “moderate, moderate, moderate.”\n\nSo Democratic leadership pushed to elevate Kerry, while stamping out Dean’s insurgency. They ran to the middle, hoping to peel off elusive centrist Bush voters. They leaned into messaging not based on policy, or even ideology, but the well-worn slogan “Anybody But Bush.”\n\nHow were the results? Kerry, who was indeed anybody but Bush, and generally perceived to be a nice guy, got swiftboated to smithereens, and ended up losing by 35 electoral votes. But the other numbers were even worse than that. He became the only Democrat to have lost the popular vote in a presidential election since 1988, the only outright loser in the last seven cycles.\n\nNow, the economy was still being buoyed by unsustainable housing debt, the painful reality of the Iraq War hadn’t reached the entire public consciousness, Hurricane Katrina had yet to happen, and Osama bin Laden himself popped up a week before the election in remarks that ended up boosting the incumbent. But the parallels are worth entertaining—between Bush and Trump, between Kerry and Biden, and between the political climate of 2004 and 2020.\n\nIt’s hard to know if Dean (who was decidedly not a democratic socialist) would’ve beaten Bush, or where we’d be if that had happened. The comparison requires a certain reduction—the left flank looks different in 2020 than it did 16 years ago, and John Edwards, who went on to be Kerry’s pick for VP, doesn’t slot tidily into the current field. Every election cycle has its own specific quirks, and the impeachment inquiry adds its own particularities as well. Still, the ethos endures and the similarities should be instructive for the Democratic Party, which has proven to be astonishingly unable to get itself off the hamster wheel of history.\n\nIn 2004, Democratic leadership, when facing down a bellicose demagogue with a cabal of criminals working for him, shelved a popular, medical-care-driven agenda backed by a network of grassroots organizers in favor of electability, and an “Anybody But” war cry. What proceeded was catastrophic, not just for the Democratic Party, but for the country. If you think Trump is bad in term one, a second term would be profoundly emboldening.\n\nSince the collapse of the New Deal order, the Democratic Party has had plenty of poor presidential cycles that have scarred its collective psyche. Mention Walter Mondale, who won only one state against an Alzheimer’s-addled Ronald Reagan in 1984, or Michael Dukakis, who got waxed by George H.W. Bush in 1988, and you’ll get shudders. The Democratic establishment vowed to learn from that history, and adjust its game plan accordingly (while falsely tarring Mondale—who ran on deficit reduction—and Dukakis as wild-eyed liberals). But 2004, whose postmortem called for more ambitious progressive policy and the abandonment of electability as a guiding principle, may be the most relevant to our current day. Unfortunately, Democrats may prove unwilling to learn the lesson.", "description": "To face a monstrous Republican seeking re-election, Democrats chose a moderate, ‘electable’ Senate lifer over an insurgent from Vermont. What about this year?", "authors": ["Alexander Sammon"], "top_image": "https://prospect.org/downloads/12867/download/Sammon%20101419%20John%20Kerry.jpg?cb=6b0585a2b3a28fce879cded936959f97&w=1200", "published_at": "2019-10-14"}