{"pub": "metro", "url": "https://metro.co.uk/2019/10/11/gang-who-hacked-boy-15-to-death-after-mistaking-him-for-rival-jailed-for-life-10904452", "downloaded_at": "2019-10-11 20:05:18.271627+00:00", "title": "Gang who hacked boy, 15, to death after mistaking him for rival jailed for life", "language": "en", "text": "Jose Muniz, (left) and Elvin Garcia (middle) were two of the five gang members sentenced to life for killing Junior Guzman-Feliz (Picture: Splash News/AP)\n\nWARNING: GRAPHIC CONTENT\n\nFive gang members who dragged a 15-year-old out of a store and brutally stabbed him to death after mistaking him for a rival were jailed for life.\n\nJonaiki Martinez Estrella, 25, Antonio Rodriguez Hernandez Santiago, 25, Jose Muniz, 23, and Elvin Garcia, 25, were all sentenced to 25 years to life for killing Lesandro ‘Junior’ Guzman-Feliz in the Bronx, New York on June, 20 2018.\n\nA younger gang member, 19-year-old Manuel Rivera, has was given a slightly lesser sentence of 23 years to life. There are eight other defendants still awaiting trial.\n\nThe Trinatarios gang was caught on camera as they hacked Guzman-Felix with machetes and knives outside the Cruz and Chiky bodega store.\n\nProsecutors said the video showed Martinez Estrella delivering the final 4.5-inch-deep knife blow to Guzman-Feliz’s neck that ultimately killed him.\n\nThe teens sentenced to life from left to right are Antonio Rodriguez Hernandez Santiago, Elvin Garcia, Jonaiki Martinez Estrella, Jose Muniz, and Manuel Rivera. (Picture: JusticeForJunior)\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nVIDEO clearly shows one of the suspects holding a large knife which was used to fatally stab a 15 year old kid in the Bronx. Call @NYPD48Pct with any info. pic.twitter.com/gzmJinUESx — New York City Alerts (@NYCityAlerts) June 22, 2018\n\nAdvertisement\n\nAdvertisement\n\nThe teen was reportedly killed after the gang mistook him for someone else. He ran to the bodega at East 183rd Street and Bathgate Avenue after being chased by the gang.\n\nGuzman-Felix died shortly after he collapsed near the entrance of St Barnabas Hospital.\n\nThe five men sentenced Friday were found guilty of killing of murder in June in a trial that drew national attention with a ‘#JusticeForJunior’ rallying cry.\n\nThe teen’s mother, Leandra Feliz, read a heartbreaking impact statement saying: ‘They killed an innocent child.\n\n‘Of all these men, not a single one of them said, “No, no, don’t do it.” That night, there were two deaths, Junior and I, who was left dead inside.’\n\n‘As a young boy, my son dreamed of becoming a detective, so he could protect this city…Please make sure my son’s dreams come true.\n\n‘These killers should never be able to step out of a jail cell, so they know the moment they killed my son, they took their own lives as well.’", "description": "Five gang members who dragged a 15-year-old out of a store and brutally stabbed him to death have been given life sentences.", "authors": ["Jacob Geanous"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/comp-1570818176_1570819201.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-11"}