{"pub": "yahoo", "url": "https://news.yahoo.com/why-senate-republicans-may-decide-112355558.html", "downloaded_at": "2019-10-09 12:50:23.470917+00:00", "title": "Why Senate Republicans may decide impeaching Trump is actually the safer option", "language": "en", "text": "Impeachment momentum is building, both in the House and in the polls, but President Trump has an ace up his sleeve: Senate Republicans still control the upper chamber, which means that if the House does impeach Trump, Republicans will conduct and control the resulting trial that will decide his fate. If the House's impeachment process remains as chaotic and closed off as it has been so far under the direction of Intelligence Committee Chair Adam Schiff (D-Calif.), and especially if the House never allows for effective due process by formally authorizing an impeachment inquiry, Senate Republicans have no incentive to treat a resulting impeachment seriously, let alone consider removing Trump.\n\nUnless, that is, Trump manages to find a way to alienate Senate Republicans and convince them that it might be more dangerous to keep him in office than to show him the door. The president's sudden announcement that he would withdraw protection from Syrian Kurd allies as Turkey threatened to go to war with them may not rise to that level just yet, but it clearly rattled the people on whom Trump relies to get through this term in office.\n\nTrump's decision did not come entirely out of the blue. When he ran for office, he embraced the non-interventionist wing of the GOP. During the presidential primary debates, he castigated Jeb Bush for the 2003 decision of his brother, former President George Bush, to invade Iraq, stunning the other candidates but gaining credibility with Sen. Rand Paul (R-Ky.) and others demanding full withdrawals from overseas theaters of war.\n\nAfter the election, Trump discovered just how difficult it would be to extricate the U.S. from Syria, Iraq, and Afghanistan. His chief negotiator, Zalmay Khalilzad, has tried to get the Taliban to cooperate with little to show for it, despite the apparent bait of a Camp David meeting last month. As for Syria, the president ordered a full withdrawal in December, prompting then-Defense Secretary James Mattis to resign in protest. The backlash within his own party eventually forced Trump to retreat, ordering a drawdown of troops and materiel instead and biding his time for the next opportunity.\n\nThe president apparently lost patience. Without consulting his allies on Capitol Hill — or, reportedly, the Pentagon — Trump agreed to withdraw protection from the Syrian Kurds as Turkey's President Recep Tayyip Erdogan insisted that he needed to strike their positions. The Kurds, who were the front-line fighters against the ISIS \"caliphate\" over the past few years, found themselves without the protection that the U.S. promised, even as they struggle to deal with thousands of captured ISIS fighters and supporters.\n\nIf anything, Trump chose the wrong theater of war from which to retreat. While America's strategic interests in Afghanistan are now limited at best, this isn't the case in Syria, where the U.S. has critical strategic interests, especially in containing Iran. The Kurds in Syria are not just the front line against ISIS, but also our partners in monitoring and frustrating Iranian-backed Shi'ite militias in the region. Iran's partnership with Syrian President Bashar al-Assad presents a considerable threat to Sunni Arab nations including Saudi Arabia, which just suffered a missile attack that originated in Iran.\n\nAdd to that the existential threat that Iranian hegemony represents to our ally Israel, and it's easy to see why Trump's near-whimsical decision rattled Republicans, especially in the Senate. Majority Leader Mitch McConnell (R-Ky.) has spent most of the last three years defending Trump, but the Syria announcement drew his immediate criticism. \"A precipitous withdrawal of U.S. forces from Syria would only benefit Russia, Iran, and the Assad regime,\" McConnell responded in a prepared statement, and \"would increase the risk that ISIS and other terrorist groups regroup.\"\n\nSen. Lindsey Graham (R-S.C.), chair of the Senate Judiciary Committee, and one of Trump's biggest defenders in the impeachment fight, told Fox & Friends that the decision was \"unnerving to its core.\" In unusually sharp language, Graham also called Trump's claim that he had defeated ISIS \"the biggest lie being told\" by his administration, warning that while the group's control of ground had been disrupted, it was still dangerous. \"President Trump may be tired of fighting radical Islam,\" Graham later added on Twitter. \"They are NOT tired of fighting us.\"\n\nAnd those were Trump's closest allies in the Senate Republican caucus. Utah Republican Sen. Mitt Romney, a longtime critic, issued a joint statement with Connecticut Democrat Sen. Chris Murphy calling for hearings for the Trump administration to \"explain how betraying an ally and ceding influence to terrorists and adversaries is not disastrous for our national security interests.\" Sen. Marco Rubio (R-Fla.) called the decision \"a grave mistake that will have implications far beyond Syria.\"\n\nThis decision alone won't convince 20 Republicans to cross the aisle on a removal vote, of course. In part, that is because Trump tried this once before, and his impatience in Syria was well known. However, the seemingly capricious manner in which this decision was made and the damage it does to American credibility with needed partners in the fight against radical Islamist terrorism cannot help but raise doubts about Trump's leadership with the very people Trump needs to help him preserve it.\n\nWant more essential commentary and analysis like this delivered straight to your inbox? Sign up for The Week's \"Today's best articles\" newsletter here.", "description": "Impeachment momentum is building, both in the House and in the polls, but President Trump has an ace up his sleeve: Senate Republicans still control the upper chamber, which means that if the House does impeach Trump, Republicans will conduct and control the resulting trial that will decide his fate.", "authors": ["Edward Morrissey"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-09"}