{"pub": "cnbc", "url": "https://cnbc.com/2019/10/14/nobel-economics-prize-awarded-to-abhijit-banerjee-esther-duflo-and-michael-kremer.html", "downloaded_at": "2019-10-14 11:28:21.478915+00:00", "title": "Pioneers in fight against poverty win 2019 Nobel economics prize", "language": "en", "text": "Economists Abhijit Banerjee, Esther Duflo and Michael Kremer won the 2019 Nobel Economics Prize for their work in fighting global poverty, the Royal Swedish Academy of Sciences said on Monday.\n\nFrench-American Duflo becomes only the second female economics winner in the prize's 50-year history, as well as the youngest at 46. She shared the award equally with Indian-born American Banerjee and Kremer, also of the United States.\n\nThe Academy said the work of the three economists had shown how the problem of poverty could be tackled by breaking it down into smaller and more precise questions in areas such as education and healthcare, making problems easier to tackle.\n\n\"As a direct result of one of their studies, more than five million Indian children have benefited from effective programs of remedial tutoring in school,\" the Academy said in a statement.\n\n\"Another example is the heavy subsidies for preventive healthcare that have been introduced in many countries.\"\n\nThe 9 million Swedish crown ($915,300) economics prize is a later addition to the five awards created in the will of industrialist and dynamite inventor Alfred Nobel, established by the Swedish central bank and first awarded in 1969.\n\nEconomics is the last of the awards to be announced with the winners for medicine, physics, chemistry, literature and peace having been unveiled over the course of last week.\n\nThe 2018 Nobel Economics Prize was jointly awarded to U.S. economists William Nordhaus and Paul Romer, pioneers in adapting the western economic growth model to focus on environmental issues and sharing the benefits of technology.\n\nNordhaus' recognition has proved controversial, with critics arguing the model he created to describe the interplay between the economy and the climate seriously underestimated climate change-related risks.", "description": "Economists Abhijit Banerjee, Esther Duflo and Michael Kremer won the 2019 Nobel Economics Prize for their work in fighting global poverty, the Royal Swedish Academy of Sciences said on Monday.", "authors": [], "top_image": "https://image.cnbcfm.com/api/v1/image/106179767-1571047548588gettyimages-1175844405.jpg?v=1571047601", "published_at": "2019-10-14"}