{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/4/after-hurricane-devastation-gardiner-wins-gold-for", "downloaded_at": "2019-10-04 23:54:20.331818+00:00", "title": "After hurricane devastation, Gardiner wins gold for Bahamas", "language": "en", "text": "DOHA, Qatar (AP) - A month after Hurricane Dorian destroyed houses and livelihoods, Steven Gardiner said he was hopeful his world championship victory could bring a little happiness to the Bahamas.\n\nGardiner’s family home on the Abaco islands was one of many damaged in the Sept. 1 hurricane. His win in the 400 meters on Friday prompted a stream of messages from his family and friends still rebuilding their lives there.\n\n“Hurricane Dorian was very devastating for my family and my island. I just wanted to go out there and do my best,” he said.\n\n“My friends and my family, I got messages from all over. They just want me to go out there and perform but I wanted to do a little bit more. I had to fight and I was able to bring home a medal for my country.”\n\nIt looked as if the Bahamas’ chance for gold had gone when favorite Shaunae Miller-Uibo, who said she’s donated $25,000 to hurricane-hit churches, was beaten into silver Thursday in the women’s 400 despite setting a North American record.\n\nGardiner missed Miller-Uibo’s race by falling asleep early Thursday, but watched it on replay at 5 a.m. Both he and Miller-Uibo live in the United States, so they missed the hurricane, but family members were devastated.\n\nGardiner stepped up to bring the Bahamas gold, smashing his personal best to win in 43.48 seconds, more than half a second clear of Colombian Anthony Zambrano. After taking the win, he took off his shoes, wrapped himself in the Bahamian flag and lay down for a moment of contemplation amid the mayhem.\n\nSHAKY RELAYS\n\nThe U.S. men’s 4x100 relay squad withstood two shaky handoffs and two post-race protests to advance into the final.\n\nNothing’s ever seems routine for the Americans in the relays. Getting the baton around always feels like an adventure.\n\nOn Friday, Christian Coleman and Justin Gatlin had an awkward exchange off the bat. Then, Michael Rodgers and Cravon Gillespie were a little out of sync at the end.\n\nIt’s not a complete surprise - the squad didn’t spend all the much time practicing before worlds. They’re now working it out as they go.\n\n“Small mistakes,” Coleman said. “We still got the baton through. We clean it up hopefully we can be flawless and we can win.”\n\nFollowing the race both Canada and Italy filed protests. Both countries felt it was not clear if the U.S. exchanged the baton “within the takeover zone.” Both appeals were dismissed.\n\nThe U.S. has a history of relay mishaps. At the 2016 Rio Olympics, the men were disqualified for an exchange outside the zone.\n\nIt wasn’t smooth sailing on the women’s side, either. The Americans advanced despite a shaky opening handoff.\n\n“We achieved what we expected,” Dezerea Bryant said. “So it feels good.”\n\nBoth squads earned medals at the 2017 worlds - the women earned gold and the men took silver.\n\nSPLIT-SECOND WIN\n\nAfter 3,000 meters, it all came down to a fraction of a second.\n\nConseslus Kipruto of Kenya tore down the last stretch to overhaul 18-year-old Ethiopian Lamecha Girma by just one-hundredth of a second in the steeplechase. It was so close that Girma believed he’d won until the scoreboard showed otherwise.\n\n“I thought that I was first,” he said through a translator, “but unfortunately with that one microsecond I lost the gold.”\n\n___\n\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "A month after Hurricane Dorian destroyed houses and livelihoods, Steven Gardiner said he was hopeful his world championship victory could bring a little happiness to the Bahamas.", "authors": ["The Washington Times Http", "James Ellingworth", "Pat Graham"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/04/qatar_athletics_worlds_43045_c0-233-5568-3479_s1770x1032.jpg?a5a0d838ef6c4cc1ed50475c9b5d454f6fdede4f", "published_at": "2019-10-04"}