{"pub": "investingcom", "url": "https://in.investing.com/analysis/should-natural-gas-traders-close-those-longs-as-end-of-super-september-looms-200432085", "downloaded_at": "2019-09-19 23:21:17.452485+00:00", "title": "Should Natural Gas Traders Close Those Longs As End Of 'Super September' Looms?", "language": "en", "text": "Is in overbought territory?\n\nSome say it looks that way. Others admit that while prices seem on the higher end of the range, money flows have to be respected as fund buying driven by weather was still running the market.\n\nAs traders await the U.S. Energy Information Administration to report the first below-normal in a month, thanks to a surfeit in gas-powered air-conditioning use, the fuel’s price was also headed for an extraordinary fourth straight week of gains.\n\nAccording to a Reuters poll of analysts, U.S. utilities likely injected 78 billion cubic feet (bcf) into storage last week. If correct, it will be the first time since the final week of August that inventory builds have come in lower than a year ago, and below the five-year average. During the same week last year, there was an injection of 84 bcf. For the 2014-2018 period, the average build was 82 bcf.\n\nReflecting the supply-demand snapshot, gas prices have also had one of their strongest late summer rallies.\n\nNatGas 300-Min Chart - Powered by TradingView\n\n‘Super September’ For Gas Longs\n\nNon-stop weekly gains since mid August have combined into a ‘super September’ for the on the New York Mercantile Exchange’s Henry Hub.\n\nThe contract settled Wednesday’s trade at $2.64 per million metric British thermal units (mmBtu)—up 15% on the month. Since November 2018, there hasn’t been a month when Henry Hub gas has rallied so much.\n\nSome, of course, are having misgivings about the run-up, calling it excessive.\n\nInvesting.com retains a “Strong Buy” for natural gas. On the site’s Daily Technical Outlook, the top-end resistance for October gas was given as $2.77, versus last week’s $2.65.\n\nSigns Of Exhaustion Looming\n\nBut with the contract also steadily tipping above the 100- and 200-Day Moving Averages, there were signs of exhaustion.\n\nDan Myers of Houston-based gas consultancy Gelber & Associates said:\n\n“The market is retreating off highs from early this week as it begins to feel like it is in overbought territory.”\n\nHe said weekly stockpiles rises will continue to be tempered for a while by cooling demand as temperatures remain unseasonably warm.\n\nCase in point was last week’s weather, which accounted for 76 cooling degree days (CDDs) versus the 30-year average of 57 CDDs for the period.\n\nCDDs measure the number of degrees a day's average temperature is above 65 Fahrenheit (18 Celsius) and are used to estimate demand to cool homes and businesses.\n\nJust Days Left To Summer End, Fall Start\n\nBut as summer officially expires on Sept. 22, ushering in the milder fall season, residual warmth will circumvent early heating demand, making for bearish weather and prices.\n\nSaid Myers:\n\n“We are forecasting injections to pick up above average in coming weeks. “Residual warmth ... could allow for 100+ bcf injections in early October.”\n\nDominick Chirichella, director of risk and trading at the Energy Management Institute in New York, had a similar view, saying:\n\n“The lingering warmer than normal temperatures over portions of the U.S. is the primary catalyst keeping prices supported in the short term.”\n\n\n\n“As the temperatures move toward more normal levels for this time of the year, the market will be susceptible to a downward adjustment in prices as supply is more than ample.”\n\nOverbought? Perhaps; But Let’s Respect Those Longs\n\nFor now, some think that, even though the market may look slightly overbought, the premium for gas futures is justified.\n\nSaid Scott Shelton, energy futures broker at ICAP in Durham, North Carolina:\n\n“My general view on the market is that we are on the higher end of the range, but you have to respect the flows here.”\n\n“I would rather sell weakness below this week’s low than sell strength due to the potential money flows.”", "description": "Commodities Analysis by Investing.com (Barani Krishnan/Investing.com) covering: Natural Gas Futures. Read Investing.com (Barani Krishnan/Investing.com)'s latest article on Investing.com India.", "authors": [], "top_image": "https://in.investing.com/analysis/not found", "published_at": "2019-09-19"}