{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7598307/Cody-Simpson-breaks-silence-rumoured-380-000-Masked-Singer-paycheck.html", "downloaded_at": "2019-10-22 13:58:01.485994+00:00", "title": "Cody Simpson breaks his silence on rumoured $380,000 Masked Singer paycheck", "language": "en", "text": "Cody Simpson won the inaugural season of The Masked Singer Australia on Monday night after performing on the show as The Robot for four weeks.\n\nAnd on Tuesday, the Australian singer broke his silence on the rumoured $380,000 paycheck he received for appearing in the contest.\n\nDuring an interview with KIIS FM's Kyle And Jackie O show, a fan called in to ask the pop star about the impressive sum, which was leaked by Woman's Day ahead of the finale.\n\n'We all love the cash': Cody Simpson has broken his silence on the rumoured $380,000 paycheck for appearing on The Masked Singer Australia as The Robot\n\nThe magazine claimed Cody was offered a $200,000 sign-on fee, and given a $30,000 bonus for each of the six episodes he appeared on.\n\nAwkwardly reacting to the bold comment about his earnings, he joked: 'We all like the cash.'\n\nHowever he went on to say: 'I won't disclose payments, it takes away the fun of why I did it. I did it for the fun, I didn't do it for the money.'\n\n'But yeah, I'll pass on that one if that's alright. But thanks for being interested in it, yeah, we all love the cash,' Cody laughed as the hosts moved on from the topic.\n\n'I won't disclose payments... I did it for the fun, not the money': Woman's Day claimed Cody was given a $200,000 sign-on fee, and an additional $30,000 for each of the six episodes he appeared on as The Robot\n\nAhead of the finale, Cody was widely speculated to be The Robot.\n\nAn industry expert told the publication: 'Even though [Cody] is relatively unknown in Australia, he's considered very high on the US food chain and it would have taken at least that much [$200,000]to get Cody over here for the show.'\n\nHis rumoured paycheck is also believed to surpass the speculated salaries of judges Dave Hughes, Jackie O Henderson and Dannii Minogue, who reportedly received $200,000, $250,000 and $350,000 respectively.\n\n'He's considered very high on the U.S. food chain': An expert claimed Cody Simpson (pictured with his girlfriend Miley Cyrus) would require a large paycheck to lure him to the show\n\nIn the list, compiled by Woman's Day, it was alleged the 12 stars received varying 'secret salaries' between $10,000 to $380,000.\n\nNikki Webster (The Alien) was reportedly paid the least at $10,000, while Cody was thought to have walked away with a whopping $380,000.\n\nThe highest-paid female was apparently singer Kate Ceberano (The Lion), who received a $70,000 sign-on fee and an additional $5,000-per-episode bonus.\n\nStar appeal: Each celebrity was believed to be paid between $10,000 and $200,000 as a sign-on fee, with some stars paid more depending on how many episodes they appeared on\n\nNot equal: In a list compiled by Woman's Day, Nikki Webster (left) was reportedly paid the least at $10,000, while Kate Ceberano (right) was the highest-paid female at $90,000\n\nMeanwhile, Deni Hines (The Unicorn) and Gretel Killeen (The Octopus) both received a $20,000 sign-on fee, while Paulini Curuenavuli (The Spider) was paid $25,000.\n\nOn average, the show's male participants earned more than their female co-stars.\n\nDarren McMullen (The Prawn) was paid $20,000 to sign on, Brett Lee (The Parrot) was given $40,000, Adam Brand (The Dragon) earned $30,000 and Wendell Sailor (The Rhino) received $15,000.\n\nInterestingly one of the popular female finalists, The Monster (Gorgi Coghlan), was offered one of the lowest sign-on fees of $15,000.\n\nOther finalist The Wolf (Rob Mills) was reportedly given $50,000 to join the reality show.", "description": "Cody Simpson won the inaugural season of The Masked Singer Australia on Monday night after performing on the show as Robot for four weeks.", "authors": ["Candice Jackson For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/00/20012994-0-image-a-7_1571700935552.jpg", "published_at": "2019-10-21"}