{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/zara-mcdermotts-school-bullying-hell-20563217", "downloaded_at": "2019-10-12 00:20:28.072971+00:00", "title": "Zara McDermott's school bullying hell left her too nervous to sing in front of people", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Daily Love Island stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAfter the cruel taunts of bullies at school made her too nervous to perform, Zara McDermott has had therapy to enable her to take part in Celebrity X Factor .\n\nThe sessions have helped to ease the crippling anxiety that stemmed from those jibes when she was a child.\n\nZara, 22, will appear on the singing show tonight in a group alongside fellow Love Island stars Wes Nelson , Samira Mighty and Eyal Booker.\n\nZara said: “I got so badly bullied in school that I was put off performing.\n\n“I performed in school a couple of times. I was pretty much booed off stage, and laughed off stage, and laughed at during my performances, which crippled my confidence.”\n\nAsked why she was targeted, she said: “I was just the girl that was picked on because I was quite a vulnerable person to be picked on. I’ve really had a rough time of it.\n\n“I love music, but it was never really in my future because I could never see myself being able to come out of my shell.” She said her first practice with the Celebrity X Factor group left her in a state, and she had to see a counsellor.\n\nZara added: “Our first rehearsal session, I was a nervous wreck. I could barely sing in front of the vocal coach.\n\n“I was struggling so much, I was shaking. With the help of therapy that nervousness is getting less.\n\n“In my head I don’t feel I’ve properly overcome it. Once I get up on that stage and I’ve sung in front of Simon [Cowell] and it’s gone well, that’s when it’ll hit me, and I’ll be like ‘I’ve overcome it – I can do anything now’.”\n\nOther stars taking part include Strictly dance pro Brendan Cole, US chat show host Ricki Lake and The Chase quizzer Jenny Ryan.\n\nThe show also features journalist Martin Bashir, Corrie actress Victoria Ekanoye, reality TV star Megan McKenna, and rugby internationals Ben Foden and Thom Evans.\n\nSimon will judge the series alongside Louis Walsh and Nicole Scherzinger.\n\n* The show is today on ITV at 8.35pm.", "description": "EXCLUSIVE: The Love Island star has finally found the courage to take part in X Factor: Celebrity after having therapy", "authors": ["Tom Bryant"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20560717.ece/ALTERNATES/s1200/0_JS195500202.jpg", "published_at": "2019-10-11"}