{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/13/giggles-and-joy-jumps-rats-love-games-of-hide-and-squeak-scientists-find", "downloaded_at": "2019-09-13 07:21:05.503003+00:00", "title": "Giggles and 'joy jumps': rats love games of hide and squeak, scientists find", "language": "en", "text": "Rodents enjoyed being found by humans and would hide again to keep the game going\n\nThe next time you see a rat darting for cover, consider this: it might just want to have a playful game of hide-and-seek.\n\nA group of neuroscientists in Germany spent several weeks hanging out with rodents in a small room filled with boxes, and found the animals were surprisingly adept at the childhood game – even without being given food as a reward.\n\nThey recorded joyful leaps and ultrasonic giggles – which previous work has shown to be signs of happiness – when the rats found the humans or were caught by them.\n\nThe researchers’ paper was published in the journal Science on Thursday, and offers new insight into play behaviour, an important evolutionary trait among mammals.\n\nAlleged drug gang thwarted by giant seal in $1bn Australian drug bust Read more\n\n“When you work a lot with rats over the years, you see how intelligent these animals are, and how social,” said co-author Konstantin Hartmann from the Humboldt University of Berlin.\n\nWorking with adolescent male rats in a room of 30 square metres (320 square feet), a scientist would either find a cardboard box to crouch behind in a hiding role, or give the rat a headstart to find cover while the scientist searched.\n\nOver a period of one to two weeks, the rats were taught that starting the game inside a closed box that was opened remotely meant they were seeking, while starting the game with the box open meant they were hiding.\n\nThey quickly developed advanced strategies, including revisiting spots humans had previously hidden when they were seeking, and choosing to take cover in opaque rather than transparent boxes when hiding.\n\nTo help train them, the authors rewarded the rats not with food or water, which would invalidate the experiment, but with positive social interaction in the form of physical contact, explained Hartmann.\n\n“They chase our hand, we tickle them from the side, it’s like a back and forth a little bit like how you play with small kittens or puppies,” he said.\n\nThe scientists suspect though that the rats were motivated not just by this interaction but that they also liked to play for the sake of play itself.\n\nThe animals would let out high-pitched giggles three times above the human audible range and would execute so-called “joy jumps” during the game – both associated with feelings of happiness.\n\nOnce they were discovered, the rats often jumped away and “playfully re-hid” at a new location, sometimes repeating the process several times – indicating they wanted to prolong the play session and delay the reward.\n\nPlay is an important part of cognitive development for adolescent mammals, and rats make for ideal models to study brain activity in humans because of their evolutionary proximity to humans.", "description": "Rodents enjoyed being found by humans and would hide again to keep the game going", "authors": ["Agence France-Presse"], "top_image": "https://i.guim.co.uk/img/media/a3e9aedbf9818b3ed0770c5eadc79e7668fab801/0_348_4000_2400/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=b085cfcfbe6e4bff382f09a9d9aa9c46", "published_at": "2019-09-13"}