{"pub": "washingtonpost", "url": "https://washingtonpost.com/outlook/2019/10/16/why-president-trump-invoked-devastation-military-deaths-push-his-syria-policy", "downloaded_at": "2019-10-16 13:32:20.729400+00:00", "title": "Why President Trump invoked the devastation of military deaths to push his Syria policy", "language": "en", "text": "To support his decision to withdraw U.S. troops from Syria and stop “these endless wars,” Trump described in lurid detail parents and spouses encountering their deceased at Dover Air Force Base. They “scream, like I’ve never seen anything before,” he recounted. “They’ll break through military barriers. They’ll run to the coffin and jump on top of the coffin. Crying mothers and wives. Crying desperately.”\n\nThe next day retired Adm. James Stavridis chastised Trump for making a spectacle of the families’ grief. “It’s inappropriate. That’s why we don’t have cameras in situations like that.”\n\nAD\n\nAD\n\nBut as offensive as Trump’s descriptions may have been, the president was drawing on a well-established tradition. American politicians, especially presidents, have long relied on the fallen to advance political agendas, some more effectively or reverently than others. Whether to recast history, legitimize a policy decision or chart a future course, presidents call on the symbolism of military sacrifice to remind the public that they belong to something greater — a nation worth dying for, which in turn strengthens the commander in chief at its helm.\n\nTake military cemeteries, for example. Their hallowed grounds have provided presidents with poignant backdrops for underscoring messages of national unity. When Abraham Lincoln delivered the Gettysburg address at the dedication of the Union cemetery there, he called on the memory of the dead to embolden the living. He resolved “these dead shall not have died in vain — that this nation, under God, shall have a new birth of freedom — and that government of the people, by the people, for the people, shall not perish from the earth.”\n\nThen there are the unknown war dead, whose anonymity offers rich rhetorical soil to till, especially for presidents reflecting on national sacrifice in the wake of war. After the First World War, Congress approved legislation to establish the Tomb of the Unknowns, and on Armistice Day, Nov. 11, 1921, an unidentified soldier from a battlefield in France was buried at the plaza of the Memorial Amphitheater in Arlington National Cemetery. Like its counterparts in France and England, the monument was erected to provide a constant reminder of the price of war and the valor of the state.\n\nAD\n\nAD\n\nIn his address at the public funeral for the WWI Unknown, President Warren Harding explained, “We do not know his station in life, because from every station came the patriotic response of the 5 million. … We do not know the eminence of his birth, but we do know the glory of his death.” Though Harding and his predecessor Woodrow Wilson, who rode in a carriage with the caisson’s procession, disagreed about how best to pursue it in the future, the theme of peace dominated the public ceremony.\n\nSix decades later, with the help of another set of unknown, unidentified remains, this time from the Vietnam War, and a nod toward Lincoln’s famous oration at Gettysburg, President Ronald Reagan seized the opportunity to recast the conflict in Southeast Asia as a “noble cause.” Like Harding, he too understood the powerful symbol of the nameless warrior to evoke “all our missing sons.” Standing beside the flag-draped coffin, he urged Americans to imagine the unknown as someone who could have come from their own community, perhaps even their own family: “As a child, did he play on some street in a great American city? Did he work beside his father on a farm in America’s heartland? Did he marry? Did he have children?” Through the figure of this unnamed fallen, Reagan sought to advance his goal of reviving “proud faith in American exceptionalism,” an effort that, as historian Christian Appy argues, “required some serious scrubbing of the historical record.”\n\nAlthough forensic testing eventually identified the soldier referenced by Reagan, the Tomb of the Unknowns continues to host important public ceremonies and state events. U.S. presidents come to lay wreaths before the crypts on Memorial Day and Veterans Day and give speeches in times of war and peace. It has become a now-obligatory tradition for presidents to telegraph the gravitas of their new station. President-elect Barack Obama visited it the day before his swearing-in in 2009, and Donald Trump’s first official inaugural event on Jan. 19, 2017, was to lay a wreath before the monument.\n\nAD\n\nAD\n\nBut at key moments in his presidency, Trump has stumbled to harness the symbolic power of war dead. He got off to a rough start after picking a fight with a Gold Star family during the presidential campaign. He stumbled again in his first year in office getting into a spat with the wife of a soldier killed in Niger in October 2017. In both instances, the president took to Twitter, launching personal attacks against individual family members or their perceived proxies.\n\nRather than deference to the fallen and their sacrifices, Trump displayed a personal defiance toward their surviving kin, breaking with his predecessors’ tradition of paying homage to sacrifice in an effort to promote national unity.\n\nThis tendency was also on display at Normandy on the 75th anniversary of the D-Day invasion, when Trump combined a sober address with a Fox News interview that attacked political rivals rather than underlined national unity. With the rows of white crosses, headstones for the fallen, in the background, the president took aim at his political enemies, deriding special counsel Robert S. Mueller III as a “fool” and Speaker of the House Nancy Pelosi a “nasty, vindictive, horrible person.”\n\nAD\n\nAD\n\nThe incongruity between his words and the setting stood out all the more in contrast to his predecessors, especially President Reagan’s famous “Boys of Pointe du Hoc speech” at the 40th anniversary of D-Day. In that address, as historian Michael Dolski explains, Reagan championed “American-dominated response to restore moral order to the world.” Notably, Reagan delivered his famous D-Day speech just over a week after he presided over the burial of the Vietnam War Unknown in Arlington National Cemetery. He understood that healing at home, or at least the optics of it, was necessary for the United States to claim moral ground abroad.\n\nNo doubt each president grapples differently with the responsibility of sending troops into harm’s way and honoring those who die in service of the nation. And political agendas have long been interwoven with the decorum and reverence these occasions demand and deserve. But, each time Trump elevates personal vendettas over national unity, he loses the power of this tradition. In the process, he faces renewed criticism, whether for violating the trust of his office or failing to capitalize on the symbolism of the moment, hardly the best way to achieve his policy goals.\n\nAD", "description": "Presidents have long used military sacrifice to advance their own agendas.", "authors": ["Sarah Wagner", "Sarah Wagner Is An Associate Professor Of Anthropology At George Washington University", "Author Of The Forthcoming Book"], "top_image": "https://www.washingtonpost.com/resizer/XL8UryrWnTV0Y4IlmI5l-DWsAFI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DHVHIBEIJQI6THLT4K5GXPY3TM.jpg", "published_at": "2019-10-16"}