{"pub": "businessinsider", "url": "https://businesstimes.com.sg/asean-business/macroeconomic-stability-in-malaysia-continues-to-improve-anz", "downloaded_at": "2019-10-02 12:50:32.841064+00:00", "published_at": "2019-10-02", "title": "Macroeconomic stability in Malaysia continues to improve: ANZ", "language": "en", "text": "MACROECONOMIC stability in Malaysia continues to improve on the back of compliance with the fiscal targets of 2019, ANZ analysts said in a report.\n\n\"Onshore experts have reaffirmed our view that macroeconomic stability in Malaysia is improving. The centrepiece of this emerging stability has been the ability of the coalition government to consolidate public finances, a long-standing concern of market participants and one that has lingered despite in the first half of 2019 budget realisations broadly complying with full year targets,\" the report said.\n\nTitled Malaysia Insight and dated Oct 1, it is co-authored by ANZ analysts Sanjay Mathur, chief economist for Southeast Asia & India, and Jennifer Kusuma, senior rates strategist.\n\nIn H1 2019, the budget deficit averaged 3.1 per cent of GDP compared with the full year official projection of 3.4 per cent of GDP.\n\nsentifi.com Market voices on:\n\nThe report noted that the aggregate revenue-to-GDP ratio in H1 2019 was marginally higher than the full year official target whereas the contrary was true for expenditures. The slight underperformance of the latter was due to lower development spending, which in turn seems to be related to a downward cost revision of major infrastructure projects, it added.\n\nBoth analysts said policymakers intend to use the fiscal space arising from higher than budgeted revenues to step up spending, rather than to cap the full year 2019 budget deficit at below 3.4 per cent of GDP. From the perspective of the authorities, the currently challenging growth environment makes a compelling case to step up spending.\n\n\"It is also for this reason that the 2020 budget deficit target may be maintained higher at around 3.2 per cent of GDP, 20 basis points higher than indicated at the time of the 2019 budget announcement last year. The point here is that a target of this order will still enable Malaysian policymakers to communicate their seriousness on fiscal consolidation while enhancing the space to address challenges to growth,\" the report said. \"With the exception of a tax on digital services, no new tax measures are on the cards. Rather, the focus is on further augmenting tax efficiency.\"\n\nAnalysts also consider further monetary easing to be likely.\n\n\"Overall, this challenging environment, which is likely to ensure that 2019 and 2020 GDP growth remains below its potential range of 4.5 to 5 per cent, does make a case for fiscal relaxation. A related takeaway was on monetary policy — a 3 per cent Overnight Policy Rate is no longer a line in the sand,\" the report said.", "description": ": THE BUSINESS TIMES ASEAN Business - The improving stability comes on the back of compliance with 2019 fiscal targets, analysts said. . Read more at The Business Times.", "authors": ["Aseanbusiness Staff", "Btnews Sph.Com.Sg"], "top_image": "https://www.businesstimes.com.sg/sites/default/files/image/2019/10/02/malaysia%20skyline.jpg"}