{"pub": "cnbc", "url": "https://cnbc.com/2019/10/30/most-uk-adults-wouldnt-immediately-help-their-partner-out-of-debt.html", "downloaded_at": "2019-10-30 09:14:23.817026+00:00", "title": "Almost two out of three UK adults wouldn't immediately help their partner out of debt, survey says", "language": "en", "text": "Just 37% of U.K. adults say they would immediately step in to help their partner out of debt troubles, according to a survey conducted by asset manager Fidelity International.\n\nThe numbers fall even further if the situation happened repeatedly, with just 21% of women and 16% of men saying that they would help their partner out but only once.\n\nIn neither sex did a majority of respondents think that the reason for falling into debt would affect a decision to bail out a partner.\n\nJust two-fifths (38%) of women said they would want to know why their partner fell into debt before stepping in. An even smaller proportion of men (30%) said they would need to know the details.\n\nThe poll of 2,000 U.K. adults was conducted by the asset manager in May 2019 and all respondents had over £1,000 ($1,290) worth of investable assets.\n\nAn almost identical proportion of men (86%) and women (85%) questioned said they would rather know about their partner's debt so they could tackle the problem together.\n\nBritons have an average £31,284 ($40,297) of personal debt, of which £1,373 is credit card debt, according to research from U.K. organization The Money Charity.\n\nMaike Currie, Director at Fidelity International, said that while debt could be \"thorny issue\" for any relationship, communication is key and tackling these issues early on can prevent them from becoming an \"insurmountable problem\" later down the line.\n\nShe suggested starting off by distinguishing between different types of debt and paying off the most pressing first, such as high-interest borrowings like credit cards.", "description": "Just 37% of U.K. adults say they would immediately step in to help their partner out of debt troubles, according to a survey conducted by asset manager Fidelity International.", "authors": ["Vicky Mckeever"], "top_image": "https://image.cnbcfm.com/api/v1/image/105831322-1554760662540couple22.jpg?v=1572426431", "published_at": "2019-10-30"}