{"pub": "washingtonpost", "url": "https://washingtonpost.com/weather/2019/10/29/dc-area-forecast-clouds-return-showers-wait-until-tomorrow-night", "downloaded_at": "2019-10-29 13:59:01.827765+00:00", "title": "D.C.-area forecast: Clouds return, but showers wait until Wednesday night", "language": "en", "text": "\n\nA District motorcade. (John Sonderman/Flickr)\n\nTODAY’S DAILY DIGIT\n\nA somewhat subjective rating of the day’s weather, on a scale of zero to 10.\n\n6/10: Clouds shroud the sky, but it’s still a nice call for fall.\n\nEXPRESS FORECAST\n\nToday: Mostly cloudy. Highs: 64-69.\n\nTonight: Mostly cloudy. Lows: 47-55.\n\nTomorrow: Mostly cloudy. Highs: 67-71.\n\nView the current weather at The Washington Post headquarters.\n\nFORECAST IN DETAIL\n\nWhile clouds return for the next few days, temperatures continue their pleasant seasonal to warm pacing as highs range in the 60s to around 70 and lows reach into the cool 40s to 50s. The next weather system brings showers tomorrow night into Halloween day. Showery weather for trick-or-treaters looks hit-or-miss, but some heavier rain is possible after midnight when the main cold front comes through. The first weekend of November looks nice and cool.\n\nGet our daily forecasts on your Amazon Alexa device. Click here to find out how.\n\nToday (Tuesday): Patchy morning fog possible. Then clouds prevail with just a few hints of sunshine at times as temperatures increase into the comfortable middle to upper 60s. Light winds from the southeast. Confidence: High\n\nTonight: Mostly cloudy and cool with lows from the middle-upper 40s in the outer suburbs to the middle 50s in the city. Light winds. Confidence: High\n\nFollow us on Facebook, Twitter, and Instagram for the latest updates. For related traffic news, check out Gridlock. Keep reading for the forecast through the weekend.\n\nTomorrow (Wednesday): Cloudy skies continue as high temperatures edge a bit warmer into the upper 60s to low 70s. Light winds from the south. Confidence: High\n\nTomorrow night: Scattered mainly light showers with lows ranging from the 50s to right around 60 in the city. Confidence: Medium\n\nA LOOK AHEAD\n\nHalloween (Thursday) continues the cloudy skies with scattered showers during the day. Highs reach up to around 70. Scattered showers continue into the evening and should be of the hit-or-miss variety during prime trick-or-treat hours as temperatures cool slowly into the 60s. Later at night, especially after midnight, a line of heavier showers and even some rumbles of thunder are possible as the main cold front slices through. Lows fall into the 50s for early Friday morning. Confidence: Medium\n\nFriday could include some early showers, but we should then break into some sun as it turns windy and cooler, with temperatures only making it into the middle to upper 50s. Friday night continues on the windy side and colder with lows in the middle 30s to middle 40s. Confidence: Medium\n\nA colder and drier first weekend of November is favored with partly to mostly sunny skies, and highs only in the 50s and lows Saturday night mostly in the 30s under mostly clear skies (maybe right around 40 in the District). Confidence: Medium-High", "description": "A cloudy but pleasant Tuesday will be followed by a wet midweek spell, including some showers for Halloween.", "authors": ["Matt Rogers", "October At Am", "Matt Rogers Is A Meteorologist", "A Petworth Resident. He Is President", "Co-Founder Of Commodity Weather Group In Bethesda", "Md.", "Which Focuses On Weather Risks For The Energy", "Agriculture Sectors. Like Most Meteorologists", "His Passion For Weather Started Extremely Early In Life", "Has Never Let Go."], "top_image": "https://www.washingtonpost.com/resizer/hOA1Uj5ssz7mdX1AWU7yzARNxzY=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/25BMA2BA2ZBAVJV4TJHZXPLRGQ.jpg", "published_at": "2019-10-29"}