{"pub": "yahoo", "url": "https://news.yahoo.com/kristin-cavallari-called-very-insensitive-184439253.html", "downloaded_at": "2019-09-12 07:11:24.213150+00:00", "title": "Kristin Cavallari called out for 'super insensitive' 9/11 post, fires social media staffer", "language": "en", "text": "Kristin Cavallari has reportedly fired one of her social media staffers after sharing a \"super insensitive\" post remembering 9/11.\n\nOn the 18th anniversary of the September 11th terrorist attacks, many stars took to social media using the #NeverForget hashtag to pay tribute to the lives that were lost that day, posting American flags, photos of the World Trade Center and more.\n\nOn the \"Very Cavallari\" star's page, however, her followers were surprised to see a photo of the reality star, 32, wearing a sexy, plunging mini-dress on the streets of New York City with the caption, \"NYC for 24hrs. And what a time to be here..always remember.\"\n\nUsers to quick to call Cavallari out in the comments: \"Wrong picture for the sentiment in the post,\" one person wrote, while others called it in \"poor taste\" and \"super insensitive.\"\n\n\"I love you and think that you are generally spot on in the things that you choose to present, but this is just disrespectful and undermining to the magnitude of the events that occurred on that horrific day,\" another follower commented.\n\nWhile the caption has since been edited to simply read, \"NYC for 24hrs,\" Page Six reports that the former star of \"The Hills\" actually didn't post the photo herself: Her team sent the photo to a social media manager to post with the caption, \"24 hours in New York City,\" but the staffer took it upon herself to add the 9/11 mention while Cavallari was in a fitting on Wednesday morning.\n\nShe has since been fired after an unclear amount of time on the job.", "description": "'Very Cavallari' star Kristin Cavallari is parting ways with her social media manager after a debacle on September 11.", "authors": ["Gibson Johns"], "top_image": "https://s.yimg.com/uu/api/res/1.2/9xtefQCWiiksuAXUfdTF3Q--~B/aD02NzU7dz0xMDI4O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://o.aolcdn.com/images/dims3/GLOB/crop/346x227+0+12/resize/1028x675!/format/jpg/quality/85/https://s.yimg.com/os/creatr-uploaded-images/2019-09/ee0527d0-d4c2-11e9-8fcd-d2fca1a915cd", "published_at": "2019-09-11"}