{"pub": "businessinsider", "url": "https://businessinsider.com/26-year-old-entrepreneur-built-one-million-dollar-business-in-school", "downloaded_at": "2019-09-25 23:29:46.784198+00:00", "title": "A 26-year-old college student took $200 and launched a $1.7 million swimwear business in a year out of her apartment. This is how she did it.", "language": "en", "text": "Ana Gavia is 26 years old, and the founder of the ecommerce startup Pinkcolada.\n\nShe started Pinkcolada, which sells stylish, affordable, and high-quality swimsuits, when she was 25 and a student at La Trobe University in Melbourne, Australia getting a master's degree in podiatric medicine.\n\nSince launch, the company has brought in $1.7 million in revenue.\n\nGavia shared with Business Insider how she got her start in her college apartment, how she grew the business through reinvesting her profits into production and marketing (and capitalizing on Instagram), and her advice for startup founders looking to gain similar results as her.\n\nShe said that \"I sacrificed everything in my life — relationships, friendships, social life, parties, my studies, and my sleep\" to create Pinkcolada, and doesn't believe entrepreneurship and ecommerce is for everyone.\n\nClick here for more BI Prime stories.\n\nA year ago, Ana Gavia was a 25-year-old college student with an idea: Why not launch an online swimwear business?\n\nToday, the 26-year-old has become a full-fledged entrepreneur as the founder and CEO of the ecommerce startup Pinkcolada. Launched from her house while attending university, the new venture generated a seven-figure turnover in just over a year of the company being established, after Gavia started the business with only $200.\n\nWith sales driven primarily by social media and advertising, Pinkcolada has rapidly grown, already tapping into the international market. According to Gavia, as of August 2019, Pinkcolada had reached a sales growth of 216% since January 2018 and hit the $1.7 million mark in revenue.\n\n\"I have been entirely involved in my business every step of the way, from designing the bikinis from a sketch, building the website, taking photos of the products, editing the product images, integrating payment pathways, marketing [the products], managing finances, setting up shipping carriers, implementing software, picking and packing, [handling] customer service [and] admin — I've done it all myself and learned a lot along the way,\" she said.\n\nHow did Gavia scale a business to over $1 million so quickly, and while still a university student, no less? Gavia gave Business Insider the inside scoop on her successful ascent.\n\nA business is born — at home\n\nAna's idea for Pinkcolada was born of necessity, or at least of personal fashion preference. She had been searching for swimwear that was \"stylish, high quality, and affordable\" but came up empty handed. Her inspiration to have the type of swimsuit she wanted led to her noodling around with digital designs.\n\n\"I used to spend a lot of time on the computer just playing around in the Myspace days with HTML coding layouts, using Photoshop, editing and creating cool images, and making them look good,\" said Gavia. \"It was something I always enjoyed during school when I was younger; I loved fashion design and art.\"\n\nYet what began as a small-scale hobby quickly grew legs. Gavia recognized that she could parlay her digital skills and her passion for design into a perfect ecommerce opportunity — one she could even execute on her own from home. \"It was an introvert's dream!\" said Gavia.\n\nGavia initially wanted to focus on a wider fashion arena with her designs, including dresses and shoes, but because of her limited budget she decided to hone in on bikinis. \"[C]lothing costs a lot to manufacture, [so] I decided to choose bikinis because they require little fabric, are lighter, and cheaper to ship,\" she said. \"I also love the summer and all things tropical, so I thought, what a better way to express my creativity and love for summer than in swimwear!\"\n\nSo, she said, \"I went home and started doing research and drawing designs in my study. The initial research stage and development of my very first [swimsuit] designs started from my home, literally with just a few boxes.\"\n\nAna Gavia. Courtesy of Ana Gavia\n\nGavia came up with the Pinkcolada concept while attending a master's degree program in podiatric medicine at La Trobe University in Melbourne, Australia. To get the job done while balancing her course load, she would spend time working on her designs every day after she got home from the university. \"I did a lot of research just by searching in Google Images and looking at photos for inspiration for designs, and learned what kind of bikinis were already out there,\" she said. \"I saw a void in the designs that were [available] and realized that there weren't many fun, vibrant bikinis out there!\"\n\nSoon after, Gavia expanded her efforts from sketching swimsuit designs to researching for distributors. \"A lot of the distributors I found denied my small order and eventually I found one who accepted,\" she explained. Once she received her first batch of swimsuits, her next step was to take very basic photos of them in her study, three of which she showcased on a very simple website that she built.\n\n\"I had very little knowledge of marketing at the time, and decided to stick with a basic plan of posting the swimsuits on Instagram and Facebook,\" she said. A few days later, she received her first order, and Pinkcolda was off and running.\n\nIn the beginning, Gavia did everything manually, which resulted in inefficiencies. \"I had no idea how to optimize the processes,\" she said. \"It was very time-consuming and I didn't know anything about business or operating one.\" She recalled printing out shipping labels, cutting out each one, and taping each edge four times, one by one, for each parcel. \"I didn't know what a label printer was and I couldn't afford one at that time either,\" she said.\n\nShe may have been waylaid by processes, but she wasn't deterred.\n\n\"Once my first batch of bathing suits sold out, I reinvested my profits and purchases [for] a larger order. Once they sold out, I repeated and my business began to grow,\" she explained. \"I ordered more swimsuits and improved my website.\" Gavia also prioritized researching the demand for her products. \"I think that was kind of common sense to me, but I now realize that a lot of business owners don't ask their customer what they want before starting a business,\" she said.\n\nGavia explained that from the start, she has funneled most of the money that the business generates into marketing, advertising, and production and design. Instagram is currently Pinkcolada's strongest and most engaging platform for driving customer engagement.\n\nThe student becomes the entrepreneur\n\nAs a graduate student, she lived off campus, which gave her time and space to focus on her new enterprise from home.\n\n\"I only had to be at university for clinical lessons, and most lectures were recorded and delivered online,\" she said. \"I worked a lot of hours [from home] after and before university to manage and grow Pinkcolada.\"\n\nWhile her apartment study was her initial go-to place to conduct all of her business operations and sort and prep orders for shipping, she soon maxed out that space as her business rapidly expanded. So, in the style of Apple and Amazon, she moved the business's operations to her garage. When Pinkcolada's orders outgrew even her garage's capacity, Gavia relocated to a warehouse, out of which it operates today.\n\nIn these early stages of the startup, Gavia was a solopreneur in the truest sense of the word. No one helped her with launching her company, and although she was still an enrolled student, she kept the news about the startup to herself while in school. \"I didn't think anything big of it at the time and didn't anticipate its rapid growth, so no one knew about it,\" she said.\n\nPinkcolada has over 100,000 followers on Instagram. Courtesy of Instagram\n\nEven after Gavia extended her hours to include working on Pinkcolada on weekends as well as evenings, she soon reached a point \"where it was obviously not sustainable.\" She had to decide between continuing her master's program or pursuing her startup full time. The startup won.\n\n\"It was a tough choice to make because I thought about if Pinkcolada failed, was temporary, or didn't work out,\" Gavia said. \"I had already studied for my anticipated career for a long hard five years, so it was difficult to let go and risk it all with uncertainty.\"\n\nBut, she added, \"I...reminded myself that I was still young, and if I'm ever going to take the risk in my life to try something like this, the best time is now,\" she said. \"I thought [if] worse comes to worst, I can go back to uni later on to finish my studies.\" (Gavia's student debts are on HECS, a loan payment program by the Australian government in which her debt is deducted from her income over time.)\n\nDespite this challenging decision, Gavia hopes to keep a door open to the possibility of one day transferring the skills she has developed through her site to something medical related. (Gavia's undergraduate degree from Deakin University is in medical biotechnology and nutrition.)\n\n\"I love science and would love to go back and do some cancer research in my field,\" said Gavia.\n\nLearning to make sacrifices and take a methodical approach led to financial success\n\nWhen asked how she beat the odds and managed to launch a wildly successful startup so quickly when so many others fail at this task, Gavia first pointed to her dedication.\n\n\"I sacrificed everything in my life — relationships, friendships, social life, parties, my studies, and my sleep,\" said Gavia. \"I worked 120-hour weeks for an extended period of time, seven days a week, and slept in my office because it was simply 'time inefficient' to go home because I'd lose one hour of 'work time' commuting to and from work.\"\n\nShe added that this type of work-life imbalance is \"not something [she] would ever recommend to anyone,\" noting that she ran the business on her own until earlier this year. She now has three team members in Pinkcolada's warehouse and three working remote.\n\nThe second thing that Gavia pointed to was taking a methodical approach to her business.\n\n\"I tested what worked and what didn't,\" said Gavia. \"I then made my decisions based on the results. I continued to do this across all aspects. I learn, I test, I evaluate the results, then I keep testing other variables and reiterating until it's refined as close as possible to perfect.\"\n\nBased on her own experience, Gavia suggested that people in their twenties who aspire to a similar path should first figure out what their long-term goals and priorities are — and what sacrifices they are willing to make.\n\n\"Entrepreneurship is a very tough journey to embark on, and I think the term is used very lightly across my generation, particularly with social media glamorizing entrepreneurship,\" said Gavia. \"A lot of people think starting a business is going to give them the flexibility to work their own 'hours' and open up a lifestyle full of opportunity and work-life balance,\" said Gavia. \"Anyone who's run a real startup knows that this is far from reality!\"\n\nGavia offered the following advice: \"You have to be prepared for the sacrifices, be completely fixated on your vision, and unbalanced in every way for a period of your life to get ahead and reach success,\" she said. \"I would never 'recommend' anyone embark on that type of lifestyle, because the reality is that it's not for everyone. It's tough and pushes you as a person in ways you would have never thought possible.\"\n\nPassion is a must-have for any entrepreneur — but it's not always enough\n\nWhile it would be easy to conclude from Gavia's story that ecommerce is the way to go if you want financial success, she expressed her view that it's best to take a career path that you're truly passionate about, rather than try to pick a lucrative field.\n\n\"If you do something with the intent of just 'earning big money' and that's your motivating factor, then you are going to burn out pretty quickly,\" said Gavia. \"You need to be passionate to be able to sustain your motivation over the long term to succeed.\"\n\nWhile Pinkcolada started as a small business fueled by passion, Gavia emphasized that she \"never anticipated it to be[come] a million-dollar business,\" noting that swimwear and fashion in general is a very competitive niche.\n\n\"Passion alone is not enough,\" she summarized. \"It's about finding a way to apply your passion in business to be able to make a living out of it. Follow your passion, put the pieces together, create the demand, and the money will come.\"", "description": "Ana Gavia started Pinkcolada, which sells stylish and affordable swimsuits, when she was just 25 and a medical student in Australia.", "authors": ["Robin Madell"], "top_image": "https://image.businessinsider.com/5d8bc8c32e22af46cd6426ed?width=1200&format=jpeg", "published_at": "2019-09-25"}