{"pub": "yahoo", "url": "https://news.yahoo.com/uk-speaker-bercow-scourge-brexiteers-135139180.html", "downloaded_at": "2019-10-30 14:37:50.710996+00:00", "title": "UK Speaker Bercow, scourge of Brexiteers, to go up in smoke as a bonfire effigy", "language": "en", "text": "LONDON, Oct 30 (Reuters) - An effigy of John Bercow, Speaker of the House of Commons and bete noire of Brexiteers, will go up in flames on Saturday as part of an English town's bonfire night celebrations marking the failure of a 17th Century plot to blow up parliament.\n\nBercow steps down from the job of moderating debate in Britain's occasionally rowdy lower chamber after a decade on Thursday, the day Britain had been due to leave the European Union before the latest extension.\n\nCritics have accused him of frustrating Brexit, for example by allowing changes to government motions and ruling that former prime Minister Theresa May could not bring her withdrawal agreement with the EU back for a third vote.\n\nFor Remain supporters, however, Bercow has rightfully given lawmakers to power to scrutinise and control the government.\n\nBercow will go up in smoke in Edenbridge, a southeastern town that has previously burned effigies of Prime Minister Boris Johnson and U.S. President Donald Trump as part of its annual bonfire night celebrations.\n\nThe effigy has Bercow holding the heads of Johnson and Labour opposition leader Jeremy Corbyn.\n\nEdenbridge Bonfire Society Chairman Bill Cummings said \"the infuriating\" Bercow had been chosen to be the town's 11-metre high celebrity guy.\n\n\"Our message to Mr Bercow is that you cannot keep disrupting parliament and this is one situation you cannot argue yourself out of,\" he said.\n\n\"We hope Mr Bercow will appreciate the humour contained in our caricature and take it in the good spirit with which it is intended.\"\n\nThe burning of effigies is part of the British fireworks celebration that marks the failed attempt by Guy Fawkes to blow up parliament in the Gunpowder Plot of 5 November 1605.\n\n(Reporting by Paul Sandle; editing by Stephen Addison)", "description": "An effigy of John Bercow, Speaker of the House of Commons and bete noire of Brexiteers, will go up in flames on Saturday as part of an English town's bonfire night celebrations marking the failure of a 17th Century plot to blow up parliament.  Bercow steps down from the job of moderating debate in", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-30"}