{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/07/anti-brexit-mps-plot-install-speaker-bercow-pm-unity-government", "downloaded_at": "2019-10-07 09:11:04.922850+00:00", "title": "Anti-Brexit MPs Plot to Install Speaker Bercow as PM of 'Unity' Govt", "language": "en", "text": "Anti-Brexit MPs are plotting to install Speaker John Bercow as prime minister of a so-called “unity” government “of all the talents”, according to reports.\n\nBackbench MPs such as Tory arch-europhile Ken Clarke and former Labour acting leader Margaret Beckett had previously been considered as so-called “caretaker” prime ministers, installed to delay Brexit beyond October 31st and either cancel it or rig a second referendum on the issue, but the pugnacious Speaker has now emerged as frontrunner in the scheme, The Times reports.\n\nFar-left Labour supremo Jeremy Corbyn has resisted the idea of installing any “caretaker” minister to delay Brexit other than himself, but the largely centrist, cross-party EU loyalist bloc in Parliament have been reluctant to coronate the divisive party leader.\n\nThe EU loyalists hope he can be persuaded to back their plan, however, by putting up a “unity” government of so-called “clean skins”; backbench MPs who have been expelled from their parties — like Mr Clarke and his fellow anti-Brexit ex-Tories — or those who have claimed they are standing down at the next election, like former Liberal Democrat leader Vince Cable, who is said to be eyeing a role as Chancellor of the Exchequer.\n\nSpeaker Bercow: Boris Refusing to Ask for Brexit Delay Same as ‘Robbing a Bank’ https://t.co/cycY2lUiDW — Breitbart London (@BreitbartLondon) September 13, 2019\n\n“If none of the opposition party leaders are given roles in the Cabinet, then it should allay Corbyn’s fears that his authority will drain away if he does not become caretaker prime minister,” a source “familiar with the idea” told The Times.\n\nIt is suggested that “MPs who are standing down will also be able to rise above their own self-interest because they will not be seeking re-election, meaning they will be able to put the country before their own parties” and “narrow partisan interests” — although there is also the risk that such politicians would govern without any reference to the wishes of the Brexit-voting general public, as they would have no need to retain their support at the ballot box.\n\nHow proponents of the idea hope to sell a cross-party coalition of anti-Brexit MPs which did not exist prior to the 2017 election and has no electoral mandate through a manifesto as a “unity” government is also unclear.\n\n‘Foreign Collusion’ – Govt Probe Into MPs Drafting Anti-Brexit Law with EU Help https://t.co/7aByzTzlPV — Breitbart London (@BreitbartLondon) September 30, 2019\n\nFollow Jack Montgomery on Twitter: @JackBMontgomery", "description": "Anti-Brexit MPs are plotting to install Speaker John Bercow as prime minister of a so-called \"unity\" government \"of all the talents\".", "authors": ["Jack Montgomery"], "top_image": "https://media.breitbart.com/media/2019/01/Bercow.png", "published_at": "2019-10-07"}