{"pub": "cnn", "url": "https://cnn.com/2019/10/14/politics/trump-biden-business-conflicts/index.html", "downloaded_at": "2019-10-15 15:17:33.171868+00:00", "title": "Trump's focus on Biden also highlights his own questionable business arrangements", "language": "en", "text": "Washington (CNN) President Donald Trump has spent the last few weeks holding up former Vice President Joe Biden as the poster child of political corruption, relentlessly harping on discredited allegations that Biden abused his powers to protect his son's business interests.\n\nBut by highlighting the dangers of blending business opportunities with political power, Trump has resurrected an issue that has dogged his own family from the start of his campaign.\n\nThese headaches for Biden could have been avoided if his son, Hunter Biden, simply did not conduct foreign business while his father was the sitting vice president. It's more an issue of potential greed and poor judgment than corruption. There is no evidence that any of his activities were illegal, despite Trump's recent tweet saying, \"there is NO WAY these can be legitimate transactions.\"\n\nHunter Biden announced on Sunday that he would resign from the board of a Chinese-backed company and pledged that he would not do business with any foreign-owned companies if his father is elected in 2020. This plan, if Hunter Biden sticks to it, offers a much cleaner break from foreign business entanglements than Trump's family has pursued during his first term in office.\n\nIt looks like Trump's family has done some of the same things that he now says create a conflict of interest for Biden, primarily making money oversees with a parent in the White House.\n\nThe President's sons, Donald Trump Jr. and Eric Trump, have continued to run the Trump Organization, including work on overseas deals. Trump never divested his stake of the company, so he stands to benefit financially from any foreign projects his sons are handling.\n\nSince taking office, Trump's company has raked in millions of dollars from foreign deals, and he holds more than $130 million in foreign assets, according to the Center for Responsive Politics\n\nWhen Trump took office, he promised his company wouldn't pursue any new foreign deals. After all, a centerpiece of his campaign was attacking Democratic nominee Hillary Clinton for her financial ties to foreign governments, in the form of paid speeches and donations to her family's charity.\n\nBut that commitment hasn't stopped Trump's family from plowing ahead on projects in India, Indonesia, Uruguay and the Philippines that were already in the works before his swearing-in.\n\n\"My father's not at all involved, and he wouldn't make decisions that affect a country based on a real estate deal, let's just be very, very clear about that,\" Trump Jr. said in Indonesia this year.\n\nWhile promoting these grandfathered-in projects, Trump's sons may have blurred the lines.\n\nTrump hosted Indian Prime Minister Narendra Modi at the White House and has tried to forge a close relationship. Trump heaped praise on Modi after his sweeping reelection victory this year, saying, \"he is a great man and leader for the people of India - they are lucky to have him!\"\n\nMeanwhile, Trump Jr. visited India last year to promote an apartment development, and his trip spurred millions of dollars in sales. Ethics watchdogs cried foul when advertisements near New Delhi appeared to sell access to Trump Jr. He was also forced to abruptly adjust plans for a speech that would touch on political topics at a conference where Modi was also speaking.\n\nDuring the trip, Trump Jr. acknowledged the challenge of fully separate business and politics, \"because I believe in what my father's doing, and he is certainly up against a lot of adversity.\"\n\nA Trump Organization spokesman did not answer emails seeking comment. Trump campaign spokesman Tim Murtaugh said, \"The Trumps were successful before Donald Trump became President. Hunter Biden owes his success to his father's public office. There is no comparison.\"\n\nA more glaring potential conflict exists within the White House. Trump did something that Biden never did: He gave White House jobs to his daughter Ivanka and son-in-law Jared Kushner.\n\nJUST WATCHED Biden calls for Trump impeachment for first time Replay More Videos ... MUST WATCH Biden calls for Trump impeachment for first time 02:40\n\nLast year, China approved more than a dozen trademarks for Ivanka-branded products. The approval came around the same time the US and China were trying to jump-start trade talks, raising the possibility that the Chinese were trying to curry favor with Trump at a key moment.\n\nThe president of Ivanka Trump's fashion line previously said these approvals were part of \"the normal course of business\" to protect her brand. Murtaugh, the Trump campaign spokesman, said Monday that dozens of Chinese companies tried to trademark Ivanka's name after her father took office in 2017, and any comparison between her and Hunter Biden are \"ludicrous.\"\n\nAccording to The Washington Post , foreign countries have privately plotted how to manipulate Kushner because of his business entanglements, as he has refused to divest form his family's vast holdings. During the Russia investigation, special counsel prosecutors asked witnesses about Kushner's overseas business dealings, though he was never accused of wrongdoing.\n\nThe President has co-mingled business with politics, holding countless political events and fundraisers at his properties. He went so far as to say he might hold the next G7 meeting at one of his golf resorts in Florida, putting a Trump property center stage for a major diplomatic event.\n\nOver the years, the boundaries between Trump's business empire and his political apparatus have become less and less clear. Before taking office, Trump very publicly handed the reins of his company to his sons, suggesting that they would focus on business. But they've emerged as political surrogates, stumping for their father and Republican candidates across the country.\n\nSometimes the politics spills into official business events. Eric Trump, appearing at the Yahoo Finance summit last week in his capacity as a Trump Organization executive, brought up the Ukraine controversy and said Hunter Biden's business arrangements there appeared \"fishy.\"\n\nDespite their own overlapping affairs, and ongoing ethics concerns, the Trump family has drawn a hard line when it comes to Biden and have continued to hammer him on a near-daily basis.", "description": "President Donald Trump has spent the last few weeks holding up former Vice President Joe Biden as the poster child of political corruption, relentlessly harping on discredited allegations that Biden abused his powers to protect his son's business interests.", "authors": ["Marshall Cohen"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190611155503-donald-trump-joe-biden-split-super-tease.jpg", "published_at": "2019-10-14"}