{"pub": "foxnews", "url": "https://foxnews.com/media/hillary-clinton-democrats-infuriating-in-their-efforts-to-cast-doubt-on-legitimacy-of-president-trump-lisa-boothe-says", "downloaded_at": "2019-10-01 04:29:41.789290+00:00", "title": "Hillary Clinton, Democrats 'infuriating' in their efforts to 'cast doubt on legitimacy of President Trump,' Lisa Boothe says", "language": "en", "text": "It is Democrats, not President Trump, who are threatening American institutions and the electoral process, according to Fox News contributor Lisa Boothe.\n\nBoothe rejected new remarks about the current president from Hillary Clinton, in an interview Monday on \"Tucker Carlson Tonight.\"\n\nSpeaking with CBS News, Clinton referred to Trump as a \"corrupt human tornado\" and said the New York Republican inherently knows he is an \"illegitimate\" president.\n\n\"He knows that there were a bunch of different reasons that the election turned out the way it did,\" Clinton said.\n\nRNC CHAIRWOMAN RONNA MCDANIEL HAS TOUGH 2020 MESSAGE FOR DEMS\n\nBoothe ripped Clinton's remarks both there and in a 2016 tweet, in which the former secretary of state wrote, \"Donald Trump refused to say that he'd respect the results of this election. By doing that he's threatening our democracy.\"\n\n\"What I find infuriating about what she said there -- Democrats are the ones who are threatening our democracy by casting doubt on the legitimacy of President Trump,\" she said.\n\n\"They are the ones who are undermining our faith in institutions, particularly the electoral process.\"\n\nHost Tucker Carlson agreed, remarking that Clinton appears to be \"trapped in emotional amber\" from Election Day 2016.\n\n\"Every day is November 8,\" he said.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nIn addition, Boothe said Democrats are eroding democratic norms through lawmakers who boycotted Trump's 2017 inauguration and, \"lied about the Russian collusion narrative.\"\n\nClinton, who ran against Trump in 2016, added that she supports the House of Representatives' newly launched impeachment inquiry.\n\n\"My view is that, given the latest revelation, which is such a blatant effort to use his presidential position to advance his personal and political interests, there should be an impeachment inquiry opened,\" Clinton told CBS News. \"And I think, sadly, there are a number of grounds. But this one is incredibly troubling.\"\n\nShe was referring to the dust-up over a July call between Trump and his counterpart in Ukraine, in which he asked for an inquiry into onetime Vice President Joe Biden, Biden's son Hunter, and their dealings there.\n\nFox News' Joseph Wulfsohn contributed to this report.", "description": "It is Democrats, not President Trump, who are threatening American institutions and the electoral process, according to Fox News contributor Lisa Boothe.", "authors": ["Charles Creitz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Carlson-Boothe.jpg", "published_at": "2019-10-01"}