{"pub": "yahoo", "url": "https://news.yahoo.com/meghan-markle-just-wore-perfect-153039688.html", "downloaded_at": "2019-09-25 23:38:51.049849+00:00", "title": "Meghan Markle just wore the 'perfect work shirt' and it's super affordable", "language": "en", "text": "Just because Meghan Markle is English royalty doesn't mean she always breaks the bank when it comes to her wardrobe.\n\nWhile out and about on her royal tour around South Africa, the duchess has been sporting a slew of affordable brands like these Sam Edelman Flats and this Madewell Denim Jacket.\n\nSEE ALSO: You need to buy Meghan Markle's $120 shoes before everybody else does\n\nWhile in Cape Town, Meghan visited Monwabisi Beach with Prince Harry, where they learned about the work of ‘Waves for Change.’ For the casual occasion, she sported black jeans and layered a relaxed denim jacket over a crisp J.Crew button down.\n\nThe perfect white blouse is currently marked down 30% on Nordstrom and has the most incredible reviews!\n\n\"Very versatile! I wore it three times the same week I received it. I’m 5’0” and 103lbs and ordered 0P and it fit me well. The length is perfect for (French) tucking or leaving out for a more casual look. I’ve washed it once thus far and it washes well. Definitely needs ironing to maintain that crisp fresh look.\"\n\n\"Just enough stretch to make it work, but not so much that it doesn't feel tailored. Perfect work shirt; soft and crisp.\"\n\n\n\nJ. Crew Slim Perfect Shirt, $48.65 (Orig. $69.50)", "description": "Just because Meghan Markle is English royalty doesn't mean she always breaks the bank when it comes to her wardrobe.", "authors": ["Laura Galvan"], "top_image": "https://s.yimg.com/uu/api/res/1.2/NvUmEqLeOpZgazhHOZKVpQ--~B/aD02NzU7dz0xMDI4O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://o.aolcdn.com/images/dims3/GLOB/crop/3250x2133+181+415/resize/1028x675!/format/jpg/quality/85/https://s.yimg.com/os/creatr-images/2019-09/803e4d90-dfa7-11e9-af7b-8db4ade53152", "published_at": "2019-09-25"}