{"pub": "fox", "url": "https://foxnews.com/opinion/pelosi-trump-impeachment-house-vote-deroy-murdock", "downloaded_at": "2019-10-20 00:10:42.413640+00:00", "title": "Deroy Murdock: Pelosi's Trump impeachment express – Let entire House vote on whether US should go on this road", "language": "en", "text": "Nancy Pelosi is right.\n\n“This is deadly serious,” the House speaker said Tuesday, regarding impeachment proceedings against President Donald Trump. Too bad Pelosi is handling this solemn matter with staggering unseriousness.\n\nAs the Impeachment Express accelerates, the Democratically-controlled House is hell-bent on removing America’s duly elected president of the United States. This is among the gravest contingencies in this constitutional republic.\n\nGABBARD DARES CLINTON TO RUN FOR PRESIDENT IN 2020, FIGHTS BACK AGAINST ASSERTIONS THAT SHE IS A RUSSIAN ASSET\n\nOn something so momentous, the House should operate once again on a bipartisan basis:\n\nBefore President Bill Clinton was impeached, the House voted on October 8, 1998. The tally was 258–176 to advance an impeachment probe, with 31 Democrats resisting their party leaders.\n\nAt the depths of Watergate, on February 4, 1974, the House voted 410–4 — on a nearly unanimous, bipartisan basis — to launch the impeachment of President Richard Milhous Nixon. He resigned that August 9, before the House adopted articles of impeachment, but after the emergence of severely incriminating evidence of his illegality. (What a concept!)\n\nThe House also voted 126–47 to commence the impeachment of President Andrew Johnson on February 24, 1868.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nPelosi, a San Francisco Democrat, hurled these precedents off the Golden Gate Bridge.\n\n“There’s no requirement that we have a vote,” she declared Tuesday. “So, at this time, we will not be having a vote.”\n\nCLICK HERE TO CONTINUE READING DEROY MURDOCK'S COLUMN IN THE NATIONAL REVIEW.", "description": "As the Impeachment Express accelerates, the Democratically-controlled House is hell-bent on removing America’s duly elected president of the United States. This is among the gravest contingencies in this constitutional republic.", "authors": ["Deroy Murdock"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/17/694940094001_6095708300001_6095704976001-vs.jpg", "published_at": "2019-10-19"}