{"pub": "huffpost", "url": "https://huffpost.com/entry/walter-shaub-donald-trump-democracy-dangerous-territory_n_5db3eb46e4b079eb95a3e62b", "downloaded_at": "2019-10-26 07:46:11.040821+00:00", "title": "Ex-Ethics Chief Issues Ominous Warning About 'Anti-Patriots' Backing Donald Trump", "language": "en", "text": "The former head of the U.S. Office of Government Ethics on Friday used a lengthy Twitter thread to warn about the people in positions of power who continue to defend President Donald Trump’s “indefensible” actions.\n\n“Rather than risking a short-term political defeat, these anti-patriots wage war on democracy itself,” wrote Walter Shaub in the first of 11 tweets. “We are in dangerous territory.”\n\nShaub, who served under former President Barack Obama and the first six months of the Trump administration before he quit, listed a slew of examples of Trump’s alleged ethics violations to back up his claim.\n\n“The list is longer than could fit in a Twitter thread. But this is enough to make one thing clear: Democracy cannot withstand this punishing assault much longer,” he concluded. “Shame on those who defend Trump’s misdeeds to protect their political careers. At stake is the republic itself.”\n\nCheck out the full thread below:\n\nPeople in positions of power defending Trump are focused on process instead of substance because they know his actions are indefensible. Rather than risking a short-term political defeat, these anti-patriots wage war on democracy itself. We are in dangerous territory. /1 — Walter Shaub (@waltshaub) October 25, 2019\n\nTrump solicited foreign attacks on our elections from multiple countries.\n\n\n\nTrump extorted a desperate ally, demanding a quid pro quo — an investigation of his political rival in exchange for releasing congressionally mandated aid to fend off Russian aggression. /2 — Walter Shaub (@waltshaub) October 25, 2019\n\nTrump fired the Attorney General for refusing to stop an investigation of him.\n\n\n\nTrump’s new AG misled the public about the results of that investigation and is criminally investigating the investigators.\n\n\n\nTrump admitted he fired FBI's Director because of the same investigation./3 — Walter Shaub (@waltshaub) October 25, 2019\n\nTrump politicized employment actions involving career officials connected to the investigation.\n\n\n\nHe and his congressional allies are seeking vengeance on whistleblowers. /4 — Walter Shaub (@waltshaub) October 25, 2019\n\nTrump’s congressional allies advance conspiracy theories about a non-existent “secret society” and \"deep state\" to provide him further cover.\n\n\n\nThey have turned the Capitol into an Animal House fraternity, disrupting impeachment investigation in a SCIF for a pizza party. /5 — Walter Shaub (@waltshaub) October 25, 2019\n\nTrump violated procurement law by awarding himself a contract to host the G7, violated disclosure laws and likely the false statements law to hide a hush money payoff, and spent over a $100 million to promote his properties by visiting them on 1/3 of his days in office. /6 — Walter Shaub (@waltshaub) October 25, 2019\n\nTrump engaged in a cover-up to protect his customer, the Saudi govt, after it murdered a Washington Post journalist.\n\n\n\nTrump repeatedly attacks freedom of the press and is now ordering govt agencies to cancel subscriptions of our 2 top newspapers for partisan political reasons. /7 — Walter Shaub (@waltshaub) October 25, 2019\n\nTrump betrayed allies and used language consistent with ethnic cleansing, giving the country that helped him win the election dominance in part of the middle east.\n\n\n\nTrump has lent legitimacy to the world’s dictators and damaged relations with key allies who oppose them. /8 — Walter Shaub (@waltshaub) October 25, 2019\n\nTrump has violated human rights by separating families and putting children in cages, while making statements that embolden and legitimize hate groups, just to boost his standing with his hate-fueled base. /9 — Walter Shaub (@waltshaub) October 25, 2019\n\nTrump has committed nepotism in the White House—and there are serious concerns about an overlap in business dealings of his son-in-law’s family with admin policy in the middle east, as well as concerns about national security due to the son-in-law's access to classified info. /10 — Walter Shaub (@waltshaub) October 25, 2019\n\nThe list is longer than could fit in a Twitter thread. But this is enough to make one thing clear: Democracy cannot withstand this punishing assault much longer. Shame on those who defend Trump's misdeeds to protect their political careers. At stake is the republic itself.\n\n\n\n/11 — Walter Shaub (@waltshaub) October 25, 2019", "description": "“We are in dangerous territory,\" Walter Shaub cautioned in a lengthy Twitter thread.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5db3f235200000cc27506d60.jpeg?cache=8wcosvjd20&ops=1778_1000", "published_at": "2019-10-26"}