{"pub": "fox", "url": "https://foxnews.com/entertainment/dog-the-bounty-hunter-diagnosed-pulmonary-embolism", "downloaded_at": "2019-09-28 02:05:21.483644+00:00", "title": "Dog the Bounty Hunter diagnosed with pulmonary embolism", "language": "en", "text": "Duane “Dog the Bounty Hunter” Chapman revealed that he recently suffered from a pulmonary embolism in the heart.\n\nIn a preview clip of his upcoming \"Dr. Oz\" appearance on Monday, the 66-year-old reality star said that he learned he had the \"life-threatening\" condition -- in which \"clots block blood flow\" -- two weeks after being hospitalized for chest pains, according to People.\n\n“You’re a ticking time bomb,” Dr. Mehmet Oz told Chapman in the video obtained by the outlet. “You’re not going to be here with the heart the way it is right now. Fear of death is normal. I’m surprised you don’t fear death when you’re chasing after convicts. But when you run away from doctor, that means you have to do your own doctoring.”\n\nDOG THE BOUNTY HUNTER SAYS 'BROKEN HEART' LED TO HIS RECENT HOSPITALIZATION\n\nFollowing Chapman's diagnosis, Dr. Oz spoke to the magazine, explaining that the TV personality -- who lost his wife, Beth Chapman, in June after a two-year battle with throat cancer -- was “denying care that he knew would be life-saving.”\n\n“[Duane] was fearful,” Dr. Oz said. “Beth had been his north star. She was the one that would go with him and keep him balanced so he could deal with these things. Losing her took away his biggest support.”\n\nDOG THE BOUNTY HUNTER SUFFERS HEART EMERGENCY: REPORT\n\nHe continued: “I said, ‘What would Beth do. What would she say to you? I don’t think she’d be happy with what you’re doing. You’re throwing away your life, you’re throwing away your ability to parent your kids. You have to man up.’ That’s what she would say.”\n\nChapman admitted that initially he \"hesitated for a minute\" but eventually agreed to receive care.\n\nDOG THE BOUNTY HUNTER HONORS HIS LATE WIFE BETH IN NEW SHOW: 'SHE'S STILL HERE WITH ME'\n\n“I hesitated for a minute thinking, I don’t want to have to go through this again,” Chapman said. “I don’t want to die right now. I’m not afraid to die anymore, but I really didn’t care for awhile if something would happen. I do care now.”\n\nAccording to People, Chapman is now on blood thinners, maintains a healthy diet and is working on kicking his smoking habit.\n\n“Once this goes away, I am 100 percent,\" Chapman said. \"I’ve had fears. The blood clot is not a normal thing but it happens a lot, but I’m going to be 100 percent. I’m encouraged by it.\"\n\nGET THE FOX NEWS APP\n\nThe Chapmans starred in the A&E show for eight seasons until it was canceled in 2012. The show followed the couple as they apprehended people who avoided arrest warrants.\n\nThey later starred in Country Music Television's \"Dog & Beth: On the Hunt.\" WGN America is in production on a new series featuring the couple called \"Dog's Most Wanted,\" which premiered on Sept. 4.\n\nThe Associated Press contributed to this report", "description": "Duane “Dog the Bounty Hunter” Chapman revealed that he recently suffered from a pulmonary embolism in the heart.", "authors": ["Mariah Haas"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/dog-duane-chapman.jpg", "published_at": "2019-09-27"}