{"pub": "investingcom", "url": "https://ca.investing.com/news/stock-market-news/press-digestbritish-business--sept-23-1973024", "downloaded_at": "2019-09-23 01:34:08.081614+00:00", "title": "PRESS DIGEST-British Business - Sept 23", "language": "en", "text": "© Reuters. PRESS DIGEST-British Business - Sept 23\n\nSept 23 (Reuters) - The following are the top stories on the business pages of British newspapers. Reuters has not verified these stories and does not vouch for their accuracy.\n\nThe Times\n\n- Standard Chartered Plc is locked in \"very difficult\" conversations with its leading shareholders over its chief executive's pay after an investor revolt over his pension. Amazon.com Inc is secretly building a team of senior British property experts amid speculation that the online retailer is preparing for another assault on supermarkets. Guardian\n\n- One of Northern Ireland's biggest employers faces a crunch week as Wrightbus, which employs 1,400 staff, attempts to stave off collapse by securing a last-minute rescue deal. Brewing firm Budweiser is to phase out single-use plastic pack rings from its entire range of UK-produced beer, which include the bestselling brands Stella Artois, Budweiser and Bud Light, by the end of 2020. Telegraph\n\n- The Bank for International Settlements said the high-risk loans have climbed to $1.4 trillion and are increasingly being sliced and diced much like subprime mortgage debt before 2007. Property tycoon Robert Tchenguiz has added 250 million stg to his comeback war chest after selling the NHS's HQ in Leeds, part of a wider plan to top up his coffers following the end of a lengthy legal saga. News\n\n- Thomas Cook Group Plc , Britain's oldest travel agent, was close to collapsing on Sunday night as last-ditch rescue talks looked like ending in catastrophic failure. KPMG is being lined up to oversee the insolvency of Thomas Cook's UK tour operating business. British foreign secretary Dominic Raab insisted that Thomas Cook passengers will not be stranded overseas if the company collapses into administration.", "description": "PRESS DIGEST-British Business - Sept 23", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEA601YK_L.jpg", "published_at": "2019-09-23"}