{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7580317/Middle-aged-people-complaining-kids-days-actually-just-pick-flaws.html", "downloaded_at": "2019-10-16 21:32:45.989287+00:00", "title": "Middle-aged people complaining about 'kids these days' actually just pick out flaws", "language": "en", "text": "Older people being sick of the 'kids of today' are under an illusion which actually reflects their own personality, scientists claim.\n\nIn middle age people may actually have expectations set particularly high for something they themselves are good at.\n\nAnd when a young person isn't as good as they were, they consider it a damning indictment of the modern youth, the researchers said.\n\nAdults who were surveyed believed younger generations didn't have as much respect for them (stock image of a mother and daughter)\n\nResearch by cognitive scientist and intelligence researcher John Protzko revealed that Americans who have become highly skilled at something don’t notice when their peers are practising the same skill to a lesser level.\n\nBut they do notice it in younger people.\n\nAs a result, for example, strict older people are more likely to believe that younger generations are less respectful to their elders, the research found.\n\nMr Protzko, who is based in California, said this suggests that observations about the so-called deficiencies of today’s youth – which repeat themselves through generations – are actually an illusion.\n\nPast research has failed to tap into why many adults shake their heads and often utter the words ‘kids these days’.\n\nBut Mr Protzko’s research has shed light on this, suggesting complaints about young people in the past may have been inaccurate.\n\nTo study the ways in which younger generations treat their elders and how intelligence is appreciated across social groups, Mr Protzko sampled adults aged 33-51.\n\nA total of 1,842 adults who were matched with authoritarian traits were asked how much they believed children respected their elders today, in comparison to when they were young.\n\nIt was found that adults with a higher level of education thought that children respected their elders less\n\nIt was found that those holding higher levels of education believed children respected their elders less.\n\nIn a separate study, researchers also measure 134 participants, using an eight-item vocabulary test.\n\nThose who measured as having the highest intelligence thought children today were becoming less intelligent, while the trait of authoritarianism was unrelated to this belief.\n\nA third study administered the Author Recognition Test to a new sample of 1500 adults.\n\nThis found that the more well-read the adults in the sample were, the more they thought children no longer enjoyed reading.\n\nIt was also found that by manipulating participants’ perceptions of their performance on a test they were able to change how well-read they thought they were.", "description": "Research by intelligence researcher John Protzko revealed that Americans who have become highly skilled at something don't notice when their peers are practicing the same skill to a lesser level.", "authors": ["Terri-Ann Williams For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/16/19795292-0-image-a-5_1571240808499.jpg", "published_at": "2019-10-16"}