{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7553911/The-Bachelorette-Ciarran-makes-sexual-remark-Angie-Kent.html", "downloaded_at": "2019-10-10 00:13:45.993550+00:00", "title": "The Bachelorette: Ciarran makes a sexual remark about Angie Kent", "language": "en", "text": "The Bachelorette's Angie Kent finally met her eligible suitors on the show's premiere episode on Wednesday night.\n\nBut a first encounter with one of the singletons almost ended in disaster, when suitor Ciarran accidentally made a very X-rated remark about Angie.\n\nThe ex-Army rifleman inadvertently made a racy comment that sounded sexual towards the Gogglebox star.\n\nAwkward! While speaking about Angie during his piece-to-camera, ex-army rifleman Ciarran (pictured) accidentally made a remark that sounded disrespectful but it wasn't meant to be\n\nCiarran, who prides himself on looking good, revealed that he has a very specific beauty regime that he likes to undertake to make himself look and feel great.\n\n'I do like to look good all the time. Personal grooming and hygiene to me is very important. So, I've got a bit of a beauty regime that I like to do,' he said.\n\nAfter meeting with the blonde beauty on the red carpet, Ciarran, who originates from Manchester in the UK, made the gaffe while complimenting her good looks.\n\nLooking good! Ciarran (pictured), who prides himself on looking good, revealed that he has a very specific beauty regime that he likes to undertake to make himself look and feel great\n\nOops! After meeting with the blonde beauty on the red carpet, Ciarran (pictured), who originates from Manchester in the UK, made the gaffe while complimenting her good looks\n\n'Angie's definitely my kind of woman. Looks like she looks after herself as well, so I like it. I hope Angie's up for a mani/pedi date or a day spa,' he began.\n\nHe went on to say, 'Hopefully, I can give her a facial myself,' before he stopped and put his hands over his mouth with a shocked expression on his face.\n\n'Oh. Wait, no, no, not like that. One of my... you know, my beauty regime facial, that's what I meant. You know what I'm talking about. That come out wrong,' he added.\n\nFirst impressions! Despite the embarrassing gaffe, Ciarran, who arrived wearing a bright red velvet suit, still managed to impress Angie (left), with her telling him: 'You look nice!'\n\nSo cheeky! Ciarran (right) told Angie (left): 'I felt like a bit of a sexual Willy Wonka, to be fair'\n\n'Did they have to include that?' Fans expressed their shock over the 'facial joke' on Twitter\n\nDespite the embarrassing gaffe, Ciarran, who arrived wearing a bright red velvet suit, still managed to impress Angie, with her telling him: 'You look nice!'\n\n'Oh, thanks, just wore a bit of red velvet for you,' Ciarran quipped, before adding: 'You're absolutely gorgeous. I felt like a bit of a sexual Willy Wonka, to be fair.'\n\nIn her piece-to-camera, Angie later said that despite him being cocky, she didn't totally hate it because he made her laugh.\n\nHe was later given a rose at the first rose ceremony.\n\nThe Bachelorette returns on Thursday from 7.30pm on Channel 10", "description": "A first encounter with one of her singletons almost ended in disaster, when suitor Ciarran accidentally made a very x-rated remark about Angie Kent.", "authors": ["Mark Brook For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/11/19486198-0-image-a-9_1570617155293.jpg", "published_at": "2019-10-09"}