{"pub": "usatoday", "url": "https://usatoday.com/story/opinion/2019/10/07/democrats-trying-impeach-president-donald-trump-abuse-power-editorials-debates/3903959002", "downloaded_at": "2019-10-07 23:35:16.093497+00:00", "title": "Democrats trying to impeach President Trump are misusing their authority: Rep. Jim Jordan", "language": "en", "text": "Inquiry is shrouded in secrecy. Americans deserve more: Opposing view\n\nDemocrats are trying to impeach President Donald Trump just 13 months before the American people go to the polls. They are doing it because they know they can’t remove President Trump otherwise.\n\nIt’s not for lack of trying.\n\nDemocrats put the nation through three years of the “Russia collusion” hoax, only for those allegations to completely unravel. Democrats have spent the past 10 months embarking on a series of partisan fishing expeditions, all in a concerted effort to take down a duly elected president. Now Democrats are accusing President Trump of orchestrating a quid pro quo to pressure the Ukrainian government.\n\nHere’s the problem: Democrats are basing these latest allegations on a whistleblower complaint full of secondhand, hearsay information about a call with the Ukrainian president. The whistleblower was not on the call. A call transcript, released by President Trump, shows no quid pro quo of any kind. And as for the allegation of pressure, Ukrainian President Volodymyr Zelensky said, “Nobody pushed me.”\n\nWhen we began to interview people with firsthand knowledge, the Democrats’ narrative fell apart. Ambassador Kurt Volker, the U.S. special envoy to Ukraine, was very clear in his testimony last week: He was aware of no quid pro quo, and the Ukrainian government never raised concerns about a quid pro quo. He testified that the U.S. officials were working at all times in the best interests of the United States and for the success and security of Ukraine.\n\nBut Americans won’t hear these facts from Democrats. Democrats have already prejudged the case, and now they need to deliver for the left-wing special interests hellbent on impeaching President Trump.\n\nOUR VIEW: Ukraine evidence piles up on Trump trading arms for dirt on the Bidens\n\nPresident Donald Trump greets Rep. Jim Jordan, R-Ohio on Aug. 4, 2018, in Lewis Center, Ohio. (Photo: John Minchillo/AP)\n\nThat’s why House Intelligence Committee Chairman Adam Schiff publicly misrepresented the contents of the call between President Trump and President Zelensky.\n\nThat’s why Schiff hid the fact that his committee staff had been contacted by the whistleblower this past summer.\n\nAnd that’s why Schiff released selective text messages from Ambassador Volker without the important context that Ambassador Volker offered in his testimony.\n\nPresident Trump displayed unprecedented transparency by releasing a transcript of his call with a foreign leader. However, the Democrats’ impeachment push is shrouded in secrecy. Americans deserve more. Americans deserve to know exactly how Democrats are misusing their authority to undo the results of the 2016 election.\n\nRep. Jim Jordan, R-Ohio, serves on the House Oversight and Judiciary committees.\n\nIf you can't see this reader poll, please refresh your page.\n\nRead or Share this story: https://www.usatoday.com/story/opinion/2019/10/07/democrats-trying-impeach-president-donald-trump-abuse-power-editorials-debates/3903959002/", "description": "President Trump displayed transparency by releasing a transcript of his phone call. Democrats' inquiry is shrouded in secrecy, writes Rep. Jim Jordan", "authors": ["Jim Jordan", "Opinion Contributor", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/07/USAT/5e9924bd-cd4a-43de-b5e9-cb6133b5d24f-impeachment.oppose.jpg?crop=3693,2077,x0,y174&width=3200&height=1680&fit=bounds", "published_at": "2019-10-07"}