{"pub": "yahoo", "url": "https://sports.yahoo.com/nfl-rumors-patriots-bring-two-204643392.html", "downloaded_at": "2019-10-25 23:51:46.069461+00:00", "title": "NFL Rumors: Patriots bring in two running backs for workout", "language": "en", "text": "The New England Patriots have an open roster spot on their practice squad, and they worked out two running backs on Friday.\n\nThe Patriots tried out Elijah McGuire and Austin Walter, according to ESPN's Mike Reiss.\n\nScroll to continue with content Ad\n\nThe Patriots had RBs Elijah McGuire (Louisiana-Lafayette/Jets/Browns) and Austin Walter (Rice/49ers/Giants) in for tryouts today. The team has an opening on its practice squad, and is always updating emergency lists. — Mike Reiss (@MikeReiss) October 25, 2019\n\nMcGuire has spent his short two-year career with the New York Jets, playing 24 games and rushing for 591 yards and four touchdowns. Following his tenure with the Jets, he was signed to the Cleveland Browns practice squad before being released Thursday. Walter on the other hand, has yet to play an NFL game and has spent time with both the San Francisco 49ers and New York Giants following his college career at Rice.\n\nThe Patriots could always use a little depth at the runningbacks position, especially with Rex Burkhead dealing with a foot injury.\n\nClick here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device.\n\nNFL Rumors: Patriots bring in two running backs for workout originally appeared on NBC Sports Boston", "description": "The New England Patriots worked out two running backs Friday.", "authors": ["Nbc Sports Boston Staff"], "top_image": "https://s.yimg.com/ny/api/res/1.2/rDsbgmWRHa8mGsYzhH44zw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjAuNzQzNjkxODk5MDcwNA--/https://s.yimg.com/uu/api/res/1.2/n3rV3bhE7XBe6tiNcBmXMA--~B/aD00MjQ7dz03NTM7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/csnne.com/678b1a85c6a42b92a83d6d2c726a793c", "published_at": "2019-10-25"}