{"pub": "theverge", "url": "https://theverge.com/2019/7/12/20691740/nasa-administrator-jim-bridenstine-bill-gerstenmaier-reassignment", "downloaded_at": "2019-10-05 13:37:25.782933+00:00", "title": "NASA administrator on recent personnel shakeup: ‘There’s no turmoil at all’", "language": "en", "text": "It’s been a week of major change for NASA after the top two leaders of the agency’s human exploration program were suddenly reassigned without much warning. It was a shocking personnel shakeup, coming just months after NASA was challenged to send humans back to the Moon by 2024. It’s led many to suspect that NASA’s Moon initiative may not be running all that smoothly — or that the White House has gotten involved.\n\nThe Verge spoke with NASA administrator Jim Bridenstine to better understand why these changes were made and what this means for the future of NASA’s lunar initiative, dubbed Artemis. Bridenstine explained that the Artemis program is still very much intact, but in the months to come, we will be seeing more of an emphasis on how NASA plans to use Artemis to get to Mars in the future.\n\nThis interview has been lightly edited for clarity.\n\nI think this decision took a lot of people by surprise. Can you say exactly where the decision came from? Did it come from you, or did it come from the White House?\n\nFrom me. It came exclusively from me. Bill Gerstenmaier has been an amazing leader of the Human Exploration and Operations (HEO) Mission Directorate for a long time, and we love him. We love the work he’s done, and we’re grateful for his service to NASA and to the country.\n\nBut I think we’re at a time when we need new leadership, and I made the decision that we were going to reassign him and have new leadership in HEO.\n\nI read today in The New York Times that you did speak with Trump recently about the Moon and Mars, so I just want to confirm that this decision did not come up during that meeting or with anyone at the White House.\n\nNot at all. Not once.\n\nCan you elaborate a bit more on your meeting with Trump and what you talked about?\n\nIt was very brief. I had seen him in the media talk about Mars a lot, and I just reached out and wanted to make sure that we were in alignment. We want to talk about Mars, and certainly, we want to go to the Moon to get to Mars because that’s the path.\n\n“I think we’re at a time when we need new leadership.”\n\nAnd he said, “Absolutely. You got to go to the Moon to get to Mars because I certainly understand that.” He also says he wants us to talk about Mars. He said that’s the generational thing that will inspire the nation, and he says, “So keep talking about Mars.” And so that’s what we’re doing.\n\nThe plans have not changed. We’re going to the Moon, and we’re heading off to Mars.\n\nCan you give a little more insight into the explanation for the personnel change? What prompted it now exactly?\n\nWe are focused on making sure we can land the next man and the first woman on the south pole of the Moon in 2024. That means that, as an agency, we have to be focused on cost and schedule. We have had a history of meeting cost and schedule milestones, and we’re moving in a different direction to make sure that we’re being responsive to a lot of the [Government Accountability Office (GAO)] reports and [Inspector General] reports that have indicated that we have been, in the past, unrealistic in our cost and schedule estimates. And we need to build more realism into the cost and schedule of our programs and then, of course, make sure that we are meeting those milestones.\n\nSo was this prompted by the most recent GAO report that came out regarding the Space Launch System (SLS)?\n\nThere’s not a single one of them. We need to make sure that cost and schedule are accurate because we’re moving to the Moon by 2024.\n\nHow do you think changing the leadership will ensure that the costs and schedules are met? Do you think this is going to have a positive effect on employees? What are you hoping these changes bring about?\n\nThe positions that are open right now: Human Exploration and Operations has an associate administrator position that is the head of the human spaceflight elements of NASA. And then under that leader, there’s another position that we call Exploration Systems Development. That’s the division where SLS and Orion are, so that position is now open as well. We’re going to have a new leader that will be in charge of the Gateway and the lunar lander. And we’re looking to create a new position for a division that we call Moon to Mars because when we think about the Gateway and the lunar lander, those are capabilities that we want to be able to replicate at Mars. So we’re calling that new division Moon to Mars, and it will be within Human Exploration and Operations.\n\nAnd, of course, we need to make sure that we’re informing the appropriations committees in the House and the Senate before making those moves. And we’re going to do that, but we’re looking for that second deputy that can be focused on the Gateway and the lunar lander. So the three top positions within HEO are now open. And we’re doing a nationwide search for the best talent across the country.\n\n“it could be two women on the Moon in 2024. It doesn’t have to be necessarily the next man.”\n\nWe’re going to let those leaders come in and make sure that we can re-baseline some of our projects and programs to include SLS and Orion, and Commercial Crew. Re-baseline those programs and then have those leaders buy in on what the commitments are, and then hold people accountable for achieving those commitments, so that we can achieve our end state, which is the next man and the first woman on the south pole of the Moon in 2024.\n\nDoes that mean...\n\nAnd by the way, it could be two women on the Moon in 2024. It doesn’t have to be necessarily the next man.\n\nOh, great. Yeah, I’ve been wondering about that because we keep hearing about one man and one woman. So it could be two women?\n\nSure!\n\nSo given all of these changes, does that mean that we can expect some large structural changes to the Artemis architecture moving forward?\n\nNo, not for the Artemis architecture. All of the elements are in place. We’ve got SLS and Orion. We’re going to build the Gateway, and we’re going to build a lander, and that architecture is not changing.\n\nI’m wondering what “re-baselining” means exactly. Can you point to anything specific that you would like to see change under this new leadership?\n\nWe need new dates for SLS, for example. I mean, I’ve been very public about the challenges that we’ve had with the SLS program. We know that we’re not going to make a June 2020 launch at this point. What we haven’t done at this point is set a new date, and I’d like to bring in somebody new that can buy in and help us make certain that whatever date we select next is realistic, achievable, and that we can move toward that new date.\n\nSo SLS is an example, but also Commercial Crew is going to have to be re-baselined. So when I say re-baselined, I mean rescheduled. People have seen that the Crew Dragon blew up during a test of the Super Draco engines that are used during launch abort should one occur. We’re going to have to come up with new dates for that and, of course, make sure that the dates for the Boeing launch are locked down as well, which may need to be adjusted. But we’re going to have that reassessed as well.\n\nI’ve also wanted to address some rumors that I’ve heard about the Artemis architecture, that there’s been some pushback against the Gateway element. Is there any truth to that? That maybe some people in the White House don’t want it?\n\nNo, there’s no truth to that. We’re building the Gateway because we’re going to land on the Moon in 2024. There’s no way to get to the Moon without the Gateway. We have to have additional Delta-v [or change in velocity]. SLS and Orion can get us to lunar orbit. But once Orion is in low lunar orbit, there’s not enough Delta-v to get out of low lunar orbit and come home. So what that means is we need to go to that near rectilinear halo orbit, which is where the Gateway will be and have a lander aggregated at the Gateway to go down to the surface of the Moon.\n\n“the architecture hasn’t changed. It isn’t going to change.”\n\nSo the architecture hasn’t changed. It isn’t going to change. These are capabilities that we absolutely must have to land on the Moon in 2024.\n\nYou touched on this earlier, but just to be more clear: I’ve heard some talk that we might hear from Trump or the vice president soon about more of an emphasis on going to Mars. But the Artemis program is still a part of that, correct?\n\nAbsolutely. The destination is Mars. The Moon is the way by which we prove the technology and the capabilities that we can go to Mars. We need to learn how to live and work on another world using the resources of that world, namely the water ice.\n\nAnd not just that but all the technologies and capabilities, and have those technologies be developed in a way that we can replicate them at Mars. The purpose of the Moon is that it’s a three-day journey home. So if something goes wrong, we can make it back. We proved that with Apollo 13. If something like that happens on the way to Mars, it would have been over. The Moon is the proving ground. Mars is the destination.\n\nIf we’re still full steam ahead to the Moon, then when does planning for the Mars mission begin?\n\nIn the coming months, you’ll see more details on a Mars plan that I think people will be very supportive of. It’ll be a big deal.\n\nBut there’s been a lot of talk of sustainability on the Moon. Do we want to create a sustainable outpost on the Moon, or is it not going to be a long-term thing?\n\nGateway will be an orbit around the Moon for 15 years, and the lander will be able to go back and forth to the Moon from the Gateway over and over again, and we will have access to any part of the Moon any time we want. That’s the goal. And in fact, if we want to have people on the surface of the Moon for long periods of time, we could do that as well. And we’ll probably have to do that to prove the technologies and capabilities for Mars.\n\nBut the goal is to get to Mars, and we need to know what we need to do on the Moon for the Mars mission. It is also true that because we have international partners and commercial partners, they might want to build out on the surface of the Moon. We would love that.\n\nBut what we’re focused on and what we are going to do is build the capabilities to get to Mars and partner with commercial to do so. And if they want to do things on the Moon that maybe are in commercial interest but not necessarily in NASA’s interest, we welcome that.\n\n“The Moon is the proving ground. Mars is the destination.”\n\nIt’s important to remember that if we build out in one spot on the surface of the Moon, we’re going to know a whole lot of information about that one spot where we landed. That’s what we did in Apollo. We landed on the Moon six times, and we know a lot about the Moon in the six locations where we landed. What we missed for 40 years was the fact that there are hundreds of millions of tons of water ice on the south pole of the Moon. So what we don’t want to do is limit our ability to have access to the entirety of the Moon. We want to not only go sustainably to the Moon, but go sustainably and have access to any part of the Moon at any time we want, utilizing technology that will get us to Mars.\n\nAnd if there is an industry partner or an international partner that wants to build out a certain part of the Moon, partnering with us on the architecture, we welcome that.\n\nI see, but for NASA specifically, building out an outpost on the surface of the Moon is not the priority right now?\n\nIt depends on what you mean by outpost. We could have numerous missions on the surface of the Moon, all at the same time. But are we looking to build a base on the Moon? That’s not necessarily the agenda. I’m not saying it can’t be done or it shouldn’t be done or that our commercial partners wouldn’t want to do it. All I’m saying is, our focus is using the Moon for the technology capabilities to go on to Mars. But you know when you talk about an outpost or a lunar base, that means 100 different things to 100 different people. It’s very difficult for me to say, “No, that’s not what we’re doing” or “Yes, that’s what we are doing.”\n\nBut the goal is to have access to any part of the Moon anytime we want and to enable commercial and international partners to join us in that effort. And if some of them want to build up more capability on the surface of the Moon, that’s great for NASA, it’s great for science, it’s great for our country.\n\nBut what we’re going to continue to focus on is the capabilities and the technology that we need to go on to Mars.\n\nJust to be more specific, what parts of the Artemis architecture and what technologies are you developing for the program that are going to be used to go to Mars in the future?\n\nGateway is a critical capability. Of course, we’re going to need a Gateway-type capability at Mars. We will need landers at Mars. Now the entry, descent, and landing on Mars is very different than the entry, descent, and landing on the Moon. But it is also true that an ascent module from Mars up to a Gateway around Mars and an ascent vehicle from the Moon up to a Gateway around the Moon, those would be very similar capabilities.\n\n“There’s no turmoil at all.”\n\nSo, the entry, descent, and landing would be dissimilar, but the rest of the architecture is very similar, if not identical.\n\nYou said we can expect to hear more about the Mars plan in the next couple of months. When do you plan on having these positions that have just been vacated filled?\n\nWe’re going to get these positions filled quickly. I don’t want to put a date on it, but it will happen very quickly.\n\nThese personnel changes are also coming on the heels of Mark Sirangelo leaving. [Sirangelo is a former NASA official who was selected to run a new Moon to Mars directorate at NASA, but he left after a month.] That could lead some to think that there is some turmoil within the agency. I’d like to give you a chance to respond to that. How are things within NASA as you try to meet this ambitious deadline?\n\nNASA is an amazing agency with 17,500 employees and thousands of contractors beyond that. Any one individual is not key to any one particular element or mission.\n\nWe love Gerstenmaier. Bill is an amazing American, and he’s done wonderful things for NASA and the United States of America. But we’re moving in a different direction so we can get back on cost and schedule. There’s no turmoil at all.", "description": "The Verge spoke with NASA administrator Jim Bridenstine to better understand recent personnel changes at the agency and what this means for the future of NASA’s lunar initiative, dubbed Artemis. Bridenstine explained that the Artemis program is still very much intact, but in the months to come, we will be seeing more of an emphasis on how NASA plans to use Artemis to get to Mars in the future.", "authors": ["Loren Grush", "Jul"], "top_image": "https://cdn.vox-cdn.com/thumbor/R4Sr0FwR7Z1X5r78vfWkoxThYIU=/0x172:1919x1177/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18305754/NHQ201901290004_large.jpg", "published_at": "2019-07-12"}