{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7589775/British-man-left-critical-German-tourist-killed-Mallorca.html", "downloaded_at": "2019-10-19 11:42:32.619533+00:00", "title": "British man left critical and German tourist killed in Mallorca after horror crash", "language": "en", "text": "A British man is fighting for his life after a woman lost control of her car on the seafront in Mallorca - killing a German tourist on the Spanish island.\n\nBoth were struck by the vehicle, said to have been travelling at 'high speed', on the Paseo Maritimo in Palma, at around 4.20pm today.\n\nThe horrific incident happened on the Paseo Maritimo in Palma and was witnessed by shocked holidaymakers.\n\nThe car went out of control near a zebra crossing, mounted the pavement and then travelled at speed for about 60ft (pictured, the car following the collision)\n\nThere was massive commotion and distress before police, firefighters and several ambulances arrived, cutting off the road and diverting traffic (pictured, police at the scene)\n\nThe car went out of control near a zebra crossing, mounted the pavement and then travelled at speed for about 60ft.\n\nIt demolished litter bins and traffic signs before striking the two pedestrians and catapulting them on to its bonnet. Both were then trapped under the car.\n\nThe victims were a German woman and a British man who were on vacation on the island.\n\nThere was massive commotion and distress before police, firefighters and several ambulances arrived, cutting off the road and diverting traffic.\n\nThe German woman, in her mid 30s, suffered multiple injuries and went into cardiorespiratory arrest.\n\nMedics rushed to the scene and battled to save her for more than an hour but without success and she was declared dead at the scene.\n\nThe incident took place on the Paseo Maritimo in Palma, Spain and was witnessed by shocked holidaymakers (pictured, the area in which the crash is suspected to have taken place)\n\nThe British man was knocked unconscious after suffering severe head injuries.\n\nHe was transferred to the University Hospital of Son Espases in a critical condition.\n\nThe woman has been arrested by the Local Police of Palma and is accused of reckless homicide and reckless driving.\n\nLocals say they are horrified at the deaths and claim it is 'terrifying' to cross the promenade at some points of the day because of the fast moving traffic.\n\nPolice have opened an investigation.\n\nThe island's press are reporting that both victims were on holiday although it is not known if they were together or unknown to each other.", "description": "The horror crash took place on the Paseo Maritimo in Palma, Spain at around 4pm today and was witnessed by shocked holidaymakers. The victims were a German woman and a British man.", "authors": ["Rita Sobot", "James Wood For Mailonline", "Gerard Couzens"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/23/19905370-0-image-a-2_1571436148379.jpg", "published_at": "2019-10-18"}