{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-syria-security/turkey-says-kurdish-ypg-has-not-fully-withdrawn-from-syria-border-area-idUKKBN1X718D", "downloaded_at": "2019-10-28 23:34:17.228440+00:00", "title": "Turkey says Kurdish YPG has not fully withdrawn from Syria border area", "language": "en", "text": "ANKARA/ISTANBUL (Reuters) - Kurdish YPG forces have not fully withdrawn from a strip of northeastern Syria under a Russia-brokered accord that is about to expire, Turkey’s foreign minister said on Monday, as Ankara prepared to discuss its next steps with Moscow.\n\nFILE PHOTO: Turkish Foreign Minister Mevlut Cavusoglu speaks during a news conference in Ankara, Turkey, October 26, 2019. REUTERS/ Alp Eren Kaya/File Photo\n\nTurkey began a military offensive in northeastern Syria tmsnrt.rs/35ZoIro targeting the YPG forces on Oct. 9 after President Donald Trump pulled U.S. troops out of the area, setting off a regional power shift that analysts say benefits Moscow and Damascus.\n\nTurkish Foreign Minister Mevlut Cavusoglu said a Russian delegation was headed to Turkey to discuss joint patrols that could begin as soon as Tuesday.\n\nIf the YPG does not fulfil the agreement to pull back more than 30 km (18 miles) from Turkey’s border, Turkish-led forces will “clear these terrorists from here”, he said.\n\n“There are those who have withdrawn. (Syrian) regime elements are confirming this, Russia is confirming this as well. But it is not possible to say all of them have withdrawn,” Cavusoglu told reporters in Ankara.\n\nAnkara views the YPG as terrorists because of their links to Kurdish insurgents in southeast Turkey. But the Kurdish-led Syrian Democratic Forces (SDF), which include the YPG, have been a important ally of the United States in the fight against Islamic State militants.\n\nOn Sunday, the SDF said it had agreed to withdraw from the 30-km border region it had controlled until the U.S. troops pulled out. Russia has moved military personnel and vehicles into the region and has said the peace plan is on track.\n\nUnder the deal agreed on Oct. 22 between Turkish President Tayyip Erdogan and Russia’s Vladimir Putin, Syrian border guards and Russian military police are supposed to clear the region of YPG fighters over a six-day period that ends late on Tuesday.\n\nTurkish and Russian forces are then meant to start patrolling a section of the Turkish-Syrian border that runs 10 km deep into Syria.\n\nThe deal means President Bashar al-Assad's forces moving back to parts of the northern border with Turkey for the first time in years due to the Syrian civil war, which began in 2011. (For an interactive map see: tmsnrt.rs/2M5FcGH)\n\n“Now, a Russian military delegation is coming (to Turkey),” Cavusoglu said. “Our friends will discuss both the latest situation on the issue of withdrawal and at the end of 150 hours (on Tuesday)... how will the patrols be, what we will do together, what steps we will take.”\n\nRUSSIA ‘GATE KEEPER’\n\nThe joint patrols are to run from the Euphrates River east to the Iraq border, except for the Kurdish-controlled city of Qamishli, covering a portion of the so-called “safe zone” Turkey originally said it would oversee.\n\nWith Ankara and Damascus locked in conflict in Syria’s rebel-controlled Idlib region in the northwest, there could be further risks as Syrian government forces and border guards head to the northeast under the Russia-brokered deal.\n\nOn Sunday, Syrian state news agency SANA reported clashes between the Syrian army and Turkish forces near Ras al-Ain, a town on the Turkish border. Turkey has not confirmed those clashes.\n\n“Much of the deal is about coordination but Turkey and Syria are still fighting it out in Idlib, so it’s another potential risk to manage,” said Asli Aydintasbas, an Istanbul-based senior policy fellow at the European Council on Foreign Relations.\n\nTurkey-backed Syrian rebel fighters sit at a back of a truck in the border town of Tal Abyad, Syria October 27, 2019. REUTERS/Khalil Ashawi\n\n“Turkey has access to northern Syria but Russia has limited (Turkish) penetration under the deal,” she added. “So Putin is the gatekeeper and sole decision-maker there, and is also in a position to dictate Syria’s pending constitutional process.”\n\nA committee tasked with mapping out Syria’s postwar political arrangements is scheduled to hold its first meeting in Geneva on Wednesday.\n\nCavusoglu will meet his Russian and Iranian counterparts in the Swiss city on Tuesday ahead of that meeting, the U.N. Special Envoy for Syria, Geir Pedersen, said.", "description": "Kurdish YPG forces have not fully withdrawn from a strip of northeastern Syria under a Russia-brokered accord that is about to expire, Turkey's foreign minister said on Monday, as Ankara prepared to discuss its next steps with Moscow.", "authors": ["Ece Toksabay", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191028&t=2&i=1445872555&w=1200&r=LYNXMPEF9R14R", "published_at": "2019-10-28"}