{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7556421/Edinson-Cavani-Thiago-Silva-set-leave-PSG-free-end-season.html", "downloaded_at": "2019-10-10 00:12:39.993291+00:00", "title": "Edinson Cavani and Thiago Silva 'set to leave PSG for free' at the end of the season", "language": "en", "text": "PSG club legends Edinson Cavani and Thiago Silva are set to leave the club for free at the end of the season.\n\nWith both the striker, 32, and centre-back, 35, in the final year of their contracts, the French champions have not offered either a new deal.\n\nAccording to ESPN, Cavani holds out some hope that he can earn another short term deal but Silva has not been consulted.\n\nEdinson Cavani is in the final year of his PSG contract and is set to leave for free\n\nThe Uruguayan still believes he can mix it among Europe's elite and would ideally like to stay on the continent if he leaves.\n\nAtletico Madrid, Napoli, Manchester United and Inter Milan are all understood to be long-term admirers of the prolific forward.\n\nPSG have made new contracts for Marquinhos Marco Verratti a priority at present.\n\nMauro Icardi is looking to impress to the extent that PSG opt to make his move from Inter a permanent one, another factor counting against Cavani.\n\nThiago Silva, 35, has been at the club for seven seasons and his time is coming to an end\n\nHe has also struggled with persistent injury problems in recent months which may put the French side off renewing his contract.\n\nThe MLS is another possible destination for Cavani although there are not thought to be offers on the table as it stands.\n\nCavani has been at the club for six years and scored more than 100 goals while Silva has put in seven years of service.\n\nBoth will be remembered with great affection at the Parc des Princes if this is to be their final season.", "description": "PSG club legends Edinson Cavani and Thiago Silva are set to leave the club for free at the end of the season. Both the striker, 32, and centre-back, 35, in the final year of their contracts.", "authors": ["Will Griffee For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/23/19514034-0-image-a-31_1570658616527.jpg", "published_at": "2019-10-09"}