{"pub": "cbs", "url": "https://cbsnews.com/news/elijah-cummings-esteemed-longtime-baltimore-congressman-died-68-today-2019-10-17", "downloaded_at": "2019-10-17 10:31:51.754631+00:00", "title": "Elijah Cummings, esteemed longtime Baltimore congressman, has died at 68", "language": "en", "text": "Representative Elijah Cummings, of Baltimore, died early Thursday at the age of 68, his office said.\n\nCummings passed away at Johns Hopkins Hospital at 2:45 a.m. from \"complications concerning longstanding health challenges,\" his office said.\n\nHe hadn't returned to work after having a medical procedure that he said would only keep him away for about a week, The Baltimore Sun pointed out.\n\nRep. Elijah Cummings is seen overseeing a House Oversight and Reform Committee hearing in Washington, D.C., in July Joshua Roberts / REUTERS\n\nThe House Oversight and Reform Committee chairman, a Democrat and 23-year House veteran, was a key figure in the impeachment inquiry into President Trump and a recent target of intense criticism from the president.\n\nCummings missed two roll call votes Thursday, the first day back following a two-week House recess. He previously released a statement saying he'd be back by the time the session resumed. He hadn't taken part in a roll call vote since Sept. 11.\n\nThe procedure already caused Cummings to miss a September hearing on Washington, D.C., statehood. The statement didn't detail the procedure.\n\nHe previously was treated for heart and knee issues.\n\nHumble beginnings\n\nA sharecropper's son, Cummings was a formidable orator who passionately advocated for the poor in his black-majority district, which encompasses a large portion of Baltimore as well as more well-to-do suburbs.\n\nAs chairman of the House Oversight and Reform Committee, Cummings led multiple investigations of Mr. Trump's dealings, including probes in 2019 relating to the president's family members serving in the White House.\n\nThe president responded by criticizing Cummings' district as a \"rodent-infested mess\" where \"no human being would want to live.\" The comments came weeks after Mr. Trump drew bipartisan condemnation following his calls for Democratic congresswomen of color to get out of the U.S. \"right now\" and go back to their \"broken and crime-infested countries.\"\n\nCummings replied that government officials must stop making \"hateful, incendiary comments\" that only serve to divide and distract the nation from its real problems, including mass shootings and white supremacy.\n\n\"Those in the highest levels of the government must stop invoking fear, using racist language and encouraging reprehensible behavior,\" Cummings said in a speech at the National Press Club.\n\nWorking way up\n\nCummings' career spanned decades in Maryland politics. He rose through the ranks of the Maryland House of Delegates before winning his congressional seat in a special election in 1996 to replace former Rep. Kweisi Mfume, who left the seat to lead the NAACP.\n\nCummings continued his rise in Congress. In 2016, he was the senior Democrat on the House Benghazi Committee, which he said was \"nothing more than a taxpayer-funded effort to bring harm to Hillary Clinton's campaign\" for president.\n\nCummings was an early supporter of Barack Obama's presidential bid in 2008.\n\nThroughout his career, Cummings used his fiery voice to highlight the struggles and needs of inner-city residents. He was a firm believer in some much-debated approaches to help the poor and addicted, such as needle exchange programs as a way to reduce the spread of AIDS.\n\nCummings was born on Jan. 18, 1951. In grade school, a counselor told Cummings he was too slow to learn and spoke poorly and he would never fulfill his dream of becoming a lawyer.\n\n\"I was devastated,\" Cummings told The Associated Press in 1996, shortly before he won his seat in Congress. \"My whole life changed. I became very determined.\"\n\nIt steeled Cummings to prove that counselor wrong. He became not only a lawyer, but one of the most powerful orators in the Maryland House of Delegates, where he entered office in 1983. He rose to become House speaker pro tem, the first black delegate to hold the position. He would begin his comments slowly, developing his theme and raising the emotional heat until it became like a sermon from the pulpit.\n\nCummings was quick to note the differences between Congress and the Maryland General Assembly, which has long been controlled by Democrats.\n\n\"After coming from the state where, basically, you had a lot of people working together, it's clear that the lines are drawn here,\" Cummings said about a month after entering office in Washington in 1996.\n\nCummings chaired the Congressional Black Caucus from 2003 to 2004, employing a hard-charging, explore-every-option style to put the group in the national spotlight.\n\nHe cruised to big victories in the overwhelmingly Democratic district, which had given Maryland its first black congressman in 1970 when Parren Mitchell was elected.", "description": "The  key figure in the impeachment inquiry into President Trump succumbed to \"complications concerning longstanding health challenges,\" his office said", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/08/01/d496a45f-9621-4502-842c-f703e6c5e7ae/thumbnail/1200x630g2/eaef8bafd09dd11a0ac4676776a37e2b/2019-07-28t171525z-1472492690-rc15b98beaa0-rtrmadp-3-usa-trump-cummings.jpg", "published_at": "2019-10-17"}