{"pub": "chinadaily", "url": "https://language.chinadaily.com.cn/a/201909/30/WS5d919960a310cf3e3556e600.html", "downloaded_at": "2019-10-05 13:19:53.685395+00:00", "title": "壮丽70年：多国专家积极评价《新时代的中国与世界》", "language": "en", "text": "9月27日，中华人民共和国成立70周年之际，国务院新闻办公室发表《新时代的中国与世界》白皮书，系统介绍中国的发展成就、发展道路、发展走向，深入阐述中国与世界的关系，引导人们从更宏阔的视野看待中国，从更精准的角度把握中国与世界的互动。多国专家对此发表了积极评价。\n\nThe document, \"China and the World in the New Era\", is issued by the State Council Information Office, on Sept 27, 2019. [Photo/China Today]\n\n\"China and the World in the New Era\" was issued by the State Council Information Office, days before the celebration of the 70th anniversary of the founding of the People's Republic of China.\n\n在庆祝中华人民共和国成立70周年前夕，国务院新闻办公室发表《新时代的中国与世界》白皮书。\n\nThe white paper highlighted China's achievements in various sectors over the past seven decades and emphasized that while working hard on its own development, China has contributed significantly to world peace and development.\n\n白皮书重点介绍了中国70年来在各领域取得的成就，强调中国在努力实现自身发展的同时，也为世界和平与发展作出了重要贡献。\n\nNicholas R. Lardy, senior fellow at the Peterson Institute for International Economics in the United States, said: \"There's a great deal to celebrate, especially for the last 40 years. But I think that there could be more to come.\"\n\n美国彼得森国际经济研究所高级研究员尼古拉斯·R·拉迪说：“中国取得的很多成就值得庆祝，尤其是过去40年间。但我认为未来还可以取得更多成就。”\n\nJ. Stapleton Roy, US ambassador to China from 1991 to 1995, said leveraging development to serve the people is the responsibility of governments everywhere.\n\n1991年至1995年间担任美国驻华大使的芮效俭表示，利用发展为人民服务是各国政府的责任。\n\nleverage [ˈliːvərɪdʒ]：v.利用\n\nA girl poses for a photo in front of a flowerbed titled \"70th Anniversary of the Founding of the People's Republic of China\" in Beijing, capital of China, Sept 28, 2019. [Photo/Xinhua]\n\n\"Unfortunately, far too many governments do not meet that responsibility properly. I think China could be greatly congratulated on the way that it has been able to use its development not simply to strengthen its military capabilities, but primarily to raise the living standard of its people,\" he said in Washington.\n\n“不幸的是，太多的政府没有恰当地履行这一责任。我认为，中国不仅能够利用其发展增强军事实力，而且主要是用以提高人民生活水平，这可喜可贺。”\n\nChina's rural population living under the poverty line-less than 2,300 yuan a year, or slightly more than $1 a day in 2018 values-decreased from 770 million in 1978 to 16.6 million in 2018, and the life expectancy of Chinese people has jumped from 35 years when New China was founded, to 65 by 1980 and 77 last year, according to the white paper.\n\n根据白皮书介绍，中国生活在贫困线（按照2018年的标准，年收入低于2300元，即略高于每天1美元）以下的农村人口从1978年的7.7亿人下降到2018年的1660万人。人们的预期寿命从新中国成立时的35岁增加到1980年的65岁，2018年更是增加到77岁。\n\n\"What's the most important aspect and which impresses me most is the unbelievable rise in the standard of living of the Chinese people,\" Roy said.\n\n芮效俭说：“最重要的，也令我印象最深的是中国人民生活水平的大幅提高。”\n\n\"Because in 1949, when the People's Republic of China was established, while I was living in Nanjing, the people right next door had so little food that the old people were not permitted to get out of bed, because they didn't have enough food to feed them,\" he said. \"Now you don't find that anywhere in China.\"\n\n他说：“因为1949年新中国成立之际，我住在南京，隔壁的邻居几乎没有吃的，由于食品短缺，老人不能起床。现在中国各地都不会出现这种情况。”\n\nPeople take a selfie in front of a flowerbed titled \"Story of Spring\" in Beijing, capital of China, Sept 28, 2019. [Photo/Xinhua]\n\nRana Mitter, professor of the history and politics of modern China at the University of Oxford in Britain, said China's record in poverty alleviation comes from various factors, such as its rapid urbanization, which permits the creation of a more dynamic economy, and initiatives on healthcare, welfare and pensions.\n\n英国牛津大学现代中国历史与政治教授拉纳•米特表示，中国所取得的扶贫成就源自多种因素，比如快速发展的城市化（这使得中国经济更具活力），以及医疗、福利和养老金方面的举措。\n\n\"However, more remains to be done. China's demographics are shifting and an older population means that there needs to be more funding for welfare provision in future. China should not move from relieving rural youth poverty to allowing urban poverty of older people,\" Mitter said.\n\n米特说：“然而，还有更多的工作要做。中国的人口结构正在发生变化，人口老龄化意味着将来福利事业需要更多资金。中国之前一直在帮助农村青年脱贫，今后也不应该让城市老年人陷入贫困。”\n\ndemographic [ˌdeməˈɡræfɪk]：n.特定年龄段的人口；人口统计数据，人口统计资料\n\nA bigger challenge for the country is to establish a Chinese economy fit for the next stage of economic development, he said.\n\n他说，中国面临的更大挑战是如何使中国经济适应下一阶段的发展。\n\n\"To maintain an economy that allows the highest-value form of technology and services, more transparency, information flow and global openness will be needed, along with research and development that allows the widest and freest form of research,\" he said.\n\n他说：“为使经济具有最高价值形态的技术和服务，需要更大的透明度、更畅通的信息流通和更广泛的全球开放性，以及最广泛和最自由的研发工作。”\n\n英文来源：中国日报\n\n翻译&编辑：yaning", "description": "《新时代的中国与世界》白皮书系统介绍中国的发展成就、发展道路、发展走向，深入阐述中国与世界的关系。多国专家发表积极评价。", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201909/30/5d919960a310cf3e979edae2.jpeg", "published_at": "2019-09-30"}