{"pub": "yahoo", "url": "https://finance.yahoo.com/news/cintas-ctas-q1-earnings-revenues-123112288.html", "downloaded_at": "2019-09-27 00:02:02.915538+00:00", "title": "Cintas (CTAS) Q1 Earnings & Revenues Beat, Increase Y/Y", "language": "en", "text": "Cintas Corporation CTAS posted better-than-expected first-quarter fiscal 2020 (ended August 2019) results, with both earnings and revenues surpassing the Zacks Consensus Estimate.\n\n\n\nEarnings/Revenues\n\n\n\nNet income from continuing operations for the quarter jumped 18% to $250.8 million from $212.5 million in the year-ago quarter. Notably, adjusted earnings came in at $2.32 per share, up 20.2% year over year. Also, the bottom line surpassed the Zacks Consensus Estimate of $2.14.\n\n\n\nRevenues increased 6.7% year over year to a record level of $1,811.1 million. The metric also improved 8.3% organically. Moreover, the top line surpassed the consensus estimate of $1,785 million.\n\nCintas Corporation Price, Consensus and EPS Surprise\n\nCintas Corporation Price, Consensus and EPS Surprise More\n\nCintas Corporation price-consensus-eps-surprise-chart | Cintas Corporation Quote\n\nSegmental Breakup\n\n\n\nThe Uniform Rental and Facility Services segment generated revenues worth $1,454.5 million in the fiscal first quarter, up 5.8% year over year. First Aid and Safety Services segment’s top line increased 12.2% to $172.1 million. Aggregate revenues from Other businesses came in at $184.5 million, up 8.8%.\n\n\n\nCosts/Margins\n\n\n\nAggregate cost and expenses for the fiscal first quarter were $1,505 million, up 5% year over year. Gross profit margin improved 130 basis points (bps) to 46.9%.\n\n\n\nSelling and administrative expenses were up 7.6% year over year to almost $543 million in the reported quarter. Operating margin was 16.9%, up 130 bps.\n\n\n\nBalance Sheet/Cash Flow\n\n\n\nAt the end of the fiscal first quarter, cash and cash equivalents came in at $102.1 million compared with $96.6 million at the end of fourth-quarter fiscal 2019. Long-term debt increased to $3,488.3 million from $3,306.2 million sequentially.\n\n\n\nFor first three months of fiscal 2020, the company generated $276.9 million cash from operating activities, up 69.9% year over year. Capital expenditures were $64.7 million, up 0.3%.\n\n\n\nIn the fiscal first quarter, Cintas repurchased common stock worth $256.8 million under its buyback program.\n\n\n\nOutlook\n\n\n\nCintas updated revenue guidance for fiscal 2020 (ending May 2020) in the range of $7.28-$7.32 billion from the previous view of $7.24-$7.31 billion. Notably, adjusted earnings view for the fiscal has been raised from $8.30-$8.45 per share to $8.47-$8.57.\n\n\n\nZacks Rank & Key Picks\n\n\n\nCintas currently carries a Zacks Rank #3 (Hold).\n\n\n\nSome better-ranked stocks from the Zacks Industrial Products sector are Zebra Technologies Corporation ZBRA, Brady Corporation BRC and Lakeland Industries, Inc. LAKE. While Zebra Technologies currently sports a Zacks Rank #1 (Strong Buy), Brady and Lakeland Industries carry a Zacks Rank of 2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\n\n\nZebra Technologies delivered average positive surprise of 5.61% in the trailing four quarters.\n\n\n\nBrady came up with average beat of 9.68% in the preceding four quarters.\n\n\n\nLakeland Industries pulled off average positive surprise of 325.89% in the last four quarters.\n\n\n\n5 Stocks Set to Double\n\n\n\nEach was hand-picked by a Zacks expert as the #1 favorite stock to gain +100% or more in 2020. Each comes from a different sector and has unique qualities and catalysts that could fuel exceptional growth.\n\n\n\nMost of the stocks in this report are flying under Wall Street radar, which provides a great opportunity to get in on the ground floor.\n\n\n\nToday, See These 5 Potential Home Runs >>\n\n\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n\n\nCintas Corporation (CTAS) : Free Stock Analysis Report\n\n\n\nZebra Technologies Corporation (ZBRA) : Free Stock Analysis Report\n\n\n\nBrady Corporation (BRC) : Free Stock Analysis Report\n\n\n\nLakeland Industries, Inc. (LAKE) : Free Stock Analysis Report\n\n\n\nTo read this article on Zacks.com click here.", "description": "Cintas' (CTAS) first-quarter fiscal 2020 revenues rise year over year backed by solid organic revenue growth in Uniform Rental and Facility Services, and First Aid and Safety Services segments.", "authors": ["Zacks Equity Research"], "top_image": "https://s.yimg.com/uu/api/res/1.2/9augTClWeQ4mzNufz9EMvQ--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/79ad8a415ede44b527ea7785be490a7c", "published_at": "2019-09-25"}