{"pub": "metro", "url": "https://metro.co.uk/2019/10/22/woman-murdered-colleague-wine-bottle-sawed-off-head-10962398", "downloaded_at": "2019-10-22 13:28:44.366704+00:00", "title": "Woman ‘murdered her colleague with a wine bottle and sawed off her head’", "language": "en", "text": "Sophie Masala, left, and Maryline Planche, right\n\nA woman hated her colleague so much that she bludgeoned her to death with a full wine bottle then returned a week later to saw off her head, a court heard.\n\nSophie Masala, 55, developed an ‘obsessional hatred’ for Maryline Planche, 52, after they disagreed over filing of documents and their office roles, prosecutors claimed.\n\nThey were both civil servants managing funds for the disabled, with Masala allegedly admitting she was exasperated at the way Ms Planche used to take work home with her.\n\nShe is said to have gone to her flat in Toulouse, France, in May 2016 ‘to complain’.\n\nOnce there, she attacked Ms Planche with the full glass bottle then waited a week to decapitate her, it is alleged.\n\nShe then used a soup spoon to dig a hole in communal garden next to the block of flats, and buried the head, a court heard.\n\nMaryline Planche died after she was allegedly murdered by her colleague\n\nJudges were told the rest of the body was chopped into parts, placed into five bags, wheeled away in a supermarket trolley and then dumped in the Canal du Midi.\n\nAdvertisement\n\nAdvertisement\n\nThe married mother-of-two claims she acted in self defence, but the prosecution say it was a meticulously planned murder.\n\nJudge David Senat, the President of the Court, expressed astonishment at the way petty arguments had escalated, saying: ‘A disagreement about the filing of documents, about their office roles, about respect for their private lives – there are always jealousies in the professional context, but how does it lead to such a strong hatred?’\n\nWitnesses have claimed that Masala was talkative and disruptive in the officer, while the partially sighted Ms Planche was a much-respected member of staff at the Association for the Management of Funds for the Integration of the Disabled.\n\nSophie Masala said she acted in self defence\n\nPierre Dunac, Masala’s defence barrier, said his client had panicked, and this is why she lashed out with the wine bottle.\n\nMs Planche, who was single, was recovering from an eye operation at the time, and her corpse was left lying in her home before Masala allegedly returned with the saw seven days later.\n\nThe killing only came to light when one of the bags containing body parts was found in the canal by a passer-by on May 24, 2016.\n\nMasala has a previous conviction for theft, and in 2012 worked as a prostitute, with the compliance of her husband, the court heard.\n\nThe trial is set to finish on Friday.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "A woman hated her colleague so much that she bludgeoned her to death with a full wine bottle then returned a week later to saw off her head, a court...", "authors": ["Jen Mills"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_91174717_1571745008.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-22"}