{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/10/WS5d9e68b1a310cf3e3556f894.html", "downloaded_at": "2019-10-10 00:05:43.330590+00:00", "title": "Consumers make beeline for 5G", "language": "en", "text": "By MA SI | China Daily | Updated: 2019-10-10 07:09\n\nConsumers try 5G-enabled handsets at a China Unicom store in Shenzhen, Guangdong province. [LU LI/FOR CHINA DAILY]\n\nThree major telecom firms secure 10m orders before official launch of services\n\nChinese consumers are scrambling to be the first batch of users of 5G mobile services, with more than 10 million having pre-ordered mobile package services for the fifth-generation wireless technology.\n\nAccording to early data from the country's three major telecom carriers, more than 10 million consumers had applied for 5G mobile package services by 9:25 am on Wednesday.\n\nSpecifically, 5.92 million users pre-ordered the data packages from China Mobile, the nation's largest telecom operator by mobile subscribers, 2 million ordered them from China Unicom and 2.08 million from China Telecom.\n\nThe 10 million level marks an 88 percent jump from the data as of Sept 30. By then, more than 5.3 million users had pre-ordered the services.\n\nSo far, the three major carriers have not officially launched their 5G data packages yet and they have all offered discounts of up to 30 percent to attract early customers.\n\nThe enthusiasm for 5G mobile services came after about 219,000 units of smartphones were shipped in China in August, data from the China Academy of Information and Communications Technology showed.\n\nIn July, the shipments of 5G smartphones were 72,000 units. That was about a month after China granted the licenses for commercial use of 5G services on June 6.\n\nXiang Ligang, director-general of telecom industry association Information Consumption Alliance, said the prices for official 5G data packages are likely to be unveiled soon.\n\n\"Some of the consumers who have pre-ordered the 5G mobile services may not buy 5G smartphones yet, but their eagerness to try new things can be seen from their enthusiasm,\" Xiang explained.\n\nChina Mobile has attracted more 5G pre-orders than its two smaller rivals so far, partly because it currently has the largest number of 4G users in the country, he said.\n\nThe big three mobile carriers said that current telecom users do not need to change their SIM card and mobile numbers. After purchasing a 5G smartphone, they are able to upgrade their previous 4G package to a 5G package.\n\nEmployees at the Beijing branch of China Telecom said earlier that the price of a monthly 5G data package could range from 199 yuan ($28) to 599 yuan.\n\nFu Liang, an independent analyst who has been following the telecom industry for more than a decade, said a key hurdle in 5G adoption was the price of 5G smartphones and data packages, along with the 5G support network. At this time, there is limited coverage of the 5G network around the world.\n\n\"But Chinese companies are adopting aggressive strategies to extend 5G coverage and lower the prices. The more quickly 5G networks are constructed and the cheaper the smartphones and data packages are, the easier it will be to convince people to purchase them,\" Fu said.\n\nChina Telecom said it will work along with key smartphone vendors to unveil 5G handsets priced under 2,000 yuan in the first half of next year.\n\nAt the same time, China Telecom announced it would partner with China Unicom to build a nationwide 5G network, as they aim to accelerate the rollout of 5G by reducing construction costs.", "description": "Three major telecom firms secure 10m orders before official launch of services", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/10/5d9e68b1a310cf3e97a05c0b.jpeg", "published_at": "2019-10-10"}