{"pub": "fox", "url": "https://foxnews.com/media/trump-senate-mike-pence-joe-scarborough", "downloaded_at": "2019-10-22 16:06:39.888517+00:00", "title": "Scarborough claims Pence would be president 'by noon' if Senate could hold secret vote", "language": "en", "text": "President Trump would be impeached and Vice President Mike Pence would be elevated to the Oval Office within hours if the Senate were able to conduct their vote in secret, said MSNBC's Joe Scarborough Tuesday morning.\n\nScarborough was discussing the president with panelist Mike Barnicle on \"Morning Joe\" and both agreed that 90 percent of the Senate would vote to convict Trump if they could cast a secret vote.\n\n“We all know that privately in the cloakroom they speak very disparagingly of him,\" Barnicle said. \"And if there was a secret ballot in the United States Senate, I think Trump would lose 90-10 maybe.\"\n\n\"If there were a secret ballot in the Senate this morning, Mike Pence would be president by noon,\" Scarborough replied.\n\nJOE SCARBOROUGH CLAIMS TRUMP HAS 'ITCHY FINGER' TO USE NUCLEAR WEAPONS\n\nScarborough, who routinely espouses anti-Trump views, claimed GOP senators secretly want Trump gone so they can get back to the way things were and carry out a conservative agenda.\n\nCLICK HERE FOR THE FOX NEWS APP\n\n\"It is that clear. They want Trump out. They want Mike Pence in,\" he said. \"They want a return to conservative principles. They want a return to conservative issues. They want to talk about policy, instead of Donald Trump trying to loot the federal treasury to make hundreds of thousands of dollars on his Scottish resort.... or his Miami bedbug-ridden resort.\n\n\"They want to get back to business and Trump's recklessness won't allow them to do that,\" Scarborough added.", "description": "President Trump would be impeached and Vice President Mike Pence would be elevated to the Oval Office if the Senate were able to conduct their vote in secret, said Joe Scarborough Tuesday morning.", "authors": ["Nick Givas", "Nick Givas Is A Reporter With Fox News. You Can Find Him On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/trump-Scarborough-pence-AP-MSNBC.jpg", "published_at": "2019-10-22"}