{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7612251/Jackie-O-Henderson-reveals-low-fuss-beauty-routine.html", "downloaded_at": "2019-10-26 00:14:29.400657+00:00", "title": "Jackie 'O' Henderson reveals her low-fuss beauty routine", "language": "en", "text": "She's the radio titan who has just inked a deal that will net her and her KIIS FM co-host Kyle Sandilands a whopping $8 million each a year.\n\nBut it seems Jackie 'O' Henderson likes to keep things relatively cheap and cheerful when it comes to maintaining her no-fuss beauty regimen.\n\nOn Friday, the 44-year old mother-of-one revealed her skincare routine and handbag essentials - and one of them costs a bargain basement $4.49.\n\nCheap and cheerful: On Friday, Radio Titan Jackie 'O' Henderson (pictured) revealed her low-fuss beauty routine... and the item that costs $4.49 that she simply can't live without\n\n'My skincare routine is as low-fuss as possible, I don’t have much time in the morning, especially when I’m up and out the door at 4:30am,' Jackie told Mamamia.\n\n'I’m a big believer in not overloading your skin with too many products... I use the same products morning and night.\n\nEach night the media powerhouse removes her war paint with Sante by Enjo Makeup Removing Discs ($44), which exfoliate and cleanse. And they're reusable!\n\nOnce the slap comes off, The Masked Singer judge applies Aesop Damascan Rose Facial Treatment ($80) and Aesop Camellia Nut Facial Hydrating Cream ($80).\n\nJackie uses the serum and cream, morning and night.\n\nOperation beauty duty: Once the slap comes off, The Masked Singer judge applies Aesop Damascan Rose Facial Treatment ($80) and Aesop Camellia Nut Facial Hydrating Cream ($80). Jackie uses the serum and cream, morning and night\n\nIn the interview, Jackie highlighted the importance of staying hydrated at all times, and being sun safe.\n\n'I’ve had to have a few skin cancers removed over the last few years, and I’m now conscious that both my daughter, Kitty, and I need to protect our skin,' she said.\n\nJackie recommends Neutrogena Ultra Sheer Face & Body Lotion SPF50 ($16.99) to keep the sun's rays at bay.\n\nSlip, slop, slap! 'I’ve had to have a few skin cancers removed over the last few years...' Jackie told Mamamia\n\nThe radio star recommends Neutrogena Ultra Sheer Face & Body Lotion SPF50 ($16.99) and Wrinkles Schminkles Masks ($39.95), which she says can bring her 'skin back to life overnight'\n\nWhen she has a beauty emergency, the glamorous chatterbox can't go past Wrinkles Schminkles Masks ($39.95), which she says can bring her 'skin back to life overnight'.\n\nOver the years, Jackie has perfected her makeup routine with laser-like focus.\n\nHer go-to base is always Giorgio Armani Luminous Silk Foundation ($99), a dab of NARS Radiant Creamy Concealer ($46) comes next, before she applies Chantecaille Compact Makeup in Camel ($110).\n\nSo pretty! Over the years, Jackie has perfected her makeup routine with laser-like focus\n\nOver the years, Jackie has perfected her makeup routine with laser-like focus. Her go-to base is always Giorgio Armani Luminous Silk Foundation ($99) followed by a dab of NARS Radiant Creamy Concealer ($46)\n\nIf she's after a pop of colour, Jackie likes Chantecaille Philanthropy Cheek Colour in Emotion ($61) and Melissa Sassine Golden Goddess Bronzer ($50) for contouring.\n\nJackie's makeup artist Max Made, one of the best in the business, has introduced her to Nude by Nature Moisture Shine Lipstick. Her favourite colour is Pale Coral ($22.95).\n\nShe likes to frame her million dollar peepers using Anastasia Beverly Hills Brow Wiz, ($38) and it quite partial to a Urban Decay Naked3 eyeshadow palette ($83), which she says is 'fairly nude'.\n\nJackie's makeup artist Max Made introduced her to Nude by Nature Moisture Shine Lipstick. Her favourite colour is Pale Coral ($22.95). She's also quite partial to an Urban Decay Naked3 eyeshadow palette ($83), which she says is 'fairly nude'.\n\nWhen it comes to eyeliner, Jackie's the first to admit she has no loyalty.\n\nJackie told mamamia she has her makeup routine down pat. Fifteen minutes is all it takes, and she likes it like that. She's a working mum after all, so there's no time to mess about.\n\nJackie's handbag essentials includes Nivea Hydro Care Lip Balm ($4.49), Klorane Dry Shampoo ($14.99), and her signature fragrance - which is currently Stella McCartney for Women Eau de Parfum 100ml ($150).", "description": "She's the radio Titan who has just inked a deal that will net her and her KIIS Fm co-host Kyle Sandilands a whopping $8 million each a year.", "authors": ["Shannon Shipley For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/06/20166094-0-image-a-26_1571980011180.jpg", "published_at": "2019-10-25"}