{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/hollyoaks-spoilers-special-three-hander-episode-reveals-mitchell-deverauxs-romance-with-scott-drinkwell-revealed-as-cleo-mcqueen-exits-11014010", "downloaded_at": "2019-10-31 00:08:27.252931+00:00", "title": "Hollyoaks spoilers: Scott and Mitchell's affair revealed to Cleo in three-hander episode", "language": "en", "text": "(Picture: Lime Pictures)\n\nMitchell Devereaux (Imran Adams) has been having a secret affair with Scott Drinkwell (Ross Adams) in Hollyoaks, but — with Scott having been left for dead following the crane collapse — the truth about the pair’s dalliance is set to come light in a special three-hander episode, during which Cleo McQueen (Nadine Mulkerrin) learns everything.\n\nAfter Scott sustained serious injuries as a result of the devastation within the village, he was taken to the hospital. However, he’s in a pretty bad way, and Mitchell refuses to leave his side as a result.\n\nIn a special three-hander episode due to air tonight, Cleo discovers the truth about her boyfriend’s affair with her best mate.\n\nOn Cleo’s discovery, actress Nadine said: ‘She obviously goes off the hook, she’s like, are you having a laugh? This is not the first time this has happened to her. All she is thinking is, why does every man turn out to be gay. She absolutely loses her cool but then by the end of it she’s like, do you know what, I’m better than this and I deserve better than this.’\n\nAdvertisement\n\nAdvertisement\n\n‘Ironically, typical Hollyoaks style, Cleo and Scott are best friends, so they’ve been hanging out a lot and obviously that makes it even more painful of a betrayal when Scott has been sleeping with her man.’\n\nMitchell’s odd behaviour raises her suspicions, and — after the truth comes out — she’s shocked to hear Mitchell referring to Scott as ‘her’. He states that he was having an affair Anita Tinkle, and therefore he can’t be gay — especially because of his grandfather Walter’s (Trevor A Toussaint) religion.\n\nTalking about the three-hander, actor Imran Adams said: ‘It’s not just about not being able to come out because of pride or ego or image, it’s because of his culture, religion, family, upbringing, and also because of a sense that he owes his grandad so much based on how much he has provided for him’\n\nRoss Adams added: ‘This is, I think, one of the most unique love stories ever told in soap history and it feels right for the show to be telling it at a time when Hollyoaks is doing such important work with our “Celebrate Difference” campaign’\n\nNadine said: ‘I really think the audience are going to get behind it and he’s a stripper he’s a womaniser he’s obviously the typical handsome man so the audience may not have been expecting him to have these feelings for men, and go on a journey of figuring out his sexuality. I think once again it’s going to be another really positive storyline for Hollyoaks to tackle.’\n\nAdvertisement\n\nAdvertisement\n\nIn addition to revealing the affair, the three-hander episode will focus on Cleo’s exit. As a result of her having gone through something similar with Harry, she reflects on her previous relationships before ultimately deciding that she deserves better than this — a decision which leads to her departure.\n\nHollyoaks airs the special three-hander on Thursday 31stOctober at 7pm on E4.\n\nMORE: Hollyoaks spoilers: Sarah Jayne Dunn promises huge heartbreak after Darren and Nancy’s secret kiss\n\nMORE: Hollyoaks spoilers: Stephanie Waring reveals Cindy Cunningham and Luke Morgan future after horror stunt\n\nAdvertisement Advertisement", "description": "Cleo learns the truth about Mitchell's affair with Scott — and it's this revelation that prompts her decision to leave.", "authors": ["Stephen Patterson"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/image003-61b7_1572478675.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-30"}