{"pub": "yahoo", "url": "https://news.yahoo.com/former-gop-rep-pete-sessions-234300062.html", "downloaded_at": "2019-10-13 08:48:19.002664+00:00", "title": "Former GOP Rep Pete Sessions donates tainted money from Giuliani associates to charity", "language": "en", "text": "These images provided by the Alexandria Sheriff’s Office show booking mugshots of Igor Fruman (left) and Lev Parnas, associates of Rudy Giuliani who were arrested on an indictment that includes charges of violating campaign finance laws. The men had key roles in Giuliani's efforts to launch a Ukrainian corruption investigation against Biden and his son, Hunter.\n\nWASHINGTON – A former Texas congressman who received thousands in donations from two recently arrested associates of Rudy Giuliani announced late Friday that he is donating the contributions to charity.\n\nUkrainian business partners Lev Parnas and Igor Fruman, charged Thursday with funneling large caches of foreign money to Republican political campaigns and interests, contributed $5,400 to former Rep. Pete Sessions, according to court documents unsealed by federal prosecutors in New York.\n\nIdentified only as \"Congressman 1\" in court documents, Sessions' link to the transactions was confirmed by a person familiar with the case. Sessions, who lost a re-election bid last year, has not been charged with wrongdoing.\n\nIn addition to the donations, Parnas and Fruman also pledged to raise $20,000 for the lawmaker as they sought to enlist him in an effort to remove Marie Yovanovitch, the then-U.S. ambassador to Ukraine.\n\nSessions wrote a letter last year to Secretary of State Mike Pompeo, urging the ouster of Yovanovitch, who was ultimately recalled in May.\n\nYovanovitch was on Capitol Hill Friday as a witness in the House impeachment inquiry, telling lawmakers that the State Department removed her after being pressured by President Donald Trump.\n\nTrump referred to his differences with the former ambassador in a July 25 telephone call with Ukraine President Volodymyr Zelensky in which Trump requested that his counterpart open an investigation into Democratic rival Joe Biden and his son, Hunter Biden. The Trump-Zelensky phone call is at the heart of the Democrat-led impeachment inquiry.\n\n\"Yesterday, I learned that two contributors to my 2018 campaign are being charged for not following campaign contribution laws,\" Sessions said Friday. \"Their deception cannot, and should not, be tolerated. Therefore, I am contributing the amount of their contributions to charities that serve abused women and children and the elderly in central Texas.”\n\nWhen the charges were made public Thursday, Sessions said that he had no knowledge of the alleged schemes involving Parnas and Fruman, who helped Giuliani meet a Ukrainian prosecutor as the president's lawyer also pushed for an investigation of the Bidens.\n\nMore: Criminal case against Giuliani's associates darkens cloud over Trump's personal attorney, White House\n\nMore: Donald Trump distances himself from Rudy Giuliani: 'He has been my attorney'\n\n\"I was first approached by these individuals for a meeting about the strategic need for Ukraine to become energy independent,\" Sessions said. \"There was no request in that meeting and I took no action. Over time, I recall that there were a couple additional meetings. Again, at no time did I take any official action after these meetings.\"\n\nSessions said he wrote to Pompeo after \"several congressional colleagues reported to me that the current US Ambassador to Ukraine was disparaging President Trump to others as part of those official duties,\"\n\n\"I wrote a letter to the secretary of State to refer this matter directly,\" Sessions said.\n\nParnas and Fruman were arrested Wednesday at Dulles International Airport as they waited to board a flight to Frankfurt as part of one-way trip to Europe. They remained in custody Friday, with bail set for each at $1 million.\n\n.\n\nThis article originally appeared on USA TODAY: Former GOP Rep Sessions donates tainted contributions to charity", "description": "Former GOP Rep Pete Sessions donates tainted contributions from Giuliani associates to charity", "authors": ["Kevin Johnson", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/qKVf2_TI2kse.R1bw83k4g--~B/aD01MjE7dz04OTM7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/usa_today_news_641/a566a5f110b3ad7983780a48f1f039fa", "published_at": "2019-10-11"}