{"pub": "fox", "url": "https://foxnews.com/media/meghan-mccain-slams-feckless-unpatriotic-cowards-who-support-trumps-decision-to-pull-back-us-troops-in-syria", "downloaded_at": "2019-10-07 23:33:36.530698+00:00", "title": "Meghan McCain slams ‘feckless, unpatriotic cowards’ who support Trump’s decision to pull back US troops in Syria", "language": "en", "text": "ABC News’ “The View” co-host Meghan McCain blasted “feckless, unpatriotic cowards” who support President Trump’s decision to pull U.S. troops from northern Syria during a scathing rant Monday.\n\nMcCain admitted she was going “a little bit rogue” before tearing into Trump, who on Monday defended the decision to pull back from Syria, saying the ISIS \"caliphate\" has been defeated and lamenting that the U.S. was in the region years longer than planned.\n\n“I’ve been so mad this morning, and so upset about this news that we are abandoning our Kurdish allies in the Middle East. These are allies of ours that American soldiers are still continuing to fight alongside. All we did was arm them and they fought for America,” McCain said. “We’re just going to leave them and abandon them.”\n\nMcCain then directed her anger at anyone who supports the president’s decision.\n\nMEGHAN MCCAIN SMACKS DOWN JOY BEHAR'S CLAIM ECONOMY IS SLOWING: 'THAT'S JUST FAKE NEWS'\n\n“To everyone in the White House and every Republican who was mad that President Obama pulled out of Iraq, you feckless, unpatriotic cowards,” she said. “I cannot believe this is where we’re at, diplomatic wise.”\n\nMcCain added, “This is a great day for ISIS… shame on everyone who is supporting this.”\n\nTURKISH PRESIDENT SNUBS BOLTON, ANGRY OVER CALL TO PROTECT KURDISH FIGHTERS IN SYRIA\n\nMcCain said it could be a “wag the dog” situation but reminded viewers that Trump “ran on isolationism.”\n\nCo-host Joy Behar also chimed in, saying: “It’s a distraction from the second whistleblower.”\n\nTrump first made waves on the issue in December 2018, when he abruptly announced the U.S. would completely pull its troops from Syria, tweeting that the mission to defeat ISIS was completed. The move prompted the resignation of then-Defense Secretary Jim Mattis and a coordinated campaign by then-National Security Adviser John Bolton to try to protect the Kurds, America's fighting partner in the region.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nThe decision sent shockwaves through the region and Washington, with U.S. officials telling Fox News that top Pentagon officials were “completely blindsided” and “shocked” by the order to pull back hundreds of U.S. troops, a move that effectively green-lights the Turkey operation.\n\n\"The United States was supposed to be in Syria for 30 days, that was many years ago. We stayed and got deeper and deeper into battle with no end in sight. When I arrived in Washington, ISIS was running rampant in the area. We quickly defeated 100% of the ISIS Caliphate,\" Trump tweeted on Monday.\n\nFox News’ Gerren Keith Gaynor and Edmund DeMarche contributed to this report.", "description": "ABC News’ “The View” co-host Meghan McCain blasted “feckless, unpatriotic cowards” who support President Trump’s decision to pull U.S. troops from northern Syria during a scathing rant Monday.", "authors": ["Brian Flood", "Brian Flood Covers The Media For Fox News. Follow Him On Twitter At"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/06/21/694940094001_6050943317001_6050942215001-vs.jpg", "published_at": "2019-10-07"}