{"pub": "metro", "url": "https://metro.co.uk/2019/10/21/manchester-united-ace-fred-rates-performance-liverpool-thanks-michael-carrick-advice-10956310", "downloaded_at": "2019-10-21 13:08:21.194441+00:00", "title": "Fred rates his own performance against Liverpool and thanks Michael Carrick", "language": "en", "text": "Fred was satisfied with his performance as Manchester United drew with Liverpool (Picture: Getty)\n\nFred says he’s ‘happy’ with his display against Liverpool and has thanked the likes of Michael Carrick for their help and support after a tough start to his Manchester United career.\n\nThe 26-year-old has struggled to live up to his £52million price tag since joining from Shakhtar Donetsk back in 2018, but was handed a rare start at Old Trafford on Sunday afternoon.\n\nIn the absence of Paul Pogba, Fred showed moments of quality alongside midfield partner Scott McTominay as the points were shared between two of English football’s great rivals.\n\nThe Brazilian was satisfied with his individual showing and believes United can take encouragement from their overall performance against Jurgen Klopp’s side.\n\nFred started alongside McTominay in midfield at Old Trafford (Picture: Getty)\n\n‘Personally, I’m happy how I played in my first “clasico” against Liverpool,’ Fred told The National.\n\nAdvertisement\n\nAdvertisement\n\n‘We’re just all a little frustrated that we didn’t hold on to the lead, but we have to be encouraged.\n\n‘We played at a very good pace against Liverpool. We needed that, we haven’t started the league well, but we played with heart, we played with force, we attacked quickly, especially in the first half. The second half we continued well but it was more equal.’\n\nFred is aware that he’s so far failed to live up to expectations since arriving at United, but the Brazil international insists he’s still ‘adapting’ to the physical nature of the Premier League.\n\n‘My first season was difficult but that is normal when a footballer changes league,’ he added.\n\n‘The Ukrainian league isn’t as strong as the Premier League. It’s faster and more physical here.\n\n‘You need to start games strongly and finish them strongly. It’s the full force for 90 minutes, but it takes time to adapt to English football when you come from Ukraine, even though I was playing against some of the best teams in the Champions League, but I believe I am adapting.’\n\nFred thanked Solskjaer and Carrick for their support (Picture: Getty)\n\nAmid his struggles, Fred has received constant support from Manchester United’s coaching staff and the midfielder has thanked the likes of Mike Phelan and Carrick for their advice.\n\nAdvertisement\n\nAdvertisement\n\n‘I have a good relationship with the manager and the coaches.\n\n‘I speak to the coach [Mike Phelan] every day. And to Michael [Carrick] and Kieran [McKenna].\n\n‘Michael played in my position; he knows what he is saying. They are always encouraging me and I feel the support of fans, too. And I thank them for that.\n\n‘I’m learning day by day. I feel like I’m getting better. I have a big heart. I will play better. I like Manchester. My family are here and they like it too.\n\n‘They are speaking English. I’m having English classes too but it’s not possible all the time because we travel a lot but we speak lots of languages here.’\n\nMORE: Ole Gunnar Solskjaer provides injury updates on Paul Pogba, Nemanja Matic and Axel Tuanzebe", "description": "Fred says he's 'happy' with his display against Liverpool and has thanked the likes of Michael Carrick for their help and support after a tough start to his Manchester United...", "authors": ["Metro Sport Reporter"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1182279084_1571663118.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-21"}