{"pub": "axios", "url": "https://link.axios.com/click/18461971.61615/aHR0cHM6Ly93d3cudGhldmVyZ2UuY29tLzIwMTkvMTAvMjgvMjA5MzI3ODAvY2FsaWZvcm5pYS1ibGFja291dC1oZWFsdGhjYXJlLWVsZWN0cmljaXR5LWZpcmVzP3V0bV9zb3VyY2U9bmV3c2xldHRlciZ1dG1fbWVkaXVtPWVtYWlsJnV0bV9jYW1wYWlnbj1uZXdzbGV0dGVyX2F4aW9zdml0YWxzJnN0cmVhbT10b3A/5c90f2c505e94e65b176e000B67a9dac5", "downloaded_at": "2019-10-29 14:03:41.297119+00:00", "title": "California’s blackouts reveal health care’s fragile power system", "language": "en", "text": "There’s a blackout, a planned blackout to cut the fire risk to your community just west of Sacramento, and now you are faced with a decision: do you keep your refrigerator full of vaccines running, or do you keep the community’s electronic health care records online? Your backup generator can’t do both.\n\nThis sounds like a hypothetical, but it isn’t. Winters Healthcare, based in Winters, California, was faced with this very decision when its utility company, Pacific Gas and Electric Company, shut off part of its power grid to reduce the risk of starting new fires. And since the blackouts are likely to continue for the foreseeable future, it’s a question that other health care facilities will face.\n\nWinters Healthcare chose to use enough lights so that people could see and run the generator to keep the electronic health records accessible, Winters Healthcare executive director Christopher Kelsch told The Verge. It decided to close the dental clinic, and it sent its vaccines to a sister clinic that wasn’t expected to lose power.\n\nThe clinic has emergency plans for accidental, weather-related outages that are repaired quickly, but the ambiguity of this blackout’s length and timing made things challenging. “They said we could be down 24 to 48 hours, and it might be five days. It’s hard to know what to do,” Kelsch says. They weren’t the only ones left wondering. The shutoffs left around 2 million people without municipal power and affected a number of hospitals and clinics in the region.\n\n“They said we could be down 24 to 48 hours, and it might be five days. It’s hard to know what to do.”\n\nThe United States health care system depends on electricity to function normally: it needs power to run everything from ventilators to electronic health records, to ferry patients via elevator through hospitals, refrigerate medications, and countless other tasks. But that PG&E planned outage wasn’t the last. There were more outages last week, and they are likely to become more frequent as the changing climate keeps California dry and makes fires more likely. The number of weather-related power outages is also increasing as extreme weather events become more common. As a result, it’s more critical than ever that health care facilities are prepared for a present and future where power isn’t a guarantee.\n\n“We’re so used to having an uninterrupted supply of power,” says Grete Porteous, an anesthesiologist and emergency medicine specialist at Virginia Mason Medical Center in Seattle. “It really blows people’s minds to understand that all of this is very fragile.”\n\n“It really blows people’s minds to understand that all of this is very fragile.”\n\nIn order to receive federal funding from Medicare and Medicaid, hospitals that provide critical care are required to have generators that can power their essential functions. The Joint Commission, which accredits hospitals, calls them to have emergency plans in place and for generators to be tested regularly. However, despite precautions, generators can be vulnerable during disasters. At NYU Langone Medical Center, for example, key pieces of the backup system were in the basement, which flooded during Superstorm Sandy in 2012, knocking out all power to the hospital. “Just because you have generators doesn’t mean they’ll work, or work for long enough,” Porteous says.\n\nMany generators also have a lag time before they kick in, and the few seconds equipment goes down can trigger a long reboot, which might put patients at risk if they’re dependent on a constantly running machine, Porteous says. Power fluctuations might also cause damage to sensitive equipment. Deciding which areas of the hospital get power can be agonizing. Usually, the surgery and intensive care units are powered first. But that leaves other areas of the facility in the dark, which can be dangerous for patients — maybe because drugs might be kept in electronically locked dispensing units, maybe because fridges storing insulin don’t stay cold when the power’s cut, or, more mundanely, maybe because patients are more likely to stumble in the dark.\n\nDeciding what areas of the hospital get power can be agonizing\n\nOutpatient health clinics, which aren’t subject to the same regulations as hospitals, are working with even less of a safety net.\n\nMany community clinics, like Winters Healthcare, don’t always have generators or redundant power systems. John Muir Health, a network of hospitals and health clinics near San Francisco, California, for example, had to scramble during the outage to move vaccines and medications from facilities that would lose power, communicate with patients, and reschedule appointments.\n\nIn addition, if power is off in a community, people who rely on electricity at home to maintain their health — like people on ventilators — may turn to hospitals, which can be overwhelmed by the influx. “A classic example is if a nursing home writes a hospital into their disaster plan and doesn’t tell the hospital,” says Kristi Koenig, EMS director for the County of San Diego and professor emerita of emergency medicine and public health at the University of California, Irvine.\n\nSome health care facilities are looking carefully at their power systems to make their services less vulnerable to sudden shutdowns.\n\nA few years ago, Porteous and Chris Johnson, then the Emergency Management Program manager at Virginia Mason in Seattle, carefully examined all of the power-dependent elements of their hospital in preparation for planned electrical upgrades, which could have compromised their generator. “We looked at every piece of medical equipment, and asked if it had a battery, and how long did it last,” says Johnson, who is now the director of safety, security, and emergency management at Valley Medical Center in Washington state. They looked at the elevators as well and realized it would be nearly impossible to move critically ill patients without them. “We had to have a plan for how to keep them in place.”\n\n“it is difficult to get people to drill, and plan for the ‘what if,’ even though the ‘what if’ is inevitable.”\n\n“A ton of work went into doing that, to make sure we were prepared to handle any power failure,” Johnson says. It took support from hospital leadership to conduct such an extensive evaluation, which is not guaranteed everywhere, he says.\n\n“There are people who pay more attention, and are champions for preparedness,” Koenig says. “But it is difficult to get people to drill, and plan for the ‘what if,’ even though the ‘what if’ is inevitable. Doctors are so busy, day to day — to get a trauma surgeon down to play in a disaster drill is difficult.”\n\nPorteous, who directs the anesthesiology residency program at Virginia Mason, runs simulations with residents that ask them to think about the best way to deliver care during a power outage. But most US doctors don’t train for that scenario. “In other parts of the world, power could go out multiple times a day,” she says. “That mindset is the opposite of medical care in the US.”\n\nHospitals and health care systems in the US also run on razor-thin financial margins, and convincing decision-makers to invest in emergency preparedness can be challenging, Johnson says. New York City’s Bellevue Hospital, for example, moved its backup electrical systems to higher floors after Sandy. But those updates are expensive. Facilities might not have the resources to move generators, or they might not think redundant systems and backups are the best way to divvy up funding. “Unfortunately, with a lot of hospital administrators, there’s the feeling that they’ve never had a problem before, so why should they make a change. But then bad things happen.”\n\nHaving power outages in the news regularly, though, helps make people more aware of the problem, Johnson says. When they happen, it’s an opportunity to show administrators why they should be investing in emergency preparedness measures. “We can say, oh, we saw something happen at a hospital in Missouri, what would we do in that situation?”\n\n“we want to be prepared for this to happen again. We know this could be the new normal.”\n\nPreparedness for power outages caused by a hurricane and outages caused by intentional shutdowns, like those in California, need the same level of preparation, Koenig says. “It doesn’t make that much of a difference because you need to focus on patients, and the healthcare needs of patients.”\n\nJohn Muir Health is evaluating its response to the outage and determining what kind of changes it may need to make for the future, says Ben Drew, director of corporate communications. Winters Healthcare is doing the same: when the power came back, Kelsch headed to the store to pick up more emergency lighting and an additional generator. “It’s not that anything will happen this weekend, but we want to be prepared for this to happen again. We know this could be the new normal.”", "description": "There’s a planned blackout to cut the fire risk to your community just west of Sacramento — and now you are faced with a decision: do you keep your refrigerator full of vaccines running, or do you keep the community’s electronic health care records online? Your backup generator can’t do both.", "authors": ["Nicole Wetsman", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/ujFxu1sMRaYk5DuaAYHo8AqlmEo=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19319863/acastro_191025_3571_healthcare_powergrid_0001.png", "published_at": "2019-10-28"}