{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7618723/Father-murdered-student-Aiia-Maasarwe-21-says-hes-not-looking-revenge.html", "downloaded_at": "2019-10-28 00:37:25.168554+00:00", "title": "Father of murdered student Aiia Maasarwe, 21, says he's not looking for 'revenge'", "language": "en", "text": "The father of raped and murdered Israeli exchange student Aiia Maasarwe said he's not out for 'revenge' on his daughter's death.\n\nMs Maasarwe, 21, was beaten with a metal pole, raped, murdered and set on fire with a barbecue lighter and WD-40 by Codey Herrmann soon after getting off a tram just after midnight on January 16 this year in Bundoora, Melbourne.\n\nThe 21-year-old pleaded guilty, but her father Saeed Maasarwe said he didn't care what jail time the killer would face, reported The Guardian.\n\nMs Maasarwe (pictured), 21, was beaten with a metal pole, raped, murdered, and set on fire with a barbecue lighter and WD-40\n\nInstead, the bereaved 61-year-old, who is in Melbourne with his older daughter Noor for Herrmann's sentencing on Tuesday, said authorities should be doing more to stop crime rather than responding to the result.\n\nWhen speaking in Melbourne on Sunday at the launch of the medical fellowship created in his late daughter's honour, Mr Maasarwe said he wanted her to be remembered for her positive traits, rather than for her horrific and untimely death.\n\n'All the time she smiled. I remember all the time she thinks positive. And she was very, very sensitive,' he said.\n\n'Our compass is not revenge.\n\nMr Maasarwe (right) said he wanted his daughter (left) to be remembered for her positive traits, rather than for her horrific and untimely death\n\nMs Maasarwe's sister Noor (pictured with her father) said she feels unsafe in Melbourne\n\n'We think all the time, our mind, our compass is positive, is not negative.'\n\nWhile Mr Maasarwe expressed his disappointment in the court process citing the lifting of suppression orders allowing the gruesome details of his daughter's murder to be published, he and Noor, 23, said they were overwhelmed with support from the public.\n\n'It was very hard to see (the murder details) in the news. We already know what happened. It was hard enough and it's not someone I knew. It's my sister and she's also my best friend ... it was very, very hard,' said Noor.\n\nSupreme court judge Elizabeth Hollingworth lifted the suppression order claiming transparency was needed to explain the sentence she would later hand out.\n\nMs Maasarwe (pictured) attended La Trobe University in Melbourne\n\nMs Maasarwe's killer Codey Herrmann is pictured as he arrived at the Supreme Court of Victoria in Melbourne\n\nNoor also said she felt unsafe in Melbourne and would not be returning.\n\n'I feel very unsafe here,' she said, according to the Daily Telegraph.\n\n'I still see on the news that women in Melbourne are getting raped and murdered on the street — this shouldn't be happening in the first place.\n\n'That was the very last minute she was. I don't want her to be remembered as the victim of this crime.'\n\nThe inaugural fellowship was warded to senior paediatrician Khadra Salami (pictured centre, between Noor and Saeed)\n\nThe inaugural fellowship has been awarded to senior paediatrician Khadra Salami to complete two-year paediatric bone marrow transplant training program in Jerusalem.\n\nIt aims to ensure Palestinians living in the West Bank and Gaza can access the same level of health care to those living in Israel.\n\nIt is hoped $500,000 will be raised by Australians for the ongoing fellowship.\n\nThe Victorian Government and La Trobe University also announced a jointly-funded Aiia Maasarwe Scholarship for financially disadvantaged students.\n\nIt is open to an undergraduate in any area of study, while the PhD research program would address the safety of women and girls, especially on public transport.", "description": "Aiia Maasarwe was beaten with a metal pole, raped, murdered, and set on fire with a barbecue lighter and WD-40 soon after getting off a tram just after midnight in January this year in Melbourne.", "authors": ["Charlotte Karp For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/13/20244366-0-image-a-19_1572182393423.jpg", "published_at": "2019-10-27"}