{"pub": "fox", "url": "https://foxnews.com/entertainment/gwen-stefani-blake-shelton-relationship-divorce-gavin-rossdale", "downloaded_at": "2019-10-09 18:33:44.539431+00:00", "title": "Gwen Stefani says Blake Shelton relationship got her over her divorce from Gavin Rossdale", "language": "en", "text": "Gwen Stefani says that she’s spent the last four years with Blake Shelton getting over her ex, Gavin Rossdale.\n\nThe former “No Doubt” singer is featured on the November cover of Shape magazine, where she opened up about her relationship with the country singer, whom she began dating in 2015 after her high-profile split from Rossdale.\n\n“I feel as if I spent the last four years healing—you know, trying to build my life again,\" she told the outlet. \"Having a best friend like Blake to help me do that has been one of the greatest gifts.\"\n\nNICK JONAS JOINS 'THE VOICE' AS A COACH FOR SEASON 18, VOWS TO DEFEAT BLAKE SHELTON\n\nShelton and Stefani got together when they were both coaches on “The Voice” in Season 9. At the time, she was divorcing her husband of more than a decade and he was divorcing his wife of four years, Miranda Lambert. Since then, the duo has been inseparable, with Shelton even taking on responsibilities with her three kids, Kingston, 13, Apollo, 5, and Zuma, 11.\n\nThey’re currently working on “The Voice” Season 17 together in addition to Stefani's many other duties.\n\nBLAKE SHELTON CELEBRATES GWEN STEFANI'S 50TH BIRTHDAY ON SOCIAL MEDIA: 'I LOVE YOU SO MUCH'\n\n“Balance is the hardest thing, but it's also the most important—being with my family, having time with Blake where we just watch movies,” she explained. “It seems like, with your career, you have to keep swimming, keep moving, or else you're going to look back and go, 'Shoot, it's over.' I don't like feeling like that. I want to do creative things when I want, and I want to stop chasing all the time. It's hard, but I'm really enjoying being in the moment.\"\n\nStefani made a big move toward balancing her workload this week when she announced she will not return as a coach for Season 18 of the hit reality competition.\n\nThe news comes after Nick Jonas was revealed to be a new coach on the singing competition series. He joins Shelton, John Legend and Kelly Clarkson.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nInstead, Stefani, 50, will focus on the final dates of her \"Just a Girl\" Las Vegas residency at Planet Hollywood's Zappos Theater in February and May 2020.\n\nFox News’ Sasha Savitsky contributed to this report.", "description": "Gwen Stefani says that she’s spent the last four years with Blake Shelton getting over her ex, Gavin Rossdale.", "authors": ["Tyler Mccarthy"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/Blake-Shelton-Gwen-Stefani-Getty.jpg", "published_at": "2019-10-09"}