{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/ursula-le-guins-earthsea-may-again-become-a-tv-mini-series", "downloaded_at": "2019-09-05 07:09:33.481079+00:00", "title": "Ursula Le Guin's Earthsea May Again Become A TV Mini-Series", "language": "en", "text": "A crop of an Earthsea illustration by Charles Vess for a collection of Ursula Le Guin’s books. (Image: Amazon)\n\nBefore Ursula Le Guin passed away in 2018, she agreed to give producer Jennifer Fox the rights to one of her most popular literary works, Earthsea. Now, it looks like Fox is taking a big step forward in using those rights.\n\nDeadline reports that the producer has now partnered with A24 to bring Earthsea to TV screens (rather than a movie, which was previously reported).\n\n“Ursula Le Guin is a literary legend with a huge fan base and her work has been translated into practically every written language on the globe,” Fox said in a statement given to Deadline. “She is second only to Tolkien in influence in this genre, and before she died last year, she agreed to put her most beloved work in my hands. This project is, therefore, a sacred trust and priority for me as well as an opportunity to create an iconic piece of American culture.”\n\nWritten over several decades, across multiple novels, short stories and poems, Earthsea is Le Guin’s answer to J.R.R. Tolkien’s The Lord of the Rings, an epic fantasy tale set across thousands of islands where people use magic to tell an introspective, political, human story.\n\n“Ursula long hoped to see an adaptation of Earthsea that represented a collaboration between her ideas and words and the visual storytelling of others,” Theo Downes-Le Guin, Ursula’s son, told Deadline. “I feel very fortunate that, with Jennifer Fox and A24, we have a bedrock of producing and development experience that can bring the sweeping narrative and moral truths of my mother’s work to screen.”\n\nWith Fox producing and A24 financing, the next step is finding a network or streaming service that’s willing to go along for the ride. One place you’d imagine that wouldn’t happen would be Syfy — which already aired an Earthsea adaptation back in 2004, which was not a critical success and was more or less disowned by Le Guin.\n\nHopefully, Fox and her team can do the dearly missed writer justice this time around.\n\nWe’ll bring you more on the plans for the Earthsea TV series as we learn them.", "description": "Before Ursula Le Guin passed away in 2018, she agreed to give producer Jennifer Fox the rights to one of her most popular literary works, Earthsea. Now, it looks like Fox is taking a big step forward in using those rights....", "authors": ["Tegan Jones", "Sarah Basford"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/mwgnq1k6t7o0yni5od10.jpg", "published_at": "2019-09-05"}