{"pub": "wsj", "url": "https://marketwatch.com/story/this-simple-portfolio-strategy-will-help-retirees-if-a-recession-hits-2019-09-22?mod=rsswn", "downloaded_at": "2019-09-23 04:27:04.124136+00:00", "title": "This simple portfolio strategy will help retirees if a recession hits", "language": "en", "text": "Don’t miss these top money and investing features:\n\nMoney and investing features popular with MarketWatch readers this past week include a report on how retirees should prepare their investments for a recession — and the simplicity of the strategy may surprise you. Plus, check out other timely stories on navigating recession, retirement, and risk in ways that prepare and protect your portfolio. Plus, read about 10 colleges that are helping young people move up the economic ladder, and watch a report about investing in real estate without a major financial outlay.\n\n— Jonathan Burton\n\nINVESTING NEWS & TRENDS\n\nHere’s how retirees should plan for an imminent recession\n\nA recession doesn’t automatically lead to losses in your portfolio.\n\nHere’s how retirees should plan for an imminent recession\n\nTwo-thirds of these corporate insiders now expect a U.S. recession by the end of 2020\n\nFading CFO optimism is a warning sign for U.S. stocks and the economy, writes Mark Hulbert.\n\nTwo-thirds of these corporate insiders now expect a U.S. recession by the end of 2020\n\nMillennials share their retirement plans on Twitter — let’s just say it’s not good\n\nMost young adults don’t see retirement in their future.\n\nMillennials share their retirement plans on Twitter — let’s just say it’s not good\n\nThis broad-based ETF is outperforming the S&P 500 while guarding against declines\n\nThe iShares Edge MSCI Min Vol USA exchange traded fund has held up well during stock market weakness.\n\nThis broad-based ETF is outperforming the S&P 500 while guarding against declines\n\nMomentum stock strategies are down — but not out\n\nMomentum strategies have never performed well during periods of high volatility, writes Mark Hulbert.\n\nMomentum stock strategies are down — but not out\n\nWhy it pays to be cautious about stocks when corporate mega-mergers come in waves\n\nA flurry of M&A activity typically spells trouble for the stock market overall.Why it pays to be cautious about stocks when corporate mega-mergers come in waves\n\nTrade wars and tariffs aren’t the biggest culprit if stocks stumble from here\n\nU.S. economy’s growth rate should be investors’ main focus.\n\nTrade wars and tariffs aren’t the biggest culprit if stocks stumble from here\n\nWhy your financial adviser may decide to charge you more money\n\nAdvisers need to have clear communication and a solid rationale for a fee hike, writes Morey Stettner.\n\nWhy your financial adviser may decide to charge you more money\n\nWorkers would get money and voting power under this radical profit-sharing idea\n\nDividend-paying ‘inclusive ownership fund’ offers employees a leg up as the pay gap widens.\n\nWorkers would get money and voting power under this radical profit-sharing idea\n\nThese 10 solid U.S. colleges prove you don’t need Harvard or Yale to achieve the American Dream\n\nState and local public universities help low-income kids move into the middle class and beyond.\n\nThese 10 solid U.S. colleges prove you don’t need Harvard or Yale to achieve the American Dream\n\nIndex funds are the new titans of Wall Street\n\nFor the first time, index funds are the new kings on Wall Street. WSJ investing reporter Justin Baer explains how passive investing outpaced stock-picking rivals.\n\nIndex funds are the new titans of Wall Street\n\nHow to invest in real estate without buying a house or rental property\n\nThere are lots of ways to invest in real estate without taking on a huge mortgage or handing over a giant down payment.\n\nHow to invest in real estate without buying a house or rental property", "description": "These money and investing features hit home with MarketWatch readers this past week.", "authors": [], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GS349_climb__ZG_20181024124932.jpg", "published_at": "2019-09-22"}