{"pub": "usatoday", "url": "https://usatoday.com/story/opinion/2019/10/19/obamacare-left-healthy-folks-republicans-health-care-column/4022396002", "downloaded_at": "2019-10-19 11:30:59.778501+00:00", "title": "Republicans still have no clue how to help Americans that Obamacare left behind", "language": "en", "text": "CLOSE Obamacare remains a bad deal for healthy folks who lack employer coverage, and Democrats are winning the debate on how to fix it, Robert Robb says. Brian Snyder, Arizona Republic\n\nObamacare isn't what was envisioned. But Republicans still don't have a better fix for health care than the more government Democrats are proposing.\n\nThe Obamacare marketplace has stabilized in Arizona and across the country.\n\nIt is worth noting what Obamacare is, and is not, now that it has stabilized. And how Republicans still don’t have a credible alternative to the march of Democrats toward ever greater government involvement in health care.\n\nIn 2018, there was just one company in Maricopa County, Arizona, offering Obamacare policies and a scramble was on to get any policies offered in the state's rural counties.\n\nNext year, reportedly there will be five companies offering plans in Maricopa. Pima will have three.\n\nEight rural counties are likely to have only one provider, but they aren’t facing the prospect of none.\n\nAfter skyrocketing in the early years, Obamacare premiums leveled off for this year and are expected to remain so next.\n\nThe marketplace is now a safety net\n\nArizona’s experience is shared in most parts of the country. The turbulence in the Obamacare marketplace appears to have settled down.\n\nBut now that the Obamacare marketplace has stabilized, it is different than originally envisioned.\n\nAs envisioned, the exchanges were to be an alternative to employer-provided health insurance for everyone. Those with pre-existing conditions wouldn’t be excluded. Everyone would be required to have health insurance and everyone, irrespective of medical risk, would pay the same.\n\nTime to be straight with voters: How would Warren pay for 'Medicare for All'? Enough evasion, it's past time for answers.\n\nThat’s not what Obamacare turned out to be. Instead, it is a government-subsidized safety net for those with health problems but who earn too much to qualify for Medicaid.\n\nThe federal mandate never really succeeded in forcing healthy people into buying insurance that, from the beginning, was a lousy deal for them. And then Republicans eliminated the penalty for not doing so.\n\nHealthy people got left behind\n\nSupporters of the Affordable Care Act exulted in 2015 when the Supreme Court upheld the law's tax credits in state as well as federal marketplaces. Now the law faces a new legal threat. (Photo: JIM LO SCALZO, EPA-EFE)\n\nIn Arizona, more than 80% of those purchasing an Obamacare policy received a premium subsidy from the federal government.\n\nAnd given the high deductibles in Obamacare policies, even subsidized they aren’t a very good deal for those without current or chronic health problems. The healthy are still shunning the Obamacare market.\n\nObamacare generally outlawed health insurance policies that would make sense for everyone else. Healthy people can’t be charged less. All policies have to cover a large suite of benefits, irrespective of whether the customer needs or wants them.\n\nThe Kaiser Family Foundation estimates that 27% of potential private insurance customers have what, in the previous regimen, would have been considered a disqualifying pre-existing condition. That leaves a lot of people unserved by the individual health insurance market as reshaped by Obamacare.\n\nThe answer for Democrats is, of course, more government. Either have government take over at least the financing of all health care. Or, at a minimum, have government offer an individual health insurance policy in competition with private insurers. The latter will make a difference only if it is also heavily subsidized with federal tax dollars.\n\nGOP doesn't have a real alternative\n\nRepublicans say they favor market-based alternatives centered in consumer choice. But they lack either the conviction, or the political courage, to actually offer any.\n\nThere cannot be a market-based alternative centered in consumer choice without medical underwriting and the ability to pick and choose among potential benefits.\n\nEven the well-off are impacted: I had a good job and insurance — but high health care costs still drove me to bankruptcy\n\nThat means that subsidizing the health care of the seriously or chronically sick has to be done entirely through the tax mechanism, not also through the premium mechanism. Any individual insurance market that charges the same irrespective of medical risk will be a bad deal for too many.\n\nThere are alternative ways to subsidize, entirely through taxes, the health care of those with pre-existing conditions who would be shut out of a medically underwritten individual market. But Republicans have given up attempting to design and sell one. Instead, they are pledging to keep the requirement that insurers accept all comers and sharply limit pricing according to risk.\n\nWith respect to Obamacare’s mandated benefits, Republicans are being cagey. The Trump administration is attempting through regulation to expand the ability to evade them, through association plans and what are called short-term limited duration plans. The Arizona Legislature passed a bill aligning Arizona law with the proposed expansion of the latter last session.\n\nPeople with serious health problems shouldn’t go without care or face financial ruin. Healthy individuals should have options in the individual health insurance market that are good, rather than lousy, deals.\n\nIf Republicans aren’t willing to propose, and publicly advocate, credible alternatives to accomplish both, the march toward government being the health care provider for all will steadily advance.\n\nRobert Robb is a columnist at the Arizona Republic, where this column originally appeared. Follow him on Twitter @RJRobb.\n\nYou can read diverse opinions from our Board of Contributors and other writers on the Opinion front page, on Twitter @usatodayopinion and in our daily Opinion newsletter. To respond to a column, submit a comment to letters@usatoday.com.\n\nRead or Share this story: https://www.usatoday.com/story/opinion/2019/10/19/obamacare-left-healthy-folks-republicans-health-care-column/4022396002/", "description": "Obamacare isn't what was envisioned. But Republicans still don't have a better fix for health care than the more government Democrats are proposing.", "authors": ["Robert Robb", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/08/12/USAT/88b3f931-9bb9-4189-abe6-8b9686bfb21e-XXX_FILE_USA_HEALTH_CARE_OBAMACARE.JPG?crop=4516,2541,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-19"}