{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/News/video/trump-slams-biden-rally-impeachment-inquiry-66205120", "downloaded_at": "2019-10-11 12:37:35.974583+00:00", "title": "Trump slams Biden in first rally since impeachment inquiry Video", "language": "en", "text": "Transcript for Trump slams Biden in first rally since impeachment inquiry\n\nPresident trump is using this impeachment to fire up his supporters. Overnight the president holding his first rally since that inquiry began. His sharpest attacks and some vulgarities leveled against Joe Biden. Take a listen. He was never considered a good senator. He was only a good vice president because he understood how to kiss Barack Obama's . All right, so let's bring in our chief white house correspondent Jonathan Karl at the white house. Jon, polls show a majority of Americans now support impeachment. The president seems to be feeling the heat there. Reporter: Cecilia, it was quite a performance last night. The president spoke about this impeachment inquiry in almost apocalyptic terms saying that Democrats and the radical left were trying to destroy American democracy and looked at his supporters and saying what they were trying to do is erase your vote like it never existed. You played one clip from how he went after Joe Biden but went on and on in deeply personal ways talking about Biden and his son hunter using the kind of language that most people would not let their children use and regarding the democratic leaders, he spoke about Nancy Pelosi saying, quote, she's either really stupid or she has really lost it so, again, this all coming, as you mentioned, polls are showing increasing public support for the impeachment inquiry. We've been talking about it this week. The white house says it's not going to comply with this investigation on capitol hill. That is not stopping Democrats from issuing an onslaught of subpoenas in the last few days including now to the energy secretary. Reporter: Energy secretary Rick Perry is among what I count 11 different subpoenas issued over the past week to state department officials, Perry, they want to talk to him and get information about his dealings with Ukraine. It's an all-out effort, and the question now, Cecilia, is, how hard will the administration work to block this -- the testimony of these various officials? As Pierre mentioned, ambassador yovanovitch who is a central figure in all of this expects to be able to testify this morning but we just don't know if there will be a last-minute effort to block her. Jon Karl, thanks.\n\nThis transcript has been automatically generated and may not be 100% accurate.", "description": "President Trump levied his sharpest attacks, and some vulgarities, against 2020 Democratic presidential candidate Joe Biden at a rally in Minnesota.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/191011_gma_karl2_hpMain_16x9_992.jpg", "published_at": "2019-10-11"}