{"pub": "investingcom", "url": "https://ph.investing.com/news/commodities-news/preciousgold-steady-as-trumps-impeachment-inquiry-stokes-riskoff-mood-57109", "downloaded_at": "2019-09-25 04:46:56.776650+00:00", "title": "PRECIOUS-Gold steady as Trump's impeachment inquiry stokes risk-off mood", "language": "en", "text": "PRECIOUS-Gold steady as Trump's impeachment inquiry stokes risk-off mood\n\nSept 25 (Reuters) - Gold prices were trading steady on\n\nWednesday, a touch below a nearly three-week high hit in the\n\nprevious session, as global equities dipped after U.S. lawmakers\n\nlaunched a formal impeachment inquiry into President Donald\n\nTrump.\n\nFUNDAMENTALS\n\n* Spot gold was little changed at $1,532.20 per\n\nounce, as of 0122 GMT. In the previous session, prices of the\n\nsafe-haven bullion climbed to their highest level since Sept. 5\n\nat $1,535.60.\n\n* U.S. gold futures GCv1 were down 0.1% at $1,539.5 per\n\nounce.\n\n* The dollar wobbled on Wednesday, while Asian stocks fell\n\nas impeachment inquiry into Trump increased the prospects of\n\nprolonged political uncertainty in the world's largest economy.\n\nUSD/ MKTS/GLOB\n\n* Democrats in the U.S. House of Representatives on Tuesday\n\nlaunched a formal impeachment inquiry into Trump, accusing him\n\nof seeking foreign help to smear Democratic rival Joe Biden\n\nahead of next year's election. * Trump delivered a stinging rebuke to China's trade\n\npractices on Tuesday at the United Nations General Assembly,\n\nsaying he would not accept a \"bad deal\" in U.S.-China trade\n\nnegotiations. * U.S. consumer confidence ebbed in September as an\n\nescalation in trade tensions fanned concerns about business and\n\nlabor market conditions, a potentially worrying signal for\n\nconsumer spending, which has been driving the economy.\n\n* The UK Supreme Court ruled on Tuesday that Boris Johnson's\n\ndecision to shut down parliament in the run-up to Brexit was\n\nunlawful, but a defiant prime minister said he disagreed and\n\nvowed that Britain would leave the EU by Oct. 31, come what may.\n\n* Saudi Arabia believes Iran conducted the recent attacks on\n\nits oil facilities and will consider a military response once\n\nits investigation is complete, the kingdom's minister of state\n\nfor foreign affairs said on Tuesday. * German business morale rose in September for the first\n\ntime in six months but Europe's largest economy is still likely\n\nslipping into recession as the U.S.-China trade conflict and\n\nBrexit bite, the Ifo economic institute said on Tuesday.\n\n* Bank of Japan policymakers discussed the need for the\n\ncentral bank to take a preemptive response to downside risks to\n\nthe economy and prices, minutes of the central bank's July 29-30\n\nmeeting showed on Wednesday. AHEAD\n\n0645 France Consumer Confidence Sept\n\n1000 UK CBI Distributive Trades\n\n1400 US New Home Sales-Units Aug\n\n\n\n", "description": "PRECIOUS-Gold steady as Trump's impeachment inquiry stokes risk-off mood", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/indicatornews_3_800x533_L_1412601605.jpg", "published_at": "2019-09-25"}