{"pub": "hotair", "url": "https://hotair.com/archives/ed-morrissey/2019/10/24/bojo-deal-parliament-lets-trade-deal-debate-time-election-seven-weeks", "downloaded_at": "2019-10-25 03:30:36.737359+00:00", "title": "BoJo to Parliament: Let’s trade Brexit-deal debate time for an election in seven weeks", "language": "en", "text": "Why not? The EU will make this very convenient timing by tomorrow, when they are expected to respond to the Benn Act letter by extending the Article 50 deadline to January 31. Since Parliament refused to approve Boris Johnson’s expedited timeline for consideration of the enabling act for his Brexit deal, Johnson has another offer on the table. He will not pull the bill and allow consideration over a longer time frame — but Parliament has to agree to a snap election in mid-December:\n\nI have written to Jeremy Corbyn: this Parliament must get Brexit done now or a NEW Parliament must get Brexit done so the country can move on pic.twitter.com/PekfFRsR9F — Boris Johnson (@BorisJohnson) October 24, 2019\n\nThe prime minister has written to Jeremy Corbyn saying he will give parliament one last opportunity to scrutinise his withdrawal agreement bill and “get Brexit done” by 6 November. But he will also table a motion under the Fixed-term Parliaments Act next Monday asking for an early general election. MPs would then vote on the motion the same day. In his letter, Johnson said: “An election on 12 December will allow a new parliament and government to be in place by Christmas. If I win a majority in this election, we will then ratify the great new deal that I have negotiated, get Brexit done in January and the country will move on.”\n\nThis is a bit of a change-up in two ways. First, Johnson had earlier indicated that he wouldn’t make any strategic plans or offers until after hearing from the EU about the extension. Apparently, he’s as convinced as everyone else that all 27 countries would rather approve the extension and stay out of internal British politics, rather than have one or two help Johnson out with a veto on an extension.\n\nSecond, Johnson clearly wanted this EU deal to be a take-it-or-leave-it offer to Parliament, rather than risk losing even more support as the details emerge. That’s pretty much a moot point anyway, now that his former DUP partners are howling over Johnson’s betrayal. DUP deputy leader Nigel Dodds warned that the Tories are risking a loyalist uprising in Northern Ireland as well as fueling the fires of reunification among republicans:\n\n“You are really in danger here of causing real problems with the Belfast agreement [their term for the Good Friday Agreement — Ed], the St Andrew’s agreement, the political institutions and political stability in Northern Ireland by what you are doing to the unionist community,” he told the Brexit secretary, Stephen Barclay, during an hour-long exchange in the House of Commons over the Northern Ireland protocol of the deal. “Please wake up and realise what is happening here,” he said. Dodds told Barclay to “take seriously” the warnings given by the chief constable of the Police Service of Northern Ireland on the BBC’s Newsnight on Wednesday. Simon Byrne has repeatedly warned of potential sectarian tensions because of Brexit, but the spotlight up until now has largely focused on republican dissidents and groups such as the New IRA, who have been responsible for a number of recent attacks, including a car bomb in Derry and the murder of the journalist Lyra McKee. “But similarly, from the loyalist community … identity is also important … our concern is also the loyalist community has at times shown it can mobilise quickly, bring large numbers of people on to the streets and engage in public disorder in support of their cause,” Byrne said.\n\nAn election could clarify matters, but will Parliament go along? Thus far Labour has been uninclined to pacify Johnson’s demand for an election, but that was in part because Johnson could have used it to create a default no-deal Brexit. If the EU acts as expected, the new government will be in place six weeks before the deadline. That should remove the main objection to elections when the issue got raised first last month.\n\nAnd let’s face it — the UK needs a new general election, and badly. Parliament hasn’t had confidence in its executive in months, and despite Johnson’s claim about the second-reading vote, still hasn’t shown any confidence in this deal. An election will give Johnson an opportunity to run on the basis of this deal or on no deal at all, while Jeremy Corbyn and Labour can run on staying in the EU. If Johnson wins, he’ll have his mandate to implement this bill. If he doesn’t, then Labour can form a government to either hold a new referendum or just walk away from Brexit altogether. Either way, the British electorate will finally get a say after multiple fumbled deals and contradictory promises, and they can elect a Parliament and by extension an executive that more closely reflects their thinking.\n\nJust because it makes sense and it allows the parliamentary system to work as intended doesn’t mean that it will happen. These days, that almost guarantees it won’t, and this isn’t going to be an exception:\n\nLabour appears poised to block Boris Johnson’s offer of a pre-Christmas general election on 12 December by telling MPs to abstain in Monday’s vote. The party has previously said that it would back an early election when a no-deal Brexit scenario could be firmly ruled out, and has twice rejected attempts by Johnson to go to the polls before 2022. But Jeremy Corbyn told the BBC he still wants to make sure a no-deal Brexit is taken off the table. It is understood that he will make a final decision on how to instruct MPs once the EU27 have confirmed what extension the UK will be offered. … Corbyn said: “No deal is a threat that Boris Johnson has been using all along, and indeed it’s included in his legislation that’s before parliament at the moment, the legislation that he’s paused.”\n\nTune in tomorrow for the next exciting episode of Bor & Jerry’s Excellent Deal Adventure, or Everything I Always Wanted to Know About Sussex But Was Afraid to Ask.", "description": "“Please wake up and realise what is happening here.\"", "authors": ["Ed Morrissey", "John Sexton", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/10/johnson-delay.png", "published_at": "2019-10-24"}