{"pub": "yahoo", "url": "https://yahoo.com/entertainment/jennifer-aniston-reveals-entire-cast-134528669.html", "downloaded_at": "2019-10-09 12:54:58.728888+00:00", "title": "Jennifer Aniston Reveals the Entire Cast of 'Friends' Reunited: 'We Laughed A Lot'", "language": "en", "text": "The 50-year-old actress reflected on her famous co-stars while on 'The Howard Stern Show.'\n\nThe Friends cast are actually friends! Jennifer Aniston opened up on The Howard Stern Show, in the show's first West Coast broadcast in 20 years from SiriusXM's Hollywood studio, about a recent dinner she had with her Friends co-stars and how they'll never be on a break.\n\n\"We just had dinner on Saturday. Yeah, the whole gang, everyone was there. [David] Schwimmer was in town and we all happened to have a window of time so we all got together,\" Aniston, who appeared in a recent selfie with co-stars Courteney Cox and Matt LeBlanc, revealed.\n\nThe dinner took place at Cox's house and the 50-year-old sitcom star reminisced, \"We laughed so hard.\"\n\nOf her co-stars, Cox, LeBlanc, Schwimmer, Lisa Kudrow, and Matthew Perry, Aniston says they all get along.\n\n\"No one in that crew annoyed you?\" Stern asked.\n\n\"Not one,\" Aniston replied, before fondly adding, \"Lightning in a bottle.\"\n\nAniston insisted that not only did the cast get along but they also worked together when it came to the subject of equal pay. The Friends co-star famously negotiated that they all be paid the same amount.\n\n\"We stood as a solitary unit and asked for the exact same, equal pay,\" she recalled. \"We were leading the charge, ahead of our time.\"\n\nThough Stern wanted to know about any crazy shenanigans the cast got up to at the dinner, Aniston said it was all very tame.\n\n\"Nobody got naked. It was very civilized. But we just laughed a lot,\" she said, before adding of the NBC sitcom, \"We all miss it every day. I would be nothing without it.\"\n\nSo does that mean a reboot is on the horizon? Not so fast.\n\n\"We would love it. I really think there's an idea that if there's a reboot of the show, it won't be even close to as good as what it was, so why do it? It would ruin it,\" she explained.\n\nFor more from the Friends cast, watch the clip below:\n\nRELATED CONTENT:\n\nReese Withersoon Says Jennifer Aniston Was Fascinated by Her Being a Mom at 23 When They Met on 'Friends'\n\nJennifer Aniston and Courteney Cox Have Rare 'Friends' Reunion With Matt LeBlanc\n\nCourteney Cox and Lisa Kudrow Reunited to Celebrate the 'Friends' 25th Anniversary\n\nRelated Articles:", "description": "The 50-year-old actress reflected on her famous co-stars while on 'The Howard Stern Show.'", "authors": ["Rachel Mcrady"], "top_image": "https://s.yimg.com/uu/api/res/1.2/gLMrKQIZVkIV5w2BzXvJjA--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/homerun/etonline.tv/cc24e93da7533eefe74d45492a1c258a", "published_at": "2019-10-08"}