{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/09/josh-hawley-calls-for-oversight-on-chinas-influence-on-american-colleges", "downloaded_at": "2019-10-10 01:48:01.110621+00:00", "title": "Josh Hawley Calls for Oversight on China’s Influence on American Colleges", "language": "en", "text": "Sen. Josh Hawley (R-MO) is calling on the United States Senate to investigate China’s influence on American education.\n\nAccording to a local news report, Sen. Josh Hawley is continuing his call for a federal investigation into China’s influence on American college campuses. Hawley’s concerns center on an education group called the “Confucius Institute,” a Chinese-government agency that has built partnerships with American colleges and universities.\n\nThe Confucius Institute is steeped in controversy. Critics have accused the organization, and by extension, the Chinese government, of seeking control over messaging at American universities. June Tuefel Dreyer, a professor at the University of Miami, claimed that the Confucius Institute told them that they are not allowed to discuss the Dalai Lama, Tibet, Taiwan, China’s military.\n\nMartin Davidson, chief executive of the British Council, told the New York Times in 2012 that the Confucius Institute bribes colleges with funding in exchange for control over the campus’ discourse on China.\n\n“The Chinese are very clear on what they are trying to achieve,” Davidson said at the time. “They want to change the perception of China — to combat negative propaganda with positive propaganda. And they use the word ‘propaganda’ in Chinese. But I doubt they have to say, ‘We’ll only give you this money if you never criticize China.’ The danger is more of self-censorship — which is a very subtle thing,”\n\nIn a letter to leaders at the University of Missouri and Webster University, Sen. Hawley argued that it is inappropriate for do business with an organization would ask them to censor speech.\n\nBut Confucius Institutes are more than a means of cultural exchange. As Li Changchun, a senior member of the Chinese Communist Party, stated in 2009, the Confucius Institutes are ‘an important part of China’s overseas propaganda set-up.’ Hanban is governed by the leaders of twelve Chinese ministries, including those handling foreign affairs, state media, and propaganda. Partnering universities sign contracts that prohibit them from ‘tarnishing the reputation’ of Hanban, and Hanban sends teachers and textbooks from China that are designed to promote a positive image of the PRC and suppress any discussion of the ‘three Ts’: Tibet, Taiwan, and Tiananmen Square. These Confucius Institutes are, in short, a tool for China to spread influence and exercise soft power in its rivalry with the United States.\n\nStay tuned to Breitbart News for more updates on this story.", "description": "Sen. Josh Hawley (R-MO) is calling on the United States Senate to investigate China's influence on American education.", "authors": ["Tom Ciccotta"], "top_image": "https://media.breitbart.com/media/2019/07/Josh-Hawley-Speech-640x335.jpg", "published_at": "2019-10-09"}