{"pub": "reuters", "url": "https://af.reuters.com/article/topNews/idAFKBN1W91E8-OZATP", "downloaded_at": "2019-09-24 13:58:41.823257+00:00", "title": "U.N. runs clubs for Libyan children, after conflict disrupts schools", "language": "en", "text": "Tripoli (Reuters) - Libyan mother Halima al-Miladi wants to keep her 7-year-old son distracted from the fighting in and around the capital Tripoli where they live.\n\nLibyan students play during the summer school programme at Ben Ashour school in Tripoli, Libya September 18, 2019. REUTERS/Ismail Zitouny\n\nSo she jumped at a chance for him to play football, draw, and play with other children at special clubs organised in the city’s schools by the United Nations.\n\n“I pushed my son to participate in the club away from the conditions that the country is going through,” she said.\n\nThis year, many classes were disrupted by the conflict as some school buildings were used as shelters for thousands of displaced people, leaving many children with nowhere to go.\n\nAround 1,000 Libyan children now attend such clubs, located in the centre of Tripoli, which is calmer than the south.\n\nIn April, commander Khalifa Haftar’s Libyan National Army (LNA) launched a military offensive to take control of Tripoli, home to the internationally recognised Government of National Accord (GNA), which was set up in 2016 after a U.N.-backed political deal.\n\nAt al-Jihad primary school in the Sooq Juma municipality, students practiced music and sports. A group of young children sat around a table, busy with handicrafts.\n\n“The children are affected by what is happening, and through these activities we have tried to integrate them and they have improved,” said Amal Ben Sasi, a counsellor at another school, the Ben Ashour school.\n\nGhada Faghi Hassan, the school principal, said teachers were giving donations to support the summer clubs.\n\n“We promised parents to cover the cost of breakfast and the teachers supported it because the club is for free,” Hassan said. Teachers are also financing entertainment and trips for the children.\n\nIbrahim Farah, an educational specialist at UNICEF, the United Nations Children’s Fund, said the summer club programme targeted 1,000 pupils in two municipalities.\n\nIn a briefing to the Security Council on Sept. 4, U.N. Libya Envoy Ghassan Salame said more than 100 civilians had been killed and over 300 injured, while 120,000 civilians had been displaced in the conflict since April 4.", "description": "Libyan mother Halima al-Miladi wants to keep her 7-year-old son distracted from the fighting in and around the capital Tripoli where they live.", "authors": ["Ahmed Elumami", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190924&t=2&i=1433315190&w=1200&r=LYNXMPEF8N0WX-OZATP", "published_at": "2019-09-24"}