{"pub": "yahoo", "url": "https://sports.yahoo.com/baker-mayfield-basically-dares-nfl-173551284.html", "downloaded_at": "2019-10-26 00:01:40.106117+00:00", "title": "Baker Mayfield basically dares NFL to fine him again", "language": "en", "text": "The NFL has decided to deal with its officiating crisis by silencing internal dissent. Or by at least trying to.\n\nThe league implemented its new approach — fining players for criticizing officials — last week, fining both Browns quarterback Baker Mayfield and Rams linebacker Clay Matthews for complaining about officiating. On Wednesday, Mayfield basically dared the league to fine him again.\n\nWhile complaining about his $12,500 fine during his weekly press conference on Wednesday, Mayfield reiterated concerns that sparked the fine in the first place.\n\nScroll to continue with content Ad\n\n“One, I would not say it was complaining when it was blatantly obvious,” Mayfield said. “I would say that is just stating facts. Freedom of speech, I thought that is OK, but I get fined for it. That is the league. That is what they do. They fine you for some ridiculous things. It is just how it is. There is a reason everybody is talking about it. It is not just me. It goes for every team. With how our team is, we are not going to get a lot of calls and we know that. Especially going into this week, there is no time to worry about it and no time to stress about it. Just play our game.”\n\nMayfield said he knew he’d be fined when complaining about the officiating after the Week Six loss to the Seahawks. He echoed that sentiment on Wednesday.\n\n“I knew I was going to get fined, but it needs to be said,” Mayfield said. “People have to be held accountable for their job. When it affects my job, it sucks because it is not in my control.”\n\nMayfield’s original fine happened simply because he said the officiating was “pretty bad today.” His more recent complaints about the fine and his reiterated concerns about officiating could result in yet another fine.\n\nStory continues\n\nWhether the league fines him again will show whether the league is serious about using the threat of monetary sanctions to get players to not say what everyone else is saying: The NFL’s officiating simply isn’t good enough, and the NFL isn’t doing nearly enough to fix the problem.", "description": "The NFL has decided to deal with its officiating crisis by silencing internal dissent. Or by at least trying to. The league implemented its new approach -- fining players for criticizing officials -- last week, fining both Browns quarterback Baker Mayfield and Rams linebacker Clay Matthews for complaining", "authors": ["Mike Florio"], "top_image": "https://s.yimg.com/ny/api/res/1.2/BRCmjnzVNxHAlEvStCAOuQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTMuNg--/https://s.yimg.com/uu/api/res/1.2/bJi6x2.t73LVR_ZFS0WqXQ--~B/aD0xMDcwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/profootballtalk.nbcsports.com/58e51b5d905d3d05f893f34c702d8d63", "published_at": "2019-10-24"}