{"pub": "indiatimes", "url": "https://indiatimes.com/news/india/how-india-may-lose-rs-13-lakh-crore-of-its-gdp-to-stubble-burning-and-firecrackers-in-5-years-363253.html", "downloaded_at": "2019-10-26 11:11:35.361602+00:00", "title": "How India May Lose Rs 13 Lakh Crore Of Its GDP To Stubble Burning And Firecrackers In 5 Years", "language": "en", "text": "India’s air pollution problem is only getting worse and there so not seem to be enough measures in place to get hold of the situation. The northern India suffers to a great extent because of toxic air pollution resulting from archaic agricultural practices, burning of firecrackers, industrial and vehicular emissions.\n\nThe phenomena is not only worrisome but also potentially fatal, suggest a new data.\n\nFarmers setting ablaze crop residue and the bursting of firecrackers during the festival of Diwali can cost the economy up to $190 billion (Rs 13 lakh crore), or 1.7 per cent of India’s GDP, over the next five years, says a study published in the International Journal of Epidemiology.\n\nBCCL\n\nThe loss is in terms of human cost. The study says that residents of India’s capital, New Delhi, and the neighbouring states of Punjab and Haryana together lose 19.2 million healthy man years due to stubble burning and firecrackers.\n\nThe researchers considered the responses of over 250,000 residents from a government survey that was conducted over 2013 and 2014 and found a correlation between surge in respiratory illnesses and NASA’s satellite imagery of stubble burning in the country.\n\nDon't Miss\n\nBCCL\n\nClose to 21 per cent of all acute respiratory illnesses in New Delhi, Punjab and Haryana can be attributed to stubble burning and bursting of firecrackers.\n\nChildren and elderly are at the greatest risk of respiratory infections than some section of the population. Also, men are slightly more hurt than women due to toxic air.", "description": "India’s air pollution problem is only getting worse and there so not seem to be enough measures in place to get hold of the situation. The northern India suffers to a great extent because of toxic air pollution resulting from archaic agricultural practices, burning of firecrackers, industrial and vehicular emissions.", "authors": ["Shweta Sengar"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Mar/how_india_may_lose_rs_13_lakh_crore_of_its_gdp_to_stubble_burning_and_firecrackers_in_5_years_1551860703_800x420.jpg", "published_at": "2019-03-06"}