{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/27/pete-buttigieg-channels-obama-expands-electorate-m", "downloaded_at": "2019-10-28 00:26:23.434618+00:00", "title": "'Build our movement': Surging Pete Buttigieg channels Obama, expands electorate", "language": "en", "text": "Pete Buttigieg is poised to do something no other Democratic presidential candidate has done before: open a campaign office in Dallas County, Iowa, before the state’s first-in-the-nation caucuses.\n\nThe decision to plant his flag in the booming Des Moines suburb is emblematic of the surging South Bend, Indiana, mayor’s strategy to engage voters — including disenfranchised Republicans and independents — who tend to get less attention than those living in the more urban bastions of liberal activism that traditionally serve as the biggest battlegrounds in the Iowa caucuses.\n\n“If he can win in areas like that, then theoretically he can challenge Joe Biden for dominance among that part of the Democratic ideological spectrum,” said pollster John Couvillon. “While a lot of the Democrats are fighting over the progressive wing, the moderate wing has not been much fought over and that is what I think Buttigieg is trying to do, and Dallas County is ground zero for that effort.”\n\nMr. Buttigieg has been riding high since the last presidential debate, where he was widely viewed as a big winner and was credited with making a strong case for why he should be viewed as the moderate alternative to Sen. Elizabeth Warren and her far-left vision for the nation.\n\nAn Iowa State University/ Civiqs poll released last week placed him second behind Ms. Warren in Iowa, where a strong showing could help him ease concerns over his experience as the mayor of a relatively small Midwest city and over whether the nation is prepared to elect a 37-year-old openly gay man to the White House.\n\nJeff Link, an Iowa-based Democratic strategist, said the Buttigieg camp’s decision to set up a shop in Dallas County as well as in nearby Ankeny, where he is the only 2020 Democrat with a campaign office, suggests he is taking inspiration from former President Barack Obama, who overcame questions about his experience in 2008 partly by expanding the electorate.\n\n“The suburbs are kind of a target-rich environment for people who didn’t caucus, and the Obama campaign knew if traditional caucus attendees were the only ones who showed up they would lose to Hillary [Clinton],” Mr. Link said. “So they had to change the makeup of the electorate, and they did it by going to the suburbs.”\n\nExit polls in 2008 found that more than 40% of voters were first-time caucus-goers.\n\n“It kind of seems Buttigieg is taking a page out of that book,” Mr. Link said of the strategy. “They don’t want to just rely on traditional caucus-goers.”\n\nIf that’s the case, Dallas County is swimming with potential new caucus voters.\n\nThe county added more than 24,000 people over the last decade, according to the U.S. Census, which found more than eight in 10 people living there are white and half have college degrees. The $87,700 median household income is $26,000 more than the statewide average.\n\n“It probably suits the profile of a Buttigieg voter pretty well,” Mr. Link said. “There is a likelihood of new voters out there because I think there are independents who before 2016 may have skewed Republican that are part of the shift going on not just in Iowa but across the country away from Trump and towards an alternative to Trump.”\n\nLike Ankeny to its east, the county is emblematic of the suburbs across the country that used to be reliably Republican, but would up powering the Democratic takeover of the U.S. House in the 2018 midterm elections.\n\nThat included Rep. Cindy Axne, who flipped control of the GOP-held seat in Iowa’s 3rd Congressional District. In the Iowa Statehouse, Democrats also picked up seats in the area.\n\nBen Halle, a spokesman for the Buttigieg Iowa operation, said opening the office is part of a statewide effort to reach caucuses-goers in every corner of the state.\n\n“We’ve seen tremendous grassroots support for Pete in Dallas County with supporters hosting their own house meetings, knocking on doors, and recruiting their own networks to join the campaign,” Mr. Halle said “We’ve got organizers based in Dallas County that are dedicated to organizing communities there, and our field office will serve as a home base for our organizers and our supporters to continue to build our movement.”\n\nThe rise of Mr. Buttigieg has coincided with the fall of former Vice President Joseph R. Biden, whose uninspiring campaign has prompted his supporters to rethink their choices.\n\nThat has provided an opening for Mr. Buttigieg to present himself as a more viable moderate alternative to Massachusetts Sen. Elizabeth Warren and her far-left vision.\n\nHe has started to more directly make the case by taking aim at Ms. Warren’s support for Medicare for All, challenging the Massachusetts Democrat to be more forthcoming about how she plans to pay for the program and arguing that people should be able to keep their private insurance if they are happy with it.\n\nMr. Buttigieg’s message could hit home with fiscally conservative and socially liberal voters living in the Iowa suburbs who feel alienated in the current polarized political environment, according to Bryce Smith, chairman of the Dallas County Democrats who said his research has found Mr. Buttigieg is the first candidate to open a pre-caucus office in the area.\n\nMr. Smith said some voters in the area are less interested in backing a candidate running on far-left promises of dramatic change than they are in supporting a candidate who is promising to unite the nation and restore a sense of normalcy to the office.\n\n“A lot of parents don’t see [Mr. Trump] as a role model for their kids,” Mr. Smith said, contrasting that to Mr. Buttigieg’s “Midwest style.”\n\n“People can tell that he is not from the coast and that I think resonates with some people in the heartland and they say he understands where I come from and he will remember that at the decision table,” he said. “Some of those other candidates have more of a hurdle to get over when it comes to explaining their position and how they make an impact on middle America.”\n\nMr. Smith said Democratic Party registration has jumped 25% since 2014, while Republican registration has increased 2% over that time.\n\nMr. Couvillion said Mr. Obama in 2008 and Jimmy Carter in 1976 proved that from time to time in politics, candidates are rewarded for the sort of outside-the-box thinking that the Buttigieg team is deploying.\n\n“Those are two examples of people who didn’t play the traditional Democratic game and won the nomination,” he said.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Pete Buttigieg is poised to do something no other Democratic presidential candidate has done before: open a campaign office in Dallas County, Iowa, before the state's first-in-the-nation caucuses.", "authors": ["The Washington Times Http", "Seth Mclaughlin"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/16/APTOPIX_Election_2020_Pete_Buttigieg_42890.jpg-2ee0f_c0-269-4902-3128_s1200x700.jpg?4efd1e33965669c396300ed0c8e1d1a1accb357c", "published_at": "2019-10-27"}