{"pub": "reuters", "url": "https://widerimage.reuters.com/story/its-a-dogs-life", "downloaded_at": "2019-10-15 08:05:39.333128+00:00", "title": "It's a dog's life", "language": "en", "text": "Advertisement\n\nVenezuelans struggling to feed their families let alone pets amid an unprecedented economic crisis are increasingly dumping scrawny animals in streets, parks and makeshift shelters.\n\nAt one dilapidated sanctuary in the hills outside Caracas, hundreds of skinny dogs bark and claw through wire mesh to scavenge for food in the streets and forest nearby. \"The crisis has hit hard,\" said Maria Arteaga, 53, who began looking after stray dogs in her own home before founding the Famproa shelter in Los Teques. \"People are abandoning their dogs because they can't afford food and because they're leaving the country.\"\n\n\"Tomy arrived at the shelter on a Sunday two months ago. A man on a motorcycle left him saying that he had found him in the middle of the street and did not want to leave him there, but strangely, the man knew his name,\" said Maria Silva who takes care of dogs at the shelter. Every few hours, vehicles pull up to hand over dogs, including pedigrees. Volunteers arrive daily to donate and help distribute food to the animals.\n\n1 / 27 Slideshow Petete has spent over eight years in the shelter. \"When the dog arrived, he had worms and sores on a leg. It was hard to heal and even when it did, his leg never fully functioned again. He is loving, but only until it is meal time, because then he fights with everyone and bites anyone who comes close,\" said Maria Silva. \"Sonrisa (smile) was given that name, because when someone approached her, she was frightened as if she were being beaten, but showing her teeth as if were smiling,\" said Maria Silva. Sonrisa died the following week after the photo was taken. About a year ago Mia was left at the door of the shelter. \"She was adopted by a family, but they later returned her because supposedly she did not adapt to living in an apartment,\" said Maria Silva. Aguja (needle) was given the name because of the shape of her body. She is skinny and long. \"She is very happy and loves to jump at people so that they carry her and caress her like a baby,\" said Maria Silva. \"Someone left Lucho with his three brothers in a cardboard box outside the shelter a year and a half ago. Two of them died and one was adopted by a family. He is a favorite at the shelter but he is an escape artist, he has the ability to get out of anywhere,\" said Maria Silva. Tuneco was ill and died the following week after the photo was taken. \"Pequi is neither loving nor aggressive, she is indifferent. She has spent almost a year in the shelter,\" said Maria Silva. \"But it is impossible to lock her in because she escapes.\" \"Bolibomba arrived at the shelter two years ago and is very playful. She loves water. Whenever she can, she gets inside a bucket or bowl with water. If she lived in a house with a pool, she would never come out of it,\" said Maria Silva. \"Nazareth is both independent and feisty. She barks at all dogs and has a bad temper. When it is mealtime, no one can be near her,\" said Maria Silva. \"Minnie is not very loving but is one of the leaders in the shelter. She always bites people's feet when they walk by her,\" said Maria Silva. Ojitos (eyes) has been given her name because she has blue eyes. \"She arrived at the shelter two years ago and from the very first moment has always been very loving. She never fights with the others. She has been offered up for adoption on many occasions, but no one wanted to keep her,\" said Maria Silva. Duke was left tied outside the shelter about five months ago. \"He did not have a bad temper, but the bigger dogs always attacked him,\" said Maria Silva. The week after being photographed, he escaped from his kennel and was killed during a fight. Pichurra is very old and has been at the shelter for a long time. \"She is extremely calm, never fights with anyone, nor does she bark. In fact, at mealtimes the volunteers have to be very alert, because if any other dog steals her food she would not complain,\" said Maria Silva. Paton (big foot) has been given the name because his legs are very long making him a little clumsy when he walks. \"Everyone who comes to the shelter, falls in love with him because he is extremely loving, always happy and wants to play. He always wants to be near people,\" said Maria Silva. Celo (on heat) was given her name because she was left tied outside the shelter in the middle of her fertile stage. \"When the volunteers arrived, the place was a mess. All the males, although they were castrated, were going crazy,\" said Maria Silva. Cachorron (big puppy) was given his name because he never matured and behaves as if he were still a puppy. \"He does not like to leave the area where he sleeps. Even if the door was left open, he would not go out in the street. On one occasion a family wanted to adopt him, but it was impossible to make him walk out of the shelter,\" said Maria Silva. Gusaniao (wormy) was left almost dead in a box outside the shelter a week before being photographed. \"He was full of worms, literally, eating him alive, but after a week of medication and care, he finally started to eat well and is recovering,\" said Maria Silva. Gus is one of the dogs that has been at the shelter for a very long time. \"There was a family that used to love him, and brought him food every day, but since two months ago they have not returned to the shelter. He has a bad temper and likes to fight with others during mealtime,\" said Maria Silva. \"Alvaro was brought to the shelter by a neighbour called Alvaro after he saw a car run him over. He was in a very bad condition and almost died, but instead of putting him down, it was decided to give him a few days and wait to see if he could recover,\" said Maria Silva. Atro was given his name for Atropelledo (run over). \"A few years ago someone left him outside the shelter after he was hit by a car. He underwent several surgeries to try to save his leg, but it was not possible. Since then he has been very lonely, he does not like to interact with other dogs,\" said Maria Silva. Brisa was given her name because she was found in an area called Brisa de Oriente. \"She was one of the most spoiled in the shelter, but barks at everything all the time,\" said Maria Silva. Two days after being photographed, Brisa was adopted by a family. \"Sonrisa (smile) live outside the shelter and likes to interact with everybody, but she barks a lot. She is one of the guard dogs of the place,\" said Maria Silva El Mocho (mutilated) was given that name because he lost a leg after being ran over. \"He used to live in a kennel inside the shelter, but a few months ago escaped and now likes living on the street in front of the shelter. He has a very bad temper, he always runs behind bikes, barks at cars and bites people who walk near him,\" said Maria Silva. Oscar's name is a reference to Oscar Mayer, the hot dog brand. \"He has spent many years living in the shelter, but is super grumpy, barks a lot, and if he does not know someone he will attempt to bite. Oscar does not like to interact with other dogs and the only way to see him happy is when somebody gives him bread to eat or when he plays with plastic bottle,\" said Maria Silva. Mama (mother) was given that name because she was left in front of the shelter with her puppies. \"All of them were taken for adoption but nobody wanted to take her. Mama is old and almost blind so she does not leave the place where she sleeps and does not share with any other dogs,\" said Maria Silva Pastora (shepherd) was given that name because she looks like a German shepherd. \"She is very calm and never fights with anyone, but she is afraid of people. When someone approaches her, she immediately reacts as if they were going to beat her,\" said Maria Silva. \"Carita arrived at the shelter almost dead and completely covered with scabies, to the point that her face bled. Carita is very aggressive, attacks any dog who is close and during fights has killed several. So now she has to live locked in a kennel,\" said Maria Silva.\n\nStory Though Arteaga does not have a formal register, she has seen an increase in the number of dogs coming in recent months, with nine poodles dropped off just in the last two weeks.\n\nMancha (stain) was given that name because of the black spot on her face. \"She has bitten almost everybody in the shelter. She was not loving, on the contrary, she fought everyone and at mealtime nobody could be near her,\" said Maria Silva. Mancha died the following week after the photo was taken. Venezuelans themselves are suffering shortages of food and medicines, and are finding salaries wrecked by triple-digit inflation. A 20 kilogram bag of dog food costs around $50 at the black market exchange rate, nearly double its price in the United States and out of reach for many in Venezuela where the minimum wage is $23-a-month.\n\nEnfermera (nurse) was given that name because she was rescued by a nurse outside a hospital. \"She suffered a stroke and although she never recovered completely, she is a very good guard dog. She lives outside of the shelter and when someone approaches, she starts barking,\" said Maria Silva. So sanctuaries like Arteaga's are proliferating, while ever more stray dogs are to be found on the streets. Pet stores are ever more expensive or empty. The pets' plight comes despite pushes in the past by the socialist government to protect animals' rights.\n\nCucurucha has never been given up for adoption because she is very nervous. When someone approaches, she begins to whine and react immediately. She never fights with anyone, but she likes stealing food from other dogs,\" said Maria Silva. In 2013, for example, President Nicolas Maduro set up Mission Nevado - named for independence hero Simon Bolivar's dog - to rescue and protect strays. But now even police are rationing food for sniffer dogs.\n\nPintica (spotty) was given that name because of her skin. \"She was the posh girl of the shelter, she didn't like to get her feet wet. All dogs used to attack her and because of that, she did not like to come out of her home,\" said Maria Silva. Pintica died the following week after the photo was taken. On one recent day, systems engineer Maria Rodriguez, 33, came across a stray dog in Los Teques and her 12-year son begged her to keep it to accompany their border collie. “Sadly our income isn't enough for us to eat - so how can I give food to two or three dogs?\" she said, after dropping the animal off at Arteaga's sanctuary.", "description": "Venezuelans struggling to feed their families let alone pets amid an unprecedented economic crisis are increasingly dumping scrawny animals in streets, parks and makeshift shelters.", "authors": ["Carlos Garcia Rawlins", "Girish Gupta"], "top_image": "https://photos.wi.gcs.trstatic.net/WBTnOVC7qqta06gXHeKsQ57SZivAaNUTPlx22fBA-6PbI6WuJseLMqx9-qG4VlesK-yz77u1oDKT0xsZnzDLcrIczZf6mMeaaSBwz432HSd82HiLZ_xdRu257cGl1pdO", "published_at": "2019-10-15"}