{"pub": "businessinsider", "url": "https://businessinsider.com/russia-hacked-fbi-to-prevent-tracking-russian-spies-us-report-2019-9", "downloaded_at": "2019-09-16 23:25:49.359925+00:00", "title": "Russia hacked the FBI to prevent the bureau from being able to track Russian spies in the US", "language": "en", "text": "The Russian government hacked into the FBI's communication system to stop the bureau from being able to track Russian spies working in the US, Yahoo News reported in a bombshell investigation published Monday.\n\nThe US in 2012 became aware of \"the full gravity\" of Russia's ability to breach certain types of secure communications and track devices used by FBI surveillance teams, the report said. In addition to fearing that the Russians may have gained access to US intelligence channels, officials also believed that Russian spies could locate undercover FBI surveillance teams and the substance of FBI communications.\n\nThat would have not only enabled the Russians to evade surveillance and communicate with human sources, but given them the opportunity to collect information about their pursuers, Yahoo News reported. It also prompted concerns among officials that there was a Russian asset lurking within the US intelligence community.\n\nThe Russians first breached the FBI's communication systems in 2010, after the arrest and exposure of a group of Russian spies in the US, Yahoo News said. That year, the FBI began investigating Russia's efforts to recruit US assets; one of the foremost targets was Carter Page, who later served as a foreign-policy aide on President Donald Trump's campaign.\n\nRead more: The acting director of national intelligence is withholding a mysterious whistleblower complaint of 'urgent concern' that may involve Trump\n\nThe FBI informed Page in 2013 that the Russians were trying to cultivate him, but Page ignored their warnings and even publicly boasted about his connections to high-ranking Russian government officials.\n\nThe Russians are also said to have breached the backup communication channels the FBI used, something one former senior counterintelligence official told Yahoo News the US \"took extremely seriously.\"\n\nThe investigation found that Russia's hack of the FBI's communication systems was a key reason the Obama administration kicked out 35 Russian diplomats and closed two Russian diplomatic facilities in December 2016.\n\nPresident Barack Obama said the measures were in retaliation for Russia's interference in the 2016 election, but Yahoo News reported that the US also wanted to close those two compounds because they were critical to Russia's efforts to intercept FBI communications.\n\nRead more: Putin just asked Interpol to find a Russian spy in the US, days after the media revealed his whereabouts\n\nRussia and the US have ramped up their counterintelligence and cybersecurity operations against each other in recent years as tensions between them mount.\n\nIn particular, the US has recently targeted Russia's electrical grid and placed \"potentially crippling malware\" within the Russian system, The New York Times reported in June. Power grids have long been the focus of cyberattacks, but the US's operation is the most aggressive yet and meant to serve as a warning to Russia, as well as position the US to carry out additional cyberattacks in the event of a conflict with Moscow, the report said.\n\nThe Times described two administration officials as saying there was \"broad hesitation\" to brief Trump in much detail about the operation, in part because of concerns about how Trump would react, or that he would shut down the operation or discuss it with foreign officials.\n\nTrump's disclosure of classified information to two Russian officials in an Oval Office meeting in 2017 contributed to the US's decision to extract a top CIA asset in Russia shortly after, CNN reported last week.\n\nOther US media outlets subsequently published key identifying details about the asset, and Russian state-sponsored media later said it had the intelligence operative's name. Shortly after that, the Russian government filed a request with Interpol for more information about the spy.", "description": "The stunning breach prompted concerns among officials that there was a Russian asset within the US intelligence community, Yahoo News reported.", "authors": ["Sonam Sheth"], "top_image": "https://amp.businessinsider.com/images/58e7f76677bb70b51a8b48fb-2732-1366.jpg", "published_at": "2019-09-16"}