{"pub": "arynews", "url": "https://arysports.tv/messi-and-ronaldo-wouldnt-do-what-rugby-players-do-jones", "downloaded_at": "2019-10-22 13:22:07.193241+00:00", "title": "Messi and Ronaldo wouldn’t do what rugby players do: Jones", "language": "en", "text": "England coach Eddie Jones contrasted what he said was rugby’s down to earth attitude with that of football superstars Cristiano Ronaldo and Lionel Messi as he lauded All Blacks boss Steve Hansen ahead of Saturday’s blockbuster World Cup semi-final.\n\nJones and Hansen are two of the most successful coaches in the modern game, with the New Zealander looking to guide the All Blacks to a third straight World Cup title at Japan 2019 and fourth in total.\n\nBut if he is to do that his side must first beat a resurgent England in Yokohama this weekend.\n\nThe coach of his native Australia when they lost the 2003 World Cup final to England and the mastermind behind Japan’s shock victory over South Africa in England four years ago, Jones is no stranger to pre-match “mind games”.\n\nBut there has been little in the way of verbal fireworks from former Brumbies boss Jones at this tournament, with the England coach delivering a glowing assessment of Hansen’s record.\n\n“To start with, Steve’s a good bloke,” said Jones. “That’s number one. Secondly, he’s got a great record.\n\n“Super Rugby with the Crusaders when we first started coaching against each other, followed by Wales, followed by New Zealand. You don’t get a better record than that.\n\nJones said it was rugby’s culture of “respectful relationships” that set it apart from other codes.\n\n“You just have to see this tournament to know what it’s done because the things that have happened don’t happen in other sports.\n\n“You’ve got the Canadian and Namibian blokes cleaning up the ground (after their pool match in Kamaishi was cancelled because of Typhoon Hagibis).\n\n“Could you imagine Ronaldo or Messi doing that if Barcelona or Real Madrid gets a wash?”\n\nHansen was equally complimentary about Jones’s work in transforming an England side who suffered an embarrassing first-round exit on home soil at the 2015 World Cup into genuine title contenders four years later.\n\n“Eddie’s done a fantastic job with England — they’ve got a harder edge about them now,” Hansen said.\n\n“Eddie’s been part of a winning World Cup team with South Africa (2007), he’s had the disappointment of losing to England when he was coaching Australia (2003) but to get to the final is being successful anyway.”\n\n– ‘Loves the game’ –\n\nHansen, in a reference to the stroke Jones suffered six years ago when in charge of Japan, added: “I respect his passion for the game — he loves the game.\n\n“He’s got a work ethic second to none. He put himself in hospital, he’d worked that hard. He just loves the game and anyone who loves the game gets my support.”\n\nHansen said the verbal sparring that went on between opposing coaches should not be taken too seriously\n\n“It’s a game of footy, it’s not life or death. It’s like when you play against your brother or sister. It’s important, but it’s not life threatening.\n\n“It’s definitely closer than you guys (the media) perceive. You see some of the banter which is really only to help promote the game as being ‘cor, these guys don’t like each other’, which couldn’t be further from the truth,” he added.\n\n“Rugby’s a special game and those of us who have been around for long enough understand that the game is bigger than everybody else.”\n\nComments\n\ncomments", "description": "England coach Eddie Jones contrasted what he said was rugby's down to earth attitude with that of football superstars Cristiano Ronaldo and Lionel Messi", "authors": [], "top_image": "https://arysports.tv/wp-content/uploads/2019/10/d8d29dbdd7ec0561c13532a493cd4733.jpeg", "published_at": "2019-10-22"}