{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/20/joseph-mifsud-identity-called-trump-russia-probe-o", "downloaded_at": "2019-10-20 23:24:07.256936+00:00", "title": "Mystery of Joseph Mifsud key to Trump-Russia probe origin", "language": "en", "text": "ANALYSIS/OPINION:\n\nA seemingly unrelated criminal case in Washington has reopened a popular Trump-Russia guessing game: Who is Joseph Mifsud?\n\nThe FBI says the vanishing professor is a Russian spy. Trump backers, citing Mr. Mifsud’s extensive Western intelligence contacts, suspect he’s an FBI, CIA or MI6 plant.\n\nThe Washington Times examined Mr. Mifsud’s extensive resume and frequent travels, revealing a skilled networker far more wedded to the West than the East.\n\nIn May 2017, 10 months into the FBI Russia conspiracy probe, Mr. Mifsud spoke in Riyadh at a high-powered terrorism conference. On his panel was counterterrorism expert Michael Hurley, who led CIA officers in Afghanistan in 2001 and served as senior counsel on the 9/11 Commission. Former Defense Secretary Ashton Carter also spoke.\n\nMr. Mifsud’s importance is uncontested. His hearsay conversation with a Trump campaign adviser in London prompted the FBI to start the investigation in July 2016. Special counsel Robert Mueller’s report cast Mr. Mifsud as a London-based academic who frequently talks to sinister Russians. Former FBI Director James B. Comey calls the balding rumpled European a Moscow asset.\n\nYet photos and news clips, such as those from Riyadh, Saudi Arabia, show him hobnobbing with NATO military personnel, retired American and British intelligence officers, French officials at the Elysee Palace and State Department diplomats on Capitol Hill.\n\nRep. Devin Nunes, California Republican, flatly says Mr. Mifsud is no Russian informant. He has asked the State Department, the FBI and other agencies for information about the professor, who has been out of sight for months.\n\n“It is impossible that Mifsud is a Russian asset,” Mr. Nunes told Fox News.\n\nMr. Mifsud’s name reappeared suddenly in the news last week in the tribunal of retired Army Lt. Gen. Michael Flynn.\n\nSidney Powell, Flynn’s attorney, filed a motion in U.S. District Court disclosing that the federal government has come into possession of two BlackBerry cellphones used by Mr. Mifsud. She later told The Washington Times that the cellphones were obtained by special investigator John Durham. In other words, Mr. Durham is trying to determine the real Mr. Mifsud.\n\nAttorney General William Barr directed Mr. Durham, the U.S. attorney for Connecticut, to uncover the true origins of the FBI Russia investigation. Mr. Mueller ultimately found no Trump conspiracy to interfere in the 2016 election.\n\nThe FBI relied heavily on British former spy Christopher Steele and his anti-Trump dossier sourced to Kremlin intelligence. The Hillary Clinton campaign and the Democratic Party paid his salary for what could arguably be called a bogus narrative.\n\nFor the provenance question, Mr. Mifsud is crucial. In April 2016, he told Trump campaign adviser George Papadopoulos in London that he had heard in Moscow that the Russians owned “dirt” on candidate Clinton in the form of “thousands of emails.” When word got back to the FBI via an Australian diplomat, agent Peter Strzok officially opened the probe, known as Crossfire Hurricane.\n\nIf Mr. Mifsud is a Russian agent, as the FBI contends, then it would add credence to why Trump people were investigated. If he is a Western agent, as Trump people suspect, then the Obama administration may have begun the probe fraudulently, based on planted evidence.\n\nMr. Mifsud made his money by managing and lecturing from operating bases at five European outposts noted for their contacts with Western governments:\n\n⦁ Malta’s Ministry of Foreign Affairs.\n\n⦁ The now-defunct London Academy of Diplomacy, as director of international strategic development working with the British Foreign Office.\n\n⦁ The London Center for International Law Practice (LCILP), where Papadopoulos briefly worked.\n\n⦁ As founding president of Euro Mediterranean University in Slovenia.\n\n⦁ As an instructor at Link Campus University, a for-profit school for government leaders in Rome. Link University is tied to a number of Italian officials.\n\nChris Blackburn is a British political analyst who has turned up some exclusive on-the-job photos of Mr. Mifsud while helping journalists profile the peripatetic professor.\n\n“It shouldn’t have taken long for Peter Strzok to build up a profile on LCILP and its directors,” Mr. Blackburn told The Times. “It concentrated on counterterrorism. Its directors have previously worked closely with the FBI and claim on their website to have a U.S. State Department contract to teach intelligence to Libyan law enforcement and intelligence chiefs.\n\n“Mifsud seems to be close to the people who put the intelligence into the system in multiple countries, so I’d say it would be doubtful the Russians were running him,” he said.\n\nMr. Nunes said Mr. Mifsud “is a former diplomat with the Malta government. He lived in Italy. He worked and taught FBI, trained FBI officials and worked with FBI officials.”\n\nWorld-class networker\n\nMr. Mifsud’s travels included:\n\n⦁ Extensive networking from 2008 to 2012 as president of Euro Mediterranean University. In 2011 and 2012, he visited Germany, Tunisia, Morocco, the Ministry of Economy and Competitiveness in Spain, a water sustainability conference in Italy, Montenegro, Greece and the Elysee Palace in Paris. He left in 2012 under criticism for failing to meet certain management goals.\n\n⦁ The London Academy of Diplomacy, where he appeared on the roster in 2012 and served as a director and interacted with British diplomats.\n\n⦁ Link Campus University in Rome, where he was photographed in October 2012 with Claire Smith, a former British diplomat and intelligence official, along with Italian military officers. The FBI has sent agents there for training.\n\nLink University is accredited by the Italian government and partly owned by Zurich lawyer and energy executive Stephan Roh.\n\nMr. Roh is an occasionally mentioned Trump-Russia figure. Married to a Russian fashion designer and a world traveler himself, he has represented Mr. Mifsud. He found himself ambushed by FBI agents at a U.S. airport. He says Mr. Mifsud is not a Russian agent.\n\nThe Daily Caller published a photograph showing Mr. Mifsud at his law office in May 2018 signing a power of attorney. After that, the professor apparently vanished.\n\n⦁ The Global Economic Forum trade show, partly sponsored by the London Academy of Diplomacy, where he appeared as a panel chairman on April 3, 2013. The U.S. Embassy hosted a “gala networking reception,” and embassy personnel attended the forum.\n\n⦁ The London Center of International Law Practice, where Mr. Mifsud sat on a panel on Nov. 25, 2014.\n\n⦁ Link University, where he was photographed in July 2016 teaching Middle Eastern intelligence officials.\n\n⦁ Capitol Hill, where he appeared on a panel in February 2017 to discuss transAtlantic leadership at an event called “Strategic Dialogue.” The discussion was associated with Global Ties U.S., a nonprofit State Department partner.\n\nMr. Mifsud was interviewed by the FBI on that trip. He left the U.S. on Feb. 11.\n\n⦁ The “Riyadh Forum on Countering Extremism and Fighting Terrorism,” hosted by the Saudi government at the King Faisal Center, where he spoke on May 23, 2017.\n\nPresident Obama’s defense secretary, Aston Carter, also spoke at the event, as did Richard Barrett, former commander of the International Counterterrorism Operations Group for MI6, Britain’s overseas intelligence service.\n\nMr. Mifsud served on a crime and terrorism panel with Katherine Bauer of the Treasury Department and Mr. Hurley, the former CIA counterterrorism officer.\n\nAt this juncture, the FBI’s Trump-Russia probe was nearing the one-year mark. The FBI began interviewing Papadopoulos in January. The professor was mingling freely with Western-connected scholars, officials and journalists.\n\n⦁ A Conservative Party fundraiser in Reading, England, on Oct. 19, 2017. Mr. Mifsud was photographed with then-British Foreign Minister Boris Johnson.\n\nMifsud and the Mueller report\n\nThe 448-page Mueller report mentions Mr. Mifsud 87 times, mostly about his Russian contacts but no Western contacts.\n\nThe report discusses his initial meeting with Papadopoulos at Link University and the Trump campaign adviser’s ensuing reliance on him for Russia contacts to set up a Kremlin-Trump campaign meeting. Such a meeting never occurred.\n\nIt was on April 26, 2016, at London’s Andaz Hotel over breakfast that Mr. Mifsud, just back from a think tank conference in Moscow, mentioned the Clinton “dirt.”\n\nWhat the Mueller report was willing to say publicly about Mr. Mifsud to make the Russia spy case is scant:\n\n⦁ In London, Mr. Mifsud knew a Russian who once worked for the Internet Research Agency, the St. Petersburg operation that conducted Moscow’s social media information warfare against the Clinton campaign. Though the names are blacked out, the report indicates that this London contact was in communication with a certain unidentified unit linked to someone in the Russian Defense Ministry.\n\nOne of these two — the Russian or the Internet Research Agency — had overlapping accounts with Facebook pages that promoted D.C. Leaks. D.C. Leaks was a phony domain set up by Russian military intelligence operatives who hacked Democratic Party computers and released stolen documents.\n\nThat is the presented evidence. There is no information about what this former Internet Research Agency employee and Mr. Mifsud did together. They had unspecified discussions in the winter of 2016, about the time the FBI discovered Russian hacking and later told the Democratic National Committee, which refused help.\n\n⦁ Before the historic April 2016 breakfast meeting, Mr. Mifsud traveled to Moscow to take part in a conference at Moscow’s Valdai Discussion Club, which President Vladimir Putin hails as the nation’s premier think tank.\n\nThe Mueller report, in a footnote, describes Valdai as being “close to Russia’s foreign policy establishment.”\n\nMr. Mifsud’s appearance there as a Westerner was not unique. Valdai’s English language website lists scores of associated “experts,” including a former U.S. ambassador, American scholars and European journalists.\n\nFor its April 19, 2016, conference, Valdai posted a photograph of a panel on “world stability and the oil market.” Pictured was Mr. Roh, the Zurich attorney; Mr. Mifsud; and Ivan Timofeev, a Valdai program director who has moderated various group discussions over the years.\n\nVideos online show Mr. Timofeev interviewing Mr. Mifsud at other times.\n\nThe Mifsud-Timofeev relationship was by no means secret. Mr. Mifsud recommended Mr. Timofeev to Papadopoulos as an entry to the Kremlin for a future campaign meeting, the Mueller report says.\n\nValdai, like any other major think thank, has scholars who maintain contacts with and host government officials.\n\nPapadopoulos pleaded guilty to lying to the FBI. He told agents he heard the “dirt” comment before his Trump association was announced. In fact, it was afterward.\n\nThe Mueller sentencing memo suggested he lied to protect his chances of winning an administration job. Mr. Mueller found no evidence that Papadopoulos passed the Clinton email tip to the campaign in New York.\n\nRaising questions\n\nMr. Nunes, the ranking Republican on the House Permanent Select Committee on Intelligence, has rejected the Mueller profile.\n\nIn a May letter to top officials, including Secretary of State Mike Pompeo and FBI Director Christopher A. Wray, Mr. Nunes requested any informant they possess on Mr. Mifsud.\n\n“If Mifsud has extensive, suspicious contacts among Russian officials as portrayed in the Special Counsel’s report, then an incredibly wide range of Western institutions and individuals may have been compromised by him, including our own State Department,” Mr. Nunes wrote.\n\n“Alternatively, if Mifsud is not in fact a counterintelligence threat, then that would cast doubt on the Special Counsel’s fundamental depiction of him and his activities, and raise questions about the veracity of the Special Counsel’s statements and affirmations.”\n\nIn an interview in November 2017 with Italy’s la Repubblica newspaper, Mr. Mifsud denied everything. He said he never told Papadopoulos about Clinton emails and that he knows very few Russians.\n\n“The Russians didn’t ask me to meet Papadopoulos,” he said. “Mr. Papadopoulos asked me for contacts in several areas. I am not a secret agent. I never got any money from the Russians. My conscience is clear.”\n\nHe finished with this: “Anyway, I have already talked about it with the FBI, when the State Department invited me to a conference in Capitol Hill.”\n\nHe gave the same denial to agents during that visit.\n\nIt seems there are three possibilities: Mr. Mifsud is indeed a Russian agent assigned to gauge a Trump person’s interest in obtaining stolen emails. Or he was a Western asset assigned to plant information inside the Trump sphere and then watch what Papadopoulos did with it. Or he had just returned to London from an eclectic conference in Moscow and discussions with Russian politicians. He happened to pass on some juicy geopolitical gossip to the young ambitious Trump adviser.\n\nMr. Durham’s ownership of two Mifsud BlackBerrys shows he is trying to end the Mifsud guessing game.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "A seemingly unrelated criminal case in Washington has reopened a popular Trump-Russia guessing game: Who is Joseph Mifsud?", "authors": ["The Washington Times Http", "Rowan Scarborough"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/17/Trump_Impeachment_14756.jpg-814c1_c0-220-5280-3300_s1200x700.jpg?932acde88473437c7d8669264c8035b9d1f45860", "published_at": "2019-10-20"}