{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/climate-change-protesters-plan-to-flood-downtown-dc-streets-monday-morning/2019/09/20/6b088e94-dbd9-11e9-89d4-37d5ffcac6f4_story.html", "downloaded_at": "2019-09-23 11:55:19.121416+00:00", "title": "Shut Down D.C.: ‘Climate rebels’ gather at sites across D.C., aiming to bring city to a ‘standstill’", "language": "en", "text": "Climate change protesters say they plan to shut down intersections Monday morning in downtown Washington in the latest of a series of rallies around the world designed to force policymakers to respond to Earth’s rising temperatures.\n\nOrganizers of Shut Down DC are urging “climate rebels” to flood the District’s streets Monday to bring “the whole city to a gridlocked standstill,” according to the group’s website. The website includes a map of so-called “climate criminals” that include “corporations, lobbyists, trade cartels, and government institutions that are most responsible for creating the climate crisis.”\n\nBy around 6:30 a.m. Monday, some health-care workers and other activists had gathered at Folger Park on Capitol Hill.\n\n[‘Shut Down D.C.’: What you need to know about the protests that may create gridlock in Washington]\n\nTransportation officials warned commuters to allow extra time and expect delays on their normal routes. Commuters are also advised to try other modes, including biking in or taking Metro — or best bet, transportation experts warned, telework.\n\nProtesters have blocked off the intersection of Independence and Washington Ave SW. Police say if they don’t move, arrests will begin:\n\n\n\n“This is your third and final warning.” pic.twitter.com/BHtYXnoKiW — Rebecca Tan (@rebtanhs) September 23, 2019\n\nActivist groups sent out a list early Monday morning detailing their plans for blocking major intersections downtown and on Capitol Hill.\n\nThey said they plan to use a yacht to block 16th and K streets NW near the White House, starting around 6:30 a.m.\n\nProtesters will also create a blockade near Massachusetts Avenue and North Capitol Street and at New Jersey and Massachusetts avenues NW. Another group is expected to block the headquarters of U.S. Immigration and Customs Enforcement at 12th Street and Maryland Avenue SW.\n\n\n\nActivists at 3rd and Independence streets SW on Monday morning. (Rebecca Tan/The Washington Post)\n\nOne group — Black Lives Matter — is expected to conduct “high blood pressure and glucose screenings in the middle” of Pennsylvania and Independence avenues SE, organizers said.\n\nAnother group is planning to make a blockade at the intersection of 14th and C streets SW.\n\n“We will block key infrastructure to stop business-as-usual,” the group Shut Down DC said in a statement. “Parents, workers, college students, and everyone who is concerned about the climate crisis will skip work and school and put off their other responsibilities to take action on the climate crisis.”\n\n[‘I hope the politicians hear us’: Millions of youth around the world strike for action]\n\nKaela Bamberger, a spokeswoman for the Coalition to Shut Down D.C., which organized the event, said more than 1,100 people signed an online pledge to participate. She said the group expects hundreds more might show up Monday morning.\n\nExtinction Rebellion #ClimateStrike #ShutDownDC protesters say the sailboat blocking this intersection in NW DC is named after the Great Barrier Reef. pic.twitter.com/1u6e3DZviT — Unicorn Riot (@UR_Ninja) September 23, 2019\n\n“We’ve seen literally millions strike for climate led by youth,” she said Friday. “We are escalating in tactics. We are using what has historically been the most effective way to make change: nonviolence and civil disobedience.”\n\nBamberger said the group did not seek permits, and a complete list of protest sites would be available Monday morning.\n\nProtesters have part of Independence & 12th blocked off. This is part of the #ShutDownDC movement to bring attention to climate change. They want to disrupt the Monday morning commute @wusa9 #getupdc #dctraffic pic.twitter.com/SJu3CGJ86K — Marcella Robertson (@Marcella_Rob) September 23, 2019\n\nA D.C. police spokeswoman said no specific street closures were planned, but rolling closures were likely wherever protesters show up.\n\nThe planned protest comes after young people from more than 150 countries, including the United States, skipped school Friday, gathering in cities (including the District) around the world ahead of a United Nations climate summit Monday to urge policymakers to work more aggressively to take up climate change.\n\nRead more:\n\nWhy nurses, America’s most trusted professionals, are demanding ‘climate justice’\n\nLocal newsletters: Local headlines (8 a.m.) | Afternoon Buzz (4 p.m.)\n\nLike PostLocal on Facebook | Follow @postlocal on Twitter | Latest local news\n\nDana Hedgpeth contributed to this report.", "description": "Protest organizers say they plan to “block key infrastructure to stop business-as-usual.”", "authors": ["Justin Wm. Moyer", "Reporter Covering Breaking News", "Rebecca Tan", "Local Reporter", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/_d2S7s2lcnsaYW3yaQ0yaRUmT6k=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/USW4YCG56YI6TPUWNLNYDAQ6SA.jpg", "published_at": "2019-09-20"}