{"pub": "fox", "url": "https://foxbusiness.com/money/fedex-ground-manager-indicted-bribes-truck-companies", "downloaded_at": "2019-10-30 16:01:14.236754+00:00", "title": "FedEx Ground manager accused of taking $1M in bribes from truck company owners", "language": "en", "text": "A FedEx Ground manager has been indicted on accusations that he accepted bribes from multiple Utah truck company owners who paid more than $1 million to secure hundreds of millions in revenue over the last 10 years, the U.S. Attorney’s Office said Monday.\n\nContinue Reading Below\n\nAmong the 10 people named in the indictment was 47-year-old Ryan Lee Mower, who had been the highest-ranking FedEx Ground employee in the state from at least 2008 to October 2019, according to the indictments.\n\nMower, according to court documents, is primarily responsible for overseeing FedEx Ground's contract service providers and ensuring that each local trucking company complied with its policies and regulations.\n\nMower faces 51 counts for allegedly exploiting his position for financial gain.\n\n\"Fair play, honest dealings, and transparency are core values in the American business landscape. Bribery and corrupt practices are not,\" said U.S. Attorney John W. Huber.\n\nCHINA RAMPS UP 'HOSTAGE-TAKING BINGE' BY DETAINING FEDEX PILOT\n\n\"The conduct alleged in the indictment not only runs counter to societal expectations for American business, it runs afoul of the laws of the United States. The alleged unjust enrichment comes at the expense of those who play by the rules in the market place,\" he said.\n\nFedEx Ground operates approximately 39 hubs or distribution centers to move packages around the country. One of the hubs is located in North Salt Lake City in Utah. The company contracts with local trucking companies to transport packages on behalf of the company, the U.S. attorney's office in Utah said.\n\nTicker Security Last Change Change % FDX FEDEX CORPORATION 154.55 -3.46 -2.19%\n\nAMAZON BEWARE: FEDEX AND UPS HAVE A PLAN TO COMPETE ON THE WEEKEND\n\nThe company is disappointed by the \"egregious\" actions and is cooperating with authorities, FedEx Ground spokeswoman Meredith Miller said in a statement.\n\n\"FedEx Ground does not tolerate illegal activity. We expect all employees and service providers to act with the highest ethical standards and we take very seriously this deliberate evasion of the company’s compliance programs,\" the statement said.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nMost of the payments cited by prosecutors were for work that was actually performed and the financial loss for FedEx Ground was only was a \"small fraction\" of what is outlined in the indictment, Miller said.\n\nThe nine others have either been arrested or warrants have been issued for their arrest, the U.S. attorney's office in Utah said.\n\nThe maximum penalty for wire fraud, wire fraud conspiracy promotional money laundering and concealment of money laundering is 20 years in prison. Money laundering carries a sentence up to 10 years in prison.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nThe Associated Press contributed to this report.", "description": "A FedEx Ground manager has been indicted on accusations that he accepted bribes from multiple Utah truck company owners who paid more than $1 million to secure hundreds of millions in revenue over the last 10 years, the U.S. Attorney’s Office said Monday.", "authors": ["Daniella Genovese"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/fedex-office-iStock.jpg?ve=1&tl=1", "published_at": "2019-10-30"}