{"pub": "yahoo", "url": "https://news.yahoo.com/insane-impeachment-witch-hunt-trump-022755181.html", "downloaded_at": "2019-10-11 05:12:02.373174+00:00", "title": "'Insane Impeachment Witch Hunt.' Trump Rages in His First Rally Since the Start of the Impeachment Inquiry", "language": "en", "text": "When President Donald Trump took the stage in Minnesota Thursday night, it was his first appearance at a rally since House Democrats formally launched an impeachment inquiry. And he used much of his time on the stage to vent about the proceedings threatening to derail his presidency.\n\n“They want to erase your vote like it never existed,” Trump told his supporters in Minneapolis at the beginning of the rally.\n\n“They [Democrats] know they can’t win the 2020 election,” Trump continued, “so they’re pursuing the insane impeachment witch hunt.”\n\nThe Trump campaign insists the impeachment is a political distraction that won’t hurt the President.\n\nThe campaign says it raised $15 million in 72 hours after House Speaker Nancy Pelosi announced the impeachment inquiry on September 24.\n\n“Americans see through the partisan games Democrats are playing,” says Sarah Matthews, deputy press secretary for the Trump 2020 campaign. “Democrats know they can’t beat President Trump at the ballot box, so they’re trying to deny Americans the opportunity to vote to re-elect him in 2020.”\n\nTrump predicted at his rally that “Democrats’ brazen attempt to overthrow our government will produce a backlash at the ballot box, the likes of which they have never, ever seen before in the history of this country.”\n\nBut others close to Trump say his reaction to the impeachment inquiry is less positive. They say Trump’s remarks in recent days show he’s finding little respite from the steady drumbeat of impeachment news coming out of Washington, and also illustrate how the inquiry threatens to dominate his campaign as well as his presidency.\n\n“He’s going to have articles of impeachment voted on him,” a former White House official says. “He knows that or at least [it] has now sunk in. It is always going to be attached to his name, and it’s driving him insane.”\n\nAt Thursday’s rally, Trump also railed against former Vice President Joe Biden and his son Hunter Biden, calling Hunter a “loser” and saying Joe was only a good Vice President because he “understood how to kiss Barack Obama’s ass.” The House’s impeachment inquiry centers on a whistleblower complaint about a call in which Trump may have pressured the President of Ukraine to investigate the Bidens.\n\nRecent polling suggests the political reality of impeachment may be trickier for the President than he and his campaign staff let on. According to a recent Washington Post-Schar School telephone poll, a majority of the 1,007 Americans surveyed (58%) agree with the House Democrats’ decision to launch the impeachment inquiry, and nearly half of Americans (49%) say the House should go further and recommend Trump’s removal from office. This data is divided along partisan lines, with more Democrats than Republicans supporting impeachment and removal, but in a worrying sign for the President, 57% of independents endorse the impeachment inquiry.\n\nAn Quinnipiac University poll published Oct. 8 found similar results, with 53% of the registered voters surveyed supporting the impeachment inquiry, and 45% of respondents saying Trump should be impeached and removed from office.\n\nA Fox News telephone poll published Oct. 9 had roughly the same figures, noting a “new high” of 51% of voters who want Trump impeached and removed from office, up from 42% in July.\n\nThe Fox News poll particularly irked the President, who tweeted Thursday morning, “From the day I announced I was running for President, I have NEVER had a good @FoxNews Poll. Whoever their Pollster is, they suck.”\n\nFrom the day I announced I was running for President, I have NEVER had a good @FoxNews Poll. Whoever their Pollster is, they suck. But @FoxNews is also much different than it used to be in the good old days. With people like Andrew Napolitano, who wanted to be a Supreme.... — Donald J. Trump (@realDonaldTrump) October 10, 2019\n\nDespite the looming prospect of impeachment, the Trump campaign is making an aggressive play to turn Minnesota and other blue states red in 2020. No Republican presidential candidate has won Minnesota since Richard Nixon did in 1972, but the state went for Hillary Clinton over Trump in 2016 by just 1.5 percentage points. The campaign hired a state director there in June to target more resources and has seen more Republican voter registrations in recent months.", "description": "Recent polling suggests the political reality of impeachment may be trickier for the President than he and his campaign staff let on", "authors": ["Tessa Berenson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/FttStV1pZqCdtd.dm46Lkg--~B/aD02ODM7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/time_72/6e035d87ed8c9d44f862739feef881b8", "published_at": "2019-10-11"}