{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/russian-actress-dragged-off-plane-police-calls-fellow-passengers-plebs-11014866", "downloaded_at": "2019-10-30 23:24:30.014776+00:00", "title": "Actress dragged off plane after calling fellow passengers ‘plebs’", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nA Russian actress was dragged off a plane by police after starting a ‘brawl’ and branding her fellow passengers ‘plebs’.\n\nLidiya Velezheva, who also works as a TV presenter, was flying from Moscow to Tel Aviv, Israel, in business class in order to perform in a play.\n\nBut after the flight was delayed by two hours due to technical issues, the 53-year-old had a loud public outburst, complaining about being held on an airport bus for 20 minutes without a coat.\n\nAdvertisement\n\nAdvertisement\n\nLocal media reported that Lidiya, who is best known for her appearance in 2003’s Idiot, was involved in a ‘brawl’ just as the flight was about to take off, ‘swearing at other passengers and the crew’ and at one point having her hair pulled by an elderly passenger.\n\nThe plane was forced to return to the Moscow terminal, where the police removed Lidiya from the flight.\n\nIn a video shared on Mash, the actress is seen being addressed by air stewards and refusing to cooperate, until police turn up and forcibly drag her from the plane against her will.\n\nThe presenter was forcibly removed from the flight by police (Picture: East2West News)\n\nThe actress’ husband claims she had taken sleeping pills (Picture: East2West News)\n\nLidiya was due to perform in a play in Israel (Picture: Sergei Fadeichev/Getty)\n\nAs reported by the Mirror Online, Lidiya is heard saying in her native Russian: ‘I am an actress and you are plebs because most likely you bought your ticket for miles, and I got mine for 204,000 roubles (around £2,474) in cash.’\n\nThe actress lives in Moscow with her actor husband Alexey Guskov, who said that his wife was ‘sobbing’ after missing the plane and disrupting her journey to her play.\n\nWhile some passengers had claimed that the actress had been drunk on the flight, Alexey claimed she had taken a sleeping pill instead.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Love Island’s India Reynolds takes mind off Ovie Soko split as she hangs out with Amber Gill\n\nMORE: Ringo Starr still gets emotional ‘some b***ard’ shot John Lennon as he recalls Beatle’s death", "description": "A Russian actress was dragged off a plane by police after starting a ‘brawl’ and branding her fellow passengers ‘plebs’.", "authors": ["Isobel Lewis"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_94026860_1572467967.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}