{"pub": "investingcom", "url": "https://uk.investing.com/analysis/the-100-rally-in-starbucks-shares-may-be-showing-signs-of-peaking-200432521", "downloaded_at": "2019-09-09 08:45:01.519376+00:00", "title": "The 100% Rally In Starbucks' Shares May Be Showing Signs Of Peaking", "language": "en", "text": "It’s been a remarkable journey for Starbucks (NASDAQ: ) since the summer of last year.\n\nThe shares of the coffee-chain that sells popular Frappuccinos and pumpkin-spiced lattes rose to a record intraday high of $99.76 on July 26 after surging more than 100% since late June of 2018 — rewarding those investors who didn’t lose their patience during a long bearish spell that preceded this upward move. The shares have slipped slightly since, closing on Friday at $95.74.\n\nStarbucks price chart\n\nBut now, faith in this coffee-chain is being tested again after the company warned last week that the pace of profit growth that fueled this rally will slow in the next fiscal year and the company won’t be as aggressive in its share buy-back plan as it used to be.\n\nStarbucks CFO Pat Grismer said at Goldman Sachs’ Global Retailing Conference that the company expects fiscal 2020 earnings per share to be below its “ongoing growth model of 10%.” Grismer said that one-time tax benefits realized in fiscal 2019 will be a significant headwind to earnings growth next year. He also said the circa $2-billion share buybacks that the company made in fiscal 2019 won’t be there in 2020 to support its stock.\n\nDuring the past several quarters, Starbucks has been producing earnings growth that exceeded expectations, making investors quite bullish on this stock and raising hopes that the company’s turnaround will sustain its growth momentum.\n\nFiring on All Cylinders\n\nFor the that ended in June, Starbucks logged its fastest global sales growth in three years, helped by strong gains in China and the U.S. The Seattle-based chain reported a robust 6% gain in same-store sales worldwide — the most since 2016 and well above the 4.2% projection compiled by Consensus Metrix.\n\nFor 2019, Starbucks expects adjusted earnings of $2.80 to $2.82 a share this year, up from $2.75 to $2.79 a share previously.\n\n“I would say that we’re firing on all cylinders from an operating performance perspective, with the focus and discipline necessary to drive growth at scale for a company like Starbucks,” Grismer said at the conference.\n\nStarbucks’ latest conservative remarks reflect a clever approach by the firm, which is trying to pare down quite bullish market expectations. And this approach is in line with our earlier view about this stock which seems a bit overpriced after a highly successful run over the past one year.\n\nWith the market cap topping $114.6 billion, Starbucks is trading at a price-to-earnings multiple of 33.87, which is higher than Microsoft's (NASDAQ: ) P/E of 29.31, Alphabet's (NASDAQ: ) of 24.79 or Facebook's (NASDAQ: ) of 31.78.\n\nIn our view, Starbucks stock is currently reflecting the turnaround in its biggest markets — the Americas and China — and it would be risky for investors to enter this trade now when these expectations are fully priced in.\n\nBut when the next pullback comes, this stock is an attractive buy-and-hold candidate for long-term investors, especially with its hefty dividend growth, that's currently yielding around 1.5%.\n\nOn the strategy side, Starbucks remains well on course as the chain wins back coffee-drinkers not only in its home markets, but also in China — a country which has taken center stage in its growth strategy. The company’s future growth is very much dependent on its international success as well as its restructuring at home, which is crucial to meeting customers’ changing needs.\n\nReporting strong growth in the last four consecutive quarters, the data-driven new CEO Kevin Johnson clearly knows what he's doing. The tactics he's employing certainly appear to be helping to attract customers and to increase their spending in the stores.\n\nDuring the past year, the number of guests in its loyalty program has grown substantially, reaching 17.2 million active members in the U.S., up 14% year-over-year. The result of these initiatives, coupled with cost-cutting measures in the supply chain, is that Starbucks' growth momentum continues.\n\nBottom Line\n\nWe don’t see a big pullback in Starbucks shares in the remaining part of this year with the company’s core operating targets well on track. At the same time, we don’t see a repeat of its 2019 performance next year, especially if the U.S. economy slips into a recession and its growth plans in China see some uncertainty due to geopolitical tension and growing local competition.", "description": "Shares Analysis by Investing.com (Haris Anwar/Investing.com) covering: Microsoft Corporation, Alphabet Inc Class A, Starbucks Corporation, Facebook Inc. Read Investing.com (Haris Anwar/Investing.com)'s latest article on Investing.com UK.", "authors": [], "top_image": "https://uk.investing.com/analysis/not found", "published_at": "2019-09-09"}