{"pub": "fox", "url": "https://foxnews.com/entertainment/lindsay-lohan-cody-simpson-masked-singer-australia-win", "downloaded_at": "2019-10-22 20:39:08.874266+00:00", "title": "Lindsay Lohan bashes Cody Simpson following 'Masked Singer Australia' win", "language": "en", "text": "Cody Simpson might have won Australia’s inaugural season of “The Masked Singer,” but Lindsay Lohan was not having it.\n\nLohan, a judge on the show, took to Instagram after the conclusion of the show to throw some major shade at Miley Cyrus’ new boyfriend.\n\n“When you realise (sic) you failed. And you settle for less @codysimpson. Family is everything you won the masked singer but you lost on your future,” said Lindsay in the now-deleted Instagram post featuring Simpson and sister Ali Lohan, who were romantically linked for a brief period last year.\n\nMILEY CYRUS' BEAU CODY SIMPSON PENS ROMANTIC POEM\n\nAlthough Lohan deleted the post, the screenshot is currently making rounds on Twitter.\n\nLohan seemingly references Miley in the post when she mentions Simpson settling for less. Cyrus and Simpson have been romantically linked for the past month following Cyrus’ tumultuous divorce from Liam Hemsworth and a one-month fling with Kaitlynn Carter.\n\nCyrus and Simpson have been making headlines with their rambunctious antics — from getting intimate on Instagram to Cyrus causing an uproar in the LGBTQ+ community for perceived insensitive comments.\n\nMILEY CYRUS SERENADED BY CODY SIMPSON AT HOSPITAL AFTER SINGER REVEALS TONSILLITIS DIAGNOSIS\n\nLohan’s shade at Cyrus is not the first time the “Wrecking Ball” singer has received criticism for her relationships.\n\nOne day after Cyrus, 26, was spotted kissing Simpson at a store in Los Angeles, she hit back at critics who accused her of moving on too fast from Carter and Hemsworth.\n\n“I know the public feels invested in my past relationship because they felt like they saw it thru from the beginning,” Cyrus began her statement on Twitter. “I think that’s why people have always felt so entitled over my life and how I live it because they’ve watched me grow up.”\n\nLINDSAY LOHAN SAYS SHE'S READY FOR A 'MEAN GIRLS' SEQUEL\n\nShe continued: “But I am grown now and make choices as an adult knowing the truth/details/reality. People only ‘know’ what they see on the internet.”\n\nCyrus went on to address the double standard between men and women when it comes to dating.\n\n“Men (especially successful ones) are RARELY slut shamed,” she said. \"They move on from one beautiful young woman to the next MOST times without consequence. They are usually referred to as ‘legends,’ ‘heart throbs,’ ‘G,’ ‘Ladies Man,’ etc…. where women are called sluts/whores!”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“I am trying to just THRIVE/survive in a 'mans' world,” Cyrus explained. “If we can’t beat em, join em! “If our president can ‘grab em by the p-----’…. can’t I just have a kiss and an açai bowl?!?!” she added", "description": "Cody Simpson might have won Australia’s inaugural season of “The Masked Singer,” but Lindsay Lohan was not having it. Lohan, a judge on the show, took to Instagram after the conclusion of the show to throw some major shade at Miley Cyrus’ new boyfriend.", "authors": ["Andy Sahadeo"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Simpson-Lohan.jpg", "published_at": "2019-10-22"}