{"pub": "cnn", "url": "https://cnn.com/2019/09/09/sport/nfl-week-one-roundup-spt-intl/index.html", "downloaded_at": "2019-09-09 23:20:59.590150+00:00", "title": "NFL week one: Death, taxes and the New England Patriots unfurling a NFL championship banner", "language": "en", "text": "(CNN) With some players debuting for new teams, while others returned from injuries and coaches masterminding their first game, week one of the NFL season was a time for new beginnings.\n\nBut like death and taxes, some things remain constant -- the New England Patriots unveiled an NFL championship banner -- their sixth -- before going on to win their 14th consecutive home game.\n\nThe defending champion, head coach Bill Belichick and their 42-year-old talisman Tom Brady now have a 5-1 record in their first games after winning a Super Bowl ring, following Sunday's 33-3 mauling of the Pittsburgh Steelers.\n\nAs if that wasn't humiliating enough for the Steelers, the Patriots signed their former malcontent and seven-time Pro Bowl wide receiver Antonio Brown following his release by the Oakland Raiders.\n\nBrady is even reportedly happy to put up Brown in his home as he settles in to life with the Patriots.\n\nTom Brady's back ... and so is the NFL.\n\nSuccess at the expense of others\n\nMeanwhile Florida-native Lamar Jackson had Miami Dolphins' fans booing their own team in the first 10 minutes.\n\nBaltimore Ravens quarterback Jackson threw five touchdowns passes -- including scores of 47 and 83 yards to 2019 first-round draft pick Marquise \"Hollywood\" Brown in a frenetic start to the game -- to humiliate the Dolphins and rookie coach Brian Flores, 59-10.\n\nThe first-round pick from a year ago helped the Ravens set a franchise record for points in the first half, an NFL record for points in the first half of an opener -- the score was 42-10 at the break -- and franchise records for points and total yards with 643.\n\nWhile it is widely understood the Miami team is in a rebuilding year, the defeat was so comprehensive that multiple Dolphins players contacted their agents to engineer trades away from the team, according to ProFootballTalk.\n\nJackson high fives fans after the game against the Miami Dolphins.\n\nNot living up to the hype\n\nThe Cleveland Browns had a combined record of 1--31 both in 2016 and 2017, so finishing with a 7-8-1 record last season felt like a turning point.\n\nAnd with last year's number one draft pick Baker Mayfield at quarterback and newly-traded for Odell Beckham Jr. at wide receiver, many were even penciling in the Browns for a spot in Super Bowl LIV.\n\nDespite that optimism, their 2019 home opener went down like a lead balloon, as the Browns lost 43-13 to the Tennessee Titans.\n\nMarcus Mariota threw three touchdown passes, including a stunning 75-yarder to running back Derrick Henry to extinguish the Browns' off-season excitement to ensure they are still without a week-one win since 2004.\n\nContenders flourishing\n\nIt is becoming the norm in the NFL preseason for teams to rest their starting players to avoid injuries , resulting in some week one rustiness.\n\nBut for many of the perceived contenders for this season's Super Bowl, it was a good start.\n\nDak Prescott and the Dallas Cowboys ran riot over the New York Giants, eventually winning 35-17, while in another all-NFC East game, the Philadelphia Eagles overcame a 17-point deficit to beat the Washington Redskins.\n\nThe Kansas City Chiefs battled injury worries and the scorching heat to beat the Jacksonville Jaguars 40-26, while last season's runners-up Los Angeles Rams squeaked past the Carolina Panthers 30-27.\n\nCarson Wentz hugs cornerback Josh Norman of the Washington Redskins.\n\nNew faces\n\nLast season, the Arizona Cardinals finished with the worst record in the league and as a result, had the first pick in this season's draft.\n\nThey picked Heisman Trophy winner Kyler Murray, who was paired with their new offensively-minded head coach, Kliff Kingsbury.\n\nThis new quarterback-head coach combination managed to lead the Cardinals to a comeback 27-27 tie against the Detroit Lions.\n\nAnother rookie quarterback, Daniel Jones -- drafted number six overall by the Giants -- made his NFL debut as well, playing the last two minutes in their defeat to the Cowboys.\n\nKyler Murray celebrates after converting a two-point conversion against the Detroit Lions.\n\nEarly season injuries\n\nWhile fans should be looking forward to watching 15 more games of their favorite players, injuries have already put a dampener on some stars' season.\n\nIn the hard-hitting Chiefs-Jaguars game, reigning league MVP Patrick Mahomes received treatment on his right ankle during the second quarter -- he returned after having strapping applied.\n\nWhile Mahomes escaped without any serious injuries, wide receiver Tyreek Hill will miss a few weeks after being hospitalized with a dislocated shoulder.\n\nIt was an even worse start for Jaguars quarterback Nick Foles who, after recently signing a four-year contract worth $88 million, suffered a broken left clavicle in the first quarter of the game, with the rest of the season now in doubt for the 2017 Super Bowl MVP.", "description": "With some players debuting for new teams, while others returned from injuries and coaches masterminding their first game, week one of the NFL season was a time for new beginnings.", "authors": ["Ben Morse", "For Cnn"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190909125522-brady-tease-super-tease.jpg", "published_at": "2019-09-09"}