{"pub": "nytimes", "url": "https://nytimes.com/2019/10/14/opinion/kanye-sunday-service.html", "downloaded_at": "2019-10-14 11:29:06.238954+00:00", "title": "Opinion | Kanye West and the Cult of Personality", "language": "en", "text": "When Kanye West’s “Jesus Walks” was released in 2004, the song was praised for boldly bringing discussions of faith into hip-hop. Fifteen years later, Mr. West’s contemporaries continue to speak of its impact. In the first episode of “Hip-Hop: The Songs That Shook America,” an AMC docu-series that premiered Sunday, the singer-songwriter John Legend said, “Kanye made it O.K. to talk about your faith in songs that weren’t Christian songs.”\n\nIt is this persistent reverie and good will for “Jesus Walks” that Mr. West has banked on since starting Sunday Service, a series of obliquely religious pop-up gatherings featuring a gospel choir (usually wearing attire from the rapper’s clothing line Yeezy) this year.\n\nThe set lists fluctuate from week to week. But the linchpin of the productions, which segue from traditional songs of mercy and salvation to bolder reconfigurations of modern secular hits, is in that subversive single from his debut album, “The College Dropout” — the artist jubilantly recites the final verse of the song, flexing his cadence in lock step with the choir.\n\nOn an invitation-only basis (or in the case of Coachella last April, the price of a steep festival ticket), the select few present at these gatherings get to rub shoulders with the likes of ASAP Rocky, Chance the Rapper, Brad Pitt and other high-profile entertainers while partaking of the “exclusive” experience. The events serve as a transparent attempt of Mr. West to fundamentally regroup himself within the context of religion after an extended run of willfully courting salacious controversy, whether it be for an unsolicited dressing down of Taylor Swift, his wearing of a MAGA hat or a contentious TMZ appearance in which he claimed that slavery was a “choice.”", "description": "The artist’s Sunday Service concerts have afforded him grace in the face of controversy. But a lot has changed since he made “Jesus Walks.”", "authors": ["Shamira Ibrahim"], "top_image": "https://static01.nyt.com/images/2019/10/14/opinion/14ibrahimWeb/14ibrahimWeb-facebookJumbo.jpg", "published_at": "2019-10-14"}