{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/jersey-mikes-apologizes-backlash-gun-control-activists-2019-10", "downloaded_at": "2019-10-29 15:13:26.178526+00:00", "title": "Jersey Mike's apologizes for joking tweets about a customer bringing guns into a sandwich shop as people threaten to boycott the chain", "language": "en", "text": "Jersey Mike's is facing boycott threats after posting joking tweets in response to a conversation about gun violence.\n\nOver the weekend, a photo of someone carrying two guns into a Jersey Mike's restaurant sparked conversation on Twitter about open-carry policies.\n\nJersey Mike's responded to tweets calling for the chain to change its open-carry policies by tweeting: \"If the laws were up to us, we'd make it so everyone had to eat Jersey Mike's Subs on Sunday.\"\n\nThe sandwich chain apologized on Monday evening, but many gun-control advocates are still calling for a boycott of the chain and demanding that Jersey Mike's ban open carry in stores.\n\n\"Failure to address this with a policy change will not only lead to loss of customers but increased liability as they are on record as choosing to do nothing but joke about it,\" Fred Guttenberg, whose daughter was killed in the 2018 Parkland shooting, told Business Insider in a Twitter direct message.\n\nSign up for Business Insider's retail newsletter, The Drive-Thru, to get more stories like this in your inbox.\n\nVisit Business Insider's homepage for more stories.\n\nJersey Mike's is facing backlash after the chain made glib comments on Twitter about someone bringing guns into sandwich shops.\n\nOn Saturday, anti-gun-violence advocate Travis Akers tweeted a photo of someone in a Jersey Mike's sandwich shop.\n\nAkers captioned the image: \"This man is brandishing two firearms, one of which is not retained properly. I could easily take that gun from him and shoot him, and take the other gun, all within 3 seconds. If you can't carry safely, you shouldn't be allowed to carry.\"\n\nThe photo — originally tweeted by @CombatCavScout — caught the attention of others on social media.\n\n—Cav the Impaler (@CombatCavScout) October 26, 2019\n\nOn Monday, Jersey Mike's began responding to people's concerns. In at least eight tweets posted on Monday afternoon and seen by Business Insider, the chain responded: \"If the laws were up to us, we'd make it so everyone had to eat Jersey Mike's Subs on Sunday.\"\n\nJersey Mike's deleted the tweets on Monday evening. However, in the hours that they were still up, many took offense to the chain's lighthearted response to discussion of gun safety.\n\n\"As most who follow me know, my daughter was a victim of gun violence,\" tweeted Fred Guttenberg, whose daughter was killed in the 2018 Stoneman Douglas High School shooting in Parkland, Florida. \"@jerseymikes, I will never eat in one of your restaurants again. Mocking the desire of customers to be safe when eating is a bad idea. Thankfully, the laws are not up to you.\"\n\n\"As long as you allow open carry in your stores, we'll make sure to grab a sub @subway any day of the week,\" tweeted March For Our Lives.\n\nOn Monday evening, Jersey Mike's tweeted: \"Thank you. We apologize. We always want to do better.\" As of Tuesday morning, all of the other tweets alluding to open carry had been deleted.\n\nHowever, many are not ready to accept the apology until Jersey Mike's changes its open-carry policy. These gun-control advocates are instead calling for a boycott of the chain.\n\nIn September, Walmart asked customers to stop openly carrying guns in stores following two deadly shootings at Walmarts in El Paso, Texas, and Southaven, Mississippi. Chains including Starbucks, Kroger, and CVS also have banned the open carry of firearms in stores.\n\nJersey Mike's did not respond to Business Insider's request for comment on whether the chain will change its open-carry policy. When Business Insider asked the chain for comment on Monday evening, the chain sent a link to the apology tweet.\n\nGuttenberg told Business Insider that he has not heard further from Jersey Mike's, \"other than the unacceptable form response.\"\n\n\"My advice to them would be to take this more seriously,\" Guttenberg said in a Twitter direct message. \"This customer could have gotten somebody killed. Failure to address this with a policy change will not only lead to loss of customers but increased liability as they are on record as choosing to do nothing but joke about it.\"", "description": "Jersey Mike's is facing boycott threats after posting joking tweets in response to a conversation about gun violence.", "authors": ["Kate Taylor"], "top_image": "https://image.businessinsider.com/5db83c1edee01937c74e23f4?width=1200&format=jpeg", "published_at": "2019-10-29"}