{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/entrances-blocked-rubbish-scattered-as-protesting-students-bring-learning-to-a-standstill-at-wits-20190207", "downloaded_at": "2019-10-24 14:15:48.243648+00:00", "title": "Entrances blocked, rubbish scattered as protesting students bring learning to a standstill at Wits", "language": "en", "text": "The start of classes and daily administration operations were delayed at the University of the Witwatersrand on Thursday, after the student representative council (SRC) continued with protest action.\n\nStudents were unimpressed after protesters disrupted classes and forced them to leave their desks. Police intervened and the protesters fled.\n\nThe SRC is calling on the institution to listen to their demands which relate to accommodation, registration fees and financial exclusion.\n\nEarlier, there was increased tension after protesters tried to fight private security guards who blocked the entrance gate leading to Empire Road. Stones were scattered at the Yale Road entrance.\n\nRubbish from emptied dustbins could be seen across the campus.\n\n\n\nAll entrances leading to Solomon Mahlangu House have also been closed and students have been told to only use the entrance from the Great Hall.\n\n\n\nStudents who wish to enter are required to show their student cards to private security guards, who are stationed outside the hall entrances.\n\nMeanwhile, the university issued an advisory to staff and students on its Twitter page, saying they were required to report to their workstations and classes so that the day's activities could get under way.\n\n\n\n\"CPS is clearing roads and securing lecture theatres to that university activities can continue. Carry your student and staff cards with you. Report incidents,\" the post said.\n\nOn Wednesday, all entrances to the institution were closed to avoid EFF-aligned students, believed to be from the University of Johannesburg (UJ), who were protesting on campus.\n\nA group of students, clad in red, marched along Kingsway Avenue to UJ's Kingsway Campus in Auckland Park where they threw stones and bricks at security guards who retaliated. One protester was injured.\n\n\n\nAlthough there have been engagements with Wits management, students have vowed to continue protesting until their demands are recorded on paper and implemented.\n\n\n\nOn Tuesday, the institution's vice-principal Professor Andrew Crouch told News24 that Wits was unable to meet all demands from the SRC as it would lead to a financial crisis and would increase the university's bad debt, which was already at its peak.\n\nKEEP UPDATED on the latest news by subscribing to our FREE newsletter.\n\n- FOLLOW News24 on Twitter", "description": "The start of classes and daily administration operations have been delayed at the University of the Witwatersrand as the student representative council continued with protest action.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8481/f5cfda97cd254f88a0bc4a0edd312762.jpg", "published_at": "2019-02-07"}