{"pub": "investing.com", "url": "https://za.investing.com/news/stock-market-news/global-marketsbond-yields-up-stocks-flat-on-shifting-ecb-views-1953142", "downloaded_at": "2019-09-10 23:31:49.750056+00:00", "title": "GLOBAL MARKETS-Bond yields up, stocks flat on shifting ECB views", "language": "en", "text": "© Reuters. GLOBAL MARKETS-Bond yields up, stocks flat on shifting ECB views\n\n* German finance minister Scholz hints at big fiscal push\n\n* China factory-gate prices fall sharply in August\n\n* Markets leery before ECB meeting (Updates with close of U.S. markets)\n\nBy Chuck Mikolajczak\n\nNEW YORK, Sept 10 (Reuters) - Bond yields climbed and a gauge of world stock markets recovered from previous lows to trade flat on Tuesday, as uncertainty grew over the mix of stimulus the European Central Bank will add to boost a slumping economy this week amid fresh signs global growth was slowing.\n\nGermany's 30-year benchmark bond yield briefly broke into positive territory for the first time since Aug. 5, while U.S. Treasury yields climbed to three-week highs. U.S. 10-year notes last fell 1 point in price to yield 1.7333%, from 1.622% late on Monday.\n\nThe bond moves come as market participants look toward Thursday's ECB meeting, which is widely expected to deliver a cut to interest rates and point to further bond-buying stimulus. concern has been building that ECB policymakers and other global central banks are reaching the limits of stimulus policies, especially those with negative interest rates and sub-zero long-term sovereign bond yields.\n\n\"As we wait on news on Thursday morning, it's not surprising that people have the jitters of what they're going to hear from the ECB, which has been the focus of attention since the beginning of August,\" said Jim Vogel, interest rates strategist at FTN Financial in Memphis, Tennessee.\n\nThe U.S. Federal Reserve is also widely expected to cut interest rates next week as policymakers attempt to protect the global economy from risks, such as Britain's exit from the European Union.\n\nOn Wall Street, the S&P 500 staged a late rally to post a slight gain, but it was capped in part by technology shares as data from China showing producer prices decline at their sharpest pace in three years in August renewed global recession worries. The climb in yields also weighed on the real estate sector .SPLRCR , which suffered its biggest percentage drop in nearly a month. Dow Jones Industrial Average rose 73.92 points, or 0.28%, to 26,909.43, the S&P 500 gained 0.96 points, or 0.03%, to 2,979.39 and the Nasdaq Composite dropped 3.28 points, or 0.04%, to 8,084.16.\n\nEuropean shares edged higher as the rise in bond yields helped boost bank shares by more than 2%, putting them on track for a fifth day of gains. The bank index is up nearly 9% over that span, its best five-day performance since April 2017.\n\nThe pan-European STOXX 600 index rose 0.10%, while MSCI's gauge of stocks across the globe was flat after falling as much as 0.54% during the session.\n\nGermany's rose after Finance Minister Olaf Scholz said the country was ready to inject \"many, many billions of euros\" into the economy to counter any economic downturn. export-heavy German index was also aided by a Reuters report that Bank of Japan policymakers are more open to discussing the possibility of expanding stimulus at their Sept. 18-19 board meeting due to the broadening fallout of the U.S.-China trade war. currencies, the dollar strengthened but held in a tight range ahead of the ECB meeting, while sterling steadied as investors looked for clarity on the Brexit situation as several British lawmakers launched a new group on Tuesday to bolster efforts to secure a deal to leave the European Union. rose 0.1%, with the euro down 0.05% to $1.1041.\n\nSterling was last trading at $1.2349, up 0.03% on the day.\n\nhttps://tmsnrt.rs/2A8XP5y Global assets in 2019\n\nhttp://tmsnrt.rs/2jvdmXl Global currencies vs. dollar\n\nhttp://tmsnrt.rs/2egbfVh MSCI All Country Wolrd Index Market Cap\n\nhttp://tmsnrt.rs/2EmTD6j\n\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^>", "description": "GLOBAL MARKETS-Bond yields up, stocks flat on shifting ECB views", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEB1Q06W_L.jpg", "published_at": "2019-09-10"}