{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7540463/Tottenham-target-Leicester-City-star-James-Maddison-look-Christian-Eriksen-replacement.html", "downloaded_at": "2019-10-05 12:44:42.155520+00:00", "title": "Tottenham 'target Leicester City star James Maddison' as they look for Christian Eriksen replacement", "language": "en", "text": "Tottenham have lined up Leicester City star James Maddison to replace Christian Eriksen and will rival Manchester United for his signature, according to reports.\n\nDanish midfielder Eriksen has so far refused to sign a new contract at Spurs and appeared determined to secure a move away from the club in the summer.\n\nWith a move away failing to transpire, the 27-year-old has entered the final year of his contract and will therefore be available on a free transfer in the summer- making it likely that Tottenham will look to cash in on him in the January transfer window.\n\nTottenham are set to rival Manchester United for the signature of Leicester's James Maddison\n\nAnd it is Leicester City's latest star Maddison who has been identified as an ideal replacement for the Dane, according to reports in the Daily Star.\n\nHowever, Spurs will face stiff competition from United, who themselves are believed to be confident of securing a £60m deal for the playmaker to take him to Old Trafford.\n\nHe has been linked with Ole Gunnar Solskjaer's men for a sustained period of time due to the Norwegian's desire to add young, homegrown players to his squad in a bid to turn their fortunes around.\n\nTottenham see Maddison (pictured) as an ideal replacement for playmaker Christian Eriksen\n\nEriksen has refused to sign a new deal at Spurs and has entered the final year of his contract\n\nMaddison has been in excellent form so far this season, scoring two goals in his seven Premier League outings which have helped fire Leicester to third position in the Premier League table.\n\nThe impressive start from Brendan Rodgers' men has raised early hopes of Champions League qualification for next season, which could prove a pivotal factor in any potential negotiations with either club.\n\nThe 22-year-old, who joined Leicester from Norwich in a deal worth £20m in June 2018, has nevertheless been rewarded for his excellent performances this campaign with a spot in Gareth Southgate's England squad.\n\nThe Leicester City midfielder also recorded more assists than any other player in the Premier League last season.\n\nOle Gunnar Solskjaer wants to bring Maddison to Old Trafford and could rival Spurs for him", "description": "Tottenham have lined up Leicester City star James Maddison to replace Christian Eriksen and will rival Manchester United for his signature, according to reports.", "authors": ["Kishan Vaghela For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/09/19327932-0-image-a-7_1570264796803.jpg", "published_at": "2019-10-05"}