{"pub": "marketwatch", "url": "https://marketwatch.com/story/apple-let-chinese-suppliers-break-labor-laws-to-produce-new-iphone-says-report-2019-09-09", "downloaded_at": "2019-09-09 11:45:48.531525+00:00", "title": "Apple let Chinese suppliers break labor laws to produce new iPhone, says report", "language": "en", "text": "A day ahead of its key iPhone launch event, Apple Inc. and its biggest supplier Foxconn faced accusations of illegally employing a massive influx of temporary workers in China to push out the company’s next big mobile phone.\n\nChina Labor Watch, a non-profit organization aimed at helping the cause of Chinese workers, released the report on Sunday, just ahead of the Cupertino, California company’s AAPL, -0.01% annual fall event Tuesday, in which at least one new iPhone is expected to roll out.\n\nRead: The iPhone likely won’t be the core of Apple’s iPhone event\n\nExtra temporary workers made up 50% of Foxconn 2354, +0.00% , or Hon Hai Precision Industry Co.’s, workforce as of August 2019. That runs against a not-rigorously enforced, according to CLW, Chinese law that stipulates a company may only employ a maximum of 10% of those workers. CLW noted that Foxconn had rarely used short-term staff prior to 2016, but in 2018 they made up 55% of the workforce.\n\nThe company is supposed to offer bonuses for those workers provided they stay employed for a specific period of time, but many reported not receiving any bonuses. Also, overtime hours were taken away from those who didn’t meet referral quotas, the report said.\n\nApple denied “most” of the allegations. “We looked into the claims by China Labor Watch and most of the allegations are false. We have confirmed all workers are being compensated appropriately, including any overtime wages and bonuses, all overtime work was voluntary and there was no evidence of forced labor,” Apple said in a statement. It added, however that the percentage of short-term workers “exceeded our standards and we are working closely with Foxconn to resolve this issue.”\n\nIn a statement provided to MarketWatch, Foxconn Technology Group said it had found that the Zhengzhou location had “workplace compliance issues” and that the use of dispatch workers was “not consistent with company guidelines. The company said it is taking steps to address the issues and will “closely monitor the situation.”\n\nChina Labor Watch’s annual report revealed the findings of several investigators employed at the plant, one for four years. Conditions for workers over the years period remained unchanged, the group found. For example, a base wage of $295 — insufficient to support a family in Zhengzhou — did not change in those years.\n\n“Apple and Foxconn know that the issue with dispatch workers is in violation of labor laws, but because it is profitable to hire dispatch workers, they haven’t addressed the issue. They have allowed these violations to continue over the years,” said Li Qiang, executive director of China Labor Watch.\n\nOther complaints by the organization included work injuries that went unreported, verbal abuse at the factory and the use of student workers who were also “subject to many restrictions.”", "description": "China Labor Watch (CLW), a non-profit organization aimed at advocating for Chinese workers, released a damning report about the use of temporary workers at...", "authors": ["Barbara Kollmeyer", "Markets Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ898_foxcon_ZG_20190909064533.jpg", "published_at": "2019-09-09"}