{"pub": "nytimes", "url": "https://nytimes.com/2019/10/25/magazine/afghanistan-war-baghlan-austin-miller.html", "downloaded_at": "2019-10-25 22:07:54.155405+00:00", "title": "In One Afghan District, the Same Promises of Victory, 32 Years Apart", "language": "en", "text": "But the residents’ asks were simple: “Our only request is for security,” said Bismillah Atash, a member of Baghlan’s provincial council. The Afghan and American leadership understood; it was something echoed often by those communities that teetered on the edge of Taliban and government control.\n\nFor at least a year, residents of Baghlan had asked for American and Afghan forces to clear out the Taliban who were in Dand-e-Ghuri and Pul-i-Kumri, the same areas the Soviets were trying to clear when Borovik leapt from the back of his Russian armored personnel carrier in 1987. The Taliban had been there for at least four years. The people were tired. Their war, in many ways, was almost 40 years old.\n\nGeneral Sadat, the young commander whom the American military has come to adore and is often seen as the next generation of Afghan leadership, said his forces would take back the areas under Taliban control. They would launch an operation soon, he said. Tea was served. The Americans listened through ear pieces as their interpreter talked quietly into a microphone at the front of the room.\n\n“Until the whole area is clear, we won’t leave,” General Sadat said. “This is our commitment this time.”\n\nUndoubtedly, Afghans have been given this same assurance countless times. And the commanders who say it all leave or move elsewhere. The war goes on.\n\nAs one of the troops who fought in an early phase of the current war, in a period of expansive and seemingly stirring American promises along exactly these same lines, it’s hard to see, even as the Afghan military bears the brunt of the fighting, how in this late-date period of the war, anyone can reasonably expect such promises, from anyone, to stand.", "description": "A Times reporter visits Baghlan Province, where, three decades ago, a Russian journalist documented the same assurances of peace offered to local residents by foreign commanders.", "authors": ["Thomas Gibbons-Neff"], "top_image": "https://static01.nyt.com/images/2019/10/25/magazine/25atwar-newsletter/25atwar-newsletter-facebookJumbo-v3.jpg", "published_at": "2019-10-25"}