{"pub": "americanconservative", "url": "https://theamericanconservative.com/millman/does-the-west-have-a-civilization", "downloaded_at": "2019-10-05 13:40:21.444504+00:00", "title": "Does the West Have a Civilization?", "language": "en", "text": "I’m frankly flabbergasted by this Peter Beinart article about Trump’s speech in Warsaw. Specifically, I am flabbergasted that he wants to let the alt-right define Western Civilization:\n\nThe West is not a geographic term. Poland is further east than Morocco. France is further east than Haiti. Australia is further east than Egypt. Yet Poland, France, and Australia are all considered part of “The West.” Morocco, Haiti, and Egypt are not. The West is not an ideological or economic term either. India is the world’s largest democracy. Japan is among its most economically advanced nations. No one considers them part of the West. The West is a racial and religious term. To be considered Western, a country must be largely Christian (preferably Protestant or Catholic) and largely white. Where there is ambiguity about a country’s “Westernness,” it’s because there is ambiguity about, or tension between, these two characteristics. Is Latin America Western? Maybe. Most of its people are Christian, but by U.S. standards, they’re not clearly white. Are Albania and Bosnia Western? Maybe. By American standards, their people are white. But they are also mostly Muslim.\n\nOk, then! So, India has a civilization. Japan has a civilization. China has a civilization. And inasmuch as the West has a civilization, it can only be defined in racial and religious terms.\n\nThere are really only three ways to take this that I can think of:\n\nEither the folks on the alt-right are correct, and our civilization can only be preserved if we preserve white Christian dominance. I am pretty sure that Beinart doesn’t mean this, but if I agreed with them myself it would be pretty easy to point to Beinart’s piece and say: see? Even Peter Beinart thinks we are right.\n\nOr having a distinct “civilization” is something that the West has transcended, unlike the lesser breeds in China and Egypt who still cling to their particularism, though hopefully one day they will join us in the sunny progressive uplands in their own good time. I rather suspect Beinart does believe something like this, though I am using deliberately inflammatory language to characterize what those beliefs imply.\n\nOr the West has a uniquely odious civilization that must be repudiated to avoid the taint of racism. I don’t actually think Beinart thinks this at all, but I understand why someone like Rod Dreher might take his language to mean he does.\n\nYou don’t have to believe that Western Civilization is under any kind of serious threat to believe that it exists. Nor do you have to believe that Western Civilization is readily defined and delimited within borders to believe that it exists. I mean, ask someone from China or Japan or India or Egypt if they believe Western Civilization exists. I’m confident they will say yes.\n\nBut they won’t define that civilization in exclusively or even primarily racial or religious terms. Indeed, a major point of debate for much of the 19th and 20th centuries in the non-western world was whether modernization required westernization — that is to say, did you have to adopt the institutions, cultural habits and lifestyle of Europe to become modern, industrialized countries able to compete with the countries of Europe in economic and military terms? The modern history of countries like Japan and Turkey is dominated by this debate, a debate that is still not over. And that debate was never about whether they needed to convert to Christianity, much less alter their genes.\n\nWestern Civilization aspires to universality precisely because it is not limited to a particular race or religion — and it was that way from the beginning, as Alexander and his successors sought to forge a new Hellenistic civilization out of the combination of Greek, Persian and Egyptian civilizations. But this universality is aspirational, not actual. “The West” is not coterminous with “the developed world” or “the global community” — and we’d get along better with countries like China if we didn’t behave as if it were.\n\nWill Europe still be “Western” if it becomes a quarter African, or a quarter Muslim? I don’t know — and neither does Beinart. I imagine the answer is path-dependent, that is to say: how that demographic transformation takes place will have a great deal to do with what the continent looks like on the other side of it. There is a great deal of difference between replacing the boards of a ship one by one until none of the original boards remains, and simply building another ship from scratch and asserting it’s the same as the original — much less deciding that “ship” is an oppressive term! That’s one of the reasons we are having a debate about immigration, globally: because the sheer scale of migration is appropriately causing people to ask these kinds of questions. But why on earth should anyone with Beinart’s political commitments concede that the alt-right is correct, and that the answer is unquestionably “no”?\n\nI thought Trump’s speech was awful, because it is based, like his politics generally, entirely on fear. But so is Beinart’s article, only with the values reversed. And nothing — not Western Civilization nor liberalism — will be saved by stoking fear and calling for the will to resist. The only call with any power to save is the call to love.", "description": "", "authors": [], "top_image": "", "published_at": "2017-07-07"}