{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/i-should-have-stolen-that-truck-in-overland", "downloaded_at": "2019-10-01 09:27:55.413344+00:00", "title": "I Should Have Stolen That Truck In Overland", "language": "en", "text": "Survival game Overland is unusually tough. Resources are limited, enemies are plentiful, and even my best runs have gone south quickly. Your car is one of your most important resources, as getting through the game’s levels on foot isn’t viable for long. But when the opportunity arose in one of my recent runs to steal a better car, I just couldn’t bring myself to do it.\n\nIn Overland you occasionally come across traders’ camps where you can barter using items you pick up on your journey. On one run, I found a sparse camp with two armed traders and a dog hovering around a fire. There was a gas can hidden behind some bushes, but when I moved toward it, one of them said it belonged to them and warned me to stay away from it. There was also a truck parked conspicuously close to the level’s exit.\n\nThe car my survivors were driving was in good shape and had gas, but I knew that wouldn’t last long — my gas wouldn’t get me that far, and cars can only survive two collisions with a barrier or a monster before they explode. I walked one of my survivors over to the truck to investigate it, eliciting another warning from the traders. The truck had more gas than my car, as well as a lot of storage space, which I knew would come in handy further in the game.\n\nI spent a while hovering around the truck. There was no immediate need to steal it, but there was no denying it was better that what I had. I wasn’t sure what the traders would do — Overland’s characters have limited moves across a level’s grid, so it seemed easy to get into the truck and escape before they could stop me. Would there be future consequences?\n\nI doubted the traders would chase me down, and if they did, maybe they’d distract a level’s monsters. Maybe stealing the truck would cause problems in future trading camps, but given how few I’d encountered so far, that didn’t seem like such a big risk either. I was having a rare good run and didn’t want to mess things up, but I couldn’t think of a convincing reason not to steal the truck.\n\nI moved my car so it was parked behind the truck. If the nearest trader attacked when we stole it, he’d have to walk a long way around, buying my survivors some time. I moved my other survivor out of the car and had them siphon our remaining gas and gather up out stuff to bring over to the truck for a quick getaway.\n\nThen, I hesitated. It just didn’t seem right to steal the truck, even if there wouldn’t be consequences. As far as I’ve seen so far, there’s no morality system in Overland. Overland presents moral quandaries here and there, but this one seemed to be so utterly devoid of consequences that it barely seemed worth worrying about it. Overland is a tough game, and making it even harder by doing the “right” thing felt ridiculous.\n\nI imagined the traders being stranded at their camp and how terrible it would be, but then again, they weren’t real. Even in the fiction of the game, I was probably never going to see them again. It literally wouldn’t matter if I stole their truck, but... still.\n\nI stood around the level for at least 10 minutes, staring at my Switch screen. Then, I steered my survivors back to our car. I just couldn’t do it. I regretted my decision as soon as I clicked the button to exit the traders’ camp. Usually when I take the moral high ground in a game I feel good about myself, but here, I just felt like I’d doomed my run.\n\nIndeed, a few levels later my car was attacked by monsters and exploded, and my survivors died not long after. Would that truck have gotten me further? Probably. Am I likely to steal a car the next time the opportunity presents itself? Probably not.", "description": "Survival game Overland is unusually tough. Resources are limited, enemies are plentiful, and even my best runs have gone south quickly. Your car is one of your most important resources, as getting through the game’s levels on foot isn’t viable for long. But when the opportunity arose in one of my recent runs to...", "authors": ["Alex Walker", "Zack Zwiezen"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/c4sjrraddl4pwdhegbtc.jpg", "published_at": "2019-10-01"}