{"pub": "nymag", "title": "100-Teen Poll: What Is Actually Cool to Buy?", "url": "https://nymag.com/strategist/article/cool-things-to-buy-according-to-teens.html", "language": "en", "published_at": "2019-07-11", "downloaded_at": "2019-09-02 07:11:36.808585+00:00", "text": "Photo-Illustration: Stevie Remsberg; Photos: Shutterstock (Devon Lee Carson), Getty Images (remaining), Courtesy of the retailers\n\nOver the past couple of months, we posed a slew of shopping questions to more than a hundred teenagers across the city: from neighborhoods including Astoria, Bed-Stuy, East Harlem, Jackson Heights, Park Slope, Ridgewood, West Village, Williamsburg, Woodside, the Upper East Side, and more. (We specifically focused on New York teens as they do, in fact, have a history of knowing it all — biased though we may be.) From our pool of responders (71 percent of whom identified as female, 27 percent as male, and 2 percent as non-binary), we got some surprising insight on the cool factor of denim jackets and Devon Lee Carlson, some less surprising feedback on backpacks and Airpods, as well as more opinions than we ever imagined about the case for Converse Chuck 70s vs. Nike Air Force 1s. Whether you’re shopping for the teen in your life or the teen who still lives inside of you, here are 13 takeaways culled from our discerning pool.\n\n1. Favorite style of jeans: The Mom Jean\n\nAmerican Eagle Mom Jean $20 (was $60, now 67% off) Although mom jeans, in general, had an overwhelming presence in our survey, American Eagle’s high-waisted mom jean was the one that got the most mentions. As one teen named Phoebe put it: “They are super soft and sturdy, and they’re super versatile. I can roll them up or leave them down depending on the aesthetic I’m going for.” Another of our respondents, Celina, noted: “I just love the quality of the denim; it’s very durable but also flexible — it’s possible to distress them on your own if you want. And the waist fits snug but allows movement, so you don’t feel suffocated.” $20 at American Eagle Buy\n\nHonorable Mentions\n\nH&M Mom Jeans “I like H&M’s Mom Jeans because I like their more relaxed fit. In general, H&M’s jeans are affordable, which meant that I was able to try a variety of their styles before I landed on these, which are my favorite.” —Maddy $30 at H&M Buy\n\nVintage Stretch Ultra High-Rise Mom Jeans $35 (was $50, now 30% off) “These Hollister’s Vintage Mom Jeans go well with a number of tops and shoes, mainly because they’re a nice dark color; versatility is a factor I look for when shopping for clothes. I usually wear them with a red sweater and boots. They’re comfortable to walk in.” —Amy $35 at Hollister Buy\n\nPlus, our solution for the teen seeking ‘really distressed’ boyfriend jeans:\n\nAmong her survey responses, one teen named Liznanette told us that she was still on the hunt for her dream pair of jeans — “a boyfriend style that is really distressed.” (She also sent in a street-style inspiration photo that is too low quality to include here.) We put the Cut’s fashion news writer Emilia Petrarca on the case, and here is the very close match she turned up on Liznanette’s behalf.\n\nBDG High-Rise Mom Jean - Destroyed Light Wash “These BDG ‘Mom Jeans’ from Urban Outfitters — where I used to get all my jeans as a teen — seem distressed enough for your liking. In fact, they’re described as ‘destroyed.’ They’ve got a high waist, and a boyfriend baggy fit. I think you don’t want jeans like this to be too baggy, otherwise you’ll look like you stole some jeans from the garbage. But hey, maybe that’s what people are into these days, who am I to judge. If you’d like to go a little less ‘destroyed,’ Levi’s has some good options, too.” —Emilia Petrarca $69 at Urban Outfitters Buy\n\n2. Color preference: Melodramatic Purple\n\nPhoto: New York Magazine\n\nA specific melodramatic purple product mentioned was this nail polish; another teen pointed to this millennial pink planter as a favorite home-décor item.\n\nWe asked two of our respondents in either camp — No Agency models Lumia and Sabrina — to defend their allegiances to Converse Chuck 70s and Nike Air Force 1s over text chat. Read it here, in all its intensity, complete with digressions about veganism.\n\n4. String Lights!\n\nFour teens explain our poll’s most popular piece of décor.\n\nGDEALER 2 Pack 20 Feet 60 Led Fairy Lights $13 (was $16, now 19% off) “My fairy lights give my room a warm and cozy atmosphere! After a long day at school, I drop my backpack, go to my room, and turn on my fairy lights. The warm hue that these lights create help me de-stress and unwind.” —Phoebe $13 at Amazon Buy $13 at Amazon Buy\n\nLED Strip Lights Kit $35 (was $50, now 30% off) “I love these lights because they help to easily enhance and change the tone of the room. Besides that, they are just fun to play around with and look at.” —Jada-Renee $35 at Amazon Buy $35 at Amazon Buy\n\nLED Lantern String Lights “My lantern string lights give a nice homey/warm feeling to my room. Most of the time I don’t even use my actual lights and just leave the lanterns on with a candle burning to make it feel more cozy.” —Florence $16 at Amazon Buy $16 at Amazon Buy\n\nLED Photo Clips String Lights $13 (was $19, now 32% off) “I can hang my Polaroid pictures on these string lights up on my wall, and have them be all lit up so I can look at them while I’m reading before bed. Plus, they kind of give a calming and soft aesthetic to the whole room.” —Sydney $13 at Amazon Buy $13 at Amazon Buy\n\n5. The Everything Brand: Muji\n\nIt was mentioned across several product categories, including…\n\nBeauty\n\nWellness\n\nDécor\n\nAccessories\n\nTravis Scott, Emma Chamberlain, Rihanna, Kendall Jenner, and Chance the Rapper were all called out, too — but not nearly as often.\n\nThe Instagram star and iPhone-case designer appeared more than any other name in response to the question of who most influences your style. “I think it’s how confident she is, willing to try and wear weird or different things,” explained one teen. “Clothes I see on her that I probably wouldn’t like regularly, I like on her. Like here, here, and here. This (tie-dye) outfit isn’t that weird but I think it’s really bold and I don’t wear that much color but this outfit makes me want to.” Another respondent added: “I really love her ’90s aesthetic. I have been super into grungy looks. Her smudged eyeliner, small sunglasses, and baggy jeans are good examples.” (Read what Devon can’t live without here.)\n\n7 . H e r e ’ s h o w d e n i m j a c k e t s , s c r u n c h i e s , a n d w e r e g r a d e d , a c c o r d i n g t o c o o l n e s s . On a scale of 0 to 10 (“0” = not cool), here’s how cool each of these things are, according to teens. Average rating: Denim Jackets, 7; Airpods, 6; Scrunchies, 5; Narwhals, 4; Furry things, 4; Salt lamps, 4; Fanny packs, 4; Barrettes, 4; Tie-dye things, 4; Sparkly things, 3. Photo: New York Magazine\n\n8. And in the backpack corner…\n\nThe most popular (and least surprising) choice was Herschel\n\nHonorable Mentions\n\nFjällräven Kånken Backpack Fjallraven Kanken (also not surprisingly) was the second favorite. $80 at Zappos Buy\n\n9. In sunglasses, a square movement?\n\nHarlow Metal Square Sunglasses Yes, overall the crowd still favored the already-well-established-for-their-coolness circle lenses, but squared and rectangular shapes also showed potential. One teen praised the pair above, and another on the non-round end of the spectrum singled out an Amazon find: “Ugh I live for these sunglasses,” she said. $18 at Urban Outfitters Buy\n\nPlus, 13 different styles of Ray-Bans were cited, including Aviator, oval, and this hexagonal style.\n\n10. The top two resale websites were … Depop (31 percent of votes) and eBay (28 percent).\n\nPhoto: New York Magazine\n\n“Depop is great because there are a lot of rare, one-of-a-kind pieces that make shopping on the app very similar to thrift shopping, which is a popular thing among my generation.” —Jada-Renee\n\n11. The lip moisturizer is clearly Glossier’s Balm Dotcom — but nine others got endorsed.\n\nAfter all, who tries more lip balms than teens? Drugstore brands came up a lot: Palmer’s Cocoa Butter Swivel Stick, eos Visibly Soft, Burt’s Bees, Smith’s Rosebud Salve, and Vaseline (“It displays a natural looking lip, while simultaneously providing hydration and glow, leaving my lips soft and shiny”). And since this is New York, so did some really expensive versions, like ones from Tarte, Laneige, and La Mer (“It tastes like sweet mint”). Of Glossier’s Balm Dotcom, we were told, “I can’t live without this. I know it’s a bit pricey, but it’s really good and also the packaging is cute!”\n\nPlus, one teen’s complete morning beauty routine:\n\n“I start by washing my face with Morning Burst cleanser from Clean and Clear,” says Reese. “I then put on sunscreen moisturizer from Origins. I have very sensitive skin when it comes to sunscreen. Like most of them burn my face but this one doesn’t. Then I use the Pep Start from Clinique for my under eyes. Now onto makeup! I use Boy Brow on my brows, which works great. Then I curl my eyelashes and apply mascara. If I have the time I will put on highlighter using the light pink shade from this Sleek highlighter palette. As a final touch I put on some plain old Carmex, but if I am feeling fancy I will add some lip gloss to it.”\n\n12. What they can’t live without: Airpods\n\nApple AirPods $145 (was $159, now 9% off) Second to their phone, this is what most teens said they always have on them (or want on them). “Ninety percent of my friends use their Airpods every day,” said Charlie. “They are easy to carry around and have very good sound.” $145 at Amazon Buy $144 at Walmart Buy\n\n13. And a few one-off items teens desire that we thought were just delightful.\n\nInflatable Pocky Sticks [Editor's note: These were part of a limited-edition promo. Only the original, Pocky biscuit sticks are currently available for purchase.] $13 at Amazon Buy $13 at Amazon Buy\n\nConverse Chuck 70s vs. Nike Air Force 1s\n\nLumia: Air forces are cuter, obviously. And you can slip them on rather than having to lace up Converse every time you put them on\n\nSabrina: High tops make your ankle and legs look slimmer and are more versatile than clunky Air Force 1s. I wouldn’t wear Air Force 1s with just anything.\n\nLumia: Air Forces are also cuter when you draw on them vs Converse so they’re definitely more versatile and realistically Air Forces are much flyer than Converse on. Air Forces are the most ideal sneaker to dress down a skirt or dress to wear in the every day. And I think everyone knows that by now.\n\nSabrina: Air Force 1s are too athleisure for me. Converse is classic and comfortable like blue jeans.\n\nLumia: I wore Converse back in my day, before I knew better, and I would have to buy new ones after three months of wear.\n\nSabrina: Converse r vegan…\n\nLumia: Also?? Realistically??? Nike > Converse.\n\nSabrina: Air Force 1s are singlehandedly destroying the planet.\n\nLumia: It only matters that Converse are vegan if u eat vegan.\n\nSabrina: Ever heard of climate change? Yeah.\n\nLumia: Plus I’m pretty sure Air Forces are vegan too if you’re gonna go there, it’s synthetic leather.\n\nSabrina: Leather takes 50 years to decompose, canvas takes one.\n\nLumia: Hence why Air Forces last forever.\n\nSabrina: Rubber sole takes 80 years, I’d rather the Earth last longer than my shoes tbh.\n\nLumia: But if you have shoes that last forever rather than buying multiples of the same shoe then isn’t the production of less material better for Earth?\n\nSabrina: Maybe Air Force 1 wearers just don’t care about the environment tho…\n\nLumia: Are u even vegan?\n\nRe: the colorway, Air Force 1’s in white are all u need, if you want them in a different color u can just paint them.\n\nSabrina: Yeah I like the colorways of Converse.\n\nLumia: Whereas the only kind of cute Converse are the black ones and painting them would probably look trash.\n\nSabrina: Painting white Air Force ones would look so fucking nasty are you kidding. That shit would chip in like two seconds whereas Converse has multiple cute colors as well as limited-edition colors and patterns … options babe.\n\nLumia: Closing arguments are that Air Forces are cuter, easier to put on, more versatile, and don’t break your feet in half when u try to break them in, and they also don’t break once broken in.\n\nSabrina: Air Force 1s are ugly, make ur legs look thick and disproportionate, make everything look athleisurey, shitty style-bloggery, or instathotty.\n\nConverse are classic, go with everything, anyone can wear them, don’t make ur legs look like a centaur body, and are better for the environment.\n\nLumia: The leg thing is literally untrue and is what Converse do to ur legs.\n\nSabrina: I stand by what I said, converse r hot.\n\nLumia: She’s not even vegan.\n\nNike Air Force 1 Basketball Sneakers $90 at Nordstrom Buy\n\nget the strategist newsletter Actually good deals, smart shopping advice, and exclusive discounts. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nThe Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.", "description": "New York City teens share the cool things they have or want, including American Eagle mom jeans, Glossier Balm Dotcom, Herschel backpacks, Ray-Ban sunglasses, Airpods, and the two most popular sneakers, Converse Chuck 70s and Nike Air Force 1s.", "authors": ["Trupti Rami"], "top_image": "https://pixel.nymag.com/imgs/daily/strategist/2019/07/09/09-teenspo.w1200.h630.jpg"}