{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7599737/Luke-Evans-shows-incredible-abs-gym-selfie.html", "downloaded_at": "2019-10-22 13:45:41.668614+00:00", "title": "Luke Evans shows off his incredible abs in gym selfie", "language": "en", "text": "Luke Evans has left his followers amazed with his incredibly buff physique.\n\nThe 40-year-old actor unveiled the results of his recent transformation on his Instagram account on Monday, sharing a jaw-dropping picture of his abs.\n\nThe Beauty And The Beast star posted: 'Finally!! I’m seeing my abs, hell! that was NOT easy!! #40andfit #mondaymotivation #training #fitat40'.\n\nImpressive: Luke Evans has left his followers amazed with his incredibly buff physique, sharing a snap of his abs on Instagram on Monday\n\nLuke has been hellbent on getting into the best shape of his life and regularly posts pictures from his intense training sessions, sharing his workout regime with his followers.\n\nAlongside a recent gym selfie, he wrote: 'Back to the grind....#tuesdaymotivation #training'.\n\nWhile Luke has long been a fan of the gym, he recently confessed he 'ate a lot of pasta' while filming Netflix comedy Murder Mystery in Portofino last summer with Jennifer Aniston and Adam Sandler, and his training had suffered for it.\n\nTransformation: Luke has always been a gym fan (pictured in late 2018), but has been hellbent on getting into the best shape of his life\n\nThe star covered Men's Health in 2014 and told the magazine about all the hard work he's put into his physique.\n\nThe Welsh actor described the 'epiphany' he had upon recognising his body did not match up to his career aspirations.\n\n'I realised that if I was going to do this job I would have to train a lot. It was a big f**ker', he said.\n\nPutting in the work: The Welsh actor described the 'epiphany' he had upon recognising his body did not match up to his career aspirations\n\nThe Hobbit star and ultimate foodie said he hates how 'miserable' the diet is when he trains - especially because he can't enjoy a drink.\n\n'I love my food and I like wine and it's really tough. What I miss most is alcohol. When everyone is having a drink and you can't it stops you going out as much.'\n\nHowever, he recognises the importance of indulging once in a while to give his body a break.\n\nHe said: 'Even when you're training you have to have a cheat day every week... I don't need to be super-ripped all year round. That's a pretty miserable way to live your life.'", "description": "Luke Evans has left his followers amazed with his incredibly buff physique. The 40-year-old actor unveiled the results of his recent transformation on his Instagram account on Monday.", "authors": ["Kate Thomas For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/11/20029728-0-image-a-173_1571739012283.jpg", "published_at": "2019-10-22"}