{"pub": "usatoday", "url": "https://usatoday.com/story/sports/ncaaf/big12/2019/10/26/kansas-state-stuns-oklahoma-damage-college-football-playoff-hopes/2469369001", "downloaded_at": "2019-10-27 00:18:53.020188+00:00", "title": "Unranked Kansas State pulls off shocking upset of No. 5 Oklahoma", "language": "en", "text": "CLOSE SportsPulse: USA TODAY Sports' Paul Myerberg provides his opinion of the top three programs in the history of college football. USA TODAY\n\nKansas State seriously damaged the College Football Playoff hopes of No. 5 Oklahoma with a stunning a 48-41 upset victory.\n\nThe Wildcats (5-2, 2-2 Big 12) seemed to put the game out of reach early in the fourth quarter by grabbing a 48-23 lead before holding off a late OU comeback attempt.\n\nThe victory was the first win for Kansas State against a top five team since 2006.\n\n“The guys just continued to believe throughout the game,” Wildcats coach Chris Klieman said. “I saw a sideline full of guys who really felt they had a chance to win this football game.”\n\nThe Wildcats used a formidable ground attack to pull off the shocker, as running back James Gilbert accounted for 105 of the team's total 219 rushing yards, while QB Skylar Thompson (213 yards passing) ran for four rushing touchdowns. All six of the team's scores were running TDs.\n\nKansas State Wildcats wide receiver Wykeen Gill gets past Oklahoma Sooners safety Delarrin Turner-Yell (32) into the end zone for a touchdown. (Photo: Scott Sewell, USA TODAY Sports)\n\nOU quarterback Jalen Hurts threw for 395 yards and rushed for 96 in the loss.\n\nKansas State trailed Oklahoma 17-7 in the first quarter after two rushing scores by Hurts but stormed back to lead 24-23 at halftime. Oklahoma went scoreless in the third quarter as KSU comfortably pulled ahead before leading 48-23 early in the fourth.\n\nOU then mounted a massive rally. Hurts hit CeeDee Lamb for a 70-yard score and then his rushing touchdown with 5:36 left cut the deficit to 10. The Sooners defense then made a stand and Gabe Brkic sliced the score to 48-41 off a field goal with 1:45 left.\n\nThe Sooners recovered the ensuing onside kick, but the play was overturned by replay after it showed receiver Trejan Bridges touched the ball before it went 10 yards. Oklahoma contended Bridges was blocked into the ball on the onside kick, but the Wildcats took over and ran out the clock.\n\n“We had a similar situation at Baylor my first year. They engaged our player and it definitely hit him before the 10-yard,” Sooners coach Lincoln Riley said, “but I was under the impression if they engage our player into it that there’s no illegal touching. It was a 50-50 call that didn’t go our way.”\n\nOklahoma (7-1, 4-1) now faces a tall test in staying in the playoff picture after the Big 12 slip-up. The Sooners were in previous playoff projections entering the week, but now will have competition with other one-loss teams and lack a meaningful victory on its schedule beside No. 15 Texas.\n\n“We’ve got to be more appreciative, cherish every moment and attack every moment with the right intent,” Hurts said. “We’ve got to learn from this and appreciate this lesson.”\n\nContributing: The Associated Press", "description": "No. 5 Oklahoma saw its College Football Playoff hopes seriously damaged after being stunned by unranked Kansas State for its first loss of season.", "authors": ["Scott Gleeson", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/26/USAT/38587251-23d9-49c7-9153-a657c9aa6a52-USATSI_13572244.jpg?crop=2999,1687,x0,y218&width=3200&height=1680&fit=bounds", "published_at": "2019-10-26"}