{"pub": "abcnews", "url": "https://abcnews.go.com/Lifestyle/wireStory/young-sam-clemens-signature-found-mark-twain-cave-65906701", "downloaded_at": "2019-09-28 01:13:36.482693+00:00", "title": "Sam Clemens' signature appears to be on Mark Twain Cave wall", "language": "en", "text": "A pair of Mark Twain enthusiasts who have searched for more than two decades say they've found what appears to be Samuel Clemens' signature from his youth scrawled on the wall of the Missouri cave he made famous in \"The Adventures of Tom Sawyer.\"\n\nIn the mid-1800s, long before he took on the pen name Mark Twain, Clemens and his young pals romped around the cave near the Mississippi River on the outskirts of Hannibal.\n\nAs a group of Twain scholars toured what is now known as the Mark Twain Cave this summer, cave owner Linda Coleberd, self-proclaimed \"Twainiac\" Cindy Lovell and two others broke off in search of the long-elusive signature, which was long believed to be among the thousands of names signed on the cave's limestone walls.\n\nAs Coleberd waved the group's lone flashlight around an otherwise dark area of the cave, Lovell says she happened to catch the beam of light as it shined on a signature: \"Clemens,\" written in pencil.\n\nLovell, former director of Hannibal's Mark Twain Museum who now works in New Smyrna Beach, Florida, couldn't contain her excitement.\n\n\"I started yelling, 'Clemens! Clemens! I see Clemens!'\" she recalled.\n\nIt wasn't until weeks later that a high-resolution photo of the signature revealed \"Sam\" etched at the same place, indicating the signature was that of the famed author and not a relative.\n\nThe signature was discovered in July, but details weren't announced until this week, only after several Twain experts were able to study the signature and determine it was almost certainly real.\n\nClemens was born in Florida, Missouri, in 1835, but his family moved to Hannibal when he was 4. He stayed until he was 17, and the people and places he knew from the rough-hewn river town were fodder for his most famous works.\n\nThe cave itself became a tourist destination after the 1876 publication of \"The Adventures of Tom Sawyer,\" as people flocked to the place that inspired some of the book's key adventures — where Tom and Becky got lost, where Tom and Huck found the treasure box, and where Injun Joe died.\n\nToday, the cave, 3 miles (5 kilometers) long, is among the most popular tourist sites in the town of 17,500 residents that draws hundreds of thousands of visitors each year. Each adult pays $19.95 for a one-hour cave tour.\n\nLovell and Coleberd have been searching for Clemens' signature for a quarter of a century. It was a daunting task.\n\nThe cave's size and popularity made finding any hint of Clemens' signature difficult because the brown walls are covered with an estimated 250,000 names scrawled in everything from pencil to candle wax to berry juice. It wasn't until 1979, after the cave was named a National Historic Landmark, that writing on the walls was prohibited.\n\nOn July 26, Lovell and Coleberd decided to search again. While the scholars in town for a symposium known as the Clemens Conference toured the lit portion of the cave, they set out in a darkened area known to have thousands of signatures. Two men from the group tagged along.\n\nThe foursome had wandered for only a few moments when Lovell says she made her startling discovery. She took cellphone photos and immediately began sharing them with experts to authenticate the signature.\n\nLovell meanwhile took her brother-in-law, David Leaning, to the site with his high-resolution camera. His photos showed the word \"Sam\" or \"Saml\" (a common abbreviation for Samuel in the mid-19th century) etched, but not written, at the same site. Lovell believes Clemens likely started to etch his name, found it difficult, and wrote his last name \"in a beautiful cursive\" in pencil.\n\nTwo leading experts on Twain and his handwriting — Auburn University at Montgomery professor emeritus Alan Gribben and rare books collector and dealer Kevin Mac Donnell of Austin, Texas — agreed the signature is likely authentic.\n\nMac Donnell, who owns a large collection of Twain first-edition books, letters, photos and artifacts, said the signature traits — including rounded humps on the \"m'' and a short tail on the \"s,\" match up with Clemens' signature from 1853, the year he moved away from Hannibal.\n\nGribben said it's logical that the young Clemens signed his name because the cave meant so much to him — and because he had a big ego.\n\n\"He had a temperament from a very early age to want to be noticed, wanting a record of himself everywhere,\" Gribben said.\n\nTwain isn't the only famous person to sign his name in the cave. Lovell, in 2012, found \"N. Rockwell\" on a wall about 30 feet (9 meters) from where the artist Norman Rockwell sketched in 1936. Coleberd said a signature from the outlaw Jesse James, whose gang hid in the cave, has been authenticated. It was even dated: Sept. 22, 1879.\n\n\"We're not a made-up Disneyland fun park,\" Coleberd said. \"This is the real deal. Mark Twain spent a lot of time in here as a kid because it was such a wonderful playground. I just knew his name was in here somewhere.\"", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Lifestyle/WireAP_b14d79b7a3df4eaabf16835d727519a2_16x9_992.jpg", "published_at": "2019-09-27"}