{"pub": "investing.com", "url": "https://investing.com/news/politics/selling-impeachment-democrats-search-for-common-message-against-trump-1986470", "downloaded_at": "2019-09-26 03:59:06.852900+00:00", "title": "Selling impeachment: Democrats search for common message against Trump", "language": "en", "text": "© Reuters. FILE PHOTO: House Speaker Nancy Pelosi announces Trump impeachment inquiry at the U.S. Capitol in Washington\n\nBy John Whitesides and Susan Cornwell\n\nWASHINGTON (Reuters) - Facing the tough task of selling voters on an impeachment inquiry against President Donald Trump, Democrats struggled on Wednesday to craft a unified message explaining why he might deserve to be removed from office.\n\nIn the halls of Congress, on the campaign trail and on social media, many Democrats said Trump's pressure on Ukraine's president to investigate Democratic presidential front-runner Joe Biden was a clear-cut argument for an impeachment inquiry.\n\n\"This is about the future. This is about protecting America's election and America's national security. It is a matter I think that is not difficult to understand,\" House of Representatives Majority Leader Steny Hoyer told reporters.\n\nDemocrats with military and intelligence backgrounds described the impeachment investigation as a duty, not a political fight they relished.\n\n\"In a district like mine, everything's risky,\" said U.S. Representative Abigail Spanberger, a former CIA officer who flipped a Republican district in Virginia last year that had voted for Trump in 2016.\n\nThe allegations against Trump are \"a significant threat to our national security,\" she told constituents in a letter. \"We should want to know definitively if they are true, or if they are false.\"\n\nOthers Democrats from Trump-voting districts were concerned that House Speaker Nancy Pelosi's decision to launch an impeachment inquiry was not fully explained and could backfire, hurting Democrats in the 2020 elections.\n\nU.S. Representative Jeff Van Drew, a New Jersey Democrat, said he did not mind an investigation but was not ready to back impeachment. Drew said he had faced some pressure from colleagues to change his mind and get on board.\n\n\"It's not pressure like someone putting you in a headlock, but it is pressure like 'Gee, we are all doing this together, we all have the same message.' And that's not true,\" he told reporters.\n\nA House Democratic lawmaker who requested anonymity to discuss the handling of the inquiry said there was nervousness among more moderate members about whether Pelosi would hold a floor vote on impeachment, forcing them to go on the record.\n\n\"The party's really operating on different tracks right now, and that can be confusing for the public,\" said Colin Strother, a spokesman for Representative Henry Cuellar's re-election campaign in Texas.\n\n\"There's definitely a gulf between the people that are 'Impeach, no matter what,' and the people that are 'Follow the evidence.'\"\n\nPelosi, who had resisted demands for an impeachment inquiry for months out of fear of the political repercussions, changed her mind after reports that Trump pressured Ukrainian President Volodymyr Zelenskiy in a July 25 telephone call to investigate Biden and his son Hunter, who had worked for a company drilling for gas in Ukraine.\n\nA defiant Trump, whose administration released on Wednesday a summary of the call, denied any impropriety and said Democrats launched the impeachment inquiry \"because they can't beat us at the ballot.\"\n\nPublic opinion polls indicate voters might not be ready for the impeachment of Trump.\n\nA Reuters/Ipsos poll released on Tuesday, before Pelosi made the case for impeachment, found 37% of Americans thought Trump should be impeached, down from 41% in September.\n\nIn public, Democrats largely brushed off concerns about the risks and said the issue was bigger than everyday politics.\n\n\"History will remember those who put politics aside at this time of crisis and treated it like the moral moment that it is,\" said Democratic presidential candidate Cory Booker.\n\nMost Democratic presidential contenders for the nomination to take on Trump in next year's election support an impeachment inquiry, including Biden and U.S. Senators Elizabeth Warren, Bernie Sanders, Kamala Harris and Amy Klobuchar.\n\n\"It is the constitutional responsibility of Congress to hold this man accountable,\" Warren told reporters in Keene, New Hampshire.\n\nEven some congressional Democrats facing tough re-election battles weighed in. In a tweet on Tuesday night, U.S. Senator Doug Jones, who faces a difficult path to re-election in conservative Alabama, backed a congressional investigation of Trump and Ukraine.\n\n'WINNING ON MESSAGING?'\n\n\"I'm not certain that the Democrats are winning yet in terms of the messaging game. In the presidential Democratic primary, there's a lack of a clear message – obviously anti-Trump, but not much more,\" said Scot Schraufnagel, a political scientist at Northern Illinois University.\n\nPelosi's change of heart followed announcements of support for an impeachment inquiry from several more moderate Democratic lawmakers, including a Washington Post column earlier this week by seven first-term House Democrats with military and national security backgrounds, including Spanberger.\n\nU.S. Representative Elissa Slotkin, one of the seven, said she had been urging Democrats to communicate clearly what they are investigating. She did not deny earlier reports she told a closed-door meeting of Democrats on Tuesday that \"if you are asking us to stay on message, give us a goddamn message to stay on.\"\n\n\"I am doing everything I can to explain to people how I came to the decision. Because my hope is, even if they disagree with the decision, they give me the benefit of the doubt,\" Slotkin said.\n\nAbsent any other unified message, Dan Kildee, the Democrats’ chief deputy whip in the House, described the Post column as \"sort of our manifesto at this point.\"\n\nDemocrats were heartened by what they saw as possible cracks in the usually monolithic Republican ranks of Trump supporters.\n\nOn Tuesday, not a single Senate Republican spoke out against a resolution urging the White House to hand over the whistleblower complaint on Ukraine to the intelligence committees in Congress.\n\nSome Democrats said the more straightforward details of the Ukraine call made the issues easier for voters to understand than previous controversies that engulfed Trump, including the lengthy investigation into possible Russian interference and collusion in the 2016 election.\n\n\"This is a much easier case to make than some of the Russia stuff,\" said Jim Manley, a Democratic strategist and former aide to Senators Harry Reid and Edward Kennedy.\n\nBut he said Democrats would need a point person to deliver a \"clear and coherent message\" on the need for impeachment. He suggested one of the House committee chairmen leading investigations such as Adam Schiff, who heads the House Intelligence Committee.\n\nSchiff agreed the Ukraine flap would be easier to explain to voters, saying Trump's conversation with the Ukrainian leader read \"like a classic mob shakedown.\"", "description": "Selling impeachment: Democrats search for common message against Trump", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8P01E_L.jpg", "published_at": "2019-09-26"}