{"pub": "townhall", "url": "https://finance.townhall.com/columnists/danieljmitchell/2019/09/05/while-de-blasio-fiddles-new-york-city-burns-n2552662", "downloaded_at": "2019-09-06 12:08:46.799057+00:00", "title": "While De Blasio Fiddles, New York City Burns", "language": "en", "text": "In 2016, Bernie Sanders was considered very extreme for wanting to transform America into a very expensive European-style welfare state.\n\nIf the Democratic Party’s presidential debates this summer are any guide, that radical approach is now mainstream. Almost all the candidates have been competing over who could most quickly turn American into Greece.\n\nThe Mayor of New York City, Bill de Blasio, was especially determined to show that he was even more radical than Bernie Sanders. At one point, while watching de Blasio bellow about class-warfare taxes, I thought about a satirical version of the Pizza Hut commercial, with the Vermont Senator exclaiming “No one out-crazies the Bern.”\n\nBut give de Blasio credit for tryring. His only signature moment in an otherwise lackluster campaign occurred when he said he wanted to “tax the hell out of the wealthy.”\n\nHe even has a www.taxthehell.com website where he outlines his various proposals to cripple investment and entrepreneurship by imposing confiscatory taxes.\n\nIn other words, he is like Crazy Bernie in that he seems to really believe in ever-larger government. Consider these excerpts from a Q&A session he did with New York Magazine.\n\n…our legal system is structured to favor private property. I think people all over this city, of every background, would like to have the city government be able to determine which building goes where, how high it will be, who gets to live in it, what the rent will be. I think there’s a socialistic impulse, which I hear every day, in every kind of community, that they would like things to be planned in accordance to their needs. And I would, too. Unfortunately, what stands in the way of that is hundreds of years of history that have elevated property rights… Look, if I had my druthers, the city government would determine every single plot of land, how development would proceed. And there would be very stringent requirements around income levels and rents. That’s a world I’d love to see, and I think what we have, in this city at least, are people who would love to have the New Deal back, on one level. They’d love to have a very, very powerful government, including a federal government… I’m calling for a millionaires tax… need to see the wealthy paying their fair share. It frustrates me greatly that we don’t have the power here to tax the wealthy in this city.\n\nNot only does he talk the talk, he also walks the walk.\n\nAlbeit in a bad way.\n\nHere are some excerpts from a news report about one of his attacks on property rights.\n\nLiberal New York City Mayor Bill de Blasio is rolling out a new plan that would potentially allow the city government to seize buildings of landlords who force tenants out — a plan his opponents say amounts to “straight communism.” De Blasio…wants to take action against landlords who try to force tenants out by making the property unliveable — and pulled out an executive order to create a Mayor’s Office to Protect Tenants. He said that in the event the government intervenes, the buildings would then be controlled by a “community nonprofit.” …“My first reaction was: Is this communist Cuba?” state Assemblymember Nicole Malliotakis, who ran against De Blasio in the 2017 mayoral race, told Fox News. “ I can say that as a daughter of Cuban refugees who fled Castro’s Cuba in 1959, this is what happened to her family, she had her home taken, my grandfather had his gas station taken.” “This is extreme even for Mayor de Blasio, because we know that he has socialist leanings, but this is straight communism and I think it’s very scary to America-loving, democracy-loving people.”\n\nBy the way, I’m guessing that landlords are in a tough position because of NYC’s rent control laws.\n\nTo be fair, many of the problems in New York City didn’t start with de Blasio.\n\nThere’s a long history of wasting money.\n\nTo be more specific, unfunded pensions are the biggest reason NYC is in deep trouble.\n\n…the city is staring bankruptcy in the face. …but there’s been little talk about one of the main causes of the city’s growing debt: public employee pensions. As of today, nearly 75 percent of the city’s $197.8 billion deficit is due to pension and other retirement liabilities. …Sick of high taxes, residents and businesses are already leaving in droves… NYC offers five different pension plans to its municipal employees, from teachers to members of the school board. These pensions serve as a source of retirement income to former city employees and are defined benefit plans, meaning that benefits are guaranteed by the employer. …it’s no surprise that the pension plans’ funded ratio, which shows the ratio of the plans’ assets to liabilities, has dropped to 71.4 percent for NYCERS and 58.6 percent for TRS—thanks to accumulated debt. …for every dollar spent on NYCERS payroll, 34 cents goes toward pensions, and that number is 10 cents higher for TRS. …Pension contributions make up 11 percent of the city’s total budget and consume 17 percent of the city’s tax revenues. And it’s worth remembering that in the city ranked number one in local tax burden in the United States.\n\nAs you might suspect, Mayor de Blasio certainly isn’t doing anything to address this problem.\n\nI’m simply noting that the problem existed before he took office and presumably would still exist with any other mayor.\n\nAnd there are other officials in New York City who deserve scorn.\n\nManhattan District Attorney Cy Vance is a traveling man with some high-end tastes. The prosecutor spent $249,716 on meals and work trips to everywhere from the City of Angels to the City of Lights over the past five years, according to records obtained via a Freedom of Information Law request. Vance paid for it all – including a $4,780 roundtrip flight to London and a $2,800 stay at a five-star Paris hotel – with money his office obtained from state-asset forfeiture funds largely tied to big-sum legal settlements with banks, records show. He controls more than $600 million stemming from forfeitures. …the other city district attorneys say they did not use asset forfeiture money to cover their work travel expenses. …Vance also does not skimp when it comes to eating out… He spent $645 at Patroon on East 46th Street to cover dinner… Vance also has expensed five meals at Tribeca’s Odeon for a total of $897… During his Paris visit, he spent $94 at Le Nemrod, $124 at Marco Polo, $72 at Le Saint Regis and $169 at Le Christine, according to the expense reports. …DAs have wide-ranging flexibility on how asset forfeiture money is used. Expenditures must cover “law enforcement” issues — but few other rules exist.\n\nHere’s a map showing Vance’s travel.\n\nBy the way, the most outrageous part of this story isn’t the luxury travel or the expensive meals.\n\nWhat really irks me is that his high-flying lifestyle is made possible by asset forfeiture, which is what happens when the government steals someone’s property – oftentimes without any finding of guilt!\n\nThe bottom line is that New York City has a terrible mayor, but the problem goes way beyond one person.\n\nWhich is why this final story, from Bloomberg, should be the canary in the coal mine when contemplating the future of the city.\n\nNew York leads all U.S. metro areas as the largest net loser with 277 people moving every day — more than double the exodus of 132 just one year ago. Los Angeles and Chicago were next with triple digit daily losses of 201 and 161 residents, respectively. This is according to 2018 Census data on migration flows to the 100 largest U.S. metropolitan areas compiled by Bloomberg News. …While New York is experiencing the biggest net exodus, the blow is being softened by international migrant inflows. From July 2017 to July 2018, a net of close to 200,000 New Yorkers sought a new life outside the Big Apple while the area welcomed almost 100,000 net international migrants. …Some areas are affected by high home prices and local taxes, which are pushing residents out and deterring potential movers from other parts of the country. About 200,000 residents left New York last year. Los Angeles had a decline of nearly 120,000 and Chicago fell by 84,000.\n\nHere’s the map showing the cities losing the most people and gaining the most people.\n\nBy the way, it’s no coincidence that most of the fast-growth cities are in states with no income taxes.\n\nP.S. Mayor de Blasio wants to “tax the hell out of the wealthy” in New York City, but fortunately he’s been somewhat frustrated in that goal because of limits on his power.\n\nP.P.S. Because taxpayers in NYC no longer have unlimited ability to deduct their state and local taxes on their federal returns, the 2017 tax law almost certainly is contributing to the exodus from New York City. And every time one of those taxpayers escape, NYC gets closer to fiscal crisis.", "description": "In 2016, Bernie Sanders was considered very extreme for wanting .09/06/2019 8:06:49AM EST.", "authors": ["Daniel J. Mitchell", "Matt Vespa", "Leah Barkoukis", "Timothy Meads"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/239/c4730426-217c-4f2d-b876-906815e62427.jpg", "published_at": "2019-09-05"}