{"pub": "guardian", "url": "https://theguardian.com/film/2019/sep/13/100-best-films-movies-of-the-21st-century", "downloaded_at": "2019-09-13 07:21:46.314622+00:00", "title": "The 100 best films of the 21st century", "language": "en", "text": "100\n\nOnce Upon a Time in Hollywood (2019)\n\nQuentin Tarantino’s latest jaw-dropper bumps Kill Bill: Vol 1 off the list in gloriously irreverent fashion. Leonardo DiCaprio and Brad Pitt star as a fading western star and his mutt-loving stunt double in this relaxed and loving roast of bygone Tinseltown. CS\n\nRead the review\n\n99\n\nBright Star (2009)\n\nAn early lead for Ben Whishaw as the ailing John Keats romancing Fanny Brawne (Abbie Cornish) is the tremulous soul of this underappreciated Jane Campion drama. The butterflies are too tropical for Hampstead, but the rest is spot-on. CS\n\nRead the review\n\n98\n\nThe Dark Knight (2008)\n\nThe only comic book movie to make the cut is Christopher Nolan’s genre masterpiece: fatalist, bracing and forever the legacy of Heath Ledger, posthumously awarded an Oscar for his terrifying performance. CS\n\nRead the review\n\n97\n\nFahrenheit 9/11 (2004)\n\nMichael Moore’s finest hour: a blazing juggernaut with George W Bush, the Iraq war, the media, democracy and us, the gullible masses, in its crosshairs. Agitprop, and essential. CS\n\nRead the review\n\nFacebook Twitter Pinterest Paul Giamatti and Kathryn Hahn in Private Life. Photograph: Jojo Whilden/Netflix\n\n96\n\nPrivate Life (2018)\n\nKathryn Hahn and Paul Giamatti struggle to start a family, and to keep their marriage together, in this subtle, funny and often wondrously uncomfortable Netflix comedy written and directed by Tamara Jenkins. CS\n\nRead the review\n\n95\n\nCall Me By Your Name (2017)\n\nRarely has summer lust been so headily captured as in Luca Guadagnino’s breakout Italian romance. Transformative leads from Timothée Chalamet and Armie Hammer captured the collective imagination; Michael Stuhlbarg gently grounded realities. CS\n\nRead the review\n\nFacebook Twitter Pinterest Maximus attitude … Russell Crowe in Gladiator. Photograph: Dreamworks/Sportsphoto/Allstar\n\n94\n\nGladiator (2000)\n\nRidley Scott’s deluxe Roman blockbuster is toga soap turned up to the absolute maximus. Russell Crowe bellows and glowers opposite hyper-evil Joaquin Phoenix and lugubrious Oliver Reed (who died during production). Yet there are many grace notes under the fire and fury. CS\n\nRead the review\n\n93\n\nYou, the Living (2007)\n\nThe second in Roy Andersson’s trilogy of wackily incisive Swedish vignettes comes at you thick and fast – about 50 micro-sketches, sometimes loosely linked – yet sticks like plasticine beneath your fingernails. CS\n\nRead the review\n\n92\n\nThe Hurt Locker (2008)\n\nKathryn Bigelow’s extraordinary story of a controlled explosions team – headed by a never-better Jeremy Renner – is intense, immersive and impossible to shake. CS\n\nRead the review\n\n91\n\nEtre et Avoir (2002)\n\nEvents soured after the shoot but Nicolas Philbert’s sole big hit remains a disarmingly funny study of a graceful and kind schoolteacher caring for a motley crew of under-11s in rural France. CS\n\nRead the review\n\nFacebook Twitter Pinterest Vital tale of love and clubbing … Eden. Photograph: Barbara Kinney/Eden\n\n90\n\nEden (2012)\n\nEven non-ravers can’t fail to be shaken by Mia Hansen-Løve’s vital tale of love and clubbing, vaguely based on the rise of Daft Punk. Giddy yet gripping. CS\n\nRead the review\n\n89\n\nThe Selfish Giant (2013)\n\nClio Barnard’s second feature doesn’t have the shock of innovation of her verbatim cinema debut, The Arbor, but the story of two lads scrapping around junkyards to escape their homes is a masterpiece of lyrical social realism. CS\n\nRead the review\n\nFacebook Twitter Pinterest Savagery … Gomorrah. Photograph: Mario Spada/AP\n\n88\n\nGomorrah (2008)\n\nDirector Matteo Garrone announced himself big-time with this blazing screen treatment of Roberto Saviano’s fearless account of the contemporary activities of Neapolitan mobsters: a thoroughly chilling chronicle of corruption and savagery rendered in tremendous style. AP\n\nRead the review\n\n87\n\nThe Wind that Shakes the Barley (2006)\n\nWhen Ken Loach won the Palme d’Or at Cannes for his film about the Irish rebellion against British rule, the tabloids went on the attack (Daily Mail: “Why Does Ken Loach hate his country so much?”). None of them had actually seen the film, a powerful, compassionate drama starring Cillian Murphy and Padraic Delaney as Republican brothers split by the civil war that followed independence in 1922. CC\n\nRead the review\n\nFacebook Twitter Pinterest Javier Barden in No Country for Old Men. Photograph: Allstar/Paramount Vantage\n\n86\n\nNo Country for Old Men (2007)\n\nThe Coens’ Cormac McCarthy adaptation is a scorching study of benevolence and evil with rich and weathered turns from Tommy Lee Jones, Josh Brolin and a glossily horrible one from Javier Bardem. CS\n\nRead the review\n\n85\n\nBurning (2018)\n\nOne of the recent stream of fine dramas issuing from South Korea, Lee Chang-dong’s adaptation of a Haruki Murakami story is an elusive, unsettling thriller, in which a young writer reconnects with a former schoolfriend, only to find she mysteriously disappears after a trip away. AP\n\nRead the review\n\nFacebook Twitter Pinterest Hypnotic experimentalism ... Tropical Malady. Photograph: Kick the Machine Films\n\n84\n\nTropical Malady (2005)\n\nA young solider and a feral boy fall in love, dance to the Clash then trek to the jungle searching for a shaman dressed up as a tiger. Thai master Apichatpong Weerasethakul’s hypnotic experimentalism has never been bettered; sorry, Uncle Boonmee. CS\n\nRead the review\n\n83\n\nThe Son’s Room (2001)\n\nNanni Moretti’s Palme d’Or-winning drama about a father crippled by grief after the accidental death of his child is not for the faint-hearted. Yet the Italian writer/director/star performs miracles making a movie so wrenching also so hopeful. CS\n\nRead the review\n\n82\n\nStories We Tell (2012)\n\nSarah Polley followed Away From Her and Take This Waltz by turning the camera on her own family secrets in this tricksy and compassionate documentary uncovering the true identity of her father. CS\n\nRead the review\n\nFacebook Twitter Pinterest Upset … Katie Jarvis and Michael Fassbender in Fish Tank. Photograph: Holly Horner\n\n81\n\nFish Tank (2009)\n\nAndrea Arnold’s bad mum high-rise dance tragedy is singular, sensuous and alive with everyday upset. Actor Katie Jarvis took six years off after shooting; roughly the same as audiences needed to recover from the shake it gave, and the sight of Michael Fassbender. CS\n\nRead the review\n\n80\n\nRequiem for a Dream (2000)\n\nHubert Selby Jr’s lacerating novel that lasers in on the exhilaration and tragedy of addiction is given expansive, stylish treatment by the then-emerging director Darren Aronofsky. Incredibly glamorous and miserably heartbreaking, this film gave notice of Aronofsky’s brilliance. AP\n\nRead the review\n\nFacebook Twitter Pinterest It still looks unique … Persepolis. Photograph: Marjane Satrapi/Vincent Paron\n\n79\n\nPersepolis (2007)\n\nIranian-French director Marjane Satrapi adapted her own graphic novel in this animated fantasy-memoir about a 10-year-old girl growing up in Tehran after the 1979 revolution. A real original, and it still looks unique. AP\n\nRead the review\n\n78\n\nOcean’s Eleven (2001)\n\nSteven Soderbergh is the Renaissance man of American cinema, and this intricately crafted heist movie – remade from the old Frank Sinatra chestnut – shows him on never-bettered, commercially minded form. George Clooney is at his most Cary Grant-ish as the leader of the crack team of robbers. AP\n\nRead the review\n\nFacebook Twitter Pinterest Wildly romantic ... Lost in Translation. Photograph: The Ronald Grant Archive\n\n77\n\nLost in Translation (2003)\n\nSofia Coppola’s second feature stands up: utterly distinctive, wildly romantic and fleetingly queasy. Scarlett Johannson and Bill Murray are impeccable casting as the unlikely soulmates thrown together in high-rise Tokyo. CS\n\nRead the review\n\n76\n\nTen (2002)\n\nIranian director Abbas Kiarostami had already proved himself a master in the late 20th century; this simple but effective piece – featuring a woman driving different people around Tehran – proved he could do it in the 21st. Kiarostami and his star Mania Akbari conjure knotty drama out of a series of conversations about marriage, family, religion and sex. AP\n\nRead the review\n\n75\n\nPhilomena (2013)\n\nStephen Frears brings tonal tact and unobtrusive genius to this wonderfully funny and touching real-life tale of an Irish natterer (Judi Dench) and cynical reporter (Steve Coogan) who demolish red tape and challenge evil nuns to try to find her long-lost son. CS\n\nRead the review\n\nFacebook Twitter Pinterest Supercharged … Tahar Rahim in A Prophet.\n\n74\n\nA Prophet (2009)\n\nFrench film-maker Jacques Audiard’s blistering arthouse prison thriller begins with a 19-year-old rookie prisoner (Tahar Rahim) being made an offer he can’t refuse by the mob: execute a police informant or be killed. The murder, a brutal struggle with a razor blade in a six by eight cell, is unforgettable. It’s the start of the kid’s prison education. A film supercharged with edginess. CC\n\nRead the review\n\n73\n\nLove & Friendship (2016)\n\nWhit Stillman, Kate Beckinsale and Chloë Sevigny reunite 20 years after Metropolitan for the most blindingly funny – and faithful - Jane Austen adaptation yet. Spun from her first novel, Lady Susan, this is the tale of an epically bitchy and ambitious widow upending her nearest and dearest. Beckinsale has never been better; Tom Bennett steals the show as the fantastically dim lord lined up for her daughter. CS\n\nRead the review\n\n72\n\nWaltz With Bashir (2008)\n\nIsraeli soldier-turned-film-maker Ari Folman’s film is a kind of animated companion to Apocalypse Now, a hallucinatory statement about the trauma of conflict and the madness of war. It’s an autobiographical documentary, Folman interviewing the men he fought alongside, aged 19, in the first Lebanon war of 1982. He has repressed his memories of the time. The film’s climax is the massacre of Palestinian refugees by Christian Phalangists at the Sabra and Shatila refugee camps. CC\n\nRead the review\n\nFacebook Twitter Pinterest Juvenile emancipation … Capernaum. Photograph: Lifestyle pictures/Alamy\n\n71\n\nCapernaum (2018)\n\nA sprawling drama that functions both as an excoriating treatise on the nature of poverty in Lebanon, and an idiosyncratic drama in which a child takes his parents to court for their ill-treatment of him. We tend to think of the latter type of juvenile emancipation as the province of overprivileged westerners, but director Nadine Labaki makes it work in the toughest of social circumstances: a 12-year-old, living in the Beirut slums, takes steps to deal with his parents’ neglect. A highly original and affecting film. AP\n\nRead the review\n\n70\n\nAnchorman: The Legend of Ron Burgundy (2004)\n\nSuch was the glut of Judd Apatow-ish comedies to come our way about 10 years ago that it’s easy to forget what a gem this is; how deep and weird the performances (stand up, Steve Carell), how fast the laughs and rich the detail. CS\n\nRead the review\n\nFacebook Twitter Pinterest Inventive … Paddington 2\n\n69\n\nPaddington 2 (2017)\n\nHugh Grant recently called this the best film in which he’s ever been involved – and he might well be right. Paul King did the unthinkable and made a sequel to his insta-classic yet more charming, inventive and across-the-generations entertaining. CS\n\nRead the review\n\n68\n\nMr Turner (2014)\n\nPassed over by the British and American film academies – though Timothy Spall’s glorious grunting lead was rightly recognised by Cannes – Mike Leigh’s painter biopic is meticulous, moving and still underappreciated. CS\n\nRead the review\n\n67\n\nDogtooth (2009)\n\nYorgos Lanthimos’s debut film was the only one, in the end, to make our list; its tonal idiosyncrasy and battily unsettling story and performances just edging out Alps, The Lobster and The Favourite. CS\n\nRead the review\n\nFacebook Twitter Pinterest Doomed … Jake Gyllenhaal, left, and Heath Ledger in Brokeback Mountain. Photograph: Kimberly French/AP\n\n66\n\nBrokeback Mountain (2005)\n\nAng Lee’s romance missed out to Crash for the best picture Oscar, but its legacy as a five-hankie ode to doomed romance lives on. Jake Gyllenhaal and Heath Ledger star as the farmhands whose love survives marriages, years of separation – and even death. CS\n\nRead the review\n\n65\n\nHappy as Lazzaro (2018)\n\nA beautiful, strange dream of a film, Italian director Alice Rohrwacher’s drama looks at first as if it’s set sometime in the dim and distant, a portrait of villagers exploited by feudal oppression. But no, there’s a mobile phone. OK, a flip-phone, but this is modern rural Italy. Well, the first half, anyway. After that, it’s complicated, with a flight into magic realism or perhaps even reincarnation. CC\n\nRead the review\n\n64\n\nThe Incredibles (2004)\n\nThe Guardian’s Peter Bradshaw ranked The Incredibles as Pixar’s best ever film, the jewel in the crown. And only Pixar could make a superhero movie for kids about a midlife crisis. Mr Incredible is living in suburbia with his family after one lawsuit too many. Edna Mode, fashion designer to the supers, is an utter delight: “This is a hobo suit, dahlin, you can’t be seen in it!” CC\n\nRead the review\n\nFacebook Twitter Pinterest Impossible to turn away ... Ezra Miller and Tilda Swinton in We Need to Talk About Kevin. Photograph: Cannes Film Festival/EPA\n\n63\n\nWe Need to Talk about Kevin (2011)\n\nLynne Ramsay didn’t soften the blows adapting Lionel Shriver’s bestselling novel about a Columbine-style high-school massacre. A what-if feminist parable, this is a movie that thinks the unthinkable: what if a mother doesn’t like her child, or even love him? And the casting is killer, with Ezra Miller as Kevin and Tilda Swinton playing the mother. It’s a bruising watch, but Ramsay makes it’s impossible to turn away. CC\n\nRead the review\n\n62\n\nWaiting for Happiness (2002)\n\nMalian director Abderrahmane Sissako won a lot of admirers for this slow-burn study of life in a west African town. Returning to Mauritania, his country of birth, Sissako puts together a string of vignettes and encounters, linked together by a returning, westernised student who can barely remember the local language. AP\n\nRead the review\n\n61\n\nThe Souvenir (2019)\n\nJoanna Hogg’s belated international breakthrough is a story of extraordinary specificity – young Hogg has disastrous affair while living in Knightsbridge and studying as a film student in the early 1980s – with rare cut-through and relatability. Honor Swinton Byrne is astonishing in her first film; Tom Burke inch-perfect as the charming but parasitic older man. CS\n\nRead the review\n\n60\n\nTed (2012)\n\nSeth MacFarlane’s brief ascent to the Hollywood firmament was down to this scabrously funny talking-bear farce, which helped reinvent the grossout comedy. Mark Wahlberg is great as the straight man to the foul-mouthed toy of the title, with Mila Kunis as his censorious fiancee. MacFarlane’s creation was simultaneously endearing and outrageous. AP\n\nRead the review\n\n59\n\nGangs of Wasseypur (2012)\n\nMammoth two-part Indian crime film that’s a long, long way from Bollywood. Directed by Anurag Kashyap, this is conceived on a giant scale, as generations of three gangster families fight for supremacy over the course of half a century. Stylish, visceral film-making, violent and hard-hitting, it’s got a valid claim to be India’s answer to The Godfather. AP\n\nRead the review\n\n58\n\nWuthering Heights (2011)\n\nAndrea Arnold tossed out the costume drama rulebook with her raw, passionate retelling of Emily Brontë’s novel. I’d argue the case for Wuthering Heights as one of the most criminally underrated movies of recent years – though it’s been influential, blazing a trail for stripped-back period movies such as Lady Macbeth. Arnold was an early adopter of inclusive casting, too, giving the role of Heathcliff to black actor James Howson. CC\n\nRead the review\n\n57\n\nLeave No Trace (2018)\n\nIt took Winter’s Bone’s Debra Granik eight years to get this off the ground, but was worth the wait: a brilliantly moving eco drama with Ben Foster and Thomasin McKenzie as a father and daughter living off grid in an Oregon forest, but whose relationship and priorities are changed as the child begins the transition to adulthood. AP\n\nRead the review\n\n56\n\nBehind the Candelabra (2013)\n\nRelegated to telly in the US, Steven Soderbergh’s wondrously funny and lavish Liberace biopic had a cinema release in the UK. Michael Douglas cast vanity aside and caution to the wind with virtuosic results as the promiscuous ivories-tickler; Matt Damon was terrific against type as his lover, Rob Lowe pinched and uproarious as their much-employed cosmetic surgeon. CS\n\nRead the review\n\nFacebook Twitter Pinterest An elaborately choreographed procession of tableaux and set pieces ... Russian Ark. Photograph: Allstar/Cinetext/ARTIFICIAL EYE\n\n55\n\nRussian Ark (2002)\n\nGroundbreaking single-shot paean to the Winter Palace in St Petersburg from Russian director Alexander Sokurov. Exploiting then newly developed video technology, Sokurov crafted an elaborately choreographed procession of tableaux and set pieces that explored three centuries of Russian history and culture, from the imperial era to the wartime siege of Leningrad. AP\n\nRead the review\n\n54\n\nThe Social Network (2010)\n\nAfter the Cambridge Analytica revelations, the treachery and backstabbery in Aaron Sorkin and David Fincher’s Facebook origin tale looks positively quaint – the geeks and nerds fighting over who had the idea for Facebook first. Nevertheless, this is still an outrageously watchable hatchet job. Jesse Eisenberg is a knockout Mark Zuckerberg, the smartest guy in the room (though not sartorially, in flip-flops and a hoodie). CC\n\nRead the review\n\nFacebook Twitter Pinterest A documentary with evocative lyricism... Fire at Sea. Photograph: PR\n\n53\n\nFire at Sea (2016)\n\nA beautifully shot observational documentary about the continuing humanitarian crisis in the Mediterranean: the lethally dangerous boats that carry refugees from Africa and end up on the Italian island of Lampedusa. Shot by director Gianfranco Rosi with an evocative lyricism that sits in counterpoint to the blazing anger at the film’s heart. AP\n\nRead the review\n\n52\n\nAmores Perros (2000)\n\nA film that grabs you by the neck and shakes hard, this brutal crime drama announced the Mexican director Alejandro González Iñárritu as a major new talent in 2000. (And lumbered him for the while with the label “Mexico’s Tarantino”.) A film of mayhem and fury, three stories intersect around a car crash in which one of the passengers is a champion fighting dog. CC\n\nRead the review\n\nFacebook Twitter Pinterest Flying fighters … Crouching Tiger, Hidden Dragon. Photograph: Columbia TriStar Films\n\n51\n\nCrouching Tiger, Hidden Dragon (2000)\n\nWestern audiences unfamiliar with the wuxia martial arts genre had never seen anything like Ang Lee’s dazzling 18th-century-set epic in 2000 – fighters flying through the air with balletic grace. In the most exhilarating scene, the daughter of a regional governor (Ziyi Zhang) goes sword-to-sword with a famous warrior (Chow Yun-fat) in the branches of bamboo trees swaying high above the ground. CC\n\nRead the review\n\n50\n\nBefore Sunset (2004)\n\nIn Richard Linklater’s gorgeous, romantic Before Sunrise, a pair of twentysomethings (Julie Delpy and Ethan Hawke) spent the day together in Vienna. Here in the second movie when they meet again in Paris for another brief encounter, they are in their 30s. So the questions are for grownups. Am I with the right person? Where did my life go? It also has the best line ever about being in a couple with small children: “I feel like I’m running a small nursery with someone I used to date.” CC\n\nRead the review\n\n49\n\n24 Hour Party People (2002)\n\nMichael Winterbottom and Steve Coogan’s truth-tickling hit a high note with this joyful sorta-biopic of the record label boss and broadcaster Tony Wilson. Playful, ingenious and prodigiously informative, it’s a triumph of vision over verite. It’s also a total blast. CS\n\nRead the review\n\nFacebook Twitter Pinterest Elegant … Gillian Anderson and Eric Stoltz in The House of Mirth. Photograph: Cine Text/Sportsphoto/Allstar\n\n48\n\nThe House of Mirth (2000)\n\nTerence Davies utilised Gillian Anderson’s poised elegance to good advantage in this brilliantly controlled adaptation of the Edith Wharton novel. Anderson plays Lily Bart, the woman whose reputation and standing are gradually sullied until she becomes an unmarriageable outcast in end of 19th-century America. AP\n\nRead the review\n\n47\n\nMargaret (2011)\n\nHere’s another dark American tale from Manchester by the Sea writer-director Kenneth Lonergan (Margaret was completed in 2007 but only released in 2011 after a wrangle with the studio). Set in post 9/11 New York, Anna Paquin is an overentitled teenager partly responsible for a tragic accident. As in Manchester by the Sea, the effect is shattering; it is like watching actual lives fall apart. CC\n\nRead the review\n\nFacebook Twitter Pinterest Murder, family strife and supernatural shenanigans ... Volver. Photograph: United Archives GmbH/Alamy Stock Photo\n\n46\n\nVolver (2006)\n\nArguably Penélope Cruz’s finest performance, in one of Pedro Almodóvar’s key films: a heady stew of murder, family strife and supernatural shenanigans. Cruz plays a woman forced to kill and bury her ex-husband, while her dead mother appears to he haunting her hairdresser sister. All is resolved after various traumas are lanced. AP\n\nRead the review\n\n45\n\n13th (2016)\n\nIntense, anger-driven documentary from Ava DuVernay on the racialisation of the US’s justice system, positing the idea that the massively disproportionate incarceration of African-American men is simply slavery by another name. With a title referring to the constitutional amendment that abolished slavery, DuVernay suggests that privatised prisons, cheap labour and light-touch capitalism are all in it together. Tough stuff. AP\n\nRead the review\n\n44\n\nToni Erdmann (2016)\n\nA knockout blow for the lazy, patronising stereotype that Germans don’t have a sense of humour, Maren Ade’s Toni Erdmann is one of the funniest films to hit (arthouse) cinemas in years. It’s the story of a workaholic management consultant (Sandra Hüller) whose embarrassing dad turns up unannounced for the weekend wearing joke-shop false teeth. A genuine one-off, the film is partly a satire on Europe, globalisation and workplace misogyny, as well as being a prickly sweet father-daughter movie. CC\n\nRead the review\n\nFacebook Twitter Pinterest Outrageously entertaining … The Wolf of Wall Street. Photograph: Paramount/Everett/Rex\n\n43\n\nThe Wolf of Wall Street (2013)\n\nPossibly the most fun anyone’s had at the cinema so far this century, Martin Scorsese’s The Wolf of Wall Street ought to be a cautionary tale. It’s based on the autobiography of crooked stockbroker Jordan Belfort, convicted in 1999 for fraud and money-laundering. But why focus on regret, when there are hookers, drugs and fast cars? Leonardo DiCaprio is outrageously entertaining as Belfort. CC\n\nRead the review\n\n42\n\n4 Months, 3 Weeks and 2 Days (2007)\n\nThe film whose Palme d’Or win heralded the arrival of a new wave of Romanian cinema. A young woman, helped by her friend, arranges an illegal abortion in the late 80s; the squalid events that follow parallel the decay and chaos of the country as the communist dictatorship began to collapse. Harrowing but clear-sighted. AP\n\nRead the review\n\nFacebook Twitter Pinterest The most twisted of love stories ... The Handmaiden. Photograph: Allstar/Amazon Studios\n\n41\n\nThe Handmaiden (2016)\n\nThe Handmaiden is one of cinema’s great literary adaptations: Park Chan-wook transposes Sarah Waters’s crime novel Fingersmith from Victorian London to Korea in the 1930s. In this most twisted of love stories, a pickpocket (Kim Tae-ri) poses as maid to a wealthy heiress (Kim Min-hee). But who is the double-crosser? Depending on your tastes, a candidate for sexiest film of the century. CC\n\nRead the review\n\n40\n\nUnrelated (2007)\n\nAt the age of 47, after a career directing TV soaps such as Casualty and EastEnders, Joanna Hogg reinvented herself as auteur of a new breed of cinema. In her feature debut, Unrelated, Kathryn Worth played a fortyish woman holidaying in Tuscany with two dysfunctional families and flirting outrageously with one of the lads (Tom Hiddleston in his first movie). A cinema of awkwardness, wielding a scalpel on the well-to-do middle classes, was born. CC\n\nRead the review\n\n39\n\nMeek’s Cutoff (2010)\n\nKelly Reichardt is a master of slow cinema, the maker of films about American outsiders, living without a safety net. Meek’s Cutoff is a western set in 1840s Oregon, following three families on the wagon train west. Their leader is show-offy Stephen Meek (Bruce Greenwood), but Reichardt’s focus, as is customary for her, is on the women – a trio played by Michelle Williams, Zoe Kazan and Shirley Henderson. CC\n\nRead the review\n\nFacebook Twitter Pinterest Despair … Yilmaz Erdogan and Firat Tanis in Once Upon A Time in Anatolia. Photograph: Everett Collection/Rex\n\n38\n\nOnce Upon a Time in Anatolia (2011)\n\nHere’s a police procedural with a difference by the Turkish director Nuri Bilge Ceylan – the whodunnit and why playing second fiddle to long stretches of silence. It’s set in rural Turkey where officials are spending the night driving a murder suspect around looking for a body. What they find, however, is mostly existential despair. Not exactly easy viewing, but it’s a masterpiece of slow cinema. CC\n\nRead the review\n\n37\n\nDogville (2003)\n\nLars von Trier’s Brechtian parable about coercive capitalism remains arguably the Danish provocateur’s masterpiece. Nicole Kidman and Paul Bettany both excel in this study of a woman on the run from gangsters who is offered shelter in a small town in return for undertaking chores. Von Trier’s use of stylised, floor-painted sets is the inspired final touch. AP\n\nRead the review\n\n36\n\nA Separation (2011)\n\nThe film begins with a couple in front of a judge asking for a divorce. She wants to leave Iran and take their daughter. He cannot go; his elderly father is sick. Everyone behaves badly in Asghar Farhadi’s desperately painful family drama. Farhadi’s superpower is empathy, making the audience see all points of view. He lays depth charges in seemingly inconsequential moments with emotionally thrilling consequences. CC\n\nRead the review\n\nFacebook Twitter Pinterest Sensational … Tom Courtenay and Charlotte Rampling in 45 Years. Photograph: Agatha A. Nitecka/AP\n\n35\n\n45 Years (2015)\n\nBritish director Andrew Haigh’s quietly devastating drama is a deeply moving portrait of marriage with the shiver of a ghost story. Charlotte Rampling and Tom Courtenay play a Norfolk couple planning their 45th wedding anniversary. A week before the party, a letter lands on their doormat like a hand grenade with news of his early lost love. Rampling is sensational. CC\n\nRead the review\n\n34\n\nThe Child (L’Enfant, 2002)\n\nThe Dardenne brothers’ second Palme d’Or was bestowed on this stark portrait of underclass desperation, filmed in their characteristic hyper-naturalist manner. Jérémie Renier plays a petty criminal who sells his newborn baby in the adoption black market, but his devastated girlfriend’s response forces a kind of redemption. AP\n\nRead the review\n\n33\n\nThe Royal Tenenbaums (2001)\n\nProbably most Wes Anderson-y of Wes Anderson’s films and certainly his finest, with a to-die-for cast and the best fur coat in the history of cinema. Gwyneth Paltrow, Luke Wilson and Ben Stiller are the Tenenbaum siblings, all former child prodigies. The brilliance has faded. Who’s to blame? Enter paterfamilias Royal Tenenbaum (Gene Hackman), a man who consoles his grieving grandsons with: “I’m sorry for your loss. Your mother was a terribly attractive woman.” CC\n\nRead the review\n\n32\n\nGravity (2013)\n\nIf we are living through a golden age of space movies, here’s where it started, Alfonso Cuarón’s spectacular thriller, shot with unbearable tension and Discovery Channel realism. Sandra Bullock is the rookie astronaut with George Clooney by her side, a living, breathing Buzz Lightyear. When a storm of debris hits the pair, a terrifying fight for survival ensues. Astoundingly good. CC\n\nRead the review\n\n31\n\nAnomalisa (2015)\n\nCharlie Kaufman’s existential breakdown with stop-motion puppets is a miniature masterpiece of concept and execution. David Thewlis voices the depressed motivational speaker to whom everyone sounds the same – except for Jennifer Jason Leigh’s scarred sales agent. “What is it to be human?” asks Michael Stone (Thewlis). “To ache?” Few films try to answer: this Fabergé egg of a film does. CS\n\nRead the review\n\n30\n\nLeviathan (2014)\n\nThe hardest-drinking movie on our list - with some stiff competition - Andrey Zvyagintsev’s anti-Putin polemic is brilliant, ballsy and completely sozzled. Our hero fisherman is forced from his home so that the corrupt local mayor can build his own palace on the site. A priest speaks of “reawakening the soul of the Russian people” as their spirits lie crushed at his feet. Corruption is so endemic, these people have even lost God. This is the most almighty achievement. CS\n\nRead the review\n\n29\n\nNebraska (2013)\n\nBruce Dern discards his marbles on a windmill-tilting road trip with loving but frustrated son Will Forte. Alexander Payne’s black-and-white ode to small-town America is his best this century (Sideways has not aged like a fine wine). It also features June Squibb being completely filthy. CS\n\nRead the review\n\n28\n\nThe Tree of Life (2011)\n\nTerrence Malick’s return to cinema six years after The New World has been vaguely tainted by the slew of woozy filmic xeroxes that have followed, but his first comeback – in which Brad Pitt and Jessica Chastain stand in for his parents in 1950s Texas – is a choking knockout. CS\n\nRead the review\n\nFacebook Twitter Pinterest Glorious camp … The Grand Budapest Hotel. Photograph: Fox Searchlight Pictures/Sportsphoto/Allstar\n\n27\n\nThe Grand Budapest Hotel (2014)\n\nJust nudging Gene Hackman’s Tenenbaum clan down the list, Wes Anderson’s glorious 1930s confection is a delight with a hard nugget of politics at its core. Ralph Fiennes’s central turn as charming concierge M Gustave, all beneficent sex and abashed camp, remains the man’s finest hour. CS\n\nRead the review\n\n26\n\nA One and a Two (Yi Yi, 2000)\n\nEdward Yang’s final film is a delicate domestic miracle: the story of one family seen through the perspectives of the father, the son and the daughter. A wedding begins proceedings, a funeral ends them. The stuff in the middle is the everyday, dissected with rare beauty and gravity. CS\n\nRead the review\n\nFacebook Twitter Pinterest Chilling … Daniel Kaluuya in Get Out. Photograph: Universal Pictures\n\n25\n\nGet Out (2017)\n\nJordan Peele’s debut is a perfect, hard-polished gem of a film. A race satire that skewers beautifully, it’s also a chilling comedy, a proper horror and 104 minutes of complete entertainment. CS Read the review\n\n24\n\nIda (2013)\n\nBrief as a dream and just as devastating, Paweł Pawlikowski’s black and white story of a novice nun on a road trip with her aunt in 1962 Poland to discover the fate of her Jewish parents is spare, shocking and utterly unforgettable. CS\n\nRead the review\n\n23\n\nBorat: Cultural Learnings of America for Make Benefit Glorious Nation of Kazakhstan (2006)\n\nStill Sacha Baron Cohen’s finest moment, a feature-length upscaling of his ludicrously hilarious TV character, whose purpose is to sucker the unsuspecting into condemning themselves out of their own mouths. Borat is on a trip in the US to try to marry Pamela Anderson; not everything works, but when it does it’s astounding: cruelly revelatory and hysterically funny at the same time. AP\n\nRead the review\n\nFacebook Twitter Pinterest Mysterious … Spirited Away. Photograph: Disney/Everett/Rex Features\n\n22\n\nSpirited Away (2001)\n\nHayao Miyazaki’s wondrous animation, the greatest success of a spectacular run from Japan’s Studio Ghibli. A gentle, mysterious fable about a 10-year-old girl whose family stumble upon a haunted bathhouse After her parents are turned into pigs, she works to lift the curse, encountering a variety of spirit-world beings along the way. AP\n\nRead the review\n\n21\n\nThe White Ribbon (2009)\n\nMichael Haneke won his first Palme d’Or with this chilling, steel-hard parable set in Germany just before the first world war. The inhabitants of a small village are dogged by mysterious, violent incidents that serve mostly to exacerbate the dysfunctional social codes they all live by – and elliptically suggests the moral climate that evolved into Nazism. AP\n\nRead the review\n\nFacebook Twitter Pinterest Lyrical … Roma. Photograph: Carlos Somonte/AP\n\n20\n\nRoma (2018)\n\nDespite lingering controversy over its adoption by Netflix in its war with the film industry, Roma still stands as an absolutely major work. Mexican auteur Alfonso Cuarón returned to the Mexico City of his childhood, telling the story of a middle-class family and their nanny-cum-maid in swooning, lyrical black and white. Part memoir, part elegaic fiction, Cuaron hit the heights with this. AP\n\nRead the review\n\n19\n\nLincoln (2012)\n\nSteven Spielberg’s portrait of the great US president looked at the time like a history lesson come to life: graced by a monumental, Oscar-winning performance by Daniel Day-Lewis, it detailed the arm-twisting and chicanery behind the passing of his slave-freeing constitutional amendment. These days, it looks like a fantasy: a president with principles: who’d have thought? AP\n\nRead the review\n\n18\n\nA Serious Man (2009)\n\nThe Coen brothers don’t really do personal, but this is as close as they’ve got (so far). Set in their home town of Minneapolis in the late 60s, A Serious Man stars Michael Stuhlbarg as an academic whose life is roiled by continuing uncertainty and self-doubt – triggering repeat visits to his rabbis, a marriage breakdown and extended interactions with his oddball brother. AP\n\nRead the review\n\n17\n\nThe Great Beauty (2013)\n\nThe Young Pope director Paolo Sorrentino crafted this swooningly beautiful love letter to Rome – “la grande bellezza” – in its decadent, jaded glory. Toni Servillo, Sorrentino’s regular onscreen foil, plays journalist Jep Gambardella, a bon viveur beginning to sense the dying of his personal light, and hunting out meaning and substance in the world around him. AP\n\nRead the review\n\nFacebook Twitter Pinterest Almost unwatchable … An Act Of Killing. Photograph: Real/Novaya Ze/Rex/Shutterstock\n\n16\n\nThe Act of Killing (2012)\n\nAn extraordinary documentary about the wave of barbaric killings that swept Indonesia in the mid-60s. Orchestrated by director Joshua Oppenheimer, this film revisits the perpetrators of some horrific events and asks them – with little need for encouragement – to re-enact them. The result is almost unwatchable: the murderers’ glee at performing, and the remorse they may or may not experience as a result. AP\n\nRead the review\n\n15\n\nShoplifters (2018)\n\nJapanese director Hirokazu Kore-eda won the Palme d’Or for this exquisitely turned drama that – like much of Kore-eda’s previous output – explores what it is to be a family in entirely non-conventional circumstances. A shoplifting gang take in a young girl who seems abandoned; how they hang together – or not – is the film’s key theme. AP\n\nRead the review\n\n14\n\nWhite Material (2009)\n\nOne of Isabelle Huppert’s finest performances, and that’s saying something. Director Claire Denis drew on her own upbringing in colonial west Africa to give this study of a hard-as-nails plantation owner a pungent whiff of authenticity. Huppert is Maria, obsessed with getting in the coffee harvest as a violent civil conflict moves ever closer. Saddled with an untrustworthy husband and an erratic son, it’s all she can do to survive. AP\n\nRead the review\n\nFacebook Twitter Pinterest Acute … Dennis Quaid and Julianne Moore in Far From Heaven. Photograph: Allstar/Cinetext/USA Films\n\n13\n\nFar From Heaven (2002)\n\nFrom director Todd Haynes, this is pastiche at its most brilliantly acute. Haynes takes the bold, vivid melodrama beloved of Douglas Sirk, and reconfigures it to fully reveal the social faultlines of race, sex and class that were considerably more latent in the original. A beautifully crafted act of ancestor worship. AP\n\nRead the review\n\n12\n\nSon of Saul (2015)\n\nBrutally visceral fable that plunges the viewer headlong into the all-encompassing horror of a Nazi extermination camp. Shot in remorseless, unforgiving close-up by first time Hungarian director László Nemes, the story of a Jewish prison-camp worker whose job it is to help clear the gas chamber of corpses is cinema at its absolute rawest. AP\n\nRead the review\n\n11\n\nMulholland Drive (2001)\n\nA magisterial achievement from David Lynch, despite the difficulties he had getting it off the ground. Originally conceived as the pilot of a new TV series, this expertly fuses Lynch’s softcore pulp obsessions with his trademark creepy surrealism. Naomi Watts was the big discovery here: she plays a wannabe actor who midway seems to switch personalities with another, more jaded one. AP\n\nRead the review\n\nFacebook Twitter Pinterest Fearless … Team America: World Police. Photograph: Melinda Sue Gordon/AP\n\n10\n\nTeam America: World Police (2004)\n\nThe most audacious slaughter of sacred cows seen on celluloid, Matt Stone and Trey Parker’s marionette action-musical is a gleeful hail of precision-aimed bullets. It’s totally fearless: pops are taken at Hollywood, Broadway, evil dictators, gung-ho superpowers, the intelligence service, bleeding heart liberals, actors – especially actors – before signing off with a devastating, if obscene, defence of US interventionism. Politically, it’s scattergun; satirically, it’s spot-on. Mostly, though, it’s just ferociously funny, even if most of the humour does, finally, come from the sight of the 2ft puppets tottering around, getting drunk, having wild sex, attempting to walk through doorways and wrestling panthers played by kittens. CS\n\nRead the review\n\n9\n\nZama (2017)\n\nAn official working for the Spanish crown descends into madness while waiting for a transfer out of his backwater post in 18th-century Paraguay in Lucrecia Martel’s fevered historical drama. Like a disorienting dream, it’s a film of fragments, moments that worm their way into your memory – a slave limping with flayed feet, a llama barging into frame during an uncomfortable meeting. Daniel Giménez Cacho is petty, wretched Zama, clinging to his white man’s sense of importance (and his ill-fitting periwig), a symptom of colonial rot. Martel has been called “the Malick of Latin American cinema” but this feels closer to Herzog. A strange masterpiece. CC\n\nRead the review\n\nFacebook Twitter Pinterest Revelatory … Moonlight. Photograph: David Bornfriend/AP\n\n8\n\nMoonlight (2016)\n\nThe triumph of Barry Jenkins’s coming-of-age tale over La La Land for the best picture Oscar was extraordinary in all sorts of ways, of which Faye Dunaway’s envelope mixup was maybe the least remarkable. It was the first film with an all-black cast as well as with an LGBTQ theme to scoop the prize – and it must also rank as one of the most visually and tonally ambitious: told in three parts, with three different leads, each showing the stages of repression and internalised loathing in the young life of a Miami man. It’s simply revelatory: innovative, wildly affecting, utterly beautiful. CS\n\nRead the review\n\n7\n\nSynecdoche, New York (2008)\n\nAfter a string of brilliant, industry-transforming scripts, Charlie Kaufman made his directorial debut with this complex, convoluted drama, starring Philip Seymour Hoffman as theatre director Caden Cotard, who is swamped by personal crises as he works on his dream project: building an ever-expanding replica of the city streets and buildings inside a giant warehouse, and populating it with lookalikes; the blurred boundary between performance and reality is mirrored in Cotard’s own breakdown, with the title giving the big clue – this is all symbolic. AP\n\nRead the review\n\n6\n\nHidden (2005)\n\nHaving made his name as one of the pioneers of ordeal arthouse with unflinching chronicles of trauma and cruelty, Austrian auteur Michael Haneke achieved a unlikely popular success with this film that connected with France’s deep well of unease about events of the relatively recent past. Daniel Auteuil plays a successful TV host whose contentment is disturbed by the arrival of mysterious surveillance tapes. This seems to be connected with a young Algerian boy whose parents were apparently killed in the infamous 1961 Paris massacre. Haneke ratchets up the tension with an unerring sense of dread and dismay. AP\n\nRead the review\n\nFacebook Twitter Pinterest Beautiful … Maggie Cheung and Tony Leung in In the Mood for Love. Photograph: Miramax/Everett/Rex Features\n\n5\n\nIn the Mood for Love (2000)\n\nHas there ever been a more beautiful couple in the history of cinema than Tony Leung and Maggie Cheung in Wong Kar-Wai’s smouldering love story In the Mood for Love? Not that they’re a couple, technically. It’s 1962. Chow (Tony Leung) and Li-zhen (Maggie Cheung) move in next door to each other in a cramped Hong Kong block of flats. His wife is having an affair – with her husband. The cheated-on pair become friends, but vow not to behave badly. Like Brief Encounter, the film aches with the understanding that impossible love makes for a more romantic movie. It’s gorgeously detailed, drenched in sensuality – a scene in which the two squeeze past each other in a narrow alleyway by night has a humid sexiness. CC Read the review\n\n4\n\nUnder the Skin (2013)\n\nJonathan Glazer’s first film in nearly a decade (and still his most recent) turned out to be an uncategorisable masterwork. Scarlett Johansson plays an alien in human form, trawling the streets of Glasgow for unsuspecting males to “take home” – in fact, using them as a food source. From its unnerving alien-POV sequences, to the empathetic scene with actor Adam Pearson (who has neurofibromatosis), to the sheer coldness of the predatory logic of its central figure, Under the Skin achieves a mood and texture unlike anything else before or since. AP Read the review\n\nFacebook Twitter Pinterest Gentle revolution … Ellar Coltrane in Boyhood. Photograph: Allstar/Universal Pictures\n\n3\n\nBoyhood (2014)\n\nTwelve years in the shooting, Richard Linklater’s story of a child’s life between six and 18 is a vindication of artistic ambition in an age of cinematic snacking. Its downside is to ruin almost every single other film for you – at least all those in which the actors are conspicuously aged up or down. In watching the bonafide progress of Ellar Coltrane – as well as Patricia Arquette and Ethan Hawke as his parents – Boyhood provides its audience with an intimacy and an investment like no other. This is cinema as gentle revolution. CS\n\nRead the review\n\n2\n\n12 Years a Slave (2013)\n\nSteve McQueen’s real-life story of Solomon Northup, a free man kidnapped and sold into slavery in 19th-century Louisiana, exudes all of the dignity, impatience and artistic fidelity of its director. It is perfectly cast and paced, endlessly surprising, uncompromising and compassionate: a story purely and powefully told, yet full of the extraordinary visual grace notes. It never descends into cliche or even self-pity; it remains a film for adults, uninterested in anything but the truth. To read Northup’s 1853 memoir is to be astonished by the film’s fidelity. CS\n\nRead the review\n\nFacebook Twitter Pinterest Stark … Daniel Day-Lewis in There Will Be Blood. Photograph: Allstar/Miramax/Sportsphoto\n\n1\n\nThere Will Be Blood (2007)\n\nPaul Thomas Anderson’s strange masterpiece, freely adapted by him from Upton Sinclair’s 1927 novel Oil!, has a dark title that threatens a calamity now visible on the horizon: destruction of the Earth itself. And it is all inscribed in the story of the movie’s leading character, a man with the Bunyanesque name of Daniel Plainview. Daniel Day-Lewis gives perhaps the greatest, certainly the most exotic performance of his career as an oil prospector in the early 20th century, rewarded with colossal wealth that never gives him the smallest pleasure.\n\nThe movie perhaps looks even stranger, starker and more unforgiving now than it did in 2007 when it first came out. But from 2016, there has been a raging Plainview in plain sight in the White House: Trump, the eccentric property billionaire and spoilt baby whose cranky tweets are as crazy as Plainview’s deranged “milkshake” pronouncement. What a spectacle Anderson and Day-Lewis create: a portrait of male belligerence and fear, a Tutankhamun of misery, walled up in his own sarcophagus of wealth and prestige. PB\n\nRead the full review", "description": "Gangsters, superheroes, schoolkids, lovers, slaves, peasants, techies, Tenenbaums and freefalling astronauts – they’re all here in our countdown of cinema’s best movies since 2000", "authors": ["Peter Bradshaw", "Cath Clarke", "Andrew Pulver", "Catherine Shoard"], "top_image": "https://i.guim.co.uk/img/media/7071701b2d36375982037b899741584b1a137307/0_0_2000_1200/master/2000.png?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=fe7bf9750348ea46d9f57e6d1603fe78", "published_at": "2019-09-13"}