{"pub": "news24", "url": "https://sport24.co.za/Cricket/Proteas/lee-luus-bat-proteas-to-record-breaking-win-20191004", "downloaded_at": "2019-10-06 05:37:06.247609+00:00", "title": "Lee, Luus bat Proteas to record-breaking win", "language": "en", "text": "Cape Town - An outstanding 144-run partnership between Lizelle Lee and Sune Luus paved the way for the Proteas women to secure a record 105-run victory over India in their final T20 International at the Lalabhai Contractor Stadium in Surat on Friday.\n\nBoth openers struck half-centuries, with the explosive Lee plundering a career-best 84 off 47 balls (15 fours, 1 six) and captain Luus striking 62 off 56 balls (7 fours).\n\nThat helped the tourists amass 175 for three, their highest score in away T20Is, with Nadine de Klerk (3/18) then leading a stellar bowling display that helped demolish the hosts for a paltry 70.\n\nIt earned the South Africans their biggest victory ever on the road and condemned India to their lowest ever total in home T20s.\n\nThe result was inconsequential in the broader context of the series, with the Indians having already wrapped up the six-match contest a few games earlier.\n\nHowever, Hilton Moreeng's side can take a huge amount of confidence from the performance heading into the one-day leg of the tour.\n\nThis was one of Proteas' best-ever matches on the road and it was all set up by Player of the Match Lee and Luus. The pair made a soaring start after the skipper won the toss and batted, with their partnership lasting 15.5 overs.\n\nMignon du Preez (13) added the finished touches thereafter allowing the tourists to set 176 - their highest mark away from home, surpassing the previous best score of 166 for four versus England at Taunton last year.\n\nShabnim Ismail (2/11) and Ayabonga Khaka (1/9) rocked the home side early on with their devastating start leaving the top order in tatters at 10 for three in the fourth over.\n\nThe outstanding De Klerk then got involved by landing a double blow in the fifth over as the Indians crumbled to 13 for five and then 13 for six when Ann Bosch (2/13) struck again in the sixth over.\n\nVeda Krishnamurthy (26) and Arundhati Reddy (22) helped take their side away from total annihilation, before Nondumiso Shangase (2/0) claimed two wickets in three balls to wrap up a monumental win - the hosts dismissed in 17.3 overs for a record low score on home soil.\n\nThey did win the series 3-1 though, but the South Africans will be keen to bounce back when the three-match one-day international sequence begins next Wednesday.\n\nProteas women squads:\n\nT20I: Sune Luus (Northerns, Capt), Anneke Bosch (North West), Tasmin Brits (North West), Nadine de Klerk (Northerns), Shabnim Ismail (Gauteng), Sinalo Jafta (WP), Ayabonga Khaka (Gauteng), Lara Goodall (WP), Lizelle Lee (North West), Nonkululeko Mlaba (KZN Coastal), Tumi Sekhukhune (North West), Nondumiso Shangase (KZN Coastal), Mignon du Preez (Northerns), Laura Wolvaardt (WP)\n\nODI: Sune Luus (Northerns, Capt), Tasmin Brits (North West), Trisha Chetty (Gauteng), Nadine de Klerk (Northerns), Shabnim Ismail (Gauteng), Ayabonga Khaka (Gauteng), Lara Goodall (WP), Marizanne Kapp (EP), Lizelle Lee (North West), Nonkululeko Mlaba (KZN Coastal), Tumi Sekhukhune (North West), Nondumiso Shangase (KZN Coastal), Mignon du Preez (Northerns), Lara Wolvaardt (WP)\n\nItinerary:\n\nOctober 9: 1st ODI\n\nOctober 11: 2nd ODI\n\nOctober 14: 3rd ODI\n\n- Cricket South Africa", "description": "An outstanding 144-run partnership between Lizelle Lee and Sune Luus paved the way for the Proteas women to secure a record victory over India.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9440/854f79d6c34e41bdb91eaee58502b4bd.png", "published_at": "2019-10-04"}