{"pub": "guardian", "url": "https://theguardian.com/football/blog/2019/oct/04/bernardo-silva-charge-racism-football-eni-aluko", "downloaded_at": "2019-10-04 09:17:46.007238+00:00", "title": "Bernardo Silva charge is a token gesture when so much racism is not tackled | Eni Aluko", "language": "en", "text": "Last Saturday, as the players came out before the home game against Manchester City, Everton’s fans unveiled an enormous flag bearing the face of Moise Kean and the slogan “no al razzismo” – no to racism. On Wednesday the Football Association charged the City midfielder Bernardo Silva with misconduct, relating to a tweet he published comparing a childhood picture of his teammate Benjamin Mendy to the cartoon used as a logo by the Spanish chocolate brand Conguitos. Everton’s banner impressed me as an example of purposeful action that might change behaviour and make racism less prevalent in football; but the FA charge of Silva looks like a token gesture compared with the weak punishments of public racism in other areas of the game.\n\nSilva’s tweet was definitely problematic. The depiction of black people as animalistic or ugly or lesser is not acceptable, and the physical similarity between the Conguitos logo and Mendy is minimal. But at the same time Silva and Mendy are good friends and teammates. When you communicate with friends you let your guard down, you speak with more familiarity, and from time to time you say things that you probably would not say to a stranger.\n\nFootball’s diverse landscape remains polluted by racists despite our outrage | Andrew Anthony Read more\n\nI would guess that most of us have sent things to friends on WhatsApp that would make us very embarrassed if they were published. Silva’s main mistake was to tweet it to the world. But though Silva might not have intended to be racist, ignorance is never an adequate excuse.\n\nAction had to be taken. City missed the opportunity to calm the controversy when instead of getting Silva to immediately apologise for any public offence he caused, Pep Guardiola mistakenly came out and dismissed the suggestion that the tweet was racist. This was a demonstration of one of the key problems preventing us from effectively combatting racism: so many people do not actually understand what it is.\n\nIt is not simply name-calling and physical abuse. The character on the Conguitos logo, which before a relatively recent redesign used to carry a tribal spear, is similar to the kind of images that have been used to degrade black people since slavery, which means comparing it to any black person is unacceptable. Similar cartoons of white children simply do not have the same degrading connotations. No one ever got offended by the Milkybar Kid.\n\nSilva might not have known that in this country if you publish a picture of a black person depicted in a certain way there is going to be a backlash, and that backlash will then have to be addressed. The FA has stepped in but now the problem is one of consistency.\n\nThe issue of Silva publishing a single unintended racist tweet about a teammate will not have a significant impact on British society. When large numbers of fans sing chants featuring racist language – like the incident I mentioned in a previous column that led to Millwall being fined £10,000 in August – the punishments are feeble. When there is an opportunity to force fans and clubs to confront the issue and to encourage behavioural change, the FA does not take it. When it can make an easy, high-profile gesture using players such as Silva, it jumps.\n\nFacebook Twitter Pinterest Benjamin Mendy (right) defended his teammate Bernardo Silva over the tweet that has landed the Portuguese midfielder with an FA charge. Photograph: Matt West/BPI/Shutterstock\n\nThere had to be a reaction of some sort to Silva’s tweet, but in truth it is a distraction. Raheem Sterling, who is not shy of calling out racism and I believe would have spoken up about Silva if he considered it necessary, has defended his teammate, as has Mendy. If Silva is punished it is unlikely to change the issue of racism in football; it is just more wasted time and effort. Like getting Premier League players to wear Kick it Out T-shirts for their warm-ups at a couple of games a year, it is designed to get attention and raise awareness. I care more about what will make a lasting difference.\n\nLegal action by players should be the next step for online abuse | Eni Aluko Read more\n\nThere have been a couple of moments this season when I have been impressed by the work some clubs or individuals have done. In August Harry Maguire criticised the “pathetic trolls” who abuse black players on Twitter. People should follow Maguire’s lead: it is not just for black and minority ethnic people to talk about racism. Then there was Goodison Park. I thought that banner was huge, in more ways than one. That was a club saying, in a loud and clear voice: we are not accepting this and we are backing our black player all the way. I play for Juventus, Kean’s previous club, and they certainly would not and did not support a player in that manner against even a small minority of their fans. I would be surprised if any Everton fans, after seeing that banner before kick-off, would have felt comfortable shouting racist abuse last Saturday.\n\nOther things could be done to change football culture. I am certain there are lots of clever people who understand the psychology of football fans, and who are experts in changing supporter behaviour in particular ways. But the sense I get is that they are employed trying to sell stuff to fans, whether it is a new kit, a TV subscription, a gambling app or a bit more food on a matchday.\n\nThe Fiver: sign up and get our daily football email.\n\nIf an even slightly comparable effort was put into deterring racism I am sure we would soon notice the difference. Football has always reflected society, but the game’s leaders should aim to be more than a mirror. The game has never before been the focus of so much attention or enjoyed such riches, and it should use them to make sure it is not simply reflecting society but leading it. It’s not rocket science. It is a question of taking difficult and potentially expensive decisions instead of the easy ones our administrators too often prefer.\n\nSome clubs have a problem with ingrained behaviour, with cultures that have built over decades and need to be shifted, and it will take some hard work to get there. It’s too easy to publicly condemn “a small minority of fans”. A club could do that every week without ever changing the way a single one of their supporters behaves, but close down a block, a stand or even a stadium and things will happen pretty swiftly.\n\nOf course it is not for me to prescribe the right punishment – this is not my area of expertise. But there is a need for consistency and also, when required, severity for change to happen. One thing I’m sure of is that we will get nowhere with platitudes and press releases.", "description": "Action has to be taken over Silva’s tweet but the FA response to racism by fans suggests it has not grasped the big picture", "authors": ["Eni Aluko"], "top_image": "https://i.guim.co.uk/img/media/685337e13e2c6ac16d9a88b3523d139779d45a1e/104_43_3280_1968/master/3280.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=3dad88259953d583d89f8d8f04d959b2", "published_at": "2019-10-04"}