{"pub": "marketwatch", "url": "https://marketwatch.com/story/social-security-administration-announces-lower-cola-than-the-past-two-years-2019-10-10", "downloaded_at": "2019-10-10 15:16:59.030551+00:00", "title": "Social Security Administration announces lower COLA than the past two years", "language": "en", "text": "The Social Security Administration said Thursday it’s dropping its cost-of-living adjustment to 1.6% for 2020.\n\nA 1.6% adjustment equals about $23 more a month for someone receiving the average retirement benefit, which is $1,460 a month. These annual adjustments to Social Security benefit payments have been averaging 1.4% in the last 10 years, though the last two years have brought higher COLAs. In 2019, the adjustment was 2.8%, and in 2018, it was 2%.\n\nThe COLA may not amount to much for many Americans, and the buying power these benefits bring is diminishing, said Mary Johnson, the Social Security and Medicare policy analyst at the Senior Citizens League, a nonpartisan advocacy group for retirees. Social Security’s cost-of-living adjustment follows the consumer-price index and buying patterns of urban workers, called CPI-W, not the buying patterns of elderly Americans, known as the CPI-E. But urban workers and retirees do not spend money the same way — especially in health care — and the COLA does not reflect those differences.\n\nYoung workers may spend between 7% to 10% of their money on health care, while older Americans can expect to spend 12% to 25%, said Johnson, who has been tracking COLA since 1996.\n\nNot everyone will see much of an increase. The Medicare Trustees expect a $9 a month increase for its Medicare Part B premium. That means those who receive a small COLA, based on their monthly benefit, may not receive any adjustment at all — the premium comes out of Social Security benefits. The monthly Social Security benefit cannot fall under what beneficiaries are already receiving, per federal law.", "description": "Boost to cost of living adjustment may feel negligible to many recipients", "authors": ["Alessandra Malito"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GZ817_social_ZG_20181206110455.jpg", "published_at": "2019-10-10"}