{"pub": "businessinsider", "url": "https://pedestrian.tv/film-tv/let-it-snow-netflix-christmas-romantic-comedy-kiernan-shipka", "downloaded_at": "2019-10-11 00:26:47.828275+00:00", "title": "Kiernan Shipka Stars In Netflix's New Teen Chrissy Romcom 'Let It Snow'", "language": "en", "text": "YOU GUYS, IT’S STARTING. Netflix has unleashed the poster for Let It Snow – a Christmas teen romance movie, based on a book co-written by John Green. It comes out November 8. T’is the season. I’m READY.\n\nLet It Snow is the New York Times bestselling novel by Green, Maureen Johnson, and Lauren Myracle. If you haven’t read the book, it’s pretty much a couple of holiday romances in one, which begins after a terrible snowstorm buries the residents of Gracetown under a whole heap of snow on Christmas Eve.\n\nThe log line: “When a once-in-century snowstorm hits a small town on Christmas Eve, several high school seniors discover unexpected opportunities as well as complications that test their friendships, love lives, and aspirations for the future.”\n\nNetflix, being Netflix, tapped the shoulders of all your fave YA actors. The Chilling Adventures of Sabrina‘s Kiernan Shipka leads the cast, with Shameik Moore (Spider-Man Into The Spider-Verse), YouTube star Anna Akana, Jacob Balton (Spider-Man: Homecoming), Isabela Moner (Instant Family), Odeya Rush (Dumplin’), and Aussie actors Mitchell Hope (The Descendants), and Liv Hewson (Santa Clarita Diet).\n\nLOOK, LOOK, LOOK.\n\nIn related news, Vanessa Hudgens is also making another Chrissy movie for Netflix. The Princess Switch was the heckin’ best, and nothing you say can sway me from this very good opinion.\n\nThe new film was announced back in March of this year and, according to Deadline, is called The Knight Before Christmas.\n\nGuys, the logline. I’m WHEEZING, it sounds *kissy fingers*.\n\n“The Knight Before Christmas follows a gallant English knight who seeks out his true quest after a sorceress inadvertently sends him from the medieval era to present day. While there he soon finds himself falling for a caring high school science teacher who is disillusioned by love.”\n\nThis, this, is why I give Netflix money, and by “I”, I mean my brother.\n\nI think, Josh Whitehouse (Valley Girl) stars as the knight. He’s listed as part of the cast, as a Sir Cole on IMDb.\n\nStay tuned for more.", "description": "Netflix has unleashed the poster for Let It Snow - a Christmas teen romance movie, based on a book co-written by John Green. It comes out November 8.", "authors": ["Steffanie Tan"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/10/Screen-Shot-2019-10-11-at-9.46.28-am.png", "published_at": "2019-10-10"}