{"pub": "cbc", "url": "https://cbc.ca/news/politics/grenier-debate-targets-1.5311092", "downloaded_at": "2019-10-07 09:11:15.826514+00:00", "title": "Where are the voters that leaders need to reach in tonight's debate? | CBC News", "language": "en", "text": "Tonight's debate between the six major federal party leaders might be their best — and last — opportunity to move the needle in a campaign that has not seen any significant swings in Canadians' voting intentions.\n\nWhile each of the leaders would prefer to speak to the broadest swath of voters and sweep to a big victory in two weeks' time, with such a close race the best they might hope for is to reach the slice of the electorate that will have the biggest impact.\n\nSo who is it that each of the leaders hopes will hear their message loudest?\n\nOf the four leaders whose parties will have candidates on the ballot in all 338 ridings, the stakes are highest and there is the most to lose.\n\nBut for Yves-François Blanchet of the Bloc Québécois and Maxime Bernier of the People's Party, the order of the day will be to make the most of the opportunity.\n\nThere aren't many anglophones in Quebec who will consider the Bloc as an option, so Blanchet just has to avoid saying anything that might knock him off message between now and Thursday, when the last French-language debate will be held.\n\nBernier will have to take advantage of being put on an even playing field with the other five leaders. The People's Party remains mired at around two to three per cent in the polls countrywide. It is hard to imagine that the extra exposure can do anything other than help, since he doesn't have much further to fall.\n\nThat's not the case for the other four.\n\nMay needs to shore up her soft vote\n\nThe Green Party started the campaign with a lot of potential. It was coming off a series of breakthroughs at both the federal and provincial levels and had closed the gap on the New Democrats for third spot nationwide.\n\nBut instead of surpassing the NDP, the Greens have fallen back. Now Elizabeth May needs to make sure the vote she still has sticks.\n\nPolling by Léger suggests that just 49 per cent of Green voters say they have made their final choice. That's dangerous for the Greens, who have under-performed their polling in virtually every election at both the federal and provincial levels.\n\nMay will need to make the case to voters living in a few ridings — like those on Vancouver Island and a handful elsewhere in the country where provincial Greens have had success, such as Guelph in Ontario and Fredericton in New Brunswick — that a Green vote will not be a wasted vote.\n\nA majority of Green voters in that Léger poll said that either the Liberals or the NDP were their second choice. May needs to ensure those uncommitted Greens don't shift allegiances in a bid to block the Conservative candidate in their own ridings.\n\nCan Singh capitalize on improving personal numbers?\n\nWhen the campaign began, the New Democrats had reason to worry about winning the 12 seats needed for recognized party status in the House of Commons. After a steady few weeks for Singh, those concerns are perhaps not as urgently felt.\n\nBut while things have gone generally well for Singh, the NDP has hardly seen its own numbers get a bump.\n\nPolling by Campaign Research has suggested Singh's approval ratings have jumped by 11 points since the beginning of September. The Angus Reid Institute indicates that Singh is the only leader who has impressed more Canadians than he has turned off.\n\nHowever, there have only been marginal increases in the number of people who say they intend to vote for his party.\n\nIf Singh is able to use his increased personal popularity to give his party a boost, that would be most helpful in Ontario and British Columbia. The CBC's Poll Tracker estimates that the NDP is seriously in contention in only 30 seats across the country (there are a few more in which the party has an outside chance) and more than two-thirds of them are in B.C. and Ontario.\n\nScheer needs a rebound\n\nPolitical observers in Quebec were virtually unanimous that Andrew Scheer was the worst performer in last week's French-language TVA debate. The polls conducted so far have hinted that the Conservatives have taken a hit in Quebec and a poll of francophone Quebecers published by Abacus Data on Sunday suggested that Scheer was the only leader who did significant harm to his party's fortunes during the debate.\n\nScheer can't afford another poor performance this week.\n\nLast week, the leaders of the four parties that won seats in Quebec in the 2015 federal election participated in a French-language debate organized by TVA. (Joel Lemay/Agence QMI)\n\nIf the Conservatives' chances of making significant gains in Quebec are now looking slimmer, it means the party needs to make bigger inroads in Ontario than initially planned.\n\nThat's a problem, because the Conservatives are having trouble in Ontario.\n\nThe Poll Tracker has consistently put the Conservatives behind the Liberals in the province and below the 35 per cent of the vote that Stephen Harper secured in Ontario in his losing effort in 2015. The unpopularity of Doug Ford's provincial government might be a contributing factor, but Scheer himself does not seem to be helping.\n\nIt's debate week in the federal election - what effect did the TVA debate have on the polls and what should you be looking for in the two official commission debates coming up this week? Host Eric Grenier and Elise von Scheel take a look at the numbers. 10:37\n\nPolling by Forum Research and Campaign Research suggests that Scheer's approval ratings in Ontario are below 30 per cent, slightly worse than Harper's approval ratings in the province four years ago.\n\nVoters in Ontario — and particularly those in the Greater Toronto Area where Scheer has spent about one-third of his time so far in this campaign — are Scheer's most important audience tonight. Without a rebound for him in this province, there is no chance the Conservatives will win this election.\n\nCan Trudeau convince uncommitted progressives?\n\nLiberal chances would improve if Justin Trudeau shores up the votes of uncommitted progressives.\n\nJust over two-thirds of Liberal voters told Léger they have made up their minds, far more than those currently backing the New Democrats and Greens. The poll suggests there is a big pond of wobbly left-of-centre voters that might switch to the Liberals — 42 per cent of New Democrats and 22 per cent of Greens list the Liberals as their second choice.\n\nThe poll also found that 59 per cent of these voters said they were more worried about the Conservatives returning to power than they were about another four years of Liberal government. Only a third or less were more worried about that.\n\nThat's why Trudeau has been trying to make this election about a choice between his Liberals and Scheer's Conservatives. Expect to hear that message on repeat tonight. In a close race, it won't take many of those progressive voters to put the Liberals into majority territory.\n\nThen again, it won't take many of those voters drifting elsewhere to keep Trudeau in minority territory instead — or out of the prime minister's office entirely.\n\nListen to the latest episode of The Pollcast podcast below, or subscribe here.", "description": "Each party leader has a smaller slice of the electorate they need to target in tonight's English-language leaders debate.", "authors": ["Politics", "Éric Grenier Is A Senior Writer", "The Cbc'S Polls Analyst. He Was The Founder Of Threehundredeight.Com", "Has Written For The Globe", "Mail", "Huffington Post Canada", "The Hill Times", "Le Devoir", "L Actualité.", "Read More Cbcnews.Ca Columns Éric Grenier"], "top_image": "https://i.cbc.ca/1.5285707.1568687461!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/six-leaders.jpg", "published_at": "2019-10-07"}