{"pub": "fox", "url": "https://foxnews.com/media/donald-trump-pelosi-schiff-syria-twitter", "downloaded_at": "2019-10-21 01:34:40.168828+00:00", "title": "Trump says Pelosi should investigate Obama's Syria red line, Schiff should be 'deposed'", "language": "en", "text": "House Speaker Nancy Pelosi, D-Calif., should investigate the \"red line\" that Barack Obama said he would enforce in Syria during his presidency, and House Intelligence Committee Chairman Adam Schiff, D-Calif., should be \"deposed\" over his actions in the Democrats' impeachment inquiry, President Trump claimed in a heated a Sunday night tweetstorm.\n\nThe president first blasted Pelosi for leading a congressional delegation to Jordan to inquire about Syria and said her attention should be focused elsewhere. He also claimed one million people died as a result of Obama declaring a \"red line\" in Syria in 2012, and never enforcing it (Various estimates of the death toll from Syria's civil war have hovered around 500,000 people).\n\n\"Pelosi is now leading a delegation of 9, including Corrupt Adam Schiff, to Jordan to check out Syria,\" Trump began. \"She should find out why Obama drew The Red Line In the Sand, & then did NOTHING, losing Syria & all respect. I did something, 58 missiles. One million died under Obama’s mistake!\"\n\nThe U.S. in April 2017 launched 59 Tomahawk missiles at a Syrian airfield in response to a chemical weapons attack blamed on the regime of Syrian President Bashar al-Assad.\n\nPelosi defended the trip in a statement: \"With the deepening crisis in Syria after Turkey’s incursion, our delegation has engaged in vital discussions about the impact to regional stability, increased flow of refugees, and the dangerous opening that has been provided to ISIS, Iran and Russia.\"\n\nSEN. KLOBUCHAR LABEL TRUMP 'GLOBAL GANGSTER' DURING CNN UKRAINE INTERVIEW\n\nTrump then took direct aim at Schiff and the impeachment inquiry against him, calling the House Intelligence Committee chairman a con man and suggesting he should give a sworn deposition to the intelligence community inspector general.\n\n\"This Scam going on right now by the Democrats against the Republican Party, and me, was all about a perfect phone call I had with the Ukrainian President. He’s already stated, NO PRESSURE! Where is the Whistleblower, or the 2nd Whistleblower, or the “informant?” he asked.\n\n\"All gone because their so-called story didn’t come even close to matching up with the exact transcript of the phone call. Was it a Corrupt Adam Schiff con? Why didn’t the IG see this? When do we depose Shifty Schiff to find out why he fraudulently made up my phone call and read this fiction to Congress and the American People?\"\n\nOBAMA LIED ABOUT SYRIA 'RED LINE,' SET MIDDLE EAST BACK 20 YEARS, TOP SAUDI OFFICIAL SAYS\n\n\"I demand his deposition. He is a fraud, just like the Russia Hoax was, and the Ukraine Hoax is now. When do the Do Nothing Democrats pay a price for what they are doing to our Country, & when do the Republicans finally fight back?\" Trump continued.\n\nSchiff, for his part, promised there would be open hearings. He said at a news conference last week, \"We are nonetheless continuing to get good and important information from witnesses.\" On the \"transcript\" he read during a hearing last month, Schiff said later, \"My summary of the president’s call was meant to be at least, part, in parody.\"\n\nThe president also highlighted the negative reaction to his initial plans to host the G-7 summit at the Trump National Doral in Miami.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"So interesting that, when I announced Trump National Doral in Miami would be used for the hosting of the G-7, and then rescinded due to Do Nothing Democrat/Fake News Anger, very few in Media mentioned that NO PROFITS would be taken, or would be given FREE, if legally permissible!\"\n\nTrump had announced late Saturday that the U.S. would hold the G-7 at a site other than Doral, after backlash grew.\n\nFox News' Chad Pergram contributed to this report.", "description": "House Speaker Nancy Pelosi, D-Calif., should investigate the \"red line\" that Barack Obama said he would enforce in Syria during his presidency, and House Intelligence Committee Chairman Adam Schiff, D-Calif., should be \"deposed\" over his actions in the Democrats' impeachment inquiry, President Trump claimed in a heated a Sunday night tweetstorm.", "authors": ["Nick Givas", "Nick Givas Is A Reporter With Fox News. You Can Find Him On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Pelosi-Trump-Schiff_AP.jpg", "published_at": "2019-10-20"}