{"pub": "yahoo", "url": "https://sports.yahoo.com/next-red-sox-gm-build-155931032.html", "downloaded_at": "2019-09-24 01:03:39.621868+00:00", "title": "The next Red Sox GM should build around these five players", "language": "en", "text": "The defending MVP? No. The former Cy Young winner? Nope. The seven-time All-Star who just averaged over 13 strikeouts per nine innings? Uh-uh.\n\nThe question is whom I want back for next year's Red Sox. And the answer is kind of surprising, once you parse it and realize your list only includes five names.\n\nThe exercise crystallizes just what kind of challenge awaits Dave Dombrowski's successor as the Red Sox enter a period of bridging/rebuilding that could get ugly.\n\nScroll to continue with content Ad\n\nI wouldn't call any of the following \"untouchable\" because I don't believe in that concept. But they're the last guys I'd want to move if I were evaluating the strengths and weaknesses of the roster: Xander Bogaerts, Rafael Devers, J.D. Martinez, Eduardo Rodriguez, and Brandon Workman.\n\nThat means no Mookie Betts, Chris Sale, David Price, Andrew Benintendi, Jackie Bradley Jr., and Nathan Eovaldi, to name just a few. Money plays a central role in these rankings, especially if the Red Sox are serious about corralling their runaway payroll. That's why Betts, an otherwise obvious fit, is a no for me, because it's going to cost $300 million to keep him.\n\nFirst off are two obvious names: Bogaerts and Devers. They're the present and future of the organization, with one already signed to a reasonable long-term contract and the other a candidate for an extension.\n\nBogaerts has emerged as a heart-and-soul player, and his six-year, $120 million deal makes him a bargain. He has already topped 30 homers and 50 doubles while playing virtually every day, and he should finish above .300 for the second time in his career, too. He is a foundational piece not just on the field, but in the clubhouse, and the Red Sox are lucky to be able to build around him.\n\nStory continues\n\nHe has taken a particular interest in Devers, the supremely talented 22-year-old who is posting the kind of numbers (.307-31-112-.910) that suggest he could one day challenge for a Triple Crown. Devers remains under team control through 2023, but at some point the Red Sox will undoubtedly broach the subject of a long-term extension. He is already a monster offensively, but with considerable room to grow.\n\nAn offense built around young stars would be the envy of most teams, but this one could benefit from a veteran presence, and that's where Martinez enters the picture. The Red Sox don't suddenly need to become a small-market team, but they'd be wise to start limiting their long-term commitments after tying up too much money in Price ($217 million) and Sale ($145 million), in particular. Martinez can opt out of the final three years and roughly $62.5 million remaining on his contract, but he's at an age (32) and position (DH) where he shouldn't command more than four years on the open market.\n\nIt may be old-fashioned to say that Martinez's presence allows other hitters in the lineup to flourish, but it's true. Like David Ortiz before him, Martinez commands respect in the middle of the lineup, and as long as he's around, Bogaerts and Devers won't feel the same kind of pressure to produce. Add his very specific skills as a clubhouse hitting guru, and Martinez is worth keeping.\n\nIf only we could say the same about any of the overpriced starters. Price will undergo surgery to remove a cyst from his wrist that might solve all his problems, but if the Red Sox could get out from under the final three years and $96 million remaining on his contract, they wouldn't ask twice.\n\nSale, meanwhile, is still awaiting a follow-up visit with Dr. James Andrews after shutting it down for the final six weeks because of elbow soreness. And even if Eovaldi feels strong heading into the offseason, he remains not only injury-prone, but wildly inconsistent.\n\nE-Rod, however, keeps establishing himself as a legit top-three starter. Still only 26 years old, the lefty has finally delivered his breakthrough campaign, going 18-6 with a 3.53 ERA while averaging more than a strikeout per inning. Maintaining this momentum in 2020 will be a challenge, but he's the one starter I'd bet on at the moment.\n\nWorkman seemed an unlikely candidate to be labeled indispensable when the season started, especially since he was only a few months removed from being left off the World Series roster. But the 31-year-old has inexorably transformed himself into one of the game's most uniquely dominant relievers.\n\nDetractors point to his high walk totals and reliance on a curveball as proof that he's just a one-season gimmick, but doing so ignores (a) his 13 strikeouts per nine, and (b) the fact that his fastball is regularly hitting 95 mph again.\n\nWorkman has the makeup and stuff to serve as the last line of defense, but the flexibility and selflessness to set up if the Red Sox add a closer. Whatever role he fills in 2020, I just know I want him on my team.\n\nClick here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device.\n\nThe next Red Sox GM should build around these five players originally appeared on NBC Sports Boston", "description": "John Tomase's choices as key players for the Red Sox next GM to build around surprisingly doesn't include a couple of big names.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/BtizlsG9LJ8ZxZsCp.GnxA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjAuNzQzNjkxODk5MDcwNA--/https://s.yimg.com/uu/api/res/1.2/CRb3hHj7GOsJNs_HaXL_Og--~B/aD00MjQ7dz03NTM7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/csnne.com/7e860374fd383ef75c90af6c9637a480", "published_at": "2019-09-23"}