{"pub": "dailybeast", "url": "https://thedailybeast.com/did-grandmaster-sexay-wwe-star-brian-christopher-lawler-have-to-die", "downloaded_at": "2019-09-22 15:18:59.856389+00:00", "title": "Did WWE Star Grandmaster Sexay Have to Die?", "language": "en", "text": "The King of Memphis Wrestling had been through it all before, but the sinking feeling of disappointment was as strong as the first time he’d heard that his son had been picked up by the cops.\n\n“I said, ‘Not again,’” Jerry Lawler, 69, recalled. “He just can’t stay straight.”\n\nLawler drove out to the Hardeman County Jail in Bolivar, Tennessee. Upon entering the building, he was greeted by grinning correctional workers asking for autographs and selfies. “It was like a personal appearance,” he said. But he’d become accustomed to this type of thing. Even in the summer of 2018, the World Wrestling Entertainment (WWE) Hall of Famer was legendary for the 1982 angle in which he delivered two consecutive piledrivers to comedian Andy Kaufman, “breaking” his neck. Later, as a play-by-play man, he’d gleefully shout the term “puppies!” at buxom performers during the period known as WWE’s risqué “Attitude Era.”\n\nIt was the turn of the millennium and Lawler’s oldest son, Brian, was also entrenched in the family business. Presented on television as “Grandmaster Sexay,” Brian’s in-ring gimmick involved hip-hop dancing with his partners Scotty 2 Hotty and Rikishi, a 425-pound, bleached blond member of the Samoan wrestling clan that includes Dwayne “The Rock” Johnson.\n\nNearly two decades later, there was a lot of Grandmaster Sexay left in Brian. In front of the right crowd, on the right night, he could still hit a dropkick or Tennessee Jam hip-hop drop, for a big pop. But the magic was fading after a year that saw him charged with skipping out on a hotel bill, and forced to undergo facial surgery following an after-hours skirmish with another wrestler.\n\n“Did you ever see the movie, The Wrestler?” Lawler asked, referencing the 2008 Darren Aronofsky film in which Mickey Rourke plays a broken-down matman, battling his own vices while clinging on to past glory by wrestling in high-school gyms and VFW halls. “I guess it was loosely based on Jake ‘The Snake’ Roberts. But it really fit Brian.”\n\nFor his part, Lawler felt like a father struggling to choose the best course of action for a kid with substance abuse issues. It didn’t matter that this particular kid was 46 years old. Brian’s behavior had given Lawler every indication that his son couldn’t be responsible for himself.\n\n“ Did you ever see the movie, 'The Wrestler'? I guess it was loosely based on Jake ‘The Snake’ Roberts. But it really fit Brian. ” — Jerry Lawler\n\nStill, once Lawler got inside the jail and talked to Brian, he started to feel a little better. Sheriff John Doolen joined their conversation and reminded Brian that they’d met a year or so earlier, Lawler said. Brian had appeared to be driving erratically, and the lawman personally followed him home.\n\n“He asked Brian if he remembered, and he did,” Lawler said. “And the sheriff told him, ‘That’s because I care about you. Now go into the bathroom and look in the mirror.’ He went into the bathroom, and he looked terrible. I was crying. Brian was crying.”\n\nLawler had come to the jail to bond out his son. But now, he had second thoughts. When Brian returned to his cell, Lawler and Doolen spoke. It was pointless to bring Brian home, Lawler claims that the sheriff told him, since the younger man was scheduled for a court appearance the next week, at which time he’d be sentenced to a mandatory 90 days for DUI and evading arrest. The days spent behind bars would count as time served. “He told me, ‘This is the safest place for Brian to be because we will get him the help that he needs,’” Lawler said. “‘I will personally look out for Brian. Brian will be safe in here.’”\n\nSo Lawler made a fateful decision: he told Doolen to leave Brian in custody.\n\n“I was hoping staying in jail would mean he finally got help,” Lawler said. “That’s what the sheriff promised—that they had a rehab program in jail.”\n\nBut Brian was never treated for drug, alcohol or mental health issues at the Hardeman County Jail. On July 28, 2018, hours after allegedly getting sucker-punched in a jailhouse fight and placed in solitary, Brian was found hanging in his cell. Ever since then, Jerry has been asking questions—first, whether his son was murdered behind bars and strung up to cover the crime, then, why a person with Brian’s frailties was placed in a cell with bolts protruding from the wall and allowed to keep shoelaces that could be used to hurt himself.\n\nEither way, to use professional wrestling parlance, Lawler believes that Doolen’s pledge to protect Brian was a “work,” or a con, and on July 26th, he filed a $3-million wrongful death lawsuit against the sheriff, Hardeman County and other employees at the jail. (Neither Doolen nor his attorney, John Herron responded to requests for comment.) “There’s nothing that’s going to bring Brian back,” Lawler said. “That’s not going to happen. But it was preventable.”\n\nIn 2010, Jerry “The King” Lawler was hosting a television show on Local 24, the ABC affiliate in Memphis, when he brought on Brian as his special guest. As the pair looked through old clips from the local wrestling promotion, they joked about the fact that, for the early part of Brian’s career, they kept their relationship hidden. Although some attributed this to Lawler’s trepidation about fans discovering that he was old enough to have a son of proper wrestling age, he told viewers that he didn’t want Brian to feel the pressure to live up to his father’s colossal reputation.\n\nNow, however, it was time to lay everything out in the open. “This guy right here is my son, Brian Christopher Lawler,” The King boasted, looking into the camera.\n\nBrian flinched, pretending to be shocked. “Did you Wikipedia me?” he giggled. “Where’d you get that?”\n\nDespite their common vocation, Jerry and Brian often had contrasting worldviews. For one thing, Jerry had never so much as tasted alcohol. And while Brian was enamored with the Pittsburgh Steelers, Jerry had developed a deep fondness for the Cleveland Browns during a period when his father was transferred from Memphis to work at the Ford assembly plant in Lorain, OH.\n\n“Brian told me he was watching a football game one day, and he told himself he’d follow whichever team won,” Jerry Lawler said. “That’s how he claimed he became a Steelers fan. But I don’t believe it. I think he did it to go against me, just to be rebellious.”\n\nIn the ‘70s and early ‘80s, North America was divided into dozens of regional wrestling territories. There was one based in L.A., another centered in San Francisco, then another one in Portland. Each was self-contained, with its own television show, storylines and championships. While wrestlers frequently shuttled between the various groups, from the mid-70s on, Lawler was the anchor of the Memphis territory, coming to the ring with a crown and robe, and taking on every major headliner who passed through.\n\nWith ratings for the territory’s Saturday morning TV show sometimes exceeding those of primetime network programs, Lawler was one of the most recognizable figures in Memphis. “As a kid, it was so cool to be in the car with him and pull into a McDonald’s, and the whole place would run over to the drive-in window, going apeshit,” said Kevin, Brian’s younger brother.\n\nBrian and Kevin were born 10 months apart in 1972, Brian in January and Kevin in November. “Every year, after it was my birthday,” Kevin remembered, “we’d be the same age for two months.”\n\nAfter their parents split in 1978, the brothers lived primarily with their mother, Kay. “Even though Saturday morning wrestling was the biggest thing, our mom’s house looked like everyone else’s house,” Kevin said. “We went to public school. And my father didn’t live with us, so it’s not like our friends would knock on the door and he’d be there.”\n\nIt was during visits to Jerry’s house that things got interesting. In addition to wrestling, Lawler worked behind the scenes in the Memphis wrestling office, and the boys would look through his yellow notepads, feeling pangs of excitement if they found a note about an upcoming plot twist or incoming talent.\n\nEach brother shared different traits with his father. Kevin inherited Jerry’s artistic ability—a teenage Lawler initially drew the attention of Memphis wrestling officials when his sketches of the wrestlers were shown on the TV show—and, later, his straight-edge lifestyle. Brian and Jerry were equally passionate about sports.\n\n“They’d play the Intellivision baseball and football games together for hours and hours and hours,” Kevin said. “I think that was the favorite part of Brian’s life because he’d have all that time with my father uninterrupted.”\n\nLike most kids growing up in pro wrestling families of the era, the boys were taught to “protect the business.” While traveling with their father and other wrestlers, they learned carny—a form of pig Latin punctuated with z's that harked back to the days when grapplers barnstormed with the carnivals, staging “worked” contests to separate the “marks” from their cash. If an outsider happened to walk into a room when a bunch of wrestling people were talking, they’d warn each other with the term “kayfabe”—a pronouncement to shut up and keep the marks in the dark. In the schoolyard, if another student dared to ask the real vs. fake question, wrestling kids were conditioned to respond, “I can show you better than I can tell you.”\n\n“I had to learn from a really early age how to fight and how to fight really good,” Brian told the Cult of Whatever website in 2015. “People would say wrestling was fake, and those are fighting words to me.”\n\nBrian’s hero growing up was “Nature Boy” Buddy Landel, a magnetic, arrogant heel—or villain—who battled Jerry at the Mid-South Coliseum. Brian would eventually wrestle Landel, and team with him in a unit called the Memphis Mafia, gushing on TV, “You know he’s my idol?”\n\nPerhaps not so coincidentally, Landel was a wreck away from the arena, pursued by the IRS and beset with drug issues. When Landel appeared to get his big break, a job and prospective “push” with the World Wrestling Federation—as WWE was then known—in 1995, he slipped on ice and injured himself so badly that officials lost interest.\n\nIn 2015, he reportedly checked himself out of the hospital against doctor’s orders following a major car accident. He died the next day at age 53.\n\n“ I had to learn from a really early age how to fight and how to fight really good. People would say wrestling was fake, and those are fighting words to me. ” — Brian Christopher Lawler\n\n“I learned how to wrestle, sitting in the front row and watching wrestling, because I was never actually trained,” Brian told Cult of Whatever. “Anybody can learn to give someone a bodyslam, suplex or put someone in a figure four leglock, but I learned how to entertain the crowd… If you can make those people cheer and stand on their feet in between doing those moves, now you’ve set yourself apart.”\n\nAt their mother’s house, the brothers formed a group called the Neighborhood Wrestling Association, whose acronym, NWA, was the same as the National Wrestling Alliance, then the most influential organization in the industry.\n\n“This was before anyone knew the term ‘backyard wrestling,’” Kevin said. “There wasn’t backyard wrestling yet. When no adults were around, we’d get everyone together. ‘Hey, let’s do a show.’ The walls, the couches, the chairs were the ropes. The arms of the couches were the turnbuckles.”\n\nDuring one memorable match, Brian came off the couch with an elbow, crashing into and destroying his mother’s Christmas tree.\n\n“Kevin might have been more the booker,” Jerry Lawler said, using the term for the member of a wrestling operation primarily responsible for character and story development. The teen created a detailed sketchbook of wrestling personas. “The only time I ever struck one of those guys was when Kevin got a job at a store and was fired for stealing. I remember I brought him to my house and put him against the wall and I slapped him. Then I found out he was taking lights and other material they needed for their wrestling ring.”\n\nIf Jerry thought his kids were too obsessed with his profession, he did little to discourage them. On Christmas or birthdays, The King would turn up with masks and capes, created by the same seamstress who sewed his robes. “That was way cooler than Underoos,” said Kevin. “We even had Spandex tights.”\n\nEventually, the boys befriended a fan who sat behind them at the Mid-South Coliseum and moonlighted as a wrestler for one of the unestablished “outlaw” leagues. The kids learned that he had a ring on his property, enabling the Neighborhood Wrestling Association to have a new base of operation. After performing on Kay’s couch, the brothers felt like they’d graduated to Madison Square Garden.\n\nWhen the time was right, Brian and his friend, Tony Williams, showed a tape of one of their matches to Jerry. As Vince McMahon expanded the World Wrestling Federation (WWF) to absorb the various regional territories, the United States Wrestling Association (USWA) had been started from the remnants of the Memphis and Dallas promotions. Lawler apparently thought the pair were good enough to work for the USWA—but not as headliners. If the boys were going to come in, they’d have to pay their dues and become “jobbers,” losing to the established stars.\n\n“Kevin was as passionate for the business as Brian,” Lawler said. “But Kevin didn’t look the part of a wrestler. Brian was more physically endowed. He became a bodybuilder. Unfortunately, that was the first thing that messed him up, getting involved in steroids.\n\n“I mean, look what you do. You give yourself a shot. I could never give myself a shot of anything. But once you give yourself a shot of one thing, I think it’s easier to give yourself a shot of something else.”\n\nAlthough Lawler was still main-eventing in the USWA, Brian was one of a number of wrestling family scions trying to build a reputation there—along with Jeff Jarrett, Doug and Eddie Gilbert, J.C. Ice (son of Superstar Bill Dundee) and Flex Kavana, later known as Dwayne “The Rock” Johnson.\n\nJohnson remembered training and tag-teaming with Brian at flea markets and state fairs, sharing motel rooms, driving 1,500 miles a week, and eating at Waffle Houses on the road. “We would always dream (and talk shit) about once we made it to the big leagues of WWE,” Johnson wrote on Instagram.\n\nBrian ascended quickly, with he and his father publicly kayfabing about their true relationship. Fans knew the flashy, young combatant as “Brian Christopher.” During interviews, he'd mock Jerry for being old. The two even wrestled each other.\n\n“I wanted Brian to be Brian,” Lawler said. “I didn’t want him to be a copycat of his dad.”\n\nWhen they spoke about perceptions, Lawler continuously invoked the name George Gulas, whose father, Nick, had been the promoter in Nashville. Despite George’s questionable athleticism and charisma, Nick apparently insisted that his son be pushed as a star. “There was a story that George was in the ring with someone and he said, ‘Dad says go down,’” Lawler said. “It was one of the reasons Nick lost his business and died broke. When I looked at that nepotism, I didn’t want that for Brian. That’s why he didn’t use the ‘Lawler’ name.”\n\nOf course, everyone backstage knew about the family connection, and several of the other wrestlers resented Brian simply because his father was the King of Memphis. “Oh my God, he was a good worker,” said Dr. Tom Prichard, who was later part of a tag team called the Bodydonnas and a trainer for WWE. “But no one was helping him. He was a cocky kid, but that was a defense mechanism because people talked behind his back. He didn’t trust them.”\n\n“ I wanted Brian to be Brian. I didn’t want him to be a copycat of his dad. ” — Jerry Lawler\n\nIn the ring, the wrestler billed as “Too Sexy” Brian Christopher was sometimes hesitant to “sell”—grabbing a body part in agony to make his opponent’s moves seem more powerful. “He was afraid to give away too much because he didn’t know if he was going to get it back,” Prichard said.\n\nBefore one match, an oldtimer told Prichard to beat Brian up and make him look weak in the ring. “I went over to Brian and told him, ‘I’m not going to eat you up. Let’s go out there and have a good match.’ And we did. All he was looking for was someone who recognized he had talent and could take him along the journey.”\n\nIn many ways, Brian’s time in the USWA was among his most entertaining. Left to his own creative devices, he continuously found ways to make the fans laugh. After winning three separate championships, he wheeled his various belts to the ring in a children’s wagon rather than draping the objects around him.\n\nAnother time, he staged a mock funeral for in-ring rival Doug Gilbert. “Douglas Gilbert was born in the backwards, redneck town of Lexington, TN,” he intoned in his faux eulogy. “He was unwanted, illegitimate… Doug was given the nickname ‘Dangerous’ when, as a child, he picked up the cigarette butt that was being used to heat their trailer… and put it in his mouth… He developed a severe spitting and slobbering problem that hampered him his entire life.”\n\nWith the crowd hooting with a mixture of derision and mirth, Brian then described Doug’s father, Tommy, as a “jabroni” who “never drew a single red cent in his entire wrestling career—and Doug Gilbert followed in his father’s footsteps.”\n\nIn time, the USWA became a developmental league for the World Wrestling Federation—the company's name was changed to World Wrestling Entertainment in 2002, following a lawsuit with the World Wildlife Fund. In 1997, Brian was called up to the main roster, and promptly won the WWF Light-Heavyweight Championship.\n\nAt the announcer's table, Jerry “The King” Lawler would rave about the young performer, referring to his good looks and abnormal abilities. When broadcast partner, Jim “J.R.” Ross would observe that the two seemed to have an unusual connection, Lawler became indignant, insisting, “There's only one set of The King's DNA.”\n\nAt one point, as part of a storyline centered around Philadelphia's renegade Extreme Championship Wrestling (ECW) invading the WWF, the company's owner, Paul Heyman, shrieked that Brian Christopher was Jerry Lawler's son. “I was a little pissed off,” Jerry said. “You don't break kayfabe.”\n\nBut the WWF was in the midst of a boom period, and the talent there seemed happy. The Rock had been on the roster for a year when Brian arrived, and the two picked up where they left off in Memphis, competing in Madden NFL tournaments in their shared hotel room, and playing Wiffle Ball in the parking lot late at night after their matches. “Our jaws would hurt from laughing so hard,” the future action hero recalled. Part of their chemistry was based on the fact that their families knew each other from the days when The Rock's father, Rocky “Soulman” Johnson, would pass through Memphis with his wife, Ata—daughter of Samoan superstar, High Chief Peter Maivia.\n\nBut the trajectories of the two Lawler brothers, once so close, were starting to diverge. Although Kevin Lawler worked as a referee in USWA, occasionally wrestled under a mask and, at one point, played the role of Doug and Eddie Gilbert's manager-brother, Freddie Gilbert in an early incarnation of ECW, Brian was in an entirely different stratosphere. “I felt like we were in high school, and everyone else graduated, but I got held back,” Kevin said.\n\nIn 1998, “Too Sexy” Brian Christopher and “Too Hot” Scott Taylor were marketed as Too Much. The next year, the hulking Samoan grappler, Rikishi joined the unit. The company changed the name of the team to Too Cool, as well as Brian and Scott’s monikers to Grandmaster Sexay and Scotty 2 Hotty. Brian often came to the ring wearing a doo rag held in place with goggles—which he used while going airborne from the turnbuckles —dancing with his partners to flashing lights.\n\nThe fans were not expected to cheer them. “We were supposed to be doing a spoof... on hip-hop and making fun of it,” Brian told Cult of Whatever. “But the fans started enjoying it... They loved the fact it was two white boys out there dancing. Then, when they threw Rikishi into the mix, that only heightened everything because now, we've got a 400-pound Samoan... wearing a thong with his huge ass showing... but he can dance as well.”\n\nThe team peaked in 2000 when Rikishi won the WWF Intercontinental Championship, while Scotty 2 Hotty and Grandmaster Sexay captured the tag team titles. With names like The Rock, Steve Austin, Kurt Angle, Mick Foley and Triple H at the top of the cards, Too Cool was an attraction that always got a pop from the crowd during the opening matches.\n\nBut there was a side of Brian Christopher that the fans didn't see.\n\n“Brian had been diagnosed with a major depression disorder,” Jerry Lawler's lawyer, Jeffrey S. Rosenblum said. “The Brian you saw on television worked hard to be that Brian because he was managing depression.”\n\nKevin theorized that his brother may have always been bipolar. “His personality would go from zero to 100 and back again.”\n\nWhile touring with the WWF, Lawler said, his son became a drug user. “He said it started when he walked into the dressing room and a tag team was doing coke, and they made him do it with them so he wouldn't tell.”\n\n“ His mom was crying. His wife was crying. And he was shaking his head, like, ‘I don’t know why you think it’s so bad.’ He didn’t think he had a problem. ” — Jerry Lawler\n\nWhether or not Brian's tale was true, drugs became a part of his lifestyle. In 2001, the Royal Canadian Mounted Police arrested him for attempting to pass through Calgary International Airport with methamphetamine and cocaine. He pleaded guilty to one charge of cocaine possession, while the other charge was dropped. In exchange for making a donation for a teen drug and alcohol program, he received a conditional discharge, allowing him to continue to work in Canada.\n\n“He caught a big break on that,” Jerry Lawler was quoted as saying at the time.\n\nThe WWF was not as forgiving, firing Brian for causing an issue at the border.\n\nYet, Brian seemed so confident that everything was going to be OK that his brother Kevin was not as concerned as he should have been. “I wasn't even sure if he had a problem. I thought, 'This is stuff he got into, and maybe he'll learn not to mess up again.'”\n\nBrian bounced around. He used his WWF tenure to market himself as a main attraction in indie promotions unaffiliated with any major wrestling group. In 2002, he performed for Total Nonstop Action (TNA)—a company that was then attempting to compete with WWE—as Brian Lawler, heading a unit labeled “Next Generation” alongside David Flair and Erik Watts, the sons of “Nature Boy” Ric Flair and Cowboy Bill Watts, respectively. He was brought back as Grandmaster Sexay to WWE in 2004, but only lasted four matches.\n\nAt one point, Brian’s wife, Davah, attempted to stage an intervention. “It was like having a surprise birthday party for someone who didn’t like birthday parties,” Lawler said. “His mom was crying. His wife was crying. And he was shaking his head, like, ‘I don’t know why you think it’s so bad.’ He didn’t think he had a problem.”\n\nDespite his ability to double talk and charm, it was obvious Brian was struggling. In 2009, he was arrested three times—for disorderly conduct, failing to attend an in-patient program as part of a plea agreement, and public intoxication. (In that case, police claimed he threatened the officer who took him into custody.)\n\nFollowing a spate of early deaths by members of the wrestling fraternity, WWE had instituted a wellness policy in 2006, prohibiting its current performers from abusing prescription and performance enhancing drugs, and providing rehab for any athlete who’d ever been on the promotion’s roster. Feeling the pressure from family and friends, Brian registered for the program twice.\n\n“He’d go just to shut everybody up,” Kevin said. “And he was thinking if he went, maybe WWE would give him his job back. There was never any commitment.”\n\n“ I’d start to think, ‘Well, maybe he’s getting a little better.' There’d be patches when you could be around him and he wouldn’t seem bad. ” — Kevin Lawler\n\nJerry also spent thousands of dollars on treatment for his son. Nothing appeared to work. “He left one program because the Steelers game was on and they weren’t showing it at the rehab center,” Lawler said. “It just wasn’t sinking in. He told me, ‘I’ve been through this too many times. Rehab doesn’t work.’\n\n“Here’s a guy who had $300,000 in the bank, a beautiful house, a beautiful wife, a child, and he lost everything one by one. He couldn’t understand why everyone was so concerned about him.”\n\nYet, there were times when Brian showed up at an indie show, looking fit, moving smoothly in the ring and offering sensible advice to the younger wrestlers. “I’d start to think, ‘Well, maybe he’s getting a little better,’” Kevin said. “There’d be patches when you could be around him and he wouldn’t seem bad.”\n\nOn a few occasions, WWE brought in Brian as a one-off. The year after Jerry and Brian publicly joked about their familial relationship on Local 24 in Memphis, a bleached blond Brian appeared on the promotion’s flagship show, Monday Night Raw, to side with his father’s rival at the time, his announcing partner Michael Cole. “I never, ever felt like I had a father,” Brian told the crowd, as part of the storyline. “While Jerry Lawler was traveling the world, being The King, he neglected one thing. Me!”\n\nIn a moment that seemed a little too real, Lawler replied, “You’re not the only one that’s glad you didn’t use the Lawler name. Because, you see, Brian, you’re a bigger screw-up than Charlie Sheen.”\n\nA more uplifting sequence occurred three years later, when all three members of Too Cool reunited for the first time in 13 years as part of a special “old school” edition of Monday Night Raw, defeating the trio of Drew McIntyre, Heath Slater and Jinder Mahal.\n\nIn 2016, Brian appeared clear-eyed and positive in a video with Rikishi at a Waffle House, following an indie show in Corinth, Mississippi. Describing his preferred meal as a “bodybuilder’s special” consisting of chunked chicken, egg whites and steamed hash browns, a smiling Brian evangelized about his menu choice, motioning at Rikishi’s plate and playfully asking the waitress, “Could you chunk his chicken?”\n\nObserved Kevin, “You do an indie show in a small town and the people don’t know you’re flat broke. They’re cheering you, taking your picture. And then—boom—you leave and you’re stuck in the same situation you were in before, with the same bad feelings.”\n\nThe year 2018 started badly for Brian. In January, his beloved maternal grandfather died. In the early morning hours of Feb. 18, police found Brian in an Evansville, Indiana, hotel lobby, his face so bloody and swollen he was unrecognizable. Upstairs, officers encountered fellow wrestler and traveling companion Chase Stevens standing next to a blood-splattered wall and sheets. The room’s trash can also contained blood and tissue.\n\nPolice took Stevens into custody. He said Brian had caused a scene in a nightclub and refused to sleep on the hotel room floor. (Brian maintained that his roommate mistakenly believed that Grandmaster Sexay was hitting on the man’s girlfriend.) Although he conceded that he’d punched Brian twice in the face, Stevens insisted that he was only acting in self-defense.\n\n“The physician reported that [Brian] Lawler had several broken bones in his face, broken teeth and that surgery was required,” the police report read.\n\nThen, in March, Jerry Lawler suffered a stroke. He recovered fast enough to resume his commentating duties at WrestleMania 34 three weeks later. But Kevin noted that Brian was shaken by his father’s health scare.\n\n\"Everything compiled,” Kevin said.\n\nAnd nothing was getting better. In June, Brian and a friend were arrested at a Memphis Hampton Inn after the credit card they presented couldn’t cover the $802.32 bill.\n\nIt was obvious that this pattern was going to be repeated. Still, the family now wonders whether, on the particular day that Brian died, he should have been in jail at all.\n\nIt was July 7 when Sgt. Chris Wilkerson of the Hardeman County Sheriff’s Department said he noticed a vehicle traveling south on Highway 1255 at speeds above the posted limit, before turning onto the road where Brian lived in Middleton, TN, about an hour east of Memphis. “This vehicle failed to maintain proper lane control,” the police report said, “crossing the yellow line with both left tires three times.”\n\nWhen Wilkinson attempted to conduct a traffic stop, he said that Brian kept going, making a left onto his driveway. After Wilkerson caught up with him, “Mr. Lawler had the odor of an intoxicant about his person and an open 12 ounce can in the center console,” the report said. A Standard Field Sobriety Test, according to the document, suggested that Brian was impaired.\n\nBut Brian would tell his father and brother another version of the incident, insisting that, on this night, he hadn’t been drinking at all. Because of this, he claimed, he made a deal with this sergeant:\n\n“Give me a Breathalyzer and if I blow a zero, I can go home.”\n\nThe police report states that Brian blew a .000 per 210 litres of breath.\n\nRegardless, he was taken to the Hardeman County Jail and charged with DUI, evading arrest and driving with a revoked license. As he was being booked, Brian told his father, one of the other deputies leaned in and motioned at Wilkerson. “You know how your father is the King of Wrestling?” the officer allegedly asked. “Well, that guy over there is the King of DUIs. When you get a DUI from him, he makes it stick.”\n\nThe Tennessee Bureau of Investigation’s toxicology report would determine that “no basic drugs” had been detected in Brian’s bloodstream. However, there were traces of oxycodone and oxymorphone. Lawler’s lawyer, Rosenblum, attributed this to Brian’s legal medications for chronic pain, a knee injury, anxiety and depression.\n\nThe attorney described the amount of opiates as “at most, consistent with what you would expect in a person who was taking medication prescribed by a doctor.”\n\nBrian had only drifted over the yellow line, he told authorities, because he happened to be driving with his knee at that particular time.\n\nWas that enough to put a man in jail? “Technically, he never should have been there,” Kevin said. “It’s like The Dukes of Hazzard. The cops see him constantly getting out of stuff, and they’re looking to put him away.”\n\nDuring intake, according to the lawsuit, Brian mentioned his conditions, and said that he’d attempted suicide in 2013 and 2015. “Despite Brian’s statement regarding his prior suicide attempts,” the document said, “the Jail’s computer system automatically changed the positive response to a negative response because his suicide attempts happened more than two years before this incarceration.” Although mental health professionals visited the facility while Brian was there, the lawsuit states, none stopped to evaluate him.\n\nBehind bars, Brian was able to receive his medication for depression, but just Ibuprofen for his chronic pain, Rosenblum said. For three weeks, the lawyer claimed, Brian was denied his other medications, and was experiencing withdrawal when he walked into the day room on Saturday, July 28, 2018.\n\n“One of his friends told me that the other guys were saying, ‘Your dad’s never coming to get you,’ just fucking with him every day,” Kevin said.\n\nBrian was playing cards when one particular inmate, Tommarian Williams, incarcerated on a parole violation, apparently demanded that he lower his voice. Punches were thrown. “Brian’s famous for this,” Lawler said. “Brian would fight.”\n\nIn the fracas, Brian applied a reverse chinlock on Williams, and was backed into the wall, witnesses said, while the wrestler’s government-issued, draw-stringed orange pants slipped down. According to the accounts, Williams eventually shouted for Brian to stop. When he did, Brian bent forward to catch his breath and pull up his pants. That’s when other inmates said Williams slugged Brian, leaving a one-and-a-half-inch gash alongside his left eyebrow.\n\nRosenblum said that Brian shouted that he had a concussion and needed stitches, and asked to be taken to the hospital. Instead, Jill Shearon, a licensed practical nurse (LPN), applied a bandage before Brian was placed alone in an administrative holding cell, according to the attorney.\n\n“That is not a decision that should be made by an LPN,” Rosenblum said. “She should have called a doctor or advanced practice nurse, described the wound and mentioned that he wanted stitches. But he was told, ‘It’s Saturday. You’ll have to wait until Monday.’ He was put in a solitary confinement cell without evaluating him for suicide risk.”\n\nIn the cell was a concrete bench, above which were “numerous large bolts protruding from the upper portion of the wall,” the lawsuit said. “Brian, an inmate with known suicide attempts, major depressive mood disorder, withdrawal pain and a head injury,” the lawsuit continued, had been put there without anyone bothering to remove the shoelaces from his sneakers.\n\nKevin has tried to imagine his brother’s frame of mind in jail. “You’re sitting there thinking, ‘Man, the one time I really wasn’t breaking the law, I’m in this situation.’ He got beat up. He felt shame. He wanted medical help, and they probably thought, ‘He’s one of those fake wrestlers. He’s not really hurt.’”\n\nBecause the video surveillance system at the jail didn’t properly work, Rosenblum said, no one knows exactly what transpired while Brian was alone in his cell. At approximately 6:30 PM, correctional officer William Gonzalez walked by the chamber and, according to the lawsuit, observed Brian standing on the bench with a towel over his face. Said Rosenblum, “If he was standing on the bench, he hadn’t stepped off yet. If you got him 30 seconds earlier, he would have lived.”\n\nGonzalez left to throw out the garbage, the lawsuit said. When he returned, he saw “what he still thought was Brian standing on a bench… with a towel over his head.” Gonzalez called Sgt. Judy Wiggins for assistance. They realized that Brian had tried to hang himself.\n\nStill alive, Brian was air lifted to Regional One Medical Center in Memphis. “My dad called me and said, ‘Brian hung himself in jail, but he still has a pulse and he’s breathing,’” Kevin said. “So I thought, ‘OK. Here’s some more crazy shit that Brian kicks out of.’ ‘Hey, you idiot. What were you thinking?’”\n\nBut this time, it was no near-fall. At 3:49 PM on July 29, 2018, with his father watching, Brian was pronounced dead of anoxic encephalopathy.\n\nInstinctively, Lawler snapped a photo of his son’s lifeless body and texted it to Sheriff Doolen. “I told him, ‘I trusted you and believed you when you told me my son would be safe in your jail, and now, he’s dead,’” Lawler said. “Doolen texted back, ‘I’m sorry for your loss.’”\n\n“Hurts my heart to know how Brian decided to check out,” The Rock posted on Instagram. “I never knew him to be suicidal, but I guess sometimes the pain gets too much for one to take. I’ll miss you, man, and the times we had. Thanks for being a great friend. Thanks for being my boy.”\n\n“ So I thought, ‘Okay. Here’s some more crazy shit that Brian kicks out of.’ ‘Hey, you idiot. What were you thinking?’ ” — Kevin Lawler\n\nJerry Lawler was initially cynical about the notion that his son had taken his own life. He suspected that Brian had been killed in a fight, and hung to cover up the assault. His theory was based on more than paranoia. In the photo taken at the hospital, Brian was wearing an oxygen mask while brown marks came around the back of his head and the sides of his neck, stopping just before the throat area. “To Jerry, the space at the front of the neck looked to be the size of a fist,” Rosenblum said. “So Jerry questioned whether Brian was fighting while others were trying to strangle him.”\n\nBut even after Rosenblum ran several tests to verify that Brian could have killed himself with the materials available in his cell, Jerry remains uncertain.\n\nOn the one-year anniversary of Brian’s death, Lawler and his attorney held a press conference, announcing the wrongful death lawsuit, and accusing the sheriff and the county of, “at minimum,” negligence for failing to recognize that they’d placed a vulnerable inmate in danger.\n\nEarlier in the month, Doolen had sued Hardeman County Mayor Jimmy Sain, claiming that the department was understaffed, and that seven of the jail’s 27 employees were paid so poorly that they had no choice but to go on public assistance. That, and the county’s broken equipment, the sheriff said, put both his staff and the public’s safety at risk.\n\nApprised of that lawsuit, Lawler speculated whether the sheriff was somehow attempting to explain the circumstances that led to Brian’s demise.\n\n“Anytime someone dies of suicide, as a parent, you ask yourself, ‘Is there anything I could have done differently that would have saved him?’” Lawler said. “I go through it every day. I wish I could give other parents advice to make things better. But it can’t be better because Brian’s not here.”\n\nKevin finds himself feeling the same type of bereavement. “Even with my dad being who he was, we were still normal,” he lamented, placing his brother’s death on the long list of wrestling heartbreaks. “I never thought we’d be another wrestling tragedy. Now, we’re one of those.”\n\nWhile Brian was alive, Kevin didn't think they resembled one another. Since Brian’s death, though, he said “there are times I’m walking somewhere and I catch myself in the mirror and I see him.”\n\nThere, on the other side of the glass, is Grandmaster Sexay, his grin wild, his eyes sparkling with mischief.\n\n“He never wanted to be old,” Kevin said, remembering Brian the performer. “He never wanted to be a shell of himself. He always wanted to leave the people wanting more.”\n\nIf you or a loved one are struggling with suicidal thoughts, please reach out to the National Suicide Prevention Lifeline at 1-800-273-TALK (8255), or contact the Crisis Text Line by texting TALK to 741741\n\nKEITH ELLIOT GREENBERG is a New York Times bestselling author who co-wrote the autobiographies of WWE Hall of Famers Ric Flair, Freddie Blassie and Superstar Billy Graham, as well as the third edition of the WWE Encyclopedia of Sports Entertainment. His next book, on the indie wrestling revolution, is scheduled to be released by ECW Press in 2020.", "description": "Brian Christopher Lawler was the son of the King of Memphis Wrestling, and struggling to revive his own WWE career. Then he got arrested and turned up dead in jail.", "authors": ["Keith Elliot Greenberg"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1568945752/190919-greenberg-grandmaster-sexay-tease_wlvisi", "published_at": "2019-09-22"}