{"pub": "dailybeast", "url": "https://thedailybeast.com/jeffrey-epsteins-alleged-accomplices-where-are-sarah-kellen-nadia-marcinkova-adriana-ross-and-lesley-groff", "downloaded_at": "2019-10-07 01:08:53.108311+00:00", "title": "Where Are Jeffrey Epstein’s Alleged Accomplices Now?", "language": "en", "text": "Editor's note: On August 10, 2019, Jeffrey Epstein died in an apparent jailhouse suicide. For more information, see The Daily Beast's reporting here.\n\nFor decades, financier Jeffrey Epstein allegedly abused dozens of underage girls in a sex-trafficking enterprise, according to a new federal indictment unsealed in the Southern District of New York.\n\nBut in order to successfully “create a vast network of underage victims for him to sexually exploit” and expand his network of possible targets, he relied on the loyalty and organizational skills of his employees, prosecutors claim.\n\nAccording to the 14-page indictment filed in Manhattan federal court on Monday, the 66-year-old hedge-fund manager/convicted sex offender “worked and conspired with others, including employees and associates” to run a sex-trafficking enterprise between 2002 and 2005, preying on “dozens” of girls as young as 14 at his mansions in New York and Palm Beach, Florida.\n\nDuring each encounter listed in the indictment—which charges Epstein with one count of sex trafficking and one count of sex-trafficking conspiracy—girls were taken to a room to perform “massages” nude or partially nude before Epstein would escalate the encounter to “include one or more sex acts.”\n\n“Epstein typically would also masturbate during these sexualized encounters, ask victims to touch him while he masturbated, and touch victims’ genitals with his hands or with sex toys,” the indictment states, adding the money man knew that the girls were minors.\n\nAfter the assault, prosecutors allege, Epstein or his associates would pay each girl hundreds of dollars in cash and often would turn the victim into a recruiter of new girls to abuse.\n\n“In this way, Epstein created a vast network of underage victims for him to sexually exploit,” the indictment said. The indictment goes on to detail three anonymous victims and refers to three unnamed employees who allegedly assisted Epstein in the enterprise, including by making calls to arrange for “massages” for Epstein.\n\nIt’s not the first time that Epstein’s employees and associates have been accused of helping procure underage girls for his abuse.\n\nIn Epstein’s controversial 2008 plea deal in Florida—which was granted by then-prosecutor and now-Secretary of Labor Alexander Acosta and other DOJ attorneys, without informing the billionaire’s alleged victims—four women are named as possible accomplices. Epstein’s non-prosecution agreement, which sentenced him to 18 months in prison, also granted immunity to the four women and any other “potential co-conspirators,\" identified in the document as “including but not limited to Sarah Kellen, Adriana Ross, Lesley Groff, or Nadia Marcinkova.”\n\n“While Epstein was at the head of the international sex trafficking organization, that conspiracy could not have functioned without many others playing their part,” attorney Paul Cassell, who represents multiple victims of Epstein, told The Daily Beast after Epstein’s arrest on Saturday. “Jane Doe 1 and 2 will continue to fight for all of Epstein’s co-conspirators to be held accountable in New York, Florida, and anywhere else they committed crimes.”\n\nDetails of Epstein’s alleged trafficking in Monday’s indictment mirror the accounts of scores of underage women in Florida, who described several “schedulers” who organized his alleged sex sessions and one young woman, described as Epstein’s “sex slave,” who would allegedly participate in the abuse while the billionaire watched.\n\nBut where are Epstein’s alleged accomplices now?\n\nSarah Kellen\n\nSarah Kellen, Epstein’s former assistant who allegedly kept a Rolodex of young girls to recruit for her employer, is now married to NASCAR driver Brian Vickers. Along with traveling with her husband, the 39-year-old (who also goes by the name Sarah Kensington) is the owner of an interior-design firm, SLK Designs.\n\n“Sarah Kensington makes a living doing what she loves in life, interior design,” a Facebook page connected to SLK Designs states. “She is the owner of SLK Designs LLC. and has studies at several schools including the University of Hawaii and New York School of Interior Design.” The social-media page also details Sarah’s interests, which include “fashion, photography, travel, delicious cuisine, and anything design related.”\n\nThe page also notes that Sarah “is working with a number of clients on various projects including renovating several corporate apartments in New York, the Caribbean, and Paris. For the houses that Sarah manages, she does a number of duties which can involve organizing staff schedules, looking for and interviewing housekeepers and chefs, purchase and source items that are needed for the household (flatware, dishes, furniture, art, etc.), design floral arrangements, and interior design.”\n\nEpstein also owns homes in New York, the U.S. Virgin Islands, and Paris.\n\nAccording to public records, SLK Designs once operated from a building in Midtown Manhattan owned by Epstein’s property-manager brother, Mark Epstein. The condominium listed to take SLK Designs deliveries, at 301 E. 66th St., is the same address where Epstein allegedly rented units to house models.\n\nThough not directly named in Monday’s indictment, Kellen has been accused in court documents related to the Florida case of booking the “massages,” often calling girls to ensure they “were available for encounters” when Epstein would travel to Palm Beach. Several alleged victims in Florida told authorities they were led to and from the upstairs room in Epstein’s mansion by a woman named Sarah, after she lined up the oils on his massage table. According to one police report, Kellen also warned the girls not to talk to authorities about the encounters.\n\nMonday’s indictment contains similar allegations about unnamed Epstein employees. “When a victim initially arrived at the Palm Beach Residence, she would be escorted to a room, sometimes by an employee of Epstein’s, including, at times, two assistants who, as described herein, were also responsible for scheduling sexual encounters with minor victims,” the Monday indictment states.\n\nKellen also reportedly traveled on Epstein’s private plane with former President Bill Clinton on at least 11 flights between 2002 and 2003, according to flight logs published by Gawker in 2015.\n\nKellen, who has properties in North Carolina, New York, and Miami Beach, did not respond to The Daily Beast’s request for comment. A NASCAR spokesperson told The Daily Beast the organization does “not have a comment” about Kellen’s alleged misconduct.\n\nNadia Marcinkova\n\nNadia Marcinkova, Epstein’s alleged “sex slave” who was accused of participating in sexual encounters with underage girls, is now an FAA-certified commercial pilot and flight instructor. Marcinkova, 33, who was allegedly brought from the former Yugoslavia to live with Epstein, now goes by the named “Global Girl” on social media, and has changed her last name.\n\n“Global Girl (Nadia Marcinko) spent many years in the international marketing and advertising world as an international fashion model and spokesperson, with clients including Chanel, Christian Dior, Valentino, Vogue and MTV. After many successful years in the modeling industry, she was ready for longer runways and became a licensed commercial pilot,” her Facebook account states, adding that she is an “FAA certified flight instructor and Gulfstream II, III & IV pilot.”\n\nMarcinkova also is the founder and CEO of Aviloop, a website selling discounted flying lessons and other deals related to aviation. Since 2011, Aviloop provides a slew of services, including designing custom pilot team and “organizing team building events.” As with Kellen, the aviation company is registered at the building once owned by Mark Epstein and allegedly used as a model clubhouse by his brother.\n\nThough Marcinkova originally started calling herself \"Gulfstream Girl,” she was sued in 2013 by Gulfstream Aerospace Corp. for trademark infringement. On Jan. 6, 2014, the lawsuit filed in a New York Southern District court was settled after Marcinko changed her online name to Global Girl.\n\nAccording to written testimony by several alleged victims, Marcinkova is described as having “encouraged and engaged in sexual acts” with young girls while Epstein watched. According to police, Epstein told one victim Marcinkova was his “sex slave” and that he’d purchased her from her family in the former Yugoslavia when she was 15. Marcinkova is not directly named in Monday’s indictment.\n\nMarcinkova, who lives in New York, did not immediately respond to The Daily Beast’s request for comment.\n\nAdriana Ross\n\nAdriana Ross, a former model from Poland who allegedly helped organize Epstein’s predatory sessions, moved to Florida in 2002 and was hired to work at the financier’s mansion. Ross, who often went by Adriana Mucinska and is not directly named in Monday’s indictment, also frequently flew on Epstein’s private jet alongside Bill Clinton, according to flight records.\n\nAlong with her fellow alleged co-conspirators, Ross was questioned in 2010 about whether Britain’s Prince Andrew participated in Epstein’s alleged sex enterprise. Refusing to answer questions about the inner workings of the alleged scheme, Ross repeatedly invoked her Fifth Amendment rights, according to previous reports. As previously reported by The Daily Beast, Ross also lived at the East 66th Street building in Manhattan.\n\nRoss’ current profession or address was not immediately clear and she could not be reached for comment.\n\nLesley Groff\n\nLesley Groff was another Epstein assistant who allegedly coordinated travel for young girls, often calling to schedule “massages.” Though not directly named in Monday’s indictment, the 51-year-old has been previously named as one of Epstein’s three female assistants. According to a 2005 Chicago Tribune story about executive-assistant pay, Epstein divulged his assistants made about $200,000.\n\n“They are an extension of my brain. Their intuition is something that I don’t have,” Epstein told the Tribune. According to public records, Groff currently lives in Connecticut and did not respond to The Daily Beast’s request for comment.", "description": "When prosecutors gave Jeffrey Epstein a sweetheart plea deal in 2007, they agreed not to charge four women allegedly involved in recruiting dozens of underage girls for abuse.", "authors": ["Pilar Melendez"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1562621212/190708-pilar-epstein-co-Conspirators-tease_ybphtf", "published_at": "2019-07-09"}