{"pub": "reuters", "url": "https://reuters.com/article/us-syria-security-turkey-hungary-intervi/hungary-urges-eu-dialogue-with-turkey-to-prevent-new-wave-of-migrants-idUSKBN1WP2RH", "downloaded_at": "2019-10-11 00:29:03.604910+00:00", "title": "Hungary urges EU dialogue with Turkey to prevent new wave of migrants", "language": "en", "text": "BUDAPEST (Reuters) - The European Union should have a dialogue with Turkey despite Ankara’s offensive on Kurdish-led forces in Syria, in order to avoid a fresh wave of migrants coming to Europe, Hungarian Foreign Minister Peter Szijjarto said on Thursday.\n\nHungarian Foreign Minister Peter Szijjarto attends an interview with Reuters in Budapest, Hungary, October 10, 2019. REUTERS/Marton Dunai\n\nTurkish troops and their Syrian rebel allies pushed further into Syrian territory on Thursday, opening up a new front in the Syrian civil war and exposing Europe’s inability to influence the direction of the conflict.\n\nThe EU relies on Turkey to curb the arrival of refugees into Europe following a 2016 agreement to seal off the Aegean route after more than 1 million people entered the bloc. Turkey, which hosts 3.6 million Syrian refugees, threatened to “open the gates” to allow those already in the country to head for Europe unless it receives support for its plans.\n\n“We need a constructive dialogue with Turkey to avoid a situation when an additional migratory flow arrives to Europe,” Szijjarto said in an interview, weeks before Turkish President Tayyip Erdogan is due to visit Budapest in early November.\n\nSzijjarto said Hungary’s fence on its southern border with Serbia would be the first point where any new flow of migrants could be stopped and that this should be avoided. He also criticized some EU member states, without naming names, “who are making a competition who can bash the Turkish president more” while relying on Turkey to curb the flow of refugees.\n\nPrime Minister Viktor Orban’s nationalist government has forged close relations with Turkey, China and some ex-Soviet states in Middle Asia as part of an eastern opening initiative.\n\nRUSSIAN RELIANCE\n\nOrban, in power for nearly a decade, has often been at loggerheads with Brussels, for example over his refusal to take in migrants under an EU quota scheme and his efforts to tighten control over the media, and academic institutions.\n\nUnder Orban, Hungary also pursues what he has hailed as good pragmatic relations with Russia. President Vladimir Putin is due to visit Budapest later this month.\n\nSzijjarto said the main issue on the agenda will be energy, with Hungary still reliant on Russia for the natural gas it needs, as diversification of supply was still not possible in Central Europe due to a lack of alternative sources and pipelines.\n\n“To ensure the gas supply of the country for the upcoming 4-5 years it’s going to be Russia to negotiate with,” Szijjarto said, adding he had already agreed with Russian state gas giant Gazprom to start talks about gas shipments for this period.\n\n“The offer will decide about the length of the period covered by the next agreement,” Szijjarto said.\n\n“I like listening to our ... Western allies speaking about diversification in this region but my question is what did they do for that?”\n\nSzijjarto said the TurkStream pipeline should be constructed as soon as possible in Bulgaria because that will open up an additional delivery route to Hungary. TurkStream is part of Moscow’s efforts to bypass Ukraine as a gas transit route to Europe.\n\nWhen asked where Hungary would stand if the EU decided at the end of 2019 to extend sanctions against Russia that were imposed on Moscow after its seizure of Crimea from Ukraine, Szijjarto said: “We would never break European unity on this issue ... We have not vetoed yet, we will not veto it.”", "description": "The European Union should have a dialogue with Turkey despite Ankara's offensive on Kurdish-led forces in Syria, in order to avoid a fresh wave of migrants coming to Europe, Hungarian Foreign Minister Peter Szijjarto said on Thursday.", "authors": ["Krisztina", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439401952&w=1200&r=LYNXMPEF9923F", "published_at": "2019-10-10"}