{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/grans-fury-after-being-told-20468039", "downloaded_at": "2019-10-05 22:44:48.517615+00:00", "title": "Gran's fury after being told to pay Egyptian toyboy ex who wooed her with camels £40k", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nSmitten Marilyn Lewis fell for an Egyptian half her age but is now counting the heartbreaking £40,000 cost after her desert love turned to dust.\n\nMarilyn ignored family warnings after being swept off her feet by the tour rep who wooed her with free camel rides.\n\nShe was 50 and £15-a-day guide Amr Elasar was just 22 when they met at a Red Sea resort in 2008.\n\nA romance began the following year when Marilyn returned to Sharm El Sheikh, where she and her ex-husband co-own a villa.\n\nShe and Amr wed at the British Embassy in Cairo in 2009 but things turned sour back in the UK – despite Marilyn blowing £30,000 on treats for her new husband.\n\nMarilyn says he turned “moody and money-grabbing” and went on cougar dating sites.\n\nThey eventually divorced in 2014. Now Marilyn, a 61-year-old gran, must pay him £40,000 in a court-ordered divorce settlement.\n\n(Image: Tim Merry/Sunday Mirror)\n\nPet sitter Marilyn, who has daughters aged 34 and 32 and a 21-year-old son, tells the Sunday Mirror: “I feel sick. I’m a kind and compassionate person and it horrifies me to realise my husband was only after my cash.\n\n“Behind his charisma is a cold and calculating character. He never loved me – he loved what I could bring him.\n\n“He mentioned how lucky I was to live in the UK. I brought him here, now I’m paying the price.”\n\nMarilyn thought Amr was 28 when they met and admits being embarrassed after ignoring pleas not to make him husband No3.\n\nRevealing how her heart ruled her head, she says: “It might sound crazy but those first dates were the best days of my life.\n\n“He wooed me like a pro and I was flattered. I’d never met anybody who made me laugh like that and was so romantic.\n\n“It was like a film. He took me to Cairo, he gave me camel rides and one night he stuck candles in the sand and arranged a musician to serenade us.\n\n(Image: Tim Merry/Sunday Mirror)\n\n“I was embarrassed to be with a younger man, but he told me our souls were the same age.\n\n“Initially Amr paid for everything but soon he told me he wanted a phone and then an iPad, which I bought. And I often wired him cash.\n\n“I was happy to oblige him with the odd gift, but back in the UK he wanted more and more and I stupidly went with it. I was insecure being with a young, handsome man and was trying to recapture the good times.\n\n“I even remortgaged my house to buy him stuff.”\n\nMarilyn says warnings from family and friends only made her “more determined to do what I wanted”.\n\nShe did insist on a pre-nup but never got it signed by a witness – so it was void.\n\nMarilyn realised things were unravelling after they returned to the UK in 2010, with Amr initially staying on a six-month visa.\n\nHer daughters moved out of the family home in Bexleyheath, South East London, in protest. Marilyn says: “Amr changed almost instantly, becoming moody and more demanding.\n\n“He kept telling me I promised to take care of him.\n\n(Image: Tim Merry/Sunday Mirror)\n\n“I spent thousands on a car and driving lessons for him so he could have a good life here.\n\n“After a while I suspected him of messaging women on social media. He promised he wasn’t but when he returned to Egypt the following February we briefly split.”\n\nMarilyn claims that one woman in her 60s contacted her claiming to be owed £6,000 by Amr.\n\nShe dismissed the woman as a bitter ex – but now regrets being so hasty. Marilyn says Amr returned to the UK in September 2011 and they rekindled their relationship.\n\nBut within months, Marilyn says she found he had messaged lovelorn women claiming to be an accountant.\n\n“I felt utterly betrayed,” she says. “I confronted him and he swore he would have counselling. I insisted he moved out – but we remained a couple.”\n\nShe finally dumped him after he persuaded her to buy him a £4,000 second-hand Mercedes in March 2014, promising to pay her back £200 a month.\n\nMarilyn adds: “We had this blazing row in front of the salesman and eventually I agreed to buy it, but I felt a fool.\n\n“He only paid £400 over two months. Then the bailiffs came round and I found he had taken out two £3,000 loans.\n\n“I insisted he sold the Mercedes to pay off the debts and he was furious.\n\n“I finally realised Amr had only wanted what I could give him. I was utterly humiliated.\n\n“Everyone was thinking ‘I told you so’. My trust in people was completely destroyed.”\n\nThe divorce was finalised in summer 2014, around the time Amr was granted leave to remain in the UK.\n\n(Image: Tim Merry/Sunday Mirror)\n\nThey did meet up occasionally and Marilyn learned Amr had jobs at fast-food chains and other girlfriends.\n\nThen, last year, came the financial bombshell – a £100,000 divorce claim. By the time it reached court last month the claim was down to £50,000, which Marilyn rejected.\n\nBut eight days later she was ordered to pay £40,000 in a judgment at Medway County Court, Kent. It was concluded Marilyn would likely be able to meet her own needs in the future, whereas Amr would need to “establish himself” in the UK.\n\nMarilyn, who hopes to appeal, says: “I am staggered, it’s an outrage. I cannot see how this man is entitled to a penny.”\n\nThe judge made an exemption on her home being sold to cover costs but recommended proceeds from selling her villa could be used. The holiday home is up for sale but Marilyn has to split proceeds with her second husband – then take out a loan to pay off Amr.\n\nHer daughters have set up a crowdunding page to help. Marilyn admits: “I got myself into this mess by being too kind and compassionate. I was gullible.”\n\nAmr told the Mirror: “This was a court order. They reviewed everything and I have been rewarded that sum.\n\n“I did not lie. I believe the courts here are very fair.”\n\n(Image: Tim Merry/Sunday Mirror)\n\nHe admitted accepting financial help during their marriage, saying: “She was financially better positioned than me and willing to pay for everything.\n\n“I was impressed by her lifestyle and just wanted an adventure and to have a good time. That’s it.\n\n\"She wanted me to stop working, said she had money and didn’t care about it. All marriages have financial issues.”\n\nHe is now 33 and denied lying about his age.\n\nBut he admitted he could “not remember” if he used the cougar dating site to contact other women or not.\n\nAmr added: “She will try anything possible. She might be upset and be seeking revenge.\n\n“I did love her. We travelled and had an amazing time. Anyway, we’re here now.”", "description": "EXCLUSIVE: Marilyn Lewis was flattered to be wooed by an Egyptian toyboy - but things soon turned sour when they moved back to the UK", "authors": ["Amy Sharpe", "Image", "Tim Merry Sunday Mirror"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20466349.ece/ALTERNATES/s1200/1_Marilyn-Lewis.jpg", "published_at": "2019-10-05"}