{"pub": "businessinsider", "url": "https://pedestrian.tv/news/a-big-ass-seal-helped-thwart-an-alleged-drug-gang-during-a-billion-dollar-bust-in-wa", "downloaded_at": "2019-09-12 23:49:46.282076+00:00", "title": "A Big-Ass Seal Helped Thwart An Alleged Drug Gang During A Billion Dollar Bust In WA", "language": "en", "text": "An alleged drug gang at the centre of a billion dollar drug bust in Western Australia was apparently stopped in part by the intimidating size of a giant seal.\n\nPolice raided Burton Island last week, an island off the coast of Geraldton, WA, and found two men allegedly in possession of just over a tonne of methylamphetamine, cocaine, and ecstasy hidden in bags underneath seaweed.\n\nFrenchman Antoine Dicenta, 51, and British man Graham Palmer, 34, reportedly tried to run from the cops but were stopped when a huge seal blocked their path.\n\nAuthorities had been initially called to the island’s surrounds after a yacht was found stuck on a reef, missing a dinghy.\n\n“We’ve disrupted a big international drug syndicate here,” Western Australia police commissioner Chris Dawson told ABC Radio, before outlining how the police had been helped out by an unlikely marine beast.\n\n“They woke [the seal] up and it jumped up with its big chest out and bellowed at them” he said. “The guys basically had the choice of going through the seal or getting arrested and they ended up choosing getting arrested.”\n\nOn Thursday police announced that three more people had been arrested as part of the investigation and charged with possessing prohibited drugs with intent to sell or supply.\n\n“The arrests yesterday represent a significant development in the investigation,” said Brad Royce, assistant commissioner of the WA State Crime Squad.\n\n“There is still a lot more work to be done and our efforts will continue as we work our way towards the more senior members of the criminal network”.", "description": "", "authors": ["Brad Esposito"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/09/gfhfjgfj.jpg", "published_at": "2019-09-12"}