{"pub": "washingtonpost", "url": "https://washingtonpost.com/travel/2019/10/17/golden-age-airplane-food-is-over-future-snacks-sustainability", "downloaded_at": "2019-10-19 11:03:39.748168+00:00", "title": "The Golden Age of airplane food is over. The future: Snacks and sustainability.", "language": "en", "text": "The rattle of a flight attendant’s service cart sparks a nostalgic joy in me. No matter how many times I fly, I perk up when those trolleys come rumbling down the aisle, maiming any appendages brazenly stretched beyond arm rests. What, pray tell, will the flight attendant hand me this time? A Stroopwafel? A rectangle of lasagna?\n\nSometimes food on a plane sets the tone for your trip, like a baguette and wine on Air France or an ube pastry on Philippine Airlines. Sometimes food on a plane absolutely fails to do that, like the ambiguous goo an airline served to me as “pasta” on a flight to Chile.\n\nNot getting a meal at all is a possibility as well. Since the Airline Deregulation Act of 1978, airlines have been doing whatever they can to cut costs and stay competitive. Free food was an easy perk to nix. Today, you won’t find a lot of food on most domestic flights anymore. If you do, you’re likely to be paying for it, or it’s just a snack. A bag of pretzels here, a Biscoff there.\n\nTo better understand the state of airplane food today, you have to look at where it started — and where it may be headed.\n\nWhile many fliers complain about paying for food on planes, it’s actually the way things were from the very beginning. Passengers on Handley Page Transport’s repurposed World War I bombers from London to Paris in 1919 experienced the first in-flight meal, and it wasn’t free. It was a prepackaged lunchbox that cost roughly three shillings (or $9.50, a steep price at the time), according to Matthew Burchette, senior curator of the Museum of Flight in Seattle.\n\n\n\nThe first-class compartment of a Boeing commercial passenger plane in the 1950s with, in the foreground, a couple eating a meal and a flight attendant in a bowtie serving another happy pair. (Authenticated News/Getty Images)\n\n“Right after World War I, air travel really started — no pun intended — to take off,” Burchette says. “As aircraft got more and more sophisticated, it was easier for airlines to begin to think about actually serving their clientele food.”\n\nPlanes grew in size, and their food and beverage amenities followed suit. According to Burchette, cold food was the norm until 1936, when United Airlines became the first company to install a kitchen onboard. Guests were given the option between fried chicken and scrambled eggs. The move inspired other airlines to do the same. Galleys became more advanced, complete with electric ovens in the beginning of the Jet Age.\n\n“It wasn’t until the golden age of air travel, which is the ’50s and early ’60s, that [in-flight food service] really just went nuts,” he says.\n\nPan American World Airways, or Pan Am, was a leader in swanky in-flight food service. The meal on a July 20, 1939, flight started with a tropical-fruit cocktail, followed by cream of tomato soup, a half-broiled chicken with wine sauce, wax beans and Delmonico potatoes. For dessert, passengers had Boston cream pie and Blue Mountain coffee. Menus boasted playful illustrations and lengthy wine and spirits lists.\n\n[Why a spilled cup of coffee forced a plane to make an unplanned landing]\n\nA traveler in economy in the 1960s could expect to enjoy a selection of French wines with their meal of cream of tomato soup, veal with pilaf, salad and dessert. In the ’70s, flying Pan Am from Fairbanks, Alaska, to Tokyo meant starting with cocktails like a Manhattan or whiskey sour, followed by hors d’oeuvres, teriyaki steak or chicken, rice and dessert. Smokers could choose from a selection of cigarettes.\n\n\n\nA TWA stewardess preparing passenger meals in the galley in the mid-1940s. (PhotoQuest/Getty Images)\n\nThen there was the Concorde. Introduced in 1969, the supersonic airliner powered by turbojet could transport passengers from Western Europe to the East Coast of the United States in 3 1/2 hours. About 30 times more expensive than the standard transatlantic flight, a ride on the Concorde was pure luxury.\n\n“Nothing was higher and ‘schmancier,’ for lack of a better word, than the Concorde,” Burchette says.\n\nWithout screens on seat backs or personal gadgets to keep travelers happy on long-haul flights, in-flight meals in the days of yore served as entertainment. Meals were multi-course. Flight attendants wielded large knives to carve hams and steaks tray-side. Eating and drinking was as much about the experience as it was about feeding passengers.\n\n“Tablecloths. Silverware. I’m old enough that I can remember actual knife and fork. And of course, the booze flowed freely,” Burchette says.\n\nBut the glory days of free-flowing champagne and canapés proved to be unsustainable.\n\nThe in-flight experience took a turn with deregulation.\n\n“Deregulation was the game-changer, because you had all these low-cost carriers come in and start to compete against the higher-class carriers,” Oakley says. Airlines “started cutting back. They would still feed you on long-distance flights, transcontinental or international flights, but domestic passengers started getting next to nothing.”\n\nCommercial aviation became mass transportation, allowing billions of people to travel around the world at a lower cost than ever. The style of in-flight dining had to change, too.\n\n“Back in the old days it was about the service. Now people want speed,” says Enda Kavanagh, product manager for in-flight customer experience at Aer Lingus. While the Irish carrier had to speed up its service, it still offers complimentary meals in coach. This isn’t the norm in a post-deregulation world.\n\nAirlines began to unbundle their services as a way to earn more revenue while keeping ticket prices competitive. Passenger services that were once complimentary, like checking a bag or getting lunch, now come at a fee. Oakley says unbundling services has led to airlines grossing some $35 billion annually.\n\nSlapping a fee on every possible amenity became the norm for economy fliers. We came to expect the $10 cheese-and-cracker box, just like we expected the $8 water bottle at the airport. If a meal did come your way, it was not a multi-course experience, but a small rectangle covered in aluminum foil, served with a dinner roll and cube of dessert.\n\nEating meals in economy got worse, and it had nothing to do with the food. Passengers today are so cramped while sitting that it’s near-impossible to enjoy anything in coach, since the average seat pitch has shrunk from 35 inches to 31 inches. Navigating a meal on your tiny tray table is a test of claustrophobia tolerance, particularly if you’re trapped in a middle or window seat.\n\n[Are airplane seats getting dangerously small? The FAA is about to find out.]\n\nUp in business and first class, the luxurious touches of the Concorde are still alive and well. Champagne still flows freely. Your multi-course meal, designed by a Michelin-starred chef, may still end with your selection from a dessert cart rolled to your lie-flat seat. Once you’ve sipped your digestif, you can wipe your face with a linen napkin and apply some Bulgari toiletries to your dehydrated skin.\n\nBut further back in economy, meals are less elegant. If you’re flying internationally, you’ll get a tray of food and a drink and pray that you don’t drop anything under your tray table, where it’s impossible to retrieve it. Flying domestic? You can buy an overpriced turkey sandwich or a small container of hummus with some crackers if your single packet of pretzels don’t hold you over.\n\nWhile the nickel-and-diming in economy can be a huge frustration for passengers, the future of airline food may not be doomed, however. There are people working hard to make airplane food better in unique ways.\n\nIf you’ve flown internationally on a major carrier, you’ve probably eaten a Gate Gourmet in-flight meal whether you knew it or not. Founded in Switzerland, Gate Gourmet is a catering company that services 700 million passengers annually, with some 200 locations in more than 60 countries. You wouldn’t see a Gate Gourmet label on your dinner tray, but you might spot the truck loading food onto your plane if you’re hanging around your boarding gate a few hours before departure.\n\n\n\nA cook prepares the salmon in the hot kitchen at the Gate Gourmet food complex in Dulles, Va. (Gabriella Demczuk for The Washington Post)\n\nEvery day, about 300 Gate Gourmet employees at Dulles International Airport in suburban Washington produces an average of 18,000 meals for 275 flights. In high seasons (May through Labor Day, then mid-December to mid-January), that number shoots up to 25,000 meals daily for its 13 airline partners. Food prep for those 18,000 meals begins at 4 in the morning.\n\n\n\nExecutive chef Basil Rafeedie roasts vegetables in the hot kitchen. (Gabriella Demczuk for The Washington Post)\n\nAccording to Gate Gourmet general manager Jim Stathakes, there’s been a shift in the airline catering industry thanks to the competition among carriers.\n\n“In the last 10 to 15 years, a lot of food has been removed from the economy class, especially domestically,” says Stathakes. “Now all of the airlines are starting to put food back in economy. All of the airlines are competitive in nature and are always looking to enhance meals.”\n\nThat’s being done on a scientific level. It had to be. Cooking for people is vastly different when they’re going to be eating that meal on an airplane. The lower pressure of an airline cabin wreaks havoc on your senses.\n\nLufthansa, Germany’s largest airline, learned this in 2010 after it commissioned a study from the Fraunhofer Institute for Building Physics to look at the science of in-flight dining, hoping to figure out how to make its food more appealing.\n\n“For fresh herbs, you need more than double the ingredients to reach the same flavor profile than on ground level,” says Lufthansa catering executive Ernst Derenthal. “Dry herbs don’t work very well. They turn into a hay flavor up there.”\n\nTaste tests were conducted in a grounded plane inside of a tent with pressure made to imitate 10,000 feet. Recipes were adjusted accordingly. They learned that certain ingredients translate easily from the ground to the air. Warm spices like cinnamon, cardamon, and chili showed no difference on the ground and in the air. Umami-rich ingredients like soy sauce fared well, too.\n\n\n\nIndividually wrapping apples. (Gabriella Demczuk for The Washington Post)\n\n[Why your emotions and senses go haywire on a plane]\n\nThey changed their menus accordingly.\n\n“After we had new knowledge about this, we worked on it,” says Derenthal. “People suddenly liked [the food] better. It’s not perfect today. But we got closer than we were back then.”\n\nCooking innovations won’t be the only changes in the future of airplane food. The real change is happening before ingredients get to the catering kitchen.\n\nAbout an 11-minute drive from Newark Liberty International Airport, there’s a once-abandoned steel mill that now looks more like a futuristic laboratory than what it really is: a farm. AeroFarms is the world’s largest indoor vertical farm, a behemoth 70,000-square-foot operation that can harvest up to 2 million pounds of produce per year.\n\n\n\nInstead of relying on the sun or fertile soil, AeroFarms grows produce in a fully controlled indoor facility using an aeroponic growing system that requires 95 percent less water than field farming. (AeroFarms)\n\nInstead of relying on the sun or fertile soil, AeroFarms grows produce in a fully controlled indoor facility using an aeroponic growing system that requires 95 percent less water than field farming. Besides being more environmentally sustainable, the system speeds up harvest cycles and yields more safe and consistent crops.\n\nSingapore Airlines launched a new “farm-to-plane” initiative using AeroFarms produce into its business-class offerings on the SQ21 Newark-to-Singapore route. The next step will be on JFK-to-Singapore flights, followed by putting the produce in all cabin classes.\n\nAeroFarms ingredients can be grown just in time for a flight — vs. in a far-flung place, picked to be shipped and then finally prepared for flying.\n\nSingapore Airlines is far from the only airline working on upping the ante on its plane food starting at farm-level. Last year, Crop One Holdings partnered with Emirates Flight Catering to give AeroFarms a run for its money by announcing they’d spend $40 million to build the world’s largest vertical farming facility in Dubai.\n\nOn a more artisanal note, Scandinavian Airlines sources organic, handpicked ingredients from farms they can readily name, as well as other Scandinavian treats, like craft beer and candy, for its passengers.\n\n\n\nAeroFarms and Singapore Airlines launched a new “farm-to-plane” initiative to incorporate aeroponic produce into business-class meals. (Courtesy of AeroFarms)\n\nIt might not come as a surprise that the horizon is better-looking in premium cabins than in coach, considering that income inequality in America is at a five-decade high. As the gap between the rich and the poor widens, so too is the contrast between class services on planes.\n\n“I do think the future of food service is bright for those people who can afford to pay for it,” says Oakley. “There’s good things going on in one segment, and not good things in the other.”\n\nWhile that may bother adults who have lived long enough to compare the changes to in-flight meal service over the decades, it may not even matter to Gen Z. Research has shown that the younger generation of travelers is more environmentally conscious and frugal, and probably not as concerned with the lack of food in economy.\n\nSo while the service may never generally return to what it was in air travel’s “glory days,” there are steps being taken to ensure the food served in the sky is both sustainable and delicious.\n\nRead more:\n\nA new report reveals the cleanliness of airline water. It’s … not great.\n\nTell us what you think of By The Way\n\nA woman managed to sneak onto a Delta flight — then refused to move when caught\n\nPack these 8 things in your carry-on bag for the best plane sleep", "description": "It started as boxed lunches. It ascended to lavish meals (perhaps French wine paired with a veal entree), even in economy. Now, we're back to where we started.", "authors": ["Natalie B. Compton", "Reporter Covering The Mechanics Of Travel", "Natalie Compton Is A Staff Writer For The Washington Post'S New Travel Destination", "The Way."], "top_image": "https://www.washingtonpost.com/resizer/QNTA5c6mERW32qjh9qj-eKtQl54=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LIYASQXOUAI6TO362IBG5YGBTE.jpg", "published_at": "2019-10-17"}