{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/saudi-king-names-faisal-bin-farhan-al-saud-foreign-minister-191023190440162.html", "downloaded_at": "2019-10-23 23:25:03.942583+00:00", "title": "Saudi king names Faisal bin Farhan Al Saud foreign minister", "language": "en", "text": "Saudi Arabia's King Salman has named Prince Faisal bin Farhan Al Saud as the kingdom's new foreign minister, fewer than 10 months after his predecessor took office.\n\nThe appointment on Wednesday was reported by the official Saudi Press Agency, which cited a royal decree.\n\nPrince Faisal had served for the last few months as Saudi ambassador to Germany and earlier as political adviser at the Washington embassy. His previous business career in the defence industry included being chairman of a joint venture with planemaker Boeing.\n\nThe new minister took over from Ibrahim al-Assaf, who was appointed minister of state, it added.\n\nThe outgoing former minister had replaced Adel al-Jubeir in December 2018.\n\nAt the time, his appointment was widely seen as an effort to improve the kingdom's image after the crisis caused by the killing of journalist Jamal Khashoggi and greater scrutiny of the long-running war in Yemen.\n\nSaudi Arabia, a key United States ally in confronting Iran, has faced intense Western criticism in the past year over its human rights record including the Khashoggi murder and its involvement in the devestating war in Yemen.\n\nAccording to another royal decree also published on Wednesday, Saleh bin Nasser bin al-Ali al-Jasser replaced Nabil bin Mohammed al-Amoudi as transport minister.\n\nIt was unclear if al-Amoudi would have another government position. He was appointed last month to the board of state oil giant Saudi Aramco, which is planning a partial share flotation.\n\nThe kingdom has been navigating a spike in tensions with its regional rival Iran, with attacks on Saudi oil facilities last month that temporarily halved the kingdom's crude output and sent prices soaring.\n\nYemen's Iran-backed Houthi rebels claimed responsibility, but US officials blamed Tehran, charging that the rebels did not have the range or sophistication to target the facilities.\n\nTehran has denied involvement and warned of \"total war\" in the event of any attack on its territory.", "description": "Appointment comes fewer than 10 months after outgoing Foreign Minister Ibrahim al-Assaf took office.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/23/6366d317614843f68363e2baa3729f7c_18.jpg", "published_at": "2019-10-23"}