{"pub": "yahoo", "url": "https://news.yahoo.com/meghan-mc-cain-shuts-down-bodyshaming-comment-about-her-weight-i-never-dieted-to-get-a-man-or-a-job-225250192.html", "downloaded_at": "2019-10-02 00:42:56.707539+00:00", "title": "Meghan McCain shuts down body-shaming comment about her weight: 'I never dieted to get a man or a job'", "language": "en", "text": "Meghan McCain has often talked candidly about being the victim of body shaming. She even credits being fat-shamed for helping her jumpstart her career and earning a place as co-host of “The View.” So when a Twitter troll snidely body-shamed the host in the guise of providing unsolicited career advice, McCain was quick to shut the social media user down.\n\nOn Tuesday, McCain shared a photo of herself with fellow “The View” co-host, Abby Huntsman, wearing pink for Breast Cancer Awareness month. For reasons unknown, a Twitter user commented on the tweet to discuss McCaine's profile picture.\n\nHow many pounds ago was that profile picture?\n\nJenny Craig, NutriSystem or Weight Watchers (WW) would endorse you without hesitation. — Jacklynn Johnson (@Jacklynnbj) October 1, 2019\n\n\"How many pounds ago was that profile picture? Jenny Craig, NutriSystem or Weight Watchers (WW) would endorse you without hesitation,\" the woman wrote.\n\nIn the past, McCain has commented that she has struggled with her fluctuating weight, but says the constant body shaming she experiences isn't nearly as bad as what some people endure.\n\nHey Jacklynn - it's harassment like this that can lead women to eating disorders. I am one of the lucky ones who never suffered from it. I never dieted to get a man or a job and some how landed my dream both - hope young girls see me and know they don't have to diet either. https://t.co/onVONeY6ow — Meghan McCain (@MeghanMcCain) October 1, 2019\n\n\"[It's] harassment like this that can lead women to eating disorders. I am one of the lucky ones who never suffered from it,\" McCain responded to the tweet on Tuesday \"I never dieted to get a man or a job and [somehow] landed my dream [for] both — hope young girls see me and know they don't have to diet either.\"\n\nIn September, McCain addressed body shaming on an episode of “The View,” in response to comedian Bill Maher defending fat-shaming.\n\n“Every day somebody on Twitter is like, ‘You’re too fat to be on ‘The View,’ blah blah blah. It’s so cruel,” McCain said at the time.\n\n“If I weren’t fat-shamed, I wouldn’t have a career. Laura Ingraham said I was ‘too plus-sized to be on TV,’” McCain shared. \"Shout out to Laura — I'm on ‘The View’ and you're not!\"\n\nRead more from Yahoo Lifestyle:\n\nFollow us on Instagram, Facebook, Twitter and Pinterest for nonstop inspiration delivered fresh to your feed, every day.", "description": "Meghan McCain, no stranger to being body shamed, called out a Twitter user, who was putting down McCain over her weight, on Tuesday.", "authors": ["Hope Schreiber"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ohQqNVf.FZ10nkhXzCO3AA--~B/aD0xNTY2O3c9MzM1MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://s.yimg.com/os/creatr-uploaded-images/2019-09/749e8c70-d8c7-11e9-a7fe-4d054dc85628", "published_at": "2019-10-01"}