{"pub": "metro", "url": "https://metro.co.uk/2019/10/22/caroline-flack-named-uks-dangerous-celebrity-10956997", "downloaded_at": "2019-10-22 13:33:13.953909+00:00", "title": "Caroline Flack named the UK’s most dangerous celebrity", "language": "en", "text": "Caroline Flack at the Brit Awards earlier this year (Photo by Mike Marsland/WireImage)\n\nSearching the internet for Love Island host Caroline Flack may be the most dangerous thing you do today.\n\nAccording to cybersecurity firm McAfee, Flack is the celebrity most likely to take you down an internet black hole and put you at risk of viruses and malware.\n\nEach year the firm evaluates which celebrities produce the most results that could lead to malicious sites – those that could contain links to computer viruses and other dangerous content.\n\nThe former Xtra Factor host topped the list ahead of Game of Thrones star Maisie Williams and James Corden. Reality star Kim Kardashian, who was top of the UK search list in 2018, has fallen to 26th place this year.\n\nThe UK top five was completed by musicians Nicki Minaj and Billie Eilish.\n\nFrozen star Josh Gad, actor Mischa Barton, singers Sam Smith and Dua Lipa and actor Liam Hemsworth made up the rest of the UK top ten.\n\nOnline scamsters will use celebrities to lure people in (Getty Images/iStockphoto)\n\nMcAfee chief scientist Raj Samani said: ‘Caroline Flack has cemented herself as one of TV’s most sought-after hosts. After another year of Love Island dominating headlines in the UK, I’m not surprised she has topped this years’ list.\n\nAdvertisement\n\nAdvertisement\n\n‘People want to keep up to date with the latest pop culture and celebrity news at any time from any device.\n\n‘Often consumers put that speed and convenience over security by clicking on suspicious links that promise content featuring our favourite celebrities.’\n\n‘Consumers need to think before they click to be sure that they are surfing to safe digital content and protecting themselves from cyber-security threats that may be used to infect their devices or steal their identity.’\n\nKim Kardashian topped the list last year (Photo by Alberto E. Rodriguez/Getty Images)\n\nThe cybser-security firm urged internet users to refrain from using illegal streaming sites, warning they are “riddled” with viruses disguised as video files.\n\nIt also encouraged parents to take advantage of parental control tools to help better patrol what their children can access online.", "description": "Searching for her online may bring unintended consequences", "authors": ["Jeff Parsons"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1130989504-e1571234849956_1571727774.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-22"}