{"pub": "cnn", "url": "https://us.cnn.com/2019/09/15/opinions/two-big-surprises-from-texas-opinion-weekly-column/index.html", "downloaded_at": "2019-09-22 07:15:21.394778+00:00", "title": "Two big surprises from Texas", "language": "en", "text": "Sign up to get our new weekly column as a newsletter. We're looking back at the strongest, smartest opinion takes of the week from CNN and other outlets.\n\n(CNN) It was a raw, visceral moment at last week's Democratic debate when Beto O'Rourke discussed the human toll of the massacre in his hometown of El Paso and vowed, \"Hell, yes, we're going to take your AR-15, your AK-47.\"\n\nIn remarks that were applauded by some of his rivals on stage in Houston and many other people, he added, \"We're not going to allow it to be used against our fellow Americans anymore.\"\n\nSizing up the performance of the 10 candidates, debate coachawarded O'Rourke an \"A\" for his \"powerful\" gun control argument: \"His genuineness was evident,\" wrote Graham.\n\nBut aswrote, the politics of taking away any variety of guns is complicated: \"Republicans have been warning for decades that Democrats will try to take weapons away from gun owners.\" Barack Obama and Hillary Clinton were among those who argued \"that they absolutely would not,\" but instead only sought to improve gun safety laws.\n\nOn the controversial idea of replacing all private health insurance with a government plan, advocates like Senator Elizabeth Warren insisted that voters will welcome the change: \"I've actually never met anybody who likes their health insurance company.\" (Polls suggest otherwise, as Harry Enten wrote .)\n\nLike O'Rourke, Warren may be walking a tightrope as she appeals to the progressive Democratic base while looking ahead to the possibility of a race against President Donald Trump, in which centrist voters may be key, and in which her debate remarks could be targets of opposition advertising.\n\nPaul Begala. \" \"For the first time, the socialists were on their heels and the moderates were on the attack,\" wrote. \" In the ABC debate, we finally had a vigorous, honest debate about Medicare for All. Gone were the disingenuous digs of prior debates ('You're repeating Republican talking points!') In their place was a substantive critique about cost, choice, and banning employer-provided health care.\"\n\nReady for Trump?\n\nFrida Ghitis was impressed. \" was impressed. \" The night was a win for the Democratic Party. That's because candidates repeatedly reminded viewers that despite their differences, the men and women jousting for the presidential nomination embrace views that align more closely with theirs.\"\n\nE.J. Dionne, writing in the Washington Post, noted, \"After spending the first half-hour of Thursday's debate tearing each other apart over health care — which happens to be their party's strongest issue — , writing in the Washington Post, noted, \"After spending the first half-hour of Thursday's debate tearing each other apart over health care — which happens to be their party's strongest issue — the Democratic presidential candidates realized that their opponent is President Trump and acted accordingly.\n\nDavid Gergen. \" But are they ready for that general election battle? There were moments for the Democrats to celebrate, wrote. \" But they are kidding themselves if they think any of the candidates is yet ready to slug it out with Trump ...it is still devilishly difficult to know how much their promises will cost and how they will be paid for by just taxing the rich. If they wait much longer to define their budget plans, they will find Republicans defining them for them — and it won't be pleasant.\"\n\nThe Castro moment\n\nSE Cupp was unequivocal about the remarks of another Texas candidate: \"Julián Castro just effectively ended his bid for President. Usually adept at navigating these debates and using his time to his advantage, tonight he looked petty, puerile and, well, like a jerk.\" She was referring to Castro badgering Biden during a discussion of health care (\"Are you forgetting what you said two minutes ago?\") The former HUD secretary denied afterward that he was trying to make an issue of Biden's memory and age, but Cupp was among many who saw it as exactly such a play:\n\n\"Attacking Biden -- more than once -- for 'forgetting' what he'd just said was a not subtle (and fairly dishonest) attempt at making Biden look feeble and out of it. Then, flatly declaring that, through their respective health care plans, he was carrying out Obama's legacy and Biden wasn't was an ugly, personal and unnecessary attack to make his point .\"\n\nBarack Obama, as it happened, fared much better in this debate than last time, when candidates questioned his policies.\n\nDavid Axelrod. \"The former vice president might well be overdoing it — but there is a lot of upside to touting his friend, the former president... In fact, Biden seemed more determined than ever to cling to Obama's popularity in the party, wrote CNN commentator and former Obama strategist. \"The former vice president might well be overdoing it — but there is a lot of upside to touting his friend, the former president... He knows that he will rise or fall with the president who brought him to the dance.\n\nEric Holder, wrote before the debate that the work of Obama and other Democratic presidents is Obama's attorney general,, wrote before the debate that the work of Obama and other Democratic presidents is one \"in which every Democrat should take pride — and upon which our next standard-bearer must campaign, rather than attack by accepting as real Republican talking points.\"\n\nJulian Zelizer commended Elizabeth Warren for a methodical strategy that has boosted her standing: \"Focusing on policy, focusing on her message, focusing on her life story, focusing on issue-based statements has Many credited Biden with an improved debate performance this time, but several of the other nine contenders also got high marks.commended Elizabeth Warren for a methodical strategy that has boosted her standing: \"Focusing on policy, focusing on her message, focusing on her life story, focusing on issue-based statements has allowed her to run a formidable campaign.\n\n'A better idea'\n\nDavid Perry. \"Still, Trump's announcement of a total ban on flavored e-cigarettes seems a little extreme. If he suddenly wants to think of the children and save American lives, After six people died and hundreds developed illnesses attributed to vaping, President Trump proposed banning flavored e-cigarettes. \"It's not a shock that a largely untested and unregulated industry based on inhaling various mysterious substances might have health consequences,\" wrote. \"Still, Trump's announcement of a total ban on flavored e-cigarettes seems a little extreme. If he suddenly wants to think of the children and save American lives, here's a better idea: enact meaningful gun regulations. \" For the first time last year, the number of deaths from gun violence exceeded that from auto accidents.\n\nDavid Michaels wrote that, the country's leading e-cigarette maker \"Juul denies targeting teenagers, and the company's approach to gaining market share follows the now Former assistant secretary of laborwrote that, the country's leading e-cigarette maker \"Juul denies targeting teenagers, and the company's approach to gaining market share follows the now time-honored Silicon Valley startup playbook: Break the rules and ask forgiveness after you've dominated the marke t. But now, after they've been caught and are in the asking-forgiveness phase, the company is under pressure to show evidence that e-cigarettes are less harmful than the traditional type.\" He called for the industry to fund research, but leave the control of those experiments to scientists.\n\nAlyssa Milano and Ted Cruz\n\nThe activist-actress and the conservative senator met, and agreed to disagree.\n\nAlyssa Milano after her chat with Ted Cruz: \" But it was worthwhile anyway, wroteafter her chat with Ted Cruz: \" He is a real person. He isn't a villain in a movie. He cares when these shootings happen. When people on my side of this fight say he doesn't, they're wrong. I hope he came away with the fact that we are caring people, and supporters of the Second Amendment, just not unlimited gun rights.\" Cruz thanked Milano via Twitter for a \"positive, civil & substantive discussion.\"\n\nExit John Bolton\n\n'Hung up' on a word\n\nSpeaker Nancy Pelosi called an abrupt end to her press conference Thursday, after saying reporters were \"hung up\" on the word \"impeachment.\" This followed the House Judiciary Committee's vote that day setting the rules of its impeachment investigation into President Donald Trump.\n\nThe committee said it will go beyond the bounds of special counsel Robert Mueller's report, but legal analyst Elie Honig offered a more far-reaching proposal: forget the Mueller report and concentrate on allegations that Trump has sought to enrich himself personally through the presidency.\n\n\"When I was a new Justice Department prosecutor preparing for one of my first trials, a supervisor gave me a valuable piece of strategic advice: Go for the jugular, not every capillary. Don't get bogged down trying to prove every detail of every last bad act or misdeed. Instead, pick out the subject's worst conduct, offer up your strongest proof and make it hit hard.\"\n\nIn Honig's view, the most damning evidence the House has against Trump is the question of whether he has violated the Constitution's \"emoluments\" clause: \"Just in the past few weeks, we have seen Trump stumping for, and receiving, official business at his private properties. Trump openly contemplated hosting the next G7 summit at his own property in Florida.\"\n\nElliot Williams wrote: the Trump administration has Such an investigation would be full of obstacles. Former Justice Department and Senate Judiciary Committee officialwrote: the Trump administration has \"an unprecedented level of contempt for Congress and its constitutional duty to oversee the executive branch.\"\n\n\"In a display of arrogance that would have been unheard of in any prior administration, the current administration has, on at least 30 occasions, refused or delayed turning documents over to Congress,\" wrote Williams.\n\nOther political takes:\n\nJackie Bray: The National Weather Service is standing strong against politics\n\nJohn Avlon: 9/11 unleashed destructive forces that we are still wrestling with\n\nJill Filipovic: Donald Trump craves Chrissy Teigen's approval\n\nMichael D'Antonio: Trump was orange before light bulbs became efficient\n\nFrida Ghitis: A President who threatens national security\n\nHuffman justice?\n\nJoey Jackson wrote that a judge was right to send actress Felicity Huffman to jail in the college admissions cheating scandal, but also that the short term of 14 days made complete sense: \"Huffman's conduct following the exposure of these crimes has exemplified grace, contrition, remorse and acceptance of responsibility. Legal analystwrote that a judge was right to send actress Felicity Huffman to jail in the college admissions cheating scandal, but also that the short term of 14 days made complete sense: \"Huffman's conduct following the exposure of these crimes has exemplified grace, contrition, remorse and acceptance of responsibility. Instead of making endless excuses, trying to justify her behavior, and directing blame at others, she has owned her actions. That matters .\"\n\nLooking more broadly, he wrote, \"This whole scandal demonstrates how people with money and privilege have nearly unlimited opportunities to perpetuate their family's high status. The rest of society has to play by the rules. Not everyone has the resources necessary to pay someone to take their children's SAT exam, or bribe a proctor to correct the test after it's taken. As such, the less privileged are forced to implore their children to work hard, get good grades, and do their best to stand out among their peers.\"\n\nDaniel Markovits traced the factors that power inequality in schools and universities: \" In TIME's Ideas section,traced the factors that power inequality in schools and universities: \" The elite invests unprecedented time and money in educating its children . Rich parents pay for art, music, and sports lessons, hire tutors and, critically, send their children to schools that spend many times more on educating their students than middle-class schools...\" Opening the doors wider will take a lot of work, he notes.\n\nDon't miss:\n\nSam Teicher and Joe Oliver: The spirit of the Bahamian people shines in the face of Dorian and\n\nTara Murtha: The Highwomen are revolutionizing country music\n\nMichael Bociurkiw: Hong Kong is having a leadership crisis\n\nJaved Ali and Marcella Huber: The US needs to act now against the next terrorist incubator and\n\nPeggy Drexler: Bullied Florida boy's story is complicated\n\nAND:\n\nJane Bond?\n\nPierce Brosnan, who played James Bond in four films, said it's about time the character of the British secret agent was re-conceived as a woman.\n\nThat's the last thing we need, wrote Holly Thomas: Sure, \"women are every bit as capable of playing seductive alcoholics with gambling issues as men are, and it would be wonderful to see how a female star made the part her own.\"\n\nThomas noted that the female heroes who already exist are commercial successes: Take Gal Gadot in \"Wonder Woman\" or Jodie Comer and Sandra Oh in \"Killing Eve.\"\n\n\"One of the loveliest things about Gal Gadot's portrayal of Wonder Woman was that it didn't inhabit the traditional male template for a comic book hero. Rather than 'beat the guys at their game,' she played it on her own terms. She was tender and vulnerable, and her willingness to bring softness to the role -- cooing at a baby, gasping at the flavor of ice cream -- made the character multifaceted, and no less convincing a warrior.\"", "description": "CNN Opinion commentators weighed in on Beto O'Rourke and Julian Castro's performance in the Democratic presidential debate, vaping, John Bolton's departure, Felicity Huffman's sentence and the prospect of a female James Bond.", "authors": ["Opinion Richard Galant"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190912230227-beto-orourke-abc-democratic-debate-super-tease.jpg", "published_at": "2019-09-15"}