{"pub": "npr", "url": "https://npr.org/2019/10/14/769927362/trumps-former-russia-adviser-set-to-testify-as-part-of-impeachment-inquiry", "downloaded_at": "2019-10-14 11:28:11.586868+00:00", "title": "Trump's Former Russia Adviser Set To Testify As Part of Impeachment Inquiry", "language": "en", "text": "Trump's Former Russia Adviser Set To Testify As Part of Impeachment Inquiry\n\nEnlarge this image toggle caption Evan Vucci/AP Evan Vucci/AP\n\nHouse investigators are scheduled Monday to hear from Fiona Hill, the former White House adviser on Russia, who is expected to appear in private and face questions as part of Democrats' impeachment inquiry into President Donald Trump.\n\nHill, 53, a British-born American foreign affairs expert, resigned as Trump's top Russia analyst just days before the president's controversial July 25 call with Volodymyr Zelensky, the president of Ukraine, an exchange that sparked the impeachment inquiry now consuming three House committees.\n\nHill, who declined to elaborate on her planned testimony, is expected to discuss concerns she raised over the ouster of longtime diplomat Marie Yovanovitch, whose removal as the ambassador of Ukraine has become as a key topic in the impeachment inquiry. She is also likely to speak about how, in her view, Rudy Giuliani, the president's personal lawyer, and Gordon Sondland, the U.S. ambassador to the European Union, were operating a Ukraine policy outside of the National Security Council.\n\n\"She will certainly explain that the channel that was apparently open by Ambassador Sondland and Rudy Giuliani, these were things that were going on outside the purview of the National Security Council,\" said Angela Stent, the director of the Center for Eurasian, Russian and East European Studies at Georgetown University.\n\nYavonovitch on Friday gave nearly nine hours of testimony on Capitol Hill behind closed doors. She reportedly told lawmakers that Trump pressured the U.S. State Department to remove her from her post following months of criticism directed at her in the conservative media. The career foreign service officer served more than 30 years in the State Department across six administrations.\n\nBut Trump lost faith in her. According to the summary of the call released by the White House, Trump urged Zelensky to investigate former Vice President Joe Biden and his son Hunter's activities in Ukraine. During that call, Trump called Yovanovitch \"bad news.\" Democrats are investigating whether Trump linked Zelensky's compliance of his request with the release of previously approved military assistance to Ukraine. Trump denies there was a link.\n\nLast week, two Florida businessmen who assisted Giuliani in the quest to look into the Bidens' activity in Ukraine were arrested on federal campaign finance violations unrelated to the impeachment inquiry.\n\nProsecutors in charging documents say the two men were working to remove Yavonovitch \"at the request of one or more Ukrainian government officials.\" That campaign to recall the envoy troubled Hill, who is expected to tell House investigators that she openly questioned the decision to recall the seasoned foreign service official.\n\nHill generally supported Trump's attempts of engaging with Russia, but she did not do so without reproach. A staunch critic of Vladimir Putin, Hill wrote in a Vox piece just months before her appointment to the National Security Council that the Russian president excels at probing \"people's vulnerabilities.\" \"In other words, blackmail and intimidation are part of his stock in trade.\"\n\nAt the time she wrote that, Hill was a senior fellow at the Brookings Institution, a Washington think tank. While she has been critical of Putin, she has also disapproved of other Russian leaders, saying her perspective is informed by decades of studying the politics and culture of the country, not a political agenda.\n\nHill had a working-class upbringing in northern England, growing up among a family of coal miners. She rose to become a scholar of Russian history, earning a doctorate from Harvard before joining the National Intelligence Council as a national intelligence officer for Russia.\n\nWhen Hill took the White House job, it shocked national security insiders, since she was considered far from a Trump lackey, according to a profile of Hill in Politico last month.\n\n\"Hill's departure has left a gaping hole in expertise at the White House, at a moment when Russia's ongoing efforts to interfere in the 2020 election require a whole-of-government response,\" Politico reported, citing current and former intelligence officials and other experts.\n\nOther witnesses are expected to be summoned to Capitol Hill in connection with the impeachment inquiry this week, including Sondland, the U.S. ambassador to the EU, who is scheduled for a deposition on Thursday.\n\nTrump, meanwhile, continued to defend the call that triggered a whistleblower complaint as \"absolutely perfect,\" refusing to comply with the inquiry and imploring witnesses not to show up for questions.\n\nNPR's Michele Kelemen contributed to this report.", "description": "Fiona Hill, a British-born American foreign affairs expert, resigned as the president's top Russia analyst just days before the president's controversial call with his Ukrainian counterpart.", "authors": [], "top_image": "https://media.npr.org/assets/img/2019/10/13/ap_19092701508930_wide-51b7b174e0121f77e9a648e7ddd739790c094885.jpg?s=1400", "published_at": "2019-10-14"}