{"pub": "foxnews", "url": "https://foxnews.com/entertainment/aaron-carter-sold-firearm-surrendering-some-to-police", "downloaded_at": "2019-09-26 01:34:17.659585+00:00", "title": "Aaron Carter says he’s getting treatment, sold his firearms", "language": "en", "text": "Aaron Carter says he is undergoing treatment and has sold his firearms.\n\nDays after two of his siblings announced they were seeking a restraining order against him, the singer told TMZ on Wednesday that he no longer owns any firearms and has been working with health professionals to wean off medications.\n\n\"I sold all of my guns yesterday,\" Carter told the gossip site while showing the cameraman the sales records. But when he was asked if he will buy any firearms in the future, he replied: \"That's no one's business.\"\n\nAARON CARTER ALLEGES LATE SISTER LESLIE SEXUALLY ABUSED HIM, SURRENDERS 2 FIREARMS AMID FEUD WITH BROTHER NICK\n\nThe 31-year-old star also told TMZ he doesn't \"want to talk about my family anymore\" and that he hasn't taken any Xanax for five days. He also claimed he has a \"lot of TV shows coming up at me right now.\"\n\nThe L.A. County Sheriff's Office told Fox News last week that Aaron surrendered two of his firearms to their officers.\n\nAARON CARTER SAYS BROTHER NICK'S RESTRAINING ORDER WAS RETALIATION FOR SIDING WITH ALLEGED SEXUAL ASSAULT VICTIMS\n\nCarter and his twin sister, Angel, 31, and older brother, Nick Carter, 39, have been engaged in an ongoing feud. Angel and Nick called Aaron's claim that their late sister, Leslie, sexually abused him when he was underage \"completely false\" and \"fabricated.\"\n\n\"Nick and his sister Angel have been trying to get Aaron the help he needs, and sought protective orders against Aaron because he is not well and they are concerned for the safety of themselves and their family,” Angel and Nick's lawyer Michael D. Holtz told us last week in a statement.\n\nCarter previously posted a video to Instagram in which he showed that he purchased guns legally and was a supporter of the Second Amendment.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“I finally got my gun license! I fully support the constitution and my right to bear arms,” he wrote in the post’s caption. “My father was a military policeman for 21 years and I’m inheriting over 500 curio relic firearms from 3 generations on my fathers side.”", "description": "Aaron Carter said he is undergoing treatment and has sold his firearms days after two of his siblings announced they were seeking a restraining order against him.", "authors": ["Tyler Mccarthy"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/03/Aaron-Carter-getty.jpg", "published_at": "2019-09-25"}