{"pub": "news24", "url": "https://fin24.com/Companies/TravelAndLeisure/kululacom-partners-with-sabre-to-reinvent-airport-experience-20190910", "downloaded_at": "2019-10-18 01:14:14.705746+00:00", "title": "kulula.com partners with Sabre to 'reinvent' airport experience", "language": "en", "text": "kulula.com says in a statement it is \"reinventing\" the airport experience with the implementation of Sabre's new Digital Workspace solution.\n\n\n\nIt equips agents with workflows that eliminate the traditional linear check-in procedure and improve agent productivity by up to 30% compared to current processes.\n\n\n\n\n\nDigital Workspace is part of Sabre's Commercial Platform that delivers end-to-end personalised retailing. The new technology will be rolled out across all the airports that kulula.com serves, assisting more than 1 200 agents.\n\n\n\n\"In today's digital world, our customers expect a reimagined air travel experience, and Sabre's digital technology will help us achieve our goal of becoming the most visionary and customer-centric carriers on the African continent,\" says Wrenelle Stander, joint CEO of Comair, which operates kulula.com.\n\n\"With Sabre's Digital Workspace, we will transform the airport experience to be more seamless, more personalised and less stressful – moving us a step closer to a fully digital integrated operation.\"\n\nAccording to Sabre's Dino Gelmetti, vice president of sales for the Middle East and Africa, today's digitally-savvy travellers are expecting a more seamless experience from their airlines.\n\n\"Passing through the airport is traditionally one of the most stressful aspects of travel, so reducing queuing times and check points will make a huge difference for kulula.com’s customers,\" comments Gelmetti.", "description": "kulula.com says it is \"reinventing\" the airport experience with the implementation of Sabre's new Digital Workspace solution.", "authors": ["Compiled Carin Smith"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/2592/d4773c9142064c15a7c5c03abdea9497.jpg", "published_at": "2019-09-10"}