{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/books/2019/10/15/steph-cha-interrogates-la-racial-tensions-your-house-pay-review/3947738002", "downloaded_at": "2019-10-15 15:11:20.166743+00:00", "title": "Steph Cha smartly interrogates LA racial tensions in page-turner 'Your House Will Pay'", "language": "en", "text": "CLOSE\n\n\"Your House Will Pay,\" by Steph Cha. (Photo: Ecco)\n\nThe racial tensions in LA that exploded into violence in the early 1990s following the Rodney King verdict haven’t gone away. Yet they’re often perceived as history – a thing that happened, the stuff of documentaries. Steph Cha, in her impassioned debut thriller, “Your House Will Pay” (Ecco, 320 pp., ★★★ out of four stars), wants to blow the dust off that moment and make clear that yesterday’s divides still haven’t been fully reckoned with.\n\nTo make that case, Cha assuredly braids the stories of two families. Shawn, whose teenage sister Ava was fatally shot by a shop owner in 1991, has become the default patriarch of a clan determined to keep Ava’s memory alive. Grace, the daughter of the shooter – though she was kept in the dark about that fact for decades – has been untouched by the incident.\n\n“She had let herself luxuriate in apathy, her world separate from the real world,” Cha writes.\n\nThe real world violently intrudes when Grace’s mother is shot, and Shawn’s cousin, recently released from prison, becomes the lead suspect. Shawn’s family is black, while Grace’s is Korean, and the shooting resurfaces a volatile, often stereotype-driven dynamic between the two communities. Grace’s activist sister attempts to explain all this, but Grace rolls her eyes and dismisses the history lesson.\n\n“It’s not history, Grace,” Miriam retorts. “It’s–”\n\nMore: Ronan Farrow says NBC’s alleged cover-up of sexual misconduct is ‘bigger’ than Matt Lauer\n\nThe sentence cuts off. It’s – what? The strength of Cha’s novel isn’t just that she understands that the problem doesn’t reduce so simply. It’s how well she inhabits the multiple communities involved, each wearing their own sets of blinkers. The media either lapses into melodrama and oversimplification (via the white journalist who wrote a book on Ava’s death) or stokes bigotry (via the right-wing meme factory that catches Grace in an impolitic moment). Shawn’s family’s urge to keep Ava’s story alive has helped fuel an attitude of grievance and retribution; Grace’s family’s determination to avoid the past only leads to stubborn, festering ignorance.\n\n“The spilled poisons of the grown-up world” don’t just trickle down to the sons and daughters of the participants, Cha suggests. They infect the institutions that are supposedly there to clean up, including the police and criminal-justice system.\n\n“Last thing we need is for people to be thinking about the early nineties,” a detective says, but the evidence suggests nobody has ever been thinking about it enough.\n\nAuthor Steph Cha. (Photo: Maria Kanevskaya)\n\nCha has taken care not to write a cynical book; indeed, she dives so deep into her characters because she believes that communicating their nuances across racial lines is essential to heal the wound. But the novel’s fiery conclusion emphasizes how difficult that work will be.\n\n“Your House Will Pay” is based on a 1991 incident in which a 15-year-old black girl was killed by a Korean shop owner over a petty misunderstanding. Cha grasps the symbolic power of that story, the way it clarifies so many American social challenges. “Where was the new city?” she asks in the novel’s closing moments. “And who were the good men?”\n\nCha’s novel is both a page-turner and a prompt to confront those questions.\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/books/2019/10/15/steph-cha-interrogates-la-racial-tensions-your-house-pay-review/3947738002/", "description": "Steph Cha’s breakout novel \"Your House Will Pay\" is a smart page-turner that confronts the lingering racial tensions of 1990s LA.", "authors": ["Mark Athitakis", "Special For Usa Today", "John Sandford", "Rachel Maddow", "Delia Owens", "Stephen King", "Ta-Nehisi Coates", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/03/USAT/491a6371-7c8e-4413-86cf-6455ceefac2f-Your_House_Will_Pay.jpg?crop=428,241,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-15"}