{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/12/WS5da132b2a310cf3e3557010a.html", "downloaded_at": "2019-10-12 02:10:30.105332+00:00", "title": "Chennai, Fujian ties date way back to Tang Dynasty", "language": "en", "text": "By CAO DESHENG in Chennai, India | China Daily | Updated: 2019-10-12 09:56\n\nPeople wave Chinese and Indian flags to welcome President Xi Jinping and Indian Prime Minister Narendra Modi's second informal summit on Friday in Chennai, India. [Photo by XU JINGXING/CHINA DAILY]\n\nWhen President Xi Jinping and Indian Prime Minister Narendra Modi began their second informal summit on Friday in India, the seaside temple town of Mamallapuram they visited was a reminder of the ancient links between the two neighboring countries.\n\nAt the old seaport town near Chennai, capital of the southern Indian state of Tamil Nadu, Modi took the Chinese leader to several temples and monuments built during the Pallava dynasty in the 7th and 8th centuries along the Coromandel coast on the first day of their two-day informal summit.\n\nThough the Indian authorities did not highlight why the meeting venue was selected, analysts have said that New Delhi wants to revive the stories of centuries-old trade and cultural links between China and India to boost bilateral ties amid some thorny issues in their relations as well as the changing regional and global situation.\n\nWhen the two leaders gaze out to sea, they will be greeted by the same expanse of waters of the Indo-Pacific that once united, not divided, India and China, said Sujan R. Chinoy, a China specialist and director-general of the New Delhi-based Institute for Defense Studies and Analyses.\n\n\"At Mamallapuram, the cool sea breezes, the palm fronds and the ancient temples and monuments will provide a perfect setting for the two leaders to muse over our timeless ties and their future,\" Chinoy said.\n\nA UNESCO World Heritage site, Mamallapuram was a major center for cultural and religious exchanges between the two countries in ancient times. Several Chinese Buddhist scholars and pilgrims undertook journeys to India with the most famous being Xuan Zang during the Tang Dynasty (618-907), who traveled to Mamallapuram and described the trip in his journals in the 7th century.\n\nThe choice of Chennai as the meeting venue demonstrates the two leaders' efforts to enhance bilateral cultural exchanges, said Li Qingyan, a South Asian studies scholar at the China Institute of International Studies.\n\nCultural and people-to-people exchanges are getting a boost from Xi and Modi as both governments have established a mechanism for high-level exchanges between the two cultures, particularly among the youth.\n\nThere is also evidence that trade links existed almost 1,400 years ago between Fujian province, where Xi worked in various government posts between 1985 and 2002, and Tamil Nadu. Archaeological discoveries in Quanzhou, Fujian, have proved that Tamil sea traders had made Quanzhou an important port of call.\n\nChoosing Chennai as the meeting venue also highlights the leaders' willingness to strengthen bilateral trade and economic cooperation, Li said, adding that the current economic slowdown in India will require more investment to stimulate its domestic economy.\n\nNicknamed \"the Detroit of India\", Chennai boasts more than one-third of India's automobile industry. Home to the Tamil film industry, it is a major movie production center in India. Software development, electronics manufacturing and financial services also make up much of the city's economy.\n\nExperts said the choice of Chennai as a venue highlights the scope of the India-China economic partnership across India as there is much untapped potential for Chinese investment in the South Asian country.", "description": "When President Xi Jinping and Indian Prime Minister Narendra Modi began their second informal summit on Friday in India, the seaside temple town of Mamallapuram they visited was a reminder of the ancient links between the two neighboring countries.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/12/5da132b2a310cf3e97a0d180.jpeg", "published_at": "2019-10-12"}