{"pub": "news24", "url": "https://news24.com/World/News/seems-like-a-fun-guy-russian-president-putin-gathers-mushrooms-during-birthday-celebrations-20191007", "downloaded_at": "2019-10-07 12:20:07.189353+00:00", "title": "Seems like a 'fun guy': Russian president Putin gathers mushrooms during birthday celebrations", "language": "en", "text": "Russian President Vladimir Putin shows mushrooms to defence minister Sergei Shoigu during his vacation in the remote Tuva region in southern Siberia. (August 1-3, 2017) (Alexey Nikolsky/Sputnik/AFP)\n\nMoscow – Russian President Vladimir Putin is renowned for posing for high-octane photo opportunities like tiger-tracking or deepwater diving.\n\nBut in images released to celebrate his birthday on Monday, the long-term leader was seen enjoying some of Russia's more peaceful wildlife. Putin, who has turned 67, spent a mini break in mountains above the Yenisei River in Siberia over the weekend, foraging for wild mushrooms with his defence minister Sergei Shoigu.\n\nIn video footage released by the Kremlin, Putin and Shoigu were shown picking and sniffing mushrooms. The president was walking in an area of natural beauty in southern Siberia. Sounding breathless, he said: \"We have climbed up above the clouds,\" at a height of almost 2 000 metres above sea level.\n\nPutin took the wheel of an all-terrain vehicle through the forest and the pair also hitched a helicopter ride. In previous action-man escapades, Putin has tagged a beluga whale and flown with migrating cranes in a microlight.\n\nWhile boasting of his love for wildlife and eschewing hunting, unlike many Russian officials, Putin backs drilling for oil in the pristine Arctic and has cast doubt on global warming.\n\nAs a nation, Russians are devotees of the \"quiet hunt\" for mushrooms, which are now in season. The pursuit is celebrated in Russian literature, including Leo Tolstoy's classic, Anna Karenina.\n\nVladimir Putin spent weekend on eve of his birthday in the Siberian taiga, where he admired the autumn nature\n\n\n\nHe walked in the mountains & gathered mushrooms in the forest\n\n\n\nJoined by head of state, Sergey Shoigu\n\n\n\nOctober 7th, President Putin is 67 pic.twitter.com/CWqHRqiGiA — ??? Martin ???‍?? ??? (@KlatuBaradaNiko) October 7, 2019\n\nRussian President Vladimir Putin enjoys a getaway in Siberia in the company of Defense Minister Sergei Shoigu. The Russian leader was seen hiking in the mountains and mushroom hunting #Putin #Siberia #Russia pic.twitter.com/DrA8jvGker — Sputnik Insight (@Sputnik_Insight) October 7, 2019", "description": "Russian President Vladimir Putin is renowned for posing for high-octane photo opportunities, but in recently released images he is seen enjoying some of Russia's more peaceful wildlife.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7899/5a3090fe8d15436bb452bd7382989cce.jpg", "published_at": "2019-10-07"}