{"pub": "dailymail", "url": "https://thisismoney.co.uk/money/smallbusiness/article-7584603/Could-comparison-website-Cosmetify-disrupt-beauty-market.html", "downloaded_at": "2019-10-22 13:25:09.292857+00:00", "title": "Could comparison website Cosmetify disrupt the beauty market?", "language": "en", "text": "Matt Davies is the founder of Cosmetify. He backed the business with his own money after selling his majority stake in a travel company to a private equity firm\n\nWhen it comes to beauty products, many shoppers prefer to test them to make sure they're getting the right brand for their complexion.\n\nBut the founder of an online beauty price comparison website believes people are changing their shopping habits when it comes to cosmetics and fragrances.\n\nEntrepreneur Matt Davies is hoping to disrupt the beauty industry with Cosmetify - an aggregator that currently features more than 200,000 products from more than 1,500 of the world's leading beauty brands.\n\nDavies believes shoppers will increasingly push aside their concerns about buying these types of products online due, in part, to the rise of social media, user generated content, reviews and influencers.\n\nHe says: 'The high street is generally in decline and if things carry on as they do now, it will slowly but surely disappear.\n\n'With things like make-up if you haven't used it before you may want to try it first. But there's a lot of change and with the culture and the amount of things that get shared and reviewed that should give people more confidence.'\n\nDiscounts and deals\n\nThere are a range of products offered on Cosmetify, but the company takes care to enlighten consumers.\n\nDavies explains: 'We offer transparent and impartial information, from delivery costs and product availability to what ingredients are used to make products.\n\n'With a vast product range, from eye shadow palettes and aftershave to shampoos and hair dryers, there's something for everyone.'\n\nShoppers will likely be drawn by the discounts offered by the site as well with average cost savings of 34 per cent and up to 95 per cent off selected products.\n\nCould Cosmetify's deals persuade more people to shop for cosmetics online and forsake the high street?\n\nPremium brands featured on the site include Nars, Charlotte Tilbury, The Ordinary and Pixi.\n\nDavies explains that the business chooses all the websites that feature on the site and strikes up commercial arrangements with them on a commission basis.\n\nHe assures that companies that offer his business the most commission aren't featured ahead of others' offerings.\n\n'Everybody pays different fees for their services but we order everything by best price – that's the only thing that matters to us.\n\n'We choose the cheapest one. We list everything, it's very transparent and includes delivery fees if there are any.'\n\nOnce buyers click on a product they're redirected to the Cosmetify's partners, which include feelunique.com, beautyexpert.com, fragrancedirec.com and lookfantastic.com among others.\n\nSome products featured on Cosmetify are discounted by as much as 95% with free delivery\n\nDavies agrees that consumers may feel unfamiliar with sites like these if they typically shop at Boots and Superdrug but assures they're all reliable partners.\n\n'These are very big reputable companies with good reviews and reputations that generally have a bigger product range than the usual companies like Boots.'\n\nHe says that partners have to jump through a few hoops before being featured on Cosmetify.\n\nHe adds: 'We also look at audited accounts. To get on our site they have to be involved in third party affiliate platform. We don't just pick anyone.\n\n'We make sure they are OK and if people complain then we will take them off.'\n\nCosmetify has struck deals with a number of partners whose products feature on the site. Some products advertised come from well-known brands\n\nPrice and product information is updated automatically but if a product isn't available or if a customer wants to be alerted when the product's on special they can create an alert on their account which will send them a notification.\n\nSeasonal specials are a frequently promoted on the website.\n\nDavies explains: 'Halloween is big in the sector. It's the focus at the moment. We've got Black Friday deals - there's a lot of things going before Christmas. Beauty advent calendars are also big.'\n\nMaking up plans\n\nThe ambition with Cosmetify is to create the largest catalogue of beauty products.\n\nDavies also wants to expand the business beyond the UK. 'We're UK focused site at the moment, but a lot of the retailers we use deliver overseas.\n\n'Delivery costs change if it's outside of the UK. We'll move it [Cosmetify] to other English language countries first and all the systems are built with that in mind as well.'\n\nBefore embarking on creating Cosmetify, which currently employs 15 people, Davies had constructed and managed a global travel business called Direct Ferries, which enables customers to compare ferry tickets.\n\nShoppers can get deals on cosmetics averaging a 34% discount\n\nHe sold his majority stake in the business two years ago for an undisclosed sum to private equity firm, Living Bridge.\n\nHe's used this money to start Cosmetify. While the business is self-funded, he's not ruling out any backing from outside the business.\n\nHe says: 'We've had a lot of contact from outside parties and I wouldn't rule out external investments. But happy with the way it's currently going.'\n\nAsked how he'd develop the business further if there was a stream of investment that came in he says: 'We've got clear plans, we want to have more retailers, create an app and make the website more user friendly. We would accelerate what we're doing.'\n\nDavies finds it hard to give advice to others intending to go down the entrepreneurship path as he's mainly worked for himself, managing his own businesses.\n\nBut when pressed on how he'd advise other would-be business owners he says: 'You have to have a good plan in place on how you going to spend money and when you will spend it.\n\n'Make sure you don't overspend in certain areas you don't need to.\n\n'I used to work in a massive office so when I set up an office for this business I should've gone for a shack somewhere that didn't cost a lot, but it's what I'm used to. It's always best to be prudent.'", "description": "When it comes to beauty products shoppers prefer to test them before you buy. But one entrepreneur wants to change all that with his beauty product comparison website", "authors": ["Angelique Ruzicka For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/08/19794032-0-image-a-7_1571729993662.jpg", "published_at": "2019-10-22"}