{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/myanmar-jails-21-rohingya-detains-children-travel-191011000857911.html", "downloaded_at": "2019-10-11 02:26:55.213598+00:00", "title": "Myanmar jails 21 Rohingya, detains children, for trying to travel", "language": "en", "text": "Yangon, Myanmar - A five-year-old child is among 30 Rohingya who have been detained in Myanmar for attempting to travel to the main city of Yangon from western Rakhine state, where they were among hundreds of thousands confined to squalid camps in a system some rights groups have compared to apartheid.\n\nTwenty-one adults from the group were last week jailed for two years under a law that bars using false identity cards after a one-day trial in which they were reportedly denied a lawyer, Human Rights Watch said.\n\n\n\nEight of the children have been sent to a “training school” in Yangon region while authorities say they are still deciding what to do with the five-year-old.\n\n“These 30 men, women, and children are being punished for simply seeking an escape from the daily brutality they’ve been subjected to for years,” said Brad Adams, Human Rights Watch’s Asia director.\n\n\n\nThe Rohingya, who are mostly Muslim, are frequently arrested for attempting to leave Rakhine state, where tens of thousands have been living in camps since fleeing their homes after communal riots in 2012.\n\n\n\nThose in villages outside also face severe restrictions on leaving their townships while their mostly Buddhist Rakhine neighbours are allowed to move more freely.\n\nA check point outside a refugee camp in Sittwe in the state of Rakhine. [Soe Zeya Tun/Reuters]\n\nImpossible to leave\n\nAn estimated 600,000 Rohingya remain in Rakhine state after military-led mass killings, arson and rape in late 2017 drove more than half their population across the border into Bangladesh.\n\n\n\nUnited Nations investigators have called for Myanmar’s top generals to be prosecuted for genocide over the campaign. The military, supported by the government of Nobel Peace Prize winner and former dissident Aung San Suu Kyi, says its attacks were legitimate counterinsurgency operations against an armed Rohingya group it calls terrorists.\n\n\n\nThe Rohingya have been systematically stripped of their citizenship, freedom of movement, voting rights and access to education, jobs and healthcare over the past few decades in what they say is part of a coordinated attempt to destroy them.\n\nThe 30 Rohingya were detained late last month for travelling without permits after taking a boat down the coast to the southern region of Irrawaddy. They were planning to seek work in Yangon or try to travel onwards to Malaysia, local media reported.\n\n\n\nTwo drivers have also been arrested while a third is on the run, police Major Tun Shwe told the Irrawaddy news website.\n\nSaed, who lives in the camps in Sittwe and asked to be referred to by one name, described a Kafkaesque process that Rohingya must go through in order to apply for permits to leave Rakhine state.\n\n\n\n“If I want to go to Yangon I have to ask for travel authorisation from the immigration office,” he told Al Jazeera. That involves submitting various documents and proofs of identification, including a letter from the administrator of the applicant’s village, he said.\n\n\n\nThey must also give authorities the address where they plan to stay and the name of the head of the household, who has to sign a form taking responsibility for the visitor and promising they will return to Rakhine state within 45 days, he added.\n\nRohingya have often turned to smugglers to escape Rakhine and Myanmar. The UN refugee agency says people are still risking dangerous sea journeys to find safety. [Aubrey Belford/Reuters]\n\nHealth crisis\n\nThe process is costly, not least because it involves paying bribes, and takes more than a month, meaning Rohingya seeking to leave Rakhine usually have no choice but to do so illegally often relying on smugglers who charge extortionate rates.\n\n\n\nMany die because they are unable to travel to hospitals for urgent medical care because of the restrictions, deepening an already severe healthcare crisis.\n\nWe have been treated like illegal immigrants for the past 27 years Nay San Lwin, Rohingya activist\n\n\n\nOne of Saed’s friends is serving an eight-year prison sentence after attempting to travel to Yangon last year, he said. Authorities charged the friend as a trafficker simply because he spoke Myanmar, while the rest of the group he was caught with only spoke Rohingya, Saed said.\n\n\n\n“They never arrest the real traffickers,” he added.\n\n\n\nNay San Lwin, a Rohingya who grew up in Rakhine and is now an activist based in Germany, said the government started to bring in the travel restrictions from the early 1990s.\n\n\n\n“We didn’t need to be smuggled into Yangon in the past,” he said. “We didn’t have any problems getting air tickets to fly to Yangon. We were once regarded as full citizens and an official ethnic group, but we have been treated like illegal immigrants for the past 27 years,” he said.\n\n\n\nLarge numbers of Rohingya have also fled Rakhine state on dangerous sea voyages, where those who avoid drowning risk capture by naval forces in Myanmar or other countries in the region.", "description": "Rights groups say group is being punished for trying to escape dismal camps amid severe restrictions on everyday life.", "authors": ["Joshua Carroll"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/11/4271813072a34785ba8e896c66a4d7da_18.jpg", "published_at": "2019-10-11"}