{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/9/flying-green-flying-proud", "downloaded_at": "2019-09-10 02:21:37.938648+00:00", "title": "Flying green, flying proud", "language": "en", "text": "ANALYSIS/OPINION:\n\nAmericans are flying more than ever before, with a record number of people projected to travel with U.S. airlines this year. Many of those passengers know that our fares have never been lower. But what they probably don’t know is that our planes have never been greener.\n\nThe U.S. airlines are committed to controlling our carbon footprint, and we’re doing it by buying more fuel-efficient planes and flying them in more efficient ways, by developing and using sustainable alternative jet fuels, and by contributing to carbon-offsetting programs that remove CO2 from the air.\n\nEnvironmental extremists in Europe are trying to “flight shame” air travelers everywhere into flying less, but their misguided message flies in the face of the facts. And the fact is that worldwide commercial aviation is responsible for just 2 percent of global greenhouse gas emissions. That’s right: 2 percent. And while our carbon emissions are minimal, our contribution to the global economy is tremendous: U.S. passenger and cargo airlines drive more than 10 million U.S. jobs and $1.5 trillion in annual U.S. economic activity, directly employing more than 700,000 workers across the globe. Every day, our planes carry some 2.4 million passengers and 58,000 tons of cargo across the country and to 80 other countries. We safely connect friends and family members and enable business meetings and overnight deliveries of everything from fresh-cut flowers to medical supplies.\n\nEven as our airlines fly more people and packages to more destinations every year, we are growing greener every day. In fact, U.S. airlines carried 42 percent more passengers and cargo in 2018 than we did in 2000 with just a 3 percent increase in total CO2 emissions. That’s a remarkable record of sustainability and we’re not stopping there. The “flight shamers” won’t tell you this, but the airline industry is the only one in the world to voluntarily commit to an agreement to reduce and offset carbon emissions. That agreement, the Carbon Offsetting and Reduction Scheme for International Aviation or “CORSIA,” calls for carbon-neutral growth in international commercial aviation beginning in 2021. And what’s more, the world’s airlines, including ours, have a set a goal of reducing net CO2 emissions by 50 percent in 2050 as compared with 2005 levels. That’s right: 50 percent.\n\nThe U.S. airlines are fighting climate change, driving advances in airframe and aircraft engine technology, sustainable aviation fuels, aviation infrastructure and operations to ensure we meet our emissions targets. That’s not just good for the earth — it’s good for business, too. Extreme weather caused by climate change can ground planes and play havoc with our flight schedules, so the fewer severe storms there are, the better it is for us and the passengers and cargo we carry. And jet fuel is our largest and most volatile cost by far, so the more fuel-efficient our fleets are, the better it is for both the air and our bottom line.\n\nHere’s another fact you won’t hear from the “flight shamers”: Between 1978 and 2018, the U.S. airlines improved our fuel efficiency by more than 130 percent, saving nearly 5 billion metric tons of CO2. That’s like taking 26 million cars off the road every year. And speaking of cars, while U.S. carriers account for less than 2 percent of the nation’s greenhouse gas emissions, passenger vehicles account for more than 17 percent.\n\nSimply put, the airline industry is the backbone of the global economy and a leader in the fight against climate change. That’s not a record to be ashamed of — it’s one to be proud of. So the next time you board one of our fuel-efficient planes, sit back, enjoy the flight, and fly with the pride that comes from knowing that you’re traveling with a green industry that’s only getting greener.\n\nNancy Young is Vice President, Environmental Affairs for Airlines for America.\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Americans are flying more than ever before, with a record number of people projected to travel with U.S. airlines this year. Many of those passengers know that our fares have never been lower. But what they probably don't know is that our planes have never been greener.", "authors": ["The Washington Times Http", "Nancy Young"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/09/9_9_2019_airplane-young-edit8201_c0-25-2700-1599_s1770x1032.jpg?e55a790f52906d301fd80f5358f6890e8bdf6a2f", "published_at": "2019-09-09"}