{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/22/uber-india-2", "downloaded_at": "2019-10-22 13:20:17.380471+00:00", "title": "Dara Khosrowshahi says Uber remains committed to India but offers no concrete plans – TechCrunch", "language": "en", "text": "Uber said on Tuesday that it has won a bid to work with government-run subway system in India’s capital in one of its rare announcements in India, a key overseas market where it is facing a fierce battle with local giant Ola.\n\nThe ride-hailing giant said it has partnered with Delhi Metro Rail Corporation (DMRC) to deploy parking spots and introduce new products at 210 subway stations in Delhi, Gurgaon, and Noida. Neither of the parties offered a clarification on how many years it would take for these deployments to materialize. A DMRC executive said Uber was not an exclusive partner for the subway system.\n\nThe company said it is also rolling out a software update to its app to include real-time public transportation options in the Uber app. It’s the same feature — which is limited to offering details such as navigation data and pricing but do not include the ability to book a ride — that Uber unveiled recently as it attempts to become “an operating system” for all transportation needs.\n\nBut the company, which has visibly scaled down some of its businesses in India in past one year, had nothing more concrete to say. CEO Dara Khosrowshahi said onstage that Uber was “here to stay in India” — a familiar promise that he made in Southeast Asia early last year before selling the local business to Grab a month later — but avoided a question about the future of its food delivery service UberEats’ India business.\n\nIn recent months, many restaurants in India have ceased their tie-up with UberEats, and the company has lowered the discounts it was bandying out to aggressively compete with local rivals Swiggy and Zomato .\n\nUberEats has lost more than a third of its business in India in recent months, industry sources told TechCrunch. Last year, Uber held talks with both Swiggy and Zomato to sell its UberEats business in the country but failed to attract any meaningful offer, people familiar with the talks said.\n\nBhavik Rathod, UberEats’ India and Southeast Asia head, Deepak Reddy, head of central operations for UberEats in India, and several other executives have resigned in recent weeks, people familiar with the matter said. Uber’s spokespeople did not respond to TechCrunch’s emails.\n\nAt the event today, Uber executives declined to take questions about UberEats’ future in India. In an interview in 2017, Khosrowshahi said India was one of the key regions where the company planned to invest heavily. But in the years since, Uber has become a public company and faces pressure from its shareholders to reach a path to profitability. In the quarter that ended in June this year, Uber reported that it lost more than $5 billion.\n\nUber’s local rival Ola, in the meantime, is increasingly expanding its footprint in the nation. The Indian company, which leads the local market, said last month that its two-wheeler service Ola Bike is now available in more than 150 Indian cities and towns and it intends to take this transportation option to 300 additional towns and cities by next year. Uber is operational in fewer than three dozen cities in India.\n\nLast week, Ola introduced a car rental service called Ola Drive in Bangalore. The company, which has expanded to New Zealand, Australia, and UK in recent years, said it is making an initial commitment of $200 million to add about 20,000 cars to its rental fleet by next year.\n\nUber is also facing a major challenge to convert a significant portion of its gasoline-powered fleet in India to electric. The Indian government has ordered ride-hailing companies to electrify 40% of their fleets by 2026. Ola, here too, has an advantage over Uber. Uber declined a request to make its top executives available for interview.", "description": "Uber said on Tuesday that it has won a bid to work with government-run subway system in India’s capital in one of its rare announcements in India, a key overseas market where it is facing a fierce battle with local giant Ola. The ride-hailing giant said it has partnered with Delhi Metro Rail Corporation (DMRC) […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/GettyImages-922945940.jpg?w=600", "published_at": "2019-10-22"}