{"pub": "zdnet", "url": "https://www.zdnet.com/article/8-ways-you-can-possibly-maybe-mostly-get-microsoft-office-365-for-free", "downloaded_at": "2019-09-23 17:29:35.989570+00:00", "title": "8 ways you can (maybe) get Microsoft Office 365 for free or cheap", "language": "en", "text": "I remember when I bought my last copy of Office in 2007. It was an upgrade, naturally, because it's always been an upgrade. I also remember I first bought Office sometime before Bill Clinton was president. After that, every three to five years, when Microsoft revved the product, I'd pull out my wallet and pay Redmond for the new shiny bits.\n\nAt least until about eight years ago. That was when Microsoft turned Office into a subscription service. I've been making regular payments on Office 365 ever since. Apparently, I'm not the only one. In July 2017, Microsoft announced that revenues for Office 365 beat out that of traditional Office licenses. Then, in October 2017, the company predicted it will have two-thirds of all Office users in the cloud by this coming summer.\n\nAlso: What is Microsoft 365? Microsoft's most important subscription bundle, explained\n\nBut what if you don't want to be part of the cha-ching flow that keeps Clippy in caffeine? Sure, you could look to one of the excellent Office alternative distributions, like LibreOffice. But what if you want to use real Office, but for free?\n\nAs it turns out, there are a few legitimate ways to use Office 365 without paying for it. Not all solutions apply to everyone, but for some of you, the following words may get you to the point where you can excel.\n\n1. Free, online Office apps\n\nIf you're willing to use slightly feature-limited online versions of the venerable Office applications, you can. Just open your browser and point it to this link.\n\nAs you might imagine, this free offering is Microsoft's direct response to the various free Google Docs offerings. If you're OK with the reduced feature set in Office Online (which is still impressively complete compared to Google's versions), you can be sure your files are absolutely Office-compatible using just your browser.\n\n2. Free Office mobile apps\n\nIf you use a phone or a tablet, you can get the mobile version of Office for free. We've looked at these versions before, and they're excellent implementations of the full Office applications -- again with some minor feature limitations.\n\nOne note: size does matter when it comes to Office mobile apps. If your screen is larger than 10.1 inches, you will have to pay for Office 365. That means that if you're running one of the cheaper iPads, all's good. But if you're using a 10.5-inch or 12.9-inch iPad Pro, you'll need to pay your tithe to the House That Bill Built.\n\n3. Educational versions\n\nIf you have one of the right .edu email addresses, whether you are a student, a teacher, or possibly even an alum, you can get the full Office 365 product for free. That includes the full, download-and-install applications, an Exchange account, Teams, and more.\n\nThe gotcha is that your school has to buy an educational license to Office. If you want to see if your educational email address will help you win the free Office lottery, go to this page and enter your .edu address. Good luck!\n\n4. Trial version\n\nIf you don't need to make Office into a career, and all you need to do is crank out one PowerPoint or Excel spreadsheet this month, a trial version of Office might do you.\n\nThere are some downsides to this approach. You'll have to give M$ your credit card -- and remember to cancel the trial before the month runs out. Otherwise, your free trial will turn into a year's payment for Office 365 Home edition.\n\n5. Try again\n\nPeople have reported, undoubtedly in violation of the terms of service, using a different email address and credit card to get another month trial of Office 365. That's a lot of work to avoid paying for a pretty exceptional software suite. I wouldn't advise it, but apparently, it's been done.\n\n6. Try, try again: the ProPlus trial\n\nBecause the idea of doing something only one way is a cultural anathema to the Redmond folk, there is a second legitimate way to get a trial version of Office. In this case, we're pointing you to the Microsoft Office ProPlus trial. This is another 30-day trial, aimed at potential enterprise customers.\n\nSince this is an enterprise trial, if you qualify for the evaluation download, you can share it with up to 25 of your friends. I know. Way to be the life of the party, right?\n\n7. Free with a PC purchase\n\nOK, I know getting Office free with a PC purchase doesn't seem like the best way to save money, but hear me out. A lot of PCs come bundled with a year of Office 365, which is worth, generally, about $99.\n\nThe thing is, some of the PCs that come with a free year of Office 365 are ridiculously cheap. Go to Amazon's laptop section and then type in \"with free office\" into the search bar. You'll see some inexpensive laptops (like the little $162 Lenovo gem shown above).\n\nYes, you're spending money, but if you think about it, you're getting both a laptop and a year of Office for less than two hundred bucks. You could keep the cheap laptop or even possibly resell it and get most of your money back.\n\nAlso: Microsoft Office 365: The smart person's guide TechRepublic\n\nLook, I know it's far from ideal, and I pay my Microsoft tax every year, but if you want to save money and get a deal, spending an extra hundred bucks on top of the price of Office -- and getting a full laptop out of the deal -- is a pretty good compromise.\n\n8. Look (carefully) for deals\n\nWhile not everyone can qualify for one of the free opportunities listed above, there's always the possibility of a deal out there. But you need to be very, very careful. eBay (especially) is chock full of suspicious deals for inexpensive copies of Office (on disk) or Office 365 subscriptions. My recommendation is to stay away from eBay deals.\n\nHowever, we did find a good deal from Amazon with an Office 365 license sold by Microsoft for about $20 off. One of the benefits of buying from Amazon is that if you do get a scammy product, you can contact Amazon, and it'll give you a refund. So, you're much better off with an Amazon purchase (even if it's more expensive) than an eBay deal. Also, don't forget to click all the options. In the deal above, the \"key card\" option was full price, while the download version had a nice discount.\n\nWhat else?\n\nHave you found any other ways to save money on your computer or software purchases? What good (legitimate) deals have you seen? Go ahead and share with your fellow readers in the TalkBacks below. If I find any new deals for Office, I'll update this article, so bookmark it and check back regularly.\n\nYou can follow my day-to-day project updates on social media. Be sure to follow me on Twitter at @DavidGewirtz, on Facebook at Facebook.com/DavidGewirtz, on Instagram at Instagram.com/DavidGewirtz, and on YouTube at YouTube.com/DavidGewirtzTV.", "description": "Do you dream of making slides, writing reports, and calculating columns of numbers without cracking open your wallet? If so, have we got eight (possible) deals for you.", "authors": ["David Gewirtz"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2018/03/26/1aa88935-9b75-4f20-9500-053f9bcf8522/thumbnail/770x578/6a6b6aadd7d5e4cb430f75296fceb547/featureofc365evergreen20303.png", "published_at": "2019-09-23"}