{"pub": "guardian", "url": "https://theguardian.com/politics/2019/sep/04/tories-turning-into-brexit-party-philip-hammonds-constituents-weybridge", "downloaded_at": "2019-09-04 23:48:09.900307+00:00", "published_at": "2019-09-04", "title": "'They're turning into the Brexit party': Philip Hammond's constituents turn on the Tories", "language": "en", "text": "Many in Weybridge, where Philip Hammond has been MP for decades, share his anger at Boris Johnson\n\nHours before his sacking from the Conservative party, the former chancellor Philip Hammond claimed his purpose was to “defend my party against incomers, entryists, who are trying to turn it from a broad church to a narrow faction”. It was a sentiment many of his constituents in affluent Weybridge in Surrey, where Hammond has been the MP for 22 years, seemed to share.\n\nBrexit: MPs vote on second reading of bill that could block no deal – live news Read more\n\n“I don’t like the bullying tactics of Boris. He’s trying to get rid of people who voted against him – that’s not right,” said Mick Rogers, 72, over poached eggs and toast in Cafe One on Wednesday morning.\n\nRogers, the guitarist and singer from Manfred Mann’s Earth Band, said he had always been a Conservative, and like 50.15% of his fellow constituents had voted remain in the EU referendum. But if Hammond was not reselected after his decision to back a bill that would block no-deal Brexit, Rogers said he would not “have a clue” who to vote for.\n\nSinasi Ozkan, who owns the cafe on the town’s Georgian-designed and union flag-lined high street, felt similarly sympathetic towards Hammond. “I like him, I think he’s good,” said the 60-year-old, who is originally from Turkey.\n\n“He’s involved with the community here,” he said, noting that Hammond had visited the nearby Weybridge centre for elderly and disabled people on several occasions. Like Rogers, Ozkan felt disillusioned with the Tory party more generally: “They messed up with Brexit, it’s come to a point where nobody knows what they want or what they’re doing.”\n\nFacebook Twitter Pinterest Sinasi Ozkan outside his cafe. Photograph: Martin Godwin/The Guardian\n\nLike much of the home counties, the seat of Runnymede and Weybridge – made up of the former constituencies of Chertsey and Walton and North West Surrey – has long been a Conservative stronghold. In fact, support for Hammond has only strengthened over the years: in 2017 he won 31,436 votes and 60.9% of the total vote share.\n\nBoris Johnson’s electoral gamble risks wrecking the Tory party | Jonathan Freedland Read more\n\nBut, outside Stoneleigh’s traditional family butchers, Luisa Maccali said she was going to vote against the Conservatives for the first time. The Italian, who has lived in Weybridge for 15 years, has become exasperated by the government’s stance on the UK’s departure from the EU.\n\n“It has affected my life and split up my family,” said Maccali, who added that the bank her husband worked for had moved his job to Paris. “For Philip Hammond to try to get a deal is good. I was happy here and now I’m just waiting to move.\n\n“I won’t vote for the Conservatives anymore because they are turning into the Brexit party. I might vote for the Liberal Democrats, or one of the other smaller parties.”\n\nNot everyone is turning their backs on the Tories. Soraya Anderson, 56, and Lisa Challis, 60, looking at the lunch menu outside a Spanish restaurant opposite the butchers, both said they supported the government.\n\nFacebook Twitter Pinterest Soraya Anderson, left, and Lisa Challis. Photograph: Martin Godwin/The Guardian\n\nAnderson, who works for an equity group, said Hammond “should have backed Boris because he needs all the support he can get. Somebody had to do something drastic to get us moving.”\n\n“I don’t think [Hammond] was a good MP. He hasn’t got a strong presence like Boris does,” Challis said, adding that the prime minister’s defeat by the opposition and those within his own ranks had “made him stronger”.\n\nTheo Siddons, 22, is a relative anomaly among many of his generation in being a Tory voter, but like many of his peers he said he felt disillusioned with the turmoil in Westminster.\n\n“I think politics are important but it’s difficult to keep faith sometimes. I don’t really see a benefit to things like Brexit,” said the mathematics student from Byfleet.\n\nFacebook Twitter Pinterest Theo Siddons is disillusioned with Brexit. Photograph: Martin Godwin/The Guardian\n\nHaving voted for the Conservatives in the first two general elections in which he was eligible to vote, Siddons said he would vote for the Lib Dems if Britain were to go to the polls in October. “A lot of people I know feel the same,” he said.\n\nAlthough the government has repeated its claims that it is prepared to leave the EU with or without a deal on 31 October, the events of this week seem to have given people such as Siddons renewed hope that other eventualities are possible.\n\nHe said he was looking forward to the prospect of a general election, “if it can change the outcome of Brexit and if we can get a deal. I know it’s probably not possible but it’s great to think we could not leave at all.”", "description": "Many in Weybridge, where Philip Hammond has been MP for decades, share his anger at Boris Johnson", "authors": ["Amy Walker"], "top_image": "https://i.guim.co.uk/img/media/afff69d59e8ef780aff1ffcea792755d56b67153/0_448_6720_4032/master/6720.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=8c4393ac5ee702eb8ab7a82a10b0fac8"}