{"pub": "yahoo", "url": "https://news.yahoo.com/venezuela-government-investigates-guaido-over-192910701.html", "downloaded_at": "2019-09-15 00:10:51.942988+00:00", "title": "Venezuela investigates Guaido over photo with suspected Colombian criminals", "language": "en", "text": "Venezuelan opposition leader Juan Guaido, who many nations have recognized as the country's rightful interim ruler, talks to the media while arriving to attend a political rally in Caracas\n\nCARACAS (Reuters) - Venezuela's state prosecutor's office said on Friday it would open an investigation into Juan Guaido after the interior minister presented photos on state television showing the opposition leader in the company of two suspected members of a Colombian drug-trafficking group.\n\nGuaido on Friday said the two men had asked to take a photo with him when he secretly crossed into Colombia from Venezuela in February via an informal border route after a Venezuelan court had barred him from leaving the country.\n\nHe denied knowing who the men were. \"We didn't ask for their criminal record to take a photo,\" he told reporters in Caracas.\n\nVenezuelan Interior Minister Nestor Reverol said on state television that the two men were leaders of a \"Colombian paramilitary organization\" called the Rastrojos. Reverol said he would send the photos as evidence to the state prosecutor's office, which later opened the investigation.\n\nColombian police sources confirmed the men were members of the Rastrojos, a criminal group made up of ex-paramilitaries that engages in drug trafficking across the country, including along the Venezuelan border.\n\nGuaido crossed into Colombia before a U.S.-backed attempt on Feb. 23 to send trucks loaded with humanitarian aid into Venezuela from the Colombian border town of Cucuta. Venezuelan President Nicolas Maduro, however, had ordered the border's closure and told the military to block the aid's entry.\n\nAt the time, it was not clear how Guaido had crossed the border. He appeared at an aid concert by Cucuta on Feb. 22 dressed in the same clothes as he was wearing in the photo with the two men.\n\nMaduro, in a speech later on Friday, said the photos were evidence of a \"tremendous scandal,\" alleging they showed that Guaido had a \"criminal alliance with a gang of drug traffickers.\"\n\nColombian President Ivan Duque sought to downplay the significance of the photos and praised Guaido. \"Beyond whether there are photos or not, if he greeted or didn't greet a lot of people ... I want to emphasize who he is. He is a titan, a hero fighting for his country's democracy,\" Duque told reporters.\n\nGuaido assumed an interim presidency in January after denouncing Maduro as illegitimate for securing a second term last year in an election widely viewed as fraudulent. Most western nations now recognize Guaido as Venezuela's rightful leader, though Maduro labels him a coupmongering U.S. puppet.\n\n\n\n\n\n(Reporting by Corina Pons and Deisy Buitrago in Caracas and Luis Jaime Acosta in Bogota; Writing by Angus Berwick; Editing by Daniel Wallis)", "description": "Venezuela's state prosecutor's office said on Friday it would open an investigation into Juan Guaido after the interior minister presented photos on state television showing the opposition leader in the company of two suspected members of a Colombian drug-trafficking group.  Guaido on Friday", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/x.S0dMDPwDCbbYKx_sq1Sw--~B/aD0yOTk7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/56cc7822e6824b2a8fb9c416e7c97d51", "published_at": "2019-09-13"}