{"pub": "reuters", "url": "https://reuters.com/article/us-china-economy-output-aluminium/china-aluminum-output-slips-in-august-amid-smelter-outages-idUSKBN1W104M", "downloaded_at": "2019-09-16 05:37:00.848009+00:00", "title": "China aluminum output slips in August amid smelter outages", "language": "en", "text": "BEIJING (Reuters) - China’s primary aluminum output in August fell 0.5% from the previous month, according to data released by the National Bureau of Statistics (NBS) on Monday, as unexpected outages at two key smelters dented production.\n\nFILE PHOTO: Workers are seen next to aluminium rolls at a plant in Binzhou, Shandong province, China September 13, 2018. REUTERS/Stringer\n\nChina, the world’s top aluminum producer, churned out 2.97 million tonnes of the metal last month, the data showed.\n\nThat was down from 2.984 million tonnes in July, the second-highest monthly total on record, and down 0.3% from a year earlier, the bureau said.\n\nAccording to Reuters calculations based on NBS data, output averaged around 95,800 tonnes per day in August, the lowest daily rate since March, and down from about 96,260 tonnes per day in July.\n\nAugust saw two incidents hit aluminum production at China’s top two private-sector smelters, China Hongqiao Group (1378.HK) and Xinfa Group, sending Shanghai aluminum prices SAFcv1 well above the 14,000 yuan ($1,978) a tonne mark often considered a break-even for producers.\n\nHongqiao’s smelting premises in eastern China’s Shandong province were hit by flooding over the weekend of Aug. 10 to 11 after Typhoon Lekima tore through the region, with the company ultimately saying its annual production would decrease by 200,000 tonnes to 300,000 tonnes as a result.\n\nAround one week after the Shandong flooding, Xinfa shut down around 500,000 tonnes of annual smelting capacity at a plant in the northwestern Xinjiang region following an explosion.\n\nIn the first eight months of 2019, China produced 23.47 million tonnes of aluminum, up 1.4% year-on-year.\n\nThe current aluminum price provides an incentive for smelters in China to raise production moving into the fourth quarter but new ramp-ups, in southern Guangxi and Yunnan, are proving slower than expected, said Jackie Wang, an aluminum analyst at CRU.\n\nWang does not expect smelters in northern China to be ordered to cut back production this month ahead of 70th anniversary celebrations of the founding of the People’s Republic of China in Beijing on Oct. 1 but does envisage some impact on downstream aluminum-processing plants.\n\n“It’s really costly and time-consuming for smelters to shut down and re-open,” she said.\n\nMeanwhile, China’s production of 10 nonferrous metals - including copper, aluminum, lead, zinc and nickel - in August rose 0.3% from July to 4.91 million tonnes, its second-highest on record. That was also up 4.4% from a year earlier, the bureau said.\n\nThe other non-ferrous metals in this group, whose January to August output was up 4.6% year-on-year at 38.63 million tonnes, are tin, antimony, mercury, magnesium and titanium.", "description": "China's primary aluminum output in August fell 0.5% from the previous month, according to data released by the National Bureau of Statistics (NBS) on Monday, as unexpected outages at two key smelters dented production.", "authors": ["Tom Daly", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190916&t=2&i=1430325148&w=1200&r=LYNXMPEF8F02J", "published_at": "2019-09-16"}