{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/legal-issues/us-judge-denies-news-media-request-for-mueller-grand-jury-materials-citing-recent-appeals-court-ruling/2019/09/26/6696994a-e09e-11e9-b199-f638bf2c340f_story.html", "downloaded_at": "2019-09-27 01:31:07.195485+00:00", "title": "U.S. judge denies news media request for Mueller grand jury materials, citing recent appeals court ruling", "language": "en", "text": "The Reporters Committee for Freedom of the Press had sought the release of grand jury materials in the probe of special counsel Robert S. Mueller III, left, into Russian interference in the 2016 election and possible coordination by the Trump campaign. (Saul Loeb, Brendan Smialowski/AFP/Getty Images)\n\nA federal judge Thursday denied a news media request to unseal grand jury records cited in special counsel Robert S. Mueller III’s final report, noting an April decision by the U.S. Court of Appeals for the D.C. Circuit that struck down judges’ “inherent authority” to release such materials when the public interest outweighs the need for secrecy.\n\nChief U.S. District Judge Beryl A. Howell of the District of Columbia said she was bound by the ruling, McKeever v. Barr, and that the petitioning party, the Reporters Committee for Freedom of the Press, did not qualify for other exceptions to grand jury secrecy rules.\n\n[House panel asks court to enforce Mueller-related subpoenas, a step toward possible impeachment]\n\nThe ruling does not affect a separate pending lawsuit by the House Judiciary Committee seeking grand jury materials in Mueller’s investigation into Russian interference in the 2016 U.S. election, which was brought under an exception to secrecy rules for requests “preliminary to or in connection with a judicial proceeding,” namely impeachment.\n\nIn an eight-page opinion, Howell wrote that the Reporters Committee’s efforts to further journalists’ newsgathering and ensure government transparency “have significant value” but “fall outside the scope of this exception.”\n\nReporters Committee legal director Katie Townsend expressed disappointment in a ruling that keeps cloaked “information that the public could not have a stronger interest in seeing.”\n\n“The district court’s decision makes clear that the public has few avenues in this Circuit to seek the release of grand jury material, even in cases where the public’s interest in access to that material is at its height,” Townsend said.\n\nRead more:\n\nAppeals court in D.C. rules judges may not create exceptions to grand-jury secrecy rules\n\nWatergate report released from archives could be a ‘road map’ for Mueller\n\nHouse panel asks court to enforce Mueller-related subpoenas, a step toward possible impeachment\n\nLocal newsletters: Local headlines (8 a.m.) | Afternoon Buzz (4 p.m.)\n\nLike PostLocal on Facebook | Follow @postlocal on Twitter | Latest local news", "description": "The chief district judge in Washington said the D.C. Circuit struck down judges’ “inherent authority” to release materials in the public interest.", "authors": ["Spencer S. Hsu", "Investigative Reporter", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/m42zy5CFQFaPYdZGp5rmXkxDts0=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/PVRCQNSB54I6TERMMTLLPBALQI.jpg", "published_at": "2019-09-26"}