{"pub": "guardian", "url": "https://theguardian.com/artanddesign/2019/oct/03/banksy-work-depicting-mps-as-chimpanzees-sells-for-record-price", "downloaded_at": "2019-10-03 23:34:34.842957+00:00", "published_at": "2019-10-03", "title": "Banksy work depicting MPs as chimpanzees sells for record price", "language": "en", "text": "Devolved Parliament reaches just under £9.9m at auction at Sotheby’s in London\n\nA Banksy artwork depicting MPs in the House of Commons as chimpanzees has been sold for close to £10m, in what organisers say is a record for the artist.\n\nDevolved Parliament, which is four metres wide, was first unveiled as part of the Bristol artist’s exhibition Banksy vs Bristol Museum in 2009.\n\nIt went under the hammer at Sotheby’s in London on Thursday and after 13 minutes of bidding, sold for £9,879,500. It far outstripped the pre-auction estimate of £1.5m-£2m.\n\nThe auction was held in the same auction room where Banksy stunned the art world a year ago by activating a shredder moments after his Girl With Balloon sold for a little over £1m.\n\nThe sale price for Devolved Parliament comfortably beats the previous auction record for a Banksy, which is thought to be the US$1.8m (£1.4m) for Keep It Spotless, which was sold at Sotheby’s in New York in 2008.\n\nShortly after Devolved Parliament was sold, Banksy reacted on Instagram.\n\n“Record price for a Banksy painting set at auction tonight,” he wrote. “Shame I didn’t still own it.”\n\nIt was lent earlier this year, by its anonymous owner, to a display at Bristol Museum marking both the exhibition’s 10th anniversary and Britain’s original planned exit from the EU on 29 March.\n\nAt the time, Banksy wrote on Instagram: “I made this 10 years ago. Bristol museum have just put it back on display to mark Brexit day. Laugh now, but one day no one will be in charge.”\n\nBanksy recently addressed Brexit in a huge mural on a building in Dover showing a worker chiselling a star from the EU flag. It was mysteriously whitewashed over. He said he had been planning to update it on 31 October, with the blue crumpled on the ground, writing: “Never mind. I guess a big white flag says it just as well.”\n\nPA Media contributed to this report", "description": "Devolved Parliament reaches just under £9.9m at auction at Sotheby’s in London", "authors": ["Guardian Staff"], "top_image": "https://i.guim.co.uk/img/media/ee976fad236015742327575549084ec35d7f2aa5/0_42_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=43e21092239095bdee1f54ba1db50b1c"}