{"pub": "metro", "url": "https://metro.co.uk/2019/10/14/jennifer-aniston-addresses-friends-movie-never-happened-despite-interest-cast-10912580", "downloaded_at": "2019-10-14 06:36:54.405702+00:00", "title": "Jennifer Aniston addresses why Friends movie never happened", "language": "en", "text": "Jennifer Aniston has explained why a Friends film never happened (Picture: FilmMagic)\n\nJennifer Aniston has explained why a Friends movie will never happen, despite her fellow co-stars being up for ‘doing something together’.\n\nThe 50-year-old actress, who played Rachel Green in the iconic sitcom, revealed that David Schwimmer, Lisa Kudrow, Courteney Cox, Matthew Perry and Matt LeBlanc would have wanted to please fans by reworking the show but producers didn’t want to.\n\nExplaining why a film has yet to come to fruition, Jennifer said: ‘Because our producers wouldn’t want it, wouldn’t let us. Look, it’s not been without our desire to, because our fans have wanted it so much.’\n\nAsked whether all six of the Friends would have taken part, Jennifer continued: ‘It depends.\n\n‘I mean, we haven’t all sat in a room. But would we have loved to have done something together? Yeah. It would have been fun. We could have redesigned it for a couple episodes.’\n\nAdvertisement\n\nAdvertisement\n\nShe continued to Variety: ‘But whatever. Maybe it’s better this way, but we’ll never know.’\n\nJennifer said it would have been fun to redesign the show (Picture: Getty)\n\nJennifer’s comments come just months after Adam Sandler publicly called on her to make a ‘f***ing Friends movie‘.\n\n‘Friends was a powerhouse,’ added Adam, speaking to People. ‘Everybody on Friends is excellent, everybody likes them. America, the world loves the cast.’\n\nHowever, like Jennifer explained, co-creator and executive producer Marta Kauffman has ruled out any chance of a reunion or reboot entirely.\n\n‘We will not be doing a reunion show, we will not be doing a reboot,’ she said. ‘The show was about that time in life when friends are your family.’\n\nOn the subject of a reboot, Kauffman added: ‘It’s not going to beat what we did.’\n\nMeanwhile, co-creator and executive producer David Crane agreed, adding to Deadline: ‘We did the show we wanted to do. We got it right, and we put a bow on it.’\n\nFriends is available to stream on Netflix in the UK.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Friends fans freak out after spotting iconic fountain in Hocus Pocus\n\nMORE: You can still buy the MAC lipstick Jennifer Aniston wore on the set of Friends", "description": "Jennifer Aniston addresses why Friends movie never happened despite interest from cast.", "authors": ["Cydney Yeates"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/09/GettyImages-138428188-e1569085714541_1571033479.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-14"}