{"pub": "cnbc", "url": "https://cnbc.com/2019/09/09/saudi-arabias-new-energy-minister-has-work-cut-out-dan-brouillette.html", "downloaded_at": "2019-09-09 06:50:57.960750+00:00", "title": "US wants energy dominance regardless of what happens to oil prices, deputy energy secretary says", "language": "en", "text": "The U.S. deputy energy secretary told CNBC Monday that America wants to achieve energy dominance regardless of what happens to oil prices.\n\nOPEC has struggled to shore up crude futures this year, amid a deteriorating outlook for global growth and a protracted trade dispute between the U.S. and China.\n\nIt has once again raised questions about whether the Middle East-dominated group really wields that much influence over world crude markets.\n\n\"Our energy policy is not designed to affect price, that's not we do for a living. And yet it does because of our production numbers,\" Dan Brouillette told CNBC's Hadley Gamble at the World Energy Congress in Abu Dhabi.\n\n\"The president has an 'all of the above' strategy. He talks often about energy dominance and the world often asks: what does that mean? It just simply means that we are going to produce as much energy as we can, as cleanly as we can and as affordably as we can.\"\n\n\"And whatever happens to the world price of oil, whatever happens to the world price of whatever, electricity, it doesn't really matter, then so be it,\" Brouillette said.\n\nIn the last decade, the U.S. has more than doubled oil production to 12.3 million barrels a day, making it the world's largest producer.\n\nIt now appears set to flood the oil market with even more crude, putting downward pressure on prices at a time when it is already struggling to cope with too much supply.\n\nInternational benchmark Brent crude traded at $62.12 Monday morning, up around 0.9%, while U.S. West Texas Intermediate (WTI) stood at $57.17, up more than 1.1%.", "description": "\"Our energy policy is not designed to affect price, that's not we do for a living,\" Dan Brouillette told CNBC on Monday.", "authors": ["Sam Meredith"], "top_image": "https://image.cnbcfm.com/api/v1/image/106118477-1568005474242gettyimages-1124222680.jpg?v=1568005532", "published_at": "2019-09-09"}