{"pub": "yahoo", "url": "https://news.yahoo.com/looters-arrested-ambulances-hit-ecuador-155603671.html", "downloaded_at": "2019-10-06 11:30:35.194839+00:00", "title": "Looters Arrested and Ambulances Hit in Ecuador Fuel Protests", "language": "en", "text": "(Bloomberg) -- Key highways are paralyzed across Ecuador after a night of clashes triggered by fuel price hikes, as a state of emergency enters its second day.\n\nHundreds have been arrested amid outbreaks of looting, while Ecuador’s Red Cross said that demonstrators in Quito pelted ambulances with rocks.\n\nSecurity forces have have lifted more than 100 blockades and restored access to Quito’s airport, Defense Minister Oswaldo Jarrin said Friday. The authorities aim to completely restore order by the end of the day, he added.\n\nThe fuel price increases took effect at midnight on Wednesday and were welcomed by the International Monetary Fund and Moody’s Investors Service. Drivers of buses, taxis and trucks, responded by blocking highways with vehicles and burning tires.\n\nPresident Lenin Moreno reiterated on Friday morning that the subsidy won’t be restored.\n\nPrices for low-octane gasoline jumped to $2.40 per gallon from $1.85, while diesel prices more than doubled to $2.30 per gallon from $1.03.\n\nMoreno’s “bold decision” is likely to strengthen the nation’s sovereign bonds, said Siobhan Morden, the head of Latin America fixed income strategy at Amherst Pierpont Securities in New York.\n\n“There is now a clear path towards fiscal consolidation,” Morden wrote in a report. Bond rallied, sending the yield on Ecuador’s dollar bonds maturing in 2030 down eleven basis points to 9.29%.\n\nEcuador will submit a package of fast-track economic reforms to meet terms of a $4.2 billion financing agreement with the International Monetary Fund, Interior Minister Maria Paula Romo said, speaking alongside Jarrin from the presidential palace in Quito.\n\nThis year, Ecuador had to budget close to $1.4 billion to keep gasoline and diesel prices below market prices.\n\nTo mitigate the impact of the reforms on the poor, Moreno pledged to increase a social safety net so that it would protect close to 5 million Ecuadorians, increasing a monthly transfer by $15.\n\nThe government says the fuel subsidies have cost the nation close to $60 billion since they were introduced in the 1970s.\n\nOn Tuesday, Ecuador said it would quit the Organization of Petroleum Exporting Countries, to avoid having to cut output to meet quotas.\n\n(Adds comments from President Lenin Moreno, Defense Minister Oswaldo Jarrin and Interior Minister Maria Paula Romo)\n\nTo contact the reporter on this story: Stephan Kueffner in Quito at skueffner1@bloomberg.net\n\nTo contact the editors responsible for this story: Daniel Cancel at dcancel@bloomberg.net, Matthew Bristow, Robert Jameson\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Key highways are paralyzed across Ecuador after a night of clashes triggered by fuel price hikes, as a state of emergency enters its second day.Hundreds have been arrested amid outbreaks of looting, while Ecuador’s Red Cross said that demonstrators in Quito pelted ambulances with rocks.Security", "authors": ["Stephan Kueffner"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-04"}