{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/11/nfl-will-consider-placing-antonio-brown-paid-leave-making-him-ineligible-play", "downloaded_at": "2019-09-12 07:24:24.928832+00:00", "title": "Antonio Brown: NFL will consider placing Patriots star on paid leave, making him ineligible to play", "language": "en", "text": "That is “possible” and something that the NFL is “going to have to focus on,” said one of the people close to the situation, who spoke on the condition of anonymity because of the sensitivity of the topic.\n\n“We are reviewing the matter,” NFL spokesman Brian McCarthy said, declining further comment.\n\nThe league is investigating the allegations, but it’s unclear whether a decision will be made before the Patriots are scheduled to play Sunday. Brown has not been charged with a crime, so the NFL does not have to be concerned, at this point, about interfering with a criminal investigation.\n\nNFL representatives are expected to meet with Brown’s accuser, Britney Taylor, next week, according to a person familiar with the matter. It is not certain if or when the league’s investigators will be able to arrange interviews with other potential witnesses.\n\nJenkins: I don’t know what Antonio Brown did, but he’s already damned by misogynist language\n\nIf the league opts to put Brown on paid leave, it also would have to decide under what conditions he would be permitted to come off the exempt list and how it would react, for example, to a prospective settlement of the lawsuit. Brown has denied the allegations through his attorney.\n\nIt does not appear that Taylor contacted police about any of her allegations against Brown, who does not appear to have a criminal record in either Pennsylvania or Florida, where he lives. A Pittsburgh police spokeswoman, in an email on Wednesday, said the agency has no records of complaints or any active investigations into Brown for sexual assault.\n\nIn a statement to The Washington Post, Mike Manko, a spokesman for Allegheny County District Attorney Stephen Zappala Jr., also said his agency had no open investigations but did reference an apparent child endangerment investigation involving Brown that was discussed with a local police force in the Pittsburgh area but never moved forward.\n\n“The result of that conversation was a decision that we could not move forward with investigating that claim,” Manko said. There are no public records available relating to that case, Manko said.\n\nNFL leaders planned to meet Wednesday about the matter. The league could allow Brown to play for the Patriots while its investigation proceeds and then place him on paid leave if NFL officials believe that is warranted.\n\nBrown was at the Patriots’ facility in Foxborough, Mass., and was on the field for the portion of Wednesday’s practice that was open to the media. He was seen wearing jersey No. 1.\n\n“Both Antonio and his representatives have made statements,” Patriots Coach Bill Belichick said at a news conference in Foxborough. “So I’m not going to be expanding on any of those. They are what they are. We’ve looked into the situation. We’re taking it very seriously all the way through the organization. I’m sure there are questions. But I’m not going to be entering into the discussion about that today.”\n\nBelichick declined to say whether he expects Brown to play in the Patriots’ game Sunday at Miami and would not address whether the team is preparing for the possibility of Brown being placed on the commissioner’s exempt list. He also refused to say whether the team was aware of the lawsuit and the allegations against Brown before signing him.\n\nBelichick and a team official cut off the regularly scheduled meeting with reporters after about four minutes and several questions about Brown that produced terse answers by Belichick. He answered multiple questions by saying, “When we know more, we’ll say more.”\n\nBrown agreed to a one-year contract with the Patriots on Saturday, hours after being released by the Oakland Raiders. The team officially announced the signing this week.\n\nOne women’s advocacy group, UltraViolet, called for the Patriots to “immediately cut” Brown.\n\n“Time and again, the NFL has failed to address the near epidemic levels of sexual assault and violence within the league — and it is long past time that the NFL start to live up to the commitments that they have made to believe and support survivors of sexual violence,” Shaunna Thomas, the co-founder and executive director of UltraViolet, said in a statement.\n\nBrown could face punishment by the league under the personal conduct policy. The policy empowers the NFL to punish a player if it investigates and believes that disciplinary measures are warranted, even if the player is not charged with or convicted of a crime. Any suspension under the personal conduct policy is without pay. The NFL generally allows legal proceedings to play out before making a determination about a suspension.\n\nThe league also is empowered to take a player off the field while legal proceedings are pending, via the exempt list. The player is paid by his team while on the list.\n\nTaylor is a former college classmate and a gymnast who worked with Brown as a trainer. In the lawsuit, filed in Florida, she accused Brown of rape and sexual assault in three separate incidents in 2017 and 2018.\n\nDarren Heitner, Brown’s attorney, said that any sexual relations between Brown and the woman were consensual and that Brown believes he is the victim of “a money grab” by his accuser.\n\nUnder the personal conduct policy, the league can place a player on paid administrative leave if he is formally charged with a violent crime, including sexual assault. But while Brown has not been charged with a crime, the conduct policy also authorizes NFL Commissioner Roger Goodell to place a player on the exempt list if he believes, following an investigation, that the player may have violated the policy.\n\nWhile on paid leave, a player cannot attend games or practice with his team. He is permitted to attend meetings, participate in workouts and undergo medical treatment at his team’s facility. The paid leave is designed to last until the league decides on potential discipline under the personal conduct policy.\n\nAn arbitrator upheld the league’s use of the exempt list for paid leave for players in a 2016 ruling, after the NFL Players Association filed a grievance in 2015. The NFL’s use of the commissioner’s exempt list became prominent in 2014, when the league used it to place Minnesota Vikings running back Adrian Peterson and Carolina Panthers defensive end Greg Hardy on paid leave.\n\nWill Hobson contributed to this report.\n\nRead more:\n\nThe NFL wanted a celebration for its 100th season. Instead it got Antonio Brown.\n\nNFL power rankings, Week 2: Antonio Brown will make the Patriots next to unbeatable or ruin them\n\nIt’s Antonio Brown’s NFL now, and everyone else is just living in it", "description": "If he’s placed on the commissioner’s exempt list, Brown would be ineligible to practice with the Patriots or attend games.", "authors": ["Mark Maske", "Sports Reporter Covering The Nfl"], "top_image": "https://d1i4t8bqe7zgj6.cloudfront.net/09-11-2019/t_1fa76e597d664658840b1b86c19c4dc5_name_antonio.jpg", "published_at": "2019-09-11"}