{"pub": "realclearpolitics", "url": "https://insidehook.com/article/sports/nba-hong-kong-protests-daryl-morey-lebron", "downloaded_at": "2019-10-29 14:01:14.408028+00:00", "title": "The NBA’s Hong Kong Protests Will Not Go Quietly Into the Night", "language": "en", "text": "Last Wednesday night, fans filed into the Barclays Center in Brooklyn, New York, for the first home game of the 2019-2020 NBA season. Outside of the arena, people gathered: some were there to attend a nearby, non-basketball-related event; others were festooned in Nets gear, waiting for friends to arrive so they could enter the arena.\n\nWhat was lacking, though, was the presence of protests that had accompanied a preseason game just days earlier. On that night, more than 150 people showed up wearing black “Stand With Hong Kong” T-shirts and bearing poster-board signs emblazoned with similar messages of solidarity.\n\nIt has now been almost a month since Houston Rockets General Manager Daryl Morey tweeted in support of protests in Hong Kong. Though the tweets were later deleted, the Chinese response was swift, with several vendors suspending their contracts with the Rockets, and the NBA’s media partner in China deciding not to air two preseason games that were being played in their country, according to NPR.\n\nThe controversy picked up even more steam when, a week later, LeBron James criticized the pro-Hong Kong protest tweet sent by Morey. The NBA called Morey’s tweets “regrettable” and Morey later apologized for offending China. Since then, demonstrations have broken out in and around NBA arenas, with several protesters escorted out of games after raising signs or voicing support for Hong Kong. Others had their signs confiscated in accordance with a league policy that bans signs with political messages at games.\n\nPart of why this has all been so surprising is that the NBA is frequently outspoken on human-rights issues. James has taken on President Trump, successful coaches like Steve Kerr and Gregg Popovich have criticized lawmakers’ inaction on gun legislation, and high-profile players have worn shirts speaking out against police brutality, all without fear of retribution from the NBA.\n\nBut Morey’s tweet was different.\n\nBasketball has become massively popular in China over the last two decades, more so than any other American sport. Salon estimates that the NBA earns $4 billion annually from television deals, merchandise sales and sponsorships in the Asian country.\n\n“I think the NBA incident has captured the attention of the American people in a way that we haven’t [seen] before,” said Annie Boyajian, advocacy director at Freedom House, a watchdog organization located in Washington, D.C. Freedom House helped organize a protest at the Washington Wizards game on Oct. 9. “[Free speech] is such a part of the American way of life … And it was such an egregious example, you know, China — the government of China — putting out a statement [trying] to dictate the terms of free speech to us.”\n\nThough this preseason protest did not lead to a protest at the Nets’ opener, it does not look like the controversy will end any time soon. Around the nation and in Toronto, protests have been a steady fixture at games, gaining enough public attention that Vice President Mike Pence criticized the NBA and Nike for backing down from support for Hong Kong.\n\n“Some of the NBA’s biggest players and owners, who routinely exercise their freedom to criticize this country, lose their voices when it comes to the freedom and rights of the people of China,” Pence said in a speech about the Trump administration’s China policy in Washington, according to NPR.\n\nPence also chided Nike for the “un-American” move of removing Houston Rockets merchandise from stores in China. “In siding with the Chinese Communist Party and silencing free speech, the NBA is acting like a wholly owned subsidiary of that authoritarian regime,” Pence said.\n\nBut regardless of the actions of league officials and players, fans have made a clear statement that they stand on the side of human rights. Here is a quick look at what has happened around the league in both the U.S. and Canada during the first week(end) of the NBA season.\n\nNew York\n\n\n\nFilm producer Andrew Duncan bought the preseason protesters’ seats at Barclay Center, according to The Wall Street Journal. Duncan previously helped secure the release of five Chinese women imprisoned for peacefully protesting sexual harassment on Beijing’s public transit system in 2015. (Two years later, Duncan was himself accused of sexual harassment and left the public eye).\n\n1. Producer and activist Andrew Duncan bought 300 tickets to tonight's Nets vs Raptors game and is hosting hundreds of Chinese pro-Democracy activists to protest the NBA.\n\n\n\nThey're all wearing \"Stand With Hong Kong\" t-shirts pic.twitter.com/pIcUwSLaPB — Yashar Ali 🐘 (@yashar) October 19, 2019\n\n\n\nDuncan later told CBS News that he was going to take the protest one step further — he wanted to fly a group of former NBA players to Hong Kong.\n\n“And the idea is to go to Tokyo, Japan, Taipei in Taiwan,” said Duncan to CBS News. “And then try to go and take the group of players, on behalf of the NBA Players Association, on a fact-finding mission and fly into Hong Kong and see if we’re admitted, so we can go speak to Joshua [Wong] and the other democratic leaders in Hong Kong. And let’s get some basketball players to go and spread democracy.”\n\nActivist Nathan Law, who founded the youth activist group Demosistō and is currently a Yale grad student, participated in the preseason protest. He told CBS News that the he protested because the people of Hong Kong needed to know they had international support.\n\nOur @nathanlawkc is at Barclays Center tonight to protest at the @BrooklynNets vs. @Raptors game, along with a large group of @NY4HK members. The NBA ought to stand up for human rights and the freedom of speech! pic.twitter.com/G9ggAPgPa7 — Demosistō 香港眾志 😷 (@demosisto) October 19, 2019\n\n\n\n“The people of Hong Kong, they’re putting their lives at risk and facing rubber bullets and all the police brutality … and it’s important that we fight for our dignity and fight for our freedom,” Law said, according to CBS. “And most importantly, it is not only for ourselves. You can see that China, they’re silencing Morey and all other players. And we’re here to say that you’re facing the same difficulties — the U.S. mass public. You should be aware that freedom is at risk. And the fight in Hong Kong is actually helping us … to say that we are not going to kowtow to China. We are going to fight for our freedom, with all the costs that we can pay.”\n\nPhiladelphia\n\n\n\nSixers fan Sam Wachs was ejected from the Wells Fargo Center on Oct. 22 after he and his wife held signs in support of the pro-democracy protests. Wachs told WHYY that he was escorted out during the second quarter of the game, which was against China’s Guangzhou Loong Lions. Wachs, who told a reporter he is a “huge Sixers fan,” previously spent two years in Hong Kong as an English teacher. During interviews following his ejection, he said he has been dismayed by the NBA’s response to the conflict.\n\nThe moment Sam Wachs and his wife are escorted out of the @sixers preseason game against a Chinese basketball team for yelling “Free Hong Kong.” @6abc pic.twitter.com/3HlZxKXDzs — Christie Ileto (@Christie_Ileto) October 9, 2019\n\n\n\n“It really struck a nerve with me that the NBA is so willing to frame this discussion using Chinese government talking points and disinformation,” Wachs said to WHYY.\n\nDuring the game, Wachs and his wife sat behind the bench of the Chinese team and wore face masks (these masks are banned at protests in Hong Kong). They held up two signs: “Free Hong Kong” and “Free HK.” The signs were confiscated about five minutes into the game, at which point Wachs started chanting “Free Hong Kong.” That was when he was escorted out. The 76ers and Wells Fargo later released statements saying Wachs and his wife were “disrupting” other fans.\n\n“Obviously there’s a lot of money at stake, but I don’t care about that,” Wachs said, according to WHYY. “I don’t care how much money the NBA is set to make or lose from China. I believe that it matters who you do business with.”\n\nLos Angeles\n\n\n\nA fan in Los Angeles raised $43,000 in two days on GoFundMe to distribute 13,000 pro-Hong Kong T-shirts outside Staples Center before the opening-night game between the Lakers and Clippers. The T-shirts read “Fight for freedom, stand with Hong Kong.”\n\nSo he’s still going by the pseudonym Sun Lared. All he’ll tell me is he works in tech, is Taiwanese American, in his 30’s and hates that China has gotten US businesses to self-censor.\n\n\n\nHe’s had 13,000 shirts made to give away. Dozens are here to help him. pic.twitter.com/J4mKoqGWQS — Josie Huang (@josie_huang) October 23, 2019\n\n\n\nAccording to reports, plenty of fans did, in fact, grab the shirts on their way into the arena. One young kid even waved a shirt when the Staples Center dance cam focused on him (the camera panned away quickly, however).\n\nA young fan tricked the camera operator at last night's Clippers-Lakers game to show his \"Free Hong Kong\" shirt.\" (h/t @reddit) pic.twitter.com/ScxTjz3OKL — Rob Tornoe (@RobTornoe) October 23, 2019\n\n\n\nWashington, D.C.\n\n\n\nPatrick Hedger, who lives in Arlington, Virginia, but temporarily lived in Hong Kong in 2022 and 2011, told Buzzfeed News that security officials at the Washington Wizards game on October 9 asked him to leave Capital One Arena after he yelled “Free Hong Kong” and held up a sign inside the arena.\n\n\n\nOther fans told Buzzfeed their signs were also taken.\n\nOur “Google Uyghurs” sign has been confiscated. pic.twitter.com/fX4tF4oOxR — Jon Schweppe (@JonSchweppe) October 9, 2019\n\n\n\nThat night, the Wizards were playing the Guangzhou Loong Lions. Many others protested outside the arena, including a group organized by Freedom House. Boyajian said that Freedom House organized the protest in order to not only highlight what is happening in Hong Kong and China, but to draw attention to the fact that the Chinese government is “trying to control free speech here in the U.S.”\n\n“I’d also like to highlight the fact that we think it’s really important that the NBA let itself be bullied in that way,” she said.\n\n“As an American, I would certainly hope that companies based in America, that have benefited from the rule of law and rights and freedoms that we have in the U.S., would do a better job of standing up for those rights, wherever they’re located,” Boyajian continued. “And obviously it’s increasingly complicated for them, especially when you’re dealing with multinational corporations that have a presence in a bunch of countries, but there is an expectation from consumers in this global world, that companies they deal with will have some sense of obligation to business and human rights. And I think there’s a real reputational cost for corporations like the NBA … or others when they make these, you know, frankly, dollars-over-value calculation.”\n\nBoyajian said that Freedom House seized the opportunity of the moment and if they see further opportunities, they would love to be engaged and there is “no sign of this stopping any time soon,” so Freedom House will continue supporting protesters to the extent they can.\n\nToronto\n\n\n\nA pro-Hong Kong group in Toronto, the Torontonian HongKongers Action Group, raised more than $34,000 in order to print 7,000 “The North Stand with Hong Kong” shirts, which they passed out before the Toronto Raptors opening home game on Oct. 22.\n\n“We are quite disappointed that NBA is not showing support to freedom is speech and freedom of expression, given the fact that it has been a great platform allowed players to express themselves over the years,” said Mimi Lee, an organizer of the group, during an email interview. “[We’d] like to see NBA (or any organization) to put human rights and global values before money or financial interests.”\n\nLee wrote an op-ed for The Washington Post before the game, urging people who were attending the game to grab a shirt on their way in to exercise “the free speech that is denied to the people of Hong Kong.”\n\n\n\nVancouver\n\n\n\nProtestors gathered outside Rogers Arena in Vancouver before the Oct. 17 preseason game between the Los Angeles Clippers and Dallas Mavericks. The group was small, but held signs condemning the NBA and shouted things such as “Fight for freedom!” and “Stand for Hong Kong!”\n\n“We are here to let more people know that we should be supporting the Hong Kong people’s fight for freedom,” said protestor Thekla Lit to Postmedia, according to The Vancouver Sun. “It’s a very alarming sign because we are here in a free and democratic society but our freedom of speech can be suppressed by another country, so many thousand miles away.”\n\nThe protest was organized by Lee Haber, who told The Vancouver Sun that Canadians should care what is happening because it’s not just about Hong Kong, but about freedom of speech and expression in Canada and the United States.\n\n“Commissioner Silver has stated that he will stand by the free speech of the players, fans, employees, people in the NBA community,” Haber said to The Sun. “We’re here to hold him to his word, that the NBA will put the free speech of their people ahead of access to the Chinese market.”\n\nWhat’s Next?\n\n\n\nThough the protests may have fizzled out in some cities, the original reasoning behind them — the pro-democracy protests in Hong Kong itself — are far from over.\n\n“I don’t want to lose sight of what’s happening in Hong Kong, the Hong Kong piece is important,” Boyajian told InsideHook during a phone interview. “The fact of the matter is, they are supposed to be guaranteed certain rights that the government is violating. So this is also about Hong Kong and the rights that Hong Kongers and mainlanders should enjoy. But of course, it’s also about the U.S.”\n\nIt is likely that the NBA will continue to see signs, shirts and protests both before and during games as long as the conflict in Hong Kong persists. Whether the league will change its tune is yet to be seen.\n\n", "description": "The NBA has sided with China in the wake of a free-speech controversy that began with Daryl Morey's pro-Hong Kong tweet. Can fan protests change that?", "authors": ["Rebecca Gibian"], "top_image": "https://www.insidehook.com/wp-content/uploads/2019/10/GettyImages-1177698069.jpg?fit=1200%2C744", "published_at": "2019-10-29"}