{"pub": "indiatimes", "url": "https://zigwheels.com/news-features/news/2020-honda-city-coming-to-india-all-the-latest-details/35562", "downloaded_at": "2019-10-16 13:55:54.468646+00:00", "title": "2020 Honda City Coming To India: All The Latest Details", "language": "en", "text": "Design updates in the 2020 Honda City include new tail lamps, alloy wheels and a revised character line.\n\nIt is expected to come with a premium interior that could borrow bits from the 2020 Honda Jazz.\n\nCould come with premium features like digital driver’s display, sunroof and bigger touchscreen inside.\n\nExpected engine options include a dual-motor (petrol-electric) hybrid, 1.0-litre turbo-petrol and the 1.5-litre i-DTEC.\n\nAll the engines are expected to be BS6-compliant.\n\nExpected to launch in India after Auto Expo 2020.\n\nThe fourth-generation City, one of Honda’s bread and butter models, has always been one of the top three selling models in the midsize sedan segment. However, also being one of the oldest cars in its segment, it is starting to show its age, especially in front of the Verna facelift. Honda has now started work on the next-generation model, which has been spied in Ghaziabad and Pune. For its 2020 iteration, the City is expected to come with upmarket looks, premium features as well as a dual-motor hybrid powertrain that will first debut in the 2020 Jazz at the 2019 Tokyo Motor Show. Slated for a global unveil in November 2019 and an Indian launch after the Auto Expo 2020, here’s a quick refresher of what to expect from the 2020 Honda City.\n\nVisually, the design of the 2020 City is expected to be evolutionary as the glass area and silhouette look similar to the existing model. Notable design updates include split LED tail lamps and a redesigned tailgate. At the side, the character line has moved a tad higher up and the City comes with new alloy wheels. No spy pictures have managed to capture the front end of the 2020 City yet but we expect sleeker LED headlamps a la the Civic. The typical Honda chrome grille might be retained as is.\n\nNote: Jazz' interior used for representational purposes.\n\nThe interior is also a mystery for now but we expect it to borrow plenty of bits from the 2020 Honda Jazz’s upmarket-looking interior. Expect Honda to load it to the gills with features like a digital instrument display, again a la the Civic, a bigger touchscreen infotainment system with Android Auto and Apple CarPlay, sunroof, climate control, cruise control, steering-mounted audio controls, auto headlamps, rain-sensing wipers as well as keyless entry with push-button start.\n\nNote: Image used for representational purposes.\n\nUnder the hood, the 2020 City could come with three powertrain options. This includes the dual-motor hybrid powertrain, whose technical specifications are yet to be revealed, that’s set to debut in the upcoming Jazz. It is also expected to come with a 1.0-litre turbo-petrol unit that dishes out 120PS of power. The 2020 City is also expected to retain its 1.5-litre i-DTEC unit, albeit upgraded to meet BS6 emission norms. It develops 100PS of power and 200Nm of torque and can be had with a 6-speed manual. For India, we expect Honda to offer the 1.5-litre i-VTEC and i-DTEC units, albeit in its BS6 avatar. Just like the Amaze, the diesel unit is also expected to be offered with a CVT unit.\n\nThe 2020 Honda City is expected to debut in India after the Auto Expo 2020. Considering the updates, expect the upcoming model to be priced more than the current model, which retails from Rs 9.81 lakh (ex-showroom Delhi). When launched here, the 2020 Honda City will renew its rivalry with the Hyundai Verna, Maruti Suzuki Ciaz, Volkswagen Vento and the Skoda Rapid.", "description": "The Ciaz and Verna rival is expected to come with premium looks, upmarket features and a hybrid powertrain", "authors": [], "top_image": "https://media.zigcdn.com/media/content/2019/Oct/zw-honda-city-spy-2_300x225.jpg", "published_at": "2019-10-16"}