{"pub": "japantoday", "url": "https://japantoday.com/category/world/south-korean-justice-minister-offers-to-resign-over-scandal", "downloaded_at": "2019-10-14 06:36:38.675023+00:00", "title": "S Korean justice minister offers to resign over scandal", "language": "en", "text": "Pro-government supporters hold signs with pictures of Justice Minister Cho Kuk, before a rally supporting Cho in front of Seoul Central District Prosecutors' Office in Seoul, South Korea, on Saturday.\n\nSouth Korea's justice minister on Monday offered to step down amid an investigation into allegations of financial crimes and academic favors surrounding his family, a scandal that has rocked Seoul's liberal government and deeply polarized national opinion.\n\nThe minister, Cho Kuk, said in a statement that he was offering to resign to reduce President Moon Jae-in's political burden.\n\nMoon's office didn't immediately comment on whether Moon would accept Cho's offer. Kang Gi-jung, Moon's chief of staff, told reporters that the president would comment on Cho's resignation offer during a meeting with senior advisers later Monday.\n\nHuge crowds of Cho's supporters and critics have marched in South Korea's capital in recent weeks, demonstrating how the months-long saga over Cho has deepened the country's political divide.\n\nCho's statement came as state prosecutors continued to push forward with a criminal investigation into his university professor wife, brother and other relatives over allegations of dubious financial investments, fraud and creating fake credentials for his daughter that may have helped her enter a top university in Seoul and a medical school in Busan.\n\nCho, a law professor who for years cultivated an image as an anti-elitist reformist, has denied wrongdoing. But he said he couldn't push further as minister while ignoring the pain his family was going through.\n\n\"I concluded that I should no longer burden the president and the government with issues surrounding my family,\" Cho said in an emailed statement. \"I think the time has come that the completion of efforts to reform the prosecution would only be possible if I step down from my position.\"\n\nMoon's liberal Minjoo Party and Cho's supporters, who occupied streets in front of a Seoul prosecutors office for the fourth-straight weekend Saturday, have claimed the investigation is aimed at intimating Cho, who has pushed for reforms that include curbing the power of prosecutors.\n\nTens of thousands of counter protesters have rallied for weeks near Seoul's presidential office calling for Cho's ouster and arrest.\n\nIn South Korea, prosecutors have exclusive authority to indict and seek warrants for criminal suspects and exercise control over police investigative activities. They can also directly initiate criminal investigations even when there's no complaint.\n\nCritics say such powers are excessive and have prompted past conservative governments to use the prosecution as a political tool to suppress opponents and carry out vendettas.\n\nThe conservatives, now the opposition, say the ruling liberals are pressuring prosecutors over a legitimate criminal probe surrounding a key member of their government.\n\n© Copyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "South Korea's justice minister on Monday offered to step down amid an investigation into allegations of financial crimes and academic favors surrounding his family, a scandal that has rocked Seoul's liberal government and deeply polarized national opinion. The minister, Cho Kuk, said in a statement that he was offering to…", "authors": [], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/5e/45/93b056f5f48a5fee4e8aa17a3a451df4ed24/urn:publicid:ap.org:a1f33e57660544199c8260b1bc5dc81f.jpg", "published_at": "2019-10-14"}