{"pub": "vice", "url": "https://vice.com/en_us/article/j5yk78/women-have-pancakes-for-brains-says-recent-empowerment-seminar", "downloaded_at": "2019-10-22 13:21:06.879142+00:00", "title": "Women Have Pancakes for Brains, Says Recent 'Empowerment' Seminar", "language": "en", "text": "Men are like waffles, and women are like pancakes. Why? Because their brains are different!\n\nNo, that’s not some hack joke from some even hackier dude comedian’s standup set from 1993. That’s an actual thing some businesswomen were told at a presentation on female leadership in 2018.\n\nLast year, 30 female executives at mega-huge accounting firm Ernst & Young attended a nearly two-day long training seminar on how to succeed in a male-dominated workplace that focused entirely on how women created hostile work environments for themselves through their own behavior and appearances, as HuffPost reported on Monday.\n\nThe June 2018 seminar came only a few months after a female executive at the firm had filed a complaint against a male partner for sexual assault. Yet the training never addressed this or any of the other instance of workplace sexual assault and harassment, attendees told HuffPost senior reporter Emily Young, offering attendees tips on how their clothing and comportment could improve their experience in the office.\n\nThe whole thing is worth a read, but here are a few of the key tips, tricks, and other findings laid out by the training seminar. Here they are in order of “lol wut” to “I’m going to eat a knife”:\n\nLook hot (i.e., spend a lot of money on fancy haircuts, manicures, a new wardrobe, and a gym membership).\n\nIf you’re talking to a man, sit at an angle to him and cross your legs.\n\nDon’t talk to men in meetings unless you’re saying hyper agreeable shit like “Yes!” and “By the supreme buoyancy of mine own pendulous breasts, my lord, yes!” because confronting them in front of others will intimidate them.\n\nWomen’s brains are 6% to 11% smaller than men’s (a point made sans clarification that literal brain size has nothing to do with intelligence or ability)\n\nWomen’s brains are like pancakes because they soak up information, making it harder for them to focus. Men’s brains are like waffles because they’re better at compartmentalizing new things they’re learning into easy to manage squares.\n\nWell, I’ve lost my appetite forever. Here’s the full report.\n\nSign up for our newsletter to get the best of VICE delivered to your inbox daily.\n\nFollow Harron Walker on Twitter .", "description": "This leadership training that accounting firm Ernst & Young sent 30 women to last year sounds rough!", "authors": [], "top_image": "https://video-images.vice.com/articles/5dadf7905c1f5f000a320a3f/lede/1571682212683-GettyImages-167876237.jpeg?crop=1xw:0.8660740150637312xh;center,center&resize=1200:*", "published_at": "2019-10-21"}