{"pub": "cbc", "url": "https://cbc.ca/news/politics/peoples-party-nova-scotia-hogg-bernier-islam-social-media-posts-1.5315943", "downloaded_at": "2019-10-11 00:17:32.264892+00:00", "title": "People's Party won't take action against N.S. candidate who called Islam 'pure evil' | CBC News", "language": "en", "text": "Maxime Bernier's People's Party says it won't take action against one of its candidates in Nova Scotia who called Islam \"pure evil\" and \"not compatible with democracy\" in numerous social media posts.\n\nSybil Hogg, the PPC candidate for Sackville-Preston-Chezzetcook, made a series of posts on Twitter and Facebook with anti-Islam statements within the last year.\n\nThe posts include a response in March to a 2017 tweet from former Justice Minister Jody Wilson-Raybould, sent after the minister visited a mosque just days after the deadly Quebec City mosque attack. Hogg's response: \"Islam is pure evil. Islam has no place in Canadian society.\"\n\nIslam is pure evil. Islam has no place in Canadian society. <a href=\"https://t.co/Tp347kOF6C\">https://t.co/Tp347kOF6C</a> —@sybilfortheppl\n\nJohanne Mennie, executive director of PPC, told CBC News the party reached out to Hogg to \"understand the context within which she expressed herself\" and the candidate replied that she \"failed to draw the distinction between 'Islam' the religion and 'Islamism' or 'radical Islam.'\"\n\nAccording to the party, Hogg said her concern \"is and always has been radical Islam rather than Islam\" and that she believed it was time for a \"conversation about Islamism and Islamic entryism\" in Canada.\n\nWhen asked Wednesday night to clarify whether that response satisfied the party, the PPC confirmed it wouldn't be taking any action against her.\n\nAs of Thursday morning, none of Hogg's social media posts had been removed.\n\nAsked by CBC News about Hogg's comments and the party's decision, the National Council of Canadian Muslims said in a statement that it felt \"little need to comment on another ridiculous and ignorant position from a PPC candidate.\"\n\n\"We refuse to engage with a party that has made hate and division a central element of its platform — but more importantly, that 98 to 99 per cent of Canadians are rejecting as per the most recent polling,\" the statement said.\n\n\"This election has clearly shown thus far, as has the last election, that hate is a failed organizing principle in Canadian politics.\"\n\nThe party confirmed on Thursday that Bernier will appear with Hogg at a campaign event scheduled for Friday in Halifax.\n\n\"All our Nova Scotian candidates will be there,\" Mennie said.", "description": "Maxime Bernier's People's Party says it won't take action against one of its candidates in Nova Scotia who called Islam \"pure evil\" and \"not compatable with democracy.\"", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5316087.1570717673!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/sybil-hogg-maxime-bernier.jpg", "published_at": "2019-10-10"}