{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-armenia-usa-resolution/armenia-hails-u-s-move-to-recognise-armenian-genocide-a-century-ago-idUKKBN1X91XE", "downloaded_at": "2019-10-30 16:11:33.479014+00:00", "title": "Armenia hails U.S. move to recognise Armenian \"genocide\" a century ago", "language": "en", "text": "YEREVAN (Reuters) - Armenia on Tuesday praised the U.S. House of Representatives’ passage of a resolution recognising the mass killings of Armenians a century ago as “genocide”, a move denounced by Turkey as “null and void”.\n\n“I salute the historic U.S. Congress vote recognising the Armenian Genocide,” Armenian Prime Minister Nikol Pashinyan wrote on his Twitter account on Wednesday.\n\n“Resolution 296 is a bold step towards serving truth and historical #justice that also offers comfort to millions of descendants of the Armenian Genocide survivors”.\n\nThe Democratic-controlled House voted 405-11 for a resolution asserting it is U.S. policy to commemorate as genocide the killing of 1.5 million Armenians by the Ottoman Empire from 1915 to 1923. The Ottoman Empire was centred in present-day Turkey.\n\nThe vote marked the first time in 35 years that such legislation was considered in the full House, underscoring widespread frustration in Congress with the Turkish government on the part of both Democrats and President Donald Trump’s fellow Republicans.\n\nPredominantly Muslim Turkey, which has no diplomatic ties with neighbouring Armenia, says many Christian Armenians were killed in partisan fighting during World War One but denies that thus amounted to genocide. Ankara says there was no organised campaign to wipe out Armenians and no evidence of any such orders from the Ottoman authorities.\n\nArmenian Foreign Minister Zohrab Mnatsakanyan thanked the U.S. Congress for the decision.\n\n“Massive message against #denialism. Deep gratitude to each of 405 votes. Empowered to work anew for prevention of mass atrocities anywhere in the world,” he posted on Twitter.\n\nArmenians at home and abroad welcomed the resolution.\n\n“I’m very positive about the adoption of this resolution on Armenian genocide,” said Artur, a middle-aged resident of the capital Yerevan.\n\n“Wow Look at these incredible numbers!!! The U.S. just recognised the Armenian genocide!!!!” tweeted Kim Kardashian, a U.S. reality TV star with Armenian heritage.\n\nTurkey’s Foreign Ministry issued a statement condemning the resolution as “devoid of any historical or legal basis”. It added: “As a meaningless political step, its sole addressees are the Armenian lobby and anti-Turkey groups.”", "description": "Armenia on Tuesday praised the U.S. House of Representatives' passage of a resolution recognising the mass killings of Armenians a century ago as \"genocide\", a move denounced by Turkey as \"null and void\".", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-30"}