{"pub": "guardian", "url": "https://theguardian.com/film/2019/oct/18/official-secrets-review-keira-knightley-whistleblower", "downloaded_at": "2019-10-18 08:52:23.901074+00:00", "title": "Official Secrets review – Keira Knightley shines as a very British whistleblower", "language": "en", "text": "There’s something interestingly tough and forthright about this slow-burner from director and co-writer Gavin Hood. It is a beady-eyed spy drama that has shrewd things to say about the British establishment’s tendency to spite under pressure, about the eternal duality of cockup and conspiracy, about the Kafkaesque problems involved in defending yourself legally against a treason charge, and, importantly, about the kind of young, vulnerable people that we end up depending on to tell us how we are governed.\n\nOfficial Secrets shows that spy dramas from real life are very often not action thrillers such as Bond or Bourne or Homeland – or indeed Hood’s last movie, Eye in the Sky, from 2015 – but something more like nuclear-level office politics.\n\nFacebook Twitter Pinterest Nuclear-level office politics … Ray Panthaki, Matthew Goode and Matt Smith in Official Secrets. Photograph: IFC Films/Allstar\n\nIt is based on the true case of Katharine Gun, a translator working for the British security services at the GCHQ surveillance unit in Cheltenham. In 2003, she was astonished to receive an email making it plain she was expected to find out incriminating personal details in the lives of UN representatives from small countries so that they could be blackmailed into voting for the war in Iraq. Gun printed out the email, and passed it to an anti-war friend, and it eventually formed the basis of a sensational front-page scoop in the Observer.\n\nFacebook Twitter Pinterest The Observer’s front page on 2 March 2003.\n\nAlthough it did not stop the war, as Gun dreamed of doing, it played an important part in turning press and public opinion. Gun herself was prosecuted under the Official Secrets Act.\n\nKeira Knightley gives a focused, plausible and sympathetic performance as Gun, and the film shows that she is in many ways the classic whistleblower. She has an idealism, work ethic and professionalism that made her an excellent intelligence operative in the first place, and yet it is precisely these things that made her rebel. Most importantly of all, she is young – like Edward Snowden, or Chelsea Manning, or Sarah Tisdall, jailed in 1984 for revealing details about American cruise missiles in Britain. Gun is still young enough not to have made an ineradicable career investment in GCHQ or formed loyalty links to its upper reaches.\n\nThe working life of the Observer is boisterously and affectionately represented. Rhys Ifans plays renowned reporter Ed Vulliamy as a passionately angry critic of the government; Matt Smith plays Martin Bright – who wrote the original story – and Hanako Footman plays young journalist Nicole Mowbray, whose chaotic, innocent mistake in transcribing the email, replacing its American spellings with British ones, caused the story to be initially rubbished by online conspiracists in the US. Conleth Hill plays the Observer’s editor Roger Alton who, despite his pro-government line, comes out of this rather well. It is his honest lust for a good story that causes him to publish.\n\nBut these journalists’ lives are basically comfortable. Gun, on the other hand, is marched into a hair-raising inquisition at GCHQ, and then into a police station, and then informed that she can’t reveal details about her work to her defending counsel, and then finds that her Turkish asylum-seeker husband, Yasar (Adam Bakri), has been mysteriously shuffled up the list for imminent deportation.\n\nThe most intriguing relationship suggested by the film is that of the veteran human rights lawyer Ben Emmerson (Ralph Fiennes), who defended Gun, and his former colleague, the one-time liberal barrister Ken MacDonald (Jeremy Northam), who became the director of public prosecutions and with the decision of whether to press the charge against Gun, and how or if to make an example of her. What can have been the dynamic between these two men? The film depicts a kind of cordial wariness curdling into detestation.\n\nKeira Knightley: ‘Iraq was the first time I’d been politically engaged’ Read more\n\nIn 2019, we have arguably more complicated views on leaks and whistleblowing, now that the reputation of Julian Assange has clouded who we think of as the underdog hero. But Gun’s case is extraordinarily relevant; it shows a world that in some ways feels like yesterday and in other ways like a lifetime ago. It’s a world in which people store computer files on Zip drives, where a youthful-looking Tony Blair is interviewed on TV by David Frost and where the establishment was broadly, if unhappily, on board with supporting and joining the US military adventure in Iraq.\n\nThese are precisely the people who now urbanely accept that it was all wrong. The change of heart didn’t happen naturally. It happened because of people like Gun, of whom the film is a sharp, pertinent reminder.\n\n• Official Secrets is released in the UK on 18 October and Australia on 21 November.", "description": "Knightley gives a sympathetic performance as Iraq war whistleblower Katharine Gun in this shrewd and relevant spy drama", "authors": ["Peter Bradshaw"], "top_image": "https://i.guim.co.uk/img/media/faa9dfdb6343603744411c13f72fe5b36dc9de1a/0_227_3688_2213/master/3688.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctcmV2aWV3LTQucG5n&enable=upscale&s=bba05562dbb94d3e11f6d81310e8d80a", "published_at": "2019-10-18"}