{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/boeing-ceo-senate-737-max-testimony-opening-statement-2019-10", "downloaded_at": "2019-10-28 23:39:07.213340+00:00", "title": "Boeing CEO Dennis Muilenburg will admit to 'mistakes' when he faces Congress over the grounded 737 Max plane. Read his full opening statement", "language": "en", "text": "Boeing CEO Dennis Muilenburg will testify in front of the House and Senate this week over the company's 737 Max, which has been grounded since March, following the second of two fatal crashes attributed to an automated system on the plane, MCAS.\n\nIn his prepared opening statement before Tuesday's Senate committee — which Boeing released on Monday following reporting by Reuters — Muilenburg expresses sympathy for families of victims of the \"accidents,\" admits to \"mistakes\" and getting \"some things wrong,\" and details Boeing's efforts to fix the plane in order to prevent future crashes once it begins flying again.\n\nBoeing has faced criticism for prioritizing profit-oriented deadlines and sales over safety in designing the plane, and the FAA has been criticized for its lax oversight of the plane maker.\n\nVisit Business Insider's homepage for more stories.\n\nRead Boeing CEO Dennis Muilburg's opening statement to Congress about the 737 Max below:\n\nChairman Wicker, Ranking Member Cantwell, members of the Committee: good morning and thank you for inviting me to be here today.\n\nI'd like to begin by expressing my deepest sympathies to the families and loved ones of those who were lost in the Lion Air Flight 610 and Ethiopian Airlines Flight 302 accidents, including those who are here in the room today. I wanted to let you know, on behalf of myself and all of the men and women of Boeing, how deeply sorry I am. As we observe today the solemn anniversary of the loss of Lion Air Flight 610, please know that we carry the memory of these accidents, and of your loved ones, with us every day. They will never be forgotten, and these tragedies will continue to drive us to do everything we can to make our airplanes and our industry safer.\n\nMr. Chairman, I know that you and your colleagues have many questions about the 737 Max. My colleague John Hamilton, Chief Engineer for Boeing Commercial Airplanes, and I will do our best today to answer them. While the Ethiopian Airlines accident is still under investigation by authorities in Ethiopia, we know that both accidents involved the repeated activation of a flight control software function called MCAS, which responded to erroneous signals from a sensor that measures the airplane's angle of attack.\n\nBased on that information, we have developed robust software improvements that will, among other things, ensure MCAS cannot be activated based on signals from a single sensor, and cannot be activated repeatedly. We are also making additional changes to the 737 Max's flight control software to eliminate the possibility of even extremely unlikely risks that are unrelated to the accidents.\n\nWe have brought the very best of Boeing to this effort. We've dedicated all resources necessary to ensure that the improvements to the 737 Max are comprehensive and thoroughly tested. That includes spending over 100,000 engineering and test hours on their development. We've also flown more than 814 test flights with the updated software and conducted numerous simulator sessions with 545 participants from 99 customers and 41 global regulators. This process has taken longer than we originally expected, but we're committed to getting it right, and return-to-service timing is completely dependent on answering each and every question from the FAA.\n\nI have flown on two of the demonstration flights myself and seen first-hand the expertise and professionalism of our teams. Mr. Chairman, I could not be more confident in our solutions—and I could not be more grateful to the men and women who have worked so hard to develop and test these improvements always with safety at the forefront. When the 737 Max returns to service, it will be one of the safest airplanes ever to fly.\n\nDuring this process we have been working closely with the FAA and other regulators. We've provided documentation, had them fly the simulators, and helped them understand our logic and the design for the new software. All of their questions are being answered. Regulators around the world should approve the return of the Max to the skies only after they have applied the most rigorous scrutiny, and are completely satisfied as to the plane's safety. The flying public deserves nothing less.\n\nWe know that it's not just regulators that need to be convinced. We know the grounding of the Max is hurting our airline customers, their pilots and flight attendants, and most importantly, the people who fly on our airplanes. Our airline customers and their pilots have told us they don't believe we communicated enough about MCAS—and we've heard them. So we have partnered with customers and pilots from around the world as we've developed our solutions. We have welcomed and encouraged their questions and given them opportunities to test those solutions firsthand in simulators. And subject to regulatory approval, additional and enhanced training and educational materials will be available for pilots who fly the Max.\n\nWe have learned and are still learning from these accidents, Mr. Chairman. We know we made mistakes and got some things wrong. We own that, and we are fixing them. We have developed improvements to the 737 Max to ensure that accidents like these never happen again. We also are learning deeper lessons that will result in improvements in the design of future airplanes. As painful as it can be, the process of learning from failure, and even from tragedies like these, has been essential to the advances in airplane safety since the industry began roughly a century ago. And it is one of the reasons that travel on a large commercial airplane is the safest form of transportation in human history.\n\nMr. Chairman, this is something we must not lose sight of. Today and every day, over 5 million people will board a Boeing airplane and fly safely to their destination. Whether it's their first flight or their millionth mile, we want it to be a great experience—and most importantly, a safe one. Decades of work and innovation throughout the industry, as well as the oversight of the FAA, this Committee, and regulators around the world have reduced the risks of air travel by more than 95 percent over the last twenty years. But no number, other than zero accidents, is ever acceptable.\n\nFor 103 years, Boeing has been dedicated to making the world a safer and better place. Our founder, Bill Boeing, established our first safety council in 1917, the first full year of the company's existence, beginning a commitment to safety that we have carried forward as a core value ever since. The engineers who design our airplanes, the machinists who work in our factories, and the many others who contribute to the extraordinarily complex work of building and maintaining commercial airplanes do so with pride and honor. Ensuring safe and reliable travel is core to who we are. Our customers and the traveling public, including our own families, friends, and loved ones, depend on us to keep them safe. That's our promise and our purpose.\n\nBut we also know we can and must do better. We have been challenged and changed by these accidents, and we are improving as a company because of them. We established a permanent aerospace safety committee of our Board of Directors; stood up a new Product and Services Safety organization that will review all aspects of product safety and provide streamlined reporting and elevation of safety concerns; and strengthened our Engineering organization by having all engineers in the company report up through Boeing's chief engineer. We also are investing in advanced research and development in new safety technologies and are exploring ways to strengthen not just the safety of our company but our industry as a whole. We have a shared bond of safety across the entire aerospace community.\n\nWe recognize it is not just our airplanes and our company that needs to be supported and strengthened. We also must help rebuild the communities and families affected by these accidents. Our first step was our pledge of $100 million to them. We hired Ken Feinberg and Camille Biros, renowned experts in this area, to ensure families can access this money as quickly as possible. Of course, no amount of money can bring back what has been lost. But we can at least help families meet their financial needs. Our people also have donated more than $750,000 of their own money to these funds—a tremendous example of the giving spirit our teams consistently display in the communities where they live and work across the globe.\n\nMr. Chairman, I've worked at Boeing my entire career. It started more than 30 years ago when Boeing offered me a job as a summer intern in Seattle. I was a junior at Iowa State University studying engineering, having grown up on our family farm in Iowa. It's beautiful land with rolling hills where my siblings and I milked cows and baled hay. Our parents taught us the value of hard work, integrity, and respect for others. Back then, I drove my 1982 Monte Carlo from Iowa to Boeing's operations in Seattle, crossing the Rocky Mountains for the first time. I was awestruck at the opportunities I had to work on projects that mattered at the company that brought the Jet Age to the world and helped land a person on the moon. I was amazed by the people of Boeing. Today, I'm still inspired every day by what Boeing does and by the remarkable men and women who are committed to continuing its legacy.\n\nThese heartbreaking accidents—and the memories of the 346 lives lost—are now part of that legacy as well. It's our solemn duty to learn from them and change our company for the better. I can assure you that we have learned from this and will continue learning. We have changed from this and will continue changing. The importance of our work demands it.\n\nIn the months since the accidents, there has been much criticism of Boeing and its culture. We understand and deserve this scrutiny. But I also know the people of Boeing, the passion we have for our mission, and what we stand for. There are over 150,000 dedicated men and women working for Boeing around the world—and their commitment to our values, including safety, quality, and integrity, is unparalleled and resolute. No matter what, we will stay true to those values because we know our work demands the utmost excellence.\n\nOver the last few months, I've had the opportunity to visit many of our Boeing teams, talk about our safety culture, and gain ideas for how we can be better still. Last week, I saw our team in San Antonio—made up of 40 percent veterans—beaming with pride as they support the C-17 fleet for our men and women in uniform. Earlier, I talked with our people in Philadelphia building Chinook helicopters; in St. Louis testing F/A-18 Super Hornets; and in Charleston, South Carolina, and El Segundo, California, connecting the world with the 787 Dreamliner and advanced satellites. I've also met with our people in Huntsville, Alabama, and New Orleans, Louisiana, who are building the rocket that will return humans to the moon and then travel on to Mars and those at Kennedy Space Center, Florida, who are preparing to launch the CST-100 Starliner that will commercialize space travel. I've spent time also with our teams in Everett, Washington, who are testing the new 777X long-range jet and in Renton, Washington, where 12,000 amazing people pour their hearts into building the 737 Max. These are the people of Boeing. I wish you could all meet them. They change the world. They are Boeing.\n\nI'm here today, honored to serve as the leader of this incredible team—talented engineers, machinists and all those who design, build and support our products. I want to answer all of your questions and convey to the world that we are doing everything in our power to make our airplanes and our industry safer and prevent an accident like this from ever happening again.\n\nAnd, Mr. Chairman, you have my personal commitment that I will do everything I can to make sure we live up to that promise.\n\nThank you for listening, and I look forward to your questions.", "description": "In prepared opening remarks released Monday, Boeing's CEO expresses sympathy, admits to mistakes, and details efforts to fix the 737 Max.", "authors": ["David Slotnick"], "top_image": "https://image.businessinsider.com/5cc7342fb14bf4380f783b63?width=1200&format=jpeg", "published_at": "2019-10-28"}