{"pub": "breitbart", "url": "https://breitbart.com/news/the-latest-us-airstrikes-destroy-ammo-left-behind-in-syria", "downloaded_at": "2019-10-16 23:16:47.940394+00:00", "title": "The Latest: US airstrikes destroy ammo left behind in Syria", "language": "en", "text": "WASHINGTON (AP) — The Latest on President Donald Trump and Syria (all times local):\n\n6:35 p.m.\n\nTwo U.S. fighter jets launched airstrikes Wednesday to destroy ammunition that was left behind when American forces left a cement factory south of Kobani, Syria.\n\nThe factory had served as a coordination center for the U.S.-led coalition and Kurdish forces in the fight against the Islamic State group.\n\nU.S. Army Col. Myles Caggins, a spokesman for the coalition, says the F-15E fighter jet strikes were pre-planned and destroyed ammunition stored at the Lafarge Cement Factory.\n\nHe says all coalition personnel and “essential tactical equipment” had left the base before the strike.\n\nMost of the 1,000 U.S. forces in Syria are being withdrawn over the coming days and weeks because of the Turkish invasion into northern Syria and the attack on Kurdish forces.\n\n__\n\n5:30 p.m.\n\nPresident Donald Trump described former Defense Secretary James Mattis as “the world’s most overrated general” during a meeting with Congressional leaders Wednesday to discuss Turkey’s incursion into Syria.\n\nThat’s according to a Democrat familiar with the meeting who offered a readout of the contentious meeting on condition of anonymity.\n\nTrump, according to the person, was presented at one point with a quote from Mattis warning of an Islamic State group resurgence if the U.S. does not continue to apply pressure. But Trump responded with the insult, criticizing Mattis for not being “tough enough.”\n\nTrump also said during the meeting that 100 Islamic State prisoners had escaped following the U.S. withdrawal from the region, but insisted they were the “least dangerous” ones.\n\nAsked whether that was true, current Defense Secretary Mark Esper said he didn’t know.\n\n__\n\n5:20 p.m.\n\nA few days after President Donald Trump ordered U.S. troops out of northern Syria, he wrote Turkish President Recep Tayyip Erdogan telling him that if he invaded Syria he would be remembered as a “devil.”\n\nTrump started his brief letter on Oct. 9 suggesting that they “work out a good deal.”\n\nThe president told Erdogan he did not want to be responsible for “slaughtering thousands of people.” And Trump said he didn’t want to impose sanctions that would cripple Turkey’s economy if Ankara invaded Syria to battle Kurdish forces.\n\nTrump told Erdogan that history would look favorably on him if he proceeded humanely. Trump wrote: “It will look upon you forever as the devil if good things don’t happen. Don’t be a tough guy. Don’t be a fool!”\n\n__\n\n5:10 p.m.\n\nHouse Republicans are blaming House Speaker Nancy Pelosi for walking out of a briefing with President Donald Trump. They are calling her actions “unbecoming.”\n\nTrump met Wednesday at the White House with members of Congress to discuss Turkey and Syria. Democrats say Trump insulted Pelosi, calling her a “third-rate politician.” Democratic leaders left shortly thereafter.\n\nHouse Minority Leader Kevin McCarthy is trying to pin the blame on Pelosi, saying she stormed out of the meeting.\n\nHe is calling it a pattern of behavior on Pelosi’s part, disregarding that it was actually Trump who walked out of a meeting with Democratic leaders on the issue of infrastructure spending last May.\n\nMcCarthy says the meeting was very productive for the lawmakers from both parties who remained.\n\n__\n\n4:35 p.m.\n\nDemocratic congressional leaders say they walked out of a briefing with President Donald Trump on Turkey after hearing little but insults from Trump.\n\nThe Senate’s top Democrat, Chuck Schumer, says Trump insulted House Speaker Nancy Pelosi by calling her a “third-rate politician.” Schumer says the meeting “was not a dialogue. This was sort of a diatribe, a nasty diatribe not focused on the facts.”\n\nPelosi tells reporters outside the White House that “what we witnessed on the part of the president was a meltdown.”\n\nPelosi claims Trump appeared visibly “shaken up” after House passage of a bipartisan condemnation of his decision to order the withdrawal of American troops from northern Syria.\n\nPelosi says Democrats “couldn’t continue in the meeting because he was just not relating to the reality of it.”\n\n___\n\n4:15 p.m.\n\nHouse Speaker Nancy Pelosi says the White House has canceled a classified briefing about Syria for House members.\n\nThe California Democrat says scrapping the meeting prevents Congress from learning about “the dangerous situation” caused by President Donald Trump’s withdrawal of U.S. troops from northern Syria.\n\nTurkey has invaded the region.\n\nPelosi says she’s “deeply concerned” because lawmakers have a right to be informed about such decisions.\n\nA Democratic congressional aide says the White House said it couldn’t provide administration officials to conduct Thursday’s planned briefing.\n\nTwo Senate aides say a classified briefing for senators was also canceled. One aide says it’s because key administration officials were traveling to Turkey.\n\nThe aides spoke on condition of anonymity because they weren’t authorized to discuss the matter publicly.\n\n—Associated Press writer Alan Fram\n\n___\n\n3:45 p.m.\n\nSenate Republicans are sticking up for the U.S.-allied Syrian Kurds after President Donald Trump defended his pullout of American troops, which cleared the way for the Turkish assault on the Kurds.\n\nGOP Leader Mitch McConnell calls the partnership “a terrific alliance” that set the Islamic State group back and says he is “sorry we are where we are.”\n\nSen. Roy Blunt of Missouri says Turkish President Recep Tayyip Erdogan “has not been a reliable ally. The Kurds have been a reliable ally.”\n\nSen. Joni Ernst of Iowa adds, “We really have left behind and abandoned a strategic partner, the Kurds, who stood by our men and women in uniform in the fight” to defeat IS.\n\nAt the White House, Trump defended his decision, saying the Kurds were “no angels.”\n\n__\n\n2:45 p.m.\n\nThe House has overwhelmingly voted its bipartisan condemnation of President Donald Trump’s withdrawal of American forces from northern Syria.\n\nDespite stark divisions over Democrats’ Trump impeachment inquiry, Democrats and Republicans banded together Wednesday and approved a nonbinding resolution by 354-60 vote.\n\nThe resolution states Congress’ opposition to the troop pullback and says Turkey should cease its military action in Syria. And the measure says the White House should present a plan for an “enduring defeat” of the Islamic State group.\n\nMany worry that IS may revive itself as Turkish forces attack Syrian Kurds holding the extremists.\n\nThe House debate was extraordinary for the intensity of lawmakers’ opinions.\n\nRepublicans called the troop withdrawal “disastrous” and a “catastrophe.” Democrats criticized Trump directly, with Rep. Seth Moulton saying Trump “has taken the side of dictators and butchers.”\n\n___\n\n1:55 p.m.\n\nPresident Donald Trump says members of the Islamic State group who were being held in prisons by Kurdish fighters in Syria have been deliberately released in an effort to make him look bad.\n\nBut senior U.S. officials are casting doubt on those claims. Those officials say some Syrian Kurdish forces have moved north to fight Turkish troops who launched an attack across the border against the Kurds. The U.S. officials say other Kurds have stayed to guard the detention centers that hold thousands of IS militants.\n\nThe officials say the U.S. doesn’t have good on-the-ground information about what’s going on in some of the detention centers as American forces pull back from the border region. The officials say they believe only a small number of detainees have escaped.\n\nThese officials aren’t authorized to public discuss ongoing operations in Syria and are speaking on condition of anonymity.\n\n—Associated Press writer Lolita C. Baldor.\n\n___\n\n1:35 p.m.\n\nPresident Donald Trump says things are “very nicely under control” in northern Syria where Turkish forces are fighting Syrian Kurds who were aligned with the U.S. against the Islamic State group.\n\nTrump tells reporters at the White House that Syrian Kurdish fighters that Turkey considers terrorists are more dangerous than IS.\n\nTurkey believes the Syrian Kurds who fought alongside the U.S. are linked to the Kurdistan Workers’ Party, known as the PKK, which it considers terrorists.\n\nTrump is defending his decision to pull U.S. forces out of the Syrian border region where brutal fighting continues.\n\nAt a news conference with Trump, Italy’s president says Italy is deeply concerned about the Turkish offensive in Syria and says it will “offer new space” to IS.\n\n___\n\n12:40 p.m.\n\nPresident Donald Trump’s decision to pull U.S. troops from northeastern Syria, essentially abandoning the Syria Kurd fighters who fought alongside U.S. against the Islamic State group, is drawing criticism from Republicans on Capitol Hill.\n\nSen. Lindsey Graham, one of Trump’s closest allies, says Trump’s decision will allow IS to remerge. The South Carolina Republican says Trump will “be held accountable.”\n\nGraham says Trump’s decision “is against all sound military advice.” Graham says he hopes Trump “will reconsider, stop the bloodshed and reset the table before it’s too late.”\n\nGraham says that if Trump continues along those lines, “then our foreign policy is in a very bad spot in the Middle East and to those who think the Mideast doesn’t matter to America, remember 9/11 we had that same attitude on 9/10 2001.”\n\nAnother Republican senator, Florida’s Marco Rubio, tells reporters that he doesn’t know what can be done to undo the harm that’s resulted from the withdrawal. Rubio says “there are some mistakes that are not easy to reverse. And there are some that are irreversible.”\n\n___\n\n10:45 a.m.\n\nPresident Donald Trump says U.S. troops are “largely out” of a region of Syria where Turkish forces are attacking Kurdish fighters.\n\nTurkey launched a military operation against Kurdish fighters allied with the U.S. after Trump pulled troops from the region this month. As he met Wednesday with Italy’s president, Trump said: “If Syria wants to fight to take back their land, that’s up to them and Turkey.”\n\nTrump adds: “There’s a lot of sand that they can play with.”\n\nBut as Trump defends removing troops from northeastern Syria, he’s talking up his recent decision to send more troops to Saudi Arabia to help the kingdom defend against Iran.\n\nTrump says the U.S. is sending missiles and “great power” to the Saudis, and adds: “They’re paying for that.”", "description": "WASHINGTON (AP) — The Latest on President Donald Trump and Syria (all times local): 6:35 p.m. Two U.S. fighter jets launched airstrikes Wednesday to", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/16/c020c5_trump-39840-kevin-mccarthy-mike-mccaul-house-minority-leader-kevin-mccarthy-640x335.jpg", "published_at": "2019-10-16"}