{"pub": "fox", "url": "https://foxnews.com/opinion/tucker-carlson-elizabeth-warren-frontrunner-journalists-taxes-healthcare", "downloaded_at": "2019-10-17 14:33:34.390821+00:00", "title": "Tucker Carlson: Elizabeth Warren has 'woke journalist' allies who don't want you to ask questions", "language": "en", "text": "It is, fair to say, a brand new Democratic field. For the better part of the year, former Vice President Joe Biden dominated the polls and the other candidates in the race attacked him from the left, which is weird to see.\n\nBiden still believed in law enforcement and international borders, and he opposed forced bussing, along with virtually every other American. So he was obviously one of those right-wing extremists from the Obama administration.\n\nThat's what they were telling you on the debate stage. It was bizarre.\n\nBIDEN RAMPS UP ATTACKS ON WARREN, DISMISSES HER AS A FELLOW FRONT-RUNNER\n\nThankfully, that line of attack is over because Joe Biden's presidential campaign itself is in effect over. Nobody thinks Biden is going to be the Democratic nominee. Elizabeth Warren is the front-runner now. That's not contested. The race is now hers to lose.\n\nSo during Tuesday night's debate, her rivals on the stage decide to help her do just that -- lose.\n\nPete Buttigieg, South Bend, Ind. mayor: Your signature, senator, is to have a plan for everything ... except this.\n\nSen. Amy Klobuchar, D-Minn.: At least Bernie is being honest here in saying how he is going to pay for this and that taxes are going to go up. And I'm sorry, Elizabeth, but you have not said that.\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nJoe Biden: I'm going to say something that is probably going to offend some people here, but I'm the only one in this stage that has gotten anything really big done.\n\nKlobuchar: And I appreciate Elizabeth's work. But again, the difference between a plan and a pipe dream is something that you can actually get done.\n\nBiden: I went on the floor and got you votes. I got votes for that bill. I convinced people to vote for it.\n\nKlobuchar: I want to give a reality check here to Elizabeth because no one on this stage wants to protect billionaires. Not even the billionaire wants to protect billionaires.\n\nBeto O'Rourke: Sometimes, I think that Senator Warren is more focused on being punitive or pitting some part of the country against the other.\n\nIf Elizabeth Warren can't even explain her own signature plan to rearrange the entire American health care system, she can't win.\n\nShe is punitive? When Beto O'Rourke, Mr. Armed Federal Agents Coming to Your House, calls you out for divisive attacks, it's time to pay attention. And in fact, he does make a fair point.\n\nThe main reason Warren has surpassed Bernie Sanders in the hearts of primary voters despite pretty close economic programs is that she is the one far more willing to descend into the filth of identity politics.\n\nBernie is an ideologue. There are some things that he just won't say. Elizabeth Warren will say anything.\n\nRecently, she tweeted this: \"Every person deserves to be treated with dignity and respect. And that starts with using correct pronouns. I'm Elizabeth. My pronouns are she/her/hers.\"\n\nIn case you were wondering -- in case there was any question at all -- that kind of posturing is central to Elizabeth Warren's campaign. She is happy to tell you, and often does, that you're worth less, or you're worth more, based on how you were born.\n\nUnfortunately, that works right now in the Democratic Party.\n\nOne thing Elizabeth Warren is not willing to say, however, is how much her single-payer government health care plan will cost -- trillions of dollars, obviously. Nobody disputes that. Nobody disputes that.\n\nAnd in fact, as a mathematical matter, there's no way to raise that kind of money without hiking taxes on the middle class. It's simple arithmetic. And yet for some reason, Warren refuses to admit that.\n\nMarc Lacey, national editor for the New York Times: You have not specified how you're going to pay for the most expensive plan \"Medicare-for-All.\" Will you raise taxes on the middle class to pay for it? Yes or no?\n\nSen. Elizabeth Warren, D-Mass.: So I have made clear but my principles are here and that is costs will go up for the wealthy and for big corporations, and for hard-working middle-class families, costs will go down.\n\nLacey: Mayor Buttigieg, you say Senator Warren has been \"evasive\" about how she is going to pay for \"Medicare-for-All.\" What's your response?\n\nButtigieg: Well, we heard it tonight. A yes or no question that didn't get a yes or no answer.\n\nSave that tape.\n\nThere are a lot of moments in debates that seem like a huge deal at the time. Everyone is yapping about them. But in the end, it turned out to be completely meaningless. This is not one of those moments.\n\nHealth care is always at the top of voters' concerns and so are taxes for that matter. If Elizabeth Warren can't even explain her own signature plan to rearrange the entire American health care system, she can't win.\n\nEven a post-debate MSNBC panel acknowledged as much.\n\nClaire McCaskill, former U.S. senator: I thought she seemed a little petulant at times when she was being challenged.\n\nEugene Robinson, Washington Post columnist: You think, a little?\n\nMcCaskill: A little.\n\nRobinson: As Bernie Sanders says she just won't go there, and she was pummeled for it.\n\nKarine Jean-Pierre, senior adviser and national spokeswoman for MoveOn.org: They attacked her and she was uncomfortable. She did not handle it very well.\n\nSo was it really that bad for Elizabeth Warren on Tuesday night? We'll see.\n\nShe definitely got better treatment than Joe Biden got. Journalists don't like Joe Biden. Biden has zero allies in America's \"woke\" newsrooms. Warren, by contrast, has plenty of allies pretending to be journalists.\n\nFor example, on Wednesday morning, NYU \"journalism\" professor Jay Rosen -- the guy whose name often pops up, despite no talent whatsoever -- demanded that reporters stop asking specific questions about Warren's policies.\n\nAgain, a journalism professor telling you not to ask questions. Rosen tweeted: \"The 'make Elizabeth warren say she would raise taxes on the middle class' question should be a credibility killer. For the journalists who keep asking it.\"\n\nNow amazingly, Margaret Sullivan of the Washington Post agreed with that. She wrote this: \"Journalists are kindly doing President Trump's work for him when they insist on trying to pin down Senator Elizabeth Warren to declare she would raise taxes to fund Medicare-for-All. Of course, it's legitimate to dig into the costs, but not in a way that creates a nice GOP campaign ad.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nDid you listen to that? Two journalists telling you, if the answer hurts Democrats, don't ask the question. Don't tell your readers or viewers what the truth is if it increases the chances that Donald Trump could get reelected.\n\nIs that journalism? No, it's pure propaganda. It is the definition of propaganda. Jay Rosen, journalism professor, telling journalists not to ask questions.\n\nUnbelievable.\n\nAdapted from Tucker Carlson's monologue from \"Tucker Carlson Tonight\" on Oct. 16, 2019.\n\nCLICK HERE TO READ MORE FROM TUCKER CARLSON", "description": "If Elizabeth Warren can't even explain her own signature plan to rearrange the entire American health care system, she can't win.", "authors": ["Tucker Carlson", "Tucker Carlson Currently Serves As The Host Of Fox News Channel S", "Fnc"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/17/694940094001_6095412430001_6095409062001-vs.jpg", "published_at": "2019-10-17"}