{"pub": "washingtonpost", "url": "https://washingtonpost.com/science/2019/10/01/dolphins-are-swimming-mating-even-giving-birth-potomac", "downloaded_at": "2019-10-02 00:35:06.775738+00:00", "title": "Dolphins are swimming, mating and even giving birth in the Potomac", "language": "en", "text": "\n\nCommon bottlenose dolphins surface in the Potomac River near Reedville, Va. on Sept. 25. (Parker Michels-Boyce for The Washington Post)\n\nREEDVILLE, Va. — Five decades ago, President Lyndon B. Johnson declared the polluted Potomac River a “national disgrace.” Although it is now much cleaner, officials in Washington are still not convinced the water is safe for humans to swim in.\n\nBut many miles downriver, where the Potomac widens to lakelike proportions as it flows toward the Chesapeake Bay, it teems with a different species of swimmers whose presence may signal healthier waters: dolphins.\n\nDuring the past four years, researchers who study the common bottlenose dolphins swimming this part of the Potomac have hardly been able to keep up with their numbers. Dolphins are easily identified by their distinct fins or marks on their bodies, and in 2015, scientists identified about 200 individuals in one section of river off Virginia’s Northern Neck. Now they have counted well over 1,000 dolphins, which sometimes congregate in groups of more than 200.\n\nBut an even more unusual development in this effort to understand the dolphins in “the nation’s river” came in August, when researchers with the project, based at Georgetown University, witnessed evidence of a dolphin birth. It was only the third documented observation of a wild dolphin birth, and those present say they hope it makes area residents view the Potomac differently.\n\n“There are dolphins here, and there’s breeding and birthing going on, and this is connected to D.C. — such a populated, urban area,” Ann-Marie Jacoby, associate director of the Potomac-Chesapeake Dolphin Project, said on a recent morning while scanning the lower Potomac from the 18-foot skiff that serves as a research vessel. “You follow it further down and there’s all this wildlife here. And what people are doing up there, it does affect wildlife. They are directly linked to this oasis.”\n\n\n\nA newborn dolphin, later named Gwendolyn Mink by researchers, swims alongside its mother, Patsy Mink. Researchers with a Georgetown University-based dolphin study witnessed the immediate aftermath of the baby's birth, only the third-ever documented wild dolphin birth. (Photograph taken under NMFS Permit No. 19403. Potomac-Chesapeake Dolphin Project/Ann-Marie Jacoby)\n\nSun glittered on calm water as the boat, driven by a research assistant, motored alongside three dolphins that popped up and down as they swam south. Bald eagles and pelicans flew above. Occasionally, the dolphins approached to “bow ride” waves created by the front of the boat — perhaps for fun, though no one knows for sure.\n\nThat’s not the only unknown when it comes to common bottlenose dolphins. They are indeed common, occupying temperate and warm oceans worldwide, and they are one of the best-studied marine mammals. But that isn’t saying much, said Janet Mann, a Georgetown biologist who founded the Potomac project and has studied bottlenose dolphins off Western Australia for three decades.\n\n“There’s so much we don’t know. It’s a challenge of studying marine mammals, in that they dive, and you can’t see everything they’re doing,” Mann said. “There’s still lots of mystery around understanding their lives and what it means to be a dolphin, and what are they doing with their big brains. … I think that’s what fascinates people about these animals.”\n\nKey questions about the Potomac dolphins: Is their population growing? If so, is it because the river is cleaner? How do warming waters affect their movements?\n\n\n\nAnn-Marie Jacoby, co-director of the Potomac-Chesapeake Dolphin Project, looks for wild dolphins along the Potomac River near Reedville, Va. (Parker Michels-Boyce for The Washington Post)\n\nNewspaper accounts indicate the animals (known then as porpoises) swam near Alexandria in the 19th century. “The recent visit of porpoises to the harbor here has not been paralleled since 1843,” read one snippet in the “Alexandria Affairs” section of The Washington Evening Star on July 17, 1883.\n\nBut sightings have been scarcer in recent times, and outside the Beltway. Mann, one of the world’s foremost dolphin experts, didn’t even know they used the Potomac until spotting them on the 2012 day she closed on a vacation cottage near Reedville.\n\n“So much is known about every single species in the Potomac and Chesapeake, except for the charismatic megafauna — bottlenose dolphins,” Mann said. “That just astounded me.”\n\nAn outbreak of cetacean morbillivirus that killed thousands of dolphins along the Mid-Atlantic from 2013 to 2015 convinced Mann and her colleagues that the animals deserved study. The dolphins that spend time in the area are believed to represent two or three migratory and “residential” populations, and understanding where individuals hail from and how they interact could shed light on the spread of disease, Mann said.\n\n\n\nResearchers use onboard GPS to search for the dolphins along specific transects and record dolphin locations on the Potomac River near Reedville, Va. (Parker Michels-Boyce for The Washington Post)\n\nA pilot study launched in 2015, and the project now surveys the dolphins from May through October in about 14 square miles of the Potomac. It has documented dolphins as far north as the Potomac River Bridge, about 50 miles south of Washington.\n\nThe researchers take photos of each animal for a sort of dolphin yearbook; those are also added to a vast Mid-Atlantic Bottlenose Dolphin Catalog managed by Duke University, where Jacoby is a doctoral student. Individual dolphins’ actions — from traveling to foraging to mating, which Mann said she has seen lots of — are recorded, making the Potomac project one of the largest dolphin behavior studies in the world, Mann said.\n\nGiven their proximity to Washington, Mann decided to name them after political and historical figures. The first was Benjamin Franklin, because, she explained, “he was a scientist! And a politician and a great thinker. It had to be Benjamin Franklin.”\n\nAbout 600 others have since been named — after presidents, members of Congress and Supreme Court justices, as well as abolitionists and suffragists, because “otherwise it would be all old white men,” Mann said. She said the project makes sure to keep things bipartisan.\n\n“These are the nation’s dolphins, in a sense,” she said.\n\nThe three dolphins Jacoby and her two assistants, Casey Marker and Haley Land-Miller, spotted in late September included a regular, Paul Davis Ryan, named for the former Speaker of the House. PDR, as he or she is known — Jacoby is not certain it is male — has a curved fin with two notches at the top and a scoop at the base.\n\n\n\nA common bottlenose dolphin surfaces in the Potomac River near Reedville, Va. (Parker Michels-Boyce for The Washington Post)\n\nJacoby and a Georgetown graduate student were present at the dolphin birth on Aug. 17. It occurred near the Virginia town of Lewisetta, where waters are well within the Potomac but still brackish. About 50 dolphins the researchers were tracking were headed downriver when Jacoby spotted a cloudy, rust-colored trail on the port side of the skiff.\n\nJacoby was puzzled. Had the boat hit a dolphin? Was a dolphin injured? Then it occurred to her.\n\n“I’m like, ‘Guys, look for a tiny, tiny baby! Look for a tiny baby!” Jacoby recalled. And there one was, right next to an adult female Jacoby didn’t recognize.\n\nMost of what is known about dolphin births comes from seeing them in captivity: After being folded in the womb, newborns’ fins are bent to side and their bodies marked with lines. This dolphin sported lines, and its fin was wobbly and tilted. It was very small — less than three feet long — and its chin hit the water when it surfaced, kind of like a toddler stumbles while learning to walk.\n\nJacoby raced to photograph it, a task made difficult by choppy waters and the abundance of dolphins.\n\n“Zachary Taylor was there. George W. Bush was there. Jimmy Carter was there,” Jacoby said, and then paused to think. “Oh, uh, Hillary Clinton was there! I believe Chelsea Clinton was there. I think Alexander Hamilton was there, too.”\n\nMann, however, was not there. She was in Washington and learned of the birth via a text message from Jacoby.\n\n“I was a little upset that I wasn’t there with them — definitely envious,” said Mann, who never saw a birth in 32 years of watching dolphins in Australia. But she was also elated, she added. “It’s an incredibly rare event.”\n\nThe research team later named the mother dolphin after the late Patsy Mink, the first woman of color elected to Congress. The baby was named after her daughter, Gwendolyn Mink, a feminist policy scholar and author.\n\nBoth Mann and Jacoby have spotted the baby in the weeks since, swimming the Potomac where it was born.\n\nRead more:\n\nA final bid to save the world’s rarest porpoise ends in heartbreak. Is extinction next?\n\nWhat makes dogs so special and successful? Love.\n\nNorth America has lost 3 billion birds in 50 years", "description": "Researchers say hundreds of common bottlenose dolphins spend time in outside-the-Beltway waters of the iconic — and increasingly clean — Potomac River.", "authors": ["Karin Brulliard", "Reporter", "Editor For Animalia", "October At Pm", "Karin Brulliard Is A National Reporter Who Writes About Animals. Previously", "She Was An International News Editor", "A Foreign Correspondent In South Africa", "Pakistan", "Israel", "A Local Reporter. She Joined The Post In"], "top_image": "https://www.washingtonpost.com/resizer/LQ22zKH7BmeWZaJp1qS4ytXyeUg=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FQT6BMXAMEI6TPT7JTEFAF6DN4.jpg", "published_at": "2019-10-01"}