{"pub": "yahoo", "url": "https://finance.yahoo.com/news/3-post-earnings-stocks-buy-154829076.html", "downloaded_at": "2019-10-27 04:23:31.950922+00:00", "title": "3 Post-Earnings Stocks to Buy Now", "language": "en", "text": "Holding a stock through earnings can be highly profitable. It can also be calamitous. At times though, a stock report’s aftermath can offer investors a stronger risk-adjusted purchase when the news and reaction align in just the right way. And right now, Tesla Motors (NASDAQ:TSLA), PayPal (NASDAQ:PYPL) and Chipotle (NYSE:CMG) are stocks to buy following earnings after cheers from Wall Street.\n\nWe’d like to believe otherwise, but how a stock reacts to earnings is a crapshoot at best. For one, there’s broader market sentiment and perception to consider. And of course earnings on an absolute basis or results versus consensus and whisper views, as well as guidance from the company are factors every stock faces.\n\nAll told, there’s a lot going on with a company’s earnings report. What’s more, knowing which of these items or combined influences will hold the most weight for any given quarter is an elusive and losing battle when it comes to which stocks to buy in front of an earnings confessional. But don’t despair.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nI’m not trying to frighten investors during earnings season. It’s actually a great period to watch for companies of interest, to see if those stocks deliver on their promises, and to see how Wall Street reacts to the report. And if the aftermath looks like TSLA, PYPL or CMG, investors have a short list of stocks to buy with greater confidence.\n\n\n\n\n\nStocks to Buy: Tesla (TSLA)\n\nStocks to Buy #1: Tesla (TSLA) Stock More\n\nTesla is the first of our stocks to buy following earnings. The EV manufacturer and battle ground stock shocked Wall Street this week with a surprise profit that toppled analyst views and announced solid delivery numbers for its third quarter. Adding fuel to TSLA stock’s 18% price spike, the company updated investors with positive news that its new factory in Shanghai is ahead of schedule.\n\nTechnically, TSLA stock is back on the radar for buying as the post-earnings reaction took shares out of a ten-month long correction and into the right side of a new bullish basing pattern above the 50% Fibonacci level. With shares still off 11% on the year and monthly stochastics supporting the price action, Tesla is a stock to buy.\n\nTSLA Stock Strategy: Put TSLA stock on the radar for purchase if a simple pullback over the next several sessions takes hold and a new higher low price pivot within this stock’s uptrend is confirmed.\n\n\n\n\n\nPayPal (PYPL)\n\nStocks to Buy #2: PayPal (PYPL) Stock More\n\nPayPal is our next stock to buy. The payment processing champion offered investors better-than-forecast results this week when it reported on Wednesday. The confessional’s highlights include the company’s easy profit beat of 9 cents on earnings of 61 cents per share of PYPL stock, 19% year-over-year revenue growth, solid account growth and positive margin expansion.\n\nTechnically speaking, PYPL stock’s bullish reaction to the report has formed a weekly chart hammer candlestick. With the reversal finding support in-between a 50% Fibonacci level tied to 2018’s cycle low and its prior base-on-base resistance and stochastics signaling a bullish oversold crossover, PayPal shares are in position for purchase.\n\nPYPL Stock Strategy: Buy PYPL next week on price confirmation of the hammer low. If need-be, use a blended stop-loss below $99 to exit and look to take partial profits following a breakout to new highs.\n\n\n\n\n\nChipotle (CMG)\n\nStocks to Buy #3: Chipotle (CMG) Stock More", "description": "Holding a stock through earnings can be highly profitable. It can also be calamitous. At times though, a stock report's aftermath can offer investors a stronger risk-adjusted purchase when the news and reaction align in just the right way. And right now, Tesla Motors (NASDAQ:TSLA), PayPal (NASDAQ", "authors": ["Chris Tyler"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Q95aavLURKTm.EZc75u8ww--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/c6e671df209b20579af846c9dd5cf949", "published_at": "2019-10-25"}