{"pub": "yahoo", "url": "https://news.yahoo.com/eu-sees-risk-inmates-possibly-133744790.html", "downloaded_at": "2019-10-30 14:36:03.878032+00:00", "title": "EU sees risk as inmates possibly radicalised in prison walk free", "language": "en", "text": "BRUSSELS, Oct 30 (Reuters) - Thousands of inmates about to be freed from European prisons at the end of their terms may have been radicalised as Islamist militants in detention and pose a risk, the European Union security chief said on Wednesday.\n\nReturning fighters from Syria are also a concern, EU security commissioner Julian King told a news conference.\n\nOver the last two decades Europe has been the target of several Islamist militant assaults, with a rise in deadly attacks from 2015, when more than 130 people were killed in Paris in a coordinated operation in mid-November.\n\nSecurity forces in EU countries have since arrested hundreds of militants, with about 1,100 still being held on terrorism charges, King said.\n\nKing said that twice that many, who are detained for other crimes, may also have been radicalised in European jails.\n\n\"We face a challenge from those who have been prosecuted and locked up in prison for terrorist offences over recent years coming to the end of their term and being released. There are some thousands of such individuals in our prisons across Europe,\" King said.\n\n\"The Jihadi threat has not gone away,\" he said referring to the Arabic term for holy war. \"There is no way we can lower our guard,\" he added.\n\nIn addition to this domestic challenge, Europe also faces security risks posed by EU citizens who fought in the Middle East for the so-called Islamic State (IS) or with other Islamist militant groups and could now return to the continent, exploiting the volatile situation in Syria.\n\n\"Obviously the events in Syria at the moment do not make that any easier,\" King said.\n\nTurkey this month launched a military offensive on Syria's Kurdish-controlled north-east region, where most IS militants are locked up.\n\nAbout 500 European fighters were detained in Syria, King said. The Kurds have repeatedly warned that they could no longer guarantee the surveillance of IS detainees in their jails because of the Turkish offensive.\n\nKing said that up to 1,400 children with one or two parents holding the citizenship of one of the 28 EU countries were also in Syria, of which half are in prison.\n\nSome of them are currently being repatriated by EU states, but legal challenges have for long delayed operations. (Reporting by Francesco Guarascio @fraguarascio, Editing by William Maclean)", "description": "Thousands of inmates about to be freed from European prisons at the end of their terms may have been radicalised as Islamist militants in detention and pose a risk, the European Union security chief said on Wednesday.  Returning fighters from Syria are also a concern, EU security commissioner Julian", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-30"}