{"pub": "rt", "url": "https://rt.com/usa/471776-katie-hill-nazi-nudes-affairs", "downloaded_at": "2019-10-24 23:51:02.665365+00:00", "title": "Katie Hill hell breaks loose as GOP and Dem supporters clash over her naked pics, Nazi tattoo and affair with staffer", "language": "en", "text": "Photos of Democratic congresswoman Katie Hill smoking a bong in the nude - while sporting a Nazi symbol tattooed on her crotch - and making out with a staffer have thrown both Left and Right into a frenzy of blame and shame.\n\nHill is pictured in photos leaked on Thursday naked and grinning, wielding a bong and sporting an iron cross, a symbol used by the Germans during World War II, tattooed above her genitals. Another shows her nude and combing the hair of female staffer Morgan Desjardins, with whom she and her husband allegedly had a ‘throuple’ relationship.\n\nAlso on rt.com Presumption of innocence? Dems call for Kavanaugh’s impeachment amid new sex assault allegations\n\nThe California representative is under investigation by the House Ethics Committee for her alleged affair with another staffer - this one her legislative director, Graham Kelly. Unlike her affair with Desjardins, which began before she was elected, that relationship violates House rules. Hill allegedly left her husband for Kelly and has blamed her “abusive” ex for trying to humiliate her - as well as her opponents for exploiting her tumultuous love life for political gain. She has admitted her relationship with Desjardins - she’s openly bisexual - but denied the affair with Kelly.\n\nLeaked texts from the trio suggest Hill became estranged from her husband and Desjardins after moving to Washington in January, leaving them both psychologically distraught. They also shared concerns about Hill’s alcohol use, suggesting it was affecting her work and mental health.\n\nUnsurprisingly, the steamy saga set social media alight. Democrats cried foul over Hill’s persecution, which has been an ongoing item in the conservative press, and insisted she wouldn’t be receiving this treatment if she was a Republican. Republicans shot back, accusing Hill of hypocrisy over her trash-talking Brett Kavanaugh, the Supreme Court justice whose nomination sparked protests after several women accused him of sexual assault decades in the past.\n\n“We’re still shaming grown women are we?” one user complained. Several made comparisons to Trump and suggested Hill was still doing pretty well, by that measure.\n\nWhat Katie Hill does in the privacy of her bedroom is HER business, not that of anyone else.\n\n\n\nYou @GOP types forfeited the right to scream family values the day you nominated a pussy-grabber for President. You besmirch your faux religion by supporting an amoral asshole! — Mike Sarzo (Text VOTE to 954-954) (@mikesarzo) October 24, 2019\n\nI dont want to hear any republican criticize Katie Hill when Trump has 23 women accusing him of rape and assault — Tess 🌊🌊🌊 (@teslagre4) October 24, 2019\n\n“Katie Hill will be gone soon, but if she were a Republican she would have been gone on day one,” a GOP sympathizer opined. Many harped on the hypocrisy.\n\nThis is the make or break point\n\n\n\nIf she isn't forced to resign by DEMOCRATS\n\n\n\nThen I NEVER WANT TO HEAR SHIT from them about what a Republican has done\n\n\n\nEVER!!!!!!!\n\n\n\nDemocrat Rep. Katie Hill (CA)https://t.co/EdxfbTGAmH — Robbus Deplorablus (@hickorymtnman) October 24, 2019\n\nKatie Hill? No surprise-\n\nDemocrat Nazis always accuse you of the things they are doing themselves 🙄🙄🙄 pic.twitter.com/AeBwBiiVVk — MAGA Immigrant (@RealCindy9) October 24, 2019\n\nPlenty were disgusted by both parties’ reaction to the affair.\n\nI’m seeing a lot of “what would happen to Katie Hill if she were a Republican?”\n\n\n\nShe’d probably be celebrated for “owning the libs.”\n\n\n\nSince she’s a Dem, she’ll be shamed by hypocritical assholes and forced to resign instead. But keep your “both sides” bullshit flowing. — Craig Groff-Folsom (@craiggrossom) October 24, 2019\n\nAnd others found a way to make it about…Russia?\n\nConflicted about the Katie Hill story.\n\n\n\nIn a way it feels like a public shaming, the kind of stuff that happens to Republicans and is just nasty.\n\n\n\nIn another sense, her lifestyle made her a blackmail target for Russia. — Mike Cernovich (@Cernovich) October 24, 2019\n\nThink your friends would be interested? Share this story!", "description": "Photos of Democratic congresswoman Katie Hill smoking a bong in the nude - while sporting a Nazi symbol tattooed on her crotch - and making out with a staffer have thrown both Left and Right into a frenzy of blame and shame.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5db2171d85f5402aa26aecb9.jpg", "published_at": "2019-10-24"}