{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/paul-ince-compares-liverpool-sir-20645372", "downloaded_at": "2019-10-18 04:50:11.215694+00:00", "title": "Paul Ince says Liverpool can dominate like Sir Alex Ferguson's great Man Utd sides", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nPaul Ince has compared Liverpool to the Manchester United team he joined in 1989 - which went on to dominate English football for two decades.\n\nAhead of a tantalising clash between England's two most successful sides at Old Trafford this Sunday, former United and Liverpool midfielder Ince can see parallels between Jurgen Klopp's European champions and Sir Alex Ferguson's all-conquering outfit.\n\nUnited are struggling for form going into Sunday's clash, languishing just two points above the Premier league relegation zone having won just two of their opening eight league games.\n\nFor Liverpool, though, it's a completely different story, with Klopp's side eight points clear of second-placed Manchester City at the top of the league with a 100% record.\n\nLiverpool's storming start to the season follows on from their Champions League triumph in June, and Ince reckons that success can spur them on to become the dominant force they were back in the 1970s and 80s.\n\n(Image: Getty Images)\n\nInce was speaking on the Blood Red podcast , and first he addressed how far United had fallen since Ferguson retired after their last Premier League title triumph in 2013.\n\n“I think it shows you what a special manager Alex Ferguson was,\" he said.\n\n\"It shows you in the seven years since 2013 when he left how special he was and how great it was and how he was great at building teams but still winning things at the same time.\n\n“In 1989 we finished 12th in the league but we still won the FA Cup and the year after that we finished about eighth but we still won the Cup Winners Cup against Barcelona .\n\n(Image: Sunday Mirror)\n\n“That was a turning point for us - once we realised we could beat Barcelona, the next year in training from pre-season, it was just a different mindset, different belief that we can go and win the title, and I think it could be the same for Liverpool.\n\n“That’s what’s so great about Liverpool with Klopp, they have given him time to build a team.”\n\nLiverpool had their own Barcelona moment last season, beating the Catalan giants 4-0 at Anfield to overturn a 3-0 first-leg deficit and secure a place in the Champions League final in Madrid, where they beat Tottenham .\n\nIt followed a near-miss in the Premier League, with Liverpool losing out to City by just one point on the final day having lost only once in the league all season.\n\n(Image: AFP/Getty Images)\n\n\"What it shows me now is that after beating Tottenham in the Champions League there is, I think, the combination of that (belief) and then losing out to City last year, in the last game of the season,\" said Ince.\n\n“I think that’s giving them a greater belief to believe that they can go and win it this year.\n\n“They’ve started off that way, the record that they keep winning games... it’s phenomenal. You have to learn from your experiences, your good and your bad, and that’s what we did at Manchester United .”", "description": "Ince says Champions League triumph has given Liverpool belief to dominate - just like Fergie's early trophy wins did for United", "authors": ["Gareth Bicknell", "Image", "Getty Images", "Sunday Mirror", "Afp Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20645381.ece/ALTERNATES/s1200/0_Manchester-United-v-Liverpool-Premier-League.jpg", "published_at": "2019-10-18"}