{"pub": "yahoo", "url": "https://news.yahoo.com/judge-summons-drug-company-ceos-153100829.html", "downloaded_at": "2019-10-18 01:25:13.795707+00:00", "title": "Judge summons drug company CEOs to discuss opioid settlement: source", "language": "en", "text": "The logo of Teva Pharmaceutical Industries is seen during a news conference in Tel Aviv\n\nBy Nate Raymond\n\n(Reuters) - The chief executives of the three largest U.S. drug distributors and a drugmaker have been summoned to appear before a federal judge to discuss a proposal to resolve thousands of lawsuits alleging they fueled the U.S. opioid crisis, a person familiar with the matter said on Thursday.\n\nThe order by U.S. District Judge Dan Polster in Cleveland, Ohio, came as distributors McKesson Corp, Cardinal Health Inc, AmerisourceBergen Corp and Israel-based drugmaker Teva Pharmaceutical Industries Ltd moved to reach a deal ahead of a trial before Polster that begins on Monday.\n\nThose companies, along with Johnson & Johnson, have been negotiating a settlement they value at roughly $50 billion that would allow them to resolve 2,600 lawsuits brought nationwide, mostly by states and localities, people familiar with the matter said.\n\nAll of those companies except J&J are set to be defendants in the trial before Polster, who oversees the bulk of the litigation. Polster has pushed for a deal that could \"do something meaningful to abate this crisis\".\n\nThe companies have been discussing the settlement with four state attorneys general whose cases are not before Polster, sources told Reuters on Wednesday. Lawyers for the local governments say they have not decided whether to back it.\n\nLate Thursday, Ohio Attorney General Dave Yost raised concerns about the proposed deal with his counterparts in North Carolina, Pennsylvania, Tennessee and Texas, who are leading negotiations.\n\nYost, in a letter seen by Reuters, said he feared the four attorneys general were not consulting with other states. He said that threatened to repeat the problems of a proposed $10 billion settlement with OxyContin maker Purdue Pharma LP, which has divided states between supporters and opponents of the deal.\n\nHe also said opioid settlement funds must go to addressing the crisis, not general budget purposes. He worried attorneys for the local governments could be paid hundreds of millions of dollars for their work, and he wanted that reduced.\n\nYost also said only a few states filed claims against the drug distributors and it would be unfair to treat all states the same in a settlement.\n\nThe letter was posted on the cleveland.com website and Reuters also received a copy.\n\nUnder the proposal, McKesson, AmerisourceBergen and Cardinal Health would pay $18 billion over 18 years and J&J would pay $4 billion, according to two people familiar with the matter.\n\nTeva has offered to give away medications it values at $15 billion as part of an overall deal it values at roughly $28 billion under which it would also provide distribution services, the people said.\n\nSpokespeople for Cardinal CEO Michael Kaufmann and AmerisourceBergen CEO Steven Collis declined to say if they would be in Cleveland on Friday. Representatives for Teva CEO Kare Schultz and McKesson CEO Brian Tyler did not respond questions of whether they would be in court.\n\nOpioids were responsible for roughly 400,000 overdose deaths in the United States from 1999 to 2017, according to the U.S. Centers for Disease Control and Prevention.\n\nThe lawsuits accuse drug manufacturers of deceptively marketing opioids in ways that downplayed their risks, and drug distributors of failing to detect and halt suspicious orders. They deny wrongdoing.\n\nThe cases prompted OxyContin maker Purdue Pharma LP to file for bankruptcy protection in September after reaching a tentative deal it says is worth at least $10 billion to resolve the cases.\n\n\n\n\n\n(Reporting by Nate Raymond in Boston and Tom Hals in Delaware; Editing by Bill Berkrot and Lincoln Feast)", "description": "The order by U.S. District Judge Dan Polster in Cleveland, Ohio, came as distributors McKesson Corp, Cardinal Health Inc, AmerisourceBergen Corp and Israel-based drugmaker Teva Pharmaceutical Industries Ltd moved to reach a deal ahead of a trial before Polster that begins on Monday.  All of those companies", "authors": ["Nate Raymond"], "top_image": "https://s.yimg.com/uu/api/res/1.2/MYcdzMpHMqysRtF9MQ6p3g--~B/aD0zMDA7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/01ab8922d66ef097ec2bf036add4afe0", "published_at": "2019-10-17"}