{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/05/italys-coalition-enemies-open-way-matteo-salvini-return", "downloaded_at": "2019-09-05 10:30:10.904729+00:00", "title": "Italy's new coalition sworn in as analysts cast doubt over longevity", "language": "en", "text": "Italy’s new coalition government between the centre-left Democratic party and the anti-establishment Five Star Movement has been sworn in, with many analysts casting doubt on how long it will last.\n\nThe two parties are longstanding enemies. Should they fail, new elections might lead to them both being punished and open the way for a comeback by Matteo Salvini, leader of the far-right League.\n\nThe coalition looks likely to break from some of the hardline immigration measures pushed by Salvini, interior minister in the last government.\n\nItaly was plunged into chaos last month when Salvini withdrew the League from its fractious alliance with the Five Star Movement (M5S), as he sought to exploit his party’s popularity to force a snap election and seize the prime ministership. But the former interior minister, whose tactics have dented his popularity in recent weeks, had not banked on M5S teaming up with the Democratic party (Partito Democratico, or PD).\n\nAfter two weeks of negotiations, on Wednesday, the prime minister, Giuseppe Conte, announced his team of ministers. The list includes Roberto Gualtieri, an influential PD member of the European parliament, as economy minister. The M5S leader, Luigi Di Maio, will be foreign minister. Luciana Lamorgese, a veteran of the interior ministry, in charge of planning refugee and migrant reception centres in northern Italy, has succeeded Salvini as interior minister.\n\nMany challenges lie ahead. On Tuesday, the parties published a 26-point programme that would underpin the government. At the top of the list was a commitment to use the forthcoming budget to help to stimulate economic growth, but also a promise that it would not endanger public finances.\n\nItaly has the second-largest debt burden in the EU as a proportion of economic output, and the pact called for greater flexibility from Brussels to overcome the “excessive rigidity” of existing budget rules.\n\nEmphasising social justice, the two parties pledged to introduce a minimum salary, avoid a planned VAT sales rise and boost spending on education, research and welfare. The programme also called for a web tax on multinationals and the creation of a public bank to help boost development in the south.\n\nMassimiliano Panarari, a political science professor at Luiss University in Rome, said of the coalition: “It is a government that is surely favoured by Brussels. But in order to carry out the programme it will need to govern until 2022. So far, this seems very difficult.”\n\nOthers felt that the prospect of Salvini forming a far-right government with Brothers of Italy, a party with a neo-fascist lineage, would hold the new coalition together.\n\nFranco Pavoncello, professor of political science and president of John Cabot University in Rome, said: “I believe that the spectre of fresh elections with Salvini at 38% favourability in the polls helped to encourage this alliance between PD and M5S. It is difficult to predict how long it will last, but certainly the prospect of M5S and PD together in the opposition with Salvini as prime minister is one of the reasons they will stay together.”\n\nHe added: “M5S knew it wasn’t a good idea to forge an alliance with the League, with a party even more extreme than they are. They knew that in order to survive they had to shed their anti-establishment tendencies. With M5S losing ground, the League slowly began to capture their votes. Italy was brought to the edge with the preceding M5S/League government. Now there is an opportunity for a more reasoned politics, far from acrimonious language and propagandistic showmanship”.", "description": "Government sworn in on Thursday likely to break from hardline immigration policy", "authors": ["Lorenzo Tondo"], "top_image": "https://i.guim.co.uk/img/media/9373fd511cc25cb2e91eadd595c421e78378a6d4/0_115_3967_2381/master/3967.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=3c5af7cdad033ed6a67494ade6be1e9e", "published_at": "2019-09-05"}