{"pub": "independent", "url": "https://independent.co.uk/news/uk/crime/manchester-arena-attack-terror-trial-hisham-muhammad-chicken-shop-bury-a9121761.html", "downloaded_at": "2019-09-26 21:05:40.923131+00:00", "title": "Manchester Arena attack didn't happen, chicken shop worker accused of plotting drone attack tells court", "language": "en", "text": "A chicken shop worker accused of plotting to attack the British army with a drone, told a court he does not believe the 2016 Manchester Arena terror attack took place/\n\nHisham Muhammad is accused of collecting and building an assortment of weapons including a tomahawk, a machete and bear claws in his three bedroom home in Bury, Greater Manchester.\n\nIt is also alleged that the 25-year-old Chicken Cottage worker also attempted to build a prototype drone attachment that used lollipop sticks to drop projectiles on targets.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nLondon's Old Bailey heard that he researched police and military bases, including the Castle Armoury Barracks in his hometown, which he visited before his arrest last June.\n\nCounter terror police apprehended the 25-year-old after his landlord began to get suspicious about his activities, the court heard.\n\nMr Muhammad denied engaging in conduct in preparation for acts of terrorism.\n\nHis interest in Isis after the Manchester Arena attack, which left 22 people dead, was innocent, he claimed.\n\n\"I wanted find out the truth of what actually happened” he told the court. “I didn't believe it had happened and people were saying yes it did.\"\n\nAsked if he found sufficient evidence for the reality of the attack, he replied: \"No. I watched two different videos of what was happening and each person was saying something different. I thought it was the Government trying to take away people's rights.\"\n\nMr Muhammad also claimed Isis was \"created by the American Government to take away the rights of Muslims\".\n\nHe said he did not regard himself as a \"gullible person\" and technology could be used to make \"anything look real\".\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nHe told jurors he liked to listen to Islamic music, and looked at a video entitled My Revenge \"out of curiosity\".\n\nQuestioned on his views on radical Islam, he said: \"It's basically barbaric. I don't think it's right. Radical in terms of Islamic State, I don't agree with it, killing of innocent people.\"\n\nHe went on to tell jurors that, when not at work, he liked to \"challenge\" himself by designing things like a \"coconut hammer\", although he denied they were in preparation for an attack.\n\nThe Bermudan national admitted making £8,000 from a bogus online escort agency scam - but said most of the money was sent overseas to his family.\n\nMuhammad’s cousin, Faisal Abu Ahmad, 24, has pleaded not guilty to failing to alert authorities of the alleged attack plan.\n\nAdditional reporting by Press Association.", "description": "A chicken shop worker accused of plotting to attack the British army with a drone, told a court he does not believe the 2016 Manchester Arena terror attack took place/  Hisham Muhammad is accused of collecting and building an assortment of weapons including a tomahawk, a machete and bear claws in his three bedroom home in Bury, Greater Manchester.", "authors": ["Vincent Wood"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2017/05/27/12/manchester-police-saturday.jpg", "published_at": "2019-09-26"}