{"pub": "axios", "url": "https://axios.com/electric-vehicles-are-outstripping-the-supply-of-charging-stations-024a7be4-b185-4111-829f-9c51afd3ab31.html", "downloaded_at": "2019-10-23 15:59:11.831663+00:00", "title": "Electric vehicles are outstripping the supply of charging stations", "language": "en", "text": "What's happening: Electrify America, Tesla and a recently announced GM–Bechtel partnership, among others, are building thousands of electric charging stations, most near commercial activity, along major interstates or at transit hubs.\n\nRoughly 150,000 U.S. gas stations could also offer electric charging. The petroleum lobby has largely resisted this, but a new Chevron charging pilot could signal change.\n\nBut, but, but: Over a million electric vehicles have been sold in the U.S. As of March, there were 63,303 charging stations, a large percentage of them in California.\n\nThe annual growth rate of public charging stations has plateaued at around 20% over the last 5 years, but the ratio of EVs per station is climbing from about 6 EVs per station in 2012 to an expected 28 per station in 2021.\n\nEven if charging stations are widely distributed, regional and local electricity suppliers will need to find a way to meet demand for EVs charging at unpredictable rates and times without causing brownouts or blown transformers.\n\nWhat we're watching: Battery improvements will certainly help, and “quick-charge” speeds are dropping to mere minutes.\n\nSuper-fast charging, though, is expected to demand huge amounts of power. A station with 20 fast-charging units could draw as much as six megawatts of power — the same as a typical small town.\n\nDynamic induction, the wireless charging of moving vehicles, could also be useful for stretches of highway.\n\nAVs will theoretically be able to navigate to charging stations or charge through induction, which could help to distribute energy demand\n\nHome-based systems — which most EV drivers currently use for the majority of their charging — can also take pressure off of charging stations.\n\nThe bottom line: EV penetration could be stifled without significant, large-scale investment in charging infrastructure and advanced charging technology that can keep pace with EV adoption.\n\nJim Barbaresso is SVP of intelligent transportation systems at HNTB, an infrastructure advisory firm.", "description": "A lack of infrastructure investment could slow EV adoption.", "authors": [], "top_image": "https://images.axios.com/msPuePgUHQqn8hfId7u-VRKaMVQ=/0x0:1920x1080/1920x1080/2019/06/04/1559674192817.jpg", "published_at": "2019-06-05"}