{"pub": "cnn", "url": "https://cnn.com/2019/10/07/investing/christine-romans-economy-downturn/index.html", "downloaded_at": "2019-10-07 20:10:29.035396+00:00", "title": "Christine Romans: The drip, drip, drip of bad news for the US economy continues", "language": "en", "text": "That is the sound of lowered economic growth forecasts and warnings that the president's trade war with China will stagnate the US economy.\n\nYes, the economy is growing and the unemployment rate is at a 50 year low. But business leaders and economists are growing increasingly alarmed that the president's trade war with China spread beyond manufacturing sector.\n\nDrip.\n\nA survey released overnight from the National Association for Business Economics lowered growth expectations for next year to below 2%, citing protectionism, trade uncertainty and slowing global growth. NABE's forecasts matter. These are the economists who work for companies. Their forecasts go straight to their bosses in the C-suite who make spending and hiring plans.\n\nDrip.\n\nThe New York Fed has lowered fourth-quarter GDP to just 1.3% . Its forecast for the year is 2%, far below the 4 and even 5% growth the president promised his tax and regulation cuts would unleash.\n\nDrip.\n\nManufacturing job creation has stalled. The very sector the president promised to save with his tariffs and tough talk is shedding jobs. In September, manufacturing lost 2,000 jobs. Over the past year, Pennsylvania has lost more than 7,700 jobs in manufacturing and Wisconsin has shed more than 5,200.\n\nManufacturing jobs growth stalls. pic.twitter.com/LnFmg1Q3yK — Christine Romans (@ChristineRomans) October 4, 2019\n\nBut wait! The NABE predicts the US economy will stall, but not tip into recession. And the jobless rate is at a 50-year low of only 3.5%. \"Impeach that,\" Trump trade adviser Peter Navarro told CNN Friday\n\nThat's the bull case, to be sure. But the drips continue and economists worry the jobs numbers are a lagging indicator. In a note to clients this morning, Ian Shepherdson of Pantheon Macroeconomics: \"The unexpected drop in unemployment in September is noise, not signal; the trend will soon rise.\" Adding, \"Payroll growth will be down to just 50K or so by the end of the year; outright declines are possible.\"\n\nThe president blames the Fed and a strong dollar. The Federal Reserve could cut interest rates later this month to try to contain the damage.\n\nBut business leaders blame trade uncertainty and global growth. They want a resolution of the trade war with China. Quickly.\n\nA new round of talks expected to begin this week in Washington.", "description": "\"Drip ... drip ... drip ....\"", "authors": ["Christine Romans", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191007073541-china-us-shipping-trade-war-0914-super-tease.jpg", "published_at": "2019-10-07"}