{"pub": "bbc", "url": "https://bbc.com/news/uk-49943566", "downloaded_at": "2019-10-05 04:50:01.521368+00:00", "title": "Australian-British blogger and boyfriend freed from Iran jail", "language": "en", "text": "Image copyright Jolie King Image caption British-Australian Jolie King and Austrialian Mark Firkin have been released from prison in Iran\n\nA British-Australian woman and her Australian boyfriend have been released from an Iranian jail, Australia's government has said.\n\nJolie King, who also holds a UK passport, and Mark Firkin were detained in Tehran earlier this year for reportedly flying a drone without a permit.\n\nA second British-Australian, Kylie Moore-Gilbert, is still in prison.\n\nAustralia's foreign minister said talks to secure her release were ongoing.\n\nMarise Payne told reporters that it was \"with some enormous relief\" that she could announce Jolie King and Mark Firkin \"have been released and returned\".\n\nThe pair were detained after entering Iran as part of a major trip across Asia to the UK - they were blogging about it for thousands of followers on social media.\n\nMs Payne confirmed Ms Moore-Gilbert remained in prison, where she has been for almost a year having reportedly been given a 10-year sentence.\n\n\"Very long-term negotiations\" were taking place to secure the release of the Cambridge-educated academic, Ms Payne added.\n\nMs Moore-Gilbert was most recently a lecturer in Islamic Studies at Melbourne University.\n\nEarlier, Iran's semi-official news agency Fars reported that the Islamic Republic's judiciary spokesman Gholam Hossein Esmayeeli confirmed all three were detained for spying.\n\nMedia playback is unsupported on your device Media caption Why one mother's personal plight is part of a complicated history between Iran and the UK\n\nThe two British-Australian women were believed to be the first British passport holders without dual Iranian nationality to be held in the country in recent years.\n\nTheir detention echoes that of British-Iranian mother Nazanin Zaghari-Ratcliffe, who has been imprisoned since 2016 after being convicted of spying, which she denies.\n\nOn Friday it was announced that Mrs Zaghari-Ratcliffe would allow her daughter Gabriella, five, to return to the UK to begin schooling.\n\nThe mother and daughter were said by family to have travelled together to Iran to visit relatives before she was detained.", "description": "British-Australian Jolie King and her Australian boyfriend Mark Firkin have been returned home.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/44B1/production/_108758571_ddf1bd4f-1a4d-4af6-85d8-24aeffef4a09.jpg", "published_at": "2019-10-05"}