{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/19/WS5daa6d86a310cf3e35571660.html", "downloaded_at": "2019-10-19 10:57:44.967431+00:00", "title": "Chinese advantages in tech to benefit other continents", "language": "en", "text": "By Cheng Yu | China Daily | Updated: 2019-10-19 09:57\n\niFlytek's AI-enabled robot sits the test of China's national medical licensing examination. [Photo provided to China Daily]\n\nInternet-based technologies including artificial intelligence are gaining momentum in China, and are expected to benefit more people not only in the country but across the world, industry insiders said.\n\n\"New momentum is emerging in China with the rollout of 5G, AI and the industrial internet,\" said Wu Hequan, an academician at the Chinese Academy of Engineering in Beijing.\n\nIn the AI sector, Wu noted, voice recognition and facial recognition technologies are already widely used in China with the rapid development of high-tech companies, from startups such as Yitu Technology to market leaders such as iFlytek.\n\nThe Hefei, Anhui-based iFlytek, for instance, has optimized its years of expertise in AI-enabled voice recognition and machine-based translation products.\n\n\"AI is a crucial driver of industrial upgrading and technological advancement in China. This year will see AI creating real value in more sectors,\" said Liu Qingfeng, the company's chairman.\n\nOne of its products to offer translation services is popular among foreigners.\n\nThe smart translator can recognize voices and automatically transcribe oral speech into text. It can also translate between languages in real time.\n\nChina is implementing a national AI development plan that aims to build a 1 trillion yuan ($141.1 billion) AI core industry by 2030, which is supposed to stimulate as much as 10 trillion yuan in related businesses.\n\nA report from consultancy firm PwC forecasts that AI will contribute $15.7 trillion to the global economy in 2030 and China will be among the biggest beneficiaries of that, with a 26 percent boost to its GDP in 2030.\n\nDuring this process, AI is also driving more companies to bring benefits to people. China's TAL Education Group, for instance, has been leveraging AI to help more students in rural areas of China.\n\n\"We are striving to advance education through internet-based technologies. We are also promoting large-scale, low-cost and high-quality online education to help more students across China,\" said Michael Wan, executive president of TAL.\n\nThe company has developed an AI-enabled smart class solution called Wisroom, which works like a futuristic class where teachers can teach online while students' reactions including voice, gestures and facial expressions are analyzed in real time.\n\nBy May, such intelligent classrooms were used in three projects in the Ningxia Hui autonomous region to help improve local education quality.", "description": "Internet-based technologies including artificial intelligence are gaining momentum in China, and are expected to benefit more people not only in the country but across the world, industry insiders said.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/19/5daa6d86a310cf3e97a1fee9.jpeg", "published_at": "2019-10-19"}