{"pub": "zdnet", "url": "https://www.zdnet.com/article/dell-samsung-and-zebra-launch-rugged-devices-as-firstnet-spurs-upgrade-cycle", "downloaded_at": "2019-10-29 23:57:13.081628+00:00", "title": "Dell, Samsung, and Zebra launch rugged devices as FirstNet spurs upgrade cycle", "language": "en", "text": "I killed Panasonic’s Toughbook laptop with a cup of coffee ZDNet's Tiernan Ray tells Karen Roby that Panasonic’s Toughbook 55 laptop is a fine machine that's built to withstand rugged environments, but he wouldn’t recommend pouring hot coffee on it, something he now regrets. Read more: https://zd.net/2P2wWJB\n\nRugged devices are hitting the market at a rapid clip. It is one of the few spaces that the smartphone, tablet, and PC market is showing growth in, and FirstNet is part of the reason why.\n\nThe flurry of rugged devices landing this week is hard to miss. According to TechNavio, the rugged handheld device market will grow at a compound annual growth rate of 8% through 2023. Twenty-nine percent of market demand comes from industrial companies.\n\nMeanwhile, the rollout of FirstNet, a public-private network built by AT&T and designated for first responders, is leading to the launch of \"FirstNet Ready\" devices. Another moving part is that rugged devices are being built on Android in the enterprise. Dell, Samsung, and Zebra are a few of the companies rolling out new rugged devices.\n\nToss in the public sector demand and the International Association of Chiefs of Police Conference this week in Chicago, and you have a spate of rugged device launches.\n\nSee also Latest computer news at CNET\n\nKey players include:\n\nPanasonic, which specializes in rugged devices with its Toughbook franchise.\n\nHoneywell\n\nZebra\n\nDatalogic\n\nAnd now multiple PC vendors are looking at the ruggedized market. Why? PC vendors have the scale and can lower prices for ruggedized devices, which have lower sales volume but still improve average selling prices for their portfolios. HP and Dell have rugged device options.\n\nHere's a look at the recent rollouts of ruggedized devices.\n\n(Image: Dell)\n\nDell launched its Latitude 7220 Rugged Extreme Tablet with Wi-Fi 6, LTE and FirstNet access. The device adheres to the MIL-STD-810G/H specification and can fend off the dust, water, and damage from extreme temperatures. The Latitude 7220 Rugged Extreme Tablet has 8th generation Intel CPUs, Qualcomm modems and FirstNet access. Dell's rugged tablet starts at $1,899 well below what a Panasonic Toughbook's $3,000 or more price.\n\nSamsung launched the Samsung Galaxy XCover FieldPro that has push-to-talk capability and storage that complies with data storage regulations. The device is designed for the public sector, transportation and field service technicians to name a few. the XCover FieldPro is also designed to handle drops, shocks and extreme temperatures. Samsung will also rely on its Knox Manage and Knox Configure platform.\n\nZebra Technologies launched its Android-based TC57 and TC77 enterprise mobile computers as well as its ET56 tablets. Zebra also launched a Windows L10 and XSLATE R12 tablets. All of the devices now work with FirstNet. For good measure, Zebra also announced a 300,000 device implementation with the US Postal Service.\n\nDisclosure: ZDNet may earn a commission from some of the products featured.\n\nRelated from ZDNet and TechRepublic:", "description": "The rugged device category has something the rest of the hardware industry doesn't: Growth. Enter a flurry of devices for extreme environments.", "authors": ["Larry Dignan"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2019/10/29/fbc941f1-863a-445c-ba31-4d58680fc38c/thumbnail/770x578/2b68d8b18532a50c39a7e64386757fff/dell-latitude-7220t-ctb-00000ff090-bk.jpg", "published_at": "2019-10-29"}