{"pub": "townhall", "url": "https://finance.townhall.com/columnists/bryanperry/2019/09/16/are-ultralong-treasury-bonds-the-next-big-thing-n2553142", "downloaded_at": "2019-09-16 23:12:49.520944+00:00", "title": "Are Ultra-Long Treasury Bonds the Next Big Thing?", "language": "en", "text": "The topic of whether the United States will start issuing 50- and 100-year Treasuries in the next few years, if not sooner, has started a genuine dialogue.\n\nWhat has been reserved for very special emerging market situations, like the 7.9% 100-year government bond that Argentina sold in 2017 to raise $2.75 billion amid optimism about a new administration, is now becoming commonplace among developed countries. A case in point is the United Kingdom issuing a 50-year Gilt in July 2018 with a 3.50% coupon at a lofty premium that matures in 2068.\n\nAs European sovereign yields have gone negative, the yield on this particular issue has plummeted 69.25% year to date (YTD) alone — trading with a current yield of just 0.934% as of Sept. 8. Bear in mind that U.K. 10-year Gilts are yielding 0.50%. This means investors are buying the century bonds at a hefty premium to par value just to capture a 3.50% coupon rate in government-backed debt.\n\nThe advent of quantitative easing (QE) among every major central bank around the globe which has fashioned skyrocketing sovereign debt loads has provided an historic opportunity to take advantage of record low borrowing costs to finance their ongoing deficit spending in order to thwart macro recessionary and deflationary pressures. The global bond markets have been pricing in slowing global growth for several quarters with yields at levels that seem just too good to pass up. Thus, governments are issuing what are called “century bonds.”\n\nIt was only a few years ago that the Treasury rejected the notion of 50 and 100-year debt, citing a slack market demand for the size of issuance that actually moves the needle in a weekly Treasury auction — but that aversion to ultra-long-term debt has changed against the current crash of bond yields. So, during the last week of August, the U.S. Treasury acknowledged that it was canvassing its largest buyers to measure the appetite for interest in such long-dated paper. The primary buyers of such debt will be corporate pension plans and insurance companies.\n\nAnother thing that only a few people know is that a handful of corporations, health care networks and deep-pocket universities have already issued 100-year debt bonds. For instance, the Walt Disney Company has an outstanding 7.55% 100-year bond that matures in 2093. At the time that Disney issued the bonds in 2013, the company planned on selling $150 million worth of the issue. However, the demand was strong enough that Disney was able to raise $300 million. In recent years, the Cleveland Clinic and the University of Pennsylvania have also issued century bonds.\n\nFord, Boeing and McDonalds have also all sold bonds with 50-year maturities since 2013. And 100-year bonds were common among railroad operators when they were building out their lines and leasing land under long-term contracts. The last railroad to sell 100-year bonds may have been the Chicago and Eastern Illinois, a subsidiary of Union Pacific Corp., which peddled a 5% issue in 1954.\n\nDriving the fresh interest in ultra-long debt is the flat yield curve due to the fact that it costs relatively little more to borrow two to three times what it costs to borrow 20- or 30-year debt. Already, 14 countries within the 36-country Organization for Economic Cooperation and Development (OECD) have issued debt with maturities ranging from 40 to 100 years, and Austria, Belgium and Ireland have all issued century-bonds within the past two years. (source: Fortune — August 23, 2019)\n\nWhile it may be some time before the first century bond is auctioned by the U.S. Treasury, I suspect that some small trial issues will be floated to test the waters in order to determine the level of widespread interest. The United States has this nagging problem of a ballooning federal debt which is held by the public and is expected to top $16.6 trillion at the end of this year, representing 78% of GDP and nearly twice its average over the past 50 years. Come 2029, federal debt is forecast to hit $28.7 trillion, or 93% of GDP and keep growing to reflect 150% of GDP by 2049. (source: www.cbo.gov, “The Budget and Economic Outlook: 2019 to 2029”)\n\nMany factors can, and probably will, change these estimates going forward, but the concern is they will be adjusted radically higher. Just over one month ago on Aug. 1, deficit hawks from the Freedom Caucus lost out as Congress passed a budget deal which will increase government spending by $320 billion for the next two years, while allowing the government to continue borrowing as needed. Basically, it’s an open checkbook courtesy of the U.S. taxpayer. This is why I think that 100-year bonds eventually will make their way to public auction.\n\nJust for the record, President Trump never met a king-sized bond deal that he didn’t like. He even blessed the zealous budget deal after the Senate pushed it through. With large stresses on Social Security and federal benefits programs looming which just happened to coincide with bi-partisan support for an up to $3 trillion infrastructure deal in the works, the idea of taking out a $10 trillion line of credit for the next 100 years at or under 3.0% is probably too attractive for a free-spending President Trump and Congress to pass up.\n\nJoin me at The MoneyShow Philadelphia!\n\nThe MoneyShow is heading to Philadelphia for the first time ever and I’m excited to join some of the country’s smartest professional investors and traders at this complimentary, three-day event, Sept. 26-28.\n\nI will be analyzing sectors and trends, as well as sharing with you time-tested strategies for profiting in the markets. I also will be joined by investing experts such as Hilary Kramer, Bob Carlson and Dr. Mark Skousen in discussing stocks, exchange-traded funds (ETFs), income investing, real estate investment trusts (REITs), commodities, trading strategies and much more!\n\nTo register, click here or call 1-800-226-0323 and be sure to mention my priority code of 048301 to receive complimentary admission.\n\nThe post Are Ultra-Long Treasury Bonds the Next Big Thing? appeared first on Stock Investor.", "description": "The topic of whether the United States will start issuing .09/16/2019 19:10:27PM EST.", "authors": ["Bryan Perry", "Matt Vespa", "Guy Benson", "Timothy Meads", "Katie Pavlich"], "top_image": "https://media.townhall.com/_townhall/resources/images/thog.png", "published_at": "2019-09-16"}