{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/17/mariota-trying-to-be-aggressive-part-of-issue-for-", "downloaded_at": "2019-09-17 23:29:15.577582+00:00", "title": "Mariota: Trying to be aggressive part of issue for Titans", "language": "en", "text": "NASHVILLE, Tenn. (AP) - Marcus Mariota has looked at the tape, and the Tennessee Titans quarterback is ready to move on.\n\nUp next is a quick turnaround with the Titans visiting Jacksonville on Thursday night, and a chance for Mariota and Tennessee to fix some of what went wrong in a 19-17 loss to Indianapolis.\n\n“I love playing when the lights are on, and I look forward to these challenges,” Mariota said Tuesday. “I look forward to these division games. And our guys I think will be ready to go. It’s going to be a challenge, but we’re looking forward to it.\n\nPlaying in prime time could help Mariota and the Titans (1-1), who have some areas to fix already this young season.\n\nAfter watching tape, Mariota said staying out of third-and-long would help. They have converted only 3 of 20 third downs, and Mariota has been sacked four times in each of the first two games.\n\nThe fifth-year quarterback struggled against the Colts, appearing to miss wide-open chances to check down to a nearby receiver and avoid a couple sacks.\n\nBlame Mariota trying to be too aggressive.\n\n“Part of it was trying to make a big play,” Mariota said. “I felt we needed a spark and instead I didn’t check the ball down, and it was on a couple sacks. And that’s stuff that I got to do a better job of. But at the same time, you just got to have an aggressive mindset and see what you can do.”\n\nMariota, 28-29 as a starter, is 33 of 52 for 402 yards with four touchdown passes and no interceptions in a pivotal season for a quarterback in the final year of his rookie contract.\n\nThe Titans team, from coach Mike Vrabel and first-year offensive coordinator Arthur Smith to Mariota and his teammates, all pointed the finger at their struggles on third downs for their offensive issues. Too many times the Titans have failed to pick up a first down because they faced third-and-10 - or longer.\n\nSmith took all the blame on himself, saying he must call better plays.\n\nAsked if he might be struggling working through his progression for throwing options, Mariota said he didn’t think so, though that might be a better question for the coaches.\n\n“I feel like I’m seeing it,” Mariota said. “When the time comes and the journey’s ending in the pocket, just to get the ball out.”\n\nMariota was listed as not practicing with an injured quad Monday during a walk-through. He said he felt good Tuesday before practicing fully.\n\nThrough two games, the Titans are averaging 167.5 yards passing, putting them 27th in the NFL. That’s up two slots from last season, but less than the 185.9 yards passing for all of 2018.\n\nDerrick Henry ranked second in the AFC with 1,059 yards rushing last season, and he’s averaging 4.9 yards per carry this season and 87 yards per game. Henry said he can help by being more efficient when running and feels as if he hasn’t made all the plays he can.\n\n“I can be better and be more efficient in the run game … in those third down situations we’ve got to get those third downs so we can extend drives and not be three-and-out,” Henry said. “You can’t get started going three-and-out. Nobody gets opportunities that way.”\n\nDefenses focused on Henry means Mariota has opportunities to throw, which means making plays.\n\n“We definitely have to execute better,” Mariota said.\n\nNotes: CB Malcolm Butler (hip) practiced Tuesday after sitting out Monday. Rookie WR A.J. Brown (knee) and RG Jamil Douglas (knee) were limited Monday and practiced fully Tuesday.\n\n___\n\nFollow Teresa M. Walker at www.twitter.com/teresamwalker\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Marcus Mariota has looked at the tape, and the Tennessee Titans quarterback is ready to move on.", "authors": ["The Washington Times Http", "Teresa M. Walker"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/17/colts_titans_football_30838_c0-229-5472-3419_s1770x1032.jpg?6f9ce78ee1a3a25672569ab4bf84dc3559d8855e", "published_at": "2019-09-17"}