{"pub": "reuters", "url": "https://reuters.com/article/us-wework-ipo-curbs-exclusive/exclusive-wework-considers-dramatic-valuation-cut-in-ipo-idUSKCN1VY12V", "downloaded_at": "2019-09-13 18:16:33.616463+00:00", "title": "Exclusive: WeWork considers dramatic valuation cut in IPO", "language": "en", "text": "(Reuters) - WeWork owner The We Company may seek a valuation in its upcoming initial public offering of between $10 billion and $12 billion, a dramatic discount to the $47 billion valuation it achieved in January, people familiar with the matter said on Friday.\n\nWere the We Company to press on with the IPO at such a low valuation, it would represent a major turning point in the venture capital industry’s growth over the last decade, that has led to the rise of startups such as Uber Technologies Inc, Snap Inc and Airbnb Inc.\n\nIt would mean that the We Company would be valued less than the $12.8 billion in equity it has raised since it was founded in 2010, according to data provider Crunchbase. And it would represent a major blow to its biggest backer, Japan’s SoftBank Group Corp, at a time it is trying to amass $108 billion from investors for its second Vision Fund.\n\nThe sources cautioned that no decision has been made and asked not to be identified because the matter is confidential. WeWork and SoftBank did not immediately respond to requests for comment.\n\nInvestors have expressed concerns about the U.S. office-sharing start-up’s business model, which relies on a mix of long-term liabilities and short-term revenue, raising questions about how it would weather an economic downturn.\n\nThe We Company’s deliberations indicate it does not feel confident that the corporate governance changes it unveiled on Friday, slightly loosening CEO and co-founder Adam Neumann’s grip on the company, will be enough to woo investors concerned about its lack of a path to profitability.\n\nThe WeWork brand is strongly tied to Neumann, a flamboyant, freewheeling 40-year-old Israel-born entrepreneur who has said that the We Company’s mission is “to elevate the world’s consciousness.” His wife Rebecca serves as the We Company’s chief brand officer and is a powerful figure inside the company.\n\nThe We Company’s corporate governance changes are largely symbolic, aimed at showing the We Company is listening to investors after being forced to slash its IPO price expectations, corporate governance experts said. Last month, it was considering an IPO valuation of around $20 billion.\n\n“That change is seemingly cosmetic in nature,” said Charles Elson, a professor of corporate governance at the University of Delaware, referring to the We Company’s announcement it will reduce Neumann’s voting power. “He will still control the composition of the board.”\n\nThe office space sharing start-up said it was making the changes “in response to market feedback.” It said Neumann’s superior voting shares will decrease to 10 votes per share from 20, though he will still retain majority control of the company.\n\nNeumann will also give the company any profits he receives from real estate deals he has entered into with We Company. He will also limit his ability to sell shares in the second and third years after the IPO to no more than 10% of his stock.\n\nNo member of Neumann’s family will be on the company’s board and any successor will be selected by the board, scrapping a plan for his wife and co-founder Rebekah Neumann, who is chief brand and impact officer, to help pick the successor.\n\nThe We Company also disclosed its will list shares on the Nasdaq Stock Exchange. It plans to complete the IPO this month, and its IPO investor roadshow could launch as early as next week, Reuters has reported.\n\nThis is the second effort to repair damage done to the company’s image among investors. Earlier this month, it added a new member, Frances Frei, to its all-male board and said Neumann would return a $5.9 million payment for use of the trademarked word “We.”\n\n“For all the attention being given to ‘governance reform’ at the We Company, entrenchment through unequal voting rights remains firmly in place,” said Glenn Davis, director of research at the Council of Institutional Investors.\n\nFILE PHOTO: The WeWork logo is displayed on the entrance of a co-working space in New York City, New York U.S., January 8, 2019. REUTERS/Brendan McDermid/File Photo\n\nTUSSLE WITH SOFTBANK\n\nSoftBank chief Masayoshi Son has been pushing Neumann to delay the We Company’s IPO, but has so far failed to persuade him, Reuters has previously reported.\n\nWere the We Company to delay its IPO, it would have to find debt financing to replace a $6-billion loan package it clinched from banks last month. This debt deal is contingent on the We Company raising at least $3 billion in its IPO. SoftBank has so far resisted replacing this arrangement by offering the We Company more funding.\n\nThe last time SoftBank invested in the We Company was in January at a $47 billion valuation, injecting $2 billion of cash in the New York-based startup, far less than the $20 billion investment that the We Company had hoped for.", "description": "WeWork owner The We Company may seek a valuation in its upcoming initial public offering of between $10 billion and $12 billion, a dramatic discount to the $47 billion valuation it achieved in January, people familiar with the matter said on Friday.", "authors": ["Joshua Franklin", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190913&t=2&i=1429406500&w=1200&r=LYNXNPEF8C0VN", "published_at": "2019-09-13"}