{"pub": "cnn", "title": "'Dark Crystal: Age of Resistance' rebuilds one of Jim Henson's richest fantasy worlds", "url": "https://cnn.com/2019/08/29/entertainment/dark-crystal-netflix/index.html", "language": "", "published_at": "2019-08-29", "downloaded_at": "2019-09-02 07:38:03.999807+00:00", "text": "(CNN) \"The Dark Crystal: Age of Resistance\" is the fantasy series sequel to one of Jim Henson's most distinctive films, 1982's \"The Dark Crystal.\" And over the course of the many years director Louis Leterrier spent developing the project and, in many ways, walking in Henson's shoes, he felt his role shift.\n\n\"I started as Jim Henson's number one fan,\" says Leterrier, the filmmaker who's delivered a string of kinetic, artfully crafted popcorn films including \"Transporter\" \"The Incredible Hulk\" and \"Now You See Me\" and now sits at the helm of all ten episodes of Netflix's ambitious, long gestating project.\n\n\"What I am now is his deputy,\" Leterrier tells CNN. \"There is no one more beautifully imaginative, creatively poetic, hard-working, visionary than Jim Henson. This man has changed the world...No creative force has had this impact on kids and adults the way Jim Henson has had.\"\n\n\"The Dark Crystal\" in particular played a crucial role in setting Leterrier on his career path after the saw the film when he was 10.\n\n\"It tuned my heart to a certain type of filmmaking, but also guided my eyes. I was so flabbergasted by the masterful achievement,\" he says. \"I was like, 'This is possible, this is filmmaking, this is what can be done and can be achieved with an idea, some rubber or fabric...It defined me.\"\n\nHe recalls using his father's Super 8 camera to replicate the film's banquet scenes with the vain villainous Skeksis creatures, with his toys as stand-ins.\n\n\"Now. 37 years later I get to have my own banquet with Skeksis\"\n\nThe baton that Leterrier picked up was one that held lot of personal significance for the pioneering puppeteer, who died in 1991 after shepherding his Muppet creations to the zenith of popular culture.\n\n\"The Dark Crystal,\" which Henson co-directed with his longtime collaborator Frank Oz (the performer behind characters including Miss Piggy and \"Star Wars'\" Yoda who'd would go on to have a successful career directing film outside the puppetry genre), \"was a big undertaking for him, very ambitious, and a chance to break away from the mold of what he had been focusing on for the several years leading up to it,\" says his daughter Lisa Henson, who executive produced the new series and serves as President and CEO of The Jim Henson Company.\n\n'The Dark Crystal'\n\n\"When he was a younger guy, he really thought that puppetry was only going to be part of what he would do with his life creatively, and that he would also be a filmmaker -- and particularly an experimental filmmaker,\" Lisa Henson tells CNN. \"So when the Muppets became so popular, with 'Sesame Street' and then with 'The Muppet Show,' he didn't want to just continue to only do the Muppets. He always had other things that he wanted to pursue creatively, and 'The Dark Crystal' was the biggest project, and his first big breakaway.\"\n\nWith substantial financing from his steadfast financial backer, Britain's Lord Lew Grade, Henson's work on the film resulted in a veritable R&D laboratory that would introduce groundbreaking puppetry and animatronic techniques that would become not just Henson staples but industry-wide standards in the '80s and '90s.\n\n\"Those techniques were developed, many of them, in the crucible of the creative development of 'Dark Crystal,'\" said Lisa. For the new prequel series, set in a less dilapidated and hope-drained era many years before the events of the original film, the Henson Company delved deep into their archives to build out the rich universe and push those earlier innovations forward.\n\n\"We had a great time going back and actually reproducing the techniques and the designs of the original characters, and we never lost the technical know-how,\" she says. \"We have maintained the Creature Shops continuously since that time...but in the last few years, we haven't had the call to do such a big puppet project.\"\n\nHaving helmed his fare share of blockbuster films heavily populated with cutting edge effects, Leterrier says \"I knew what was possible, on a great massive scale.\" But he faced a steep learning curve. \"When I started working with the Hensons, I realized that I knew nothing,\" he laughs. \"All that visual tech wizardry and the big explosions and the visual effects...it's very hard, [but] it's nothing compared to creating moments of truth, where two puppets fall in love or are crying on each other's shoulders.\"\n\n\"I had to put myself through what I call 'puppet school,'\" the director explains, recalling deep dives into both the making of the original film and the larger traditions of puppetry. \"It's a thing that I had to go through,\" he says. \"I didn't realize how complex and beautifully artistic that everything was and is and needs to be.\"\n\nJim Henson in 1986\n\n\"This is the be all and end all of Creature Shop production,\" agrees Henson. \"Because you're creating an entire world where every single character is a creature -- and no humans. That was part of what was so exciting and challenging back in my father's day: creating a world where the puppets were not the sidekicks or the discoveries of human characters, but where all the lead characters and the lead dramatic roles would be played by puppets. And doing that today, it still feels like an exciting creative risk to take.\"\n\n\"It's not like I can go and cast Brad Pitt and Julia Roberts and I know what they're going to bring to me,\" says Leterrier. \"I had to build my Brad Pitt and build my Julia Roberts and describe to incredible sculptors the emotion that I wanted to depict and the raw puppets to have. It's so important, in the colors, the textures, everything -- every detail in a certain puppet is creating a character.\"\n\nIn that respect, the production was able to turn to a key Henson collaborator who'd provided much of the \"The Dark Crystal's\" visual magic: the legendary English fantasy illustrator and concept artist Brian Froud, who went on to work with the company on future projects \"Labyrinth\" and \"The Storyteller.\" In keeping with the project's legacy vibe, Froud's work was bolstered by that of his wife Wendy (whom he met on the original film) and their son Toby, who served as a design supervisor to translate his father's fantastical visions into physical realities.\n\n\"Brian was doing completely original, wildly strange designs on behalf of the series\" says Lisa Henson. \"I think if anybody had been hired to copy his style, they never would have made the leaps and peculiar choices that he did, and so we really benefited from having the real Brian Froud -- not just a 'Brian Froud look' -- for the series...He not only designed all the characters and the world and the movie, but he then sat in the Creature Shop and supervised how everything got built to match his look.\"\n\nIn terms of story, which centers on how the gentle Gelflings begin to fight back against the domineering Skekis after generations of manipulation and misuse, Leterrier was eager to explore themes and plots that ranged far afield from the original film, with a significantly developed mythology and a cast of characters created with an eye for gender parity and -- within its fantasy environs -- diversity. \"Let's just not serve our kind, the fans, exactly the same thing that we had,\" says Leterrier. \"Let's just go further. Let's widen the world; let's tell a much bigger story.\"\n\nNetflix's \"The Dark Crystal: Age of Resistance\" utilizes classic puppetry in an ode to Jim Henson.\n\n\"What fantasy does is that it helps you understand your world, our world, through the prism of another civilization,\" says Leterrier. The original film, with a complex, thoughtful and philosophical tone baked in as much as action and a fantastical backdrop, was a bit ahead of its time in terms of the simpler, good-versus-evil fare that characterized fantasy fare three decades ago. But the massive successes of properties like \"The Lord of the Rings\" and \"Game of Thrones\" in the intervening years have primed moderns audiences to be better prepared, and eager, for its deeper meanings, epic scale and darker corners.\n\n\"But my thing was never to emulate or to become the next 'Game of Thrones,'\" says the filmmaker, who instead preferred to focus on how such projects had set the table for \"Age of Resistance's\" complexities and ambitious cinematic feel. \"We always said 'Let's use this bridge that all these beautiful fantasy shows and movies have created for us. Let's use that to reach an audience, and then continue to expand the story that Jim Henson has started.'\"\n\n\"I also think it's important that we've made a big fantasy series that can be watched by the whole family,\" adds Lisa Henson, who felt she couldn't share her viewing love of \"Game of Thrones\" with her children until they grown to more appropriate ages. \"It is something that people can watch together and share their enjoyment, not just for the nostalgia of it, but the original fantasy adventure of it is -- something that is on a level both for kids and adults.\"", "description": "How \"The Dark Crystal: Age of Resistance\" reimagined the world of one of Jim Henson's most distinctive and ambitious projects.", "authors": ["Scott Huver"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190813100716-the-dark-crystal-super-tease.jpg"}