{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/scarlett-moffatt-offers-help-vicious-20448439", "downloaded_at": "2019-10-05 10:20:16.199000+00:00", "title": "Scarlett Moffatt offers help to vicious trolls who fat-shamed her", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nScarlett Moffatt reaches out to social media trolls with direct messages to check they are okay.\n\nThe reality TV personality, 29, has been bombarded with sickening abuse over the years from anonymous online haters.\n\nHowever, Scarlett is adamant she's not angry with the trolls and is actually trying to help the people who send her abusive comments.\n\n\"A couple of times I have inboxed people who have said horrific things and I’ve asked if they’re okay,” she shared with Mail Online.\n\nThe telly beauty continued: “Because I believe that hurt people, hurt people.\n\n\"And you’ve got to be in a really bad headspace to want to make someone feel bad.\n\n(Image: Instagram)\n\n“So, a couple of times I have actually messaged people and said, ‘are you okay?’ and every time I’ve done that, they’ve always messaged back and said, 'I’m so sorry!' So hopefully they learn from it.\"\n\nThe former Gogglebox star also told how her mum Betty often crafts a response to nasty messages but she will never send them to perpetrators.\n\nEarlier this year, Scarlett said she was left house-bound as a result of online trolling.\n\nThe TV star recoiled in horror when she was called \"fat\" and mocked by viewers for revealing a hint of her bra in a plunging dress on Love Island's After Sun.\n\n(Image: Getty Images)\n\nBut Scarlett has pledged to champion body confidence in the face of trolls.\n\nShe said: \"I used to avoid this photo it would upset me because even thinking about this moment where I got trolled for the way I looked reminded me of the state of depression it sent me in to the point where I didn’t even want to leave the house!\n\n\"But I don’t think that looking at this photo now! Now I see a young girl living her best life appearing on a show she loves, showing off her best assets and her curves.\"\n\n(Image: Dave J Hogan/Getty Images)\n\n\"Throw your middle finger up to anyone who tells you your too thin, too fat, your stretch marks are ugly, your body isn’t the right shape, your boobs are too small, too big, your bums too flat or too fat or you’re too fake!\n\n\"Don’t listen to them. LOVE YOURSELF BECAUSE LIFE IS TOO SHORT,\" she continued.\n\nScarlett slimmed down to a size 8 in 2016 after she lost three stone over a six-month period.\n\nHowever, she later put some of the weight back on and admitted she didn't have time for the gym and said she was \"just a normal lass\" when people commented on her size.\n\nDo you have a story to sell? Get in touch with us at webtv@trinitymirror.com or call us direct 0207 29 33033", "description": "Former Googlebox star Scarlett Moffatt has revealed she often contacts trolls to check they are alright as she is worried about their state of mind", "authors": ["Sara-Aisha Kent", "Image", "Instagram", "Getty Images", "Dave J Hogan Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article18995912.ece/ALTERNATES/s1200/1_Sink-the-Pink-Spring-Ball-2019.jpg", "published_at": "2019-10-04"}