{"pub": "independent", "title": "Atlanta city guide: Where to eat, drink, shop and stay in Georgia’s state capital", "url": "https://independent.co.uk/travel/48-hours-in/atlanta-georgia-things-to-do-city-guide-us-america-best-restaurants-hotels-bars-a9019216.html", "language": "en", "published_at": "2019-07-25", "downloaded_at": "2019-09-02 07:42:08.575494+00:00", "text": "Atlanta is a city that European travellers tend to visit en route to other destinations – Hartsfield-Jackson Atlanta International Airport is, after all, the busiest in the world and a major hub – but those who stick around to take in this sprawling city will be richly rewarded.\n\nThe birthplace of Martin Luther King Jr, the city is the perfect place to immerse yourself in the history of the civil rights movement. It also has a rich culinary heritage with old-school southern staples – think fried chicken and grits – sitting alongside a thriving modern dining scene.\n\nGeorgia’s generous taxbreaks for filmmaking mean that Atlanta is also known as the Hollywood of the south; Black Panther and Baby Driver are among the features shot here.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nWhat to do\n\nRetrace the steps of MLK\n\nShape Created with Sketch. Atlanta city guide Show all 7 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Atlanta city guide 1/7 Atlanta is known as the Hollywood of the South Getty/iStock 2/7 Explore the birthplace of MLK and the civil rights movement Getty Images 3/7 The Beltline is great for strolling or biking Getty Images 4/7 Ponce City Market has breathed life into an old building Wikimedia/Keizers 5/7 Swan House was used to film some of The Hunger Games Flickr/Jared 6/7 Tiny Lou's was named restaurant of the year in 2018 Asher Moss 7/7 Hotel Clermont reopened as a boutique hotel in 2018 Asher Moss 1/7 Atlanta is known as the Hollywood of the South Getty/iStock 2/7 Explore the birthplace of MLK and the civil rights movement Getty Images 3/7 The Beltline is great for strolling or biking Getty Images 4/7 Ponce City Market has breathed life into an old building Wikimedia/Keizers 5/7 Swan House was used to film some of The Hunger Games Flickr/Jared 6/7 Tiny Lou's was named restaurant of the year in 2018 Asher Moss 7/7 Hotel Clermont reopened as a boutique hotel in 2018 Asher Moss\n\nThe impressive Martin Luther King Jr Historic Site takes up a full block in the Sweet Auburn neighbourhood. Here visitors come to learn about the origins of the man who became the leader and icon of the civil rights movement. From his childhood home and the parking lot where he used to play basketball, to the church where he first preached and the King Centre, opened by his wife Coretta Scott King as a place to recognise his legacy, the site provides a fascinating insight into the life and achievements of MLK.\n\nLearn about the civil rights movement\n\nThe National Centre for Civil and Human Rights, which offers an educational and immersive experience, feels like the obvious place to go next. A thorough journey through the history of the civil rights movement on one floor is accompanied by a separate section focusing on human rights around the world.\n\nImmerse yourself in the World of Coca Cola\n\nSomewhat incongruously located right opposite the Civil Rights Centre, the World of Coca Cola is a hugely popular attraction. Atlanta, of course, is also home to what is arguably the world’s favourite soft drink. Come here to learn everything there is to know about the history of the drink and the brand through exhibitions, immersive features and films.\n\nTake a stroll along the BeltLine\n\nFashioned out of what used to be rail tracks surrounding the city, the Atlanta BeltLine is similar to New York’s Highline trail. Currently it is made up of five trails and seven parks, covering 22 miles. Take a hike or hire a bike to explore – along the way are cafes, gardens and brilliant art projects.\n\nWhere to stay\n\nDating back to 1924, Hotel Clermont is one Atlanta building with plenty of history. With several past lives – first as apartments, then as the Clermont Motor Hotel – it was shut down in 2009 and stood derelict for years. It reopened in its current incarnation as a boutique hotel in 2018 after a complete overhaul. Rooms are spacious and light, featuring modern design and toiletries by La Bottega. The paintings of women in the rooms hint to the still-functioning Clermont Lounge strip bar in the basement. A café in the reception offers free morning coffee to guests, the bar has on-point cocktails and local beers, and a rooftop bar is the perfect spot to take in the city views. Doubles from $199, (£151) room only.\n\nStonehurst Place is for those after something a little bit special. Set in a Midtown mansion, this cosy eight-room inn provides luxury in a great location. Ultra-comfortable beds, Alexa alarm clocks, bathrobes and high-end toiletries come as standard in all rooms, while some suites offer spa tubs and heated floors. Doubles from $199 (£151), B&B.\n\nHotel Indigo is a boutique-style chain hotel located across from the famous Fox Theatre, which has inspired the interior decoration. It’s also a short distance from the Georgia Aquarium and the sprawling Piedmont Park. The brightly refurbished rooms come with the expected amenities, including fast wi-fi and cable TV. The on-site 683 Midtown Bar and Bistro offers breakfast and dinner. Doubles from $162 (£124), room only.\n\nWhere to eat\n\nAlways a hit with the brunch crowd, Home Grown is a throwback diner, complete with formica tables and a menu with a difference. As the name suggests, the emphasis is on locally grown, fresh ingredients and homestyle cooking. The Comfy biscuit topped with fried chicken and sausage gravy has been named among Atlanta’s most iconic dishes. Prepare for a wait on the weekends – it’s worth it.\n\nTiny Lou’s was Eater Atlanta’s restaurant of the year in 2018 with good reason. It serves up French classics with a regional twist and seasonal southern cuisine in a gorgeous dining room inside the Hotel Clermont. Leave room for dessert – pastry chef Claudia Martinez has received much praise for her sweet creations. In addition to what’s on the menu, there’s a trolley with daily pastry specials.\n\nIn business since 1993, South City Kitchen celebrates southern cuisine across four locations. The Midtown site is set in a historic building with dining areas on several floors, arranged around the semi-open kitchen. The menu is traditional but is stuffed with perfectly evolved classics – fried green tomatoes arrive boosted by a slick layer of goats cheese, for example. Top sellers are the fried chicken dinner and crab cakes, but it’s hard to go wrong here.\n\nWhere to drink\n\nFrom the signage and the slightly mysterious exterior to the owl statues and the wood-covered walls, the Twin Peaks inspirations are everywhere inside this The Bookhouse Pub. Cocktails named after characters of the cult show include the Log Lady, the Agent Dale Cooper and the Audrey Horne. A great background soundtrack is accompanied by (muted) movies on the TV. Food is excellent and there’s an impressive rotating beer selection available too.\n\nThe original Hop City Craft Beer location in Midtown has been serving one of the largest craft beer selections in the country to enthused locals since 2009. The original 12 taps have since expanded to a mindboggling selection of 60. A second location in Krog Street Market is handily located near other top drinking spots, including the Watchman Seafood and Spirits, which serves excellent cocktails.\n\nAs the name suggests, Three Heart Coffee Roastery on the BeltLine Eastside trail roasts its own beans and bags are for sale to take away. The walk-up window includes covered outdoor seating and there are plenty of options for non-coffee drinkers, including watermelon snow – frozen shaved watermelon with different toppings.\n\nWhere to shop\n\nPonce City Market is a mixed-use development that has breathed fresh life into a massive historic building on the edge of the BeltLine in the Old Fourth ward. Popular national and regional retailers include Marine Layer, Anthropologie and Ponce Denim Company. The food hall, packed with all kinds of food and drink outlets, provides an ideal refuelling spot.\n\nThere are so many lovely things to take home from the Merchant at Krog Street Market – a huge variety of gifts, interiors, vintage goods, wonderful stationery and cards, alongside Atlanta-themed accessories. Meticulously sourced stock means few people leave The Merchant empty-handed.\n\nAnd The Shops Buckhead Atlanta is the place to splash the cash, with designer boutiques and top-end dining.\n\nArchitectural highlight\n\nSwan House, a 1928 mansion owned by the Atlantic Historic Society, has acted as a shoot location on several films, including The Hunger Games.\n\nNuts and bolts\n\nWhat currency do I need?\n\nUS dollars.\n\nWhat language do they speak?\n\nEnglish.\n\nShould I tip?\n\nA minimum of 15 per cent is expected in bars and restaurants; 20 per cent for exceptional service.\n\nWhat’s the time difference?\n\nFive hours behind GMT.\n\nWhat’s the average flight time from the UK?\n\nNine hours and 40 minutes.\n\nPublic transport\n\nPublic transport is patchy and a car is useful to get around, but there are plenty of Ubers.\n\nBest view\n\nThe rooftop of Ponce City Market is hard to beat – while you’re there, enjoy a cocktail or a game of mini-golf. In the winter it hosts an ice skating rink.", "description": "Atlanta is a city that European travellers tend to visit en route to other destinations – Hartsfield-Jackson Atlanta International Airport is, after all, the busiest in the world and a major hub – but those who stick around to take in this sprawling city will be richly rewarded.", "authors": ["Tina Nielsen"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/07/24/17/atlanta-overview.jpg"}