{"pub": "independent", "url": "https://independent.co.uk/voices/boris-johnson-parliament-unlawful-brexit-leave-general-election-a9119736.html", "downloaded_at": "2019-09-25 13:57:08.806068+00:00", "title": "Boris Johnson: The public will forgive the prime minister for breaking the law – he was challenging the system they rallied against", "language": "en", "text": "Outside the Supreme Court yesterday, in Remainer heartlands and, simultaneously, on the south coast in Brighton at Labour Conference, delight at the prime minister’s defeat over his attempt to prorogue parliament could barely be contained. The conference floor erupted in cheers as a grinning Jeremy Corbyn called on Boris Johnson to “consider his position”, sentiments echoed by Remainers, many of whom also demanded a vote of no confidence in the government.\n\nBut this victory, no matter how convincing, should be dashed with a sense of realism. Those who fought so hard for it need to understand that the public may have a very different perception of yesterday's events – one that, inadvertently, may strengthen the government’s hand.\n\nParliament will now return to the gridlock it left – a stalemate that has not played well with the public. Overwhelmingly, even among Remain voters, the sentiment for much of the past three years has been “just get on with it”. They became fed up at a perceived lack of drive, lack of desire even, from the May administration to see through the referendum’s demand to leave, and part of Johnson’s “bounce” in popularity came from the fact that he seemed to be making more progress than his predecessor.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nParliament, by hamstringing him as it had done Theresa May, is now seen as the obstacle, not for performing the very important duty of scrutinising the government, but for refusing every deal or possibility that is put before it. Having rejected May’s deals repeatedly, it has now rejected the idea of a “no deal” scenario – which, in the eyes of the public, looks less like scrutinising, and more like frustration. For, if the only deal the EU will agree to is rejected, and no deal too is shunned, what is left other than Remain? What’s more, parliament has also rejected the built-in mechanism for removing a dysfunctional government from office – a general election – robbing the public of their chance to give their opinion, and move the process along.\n\nShape Created with Sketch. Supreme Court verdict: Boris Johnson prorogation unlawful Show all 16 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Supreme Court verdict: Boris Johnson prorogation unlawful 1/16 The Supreme Court has ruled against Boris Johnson by declaring his government unlawfully shut down parliament for five weeks EPA 2/16 Lady Hale handed down the historic verdict, hailed by opposition MPs and anti-Brexit campaigners. She said all 11 judges were unanimous in deciding that the case is “justiciable”, so the government loses that part of the argument. “The court is bound to conclude therefore that the decision to advise Her Majesty to prorogue was unlawful because it had the effect of frustrating or preventing the ability of Parliament to carry out its constitutional functions.” EPA/Supreme Court 3/16 Gina Miller and her team react outside the Supreme Court are the verdict. She said: “Today is not a win for any individual or cause. It is a win for Parliamentary sovereignty, the separation of powers and independence of our British courts. Crucially, today’s ruling confirms that we are a nation governed by the rule of law, laws that everyone, even the Prime Minister, are subject to.\" PA 4/16 A person dressed as a caricature of British Prime Minister Boris Johnson in a prison uniform stands outside the Supreme Court AP 5/16 Labour leader Jeremy Corbyn called for Mr Johnson to “consider his position” following the landmark decision, while Lib Dem leader Jo Swinson said he was “not fit to be prime minister” Getty 6/16 Scottish National Party (SNP) Westminster leader Ian Blackford raises his arms as he comes outside. He said: \"This is an absolutely stunning judgement by the Supreme Court today.\" He went on to say, \"we all want to get back to work, and quite frankly, on the back of this, Boris Johnson must resign immediately.\" AFP/Getty 7/16 Crowds outside celebrated the verdict AP 8/16 Delegates at the Labour party conference applaud after hearing the news AFP/Getty 9/16 Speaker John Bercow said MPs must now “convene without delay” and confirmed the Commons would return at 11.30am on Wednesday AFP/Getty 10/16 Gina Miller said: \"“As a result of this judgment, Parliament is open, it was never prorogued. I urge MPs to get back to work immediately.” AP 11/16 MPs Anna Soubry, Liz Saville Roberts and Caroline Lucas, together with SNP leader Ian Blackford, react. Green MP Caroline Lucas has said the Supreme Court’s decision is “just the start” Reuters 12/16 “The UK deserves a Prime Minister and a Government who act with honesty, integrity and in a manner consistent with our constitution, at all times.\" AFP/Getty 13/16 AP 14/16 The SNP’s Joanna Cherry QC says: “Boris Johnson’s position is untenable and he should have the guts to resign.” PA 15/16 EPA 16/16 Tom Tugendhat MP returned to the chamber in the House of Commons within minutes of the Supreme Court ruling PA 1/16 The Supreme Court has ruled against Boris Johnson by declaring his government unlawfully shut down parliament for five weeks EPA 2/16 Lady Hale handed down the historic verdict, hailed by opposition MPs and anti-Brexit campaigners. She said all 11 judges were unanimous in deciding that the case is “justiciable”, so the government loses that part of the argument. “The court is bound to conclude therefore that the decision to advise Her Majesty to prorogue was unlawful because it had the effect of frustrating or preventing the ability of Parliament to carry out its constitutional functions.” EPA/Supreme Court 3/16 Gina Miller and her team react outside the Supreme Court are the verdict. She said: “Today is not a win for any individual or cause. It is a win for Parliamentary sovereignty, the separation of powers and independence of our British courts. Crucially, today’s ruling confirms that we are a nation governed by the rule of law, laws that everyone, even the Prime Minister, are subject to.\" PA 4/16 A person dressed as a caricature of British Prime Minister Boris Johnson in a prison uniform stands outside the Supreme Court AP 5/16 Labour leader Jeremy Corbyn called for Mr Johnson to “consider his position” following the landmark decision, while Lib Dem leader Jo Swinson said he was “not fit to be prime minister” Getty 6/16 Scottish National Party (SNP) Westminster leader Ian Blackford raises his arms as he comes outside. He said: \"This is an absolutely stunning judgement by the Supreme Court today.\" He went on to say, \"we all want to get back to work, and quite frankly, on the back of this, Boris Johnson must resign immediately.\" AFP/Getty 7/16 Crowds outside celebrated the verdict AP 8/16 Delegates at the Labour party conference applaud after hearing the news AFP/Getty 9/16 Speaker John Bercow said MPs must now “convene without delay” and confirmed the Commons would return at 11.30am on Wednesday AFP/Getty 10/16 Gina Miller said: \"“As a result of this judgment, Parliament is open, it was never prorogued. I urge MPs to get back to work immediately.” AP 11/16 MPs Anna Soubry, Liz Saville Roberts and Caroline Lucas, together with SNP leader Ian Blackford, react. Green MP Caroline Lucas has said the Supreme Court’s decision is “just the start” Reuters 12/16 “The UK deserves a Prime Minister and a Government who act with honesty, integrity and in a manner consistent with our constitution, at all times.\" AFP/Getty 13/16 AP 14/16 The SNP’s Joanna Cherry QC says: “Boris Johnson’s position is untenable and he should have the guts to resign.” PA 15/16 EPA 16/16 Tom Tugendhat MP returned to the chamber in the House of Commons within minutes of the Supreme Court ruling PA\n\nTo that end, many will see Johnson’s attempts at prorogation not through the legal lense of lawfulness, but through the prism of persistence. Where May was ground down and gave up, Johnson is trying to be creative to break the deadlock. The public won’t mind this – if anything, they will approve of efforts to get the country out of the predicament it finds itself in, and blame Remainers for dragging it back to a position where nobody can do anything. It’s that craftiness, that “can-do spirit,” which for all it is readily derided by Remainer bubbles, most people expected Johnson to bring to No 10. He failed this time, but at least he tried.\n\nNow, many people will baulk at this idea that misleading the Queen to unlawfully prorogue parliament might be described as “creative”. Breaking the law, for whatever purpose, is still breaking the law, after all. The problem with this is that many people disagree with the law in its current form – they disagree with the manner in which the whole political system is currently run. Were it a minority, one could perhaps dismiss this. But it isn’t a minority. The vote to leave the EU was the single largest democratic case to rip up and reform legal structures in living memory, and it won. If enough people disagree with the law, then at some point, one has to consider why it is the law at all, especially if there are concerted campaigns to change it. A great many people want it changed.\n\nIf Johnson had assaulted someone, say, or stolen a car, people of all stripes would condemn him, and call for his resignation at the very least. But don’t think for one second Leavers will abandon the prime minister for going against a system many of them feel there is already a democratic mandate for going against.", "description": "Outside the Supreme Court yesterday, in Remainer heartlands and, simultaneously, on the south coast in Brighton at Labour Conference, delight at the prime minister’s defeat over his attempt to prorogue parliament could barely be contained.", "authors": ["Benedict Spence"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/25/11/2019-09-25T102542Z-1065884518-RC19F7D62AE0-RTRMADP-3-BRITAIN-EU.JPG", "published_at": "2019-09-25"}