{"pub": "wsj", "url": "https://wsj.com/articles/germany-on-brink-of-recession-as-factories-slump-11569237721?mod=rsswn", "downloaded_at": "2019-09-23 11:55:33.968667+00:00", "title": "Germany on Brink of Recession as Factories Slump", "language": "en", "text": "Germany’s economy is on the brink of recession, reflecting the deepening hit to its factories from the U.S.-China trade war, uncertainty around the U.K.’s departure from the European Union, and problems in its key automobile sector.\n\nA survey of purchasing managers released Monday showed signs that weakness is spreading to Germany’s services sector, which has seen robust growth over recent quarters even as manufacturing output has declined. That could turn a mild downturn into a deeper and more prolonged contraction, dragging down growth in other parts of Europe.\n\nThe slowdown in Europe’s largest economy has been led by its manufacturing sector, which is heavily dependent on exports and has been hit by weakening demand from the U.K., China, Turkey and elsewhere over the past year.\n\nIn September, the sector experienced an even sharper contraction, as its purchasing managers index slumped to 41.4 from 43.5 in August, hitting its lowest level in more than a decade. A reading below 50.0 points to a decline in activity.\n\nIn responses, the euro fell 0.4% against the dollar and the yield on the German 10-year bund dropped to minus 0.585% as investors reached for safe government bonds. The Stoxx Europe 600 fell 0.9% in morning trade, with the banking and autos sectors each down 2.6%.\n\n“The manufacturing numbers are simply awful,” said Phil Smith, an economist at IHS Markit, which compiles the PMI. “All the uncertainty around trade wars, the outlook for the car industry and Brexit are paralyzing order books.”\n\nGermany’s economy contracted in the three months through June and appears set for another drop in output in the third quarter.\n\nGermany’s economic woes helped persuade policy makers at the European Central Bank to launch new stimulus measures this month, including the resumption of a bond-buying program.\n\nBy contrast, Germany’s central bank appears less troubled by the downturn. In a statement Monday it acknowledged that the economy has probably entered a recession, but described it as mild and said it “isn’t in itself a cause for concern.” Both of Germany’s representatives on the ECB’s decision-making body opposed the stimulus measures.\n\nThe survey of purchasing managers doesn’t offer much hint of a rebound over coming months, with manufacturing orders continuing to fall sharply.\n\nThere were also signs that the services sector is on a similar trajectory. The PMI for the services sector hit a nine-month low in September, and the composite PMI—which measures total business activity—fell to 49.1 from 51.7 in August, reaching its lowest level since October 2012.\n\n“It remains open whether the industrial sector will recover before the weakness spreads to other sectors of the economy,” the Bundesbank said.\n\nUnveiling his stimulus package, ECB President Mario Draghi urged Germany’s government to increase spending and cut taxes to boost activity and stave off a recession. The government has a budget surplus, but is reluctant to loosen its purse strings, arguing it must prepare the country for a rise in pension and health care costs as its population ages.\n\n“Even with its economy stuttering, we think a large structural German stimulus is still unlikely given the politics,” said Simon Wells, an economist at HSBC.\n\nIHS Markit said its measure of activity for France also declined in September, reaching a four-month low as the manufacturing sector stagnated and the services sector weakened.\n\nAcross the eurozone as a whole, the composite PMI fell to 50.4 from 51.9 in August, indicating that activity was close to stagnation. It was the weakest reading since June 2013, when the eurozone economy was in the throes of a twin government debt and banking crisis.\n\n—Caitlin Ostroff in London contributed to this article.\n\nWrite to Paul Hannon at paul.hannon@wsj.com and Tom Fairless at tom.fairless@wsj.com", "description": "Germany’s economy is on the brink of recession, reflecting the deepening hit to its factories from the U.S.-China trade war, uncertainty around the U.K.’s departure from the European Union, and problems in its key automobile sector.", "authors": ["Paul Hannon In London", "Tom Fairless In Frankfurt", "Paul Hannon", "Tom Fairless", "Paul.Hannon Wsj.Com", "Tom.Fairless Wsj.Com"], "top_image": "https://images.wsj.net/im-109783/social", "published_at": "2019-09-23"}