{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/elections/2019/09/26/julian-castro-2020-bid-could-end-without-more-money-make-debate/3776385002", "downloaded_at": "2019-10-06 13:18:33.383222+00:00", "title": "Castro says 'it will be the end of my campaign' without more money to help make November debate", "language": "en", "text": "CLOSE Health care was the dominant issue, and front runner Joe Biden was the main target for the other nine candidates on the stage. USA TODAY\n\nWASHINGTON – Presidential candidate Julián Castro said Thursday in an email to supporters that his campaign will end if he does not make the cut for the next Democratic primary debate in November.\n\nCastro, former secretary of Housing and Urban Development in the Obama administration, has stayed around 2% or lower in recent polling.\n\nIn order to qualify for the next debate, the Democratic National Committee has required that candidates be at 3% or higher in at least four approved national or early state polls or 5% in two early state polls. In addition, candidates need to receive individual donations from at least 165,000 people, with at least 600 unique donors in at least 20 states, to qualify for the next debate.\n\n\"I don’t say this lightly: If I don’t make the next debate stage, it will be the end of my campaign,\" Castro said in an email to supporters sent out by his campaign.\n\nMore: The DNC again raises the requirements needed to qualify for the Democratic debates\n\nIn a Quinnipiac poll published this week, Castro was at 2%. He has struggled to move up into the top tier in the sprawling Democratic field. Sen. Elizabeth Warren, former Vice President Joe Biden and Sen. Bernie Sanders have recently been at the top of the field repeatedly in multiple polls.\n\nCastro's email comes less than a week after a memo from Sen. Cory Booker's presidential campaign was published on Medium, where the New Jersey Democrat asked for more donations so he won't have to end his campaign. The memo said Booker's campaign \"needs to raise an additional $1.7 million by September 30 to be in a position to build the organization necessary to continue competing for the nomination.\"\n\nMore: Booker campaign warns he 'might not be in this race for much longer' without fundraising surge\n\n\"Without a fundraising surge to close out this quarter, we do not see a legitimate long-term path forward,\" the memo said.\n\nIn his email to supporters Thursday, Castro said that his team has determined he won't make it to the November debate without more money.\n\n\"I need to be completely vulnerable with you. I just left an emergency meeting with my team,\" he said in the email. \"They told me point blank: The DNC’s new debate threshold will be the end of the road if we can’t get more money in the door -- immediately.\"\n\nMore: Trump's efforts to discredit Joe Biden backfired on him. Will they hurt the former VP anyway?\n\nCastro also said that he believes the DNC's debate threshold \"is designed to cut candidates like me from the running. \"\n\n\"It’s designed for wealthy candidates with unlimited funds to blanket the airwaves with their message,\" he claimed. \"But I wasn’t born into privilege like other candidates. \"\n\n\"I don’t say this lightly: The future of my campaign rests on funding the ads I’ll need to meet this new debate threshold,\" he concluded.\n\nContributing: Jeanine Santucci, Savannah Behrmann\n\nRead or Share this story: https://www.usatoday.com/story/news/politics/elections/2019/09/26/julian-castro-2020-bid-could-end-without-more-money-make-debate/3776385002/", "description": "Julián Castro's email comes less than a week after Sen. Cory Booker's presidential campaign asked for more donations so he won't have to end his campaign.", "authors": ["Rebecca Morin", "Published P.M. Et Sept."], "top_image": "https://www.gannett-cdn.com/presto/2019/08/19/USAT/0b2b7359-e083-4028-befc-21e50b514171-AP_Election_2020_Julian_Castro.JPG?crop=3793,2134,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-09-26"}