{"pub": "rt", "url": "https://rt.com/usa/470750-shepard-smith-steps-down-fox", "downloaded_at": "2019-10-12 00:59:51.785295+00:00", "title": "‘Going to CNN? Feud with Tucker?’ Speculation in full swing after Fox’s Shepard Smith says leaving network after over 20 years", "language": "en", "text": "Fox’s chief anchor Shepard Smith has announced his departure from the news network after over two decades at the job, prompting a storm of speculation and intrigue online, and even conspiracy theories about why he stepped down.\n\nHired in 1996, Smith has been with Fox since its inception, but on Friday afternoon he said his 23 years at the network would soon come to an end.\n\n“Recently I asked the company to allow me to leave FOX News and begin a new chapter. After requesting that I stay, they graciously obliged,” Smith said in his final sign-off, without explaining his reasons for leaving.\n\nFull video: Shepard Smith's final sign off from Fox News pic.twitter.com/5fgyM81Gbj — Jon Passantino (@passantino) October 11, 2019\n\nIt wasn’t long before the internet speculation mill kicked into overdrive, with critics and fans alike offering a host of theories about what made the veteran anchor call it quits.\n\nSome theorized that Smith’s ongoing feud with fellow Fox host Tucker Carlson – often over coverage of President Donald Trump and his administration – may have been the breaking point. In September, the two hosts clashed after Carlson hosted pro-Trump attorney Joe DiGenova, who slammed a recent segment of Smith’s program critical of the president. Carlson ultimately deemed Smith a “partisan.”\n\n“I’m wondering if that spat with Tucker was the last straw.. rumor is Shep was told to stand down.. maybe he didn’t like that!” one commenter said.\n\nIt's also reported that he had given Fox an ultimatum. Tucker or him..he wanted Tucker gone.\n\n\n\nIt's also reported that security escorted him out.\n\n\n\nWe don't really know...because the reports are coming from the fake news. — WWG1WGA-Sue (@SueCFlorida) October 11, 2019\n\nWhile Smith stated he would not be reporting for other news agencies in the “near future,” that didn’t stop scores of netizens from wondering aloud where he might land next. Many decided CNN was the most likely destination, though MSNBC came in a close second.\n\nGoing to CNN???? — Diane Rivero (@rivero_diane) October 11, 2019\n\nGood riddance! Finally, @foxnews has freed themselves of @ShepNewsTeam and his liberal bull crap. Next stop - @cnn or @msnbc? — 🇺🇸 Cerebral Assassin 🇺🇸 (@CogentAxiom) October 11, 2019\n\nSome were more favorable to the idea, however.\n\n“Very sad to see you leave Shep,” one fan tweeted. “You have been a voice of reason on Fox, which I hate [to] watch apart from you, who I watch because I like your heart - it is large and good. I hope you go to CNN!”\n\nSo happy for @ShepNewsTeam to move over to CNN where he belongs! A bright future! — Jon Del Arroz (@jondelarroz) October 11, 2019\n\nFor the more conspiracy-minded, Attorney General William Barr’s recent meeting with Fox head honcho Rupert Murdoch was damning evidence something more sinister was at work, suggesting Smith’s frequently critical coverage of President Trump sealed his fate at Fox.\n\nOkay, so Trump dispatches Oberluetnant Wilhelm Barr to New York to visit Rupert Murdoch.\n\n\n\nAnd days later, Fox fires one of the few Fox guys who was ever truthful about Trump.\n\n\n\nThis guy is not the Attorney General. He is not even an attorney.\n\n\n\nHe is a Gestapo officer. #Resistpic.twitter.com/Xvxhs5qQcQ — Gerald Weaver (@Gerald_Weaver_) October 11, 2019\n\nPresident Donald Trump also stepped into the fray, musing to reporters that rather than resigning, Smith was fired due to “bad ratings.”\n\nTrump on Shep Smith leaving Fox News: “I assume it was because of bad ratings.” pic.twitter.com/7itL9OIQt5 — Tom Elliott (@tomselliott) October 11, 2019\n\nIn another minor mystery, NBC’s Jo Ling Kent stated in a tweet that Smith had been escorted out of Fox headquarters by security, but soon deleted the post after a spokesperson at the network denied the assertion.\n\nI've deleted my earlier tweet, which is below for the record. A Fox News spokesperson says it was not correct: “Shep’s exit from the building was planned and executed by Shep with Fox’s complete approval and the full support of FOX News – he was not remotely escorted out.” pic.twitter.com/YbLyfreFwX — Jo Ling Kent (@jolingkent) October 11, 2019\n\nGoing forward, Fox said a rotating series of news anchors would fill Smith’s long-occupied time slot.\n\nThink your friends would be interested? Share this story!", "description": "Fox’s chief anchor Shepard Smith has announced his departure from the news network after over two decades at the job, prompting a storm of speculation and intrigue online, and even conspiracy theories about why he stepped down.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5da11f3185f5407fd63563a9.jpg", "published_at": "2019-10-12"}