{"pub": "huffpost", "url": "https://huffpost.com/entry/trump-bolsonaro-amazon-fires-climate-change-united-nations_n_5d80eaa7e4b077dcbd64bd42", "downloaded_at": "2019-09-22 13:11:41.658209+00:00", "title": "As The Amazon Burns, Brazil’s Best Ally In Climate Denial Is The United States", "language": "en", "text": "NEW YORK ― A month after a vicious outbreak of fires drew global attention to the destruction of the Amazon rainforest, Brazil President Jair Bolsonaro is unlikely to find many friends awaiting his arrival here for the United Nations General Assembly this week, especially as countries meet to discuss the need for more aggressive action in the global fight against climate change.\n\nBolsonaro’s flip response to the fires, and his government’s continued insistence that neither the Amazon nor the world face an existential climate threat, have risked made him a pariah on the international stage. But when he delivers a speech Tuesday that will likely continue to paint international concern over the Amazon as a global conspiracy rooted in manufactured fears over a worsening climate, Bolsonaro will be able to count on at least one major ally: the United States.\n\nPresident Donald Trump is also a climate skeptic and, like Bolsonaro, has staffed his environmental regulatory agencies with officials who do not believe in climate change. The two right-wing leaders have cozied up to each other since Bolsonaro’s election in October 2018, and their relationship has only strengthened since Trump backed his Brazilian counterpart ahead of the G-7 meetings in August, when he told Bolsonaro that the United States would “absolutely ... be a voice for Brazil” amid the international outcry.\n\nSince then, Bolsonaro and his top officials ― including Foreign Minister Ernesto Araujo and Environment Minister Ricardo Salles, who both made trips to Washington ahead of the U.N. summit ― have continued to cultivate support both inside the Trump administration and among conservative organizations that still refuse to accept the scientific consensus that climate change is real. As a result, two of the most important countries in the global fight against climate change have forged a strengthening anti-environmental alliance in the face of broadening international opposition from other governments and increasingly worried populations alike.\n\nIt couldn’t come at a worse time. In Brazil, the Amazon rainforest is approaching a tipping point past which, scientists warn, it may not be able to recover, as rates of deforestation spike after years of decreases. The Trump administration, meanwhile, has removed logging protections from vital areas of public forests in the U.S.\n\nThe looming climate crisis has never been more urgent, and the United Nations has devoted a full day of its general assembly on Monday to international efforts to uphold and strengthen the 2015 Paris climate agreement, which both Trump and Bolsonaro oppose.\n\n“If you just flipped it, that [alliance] could be a very powerful thing internationally,” said Francesco Femia, the co-founder of the Center for Climate and Security, a Washington-based nonprofit. “That could inspire China and India and some of the other major players to play a leadership role as well.”\n\n“Instead,” he said, the U.S. and Brazil “are going in the complete opposite direction, in the face of very broad agreement that climate change is a serious problem and we need to do something about it. It’s quite a fringe approach.”\n\nThe partnership could prove equally powerful, though.\n\nTrump’s backing of Bolsonaro at the G-7 bolstered the Brazilian leader’s decision to reject a $20 million international fund to help protect the Amazon, and new agreements between the two governments could help blunt the impact of other European efforts to put financial pressure on Bolsonaro over the destruction of the forest.\n\n“The United States is effectively giving cover and support for what the Brazilian leadership are doing,” said Nigel Sizer, the chief program officer for the Rainforest Alliance. ”Donald Trump is now intimately connected and partly accountable for the crisis in the Amazon. And [he may be] more so in the future, depending on what happens next.”\n\nBolsonaro’s government has stepped up environmental enforcement in the wake of the record number of fires in the Amazon this year, but his administration still holds the view that international pressure over the Amazon fires was little more than the latest round of “fake news.” And it has continued to turn to allies in the United States for help.\n\nAraujo, Brazil’s foreign minister, flew to Washington in mid-September for a visit that included meetings at the White House and State Department and a speech at the Heritage Foundation, the right-wing think tank that boasts a lengthy roster of climate skeptics. During the speech, Araujo, who describes himself as an “anti-globalist,” declared that “there is no climate change catastrophe” and likened the international pressure over the Amazon to an “invasion” against Brazil’s sovereignty.\n\nHe also secured a financial agreement with the United States that will set up a $100 million fund for Amazon conservation, which U.S. Secretary of State Mike Pompeo announced after meeting with Araujo. Details of the agreement are light, and Araujo couldn’t provide specifics during a press conference later that day. But the fund will be led by the private sector, Pompeo said, suggesting that it could lead to further development of Amazon lands. That’s a key element of Bolsonaro’s strategy, which rests on the idea that economic development is the only way to protect the rainforest or other crucial environmental areas.\n\nThere is a global perception, Araujo said at the State Department, that Brazil “is not able to cope with the challenges of the environment there.”\n\n“That’s not true. And our friends here in the U.S. know that’s not true,” he said. “We want to be together in the effort to create development for the Amazon region, which we are convinced that is the only way to really protect the forest.”\n\nThe Trump administration has taken a similar approach in the United States, arguing that loosening restrictions on logging will help curb wildfires and destruction ― over the objections of experts. In Brazil, environmental groups and indigenous tribes have warned it could further threaten the forest and their livelihoods, while economists and international organizations, including the World Bank, have argued that Brazil does not need to clear more land to boost its economy.\n\nAraujo’s trip to the U.S. also included a meeting with Stephen Bannon, the former Trump adviser who has since launched a mission, alongside Bolsonaro’s youngest son, to spread his “anti-globalist” movement across the world. Bannon, the former editor of the right-wing nationalist web site Breitbart, has decried the pursuit of alternative energy sources as “madness” and said that “globalists” are behind the effort to combat climate change. Bannon and Araujo, according to reports, discussed Bolsonaro’s upcoming speech to the UN.\n\nSalles, Brazil’s environmental minister, followed Araujo to the United States last week, and his agenda included a series of meetings with conservative climate skeptics. Salles, who has said that Brazil is not obligated to help combat climate change (a fight that he has dismissed as merely “ideological), met Thursday with Andrew Wheeler, the climate change-denying head of the U.S. Environmental Protection Agency.\n\nSalles’ agenda also included a meeting with representatives of the Competitive Enterprise Institute, a think tank that on its web site says it “questions global warming alarmism” and opposes the Paris agreement and other efforts to combat climate change. But the meeting reportedly didn’t take place, and during his trip to the U.S., Salles told The Wall Street Journal that climate change was “an important issue.”\n\nBolsonaro and Trump may both see climate change as a useful political cudgel, but they will face broad opposition in New York, a city where demonstrations and public backlash already caused Bolsonaro to cancel a planned visit earlier this year. Protests against the Brazilian leader began again Friday, during the international climate strike, and are expected to continue throughout his visit.\n\nA number of events around the general assembly will also focus on the record number of fires that have broken out in the Amazon this year, and the role that Bolsonaro’s efforts to roll back protections and cut funding for environmental agencies have played in the destruction. On Saturday, dozens of scientists, Amazon researchers, indigenous activists and representatives from both environmental groups and Brazilian agribusiness interests gathered for a day-long event focused on combating the Amazon crisis and the human rights abuses and environmental problems associated with it.\n\nThe event, which was organized by the Rainforest Alliance and five other organizations, was meant to help form common bonds among various groups in their efforts to protect the Amazon, and put on display the aggressive efforts taking place even as Trump and Bolsonaro ignore the issue, Sizer said.\n\nBolsonaro, who faced off in a petty dispute with French President Emmanuel Macron after Macron criticized Brazil’s handling of the Amazon fires, is not scheduled to arrive in New York until Monday. He may meet Trump during the trip, Bolsonaro said this weekend, but otherwise he is likely to receive an icy response from foreign leaders at the U.N., where he has no bilateral meetings scheduled. (Bolsonaro’s attendance was in doubt until this weekend, thanks to his latest surgery stemming from his stabbing on the campaign trail last year.)\n\nBolsonaro and Trump’s isolation from the broader global community on climate will be clearest during Monday’s climate action summit, an event meant to detail the steps each country is taking to meet goals under the Paris climate agreement, and prepare for the U.N.’s larger Climate Change Conference next November. The State Department announced Friday that it will send an official to the meeting. But while the leaders of other major countries plan to attend the day-long event, the presidents of the United States and Brazil won’t be there.\n\n“It’s extremely unhelpful, and it’s extremely serious. And it certainly impedes progress,” Sizer said. “They’re trying to undermine it, but they won’t succeed.”", "description": "Presidents Donald Trump and Jair Bolsonaro have forged a nationalist alliance based on the idea that climate change is a hoax.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d852c532100005a00e58974.jpeg?cache=0jzykqu74w&ops=1778_1000", "published_at": "2019-09-22"}