{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/sir-alex-ferguson-told-sven-20570708", "downloaded_at": "2019-10-13 11:38:25.830038+00:00", "title": "Sir Alex Ferguson told Sven-Goran Eriksson he'd \"kill him\" over Wayne Rooney selection", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Manchester United FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nFormer England boss Sven-Goran Eriksson has detailed his battles with Sir Alex Ferguson over his selection of Wayne Rooney for the Three Lions, adding that the Scot said once he'd \"kill him\" if he picked the forward.\n\nEriksson was in charge of England between 2001 and 2006, and gave Rooney his international debut as an 18-year-old in 2003.\n\nThe forward would go on to join Ferguson at Manchester United after starring at Euro 2004, with the former Everton star going on to become the all-time record goalscorer for club and country.\n\nLegendary boss Ferguson was often notoriously reluctant to allow his players to go on international duty in order to preserve their fitness for club endeavours.\n\n(Image: Allsport)\n\nMany managers would have relented in the face of such fury from the Scot, but Eriksson was determined to stick to his guns.\n\n\"With Alex, the amazing thing was it was seven o’clock in the morning or earlier. Always. When he was angry,\" the Swede told The Times .\n\n\"And never 'Hello Sven, how are you?' It was “whuurssshhhh” [yelling]. I thought he should kill me.\n\n(Image: Press Association)\n\n\"He said, 'I will kill you. You are finished.'\n\n\"But I represented England and you have to stand up.\n\n\"What’s right is right and what’s wrong is wrong and when you say 'Don’t pick Rooney because I’m going to kill you'... I said, 'F*** off, what’s going on with you?'\n\n(Image: Reuters)\n\n\"And he was screaming. Whenever he got like that... it has no meaning.\n\n\"That’s why I was, 'Alex, I will pick Rooney. Now, have a nice holiday. Ciao, bye'\".\n\nAfter England Eriksson, now 71, went on to have a nomadic managerial career, taking charge of Manchester City , Mexico, Ivory Coast, Leicester City, Guangzhou R&F, Shanghai SIPG, Shenzhen and the Philippines.", "description": "The former England boss detailed his clashes with the Manchester United icon over the selection of his star player", "authors": ["Mark Jones", "Image", "Allsport", "Press Association", "Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20570763.ece/ALTERNATES/s1200/0_Sven-Goran-Eriksson-Football.jpg", "published_at": "2019-10-13"}