{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/afghanistan-mosque-attack-families-bury-dead-191019105812623.html", "downloaded_at": "2019-10-19 12:32:45.670175+00:00", "title": "Afghanistan mosque attack: Families bury their dead", "language": "en", "text": "Funerals are being held in Afghanistan's eastern Nangarhar province for the victims of Friday's bomb blasts in which at least 69 worshippers were killed and dozens wounded.\n\nAttahullah Khogyani, spokesman for the governor of Nangarhar province, said on Saturday that the explosion also wounded 36 people when it went off as hundreds of people gathered in the mosque in the Jawdara area of Haska Mena district.\n\n191017143934111\n\nSohrab Qaderi, a member of Nangarhar's provincial council, said the mosque, with a capacity of more than 150 worshippers at a time, was full of people when the bombs exploded.\n\n\"Bodies of 69 people, including children and elders, have been handed to their relatives,\" Qaderi said, adding that more bodies could be lying under the rubble.\n\nPolice and local people searched on Saturday for more bodies in the rubble of the mosque.\n\nLocal officials on Friday had put the death toll at 62.\n\nNo group has claimed responsibility but the government accused the Taliban group, which was overthrown in 2001 by a US-led military coalition for sheltering al-Qaeda, the group blamed for the September 11, 2001 attacks in the US.\n\nSpokesman of Sediq Sediqqi, spokesman for Afghan President Ashraf Ghani, blamed the Taliban for the attack.\n\nBut Suhail Shaheen, a spokesman for the Taliban, denied the group was responsible. In a tweet, he said that witnesses to the attack said it was a mortar attack by government forces.\n\n191009083835426\n\nOne of the wounded, Gulabistan, 45, said the mosque was full when the explosion happened.\n\n\"Mullah already started prayers and reciting verses of the Holy Quran, when a huge boom happened, then all around me it got dark, the only thing I remember is females' voices and then I found myself in the hospital,\" Gulabistan said.\n\nHe said he had been told his son was among the dead while his brother and two nephews had been wounded and were in hospital.\n\nUS ambassador John R Bass, said in a tweet that \"killing worshippers assembled together in peace is unconscionable. All Afghans have the right to live and worship together in safety.\"\n\nThe European Union said the attack aimed to undermine hopes for peace and reconciliation in Afghanistan.\n\nThe Taliban and Islamic State of Iraq and the Levant (ISIL or ISIS) fighters are actively operating in parts of Nangarhar, which shares a border with Pakistan in the east.\n\nThe attack - the year's second-deadliest - came a day after the United Nations said violence in the country had reached \"unacceptable\" levels.\n\nA UN report said1,174 people were killed and 3,139 wounded in Afghanistan's war between July and September.", "description": "Bodies of 69 people, including children, handed to their relatives for funeral a day after deadly mosque attack.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/19/553d4ce9b1ef46a59321307e2bd507e0_18.jpg", "published_at": "2019-10-19"}