{"pub": "japantoday", "url": "https://japantoday.com/category/features/food/japan-rugby-captain-michael-leitch-wins-with-his-64-cafe-in-tokyo", "downloaded_at": "2019-10-22 13:20:00.790620+00:00", "title": "Japan rugby captain Michael Leitch wins with his +64 Cafe in Tokyo", "language": "en", "text": "By Oona McGee, SoraNews24\n\nJapan sadly bowed out of the Rugby World Cup on Sunday night, defeated by the South African Springboks 26-3 in a nail-biting game that had the nation on the edge of their seats.\n\nDespite the defeat, the Japan team weren’t short of victories. Not only did they become the first Asian side to ever progress to the Rugby World Cup quarterfinals, but as hosts of this year’s tournament they won the hearts of the nation, encouraging more and more locals to become interested in the sport and impressing the world with their skill, tenacity and excellent sportsmanship.\n\nWhile fans today are experiencing the bittersweet taste of defeat as Japan finishes fourth in the world rankings, there’s one place where everyone can nurse their sorrows, and that’s at the cafe owned by the Japan team captain Michael Leitch.\n\n▼ Leitch owns Plus Sixty Four Cafe in Tokyo’s Fuchu City.\n\n▼ The cafe is called +64 as this is the country code for New Zealand, Leitch’s home country.\n\nWe visited +64 on the morning of the Japan v South Africa game, and shortly after opening at 11:00 a.m., all the seats in the 19-seater cafe were full.\n\n▼ By midday, there was a queue of people patiently waiting outside.\n\nLeitch and his wife Satomi have been running the cafe since 2015, and over the years they’ve had a huge amount of support from locals, fans, and rugby players, many of whom have signed plates that adorn the wall by the front entrance (see top photo).\n\nA number of plates are signed by Leitch’s teammates at Toshiba Fuchu Rugby Football Club – known as Toshiba Brave Lupus – which is the local team Leitch plays for.\n\nThe signatures come with messages like “awesome breakie bro!”, “best breakfast in Tokyo”, “best breaky in Japan” and “Love the big breaky!” so as soon as we sat down to take a look at the menu, we knew exactly what we were going to order.\n\nWe wrote down an order for two lots of the Kiwi Breaky (1,400 yen [US$12.91]) and took it to the cash register.\n\n▼ We also ordered two flat whites (350 yen each), made with Allpress Coffee from New Zealand.\n\n▼ The spirit of New Zealand is strong here, with beautiful native flower displays.\n\n▼ And a beautiful Tiki, an iconic emblem of New Zealand’s indigenous Maori, on the back wall.\n\nAfter placing our order, we got ourselves a glass of water, and were pleasantly surprised to see they offered doggy bag cases so customers who can’t finish their meal can take their food home with them. With doggy bags available, we figured the Kiwi Breaky might be generously sized by Japanese standards, and when it arrived, we were happy to find we weren’t wrong.\n\nThis was truly the breakfast of champions, both literally and figuratively, with two hash browns, two slices of bacon, a sausage, scrambled eggs, salad, and a slice of crusty bread presented beautifully on a large plate.\n\nFor Kiwis and Aussies alike, this breakfast will take you right back home to a sunny morning at a beachside cafe with all its hearty, familiar flavors. It’s absolutely delicious, and as an Aussie who’s eaten her fair share of breakfasts at restaurants famous for their morning meals in Japan, I’d go out on a limb and rank this as one of the very best breakfasts in Tokyo.\n\nThe Flat White is superb as well, especially as it comes served with a delicious biscotti and a souvenir spoon from New Zealand.\n\nThe cafe also offers meals for takeout, along with sweets like cookies, biscotti, muffins, chocolate brownies, and slices of cake.\n\nWhen we were there, customers went crazy for the reusable travel mugs branded with the cafe’s name (priced at 1,000 yen each), wiping the display of stock before 12 p.m.\n\nWe snared the last jar of Pic’s Peanut Butter, made with Australian nuts lovingly “squished” with hydro power in New Zealand. It was a bit of a splurge at 1,200 yen, but sometimes you can’t put a price on the flavor of home.\n\nThe support of customers when we visited was lovely to see, as fans attending the Japan v South Africa quarter final stopped by in their red-and-white jerseys, hats, scarves and bags for a pre-game meal at the captain’s cafe before heading off to the venue at Ajinomoto Stadium in nearby Chofu.\n\nAs the Japan rugby team bow out of the World Cup, they do so with their heads held high, having fought gallantly and exceeding the expectations of many with their best-ever result in the tournament.\n\nAnd as rugby fever slowly winds down in Japan after the Cup, +64 will still be here, keeping the nation’s rugby dreams alive with Leitch as its captain, continuing to give back to the country that gave him so much as a teenager.\n\nAs his Japan teammate Luke Thompson would say, it’s meccha wonderful.\n\nCafe information\n\nCafe＋64\n\nAddress: Tokyo-to, Fuchu-shi, Miyoshicho 1-18-3\n\n東京都府中市美好町1-18-3\n\nHours: 11 a.m. – 4 p.m. (last order 3 p.m.) Closed Mondays and at irregular times of the year (check website for details)\n\nWebsite\n\nRead more stories from SoraNews24.\n\n-- Japan fans call Rugby World Cup player Luke Thompson “kawaii” for the way he speaks Japanese\n\n-- Canon shows off video-game-like replay tech for real games of Rugby World Cup in Japan\n\n-- Canadian rugby team volunteers in typhoon-struck Japan following cancellation of World Cup match\n\nExternal Link\n\nhttps://soranews24.com/2019/10/21/japan-exits-rugby-world-cup-captain-michael-leitch-wins-with-his-64-cafe-in-tokyo/\n\n© SoraNews24", "description": "Japan sadly bowed out of the Rugby World Cup on Sunday night, defeated by the South African Springboks 26-3 in a nail-biting game that had the nation on the edge of their seats. Despite the defeat, the Japan team weren’t short of victories. Not only did they become the first Asian side to…", "authors": [], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/f8/10/896838951cf28018ca9eed6342edf2e2a606/michael-leitch-cafe-tokyo-64-breakfast-new-zealand-japan-rugby-world-cup-2019-sport-food-top-best-japanese-restaurants-news-review_-68.jpg", "published_at": "2019-10-21"}