{"pub": "arstechnica", "url": "https://arstechnica.com/gaming/2019/10/for-all-mankind-asks-what-would-be-a-giant-leap-if-apollo-11-wasnt", "downloaded_at": "2019-10-30 14:16:04.392225+00:00", "title": "For All Mankind imagines a space race that leaves fewer people out", "language": "en", "text": "At the heart of all good science fiction lies one vast and deceptively simple question: what if? For All Mankind, the latest outing from writer and producer Ron D. Moore, explicitly takes that what if as its core premise and logline, asking: what if the space race never ended?\n\nThe show's first trailer showed us the motivation for continuing the race: what if, at the height of the Cold War, the Soviet Union was first to put a man on the moon? What if Apollo 11, rather than a great leap for mankind, was a footnote in the history books? What would that mean, and what would happen next?\n\nIt feels intentional that Apple should launch its new streaming TV service with a show literally about launching, about refusing to accept second place as a loss, about the audacity of reaching for the literal stars. And it seems fitting that the company would have shared the first two episodes of that vision on the larger-than-life IMAX screen at the National Air and Space Museum in Washington, DC, surrounded by actual artifacts of crewed spaceflight on all sides.\n\nAlas that the screening was only two episodes because yours truly left the theater dying to see what comes next.\n\n(Very minor spoilers for the first two episodes of For All Mankind follow.)\n\nLarger than life\n\nIt has been 50 years since Neil Armstrong's \"one small step\" ricocheted around the world. The men who went to space on Apollo 11 are now iconic and legendary; most people can name either Buzz Aldrin or Neil Armstrong, if not both, even if they can't remember Michael Collins (who remained in orbit).\n\nAstronauts captivated—continue to captivate—our imagination. A few hundred souls, out of all the billions who have ever lived, have escaped our world, seen it from the outside with their own eyes. The men of Apollo 11 were legends in their own time and in ours. And they, like their mission, are a sideline in For All Mankind, which instead elevates the stories of others to mythic status in their own right.\n\nInstead, as the series begins, the figures looming over it are not those flying high above, but those feuding down below. Our story follows astronaut Ed Baldwin (Joel Kinnaman), a stand-in for real-life Apollo 10 commander Thomas Stafford. Apollo 10 served as a \"dress rehearsal\" for the eventual Moon landing, with astronauts in a lunar module descending to within about eight miles of the lunar surface before returning to orbit.\n\nIn our history, where Apollo 11 was a success, that level of preparation and testing seemed wise. In an alternate history, where Apollo 11 came too late, the choice not to land earlier suddenly looms large, kicking off internecine political conflict at every level.\n\nBaldwin is joined by colleague and foil Gordo Stevens (Michael Dorman), a replacement for real-life Apollo 10 lunar module pilot Eugene Cernan. Where Baldwin is the square-jawed, right-stuff astronaut trope made manifest, Stevens embodies the hard-drinking, philandering, hotshot fighter pilot. Each of the men of course has a wife to match, and the women, too, are foils to each other. Karen Baldwin (Shantel VanSanten) seemingly strives to be the housewife and mother the still-military atmosphere of NASA circa 1969 demands, while Tracy Stevens (Sarah Jones) exhibits markedly less patience for the constraints that life can bring with it.\n\nThe plot also makes room for two other threads, both telling the stories of girls and women who chafe against their circumstances. Margo Madison (Wrenn Schmidt) replaces the real-life Poppy Northcutt as the first (and, at the time, only) woman sitting inside mission control during Apollo. Madison is a protégé of Wernher von Braun (Colm Feore), the real-life director of the Marshall Space Flight Center and architect of the Saturn V rocket.\n\nThe challenges Madison faces are perhaps the ones you might expect for a woman trying to be taken seriously in an all-male workplace in the 1960s. What you might not expect, however, is the third plot thread, which follows young Aleida Rosales (Olivia Trujillo) and her family as they emigrate from Mexico to Houston in pursuit of the good-old American dream.\n\nAs real as fiction gets\n\nI would be remiss to discuss a show made with the budget and care applied to For All Mankind and not address the obvious hook: the space porn.\n\nThe scenes taking place in space, screened at a state-of-the-art IMAX facility, were a joy. Every shot of the Columbia and Eagle gliding silently (yes, silently) through space, of a massive rocket readying for liftoff, of Baldwin and Stevens folded into a lander that would never land, delivers all the wonder that feats of human engineering deserve. And in every element, For All Mankind displays painstaking attention to detail.\n\n\"We said from the beginning of the production to all the departments that we thought it was really important for the show to have a sense of authenticity to it, even though you were doing something that was fundamentally not true,\" Moore said during a Q&A panel after the screening.\n\nMoore added:\n\nThe closer it was to reality, the more likely it was that the audience would go on this journey—take the risk and laugh and cry with the characters along the way. So, every department on the show, in the writers' room, had researchers and historians. We went back to the original NASA plans whenever possible. Our production designer, Dan Fisher, who designed all the sets of the show, recreated Mission Control in such exacting detail that even the ceiling tiles [are] the same as the ceiling tiles in the original mission control. When we were on set, we had technical consultants and former astronauts who were actually there, who would walk the cast through how to operate the command module and the lunar module. We had people that would talk to the background players in Mission Control, so that people weren't just randomly pushing buttons—they knew exactly what the console did and who they were talking to on those headsets, and that permeated the entire production.\n\nThe sense of authenticity shoots straight through every scene. Interstitial moments use as much original footage as possible for key political figures such as Presidents John F. Kennedy and Richard M. Nixon, and the soundtrack drips with 1960s rock and pop throughout, helping ground the audience in a strong sense of time and place.\n\nWhat still might be\n\nMoore's previous work, both in the Star Trek franchise and especially with Battlestar Galactica, makes clear that he does not shy away from the implications of politics in his work. And indeed, both the workaday questions of funding and who saves face, as well as the grander philosophical questions were already on display in just two episodes.\n\nMankind begins during the early months of the Nixon administration, locked into the Manichean worldview of the Cold War. But in the same way Battlestar was grappling with a post-9/11 world, Mankind is in every way, inescapably, a show made in and about the Trump era. Moore and company ask us in the subtext of almost every single scene not only to grapple with the what ifs underlying US politics and the history of NASA but also something much more profound.\n\nSometime after the third episode, we know from the trailers, the alternate-universe NASA of For All Mankind is going to try something that our real NASA had already rejected in 1969: admitting women as astronaut candidates (including wronged wife Tracy Stevens).\n\nAccording to promo photos, at least one of the potential women astronauts in this alternate universe is African-American. In the real world, an American woman would not reach orbit until 1983, when Sally Ride became the first. It also took until 1983 for Guion Bluford, the first black US astronaut, to reach space. (Although NASA was at least thinking about desegregating space in the 1960s.) Almost another decade had to go by before NASA sent a black woman, Mae Jemison, into space on a 1992 mission.\n\nWhat if we were motivated to try something new and different decades earlier due to an embarrassing Cold War loss?\n\nThe show is both \"a look at what might have been—and what still might be,\" Moore said in introductory remarks, and even in the first two episodes, For All Mankind demands of the viewer a reckoning. The first shots of an eager world watching the Moon landing take place not in Florida, Houston, or Washington, DC, or even in Soviet Russia. They happen in Mexico. In one of the most profoundly human moments of the first episode, a family comes together, speaking subtitled Spanish, to watch one of humanity's greatest achievements to date and remember.\n\nIn the second episode, an influential congressman wants to leverage a disillusioned astronaut into a showboating hearing that will allow him to move the players around Washington like pawns on a chessboard. The astronaut chooses to go to Washington—but then shoulders responsibility and blame himself rather than offloading it onto the congressman's chosen target.\n\nWhat if, rather than dodging responsibility, our leaders embraced it?\n\nWhat if, the show asks us, over and over again, in scene after scene after scene. What if we respected our rivals' accomplishments and used them to spur our own advancement? What if we expanded our view of who matters? What if duty, honor, and country were genuinely guiding principles?\n\nThe pointed parallels are too many to ignore. If For All Mankind is truly a look at what still might be, then it wants us to think beyond space and look around closer to home to consider what that means.\n\nFor All Mankind premieres with three episodes on Apple TV+ on Friday, November 1, before moving to a weekly release format for the remainder of the season.", "description": "\"A look at what might have been—and what still might be.\"", "authors": ["Kate Cox"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/10/Apple_TV_For_All_Mankind_key_art_16_9-760x380.jpg", "published_at": "2019-10-30"}