{"pub": "cbs", "url": "https://cbsnews.com/news/2020-daily-trail-markers-joe-kennedy-appears-with-elizabeth-warren-as-he-mulls-senate-race", "downloaded_at": "2019-09-06 12:13:38.796556+00:00", "title": "2020 Daily Trail Markers: Joe Kennedy appears with Elizabeth Warren as he mulls Senate race", "language": "en", "text": "FROM THE CANDIDATES\n\nMICHAEL BENNET\n\nColorado Senator Michael Bennet, the former Denver Public Schools superintendent, unveiled his education policy today on a trip to Iowa. CBS News campaign reporter Adam Brewster said the policy calls for universal preschool for all four-year-olds by 2024 and all three-year-olds by 2027, making community college free and four-year public college debt free for families up to 300% of the federal poverty threshold and increasing pay for teachers and other educators.\n\nBennet discussed the plan Thursday morning in Des Moines at the Jesse Franklin Taylor Education Center by focusing on early childhood education. Bennet said the Democrats have focused too much on free college and not enough on free preschool. \"They're not the priority for this field of democrats, but they're my priority,\" Bennet said referring to preschool students. Bennet also met today with Iowa State Auditor Rob Sand, an influential Democrat in the state who has met with several 2020 presidential candidates trying to win his support. \"He's a real human being,\" Sand said of Bennet, adding, \"That counts for a lot.\"\n\nCORY BOOKER\n\nAmong the Nevadans who stayed up Wednesday to see Cory Booker – the last to speak at CNN's climate town hall series – was Lynnette Hull, the 21-year-old president of the Nevada Young Democrats. While nearly every campaign in the state has launched outreach bids on Nevada campuses, Hull has handed Booker his second endorsement from a youth leader in Nevada.\n\nKatie Lim, the state's chair for the High School Democrats of America, was also an early backer of the New Jersey Democrat. \"I've had an opportunity to meet and see most of the candidates,\" Hull tells CBS News campaign reporter Alex Tin. \"I need someone that conjures up that emotional, visceral reaction of excitement in me just talking about the issues that I care most about,\" she added, praising Booker's mention of \"food deserts\" during the televised event.\n\nKAMALA HARRIS\n\nKamala Harris is boasting two New Hampshire endorsements announced ahead of the 2019 New Hampshire Democratic convention this weekend. The endorsements are from the Honorable Jackie K. Weatherspoon, a co-chair of the party's African-American Caucus, and from Brenda Lett, the NHDP African American caucus' secretary. \"Harris has clear-eyed and realistic plans, and a record to back them up,\" said Weatherspoon.\n\nCBS News campaign reporter Stephanie Ramirez notes that Harris' team previously announced endorsements from former NHDP Chairman Joe Keefe and several other Granite state leaders.\n\nEARLY STATES\n\nIN THE MIDDLE\n\nCBS News Campaign Reporter Adam Brewster says Iowa taxpayers may not be picking up any more legal bills for the discrimination case against current U.S. Ambassador to China and former Iowa Governor Terry Branstad. State Auditor Rob Sand this week said he would vote against taxpayers picking up any appeal costs after a jury found Branstad discriminated against a former state official, Chris Godfrey. The jury awarded Godfrey $1.5 million after finding Branstad and a staffer discriminated against Godfrey in 2011 because he's gay by pressuring him to resign and cutting his pay when he refused to quit. Sand has previously voted for the state to pay legal costs, but it a vote from one of three Republican officials on a state executive council would also be required before the state would stop doing so.\n\nPARTY PLANNING\n\nREPUBLICAN NOMINATION\n\nThe GOP State parties in Nevada and South Carolina are voting this weekend on whether or not to cancel their state-run nominating process, according to CBS News associate producer Ellee Watson. The move is not unprecedented for incumbent parties. In 2004, 11 states cancelled their primaries in support of President George W. Bush. The Republican National Committee has committed to sharing its data, polling, and infrastructure with the Trump re-election campaign, and the committee's 168 members in January voted to give Mr. Trump full support.\n\nCAPITOL COVERAGE\n\nRACES COLLIDE\n\nMassachusetts Representative Joe Kennedy, who is deciding whether or not to primary Senator Ed Markey, attended an office opening for 2020 presidential candidate Elizabeth Warren in Lebanon, New Hampshire. He has known her since she taught him during his first year of law school, and believes she is the best candidate for the presidency.\n\nWatson and CBS News campaign reporter Nicole Sganga report that Kennedy brushed off concern over Warren's endorsement of Markey. \"Primaries get messy. And I totally understand that. I respect her and the position of other folks in the delegation,\" he said, adding, \"That's not a major factor in my decision.\" A decision he said will come soon — \"hopefully not much longer.\"\n\nIN THE HOUSE\n\nNorth Carolina's 9th Congressional District special election between Democrat Dan McCready and Republican Dan Bishop was already a high-profile toss-up going into Tuesday. A recent poll by the bipartisan Inside Elections firm shows McCready up by 4 percent while conservative blog RRH Elections show Bishop with a 1 percent lead.\n\nOn Thursday, Larry J. Sabato's Crystal Ball changed the rating of NC-9 from \"Leans Republican\" to \"Toss-up.\" But Hurricane Dorian may have added another wrinkle to what had been considered a \"do-over\" election after ballot fraud was found in 2018.\n\nAfter four counties in the district announced they would close early voting due to Hurricane Dorian, both candidates advocated for the state's elections board to extend early voting to make up for lost hours. North Carolina State Board of Elections (NCSBE) spokesman Patrick Gannon told CBS News Political Unit broadcast associate Aaron Navarro officials are still waiting to know the true impact of the storm before they make any decision. And in a press release, NCSBE Executive Director Brinson Bell said, \"We want every eligible voter to be able to cast a ballot in the September 10 elections...I will consider remedies to the loss of early voting hours and other interruptions in the coming days, based on the conditions on the ground, the availability of polling places and workers and other factors…Any remedy must be calculated to offset the nature and scope of the disruption on voting and cannot be greater than that.\"\n\nThe latest available early voting count shows McCready with a 40% to 31% lead over Bishop, though less than 11% of eligible voters have submitted their votes.", "description": "Warren has already endorsed incumbent Democratic Senator Ed Markey in the race Kennedy is considering", "authors": ["Katie Ross Dominick"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/06/12/1691cea9-a445-48df-9a23-20a5738ccb3a/thumbnail/1200x630/ff1449c54bf8b5d726270e5888c76adc/trail-markers-graphic-presidential-4.jpg", "published_at": "2019-09-05"}