{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/nbc-might-as-well-have-named-it-penis-tv", "downloaded_at": "2019-09-18 07:26:49.591049+00:00", "title": "NBC Might As Well Have Named It Penis TV", "language": "en", "text": "Photo: David McNew, Getty\n\nNBCUniversal has officially released the name of its new service, and it is far worse than any variation on “plus” or “TV.” Folks, the name is Peacock.\n\nNBCUniversal on Tuesday announced that Peacock — and please, hold your laughter — will stream both original content as well as some of its legacy series like Parks and Recreation and The Office, both of which were streamable on Netflix in the U.S. and were among its most-watched series.\n\nEditor's Note: NBC's Peacock is unlikely to launch in Australia, so please feel free to join us in laughing about this dumb name instead.\n\nThe service will officially launch in April in the U.S. and will be both ad and subscription-based, though pricing details are yet to be announced. Peacock (lol) will launch with more than 15,000 hours of content, the media mega-company said.\n\nUnlike the abysmal initial offerings from Apple TV+, Peacock will launch with a boatload of films and series in addition to new content.\n\nPlanned originals for the service include a Battlestar Galactica reboot from Sam Esmail, the guy behind Mr. Robot, a Saturday Night Live docuseries called Who Wrote That, a Real Housewives spinoff, reboots of both Saved by the Bell and Punky Brewster, original animated content from DreamWorks Animation, and an original talk show series from Jimmy Fallon that absolutely no one needed, among a slate of other new content.\n\nOverlooking the regrettable hilarity of this designation for a brief moment, let’s point out that a peacock is, of course, the official corporate logo of NBC and has been for decades. But imagine for a moment what it must have been like being in the room when this decision was made. In an increasingly competitive streaming space, NBC’s chosen fighter is Peacock. A self-own if ever I’ve seen one! Whomst is responsible for this?!\n\nListen, maybe after launch, we’ll all become accustomed to referring to Peacock without an accompanying snicker. Maybe! But also, maybe NBC should rethink this.", "description": "NBCUniversal has officially released the name of its new service, and it is far worse than any variation on “plus” or “TV.” Folks, the name is Peacock....", "authors": ["Sarah Basford", "Mack Hogan"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/cqntautxhdmqarhso8qq.jpg", "published_at": "2019-09-18"}