{"pub": "cbc", "url": "https://cbc.ca/books/more-than-1-000-canadian-grade-12-students-to-receive-copies-of-how-to-be-a-bawse-by-lilly-singh-1.5286457", "downloaded_at": "2019-09-17 23:27:01.340859+00:00", "title": "More than 1,000 Canadian Grade 12 students to receive copies of How to Be a Bawse by Lilly Singh | CBC Books", "language": "en", "text": "More than 1,000 students entering Grade 12 across Canada will receive a copy of Lilly Singh's memoir, How to Be a Bawse.\n\nThe book's publisher, Doubleday Canada, partnered with the nonprofit organization First Book Canada to make the donation.\n\nThe donation was inspired by Singh's new late night talk show, A Little Late with Lilly Singh, which premiered on NBC on Monday, Sept. 16. The show airs on Global in Canada. Singh is the only woman to host a daily late-night show on a major broadcast network.\n\nSingh is a comedian, singer, actress and motivational speaker who began her career on YouTube. Originally from Scarborough, Ont., Singh now has more than 14 million YouTube subscribers.\n\nThe show was announced in March 2019, and at the time, Singh called the prospect of being an Indian-Canadian woman with her own late-night show \"a dream come true.\"\n\nHow to Be a Bawse is inspirational memoir, reflecting on her personal journey to superstardom and sharing lessons learned along the way.\n\nHow to Be a Bawse came out in 2017. It went to No. 1 on the Globe and Mail bestsellers list and appeared on the New York Times bestsellers list when it first came out.\n\nThe schools receiving the donation are SATEC @ W.A Porter Collegiate Institute and West Hill Collegiate in Toronto, Westwood Community High School in Fort McMurray, Alta., Prince of Wales Collegiate in St. John's and Oromocto High School in Oromocto, N.B.", "description": "The book's publisher, Doubleday Canada, is making the donation to celebrate Singh's new late night talk show.", "authors": [], "top_image": "https://i.cbc.ca/1.4450567.1513356111!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/lilly-singh.jpg", "published_at": "2019-09-17"}