{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/job-security-vs-working-for-yourself-the-pros-and-cons", "downloaded_at": "2019-10-07 23:35:49.726813+00:00", "title": "Job Security Vs Working For Yourself: The Pros And Cons", "language": "en", "text": "Image: recep-bg / iStock\n\nWorking for yourself is the dream, right? You're able to choose your own hours, working spaces, business goals and, perhaps most importantly, you don't have to answer to anyone but your fine self. To be clear, we're not talking about freelancing here, because more often than not that's still met with ultimately working for someone else and their requirements.\n\nLifehacker has partnered with CGU Insurance to help rescue Australia's lost ambition.\n\nI'd dare say we've all considered starting up our own thing at one point or another, and, with the advent of the internet and all the nomadic working opportunities that came along with it, it has become more and more within the realm of possibility.\n\nSo why aren't we all working for ourselves, then? According to Australian Government data, 424,144 ABNs died in the last year alone, which means hundreds of thousands of Aussies have likely given up on their dreams of running a business. The fear is real, so let's break down what they are and if you can overcome them.\n\nImage: Dean Mitchell / iStock\n\nWorking for \"the big guy\" comes with its advantages, but one that always comes out on top is security (once you've passed probation, of course). When you work for yourself, especially in the beginning, you can't necessarily count on the same amount coming into your account every week, let alone a pay check at all. That being said, should you be successful, some pay checks may be a lot thicker than anything you ever have, or ever will, receive in a 9-5 gig.\n\nThen there's the leave benefits of working for \"the man\", as they still so backwardly say. Getting paid even if you're kicking back in Santorini, or nursing a flu while digesting the final season of Orange Is The New Black (not groundbreaking, FYI), is very, very neat. In short? Annual leave and sick leave aren't something to disregard here. They are truly special concepts that you're only really gifted via an office environment.\n\nObviously working for yourself, especially once you're truly established, you can choose where, when and for long you go somewhere with no approval needed. Again, this is something that's not as readily available, or not super strategic, in the beginning of starting your own business. Depending on your business-owning style, this might not be something you want to do in the midst of success, either, but when it comes to a last-minute hootenanny or an unexpected hangover? You're laughing.\n\nImage: Antonio_Diaz / iStock\n\nThis brings me to my next point: independence. In 2019 it's what we all crave and we hate feeling locked down - whether that's in a relationship, location, house or job. Working for yourself will, of course, make you feel independent and, similarly, it will make you feel extremely empowered, fulfilled and proud as achievements are truly yours, not a company's that's claiming your successes as their own.\n\nThea Mendes, who started a dog donut business, DOMUTS, alongside her son, Marcus, is an example of someone who's working towards the benefits of this freedom and independence combined. \"There is no better reward than seeing first-hand results from your own ambition and hard work,\" she said. \"Having your own business also gives you the freedom and flexibility to work when it suits you and still be able to do the school pick up.\"\n\nThea’s first run with DOMUTS had to be put on hold, as she couldn’t keep up supply for demand. However, CGU Insurance, who cares about getting ambitious businesses on track, helped her refresh her brand, refine her product and plan her business for scaling, she’s been able to re-launch with a bang.\n\nAt the moment Thea still maintains a full-time job, which helps protect her from something that stops people taking a leap into working for themselves - a fear of failure and fear of financial instability, primarily – but also fear of being patient enough to wait for the company to thrive, so you can actually reap the benefits that come along with ditching the daily grind.\n\nThea has big ambitions for the business, but if you take a leaf out of her book and position it as a side-hustle in the beginning, you can alleviate a lot of these stresses until you start making the big time, because then security and stability are more concrete rather than a potential.\n\nOf course it's going to be a tough slog in the beginning trying to juggle that - but the payoff will be worth it. Because nothing good in this life came easy, you just need to assess whether or not your current working situation aligns with the life you one day want to live.\n\nBecause if it's not? Then your dreams could go unrealised, and that would be a crying shame.\n\nIgnite your ambition today and apply for a CGU Insurance Ambition Grant HERE.\n\nCGU Insuring Ambition.", "description": "Working for yourself is the dream, right? You're able to choose your own hours, working spaces, business goals and, perhaps most importantly, you don't have to answer to anyone but your fine self. To be clear, we're not talking about freelancing here, because more often than not that's still met with ultimately...", "authors": ["Chris Jager"], "top_image": "https://edge.alluremedia.com.au/m/l/2019/09/iStock-1059245842.jpg", "published_at": "2019-10-07"}