{"pub": "yahoo", "url": "https://news.yahoo.com/could-taking-hormone-therapy-menopause-improve-cognition-143255726.html", "downloaded_at": "2019-10-16 21:20:52.201554+00:00", "title": "Could taking hormone therapy after the menopause improve cognition?", "language": "en", "text": "New US research has found that taking hormone therapy -- medications that replace the female hormones no longer made by the body after menopause -- could help improve cognition postmenopause.\n\nThe new study looked at more than 2,000 postmenopausal women and followed them over a 12-year period to investigate the link between the hormone estrogen and cognitive decline.\n\nThe researchers analyzed the women's exposure to estrogen by recording information such as the women's age at menarche, which is a female's first period, their age at menopause, the number of pregnancies, duration of breastfeeding and use of hormone therapy.\n\nThe findings, published online in Menopause, the journal of The North American Menopause Society (NAMS), showed that women who were exposed to estrogen for a longer duration of time appeared to have better cognition.\n\nIn addition, those who started hormone therapy earlier had higher cognitive test scores than those who started taking hormones later. Starting hormone therapy earlier also appeared to be particularly beneficial for the oldest women in the study.\n\nIt is already known that estrogen is important for overall brain health and cognitive function, and with women making up two-thirds of the 5.5 million cases of Alzheimer disease in the United States women, it has been suggested that sex-specific factors such as estrogen could play a role in increasing a woman's risk for the disease.\n\nThe new findings suggest that a longer reproductive window, complemented with hormone therapy, may benefit a woman's cognition.\n\n\"Although the assessment of the risk-to-benefit balance of hormone therapy use is complicated and must be individualized, this study provides additional evidence for beneficial cognitive effects of hormone therapy, particularly when initiated early after menopause. This study also underscores the potential adverse effects of early estrogen deprivation on cognitive health in the setting of premature or early menopause without adequate estrogen replacement,\" says Dr. Stephanie Faubion, NAMS medical director.", "description": "New US research has found that taking hormone therapy -- medications that replace the female hormones no longer made by the body after menopause -- could help improve cognition postmenopause.  The new study looked at more than 2,000 postmenopausal women and followed them over a 12-year period to investigate", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/oRCsKWUHizoTvASCZIsf9w--~B/aD0xOTI0O3c9Mjg4MztzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_US/News/US-AFPRelax/istock_466317180.2fcab091526.original.jpg", "published_at": "2019-10-16"}