{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3068865&cloc=joongangdaily|home|top", "downloaded_at": "2019-10-09 12:01:12.140574+00:00", "title": "Second anti-Cho rally in six days dominates central Seoul", "language": "en", "text": "Protesters march toward the Blue House after conservative groups held a rally at Gwanghwamun Square, central Seoul, calling for the resignation of Justice Minister Cho Kuk. [YONHAP]\n\nA big anti-government rally took place near the Blue House on Wednesday, as protesters gathered for the second time in a week to demand President Moon Jae-in to dismiss scandal-ridden Justice Minister Cho Kuk.A conservative group critical of the Moon administration organized the rally near Gwanghwamun Square on Hangul Day, which celebrates the Korean alphabet. It was the conservatives’ second demonstration against the administration following a big rally last Thursday, another national holiday.The Pan-National Alliance to Oust Moon Jae-in, the organizer of the rally, said it wants the resignations of both Moon and Cho. The group is headed by one of Moon’s most aggressive critics, Reverend Jun Kwang-hoon, head of the Christian Council of Korea. The alliance formally started the demonstration around 1 p.m., but protesters started showing up earlier in the morning.In addition, other conservative groups hosted similar rallies in central Seoul throughout the day.The main opposition Liberty Korea Party (LKP) said it was not a sponsor of the protest but its members participated individually. LKP leaders including Chairman Hwang Kyo-ahn and floor leader Na Kyung-won attended.The organizer told police it was hosting a rally for 5,000, but leader Jun said the turnout was over 10 million. “From Seoul Station to the Blue House, the streets are filled with protesters,” he said.The police declined to announce a crowd size as organizers of competitive rallies - to denounce Cho and support him - are competing on claims of crowd size.Expressing concerns about the overheated rivalry between protesters, Moon issued a message on Monday saying it was undesirable for differences in political opinions to lead to confrontations. He said people’s opinions can be divided, but he didn’t think the nation was split over the Cho controversy. He also called for a swift completion of the administration’s initiative to reform the prosecution.That message held little sway with protesters demanding Moon sack Cho.“I came here because I am angry,” Lee Su-ok, a 48-year-old resident of Hanam, Gyeonggi, told the JoongAng Ilbo. “I don’t support the rightists or the leftists. I just want my children to live in a better world than I had lived in.”Protesters holding national flags and signs with slogans such as “Cho Kuk Out” and “Oust Moon Jae-in” occupied the main road from Gwanghwamun to City Hall. The 1.2-kilometer (0.75-mile) 10-lane road as well as Gwanghwamun Square and Seoul Plaza were filled with protesters. The police detoured traffic in central Seoul throughout the day.Earlier in the morning, the government hosted an outdoor event at Gwanghwamun Square to commemorate Hangul Day. The event wrapped up around 10:40 a.m., and the protesters started moving in.“Today, we are having our second rally,” said Lee Jae-oh, a former lawmaker and ally of conservative former President Lee Myung-bak, who was a senior member of the organizing group, in an address to the crowd. “Let’s have an orderly, peaceful protest, just like we did the first time.”After Lee announced, “Let’s fight to the end to remove President Moon Jae-in,” protesters raised their voices and chanted slogans such as “Oust Moon” and “Send Cho to jail.”Mr. Bae, a 43-year-old office worker who didn’t want to be identified by his full name, said he decided to join the rally because he thinks Cho is unfit to serve as justice minister. “I wasn’t really interested in what was going on, but what’s happening now is against our common sense,” Bae said. “I agree with the need to reform the prosecution, and I also want the lawmakers to verify the initiative. But most of all, Cho must resign first.”A group of students from Seoul National University, where Cho taught law as a professor for years before joining the Moon administration, also held a rally in the nearby Cheonggye Plaza to demand Cho’s resignation. The students said they would join the conservative demonstration after their own protest to condemn Cho and the alleged academic irregularities committed by his family.Supporters of Cho will hold a rally outside the prosecution’s headquarters in Seocho-dong, southern Seoul, on Saturday night. It will be the ninth liberal gathering to support Cho and his reform plans for the prosecution.The organizer of that rally said Monday that the upcoming event will be its last demonstration. “The time has come to ask the politicians, president and minister to complete the task,” the organizer said.Meanwhile, the latest poll showed that Moon’s approval rating was 32.4 percent, a fall of 6.7 percentage points since January, while his disapproval rating was 49.3 percent, a rise of 9.9 percentage points.Commissioned by the Naeil Shinmun and Sogang University’s Institute of Political Studies, Hankook Research polled 1,200 adults nationwide from Sept. 26 till Oct. 2. The survey had a 95 percent confidence level and a plus or minus 2.8 percentage point margin of error.BY KIM TAE-HO, LEE BYUNG-JUN AND SER MYO-JA [ser.myoja@joongang.co.kr]", "description": "", "authors": [], "top_image": "https://pds.joins.com/jmnet/koreajoongangdaily/_data/photo/2019/10/09201929.jpg", "published_at": "2019-10-09"}