{"pub": "rt", "url": "https://rt.com/news/470445-adobe-cancels-venezuela-subscriptions/ ", "downloaded_at": "2019-10-08 15:09:58.705521+00:00", "title": "Some targeted sanctions! Adobe cancels all subscriptions in Venezuela, no refunds will be allowed", "language": "en", "text": "Washington likes to claim that the sanctions it imposes against foreign nations are tailored to harm the rulers and spare the common folk. Well, here is Adobe banning all of its Venezuelan customers.\n\nCalifornia based software giant Adobe Inc. is best known for its array of designer tools like Photoshop and Illustrator. Lately, the company has been switching to a subscription-based business model, which means clients pay regular fees to keep using its products rather than make a one-time purchase and own them. Later this month, all subscriptions in Venezuela will be canceled without refund, Adobe informed its clients in emails sent this week.\n\nThe company said it cannot offer its services in the South American country because in August, President Donald Trump issued an executive order which essentially bans almost all transactions between the two nations. Ostensibly, it is meant to punish only the government of President Nicolas Maduro, but its definition of who is part of that government is rather wide. It includes “any person who has acted or purported to act directly or indirectly for or on behalf of” Venezuela’s many governmental branches.\n\nAlso on rt.com US sanctions bite into Cuban healthcare – despite claims they only affect leadership\n\nApparently, Adobe executives decided they would rather lose the relatively small Venezuelan market than take the risk of sending high-paid corporate lawyers to explain to the US Treasury why some clerk in Caracas managed to use Photoshop to create pics telling Trump to get his hands off the country.\n\nVenezuelans using Adobe’s cloud services have until October 28 to download their files before their accounts are deleted. And nobody should expect any refunds – Adobe says paying them back would violate government policy, too. A critic would say it just shows that America Inc. is both cowardly and greedy, but we’ll just assume Adobe is being cautious and law-abiding. Once the purge of subscriptions is done, no Adobe products will be legally available to anyone in Venezuela, not even free ones.\n\nThe US routinely uses economic sanctions against nations it doesn’t like, some of them kept in place for decades. Venezuela has come under increased sanctions pressure this year as the Trump administration launched a so far unsuccessful campaign to replace Maduro with a leader of its choice.\n\nAlso on rt.com Top economists & UN experts condemn US sanctions on Venezuela. Not newsworthy enough for the media?\n\nAdobe’s withdrawal will probably result in some increase in software piracy in Venezuela, but not every effect of sanctions is so harmless. They tend to force governments to cut social welfare programs, restrict the supply of lifesaving medicine, and otherwise make life more difficult for the most vulnerable people. Venezuela in particular has seen as many as 40,000 excess deaths linked to sanctions since 2017, an estimate published in April by the Center for Economic and Policy Research – and no key-gen or crack program can fix that.\n\nIf you like this story, share it with a friend!", "description": "Washington likes to claim that the sanctions it imposes against foreign nations are tailored to harm the rulers and spare the common folk. Well, here is Adobe banning all of its Venezuelan customers.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5d9c82ef85f5401d171d3556.JPG", "published_at": "2019-10-08"}