{"pub": "metro", "url": "https://metro.co.uk/2019/10/04/happened-pewdiepies-wife-marzia-kjellberg-romantic-getaway-10860507", "downloaded_at": "2019-10-05 05:46:33.758904+00:00", "title": "What happened to PewDiePie’s wife Marzia Kjellberg on their romantic getaway?", "language": "en", "text": "Marzia suffered an injury (Picture: PewDiePie/Instagram)\n\nMarzia Kjellberg suffered a gruesome injury while on a second honeymoon with husband PewDiePie.\n\nThe pair jetted off to Japan, which is where they got engaged back in 2018.\n\nHowever, in the midst of all that cuteness, Marzia had a bit of a mishap…\n\nWhat happened to PewDiePie’s wife Marzia Kjellberg?\n\nWhile away on their trip, Marzia, 26, had her toe badly cut by a knife which fell from its packaging as she opened it.\n\nThe social media star shared a picture of the offending knife with her followers, writing: ‘I was opening the packaging for this knife and it slid out and landed tip first vertically onto my bare toe. Not fun. Lots of blood.\n\nThe offending knife (Picture: itsmarziapie/Instagram)\n\n‘Just a reminder to be careful while handling knives.’\n\nMarzia then went on to soothe her concerned fans, saying: ‘Thank you all for worrying about the toe. It is a very dark purple colour near the cut, so it’s not looking pretty BUT I’ve been able to walk all day so I assume it’s not that serious. I’m hoping it will heal on its own.’\n\nAn update from Marzia (Picture: marziapie/Instagram)\n\nIt’s not all been doom and gloom, however, as Marzia has also been sharing some lovely pics of her trip in Tokyo with her YouTube star husband, whose real name is Felix Kjellberg.\n\nAdvertisement\n\nAdvertisement\n\nA highlight has been Felix, 29, dancing and having a laugh with a Japanese street performer.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nThe jet-set pair have gone on a second honeymoon to Japan after marrying in August following eight years spent together.\n\nTheir first honeymoon was in Bali, and we’re trying very hard not to be jealous.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Gigi Hadid doesn’t miss a beat as she marches YouTube prankster off Chanel catwalk at Paris Fashion Week\n\nMORE: YouTuber Logan Paul forces ‘sex ban’ on himself to store enough testosterone to beat KSI in boxing match", "description": "Marzia Kjellberg suffered a gruesome injury while on a second honeymoon with husband PewDiePie.", "authors": ["Aidan Milan"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_88168601-e1570179979761_1570183929.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-04"}