{"pub": "townhall", "url": "https://townhall.com/tipsheet/cortneyobrien/2019/10/09/tragic-bernie-sanderss-daughterinlaw-dies-shortly-after-cancer-diagnosis-n2554451", "downloaded_at": "2019-10-09 22:04:31.314015+00:00", "title": "Tragic: Bernie Sanders's Daughter-in-law Dies Shortly After Cancer Diagnosis", "language": "en", "text": "Sen. Bernie Sanders's (I-VT) lost his daughter-in-law, Raine Riggs, on Saturday to cancer, her family announced on Wednesday. She was just 46 years old.\n\nIt was just last week that Riggs, who was married to Sanders' son Levi, was diagnosed with neuroendocrine cancer. Her family is devastated.\n\n“How do you go on day by day when your heart just keeps breaking over and over?\" Riggs’ family wrote in an obituary. \"How do you get out of bed in the morning when every breath you take is so painful you just want to cover your head with your blanket and hide away from the world? How can the laughter and smiles of three children heal your heart while at the same time you are crying? How can the world ever be the same when it said goodbye to such a beautiful soul? It is simple.... our world will never be the same.” (NY Daily News)\n\nA few of Sanders's opponents expressed their condolences online.\n\nMy heart goes out to @BernieSanders and his entire family as they mourn the loss of Rainè Riggs. — Tom Steyer (@TomSteyer) October 9, 2019\n\nSanders has had a rough couple of weeks, having just suffered a heart attack. The presidential candidate used to hold three or four rallies a day, but he admitted on Wednesday that he'll have \"to change the nature of his campaign a bit\" to check his health.\n\nHere's Senator @BernieSanders' full answer on getting back to the trail, referenced above pic.twitter.com/pL7OfCo7hG — Cara Korte (@CaraKorte) October 9, 2019\n\n\"I think what I'm just focused on now is gaining my endurance back,\" Sanders told reporters on Wednesday.\n\nThe way he plans to do that is by walking as often as he can, he added.", "description": ".10/09/2019 18:02:20PM EST.", "authors": ["Cortney O'Brien", "Matt Vespa", "Bronson Stocking"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/267/af1ba20f-e0fc-4eb4-b782-42444ce0793c.png", "published_at": "2019-10-09"}