{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/06/german-minister-travels-greece-turkey-stop-new-migrant-crisis", "downloaded_at": "2019-10-07 00:07:16.855358+00:00", "title": "EU, German Govt Travelsto Greece, Turkey to Discuss New Migrant Crisis", "language": "en", "text": "German interior minister Horst Seehofer travelled to Turkey and Greece this week to meet with government leaders to prevent a new migrant crisis.\n\nMr Seehofer travelled to Turkey on Thursday with a delegation of the European Commission as well as French Interior Minister Christophe Castaner. They sought to negotiate with the Turkish government which has threatened to release more migrants into Europe, Bild reports.\n\n“The development of migration in the Aegean deserves our increased attention,” Seehofer said on Wednesday, adding: “The year 2015 should not be repeated.”\n\nThe joint mission comes over three years since the European Union negotiated a deal with the Turkish government to stem the flow of migrants. In exchange, the EU promised to send the country three billion euros and grant Turks visa-free access to the bloc’s borderless Schengen Area.\n\nErdogan Threatens to ‘Open the Gates’ to Migrants Unless Turkey Receives Aid https://t.co/oczI9Ol37Q — Breitbart London (@BreitbartLondon) September 7, 2019\n\nHowever, much of the promised funds have not been delivered to Ankara, but rather to various projects aimed at helping asylum seekers. Nor has the promise of visa-free access materialised.\n\nTurkey has also seen a surge of new Syrian asylum seekers coming across its southern border in recent months and has proposed a programme to settle them along the border. But the country has demanded cash and support from the European Union, threatening to unleash a wave of migrants into Greece and repeating the influx of 2015 — which was encouraged by Germany’s Angela Merkel at the time.\n\n“Give us logistical support, and we can build houses up to 30 kilometres into the north of Syria,” Turkish President Recep Tayyip Erdoğan said last month, warning: “Either that happens, or we open the gates.”\n\nAfter meeting with Turkish foreign minister Mevlüt Çavuşoğlu, Seehofer planned to visit the Greek island of Lesbos on Friday, where migrant reception centres are pushed to their limits as new arrivals surge.\n\nLocals on the island have complained that Turkey has been allowing migrants through as the infamous Moria migrant camp, which is meant to house 3,000 people, has swollen to around 13,000.\n\nAustria’s Sebastian Kurz Warns of New Migrant Wave ‘Brewing’ https://t.co/pSxWAzyfHP — Breitbart London (@BreitbartLondon) September 25, 2019", "description": "Germany's interior minister travelled to Turkey and Greece this week to meet with government leaders to prevent a new migrant crisis.", "authors": ["Chris Tomlinson"], "top_image": "https://media.breitbart.com/media/2017/08/GettyImages-806078794.jpg", "published_at": "2019-10-06"}