{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7573173/Reckless-bosses-run-pensions-ground-face-seven-years-jail.html", "downloaded_at": "2019-10-14 23:30:56.683133+00:00", "title": "Reckless bosses who run pensions into the ground face...", "language": "en", "text": "Reckless bosses who plunder pension schemes will face up to seven years in jail under new legislation.\n\nThe Pension Schemes Bill will bring in a new sentence of up to seven years in prison for bosses who run their pension schemes into the ground or plunder them to line their own pockets, the Department for Work and Pensions (DWP) said.\n\nIt follows a consultation earlier in the year.\n\nThe Bill also paves the way for “pensions dashboards” – where people will be able to see all their pensions in one place online – to be introduced.\n\nThe industry has already been trialling the first models with more expected to be tested next year.\n\nIt means that people will be able to get an overview of all their retirement savings at the touch of a smartphone screen – making it easier to work out how much they still need to save.\n\nA new type of pension will also be introduced under the plans (Anthony Devlin/PA)\n\nA new type of pension will also be introduced under the plans – the collective defined contribution pension scheme.\n\nThis is a “middle ground” option between defined contribution (DC) pensions, where the burden of the risk of how much a saver ends up with in retirement lies with the individual, and defined benefit (DB) pensions where savers are promised that they will receive certain amounts in retirement.\n\nDB pensions, such as final salary and career average schemes, have become increasingly rare due to the costs involved as people live for longer.\n\nWith a collective defined contribution scheme, a group of employees pay into a single big pot and draw out a retirement income from it. This means risks such as life expectancy can be shared across employees in the scheme.\n\nSecretary of State for Work and Pensions Therese Coffey said: “This Pension Schemes Bill is the next crucial step in making the UK the best place in the world to retire.\n\n“We are pushing ahead with our latest revolutionary reforms. With this legislation, we’ll ensure reckless bosses are brought to book, transform the way people get information about their retirement savings and introduce a whole new pension to the market boosting returns for millions.”\n\nCharles Counsell, chief executive of the Pensions Regulator (TPR), said: “We welcome the measures announced in the Pensions Schemes Bill which will allow us to continue in our commitment to be a clearer, quicker and tougher regulator.\n\n“The Bill would give us the power to set and enforce clearer scheme funding standards in defined benefit pension schemes while also providing early warning of potential problems.\n\n“Where problems do arise, new criminal sanctions and civil fines will act as a strong deterrent against risky and reckless behaviour, giving us flexibility to issue fines at the appropriate level, depending on severity.\n\n“We also welcome the innovation of collective defined contribution if this can provide better outcomes for savers and employers without increasing risk.\n\n“We are working closely with Government to ensure an effective regulatory regime.”\n\nGregg McClymont, director of policy at the People’s Pension, said the pensions dashboard will not work unless all savers can see all their pensions in one place.\n\nHe said: “Total coverage is therefore crucial.”\n\nSir Steve Webb, director of policy at Royal London, said some “key measures”, such as the potential for bringing workers aged under 22 years old into the automatic enrolment workplace savings scheme, were absent.\n\nSir Steve said: “As a result, the vital expansion of automatic enrolment is now on hold.”", "description": "A new Bill also paves the way for `pensions dashboards´ - where people will be able to see all their pensions in one place online - to be introduced.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/00/wire-19715146-1571094234-693_636x382.jpg", "published_at": "2019-10-14"}