{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/star-wars-fans-noticed-detail-145400484.html", "downloaded_at": "2019-10-25 16:42:36.641704+00:00", "title": "'Star Wars' Fans Noticed a Detail in the New 'Rise of Skywalker' Trailer That Supports a Major Kylo Ren Theory", "language": "en", "text": "Photo credit: Disney More\n\nFrom Esquire\n\nWhy is Episode 9 called Rise of Skywalker? Luke is dead. It's been confirmed that we'll be saying goodbye to Leia Organa, Luke Skywalker's twin sister, in the first act of Rise. And based on what we learned from Last Jedi, Rey is not a Skywalker. So, as of now, we know there is only one remaining Skywalker in the world of Star Wars–Kylo Ren, aka Ben Solo. If the big finale to the Skywalker saga is going to show a certain Skywalker \"rise,\" then we must assume that it's going to be Adam Driver's character.\n\nA leading theory that's been making the rounds on Star Wars spoiler sites is that Ben Solo will fall to his death in the Rise of Skywalker. This is a popular way to die in this saga, considering that's how we saw Boba Fett, Emperor Palpatine, and Darth Maul go out in Star Wars.\n\nThis theory gained a lot of credence recently when fans finally got to see the final trailer for Rise of Skywalker earlier this week.\n\nPhoto credit: Disney/Lucasfilm More\n\nIf you take a look at the top of the frame above, you'll see what fans are saying looks like the aforementioned \"pit.\" Rey stands in front of a resurrected Palpatine, alone, ready to confront him and bring an end to the Dark Side of the Force once and for all. But where's Ben? From what the leakers on Reddit are saying, the moody Skywalker nephew is at the bottom of that deep, dark hole.\n\n\n\nBut, as in the case of Palpatine and Darth Maul, being thrown down a pit doesn't mean that Ben Solo is definitely gone. In fact, his climb back to ground-level may explain why the film is called Rise of Skywalker. Get it? He physically \"rises\" out of the depths to confront the Dark Lord of the Sith with Rey.\n\nPhoto credit: Reddit More", "description": "It looks like Adam Driver's character may have a 'Dark Knight Rises' climb of his own.", "authors": ["Dom Nero"], "top_image": "https://s.yimg.com/uu/api/res/1.2/BsigIcyZ_u44V9FMEYBLjA--~B/aD03MTg7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/esquire_269/d8e819fd44ffaf8e40c7ca9d70c05446", "published_at": "2019-10-25"}