{"pub": "independent", "url": "https://independent.co.uk/news/uk/crime/chinese-reporter-slapping-student-conservative-party-conference-birmingham-a9150181.html", "downloaded_at": "2019-10-10 15:21:16.141677+00:00", "title": "‘I was in fear’ – Chinese state reporter accused of slapping student gives evidence in Birmingham", "language": "en", "text": "A political correspondent accused of slapping a Conservative Party conference delegate across the face has told a court she pushed her alleged victim away as ”natural instinct” as she feared she would be attacked.\n\nLinlin Kong, a reporter with Chinese state broadcaster CCTV, claims she used a hand to push away one of several men who surrounded her after she asked a question at a fringe conference event in Birmingham discussing democracy in Hong Kong.\n\nShe denies common assault.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nGiving evidence on Wednesday, the 49-year-old said she had been left feeling humiliated and had not expected to be treated in such a way in the UK.\n\nMs Kong, of King’s Cross, London, is standing trial at Birmingham Magistrates’ Court over the alleged assault on Enoch Lieu during last year’s Tory conference at the city’s International Convention Centre.\n\nAddressing the court with the assistance of an interpreter, Ms Kong said she was approached by Mr Lieu, a member of Newcastle-under-Lyme Conservatives, near the end of a question-and-answer session chaired by Tory MP Fiona Bruce.\n\nShape Created with Sketch. Theresa May dancing on to stage before major conference speech Show all 12 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Theresa May dancing on to stage before major conference speech 1/12 Britain's Prime Minister Theresa May dances as she takes to the stage to give her keynote address on the fourth and final day of the Conservative Party Conference at the International Convention Centre in Birmingham AFP/Getty 2/12 AFP/Getty 3/12 AFP/Getty 4/12 Getty 5/12 AFP/Getty 6/12 AFP/Getty 7/12 PA 8/12 AFP/Getty 9/12 AFP/Getty 10/12 PA 11/12 AFP/Getty 12/12 Getty 1/12 Britain's Prime Minister Theresa May dances as she takes to the stage to give her keynote address on the fourth and final day of the Conservative Party Conference at the International Convention Centre in Birmingham AFP/Getty 2/12 AFP/Getty 3/12 AFP/Getty 4/12 Getty 5/12 AFP/Getty 6/12 AFP/Getty 7/12 PA 8/12 AFP/Getty 9/12 AFP/Getty 10/12 PA 11/12 AFP/Getty 12/12 Getty\n\nClaiming she had no idea who Mr Lieu was, the reporter said he had asked her to leave after she claimed one of the panellists was lying by saying he was pro-China.\n\nShe said of Mr Lieu: “He repeated what the chairlady said – he wanted me to leave. There were people in front of me and behind me ... all of them men.\n\n“I was shocked. I refused to leave and then he started to touch me. He used his hands to push me.\n\n“Not only was the man pushing me, I was surrounded by four or five people. I was in fear.”\n\nAsked by defence barrister Timothy Raggatt QC if she had done anything to the alleged victim, Ms Kong added: “I told him ‘Don’t touch me, don’t touch me’. He just kept pushing me and at that time I pushed him away.\n\n“I was being attacked by a male in public, it was my natural instinct to do this.”\n\nMs Kong, who maintains she was acting to protect herself, said the moment when she pushed out had been captured on video by a bystander.\n\nUnder cross-examination from prosecutor Maria Karaiskos, she denied she had slapped Mr Lieu in the face before the video was filmed.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nMs Karaiskos asked the journalist: “When he approached you, you became annoyed with him didn’t you?”\n\nMs Kong responded: “I was scared at that time, I was nervous.\n\n“When he used his hands to push me, I was shocked. I didn’t expect this to happen in public.”\n\nThe trial was adjourned until October 31.\n\nPA contributed to this report", "description": "A political correspondent accused of slapping a Conservative Party conference delegate across the face has told a court she pushed her alleged victim away as ”natural instinct” as she feared she would be attacked.", "authors": ["Stephen Mahon"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/10/11/kong-linlin-screenshot.jpg", "published_at": "2019-10-10"}