{"pub": "nymag", "url": "https://thecut.com/2019/09/angie-mar-releases-new-cookbook-butcher-beast.html", "downloaded_at": "2019-10-01 00:17:07.322797+00:00", "title": "The Glamorous Chef Who Gives Beef As a Present", "language": "en", "text": "Photo: Johnny Miller\n\nAngie Mar’s life revolves around meat. She even swears her secret to good skin is all the collagen in beef. Mar is the chef and owner of the Beatrice Inn, and the author of Butcher + Beast, her first cookbook, out today. But Mar is no Martha Stewart — her cookbook is sexy and stylish (she wears Oscar de la Renta on the cover). I’m a vegetarian who can barely walk through the meat section of a grocery store without getting icked out, but I am oddly compelled by the photos of raw, dry-aged steak that accompany her recipes. She spoke to the Cut about beef as a thank-you present, martinis, and what to drink when you’re in love.\n\nHow do you thank someone for a gift? There are two things I always love giving as a thank you: Champagne and beef. I love to give someone something that they can enjoy later, and a steak, a bottle, and beautiful handwritten note with a recipe is always chic.\n\nWhat would you never wear?\n\nDenim and the color purple.\n\nWhat’s your dream vacation?\n\nI always say I am very French at heart, so whether I have a spare 36 hours or a full month, you’ll often find me running off to Paris or St. Barts for a holiday.\n\nWhat’s a good book on your coffee table right now?\n\nHelmut Newton: Polaroids, and of course, the first copy of my upcoming book, Butcher & Beast.\n\nLast show you binge-watched?\n\nPeaky Blinders and Versailles — I’ve always loved a period piece.\n\nSecret to hosting a good party?\n\nAn array of Champagne and martinis, and food that can be eaten with your hands — not hors d’oeuvres or anything silly and prissy. I mean whole lobsters and oysters on the half shell, beef bones and fried chicken, all served on a table for everyone to enjoy. I always love a party that gets a bit messy — everyone’s inhibitions are lost, and that is when the fun truly begins.\n\nWhat is a trend that you like right now?\n\nBeing unfiltered.\n\nOne you don’t understand?\n\nVeganism.\n\nFavorite museum/gallery?\n\nPetit Palais in Paris and The Met in New York.\n\nShoes you wear most often?\n\nBlack Chanel combat boots, Adidas Stan Smiths, or the highest heels possible.\n\nWhat is your favorite space in your studio/office/home?\n\nThis is my favorite table at the Beatrice Inn, table 26. Some of my best memories, dinners with friends and family, and creations have happened at this table. I love to sit here when we are closed and work; it’s just very comfortable to me.\n\nPhoto: Courtesy of Angie Mar\n\nWhat’s your favorite…?\n\nPajamas?\n\nJosie Natori silk pajamas or my favorite worn-in white tee.\n\nCandle?\n\nBYREDO, Fleur Fantome.\n\nScent?\n\nI don’t wear perfume because I am in the kitchen most of the time. But I love the smell of peonies and English roses, sage, and vanilla.\n\nDrink?\n\nWhen I am in love and when I am not in love: Champagne\n\nWhen I am creating a menu: Dirty martini, three olives\n\nWhen I am with my girlfriends: Brenne Whiskey\n\nWhen I am finishing a great meal: Vintage Madeira\n\nSocks?\n\nMy very warm, pink hunting socks when I’m at home. And hosiery that’s 15 denier when I’m out.\n\nT-shirt?\n\nI am actually more of a hoodie or sweatshirt girl. Autum Studios made me these amazing hoodies with Johnny Miller’s artwork from my book — truly what I want to live in this fall.\n\nCan you share three Instagrams or photos of yourself that define your style? And a brief explanation of why?\n\nMy style tends to vary from night to night depending on my mood and where I am going. I love blending the notions of femininity and masculinity, both when I create dishes and when I curate my wardrobe. Menswear inspired pieces like tuxedos and very feminine silhouettes like body-con dresses are in constant rotation, and I always love a good fur.\n\nShop the Story\n\nNatori Nikko Classic Pajama Set Available in sizes XS–XL. $180 at Neiman Marcus Buy\n\nIf you buy something through our links, New York may earn an affiliate commission.", "description": "Angie Mar, the owner and chef of the Beatrice Inn, is the latest to be featured in our Tastemakers series.", "authors": ["Sarah Spellings"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/27/tastemakers-angie-mar/Angie-Mar-by-Johnny-Miller.w1200.h630.jpg", "published_at": "2019-09-30"}