{"pub": "arynews", "url": "https://arysports.tv/northern-bags-national-t20-cup-2019-title-faisalabad", "downloaded_at": "2019-10-24 23:47:40.458227+00:00", "title": "Northern bags National T20 Cup 2019 title in Faisalabad", "language": "en", "text": "Experienced Sohail Tanvir bagged three wickets to help Northern beat Baluchistan by 52 runs and lift the National T20 Cup 2019 which first time included only six regions according the Pakistan Cricket Board (PCB)’s new domestic structure.\n\nThe Opening batsman and vice-captain of Northern, Umar Amin, smashed half-century to help his team post 167-5 in 20 overs while batting first. He scored 60 runs off 38 balls laced with six boundaries and three sixes.\n\nBowling all-rounders Mohammad Nawaz and Shadab Khan made 31 and 25 runs respectively. They both put 58 runs together for the sixth wicket.\n\nAmad Butt and Hussain Talat took two wickets each for Baluchistan.\n\nIn reply, Baluchistan bowled out for 115 runs. Left-handed batsman Imran Farhat remained the highest scorer for them with 32 runs. Awais Zia scored 28 runs.\n\nBowlers of Northern dominated the second inning completely as apart from Tanvir, Shadab Khan and Mohammad Nawaz shared two wickets apiece to end the game for opponents.\n\nWith this win, Northern bagged the title and prize bag of Rs 5 million with the trophy. Runners-up Baluchistan pursed prize money of Rs 2.5 million.\n\nKhyber Pakhtunkhwa’s skipper Mohammad Rizwan named the best player of the tournament with scoring 215 runs and taking six catches behind the stumps. Baluchistan’s Owais Zia won the best batsman of the tournament award with scoring 276 runs.\n\nNorthern’s Sohail Tanvir with 14 wickets received the best bowler of the tournament award. Young Rohail Nazir bagged best wicket-keeper of the tournament award.\n\nAll the individual performers received prize money of Rs 0.1 million each.\n\nComments\n\ncomments", "description": "Experienced Sohail Tanvir bagged three wickets to help Northern beat Baluchistan by 52 runs and lift the National T20 Cup 2019 which first time included only six regions according the Pakistan Cricket Board (PCB)'s new domestic structure.", "authors": [], "top_image": "https://arysports.tv/wp-content/uploads/2019/10/Northern-1.jpg", "published_at": "2019-10-24"}