{"pub": "cnbc", "url": "https://cnbc.com/2019/10/17/heres-where-the-millennial-millionaires-live-around-the-us.html", "downloaded_at": "2019-10-17 14:26:18.744613+00:00", "title": "There are 618,000 millennial millionaires in the US—and 44% of them live in 1 state", "language": "en", "text": "There are approximately 618,000 \"millennial millionaires\" — those with a net worth of over $1 million — in the United States, according to a 2019 report from Coldwell Banker Global Luxury and WealthEngine, which defines millennials as those born between 1982 and 1996, or ages 23 to 37 in 2019.\n\nThe population of wealthy young people is growing, the report finds. And they're getting richer: \"By 2030, millennials will hold five times as much wealth as they have today, and are expected to inherit over $68 trillion from their predecessors in the Great Transfer of Wealth.\"\n\nThe \"Great Wealth Transfer\" refers to the trillions of dollars that will be passed down to millennials from their baby boomer parents, who are considered the wealthiest generation in history.\n\nAlmost half, 44%, of the millennial millionaires are concentrated in California. That's \"consistent with the general millionaire population,\" the report says, adding that \"the Golden State also has the highest percentage of business owners (23%) and the highest percentage of real estate investors.\"\n\nNew York ranks No. 2. It's home to 14% of the millennial millionaire population.\n\nThe top ZIP code for young millionaires, though, is in neither CA or NY: It's in Traverse City, Michigan (49685).\n\nHistorically a tourist destination, the Lake Michigan beach town has \"a robust second-home market where luxury homes generally start at $500,000 — a far cry from many Silicon Valley ZIP codes, where luxury home prices generally start at about $2 million,\" Coldwell Banker reports.\n\nThat's consistent with another finding from the report: \"In terms of locations, millennials tend to prefer markets that are more affordable — often in suburbs or second-tier cities, where their dollar will carry them further.\"\n\nHere are the other popular states and ZIP codes for millennial millionaires:", "description": "Here's where today's millennial millionaires are living, according to a 2019 report from the Coldwell Banker Global Luxury and WealthEngine.", "authors": ["Kathleen Elkins"], "top_image": "https://image.cnbcfm.com/api/v1/image/106185024-1571241170096pink-suit_t20_mxo1o8.jpg?v=1571241275", "published_at": "2019-10-17"}