{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/10/arenados-482-foot-homer-lifts-rockies-over-cardina", "downloaded_at": "2019-09-11 07:28:25.476224+00:00", "title": "Arenado's 482-foot homer lifts Rockies over Cardinals 2-1", "language": "en", "text": "DENVER (AP) - Nolan Arenado sent a ball soaring out of Coors Field, and the St. Louis Cardinals could not recover.\n\nArenado hit a 482-foot two-run homer that bounced out of the ballpark in the first inning, Chi Chi González got his first big league win in four years and the Rockies beat St. Louis 2-1 on Tuesday night to slow the Cardinals‘ playoff push.\n\nSt. Louis, which had won 23 of 30 coming in, maintained a four-game lead in the NL Central over the second-place Chicago Cubs.\n\n“Very, very weird,” St. Louis second baseman Kolten Wong said after a rare low-scoring game at Coors Field. “We know runs come in bunches in this park. Obviously, we weren’t on our game.”\n\nSt. Louis swept a four-game home series from Colorado two weeks ago, including a 6-0 win against González on Aug. 25.\n\n“Better command of his pitches,” St. Louis manager Mike Shildt said. “He was keeping the ball down, working the corners and he had all of his pitches he looked like he was throwing for strikes and quality strikes.”\n\nGiven the early advantage, González (1-6) allowed one run and four hits in six innings. The 27-year-old right-hander had been 0-6 with a 7.29 in nine starts and one relief appearance this year, and he had not won in the big leagues since Sept. 22, 2015, for Texas at Oakland.\n\n“There was a lot of emotion,” González said. “I’m just thankful to be out here, to be with this group of guys. It’s a great clubhouse.”\n\nJairo Díaz got six outs and finished a six-hitter for second save.\n\nMichael Wacha (6-7) allowed five hits in four innings and is winless in seven starts and two relief appearances since July 19.\n\nCharlie Blackmon singled with one out in the first, and Arenado drove a changeup to left. Arenado’s 38th home run this season gave him 110 RBIs this year and 500 extra-base hits in his career.\n\n“That was probably one of the few changeups that just didn’t really do anything,” Wacha said. “It just kind of stayed right there in the middle of the plate. And with him, he doesn’t really ever miss those.”\n\nDexter Fowler doubled leading off the fourth and scored on Paul Goldschmidt’s groundout. González pitched out of a bases-loaded, one-out ham in the fifth when pinch-hitter Matt Carpenter hit a soft liner to shortstop Trevor Story and Fowler grounded out.\n\nSt. Louis had runners on the corners in the seventh before Carlos Estévez relieved Bryan Shaw and struck out Harrison Bader and José Martinez.\n\nNOT MEASURING UP\n\nArenado’s drive was tied the third-longest in the major leagues this season, according to Statcast, trailing home runs by Texas’ Nomar Mazara (505) and Rockies teammate Ian Desmond (486). Arenado is dubious of Statcast’s measurements, citing a home run by Houston rookie Yordan Alvarez on Monday that was calculated at 415 feet.\n\n“He hit it to the third deck in Houston. That ball might have gone a little farther than mine,” Arenado said. As long as it’s fair and goes out of the ballpark that’s all that matters.”\n\nStatcast calculates the distance a ball would travel if it had landed at ground level unobstructed.\n\nTRAINER’S ROOM\n\nCardinals: C Matt Wieters (left calf strain) is getting closer to returning. He has been out since Sept. 1 and has increased his baseball activities in recent days.\n\nRockies: LHP Kyle Freeland (left groin strain) threw a bullpen session on Saturday and is scheduled to have another one Wednesday. Freeland has been out since Aug. 22. … Colorado is not sure whether OF David Dahl (right ankle sprain) will return this season.\n\nUP NEXT\n\nCardinals RHP Dakota Hudson (15-6, 3.40) will face Rockies RHP Antonio Senzatela (8-10, 7.19) in the second of the three-game series on Wednesday. Hudson is 11-2 in his last 14 starts while Senzatela has a 16.15 ERA in his last six outings.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Nolan Arenado sent a ball soaring out of Coors Field, and the St. Louis Cardinals could not recover.", "authors": ["The Washington Times Http", "Michael Kelly"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/10/cardinals_rockies_baseball_58405_c0-323-4469-2928_s1770x1032.jpg?1d4c5e85122e8dcc8ca3d92325c0ad0229501f76", "published_at": "2019-09-10"}