{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/16/boxer-patrick-day-dies-days-after-suffering-traumatic-brain-injury-fight", "downloaded_at": "2019-10-17 05:15:37.257267+00:00", "title": "Boxer Patrick Day, 27, dies days after suffering traumatic brain injury in fight", "language": "en", "text": "The management company, DiBella Entertainment, said Day died “surrounded by his family, close friends and members of his boxing team, including his mentor, friend and trainer Joe Higgins.” The company previously confirmed reports that Day was in a coma and underwent emergency brain surgery.\n\nDay was knocked down in the fourth and eighth rounds of the bout before several punches to the head from Conwell again sent him to the canvas in the 10th and final round. Day was attended to by medical personnel before he was taken from the arena on a stretcher. He was reported to have remained unconscious, and suffered seizures as an ambulance transported him to the hospital.\n\nAD\n\nAD\n\nClaudia Trejos gives us an update on Patrick Day.\n\n\n\nOur thoughts and prayers are with Patrick and his family. 🙏 pic.twitter.com/Xqee6iuJqs — DAZN USA (@DAZN_USA) October 13, 2019\n\n“It becomes very difficult to explain away or justify the dangers of boxing at a time like this,” DiBella Entertainment said. “This is not a time where edicts or pronouncements are appropriate, or the answers are readily available. It is, however, a time for a call to action. While we don’t have the answers, we certainly know many of the questions, have the means to answer them, and have the opportunity to respond responsibly and accordingly and make boxing safer for all who participate.\n\n“This is a way we can honor the legacy of Pat Day. Many people live much longer than Patrick’s 27 years, wondering if they made a difference or positively affected their world. This was not the case for Patrick Day when he left us. Rest in peace and power, Pat, with the angels.”\n\nOn Tuesday, the 21-year-old Conwell posted a lengthy message to social media about Day. A 2016 Olympian, Conwell said he considered quitting boxing but decided that wasn’t what Day, as “a fighter at heart,” would want.\n\nAD\n\nAD\n\n“I never meant for this to happen to you. All I ever wanted to do was win. If I could take it all back I would,” Conwell wrote. “No one deserves for this to happen to them. I replay the fight over and over in my head thinking what if this never happened and why did it happen to you.”\n\nDay posted a record of 17-4-1 after starting his professional career in 2013. He won the World Boxing Council Continental Americas championship in 2017 and the International Boxing Federation Intercontinental championship earlier this year, according to DiBella Entertainment. Before that, he was a 2012 New York Golden Gloves winner at 152 pounds and was also an alternate that year for the U.S. Olympic team.\n\nRest In Peace.\n\n\n\nPatrick Day was always kind, happy and an exceptional good man who was outstandingly passionate about boxing. We will always remember you for all of that. pic.twitter.com/v506g26nmX — World Boxing Council (@WBCBoxing) October 16, 2019\n\nDay’s trainer, Joe Higgins, was not immediately available for comment. He recently told ESPN that Day grew up across the street from him in Freeport, N.Y., and wandered over as a 14-year-old to try out the punching bag hanging in the trainer’s garage. Higgins soon had Day enrolled at the local Police Athletic League gym.\n\nAD\n\nAD\n\n“I feel like I’m responsible, like I let him down,” Higgins told ESPN, via text message. “My special kid.”\n\nIn its statement, DiBella Entertainment described Day as a “a dedicated college student,” who earned an associate degree and a bachelor’s degree.\n\n“Patrick Day didn’t need to box,” the statement said. “He came from a good family, he was smart, educated, had good values and had other avenues available to him to earn a living.\n\n“He chose to box, knowing the inherent risks that every fighter faces when he or she walks into a boxing ring. Boxing is what Pat loved to do. It’s how he inspired people and it was something that made him feel alive.”\n\nDay’s death is the latest in a string of recent fatalities in the sport. Maxim Dadashev, a 28-year-old Russian, died in July, after he underwent surgery for massive head trauma following a fight at MGM National Harbor casino in Oxon Hill, Md. And 23-year-old Hugo Santillan reportedly suffered cardiorespiratory failure after fighting to a draw in his native Argentina just days after Dadashev’s death.\n\nAD\n\nAD\n\nA Bulgarian boxer, Boris Stanchov, reportedly died in the ring in September during a fight in Albania. The WBC initially posted a message mourning the loss of another boxer, Isus Velichkov, but according to reports, Velichkov came forward and said Stanchov was a relative who had been fighting under his license.\n\nDay’s death prompted an outpouring of messages of grief Wednesday from the boxing community, many of whom remembered Day for his friendly, engaging personality.\n\nThis isn’t our only pic together but let me tell y’all he had no problem chasing you down at the Barclays 😭 just to say hi and give a hug! I’ll miss Pat, and his DMs and him cracking jokes. This sport is so cruel. RIP buddy @patday_allday pic.twitter.com/FuXwTpjkN0 — ClaressaT-rexShields (@Claressashields) October 17, 2019\n\nRest in peace, Patrick Day. He was an amazing man. We always looked forward to spending time with him and seeing that sunny smile. He will be dearly missed. Our thoughts and prayers are with his family and friends. — Main Events (@Main_Events) October 16, 2019\n\n#RIP Patrick Day. In a business of shitheads and frauds you were always genuine, honest and real. Both in and out of the ring. You'll be missed Champ https://t.co/Ce6xOQErXv — Paul Malignaggi (@PaulMalignaggi) October 16, 2019\n\nExtremely sad news coming out of Chicago. Patrick Day passed today at the age of 27. This young man had an infectious smile and positive energy that lit up a room. Sad, sad day. 😢 #PatrickDay #ConwellDay #boxing pic.twitter.com/LabcC3M2U9 — Michael Montero (@MonteroOnBoxing) October 16, 2019\n\nThis one hurts, and we will see some folks edging away from the not often sweet enough and too often savage science. We know the sport saves souls, every day, and is a refuge for people who fall in between life's too copious cracks. — Michael Woods (@Woodsy1069) October 16, 2019\n\nDevastated to hear the news of the passing of Patrick Day.I met him for the first time last Thursday,what a charming young man with a dream and a smile that lit up the room.Our deepest prayers are with his family, his trainer Joe Higgins,Charles Conwell and promoter Lou DiBella🙏 — Eddie Hearn (@EddieHearn) October 16, 2019\n\nRest in paradise @patday_allday. Long Island lost a good man. My condolences to your entire family, through this rough time... — Jamel Herring (@JamelHerring) October 16, 2019\n\nOur deepest condolences to the family, friends and the team of Patrick Day. Rest In Peace Pat. — Gennadiy Golovkin (@GGGBoxing) October 17, 2019\n\nDamn man, Rest easy Patrick Day. Prayers to your friends and family — Gervonta Davis (@Gervontaa) October 16, 2019\n\n“Some fighters try to embrace the tough-guy image,” Tommy Rainone, a Long Island-based boxer, told Newsday. “That wasn’t Pat. He would talk with anyone and he would be smiling the whole time he was talking with you. His smile was his trademark.”\n\nRead more from The Post:\n\nAD", "description": "\"Pat’s kindness, positivity, and generosity of spirit made a lasting impression with everyone he met,\" Day's manager said of the 27-year-old Long Island native, who was taken from the ring on a stretcher after a loss to Charles Conwell.", "authors": ["Des Bieler", "Sports Reporter Covering National Topics", "Including Fantasy Football", "As Well As Supporting Coverage Of D.C.-Area Teams"], "top_image": "https://www.washingtonpost.com/resizer/iyUVVMwVczd58Q4NucpwMBhu7ec=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/V6KJSNHQOYI6TO362IBG5YGBTE.jpg", "published_at": "2019-10-16"}