{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/dave-gibbons-understands-why-hbos-watchmen-turned-rorschach-into-a-white-supremacy-symbol", "downloaded_at": "2019-10-16 05:53:56.493048+00:00", "title": "Dave Gibbons Understands Why HBO's Watchmen Turned Rorschach Into A White Supremacy Symbol", "language": "en", "text": "A member of the Seventh Kavalry white supremacist group. (Image: HBO)\n\nHBO’s Watchmen is set 30 years after the events of Dave Gibbons and Alan Moore’s original comics series, meaning that most of the story’s original heroes and villains are long since dead, inactive, or in Doctor Manhattan’s case, hanging out off-planet away from humanity. But Watchmen’s world is one that’s been fundamentally changed by the legacies of both generations of the Minutemen.\n\nRorschach is one of the most obvious and striking examples of HBO’s Watchmen continuing the story of an original character by taking their identity and recontextualising it in a new, distinct narrative.\n\nWalter Joseph Kovacs the man is dead, but Rorschach the idea lives on in the form of the Seventh Kavalry, a white terrorist organisation operating out of Tulsa, Oklahoma, whose vicious attacks on the city’s black population prompt the government to allow the police department to begin hiding their identities.\n\nWhile the 7K proudly wear Rorschach masks, their ideology is somewhat different than Kovacs’ in that their moral absolutism is defined by an explicitly racist worldview and a desire for ethnic cleaning.\n\nAt one point in the series’ first episode, members of the 7K share a video warning the police that they’ll be coming for them, and the entire production borrows heavily from Rorschach’s speech in Watchmen’s first issue. It’s a chilling, frightening moment that makes you understand what the Tulsa PD’s up against, but it also illustrates how Rorschach’s come to mean something somewhat different in society.\n\nAs intentionally disturbing as a character as the original Rorschach was, he’s gone on to become a fan favourite, which Watchmen’s creative team knew could potentially be a point of consternation when the series begins airing this fall.\n\nBut at this year’s New York Comic Con panel for the show, artist and Watchmen co-creator Dave Gibbons explained that when he first had a chance to read Damon Lindelof’s scripts, he completely understood why Rorschach as a concept was being introduced this way:\n\n“Rorschach is a very interesting character, you know? Obviously, Alan [Moore] very much came up with Rorschach and wrote all the words that came from his mouth, and I think there’s a dreadful appeal to characters like Rorschach in that you can’t possibly agree with them. But they’re so definite, and so consistent, and so hypnotically sure of what they’re doing that they’re quite arresting. And I can quite see that Rorschach would be a kind of role model for people with unpleasant views in this future.”\n\nIt’s easy to grasp why most comics creators, and the studios making big-budget productions based on the creators’ works, are hesitant to wholly embrace the idea that their characters, in any way, speak to the negative elements of society. The assumption is that acknowledging that fact could be perceived as an endorsement of bad behaviour on the show’s behalf.\n\nBut we’ve seen more than a number of examples of people — often police officers — taking the wrong message from things like comic books and co-opting the imagery associated with certain characters in order to send chilling, dangerous messages.\n\nThe fact that Gibbons immediately grasped when Watchmen’s trying to do with his creation speaks to the show’s ability to put its money where its mouth is, and actually game out the future of this universe in a way that reflects the realities of our society. Whether the show can manage to maintain that solid grasp on its story and be entertaining all throughout, though, remains to be seen.\n\nWatchmen premieres on Fox Showcase on October 21.", "description": "HBO’s Watchmen is set 30 years after the events of Dave Gibbons and Alan Moore’s original comics series, meaning that most of the story’s original heroes and villains are long since dead, inactive, or in Doctor Manhattan’s case, hanging out off-planet away from humanity. But Watchmen’s world is one that’s...", "authors": ["Tegan Jones", "Bradley Brownell"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/rtsqn5un4ywy5d66rvdk.jpg", "published_at": "2019-10-16"}