{"pub": "news24", "url": "https://health24.com/Medical-schemes/About-medical-schemes/all-you-need-to-know-about-waiting-periods-on-your-medical-scheme-20191013-2", "downloaded_at": "2019-10-15 23:10:07.615585+00:00", "title": "All you need to know about waiting periods on your medical scheme", "language": "en", "text": "All you need to know about waiting periods on your medical scheme When you join a scheme for the first time, there are only two types of waiting periods which are applied – and sometimes there are none at all. Here's what you need to know.\n\nA waiting period refers to a set time when you have to pay contributions, but cannot access some of the benefits on your medical scheme.\n\nThe two types of waiting periods are as follows:\n\n• A three-month exclusion\n\n• A condition-specific waiting period of 12 months\n\nHere's more about when and why and how these two different waiting periods are applied:\n\nThree-month exclusion period\n\nThis can be applied to all new members (or members who have been off their previous scheme for more than three months) who join a particular scheme for the first time. Medical schemes are not allowed to refuse an applicant membership – waiting periods (and late-joiner penalties) are the only restrictions schemes can place on new members.\n\nThe thinking behind this exclusion period is to protect both the scheme and other members: it prevents someone from joining the scheme, having a string of procedures done, and then resigning as a member after only paying one or two membership contributions. The three-month exclusion period does not apply in the following cases:\n\n• If you are moving between options in the same medical scheme (unless you change within the first three months of being a member).\n\n• If you are claiming for something which is a prescribed minimum benefit (a list of 270 conditions, or 26 chronic conditions). So if you break a leg within three weeks of joining, you will be covered. But going to the GP for a general check-up will not be covered in the first three months.\n\n• If you are a member and you have a baby who is put onto the scheme as a dependant, benefits will be immediately accessible.\n\n• If your employer forces its employees all to change to another scheme, for whatever reason, a waiting period will not be enforced.\n\n12-month waiting period\n\nWhen you apply to join a scheme, you/your doctor have to fill in a detailed medical history. Based on this, the scheme can exclude you for a pre-existing condition, such as a back problem, for up to 12 months after becoming a member. After that time is over, you can access the benefits as set out in your option of choice for the treatment of this condition. You may not be excluded for longer than 12 months for any condition.\n\nIt is never a good idea to lie about your medical history. If you do, your behaviour is fraudulent, and your membership may be terminated.\n\nIf you have been a member of another scheme for more than 24 months, no more than three months may be imposed for pregnant members.\n\nIf you have not been a member of another scheme for more than 24 months, or there has been a break for more than 90 days between schemes, the scheme can impose a condition-specific waiting period. This is to prevent people from joining only because they are pregnant, having the baby, and then terminating their membership.\n\nIf, however, someone was unaware of the fact that they were pregnant upon joining, childbirth is treated as a prescribed minimum benefit.\n\nSources: Bonitas Medical Scheme, The Council for Medical Schemes, Fedhealth Medical Schemes\n\nImage credit: iStock", "description": "When you join a scheme for the first time, there are only two types of waiting periods which are applied – and sometimes there are none at all. Here's what you need to know.", "authors": ["Susan Erasmus"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/4753/7e506857af8041e581f46eb4b26256d4.jpg", "published_at": "2019-10-13"}