{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/raytheon-could-rally-to-the-230-area-in-the-months-ahead-how-to-buy-it-now-15115234", "downloaded_at": "2019-10-04 16:58:17.846013+00:00", "title": "Raytheon Could Rally to the $230 Area in the Months Ahead - How to Buy It Now", "language": "en", "text": "During Thursday night's Mad Money program callers during the 'Lightning Round' get to ask Jim Cramer what he thinks of various companies. Last night one caller asked about Raytheon (RTN) : \"Its combination with United Technologies (UTX) is simply brilliant. Raytheon is a buy,\" said Cramer.\n\nIn this daily bar chart of RTN, below, we can see that prices broke out to the upside in September and then retracted to the breakout area recently. A breakout and a retest move is not unusual. It is probably more unusual to see a breakout and then prices just keep soaring higher.\n\nRTN is trading above the rising 50-day moving average line and the bullish 200-day moving average line.\n\nThe daily On-Balance-Volume (OBV) line has been moving higher from early June and broke out to a new high with prices to confirm and support the bull move.\n\nThe Moving Average Convergence Divergence (MACD) oscillator crossed to the downside for a take profits sell signal but it is still above the zero line.\n\nIn this weekly bar chart of RTN, below, we can see that prices are in an uptrend and above the rising 40-week moving average line.\n\nTrading volume seems steady and the weekly OBV line has been positive since early 2018. Another observation is that the OBV line did not decline in 2018 when prices corrected lower. This suggests that investors held their positions.\n\nThe weekly MACD oscillator recently crossed back above the zero line for a fresh outright go long signal.\n\nIn this Point and Figure chart of RTN, below, we can see the recent upside breakout and the subsequent pullback. A potential upside price target or objective of $229 is being indicated.\n\nBottom line strategy: Aggressive traders could go long RTN around $190 and risk a close below $180, and look for an advance to the $230 area in the months ahead.", "description": "Let's review the charts and indicators to see what they are showing today....RTN", "authors": ["Bruce Kamich", "Raytheon Could Rally To The", "Area In The Months Ahead - How To Buy It Now", "Let'S Review The Charts", "Indicators To See What They Are Showing Today.", "Stocks Quotes In This Article", "Timothy Collins", "Guy Ortmann", "James", "Rev Shark"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/fe0abba0-8b88-11e9-a5aa-f33a44cdd51c.jpg", "published_at": "2019-10-04"}