{"pub": "cbc", "url": "https://cbc.ca/parents/learning/view/heres-why-canadian-parents-are-eager-to-vote-on-october-21", "downloaded_at": "2019-10-20 00:12:25.916337+00:00", "title": "Here’s Why Canadian Parents Are Eager to Vote On October 21", "language": "en", "text": "With the election just days away, politicians are out and about campaigning hard for your vote.\n\nEvery platform is different — sometimes the talking points are vague and full of buzz words, but sometimes those words resonate just enough to change a mind.\n\nThere are also staunch Canadians who are loyal to their parties, completely unwavering. And Canadians who are willing to change their vote if it means more will be done for the issues that matter to them most.\n\nBut what are the issues that matter to Canadian parents the most? We asked around, using Facebook and Twitter — spaces where parents of all different kinds of political affiliations convene to discuss their strongest opinions. Here's why some Canadian parents and caregivers are voting for who they are voting for on October 21.\n\nClimate Change\n\nThe expression \"climate chaos\" came from one parent, who believes it — climate change — is the issue of our time. While she does not say who she is voting for, this mother prioritizes a candidate who believes in equality for women, Indigenous communities and people of colour.\n\nBeing Able to Afford Children\n\nThe cost of living is exponentially higher when you're a family, of course. And one parent tells us an issue that is really important to her and her way of life is childcare. Essentially, she doesn't want to have to put off having another child because of the current staggeringly high cost of childcare.\n\nEnergy Sector Focus and Pipeline Construction\n\nIssues were quite varied, and included the prioritization of pipeline construction and continued investment in the energy sector.\n\nWorkforce Reintegration\n\nWe heard from a parent who wants to work, but requires affordable early and after-care programs to help better manage a daytime work schedule. This is the issue that matters most to her this election.\n\nThe Environment, Child Care, Clean Water and Support of Immigrants\n\nWhat we heard a lot was a lot of issues needed attention. Many Canadian parents believe there isn't just one thing that needs immediate attention. And we heard often that priorities of many Canadian parents included child care, the environment, clean drinking water and the support of immigrants.\n\nAn Environment to Thrive\n\nParents want to provide for their kids, and they want the support of government. For one mother, that means assistance in providing safe, affordable housing, fair pay, clean drinking water and access to resources.\n\nThe Es: Environment, Education\n\nParents truly just wants a safe, thriving world for their kids. They want spaces for them to learn and a world that isn't going anywhere anytime soon. The environment and climate change were among the top issues from all who responded.\n\nDo you feel represented in the Canadian parents above? Have an issue that's important to you that you'd like to see? Send us an e-mail to cbcparents@cbc.ca.", "description": "Issues are vast and varied, and parents are ready to vote for their families.", "authors": [], "top_image": "https://www.cbc.ca/parents/content/imgs/_8col/mom-and-child.jpg", "published_at": "2019-10-17"}