{"pub": "investing.com", "url": "https://ph.investing.com/news/commodities-news/preciousgold-firms-on-brexit-jitters-trade-optimism-caps-gains-70256", "downloaded_at": "2019-10-22 13:39:46.005509+00:00", "title": "PRECIOUS-Gold firms on Brexit jitters but trade optimism caps gains", "language": "en", "text": "© Reuters. PRECIOUS-Gold firms on Brexit jitters but trade optimism caps gains\n\n* UK PM Boris Johnson faces votes at 1800 GMT\n\n* Gold could break $1,479/oz support, fall to $1,456 -\n\ntechnicals\n\n* Silver gains for fifth consecutive session\n\n\n\n(Updates prices)\n\nBy Eileen Soreng\n\nOct 22 (Reuters) - Gold prices inched higher on Tuesday\n\nahead of a crucial vote by British lawmakers on the Brexit\n\nwithdrawal agreement, although prospects for a U.S.-China trade\n\ndeal limited bullion's gains.\n\nSpot gold was up 0.2% at $1,487.63 per ounce as of\n\n1042 GMT, having hit a roughly one-week low of $1,480.44. U.S.\n\ngold futures GCcv1 were also up 0.2%, at $1,490.70.\n\n\"There is an uncertainty about Brexit and some people\n\nrealise that there still are roadblocks ahead,\" Quantitative\n\nCommodity Research analyst Peter Fertig said.\n\n\"We have a rebound in government bond prices, including in\n\nGermany and Italy, which is pointing to a flight back into safe\n\nhavens,\" Fertig said, noting declining yields are supportive for\n\ngold.\n\nEuro zone government bonds edged down before a vote in the\n\nBritish parliament crucial to determining whether the United\n\nKingdom can leave the European Union in an orderly way at the\n\nend of the month. Prime Minister Boris Johnson faces two pivotal votes in\n\nparliament on Tuesday that will decide whether he can deliver on\n\nhis pledge to lead Britain out of the EU in nine days' time.\n\nLawmakers vote at around 1800 GMT on the 115-page Withdrawal\n\nAgreement Bill and then on the government's extremely tight\n\ntimetable for approving the legislation. Capping bullion's gains was optimism induced by talk of\n\nprogress in China-U.S. trade negotiations that propped up\n\nsentiment for riskier assets. MKTS/GLOB\n\n\"The precious metal is waiting for the next big theme or\n\nmarket-moving event that will influence global sentiment and\n\nrisk appetite,\" FXTM analyst Lukman Otunuga said in a note.\n\n\"Until something fresh is brought into the picture, gold is\n\npositioned to trade within a modest range in the short to medium\n\nterm,\" Otunuga added.\n\nChina and the United States have achieved some progress in\n\ntheir trade talks, Chinese Vice Foreign Minister Le Yucheng said\n\non Tuesday. Those comments came a day after U.S. President Donald Trump\n\nspoke of optimism about a deal, while White House adviser Larry\n\nKudlow said tariffs on Chinese goods scheduled for December\n\ncould be withdrawn if talks went well. Spot gold is poised to break support at $1,479 per ounce and\n\nfall towards the next support at $1,456, Reuters technical\n\nanalyst Wang Tao said. Silver rose 0.4% to $17.63 an ounce, gaining for a\n\nfifth straight session. Platinum XPT= was up 0.2% at $889.77\n\nand palladium XPD= was 0.1% higher at $1,759.47 an ounce.\n\n\n\n", "description": "PRECIOUS-Gold firms on Brexit jitters but trade optimism caps gains", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEAAH0G6_L.jpg", "published_at": "2019-10-22"}