{"pub": "news.com.au", "url": "https://realestate.com.au/news/the-springs-rated-as-byron-bays-best-house-is-for-sale-for-4-million/?rsf=syn:news:nca:news:spa:fin", "downloaded_at": "2019-10-08 09:37:20.647425+00:00", "title": "The Springs, rated as Byron Bay’s ‘best house’ is for sale for $4 million", "language": "en", "text": "It earned a gong for Byron’s “best kitchen” and “best bathroom” from the Master Builder’s Association and now this award-winning hinterland hideaway could be all yours for a very stylish $4 million.\n\nThe designer three-bedroom home on a huge 15ha at Wilsons Creek has panoramic views of the famous Byron Hinterland, including the nearby township of Mullumbimby which has long been known as“The Biggest Little Town in Australia”.\n\nMORE: First glimpse inside Chris Hemsworth’s amazing Byron Bay home\n\nWorld’s future wow homes revealed\n\nIt is, however, a comfortable half an hour’s drive from the bustle of Byron to get your fix of Boho beach fun.\n\nNamed The Springs, the modern homestead also received the “best house” award from the MBA’s Northern Regions division shortly after its completion three years ago.\n\nDesigned by Seven Mile Architects, the home’s sleek open plan kitchen with its island bench and bespoke timber cabinetry was also celebrated by the MBA as was the main bathroom.\n\nSpread over one level, the contemporary country home makes the most of the views out to Mount Chincogan and the surrounding Night Cap ranges with grand floor to ceilings windows and a seamless indoor/outdoor floor plan. Louvred windows and bifold doors create cross ventilation for all seasons and the big stone fireplace gives off comfy country cabin vibes.\n\nThe main bedroom sits to one side of the home in its own “wing” with a large bath ensuite and a nearby media room. The remaining two bedrooms share the award-winning bathroom and one features its own courtyard space.\n\nMORE: The way to the perfect house flip revealed\n\n\n\nInside Nathan Lyon’s waterfront home\n\nWith multiple outdoor areas adjoining the home, you’re spoilt for choice come cocktail hour and there is also an abundance of space on the vast block boasting fruit trees and potential farming land as well as a studio space well removed from the main residence. An impressive 16m horizon-edge pool is ideal for lulling around on hot summer days.\n\nThe Springs has operated as a popular short term accomodation rental earning in the vicinity of $335 a night, with a 9 out of 10 rating on Trivago and a “Perfect Stay” stamp from Airbnb.\n\nOther perks of the picturesque property include underground electricity, a 110k litre concrete water tank, a professional sound system, fully equipped media room and a solar system in place.\n\nLocated just eight minutes from the quaint village of Mullumbimby, The Springs is also about 15 minutes to the coastal town of Brunswick Heads, and 30 minutes from popular Byron Bay. You can choose to fly there from the Gold Coast’s airport 45 minutes away or Ballina Airport at around 40 minutes’ drive.", "description": "Positioned in one of the most enviable locations in all of Australia, this incredible house is as beautiful inside as it is outside.", "authors": ["Kirsten Craze"], "top_image": "https://www.realestate.com.au/blog/wp-content/uploads/2019/10/07162219/capi_cee99918a496e482cac17e3c144f300b_b0fae9111b8eabc3e0cb362fa7a5c763.jpeg", "published_at": "2019-10-07"}