{"pub": "fox", "url": "https://foxnews.com/us/epstein-accuser-money-millions-potential-co-conspirators", "downloaded_at": "2019-10-09 02:06:44.889770+00:00", "title": "Epstein accuser steps up efforts to get his millions as new alleged co-conspirators named", "language": "en", "text": "One of Jeffrey Epstein’s accusers is suing the millionaire’s companies and estate alleging the convicted sex offender fraudulently funneled money from his companies and non-profits into a trust just two days before his suicide in a last-minute effort to shield his money from his alleged victims.\n\nThe new court documents, filed Tuesday as part of an amended lawsuit on behalf of accuser Jennifer Araoz, also identified for the first time three women accused of enabling and facilitating sexually abusive encounters between Epstein and Araoz.\n\nThe lawsuit alleged that Epstein fraudulently transferred the title of his $56 million Manhattan mansion from his New York City company Nine East 71st Street Corporation to his Virgin Islands-based company, Maple Inc., in an effort to “evade financial liability to current and future creditors,” including alleged victims.\n\nTuesday’s amended lawsuit was the first known to target about a dozen Epstein-owned companies, trusts and private foundations for fraudulent conveyance and was the latest effort by Epstein accusers to go after his $578 million estate.\n\nEpstein placed his assets in a U.S. Virgin Islands trust called the “1953 Trust,” named after the year of his birth, just two days before he killed himself inside a Manhattan jail cell. The trust has complicated legal efforts by accusers hoping to get a hold of Epstein’s money.\n\nEpstein “took steps to have those corporations fraudulently transfer assets into an estate that would shield them from the claims of victims following his death,” Araoz’s attorney Dan Keiser said on a phone call with reporters. “Every penny of his estate should be available.”\n\nAraoz claimed Epstein sexually assaulted and raped her when she was 14 and 15 years old in 2001 and 2002, at Epstein’s New York City mansion.\n\nLesley Groff was identified as Epstein’s secretary; Rosalyn Fontanilla was identified as Epstein’s maid; and Cimberly Espinosa was identified as Epstein’s executive assistant at one of his companies.\n\nEPSTEIN USED NAME OF WEALTHY DUBAI BUSINESSMAN TO ACQUIRE 2ND CARIBBEAN ISLAND, REPORT SAYS\n\nAccording to Araoz, Groff would contact her directly to schedule and facilitate one-on-one visits between her and Epstein, and he sexually assaulted her during the first such meeting.\n\nThe lawsuit claimed that on multiple occasions, Fontanilla would serve wine, cheese and crackers to Araoz as she waited to see Epstein at his home. The documents noted Fontanilla died in 2016.\n\nEspinosa also was accused of scheduling sexual encounters between Epstein and Araoz.\n\nGroff’s lawyer, Michael Bachner, denied the allegations. “As an executive assistant to Epstein, Lesley Groff worked as part of a professional staff that included in-house attorneys, accountants, an office manager and other office staff. Lesley’s job included making appointments for Mr. Epstein as directed by him, taking his messages, and setting up high-level meetings with CEOs, business executives, scientists, politicians and celebrities. At no time during Ms. Groff’s employment with Mr. Epstein did she ever engage in any misconduct.”\n\nEspinosa could not be reached for comment; it was unclear if she had an attorney.\n\nMeanwhile, Araoz’s lawyers said while they have been unsuccessful in finding the whereabouts of Epstein’s former girlfriend and accused primary co-conspirator, Ghislaine Maxwell, they believed her whereabouts will emerge before long.\n\n“We have reason to believe that the FBI knows her location,” Araoz’s attorney Kimberly Lerner told reporters Tuesday. “They certainly didn’t deny knowing her whereabouts. I would be shocked if she wasn’t one of their targets and I believe that they know her whereabouts. I don’t believe that they are going to let her leave the country.”\n\nIt’s possible Maxwell, identified as Epstein’s alleged madam in his sex-trafficking operation, could have left the country already.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe FBI is scheduled to update Epstein’s accusers on their investigation into his possible co-conspirators at the end of October.\n\n“Our pursuit of justice did not die when Epstein took his own life,” Lerner said. “It has just taken on a different face, the face of all the enablers and co-conspirators that allowed him to violate a 14-year-old child.”\n\nFox News' Maria Paronich and Morgan Phillips contributed to this report.", "description": "One of Jeffrey Epstein’s accusers is suing the millionaire’s companies and estate alleging the convicted sex offender fraudulently funneled money from his companies and non-profits into a trust just two days before his suicide in a last-minute effort to shield his money from his alleged victims.", "authors": ["Bryan Llenas"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/07/694940094001_6084342099001_6084350341001-vs.jpg", "published_at": "2019-10-08"}