{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7590115/Britains-universities-refund-tuition-fees-nearly-1-000-students-two-years.html", "downloaded_at": "2019-10-19 11:42:26.633957+00:00", "title": "Britain's universities refund tuition fees to nearly 1,000 students in two years", "language": "en", "text": "Universities have admitted refunding tuition fees to almost 1,000 students in the past two years over complaints of poor value for money.\n\nStudents pay fees of £9,250 a year – compared with just £3,000 in 2006 – and many are dissatisfied with the quality of education they are getting in return.\n\nUniversities often promote courses with promises of glamorous career paths and sparkling facilities – but find it hard to deliver.\n\nTeesside University saw £56,650 paid out to 23 students, some of whom complained about their MSc courses. The University of Leicester paid £27,928 in compensation to 18 students [File photo]\n\nStudents received at least 978 payouts totalling more than £750,000 in the past two years, according to figures from institutions across the country.\n\nCritics yesterday said students were finally waking up to the ‘huge scandal’ of poor-quality courses which may leave them ‘underemployed’.\n\nExamples included a student at the University of Oxford who was paid £15,252 after they complained their supervisor had left and not been adequately replaced.\n\nAnd at the Royal Veterinary College, £3,450 was paid to a student who complained about the quality of teaching and supervision for a research project.\n\nUniversities often promote courses with promises of glamorous career paths and sparkling facilities – but find it hard to deliver [File photo]\n\nFreedom of Information figures given to the Mail uncovered dozens of cases where universities settled claims with students who said the course was not up to standard.\n\nSome complaints were directed at lecturers, while in others, students said the course had been mis-sold to them or elements changed after they were enrolled.\n\nThe total amount paid out is likely to be underestimated, as some universities failed to provide information and others refused to give exact numbers of compensation payouts, hiding behind data protection laws.\n\nTeesside University saw £56,650 paid out to 23 students, some of whom complained about their MSc courses. The University of Leicester paid £27,928 in compensation to 18 students.\n\nBrunel University made 17 payments with a combined value of £22,250, and Kingston University paid out £14,048 to 27 students, the vast majority of whom had successfully complained about a Geology BSc course.\n\nChristopher McGovern, of the Campaign for Real Education, said: ‘Too many universities are running a money-making racket that needs to be exposed and challenged.’\n\nHe said graduates are being ‘let down’, whereas university bosses are ‘swanning around on massive salaries’.\n\nA Universities UK spokesman said it was ‘right that students are compensated if it is found that the quality of their course does not meet the high standards which universities rightly aim for’.\n\nIt is understood the vast majority of payouts at all the universities were made in out-of-court settlements.\n\nAnd it emerged yesterday that UUK is urging higher education institutions to put ‘value for money statements’ about how they spend their income in prospectuses, according to the i newspaper.", "description": "Teesside University saw £56,650 paid out to 23 students, some of whom complained about their MSc courses. The University of Leicester paid £27,928 in compensation to 18 students.", "authors": ["Eleanor Harding Education Editor For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/01/13887472-0-image-a-17_1571444042630.jpg", "published_at": "2019-10-19"}