{"pub": "usatoday", "url": "https://usatoday.com/story/tech/2019/10/10/facebook-rolls-out-suite-new-stickers-world-mental-health-day/3917681002", "downloaded_at": "2019-10-10 15:15:37.478136+00:00", "title": "Facebook Messenger adds new stickers, filter to 'destigmatize' chatter about mental health", "language": "en", "text": "CLOSE Facebook Dating might be new to America, but it's a service that is already available in 19 other countries. USA TODAY\n\nIf someone you know is living with mental illness, reaching out can make an immense impact. It could even save a life.\n\nChecking in on them can be as simple as a phone call, a text message or a ping on Facebook Messenger.\n\nOn Thursday, which is World Mental Health Day, the nation's most popular social networking site launched a camera filter called \"Let's Talk,\" to help facilitate tough conversations surrounding mental wellness.\n\nFacebook said it worked with the World Health Organization to develop the filter that lets your close connections know you're open to chatting when they need it.\n\n“Much work has been done to destigmatize mental health on social media, but we know not everyone is comfortable sharing personal feelings publicly,\" said Antigone Davis, Facebook's global head of safety.\n\nSnapchat rival: Instagram launched 'Threads,' a messaging app to house your intimate conversations\n\n'What happened to all my Likes?': Facebook launches a test to hide them.\n\nFacebook wants to destigmatize mental health by rolling out a filter and set of stickers that encourage people to reach out for support. (Photo: Facebook)\n\nFor people who struggle with mental health issues, reaching out is often the hardest step, Davis notes. And for their friends, knowing what to say could also be a barrier. So, Facebook is also rolling out a set of stickers \"that can help take the place of words when they are hard to find.\"\n\nThe stickers get the conversation started with messages such as \"Let's talk,\" \"Listening,\" \"Feeling Alone,\" and \"You are not alone.\" There's also a sticker that symbolizes giving or receiving a digital hug.\n\nNew Facebook sticker. (Photo: Facebook)\n\nYou can download the sticker pack by clicking on the smiley face in the text box of any Messenger conversation.\n\nThis comes on the heels of studies that suggest that incessantly scrolling through websites like Facebook, Instagram and Twitter could be linked with symptoms of depression in young people. Other studies suggest that screen time and depression may be intertwined.\n\nStill, Facebook will donate $1 to a select group of mental health organizations around the world, up to $1 million, every time one of its new stickers is sent. \"We’re thrilled to support our partners in the mental health space, many of whom we have longstanding relationships with and rely on to help develop our policies and resources,” Davis said.\n\nThe social networking giant also offers guidance for users who see someone posting suicidal or self-injury related content.\n\nFollow Dalvin Brown on Twitter: @Dalvin_Brown\n\nRead or Share this story: https://www.usatoday.com/story/tech/2019/10/10/facebook-rolls-out-suite-new-stickers-world-mental-health-day/3917681002/", "description": "Facebook says its new filter \"acts as an invitation for close connections who might be struggling to reach out for support via Messenger.\"", "authors": ["Dalvin Brown", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/09/USAT/62600c14-1f6a-44ac-b80e-40fa016bc05d-6XYNsr7g.png?crop=1079,607,x0,y768&width=3200&height=1680&fit=bounds", "published_at": "2019-10-10"}