{"pub": "yahoo", "url": "https://sports.yahoo.com/willie-cauley-stein-discredits-chris-065451929.html", "downloaded_at": "2019-10-06 11:37:02.988487+00:00", "title": "Willie Cauley-Stein discredits Chris Webber's wild Warriors prediction", "language": "en", "text": "Injured Warriors center Willie Cauley-Stein took issue with Chris Webber's playoff predictions, and he had receipts.\n\nWarriorsTalk's Instagram page highlighted that the \"NBA on TNT\" broadcaster -- and former Warrior -- predicted that Golden State would not make the playoffs this season. Cauley-Stein exposed one of Webber's old takes in the comments, noting that he predicted the Kentucky product would not be an NBA starter.\n\nWillie Cauley-Stein is no stranger to the CWebb nonsense. pic.twitter.com/4nhOEyV7mY — TheWarriorsTalk (@TheWarriorsTalk) October 6, 2019\n\nScroll to continue with content Ad\n\nDuring Kentucky's run to the Final Four in 2015, Webber said that comparisons between Cauley-Stein -- then a junior with the Wildcats -- and DeAndre Jordan -- then one of the NBA's most dominant defensive big men -- were premature at best. If the thought of Cauley-Stein playing in college or Jordan dominating the league didn't date this context enough, the fact Webber made his prediction on ESPN's \"Mike and Mike\" just might.\n\n\"These days in basketball, if you're a junior in basketball, and you're 7-feet and you don't average 10 points, you're telling me he could be a DeAndre Jordan?\" Webber said (via SportsNation).\"... There is no way in the world. He can't jump as high. ... He will not start in the league. He's a great kid, and hopefully he will have an NBA career.\"\n\nStory continues\n\nCauley-Stein ultimately started 199 of the 295 games he played in his first four NBA seasons with the Kings, and he was in line to start at center for the Warriors before a foot strain ruled him out for the entirety of training camp. He has averaged 10.1 points per game to date in his career.\n\n[RELATED: Why Warriors' Chase Center debut was predictably ugly loss]\n\nAs for Webber's more recent prediction, the Warriors missing the playoffs isn't out of the question, and their postseason hopes depend on how well the team manages in Klay Thompson's absence. Despite that, it's hard to envision a team led by Steph Curry, D'Angelo Russell and Draymond Green not -- at the very least -- being among the eight teams left standing in the Western Conference when the playoffs begin.\n\nIf Webber's wrong, you know Cauley-Stein won't forget.\n\nWillie Cauley-Stein discredits Chris Webber's wild Warriors prediction originally appeared on NBC Sports Bay Area", "description": "Cauley-Stein took issue with Chris Webber's playoff predictions, and he had receipts.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/3NeGuB3ddocBTrGqmBw3cQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/EpekuriwwykNmjqSo9mgCg--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/csnbayarea.com/c535d16e1cdb0292ff77414bb5cc4146", "published_at": "2019-10-06"}