{"pub": "wsj", "url": "https://wsj.com/articles/hostilities-rise-inside-g-o-media-over-autoplay-video-ads-and-politics-11572392147?mod=rsswn", "downloaded_at": "2019-10-30 02:25:36.273440+00:00", "title": "Hostilities Rise Inside G/O Media Over Autoplay Video Ads and Politics", "language": "en", "text": "The publisher of the former Gawker Media websites is showing video advertisements that play automatically on its sites’ article pages and with the sound on, igniting resistance from staffers who oppose the tactic.\n\nG/O Media Inc., which publishes former Gawker Media sites including Deadspin and Gizmodo, began running sound-on autoplay ads to boost the impressions it could deliver for Farmers Insurance Group, according to people familiar with the situation.\n\nEditorial staffers pushed back, arguing in Slack messages to company executives and in a public post on the company’s websites that the practice creates a poor site experience that can drive users away. Management later took the post down.\n\nA G/O Media spokesman said the autoplay ads test has been running in front of 6% of its users.\n\nThe Farmers deal, which began last month and is worth $1 million, required G/O Media to deliver nearly 43.5 million ad impressions through September 2020, according to internal G/O Media emails reviewed by The Wall Street Journal.\n\nThe publisher’s media and ad operations teams believed it was unlikely G/O Media could deliver that many, according to the emails.\n\nAfter failing to hit ad impression targets within the first few weeks of the campaign, G/O Media decided to start playing videos with the sound on as soon as pages loaded, according to people familiar with the matter. That included stand-alone video ads for Farmers inside article pages as well as preroll ads before editorial videos.\n\n“The ads are performing incredibly well against target reach and engagement with the audience,” said the G/O Media spokesman, referring to metrics such as clicks.\n\nA Farmers Insurance spokesman confirmed the company had approved the use of autoplay video ads with the sound on. “To increase consumer engagement with the Farmers brand, we are running online autoplay video ads, via G/O Media, with the sound-on feature,” a Farmers spokesman said. “We will continue to evaluate the effectiveness of this program and make adjustments, as necessary.”\n\nAuto-playing video ads with sound are especially disruptive because they surprise web users and often compel them to quickly close the window, according to the Coalition for Better Ads, an industry group formed to improve the online experience. Members of the group include Procter & Gamble Co., Alphabet Inc.’s Google, the Association of National Advertisers and the Interactive Advertising Bureau.\n\nSome G/O Media executives have argued to editorial staffers that autoplay video is a common practice, used by bigger media sites including ESPN.com and CNN.com.\n\nBut the response by consumers to autoplay video depends in part on the kind of site they are visiting, said Nick Pappas, chief executive of ad agency SwellShark LLC. “It’s a bit different because you generally expect to get video from CNN and ESPN,” he said. “When you are going to a site where you read more often than you watch, it’s not a good user experience.”\n\nAutoplay video is one tactic used by publishers increasingly feeling squeezed as more digital ad dollars are captured by Google and Facebook Inc. By playing videos automatically instead of only when visitors hit “play,” publishers can generate more views for advertisers.\n\nMr. Pappas said advertising clients typically don’t request autoplay video with sound anymore. In the event that one insists, he said he would still advise running a small test. “I would say to do it as a short-term, limited test run, because I would recommend it’s not the greatest user experience,” he said. “It’s fake impressions, and not necessarily quality traffic.”\n\nG/O Media was formed earlier this year when private-equity firm Great Hill Partners acquired the former Gawker Media sites from Univision Communications Inc.\n\nG/O Media management consistently has butted heads with staffers. Another area of contention is a mandate for Deadspin writers to “stick to sports” and avoid writing about politics and other topics unless they intersect with sports. The editorial staff has argued that posts on politics and other matters, even if unrelated to sports, are often better traffic drivers.\n\nThe tension has led to the departures of some key staffers, including former Deadspin editor in chief Megan Greenwell, who said she resigned partly because of the stick-to-sports mandate and “scammy advertising” practices. Barry Petchesky, Deadspin’s deputy editor, tweeted on Tuesday that he was fired for not “sticking to sports.”\n\nWrite to Sahil Patel at Sahil.Patel@wsj.com", "description": "The publisher of former Gawker Media sites including Deadspin and Gizmodo began running sound-on autoplay ads to boost the impressions it could deliver for Farmers Insurance Group, according to people familiar with the situation.", "authors": ["Sahil Patel", "Sahil.Patel Wsj.Com"], "top_image": "https://images.wsj.net/im-121886/social", "published_at": "2019-10-29"}