{"pub": "yahoo", "url": "https://news.yahoo.com/huawei-cfo-returns-courtroom-u-022115685.html", "downloaded_at": "2019-09-25 23:40:09.134542+00:00", "title": "Huawei CFO Returns to Courtroom as U.S. Tensions Run High", "language": "en", "text": "(Bloomberg) -- Huawei Technologies Co.’s chief financial officer returned to a Vancouver courtroom Monday, beginning in earnest her efforts to convince a Canadian court that her rights got trampled when she was arrested on a U.S. extradition request last December.\n\nDefense lawyers for Meng Wanzhou presented videos and thousands of pages of documents to back claims that Canadian authorities collaborated with the U.S. Federal Bureau of Investigation to engage in a “covert criminal investigation” to unlawfully detain, search and interrogate the Chinese executive.\n\nThe case against Meng, eldest daughter of billionaire Huawei founder Ren Zhengfei, has cast a spotlight on a broader Trump administration effort to contain China and its largest technology company, which Washington sees as a national security threat. The U.S. wants to extradite Meng after accusing her and others at Huawei of conspiring to trick banks into conducting more than $100 million of transactions that may have violated American sanctions. The company has denied it committed any violations.\n\nRead more: Huawei Accuses U.S. of Harassing Workers, Attacking Network (1)\n\nMeng’s team aims to show there was an abuse of process, which if successful, could result in the judge ordering a halt to the extradition proceedings. In a current round of disclosure hearings set to run through Oct. 4, Meng also seeks a court order to force the Canadian government to share more details about the circumstances of her arrest. Huawei spokesman Benjamin Howes declined to comment on Monday’s proceedings as the case is currently ongoing. The company has previously accused American authorities of harassing its employees, without saying how it obtained that information.\n\nMeng showed up to court Monday in a glamorous outfit replete with four-inch sparkly heels that exposed the GPS monitor on her left ankle -- one of the conditions of her C$10 million bail ($7.5 million). She was accompanied by her husband Xiaozong Liu, also known as Carlos, who could be seen occasionally nodding off in the public gallery during the lengthy proceedings.\n\nAmong the arguments Meng’s defense put forth Monday were:\n\nThat Canadian border officials -- working with Canadian police and the FBI -- deliberately delayed Meng’s arrest at the airport for three hours, using the pretext of a customs inspection to obtain access to her electronic devices and interrogate her.That U.S. authorities historically have misused border checks to scrutinize Huawei executives’ electronic devices. The lawyers cited a former company employee whose devices were seized or searched by U.S. airport authorities numerous times between 2013 and 2018. The defense plans to call as a witness a special agent who conducted one of those searches.Her defense questioned how the FBI obtained details from outside its jurisdiction about what Meng was wearing on the flight from Hong Kong before it landed.\n\nRead more: Huawei CFO Awakens Canadians to the Long, Strong Arm of China\n\n“It’s a question of pulling out all the stops,” said Gary Botting, a Vancouver-based lawyer who’s been involved in hundreds of Canadian extradition cases and watched part of Monday’s proceedings.\n\nMeng’s defense is likely trying to show that Canadian authorities collected evidence and statements irrelevant to the extradition proceedings but “will no doubt be considered gold by the FBI, who will likely use them in an attempt to bolster their case against her in the Eastern District of New York,” Botting said.\n\n(Updates with Huawei’s view from the 4th paragraph. An earlier version of the story was corrected to amend the Huawei spokesman’s last name.)\n\n--With assistance from Patricia Hurtado.\n\nTo contact the reporter on this story: Natalie Obiko Pearson in Vancouver at npearson7@bloomberg.net\n\nTo contact the editors responsible for this story: David Scanlan at dscanlan@bloomberg.net, Edwin Chan, Vlad Savov\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Huawei Technologies Co.’s chief financial officer returned to a Vancouver courtroom Monday, beginning in earnest her efforts to convince a Canadian court that her rights got trampled when she was arrested on a U.S. extradition request last December.Defense lawyers for Meng Wanzhou presented", "authors": ["Natalie Obiko Pearson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/cDTS2lp4F6srRvKn.ANJ.Q--~B/aD0xMzMxO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/0a4fc315154486d6534ab219dcd318e2", "published_at": "2019-09-24"}