{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/how-stephanie-davis-turned-life-20532501", "downloaded_at": "2019-10-07 20:12:25.077139+00:00", "title": "How Stephanie Davis turned her life around to win best actress at Inside Soap", "language": "en", "text": "Get the biggest soaps stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nStephanie Davis was over the moon as she scooped the Inside Soap Award for Best Actress at this year's ceremony.\n\nThe 26-year-old beat Corrie's Alison King, Emmerdale's Lucy Pargeter and EastEnders' Gillian Wright to the accolade.\n\nSteph returned to the Channel 4 soap late last year as Sinead O'Connor and immediately got swept up into a harrowing storyline dealing with her rapist husband Laurie Shelby.\n\nThe actress has gone through turmoil on screen and also off, as she recently revealed she had split from her latest boyfriend and Hollyoaks co-star Owen Warner.\n\nSteph shared an upbeat thank you speech on her Instagram apologising for not attending the ceremony, which appeared to have been filmed earlier in the day.\n\n(Image: Instagram)\n\n(Image: stephaniedavis88/Instagram)\n\nShe posed in the middle of a field as she reeled off her thanks and blew kisses: \"I won best actress! I'd like to say thank you to everyone who took time out to vote for me.\n\n\"It really means a lot. I'm sorry that I couldn't be there tonight, I'm just spending some time with my beautiful family and my gorgeous little boy Caben.\n\n\"I'd like to say a big thank you to my family on screen and my own family who are so supportive and beautiful. And to my amazing producer Brian Kirkwood, thank you for believing in me.\"\n\n(Image: stephaniedavis88/Instagram)\n\nSteph's big win is sure to put the cherry on top of the cake, bringing herself back on top after a rollercoaster year.\n\nThe mum to Caben-Albi, two, split from Owen after a nine-month romance and has been working hard on herself\n\nShe's currently taking a brief break from the soap, but was on the red carpet to collect her award.\n\n(Image: Stephanie Davis/Instagram)\n\nSteph was previously nominated for best actress at The British Soap Awards for her first stint as Sinead in the soap, before she left in 2015.\n\nShe went on to star in Celebrity Big Brother - after being forced to pull out of I'm A Celebrity Get Me Out of Here because of a nut allergy - where she met her ex and father of her two-year-old son Jeremy McConnell.\n\nSteph, who is also a talented singer, came runner-up on the controversial Channel 5 series.\n\n(Image: Getty Images)\n\nAfter her high-profile romance with Jeremy ended, Steph was single before meeting Owen.\n\nOwen had moved into Stephanie's house just months after they struck up their off-screen romance and was quickly becoming a large part of her young son Caben-Albi's life.\n\nBut pals told how he was finding the relationship \"suffocating\" and wanted to get out - even though they will continue to cross paths on set.\n\nThe exes became an item shortly after Steph made a comeback to Hollyoaks as Sinead O'Connor, starring alongside Owen who plays Romeo.\n\n(Image: Instagram)\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nBut since her heartbreak Steph has found a new love for fitness.\n\nShe showed off \"major\" weight loss on her Instagram Stories, posting a brief snippet of her pulling at the waistband of her trousers.\n\nSteph shared her fitness regime previously telling her followers that she had been \"running again\".\n\nHollyoaks were the big winners of the Inside Soap Awards picking up gongs in all the major categories as well as being crowned Best Soap for the first time ever.\n\nThe Channel 4 soap has been on the air since 1995 and six years before the inaugural Inside Soap Awards back in 2001.", "description": "Stephanie Davis has had a rollercoaster few years but has found herself back on top with her big win", "authors": ["Natalie Corner", "Image", "Instagram", "Stephanie Davis Instagram", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article12942596.ece/ALTERNATES/s1200/5_Stephanie-Davis-on-set-of-Hollyoaks.jpg", "published_at": "2019-10-07"}