{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7631697/New-York-Knicks-star-Reggie-Bullocks-22-year-old-sister-shot-dead-Baltimore.html", "downloaded_at": "2019-10-30 23:32:54.882113+00:00", "title": "New York Knicks star Reggie Bullock's 22-year-old sister is shot dead in Baltimore", "language": "en", "text": "New York Knicks player Reggie Bullock's 22-year-old sister has been identified as one of three people who were shot dead in Baltimore on Monday night.\n\nKeiosha Moore's violent death comes five years after her and Bullock's transgender sister, 26-year-old Mia Henderson, was stabbed to death in Baltimore.\n\nThe 28-year-old Knicks small forward took to Instagram on Wednesday, posting a heartbreaking message honoring both of his late sisters.\n\nNew York Knicks player Reggie Bullock lost his 22-year-old sister, Keiosha Moore (right) to gun violence in Baltimore Monday\n\nBullock and Moore's transgender sister, Mia Henderson, was killed in Baltimore in 2014\n\nBullock sent out this tweet vowing to lead a fight against gun violence after learning of his sister's death\n\nThe New York Knicks tweeted their condolences to Bullock and his fellow player Dennis Smith Jr, who lost his stepmother\n\n'I never felt so BROKEN in my life! My 2 queens, my 2 that go super HARD FOR ME!' Bullock wrote. 'S*** won’t ever be the same, I wish I could’ve talked once last time that day. I failed as a brother to protect you from the harm of these streets. I FAILED TWICE, to be the TRUE BROTHERS KEEPER!\n\n'You was watching my team go out there and fight the same night s*** happen! I can’t believe this happen...IM SO SORRRYYYY SISTERS. ILL DO MY BEST TO KEEP THIS FAMILY TOGETHER, and we will work VERY HARD TO SEE WHO TOOK MY SISTER LIFE!\n\n'Just wanted to laugh one last time, so you can joke on my fashion, my hair wave, all the funny s*** you use to say I MISS IT ALL! Wake me up from this dream !!! FOREVER MY 2'\n\nNine people were shot, three of them fatally, just hours apart in four separate incidents in Baltimore.\n\nPolice believe Moore was shot in the chest in the 5200 block of Fairlawn Avenue at around 7.48pm, reported CBS Baltimore.\n\nMoore was shot one in the chest before 7pm in Baltimore. She then walked into a nearby hospital, where she died\n\nHenderson was 26 years old and living in Baltimore when on July 16, 2014, she was fatally stabbed in an alley\n\nShe later walked into the nearby Sinai Hospital, where she succumbed to her wound.\n\nSo far, no arrests have been made in connection to Moore's shooting death.\n\nOn July 16, 2014, Mia Henderson was stabbed to death in an alley in north Baltimore frequented by sex workers.\n\nThree weeks later, Shawn Oliver, 46, was arrested and charged with first-degree murder in Henderson's slaying.\n\nHe was acquitted at trial in January 2017 after his defense attorney successfully argued that phone records placed him at an out-of-town location while the victim was still alive.\n\nA 46-year-old man suspected of killing Henderson was acquitted of all charges at trial in 2017\n\nOliver is currently serving a 10-year sentence on for unrelated 2015 drug conviction.\n\nIn the wake of his sister's stabbing death, Bullock has emerged as a vocal advocate for the LGBTQ community.\n\n'After losing my sister Mia in 2014 I have made it a mission to fight for LGBTQ RIGHTS!' Bullock posted on his Instagram page this week. 'Hear me when I say trans and non-binary people belong on teams, in sports and everywhere!'", "description": "New York Knicks small forward Reggie Bullock's 22-year-old sister, Keiosha Moore, was among three people who were shot dead in Baltimore just hours apart on Monday evening.", "authors": ["Snejana Farberov For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/19/20390862-0-image-a-87_1572463134237.jpg", "published_at": "2019-10-30"}