{"pub": "cbc", "url": "https://cbc.ca/sports/tennis/bianca-andreescu-china-open-quarter-final-1.5308876", "downloaded_at": "2019-10-04 16:54:48.430724+00:00", "title": "CBC Sports", "language": "en", "text": "It was billed as a marquee tennis match between two of the brightest young tennis stars in the game and on Friday Bianca Andreescu and Naomi Osaka didn't disappointment.\n\nIn a three-set thriller, former world No. 1 Osaka defeated Canada's Andreescu 5-7, 6-3, 6-4. The victory sends Osaka into the China Open semifinal against Caroline Wozniacki on Saturday.\n\nFor Andreescu, the loss ends a 17-match winning streak in what has been a remarkable run for the teenager from Mississauga, Ont. In that time she became the first Canadian woman to win the country's national open, now called the Rogers Cup, in 45 years, and the first Canadian — male or female — to win a Grand Slam when she captured the U.S. Open last month.\n\nThe heavyweight tennis slugfest between Andreescu and Osaka lasted more than two hours, both players trading powerful forehand strikes and precise backhands. It appeared as though Andreescu might cruise to victory early on. But Osaka had other plans.\n\nWATCH | Andreescu winning streak comes to an end:\n\nOsaka ended Andreescu's 17 match win streak with a 5-7, 6-3, 6-4 victory in the quarter-finals of the China Open in Beijing. 1:19\n\nAndreescu, 19, took a 5-1 lead in the first set and appeared to have all the momentum. That's when Osaka, now ranked No. 4, raised her game, coming back to tie the first set 5-5. Andreescu, though, showed the poise under pressure she has so many times this season and won the next two games to take the first set.\n\nWhen Andreescu then broke the 21-year-old Japanese star in the second set to go up 3-1, it appeared the match would be hers.\n\nAnd that's when everything changed. Osaka flipped a switch and raised her play, winning five consecutive games to win the second set, 6-3.\n\nSo many times through this victorious run by Andreescu she's been able to find magic in the most pressure-packed moments and on Friday it looked as though she'd be able to do it again.\n\nNearly unbeatable\n\nAndreescu has been nearly unbeatable when matches go the distance this season — she was 18-3 going into Friday's three-set match and had strung together 13 consecutive three-set victories.\n\nIn the third set Andreescu again broke Osaka early to bolt out to a 3-1 lead, but once again Osaka responded as she immediately broke Andreescu and then won her service game to tie the set 3-3.\n\nAndreescu held serve to take a 4-3 lead — but like she did time and time again throughout the match, Osaka raised her play to a different level.\n\nOsaka tied the third set at 4-4 before breaking Andreescu and serving for the match. Andreescu wouldn't go down without a fight though — she fought off two match points and even had a chance to break Osaka. But the Japanese tennis sensation finally fired an ace up the middle of the court for victory.\n\n\"I was really nervous on the first couple match points,\" Osaka said after the match. \"She's such an amazing player. I just told myself I have to keep fighting.\"\n\nAndreescu hits a return to Osaka on Friday. (Associated Press)\n\nIt's hard to fathom Andreescu being only 19 years old as she continues to play with the experience of someone who has been on the big stage for years — in a season full of historic firsts, this was Andreescu's first time playing in Beijing. A year ago she was ranked outside of the top 150 players in the world and was nursing a back injury.\n\nShe'll no doubt be disappointed by Friday's quarter-final loss at the China Open to Osaka but has much to celebrate during this breakout season.\n\nAndreescu has already cemented herself as one of the elite women's tennis players in the world. Injuries limited her to only one match between April and July and she still has been able to climb into the top echelon of tennis.\n\nBeginning with her breakthrough win at the Indian Wells tournament in March, followed by the Rogers Cup and U.S. Open, Andreescu has put together one of the more memorable years in recent tennis history.\n\nAnd there's more to come. Andreescu will compete at the year-end WTA Finals beginning Oct. 27 in Shenzhen, China.\n\nCurrently ranked No. 6, Andreescu could rise to No. 4 — the highest ever for a Canadian woman — despite Friday's loss.\n\nThe other semifinal pits top-ranked Ash Barty of Australia against No. 8 seed Kiki Bertens of the Netherlands.\n\nIf Osaka wins her semi over Wozniacki, Andreescu would be no better than fifth next week. If Osaka prevails in the semi and Bertens wins the tournament, Andreescu would stay at No. 6.\n\n", "description": "Bianca Andreescu lost to world No. 4 Naomi Osaka of Japan in a China Open quarter-final on Friday, ending the Canadian's win streak at a WTA Tour season-high 17 matches.", "authors": [], "top_image": "https://i.cbc.ca/1.5308974.1570202525!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/china-open-tennis.jpg", "published_at": "2019-10-04"}