{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-ecb-policy-rates-highlights/draghi-comments-at-ecb-press-conference-idUKKBN1X31MC", "downloaded_at": "2019-10-24 13:56:50.702437+00:00", "title": "Draghi comments at ECB press conference", "language": "en", "text": "FRANKFURT (Reuters) - The European Central Bank kept its ultra-easy monetary policy unchanged on Thursday, ending Mario Draghi’s eight-year tenure at the bank in exactly the same place he started: trying to prop up a perpetually ailing currency bloc.\n\nFILE PHOTO: European Central Bank (ECB) President Mario Draghi attends a news conference on the outcome of the meeting of the Governing Council, in Frankfurt, Germany, September 12, 2019. REUTERS/Ralph Orlowski/File Photo\n\nFollowing are highlights of ECB President Mario Draghi’s comments at a press conference after the bank’s policy meeting.\n\nON HIS SUCCESSOR CHRISTINE LAGARDE\n\n“I have no advice for Christine. She knows better than anyone else what to do and what to say.”\n\nON HIMSELF\n\n“I always focus on things that can be done, not things that you can’t change. And you can’t change the past unless you are an historian.”\n\nNEVER GIVE UP\n\n“If there is one general thing I am proud of it is the way the Governing Council and myself constantly pursued our mandate. This is something we collectively should be very very proud. In a sense this is part of our legacy - never give up.”\n\nON WHETHER MARKET HAS MISREAD ECB POLICY\n\n“The main goal of the September monetary policy decisions was to cement the accommodative monetary policy stance that was embedded in the expectations, as they had been affected by the weakening — regularly, continuously, weakening medium-term outlook.\n\n“And the Governing Council today, the discussion felt that this has been very largely achieved. In other words, we saw the flattening of the yield curve, we saw the now complete transmission of a lower (deposit facility rate), into lower short-term rates.\n\n“I think, actually, I don’t think the market misread. Actually, the market showed that they understood perfectly well our reaction function.”\n\nON BREXIT\n\n“In one way, in a sense, one has the sense that somehow the lower likelihood of a hard Brexit or a cliff edge has improved the overall situation. On the other, the uncertainty is still there. And ... on this specific point, it’s true that it has improved in the short term - the likelihood of having a cliff edge has gone down. At the same time, the medium-term uncertainty is considered with concern.”\n\nON BOND BUYING\n\n“It is going to take quite a bit of time before this issue will realistically present itself as a problem.”\n\nFULFILLING MY MANDATE\n\n“I feel like someone who tried to comply with the mandate in the best possible way.”\n\nMAIN RISKS\n\n“The main risk from all viewpoints, but especially also from a financial stability viewpoint, is a downturn in the economy ... whether it is global or it is euro zone.”\n\nLAGARDE AT THURSDAY’S MEETING AS OBSERVER\n\n“Christine Lagarde did not take part in the discussions but she was there.”\n\nPOLICY DISAGREEMENTS THAT BECAME PUBLIC\n\n“We have discussions, everybody has discussions, every jurisdiction has disagreements when monetary policy decisions come to be discussed.\n\n“The disagreements are often made public, often they are not so it has not been the first time. I have taken this as part and parcel of the ongoing debate and discussions.”\n\nON NEGATIVE INTEREST RATES\n\n“... The overall assessment of negative rates is generally positive. For us, it is very positive - it has been a very positive experience. Negative rates have stimulated the economy, have affected positively employment. And so all in all, we are exactly in the direction we wanted them to be.”\n\nON FISCAL POLICY\n\n“Regarding fiscal policies, the mildly expansionary euro area fiscal stance is currently providing some support to economic activity. In view of the weakening economic outlook and the continued prominence of downside risks, governments with fiscal space should act in an effective and timely manner.”\n\nMUTED INFLATION\n\n“Measures of underlying inflation remained generally muted and indicators of inflation expectations stand at low levels.”\n\nMODERATE H2 GROWTH\n\n“Incoming economic data and survey information continue to point to moderate but positive growth in the second half of this year.”\n\nDOWNSIDE GROWTH RISKS\n\n“The risks surrounding the euro area growth outlook remain on the downside. In particular, these risks pertain to the prolonged presence of uncertainties related to geopolitical factors, rising protectionism, and vulnerabilities in emerging markets.”\n\nWEAKER GROWTH MOMENTUM\n\n“While labour cost pressures have strengthened amid tighter labour markets, the weaker growth momentum is delaying their pass-through to inflation.”\n\nPROTRACTED WEAKNESS\n\n“The incoming data since the last Governing Council meeting in early September confirm our previous assessment of a protracted weakness in the euro area growth dynamics, the persistence of prominent downside risk, and muted inflation pressures.”\n\nLATEST STIMULUS IMPACT\n\n“The comprehensive package of our last meeting provides substantial monetary stimulus, which will contribute to a further easing in borrowing conditions for firms and households.”\n\nALL INSTRUMENTS\n\n“The Governing Council continues to stand ready to adjust all of its instruments as appropriate to ensure that inflation moves towards its aim in a sustained manner in line with its commitment to symmetry.”\n\nHIGHLY ACCOMMODATIVE POLICY\n\n“The Governing Council reiterated the need for a highly accommodative stance of monetary policy for a prolonged period of time to support underlying inflation pressures and headline inflation developments over the medium term.”", "description": "The European Central Bank kept its ultra-easy monetary policy unchanged on Thursday, ending Mario Draghi's eight-year tenure at the bank in exactly the same place he started: trying to prop up a perpetually ailing currency bloc.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191024&t=2&i=1444512880&w=1200&r=LYNXMPEF9N12O", "published_at": "2019-10-24"}