{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7576121/Eric-Lara-Trump-two-year-old-Luke-preschool-leave-newborn-Carolina-home.html", "downloaded_at": "2019-10-16 00:27:09.114249+00:00", "title": "Eric and Lara Trump take two-year-old Luke to preschool but leave newborn Carolina at home", "language": "en", "text": "Eric and Lara Trump enjoyed a stroll through their neighborhood on Tuesday morning as they took their two-year-old son, Luke, to school together.\n\nLara, who celebrated her 37th birthday over the weekend, was seen pushing their eldest child in a stroller while Eric, 35, took a phone call. The couple's newborn daughter, Carolina, wasn't with them and was likely left home with her nanny.\n\nThe mother-of-two was dressed casually in a flannel shirt and ripped skinny jeans when she stepped out of their Manhattan apartment. She kept warm in a leather jacket and wore a black scarf around her neck.\n\nFamily outing: Eric and Lara Trump were seen taking their two-year-old son, Luke, to preschool on Tuesday morning\n\nOn the go: Lara, 37, pushed their eldest child in a stroller during their morning walk\n\nHappy: The little boy kept himself amused with a water bottle and a yellow toy car while he relaxed in his UPPAbaby's Vista stroller\n\nLara topped off her mom-on-duty look with a pair of $995 black Gucci slides lined with cozy lambswool and aviator sunglasses.\n\nThe senior Trump 2020 campaign adviser was seen carrying an iced coffee from Starbucks as she pushed Luke's stroller with her free hand.\n\nEric, meanwhile, was dressed for work, donning a navy blue suit and white button-down sans tie. He too had an iced beverage from Starbucks, though his drink was almost finished.\n\nThe dad was seen scrolling through his cellphone and taking a call during the family outing, but Lara didn't seem bothered by the interruption.\n\nMom-on-duty look: Lara donned a leather jacket and $995 black Gucci slides lined with cozy lambswool\n\nProtection: The Trumps would have looked like any other parents taking their kids to school on Tuesday if it wasn't for their entourage of Secret Service agents that followed close behind\n\nOutfit of the day: Lara looked relaxed in ripped jeans and a cozy flannel top\n\nFuel: The mother-of-two carried an iced coffee from Starbucks in her free hand\n\nThe couple's little boy kept himself amused with a water bottle and a yellow toy car while he relaxed in his UPPAbaby's Vista stroller, which costs between $899.99 and $959.99 depending on the style.\n\nLuke was dressed in a long-sleeve blue polo and dark gray corduroy pants, which appeared to be part of his school's uniform. His school shoes, a pair of tiny loafers, look just like something his dad would wear.\n\nThe Trumps would have looked like any other parents taking their kids to school on Tuesday if it wasn't for their entourage of Secret Service agents.\n\nThree agents walked close behind them while three Secret Service vehicles followed the group as they made their way through the city streets.\n\nBusy: Eric, 35, was seen taking a phone call during the family outing\n\nFranchise fans: Like Lara, he also carried an iced drink from Starbucks in his hand\n\nUnderstanding: Lara didn't seem to be bothered by her husband scrolling through his phone\n\nFree hands: Lara's studded handbag was stowed at the bottom of her son's stroller\n\nCovered: Three Secret Service agents walked behind the couple while three Secret Service vehicles followed the group\n\nAfter dropping off Luke, the couple headed to Trump Tower together.\n\nAlthough baby Carolina wasn't with them, Lara spent some quality time with the newborn that morning as well.\n\nShe took a sweet photo of Carolina sleeping, adding a 'Queen' sticker to the snapshot before adding it to her Instagram Story.\n\nEric and Lara's only son started preschool on September 10, just a few days before his second birthday.\n\nNewest addition: Lara, who celebrated her 37th birthday on Saturday (right), shared a picture of her newborn daughter Carolina on Tuesday morning (left)\n\nFamily photo: Eric and Lara celebrated Luke's first day of preschool on September 10, just a few days before his second birthday\n\nUniform: Lara proudly posted pictures of Luke's first day, including a snapshot of him wearing a light blue polo, shorts, and loafers. She couldn't resist snapping a selfie with her little boy\n\nThe proud mom took to Instagram that day to post snapshots of Luke dressed in a long-sleeve blue polo shirt, corduroy shorts, and loafers.\n\n'FIRST DAY OF SCHOOL!!!! #NoTears,' she captioned the images, which include a family snapshot that appears to have been taken in their Manhattan apartment.\n\nThe picture shows Lara wearing a pearl-studded denim jacket and ripped jeans while holding Luke in her arms. Eric is posing behind them in a suit and tie.\n\nOther photos from the day look like they were taken inside his new school, including an image of the toddler standing next to his dad.\n\nLara couldn't resist snapping a selfie with her little boy in honor of his major milestone, and the picture shows the two cuddled close in front of an alphabet sign.", "description": "Eric, 35, and Lara, 37, were seen leaving their Manhattan apartment with their son, Luke, on Tuesday morning while taking him to school.", "authors": ["Erica Tempesta For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/18/19752482-0-image-a-10_1571160057463.jpg", "published_at": "2019-10-15"}