{"pub": "dailymail", "url": "https://thisismoney.co.uk/money/comment/article-7589675/ALEX-BRUMMER-Choosing-Bank-chief-soap-run-long.html", "downloaded_at": "2019-10-19 11:31:48.701494+00:00", "title": "ALEX BRUMMER: Choosing next Bank chief is a soap that has run too long", "language": "en", "text": "The choice of the next governor of the Bank of England has become the City's longest soap opera.\n\nChancellor Sajid Javid, during his brief sojourn in Washington, offered a little more clarity.\n\nThe promised appointment was on track for the autumn. He wants a governor who is independent (that should go without saying) and, after two Brexit-related extensions in office, Mark Carney's term would come to an end on January 31 next year.\n\nChancellor Sajid Javid wants a governor who is independent and, after two Brexit-related extensions in office, Mark Carney's term would come to an end on January 31 next year\n\nThe whole idea of appointing early is that there should be a smooth transition which leaves markets untroubled.\n\nThe choice this time has never been more critical given the market and political volatility around Brexit and the need for a stable counterforce to Westminster in the Square Mile.\n\nIt was, after all, Carney who was required to apply the balm in the chaotic aftermath of the June 2016 referendum with an interest rate cut, monetary easing and special facilities for the banks.\n\nSpeculation has not been in short supply. There have been long lists, short lists, the appearance of big overseas names such as Indian central banker and economist Raghuram Rajan and a search for gender and Brexit balance.\n\nThe delays must be torture for frontrunner Andrew Bailey, who took on the job of Financial Conduct Authority chief executive after persuasion from George Osborne.\n\nBailey has been skewered by the implosion in the Neil Woodford investment empire over which he had few levers.\n\nWhat he did have was a 'bully pulpit', an ability to use moral authority to force Woodford out much earlier, rather than allow the maverick investor to trade himself into ever deeper trouble.\n\nOn the way out: Current Bank of England Governor Mark Carney\n\nThe search for a rock star appointment, with international authority and status, is understandable.\n\nThat is the route which Brussels took when it chose Christine Lagarde to replace Mario Draghi. But it is not essential.\n\nWho had ever heard of Jay Powell, a Republican with an investment banking background, before he was slotted into the Federal Reserve?\n\nThe biggest curiosity about all of this is why a global search is in anyway necessary.\n\nBritain runs a close second to the United States as a centre of free-market financial expertise, has some of the most respected universities in the world, including the London School of Economics where a good candidate, Minouche Shafik, resides as director.\n\nAnd, within the Bank itself, there is a wealth of talented hopefuls including Andy Haldane, Jon Cunliffe and Ben Broadbent.\n\nDrawing out the process is unfair to all short-listed candidates, as well as to a longer list of possibles such as investment leader Helena Morrissey, economist Gerard Lyons and former mandarin John Kingman.\n\nThe budget scheduled for November 6 is the right moment to end the guessing game. Javid and his neighbours at No10 need to act for the sake of sanity and stability.\n\nWhisky galore\n\nAmid all the talk at the IMF about banishing trade tensions if a calamitous world slowdown is to be avoided, a new front will not help.\n\nThe decision by the US to impose £6.1billion of tariffs on an eclectic range of EU goods – over a dispute about Airbus subsidies dating back 15 years – is sparking tit-for-tat responses.\n\nThat will be another arrow aimed at world trade which grew by just 1 per cent over the last year.\n\nParadoxically, those most affected by US action will be Donald Trump's well-heeled friends currently fretting about the possibility that the Democrat's leading presidential hopeful Elizabeth Warren could hit them with a wealth tax if elected.\n\nSingle malt whisky fans and Scotland will be hurt by a tariff which will impact on £360million of exports.\n\nThen there is the blow to British Stilton cheese and Savile Row tailors. Talk about hitting the UK where it hurts.\n\nAll of this offers a reminder of the beggar-thy-neighbour policies of the 1930s depression era.\n\nFossil shaming\n\nBuilding climate change into macro-economic policy has been a big theme at the IMF, with the Fund's fiscal monitor proposing countries move towards a carbon tax regime that takes the average price up from the current $2 average to $75 over a decade.\n\nSuch a move would not make the proposed sale of a tranche of shares in $2 trillion Saudi Aramco (just delayed again) any easier.\n\nBetween terrorist attacks on oil facilities and the enveloping anti-fossil fuels agenda, 'reforming' Prince Mohammad bin Salman has a problem.", "description": "Chancellor Sajid Javid wants a governor who is independent and, after two Brexit-related extensions in office, Mark Carney's term would come to an end on January 31 next year.", "authors": ["Alex Brummer For The Daily Mail", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/21/19901854-0-image-a-26_1571429414769.jpg", "published_at": "2019-10-18"}