{"pub": "atlantic", "title": "They Met in an Elevator; Now They Travel the World Together", "url": "https://theatlantic.com/family/archive/2019/08/friends-who-follow-us-soccer-around-world/597157", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:01:29.557335+00:00", "text": "We got tired of hauling all this stuff around, and one of the rooms had a bookcase in it, so we just converted the bookcase into a portable bar. When Brock walked on the elevator, we were being escorted from one room to another, and we had the portable bar with us. He absolutely said, “These are my people.” And that is a fact. I'm pretty sure he moved into our room, ended up sleeping on the floor, and we spent the rest of that week together. We became fast friends from that moment on.\n\nBeck: What happened when you left the conference?\n\nSean: It’s a little foggy how we managed to stay in touch, because it couldn't have been easy, and I can't believe we were writing letters or anything. That doesn't really sound like us.\n\nBrock: Yeah, that doesn't sound like us. We got a boost from airline deregulation. This was before the internet, before social media, before cellphones. There's no reason we should have been able to keep in touch, but we did. One of my friends told me she'd gotten a ticket to Houston for like $135 from Bangor, Maine. I'm going like, Wait, what? There's a flight that I can almost afford? So I came down to Houston and spent spring break in 1988 with Sean and his friends.\n\nSean: We went to Louisiana, we went to Arkansas, we went down to Galveston Island, rented a condo, and hung out on the beach for a couple days. We had a pretty big time for a good solid week, and then I dropped him off at the airport with everybody just about dead and he flew back home.\n\nBrock: I think your graduation would have been the next time we got together.\n\nSean: I was finally graduating from school in 1991. I worked my way through school, so it took a little longer than the normal plan. My old roommate had fallen in love, decided to get married, and very inconsiderately picked the same day I was finally graduating to be his wedding day. I still tell them “Happy my graduation day” on their anniversary. Hunter and Nikki are their names. Hunter wanted to invite Brock to the wedding and Nikki had never even heard of Brock.\n\nBeck: Hunter invited you to his wedding based on that one spring-break trip and that's it?\n\nSean: It was a good week.\n\nBeck: It must have been.\n\nSean: Brock makes friends very quickly. So he gets invited to the wedding, it's also my graduation day, and in rolls Brock again. That was another pretty epic weekend.\n\nBeck: Have you two ever lived close to each other?\n\nBrock: Does 750 miles count?\n\nBeck: Maybe to make up for that, you created this travel tradition of the soccer trip? Tell me the origins of that.\n\nBrock: Sean, how did we get away with it?\n\nSean: We're both very persuasive, and our wives love us beyond belief.\n\nThe United States hosted the World Cup here in 1994, and after that we decided this soccer thing is kind of exciting on the global stage so maybe we should pay a little more attention. The U.S. national team makes appearances around the country, both the men and the women, so we just started popping in for games. I was working for an airline, so I could do that. Sometimes our wives would participate, sometimes not.", "description": "“Our motto is: ‘Follow soccer, see the world.’”", "authors": ["Julie Beck"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/08/Tang_Atlantic_SoccerBuddies/facebook.jpg?1567175954"}