{"pub": "investingcom", "url": "https://ca.investing.com/news/economy/update-1britains-princess-charlotte-4-starts-school-1961174", "downloaded_at": "2019-09-05 10:33:22.058238+00:00", "title": "UPDATE 1-Britain's Princess Charlotte, 4, starts school", "language": "en", "text": "© Reuters. UPDATE 1-Britain's Princess Charlotte, 4, starts school\n\n(Adds details)\n\nBy Makenzie Katz\n\nLONDON, Sept 5 (Reuters) - Princess Charlotte, daughter of Britain's Prince William and his wife Kate, started school on Thursday, joining her elder brother Prince George at Thomas's Battersea in southwest London.\n\nFour-year-old Charlotte, dressed in the school's uniform of navy blue with red trim cardigan and blue skirt, held her mother's hand as she arrived at the school, accompanied also by her father and her brother.\n\nStrict about children's appearance, the London school emphasises that hair longer than shoulder length must be tied back. Charlotte had done so neatly, with a whispy ponytail. She also bore a backpack with a sequin-studded unicorn keychain.\n\nHeadteacher Helen Haslem greeted Charlotte with a handshake as the princess balanced on tip-toe to introduce herself, watched by a beaming Kate, who wore a modest floral dress.\n\nThe great-granddaughter of Queen Elizabeth, Charlotte is fourth-in-line to the British throne, after - in ascending order - five-year-old George, her father William and her grandfather Prince Charles.\n\nCharlotte's younger brother, Louis, who is fifth-in-line to the throne, celebrated his first birthday in April.\n\nGeorge has been a pupil at Thomas's Battersea since 2017.\n\nThe school teaches 560 boys and girls between the ages of 4 and 13, with yearly fees for four year-olds of around 19,000 pounds ($24,000).\n\nThe charge for Charlotte, however, will be discounted because her brother is already a pupil. The termly fee for a second child is 6,305 pounds against 6,429 pounds for the first, according to the school's website.\n\nTwo years ago police reviewed security arrangements at the school after a 40-year-old woman was arrested on suspicion of attempted burglary there shortly after George started.\n\nThe woman accepted a caution for causing a nuisance on school property.", "description": "UPDATE 1-Britain's Princess Charlotte, 4, starts school", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEAAI0EJ_L.jpg", "published_at": "2019-09-05"}