{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/wireStory/louisianas-democratic-governor-reaching-primary-win-66226660", "downloaded_at": "2019-10-13 18:40:11.829964+00:00", "title": "Louisiana's Democratic governor forced into runoff", "language": "en", "text": "Louisiana Gov. John Bel Edwards' quest for a second term as the Deep South's only Democratic governor will stretch over another month, as voters denied him an outright primary win Saturday and sent him to a runoff election.\n\nThe incumbent's inability to top 50% of the vote in the six-candidate field raised questions about his reelection chances against a national Republican offensive that includes President Donald Trump. Trump made a last-minute appeal to Louisiana's voters to reject Edwards.\n\nEdwards will compete in the Nov. 16 runoff against Eddie Rispone, a Baton Rouge businessman and longtime GOP political donor making his first bid for public office. Rispone largely self-financed his campaign, capturing second place after outspending fellow Republican contender U.S. Rep. Ralph Abraham 5-to-1.\n\n\"We've got a little more work to do,\" Edwards told supporters Saturday night. He added: \"My fellow Louisianans, we are not going backward. That is exactly what Eddie Rispone would have us do. He wants to put us right back on the path that led us into the ditch.\"\n\nRispone said Abraham called to congratulate him and offer his support.\n\n\"With your prayers, we're going to win. This is just the first step,\" Rispone told cheering supporters. \"We're going to turn this state around.\"\n\nFive Republican statewide elected officials on the ballot won reelection: Lt. Gov. Billy Nungesser, Attorney General Jeff Landry, Treasurer John Schroder, Agriculture Commissioner Mike Strain and Insurance Commissioner Jim Donelon. Republican Secretary of State Kyle Ardoin was forced into a runoff.\n\nTrump took credit for keeping Edwards from an outright victory, saying in a tweet that Edwards \"has done a poor job. NOW HE IS IN A RUNOFF WITH A GREAT REPUBLICAN, @EddieRispone. Thank you Louisiana!\" He claimed Edwards' support fell \"after I explained what a bad job the Governor was doing.\"\n\nNational Republicans bombarded Louisiana with advertising and get-out-the-vote events to keep Edwards below 50%, with Trump making a last-minute, in-person appeal to Louisiana's voters. Three other lesser-known contenders also ran.\n\nThe Republican anti-Edwards onslaught is expected to intensify.\n\n\"Prepare yourselves,\" Edwards told his supporters. \"Over the next five weeks, the partisan forces in Washington, D.C., are going to pull out all the stops.\"\n\nRepublicans are seeking to prove that Edwards' longshot victory in 2015 was a fluke, aided by a flawed GOP opponent, David Vitter, who was hobbled by a prostitution scandal.\n\nDemocrats want an Edwards reelection win to show they can compete in a state Trump won by 20 points.\n\nBut the 53-year-old Edwards isn't exactly a Democrat in the national mold.\n\nThe West Point graduate and former Army Ranger opposes gun restrictions, talks of working well with the Trump administration and calls the U.S. House Democrats' impeachment inquiry a distraction to governing in Washington. He signed one of the nation's strictest abortion bans.\n\nEdwards sought to make the election a referendum on his performance.\n\nHe contrasted three recent years of budget surpluses with the deficit-riddled terms of his predecessor, Republican Bobby Jindal. Edwards and the majority-GOP state Legislature passed a tax deal that stabilized state finances and allowed for new investments in public colleges and the first statewide teacher raise in a decade.\n\nHe expanded Medicaid, adding nearly a half-million new people to government-financed health care and lowering the state's uninsured rate below the national average. A bipartisan criminal sentencing law rewrite he championed ended Louisiana's tenure as the nation's top jailer.\n\nBarbara Bacot, a retired state employee, said she voted for Edwards.\n\n\"He has done a very good job in the teeth of opposition from people who should know better. You can't lower taxes and run a good state,\" she said at her Baton Rouge polling place.\n\nRepublicans said Edwards raised taxes too high, stifling economic development and chasing people from Louisiana. The GOP contenders said the Medicaid expansion was rife with abuse, wasting millions of taxpayer dollars, and they sought to tie Edwards to national Democratic leaders.\n\nRispone, 70, founder of a Baton Rouge industrial contracting company, presented himself in the mold of Trump, describing himself as a conservative outsider who would upend the traditional political system of Baton Rouge.\n\n\"We need a CEO, someone with serious business experience,\" Rispone told supporters. \"Both sides of the aisle have failed you. It's time to do something different.\"\n\nHe pledged to hold a state constitutional convention to rewrite provisions dealing with the budget and taxes, state employee protections and education, though he provided few specifics. He promised to cut taxes, though it was unclear how he would balance the budget with less money even as he talked of new spending on early childhood education and roadwork.\n\nVoter Barbie Edwards said she supported Rispone because \"he's a good businessman. He'd be a good businessman for the state like Trump is for the country.\"\n\nRispone ran a nontraditional campaign, with less parade-going and handshaking. The multimillionaire instead focused on digital and TV advertising, pouring $11 million of his own money into the race.\n\nThe effort successfully drowned out advertising by Abraham, a doctor and farmer in his third term in Congress.\n\n———\n\nFollow Melinda Deslatte on Twitter at http://twitter.com/melindadeslatte", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/WireAP_67869aa11ed84d2794773f4fc60b4e42_16x9_992.jpg", "published_at": "2019-10-13"}