{"pub": "aljazeera", "url": "https://aljazeera.com/programmes/rewind/2019/10/uncomfortably-numb-gaza-opioid-addiction-crisis-191005105743075.html", "downloaded_at": "2019-10-06 11:34:45.914727+00:00", "title": "Uncomfortably Numb: Inside Gaza's Opioid Addiction Crisis", "language": "en", "text": "In Palestine, the struggle to cope with the Israeli occupation leads many to become addicted to prescription drugs.\n\nThe Gaza Strip - at points just 10km wide - is a narrow piece of land along the eastern Mediterranean coast. Its Palestinian population is sealed behind a separation barrier and tightly controlled checkpoints.\n\nGaza is home to more than 1.5 million Palestinians - half of them under the age of 15. Unemployment is among the highest in the world and every day is a struggle to survive.\n\nThousands of young people regularly risk their lives protesting their occupation by Israel along the border fence.\n\nBut there is a lesser-known unintended consequence of the occupation: opioid addiction.\n\nIn 2010, Al Jazeera's Zeina Awad travelled to Gaza and found that more and more young people were turning to prescription drugs to escape from the harsh realities of their lives.\n\nMost of the addicts are between the ages of 18 and 30 ... Those who are supposed to build our future are the most affected. Dr Samir al-Zaqout, psychologist\n\nIn the underground tunnels between Egypt and Gaza - where lifelines including food and clothes are smuggled into the blockaded strip - Al Jazeera found that a dangerous drug, Tramadol (or Tramal as it is known in Gaza), was also slipping through.\n\nThe dangerously addictive painkiller is illegal without a prescription, but a growing number of Gazans were getting hooked on it, and going to extreme means to get it.\n\n\"I buy fake prescriptions,\" Khaled al-Jarah, a long-term drug user, told Al Jazeera at the time. \"If I don't get this prescription there are other ways to get the pills. Dealers bring in boxes of them through the tunnels.\"\n\nPsychologist Dr Samir al-Zaqout treats addicts at Gaza's Community Mental Health Programme, one of the few places they are able to go for help.\n\n\"Most of the addicts are between the ages of 18 and 30 ... Those who are supposed to build our future are the most affected,\" he told Al Jazeera at the time.\n\n\"If the number of cases I have seen are 150, there are hundreds of others that I have not seen and who would never seek the help of a doctor. Why? Because we live in a traditional society that fears the stigma attached to mental illness. And addiction is not just considered to be a mental health issue. It's seen as even more serious.\"\n\nAlmost a decade on, Rewind returned to Gaza where Dr al-Zaqout told us that most users are still reluctant to come forward to be treated at the facility.\n\n\"People don't go to therapy or to a psychologist because they are afraid on two counts; they're scared of the Resistance labelling them as collaborators and they're also afraid of the associated stigma within society,\" he said.\n\nWith Gaza's political and humanitarian situation deteriorating further in recent years, and with a new upsurge of violence at the border, the painkiller problem has also worsened. Although authorities clamped down on Tramadol, other drugs, including Lyrica and Fioricet, have gained popularity.\n\n\"Now it is smuggled to Gaza through all ports and, consequently, the Strip has been drowned with drugs,\" said Dr al-Zaqout.\n\nSource: Al Jazeera", "description": "In Palestine, the struggle to cope with the Israeli occupation leads many to become addicted to prescription drugs.", "authors": ["Dr Samir Al-Zaqout"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/5/6381a7ace9844898b0cb3627f4e07759_18.jpg", "published_at": "2019-10-06"}