{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7536975/Teaching-assistant-23-claims-Pill-caused-fluid-build-brain.html", "downloaded_at": "2019-10-05 09:04:07.966014+00:00", "title": "Teaching assistant, 23, claims the Pill caused fluid to build up on her brain", "language": "en", "text": "A teaching assistant claims she was rushed to hospital after her contraceptive pill caused a potentially deadly build-up of fluid on her brain.\n\nKirsty Luckin, from Braintree in Essex, thought she was hungover when she woke with a headache on September 23.\n\nThe 23-year-old went to her GP when she felt like her head was going to 'explode'. However, they dismissed it as just a migraine.\n\nWhen her vision became blurred, she went to an optician, who saw a dangerous amount of fluid had accumulated behind her eyes.\n\nMiss Luckin was rushed to A&E, where she had a lumbar puncture to remove the fluid. She spent five days in hospital.\n\nDoctors have reportedly linked her ordeal to the Pill, which Miss Luckin took for six years. She still endures headaches nearly two weeks on.\n\nKirsty Luckin (left) claims she was rushed to A&E after the Pill caused fluid to build up on her brain. The teaching assistant spent five days at Broomfield Hospital (seen right), where she endured a lumbar puncture, scans and blood tests to uncover the problem\n\nAfter enduring an agonising headache, Miss Luckin's GP reportedly dismissed the pain as just a migraine. When her vision became blurred, she went to an optician, who noticed a dangerous amount of fluid had accumulated behind her eyes (pictured)\n\nThe NHS says some contraceptive pills have been associated with a build-up of pressure around the brain - called intracranial hypertension (IH).\n\nCharities say the condition, which can be life-threatening without prompt care, is also associated with raised fluid pressure around the brain.\n\nDespite the potential side effect of IH, contraceptive pills are safe and come with a very low risk of serious complications.\n\nSpeaking of the ordeal, Miss Luckin said: 'At first I thought my headache was linked to my hangover as I'd been out drinking the night before.\n\n'But as the days passed, it just got worse and it started to affect my vision too as the pressure in my brain build.\n\n'Doctors assumed it was a migraine but after I visited an optician, the fluid was spotted straight away, which saved my life.\n\n'By this point I felt like my head was going to explode with my eyes feeling like I was constantly wanting to rub them to focus them.'\n\nMiss Luckin was rushed to Broomfield Hospital A&E and later transferred to the stroke unit.\n\n'The fluid that was found behind my eyes was building up and causing a lot of pressure on my brain so I was admitted to the stroke unit,' she said.\n\n'I ended up having to have lumbar puncture surgery.\n\n'I had to curl up like a baby and they insert the needle into the exact place between two discs in [my spine] without hitting any nerves - otherwise it can cause damage - to drain the fluid.\n\nDOES THE PILL CAUSE FLUID TO BUILD UP ON THE BRAIN? Doctors have reportedly linked her ordeal to the Pill, which Miss Luckin took for six years. She still endures headaches nearly two weeks on. The NHS says some contraceptive pills have been associated with a build-up of pressure around the brain - called intracranial hypertension (IH). Charities say the condition, which can be life-threatening without prompt care, is also associated with raised fluid pressure around the brain. Despite the potential side effect of IH, contraceptive pills are safe and come with a very low risk of serious complications. Symptoms of IH include a constant throbbing headache, as well as blurred, double or poor vision. IH can come on without any clear cause, known as idiopathic. It is unclear how many women who take the Pill are affected. Source: NHS\n\n'I also had CT scans, loads of eye tests, blood tests. Then, a couple of days later, we finally got some answers on why this happened.'\n\nMiss Luckin claims the only thing doctors could find to blame was her contraceptive pill.\n\n'When I first arrived to the eye clinic, they asked me if I was on any medication and the only one I'm on and have only been on is my Pill,' she said.\n\n'The first thing they said to me was I need to come off of it now and to not take anything else, just to use barrier methods.\n\n'It's mad to think something so small that I've been on since I was 17 could cause so much damage.'\n\nAfter five days in hospital, Miss Luckin was discharged. Nearly two weeks on, she endures headaches and has to check her blood pressure every hour, even throughout the night.\n\nShe will see a neurologist in a couple of weeks to check if another lumbar puncture is needed.\n\nMiss Luckin is speaking out to encourage women to get themselves checked if they feel something might be wrong.\n\n'Just because you are young doesn't mean you can be dismissed, you know your own body,' she said.\n\n'I've been told what would have happened if what I had left this untreated and it wouldn't have been good.'\n\nDoctors reportedly could find nothing else to blame but the Pill, which Miss Luckin (left) had been taking for six years. The teaching assistant, who is in a relationship with her boyfriend Paul (seen together right), has been told to use 'barrier contraception' from now on", "description": "Kirsty Luckin, 23, from Braintree in Essex, thought she was hungover when she woke with a headache on September 23. She spent five days in hospital where she had a lumbar puncture.", "authors": ["Alexandra Thompson Senior Health Reporter For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/12/19292840-0-image-a-131_1570188221568.jpg", "published_at": "2019-10-04"}