{"pub": "yahoo", "url": "https://finance.yahoo.com/news/cfn-enterprises-publishes-testimonials-industry-120000975.html", "downloaded_at": "2019-10-30 11:29:33.291949+00:00", "title": "CFN Enterprises Publishes New Testimonials From Industry Leading Cannabis Executives", "language": "en", "text": "CFN Media demonstrates how it helps public and private cannabis companies succeed. CFN Media's digital media platform has been instrumental in helping hundreds of private and public cannabis and CBD companies across the globe distinguish themselves.\n\nSanta Monica, California--(Newsfile Corp. - October 29, 2019) - CFN Enterprises Inc. (OTCQB: CNFN), owner and operator of CFN Media (\"CFN Media\"), the leading agency and digital financial media network dedicated to the legal cannabis and CBD industries, today announced the publication of new client and industry testimonials, including Halo Labs, MediPharm Labs and Hemptown USA, as well as recognized industry leaders, like Bruce Linton, Founder of Canopy Growth Corporation.\n\nView the testimonials and learn how to become a client here:\n\nhttps://www.cannabisfn.com/become-featured-company/\n\n\"We are excited to share these accolades, which include video testimonials from industry titans like Bruce Linton and quoted testimonials from Rod Wolterman, CEO of Hemptown USA - a private company in the U.S. hemp space,\" said Frank Lane, President of CFN Media.\n\nAbout CFN Media\n\nFor Visitors and Viewers\n\nCFN Media's Cannabis Financial Network (CannabisFN.com) is the destination for savvy investors and business people profiting from the worldwide cannabis industry. Viewers will see breaking news, exclusive content and original programming involving the people, companies and investments shaping the industry.\n\nFor Cannabis Businesses & Companies\n\nCFN Media is a leading agency and financial media network dedicated to the cannabis industry. We help private, pre-public and public cannabis companies in the U.S. and Canada attract media attention.\n\nOur powerful digital media and distribution platform conveys a company's message and value proposition directly to national media active in the North American cannabis markets.\n\nCFN Media has enabled the world's preeminent cannabis companies to thrive.\n\nAbout CFN Enterprises Inc.\n\nCFN Enterprises Inc. (OTCQB: CNFN) owns and operates CFN Media Group, the premier agency and financial media network reaching executives, entrepreneurs and consumers worldwide. Through its proprietary content creation, video library, and distribution via www.CannabisFN.com, CFN has built an extensive database of cannabis interest, assisting many of the world's largest cannabis firms and CBD brands build awareness and thrive. For more information, please visit www.cfnenterprisesinc.com.\n\nDisclaimer\n\nCannabisFN.com is not an independent financial investment advisor or broker-dealer. You should always consult with your own independent legal, tax, and/or investment professionals before making any investment decisions. The information provided on http://www.cannabisfn.com (the 'Site') is either original financial news or paid advertisements drafted by our in-house team or provided by an affiliate. CannabisFN.com, a financial news media and marketing firm enters into media buys or service agreements with the companies that are the subject of the articles posted on the Site or other editorials for advertising such companies. We are not an independent news media provider. We make no warranty or representation about the information including its completeness, accuracy, truthfulness or reliability and we disclaim, expressly and implicitly, all warranties of any kind, including whether the Information is complete, accurate, truthful, or reliable. As such, your use of the information is at your own risk. Nor do we undertake any obligation to update the items posted. CannabisFN.com received compensation for producing and presenting high quality and sophisticated content on CannabisFN.com along with financial and corporate news. No Securities will be offered during the video series.\n\nFORWARD-LOOKING STATEMENT\n\nUse of Forward-looking Statements\n\nThis press release may contain forward-looking statements from CFN Enterprises Inc. within the meaning of the \"safe harbor\" provisions of the Private Securities Litigation Reform Act of 1995 and federal securities laws. For example, when CFN Enterprises Inc. describes how it helps private and public cannabis companies succeed and uses other statements containing the words \"believes,\" \"anticipates,\" \"plans,\" \"expects,\" \"will\" and similar expressions, CFN Enterprises Inc. is using forward-looking statements. These forward-looking statements are based on the current expectations of the management of CFN Enterprises Inc. only, and are subject to a number of factors and uncertainties that could cause actual results to differ materially from those described in the forward-looking statements. The following factors, among others, could cause actual results to differ materially from those described in the forward-looking statements: regulatory and licensing risks; changes in general economic, business and political conditions, including changes in the financial markets; the regulatory landscape and enforcement related to cannabis, including political risks and risks relating to regulatory change; changes in applicable laws; compliance with extensive government regulation; public opinion and perception of the cannabis industry; we may be unable to retain or attract key employees whose knowledge is essential to the development of our products and services; or, loss of market share and pressure on pricing resulting from competition, which could cause the actual results or performance of CFN Enterprises Inc. to differ materially from those contemplated in such forward-looking statements. Except as otherwise required by law, CFN Enterprises Inc. undertakes no obligation to publicly release any revisions to these forward-looking statements to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events. For a more detailed description of the risk and uncertainties affecting CFN Enterprises Inc., reference is made to CFN Enterprises Inc.'s reports filed from time to time with the Securities and Exchange Commission.\n\nStory continues", "description": "CFN Media demonstrates how it helps public and private cannabis companies succeed. CFN Media's digital media platform has been instrumental in helping hundreds of private and public cannabis and CBD companies across the globe distinguish themselves. Santa Monica, California--(Newsfile Corp. - October", "authors": ["Newsfile Corp."], "top_image": "https://s.yimg.com/uu/api/res/1.2/PwaP8_bJuZme6CKl_01lHQ--~B/aD0zMDt3PTE5NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/newsfile_64/2342357ed2039cf9e5a61d98cfa2815f", "published_at": "2019-10-29"}