{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7579555/House-lot-33-boys-killed-serial-killer-goes-market-459K.html", "downloaded_at": "2019-10-16 21:41:49.376708+00:00", "title": "House on a lot where 33 boys were killed a by serial killer goes on the market for $459K", "language": "en", "text": "A house built on land where notorious serial killer John Wayne Gacy murdered 33 young men in Illinois is on the market for $459,000.\n\nThe three-bed property, located east of O'Hare Airport, was built after Gacy’s brick ranch was torn down in 1979 as investigators searched for bodies.\n\nBefore it was bulldozed, the 'killer clown' murdered 33 young men between 1972 and 1978 and buried 29 of their corpses underneath his house.\n\nA house built on land where John Wayne Gacy murdered 33 young men in Illinois is on the market for $459,000. He is pictured following his arrest in December, 1978\n\nIn 1979, John Wayne Gacy, (pictured), was arrested in Cook County, Illinois for a series of murders in the area of Des Moines, Illinois. He was convicted of murdering 33 young men ranging in age from 14 to 21\n\nA Chicago woman later bought the land in 1986 for $30,544 and built a home on it for her retired parents, who did know about the site's violent history.\n\nThe 2,500-square-foot home, which sits on the lot that is just under 9,000 square feet, is now selling for $459,000, TMZ reported.\n\nIt is described as a 'beautiful brick home' with three bedrooms, two bathrooms and it has an updated kitchen overlooking a large backyard.\n\nInvestigators began to find bodies buried in his crawlspace hours after Gacy’s arrest in December of 1978. He dumped four others from bridges once his property could hold no more bodies.\n\nWorking as a remodeling contractor in suburban Norwood, Gacy began building a reputation as an organizer of parties and parades as 'Pogo the clown.'\n\nHe would lure young men to his home by impersonating a police officer or promising them construction work.\n\nBefore the original house, (pictured), was bulldozed, the 'killer clown' murdered 33 young men between 1972 and 1978 and buried 29 of their corpses there\n\nThe 2,500-square-foot home, which sits on the lot that is just under 9,000 square feet, is now selling for $459,000, TMZ reported. It is seen above in its current form\n\nIt is described as a 'beautiful brick home' with three bedrooms, two bathrooms and it has an updated kitchen overlooking a large backyard\n\nHe often found some of the young men hitchhiking or at bus stops.\n\nMany had troubled families or substance abuse problems. Others had worked construction for Gacy, a building contractor who sometimes lured victims by hiring them or pretending to be a police officer.\n\nOnce his victims were were safely restrained, usually in a pair of handcuffs as he demonstrated a 'trick' he learned as a clown, Gacy's smile disappeared and he became a cold, growling predator who sexually assaulted his victims before strangling many of them with a knotted rope.\n\nGacy began was an organizer of parties and parades and dressed as a clown who cheered up hospitalized children\n\nGacy was executed by lethal injection in 1994 and his last words were 'Kiss my a*s'\n\nGacy acknowledged during his trial that he had sex with his victims, but claimed frequent blackouts and said he remembered killing only five.\n\nHe stabbed at least one of them and strangled the others. Authorities said Gacy was forced to start stacking the bodies in the crawl space under his home because he was killing so many people.\n\nWhile only two of Gacy's eight remaining victims have been identified since the launch of the DNA-based investigation, authorities said it had solved cold cases that were not related to the serial killer, including five missing persons who were located alive and two who had died elsewhere in the country.\n\nInvestigators began to find bodies buried in his crawlspace hours after Gacy’s arrest in December of 1978\n\nHe stabbed at least one of his victims and strangled the others. Most of the victims were buried under his home but others were dumped in a river (Cook County Sheriff's Police evidence technicians remove remains of a body from the Chicago suburban Des Plaines home in 1978.=)\n\nFor the six who remain unidentified, their remains were placed into a paupers grave.\n\nInvestigators were alerted to Gacy after a boy went missing who he had been talking with him about construction work.\n\nOn searching his home, they found a series of odd items - such as clothes too small for Gacy - and the smell of decay.\n\nGacy was executed by lethal injection in 1994. His last words were 'Kiss my a*s.'\n\nIn 1968, Gacy pleaded guilty to a charge of sodomy involving a minor. He moved to the Chicago area after he was paroled in June 1970, having served 16 months of his 10-year sentence.", "description": "A property on land where notorious serial killer John Wayne Gacy once lived and killed 33 young men is on the market in Chicago for $459,000. Gacy buried 29 of his victims underneath his house.", "authors": ["Leah Mcdonald For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/15/19790898-0-image-a-2_1571234985087.jpg", "published_at": "2019-10-16"}