{"pub": "realclearpolitics", "url": "https://theguardian.com/commentisfree/2019/sep/07/it-may-feel-like-the-worlds-ending-but-america-has-reason-to-hope", "downloaded_at": "2019-09-09 23:17:52.774616+00:00", "title": "It may feel like the world's ending – but America has reason to hope", "language": "en", "text": "If stagnant wages, near-record inequality, climate change, nuclear buildups, assault weapons, mass killings, trade wars, opioid deaths, Russian intrusions into American elections, kids locked in cages at our border, and Donald Trump in the White House don’t at least occasionally cause you feelings of impending doom, you’re not human.\n\nBut I want you to remember this: as bad as it looks right now – as despairing as you can sometimes feel – the great strength of this country is our resilience. We bounce back. We will again.\n\nNot convinced?\n\nFirst, come back in time with me to when I graduated college in 1968. That year, Martin Luther King Jr was assassinated. Robert F Kennedy was assassinated. Our cities were burning.\n\nTens of thousands of young Americans were being ordered to Vietnam to fight an unwinnable and unjust war, which ultimately claimed more than 58,000 American lives and the lives of over 3 million Vietnamese.\n\nThe nation was deeply divided. And then in November, Richard Nixon was elected president. I recall thinking this nation would never recover. But somehow we bounced back.\n\nIn subsequent years we enacted the Environmental Protection Act. We achieved marriage equality. We elected a black man to be president of the United States. We passed the Affordable Care Act.\n\nEven now, it’s not as bleak as it sometimes seems. In 2018, a record number of women, people of color, and LGBTQ representatives were elected to Congress, including the first Muslim women.\n\nThere is no 'right' v 'left': it is Trump and the oligarchs against the rest | Robert Reich Read more\n\nEighteen states raised their minimum wages.\n\nEven in traditionally conservative states, surprising things are happening. In Tennessee, a Republican legislature has enacted free community college and raised taxes for infrastructure. Nevada has expanded voting rights and gun controls. New Mexico has increased spending by 11% and raised its minimum wage by 60%.\n\nTeachers have gone on strike in Virginia, Oklahoma, West Virginia, Kentucky and North Carolina – and won. The public sided with the teachers.\n\nIn several states, after decades of tough-on-crime policies, conservative groups have joined with liberals to reform criminal justice systems. Early childhood education and alternative energy promotion have also expanded nationwide, largely on a bipartisan basis.\n\nWhenever privilege and power conspire to pull us backward, we eventually rally and move forward\n\nIn 2018, South Carolina passed a law giving pregnant workers and new mothers more protections in the workplace. The law emerged from an unlikely coalition – supporters of abortion rights and religious groups that oppose them. A similar alliance in Kentucky enacted laws requiring that employers provide reasonable accommodations for pregnant workers and new mothers.\n\nThe arc of American history reveals an unmistakable pattern. Whenever privilege and power conspire to pull us backward, we eventually rally and move forward.\n\nSometimes it takes an economic shock like the bursting of a giant speculative bubble. Sometimes we just reach a tipping point where the frustrations of average Americans turn into action.\n\nNow, come forward in time with me.\n\nLook at the startling diversity of younger Americans. Most Americans now under 18 years old are ethnically Hispanic, Asian or Pacific Islander, African American, or of more than one race. In 10 years, it’s projected that most Americans under 30 will be.\n\nThree decades from now, most of America will be people of color or of more than one race. That diversity will be a huge strength. Hopefully, it will mean more tolerance, less racism, less xenophobia.\n\nYoung people are determined to make America better. I’ve been teaching for almost 40 years, and I’ve never taught a generation of students as committed to improving the nation and the world as is the generation I’m now teaching. A record percentage of them voted in the 2018 midterm elections. Another sign of our future strength.\n\nMeanwhile, most college students today are women, which means that in future years even more women will be in leadership positions – in science, politics, education, non-profits, and in corporate suites. That will also be a great boon to America.\n\nTo state it another way, there is ample reason for hope.\n\nBut hope is not enough. In order for real change to occur, the locus of power in the system will have to change. Millions will need to be organized and energized – not just for a particular election but for an ongoing movement, not just for a particular policy but to reclaim democracy from the moneyed interests so that an abundance of good policies are possible.\n\nThe oligarchs and plutocrats would like nothing better than for the rest of us to give up and drop out. That way, they get it all. But we never have, and we never will. Preserving and expanding democracy has been America’s central project since its founding. It’s an unending fight. And no matter how bleak it may look, we will never stop fighting.", "description": "Inequality, the climate crisis, and Trump in the White House may cause despair. But the country is poised to bounce back", "authors": ["Robert Reich"], "top_image": "https://i.guim.co.uk/img/media/a0c32c3c407af2ee813b1e9dba761a495a164db4/0_384_5760_3456/master/5760.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=880d29e00649278e9d281ee4fcaf3acc", "published_at": "2019-09-07"}