{"pub": "cbc", "title": "CBC Radio", "url": "https://cbc.ca/radio/q/amanda-brugel-on-the-handmaid-s-tale-fighting-for-good-roles-and-rejecting-stereotypes-1.5061324", "language": "en", "published_at": "2019-08-26", "downloaded_at": "2019-09-02 07:10:44.028396+00:00", "text": "Originally published on March 19, 2019\n\nWhen Amanda Brugel auditioned for the role of Rita — a member of the subservient class of housekeepers called Marthas on The Handmaid's Tale — she told the other actors auditioning to go home.\n\n\"I was dead serious,\" she in a conversation with guest host Ali Hassan on CBC's q. \"'Walk them to their car. That's enough.'\"\n\nThey would have wasted less time if they listened. Brugel got the part, giving the character a backstory and a unique physicality, making it into an iconic and nuanced role.\n\nBut first, she had to go through rounds of auditions to beat out an American candidate for the role.\n\nAmanda Brugel as Rita and Elisabeth Moss as June Osborne/Offred in The Handmaid's Tale. (George Kraychyk/Hulu)\n\n\"I just had to keep going back and battling it out and keep mentioning I had a wealth of knowledge about the book — and eventually won it, but not without a fair fight,\" she said.\n\nUntil she could prove to casting directors there was no better Rita, Brugel had to get them to set aside the fact that \"they initially wanted a recognizable name.\"\n\nIt's funny, because if you've watched a film or television show shot in Canada you've probably seen Brugel on your screen.\n\nThe actor has had parts on Kim's Convenience, Orphan Black, Workin' Moms and the Oscar-nominated film Room.\n\nAmanda Brugel as Officer Parker in the film Room. (A24)\n\nBut Brugel says Canadians don't always recognize or promote talented artists in the country, which can make it harder for actors who want to build careers in the country they love.\n\n\"I don't think Canadians bingeing Kim's Convenience on Netflix realize it's written and directed in Toronto with a Canadian cast and a Canadian crew,\" she said. \"I don't think a lot of kids at home gaming realize Assassin's Creed is developed in Canada.\"\n\nShe's trying to change that, as the face of a new campaign by the Canada Media Fund called MADE.\n\nOn sets for Canadian shows like Kim's Convenience, people tell stories under much tighter budgets than their American counterparts like The Handmaid's Tale, said Brugel.\n\nWe're not as loud. It's not that we don't have the substance. - Amanda Brugel\n\n\"The biggest difference is, I think people would think there are these luxurious catered dinners and, I don't know, 'Prince is there,' but the largest difference is the amount of time that we have. You get one or two takes, then you have to move on. Whereas ... American shows are almost treated as a film ... you have the luxury to play.\"\n\nShe believes that makes it a great training ground for higher budget productions, which might be part of the reason why so many Canadian media companies often serve as part of the production line of larger American productions, working on special effects, sound and other services.\n\n\"We're not as loud. It's not that we don't have the substance. They realize a lot of talent is here and that's why they keep returning,\" said Brugel. \"Us ourselves as Canadians, we're a little reluctant to be as loud as they are it's just the loudest voice is usually the one that's heard.\"\n\nThe Handmaid's Tale returns for its third season in June. You can catch the season premiere on Bravo, Crave TV and Hulu.\n\nClick 'Listen' near the top of this page to hear the full interview.\n\n— Produced by ​Kaite Toth", "description": "From Kim's Convenience to Orphan Black, Amanda Brugel has had parts in multiple Canadian productions, but she says we still have far to go when it comes to recognizing Canadian film industry talent.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5061608.1566916983!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/amanda-brugel.jpg"}