{"pub": "businessinsider", "url": "https://businessinsider.com/trump-faces-impeachment-but-centrist-cover-up-continues-2019-10", "downloaded_at": "2019-10-22 13:36:29.903358+00:00", "title": "Trump is finally facing impeachment, but another, bigger cover-up is continuing in broad daylight", "language": "en", "text": "Democrats in Congress have started impeachment proceedings against President Donald Trump.\n\nBut many of the policies and policymakers who laid the groundwork for Trump, and enabled his misdeeds, are going unquestioned, writes Quincy Institute cofounder and president Andrew Bacevich.\n\nVisit Business Insider's homepage for more stories.\n\nThere is blood in the water and frenzied sharks are closing in for the kill. Or so they think.\n\nFrom the time of Donald Trump's election, American elites have hungered for this moment. At long last, they have the 45th president of the United States cornered. In typically ham-handed fashion, Trump has given his adversaries the very means to destroy him politically. They will not waste the opportunity. Impeachment now — finally, some will say — qualifies as a virtual certainty.\n\nNo doubt many surprises lie ahead. Yet the Democrats controlling the House of Representatives have passed the point of no return. The time for prudential judgments — the Republican-controlled Senate will never convict, so why bother? — is gone for good. To back down now would expose the president's pursuers as spineless cowards. The New York Times, the Washington Post, CNN, and MSNBC would not soon forgive such craven behavior.\n\nSo, as President Woodrow Wilson speaking in 1919 put it, \"The stage is set, the destiny disclosed. It has come about by no plan of our conceiving, but by the hand of God.\" Of course, the issue back then was a notably weighty one: whether to ratify the Versailles Treaty.\n\nThat it now concerns a \"Mafia-like shakedown\" orchestrated by one of Wilson's successors tells us something about the trajectory of American politics over the course of the last century and it has not been a story of ascent.\n\nTrump with Ukrainian President Volodymyr Zelenskiy at the UN General Assembly in New York, September 25, 2019. Associated Press\n\nThe effort to boot the president from office is certain to yield a memorable spectacle. The rancor and contempt that have clogged American politics like a backed-up sewer since the day of Donald Trump's election will now find release. Watergate will pale by comparison. The uproar triggered by Bill Clinton's \"sexual relations\" will be nothing by comparison.\n\nA de facto collaboration between Trump, those who despise him, and those who despise his critics all but guarantees that this story will dominate the news, undoubtedly for months to come.\n\nAs this process unspools, what politicians like to call \"the people's business\" will go essentially unattended.\n\nSo while Congress considers whether or not to remove Trump from office, gun-control legislation will languish, the deterioration of the nation's infrastructure will proceed apace, needed healthcare reforms will be tabled, the military-industrial complex will waste yet more billions, and the national debt, already at $22 trillion — larger, that is, than the entire economy — will continue to surge. The looming threat posed by climate change, much talked about of late, will proceed all but unchecked. For those of us preoccupied with America's role in the world, the obsolete assumptions and habits undergirding what's still called \"national security\" will continue to evade examination. Our endless wars will remain endless and pointless.\n\nBy way of compensation, we might wonder what benefits impeachment is likely to yield. Answering that question requires examining four scenarios that describe the range of possibilities awaiting the nation.\n\nTrump meets with House Speaker Nancy Pelosi, standing left, Congressional leaders, and others at the White House, October 16, 2019. Associated Press\n\nThe first and most to be desired (but least likely) is that Trump will tire of being a public piñata and just quit. With the thrill of flying in Air Force One having worn off, being president can't be as much fun these days. Why put up with further grief? How much more entertaining for Trump to retire to the political sidelines where he can tweet up a storm and indulge his penchant for name-calling.\n\nAnd think of the \"deals\" an ex-president could make in countries like Israel, North Korea, Poland, and Saudi Arabia on which he's bestowed favors. Cha-ching! As of yet, however, the president shows no signs of taking the easy (and lucrative) way out.\n\nThe second possible outcome sounds almost as good but is no less implausible: A sufficient number of Republican senators rediscover their moral compass and \"do the right thing,\" joining with Democrats to create the two-thirds majority needed to convict Trump and send him packing.\n\nIn the Washington of that classic 20th-century film director Frank Capra, with Jimmy Stewart holding forth on the Senate floor and a moist-eyed Jean Arthur cheering him on from the gallery, this might have happened. In the real Washington of \"Moscow Mitch\" McConnell, think again.\n\nThe third somewhat seamier outcome might seem a tad more likely. It postulates that McConnell and various GOP senators facing reelection in 2020 or 2022 will calculate that turning on Trump just might offer the best way of saving their own skins. The president's loyalty to just about anyone, wives included, has always been highly contingent, the people streaming out of his administration routinely making the point. So why should senatorial loyalty to the president be any different?\n\nAt the moment, however, indications that Trump loyalists out in the hinterlands will reward such turncoats are just about nonexistent. Unless that base were to flip, don't expect Republican senators to do anything but flop.\n\nThat leaves outcome number four, easily the most probable: While the House will impeach, the Senate will decline to convict. Trump will therefore stay right where he is, with the matter of his fitness for office effectively deferred to the November 2020 elections. Except as a source of sadomasochistic diversion, the entire agonizing experience will, therefore, prove to be a colossal waste of time and blather.\n\nHouse Speaker Nancy Pelosi gestures to fellow Democrats as President Donald Trump acknowledges women in Congress during his State of the Union address. AP Photo/Andrew Harnik\n\nFurthermore, Donald Trump might well emerge from this national ordeal with his reelection chances enhanced. Such a prospect is belatedly insinuating itself into public discourse.\n\nFor that reason, certain anti-Trump pundits are already showing signs of going wobbly, suggesting, for instance, that censure rather than outright impeachment might suffice as punishment for the president's various offenses. Yet censuring Trump while allowing him to stay in office would be the equivalent of letting Harvey Weinstein off with a good tongue-lashing so that he can get back to making movies. Censure is for wimps.\n\nBesides, as Trump campaigns for a second term, he would almost surely wear censure like a badge of honor. Keep in mind that Congress's approval ratings are considerably worse than his. To more than a few members of the public, a black mark awarded by Congress might look like a gold star.\n\nNot removal but restoration\n\nSo if Trump finds himself backed into a corner, Democrats aren't necessarily in a more favorable position. And that ain't the half of it.\n\nLet me suggest that, while Trump is being pursued, it's you, my fellow Americans, who are really being played. The unspoken purpose of impeachment is not removal, but restoration.\n\nThe overarching aim is not to replace Trump with Mike Pence — the equivalent of exchanging Groucho for Harpo. No, the object of the exercise is to return power to those who created the conditions that enabled Trump to win the White House in the first place.\n\nHillary Clinton. Drew Angerer/Getty Images\n\nJust recently, for instance, Hillary Clinton declared Trump to be an \"illegitimate president.\" Implicit in her charge is the conviction — no doubt sincere — that people like Donald Trump are not supposed to be president. People like Hillary Clinton — people possessing credentials like hers and sharing her values — should be the chosen ones.\n\nHere we glimpse the true meaning of legitimacy in this context. Whatever the vote in the Electoral College, Trump doesn't deserve to be president and never did.\n\nFor many of the main participants in this melodrama, the actual but unstated purpose of impeachment is to correct this great wrong and thereby restore history to its anointed path.\n\nIn a recent column in the Guardian, professor Samuel Moyn makes the essential point: Removing from office a vulgar, dishonest, and utterly incompetent president comes nowhere close to capturing what's going on here.\n\nTo the elites most intent on ousting Trump, far more important than anything he may say or do is what he signifies. He is a walking, talking repudiation of everything they believe and, by extension, of a future they had come to see as foreordained.\n\nMoyn styles these anti-Trump elites as \"centrists,\" members of the post-Cold War political mainstream that allowed ample room for nominally conservative Bushes and nominally liberal Clintons, while leaving just enough space for Barack Obama's promise of hope-and-(not-too-much) change.\n\nJoe Biden, then vice president, with then-Secretary of State Hillary Clinton at the National Prayer Breakfast, February 4, 2010. Reuters\n\nThese centrists share a common worldview. They believe in the universality of freedom as defined and practiced within the United States. They believe in corporate capitalism operating on a planetary scale. They believe in American primacy, with the United States presiding over a global order as the sole superpower. They believe in \"American global leadership,\" which they define as primarily a military enterprise.\n\nAnd perhaps most of all, while collecting degrees from Georgetown, Harvard, Oxford, Wellesley, the University of Chicago, and Yale, they came to believe in a so-called meritocracy as the preferred mechanism for allocating wealth, power, and privilege.\n\nAll of these together comprise the sacred scripture of contemporary American political elites. And if Donald Trump's antagonists have their way, his removal will restore that sacred scripture to its proper place as the basis of policy.\n\n\"For all their appeals to enduring moral values,\" Moyn writes, \"the centrists are deploying a transparent strategy to return to power.\" Destruction of the Trump presidency is a necessary precondition for achieving that goal.\n\n\"Centrists simply want to return to the status quo interrupted by Trump, their reputations laundered by their courageous opposition to his mercurial reign, and their policies restored to credibility.\" Precisely.\n\nHigh crimes and misdemeanors\n\nFor such a scheme to succeed, however, laundering reputations alone will not suffice. Equally important will be to bury any recollection of the catastrophes that paved the way for an über-qualified centrist to lose to an indisputably unqualified and unprincipled political novice in 2016.\n\nFormer President George W. Bush hugs his wife, Laura Bush, during the George W. Bush Presidential Center Topping Out Ceremony on October 3, 2011 in Dallas, Texas. Tom Pennington/Getty Images\n\nHolding promised security assistance hostage unless a foreign leader agrees to do you political favors is obviously and indisputably wrong. Trump's antics regarding Ukraine may even meet some definition of criminal. Still, how does such misconduct compare to the calamities engineered by the \"centrists\" who preceded him?\n\nConsider, in particular, the George W. Bush administration's decision to invade Iraq in 2003 (along with the spin-off wars that followed). Consider, too, the reckless economic policies that produced the Great Recession of 2007-2008. As measured by the harm inflicted on the American people (and others), the offenses for which Trump is being impeached qualify as mere misdemeanors.\n\nHonest people may differ on whether to attribute the Iraq War to outright lies or monumental hubris. When it comes to tallying up the consequences, however, the intentions of those who sold the war don't particularly matter. The results include thousands of Americans killed; tens of thousands wounded, many grievously, or left to struggle with the effects of PTSD; hundreds of thousands of non-Americans killed or injured; millions displaced; trillions of dollars expended; radical groups like ISIS empowered (and in its case even formed inside a US prison in Iraq); and the Persian Gulf region plunged into turmoil from which it has yet to recover.\n\nHow do Trump's crimes stack up against these?\n\nThe Great Recession stemmed directly from economic policies implemented during the administration of President Bill Clinton and continued by his successor. Deregulating the banking sector was projected to produce a bonanza in which all would share. Yet, as a direct result of the ensuing chicanery, nearly 9 million Americans lost their jobs, while overall unemployment shot up to 10%. Roughly 4 million Americans lost their homes to foreclosure. The stock market cratered and millions saw their life savings evaporate.\n\nAgain, the question must be asked: How do these results compare to Trump's dubious dealings with Ukraine?\n\nTrump at a campaign rally in Dallas, October 17, 2019. Associated Press\n\nTrump's critics speak with one voice in demanding accountability. Yet virtually no one has been held accountable for the pain, suffering, and loss inflicted by the architects of the Iraq War and the Great Recession. Why is that? As another presidential election approaches, the question not only goes unanswered, but unasked.\n\nTo win reelection, Trump, a corrupt con man (who jumped ship on his own bankrupt casinos, money in hand, leaving others holding the bag) will cheat and lie. Yet, in the politics of the last half-century, these do not qualify as novelties. (Indeed, apart from being the son of a sitting US vice president, what made Hunter Biden worth $50Gs per month to a gas company owned by a Ukrainian oligarch? I'm curious.)\n\nThat the president and his associates are engaging in a cover-up is doubtless the case. Yet another cover-up proceeds in broad daylight on a vastly larger scale.\n\n\"Trump's shambolic presidency somehow seems less unsavory,\" Moyn writes, when considering the fact that his critics refuse \"to admit how massively his election signified the failure of their policies, from endless war to economic inequality.\" Just so.\n\nWhat are the real crimes? Who are the real criminals? No matter what happens in the coming months, don't expect the Trump impeachment proceedings to come within a country mile of addressing such questions.\n\nAndrew Bacevich, a TomDispatch regular, is president and cofounder of the Quincy Institute for Responsible Statecraft. His new book, \"The Age of Illusions: How America Squandered Its Cold War Victory,\" will be published in January.", "description": "The policies and policymakers who laid the groundwork for Trump, and enabled his misdeeds, are going unquestioned, writes Andrew Bacevich.", "authors": ["Andrew J. Bacevich"], "top_image": "https://image.businessinsider.com/5da93935cc4a0a16860c68e2?width=1200&format=jpeg", "published_at": "2019-10-21"}