{"pub": "breitbart", "url": "https://breitbart.com/news/salah-fires-liverpool-to-comeback-win-over-spurs", "downloaded_at": "2019-10-28 00:32:10.727988+00:00", "title": "Salah fires Liverpool to comeback win over Spurs", "language": "en", "text": "Liverpool (AFP) – Mohamed Salah claimed the 50th Anfield goal of his Liverpool career from the penalty spot as the Premier League leaders restored their six-point advantage at the top of the table after surviving a major scare against Tottenham.\n\nIt was a comeback victory that had Liverpool’s demanding manager Jurgen Klopp heaping praise on his players for their composure in responding after Harry Kane had shot Spurs into a shock lead with only 47 seconds played.\n\nSalah struck a clinical 75th-minute penalty into the bottom right-hand corner after Serge Aurier tripped Sadio Mane, which took him to a half-century of home goals in just his 58th outing.\n\nIt completed a second-half comeback, started when Jordan Henderson cancelled out a dramatic opening goal from Kane.\n\nThere was more good news for Liverpool supporters after the game when Klopp revealed that Salah, who limped off in the closing minutes with what appeared to be an ankle problem, was only removed as a precaution.\n\n“When we were 1-0 down, we didn’t chase it immediately. We just played it,” said a delighted Klopp.\n\n“Very often the result is the result of the performance. The performance was really, really good. I liked it a lot. Being 1-0 down against Tottenham with the strength they have in counter-attacking is really tough.”\n\nHe added: “The game I loved, a super game, how football should look, how we should play against a really strong, good organised side.”\n\n– Kane strikes –\n\nKane struck inside a minute, becoming the joint-third highest scorer in the famous club’s history with his 174th goal in Tottenham colours.\n\nIt was also one of the simplest after Moussa Sissoko sparked a scrambling couter-attack and set Son Heung-min racing upfield.\n\nThe South Korean’s powerful strike from the edge of the area took a wild deflection off the head of Dejan Lovren before striking the woodwork but the rebound fell kindly for Kane to stoop and head into the gaping net.\n\nIt was a lead that lasted, somehow, until the 52nd minute when a Henderson cross was headed clear and turned back into the area by Fabinho.\n\nDanny Rose appeared to nudge Roberto Firmino in the back but, with referee Anthony Taylor unmoved, the ball continued to the corner of the six-yard area where Henderson hit it on the half-volley into the Spurs goal.\n\nMinutes earlier, Spurs might have doubled their lead when Son was sent clear on the end of a long clearance by keeper Paulo Gazzaniga. He rounded Alisson Becker but could only strike the cross-bar from a tricky angle.\n\nBut the equaliser was no more than Liverpool deserved after a dominant first-half spell in which only an inspired performance from stand-in goalkeeper Gazzaniga maintained the visitors’ lead.\n\nIn one breathless, four-minute spell, Liverpool carved out five excellent chances, with Gazzaniga peerless in dealing with them.\n\n“In this season we deserve more points on the table,” said Spurs manager Mauricio Pochettino, whose side are languishing in 11th spot in the table.\n\n“It’s a moment to stay strong, to keep pushing. Of course in a different season this could have finished two or three nil for us. But today for us it is a different way and it is important for us it is to stay calm and take the best decisions for the future.\n\n“I’ve nothing (critical) to say because after five-and-a-half years it’s a moment to be all together and show our support.”", "description": "Liverpool (AFP) – Mohamed Salah claimed the 50th Anfield goal of his Liverpool career from the penalty spot as the Premier League leaders restored", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/27/25c57e_liverpool-mohamed-salah-celebrates-scoring-penalty-tottenham-salah-fires-640x335.jpg", "published_at": "2019-10-27"}