{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7550895/Retiring-Juventus-legend-Claudio-Marchisio-Paul-Pogba-boyhood-heroes.html", "downloaded_at": "2019-10-12 15:21:55.107541+00:00", "title": "Retiring Juventus legend Claudio Marchisio on Paul Pogba and his boyhood heroes", "language": "en", "text": "Claudio Marchisio was known as the most 'British' midfielder in Serie A, a box-to-box athlete with an eye for goal.\n\nHe was a true captain of Juventus, a man who refused every offer he received from rival Italian clubs for the sake of the team in which he grew up.\n\nHere, Alvise Caznazzo chats exclusively with the 33-year-old following his retirement announcement.\n\nClaudio Marchisio, who spent 13 years at Juventus, has announced his retirement from football\n\nClaudio, in England you always had an admirer: Jurgen Klopp. He has always appreciated you. Would you have enjoyed playing in England?\n\nAs a boy, two of my favourite players (Steven Gerrard and Frank Lampard) played in England, so it was normal for me to follow the English championship.\n\nThe rhythm and the physicality of the games have always fascinated me. As well as the concept that the fans the most important thing, they ask to see your shirt dirty with sweat, as a symbol of the battle on the field. The big plays are important, but they always come after the sweaty shirt.\n\nIn terms of business and organisation, the Premier League and Championship are two extremely fascinating leagues. Let's say that the English experience fascinated me, but spending all my career at Juventus was my priority as a player.\n\nDid you ever come close to signing for an English team?\n\nIt cannot be said that I was close to any English team, but there was interest from the Manchester teams and Chelsea. But Juventus has always been my priority, so real negotiations were never started.\n\nMarchisio came through the ranks at Juventus and won seven Serie A titles with the club\n\nYour No 8 was taken by Aaron Ramsey, a player who grew up at Arsenal just like you grew up at Juventus. Is your shirt in good hands?\n\nIn the best hands. Ramsey is a fantastic player. The No 8 is such a beautiful number that it had to end up on someone's back. My preferences were two, Ramsey or an academy player who moved up to the first team.\n\nPaul Pogba misses Juventus. You were one of the magnificent three together with Paul and Andrea Pirlo, as well as Arturo Vidal.\n\nI'll tell you an anecdote about Paul. One of the very first training sessions with us he was at a very young age. Andrea Pirlo and I took only 15 minutes to understand how strong Pogba was, and we also knew that he would soon take someone's place in the team. Fortunately the coach found a system that allowed us to all play together. What a beautiful midfield, even with Arturo!\n\nMarchisio (right) was part of an impressive Juventus midfield along with Paul Pogba (left)\n\nWhich player did you like the most in the Premier League? And with whom would you have liked to play?\n\nWhen the coach moved my position from second striker to midfielder in the Juventus youth, I began to observe the great midfielders of the football scene. Even just to try to steal secrets and understand the malice needed for the role.\n\nWithout a doubt my favourites remain Gerrard and Lampard. They were both very strong and both undisputed symbols of their own clubs.\n\nI admired both their charisma, the mastery of the game, the leadership, the courage and their attachment to the shirt.\n\nHow much did you enjoy being described as the new Gerrard?\n\nTo me that meant a lot. You should ask him though!\n\nMarchisio counts Steven Gerrard (left) and Frank Lampard as two of his favourite players\n\nWho is the toughest English opponent you've faced?\n\nAt the 2014 World Cup when we played against England, I was impressed by Jordan Henderson. It was clear that the tradition of the great English midfielders would continue with him. He was really good.\n\nHow did you find playing with Patrick Vieira at Juventus?\n\nHe was a fantastic player, a leader. One of those players who increases the level of a team, on and off the field.\n\nIt was an honour to be able to train with players of this ability. We also learned just by being in the locker room with them.\n\nWould you like to be a coach now that you've retired?\n\nI haven't ruled out anything, but for the moment I have not decided what I will do.", "description": "EXCLUSIVE INTERVIEW BY ALVISE CAGNAZZO: Claudio Marchisio was known as the most 'British' midfielder in Serie A, a box-to-box athlete with an eye for goal.", "authors": ["Alvise Cagnazzo For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/17/19452308-0-image-a-26_1570553477010.jpg", "published_at": "2019-10-12"}