{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/07/1926072/0/en/Orbite-Provides-Corporate-Update.html", "downloaded_at": "2019-10-07 20:00:41.308862+00:00", "title": "Orbite Provides Corporate Update", "language": "en", "text": "LAVAL, Québec, Oct. 07, 2019 (GLOBE NEWSWIRE) -- Orbite Technologies Inc. (NEX: ORT.H) (“Orbite” or the “Company”) today provided an update on its plan to emerge from CCAA protection.\n\nDefinitions of the capitalized terms used herein can be found at the end of this press release.\n\nCCAA Court extends the Stay Period\n\nAs announced on September 16, 2019, the CCAA Court issued an order pursuant to the CCAA providing for a Stay Period until October 4, 2019. On October 4, 2019 the CCAA Court granted a motion filed by the Company and issued an order extending the Stay Period until October 29, 2019.\n\nAccording to the Company’s cashflow projections filed with the CCAA Court, cost-cutting measures implemented by the Company have allowed the Company to further extend its cashflow until October 29, 2019.\n\nSale and Investment Solicitation Process (SISP)\n\nAs announced on August 15, 2019, the Monitor, in concert with Orbite, opened the bids received on August 9, 2019. Requests for clarifications were sent to some of the bidders in order to determine the best option for the creditors and other stakeholders. Discussions with bidders are ongoing.\n\nThe Company will provide further updates as developments occur.\n\nThere can be no guarantees that the Company will otherwise be successful in its restructuring efforts and will emerge from CCAA protection.\n\nDefinitions\n\nCCAA: Companies’ Creditors Arrangement Act.\n\nCCAA Court: Quebec Superior Court.\n\nMonitor: PricewaterhouseCoopers Inc.\n\nStay Period: Period of time during which there is a stay of all proceedings against the Company.\n\nAbout Orbite\n\nOrbite Technologies Inc. is a Canadian cleantech company whose innovative and proprietary processes are expected to produce alumina and other high-value products, such as rare earth and rare metal oxides, at one of the lowest costs in the industry, and in a sustainable fashion, using feedstocks that include aluminous clay, kaolin, nepheline, bauxite, red mud, fly ash as well as serpentine residues from chrysotile processing sites. Orbite is currently in the process of finalizing its first commercial high-purity alumina (HPA) production plant in Cap-Chat, Québec and has completed the basic engineering for a proposed smelter-grade alumina (SGA) production plant, which would use clay mined from its Grande-Vallée deposit. The Company's portfolio contains 15 intellectual property families, including 41 patents and 17 pending patent applications in 11 different countries and regions. The Company also operates a state of the art technology development center in Laval, Québec, where its technologies are developed and validated.\n\nForward-looking statements\n\n\n\nCertain information contained in this document may include \"forward-looking information\". Without limiting the foregoing, the information and any forward-looking information include statements regarding projects, costs, objectives and future returns of the Company or hypotheses underlying these items. In this document, words such as \"may\",” confident”, \"would\", \"could\", \"will\", \"likely\", \"believe\", \"expect\", \"anticipate\", \"intend\", \"plan\", \"estimate\" and similar words and the negative form thereof are used to identify forward-looking statements. Forward-looking statements should not be read as guarantees of future performance or results, and will not necessarily be accurate indications of whether, or the times at or by which, such future performance will be achieved. Forward-looking statements and information are based on information available at the time and/or the Company management's good-faith beliefs with respect to future events and are subject to known or unknown risks, uncertainties, assumptions and other unpredictable factors, many of which are beyond the Company's control. Risks, uncertainties and other factors that could affect anticipated results and future events also include, but are not limited to, those described in the section of the Management's Discussion and Analysis (MD&A) entitled \"Risk and Uncertainties\" as filed on July 28, 2017 on SEDAR, including those under the headings “Going Concerns”, Commercial Operation of HPA Plant”, “We will need to raise capital to continue our growth” and “Development Goals and Time Frames” described in the MD&A filed on March 31, 2017.\n\nThe Company does not intend, nor does it undertake, any obligation to update or revise any forward-looking information or statements contained in this document to reflect subsequent information, events or circumstances or otherwise, except as required by applicable laws.\n\nCONTACT INFORMATION:", "description": "", "authors": ["Technologies Orbite Inc.", "Orbite Technologies Inc."], "top_image": "http://www.globenewswire.com/Attachment/LogoDisplay/544465?filename=544465.jpg&size=1", "published_at": "2019-10-07"}