{"pub": "businessinsider", "url": "https://businessinsider.sg/after-viral-hari-raya-film-singapores-government-agencies-have-nailed-it-again-with-3-hilarious-new-clips-for-deepavali", "downloaded_at": "2019-10-25 16:35:52.258716+00:00", "title": "After viral Hari Raya film, Singapore’s government agencies have nailed it again with hilarious new clips for Deepavali", "language": "en", "text": "The vadai-making grandma who upgrades her skills steals the show in one of the videos. Screengrab from Facebook / Gov.sg\n\nThe Festival of Lights is just around the corner – and the government is back at it again with lighthearted films to commemorate the ethnic holiday.\n\nThe group of three short films made waves on the internet and earned praise from various netizens for successfully marrying humour with public messages.\n\nPublished last week by Gov.sg and People’s Association (PA), they pay homage to popular Indian films while highlighting government schemes in a lighthearted way. But you don’t have to be a Bollywood buff to appreciate their humour.\n\nI’ve never watched any of the movies referenced in the short films, but found myself laughing at its magic arrows and vadai-making granny who upgrades her skills through government programmes.\n\nHere are some of the films’ best highlights:\n\nOne of the videos, “The Royal Conundrum”, was posted on the Gov.sg Facebook page last Wednesday (Oct 16), and features a comedic skit set in an Indian palace.\n\nWhen the king gets “poked” by another king on Facebook, his wife advises him to give the other king cake instead of retaliating.\n\n“But our royal kitchen only has the grandma who makes vadai,” the king replies, referring to the Indian fried snack.\n\ncaption Panic at the courtroom! source Screengrab from Facebook / Gov.sg\n\nOverhearing the conversation, the vadai-making granny was determined to save the day, and tells herself that she cannot remain “stagnant”.\n\nThus, she soups up her skills through Workforce Singapore’s Adapt and Grow programme. In the end, she cooked up a Deepavali feast truly fit for kings and queens – and was henceforth known as “Grandma Version 2.0”.\n\nThe video was inspired by 2006 Tamil historical-comedy movie Imrai Arasan, which was well received by local audiences, The Straits Times (ST) quoted Soffy Hariyanti, director of campaigns and production at the Ministry of Communications and Information (MCI), as saying.\n\nIt is the first in a two-part series, with each short film lasting about one and a half minutes.\n\nPrime Minister Lee Hsien Loong, who shared the video on Facebook, called it a “fun video with a serious message”.\n\n“We need to prepare for economic changes by learning new skills and ad apting to new job demands,” he said.\n\nThe second part of the Gov.sg series is titled “What could go wrong at a Royal Deepvali celebration?”\n\nWhen a royal guest falls ill while feasting, the king orders his delegates to bring the palace doctor.\n\nHowever, the guest refuses the king as it will be “very expensive” – much to the ire of the ruler.\n\ncaption Doesn’t this phrase ring a bell? source Screengrab from Facebook / Gov.sg\n\nThe king then orders his staff to get his “magical CHAS bow and arrow” and takes his aim at the guest.\n\nBut…it flies over his head and becomes fireworks which reveal Community Health Assistant Scheme (CHAS) cards.\n\nThe film makes reference to the 2015 hit movie Baahubali at the beginning, with the king cheekily asking: “If we use motion capture technology to show me fighting like Baahubali, will our people believe it?”\n\nIt starred local actors and actresses like V.Mohan and Jamuna Rani, as well as Vasantham host-actor-singer Elamaran Natarajan and actress-host Jaenani Netra.\n\nAccording to ST, both videos were directed by Mr S.S. Vikneshwaran from local production house Cosmic Ultima Pictures.\n\n“The idea was to create videos with entertaining yet meaningful messages, which would resonate with viewers,” ST quoted Soffy Hariyanti as saying.\n\nThe most recent video of the three was a heartwarming film posted by the People’s Association (PA) on Saturday (Oct 19). A little girl is seen sharing a treat her mom made with neighbours of different races. caption source Screengrab from Facebook / People’s Association\n\nThe video then shows Indian residents preparing for Deepavali.\n\nThe residents then gather in a community centre to celebrate Deepavali together.\n\nAside from some Vasantham artistes like Vishnu, Indra and Ashwini, most of the cast were grassroots volunteers from Bukit Merah and Radin Mas CC, PA said in the comments.\n\nNetizens around Singapore were full of praise for the videos, calling them “entertainingly informative” and lauding the actors’ “exceptionally good acting”.\n\nThe Deepvali clips are the latest in a slew of festive videos put up by government agencies in Singapore.\n\nEarlier in the year, the Public Utilities Board (PUB) put up an award-winning Hari Raya short film titled “Kinship”, which tells the emotive tale of two orphaned brothers.\n\nFor Chinese New Year, the Singapore Civil Defence Force (SCDF) showed uniformed officers having a reunion meal with each other.\n\nAnd who can forget when Singapore Tourism Board re-dubbed iconic Channel 8 drama Unbeatables to remind Singaporeans to protect themselves with travel insurance?\n\nWhich leaves us to wonder – what are they going to cook up for good ol’ Christmas?\n\nRead Also:", "description": "Business Insider - Watching vadai grandma upgrade her skills has never been so entertaining.. Read more at businessinsider.sg", "authors": ["Lamont Mark Smith"], "top_image": "https://static.businessinsider.sg/sites/2/2019/10/DP-rc3.png", "published_at": "2019-10-25"}