{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7536617/Australian-label-TJ-Swim-shares-swimwear-trends-watch-season.html", "downloaded_at": "2019-10-08 02:17:14.006676+00:00", "title": "Australian label TJ Swim shares swimwear trends to watch out for this season", "language": "en", "text": "A swimwear designer has predicted the bikini trends we'll be rocking on the beach and by the pool this summer - and some might come as a surprise.\n\nTara Jane, who is the owner of Australian label TJ Swim, believes the 80s-inspired high-cut bottom will remain high on our list of must haves this season, as will neon prints and all black ensembles.\n\nBut surprisingly she has noticed a resurgence in long sleeved suits, which were spotted on the Miami Swim Week runway earlier this year.\n\nSo what will you be wearing in the heat?\n\nA swimwear designer has predicted the bikini trends we'll be rocking on the beach and by the pool this summer - and some might come as a surprise\n\n1. High-Cut Suits\n\nThis trend is here to stay according to Tara Jane.\n\n'Ultra high-cut bikini bottoms and one pieces remained the most common trend across all runway shows at Miami Swim Week 2019,' she said.\n\n'Eighties inspired high-cut legs are popular as they elongate the legs and complement the curves of the female body.'\n\n'Ultra high-cut bikini bottoms and one pieces remained the most common trend across all runway shows at Miami Swim Week 2019,' she said\n\nThis trend is a favourite among Australian Instagram influencers who are regularly spotted at the beach\n\n2. Bright & Bold Colours\n\nThere is nothing like seeing a sea of colour down by the shoreline, particularly when they blend so nicely with a golden tan.\n\n'Expect to see statement, block colours on the beaches this season like electric blue, ruby red, vibrant orange and of course the go-to candy pinks and bright yellows,' she said.\n\nFloral colourways and chic pastels will still be popular too, but you'll notice them less on the beaches Down Under.\n\nThere is nothing like seeing a sea of colour down by the shoreline, particularly when they blend so nicely with a golden tan\n\nFloral colourways and chic pastels will still be popular too, but you'll notice them less on the beaches Down Under (pictured is a neon design)\n\n3. Underwire Bikini Tops\n\nThis type of top made quite a statement when it appeared two years ago on the catwalk and is the perfect mix of style and comfort.\n\nMade to fit much like a bra would it provides plenty of support for those who wear a bigger cup size and struggle to fit into plunging triangle pieces.\n\n'Whether it's in a bold print or block colour, this top enhances the shape of the bust and is the trend that's set to dominate this summer,' she said.\n\nThis type of top made quite a statement when it appeared two years ago and is the perfect mix of style and comfort\n\n4. LBB's - Little Black Bikinis\n\nSay goodbye to the LBD, or little black dress, and say hello to the LBB, or little black bikini.\n\n'The trusted little black bikini is every girl's go-to summer essential and that won't be changing this season,' she said.\n\n'LBB's are predominantly classic styles such as the string bikini and usually feature thin straps making them perfect for tanning.'\n\nSay goodbye to the LBD, or little black dress, and say hello to the LBB, or little black bikini\n\n5. Long Sleeve Suits\n\nThis was a new look for the runways in Miami and transition perfectly from the beach to the bar.\n\n'Enjoy basking in the summer sun whilst still getting that SPF+ coverage we all need,' she said.\n\n'Then head to a beach bar and enjoy a nice aperol spritz with a cute pair of denim shorts.'", "description": "An Australian swimwear designer has predicted the bikini trends we'll be rocking on the beach and by the pool this summer - and some might come as a surprise.", "authors": ["Matilda Rudd For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/02/19421428-0-image-a-64_1570497607567.jpg", "published_at": "2019-10-08"}