{"pub": "fox", "url": "https://foxbusiness.com/lifestyle/lori-loughlin-felicity-huffman-jail-tips", "downloaded_at": "2019-10-19 11:25:12.500468+00:00", "title": "Lori Loughlin allegedly seeking Felicity Huffman's jailhouse tips", "language": "en", "text": "Actress Lori Loughlin is preparing for her upcoming court proceedings in connection to a sweeping college cheating scandal by seeking jailhouse tips from fellow TV star Felicity Huffman, who is serving 14 days behind bars for her own involvement in the case, according to a report.\n\nContinue Reading Below\n\nLoughlin, who is best known for her role as Aunt Becky in “Full House,” was among more than 50 people arrested in March. Huffman, Loughlin and Loughlin’s fashion-designer husband, 55-year-old Mossimo Giannulli, were charged with conspiracy to commit mail and wire fraud.\n\nThe couple is accused of paying William “Rick” Singer — who, according to the Department of Justice, ran a “for-profit college counseling and preparation business” – approximately $500,000 to create nonexistent positions for their daughters on the University of Southern California’s crew team, even though neither had ever taken part in the sport.\n\nHuffman was sentenced in September to two weeks in prison for paying $15,000 to have her daughter’s SAT scores fixed in 2017. She pleaded guilty in May and reported to the Federal Correctional Institution in Dublin, California on Tuesday.\n\nShe is due to be released on Oct. 27, just shy of her 14-day sentence, according to the Bureau of Prisons inmate locator.\n\nBut before the “Desperate Housewives” star checked in to jail, Loughlin attempted to reach out, People reported, citing a source.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\n“She wanted to encourage her, and see how she was doing,” the source told the outlet. “She feels like their fates are tied together now, even though they weren’t really friends before.”\n\nLoughlin is hoping for the best for Huffman, the source said, noting that it would be “a positive sign” in terms of her own impending fate.\n\n“She feels like Felicity’s time in jail will be an indicator on her own time, and she’s extremely curious to know how it goes,” the source added. “Of course, it’s still very important for her to be exonerated of all charges against her. She still maintains her innocence, and hopes it won’t come to that. But if she does end up serving time in prison, she wants to know what she’s getting into.”\n\nLoughlin and her husband pleaded not guilty to their charges in April. Their next court date is scheduled for January 2020, though no trial date has been publicly announced.\n\nLoughlin's attorney declined comment.\n\nIn addition to Huffman, several other parents who have pleaded guilty have since been sentenced.\n\nLos Angeles businessman Devin Sloane, 53, was sentenced on Sept. 24 to four months in prison. Sloane admitted to paying a quarter-million dollars to have his son fraudulently admitted to the University of Southern California as a water polo player.\n\nOn Oct. 4, Greenwich, Connecticut lawyer Gordon Caplan, 53, was ordered to spend a month in the slammer for spending $75,000 to rig his daughter’s test scores. The next day, California winemaker Agustin Huneeus Jr. was sentenced to five months behind bars for paying $300,000 to get his daughter into USC.\n\nThen, New York City parents Gregory and Marcia Abbott, ages 68 and 59, respectively, were also handed a one-month jail sentence after admitting to paying $125,000 to benefit their daughter.", "description": "\"If she does end up serving time in prison, she wants to know what she’s getting into.”", "authors": ["Stephanie Pagones"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/huffman-loughlin-1-AP.jpg?ve=1&tl=1", "published_at": "2019-10-18"}