{"pub": "bbc", "url": "https://bbc.com/news/blogs-news-from-elsewhere-50141841", "downloaded_at": "2019-10-22 13:24:57.779939+00:00", "title": "Chinese 'panda' pet cafe raises eyebrows", "language": "en", "text": "Image copyright Hongxing News Image caption A pet cafe in China's Sichuan province lets people play with dogs dyed to look like pandas.\n\n​Animal cafes have been springing up all over the world for the last two decades as a place for animal lovers to enjoy a meal alongside their furry friends.\n\nBut a new \"panda\" cafe in Chengdu in south-western China - internationally known as the home of the giant panda - is raising eyebrows and a lot of concern.\n\nAccording to the Chengdu Economic Daily, a cafe recently opened in Chengdu, seems at first glance to be home to six giant panda cubs.\n\nBut the \"panda\" cafe is - in fact - all bark and no bite because on closer inspection, it turns out they are actually the Chow Chow breed of dogs, which have been dyed to look like China's national animal.\n\n'Could damage their fur and skin'\n\nThe owner of the cafe, Mr Huang, says that as well as serving food and drink, the cafe provides a dyeing service.\n\nHe tells Hongxing News that he imports his dye from Japan and has hired special staff for dyeing the dogs.\n\n\"Every time we dye it costs 1,500 yuan [$211; £163],\" he says. \"The dye is really expensive.\" He says that this is to ensure the quality of the dye, and says that it in no way affects the animals.\n\nYou may also be interested in:\n\nHongxing News says that a short video inside the cafe had raised awareness of it nationally and has boosted visitor figures.\n\nBut it has also raised a lot of concern. One vet, Li Daibing, told Hongxing News that he urged people not to dye their pets, saying: \"This could damage their fur and skin.\"\n\nImage copyright VCG Image caption Chengdu has become a popular tourist site for seeing the vulnerable species, and national Chinese treasure: the giant panda.\n\n'Has become normal'\n\nDyeing pets became a full-blown craze in China in the early 2010s, first for competitions, but then amidst a domestic wave of \"extreme dog pampering\".\n\nSince, however, there has been a growing consciousness in China about animal ethics and testing. Many of the thousands of social media users commenting on the popular Sina Weibo microblog have voiced their concern about such treatments being used on animals.\n\nMany call the idea \"crazy\" and note that hair dye can \"damage people's hair and scalp\", so could similarly affect a dog.\n\nBut others argue that \"it's really cute\", and say that they perceive animal dyeing \"has become normal\".\n\nIt's not just China either - earlier this year, the Latitude Festival in Suffolk was criticised by the RSPCA after a flock of sheep were dyed pink.\n\nReporting by Kerry Allen\n\nNext story: Turkmen banks ordered to fund leader's pet project\n\nUse #NewsfromElsewhere to stay up-to-date with our reports via Twitter.", "description": "An animal cafe has opened in Chengdu that lets people play with \"pandas\" that are actually dogs.", "authors": ["News Elsewhere...", "...As Found Bbc Monitoring"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/143AE/production/_109326828_panda.png", "published_at": "2019-10-22"}