{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/ant-mcpartlin-declan-donnelly-fight-20649623", "downloaded_at": "2019-10-19 11:25:16.571135+00:00", "title": "Ant McPartlin and Declan Donnelly fight back the tears in first look of their DNA Journey documentary", "language": "en", "text": "Get the biggest I'm a Celebrity stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAnt McPartlin, 43, and Declan Donnelly, 44, have embarked on a two-year journey tracing their genealogy for a new documentary Ant & Dec’s DNA Journey which is set to be an emotional roller coaster for the childhood friends.\n\nIn the first look clip of the the factual film, the Newscastle natives struggle to fight back the tears as they gush about their friendship, delve into their ancestral history and meet family members they never knew existed.\n\nThe footage begins with Dec stating: “It is not lost on us how lucky we are that we met eachother, we get on so well” before welling up as he says “I am getting emotional now.”\n\nAnt then shares: “I am more up for this, Ill be honest I think he is a little bit nervous.”\n\nThen Dec adds: “I am not sure if I am ready.”\n\nThe touching scenes are followed by a montage of clips of the stunning locations they will visit, with the cameras, such as Ireland and the United States of America - as well as clips of them being guided by historians and DNA experts.\n\nViewers also see Ant greet his mother with affection and the pair of pals trawling through historical paperwork to see where their bloodline leads them.\n\nProving the show is going to be full of heartwarming moments, the advert ends with Dec saying: \"I never cried so much on telly in all my life.\"\n\nGetting their fans excited for the show, the duo tweeted: \"Two years of filming.. and a lot of crying on the telly ! Our #DNAjourney has been the adventure of a lifetime and we can’t wait to share it with you on @ITV this November.\"\n\nFans of the TV favourites, who first rose to fame on teen soap Byker Grove in 1990 and now present some of the biggest TV shows such as Britain's Got Talent and I'm A Celebrity...Get Me Out Of Here, took to Twitter to share their excitement of the upcoming show.\n\nOne wrote: \"Awhhhh really looking forward to this.\"\n\nAnother quizzed: \"Oh, how many boxes of tissues do I need to buy then? Asking for me and the rest of the fandom.\"\n\n\"I am already in tears only watching the trailer cannot wait lads! Very happy you decided to do this and share it with us all,\" penned another.\n\n*Ant & Dec's DNA Journey coming soon to ITV.", "description": "The TV presenters, who have been pals for 29 years, well up on a number of occasions in the short clip that gives a glimpse of their upcoming series", "authors": ["Sara-Aisha Kent"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20649674.ece/ALTERNATES/s1200/1_Screen-Shot-2019-10-18-at-155808.jpg", "published_at": "2019-10-18"}