{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/fighting-for-hong-kong-2", "downloaded_at": "2019-10-28 13:20:26.256083+00:00", "title": "Tanya Chan, Hong Kong Legislator and Democracy Leader", "language": "en", "text": "Tanya Chan at the United Nations in Geneva, September 2019 (UN Watch)\n\nTanya Chan, one among the millions\n\nEditor’s Note: The below is a larger version of a piece published in the current issue of National Review.\n\nFor the past several months, the people of Hong Kong have been massing in the streets, protesting for their democratic rights. They have turned out in their millions. It’s hard to focus on millions of people — how about one? And a prominent person, at that? She is Tanya Chan, a member of Hong Kong’s Legislative Council, and a democracy leader.\n\nAdvertisement\n\nAdvertisement\n\nIn September, she was in Geneva, testifying before the U.N. Human Rights Council. She had been invited to do so by UN Watch, a non-governmental organization accredited to the U.N. The Chinese government tried to stop her appearance. They told the U.N. that Chan was a “convicted criminal” — which she is. She was found guilty of participating in democratic protests, essentially. More on this in due course.\n\nBefore the Human Rights Council, Chan testified about police brutality in Hong Kong: myriad physical abuses, including sexual abuses. The police call protesters “cockroaches,” she said, meaning that “violence is regarded as acceptable pest control.” She further said that police brutality is “a direct result of the lack of democracy in Hong Kong,” as “the government is not held accountable for its endorsement” of the brutality.\n\nWhat did she want from the Human Rights Council? An intervention, so to speak: an urgent session on human-rights violations in Hong Kong, and a commission of inquiry. She also had a question, as she testified: “Why is China sitting here, as a member of this human-rights council?”\n\nAdvertisement\n\nAdvertisement\n\nA very good question.\n\nTanya Chan is a Hong Konger, born and bred. In a conversation with her, I ask a personal question — one having to do with identity: “Do you feel like a Hong Konger? Like a Chinese person? Or some blend?” She answers, firmly, “I am definitely a Hong Konger.” She was educated at Sacred Heart Canossian College and then at the University of Hong Kong, where she earned a law degree.\n\nIn 1997, she was in her mid 20s. Why is that relevant? Because 1997, as you recall, is the year that the “handover” occurred: the transfer of sovereignty over Hong Kong from Great Britain to the People’s Republic of China — a.k.a. Communist China, or Red China, or, simply, China. I have another personal question for Chan: “How did you feel? Excited, hopeful, nervous — or some blend?” This time, the answer is “blend.”\n\nShe liked the concept of “one country, two systems.” That was the promise, remember. Hong Kong would be part of China, but it would maintain its own, democratic system. The city would be governed by “our small constitution,” as Chan says: the Basic Law. While she looked forward to this, she was nervous about how it would pan out: The concept of “one country, two systems” had never been implemented anywhere else.\n\nAdvertisement\n\nIn 2006, she was a founding member of the Civic party, which is a liberal-democratic party — aiming at free elections, the rule of law, civil liberties, and all the rest. The father of democracy in Hong Kong is widely acknowledged to be Martin Lee, whom many of us have esteemed for decades. He is now in his early 80s. When I mention him, Tanya Chan says, with delight, that she has just seen him.\n\nAdvertisement\n\nIt was in 2008 that Chan was first elected to the Legislative Council. She represents Hong Kong Island. She is sometimes known as “the Zhou Xun of the Civic party” — Zhou Xun being a very famous Chinese actress and singer, about the same age as Chan.\n\nBefore the massive demonstrations of 2019, which have attracted worldwide attention, there was the Umbrella Movement of 2014. This, too, was a democratic movement. Its aim was to stop the erosion of electoral rights in Hong Kong. It got its name because people used umbrellas as shields, to ward off pepper spray and tear gas, coming from the police.\n\nAdvertisement\n\nTanya Chan was a leader in this movement. She was one of the Umbrella Nine, charged, convicted, and sentenced for their involvement. The general charge was “public nuisance.” Chan, with the other eight, was to be sentenced in April 2019, but her sentencing was delayed until June.\n\nAs she explains, she went for a physical exam, “because I thought I would be put into prison for quite some time, and I hoped that I could at least comfort my mum that I would be fine in prison,” which is to say, in good enough health. It was discovered that she had a brain tumor, the size of a golf ball. She said to the public, “I will try my best to treat my condition and walk with everybody along what could be a very long journey to democracy.”\n\nChan underwent five hours of surgery, followed by 30 sessions of radiotherapy. Today, she says, she is fully recovered.\n\nAdvertisement\n\nAdvertisement\n\nWhen June came around, she was sentenced to eight months in prison, suspended for two years. The Hong Kong branch of Amnesty International said — about the treatment of the Umbrella Nine altogether — “This is the latest dark chapter in the curtailing of the right to freedom of expression and peaceful assembly in Hong Kong.”\n\nIf Tanya Chan is again charged and convicted, she will have to serve the original eight months and then whatever the new sentence is. Therefore, “I need to be more careful,” she says. She wants to participate in all the activities of the democracy movement, but she will have to be “selective,” as she says.\n\nWhen she speaks on the streets, she is something to behold, as you can see in videos — on YouTube, for example. Pretty and feminine, she is also feisty and fearless, hollering for her rights, and those of her fellow citizens.\n\nThe protests of 2019 were sparked by an extradition bill, which would have sent Hong Kongers, and foreigners arrested in Hong Kong, to the mainland for justice — which is no kind of justice. According to reports, there have been as many as 2 million people in the streets of Hong Kong at the same time, protesting. Is that true? There has been skepticism about this outside Hong Kong. The population of the city is only 7.4 million.\n\nAdvertisement\n\nIt is absolutely true, says Tanya Chan — and there have probably been more than 2 million. No one had ever witnessed anything like it.\n\nThe police brutality has shocked and distressed many Hong Kongers. Before the 1980s, says Chan, the police in Hong Kong were corrupt, and a great amount of work was done to correct that. “In the past few decades,” she says, “people have actually had a lot of respect for the police” — but no longer.\n\nIn early September, the chief executive of Hong Kong — who is like a governor, as Chan explains — withdrew the extradition bill. The official in question is Carrie Lam (or “Mrs. Carrie Lam,” as Chan refers to her). Does she act on her own? Or is she merely a puppet for Beijing? Who calls the shots — the important shots — in Hong Kong?\n\n“Hmmm,” says Chan. “Very interesting question.” She believes that Mrs. Lam called this shot, in order to “test the waters” — in order to see what the reaction of the public would be. Would the withdrawal of the extradition bill quell the protests?\n\nIt did not — which leads to the question, What do the protesters want now? Four things, Chan says.\n\nFirst, protesters want an independent commission, to investigate “the whole extradition-bill saga,” as Chan puts it, “including police brutality.” Second, they want the government to stop using the word “riots” to describe the demonstrations.\n\nRioting is a very serious charge in Hong Kong, subjecting a person to as much as ten years in prison. The U.S. president was not helpful in this regard. In August, a reporter asked Donald Trump, “Are you concerned by reports that the Chinese army may be preparing to intervene in Hong Kong against the demonstrators?” Trump answered as follows:\n\nWell, something is probably happening with Hong Kong, because, when you look at, you know, what’s going on, they’ve had riots for a long period of time. And I don’t know what China’s attitude is. Somebody said that at some point they’re going to want to stop that. But that’s between Hong Kong and that’s between China, because Hong Kong is a part of China. They’ll have to deal with that themselves. They don’t need advice.\n\nThird, Hong Kong’s democracy protesters want amnesty for all those who have been arrested while peacefully demonstrating. And fourth, they want “universal suffrage,” as soon as possible.\n\n“Universal suffrage,” to most of us, means voting rights for women, minorities, and so on. In the context of Hong Kong, it means the right to elect the chief executive and the Legislative Council directly. As it stands, the chief executive is elected by a committee. And half the Legislative Council is elected through “functional constituencies,” i.e., interest groups, such as trades or professions. The other half is elected in a familiar democratic way: through “geographical constituencies” (of which Tanya Chan’s Hong Kong Island is an example).\n\nSuffice it to say, the present structure has a pro-Beijing effect.\n\nAdvertisement\n\nI ask Chan, “Will the CCP [Chinese Communist Party] ever accept that fourth demand?” She gives a laugh and says, “Well, it’s promised, and it is written clearly in our Basic Law.”\n\nTo many of us looking on from abroad, I tell Chan, Hong Kong looks like “an independent-minded, stubborn child, whom a dictatorial parent” — namely, Beijing — “wants to bring to heel.” My phrase “independent-minded” sets off a little alarm in her.\n\nThe word “independence,” Chan says, is “very, very sensitive” in Hong Kong at the moment. The same with the adjective “independent.” Nevertheless, she continues, “we’re like a very stubborn child, as you have said. We enjoyed a lot of good things before the handover — for example, judicial independence and freedom of expression — and we have appreciated and treasured these core values.”\n\n(It is not always possible to avoid the word “independence,” or “independent” — as in “judicial independence” and “independent commission.”)\n\nChan further notes that some of her fellow Hong Kongers care most about financial advantage. What would be best for business? What would most benefit the economic bottom line? To these Hong Kongers, says Chan, the “core values” — including freedom of speech — would be a secondary concern.\n\nI ask her to play psychologist, if she could — a Hong Kong–wide psychologist, gauging the city’s mood. (I almost say “national mood,” as the phrase comes readily to one’s lips.) With a laugh, she says she will attempt a diagnosis. Then she turns dead-serious, of course. “The people are very tense — under stress — as they have been for several months, and that includes the government, as well as ordinary citizens. Dramatic things are happening each and every week, and no one knows how it will end.”\n\nWill it end in “a very drastic way”? That’s what Chan wonders, and what many wonder. And it is not hard to imagine what she means by “very drastic way.”\n\nThirty years ago, the CCP committed the Tiananmen Square massacre in Beijing. “Hong Kong people don’t want our democratic movement to end like June 4th,” Chan says. (This was the date of the massacre in 1989.) “We, of course, hope that the Chinese government — thanks to attention from the international community — will not send the People’s Liberation Army into Hong Kong to clear up this mess for the Hong Kong government. This is what the older generation, like me, is trying to avoid.”\n\n(We have a bit of a laugh over “older generation”: Chan is not yet 50, and plenty youthful. And yet, the Hong Kong movement is stocked with twentysomethings.)\n\nVery interested in events in Hong Kong are the people in Taiwan. “We’re like sisters,” Chan observes. Hong Kong was supposed to be a model for Taiwan. The Hong Kong example was supposed to reassure Taiwanese about life within China, as Chan points out. See how “one country, two systems” can work? Come on in, Taiwan, the water’s fine. Needless to say, the water has not turned out to be fine.\n\nToward the end of our conversation, I ask Tanya Chan what she, and other democrats in Hong Kong, would like from the outside world, especially the United States. Beijing huffs that others must keep out of China’s “internal affairs,” and not a few in the West agree with them. Chan says, “At least put pressure on the Chinese government to keep their promises” — the promises they made at the time of the handover. “I think that’s fair and legitimate.”\n\nMoreover, if China is to sit on the U.N. Human Rights Council, shouldn’t they respect human rights, and abide by the international covenants they have signed, concerning human rights? Again: fair and legitimate.\n\nThere are many, many other things to say, but we have time for one more word. What will it be? Tanya Chan says this: “Hong Kong is a lovely place and is my homeland” — interesting word in the context of Hong Kong: homeland — “but, unfortunately, because of developments in recent years, some of my friends are moving away. I hope that people who support freedom, democracy, and human rights will pay more attention to what is happening in Hong Kong and support us.”", "description": "Let's focus on one person protesting for democratic rights in the streets of Hong Kong -- Tanya Chan, a member of Hong Kong’s Legislative Council and a democracy leader.", "authors": ["Jay Nordlinger", "Matthew Continetti", "Ramesh Ponnuru", "Rich Lowry", "Ben Shapiro", "Dan Mclaughlin", "Kevin D. Williamson", "Mairead Mcardle", "Jim Geraghty", "Tobias Hoonhout"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/tanya-chan.jpg?fit=1200%2C701&ssl=1", "published_at": "2019-10-28"}