{"pub": "townhall", "url": "https://townhall.com/tipsheet/katiepavlich/2019/09/18/president-trump-orders-new-sanctions-on-iran-pompeo-heads-to-saudi-n2553294", "downloaded_at": "2019-09-18 23:20:32.283426+00:00", "title": "President Trump Orders New Sanctions on Iran, Pompeo Heads to Saudi", "language": "en", "text": "President Trump announced Wednesday morning he has ordered additional sanctions on Iran after the regime reportedly bombed a major Saudi Arabian oil field with a drone over the weekend.\n\nI have just instructed the Secretary of the Treasury to substantially increase Sanctions on the country of Iran! — Donald J. Trump (@realDonaldTrump) September 18, 2019\n\nThis comes on the heels of President Trump warning Iran that further escalation from the Islamic regime will lead to consequences and that the United States is \"locked and loaded.\"\n\nSaudi Arabia oil supply was attacked. There is reason to believe that we know the culprit, are locked and loaded depending on verification, but are waiting to hear from the Kingdom as to who they believe was the cause of this attack, and under what terms we would proceed! — Donald J. Trump (@realDonaldTrump) September 15, 2019\n\nThe President also announced the opening of U.S. oil reserves to stabilize the global market.\n\n....sufficient to keep the markets well-supplied. I have also informed all appropriate agencies to expedite approvals of the oil pipelines currently in the permitting process in Texas and various other States. — Donald J. Trump (@realDonaldTrump) September 15, 2019\n\nMeanwhile, Secretary of State Mike Pompeo left Washington D.C. for Saudi Arabia yesterday, where he will meet with Saudi Crown Prince Mohammed bin Salman about the way forward with Iran and other security issues. He will then travel to Abu Dhabi to meet with UAE Prince Mohammed bin Zayed, where security in the region is also on the agenda. He will return by the end of the week.", "description": ".09/18/2019 19:18:36PM EST.", "authors": ["Katie Pavlich", "Matt Vespa", "Guy Benson", "Cortney O'Brien"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/56/f60ed0df-6cb2-4ad0-8b26-522165e39dd5.png", "published_at": "2019-09-18"}