{"pub": "news24", "url": "https://sport24.co.za/Golf/EuropeanTour/stone-rolls-into-portugal-masters-lead-20191026", "downloaded_at": "2019-10-27 00:28:19.829410+00:00", "title": "Stone rolls into Portugal Masters lead", "language": "en", "text": "Cape Town - Brandon Stone will go in search of his first European Tour victory since last year's Scottish Open when he takes a two-stroke lead into the final round of the Portugal Masters.\n\nThe South African, who won his first Rolex Series title at Gullane in 2018, carded his third consecutive round of 66 at Dom Pedro Victoria Golf Course to set a target of 15-under par, two strokes ahead of compatriot Dean Burmester and England's Oliver Fisher.\n\n\"I hit the ball incredibly well today. I think I hit 18 greens again today, which is fantastic. The irons were in tip-top shape. It was really tricky. The pins were tucked and I was fortunate to hole some putts on the back nine and put together a nice score,\" said Stone.\n\n\"I've been working with my coach and we've been doing some hard work. He's got me swinging as good as I have and as quick and as far as I should be. I was putting too much emphasis on hitting the driver straight, when I have an ability to have a clubhead speed in excess of 120mph and dominate golf courses. I feel comfortable with my swing.\"\n\nBurmester started the third round five strokes behind 36-hole leader Fisher but carded the joint-low round of the day, a six under par 65, to move into second. Fisher carded the European Tour's first round of 59 en route to a seventh-place finish at this event last year.\n\nSteven Brown matched Burmester's six under par total to take fourth place after 54 holes. The Englishman needs to win or finish in a share of second place to secure his playing rights for the 2020 season. As it stands, the top 116 on the Race to Dubai Rankings Presented by Rolex will earn their cards for next year.\n\nAdding to the South African contingent at the top of the leaderboard are George Coetzee, Hayden Porteous and Justin Walters, who share fifth place with South Korea's Jeunghun Wang on 11 under par. Defending champion Tom Lewis shares ninth place with four others on ten under par.\n\nLeading third round scores in the Portugal Masters at the Dom Pedro Victoria Golf Course, Portugal on Saturday (GBR/IRL unless stated, par 71 ):\n\n198 - Brandon Stone (RSA) 66 66 66\n\n200 - Dean Burmester (RSA) 70 65 65, Oliver Fisher 65 65 70\n\n201 - Steven Brown 69 67 65\n\n202 - Jeunghun Wang (KOR) 66 65 71, Haydn Porteous (RSA) 68 65 69, Justin Walters (RSA) 65 66 71, George Coetzee (RSA) 69 65 68\n\n203 - Adrien Saddier (FRA) 67 68 68, Matt Wallace 67 70 66, Eddie Pepperell 67 66 70, Tom Lewis 69 66 68, Renato Paratore (ITA) 66 70 67\n\n204 - Darren Fichardt (RSA) 66 67 71, Pablo Larrazabal (ESP) 70 66 68\n\n205 - Louis De Jager (RSA) 63 72 70\n\n206 - Hugo Leon (CHI) 69 69 68, Kalle Samooja (FIN) 68 70 68, Jack Singh Brar 67 68 71, Joakim Lagergren (SWE) 69 71 66, Chris Paisley 69 69 68, Tomas Santos Silva (POR) 72 68 66, Kristian Krogh Johannessen (NOR) 70 69 67, Shubhankar Sharma (IND) 67 71 68, Tapio Pulkkanen (FIN) 68 69 69, Andy Sullivan 68 72 66, Bradley Dredge 71 68 67\n\n- European Tour", "description": "Brandon Stone will go in search of his first European Tour victory since last year when he takes lead into the final round of the Portugal Masters.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9524/ad1cc0b9f4ea4af5a6e8397d32cc2366.png", "published_at": "2019-10-26"}