{"pub": "cbs", "url": "https://cbsnews.com/news/emmett-till-death-federal-government-closes-6-cold-cases-as-emmett-till-investigation-continues", "downloaded_at": "2019-09-25 04:40:19.601139+00:00", "title": "Federal government closes 6 civil rights cold cases as Emmett Till investigation continues", "language": "en", "text": "The federal government is still investigating the brutal slaying of black teenager Emmett Till, whose death in 1955 helped spur the civil rights movement. A Justice Department report issued to Congress about civil rights cold case investigations lists Till's killing as being among the unit's active cases.\n\nThe inquiry was reopened two years after a book indicated a key witness had lied. \"The Blood of Emmett Till,\" by Timothy B. Tyson, quotes a white woman, Carolyn Donham, as acknowledging during a 2008 interview that she wasn't truthful when she testified that Till grabbed her, whistled and made sexual advances at a store in 1955.\n\n\"She said with respect to the physical assault on her, or anything menacing or sexual, that that part isn't true,\" Tyson told \"CBS This Morning\" in 2017.\n\nHistorian on Emmett Till's accuser recanting story\n\nTwo white men — Donham's then-husband Roy Bryant and his half-brother J.W. Milam — were charged with murder but acquitted in the slaying of Till, who had been staying with relatives in northern Mississippi at the time. The men later confessed to the crime in a magazine interview, but weren't retried. Both are now dead.\n\nRelatives of Till say they're encouraged that the case remains open but they're eager for a resolution, according to a Justice Department report.\n\nThe department has closed its review of six other slayings dating from 1940 through 1973 without filing any charges.\n\nCold case investigators were ending reviews of the deaths of Elbert Williams in Brownsville, Tennessee, in 1940; Dan Carter Sanders in Johnston Township, North Carolina, in 1946; Peter Francis in Perry, Maine, in 1965; Lee Culbreath in Portland, Arkansas, in 1965; John Thomas Jr. in West Point, Mississippi, in 1970; and Milton Lee Scott in 1973 in Baton Rouge, Louisiana, in 1973. All the victims were black except Culbreath, who was a member of the Passamaquoddy Indian tribe.\n\nThe report said federal agents fatally shot Scott during an attempted arrest and there was no new evidence to support bringing charges.", "description": "Relatives of Till say they're encouraged that the case remains open but they're eager for a resolution", "authors": [], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/09/24/4492952a-2a74-41e7-8b19-757889f0e1a7/thumbnail/1200x630/ec1406f68cb5cac80743afe15f63b03f/ap-17028747176406.jpg", "published_at": "2019-09-24"}