{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/22/trumps-next-dhs-chief-tasked-with-completing-400-miles-of-border-wall-before-2020-election", "downloaded_at": "2019-10-23 08:34:34.842245+00:00", "title": "Trump's Next DHS Chief Tasked with Completing 400 Miles of Border Wall", "language": "en", "text": "President Trump’s next Department of Homeland Security (DHS) Secretary will be tasked with completing more than 400 miles of border wall before the 2020 presidential election to fulfill the administration’s most crucial promise to voters.\n\nThis month, Trump announced he would replace Acting DHS Secretary Kevin McAleenan after the former Customs and Border Protection (CBP) Commissioner gave an interview to the Washington Post where he slammed the president’s “Zero Tolerance” policy at the border and decried the term “illegal alien” as having “racial overtones.”\n\nThus far, the Trump administration has built between 70 and 74 miles of border wall at the United States-Mexico border, with the process moving exceptionally slowly throughout 2017 and 2018 as then-DHS Secretary Kirstjen Nielsen repeatedly failed to secure funding for the project.\n\nLeft after McAleenan’s tenure will be an enormous undertaking of completing more than 400 miles of border wall construction at the southern border before the 2020 election.\n\nFor years, DHS officials have been reluctant to release details on the number of miles of border wall constructed. In the last six months, though, DHS officials have routinely promised voters and Trump that they will have 500 miles of border wall fully constructed before the 2020 election — indicating that the project will need to move at a record pace to be completed in time.\n\nAt this rate, the next DHS chief chosen by Trump must oversee at least 36 miles of completed border wall construction every month from now until November 2020. A failure to do so will break with the president’s promise to voters heading into election day.\n\nThough conservatives are backing Acting United States Citizenship and Immigration Services (USCIS) Director Ken Cuccinelli for the job, rumors have circulated that Nielsen’s close ally Chad Wolf is in the running for DHS Secretary.\n\nWolf’s background dates back to the early 2000s when he worked in former President George W. Bush’s administration, along with Nielsen. From there, Wolf eventually went to work as a lobbyist, representing NASSCOM, a leader in the outsourcing industry that seeks no restrictions on the H-1B visa program, so employers would be allowed to routinely replace their American workforces with imported foreign workers.\n\nBehind the scenes, supporters of the president are looking to a variety of alternatives to Wolf, including DHS official Michael Dougherty, former USCIS Director Lee Francis Cissna, USCIS official John Zadrozny, former ICE Director Thomas Homan, Acting Customs and Border Protection (CBP) Commissioner Mark Morgan, and former DHS official Katie Gorka.\n\nJohn Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.", "description": "President Trump's next DHS Secretary will be tasked with completing more than 400 miles of border wall before the 2020 presidential election.", "authors": ["John Binder"], "top_image": "https://media.breitbart.com/media/2019/09/wi/ap/18/b6ca4b_trump-22443-donald-trump-president-donald-trump-talks-reporters-as-he-tours-640x335.jpg", "published_at": "2019-10-22"}