{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7621591/Driver-24-admits-killing-10-year-old-schoolgirl-Melissa-Tate.html", "downloaded_at": "2019-10-28 13:38:15.368358+00:00", "title": "Driver, 24, admits killing 10-year-old schoolgirl Melissa Tate", "language": "en", "text": "A 24-year-old unlicensed driver pleaded guilty today to causing the death of a 'smart and funny' ten-year-old girl in a hit-and-run.\n\nMelissa Tate suffered fatal injuries after being hit by a Renault car in the Kenton area of Newcastle-upon-Tyne on the evening of September 25.\n\nConnor Marsden, of Kenton, pleaded guilty at Newcastle Crown Court today to causing Melissa's death by dangerous driving and a charge of failure to stop.\n\nConnor Marsden (left), 24, caused the death by dangerous driving of Melissa Tate (right), 10\n\nMarsden, wearing a white sweater and appearing via video-link, also admitted causing death by driving while uninsured and while unlicensed.\n\nHe gave no reaction as he entered the plea over causing her death, and will be sentenced on December 12.\n\nIn a statement after her death in hospital, Melissa's parents, Michael Tate and Kimberley Wilson, said the girl had saved the lives of sick children after the family decided to donate her organs.\n\nMr Tate said: 'Melissa was a beautiful, smart, funny, cheeky and laid-back girl who had a heart of gold and not a bad bone in her body.\n\n'She could brighten up anyone's day and all she ever wanted to do is help people. Even after passing she still went on to help others by donating her organs.'\n\nMarsden was told he will have to appear in court in person when he is sentenced.\n\nPolice cordoned off Hillsview Avenue in Kenton, Newcastle, after the collision in September\n\nJudge Robert Adams told him: 'You have pleaded guilty to these matters. For these pleas you will get credit at the time of sentence.\n\n'Mr Marsden, you will be produced at court for the sentencing hearing on the 12th of December. In the meantime, you are remanded in custody.\n\n'You must understand that these are serious matters you have admitted, and it's inevitable there will be a substantial custodial sentence.'\n\nMark Guiliani, prosecuting, said Marsden was estimated to have been travelling at around 47mph on the 20mph road, but his defence team argue that his speed was actually lower.\n\nMelissa was rushed to the Royal Victoria Infirmary in the city and died the following day but has since saved the lives of four other children through organ donation.\n\nJudge Robert Adams remanded Marsden in custody until the next hearing, where Ms Wilson is expected to read an impact statement about the loss of her girl.\n\nFlowers, cards and gifts left at the scene of the hit-and-run on the evening of September 25\n\nMelissa, known as Missy to her loved ones, had sat her entire family down few years before her death and said she wished to donate her organs.\n\nHer family honoured her wishes after the tragedy and four other young lives were saved as a result.\n\nIn her parents' statement, Mr Tate added: 'Melissa was a beautiful, smart, funny, cheeky and laid-back girl who had a heart of gold and not a bad bone in her body.\n\n'She could brighten up anyone's day and all she ever wanted to do is help people. Even after passing she still went on to help others by donating her organs.\n\n'She is a hero and always put others first. I counted on Melissa a lot to get me through some sad and dark times and she was my little rock.\n\n'She loved doing silly dances, fun fighting and making silly noises with me. She was always pulling faces or telling everyone an embarrassing story that always made her laugh.\n\n'She was my little chill buddy. Me, her and Lili all on the bed with YouTube on laughing and joking with snacks. And she loved being creative on Minecraft and playing Fortnite.\n\n'I will never have these moments with Melissa again but I will always have these memories and they can't be taken away from me.\n\n'Melissa I love you to the moon and back. I will always love you. Goodnight, sleep tight, don't let the bed bugs bite. Sweet dreams. I love you.'\n\nMourners who attended Melissa's funeral dressed in blue and many had 'Missy' emblazoned on their clothing.\n\nThere was an emotional scene as a group of schoolchildren blew bubbles as the hearse arrived at the crematorium.\n\nA floral tribute spelling out 'Missy' accompanied her pale blue coffin which was also decorated in white hearts.\n\nThe hearse was followed by cars containing Melissa's family who were tearful as they comforted one another as they entered the crematorium.\n\nThere were so many in attendance that a lot of people had to stand outside to pay their respects.\n\nA fund set up for Melissa's funeral called 'Missy's Forever Fund' raised more than £9,000.", "description": "Melissa Tate suffered fatal injuries after being hit by a car in Newcastle-upon-Tyne on the evening of September 25. Police later charged Connor Marsden with causing her death by dangerous driving.", "authors": ["Mark Duell For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/13/20280020-0-image-a-63_1572268435440.jpg", "published_at": "2019-10-28"}