{"pub": "bbc", "url": "https://bbc.co.uk/news/blogs-trending-49641369", "downloaded_at": "2019-09-12 11:31:25.384591+00:00", "title": "'Red mercury': why does this strange myth persist?", "language": "en", "text": "Image copyright Getty Images\n\nFor centuries rumours have persisted about a powerful and mysterious substance. And these days, adverts and videos offering it for sale can be found online. Why has the story of \"red mercury\" endured?\n\nSome people believe it's a magical healing elixir found buried in the mouths of ancient Egyptian mummies.\n\nOr could it be a powerful nuclear material that might bring about the apocalypse?\n\nVideos on YouTube extol its vampire-like properties. Others claim it can be found in vintage sewing machines or in the nests of bats.\n\nThere's one small problem with these tales - the substance doesn't actually exist. Red mercury is a red herring.\n\nThe hunt for red mercury\n\nDespite this, you can find it being hawked on social media and on numerous websites. Tiny amounts are sometimes priced at thousands of dollars.\n\nMany of the adverts feature a blurry photo of a globule of red liquid on a dinner plate. Next to it there will often be a phone number scribbled on a piece of paper, for anybody foolish enough to want to contact the seller.\n\n\"Serious buyers only,\" reads one advert. \"We need proof of funds to make proof of product.\"\n\nThe impression given is that a mysterious and illicit commodity is on offer.\n\n\"It's a game of con artists and the danger is that people are going to be swindled, that they might be robbed or mugged, or that they'll just waste their time,\" says Lisa Wynn, head of the anthropology department at Macquarie University in Sydney.\n\nProf Wynn first came across the phenomenon when she was working at the pyramids of Giza in Egypt and sharing an office with the leading Egyptologist Dr Zahi Hawass.\n\nOne day Dr Hawass received a visit from a Saudi prince whose mother was in a coma.\n\n\"This man had been spending all of his energies and money trying to find something that would save his mother,\" Prof Wynn recalls.\n\nImage caption The belief that the pyramids contain magical substances is centuries old\n\n\"So he turns to a sheikh in Saudi Arabia, a faith healer, who tells him there's this magical substance that is found buried in the throats of mummies in ancient Egypt. And if you go to Egypt and ask this archaeologist, he will be able to provide you with red mercury.\"\n\nBut when the man arrived in Egypt, the archaeologist set him straight.\n\n\"Dr Hawass says: 'I'm so sorry about your mother, but this is bunk. There is no such thing as red mercury.'\"\n\nAfter witnessing this exchange, an astonished Prof Wynn discovered this was not a new experience for Dr Hawass and his colleagues. They often encountered Arabs who believed red mercury was a magic cure-all buried with the pharaohs.\n\nIt's bats\n\nThe origins of this belief are hazy. Evidence of it can be found in the work of the medieval alchemist and philosopher Jabir ibn Hayyan, who wrote: \"The most precious elixirs to ever have been blended on earth were hidden in the pyramids.\"\n\nIn more recent times, some seeking red mercury have come to believe it can also be found in the nests of bats. Leave aside the inconvenient fact that bats do not actually build nests - this has not prevented fortune hunters from disturbing habitats to look for it.\n\nImage copyright YouTube Image caption A still from a video which claims to show red mercury, like Dracula, has no reflection\n\nSome have taken the bat theory one step further, and claim that red mercury comes from vampire bats. And so, the logic goes, the substance exhibits the same properties as horror movie vampires.\n\nEvidence for this Dracula-in-liquid-form legend is offered in a number of bizarre YouTube videos, some of which have been viewed hundreds of thousands of times. Typically a red blob - that often looks suspiciously like it has been created using video graphics - is shown being repelled by garlic, and attracted by gold. When a mirror is placed beside it, the blob apparently has no reflection.\n\nRed mercury's supposedly amazing qualities don't end there. It is alleged to have powers to summon jinns - Arabic for supernatural beings.\n\nIn 2009 a story spread in Saudi Arabia that red mercury could be procured without breaking into an ancient tomb or sifting through bat guano. Small amounts of the prized substance were rumoured to be found inside vintage Singer sewing machines.\n\nPolice began investigating the hoax after these very ordinary household objects started changing hands for tens of thousands of dollars.\n\nImage copyright Science & Society Picture Library Image caption She wasn't sitting on a hidden fortune in red mercury\n\nRed mercury scare\n\nRumours about the substance have also been given traction by global geopolitics. In the late 1980s, as communist regimes collapsed across Eastern Europe, there was uncertainty as to what was happening to their stockpiles of nuclear material.\n\nAt the time, Mark Hibbs was a journalist investigating alarming rumours that a previously unknown nuclear material, created in Soviet laboratories, was being offered for sale by shady individuals. Its name? Red mercury, of course.\n\nMark, now a senior fellow the Carnegie Endowment for International Peace, a US foreign policy think tank, says that the atmosphere of uncertainty at the time contributed to the whispers.\n\n\"The Soviet Union was a place that over a number of decades secretly accumulated nuclear inventories across a massive territory,\" he says. \"It wasn't clear to us at the time that all those materials - as the Soviet Union began to disintegrate - would remain under lock and key.\"\n\nThis version of the red mercury story was different from the one about the all-healing elixir buried with the pharaohs. Soviet red mercury was said to be destructive, capable of causing a tremendous nuclear explosion with quantities no larger than a baseball.\n\nThe nightmare scenario was that this substance might find its way onto the weapons black market and end up in the hands of terrorists or rogue states.\n\nHowever, Mark Hibbs says that when Western governments investigated, they concluded that the doomsday material didn't exist.\n\nSo how had the rumours started? Mark says Russian scientists told him that red mercury was actually a nickname for a known nuclear isotope. But when he asked the Russian and US governments, neither would confirm nor deny if that story was true.\n\nAnd a rival theory emerged - that the US government had surreptitiously spread red mercury rumours as a way to entrap terrorists. But again, there was no hard proof or official confirmation.\n\nNot quite red-handed\n\nSince then, however, the rumours have featured in several terror cases. In 2015, the New York Times reported that members of the so-called Islamic State group had been arrested in Turkey attempting to buy red mercury.\n\nAnd in Britain in 2004, three men were arrested and charged with terrorist offences, again after allegedly trying to buy the substance.\n\nTheir trial heard how an undercover reporter, Mazher Mahmood, better known as the News of the World's \"fake sheikh\", claimed to be hawking nearly a kilogram of red mercury.\n\nThe prosecutor, Mark Ellison, told the jury: \"The Crown's position is that whether red mercury does or does not exist is irrelevant.\"\n\nProsecutors said the three men were looking for ingredients for a \"dirty bomb\" which could have devastated London. But one of the defendants said he was interested in the liquid to wash discoloured money. All three were acquitted of all charges.\n\nImage copyright Metropolitan Police Image caption Mazher Mahmood, shown here in a police photograph, posed as a red mercury dealer\n\nDespite high-profile cases and debunks, the many fantasies around red mercury have remained stubbornly impervious to reality. And now those YouTube videos and online adverts have spread the hoax to new generations.\n\nYouTube told us that the bizarre videos featuring red globules don't necessarily violate its policies, however it would evaluate on a case-by-case basis whether such videos were suitable for its advertising programme.\n\nFacebook and Twitter said they took a tough stance against fraudulent activity, and they took down the red mercury adverts we pointed out to them.\n\nImage copyright JOEL AREM/SCIENCE PHOTO LIBRARY Image caption Mercury sulphide, although very red, has no magical properties\n\nThe real red mercury\n\nFinally, there is a red-coloured mercury-containing ore which does actually exist. Mercury sulphide, to give it its proper name, is a comparatively mundane substance. It's also known as cinnabar and although it is very useful for decorating pottery, it cures nothing - and could actually be harmful. Not because it's highly explosive, mind you, but rather because plain old mercury is hazardous to human health.\n\nHowever, if you are still tempted to go online to purchase red mercury for a miracle cure, then can we perhaps also interest you in buying some magic beans?\n\nWhat did you think of this story? Email BBC Trending\n\nFollow BBC Trending on Twitter @BBCtrending, and find us on Facebook. All our stories are at bbc.com/trending.", "description": "It's a magical healing substance. Or it could create devastating nuclear bombs. Except that red mercury doesn't actually exist.", "authors": ["Bbc Trending", "In-Depth Reporting On Social Media"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/128E5/production/_108750067_fxkdzh3c.png", "published_at": "2019-09-11"}