{"pub": "yahoo", "url": "https://news.yahoo.com/money-hatred-kurds-drives-turkeys-054157178.html", "downloaded_at": "2019-10-16 03:59:04.374489+00:00", "title": "Money, hatred for the Kurds drives Turkey's Syrian fighters", "language": "en", "text": "FILE - In this Monday Oct. 7, 2019 file photo, Turkish-backed forces from the Free Syrian Army, stand in formation during military maneuvers in preparation for a Turkish incursion targeting Syrian Kurdish fighters, near Azaz town, north Syria. The Turkish trained and funded Syrian forces present themselves as heirs to the uprising against President Bashar Assad. But while they include some Islamist and former rebel factions, a large number are Arab and Turkmen fighters from northern and eastern Syria with an ax to grind against the Kurds and a reputation for violence and looting. (AP Photo, File)\n\nBEIRUT (AP) — The Syrian fighters vowed to kill \"pigs\" and \"infidels,\" paraded their Kurdish captives in front of cameras and, in one graphic video, fired several rounds into a man lying on the side of a highway with his hands bound behind his back.\n\nThey are part of the self-styled Syrian National Army, the shock troops in Turkey's offensive against U.S.-allied Kurdish forces who were abandoned last week after President Donald Trump ordered the withdrawal of American troops from northern Syria.\n\nThe Syrian fighters, trained and funded by Turkey, present themselves as heirs to the uprising against Syrian President Bashar Assad. But while they include some Islamic extremists and past members of some Syrian rebel factions, many are Arab and Turkmen fighters from northern and eastern Syria who have an ax to grind against the Kurds and a reputation for violence and looting.\n\n\"The main problem with these forces is their criminality,\" said Elizabeth Tsurkov, a fellow at the U.S.-based Foreign Policy Research Institute who has interviewed dozens of the fighters and said they appear to be driven by a desire for power and money rather than by any specific ideology.\n\n\"Hatred of Kurds, a sense of Arab chauvinism, complete intolerance for any dissent, and just a desire to make a profit is what's driving most of the abuses,\" she said.\n\nSince Turkey began funding the force in 2016, its fighters have yet to battle Assad's troops.\n\nInstead, they have mostly fought in Turkey's cross-border offensives against the Islamic State group and the Syrian Democratic Forces, a Kurdish-led militia that had partnered with the United States and battled IS extremists with far greater success.\n\nIn the latest offensive, the Turkish-led Syrian forces have pushed deep into northeastern Syria, an ethnically and religiously mixed region, raising fears of ethnic conflict and human rights abuses. Some of the factions allied with Turkey have been accused of banditry, and others include hard-line Islamic militants in their ranks.\n\nTurkey views the Kurdish militia that forms the core of the SDF as a terrorist group because of its links to Kurdish fighters who have waged a decades-long insurgency inside Turkey. After threatening for months to invade northeastern Syria and carve out a \"safe zone\" along the border, Turkey launched an offensive last week after Trump cleared the way for it by moving U.S. troops out of the way.\n\nAs the situation on the ground descends into chaos and Syrian government troops move north to lend support to their former foes, the Kurds, Turkey's Syrian fighters are pouring across the border from Turkey, posting videos in which they threaten Kurdish \"pigs\" and \"atheists.\"\n\nBacked by Turkish airstrikes and artillery, the fighters have provided the bulk of the ground forces and taken the most casualties. At least 16 Syrian fighters have been killed compared to four Turkish soldiers since the operation began last week.\n\nOver the weekend they captured a major highway that runs across northern Syria. The Syrian Observatory for Human Rights, a Britain-based war monitor, said the Turkey-backed fighters shot and killed six civilians along the road, including Hevreen Khalaf, a woman who led a Kurdish political party.\n\nIn a video circulated online, fighters can be seen rushing toward a bullet-ridden armored vehicle, saying they have captured a \"pig.\" A woman's faint voice can be heard from within, saying she is the head of a political party. The video indicates Khalaf was captured alive and later died or was killed.\n\nA U.S. military official, speaking on condition of anonymity to discuss operational details, said \"extremist Turkish proxies\" had advanced along the highway, setting up checkpoints where they posed as Kurdish fighters and killed civilians.\n\nIn a series of tweets, one of the Turkey-backed groups, known as Ahrar al-Sharqiya, posted pictures of two supposed Kurdish fighters it said it had captured. Another video posted online showed the Syrian fighters screaming \"God is greatest!\" as they fired several rounds into a bound prisoner who resembled one of the captured men in the previous video.\n\nA spokesman for Ahrar al-Sharqiya, Al-Harith Rabah, said his force had set up a checkpoint on the highway and fired at those who refused to stop. He said the man killed in the video was a Kurdish fighter in civilian clothes who had fought until he ran out of ammunition. He said the Turkey-backed force is investigating the shooting and had summoned the gunmen for questioning.", "description": "The Syrian fighters, trained and funded by Turkey, present themselves as heirs to the uprising against Syrian President Bashar Assad.  \"The main problem with these forces is their criminality,\" said Elizabeth Tsurkov, a fellow at the U.S.-based Foreign Policy Research Institute who has interviewed", "authors": ["Sarah El Deeb", "Joseph Krauss"], "top_image": "https://s.yimg.com/uu/api/res/1.2/r.ulaAqQpEIbpFfWm_fB1w--~B/aD0zODQwO3c9NTc2MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/2ef26a228b5ac69c625c4a411aeb1ff3", "published_at": "2019-10-15"}