{"pub": "yahoo", "url": "https://news.yahoo.com/hong-kong-protesters-plan-festival-themed-hillside-light-090428902.html", "downloaded_at": "2019-09-13 11:16:39.217380+00:00", "title": "Hong Kong protesters plan festival-themed hillside light show", "language": "en", "text": "Protesters are planning to hold another light show on Lion Rock and other peaks (AFP Photo/Philip FONG)\n\nHong Kong (AFP) - Hong Kong pro-democracy activists are planning to gather on some of the city's hillsides for an eye-catching light show later Friday as the protest movement embraces an annual festival.\n\nFriday evening marks the start of the mid-autumn festival, one of the most important celebrations in the Chinese calendar, and is traditionally a time for thanksgiving, spending time with family and praying for good fortune.\n\nBut as Hong Kong convulses from more than three months of political unrest, activists are planning to use the event as a way to keep their movement buoyant with the city facing another weekend of protests.\n\nOnline message boards used to organise the largely leaderless movement have called on demonstrators to gather on key hills such as the Peak -- one of the city's most popular viewpoints -- and Lion Rock on the other side of the harbour.\n\nAbove the city's skyscrapers, they will shine laser pens, release lanterns with protest slogans and sing \"Glory to Hong Kong\", an anonymously penned protest anthem that has gone viral in the last week with impromptu public singalongs seen across the city.\n\n\"It will be a show of solidarity among people who are united in our five demands, including that of universal suffrage, and a plea for international support,\" said one statement from protesters sent to reporters ahead of the event.\n\nHong Kong has been battered by nearly 100 days of protests, sparked by a now-abandoned plan to allow extraditions to the mainland.\n\nAfter local leaders and Beijing took a hard line, the movement snowballed into wider calls for democracy, police accountability and a halt to eroding freedoms in what is the greatest challenge to Beijing's rule since the 1997 handover.\n\n- Rallies and clashes -\n\nMillions of people have taken part in huge, largely peaceful demonstrations.\n\nBut smaller groups of hardline protesters have fought increasingly violent battles with riot police and vandalised subway stations in scenes that have sent shockwaves through the once-stable financial hub.\n\nThe city is now deeply polarised with fights frequently breaking out between different political camps.\n\nOn Thursday night, five people were wounded when a corrosive liquid was thrown from a tower block at pro-democracy protesters who had gathered in the southern district of Ap Lei Chau.\n\nIn recent days, pro-Beijing supporters have held impromptu gatherings to sing China's national anthem -- a response to similar pro-democracy flashmobs -- with scuffles breaking out.\n\nUnder a deal signed with Britain ahead of the city's 1997 handover to China, Hong Kong is allowed to keep its unique freedoms for 50 years.\n\nBut democracy activists accuse Beijing of reneging on those promises by ramping up political control over the semi-autonomous territory.\n\nCity leader Carrie Lam made the surprise move last week to fully scrap the loathed extradition law -- but the gesture was dismissed by protesters as too little, too late.\n\nOn Friday evening, in one of the protest movement's more surreal moments, small groups of demonstrators gathered on a housing estate where Lam was visiting, shouting \"We want to eat mooncakes\".\n\nResidents told local media Lam had made a brief visit to a nearby elderly home to distribute mooncakes, a dense pastry handed out during the mid-autumn festival.\n\nActivists and analysts say the movement will only end when some of the other key demands are met such as an inquiry into the police, an amnesty for the nearly 1,400 people arrested and universal suffrage.\n\nThere is little sign of Beijing ceding to those demands or the protests abating.\n\nPlans by demonstrators to hold rallies on Saturday and Sunday have been rejected by the police.\n\nBut previous bans have simply been ignored by the masses and clashes with police have quickly followed.\n\nOn Sunday, protesters had planned to march through the city while a separate, smaller demonstration was planned outside the British consulate in a bid to call on London to do more to protect the former colony from Beijing's tightening grip.", "description": "Hong Kong pro-democracy activists are planning to gather on some of the city's hillsides for an eye-catching light show later Friday as the protest movement embraces an annual festival.  Friday evening marks the start of the mid-autumn festival, one of the most important celebrations in the Chinese", "authors": ["Jerome Taylor"], "top_image": "https://s.yimg.com/uu/api/res/1.2/lZYcBybWVgYzJA.a8qDC3A--~B/aD01MTA7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/780914806f277c8a925c0850795e19458c7e0388.jpg", "published_at": "2019-09-13"}