{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/grieving-herolds-bay-dad-rejects-rumours-of-fraud-affairs-and-abuse-report-20191029", "downloaded_at": "2019-10-29 23:56:49.118520+00:00", "title": "Grieving Herolds Bay dad rejects rumours of fraud, affairs and abuse - report", "language": "en", "text": "The Herolds Bay father and husband, who had to identify his wife and son who were found dead in the sea, has spoken out about rumours that are circulating about the family while the search continues for his missing daughter.\n\n\n\n\"We are personally and financially sound and our businesses are doing well. We are in no financial plight. I also did not commit any form of fraud, neither did I have any affairs nor beat my wife and children,\" Ettiene Scheepers told the George Herald.\n\nThis after people on social media raised questions about the tragedy after his family went missing last Tuesday.\n\nSome have questioned whether he had anything to do with it, and wondered why he had not gone to the clifftop while the search and rescue team scoured the area in the hopes of finding his wife and children alive.\n\nScheepers told the publication that his late wife, Heidi, had told him she would not accompany him on a trip to Mozambique the following day with his brother. This was when they had driven to the beach as a family.\n\nHis café was short-handed and a consignment was coming in, so he asked if they could discuss it at home when he got back later, and they parted company.\n\n\"We did not have an argument of any kind,\" Scheepers told the George Herald.\n\nHowever, he returned to find that nobody was home. He called friends and family in the hopes of locating them as Heidi had not taken her phone with her.\n\nHis late wife had suffered from a \"dip\" last year with depression, but was fine after being treated.\n\nScheepers said their little girl, Cozette who is still missing, attended a school for children with special needs.\n\nHe explained that the police had asked him not to go to the search site.\n\nIn response to the comments made about Scheepers, police spokesperson Malcolm Pojie told News24: \"There is no foul play suspected. An inquest has been opened.\"\n\nPojie said the VW Caravelle, which was retrieved from the sea, would also be analysed to determine what might have led to it careening off a 100m cliff.\n\nSince last week, Scheepers has had to identify the bodies of his two-year-old son Hugo and his wife.\n\nPojie said the search was continuing on Tuesday, but the weather and strong sea conditions have hampered it.\n\nThe Little Farm Preschool that Hugo attended had a special memorial service for him on Friday.\n\nCandles and hand-made cards were placed in remembrance, with a message on its Facebook page saying: \"Rest peacefully our dearest Little Hugo! We celebrate your life and the short time we had with you, until we meet again.\n\n\"Father God is holding you now in the palm of His mighty hands, whilst we remain on earth mourning.\n\n\"The school said everybody was heartbroken by the tragedy.\"\n\nNews24 attempted to reach Scheepers on Tuesday, but his phone was off.\n\n- Compiled by Jenni Evans", "description": "The Herolds Bay father and husband, who had to identify his wife and son who were found dead in the sea, has spoken out about rumours that are circulating about the family while the search continues for his missing daughter.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9519/d5c16cee36c841cfbf7fa669acef3d13.jpg", "published_at": "2019-10-29"}