{"pub": "investingcom", "url": "https://investing.com/news/commodities-news/oil-market-gripped-with-uncertainty-over-lost-saudi-production-1979409", "downloaded_at": "2019-09-17 10:45:35.693491+00:00", "title": "Oil Market Gripped With Uncertainty Over Lost Saudi Production", "language": "en", "text": "© Reuters. Oil Market Gripped With Uncertainty Over Lost Saudi Production\n\n(Bloomberg) -- Oil markets are grappling with uncertainty over how long it will take Saudi Arabia to restore output after the devastating attacks that knocked out 5% of global crude supply.\n\nAs state oil producer Saudi Aramco grows less optimistic that there will be a rapid recovery after the strikes that cut the nation’s output by half, investors are looking for clarity on just how bad it could be. Initially, it was said significant volumes could begin to flow again within days but Saudi officials later told a foreign diplomat they face a “severe” disruption measured in weeks and months.\n\n“There’s been a real shift in understanding how quickly that lost production is going to come back online,” Ann Berry, a partner at Cornell Capital LLC, said in an interview on Bloomberg TV. “The original reaction was that 100% would come back very quickly, now the outlook is going to be a lot more conservative than that.”\n\nThe worst ever sudden disruption to global oil supplies continues to reverberate as geopolitical risk premiums jump on concern over instability in the Middle East and a potential retaliation against Iran, which the U.S. has blamed for the strikes. Traders may not have fully priced in the impact of the supply losses, according to Citigroup Inc (NYSE: ).\n\nThe attacks, which damaged one of the Saudis’ flagship fields and a key processing complex, triggered one of the wildest bouts of trading seen in oil markets, with Brent crude futures rising 19% in a matter of seconds at the open on Monday before posting their biggest ever single-day advance. It was a more subdued start to trading on Tuesday, with both Brent and West Texas Intermediate futures edging lower.\n\nState-run producer Saudi Aramco lost about 5.7 million barrels a day of output on Saturday after 10 unmanned aerial vehicles struck the Abqaiq facility and the kingdom’s second-largest oil field in Khurais. Full recovery might not happen before the end of the year, keeping 1 million to 2.5 million barrels a day offline, according to Citigroup. Saudi crude inventories are in “more critical situation” than initially thought, the bank said.\n\nWhile Aramco is still assessing the state of the Abqaiq plant and the scope of repairs, it currently believes less than half of the plant’s capacity can be restored quickly, said people familiar with the matter, who asked not to be identified because the information isn’t public.\n\nSaudi Aramco is firing up idle offshore oil fields -- part of its cushion of spare capacity -- to replace some of the lost production, one person said. Aramco customers are also being supplied using stockpiles, though some buyers are being asked to accept different grades of crude oil. The kingdom has enough domestic inventories to cover about 26 days of exports, according to consultant Rystad Energy A/S.\n\nCustomers are also preparing to tap strategic reserves if needed. President Donald Trump authorized the release of oil from the U.S. Strategic Petroleum Reserve, while the International Energy Agency, which helps coordinate industrialized countries’ emergency fuel stockpiles, said it was monitoring the situation.\n\nThe Japanese government on Tuesday said it was ready to cooperate with the IEA to release reserves if necessary, following a similar statement from South Korea.\n\nThe disruption surpasses the loss of Kuwaiti and Iraqi petroleum output in August 1990, when Saddam Hussein invaded his neighbor. It also exceeds the loss of Iranian oil production in 1979 during the Islamic Revolution, according to the IEA.\n\nThe market was relatively calm on Tuesday after the previous day’s fireworks, when surged by almost $12 a barrel, before settling just above $69 for the biggest one-day percentage gain since the contract began trading in 1988.\n\nfutures lost 73 cents, or 1.1%, to $68.29 a barrel on the ICE (NYSE: ) Futures Europe exchange as of 12:30 p.m. in Singapore, while fell 1.4% to $62.03 on the New York Mercantile Exchange. Brent is trading at $6.50 premium to WTI for the same month.\n\nIf Abqaiq “takes months to come back online we could see Brent move into the $70 to $80 per barrel range,” Vivek Dhar, an analyst at Commonwealth Bank of Australia, said in a note. “A retaliatory attack against Iran could see oil prices spike even higher.”", "description": "Oil Market Gripped With Uncertainty Over Lost Saudi Production", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC1S0YS_L.jpg", "published_at": "2019-09-17"}