{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/all-blacks-savea-having-issues-with-goggles-but-pe", "downloaded_at": "2019-10-08 09:59:38.737151+00:00", "title": "All Blacks' Savea having issues with goggles but persisting", "language": "en", "text": "TOKYO (AP) - The first player to wear goggles in a Rugby World Cup is having issues with them.\n\n“I’ve got to persevere,” New Zealand loose forward Ardie Savea said on Tuesday.\n\nSavea wore the World Rugby-approved goggles for the first time last Wednesday when he made a second-half appearance against Canada in Oita. He wore them for only minutes, though, because the strap broke.\n\nHe didn’t wear them when he started against Namibia on Sunday because in the warmup they fogged up in the humidity.\n\nSavea said he will persist with them because he needs to. The vision in his left eye is failing - his sight is already blurry - and he needs the goggles to protect his right eye to reduce the risk of going totally blind.\n\n“I’ll keep training in them, and if they’re working, they’re working,” he said. “But it’s hard with the conditions. If they’re not working on game day, I’ll park it up, but if they are, sweet.”\n\nWith the lingering humidity and heat in the Japanese autumn, Savea said, “It’s probably the worst time to try them.\n\n“I sweat a lot, and having the sweat come through my eyes was pretty tough.\n\n“Like anything you try that’s new, it takes a bit of time (to get used to). But I’ll continue on giving them a crack, and find a way that I can wear them.”\n\nDuring games, Savea has an arrangement with team doctor Tony Page, who has spare goggles and a lens cleaner. Savea says he will go to Page if needed when there’s breaks in play. But, so far, they haven’t had to coordinate much. New Zealand next plays Italy on Saturday in Toyota in a quarterfinal decider.\n\nThe reaction to Savea wearing goggles has been overwhelmingly positive, from congratulations from the first player to wear them in test rugby, Italy’s Ian McKinley, to memes on social media, to kids wearing them.\n\n“I didn’t think of that when I decided to wear the goggles. Seeing youngsters being inspired to wear them now and try rugby is pretty awesome,” Savea said. “It’s been good to see the hype about it.\n\n“For me, it’s just about getting used to it, just trusting that process, and thinking of the bigger picture and protecting my vision.”\n\nHe said a few of his fellow All Blacks have tried out the goggles.\n\n“They just like how cool it looks,” he said with a grin.\n\n___\n\nMore AP Rugby World Cup: https://www.apnews.com/RugbyWorldCup and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The first player to wear goggles in a Rugby World Cup is having issues with them.", "authors": ["The Washington Times Http", "Foster Niumata"], "top_image": "", "published_at": "2019-10-08"}