{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/16/1930232/0/en/Maxim-Power-Corp-Announces-the-Voting-Results-of-Special-Meeting-of-Shareholders-and-Closing-of-Convertible-Loan.html", "downloaded_at": "2019-10-16 01:14:37.656606+00:00", "title": "Maxim Power Corp. Announces the Voting Results of Special Meeting of Shareholders and Closing of Convertible Loan Toronto Stock Exchange:MXG", "language": "en", "text": "CALGARY, Alberta, Oct. 15, 2019 (GLOBE NEWSWIRE) -- Maxim Power Corp. (\"MAXIM\" or the \"Corporation\") is pleased to announce that at a special meeting of shareholders held today, it received the approval of disinterested shareholders for its previously announced $75 million, one-year, 12% per annum, revolving, secured convertible loan (the \"Convertible Loan\") between the Corporation and certain of its subsidiaries, as borrowers, and Alpine Capital Corp. (\"Alpine\") and Prairie Merchant Corporation (\"Prairie Merchant\" and together with Alpine the \"Lenders\") as lenders.\n\n\n\nThe Convertible Loan was approved by approximately 97.67% of the common shares voted at today's meeting, after excluding the votes required to be excluded in determining shareholder approval for the Convertible Loan in accordance with the provisions of Multilateral Instrument 61-101 - Protection of Minority Security Holders in Special Transactions and the rules and policies of the Toronto Stock Exchange.\n\nSubsequent to the conclusion of the special meeting, the Corporation and the Lenders closed the Convertible Loan. As a result, the construction loan previously entered into among the Corporation, certain of its subsidiaries and the Lenders has terminated in accordance with its terms, and all borrowings thereunder, totalling approximately $6 million as at the date hereof, have been assumed and are outstanding under the Convertible Loan.\n\nAbout MAXIM\n\nBased in Calgary, Alberta, Maxim Power Corp. (“MAXIM”) is an Alberta focused independent power producer which currently owns and operates a 150 MW power plant near Grande Cache, Alberta. This plant (“M1”) is nearing the end of its life under federal regulations and is being replaced with a state-of-the-art natural gas-fired plant (“M2”) with anticipated nameplate capacity of 204 MW in simple cycle mode. MAXIM has the option in the future to increase the capacity of M2, in conjunction with increasing the overall efficiency of the facility, by upgrading M2 into a combined cycle plant. In addition, MAXIM continues to explore development options for its remaining permitted gas-fired generation capacity in Alberta and permitting of its wind power generation project. MAXIM trades on the TSX under the symbol “MXG”. For more information about MAXIM, visit our website at www.maximpowercorp.com.\n\nFor further information please contact:\n\nMichael R. Mayder, President and CFO (403) 263-3021.", "description": "", "authors": ["Maxim Power Corp"], "top_image": "http://www.globenewswire.com/Attachment/LogoDisplay/557597?filename=557597.png&size=1", "published_at": "2019-10-16"}