{"pub": "guardian", "url": "https://theguardian.com/food/2019/oct/26/vegan-coconut-flatbreads-with-garlic-pepper-mushrooms-meera-sodha-recipe", "downloaded_at": "2019-10-26 11:13:27.466563+00:00", "title": "Meera Sodha's vegan recipe for coconut flatbreads with garlic pepper mushrooms | The New Vegan", "language": "en", "text": "Coconuts have been arriving on our shores for more than 400 years, long before the EU was even a twinkle in the eyes of policymakers. I hope that they will continue to visit us beyond Brexit, not least because, in yoghurt form, their creaminess makes for a super-soft, two-ingredient flatbread that can be thrown together in minutes and will happily play host to any number of toppings. In today’s recipe, that topping is some mushrooms fried with garlic and pepper, which are practically Brexit-proof, if you pick your own.\n\nCoconut yoghurt flatbreads with garlic pepper mushrooms\n\nPrep 15 min\n\nCook 1 hr 10 min\n\nServes 4 as a starter\n\n200g plain flour\n\nSalt\n\n220g coconut yoghurt, plus 3 tbsp extra for serving\n\nRapeseed oil\n\n600g mixed mushrooms, sliced\n\n4 fat garlic cloves, peeled and crushed\n\n1 tbsp dry white wine or sherry\n\n½ tsp black pepper\n\n2 tbsp flat-leaf parsley, roughly chopped\n\nLemon wedges, to serve\n\nIn a large bowl, stir the flour and a quarter-teaspoon of salt, then add the yoghurt and stir until the mixture comes together into a sticky ball. Lightly flour a work surface, tip the dough out of the bowl and knead for a couple of minutes. Separate the dough in four balls and roll each one into 15cm-20cm rounds, coating them with a little flour, if need be.\n\nGet a large, nonstick pan nice and hot over a medium heat, cook each flatbread for three minutes on one side, then turn and cook for another three minutes until you can’t see any doughy spots. Keep warm under foil.\n\nWhen you’ve finished cooking the flatbreads, wipe the pan clean of any flour, then add a tablespoon of oil and put it on a medium heat. Add a third of the mushrooms in one layer, leave to fry for a couple of minutes until bronzed and reduced – this should take about six to eight minutes – then tip on to a plate and repeat with the rest of the mushrooms in two more batches, always making sure you don’t overcrowd the pan.\n\nOnce all the mushrooms are cooked and on the plate, add another two tablespoons of oil to the pan and fry the garlic for a minute until golden and turning sticky, then return all the mushrooms to the pan. Add the sherry, half a teaspoon each of salt and ground black pepper, then stir through the remaining coconut yoghurt. Leave everything to come together for a couple of minutes before stirring through the parsley.\n\nDistribute the mushrooms across the flatbreads, squeeze over a little lemon and serve with extra coconut yoghurt, if you wish.", "description": "A simple flatbread, laced with coconut creaminess and topped with garlicky mushrooms", "authors": ["Meera Sodha"], "top_image": "https://i.guim.co.uk/img/media/5c7dde67a809c3e0edb6fb2374b2319fa1248def/0_1098_4375_2625/master/4375.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=ca63f25e2f7b222260e4f051fb2a4e5a", "published_at": "2019-10-26"}