{"pub": "yahoo", "url": "https://sports.yahoo.com/daniel-levy-determined-keep-250-213000825.html", "downloaded_at": "2019-09-25 23:27:13.381431+00:00", "title": "Daniel Levy determined to keep £250 million Harry Kane if Tottenham's season ends trophyless", "language": "en", "text": "Might Harry Kane be forced to leave Tottenham in search of silverware? - AP\n\nTottenham Hotspur chairman Daniel Levy is prepared to fight any threat of losing Harry Kane at the end of what could prove to be another trophyless season by slapping a huge £250million valuation on the striker.\n\nKane has made it clear that he is now desperate to start winning team silverware, rather than just individual honours, which has prompted fears he could consider his Spurs future.\n\nScroll to continue with content Ad\n\nThat concern was only heightened by Tottenham’s shock elimination from the Carabao Cup to League Two Colchester United, following a stuttering start to the Premier League season.\n\nSpurs can realistically only hope to win the FA Cup or go a step further in the Champions League this season, but Levy remains determined to hang on to Kane - even if the club cannot end their trophy drought.\n\nIt is understood that Levy values Kane at around £250m, which would comfortably make him the world’s most expensive player ahead of Neymar, who joined Paris Saint-Germain for £198m in 2017.\n\nHe would no doubt hope that figure would scare off Real Madrid, Barcelona or Manchester City from trying to sign Kane, who is contracted to Spurs until 2024.\n\nTottenham have endured a rough start to the season Credit: Getty Images\n\nWith Christian Eriksen, Toby Alderweireld and Jan Vertonghen in the final 12 months of their contracts and able to leave Tottenham on free transfers at the end of the season, Levy is prepared to dig his heels in over Kane..\n\nKane was rested for the defeat to Colchester, but will return for Saturday’s Premier League visit of Southampton with manager Mauricio Pochettino targeting nine points from Tottenham’s next three Premier League games.\n\nAnd defender Ben Davies has admitted that the Spurs players owe their fans some big performances, following the Carabao Cup embarrassment.\n\nStory continues\n\nTuesday night’s loss came on the back of a Premier League defeat to Leicester City and Tottenham immediately started their preparations for the visit of Southampton at by returning to training less than 24 hours later.\n\nSpurs entertain Bayern Munich in the Champions League before Pochettino’s team travel to Brighton and then host Watford either side of the international break.\n\nThe run of matches is seen as an opportunity to restore belief and get Tottenham’s season up and running, following a stuttering start.\n\nWhile disappointed by the Colchester defeat, Spurs are not panicking over the team’s form and remain confident that results will soon improve.\n\nThere is also a recognition that, while Tottenham have not won away from home in domestic competitions since January, they have won at Borussia Dortmund and Ajax in the Champions League during that run, and travelled to face Manchester City twice and Liverpool once since beating Fulham at Craven Cottage.\n\nBut left-back Davies admitted the players had let down the fans by losing to Colchester and squandering one of their opportunities to finish this season with a trophy.\n\n“It’s horrible - it’s a trophy, a good chance to pick something up and we’ve let it slip at the first hurdle,” said Davies. “The manager didn’t need to say anything afterwards. In the dressing room, we were all as disappointed as him. We let him down, we let the club down.\n\n“We weren’t terrible. We just didn’t seem to click, didn’t put anything together. We have to win these games. We have to show we’re a better side than this. It’s a tough feeling right now.\n\n\"We just have to apologise to the supporters, too. We let them down. They travel with us everywhere and they’re first-class. We need everyone behind us now to help us push on through this difficult time.”\n\nTottenham returned to training on Wednesday, ahead of this weekend’s Southampton clash, and Davies added: “It’s a huge game for uss. We need to start getting that winning feeling back because it seems a long way away after losing games like that.”\n\nPochettino talked about using the next two transfer windows to fix problems in his squad, following the shock Colchester shock.\n\nTelegraph Sport understands that, particularly in January, his reference to the transfer market related more to trimming a squad that the Argentine feels is already bloated.\n\nEriksen, Alderweireld and Vertonghen are all in charge of their own destinies, while the contracts of Eric Dier and Moussa Sissoko run to 2021. Doubts also remain over the futures of Danny Rose, Victor Wanyama and Serge Aurier, who were all made available in the summer.", "description": "Tottenham Hotspur chairman Daniel Levy is prepared to fight any threat of losing Harry Kane at the end of what could prove to be another trophyless season by slapping a huge £250million valuation on the striker.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/dV.GOi_73nG6jnkZpF7D7A--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04MDA-/https://s.yimg.com/uu/api/res/1.2/T0DPCH5tXZw2b2Tw9z63Rg--~B/aD0xMjUwO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_818/f7bd3aba59c9d6d58ddf3272f18a7480", "published_at": "2019-09-25"}