{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/14/joe-biden-vows-fight-corruption-amid-scrutiny-his-", "downloaded_at": "2019-10-14 23:25:53.917252+00:00", "title": "Joe Biden vows to fight corruption amid scrutiny of his son's business deals", "language": "en", "text": "Former Vice President Joseph R. Biden on Monday announced a plan to combat government corruption if elected president, including creating a new agency to enforce federal ethics laws and eliminating private dollars from political campaigns.\n\nThe plan includes curbing financial conflicts of interest in the executive branch, barring White House influence of Justice Department investigations and cracking down on lobbying by foreign governments.\n\nHis pivot to an anti-corruption agenda coincides with Mr. Biden facing increased scrutiny of his son Hunter’s sweetheart business deals in foreign countries while he was in the White House.\n\nBut Mr. Biden, a front-runner for the 2020 Democratic presidential nomination, said new anti-corruption measures were designed to repair the damage wrought by President Trump.\n\n“Donald Trump has presided over the most corrupt administration in modern history. Trump has abused the presidency to enrich himself — spending countless tax dollars at his own properties,” the Biden campaign said when announcing the proposals.\n\nMr. Biden’s new plan also answers the strong anti-corruption agenda of Sen. Elizabeth Warren of Massachusetts, who has emerged as a chief rival for the nomination and is expected to benefit from allegations of nepotism and possible corruption involving Hunter Biden.\n\nThe anti-corruption plan was one in a series of moves by the Biden campaign to tamp down questions about nepotism the Democratic presidential primary debate Tuesday in Ohio.\n\nHunter Biden announced over the weekend that he would step down from the board of a Chinese-backed firm. He also agreed to an interview Tuesday with ABC News to address questions about his overseas business deals while his father was vice president.\n\nHunter Biden sealed the more than $1 billion deal with a Chinese-backed firm after flying to China with his father aboard Air Force Two.\n\nAnother foreign deal — Hunter Biden’s $600,000 a year job on the board of a Ukraine gas company — is at the heart of House Democrat’s impeachment inquiry targeting Mr. Trump.\n\nMr. Trump in July requested the Ukraine president to investigate the Bidens, prompting a whistleblower complaint that he was abusing his Oval Office power to dig up dirt on a political foe. The whistleblower complaint spurred the impeachment inquiry.\n\nMr. Trump said he made a legitimate request for a corruption probe.\n\nMr. Biden has insisted that he did nothing wrong.\n\nA major component of Mr. Biden’s plan is the elimination of private dollars from federal elections by overturning the Supreme Courts’ ruling in the Citizens United case that freed up spending by unions and corporations on political campaigns.\n\nMr. Biden promises a constitutional amendment that would reverse Citizens United and do more to get corporate money out of elections.\n\nWhile we work toward a constitutional amendment, he would also push legislation to provide public matching funds for small-dollar donations to all federal candidates.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Former Vice President Joseph R. Biden on Monday announced a plan to combat government corruption if elected president, including creating a new agency to enforce federal ethics laws and eliminating private dollars from political campaigns.", "authors": ["The Washington Times Http", "S.A. Miller"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/10/Election_2020_LGBTQ_91415.jpg-c4b86_c0-0-2000-1166_s1200x700.jpg?10a57a34575c6b259c990fae314f4f7b2a5156f5", "published_at": "2019-10-14"}