{"pub": "breitbart", "url": "https://breitbart.com/news/papua-new-guinea-pm-to-get-bentley-from-apec-summit-3", "downloaded_at": "2019-10-28 02:45:11.632911+00:00", "title": "Papua New Guinea PM to get Bentley from APEC summit", "language": "en", "text": "Port Moresby (AFP) – Papua New Guinea’s prime minister will get a Bentley and MPs will receive a host of other luxury vehicles paid for by taxpayers for an Asia-Pacific summit, officials have said.\n\nJames Marape, who has vowed to clean up Papua New Guinea politics since taking office in May, will receive one of the dozens of high-end cars bought to ferry delegates around Port Moresby for the summit last year.\n\nFinance Secretary Ken Ngangan told the Post Courier newspaper on Thursday that all 111 members of parliament will get vehicles from the APEC fleet for their electoral duties.\n\nAround 300 vehicles bought for APEC “disappeared” after the summit, before police tracked them down.\n\nThe previous government’s purchase of the cars, including 40 Maserati Quattroporte supercars valued at more than $150,000 each, caused outrage in what is one of the Pacific’s poorest nations.\n\nOfficials at the time insisted the luxury cars would be sold in the private sector following the summit to recoup the costs.\n\nBut Ngangan said the new government had decided to keep some of the cars.\n\n“Cabinet made a decision recently to have members of parliament presented with a vehicle each so that they can use here in the capital city, but for their electoral duties,” he said.\n\nOne of three Bentleys purchased will be made available for the office of the prime minister he added.\n\nAn interim government report has estimated hosting the 2018 APEC summit cost Papua New Guinea around US$135 million.", "description": "Port Moresby (AFP) – Papua New Guinea’s prime minister will get a Bentley and MPs will receive a host of other luxury vehicles paid for by", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/27/33d88b_papua-new-guinea-prime-minister-james-marape-has-vowed-tackle-corruption-640x335.jpg", "published_at": "2019-10-27"}