{"pub": "breitbart", "url": "https://breitbart.com/national-security/2019/10/23/watch-aaron-klein-iran-will-try-to-gain-from-u-s-withdrawal-in-syria", "downloaded_at": "2019-10-24 02:29:00.782615+00:00", "title": "Watch – Aaron Klein: Iran Will Try to Gain from U.S. Withdrawal in Syria", "language": "en", "text": "In a segment on Israeli television, Breitbart Jerusalem bureau chief expressed concern Iran could attempt to fill the power vacuum in northeast Syria following the U.S. withdrawal from that territory and a deal between Russia and Turkey to jointly patrol the area.\n\nIn the segment on Israel’s i24News (video above), Klein noted that Turkey has been “credibly accused repeatedly of supporting the Islamic state, of supporting a witches brew of jihadist tied to Al-Qaida.”\n\nHe warned the Turkish-Russia “safe zone” gives Ankara a corridor into Syria stretching from the Iraq-Syria border and that Turkey could attempt to allow the passage of jihadists into northeast Syria to further destabilize the area as a pretext to step up its military campaign. The Turkey-Russia deal already calls for a Kurdish withdrawal from the territories.\n\nIran could also potentially take advantage of the corridor, Klein said.\n\n“This could be very dangerous for America’s war against ISIS and also a lot of concern today about Iran’s position in this area,” he stated.\n\nKlein noted the U.S. could still be engaged in the area to secure oil fields and ensure against an Islamic State resurgence without committing larger troop numbers.\n\n“There are still some things that the United States can do,” stated Klein.\n\n“We still do have some troops in the Kurdish villages near the oil fields. America also has bases in Iraq, but the problem is that now we need Iraqi permission – Iraq and Iran are very close – but Iraqi permission to carry out airstrikes in Syria.”\n\n“And then also potentially America can try to enforce some sort of no-fly zone over this area but that would be a big gray zone as well because does America really want to get into an air match with a fellow NATO country, Turkey? But it is not over a yet and there are still some things that the Trump administration can do.”\n\nOn Wednesday, President Donald Trump lifted sanctions on Turkey and declared his policy concerning Syria a “big success” after Turkey said it would halt attacks on Syrian Kurdish forces.\n\nPresident @realDonaldTrump just announced a major breakthrough toward achieving a better future for Syria and the Middle East. pic.twitter.com/rjykmSmdWw — The White House (@WhiteHouse) October 23, 2019\n\nOn Monday, Trump said a small number of American troops would remain in Syria “to secure the oil” and separately to protect an area in southern Syria at the request of Israel and Jordan.", "description": "In a segment on Israeli television, Breitbart Jerusalem bureau chief expressed concern Iran could attempt to fill the power vacuum in northeast Syria following the U.S. withdrawal from that territory and a deal between Russia and Turkey to jointly patrol the area. | Clips", "authors": ["Breitbart Jerusalem"], "top_image": "https://media.breitbart.com/media/2019/10/Turkish-forces-in-Syria-640x335.jpg", "published_at": "2019-10-23"}