{"pub": "fox", "url": "https://foxnews.com/media/laura-ingraham-calls-on-senate-republicans-to-step-out-or-get-out-says-democrats-will-go-on-a-revenge-tour-if-they-win-2020-elections", "downloaded_at": "2019-10-30 07:54:17.525429+00:00", "title": "Laura Ingraham calls on Senate Republicans to 'step up or get out,' says Democrats will go on a 'revenge tour' if they win 2020 elections", "language": "en", "text": "Laura Ingraham sent a warning to Senate Majority Leader Mitch McConnell Tuesday, calling on him to \"stand up\" to House Democrats and warning him and Senate Republicans that if they do not act against the impeachment inquiry against President Trump that \"the republic\" and \"future presidencies\" are at risk.\n\n\"A Senate majority leader must start using his power to stand up against the Democrats political reign of terror. This is McConnell's moment. He needs to show the American people that the GOP stands united behind the man that they elected to lead this country, run our foreign policy, help advance our economy,\" Ingraham said on \"The Ingraham Angle.\" McConnell needs to make sure that every Republican keeps pressure on [Nancy] Pelosi, [Adam] Schiff and [Chuck] Schumer.\"\n\nDEMOCRATS BEING HYPOCRITICAL IN ATTACKS ON GOP OVER CRITICISM OF LATEST IMPEACHMENT WITNESS, JESSE WATTERS SAYS\n\nIngraham called on McConnell to consider changing the rules regarding an impeachment trial and try to make it as short as possible.\n\n\"But I will say this these times require extraordinary measures. The House Democrats have decided to launch a partisan hit on a sitting president using members of the foreign policy establishment to trigger a bogus process,\" Ingraham said. \"McConnell can and should aggressively push for a blisteringly short impeachment trial.\"\n\nThe host didn't hold back calling on Republican senators to act.\n\n\"Republicans in the Senate need to step up or get out. If Democrats can impeach a president under these facts and a star chamber process and your response is 'were powerless,' then maybe you didn't deserve the majority in the first place,\" Ingraham said.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nIngraham warned that Democrats would hold a \"revenge tour.\"\n\n\"Because if Democrats take Congress, let alone the presidency in 2020, you'll kick off a multi-year revenge tour on red state America. They're going to take more than our money,\" Ingraham said. \"They're gonna take our freedom. They'll brainwash our kids. They'll pack the courts. And then they might even turn off the electricity just for good measure.\"", "description": "Laura Ingraham sent a warning to Senate Majority Leader Mitch McConnell Tuesday, calling on him to \"stand up\" to House Democrats and warning him and Senate Republicans that if they do not act against the impeachment inquiry against President Trump that \"the republic\" and \"future presidencies\" are at risk.", "authors": ["Victor Garcia"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/30/694940094001_6098936845001_6098938036001-vs.jpg", "published_at": "2019-10-30"}