{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/felicity-huffmans-prison-routine-includes-20643688", "downloaded_at": "2019-10-18 01:09:58.272327+00:00", "title": "Felicity Huffman's prison routine includes 5am wake up calls and weekend family visits", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nFelicity Huffman is two day into her 14 day sentence at the Federal Correctional Institution in Dublin, California, after arriving on Tuesday.\n\nThe Desperate Housewives star was sentenced to time behind bars after pleading guilty to one count of conspiracy to commit mail fraud and honest services mail fraud.\n\nThe telly star turned herself in for her part in the recent college admissions scandal.\n\nThe actress, 56, is serving time at the low security correctional institution for female offenders which is reportedly over a hundred miles from her lavish LA home.\n\nAccording to new reports, the FCI Dublin's schedule includes a strict timing plan where inmates are woken up at 5am and have to be back in their housing units by 9pm.\n\n(Image: AFP/Getty Images)\n\n(Image: Getty Images)\n\nPeople.com reported that Felicity will be expected to eat breakfast from 5:30am, lunch from 10:45am, and dinner after 4pm.\n\nElsewhere, the star can listen to music on a 'pre-approved device' or work on a variety of craft projects. A series of sporting activities are also available including basketball, volleyball, softball and tennis.\n\nDuring her time behind bars, Felicity will conform to the strict FCI Dublin's handbook and will wear the typical inmate uniform of matching khaki trousers and a blouse with a brown t-shirt underneath.\n\nA source told ABC News that while Huffman is in the general population, she will share a cell with one to three roommates with a communal toilet.\n\nHer husband William H. Macy and daughters Sophia, 19, and Georgia, 17, will be allowed to visit her during the day at the weekends.\n\n(Image: Getty Images)\n\nAccording to TMZ, the movie star's first meal behind bars was a chicken patty, while Tuesday night's menu boasted pepper steak or lentils with steamed rice.\n\nFelicity's charges stemmed from accusations she paid a $15,000 bribe to boost her daughter’s SAT score to get her into an elite college.\n\nAs well as her two weeks in jail, Huffman also got a $30,000 fine, 250 hours of community service and a year of supervised release.\n\n(Image: CJ GUNTHER/EPA-EFE/REX)\n\nBack in April, the actress confirmed she would be admitting the charges.\n\nShe is among 12 other parents and a coach who pleaded guilty to charges in what has been dubbed Operation Varsity Blues.\n\nProsecutors reportedly recommended she spend up to a year in prison, but the sentence was eventually reduced to just two weeks.", "description": "Desperate Housewives star Felicity Huffman is serving her 14-day sentence at the Federal Correctional Institution in California", "authors": ["Tiffany Wallis", "Image", "Afp Getty Images", "Getty Images", "Cj Gunther Epa-Efe Rex"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20643702.ece/ALTERNATES/s1200/0_FILES-US-ENTERTAINMENT-FILM-TELEVISION-UNIVERSITY-CORRUPTION-edu.jpg", "published_at": "2019-10-17"}