{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/typhoon-hagibis-one-championship-century-greatest-martial-arts-event-in-last-100-years", "downloaded_at": "2019-10-10 18:26:15.983951+00:00", "title": "ONE Championship won't let typhoon hinder 'greatest martial arts event in the last 100 years'", "language": "en", "text": "ONE Championship officials are feeling pretty confident heading into this weekend’s massive “Century” event.\n\nNever one to shy away from a bold claim, ONE CEO Chatri Sityodtong today said he’s estimating 70 million viewers worldwide will tune in for this weekend’s “ONE Championship 100: Century” event, which features two full cards from Tokyo’s Ryogoku Kokugikan that air on TNT and stream on B/R Live late Saturday night and early Sunday morning in the U.S.\n\n“This is a historic moment, not only for Japan, but for the entire world of martial arts,” Sityodtong said at a kick-off press conference today in Japan. “I named this event, ‘ONE: Century’ to signify the greatest martial arts event in the last 100 years. Twenty-eight World Champions from across various martial arts, seven world title bouts, two full-scale events – it has never been done before in history. It gives me great pleasure to be with you here today.\n\n“Our current estimate is that we will have 70 million viewers for ‘ONE: Century,’ making it the largest martial arts event in history. My fellow brothers and sisters are here, the greatest martial artists on the planet, but above all, truly amazing human beings. The world will witness greatness. Most importantly, the world will witness the unleashing of real life superheroes who ignite the world with hope, strength, dreams, and inspiration. Let us all embrace the true spirit, the warrior spirit of martial arts. Let’s show the world the power of martial arts.”\n\nWhile the cards are certainly loaded with the organization’s top talent, ONE Championship’s massive event is facing some unforeseen challenges in the form of Typhoon Hagibis, which is currently bearing down on Japan and is expected to make landfall on Saturday and has already seen the cancellation of games in the 2019 Rugby World Cup, which is currently underway on the island nation.\n\nONE Championship officials issued a statement ensuring that a “robust contingency plan” is in place should a change in plans prove necessary.\n\n“The latest information on Typhoon Hagibis is that it is tracking in a north-westerly direction and could potentially bring heavy rain and strong winds to southern Japan on October 12 and 13,” the statement reads. “Currently, it is too early to assess the exact trajectory of the storm and the impact it will have. ONE Championship is monitoring the situation closely. The organization ensures the public, staff, and all athletes that safety is of utmost importance, and that there is a robust contingency program in place should our event, ‘ONE: Century,’ be affected.”\n\nThe “ONE Championship: Century” MMA lineup currently includes:\n\nONE Championship 100: Century – Part 1\n\nMAIN CARD (TNT, 11 p.m. ET)\n\nChamp Angela Lee vs. Jing Nan Xiong – for women’s atomweight title\n\nDemetrious Johnson vs. Danny Kingad – flyweight grand prix final\n\nChristian Lee vs. Saygid Guseyn Arslanaliev – lightweight grand prix final\n\nPRELIMINARY CARD (B/R Live, 8 p.m. ET)\n\nDae Hwan Kim vs. Yuya Wakamatsu\n\nYushin Okami vs. Agilan Thani\n\nItsuki Hirata vs. Rika Ishige\n\nLito Adiwang vs. Senzo Ikeda\n\nChang Min Yoon vs. Phoe Thaw\n\nSunoto Peringkat vs. Won Il Kwon\n\nONE Championship 100: Century – Part 2\n\nMAIN CARD (B/R Live, 6:30 a.m. ET)\n\nChamp Aung La N Sang vs. Brandon Vera – for light heavyweight title\n\nChamp Bibiano Fernandes vs. Kevin Belingon – for bantamweight title\n\nArjan Bhullar vs. Mauro Cerilli\n\nShinya Aoki vs. Honorio Banario\n\nPRELIMINARY CARD (B/R Live, 4 a.m. ET)", "description": "ONE Championship officials are feeling pretty confident heading into this weekend's massive \"Century\" event.", "authors": ["John Morgan", "Farah Hannoun", "Mike Bohn", "Nolan King", "Mma Junkie Staff"], "top_image": "https://usatmmajunkie.files.wordpress.com/2019/10/aung-la-n-sang-brandon-vera-one-championship-100.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-10"}