{"pub": "fox", "url": "https://foxnews.com/media/juan-williams-rejects-hunter-biden-narrative-as-distraction-from-trump-ukraine-developments", "downloaded_at": "2019-09-26 01:33:29.604007+00:00", "title": "Juan Williams rejects conservatives' Hunter Biden narrative as distraction from Trump-Ukraine developments", "language": "en", "text": "Juan Williams rejected conservatives' claims that the Trump-Ukraine situation should be an opportunity to probe the Biden family over unsubstantiated allegations involving business dealings rather than look at the president's troubling July phone call with Kiev's new leader.\n\nWilliams responded Tuesday on \"The Five\" to previously aired comments by Karl Rove -- who claimed Democrats walked themselves into a place where the current 2020 Democratic frontrunner, former Vice President Joe Biden, could be \"hurt ... badly.\"\n\n\"The big cloud here to today is 'whataboutism' and an attempt to try to drag Joe Biden and Hunter Biden ... in here so we can distract you from what is going on with the news and President Trump,\" Williams insisted.\n\nBIDEN CAMPAIGN LIKELY COMING TO AN END -- THANKS TO CLINTON-LINKED UKRAINE BOMBSHELL, NUNES SAYS\n\n\"He can be impeached and I do not think the president wanted this,\" Williams added, calling the White House's decision to release the transcript of a phone call between Trump and Ukrainian Presiden Volodymyr Zelensky a \"tremendous mistake.\"\n\nIn addition, Williams pointed to an op-ed from Reps. Mikie Sherrill, D-N.J., Chrissy Houlahan, D-Pa., and five other freshman Dems that expressed joint support for an impeachment inquiry.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nHe said the change showed growing support among the moderate wing of the Democratic Party for the president to be investigated.\n\nEarlier this week, Trump called the Biden father and son \"corrupt\" and slammed media \"double standards\" over what he claimed was the failure of the press to report on allegations of wrongdoing by Hunter Biden related to dealings with Kiev.\n\n“Joe Biden and his son are corrupt, but the fake news doesn’t want to report because they’re Democrats,” Trump said in New York during United Nations meetings. “If a Republican ever did what Joe Biden did, if a Republican ever said what Joe Biden said, they’d be getting the electric chair.”", "description": "Juan Williams rejected conservatives' claims the Trump-Ukraine situation should be an opportunity to probe the Biden family over yet unsubstantiated allegations involving business dealings rather than President Trump's phone call with the new leader in Kiev.", "authors": ["Charles Creitz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Trump-Juan-Biden.jpg", "published_at": "2019-09-25"}