{"pub": "marketwatch", "url": "https://marketwatch.com/story/gold-under-pressure-as-investors-await-us-china-trade-talks-2019-10-07", "downloaded_at": "2019-10-07 20:02:43.015390+00:00", "title": "Gold settles lower as investors weigh potential outcomes for upcoming U.S.-China trade talks", "language": "en", "text": "Gold settled lower Monday to post back-to-back declines, as investors watched developments in Sino-American trade talks.\n\nU.S. and Chinese officials, including Vice Premier Liu He, are expected to resume trade discussions on Oct. 10-11. However, reports over the weekend indicate that Beijing delegates may be aiming to offer a narrower trade resolution than the Trump administration is hoping.\n\n“It is uncertain what will come out of these talks,” said James Hatzigiannis, senior strategist at Long Leaf Trading Group. “We are in a wait-and see approach” for these talks.\n\n“If they come up with a partial deal or anything positive, you will see gold drop and that has caused gold to stay at the $1,500 level, which gold is very familiar and comfortable with,” he said.\n\nAgainst that backdrop, December gold GCZ19, -1.00% on Comex fell $8.50, or 0.6%, to settle at $1,504.40 an ounce. Prices for the most-active contract edged lower on Friday, but registered a weekly rise of 0.4%, according to FactSet data.\n\nDecember silver SIZ19, -0.85% shed 8.5 cents, or 0.5%, to $17.54 an ounce, after booking a nearly 0.2% decline for the week.\n\n“Risk aversion is not keen in the marketplace to start the trading week,” said Jim Wyckoff, senior analyst at Kitco.com, in a daily note. “There are no geopolitical hot spots on the front burner at present, but some are lingering close, including civil unrest in Hong Kong, turbulence in the Middle East, Brexit and the U.S.-China trade war.”\n\nAs for its performance this week, Hatzigiannis expects gold to climb up this week. “China will be back from their holiday and looking at the past six years, when they come back from their ‘golden week’ gold prices typically drive up,” he said.\n\nAlso, “they will be able to digest the poor economic U.S. numbers from last week, and I really do not see China and US agreeing on a deal in this round of negotiations,” said Hatzigiannis. “China is going into the meeting with a very narrow minded scope and I think the most realistic positive outcome would be a very minor partial deal.”\n\nMeanwhile, U.S. benchmark stock indexes turned higher Monday after a powerful rally on Friday, at least partly prompted by the view that the Labor Department’s employment report isn’t weak enough to suggest that an economic recession is in the offing and may even support another rate cut by the Federal Reserve.\n\nThe release of minutes of the Fed’s September meeting will be released Wednesday and may provide hints on the Fed’s next move.\n\nThe U.S. jobs report released Friday was seen giving the rate-setting Federal Open Market Committee cover to proceed with a quarter percentage point interest-rate cut at the end of October, which would ultimately be bullish for gold.\n\nOverall, gold’s performance has been mixed. It has settled higher in four of the past five sessions but the metal ended September with successive losses, including a 2.2% drop that took it sharply below the psychologically important $1,500 level.\n\nSome strategists believe that moves in the precious metal will be driven by news on tariffs and policy updates from global central bankers, which have mostly adopted a regime of easy-money stimulus measures.\n\n“Gold’s bullish trend will likely be supported on fresh stimulus bets from global central banks and optimism that we will not see a broader trade deal this week, just a de-escalation in tariff threats and possibly an extended trade truce,” wrote Edward Moya, senior market analyst at brokerage Oanda, in a daily research note.\n\n“Trade jitters are likely to remain for the foreseeable future and that should help keep gold rising higher,” he wrote.\n\nBack on Comex, December copper HGZ19, +0.47% settled at $2.577 a pound, up 0.6% and January platinum PLF20, -0.29% rose 0.2% to $888.30 an ounce, while December palladium PAZ19, -0.21% added 0.2% to $1,646.30 an ounce.\n\nRead: A sharper downturn in global growth threatens palladium’s record run", "description": "Gold prices settle lower Monday, to post back-to-back declines, as investors watch developments in Sino-American trade talks.", "authors": ["Myra P. Saefong", "Mark Decambre", "Markets Commodities Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HG011_bullio_ZG_20190320074449.jpg", "published_at": "2019-10-07"}