{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7600799/Iron-Age-Celts-drank-Mediterranean-wine-2-700-years-ago.html", "downloaded_at": "2019-10-24 02:41:55.779352+00:00", "title": "Study shows Iron Age Celts drank Mediterranean wine 2,700 years ago", "language": "en", "text": "Traces of wine found on ancient pottery in Germany suggest people of all classes drank Mediterranean wine as much as 2,700 years ago.\n\nResearchers found organic wine residue on 133 ceramics from the ancient Heuneburg hillfort in Germany.\n\nThey found it in both locally-made Celtic vessels, which would have belonged to less well-off people, as well as in classier imported Mediterranean vessels.\n\nAnd the oldest local ceramics were created before the settlement's elite section had even been built, suggesting the average man would have been able to get the wine.\n\nExcavated pottery from the Heuneburg settlement suggests Early Celts from all social classes may have consumed Mediterranean wine in local ceramics (pictured)\n\n'By integrating archaeological and organic residue analyses we are able to shed new light on Early Celtic consumption practices,' the researchers, from the University of Tübingen, said.\n\n'[We can] provide important initial insights into their complex transformation over time.'\n\nThe scientists speculate that wine consumption was only later restricted to members of Heuneburg's elite, around the late sixth century, at which point it was drunk solely from finer imported ancient Greek pottery.\n\nThis was possibly inspired by an increased knowledge and admiration of Mediterranean drinking practices.\n\nCeramic vessels found at ancient Tenea, Greece. This type of Attic pottery was of a more ornate and elaborate style, compared to the Celts' comparatively primitive pots\n\nA high-resolution LiDAR scan shows the ancient Heuneburg site including the citadel, where elite members of the settlement were thought to have lived\n\nWHAT WE KNOW AOUT THE LEGENDARY HEUNEBURG HILLFORT The Early Celtic ‘Heuneburg' settlement is a prehistoric hillfort in the south of Germany, north of the Alps. Heuneburg was an area of early urbanisation during the Early Iron Age (7th-5th centuries BC). The legendary fort was one of the most important and powerful centres of influence in the early Iron Age. It's located around 50 miles downstream from the source of the Danube river.\n\nUsing techniques to analyse chemical residue left on historic remnants, the researchers could determine where the grapes in the wine came from.\n\nThey looked at 126 local Celtic vessels and seven imported Greek ceramics recovered across the Heuneburg hillfort in southern Germany.\n\nHeuneberg was to the north of the Alps, near the River Danube, and is considered to have been one of the most important early Celtic sites in Europe.\n\nResidue on the pottery included compounds usually found in fermented beverages and fruit products, as well as evidence of food – including millet (a grain) and animal fat traces.\n\nOverall, the team found more evidence of alcohol drinks in ceramic remains taken from the elite central plateau than in vessels from the lower town, suggesting that as time went on the gap between rich and poor widened.\n\nHeuneburg’s elite Celtic burials included a rich collection of imported goods for feasting, including ceramic drinking vessels.\n\nThe results gave the researchers future lines for inquiry into Early Celtic sites.\n\nThe research group, which was led by Maxime Rageot, post-doctorate researcher at the Ludwig-Maximilians-Universität München, used GCMS techniques to analyse the ceramics.\n\nGas chromatography mass spectrometry (GCMS) is a process by which complex mixtures of chemicals may be separated, identified and quantified.\n\nThis makes it ideal for the analysis of the hundreds of relatively low molecular weight compounds found in environmental materials.\n\nSamples are usually analysed as organic solutions made up of soils, sediments, tissues and other materials of interest.\n\nIn an earlier study of ceramics at hillfort site of Vix-Mont Lassois in Burgundy, France, the same group said the Early Celts there had imported Mediterranean pottery, olive oil and wine around 2,700 years ago.\n\nThe team published their work in the journal PLOS ONE.", "description": "Early Celts from the prehistoric Heuneburg settlement in Germany appear to have drunk Mediterranean wine regardless of their social status, suggesting it was readily available.", "authors": ["Mailonline Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/08/20042882-0-image-a-2_1571816968461.jpg", "published_at": "2019-10-23"}