{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/housebound-woman-too-ill-speak-20464949", "downloaded_at": "2019-10-05 10:28:59.226069+00:00", "title": "Housebound woman 'too ill to speak' told she is fit to work by DWP", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA woman who is so sick she struggles to speak has been deemed fit for work by the Department of Work and Pensions.\n\nDebra Barrass, 47, has advanced emphysema and chronic obstructive pulmonary disease (COPD), meaning she suffers from shortness of breath.\n\nThe condition is so advanced she is unable to leave the house, can barely talk, and basic tasks leave her breathless.\n\nBut despite the debilitating condition Debra, of Wallsend, was deemed fit to work by the Department for Work and Pensions and had her benefits stopped, she told Chronicle Live .\n\nAfter her diagnosis in 2010, Debra was receiving Employment Support Allowance (ESA) and Personal Independent Payment (PIP) but was asked to attend a mandatory work capability assessment.\n\n(Image: Newcastle Chronicle)\n\n(Image: Newcastle Chronicle)\n\nShe said: \"I struggle from day-to-day, doing absolutely anything.\n\n\"They have said I am fit for work. My COPD is in the advanced stage and the tests they give you - I am not hitting the targets.\n\n\"I'm absolutely exhausted. I struggle to get up the stairs.\n\n\"I struggle to get out of the house often because I struggle so much. I'm really housebound.\"\n\nDebra, who relies on three inhalers each days, says she was receiving £220 per fortnight on ESA and £300 once a month on PIP.\n\nHowever, this week the DWP asked Debra to attend a reassessment and her £300 a month has been restored until the hearing has taken place.\n\n(Image: Newcastle Chronicle)\n\nThe situation has left her suffering from anxiety and depression and she says she's never felt so jaded.\n\n\"When they stopped all my money,\" she said. \"I didn't have a thing. I just want to kill myself. I'm really, really struggling.\"\n\nA DWP spokesperson said: “We’re committed to ensuring that disabled people and those with health conditions get the support they’re entitled to.\n\n“Decisions about entitlement to ESA are made based on all the information provided, including from a GP or medical specialist.\n\n“Following a request from Ms Barrass we are reviewing our decision to find her fit for work. She continues to receive support through Personal Independence Payment.\"", "description": "Debra Barrass, 47, has advanced emphysema and chronic obstructive pulmonary disease but has been told she should get a job", "authors": ["Kali Lindsay", "Image", "Newcastle Chronicle"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20464953.ece/ALTERNATES/s1200/0_DWP-story.jpg", "published_at": "2019-10-05"}