{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/19/WS5daa6c93a310cf3e3557165c.html", "downloaded_at": "2019-10-19 10:56:34.479818+00:00", "title": "Industry creates enormous opportunities for rest of world", "language": "en", "text": "By Zhou Lanxu | China Daily | Updated: 2019-10-19 09:53\n\nA foreign business executive talks with Chinese counterparts on potential collaborations.[Photo by Gao Erqiang/China Daily]\n\nThe growth of China's internet industry has benefited from and contributed to economic globalization, said Li Xiaoqiang, general manager of China Internet Investment Fund Co Ltd.\n\nOn one hand, the world is speeding up the process of technological integration to bolster efficiency and push along an upgrade in the economies, with China having invested more in information technology research for the mutual benefit of the global community, Li said.\n\n\"At the frontiers of 5G, artificial intelligence and supercomputing, new technologies are increasingly being applied collectively regardless of the restriction of national boundaries,\" he said.\n\nOn the other hand, internet companies from different economies have also been investing more in each other.\n\n\"By setting up arms overseas or acquiring and merging with local enterprises, Chinese investment institutions and internet companies have deeply integrated with local economies, aiming for mutual development especially in the fields of sharing economy, financial technology and digital infrastructure,\" Li said.\n\nHe foresees China's internet industry becoming integrated further with the rest of the world in attracting more foreign participation in the country's digitalization in the future.\n\nChina's vast market has a huge number of internet users and diversified internet applications. Coupled with improving technological innovation capacity, it gives the country's internet industry sustainable growth potential and provides tremendous allure to global capital, Li explained.\n\nMeanwhile, investment opportunities in the digitalization of traditional industries abound as China has also a comprehensive industrial system.\n\nGuy Diedrich, global innovation officer for Cisco, a global provider of IT, networking and cybersecurity solutions, said the company is working closely with Chinese partners to accelerate the country's digital transformation.\n\nThe integration of internet development of different economies will help build \"a truly inclusive future where no one is left behind\", he said, adding that the applications of AI, 5G, Wi-Fi 6 and internet of things could help give everyone access to work, education, healthcare, financial services and more.\n\nAs China may gradually set the international trend of data-driven industrial internet in the 5G era, new investment opportunities have emerged for both domestic and global capital, said Tian Suning, founding partner and chairman of China Broadband Capital.\n\nThe private equity company specializing in telecommunications, media and technology investments has set up funds focusing on early-stage investment in this area to seize the \"systemic opportunity\", Tian said.\n\nChina's TMT industries have been a real magnet to global capital over more than a decade, with a lot of internet-based innovations having been supported by dollar-denominated venture capital funds, according to Tian.\n\nForeign investments in TMT industries have mostly clustered in consumer internet changes and technological innovations that had comparable business models in the United States, Tian said.\n\nAs China has gradually taken the lead in consumer internet and mobile internet, domestic internet giants and venture capital funds have also been investing abroad and adopting business models that have proven to be successful in China over the recent years, Tian added.", "description": "The growth of China's internet industry has benefited from and contributed to economic globalization, said Li Xiaoqiang, general manager of China Internet Investment Fund Co Ltd.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/19/5daa6c93a310cf3e97a1fecd.jpeg", "published_at": "2019-10-19"}