{"pub": "investingcom", "url": "https://uk.investing.com/news/stock-market-news/travel-group-thomas-cook-battles-for-survival-with-final-creditor-meeting-1967301", "downloaded_at": "2019-09-22 15:43:36.920354+00:00", "title": "Travel group Thomas Cook battles for survival ahead of Monday deadline", "language": "en", "text": "© Reuters. FILE PHOTO: Illustration photo of a Thomas Cook logo\n\nBy Kate Holton\n\nLONDON (Reuters) - The British government has plans in place to bring home stranded holidaymakers if Thomas Cook (L: ) goes out of business, an event that would likely spark chaotic scenes at resorts and airports around the world.\n\nThe bosses of the world's oldest travel company were still meeting lenders and creditors in London on Sunday to try to thrash out a last-ditch deal to keep the company afloat.\n\nThe company's board will then meet in the early evening to decide the company's fate, with it potentially going into administration in the early hours of Monday.\n\nRunning hotels, resorts, airlines and cruises, Thomas Cook has 600,000 customers on holiday, meaning governments and insurance companies could be forced to step in and bring them home if the company goes out of business.\n\nUnions and the opposition Labour party have urged the government to stump up the cash, but the foreign secretary appeared to dismiss that idea on Sunday.\n\n\"We don't systematically step in with the taxpayers' money when businesses are going under unless there's a good strategic national interest,\" Dominic Raab told the BBC, adding that plans were in place to prevent anyone from being stranded.\n\nThe company, founded in 1841, has been fighting for its survival after its lenders threatened to pull the plug on a rescue deal that has been months in the making.\n\nHurt by high levels of debt, online competition and geopolitical uncertainty, Thomas Cook needs to find another 200 million pounds on top of a 900 million pound package it had already agreed, to see it through the winter months when it needs to pay hotels for their summer services.\n\nAt the meeting on Sunday the company was asking its lenders to restructure or lower their demands. It has also asked credit card companies to release 50 million pounds that they hold as collateral against the company's bookings.\n\nThe company's largest shareholder, China's Fosun (HK: ), was due to take a central role in the restructuring.\n\nA person familiar with the situation told Reuters there was still a possibility they could strike a deal. The person declined to be named due to the sensitivity of the situation.\n\nFINAL HOURS\n\nWere Thomas Cook to fail, it would spark the biggest peacetime repatriation effort in British history.\n\nThe government and the aviation regulator have drawn up a plan to step in and use other airlines to bring Britons home if needed. The person familiar with the situation put the cost of that move at around 600 million pounds.\n\nOn top of the British holidaymakers, some 460,000 customers are also abroad, with many coming from Germany or Scandinavia.\n\nAn official from Germany said under that country's rules, it would fall to insurance companies to help get customers home.\n\nCondor, a German airline owned by Thomas Cook, said in a statement that its parent company was doing everything it could to secure fresh funds. \"Negotiations with all key stakeholders are complex and ongoing. The Condor flights are currently being operated on a regular basis.\"\n\nNews of Thomas Cook's potential demise has sparked alarm not just across the holiday resorts and poolside bars where customers are using social media to get updates, but among its suppliers and future customers who are losing faith.\n\nThat is draining the company of the liquidity it needs to keep operating and ramping up the pressure on one of Britain's oldest and much-loved companies.\n\nSome British holidaymakers were briefly detained in a hotel in Tunisia by staff who wanted to know if they had been paid. The Thomas cook customers have since left and flown home.\n\n\"Hi Annie, I understand your father might be unsettled by all the news surrounding Thomas Cook and our business recently but our flight operations continue to operate as normal,\" the company said in response to one worried customer.\n\nBritish foreign minister Raab sought to reassure holidaymakers that they would not end up stuck overseas.\n\n\"We .... hope that it (Thomas Cook) can continue but in any event, as you would expect, we've got the contingency planning in place to make sure that in any worst-case scenario we can support all those who might otherwise be stranded,\" he said.\n\nAt the board meeting, the company will have to decide whether in the short term it has enough cash to pay its debts, and whether it has a reasonable prospect of paying its liabilities in six to 12 months' time, which is predicated on it securing a deal.\n\nAt the earlier meeting the lenders will have to decide whether they want to continue supporting a company that has 19 million customers a year, spread across 16 countries.\n\nWhile it once pioneered package holidays and mass tourism, in recent years it has struggled to pay the interest on its 1.7 billion pound debt, while navigating events such as a coup in Turkey, a heatwave in Europe and the aggressive summer pricing of low-cost airlines like Ryanair.\n\n($1 = 0.8014 pounds)", "description": "Travel group Thomas Cook battles for survival ahead of Monday deadline", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8L0J6_L.jpg", "published_at": "2019-09-22"}