{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7553211/Terrorism-survivor-event-Extinction-Rebellion-protests-London.html", "downloaded_at": "2019-10-09 07:48:02.978731+00:00", "title": "Terrorism survivor can't get to event because of Extinction Rebellion protests in London", "language": "en", "text": "Dan Biddle, 40, who lost both legs in the 2005 terror atrocity, said he was unable to attend the prestigious Westminster gathering because of blocked roads\n\nA 7/7 bombings survivor has hit out at Extinction Rebellion protesters after he had to pull out of a disability charity event at the House of Lords amid travel chaos last night.\n\nDan Biddle, 40, who lost both legs in the 2005 terror atrocity, said he was unable to attend the prestigious Westminster gathering because of blocked roads.\n\nThe wheelchair user said he was 'furious' about the hold up and didn't think the large-scale disruption was the best way to get an important message across.\n\n'I think it's a disgrace the protesters have impacted this event like this - there doesn't seem to be much respect there,' Mr Biddle, from Abergavenny, Monmouthshire, told The Sun.\n\n'Everyone there has overcome adversity and being recognised for the work they do is a huge honour. Not being able to get there is a sickener.'\n\nAt the time of the attacks on July 7, 2005, Mr Biddle was travelling on the Circle Line during his morning commute when Mohammed Siddique Khan detonated a home-made bomb at Edgware Station.\n\nSiddique Khan and three other British-born Al Qaeda suicide bombers blew up three London Underground trains and a double decker bus, killing 52 people.\n\nActivists lying on Abingdon Street outside the Houses of Parliament during the protests yesterday\n\nMr Biddle, a former projects manager for a construction firm, lost both legs, his left eye, his spleen, the hearing in his left ear, and was not expected to survive after losing 87 pints of blood in subsequent operations, and suffering two heart attacks.\n\nIt came as Transport Secretary Grant Shapps said the Metropolitan Police should be taking ‘more robust action’ against demonstrators who have effectively taken over the streets surrounding Parliament.\n\nSome glued themselves to the Department for Transport building yesterday and to a lorry outside the Home Office in their ‘direct action’ against what they say is the Government’s failure to take climate change seriously.\n\nScotland Yard's attempts to reopen two miles of streets around Parliament failed - hours after warning they would arrest anyone who had not moved to the pedestrianised area of Trafalgar Square around its fountains.\n\nInstead Extinction Rebellion were able to set up a 'village' on the roads under Nelson's Column with its own improvised cycle lane, food stalls, community kitchen and a 'well-being sanctuary' for tired or stressed environmentalists as well as an extraordinary outdoor rave where people spent hours 'dancing their feelings'.\n\nHundreds of tents have also been pitched all along Whitehall, past Downing Street and around Parliament Square as well as a camp in St James Park where residents plan to spend the next fortnight.\n\nOne of the Tube trains shattered by the 2005 attacks in London, which killed 56 people\n\nA group have also placed 800 potted trees outside Parliament as they called on Boris Johnson to plant billions more across the UK.\n\nAnd a new plot to shut down London City Airport for up to three days from 9am on Thursday by occupying the terminal emerged today.\n\nOver 100 members of the group are planning to attend City Airport, claiming that the plan is to do a 'Hong Kong' style occupation of the terminal building, which will involve demonstrators sitting and lying in front of the departure and arrival gates.\n\nReferring the problems experienced by Mr Biddle last night, an Extinction Rebellion spokesman told MailOnline: 'We apologise deeply when people with disabilities are unable to attend functions.\n\n'This should not happen, people with disabilities are also part of the rebellion. They can come and talk to us and we will help them to get through to wherever they need to go.'", "description": "Dan Biddle, 40, who lost both legs in the 2005 terror atrocity, said he was unable to attend the prestigious Westminster gathering because of blocked roads.", "authors": ["Rory Tingle For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/07/19477504-0-image-a-2_1570601030034.jpg", "published_at": "2019-10-09"}