{"pub": "nymag", "url": "https://vulture.com/2019/10/real-housewives-of-orange-county-recap-season-14-episode-10.html", "downloaded_at": "2019-10-09 02:42:33.797135+00:00", "title": "The Real Housewives of Orange County Recap: Save the Date", "language": "en", "text": "The Real Housewives of Orange County Big Os and Broken Toes Season 14 Episode 10 Editor’s Rating 2 stars * * * * * « Previous Next Photo: Bravo\n\nEverything in this episode is very relatable — well, almost everything. Shannon does get her own blood injected into her clitoris and labia, which I can’t relate to on a number of levels, the most predominant of which is that I do not have a vagina. That said, if someone told me that I could have better orgasms after getting a shot in my dick, I would be at that clinic faster than you forget what Rita Ora looks like.\n\nTamra shades Shannon for even having the procedure, joking, “What orgasms are you having right now?” The fact that Shannon doesn’t have a regular sex partner right now is beside the point. The best orgasms you’ll ever have are the ones you have on your own, and I’m sure that Shannon is having herself plenty of those. Yeah, I know that sex can be lots of fun and I have certainly done very foolish things trying to procure it, but, at the end of the day, no one can do me dirty like I can do myself dirty, so shoot that dick up and lend me your Sean Cody password.\n\nWait, we were talking about relatability. Kelly Dodd is utterly relatable this entire episode. First we see her with her longtime friends Lisa and Christine, then we get a few flashback photos of Kelly at ASU, and she looks hotter than a senior citizen passed out on a Phoenix golf course. Damn, I thought Kelly was fine now, but she was even finer then. But it sounds like she was quite a mess back in the day. We all mellow as we get older, so if this is Kelly Dodd mellowed out, just imagine what a tornado of hormone-fueled malfeasance she must have been in high school. It turns out she was so crazy she got arrested for burning her school’s initials into its lawn and then almost got arrested for smacking an old lady with glasses in the face. Both of these are kind of awful but, know what, we all did stupid shit when we were younger and it only makes me love KD more.\n\nShe spends the episode off in Scottsdale visiting her family, so we don’t see much of her with the women. We do get to see her have lunch at a coffee and beer kitchen (two great tastes that absolutely have no business being tasted together) with her very mature and reasonable older brother. She also calls and chats with her younger brother on the phone briefly after two years of not speaking. It’s sweet. We’ve all had bust ups with our family and had to crawl back to their loving embrace. We’ve all been Kelly and Eric, though most of us are lucky enough that none of this needs to go down in Arizona.\n\nThe queen of relatability this episode, however, is Emily. Not only is she exasperated by her husband Shane, an undercooked vegan grilled cheese, she also has to deal with some weight issues. Her arthritis is acting up and she’s in a bit of pain, which keeps her from working out, which makes her gain weight, which makes her arthritis worse. It’s a vicious cycle. She doesn’t want to go to the doctor or weigh herself because if she doesn’t know the particulars of the problem then it’s like there’s nothing wrong at all. She can keep ignoring it and pack away all of those tacos at lunch as Jesus intended.\n\nWhen she goes to CUT Fitness to talk to Tamra and Eddie about it, they make her get on the scale and she gets the wakeup call that so many of us have had before. She’s up to 191 pounds and her body fat is at 34 percent, making her officially obese. I was surprised to hear that because, though Emily is a bigger girl, she always looks pretty damn good. Maybe she just needs to eat some more of Shannon’s healthy meals and fewer of the free samples at Costco.\n\nOr maybe she should just have more lunches with Alexis Bellino, who pops her God-fearing head out of obscurity to dine with Emily at the end of the episode. I sort of love these cameos, it’s like a remembrance of things past, or a check in with a friend who you can’t bring yourself to hang out with anymore because she’s so insufferable. Alexis looks great and has a hot new boyfriend, which is a nice reward after the last one. We also got a reminder of how awful her husband Jim was. Maybe Emily orchestrated this whole thing just to remind us that Shane isn’t the worst husband ever featured on this show.\n\nAlexis gets to hear that Gina and Emily are in the middle of another fight. Emily set Gina up on a date with Shane’s cousin, who Gina apparently met at some sort function or another. At the last minute the cousin cancels because he has a broken toe, which is the male equivalent of having to stay home and wash his hair. Gina and the cousin are texting and he tells her that he has a girlfriend so he probably shouldn’t go out with her at all. He says that Emily and Shane knew this and didn’t care. Now Gina thinks she was set up on a “pity date” and is mad that she took time away from her kids for a “fake date.”\n\nEmily tells Alexis that she didn’t know that he had a girlfriend and it is all a misunderstanding, but Gina won’t answer her phone to hear her explanation. In Gina’s defense, she probably couldn’t find her phone that day. It was hiding under the invisible couch in her living room that she never sits on anyway. This seems more a fight about the show itself than what the date actually represents. It seems that Gina thinks Emily cooked up this whole thing to be on camera and is using her like a prop. If that’s the fight, then what does Emily have to gain by making up a fake date? More camera time? A better storyline? Gina seems to have storylines in spades, so she doesn’t need this date to stay relevant, but maybe she thinks Emily does? I don’t know. This fight seems dumb.\n\nNow I guess we can end with dumb and unrelatable and talk a little bit about Braunwyn and her husband Sean, who put a merino glass coaster on a string and wears it around his neck and calls it jewelry. Braunwyn tells us that whenever they have a new child, and they have seven, that they have a “professional photo shoot” to commemorate the new child in their lives. The littlest is now a year old so they have this guy Joey come over to the house carrying a camera. Ryan is described as “photographer and Sean’s employee.” Sean may be a photographer, but it’s not like he’s a professional. He’s just some dude who was hanging around the office who Sean gave a digital camera. He is probably the official photographer of OC Fashion Week, which, as Tamra points out, doesn’t seem to be a thing. Do they really need a whole week of fashion in the OC? Couldn’t it be more like Alex McCord’s famous Brooklyn Fashion Weekend? OC Fashion Better Part of an Afternoon?\n\nBraunwyn says she likes to do things differently than every other family in the OC who do their photoshoots on the beach in white shirts and khakis. So instead she has everyone in the family dress all in black with bunny ears and whatnot and she puts on her best Morticia Addams black dress. Then they go out to the platform in the backyard, whose use and provenance are mysterious at best. There is a large armchair in the middle and they all gather around it, Braunwyn dancing atop it like it’s the bar at Andele’s. At least white shirts at the beach I understand. But who believes in this phantom furniture out in the backyard? Or maybe that’s the seat reserved for Elijah, that Alexis Bellino and her vengeful god have filled with another unworthy soul.", "description": "Gina and Emily’s fight seems less about a “pity date” and more about the show itself. But most of all it seems dumb. A recap of ‘Big Os and Broken Toes,’ Episode 10 of Season 14 of The Real Housewives of Orange County on Bravo.", "authors": ["Brian Moylan"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/08/recaps/real-housewvies-of-oc.w1200.h630.jpg", "published_at": "2019-10-09"}