{"pub": "wsj", "url": "https://wsj.com/articles/u-s-tells-saudi-arabia-oil-attacks-were-launched-from-iran-11568644126?mod=rsswn", "downloaded_at": "2019-09-16 23:11:30.099589+00:00", "title": "U.S. Tells Saudi Arabia Oil Attacks Were Launched From Iran", "language": "en", "text": "U.S. intelligence indicates Iran was the staging ground for a debilitating attack on Saudi Arabia’s oil industry, people familiar with the discussions said, as Washington and the kingdom weighed how to respond and oil prices soared.\n\nMonday’s assessment, which the U.S. hasn’t shared publicly, came as President Trump said he hoped to avoid a war with Iran and as Saudi Arabia asked United Nations experts to help determine who was responsible for the airstrikes.\n\nSHARE YOUR THOUGHTS What should the next step be for Saudi Arabia and the U.S.? Join the conversation below.\n\nThe attack sent Brent crude, the international benchmark for crude prices, soaring 15% to $69.02 a barrel on Monday, the largest gain recorded in over three decades. Higher fuel prices pose another threat to the world economy amid a U.S.-China trade dispute, although Saudi and U.S. officials said they would ensure that the oil market remains well supplied.\n\nU.S. officials shared with Saudi Arabia the intelligence reports and their assessment that Iran launched more than 20 drones and at least a dozen ballistic missiles at the Saudi oil facilities on Saturday, the people familiar said.\n\nSecretary of State Mike Pompeo has been in touch with leaders in the Middle East to discuss the situation. Photo: Michael Conroy/Associated Press\n\nBut Saudi officials said the U.S. didn’t provide enough proof to conclude that the attack was launched from Iran, indicating the U.S. information wasn’t definitive. U.S. officials said they planned to share more information with the Saudis in the coming days.\n\nUnless the kingdom makes the same determination, the U.S. would have trouble galvanizing regional support for a unified response, Western officials and analysts in the region said.\n\nIn Riyadh, the Saudi military offered its first assessment on Monday, which stopped far short of accusing Iran of orchestrating the strikes.\n\nThe Saudi-led coalition fighting a war in Yemen against Iran-allied Houthi rebels said that the weapons used in the attack were Iranian made and it dismissed claims of responsibility by the Houthis.\n\nIn Washington, Mr. Trump offered a more conciliatory message toward Iran. After a weekend warning that the U.S. was “locked and loaded,” the Republican president said Monday that he wanted to avoid a war with Iran.\n\n“Do I want war?” he said to reporters in the Oval Office. “I don’t want war with anybody.”\n\nDiplomacy, he said, is “never exhausted until the final 12 seconds.”\n\nMr. Trump said Secretary of State Mike Pompeo and other administration officials would soon travel to Saudi Arabia.\n\nAfter weighing the Trump administration information, Saudi Arabia said it was going to invite U.N. experts to investigate and would wait for the results before deciding how to respond. U.S. officials asked members of the U.N. Panel of Experts on Yemen, which investigates the origins of weapons used in the conflict, to fly to Saudi Arabia as soon as possible.\n\nAt the U.N., U.S. Ambassador Kelly Craft told the Security Council that “emerging information indicates that responsibility lies with Iran.” The U.K., a key U.S. ally, didn’t immediately assign blame for the attacks, saying it is assessing what happened and who was responsible.\n\nRelated Video The strikes on Saudi Arabia’s oil infrastructure have led to a production shutdown on a scale the world hasn’t seen for decades. It could have long-lasting consequences for global markets and politics. Photo: Reuters\n\nU.S. and Saudi officials were split over how to respond. Some want to strike Iran militarily, while others worry an attack could trigger a wider regional fight, officials in both countries said.\n\nThe Saturday attack hit the heart of Saudi Arabia’s oil industry with a series of drone and missile strikes that left Riyadh reeling. The country is struggling to repair the damage and limit the fallout to the energy industry.\n\nSaudi Arabia is now considering whether to delay plans by Aramco, Saudi Arabia’s state oil-and-gas company, for an initial public offering, The Wall Street Journal reported Monday, citing people familiar with the matter.\n\nThe developments have already undermined efforts to broker a meeting between Mr. Trump and President Hassan Rouhani of Iran next week at the United Nations General Assembly. Iran said on Monday that its president wouldn’t meet Mr. Trump after the U.S. said it was open to such a meeting.\n\nMr. Rouhani said on Monday that the attack was an act of self-defense by Yemeni Houthi rebels. “Every day, Yemen is being bombed and peaceful civilians are dying,” he said during a trilateral summit with Russian and Turkish counterparts in Ankara. “When security is restored in Yemen, then it will be possible again to produce oil safely in [Saudi Arabia].”\n\nThe latest attacks pose a critical test for the U.S.-Saudi relationship, especially for Mr. Trump and Saudi Crown Prince Mohammed bin Salman, the country’s de facto ruler. They have both shifted their country’s foreign policies toward confrontation with Iran.\n\nMr. Trump met Monday with his national security team to discuss the attacks on Saudi Arabia and escalating tensions in the Middle East, a person familiar with the meetings said.\n\nMr. Trump and his team, which included Secretary of Defense Mark Esper and acting national security adviser Charles Kupperman, discussed possible military action against Iran, but made no decisions, a second person familiar with the discussions said.\n\nOn Monday, Mr. Trump said he is not yet considering military options and that he expects Saudi Arabia to play a central role in any response.\n\n“The fact is the Saudis are going to have a lot of involvement in this, if we decide to do something,” he said.\n\nRobert Malley, president of International Crisis Group and former White House Middle East coordinator under President Obama, said, “Both President Trump and Mohammed bin Salman feel the need to respond but neither wants war. The question is how they achieve the former without provoking the latter.”\n\nThe U.S. has taken the lead in providing security for the Persian Gulf monarchies for decades in part out of a strategy of protecting the world’s oil supply. As a result, observers of the region expect Saudi Arabia might defer any military action to the U.S.\n\n“At the end of the day, conventional military action is a last resort for any state, and it is something that would be done in coordination with regional and international stakeholders,” said Mohamed Alyahya, a Saudi political analyst and editor of the English website of Saudi-owned al-Arabiya television.\n\n“Any reaction whatsoever, or lack thereof, will have significant consequences on the future of the region,” he said.\n\nOn Monday, Mr. Trump tweeted a reminder of Iran’s behavior when it shot down a U.S. drone in June, a strike that led the U.S. to prepare a military strike against Iran. Mr. Trump called off the strike after having second thoughts.\n\n“Remember when Iran shot down a drone, saying knowingly that it was in their ‘airspace’ when, in fact, it was nowhere close,” he wrote. “They stuck strongly to that story knowing that it was a very big lie. Now they say they had nothing to do with the attack on Saudi Arabia. We’ll see?”\n\nThe weekend strikes marked the most significant attack in a simmering conflict pitting the U.S. and its Middle East allies against Iran and its proxies around the region.\n\nMr. Trump imposed crippling sanctions on Iran that have delivered a blow to the country’s economy.\n\nIran’s crude oil production capacity was nearly 4 million barrels a day before the revival of U.S. sanctions, making it a leading oil supplier. The country’s refining capacity now is about half that amount.\n\nIn recent months, the U.S. has accused Iran of carrying out a series of attacks in the region, including blasts that crippled several tankers in the Persian Gulf.\n\nAmid the heightened tensions, the U.S. sent warships, jet fighters, bombers and troops to the Middle East, including more than 500 military personnel and a squadron of fighters to the Prince Sultan Air Base in Saudi Arabia. Much of that buildup remains in place, officials said.\n\nThe prospect of U.S. military action drew divergent reactions from lawmakers. Sen. Lindsey Graham (R., S.C.) called over the weekend for the U.S. to put an attack on Iranian oil refineries “on the table.”\n\nOthers cautioned against military action. Sen. Mitt Romney (R., Utah) warned on Twitter Monday that any “direct engagement by U.S. military in response to Iran’s attacks on Saudi oil infrastructure would be a grave mistake.”\n\nSen. Tim Kaine (D., Va.) was more blunt: “The U.S. should never go to war to protect Saudi oil,” he tweeted on Sunday.\n\nSaturday’s strikes demonstrated how a war with Iran could be devastating for Saudi Arabia, with the lifeblood of the kingdom’s economy vulnerable to attack despite hundreds of billions of dollars spent on its military.\n\nThe attacks have amplified the pressure on the Saudi government to respond. Its air defenses have failed to stop the attacks on Saturday and other incidents involving the Houthis in the months before, despite the kingdom having the world’s third-largest military budget.\n\nAmong other weapons, the kingdom has both American-made Patriot and Hawk missile systems, both of which have failed to stop a series of drone and missile attacks since May. The Saudi government says it has shot down several drones in the past.\n\n—Isabel Coles, Vivian Salama, Lindsay Wise, David Gauthier-Villars and Ian Talley contributed to this article.\n\nWrite to Dion Nissenbaum at dion.nissenbaum@wsj.com, Summer Said at summer.said@wsj.com and Jared Malsin at jared.malsin@wsj.com", "description": "American officials say intelligence indicates that Iran was the staging ground for a debilitating attack on the Saudi Arabia’s oil industry.", "authors": ["Dion Nissenbaum In Beirut", "Summer Said In Dubai", "Jared Malsin In Tunis", "Dion Nissenbaum", "Summer Said", "Jared Malsin", "Dion.Nissenbaum Wsj.Com", "Summer.Said Wsj.Com", "Jared.Malsin Wsj.Com"], "top_image": "https://images.wsj.net/im-107395/social", "published_at": "2019-09-16"}