{"pub": "telegraph", "url": "https://telegraph.co.uk/football/2019/10/23/arsenals-jill-roord-left-holland-get-better-in-womens-super", "downloaded_at": "2019-10-23 17:18:05.845021+00:00", "title": "Arsenal's Jill Roord: 'I left Holland to get better - in the Women's Super League you have a challenge every week'", "language": "en", "text": "There are lots of reasons why Jill Roord is thankful to have joined Arsenal: a spikier domestic league, the chance to have another crack at the Champions League, and the prospect of living and working in a new country after two years at Bayern Munich. But Roord is enjoying another aspect of life in north London. \"It’s just relaxed and really chilled here,\" she observes. \"In Germany we had a lot of rules about everything, using your phone, washing your clothes the right way, putting things in the right washing bag - like, everything!”\n\nThe training-ground atmosphere may be less fraught, but Arsenal have a taxing week ahead, including a meeting with Women's Super League leaders Manchester City on Sunday and a Champions League last 16 second leg against Slavia Prague next Thursday.\n\nThen again, these are precisely the occasions for which Roord was signed just before the Women's World Cup in the summer. Wanting to play in a more competitive domestic competition was a major factor in the 22-year-old Dutch international's decision to quit her first club, FC Twente, and then Bayern. Holland and Germany are not the only leagues to suffer from a significant quality gap - Slavia Prague themselves currently sit on top of the Czech Women's League with a perfect record of eight wins from eight, and an eyewatering goal difference of plus 60 - but England is at least a more level playing field.", "description": "There are lots of reasons why Jill Roord is thankful to have joined Arsenal:", "authors": ["Sophie Penney", "Sam Dean", "Ipek Tugcu"], "top_image": "https://www.telegraph.co.uk/content/dam/football/2019/10/23/IMG-20191021-WA0003-xlarge_trans_NvBQzQNjv4BqCeUb4KqoO7Hiv_XyAWGXnY2SFFK9JJ1Edv4gdGqIAyU.jpg?imwidth=1200", "published_at": "2019-10-23"}