{"pub": "usatoday", "url": "https://usatoday.com/story/news/world/2019/10/07/2019-nobel-prize-medicine-given-kaelin-ratcliffe-semenza/3895986002", "downloaded_at": "2019-10-07 12:08:04.388952+00:00", "title": "Nobel prize in medicine awarded to three scientists for cell research", "language": "en", "text": "CLOSE\n\nNobel Assembly members (L-R) Patrik Ernfors, Anna Wedell and Randall Johnson sit in front of a screen displaying the winners of the 2019 Nobel Prize in Physiology or Medicine (L-R) Gregg Semenza, Peter Ratcliffe and William Kaelin as their names are announced by Thomas Perlmann (R), the Secretary of the Nobel Committee, during a press conference at the Karolinska Institute in Stockholm, Sweden, on Oct. 7. (Photo: JONATHAN NACKSTRAND, AFP via Getty Images)\n\nThe 2019 Nobel Prize for Physiology or Medicine has been awarded to scientists William G. Kaelin, Jr, Peter J. Ratcliffe and Gregg L. Semenza.\n\nThey received the award jointly for their discoveries of “how cells sense and adapt to oxygen availability,” the Nobel Committee announced Monday.\n\nIt is the 110th prize in the category that has been awarded since 1901.\n\nThe Karolinska Institutet said in a statement the trio should share equally the 9 million kronor ($918,000) cash award.\n\nThe discoveries made by the three men “have fundamental importance for physiology and have paved the way for promising new strategies to fight anemia, cancer and many other diseases.”\n\nCLOSE Alfred Nobel amassed a great fortune when he patented dynamite in 1867. Worried about a legacy of destruction, Nobel's will established the Nobel Prizes upon his death. Nobel's will caused a lot of controversy both in Sweden and internationally. USA TODAY\n\nRead or Share this story: https://www.usatoday.com/story/news/world/2019/10/07/2019-nobel-prize-medicine-given-kaelin-ratcliffe-semenza/3895986002/", "description": "The 2019 Nobel Prize for Physiology or Medicine has been awarded to scientists William G. Kaelin, Jr, Peter J. Ratcliffe and Gregg L. Semenza.", "authors": ["Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/07/USAT/15ec7c52-b2ed-47b7-8ef7-a191e44723f0-AFP_AFP_1L72W3.JPG?crop=4775,2686,x0,y226&width=3200&height=1680&fit=bounds", "published_at": "2019-10-07"}