{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/6/gary-hart-stump-michael-bennet-new-hampshire", "downloaded_at": "2019-09-07 02:23:44.519426+00:00", "title": "No 'Monkey Business': Gary Hart to stump with Michael Bennet in New Hampshire", "language": "en", "text": "Sen. Michael Bennet, Colorado Democrat, announced Friday that he has been endorsed by former Colorado Sen. Gary Hart, the onetime Democratic presidential primary contender whose 1988 bid was derailed by a sex scandal.\n\nThe 82-year-old Hart is scheduled to stump Saturday with Mr. Bennet, a long-shot candidate for the party’s 2020 presidential nomination, in New Hampshire, a state won by Mr. Hart in the 1984 Democratic primary.\n\n“A number of years ago, the voters of New Hampshire provided an opportunity for a young Colorado senator to build a strong national candidacy,” Mr. Hart told The Associated Press.\n\n“They have the chance now to do it again,” he said. “Michael Bennet has the intelligence, experience, and judgment to put our nation back on track at home and abroad.”\n\nThe Hart endorsement comes with the Bennet campaign struggling to generate buzz after the candidate failed to make the top 10 lineup for the Sept. 12 primary debate on ABC News.\n\nCertainly Mr. Hart is expected to draw cameras. He was back in the headlines with the November release of “The Front Runner,” starring Hugh Jackman, about the senator’s disastrous 1988 presidential primary campaign, which fell apart amid rumors of extramarital affairs.\n\nIn June 1987, a month after Mr. Hart suspended his campaign, the National Enquirer ran a photo of him sitting on a dock with Donna Rice on his lap. He wore a T-shirt with the logo of the “Monkey Business” yacht.\n\nBoth insisted they were just friends, but the photo effectively torpedoed Mr. Hart’s political career.\n\nMr. Hart later served as U.S. Special Envoy to Northern Ireland under President Barack Obama.\n\nMr. Hart’s 1984 upset victory in New Hampshire positioned him as the main rival to Walter Mondale, who ultimately won the party’s nomination before losing the general election to President Ronald Reagan.\n\n“A lesson from Hart is not to count people out and not to presume how New Hampshire will judge candidates,” said Bennet spokeswoman Shannon Beckham. “They like underdogs, and reward candidates with new ideas who are focused on the next generation.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Sen. Michael Bennet, Colorado Democrat, announced Friday that he has been endorsed by former Colorado Sen. Gary Hart, the onetime Democratic presidential primary contender whose 1988 bid was derailed by a sex scandal.", "authors": ["The Washington Times Http", "Valerie Richardson"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2018/11/15/film_gary_hart_front_runner_05503_c0-159-3000-1908_s1770x1032.jpg?958fbebe4c760ca4ced0ae8b310a8fe1539f9fb5", "published_at": "2019-09-06"}