{"pub": "businessinsider", "url": "https://businessinsider.com/jpmorgan-chase-virtual-internship-finding-talent-2019-9?r=rr", "downloaded_at": "2019-09-21 07:13:57.867285+00:00", "title": "JPMorgan Chase hires 1,000 entry level employees each year in its tech division. It's now using a virtual internship to help pinpoint promising talent to compete against Amazon, Google, and other Sili", "language": "en", "text": "JPMorgan Chase has found a new way to try to compete with Silicon Valley giants for talent to fill 1,000 entry-level software engineer roles each year: a virtual internship.\n\nThe finance titan is spending billions of dollars annually to upgrade its digital operations. To help do that, it has ramped up hiring of software engineers and other tech positions as Wall Street continues to battle Silicon Valley for the best candidates. One key way JPMorgan finds entry-level talent is its internship program.\n\nNow, it's hoping a new online process will help pinpoint standout applicants.\n\nThis week, the company rolled out a series of web-based modules that test prospective interns on their coding and engineering skills. The goal is to help identify the most qualified people among the nearly 100 applications the bank receives for each open position. Those who successfully complete the test are given priority consideration for potential internships. The modules provide a peak into the work and the people at JPMorgan Chase. JPMorgan Chase\n\n\"We're helping students understand what we do,\" says Derek Joyce, managing director of technology workforce strategy.\n\nThe virtual internship is about making the work experience clear to candidates.\n\n\"They tend to know what a Google, or a Microsoft, or an Amazon does ... but they usually don't know what it's like to build tech solutions at a bank,\" says Joyce, who joined JPMorgan in 1994 and has, since 2016, been focused on finding ways for the firm to recruit talent for the vast number of openings it has each year.\n\nUltimately, JPMorgan is hoping the tool not only gives potential interns a window into what a tech career at a bank can look like, but also introduce them to the people and the type of work they will encounter should they get accepted.\n\nUsing the virtual internships as a 'window into the kind of tech challenges' that JPMorgan faces\n\nThe modules take roughly 5 hours to complete, which means its more intensive than the usual 45 minute coding test that JPMorgan historically made their interns take during the application and interview process. Derek Joyce is the managing director of technology workforce strategy at JPMorgan Chase. JPMorgan Chase\n\nFor the firm, it provides better insight into the engineering skills, not just the coding ability, of prospective interns.\n\nAnd since the participants are given instructions by JPMorgan employees via recorded videos, the process also provides insight into the type of people the potential interns will be working with.\n\n\"We want to use this internship as a window into working here. A window into the environment, the people and the kind of tech challenges we have - the scale, complexity, and opportunity for innovation,\" Joyce says. \"It's [also] not just about the tech, it's about the working environment and the people.\"\n\nThe problems posed — like developing a program for traders to monitor and compare certain stocks — align with the work participants would be doing during an internship with JPMorgan. It's a global offering, so college students around the world can try to complete the test. And because the ultimate submissions are code-based, the company can easily automate the review process to scan for accuracy.\n\nThe effort aligns with JPMorgan's broader tech initiative. With an $11 billion budget annually for technology, the bank now has more digital users than its competitors — which executives say is helping to dramatically cut down on costs. Earlier this year, it rolled out a new global equity-trading bot.\n\nAnd across the company, JPMorgan is in the midst of a major initiative to standardize its data in the hopes of ultimately using artificial intelligence to improve, among other things, marketing operations to better target prospective borrowers.", "description": "Candidates who complete the modules get priority consideration for internships at JPMorgan and learn more about the work they'll be doing if hired.", "authors": ["Joe Williams"], "top_image": "https://amp.businessinsider.com/images/5d839ca92e22af371e743e65-2732-1366.jpg", "published_at": "2019-09-19"}