{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/twitter-reacts-demian-maia-submission-ben-askren-ufc-on-espn-plus-20-singapore", "downloaded_at": "2019-10-27 00:25:24.596502+00:00", "title": "Twitter reacts to Demian Maia's submission of Ben Askren at UFC on ESPN+ 20", "language": "en", "text": "Gallery Demian Maia def. Ben Askren at UFC on ESPN+ 20: Best photos view 12 images\n\nDemian Maia added to his stature as one of the winningest fighters in UFC history on Saturday when he defeated Ben Askren in the UFC on ESPN+ 20 headliner.\n\nMaia (28-9 MMA, 22-9 UFC) earned the third main event victory of his octagon tenure when he scored a third-round submission win over Askren (19-2 MMA, 1-2 UFC) in the welterweight bout, which took place at Singapore Indoor Stadium in Singapore and streamed on ESPN+.\n\nCheck below for the top Twitter reactions to Maia’s victory over Askren at UFC on ESPN+ 20.\n\n* * * *\n\nSomething told me askren and maia was gonna throw hands 😂 — Sodiq Yusuff (@Super_Sodiq) October 26, 2019\n\nMaia with left hands to the head and body. Askren looking to get inside #UFCSingapore — Sherdog by Mandatory (@sherdogdotcom) October 26, 2019\n\nMaia is lighting him up — caposa (@Grabaka_Hitman) October 26, 2019\n\nI just don’t understand how someone’s striking can be this rudimentary. Like awful. But finally a TD! #UFCSingapore — Aljamain Sterling (@funkmasterMMA) October 26, 2019\n\nAskren's longest fight in the UFC. — Jed I. Goodman (@jedigoodman) October 26, 2019\n\nHave you ever seen such an accomplished wrestler not look that good in wrestling as much as askren — Brian Kelleher (@brianboom135) October 26, 2019\n\nVery close first round Have it 10-9 Askren — Aaron Bronsteter (@aaronbronsteter) October 26, 2019\n\nThis is what you swapped Demetrious Johnson for. — Seán Sheehan (@SeanSheehanBA) October 26, 2019\n\nDemian Maia landed (unofficially) more significant strikes in the first round than he has in the duration of 18 of his previous 30 fights. — Aaron Bronsteter (@aaronbronsteter) October 26, 2019\n\nMaia from full mount to back … Askren escapes … what a scramble … #UFCSingapore — Brian Martin (@TheBMartin) October 26, 2019\n\nDemian Maia goes from omaplata sweep to leg weave pass to mount and more before Askren scrambles out. Hold me, Jesus. — Luke Thomas (@lthomasnews) October 26, 2019\n\nMaia is slowing down, Ben can scramble all day. This will be like qucksand if he keeps getting taken down. — Gerald Harris (@GHurricane) October 26, 2019\n\nFighters should know the scores during the fight. — Chas Skelly (@ChasSkelly) October 26, 2019\n\nNice takedown from Askren to open round three, but he can't keep Maia on the mat. #UFCSingapore — Rob Tatum (@RobTatum303) October 26, 2019\n\nWOW! Maia chokes Askren out! Incredible third round and excellent fight! — Kevin Iole (@KevinI) October 26, 2019\n\n👀 👀 👀 — Anthony Rocco Martin (@TonyRoccoMartin) October 26, 2019\n\nDamn. Styles make freaking fights! #UFCSingapore — Aljamain Sterling (@funkmasterMMA) October 26, 2019\n\nDemain Maia submits Ben Askren with a rear naked choke in the third round. Appeared to be one-armed or maybe half gripped. Need to see a replay. Suffice to say a great win for Maia and consequential loss for Askren. — Luke Thomas (@lthomasnews) October 26, 2019\n\n& Maia just Maia’d him — Gerald Harris (@GHurricane) October 26, 2019\n\nParabens @demianmaia mostrando a superioridade do Jiu-jitsu sempre!! — Rafael dos Anjos (@RdosAnjosMMA) October 26, 2019\n\nDamnnn!! Maia with the 1 handed RNC🤯 Surprised Askren wanted to go for the takedown when he was actually winning the striking exchanges and considering how dangerous Maia is. This fight was definitely more intriguing than I thought. #UFCSingapore — Megan Anderson (@MeganA_mma) October 26, 2019\n\nI never say stuff like this but @Benaskren needs to retire. — Sean McCorkle (@BigSexyMcCorkle) October 26, 2019\n\nIncredible fight fellas! Maia is filthy with it! https://t.co/bvG5LrihJr — Frankie Edgar (@FrankieEdgar) October 26, 2019\n\nDaaaammmmnnn shouldn’t have pigged out at the arab spot so hard #Malkiskitchen #msg #bmf — Jorge Masvidal UFC (@GamebredFighter) October 26, 2019\n\ni am the best grappler in mma — Dillon Danis (@dillondanis) October 26, 2019\n\nMade a bad decision and I failed. Sorry to everyone who I let down. — Ben Askren (@Benaskren) October 26, 2019\n\nMOST WINS – UFC History\n\n23 – Donald Cerrone\n\n22 – Demian Maia\n\n20 – Georges St-Pierre\n\n20 – Michael Bisping\n\n20 – Jim Miller#UFCSingapore — Michael Carroll (@MJCflipdascript) October 26, 2019", "description": "See the top Twitter reactions to Demian Maia's submission win over Ben Askren in the UFC on ESPN+ 20 main event.", "authors": ["Mike Bohn", "Nolan King", "Farah Hannoun", "Matt Erickson", "Mma Junkie Staff"], "top_image": "https://usatmmajunkie.files.wordpress.com/2019/10/demian-maia-ben-askren-ufc-singapore-1.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-26"}