{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/24/england-could-have-first-urban-seagull-cull-40-years-city-considers", "downloaded_at": "2019-10-24 16:06:28.291068+00:00", "title": "England could have its first seagull cull in 40 years as city considers application to Natural England", "language": "en", "text": "England is set to have its first urban seagull cull in 40 years as Worcester City Council considers an application to Natural England so the birds can be shot.\n\nCouncillors say they have tried many non-lethal methods, including decoy eggs which cause natural population declines and keep gulls quiet as they incubate the fake clutch.\n\nThey have also tried anti-gull bins, they say, which work by covering waste with metal grilles or other barriers so sharp beaks cannot get through. Drones have also been used to seek out nests in hard-to-reach places.\n\nIf the council succeeds it will be the first place in England to carry out a gull cull since marksmen shot dozens of adult birds in Torquay in 1975.\n\nIt is illegal to kill herring gulls, but a \"limited\" number of black-backed gulls could be culled if the council applied for a licence.\n\nNatural England have told the council gulls could only be culled as part of wider measures and only as a last resort.\n\nHowever, local politicians have argued that the birds are still proving to be a menace despite the £30,000 spent on anti-gull measures last year.\n\nConservative councillor Alan Amos is behind the proposed policy due to \"growing anger and frustration\" by locals and said the council's plan to move eggs had failed.", "description": "England is set to have its first urban seagull cull in 40 years as Worcester City Council considers an application to Natural England so the birds can be shot.", "authors": ["Helena Horton", "Asa Bennett", "Tom Harris", "Charlotte Gill", "Pieter Cleppe", "Benedict Spence"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/24/TELEMMGLPICT000203136864-xlarge_trans_NvBQzQNjv4BqpVlberWd9EgFPZtcLiMQfyf2A9a6I9YchsjMeADBa08.jpeg?imwidth=1200", "published_at": "2019-10-24"}