{"pub": "investingcom", "url": "https://investing.com/news/commodities-news/saudis-face-lengthy-oil-halt-with-few-options-to-replace-losses-1979521", "downloaded_at": "2019-09-17 10:39:58.496871+00:00", "title": "Saudis Face Lengthy Oil Halt With Few Options to Replace Losses", "language": "en", "text": "© Reuters. Saudis Face Lengthy Oil Halt With Few Options to Replace Losses\n\n(Bloomberg) -- The oil market is facing a prolonged disruption to Saudi Arabia’s oil production with few options for replacing such huge output losses.\n\nThe weekend attacks on the kingdom eliminated about 5% of global oil supply, propelling Brent crude to a record surge on Monday. Officials at state oil company Saudi Aramco have become less optimistic on the pace of output recovery, telling a senior foreign diplomat they face a “severe” disruption measured in weeks and months and informing some customers that October shipments will be delayed.\n\nThe historic price gain underscores the unprecedented nature of the disruption caused by the drone attack on the Abqaiq crude processing plant. For decades, Saudi Arabia has been the oil market’s great stabilizer, maintaining a large cushion of spare production capacity that can be tapped in emergencies, such as the 2011 war in Libya.\n\nThe halt of 5.7 million barrels day of the kingdom’s production -- the worst sudden supply loss in history -- exposes the inadequacy of the rest of the world’s supply buffer.\n\n“The market is in scramble mode to secure not only supplies of crude, but also products,” consultant JBC Energy GmbH said in a note. Prices are “reflecting a new geopolitical risk premium, namely that the safety of oil production in the heart of the Middle East cannot be guaranteed.”\n\nSaudi Aramco is firing up idle offshore oil fields to replace some of the lost production, said a person familiar with the matter. Customers are also being supplied using stockpiles, though some buyers are being asked to accept different grades of crude. The kingdom has enough domestic inventories to cover about 26 days of exports, according to consultant Rystad Energy A/S.\n\nU.S. President Donald Trump also authorized the release of oil from the country’s Strategic Petroleum Reserve, while the International Energy Agency, which helps coordinate industrialized countries’ emergency fuel stockpiles, said it was monitoring the situation.\n\nAccording to Bloomberg calculations based on publicly available data, the absolute maximum in spare capacity that could be brought into production in the coming weeks is about 3.9 million barrels a day.\n\nThe true volume of viable backup supply could be significantly lower, because it includes restarting production from the Neutral Zone shared by Saudi Arabia and Kuwait, as well as tapping the kingdom’s own spare capacity, much of which may also have to be processed at the Abqaiq or Khurais facilities and therefore be unusable.\n\nOther participants in the OPEC+ cuts, such as Russia, Kazakhstan and the United Arab Emirates, could restore a few hundred-thousand barrels a day of production, not enough to offset the Saudi losses.\n\nThe Organization of Petroleum Exporting Countries is in regular contact with the Saudi authorities, the group’s Secretary-General Mohammad Barkindo said in a Bloomberg TV interview. It’s premature to talk about reversing the oil-production cuts implemented by OPEC and its allies, he said.\n\nU.S. output may be booming, but the country’s many shale drillers hold little to no output in reserve. Oil production has plateaued at an average level of 12.37 million barrels a day since recovering from the impact of Hurricane Barry at the end of July.\n\nOutput will continue to grow and more than 10 new export terminals have been proposed for , capable of handling about 8 million barrels a day, but the first of these is unlikely to be operational before 2022 at the earliest.\n\nCrude prices pared gains on Tuesday, following an extraordinary trading day in which crude leaped settled a record 15% higher at just above $69. Futures were 0.3% lower at $68.80 a barrel as of 8:44 a.m. in London as the market waited for any further update from Aramco.\n\nSaudi Energy Minister Prince Abdulaziz bin Salman is scheduled to hold a press briefing on Tuesday evening in Jeddah.\n\nImages released of the damage to Abqaiq’s stabilization towers, which separate gaseous compounds from crude oil, suggest lengthy repairs, according to Phillip Cornell, a former senior corporate planning adviser to Aramco.\n\n“They can take weeks or months to get specialized parts,” he said at an event hosted by the Atlantic Council in Washington on Monday. Five out of 18 stabilization towers appear to have been taken out and the pictures that have been released show “very specific, accurate targeting of those particular infrastructures,” he said.\n\nIn addition to the immediate loss of supply, the attack raised the specter of U.S. retaliation against Iran, which could further inflame oil prices. While Houthi rebels in Yemen claimed responsibility for the assault, President Trump said it looked like Iran was to blame.\n\n“I don’t want to have war with anybody” but our military is prepared, Trump said at the White House on Monday.", "description": "Saudis Face Lengthy Oil Halt With Few Options to Replace Losses", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEB4B06M_L.jpg", "published_at": "2019-09-17"}