{"pub": "investingcom", "url": "https://uk.investing.com/news/forex-news/forex--dollar-surges-on-australian-rate-cut-weak-pmis-1973171", "downloaded_at": "2019-10-01 09:33:48.112346+00:00", "title": "Forex - Dollar Surges on Australian Rate Cut, Weak PMIs", "language": "en", "text": "Investing.com -- The dollar rose to within touching distance of a new two-year high in early trading on Tuesday, surging against the Australian and New Zealand dollars after the Reserve Bank of Australia cut its key cash rate to an all-time low of 0.75%.\n\nThe dollar rose almost a cent against the after the RBA’s move, which came after the economy grew at its slowest rate in a decade in the second quarter, another spillover from the U.S.-China trade war that has damped Chinese demand for Australian commodities. It also hit a new 10-year high against the .\n\nThe , which measures the greenback against a basket of six developed currencies, rose to as high as 99.21, close to the two-year high of 99.33 that it hit last month. That was when it hit a 10-year high against the – a level that looks set to be tested soon.\n\n“Further price movements may depend on Governor (Philip) Lowe's remarks at a dinner in Melbourne later today, in which he may choose to finesse expectations for future rate movements or provide more clarity on the focus on consumer spending, as opposed to the recent focus on the labour market,” Robert Carnell, chief economist for Asia-Pacific at ING, said in a note to clients.\n\nThe dollar also rose against the after a worse than expected survey, while it inched higher against the euro and sterling as crunch time approached in the Brexit drama. The Daily Telegraph reported Tuesday that Prime Minister Boris Johnson will send his detailed plans for avoiding a hard border on the island of Ireland to the EU on Tuesday after his speech to the Conservative Party’s annual conference.\n\nAccording to the Irish state broadcaster RTE, the plans involve a string of customs clearance centers set a few miles back from the border. That effectively creates a hard border in all but name, and thus effectively breach the Good Friday Agreement that the U.K. and EU have both promised to respect.\n\nBy 3:30 AM ET, the was at $1.0890, up 10 ticks from a new two-year low that it hit at the start of trading. The was back below $1.2300, while both the and the also came under pressure after sharp drops in their national purchasing managers indexes indicated contraction in both countries’ manufacturing sectors.", "description": "Forex - Dollar Surges on Australian Rate Cut, Weak PMIs", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/gbp_usd_800x533_L_1411906227.jpg", "published_at": "2019-10-01"}