{"pub": "mirror", "url": "https://mirror.co.uk/news/world-news/instagram-influencer-accused-taking-barely-20747668", "downloaded_at": "2019-10-29 15:12:01.829710+00:00", "title": "Instagram influencer accused of taking 'barely there bikini' trend too far", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\n\"Wait, where is the swimsuit?\"\n\nThat's the question a model was bombarded with after she revealed her new two-piece swimwear on Instagram .\n\nAt first glance Australian influencer Tammy Hembrow looks as naked as the day she was born.\n\nBut at much closer inspection, and we mean much closer, you can see her barely-there bikini.\n\nIt took a while for many of her 10 million followers to spot it though.\n\nThe mum-of-two, who is a fitness trainer from the Gold Coast, posted the pics saying: \"For the sun lovers. The Minimale Animale splendor suit in my new colour ‘Euphoria’ dropping next week.\"\n\nBut it seems the only thing that was dropping was her followers' jaws.\n\nOne asked: \"Wait, where’s the swimsuit?”\n\nAnother wrote: “You left nothing to the imagination here.\"\n\n“What’s the point of wearing anything?” another follower asked.\n\nAnother exclaimed: “Christ, that’s just string.”\n\nWhile a shocked follower screamed: \"OH MY GOD\"\n\nSince she upload the image on Tuesday morning the post has had more than 370,000 likes.\n\n(Image: minimale-animale)\n\nTammy's bikini is the latest take on the \"naked\" swimwear trend.\n\nThe $190 (£150) bikini has a few small patches to protect the wearer’s bits and pieces – you just can’t see them from the side.\n\nTammy isn't shy when it comes top wearing 'naked' swimwear as previous photos on her Instagram have had follower gasping but this latest post \"oversteps the line\" according to one of her followers.\n\nIn July, she wore a design with see-through straps that was classed as \"vulgar' by some followers.", "description": "Australian mum Tammy Hembrow's latest swimwear pic has almost crashed the internet", "authors": ["Lorraine King", "Image", "Tammyhembrow Instagram", "Minimale-Animale"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20747994.ece/ALTERNATES/s1200/3_tammyhembrow_65856041_1561336963991596_5927371909096531069_nAJPG.jpg", "published_at": "2019-10-29"}