{"pub": "metro", "url": "https://metro.co.uk/2019/10/05/british-pensioner-and-wife-kidnapped-at-gunpoint-in-philippines-10867493", "downloaded_at": "2019-10-05 22:49:39.998983+00:00", "title": "British pensioner and wife kidnapped at gunpoint in Philippines", "language": "en", "text": "The couple were kidnapped at gunpoint from Tukuran, in Zamboanga Del Sur (File Picture: Facebook)\n\nA British businessman, 70, and his Filipino wife have been kidnapped at gunpoint from their beach resort in the Philippines.\n\nAn armed gang abducted the couple from Tukuran, in Zamboanga Del Sur, at around 6.50pm on Friday.\n\nThe man has lived in the province since 2013 and operates a number of businesses with his wife in the area.\n\nAt least four gunmen are said to have dragged the couple from the resort, across the beach and onto waiting boats.\n\nMajor Helen Galvez, of the Philippine regional police force, told the Guardian two of the suspected kidnappers had checked into the resort the previous day and waited for the couple to arrive.\n\nShe said: ‘They own a lot of properties and business so they are always moving. The suspects waited for the victims to arrive at the resort.’\n\nMum killed her son, 2, ‘after he refused to eat a hot dog’\n\nOn Friday more gunmen arrived and forced the couple onto two motorboats which left in separate directions.\n\nAdvertisement\n\nAdvertisement\n\nIt is not clear at this point if the couple were separated or placed on the same boat.\n\nThe group behind the abduction is not yet known but kidnappings for ransom by militants and armed gangs has been a long held concern for the region.\n\nHowever in recent years the number of kidnappings in Zamboanga has fallen due to campaigns against such groups by security forces.\n\nGalvez added: ‘It’s been a while since an incident of kidnapping happened in our area. We are alarmed.’\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "A 70-year-old British businessman and his Filipino wife have been kidnapped at gunpoint from their beach resort in the Philippines.", "authors": ["Metro News Reporter"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_88389226_1570291093.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-05"}