{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7529499/Planet-travelling-24-miles-second-year-just-18-hours-long.html", "downloaded_at": "2019-10-05 06:25:57.697250+00:00", "title": "Planet travelling at 24 miles per second has a year just 18 hours long", "language": "en", "text": "An enormous gas planet is orbiting so close to its star and with such pace that it has a year just 18 hours long.\n\nThe exoplanet, which is over 1,000 light years away in another solar system, is brushing so close to the host star that it risks being ripped apart by gravity.\n\nIt has been named NGTS-10b and belongs to the so-called 'hot Jupiter' type of planets - gas giants which orbit alarmingly close to their parent star's scorching surface.\n\nAt team of planetary scientists spearheaded by James McCormac of the University of Warwick has claimed that this 24-mile-per-second gas giant has the fastest orbit time of any hot Jupiter discovered.\n\nThe exoplanet, which is over 1,000 light years away in another solar system, is brushing so dangerously close to the host star that it risks being ripped apart by gravitational forces (pictured: artist's impression of a Jupiter-sized planet passing in front of its parent star)\n\nThe formation of hot Jupiters are shrouded in mystery and, according to most theories of planet formation, should not even exist.\n\nDust and gas clouds which clump together and snowball to form planets should theoretically be torn apart by gravitational pull and radiation if they are that close to the star.\n\nBut 337 hot Jupiters have so far been discovered, leading astronomers to believe they form away from their host star before floating towards it in a spiral.\n\nYet even these robust exoplanets cannot survive the tidal forces forever.\n\nScientists predict that within 38million years NGTS-10b will reach its Roche limit - the point where the planet gets so close to its star that it disintegrates under the pressure.\n\nThe finding came after another Jupiter-like planet was found orbiting a star a mere 31 light years from Earth (artist's impression pictured)\n\nNGTS-10b was discovered using the Next Generation Transit Survey in Paranal, Chile, where six previous hot Jupiters have been found.\n\nThe finding came after another Jupiter-like planet was found orbiting a stat a mere 31 light years from Earth.\n\nLead author Juan Carlos Morales of the Institute of Space Studies of Catalonia said the planet may be almost as big as its host star.\n\nBut unlike NGTS-10b, a year there is a lot longer and lasts about 200 days.", "description": "At team of planetary scientists spearheaded by James McCormac of the University of Warwick has claimed that NGTS-10b has the fastest orbit time of any 'hot Jupiter' discovered.", "authors": ["Jack Elsom For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/02/15/19209924-0-image-a-41_1570027870872.jpg", "published_at": "2019-10-02"}