{"pub": "reuters", "url": "https://reuters.com/article/us-mexico-violence/mexico-shootouts-lopsided-death-toll-sparks-questions-over-use-of-force-idUSKBN1WW32P", "downloaded_at": "2019-10-18 01:16:02.396688+00:00", "title": "Mexico shootout's lopsided death toll sparks questions over use of force", "language": "en", "text": "MEXICO CITY (Reuters) - The mass killing in Mexico this week of 14 suspected gang members in a gunfight that claimed the life of one soldier has raised questions about whether the armed forces used excessive force, reviving the specter of notorious cases from the past.\n\nAccording to the government, Tuesday’s clash occurred when a military patrol returned fire at a convoy of gunmen on a back road in Tepochica in the southwestern state of Guerrero, one of the most violent in Mexico.\n\nRelaying its version of events, the defense ministry said that in the clash, the soldier died while acting as “shooter” for his comrades in the lead military vehicle.\n\nMeanwhile President Andres Manuel Lopez Obrador told a regular news conference on Wednesday that after being wounded by the gunmen, the soldier fought on with his machine gun and killed an unspecified number of adversaries before dying.\n\nHowever, the president, who campaigned for office last year on a pledge to adopt a less confrontational approach to gangs, said there would be an investigation into whether the death-toll resulted from a shootout, or whether there had been executions.\n\n“We don’t know; we will have to find out,” Lopez Obrador said.\n\nThe accounts and photographic evidence published so far have caused doubts among security experts and human rights groups mindful of the lopsided deaths in some incidents between the military and civilians under the prior government.\n\n“You don’t need to be an expert to see that (from) the position of the bodies, it’s questionable that this was a gunfight,” said Erubiel Tirado, a security and intelligence expert at the IBERO university in Mexico City.\n\n“The fact there’s only one dead soldier is something that needs to be cleared up to establish there wasn’t excessive use of force. I think the National Human Rights Commission and the U.N. high commissioner should be part of this,” he said.\n\n“It’s clear there was excessive use of force,” he added.\n\nThe defense ministry said in its statement on Wednesday that the military force had used force in accordance with the law.\n\nThe reputation of Mexico’s armed forces was tainted by the 2014 mass shooting of 22 suspected gang members in the central municipality of Tlatlaya, which led to the arrest of seven soldiers suspected of carrying out extra-judicial killings.\n\nThree of the soldiers were subsequently charged with murder, although all of the suspects had been released by 2016.\n\nTepochica is on the outskirts of Iguala, a city notorious for the 2014 disappearances of 43 student teachers. The corporal killed on Tuesday was from Iguala’s 27th Battalion, the defense minister said in a tweet, praising his heroism.\n\nSecurity forces again came under intense scrutiny in 2015 when a gunfight in the western state of Michoacan left 42 suspected gangsters dead for the loss of one federal policeman.\n\nPhotographs of the Tepochica shootout showed four men lying dead in the back of a pick-up, others on the ground behind the vehicle, and two dead youths, one of whom was holding a rifle, in the back of a car.\n\nStreets were silent and smeared with blood the day after the fight. Schools were closed. Several residents told Reuters they sheltered inside their houses when shooting started and had not witnessed the violence. They said that after about 40 minutes of gunfire, soldiers began knocking at doors and searching homes.\n\nThe bodies were taken to a local morgue, where they were identified by family members. Officials at the morgue said the men were from Tepochica, Iguala and neighboring towns.\n\nHuman rights group Amnesty International said in a statement that given the questions over the event, Mexico should conduct a prompt, independent and impartial investigation “to determine whether the security forces made legal use of lethal force.”\n\n“If there is evidence of human rights violations, the authorities should try those suspected of responsibility in a fair trial and guarantee their rights to due process,” said Erika Guevara-Rosas, Americas director at Amnesty International.", "description": "The mass killing in Mexico this week of 14 suspected gang members in a gunfight that claimed the life of one soldier has raised questions about whether the armed forces used excessive force, reviving the specter of notorious cases from the past.", "authors": ["Ana Isabel Martinez", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-17"}