{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/rugby-world-cup-2019-how-england-fostering-togetherness-scott-wisemantel-interview-a9123721.html", "downloaded_at": "2019-09-28 10:25:03.730931+00:00", "title": "How England are fostering a culture of togetherness at Rugby World Cup", "language": "en", "text": "Eddie Jones made it clear this was the end of the first stage. His assistant, Scott Wisemantel, took it one step further, and said that as the sprints disappeared behind them, the mountains were emerging into view.\n\nThe problem with the mountains is they split even the tightest of teams. Team Ineos saw as much in this year’s Tour de France, when team leader Geraint Thomas fell away as young protégé Egan Bernal rode into the distance.\n\nHow does that equate to rugby, you ask?\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIf England are heading for the mountains, there are difficult times ahead. The big challenge for Jones’s side was always going to be how they coped with the four-day turnaround between games one and two, and as the results show, they achieved exactly what was needed. 10 points from 10 and a fully fit squad, England sit pretty at the top of Pool C.\n\nThere are two problems though that are now in full view as they begin the World Cup ascent. The first is very obvious: Piers Francis has been cited and almost certainly faces a three-week ban, which in World Cup terms equates to a three-match ban. If England remain in the tournament, Francis will not be available again until the semi-finals in mid-October, which effectively ends his tournament unless injury strikes England’s midfield big guns.\n\nShape Created with Sketch. Rugby World Cup 2019 - Team of the Round Show all 16 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Rugby World Cup 2019 - Team of the Round 1/16 Rugby World Cup 2019 - team of the round AFP/Getty Images 2/16 1 Jefferson Poirot Getty Images 3/16 2 Rory Best Getty Images 4/16 3 Tadhg Furlong Getty Images 5/16 4 Maro Itoje Getty Images 6/16 5 Scott Barrett AP 7/16 6 Ardie Savea PA 8/16 7 Peceli Yato Getty Images 9/16 8 Kazuki Himeno PA 10/16 9 Tomos Williams AFP/Getty Images 11/16 10 Romain Ntamack AFP/Getty Images 12/16 11 Cheslin Kolbe AFP/Getty Images 13/16 12 Samu Kerevi AFP/Getty Images 14/16 13 Manu Tuilagi Getty Images 15/16 14 Kotaro Matsushima Getty 16/16 15 Beauden Barrett Getty Images 1/16 Rugby World Cup 2019 - team of the round AFP/Getty Images 2/16 1 Jefferson Poirot Getty Images 3/16 2 Rory Best Getty Images 4/16 3 Tadhg Furlong Getty Images 5/16 4 Maro Itoje Getty Images 6/16 5 Scott Barrett AP 7/16 6 Ardie Savea PA 8/16 7 Peceli Yato Getty Images 9/16 8 Kazuki Himeno PA 10/16 9 Tomos Williams AFP/Getty Images 11/16 10 Romain Ntamack AFP/Getty Images 12/16 11 Cheslin Kolbe AFP/Getty Images 13/16 12 Samu Kerevi AFP/Getty Images 14/16 13 Manu Tuilagi Getty Images 15/16 14 Kotaro Matsushima Getty 16/16 15 Beauden Barrett Getty Images\n\nIt means England’s ‘Team of 31’ is now a team of 30, as even if Francis were to be banned for the rest of the tournament in Sunday’s hearing, England are not allowed to call up a replacement for a player suspended – only when they are injured.\n\nThus comes the second obstacle on the climb. England have nine days between game two and three in the pool stage, and then seven days between game three and four. Should they make the knockout stage, a week splits each round, depending on how far England go. Suddenly the need to rotate the squad, give everyone a game and keep everyone happy, has gone, and if the past selection decisions from Jones is anything to go by he will select his best squad possible for each and every game.\n\nThat’s why the England training shirts have ‘Team of 31’ printed across the back of them, in what Wisemantel admitted was something of a subliminal message to help the team buy into what Jones wants. When Jones named his 31-man squad back on 12 August, he admitted that the players who filled places 28-31 in the touring party had to be “good tourists”. That meant finding players who would find comfort in not playing for up to a month.\n\n“It puts a test on togetherness but togetherness is one of our themes and the players acknowledge it, they openly talk about it,” said Wisemantel. “It’s a team of 31, socially they hang out and then when they’re on the field they compete and they compete hard. That’s what we want, that competition so that whether they’re in the 23 or not they’re competing for places, they’re not just passengers.\n\n“Every day is a test, how you can hang in there and compete. It’s an individual thing to make sure you can get up for every day and compete.”\n\nWisemantel is about as honest as they come, at least in the hub of a World Cup where to give anything away is strangely perceived as a weakness. Where he explains that togetherness is important off the field, he also offers insight how to a breakdown on it helps to iron out any lingering issues that can manifest into genuine problems during a World Cup campaign.\n\nHis example is a good one. During England’s opening World Cup victory over Tonga, England were onto a guaranteed try when Henry Slade fluffed his final pass to Elliot Daly – guilty of overrunning the man inside him – and thew the ball straight into touch with the try line begging. The two immediately engaged in verbals – something that the media have no hesitation in picking up on, but Wisemantel was one of the more pleased to see it.\n\n“If we’re competing and we’re competing hard and you’re not happy with what I’ve done or I’m not happy with what you’ve done, then we actually sort it out afterwards like ‘mate, don’t do that, what were you thinking?’” said Wisemantel. “It’s real simple.\n\n“A little bit is good, it creates electricity. An example would be from the Tonga game for instance. On the field there was a miscommunication between Sladey and Elliot, and then straight afterwards they sorted it. I thought it was brilliant. They ripped into each other, ‘I want you here, I need you here’.\n\n“We’re talking wants and needs – maslow – and ok, they sorted it and they sorted it very quickly. It was brilliant.”\n\nThe test though lies in whether that ability to sort out problems within the squad remains as the weeks go by. With Slade yet to make a start this season, the prospects of him forcing his way into a starting midfield that will also feature Manu Tuilagi, Jonathan Joseph and, it seems, Owen Farrell, are highly unlikely. If that scenario arises again in training or when a player pushing for a starting berth comes on late in the day, will the same constructive debate happen, or will the ‘Team of 31’ quickly descend into a ‘Team of One’?\n\nAs the Tour proves, there is no space for passenger, nor any place for lone wolves.", "description": "Eddie Jones made it clear this was the end of the first stage. His assistant, Scott Wisemantel, took it one step further, and said that as the sprints disappeared behind them, the mountains were emerging into view. The problem with the mountains is they split even the tightest of teams. Team Ineos saw as much in this year’s Tour de France, when team leader Geraint Thomas fell", "authors": ["Jack De Menezes"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/27/17/england-rugby-team.jpg", "published_at": "2019-09-28"}