{"pub": "theverge", "url": "https://theverge.com/2019/10/25/20932088/sony-playstation-vue-sale-streaming-war-competiton-content-cost", "downloaded_at": "2019-10-25 16:03:37.155125+00:00", "title": "Sony is reportedly looking to sell its PlayStation Vue streaming service", "language": "en", "text": "Sony is currently looking for a buyer of its PlayStation Vue TV streaming service, according to a new report published by The Information. The company has reportedly already approached one potential buyer, the sports-focused streaming service FuboTV, with a sale that would include the service’s approximately 500,000-strong subscriber base, alongside its underlying technology. That customer tally is substantially less than other subscription TV services, despite PlayStation Vue being one of the first such services to launch.\n\nThe Information’s report claims that Sony’s streaming service is continuing to lose money, despite several subscription price hikes, most recently a $5 increase in July of this year. Sony is struggling with the rising cost of programming, which is thought to be hitting the company harder than its competitors. Unlike, say, Hulu, Sony doesn’t have as big of a content library of its own, which leaves it with less leverage in its negotiations. The Information notes that it’s unclear whether Sony’s programming contracts would transfer to PlayStation Vue’s new owner after a sale.\n\nThe streaming wars are coming\n\nFrom a technology standpoint, PlayStation Vue offers some unique features. If you’re using the service on an Apple TV, for example, you can currently watch as many as four streams simultaneously on a single screen. On a PlayStation 4, this limit drops to three, but the PlayStation Vue has the advantage of being the only internet TV service available. Sony has so far refused to allow competitors like Sling TV, YouTube TV, and Hulu’s live TV service onto the platform. Should Vue be sold to an outside company, that could potentially change.\n\nSony may have picked a good time to get out of the streaming business, as the market will soon become a lot more crowded with a host of new players. Disney+ and Apple TV Plus are both coming next month, AT&T’s HBO Max is due next year, and NBCUniversal is readying its Peacock service as well. With each of these companies investing heavily in exclusive content — and with Vue already trailing other internet TV providers — Sony’s challenges aren’t going anywhere.", "description": "Sony is currently looking for a buyer of its PlayStation Vue streaming service, according to a new report. The company has reportedly already approached one potential buyer, the sports-focused streaming service FuboTV.", "authors": ["Jon Porter", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/dsYq8IZq5Banewm68NjjodCQs3k=/0x115:1600x953/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/15970580/vue.jpg", "published_at": "2019-10-25"}