{"pub": "indiatimes", "url": "https://timesofindia.indiatimes.com/blogs/the-democracy-project/poor-economics-from-esther-duflo-and-abhijit-banerjee-has-lessons-for-india", "downloaded_at": "2019-10-19 10:56:04.390057+00:00", "title": "‘Poor Economics’ from Esther Duflo and Abhijit Banerjee has lessons for India", "language": "en", "text": "In the final chapter of his travelogue, ‘An Area of Darkness’, VS Naipaul presents a deeply melancholic view of India. In the book’s prelude, Naipaul describes his frustration to extricate two bottles of spirit seized by custom officials from the clutches of the convoluted Indian bureaucracy. He writes, “It was a journey that ought not to have been made; it had broken my life in two.” There are myriad such accounts by scholars citing failed/weak institutions like our baeurocracy existing as impediments to India’s new dawn. Amidst the gloom, this year’s ‘Sveriges Riksbank Prize in Economic Sciences’ awardees, Abhijit Banerjee and others, give developing countries like India a bright canvas to paint a powerful picture.\n\nIn the last chapter of the book, ‘Poor Economics’, Abhijit et al. peruse this debate. The chapter explains MIT’s Daron Acemoglu and Harvard’s James Robinson prophecy that until institutions are fixed, countries cannot really develop, but institutions are hard to fix. This view degrades the importance of a good policy, whose effective implementation must be preluded by sound institutions.\n\nThe political class in former colonies clutched to the exploitative ways of colonizers for self-serving interests, thereby undermining the development of independent and accountable institutions. This is shown in a paper, ‘The Legacy of Colonial Land Tenure Systems in India’, where Abhijit et al, prove that overall crop yields are 16% higher, literacy rates are 18% higher and infant mortality rates are 40% lower in non-landlord areas (where an alternative to the feudal zamindari system was practiced) in post-independence period. This meant that zamindari as an institution persisted as an impediment to growth even after attaining independence.\n\n‘Poor economics’, explains two wide spectrums to deal with the conundrum of building institutions before policies. First, it is incumbent on the developed world to help establish better institutions in underdeveloped countries. A prime illustration would be how Britain transformed ‘Hong Kong’ and handed it over to China. The second contrasting view is that any such top down external approach to rehaul the institutions is bound to fail. The change must come from within unless we want to repeat the catastrophe that followed the American intervention in Iraq.\n\nBoth these views present a distinct quandary. No developed country would be willing to invest in a region only to surrender it later; without the urge of usurping untrammeled power. This trust deficit negates the first solution. Secondly, it takes time for change to come from within, especially when it is in the interest of the political class to maintain the status quo.\n\nAbhijit et al, in ‘Poor Economics’, have a solution- ‘it is not necessary to fundamentally change institutions to improve accountability and reduce corruption’. Reforms occurred even in dictatorships e.g. electoral reforms in Indonesia under Suharto and in Brazil during military rule. Similarly, when the Communist party in China, introduced village-level elections in the early 1980s, village chiefs were more likely to relax unpopular central policies.\n\nThe book says that ‘similarly, fighting corruption appears to be possible even without fixing the larger institutions.’ A Randomised Control Trial (RCT) by J-PAL in Rajasthan police station showed that “decoy” visits by field officers posing as citizens attempting to register cases gave constables incentives to behave more professionally. The registration of the cases went up from 40% to 70%, reducing the unwillingness of the system to hear people.\n\nAbhijit and his team give this world new hope. While accepting the limitations of RCTs and nudging people, this noble laureate, does not put good policies hostage to sound institutions. The fact remains that institution-building takes time and hence it cannot be a precondition to alleviating millions of people out of poverty. ‘Poor economics’ shows us the optimism- “We have no lever guaranteed to eradicate poverty, but once we accept this; time is on our side. Poverty has been with us for many thousands of years; if we have to wait another fifty or a hundred years for the end of poverty, so be it.”", "description": "In the final chapter of his travelogue, ‘An Area of Darkness’, VS Naipaul presents a deeply melancholic view of India. In the book’s prelude, Naipaul describes his frustration to extricate two bottles of spirit seized...", "authors": ["Prakhar Singh"], "top_image": "https://timesofindia.indiatimes.com/blogs/wp-content/themes/blogstheme/images/blog-facebook.jpg", "published_at": "2019-10-19"}