{"pub": "cnbc", "url": "https://cnbc.com/2019/09/19/tencent-music-and-wesing-no-hurry-to-take-karaoke-app-to-more-markets.html", "downloaded_at": "2019-09-19 09:39:04.666306+00:00", "title": "Tencent Music says it's in no hurry to take its popular karaoke app 'WeSing' to more countries", "language": "en", "text": "The logos of QQ Music, Kugou and Kuwo are seen on the screen of an iPhone on June 12, 2018 in Paris, France. QQ Music, Kugou and Kuwo are the three streaming Chinese music services owned by Tencent. Chesnot | Getty Images\n\nTencent Music Entertainment is in no hurry to bring its popular social karaoke app to more international markets just yet, according to a senior executive at the company. Besides China, the app, called WeSing, is available in the Philippines, Indonesia, Thailand, and Malaysia. Before going into more markets, Tencent Music wants to see more \"sustainable\" success for the app in those countries, Dennis Hau, group vice president at Tencent Music Entertainment, told CNBC on Tuesday. \"I'm a products guy. I really want a product to be sustainable, to be not just popular, but also be able to retain users on an ongoing basis before we expand further,\" Hau said.\n\nThat, according to the executive, is going to be very costly, but if WeSing is able to perform as the company hopes in markets such as the Philippines or Indonesia, then \"we have more confidence, then we can push out to more ... countries.\" WeSing lets people upload their performances online and interact with others on the platform. Tencent Music claims its users create 10 million recordings per day. An artificial intelligence program parses those files to find talented amateur performers. Tencent Music makes money on WeSing when users buy virtual \"gifts\" for their favorite performers. The decision to enter the four Southeast Asia markets was based on demographic research, marketing data and \"gut-feeling,\" Hau said. He said that people in those countries love music and are generally very sociable. \"We also look at the market size,\" Hau added. \"At the end of the day, we're wanting business there.\" Southeast Asia has a population of 650 million people.\n\nRevenue figures missed forecasts\n\nTencent's music business is split into music streaming and social entertainment services like WeSing. QQ Music, which is Tencent's online music streaming service, is popular in China. The company claims 800 million registered users for the service since its 2005 launch. That figure would almost equal the Chinese government's estimate for China's entire internet population. Asked to elaborate on the 800 million number, Tencent told CNBC that some individual users may have \"unintentionally created multiple accounts\" after losing mobile numbers or through different social media apps. The company's social entertainment products include not only karaoke platform WeSing, but also live streaming services Kugou Live and Kuwo Live, which let users watch live performances and concerts. Those platforms generate more revenue for the tech giant than online music streaming. In financial results reported in August, Tencent Music Entertainment missed revenue estimates for the April-June quarter. The firm also reported its average revenue per paying user for its social entertainment services was 130.2 yuan ($18.37), a 16.5% on-year jump, but it was said to be the slowest growth pace since Tencent Music Entertainment went public last December. Average revenue per paying user is a closely-watched metric for media streaming companies. Also in August, Bloomberg News reported that China's antitrust authority was scrutinizing Tencent Music Entertainment's dealings with music labels including Universal Music Group, Sony Music Entertainment and Warner Music Group. Those record labels were said to have sold exclusive rights to a large portion of their music catalogs to Tencent Music, which then sub-licenses that music to smaller rivals, a practice they complain is unfair, Bloomberg reported. Tencent Music declined to comment on antitrust laws or the ongoing investigation. The company's competitors in China include music and video platforms operated by Alibaba, Baidu, NetEase, and ByteDance. — Reuters contributed to this report.", "description": "Besides China, the WeSing app is available in the Philippines, Indonesia, Thailand and Malaysia.", "authors": ["Saheli Roy Choudhury"], "top_image": "https://image.cnbcfm.com/api/v1/image/105502210-1539289273077gettyimages-972280340.jpeg?v=1568803401", "published_at": "2019-09-19"}