{"pub": "metro", "url": "https://metro.co.uk/2019/10/11/footballers-wives-reboot-works-coleen-rooney-rebekah-vardy-drama-prayers-answered-10900474", "downloaded_at": "2019-10-11 12:55:50.605315+00:00", "title": "Coleen Rooney and Rebekah Vardy sparks Footballers' Wives reboot", "language": "en", "text": "The public is crying out for a Footballers’ Wives reboot (Picture: Rex; ITV)\n\nIconic British drama Footballers’ Wives may be returning to our screens after the Coleen Rooney and Rebekah Vardy feud sparked the public’s hunger for a reboot.\n\nA former writer on the show told BBC Radio 4 today she has been inspired to begin talks of reviving the series after Wagatha Christie herself broke the internet two days ago.\n\nVardy has vehemently denied claims that she was responsible for selling fake stories posted on Rooney’s private Instagram account.\n\nTanya and Amber’s return would be an iconic moment for British television (Picture: ITV)\n\nThe scandal seemed like a storyline from the ITV drama brought to life, so now calls for the series to be revived have reached fever pitch.\n\nAdvertisement\n\nAdvertisement\n\n‘I’m typing as we speak!’ Liz Lake squealed. ‘Wouldn’t [a reboot] be nice?’\n\nFootballers’ Wives ran from 2002-2006 and charted the spectacular highs and lows of WAG culture.\n\nCan you imagine what the characters would get up to in the present day? (Picture: ITV)\n\nFronted by Zoe Lucker’s insatiable Tanya Turner, the show saw some truly wild times televised to the nation; everything from extra marital and same sex affairs, death by champagne bottle, even a problematic baby swap involving a lot of fake tan.\n\nSocial media users have already clocked the similarities between real life and fiction here, and have pretty much been demanding the comedy-drama return to screens immediately.\n\nIn light of #coleenvsrebekah, can we please, PLEASE give this nation what it deserves and get a rerun of all Footballers' Wives episodes back on TV? pic.twitter.com/OlvSedJ3Tj — Helen Coffey (@LenniCoffey) October 10, 2019\n\nThis Coleen Rooney/Rebekah Vardy malarkey is pulled straight out of Footballers Wives! Further proof we need it to be brought back! Tanya Turner and Amber did all this back in 2005! pic.twitter.com/x77zmlnXBu — Shirley Carter’s Pussy (@ShirleyPussy) October 9, 2019\n\nSomewhere in the ITV offices, an ambitious young producer is frantically typing up their pitch to reboot Footballers' Wives — Jonn Elledge (@JonnElledge) October 9, 2019\n\nEveryone in Britain seemed to collectively lose their minds on Wednesday (has it really only been two days?) since Coleen posted an expose revealing the identity of the person allegedly responsible for selling fake stories to the tabloid press.\n\nAdvertisement\n\nAdvertisement\n\n‘It’s……….Rebekah Vardy’s account’ will now go down in history.\n\nWe’ve already decided on our dream cast – from Jodie Comer to Lea Michele – if Ryan Murphy ever decides to make a TV adaption happen.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Rebekah Vardy compares Coleen Rooney to a pigeon after WAG ‘annihilated her in public’\n\nMORE: Rebekah Vardy claims Coleen Rooney blocked her on Instagram months before scandal", "description": "A former writer for ITV drama Footballer's Wives has said the recent Coleen Rooney/Rebekah Vardy drama has inspired her to start writing again.", "authors": ["George Griffiths"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89411415_1570792085.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-11"}