{"pub": "yahoo", "url": "https://finance.yahoo.com/news/fitbit-pulls-china-escape-tariffs-143915385.html", "downloaded_at": "2019-10-11 06:57:48.739230+00:00", "title": "Fitbit Pulls Out Of China To Escape Tariffs", "language": "en", "text": "The Trump administration’s trade policies have finally gotten to Fitbit Inc (NYSE: FIT).\n\nThe company announced Wednesday that it would shift certain product manufacturing from China to another market in order to evade the cost of Section 301 tariffs.\n\nWhat Happened\n\nBeginning in January 2020, “effectively” none of Fitbit’s trackers and smartwatches will be made in China, according to the company.\n\n\"In 2018, in response to the ongoing threat of tariffs, we began exploring potential alternatives to China,” CFO Ron Kisling said in a statement. “As a result of these explorations, we have made changes to our supply chain and manufacturing operations and have additional changes underway.”\n\nWhy It’s Important\n\nFitbit joined Lovesac Co (NASDAQ: LOVE) and other companies moving supply chains to attenuate trade-related risks. At least one analyst appreciates the strategy.\n\n“We are encouraged by the move given the: 1) prolonged U.S./China trade war and 2) it seems to position Fitbit to have greater control of its future pricing and, therefore, its margins,” D.A. Davidson analyst Tom Forte said in a note.\n\n“We expect more of our covered companies to mirror Fitbit's efforts and, at the minimum, move some of their supply-chain efforts out of China and, at the maximum, move all of them.”\n\nIn particular, Forte foresees such moves by Logitech International SA (NASDAQ: LOGI), Roku Inc (NASDAQ: ROKU), Sonos Inc (NASDAQ: SONO), Turtle Beach Corp (NASDAQ: HEAR) and Zagg Inc (NASDAQ: ZAGG).\n\nWhat’s Next\n\nHow Fitbit and peers strategize around trade policy may trigger a federal reaction.\n\n“To the extent more companies exit China, we do expect government to respond, though it is not clear to us yet as to how,” Forte said.\n\nFitbit will comment on the financial implications of its move in its third-quarter earnings call. The company’s stock was trading down 0.68% at $3.66 at the time of publication.\n\nRelated Links:\n\nFitbit Launches New Smartwatch, Subscription Service\n\nAnalysts: If You Want To Get Fit, Don't Buy Fitbit Stock\n\nPhoto courtesy of Fitbit.\n\nLatest Ratings for FIT\n\nDate Firm Action From To Aug 2019 Maintains Neutral Jul 2019 Maintains Neutral Feb 2019 Upgrades Neutral Buy\n\nView More Analyst Ratings for FIT\n\nView the Latest Analyst Ratings\n\nSee more from Benzinga\n\n© 2019 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "description": "The Trump administration’s trade policies have finally gotten to Fitbit Inc (NYSE: FIT ). The company announced Wednesday that it would shift certain product manufacturing from China to another market ...", "authors": ["Elizabeth Balboa"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-10"}