{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/police-task-team-established-to-deal-with-ongoing-taxi-violence-in-mthatha-20180310", "downloaded_at": "2019-10-27 00:19:41.429535+00:00", "title": "Police task team established to deal with ongoing taxi violence in Mthatha", "language": "en", "text": "East London – Police have launched a multi-disciplinary task team comprising of detectives, crime intelligence and visible policing members to tackle ongoing taxi violence in Mthatha, following at least three murders on Friday.\n\nPolice spokesperson, Captain Dineo Koena, said in the first attack, a 40-year-old taxi driver was fatally wounded by unknown gunmen at Riverside near Corhana locality on the R61 road at around noon on Friday.\n\nShe said the deceased had been transporting passengers from Ntlaza to Mthatha, when he was stopped by a white Toyota Corolla with no registration numbers.\n\n“Four unknown, balaclava-clad assailants, fired several shots at him killing him instantly,” she said.\n\nKoena said all the passengers, as well as the conductor escaped unhurt. She said spent cartridges from a 9mm pistol had been recovered at the scene.\n\nRead: Mthatha taxi violence leaves commuters stranded\n\nIn a separate incident on Friday evening at around 19:00, Koena said a 37-year-old taxi owner, from Northcrest taxi rank, was fatally wounded by unknown gunmen at the Maqanyeni locality Sibangweni Administrative Area.\n\nShe said the taxi owner, his wife and a colleague had been travelling along the N2 from Durban to Mthatha when they were attacked.\n\nShe said the taxi owner, who had been a passenger in the vehicle, was shot dead and his wife was rushed to hospital in a critical condition. She said his colleague had fled the scene.\n\nKoena said an hour later, at around 20:00, a 36-year-old man, who was a passenger in a taxi, was shot and killed by unknown assailants at Riverside near Corhana locality on the N2.\n\nKoena said the taxi had been ferrying passengers from Mthatha to Gxulu locality in Libode when it was attacked and both the passenger and the taxi conductor were seriously injured.\n\nShe said they were rushed to Ngangelizwe clinic, where the passenger succumbed to his injuries. The conductor was admitted in a critical condition.\n\nKoena said all three incidents were directly linked to taxi violence, and cases of murder and attempted murder were being investigated.\n\nActing Cluster Commander Brigadier Nomawethu Makonza said the attacks would not be tolerated.\n\n\"We condemn the attacks and murders of people and urge the taxi groups to find ways to resolve their disputes amicably. We appeal to the taxi people to come to us as police when they have a misunderstanding so that we sit together and solve it,\" said Makonza.\n\n\n\n", "description": "Police have launched a multi-disciplinary task team comprising of detectives, crime intelligence and visible policing members to tackle ongoing taxi violence in Mthatha, following at least three murders.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/6752/8ae87b6bcf3746a2a205ac0738f6607d.jpg", "published_at": "2018-03-10"}