{"pub": "fox", "title": "Tiny home residents reduce energy consumption by nearly half, study shows", "url": "https://foxnews.com/real-estate/tiny-home-residents-energy-consumption-study", "language": "en", "published_at": "2019-08-07", "downloaded_at": "2019-09-02 06:59:42.888016+00:00", "text": "Tiny houses are annoyingly cute and wonderfully impractical. They’re also good for you — and everyone else.\n\nTiny house dwellers slashed their energy consumption by nearly half after downsizing, according to a new study by environmental design researcher Maria Saxton.\n\nNEW JERSEY HOME WAS LISTED AT JUST $10, BUT IT CAME WITH A BIG CATCH\n\nIn her doctoral thesis, Saxton surveyed 80 people who had moved from a full-sized home to a “tiny” home for a year or more. She then calculated their ecological footprints, or how much space they need to sustain their current behavior, including housing, transportation, food, goods and services.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nHer research showed that tiny home residents’ average ecological footprint was about 9.5 acres, down from about 17.3 acres for regular-sized homes.\n\nIn other words, tiny home residents reduced their energy consumption by 45 percent.\n\nBetter still, she found that moving into a tiny house had a major impact on a person’s wasteful behavior generally.\n\nFOLLOW US ON FACEBOOK FOR MORE FOX LIFESTYLE NEWS\n\n“As a whole, I found that after downsizing people were more likely to eat less energy-intensive food products and adopt more environmentally-conscious eating habits, such as eating more locally and growing more of their own food,” Saxton writes. “Participants traveled less by car, motorcycle, bus, train and airplane, and drove more fuel-efficient cars than they did before downsizing.”\n\nThey also recycled more and bought less consumer goods.\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\nHere’s to the gnome life.\n\nThis article originally appeared on the New York Post.", "description": "Tiny houses are annoyingly cute and wonderfully impractical.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/iStock-978492230.jpg"}