{"pub": "yahoo", "url": "https://news.yahoo.com/think-america-politics-mess-missed-020146938.html", "downloaded_at": "2019-09-07 13:46:22.572666+00:00", "title": "Think America’s politics are a mess? Here’s what you missed about Brexit in the U.K. this week", "language": "en", "text": "WASHINGTON -- The news this week in American politics was focused on Hurricane Dorian, #SharpieGate, climate change and the ongoing debate over gun control in the wake of several recent mass shootings.\n\nBut things across the pond looked just as messy in the U.K.\n\nBoris Johnson was elected prime minister earlier this summer by the Conservative Party on a pledge to pull the U.K. out of the European Union -- aka \"Brexit\" -- by Oct. 31, the current deadline, even if the U.K. cannot reach a deal with EU about the terms of leaving the bloc.\n\nThis week, parliamentarians successfully challenged this timeline by approving proposed legislation that would force Johnson to request that the EU delay Brexit until Jan. 31 unless a new exit deal is approved by the Halloween deadline – or unless Parliament votes in favor of a \"no-deal\" Brexit.\n\nA week of drama over Brexit\n\nMonday, Parliament returned to session after Queen Elizabeth approved a controversial request by Prime Minister Johnson to suspend the legislative body, a move that restricted the time lawmakers have to try to block the nation from leaving the European Union without an exit deal.\n\nOpposition parties and rebels from Johnson's ruling Conservative Party introduced a bill that would give Johnson until Oct. 19 to reach a deal. If not, he would be required to ask the EU for an extension of the Brexit deadline until Jan. 31.\n\nTuesday, Conservative MP Phillip Lee walked across the aisle to join the Liberal Democrats while Johnson was addressing Parliament, which wiped out Johnson's working majority. The Conservative Party also kicked out Nicholas Soames, Winston Churchill's grandson, after Soames joined some other Conservatives and the opposition parties to vote to open debate on the anti–no-deal bill.\n\nThen, on Wednesday, Johnson referred to Labour Party Leader Jeremy Corbyn as a “chlorinated chicken” and a “big girl’s blouse.”\n\nJohnson faced a double defeat after MPs turned down his motion for a general election, and he is pushing for a new election.\n\nMore: British lawmakers reject Boris Johnson's bid for election after Brexit vote\n\nThe next day, Johnson said he’d rather be “dead in a ditch” than delay Brexit, and Johnson’s brother, Jo, resigned from the government and the Conservative Party.\n\nIt’s been an honour to represent Orpington for 9 years & to serve as a minister under three PMs. In recent weeks I’ve been torn between family loyalty and the national interest - it’s an unresolvable tension & time for others to take on my roles as MP & Minister. #overandout — Jo Johnson (@JoJohnsonUK) September 5, 2019\n\nBoris Johnson also had some dietary advice for Vice President Mike Pence when they met Thursday in London.\n\n\"We’re not too keen on that chlorinated chicken,” Johnson told Pence during a meeting that centered in part on the prospects of a United States-United Kingdom trade deal once Britain leaves the European Union.\n\nMore: Boris Johnson tells Mike Pence the British aren't 'keen' on chlorinated chicken\n\nFinally, on Friday, the anti–no-deal bill was passed by the House of Lords, so it is on track to become law on Monday.\n\nThroughout the week, Jacob Rees-Mogg, the leader of the House of Commons, was memed on Twitter after he was caught lounging during a key Brexit debate.\n\nNext steps are far from clear: for Brexit, for Britain and perhaps for Johnson, who has insisted on taking a \"do or die\" approach to an EU departure.\n\nConfused about Brexit? Here's a brief primer\n\nJune 2016: British public vote to leave the European Union. \"Leave\" side wins by a narrow majority.\n\nMarch 2017: British government formally triggers Article 50, legislation backed by Parliament that gives the E.U. notice it will leave the bloc in two years.\n\nNovember 2018: British Parliament and E.U. leaders agree to tentative withdrawal agreement over the objection of many British lawmakers who worry about how the deal treats the status of the free-trade border between E.U.-member Ireland and North Ireland (part of the United Kingdom) after Brexit.", "description": "Things across the pond have been messy as of late. Here's what you might have missed this week as U.K. politicians wrestle with a timeline for Brexit.", "authors": ["Savannah Behrmann", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/WZI5_I933cBgbb_yD4lqyQ--~B/aD0zNjQ4O3c9NTQ3MjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/5c8680c5f49a043d0f951abb32834217", "published_at": "2019-09-07"}