{"pub": "yahoo", "url": "https://finance.yahoo.com/news/ishares-morningstar-large-cap-value-122712565.html", "downloaded_at": "2019-10-04 13:15:27.485480+00:00", "title": "Should iShares Morningstar Large-Cap Value ETF (JKF) Be on Your Investing Radar?", "language": "en", "text": "Designed to provide broad exposure to the Large Cap Value segment of the US equity market, the iShares Morningstar Large-Cap Value ETF (JKF) is a passively managed exchange traded fund launched on 06/28/2004.\n\nThe fund is sponsored by Blackrock. It has amassed assets over $490.68 M, making it one of the average sized ETFs attempting to match the Large Cap Value segment of the US equity market.\n\nWhy Large Cap Value\n\nCompanies that find themselves in the large cap category typically have a market capitalization above $10 billion. Overall, they are usually a stable option, with less risk and more sure-fire cash flows than mid and small cap companies.\n\nValue stocks are known for their lower than average price-to-earnings and price-to-book ratios, but investors should also note their lower than average sales and earnings growth rates. While value stocks have outperformed growth stocks in nearly all markets when you consider long-term performance, growth stocks are more likely to outpace value stocks in strong bull markets.\n\nCosts\n\nSince cheaper funds tend to produce better results than more expensive funds, assuming all other factors remain equal, it is important for investors to pay attention to an ETF's expense ratio.\n\nAnnual operating expenses for this ETF are 0.25%, putting it on par with most peer products in the space.\n\nIt has a 12-month trailing dividend yield of 2.86%.\n\nSector Exposure and Top Holdings\n\nEven though ETFs offer diversified exposure that minimizes single stock risk, investors should also look at the actual holdings inside the fund. Luckily, most ETFs are very transparent products that disclose their holdings on a daily basis.\n\nThis ETF has heaviest allocation to the Financials sector--about 23.20% of the portfolio. Consumer Staples and Healthcare round out the top three.\n\nLooking at individual holdings, Jpmorgan Chase & Co (JPM) accounts for about 5.88% of total assets, followed by Procter & Gamble (PG) and Exxon Mobil Corp (XOM).\n\nThe top 10 holdings account for about 39.28% of total assets under management.\n\nPerformance and Risk\n\nJKF seeks to match the performance of the Morningstar Large Value Index before fees and expenses. The Morningstar Large Value Index measures the performance of stocks issued by large-capitalization comp that have exhibited value characteristics.\n\nThe ETF has added about 13.13% so far this year and it's up approximately 1.32% in the last one year (as of 10/03/2019). In the past 52-week period, it has traded between $91.27 and $111.54.\n\nThe ETF has a beta of 0.91 and standard deviation of 11.84% for the trailing three-year period, making it a medium risk choice in the space. With about 84 holdings, it effectively diversifies company-specific risk.\n\nAlternatives\n\nIShares Morningstar Large-Cap Value ETF carries a Zacks ETF Rank of 3 (Hold), which is based on expected asset class return, expense ratio, and momentum, among other factors. Thus, JKF is a sufficient option for those seeking exposure to the Style Box - Large Cap Value area of the market. Investors might also want to consider some other ETF options in the space.\n\nThe iShares Russell 1000 Value ETF (IWD) and the Vanguard Value ETF (VTV) track a similar index. While iShares Russell 1000 Value ETF has $38.11 B in assets, Vanguard Value ETF has $47.87 B. IWD has an expense ratio of 0.19% and VTV charges 0.04%.\n\nBottom-Line\n\nWhile an excellent vehicle for long term investors, passively managed ETFs are a popular choice among institutional and retail investors due to their low costs, transparency, flexibility, and tax efficiency.\n\nTo learn more about this product and other ETFs, screen for products that match your investment objectives and read articles on latest developments in the ETF investing universe, please visit Zacks ETF Center.\n\n\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n\n\niShares Morningstar Large-Cap Value ETF (JKF): ETF Research Reports\n\n\n\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\n\n\n\nVanguard Value ETF (VTV): ETF Research Reports\n\n\n\niShares Russell 1000 Value ETF (IWD): ETF Research Reports\n\n\n\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\n\n\n\nProcter & Gamble Company (The) (PG) : Free Stock Analysis Report\n\n\n\nTo read this article on Zacks.com click here.\n\n\n\nZacks Investment Research", "description": "Style Box ETF report for JKF", "authors": ["Zacks Equity Research"], "top_image": "https://s.yimg.com/uu/api/res/1.2/IMWh8FzmMfDR3ybEymuGTw--~B/aD02NzU7dz05MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/670d1917693293f70179651625deb88f", "published_at": "2019-10-03"}