{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7499541/Links-colours-emotions-universal-study-finds.html", "downloaded_at": "2019-10-05 08:47:07.348639+00:00", "title": "Links between colours and emotions are often universal, study finds", "language": "en", "text": "Colours may be universally associated with certain emotions, a study has found.\n\nRed is pinned to love or anger, blue to sadness or black to death, and similar links appear to exist in other parts of the world.\n\nEven where colours weren't solidly attributed to a single emotion, nearly all of them were either mostly good or mostly bad regardless of where people lived.\n\nBut on a smaller, more detailed scale there were nuances which researchers said they could use to predict which country someone came from.\n\nThe 711 people who took part in the study were asked to rate how strongly, on a scale of one to five, a colour made them feel certain emotions\n\nAlmost all the colours, even if they didn't have a solid link to one emotion, were either overwhelmingly good or bad – with the exception of red, which was linked to both anger and love, and purple and brown, which were neither. Positive colours were yellow, white, turquoise, pink, orange and green. Negative were grey and black\n\nScientists from the universities of Auckland, Lausanne in Switzerland and Johannes Gutenber in Mainz, Germany carried out their research on 711 people.\n\nThe participants all came from either the UK, Germany, Greece or China, and answered to rate how colours made them feel.\n\nThe colours included in the study were white, black, grey, red, yellow, green, blue, orange, purple, pink, brown and turquoise.\n\nThey were shown to people in word form rather than images because the study was done online and researchers need to be sure screens were showing the same.\n\nAnd people ranked how closely they linked them to the following emotions: anger, interest, amusement, pride, joy, pleasure, contentment, admiration, love, relief, compassion, sadness, guilt, regret, shame, disappointment, fear, disgust, contempt or hate.\n\nThe researchers, led by Johannes Gutenber University's Dr Daniel Oberfeld, wrote: 'Red is associated with both positive and negative emotions while black is unambiguously associated with negative emotions.\n\n'In the current study, red was often associated with love and anger, while blackwas associated with sadness, hate and fear among other negative emotions.'\n\nOther colours which had strong associations across countries were pink with love, grey with disappointment or sadness and orange with joy or pleasure.\n\nSome other colours, however, had more nuanced associations.\n\nFor example, people in Greece were far more likely to associate turquoise with relief and purple with sadness than those in other countries.\n\nWhile people in the UK and Germany strongly associated yellow with joy, but Greek and Chinese people did not feel the same link.\n\nAlmost all the colours, even if they didn't have a solid link to one emotion, were either overwhelmingly good or bad – with the exception of red, which was linked to both anger and love, and purple and brown, which were neither.\n\nPositive colours were yellow, white, turquoise, pink, orange and green. Negative were grey and black.\n\nBlack and red were the colours with the strongest emotion associations – black was linked tightly to sadness and fear, while red was linked to love and anger\n\nSome colours had more general associations: green was overwhelmingly positive but not tied to a single emotion, while yellow had a niche link to joy which was seen most strongly in the UK and Germany (second and third levels) but not in Greece or China\n\nDr Oberfeld's team added: 'Particularly strong colour-emotion associations were observed for red, black, and pink, and particularly weak associations were observed for brown and purple.\n\n'Across the 240 colour–emotion pairs, the strongest association was found between the emotion love and the colour term red.\n\n'Here, the bar chart shows that if this association was reported, it tended to be strong, that is, the rating category 5... was most frequently selected.'\n\nThe research was published in the journal Royal Society Open Science.", "description": "Researchers from universities in Auckland, Lausanne in Switzerland and Mainz, Germany surveyed 711 people from the UK, Germany, Greece and China to see how colours affected them.", "authors": ["Sam Blanchard For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/24/17/18878384-0-image-a-36_1569344015487.jpg", "published_at": "2019-09-24"}