{"pub": "investing.com", "url": "https://ng.investing.com/news/economy/japan-boosts-clo-scrutiny-as-banks-buy-billions-of-risky-assets-47010", "downloaded_at": "2019-09-09 07:00:31.923458+00:00", "title": "Japan Boosts CLO Scrutiny as Banks Buy Billions of Risky Assets", "language": "en", "text": "(Bloomberg) -- Japanese regulators are surveying the nation’s financial firms to determine their exposure to foreign assets including risky credit products as the global economy slows, people with knowledge of the matter said.\n\nThe Bank of Japan and Financial Services Agency want to get a fuller picture of domestic banks’ and insurers’ investments in collateralized loan obligations and leveraged loans to assess how they would fare if the borrowers run into difficulties, the people said, asking not to be identified.\n\nThe U.S.-China trade war and ensuing slowdown are adding to pressure on Japanese policy makers to examine where risks lurk in the financial system and consider how to respond if stresses emerge. The joint research also underscores how officials are trying to assess the effects of Japan’s more than six years of unprecedented monetary stimulus.\n\nNegative interest rates at home have prompted institutions to seek higher returns abroad, raising concerns about their vulnerability to swings in global financial markets. UBS Group AG has estimated that local banks may have soaked up a third of new top-rated U.S. CLOs issued in recent years.\n\nRead a QuickTake on the risky U.S. loans that Japan’s banks adore\n\nStill, there’s a dearth of public data on the exact scale of exposure following the recent surge in buying. The survey will allow the BOJ to access information on the holdings of insurers, which the FSA has the authority to request, the people said. While banks already disclose their holdings of securitized products in various forms, standardizing the data will give regulators a more coherent picture, they said.\n\n“We see the importance of closer coordination with the Financial Services Agency for macro and micro prudence,” said Makoto Kasai, a senior official at the Bank of Japan’s financial system department.\n\n“As there are various reports on overseas credit investment and lending activities by Japanese financial institutions, it’s vital to share the accurate understanding of the financial system by reporting detailed information based on actual facts as Japanese authorities,” Kasai said.\n\nYoshitaka Wada, a spokesman at the FSA, declined to comment.\n\nIn the absence of Japanese government figures on financial firms’ leveraged loan holdings, analysts have been relying on corporate filings and other sources. Researchers at UBS used evidence from clients and analysis of the cross-currency basis swap market to make their calculations last year.\n\nAnalysts have also turned to a Bank of England report, which last year contained a table suggesting Japanese banks held about 10% of the $750 billion global CLO market in 2017. That number has probably since risen, given that agricultural lender Norinchukin Bank alone had 8 trillion yen ($75 billion) of the instruments in June.\n\nThe Bank of Japan may publish part of the survey results if needed, some of the people said. Authorities may also use the findings to inform the Financial Stability Board, a Basel, Switzerland-based body that monitors the global financial system and is also examining banks’ exposure to leveraged loans, one of the people said.\n\nThe FSA has been questioning banks including Norinchukin, Japan Post Bank Co. and Mitsubishi UFJ Financial Group Inc. on how they manage risks tied to their CLO portfolios, officials from the regulator told Bloomberg earlier this year.", "description": "Japan Boosts CLO Scrutiny as Banks Buy Billions of Risky Assets", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/pic426f9a7ad1496eca625391eed9905b0c.jpg", "published_at": "2019-09-09"}