{"pub": "yahoo", "url": "https://finance.yahoo.com/news/retirement-earnings-recession-proof-100008590.html", "downloaded_at": "2019-09-13 11:14:41.869522+00:00", "title": "How to make your retirement earnings recession-proof", "language": "en", "text": "All this recession talk isn't going away, with manufacturing weakness joining the inverted yield curve and other indicators pointing to a possible downturn. Recessions can be tough on everyone, but they can be especially difficult for people saving up for retirement — or trying to live through it.\n\nWe aren't in a recession yet and might not be for many more months, possibly years. But it's wise for retirees and those saving for retirement to ponder some key questions while the economic backdrop remains favorable.\n\nWould a recession affect the strategy of investing Social Security benefits?\n\nThis strategy rests on the notion of collecting Social Security benefits starting at 62 or shortly thereafter, rather than waiting until a later age. The downside of collecting early is that you would lock in smaller monthly payments compared to waiting, but the upside is that you would collect more payments.\n\nBack to school: Are parents tapping college savings in 529 plans for private K-12 tuition?\n\nMoney trolls: Why are we so judgmental about other people's finances?\n\nSocial Security benefits increase by roughly 8% annually for each year you wait. So if you don't spend those early checks and invest that money profitably, you could fare well.\n\nThat's the idea anyway, but it's tricky to accomplish.\n\nYou would need the discipline not to spend those early Social Security benefit payments. Plus, you would want your investment portfolio to generate solid returns — 8% annually is a good target — but gains that high could be elusive, especially amid the stock-market turbulence that would accompany any recession.\n\nJonathan Clements, editor of HumbleDollar.com, said he's extremely skeptical that most people would be able to implement the strategy successfully.\n\n\"Claiming benefits early to buy stocks might make sense if you're a retiree who keeps 100% in the stock market,\" said Clements, who cited the strategy in a recent blog. \"But I've yet to meet any retiree who's a 100% stock-market investor.\"\n\nRather, people who claim Social Security early mostly do so either because they need the money to live on or hate the idea that they might die before recouping all that they paid into the system, Clements said.\n\nThe investment strategy, he thinks, is often just used as a justification to start collecting early.\n\nIs it better to withdraw from certain accounts?\n\nRecessions often are times when people must lean on their investment portfolio to make ends meet. For tax and other reasons, certain accounts are better to tap than others.\n\nFor example, if you're collecting Social Security, withdrawing money from a traditional IRA or 401(k) account could push some of your benefits into the taxable category. By contrast, if you have money in a Roth IRA, the proceeds typically come out tax-free — and wouldn't make your Social Security income taxable.\n\nIf you're not collecting Social Security you don't need to worry about this, but there could be other tax landmines. For example, taking a loan from your workplace 401(k) account can be a quick, easy means of accessing part of your balance, and no taxes are due if you pay the money back. However, taxes apply if you can't or don't repay the loan.\n\nCashing out of 401(k) plans when leaving jobs, with loans outstanding or not, is one of the major reasons for \"leakage,\" or premature removal of money from retirement plans.\n\nAs another example, cash accessed as a permanent withdrawal from an IRA or 401(k), while you remain employed, normally would trigger taxes and possibly a 10% penalty if you're under 59 1/2. Yet the Internal Revenue Service lists 18 exceptions to this 10% penalty rule, and some differ depending on whether the account is an 401(k) or IRA.\n\nThe point here is that tapping into retirement accounts can be complex, with numerous tax wrinkles. The best strategy is not to touch this money if possible. The next best strategy is to review the implications of loans and withdrawals before the need arises.\n\nShould you stop contributions to a 401(k) plan or IRA?\n\nThere's no requirement to stop contributing, provided you remain employed with work-related income, but circumstances might dictate stopping if you don't plan ahead. For example, the money flowing into 401(k) plans peaked prior to the Great Recession in 2007 and has never fully recovered, according to data compiled by the Investment Company Institute.\n\nStory continues", "description": "It's wise for retirees and those saving for retirement to ponder some key questions while the economic backdrop remains favorable.", "authors": ["Russ Wiles", "Arizona Republic"], "top_image": "https://s.yimg.com/os/mit/media/p/common/images/favicon_new-7483e38.svg", "published_at": "2019-09-12"}