{"pub": "cbs", "url": "https://cbsnews.com/news/nba-pandering-trump-mocks-steve-kerr-gregg-popovich-over-response-nba-china-standoff-2019-10-10", "downloaded_at": "2019-10-11 00:21:24.487318+00:00", "title": "Trump mocks Steve Kerr and Gregg Popovich over response to NBA-China standoff", "language": "en", "text": "President Trump mocked two of his frequent critics, NBA head coaches Steve Kerr and Gregg Popovich, because of their responses to the ongoing standoff between the league and China. Mr. Trump also accused them and the NBA of \"pandering to China\" after the league scrambled to address the aftermath of a deleted tweet from Houston Rockets general manager Daryl Morey that supported the human rights protests in Hong Kong.\n\nAfter an executive bill signing Wednesday, Mr. Trump responded to a question about China applying pressure to the NBA and went directly after Kerr, the Golden State Warriors coach. \"I watch this guy Steve Kerr,\" Mr. Trump said. \"And he was like a little boy, he was so scared to be even answering the question.\"\n\n\"He couldn't answer the question,\" he added. \"He was shaking \"Oh, I don't know, I don't know.\" He didn't know how to answer the question. And yet he'll talk about the United States very badly.\" He also brought up Popovich's response, but said \"he didn't look quite as scared.\"\n\nMr. Trump also took aim at the league at large. \"I watch the way that Kerr, Popovich, and some of the others were pandering to China and yet to our own country, they don't - it's like they don't respect it,\" Mr. Trump said.\n\nFrom gun control to immigration, Kerr and Popovich are typically outspoken about social issues in the United States. However, when asked about the controversy Monday, Kerr said it was a \"bizarre international story\" and vowed to read up on it before commenting.\n\nSan Antonio Spurs Gregg Popovich, who served in the Air Force, avoided talking about the controversy and instead praised NBA commissioner Adam Silver's handling of the situation. Silver defended Morey's right to free speech and said he is \"supported in terms of his ability to exercise his freedom of expression.\"\n\nOver the weekend, Morey's now-deleted tweet drew intense criticism in China, potentially risking billions of dollars worth of business with the NBA. China's national broadcaster CCTV announced it would no longer air the two NBA preseason games set to take place in China and is looking into their future relationship with the league.\n\nThe NBA said the number of pro basketball fans in China is twice the U.S. population. The NBA also has a $1.5 billion deal with a Chinese streaming company.", "description": "\"I watch this guy Steve Kerr. And he was like a little boy, he was so scared to be even answering the question,\" Trump said", "authors": ["Christopher Brito"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/10/10/bcbf7511-c9bb-4d2e-9f28-0c22e531f0b9/thumbnail/1200x630/3825098328df8b7fadfe9c2bfa9257c8/gettyimages-1174749963.jpg", "published_at": "2019-10-10"}