{"pub": "realclearpolitics", "url": "https://usatoday.com/story/news/nation/2019/10/01/dallas-jury-deliberating-fate-cop-who-mistakenly-killed-neighbor/3828562002", "downloaded_at": "2019-10-02 00:33:49.397698+00:00", "title": "Guilty verdict: Dallas ex-cop Amber Guyger convicted of murder in neighbor's shooting", "language": "en", "text": "CLOSE A former Dallas police officer has been found guilty of murder after fatally shooting a neighbor she thought was an intruder. Wochit\n\nA former Dallas police officer who fatally shot a black neighbor she mistook for an intruder was convicted of murder Tuesday and could face life in prison.\n\nAmber Guyger, who is white, had testified that she was exhausted from an extended shift when she walked into the apartment of Botham Jean thinking it was her own. Guyger said she believed Jean, 26, was a burglar and shot him in self-defense.\n\nBut prosecutor Jason Hermus said Guyger should have known she was in the wrong apartment and was distracted by a phone call with a lover. Jean, an accountant from St. Lucia, never posed a threat to Guyger and was eating a bowl of ice cream in his living room when she walked in on Sept. 6, 2018, Hermus said.\n\nGuyger, 31, is facing five to 99 years in prison. The jury, which took only hours to render the verdict after six days of testimony, went into the punishment phase of the trial Tuesday afternoon. It's not clear how long it will take the jurors to decide on the sentence. The trial has recessed for the day.\n\nAllison Jean, Botham Jean's mother, was among those who testified at the punishment phase, telling the jury about the impact of losing her son shortly before he was to turn 27.\n\n“My life has not been the same,'' she said. \"It’s just been like a roller coaster. I can’t sleep, I cannot eat. It’s just been the most terrible time for me.”\n\nGuyger’s defense lawyers may argue that she deserves a light sentence because she acted out of sudden fear and confusion. However, their case might become harder to make after prosecutors in the afternoon session showed the jury text messages from Guyger's cellphone that hint at insensitivity toward black people.\n\nThe messages, accepted as evidence over defense objections, include an exchange from Jan. 15, 2018, when she was working security during the Martin Luther King Jr. Day parade in Dallas.\n\nGuyger complained about the parade possibly taking three hours, suggested participants could be pushed or pepper sprayed, and when asked when the parade would be over, texted back, “When MLK is dead … Oh, wait …”\n\nCheers erupted in the courthouse as the verdict was announced, while Jean's relatives and others embraced and someone yelled “Thank you, Jesus!”\n\nIn the hallway outside the courtroom, a crowd celebrated and exclaimed, “Black lives matter.''\n\nGuyger sat alone, weeping, at the defense table.\n\nThe case, one in a string of episodes of white police officers killing unarmed black men, drew national attention and was closely followed in the Dallas area, where some feared mass protests if Guyger had been acquitted.\n\nThe Rev. Frederick Haynes, senior pastor at Friendship-West Baptist Church and a longtime African American leader in Dallas, told the Dallas Morning News he was relieved and surprised when he heard the verdict.\n\n“Given the history in this country it is surprising,” Haynes said. “I would have been shocked if she’d been found not guilty. The message here is ‘justice for all’ and not just for some.”\n\nThe Morning News reported that city officials expected demonstrations regardless of the verdict.\n\n“I have watched our city become divided in this conversation over the past year, and I’m really hopeful that this verdict and justice will help us ... move forward as a united city,” Dallas City Council member Adam Bazaldua told the newspaper.\n\nThe jury that convicted Guyger was largely made up of women and people of color.\n\nBotham Jean, shown speaking at Harding University in Arkansas in a 2014 photo, was shot to death by an off-duty police officer and neighbor who said she mistook him for an intruder. (Photo: Jeff Montgmery/Harding University via AP)\n\nLee Merritt, one of the lawyers representing Jean's family, said the guilty verdict will have implications well beyond Dallas, helping change policing culture globally.\n\nWake Forest University law professor Kami Chavis, a former assistant U.S. attorney who specializes in police accountability, is not so sure. She said the unique circumstances of the case and other factors make it difficult to conclude this will be a turning point in the relationship between police and communities of color.\n\n\"While there is certainly a victory in this case and justice for the Jean family, the confluence of racial stereotypes, racial profiling and police use of aggressive tactics is a challenge in confronting police brutality,'' Chavis said.\n\nThe jury began deliberations Monday afternoon and reached the verdict shortly after returning to court on Tuesday morning.\n\nGuyger said she had parked on the wrong level of her apartment building's parking garage by mistake and walked down a corridor to the apartment directly above hers, thinking it was her own. She became worried when she noticed the door was unlocked, she said.\n\nFired Dallas police Officer Amber Guyger becomes emotional as she testifies in her murder trial on Sept. 27, 2019. (Photo: Tom Fox, The Dallas Morning News, via AP)\n\nHermus said that was when Guyger should have called for backup. Instead, Guyger testified that she feared for her safety when she spotted Jean in the dark apartment, thinking he was a burglar. She said she shot him with her service gun when he failed to obey her command to put his hands up.\n\nDefense lawyer Toby Shook told the jury that Guyger had to make a split-second decision and that Jean's death was the result of “a series of horrible mistakes.’’\n\nGuyger called 911 after the shooting. She can be heard apologizing to Jean – and saying “I’m gonna lose my job” and “I am going to need a supervisor\" in the six-minute recording.\n\nGuyger was arrested days after the shooting and subsequently fired by the Dallas Police Department. The jury was asked to decide whether Guyger was guilty of murder, a lesser crime such as manslaughter or whether she should be acquitted.\n\nDuring her testimony last week, the first time she spoke publicly about that night, Guyger wept as she expressed remorse for the killing.\n\n“I hate that I have to live with this every single day of my life and I ask God for forgiveness, and I hate myself every single day,” Guyger said as she looked across the courtroom at Jean’s family. “I wish he was the one with the gun and he killed me.\"\n\nContributing: The Associated Press\n\nRead or Share this story: https://www.usatoday.com/story/news/nation/2019/10/01/dallas-jury-deliberating-fate-cop-who-mistakenly-killed-neighbor/3828562002/", "description": "Former Dallas police officer Amber Guyger was found guilty in the murder trial of Botham Jean, her neighbor she thought was in her apartment", "authors": ["Jorge L. Ortiz", "John Bacon", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/27/USAT/6c549c42-9df3-4ef6-a763-58a927e7ecae-AP_Dallas_Officer_Mistaken_Apartment.JPG?crop=5968,3357,x0,y402&width=3200&height=1680&fit=bounds", "published_at": "2019-10-01"}