{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7576151/Cuba-Gooding-Jr-arrives-court-arraigned-second-time.html", "downloaded_at": "2019-10-15 16:54:54.939027+00:00", "title": "Cuba Gooding Jr. hands himself in to police ahead of second arrangement", "language": "en", "text": "Cuba Gooding Jr. handed himself in to police on Tuesday morning ahead of his arraignment on new, sealed charges relating to a 2018 incident.\n\nThe actor is already facing groping and sexual abuse charges for allegedly touching a woman's breast in a Manhattan nightclub in June.\n\nLast week, when he arrived at court for potential jury selection in that case, he was hit with a grand jury indictment on a separate incident which took place in 2018.\n\nIt remained sealed for days and will only be made public after the actor's hearing on Tuesday.\n\nSince then, another three women have spoken to NYPD detectives alleging other incidents of sexual assault.\n\nCuba Gooding Jr. raises his eyebrows as he sits in court last Thursday. He had shown up for his forcible touching trial but was hit with new charges in a sealed, grand jury indictment\n\nCuba Gooding Jr's lawyer Mark Heller speaking outside the court, while he was being processed, on Tuesday ahead of his arraignment\n\nOn Tuesday morning, his lawyer Mark Heller said he 'surrendered' himself to the NYPD before going to court.\n\n'Cuba has just surrendered to the police and he will be processed and shortly be brought up for the arraignment.\n\n'Cuba has just surrendered to the police and he will be processed and shortly be brought up for the arraignment.\n\n'On the eve of the criminal case trial, they indicted Mr Gooding Jr and they moved this case to the Supreme Court where we will be appearing today.\n\n'They were not prepared to move forward, by doing so, they prolonged the case and were able to start all over again today in the supreme court.\n\n'We are completely confident that there will be no criminal conviction of Cuba Gooding Jr. He is certainly innocent of the allegations that will be rpesented today before the court.\n\nTHE ALLEGATIONS June 2019 Gooding Jr. has been charged with forcible touching and sexual abuse - both misdemeanors - for allegedly touching a woman's breast in a nightclub in Manhattan this June. He denies it. October 2018 The sealed grand jury indictment is reportedly connected to a different incident, in October last year, but it remains secret. Three additional women Three other women have reportedly told the NYPD that Gooding Jr. groped them but he has not been charged or arrested in any of those cases\n\n'We're going to ask that the court send this case out today to trial. These criminal proceedings are long and while that happens, the defendant's life is put on hold.\n\n'I feel four months is far too long a period of time to put a person like Cuba's life on hold,' he said.\n\nThe alleged attacks in Manhattan bars and restaurants date back to 2008 and show a 'pattern' of behavior, one official told The New York Post.\n\nThe new charges remain under seal but they are expected to be made public imminently.\n\nGooding Jr., 51, was arrested in June after the 29-year-old woman, who has not been named, phoned police claiming that he grabbed her breast in front of his girlfriend while he was drunk at the Magic Hour Rooftop Bar in Manhattan.\n\nShe alleged that Gooding Jr. groped her in front of his girlfriend, Claudine De Niro, and that he also felt her leg.\n\nHe has always denied it, saying that she tried to come on to him and called the police when he rejected her.\n\nSurveillance footage shows Gooding Jr. stroking his accuser's leg and appearing to lean over his girlfriend, who was sitting between them, and reaching his hand toward her chest at the Magic Hour Rooftop in Manhattan in June this year\n\nLast week, Gooding Jr. was the second defendant called by Judge Herb Moses after a different case.\n\nHe said nothing and did not react strongly when the new indictment was referred to.\n\nIt remains unclear whether or not his lawyers knew it was coming.\n\nThe District Attorney filed it shortly before the case was called.\n\nThey previously alleged in court documents that the original accuser approached him and his girlfriend when they were sitting at a table in the club and that he asked her to leave them alone.\n\nThey also alleged that police were called to the scene that night and after reviewing 45 minutes of footage, found nothing incriminating.\n\nHowever prosecutors decided to push ahead with the case afterwards.\n\nSurveillance footage of the incident, in which the actor is seen stroking the alleged victim's thigh and then reaching over towards her chest, is likely to be submitted into evidence.\n\nThe grand jury indictment came as a surprise last week.\n\nThe actor's attorneys said it was a 'stalling' tactic by the district attorney's office, designed to delay the original trial.", "description": "The actor is already facing groping and sexual abuse charges for allegedly touching a woman's breast in a Manhattan nightclub in June. He was hit with a sealed grand jury indictment last week.", "authors": ["Jennifer Smith For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/17/19545154-0-image-a-23_1571156447321.jpg", "published_at": "2019-10-15"}