{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7596847/Speaker-John-Bercow-BLOCKS-fresh-bid-Brexit-deal-vote.html", "downloaded_at": "2019-10-21 15:15:29.221881+00:00", "title": "Speaker John Bercow BLOCKS fresh bid for Brexit deal vote", "language": "en", "text": "brexit countdown_bg Created with Sketch.\n\nSpeaker John Bercow today sparked fury by blocking Boris Johnson's latest bid to trigger a vote on his Brexit deal.\n\nMPs denied the PM 'in principle' approval for his deal over the weekend, instead postponing the showdown and obliging him to ask the EU for an extension.\n\nA fresh effort to stage the vote was turned down by Mr Bercow this afternoon, despite Tories accusing him of 'sabotage' to stop Brexit and branding him a 'poor man's Cromwell'.\n\nHe insisted the 'meaningful' vote would break the Commons convention against asking MPs the same question twice in quick succession.\n\n'It is clear that the motions are in substance the same,' he said. 'The motion will not be debated today as it would be repetitive and disorderly to do so.'\n\nBut senior Tory Bernard Jenkin was among those who protested about the ruling in the House. While admitting Speakers cannot always please everyone, he jibed: 'It is becoming remarkable how often you please one lot and not the other lot.'\n\nA visibly angry Mr Bercow shot back that he made 'no apology' for his decision, saying he had granted numerous debates and urgent questions to MPs of a 'Eurosceptic disposition' over the years.\n\nThe refusal means the moment of truth on Mr Johnson's deal has again been delayed, with legislation expected to be published later before key votes due tomorrow.\n\nMinisters now believe they have the numbers to force the package through with support from around 15 Labour MPs, after three years of bitter wrangling and delays.\n\nWhat happens next in the Brexit crisis? Today: Boris Johnson will try again to force a 'meaningful' vote on his new deal. But Speaker John Bercow is set to block it. The Withdrawal Agreement legislation will be published. Tomorrow: Potentially the most critical day for the Brexit deal. Debate on the WA legislation will begin in the Commons, with crucial second reading votes expected in the evening. If the Bill is torpedoed at this point, the Brexit process will be back to square one. The programme motion will also need to be approved, setting out the timetable for legislation being passed, if Mr Johnson is to have much chance of getting Brexit through for October 31. Wednesday-Friday: Assuming the second reading is successful, detailed scrutiny will be carried out in the Commons and the Lords. There could be votes on amendments calling for customs union membership and a second referendum. October 28: The EU has suggested an emergency summit could be held on this date to consider a Brexit extension if the deal has not gone through Parliament.\n\nWestminster is bracing for 'Hell Week' as the PM tries to finalise the law at breakneck speed, with threats of all-night sittings.\n\nBut Jeremy Corbyn and other opposition parties could yet team up to wreck the process, with 'guerrilla warfare' plots to trigger votes on a second referendum and the whole UK staying in the EU customs union.\n\nNo10 delivered a stark message that such fundamental changes would effectively kill the deal - which needs to be 'ratified' by Parliament, EU leaders and the European Parliament.\n\n'Essentially if the legislation in the House of Commons steps too far away from what was agreed on in the Withdrawal Agreement and political declaration, that would bring into question ratification,' a spokesman said.\n\nTrade Secretary Liz Truss today warned that undermining the painstakingly-assembled deal with Brussels would put the country 'back to square one'.\n\nThere were signs this afternoon that MPs who previously supported a customs union - defeated by just three votes when Theresa May was PM - will not be on board this time around.\n\nFormer Cabinet minister Damian Green said it was an issue for 'the next stage of negotiations' rather than now.\n\nA government source said they were not holding out much hope of the Speaker agreeing to the vote today.\n\n'Experience tells us that Bercow will take any opportunity to grandstand,' they said.\n\nTory MP Nigel Evans told MailOnline such interfering by Mr Bercow would be 'appalling sabotage'.\n\n'He is procedurally creative towards Remainers in tearing up the rule book, yet if he blocks this he is donning his Remain strip and taking a penalty for his team,' he said.\n\n'It would be appalling not to give MPs a chance to say whether in principle they back this deal.'\n\nFellow Conservative David Morris compared Mr Bercow to Oliver Cromwell - who seized unprecedented power after Charles I was executed.\n\n'He is a poor man's Cromwell. He will try and stop it. He should go right now and stop imposing his will on the people of Britain,' he said.\n\nThe Prime Minister (pictured left in the Commons on Saturday) is planning late-night sittings in the Commons and a special weekend session in the Lords as he attempts to pass the Withdrawal Agreement Bill. But Speaker John Bercow (right) has blocked a 'clean' vote today on whether to approve the deal in principle\n\nJeremy Corbyn (pictured today) and other opposition parties could yet team up to wreck the process, with 'guerrilla warfare' plots to trigger votes on a second referendum and the whole UK staying in the EU customs union.\n\nHowever the DUP indicated it would vote against a customs union amendment, with MP Jim Shannon saying: 'We are clear where we stand on the customs union as something that we cannot support and will not support, and I believe that that will be the stance we will have later on when we see the wording,'\n\nThe Prime Minister will publish the Bill later, paving the way for the Commons to start voting on it tomorrow.\n\nThe premier's chances of getting the implementation law through in time for the UK to leave the EU by his 'do or die' date of October 31 are likely to hang on whether he can get support for a 'programme motion' - which will dictate a tight schedule for the stages in Parliament.\n\nFury as Labour pushes for second referendum and customs union Ministers are pleading for MPs not to take the Brexit process 'back to square one' by backing a second referendum or EU customs union membership. Labour's Keir Starmer warned yesterday that opposition MPs are preparing dozens of amendments to the new EU Withdrawal Bill that could effectively wreck the legislation. He said the party would order its MPs to support efforts on forcing a second referendum; on staying in the customs union; and on blocking No Deal if trade talks fail by the end of the transition period. A No 10 source said Labour should come clean: 'Do MPs want to respect the referendum like they claim to and leave the EU with a good new deal on October 31? 'Or, as with Labour's torturous policies on a customs union or a second referendum, do they want to frustrate and cancel Brexit altogether?' The support of the DUP could allow the customs union amendment to pass. Its Brexit spokesman Sammy Wilson yesterday warned Mr Johnson the votes of its MPs were 'crucial on the issue of Brexit'. He said the DUP 'does not seek a second referendum' but a Brexit where the UK leaves 'as one nation'. This opened the door to supporting the plan to keep the whole of the UK in the customs union, rather than creating separate arrangements for Northern Ireland. Brexiteers oppose the move because it would restrict Britain's ability to strike independent trade deals. Trade Secretary Liz Truss today warned that undermining the painstakingly-assembled deal with Brussels would put the country 'back to square one'.\n\nUsually it takes weeks for pieces of legislation to go through but ministers are desperate to get the deal into law ahead of a planned EU summit next Monday on whether to have another Brexit delay.\n\nMr Johnson is planning late-night sittings in the Commons and a special weekend session in the Lords as he attempts to pass the Withdrawal Agreement Bill.\n\nBut Keir Starmer warned that opposition MPs were preparing dozens of amendments that could effectively wreck the legislation.\n\nLabour's Brexit spokesman said the party would order its MPs to support efforts on forcing a second referendum; on staying in the customs union; and on blocking No Deal if trade talks fail by the end of the transition period.\n\nA No 10 source said Labour should come clean: 'Do MPs want to respect the referendum like they claim to and leave the EU with a good new deal on October 31?\n\n'Or, as with Labour's torturous policies on a customs union or a second referendum, do they want to frustrate and cancel Brexit altogether?'\n\nThe support of the DUP could allow the customs union amendment to pass. Its Brexit spokesman Sammy Wilson yesterday warned Mr Johnson the votes of its MPs were 'crucial on the issue of Brexit'.\n\nHe said the DUP 'does not seek a second referendum' but a Brexit where the UK leaves 'as one nation'. This opened the door to supporting the plan to keep the whole of the UK in the customs union, rather than creating separate arrangements for Northern Ireland.\n\nBrexiteers oppose the move because it would restrict Britain's ability to strike independent trade deals.\n\nSir Keir yesterday suggested Labour and the DUP could work together. Speaking on the BBC's Andrew Marr Show, he said: 'I would openly invite the DUP to talk to us.\n\n'If you want to work with us to improve the situation we're in, our door is open to that discussion.'\n\nSome of 21 rebel former Tories, including former chancellors Philip Hammond and Ken Clarke, could back the customs union plan. Mr Clarke tabled a similar proposal that was narrowly by just three votes in April.\n\nGloria De Piero, a Labour MP who Mr Johnson had hoped would back his deal, also signalled her support.\n\nShe tweeted: 'A customs union amendment is what I'll be working for. I am convinced we can get majority support for it. It would enable us to stay true to the Labour manifesto every Labour MP was elected on.'\n\nDespite the manoeuvring, Foreign Secretary Dominic Raab yesterday said the Government was confident that it could now get Mr Johnson's Brexit deal through Parliament.\n\nSpeaking on the BBC's Andrew Marr Show, he said the Prime Minister had managed to negotiate 'a deal that can pass through the House of Commons'.\n\nHe added: 'We seem to have the numbers in the House of Commons. A lot of people say 'get this done and move on'.'\n\nDowning Street last night said it was determined to get the Bill through so it could rescind the letter that Parliament forced the Prime Minister to send to Brussels asking for a Brexit extension.\n\nA No 10 source said: 'We cannot allow Parliament's letter to lead to Parliament's delay – we must leave on October 31 and finally get Brexit done. The best way of doing this is for MPs to vote for Boris's new deal.'\n\nMaverick No10 Dominic Cummings was in Downing Street today as the wrangling continued\n\nIt is expected the Withdrawal Agreement Bill will be published today and will be voted on by MPs for a first time tomorrow in its second reading.\n\nThe Commons will then be asked to approve a fast-track timetable with the aim of the Bill passing into law by Sunday night at the latest.\n\nA Government source said: 'The public will expect us to move at pace to get the Withdrawal Agreement passed so we can leave on October 31. There will be time for Parliament to consider the legislation and any amendments.'\n\nMichael Gove yesterday said the Government was determined to deliver its promise to get the country out of the EU by October 31.\n\nGove and Hancock's Brexit wager Michael Gove has revealed he placed a bet with Cabinet colleague Matt Hancock on whether the UK will leave the European Union by October 31. The Chancellor of the Duchy of Lancaster said the UK's departure was 'our determined policy'. Asked if the Prime Minister should resign if the UK did not leave the EU by this date, he told Sky News's Sophy Ridge On Sunday: 'We're going to deliver by the 31st October, we are going to ensure that we get this deal done...' Asked if he'd place money on it, he added: 'Yes, I have.' Pressed on how much, Mr Gove added: 'Well that's between me and the Health Secretary.' The light-hearted exchange leaves open the question of whether Mr Hancock believes the Government can deliver Brexit by that date. But an aide quickly clarified that the bet was on what the majority for the Brexit vote would be.\n\nAsked if he could guarantee this would happen, he told Sky News's Sophy Ridge on Sunday programme: 'Yes, that's our determined policy.\n\n'We know that the EU want us to leave, we know that we have a deal that allows us to leave.' Mr Gove said the Prime Minister's letter to the EU requesting an extension would be withdrawn in the coming days if Parliament backs the Government's Brexit deal.\n\nHe added: 'If we vote to leave, we get the legislation through, then there is no extension – October 31 is within sight.'\n\nHe continued: 'We now have an opportunity in the days ahead to pass the legislation necessary in order to ensure that we honour the referendum mandate and leave. I think it would be wrong for people to assume, as some do, that EU leaders want this to drag out.'\n\nAsked if the PM should resign if the UK did not leave the EU by Halloween, he said: 'We're going to deliver by October 31, we are going to ensure that we get this deal done and I'm confident that... we will get this deal done.'\n\nShadow Chancellor John McDonnell accused Mr Johnson of 'behaving a bit like a spoilt brat' in the way he communicated with Brussels over the extension request.\n\nHe said the Prime Minister could be in contempt of Parliament and the courts over the issue.\n\nAsked if the EU was going to be open to an extension, its chief negotiator, Michel Barnier, said that Mr Tusk would consider the next stage.\n\nHe told reporters: 'As foreseen, the EU ambassadors meet this morning to take the next steps of the [EU] ratification and tomorrow I will await the European Parliament.'\n\nCan Boris Johnson get his Brexit deal past MPs, will there be a second referendum or will there be a No Deal departure on October 31? All your questions answered ahead of another baffling week in Westminster\n\nBoris Johnson faces a crunch week in which to get his deal through the Commons in one form or another and get Brexit done by October 31.\n\nAfter MPs thwarted his efforts to win a meaningful vote in the Commons on Saturday he will try to hammer through his deal in order to keep his vow to get the UK out by Halloween.\n\nAfter being forced to go cap in hand and ask the EU for a Brexit delay in a letter at the weekend, he is seeking to get the deal done before a special Brussels summit next week where leaders will discuss how long an Article 50 extension they will offer.\n\nBut he faces attacks on all sides, with the usual opposition from Jeremy Corbyn's Labour now coupled with defiance from his one-time allies in the Democratic Unionist Party.\n\nCan Boris Johnson still salvage his deal?\n\nAfter MPs thwarted his efforts to win a meaningful vote in the Commons on Saturday he will try to hammer through his deal in order to keep his vow to get the UK out by Halloween\n\nYes. Mr Johnson recalled Parliament to try to force MPs to make a decision on his Brexit deal.\n\nHis efforts were scuppered when MPs voted instead to force him to seek another delay by blocking efforts to hold a meaningful vote on Saturday.\n\nHe will make another attempt to hold the vote today - which is likely to fail, before tabling the full Withdrawal Agreement Bill (WAB), the legislation to cement the deal into law, which has more chance of being approved by MPs.\n\nHe will seek to do this in time to leave the EU as planned on October 31, just 10 days time, despite sending a letter to the EU asking for another Brexit delay.\n\nWestminster is bracing for 'Hell Week' as the PM tries to force the package through Parliament, with threats of all-night sittings.\n\nHe did not sign that letter, has he broken the law?\n\nNo. On Saturday night Mr Johnson reluctantly complied with the law requiring him to send a letter to the EU asking for a three-month delay.\n\nBut he did not sign it and sent two other letters making it clear he did not want another extension.\n\nLegal action against him for trying to 'frustrate' the law is likely. But the EU has said it considers Mr Johnson to have requested an extension, which it will now consider.\n\nLord Pannick QC, who represented campaigners against the PM in the Supreme Court, said the Prime Minister 'just about' acted lawfully in asking the EU for a Brexit delay.\n\nThe peer told BBC Radio 4's Today programme: 'I think the Prime Minister is on the right side of the law on this occasion.\n\n'The Benn Act required him to send a letter to the president of the European Council seeking an extension and that's what he's done. The Act doesn't require that he's signed the letter.\n\n'My view is that he's on the right side of the law - just about - on this occasion.'\n\nSo what is his next move?\n\nThe Prime Minister is expected to make a second attempt to hold a 'Meaningful Vote' tonight. Passing such a vote is required by law before Britain can leave the EU.\n\nThere are fears it could be blocked by John Bercow under Commons conventions that state the same motion cannot be debated twice.\n\nSome Remainers fear if the vote passes, the PM could withdraw the letter to the EU requesting a delay. Such a move is likely to be frowned on by the courts.\n\nChief Secretary to the Treasury Rishi Sunak today denied that bringing the Brexit deal back for a vote is a bid to portray as Parliament being obstructive.\n\n'I very much hope' that Commons Speaker John Bercow allows for the deal to be voted on on Monday, he told the BBC.\n\n'What the Oliver Letwin amendment did is mean that Parliament hasn't given its explicit positive support for the deal.\n\n'It was an observation on the deal happening and I think what people need is a substantive vote.'\n\nAsked if the only real purpose is to portray a Parliament being obstructive, he replied: 'It's rather the opposite, actually. It's giving Parliament the opportunity to more positively affirm its support for this deal, which is something that needs to happen.'\n\nHas the Prime Minister got enough MPs to pass the deal?\n\nUntil a vote is held it is impossible to be sure. The majority of the 28 Tory 'Spartans' who rejected Theresa May's deal have come on board, but a hardcore of half a dozen have yet to declare.\n\nA significant number of Labour MPs have also backed the deal, with more expected to follow. Mr Johnson's former allies in the DUP are implacably opposed.\n\nBut many of the 21 MPs who lost the Tory whip last month after voting to block a No Deal Brexit have suggested they will fall into line in a vote on the actual deal - including Sir Oliver.\n\nThis is despite 10 of them voting for the former Cabinet minister's wrecking amendment on Saturday.\n\nIt will be very tight.\n\nWhat if the vote fails?\n\nDowning Street has indicated the PM will press ahead with legislation tomorrow to pass his new deal into law via the WAB.\n\nIn theory, the Government could then repeal the need for a 'Meaningful Vote', by overturning an amendment introduced by ex-attorney general Dominic Grieve earlier this year.\n\nBut it is high risk because if the legislation is voted down then it cannot be brought back without starting a new session of Parliament.\n\nIt is also open to attempts to amend it with various add-ons.\n\nJeremy Corbyn and other opposition parties could yet join forces to wreck the process, with 'guerrilla warfare' plots to trigger votes on a second referendum and the whole UK staying in the EU customs union.\n\nShadow health secretary Jonathan Ashworth denied Labour is trying to 'wreck' the Prime Minister's Brexit deal.\n\nHe accused the Government of taking an 'utterly irresponsible approach' by asking MPs to vote on legislation they are yet to see.\n\nHe told Today: 'We are not attempting to wreck it, we are attempting to safeguard the British economy, safeguard jobs and safeguard public services.\n\n'That is our responsible approach as an opposition.\n\n'We believe that the responsible way in which to leave the European Union is in a customs union-arrangement and that in turn should be put to the British people so they can have a say on this.'\n\nTrade Secretary Liz Truss today warned that undermining the painstakingly-assembled deal with Brussels would put the country 'back to square one'.\n\nCan Johnson win in time for October 31?\n\nERG Spartan Mark Francois (right) was among those attending No 10 today at the start of another key week for brexit, as well as top aide Dominic Cummings (left)\n\nThe PM has told EU leaders that the Withdrawal Agreement Bill, which ratifies the deal, could be passed in as little as six days.\n\nBut opponents will try to amend the timetable tomorrow to delay final sign off until well after October 31 in the hope this persuades the EU to grant another delay.\n\nThe Prime Minister will publish the WAB today under the assumption that the Commons starts voting on it tomorrow.\n\nThe premier's chances of getting the implementation law through in time for the UK to leave the EU by his 'do or die' date of October 31 are likely to hang on whether he can get support for a 'programme motion' - which will dictate a tight schedule for the stages in Parliament.\n\nUsually it takes weeks for pieces of legislation to go through but ministers are desperate to get the deal into law ahead of a planned EU summit next Monday on whether to have another Brexit delay.\n\nMr Johnson is planning late-night sittings in the Commons and a special weekend session in the Lords as he attempts to pass the Withdrawal Agreement Bill.\n\nCould MPs force a second referendum?\n\nShadow Brexit Secretary Sir Keir Starmer said it was 'inevitable' that Labour and others would try to force a vote this week to require the Government to call a referendum on the deal.\n\nThe DUP has indicated it could now back a new referendum.\n\nBut two dozen Labour MPs oppose the idea, meaning a vote would be tight.\n\nNo 10 has said it will not hold a second referendum. If so, the stand-off could only be resolved in an election.\n\nIf the PM's deal is voted down could No Deal still happen?\n\nIf it lost the WAB vote the Government would focus on preparing for a No Deal Brexit on October 31.\n\nRemainers hope the EU leaders would act to prevent No Deal by offering a delay of at least three months. Mr Johnson would then push hard to force an election.\n\nSeveral EU leaders, including Emmanuel Macron and Leo Varadkar, are frustrated.\n\nThe French President has even hinted he could veto another extension.\n\nIf this happened, and MPs had rejected the PM's deal, then the UK would leave without a deal on October 31.", "description": "MPs denied the PM 'in principle' approval for his deal over the weekend, instead postponing the showdown and obliging him to ask the EU for an extension.", "authors": ["James Tapsfield", "Political Editor For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/15/19994838-0-image-a-4_1571668659654.jpg", "published_at": "2019-10-21"}