{"pub": "japantoday", "url": "https://japantoday.com/category/national/typhoon-hit-areas-brace-for-more-floods-as-heavy-rain-may-douse-again", "downloaded_at": "2019-10-19 10:51:18.935611+00:00", "title": "Typhoon-hit areas brace for more floods", "language": "en", "text": "A woman walks in the rain past flood-damaged furniture and other items in Motomiya, Fukushima Prefecture, on Saturday.\n\nSome of Japan's eastern and northeastern regions are bracing for possibly more floods and landslides, as heavy rain could drench areas that are still reeling from the most powerful typhoon to hit the country in decades a week ago.\n\nIn Chiba Prefecture, near Tokyo, 110 millimeters of rain per hour was recorded in the morning, while at least 28 homes and stores were confirmed inundated the same day in Mie Prefecture, central Japan, with a river overflowing, according to local governments.\n\nA low-pressure system that is bringing heavy rain is expected to proceed to the Hokuriku and Tohoku regions, which include the two prefectures, through Saturday night, according to the Japan Meteorological Agency.\n\nAt least 13 municipalities in Miyagi and Fukushima prefectures, hit hard by Typhoon Hagibis, said they canceled plans to solicit volunteers out of concern for their safety, despite the urgent need to speed up recovery efforts.\n\nThe season's 19th typhoon claimed the lives of at least 79 people, with 10 still missing, left some 2,400 homes heavily damaged or destroyed and inundated at least 25,000 hectares on the country's main island of Honshu, according to government data.\n\n\"All will be over if more heavy rain comes,\" Satsuki Hikichi, a 78-year-old resident of the town of Marumori, Miyagi, said at a local school building used as an evacuation center.\n\nAnother Typhoon is approaching the southern island prefecture of Okinawa and is expected to travel eastward, the weather agency said.\n\n© KYODO", "description": "Some of Japan's eastern and northeastern regions are bracing for possibly more floods and landslides, as heavy rain could drench areas that are still reeling from the most powerful typhoon to hit the country in decades a week ago. In Chiba Prefecture, near Tokyo, 110 millimeters of rain per hour…", "authors": ["Derek Grebe"], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/a9/85/95521bcdc4e64dbbbdd636aac37a24e8256b/motomiya.jpg", "published_at": "2019-10-19"}