{"pub": "telegraph", "url": "https://telegraph.co.uk/pensions-retirement/news/fifties-women-not-discriminated-against-state-pension-age-increase", "downloaded_at": "2019-10-05 14:09:58.297725+00:00", "title": "Fifties women 'were not discriminated against' over state pension age increase", "language": "en", "text": "Campaigners who took the Government to court over its handling of increases to the state pension age for women have been told by judges that they were not discriminated against.\n\nThe Government announced in 1995 that the age at which women begin receiving their state pension would increase to 65 – the same as for men – by 2018. This was later increased to 66, again in line with men, and depends on when people were born.\n\nTwo women from the Backto60 campaign group took the Government to a judicial review, arguing the delay in receiving their state pension had disproportionately affected them. They said many women of their generation took time out of work to care for children which limited their earnings, meaning they had less opportunity to build up a healthy private pension.\n\nBut in a ruling released today, Lord Justice Irwin and Mrs Justice Whipple denied their claim, saying they had not been discriminated against.\n\nTheir judgment read: “There is no direct discrimination on grounds of sex, or age and sex combined. Necessarily, the legislation affects women only, because it was women only who previously enjoyed the advantage which is now being removed.\n\n“But that is not to treat women less favourably than men in law; it is to equalise a historic asymmetry between men and women; it is to correct historic direct discrimination against men.”", "description": "Campaigners who took the Government to court over its handling of increases to the state pension age for women have been told by judges that they were not discriminated against.", "authors": ["Sam Meadows", "Matthew Lynn", "Sam Barker", "Katie Morley", "Lauren Davidson", "Marianna Hunt", "Taha Lokhandwala", "Stephanie Baxter"], "top_image": "https://www.telegraph.co.uk/content/dam/pensions-retirement/2019/10/03/TELEMMGLPICT000177442866-xlarge_trans_NvBQzQNjv4BqaRL1kC4G7DT9ZsZm6Pe3PehAFAI_f6ud569StXyOKH0.jpeg?imwidth=1200", "published_at": "2019-10-03"}