{"pub": "cnn", "title": "Opioid trial judge could deliver biggest judgment in US history", "url": "https://cnn.com/2019/08/26/health/opioid-trial-oklahoma-verdict-walkup/index.html", "language": "", "published_at": "2019-08-26", "downloaded_at": "2019-09-02 07:32:31.846883+00:00", "text": "Norman, Oklahoma (CNN) The judge presiding over the historic Oklahoma opioid trial will deliver his ruling Monday afternoon -- a decision that could have sweeping implications as other states and communities try to hold pharmaceutical companies responsible for the opioid epidemic that has killed hundreds of thousands of Americans since 2000.\n\nThe state has accused Johnson & Johnson and its subsidiary, Janssen Pharmaceuticals, of creating a public nuisance that cost the state billions of dollars and destroyed thousands of lives. Johnson & Johnson has denied any wrongdoing and said it has been made a \"scapegoat.\"\n\nCleveland County District Judge Thad Balkman will issue his decision at 3 p.m. (4 p.m. ET) in his courtroom in the college town of Norman.\n\nIt is the first state trial attempting to hold a pharmaceutical company accountable for one of the worst epidemics in history. The state has asked for nearly $17.2 billion to fix the epidemic over a 30-year plan . If Balkman sides entirely with the state, the verdict would be the biggest monetary award handed down in a bench trial in American history.\n\n\"This would be the largest bench trial judgment in US history and have far-reaching implications,\" said Carl Tobias, a law professor at the University of Richmond.\n\nIf the judge were to side with Johnson & Johnson, it would provide the pharmaceutical industry with a precedent to defend in cases around the country, observers said.\n\nJudge Thad Balkman will rule Monday on historic Oklahoma opioid trial.\n\n\"What's happening in Oklahoma is setting the tone,\" Abbe Gluck, a professor at Yale Law School, told CNN as the trial played out. \"Johnson & Johnson took a gamble here, going to trial in front of the world in a televised courtroom. ... They could have a huge victory or they could have a huge defeat, and that's going to set a tone for everything that follows.\"\n\nThe case will hinge on whether Balkman buys the state's public nuisance theory -- that Johnson & Johnson created a public health crisis in the state. Because opioids have a legitimate medical purpose, observers said, it will be interesting to see if the public nuisance theory holds up.\n\n\"If the judge rejects that theory,\" Tobias said, \"plaintiffs in other cases will rely more on more traditional tort law theories like products liability and negligence.\"\n\nFrom the mundane to fireworks\n\nBalkman's decision comes after 33 days of testimony and 109 witnesses. The case featured everything from hours of mundane testimony about pharmacology to courtroom fireworks that were a sight to behold.\n\n\"I've never seen a company that tries to hide truth more than this one, ever,\" said Brad Beckworth, an attorney representing the state, after facing repeated objections.\n\nJohnson & Johnson attorney Sabrina Strong snapped back: \"This is not about hiding the truth.\"\n\nJUST WATCHED Federal prosecutors target Big Pharma in opioid crisis Replay More Videos ... MUST WATCH Federal prosecutors target Big Pharma in opioid crisis 02:11\n\nAt another point, the state's mental health commissioner, Terri White, broke down in tears and grew angry when a Johnson & Johnson attorney asked if the state bore any responsibility for the opioid epidemic. Johnson & Johnson, White said, pushed opioids into Oklahoma \"without telling us you were going to do this, without you still accepting any responsibility today.\"\n\n\"We are the only reason, the only reason, that lives are being saved in the state,\" she said.\n\nCal Hobson, once one of the most powerful lawmakers in Oklahoma, watched every hour of the trial, either in person or online. He called that moment -- of seeing White in tears -- \"one of the most telling moments\" of the entire trial. In his view, Hobson said, Johnson & Johnson's case went downhill from there.\n\n\"It was just devastating,\" said Hobson, who served a total of 28 years in the Oklahoma House and Senate.\n\nJohnson & Johnson calls state case flimsy\n\nOklahoma Attorney General Mike Hunter led the charge against Johnson & Johnson, calling the company the \"drug kingpin\" of opioid manufacturers. He scored two major settlements ahead of trial with other opioid drugmakers: a $270 million settlement with Purdue Pharma , the maker of OxyContin, and an $85 million settlement with Teva Pharmaceuticals , one of the world's largest makers of generic drugs.\n\nThat left Johnson & Johnson alone to defend itself in court.\n\nIn his closing, Hunter accused the company of a \"cunning, cynical and deceitful scheme to create the need for opioids.\"\n\nBeckworth emphasized that in Cleveland County alone there were 135 prescription opioids for every adult. \"If you oversupply, people will die,\" he said. \"That's a simple answer to a complex problem.\"\n\nJohnson & Johnson attorney Larry Ottaway urged Balkman not to buy the state's argument, saying the company had always been patient-focused and did nothing wrong.\n\n\"Only a company that believes its innocence would come in and defend itself against a state,\" he said, \"but we take the challenge on because we believe we are right.\"\n\nJohnson & Johnson argued in its final court filings that the state's case was flimsy, saying that the public nuisance accusation is based on \"radical theories unmoored from more than a century of Oklahoma case law.\"\n\n\"In addition to those fundamental legal defects, the State undeniably failed to prove its case,\" Johnson & Johnson said.\n\nThe drug company blasted the state's witnesses and argued that the state offered no explanation how its subsidiary, Janssen, contributed to the opioid crisis.\n\nAlthough Johnson & Johnson is best known for its baby powder, for years the company marketed the extended-use opioid tablet Nucynta, which it sold for $1 billion in 2015. It still makes a fentanyl patch called Duragesic.\n\nThe state pointed to the fact that Johnson & Johnson once owned two subsidiaries in Tasmania that allowed it to supply more than 60% of all active ingredients for opioids manufactured and sold in the United States, including the blockbuster painkiller OxyContin made by Purdue Pharma.\n\nIt was those actions, the state argued, that led to \"the opioid pain medications thrust upon the unsuspecting public since the 1990s.\"\n\nOklahoma is one of dozens of states suing opioid drugmakers and the first to reach trial. A federal trial is slated for this fall in which nearly 2,000 cases involving cities, counties, communities and tribal lands have been rolled into one, accusing opioid makers of causing the epidemic.\n\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\n\nMore than 130 people in the United States die every day after overdosing on opioids and drug overdose deaths continue to increase nationwide.\n\nFrom 1999 to 2017, more than 702,000 people have died from a drug overdose, according to the US Centers for Disease Control and Prevention\n\nIn 2017, more than 70,000 people died from drug overdoses, making it a leading cause of injury-related death in the United States, according to the CDC, and of those deaths, almost 68% involved a prescription or illicit opioid.", "description": "A landmark trial in Oklahoma that will decide whether pharmaceutical giant Johnson & Johnson should take responsibility for the state's opioid crisis is scheduled to reach a verdict on Monday.", "authors": ["Wayne Drash", "Jacqueline Howard"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190825114541-02-judge-thad-balkman-super-tease.jpg"}