{"pub": "reuters", "url": "https://ca.reuters.com/article/topNews/idCAKBN1WG336-OCATP", "downloaded_at": "2019-10-01 09:30:44.749716+00:00", "title": "Catalan separatists protest on anniversary of banned independence referendum", "language": "en", "text": "GIRONA/BARCELONA, Spain (Reuters) - Protesters gathered in the Catalan town of Girona early on Tuesday to mark the second anniversary of a banned independence referendum, some of them throwing eggs at police and toppling garbage containers.\n\nPro-separatist supporters attend a protest to mark the second anniversary of the October 1st referendum on independence in Girona, Spain, October 1, 2019. REUTERS/Albert Gea\n\nTensions between separatists in the region and Madrid have run high in recent days after Spain’s high court sent seven Catalan activists to jail over suspicions they were planning violent action in favor of Catalonia’s independence.\n\nPolice had cordoned off the train station and other key buildings in Girona, a small town at the heart of the independence movement, at the start of a day that will gauge the strength of the movement.\n\nThe Girona protest, attended by around 150 people, was organized by the Committees for the Defence of the Republic (CDR), among other entities. They have staged periodic protests since separatist leaders were arrested after the October 2017 referendum and short-lived declaration of independence.\n\nThe separatist movement has so far been peaceful, but the seven arrested last week over accusations that they were preparing violent actions were alleged to be linked with the CDR.\n\nThe Oct. 1 anniversary protests come before the verdict, expected in the next two weeks, of separatist leaders arrested in 2017 over their role in the region’s failed independence bid.\n\nThe botched declaration of independence triggered Spain’s biggest political crisis in decades and still dominates national politics.\n\nThe separatist movement is at a crossroads, and is divided over what course to take - a hard line that could lead to another banned independence referendum or more dialogue with Madrid.\n\n“We were born to defend a referendum. We grew to defend a republic. We will be who will make the enemy tremble. And we will win. Have no doubts,” the CDRs said on a manifesto on the referendum anniversary posted on Twitter.\n\nOne of the Girona protesters was identified by police and taken away for public disorder, according to Catalan public television. They marched in front of the Civil Guard and Spanish government headquarters in the Catalan city.\n\nMore events are planned on Tuesday, including a rally in Barcelona in the evening.\n\nSeparatist leaders have so far refused to condemn the seven activists arrested last week over what prosecutor say were plans for violent actions, saying instead that authorities in Madrid were trying to paint separatists as a violent movement, a label they reject.\n\n“There is only one way (to achieve independence) ... that is of civic, non-violent resistance,” the former head of the Catalan region, Carles Puigdemont, told Catalan public radio on Tuesday.\n\nPuigdemont, who has been living in self-imposed exile in Belgium since the botched independence declaration, said he had no links with the CDRs.\n\nAn annual pro-independence rally in Barcelona gathered fewer people that usual last month. Organisers said this had been the “hardest” secessionist protest to put together since they started in 2012, because of divisions among the separatist parties and the lack of a clear road map for independence.", "description": "Protesters gathered in the Catalan town of Girona early on Tuesday to mark the second anniversary of a banned independence referendum, some of them throwing eggs at police and toppling garbage containers.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191001&t=2&i=1435798129&w=1200&r=LYNXMPEF9025C-OCATP", "published_at": "2019-10-01"}