{"pub": "bbc", "url": "https://bbc.com/news/world-asia-india-49996401", "downloaded_at": "2019-10-16 00:27:36.780855+00:00", "title": "Indian skyscrapers to be brought down in controlled implosions", "language": "en", "text": "Image copyright SIVARAM V Image caption Home owners have protested against the Supreme Court's demolition order\n\nFor more than a decade, thousands of people have made their homes in four skyscrapers that sit along an idyllic lakefront in southern India. But now they are set to watch their homes - and their investments - implode before their eyes, following a battle over the environment which went all the way to the Supreme Court.\n\nIn 2006, PP Joseph, a bank executive, spent what would now amount to $70,000 (£55,000) to purchase a 2,140 sq ft (198 sq m) flat in Alfa Serene. The 16-storey private apartment building overlooked the backwaters of the Vembanad lake, the largest in the state of Kerala, in the city of Cochin.\n\nThirteen years later, Mr Joseph finds himself out of a home and unsure of whether he can recoup his investment.\n\nAlfa Serene and three other buildings - which together house 343 flats and some 2,000 people - will be brought down in implosions later this month. The luxury apartments once housed bankers, executives, film actors and directors, affluent retirees, expatriates and even a media advisor to a senior politician.\n\nNow, they stand empty.\n\n\"When I bought my flat, the builders said there was no pending litigation, and this was included in my sale deed,\" Mr Joseph says. \"They were cheating us.\"\n\n'Where can we go?'\n\nIndia's Supreme Court ordered the demolition last May, after an official committee found that the buildings were constructed in breach of environmental rules protecting coastal areas.\n\nFaced with the prospect of homelessness, some residents initially refused to leave.\n\n\"Whatever happens, we are not going to move out. They will have to tread over our bodies,\" one resident, named only as Joyson, told Gulf News.\n\nBut officials cut water and electricity supply to the buildings - then still home to dozens of children and almost 150 pensioners. The residents had no choice but to go.\n\nThe residents had also fought through the courts - but their pleas went unheeded: the Kerala state government told the court last month that it would carry out the implosion in 90 days, leaving home owners disappointed, frustrated and scared for their futures.\n\n\"I bought this flat to stay with my elderly mother,\" widow Maya Prem Mohan, 60, told NDTV. \"We have not much savings left. We have medical needs.\n\n\"Where can we go at this age? Can we afford another house?\"\n\nImage copyright SIVARAM V Image caption The apartment blocks are in breach of environmental rules\n\nThe court has said the owners should be compensated to the tune of $35,000 (£28,000). However, the money is supposed to be recouped from the company which built the four tower blocks - and they are nowhere to be found.\n\nThe BBC has tried contacting the builders - Paul Raj and Sini Joseph - but they have been unreachable.\n\nPolice told the BBC that they had registered a case of cheating against them and have searched their offices. The court has frozen their bank accounts and attached properties.\n\nBut for homeowners, the missing builders are just one of a list of problems. The compensation itself is too little, they say, and there are others at fault.\n\n\"Just days before the demolition order was issued, my neighbour sold his apartment for $176,000,\" Mr Joseph says. \"Sale of flats continued as buyers were not expecting the Supreme Court to leave us homeless overnight.\"\n\nKarunagappally, a lawyer and homeowner, said that because many of the owners live and work in the Middle East, the situation is even more unfair. It is difficult for them to pursue any legal action in India.\n\n\"The [officials] that issued permits to the builders are primarily responsible for our plight,\" he added.\n\nImage copyright SIVARAM V Image caption The residents battled through the courts to defend their homes\n\nThe problem appears to come down to two different planning authorities, with different ideas about the land.\n\nThe Maradu village council granted building permits between 1995 and 2006. However, the Kerala Coastal Zone Management Authority (KCZMA) opposed the permits.\n\nKCZMA, created in 1991 to prevent degradation of the coastal and marine areas, alleges permission was given without its mandatory approval.\n\nConstruction is regulated according to the classification of the zone and Maradu, according to KCZMA, is classed as a critically vulnerable area where no new construction is allowed.\n\nBut local officials allowed construction, defining Maradu as an urban area in a coastal belt where residential buildings are allowed.\n\nFollowing the KCZMA's protest, the village council tried to stop construction. But the builders petitioned the Kerala high court, which, in 2007, allowed construction to continue. In a 2016 ruling, it blamed the officials for granting building permits.\n\nThe KCZMA then appealed to the Supreme Court. The top court not only ruled in favour of KCZMA, but also ordered the demolition, although officials had never sought it.\n\nIn its ruling, the court referred to the devastating floods in Kerala in 2018 and said they were the result of \"the entire environment being degraded and coastal zones being illegally occupied\".\n\nEnvironmental groups welcomed the judgement, hoping it would serve as a deterrent.\n\nThe court will hear the case again on 23 October to monitor the progress of the demolition.\n\nHowever, now authorities in Maradu are on the hunt for demolition experts who can bring down the four apartment blocks swiftly and safely. It's expected to cost the municipality around $140,000.\n\nImage copyright Sivaram V Image caption The buildings are located in a sensitive coastal zone\n\n\"We have received 15 proposals [from demolition experts] and are in talks with one of them,\" says Nadeera Mahboob, chairperson of the municipal council. \"They promise to safely pull down these structures without any damage. We are seeking the best method to implode them.\"\n\nThe demolition could affect some 100 households in the neighbourhood, as well as water bodies, bridges and gas pipelines - a fact that concerns local officials.\n\nThe buildings will be handed over to a demolition contractor who specialises in swift controlled implosions. Residents living nearby will be alerted before the blast.\n\nMs Mahboob says removal of debris will be a long process, and the structures will be covered before the implosion to prevent the dust from spreading far.\n\n\"Our sympathy lies with the home owners. But you need to stop illegal construction on encroached land as a warning for others,\" she adds.", "description": "Thousands of people will watch their homes implode in southern India after a high court ruling.", "authors": ["Ashraf Padanna", "Bbc News"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/33E7/production/_109178231_protest_s1k6973.jpg", "published_at": "2019-10-15"}