{"pub": "investingcom", "url": "https://ng.investing.com/news/stock-market-news/global-marketsoil-trims-gains-but-middle-east-risks-keep-stocks-on-back-foot-51735", "downloaded_at": "2019-09-17 08:30:52.766898+00:00", "title": "GLOBAL MARKETS-Oil trims gains, but Middle East risks keep stocks on back foot", "language": "en", "text": "© Reuters. GLOBAL MARKETS-Oil trims gains, but Middle East risks keep stocks on back foot\n\n* Asian stock markets: https://tmsnrt.rs/2zpUAr4\n\n* Oil futures pull back, but risks to sentiment remain\n\n* Stocks edge lower on risk-off trade\n\n* Some investors waiting for Fed meeting\n\nBy Stanley White\n\nTOKYO, Sept 17 (Reuters) - Oil shed some of its massive\n\ngains on Tuesday as the United States flagged the possible\n\nrelease of crude reserves, but the threat of military action\n\nover the attacks on Saudi oil facilities kept prices elevated\n\nand stocks under pressure.\n\nWhile equity market losses have not been large, shaky\n\ninvestor confidence continued to support safe-haven assets. Gold\n\nedged higher and Treasury prices rose on Tuesday.\n\nInvestors otherwise broadly remained on the sidelines ahead\n\nof an expected interest rate cut from the U.S. Federal Reserve\n\non Wednesday and the next round of U.S.-China trade talks on\n\nThursday.\n\nMSCI's broadest index of Asia-Pacific shares outside Japan\n\nwas down 0.66%. Chinese shares fell\n\n1.07%, while Hong Kong shares slumped 1.18%.\n\nEuro Stoxx 50 futures were down 0.11%, German DAX\n\nfutures were down 0.02%, while FTSE futures fell\n\n0.31%.\n\n\"There is certainly a risk-off tone, but I'm surprised the\n\nmarkets are not reacting more,\" said Tsutomu Soma, general\n\nmanager of fixed income business solutions at SBI Securities in\n\nTokyo.\n\n\"The U.S. and other countries have oil reserves, which helps\n\nsentiment in a case like this. You also have a lot of positions\n\nriding on the Fed meeting.\"\n\nBrent crude , the international benchmark, fell 0.96%\n\nto $68.39 per barrel on Tuesday. On Monday, it surged 14.6% for\n\nits biggest one-day percentage gain since at least 1988. O/R\n\nU.S. West Texas Intermediate futures were down 1.29%\n\nto $62.09 per barrel following a 14.7% surge on Monday, the\n\nbiggest one-day gain since December 2008.\n\nSaturday's attack on Saudi oil facilities has halved the\n\nkingdom's oil output, creating the biggest disruption to global\n\noil supplies in absolute terms since the overthrow of the\n\nIranian Shah in 1979, International Energy Agency data show.\n\nU.S. President Donald Trump has authorised the release of\n\nemergency crude stockpiles if needed, which could ease some\n\nupward pressure on crude futures. Trump said on Monday it looked like Iran was behind the\n\nattacks but stressed that he did not want to go to war, striking\n\na slightly less bellicose tone than his initial reaction.\n\nIran has rejected U.S. charges that it was behind the\n\nattacks. Tension between the two countries was already running\n\nhigh over Iran's suspected ambitions to assemble nuclear\n\nweapons. The strikes in Saudi Arabia are likely to raise\n\nregional tensions even further.\n\nThe People's Bank of China extended 200 billion yuan\n\n($28.27 billion) of loans from its medium-term lending facility\n\non Tuesday to maintain liquidity but kept the one-year lending\n\nrate unchanged at 3.3%.\n\nDisappointment that the PBOC did not lower the one-year\n\nlending rate weighed on Chinese shares.\n\nMany analysts expect China to lower benchmark rates for new\n\nloans on Friday to keep pace with monetary easing by other\n\ncentral banks. Hong Kong shares headed for their biggest decline in three\n\nweeks after Moody's lowered its outlook for the city's credit\n\nrating due to protests in the Asian financial hub. The Chinese-ruled territory has been rocked by more than\n\nthree months of clashes, with demonstrators angry about what\n\nthey see as creeping interference by Beijing in their city's\n\naffairs despite a promise of autonomy.\n\nU.S. stock futures fell 0.08%. On Wall Street, the\n\nS&P 500 ended 0.31% lower.\n\nSpot gold traded a shade higher at $1,499.77 an ounce\n\nfollowing a 0.7% increase on Monday.\n\nThe yield on benchmark 10-year Treasury notes\n\nfell slightly to 1.8362%.\n\nThe dollar was little changed at 108.19 yen JPY=EBS .\n\nThe Fed is expected to cut interest rates at a policy\n\nmeeting ending on Wednesday, which could put pressure on the\n\nBank of Japan to ease policy at a meeting the following day.\n\nTrump said on Monday that the United States has reached\n\ninitial trade agreements with Japan, but traders are also\n\nfocused on the U.S.-Sino trade war. Deputy-level talks between the United States and China are\n\nscheduled to start in Washington on Thursday, paving the way for\n\nhigh-level talks next month aimed at resolving a bitter trade\n\nrow that has dragged on for more than a year. = 7.0758 Chinese yuan)\n\nGlobal oil prices pull back from Monday's highs but remain\n\njittery after Saudi attacks https://tmsnrt.rs/303OXwF\n\n^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^>\n\n(Editing by Sam Holmes, Simon Cameron-Moore and Himani Sarkar)", "description": "GLOBAL MARKETS-Oil trims gains, but Middle East risks keep stocks on back foot", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB7Q0U9_L.jpg", "published_at": "2019-09-17"}