{"pub": "cbc", "url": "https://cbc.ca/radio/asithappens/we-regard-him-as-a-murderer-maori-leader-bans-visit-from-james-cook-replica-ship-1.5291445", "downloaded_at": "2019-09-20 23:57:58.242048+00:00", "title": "CBC Radio", "language": "en", "text": "The explorer Captain James Cook is often celebrated as the man who discovered New Zealand. But many Maori people say it's time for that to change.\n\nThe New Zealand government is currently planning a commemoration of the 250th anniversary of Captain Cook landing on the island. It's called Tuia – Encounters 250 and will involve a replica of Cook's HMS Endeavour, making its way around New Zealand and visiting various Indigenous territories along the way.\n\nOne tribe on New Zealand's northern island has refused such a visit. The Ngāti Kahu say they want no part of the Tuia 250 commemoration and have banned the replica ship from docking on their shores.\n\nAnahera Herbert-Graves is the chief executive of the tribe. Here is part of her conversation with As It Happens host Carol Off.\n\nMs. Herbert-Graves, what did you think when you heard that this replica ship ... was going to come to your community?\n\nI was very surprised because we hadn't been contacted. We hadn't heard a thing about the plan to come to our community at all. And also because it was historically inaccurate for the replica to come into our community or into our territory, as the original never had come [here].\n\nIt was clear that it was a commemoration of ... the colonization experience over Maori nations in this country and our sub-tribal groups, who had never really accepted the cession of sovereignty to the Queen of England or to the monarchy of England.\n\nAnahera Herbert-Graves is the chief executive of the Ngāti Kahu tribe in New Zealand. (Doug Graves)\n\nThis is something that is of great controversy in Australia and in New Zealand. What does it mean to you that they are commemorating this? Is it a celebration? Or are they looking at this history warts and all?\n\nI think for us — well, I know for us — that it actually means a renewal of the colonizing myth that they 'discovered' a country called New Zealand. ...\n\nBut there was a more sophisticated element to this denial, in that they had used a Maori name and clearly had gotten [an] individual Maori on board, to frame Cook as the centre of this whole commemoration. And they managed to do that by ... convincing them that it was a way to tell our voyaging histories of 1,000 years — and it was a way to rebalance and get our stories told.\n\nBut the thing is the very name gives the lie to that. It's not called Tuia 1,000. It's called Tuia 250.\n\nCaptain James Cook, in his official portrait by artist Nathaniel Dance at the National Maritime Museum of the U.K. (Nathaniel Dance/National Maritime Museum/Wikimedia Commons)\n\nCaptain Cook has been called a \"barbarian\" by Maori. What's the legacy? How do people in your community ... regard Captain Cook?\n\nWe do regard him as a murderer. We regard him as somebody who indulged in atrocious behaviours. He had 71 crew and at least 60 of them were infected with syphilis. ... He unleashed his men on these islands, knowing that they had syphilis.\n\nThey indulged in pedophilic practices. In the diaries of Georg Forster of the second journey of the Endeavour, he records with some shock ... that the girls that were brought on board for sex had showed not the least signs of puberty.\n\nThey hardly went a week without murdering people and thieving. These are atrocious behaviours — these are atrocities — particularly from so-called \"Christian,\" \"civilized\" people who absolutely breached their own terms of engagement ... with utter cynicism and then followed it up ... by sanitizing and censoring the records that were published.\n\nWe know that in Australia, Aboriginal people have renamed Australia Day \"Invasion Day.\" Is there a movement of that nature in New Zealand as well?\n\nWe already call what happened with Cook as well as the settlers that came a hundred years later — we call them invaders. We don't have a similar day to Australia Day here in New Zealand. ... But we call the wars that they originally called the Maori Wars ... we call them the Wars of Invasion.\n\nThis commemoration is going to continue. Will you have any other protests, or do you think banning this ship from coming to your community will be enough?\n\nThe commemoration will go ahead ... but we will continue the work. Really there are deep underlying causes to the colonization experience and this is just one aspect of the battle to address those causes.\n\nAnd probably, for us, now that we've banned the commemoration coming here and they've conceded to not come, this part of that battle is complete ... and we'll get on with addressing the underlying causes such as the doctrine of discovery and the lack of constitutional protections for our rights as Indigenous people and as human beings.\n\nWritten by Chloe Shantz-Hilkes. Interview produced by Rachel Levy-McLaughlin. Q&A has been edited for length and clarity.", "description": "Ngāti Kahu executive says New Zealand government should rethink its Tuia 250 celebration, in memory of Captain James Cook.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.3565749.1462365950!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/endeavour-replica.jpg", "published_at": "2019-09-20"}