{"pub": "reuters", "url": "https://af.reuters.com/article/worldNews/idAFKBN1WH10R", "downloaded_at": "2019-10-03 07:53:58.638272+00:00", "published_at": "2019-10-02", "title": "Iraq declares curfews as gunfights rage and protests spread nationwide", "language": "en", "text": "BAGHDAD (Reuters) - Iraqi Prime Minister Adel Abdul Mahdi on Wednesday declared a curfew in Baghdad until further notice after at least seven people were killed and more than 400 were injured during two days of nationwide anti-government protests.\n\nCurfews were imposed earlier in three southern cities while elite counter-terrorism troops opened fire on protesters trying to storm Baghdad airport and deployed to the southern city of Nassiriya after gunfights broke out between protesters and security forces, police sources said.\n\n“All vehicles and individuals are totally forbidden to move in Baghdad as of 5 am today, Thursday, and until further notice,” Abdul Mahdi said in a written statement.\n\nTravellers to and from Baghdad airport, ambulances, government employees in hospitals, electricity, and water departments, and religious pilgrims are exempt from the curfew, the statement said. It was up to provincial governors to decide whether to declare curfews elsewhere.\n\nCurfews were imposed in Nassiriya, Amara and Hilla as protests that began on Tuesday over unemployment, corruption and poor public services escalated.\n\nDemands on Wednesday included the “fall of the regime” and protesters set government and political party buildings ablaze in two other southern provinces.\n\nThe slogan, “the people demand the fall of the regime,” was popularised during the 2011 Arab Spring uprisings.\n\nFive people were killed on Wednesday and more than 200 were wounded in renewed clashes nationwide, the largest display of public anger against Abdul Mahdi’s year-old government. Two were killed on Tuesday.\n\nDomestic instability coupled with regional tensions could prove to be the final nail in the coffin of Abdul Mahdi’s fragile coalition government, sworn in as a compromise between rival factions after an inconclusive election.\n\nRelated Coverage Iraq declares curfew in Baghdad until further notice - PM\n\n“We are demanding a change, we want the downfall of the whole government,” said one protester in Baghdad who declined to identify himself for fear of reprisal.\n\nAny power vacuum in Iraq, should the government be toppled, could prove challenging for the region, given Baghdad’s status as an ally of both the United States and Iran, who are locked in a political standoff.\n\nIslamic State militants could also take advantage of any chaos and thousands of U.S. troops are stationed in the country in positions not far from those of Iran-allied Shi’ite militias.\n\nThe five deaths on Wednesday included two protesters killed in Nassiriya. An Interior Ministry spokesman said a child was killed when a protester threw a gasoline-filled bottle at a vehicle carrying civilians in Baghdad, and a protester was killed in Amara. The fifth death was that of a protester who died from wounds sustained on Tuesday.\n\nSOUTHERN HEARTLAND RISES\n\nPolice and the army opened fire and launched tear gas canisters to disperse hundreds of protesters in Baghdad. Protesters blocked the main highway connecting the capital to Iraq’s northern provinces.\n\n“Our demands? We want work, we want to work. If they do not want to treat us as Iraqis, then tell us we are not Iraqi and we will find other nationalities and migrate to other countries,” said one protester in Baghdad.\n\nWorst hit was southern Iraq, the heartland of the Shi’ite Muslim majority who, after years of voting along sectarian lines, are turning on their political leaders for failing to deliver jobs and basic services.\n\nProtesters burned down government buildings in Nassiriya, Amara and the Shi’ite holy city of Najaf. In Kut, protesters tried to break into the municipality building. Hundreds were out on the streets of Hilla and Diwaniya.\n\nDemonstrators disperse as Iraqi security forces use tear gas during a protest over unemployment, corruption and poor public services, in Baghdad, Iraq October 2, 2019. REUTERS/Thaier al-Sudani\n\nThousands gathered in the oil-rich city of Basra but the protests were peaceful. There were peaceful protests in Samawa.\n\nSmall protests also took place in the northern cities of Kirkuk and Tikrit, as well as the eastern province of Diyala.\n\nInternet access was cut off across much of Iraq, internet blockage observatory NetBlocks said.\n\nHIGH ALERT\n\nAbdul Mahdi on Wednesday chaired an emergency meeting of the national security council, which issued a statement regretting deaths and injuries on both sides.\n\n“The council affirms the right to protest, freedom of expression, and the protesters’ legitimate demands, but at the same time condemns the acts of vandalism that accompanied the protests,” it said.\n\nAll military units were placed on high alert, the defence ministry said.\n\nSecurity forces blocked several roads in Baghdad, including a bridge that leads to the fortified Green Zone, which houses government buildings and foreign embassies.\n\nIn an attempt to cool tempers, Abdul Mahdi on Tuesday promised jobs for graduates. He instructed the oil ministry and other government bodies to include a 50% quota for local workers in subsequent contracts with foreign companies.\n\nOil-producing Iraq has suffered hardships for decades, from rule by Saddam Hussein including years subject to U.N. sanctions, to the 2003 U.S. invasion and civil war it unleashed, and then the battle against Islamic State, which was declared won in 2017.\n\nSlideshow (4 Images)\n\nCorruption is widespread and basic services such as power and water are lacking.\n\nThe government said on Tuesday that 40 members of the security forces were hurt and at least 11 more were injured on Wednesday.", "description": "Iraqi Prime Minister Adel Abdul Mahdi on Wednesday declared a curfew in Baghdad until further notice after at least seven people were killed and more than 400 were injured during two days of nationwide anti-government protests.", "authors": ["Ahmed Rasheed", "Ahmed Aboulenein", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191002&t=2&i=1436364978&w=1200&r=LYNXMPEF911FR"}