{"pub": "euronews", "url": "https://euronews.com/2019/10/19/robotic-mayflower-cross-atlantic-400th-anniversary-pilgrims-journey-ncna1068861", "downloaded_at": "2019-10-19 11:45:33.418932+00:00", "title": "Robotic 'Mayflower' to cross the Atlantic on 400th anniversary of Pilgrims' journey", "language": "en", "text": "Four hundred years after the Mayflower crossed the Atlantic Ocean in 1620 and brought the Pilgrims to America, a new kind of ship is poised to make the same 3,200-mile voyage — but this time there won't be a single human on board.\n\nThe Mayflower Autonomous Ship will set sail from Plymouth, England, on Sept. 6, 2020, and is expected to make landfall in Plymouth, Massachusetts, about 12 days later. The futuristic ship — powered by solar and wind energy and guided by GPS — will make the journey as part of an international celebration marking the 400th anniversary of its namesake's crossing.\n\n\"There's never really been anything of this scale undertaking a mission of this kind,\" said Kevin Jones, executive dean of the faculty of science and engineering at the University of Plymouth in England, which is part of a consortium of universities, tech firms and nonprofit organizations involved with the project. \"We wanted something that would be visually interesting and forward-looking — something that would capture the public's imagination.\"\n\nNow under construction in a shipyard in Gdansk, Poland, the sleek trimaran will be 53 feet long and will have solar panels covering its three aluminum hulls. Solar energy will be stored in onboard batteries, and will power the vessel's electric motors and propellers.\n\nThe ship's top speed is expected to be about 20 knots (23 miles per hour). Though Jones and his colleagues are hoping to not need it, the vessel will be equipped with a biodiesel backup generator for emergency situations.\n\nThe Mayflower Autonomous Ship\\'s journey is expected to take about 12 days. University of Birmingham\\'s Human Interface Technologies Team (HIT)\n\nThe new ship will be equipped with sensors to measure air pressure, water temperature and salinity, and will collect water samples to measure levels of microplastic pollution in the ocean. The vessel will also have acoustic sensors to eavesdrop on marine mammals, such as whales, to study their populations in different regions of the ocean.\n\n\"We want to illustrate what an autonomous ship can do, so that it can serve as a gateway to other opportunities,\" Jones said, referring to his hope that this project will inspire other lines of scientific research.\n\nThe Mayflower Autonomous Ship is being built by MSubs, an engineering firm based in Plymouth, England. IBM recently joined the project to oversee development of the artificial intelligence systems that will help the ship navigate and make on-the-fly decisions about its course — including steering clear of other vessels.\n\nScience\n\nStephen Turnock, a professor of maritime fluid dynamics at the University of Southampton, who is not involved with the project, praised the ship's innovative design and its hull-integrated solar panels but questioned whether the ship would be able to cope with any stormy weather it encounters on the passage.\n\n\"Because of its size, you do worry about if extreme weather comes in, how it might survive in those conditions,\" he said. \"The sea can be a very extreme environment, and sometimes even with someone onboard a vessel, there's nothing they can do to withstand those conditions.\"\n\nTurnock said it was unlikely that a successful crossing by the new ship would lead to fleets of autonomous ships, particularly large cargo ships. But, he said, the same technologies seen on the new ship could be used on existing vessels to make them safer and more efficient.\n\n\"We probably won't have fully autonomous ships, because you'd always want someone looking after security, but what people do onboard the ship could be very different from what they do at the moment,\" he said. \"Some functions may well be looked after remotely or by automatic systems, which will reduce the number of crew you need. … We'll get a lot of valuable information back from this whole process.\"\n\nWant more stories about science?\n\nSign up for the MACH newsletter and follow NBC News MACH on Twitter and Facebook and Instagram.", "description": "The event's organizers are hoping the autonomous voyage will capture the public's imagination.", "authors": [], "top_image": "https://static.euronews.com/articles/4243824/1000x563_nbc-191017-autonomous-mayflower-1-ew-203p_3f585a9bb8b60c6ff9519b34f1cc53b1.jpg", "published_at": "2019-10-19"}