{"pub": "cnn", "url": "https://bleacherreport.com/articles/2855702-look-dwyane-wade-gabrielle-union-appear-on-college-gameday-make-lebron-bet?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-09-28 21:24:01.735234+00:00", "title": "Look: Dwyane Wade, Gabrielle Union Appear on College GameDay, Make LeBron Bet", "language": "en", "text": "Jordan Strauss/Associated Press\n\nMiami Heat legend Dwyane Wade and superstar actress Gabrielle Union, Wade's wife, appeared on ESPN's College GameDay on Saturday as guest pickers.\n\nUnion, who is an Omaha, Nebraska, native, donned a No. 65 jersey, which is the number Cornhuskers offensive lineman Christian Gaylord wears. Parker Gabriel of the Lincoln Journal Star noted the significance:\n\nAfter stepping off the College GameDay bus, Wade and Union were interviewed by ESPN's Maria Taylor:\n\nUnion said she has been a Nebraska fan \"since birth,\" and D-Wade joked that he is now a Nebraska fan as well since it was \"part of the prenup.\"\n\nOn the campus of the University of Nebraska in Lincoln, it came as little surprise that Union and Wade picked the 3-1 Cornhuskers to upset the 4-0 Ohio State Buckeyes.\n\nWade's former Heat and Cleveland Cavaliers teammate LeBron James suggested a friendly wager with Wade and Union since the Akron, Ohio, native is a Buckeyes fan:\n\nUnion accepted LeBron's challenge:\n\nWith Heisman Trophy candidate Justin Fields under center for OSU, the Buckeyes are 17-point road favorites against dual-threat quarterback Adrian Martinez and the Huskers.\n\nOhio State is 6-1 all-time against Nebraska, and it hasn't dropped a game to the Cornhuskers since 2011.", "description": "Miami Heat legend Dwyane Wade and superstar actress Gabrielle Union, Wade's wife, appeared on ESPN's  College  GameDay   on Saturday as guest pickers.   Union, who is an Omaha, Nebraska, native, donned a No...", "authors": ["Mike"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/830/459/hi-res-cf1cfe794f8189cedf6d0c84df0a8cc2_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-09-28"}