{"pub": "wsj", "url": "https://wsj.com/articles/san-francisco-offers-to-buy-pg-e-wires-in-city-11567960938?mod=rsswn", "downloaded_at": "2019-09-08 23:28:33.212181+00:00", "title": "San Francisco Offers to Buy PG&E Wires in City", "language": "en", "text": "San Francisco offered $2.5 billion to acquire PG&E Corp. PCG -3.50% ’s electrical lines serving the city, a first step toward separating from the troubled utility that is facing billions of dollars in liabilities for starting a series of deadly wildfires.\n\nThe proposal, which officials discussed publicly on Sunday, is a significant escalation by San Francisco in its bid to create a municipal utility that is owned and operated by the city. It comes a day before PG&E is expected to unveil its plan to reorganize and leave chapter 11 bankruptcy protection by a California-imposed deadline next year.\n\nPG&E said it is open to considering the offer. City leaders are scheduled to meet with Chief Executive Bill Johnson on Sept. 26 to discuss the proposal, according to the city’s offer letter.\n\nSan Francisco began exploring the possibility of a public takeover of the lines serving the city after PG&E sought chapter 11 in January, citing more than $30 billion in potential liability costs stemming from its role in sparking deadly and destructive wildfires in recent years.\n\nIf PG&E accepts the bid, it would lose hundreds of miles of wires and hundreds of thousands of customers in a symbolically important corner of its service territory. While San Francisco, with a population of less than a million, constitutes a fraction of PG&E’s 16 million customers, the city is home to the company’s headquarters, as well as major financial corporations such as Wells Fargo & Co. and technology giants such as Twitter Inc. that feed power demand.\n\nSan Francisco’s move to break from PG&E is a public vote of no confidence in the company, which has struggled to prevent its equipment from igniting fires amid a sharp increase in wildfire risk in Northern California. The bid, subject to negotiation, comes as the company looks for ways to pay mounting liability costs tied to fires that collectively killed more than 100 people and destroyed thousands of homes in 2017 and 2018.\n\nMayor London Breed and City Attorney Dennis Herrera said in a written statement that the city’s offer is “competitive, fair and equitable.” They added: “It will offer financial stability for PG&E, while helping the City expand upon our efforts to provide reliable, safe, clean and affordable electricity to the residents and businesses of San Francisco.”\n\nThe bid would be subject to approval by federal regulators as well as the California Public Utilities Commission, which has been exploring ways to make the utility’s operations safer as the company invests billions of dollars in risk-reduction efforts. The possibilities include splitting PG&E’s gas and electric divisions into separate companies, and selling off part or all of PG&E’s electric grid to cities.\n\nThe offer, submitted as part of the bankruptcy process, follows months of study by San Francisco’s public utilities commission and board of supervisors. Ms. Breed told PG&E in March that the city would undertake an analysis to determine whether municipalization would benefit residents and what it might cost to acquire the electric assets.\n\nIn a preliminary report released earlier this year, San Francisco’s public utilities commission said public ownership of PG&E’s power lines could result in lower electricity rates for city residents, in part because the nonprofit agency has access to low-cost financing and could eliminate certain fees paid to the company. The commission said it would fund the acquisition of PG&E’s assets by selling revenue bonds.\n\nIn a written statement, PG&E said it will engage with the city on its offer.\n\n“PG&E has been a part of San Francisco since the company’s founding more than a century ago, and while we don’t believe municipalization is in the best interests of our customers and stakeholders, we are committed to working with the City and will remain open to communication on this issue,” it said.\n\nSan Francisco’s offer is the first step in what could prove to be a challenging process of creating a municipal utility akin to those currently operated by Los Angeles and Sacramento, Calif. The city has for years considered making such a move, but the efforts have failed to gain much traction amid pushback from PG&E and concerns about costs and benefits.\n\nPG&E has long held sway in protecting its near-total monopoly in Northern California. When Sacramento moved to separate from PG&E nearly a century ago, it took more than 20 years to establish the Sacramento Municipal Utilities District after contentious negotiations with the utility.\n\nNow, with PG&E in bankruptcy court, San Francisco’s offer will be subject to scrutiny from stakeholders and, ultimately, the judge tasked with overseeing the company’s restructuring. California legislation passed earlier this year requires PG&E to emerge from bankruptcy by June 2020 in order to participate in a state wildfire fund.\n\n“It may be out of PG&E’s hands,” said Barry Moline, executive director of the California Municipal Utilities Association. “This will end when the bankruptcy judge makes the final decision.”\n\nPurchasing PG&E’s electric assets in the city would require San Francisco to expand the role of the public utilities commission to include operating the grid and ensuring its reliability. Already, most of the city’s electricity demand is served by a community-choice aggregation program that contracts for clean power.\n\nThe removal of San Francisco from PG&E’s 70,000-square-mile service territory would likely affect rates and service for those in rural and suburban areas outside of the city by reducing the number of customers paying for the operation and maintenance of the grid.\n\nMichael Wara, head of the climate- and energy-policy program at Stanford University’s Woods Institute, said it is incumbent upon California to examine how San Francisco’s takeover bid would affect those customers.\n\n“In order for this to happen, the state of California would have to be amenable,” he said. “There is reason to suspect it might have some negative consequences for the people left behind.”\n\nA takeover would face opposition from PG&E’s unions. Tom Dalzell, business manager of International Brotherhood of Electrical Workers Local 1245, which represents 17,000 PG&E employees and contractors, said his union would oppose the proposed acquisition by San Francisco, and questioned whether the city had the legal right to make this move without a public vote.\n\nMoreover, Mr. Dalzell added, “I think their offer is off by a factor of four. They don’t have the workforce either—the underground workers, the engineers to run the system.”\n\nThe union helped defeat initiatives in 2001 and 2003 to create a city-owned utility, and credited Gov. Gavin Newsom ’s role in assisting it then when he served as both mayor and supervisor of San Francisco.\n\nBarbara Hale, assistant general manager for power at the San Francisco Public Utilities Commission, said the agency plans to discuss with the union the possibility of employing some of PG&E’s workforce as it builds out a division to operate the grid.\n\n“We envision a transition plan with PG&E for a smooth handoff,” she said.\n\n—Jim Carlton contributed to this article.\n\nWrite to Katherine Blunt at Katherine.Blunt@wsj.com", "description": "San Francisco said Sunday that it has offered $2.5 billion to acquire PG&E Corp.’s electrical lines serving the city.", "authors": ["Katherine Blunt", "Katherine.Blunt Wsj.Com"], "top_image": "https://images.wsj.net/im-105099/social", "published_at": "2019-09-08"}