{"pub": "fox", "url": "https://foxnews.com/entertainment/the-who-pete-townshend-child-porn-arrest-cancer", "downloaded_at": "2019-10-28 00:28:32.279333+00:00", "title": "The Who's Pete Townshend: Child porn arrest saved my life", "language": "en", "text": "The Who's Pete Townshend has said his child abuse pics arrest saved his life — as it led him to discover he had bowel cancer.\n\nGuitarist Townshend, 74, admitted using his credit card to access a sick website in 2003, although he downloaded no images.\n\nHe was given a police caution and put on the Sex Offenders Register for five years — claiming he was only trying to prove banks were complicit with vile online pedophile networks.\n\nPETE TOWNSHEND SPEAKS OUT ON PAST ALCOHOL ABUSE\n\nHe told the Mail On Sunday: \"Just for the record, my arrest was probably one of the best things that ever happened to me. It probably saved my life.\"\n\nTownshend explained that he had been putting off having a bowel cancer check until cops raided his home.\n\nHe added: “While I was waiting for the police to go through my computers I decided to have that long-postponed colonoscopy. The doctor showed me the polyp. He said ‘this would have killed you in six months’. So it sort of saved my life.”\n\nTHE WHO'S ROGER DALTREY SAYS PETE TOWNSHEND SMASHED GUITARS TO IMPRESS GIRLS\n\nTHE WHO'S PETE TOWNSHEND SAYS CHILD PORN FORAY WAS 'RESEARCH,' 'INSANE'\n\nTownshend, who survived abuse as a child, said the stigma of his brush with the law still haunts him.\n\nHe added: “It’s something I think about a lot. I’m very much involved in supporting charities that deal with the consequences of the sexual abuse of children, including those that are photographed. So no, I don’t think it has passed.”\n\nPETE TOWNSHEND BLOWS OFF HOWARD STERN\n\nTownshend and Who frontman Roger Daltrey, 75, are the only surviving founders of the 60s superstar group.\n\nDrummer Keith Moon died of a drug overdose in 1978 aged 32 and bassist John Entwistle had a fatal heart attack in 2002 aged 57.\n\nThe band is due to release a new album — titled \"Who\" — next month.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThis article originally appeared in The Sun.", "description": "The Who's Pete Townshend has said his child abuse pics arrest saved his life - as it led him to discover he had bowel cancer.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/pete-townshend-getty.jpg", "published_at": "2019-10-27"}