{"pub": "japantoday", "url": "https://japantoday.com/category/sports/china-asked-nba-to-fire-rockets-exec-over-hong-kong-tweet-silver", "downloaded_at": "2019-10-18 04:50:11.450013+00:00", "title": "China asked NBA to fire Rockets exec over Hong Kong tweet: Silver", "language": "en", "text": "basketball\n\nBy Brian Ach\n\nChina demanded that a Houston Rockets executive be sacked for supporting pro-democracy protesters in Hong Kong, NBA commissioner Adam Silver said Thursday, adding that the league's row with Beijing had \"substantial\" financial consequences.\n\nRockets general manager Daryl Morey ignited a firestorm earlier this month with a tweeted image captioned \"Fight for Freedom. Stand with Hong Kong.\"\n\nIt came right before the Los Angeles Lakers and Brooklyn Nets arrived in China for what proved to be a tense two-game exhibition tour, with broadcasters there refusing to air the games, public protests against Morey's comments and local sponsors cutting ties with the NBA.\n\nHong Kong has been rocked by months of demonstrations by citizens who accuse Beijing of chipping away at its freedoms, but China has portrayed the protesters as violent separatists and bristled at any foreign interference in the matter.\n\nThe backlash in China against Morey's comments has cast a cloud over the NBA's lucrative broadcasting, merchandising and sponsorship interests in the country, where it has legions of fans.\n\n\"We were being asked to fire him by the Chinese government, by the parties we dealt with, government and business,\" Silver said during a panel discussion in New York. \"We said there's no chance that's happening. There's no chance we'll even discipline him.\"\n\nBut the NBA chief said the dispute over Morey's actions had taken a big toll on the league's bottom line.\n\n\"I don't know where we go from here,\" Silver said. \"The financial consequences have been and may continue to be fairly dramatic. The losses have already been substantial. Our games are not back on the air in China as we speak, and we'll see what happens next.\"\n\nSilver hit back at criticism of the NBA's early statements on the crisis, which many saw as overly deferential to Beijing.\n\n\"We were saying we regretted upsetting our fans (but) also at the same time supporting Daryl Morey's right to express himself, right to tweet... Maybe I was trying too hard to be a diplomat. There was no regret directed to the government (but instead) to our fans, hundreds of millions of them in China.\"\n\nBeijing's response to Morey's comments sparked U.S. accusations that Beijing was using access to its vast market as leverage to dictate speech in other countries.\n\nBasketball superstar LeBron James, who traveled to China with the Lakers for the exhibition games, this week said Morey \"wasn't educated\" on the situation and suggested the Rockets executive should have kept his mouth shut.\n\nBut Silver said Thursday that the league had a responsibility to defend freedom of speech.\n\n\"The values of the NBA -- the American values, we are an American business -- travel with us wherever we go,\" he said. \"And one of those values is free expression.\"\n\nSince the row began, the NBA has also found itself under pressure from U.S. politicians and media outlets who have urged the league not to buckle under Chinese criticism or even to withdraw from the Chinese market completely.\n\n\"I understand there's a point of view from some that we shouldn't be in business at all in China and I'd say from an intellectual standpoint that's fair,\" Silver said. \"But if people believe we shouldn't be engaged in commerce in China... I look to the American government.\"\n\n\"Many multinational corporations trade extensively with China and if that's ultimately how our government feels we should be dealing with China, again, we're a U.S. company.\"\n\nBut Silver feared that the NBA's 15-year effort to build cultural ties with China and expand the game's reach there had been undermined by the Morey dispute.\n\n\"I felt we had made enormous progress in terms of building cultural exchanges with the Chinese people,\" Silver said. \"I have regret that much of that was lost.\"\n\n© 2019 AFP", "description": "China demanded that a Houston Rockets executive be sacked for supporting pro-democracy protesters in Hong Kong, NBA commissioner Adam Silver said Thursday, adding that the league's row with Beijing had \"substantial\" financial consequences. Rockets general manager Daryl Morey ignited a firestorm earlier this month with a tweeted image captioned \"Fight…", "authors": [], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/85/03/26d3bb7c733cfa376c6128a602f84c115bba/850326d3bb7c733cfa376c6128a602f84c115bba.jpg", "published_at": "2019-10-18"}