{"pub": "investing.com", "url": "https://coindesk.com/browser-extensions-can-help-scammers-steal-your-bitcoin-casa-ceo", "downloaded_at": "2019-09-15 14:39:35.202272+00:00", "title": "Browser Extensions Can Help Scammers Steal Your Bitcoin: Casa CEO", "language": "en", "text": "Browser extensions can help scammers steal your crypto Casa CEO Jeremy Welch warned the audience at the Baltic Honeybadger conference in Riga this weekend.\n\n“Browser extensions impose major risks, and these risks haven’t been discussed until this point,” Welch said.\n\nExtensions can gather a wealth of data, which can be leaked, stolen, and used by scammers. One example is browser history, which can expose users’ online habits, including crypto-related site visits.\n\n“Make sure you don’t expose your bitcoin addresses anywhere,” Welch warned.\n\nAnother thing to keep in mind is that some extensions capture users’ KYC information and can leak it to scammers. The only major multisig system that requires KYC at the moment is the one supplied by Unchained Capital, Welch said. He warns against commonly-used consumer software that gathers identity data.\n\nAs an example, Welch demonstrated how an extension providing wallpapers with inspiring quotes or other content was actually stealing data as you filled in KYC forms. The malware stole graphical data, like a photo of your driver’s license, which is captured as a code and then easily decoded, providing an actual picture of your ID document to hackers.\n\nQuiet data thefts\n\nAll this is happening on the background, without the user noticing.\n\n“You got a nice background here and you don’t realize that your browser is actually dumping data,” Welch said.\n\nThe same wallpaper extension can alter a receiving address when you’re trying to send your crypto to somebody else (or to yourself), sending it to a scammer’s wallet instead. The ubiquity and popularity of browser extensions makes the situation quite dangerous, Welch noted:\n\n“It’s terrifying, right? We all are using browser extensions all the time.”\n\nEven if a user is very careful and selective in what they’re using, the software can be upgraded and get new, unsafe features without a consumer noticing, Welch added.\n\nWelch noted that many well-known applications are gathering personal data including password managers, text editing app Grammarly, Joule extension for in-browser Lighting transactions, and the Lolli bitcoin-earning extension.\n\nThe solution? There is no easy one, Welch says. Developers can only keep building better tools that will make users’ experience safer and better.\n\n“We all need to be discussing this issues more, because we’re not even in the phase yet when real attacks will be taking place.”\n\nWelch added that Casa is planning to publish more security research soon and encouraged bitcoin developers and entrepreneurs to approach the company and share their concerns and ideas on how to address security issues.\n\nImage of Jeremy Welch by Anna Baydakova for CoinDesk", "description": "", "authors": [], "top_image": "https://static.coindesk.com/wp-content/uploads/2019/09/Jeremy-Welch.jpg", "published_at": "2019-09-15"}