{"pub": "news24", "url": "https://sport24.co.za/Rugby/RugbyWorldCup2019/jantjies-healed-up-ahead-of-dream-quarter-final-20191016", "downloaded_at": "2019-10-16 07:27:46.797414+00:00", "title": "Jantjies 'healed up' ahead of dream quarter-final", "language": "en", "text": "Cape Town - Springbok scrumhalf Herschel Jantjies says he is fully recovered from the hamstring strain that briefly threatened his participation in Sunday's World Cup quarter-final against Japan in Tokyo.\n\nThe 23-year-old, who burst onto the international stage in 2019 with a series of impressive performances in Bok colours, was a slight injury concern having picked up the knock after coming off the bench in South Africa's final pool game against Canada last week.\n\nThe good news for the Boks is that Jantjies, along with star wing Cheslin Kolbe, has been declared fit by head coach Rassie Erasmus and he will likely be named on the bench for Sunday's clash with Faf de Klerk starting at No 9.\n\n\"I healed up quite nicely – my hamstring is fine and I trained yesterday (Tuesday). I'm feeling good for today’s training,\" were the encouraging words from Jantjies on Wednesday.\n\nWith just one full season of Super Rugby and 8 Tests to his name, Jantjies' rise to the top has been meteoric and he now finds himself on the biggest stage of them all.\n\nJantjies knows that his composure will be tested.\n\n\"Japan play a fast brand of rugby, and it’s important for us not to lose our cool, and keep sticking to what we do best,\" he said.\n\n\"Hopefully, we can nullify their pace, and it can turn out to be a good day for us.\"\n\nThe Boks will enter the match as overwhelming favourites, but the Japanese public will be fully behind their side at Tokyo Stadium in what is sure to be an electric environment.\n\n\"It’s a tough one – I don’t think you can ever prepare for it, because it’s going to be packed,\" Jantjies said of Japan's home advantage.\n\n\"It will be important for us to stay in the moment and not let that get to any of us.\n\n\"The difficult thing will be to communicate on the field, but I’m sure we will find something to fix that.\"\n\nKick-off on Sunday is at 12:15 (SA time) and the Boks will name their side on Thursday", "description": "Springbok scrumhalf Herschel Jantjies knows the importance of keeping his cool in Sunday's World Cup quarter-final against Japan.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9386/a9ad7cec613f47b1a7530163ae9005f5.jpg", "published_at": "2019-10-16"}