{"pub": "reuters", "url": "https://reuters.com/article/us-britain-eu-breakingviews/breakingviews-johnsons-do-or-die-brexit-is-unravelling-idUSKCN1VO1NG", "downloaded_at": "2019-09-03 23:45:54.973470+00:00", "title": "Breakingviews - Johnson’s “do or die” Brexit is unravelling", "language": "en", "published_at": "2019-09-03", "text": "Britain's Prime Minister Boris Johnson addresses the media outside Downing Street in London, Britain, September 2, 2019.\n\nLONDON (Reuters Breakingviews) - Boris Johnson’s Brexit strategy is already unravelling. Six weeks after he took office with a promise to leave the European Union by Oct. 31, “do or die”, the British prime minister is running out of escape routes.\n\nThe former London mayor insists his preference is for Britain to leave the EU by renegotiating the deal struck by his predecessor Theresa May. That always looked a long shot. UK ministers claim European leaders are willing to rethink the agreement. But with just 58 days to go until the Brexit deadline, the government has yet to come up with any concrete proposals to avoid a hard border in Northern Ireland, a key EU requirement.\n\nIf the deal cannot be revised, Johnson has pledged to leave the EU on Oct. 31 without one. That door is also closing, though. The prime minister’s opponents in parliament were on Tuesday preparing to take control of the legislature, enabling them to pass a bill that would force the government to extend the Brexit deadline by three months if it does not secure a deal. Rebel lawmakers from Johnson’s Conservative Party – including Philip Hammond, the former finance minister – are supporting the plan, threatening the government’s miniscule majority.\n\nThe prime minister on Monday indicated that if parliament blocked a “no-deal” Brexit, he would turn to his third escape route: calling an early election, probably on Oct. 14. However, he needs the backing of two-thirds of parliament to bring forward the poll, which is not due until 2022. It would be folly for the opposition Labour Party to support that plan if a “no-deal” Brexit at the end of October remains a risk.\n\nBeyond this, Johnson could take more extreme measures to frustrate parliamentary opposition, such as trying to kill off a Brexit extension in the House of Lords, Britain’s unelected second chamber. He might even ask the queen to refuse her assent for the legislation, plunging the country into an even deeper constitutional crisis. The pound on Tuesday morning dipped below $1.20.\n\nBut such actions would further anger opponents already outraged by Johnson’s decision last week to suspend parliament for more than four weeks, strengthening their determination to bring down his administration. For Johnson’s government, the choice of “do or die” looks increasingly like the latter.", "description": "(Reuters Breakingviews) - Boris Johnson’s Brexit strategy is already unravelling. Six weeks after he took office with a promise to leave the European Union by Oct. 31, “do or die”, the British prime minister is running out of escape routes.", "authors": ["Peter Thal Larsen", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190903&t=2&i=1425773234&w=1200&r=LYNXNPEF82189"}