{"pub": "afr", "url": "https://afr.com/rear-window/ndis-can-t-see-the-issue-with-chairman-s-macquarie-emails-20191029-p535h0", "downloaded_at": "2019-10-30 00:00:13.888233+00:00", "title": "NDIS \"can't see the issue\" with chairman's Macquarie emails", "language": "en", "text": "NDIA acting chief executive Vicki Rundle said she would have to check if NDIA chair Helen Nugent has breached privacy rules. Dominic Lorrimer\n\nAt Thursday’s session of Senate Estimates, National Disability Insurance Agency acting chief executive Vicki Rundle fronted the Community Affairs Committee.\n\nLabor Senator Murray Watt spent nearly 15 minutes grilling the senior public servant on NDIA chairman Helen Nugent’s use of Macquarie Group’s corporate facilities – including the bank’s email server – for NDIS business. Nugent is a former member of Macquarie’s board and maintains her private office in its Martin Place headquarters.\n\n“Sometimes participants [or] people that she’s met with might email her on her [Macquarie] email,” Rundle acceded. “I do think if people … in the community email Dr Nugent on her Macquarie email address, I don’t see that that’s at all unusual. I’m trying to work out what the actual issue might be.”\n\nWere it merely the case that NDIS participants had freely shared their information with the agency’s chairman at her Macquarie address, there wouldn’t be an issue. Sadly, that isn’t the extent of Nugent’s use of an external email system in the conduct of the agency’s oversight.\n\nThough you wouldn’t know it from Rundle’s testimony. “I would say in the majority, [Dr Nugent’s] NDIS business is conducted through the NDIS email system,” Rundle also impressed upon Watt. “Senator, as I said, Dr Nugent’s NDIS-related emails between the NDIS and her are conducted on NDIS email.” And finally, “There has been no … breach of privacy to my knowledge.”", "description": "Senator Murray Watt might ask for the paper trail, but it’s probably sitting on a bank server.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2373%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_18/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/422b21f9d49037924890ce69787c995b9f83817d", "published_at": "2019-10-29"}