{"pub": "heritage", "url": "https://heritage.org/press/carafano-hr-6-unserious-mass-amnesty-proposal", "downloaded_at": "2019-09-04 04:09:55.439185+00:00", "published_at": "2019-09-04", "title": "Carafano: H.R. 6 \"An Unserious, Mass-Amnesty Proposal\"", "language": "en", "text": "WASHINGTON, D.C. -- James Carafano, vice president of The Heritage Foundation's Davis Institute for National Security and Foreign Policy, responded Wednesday to H.R. 6, the mass-amnesty bill that passed the House Tuesday:\n\n“Americans should be able to trust our leaders to uphold and enforce our nation’s laws. Unfortunately, liberal proposals being voted on in the House this week undermine the rule of law and break trust with America.\n\n“The United States is facing an undeniable humanitarian and security crisis at our border, but the Left’s response is H.R. 6, an unserious, mass-amnesty proposal which would only exacerbate the crisis at the border and bring enforcement to a breaking point. History is clear: when Washington signals a willingness to grant even limited amnesty, illegal immigration increases, as do the humanitarian costs to the most vulnerable – those being trafficked through Central America to the border.\n\n“To reform the immigration system, we must start by enforcing the laws currently on the books. Recent reports that the Trump administration is preparing to enforce the law and step up deportations of all those who did not appear in court for asylum claim judgments is just one of the proper steps Washington must take in removing incentives to illegal crossings.\n\n“As Heritage research has pointed out repeatedly, Congress must get serious about securing the border, reforming a broken asylum system, and improving internal enforcement of immigration laws. Until it does, the crisis at the border will only increase, to the detriment of American citizens, those seeking freedom and opportunity in the U.S., and, of course, the rule of law.”", "description": "WASHINGTON, D.C. -- James Carafano, vice president of The Heritage Foundation's Davis Institute for National Security and Foreign Policy, responded Wednesday to H.R. 6, the mass-amnesty bill that passed the House Tuesday:", "authors": [], "top_image": "https://www.heritage.org/themes/heritage/src/images/bell.png"}