{"pub": "reuters", "url": "https://in.reuters.com/article/us-thomas-cook-grp-investment-poland/thomas-cooks-polish-business-goes-into-insolvency-idINKBN1WA0SO", "downloaded_at": "2019-09-25 13:45:56.547658+00:00", "title": "Thomas Cook's Polish business goes into insolvency", "language": "en", "text": "FILE PHOTO: A passenger hauls his luggage past a sign of the collapsed travel firm Thomas Cook at Jerez de la Frontera Airport, Spain September 23, 2019. REUTERS/Jon Nazca/File Photo\n\nWARSAW (Reuters) - Thomas Cook’s Polish business Neckermann Polska said on Wednesday it was insolvent as the effects of the demise of the world’s oldest travel firm spread to central Europe, leaving around 3,600 Polish tourists stuck abroad.\n\nThomas Cook, which started life in 1841 running local rail excursions and grew to pioneer package holidays, collapsed early on Monday stranding hundreds of thousands of holidaymakers.\n\n“The Polish unit, despite its stable financial condition, cannot operate independently without its mother company,” Neckermann Polska said in a statement.\n\n“The problems of our owner on the British and German markets are the cause of the liquidation of operating activities in many global markets, including Poland.”\n\nThomas Cook’s German division also filed for insolvency on Wednesday, with a view to carving out its brands and businesses from their failed parent.\n\nAuthorities in Poland’s Mazowieckie region, which includes the capital Warsaw, told a news conference around 3,600 tourists who had bought Neckermann Polska holidays were currently abroad.\n\n“The biggest group of tourists remains in the Mediterranean basin, we have the biggest problems in Majorca, Turkey and Tunisia,” Izabela Stelmanska, director of the department for culture, promotion and tourism for the Mazowieckie region told a news conference.\n\n“We are examining cases where firstly we should help tourists by ensuring they can stay until their planned return date and where it will be necessary to arrange an earlier return to the country.”\n\nNeckermann Polska employs around 140 people, it said.", "description": "Thomas Cook's Polish business Neckermann Polska said on Wednesday it was insolvent as the effects of the demise of the world's oldest travel firm spread to central Europe, leaving around 3,600 Polish tourists stuck abroad.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190925&t=2&i=1433745516&w=1200&r=LYNXMPEF8O0H4", "published_at": "2019-09-25"}