{"pub": "indiatimes", "url": "https://indiatimes.com/sports/simon-sundararaj-indian-football-s-forgotten-hero-whom-most-of-us-have-probably-never-heard-of-378082.html", "downloaded_at": "2019-10-18 10:35:24.972600+00:00", "title": "Simon Sundararaj, Indian Football's Forgotten Hero Whom Most Of Us Have Probably Never Heard Of", "language": "en", "text": "Ask the average Indian football fan about the top players and names like Cristiano Ronaldo and Lionel Messi shall come to light. Someone who is a keen student of the game will go back to the days of Pele and Maradona. But ask them to name an Indian player, well the names will get fewer.\n\nSome might take the name Sunil Chhetri and a few will mention Bhaichung Bhutia but that is it. The likes of Chuni Goswami are pretty much pushed into the background. Now let's take a name we are pretty sure you have never heard of - Simon Sundararaj.\n\nDoes it ring a bell? Well to us modern fans it will not. For her was before our time. Be as it may, this man is a hero of Indian football who has been forgotten. Now he is away from the spotlight and pretty much keeps to himself.\n\nTwitter\n\nSo who is he? Let's find out more about the man.\n\nSimon played as a midfielder for India. He was part of the 1960 Olympics when India played as the only country from Asia. He scored 3 goals and since India have never qualified again, he is till now the last Indian to have scored at the Games.\n\nDon't Miss 382 SHARES 141 SHARES 553 SHARES 846 SHARES\n\nA cartilage tear made his lose his place in the side soon after and he was not part of the team which won an Asiad gold in 1962. After his playing days he coached the Kerala state team which won its first Santosh Trophy in 1973.\n\nHis playing career may have been short, but as a coach he had a big role in the golden years of Kerala football. Simon maintains till today that he took up the game because it was fun. That was always his objective.\n\nHe is sad about the fact that despite what he gave to the game, he did not get much in return. Like many footballers of his generation, he too has been forgotten after retiring. He feels that the struggles many footballers face after they leave is the reason why the game has not gathered momentum in the country as the players are not being looked after. The man himself is an example.\n\nNow he is all but unknown in a nation of so many people. He played the beautiful game, and has no regrets about it. What we should regret is that we were not able to give him his due.", "description": "Ask the average Indian football fan about the top players and names like Cristiano Ronaldo and Lionel Messi shall come to light. Someone who is a keen student of the game will go back to the days of Pele and Maradona. But ask them to name an Indian player, well the names will get fewer. Some might take the name Sunil Chhetri and a few will mention Bhaichung Bhutia but that is it. The likes of Chun", "authors": ["Somak Adhikari"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/simon_sundararaj_is_a_legend_of_indian_football_1571392062_800x420.jpg", "published_at": "2019-10-18"}