{"pub": "indiatimes", "url": "https://indiatimes.com/trending/wtf/video-roads-littered-on-diwali-in-new-jersey-378821.html", "downloaded_at": "2019-10-29 14:06:59.811719+00:00", "title": "Celebration Much? Video Shows Indian Square In New Jersey Littered After Diwali & It's Shameful", "language": "en", "text": "Diwali is a festival which is celebrated by people all across the country, and even by Indians who leave overseas, far away from their motherland. It is called the festival of lights, but people have made it a ‘festival of firecrackers’! The aftermath of the festival is hazardous and despite so many campaigns to dissuade people from bursting crackers, there was very less, if any restraint shown on that front.\n\nA video that is going viral on social media shows empty boxes, wrappers of firecrackers and other materials littered on the roads. No, not on Indian roads, but on New Jersey roads! A large crowd gathered at the India Square - where all the Indians celebrated Diwali.\n\nYou can see some people speaking in Hindi in the video and seconds later, a New Jersey police van is seen patrolling on the streets. The video was shared on Twitter with the caption, ‘Ashamed to be called an Indian. Last Night on Indian Street near Journal Square New Jersey. Hats off to NJ Police handling the mess Very professionally’.\n\nWatch the video here:\n\nAshamed to be called an Indian\n\nLast Night on Indian Street near Journal Square New Jersey\n\nHats off to NJ Police handling the mess Very professionally 👏👏 pic.twitter.com/39nVmGaejO — sANDhya (@DhooDala) October 28, 2019\n\nThe video garnered over 35.5 k views, 536 likes and comments.\n\n1.\n\nSo called the best Culture in the world, my @$ — Rakesh Mhatre (@Rakesh6497) October 29, 2019\n\nDon't Miss\n\n2.\n\nIndians are champion litterers. 🤣🤣🤣 — Rod O'Net (@rodonet) October 29, 2019\n\n3.\n\nThis place felt like a was zone with all the noise and smoke before the administration has to stop it. pic.twitter.com/LLWhwXkTBC — Harjinder Singh (@pisingh_) October 28, 2019\n\n4.\n\nWish that the NJ police clear we Indians off the streets and the country instead of the mess — Vijayan Rao (@VijayanRao1) October 28, 2019\n\n5.\n\nall indians should undergo compulsory rigorous training camps on cleanliness before entering these developed countries — Kishor Siri (@KishyCool) October 29, 2019\n\n6.\n\nYes.. Totally agree.. I saw it in UK also. One of our person throwing food waste from 3rd floor window. We never bother about the cleanliness. — Bala Iyer (@Bala1000) October 28, 2019\n\n7.\n\nUnless Diwali is celebrated, there is a lurking insecurity!\n\nLittering is inevitable at the present-level we understand as \"celebration\"( masters celebrate a disciple getting enlightened, quietly when whole nature around lights up illogically 🤣🤣🤣) — Narayanan P S (@narayananpsn) October 28, 2019\n\nSpitting and littering is all too common a sight in India, and a fine on people doing the same has been long awaited so that people think twice before littering. It is shameful that mature adults - in our country and abroad - still struggle with the concept of cleanliness. It is indeed disturbing, that the remnants of a glorious festival like Diwali, were litter and shame.", "description": "Diwali is a festival which is celebrated by people all around the world with joy and happiness. It is called the festival of lights but people have made it a ‘festival of firecrackers’! The aftermath of the festival is hazardous and even after so much awareness by the government, people do not care about the environment and burst crackers.", "authors": ["Priyanshi Mathur"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/new_jersey_1572348655_800x420.jpg", "published_at": "2019-10-29"}