{"pub": "businessinsider", "url": "https://businessinsider.com/bruins-blank-blues-3-0-in-1st-meeting-since-losing-cup-final-2019-10", "downloaded_at": "2019-10-27 04:03:58.714126+00:00", "title": "Bruins blank Blues 3-0 in 1st meeting since losing Cup final", "language": "en", "text": "St. Louis Blues' Ivan Barbashev (49) checks Boston Bruins' Chris Wagner during the first period of an NHL hockey game in Boston, Saturday, Oct. 26, 2019. (AP Photo/Michael Dwyer) Associated Press\n\nBOSTON (AP) — David Pastrnak scored his team-leading 11th goal, Tuukka Rask stopped 26 shots for his second shutout this season and the Boston Bruins beat the defending NHL champion St. Louis Blues 3-0 Saturday night in a rematch of the Stanley Cup Final.\n\nIt was the first meeting between the teams since St. Louis won its first Cup last season, skating with the trophy around the TD Garden ice in Boston on June 12 after a 4-1 victory in Game 7.\n\nAnders Bjork also scored for Boston (7-1-2). Brandon Carlo added an empty-net goal with 49 seconds left.\n\nRask, who played his 500th game with the Bruins in a win over Toronto on Tuesday, recorded his 47th career shutout. He's 5-0-1 in six starts this season, picking up his solid play that carried Boston to the final.\n\nJordan Binnington made 21 saves for the Blues (5-3-3), who won their previous two games. In his rookie season, the 6-foot-2 goalie sparked St. Louis to its run from last place in the Western Conference in early January to a title.\n\nLike last spring's Cup final, the matchup featured lots of hard hits, beginning with the first shift when Boston captain Zdeno Chara leveled winger Oskar Sundqvist in front of the Blues bench. Linemate Brayden Schenn skated in to defend Sundqvist and was sent to the penalty box — along with Chara — for matching roughing penalties.\n\nWith David Perron off for holding, Pastrnak one-timed a pass from Torey Krug at the top of the left circle for a power-play goal 14:59 into the opening period. The puck deflected off Binnington and trickled into the net, just as he looked over his shoulder.\n\nRask's best save came when he made a blocker stop on Sundqvist's clean breakaway with seven minutes left in the first.\n\nBoston capitalized on a 3-on-2 break when defenseman Matt Grzelcyk sent a pass to Bjork at the right circle, where he one-timed a shot over Binnington's left shoulder to make it 2-0 at 9:31 of the second.\n\nClinging to the two-goal edge, Rask made a pair of splendid stops when the Blues were on a power play shortly after Bjork's score. The toughest was on Tyler Bozak's wrister from the slot.\n\nNOTES: Pastrnak has an eight-game point streak. . Blues forward Vladimir Tarasenko missed the game with an undisclosed upper-body injury. He didn't travel with the club. GM Doug Armstrong said Tarasenko will be sidelined Sunday in Detroit, too, and re-evaluated when the team returns home after that. . Boston forward David Krejci missed his fourth straight with an undisclosed injury. . Blues D Carl Gunnarsson didn't dress for the fourth consecutive game, but forward F Sammy Blais returned to the lineup.\n\nUP NEXT\n\nBlues: At the Detroit Red Wings on Sunday afternoon.\n\nBruins: At the New York Rangers on Sunday night.\n\n___\n\nMore AP NHL: and", "description": "BOSTON (AP) — David Pastrnak scored his team-leading 11th goal, Tuukka Rask stopped 26 shots for his second shutout this season and the Boston Bruins beat the defending NHL champion St. Louis Blues 3-0 Saturday night in a rematch of the Stanley Cup Final.", "authors": ["Ken Powtak", "Associated Press"], "top_image": "https://www.businessinsider.com/public/assets/BI/US/og-image-logo-social.png", "published_at": "2019-10-27"}