{"pub": "independent", "url": "https://independent.co.uk/travel/48-hours-in/mendoza-city-guide-things-to-do-argentina-wine-tasting-best-restaurants-hotels-vineyards-a9142786.html", "downloaded_at": "2019-10-09 12:08:06.739916+00:00", "title": "Mendoza guide: Where to eat, drink, shop and stay in Argentina’s wine capital", "language": "en", "text": "Argentina’s wine-making capital Mendoza (the name of the city and the province) is a welcome indulgence at any time of year. Dozens of bodegas (wineries) open their cellar doors year round to offer up tastings, paired lunches or picnics among vineyards, many in the shadow of the Andes’ handsome peaks.\n\nBesides its wine-making heritage, Mendoza – officially one of the world’s great wine capitals – has also played its part in Argentina’s history: General José de San Martín led his Army of the Andes across the mountain range from Uco Valley, helping Chile to gain independence from the Spanish in 1817.\n\nThe Independent’s hotel recommendations are unbiased, independent advice you can trust. On some occasions, we earn revenue if you click the links and book, but we never allow this to affect our coverage.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nWhat to do\n\nMendoza capital\n\nShape Created with Sketch. Mendoza guide Show all 6 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Mendoza guide 1/6 Check out General San Martin Park in the city Getty Images/iStockphoto 2/6 Organic vineyards near Mendoza in Argentina Getty Images/iStockphoto 3/6 Central Market in Mendoza Getty Images 4/6 Entre Cielos has stunning vineyard lofts Entre Cielos 5/6 Zuccardi Valle de Uco stands out for all the right reasons Zuccardi Valle de Uco 6/6 Mendoza is wine country Getty Images 1/6 Check out General San Martin Park in the city Getty Images/iStockphoto 2/6 Organic vineyards near Mendoza in Argentina Getty Images/iStockphoto 3/6 Central Market in Mendoza Getty Images 4/6 Entre Cielos has stunning vineyard lofts Entre Cielos 5/6 Zuccardi Valle de Uco stands out for all the right reasons Zuccardi Valle de Uco 6/6 Mendoza is wine country Getty Images\n\nThis small city bustles with activity except during lunchtimes, when it winds down for a siesta. It makes a good base for a night before venturing out into wine country proper, between 20 and 90 minutes’ drive from the city depending where you’re headed. Enjoy leafy squares such as Plaza España or Plaza Chile, or check out Parque General San Martín, named after the aforementioned military hero. As for a first foray into malbec on home turf, book a tasting at Mendoza Wine Room.\n\nSample wine\n\nThe province divides up into five main wine-producing regions: Zona Este and Maipú, which both house centenary bodegas; Luján de Cuyo, known as malbec heartland; Uco Valley, which is closest to the Andes and is the current hub for winemaking innovation; and San Rafael, a three-hour drive south of the provincial capital. Guided winery tours and tastings across all price points are well organised, and most require reservations; roll up unannounced and you might not make it past security at the front gate. Able to keep your balance while sampling vino tinto? Try a bodega-and-bike tour in Luján de Cuyo or Uco Valley with Mendoza Wine Bike Tour.\n\nExplore the great outdoors\n\nWith its proximity to the Andes, Mendoza has plenty of outdoor activities, from whitewater rafting on Río Mendoza, to being on the piste at top ski resort Las Leñas between July and September. There are also equestrian activities such as dawn horseback rides or, for the more advanced, Andean crossings. Ambitious riders should book a five-day Andes crossing with MacDermott’s Argentina.\n\nWhere to stay\n\nIn Luján de Cuyo, pitch up at Swiss-run Entre Cielos, which added eight stunning vineyard lofts with outdoor living space – malbec vines within grabbing reach – to its collection of eclectic suites in January. It also houses an award-winning hammam and excellent restaurant, and hosts weekly barbecues; guests receive a complimentary bottle of malbec. Doubles from $470, B&B.\n\nNear Tupungato in Uco Valley, Bodega Salentein’s posada (lodge) harbours 16 spacious rooms sporting rural design set among the winery’s own vineyards and gardens. Offering peace and tranquillity, it’s a great place to recharge batteries and sip wine accompanied by a view of the valley. Doubles from $200, B&B.\n\nFor a night in the city, NH Mendoza Cordillera is perfectly placed thanks to its central downtown location a stone’s throw from Plaza Independencia. Friendly staff are very helpful in helping guests plan their next moves around Mendoza. Doubles from $65, room only.\n\nWhere to eat\n\nIn Mendoza capital, chef Pablo Del Río at Siete Cocinas focuses on Mendoza ingredients such as kid goat that’s slow-cooked in a clay oven, teamed with embers-roasted onions and pumpkin. The wine list is one of the best in the city.\n\nFor a delectable paired tasting menu accompanied by vineyards within touching distance, book lunch at Fogón at Bodega Lagarde in Vistalba. Work up an appetite visiting the centenary winery before diving into six courses such as organic tomato textures or flame-grilled steak.\n\nTouring bodegas in Luján de Cuyo but on a budget? Make a pitstop at Ezequiel’s food truck on Calle Cobos and Ruta 7 in Ugarteche, from which he serves up enormous sandwiches stuffed with hand-cured Iberian-style ham and finished with a little olive oil. Pull up a plastic chair or take away.\n\nWhere to drink\n\nIn Mendoza capital, head to Aristedes for dozens of craft beer pubs and kiosks selling litre bottles. This street comes alive at night, usually until the crack of dawn on weekends; grab a pint at Hangar 52 or Beerlin, which sports a lively and large cerveza garden.\n\nAlso on Aristedes, check out Gingger. Mixologist Sabrina Rodríguez Cuack won Argentine reality TV show El Gran Bartender in 2016, and this is her cocktail bar.\n\nDown in Paraje Altamira in Uco Valley, stop by Cundo, an adorable tasting room that leads flights starring vintages produced in the area.\n\nWhere to shop\n\nFor a solid selection of wine, stop by Sol y Vino in Mendoza capital for your favourite tipple that you forgot to buy at the winery.\n\nThe Mercado Central (Las Heras 279) is an authentic food market where Mendocinos do their daily shopping and you can pick up souvenirs or gourmet gifts. Note that wineries usually sell their own vintages cheaper on site.\n\nArchitectural highlight\n\nMendoza is home to an array of architecturally dazzling wineries, such as O Fournier in La Consulta (easily confused with a nuclear bunker) and Catena Zapata (reminiscent of a Mayan pyramid) in Agrelo. Zuccardi Valle de Uco is both awe-inspiring and relevant and was also named The World’s Best Vineyard in July. Thousands of tons of rock were removed to make way for vineyards, then received a new lease of life to construct the winery itself; the roof blends in with the Andean foothills opposite. Zuccardi’s tasting room also picked up a gold medal for Architecture and Landscaping in the Great Wine Capitals of the World; splash out on the Aluvional line of single vineyard malbecs.\n\nNuts and bolts\n\nWhat currency do I need?\n\nThe currency in Mendoza is the Argentine peso.\n\nWhat language do they speak?\n\nSpanish.\n\nShould I tip?\n\nTipping in restaurants is voluntary, and about 10 per cent.\n\nWhat’s the time difference?\n\nMendoza is three hours behind the UK and direct flight times average 14 hours to Buenos Aires, with a 90-minute flight connection.\n\nPublic transport\n\nMendoza city centre is small enough to explore by foot. Venture over to Maipú on the metrotranvía (local tram) to visit wineries such as Bodegas López. You need a Red Bus magnetic card to pay.\n\nBest view\n\nWalk or drive to the top of Cerro de la Gloria hill, home to the Army of the Andes Monument, for juxtaposing views of the mountains and the city.\n\nInsider tip\n\nWhen you arrive at the airport, take a remis (taxicab) outside the baggage hall. On your way out, you can carry up to six bottles of wine as hand luggage.", "description": "Argentina’s wine-making capital Mendoza (the name of the city and the province) is a welcome indulgence at any time of year. Dozens of bodegas (wineries) open their cellar doors year round to offer up tastings, paired lunches or picnics among vineyards, many in the shadow of the Andes’ handsome peaks.", "authors": ["Sorrel Moseley-Williams"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/04/17/mendoza.jpg", "published_at": "2019-10-09"}