{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7604011/Students-use-Google-Assistant-create-voice-activated-robot-makes-grilled-cheese-toasties.html", "downloaded_at": "2019-10-23 09:51:27.311017+00:00", "title": "Students use Google Assistant to create a voice-activated robot that makes grilled cheese toasties", "language": "en", "text": "A voice-controlled robot that can make you perfect grilled cheese sandwiches on demand has been created by a team of students in the US.\n\n'Cheesborg' is the brainchild of engineer Tayor Tabb, 24, and colleagues, who created the toastie maker at Carnegie Mellon University in Pittsburgh, Pennsylvania.\n\nThe process begins with a voice command to a connected Google Home smart assistant.\n\nThe cheesy contraption uses a vacuum to begin to assemble the sandwich — loading two slices of bread and one slice of cheese onto its conveyor belt.\n\nNext, the conveyor moves the ingredients into a sandwich press and closes the lid ready for grilling.\n\nWhen the toastie is done, the delicious snack is pushed down into the pickup area where it can be collected and consumed.\n\nScroll down for video\n\nA voice-controlled robot that can make you perfect grilled cheese sandwiches on demand, pictured, has been created by a team of students in the US\n\n'While grilled cheese is a comfort food, the process of making grilled cheese is less than ideal,' said Mr Tabb.\n\n'As hungry college students awake at hours [at which] it's often hard to find food, we knew this was our calling- not just for us, but for grilled cheese eaters everywhere.'\n\n'At first it was simple — what if a robot could make you a grilled cheese?'\n\n'But once that seemed doable, we thought we could be even bolder.\n\n'What if you could make a grilled cheese and make it totally hands free and voice activated and able to be integrated it into a smart home?\n\n'And that, that is Cheeseborg.'\n\n'Our research and testing led us to find the perfect cook time and temperature for our grilled cheese,' he added.\n\nWe optimised for gooey on the inside and crispy on the outside!'\n\n'Cheesborg' is the brainchild of engineer Tayor Tabb, 24, and colleagues, who created the toastie maker at Carnegie Mellon University in Pittsburgh, Pennsylvania\n\nWhen the toastie is done, the delicious snack is pushed down into the pickup area where it can be collected and consumed", "description": "'Cheesborg' is the brainchild of engineer Tayor Tabb, 24, and colleagues, who created the toastie maker at Carnegie Mellon University in Pittsburgh, Pennsylvania.", "authors": ["Ian Randall For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/09/20074134-0-image-a-9_1571819406170.jpg", "published_at": "2019-10-23"}