{"pub": "zdnet", "url": "https://www.zdnet.com/article/surface-neo-microsoft-bets-that-two-screens-can-beat-a-folding-one", "downloaded_at": "2019-10-10 18:28:20.702709+00:00", "title": "Surface Neo: Microsoft bets that two screens can beat a folding one", "language": "en", "text": "Foldable future: How Microsoft hopes to define a new hardware category with Surface Neo and Duo ZDNet's Larry Dignan and TechRepublic's Bill Detwiler discuss why Microsoft's Windows-based Surface Neo and Android-based Surface Duo are just a glimpse at the dual-screen, foldable devices that will redefine the laptop, tablet, and phone markets. Read more: https://zd.net/2oEa5Zj\n\nWhether it be smartphones, laptops or TVs, we want the maximum amount of screen real estate in a minimal amount of space. For several years, the defining metric of this efficiency has been the screen-to-body ratio. The Battle of the Bezel has been dominated by the notchers -- brands such as Apple, LG and Huawei -- countered by a few non-notchers such as ASUS with the flip-up camera on its Zenfone 6 and Oppo with its in-screen camera, and at least one that has straddled (OnePlus with the notchless 7 Pro and notched 7T).\n\nBut the trend has mostly addressed aesthetics. Now, as they exhaust the \"reduce body\" approach, brands are turning to the \"add screen\" approach. Where? Anywhere in terms of the phone's surface, be it inside the phone like the Galaxy Fold, outside the phone like the Huawei Mate X, and around the phone like the head scratch-inducing Xiaomi Mii Mix Alpha. (Alas, between the limited availability and high price of the Galaxy Fold and the political and market barriers facing the Huawei and Xiami devices, US consumers aren't getting a lot of choices among that group.)\n\nFolding devices offer the most flexibility when it comes to apportioning screen real estate. The Galaxy Fold, though, has triggered questions about durability as the first folding smartphone out of the gate -- even after its second time out of the gate. Among larger devices, folding screens hold even more promise since there's less of a need to compromise viewing area for the sake of preserving one-handed operation for a phone call. So far, though, the only major vendor that has really shown off a laptop folding device in Lenovo with its folding ThinkPad, and it has not shown a lot of it.\n\nIn contrast, the dual-screen Surface Neo can be thought of in many ways. Microsoft calls it the next category after 2-in-1s, one for which its infinite \"postures\" (the new \"modes\") will enable the nutraceutical-evoking \"limitless flow.\" After all, under the logic of \"one screen good, two screens better,\" the company points to modern research reaffirming older PC-based research about the utility of dual monitors, updating its validity in a more mobile world.\n\nPart of that is likely because multiple screens provide convenient containers that two full-screen apps can fill or one app spanning the two screens can fill in logical segmentation. Consider multiple pages in a Word document or e-book when the Neo is in portrait orientation. Alternatively, one could have multiple apps open, offering more visibility into a second app than, say, the iPad's SlideOver feature, without managing window borders A less compelling example is an email or presentation app that might put overview content (messages or slide lists) on one screen and detail content (email messages or slides) in another. That's because the divide may be less than optimal. Most people devote less of a window or tab to the list, saving most of the real estate for the content.\n\nThe dual-screen argument is that, what you lose in flexibility to tweak, you make up for in convenience. That has generally held true on the largest desktop monitors and may extend to the Neo, which offers enough screen space to make up for the lack of optimization. However, one thing that's tough to get around -- literally -- is the seam caused by the hinge. This is a scenario where using a single app that has no natural interface breakpoint (like, say, Excel or a map) fares better on a folding screen than on the Neo.\n\nSpeaking of the hinge, Microsoft cites the design goal of supporting a 360-degree wraparound. This allows for both sub-180-degree angle applications such as ebook reading and \"laptop mode\" as well as reflex-angle applications such as \"tent mode\" -- popularized by Yoga-like convertibles, but with some new application opportunities. In contrast, the Galaxy Fold display can't fold beyond 180 degrees and the Mate X display can't fold below 180°.\n\nBut Microsoft's real angle may have more to do with a metaphorical hinge, the kind on which customer demand turns depending on pricing and availability. By leveraging the maturity and affordability of rigid displays, the company hopes to drive products like the Surface Neo further into the mainstream, where the versatility would tempt those considering a 2-in-1 product today.\n\nPREVIOUS AND RELATED COVERAGE\n\nMicrosoft shows off its dual-screen Surface Neo, coming in holiday 2020\n\nMicrosoft's dual-screen Windows 10 tablet, the Surface Neo, running Windows 10X, is in the works and coming\n\nWhat's Microsoft's developer story for its new dual-screen Surface devices?\n\nMicrosoft's first two dual-screen devices will be running two different operating systems, Windows 10X and Android. But above the OS level, there will likely be more commonalities than differences.\n\nWith Surface Neo, Microsoft brings the dual-screen experience to tablets\n\nThe twin displays can accommodate having multiple apps open at once, thanks to the new Windows 10X operating system.", "description": "When it comes to maximizing screen real estate, Microsoft has left the fold.", "authors": ["Ross Rubin"], "top_image": "https://zdnet3.cbsistatic.com/hub/i/r/2019/10/04/17e4fc51-fe2e-4197-822f-47c41f8ba638/thumbnail/770x578/9ee251f2095d509e61c62a5e29f5284c/two-dual-screen-devices.jpg", "published_at": "2019-10-10"}