{"pub": "npr", "url": "https://npr.org/2019/10/24/773252870/new-music-friday-our-top-8-albums-out-on-oct-25", "downloaded_at": "2019-10-25 23:38:03.957082+00:00", "title": "New Music Friday: Our Top 8 Albums Out On Oct. 25", "language": "en", "text": "New Music Friday: Our Top 8 Albums Out On Oct. 25\n\ntoggle caption Alexandra Waespi\n\nThe fourth-quarter deluge continues this week with a slew of new releases, including the crooning, quirky soul of Rex Orange County, R&B singer Gallant, queer pop icon King Princess and more, plus the first new album in seven years from Neil Young & Crazy Horse. NPR Music's Lyndsey McKenna and Stephen Thompson join host Robin Hilton as they share their picks for the best new albums out on Oct. 25.\n\nFeatured Albums:\n\nMikal Cronin — Seeker\n\nFeatured Song: \"I've Got Reason\" King Princess — Cheap Queen\n\nFeatured Song: \"You Destroyed My Heart\" Great Grandpa — Four of Arrows\n\nFeatured Song: \"Digger\" Neil Young & Crazy Horse — Colorado\n\nFeatured Songs: \"I Do\" and \"Help Me Lose My Mind\" Rex Orange County — Pony\n\nFeatured Songs: \"Stressed Out\" and \"Laser Lights\" Anamanaguchi - [USA]\n\nFeatured Song: \"The CRT Woods\" Gallant — Sweet Insomnia\n\nFeatured Song: \"Sweet Insomnia\" Sunn O))) — Pyroclasts\n\nFeatured Song: \"Frost C\"\n\nOther Notable Albums For Oct. 25: Alcest — Spiritual Instinct; Anna Meredith — Fibs; Anthony Ramos — The Good & The Bad; The Bad Plus — Activate Infinity; Brooke Candy — Sexorcism; Cigarettes After Sex — Cry; Dry Cleaning — Boundary Road Snacks and Drinks; Grace Potter — Daylight; Juana Molina — For Fun; Lankum — The Livelong Day; Little Scream — Speed Queen; Old Dominion — Old Dominion; Ringo Starr — What's My Name; Sarah Jaffe — SMUT; Van Morrison — Three Chords and the Truth; Verite — New Skin; Walk off the Earth — Here We Go!", "description": "The fourth-quarter deluge continues this week with new releases from Rex Orange County, King Princess, Gallant and more, including the first new album in seven years from Neil Young & Crazy Horse.Featured Albums:1. Mikal Cronin — Seeker2. King Princess — Cheap Queen3. Great Grandpa — Four of Arrows4. Neil Young & Crazy Horse — Colorado5. Rex Orange County — Pony6. Anamanaguchi - [USA]7. Gallant — Sweet Insomnia8. Sunn O))) — PyroclastsOther Notable Albums For Oct. 25: Alcest — Spiritual Instinct; Anna Meredith — Fibs; Anthony Ramos — The Good & The Bad; The Bad Plus — Activate Infinity; Brooke Candy — Sexorcism; Cigarettes After Sex — Cry; Dry Cleaning — Boundary Road Snacks and Drinks; Grace Potter — Daylight; Juana Molina — For Fun; Lankum — The Livelong Day; Little Scream — Speed Queen; Old Dominion — Old Dominion; Ringo Starr — What's My Name; Sarah Jaffe — SMUT; Van Morrison — Three Chords and the Truth; Verite — New Skin; Walk off the Earth — Here We Go!", "authors": ["Robin Hilton", "Lyndsey Mckenna", "Stephen Thompson"], "top_image": "https://media.npr.org/assets/img/2019/10/24/alex-waespi_wide-dc22d8af96601a98f20efc7c5c68873014b7aa30.jpg?s=1400", "published_at": "2019-10-24"}