{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/medievils-best-level-looks-fantastic-in-the-remaster", "downloaded_at": "2019-10-18 06:09:41.209749+00:00", "title": "MediEvil's Best Level Looks Fantastic In The Remaster", "language": "en", "text": "At PAX Australia, Sony was showing off one of its next big titles, MediEvil Remastered. The game's release leans heavily into Sony's recent remastering trend, and follows in the footsteps of recent hits Spyro Reignited Trilogy and Crash N. Sane Trilogy. They're all classic Playstation titles, but of the three of them, MediEvil is arguably the least loved. This package, unlike the others, also only contains a single game, the original 1998 game, and not the middling sequel. I've said this before and I'll say it again — MediEvil needs more love. That's why I was delighted to see it had a significant presence at PAX this year.\n\nIf you caught my article late last week about the best things to see and do at PAX Australia 2019, you may have been greeted by this gem, which took up a significant portion of Sony's booth:\n\nMediEvil! Getting the love that it deserves! Amazing! I was completely jazzed by this booth, and made it one of my first stops in my gaming hunt. The love and care that was put into the design was obvious, and I quite enjoyed my brief journey into the styrofoam graveyard.\n\nOn show were the first four levels — Dan's Crypt, The Graveyard, Cemetery Hill and The Hilltop Mausoleum. Thankfully, for those that played the demo, the PAX version went two steps further, expanding on the opening chapters by showing off the next two levels, which included the first boss fight against the Stained Glass Demon (one of the coolest and most well-designed villains of gaming, in my books).\n\nI managed to grab a go on the demo right at the beginning of The Hilltop Mausoleum level, and I was absolutely delighted because — as you'll soon be able to tell — it's one of my favourite levels of the game. This level takes place after Dan first runs head on into Zarok, the evil sorcerer threatening the town of Gallowmere. After being ambushed on a rocky hill climb, Dan exits Cemetery Hill and is immediately confronted by a band of imps who steal his shit. The good news is Dan gains access to a club, and he can squash the annoying little blighters before they get away with his best sword.\n\nThe level also contains one of the most tense scenes in my childhood when, after rescuing a rune from an underground room, the floor starts to collapse, with the game displaying the terrifying message: THE FLOOR IS COLLAPSING, as if you weren't already stressed enough. The rest of this segment is a mad dash towards the exit between glassy shards, rinse and repeat. The stress was just as real in the remaster, and it keeps that same sense of soul-shattering anxiety to keep you on your toes.\n\nThe Hilltop Mausoleum is a great level because it's nuanced. Sure, there's annoying little trolls and collapsing floors, but it also has a sad ghost (The Phantom of the Opera), who you can choose to help (or not), and as mentioned earlier, the Stained Glass Demon, which is also pictured above.\n\nThe Stained Glass Demon has been given a bit of an overhaul for the remaster, but he still retains his strange, glassy charm and on-point design. He's also just as tough to beat for the uninitiated, and I had a blast finally defeating him.\n\nThe MediEvil remaster releases on October 25, and even from what little I've played through, I'm really excited by the full release. MediEvil is a game that I've played often, over and over again since I was young (and as recently as two months ago, if we're being real) so I'm very interested to see if the entire game will play out as well as I hope.\n\nThere's so many fantastic and iconic levels in MediEvil — The Lake, The Crystal Caves, The Asylum Grounds, The Ant Caves – if the full release turns out as good as the demo looks and feels, newcomers are in for a fantastically spooky, good time.", "description": "At PAX Australia, Sony was showing off one of its next big titles, MediEvil Remastered. The game's release leans heavily into Sony's recent remastering trend, and follows in the footsteps of recent hits Spyro Reignited Trilogy and Crash N. Sane Trilogy. They're all classic Playstation titles, but of the three of them,...", "authors": ["Sarah Basford"], "top_image": "https://edge.alluremedia.com.au/m/k/2019/10/Screen-Shot-2019-10-17-at-4.13.41-pm.png", "published_at": "2019-10-18"}