{"pub": "dailymail", "url": "https://thisismoney.co.uk/money/bills/article-7502925/New-steps-stop-broadband-firms-stinging-contract-customers.html", "downloaded_at": "2019-10-13 23:38:49.262556+00:00", "title": "New steps to stop broadband firms stinging out-of-contract customers", "language": "en", "text": "Ofcom recently set out a series of new measures to help ensure out-of-contract broadband customers will pay fairer prices - and vulnerable customers will receive better protection.\n\nSome of the UK's biggest broadband providers, including BT, Sky and TalkTalk, have agreed to proposed new guidelines from the watchdog which include allowing out-of-contract customers to get the same deals as new customers when they take out a new contract.\n\nOfcom has suggested providers cut prices after becoming 'concerned' about broadband users who end up paying much higher prices after their introductory offers end. We explain what's happening.\n\nChange: Ofcom is introducing new measures to stop people overpaying on their broadband\n\nWhat is the problem?\n\nResearch by the regulator found that around 40 per cent of broadband customers – equivalent to 8.8million people - are out of contract.\n\nIt said these customers could save more money by either renegotiating a deal with their current provider or switching to a new deal with a different supplier.\n\nAndrew Milburn, of Compare the Market, said: 'It's simply not acceptable that 8.8million customers are out of contract and likely paying significantly over the odds for their broadband. The new rules, that will ensure that customers are told when their contract is coming to an end, cannot come soon enough.\n\n'Currently the onus is still on the customer to notice that they have fallen out of contract. Getting a fair deal should be the minimum obligation, and helping customers navigate this often complex and opaque market should be a priority for the industry.'\n\nWhat will broadband firms have to do?\n\nSome of the new commitments agreed to by suppliers are as follows:\n\n• BT, Sky and TalkTalk will allow their out of contract customers to get the same deals as new customers when they take out a new contract.\n\n• The difference that any of Sky's newly contracted customers will pay when their contract expires is no more than £5 per month. From February, BT will cap the difference that existing in-contract customers pay when their contracts expire – it will confirm the amount of this cap in due course.\n\n• BT customers without access to superfast broadband will no longer pay more than entry-level superfast customers. BT will also provide a one-off automatic price reduction for vulnerable customers who are currently out of contract on more expensive deals.\n\n• TalkTalk and Virgin Media will carry out annual price reviews with their vulnerable customers to ensure they are on the best deal for their needs, providing automatic discounts where appropriate if customers do not respond.\n\nWhen do the new measures kick in?\n\nMost of the new measures will be in effect by March 2020.\n\nFrom February, broadband customers must also be told when their contract is coming to an end as well as be shown the best deals currently available.\n\nThose who choose to stay with their provider without signing up to a new contract will be given details of their firm's best deals every year.\n\nOfcom has also said it is concerned about vulnerable customers who could be overpaying\n\nCan you save money now?\n\nTo complete the research, Ofcom analysed the broadband market, looking at the prices paid by over 20million customers.\n\nIt showed how simply demanding a new deal from your current broadband firm pays off. Those who compare prices and go in armed with that knowledge and are prepared to switch if they don't get a better deal will be in the best position.\n\nOfcom found that people who sign a new deal with their current provider could typically pay £8 to £9 less per month than customers who remain out of contract, adding up to around £100 a year.\n\nThis is nearly as much as the average saving of £9 to £10 per month made by new customers signing up to an introductory discount with that provider.\n\nIt also found that a third of customers who negotiate a new deal with their provider actually pay less than those on introductory deals.\n\nRichard Neudegg, head of regulation at uSwitch, said: 'Ofcom's detailed pricing analysis confirms that it is active and engaged broadband customers that get the best deals.\n\n'Households that are out of contract typically pay between £108 and £120 more a year for their broadband than those who shop around.\n\n'It's good to see the watchdog looking at different ways to engage the 41 per cent of broadband users who are currently out of contract, and these proposals build on the work that Ofcom has been doing in the fight for fairer practices for consumers.\n\n'It is reassuring to see that the big broadband providers have committed to helping customers who fall out of contract - although with the regulator's End of Contract Notification rules coming into effect in February, providers know that their customers will shortly be more empowered than ever to hold them to account.'\n\nAnd you could get faster broadband for less\n\nThe research revealed that last year, for the first time, discounted prices for superfast broadband were lower than those paid by some out-of-contract customers for slower copper broadband.\n\nThe watchdog said this pricing approach encourages customers to move to faster, better services but they can only make that move if those services are available in their area.\n\nLindsey Fussell, Ofcom's consumer group director, said: 'Broadband customers who are out of contract can make big savings – around £100 a year on average – by picking up the phone to their current provider and signing up to a better deal.\n\n'And in future, everyone will be told about the best tariff on offer. Thanks to the commitments we've secured from major broadband firms, many customers – including the most vulnerable – will pay less.'\n\nWhat about vulnerable customers?\n\nOfcom also said it was concerned about people in vulnerable circumstances who could be paying more than they need to because they lack the confidence to navigate the market or talk to their provider.\n\nGiven the relatively small numbers of customers recorded by providers as potentially vulnerable, it said it would like firms to make progress in identifying these customers.\n\nIt is also exploring the case for a new, special tariff to protect low-income households which would require broadband companies to offer a simple, low-cost broadband service to eligible customers.\n\nCaroline Normand, Which? director of advocacy, said: 'We know that many UK households can end up paying over the odds for their broadband if they stay on the same tariff for too long, so action from regulators and the industry to help these customers is a step in the right direction.\n\n'Ofcom will need to closely monitor and report on how the voluntary commitments that providers make are working and ensure that this is encouraging customers to contact their supplier or switch in order to save money, especially as often a faster service is available at a lower price.\n\n'These changes won't happen overnight so if you are unhappy with your internet service or you think you could be paying too much, you should still look for a better deal - as this could save you hundreds of pounds a year.'", "description": "Ofcom has suggested providers cut prices after becoming 'concerned' about broadband users who end up paying much higher prices after their introductory offers end. We explain what's happening.", "authors": ["Grace Gausden For This Is Money", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/09/25/11/18913654-0-image-a-9_1569409117642.jpg", "published_at": "2019-10-11"}