{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/09/26/impeachment-minded-democrats-welcome-al-capones-vault-look-familiar", "downloaded_at": "2019-09-26 01:34:02.483434+00:00", "title": "Impeachment-minded Democrats, welcome to Al Capone’s vault. Look familiar?", "language": "en", "text": "\n\nHouse Speaker Nancy Pelosi (D-Calif.) announces a formal impeachment inquiry into President Trump on Tuesday. (Andrew Harnik/AP)\n\nUnderpromise. Overdeliver. It’s the best advice to everyone in any business, on any subject, but especially true in media and politics. Put another way: Don’t get caught opening Al Capone’s vault and finding, well, nothing.\n\nOf course, it would be even worse to hype the opening of the vault, the way Geraldo Rivera did for a TV special in 1986, and, finding it empty, to nevertheless declare triumphantly, “There you have it! The greatest discovery of all time.” That would transform a foolish move into a permanent scar.\n\nWhich is essentially the way House Democrats (mis)handled the guaranteed-to-get-him-impeached rough transcript of the phone call in July between President Trump and Volodymyr Zelensky, the president of Ukraine. Many Democrats, egged on by a complicit Greek chorus — media artists formerly known as “the echo chamber” — were stuck with on Wednesday. Out they marched, declaring the empty vault of the transcript a bill of particulars against Trump that would require the drafting of articles of impeachment and their immediate passage not just by a select committee but by the whole House.\n\nFreshman Democrats elected in 2018 from Trump-majority congressional districts have been cornered by these events. The average voter in the three key states of Michigan, Pennsylvania and Wisconsin is going to think this impeachment circus absurd. Especially given that Democrats now have enough empty vaults to open a new Fort Knox.\n\nThe much-touted investigation by special counsel Robert S. Mueller III found no collusion by Trump with the Russians in the 2016 election. What about obstruction of justice? Attorney General William P. Barr, buttressed by then-Deputy Attorney General Rod J. Rosenstein, determined that none had occurred.\n\nMix in the damning report by the Justice Department’s inspector general regarding former FBI director James B. Comey’s mishandling of documents, and the apparently imminent prosecution of former acting FBI director Andrew McCabe for misleading federal investigators, and the public is rightfully suspicious of the latest frenzy over supposed Trump transgressions.\n\nNow the hugely hyped rough transcript of the president’s phone call has turned out to be a nothingburger, and the ground is suddenly shifting not under Trump but under “the Resistance.” All of those moderate Democrats in precarious seats have been exposed as auxiliaries of Rep. Alexandria Ocasio-Cortez (D-N.Y.) and her hard-left allies in “the Squad.”\n\nTrue, a more circumspect president might have steered clear, in the call with Zelensky, of discussing Ukraine’s history of corruption. And another president might have considered it bad form to bring up former vice president Joe Biden’s son, Hunter, and his involvement with a Ukrainian energy company.\n\nBut Trump isn’t circumspect. If something is on his mind, that’s what he says, and he speaks directly, not with diplomatic evasions. As Kimberley Strassel says in her perceptive new book “Resistance (At All Costs),” Trump has no filters. A great swath of America believes that filters do undeniably exist around Washington’s Beltway – and that those filters are malign, functioning to distort information and mislead the rest of the nation.\n\nThese voters like — indeed, love — the fact that they get “Trump Unplugged” almost every day. They read the phone call’s rough transcript and laugh at the politicos and pundits who are desperately pivoting to it from their other failed narratives about the president: Trump/Russia gave way to Trump/racist, then Trump/recession and now Trump/Ukraine. People are also wising up to the striking similarities in these tales, which are populated with unnamed accusers and eyebrow-raising tactics. Yet on and on the Democrats come, as unstoppable yet hapless as Wile E. Coyote in pursuit of Donald J. Roadrunner.\n\nIf you are part of the 1 percent of America who watches MSNBC or CNN, you are going to be told tonight, tomorrow and frequently in the days and weeks ahead that Trump is in deep trouble.\n\nIf you watch Fox News or listen to center-right radio, you are going to hear a lot of replays of Biden’s bragging about getting a Ukraine prosecutor fired (which may have been a good thing). You will also hear plenty about the former vice president’s son pulling down $50,000 a month for serving on the board of a Ukrainian gas company (which may have been perfectly legitimate, but you have to ask, “What did the owner think he was buying?”).\n\nWhat you won’t be hearing, no matter what you watch or listen to, is a roll-call vote for a House select committee on impeachment in response to revelations about the contents of the president’s fabled phone call. Because, well, the vault was empty. Again.\n\nRead more:\n\nMarc A. Thiessen: Democrats’ double standard on Ukraine\n\nHenry Olsen: This Ukraine scandal would be a bigger deal if Trump wasn’t constantly attacked\n\nHenry Olsen: Do Democrats realize McConnell would call the shots in a Senate impeachment trial?\n\nMegan McArdle: The irony in Democrats’ impeachment position\n\nAnne Applebaum: Tuesday was a turning point on both sides of the Atlantic\n\nJennifer Rubin: Are Senate Republicans circling the wagons? Not so much.", "description": "On and on the Democrats come, as unstoppable yet hapless as Wile E. Coyote in pursuit of Donald J. Roadrunner.", "authors": ["Hugh Hewitt", "September At Pm", "A Post Contributing Columnist", "Hosts A Nationally Syndicated Radio Show On The Salem Network. The Author Of Books About Politics", "History", "Faith", "He Is Also A Political Analyst For Nbc", "A Professor Of Law At Chapman University Law School", "President Of The Nixon Foundation."], "top_image": "https://www.washingtonpost.com/resizer/7GgCg1knBkOmodIL4UYegwjPDIo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/BSPKEDW73EI6TPT7JTEFAF6DN4.jpg", "published_at": "2019-09-26"}