{"pub": "washingtonpost", "url": "https://washingtonpost.com/dc-md-va/2019/10/25/world-series-is-finally-dc-navy-yard-is-place-be-even-if-you-dont-have-tickets", "downloaded_at": "2019-10-25 16:31:10.845463+00:00", "title": "The World Series is finally in D.C., and Navy Yard is the place to be — even if you don’t have tickets", "language": "en", "text": "Imagine what it will be like Friday night, when Washington hosts its first World Series game since 1933.\n\nAs the number of curly-W caps on the Metro has steadily grown, so have the crowds at game-watching parties at D.C. bars, especially around Navy Yard and Yards Park. This is already one of the most vibrant areas in the city, with a mix of upscale restaurants, fast-casual eateries, waterfront bars, attractive outdoor parks and gleaming new condo buildings. During the playoffs, the neighborhood has been filled with those holding precious game tickets and those, lured by an unseen force, who just want to bask in the glory.\n\n“For home games, we’re very busy,” says Jeremy Gifford, the owner of Walters Sports Bar, located across N Street SE from the ballpark. “For away games, we’ve been even busier.” And this weekend? “We’re expecting to be at capacity starting at noon” on Friday, he says. “We’ve been at capacity since Day One of the playoff run.”\n\nAD\n\nAD\n\nWith tens of thousands expected to descend on the area around Yards Park for city-led pep rallies, viewing parties and, of course, the games, bars have to do more than make sure the keg room is full and they have enough bartenders: They’re stockpiling napkins and toilet paper, hiring extra security to handle huge crowds and making plans to have a truck full of ice on hand.\n\nThe Budweiser Clydesdales are expected to arrive at Mission Navy Yard, a two-level restaurant and bar, at 7 a.m. Friday, where Fox 5 will be broadcasting live. Around 11 a.m., the restaurant will begin serving brunch with bottomless chips, margaritas, bloody marys and Dos Equis. From there, says owner Fritz Brogan, it will just get crazier. Even though Mission has hundreds of seats, waits of an hour and a half to two hours have been common during the playoffs. On Wednesday night, a crowd of thirsty patrons was two rows deep around the 150-foot bar, with many sipping from glasses of Mission’s signature margaritas. And that is what Brogan is worried about.\n\nBefore the World Series, he says, he asked his landlord for permission to keep a refrigerated van full of ice in the building’s loading dock, just to make sure bartenders don’t run out. “We have big ice machines, but they can’t keep up” when you’ve got a full house of people drinking from 11 a.m. to 3 a.m., “and we can’t get delivery because of the road closures.”\n\nAD\n\nAD\n\nNationals Park has hosted major events before — the All-Star Game and Home Run Derby last summer, the NHL Winter Classic in 2015, Taylor Swift’s 1989 tour — that led to major spillover for the bars and restaurants in surrounding blocks. But this is different: The passion is palpable, and not just during the “LET’S GO NATS” chants that ring out at Bluejacket or the Bullpen.\n\n“The whole thing is kind of surreal,” says Paul Holder, one of the owners of the Salt Line, the seafood restaurant across from the first base gate. “It’s been an exciting thing to watch up close.” (The Salt Line’s ownership includes Nationals first baseman Ryan Zimmerman, and the team brought the National League Championship Series trophy to the restaurant after sweeping the St. Louis Cardinals.)\n\n“There’s so much wanting to be a part of this” in the city, Holder says. “That’s different from the casual interest in the All-Star Game. Just to be down here is something special for a lot of people.”\n\nAD\n\nAD\n\nThe Capitol Riverfront Business Improvement District certainly hopes so. Friday at 6 p.m. in Yards Park, the BID kicks off “Watch Party Weekend” with a pep rally starring the Eastern High Marching Band, lawn games, food and drinks and live bands, followed by a viewing of Game 3 on a 18-foot LED screen.\n\nOn Saturday and Sunday, the party moves to the Yards Lot, the grassy expanse at the corner of M Street and New Jersey Avenue SE. The BID has held pep rallies for Nationals playoff games before, explains BID communications director Bonnie Trein, but this one “is different than what we’ve done in the past. Those were in the early rounds,” and there was less excitement. Around 4,000 can fit in Yards Park, Trein says, while the capacity at the Yards Lot is 8,000. (As a point of reference, around 11,500 people live in the neighborhood, Trein says.)\n\nMost bars and restaurants near the park will be first-come, first-seated this weekend, but some enterprising fans managed to make sure they can experience as much of the atmosphere as possible. Walters uses Open Table to manage its restaurant reservations, and to prevent people from scoring tables for large groups, Gifford says the ability to make reservations was suspended before Nationals won the pennant. Still, he says, some fans got through early enough to make reservations for Friday, starting at noon, “with notes saying that they were going to stay until they were going to the game,” Gifford says. He’ll honor those reservations — “I don’t think we’re allowed to drag people out of their seats” — but won’t take any others, even though he’s being bombarded with requests via email and social media.\n\nAD\n\nAD\n\nBefore he worries about that, however, he has to go buy some flowers for the boxes outside Walters. “This is going to be a weekend where the eyes on the District of Columbia are going to be magnified,” he says. “We want to look good.”\n\nREAD MORE\n\nAD", "description": "Bars near Nationals Park are opening early and bracing for big crowds as D.C. hosts its first World Series game since 1933.", "authors": ["Fritz Hahn", "Reporter Covering Bars", "Drinks", "Nightlife For The Washington Post'S Weekend Section"], "top_image": "https://www.washingtonpost.com/resizer/wuYLOP5vBml5pkImEzpNfLtlYWU=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VB44JNDRRZC5FIRSB7VS2KXI74", "published_at": "2019-10-25"}