{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7566045/Paulo-Gazzaniga-insists-Tottenham-strong-home-look-overcome-recent-struggles.html", "downloaded_at": "2019-10-12 16:08:03.820679+00:00", "title": "Paulo Gazzaniga insists Tottenham must be strong at home as they look to overcome recent struggles", "language": "en", "text": "Paulo Gazzaniga has insisted that Tottenham need to be strong at home in order to overcome their woeful recent form.\n\nTottenham have won just one of their last six games in all competitions and have conceded ten goals across their last two fixtures.\n\nAfter the international break Tottenham host Watford, with Gazzaniga seeing that game as a perfect opportunity for his side to bounce back.\n\nTottenham goalkeeper Paulo Gazzaniga has insisted that his side must be strong at home\n\nAs reported by Sky Sports, Gazzaniga said: 'We know we have to be strong, at home, especially, we have to be strong.\n\n'Now it's about having the right mentality and being focussed, starting against Watford.'\n\nTottenham had hoped to make their stadium a fortress, but they have already lost twice at home this season, which included a 7-2 defeat to Bayern Munich.\n\nWith Hugo Lloris set to miss the rest of 2019 with a dislocated elbow, Gazzaniga, who has played just six Premier League games for Tottenham, is set for an extended run in the side.\n\nGazzaniga is set for an extended run in the side following the injury suffered by Hugo Lloris\n\nThe 27-year-old stressed that he is ready for his opportunity but was disappointed to see fellow goalkeeper Lloris suffer such a severe injury.\n\nGazzaniga said: 'It's always the same answer, I'm ready.\n\n'I try to be focussed. I believe in myself and my team-mates, and that's the only way.\n\n'I wasn't comfortable seeing Hugo coming out of the game in that way. Everyone knows what he means for the team and for the club, our captain.'\n\nTottenham are currently in ninth place in the Premier League, 13 points adrift of leaders Liverpool, while they also face a battle to progress in the Champions League.", "description": "Paulo Gazzaniga has insisted that Tottenham need to be strong at home in order to overcome their woeful recent form.  Tottenham have won just one of their last six games in all competitions.", "authors": ["Jeorge Bird For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/15/19628254-0-image-a-10_1570890551789.jpg", "published_at": "2019-10-12"}