{"pub": "foxnews", "url": "https://foxnews.com/media/football-fan-beer-money-children-charity-fundraising", "downloaded_at": "2019-09-22 00:30:09.616976+00:00", "title": "Football fan who requested beer money on TV reveals he's raised $820G for children's charity", "language": "en", "text": "A simple request for beer money on TV has ended up turning into a massive fundraising haul -- reaching more than $800,000 for a children's hospital in Iowa.\n\nFootball fan Carson King was at ESPN's College Game Day when he held up a sign asking for enough money to cover a case of beer, and displaying his username on the payment app Venmo. After he received a flood of donations into his Venmo account, he decided to take that money -- along with matching donations from Anheuser Busch and Venmo -- and donate it to the University of Iowa Stead Family Children's Hospital.\n\nOn Saturday, he told \"Fox & Friends\" he had accumulated more than $800,000 for charity. \"So, right now, with matched contributions, we're over $822,000,\" he said.\n\nBefore receiving the influx of cash, King admitted his mother wasn't too impressed about his stunt. King, on Saturday, said she was initially hesitant about him requesting beer money on national television.\n\n\"My mom heard the idea and she's like, 'Oh my gosh, my son's going to be on national television asking for beer money' -- you know, proud mom moment,\" King said sarcastically. \"I think it turned into her being okay with it at this point,\" he added.\n\nBUSCH BEER MATCHES DONATION AFTER FAN ACCIDENTALLY RAISES THOUSANDS OF DOLLARS: 'THIS IS THE BEST THING WE HAVE READ ALL YEAR'\n\nBUSCH LAUNCHES LIMITED-EDITION BEER TO CELEBRATE LATTE SEASON\n\nKing went on to explain why he was donating the funds to the children's hospital in Iowa.\n\n\"I mean, children's hospitals, they do so much for everyone around the country -- the Stead family, obviously they're revolutionary in what they do,\" he said, referring to the hospital's namesake.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"They do such great work with all the kids and all of their families ... obviously, anything you can do to help the kids, you have to do.\"\n\nAnheuser Busch rewarded King's good deed by creating a beer can with his face on it and sending him a year's supply of Busch light packaged in those cans.", "description": "A simple request for beer money ended up turning into a massive fundraising haul for a children's hospital in Iowa.", "authors": ["Sam Dorman", "Sam Dorman Is A Reporter With Fox News. You Can Follow Him On Facebook"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/beer-money.jpg", "published_at": "2019-09-21"}