{"pub": "cbc", "url": "https://cbc.ca/news/canada/toronto/17-000-feral-cats-could-be-roaming-toronto-and-experts-say-that-s-good-news-1.5273967", "downloaded_at": "2019-09-22 23:12:14.007539+00:00", "title": "17,000 feral cats could be roaming Toronto — and experts say that's good news | CBC News", "language": "en", "text": "It's a stat that might give you paws: A whopping 17,000 feral cats could be roaming the streets of Toronto.\n\nThat's the finding of a first-of-its-kind analysis from the Toronto Humane Society (THS), which coupled survey responses from cat colony caretakers and data around land use and population density to come up with a new grand total of homeless felines.\n\nWhile it might seem like a lot of mouse-chasers prowling around, previous estimates from around a decade ago put the city-wide population at closer to 100,000, according to feral cat experts like the THS' Tegan Buckingham, the society's director of integrated marketing and development.\n\nIn other words, the current level is good news.\n\n\"What we noticed in terms of trends is ... the number of cats coming in that are considered a stray are decreasing over time,\" Buckingham says.\n\nToronto Animal Services (TAS), a city department, doesn't track feral cat populations, but has also seen fewer cats entering shelters — a close to 56-per-cent drop, in fact, between 2010 and 2017.\n\nThe department credits trap, neuter, release programs — run by TAS, THS, and other organizations — for the decline.\n\nThe programs work thanks to volunteers flagging fertile felines that are then whisked away for their neutering surgery and later returned to their colonies, unable to make more kittens and continue the cycle.\n\nFor the TAS efforts, the annual cost is $76,000, most of which comes from donations.\n\n'It's not a happy life' for wild cats\n\nTo lifelong cat lover Connie Archambault, the success of these so-called \"T-N-R\" programs hits close to home.\n\nThe Riverdale resident started working with feral cats more than 16 years ago after spotting some roaming outdoors on her usual route to the gym.\n\nEventually Archambault started feeding and caring for 18 cats between two colonies in the Port Lands — including getting them neutered and returned.\n\n\"Since 2004, there have been no kittens,\" she says. \"Then they slowly died out over time.\"\n\nBoth colonies, she adds, are now mostly gone, though she did keep one feral cat for herself — Ollie — who's one of the several feline companions enjoying life indoors.\n\nTegan Buckingham, the Toronto Humane Society's director of integrated marketing and development, says previous estimates put the city-wide feral cat population at closer to 100,000. (Lauren Pelley/CBC News)\n\nEven though she loves having cats around, Archambault says fewer are better in the wild.\n\n\"They suffer greatly,\" she explains. \"They can get into cat fights, there's disease... it's not a happy life for a cat living outside.\"\n\nPenny Cookson, who's been working with feral cats for the last decade, agrees.\n\n\"The life for a cat on the street is very difficult,\" says Cookson, the director of volunteer group Community Cats Toronto.\n\nStatistics show 75 per cent of feral kittens die within six months, she says, while the life expectancy for cats who reach adulthood is only two years.\n\n\"We have new colonies added every day,\" she adds. \"We're up to about 700, with 80 per cent of those in Toronto.\"\n\nNearby in Mississauga, some have dubbed the feral cat numbers an \"epidemic,\" while Cornwall in eastern Ontario is making strides to curb population growth after the city's residents complained about the number of cats strutting in the streets and wreaking havoc to private property.\n\nPenny Cookson, the director of volunteer group Community Cats Toronto, seen here with a small colony site in Toronto's west end. 'The life for a cat on the street is very difficult,' she says. (Lauren Pelley/CBC News)\n\nGiven the high numbers of cats still on the streets, Cookson stresses the need for more data.\n\n\"It's very hard to measure how many cats there were when we started ... We didn't start with numbers, and we don't have solid numbers right now, but we do have indicators the number of feral cats are going down,\" she says.\n\nIn the new THS report, the team suggests further tracking feral cat populations through both stray intake numbers and data from neutering programs.\n\nPrevious studies have shown if those neutering programs are used, feral cat populations could drop by 10 to 40 per cent within a decade — which could mean the city's colony count could one day sit between 10 and 15 thousand, the report notes.\n\n\"These studies cannot just be a one-time thing,\" the report concludes.", "description": "It's a stat that might give you paws: A whopping 17,000 feral cats could be roaming the streets of Toronto. That's the finding of a first-of-its-kind analysis from the Toronto Humane Society, and it shows colony populations may be dropping dramatically thanks to neutering programs.", "authors": [], "top_image": "https://i.cbc.ca/1.3563413.1462230758!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/file-photo-of-a-feral-cat.jpg", "published_at": "2019-09-18"}