{"pub": "businessinsider", "url": "https://businessinsider.com/how-to-change-wi-fi-network-in-control-center-on-iphone", "downloaded_at": "2019-09-27 02:13:39.154995+00:00", "title": "How to change your Wi-Fi network in the Control Center on an iPhone with iOS 13", "language": "en", "text": "You can change your Wi-Fi network in the Control Center on an iPhone if your device is running iOS 13.\n\nInstead of navigating through Settings to change your preferred Wi-Fi network, you can do this easily by swiping into your iPhone's Control Center, and pressing and holding the Wi-Fi icon.\n\nVisit Business Insider's homepage for more stories.\n\nApple's latest, and highly anticipated, operating system for iPhone 6S and higher, iOS 13, has many new features that have proved useful, and disappointing.\n\nOne of its more convenient features is the ability to change your Wi-Fi network from an iPhone's Control Center — without having to go through Settings, the main previous method.\n\nControl Center can be accessed by swiping down on the top right-hand corner of the screen on your iPhone X or later (or from the bottom of the screen on older models), whether it is locked or not.\n\nCheck out the products mentioned in this article:\n\nHow to change your Wi-Fi network in the Control Center on an iPhone with iOS 13\n\n1. Tap the screen of your iPhone to wake it up.\n\n2. Swipe down on the top right-hand corner of the screen on an iPhone X or later, or up from the bottom of your screen on an earlier iPhone running iOS 13. It doesn't matter if your iPhone is locked or unlocked.\n\n3. Find the Wi-Fi icon.\n\nTap and hold the Wi-Fi icon. Meira Gebel/Business Insider\n\n4. Tap and hold firmly until a new screen pops up.\n\n5. Find the Wi-Fi icon once again, and press and hold firmly.\n\nTo turn Wi-Fi on, tap the icon. Then, press and hold. Meira Gebel/Business Insider\n\n6. A list of Wi-Fi networks will appear in a list. Scroll to find the network you wish to connect to, and select.\n\nSelect the network you wish to connect to. Meira Gebel/Business Insider\n\n7. A checkmark will appear next to the network's name once you are connected.\n\nA check mark will appear next to the network once you're connected. Meira Gebel/Business Insider\n\nIf you're connecting to a new Wi-Fi network for your iPhone and is not public, you will be required to enter a password.\n\nAfter selecting the private Wi-Fi network, a new screen will prompt you to enter the password. Once you've done that, tap Join in the upper right-hand corner.\n\nEnter the network password and tap Join. Meira Gebel/Business Insider\n\nRelated coverage from How To Do Everything: Tech:", "description": "It's easy to change your Wi-Fi network directly in Control Center on an iPhone with iOS 13 — without having to use Settings. Here's how to do it.", "authors": ["Meira Gebel"], "top_image": "https://image.businessinsider.com/5d8a686e2e22af12233d39b4?width=1200&format=jpeg", "published_at": "2019-09-25"}