{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/top-lawyer-found-dead-below-20552535", "downloaded_at": "2019-10-10 15:23:26.429253+00:00", "title": "Top lawyer found dead below cliffs had been suspended over 'sexual behaviour'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA top lawyer was found dead at the bottom of a cliff face had been suspended from work for allegations of inappropriate sexual behaviour.\n\nGeraint Thomas kissed his wife goodbye and said \"I'll see you later, I'll be home by 7.30pm\", before leaving for work on December 17 last year.\n\nAt his law firm, the 47-year-old was called into a private meeting and told he was being suspended while a formal investigation was carried out.\n\nMr Thomas vanished after leaving the office in Cardiff and was found dead hours later, an inquest heard.\n\nRebecca Thomas said her husband had been the \"happiest and least stressed\" she had seen him in the lead up to his death as the family planned a three-week Christmas trip to East Australia.\n\n(Image: Athena Pictures)\n\nShe said: \"To say Geraint was looking forward to the trip would be an understatement.\"\n\nThe family had celebrated an early Christmas at their home in Radyr, Cardiff, ahead of the trip.\n\nOn the weekend before Mr Thomas' death he showed \"no signs\" of work worries.\n\nOn Monday, December 17 last year, he kissed his wife goodbye before attending a meeting where he heard of his suspension.\n\nMrs Thomas said: \"I have no doubt that whatever was said at that meeting was fundamental in Geraint's change of mind and subsequent actions later that day.\"\n\nThe inquest heard Mr Thomas was found in Southerndown near Bridgend, South Wales, on December 18 - a spot where his family previously enjoyed walks together.\n\nMrs Thomas said she became concerned when her husband did not respond to a string of text messages - and a security guard at his Eversheds Sutherland law firm said his car was not there.\n\nFirm partner David Watkins then told her to \"call police and file a missing person report.\"\n\nBut Mrs Thomas believed this advise was an \"overreaction\" because she was unaware of the full details of the meeting that had taken place.\n\n(Image: unknown)\n\nThe inquest heard that the \"allegations of inappropriate sexual behaviour\" related to two social events, including one Christmas party.\n\nMr Thomas was \"calm and professional\" as he received the news.\n\nHe told HR chiefs: \"I will collect my things and go.\"\n\nMr Thomas, who was found at the foot of the cliff, had shown no previous signs of mental health problems.\n\nThe Oxford University graduate was a partner at law firm Eversheds Sutherland and specialised in offering Brexit advice to businesses.\n\nA profile on the company website said fluent French speaker Mr Thomas had been a partner since 2003 and was an expert in consumer credit and mortgage regulations.\n\nThe inquest in Pontypridd, South Wales, continues.\n\nIf you need to speak to someone, Samaritans are available 24/7 by calling 116 123 or by emailing jo@samaritans.org", "description": "Geraint Thomas was found at the bottom of a cliff face in Southerndown near Bridgend, South Wales", "authors": ["Adam Hale", "Milo Boyd", "Image", "Athena Pictures", "Unknown"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20552544.ece/ALTERNATES/s1200/1_PAY-Inquest-into-the-death-of-Geraint-Thomas-a-solicitor-who-specialised-in-Brexit-and-was-found-dead-ajpgs.jpg", "published_at": "2019-10-10"}