{"pub": "breitbart", "url": "https://breitbart.com/news/youth-flying-high-at-chelsea-under-lampard", "downloaded_at": "2019-10-30 14:31:07.472355+00:00", "title": "Youth flying high at Chelsea under Lampard", "language": "en", "text": "London (AFP) – Frank Lampard’s strategy of rewarding youth and discarding Chelsea’s pattern of loaning them out has paid dividends and cheered disgruntled fans, says rising midfielder star Mason Mount.\n\nMount, 20, and 21-year-old Fikayo Tomori had the good fortune to play under Lampard at Derby County where they were loaned out last season by Chelsea’s then-manger Maurizio Sarri.\n\nBoth of them have now become regulars in the Chelsea line-up this term as Lampard — who was hired when Sarri left to take over at Juventus — has unearthed a rich seam of young talent with striker Tammy Abraham and Callum Hudson-Odoi among them.\n\nSarri was criticised by Chelsea fans for overlooking home-grown talent such as Ruben Loftus-Cheek — who had sparkled for England at the 2018 World Cup — and Hudson-Odoi a chance.\n\nMount — who has now won four England caps — told The Daily Telegraph Chelsea playing legend Lampard’s knowledge of the club and its youth system had been a bonus for the young players.\n\n“It does help having an English manager knowing all the young English players coming through the academy, knowing what we are about and having that confidence in us to perform,” said Mount.\n\n– ‘Spurred me on’ –\n\nChelsea’s form has improved markedly since their opening day 4-0 humbling by Manchester United and are on a seven match winning run.\n\nMount says this justifies not only Lampard’s selection policy — he has told the young players that it is not down to the transfer ban imposed on the club — but also the fans desire to see young English talent on display.\n\n“It was such a big moment for the manager coming back,” he said. “We can feel that goodwill from the fans, 100 per cent.\n\n“It’s something they’ve been calling for a long time, young English players coming through and doing well for the club.\n\n“We can feel it on the pitch and we want to give that extra yard for the fans.”\n\nTomori, who like Mount was a member of the Chelsea side that won the 2016 FA Youth Cup, has taken longer than Mount to become a first team regular this season.\n\n“I was basically seeing my friends playing for Chelsea and I was close so it spurred me on to keep working hard every day and keep training well,” said the Canada-born defender.\n\n“We all talk to each other and on the Champions League nights, we are like ‘wow, we are playing in the Champions League’.\n\n“Stuff like that keeps us motivated and it means when the game comes we want to play well and win. At the moment it’s working for us.”\n\nMount, who persisted at Chelsea despite his father’s advice to leave, became the first academy graduate form the London club since John Terry to claim a regular first team spot.\n\nHe said that having so many young players brought another quality to the team.\n\n“Having all the players around and the fact we are doing it together, we probably are feeding off each other and it’s giving us that fearlessness going into games,” said Mount.\n\n“There is pressure playing for a massive club and you’ve got stuff to prove, but I think coming through with a lot of similar faces who you have known growing up, it does help a lot.”", "description": "London (AFP) – Frank Lampard’s strategy of rewarding youth and discarding Chelsea’s pattern of loaning them out has paid dividends and", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/30/d00afa_frank-lampard-placing-his-faith-in-young-english-talent-chelsea-has-not-640x335.jpg", "published_at": "2019-10-30"}