{"pub": "americanconservative", "url": "https://w2.vatican.va/content/john-paul-ii/en/encyclicals/documents/hf_jp-ii_enc_14091998_fides-et-ratio.html", "downloaded_at": "2019-10-30 04:16:10.262571+00:00", "title": "Fides et Ratio (14 September 1998)", "language": "en", "text": "ENCYCLICAL LETTER\n\nFIDES ET RATIO\n\nOF THE SUPREME PONTIFF\n\nJOHN PAUL II\n\nTO THE BISHOPS\n\nOF THE CATHOLIC CHURCH\n\nON THE RELATIONSHIP\n\nBETWEEN FAITH AND REASON\n\nBlessing\n\nMy Venerable Brother Bishops,\n\nHealth and the Apostolic Blessing!\n\nFaith and reason are like two wings on which the human spirit rises to the contemplation of truth; and God has placed in the human heart a desire to know the truth—in a word, to know himself—so that, by knowing and loving God, men and women may also come to the fullness of truth about themselves (cf. Ex 33:18; Ps 27:8-9; 63:2-3; Jn 14:8; 1 Jn 3:2).\n\nINTRODUCTION - “KNOW YOURSELF”\n\n1. In both East and West, we may trace a journey which has led humanity down the centuries to meet and engage truth more and more deeply. It is a journey which has unfolded—as it must—within the horizon of personal self-consciousness: the more human beings know reality and the world, the more they know themselves in their uniqueness, with the question of the meaning of things and of their very existence becoming ever more pressing. This is why all that is the object of our knowledge becomes a part of our life. The admonition Know yourself was carved on the temple portal at Delphi, as testimony to a basic truth to be adopted as a minimal norm by those who seek to set themselves apart from the rest of creation as “human beings”, that is as those who “know themselves”.\n\nMoreover, a cursory glance at ancient history shows clearly how in different parts of the world, with their different cultures, there arise at the same time the fundamental questions which pervade human life: Who am I? Where have I come from and where am I going? Why is there evil? What is there after this life? These are the questions which we find in the sacred writings of Israel, as also in the Veda and the Avesta; we find them in the writings of Confucius and Lao-Tze, and in the preaching of Tirthankara and Buddha; they appear in the poetry of Homer and in the tragedies of Euripides and Sophocles, as they do in the philosophical writings of Plato and Aristotle. They are questions which have their common source in the quest for meaning which has always compelled the human heart. In fact, the answer given to these questions decides the direction which people seek to give to their lives.\n\n2. The Church is no stranger to this journey of discovery, nor could she ever be. From the moment when, through the Paschal Mystery, she received the gift of the ultimate truth about human life, the Church has made her pilgrim way along the paths of the world to proclaim that Jesus Christ is “the way, and the truth, and the life” (Jn 14:6). It is her duty to serve humanity in different ways, but one way in particular imposes a responsibility of a quite special kind: the diakonia of the truth. 1 This mission on the one hand makes the believing community a partner in humanity's shared struggle to arrive at truth; 2 and on the other hand it obliges the believing community to proclaim the certitudes arrived at, albeit with a sense that every truth attained is but a step towards that fullness of truth which will appear with the final Revelation of God: “For now we see in a mirror dimly, but then face to face. Now I know in part; then I shall understand fully” (1 Cor 13:12).\n\n3. Men and women have at their disposal an array of resources for generating greater knowledge of truth so that their lives may be ever more human. Among these is philosophy, which is directly concerned with asking the question of life's meaning and sketching an answer to it. Philosophy emerges, then, as one of noblest of human tasks. According to its Greek etymology, the term philosophy means “love of wisdom”. Born and nurtured when the human being first asked questions about the reason for things and their purpose, philosophy shows in different modes and forms that the desire for truth is part of human nature itself. It is an innate property of human reason to ask why things are as they are, even though the answers which gradually emerge are set within a horizon which reveals how the different human cultures are complementary.\n\nPhilosophy's powerful influence on the formation and development of the cultures of the West should not obscure the influence it has also had upon the ways of understanding existence found in the East. Every people has its own native and seminal wisdom which, as a true cultural treasure, tends to find voice and develop in forms which are genuinely philosophical. One example of this is the basic form of philosophical knowledge which is evident to this day in the postulates which inspire national and international legal systems in regulating the life of society.\n\n4. Nonetheless, it is true that a single term conceals a variety of meanings. Hence the need for a preliminary clarification. Driven by the desire to discover the ultimate truth of existence, human beings seek to acquire those universal elements of knowledge which enable them to understand themselves better and to advance in their own self-realization. These fundamental elements of knowledge spring from the wonder awakened in them by the contemplation of creation: human beings are astonished to discover themselves as part of the world, in a relationship with others like them, all sharing a common destiny. Here begins, then, the journey which will lead them to discover ever new frontiers of knowledge. Without wonder, men and women would lapse into deadening routine and little by little would become incapable of a life which is genuinely personal.\n\nThrough philosophy's work, the ability to speculate which is proper to the human intellect produces a rigorous mode of thought; and then in turn, through the logical coherence of the affirmations made and the organic unity of their content, it produces a systematic body of knowledge. In different cultural contexts and at different times, this process has yielded results which have produced genuine systems of thought. Yet often enough in history this has brought with it the temptation to identify one single stream with the whole of philosophy. In such cases, we are clearly dealing with a “philosophical pride” which seeks to present its own partial and imperfect view as the complete reading of all reality. In effect, every philosophical system, while it should always be respected in its wholeness, without any instrumentalization, must still recognize the primacy of philosophical enquiry, from which it stems and which it ought loyally to serve.\n\nAlthough times change and knowledge increases, it is possible to discern a core of philosophical insight within the history of thought as a whole. Consider, for example, the principles of non-contradiction, finality and causality, as well as the concept of the person as a free and intelligent subject, with the capacity to know God, truth and goodness. Consider as well certain fundamental moral norms which are shared by all. These are among the indications that, beyond different schools of thought, there exists a body of knowledge which may be judged a kind of spiritual heritage of humanity. It is as if we had come upon an implicit philosophy, as a result of which all feel that they possess these principles, albeit in a general and unreflective way. Precisely because it is shared in some measure by all, this knowledge should serve as a kind of reference-point for the different philosophical schools. Once reason successfully intuits and formulates the first universal principles of being and correctly draws from them conclusions which are coherent both logically and ethically, then it may be called right reason or, as the ancients called it, orthós logos, recta ratio.\n\n5. On her part, the Church cannot but set great value upon reason's drive to attain goals which render people's lives ever more worthy. She sees in philosophy the way to come to know fundamental truths about human life. At the same time, the Church considers philosophy an indispensable help for a deeper understanding of faith and for communicating the truth of the Gospel to those who do not yet know it.\n\nTherefore, following upon similar initiatives by my Predecessors, I wish to reflect upon this special activity of human reason. I judge it necessary to do so because, at the present time in particular, the search for ultimate truth seems often to be neglected. Modern philosophy clearly has the great merit of focusing attention upon man. From this starting-point, human reason with its many questions has developed further its yearning to know more and to know it ever more deeply. Complex systems of thought have thus been built, yielding results in the different fields of knowledge and fostering the development of culture and history. Anthropology, logic, the natural sciences, history, linguistics and so forth—the whole universe of knowledge has been involved in one way or another. Yet the positive results achieved must not obscure the fact that reason, in its one-sided concern to investigate human subjectivity, seems to have forgotten that men and women are always called to direct their steps towards a truth which transcends them. Sundered from that truth, individuals are at the mercy of caprice, and their state as person ends up being judged by pragmatic criteria based essentially upon experimental data, in the mistaken belief that technology must dominate all. It has happened therefore that reason, rather than voicing the human orientation towards truth, has wilted under the weight of so much knowledge and little by little has lost the capacity to lift its gaze to the heights, not daring to rise to the truth of being. Abandoning the investigation of being, modern philosophical research has concentrated instead upon human knowing. Rather than make use of the human capacity to know the truth, modern philosophy has preferred to accentuate the ways in which this capacity is limited and conditioned.\n\nThis has given rise to different forms of agnosticism and relativism which have led philosophical research to lose its way in the shifting sands of widespread scepticism. Recent times have seen the rise to prominence of various doctrines which tend to devalue even the truths which had been judged certain. A legitimate plurality of positions has yielded to an undifferentiated pluralism, based upon the assumption that all positions are equally valid, which is one of today's most widespread symptoms of the lack of confidence in truth. Even certain conceptions of life coming from the East betray this lack of confidence, denying truth its exclusive character and assuming that truth reveals itself equally in different doctrines, even if they contradict one another. On this understanding, everything is reduced to opinion; and there is a sense of being adrift. While, on the one hand, philosophical thinking has succeeded in coming closer to the reality of human life and its forms of expression, it has also tended to pursue issues—existential, hermeneutical or linguistic—which ignore the radical question of the truth about personal existence, about being and about God. Hence we see among the men and women of our time, and not just in some philosophers, attitudes of widespread distrust of the human being's great capacity for knowledge. With a false modesty, people rest content with partial and provisional truths, no longer seeking to ask radical questions about the meaning and ultimate foundation of human, personal and social existence. In short, the hope that philosophy might be able to provide definitive answers to these questions has dwindled.\n\n6. Sure of her competence as the bearer of the Revelation of Jesus Christ, the Church reaffirms the need to reflect upon truth. This is why I have decided to address you, my venerable Brother Bishops, with whom I share the mission of “proclaiming the truth openly” (2 Cor 4:2), as also theologians and philosophers whose duty it is to explore the different aspects of truth, and all those who are searching; and I do so in order to offer some reflections on the path which leads to true wisdom, so that those who love truth may take the sure path leading to it and so find rest from their labours and joy for their spirit.\n\nI feel impelled to undertake this task above all because of the Second Vatican Council's insistence that the Bishops are “witnesses of divine and catholic truth”. 3 To bear witness to the truth is therefore a task entrusted to us Bishops; we cannot renounce this task without failing in the ministry which we have received. In reaffirming the truth of faith, we can both restore to our contemporaries a genuine trust in their capacity to know and challenge philosophy to recover and develop its own full dignity.\n\nThere is a further reason why I write these reflections. In my Encyclical Letter Veritatis Splendor, I drew attention to “certain fundamental truths of Catholic doctrine which, in the present circumstances, risk being distorted or denied”. 4 In the present Letter, I wish to pursue that reflection by concentrating on the theme of truth itself and on its foundation in relation to faith. For it is undeniable that this time of rapid and complex change can leave especially the younger generation, to whom the future belongs and on whom it depends, with a sense that they have no valid points of reference. The need for a foundation for personal and communal life becomes all the more pressing at a time when we are faced with the patent inadequacy of perspectives in which the ephemeral is affirmed as a value and the possibility of discovering the real meaning of life is cast into doubt. This is why many people stumble through life to the very edge of the abyss without knowing where they are going. At times, this happens because those whose vocation it is to give cultural expression to their thinking no longer look to truth, preferring quick success to the toil of patient enquiry into what makes life worth living. With its enduring appeal to the search for truth, philosophy has the great responsibility of forming thought and culture; and now it must strive resolutely to recover its original vocation. This is why I have felt both the need and the duty to address this theme so that, on the threshold of the third millennium of the Christian era, humanity may come to a clearer sense of the great resources with which it has been endowed and may commit itself with renewed courage to implement the plan of salvation of which its history is part.\n\nCHAPTER I - THE REVELATION OF GOD'S WISDOM\n\nJesus, revealer of the Father\n\n7. Underlying all the Church's thinking is the awareness that she is the bearer of a message which has its origin in God himself (cf. 2 Cor 4:1-2). The knowledge which the Church offers to man has its origin not in any speculation of her own, however sublime, but in the word of God which she has received in faith (cf. 1 Th 2:13). At the origin of our life of faith there is an encounter, unique in kind, which discloses a mystery hidden for long ages (cf. 1 Cor 2:7; Rom 16:25-26) but which is now revealed: “In his goodness and wisdom, God chose to reveal himself and to make known to us the hidden purpose of his will (cf. Eph 1:9), by which, through Christ, the Word made flesh, man has access to the Father in the Holy Spirit and comes to share in the divine nature”. 5 This initiative is utterly gratuitous, moving from God to men and women in order to bring them to salvation. As the source of love, God desires to make himself known; and the knowledge which the human being has of God perfects all that the human mind can know of the meaning of life.\n\n8. Restating almost to the letter the teaching of the First Vatican Council's Constitution Dei Filius, and taking into account the principles set out by the Council of Trent, the Second Vatican Council's Constitution Dei Verbum pursued the age-old journey of understanding faith, reflecting on Revelation in the light of the teaching of Scripture and of the entire Patristic tradition. At the First Vatican Council, the Fathers had stressed the supernatural character of God's Revelation. On the basis of mistaken and very widespread assertions, the rationalist critique of the time attacked faith and denied the possibility of any knowledge which was not the fruit of reason's natural capacities. This obliged the Council to reaffirm emphatically that there exists a knowledge which is peculiar to faith, surpassing the knowledge proper to human reason, which nevertheless by its nature can discover the Creator. This knowledge expresses a truth based upon the very fact of God who reveals himself, a truth which is most certain, since God neither deceives nor wishes to deceive. 6\n\n9. The First Vatican Council teaches, then, that the truth attained by philosophy and the truth of Revelation are neither identical nor mutually exclusive: “There exists a twofold order of knowledge, distinct not only as regards their source, but also as regards their object. With regard to the source, because we know in one by natural reason, in the other by divine faith. With regard to the object, because besides those things which natural reason can attain, there are proposed for our belief mysteries hidden in God which, unless they are divinely revealed, cannot be known”. 7 Based upon God's testimony and enjoying the supernatural assistance of grace, faith is of an order other than philosophical knowledge which depends upon sense perception and experience and which advances by the light of the intellect alone. Philosophy and the sciences function within the order of natural reason; while faith, enlightened and guided by the Spirit, recognizes in the message of salvation the “fullness of grace and truth” (cf. Jn 1:14) which God has willed to reveal in history and definitively through his Son, Jesus Christ (cf. 1 Jn 5:9; Jn 5:31-32).\n\n10. Contemplating Jesus as revealer, the Fathers of the Second Vatican Council stressed the salvific character of God's Revelation in history, describing it in these terms: “In this Revelation, the invisible God (cf. Col 1:15; 1 Tim 1:17), out of the abundance of his love speaks to men and women as friends (cf. Ex 33:11; Jn 15:14-15) and lives among them (cf. Bar 3:38), so that he may invite and take them into communion with himself. This plan of Revelation is realized by deeds and words having an inner unity: the deeds wrought by God in the history of salvation manifest and confirm the teaching and realities signified by the words, while the words proclaim the deeds and clarify the mystery contained in them. By this Revelation, then, the deepest truth about God and human salvation is made clear to us in Christ, who is the mediator and at the same time the fullness of all Revelation”. 8\n\n11. God's Revelation is therefore immersed in time and history. Jesus Christ took flesh in the “fullness of time” (Gal 4:4); and two thousand years later, I feel bound to restate forcefully that “in Christianity time has a fundamental importance”. 9 It is within time that the whole work of creation and salvation comes to light; and it emerges clearly above all that, with the Incarnation of the Son of God, our life is even now a foretaste of the fulfilment of time which is to come (cf. Heb 1:2).\n\nThe truth about himself and his life which God has entrusted to humanity is immersed therefore in time and history; and it was declared once and for all in the mystery of Jesus of Nazareth. The Constitution Dei Verbum puts it eloquently: “After speaking in many places and varied ways through the prophets, God 'last of all in these days has spoken to us by his Son' (Heb 1:1-2). For he sent his Son, the eternal Word who enlightens all people, so that he might dwell among them and tell them the innermost realities about God (cf. Jn 1:1-18). Jesus Christ, the Word made flesh, sent as 'a human being to human beings', 'speaks the words of God' (Jn 3:34), and completes the work of salvation which his Father gave him to do (cf. Jn 5:36; 17:4). To see Jesus is to see his Father (Jn 14:9). For this reason, Jesus perfected Revelation by fulfilling it through his whole work of making himself present and manifesting himself: through his words and deeds, his signs and wonders, but especially though his death and glorious Resurrection from the dead and finally his sending of the Spirit of truth”. 10\n\nFor the People of God, therefore, history becomes a path to be followed to the end, so that by the unceasing action of the Holy Spirit (cf. Jn 16:13) the contents of revealed truth may find their full expression. This is the teaching of the Constitution Dei Verbum when it states that “as the centuries succeed one another, the Church constantly progresses towards the fullness of divine truth, until the words of God reach their complete fulfilment in her”. 11\n\n12. History therefore becomes the arena where we see what God does for humanity. God comes to us in the things we know best and can verify most easily, the things of our everyday life, apart from which we cannot understand ourselves.\n\nIn the Incarnation of the Son of God we see forged the enduring and definitive synthesis which the human mind of itself could not even have imagined: the Eternal enters time, the Whole lies hidden in the part, God takes on a human face. The truth communicated in Christ's Revelation is therefore no longer confined to a particular place or culture, but is offered to every man and woman who would welcome it as the word which is the absolutely valid source of meaning for human life. Now, in Christ, all have access to the Father, since by his Death and Resurrection Christ has bestowed the divine life which the first Adam had refused (cf. Rom 5:12-15). Through this Revelation, men and women are offered the ultimate truth about their own life and about the goal of history. As the Constitution Gaudium et Spes puts it, “only in the mystery of the incarnate Word does the mystery of man take on light”. 12 Seen in any other terms, the mystery of personal existence remains an insoluble riddle. Where might the human being seek the answer to dramatic questions such as pain, the suffering of the innocent and death, if not in the light streaming from the mystery of Christ's Passion, Death and Resurrection?\n\nReason before the mystery\n\n13. It should nonetheless be kept in mind that Revelation remains charged with mystery. It is true that Jesus, with his entire life, revealed the countenance of the Father, for he came to teach the secret things of God. 13 But our vision of the face of God is always fragmentary and impaired by the limits of our understanding. Faith alone makes it possible to penetrate the mystery in a way that allows us to understand it coherently.\n\nThe Council teaches that “the obedience of faith must be given to God who reveals himself”. 14 This brief but dense statement points to a fundamental truth of Christianity. Faith is said first to be an obedient response to God. This implies that God be acknowledged in his divinity, transcendence and supreme freedom. By the authority of his absolute transcendence, God who makes himself known is also the source of the credibility of what he reveals. By faith, men and women give their assent to this divine testimony. This means that they acknowledge fully and integrally the truth of what is revealed because it is God himself who is the guarantor of that truth. They can make no claim upon this truth which comes to them as gift and which, set within the context of interpersonal communication, urges reason to be open to it and to embrace its profound meaning. This is why the Church has always considered the act of entrusting oneself to God to be a moment of fundamental decision which engages the whole person. In that act, the intellect and the will display their spiritual nature, enabling the subject to act in a way which realizes personal freedom to the full. 15 It is not just that freedom is part of the act of faith: it is absolutely required. Indeed, it is faith that allows individuals to give consummate expression to their own freedom. Put differently, freedom is not realized in decisions made against God. For how could it be an exercise of true freedom to refuse to be open to the very reality which enables our self-realization? Men and women can accomplish no more important act in their lives than the act of faith; it is here that freedom reaches the certainty of truth and chooses to live in that truth.\n\nTo assist reason in its effort to understand the mystery there are the signs which Revelation itself presents. These serve to lead the search for truth to new depths, enabling the mind in its autonomous exploration to penetrate within the mystery by use of reason's own methods, of which it is rightly jealous. Yet these signs also urge reason to look beyond their status as signs in order to grasp the deeper meaning which they bear. They contain a hidden truth to which the mind is drawn and which it cannot ignore without destroying the very signs which it is given.\n\nIn a sense, then, we return to the sacramental character of Revelation and especially to the sign of the Eucharist, in which the indissoluble unity between the signifier and signified makes it possible to grasp the depths of the mystery. In the Eucharist, Christ is truly present and alive, working through his Spirit; yet, as Saint Thomas said so well, “what you neither see nor grasp, faith confirms for you, leaving nature far behind; a sign it is that now appears, hiding in mystery realities sublime”. 16 He is echoed by the philosopher Pascal: “Just as Jesus Christ went unrecognized among men, so does his truth appear without external difference among common modes of thought. So too does the Eucharist remain among common bread”. 17\n\nIn short, the knowledge proper to faith does not destroy the mystery; it only reveals it the more, showing how necessary it is for people's lives: Christ the Lord “in revealing the mystery of the Father and his love fully reveals man to himself and makes clear his supreme calling”, 18 which is to share in the divine mystery of the life of the Trinity. 19\n\n14. From the teaching of the two Vatican Councils there also emerges a genuinely novel consideration for philosophical learning. Revelation has set within history a point of reference which cannot be ignored if the mystery of human life is to be known. Yet this knowledge refers back constantly to the mystery of God which the human mind cannot exhaust but can only receive and embrace in faith. Between these two poles, reason has its own specific field in which it can enquire and understand, restricted only by its finiteness before the infinite mystery of God.\n\nRevelation therefore introduces into our history a universal and ultimate truth which stirs the human mind to ceaseless effort; indeed, it impels reason continually to extend the range of its knowledge until it senses that it has done all in its power, leaving no stone unturned. To assist our reflection on this point we have one of the most fruitful and important minds in human history, a point of reference for both philosophy and theology: Saint Anselm. In his Proslogion, the Archbishop of Canterbury puts it this way: “Thinking of this problem frequently and intently, at times it seemed I was ready to grasp what I was seeking; at other times it eluded my thought completely, until finally, despairing of being able to find it, I wanted to abandon the search for something which was impossible to find. I wanted to rid myself of that thought because, by filling my mind, it distracted me from other problems from which I could gain some profit; but it would then present itself with ever greater insistence... Woe is me, one of the poor children of Eve, far from God, what did I set out to do and what have I accomplished? What was I aiming for and how far have I got? What did I aspire to and what did I long for?... O Lord, you are not only that than which nothing greater can be conceived (non solum es quo maius cogitari nequit), but you are greater than all that can be conceived (quiddam maius quam cogitari possit)... If you were not such, something greater than you could be thought, but this is impossible”. 20\n\n15. The truth of Christian Revelation, found in Jesus of Nazareth, enables all men and women to embrace the “mystery” of their own life. As absolute truth, it summons human beings to be open to the transcendent, whilst respecting both their autonomy as creatures and their freedom. At this point the relationship between freedom and truth is complete, and we understand the full meaning of the Lord's words: “You will know the truth, and the truth will make you free” (Jn 8:32).\n\nChristian Revelation is the true lodestar of men and women as they strive to make their way amid the pressures of an immanentist habit of mind and the constrictions of a technocratic logic. It is the ultimate possibility offered by God for the human being to know in all its fullness the seminal plan of love which began with creation. To those wishing to know the truth, if they can look beyond themselves and their own concerns, there is given the possibility of taking full and harmonious possession of their lives, precisely by following the path of truth. Here the words of the Book of Deuteronomy are pertinent: “This commandment which I command you is not too hard for you, neither is it far off. It is not in heaven that you should say, 'Who will go up for us to heaven, and bring it to us, that we may hear it and do it?' Neither is it beyond the sea, that you should say, 'Who will go over the sea for us, and bring it to us, that we may hear and do it?' But the word is very near you; it is in your mouth and in your heart, that you can do it” (30:11-14). This text finds an echo in the famous dictum of the holy philosopher and theologian Augustine: “Do not wander far and wide but return into yourself. Deep within man there dwells the truth” (Noli foras ire, in te ipsum redi. In interiore homine habitat veritas). 21\n\nThese considerations prompt a first conclusion: the truth made known to us by Revelation is neither the product nor the consummation of an argument devised by human reason. It appears instead as something gratuitous, which itself stirs thought and seeks acceptance as an expression of love. This revealed truth is set within our history as an anticipation of that ultimate and definitive vision of God which is reserved for those who believe in him and seek him with a sincere heart. The ultimate purpose of personal existence, then, is the theme of philosophy and theology alike. For all their difference of method and content, both disciplines point to that “path of life” (Ps 16:11) which, as faith tells us, leads in the end to the full and lasting joy of the contemplation of the Triune God.\n\nCHAPTER II - CREDO UT INTELLEGAM\n\n“Wisdom knows all and understands all” (Wis 9:11)\n\n16. Sacred Scripture indicates with remarkably clear cues how deeply related are the knowledge conferred by faith and the knowledge conferred by reason; and it is in the Wisdom literature that this relationship is addressed most explicitly. What is striking about these biblical texts, if they are read without prejudice, is that they embody not only the faith of Israel, but also the treasury of cultures and civilizations which have long vanished. As if by special design, the voices of Egypt and Mesopotamia sound again and certain features common to the cultures of the ancient Near East come to life in these pages which are so singularly rich in deep intuition.\n\nIt is no accident that, when the sacred author comes to describe the wise man, he portrays him as one who loves and seeks the truth: “Happy the man who meditates on wisdom and reasons intelligently, who reflects in his heart on her ways and ponders her secrets. He pursues her like a hunter and lies in wait on her paths. He peers through her windows and listens at her doors. He camps near her house and fastens his tent-peg to her walls; he pitches his tent near her and so finds an excellent resting-place; he places his children under her protection and lodges under her boughs; by her he is sheltered from the heat and he dwells in the shade of her glory” (Sir 14:20-27).\n\nFor the inspired writer, as we see, the desire for knowledge is characteristic of all people. Intelligence enables everyone, believer and non-believer, to reach “the deep waters” of knowledge (cf. Prov 20:5). It is true that ancient Israel did not come to knowledge of the world and its phenomena by way of abstraction, as did the Greek philosopher or the Egyptian sage. Still less did the good Israelite understand knowledge in the way of the modern world which tends more to distinguish different kinds of knowing. Nonetheless, the biblical world has made its own distinctive contribution to the theory of knowledge.\n\nWhat is distinctive in the biblical text is the conviction that there is a profound and indissoluble unity between the knowledge of reason and the knowledge of faith. The world and all that happens within it, including history and the fate of peoples, are realities to be observed, analysed and assessed with all the resources of reason, but without faith ever being foreign to the process. Faith intervenes not to abolish reason's autonomy nor to reduce its scope for action, but solely to bring the human being to understand that in these events it is the God of Israel who acts. Thus the world and the events of history cannot be understood in depth without professing faith in the God who is at work in them. Faith sharpens the inner eye, opening the mind to discover in the flux of events the workings of Providence. Here the words of the Book of Proverbs are pertinent: “The human mind plans the way, but the Lord directs the steps” (16:9). This is to say that with the light of reason human beings can know which path to take, but they can follow that path to its end, quickly and unhindered, only if with a rightly tuned spirit they search for it within the horizon of faith. Therefore, reason and faith cannot be separated without diminishing the capacity of men and women to know themselves, the world and God in an appropriate way.\n\n17. There is thus no reason for competition of any kind between reason and faith: each contains the other, and each has its own scope for action. Again the Book of Proverbs points in this direction when it exclaims: “It is the glory of God to conceal things, but the glory of kings is to search things out” (Prov 25:2). In their respective worlds, God and the human being are set within a unique relationship. In God there lies the origin of all things, in him is found the fullness of the mystery, and in this his glory consists; to men and women there falls the task of exploring truth with their reason, and in this their nobility consists. The Psalmist adds one final piece to this mosaic when he says in prayer: “How deep to me are your thoughts, O God! How vast is the sum of them! If I try to count them, they are more than the sand. If I come to the end, I am still with you” (139:17-18). The desire for knowledge is so great and it works in such a way that the human heart, despite its experience of insurmountable limitation, yearns for the infinite riches which lie beyond, knowing that there is to be found the satisfying answer to every question as yet unanswered.\n\n18. We may say, then, that Israel, with her reflection, was able to open to reason the path that leads to the mystery. With the Revelation of God Israel could plumb the depths of all that she sought in vain to reach by way of reason. On the basis of this deeper form of knowledge, the Chosen People understood that, if reason were to be fully true to itself, then it must respect certain basic rules. The first of these is that reason must realize that human knowledge is a journey which allows no rest; the second stems from the awareness that such a path is not for the proud who think that everything is the fruit of personal conquest; a third rule is grounded in the “fear of God” whose transcendent sovereignty and provident love in the governance of the world reason must recognize.\n\nIn abandoning these rules, the human being runs the risk of failure and ends up in the condition of “the fool”. For the Bible, in this foolishness there lies a threat to life. The fool thinks that he knows many things, but really he is incapable of fixing his gaze on the things that truly matter. Therefore he can neither order his mind (Prov 1:7) nor assume a correct attitude to himself or to the world around him. And so when he claims that “God does not exist” (cf. Ps 14:1), he shows with absolute clarity just how deficient his knowledge is and just how far he is from the full truth of things, their origin and their destiny.\n\n19. The Book of Wisdom contains several important texts which cast further light on this theme. There the sacred author speaks of God who reveals himself in nature. For the ancients, the study of the natural sciences coincided in large part with philosophical learning. Having affirmed that with their intelligence human beings can “know the structure of the world and the activity of the elements... the cycles of the year and the constellations of the stars, the natures of animals and the tempers of wild beasts” (Wis 7:17, 19-20)—in a word, that he can philosophize—the sacred text takes a significant step forward. Making his own the thought of Greek philosophy, to which he seems to refer in the context, the author affirms that, in reasoning about nature, the human being can rise to God: “From the greatness and beauty of created things comes a corresponding perception of their Creator” (Wis 13:5). This is to recognize as a first stage of divine Revelation the marvellous “book of nature”, which, when read with the proper tools of human reason, can lead to knowledge of the Creator. If human beings with their intelligence fail to recognize God as Creator of all, it is not because they lack the means to do so, but because their free will and their sinfulness place an impediment in the way.\n\n20. Seen in this light, reason is valued without being overvalued. The results of reasoning may in fact be true, but these results acquire their true meaning only if they are set within the larger horizon of faith: “All man's steps are ordered by the Lord: how then can man understand his own ways?” (Prov 20:24). For the Old Testament, then, faith liberates reason in so far as it allows reason to attain correctly what it seeks to know and to place it within the ultimate order of things, in which everything acquires true meaning. In brief, human beings attain truth by way of reason because, enlightened by faith, they discover the deeper meaning of all things and most especially of their own existence. Rightly, therefore, the sacred author identifies the fear of God as the beginning of true knowledge: “The fear of the Lord is the beginning of knowledge” (Prov 1:7; cf. Sir 1:14).\n\n“Acquire wisdom, acquire understanding” (Prov 4:5)\n\n21. For the Old Testament, knowledge is not simply a matter of careful observation of the human being, of the world and of history, but supposes as well an indispensable link with faith and with what has been revealed. These are the challenges which the Chosen People had to confront and to which they had to respond. Pondering this as his situation, biblical man discovered that he could understand himself only as “being in relation”—with himself, with people, with the world and with God. This opening to the mystery, which came to him through Revelation, was for him, in the end, the source of true knowledge. It was this which allowed his reason to enter the realm of the infinite where an understanding for which until then he had not dared to hope became a possibility.\n\nFor the sacred author, the task of searching for the truth was not without the strain which comes once the limits of reason are reached. This is what we find, for example, when the Book of Proverbs notes the weariness which comes from the effort to understand the mysterious designs of God (cf. 30:1-6). Yet, for all the toil involved, believers do not surrender. They can continue on their way to the truth because they are certain that God has created them “explorers” (cf. Qoh 1:13), whose mission it is to leave no stone unturned, though the temptation to doubt is always there. Leaning on God, they continue to reach out, always and everywhere, for all that is beautiful, good and true.\n\n22. In the first chapter of his Letter to the Romans, Saint Paul helps us to appreciate better the depth of insight of the Wisdom literature's reflection. Developing a philosophical argument in popular language, the Apostle declares a profound truth: through all that is created the “eyes of the mind” can come to know God. Through the medium of creatures, God stirs in reason an intuition of his “power” and his “divinity” (cf. Rom 1:20). This is to concede to human reason a capacity which seems almost to surpass its natural limitations. Not only is it not restricted to sensory knowledge, from the moment that it can reflect critically upon the data of the senses, but, by discoursing on the data provided by the senses, reason can reach the cause which lies at the origin of all perceptible reality. In philosophical terms, we could say that this important Pauline text affirms the human capacity for metaphysical enquiry.\n\nAccording to the Apostle, it was part of the original plan of the creation that reason should without difficulty reach beyond the sensory data to the origin of all things: the Creator. But because of the disobedience by which man and woman chose to set themselves in full and absolute autonomy in relation to the One who had created them, this ready access to God the Creator diminished.\n\nThis is the human condition vividly described by the Book of Genesis when it tells us that God placed the human being in the Garden of Eden, in the middle of which there stood “the tree of knowledge of good and evil” (2:17). The symbol is clear: man was in no position to discern and decide for himself what was good and what was evil, but was constrained to appeal to a higher source. The blindness of pride deceived our first parents into thinking themselves sovereign and autonomous, and into thinking that they could ignore the knowledge which comes from God. All men and women were caught up in this primal disobedience, which so wounded reason that from then on its path to full truth would be strewn with obstacles. From that time onwards the human capacity to know the truth was impaired by an aversion to the One who is the source and origin of truth. It is again the Apostle who reveals just how far human thinking, because of sin, became “empty”, and human reasoning became distorted and inclined to falsehood (cf. Rom 1:21-22). The eyes of the mind were no longer able to see clearly: reason became more and more a prisoner to itself. The coming of Christ was the saving event which redeemed reason from its weakness, setting it free from the shackles in which it had imprisoned itself.\n\n23. This is why the Christian's relationship to philosophy requires thorough-going discernment. In the New Testament, especially in the Letters of Saint Paul, one thing emerges with great clarity: the opposition between “the wisdom of this world” and the wisdom of God revealed in Jesus Christ. The depth of revealed wisdom disrupts the cycle of our habitual patterns of thought, which are in no way able to express that wisdom in its fullness.\n\nThe beginning of the First Letter to the Corinthians poses the dilemma in a radical way. The crucified Son of God is the historic event upon which every attempt of the mind to construct an adequate explanation of the meaning of existence upon merely human argumentation comes to grief. The true key-point, which challenges every philosophy, is Jesus Christ's death on the Cross. It is here that every attempt to reduce the Father's saving plan to purely human logic is doomed to failure. “Where is the one who is wise? Where is the learned? Where is the debater of this age? Has not God made foolish the wisdom of the world?” (1 Cor 1:20), the Apostle asks emphatically. The wisdom of the wise is no longer enough for what God wants to accomplish; what is required is a decisive step towards welcoming something radically new: “God chose what is foolish in the world to shame the wise...; God chose what is low and despised in the world, things that are not to reduce to nothing things that are” (1 Cor 1:27-28). Human wisdom refuses to see in its own weakness the possibility of its strength; yet Saint Paul is quick to affirm: “When I am weak, then I am strong” (2 Cor 12:10). Man cannot grasp how death could be the source of life and love; yet to reveal the mystery of his saving plan God has chosen precisely that which reason considers “foolishness” and a “scandal”. Adopting the language of the philosophers of his time, Paul comes to the summit of his teaching as he speaks the paradox: “God has chosen in the world... that which is nothing to reduce to nothing things that are” (cf. 1 Cor 1:28). In order to express the gratuitous nature of the love revealed in the Cross of Christ, the Apostle is not afraid to use the most radical language of the philosophers in their thinking about God. Reason cannot eliminate the mystery of love which the Cross represents, while the Cross can give to reason the ultimate answer which it seeks. It is not the wisdom of words, but the Word of Wisdom which Saint Paul offers as the criterion of both truth and salvation.\n\nThe wisdom of the Cross, therefore, breaks free of all cultural limitations which seek to contain it and insists upon an openness to the universality of the truth which it bears. What a challenge this is to our reason, and how great the gain for reason if it yields to this wisdom! Of itself, philosophy is able to recognize the human being's ceaselessly self-transcendent orientation towards the truth; and, with the assistance of faith, it is capable of accepting the “foolishness” of the Cross as the authentic critique of those who delude themselves that they possess the truth, when in fact they run it aground on the shoals of a system of their own devising. The preaching of Christ crucified and risen is the reef upon which the link between faith and philosophy can break up, but it is also the reef beyond which the two can set forth upon the boundless ocean of truth. Here we see not only the border between reason and faith, but also the space where the two may meet.\n\nCHAPTER III - INTELLEGO UT CREDAM\n\nJourneying in search of truth\n\n24. In the Acts of the Apostles, the Evangelist Luke tells of Paul's coming to Athens on one of his missionary journeys. The city of philosophers was full of statues of various idols. One altar in particular caught his eye, and he took this as a convenient starting-point to establish a common base for the proclamation of the kerygma. “Athenians,” he said, “I see how extremely religious you are in every way. For as I went through the city and looked carefully at the objects of your worship, I found among them an altar with the inscription, 'To an unknown god'. What therefore you worship as unknown, this I proclaim to you” (Acts 17:22-23). From this starting-point, Saint Paul speaks of God as Creator, as the One who transcends all things and gives life to all. He then continues his speech in these terms: “From one ancestor he made all nations to inhabit the whole earth, and he allotted the times of their existence and the boundaries of the places where they would live, so that they would search for God and perhaps grope for him and find him—though indeed he is not far from each one of us” (Acts 17:26-27).\n\nThe Apostle accentuates a truth which the Church has always treasured: in the far reaches of the human heart there is a seed of desire and nostalgia for God. The Liturgy of Good Friday recalls this powerfully when, in praying for those who do not believe, we say: “Almighty and eternal God, you created mankind so that all might long to find you and have peace when you are found”. 22 There is therefore a path which the human being may choose to take, a path which begins with reason's capacity to rise beyond what is contingent and set out towards the infinite.\n\nIn different ways and at different times, men and women have shown that they can articulate this intimate desire of theirs. Through literature, music, painting, sculpture, architecture and every other work of their creative intelligence they have declared the urgency of their quest. In a special way philosophy has made this search its own and, with its specific tools and scholarly methods, has articulated this universal human desire.\n\n25. “All human beings desire to know”, 23 and truth is the proper object of this desire. Everyday life shows how concerned each of us is to discover for ourselves, beyond mere opinions, how things really are. Within visible creation, man is the only creature who not only is capable of knowing but who knows that he knows, and is therefore interested in the real truth of what he perceives. People cannot be genuinely indifferent to the question of whether what they know is true or not. If they discover that it is false, they reject it; but if they can establish its truth, they feel themselves rewarded. It is this that Saint Augustine teaches when he writes: “I have met many who wanted to deceive, but none who wanted to be deceived”. 24 It is rightly claimed that persons have reached adulthood when they can distinguish independently between truth and falsehood, making up their own minds about the objective reality of things. This is what has driven so many enquiries, especially in the scientific field, which in recent centuries have produced important results, leading to genuine progress for all humanity.\n\nNo less important than research in the theoretical field is research in the practical field—by which I mean the search for truth which looks to the good which is to be performed. In acting ethically, according to a free and rightly tuned will, the human person sets foot upon the path to happiness and moves towards perfection. Here too it is a question of truth. It is this conviction which I stressed in my Encyclical Letter Veritatis Splendor: “There is no morality without freedom... Although each individual has a right to be respected in his own journey in search of the truth, there exists a prior moral obligation, and a grave one at that, to seek the truth and to adhere to it once it is known”. 25\n\nIt is essential, therefore, that the values chosen and pursued in one's life be true, because only true values can lead people to realize themselves fully, allowing them to be true to their nature. The truth of these values is to be found not by turning in on oneself but by opening oneself to apprehend that truth even at levels which transcend the person. This is an essential condition for us to become ourselves and to grow as mature, adult persons.\n\n26. The truth comes initially to the human being as a question: Does life have a meaning? Where is it going? At first sight, personal existence may seem completely meaningless. It is not necessary to turn to the philosophers of the absurd or to the provocative questioning found in the Book of Job in order to have doubts about life's meaning. The daily experience of suffering—in one's own life and in the lives of others—and the array of facts which seem inexplicable to reason are enough to ensure that a question as dramatic as the question of meaning cannot be evaded. 26 Moreover, the first absolutely certain truth of our life, beyond the fact that we exist, is the inevitability of our death. Given this unsettling fact, the search for a full answer is inescapable. Each of us has both the desire and the duty to know the truth of our own destiny. We want to know if death will be the definitive end of our life or if there is something beyond—if it is possible to hope for an after-life or not. It is not insignificant that the death of Socrates gave philosophy one of its decisive orientations, no less decisive now than it was more than two thousand years ago. It is not by chance, then, that faced with the fact of death philosophers have again and again posed this question, together with the question of the meaning of life and immortality.\n\n27. No-one can avoid this questioning, neither the philosopher nor the ordinary person. The answer we give will determine whether or not we think it possible to attain universal and absolute truth; and this is a decisive moment of the search. Every truth—if it really is truth—presents itself as universal, even if it is not the whole truth. If something is true, then it must be true for all people and at all times. Beyond this universality, however, people seek an absolute which might give to all their searching a meaning and an answer—something ultimate, which might serve as the ground of all things. In other words, they seek a final explanation, a supreme value, which refers to nothing beyond itself and which puts an end to all questioning. Hypotheses may fascinate, but they do not satisfy. Whether we admit it or not, there comes for everyone the moment when personal existence must be anchored to a truth recognized as final, a truth which confers a certitude no longer open to doubt.\n\nThrough the centuries, philosophers have sought to discover and articulate such a truth, giving rise to various systems and schools of thought. But beyond philosophical systems, people seek in different ways to shape a “philosophy” of their own—in personal convictions and experiences, in traditions of family and culture, or in journeys in search of life's meaning under the guidance of a master. What inspires all of these is the desire to reach the certitude of truth and the certitude of its absolute value.\n\nThe different faces of human truth\n\n28. The search for truth, of course, is not always so transparent nor does it always produce such results. The natural limitation of reason and the inconstancy of the heart often obscure and distort a person's search. Truth can also drown in a welter of other concerns. People can even run from the truth as soon as they glimpse it because they are afraid of its demands. Yet, for all that they may evade it, the truth still influences life. Life in fact can never be grounded upon doubt, uncertainty or deceit; such an existence would be threatened constantly by fear and anxiety. One may define the human being, therefore, as the one who seeks the truth.\n\n29. It is unthinkable that a search so deeply rooted in human nature would be completely vain and useless. The capacity to search for truth and to pose questions itself implies the rudiments of a response. Human beings would not even begin to search for something of which they knew nothing or for something which they thought was wholly beyond them. Only the sense that they can arrive at an answer leads them to take the first step. This is what normally happens in scientific research. When scientists, following their intuition, set out in search of the logical and verifiable explanation of a phenomenon, they are confident from the first that they will find an answer, and they do not give up in the face of setbacks. They do not judge their original intuition useless simply because they have not reached their goal; rightly enough they will say that they have not yet found a satisfactory answer.\n\nThe same must be equally true of the search for truth when it comes to the ultimate questions. The thirst for truth is so rooted in the human heart that to be obliged to ignore it would cast our existence into jeopardy. Everyday life shows well enough how each one of us is preoccupied by the pressure of a few fundamental questions and how in the soul of each of us there is at least an outline of the answers. One reason why the truth of these answers convinces is that they are no different in substance from the answers to which many others have come. To be sure, not every truth to which we come has the same value. But the sum of the results achieved confirms that in principle the human being can arrive at the truth.\n\n30. It may help, then, to turn briefly to the different modes of truth. Most of them depend upon immediate evidence or are confirmed by experimentation. This is the mode of truth proper to everyday life and to scientific research. At another level we find philosophical truth, attained by means of the speculative powers of the human intellect. Finally, there are religious truths which are to some degree grounded in philosophy, and which we find in the answers which the different religious traditions offer to the ultimate questions. 27\n\nThe truths of philosophy, it should be said, are not restricted only to the sometimes ephemeral teachings of professional philosophers. All men and women, as I have noted, are in some sense philosophers and have their own philosophical conceptions with which they direct their lives. In one way or other, they shape a comprehensive vision and an answer to the question of life's meaning; and in the light of this they interpret their own life's course and regulate their behaviour. At this point, we may pose the question of the link between, on the one hand, the truths of philosophy and religion and, on the other, the truth revealed in Jesus Christ. But before tackling that question, one last datum of philosophy needs to be weighed.\n\n31. Human beings are not made to live alone. They are born into a family and in a family they grow, eventually entering society through their activity. From birth, therefore, they are immersed in traditions which give them not only a language and a cultural formation but also a range of truths in which they believe almost instinctively. Yet personal growth and maturity imply that these same truths can be cast into doubt and evaluated through a process of critical enquiry. It may be that, after this time of transition, these truths are “recovered” as a result of the experience of life or by dint of further reasoning. Nonetheless, there are in the life of a human being many more truths which are simply believed than truths which are acquired by way of personal verification. Who, for instance, could assess critically the countless scientific findings upon which modern life is based? Who could personally examine the flow of information which comes day after day from all parts of the world and which is generally accepted as true? Who in the end could forge anew the paths of experience and thought which have yielded the treasures of human wisdom and religion? This means that the human being—the one who seeks the truth—is also the one who lives by belief.\n\n32. In believing, we entrust ourselves to the knowledge acquired by other people. This suggests an important tension. On the one hand, the knowledge acquired through belief can seem an imperfect form of knowledge, to be perfected gradually through personal accumulation of evidence; on the other hand, belief is often humanly richer than mere evidence, because it involves an interpersonal relationship and brings into play not only a person's capacity to know but also the deeper capacity to entrust oneself to others, to enter into a relationship with them which is intimate and enduring.\n\nIt should be stressed that the truths sought in this interpersonal relationship are not primarily empirical or philosophical. Rather, what is sought is the truth of the person—what the person is and what the person reveals from deep within. Human perfection, then, consists not simply in acquiring an abstract knowledge of the truth, but in a dynamic relationship of faithful self-giving with others. It is in this faithful self-giving that a person finds a fullness of certainty and security. At the same time, however, knowledge through belief, grounded as it is on trust between persons, is linked to truth: in the act of believing, men and women entrust themselves to the truth which the other declares to them.\n\nAny number of examples could be found to demonstrate this; but I think immediately of the martyrs, who are the most authentic witnesses to the truth about existence. The martyrs know that they have found the truth about life in the encounter with Jesus Christ, and nothing and no-one could ever take this certainty from them. Neither suffering nor violent death could ever lead them to abandon the truth which they have discovered in the encounter with Christ. This is why to this day the witness of the martyrs continues to arouse such interest, to draw agreement, to win such a hearing and to invite emulation. This is why their word inspires such confidence: from the moment they speak to us of what we perceive deep down as the truth we have sought for so long, the martyrs provide evidence of a love that has no need of lengthy arguments in order to convince. The martyrs stir in us a profound trust because they give voice to what we already feel and they declare what we would like to have the strength to express.\n\n33. Step by step, then, we are assembling the terms of the question. It is the nature of the human being to seek the truth. This search looks not only to the attainment of truths which are partial, empirical or scientific; nor is it only in individual acts of decision-making that people seek the true good. Their search looks towards an ulterior truth which would explain the meaning of life. And it is therefore a search which can reach its end only in reaching the absolute. 28 Thanks to the inherent capacities of thought, man is able to encounter and recognize a truth of this kind. Such a truth—vital and necessary as it is for life—is attained not only by way of reason but also through trusting acquiescence to other persons who can guarantee the authenticity and certainty of the truth itself. There is no doubt that the capacity to entrust oneself and one's life to another person and the decision to do so are among the most significant and expressive human acts.\n\nIt must not be forgotten that reason too needs to be sustained in all its searching by trusting dialogue and sincere friendship. A climate of suspicion and distrust, which can beset speculative research, ignores the teaching of the ancient philosophers who proposed friendship as one of the most appropriate contexts for sound philosophical enquiry.\n\nFrom all that I have said to this point it emerges that men and women are on a journey of discovery which is humanly unstoppable—a search for the truth and a search for a person to whom they might entrust themselves. Christian faith comes to meet them, offering the concrete possibility of reaching the goal which they seek. Moving beyond the stage of simple believing, Christian faith immerses human beings in the order of grace, which enables them to share in the mystery of Christ, which in turn offers them a true and coherent knowledge of the Triune God. In Jesus Christ, who is the Truth, faith recognizes the ultimate appeal to humanity, an appeal made in order that what we experience as desire and nostalgia may come to its fulfilment.\n\n34. This truth, which God reveals to us in Jesus Christ, is not opposed to the truths which philosophy perceives. On the contrary, the two modes of knowledge lead to truth in all its fullness. The unity of truth is a fundamental premise of human reasoning, as the principle of non-contradiction makes clear. Revelation renders this unity certain, showing that the God of creation is also the God of salvation history. It is the one and the same God who establishes and guarantees the intelligibility and reasonableness of the natural order of things upon which scientists confidently depend, 29 and who reveals himself as the Father of our Lord Jesus Christ. This unity of truth, natural and revealed, is embodied in a living and personal way in Christ, as the Apostle reminds us: “Truth is in Jesus” (cf. Eph 4:21; Col 1:15-20). He is the eternal Word in whom all things were created, and he is the incarnate Word who in his entire person 30 reveals the Father (cf. Jn 1:14, 18). What human reason seeks “without knowing it” (cf. Acts 17:23) can be found only through Christ: what is revealed in him is “the full truth” (cf. Jn 1:14-16) of everything which was created in him and through him and which therefore in him finds its fulfilment (cf. Col 1:17).\n\n35. On the basis of these broad considerations, we must now explore more directly the relationship between revealed truth and philosophy. This relationship imposes a twofold consideration, since the truth conferred by Revelation is a truth to be understood in the light of reason. It is this duality alone which allows us to specify correctly the relationship between revealed truth and philosophical learning. First, then, let us consider the links between faith and philosophy in the course of history. From this, certain principles will emerge as useful reference-points in the attempt to establish the correct link between the two orders of knowledge.\n\nCHAPTER IV - THE RELATIONSHIP BETWEEN FAITH AND REASON\n\nImportant moments in the encounter of faith and reason\n\n36. The Acts of the Apostles provides evidence that Christian proclamation was engaged from the very first with the philosophical currents of the time. In Athens, we read, Saint Paul entered into discussion with “certain Epicurean and Stoic philosophers” (17:18); and exegetical analysis of his speech at the Areopagus has revealed frequent allusions to popular beliefs deriving for the most part from Stoicism. This is by no means accidental. If pagans were to understand them, the first Christians could not refer only to “Moses and the prophets” when they spoke. They had to point as well to natural knowledge of God and to the voice of conscience in every human being (cf. Rom 1:19-21; 2:14-15; Acts 14:16-17). Since in pagan religion this natural knowledge had lapsed into idolatry (cf. Rom 1:21-32), the Apostle judged it wiser in his speech to make the link with the thinking of the philosophers, who had always set in opposition to the myths and mystery cults notions more respectful of divine transcendence.\n\nOne of the major concerns of classical philosophy was to purify human notions of God of mythological elements. We know that Greek religion, like most cosmic religions, was polytheistic, even to the point of divinizing natural things and phenomena. Human attempts to understand the origin of the gods and hence the origin of the universe find their earliest expression in poetry; and the theogonies remain the first evidence of this human search. But it was the task of the fathers of philosophy to bring to light the link between reason and religion. As they broadened their view to include universal principles, they no longer rested content with the ancient myths, but wanted to provide a rational foundation for their belief in the divinity. This opened a path which took its rise from ancient traditions but allowed a development satisfying the demands of universal reason. This development sought to acquire a critical awareness of what they believed in, and the concept of divinity was the prime beneficiary of this. Superstitions were recognized for what they were and religion was, at least in part, purified by rational analysis. It was on this basis that the Fathers of the Church entered into fruitful dialogue with ancient philosophy, which offered new ways of proclaiming and understanding the God of Jesus Christ.\n\n37. In tracing Christianity's adoption of philosophy, one should not forget how cautiously Christians regarded other elements of the cultural world of paganism, one example of which is gnosticism. It was easy to confuse philosophy—understood as practical wisdom and an education for life—with a higher and esoteric kind of knowledge, reserved to those few who were perfect. It is surely this kind of esoteric speculation which Saint Paul has in mind when he puts the Colossians on their guard: “See to it that no-one takes you captive through philosophy and empty deceit, according to human tradition, according to the elemental spirits of the universe and not according to Christ” (2:8). The Apostle's words seem all too pertinent now if we apply them to the various kinds of esoteric superstition widespread today, even among some believers who lack a proper critical sense. Following Saint Paul, other writers of the early centuries, especially Saint Irenaeus and Tertullian, sound the alarm when confronted with a cultural perspective which sought to subordinate the truth of Revelation to the interpretation of the philosophers.\n\n38. Christianity's engagement with philosophy was therefore neither straight-forward nor immediate. The practice of philosophy and attendance at philosophical schools seemed to the first Christians more of a disturbance than an opportunity. For them, the first and most urgent task was the proclamation of the Risen Christ by way of a personal encounter which would bring the listener to conversion of heart and the request for Baptism. But that does not mean that they ignored the task of deepening the understanding of faith and its motivations. Quite the contrary. That is why the criticism of Celsus—that Christians were “illiterate and uncouth” 31 —is unfounded and untrue. Their initial disinterest is to be explained on other grounds. The encounter with the Gospel offered such a satisfying answer to the hitherto unresolved question of life's meaning that delving into the philosophers seemed to them something remote and in some ways outmoded.\n\nThat seems still more evident today, if we think of Christianity's contribution to the affirmation of the right of everyone to have access to the truth. In dismantling barriers of race, social status and gender, Christianity proclaimed from the first the equality of all men and women before God. One prime implication of this touched the theme of truth. The elitism which had characterized the ancients' search for truth was clearly abandoned. Since access to the truth enables access to God, it must be denied to none. There are many paths which lead to truth, but since Christian truth has a salvific value, any one of these paths may be taken, as long as it leads to the final goal, that is to the Revelation of Jesus Christ.\n\nA pioneer of positive engagement with philosophical thinking—albeit with cautious discernment—was Saint Justin. Although he continued to hold Greek philosophy in high esteem after his conversion, Justin claimed with power and clarity that he had found in Christianity “the only sure and profitable philosophy”. 32 Similarly, Clement of Alexandria called the Gospel “the true philosophy”, 33 and he understood philosophy, like the Mosaic Law, as instruction which prepared for Christian faith 34 and paved the way for the Gospel. 35 Since “philosophy yearns for the wisdom which consists in rightness of soul and speech and in purity of life, it is well disposed towards wisdom and does all it can to acquire it. We call philosophers those who love the wisdom that is creator and mistress of all things, that is knowledge of the Son of God”. 36 For Clement, Greek philosophy is not meant in the first place to bolster and complete Christian truth. Its task is rather the defence of the faith: “The teaching of the Saviour is perfect in itself and has no need of support, because it is the strength and the wisdom of God. Greek philosophy, with its contribution, does not strengthen truth; but, in rendering the attack of sophistry impotent and in disarming those who betray truth and wage war upon it, Greek philosophy is rightly called the hedge and the protective wall around the vineyard”. 37\n\n39. It is clear from history, then, that Christian thinkers were critical in adopting philosophical thought. Among the early examples of this, Origen is certainly outstanding. In countering the attacks launched by the philosopher Celsus, Origen adopts Platonic philosophy to shape his argument and mount his reply. Assuming many elements of Platonic thought, he begins to construct an early form of Christian theology. The name “theology” itself, together with the idea of theology as rational discourse about God, had to this point been tied to its Greek origins. In Aristotelian philosophy, for example, the name signified the noblest part and the true summit of philosophical discourse. But in the light of Christian Revelation what had signified a generic doctrine about the gods assumed a wholly new meaning, signifying now the reflection undertaken by the believer in order to express the true doctrine about God. As it developed, this new Christian thought made use of philosophy, but at the same time tended to distinguish itself clearly from philosophy. History shows how Platonic thought, once adopted by theology, underwent profound changes, especially with regard to concepts such as the immortality of the soul, the divinization of man and the origin of evil.\n\n40. In this work of christianizing Platonic and Neo-Platonic thought, the Cappadocian Fathers, Dionysius called the Areopagite and especially Saint Augustine were important. The great Doctor of the West had come into contact with different philosophical schools, but all of them left him disappointed. It was when he encountered the truth of Christian faith that he found strength to undergo the radical conversion to which the philosophers he had known had been powerless to lead him. He himself reveals his motive: “From this time on, I gave my preference to the Catholic faith. I thought it more modest and not in the least misleading to be told by the Church to believe what could not be demonstrated—whether that was because a demonstration existed but could not be understood by all or whether the matter was not one open to rational proof—rather than from the Manichees to have a rash promise of knowledge with mockery of mere belief, and then afterwards to be ordered to believe many fabulous and absurd myths impossible to prove true”. 38 Though he accorded the Platonists a place of privilege, Augustine rebuked them because, knowing the goal to seek, they had ignored the path which leads to it: the Word made flesh. 39 The Bishop of Hippo succeeded in producing the first great synthesis of philosophy and theology, embracing currents of thought both Greek and Latin. In him too the great unity of knowledge, grounded in the thought of the Bible, was both confirmed and sustained by a depth of speculative thinking. The synthesis devised by Saint Augustine remained for centuries the most exalted form of philosophical and theological speculation known to the West. Reinforced by his personal story and sustained by a wonderful holiness of life, he could also introduce into his works a range of material which, drawing on experience, was a prelude to future developments in different currents of philosophy.\n\n41. The ways in which the Fathers of East and West engaged the philosophical schools were, therefore, quite different. This does not mean that they identified the content of their message with the systems to which they referred. Consider Tertullian's question: “What does Athens have in common with Jerusalem? The Academy with the Church?”. 40 This clearly indicates the critical consciousness with which Christian thinkers from the first confronted the problem of the relationship between faith and philosophy, viewing it comprehensively with both its positive aspects and its limitations. They were not naive thinkers. Precisely because they were intense in living faith's content they were able to reach the deepest forms of speculation. It is therefore minimalizing and mistaken to restrict their work simply to the transposition of the truths of faith into philosophical categories. They did much more. In fact they succeeded in disclosing completely all that remained implicit and preliminary in the thinking of the great philosophers of antiquity. 41 As I have noted, theirs was the task of showing how reason, freed from external constraints, could find its way out of the blind alley of myth and open itself to the transcendent in a more appropriate way. Purified and rightly tuned, therefore, reason could rise to the higher planes of thought, providing a solid foundation for the perception of being, of the transcendent and of the absolute.\n\nIt is here that we see the originality of what the Fathers accomplished. They fully welcomed reason which was open to the absolute, and they infused it with the richness drawn from Revelation. This was more than a meeting of cultures, with one culture perhaps succumbing to the fascination of the other. It happened rather in the depths of human souls, and it was a meeting of creature and Creator. Surpassing the goal towards which it unwittingly tended by dint of its nature, reason attained the supreme good and ultimate truth in the person of the Word made flesh. Faced with the various philosophies, the Fathers were not afraid to acknowledge those elements in them that were consonant with Revelation and those that were not. Recognition of the points of convergence did not blind them to the points of divergence.\n\n42. In Scholastic theology, the role of philosophically trained reason becomes even more conspicuous under the impulse of Saint Anselm's interpretation of the intellectus fidei. For the saintly Archbishop of Canterbury the priority of faith is not in competition with the search which is proper to reason. Reason in fact is not asked to pass judgement on the contents of faith, something of which it would be incapable, since this is not its function. Its function is rather to find meaning, to discover explanations which might allow everyone to come to a certain understanding of the contents of faith. Saint Anselm underscores the fact that the intellect must seek that which it loves: the more it loves, the more it desires to know. Whoever lives for the truth is reaching for a form of knowledge which is fired more and more with love for what it knows, while having to admit that it has not yet attained what it desires: “To see you was I conceived; and I have yet to conceive that for which I was conceived (Ad te videndum factus sum; et nondum feci propter quod factus sum)”. 42 The desire for truth, therefore, spurs reason always to go further; indeed, it is as if reason were overwhelmed to see that it can always go beyond what it has already achieved. It is at this point, though, that reason can learn where its path will lead in the end: “I think that whoever investigates something incomprehensible should be satisfied if, by way of reasoning, he reaches a quite certain perception of its reality, even if his intellect cannot penetrate its mode of being... But is there anything so incomprehensible and ineffable as that which is above all things? Therefore, if that which until now has been a matter of debate concerning the highest essence has been established on the basis of due reasoning, then the foundation of one's certainty is not shaken in the least if the intellect cannot penetrate it in a way that allows clear formulation. If prior thought has concluded rationally that one cannot comprehend (rationabiliter comprehendit incomprehensibile esse) how supernal wisdom knows its own accomplishments..., who then will explain how this same wisdom, of which the human being can know nothing or next to nothing, is to be known and expressed?”. 43\n\nThe fundamental harmony between the knowledge of faith and the knowledge of philosophy is once again confirmed. Faith asks that its object be understood with the help of reason; and at the summit of its searching reason acknowledges that it cannot do without what faith presents.\n\nThe enduring originality of the thought of Saint Thomas Aquinas\n\n43. A quite special place in this long development belongs to Saint Thomas, not only because of what he taught but also because of the dialogue which he undertook with the Arab and Jewish thought of his time. In an age when Christian thinkers were rediscovering the treasures of ancient philosophy, and more particularly of Aristotle, Thomas had the great merit of giving pride of place to the harmony which exists between faith and reason. Both the light of reason and the light of faith come from God, he argued; hence there can be no contradiction between them. 44\n\nMore radically, Thomas recognized that nature, philosophy's proper concern, could contribute to the understanding of divine Revelation. Faith therefore has no fear of reason, but seeks it out and has trust in it. Just as grace builds on nature and brings it to fulfilment, 45 so faith builds upon and perfects reason. Illumined by faith, reason is set free from the fragility and limitations deriving from the disobedience of sin and finds the strength required to rise to the knowledge of the Triune God. Although he made much of the supernatural character of faith, the Angelic Doctor did not overlook the importance of its reasonableness; indeed he was able to plumb the depths and explain the meaning of this reasonableness. Faith is in a sense an “exercise of thought”; and human reason is neither annulled nor debased in assenting to the contents of faith, which are in any case attained by way of free and informed choice. 46\n\nThis is why the Church has been justified in consistently proposing Saint Thomas as a master of thought and a model of the right way to do theology. In this connection, I would recall what my Predecessor, the Servant of God Paul VI, wrote on the occasion of the seventh centenary of the death of the Angelic Doctor: “Without doubt, Thomas possessed supremely the courage of the truth, a freedom of spirit in confronting new problems, the intellectual honesty of those who allow Christianity to be contaminated neither by secular philosophy nor by a prejudiced rejection of it. He passed therefore into the history of Christian thought as a pioneer of the new path of philosophy and universal culture. The key point and almost the kernel of the solution which, with all the brilliance of his prophetic intuition, he gave to the new encounter of faith and reason was a reconciliation between the secularity of the world and the radicality of the Gospel, thus avoiding the unnatural tendency to negate the world and its values while at the same time keeping faith with the supreme and inexorable demands of the supernatural order”. 47\n\n44. Another of the great insights of Saint Thomas was his perception of the role of the Holy Spirit in the process by which knowledge matures into wisdom. From the first pages of his Summa Theologiae, 48 Aquinas was keen to show the primacy of the wisdom which is the gift of the Holy Spirit and which opens the way to a knowledge of divine realities. His theology allows us to understand what is distinctive of wisdom in its close link with faith and knowledge of the divine. This wisdom comes to know by way of connaturality; it presupposes faith and eventually formulates its right judgement on the basis of the truth of faith itself: “The wisdom named among the gifts of the Holy Spirit is distinct from the wisdom found among the intellectual virtues. This second wisdom is acquired through study, but the first 'comes from on high', as Saint James puts it. This also distinguishes it from faith, since faith accepts divine truth as it is. But the gift of wisdom enables judgement according to divine truth”. 49\n\nYet the priority accorded this wisdom does not lead the Angelic Doctor to overlook the presence of two other complementary forms of wisdom—philosophical wisdom, which is based upon the capacity of the intellect, for all its natural limitations, to explore reality, and theological wisdom, which is based upon Revelation and which explores the contents of faith, entering the very mystery of God.\n\nProfoundly convinced that “whatever its source, truth is of the Holy Spirit” (omne verum a quocumque dicatur a Spiritu Sancto est) 50 Saint Thomas was impartial in his love of truth. He sought truth wherever it might be found and gave consummate demonstration of its universality. In him, the Church's Magisterium has seen and recognized the passion for truth; and, precisely because it stays consistently within the horizon of universal, objective and transcendent truth, his thought scales “heights unthinkable to human intelligence”. 51 Rightly, then, he may be called an “apostle of the truth”. 52 Looking unreservedly to truth, the realism of Thomas could recognize the objectivity of truth and produce not merely a philosophy of “what seems to be” but a philosophy of “what is”.\n\nThe drama of the separation of faith and reason\n\n45. With the rise of the first universities, theology came more directly into contact with other forms of learning and scientific research. Although they insisted upon the organic link between theology and philosophy, Saint Albert the Great and Saint Thomas were the first to recognize the autonomy which philosophy and the sciences needed if they were to perform well in their respective fields of research. From the late Medieval period onwards, however, the legitimate distinction between the two forms of learning became more and more a fateful separation. As a result of the exaggerated rationalism of certain thinkers, positions grew more radical and there emerged eventually a philosophy which was separate from and absolutely independent of the contents of faith. Another of the many consequences of this separation was an ever deeper mistrust with regard to reason itself. In a spirit both sceptical and agnostic, some began to voice a general mistrust, which led some to focus more on faith and others to deny its rationality altogether.\n\nIn short, what for Patristic and Medieval thought was in both theory and practice a profound unity, producing knowledge capable of reaching the highest forms of speculation, was destroyed by systems which espoused the cause of rational knowledge sundered from faith and meant to take the place of faith.\n\n46. The more influential of these radical positions are well known and high in profile, especially in the history of the West. It is not too much to claim that the development of a good part of modern philosophy has seen it move further and further away from Christian Revelation, to the point of setting itself quite explicitly in opposition. This process reached its apogee in the last century. Some representatives of idealism sought in various ways to transform faith and its contents, even the mystery of the Death and Resurrection of Jesus, into dialectical structures which could be grasped by reason. Opposed to this kind of thinking were various forms of atheistic humanism, expressed in philosophical terms, which regarded faith as alienating and damaging to the development of a full rationality. They did not hesitate to present themselves as new religions serving as a basis for projects which, on the political and social plane, gave rise to totalitarian systems which have been disastrous for humanity.\n\nIn the field of scientific research, a positivistic mentality took hold which not only abandoned the Christian vision of the world, but more especially rejected every appeal to a metaphysical or moral vision. It follows that certain scientists, lacking any ethical point of reference, are in danger of putting at the centre of their concerns something other than the human person and the entirety of the person's life. Further still, some of these, sensing the opportunities of technological progress, seem to succumb not only to a market-based logic, but also to the temptation of a quasi-divine power over nature and even over the human being.\n\nAs a result of the crisis of rationalism, what has appeared finally is nihilism. As a philosophy of nothingness, it has a certain attraction for people of our time. Its adherents claim that the search is an end in itself, without any hope or possibility of ever attaining the goal of truth. In the nihilist interpretation, life is no more than an occasion for sensations and experiences in which the ephemeral has pride of place. Nihilism is at the root of the widespread mentality which claims that a definitive commitment should no longer be made, because everything is fleeting and provisional.\n\n47. It should also be borne in mind that the role of philosophy itself has changed in modern culture. From universal wisdom and learning, it has been gradually reduced to one of the many fields of human knowing; indeed in some ways it has been consigned to a wholly marginal role. Other forms of rationality have acquired an ever higher profile, making philosophical learning appear all the more peripheral. These forms of rationality are directed not towards the contemplation of truth and the search for the ultimate goal and meaning of life; but instead, as “instrumental reason”, they are directed—actually or potentially—towards the promotion of utilitarian ends, towards enjoyment or power.\n\nIn my first Encyclical Letter I stressed the danger of absolutizing such an approach when I wrote: “The man of today seems ever to be under threat from what he produces, that is to say from the result of the work of his hands and, even more so, of the work of his intellect and the tendencies of his will. All too soon, and often in an unforeseeable way, what this manifold activity of man yields is not only subject to 'alienation', in the sense that it is simply taken away from the person who produces it, but rather it turns against man himself, at least in part, through the indirect consequences of its effects returning on himself. It is or can be directed against him. This seems to make up the main chapter of the drama of present-day human existence in its broadest and universal dimension. Man therefore lives increasingly in fear. He is afraid of what he produces—not all of it, of course, or even most of it, but part of it and precisely that part that contains a special share of his genius and initiative—can radically turn against himself”. 53\n\nIn the wake of these cultural shifts, some philosophers have abandoned the search for truth in itself and made their sole aim the attainment of a subjective certainty or a pragmatic sense of utility. This in turn has obscured the true dignity of reason, which is no longer equipped to know the truth and to seek the absolute.\n\n48. This rapid survey of the history of philosophy, then, reveals a growing separation between faith and philosophical reason. Yet closer scrutiny shows that even in the philosophical thinking of those who helped drive faith and reason further apart there are found at times precious and seminal insights which, if pursued and developed with mind and heart rightly tuned, can lead to the discovery of truth's way. Such insights are found, for instance, in penetrating analyses of perception and experience, of the imaginary and the unconscious, of personhood and intersubjectivity, of freedom and values, of time and history. The theme of death as well can become for all thinkers an incisive appeal to seek within themselves the true meaning of their own life. But this does not mean that the link between faith and reason as it now stands does not need to be carefully examined, because each without the other is impoverished and enfeebled. Deprived of what Revelation offers, reason has taken side-tracks which expose it to the danger of losing sight of its final goal. Deprived of reason, faith has stressed feeling and experience, and so run the risk of no longer being a universal proposition. It is an illusion to think that faith, tied to weak reasoning, might be more penetrating; on the contrary, faith then runs the grave risk of withering into myth or superstition. By the same token, reason which is unrelated to an adult faith is not prompted to turn its gaze to the newness and radicality of being.\n\nThis is why I make this strong and insistent appeal—not, I trust, untimely—that faith and philosophy recover the profound unity which allows them to stand in harmony with their nature without compromising their mutual autonomy. The parrhesia of faith must be matched by the boldness of reason.\n\nCHAPTER V - THE MAGISTERIUM'S INTERVENTIONS IN PHILOSOPHICAL MATTERS\n\nThe Magisterium's discernment as diakonia of the truth\n\n49. The Church has no philosophy of her own nor does she canonize any one particular philosophy in preference to others. 54 The underlying reason for this reluctance is that, even when it engages theology, philosophy must remain faithful to its own principles and methods. Otherwise there would be no guarantee that it would remain oriented to truth and that it was moving towards truth by way of a process governed by reason. A philosophy which did not proceed in the light of reason according to its own principles and methods would serve little purpose. At the deepest level, the autonomy which philosophy enjoys is rooted in the fact that reason is by its nature oriented to truth and is equipped moreover with the means necessary to arrive at truth. A philosophy conscious of this as its “constitutive status” cannot but respect the demands and the data of revealed truth.\n\nYet history shows that philosophy—especially modern philosophy—has taken wrong turns and fallen into error. It is neither the task nor the competence of the Magisterium to intervene in order to make good the lacunas of deficient philosophical discourse. Rather, it is the Magisterium's duty to respond clearly and strongly when controversial philosophical opinions threaten right understanding of what has been revealed, and when false and partial theories which sow the seed of serious error, confusing the pure and simple faith of the People of God, begin to spread more widely.\n\n50. In the light of faith, therefore, the Church's Magisterium can and must authoritatively exercise a critical discernment of opinions and philosophies which contradict Christian doctrine. 55 It is the task of the Magisterium in the first place to indicate which philosophical presuppositions and conclusions are incompatible with revealed truth, thus articulating the demands which faith's point of view makes of philosophy. Moreover, as philosophical learning has developed, different schools of thought have emerged. This pluralism also imposes upon the Magisterium the responsibility of expressing a judgement as to whether or not the basic tenets of these different schools are compatible with the demands of the word of God and theological enquiry.\n\nIt is the Church's duty to indicate the elements in a philosophical system which are incompatible with her own faith. In fact, many philosophical opinions—concerning God, the human being, human freedom and ethical behaviour— engage the Church directly, because they touch on the revealed truth of which she is the guardian. In making this discernment, we Bishops have the duty to be “witnesses to the truth”, fulfilling a humble but tenacious ministry of service which every philosopher should appreciate, a service in favour of recta ratio, or of reason reflecting rightly upon what is true.\n\n51. This discernment, however, should not be seen as primarily negative, as if the Magisterium intended to abolish or limit any possible mediation. On the contrary, the Magisterium's interventions are intended above all to prompt, promote and encourage philosophical enquiry. Besides, philosophers are the first to understand the need for self-criticism, the correction of errors and the extension of the too restricted terms in which their thinking has been framed. In particular, it is necessary to keep in mind the unity of truth, even if its formulations are shaped by history and produced by human reason wounded and weakened by sin. This is why no historical form of philosophy can legitimately claim to embrace the totality of truth, nor to be the complete explanation of the human being, of the world and of the human being's relationship with God.\n\nToday, then, with the proliferation of systems, methods, concepts and philosophical theses which are often extremely complex, the need for a critical discernment in the light of faith becomes more urgent, even if it remains a daunting task. Given all of reason's inherent and historical limitations, it is difficult enough to recognize the inalienable powers proper to it; but it is still more difficult at times to discern in specific philosophical claims what is valid and fruitful from faith's point of view and what is mistaken or dangerous. Yet the Church knows that “the treasures of wisdom and knowledge” are hidden in Christ (Col 2:3) and therefore intervenes in order to stimulate philosophical enquiry, lest it stray from the path which leads to recognition of the mystery.\n\n52. It is not only in recent times that the Magisterium of the Church has intervened to make its mind known with regard to particular philosophical teachings. It is enough to recall, by way of example, the pronouncements made through the centuries concerning theories which argued in favour of the pre-existence of the soul, 56 or concerning the different forms of idolatry and esoteric superstition found in astrological speculations, 57 without forgetting the more systematic pronouncements against certain claims of Latin Averroism which were incompatible with the Christian faith. 58\n\nIf the Magisterium has spoken out more frequently since the middle of the last century, it is because in that period not a few Catholics felt it their duty to counter various streams of modern thought with a philosophy of their own. At this point, the Magisterium of the Church was obliged to be vigilant lest these philosophies developed in ways which were themselves erroneous and negative. The censures were delivered even-handedly: on the one hand, fideism 59 and radical traditionalism, 60 for their distrust of reason's natural capacities, and, on the other, rationalism 61 and ontologism 62 because they attributed to natural reason a knowledge which only the light of faith could confer. The positive elements of this debate were assembled in the Dogmatic Constitution Dei Filius, in which for the first time an Ecumenical Council—in this case, the First Vatican Council—pronounced solemnly on the relationship between reason and faith. The teaching contained in this document strongly and positively marked the philosophical research of many believers and remains today a standard reference-point for correct and coherent Christian thinking in this regard.\n\n53. The Magisterium's pronouncements have been concerned less with individual philosophical theses than with the need for rational and hence ultimately philosophical knowledge for the understanding of faith. In synthesizing and solemnly reaffirming the teachings constantly proposed to the faithful by the ordinary Papal Magisterium, the First Vatican Council showed how inseparable and at the same time how distinct were faith and reason, Revelation and natural knowledge of God. The Council began with the basic criterion, presupposed by Revelation itself, of the natural knowability of the existence of God, the beginning and end of all things, 63 and concluded with the solemn assertion quoted earlier: “There are two orders of knowledge, distinct not only in their point of departure, but also in their object”. 64 Against all forms of rationalism, then, there was a need to affirm the distinction between the mysteries of faith and the findings of philosophy, and the transcendence and precedence of the mysteries of faith over the findings of philosophy. Against the temptations of fideism, however, it was necessary to stress the unity of truth and thus the positive contribution which rational knowledge can and must make to faith's knowledge: “Even if faith i", "description": "Encyclical Letter Fides et Ratio (14 September 1998)", "authors": [], "top_image": "", "published_at": "2019-10-30"}