{"pub": "cnn", "url": "https://cnn.com/2019/05/20/tech/facebook-robots-bugs-ai/index.html", "downloaded_at": "2019-09-23 04:27:19.802204+00:00", "title": "Why Facebook is teaching a bug-like robot to walk", "language": "en", "text": "Menlo Park (CNN Business) In a rooftop garden at Facebook's Menlo Park headquarters, a six-legged robot named Daisy is making chittering noises as it staggers on the sandy ground.\n\nDaisy, which looks like a giant bug, is part of a robot science project inside Facebook's Artificial Intelligence Research (FAIR) group. Since last summer, scientists at FAIR have been helping robots teach themselves how to walk and grasp objects. The goal is for them to learn in a way that's similar to how people gain these skills: by exploring the world around them and using trial and error.\n\nFacebook is training this robot, named Daisy, how to walk to help advance AI research.\n\nMany people may not know the world's largest social network is also tinkering with robots. But this group's work isn't meant to show up, say, in your Facebook news feed. Rather, the hope is that the project will be able to help AI researchers advance artificial intelligence that can learn more independently. They also want to get robots to learn with less of the data that humans are often required to gather before AI can accomplish tasks.\n\nIn theory, this work could eventually help improve the kinds of AI activities that many tech companies (including Facebook) are working on, such as translating words from one language to another, or recognizing people and objects in images.\n\nIn addition to Daisy, Facebook's researchers are working with robots that consist of multi-jointed arms, and robot hands that have touch sensors on their fingertips. They're using a machine-learning technique called self-supervised learning, in which the robots must figure out how to do things — such as pick up a rubber duck — by attempting the task repeatedly, then using data from sensors (such as the tactile sensors on a robot's fingers) to get better and better.\n\nRead More", "description": "In a rooftop garden at Facebook's Menlo Park headquarters, a six-legged robot named Daisy is making chittering noises as it staggers on the sandy ground.", "authors": ["Rachel Metz", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190517132603-03-facebook-robots-curious-ai-super-tease.jpg", "published_at": "2019-05-20"}