{"pub": "businessinsider", "url": "https://businessinsider.sg/11-photos-show-the-amazing-light-show-at-the-istanas-150th-anniversary-party", "downloaded_at": "2019-10-08 05:13:48.046902+00:00", "title": "11 photos show the amazing light show at the Istana’s 150th anniversary party", "language": "en", "text": "Over 2,000 people attended the finale of the year-long commemoration, which is the first time the Istana opened it’s doors to the public after sunset. Facebook/Lee Hsien Loong\n\nHistoric scenes and vivid colours lit up the Istana on Sunday (Oct 6) night as they told the history of the 150-year-old building.\n\nThe lightshow was the highlight of the Istana 150 Commemorative Event, which is the first time the building opened it’s doors to the public after sunset.\n\nOver 2,000 people attended the finale of the year-long commemoration, which was hosted by President Halimah Yacob and her husband, Mohamed Abdullah Alhabshee.\n\nFormer president Tony Tan and his wife Mary were also present, as were Puan Noor Aishah, the wife of first president Yusof Ishak, and Urmila Nathan, the wife of former president S. R. Nathan.\n\nThere was also a series of live performances by the Singapore Symphony Orchestra, and other home-grown talents like Clement Chow, Rahimah Rahim, and MICapella.\n\nAccording to The President’s Office, tickets to yesterday’s events were sold out a mere six hours after their release on Sept 13. All proceeds from the tickets will be donated to charity through the President’s Challenge.\n\nAdditionally, the Istana saw a record visitor-ship of 90,000 people over the span of the past five Istana open house events this year, a 30 per cent increase from past years.\n\nPrime Minister Lee Hsien Loong, who attended the event, described it as “a very special evening”.\n\n“The world will probably look quite different by the time the Istana next celebrates its next major milestone, but I am confident that Singapore will persevere and progress,” he added.\n\nHere are 11 photos, including some taken by the PM, that show how spectacular the Istana looked on Sunday night.\n\nAs twilight came, the facade of the building lit up with historic scenes.\n\nOriginally, known as Government House after it’s completion in 1869, the Istana got it’s current name in 1965, when Singapore gained independence.\n\nThe building has hosted many different delegates from near and far, and has been the site of many historic moments and engagements.\n\nThe “Istana 150” commemoration looked at how the Istana has been a part of the Singapore story.\n\ncaption The scenes depicted the rich history of the building. source Facebook/Lee Hsien Loong\n\nThe Singapore Armed Forces (SAF) Military Police Command had a live performance too, accompanied by a backdrop of the Singapore Flag.\n\ncaption The performance had a lot of flair. source Facebook/Lee Hsien Loong\n\nThe military police of the past was also put on display.\n\ncaption source Facebook/Lee Hsien Loong\n\nThere were patriotic scenes, such as this one of the banners that can be seen in Istana Park and throughout the country.\n\ncaption It was a lit night. source SPH\n\nThe building was lit up by vivid colours and designs that illustrate the building’s heritage, such as this one pictured, to represent Singapore’s multicultural society.\n\ncaption Looks like a design you would see on stained glass, or one you could find printed on an Indian carpet. source Facebook/Lee Hsien Loong\n\nThere were also decorative and colourful scenes, like this stunning floral display.\n\ncaption A myriad of flowers. source Facebook/Lee Hsien Loong\n\nAnd this one too.\n\ncaption A close-up of the lightshow. source The Straits Times\n\nThe lightshow could be seen shining vibrantly in the night, even from far away.\n\ncaption Many visitors had their handphones out, snapping pictures of the show. source Facebook/Lee Hsien Loong\n\nOf course, there was a fireworks display to end it all off.\n\nThe twist however, was that this display came in the form of a lightshow as well – which looked just as stunning.\n\ncaption The Istana blended in with the night sky to make the fireworks look even more realistic. source President’s Office\n\nAt one point, the aquamarine fireworks made it look like the building was a beautiful icy mansion.\n\ncaption Absolutely gorgeous. source The Straits Times\n\nToday, the Istana will go back to looking like how it does normally. Which leaves us to wonder – when will the next lightshow be?\n\ncaption Back to being serious-looking. source Facebook/Lee Hsien Loong\n\nRead Also:", "description": "Business Insider - Over 2,000 people attended the finale of the year-long Istana 150 commemoration, which is the first time the Istana opened it's doors to the public after sunset.. Read more at businessinsider.sg", "authors": ["Lamont Mark Smith"], "top_image": "https://static.businessinsider.sg/sites/2/2019/10/0710-Istana-LHLHeader.jpg", "published_at": "2019-10-07"}