{"pub": "reuters", "url": "https://in.reuters.com/article/gm-amazon/general-motors-calls-on-alexa-to-give-vehicles-more-skills-idINKBN1WA2MM", "downloaded_at": "2019-09-25 23:33:45.608372+00:00", "title": "General Motors calls on Alexa to give vehicles more skills", "language": "en", "text": "DETROIT (Reuters) - General Motors Co (GM.N) will enable U.S. owners of 2018 and newer model vehicles to download Amazon.com’s (AMZN.O) Alexa digital assistant software to control navigation, streaming media and phones starting next year, the companies said on Wednesday.\n\nFILE PHOTO: The GM logo is seen at the General Motors plant in Sao Jose dos Campos, Brazil, January 22, 2019. REUTERS/Roosevelt Cassio/File Photo\n\nThe agreement gives Amazon access to millions of vehicles, and a substantial expansion of its Alexa franchise. Embedding Alexa in vehicles is just one element of a broad strategy Amazon Chief Executive Jeff Bezos is pursuing to extend the e-commerce company’s reach into transportation.\n\nFor GM, the deal is the latest in a series of moves to embrace widely-used technology industry brands. For years, GM and other automakers tried to develop infotainment technology in-house using automotive suppliers. But customers have panned the results, and instead embraced digital assistants such as Alexa, Google Voice or Apple Inc’s (AAPL.O) Siri.\n\nEarlier this month, GM said it would embed Alphabet Inc (GOOGL.O)’s Google technology in the dashboards of vehicles sold outside of China starting in 2021.\n\nSantiago Chamorro, GM’s vice president for Global Connected Services, said customers ultimately will be able to choose which voice concierge service to use - the car’s standard voice controls, Alexa, Google or an app embedded in a smartphone.\n\n“We believe in a future where the customer has options,” said Amazon’s Ned Curic, vice president of Alexa Auto at Amazon.\n\nOwners of GM vehicles will be able to download Alexa software to their vehicles during the first half of 2020, GM said.\n\nThe separate Alexa and Google deals do not cover GM vehicles sold in China, Chamorro said.\n\n“Our solution for China is particular to China,” Chamorro said. “Stay tuned. We are working on it.”\n\nGM’s shift to Google and Amazon to provide software for interactive dashboards has battered traditional suppliers of vehicle infotainment and navigation systems. Shares in GM in-dash navigation services supplier Telenav Inc (TNAV.O) have lost half their value since GM announced its deal with Alphabet.", "description": "General Motors Co will enable U.S. owners of 2018 and newer model vehicles to download Amazon.com's Alexa digital assistant software to control navigation, streaming media and phones starting next year, the companies said on Wednesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190925&t=2&i=1433869101&w=1200&r=LYNXMPEF8O1X4", "published_at": "2019-09-25"}