{"pub": "guardian", "url": "https://theguardian.com/film/2019/oct/09/parasite-how-bong-joon-ho-returned-home-to-make-his-masterpiece", "downloaded_at": "2019-10-09 07:02:42.719319+00:00", "title": "Parasite: how Bong Joon-ho returned home to make his masterpiece", "language": "en", "text": "There’s no place like home. It’s a cliche that sounds pretty cruel applied to Parasite, Bong Joon-ho’s brilliant, insidious twist on the home-invasion thriller, in which a frostily modernist luxury house serves as several different things to different people – a status symbol, a shelter, a prison – but doesn’t offer homely comforts to anyone, exactly. Yet it’s true, in a funny way, for Bong himself. A globally minded film-maker with big-dreaming genre nous, he has spent the last few years making a bid for mainstream Hollywood clout, only to finally make an international phenomenon from his own doorstep.\n\nParasite review – creepy invasion of the lifestyle snatchers Read more\n\nBong’s last two films, 2013’s Snowpiercer and 2017’s Okja, were his first to be made in English: they weren’t exactly misfires, either critically or commercially, yet both clearly had designs on being bigger deals than they were. Adapted from a comic book, with brawny Marvel man Chris Evans in the lead, Snowpiercer was a delirious dystopian adventure that merged Bong’s auteurist eccentricity with bolshy blockbuster aspirations: it raked in over $82m outside the US, double its production budget (at $40m, then a record for a Korean production).\n\nIn the States, however, its bullet-train momentum was halted by the ignoble figure of Harvey Weinstein, as Bong joined the long line of directors to fight “Harvey Scissorhands” over the film’s final edit. The director refused to follow Weinstein’s proposed cuts and additions; the impasse delayed the film’s American release for a year, prompting “Free Snowpiercer” protests from impatient fans. Finally, the uncut film was granted a release, albeit a limited one on the Weinsteins’ lower-profile Radius-TWC label. It took just $4.5m: the film may not have been conventional popcorn fare, but it clearly had set its sights higher than that. (Meanwhile, it never even made it to UK cinemas.)\n\nFacebook Twitter Pinterest Bong Joon Ho directing Okja. Photograph: Kimberly French/Jae Hyuk Lee / Netflix\n\nUndaunted, Bong flirted with Hollywood again in Okja, a daffy fantasy romp that meshed a South Korean setting and sensibility with an international eco-warrior conscience and lashings of multiplex-friendly spectacle. Jake Gyllenhaal and Tilda Swinton were on hand too, acting with the level of subtlety you’d expect of a Jon Ronson-scripted film about a mall-trashing, genetically modified superpig escaping the slaughterhouse with the loving help of an adorable tyke: Babe on highly aggressive steroids, if you will. Bong had more sympathetic Tinseltown partners than Weinstein this time: Netflix and Brad Pitt’s Plan B Entertainment boarded the project early, stumping up a $50m production budget (breaking Snowpiercer’s aforementioned record).\n\nIt premiered at Cannes, in the last year that the tradition-bound French festival permitted Netflix’s film in its competition, and was well enough received: scattered boos were directed at the streaming service rather than the film itself. But by the time it popped up on the Netflix platform a month later, it felt a bit of a non-event. Critical enthusiasm was muted relative to Bong’s earlier, wilder, more homegrown genre rides like Mother and The Host, and it quietly sank into Netflix’s unquantifiable morass of content – it’s doubtless been seen by many, but it never felt like anyone was really talking about it.\n\nParasite, on the other hand, has been inspiring itchy international conversation since its premiere at Cannes, where it wowed critics and Alejandro González Iñárritu’s jury, who unanimously handed it the Palme d’Or. Many a Palme d’Or winner goes quiet outside the rarefied film-festival atmosphere; Parasite, with its inky comedy driven by seething social fury, has found its public. With multiple global territories (including the US, UK and Japan) yet to weigh in, it has already grossed $91m worldwide; eager chatter about it is lighting up social media. (If you don’t believe me, search the #BongHive hashtag on Twitter to see the film’s Generation Z cult in action.) Its hip US distributor Neon will be planning a lively Oscar campaign, targeting not just the foreign-language category, but a best picture nomination too. That would surely seal its status as the biggest Korean crossover phenomenon in film history: the BTS of cinema, effectively.\n\nThat’s a pretty remarkable trajectory for a film that, in addition to its chilly, bleak outlook and grisly violence, is entirely uncompromised in its sheer Korean-ness: no English dialogue or Hollywood stars here, while the film is so vivid in its cultural specifics that jjapaguri – a kind of local instant noodle dish – serves as a key plot point. Yet Parasite’s delicious indigenous details hardly obscure its more universal agenda: it’s a film that taps into a kind of anti-capitalist rage against rigid structures of class and privilege that are being felt everywhere from Korea to America to Brexit Britain. Bong’s rollercoaster storytelling skills are a factor too, of course, but it turns out the way to engage a global audience, in this case, was not to play Hollywood’s own game: it’s the political resonance of Parasite, not any stylistic familiarity, that is striking a chord across continents.\n\nBong isn’t the only world-cinema auteur of late, meanwhile, to find that you can go home again. His compatriot Park Chan-wook befuddled audiences with his bewitchingly bonkers American debut Stoker; an indifferent commercial reception sent him back to home turf, where he made The Handmaiden and landed a global arthouse sensation. (He’s since surprised us again, heading over to the BBC to direct the very chic Le Carré miniseries The Little Drummer Girl; so far, this back-and-forth travelling has cramped his style.)\n\nHaifaa Al-Mansour, the first Saudi woman to direct a feature with the arthouse charmer Wadjda, bombed when she headed abroad to make the literary biopic Mary Shelley; she headed back to Saudi Arabia to direct the crowd-pleasing feminist parable The Perfect Candidate, which was warmly received at Venice and Toronto last month, and has been entered by her home country as its Oscar submission.\n\nThese are different journeys, of course, from that of Alfonso Cuarón, who capitalised on his vast Hollywood success to head home for his most personal project to date – though the lavish acclaim and awards heaped upon his Netflix-backed Mexican memory piece Roma nonetheless made it a career milestone. Its good fortune, like Parasite’s, proves that Hollywood is no longer necessarily the final destination for a successful directorial career: sometimes it’s just the Emerald City, en route to a happy homecoming.", "description": "The director’s wildly acclaimed, Oscar-buzzed thriller marks a fascinating high point in a career that’s recovered from a Hollywood struggle", "authors": ["Guy Lodge"], "top_image": "https://i.guim.co.uk/img/media/dcb4359a36644f78837db777b0ce22ce5e33156d/0_112_2732_1639/master/2732.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=6f8220d3414b0d2230a942efa1c0fe8e", "published_at": "2019-10-09"}