{"pub": "npr", "url": "https://npr.org/2019/10/14/769423806/cory-booker-asked-about-struggles-with-black-voters-let-my-work-speak-for-me", "downloaded_at": "2019-10-14 23:16:27.345357+00:00", "title": "Cory Booker Asked About Struggles With Black Voters: 'Let My Work Speak For Me'", "language": "en", "text": "Cory Booker Asked About Struggles With Black Voters: 'Let My Work Speak For Me'\n\nHis soaring rhetoric has drawn comparisons to former President Barack Obama. He prides himself as the only Democratic presidential hopeful to live in an inner-city neighborhood. Reforming a criminal justice system plagued by racial disparities is central to his campaign.\n\nYet New Jersey Sen. Cory Booker, one of two top-tier African American candidates in a crowded Democratic field, continues to struggle making inroads with black voters — something he addressed on Saturday in a wide-ranging interview with two voters that was moderated by NPR's Ari Shapiro.\n\n\"Let my work speak for me,\" said Booker, responding to a question about why some residents in his hometown of Newark, N.J., don't see him as \"the voice\" of black youth.\n\nEnlarge this image toggle caption A.J. Chavar for NPR A.J. Chavar for NPR\n\nThe interview — part of an NPR series with Democratic presidential candidates called Off Script — touched on an array of issues, from the student loan crisis to Booker's relationship with actress and activist Rosario Dawson and the candidate's stance on the Tupac vs. Biggie debate.\n\nAt Vonda's Kitchen in Newark, N.J., Booker spoke with education advocate Shanell Dunns, economist Diana Candelejo and Shapiro.\n\nDunns, who runs an education and leadership consulting business in Newark, told Booker that many of the young people she works with say criminal justice is a top issue. She then added:\n\n\"When we talk about the presidential candidacy, a lot of times they say they don't feel like you are the voice — the black voice — for the black youth. How do you respond to not being able to connect to that demographic of youth?\"\n\nEnlarge this image toggle caption A.J. Chavar for NPR A.J. Chavar for NPR\n\nBooker rejected the characterization.\n\n\"Well, No. 1: I think we actually do connect to it. Some of our biggest support is from HBCUs [historically black colleges and universities] to African American young people who are big activists for our campaign. It's one of the groups we do very well in,\" Booker said.\n\nBooker routinely polls in the single digits in most presidential preference surveys.\n\nEnlarge this image toggle caption A.J. Chavar for NPR A.J. Chavar for NPR\n\nWhen surveys are broken down by race, as in a recent poll released last week, African American respondents often place Booker behind other Democratic presidential candidates, including former Vice President Joe Biden, Sen. Bernie Sanders of Vermont and Sen. Elizabeth Warren of Massachusetts.\n\nBooker called the criminal justice system a \"national crisis.\" And he pointed to his record as a senator fighting for reforms such as the First Step Act. Signed into law by President Trump last year, the measure is designed to overhaul federal prisons and broaden rehabilitation opportunities for inmates.\n\n\"So let my work speak for me. In the United States Senate, I've pushed more than a dozen bills on these issues that span from police accountability all the way to the bill that I actually got passed ... the First Step Act, which has already led to the liberation of thousands of people, overwhelmingly black and Latino people.\"\n\nShapiro pressed Booker about his record as mayor of Newark from 2006 to 2013. During his tenure, the Justice Department opened an investigation into the city's police force, saying it had received \"serious allegations of civil rights violations.\"\n\n\"I inherited the police department with decades-long problems and patterns and practices,\" Booker said in defense of his record.\n\nHe said his administration made \"tremendous strides\" to correct the issues but admitted that it came after the Justice Department produced its findings and provided additional resources.\n\n\"At first I was like, 'Why do I need the DOJ?' But when they presented us with the data, we saw that we were not moving fast enough to correct the problems.\"\n\nCandelejo, who works for a local health care network, quizzed Booker on prison privatization and how he would combat escalating student loan debt impacting millions of Americans, among other issues. But it was her icebreaker question to Booker that got the candidate flustered.\n\nEnlarge this image toggle caption A.J. Chavar for NPR A.J. Chavar for NPR\n\n\"I don't think it's going to get better than Rosario Dawson, so when are you proposing?\" Candelejo asked.\n\n\"You've got me stammering,\" the senator said, laughing through his response.\n\n\"I would ... I will ... should I ever get to that point, I will try to embarrass her and put her on the spot,\" Booker said, adding that he's not making any announcements on NPR on that front. \"But I'm very happy where I am right now.\"\n\nHe also joked about being her \"arm candy\" at two of her recent movie premieres, including Zombieland: Double Tap.\n\nEnlarge this image toggle caption A.J. Chavar for NPR A.J. Chavar for NPR\n\nOn the long-running debate about which rap legend was better, Tupac Shakur or The Notorious B.I.G., Booker said this:\n\n\"I just always love Biggie. He's just a person that I just feel this affinity for, because he was unapologetically who he was. So if you had to force me to choose, then I'm going to say Biggie.\"\n\nAnd just for those voters who cast their ballots based on hip-hop preferences, Booker added: \"But, I probably listen to Tupac's music more.\"\n\nBooker and 11 other candidates are debating for the fourth time on Tuesday. The CNN/New York Times Democratic presidential debate airs at 8 p.m. ET on CNN. You can also listen to it on your local NPR station.", "description": "The New Jersey senator sat down for NPR's interview series Off Script and was asked by an undecided voter why some residents in his hometown of Newark don't see him as \"the voice\" of black youth.", "authors": ["Brakkton Booker", "Ari Shapiro"], "top_image": "https://media.npr.org/assets/img/2019/10/12/Booker1_wide-dd529482b6d12b1e6d3e6756d137ebe72fa54430.png?s=1400", "published_at": "2019-10-14"}