{"pub": "hotair", "url": "https://hotair.com/archives/karen-townsend/2019/09/04/obama-appointee-orders-wh-reporters-credentials-restored", "downloaded_at": "2019-09-05 00:11:45.175809+00:00", "title": "Obama appointee orders WH reporter’s credentials restored", "language": "en", "published_at": "2019-09-04", "text": "The White House correspondent for Playboy magazine had his press credentials restored Tuesday by an Obama appointee, U.S. District Judge Rudolph Contreras. This marks the second time a federal judge has ruled in favor of reinstating a journalist’s press pass during the Trump administration.\n\nYou may remember the case of Playboy magazine reporter Brian Karem’s dust-up with former Trump advisor Sebastian Gorka (current Salem Radio show host) in the White House Rose Garden. Karem, also a CNN political analyst, had his press credentials temporarily suspended due to bad behavior after a July 11 White House social media summit. A shouting match between Karem and Gorka, a guest that day, took place in the Rose Garden after Karem described the summit attendees as “group of people that are eager for demonic possession.”\n\nIt’s safe to say that sort of comment offered up by a reporter covering the White House crosses the line of professional behavior. When the White House suspended his credentials, Karem said he would appeal the decision. The guy who likes to play a tough guy reporter suddenly milked victimhood for all he could.\n\nIt was not hard to be apathetic to Karem’s suspension, to be honest. Perhaps you remember that time during a press briefing with former White House Press Secretary Sarah Huckabee Sanders when Karem shouted his question to her – “Don’t you have any empathy for what they go through?” – because of the Trump administration’s immigration law enforcement on the southern border. Reporters are entitled to ask whatever question they want but when it goes to a personal level, it’s unprofessional and unacceptable. Emotional outbursts make the reporter the story, which apparently some of them want these days.\n\nU.S. District Judge Rudolph Contreras ruled in favor of Karem, calling the White House’s decision an arbitrary one. While he issued a temporary restraining order and an injunction against the White House, it was only because he found White House guidelines on appropriate behavior were too vague. He didn’t rule on Karem’s claim of losing his right to free speech. The ruling is not a final ruling but Contreras thinks Karem will win his appeal.\n\n“The First Amendment requires ‘that individual newsmen not be arbitrarily excluded from sources of information,'” Contreras wrote in his opinion, citing federal case law. “His First Amendment interest depends on his ability to freely pursue ‘journalistically productive conversations with White House officials.’ Yet without his hard pass, he lacks access to pursue those conversations — even as an eavesdropper.” In issuing a temporary restraining order and injunction against the White House, Contreras said that the White House’s guidelines for appropriate behavior were insufficient and vague. Contreras’ decision, although not yet a final ruling, signaled that he believed Karem ultimately would prevail. “White House events appear to vary greatly in character,” the judge wrote, adding that “without any contextual guideposts, ‘professionalism,’ standing alone, remains too murky to provide fair notice here. … “Karem has provided some evidence that White House press events are often freewheeling and that aggressive conduct has long been tolerated without punishment.” The judge clarified that “In granting Karem relief, the Court finds only that the White House likely did not provide the requisite guidance in this specific case — nothing more. And, as noted earlier, the Court does not reach Karem’s independent free speech claim.” Nevertheless, the judge concluded: “Karem has shown that even the temporary suspension of his pass inflicts irreparable harm on his First Amendment rights.”\n\nIt’s pretty sad when a journalist has to be told what is and isn’t professional behavior, especially in such a top job as covering the White House. The dust-up in the Rose Garden was more of the same grandstanding for cameras. His antics give him an opportunity to appear on CNN. That seems to be more important than actually reporting on the events he’s sent to cover.\n\nThe judge wrote that when Karem told Gorka that they could ‘go outside and have a long conversation,’ it was a joke, not an actual threat of physical violence.\n\nWhite House press secretary Stephanie Grisham pushed back on the judge’s ruling, as you would expect to happen. She was the one to make the decision to suspend Karem’s credentials.\n\n“We disagree with the decision of the district court to issue an injunction that essentially gives free rein to members of the press to engage in unprofessional, disruptive conduct at the White House,” Grisham said. “Mr. Karem’s conduct, including threatening to escalate a verbal confrontation into a physical one to the point that a Secret Service agent intervened, clearly breached well-understood norms of professional conduct. The Press Secretary must have the ability to deter such unacceptable conduct.”\n\nThe President of the White House Correspondents’ Association voiced approval of the judge’s ruling while calling for professionalism from journalists.\n\nWhite House Correspondents’ Association (WHCA) President Jonathan Karl, ABC News’ chief White House correspondent, said: “The WHCA is gratified the U.S. District Court of the District of Columbia acted to uphold the due process rights of one of our members. The WHCA will continue to advocate for the rights of our members and against actions by the government that would have a chilling effect on journalism protected by the First Amendment. As we have said repeatedly, we believe everyone should conduct themselves professionally at the White House.”\n\nAs to Karem’s cries of victimhood, those don’t wash at all. His credentials weren’t yanked for several weeks after the altercation in the Rose Garden and he was given notice, with the opportunity to object. It’s not like he was disciplined out of the blue. The judge said Karem was able to provide evidence by being allowed to remain on the White House grounds during that period of time. That is why the judge issued the restraining order – he thinks the White House is able to wait to enforce sanctions against Karem until the court proceedings conclude.\n\nNow we wait for the final, formal ruling. I’m not a lawyer but if I had to guess, I’d say he gets his full credentials back with maybe a slap on the wrist. Perhaps the White House press secretary can issue more concise, clear guidelines to those who don’t understand what the term “professionalism” means.", "description": "White House pushes back", "authors": ["Karen Townsend", "John Sexton", "Jazz Shaw", "Ed Morrissey"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/0b400ea6-8f79-4d36-a1a2-10fe8cb4f2c8.jpg"}