{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/09/13/its-time-democratic-field-start-getting-smaller", "downloaded_at": "2019-09-13 18:21:09.081868+00:00", "title": "It’s time for the Democratic field to start getting smaller", "language": "en", "text": "\n\nSen. Amy Klobuchar (Minn.), left, and Sen. Cory Booker (N.J.) on-stage during the Democratic presidential primary debate in Houston on Thursday night. (David J. Phillip/AP)\n\nContributing columnist\n\nIt’s after Labor Day and the race for the Democratic nomination is now well underway. Despite the fact that it’s a long road trip, the field seems determined to use the byways instead of the highways. Democrats know where they’re headed, but they aren’t so sure when they’ll get there. And at this point, they might be better off with fewer passengers along for the ride.\n\nWatching last night’s debate didn’t do much to help clarify the route. Joe Biden. Bernie Sanders. Elizabeth Warren. You can flip the order, but nothing about this latest debate has changed anything about their standings. If you’re Kamala Harris or Pete Buttigieg, the good news is that you’re still in the next tier, well below the top three, and not at the bottom. Each of the other five had a memorable moment or two, but nothing that’s likely to thrust them into the top five.\n\nSo, where does that leave voters?\n\nDebates are not the best way to assess the most important qualities in a nominee — their capacity to sort through competing views, consume vast amounts of information and to make considered decisions — but they are part of the process. For them to be productive, we need more time to explore complex issues and sort through who can take on President Trump, and the only way to get more time with each contender is to put fewer candidates on stage.\n\nAt this point, it’s increasingly difficult for some candidates to claim a rationale for remaining in the race. Looking at weeks of national and state polls, most of the candidates have remained in the low single digits, even some who made the debate stage last night. And no offense, but four or five of those microphones could have been put on mute, and we would still have quality, diverse choices for the 2020 nomination. Whatever they might hope, a candidate can meet the de minimis requirements for the debate stage, have a strong single-night performance and not be in the hunt — really.\n\nThe campaign calendar is moving fast, especially factoring in the coming holidays and the short few weeks early in the year before Iowa and New Hampshire voters take center stage. It’s time to start narrowing this field — seriously. All props to those who have tried — putting yourself out there is difficult and so is taking yourself out. But here’s a reality check. If you’ve been in the race for more than a year, had the exposure provided in two national debates, did not qualify for the third debate, and cannot convince donors to give to you or even one person in a poll to identify you as their choice, it’s over. And, when you’ve been sitting at the bottom of the barrel in early-state polls since the flowers started to bloom in the spring, it’s likely that voters believe your viewpoint is represented already by someone else in the field. Or they just aren’t buying what you’re selling.\n\nIn a primary, voters want to absorb the narrower differences among Democratic candidates on some issues, among them climate, guns, criminal justice and the broad differences on others, including health care, immigration and trade and the economy. On health care, it was fascinating to hear and see Warren, Sanders and Biden, side by side defending and explaining their ideas. Is America ready for big change with a plan to get there, or is it easier to transition from Obamacare allowing people to choose what they want? More of that debate, please.\n\nWhat does a person’s style, demeanor and deftness in handling questions tell you about the kind of president she would be? Voters deserve these answers without the distraction of candidates who just aren’t hitting the mark. We had to wait to the bitter end to catch a few moments of authenticity. You could feel the stillness of the room as Biden shared the tragic loss of his wife and daughter and later a son to cancer. When Warren talked about her joy of being a special-needs teacher and the pain and anger of leaving a job because of her pregnancy, she seemed like a neighbor or a friend.\n\nWhether by natural selection or volunteerism (and whether they know it or not), time is up for most of the field. Just because the rules allow you to continue to breathe shallow breaths into your campaign does not mean you should.\n\nAre we there yet? It’s time to get on the interstate.\n\nRead more:\n\nJennifer Rubin: Moderates stood out in the third debate. Too bad it won’t make much of a difference.\n\nE.J. Dionne Jr.: Democrats finally realized who their real opponent is\n\nAlyssa Rosenberg: The Democratic debates are making me feel better about America\n\nAnn Telnaes cartoons: Sketching the third Democratic debate\n\nDonna F. Edwards: Time is running out. Impeach Trump.", "description": "The debates can't tell us anything useful until we can spend more time with fewer candidates.", "authors": ["Donna F. Edwards", "Contributing Columnist", "September At Am", "A Washington Post Contributing Columnist", "Represented Maryland S District For Five Terms In Congress. Prior To Her Time In Office", "She Worked In Philanthropy", "Nonprofit Advocacy. She Provides Political Commentary Regularly On Nbc", "Msnbc"], "top_image": "https://www.washingtonpost.com/resizer/297eAdTF2Sa96BUxM824W4oLxdM=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/GLA66TWWBQI6TCJEDW35VR4X7M.jpg", "published_at": "2019-09-13"}