{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/12/max-scherzer-shines-nationals-take-2-0-series-lead", "downloaded_at": "2019-10-13 18:42:25.139525+00:00", "title": "Nationals take 2-0 series lead as Scherzer shines", "language": "en", "text": "ST. LOUIS — Max Scherzer continued his team’s magical postseason run here Saturday afternoon, not allowing a hit until the seventh inning as the Washington Nationals beat the St. Louis Cardinals 3-1 in the National League Championship Series before a sellout crowd of 46,458 fans.\n\nThe Nationals lead the series 2-0 and have won 14 of their last 16 games.\n\nWashington is making its first appearance in the NLCS after falling four times in the first round from 2012 to 2017 and is now just two victories away from its first trip to the World Series.\n\nThe Cardinals first hit Saturday came to start the seventh as Paul Goldschmidt lined a single just in front of left fielder Juan Soto, a second-year player who decided against trying to make a diving catch. Scherzer was pulled after seven scoreless innings as he gave up the one hit with 11 strikeouts and two walks.\n\nThey have just allowed four hits in the first two games to the Cardinals, a storied franchise that has won 11 World Series titles. Anibal Sanchez and Sean Doolittle combined for a one-hitter Friday, with the Cardinals only hit coming with two outs in the eighth.\n\nScherzer threw two regular-season no-hitters for the Nationals in 2015 — his first year with the club. Doolittle allowed an RBI double in the eighth to make it 3-1 after center fielder Michael A. Taylor misjudged the ball hit by Jose Martinez.\n\nNationals lefty Patrick Corbin retired Kolten Wong for the first out in the last of the ninth.\n\nWashington’s Daniel Hudson, who missed Friday’s game, got the last two outs in the ninth to seal the win.\n\nThe afternoon game Saturday began with shadows over the batter’s box, making it even more difficult to hit against Scherzer and St. Louis starter Adam Wainwright.\n\nTaylor, starting again in place of injured Victor Robles, hit a solo homer in the third to give the Nationals a 1-0 lead. It was the third postseason homer for Taylor, who appeared in more games in the minors than majors this year.\n\n“I don’t want him to come back and just play one game and get hurt,” manager Dave Martinez said of Robles. “I want him to come back and play multiple games.”\n\nAdam Eaton had a two-run double in the top of the eighth to give the Nationals a cushion at 3-0 off Wainwright, who yielded three runs in 7 1/3 innings.\n\nWashington reliever Hudson returned to the team Saturday after he missed Friday’s game, as his wife gave birth to the couple’s third child in Arizona. The girl is named Millie.\n\nHudson began the season with the Toronto Blue Jays and was traded to the Nationals in late July. His absence set off a debate about work versus family.\n\n“I went from not having a job March 21 to this huge national conversation on family values going into the playoffs,” Hudson said. “Everybody’s got their opinions, man, and I really value my family and my family time. And this organization was 100 percent on board with what my priorities are and I’m really appreciative of that.”\n\n“I never missed any of my kids’ births,” said Martinez, a major league veteran of 16 years as a player. “I think it’s important. I told him that.”\n\nSunday is a travel day and Game 3 will begin at Nationals Park on Monday at 7:38 p.m. The scheduled pitchers are Washington’s Stephen Strasburg (18-6 in 2019) and Jack Flaherty (11-8), the Cardinals ace.\n\nBoth should get votes for in the National League Cy Young Award balloting, which took place before the playoffs.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Max Scherzer continued his team's magical postseason run here Saturday afternoon, not allowing a hit until the seventh inning as the Washington Nationals beat the St. Louis Cardinals 3-1 in the National League Championship Series before a sellout crowd of 46,458 fans.", "authors": ["The Washington Times Http", "David Driver", "Special To The Washington Times"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/12/nlcs_nationals_cardinals_baseball_75555_c0-127-3056-1909_s1200x700.jpg?e0786184edbd1ff32e6a9338d57fea2054878edc", "published_at": "2019-10-12"}