{"pub": "thehill", "url": "https://thehill.com/homenews/administration/465020-anti-trump-spice-company-is-second-biggest-buyer-of-impeachment", "downloaded_at": "2019-10-09 18:31:10.801252+00:00", "title": "Anti-Trump spice company is major buyer of impeachment Facebook ads: analysis", "language": "en", "text": "A Wisconsin-based spice company has been the second-largest buyer of impeachment ads on Facebook in recent days, second only to President Trump Donald John TrumpPelosi hits back at Trump over letter: 'Only the latest attempt to cover up his betrayal of our democracy' Trump directed Perry, State Dept. officials to talk to Giuliani on Ukraine: report Murkowski warns against rushing to conclusions on Trump impeachment MORE himself, according to a new analysis released Tuesday.\n\nPenzeys Spices in Wauwatosa, Wis., has spent $92,000 on pro-impeachment ads between Sept. 29 and Oct. 5, according to data compiled by Bully Pulpit Interactive, a Democratic communications agency, and published by Axios.\n\nADVERTISEMENT\n\nBy comparison, the Trump campaign shelled out $718,000 to defend the president after House Democrats launched an impeachment inquiry last month over his dealings with Ukraine, while billionaire philanthropist and Democratic presidential candidate Tom Steyer Thomas (Tom) Fahr SteyerFifth DNC debate to be held Nov. 20 in Georgia Yang becomes eighth Democrat to qualify for November presidential debate Trump impeachment battle hits TV ads MORE was the third top spender, dishing out $86,000 on anti-Trump impeachment ads.\n\nPenzeys Spices is America’s largest independent spice retailer and frequently criticizes the president across its official social media platforms.\n\nThe company's CEO, Bill Penzey, last week released a 1,500-word advertisement attacking Trump over the Ukraine whistleblower complaint while knocking the Republican Party’s defense of the president.\n\nBecause somebody needs to say this: It’s the end of the Republican Party as we know it—And we should all feel fine... Posted by Penzeys Spices on Thursday, October 3, 2019\n\n“This week the curtain was finally pulled back on how deeply un-American the Republican Party has become,\" the ad stated. \"This week made clear the Republican Party’s been hijacked by the one-two combo of unlimited political spending and foreign forces seeking to end the very concept of government of, by and for the people. From just the White House-released summary, the Ukraine scandal is a mandatory open and shut case for the impeachment, but it is also so much more.”\n\nPenzey’s ad accuses the GOP of turning its back on conservative values and embracing “the ‘textbook’ racism of white nationalism.”\n\n“Under Republican control, government grew larger than ever before, women’s and minority rights were cut back, debts skyrocketed as we stopped paying our bills, our military’s leadership was undermined as were our allies and NATO, plus as I can tell you personally as a company that brings you the best the world has to offer, tariffs have gone through the roof. Free trade? Good grief.”\n\nThe CEO explained that he publicly criticizes the president because his job entails him traveling \"all those less-beaten paths of the world that the spice trade lives along.\"\n\n\"I’ve found in every new shared experience, in every interaction, there is the chance for change,\" he wrote.\n\nThe lengthy post ended with a request for conservatives to “get off the sidelines and get back in the game.”\n\n“And if the opportunity arises, hug a whistleblower. They are keeping all that is good about America alive,” Penzey’s post concludes.\n\nThe CEO has frequently targeted Trump online, spending more than $2.1 million between May 2018 and August 2019, according to data from the Facebook Ad Library.\n\nIn July 2017 — roughly two years after Trump launched his White House bid — Penzey announced that the company would give out free bottles of Mexican Vanilla Extract.\n\n“Today, on this anniversary, it seems a good day to apologize to the people of Mexico and Latin America,” he wrote at the time. “That form of intentional racism designed to stoke fear and anger among voters should have raised huge red flags as to why this was not a candidate fit for the highest office in the land. For reasons we have yet to get to the bottom of, those red flags were never raised, and for that we are sorry.”", "description": "A Wisconsin-based spice company has been the second-largest buyer of impeachment ads on Facebook in recent days, second only to President Trump himself, according to a new analysis released Tuesday.", "authors": [], "top_image": "https://thehill.com/sites/default/files/penzeysspices_facebookads.jpg", "published_at": "2019-10-09"}