{"pub": "financialpost", "url": "https://business.financialpost.com/executive/posthaste-canada-slips-again-in-latest-ranking-of-worlds-most-competitive-economies-and-why-bruce-linton-sees-disintegration-in-cannabis-sector?utm_source=rss&utm_medium=feed&utm_campaign=truncated_content&utm_content=executive&utm_term=yadullah_hussain", "downloaded_at": "2019-10-09 12:47:58.102883+00:00", "title": "Posthaste: Canada slips — again — in latest ranking of world's most competitive economies", "language": "en", "text": "Good Morning!\n\nCanada is losing its competitive edge, according to the World Economic Forum’s latest Global Competitiveness Index published this morning. The country slipped two places from last year’s survey to end as the world’s 14th most competitive economy, eclipsed by fellow developed nations United States, Germany, United Kingdom, Sweden and Japan — among others. Canada had slipped two places in last year’s survey, too.\n\n“Canada’s economy has been hit by external shocks stemming from global trade tensions. The less favourable economic environment has been reflected in somewhat more negative business leaders’ views across several dimensions,” the WEF said. “For instance, Canadian business leaders have revised down their assessment on two important aspects of competition: competition in services (where it ranks 62nd, losing 2.5 points in score and falling 18 places in rank), and the labour market (it ranks 54th on internal labour mobility, falling 25 places over 2018 and losing almost 4 points in score).”\n\nThe WEF recommends improving ICT adoption, innovation capabilities if Canada is to emerge as a technological powerhouse.\n\n“Further improvements in mobile broadband infrastructure and usage (67th), greater investments in R&D (23rd) and collaboration between companies, universities and research centres (15th) would benefit Canada’s competitiveness going forward,” WEF said.\n\nIn one key criteria — technology governance — Canada was ranked 27th in the world out of 141 countries, worse than Saudi Arabia (ranked 11th), China (24th) and India (25th). Canada also fared poorly in environment-related treaties in force (ranked 95th) and complexity of tariffs (ranked 97th). The country leads in macroeconomic stability (it shared the top spot with other countries) and corporate governance (4th).\n\nThe U.S. lost its coveted spot as the world’s most competitive economy to Singapore.\n\nIf you have a moment, you really must give a listen to this week’s Down to Business Podcast where Bruce Linton, the mercurial former CEO of Canopy Growth Corp. expounds on what Cannabis 2.0 and even 3.0 would look like.\n\nHere’s what’s you need to know this morning:\n\nStatistics Canada to release crowd-sourced cannabis prices for the third quarter at 8:30 a.m. ET\n\nCanadian Wind Energy Association 35th annual CanWEA conference and exhibition in Calgary\n\nService Alberta Minister Nate Glubish to outline proposed amendments to the Real Estate Act\n\nStand.earth releases a report assessing the climate plans of the major federal political parties\n\nThe U.S. Federal Reserve releases minutes from its September 17-18 policy meeting, which are expected to show the depth of division among policymakers about the path ahead for interest rates\n\nFederal Reserve Chair Jerome Powell and Federal Reserve Bank of Kansas City President Esther George co-host “Fed Listens” roundtable in Kansas\n\n\n\nBuilding permits rose 6.1 per cent in August to $9 billion, compared with a one per cent increase estimated by analysts, largely because of increases in multi-family and industrial permits, Statistics Canada reported. Quebec led the gains with more than a third of the value, while six other provinces reported increases, the agency said.\n\n“On the residential side, the number of units came in at 247,000 annualized in the month, flagging continued strength in housing starts down the road,” wrote Robert Kavcic, senior economist, at BMO Capital Markets.\n\n“Indeed, the year-to-date average for permits is a lofty 237k, so it looks like there’s plenty in the pipeline to keep residential construction activity humming.”\n\n\n\n— Send your news, comments and stories to yhussain@postmedia.com. — Yadullah Hussain @YAD_Fpenergy\n\nWith files from The Canadian Press, Thomson Reuters and Bloomberg", "description": "Stuff you need to know", "authors": [], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/canada-economy_gdp.jpg", "published_at": "2019-10-09"}