{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/12/whats-the-frequency-steelers-d-working-on-communic", "downloaded_at": "2019-09-12 23:37:17.712331+00:00", "title": "What's the frequency? Steelers D working on communication", "language": "en", "text": "PITTSBURGH (AP) - Tom Brady’s good enough on his own, he doesn’t need the help.\n\nThe Pittsburgh Steelers seemed insistent on providing some anyway while letting Brady and the rest of the New England Patriots zip up and down the field in a 30-point Week 1 blowout in which the Steelers always seemed a step - or two, or three or sometimes way more than three - behind.\n\nBlown coverages. Poor tackling. Giving up touchdowns instead of field goals. The list of mistakes was long. And familiar.\n\n“Us coaches didn’t go a good enough job of getting these guys ready to get the right communication on the field and that was causing the busted assignments,” defensive coordinator Keith Butler said Thursday. “And they scored on those busted assignments. Three times they got us.”\n\nJosh Gordon scored on a crossing route in the first quarter when nobody bothered to cover him at the line of scrimmage, allowing him to turn a short flip from Brady into a 20-yard score.\n\nBrady looked off strong safety Terrell Edmunds in the second quarter and when nickel back Mike Hilton couldn’t effectively jam Phillip Dorsett at the snap, the Patriots wide receiver had all the room he needed to haul in a 25-yard touchdown .\n\nDorsett later coasted into the end zone from 58 yards in the third quarter when Hilton passed off Dorsett to rookie free safety Kam Kelly. Kelly was caught looking at Brady while Dorsett ran past. By the time Kelly turned around to give chase, it was far too late.\n\nA repeat performance on Sunday against Seattle (1-0) would leave Pittsburgh in danger of just its second 0-2 start in Mike Tomlin’s 13 seasons. While the Seahawks and quarterback Russell Wilson prefer to attack defenses with a physical running game then go over the top with play action, the Steelers know they looked vulnerable to the barrage of crossing routes and misdirection the Patriots threw at them.\n\n“It’s a copycat league,” Hilton said. “If one team has success at something, you expect another team to come back to it. We’ve got to find ways to stop it and slow them down.”\n\nHaving all 11 players know their responsibilities on every snap would help. Communication is always at a premium, particularly early in the season. Yet it’s also become an issue in Pittsburgh, which has undergone a significant youth movement in recent seasons.\n\nThe Steelers have started at least one rookie on defense in each of the past three openers, with Kelly and inside linebacker Devin Bush both playing significant snaps on Sunday. Cornerback Steve Nelson and linebacker Mark Barron were also making their first starts with the team after signing free-agent contracts.\n\nBush acquitted himself pretty well - finishing with 11 tackles - while Kelly occasionally looked overwhelmed while filling in for Sean Davis. Davis should return for Seattle after missing the opener with an ankle injury. If veteran cornerback Joe Haden’s sprained shoulder is good enough for him to play, Butler could have his entire starting defense together for the first time since the start of training camp.\n\nThe injuries forced Butler to speed up the learning curve for some. So it can lead to nights similar to last Sunday, when cohesion was lacking and confusion occasionally reigned.\n\nOutside linebacker T.J. Watt had the green dot on his helmet, allowing him to hear the calls from Butler and relay them to his teammates. It’s the first time Watt wore the dot in the regular season, and while he said he was fine with the process, the results were mixed.\n\n“We know we can play fast and at elite level,” Watt said. “And it’s just a matter of all being on the same page and all knowing what everyone’s got to do.”\n\nAsked if he made things a bit too complicated, Butler allowed it’s a possibility.\n\n“We’re not so smug to think that we can be too smart as coaches sometimes,” Butler said. “We looked at that. We looked at every angle that we can and tried to gauge what our guys can handle. And sometimes we’re right and sometimes we’re wrong. We’ve got to be able to communicate and do the things that we ask them to do.”\n\nThen again, there are the plays where everybody’s in the right spot but for some reason - nerves, adrenaline, inexperience - mistakes happen. Those things teams have to endure as part of their growth.\n\n“Everything draws up on the board real good,” Butler said. “But what happens on the field maybe sometimes is a little bit different.”\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Tom Brady's good enough on his own, he doesn't need the help.", "authors": ["The Washington Times Http", "Will Graves"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/12/steelers_patriots_football_50988_c0-237-3923-2524_s1770x1032.jpg?c9712edbcc46e8f1db2aec3f19c9f89f318f967a", "published_at": "2019-09-12"}