{"pub": "fox", "url": "https://foxnews.com/sports/brooks-koepka-lebron-james-pga-awards", "downloaded_at": "2019-10-03 23:32:05.160295+00:00", "published_at": "2019-10-03", "title": "Brooks Koepka compares himself to LeBron James as he shrugs off Player of the Year vote", "language": "en", "text": "Brooks Koepka on Wednesday shrugged off questions about Rory McIlroy winning the PGA Tour Player of the Year award despite Koepka winning the PGA Championship during the 2019 season.\n\nKoepka, instead, likened himself to NBA superstar LeBron James and said he didn’t care too much about being the player of the year, according to the Golf Channel.\n\nMCILROY TOPS KOEPKA FOR PGA TOUR PLAYER OF THE YEAR\n\n“I don’t play for awards. I just play to win,” Koepka said at a press conference prior to the start of the Shriners Hospital for Children Open. “Win trophies. Win tournaments. Simple as [that]. Yeah, it would have been great but I think everyone in this room knows … I mean, LeBron has only won four MVPs and I’m pretty sure he’s been the best player for more than four years, so.”\n\nMcIlroy was named the PGA Tour Player of the Year last month in a close vote over Koepka. It was the third time he has won and the first time he won without winning a major.\n\n“Brooks had an incredible year — an incredible two, three years, whatever it is,” McIlroy said at the time. “He's the No. 1 player in the world golf ranking. ... I think this speaks volumes of what PGA Tour players feel is important. I think players don't just feel that four weeks a year is important. It's more than that. We play a lot more. Why do we play 25 times a year if only four weeks are important?\"\n\nKOREAN TOUR STAR RECEIVES 3-YEAR BAN AFTER OBSCENE GESTURE TOWARD FAN DURING TOURNAMENT\n\nHe added: “I think that's a huge vote of confidence from the players that we play for more than maybe what the narrative suggests.”\n\nSeparately, Koepka revealed he underwent stem-cell treatment to repair a partially torn patella tendon in his left knee. He said the operation took place the Monday after the Tour Championship.\n\nKoepka, who’s made it known that he doesn’t practice, said he couldn’t practice because he actually couldn’t practice, according to Golf Channel.\n\n“I can finally practice again, which is nice, without pain,” he said. “Last year, I didn't practice at all. I mean, I vocalized that, said I hadn't practiced. … I finally feel good enough where I can actually practice and feel prepared coming into golf tournaments – not trying to find it on Tuesday or Wednesday.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\n“I'll be practicing this year.”", "description": "Brooks Koepka on Wednesday shrugged off questions about Rory McIlroy winning the PGA Tour Player of the Year award despite winning the PGA Championship during the 2019 season.", "authors": ["Ryan Gaydos", "Ryan Gaydos Is A Sports Reporter For Foxnews.Com", "Foxbusiness.Com. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/GOLF-Brooks-Koepka9.jpg"}