{"pub": "vice", "url": "https://vice.com/en_us/article/wjwbax/this-christian-rock-record-is-hiding-a-secret-commodore-64-program", "downloaded_at": "2019-10-21 14:54:55.249891+00:00", "title": "This Christian Rock Record Is Hiding a Secret Commodore 64 Program", "language": "en", "text": "It’s not exactly unheard of to hide stuff in the inner “run-out groove” of a vinyl record—a spot in which handwritten messages have appeared for decades, ever since a recording engineer named George Peckham started adding offbeat notes in the dead area of the wax. (It’s a great example of the Easter eggs that albums have long featured.)\n\nBut more rare might be the existence of a Commodore 64 program. Over the weekend, Canadian YouTuber Robin Harbron, a collector who runs the channel 8-Bit Show and Tell, highlighted Electric Eye, a record from the 1980s Christian rock band Prodigal, with such a program hidden past the run-out groove.\n\nJust nine lines long, the BASIC program contains quotes from Albert Einstein and the Bible, with a gray background and red border. What it loses for lack of complexity, it gains for its unusual delivery mechanism.\n\nIn an email, Harbron noted he had heard about it online, where information had surfaced on Reddit and in an interview from late Prodigal keyboardist Loyd Boldman, but no actual program.\n\n“I couldn’t find video or even a screenshot of the hidden program, and nobody seemed to have archived the program so that an emulator or real C64 could load it,” he said.\n\nSo he ended up buying a copy from Discogs himself, complete with an etched “C–64” on the other side of the wax, and recovered the program.\n\nIn the clip, Harbron is shown having to modify his cheap record player to allow it to play into the dead area of the wax so that he can record a digital version of the file. He copied a digital version of the file to a cassette tape, then played the tape into his C64. The process, which he said “took quite a bit of fiddly work over a couple days,” was condensed down to a 17 minute video.\n\nThis approach of burying a digital Easter egg on an album was not entirely unheard of back in the 1980s, particularly in the UK, where numerous bands of the era, such as Pete Shelley of the Buzzcocks and the Thompson Twins, would put data onto the end of cassette tapes or seven-inch records that could be read on the most popular system in that country during the era, the Sinclair ZX Spectrum. (Decades later, Radiohead did the same thing for its OKNOTOK reissue of OK Computer.)\n\nC64 programs were rarely shared this way in the U.S., however, because floppy disks won out as the preferred format of choice in North America.\n\nSo Prodigal, considered trailblazers among Christian rock acts in the 1980s, might have innovated in a whole different way entirely: By creating a truly one-of-a-kind piece of software.", "description": "The nine-line BASIC program was hidden in the run-out groove of a Prodigal record for 35 years until a YouTuber uncovered it over the weekend.", "authors": [], "top_image": "https://video-images.vice.com/articles/5dad9d22d78dc8000a3d9662/lede/1571659198860-fgf.png?crop=0.9965153720612235xw:1xh;center,center&resize=1200:*", "published_at": "2019-10-21"}