{"pub": "fox", "url": "https://foxnews.com/politics/gop-lawmakers-in-blasting-secret-impeachment-probe-before-attempting-to-storm-the-proceedings", "downloaded_at": "2019-10-23 23:36:38.858430+00:00", "title": "GOP lawmakers storm closed-door impeachment session, as Schiff walks out", "language": "en", "text": "House Republicans led by Rep. Matt Gaetz, R-Fla., on Wednesday essentially stormed a closed-door session connected to the impeachment investigation of President Trump, prompting House Intelligence Committee Chairman Adam Schiff to suspend the proceedings in a remarkable scene.\n\nThe standoff happened Wednesday morning after lawmakers held a press conference in which they accused House Democrats of lack of transparency.\n\nTRUMP ALLIES PUSH BACK ON 'QUID PRO QUO,' SAY ENVOY TESTIFIED UKRAINE INITIALLY UNAWARE OF AID HOLDUP\n\n“We’re going to try and go in there, and we’re going to try to figure out what’s going on, on behalf of the millions of Americans that we represent that want to see this Congress working for them and not obsess with attacking a president who we believe has not done anything to deserve impeachment,” Gaetz said.\n\nThe Republicans specifically called out Schiff, D-Calif., who is leading the investigation.\n\n“What is Adam Schiff trying to hide?” asked House Minority Whip Steve Scalise, R-La. “I think that’s the question so many people have, so many of my colleagues have, so many people in the press should have.”\n\n“Voting members of Congress are being denied access from being able to see what’s happening behind these closed doors where they’re trying to impeach the president of the United States with a one-sided set of rules,” Scalise continued. “They call the witnesses. They don’t let anybody else call the witnesses.”\n\n“We’re gonna go and see if we can get inside,” Gaetz said at the conclusion of the press conference.\n\nFrom there, about 30 House Republicans flooded the room where Laura Cooper, who oversees Ukraine policy at the Department of Defense, was set to testify.\n\nBecause there was no agreement for non-committee members to be present, this \"sit-in\" created an immediate standoff. Fox News is told that Schiff did not ask the U.S. Capitol Police to arrest or remove Republicans who charged in — but he did leave the room and apparently does not plan to start the interview until the situation is resolved.\n\nFox News is told about a dozen Republicans were still in the secure facility known as a SCIF as of early afternoon. In another complication, some non-committee members brought in phones and other electronic devices in possible violation of House rules.\n\nThe Republicans showed no sign of leaving any time soon, with 17 pizzas arriving in the afternoon. Rep. Doug Lamborn, R-Colo., also showed up with what he described as \"relief supplies\" for the GOP members: two large bags from Chick-fil-A.\n\nGOP lawmakers flooded Twitter with posts from the scene.\n\n\"Adam Schiff just SHUT DOWN his secret underground impeachment hearing after I led a group of Republicans into the room. Now he's threatening me with an Ethics complaint! I'm on the Armed Services Cmte but being blocked from the Dept. Asst. SecDef's testimony. This is a SHAM!\" Rep. Bradley Byrne, R-Ala., tweeted.\n\nDemocrats slammed them in response. Rep. Ilhan Omar, D-Minn., tweeted: \"This is what happens when people elect members more interested in media hits than the protection of our national security.\"\n\nRep. Roger Marshall, R-Kan., told reporters that Schiff left the room without letting Marshall or other non-committee Republicans hear testimony.\n\nDIPLOMAT BILL TAYLOR TESTIFIES TRUMP USED UKRAINE AID, WHITE HOUSE MEETING AS LEVERAGE FOR PROBES\n\n“He doesn’t have the guts to come talk to us,” Marshall said. “He left. He just got up and left. He doesn’t have the guts to tell us why we can’t come in the room, why he doesn’t want this to be transparent. It’s the biggest facade, the biggest farce I’ve ever seen in my life.”\n\nGaetz, a member of the House Judiciary Committee, was kicked out of another session earlier this month where former deputy assistant to the president Fiona Hill faced questions behind closed doors. Gaetz was told he could not attend because he is not part of the House Intelligence Committee, which is conducting the investigation along with the House Oversight and Foreign Affairs Committees.\n\n\"Judiciary Chairman [Jerry Nadler] claimed to have begun the impeachment inquiry weeks ago,” Gaetz tweeted at the time. “Now, his own Judiciary members aren’t even allowed to participate in it. And yes - my constituents want me actively involved in stopping the #KangarooCourtCoup run by Shifty Schiff.\"\n\nRepublicans are not the only ones criticizing the investigation for its lack of transparency. Democratic presidential candidate Rep. Tulsi Gabbard, D-Hawaii, said Tuesday she was “disappointed with the lack of transparency,” and warned that it could “undermine the integrity” of the investigation.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nDemocrats began calling witnesses for questioning behind closed doors after an anonymous whistleblower filed a complaint over a July 25 phone call between Trump and Ukrainian President Volodymyr Zelensky. Trump is accused of using military aid to Ukraine as leverage to pressure Zelensky into assisting investigations of alleged Democratic collusion with Ukraine in the 2016 election, as well as former vice president Joe Biden and his son Hunter’s business dealings with Ukrainian energy company Burisma Holdings.\n\nBoth Trump and Zelensky have stated that no pressure took place, though acting U.S. Ambassador to Ukraine Bill Taylor testified Tuesday that the aid to Ukraine “was conditioned on the investigations.”\n\nFox News’ Griff Jenkins, Guerin Hays and Brooke Singman contributed to this report.", "description": "House Republicans led by Rep. Matt Gaetz, R-Fla., on Wednesday essentially stormed a closed-door session connected to the impeachment investigation of President Trump, prompting House Intelligence Committee Chairman Adam Schiff to suspend the proceedings in a remarkable scene.", "authors": ["Ronn Blitzer"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/republicans-1-AP.jpg", "published_at": "2019-10-23"}