{"pub": "businessinsider", "url": "https://pedestrian.tv/news/peter-dutton-anchor-babies-wrap", "downloaded_at": "2019-09-13 01:07:22.559560+00:00", "title": "How We Got To Testicle Head Peter Dutton Accusing Asylum Seekers Of “Anchor Babies”", "language": "en", "text": "It’s been a banner week for Home Affairs Minister Peter Dutton, who yesterday accused the young Tamil family he’s attempting to deport of having “anchor babies” to ensure their settlement in Australia.\n\nTo ask how we got here – to a place where an Australian MP can pinch rhetoric espoused by US President Donald Trump and use it with casual cruelty – is to ask about the past decade of the nation’s traumatic asylum seeker policies.\n\nInstead, here’s a quick recap of Dutton’s recent positions, and the moments which led to his recent expulsion of bile. Strap in.\n\nI’ve heard a bit about Priya, Nades, and their two kids. What’s the go?\n\nIn short, Priya and Nades fled Sri Lanka in 2012 and 2013, fearing repercussions due to family links to fighters in the nation’s brutal civil war. They arrived in Australia by boat, claiming to be asylum seekers in need of our nation’s protection. They were granted temporary bridging visas in 2014 as their claims were assessed, met each other in Australia, and got married.\n\nThey made a home in the rural Queensland town of Biloela and had two daughters, Kopika, 4, and Tharunicaa, 2. They became beloved members of the community.\n\nWhat went wrong?\n\nWell, successive Australian governments have pledged that anyone who arrives in Australia illegally will not be permanently settled here. When the family’s claims of asylum were rejected in 2018, they were moved to a detention centre in Melbourne.\n\nLate last month, Border Force authorities tried deporting the family. They were shuttled from the detention centre and bundled onto a plane bound for Sri Lanka, which was forced to land in Darwin thanks to a last-minute injunction secured by the family’s legal team.\n\nREAD MORE QLD Asylum Seeker Family Has Deportation Blocked By Emergency Injunction\n\nTheir lawyers continue to challenge the deportation, which has been stalled until a Supreme Court hearing in Melbourne on Wednesday can assess the case. Supporters hope the court will find Australian officials did not adequately assess the family’s case, effectively granting them settlement in Australia – and hopefully a return to Biloela.\n\nSo what’s Peter Dutton got to do with all of this?\n\nAs Minister for Home Affairs, Dutton has purview over this whole issue. He could even use his ministerial discretion to permit the family to stay, even if it does go against the government’s stated position.\n\nOh, that’s a simple solution. Will he give them a begrudging thumbs up?\n\nNo.\n\nWhy not?\n\nWell, let’s turn to this week’s comments. Cop this, from the floor of the House of Representatives on Tuesday:\n\nAt the last election, when the Australian public looked at this government, they saw something which they believed was an essential ingredient in leadership demonstrated by the Prime Minister—that is, that we will bring people into this country the right way, but we will not allow people to hop on boats and come to our country… We won’t allow them to come by boat, and we will not allow a situation, again, where this country loses control of its borders.\n\nAnd on Wednesday:\n\nWe cannot allow people smugglers to get in control of our borders again, like they did when the Labor Party was in government. Why is that relevant? Because 1,200 people drowned at sea, thousands of children were put into detention, and the reality is that Labor would repeat all of those mistakes again if they were to be elected into this parliament.\n\nIn short, Dutton believes permitting a single family to reside in Australia, in contravention of the government’s stated policy, would see thousands of others die at sea attempting the same perilous trek.\n\nWhat’s that got to do with ‘anchor babies’?\n\nWell, sweet fuck all, but Dutton used Thursday’s appearance on 2GB to allege Priya and Nades had children as emotional blackmail to bolster their case for settlement:\n\nIt’s been very clear to them at every turn that they were not going to stay in Australia, and they still had children. We see that overseas in other countries, anchor babies, so-called: the emotion of trying to leverage a migration outcome based on the children.\n\nDutton just adopted a term used by Americans on the far-right side of politics to derisively describe the children of immigrants. You can read more about Trump’s take on it here.\n\nI mean, if you’re born in Australia, you’re an Australian citizen, so I can kinda see his cruel and thuggish logic?\n\nYeah, cool, except Australia does not confer automatic citizenship on babies born here to foreign parents. That practice was abolished in 1986, and anyone born here to foreign parents after that must prove at least one of their parents was a permanent resident or a citizen if they want to attain citizenship.\n\nThat’s not the case with either Priya and Nades.\n\nPhwoar.\n\nCorrect.\n\nDutton seems to think this case will drag on for a while, given the support for the family in this nightmarish mess. Until it’s resolved, one way or another, console yourself with the fact Dutton appeared in a strange rap video-esque ad for a Queensland car dealership and you didn’t.", "description": "It's been a banner week for the Home Affairs MP and his quest against a Tamil family.", "authors": ["David Adams"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/03/GettyImages-1130391761.jpg", "published_at": "2019-09-13"}