{"pub": "metro", "url": "https://metro.co.uk/2019/10/14/jeremy-renner-put-gun-mouth-threatened-kill-according-ex-wife-amid-bitter-custody-battle-10916433", "downloaded_at": "2019-10-14 23:25:25.440166+00:00", "title": "Jeremy Renner ‘put gun in his mouth and threatened to kill himself’", "language": "en", "text": "Jeremy Renner and Sonni Pacheco are locked in a bitter dispute\n\nJeremy Renner has been accused of ‘putting a gun in his mouth and threatening to kill himself’ during a dispute, according to his ex-wife Sonni Pacheco.\n\nThe two are currently locked in a bitter custody battle over their six-year-old daughter, Ava, with Canadian actress Sonni recently filing legal documents pertaining to a dispute with Jeremy.\n\nIt’s been alleged the actor had taken drugs and was drunk when he ‘rhapsodised’ about killing Sonni, as per legal documents obtained by TMZ.\n\nSonni had asked a judge to change the custody order from joint to sole, with supervised visits for Avengers star Jeremy.\n\nIn documents, it was claimed in November Jeremy was at a club and ‘began talking about killing his wife, telling someone he “could not deal with her anymore, and he just wanted her gone”.’\n\nJeremy’s former wife has made some serious allegations against him (Picture: Getty Images)\n\nIt was also alleged their child’s nanny overheard Jeremy say he was going to kill Sonni and then himself, claiming he said ‘it was better that Ava had no parents than to have [Sonni] as a mother’.\n\nAdvertisement\n\nAdvertisement\n\nAccording to the reports, ‘Jeremy put a gun in his mouth, threatened to kill himself, and fired the gun into the ceiling while Ava was asleep in her bedroom’.\n\nThe Hawkeye star’s ex-wife also claimed Jeremy had a history of substance abuse as well as verbal and emotional abuse, also alleging the star left cocaine on a bathroom counter which was able to be reached by Ava.\n\nReps for the star responded to the claims, in a statement to Metro.co.uk: ‘The well-being of his daughter Ava has always been and continues to be the primary focus for Jeremy.\n\n‘This is a matter for the court to decide. It’s important to note the dramatizations made in Sonni’s declaration are a one-sided account made with a specific goal in mind.’\n\nThe pair – who split in 2014, just months after tying the knot – share the six-year-old together, but have been disputing who will be her primary carer.\n\nSonni had filed for sole custody last month, and requested the Avengers actor is given monitored visits with the youngster.\n\nAccording to a previous report from TMZ, 48-year-old Jeremy reportedly turned the tables, and is also asking for sole physical and legal custody.\n\nThey are both expected in court on 7 November.\n\nJeremy and Sonni welcomed Ava together in 2013, and got married in a secret ceremony at the beginning of 2014.\n\nThe former couple previously shared parental duties, penning an agreement on child support just last year. Jeremy was originally paying Sonni $13,000 (£10,400) a month, but this will increase if his yearly income exceeds $2.3million (£1.8million).\n\nAdvertisement\n\nAdvertisement\n\nUS Weekly states the payments will not surpass $200,000 (£161,000) for the year – with this money going into an account for their daughter.\n\nSpeaking about fatherhood in a candid interview, he previously told Playboy: ‘When it’s daddy and Ava time, that’s all I do.\n\n‘You’re talking to a guy who’s really happy in his f**king flip-flops right now with his little daughter in her pyjamas running around in the house, waiting for me.’\n\nMetro.co.uk contacted Jeremy’s reps for comment.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Avengers star Jeremy Renner shuts down his troll-flooded app as it becomes ‘everything I detest’\n\nMORE: Avengers’ Jeremy Renner furious as he demands Sony return Spider-Man to Marvel and Stan Lee", "description": "Jeremy Renner ‘put gun in his mouth and threatened to kill himself’ according to ex-wife amid bitter custody battle.", "authors": ["Mel Evans"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_84235931_1571071786.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-14"}