{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/video-game-preservationist-finds-rare-prototype-n64-controller-and-the-joystick-that-shouldve-been", "downloaded_at": "2019-09-26 01:35:31.765291+00:00", "title": "Video Game Preservationist Finds Rare Prototype N64 Controller And The Joystick That Should Have Been", "language": "en", "text": "Before the public even gets a glimpse at a new console, it’s made available to developers in prototype form so they can have new games ready for its launch. Thanks to strict NDAs and contracts those prototypes are rarely revealed, but Shane Battye, a retro gaming preservationist, managed to get his hands on an early N64 controller prototype, revealing what could have been.\n\nBefore it was officially called the N64, Nintendo’s first foray into 3D gaming was known as the Ultra 64, and not just secretly within the company and the development community. Nintendo released details about the upcoming console well ahead of its release (the first time I read about it was in the February 1996 issue of Next Generation magazine) and it even released a publicity photo showing its near final design.\n\nHowever, while the prototype Ultra 64 console (Nintendo eventually had to change the name for legal reasons) looks a lot like the final N64 did, there were some distinct differences between the prototype controller, and what gamers eventually played hundreds of hours of GoldenEye with.\n\nNot only did Battye manage to get his hands on one of the elusive Ultra 64 prototype controllers, but he also went to the trouble of tearing it apart to see how it differs from the final production version. Nintendo didn’t make considerable changes for the official release, and that includes the electronics on the inside, but it did make the Z-trigger button on the underside much bigger, and it completely changed the look and feel of the analogue joystick.\n\nAs video game controllers go, the N64's gamepad still stands out with its bizarre three-prong design, but it was also the first home console to introduce analogue controls with a thumbstick that always felt like you were close to snapping it off, especially during heated multiplayer battles.\n\nThe joystick featured on the Ultra 64's prototype controllers looks far more substantial, sturdy, and according to Battye, feels “...much nicer under the thumb at rest...” It was also free to travel in a perfect circle, whereas with the final N64 design, the controller’s thumbstick moved around inside an octagonal hole, presumably to help gamers make the transition from four-way directional pads to analogue sticks.\n\nDoes the prototype controller’s design feel any better while playing? That’s what Battye plans to test. Unfortunately, since it’s an early prototype it doesn’t use the same connector as the final N64 controllers did. It was instead designed with a temporary RJ-11 jack on the end of its cord — the connector was more commonly used for plugging telephones into a wall outlet.\n\nOnce Battye gets an Ultra 64 development console running, which were based on a high-end Silicon Graphics SGI Indy workstation, he’ll be able to determine if Nintendo’s decision to change the joystick was for the better or not.", "description": "Before the public even gets a glimpse at a new console, it’s made available to developers in prototype form so they can have new games ready for its launch. Thanks to strict NDAs and contracts those prototypes are rarely revealed, but Shane Battye, a retro gaming preservationist, managed to get his hands on an early...", "authors": ["Jason Schreier", "Luke Plunkett"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/zufkejwbljwpehc87zju.jpg", "published_at": "2019-09-26"}