{"pub": "yahoo", "url": "https://news.yahoo.com/ex-foxconn-chief-gou-rules-taiwan-presidential-bid-163500869.html", "downloaded_at": "2019-09-17 10:38:54.149235+00:00", "title": "Ex-Foxconn chief Gou rules out Taiwan presidential bid", "language": "en", "text": "Terry Gou, the founder of Taiwan's Foxconn seen here in June 2019, has decided against an independent run for the island's presidency (AFP Photo/Sam YEH)\n\nTaiwan's richest man Terry Gou ruled out running as an independent candidate in the upcoming presidential election late Monday, ending months of speculation that he might throw his hat into the ring.\n\nThe island will vote for a new president and parliament in January elections set to be dominated by relations with China.\n\nPolitical life in Taiwan has long been dominated by two political parties.\n\nRumours that Gou -- who made his billions as the head of the world's largest electronics manufacturer Foxconn -- might join the race caused a major stir.\n\nEarlier this year, he announced the Goddess Matsu had told him to run and he stood in the primaries for the opposition Kuomintang (KMT) party.\n\nBut he lost to Han Kuo-yu, a populist outsider who boasts a loyal base but has struggled to gain widespread appeal since winning his party's ticket.\n\nWith Han flailing, signs pointed towards Gou running as an independent.\n\nLast Thursday, he quit the KMT, a party he had spent 49 years with, and rounded on his old allies, calling them \"corrupt\" and a \"platform for personal gain and power\".\n\nThe departure sent speculation soaring that Gou would make a bid.\n\nBut late Monday, on the eve of the deadline for candidates to register, he issued a statement saying he would not run.\n\n\"This decision was not because of anyone's persuasion or influence but because after thinking it over, I felt we all need to return to rationality and policy discussions when choosing our next leader,\" Gou said.\n\nHis departure now means Han will face off against President Tsai Ing-wen of the Democratic Progressive Party, who is seeking a second term.\n\nRelations between Communist-ruled Beijing and Taipei have plummeted since Tsai came to power in 2016 because her DPP party refuses to recognise the idea that Taiwan is part of \"one China\".\n\nBeijing has since cut official communications with Taipei, increased military exercises, poached diplomatic allies and ratcheted up economic pressure on the island.\n\nThe KMT tends to advocate warmer ties with China while the DPP remains deeply sceptical of its huge neighbour.", "description": "Taiwan's richest man Terry Gou ruled out running as an independent candidate in the upcoming presidential election late Monday, ending months of speculation that he might throw his hat into the ring.  The island will vote for a new president and parliament in January elections set to be dominated", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/ecG92A03r9KoQpJWHxnwGw--~B/aD01MTA7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/5438002f0cc85c0ae6daa943d4e4244f135555d4.jpg", "published_at": "2019-09-16"}