{"pub": "huffpost", "url": "https://huffpost.com/entry/grocery-stores-gun-debate-women-shoppers_n_5d7bfcdfe4b03b5fc883616e", "downloaded_at": "2019-09-15 00:00:42.566926+00:00", "title": "How Grocery Stores Became A Cultural Flashpoint In The Gun Debate", "language": "en", "text": "A few years ago, Michele Mueller arrived at a Kroger supermarket in downtown Cincinnati, 330,000 signatures in hand, asking the store to stop allowing customers to openly carry guns as they shopped.\n\nMueller, a volunteer for Moms Demand Action, a gun violence prevention organization, wanted to deliver the petitions to the manager. But she was stopped by someone from corporate, she said. He wouldn’t let her into the store, but he did accept her petitions.\n\n“I said to him, ‘I’m having a hard time understanding that you will not allow us to deliver a stack of paper through that front door, but you would allow an AR-15 slung over someone’s shoulder,’” Mueller recalled. “He didn’t say anything. And I knew that we had an awful lot of work left to do.”\n\nFive years later, her efforts have finally paid off.\n\nLast week, Kroger, the country’s largest supermarket chain, announced that it would ask customers to stop openly carrying guns in its stores. Its announcement came on the heels of a similar decision by Walmart after a deadly mass shooting at one of its stores in El Paso on Aug. 3.\n\nThe two major store chains opened a floodgate, and in the days since, Walgreens, CVS, Wegmans, Aldi, Meijer and Publix and others have said they will ask customers not to openly carry guns. The change signals a seismic shift in corporate willingness to engage in the gun debate.\n\nWhile this pivot comes after a spate of mass shootings, the foundation was laid by activists across the country like Mueller, who’ve spent years applying pressure to stores. Behind the scenes, an army of women has been boycotting shops and signing petitions. The message was loud and clear: They want safety while shopping with their families.\n\nMoms Demand Action Michele Mueller, center, and other volunteers for Moms Demand Action took a giant stack of petitions to a Kroger in Cincinnati in 2014 to ask the grocery chain to stop allowing open carry.\n\n“Five years ago, none of these companies were willing to move on this issue,” said Shannon Watts, founder of Moms Demand Action. “It has been the unglamorous heavy lifting of women who have said to them that they won’t shop at their stores until they change their policy.”\n\nWhen Watts created Moms Demand Action in 2012, she said she realized quickly that shopping was an area where women could be effective at creating change.\n\n“Women are only 20% of lawmakers and 5% of Fortune 1000 CEOs,” she said. “But we make a lot of the spending decisions for families, so that’s a really important lever of power that we have at our disposal.”\n\nAccording to research by Michael Silverstein, a senior adviser at the Boston Consulting Group and author of “Women Want More: How to Capture Your Share of the World’s Largest, Fastest-Growing Market,” women do nearly 80% of the grocery shopping for their families and make the decisions on purchases in about 72% of consumer spending overall.\n\n“Women have virtual total autonomy in grocery purchasing,” he said. Increasingly, women are doing their shopping online, placing new pressure on retailers to address issues that could cause customers to avoid brick-and-mortar stores.\n\n“Grocery retailers desperately want loyalty, and they want the big weekly shop from the family with young children,” Silverstein said. “Will women switch stores based on their comfort and security? Absolutely. They want a safe, clean environment.”\n\nShopping Alongside Armed Strangers\n\nOne of Moms Demand Action’s first campaigns was to pressure stores to stop allowing customers to openly carry firearms.\n\nWatts said her group zeroed in on open carry because the practice is generally unregulated. The majority of states do not require a background check, permitting or training to openly carry a firearm, she said. Open carry is legal in 45 states, although restrictions vary by state, according to Everytown for Gun Safety.\n\nWhen a person walks into Kroger or Walmart toting a gun, it can be intimidating and scary for other customers, who cannot identify the intentions of an armed stranger simply by looking at them.\n\n“It shouldn’t be up to women who are doing the shopping to decide whether someone is open carrying or about to open fire,” she said. “We teach children to run from men with guns in schools, and yet we’re supposed to teach them to respect strangers with semiautomatic rifles in a grocery store? It doesn’t make any sense.”\n\nThe group’s first target was Starbucks.\n\nIn 2013, Watts learned that the chain was going to prohibit smoking within 25 feet of its doors but would still allow customers to openly carry firearms. Smoking was viewed as a public health issue; guns were not.\n\nVolunteers began using the hashtag #SkipStarbucksSaturday, and a few months later, Starbucks announced that guns were no longer welcome. Target and Chipotle soon followed suit.\n\nIn 2014, Moms Demand Action launched a national campaign against Kroger, creating a petition asking the store to change its gun policy. (It also launched one against Walmart around the same time.)\n\nMueller, the volunteer from Ohio, took an active role in organizing the Kroger campaign. She grew up in Cincinnati, where Kroger is headquartered, and was optimistic that the chain would be receptive to changing its gun policy.\n\nShe’d spent her entire life shopping there, she told HuffPost. As a kid, she recalled trips to Kroger with her mother as veritable social events, as they would invariably run into someone they knew and get to chatting. As a young wife, Mueller went to Kroger to shop for family meals. And decades later, when her doctor ordered her to cut salt out of her diet, it was at Kroger that she discovered her favorite low-sodium spaghetti sauce, which tasted almost as good as her father’s traditional Italian recipe.\n\n“I’m almost 70, and my entire life, it was like, “Let’s go Krogering,” she said, referring to the store’s advertising jingle. “That song never leaves you if you grew up here.”\n\nIn 2014, after Kroger declined to change its policy and would not allow her to hand-deliver the petitions, she stopped shopping there.\n\nLet’s Go Krogering\n\nTwenty-four companies have changed their policies on open carry after campaigns by Moms Demand Action volunteers, Watts said. For the women across the country who’ve been leading the charge, this is a powerful moment.\n\n“That first wave [of wins] that we got felt incredible,” said Norri Leder, a Moms Demand Action volunteer in Texas who worked on the Target campaign in 2014. “And this one feels like the rest of the nation is waking up. It is ludicrous for employees and shoppers to have to determine if someone is a threat to them or not in the current gun violence environment.”\n\nKaci Churchill, who volunteers for the Arkansas chapter of Moms Demand Action, described a terrifying experience at a Walmart less than a week after a gunman opened fire in a Walmart in El Paso, killing 22 people.\n\nJorge Salgado / Reuters Shoppers exit with their hands up after a mass shooting at a Walmart in El Paso, Texas, on Aug. 3. The store chain has since changed its policy on carrying guns in its stores.\n\nSchool was still out for the summer, she said, so she had her three young children with her when she went to pick up her prescription at a Walmart in Missouri, right over the Arkansas state line. While they were in line, she spotted a man with a gun in his hand.\n\n“I felt total panic,” Churchill said. “When someone is walking around with a gun in their hand, it is hard to give them the benefit of the doubt.”\n\nShe grabbed her kids and made a beeline for the exit, leaving without her prescription. Churchill said she was cautiously optimistic about the new policy at stores like Walmart and Kroger.\n\n“I feel a lot of relief,” she said. Still, she worried that customers would continue to openly carry inside Walmart, given the chain’s decision to “respectfully ask” people to stop instead of banning it outright.\n\nWhen Mueller, the Ohio volunteer, learned that Kroger was finally going to change its open carry policy, she looked at her husband and said the words she’d been waiting years to say again: “Let’s go Krogering.”\n\nThey put on their Moms Demand Action shirts and drove to the closest Kroger. As they walked through the aisles, she said, an employee came up to them and said thank you for coming back. Another customer gave them high-fives. She filled her cart with Kroger brand items to support the chain, she said. And then she went and looked for that spaghetti sauce.\n\n“We went to Kroger to acknowledge that we’re grateful and we wanted to come back and we felt safer,” she said. “And I got the sauce.”", "description": "Women, who do the majority of household shopping, are wielding the power of the purse.", "authors": ["Senior Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d7c03633b0000c49fd2a4c7.jpeg?cache=fp1kt3fapb&ops=1778_1000", "published_at": "2019-09-14"}