{"pub": "time", "url": "https://time.com/5701591/house-3-bills-support-protests-hong-kong", "downloaded_at": "2019-10-16 00:26:48.180899+00:00", "title": "House Passes 3 Bills to Support Pro-Democracy Protests in Hong Kong", "language": "en", "text": "WASHINGTON — The House passed three bills Tuesday aimed at showing U.S. support for pro-democracy protesters in Hong Kong.\n\nThe action follows months of protests over the Beijing government’s aggressive attempts to enforce control over the semi-autonomous territory.\n\nOne of the bills condemns China’s intrusions into Hong Kong’s affairs and supports the right of people to protest. Another requires annual reviews by the U.S. secretary of state of Hong Kong’s special economic and trade status, providing a check on Beijing’s influence over the territory. A third bill would ensure that U.S. weapons are not being used against protesters by police.\n\nAll three bills were approved on separate voice votes.\n\nThe Brief Newsletter Sign up to receive the top stories you need to know right now. View Sample Sign Up Now\n\nHouse Speaker Nancy Pelosi called the bills important reminders of U.S. support for human rights in the face of significant commercial interests in China.\n\n“If America does not speak out for human rights in China because of commercial interests, then we lose all moral authority to speak out on behalf of human rights any place in the world,” she said.\n\nPelosi said the bravery of young protesters in Hong Kong stands in contrast to “the cowardly government that refuses to respect the rule of law” and the “one country, two systems” policy that was supposed to ensure a smooth political transition after the former British colony was returned to China in 1997.\n\nUnder U.S. law, Hong Kong receives special treatment in matters of trade, customs, sanctions enforcement, law enforcement cooperation and more. China has benefited from this special status and used it to evade U.S. export controls and sanctions, Pelosi and other lawmakers said.\n\n“Solemn promises made by Beijing are rarely kept and far too many leaders of the free world are far too eager to blindly accept fiction over fact,” said Rep. Christopher Smith, R-N.J., a lead sponsor of one of the Hong Kong bills.\n\nUnder President Xi Jinping, human rights abuses in China have significantly worsened, including the pervasive use of torture, religious persecution and human trafficking, Smith said.\n\nChina “excels in crushing bodies, shattering bones, torturing dissidents and filling concentration camps — massive crimes against humanity for which there has been little or no accountability or sanction,” Smith said. “Today we’re simply urging the Chinese president and the Hong Kong Chief Executive, Carrie Lam, to faithfully honor the government’s promises.”\n\nSmith’s bill would require a report by the Commerce Department on whether the Hong Kong government adequately enforces U.S. export controls and sanctions laws. It also allows qualified Hong Kong residents to work or study in the U.S. even if they have been arrested for participating in nonviolent protests.\n\nPresident Donald Trump said last week that he would “like to see a very humane solution” to the Hong Kong protests. “I hope that’s going to happen,” he said Oct. 7 at the White House. “And, you know, Hong Kong is very important as a world hub — not just for China, but for the world.”\n\nMany protesters fly American flags, and Trump said he is hopeful a humane deal can be worked out, adding: “I think President Xi has the ability to do it.”\n\nPelosi was less optimistic. Since China used its military to crush the 1989 Tiananmen Square pro-democracy protests in Beijing, “we have seen that commercial interest always win,” she said during House debate. “It’s always about the money.”\n\nCiting the Bible, Pelosi said, “What does it profit a person if he gains the whole world but loses his soul?”\n\nRep. Brad Sherman, D-Calif., who sponsored one of the Hong Kong bills, said that “the world is watching Hong Kong, and Hong Kong is watching the floor of the House of Representatives” to see if lawmakers support the protesters instead of the Chinese government.\n\nUnder pressure from China, tech giant Apple removed a smartphone app that enabled Hong Kong protesters to track police, while the National Basketball Association has seen its once-thriving relationship with China become strained after Houston Rockets general manager Daryl Morey tweeted support for the Hong Kong protesters.\n\n“Corporations bow down to China for profit,” Sherman said. “It’s time we stand up to China.”\n\nThe three bills now head to the Senate. A spokesman for Senate Majority Leader Mitch McConnell, R-Ky., said Tuesday he had no scheduling announcement.\n\nMcConnell chided the NBA, saying in a tweet last week that “the people of Hong Kong have risked much more than money to defend their freedom of expression, human rights and autonomy. I hope the @NBA can learn from that courage and not abandon those values for the sake of their bottom line.”\n\nThe Senate Appropriations Committee last month advanced an amendment that McConnell said would ensure “the U.S. maintains a watchful eye on the Chinese government’s aggressive encroachment on Hong Kong.”\n\nContact us at editors@time.com.", "description": "The House passed three bills Tuesday aimed at showing U.S. support for pro-democracy protesters in Hong Kong.", "authors": ["Matthew Daly"], "top_image": "https://timedotcom.files.wordpress.com/2019/10/ap19288510726698.jpg?quality=85&w=1200&h=628&crop=1", "published_at": "2019-10-16"}