{"pub": "businessinsider", "url": "https://businessinsider.com/lizzy-capri-quit-day-job-for-youtube-got-millions-subcribers-2019-10", "downloaded_at": "2019-10-10 15:34:01.908235+00:00", "title": "Lizzy Capri quit her day job at LinkedIn to become a YouTube creator and amassed 3.9 million subscribers in less than 2 years. She told us how.", "language": "en", "text": "YouTube star Lizzy Capri has amassed over 3.9 million subscribers and over half a billion views less than two years since posting her first video online.\n\nIn 2016, she graduated from Carnegie Mellon University and immediately got a job at LinkedIn.\n\nBut she quit after helping her friends Stephen and Carter Sharer become successful on YouTube, and deciding to start her own channel.\n\nCapri shared why she left her traditional job to pursue YouTube and how she's been able to build a sustainable business online, with employees, brand deals, and millions of views per video.\n\nClick here for more BI Prime stories.\n\nWhen Lizzy Capri graduated college in 2016, YouTube fame wasn't on her mind. She followed a more traditional path, snagging a 9-to-5 job upon graduation.\n\n\"YouTube was always a big part of my life growing up,\" she told Business Insider. \"And I knew people had made careers out of it, I just didn't really know how — and left it at that.\"\n\nCapri had studied statistics and technical writing at Carnegie Mellon University, and worked as a technical writer at LinkedIn after graduating.\n\nBut she had been helping her college friend Stephen Sharer (7 million subscribers since 2015) and his brother Carter (5.6 million subscribers since 2017), with their channels, watching them grow and grow.\n\nThen in 2018, Capri decided to start a channel of her own. It almost immediately became a runaway success.\n\nCapri, now 25 years old, currently has over 3.9 million YouTube subscribers and over half a billion views — less than two years after posting her first video online.\n\nShe is the brains behind the \"Lizzy Capri\" brand, overseeing analytics, logistics, marketing, and branding on a channel that attracts mostly younger viewers.\n\nLeaving a traditional career for YouTube\n\nStephen Sharer's channel came first, with videos like hoverboard unboxings and an \"insane backflip challenge\" (now with almost 14 million views).\n\nThe channel's growth began to accelerate in 2017, and Carter Sharer — who was also working on the channel along with his brother and Capri — said he would quit his day job if the channel passed 100,000 subscribers.\n\nIt did, and Capri said she thought to herself, \"I'd be willing to quit too, but if we reach one million.\"\n\nWithin two months of Carter quitting, the original channel \"Stephen Sharer\" hit one million subscribers, prompting her to leave her job at LinkedIn.\n\n\"It was so insane,\" she said. \"We had an Excel spreadsheet of ideas — hundreds of ideas — and any time I would think of an idea, I would add it and that's where a lot of the initial video ideas came from.\"\n\nAt first, Capri spent time on the backend of the channel, managing the email account, audience engagement through comments, and fan mail to build audience loyalty, she said.\n\n\"My traditional job definitely helped shape my experience on YouTube, and created more structure around being a creator and working in this unstructured lifestyle,\" she said. Lizzy Capri/YouTube\n\nA day in the life\n\nEarly last year, Capri decided to launch her own channel, which soon turned into four channels: a main channel, vlog channel, gaming channel, and a channel for her dog Milli, a havanese poodle mix.\n\nOut of her four channels, Milli's World is the second most popular, at almost one million subscribers.\n\nCapri said it usually takes several days to develop an idea into a video. And there's a strategy to gaining millions of views.\n\n\"It seems like we just picked up the camera and ran, but we actually sat down, brainstormed, and figured out a structure for the video,\" she said. \"We want it to feel easy, but there's a lot of production that goes into each video.\"\n\nCapri said she spends a significant amount of time thinking about what the thumbnail image will be, and about an hour taking the photo for it.\n\nIn a previous interview, Reed Duchscher, president of the talent management firm Night Media, spoke to Business Insider about popular techniques creators use to draw in younger viewers, like adding bright colors like neon green and yellow to a thumbnail image.\n\n\"The reason why these popular channels are being promoted comes down to two things: high average view duration and high click-through rate,\" Duchscher said.\n\nCapri employs some of these techniques on her thumbnails.\n\nWorking on something top secret 😝 comment what u think it is! A post shared by Lizzy Capri (@lizzycaprii) on Aug 31, 2019 at 8:55pm PDT Aug 31, 2019 at 8:55pm PDT\n\nBuilding a sustainable business online\n\nCapri owns and operates her four channels, but has been a key member in developing the channels of three other creators: Carter Sharer, Stove's Kitchen, and Ryan Prunty.\n\nToday, all four creators are on a \"team\" together, with several employees, from full-time video editors and production assistants, to someone who assists with merchandise creation and sales, she said.\n\n\"There's a sustainability aspect for businesses that is different from if it's a hobby or passion,\" she said. \"I've always taken it very seriously, and you have to if you're relying on it to pay your bills.\"\n\nShe said the team works together every day, and films about two videos a day for someone's channel. They'll also spend time reviewing each video's analytics together — like views, click-through rate, and watchtime — looking at what works and removing methods that don't. She said they aim for a 50% watchtime on videos and will look at where viewers are clicking off from the video through the data provided by YouTube's creator studio.\n\n\"Our day is totally packed,\" she said. \"There are a lot of backend business things we have to get sorted out, with our legal team or accountant on a weekly basis.\"\n\nCapri said she earns money through Google AdSense (which places ads within her YouTube videos), through brand partnerships, and other opportunities like merchandise.\n\nWhat works on YouTube changes constantly, she said. Over the past year, she said her team has been focused on developing a creative strategy, and rebranding the team name (previously \"dream team\"), while also growing a sustainable audience, making sure they are still focusing on the followers they each have, instead of the one-off viral hits.\n\n\"There is a lot more pressure now, because there are so many more people involved,\" she said. \"For us to grow, not just as one channel but as a group, there's power in numbers and we saw that.\"\n\nFor more on how influencers are profiting from their success online, according to industry professionals and creators, check out these Business Insider Prime posts:", "description": "YouTuber Lizzy Capri on how she's been able to build a sustainable business online, with employees, brand deals, and millions of views per video.", "authors": ["Amanda Perelli"], "top_image": "https://image.businessinsider.com/5d9e54d23b33a72e9650f223?width=1200&format=jpeg", "published_at": "2019-10-10"}