{"pub": "breitbart", "url": "https://breitbart.com/economy/2019/10/30/trump-administration-asks-supreme-court-to-back-sweep-of-fannie-and-freddie-profits", "downloaded_at": "2019-10-30 23:23:15.381603+00:00", "title": "Trump Administration Asks Supreme Court to Back Sweep of Fannie and Freddie Profits", "language": "en", "text": "The Trump administration asked the Supreme Court to back the government’s claim to nearly all of the profits of Fannie Mae and Freddie Mac.\n\nIn a filing with the Supreme Cout, lawyers for the Justice Department asked the court to hear a case contesting a decision from a federal court that ruled in September that the Federal Housing Finance Agency exceeded its legal authority when it agreed to give all of Fannie and Freddie’s profits to the U.S. Treasury in exchange for relief from a fixed dividend that had driven Fannie and Freddie to draw even more bailout funds.\n\nThe FHFA took control of Fannie and Freddie in 2008, becoming their conservator, as the companies teetered on the verge of collapse. In exchange for rescue funds from the U.S. Treasury, the companies agreed to pay a 10 percent annual dividend on any amounts they required to stay afloat. Initially, the companies could not pay the dividend without drawing more money from the Treasury. To put an end to the circular draws, Treasury and the FHFA in 2012 restructured the dividend so that it rose and fell in line with the profits of the companies, a structure known as a “net worth sweep.”\n\nShareholders of Fannie and Freddie have sought to challenge this change in federal courts across the country. Until September, however, these efforts were thwarted by judges who agreed with the government’s claim that the unusual arrangement had been authorized by Congress and that shareholder rights to contest the arrangement had been transferred to the FHFA when the companies were taken into conservatorship.\n\nIn September, a splintered en banc panel ruled for the shareholders on two points. One majority group of nine judges held that the structure of the FHFA was unconstitutional because the president could not remove its director except for cause. A different nine-judge majority held that the net worth sweep exceeded the FHFA’s authority and did not comport with the traditional duties of a conservator. Both holdings conflicted with the rulings of federal courts elsewhere around the country.\n\nThe constitutional victory was less meaningful for shareholders because the remedy assigned by the court was simply to make the FHFA director removable at will by the president. The court said it did not need to overturn earlier decisions by the FHFA, including the decision to accept the net worth sweep. Shareholders have separately asked the Supreme Court to overrule this remedy and declare that they are entitled to have the net worth sweep declared void.\n\nSome shareholders had hoped that the Trump administration would not continue to pursue the legal case in defense of the sweep and the FHFA, positions it inherited from the Obama administration, and instead pursue a settlement with the investors. The petition to the Supreme Court shows that these hopes were misplaced.\n\nThe case is Mnuchin v. Collins, 19-563.", "description": "The Trump administration is seeking to overturn a Fifth Circuit decision that was the first significant shareholder legal victory. | Economy", "authors": ["John Carney"], "top_image": "https://media.breitbart.com/media/2019/10/Supreme-Court-Pillars-with-light-640x335.jpg", "published_at": "2019-10-30"}