{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/30/threat-us-elections-2020-not-limited-russia", "downloaded_at": "2019-10-30 11:37:49.152979+00:00", "title": "Threat to U.S. elections in 2020 is not limited to Russia", "language": "en", "text": "WASHINGTON (AP) — Russia interfered in the 2016 election and may try to sway next year’s vote as well. But it’s not the only nation with an eye on U.S. politics.\n\nAmerican officials sounding the alarm about foreign efforts to disrupt the 2020 election include multiple countries in that warning. Concerns abound not only about possible hacking of campaigns but also about the spread of disinformation on social media and potential efforts to breach voting databases and even alter votes.\n\nThe anxiety goes beyond the possibility that U.S. adversaries could directly affect election results: The mere hint of foreign meddling could undermine public confidence in vote tallies, a worrisome possibility in a tight election.\n\n“Unfortunately, it’s not just Russia anymore. In particular, China, Iran, a couple of others, studied what the Russians did in 2016,” said James Lewis, a cybersecurity expert at the Center for Strategic and International Studies in Washington.\n\nU.S. intelligence agencies reported Russian, Chinese and Iranian influence operations targeting last year’s midterms, and a senior FBI official recently singled out Beijing as a particular source of concern. Meanwhile, Microsoft recently reported that Iranian hackers had targeted an unidentified presidential campaign along with government officials, journalists and prominent expatriate Iranians.\n\nAny foreign effort to interfere in the 2020 election won’t necessarily mirror Russia’s attack in 2016, when Kremlin-linked military intelligence officers hacked Democratic emails and shared them with WikiLeaks to try to help Republican Donald Trump defeat Democrat Hillary Clinton.\n\nMore likely are the social media campaigns, like the Russian-based one that shaped public opinion in the 2016 election and divided Americans on hot-button topics like race and religion. Facebook announced recently that it has removed four networks of fake, state-backed misinformation-spreading accounts based in Russia and Iran. The company said the networks sought to disrupt elections in the U.S., North Africa and Latin America.\n\nA Senate Intelligence Committee report described Russia’s social media activities as a “vastly more complex and strategic assault on the United States than was initially understood.” A recent memo prepared by the FBI and Department of Homeland Security warned that Russia may use social media to exacerbate divisions within political parties during primaries or hack election websites to spread misinformation on voting processes.\n\nConcerns about foreign influence coincide with stepped-up enforcement of a law requiring the registration with the Justice Department of lobbyists, media organizations and other entities that do the bidding of foreign government.\n\nSpecial counsel Robert Mueller exposed through his investigation the unregistered, covert Russian campaign to spread disinformation on social media.\n\nThe Justice Department is concerned about China undertaking similar activities. Twitter said it has suspended more than 200,000 accounts that it believes were part of a Chinese government influence campaign targeting the protest movement in Hong Kong. The department last year also required China’s state-owned television network, CGTN, to register.\n\n“Make no mistake, China is aggressively pursuing foreign influence operations,” Nikki Floris, an FBI deputy assistant director, said at a recent congressional hearing. “So as we roll into 2020, though Russia was certainly a threat in 2016 (and) 2018, and will continue to be so in 2020, we are also aggressively looking at China as well.”\n\nU.S. officials said the foreign influence campaigns didn’t change midterm vote totals, but there’s no question that concern remains for 2020. Besides the hacking and subsequent release of stolen emails, Russian agents in 2016 searched for vulnerabilities within election systems in all 50 states and breached the election systems of two Florida counties but don’t appear to have done any damage.\n\nAmerica’s adversaries might have a stake in the 2020 vote. Trump, for instance, speaks well of North Korean leader Kim Jong-un while deepening tensions with Iran by withdrawing the U.S. from a nuclear deal. He has also engaged China in a trade war.\n\nBut some experts are skeptical that those countries will use hacking to try to boost a particular candidate — or to influence the election at all. Much of their hacking has been tied to more narrow national interests.\n\nChina, for instance, has so far used its cyber capabilities for the purposes of espionage and intellectual property theft and to further its goal of challenging the U.S. role as a global economic superpower. The Justice Department in 2014 charged five Chinese military hackers with siphoning secrets from major American corporations.\n\nIranian hackers have attacked dozens of banks and a small dam outside New York City and, more recently, sought to pilfer sensitive information from hundreds of universities, private companies and American government agencies.\n\nNorth Korea tends to focus its efforts on defectors, academics and others with a hostile relationship to the country, said Jung Pak, a Brookings Institution expert.\n\nIt hacked Sony Pictures Entertainment and released the private emails of its executives in apparent retaliation for a Hollywood comedy that mocked Kim.\n\n“We haven’t really seen politically motivated attacks where they try to sway elections,” said Matt Ha, a research associate at the Foundation for Defense of Democracies. “Right now, their main objective is the summits, the diplomacy, to try to gain as much as they can — gaining a lot for giving up nothing.”\n\nEven as other countries have bolstered their own capabilities, Russia’s own decadeslong interest in American politics makes it the most challenging and realistic adversary, said Lewis, of CSIS.\n\n“They’re politically astute in a way that no other country can match, and that makes them the most formidable opponent,” Lewis said. “They just know us really well.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Russia interfered in the 2016 election and may try to sway next year's vote as well. But it's not the only nation with an eye on U.S. politics.", "authors": ["The Washington Times Http", "Eric Tucker"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/22/Congress_Elections_98156.jpg-e3d6c_c0-0-4762-2777_s1200x700.jpg?32914d9d02c75aab8178e1e6528cd6d382b43ac2", "published_at": "2019-10-30"}