{"pub": "investingcom", "url": "https://ng.investing.com/news/stock-market-news/collapse-of-thomas-cook-is-a-reality-check-for-chinas-fosun-56442", "downloaded_at": "2019-09-25 07:03:14.805425+00:00", "title": "Collapse of Thomas Cook Is a Reality Check for China's Fosun", "language": "en", "text": "(Bloomberg) -- Sign up for Next China, a weekly email on where the nation stands now and where it's going next.\n\nThe collapse of Fosun Group’s flagship European investment, Thomas Cook, is proving to be a reality check for the Chinese conglomerate’s ambitions to create a global travel empire via flashy acquisitions.\n\nAfter months of talks to hammer out a $1.1 billion bailout package, Shanghai-based Fosun -- the biggest shareholder in Thomas Cook Group Plc -- decided against committing any more money toward rescuing the British inventor of the package vacation. For want of an additional 200 million pounds ($249 million) demanded by creditors, the indebted tour operator filed for liquidation this week.\n\nThomas Cook’s Final Adventure Ends in Early-Morning Liquidation\n\nBanking on a boom in Chinese outbound travel, particularly to Europe, Fosun’s pursuit of Thomas Cook made sense initially. But its reluctance to see the deal through shows the company may be reconsidering a game plan that saw it buy about $18 billion of assets over the last five years at home and abroad, including iconic French resorts brand Club Med SAS in 2015.\n\nWith the global economy cooling and the trade war altering the landscape for offshore acquisitions, the Thomas Cook setback could also signal a pause in the wider plans of Hong Kong-listed Fosun, which has assets spanning brewing to fashion labels.\n\n“Fosun is facing the headwinds of a slowdown,” said Andrew Collier, managing director at Oriental Capital Research Inc. in Hong Kong. “It’s a difficult time to be expanding.”\n\nLed by billionaire Guo Guangchang and founded in 1992, Fosun has lately been focusing on hospitality, health care and finance -- businesses its chairman prefers to refer to as happiness, health and wealth. They operate broadly under its listed units Fosun International Ltd., Fosun Tourism Group and Shanghai Fosun Pharmaceutical Group Co.\n\nWhat Bloomberg Opinion Says\n\nIt’s almost impossible for investors to calculate Fosun’s return on capital at the brand level, or discern which part of its acquisition strategy is actually working.\n\nIn the long term, the company’s opaque structure will only derail its ambitions as an investment powerhouse.\n\n--Bloomberg Opinion columnist Shuli Ren\n\nFosun is the last of the few Chinese conglomerates still chasing overseas deals, while giants such as HNA Group Co., Dalian Wanda Group Co. and Anbang Insurance Co. have been reined in and are selling off assets to pare hefty leverage piles racked up by offshore acquisition sprees. Total debt at Fosun International stood at $28 billion as of June 30, compared with cash and equivalents at $22 billion, according to data compiled by Bloomberg.\n\nIn the tourism space, Fosun started expanding by acquiring control of Club Med in 2015 after a protracted takeover battle. Later the same year is bought the stake in Thomas Cook.\n\nAfter building an 18% holding in the London-based company, Fosun was seeking to replicate its model at Club Med -- the once flagging resorts brand -- by tapping wealthy Chinese tourists traveling to destinations in Europe. Official data show about 150 million travelers from China traveled overseas last year.\n\nAs China’s Economy Slows, Why the World Should Care: QuickTake\n\nBut sputtering growth in the world’s second-biggest economy means a dip in demand. China’s slowdown, partly triggered by the fight over trade with the U.S., has hit consumer spending, factory output and the job market. A weaker yuan has also added to concerns over tourism and spending.\n\nIt isn’t just China that is under pressure. Parts of Europe are in recession or close to it, with World Bank President David Malpass saying this month the global economy is poised to decelerate more than previously estimated. Brexit has also roiled the U.K.\n\nFailing Business\n\nGoing after an already flailing business like Thomas Cook wasn’t a great strategy for Fosun, said Brock Silvers, managing director at investment advisory firm Kaiyuan Capital in Shanghai. Sinking under the weight of debt from deals made a decade ago, Thomas Cook had trouble keeping up with rivals as the travel business shifted online and the package holidays it made its name with fell out of favor.\n\n“Thomas Cook was massively indebted, bleeding red ink, with an outdated business model and no obvious fit with Fosun’s portfolio,” Silvers said. The latest developments raise concerns over Fosun’s deal-making, making the conglomerate look “unfocused and undisciplined,” he said.\n\nA representative for Fosun declined to comment. Fosun had said last month it won’t spend more than the 450 million pounds it committed to the bailout, and any additional amount needs to come from others such as core lending banks. The Financial Times, citing insolvency documents, reported that Thomas Cook was facing demands of almost 500 million pounds from hotel partners and creditors at the end of September.\n\nPosition Unchanged\n\nIn a statement on Monday -- hours after Thomas Cook filed for bankruptcy -- Fosun said it was disappointed Thomas Cook couldn’t find a viable solution to secure the extra capital it needed. “Fosun confirms that its position remained unchanged throughout the process, but unfortunately other factors have changed,” it said.\n\nShares of Fosun Tourism, which led the Thomas Cook rescue negotiations, fell 0.1% in Hong Kong as of 11:52 a.m. Wednesday, after slumping almost 7% in the first two days of the week. They have dropped 39% this year, compared with a gain of less than 1% for the benchmark .\n\nThomas Cook isn’t the only troubled acquisition under Fosun. Folli Follie, a Greek retailer in which it is the second-biggest shareholder, is battling a crisis after a hedge fund disputed its sales figures last year and shorted the stock.\n\nAnd Fosun still has other deals in the works. It plans to buy assets in the mining industry as well, with a consortium led by the group in talks to acquire a majority stake in a Russian gold miner -- a deal could value the target at about $1 billion -- people familiar with the matter said in June. Fosun has about $2.2 billion of pending deals, according to data compiled by Bloomberg.\n\nIn an interview in May, Kevin Xie, Fosun’s chief representative in the U.S., said the conglomerate is easing up on investments in the U.S. because of growing regulatory scrutiny from the trade war, and is shifting its focus to emerging markets.\n\n“The global atmosphere is now less favorable for China’s outbound investors,” Silvers said. “Chinese conglomerates face increased skepticism, and potential partners will now find little comfort in Fosun’s interaction with Thomas Cook.”", "description": "Collapse of Thomas Cook Is a Reality Check for China's Fosun", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/pice0f1998ec11bff7e91380754d1c78f4c.jpg", "published_at": "2019-09-25"}