{"pub": "wsj", "url": "https://wsj.com/articles/liberal-city-tags-speech-as-terrorism-11567969503?mod=rsswn", "downloaded_at": "2019-09-08 23:27:15.906554+00:00", "title": "Liberal City Tags Speech as Terrorism", "language": "en", "text": "Only Congress can declare war, but the San Francisco Board of Supervisors is trying. Last week it voted unanimously to brand the National Rifle Association, an association with millions of American members, a “domestic terrorist organization.”\n\nLaw books have plenty to say on the definition of terrorism, but the supervisors don’t seem to have cracked one. Instead they suggest terrorism occurs anytime someone uses a “weapon” to threaten others’ personal safety or “substantial” property damage. They try to attribute this view to the U.S. Justice Department, ignoring all the other elements that distinguish terrorism from other types of armed crime, such as that criminal acts be used to intimidate or coerce a civilian population or government target.\n\nAn even greater problem for the supervisors is that the NRA and its members are generally law-abiding. The resolution therefore claims that even otherwise lawful acts—such as training or providing funds—that assists or enables someone you should have known might misuse weapons constitutes “material support.” That includes the NRA’s “advocacy,” “propaganda” and “promotion” both of gun ownership and of “extremist positions.” In a word, speech. Thus the supervisors purport to classify as terrorism the expression of opinions with which they disagree.\n\nThe resolution is mostly symbolic, but it does order city officials to “take every reasonable step to limit those entities who do business with the City and County of San Francisco from doing business with” the NRA. That’s almost certainly unconstitutional. In Board of County Commissioners v. Umbehr (1996), the Supreme Court held that terminating a contract in response to the contractor’s protected speech violates the First Amendment. The vote was 7-2, with only Justices Antonin Scalia and Clarence Thomas dissenting.\n\nThe general issue has been in the news in recent years because of cities’ moves to keep conservative-owned businesses like Chick-fil-A from getting concessions in airports and similar facilities, or even in one case from obtaining routine permits. Last month a federal judge allowed the NRA to proceed with a lawsuit challenging a less extreme Los Angeles ordinance that requires city contractors to disclose (but not discontinue) their associations with the gun group. The judge ruled that in the context of the NRA’s First Amendment claims, even commercial ties such as discount partnerships could be construed as “expression.”\n\nA couple of weeks before passing the NRA resolution, the San Francisco supervisors passed a nonbinding measure encouraging municipal officials to use “people-first language” when speaking of those with criminal records. That means using “neutral, objective, and non-pejorative language,” such as “currently incarcerated person” or “young person impacted by the justice system.” Using words like “convict” or “delinquent,” according to the resolution, “undermines, devalues, dehumanizes, demoralizes and dishonors the humanity of [the] individual.”\n\nThe San Francisco Board of Supervisors would never want to do something like that—except to an individual who holds views they find uncongenial.\n\nMr. Olson is a senior fellow at the Cato Institute.", "description": "San Francisco’s Board of Supervisors plays language games to smear the National Rifle Association.", "authors": ["Walter Olson"], "top_image": "https://images.wsj.net/im-104904/social", "published_at": "2019-09-08"}