{"pub": "afr", "url": "https://afr.com/property/commercial/time-and-place-start-industrial-fund-with-maxcap-20191030-p535me", "downloaded_at": "2019-10-30 14:16:39.803995+00:00", "title": "Time & Place start industrial fund with MaxCap", "language": "en", "text": "Online changes the logistics game\n\nOnline will account for 19 per cent of Australia's retail sales by 2021, up from 7 per cent in 2016, and this will boost pressure on retailers to meet increasing demands for delivery, according to EY research the Financial Review reported earlier this month.\n\nThe logistics game was no longer the preserve of very large retailers alone and had changed over the past four or five years, Mr O'Keefe said.\n\n\"As the retail slice moves a little bit – you only need a couple of percent[age points] – out of bricks and mortar into online retail, the supply chain just needs to be bigger,\" he said.\n\nThe low-rate environment also made it easier for retailers to invest in their own warehouses, he said.\n\nThe fund has also acquired a 16.7-hectare site in western Melbourne's Truganina. Supplied\n\n\"They can own something for about the same price that they would have been renting,\" Mr O'Keefe said. \"That’s a really attractive thing for them.\"\n\nAdvertisement\n\nFor MaxCap, the fund is a way of expanding its push into equity investments, to offer higher-yielding direct investments in addition to its staple of commercial real estate debt.\n\n\"It’s a much more aggressive strategy,\" MaxCap chief investment officer Brae Sokolski said.\n\n\"It’s equity. In keeping with that, the returns are commensurately much higher. We’re targeting 20 per cent-plus IRR which in this low interest rate environment is outstanding. But we feel it’s done in the context of a very sound safe play with strong fundamentals.\"\n\nThe fund, which has already secured a 9.78-hectare site in Epping, in Melbourne’s north and a 16.7-hectare site in Truganina, in Melbourne’s west, aims to own about 10 investment sites in total that it will progressively develop and sell.\n\n\"It’s the flipside of investing in strip retail,\" Mr Sokolski said.\n\n\"If strip retail is in decline, the flipside to this has to be some way people are getting goods into their house. It’s not as if there are less goods being purchased. It just that the method by which people purchase has changed.\"", "description": "New closed-ended fund takes advantage of both changing retail models and low interest rates.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.4846%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_96/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/1e083d24cdd4e5942368aeb96b6a8553d4a2a969", "published_at": "2019-10-30"}