{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7614993/Coronation-Street-viewers-left-SOBBING-Sinead-Tinker-finally-loses-fight-cancer.html", "downloaded_at": "2019-10-25 22:39:58.197312+00:00", "title": "Coronation Street viewers left 'SOBBING' as Sinead Tinker finally loses her fight with cancer", "language": "en", "text": "Coronation Street viewers were left sobbing on Friday night as Sinead Tinker finally lost her battle with cancer.\n\nHeart-breaking scenes showed the character’s final day as she said her last goodbyes to her loved ones.\n\nThe death of Sinead (played by Katie McGlynn) was so moving and real for viewers that some struggled to continue watching the ITV soap.\n\nTragic: Coronation Street viewers were left sobbing on Friday night as Sinead Tinker finally lost her battle with cancer\n\nThe character slipped away while her husband Daniel read a bedtime story to their son Bertie.\n\nThe journalist was left floored as he realised that she had gone and after putting his tot down, sobbed over his wife's body.\n\nThe family then gathered after Daniel had informed them of her death, with vicar Billy saying a heartfelt prayer for Sinead.\n\nScenes showed the crushed family standing in the rain, while a guilt-ridden Bethany watched as the undertakers came to take away Sinead's body.\n\nGoodbye Sinead: Heart-breaking scenes showed the character’s final day as she said her final goodbyes to her loved ones\n\nSo sad: Daniel (Rob Mallard) was left devastated as his beloved wife Sinead sadly passed away\n\nAnd in a final scene that pulled at the heartstrings, Daniel later returned to an empty flat with son Bertie and tearfully gazed at the bed where his wife once laid.\n\nAs the show finished, Daniel was seen getting Bertie ready for his bath, with his voice being heard as the credits came.\n\nTaking to Twitter, several fans shared their devastation at watching the deeply emotional scenes.\n\n‘This is just heartbreaking #Corrie,’ wrote one viewer.\n\nDevastated: The character slipped away while her husband Daniel read a bedtime story to their son Bertie\n\nAs another shared: ‘Christ, if you aren't crying watching #Corrie right now are you even human? This is heartbreaking.’\n\nA third upset fan tweeted: ‘I’m sobbing this is heartbreaking #corrie.’\n\n‘I can't watch this, especially when you know this is life for so many people in the world\n\nIt just isn't fair #cancer #corrie,’ shared a fourth.\n\nCrushed: The journalist was left floored as he realised that she had gone and after putting his tot down, sobbed over his wife's body\n\nSuch a loss: The family then gathered after Daniel had informed them of her death, with vicar Billy saying a heartfelt prayer for Sinead\n\n‘Can't bring myself to watch the rest. Yes it's only a soap, but this acting is so absolutely brilliant it's untrue. If you've ever watched someone die from cancer, the little details are so unbelievably real, they have thought of everything. #Corrie,’ wrote another.\n\nWith another heartbroken watcher adding: ‘Literally sobbing I’m 25 same age as sinead and was checked last year I guess some of us are lucky #Corrie.’\n\nThe hour long episode featured several fading scenes emulating the moments the Underworld worker fell asleep as her body grew weaker and weaker by the hour.\n\nHer day saw her spend moments with husband Daniel Osbourne, as well as her aunty Beth, Kirk and cousin Craig.\n\nTough to watch: Taking to Twitter, several fans shared their devastation at watching the deeply emotional scenes\n\nAs Sinead struggled on, Beth went and fetched Dr Gaddas, with the intention to move Sinead to a hospice.\n\nHowever, Dr Gaddas confirmed that Sinead was too weak to be moved and that she didn’t want to risk Sinead dying in transit.\n\nAs the reality of the situation dawned, Sinead’s mother and nan were called, while the character also had a visit from the local vicar Billy.\n\nThere were several bittersweet moments throughout the day, as Sinead smiled at her family bickering over biscuits, while she delighted in having come up with an oxymoron before she ‘pegged it’.\n\nThank you: Following the episode, actress Katie McGlynn took to social media to thank fans from the 'bottom of my heart' for following Sinead's journey\n\nElsewhere, the Barlow family shared a sombre moment together as they reflected on losing other loved ones.\n\nWhile her colleagues, pals and ex-boyfriend Chesney shared fond memories of the street resident.\n\nFollowing the episode, actress Katie McGlynn took to social media to thank fans from the 'bottom of my heart' for following Sinead's journey.\n\nOn your side: She then gave a supportive message to those affected by cancer, writing: 'To every single person that is, or has been affected by cancer, stay strong!'\n\nAlongside an image of her in character, she wrote: 'Thank you from the bottom of my heart for your amazing support and love..thank you to every single person who makes Coronation Street the brilliant show that it is and most importantly, THANK YOU to every single viewer for following Sinead’s journey.'\n\nShe then gave a supportive message to those affected by cancer, writing: 'To every single person that is, or has been affected by cancer, stay strong!\n\n'Seek comfort in family, friends and loved ones. Don’t be afraid to ask for help and don’t be afraid to feel however it is you feel! My heart is with you all, be brave and fight.'\n\nAhead of the heartbreaking onscreen death, Katie shared a heartfelt Instagram post featuring a quote from her alter ego.\n\nFinal moments: Ahead Sinead Tinker's heartbreaking Coronation Street death, Katie McGlynn shared a heartfelt Instagram post featuring a quote from her alter ego\n\nThe actress, 26, also took to Twitter where she bid farewell to Sinead after seven years and thanked her fans for their unwavering support throughout the tragic storyline.\n\nFor months fans of the ITV soap have watched as Sinead battled to fight the cruel disease, with the character learning in recent weeks that she had very little time left to live.\n\nAnd ahead of her demise on Friday, Katie shared a snap of herself in character and quote from Sinead, which was said in a recent episode.\n\nShe wrote: 'If I’ve learnt one thing in my 25 years on this planet, nice can change the world.” Sinead Osbourne @coronationstreet you’ll always be my home #corrie#cervicalcancer #sinead #daniel.'\n\nThe previous day, the TV star also revealed she was struggling to watch this week's scenes which saw the Underworld worker's life slowly ebb away.\n\nGoodbye: The actress, 26, also took to Twitter where she bid farewell to Sinead after seven years and thanked her fans for their unwavering support throughout the tragic storyline\n\nTouching: Ahead of her demise on Friday, Katie shared a snap of herself in character and quote from Sinead, which was said in a recent episode\n\nAlongside an image of her character and onscreen husband Daniel Osbourne (played by Rob Mallard), she wrote: 'Finding it very emotional to watch tonight, if anything Sinead’s storyline has taught me to appreciate the small things in life...\n\n'When she puts her hand out the window to feel the rain for the last time, it really made me appreciate everyday things that we all take for granted.\n\n'I really appreciate everyone sharing their own personal stories with me, my heart goes out to each and every one of you...we only get one life so make sure you live it.\n\nMeanwhile, Katie also took to Twitter to share an emotional message as she prepared to watch her final Corrie scenes.\n\nSo sad: The previous day, the TV star also revealed she was struggling to watch this week's scenes which saw the Underworld worker's life slowly ebb away\n\nShe wrote: 'After nearly 7 wonderful years on the cobbles, tonight Sinead loses her battle with cancer.\n\n'Ahead of tonights eps I wanted to share my heartfelt love & gratitude for every single fan of the show who has followed her journey. I’m going to miss her & @itvcorrie dearly #corrie.'\n\nRecent scenes saw Sinead left devastated after learning husband Daniel kissed friend Bethany Platt in a shock moment after he had a row with his dying wife.\n\nAs he was ordered out, Daniel drank himself into a drunken stupor, with the Barlow family left worried about his well-being.\n\nHeartbreaking: Meanwhile, Katie also took to Twitter to share an emotional message as she prepared to watch her final Corrie scenes\n\nDevastated: Recent scenes saw Sinead left devastated after learning husband Daniel kissed friend Bethany Platt in a shock moment after he had a row with his dying wife\n\nIn the meantime, Sinead gathered the strength to record video messages for her baby son Bertie, as she tragically realises she wont be around for his birthdays, his first day of school or his wedding.\n\nThe character also decided to forgive Daniel for his cheating as she knew that time was against them.\n\nIn touching scenes that left viewers in tears, Sinead told Daniel that she had forgiven him because of their son, and that he needed to be there for the tot.\n\nIn a light-hearted moment, she even joked that if he didn't step up, then she would return to haunt him as a poltergeist.\n\nSad scenes: In the meantime, Sinead gathered the strength to record video messages for her baby son Bertie, as she tragically realises she wont be around for his big moments\n\nOn a recent appearance on Loose Women, the actress also spoke of how filming the draining scenes affected her mental health.\n\nShe said: 'I watched the press screening on Monday of her final scenes and I can't watch it again.\n\n'I think once we were filming it you couldn't really get out of it, you immerse yourself in the part so much that whenever we went back to Sinead's room, people were just on and off crying, parts of the crew, me and Rob.\n\nTough: On a recent appearance on Loose Women, the actress also spoke of how filming the draining scenes affected her mental health\n\n'It felt so real and the only way we could play this part was if we tapped our minds into it as it's real, and all of it felt real for me.'\n\nShe continued: 'I kind of underestimated the effect it's had on my mental health. I've only just noticed it.\n\n'Walking away from filming and watching it on Monday, that part of me was grieving Sinead and it's bizarre, but I've started doing like a fitness thing to safeguard myself and that's helping me.'\n\nShe concluded: 'Watching her die was awful but it's raising awareness.'\n\nIf you've been affected by this storyline, please call Macmillan cancer support on 0808 808 00 00 or visit www.macmillan.org.uk\n\nCoronation Street airs Mondays, Wednesdays and Fridays at 7:30pm and 8:30pm on ITV.\n\nChallenging: 'It felt so real and the only way we could play this part was if we tapped our minds into it as it's real, and all of it felt real for me'\n\n\n\n", "description": "Coronation Street viewers were left sobbing on Friday night as Sinead Tinker finally lost her battle with cancer, as heart-breaking death scenes left them struggling to watch", "authors": ["Niomi Harris For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/21/20197920-0-image-a-74_1572036441790.jpg", "published_at": "2019-10-25"}