{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7604115/Nigel-Farage-predicts-EU-offer-Brexit-delay-end-January.html", "downloaded_at": "2019-10-23 09:49:26.227386+00:00", "title": "Nigel Farage predicts the EU will offer a Brexit delay until 'at least' the end of January", "language": "en", "text": "brexit countdown_bg Created with Sketch.\n\nNigel Farage today predicted the UK could remain trapped in the EU until long after January next year as the bloc weighs up how long to delay Brexit.\n\nThe Brexit Party leader said this morning that the EU could choose to comply with the wishes of the UK Parliament and offer an extension to the suggested date of January 31, 2020.\n\nBut he warned it is in Brussels' power to suggest an alternative date and that it could go for an even longer one in order to give the UK more time to hold either a second referendum or a general election.\n\nMr Farage's intervention comes after Boris Johnson won a vote on his deal in the House of Commons but then saw his plan to leave the EU on October 31 effectively shredded.\n\nMPs voted for his deal by 329 to 299 only for them to then vote against the PM's proposed timetable to crash his Withdrawal Agreement Bill through the Commons in just three days.\n\nThe so-called WAB is the piece of legislation which is needed to enshrine Mr Johnson's divorce accord in law and actually make Brexit happen.\n\nThe PM responded to the victory and subsequent defeat by telling MPs he would 'pause' the passage of the draft law in order to wait to see whether the EU would offer a delay.\n\nNigel Farage, pictured in Strasbourg yesterday, today predicted that the EU would offer the UK a Brexit delay until at least the end of January next year\n\nBoris Johnson, pictured in the House of Commons yesterday, won a vote on his Brexit deal but then saw his timetable for delivering the UK's departure from the EU on October 31 torn up\n\nMr Johnson again made clear last night that he does not want the EU to offer Britain a Brexit extension.\n\nBut Donald Tusk, the president of the European Council, then swiftly tweeted last night that he would recommend to his EU counterparts that they do accept the UK's request for an extension.\n\nHowever, it is not yet clear exactly how long that extension could last with Mr Tusk now consulting European leaders on the matter.\n\nAsked what length of extension he believed the EU would offer, Mr Farage told the BBC: 'Obviously what they want is a general election or a second referendum - they want some degree of resolution.\n\n'So I would have thought at least until the end of January, perhaps even longer.'\n\nMr Farage has urged MPs to reject the PM's Brexit deal on the grounds that it does not deliver a 'clean break' from the EU.\n\nHe believes the best way for the UK to split from Brussels is without an agreement and he has offered Mr Johnson an electoral pact if the PM switches to backing a No Deal divorce as his priority.\n\nMr Johnson has rebuffed the offers of an alliance and has said long stated that he wants the UK to leave the EU with a deal.\n\nMr Farage today reiterated that the offer of an alliance with the Conservative Party remained on the table.\n\nHe said: 'I would work with anybody that wanted to honour the result of the referendum for us to leave the European Union and to leave its institutions and to be an independent country, but right at the moment that looks very unlikely.'\n\nMr Johnson was forced to submit a request for a Brexit delay to the EU at the weekend after he failed to secure MPs' backing for his deal on Saturday.\n\nThe anti-No Deal Benn Act passed by rebel MPs earlier this year required the PM to send a letter to the bloc asking for a delay to January 31 next year.\n\nMr Johnson did send the letter but he refused to sign it as he also sent another letter to Mr Tusk stating that he did not want Brexit to be postponed.", "description": "Nigel Farage today predicted the UK could remain trapped in the EU until long after January next year as the bloc weighs up how long to delay Brexit.", "authors": ["Jack Maidment", "Deputy Political Editor For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/10/20075144-0-image-a-5_1571821261427.jpg", "published_at": "2019-10-23"}