{"pub": "businessinsider", "url": "https://businessinsider.com/sc/why-commitment-of-traders-report-is-important-to-read-2019-10", "downloaded_at": "2019-10-16 21:24:20.467145+00:00", "title": "This is the weekly government report all traders should be watching", "language": "en", "text": "By Carley Garner for CME Group\n\nThe Commodity Futures Trading Commission (CFTC) is a regulatory body creating rules to ensure a properly functioning and relatively transparent marketplace. Through the Commitment of Traders (COT) report, they it offers traders insight into where certain types of traders are positioned in the commodity markets. Those trading stocks could only dream of having information on which groups of traders were long or short a stock. Commodity traders, on the other hand, tend to take such access for granted.\n\nReading the COT\n\nThere are nearly as many theories on how to read a COT report as there are market analysts. Each has an opinion on which sets of data provide speculators with an edge and which is simply background noise. Further, I believe the trading strategy being employed plays a large role in deciding which areas of the report to pay attention to.\n\nFor example, a trend trader might look to \"go with the flow\" regarding the beginning signs of speculators piling into a certain commodity, whereas, countertrend traders might look for signs of overheated markets ripe for a mean reversion trade in the opposite direction of the trend.\n\nThere are two forms of the COT report, a long-form and a short form. Again, there are opinions abound as to which offers the most useful insight. In my opinion, the commodity markets are complicated enough, and it is generally a good idea to lean toward simpler forms of analysis to avoid the inevitable so-called analysis paralysis that occurs as the human brain is flooded with information. Accordingly, in this piece we will focus on the short form of the report.\n\nLarge and small positions\n\nThe short-form COT report separates market participants into two groups: reportables and non-reportables. To protect the futures markets from excessive speculation that can cause unreasonable or unwarranted volatility, the CFTC imposes limits on the size of speculative positions in the futures markets. The commission also stipulates reportable levels for each commodity. This means any trading account holding a position in excess of the reportable limits the brokerage housing the account must report the trader's positions. These accounts fall into the \"reportables\" category on the COT report and represent accounts holding sizable positions, far larger positions than most retail traders could imagine.\n\nThe \"reportables\" group is then divided into commercial hedgers and large speculators; the non-reportables group is deemed to be small speculators. Our favorite group to follow is the large speculator. Because these accounts are holding large positions, which require large amounts of capital, they are assumed to be the \"smart money.\" However, that isn't always the case. We have noticed that markets swing like pendulums and as a commodity is peaking there tends to be an abnormally large long position held by large speculators in that contract. Similarly, there is often an unusually large net short position as a market is bottoming.\n\nFollowing the trend\n\nThe concept is simple, if the majority of those who believe a market will move higher has already expressed this opinion in the form of going long futures contracts, the market often runs out of buyers. On the flip side, if all the bears are already short the market then there might not be anybody left to sell. As trading in the direction of the trend dries up, prices often reverse regardless of the perception of fundamentals, or even news. It is a simple game of an overcrowded trade that must be unwound.\n\nWe have noticed the large speculator group in the COT report have amassed a near-record net long position in gold futures traded on the COMEX division of the CME Group. This group hasn't held a position this bullish since mid-2016, which was followed by a sharp decline to the tune of $240. Before that, we saw a similarly overcrowded trade on the long side of gold in 2011 just before its collapse. Perhaps this time will be different, but there is a good chance we will see a repeat as those currently long the gold market take the opportunity to lock in profits.\n\nThere is a substantial risk of loss in trading commodity futures, options, ETFs. Seasonal tendencies are already priced into market values.\n\nLearn more about trader tools and resources for e-mini S&P 500 futures.\n\nThis post was created by CME Group with Insider Studios.", "description": "The Commitment of Traders (COT) report offers traders insight into where certain types of traders are positioned in the commodity markets.", "authors": ["Angela Zhao", "Created Cme Group With Insider Studios"], "top_image": "https://image.businessinsider.com/5d9e2b60122bd575760e9cb6?width=1200&format=jpeg", "published_at": "2019-10-16"}