{"pub": "financialpost", "url": "https://business.financialpost.com/diane-francis/diane-francis-putin-creating-chaos-to-claw-back-the-soviet-union-and-the-u-s-and-u-k-are-letting-him", "downloaded_at": "2019-10-07 19:54:02.897286+00:00", "title": "Diane Francis: Putin creating chaos to claw back the Soviet Union, and the U.S. and U.K. are letting him", "language": "en", "text": "Vladimir Putin is behind the impeachment crisis in Washington and the Brexit threat in London which threaten the future security of Ukraine and the European Union itself. He is destabilizing the world and has created political chaos inside Canada’s two closest allies and trading partners.\n\nHopefully, the impeachment inquiry will go beyond the phone call by Donald Trump shaking down the new Ukrainian president. The fact is that Trump is following the Putin playbook since Russian interference helped him become elected. Putin also helped Boris Johnson and others win the Brexit referendum.\n\nPutin has caused both mischief and mayhem for these two countries — key to eventually regaining control or influence over Ukraine and beyond. This is pertinent because, in 1994, the United States and the United Kingdom signed the Budapest Memorandum, along with Ukraine and Russia, that guaranteed the sanctity of Ukraine’s borders when it voluntarily surrendered its nuclear weapons after declaring independence from the Soviet Union. Neither country has waded in since to help Ukraine as it struggles to wrest itself from the Kremlin.\n\nNeither lifted a finger when, in 2014, Putin invaded seven per cent of Ukraine. The invasion was possible because Putin surreptitiously helped Ukrainian Viktor Yanukovych become its president, with help from Paul Manafort (briefly Chairman of Donald Trump’s 2016 election campaign and now in jail). While in office, Yanukovych and his team stole an estimated US$30 billion from the country and stripped its military of personnel and equipment to make way for Russia’s eventual invasion.\n\nYanukovych was overthrown, and Manafort fled, forcing Ukraine to quickly build what’s become Europe’s largest military to hold the line against the Kremlin’s desire to recapture the entire country, the Baltics and possibly more.\n\nNow it appears that Ukraine — orphaned by both the United States and United Kingdom after Putin insisted they must be excluded from war settlement talks — is about to capitulate and let Russia keep control over these occupied territories.\n\nBut that’s not Putin’s total end game. Russia broke international law and its punishment has been expulsion from the G8 and painful sanctions by the United States, and Europe. Putin wants to scrub the past in order to remove sanctions.\n\nThis is where Trump’s preoccupation with Russia comes into focus. He and his team have been on a mission to discredit the Mueller Report, which provided evidence of Russian meddling in the 2016 election. They are also on a mission to blame Ukraine, instead of Russia, for meddling in the 2016 election to help Hillary Clinton and for not investigating Joe Biden.\n\nIf Trump is able to convert one of the world’s biggest geopolitical victims — Ukraine — into a culprit, then military and other assistance can be cut, sanctions against Moscow ended, and Ukraine’s entry into the European Union and NATO impeded.\n\nMeanwhile, the U.S. and U.K. abdicated their responsibility to protect and defend the sovereignty of Ukraine as stipulated in the Budapest Memorandum. Worse, current negotiations to hold elections in the portion of Ukraine occupied by the Russian military are being supervised by Germany and France, both co-opted by Putin economically. Putin has made sure that trade with France has leaped dramatically and that Germany is going to benefit as Russia’s designated natural gas hub, eventually bypassing Ukraine’s pipelines altogether.\n\nThese elections in occupied Ukraine will whitewash the invasion and allow Russian operatives to be elected to the Ukrainian parliament, and enjoy free access to Ukraine. This is a Trojan Horse strategy that will undermine Ukraine’s fragile democracy and definitely harm its attempt to join Europe and NATO.\n\nPutin once said the greatest tragedy in history was the collapse of the Soviet Union. And slowly he’s clawing it back.\n\nFinancial Post\n\nDiane Francis is National Post editor-at-large and has been a senior fellow at the Atlantic Council in Washington, D.C. since 2014.", "description": "Putin has caused both mischief and mayhem for these two countries — key to eventually regaining control or influence over Ukraine and beyond", "authors": [], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/putin.jpg", "published_at": "2019-10-07"}