{"pub": "zdnet", "url": "https://www.zdnet.com/article/optus-booted-from-acma-complaints-report-and-told-to-get-external-audit", "downloaded_at": "2019-10-28 05:19:36.059887+00:00", "title": "Optus booted from ACMA complaints report and told to get external audit", "language": "en", "text": "Image: Optus\n\nThe Australian Communications and Media Authority (ACMA) has used its powers to force Optus to get an external audit of the data it provides to the regulator, after multiple amendments were made to its submissions and what was described as \"ongoing data anomalies\".\n\n\"Telco complaints data serves an important purpose for industry, consumers, government and the ACMA in understanding the issues being experienced by Australian consumers with their telecommunications services,\" ACMA chair Nerida O'Loughlin said.\n\n\"A failure to provide accurate data reduces the validity of the information and impacts our ability to use it to make informed evidence-based decisions.\"\n\nACMA said it would include Optus data in future reports \"when the ACMA is confident of its accuracy\".\n\nAn Optus spokesperson told ZDNet it did resubmit revised data to the ACMA, and is confident future submissions would meet all requirements.\n\nOn the latest edition of the report, ACMA said there was a drop in complaints as users moved over to the National Broadband Network (NBN).\n\n\"Complaints about broadband services delivered over the NBN have reduced and average 193 per 10,000 services compared to complaints about the old fixed broadband network which average 369,\" ACMA said.\n\nACMA noted a high level of complaints with NBN voice-only services, with the authority writing to ISPs to determine the root cause and whether action was being taken.\n\nThe level of maturity of a particular NBN access technology type impacted the complaints ratio, O'Loughlin said.\n\nFibre-to-the-curb received the highest number of complaints at 475 per 10,000 services, followed by HFC, fibre-to-the-basement, fixed wireless, fibre-to-the-node, fibre-to-the-premise, and finally satellite technology.\n\nZDNet has asked ACMA to what extent the removal of Optus has impacted this year's numbers, but they did not reply at the time of publication.\n\nOptus confirmed reports on Monday that it found that customer details were published on Sensis White Pages during a recent review.\n\n\"The majority of the affected customers' details were already listed with Sensis prior to joining Optus,\" a spokesperson said.\n\n\"As a priority, Optus arranged for Sensis to remove customer details from their online website directory, operator-directory assistance and any future printed editions of directories.\"\n\nThe company said it had \"notified and apologised\" to impacted customers.\n\nRelated Coverage\n\nOptus takes wraps off customer concierge service to take NBN out of the equation\n\nSingle point of contact for customers moving onto NBN until 30 days after installation.\n\nOptus 'doubling down' on customer experience through the cloud\n\nThe Australian telco has turned to Google for help with boosting its customer experience.\n\nOptus gained exemption to store metadata unencrypted\n\nUse of legacy applications allow Optus to seek an exemption from the rules.\n\nOptus on the path to modernising phone calls\n\nThe telco has developed applications that can transcribe voice calls in real-time and translate them from different languages into English.", "description": "ACMA has clamped down on Optus' record keeping, excluding it from the latest Telecommunications complaints handling report.", "authors": ["Chris Duckett"], "top_image": "https://zdnet2.cbsistatic.com/hub/i/r/2018/05/21/967573e8-3364-46fe-b73b-636f30407192/thumbnail/770x578/734fe1b1d8a29c5a04b61b3fcd3fa441/optus-logo-store.jpg", "published_at": "2019-10-28"}