{"pub": "afr", "url": "https://afr.com/brand/life-and-leisure/new-furniture-with-a-family-past-from-master-craftsman-jon-goulder-20191018-p531yb", "downloaded_at": "2019-10-23 08:46:38.927383+00:00", "title": "New furniture (with a family past) from master craftsman Jon Goulder", "language": "en", "text": "In 1992, Goulder quit the family workshop, age 20, later enrolling to study at the Canberra School of Art under master craftsman George Ingham. His time there confirmed his profound love of woodworking while simultaneously convincing him of the need to exceed the trade’s limitations.\n\nBy the 1990s the Australian furniture industry had gone into freefall with the majority of manufacturing moving offshore. At the same time, powerful European brands had begun making inroads into the psyche of design-savvy consumers, leaving the few local brands left to wallow.\n\nSo Goulder decided to go niche, to position himself as a designer-maker, an independent craftsperson creating limited-edition pieces of his own devising. Today his work is held in the permanent collections of most Australian museums and he has a fan base of avid collectors.\n\nThe Broached Goulder Credenza is covered in panels of woven mohair to evoke a 1960s allure.\n\nThe Broached Goulder series is his most intimate work to date.\n\nThe founder and creative director of Broached Commissions, Lou Weis, worked with Goulder to conjure up deep memories of the family workroom, to recall smells and touch, to remember the role of his mother in this masculine world.\n\n“It was quite difficult process,” admits Goulder.\n\nSays Weis: “It was like an extended psychotherapy session.”\n\nDetail of the Broached Goulder Chaise Lounge, handmade from celery-top pine, hand-woven leather and hessian upholstery.\n\nWhen Goulder reminisced about the rich fabrics hanging in layers from the workroom walls, Weis came up with the idea of creating upholstery from scraps, literally weaving together disparate memories to create a new narrative.\n\nAdvertisement\n\nThe pair went to visit renowned textile artist Liz Williamson in her Sydney studio, where two giant wooden looms take up the space that is not occupied by bobbins of coloured yarn and intricate fabric samples.\n\n“When they saw the setup they both did cartwheels,” laughs Williamson.\n\nLike Goulder, Williamson is the master of a pre-industrial craft, one that has largely been sidelined by mass manufacturing. But neither of them have much truck with nostalgia – they’re more interested in making their work resonate with now.\n\nLiz Williamson in her home studio in Sydney. Wolter Peeters\n\nWilliamson was commissioned to create the fabrics with which Goulder’s pieces would be upholstered. She would weave long leather offcuts into a nubby material, variously furry or matt depending on which side of the hide is apparent. This would be used to cover the chaise longue, the back of which is left open to reveal the hand-carved celery-top pine chassis. The coconut fibre base cushion is covered in hand-stitched hessian, a centuries-old technique.\n\nWilliamson also wove a 1960s palette of luscious mohair into ethereal panels that Goulder used to cover the sliding doors of one credenza, thus adding a seductive tactility to otherwise stoic lines. The other got the leather \"bark\" treatment, this time adhered to a baseboard for a flush effect.\n\nIn return, Goulder took inspiration from the shuttles and breast beams of Williamson’s looms, incorporating them as a design feature into the credenzas. Every time the doors are slid open they make the clacking sound of a preindustrial weaving machine.\n\nThe door handles on the Broached Goulder Credenza are inspired by the looms used by Williamson to weave the upholstery.\n\n“On one level this series is about my personal memories,” says Goulder, “but on another level it’s about the supreme quality that can be attained only by the handcrafted. People can try to approximate these outcomes with the latest 5-axis routers or whatever, but it will only ever be that: an approximation.”\n\nOn the back of the statuesque mirror, the William Morris quote, which has been interpreted by graphic designer John Warwicker using the Caslon font – a mainstay of 19th century typesetting – reads:\n\n“… work must be worth doing: think what a change that would make in the world! I tell you I feel dazed at the thought of the immensity of work which is undergone for the making of useless things.”\n\nGoulder’s things are far from useless – especially if the beauty of the hand-crafted is considered an invaluable asset.\n\nNEED TO KNOW\n\nBroached Goulder will be exhibited at the Kvadrat Maharam showroom at 17 Foster Street in Surry Hills, Sydney from October 31 to November 8.\n\nThe pieces are available in editions of eight to 12 plus two artist’s proofs.", "description": "The designer has teamed up with textile artist Liz Williamson on Broached Goulder, his most intimate collection yet.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2829%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_225/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/0538c71bb66dd8cd34cc059339f1a1ee304b352a", "published_at": "2019-10-18"}