{"pub": "fox", "url": "https://foxnews.com/world/american-marine-paul-whelan-russia-spy-charges", "downloaded_at": "2019-10-25 23:52:06.382850+00:00", "title": "American held almost a year in Russia on spy charges says he's 'Mr. Bean, not James Bond'", "language": "en", "text": "A Moscow court extended the pre-trial detention of a former U.S. Marine who’s been locked up in Russia on espionage charges for almost a year.\n\nIn response, Paul Whelan likened himself more to the dopey buffoon that is the character Mr. Bean rather than the cunning spy that is James Bond.\n\n\"Russia says it caught James Bond on a spy mission. In reality, they abducted Mr. Bean on holiday,\" Whelan told the court Thursday, according to the BBC.\n\nWhelan, who has U.S., Irish, Canadian and British citizenship, was arrested while in Russia for a friend’s wedding last December on charges that he had received state secrets.\n\nHe denied the accusations and told the court he believed his arrest qualified as a “hostage situation,\" the BBC said.\n\nWhelan told AFP it's possible he's being held as a pawn in a potential prisoner swap between the U.S. and Russia. The Russian Foreign Ministry denied such claims.\n\nWhelan said the Russian government could also be retaliating for sanctions levied against Russia after its interference in the 2016 election.\n\nWhelan has repeatedly claimed he has been assaulted in jail and he believes his life is in danger there. He’s asked for a new judge and prosecutor on the case.\n\n“Evidence that I provided has been ignored. Questions of law are always decided in favor of the prosecutors and the FSB [security service],” Whelan told the judge, per the BBC.\n\nThe U.S. House of Representatives on Tuesday passed a resolution calling on the Russian government to provide evidence of wrongdoing or else release Whelan from prison. Rep. Haley Stevens, D.-Mich., introduced the resolution.\n\n“We have repeatedly asked the Russian government to provide Paul with a fair and transparent judicial process to no avail,” Stevens said, according to The Hill. \"The State Department has been unwavering in their work on Paul's behalf, especially [former] Ambassador [Jon] Huntsman. The Russian government has not provided timely updates about Paul's case.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nWhelan, the head of global security for a Michigan-based auto parts supplier, has said he was in Moscow to attend the wedding of a friend from the Marine Corps.\n\nWhelan said someone whom he considered a friend handed him a USB stick he believed contained vacation photos. Five minutes later, authorities stormed his hotel and arrested him -- the USB stick reportedly contained a list of names of those working at a classified security agency.\n\nIf convicted, Whelan faces up to 20 years in prison for espionage.\n\nHowever, with the investigation completed, Whelan’s legal team believes they have \"lots in their favor” in the files they’ve been given. Only the supposed “friend” of Whelan who handed him the flash drive testified against him.\n\nThe rest of Whelan’s Russian friends testified that they did not believe him to be a spy. The man testifying against Whelan “was a provocateur,” Whelan’s lawyer, Vladimir Zherebenkov, said.", "description": "Paul Whelan likened himself moreso to the dopey buffoon that is the character Mr. Bean than the cunning spy character that is James Bond.", "authors": ["Morgan Phillips"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/4b7e5fe5-1000-1.jpeg", "published_at": "2019-10-25"}