{"pub": "realclearpolitics", "url": "https://realcleardefense.com/articles/2019/10/30/victor_in_the_jungle_114823.html", "downloaded_at": "2019-10-30 11:57:24.616830+00:00", "title": "Victor in the Jungle", "language": "en", "text": "Victor Caro is back in the field. Readers who enjoyed Victor in the Rubble, a skewering of the constipated cultures of the CIA and al-Qaeda by former CIA Operations Officer Alex Finley, will be pleased to find she hasn't lost a step in her second outing. In Victor in the Jungle, Finley brings back her literary hero, CIA (sorry “CYA”) Officer Victor Caro, for another tour of duty, this time joined by his wife and son.\n\nIn the first novel, Victor had to not only fight global terrorism, but his own agency's bureaucracy, a corrupt senator, and a maniacal support officer who fought tirelessly to deny him a chair with proper lumbar support. Victor, posted in the fictional African nation of Pigallo, faced off with terrorist Omar al-Suqqit. Omar, whose local terrorist group was acquired by terrorist multinational The Core (once Omar filled out the online application form), traveled to Core HQ in Rubblestan, and was assigned to a terrorist operation in America. Victor was able to defeat the terrorist's plan with the help of FBI agent Vanessa, who later became his wife. A reading of Olivia Garard’s review of Victor in the Rubble sets the scene and tone for Finley’s first work.\n\nThis time, Victor has been given a well-earned break from Africa and Rubblestan, but finds himself in the thick of a different type of action in Guyandes, a thinly disguised Venezuela. This time around, Victor not only has to contend with drug cartels and a corrupt dictator, but must avoid other dangers, such as anacondas, piranha, and the State Department. Although Victor is no longer butting heads with his own agency, he must still struggle to execute policy while keeping a hilariously woke Assistant Secretary of State in the dark. This task is only complicated by a whistle blower, a Snowden-like leaker who exposes one of Victor's best sources in the name of openness and transparency and with the help of the freedom-loving Chinese government and the completely independent organization, the Committee for Clear and Candid Policy (CCCP).\n\nAlthough Victor and Vanessa are back, Victor is now surrounded by an entirely new cast of characters, such as his Casanova-ish station chief, informally known as Patron, deputy station chief and master report writer Mike, over-caffeinated rookie officer Adam, and Victor's reggaeton-loving fellow officer Wes. Together they have to deal with a dim-witted and corrupt leftist dictator who would seem like an over-the-top parody to anyone who hadn't paid any attention to Latin America for the last decade or so. Guyandes is ruled by President Evorez, a not-all-that-fictional version of Hugo Chavez. The incompetence of Evorez is surpassed only by his corruption, and he enriches himself enthusiastically while driving his country into poverty.\n\nThe book begins with Victor being sent quite literally into the jungle for a meeting with a source (designation VZSPARKLEPONY), who has information on the FPRT, a leftist guerrilla army in neighboring Tamindo, which found that the drug business was more lucrative than revolution. This mission is an especially bad time for Victor to learn that his new boss, deputy station chief Mike, is dangerously incompetent in the field.\n\nLife back in the capital also becomes more exciting, as Vanessa's introduction to her new home is marked by an attempted coup against Evorez. Even more nerve-wracking is her first meeting with the Lunch Bunch, a regular meeting of the embassy wives where they provide each other updates on potty training.\n\nVictor juggles his two main antagonists, the FPRT and Evorez, until the threads start to converge, with potentially disastrous consequences for both Guyandes and the U.S. But rather than sitting back and writing reports, the CIA station decides to take action, making the book not only a satire, but a legitimate spy thriller. I also cheered Finley's decision to get Vanessa into the game, as she was too valuable an asset to leave on the bench. The action ramps up to an exciting climax and a satisfying ending, although I had the rare experience of thinking the author could have let it go on a little bit longer.\n\nSatire can be a scalpel as well as a crowbar…\n\nFinley does not execute her satire with extreme prejudice. Instead, a running theme of both her novels is that stupidity is universal. It has no respect for nationality, religion, ideology, or economics. For every skewering of American bureaucracy, she has an even funnier take on the hilariously inept Evorez. Petty, unthinking, hidebound bureaucracy is as at home in the embassy personnel office as in the Guyandan DMV. Although the CIA is less frustratingly inept than in the first novel, our heroes are not completely free and clear. The bureaucratic mindset is everywhere.\n\nSatire can be a scalpel as well as a crowbar, and Finley wields it skillfully either way. Her chapter on the Lunch Bunch could be a standalone short story. Finley writes:\n\nOn the dining table Vanessa saw a spread of food and was shocked, not for how different it was, but how familiar: Doritos, Tostitos, Old El Paso salsa and jarred guacamole lined the table, along with bottles of Pepsi and a carton of Newman's Own Lemonade.[1]\n\nLater, she describes the table as looking \"like America had just vomited.\"[2]\n\nAlong with the deliberately insular Lunch Bunch moms, Finley has special scorn for Mike, the ticket-punching deputy station chief who we all know is headed for the top, despite having neither the skill or the inclination for any useful intelligence work. Mike is either unable or unwilling to discern between what is really important and what HQ considers a priority. He fits in well with the Lunch Bunch. Tellingly, all of Mike's stories of his tour in Baghdad are about the hard-partying lifestyle, not of the actual work, or of Iraq itself. America has built miniature Green Zones all around the globe.", "description": "Victor in the Jungle. Alex Finley. Smiling Hippo Press, 2019.\n\n\n\n\n\n\n\n\n\n\nBUY ON AMAZON\n\n\n\nVictor Caro is back in the field. Readers who enjoyed Victor in the Rubble, a skewering of the...", "authors": [], "top_image": "https://assets.realclear.com/images/49/492787_5_.jpg", "published_at": "2019-10-30"}