{"pub": "breitbart", "url": "https://breitbart.com/news/more-than-16000-flee-unrest-in-indonesias-papua", "downloaded_at": "2019-10-07 12:14:36.838922+00:00", "title": "More than 16,000 flee unrest in Indonesia’s Papua", "language": "en", "text": "Jakarta (AFP) – More than 16,000 scared residents have fled an unrest-hit city in Indonesia’s Papua region, the military said Monday, as one of the deadliest eruptions of violence in years sparked calls for an independent probe.\n\nSeveral dozen people were killed when violence broke out in Wamena city last month, with some victims burned alive when buildings were ablaze, and others stabbed in the chaos, according to authorities.\n\nSince mid-August, Papua has been hit by waves of mass protests and violence fuelled by racism against indigenous Papuans by Indonesians from other parts of the archipelago, as well as calls for self-rule in the impoverished region.\n\nThe majority of Papuans are Christian and ethnic Melanesian with few cultural ties to the rest of Muslim-majority Indonesia.\n\nOn Monday, the air force said about 11,400 people — mostly migrants — had been evacuated aboard military aircraft.\n\nSeveral thousand more have left aboard commercial aircraft since late September, it added.\n\nAlso Monday, Human Rights Watch called for a probe into 33 deaths during the Wamena riots to be led by the Southeast Asian country’s National Commission on Human Rights.\n\n– Sparked by racist comments –\n\n“The Indonesian government should also immediately allow the United Nations human rights office unfettered access to (Papua) to investigate the situation,” the rights group said in a statement.\n\nThe violence in Wamena was reportedly sparked by racist comments made by a local teacher towards students, but police have disputed that account.\n\nSince then, thousands of residents — both Papuans and non-Papuans — have been evacuated, as news of looming violence circulates on social media.\n\nHowever, there were signs that Wamena was returning to normal with many shops and schools reopened — although most students have stayed home — while government offices have also been operating since last week, according to an AFP reporter.\n\nIn August, protests broke out across Papua and in other parts of the country after the arrest, racial abuse and tear-gassing of dozens of Papuan students, in the city of Surabaya.\n\nMigrants have become an influential minority in Papua, moving there from other parts of the country in pursuit of opportunities in the mineral-rich region — home to the world’s biggest gold mine.\n\nA low-level separatist insurgency has simmered for decades in the former Dutch colony — which shares New Guinea island with the independent nation of Papua New Guinea — after Jakarta took over in the 1960s.\n\nA UN-sponsored vote to stay within the archipelago in 1969 was widely viewed as rigged, and Jakarta has long refused to consider another referendum.", "description": "Jakarta (AFP) – More than 16,000 scared residents have fled an unrest-hit city in Indonesia’s Papua region, the military said Monday, as one", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/07/890547_indonesian-military-has-evacuated-thousands-non-papuan-migrants-wamena-640x335.jpg", "published_at": "2019-10-07"}