{"pub": "cbc", "url": "https://cbc.ca/news/politics/key-moments-french-language-debate-1.5306941", "downloaded_at": "2019-10-03 08:33:02.535327+00:00", "published_at": "2019-10-03", "title": "Clashes over values, SNC-Lavalin and role of the Bloc at 1st French-language debate | CBC News", "language": "en", "text": "Four of the major party leaders sparred Wednesday night in a French-language debate that saw Liberal Leader Justin Trudeau try to paint his Conservative opponent as a man out of step with Quebec values.\n\nBloc Québécois Leader Yves-François Blanchet made an impassioned plea to Quebecers to send more separatist MPs to Ottawa to fight for the province's interests, while Conservative Leader Andrew Scheer urged voters to reject the Bloc's advances and elect Tories to make Trudeau a one-term prime minister.\n\nNDP Leader Jagmeet Singh said he'd fight for \"asymmetrical\" federalism to ensure Quebec's uniqueness is better represented in the federation. He promised to help the province better integrate newcomers into the dominant French culture so as to protect the language's place in Canada.\n\nThe debate, hosted by TVA, the most watched network in Quebec, was billed as a \"face-à-face\" — a chance for the leaders to debate one another directly.\n\nThe topics were wide-ranging and covered everything from the state of Ottawa's finances, climate change, the Quebec secularism law, protections for arts and culture and the place of francophones in Canada.\n\nScheer 'doesn't share our values': Trudeau\n\nTrudeau started the night on the offensive, trying to pin Scheer down on issues like same-sex marriage and abortion.\n\nHe repeatedly asked the Conservative leader to state clearly what his personal feelings are on these social issues.\n\n\"Answer me this — do you believe women have the right to choose? Yes or no,\" Trudeau said.\n\nTrudeau and Scheer spar on abortion in TVA debate (Courtesy of TVA)\n\nLiberal Leader Justin Trudeau presses Conservative Leader Andrew Scheer for his personal views on abortion and a woman's right to choose during the TVA French-language leaders debate Wednesday. 0:47\n\nScheer didn't answer, but repeated his promise that a Conservative government led by him would not reopen these divisive debates.\n\n\"You hide with each answer,\" Trudeau said. \"We are seeing that the three of us are aligned with the values of Quebecers and we have a fourth, a Conservative party, that is not aligned with either women's rights or LGBTQ rights.\"\n\nWhen asked about a Quebec court decision that found parts of both the federal and provincial medically assisted dying laws too restrictive, Trudeau said the current law on medical assistance in dying might be too limited. But he used the moment to hammer Scheer on opposing such a law in the first place.\n\nAt a post-debate press conference, Scheer said like many Quebecers, he is Catholic. (The church is opposed to abortion and assisted death on religious grounds.) But the Conservative leader said he will govern for all Canadians and it would be status quo on abortion and same-sex marriage rights.\n\nWatch: Scheer post-debate scrum (in English)\n\nConservative Leader Andrew Scheer said he'd need \"certainty\" before appealing Quebec's assisted death ruling and avoids answering why the Conservatives haven't purchased carbon offsets for the party's campaign plane following Wednesday's TVA debate. 2:10\n\nTrudeau said on these issues, but also on the fight against climate change, Scheer doesn't \"share our values.\" As for the Bloc, he said it will always be an opposition party.\n\n\"We need Quebecers in government to fight climate change,\" Trudeau said.\n\nSingh was asked about his views on Quebec's secularism law, which he has said he opposes but has also said he would not challenge as prime minister. In answering, Singh attempted to convince Quebecers he shared their values on several issues.\n\n\"Well, I said clearly that this law is discriminatory. I am opposed to discriminatory laws. I am in favour of laws that bring people together — we should always try to bring people together,\" Singh said in French. \"Mr. Blanchet wants to dwell on the past and on quarrels, but I am focusing on where people need help.\"\n\n\"Quebecers are sensitive to secularism, I understand that reality, it is a very strong tradition. I am in favour of the separation between church and state,\" Singh continued. \"And I am in favour of (choice) in abortion and the right to die with dignity. And I will defend those rights with all my strength.\"\n\nWatch: Singh post-debate scrum (in English)\n\nWhile speaking to reporters after the TVA debate, NDP Leader Jagmeet Singh calls Bill-21, Quebec's secularism law, \"really saddening.\" He also discusses what he would have done differently in regards to re-negotiating the new NAFTA agreement. 2:11\n\nTrudeau is a 'hypocrite': Scheer\n\nScheer landed a few punches of his own on Trudeau, saying the Liberal leader is a \"fraud\" on climate action because his party is the only one that is flying two gas-guzzling airplanes around the country as part of this election campaign.\n\nThe Liberal Party confirmed it has a second jet, saying it is used to ferry cargo and technical equipment from one destination to the next to give workers enough lead time to set up ahead of campaign events. A spokesperson said the party had the same arrangement in 2015.\n\nThe Liberals said they have purchased carbon offset credits to cover greenhouse gas emissions generated from both planes and the campaign's ground transportation. The Conservative party has not.\n\nWatch: Scheer calls Trudeau 'hypocrite' for 2 campaign planes\n\nAndrew Scheer calls Justin Trudeau a \"complete hypocrite\" for having two campaign planes, while Trudeau says unlike the Conservatives, his party bought carbon credits for their planes and buses, following Wednesday's TVA debate. 1:08\n\nIn a post-debate scrum, Scheer said the Conservative party will hold Trudeau to account for his \"hypocrisy,\" asking just how many \"props\" and \"costumes\" did Trudeau really need, a thinly veiled reference to Trudeau's 2018 India trip and to the recent blackface photos controversy.\n\n\"It's always the same with this guy. He's always really quick at giving lessons, and lectures and sermons on how everyone else should live their lives and when it comes to his own personal behaviour he's a hypocrite,\" Scheer said.\n\nSNC-Lavalin\n\nSNC-Lavalin, the Quebec engineering firm that has been at the centre of political debate in Ottawa for the better part of a year, was invoked a number of times Wednesday night.\n\nBlanchet attacked Scheer for his rhetoric during the political scandal and chastised him for not standing up for the company's Quebec workers. The Bloc leader has said thousands of jobs could be lost if the company is convicted on federal corruption charges related to its work in Libya. He said Ottawa should use all the powers at its disposal to protect Quebec companies and to keep the headquarters of major firms in the province.\n\nScheer said Trudeau, who is alleged to have inappropriately pressured former justice minister Jody Wilson-Raybould to sign a deferred prosecution agreement with the company, has undermined the independence of the country's judicial system.\n\nTrudeau defended his actions, saying he was only interested in protecting jobs in the province. Scheer said there is no evidence that any jobs would actually be lost if the company is eventually convicted.\n\nThe NDP leader rejected the jobs defence, saying Trudeau's handling of the SNC-Lavalin affair shows the Liberal party is beholden to corporate interests and the lobbyists that represent them.\n\nIn his closing remarks, Singh again tried to paint Trudeau as someone more attuned to the demands of the country's elite rather than the workers he claims to represent. Singh said Trudeau \"has surfed on his privilege all his life,\" whereas he, the son of working class immigrant parents, is \"a fighter, a real progressive.\"\n\nBloc fights for relevance\n\nBlanchet, a native Quebecer, and the leader with the best command of the French language, asked Quebecers to elect more MPs \"who resemble you. Who share your values. And who work for your interests, and only for the interests of Quebecers.\"\n\nBlanchet said the best way to ensure Quebec's voice is heard within Canada is to send more Bloc MPs to Ottawa, adding they would pressure the government of the day to send more shipbuilding work to Quebec's Davie yard.\n\nHe also said he'd force Ottawa to move to one tax return for Quebecers. Unlike other Canadians, Quebecers must file with both the province's tax collector and the Canada Revenue Agency.\n\nHe also said he wants to ensure the federal government doesn't intervene in a legal fight to end Quebec's secularism law, which forces public servants to remove religious garb while on the job.\n\n\"I am going to Ottawa to defend the right of Quebec to function in its own way,\" Blanchet said. \"I don't want to send people to Ottawa who want to undo what we are doing in Quebec.\"\n\nScheer tells Blanchet Quebec must elect Conservatives (Courtesy of TVA)\n\nConservative Leader Andrew Scheer tells BQ Leader Yves-Francois Blanchet only Conservatives can represent Quebec and defeat Trudeau; Blanchet says that means Conservatives have been \"useless\" for last 4 years, during Wednesday's TVA debate. 0:52\n\nWhen Scheer said it was the Conservative Party that finally recognized Quebec as a \"nation within a united Canada,\" gave the province its own seat at United Nations Educational, Scientific and Cultural Organization (UNSECO) and corrected a lingering fiscal imbalance, Blanchet said the Tories acted on these issues only after facing pressure from the Bloc.\n\nScheer spent much of the debate questioning the value of Bloc MPs.\n\nHe said, because they will never be able to form a government, a vote for the Bloc is a wasted vote because it will do nothing to get Trudeau out of office.\n\nThe Bloc has a lot of demands, \"but it's only us who can deliver them,\" Scheer said.\n\nWatch: Blanchet post-debate scrum (in English)\n\nBloc Québécois Leader Yves-François Blanchet discusses support for Bill 21, which party leader would best represent the province's interests and argues that his party is the only choice for Quebec voters following Wednesday's TVA debate. 1:53\n\nThe debate moderator, Pierre Bruneau, asked Blanchet to say how many laws Bloc MPs have passed over the last three decades.\n\nKnowing the answer is zero, Blanchet said Bloc MPs have served other functions.\n\nTrudeau said Quebecers are better represented when they have a seat at the table of government.\n\nWatch: Trudeau post-debate scrum (in English)", "description": "Four of the major party leaders sparred Wednesday night in a French-language debate that saw Liberal Leader Justin Trudeau try to paint his Conservative opponent as a man out of step with Quebec values.", "authors": ["Parliamentary Bureau", "John Paul", "J.P.", "Tasker Is A Reporter In The Cbc'S Parliamentary Bureau In Ottawa. He Can Be Reached At John.Tasker Cbc.Ca.", "Follow J.P. On Twitter"], "top_image": "https://i.cbc.ca/1.5306985.1570074713!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/pol-debat-elections-federales.jpg"}