{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/trump-posts-animated-video-of-himself-dancing-hugging-flag.html", "downloaded_at": "2019-10-01 04:28:27.828546+00:00", "title": "Trump Posts Animated Video of Himself Dancing, Hugging Flag", "language": "en", "text": "Photo: Twitter user @realPowerTie\n\nUsually if the president paints himself into a corner, he’ll flail out in spectacular fashion — tweeting excessively, or purging most of the executive suite of a cabinet-level department. On Monday, as Trump faced the great, unanticipated crisis of his presidency, he was, as usual, posting. But unlike the hostile online tone he has taken throughout his nascent impeachment crisis, Trump linked to something a little more contemplative: an animated video of some of his lighter and prouder moments, set to his Liberty University commencement speech from 2017.\n\nThe first scene shows Trump, in July 2017, placing a marine’s hat back on his head after a helicopter gust had knocked it off. The next snippet is from Trump’s extremely cursed appearance as an SNL host in November 2015, when he danced to a parody of “Hotline Bling,” followed by his September 2016 appearance on The Tonight Show when Jimmy Fallon ruffled his hair.\n\nAbout halfway through, it gets political, as the video includes Trump’s inauguration, and what appears to be a conversation with Chuck Schumer in which he is painted as a clown. (Satire’s early death has been exaggerated.) The video closes with a shot of a MAGA rally, and the incident at CPAC in March when Trump hugged the American flag. In faux-stop-motion, it almost looks like a touching moment, rather than the real-time shattering of a world leader’s mind.\n\nThe video — which looks like a pharmaceutical rep re-made the animated parts of a-ha’s “Take on Me” — was made by the user Power Tie, which at least explains why the president’s oversized red formal-wear appears so prominently. Assuming the clip has Trump’s approval, it’s a telling 45 seconds to highlight: Some of the TV president’s most joyous moments have occurred when he is performing the role of politician, but doesn’t have to do anything.", "description": "As Donlad Trump faces an impeachment inquiry, he posted a 45-second animated video of some of his lighter moments set to his 2017  University commencement speech. Those moments include going on Jimmy Fallon and SNL, and hugging the flag.", "authors": ["Matt Stieb"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/09/30/trump_dancing.w1200.h630.png", "published_at": "2019-10-01"}