{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7576245/Venus-NOT-covered-oceans-flowed-lava-study-finds.html", "downloaded_at": "2019-10-15 23:17:00.716444+00:00", "title": "Venus was NOT covered in oceans but flowed with lava. study finds", "language": "en", "text": "S cientists have been hopeful that the planet Venus was once home to an ancient ocean on what may have been an Earth-like surface – but a new study has suggested otherwise.\n\nRecent evidence has concluded that the highlands on the planet were not flowing with water, but rather molten lava.\n\nAfter re-examining rocks found the area, a team of experts have determined that what was first believed to be granite rocks are in fact basalt, which are formed by the rapid cooling of lava.\n\nScroll down for videos\n\nRecent evidence has concluded that the highlands (arrow) on the planet were not flowing with water, but rather molten lava\n\nThe recent discovery was uncovered by a team of scientists at the Lunar and Planetary Institute (LPI), including undergraduate student intern Frank Wroblewski from Northland College,from.\n\nThe group a re-examination of Venus' Ovda Regio highlands plateau, which they now believe was made up of basaltic lava – diminishing previous theories that Venus may have ones been Earth-like with an ancient ocean of liquid water.\n\nRadar data was used to re-map the Ovda Fluctus, the highlands on Venus, lava flow, which the team found was more likely made up of basalt rock, which can be formed with or without water.\n\n'We know so little about Venus' surface,' says team member Dr. Allan Treiman, a scientist at the LPI.\n\nAfter re-examining rocks found the area, a team of experts have determined that what was first believed to be granite rocks are in fact basalt, which are formed by the rapid cooling of lava. Pictured is the Ovda Fluctus lava flow which is found on top of Ovda Regio\n\nTHE ATMOSPHERE OF VENUS The Venusian atmosphere is comprised of 97% carbon dioxide, about 3% nitrogen and trace amounts of other gases. It famously contains a sprinkling of sulphuric acid which forms dense clouds and is a major contributor to its visible brightness when viewed from Earth. In fact the planet reflects some 75% of the light that falls onto it from the sun. This highly reflective cloud layer exists between 45km and 65km, with a haze of sulphuric acid droplets underneath down to about 30km. As such, an airship design would need to be resistant to the corrosive effect of this acid. Luckily we already have the technology required to overcome the problem of acidity. Several commercially available materials, including teflon and a number of plastics, have a high acidic resistance and could be used for the outer envelope of the airship. Considering all these factors, conceivably you could go for a walk on a platform outside the airship, carrying only your air supply and wearing a chemical hazard suit.\n\n'If the Ovda Regio highlands are made of basaltic rock as is most of Venus, they were likely squeezed up to their current heights by internal forces, possibly like mountains which result from plate tectonics on Earth.'\n\nThis work began in 2018 as part of the LPI's Summer Intern Program which brings competitively selected undergraduate students to Houston to do cutting-edge research with scientists from the LPI and the Astromaterials Research and Exploration Science (ARES) Division of NASA Johnson Space Center.\n\nLPI is operated by the Universities Space Research Association (USRA).\n\nThese results may change everything experts have believed about the second planet in our solar system, specifically computer images of Venus that were just released in 2016, which show how it may have looked billions of years ago\n\nThese results may change everything experts have believed about the second planet in our solar system, specifically computer images of Venus that were just released in 2016, which show how it may have looked billions of years ago.\n\nScientists at NASA's Goddard Institute for Space Studies (GISS) in New York used a model similar to the type used to predict future climate change on Earth to look into Venus' past.\n\n'Many of the same tools we use to model climate change on Earth can be adapted to study climates on other planets, both past and present,' said Dr Michael Way, a researcher at GISS and the paper's lead author.\n\nIf the Ovda Regio highlands are made of basaltic rock as is most of Venus, they were likely squeezed up to their current heights by internal forces, possibly like mountains which result from plate tectonics on Earth\n\n'These results show ancient Venus may have been a very different place than it is today.'", "description": "Scientists have been hopeful that the planet Venus was once home to an ancient ocean - but a new study has suggested otherwise.  Experts now believe the planet once flowed with lava, not water.", "authors": ["Stacy Liberatore For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/18/19752448-0-image-a-29_1571160534341.jpg", "published_at": "2019-10-15"}