{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/22-years-later-a-major-milestone-for-rpgs-is-finally-coming-west", "downloaded_at": "2019-09-17 10:38:27.993113+00:00", "title": "22 Years Later, A Major Milestone For RPGs Is Finally Coming West", "language": "en", "text": "Screenshot: Onion Games\n\nAmongst all the many, many games coming to Nintendo Switch soon, you should pay close attention to Moon, a port of a 1997 role-playing game for the PlayStation that’s never left Japan before.\n\nWhy should you care? Well, Moon was sort of the flashpoint from which a whole little community of unique, avant-garde Japanese game development studios was eventually born.\n\nIts developer Love-de-Lic was founded by several RPG creators who had just left the company Square, where they had worked on games like Chrono Trigger and Super Mario RPG. Moon was called an “anti-RPG.”\n\nIn short, its hero is a child who has to run around the world of a Japanese role-playing game after the “hero” has already rampaged through it, killing all of its wildlife for experience points, smashing everyone’s pots, and generally being a nuisance.\n\nThe minds behind Love-de-Lic eventually went on to found the development studios Skip, Vanpool, and Punchline, creating games like Chibi-Robo, Little King’s Story, the Tingle games for Nintendo DS, and many other games that shared a similar desire to upend the traditions and rethink the stories of role-playing games.\n\nBack in the day, Moon almost made it to the U.S. Its publisher ASCII reportedly devoted a “significant portion” of its booth at the 1997 E3 to what it called a “strange and twisted RPG” for the original PlayStation. But it cancelled the U.S. version of the game shortly thereafter, and it only came out in Japan.\n\nSoon, it’ll finally be playable in English, on the Switch. The English translation is being written at this very moment by Kotaku’s own Tim Rogers, who will have much more to say about Moon once he’s able.\n\nMoon will be released in Japan on October 11, and “soon” outside of Japan, according to an interview with one of its developers Yoshiro Kimura at last weekend’s Tokyo Game Show.", "description": "Amongst all the many, many games coming to Nintendo Switch soon, you should pay close attention to Moon, a port of a 1997 role-playing game for the PlayStation that’s never left Japan before....", "authors": ["Cecilia D'Anastasio", "Keza Macdonald"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/xwg4ywifx5dtw3yd2dig.jpg", "published_at": "2019-09-17"}