{"pub": "yahoo", "url": "https://news.yahoo.com/how-will-isis-leader-al-baghdadis-death-affect-the-war-on-terror-152614864.html", "downloaded_at": "2019-10-30 00:02:27.809880+00:00", "title": "How will ISIS leader al-Baghdadi's death affect the war on terror?", "language": "en", "text": "The 360 shows you diverse perspectives on the day’s top stories.\n\nWhat’s happening:\n\nPresident Trump on Sunday announced that American soldiers had carried out a raid in Syria that resulted in the death of the Islamic State terror group leader Abu Bakr al-Baghdadi.\n\n“Last night the United States brought the world’s No. 1 terrorist leader to justice,\" Trump said in a national address in which he described the details of the operation, including how al-Baghdadi died by igniting a suicide vest after being cornered by U.S. Special Operations forces.\n\nAl-Baghdadi led ISIS at the group’s peak when it controlled large swaths of territory in Iraq and Syria. He declared a caliphate in 2014, establishing a brutal system of theocratic rule.\n\nISIS gradually lost control over its territory in recent years and as the caliphate crumbled, al-Baghdadi had largely disappeared. Details of his location emerged after Iraqi intelligence officials captured one of his wives and a trusted courier, according to reports.\n\nWhy there’s debate:\n\nWhile there’s broad consensus that al-Baghdadi’s death is a positive development in the war on terror, there’s disagreement as to just how much it will affect ISIS operations. Some experts argue that he held a unique position in the group’s mythology that can’t be easily replaced. Al-Baghdadi’s death comes at a time when ISIS is splintered and has lost territory, which could hinder the group’s ability to unify behind a new ideological mission.\n\nOthers argue that his death won’t have a significant impact on ISIS’s operations. The group has become decentralized since losing its caliphate and no longer relied on al-Baghdadi’s leadership, experts say. His death could even “galvanize” these loosely associated cells, former Director of National Intelligence James Clapper warned. There are also fears that ISIS could see a resurgence, even without its leader, because of instability in the region driven by Trump’s decision to pull U.S. troops from northeast Syria and political unrest in Iraq.\n\nPerspectives\n\nMajor impact\n\nHis death robs ISIS of its figurehead\n\n“Al-Baghdadi was charismatic and competent, and whoever is named as his successor — like some of Baghdadi’s predecessors — may prove inept, unable to lead the caliphate’s remnants or inspire the new generation. And whatever the successor’s abilities, if he doesn’t want to share al-Baghdadi’s fate, he will need to hide and avoid communicating, and, thus, will face difficulties rebuilding his organization.” — Daniel Byman, Lawfare\n\nAl-Baghdadi’s symbolic power may mean he’s irreplaceable\n\n“Baghdadi is significant because he declared himself the caliph and the head of a caliphate that was a rallying cry for tens of thousands of extremists around the world. That will be hard to replace.” — Former U.S. antiterrorism envoy Brett McGurk to New Yorker\n\nHis death undermines the group’s recruitment pitch\n\n“His death is another strike against ISIS’s purported legitimacy, leaving it less able to claim to be any different from other violent extremist groups.” — Michael Safi, the Guardian\n\nA series of major defeats may mean ISIS is too weak to recover\n\n“That the Islamic State can easily survive the loss of its top leader is not as straightforward a proposition as seems to be widely believed. Mr. al-Baghdadi’s death, almost exactly seven months after the obliteration of the physical caliphate he built, comes at an exceptionally bad time. The organization is still struggling to recover from the collapse of its caliphate and the deaths of many top leaders. It is fragile, caught somewhere between being a proto-state and a full-fledged insurgency.” — Hassan Hassan, New York Times\n\nLimited impact\n\nISIS is strong enough to endure al-Baghdadi’s death\n\n“There was definitely a time when killing Baghdadi could’ve stopped ISIS’s rise. ... But I do think that the organization has moved well past Baghdadi in the same way that al-Qaeda moved past Osama bin Laden, to some extent. At this point — seven-plus years after the rise of ISIS — his death is far from a fatal strike against the organization.” — Former U.S. National Counterterrorism Center director Michael Leiter to Vox\n\n“Yet, despite what seems like good news, there are many indicators that Trump’s war on terror is short-sighted, un-strategic, and will — ultimately — increase threats from terrorism.” — Peter R. Neumann, Politico", "description": "Will the death of ISIS leader Abu Bakr al-Baghdadi have a major impact on the war on terror? Can the world's most feared terrorist endure without their figurehead or has it been crippled?", "authors": ["Mike Bebernes"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Q8rQo34278Ct_VBMJUZFEw--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/b16d2cb0-fa5f-11e9-aa7f-6031a06c028a", "published_at": "2019-10-29"}