{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/safra-catz-ceo-oracle-team-mark-hurd-2019-10", "downloaded_at": "2019-10-20 17:01:00.663304+00:00", "title": "Oracle must decide quickly if Safra Catz really needs an exec to step up as her new co-CEO", "language": "en", "text": "Once Oracle and the tech industry finishes mourning the untimely death of Mark Hurd, the database giant has some big decisions to make.\n\nFor the last several years, Oracle has successfully run under a triumvirate, with CEO Safra Catz running finance, cofounder and CTO Larry Ellison running engineering/product, and CEO Hurd running Oracle's enormous sales and marketing machine.\n\nCatz is more than qualified to run the company by herself. The question is: does she want to?\n\nLarry Ellison has previously said that he would provide Oracle's board with a list of five internal candidates who could step up and take Hurd's place, and even tossed out some names.\n\nBut while there are plenty of executives who helped Hurd run pieces of his job, no one person has all the qualifications, an insider tells us.\n\nClick here for more BI Prime stories.\n\nWhile the IT industry is mourning the death of CEO Mark Hurd at age 62, the sad truth is that, as a global company, Oracle must quickly push on. What will it do without Hurd, who was playing a crucial role at the company at a pivotal time?\n\nFirst things first: Safra Catz has to decide if she wants to continue on as sole CEO.\n\nNow read: Larry Ellison's email to employees honored the memory of 'brilliant and beloved' Oracle CEO Mark Hurd\n\nCatz is only 57, and has been on Oracle's board of directors since 2001. She's the financial genius at Oracle — the one who finds a way to profitably execute founder and CTO Larry Ellison's vision, whether that's a multi-billion hostile takeover or dozens of pricey new data centers. For that reason, she's been called \"the enforcer.\"\n\nFor decades she has historically led finance, M&A, human resources and legal at Oracle, with Hurd in charge of the massive sales and marketing apparatus.\n\nAs one of Oracle's long-time execs who helped orchestrate its dominance in the tech world, she is perhaps more intimately knowledgeable of all of Oracle's moving parts than anyone except Ellison himself. While she's perfectly capable of running Oracle with Ellison, as they did for years before Hurd arrived, it's not clear if she wants to.\n\nShe's previously said she loved the three-headed executive setup that's been in place since Hurd joined the company as co-president in 2010.\n\nFor instance, back in 2015, she told reporters at a rare press conference: \"As co-CEO, we have so much fun. Whenever I'm away, I miss our crowd, Larry and Mark. I was so excited to see Mark one day, I gave him a big hug.\"\n\nOracle CEO Mark Hurd, who passed away at age 62 in October. Justin Sullivan/Getty Images\n\nHurd was the operations guy, running sales, customer and technical support, business development, marketing, and —known as a cost-cutter — he kept watch over business unit revenue, a source tells us.\n\nEllison is the visionary, overseeing engineering and product development and is still the buck-stops-here decision maker.\n\nBut Catz has always been fiercely private and has avoided the spotlight. The downside to being sole CEO is the increased visibility it brings. Hurd was the one to appear on the business shows, to do the press interviews, to speak on stage, or to schmooze large gatherings of customers.\n\nAnd this is a critical time for the company as it makes the leap from traditional IT hardware/software vendor into cloud computing. If it fails, Oracle will find itself a relic at best, or at worst, a goner like EMC or Digital Equipment Corp.\n\nLast month, after Hurd took medical leave, Ellison said that he was sending the board of directors a list of five internal candidates who could be named CEO with her if Hurd could not resume his duties.\n\nIt won't be Ellison\n\nAt the time, Ellison said that he himself was not interested in the CEO job again.\n\nOracle chairman, CTO Larry Ellison Business Insider/Julie Bort He named two possibilities for that short list: Steve Miranda, executive vice president of Oracle Applications product development, who's been with the company since 1992; and Don Johnson, vice president of Oracle Cloud Infrastructure and product development.\n\nRead more: Larry Ellison is giving Oracle's board 5 internal candidates to be considered as the next CEO\n\nBut one person familiar with these executives told Business Insider that their backgrounds are more technical, and that they specialize in R&D and engineering. Hurd's job was on the sales and marketing side.\n\nDave Donatelli might have the chops for the role, a former employee tells us. He's been running Oracle's all-important cloud business, including product marketing and business development, reporting to Hurd, Prior to that, Donatelli was at HP, a general manager responsible for HP's enormous enterprise equipment business. But he really spent most of his career at EMC, before going to HP.\n\nDonatelli was, at one time, rumored to be on the short list for CEO of HP after Hurd resigned that job. But he's never been a CEO, much less of an organization as large and complex as Oracle which makes everything from computer chips to open source software.\n\nA former Oracle employee also points out that Judy Sim, who has been leading Oracle's marketing and PR for a long time, could also help Catz or another chief exec lighten the load — but her background doesn't include the more complicated areas of Hurd's purview, like developing sales compensation plans and incentives.\n\nHappier investors\n\nWhether or not they're tapped to become CEO, having those executives around means that Catz could very well have the support she needs to go solo, should she be willing to handle the increased visibility.\n\nAnd if Catz decides to go it alone, Oracle's investors may be happy about it.\n\nShareholders have grumbled for years over how much Oracle pays its top heavy executive suite, with a long history of voting \"no\" on the annual advisory vote on CEO pay. Oracle was also named the No. 2 on the list of companies with the most overpaid CEOs by governance watchdog group As You Sow.\n\nBut one thing's for certain: Oracle needs to decide and let the world know, or it will face endless questions from employees, investors and customers about its leadership plans.", "description": "Insiders name some of the team that could help Oracle's Safra Catz lead alone, if the company decides that it doesn't need a new co-CEO.", "authors": ["Julie Bort"], "top_image": "https://image.businessinsider.com/5daa351fcc4a0a78352b4833?width=1200&format=jpeg", "published_at": "2019-10-20"}