{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/brexit-boris-johnson-northern-ireland-sea-border-checks-steve-barclay-latest-a9167651.html", "downloaded_at": "2019-10-23 15:13:16.275305+00:00", "title": "Brexit: Boris Johnson accused of misleading parliament after saying there would be 'no checks' between Northern Ireland and Britain", "language": "en", "text": "Boris Johnson has been accused of misleading parliament after he claimed there would be \"no checks\" between Northern Ireland and Britain after Brexit.\n\nThe prime minister directly contradicted the Brexit Secretary, Steve Barclay, who admitted on Tuesday that Northern Ireland businesses will be forced to fill out export declaration forms when sending goods to Britain under the terms of the new Brexit deal.\n\nHis claim was also at odds with Julian Smith, the Northern Ireland secretary, moments earlier, who told a Commons committee there would be checks but they would be kept at a \"minimal\" level.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nUnionists have reacted with fury to details of extra costs and customs checks for businesses in Northern Ireland under Mr Johnson's new Brexit plan, with DUP MPs describing the plan as \"absolutely despicable\".\n\nThe row centres on trade between Northern Ireland and Great Britain, with HRMC estimating that businesses could be charged between £15 and £56 for export declaration forms.\n\nDuring a prime minister's questions exchange with Labour leader Jeremy Corbyn, Mr Johnson said: \"The UK is preserved whole and entire by these arrangements and indeed the whole of the UK will be allowed to come out of the EU customs union so we can do free trade deals together.\n\n\"There will be no checks between Northern Ireland and Great Britain and there will be no tariffs between NI and GB.\"\n\nLabour MP Stephen Doughty said: \"Surely Johnson just misled the house there...?\n\n\"He claimed there would be “no checks” between NI and GB. Barclay admitted the complete opposite.\"\n\nThe prime minister's spokesman described the plans as a \"minimal administrative process\" when pressed by journalists on Mr Johnson's comments.\n\nHe said: \"The fact is that Northern Ireland is and will remain in the UK customs territory.\n\n\"The deal explicitly allows the UK to ensure unfettered market access to goods moving from Northern Ireland to GB. We don't intend to carry out checks on the movement of goods.\n\n\"There will be a minimal administrative process provided electronically.\"\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nThe row after Mr Barclay told peers on Tuesday: \"Just to be clear, exit summary declarations will be required in terms of NI to GB\".\n\nOn Wednesday, Mr Smith tried to reassure unionists that Northern Ireland will be \"out of the European Union, out of free movement rules, out of the EU budget, out of fisheries policy, out of the common agricultural policy and free to do trade deals\".\n\nShape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty\n\nHowever he admitted there would be checks, saying: \"We're talking about a very limited set of goods areas and on that I am going to be working with Northern Ireland businesses and political parties to make sure that the government is minimising any challenge between NI and GB.\"\n\nPressed on what those checks will be, Mr Smith responded: \"There will be some information required but it's a minimal amount.\"\n\nDUP MP Ian Paisley told him: \"I have to go out and tell businesses in my constituency that I don't know what you have to do to carry out £18 billion worth of trade with our country, our country, not a foreign country ... you want me to vote for this? You can't be serious.\"\n\nMr Smith replied: \"We have got our own commitments we are going to put into the withdrawal agreement bill to deliver unfettered access from GB to NI. We'll be looking at communication technology and we'll be making sure we support Northern Ireland businesses.\n\n\"We will be fully committed to making sure that business transaction, the movement of those goods will be as easy and straightforward as we can do. It's obviously in the government's interests that's the case.\"\n\nBut Mr Paisley hit back at the minister, saying he would feel \"pretty aggrieved\" if he had to fill in a form to move goods from his constituency in North Yorkshire to London.\n\nJim Shannon, another DUP MP, branded the Brexit deal \"absolutely despicable\" and worse than Theresa May's withdrawal agreement.", "description": "Boris Johnson has been accused of misleading parliament after he claimed there would be \"no checks\" between Northern Ireland and Britain after Brexit.", "authors": ["Lizzy Buchan"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/23/12/boris-johnson-pmqs-4.png", "published_at": "2019-10-23"}