{"pub": "chosun", "url": "https://english.chosun.com/site/data/html_dir/2019/10/11/2019101101349.html", "downloaded_at": "2019-10-11 05:10:02.027912+00:00", "title": "N.Korea Threatens to Resume Long-Range Missile Tests", "language": "en", "text": "North Korea declared a moratorium on nuclear and long-range missile tests since it began talks with the U.S. last year, which U.S. President Donald Trump has touted as his biggest diplomatic achievement.\n\nThe official [North] Korean Central News Agency quoted a statement by a Foreign Ministry spokesman as saying, \"There is no guarantee that all our patience would continue indefinitely.\"\n\nNorth Korea on Thursday threatened to resume intercontinental ballistic missile tests after six European countries condemned its recent test of a submarine-launched ballistic missile.\n\nThe UN Security Council, \"which champions fairness and equity picks fault with the just measure belonging to our right to self-defense, while keeping mum about the test-fire of Minuteman 3 intercontinental ballistic missile recently conducted by the U.S.,\" which was \"a grave provocation\" against Pyongyang, the spokesman said.\n\nNorth Korea walked out of recent working-level talks in Sweden and complained that Washington, \"which begs for working-level negotiations with [North Korea] and says... that the results of the talks were positive even though they broke off the negotiations empty-handed, has turned around and encouraged its followers to issue a statement condemning us.\"\n\nA propaganda film shown on North Korean state TV on Wednesday extolled earlier ICBM launches.\n\nThe U.S. and South Korea are bracing for possible provocations by North Korea marking the anniversary of the Workers Party this week.\n\nAircraft Spots, a website that tracks the movements of military aircraft, said the Joint STARS reconnaissance plane took off from Kadena Airbase in Okinawa, Japan on a mission over the Korean Peninsula. Another U.S.' surveillance plane, the RC-135C Cobra Ball, also reportedly conducted a mission along the Korean east coast early this week.", "description": "N.Korea Threatens to Resume Long-Range Missile Tests", "authors": [], "top_image": "http://english.chosun.com/site/data/img_dir/2019/10/11/2019101101329_0.jpg", "published_at": "2019-10-11"}