{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7602691/Lindsay-Lohan-sends-Tyga-flirty-message-Instagram-jets-Sydney.html", "downloaded_at": "2019-10-23 09:10:59.690434+00:00", "title": "Lindsay Lohan sends Tyga a flirty message on Instagram after he jets into Sydney", "language": "en", "text": "Lindsay Lohan was recently in Sydney filming The Masked Singer Australia.\n\nAnd on Tuesday, the 33-year-old actress left a flirty comment on rapper Tyga's Instagram account after he announced his arrival in the Harbour City.\n\nAfter Tyga shared several photos of himself on a luxury yacht in Sydney Harbour, the Mean Girls star commented, 'Copycat', alongside a laughing emoji.\n\n'Copycat!' On Tuesday, Lindsay Lohan left a flirty comment on rapper Tyga's Instagram after he announced his arrival in Sydney, where she had recently filmed The Masked Singer Australia\n\nLindsay's comment has received almost 700 reactions, but Tyga is yet to respond.\n\nIn one of his photos, the ex-boyfriend of Kylie Jenner can be seen standing on a yacht and looking into the distance.\n\nIn another snap, the Rack City hitmaker, 29, poses for the camera wearing a white T-shirt and a silver chain necklace.\n\nCheeky! After Tyga shared several photos of himself on a luxury yacht in Sydney Harbour, the Mean Girls star commented, 'Copycat', alongside a laughing emoji\n\nTyga's outing comes after he left concertgoers outraged by walking off stage just 15 minutes into his set in Wollongong on Sunday night.\n\nFans paid up to $90 each to attend the event but Tyga didn't begin his performance until half an hour after his scheduled start time.\n\nHe was expected to go onstage at 11.15pm but didn't make an appearance until 11.45pm. By midnight, he had called it quits.\n\nLiving the high life! In one of his photos, the ex-boyfriend of Kylie Jenner can be seen standing on a yacht and looking into the distance\n\nHe is currently touring Down Under and has jetted to New Zealand for a performance at Hip Hop in the Park on Wednesday.\n\nTyga will return to Australia for concerts at Sydney's Hordern Pavilion on Thursday and Melbourne's Margaret Court Arena on Friday.\n\nDaily Mail Australia has contacted Tyga's representatives for comment regarding the concert in Wollongong.", "description": "Lindsay Lohan was recently in Sydney filming The Masked Singer Australia.", "authors": ["Mary Mrad For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/00/20061016-0-image-a-23_1571787011356.jpg", "published_at": "2019-10-23"}