{"pub": "afr", "url": "https://afr.com/companies/mining/bhp-hopes-renewables-push-will-help-it-cash-in-on-copper-20191018-p531vd", "downloaded_at": "2019-10-19 10:52:36.889947+00:00", "title": "BHP hopes renewables push will help it cash in on copper", "language": "en", "text": "\"There are a lot of things that have to play out in the world of copper as to how that supply will be met, and what kind of price levels will be necessary to trigger that supply,\" he told reporters in London after the AGM.\n\nHe anticipated challenges in finding new ore bodies in countries with stable government and receptive communities. There were also risks in handling the tailings sensitively, and in ensuring successful block caving.\n\nSo a company like BHP is well-positioned, he said, because it had good existing mines where the communities were receptive and water scarcity issues had been dealt with through renewable-powered desalination.\n\nThis represented \"a potentially quite advantageous position, because there are so many question marks politically, above ground as well as below ground, about greenfields copper supply\".\n\n\"If you have good copper deposits and you're good at copper this is one of the most attractive businesses for BHP to invest in for the long term,\" he said.\n\n\"That's why ultimately we want to make a success out of Olympic Dam, and why we will of course continue to push the technology in places like Escondida so that we can mine lower grade at appropriate cost and still maintain the volumes we're getting there.\"\n\nHe said the question of whether Olympic Dam would have a desalination operation like that in Chile depended on how big the mine got, but \"clearly when we were talking about open-pit, [we were] assuming we build a similar desalination operation to the one we have in Chile right now\".\n\nAdvertisement\n\nMr Mackenzie said the role of copper in the shift to renewables meant \"mining is the locomotive of the green future\".\n\nThe company's annual report said BHP in 2019 \"continued to review other jurisdictions and opportunities to partner with third countries to counter the increasing exploration maturity of our existing geographies\".\n\nThis included the acquisition of an 11.2 per cent stake in Solgold Plc and also a joint venture with Luminex, both in Ecuador; and a 5 per cent interest in a Canadian junior company working in Quebec. BHP is also working with Riverside Resources to \"access new search spaces\" in Mexico.\n\nResource assessment expenditure on copper rose 12.5 per cent to $US126 million ($187 million) in 2019, and greenfield exploration spending climbed almost 17 per cent to $US62 million.\n\nBHP's copper production generated earnings before interest, tax, depreciation and amortisation of $US4.6 billion in 2019, making up 19 per cent of the company's underlying EBITDA. That was a bigger contribution than from petroleum or coal, but well below the $US11.1 billion earned from iron ore.\n\nThe company reported that the average copper price across 2019 was $US2.80 a pound, 9 per cent lower than a year earlier.", "description": "CEO Andrew Mackenzie said the role of copper in the shift to renewables meant \"mining is the locomotive of the green future\".", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_4.5152%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_108/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/311d2ded8c3dabe25dec718dbf506463d8c49b21", "published_at": "2019-10-18"}