{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/there-are-now-100-hidden-action-figures-to-find-and-collect-in-gta-online", "downloaded_at": "2019-09-08 23:26:58.441686+00:00", "title": "There Are Now 100 Hidden Action Figures To Find And Collect In GTA Online", "language": "en", "text": "The world of Grand Theft Auto Online is filled with crime, action, and destruction. Often players are given jobs that involve robbing banks, assassinating enemies, stealing cars or blowing up drug dens. But in the latest GTA Online update, players have a decidedly more mundane task: Collect 100 action figures for a toy collector.\n\nTo start this quest, simply log into the GTA Online and wait for a text from a man who owns a local comic book store. Someone stole all his action figures and he needs you to collect them and bring them all back. If you are wondering how a comic store owner got hold of the phone number of a huge criminal, he’s a friend of Lester, who provides jobs for players. Los Santos really is a small world after all.\n\nWhile the toys were just added earlier this week, dedicated players have already found all 100 figures and discovered what rewards you earn for spending a few hours searching the map.\n\nFor each figure you find, you’ll earn $US1000 ($1,460) and 1000 RP points. After you find all of them, you will earn another $US50k and a new outfit.\n\nThe new outfit is based on the in-universe superhero, Impotent Rage. The new outfit also comes with a new hair cut. Wearing both of these new cosmetics lets players pull off a solid Impotent Rage cosplay.\n\nNow, does anyone actually want to play GTA Online while looking like Impotent Rage? Maybe a few? Some fans are having fun with the new outfit.\n\nPersonally, I would have been happier with more money or suit made out of the 100 action figures.\n\nIf you want to go searching for action figures in GTA Online, you can use various maps and videos that players have put together showing where to find each collectible and the most efficient order to collect them in. Get your car or helicopter or jetpack ready and go collect some toys.", "description": "The world of Grand Theft Auto Online is filled with crime, action, and destruction. Often players are given jobs that involve robbing banks, assassinating enemies, stealing cars or blowing up drug dens. But in the latest GTA Online update, players have a decidedly more mundane task: Collect 100 action figures for a...", "authors": ["Beth Elderkin", "Joshua Rivera"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/o8kn7pfgeqo7yjzm80xh.jpg", "published_at": "2019-09-08"}