{"pub": "yahoo", "url": "https://news.yahoo.com/johnson-brief-cabinet-opponents-divided-093058147.html", "downloaded_at": "2019-10-13 12:23:54.477478+00:00", "title": "Johnson to Brief Cabinet as Opponents Divided: Brexit Update", "language": "en", "text": "(Bloomberg) -- U.K. Prime Minister Boris Johnson will brief his Cabinet later Sunday on progress toward his proposed Brexit deal, as opponents in parliament remain divided over their strategy to prevent Britain from crashing out of the European Union this month.\n\nOpposition leader Jeremy Corbyn said the Labour Party will look at the details of the deal before moving to trigger an election and will work with others to block a no deal divorce, even as Liberal Democrat leader Jo Swinson ruled him out as an interim prime minister in any government of national unity.\n\nKey Developments:\n\nEU government envoys are tentatively scheduled to be briefed on the outcome of the negotiations at 5 p.m in BrusselsOfficials from the group have said Boris Johnson indicated a possible path to detailed talks on a deal to exit the bloc as a potential compromise over the Irish border starts to emergeCorbyn stood firm on the need for Johnson to request an extension if negotiations falter and on his right to lead any alternative governmentBrexit will feature heavily when the government outlines its priorities at the State Opening of Parliament on Monday, alongside domestic measures including a plan to scrap Britain’s rail franchise system as early as next year and simplify fares\n\nJohnson’s Plan is ‘Race to Bottom’ Says Sturgeon (10:00)\n\nScottish First Minister Nicola Sturgeon told the BBC’s Andrew Marr Show that she won’t vote for the type of deal Johnson is negotiating.\n\n“The proposals that are on the table from Boris Johnson and any likely amendment of them would not be acceptable to the SNP because they would take Scotland out of the EU, out of the single market, out of the customs union with all the damage that would cause,” the Scottish National Party leader said.\n\nPatel Says Government Faces Key Week for Negotiations (09:30)\n\nHome Secretary Priti Patel said in a BBC interview that negotiations have “moved on quite substantially” in recent weeks, ahead of a summit of EU leaders that begins Thursday. Speculation that Britain will avoid dropping out of the EU without a divorce accord lifted the pound last week to its biggest two-day gain in a decade.\n\n“Obviously this is the week in the run-up to the European council where there are a range of negotiations taking place even as we speak,” she said. “The government’s number one priority is to secure a deal and obviously then bring forward the legislation in parliament through votes and a legislative framework through a potential Withdrawal Agreement bill so we can get Brexit done.”\n\nShe dismissed Labour’s stance, describing Corbyn’s rejection of the deal without knowing its contents as “clearly playing politics.”\n\nRees-Mogg Says Brexit Talks ‘Take’ More Serious Turn (08:10)\n\nLeader of the House of Commons Jacob Rees-Mogg said the Cabinet will be briefed at 12:45 p.m. London time after a more positive week in negotiations. Johnson will not undermine the integrity of the U.K. in his pursuit of a deal, he told Sky News.\n\nParliament can legislate quickly if required and “endless extensions” won’t solve matters, he said.\n\nSeparately, Rees-Mogg sought to reassure hard line supporters of Brexit concerned about the content of his plans and who could prevent a Oct. 31 exit by refusing to support it. Writing in the Sunday Telegraph, he said that “as a Leaver, Boris can be trusted.”\n\nJohnson, Corbyn Unfit to Lead Country, Swinson Says (07:55)\n\nSwinson reiterated the Liberal Democrats’ desire to revoke Article 50 and said they would support amendments that bring the country closer to a second referendum on the issue. She told Sky that it was entirely possible that her party could win a majority at the next election.\n\nThe Democratic Unionist Party deputy leader Nigel Dodds has also rejected any Brexit solution that would weaken Northern Ireland’s custom ties to the U.K., La Repubblica reported Saturday, citing an interview during a NATO conference in London.\n\nCorbyn to Look at Deal Before Triggering Election (07:40)\n\nCorbyn said he was unlikely to support any deal agreed by Johnson and would caution other lawmakers against doing so, but said his party would look at it before triggering a general election. If the Prime Minister fails to request an extension to talks in the absence of an agreement, Labour will take parliamentary action, he said in an interview on Sky News’ Ridge on Sunday.", "description": "(Bloomberg) -- U.K. Prime Minister Boris Johnson will brief his Cabinet later Sunday on progress toward his proposed Brexit deal, as opponents in parliament remain divided over their strategy to prevent Britain from crashing out of the European Union this month.Opposition leader Jeremy Corbyn said the", "authors": ["Lucy Meakin"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-13"}