{"pub": "washingtonpost", "url": "https://washingtonpost.com/podcasts/post-reports/trump-awards-a-massive-government-contract--to-himself-1?tid=aud_hpmid_postreportslnch", "downloaded_at": "2019-10-19 11:15:38.174531+00:00", "title": "Trump awards a massive government contract – to himself", "language": "en", "text": "David Fahrenthold scrutinizes the president’s decision to award a major government contract — to himself. U.S. star Rose Lavelle discusses the future of women’s soccer. And Sonia Rao shares what indie studio A24 is doing right.\n\nPost Reports is the daily podcast from The Washington Post. Unparalleled reporting. Expert insight. Clear analysis. Everything you’ve come to expect from the newsroom of The Post -- for your ears.\n\nWhen a ‘crazy rumor’ becomes reality\n\nPresident Trump on Thursday awarded the 2020 Group of Seven summit of world leaders to the Trump National Doral Miami golf resort in Florida, using his public office to direct a major contract to himself.\n\n\n\n\n\nTrump’s Doral resort has been in sharp decline in recent years, according to the Trump Organization’s records. The G-7 summit will draw hundreds of diplomats, journalists and security personnel to the resort during June — one of its slowest months of the year.\n\n\n\n\n\n“Even if they just charge the government their costs, it’s still a huge win for them because this is a time of year that the hotel is normally 60 percent empty,” says reporter David Fahrenthold , who covers the Trump family and its business interests. “They’re able to pay costs they would otherwise eat.”\n\n\n\n\n\nBut is it legal?\n\n\n\n\n\n“The constitution says that the federal government can’t pay the president any money beyond the salary he receives as president and that foreign governments can’t pay the president money unless Congress approves,” Fahrenthold says. “This is a case where Trump is inviting both the federal government and foreign governments to pay him money all at the same time.”\n\n\n\n\n\nMore on this topic:\n\n\n\n\n\nWomen’s soccer sees a renaissance\n\nOver the summer, the U.S. women’s national soccer team took home its fourth World Cup championship. The women on the team were widely lauded not only as titans of the sport but as legends elevating women’s rights and the sport of soccer globally.\n\n\n\n\n\nRose Lavelle is a breakout star from the World Cup. She tells guest host Nicole Ellis that this renaissance in the sport is not “a moment but a movement.”\n\n\n\n\n\nAt 24, Lavelle is widely considered to be the future of women’s soccer. The midfielder for the Washington Spirit, part of the National Women’s Soccer League, was awarded the bronze ball for third-best player in the World Cup tournament.\n\n\n\n\n\n“I think we've seen a big bump after the World Cup, and I think now it's just about maintaining that and making sure this isn't just an every-four-years type of thing,” Lavelle says. “It's an every-year, every-day kind of thing.”\n\n\n\n\n\nMonths after the World Cup and the team’s victory tour, momentum and enthusiasm for women’s soccer has kept ticket sales and TV ratings up. But reporter Steven Goff says that, in terms of the NWSL, “you know it needs to grow and it needs to invest more money in its players.”\n\n\n\n\n\nThe Washington Spirit’s head coach, Richie Burke, says that while he’s “new to the movement,” a lot of investors are looking at women’s soccer as “a sleeping giant.”\n\n\n\n\n\nMore on this topic:\n\n\n\n\n\nThe studio making money by breaking Hollywood’s rules\n\nA24 isn’t like other film production houses.\n\n\n\n\n\n“They’re the studio that everyone wants to work with,” says pop culture reporter Sonia Rao . “But at the same time, they’re the studio the random kid in your film class would be so into, and you’re like: ‘That’s so annoying. Stop talking about this. We all appreciate the studio.’ You know what I mean?”\n\n\n\n\n\nAnd whatever it is doing differently — such as affording filmmakers a lot of autonomy and using social media promotion more effectively than other distributors — it’s definitely working, Rao says.\n\n\n\n\n\nMore on this topic:", "description": "David Fahrenthold scrutinizes the president’s decision to award a major government contract — to himself. U.S. star Rose Lavelle discusses the future of women’s soccer. And Sonia Rao shares what indie studio A24 is doing right.", "authors": [], "top_image": "https://www.washingtonpost.com/pbox.php?url=https://podcast.posttv.com/podcast/20191018/t_1571420226264_name_M4XMSPIBMBGZHH3X5HPPLFTKPU.jpeg&w=1484&op=resize&opt=1&filter=antialias&t=20170517", "published_at": "2019-10-18"}