{"pub": "nymag", "url": "https://nymag.com/strategist/article/best-womens-pajamas-amazon.html", "downloaded_at": "2019-09-12 07:12:41.656679+00:00", "title": "The Best Women’s Pajamas on Amazon, According to Hyperenthusiastic Reviewers", "language": "en", "text": "AMiERY Women’s Comfy Casual Pajama Pants\n\nThese polyester-blend pajama pants have over 1,500 five-star reviews, with hundreds of them calling them very soft and comfy. “I really love these pants. The material is thin and somewhat stretchy, and they are very comfortable,” says a reviewer. This reviewer agrees, writing, “The feel of the fabric is incredible.” Customers like that they are lightweight but durable, as this reviewer notes: “They are super soft and nice and lightweight. But they are also hardy. I’ve basically been wearing these daily for the last week and thrown in the wash several times since then and there’s been no shrinking or fading or threading. They’re holding up splendidly.” They don’t seem to shrink, either: “I am obsessed with these pants. They are so comfortable I put them on every night after work. The biggest selling point, they didn’t shrink when I washed them.” Reviewers also like the prints the pants come in: “These pants are absolutely amazing; they are SO ridiculously soft and comfy, and the print is very pretty, too.” This reviewer even considers wearing them outside of the house: “I know they’re intended to be more of a lounge pant, but the print is so beautiful I think I want to dress them up.” Some reviewers say that the pants also make their butts look good: “BONUS: they definitely hug my curves and make my butt look AMAZING.” Says another, “They do make the booty look good. I have received so many compliments for them, and have had others ask where I got them.”", "description": "We found the best women’s pajamas on Amazon, including cotton jersey pajama sets, flannel pajama sets and pajama pants, cotton loungewear sets, satin pajama sets, nightgowns, onesie pajamas, and footie pajamas.", "authors": ["The Editors"], "top_image": "https://pixel.nymag.com/imgs/daily/strategist/2018/11/09/pj/09-womens-pjs.w1200.h630.jpg", "published_at": "2019-08-23"}