{"pub": "mirror", "url": "https://mirror.co.uk/news/fiona-phillips-dina-asher-smith-20444387", "downloaded_at": "2019-10-05 10:24:18.847287+00:00", "title": "Fiona Phillips: Dina Asher-Smith flying the flag for grit and determination", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nSome people envy success. Some people are dealt success on a plate. Some people never achieve it no matter how hard they try. Most people work for it. And maybe sometimes success depends on what your definition of success is.\n\nDina Asher-Smith has worked every muscle of her body, pounding countless athletics tracks for years on end in her quest to be the best.\n\nA dash of ambition, a LOT of hard work and – maybe the key element in Asher’s toolkit – she seems to have digested Albert Einstein’s theory that “You have to learn the rules of the game. And then you have to play better than anyone else.”\n\nSo she did. Having already bagged a history degree, training four hours a day alongside her studies, on Wednesday the 23-year-old became the first British woman to win a sprint title at the World Athletics Championships.\n\nThe WORLD. Dina Asher-Smith is the best 200 metres sprinter on the planet! How come? Probably because she’s also an exponent of the theory that hard work and determination equals results.\n\nBut, more than that, I reckon another star accomplice in her toolkit for success is that she’s the product of brilliant parenting.\n\n(Image: PA)\n\nThe clue to the truth of that assertion is her dash to the stands, following her triumph, to hug mum Julie, who’s credited with being a major factor in Dina’s climb to the top of the world – dangling incentives such as a Chanel handbag or computer games if her daughter achieved targets.\n\nI wonder what she got for winning gold?\n\nWhatever, I have a hunch that Dina’s feet are firmly on the ground – her humility and disbelief after winning is testimony to that. She’s an absolute legend – damn her! But then so are her parents.\n\nWhen sprinter Darren Campbell once asked if Dina wanted to try on his Olympic medal, Julie replied, “No. The first one she will try on will be her own”.\n\nAnd it must have felt all the better for it.\n\nMum knows best. Especially Dina Asher-Smith’s mum, it seems. What a team.", "description": "Having already bagged a history degree, training four hours a day alongside her studies, on Wednesday the 23-year-old became the first British woman to win a sprint title at the World Athletics Championships", "authors": ["Fiona Phillips", "Image", "Getty", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20422429.ece/ALTERNATES/s1200/0_Dina-Asher-Smith.jpg", "published_at": "2019-10-04"}