{"pub": "cnbc", "url": "https://cnbc.com/2019/10/05/us-china-trade-war-causing-small-biz-to-reinvent-customer-retention.html", "downloaded_at": "2019-10-05 22:46:37.564276+00:00", "title": "Here's what small businesses, slammed by China tariffs, are doing to minimize the impact of the trade war", "language": "en", "text": "The Hapag-Lloyd AG Leverkusen Express sails out of the Yangshan Deepwater Port, operated by Shanghai International Port Group Co. (SIPG), in this aerial photograph taken in Shanghai, China, on Wednesday, Aug. 7, 2019. Qilai Shen | Bloomberg | Getty Images\n\nThe sweeping tariffs imposed on China for its alleged unfair trade practices was intended to set right imbalances that put U.S. companies at a disadvantage. What wasn't intended: the financial hit U.S. small businesses are suffering as a result of unraveling supply chains. According to a recent survey by online business-for-sale marketplace BizBuySell, China tariffs have increased the cost of doing business for more than one third, or 37%, of small businesses across the U.S. As a result, 46% of those admit they are losing customers. It's no surprise, then, that business optimism hit a five-month low in August, confirming a recent survey by CNBC that revealed that small business confidence has dropped to a level not seen since 2017. The common denominator: Small businesses firmly believe the escalating trade tensions will have a negative impact on their bottom line over the next year. And the longer the feud with China continues, the \"deeper and wider\" the impact will be on them, says Karen Kerrigan, president and CEO of industry trade group SBE Council. This realization has left small businesses scrambling to figure out the best way to avoid being a victim in the escalating trade war.\n\nPreparing for the unknown\n\nAlthough promising pockets of hope pop up here and there — with the 13th round of talks in Washington a little more than a week away, Trump suspended yet another round of hikes on Chinese goods, and China responded by lifting levies on U.S. soybeans — the overall impact is still an atmosphere of uncertainty that has left small business owners bracing for the next punch. BizBuySell's survey asked more than 1,700 small business owners how they will deal with the increased costs: 64% said they would raise prices, while 65% of those surveyed said they would consider switching to suppliers outside of China. Online retailer Trend Nation, a 12-year-old Las Vegas-based company that manufactures thousands of products overseas and sells them under a house brand through marketplaces like Amazon, Walmart and eBay, as well as their own website, imports about $8 million in products from Asia, mostly China, and historically had been working with a duty rate of zero to 10%. \"Since the trade war has escalated, the duty rate is now between 10% and 40%,\" says Trend Nation's CEO Brad Howard, claiming his company's tariff bill has gone from $800,000 to $1.6 million. Even though Trend Nation's annual revenues are about $30 million a year, Howard calls the tariffs \"a hard pill to swallow.\" Joe Haddock, Trend Nation's director of product development and global sourcing, says the company is attacking the challenge on multiple levels. Their first step is a \"cost-reduction strategy,\" he says. \"We have to tell our factory partners that they're sharing the burden of this with us. We can't swallow this alone; we're not able to do that.\"\n\nOnline retailer Trend Nation's Joe Haddock (left) and CEO Brad Howard say they are working on cost-reduction strategies, including asking their factory partners to share some of the cost burden. Sara Lyons\n\nThe next \"obvious\" step, he says, is to \"get out of China.\" But Haddock claims it's not that easy, for several reasons. Outside of China, resources are limited, there's not as much infrastructure and experience, and the manufacturing areas that do have infrastructure are quickly being snatched up by big-box retailers. \"It puts us as a small- to mid-size retailer in much of a bind because the MOQ (minimum order quantity) they want from us is astronomical,\" Haddock says. \"It's a struggle to find good partners outside of China.\" Haddock mentioned the temptation of \"loopholes\" such as transloading — moving product from one country to another — but said Trend Nation was a \"stand-up company\" and didn't \"want to play in that ballpark.\" Many of the factories that are opening up outside of China are Chinese-owned and -operated, he says. \"So China's just basically opening up footprints outside of China. Yes, they're paying their labor force, but still all the proceeds, the revenue and everything is streaming right back into China.\" Trend Nation is also looking for ways to streamline operations and get leaner, seeking ways to use more value-stream models they can run on a shoestring. \"To be completely candid, we were trying to move that way before the whole tariff thing.\"\n\nTariff's impact is a 'tale of two cities'\n\nHoward does not take a political stance on the issue. \"In the short term our business is facing a lot of financial headaches and hardships because of the trade war,\" he said. \"But we do understand why the government is aggressively looking at China.\" Howard says he is trying to understand how the U.S. government in years past put together all of the favorable breaks for China, such as shipping costs. He says the cost for him to ship a backpack across Las Vegas from his office to his home was more than the cost to ship the same item from Guangzhou to Las Vegas. Tony Uphoff, president and CEO of Thomas Publishing, a resource for industrial product and supplier sourcing, calls tariffs' impact a kind of \"tale of two cities.\" With the Thomasnet.com platform tracking 72,000 different categories of product and services, and 6,000 industrial buyers and engineers making transactions every two seconds, Uphoff gets a unique overview.\n\n\"It is very clear that we're seeing an impact of the tariffs on increased demand for North American suppliers,\" he says, citing that machinery was up 75% year-over-year, plastic recycling services and lumber were up 70% and steel 35%. \"You can draw a direct line from the tariffs to these products.\" But, he added, \"it's sort of the height of irony that while it may increase your demand, buyers, especially small- to medium-size buyers, are scrambling to find suppliers who can fill their orders.\" \"No one is just a seller. If you're a supplier, you're also a buyer.\" Uphoff said that over the entire market, regardless of location, the tariffs were being used to disrupt and increase prices by as much as 20% to 35%. If all mills in the U.S. ran to maxed-out capacity, it still wouldn't meet the demand, he explained. Buyers have to go outside the U.S. for raw materials, and small- to medium-sized companies don't always have the pricing clout to handle the multitiered nature of global supply chains. So while the tariff war is stimulating a refreshed look at sourcing that will benefit North American companies over time, the negative impact is disrupting vendor relationships that have been forged over decades. Uphoff said the \"vast majority\" of the thousands of companies he has spent time with over the past 18 months may debate the tactics and execution of the trade war, but to a person, they appreciate the fact that the U.S. government is advocating for U.S. manufacturing. \"Frankly, a lot of manufacturers feel it's been a long time since this has happened,\" he said.\n\nKeeping the employees employed\n\nOne small business owner in Upstate New York intends to stay in business for one major reason: \"My biggest job is to keep my employees employed,\" says Rabbit Goody, owner of Thistle Hill Weavers, a small manufacturing company in Cherry Valley, New York, that produces high-end woven fabric for interior designers and the movie business. The tariff war has affected her \"very niche\" half-million-dollar-a-year operation in an unusual way. \"We work for some of the wealthiest parts of our society,\" she says, \"but we also work for people who are sheep farmers.\" Her high-end products include one-off luxury fabrics for boutique designers, as well historic reproductions for Hollywood — the French flag and Russell Crowe's uniform in \"Master and Commander\" and the president's shawl in Spielberg's \"Lincoln\" are two of the 60 films her machines have draped.\n\nRabbit Goody, owner of Thistle Hill Weavers, at her jacquard in Upstate New York. Her biggest job, she says, is \"to keep her sheep farmers employed.\" Holly Oakley\n\nShe serves her lower-end clients — farmers who have their sheep and alpaca wool spun into yarn at 50 cents a pound and then woven into scarves and blankets on Goody's looms — at a discount. The extra bit of revenue the farmers make selling their products at farmers markets or online helps them hold on. Goody, a self-described \"original hippie,\" says most of the novelty yarns essential to her business come from China and her suppliers have raised their prices about 30% \"to cover their asses.\" Her high-end clients tend to have deep pockets, but if she has to spend more on raw materials for them, there's only so far she pass along cost increases. It leaves her with less \"discretionary spending\" for the low-end clients.\n\nMy biggest job is to keep my employees employed. We work for some of the wealthiest parts of our society, but we also work for people who are sheep farmers. Rabbit Goody owner of Thistle Hill Weavers", "description": "The sweeping tariffs imposed on China for its alleged unfair trade practices was intended to set right imbalances that put U.S. companies at a disadvantage. What wasn't intended: the financial hit U.S. small businesses are suffering as a result of unraveling supply chains. This is what they are doing to minimize the impact.", "authors": ["Christopher West Davis"], "top_image": "https://image.cnbcfm.com/api/v1/image/106158440-1569948149233rabbitgoody.jpeg?v=1569949225", "published_at": "2019-10-05"}