{"pub": "afr", "url": "https://afr.com/brand/sophisticated-traveller/3-city-hotels-ideal-for-your-next-east-coast-business-trip-20190929-p52w3r", "downloaded_at": "2019-10-13 23:33:56.580938+00:00", "title": "3 city hotels ideal for your next east coast business trip", "language": "en", "text": "Fiona Carruthers Sophisticated Traveller Editor Oct 14, 2019 — 9.56am Share\n\nSpectacular city views of the Melbourne CBD have long been on offer from the top floors of the Sofitel, Grand Hyatt and Crown Towers properties, while luxe-loving nomads seeking nostalgia in the city have plenty of heritage hotels to choose from, such as The Windsor, InterContinental’s Rialto and Hotel Lindrum.\n\nOn a recent trip to Melbourne, I eschewed these traditional favourites to sample DoubleTree by Hilton’s Flinders Street property – specifically, Room 1402, a much-lauded one-bedroom balcony suite with views of historic Flinders Street Station below and the Yarra River beyond.\n\nDoubleTree is Hilton’s spin-off four-star brand and the Flinders Street offering has been open since 2014. In May, the top two floors of the 180-room, 14-storey hotel were renovated to create a handful of larger, five-star experience suites, and Room 1402 (priced from $520 a night) is the pick of them. It’s spacious, filled with light, and supremely comfortable.\n\nWith travellers encouraged to take fewer flights and car journeys, trains are the ideal transport solution.\n\nThe suite comes into its own at dusk, with spectacular neon-lit views of Melbourne’s iconic railway station. As the wage slaves trundle home, you can put your feet up with a cuppa after a day of meetings, and enjoy the high energy of this beautiful station. Completed in 1909, it’s built in the art nouveau style with a striking dome and arched main entrance. It boasts the longest platform in Australia at 708 metres (and, by way of trivia, the fourth-longest in the world).\n\nWith travellers encouraged to take fewer flights and car journeys, trains are the ideal transport solution. Some of Britain’s famous hotels are located directly above railway stations and it’s a tradition that needs to be exhumed the world over, especially with the traffic snarls and costs involved in getting to the centre of capital cities from airports on the outskirts.\n\nJunior Suites at the Sofitel Brisbane Central comes with access to Club Millesime Lounge.\n\nSticking with the railway theme when bound for Brisbane a few months later, I opt to stay close to a main train station, settling on Sofitel Brisbane Central. Sure, the city has had a lot of beautiful new product come online over the past few years – including The Calile Hotel, the Ovolo in Fortitude Valley and the Emporium Hotel South Bank – but the ease of a CBD stay is hard to beat when on business.\n\nLocated on Turbot Street, Sofitel Brisbane Central is just steps away from both Central and Roma Street train stations, providing an easy run to the airport or other onward journeys.\n\nCatering to traveller demand for more suites, Sofitel Brisbane Central has created 15 new Junior Suites, taking the hotel’s suite inventory to 32 Junior Suites, two Prestige Suites and an Opera Suite. My 63-square-metre Junior Suite (priced from $479) on the seventh floor overlooks Post Office Square and the old 1872 sandstone GPO.", "description": "New luxury suites in Melbourne, Brisbane and Sydney, all in the heart of the CBD and close to rail links, make for handy traffic-free work trips.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.1284%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_97/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/bd082a2bfe9f1a0596795e179dae1a1444e02d69", "published_at": "2019-09-29"}