{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/a-georgia-teen-recorded-a-song-in-memory-of-a-marine-he-never-knew/2019/09/10/a6573640-d3d6-11e9-9343-40db57cf6abd_story.html", "downloaded_at": "2019-09-10 23:29:26.649704+00:00", "title": "A Georgia teen recorded a song in memory of a Marine he never knew", "language": "en", "text": "High school classmates Gabriel Jones, on piano, and Tasya Diaz, on the flute, play “Down By the C,” a composition by Niall Coti-Sears, a U.S. Marine killed in Afghanistan in 2012. (Ben Jones)\n\nColumnist\n\nAs Gabriel Jones wound his way through the grounds of Fort Benning, Ga., he couldn’t stop thinking about the young man whose name was pinned to his back: Niall Coti-Sears.\n\nThis was six or seven years ago, when Gabriel was in middle school and running in the Soldier Marathon’s 5K race, a fundraising event in his hometown of Columbus, Ga. Many entrants run in honor of a fallen soldier, sailor, airman or Marine they know. Others are given names at random. Gabriel got Niall’s.\n\n“I did the run and thought about him,” Gabriel said. “And after the run, I looked him up to learn his history.”\n\nHe found that Niall (pronounced “Nile”) was a Marine lance corporal from the D.C. area who was killed in Afghanistan’s Helmand province on June 23, 2012, two days after turning 23.\n\nGabriel found the Facebook page of Niall’s mother, Susan Coti, and reached out to her. Would she tell him more about Niall? He learned that Niall loved music, had taken classes at the Levine School and enjoyed playing the piano and guitar and composing songs.\n\n“I saw all the people he had affected, and I really wanted to do something,” Gabriel said.\n\n\n\nBefore Niall Coti-Sears enlisted in the U.S. Marine Corps, he posed for Tysons Corner photographer Zaid Hamid. Zaid lost track of Niall but heard from his mother, Susan Coti, after the Marine was killed. (Zaid Hamid)\n\nHe decided to buy a commemorative paver with Niall’s name on it to have installed at the National Infantry Museum & Soldier Center. He saved his allowance and held a bake sale at his middle school to raise money. When the brick was dedicated, he invited Susan to come to the ceremony and stay with his family.\n\nSusan brought some of Niall’s music with her, including sheet music of a composition her son had written and recorded called “Down By the C.” The music had been transcribed for piano and flute by Amber Walson, a music teacher at the District’s John Eaton Elementary, where Susan taught.\n\nAs their senior project at Columbus High, all the 12th-graders have to devote 50 hours to learning something they’ve never done before. Gabriel knew what he wanted to do: He would learn to play the piano. Among the songs he would learn would be “Down By the C.”\n\nGabriel took piano lessons from a woman named Lulu Johnson. He approached a classmate named Tasya Diaz to ask if she would learn the flute part. When they’d mastered it, they went to a studio called Bibb City Sound and recorded it. On June 21, 2019 — what would have been Niall’s 30th birthday — they released it on iTunes and other services.\n\nOn the same day, Susan released a seven-track album with six songs Niall recorded and a song called “Niall,” co-written by his father, drummer Paul Sears, and recorded by the English band Karda Estra. It costs $10 to download on the website Play It Forward.\n\n\n\nGabriel Jones, an 18-year-old from Columbus, Ga., learned to play the piano to record a composition by Niall Coti-Sears, a U.S. Marine killed in Afghanistan in 2012. (Ben Jones)\n\nAs with Gabriel and Tasya’s 99-cent recording, all the money goes to Gitameit, a music school in Myanmar, and Hungry for Music, a District-based charity that provides musical instruments to U.S. children who can’t afford them.\n\nI asked Susan how she spent this past June 21, Niall’s birthday.\n\n“I spent the day thinking about him, listening to his music, loving him, missing him and being happy that I actually had 23 years with him,” she said.\n\nGabriel never met the Marine whose name was pinned on his back, but he thinks about him often. What does he see?\n\n“Every time I try to visualize him, I kind of see this free spirit,” said Gabriel, an 18-year-old freshman at Georgia Tech in Atlanta. “At the end of the day, it wasn’t his place in life to be sitting at a desk doing monotonous work, but to be out there doing something — and doing something that mattered.”\n\nNiall, Gabriel said, “was someone who wanted to get out there and change the world for the better.”\n\nIt’s something Gabriel hopes he can do.\n\nI asked Gabriel what emotions he felt listening to Niall’s “Down By the C,” a two-minute composition both simple and plangent.\n\n“Oh goodness,” he said. “A roller coaster, really. It’s almost a feeling of yearning, especially dividing it into the two movements. There’s the last part of the song, it really just kind of flows in and out, pulling on you and pulling you back. And at the end you feel like you want more.”\n\nTwitter: @johnkelly\n\nFor previous columns, visit washingtonpost.com/john-kelly.", "description": "Tribute music raises money in honor of Niall Coti-Sears, 23, who was killed in Afghanistan.", "authors": ["John Kelly", "Local Columnist", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/AHpqaYB2HVTZb7rAUrWt3R7wVH4=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/C7YIDEGUAMI6TCJEDW35VR4X7M.jpg", "published_at": "2019-09-10"}