{"pub": "breitbart", "url": "https://breitbart.com/news/nlds-st-louis-cardinals-beat-atlanta-braves-in-10th-force-game-5", "downloaded_at": "2019-10-08 01:24:17.091755+00:00", "title": "NLDS: St. Louis Cardinals beat Atlanta Braves in 10th, force Game 5", "language": "en", "text": "Oct. 7 (UPI) — Yadier Molina came through twice for the St. Louis Cardinals and forced a deciding Game 5 of their NL Division Series against the Atlanta Braves after a 5-4 win in extra innings Monday.\n\nMolina hit the game-tying single in the eighth and drove in the winning run in the 10th inning on a sacrifice fly off Braves pitcher Julio Teheran. With the win, the Cardinals evened the NLDS at two games apiece as the series shifts back to Atlanta.\n\nGame 5 will be Wednesday in Atlanta. St. Louis will send ace Jack Flaherty to the mound, and the Braves will start Mike Foltynewicz.\n\nThe Cardinals used two solo home runs from Paul Goldschmidt and Marcell Ozuna to take a 2-0 lead in the first inning. Braves second baseman Ozzie Albies scored Dansby Swanson on a sacrifice fly in the third to cut Atlanta’s deficit to 2-1.\n\nLater in the bottom of the fourth inning, Ozuna blasted a 429-foot solo homer off Braves starter Dallas Keuchel, his third home run allowed in the game. Pitching on three days of rest, he allowed three earned runs on four hits in 3 1/3 innings in his 11th career start in the playoffs.\n\nThe Braves grabbed a 4-3 lead in the fifth after Swanson scored on an error and Albies’ two-run home run off Cardinals starter Dakota Hudson. Atlanta could have extended its lead but left the bases loaded in the sixth and seventh.\n\n“We’re a hit away from — just some productive outs — from continuing to add on,” Braves manager Brian Snitker told reporters.\n\nMolina’s RBI single equalized the score at 4-4 in the bottom of the eighth. In the 10th, his sacrifice fly to deep left field plated Kolten Wong to complete the walk-off victory.", "description": "Oct. 7 (UPI) — Yadier Molina came through twice for the St. Louis Cardinals and forced a deciding Game 5 of their NL Division Series against the", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-07"}