{"pub": "guardian", "url": "https://theguardian.com/law/2019/sep/17/supreme-court-grapples-dilemma-politics-versus-law", "downloaded_at": "2019-09-17 23:24:53.839479+00:00", "title": "Supreme court grapples with dilemma of politics versus the law", "language": "en", "text": "Even the finest legal minds at times seemed baffled by ‘justiciability’ of prorogation\n\nAt the start of the three-day hearing to resolve contradictory judgments made by Scottish and English courts on the prorogation of parliament, attempts to refine the interlocking issues seemed on occasions to baffle even the finest legal minds.\n\nOne of the first fundamental questions for the supreme court is whether Boris Johnson’s private advice to the Queen to prorogue parliament was “justiciable” – that is, whether such a decision ought to be regulated by judges.\n\nLord Keen and the government have argued that because such a decision is purely “political” there are no absolute legal standards by which any court can judge whether the prime minister’s actions were a proper use of his powers or not. Could a prorogation of 10 days, 20 days or several months be deemed to be reasonable, the government lawyers asked?\n\nQ&A What is the UK supreme court and how does it work? Show Hide The supreme court of the United Kingdom was formally established on 1 October 2009. It is the ultimate court for hearing cases of the greatest public or constitutional importance, and is the final court of appeal in the UK, except for criminal cases heard in Scotland. The supreme court took over the judicial functions of the House of Lords, separating the judiciary from the legislature. It brought an end to the system of appealing to the \"lords of appeal in ordinary\" - commonly known as the law lords. The court comprises the president and deputy president and 10 other judges of the supreme court. Judges are appointed by the Queen on the advice of the prime minister, to whom a name is recommended by a special selection commission. The prime minister is obliged to recommend this name. The judgments in all decided cases from the court are published on the court's website.\n\nCountering that claim, Lord Pannick QC pointed out that numerous judicial review cases, such as the former article 50 Brexit case, have involved highly politicised questions yet were unquestionably matters that the court decided it could consider.\n\nThat first question of justiciability is what the 11 justices on the UK’s highest court will have to resolve before they move on to the question of whether the prime minister’s advice was a proper or improper use of the government’s executive powers.\n\nLord Pannick stays calm and Keen lacks interest at supreme court | John Crace Read more\n\nThe three Scottish judges, when considering whether the extended prorogation was lawful, reached the conclusion that it had been enforced by Johnson purely as a device to stymie MPs’ scrutiny of Brexit policy at a moment of national crisis.\n\nPannick adopted their arguments, maintaining that parliament is sovereign. For the government to use its power to evade that scrutiny overturns the basic principles of constitutional law, he said.\n\nJohnson was motivated by an “improper purpose”, namely to avoid parliamentary control over his policies, Pannick added.\n\nThe court, Pannick said, could draw adverse inferences about the PM’s motives from the fact he had not given a statement to the courts. Johnson, he said, would not have recommended a five week-long prorogation unless he had wanted to avoid being challenged.\n\nBut Keen said there was no statement from Johnson because the cabinet documents released clearly set out the reasons for the long delay, namely that it was to allow for the conference season and preparation for a new Queen’s speech. There was nothing improper about the PM’s motives.\n\nDuring the afternoon, Keen – no doubt anticipating arguments to be made later this week by Scottish lawyers for the Scottish National party MP Joanna Cherry QC – insisted there was no difference between the law north and south of the border.\n\nHe said there was no legal difference between the 1688 English bill of rights and the 1689 Scottish claim of rights. “The prorogation of parliament does not have a direct impact on any individual legal rights,” he maintained.", "description": "Even the finest legal minds at times seemed baffled by ‘justiciability’ of prorogation", "authors": ["Owen Bowcott", "John Crace"], "top_image": "https://i.guim.co.uk/img/media/3f269dc51e658e9fb6af3c766e7d553cf0d4028d/0_206_4489_2693/master/4489.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f8b319f98020b9be0eb57d798484c36e", "published_at": "2019-09-17"}