{"pub": "reuters", "url": "https://reuters.com/article/us-tennis-usopen-williams/williams-dismantles-svitolina-to-reach-u-s-open-final-idUSKCN1VR03J", "downloaded_at": "2019-09-06 12:16:15.191159+00:00", "title": "Williams dismantles Svitolina to reach U.S. Open final", "language": "en", "text": "NEW YORK (Reuters) - A rampaging Serena Williams moved to the brink of a record equaling 24th career Grand Slam title on Thursday storming past Elina Svitolina 6-3 6-1 to book her spot in the U.S. Open final.\n\nSep 4, 2019; Flushing, NY, USA; Serena Williams of the United States gestures to the crowd after her match against Elina Svitolina of Ukraine (not pictured) in a semifinal match on day eleven of the 2019 US Open tennis tournament at USTA Billie Jean King National Tennis Center. Mandatory Credit: Geoff Burke-USA TODAY Sports\n\nSince returning to action after the birth of her first child Williams has come agonizingly close to matching Margaret Court’s mark three times and will have a chance on Saturday to do so in front of an adoring home crowd for a second successive year.\n\nLast year Williams was left in tears following a chaotic and controversial loss to Naomi Osaka on Arthur Ashe Stadium. She has also lost two Wimbledon finals since her return.\n\nNow all that stands between the 37-year-old and her Holy Grail is Canadian Bianca Andreescu or Swiss Belinda Bencic, who will meet in the other semi-final later on Thursday.\n\n“To be in yet another final, it seems honestly crazy,” said Williams. “But I don’t really expect too much less.\n\n“I’ve had so many chances to pass it (Court).\n\n“If you look at the span of the career, the players I’ve played, it’s amazing that I was able to get this many.”\n\nThe semi-final offered a classic matchup of styles with Williams and her prodigious power up against Svitolina, one of the best counter punchers in the women’s game.\n\nWilliams did not have her ‘A’ game in warm conditions but the former-world number one knew exactly what was needed particularly on the big points.\n\n“I don’t think she played amazing today but she played very high level at the beginning where you had to make a difference,” said Svitolina. “I think she knows what she has to do.\n\n“There’s lots of power behind her shots all the time.\n\n“On the important moments she always steps up, always brings her best game.”\n\nThe fifth seeded Ukrainian had no shortage of chances herself but could not convert any of six break opportunities.\n\nA ruthless Williams, however, bombarded Svitolina with punishing forehands and six aces to register her 101st U.S. Open win, which tied her with Chris Evert for the most at Flushing Meadows.\n\nWilliams arrived at the year’s final Grand Slam with a scowl and an all business demeanor that has swatted aside a raft of challengers throughout her run to the final.\n\nAny concerns over the back spasms that forced her to quit the Toronto final and out of Cincinnati were eased when she opened her Flushing Meadows account with a 6-1 6-1 thrashing of old rival Maria Sharapova.\n\nThat was followed by routine wins over Karolina Muchova, Petra Martic and Cat McNally before blasting her way into the last four with a jaw-dropping 44-minute 6-1 6-0 rout of China’s Wang Qiang.\n\nBut as cold-blooded as those performances were, Williams 70-minute dismantling of Svitolina in front of a packed house said more by delivering an emphatic message she would not be content leaving Flushing Meadows without a share of Court’s record.\n\nThe match had looked to be a long and competitive affair when Svitolina forced Williams to fight off three break points to hold her opening serve.\n\nWilliams, however, was ready for the challenge breaking Svitolina at the first opportunity by firing a winner down the line the Ukrainian could only look at.\n\nSlideshow (10 Images)\n\nThat was the only break of a grinding first set but all Williams would need for a 1-0 lead.\n\nIt was not a good omen for Svitolina with Williams holding a 94-1 record when winning the first set at the U.S. Open.\n\nSvitolina would hold serve to open the second but Williams then swept through the next six games to advance to her 33rd Grand Slam final.", "description": "A rampaging Serena Williams moved to the brink of a record equaling 24th career Grand Slam title on Thursday storming past Elina Svitolina 6-3 6-1 to book her spot in the U.S. Open final.", "authors": ["Steve Keating", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190906&t=2&i=1426721406&w=1200&r=LYNXNPEF8503H", "published_at": "2019-09-06"}