{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7578645/Two-members-The-Squad-endorse-Bernie-Sanders-president.html", "downloaded_at": "2019-10-16 07:27:58.742157+00:00", "title": "Two members of The Squad endorse Bernie Sanders for...", "language": "en", "text": "Democratic Representatives Alexandria Ocasio-Cortez and Ilhan Omar are endorsing Bernie Sanders for president.\n\nThe Sanders campaign confirmed the backing of two members of The Squad on Tuesday.\n\nWhen we say “tax the rich,” we mean nesting-doll yacht rich. For-profit prison rich. Betsy DeVos, student-loan-shark rich.\n\n\n\nTrick-the-country-into-war rich. Subsidizing-workforce-w-food-stamps rich.\n\n\n\nBecause THAT kind of rich is simply not good for society, & it’s like 10 people. — Alexandria Ocasio-Cortez (@AOC) May 11, 2019\n\nThe endorsements are a major boon for the 78-year-old Vermont senator, who has faced questions over his health since suffering a heart attack two weeks ago.\n\nThe 30-year-old Ms Ocasio-Cortez and 38-year-old Ms Omar are progressive stars and frequent targets of President Donald Trump.\n\nThank you Senator @SenSanders for your partnership in addressing childhood hunger.\n\n\n\nWhen our children have empty stomachs, they can’t learn.\n\n\n\nWorking class families are struggling to make ends meet and we need to help lift this financial burden and feed the future! https://t.co/j4IpMH3Jmu — Ilhan Omar (@IlhanMN) October 16, 2019\n\nMr Sanders’ deputy communications director Sarah Ford said Ms Ocasio-Cortez will appear with the senator at a rally in her home district in New York this weekend.\n\nMr Sanders hinted at her backing during Tuesday’s Democratic debate in response to a question about his age, saying his sceptics should attend his Saturday rally featuring a “surprise guest”.", "description": "Alexandria Ocasio-Cortez and Ilhan Omar are two of the four congresswomen targeted by Donald Trump in a series of tweets.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/08/wire-19775846-1571210328-615_636x382.jpg", "published_at": "2019-10-16"}