{"pub": "washingtonpost", "url": "https://washingtonpost.com/history/2019/10/20/how-theft-mona-lisa-made-it-worlds-most-famous-painting", "downloaded_at": "2019-10-20 12:24:39.805793+00:00", "title": "How the 1911 theft of the Mona Lisa made it the world’s most famous painting", "language": "en", "text": "Twenty-six hours would pass before anyone noticed that the Mona Lisa had gone missing.\n\nLeonardo da Vinci’s painting of a 16th century Florentine noblewoman with an enigmatic smile ranks as one of the world’s most instantly recognized images. Singer Nat “King” Cole celebrated it in a 1950 pop hit. Cartoonists have parodied it. Dadaist artist Marcel Duchamp scandalized the art world when he painted a mustache on a shoddy reproduction.\n\nAD\n\nAD\n\nThis month the Louvre is mounting a major da Vinci exhibition to mark the 500th anniversary of the artist’s death. The museum is expecting huge crowds.\n\nDa Vinci painted his masterpiece in 1507, but it was only in the 19th century that critics begin to see the work as the pinnacle of Renaissance Florentine painting. In 1911, the Mona Lisa was not yet instantly recognizable. In fact, when The Washington Post first reported the theft and appraised the painting’s value at $5 million, the paper mistakenly ran a picture of the Monna Vanna, a nude charcoal sketch that some believe da Vinci made in preparation to paint the Mona Lisa.\n\nThe theft changed how the world saw the Mona Lisa.\n\nAD\n\nThe heist was discovered when a wealthy museum patron and amateur painter arrived at the Salon Carre to study “La Jaconde,” as the French call the Mona Lisa. Instead, he found a blank wall space.\n\nAD\n\nThe Louvre routinely removed art work for photographing so a guard thought nothing of the missing work. But after several hours, he alerted the staff.\n\nThat evening police announced the theft. Georges Benedite, curator of the Louvre, told the press that only a practical joker would steal such a prized painting as it would be too difficult to fence. By contrast, the gendarmes believed the thief would demand a ransom within 48 hours. But two days passed and no one came forward.\n\nAD\n\nThe thief left behind very few clues. Security found a doorknob from the staircase outside the building. A plumber recalled helping a man who had taken off a doorknob while locked in the stairwell.\n\nA guard found the wooden frame and glass covering box on a staircase. The frame had one thumb print. Paris police inspector Alphonse Bertillon, often credited with inventing the mug shot, believed in the new technique of fingerprinting. However, he had 750,000 prints on file — too many to check. Instead, he fingerprinted the 257 Louvre employees who had been working that day.\n\nAD\n\nPolice distributed 6,500 leaflets with the painting’s image and offered a 40,000 francs reward. Neighbors informed on neighbors. Co-workers informed on co-workers. Every lead led nowhere — though the museum did recover some stolen loot.\n\nOn Sept. 7, police arrested the poet Guillaume Apollinaire on suspicion of involvement in the theft of the Mona Lisa and some Egyptian statuettes from the Louvre. The poet’s secretary, Géry Pieret, who was also a small-time art thief, had gone to the Paris-Journal newspaper after a falling out with Apollinaire, claiming to have information on the Mona Lisa.\n\nPolice interrogated a terrified Apollinaire and eventually released him but not before he gave up the name of a close friend, the painter Pablo Picasso. Picasso knew nothing about the da Vinci but did return some Iberian Bronze Age statues, stolen by Pieret in 1907. (The statuary served as models for his “Les Demoiselles d’Avignon,” a work that helped usher in cubism.)\n\nAD\n\nAD\n\nThe Louvre kept an empty space open for the vanished painting. Crowds of curious onlookers came to gaze at the vacant wall — among them, absurdist writer Franz Kafka and his close friend Max Brod.\n\nConspiracy theories abounded. Some thought that a forgery ring took it and were selling forgeries to naive but wealthy art lovers. Or a robber baron, perhaps J.P. Morgan, had played fence and purchased the original outright. Others speculated that Adam Worth, the criminal who once purloined Thomas Gainsborough’s “Georgiana, Duchess of Devonshire,” had taken it. However, Worth had died in 1902 and was buried in a London pauper’s grave.\n\nFor over two years, the painting remained missing. Then the thief stepped forward.\n\nAD\n\nVincenzo Peruggia, an Italian national, was a house painter, mason and aspiring portraitist. He had briefly worked for a firm that cut glass for the Louvre. His French co-workers relentlessly bullied him about his nationality, calling him a “macaroni.” The hotheaded workman had prior arrests for robbing a prostitute and for toting a gun during a brawl.\n\nAD\n\nBecause he was part of the glass crew that had worked at the Louvre, the police had interviewed Peruggia in his Paris apartment in 1911. They believed his alibi that he had been working at a different location the day of the theft. Unbeknownst to them, the Mona Lisa was in the apartment, stashed in a trunk.\n\nIn December 1913, Peruggia wrote to Alfredo Geri, an antique dealer who had advertised for fine art in several Italian newspapers. Signing his letter “Lorenzo,” he indicated that he had the Mona Lisa. Mistakenly believing the painting had been taken by Napoleon during his looting of Italian art, Peruggia expected a reward for returning the painting to what he regarded as its homeland. (The painting had resided in France since 1516 when da Vinci gifted the work to his Gallic patron, King Francois I.)\n\nGeri contacted Giovanni Poggi, director of the Uffizi Gallery in Florence, and set up a meeting with Peruggia in Milan. Poggi authenticated the painting and persuaded Peruggia to leave it for “safekeeping.” Then they contacted the Italian police.\n\nAD\n\nAD\n\nChristopher Marinello of Art Recovery International, a company that provides art recovery services to museums and private collectors, said that Peruggia’s behavior — holding and hiding the painting for years — is common among art thieves.\n\n“A typical art thief tries to get money. When they can’t hide it, they store it until they can get money,” said Marinello. “As soon as art is stolen, it decreases in value. This happened even in the 1800s when there was no Internet. Today everyone knows about every single art theft, whether a turn-of-the-century Matisse painting or a 7-foot garden gnome.”\n\nIn court, Peruggia appeared unhinged or — to use an Italian phrase, “fuori come un balcone” — outside like a balcony. Repeatedly, he shouted and interrupted the court. He argued with prosecutors. He argued with his lawyer. The judge would bang his gavel and tell him to calm down. Then Peruggia would start up again. First, he said he worked alone. Then he implicated two friends, neither of whom were involved.\n\nAD\n\nAD\n\nThroughout it all, he maintained the theft was an act of patriotism.\n\n“I will make my fortune, and it will arrive in one shot,” he had written in a letter to his father four months after the theft.\n\nPeruggia didn’t make his fortune. But his professed patriotism stirred the Italian jury. On June 5, 1914, he was given a lenient sentence — just one year and 15 days. He only served seven months. After fighting for Italy in World War I, he returned to France, where he died in 1925.\n\nAnd after a brief tour of Italy, La Giocanda — as the Italians call it — was returned to France. By then, it was the most famous painting in the world.\n\nRead more Retropolis:\n\nAD", "description": "The painting was missing for two years. Then the thief stepped forward.", "authors": ["Terence Mcardle", "Editorial Aide Feature", "Obituary Writer"], "top_image": "https://www.washingtonpost.com/resizer/3b8qApetOjk2O02ZEUhuLDSxATw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ISOAAAXJEAI6TIZJON4PX6Q3MM.jpg", "published_at": "2019-10-20"}