{"pub": "nymag", "url": "https://nymag.com/strategist/article/best-mens-hair-loss-treatments.html", "downloaded_at": "2019-10-01 00:10:30.667277+00:00", "title": "6 Best Men’s Hair-Loss Treatments 2019", "language": "en", "text": "Photo: NBC\n\nIf you’re a gentleman who has been noticing a receding hairline or is worried about balding, the first step is to schedule a visit with a doctor or dermatologist and make sure your hair loss isn’t a sign of a more serious health issue. “Not all hair loss is male-pattern hair loss,” explains Dr. Marc Glashofer, a board-certified dermatologist specializing in hair loss who practices in northern New Jersey. A thyroid disorder, an autoimmune disease, or even a scalp issue could be the cause of a hairline resembling Bruce Willis’s in Die Hard 2. But most hair loss is androgenetic alopecia, also known as male-pattern baldness, and fortunately (or not, depending on your perspective), it’s just a symptom of getting older.\n\nOnce male-pattern baldness starts, it’s not going to stop, though the rate at which this happens differs from person to person and depends on genetics. And since the grind of hair loss is unending, it’s important to start treatment as soon as your hairline starts bothering you. If you’re looking for a more quantitative metric, Dr. Paul McAndrews, clinical professor of dermatology at the USC School of Medicine and member of the International Society of Hair Restoration Surgery, assures me that “you have to lose half your hair before the human eye can tell.” We spoke to eight doctors and dermatologists about the most effective products to halt hair-loss, including topical foam, oral medication, and even a laser comb. (Of course, if you don’t care about losing your hair and are fine with going full Prince William and shaving your head, go for it. We’ve got some recommendations for razors and hair trimmers to help you out on that front.)\n\nBut before we dive in, a quick note about hair-growth shampoos and vitamins: There is less evidence supporting the efficacy of hair-growth shampoos that claim to block DHT (dihydrotestosterone), an androgenic hormone responsible for shrinking hair follicles, which ultimately leads to hair loss and eventually baldness. Dr. Evan Rieder, dermatologist in the Ronald O. Perelman Department of Dermatology at NYU Langone Health, is skeptical that you’re going to see any tangible benefits by rubbing DHT blockers into your scalp. “I find it very difficult to believe that something that’s applied to the scalp and rinsed off is going to have any appreciable effect,” he says. All four doctors also shut down any suggestions that hair-growth supplements or vitamins, like biotin, could help promote hair growth or stop hair loss — though a couple hypothesized that vitamins or supplements could lead to hair regrowth if your hair loss was a result of a nutritional deficiency. But otherwise, says Dr. Amy McMichael, professor and chair of Wake Forest Baptist Medical Center’s Department of Dermatology, if you’re dealing with regular old male-pattern baldness, “there is no such thing as a ‘hair vitamin.’”\n\nBest overall hair-loss product\n\nRogaine Men’s Minoxidil Hair Thinning & Loss Treatment Foam, Three Month If you decide to start treatment to save your hair, a good place to start is with minoxidil, more commonly known as Rogaine, which came recommended as the first line of defense by every expert we spoke to. Don’t expect this hair-loss treatment to create luscious locks; minoxidil is better at slowing down or preventing more loss rather than promoting hair growth. But, according to McMichael, it is effective “if used as recommended, with evidence of improvement seen around six to nine months.” Simply massage the foam or solution into your scalp once or twice daily, and for best results, use a formula with a 5 percent concentration. Three of our experts specifically recommended Rogaine foam, which hair-loss specialist Dr. Marc Avram says has “been around forever” and which Dr. Douglas D. Altchek, founder or Altchek Dermatology, calls very “reliable.” Avram also has this tip: “Clinically, it works in the front and back,” so feel free to apply the foam to the crown of the head as well as the hairline. $45 at Amazon Buy $45 at Amazon Buy\n\nBest liquid topical solution for hair loss\n\n\n\n\n\nLipogaine for Men If you prefer a liquid solution, Dr. Michelle Green likes Lipogaine because, on top of containing 5 percent minoxidil, it has 5 percent azelaic acid, which “acts as a DHT blocker that inhibits the production of DHT.” $25 at Lipogaine Buy\n\nBest hair-loss product for sensitive scalps\n\nDS Laboratories Spectral DNC-N Redensifying Hair Product “Nanoxidil is very similar to minoxidil, without the side effects,” explains Green, making it a good bet for patients who have experienced scalp sensitivity or dry skin from Rogaine. While it is a fairly new product, it has proven very effective in treating hair loss because nanoxidil “has a smaller molecular weight, which allows it to penetrate the scalp faster, resulting in a better absorption rate,” she says. It has also been shown to increase hair density as well as hair growth. Green suggests this product from DS Laboratories, which is formulated with retinol to promote scalp health and azelaic acid to block DHT. $38 at Walmart Buy\n\nBest oral medication for hair loss\n\n\n\n\n\nFinasteride, 30-Day Supply The other main hair-loss treatment recommended by six of the dermatologists we interviewed is finasteride, often called by its brand name, Propecia. This FDA-approved medication is available only with a prescription, but these days, it’s found as a generic and can be ordered online after a virtual consultation through start-ups like Hims, Keeps, and Lemonaid. Finasteride inhibits an enzyme that converts testosterone to DHT, the hormone that causes hair loss in men, and unlike minoxidil, this drug can actually help hair grow back as well as prevent further loss. All you have to do is take one pill a day; according to Rieder, two-thirds of men taking this treatment will see improvement in hair density over time. $29 at Hims Buy\n\nBest hair-loss kit\n\nThe Rx Hair Kit You can get a hair-loss kit from Hims that comes with both minoxidil and finasteride. Keeps has one as well. “Hims and Keeps offer hair-loss treatments such as finasteride and minoxidil as well as biotin and other topical options, including DHT shampoo,” explains Dr. Amanda Doyle of Russak Dermatology Clinic. “These are great options for a lot of men to address hair loss.” And though it might seem like overkill to take two different hair-loss treatments at once, this is one of those rare instances in which more is actually better. McAndrews calls the combination of orally administered finasteride and topically applied minoxidil a “full-court press” against hair loss. “That’s doing the most you can for preventative medicine.” Rieder notes that taking both drugs together is more effective than taking either one alone. But you must start these medical therapies before you lose all your hair. McAndrews likens it to brushing your teeth in that both are preventative measures. “The sooner you start doing it, the better at slowing down this aging process,” he explains. “Is toothpaste perfect? No, you’re still getting tooth decay with toothpaste, but you’re slowing down tooth decay.” $44 at Hims Buy\n\nBest laser comb for hair loss\n\n\n\n\n\nHairMax Prima7 LaserComb Although this treatment appears to be safe and somewhat effective, it’s hard to tell who will react well to this low-level light therapy, which is why the doctors we spoke with were hesitant to fully endorse it. “We’re not sure what the optimal power is, what the optimal wavelength is; we don’t even really know the mechanism of action of how this is working,” says Rieder. Plus, it doesn’t work on everyone. “There are subpopulations of patients who do respond to low-level laser light, but this is not easily predictable,” explains McMichael, though she adds that the risk of using the LaserComb is low. The trick with all of these hair-loss products and treatments, though, is that they’ll stop working as soon as you stop using them. People “have to be ready for a lifetime commitment,” says Rieder. But, just like brushing your teeth, as long you keep on keeping on with the scientifically proven preventative treatments, those hairs on your head should be just fine. $195 at Amazon Buy $195 at Amazon Buy\n\nget the strategist newsletter Actually good deals, smart shopping advice, and exclusive discounts. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nThe Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best women’s jeans, rolling luggage, pillows for side sleepers, ultraflattering pants, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.\n\nEvery editorial product is independently selected. If you buy something through our links, New York may earn an affiliate commission.\n\n", "description": "We spoke with eight dermatologists and hair-loss doctors to find the best over-the-counter hair-loss product and the best prescription hair-loss treatment, and learn whether hair-growth shampoos and vitamins actually work.", "authors": ["Maxine Builder", "Dominique Pariso"], "top_image": "https://pixel.nymag.com/imgs/daily/strategist/2019/09/30/hair-loss/hair-loss-lede-new.w1200.h630.jpg", "published_at": "2019-09-30"}