{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/2019/09/17/tooth-fairy-lots-guns-fish-being-cleaned-with-spoon-many-ridiculous-moments-corey-lewandowskis-testimony", "downloaded_at": "2019-09-17 23:23:48.782457+00:00", "title": "The tooth fairy, ‘lots of guns’ and ‘a fish being cleaned with a spoon’: The many ridiculous moments of Corey Lewandowski’s testimony", "language": "en", "text": "The public faceoff between the Democratic-controlled House Judiciary Committee and Corey Lewandowski was never going to be a harmonious affair. Lewandowski is known as one of Trump’s most fiercely loyal aides — a bare-knuckle political operative with few parallels in modern politics. And he’s also cuing up a potential run for U.S. Senate in New Hampshire, which added a significant subplot Tuesday and perhaps gave him more reason to make a show.\n\nBut a show it was. Lewandowski began the hearing by repeatedly asking his questioners to read the specific portions of the Mueller report they were referring to. Even when they projected the words on the screen, he asked them to read the words anyway.\n\nWhen Rep. Eric Swalwell (D-Calif.) insisted that Lewandowski read it himself and asked whether he was “ashamed” of what was in the report, Lewandowski responded by dryly calling Swalwell, whose 2020 presidential campaign was rather brief, “President Swalwell.”\n\nIt was later in that exchange that Lewandowski mentioned his guns. Swalwell asked him whether he puts all of his notes about meetings with Trump in his safe, as he did when Trump asked him to deliver a controversial message to then-Attorney General Jeff Sessions. Lewandowski responded, “It’s a big safe, congressman. There’s lots of guns in it.”\n\nIn an earlier exchange with Rep. Hakeem Jeffries (D-N.Y.), Jeffries asked Lewandowski whether he was a “hit man” or a “bag man” for Trump. Lewandowski responded: “I think I’m the good-looking man, actually.”\n\nRep. Hank Johnson (D-Ga.) got further than most in penetrating Lewandowski’s stonewalling. He pressed Lewandowski on why he hadn’t delivered Trump’s message to Sessions asking the attorney general to criticize the Mueller probe as “very unfair” to Trump. The report by then-special counsel Robert S. Mueller III says Lewandowski “did not want to deliver the President’s message personally” and tried to get a Trump aide to do it (which the aide also declined to do).\n\nJohnson asked whether Lewandowski got “squeamish” or “chickened out.” Lewandowski responded that it wasn’t any of that but simply that, “I went on vacation.” At another point, Johnson said: “You are like a fish being cleaned with a spoon. It’s very hard to get an answer out of you.”\n\nAnd at the beginning of the hearing, ranking Republican Douglas A. Collins (Ga.) accused the Democrats of prolonging the Mueller investigation. “But as long as we don’t have time, we’ll continue with rerun season,” Collins said. “Popcorn still tastes good. I don’t know why we do this except maybe we just have — maybe a deficiency of flashbulbs. I don’t know. Because we just like the show.”\n\nThe whole thing might have culminated in this exchange, in which Rep. Jamie B. Raskin (D-Md.) attacked Lewandowski for granting the White House’s request that he not talk about his conversations with Trump — via executive privilege — even though he wasn’t a White House aide:\n\nRASKIN: I don’t think it’s anyone’s privilege to waive because I don’t think it exists, Mr. Lewandowski. I think the whole thing is imaginary. It’s like the tooth fairy. LEWANDOWSKI: My children are watching, so thank you for that.\n\nWhatever Lewandowski’s children — and any other viewers — got out of watching that hearing, it wasn’t of much substance.", "description": "A proud day for democracy, all around.", "authors": ["Aaron Blake", "Senior Political Reporter", "Writing For The Fix"], "top_image": "https://d1i4t8bqe7zgj6.cloudfront.net/09-17-2019/t_d0172c74e5084418a370fc897ddd1b43_name_1c34d058_d980_11e9_a1a5_162b8a9c9ca2_scaled.jpg", "published_at": "2019-09-17"}