{"pub": "cbc", "url": "https://cbc.ca/news/canada/montreal/imposter-fake-id-line-of-credit-fraud-1.5323219", "downloaded_at": "2019-10-17 14:19:53.363595+00:00", "title": "Imposter used fake ID to steal money from Longueuil woman's line of credit | CBC News", "language": "en", "text": "A Longueuil, Que., woman is questioning Scotiabank's security measures after an imposter stole $2,500 from her line of credit.\n\nNewsha Motazedi said she noticed a problem with her debit card when she couldn't log into her online account to pay bills.\n\nHer bank told her that was because she'd reported her debit card lost.\n\n\"I was shocked,\" said Motazedi, who had her debit card in her pocket. \"I hadn't informed anyone about a lost debit card.\"\n\nThe bank issued her a new debit card, but when she checked her accounts, she saw right away that someone had withdrawn money from her line of credit.\n\nThe bank had just activated the line of credit a week earlier.\n\nMotazedi had planned to draw on it for expenses.\n\n\"I didn't even have a chance to use it,\" she said.\n\nFraudster successful on 2nd attempt\n\nWhen the bank looked at her account profile, it found that someone posing as Motazedi had reported the debit card lost on Aug. 16.\n\nThe imposter then tried to withdraw money from Motazedi's line of credit.\n\nThe request was refused when her signature didn't match the one the bank had on file.\n\nNewsha Motazedi is angry Scotiabank did not contact her after a fraudulent attempt was made on her line of credit. (CBC)\n\nAfter the attempted withdrawal, the bank added a security alert to Motazedi's accounts.\n\nBut the fraudster wasn't done.\n\nLater that same day, the imposter again tried to withdraw money at a different Scotiabank branch in Montreal's west end.\n\nThis time, despite the security alert, the bank handed the imposter $2,500.\n\n\"I was shocked, and I was afraid because I was imagining what else that person can do with my identity, with my money,\" said Motazedi.\n\nShe thinks the bank should have contacted her immediately after the fraudster's first foiled attempt to get money from her account.\n\n\"I should be aware of what has happened,\" as she could have reacted quickly, she said.\n\nWhen she checked her credit reports at both Equifax and Transunion, they showed the presumed fraudster had also tried to open a credit card in her name at a different bank.\n\nFraudster had ID in her name\n\nAs soon as Motazedi found out about the theft, she reported it to the police.\n\nShe then went to the Scotiabank branch which had loaned the imposter money from her line of credit.\n\nA bank employee reviewed the security video and told Motazedi the fraudster had showed one piece of identification in her name.\n\nBut when she met with the branch's manager the next day, he told her the woman had presented two pieces of identification — a driver's licence and what was possibly a health care card.\n\nThe imposter also answered a security question.\n\n\"These things made me very frightened,\" said Motazedi, who has no idea how the imposter stole her identity or knew about her line of credit.\n\nNewsha Motazedi said the branch manager at this Scotiabank in Montreal's west end told her an imposter used fake ID in her name and answered a security question to withdraw money from her line of credit. (Louis-Marie Philidor/CBC)\n\nThe bank would not allow Motazedi to screen the security video.\n\nOn Oct. 8, nearly a month and a half after the theft, Motazedi's line of credit still registered the fraudulent loan in her name.\n\nThe bank was also charging her interest.\n\nMotazedi doesn't think she received the customer service she deserves.\n\n\"They didn't care that much about what has happened,\" said Motazedi, who tried to get updates from both the individual branch and Scotiabank's complaints department.\n\n\"I personally think I need more attention.\"\n\nFraudster found way around security measures\n\nJohn Lawford, the executive director of the Public Interest Advocacy Centre in Ottawa, agrees.\n\n\"I think they could have treated her a hell of a lot nicer,\" said Lawford, who said the bank should have offered Motazedi an interest-free loan or a new line of credit while she waited for the bank's investigation to be completed.\n\nHe also thinks the bank should have stopped charging her interest on the fraudulent loan.\n\n\"It looks bad,\" said Lawford.\n\nIn Motazedi's case, he said it appears the fraudster was able to find a way around some of the bank's security checks and balances,\n\nMotazedi has heard nothing from police, and Lawford says without a police investigation, it's difficult to know exactly where mistakes were made.\n\n\"Was the bank teller at the second location just not trained properly to see the flag and go, 'Oops, excuse me, can I have a little bit more information here?'\" asked Lawford.\n\n\"Or is the bank system not updating in real time?\"\n\nJohn Lawford, executive director of the Public Interest Advocacy Centre in Ottawa, said it may be time for the federal government to beef up the rules when it comes to protecting Canadian bank consumers. (Brian Morris/CBC)\n\nLawford said it's not clear how prevalent this kind of fraud is.\n\nBut he said the Canadian government may need to consider beefing up consumer protection.\n\nIn response to last year's Equifax hack, which exposed the private information of more than 145 million Americans, the U.S. passed a new federal law allowing consumers to freeze their credit for free, said Lawford.\n\nA freeze restricts who can access a consumer's credit file, he explained, making it harder for identity thieves to open new accounts in someone's name.\n\n\"That would probably be a good change for Canada, as well,\" he said.\n\nScotiabank reimburses fraudulent loan\n\nCBC contacted Scotiabank, but it refused to answer questions about how the fraud happened or what security measures it has in place.\n\n\"At Scotiabank, we take the concerns of our customers very seriously and review any instance where our customers feel we have not met their expectations,\" said the bank's director of corporate communications, Annie Cuerrier, in a statement.\n\n\"In these instances, we endeavour to work directly with our customers.\"\n\nLess than 48 hours after CBC emailed Scotiabank about Motazedi's case, however, the bank reimbursed the fraudulent loan. Motazedi was also contacted by a customer service manager.\n\nAlthough she is relieved the bank reimbursed the money, she said she's angry it only acted after CBC got involved with her case.\n\nMotazedi said she no longer trusts the bank's services or security measures, and she plans to close her accounts and move to a different financial institution.\n\nTips to avoid identity theft\n\nTo avoid identity theft, the Canadian Anti-Fraud Centre referred CBC to Consumer Protection Ontario, which has a list of tips on its website.\n\nSuggestions include regularly reviewing your bank statements and reporting any unusual activity as quickly as possible.\n\nConsumers should also make sure their online passwords are strong.", "description": "A Longueuil woman is questioning her bank's security measures after a woman posing as her, reported her debit card lost. The imposter then found a way around some of the bank's security checks and balances to withdraw $2,500 from her line of credit.", "authors": ["Leah Hendry Is A Tv", "Radio", "Online Journalist With Cbc Montreal Investigates. Contact Her Via Our Confidential Tipline", "Or On Email At Montrealinvestigates Cbc.Ca.", "Follow Leah On Twitter"], "top_image": "https://i.cbc.ca/1.5323220.1571253468!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/newsha-motazedi.jpg", "published_at": "2019-10-17"}