{"pub": "washingtonpost", "url": "https://washingtonpost.com/business/2019/09/23/your-retirement-money-may-not-be-safe-you-think", "downloaded_at": "2019-09-23 17:25:01.303711+00:00", "title": "Is your investment insured by the FDIC?", "language": "en", "text": "\n\nretirement plan label on document folder (iStock/iStock)\n\nColumnist\n\nWhen investing, it’s important to know how much risk you can tolerate.\n\nBut a question from a reader had me concerned that some investors may not fully understand how much of their money is at risk.\n\nHere’s the question I received during a recent online chat: “My husband and I both have retirement and investment accounts (a mix of 401(k)s, Roths and brokerage accounts) well over the $250,000 FDIC insurance limit. How much are we covered for? Are our investments insured?”\n\nFirst, let’s talk about the FDIC, or the Federal Deposit Insurance Corp., which is an independent federal agency created by Congress to insure bank deposits. Unfortunately, the reader didn’t specify how their money is invested. They could have cash in a certificate of deposit, or they may own stocks and/or bonds. But David Barr, a spokesperson for the FDIC, pointed out some things this couple should know.\n\nBarr: While banks do sell non-deposit items, they are supposed to disclose that they are not insured. So, if they purchased mutual funds, annuities, etc., from a bank, even if less than $250,000, they would not be insured. Most retirement accounts will be in the form of certificate of deposits (CDs).\n\nRetirement accounts placed in CDs are insured separately from non-retirement deposit accounts at a bank. So, you can have $250,000 in individual accounts or joint accounts and have $250,000 in retirement deposit accounts (CDs) and be fully insured to $500,000.\n\nInsurance works by ownership categories. Each ownership category is insured separately. The four categories are: individual, joint, retirement and trust. Don’t think checking, savings or CDs.\n\nBarr provided an example of how a married couple may be insured.\n\n— Husband has upward of $250,000 in individual accounts — checking, savings or CDs\n\n— Wife has upward of $250,000 in individual accounts — checking, savings or CDs\n\n— Husband and wife have upward of $500,000 in joint accounts with each other — checking, savings or CDs\n\n— Husband has various retirement CDs for upward of $250,000 (Keogh, IRA, Roth, etc.).\n\n— Wife has various retirement CDs for upward of $250,000 (Keogh, IRA, Roth, etc.).\n\n— Husband sets up a revocable trust for the wife as a beneficiary for $250,000.\n\n— Wife sets up a revocable trust for the husband as the beneficiary for $250,000\n\nTotal FDIC insurance: $2 million.\n\n“Notice, nothing mentioned about mutual funds, annuities, etc.,” Barr said. “Those would be the investment products offered by banks that are not deposit accounts, and thus, not insured by the FDIC, regardless of dollar amount.”\n\nBarr suggested that if you are unsure whether your money is federally insured, use this FDIC tool — Electronic Deposit Insurance Estimator, which helps consumers figure out on a per-bank basis how much of their money (if any) exceeds coverage limits.\n\nHere’s some additional information from the Securities and Exchange Commission (SEC) on how your money is protected.\n\n— Federal Deposit Insurance Corp. (FDIC) — Insures savings accounts, insured money market accounts and certificates of deposit (CDs). The FDIC insures deposits only. It does not insure securities, mutual funds or similar types of investments that banks and thrift institutions may offer.\n\n— National Credit Union Administration (NCUA) — The National Credit Union Share Insurance Fund (NCUSIF) is the federal fund that insures credit union members’ deposits in federally insured credit unions up to $250,000. NCUSIF is backed by the federal government.\n\n— Securities Investor Protection Corp. (SIPC) — SIPC, a nonprofit corporation created by Congress, protects investors against the loss of their cash and securities such as stocks and bonds held by a SIPC-member brokerage firm. But there’s a protection limit of $500,000, which includes a $250,000 limit for cash.\n\nPlease note this warning from SIPC: “Investments in the stock market are subject to fluctuations in market value. SIPC was not created to protect these risks. That is why SIPC does not bail out investors when the value of their stocks, bonds and other investment falls for any reason. Instead, in a liquidation, SIPC replaces the missing stocks and other securities when it is possible to do so.”\n\nInvestors may unknowingly place their cash or securities in the hands of a non-SIPC member, the SEC said. Firms are required by law to tell you if they're not SIPC members. SIPC does not provide protection if you are sold worthless stocks and other securities.\n\nRead: Where money meets faith, bring skepticism\n\nEarlier this year, SIPC launched a more user-friendly site. Here’s where to go: www.sipc.org.\n\nWatch the investor protection video, which further explains how SIPC helps investors when a brokerage firm fails and their money is missing.\n\nRead more:\n\nThree financial experts address retirees’ five most pressing worries about the recession and their retirement funds\n\nYour pension plan benefits may not be as ironclad as you think\n\nYou’ve stopped working. Now go out and make money.\n\nYour Thoughts\n\nWhere you aware of the various ways your money is or isn’t protected? Send your comments to colorofmoney@washpost.com. Please include your name, city and state. In the subject line put “Is my money safe.”\n\nRetirement Rants and Raves\n\nI’m interested in your experiences or concerns about retirement or aging. What do you like about retirement? What came as a surprise?\n\nIf you haven’t retired yet, what concerns you financially?\n\nYou can rant or rave. This space is yours. It’s a chance for you to express what’s on your mind. Send your comments to colorofmoney@washpost.com. Please include your name, city and state. In the subject line put “Retirement Rants and Raves.”\n\nLast week’s newsletter focused on a question I get often: Should I pay off my student loans or invest for retirement?\n\nWant to know my answer? Read: Here’s why you should make paying off your student loans a priority over saving for retirement\n\nI asked readers to weigh in on managing student loan debt and retirement savings.\n\nCaren of Alexandria, Va., wrote, “I’m a millennial and was able to pay off my student loans early by working multiple jobs, having three roommates, being lucky enough to have received a lot of scholarship and assistantship money as a student, and being lucky enough to work in an industry that offers good salaries and benefits (especially now that I’m well out of entry-level positions). Did paying off my student loans hurt my retirement savings? I don’t believe so; six figures in retirement savings is a pretty good start for being 30 years old. After paying off my student loans, I cut back on shifts at the restaurants but continued working two to three jobs. This allowed me to increase my 401(k) contributions, open IRAs, open other brokerage accounts, pay off my car, travel, and then purchase a condo. I rented the second bedroom out until my significant other moved in.”\n\n“I had a wake-up moment in my late 20s when I realized that the loan payments I was making only went toward interest, not the overall principal,” wrote Heather from Arlington, Va. “Right then, I was determined to make them go away. I had three loans which were just under $15,000 total. In addition to working full-time at a nonprofit, I did several babysitting gigs (sometimes up to five nights a week), photography gigs, and worked at events to earn extra money, putting it all against the loans. I sold a collection of dolls, which paid off the smallest loan. I won’t lie — I stressed about these a lot. I missed a lot of out of town weddings, and haven’t been out of the country since I was a teenager. Trips were carefully planned, and I stopped buying extra clothes or stuff I truly didn’t need. If I did spend, it was on experiences. I fully paid off my loans in February of last year. Even now, remembering the timeline, it’s satisfying to go through emails and see the three “Payment Fulfillment” letters I saved. I kept logging back in just in case a small interest payment snuck in or something. I’m still tempted to frame the letters. Retirement-wise, I started my 401(k) three years ago and was sure to contribute enough to get my employer’s 5 percent match. I’ve ticked it up one percent the past two years. I do feel like I missed out a bit on doing it in my 20s, and could have done a Roth IRA, but I’ve started one now, am only 32, and my emergency fund and life happens fund are good. Soon I’ll make a higher contribution to the 401(k), and the money that has gone into the emergency savings will go into the Roth. ‘Living your best life’ is great and all, but it cannot be at the expense of future debt and the unknown. Was I stressed? Yep. Am I glad they’re gone? Absolutely.”\n\nAnother reader wrote: “I paid off $30,000 in grad school loans in 2017 (two years after graduating in 2015) by selling off a home I had co-owned with my husband for three years. We bought in an area that was quickly developing and luckily made enough to pay off the loans and put forward another down payment for our next home.”\n\n“I definitely pay double the minimum required to make a dent in my student loans, but I make sure not to miss out the compound interest from my contributions to my retirement accounts,” one reader wrote. “Put simply, I do both. However, I think it makes more sense to be a little more aggressive in retirement savings because they usually all but guarantee a higher [return] than [the interest paid] on my student loans.”\n\nIf you are an investor, keep in mind that there is no guarantee your money will produce the returns you expect. Yes, past performance of stocks — depending on the period selected — will show that equities outperform many other investments. But past performance is no guarantee of future results.\n\nHere’s an interesting read: Five myths about the Great Depression\n\nSubscribe and stay informed\n\nIf you’re viewing this post online, sign up to automatically receive Michelle Singletary’s newsletters right into your email box: “Your Retirement” on Mondays and “Personal Finance” on Thursdays\n\nRead and share Michelle Singletary’s Color of Money Column on Wednesdays and Sundays in The Washington Post. You may also see the column in your local newspaper.\n\nFollow Michelle Singletary on Twitter @SingletaryM and Facebook.", "description": "Some investors may be confused about what government protection they have for their retirement money.", "authors": ["Michelle Singletary", "Personal Finance Columnist", "September At Am", "Michelle Singletary Writes The Nationally Syndicated Personal Finance Column The Color Of Money. Her Award-Winning Column Is Syndicated The Washington Post Writers Group", "Is Carried In Dozens Of Newspapers Nationwide."], "top_image": "https://www.washingtonpost.com/resizer/0KqQ0zPtRZw1hn-zHj4JS8z7cC8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DSAEOWA4A4I6LPL7IYI2MDOY4U.jpg", "published_at": "2019-09-23"}