{"pub": "breitbart", "url": "https://breitbart.com/2nd-amendment/2019/10/29/andrew-pollack-gop-senator-literally-turned-his-back-on-parkland-victims", "downloaded_at": "2019-10-30 00:01:34.197481+00:00", "title": "Andrew Pollack: GOP Senator Turned His Back on Parkland Victims", "language": "en", "text": "Twenty months ago, the worst high school shooting in U.S. history claimed the life of my daughter and 16 other innocent victims. I have responded by dedicating countless hours to ensuring we fix the critical mistakes that led up to the most avoidable mass murder ever.\n\nAlong with other Parkland families, I helped pass legislation, exposed the incompetence within our school system and the Broward County Sheriff’s Office, and, with the help of Gov. Ron DeSantis (R) and the Florida Senate, supported the official removal of Sheriff Scott Israel.\n\nSenate President Bill Galvano conducted the hearing on Israel professionally and fairly, but Sen. Tom Lee (R-Hillsborough) utterly disgraced himself — not merely with his vote but with his conduct. After meeting with me and my family and listening to survivors plead that Israel not be reinstated, Lee had the audacity to simply turn his back on all of us and walk out of the proceedings before the vote was taken.\n\nThe Democrats who snickered at Parkland families and slept through the hearings showed more respect and decorum than Lee, in that they at least stayed in the room. It felt like Lee walked out on me, my son, and all of the families who made the long trip to Tallahassee to seek accountability and justice for this tragedy.\n\nAs the only GOP senator not to vote for the removal of Israel, Lee certainly got the limelight and his 15 minutes of fame. Perhaps that was his goal. But in the process, he bucked the Marjory Stoneman Douglas Commission, ignored the vote of no confidence by sheriffs’ deputies, forgot the testimony of survivors, and closed his eyes to an overwhelming amount of evidence.\n\nAt the end of the day, there is no excuse for the contempt Lee showed my family and the families of other Parkland victims. It is a pain we will never forget.\n\nAndrew Pollack is the author of Why Meadow Died: The People and Politics that Created the Parkland Shooter and Endanger America’s Students. He is also a guest columnist for Down Range with AWR Hawkins.", "description": "Twenty months ago, the worst high school shooting in U.S. history claimed the life of my daughter and 16 other innocent victims.", "authors": ["Andrew Pollack"], "top_image": "https://media.breitbart.com/media/2019/10/Andrew-Pollack-640x335.jpg", "published_at": "2019-10-29"}