{"pub": "nytimes", "url": "https://nytimes.com/2019/10/17/business/retirement-mortgage-debt.html", "downloaded_at": "2019-10-19 16:19:54.364525+00:00", "title": "When a Mortgage Is Part of Your Retirement Plan", "language": "en", "text": "“This will save him probably close to $100,000 in taxes depending on how much he earns over the next few years,” Mr. Mast said.\n\nSome people like hanging onto loans as a hedge against inflation. If the cost of living spikes, they’re repaying the loan with money that is worth less than what they borrowed. Others figure they can earn more on the money in the stock market than they owe on their mortgage. This may be true, especially if they’ve got a longer time horizon to ride out ups and downs in these investments.\n\nWorking on this issue with most clients, Mr. Mast keeps coming back to the fact that paying off debt creates a risk-free return. “That’s really valuable,” he said. “So I’d say, if you’re looking for a good return on your money somewhere else for the next five to 10 years, it has to at least double the rate you’re paying on your loan.”\n\nOne of the biggest arguments for not paying off your mortgage is it keeps some cash in your pocket. Assuming you’re not a reckless spender, it can be helpful to have some liquidity in retirement — both for things you want to do (travel or dining out) and for things you have to do (repairs to your home or cover major health expenses).\n\nWhen major expenses crop up, people sometimes take out a home-equity loan or even a reverse mortgage — but there are costs involved in securing those, and they’re likely to come with higher interest rates than a primary home loan. As you weigh whether to pay down your mortgage, it’s smart to consider just how liquid your assets are. Mr. Halpern, the Virginia-based adviser, recommends comparing whatever you have in pretax retirement accounts against your after-tax savings.\n\n“If I have $2 million in retirement accounts and $200,000 in after-tax accounts, that’s a very low liquid number for someone with $2.2 million put away,” he said. “Let’s say this person wants to pay off their mortgage. The reality is, a) they probably don’t have enough to pay it off and b) it’s going to leave them with nothing but tied-up money.”\n\nWhat’s a good liquidity number? Mr. Halpern wants to see after-tax money equal to 50 percent or more of a client’s tax-deferred savings. “Of course, it depends on how much money you have and how much you owe,” he added.", "description": "Eliminating debt is a great goal. But is it the best option for you?", "authors": ["Peter Finch"], "top_image": "https://static01.nyt.com/images/2019/10/20/business/17Retiring-illo-sub/17Retiring-illo-sub-facebookJumbo.jpg", "published_at": "2019-10-17"}