{"pub": "cnbc", "url": "https://cnbc.com/2019/10/04/access-to-tech-rather-than-capital-could-key-for-small-businesses.html", "downloaded_at": "2019-10-04 09:17:21.546486+00:00", "title": "Access to tech rather than capital could be the key for small businesses, experts say", "language": "en", "text": "Access to capital no longer represents a barrier to the digitalization of small businesses, according to experts speaking on a panel earlier this week.\n\n\"I don't think that, today, it should be a problem… today the technology is not so expensive,\" Javier Garcia Lluis said during the discussion at Innovation Summit Barcelona, which was chaired by CNBC's Steve Sedgwick.\n\n\n\n\"For example, in order to have a very good web page, and to have a very good sales point on the web page, it's something that is not really expensive – it's around 3,000 euros ($3,291),\" Garcia Lluis, who is CaixaBank's corporate director of digital transformation for SMEs, went on to explain.\n\n\n\nGarcia Lluis' sentiments were echoed by the CEO of another Spanish firm, Cyberclick. David Tomas was asked by Sedgwick whether he agreed that access to capital wasn't a barrier. \"I totally agree,\" he said. \"I agree with the idea that technology is not as expensive as it used to be.\"\n\n\n\n\"For an SME it was impossible 20 years ago to think of developing any kind of technology but nowadays you can compete, almost, with big corporations in terms of technology,\" Tomas went on to state, explaining that it was more about applying certain knowledge than the technology in itself.\n\nIt is the case that today's SMEs – small and medium enterprises – are creating websites, using social media and utilizing technologies such as contactless payments to publicize their offerings and streamline operations.\n\n\n\nThere are challenges, however. According to CitySprint's Collaborate U.K. 2018 report, while 79% of SMEs think that investing in technological innovation is important, 25% have spent less than 10% of their budgets on new technology.\n\n\n\n\"Technology now, it's not a matter of expensive or not expensive, but it's a matter of access to the technology,\" Beatriz Remon, chief digital officer for IBM Spain, Greece, Portugal and Israel, said.", "description": "The discussion took place at at Innovation Summit Barcelona and was chaired by CNBC's Steve Sedgwick.", "authors": ["Anmar Frangoul"], "top_image": "https://image.cnbcfm.com/api/v1/image/106164299-1570177076811gettyimages-671372147.jpeg?v=1570177112", "published_at": "2019-10-04"}