{"pub": "businessinsider", "url": "https://businessinsider.com/dictators-strongmen-military-parades-world-2019-7", "downloaded_at": "2019-10-02 00:36:52.706258+00:00", "title": "China's epic military parade makes Trump's July 4 bash look puny. Here's how 15 parades for dictators compare.", "language": "en", "text": "China held a massive military parade on Tuesday to celebrate its 70th National Day. 15,000 troops and several new weapons systems were part of the demonstration.\n\nUS President Donald Trump observed France's Bastille Day celebration in 2017. He wanted a similar event in the US, but critics were concerned about the cost — and parallels to military parades in totalitarian countries. Trump's \"Salute to America\" took place on July 4, 2019, and featured flyovers from Air Force One, a B-2 stealth bomber and the Blue Angels.\n\nHere's a look at how military parades in states led by strongmen compare to Trump's July 4 event.\n\nVisit Business Insider's homepage for more stories.\n\nThe Chinese Communist Party (CCP) held a massive 70th anniversary parade on October 1, featuring 15,000 troops and several pieces of cutting edge military technology.\n\nUS President Donald Trump held a military parade on July 4th with tanks and flyovers. But it wasn't without its critics — some said it was reminiscent of the military parades dictators and other strongmen hold.\n\nStill, it wasn't close to the scale held by authoritarian states. Trump's parade had roughly two dozen military aircraft, China's had 160. Trump's had two parked tanks and two static fighting vehicles, China's had combat drones, tanks and intercontinental missiles that could strike the US.\n\nRead more: 7 intimidating images from China's 70th anniversary that show just how powerful its military has become\n\nWhile the military firepower at Trump's \"Salute to America\" may have been impressive — it included appearances from the Blue Angels and Air Force One — these military parades led by China and other authoritarian leaders are much more formidable displays of firepower to the world, and their own citizens.", "description": "As China just showed, President Trump's much-touted \"Salute to America\" on July 4th had nothing on these military parades from around the world.", "authors": ["Ellen Ioanes"], "top_image": "https://image.businessinsider.com/5d9399572e22af63887ae056?width=1200&format=jpeg", "published_at": "2019-10-01"}