{"pub": "businessinsider", "url": "https://businessinsider.com/kambr-raises-4-million-to-help-airlines-manage-online-bookings-2019-9?r=rr", "downloaded_at": "2019-09-16 12:01:37.196152+00:00", "title": "A startup just raised $4 million to help airlines compete with online travel giants like Expedia and Google Flights", "language": "en", "text": "Former advertising exec Jason Kelly wants to change how airlines manage bookings and operations.\n\nAlong with cofounders Martin Kaduc and Michael Peters, Kelly is launching the startup Kambr today and announcing $4 million in seed funding. VC firms Founder Collective, Global Founders Capital, Studio VC, Silicon Badia, C2 Ventures Capital Partners, and TXV Partners participated in the round.\n\nKambr wants to sell software to big airlines that helps them compete with online travel agents. Specifically, Kambr wants to help with a practice in the airline industry called revenue management that airlines use to monitor when and how people book flights.\n\nAirlines typically hire analysts specifically tasked with looking at data to see at which sites and how far out consumers book a trip. Using the data, an analyst may decided to charge $100 for a seat one week and $500 for the same seat a month later.\n\nBut revenue management is a big problem for legacy airlines that don't have the same kind of sophisticated technology that online travel agents have. Research from Expedia found that consumers visit travel websites 38 times before they book.\n\nAccording to Kelly, software that airlines use today, like Pros and Sabre, was built before the online travel industry took off. As airlines look to catch up with online travel agents like Google Flights, Hopper, and Expedia, Kambr plans to build and pitch software to big airline companies. He said the software will use some artificial intelligence technology but will also be built for analysts to use.\n\nKelly did not name clients but said that Kambr's business will be based on a software as a service model that charges airlines a monthly fee. According to research from Forrester Research, the online travel industry will be a $1 trillion market by 2023.\n\n\"Tools that analysts have at airlines haven't been built for a modern-day environment,\" Kelly said. \"You can't just jump to fully autonomous, artificial intelligence capabilities to manage all of [an airline's] inventory — there is a human and computer interaction that needs to evolve.\"\n\nKambr has 22 employees and plans to double headcount in the next year, Kelly said.\n\nKelly says that airlines' problems are similar to marketers' challenges\n\nBefore Kambr, Kelly held top leadership positions at advertising and media companies including Time Inc., Millennial Media, LiveIntent, and Laundry Service. He also served as chief revenue officer of AdMeld before Google acquired it.\n\nWhile Kelly has ridden the wave of online advertising throughout his career, he worked at airlines like Frontier Airlines and Virgin America in the 90s and 2000s and said he had always wanted to work in aviation and that there are parallels between the airline and advertising industries.\n\n\"This is something that I've truly been working on my whole professional life,\" Kelly said.\n\nSimilar to how airlines struggle to get consumers to convert, advertisers also struggle with serving consumers relevant ads.\n\nKelly said that Kambr plans to eventually roll out an ad-tech product that helps airlines target consumers with ads, similar to existing demand-side platform technology that advertisers use to buy ads programmatically.\n\n\"That's absolutely on our roadmap — I've run both demand and supply-side platforms so that technology is very known to me,\" Kelly said. \"It's not going to launch in 2019 or 2020 but that's what clients are asking for.\"", "description": "Kambr plans to build revenue management software that big airlines can use to monitor how people buy airline flights.", "authors": ["Lauren Johnson"], "top_image": "https://amp.businessinsider.com/images/5d7bd9182e22af1b8a1be605-960-480.jpg", "published_at": "2019-09-16"}