{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/vaticans-smart-rosary-app-hacked-15-minutes-after-launch", "downloaded_at": "2019-10-28 00:29:00.054055+00:00", "title": "Vatican's Smart Rosary App Hacked 15 Minutes After Launch", "language": "en", "text": "Image: Vatican News\n\nEarlier this month the Vatican unveiled an eRosary wearable that tracked prayer progress and required users to make the sign of the cross to activate.\n\nIt comes with a dedicated app... which was hacked within 15 minutes of going live.\n\nFortunately, this major security flaw was discovered by French security researcher Baptiste Robert, rather than someone with more nefarious motives.\n\nRobert told CNET that the flaw allowed someone to gain access to a user's 'Click And Pray' account, as well as their personal information, due to the how the login credentials worked.\n\nThe app requires an email to sign up, but issues a PIN to use for login rather than a password.\n\nHowever, the app sent this PIN request over its network. This means that if anyone was looking at the network traffic could see the PIN response that was emailed.\n\nTo make matters worse, if someone intercepted the PIN and used it to login a user's account, the app would log out the original user from their own device.\n\nThis flaw also enabled people to request new PIN codes with ease, which Robert demonstrated to CNET.\n\nGaining access to someone's Click And Pray account gave a hacker access to the user's personal information such as birthday, gender, height and weight, as well as the logged information such as the amount of steps taken, distance traveled and times prayed.\n\nThey could also delete the account from inside the app.\n\nConsidering that the app also asks for location data and call permission - this is an alarming amount of information to be so easily accessible to someone looking to phish for user info.\n\nFortunately, a fix for this security flaw has since been issued.\n\nStill, it's an important lesson for wearable and app companies to remember. As tech and people become more connected, the need for airtight security to protect their information needs to be at the forefront of development.\n\n[CNET]", "description": "Earlier this month the Vatican unveiled an eRosary wearable that tracked prayer progress and required users to make the sign of the cross to activate. It comes with a dedicated app... which was hacked within 15 minutes of going live....", "authors": ["Tegan Jones"], "top_image": "https://edge.alluremedia.com.au/m/g/2019/10/erosary.jpeg", "published_at": "2019-10-28"}