{"pub": "independent", "url": "https://independent.co.uk/voices/boris-johnson-john-bercow-prorogue-jacob-rees-mogg-house-of-commons-a9099761.html", "downloaded_at": "2019-09-10 23:40:21.725634+00:00", "title": "Prorogue it all, prorogue absolutely everything, and do not un-prorogue any of it until it promises to do better", "language": "en", "text": "Oh just prorogue everything. Bring in black rod, with her little sword. Send for the serjeant-at-arms to pick up the mace and, if at all possible, spray it directly into my eyes.\n\nI’ve seen enough. I’ve had it. I’m done.\n\nProrogue Dominic Cummings, wandering out from his north London townhouse, pastel blue jumper tossed over his shoulder like an Alan Turing cosplay character, telling the waiting journalists to “get out of London and talk to some people who aren’t rich Remainers.”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nProrogue this absurd “man of the people schtick”, from a private schoolboy who has married into the landed gentry, has his own “tapestry room” and whose principle achievement in public life, at the age of 47, is to deliver a billion pound payday to some very grateful hedge fund managers who short-sold Britain overnight in June 2016.\n\nProrogue the honours system. That should have been done years ago. Prorogue Geoffrey Boycott, sorry Sir Geoffrey Boycott, who is only too happy to go on the radio and announce that he voted Leave in protest against the French criminal justice system that convicted him for assaulting his girlfriend in a French hotel room in 1998 (something he has always denied). Because all that’ll change once we’re out. Course it will. Prorogue all that right away.\n\nShape Created with Sketch. ‘Brexit is like...’ The Top 20 Twitter analogies Show all 20 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. ‘Brexit is like...’ The Top 20 Twitter analogies 1/20 The Beatles \"Brexit is like Liverpool trashing all its links to The Beatles and spending all its time and energy building Esther McVey World.\" Shutterstock / terry bouch 2/20 The number seven \"Trying to understand Brexit is like trying to figure out what colour the letter seven smells like.\" Shutterstock / jgl247 3/20 Pilots \"Brexit is like being in a plane hurtling towards the ground with the pilot and co-pilot arguing over who would crash it better.\" Shutterstock / View Apart 4/20 Operation \"Brexit is like going to the doctor, being told you need an operation, agreeing to it, then finding out they are going to cut off your cock & sew it to your forhead... ...but refusing to get a 2nd opinion.\" Shutterstock / Dmytro Zinkevych 5/20 Wall \"My mentions have taught me that Brexit is like Trump’s wall. For its devoted fans it has a symbolic value totally unrelated to its workability, its true cost or the glaring self-interest of its proposers, whereas non-believers see nothing but a deranged and costly vanity project.\" Shutterstock / Tony Craddock 6/20 Skydive \"brexit is like a sitcom where at the start of the episode the main character tells a casual lie about being able to skydive to impress someone and now they're at the end of the episode in a plane about to jump\" Shutterstock / Mauricio Graiki 7/20 Crumble \"Brexit is like if Farage & Johnson said “May we make you an *amazing* apple crumble?” & then 18 months later handed you a leaking bag of maggots & offal. You shouldn’t have to eat it.\" Shutterstock / CKP1001 8/20 Punch \"‘Asking me to support Brexit is like asking me to punch my constituents in the face,’ said Anna Turley, the Labour MP for Redcar, which voted 66:34 to leave. ‘It doesn’t make it easier if you tell me my constituents want to be punched.’\" Shutterstock / ZoneCreative 9/20 Fire \"Watching this government deal with Brexit is like being locked outside your house while you can see people inside setting fire to the furniture as the law’s telling you you can’t go in and stop them.\" Shutterstock / Gorb Andrii 10/20 Villains \"Brexit is like living in a superhero movie that has no heroes, just loads of incompetent villains fighting over who is more evil.\" Shutterstock / Aisyaqilumaranas 11/20 Book \"Brexit is like a bad novel. You are so far into it you just want to skip to the end to see if it ended as badly as it had begun. (You throw the book at the wall when you realise it is the first book in a trilogy).\" Shutterstock / Stokkete 12/20 Cricket \"Watching Brexit is like trying to reverse engineer the rules of cricket by listening to the radio. I have absolutely no idea what is going on.\" Shutterstock / ChrisVanLennepPhoto 13/20 Car \"Brexit is like the UK took a motorway exit, then found the road turning into a rutted grassy track, and now the car's stuck in a muddy field, there's no help in sight, it's getting dark, everyone's shouting at the driver, and the passengers are beginning to worry about food.\" Shutterstock / Kolbakova Olga 14/20 Cable \"Watching Brexit is like watching someone try and plug a coaxial aerial cable into a HDMI port. There is a lot of anger, a lot of swearing, and a lot of remarks about how this used to work before.\" Shutterstock / Elnur 15/20 Windows \"#Brexit is like going back to Windows 3.1\" 16/20 Liars \"I'm sure most people remember a kid at school who just lied constantly? Who refused to back down, however outlandish the lie, and however it was disproven? Brexit is like all of those kids from every school have got together, and are now running the country.\" Shutterstock / chairavee laphom 17/20 Donors \"Trying to extricate ourselves from the EU, and Brexit, is like a multiple transplant patient attempting to give all the donated organs back.\" Shutterstock / Luuuusa 18/20 Electricity \"Paying my taxes to pay for Brexit is like asking a guy on death row if he has any change to put in the meter for the electric chair.\" Shutterstock / Fer Gregory 19/20 Bandersnatch \"Brexit is like watching Bandersnatch with your bae where bae is 70,000 Conservative party members hogging the PlayStation controller & choosing the most WTF option every time.! Shutterstock / George Dolgikh 20/20 Constipation \"Brexit is like the shit that never comes. Total constitutional constipation. Ironically Brexit also sounds like a constipation relief medicine.\" Shutterstock / sasha2109 1/20 The Beatles \"Brexit is like Liverpool trashing all its links to The Beatles and spending all its time and energy building Esther McVey World.\" Shutterstock / terry bouch 2/20 The number seven \"Trying to understand Brexit is like trying to figure out what colour the letter seven smells like.\" Shutterstock / jgl247 3/20 Pilots \"Brexit is like being in a plane hurtling towards the ground with the pilot and co-pilot arguing over who would crash it better.\" Shutterstock / View Apart 4/20 Operation \"Brexit is like going to the doctor, being told you need an operation, agreeing to it, then finding out they are going to cut off your cock & sew it to your forhead... ...but refusing to get a 2nd opinion.\" Shutterstock / Dmytro Zinkevych 5/20 Wall \"My mentions have taught me that Brexit is like Trump’s wall. For its devoted fans it has a symbolic value totally unrelated to its workability, its true cost or the glaring self-interest of its proposers, whereas non-believers see nothing but a deranged and costly vanity project.\" Shutterstock / Tony Craddock 6/20 Skydive \"brexit is like a sitcom where at the start of the episode the main character tells a casual lie about being able to skydive to impress someone and now they're at the end of the episode in a plane about to jump\" Shutterstock / Mauricio Graiki 7/20 Crumble \"Brexit is like if Farage & Johnson said “May we make you an *amazing* apple crumble?” & then 18 months later handed you a leaking bag of maggots & offal. You shouldn’t have to eat it.\" Shutterstock / CKP1001 8/20 Punch \"‘Asking me to support Brexit is like asking me to punch my constituents in the face,’ said Anna Turley, the Labour MP for Redcar, which voted 66:34 to leave. ‘It doesn’t make it easier if you tell me my constituents want to be punched.’\" Shutterstock / ZoneCreative 9/20 Fire \"Watching this government deal with Brexit is like being locked outside your house while you can see people inside setting fire to the furniture as the law’s telling you you can’t go in and stop them.\" Shutterstock / Gorb Andrii 10/20 Villains \"Brexit is like living in a superhero movie that has no heroes, just loads of incompetent villains fighting over who is more evil.\" Shutterstock / Aisyaqilumaranas 11/20 Book \"Brexit is like a bad novel. You are so far into it you just want to skip to the end to see if it ended as badly as it had begun. (You throw the book at the wall when you realise it is the first book in a trilogy).\" Shutterstock / Stokkete 12/20 Cricket \"Watching Brexit is like trying to reverse engineer the rules of cricket by listening to the radio. I have absolutely no idea what is going on.\" Shutterstock / ChrisVanLennepPhoto 13/20 Car \"Brexit is like the UK took a motorway exit, then found the road turning into a rutted grassy track, and now the car's stuck in a muddy field, there's no help in sight, it's getting dark, everyone's shouting at the driver, and the passengers are beginning to worry about food.\" Shutterstock / Kolbakova Olga 14/20 Cable \"Watching Brexit is like watching someone try and plug a coaxial aerial cable into a HDMI port. There is a lot of anger, a lot of swearing, and a lot of remarks about how this used to work before.\" Shutterstock / Elnur 15/20 Windows \"#Brexit is like going back to Windows 3.1\" 16/20 Liars \"I'm sure most people remember a kid at school who just lied constantly? Who refused to back down, however outlandish the lie, and however it was disproven? Brexit is like all of those kids from every school have got together, and are now running the country.\" Shutterstock / chairavee laphom 17/20 Donors \"Trying to extricate ourselves from the EU, and Brexit, is like a multiple transplant patient attempting to give all the donated organs back.\" Shutterstock / Luuuusa 18/20 Electricity \"Paying my taxes to pay for Brexit is like asking a guy on death row if he has any change to put in the meter for the electric chair.\" Shutterstock / Fer Gregory 19/20 Bandersnatch \"Brexit is like watching Bandersnatch with your bae where bae is 70,000 Conservative party members hogging the PlayStation controller & choosing the most WTF option every time.! Shutterstock / George Dolgikh 20/20 Constipation \"Brexit is like the shit that never comes. Total constitutional constipation. Ironically Brexit also sounds like a constipation relief medicine.\" Shutterstock / sasha2109\n\nProrogue Theresa May as well, if she can be prised away from pointing at potholes for long enough. Did no one tell her that, given she was filmed and recorded in 2016 saying David Cameron’s own resignation honours list “made her retch”, she would be somewhat exposed doing her own, identical, arguably even more egregious one?\n\nPresumably no one did, because it would have been either Nick Timothy or Fiona Hill’s job to do that, and she had to sack them in 2017 for their role in running the worst general election campaign of modern times, wrecking her career, her party and indeed her country.\n\nIt would have been their job to tell her, for example, not to give both of them CBEs, but because she sacked them, no one did.\n\nIf Nick Timothy, in particular, had he still been around, might have been able to advise her that giving Nick Timothy a CBE would be a very foolish move, because Nick Timothy has spent the last two years writing weekly newspaper columns blaming her for various things for which he was sacked.\n\nIf you really wanted to, you might be prepared to defend David Cameron’s resignation honours list, in that his entirely reckless gamble ended their careers, and thus a few letters after their names might perhaps be of some vague comfort whilst staring at the phone and hoping it might ring.\n\nTheresa May, on the other hand, has ennobled the people who finished her off. It is not a mistake you can imagine her hero, Sir Geoffrey Boycott, making.\n\nProrogue all that then. And prorogue indefinitely the House of Commons.\n\nProrogue the Labour Party, and its MPs writing the word ‘SILENCED’ on pieces of paper and waving them about in the chamber of the House of Commons at 1am.\n\nProtest is the recourse for those who do not have political power. There is an election that’s not happening and a no-deal Brexit that’s been delayed, at least for the time-being, that will show you the Labour Party still has plenty of it.\n\nThey don’t want you to know about that though, that’s why Jeremy Corbyn has already started campaigning for the election he himself blocked. So prorogue him as well.\n\nProrogue the SNP. All they want to do is prorogue the United Kingdom, so prorogue them at once. Prorogue the Brexit Party, the grandest political con there has ever been. It has somehow convinced several million people that no-deal Brexit is in their interests, while knowing full well that the moment those people find out the truth will be the moment it is too late.\n\nProrogue the Lib Dems, who’ll take absolutely anyone, illiberal, anti-democrat or otherwise. Prorogue the Greens. I don’t know why, but there’s bound to be a reason, there always is.\n\nProrogue the Queen. She’ll only un-prorogue everything if you don’t.\n\nProrogue Jacob Rees-Mogg, while we’re here. Prorogue his suits that don’t fit and his made-up voice.\n\nProrogue John Bercow, prorogue “chuntering from a sedentary position”, prorogue “pettifogging objections”, prorogue “soothing medicaments”, prorogue it all as a matter of public emergency.\n\nProrogue the negotiations that aren’t even happening. Prorogue Boris Johnson, prorogue every word that escapes from his unbearable gob, not one of which has been true in the last six abysmal weeks.\n\nProrogue the backstop, prorogue the withdrawal agreement. Prorogue the people as well. They voted for all this.\n\nProrogue the second referendum, prorogue the first referendum. Bring back David Cameron and prorogue him immediately.\n\nProrogue it all up and prorogue away the key.\n\nAll of British politics, every last bit of it is in absolutely dire need of prorogation. And do not de-prorogue until it’s had a long, desperate look at itself and promised to do better. Then prorogue it again.", "description": "Oh just prorogue everything. Bring in black rod, with her little sword. Send for the serjeant-at-arms to pick up the mace and, if at all possible, spray it directly into my eyes. I’ve seen enough. I’ve had it. I’m done. Prorogue Dominic Cummings, wandering out from his north London townhouse, pastel blue jumper tossed over his shoulder like an Alan Turing cosplay character,", "authors": ["Tom Peck"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/10/15/boris-johnson.jpg", "published_at": "2019-09-10"}