{"pub": "fox", "url": "https://foxnews.com/entertainment/hilary-duff-sons-homework-stopped-real-school-3rd-grade", "downloaded_at": "2019-10-21 15:05:31.074592+00:00", "title": "Hilary Duff struggles with son's homework after admitting she ‘stopped going to real school in 3rd grade'", "language": "en", "text": "Hilary Duff is having a hard time with her son’s homework.\n\nThe former “Lizzie McGuire” actress recently lamented her struggle to help her 7-year-old son, Luca, with his homework on Instagram.\n\n“Homework is already no joke in 2nd grade,” Duff jokingly lamented.\n\nHILARY DUFF ANNOUNCES ENGAGEMENT TO MATTHEW KOMA\n\nThe Disney star, who is set to star in a future “Lizzie McGuire” reboot, noted that she stopped going to school from an early age due to her acting career.\n\n“I stopped going to 'real' school in 3rd grade so I’m actually doomed...,” she wrote on Instagram. “I am left scratching my head [all] the time looking at his homework and I’m terrified for next year!\"\n\nIn August, Duff announced the return of “Lizzie McGuire” in a reboot that is set to stream on Disney+. The original hit television series aired from 2001-2004 and followed a 13-year-old Lizzie in her struggles to become a popular girl in high school. The reboot will follow a 30-year-old McGuire as she works as a fashion apprentice and navigates life as an adult through New York City.\n\nHILARY DUFF REVEALS HER BABY DAUGHTER BANKS HAS COLIC IN CANDID INSTAGRAM POST: ‘IT’S REALLY HARD’\n\nIn an interview with People, Duff revealed that son Luca was excited to see his mother return to the small screen in her most famous role.\n\n“I recently started talking to him about Lizzie McGuire and showing little clips on YouTube,” Duff said. “I think he’s pretty fascinated to see me so young, not looking the same, but obviously he knows that’s his mom,” she added.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSince 2017, Duff has been in a relationship with singer Matthew Koma. In 2018, they welcomed a daughter, Banks. The duo's engagement was announced in May. She had her son Luca in 2012 with ex-husband and NHL player Mike Comrie.", "description": "Hilary Duff is having a hard time with her son’s homework. The former “Lizzie McGuire” actress recently entailed her struggle to help 7-year-old son Luca with his homework on Instagram.", "authors": ["Andy Sahadeo"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/AP19236231557177.jpg", "published_at": "2019-10-21"}