{"pub": "businessinsider", "url": "https://businessinsider.com/how-to-connect-xbox-one-controller-to-ipad", "downloaded_at": "2019-10-29 15:12:21.950216+00:00", "title": "How to connect an Xbox One controller to your iPad in 3 steps with Bluetooth pairing", "language": "en", "text": "You can connect an Xbox One controller to your iPad to bring your tablet gaming to a new level of enjoyment and competition.\n\nThe process of pairing a controller to your iPad is quick, and will be easy for anyone comfortable pairing other Bluetooth devices.\n\nIf your Xbox One console is nearby, make sure to power it down completely or it will disrupt the attempted iPad pairing.\n\nVisit Business Insider's homepage for more stories.\n\nAn iPad is ideal for many activities — it's a great medium for sketching, viewing photos or videos, and managing calendars, email, and more.\n\nBut when it comes to gaming, tapping on that glass screen isn't at all the same as the responsive and tactile experience you get with a great controller.\n\nIf you want to take your iPad gaming up a notch, you can pair it with a Bluetooth wireless Xbox One controller.\n\nHere's how to do it.\n\nCheck out the products mentioned in this article:\n\nHow to connect an Xbox One controller to your iPad\n\n1. Put the controller in pairing mode by holding the Xbox button and the pair button until the Xbox button begins to flash, indicating pairing mode.\n\nHold down the Xbox and pairing buttons. Business Insider\n\n2. Launch the iPad's Settings app, then navigate to the Bluetooth tab.\n\nMake sure your Xbox One console is not automatically connecting with the controller you are trying to pair by switching it off or moving farther away from it. Steven John/Business Insider\n\n3. The controller should soon appear under the Other Devices section. Once it does, simply tap it to pair with your iPad.\n\nRelated coverage from How To Do Everything: Tech:", "description": "You can connect an Xbox One controller to your iPad to bring your tablet gaming to a new level of enjoyment and competition. Here's how to do it.", "authors": ["Steven John"], "top_image": "https://image.businessinsider.com/5db74a75dee0194b2757a108?width=1200&format=jpeg", "published_at": "2019-10-29"}