{"pub": "politico", "url": "https://politico.com/news/2019/10/20/mike-pompeo-ukraine-trump-051989", "downloaded_at": "2019-10-20 16:55:55.423194+00:00", "title": "Mike Pompeo declines to be pinned down on Ukraine probe", "language": "en", "text": "“I have news for everybody: Get over it. There's going to be political influence in foreign policy,” Mulvaney said, a reversal of past White House denials of the idea of international quid pro quo by President Donald Trump.\n\nPompeo on Sunday said he would leave it to the chief of staff to explain his words: “I'm not going to get into hypotheticals and secondary things based on what someone else has said.”\n\nStephanopoulos countered, “Except it's not a hypothetical, we saw the chief of staff —”\n\n“George, you just said, 'If this happened.' That is, by definition, a hypothetical.”\n\n“The chief of staff said it did.”\n\nA pause. Then, “George, you asked me if this happened. It's a hypothetical. I've told you what I observed, what I saw the process related to this very funding.”\n\nPompeo was also cautious in commenting on attorney Rudy Giuliani's involvement and former U.S. ambassador to Ukraine Marie Yovanovitch's claim that she was removed from her post despite being told she did nothing wrong.\n\nWas Giuliani acting with Pompeo’s blessing and supervision? “I've had one consistent policy as the secretary of state, to not talk about internal deliberations inside the administration. I'm not going to change that policy for you here this morning.”\n\nDid Pompeo know what Giuliani was doing? “I don't talk about internal deliberations inside the administration.”\n\nWhy did Pompeo approve Yovanovitch's removal? “I'm not going to get into personal matters inside the State Department.”", "description": "", "authors": [], "top_image": "https://static.politico.com/48/35/f969b8604e8ba88eaa45c6791a46/20191020-mike-pompeo-gty-773.jpg", "published_at": "2019-10-20"}