{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7563119/Young-sisters-alcohol-poisoning-dad-gives-wine-instead-food.html", "downloaded_at": "2019-10-11 20:42:31.807739+00:00", "title": "Young sisters get alcohol poisoning after dad gives them wine instead of food", "language": "en", "text": "Two young sisters have been hospitalised in critical condition after being severely poisoned with alcohol in Ukraine.\n\nThe four-year-old Maryna and her two-year-old sister Luda were found unconscious in the street in the village of Chaplynka in southern Kherson region.\n\nReports say the girls were left at risk of death after their father, named as Mykola, gave them wine for lunch.\n\nFour-year-old Maryna, pictured, was seen with her younger sister, Luda, 2, singing in the street and unable to balance before a neighbour found them unconscious on the ground\n\nThe girls said their father had filled their bottles with wine when they asked for food at lunch time. Mykola, the girl's dad, has now been arrested and the girls are in a recovery centre\n\nWhen the neighbour, Tetiana Shotik, found them they were immediately rushed to intensive care. When Shotik tried to wake the girls up she said she was unable to. Because of this and the alcohol smell, they decided to call the ambulance\n\nThe father is said to have been babysitting the children while their mother Olga undertook seasonal work in another region of the country.\n\nOn October 3rd, when his daughters asked for food at lunch time, Mykola, who was intoxicated at the time, filled their bottles with wine instead of milk, local media reported.\n\nSoon after that, the girls were found unconscious near their house, neighbours said.\n\nTetiana Shotik, a woman living next door said to local media: 'The girls were lying motionless on the ground. We tried to wake them up but failed. There was a strong smell of alcohol and we called an ambulance.\n\nTetiana Shotik, pictured, said that the girls were singing and unable to stand when she found them\n\nPictured is the area the girls played in in the village. When Tetiana found them she said she thought they were playing some kind of game\n\n'Before that I saw them in the street near their house. They were singing something unintelligible and were unsteady on their feet.\n\n'It looked strange but I thought they were playing some kind of a game.\n\n'They had baby bottles with a pink liquid in their hands.'\n\nSergey Minaev, the head of the intensive care unit of Chaplyn Regional Hospital said that the girls were very close to death. He is treating them with medication and they are getting better\n\nMaryna and Luda were rushed to intensive care in life-threatening condition and diagnosed with acute alcohol poisoning.\n\nSergey Minaev, the head of the intensive care unit of Chaplyn Regional Hospital said: 'The girls were hospitalised in a state of alcoholic coma and were on the verge of death.\n\n'We performed a series of necessary procedures and, fortunately, managed to save them.\n\n'The children are being given medications and feel better. Their lives are not in danger now.'\n\nMedical staff say the sisters were severely neglected and infected with lice.\n\nA female orderly said: 'The girls were black from dirt. We spent two hours trying to wash it off.\n\nThe female orderly, pictured, said the girls were black from the dirt they had picked up. She added that it took two hours to try to wash them\n\nBoth sisters are now in a recovery clinic until authorities can find their mother or decide what to do with their father. The government may choose to remove the couple's parental rights\n\nThe two girls were dirty and had lice in their hair and the orderly who looked after them said they were neglected. Pictured is an image of the girls' house in the village of Chaplynka in Russia's southern Kherson region\n\n'Their clothes were so filthy that we just threw them away.\n\n'The younger girl’s hair was a huge knot and it took a lot of time to untangle it.'\n\nAfter the incident, the irresponsible father, Mykola, was taken to a local police station for interrogation.\n\nWitnesses said the man was so drunk that he could not walk and cops had to carry him by his arms and legs out of his house and load into the police car.\n\nPolice spokesman Yaroslav Shanko said: 'The father said that the children drank wine on their own and he knew nothing about it.\n\n'But the girls said that it was their father who gave them the beverage.'\n\nAccording to reports, the father filled his daughters' bottles with wine after failing to find milk in the fridge and the sisters drank about 0.5 pints of the beverage each.\n\nPolice launched a criminal case for failure to fulfill parental duties against Mykola and reported the incident to social services.\n\nThe girls can be seen here lying down with fluids attached for their recovery. Their father faces up to five years if found guilty of neglect\n\nOfficers are now tracking the whereabouts of the girls’ mother Olga while social services are collecting documents to sue the parents and deprive them of parental rights.\n\nMaryna and Luda are going to be placed inside recovery centre until the court has made a decision.\n\nThe father faces up to five years in prison if found guilty.", "description": "Two young sisters have been hospitalised in critical condition after being severely poisoned with alcohol in Ukraine. Maryna, 4, and sister Luda, 2, were found unconscious on the street.", "authors": ["Roksana Panashchuk For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/14/19591070-0-image-a-129_1570801792772.jpg", "published_at": "2019-10-11"}