{"pub": "reuters", "url": "https://reuters.com/article/us-global-markets/oil-prices-slip-on-saudi-pledge-financial-markets-look-to-fed-idUSKBN1W303M", "downloaded_at": "2019-09-18 12:50:13.742818+00:00", "title": "Oil prices slip on Saudi pledge, financial markets look to Fed", "language": "en", "text": "LONDON (Reuters) - Oil prices cooled on Wednesday as Saudi Arabia’s pledge to quickly restore production eased supply worries, while caution ahead of an expected U.S. interest rate cut kept wider financial markets in tight ranges.\n\nFILE PHOTO: Signage is seen outside the entrance of the London Stock Exchange in London, Britain. Aug 23, 2018. REUTERS/Peter Nicholls/File Photo\n\nEuropean stocks were largely subdued, with luxury stocks one of the few sectors seeing activity. Swiss luxury goods group Richemont fell more than 5%, weighing on the pan-European STOXX 600 index, while Swatch declined 3.3% after a bearish note by UBS.\n\nThe pan-European STOXX 600 index edged 0.5% higher.\n\nThe MSCI world equity index, which tracks shares in 47 countries, edged down 0.02%.\n\nWall Street futures pointed to a softer opening.\n\nBrent crude futures dipped 0.5% to $64.23 a barrel, having conceded a chunk of their gains made after the weekend attack on Saudi Arabian oil facilities.\n\nU.S. West Texas Intermediate (WTI) crude CLc1 lost 0.8% to $58.86 per barrel.\n\nSaudi Energy Minister Prince Abdulaziz bin Salman on Tuesday sought to reassure markets, saying the kingdom would restore its lost oil production by month-end having recovered supplies to customers to the levels they were prior to the weekend’s attacks. The comments prompted oil prices to tumble 6% on Tuesday.\n\n“I would think a spike in oil prices will likely prove to be short-term given that the global economy isn’t doing too well,” said Akira Takei, bond fund manager at Asset Management One.\n\nStill, heightened geopolitical tensions underpinned oil as well as some safe-haven assets such as U.S. bonds.\n\nA U.S. official said on Tuesday the United States believes the attacks originated in southwestern Iran, an assessment that could heighten the rivalry between Tehran and Riyadh. Iran has denied involvement in the strikes.\n\nAdding to uncertainties in the Middle East were exit polls from Israel’s election, which showed the race too close to call suggesting Prime Minister Benjamin Netanyahu’s fight for political survival could drag on.\n\nSpot gold was steady at $1,501.34 per ounce.\n\nIn a subdued session ahead of the Federal Reserve meeting later on Wednesday, Euro zone benchmark 10-year bond yields fell 2-3 basis points. Germany’s 10-year bond yield dipped to -0.49%, holding below last week’s six-week high of -0.43%.\n\nSpain’s bond market shrugged off news that the country will hold its fourth election in four years on Nov. 10, after rival parties failed to break a months-long impasse in a deeply fragmented parliament.\n\nWhile a 25-basis point rate cut by the Fed is seen as near-certain, investors look to the statement and economic projections from Fed policymakers, given signs of deep disagreements among them.\n\n“People are very cautious right now,” said Christophe Barraud, at Market Securities in Paris. “They’re waiting for the Fed meeting and potential new development in Saudi Arabia.”\n\n“For the Fed meeting, people are not betting on a big positive surprise.”\n\nThe ongoing U.S.-China trade war has raised policymakers’ concerns about slowing factory output although resilient domestic consumption has given hawks some reasons to worry about cutting rates too hastily.\n\nPossibly further complicating their discussions, short-term U.S. interest rates shot up this week, with overnight repo rates rising to 7%, due largely to seasonal factors such as huge payments for taxes and bond supply.\n\nThat prompted the New York Fed to conduct its first repo operation in more than a decade to inject funds to stressed money markets.\n\nThe New York Federal Reserve said late Tuesday it would conduct a repurchase agreement operation early on Wednesday “in order to help maintain the federal funds rate within the target range of” 2.00% to 2.25%.\n\nJeffrey Gundlach, chief executive of DoubleLine Capital, said on Tuesday that the repo market squeeze makes it more likely that the Federal Reserve will resume expansion of its balance sheet “pretty soon.”\n\nAlso in focus is the Bank of Japan’s policy meeting due Thursday. While the latest Reuters poll suggests the BOJ will keep its policy on hold, 28 of 41 economists expect it will ease its policy this year and 13 believe it may surprise by taking action at the Thursday meeting.\n\nIn currencies, sterling fell after British consumer prices in August grew at a their slowest pace since late 2016, while concerns about whether a last-minute Brexit deal was achievable acted as an added drag on the currency.\n\nThe pound fell 0.3% to $1.2457, but that followed a decent gain on Tuesday to $1.2528 on the back of optimism that Prime Minister Boris Johnson was trying to secure a Brexit deal with the European Union before the Oct. 31 deadline.\n\nFILE PHOTO: A man in a bicycle stops in front of an electronic board showing the Nikkei stock index outside a brokerage in Tokyo, Japan, March 25, 2019. REUTERS/Kim Kyung-hoon\n\nThe lower-than-forecast rate comes ahead of the Bank of England’s monetary policy meeting on Thursday. The BoE targets a 2% inflation rate.\n\nAgainst the euro sterling was unchanged at 88.585 pence.\n\nAgainst the yen, the dollar edged up 0.1% to 108.23 yen, below a seven-week high of 108.37 yen tested overnight.", "description": "Oil prices cooled on Wednesday as Saudi Arabia's pledge to quickly restore production eased supply worries, while caution ahead of an expected U.S. interest rate cut kept wider financial markets in tight ranges.", "authors": ["Tom Arnold", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190918&t=2&i=1431218561&w=1200&r=LYNXMPEF8H0VK", "published_at": "2019-09-18"}