{"pub": "independent", "url": "https://independent.co.uk/sport/football/premier-league/fantasy-football-scout-tips-gameweek-9-fpl-a9160856.html", "downloaded_at": "2019-10-18 07:06:45.016432+00:00", "title": "Fantasy football scout tips gameweek 9: Callum Wilson, Son Heung-Min, Jack Grealish and more", "language": "en", "text": "Callum Wilson\n\nUntil the defeat at Arsenal before the international break, Wilson had provided an attacking return in all of his appearances for Bournemouth this season.\n\nWith a porous Norwich City visiting the south coast this weekend, we expect him to return to form. No team has conceded more shots on goal than Daniel Farke’s side.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nSon Heung-Min\n\nTottenham Hotspur are in terrible form, obviously, but perhaps that can change this weekend with basement-dwelling Watford visiting north London.\n\nIf any player is going to turn their fortunes around, it is Son. The South Korean has five attacking returns in his last five games despite his side’s wretched run.\n\nCallum Hudson-Odoi\n\nHe has had to wait his turn but Hudson-Odoi could be the next Frank’s Fledglings to offer fantasy managers a cheap route to easy points.\n\nThe 18-year-old has recovered from his Achilles injury, started against Southampton last time out and scored twice for England Under-21s against Austria.\n\nShape Created with Sketch. Fantasy Premier League: Dream Team 2018-19 Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Fantasy Premier League: Dream Team 2018-19 1/11 Alisson Liverpool Getty 2/11 Andy Robertson Liverpool Getty 3/11 Trent Alexander-Arnold Liverpool Getty 4/11 Virgil van Dijk Liverpool Getty 5/11 Raheem Sterling Manchester City Getty 6/11 Eden Hazard Chelsea Getty 7/11 Mohamed Salah Liverpool Getty 8/11 Sadio Mané Liverpool Getty 9/11 Ryan Fraser Bournemouth Getty 10/11 Pierre-Emerick Aubameyang Arsenal Getty 11/11 Sergio Aguero Manchester City Getty 1/11 Alisson Liverpool Getty 2/11 Andy Robertson Liverpool Getty 3/11 Trent Alexander-Arnold Liverpool Getty 4/11 Virgil van Dijk Liverpool Getty 5/11 Raheem Sterling Manchester City Getty 6/11 Eden Hazard Chelsea Getty 7/11 Mohamed Salah Liverpool Getty 8/11 Sadio Mané Liverpool Getty 9/11 Ryan Fraser Bournemouth Getty 10/11 Pierre-Emerick Aubameyang Arsenal Getty 11/11 Sergio Aguero Manchester City Getty\n\nJack Grealish\n\nGrealish scored his first goal of the season in Aston Villa’s 5-1 evisceration of Norwich before the break and we expect more attacking returns to come.\n\nStatistically, the playmaker has been Villa’s most inventive and involved player, even if that has not always produced results. A home meeting with Brighton could change that.\n\nFikayo Tomori\n\nBack to Stamford Bridge and another young Chelsea player who offers the potential for cheap points, as Tomori appears to have nailed down a regular starting place.\n\nLampard’s side only have one clean sheet to their name so far but we expect Newcastle’s attack to struggle in west London. Steve Bruce’s side have five goals in total so far.\n\nHonourable mentions: Paulo Gazzaniga, Frederic Guilbert, Todd Cantwell, Anwar El-Ghazi, Tammy Abraham.", "description": "Callum Wilson Until the defeat at Arsenal before the international break, Wilson had provided an attacking return in all of his appearances for Bournemouth this season. With a porous Norwich City visiting the south coast this weekend, we expect him to return to form. No team has conceded more shots on goal than Daniel Farke’s side. Son Heung-Min Tottenham Hotspur are in", "authors": ["Mark Critchley"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/17/23/callum-wilson.jpg", "published_at": "2019-10-18"}