{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/a-judicial-officer-should-be-impartial-north-west-deputy-judge-president-candidate-20191008", "downloaded_at": "2019-10-08 15:09:08.837981+00:00", "title": "A judicial officer should be impartial - North West deputy judge president candidate", "language": "en", "text": "A good judicial officer must be able to divorce himself from \"biasness\", North West High Court Judge Ronald Hendricks said on Tuesday during his Judicial Service Commission (JSC) interview.\n\n\"Yes, I was ANC member but when I was elevated to the bench, I became apolitical and not politically aligned to any party. I gave judgments against the provincial government of the North West which was and still is ANC led,\" Hendricks said during his interview for the North West Deputy Judge President position.\n\nHe was responding to a question from JSC member advocate Dali Mpofu about his political affiliation.\n\nIt was the third time Hendricks was interviewed for the position. He was also the only person who was interviewed.\n\n\"Your impartially should not be compromised because of your history. You must be able as a judicial officer to be impartial [and] to evaluate the matter and the evidence that is before you,\" he told the commission.\n\nJudge Hendricks presided over the case of two men convicted of killing Coligny teen Matlhomola Moshoeu. He found two men - Pieter Doorewaard and Phillip Schutte - guilty of murder, kidnapping, intimidation, theft and the pointing of a firearm in November 2018. Hendricks sentenced them to 18 and 23 years in prison respectively.\n\nThe judge also told the panel about challenges they faced in the North West courts, saying the courts were not being used optimally.\n\n\"A proper monitoring of the magistrate's [court] can elevate the backlogs that are experienced in the magistrate's court from time to time,\" he said.\n\nIf he were to be appointed to the post, his role would be to assist and help monitor the magistrates' courts.\n\nHe also said there should be regular visits to magistrates' courts, adding that when he acted as a deputy judge president, he used the opportunity to visit the courts on a regular basis.\n\nHendricks also said there were certain perceptions regarding alleged corruption in the judiciary.\n\nREAD: Why allegations of corruption against the judiciary are alarming\n\nHe said \"wild allegations cannot be made, which is unfounded [and] unsubstantiated, that the judiciary is captured. If there is evidence of corruption or capture of the judiciary, it must be brought to the fore\".\n\nHendricks also touched on the transformation of the judiciary, saying that the judiciary should be transformed as far as gender is concerned.\n\n\"We are constitutionally obligated to transform the judiciary and to have more women appointed to the Bench.\n\n\"In doing so, one needs to identify possible candidates which can be mentored from a very early stage and be mentored for permanent appointment to the Bench,\" he said.\n\nAfter deliberations, the JSC decided to recommend Hendricks to the president for the position.", "description": "A good judicial officer must be able to divorce himself from \"biasness\", North West High Court Judge Ronald Hendricks has said during his Judicial Service Commission interview.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9419/9c065837f760428cb7c123ffc7a849b6.jpg", "published_at": "2019-10-08"}