{"pub": "hotair", "url": "https://hotair.com/headlines/archives/2019/09/trudeau-buttigieg-harris-yang-identity-politics-eats", "downloaded_at": "2019-09-22 02:00:14.455059+00:00", "published_at": "2019-09-22", "title": "Trudeau, Buttigieg, Harris, Yang: Identity politics eats its own", "language": "en", "text": "As such stories show, insisting on one’s own victim status is insufficient protection from identity mobs. Even being an identity “two-fer” does not suffice, as demonstrated by a New York Times story in March 2019. In that case, a young black man who identified as gay was employed as a “sensitivity reader” by several publishing houses—i.e., an enforcer of “cancel culture.” Then he wrote and tried to publish a book of his own. The result, as the Times story put it, was a “karmic boomerang.” Despite the author’s conformity overall to an identity-first narrative, he made the catastrophic mistake — by identity-first standards — of situating some of his story among Serbs and Albanians in Kosovo’s civil war in the late 1990s. Following a Twitter storm, he withdrew his debut book before circulation. As the reporter summarized, “He was Robespierre with his own neck in the cradle of the guillotine.”\n\nAll of which raises an interesting question about these and many others hoist on the identitarian petard: What, exactly, explains the primordial passion behind identity politics?\n\nHere’s a guess: Decades into the potent experiment of the sexual revolution, a great many human beings now live as if we are not the intensely communal and familial creatures that we always have been; and systemic consequences of that profound species-wide shift are now emerging. These include our increasingly surreal politics. Identity politics is driven in large measure by a question that generations before us never had to answer: Who am I? Until very recently, that question has been answered at least implicitly by reference to one’s role in a familial social order: I am a mother, a sister, a cousin, an aunt, and so on. Today, in an age when families form and re-form and un-form at record speed, all of those “givens” have become attenuated. The result is a frantic search for self via other groups that substitute for the loss of familial gravity—namely, identity politics.", "description": "", "authors": ["Mary Eberstadt", "Thebulwark.Com Trudeau-Buttigieg-Harris-Yang-Identity-Politics-Eats-Its-Own"], "top_image": ""}