{"pub": "cnbc", "url": "https://cnbc.com/2019/09/03/top-ceo-shares-3-daily-exercises-to-help-rewire-your-brain-for-success.html", "downloaded_at": "2019-09-03 23:41:10.826093+00:00", "title": "A top CEO shares 3 daily exercises that help rewire his brain for success", "language": "en", "published_at": "2019-09-03", "text": "As the CEO of one of the largest housing specialty firms, much of my day is spent reviewing economic data and financial reports. Yet even though I have a mathematical bent, I know what's most important to my firm: Making sure the minds of my employees stay in top shape. Researchers have found that improving brain structure and cognitive function can help you perform better at work. And you can actually engage in brain exercises to make your mind more agile. For example, every morning during my commute, I try to recall and say aloud a list of my most important tasks, so that I can maintain focus on them throughout the day. If you want to enhance your mental capacity, it can be difficult to know which brain exercises to adopt. Thankfully, the experts at the Center for Brain Health at the University of Texas came up with a useful exercise. They call it the \"2 + 5 + 7 = Improved Brain Health.\" It's not a scientific formula, but more of a mental mnemonic, which you can remember to practice every day to help you boost your brain capacity. Including this exercise into my daily routine — and encouraging employees to do the same — has helped significantly, and hopefully it can for you, too. Here's how it works:\n\n2x Daily: Engage in 'expansive thinking'\n\n\"Expansive thinking\" is a way of thinking about big, audacious problems or situations and seeing multiple ways to solve or improve them. One example: important personnel decisions, such as recruiting senior leaders who will help shape and steer the direction of our company. This can help advance any large-scale initiatives over the course of weeks or months. Because these issues may require a lot of time and attention, it's wise to structure your day so that you have designated periods, around 45 minutes each, to wade through these items.\n\n5x Daily: Take a brain break for three to five minutes\n\nYour brain needs time relax and restore itself. Instead of booking back-to-back meetings, leave yourself a few minutes to recharge before starting your next commitment. This can mean talking a short walk, closing your eyes and meditating for a few moments, or even just socializing with colleagues about topics unrelated to work. Experts recommend disconnecting from technology or avoiding emails, phones and texts all together for a few moments. Sit and embrace the silence. To be honest, I've had difficulty doing this during the workday, so I've started dedicated a few minutes during my morning and evening commutes. These moments of peace help center me for what always happens to be a busy day. I can now empathize with what legendary investor Ray Dalio has professed for years: that it's important to engage in mindfulness practices. When you're more aware of your thoughts, you don't react as emotionally, and you tend to make smarter decisions. Indeed, Dalio credited meditation as the \"single most important reason\" for his success.\n\n7x daily: Practice 'innovative problem-solving'", "description": "Researchers have found that improving brain structure and cognitive function can help you perform better at work.", "authors": ["Sanjiv Das"], "top_image": "https://image.cnbcfm.com/api/v1/image/106109104-1567521287193_t20_294nr6.jpg?v=1567521344"}