{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/18/WS5da90ae0a310cf3e355712c2.html", "downloaded_at": "2019-10-18 01:05:20.465873+00:00", "title": "Chinese, Japanese filmmakers deepen exchanges at Pingyao Int'l Film Festival", "language": "en", "text": "Xinhua | Updated: 2019-10-18 08:44\n\nTAIYUAN, Oct. 17 (Xinhua) -- Film-makers from China and Japan said the ongoing Pingyao International Film Festival is a great opportunity to bring them together and exchange opinions to better develop the Asian film industry.\n\nThe third Pingyao International Film Festival drew its curtains on Oct. 10, with 54 films from around the world to be shown. More than half of the films, solicited from 27 countries and regions, are world premieres.\n\nThree Japanese film-makers with their new works participated in the festival this year held in the 2,700-year-old city in north China's Shanxi Province.\n\n\"Howling Village,\" filmed by famous Japanese director Takashi Shimizu, made its world premiere at an open theater at Pingyao, attracting 1,500 viewers.\n\nIt is a fresh and unique experience for as many as 1,500 people to watch a horror movie together, a film fan said after watching the movie.\n\nShimizu expressed his love for Pingyao. \"The historical and retro image of the ancient city reminds me of the China I saw in books and illustrations when I was a child,\" said Shimizu. \"I was so excited to come here.\"\n\nJoe Odagiri, a famous Japanese actor and musician who has worked with several Chinese directors before, also came to Pingyao with a film starring him, which is titled \"They Say Nothing Stays the Same.\"\n\n\"Pingyao is a city with ancient Chinese characteristics. I feel honored to attend the film festival in such a clean and beautiful place,\" Odagiri said.\n\nChristopher Doyle, an Australian photographer familiar to Chinese fans, also lent his creative talent to the film, said Odagiri. \"The costume in the movie looks like the Chinese style, but it also blends with other styles, leaving imagination to audiences.\"\n\nJapanese audiences may have more chances to encounter Chinese movies as there have been already a number of regular distributors bringing over works since the 1980s, said Shozo Ichiyama, art director of Tokyo Filmex, who had participated in the production of several Chinese movies before.\n\nThe majority of audiences are older adults who enjoy Chinese culture and history. Such films can find success in Japan, said Ichiyama. \"But films about the youth in the country do not always find distribution channels.\"\n\n\"So we want to use the platform of film festivals to explore and introduce young film-makers, and promote the distribution of their films to more audiences,\" said Ichiyama. \"It is our film-makers' mission to find new talent and contribute to the future of the film industry.\"\n\nThis year's Pingyao International Film Festival will last until Saturday.", "description": "Film-makers from China and Japan said the ongoing Pingyao International Film Festival is a great opportunity to bring them together and exchange opinions to better develop the Asian film industry.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/18/5da90ae0a310cf3e97a1cc3c.jpeg", "published_at": "2019-10-18"}