{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7570329/They-lost-suck-Piers-Morgan-rows-SNP-leader-Nicola-Sturgeon-Brexit.html", "downloaded_at": "2019-10-14 10:18:43.389364+00:00", "title": "'They lost... suck it up': Piers Morgan rows with SNP leader Nicola Sturgeon over Brexit", "language": "en", "text": "Piers Morgan has challenged the SNP leader to 'suck it up' comparing her loss of the 2014 referendum on Scottish independence to her nation's capitulation to Japan in the rugby world cup yesterday.\n\n\n\nIn a feisty interview this morning the presenter kicked off the hostilities, saying he presumed the Scottish SNP leader would like 'an immediate replay' of Scotland's game against Japan in the rugby world cup, which the home nation lost 21 to 28 yesterday.\n\nOver Ms Sturgeon's laughed denials, Mr Morgan said 'Scotland got hammered' and added that he's seen a second-tier team 'give your lot a lesson in rugby'.\n\nAfter trying to draw Ms Sturgeon into agreeing the result should stand - an apparent allusion to her support for a second referendum on Scottish independence, Ms Sturgeon said: 'Rugby matches, as important as they are, particularly during a world cup, are not the same as the future of the country'\n\nShe said she still support a second independence referendum saying 'circumstances have changed, so dramatically changed' since the 2014 vote.\n\nShe said Britain's departure from the EU would be carried out against Scotland's will, adding: 'The way Scotland is being completely ignored and disregarded, yes I believe we should have another opportunity to decide if we want to be an independent country.'\n\nShe went on: 'I think when we do, as we see in the polls, the people of Scotland will decide that that's exactly what we should be.'\n\nAfter the pair clashed on a hard border in Ireland, Mr Morgan said Scottish independence would create 'huge difference' in the tax regimes between the nations, adding: 'We would therefore need to have a hard border between Scotland and England'.\n\nMs Sturgeon said: 'The way Scotland is being completely ignored and disregarded, yes I believe we should have another opportunity to decide if we want to be an independent country'\n\nMs Sturgeon said it was not inevitable that a hard border would follow Scottish independence and said she would 'argue for outcomes' which would avoid it.\n\nShe said at present her nation was 'powerless and at the mercy of decisions being taken elsewhere'.\n\nChallenged by Susanna Reid on her support for membership of the EU but not the UK, Ms Sturgeon said the EU pooled sovereignty between independent nations, but within the UK 'Scotland's voice is ignored'.\n\nPointing out that that Scottish voters rejected independence and UK voters rejected EU membership, Mr Morgan said: 'Everything you want is what people voted against'.\n\n'In a democracy, it's called losing. It's exactly what happened to your rugby team yesterday,\n\n'They lost - suck it up', he taunted.\n\nMs Sturgeon replied: 'Absolutely - I lost the referendum in 2014. But I do believe in a democracy you're entitled to change your mind.'\n\nMs Sturgeon added that were Ms Morgan to be sacked from GMB - a proposal currently the subject of an online petition - she would miss their 'early morning jousts'.\n\nIt comes as a new poll showed support for Scottish independence has reached 50 per cent. The result in 2014 was 45 per cent in favour of independence, 55 per cent against.", "description": "Piers Morgan challenged Nicola  Sturgeon to 'suck it up' comparing her defeat in the 2014 Scottish independence referendum to Scotland's rugby loss to Japan yesterday.", "authors": ["Joel Adams For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/09/19682646-0-image-a-36_1571042977629.jpg", "published_at": "2019-10-14"}