{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/29/bills-fall-to-pats-and-lose-qb-josh-allen-to-head-", "downloaded_at": "2019-09-30 00:51:15.059195+00:00", "title": "Bills fall to Pats, and lose QB Josh Allen to head injury", "language": "en", "text": "ORCHARD PARK, N.Y. (AP) - Bills coach Sean McDermott suddenly has bigger worries than Josh Allen’s carelessness with the football.\n\nHe’s not sure when the second-year starter will be healthy enough to be cleared to play.\n\nAllen was placed in the NFL’s concussion protocol after taking a helmet-to-helmet hit by Patriots defensive back Jonathan Jones in the opening minute of the fourth quarter of a 16-10 loss to New England on Sunday.\n\nPutting aside the three interceptions Allen threw, McDermott’s biggest question was why Jones wasn’t ejected.\n\n“There’s no room in football for that,” McDermott said. “I thought he should have been thrown out. But other than that, I’m not going to get into that. That’s for the league to get into.”\n\nThe hit occurred when Allen scrambled out of the pocket and burst through a hole up the middle while facing third-and-8 at the New England 45. He gained 7 yards before Jones closed in on him, lowered his helmet and struck the quarterback in the crown of his helmet. Jones was flagged for a personal foul for unnecessary roughness.\n\nAllen lay on the field for several minutes before hopping up on his own. He was briefly evaluated on the sideline before being escorted up the tunnel. Allen was spotted in the locker room chatting with teammates following the game.\n\nNFL officiating chief Al Riveron told a pool reporter the decision to not eject Jones came because the hit did not rise to the level of the league standard for disqualification.\n\n“There was a foul called and obviously the penalty stood, but we did not feel this contact rose to that level,” Riveron said, who also noted Jones was turning his head just before hitting Allen.\n\nBills safety Micah Hyde questioned the official’s judgment saying he or any of his teammates would have been ejected for a similar hit on New England’s Tom Brady.\n\n“That’s our quarterback. We ride or die with him,” Hyde said. “To see that happen, Josh didn’t slide, but at the end of the day it doesn’t matter if you’re a running back, you can’t head to the head.”\n\nJones defended the hit saying it was never his intent to hurt Allen.\n\n“No malice or intent. Just a part of football,” Jones said. “We’re just running around playing football. I hope he’s OK. I’m going to check on him.”\n\nAllen finished going 13 of 28 for 153 yards, and scored on a 1-yard touchdown dive.\n\nAllen’s uncertain status leaves Buffalo with veteran backup Matt Barkley the only quarterback on the active roster in preparing to play at Tennessee next weekend. Buffalo then enters its bye week.\n\nThe loss prevented Buffalo (3-1) from getting off to its first 4-0 start since 2008.\n\nThough the Bills defense held Brady in check, their offense was busy coughing up the ball at critical moments for the third time in four games.\n\nAllen threw three interceptions, two of which translated into a touchdown and a field goal. Punter Corey Bojorquez also had a punt blocked by J.C. Jackson, which led to Matthew Slater returning it 11 yards for a touchdown to put the Patriots up 13-0 in the first quarter.\n\nMcDermott was unhappy with Allen’s continuing string of committing turnovers. He’s now thrown six interceptions and lost two fumbles in four starts this season.\n\n“He’s a young quarterback and sometimes they have to learn those lessons. Those are hard lessons and we have to continue to coach it up,” McDermott said.\n\nThe game was decided on Buffalo’s fourth turnover with 1:27 left. Facing third-and-9 on the New England 39, Barkley was pressured by linebacker Kyle Van Noy, who got his hand on the quarterback’s chest. That forced Barkley to throw the ball up into the air, and have it easily picked off by Jamie Collins.\n\nThe loss spoiled a stout effort by a Bills defense which limited the Patriots to just 11 first downs and 224 yards.\n\nBrady finished 18 of 39 for 150 yards and an interception. He was picked off by Hyde in the end zone on third-and-goal from the 2 in the second quarter.\n\nBrady’s 45.9 passer rating was the sixth lowest of his career and lowest since finishing with a 34 rating in a 27-20 loss to Indianapolis on Nov. 5, 2006.\n\nBarkley lamented how the Bills let the Patriots off the hook.\n\n“Especially with the way our defense played and where we had the ball at the end of the game, it’s tough,” Barkley said. “This is a tough one.”\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Bills coach Sean McDermott suddenly has bigger worries than Josh Allen's carelessness with the football.", "authors": ["The Washington Times Http", "John Wawrow"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/29/patriots_bills_football_34529_c0-73-2906-1767_s1770x1032.jpg?232847d9c82050de5f71d7d0df45c8f58613236c", "published_at": "2019-09-29"}