{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/14/WS5da3cab2a310cf3e355703f2.html", "downloaded_at": "2019-10-14 02:10:26.672770+00:00", "title": "A transformative high-tech combo", "language": "en", "text": "By Cheng Yu in Wuxi, Jiangsu province | China Daily | Updated: 2019-10-14 09:09\n\nA customer's body size can be measured within seven seconds via laser scanning. Data then can be transmitted to a factory in real time, and a tailor-made garment can be produced within two hours with the help of this technology. [Photo/IC]\n\nTailor-less custom-made suits, wines from drone-plucked grapes ... 5G gives IoT teeth\n\nFor the first time in her life, Louisa Traore, 29, a private school English-language teacher from Pretoria, South Africa, tried to get a suit custom made. What encouraged her was her presence in Wuxi, Jiangsu province, in East China, and the idea that she can get a suit made without the help of dressmakers.\n\nAll she needed to do was stand in an intelligent, sensor-rich, 5G-enabled fitting room. Measurements like that of her waist, wrist circumference and height were taken automatically, without any physical contact, using optical high-tech. The data was then transferred electronically to robot-couturiers back in the factory.\n\nA mightily impressed Traore said: \"I can't help but feel all this is like a fairytale. The smart fitting room is like a fairy stick－it has revolutionized tailoring procedure, which used to involve a sales assistant, tailors, factory workers. Now, all their time-intensive tasks can be finished by machines within minutes.\"\n\nTech industry insiders said life-enhancing developments are coming to China on the back of innovations in 5G, internet of things or IoT, big data, artificial intelligence, cloud computing, augmented reality and the like.\n\nMore specifically, the integration of IoT and 5G is promising to spawn a plethora of lifestyle-transforming applications across several industries. IoT refers to the internet-linked network of smartphones, wearables, industrial machines, kitchen appliances and similar devices.\n\nLiu Duo, president of the China Academy of Information and Communications Technology, a government-backed research institute, said the advancement of 5G has greatly boosted applications for the IoT in the country.\n\n\"In the 5G era, IoT will be dominant. It has made the 'internet of everything' a reality,\" Liu said at the World IoT Expo 2019 which ended last month in Wuxi.\n\nJust a few years ago, IoT was no more than a mere concept. Since the beginning of this year, however, it has become a mainstream technology, and sped up applications in a wide range of industries, not just in fashion but even in manufacturing, agriculture and healthcare.\n\nFor instance, at an intelligent warehouse of menswear major HLA, staff no longer take much time to find the needed garments from a mountain of piled-up clothes. The 5G-enabled IoT dispatches smart robots to identify and clutch the needed, e-tagged garments.\n\nSuch innovative applications are also smartening work at vineyards in Wuxi. Farmers no longer need to pluck the grapes. Using a smartphone, they can remote-control unmanned aerial vehicles (or drones) to do their job.\n\n\"Such applications have widened mainly due to 5G as it has higher bandwidth and lower latency. 5G can transmit a vast amount of IoT-generated data to users in a jiffy,\" said Wei Chenguang, deputy president of the China Mobile Research Institute.\n\nIn addition, 5G is driving the integration of artificial intelligence, cloud computing and big data toward becoming reality sooner than later, Wei said.\n\nExperts said the past several decades have witnessed the rapid development of IoT in China. A report from the China Economic Information Service said the country's IoT industry reached a market value of 1.2 trillion yuan ($168 billion) last year. And income from services offered by the IoT industry was up 72.9 percent year-on-year (but specific figures were not available).\n\nCharlies Dai, a principal analyst at Forrester, a business strategy and economic consultancy, said favorable government policies and increasingly fierce market competition are driving IoT's evolution in the country.\n\n\"The Chinese government has unveiled a string of strategic IoT initiatives for the nation's digital transformation. IoT was also included in its 13th Five-Year Plan (2016-20), which will steer China's economic and social development between 2016 and 2020,\" Dai said.", "description": "For the first time in her life, Louisa Traore, 29, a private school English-language teacher from Pretoria, South Africa, tried to get a suit custom made. What encouraged her was her presence in Wuxi, Jiangsu province, in East China, and the idea that she can get a suit made without the help of dressmakers.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/14/5da3d774a310cf3e97a115ca.jpeg", "published_at": "2019-10-14"}