{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7625861/How-DOUBLE-annual-leave-2020-booking-days-bank-holiday.html", "downloaded_at": "2019-10-29 15:16:10.162851+00:00", "title": "How to DOUBLE your annual leave in 2020 by booking your days off around bank holiday", "language": "en", "text": "A clever new guide aimed at savvy employees has revealed which days to book off in 2020 in order to make the most of your annual leave.\n\nThe average Brit has 28 days of annual leave, but if these are booked around the bank holidays, this can be turned into 60 days when including weekends.\n\nOver the last 12 months, the term ‘staycation’ has seen a 71 per cent increase in searches, and the trend is set to continue as more holiday goers plan their holidays on British soil.\n\nIn 2018, 57 per cent of Brits holidayed within the UK, while more than half of 25-32 year olds planning to increase their UK-based holiday time.\n\nA clever new guide aimed at savvy British employees has revealed which days to book off in 2020 in order to make the most of your annual leave (stock image of Santorini seen)\n\nAs the idea of the staycation continues to be less of a concept and more front of mind for Brits, research collated by Forest Holidays highlights why staycations will continue to increase in popularity for the foreseeable future and how they can help maximise annual leave.\n\nAnd surprisingly, two in five employees only used half of their allocated holiday leave last year, due to reasons such as the fear of falling behind at work or the guilt of handing over work to colleagues\n\nMost Brits have 28 days of annual leave, and here’s how to utilise it to maximise it using Bank Holidays, and these can be maximised by booking time off between the Christmas and New Year bank holidays, and the spring and summer bank holidays\n\nThe average Brit has 28 days of annual leave, but if these are booked around the bank holidays, this can be turned into 60 days when including weekends\n\nAside from cost, many Brits revealed that they opted for a staycation rather than going abroad for their holidays, as long weekends helped them make the most of annual leave.\n\nStrategically booking annual leave can help maximise annual leave creating an opportunity for multiple mini-breaks and micro trips on weekends and bank holidays.\n\nMost Brits have 28 days of annual leave, which can be maximised by booking time off between the Christmas and New Year bank holidays, and the spring and summer bank holidays.", "description": "A clever new guide aimed at savvy British employees has revealed which days to book off in 2020 in order to make the most of your annual leave.", "authors": ["Jessica Rach For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/13/20326108-0-image-a-50_1572354753127.jpg", "published_at": "2019-10-29"}