{"pub": "realclearpolitics", "url": "https://washingtonexaminer.com/news/adam-schiffs-staff-includes-2-aides-who-worked-with-whistleblower-at-white-house", "downloaded_at": "2019-10-12 16:04:44.759387+00:00", "title": "Adam Schiff has 2 aides who worked with whistleblower at White House", "language": "en", "text": "House Intelligence Committee Chairman Adam Schiff recruited two former National Security Council aides who worked alongside the CIA whistleblower at the NSC during the Obama and Trump administrations, the Washington Examiner has learned.\n\nAbigail Grace, who worked at the NSC until 2018, was hired in February, while Sean Misko, an NSC aide until 2017, joined Schiff's committee staff in August, the same month the whistleblower submitted his complaint.\n\nThe whistleblower was an NSC official who worked with former Vice President Joe Biden and who has expertise in Ukraine, the Washington Examiner has reported.\n\nA career CIA analyst with Ukraine expertise, the whistleblower aired his concerns about a phone conversation between President Trump and Ukrainian President Volodymyr Zelensky to a House Intelligence Committee aide on Schiff’s staff. He had previously informed the CIA’s legal counsel's office.\n\nSchiff initially denied he knew anything about the complaint before it was filed, stating on Sep. 17: “We have not spoken directly with the whistleblower. We would like to.\"\n\nBut it later emerged that a member of his staff had spoken to the whistleblower before his complaint was submitted on Aug. 12. The Washington Post concluded that Schiff \"clearly made a statement that was false.\"\n\nGrace, 36, was hired to help Schiff’s committee investigate the Trump White House. That month, Trump accused Schiff of \"stealing people who work at White House.\" Grace worked at the NSC from 2016 to 2018 in U.S.-China relations and then briefly at the Center for a New American Security think tank, which was founded by two former senior Obama administration officials.\n\nA Schiff aide commented in February: \"We have hired staff for a variety of positions, including the committee's oversight work and its investigation. Although none of our staff has come directly from the White House, we have hired people with prior experience on the National Security Council staff for oversight of the agencies, and will continue to do so at our discretion.\" Schiff himself said, \"If the president is worried about our hiring any former administration people, maybe he should work on being a better employer.\"\n\nMisko, 37, worked in the Obama administration as a member of the secretary of state’s policy planning staff under deputy chief of staff Jake Sullivan, who became Hillary Clinton's top foreign policy official during her 2016 presidential campaign. In 2015, Misko was the director for the Gulf states at the NSC, remaining there into the Trump administration’s first year.\n\nA source familiar with Grace's work at the NSC told the Washington Examiner, “Abby Grace had access to executive privilege information, and she has a duty not to disclose that information. She is not authorized to reveal that information.”\n\nThe same source said that Misko had not been trusted by Trump appointees. \"There were a few times where documents had been signed off for final editing before they go to the national security adviser for signature,\" the source said. \"And he actually went in and made changes after those changes were already finished. So he basically tried to insert, without his boss' approval.\n\n\"There were meetings in which he protested very heavily, and next thing you know, there's an article in the paper about the contents of that meeting.\"\n\nMisko often clashed with other NSC personnel at meetings, another source said. Both Grace and Misko were close to Lt. Gen. H.R. McMaster, Trump's national security adviser from Feb. 2017 until May 2018.\n\nMisko was a CNAS fellow in 2014. Misko's name surfaced in the Hillary Clinton email controversy when he worked in the State Department during the Obama administration.\n\nIn a Dec. 1, 2009, email released by Judicial Watch, Clinton adviser Huma Abedin sent classified information regarding foreign military contributions to the Afghanistan war effort to her private email account. That email originated with Misko, who wrote to Sullivan that he initially “accidentally” sent it on the “high side” (secure) but was sending the email again.\n\nThe intelligence committee did not respond to a request for comment.", "description": "House Intelligence Committee Chairman Adam Schiff recruited two former National Security Council aides who worked alongside the CIA whistleblower at the NSC during the Obama and Trump administrations, the Washington Examiner has learned.", "authors": [], "top_image": "https://mediadc.brightspotcdn.com/dims4/default/0ec006d/2147483647/strip/true/crop/2290x1202+0+60/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F3e%2F0f%2F478028c1499b986ad1edd2bd4f02%2Flast-oe.jpg", "published_at": "2019-10-11"}