{"pub": "independent", "title": "Scientists find drought-resistance gene that could help barley survive climate change", "url": "https://independent.co.uk/news/science/climate-change-crops-drought-barley-heriot-watt-university-beer-whisky-a9088016.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 09:04:33.630519+00:00", "text": "Scientists have discovered a gene in barley that could help to make the crop more drought resistant as climate change threatens to create difficult growing conditions for farmers.\n\nA five-year study of the crop, a key ingredient in beer and whisky production, saw scientists isolate the specific gene responsible for drought resistance – HvMYB1.\n\nThe gene is one of 39,000 present in the plant, and when more prominently expressed can create crops that are better able to survive dry, hot conditions, according to testing led by Peter Morris of Heriot Watt University in Edinburgh.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe finding is expected to have important ramifications for cereal crops amid increasing challenges caused by climate change-related droughts.\n\nIn 2018, when a cold winter brought on by the “beast from the east“ weather phenomenon was followed by a long dry summer, barley harvest fell by 7.9 per cent compared to the average of the previous year.\n\nShape Created with Sketch. Fighting climate change with trees: The facts Show all 6 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Fighting climate change with trees: The facts 1/6 The Independent / Getty 2/6 The Independent / Getty 3/6 The Independent / Getty 4/6 Getty 5/6 The Independent / Getty 6/6 The Independent / Getty 1/6 The Independent / Getty 2/6 The Independent / Getty 3/6 The Independent / Getty 4/6 Getty 5/6 The Independent / Getty 6/6 The Independent / Getty\n\nAt the time, NFU combinable crops board chairman Tom Bradshaw said the extreme weather events of the year had caused crop yields to become increasingly unpredictable.\n\nAnd with more extreme and frequent droughts recognised across the globe, and a growing scientific consensus willing to point the blame for the exacerbated dry spells at climate change, scientists believe the new development could help see the crop grown well into the future.\n\nPeter Morris from Heriot Watt University, who led the research team, said: “By increasing the expression of this particular gene in test plants and simulating drought conditions, we’ve been able to prove that plants in which HvMYB1 is more prominently expressed are able to survive prolonged periods of drought.\n\n“This is a significant finding that will allow more drought resistance crops to be bred in the future.\n\n“Drought is already impacting yields with the European cereals harvest hit particularly hard in 2018. A prolonged, dry and hot summer significantly impacted yields and quality.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\n“As climate change gathers pace and we experience more extreme seasons, it is essential we can maintain continuity of supply.”\n\nThe research was funded in part by the Scotch Whisky Association.\n\nMr Morris said that the finding was significant for key industries such as scotch whisky production, but also had important implications for the wider cereals industry including the production of wheat, maize and rice.\n\nThe interaction between scientists and cereal in the past has created answers to significant global problems – most notably by Nobel Peace Prize winner Norman Borlaug, who created a semi-dwarf wheat which led to higher yields of the crop and reduced famine in countries including Mexico, India and Pakistan, becoming the most prevalent version of the crop on the planet today.\n\nAdditional reporting by PA", "description": "Scientists have discovered a gene in barley that could help to make the crop more drought resistant as climate change threatens to create difficult growing conditions for farmers. A five-year study of the crop, a key ingredient in beer and whisky production, saw scientists isolate the specific gene responsible for drought resistance – HvMYB1.", "authors": ["Vincent Wood"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/08/08/17/crops.jpg"}