{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/junior-high-school-student-wins-46000-game-tournament-doesnt-get-any-money", "downloaded_at": "2019-09-18 23:24:23.484995+00:00", "title": "Junior High School Student Wins $67,500 Game Tournament, Doesn't Get Any Money", "language": "en", "text": "During the Tokyo Game Show, legendary Street Fighter player Momochi forfeited tens of thousands of dollars in prize money because he doesn’t have a pro-gaming licence in Japan. He wasn’t the only one who lost out on money. The winner of the Puzzle & Dragons tournament did, too.\n\nJunior high school student Yuwa came in first place. The prize purse was 5,000,000 yen ($67,513) — none of which he received. Instead, he was given a trophy, a gaming headset, a year’s supply of chocolate almonds, and a year’s supply of Real Gold Dragon Boost energy drink.\n\nWhy didn’t he get any money? According to Japan’s pro-gaming licence system, players between the ages of 13 and 15 can only compete under a junior licence, which waves any right they have to receive prize money. Japan’s pro-gaming organisation wants younger competitors to focus on their schoolwork. In Japan, compulsory education ends after junior high school.\n\nWhen Yuwa was awarded the trophy after the tournament, the announcer pointed out that because he had a junior licence, he would not get any of the prize money. “Aaah, that’s too bad,” said the other announcer. Both announcers remarked how they look forward to what he does from henceforth. Like, win this tournament again?\n\nLater, on Twitter, Yuwa wrote, “I received honour instead of money.” Admirable, but those winnings probably would have come in handy for college tuition.", "description": "During the Tokyo Game Show, legendary Street Fighter player Momochi forfeited tens of thousands of dollars in prize money because he doesn’t have a pro-gaming licence in Japan. He wasn’t the only one who lost out on money. The winner of the Puzzle & Dragons tournament did, too....", "authors": ["Cecilia D'Anastasio", "Keza Macdonald"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/sy9hldik5gdfiay5o7gf.jpg", "published_at": "2019-09-18"}