{"pub": "reuters", "url": "https://af.reuters.com/article/worldNews/idAFKBN1X50G2", "downloaded_at": "2019-10-27 00:27:56.865522+00:00", "title": "Vatican synod proposes ordaining married men as priests in the Amazon", "language": "en", "text": "VATICAN CITY (Reuters) - An assembly of Roman Catholic bishops from the Amazon on Saturday proposed that married men in the remote area be allowed to be ordained priests, which could lead to a landmark change in the Church’s centuries-old discipline of celibacy.\n\nFILE PHOTO: Pope Francis prays during the Synod of Amazonian bishops at the Vatican, October 7, 2019 REUTERS/Remo Casilli\n\nThe proposal, made in a final document from a three-week assembly, known as a synod, passed by 128 votes in favour to 41 against.\n\nPope Francis will consider it, along with many other proposals on issues including the environment and the role of women, in a future document of his own, known as an Apostolic Exhortation.\n\nSeparately, when he closed the synod’s final working session earlier on Saturday, Francis announced that he would reconvene a commission to study the history of women deacons in the early centuries of the Catholic Church, responding to calls by women that they be allowed to take up the role today.\n\nBut the issue of a married priesthood for the Amazon region was by far the most contentious item in the 120-paragraph final document.\n\nThe proposal calls for married men who are already deacons in the Church, have a stable family relationship, and are proven leaders in their communities to be ordained as priests.\n\nIt said the ordination to the priesthood would have to be preceded by an “adequate formation”.\n\nThis solution to the shortage of priests, backed by many South American bishops, would allow Catholics in isolated areas to attend Mass and receive the sacraments more regularly.\n\nAt least 85% of Amazon villages cannot attend Mass every week and some cannot do so for years.\n\nConservatives oppose the change, fearing it would be a slippery slope leading to a married priesthood throughout the 1.3 billion member Church.\n\nThey fear that if one part of the Church was allowed to ordain married men as an exception, there would be nothing to stop other areas with a shortage of priests doing the same, even in developed countries.\n\nA CBS News poll last year said nearly 70% of American Catholics favour letting priests marry.\n\nThe document said that some bishops in the synod thought the issue should be discussed on a universal basis.\n\nWOMEN DEACONS\n\nConservatives are also opposed to women deacons, saying the deaconate is linked with the male priesthood.\n\nMany deacons in the Church around the world today are married men.\n\nDeacons, like priests, are ordained ministers. They may not celebrate Mass, but they may preach, teach in the name of the Church, baptise and conduct wedding, wake and funeral services and even run a parish with the permission of a bishop.\n\nIn his closing comments to the synod, Francis said: “We still have not grasped the significance of women in the Church.”\n\nScholars have debated the precise role of women deacons in the early Church.\n\nSome say they ministered only to other women, such as at immersion rites at baptism and to inspect the bodies of women in cases where Christian men were accused of domestic violence and brought before Church tribunals.\n\nOthers believe women deacons in the early Church were fully ordained and on a par with the male deacons at the time. The Church did away with female deacons altogether in later centuries.\n\nRelated Coverage Vatican synod proposes ordination of married men as priests in Amazon region\n\nA commission that handed its report to the pope this year was inconclusive. Francis, who ends the synod ceremoniously with a Mass in St. Peter’s Basilica on Sunday, gave no details on when the new commission would start its work.\n\nFrancis and his predecessors have ruled out allowing women to become priests.\n\nBut advocates of women priests see a female deaconate might eventually make it easier for a future pope to study the possibility of women priests.", "description": "An assembly of Roman Catholic bishops from the Amazon on Saturday proposed that married men in the remote area be allowed to be ordained priests, which could lead to a landmark change in the Church's centuries-old discipline of celibacy.", "authors": ["Philip Pullella", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191026&t=2&i=1445267418&w=1200&r=LYNXMPEF9P0LC", "published_at": "2019-10-26"}