{"pub": "zdnet", "url": "https://www.zdnet.com/article/tableau-rolls-out-explain-data-algorithms-to-dig-deep-on-data", "downloaded_at": "2019-09-18 23:25:49.275893+00:00", "title": "Tableau rolls out Explain Data, algorithms to dig deep on data", "language": "en", "text": "How to make analytics more accessible to the general business user Kate Wright, head of augmented business intelligence Hana an Analytics at SAP, explains to Tonya Hall the process and the importance of making analytics available for more than just data scientists.\n\nHow to win with prescriptive analytics Analytics has evolved from the basics -- visualizations, historicals and dashboards -- to the more complex with recommendations and predictions of outcomes. Now it's time to step it up and get prescriptive. Read More\n\nTableau's latest release, 2019.3, will bring automated statistical analysis to visualizations via a feature called Explain Data.\n\nThe feature is built directly within Tableau and people can click through an icon to get automated analysis without data modeling or data science.\n\nExplain Data is also based on a set of algorithms that analyze all available data to surface statistically relevant items on a data point.\n\nFrancois Ajenstat, Chief Product Officer at Tableau, said Explain Data is designed to evolve \"what happened to why it happened.\" In a demo, Ajenstat walked through bike share visualizations and data for Boston and used Explain Data to run possible explanations for rides in August and February.\n\nMust read:\n\nExplain Data, which aims to surface something statistically significant that is not obvious, is based on technology acquired from the June 2018 purchase of Empirical Systems.\n\nAjenstat said Explain Data has the potential to further democratize analytics as users can select any data point in a visualization and utilize Bayesian statistical modeling to evaluate patterns and explanations across multiple data points.\n\nTableau, now owned by Salesforce, already integrates with dozens of data types and those connections give Explain Data more fodder to come up with insights. The appeal of Explain Data is that a person asking a question doesn't have to limit analysis to a set of predetermined hypotheses.\n\nIn addition to Explain Data, Tableau also added more natural language processing features to Ask Data. The primary addition to Ask Data is embedded natural language processing that can utilize the information contained in the company's portals and intranet pages.\n\nOther additions to Tableau 2019.3 include:\n\nTableau Catalog, a set of cataloging tools for data sets approved and enabled by the enterprise. Ajenstat noted that the typical Tableau experience starts with a series of workbooks. Catalog allows users to see the lineage of data behind an analysis, he said. That ability allows users to change parameters, flag older data and ask questions about the analysis.\n\nTableau Data Management Add-On, which is geared toward enterprises that have deployed Tableau across the company. Used in conjunction with Tableau Catalog, the Data Management Add-On allows customers to manage the data within their analytics stack and ensure information is correct and trusted.\n\nServer Management Add-On includes a resource monitoring tool, content migration for workflows, external repository hosting and AWS Key Management Service integration. The Tableau Server Management Add-On is an addition to better scale data analytics deployments. The Server Management Add-On is available for $3 per user per month. It doesn't apply to Tableau Online.\n\nRelated stories:", "description": "Francois Ajenstat, Chief Product Officer at Tableau, said Explain Data is designed to evolve \"what happened to why it happened.\"", "authors": ["Larry Dignan"], "top_image": "https://zdnet2.cbsistatic.com/hub/i/r/2019/09/13/1889b092-e6aa-42cb-80b6-63b41da6e1b1/thumbnail/770x578/f0d3a9c801eda7494936af212529c8f5/explain-data-bikes-temperature-gif2.gif", "published_at": "2019-09-18"}