{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/amanda-holden-shares-gory-details-20703822", "downloaded_at": "2019-10-23 09:36:00.173217+00:00", "title": "Amanda Holden had to swim to shore one-legged after agonising gruesome injury", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAmanda Holden has given all the gruesome details of her \"nasty accident\" which broke her leg in two places.\n\nThe 48-year-old radio presenter fell into the sea while completing an assault course on a family holiday.\n\nIt was the first day of her holiday with husband Chris Hughes and daughters Alex, 13, and Hollie, seven.\n\nOn her Heart FM show, Amanda explained that she broke her fibula in two places and had to swim back to shore using one leg.\n\nShe was forced to wear a life jacket which she was initially unimpressed by - but now realises it helped her get back to dry land safely so she could be rushed to hospital.\n\n(Image: Instagram)\n\nAmanda now has a metal plate and screws in her leg, and said she was \"heartbroken\" about the injury.\n\nShe phoned in to her radio show and told co host Jamie Theakston: \"I just can't believe what's happened... on the first day here as well so I'm just totally gutted.\n\n\"Basically I was trying to be a good mother… and I said to Hollie, 'Mummy can come on that with you' and there’s this like, you remember [Total] Wipeout, that TV thing?\n\n(Image: Instagram)\n\n\"There’s like a children’s Total Wipeout thing in the middle of the sea... I walked around it and then crawled across like an old person, like across the difficult bits.\n\n\"And then there were these three inflatable stepping stones in the middle of the sea and everyone else was running across it and I thought 'oh I could do that, if kids can do it I can do it' and I did it and I made it.\"\n\nShe continued: \"I was showing off, Jamie – I made it across to the other side and then my leg slipped because obviously it's wet and it went the other way and I felt it break.\n\n\"I was rushed to hospital and I've got a metal plate and screws in my leg, which currently is the fastest and easiest way for it to heal.\n\n(Image: Startraks Photo/REX)\n\n(Image: Getty Images)\n\n\"I haven't got a cast, I've got metal in my leg and a splint and it's all wrapped up and it's got a heartbeat in it.\"\n\nAmanda is now using a wheelchair and has to be pushed around by her husband.\n\nA spokesperson for Amanda said: \"Despite this painful accident it's business as usual for Amanda and she will return to Heart Breakfast on Monday October 28.\"", "description": "Amanda Holden explained how she really broke her leg, which forced her to swim back to shore one-legged before being rushed to hospital", "authors": ["Verity Sulway", "Image", "Instagram", "Startraks Photo Rex", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20669750.ece/ALTERNATES/s1200/2_The-Global-Gift-Gala-London-UK-17-Oct-2019.jpg", "published_at": "2019-10-23"}