{"pub": "telegraph", "url": "https://telegraph.co.uk/travel/destinations/europe/united-kingdom/wales/articles/just-back-wales-wet-road-trip-cafe", "downloaded_at": "2019-10-17 11:36:20.547172+00:00", "title": "Unexpected cheer (plus ukulele and leeks) on a rainy day in Wales", "language": "en", "text": "Moira Ashley wins our weekly Just Back travel writing competition – and £250 – after finding unexpected cheer on a grey day in Wales\n\nPeering at the menu behind the counter, I worry for a moment that I’ve succumbed to sudden onset macular degeneration. I struggle to read the offerings: h cks, he e nd om t toa ti\n\nThen I realise it’s a peg board where items are composed of individual plastic letters and several have fallen off. The café’s interior decor – red Formica tables and wood veneer walls, suggests it was last updated circa 1960. Strung across the ceiling are faded Christmas paper-chains (it’s September) that predate Slade, possibly even Bing.\n\nCaffi Cwtch seemed to materialise out of nowhere, a concrete cube on a misty B-road in mid-Powys. Yet it’s three quarters full, mostly with regulars, judging by the lively banter. There must be a settlement nearby, though I can’t check Google Maps as there’s been no signal for miles.\n\nHorlicks, and cheese and tomato toastie – as I’ve now deciphered –sound just the thing to brighten this grey day. Waitress Delyth (full complement of letters embroidered across her chest) is apologetic. She has to shout to make herself heard over the drumming of hailstones on the corrugated iron roof: “Sorry, my lovely. We’ve run out of Horlicks. Blame Welsh Water.”\n\nIt’s true that Welsh water in its various meteorological states has spoilt my morning’s plans. Dawn began with a downpour; soggy-bottomed clouds now squat over the hills, obliterating my hopes of seeing the wheeling red kites, recently reintroduced into these parts. But I’m puzzled as to how H2O could be held responsible for the disappearance of the milky comfort beverage.\n\nIt turns out Delyth is talking about a passing trio of engineers from the utility company who commandeered the last few scoops earlier this morning. “I don’t know what Gwyn’ll do,” she confides as she turns to the hissing chrome coffee machine. “He always has Horlicks.”\n\nThe door blows open to admit a bedraggled Gwyn and his dripping collie. “I’ll have one of those,” he decides, pointing at my glass cup.\n\n“Ooh, lah-tay! There’s posh. I’ll have a cup of tea on standby, is it?” Delyth offers.\n\nA sign on the wall reads “Craft club here, Tuesdays 10am-12noon. Knit and natter.” Today is Friday, and it’s gone 1pm, but a rapid clicking from the table behind alerts me to two women, elbows pistoning, as their embryonic scarves dangle precariously over plates of po ched ggs nd c ips.\n\nClearly, time here is as elastic as the sagging streamers and I’m hopeful that I’ll discover evidence of Thursday’s “Ukulele and Cawl” evening. Sadly, no George Formby impersonators; however, the unmistakable aroma of cooked leeks overlaid with lamb hints that there could be a few remaining portions of the iconic soup lurking nearby.\n\nAs I pay my bill, ready to head back out into the wet Welsh afternoon, I hear one of the knitters ask: “How was the latte, Gwyn?”\n\n“Tidy. Bit like Horlicks, really. But without the taste.”\n\nHow to enter the Just Back travel writing competition\n\nEmail your entry, in 500 words (with the text in the body of the email), to justback@telegraph.co.uk.\n\nThe winner will receive £250 in the currency of their choice from the Post Office. Follow this link for full terms and conditions.\n\nThe Post Office is the UK’s largest travel money provider, offering up to 80 currencies in more than 11,500 branches with 0 per cent commission. All currencies can also be ordered online for next day branch or home delivery. Check exchange rates at postoffice.co.uk/travel-money/currency-converter.", "description": "", "authors": [], "top_image": "https://www.telegraph.co.uk/content/dam/Travel/2019/October/wales-rain-xlarge.jpg?imwidth=1200", "published_at": "2019-10-17"}