{"pub": "yahoo", "url": "https://news.yahoo.com/pressing-iran-answers-iaea-reports-090000597.html", "downloaded_at": "2019-10-04 09:21:26.704837+00:00", "title": "After pressing Iran for answers, IAEA reports improved cooperation", "language": "en", "text": "VIENNA, Oct 4 (Reuters) - Iran has improved its cooperation with the U.N. nuclear watchdog, the IAEA's acting chief said on Friday, as it presses for answers to questions it will not spell out but that diplomats say include how uranium traces were found at an undeclared site.\n\nThe International Atomic Energy Agency, which polices Iran's nuclear deal with major powers, told Tehran last month that \"time is of the essence\" in addressing what it describes in its jargon as concerns about the completeness of Iran's safeguards declarations to the agency.\n\nDiplomats say Iran has been stonewalling the agency over the uranium particles found in environmental samples taken at what Israeli Prime Minister Benjamin Netanyahu called a \"secret atomic warehouse\" in Tehran. Iran has said was a carpet-cleaning facility.\n\nActing IAEA Director General Cornel Feruta, who is heading the agency provisionally after the death in July of its longtime chief Yukiya Amano, reported progress on Friday.\n\n\"Some engagement is ongoing, and this engagement is currently taking place,\" Feruta told reporters, adding that this new engagement was in relation to his call in September for action by Iran, though he still declined to go into specifics.\n\nThe progress was the result of meetings with various senior Iranian officials in recent weeks, he said.\n\n\"This is an ongoing process ... I cannot prejudge how this is going to end. The engagement doesn't mean that the issues are completely addressed, but it's a step in the right direction,\" Feruta said.\n\nAt the same time, Iran continues on its course of breaching the deal's restrictions on its nuclear activities step by step in response to U.S. economic sanctions imposed on it since Washington pulled out of the deal last month.\n\nThe United States argues that its sanctions will force Iran to the negotiating table as Washington seeks a more far-reaching agreement addressing Iran's ballistic missile programme and its role in conflicts in the Middle East.\n\nIran says it will not negotiate unless U.S. sanctions are lifted. (Reporting by Francois Murphy; Editing by Hugh Lawson)", "description": "Iran has improved its cooperation with the U.N. nuclear watchdog, the IAEA's acting chief said on Friday, as it presses for answers to questions it will not spell out but that diplomats say include how uranium traces were found at an undeclared site.  The International Atomic Energy Agency, which", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-04"}