{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/6/snyder-redskins-give-fans-few-reasons-keep-showing", "downloaded_at": "2019-10-07 03:38:34.756266+00:00", "title": "SNYDER: Redskins give fans few reasons to keep showing up", "language": "en", "text": "ANALYSIS/OPINION:\n\nLANDOVER — At this stage of the Washington Redskins’ season — five games with nary a win — and this juncture of owner Dan Snyder’s two-decade reign of error, you’re justified in asking yourself an honest question:\n\nWhat’s the point?\n\nThe self-reflection is for fans, not the players and coaches who absorb literal and figurative beatings each week. Those employees are compensated for preparing, practicing and playing, the latter done faithfully even when the other duties aren’t reflected in the outcome.\n\nAnd remember, no matter how bad you feel, frustration in the Washington locker room was higher than anywhere else in metropolitan D.C. after Sunday’s 33-7 defeat against the New England Patriots.\n\n“0-5 is not fun,” quarterback Colt McCoy said. “I’ve never been 0-5. I doubt that many guys in that room have been 0-5. But it’s not for lack of effort.”\n\nHe got the start, playing his first game since suffering a leg injury Dec. 3. He actually “led” Washington on a 67-yard scoring drive on the team’s second possession, by executing deft ball-handling on a 65-yard touchdown run by Steven Sims.\n\nMcCoy faked an inside handoff to Adrian Peterson and gave the ball to Sims, headed around right end. A juke and a couple of missed tackles on the sideline gave Washington a lead that it nursed for a whole 10 minutes.\n\nThere were moments when you entertained wild thoughts, imagining that the winless home team would topple the undefeated Super Bowl champs. But those were fleeting and spiritless visions, despite New England being held to a touchdown and two field goals at the break.\n\nWashington sacked Tom Brady three times in the first half. Safety Montae Nicholson snared an interception at the 1-yard line to snuff a threat after Trey Quinn fumbled. A 12-7 deficit as the second half began might’ve inspired hope … except New England had 13 points at intermission three weeks ago en route tp beating the Miami Dolphins 43-0.\n\nSpeaking of which, Miami is up next for Washington and one of those teams will likely record its initial 2019 win.\n\nBut, again, even if Washington prevails, fans are forced to wonder, “Where’s this thing headed?” Coach Jay Gruden must be asking the same thing amid rampant speculation that his firing might be imminent.\n\n“Nobody has told me anything and I don’t have a concern,” Gruden said. “I’ll just wait and see. If the key works on Monday, I’ll keep working, go attack the Miami Dolphins and plan on getting our first win next week.”\n\nIf that win comes to fruition, it will enjoy little company in a season that smells like 3-13 or 4-12.\n\nThe remaining home games — against San Francisco, the New York Jets, Detroit, Philadelphia, and the New York Giants — figure to bring more throngs of enemy fans to FedEx Field, where road teams make themselves comfortable. Being embarrassed in the stands while your squad is embarrassed on the field isn’t a very appealing option for spending your Sunday afternoon.\n\nIt’s kind of like continuing to root for an organization where the management is, I don’t know, inaccessible, unaccountable and dysfunctional.\n\nGruden has to answer for the way his team commits penalties, comes out for second halves, and practices throughout the week. But he also has dealt with a preponderance of injuries, contract impasses and top-down culture issues beyond his control and absent among most peers.\n\nWith his job as secure as dandelions in a hurricane, does he feel like he’s gotten a fair shake?\n\n“You know … it’s ….” he began, searching for the filter that often escapes him before enacting it this time. “Yes, I’ve been provided ample opportunities to succeed around here. I’ve got good players; I’ve got a good staff. Just haven’t produced on Sundays. Or Mondays. So gotta do better.”\n\nAs long as he’s allowed on the premises in Ashburn, he’ll keep trying. So will the players, who talked about circling wagons instead of pointing fingers, about going back to the drawing board instead of writing off one another. To their credit, they haven’t given up.\n\n“I’ve been on a couple of teams like this,” said veteran offensive tackle Donald Penn, who once was 0-10 with Oakland, and also endured starts of 0-7 and 0-8 with Tampa Bay. “One thing I like about this team is we’re staying together. No one is blaming each other.”\n\nIt’s on them to perform better, regardless of who’s the coach, who’s the rookie quarterback, and who had the bright idea to marry the two when a rational organization would’ve chosen one or the other. They’ll all stay at it because it’s their responsibility as professionals.\n\nThey’re paid to show up and stick around.\n\nBut given Washington’s malignant ownership and management, why should fans?\n\n• Brooklyn-born and Howard-educated, Deron Snyder writes his award-winning column for The Washington Times on Tuesdays and Thursdays. Follow him on Twitter @DeronSnyder.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Redskins players and coaches are paid, and paid well, to endure, no matter how ugly this season gets. But why would fans put themselves through this?", "authors": ["The Washington Times Http", "Deron Snyder"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/06/Patriots_Redskins_Football_21983.jpg-4e0c4_c0-106-2544-1589_s1770x1032.jpg?65cd6d11034354c7efe6b58a7fdce1447e04d1db", "published_at": "2019-10-06"}