{"pub": "reuters", "url": "https://reuters.com/article/us-europe-stocks/european-stocks-suffer-from-saudi-attacks-but-oil-firms-soar-idUSKBN1W10L7", "downloaded_at": "2019-09-16 09:17:41.830639+00:00", "title": "European stocks suffer from Saudi attacks, but oil firms soar", "language": "en", "text": "(Reuters) - European shares fell on Monday after four straight sessions of gains as attacks on crude facilities in Saudi Arabia and weak Chinese data added to worries over global growth while boosting shares in unaffected oil producers.\n\nFILE PHOTO: The German share price index DAX graph is pictured at the stock exchange in Frankfurt, Germany, September 12, 2019. REUTERS/Staff\n\nThe drone attacks on the weekend, which cut more than 5% of the global oil supply, sent crude prices soaring as much as 19% and pushed the oil & gas index .SXEP 2.4% higher, driving roughly 3% gains for majors BP (BP.L) and Shell (RDSa.L).\n\nUK and Irish-based explorer Tullow Oil (TLW.L) jumped 7%, to the top of Europe’s STOXX 600, after the firm said it plans to drill three or more exploration wells in Guyana next year following its second oil discovery in the country.\n\nAll other major European sectoral indexes fell, with travel and leisure .SXTP the worst hit with a 1.0% slide, dragged down by shares of airlines Ryanair Holdings (RYA.I), Air France KLM SA (AIRF.PA) and EasyJet PLC (EZJ.L).\n\n“Usually, higher oil prices are a product of higher demand, but in a scenario like this where supply is squeezed because of an attack, that is the worst of both worlds,” said David Madden, market analyst at CMC Markets.\n\n“China’s economy is clearly fuelling down; things in the U.S.-China trade situation are looking a bit better but not good; Germany is potentially looking toward a recession. The last thing the global economy now needs is a surge in oil prices.”\n\nAdding to some weak indicators from China last week, industrial production in the world’s second largest economy grew at its weakest pace in 17-1/2 years in August amid rising U.S. trade pressure and softening domestic demand.\n\nThe pan-European STOXX 600 index and trade-sensitive German shares .GDAXI were both down 0.6%.\n\nEuropean stocks ended Friday with their fourth straight weekly gain, as investors circled back into cyclical sectors amid signs of progress in U.S.-China trade talks.\n\nThe European Central Bank also cut rates deeper into negative territory last week and relaunched bond purchases with no scheduled end-date, laying down a marker that it would continue to do all it could to support euro zone growth.\n\nMarket participants are now looking to the U.S. Federal Reserve’s policy meeting starting Wednesday, where the central bank is widely expected to ease interest rates and signal further moves.\n\nIn other corporate news, Volkswagen (VOWG_p.DE) was down 0.5% as the automaker agreed to pay up to $127 million ($87.3 million) to settle lawsuits brought on behalf of thousands of Australian customers caught up in its global diesel emissions cheating scandal.", "description": "European shares fell on Monday after four straight sessions of gains as attacks on crude facilities in Saudi Arabia and weak Chinese data added to worries over global growth while boosting shares in unaffected oil producers.", "authors": ["Shreyashi", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190916&t=2&i=1430362271&w=1200&r=LYNXMPEF8F0E2", "published_at": "2019-09-16"}