{"pub": "reuters", "url": "https://reuters.com/article/us-nobel-prize-medicine/nobel-medicine-prize-won-by-doctors-for-work-on-cells-response-to-oxygen-idUSKBN1WM0X3", "downloaded_at": "2019-10-07 20:10:00.156861+00:00", "title": "Nobel Medicine Prize won by doctors for work on cells' response to oxygen", "language": "en", "text": "STOCKHOLM/LONDON (Reuters) - Two Americans and a Briton won the 2019 Nobel Medicine Prize on Monday for discovering a molecular switch that regulates how cells adapt to fluctuating oxygen levels, opening up new approaches to treating heart failure, anaemia and cancer.\n\nWilliam Kaelin at the U.S. Dana-Farber Cancer Institute and Harvard Medical School said he was overwhelmed to get a pre-dawn call to say he and two other doctors, Gregg Semenza of Johns Hopkins University and Peter Ratcliffe of Oxford University, had won the 9-million Swedish-crown ($913,000) prize.\n\n“I don’t usually get phone calls at 5 a.m., but I knew this was ‘Nobel Monday’, so it was either going to be a poorly timed mobile call or extremely good news,” he told Reuters by telephone. “My heart started racing. It was almost surreal.”\n\nRatcliffe, who is also clinical research director at the Francis Crick Institute in London, said in a statement he was “honoured and delighted at the news”.\n\nThe scientists’ work established the basis for understanding of how oxygen levels are sensed by cells - a discovery that is being explored by medical researchers seeking to develop treatments for various diseases that work by either activating or blocking the body’s oxygen-sensing machinery.\n\nTheir work centres on the hypoxic response - the way the body reacts to oxygen flux - and “revealed the elegant mechanisms by which our cells sense oxygen levels and respond” said Andrew Murray, an expert at Britain’s University of Cambridge who congratulated the three.\n\n“VITAL INGREDIENT”\n\n“Oxygen is the vital ingredient for the survival of every cell in our bodies. Too little – or too much – can spell disaster. Understanding how evolution has equipped cells to detect and respond to fluctuating oxygen levels helps answer fundamental questions,” said Venki Ramakrishnan, president of Britain’s Royal Society scientific academy.\n\n“As (this) work.. shows us, it also gives insights into the way these processes continue to shape our health and wellbeing.”\n\nRandall Johnson, a professor at Sweden’s Karolinska Institute where the prize is awarded, said it was “a prize that really tells us the fundamental truth about how cells work”.\n\nDuring exercise, for example, the body uses oxygen at a rapid pace, “and this is a switch that helps the cell figure out how much oxygen it’s getting and how it should behave.”\n\n“If you have a stroke there’s suddenly no oxygen going to the brain... Those cells, if they are going to survive, need to find a way to adapt to that level of oxygen,” he said.\n\nMedicine is the first of the Nobel Prizes given each year. The prizes for achievements in science, peace and literature have been awarded since 1901 and were created in the will of dynamite inventor and businessman Alfred Nobel.\n\nSlideshow (8 Images)\n\nNobel medicine laureates have included scientific greats such as Alexander Fleming, the discoverer of penicillin, and Karl Landsteiner, who identified separate blood types and so enabled safe transfusions to be widely introduced.\n\nThomas Perlmann, a member of the Nobel Assembly, said he had reached Kaelin by phone early on Monday to tell him on the award. “He was really happy, almost speechless,” Perlmann said.\n\nLast year American James Allison and Japanese Tasuku Honjo won the prize for discoveries about how to harness the immune system in cancer therapies.", "description": "Two Americans and a Briton won the 2019 Nobel Medicine Prize on Monday for discovering a molecular switch that regulates how cells adapt to fluctuating oxygen levels, opening up new approaches to treating heart failure, anaemia and cancer.", "authors": ["Niklas Pollard", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191007&t=2&i=1438020247&w=1200&r=LYNXMPEF960KY", "published_at": "2019-10-07"}