{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Culture/paula-abdul-straight-las-vegas-forever-girl-residency/story?id=66448962", "downloaded_at": "2019-10-23 09:49:33.436260+00:00", "title": "Paula Abdul goes straight (up) to Las Vegas, as 'Forever Your Girl' residency launches tonight", "language": "en", "text": "Paula Abdul wants you to remember she's \"Forever Your Girl\" -- and she'll officially launch her Las Vegas residency of that name on Tuesday night at the Flamingo hotel.\n\nThe show will feature the singer's chart-topping hits and iconic choreography, and will be \"interactive\" as well as \"joyous and fun.\"\n\n\"It's so much easier to be in one place and not have to travel all over,\" she told ABC Audio about choosing a Vegas run rather than a multi-city tour this time around. \"I'm, like, one of those crazy ones that loves being on the bus. But there's nothing like being stationed in one place...I've always felt that my show belongs in Las Vegas.\"\n\nAbdul says playing an intimate room allows her to interact with the fans, which she loves.\n\n\"The audience is so present right there and it's a lot of fun. It's heartfelt. There's an incredible library of my choreography. It's really joyous and fun,\" she adds. Plus, her famous duet partner from her 1989 hit \"Opposites Attract\" is coming along for the ride.\n\n\"[MC] Skat Kat is part of the show,\" she reveals of the famous cartoon feline. \"He's a little filthy, and he has this dressing room that's bigger than mine....but it's O.K.!\"\n\nThe only tough part, the singer admits, is remembering the game-changing choreography she created for hits like \"Straight Up.\"\n\n\"I've choreographed so many routines, but for whatever reason, I forget those steps. But I remember Laker Girls routines!\" she laughs. \"So honestly, I have to talk to my body and I have to take time warming up, eat properly, try to get enough sleep. But I love what I'm doing, so it's a joy.\"\n\nThe show will continue through Oct. 26, and then again from Nov. 26 through Dec. 19.", "description": "Paula promises to deliver a", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/paula-gty-er-191022_hpMain_16x9_992.jpg", "published_at": "2019-10-22"}