{"pub": "reuters", "url": "https://in.reuters.com/article/us-usa-stocks/wall-street-opens-higher-as-focus-shifts-to-fed-idINKBN1X91BW", "downloaded_at": "2019-10-30 14:35:17.319628+00:00", "title": "Wall Street dips as focus shifts to Fed", "language": "en", "text": "(Reuters) - Wall Street struggled for direction on Wednesday as investors geared up for a policy decision by the Federal Reserve later in the day.\n\nFILE PHOTO: Traders work on the floor at the New York Stock Exchange (NYSE) in New York, U.S., October 22, 2019. REUTERS/Brendan McDermid\n\nThe central bank is widely expected to cut interest rates for the third time this year to counter any fallout from a protracted U.S.-China trade war on the domestic economy.\n\nAfter a modestly higher open, U.S. stocks slipped into the red. The interest rate sensitive banking sub-sector .SPXBK shed 0.6%. Five of the 11 major S&P 500 sectors were lower, with losses in the financial sector .SPSY weighing the most.\n\nThe Fed decision is due at 2 p.m. ET followed by a press conference from Chair Jerome Powell.\n\nTraders have fully priced in a quarter percentage point rate cut, up from a nearly 40% chance a month earlier. Hopes of a rate cut and optimism around trade talks had pushed the benchmark S&P 500 to record highs in the last two sessions.\n\n“Certainly a rate cut is widely factored in,” said Scott Brown, chief economist at Raymond James in St. Petersburg, Florida. “Most people are looking for some sort of a hint that this will likely be it for a while.”\n\nA Commerce Department report showed U.S. economic growth slowed less than expected in the third quarter as declining business investment was offset by resilient consumer spending and a rebound in exports, further allaying financial market fears of a recession.\n\nNearly half of the S&P 500 companies have posted quarterly results so far, of which 77.1% have beaten profit estimates. Still, analysts are expecting a 1.9% drop in third-quarter earnings, according to Refinitiv data.\n\nGeneral Electric Co (GE.N) jumped 10% after the industrial conglomerate beat quarterly profit estimates and raised its cash forecast for the year.\n\nYum Brands Inc (YUM.N) slid 9.8% after it missed quarterly profit expectations, hit by a write down in the value of its investment in delivery company GrubHub (GRUB.N) and unrelenting troubles at its Pizza Hut chain.\n\nShares of tech heavyweights Apple Inc (AAPL.O) and Facebook Inc (FB.O) also fell marginally ahead of their earnings reports after markets close.\n\nAt 9:59 a.m. ET the Dow Jones Industrial Average .DJI was down 11.51 points, or 0.04%, at 27,059.91, the S&P 500 .SPX was down 2.84 points, or 0.09%, at 3,034.05 and the Nasdaq Composite .IXIC was down 9.97 points, or 0.12%, at 8,266.88.\n\nAmong other stocks, Mattel Inc (MAT.O) surged nearly 17% after the U.S. toymaker reported a surprise jump in quarterly revenue on higher demand for newer models of its flagship Barbie brand and dolls based on Korean pop-sensation BTS.\n\nJohnson & Johnson (JNJ.N) rose 2.5% as the company said 15 new tests found no asbestos in a bottle of baby powder that the U.S. Food and Drug Administration says tested positive for trace amounts of asbestos. FDA said it stands by its finding.\n\nHealth insurer Centene Corp (CNC.N) gained 6.4% after WellCare Health Plans (WCG.N), which it is buying, posted third quarter earnings well ahead of Wall Street targets.\n\nDeclining issues outnumbered advancers for a 1.61-to-1 ratio on the NYSE and a 1.75-to-1 ratio on the Nasdaq.\n\nThe S&P index recorded four new 52-week highs and no new lows, while the Nasdaq recorded 27 new highs and 34 new lows.", "description": "Wall Street struggled for direction on Wednesday as investors geared up for a policy decision by the Federal Reserve later in the day.", "authors": ["Arjun Panchadar", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191030&t=2&i=1446534068&w=1200&r=LYNXMPEF9T0V2", "published_at": "2019-10-30"}