{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/20/chiles-president-reverses-fare-increase-as-unrest-continues", "downloaded_at": "2019-10-20 00:14:35.248236+00:00", "title": "Chile's president reverses fare increase as unrest continues", "language": "en", "text": "Chilean president Sebastián Piñera announced on Saturday that he would reverse public transport fare hikes which had caused widespread protests in the country.\n\nChile protests: state of emergency declared in Santiago as violence escalates Read more\n\nPiñera said in a national broadcast from the presidential palace in Santiago that he had listened “with humility” to “the voice of my compatriots” and to discontent over the cost of living in one of Latin America’s wealthiest yet most unequal nations. He also announced a working group to address their concerns.\n\nSeparately, the army imposed a curfew late on Saturday in parts of Santiago. Pinera had earlier announced a state of emergency in the capital as clashes with police continued and spread to other Chilean cities.\n\nAs ordained by Chile’s dictatorship-era constitution, the state of emergency will apply to Santiago and can last for 15 days. It grants the government additional powers to restrict citizens’ freedom of movement and their right to assembly. It saw soldiers return to the streets for the first time since an earthquake devastated parts of the country in 2010.\n\nChile students' mass fare-dodging expands into city-wide protest Read more\n\n“The aim is to ensure public order and the safety of public and private property,” Piñera said in a televised address. “There will be no room for violence in a country with the rule of law at its core.”\n\nThe latest protests follow grievances over the cost of living, specifically of healthcare, education and public services. Anger has also been directed at the Carabineros national police force, whose heavy-handed repression of protests has come under the spotlight. Once one of the country’s most respected institutions, its reputation has been eroded by corruption scandals and a reputation for brutality.\n\n", "description": "Sebastián Piñera suspends public transport price hikes that sparked widespread protests", "authors": ["Staff"], "top_image": "https://i.guim.co.uk/img/media/ec1a6d7a6847dbe0b6cb8d51c209121cd733c339/0_25_4380_2628/master/4380.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1c1e286a190fa3c3638ea6bb94aa16d6", "published_at": "2019-10-20"}