{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-woolworths-grp-results/australias-woolworths-says-underpaid-staff-by-as-much-as-200-million-idUKKBN1X90AT", "downloaded_at": "2019-10-30 04:16:58.356948+00:00", "title": "Australia's Woolworths says underpaid staff by as much as $200 million", "language": "en", "text": "SYDNEY (Reuters) - Woolworths Group Ltd (WOW.AX) said it had underpaid thousands of supermarket workers for years and will need to repay as much as A$300 million ($155.51 million pounds), the latest and most high-profile company to be caught up in wage scandals across corporate Australia.\n\nFILE PHOTO: Shoppers walk into a Woolworths supermarket in Sydney, Australia August 22, 2017. REUTERS/Jason Reed/File Photo\n\nThe admission from the country’s biggest company by revenue prompted a government agency to say it would launch an investigation into Woolworths as well as a call from an opposition politician for a parliamentary inquiry into what he called “wage theft” in Australia.\n\nWoolworths said a routine internal review found the salaries it had paid to about 5,700 permanent employees failed to take into account an allowance for overtime which they should have received under industrial laws.\n\n“We’re unequivocally sorry and we’re going to repay the money, no questions asked,” said Woolworths CEO Brad Banducci on an earnings call, overshadowing a robust rise in first-quarter sales.\n\nThe underpayment of workers has emerged as hot-button issue this year. In February, Super Retail Group Ltd (SUL.AX), which sells auto, sports and outdoor goods, said it underpaid managers by A$43 million - a scandal that forced the departure of its CEO.\n\nSince then, one of Australia’s best-known celebrity chefs, George Calombaris, admitted to underpaying restaurant staff nearly A$8 million while jeweler Michael Hill International Ltd MHR.AX has admitted to underpaying staff A$25 million.\n\nGovernment agency the Fair Work Ombudsman said it was “shocked that yet another large, publicly listed company has ... admitted to breaching Australia’s workplace laws on a massive scale”.\n\nIt will investigate Woolworths, which reported the breach itself and “hold them to account”.\n\nShadow industrial relations minister Tony Burke of the centre-left Labor party said in a statement he wanted a parliamentary inquiry into “the reasons for wage and superannuation theft; the cost of wage theft to the economy; the best means of uncovering and deterring such theft; and the taxation treatment of those affected.”\n\n“While Woolworths has today come forward and committed to paying its workers what they’re owed, it should not have taken this long to uncover these underpayments.”\n\nThe wage disclosure clouded a bigger-than-expected jump in supermarket sales for Woolworths, up 6.6% on a same-store basis for the three months to end-September, as it benefited from a wildly popular “Lion King” collectable toy promotion.\n\nShares in Woolworths were down 1.3% by midsession, in a weaker overall market .\n\n($1 = 1.4562 Australian dollars)", "description": "Woolworths Group Ltd said it had underpaid thousands of supermarket workers for years and will need to repay as much as A$300 million ($155.51 million pounds), the latest and most high-profile company to be caught up in wage scandals across corporate Australia.", "authors": ["Byron Kaye", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191030&t=2&i=1446397833&w=1200&r=LYNXMPEF9T06A", "published_at": "2019-10-30"}