{"pub": "zdnet", "url": "https://www.zdnet.com/article/hp-to-axe-up-to-9000-staff-globally-as-part-of-company-restructure", "downloaded_at": "2019-10-04 02:35:10.249891+00:00", "title": "HP to axe up to 9,000 staff globally as part of company restructure", "language": "en", "text": "HP has announced that it will be letting go approximately 7,000 to 9,000 employees as part of a company restructure that will begin in fiscal year 2020.\n\nThe company said the restructuring plans will see its operating model be simplified so it can become a \"more digitally enabled company\".\n\n\"We are taking bold and decisive actions as we embark on our next chapter,\" said HP incoming president and CEO Enrique Lores.\n\n\"We see significant opportunities to create shareholder value and we will accomplish this by advancing our leadership, disrupting industries, and aggressively transforming the way we work. We will become an even more customer-focused and digitally enabled company that will lead with innovation and execute with purpose.\"\n\nAffected employees will be let go through a combination of employee exits and voluntary early retirement, HP said.\n\nTo be completed by fiscal 2022, the restructure, according to HP, will cost the business a total of approximately $1 billion, with approximately $100 million in 4Q19, $500 million in fiscal 2020, and the rest to be split between fiscal 2021 and 2022.\n\nThe company also estimates that the restructure will result in annualised gross run rate savings of about $1 billion by the end of fiscal 2022.\n\nThe announcement comes as part of HP's outlook for fiscal 2020, which estimates that its generally accepted accounting principles (GAAP) diluted net Earnings Per Share (EPS) will be in the range of $1.98 to $2.10. It also estimates that non-GAAP diluted net EPS will be in the range of $2.22 to $2.32.\n\nBased on the current environment, HP said it anticipates generating free cash flow of at least $3 billion for fiscal 2020.\n\nRelated Coverage\n\nHP's new Windows 10 Spectre x360 13: Ice Lake chip, 4K screen option, 22-hr battery\n\nHP overhauls and shrinks the Spectre x360 13 2-in-1 and promises 22 hours of battery life.\n\nHP launches HP Elite Dragonfly, a premium business laptop and Intel Project Athena poster child\n\nHP's Elite Dragonfly is less than 1 kilogram and has a design to make a statement yet be all about business.\n\nHP names Lores CEO, reports solid Q3\n\nHP said Enrique Lores, head of its printing unit, will take over as CEO for Dion Weisler. Separately, HP's third quarter earnings were better than expected.\n\nHP: Product design must reflect rapid Asian urbanisation, changing demographics\n\nAsia's growing population needs to have a bigger voice in the global development of new products, which also will need to cater to the region's increasingly young workforce and change in consumption from transactions to subscriptions.\n\nHP adds second-gen AMD Ryzen mobile processors options to latest EliteBook 700 G6 business laptops\n\nWith the 13.3-inch EliteBook 735 G6 and the 14-inch EliteBook 745 G6, HP continues to provide an alternative to Intel for enterprise notebooks. The new laptops can be equipped with up to a Ryzen 7 3700U processor and will start at a little more than $900.", "description": "The company touts the restructure will allow it to become a \"more digitally enabled company\".", "authors": ["Aimee Chanthadavong"], "top_image": "https://zdnet1.cbsistatic.com/hub/i/r/2019/02/04/b646412e-659c-43cf-8667-e68dd4d80213/thumbnail/770x578/13d6b5e3f661cfb2b67df137dbccaed0/hp-inc-logo620x465.jpg", "published_at": "2019-10-04"}