{"pub": "atlantic", "url": "https://theatlantic.com/politics/archive/2019/09/trump-ukraine-scandal-adam-schiff/598909", "downloaded_at": "2019-09-26 20:52:23.730206+00:00", "title": "Adam Schiff’s Last Laugh (For Now)", "language": "en", "text": "“There can be no claim of ignorance this time,” Schiff told reporters this afternoon after his committee heard three hours of testimony from Acting Director of National Intelligence Joseph Maguire. That is, of course, because the White House’s own summary of Trump’s July 25 phone call with President Volodymyr Zelensky of Ukraine has Trump directly asking for the “favor” of looking into Hunter Biden’s business dealings there, in implicit exchange for hundreds of millions of dollars in American military aid to Ukraine.\n\nThe anonymous whistle-blower’s complaint alleges that the call was just one part of a long-running campaign by Trump and his personal lawyer, Rudy Giuliani, to prompt Ukraine to investigate the Bidens. Earlier today, in a phone call with the Atlantic White House reporter Elaina Plott, Giuliani said, “It is impossible that the whistle-blower is a hero and I’m not. And I will be the hero! These morons—when this is over, I will be the hero.”\n\nWhile Schiff acknowledged that some aspects of the whistle-blower’s accusations have yet to be corroborated, he said, “In a very substantial part, this whistle-blower has already been found to be credible,” by virtue of the White House’s official record of the call.\n\nRead: Rudy Giuliani: ‘You should be happy for your country that I uncovered this’\n\nTrump promptly tweeted that “Adam Schiff has zero credibility. Another fantasy to hurt the Republican Party.” But Schiff, whose demeanor is as low-key and unruffled as his convictions are fierce, merely smiled at reporters outside the House hearing room and replied, “I’m always flattered when I’m attacked by someone of the president’s character.”\n\nAll along, first as the committee’s ranking member and then as chairman, after the Democrats won control of the House in last year’s midterm elections, Schiff’s paramount goal has been simple, as he told me just before Mueller testified to his committee in July about his final special-counsel report.\n\n“It is our hope that we can inform the American people of the full facts, that they can appreciate the degree to which the Russians interfered in a presidential election to help Donald Trump, the degree to which the president welcomed that help, knew it was going on … and then lied about it and covered it up. And the degree to which those actions and his actions since continue to put us at risk, because it encourages the Russians to get involved again.”\n\nRead: Adam Schiff is back from the wilderness\n\nThat Trump himself is now on record as asking for just that kind of help—albeit from Russia’s bitter adversary, Ukraine—is a plot line almost too perfect to have been made up. “It’s hard to imagine a more serious set of allegations than those contained in the complaint,” Schiff told reporters after the hearing, noting that the president’s actions involved numerous potential offenses, criminal or otherwise.", "description": "The House Intelligence Committee chairman has spent months illuminating Trump’s alleged misdeeds with fruitless results. Perhaps that’s about to change.", "authors": ["Todd S. Purdum"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/Schiff/facebook.jpg?1569529403", "published_at": "2019-09-26"}