{"pub": "wsj", "url": "https://barrons.com/articles/good-company-how-the-online-art-platform-alphaa-supports-brazils-rainforests-01568309539?mod=rsswn", "downloaded_at": "2019-09-13 00:57:31.293937+00:00", "published_at": "2019-09-12", "title": "Good Company: How the Online Art Platform Alpha’a Supports Brazil’s Rainforests", "language": "en", "text": "Text size\n\nWhen Manuela Seve and Renata Thomé moved their e-commerce art platform Alpha’a from their home base in Brazil to New York City in 2017, they saw the potential to drive change through the power of art. The goal? To connect businesses and individual art buyers with collections by a global field of artists, some of whose work specifically speaks to serious environmental threats facing the planet.\n\nAlpha’a started small before growing into an international digital art hub. Seve and Thomé founded their company in 2014 in Rio de Janeiro, launching officially in the form of a T-shirt competition at ArtRio, one of Brazil’s main art fairs. Over the next few years, they grew their platform into a network that would eventually include 7,000 different artists and businesses around the world.\n\nOnce they moved to New York two years ago, the two entrepreneurs built the platform to look as it does now—a crowdsource-driven approach to finding new artists, with users voting on works that will become available for purchase, giving them the option to create customized art collections. They see this as a way to appeal to technologically savvy clientele, democratizing and modernizing the art acquisition process that can at times seem stuffy and remote to younger consumers.\n\n“Alpha’a works exclusively with limited-edition prints from artists from all over the world, which means that, even though we sell actual collectible works of art, working with editions creates more accessible price points due to how editions are proportionally priced to original works divided by the size of the total production,” says Seve, Alpha’a’s founder and CEO.\n\nThomé, the company’s partner and COO, adds that this brings about a supply-and-demand approach to pricing art.\n\nBeyond the central conceit behind their business model is a dedication to environmental activism. Once they moved to the U.S., Thomé and Seve started the “Artivism Challenge,” partnering with NGOs to host a competition that sees artists creating works that address a pressing environmental issue. Proceeds go to ecological protection efforts.\n\nThis year, Alpha’a is working directly with RainForest Alliance, with all profits of specific works available right now going to the nonprofit for its conservation efforts to protect the endangered Amazon.\n\nTHE ITEM\n\nIf you take a look through Alpha’a, you’ll see a wide array of styles and mediums. The art featured on the platform ranges from traditional paintings to mixed media collage to sharp, striking photography and portraiture. As of publication, there are just under 530 items available for sale on the site.\n\nWhen it comes to the significance of the work featured on their platform, Alpha’a’s founders see their artists as introducing more consumers to fine art while also using their creativity to spotlight important issues facing the globe.\n\n“Art has the power to easily convey messaging, the first step is to create awareness, but if we rely solely on graphic imagery, humans feel detached from the problem,” Seve says. “When one creates a positive outlook and personal bonds with the message, the viewer is engaged to participate in the solution, when we are able to educate audiences that our choices do matter, especially when it comes to meat consumption and the current problem in the Amazon, a snowball effect can be created.”\n\nPRICE\n\nThe art for sale on Alpha’a ranges from pieces as low as $100 to $120, up to those ranging from $1,500 to $1,900.\n\nEliseu Cavalcante is one of the artists whose work will benefit RainForest Alliance. Eliseu Cavalcante\n\nDESCRIPTION\n\nBoth Seve and Thomé approached their business from completely different places. On one hand, Seve grew up with art—her father is an art dealer while her mother is an artist. Their family owns one of the oldest galleries in Brazil, she says.\n\nDespite this creative background, she worked in finance, serving as an equity analyst at Gávea Investment, a Brazilian investment management firm.\n\nOn the other hand, Thomé says she had “no familiarity with the arts until later in life.” Her first encounter with the art world came when she moved to New York for the first time in 2011, working briefly at a gallery.\n\n“I realized I was very passionate about the subject, but lacked technical training and because of that, I decided to do a Masters at Christie’s Education,” Thomé adds. Eventually, she worked for the David Zwirner gallery in New York and was an art consultant for online auction house Paddle8.\n\nSeve’s family background and financial training complemented Thomé’s expertise. They say this meld of talents has enabled them to work well with their artists while also creating an online space that’s relatable to their consumer base.\n\nWHAT’S THE GOOD?\n\nTwo years ago when they started the Artivism Challenge, Thomé and Seve partnered with Oceanic Global, a nonprofit dedicated to ocean conservation efforts. This year’s collaboration with RainForest Alliance is particularly timely given the near-daily headlines about forest fires ravaging the Amazon.\n\nThomé says that “de-regulation in Brazil has led to a dangerous negative tipping point in the state of the Amazon” and that it is now up to the “power of private organizations,” as opposed to governments, to save the diverse ecosystem of the rainforests.\n\nEliseu Cavalcante is one of the artists whose work will benefit RainForest Alliance. Cavalcante ’s pieces will be shown alongside others in a pop-up gallery during New York’s Climate Change Week later this month.\n\nWHAT’S NEXT\n\nAlpha’a has only existed in its current form for two years, and its founders see room for continued growth, especially in spotlighting environmental causes.\n\n“We expect to continue organizing more of such initiatives surrounding social and environmental causes in the future, and eventually find private companies to support changes envisioned by Alpha’a artists into real life problems,” Seve says.\n\nThomé adds that this partnership between companies, NGOs, and “dreamers” who love art will “facilitate real-world change.”", "description": "The New York-based company connects 7,000 different artists and businesses around the world", "authors": ["Brian Mastroianni"], "top_image": "https://images.barrons.com/im-106615/social"}