{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7557379/Miley-Cyrus-poses-shirtless-boyfriend-Cody-Simpson-hospitalized-tonsillitis.html", "downloaded_at": "2019-10-10 06:19:18.940173+00:00", "title": "Miley Cyrus poses with shirtless boyfriend Cody Simpson after being hospitalized for tonsillitis", "language": "en", "text": "Miley Cyrus was recently treated for tonsillitis, as she updated fans from her hospital bed.\n\nBut it seems the Black Mirror star has already made a full recovery, as she's home with boyfriend Cody Simpson.\n\nShe took to her Instagram story Wednesday with a photo of herself looking in good health with her new beau.\n\nFull recovery: Miley Cyrus seems to have made a full recovery, as she posted a selfie Wednesday with shirtless boyfriend Cody Simpson, after being treated for tonsillitis\n\nCyrus, 26, wrapped her arms around the 22-year-old who went shirtless, showing off his ripped physique in the mirror selfie.\n\nShe captioned the black-and-white snap: 'She made it home. Recovering from surgery send all the vibe$.'\n\nSimpson proved to be a supportive boyfriend, showing up for visitation hours, guitar in tow.\n\nCyrus took to her story Tuesday with a black-and-white video of Simpson serenading her in bed.\n\nSerenading the sick: She took to her story Tuesday with a black-and-white video of Simpson serenading her in bed while she was hospitalized\n\nPrivate performance: But the video was posted without the sound, as it was a special song he wrote for her only\n\nBest boyfriend ever: The Australian musician also brought roses for his beloved, as he arrived toting his guitar case\n\nBut the video was posted without the sound, as it was a special song he wrote for her only.\n\nShe wrote: 'It's too special to be only heard in full by my ears so I am currently pressuring him to DROP IT next week... & it's working.'\n\nIn addition to his guitar and sweet vocals, the Australian musician also brought roses for his beloved.\n\nCyrus recently began dating Simpson amid her divorce with Liam Hemsworth, following her fling with Kaitlynn Carter\n\nShe and Hemsworth initially began dating from 2009, got engaged in 2012, broke up in 2013, and rekindled the romance around 2016.\n\nGood spirits: She seemed upbeat as she updated fans on her health, posting a selfie from bed\n\nGet well: She explained that she's trying to make a quick recovery, in order to make it to Gorillapalooza, Ellen DeGeneres and Portia de Rossi's music festival to benefit their wildlife charity The Ellen Fund\n\nMain gays: In another shot, she thanked her 'main gays' as she lied next to a vase of flowers and a balloon with rose petals scattered across her blanket\n\nThe Mother's Daughter artist seemed upbeat as she updated fans on her health, posting a selfie from bed: 'Trying to heal quick so I can make it to Gorillapalooza ... this weekend!'\n\nShe tagged Ellen DeGeneres and Portia de Rossi, who host the music festival to benefit their wildlife charity The Ellen Fund, as well as Bruno Mars, who's slated to perform.\n\nCyrus asked for a boost from nearly 100 million followers in hopes of a swift recovery so she can make it to show: 'Send gooooood vibes my way! Hoping the Rock star G*DS send me a boost of bad a** and help me kick this s*** to the curb where it belongs! We got gorillas to save!'\n\nIn another shot, she thanked her 'main gays' as she lied next to a vase of flowers and a balloon with rose petals scattered across her blanket.\n\nShe was also visited by her mom Tish, who brushed her daughter's hair while she modeled a hospital gown in the bathroom mirror.", "description": "Simpson proved to be a supportive boyfriend, showing up for visitation hours, guitar in tow. Cyrus took to her story Tuesday with a black-and-white video of Simpson serenading her in bed.", "authors": ["Glenn Garner For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/06/19525574-0-image-a-52_1570686112034.jpg", "published_at": "2019-10-10"}