{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/10/25/if-i-threaten-someone-youll-know-it-kellyanne-conway-is-sounding-like-donald-trump/?tid=pm_pop", "downloaded_at": "2019-10-25 23:44:11.288244+00:00", "title": "‘If I threaten someone, you’ll know it’: Kellyanne Conway is sounding like Donald Trump", "language": "en", "text": "It’s the media story of the week, thanks to all the hostile, condescending and imperious comments that Conway made in the call. The audio is intoxicating.\n\nHere’s the quick summary of the proceedings: Yilek on Tuesday aggregated a story from Bloomberg News claiming that President Trump had considered replacing acting chief of staff Mick Mulvaney with Conway, counselor to the president. Trump later denied the report, as if that’s relevant. In contextualizing Conway’s alleged candidacy for a promotion, Yilek noted that she had unique circumstances tugging at her professional life:\n\nAD\n\nAD\n\nConway has been in the middle of Trump’s barbs with her husband, George, a conservative lawyer who frequently makes headlines for his criticism of the president. George Conway said earlier this month that White House aides should resign unless they can ‘have some moderating or blunting effect’ on Trump. He refused to discuss his wife, who has worked for Trump since the 2016 presidential campaign.\n\nIt was that passage that Conway couldn’t abide, so she rang up Yilek. A key part:\n\nSo I just am wondering why in God’s earth you would need to mention anything about George Conway’s tweets in an article that talks about me as possibly being chief of staff. Other than it looks to me like there’s no original reporting here, you just read Twitter and other people’s stuff, which I guess is why you don’t pick up the phone when people call from the White House because if it’s not on Twitter or it’s not on cable TV, it’s not real.\n\nThere’s so much delicious filling in that polemical empanada — generational haughtiness about trends in info-tech, reportorial nitpicking, “wondering” as camouflage for bullying, and so on. The counselor goes on to ask Yilek, in essence, to justify her professional existence. The Washington Examiner identifies Yilek as a “breaking news reporter,” which served as Conway’s jumping-off point: “I’m just trying to give you a chance to explain why you think what you wrote qualifies as breaking news or reporting,” said Conway.\n\nAs the White House aide continued complaining, Yilek projected a quiet confidence that clearly unsettled Conway, who was forced to declare that she was a “powerful woman.” “Don’t pull the crap where you’re trying to undercut another woman based on who she’s married to. He gets his power through me, if you haven’t noticed. Not the other way around,” said Conway.\n\nAD\n\nAD\n\nThe call wound down, and Conway returned to her theme: “I’m not caught in the middle of anything except trying to understand somebody whose title is breaking news reporter, what that means.”\n\nTo which Yilek responded, “Look, I’ve got to go. I’ve got a meeting to run to.”\n\nHow did we ever get the privilege of listening in on this back-and-forth? Well, the Examiner transcript makes clear that Conway’s assistant, Tom Joannou, requested an off-the-record chat. After an exchange of some unknown duration, Joannou put Conway on the line. According to the transcript: “When Conway came onto the line, without any agreement that a conversation with her would be off the record, the conversation reverted to being on the record, as per Washington Examiner policy and standard journalistic practice.” One complication with this explanation: At one point in the exchange, Yilek asks Conway if she like to “dispute that on the record? I would be happy to put that in my story.”\n\nAD\n\nAD\n\nIt’s hard to believe that as Conway berates and scolds and scorns Yilek, she has any expectation that her words will eventually be conveyed to the public via audio and a handy transcript. “I didn’t say the call was on or off the record 'cause I could care less. She must have thought it was off the record because then she asked, quote, ‘Would you like to put any of this on the record,’” Conway said Friday. She laid out her side of the story in a fine-print tweet:\n\nThe false tweet below makes my point about how dangerous it is to characterize someone else’s intentions, feelings, or state of mind, even if it’s for clicks and kicks. https://t.co/v6df2aoU3T pic.twitter.com/B3Qzzra0uW — Kellyanne Conway (@KellyannePolls) October 24, 2019\n\nHere’s the position of the Examiner:\n\nIn comments to reporters at the White House on Friday, Conway said of Yilek: “She’s not like the rest of you, she’s not here at the White House doing the beat, out here asking questions,” said Conway.\n\nAD\n\nExactly!\n\nIn her status as a breaking news reporter, Yilek owed nothing to Conway. She didn’t have to worry about losing access or having her hard pass revoked or her questions ignored. Here’s a good example of why the White House press corps needs outsiders to supplement its work. Via Yilek and the Examiner, we now have a good idea of how Conway seeks to shape media coverage of the White House.\n\nAD\n\nAnd we also get to see how she recovers from it, too. With great savvy: “There wasn’t one thing I said in that call that I haven’t said publicly,” she told reporters on Friday. That’s perhaps a reference to her stated misgivings about speaking for her husband. In a memorable incident from April 2018, Conway tore into CNN’s Dana Bash for asking her what was up with her husband’s tweets attacking the president. “We’re now going to talk about other people’s — people’s spouses and significant others, just because they either work in the White House or at CNN?” ripped Conway. And in a feature by The Post’s Ben Terris, Conway indeed provided an earlier version of the power-provider line: “Nobody knows who I am because of my husband. People know of my husband because of me,” she said.\n\nAD\n\nOne unexplained wrinkle is how this “powerful woman” found time in her day to rail against someone whom she holds in such low regard. Yilek’s alleged offense, after all, was merely to note that Conway’s husband is one of Trump’s most vociferous critics, an awkward situation that would become yet more awkward if she were elevated to chief of staff. “I feel there’s a part of him that thinks I chose Donald Trump over him,” Kellyanne Conway told Terris. “Which is ridiculous. One is my work and one is my marriage.”\n\nWhereas Trump bullies people with bluster and froth, Conway does so with precision and calm. In her discussion with reporters Friday, she said, “I still didn’t get an answer from her, which was the essential question, which was: Why do you call yourself a breaking news reporter if you’re not writing breaking news and you’re not even being a reporter?” Like her boss, she can’t let go.\n\nAD\n\nAnd when asked about what the Examiner regards as a threat to investigate reporters’ personal lives, Conway goes all-in on Trumpian gaslighting and bravado: “I never threatened anyone. Don’t use those words … No, no, no … If I threaten somebody, you’ll know it. If I threaten someone, you’ll know it.”\n\nAD\n\nRead more:\n\nAD", "description": "Whereas Trump bullies people with bluster and froth, Conway does so with precision and calm.", "authors": ["Erik Wemple", "Media Critic With A Focus On The Ups", "Downs", "Downs Of The Cable-News Industry.", "Media Critic"], "top_image": "https://www.washingtonpost.com/resizer/TjLGRa6BgS2TsefL9rt_ceBszOI=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HKPMN4XXJEI6TMWSD434TWBNXM.jpg", "published_at": "2019-10-25"}