{"pub": "reuters", "url": "https://in.reuters.com/article/uk-syria-security-turkey-usa/trump-threatens-to-obliterate-turkeys-economy-over-syria-idINKBN1WL0IU", "downloaded_at": "2019-10-07 20:23:46.845975+00:00", "title": "Trump threatens to 'obliterate' Turkish economy over Syria incursion plan", "language": "en", "text": "WASHINGTON/ISTANBUL (Reuters) - President Donald Trump on Monday launched a harsh attack on NATO ally Turkey, threatening to destroy its economy if Ankara takes a planned military strike in Syria too far even though the U.S. leader himself has opened the door for a Turkish incursion.\n\nTrump said he would “totally destroy and obliterate” Turkey’s economy if it took action in Syria that he considered “off-limits” following his decision on Sunday to pull out U.S. forces from northeastern Syria.\n\nThe U.S. withdrawal will leave Kurdish-led forces in Syria that have long allied with Washington vulnerable to a planned incursion by the Turkish military which brands them terrorists.\n\nTrump’s stern words seemed to be aimed at placating critics who accused him of abandoning the Syrian Kurds by pulling out U.S. forces. Leaders from both parties and both houses of Congress joined in the criticism, including Senate Majority Leader Mitch McConnell, Trump’s fellow Republican.\n\n“As I have stated strongly before, and just to reiterate, if Turkey does anything that I, in my great and unmatched wisdom, consider to be off limits, I will totally destroy and obliterate the Economy of Turkey (I’ve done before!)” Trump tweeted.\n\nTurkey’s lira slid more than 2% to its lowest level in more than a month against the dollar on Monday over concerns about the planned incursion into northern Syria and Trump’s warning.\n\nInvestors have been closely watching tense ties between Ankara and Washington in recent months, with the countries at odds over a range of issues, including Syria and Turkey’s purchase of Russian missile defence systems.\n\nTurkey has repeatedly threatened to carry out an incursion against U.S.-backed Kurdish fighters in northeastern Syria who have links to Kurdish guerrillas operating next door in Turkey.\n\nThe United States began pulling troops back from the northeast Syrian border on Monday, effectively giving Turkey a green light to move into the area.\n\n‘STAB IN THE BACK’\n\nIt is a major policy shift that was denounced as a “stab in the back” by Kurdish-led forces who have been Washington’s most capable partners in fighting Islamic State in Syria, also known by its acronym ISIS.\n\nU.S. House of Representatives Speaker Nancy Pelosi, a Democrat, called on Trump to “reverse this dangerous decision” to withdraw, saying in a statement that it threatened regional security and sent a message to Iran and Russia, as well as U.S. allies, that the United States is no longer a trusted partner.\n\nFILE PHOTO: An American soldier walks near a Turkish military vehicle during a joint U.S.-Turkey patrol, near Tel Abyad, Syria September 8, 2019. REUTERS/Rodi Said/File Photo\n\nMcConnell, the Republican Senate leader, said in a statement: “A precipitous withdrawal of U.S. forces from Syria would only benefit Russia, Iran, and the Assad regime. And it would increase the risk that ISIS and other terrorist groups regroup.”\n\nLindsey Graham, a Republican senator who is generally a vocal Trump supporter, on Fox News Channel criticized the Syria pullout decision as “impulsive.”\n\nFrance warned that the U.S. decision to withdraw from northeastern Syria could open the door to a revival of Islamic State, which has suffered significant battlefield losses to a U.S.-led coalition in the area.\n\n“We are going to be extremely careful that this announced disengagement from the United States and a possible offensive by Turkey does not create a dangerous manoeuvre that diverts from the goal we all pursue - the fight against Islamic State - and which is dangerous for the local population,” France’s armed forces minister, Florence Parly, told reporters.\n\nThe United States expects Turkey to take responsibility for captive Islamic State fighters in northeastern Syria if Ankara’s planned incursion seizes areas where the detained militants are held, a senior State Department official said.\n\nThe captives are held in SDF facilities south of a safe zone initially proposed by Turkey.\n\nAside from Trump’s threat, the State Department official and the Pentagon both said the United States did not endorse Turkey’s planned offensive.\n\nSlideshow (2 Images)\n\n“We made it clear (to the Turks) that we do not support this operation,” the official told reporters. “We think this operation is a very bad idea.”\n\nU.S. relations with Turkey under Trump have been rocky.\n\nLast year, he imposed tariffs on Turkish steel and aluminium products over Ankara’s detention of a U.S. pastor whose case was supported by members of his Christian conservative base.\n\nFor graphic on where Kurds live, click on tmsnrt.rs/2OqcPVd", "description": "President Donald Trump on Monday launched a harsh attack on NATO ally Turkey, threatening to destroy its economy if Ankara takes a planned military strike in Syria too far even though the U.S. leader himself has opened the door for a Turkish incursion.", "authors": ["Humeyra Pamuk", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191007&t=2&i=1438160178&w=1200&r=LYNXMPEF960E9", "published_at": "2019-10-07"}