{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/23/kade-kurita-missing-west-point-cadet-found-dead-on", "downloaded_at": "2019-10-23 16:01:12.520777+00:00", "title": "Kade Kurita, missing West Point cadet, found dead on campus", "language": "en", "text": "A West Point cadet who went missing for four days was found dead Tuesday, school officials said.\n\nThe training academy said that Kade Kurita, a cadet from Gardena, California, was found dead on school grounds after he was reported missing when he didn’t show up for a Saturday training exercise.\n\n“We are grieving this loss and our thoughts and prayers go out to Cadet Kurita’s family and friends,” Lt. Gen. Darryl Williams, 60th superintendent of the U.S. Military Academy, said on Facebook, according to WNYW.\n\nNo cause of death was mentioned.\n\nThe search for Cadet Kurita covered 6,000 acres with students, school officials, and local, state, federal and military authorities attempting to find the 20-year-old student.\n\nDuring the search, West Point officials said Sunday that an M4 rifle had also disappeared, but they didn’t believe Cadet Kurita had ammunition. They said there was no indication he was a danger to the public but were afraid he might hurt himself.\n\nEarlier Tuesday, West Point said it was focusing the search on school grounds as his cellphone and bank account had shown no activity since he went missing.\n\n“I would like to thank the N.Y. State Police and the 23rd MP Company along with partners,” Gen. Williams said. “They exhibited exceptional professionalism as demonstrated by their tremendous efforts in searching for Cadet Kurita.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Kade Kurita, a West Point cadet who went missing for four days, was found dead Tuesday, school officials said.", "authors": ["The Washington Times Http", "Bailey Vogt"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/06/06/west_point_crash_97995_c0-90-2200-1373_s1200x700.jpg?febf0b4ecc6082c18cf9e079d9cd62b05a32b04b", "published_at": "2019-10-23"}