{"pub": "yahoo", "url": "https://news.yahoo.com/victims-mother-hopes-militants-face-191710483.html", "downloaded_at": "2019-10-11 00:19:02.126448+00:00", "title": "Slain reporter's mother hopes militants will face US charges", "language": "en", "text": "FILE - In this March 30, 2019, file photo, Alexanda Amon Kotey, left, and El Shafee Elsheikh, who were allegedly among four British jihadis who made up a brutal Islamic State cell dubbed \"The Beatles,\" speak during an interview with The Associated Press at a security center in Kobani, Syria, Friday, March 30, 2018. The men said that their home country's revoking of their citizenship denies them a fair trial. \"The Beatles\" terror cell is believed to have captured, tortured and killed hostages including American, British and Japanese journalists and aid workers. (AP Photo/Hussein Malla, File)\n\nWASHINGTON (AP) — An American woman whose son was killed by the Islamic State said Thursday that she is hopeful the transfer to U.S. custody of two British militants brings them a step closer to criminal charges.\n\nDiane Foley told The Associated Press that she would like to see the men prosecuted in the United States for their involvement with the Islamic State cell that killed Western hostages, including her son, James, a journalist who was beheaded in Syria in August 2014.\n\n\"We need some semblance of justice for the horrific execution and torture of the Americans,\" Foley said.\n\nEl Shafee Elsheikh and Alexanda Amon Kotey were transferred to U.S. custody as Turkey invaded Syria to attack Kurds who have battling the Islamic State alongside American forces. Foley said she was troubled by President Donald Trump's decision to pull American troops from their positions near the border alongside their Kurdish allies, a move she said she considers an \"abandonment.\"\n\nBut, she said, \"the hopeful part is if we follow through and bring both Kotey and Elsheikh to our country and have them brought to trial, a fair and open trial, and push for as much information as we can get from them.\"\n\n\"I think they have answers to questions they don't necessarily want to volunteer,\" she said.\n\nThe U.S. Justice Department has not announced any charges against the men, and it was not clear when or if they might ever be brought to America for prosecution, though Foley said Attorney General William Barr had privately told her that he wanted to see them face justice.\n\nMultiple militants captured overseas over the last decade have been brought to the U.S. to face charges, though that trend has slowed considerably under the Trump administration, whose first attorney general, Jeff Sessions, once called Guantanamo Bay a \"perfectly acceptable\" place to detain new terrorist suspects.\n\nThe matter has been mired in diplomatic wrangling over the last year, with Britain's Home Office temporarily suspending cooperation with U.S. authorities on the handover of the men until a judge could review a decision that would allow the pair to be tried in the United States. There's also been debate over Britain providing information that might be used against the two in any future prosecution in the United States.\n\nThe two were among a cell dubbed \"the Beatles\" by some of their victims because of their British accents. The group was known for beheadings and barbaric treatment of hostages in Syria — including American, British and Japanese journalists and aid workers and a group of Syrian soldiers — boasting of the butchery in videos released to the world.\n\nThe militant responsible for Foley's death, Mohammed Emwazi, also known as \"Jihadi John,\" was later killed in a U.S. airstrike. Elsheikh and Kotey were captured in eastern Syria last year by the Kurdish-led, U.S.-backed Syrian Democratic Forces amid the collapse of IS.\n\nSpeaking to The Associated Press at a Kurdish security center in March 2018, Elsheikh and Kotey repeatedly refused to address allegations they were part of the cell. They were also unapologetic, denouncing the U.S. and Britain as \"hypocrites\" who will not give them a fair trial.\n\nFoley said she and relatives of Kayla Mueller, another American hostage who died at the hands of the Islamic State, met earlier this year with Barr to discuss \"the Beatles.\"\n\n\"He was very concerned about this issue and concerned that they be held accountable for their horrible crimes,\" Foley said.\n\nBarr approached Trump in recent weeks and said the government needed to make extracting \"the Beatles\" from the Syrian detention center a priority for the U.S. military, an administration official told AP. The president then put a plan in place to ensure the extraction, the official said.\n\nBarr wants to bring the two men back to the U.S. to face prosecution, said the official, who spoke on condition of anonymity to discuss private conversations.\n\n___\n\nAssociated Press writer Michael Balsamo in Washington contributed to this report.\n\n___\n\nFollow Eric Tucker on Twitter at http://www.twitter.com/etuckerAP", "description": "An American woman whose son was killed by the Islamic State said Thursday that she is hopeful the transfer to U.S. custody of two British militants brings them a step closer to criminal charges.  Diane Foley told The Associated Press that she would like to see the men prosecuted in the United States", "authors": ["Eric Tucker"], "top_image": "https://s.yimg.com/uu/api/res/1.2/AkFJ.vZXPh.NM7Lf55cDjw--~B/aD0zODQwO3c9NTU4NztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/677936c168403d1d6970f8d906302b59", "published_at": "2019-10-10"}