{"pub": "breitbart", "url": "https://breitbart.com/news/vatican-to-shine-light-on-amazons-indigenous-communities", "downloaded_at": "2019-10-05 06:08:40.196386+00:00", "title": "Vatican to shine light on Amazon’s indigenous communities", "language": "en", "text": "Vatican City (AFP) – Pope Francis will gather Catholic bishops at the Vatican Sunday to champion the isolated and poverty-struck indigenous communities of the Amazon, whose way of life is under threat.\n\nThe eyes of the world have recently been on the world’s largest rainforest, which is vital for the planet but is suffering from its worst outbreak of fires in years, due in part to an acceleration in deforestation.\n\nThe working document for the “synod”, which mainly brings together bishops from nine Pan-Amazonian countries, denounces in scathing terms social injustices and crimes, including murders, as well as suggesting a Church action plan.\n\nThe run-up to the three-week synod, or assembly, saw some 260 events held in the Amazon region involving 80,000 people, in a bid to give the local populations a voice in the document.\n\nIt comes just as Brazilian President Jair Bolsonaro, a climate-change sceptic, told to the United Nations that the world’s media were lying about the Amazon, and attacked indigenous leaders as tools of foreign governments.\n\n“Listen to the cry of ‘Mother Earth’, assaulted and seriously wounded by the economic model of predatory and ecocidal development… which kills and plunders, destroys and devastates, expels and discards,” the 80-page document says.\n\nIn his 2015 encyclical on ecology and climate change “Laudato Si”, Francis denounced the destruction of the Amazonian rainforest in the name of “enormous international economic interests”.\n\nLast year the world’s first Latin American pope visited Puerto Maldonado, a village in southeastern Peru surrounded by the Amazon jungle, to meet thousands of indigenous Peruvians, Brazilians and Bolivians.\n\nThere he slammed in particular “illegal mining” of gold and the “slave labour or sexual abuse” it created.\n\nThat trip was the first step towards this synod, which opens Sunday with a mass in St. Peter’s Square.\n\n– Married men as priests? –\n\nFrancis champions what he terms “integral ecology” — or the inextricable link between humans and nature.\n\n“To the aboriginal communities we owe their thousands of years of care and cultivation of the Amazon,” the working document reads.\n\nIt also reflects the pope’s desire to protect the world’s poor, vulnerable and downtrodden, and his criticism of a socio-economic model that discards them as “waste”.\n\nHis hopes of bringing the Catholic faith to far-flung populations will see the bishops gathered in Rome debate a highly controversial proposal — allowing married men to become priests.\n\n“We have a shortage of ordained priests to celebrate mass. Eighty percent of the communities in Brazil have a very poor sacramental life,” said Brazilian Cardinal Claudio Hummes, president of the Pan-Amazon Church Network (REPAM).\n\nThe issue deeply upsets some traditionalists, who argue that making an exception for the Amazon would open the door to the end of celibacy for priests, which is not a Church law and only dates back to the 11th century.\n\nThe German Catholic Church in particular, which has an influential progressive wing, has been hotly debating the subject.\n\nThe synod, which runs until October 27, will also reflect on making official roles for women, who already play a central part in the Amazonian Church.\n\n“If women are excluded, half of the Church is excluded,” said Sister Laura, an Italian missionary who has worked in the Pan-Amazon region for 10 years.\n\nOf the 184 prelates at the synod, 113 hail from the Amazonian region, including 57 from Brazil.\n\nOthers taking part include 17 representatives of Amazonian indigenous peoples and ethnic groups, and 35 women — who will not have the right to vote on the final document.", "description": "Vatican City (AFP) – Pope Francis will gather Catholic bishops at the Vatican Sunday to champion the isolated and poverty-struck indigenous", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/04/32222b_pope-francis-met-representatives-indigenous-communities-amazon-basin-640x335.jpg", "published_at": "2019-10-04"}