{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/22/afm-linked-enterovirus-children", "downloaded_at": "2019-10-23 08:37:14.004052+00:00", "title": "AFM breakthrough: Researchers find strong link between virus and paralyzing illness in children", "language": "en", "text": "Scientists say they have uncovered solid evidence that a virus is responsible for a mysterious condition similar to polio that paralyzes young children.\n\nCases of the rare condition, known as acute flaccid myelitis, or AFM, have been increasing in the U.S. every two years in the late summer or early fall since 2014. It often starts as a mild respiratory illness or fever consistent with a viral infection and then produces muscle weakness and paralysis.\n\nHealth professionals have suspected that enteroviruses, which usually appear in the gastrointestinal tract, might cause AFM, but pinpointing a specific culprit has proved difficult.\n\nA group of researchers recently tested cerebrospinal fluid of AFM patients and discovered that nearly 70% had antibodies of enteroviruses, according to a study published Monday in the journal Nature Medicine.\n\n“Having antibodies to a virus in the cerebrospinal fluid is supportive evidence that the virus caused an infection in the central nervous system,” said Dr. Michael Wilson, the study’s lead author and an associate professor of neurology at the University of California, San Francisco.\n\nThe researchers found antibodies to enteroviruses in the cerebrospinal fluid at high levels in 29 of 42 children with AFM, the study says.\n\n“This study does provide additional, strong evidence that certain enteroviruses are behind the spike in AFM cases. Building a consensus around the likely cause(s) will help researchers focus on the development of antiviral therapies and potentially, vaccines,” Dr. Wilson said.\n\nSince 2014, the Centers for Disease Control and Prevention have confirmed 590 cases of AFM in 48 states and the District of Columbia. Health officials have confirmed 22 cases in nine states this year.\n\nDoctors diagnosed AFM in the son of Riley Bove, one of the study’s researchers, in 2014, when he was 4 years old. Her son, Luca Waugh, had developed weakness in his neck that traveled down his shoulder and worsened over eight days.\n\nToday, at age 9, Luca still has residual weakness in his neck, shoulder and arm, and has to wear a left foot insert and a neck brace for support.\n\n“Many parents had a tough time getting their children diagnosed in a timely and accurate manner. Many were initially sent away from doctors’ offices and ERs, and given inadequate explanations for their child’s weakness. Many didn’t even undergo a neurological examination,” said Dr. Bove, a UCSF assistant professor of neurology. “For many years, it wasn’t clear which virus was the culprit, and this ‘mysterious’ aspect was very disconcerting.”\n\nWilliam Schaffner, medical director for the National Foundation for Infectious Diseases, who was not involved in the study, said it has been difficult to nail down the cause of AFM because the virus had largely disappeared by the time children developed paralytic symptoms and visited a hospital.\n\nIn many cases, proof of a virus was not recovered when doctors collected blood and stool samples from sick children, he said.\n\nDr. Schaffner said he expects a spike in AFM cases in 2020, as the second year since the previous uptick in the illness approaches. He said there seems to be an appearance of enterovirus-D68, which researchers suspect could be a cause of AFM, every couple of years. Researchers also have detected enterovirus-A71 in sick patients.\n\nHe called the study by Dr. Wilson and the research team a “large brick” in the evidence wall and said its findings provide strong affirmation and confirmation that enterovirus is indeed a major cause of the poliolike illness.\n\nIn 2014, the CDC recorded 120 cases of AFM in 34 states. Thirty-nine states reported 153 cases in 2016. Last year, 236 cases were confirmed in 41 states.\n\n“There is a real concern that the current AFM cases could become more prevalent, affecting thousands or more children,” Dr. Bove said. “Before poliovirus-induced AFM became prevalent, there were just small pockets of affected children.”\n\nMost people with AFM will experience a sudden onset of arm or leg weakness and loss of muscle tone and reflexes. Some might also have drooping of their face and eyelids, difficulty moving their eyes and swallowing, slurred speech and pain in their arms or legs.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Scientists say they have uncovered solid evidence that a virus is responsible for a mysterious condition similar to polio that paralyzes young children.", "authors": ["The Washington Times Http", "Shen", "Wu Tan"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/04/02/paralyzing_illness_62259_c0-0-5662-3302_s1200x700.jpg?498ab5895857bbc688bf651a3bd7bb209812c015", "published_at": "2019-10-22"}