{"pub": "yahoo", "title": "Saudi-led airstrikes on Yemen rebel-run prison kill over 100", "url": "https://news.yahoo.com/saudi-led-airstrikes-yemen-rebel-073036546.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:58:47.434063+00:00", "text": "An arm protrudes from the rubble of a Houthi detention center destroyed by Saudi-led airstrikes, that killed at least 60 people and wounding several dozen according to officials and the rebels' health ministry, in Dhamar province, southwestern Yemen, Sunday, Sept. 1, 2019. The officials said the airstrikes took place Sunday and targeted a college in the city of Dhamar, which the Houthi rebels use as a detention center. The Saudi-led coalition said it had hit a Houthi military facility used as storages for drones and missiles in Dhamar. (AP Photo/Hani Mohammed)\n\nSANAA, Yemen (AP) — Yemeni medics said on Monday they pulled dozens of bodies from the rubble of a Houthi rebel-run detention center that was hit a day earlier by Saudi-led coalition airstrikes, killing over 100 people and wounding dozens.\n\nThe attack was one of the deadliest in more than four years of war in Yemen that have claimed tens of thousands of lives, thrust millions to the brink of famine and spawned the world's worst humanitarian crisis.\n\nThe Saudi-led coalition, which has fought the Iran-backed Houthis since 2015, has faced international criticism for airstrikes that have hit schools, hospitals and wedding parties, killing thousands of civilians.\n\nBy late Monday, Yemen's Red Crescent said 88 bodies had been pulled from the ruins of the detention center in southwestern Dhamar province. Bashir al-Dawrani, a spokesman for Yemeni Red Crescent in Dhamar, told The Associated Press that 53 bodies were recovered Sunday and another 35 on Monday before search efforts halted for the night.\n\nThere were around 170 detainees at the facility when the airstrikes hit Sunday. The International Committee for the Red Cross said 40 wounded were being treated for injuries while the rest were presumed dead, and that it would likely take days to recover all the bodies. The complex of buildings was part of the local community college before the Houthis turned it into a detention center, one of dozens in areas under their control.\n\nSecurity officials said the detainees were captured forces loyal to Yemen's internationally recognized government as well as civilians who had been arrested for criticizing the Houthis in recent years. The officials spoke anonymously because they weren't authorized to talk to reporters.\n\nAbdul-Qader el-Murtaza, a Houthi leader, said Sunday that both the Red Cross and the Saudi-led coalition knew there were detainees being held at the site.\n\nThe Red Cross, which inspects detention centers as part of its global mission, said Sunday it had previously visited detainees there.\n\nCol. Turki al-Maliki, a spokesman for the Saudi-led coalition, said in a televised press conference Monday it had bombed a \"legitimate military target,\" and blamed the Houthis for using the former college as a detention center for forcibly disappeared Yemenis.\n\nHe said the Red Cross never told the coalition that there were detainees at the site, which he said was not on a U.N.-coordinated no-strike list. The U.N. provides the coalition with coordinates for locations such as hospitals, schools and official prisons to ensure they are not hit by airstrikes.\n\n\"The only known prion (in the area) is located 10 kilometers (6 miles) north of the targeted site,\" he said.\n\nFormer detainee Mansour al-Zelai told The Associated Press that the Houthis were repairing weapons in and close to the detention center. Several other detainees said the same via posts to social media, and said the center had come under a series of airstrikes before.\n\nRights groups have also previously documented that the Houthis use civilian detainees as human shields by placing them in detention centers next to army barracks, under constant threat of airstrikes.\n\nLocal residents said the center also held their imprisoned family members, arrested for being critical of the Houthis.\n\nThe Abductees' Mothers Union, an association of female relatives of detainees jailed by the Houthis, said \"dozens of abductees and people who were disappeared by force\" elsewhere in Yemen had been brought to the center from other areas under rebel control.\n\nThe mothers' group said some detainees had died from torture in the center and called for an international investigation into Sunday's airstrikes and abuses against the detainees.\n\nThe Yemen U.N. Office of the High Commissioner for Human Rights confirmed Sunday that 52 detainees were among the dead.\n\nBashir al-Dawrani, a spokesman for Yemen's Red Crescent in Dhamar, said the wounded had been taken to various hospitals in Dhamar and the capital, Sanaa. Dhamar is located around 100 kilometers (62 miles) south of Sanaa.\n\nYemeni officials said dozens of families, mainly from Houthi-controlled areas, had arrived in Dhamar to identify bodies or visit wounded relatives. The officials spoke on condition of anonymity because they were not authorized to brief the media.", "description": "Yemeni medics said on Monday they pulled dozens of bodies from the rubble of a Houthi rebel-run detention center that was hit a day earlier by Saudi-led coalition airstrikes, killing over 100 people and wounding dozens.  The attack was one of the deadliest in more than four years of war in Yemen that", "authors": ["Ahemd Al-Haj", "Samy Magdy"], "top_image": "https://s.yimg.com/uu/api/res/1.2/DGzzkqEFfeuOUzUiwPhhjw--~B/aD0zODQwO3c9NTc2MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/0485864be685cc3b561c67f78861b144"}