{"pub": "usatoday", "url": "https://usatoday.com/story/money/2019/10/12/intuitive-surgical-robotics-health-care-future/40293447", "downloaded_at": "2019-10-12 11:18:28.360752+00:00", "title": "Robot-assisted surgery? Automation might not be all bad when it comes to health care", "language": "en", "text": "CLOSE Need to back up personal files outside your computer? Here's a breakdown on the type of hard drives you can choose from to save your important files. Marc Saltzman, Special to USA TODAY\n\nVarious forms of automation are sweeping through the economy. The thought of machines doing human work and eliminating jobs is a big worry, but it's not all bad. Automation can be a force for good, and health care is an example.\n\nThat's where Intuitive Surgical, the pioneer in robotic surgery, comes in. Its da Vinci Surgical System gained U.S. Food and Drug Administration approval almost 20 years ago in 2000, and the company is a giant (valued at $60 billion) and leading the charge in the industry by helping surgeons provide better outcomes for patients, not replacing them.\n\nAfter a big run – especially in the past decade – Intuitive's stock has flatlined in the past year or so. Results are still going strong, though, and robotic surgery is likely to steadily gain adoption around the globe. In five years, there's a strong chance this health care technologist will be much bigger.\n\nSaving up: Can you get away with a small emergency fund if you have investments?\n\nSocial Security: These 3 dangerous myths could destroy your retirement\n\nRiding the wave of procedure growth and installed base\n\nIntuitive is a big operation these days, with 2019 total revenue on track to top $4 billion. Sales are broken down into three general categories. From largest to smallest, they are: instruments and accessories, systems and services.\n\nThrough the first half of 2019, the revenue grand total was up 18% year over year to $2.07 billion. Global growth in procedures is the story here. The more procedures surgeons perform, the more instruments and accessories are sold. The rise in the number of procedures means the da Vinci system gets to keep proving its merits, which leads to more system sales to hospitals and other places where general surgical procedures are performed. That, in turn, boosts services revenue on systems in operation.\n\nProcedures using da Vinci grew 17% year over year in the second quarter of 2019, and though Intuitive is big business, it still had just 5,270 surgery systems installed around the world at the end of Q2 – a small fraction of the total opportunity that exists. Thus, the runway that lies ahead of it is a long one. Early success never goes unnoticed, however. Intuitive's pioneering work led others to enter the fray, albeit to mixed results. But a much larger peer is gearing up to go head-to-head with the da Vinci machine.\n\nBig competition and why it's potentially fantastic news\n\nWhen the world's biggest medical device company decides it's time to make a splash in a promising new business, incumbents should take note. That's probably part of what has been going on with Intuitive's stock since Medtronic made it clear it will enter the robotic general surgery space. It isn't ready, nor have all the details been unveiled, but the Hugo – the first real direct competitor to Intuitive, and from a company more than twice the size at $144 billion – could give da Vinci some headaches.\n\nBut maybe it won't. Medtronic says its Hugo system will be more affordable than da Vinci. It claims that only about 2% of surgeries around the world are performed with the assistance of robotic surgery equipment. This market has barely been touched if that's true, leaving plenty of room for both Intuitive and Medtronic to innovate and grow their respective systems.\n\nSome competition could be good for da Vinci in the long haul. A bigger name devising a system vets the benefits of robotic assistance in the operating room, which could spur adoption of new systems, which then boosts recurring sales from instruments and services, the real moneymaker for Intuitive. Plus, as economics 101 teaches us, higher production generally (up to a certain limit) reduces costs. Hugo and da Vinci competing against each other, but ultimately purchasing similar technology, could lower manufacturing expenses and drive innovation. That, too, might foster more system sales.\n\nI think a similar trend will play out for fellow health care technologist Teladoc Health now that Amazon.comhas decided to enter the telehealth industry. One thing's for sure: Automation and other technology are emerging trends in the health care industry and could help stem the tide of rising care costs and provide better outcomes for patients. In five years, Intuitive Surgical has a good shot at playing an even bigger role in the industry overall as a result.\n\nJohn Mackey, CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool’s board of directors. Nicholas Rossolillo owns shares of Intuitive Surgical and Teladoc Health. The Motley Fool owns shares of and recommends Amazon, Intuitive Surgical and Teladoc Health. The Motley Fool has a disclosure policy.\n\nThe Motley Fool is a USA TODAY content partner offering financial news, analysis and commentary designed to help people take control of their financial lives. Its content is produced independently of USA TODAY.\n\nOffer from the Motley Fool: 10 stocks we like better than Intuitive Surgical\n\nWhen investing geniuses David and Tom Gardner have a stock tip, it can pay to listen. After all, the newsletter they have run for over a decade, \"Motley Fool Stock Advisor,\" has quadrupled the market.\n\nDavid and Tom revealed what they say are the 10 best stocks for investors to buy ... and Intuitive Surgical wasn't one of them! That's right – they say these 10 stocks are even better buys.\n\nSee the 10 stocks\n\nRead or Share this story: https://www.usatoday.com/story/money/2019/10/12/intuitive-surgical-robotics-health-care-future/40293447/", "description": "Robot-assisted surgery has momentum, and the pioneer of the industry is in great shape.", "authors": ["Nicholas Rossolillo", "The Motley Fool", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/5416ab97b3f069c682b5a27c3b79de8bd45b1977/c=0-56-1080-664/local/-/media/2019/10/10/USATODAY/usatsports/MotleyFool-TMOT-a891fbc2-da-vinci-robot.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-12"}