{"pub": "businessinsider", "url": "https://businessinsider.com/army-uses-netherlands-port-vlissingen-first-time-amid-russia-tensions-2019-10", "downloaded_at": "2019-10-16 21:20:29.424619+00:00", "title": "The US Army is worried about a potential showdown with Russia, and it's practicing a new way to get to a fight in Europe", "language": "en", "text": "A US Army armored brigade combat team arrived in Europe this week for an Operation Atlantic Resolve rotation.\n\nLike previous rotations, this ABCT is taking a new route to its operating areas, underscoring the Army's ongoing efforts to make sure it can get to a fight in Europe if one breaks out.\n\nVisit Business Insider's homepage for more stories.\n\nSoldiers from the 1st Cavalry Division's 2nd Armored Brigade Combat Team started arriving in Europe this week for a nine-month rotation as part of Operation Atlantic Resolve.\n\nThe 2nd ABCT's rotation is the fifth one by an armored brigade in support of Atlantic Resolve, which started in 2014 to show US commitment to Europe's defense after Russia's interference in Ukraine.\n\nBut the unit is the first \"in recent memory\" to use the port of Vlissingen in the Netherlands, where soldiers, Army civilians, and local workers started unloading the first of three shipments of equipment early on October 11.\n\nA 2nd ABCT soldier directs an M1A2 Abrams tank as vehicles are offloaded at the Port of Vlissingen, Netherlands, October 11, 2019. US Army/Sgt. Kyle Larsen\n\nArmored units deployed for Atlantic Resolve rotations are typically stationed in Germany or elsewhere in Eastern Europe and have in the past arrived at ports closer to their bases.\n\nBut the 2nd ABCT's arrival at Vlissingen — like that of the 1st Armored Brigade Combat Team at the nearby port of Antwerp last spring — is part of an Army effort to practice navigating Europe's bureaucratic and geographic terrain.\n\nNATO has been trying to operate out of more ports in Europe since around 2015, according to Ben Hodges, who led the US Army in Europe between 2014 and 2017.\n\nThere was a need to \"to reestablish capabilities in all these ports\" and \"to demonstrate that we could come [into Europe] at a variety of different places,\" Hodges, who is a retired lieutenant general, told Business Insider in 2018.\n\nVlissingen is the \"first main juncture point\" for the 2nd ABCT's current deployment, and its troops and gear will arrive at ports in Poland, Latvia, Belgium, Greece, and Romania throughout October, the Army said in a release.\n\nFirst Lt. Quanzel Caston, a unit movement officer with the 2nd ABCT, examines M1A2 Abrams tanks at the Port of Vlissingen, Netherlands, October 11, 2019. US Army/Sgt. Kyle Larsen\n\nIn total, the unit will deploy about 3,500 soldiers, 85 tanks, 120 Bradley fighting vehicles, 15 Paladin self-propelled howitzers, 500 tracked vehicles, 1,200 wheeled vehicles and pieces of equipment, and 300 trailers.\n\nMassing forces across the Atlantic Resolve area of operation \"displays the US Army's readiness, cross-border military mobility and speed of assembly,\" the release said.\n\nThe Army's 598th Transportation Brigade will move the 2nd ABCT's gear a variety of ways, including by \"low-barge, rail-head, line-haul and convoy operations.\"\n\nIt's the first time the Army has used a low-barge inland cargo ship to transport tracked armored vehicles across Europe for Atlantic Resolve.\n\n\"The significance of using the low-barge is it enhances readiness in the European region by introducing another method of movement to the Atlantic Resolve mission,\" said Cpl. Dustin Jobe, noncommissioned officer in charge of lifting provisions for the 647th Expeditionary Terminal Operations Element.\n\n'Better than it was'\n\nSgt. Julian Blodgett, a senior mechanic with the 2nd ABCT directs an M1A2 Abrams tank for loading on a low-barge cargo ship at the Port of Vlissingen, Netherlands, October 12, 2019. US Army/Sgt. Kyle Larsen\n\nThe US Army in Europe shrank after the Cold War. Since Russia's intervention in Ukraine in 2014, however, the Army has beefed up its presence with exercises along NATO's eastern flank and back-to-back rotations of armored units.\n\nBut returning to Europe in force has highlighted NATO's problems getting around the continent, where customs rules and regulations, insufficient infrastructure, and shortages of transports for heavy vehicles inhibit movement.\n\nThese obstacles would present issues for any peacetime mobilization effort and led NATO to conclude in a 2017 internal report that its ability to rapidly deploy around Europe had \"atrophied since the end of the Cold War.\"\n\nA local contractor attaches lift chains to an M1A2 Abrams tank for lowering into a low-barge ship at the Port of Vlissingen, Netherlands, October 12, 2019. US Army/Sgt. Kyle Larsen\n\nEuropean countries, working through the European Union and NATO, have sought to reduce or eliminate the hurdles.\n\nA new NATO command based in Germany now oversees the movement of alliance forces in Europe, and the EU has set up Permanent Structured Cooperation, or PESCO, to address security issues by \"integrating and strengthening defence cooperation within the EU framework.\"\n\nThe logistical skills of the US and its NATO allies will face their biggest test yet next year, during Defender 2020 in Europe — the US Army's largest exercise in Europe in 25 years. It will range across 10 countries and involve 37,000 troops from at least 18 countries.\n\nThe point of Defender 2020 \"is to practice the reinforcement of US forces in Europe for the purposes of collective defense of the alliance,\" Lt. Gen. Christopher Cavoli, the head of US Army Europe, said on Monday during a panel hosted by Defense One at the Association of the US Army's annual conference in Washington, DC.\n\nA 2nd ABCT M1A2 Abram tank is raised over the pier at Vlissingen to be lowered onto a low-barge ship for transportation to another location in Europe, October 12, 2019. US Army/Sgt. Kyle Larsen\n\n\"That's something that requires practice, because you're moving large forces great distances through complicated infrastructure and across a variety of different national lines,\" Cavoli added.\n\n\"We call this strategic readiness, the ability to strategically deploy and to project a force,\" he said. \"It's a significant concatenation of small things that have to go right in order to do this well.\"\n\nAsked about Europe's railways, which vary in rail size and have differing regulations, Cavoli said there were procedural and infrastructural issues that had to be addressed.\n\n\"Procedurally, we've made a great deal of progress across the alliance. Some countries, they've relaxed some of their restrictions, shortening the notification times required,\" Cavoli said. \"We, as an alliance, have gotten much more practice scheduling and moving and loading rail, and we're able to move very, very quickly across great distances.\"\n\nUS Army Reserve Cpl. Dustin Jobe watches a 2nd ABCT M1A2 Abram tank as it's raised over the pier to be lowered onto a low-barge ship for transport elsewhere in Europe, at Vlissingen, Netherlands October 12, 2019. US Army/Sgt. Kyle Larsen\n\nBut infrastructural problems remain, Cavoli said, pointing specifically to a difference in rail gauge between Poland and Lithuania. But Lithuania plans to buy dual-gauge rail cars for heavy equipment, Cavoli added.\n\n\"In addition to that, across the alliance, there've been some challenges with bridge classification, with the strength of rail heads ... can it take a tank driving off a train there?\" Cavoli said. \"The EU has really stepped in using prioritized ... shopping lists, prioritized by NATO, and it has been investing throughout the alliance in mobility infrastructure.\"\n\nCavoli said recent exercises had exposed challenges to mobility but had also prompted NATO members \"to get after those challenges. So I think we're in a fairly good place right now.\"\n\nAsked to assign the alliance a letter grade for mobility, Cavoli demurred, saying only that it's \"better than it was previously.\"", "description": "The US Army has been beefing up its presence in Europe, and with that has come a new emphasis on being able to actually move around the continent.", "authors": ["Christopher Woody"], "top_image": "https://image.businessinsider.com/5da632864af909377e119575?width=1200&format=jpeg", "published_at": "2019-10-16"}