{"pub": "investing.com", "url": "https://in.investing.com/news/economy/jokowi-bemused-by-leak-of-new-indonesian-cabinet-lineup-2007258", "downloaded_at": "2019-10-17 05:20:18.871245+00:00", "title": "Jokowi Bemused by ‘Leak’ of New Indonesian Cabinet Lineup", "language": "en", "text": "(Bloomberg) -- Indonesian President Joko Widodo said the composition of his new cabinet has been finalized and it will be announced after his swearing in on Sunday.\n\nJokowi, as the president is known, has received several “leaked” versions of the names of cabinet ministers for 2019-24 period and read them enthusiastically, he wrote in a Facebook (NASDAQ: ) post on Thursday.\n\n“Be patient. Indonesia has no shortage of great and capable people to head ministries and institutions and who are willing to serve the nation,” wrote the president, who will be sworn in for a second five-year term on Sunday. “What is clear is the composition of the cabinet for the next period of government has been completed.”\n\nSpeculation has mounted in recent days over who among the current cabinet will stay on and how many new faces will make it into Jokowi’s second-term lineup. The president has hinted that he’s open to some of the opposition parties, including Prabowo Subianto’s Gerindra, joining his government as he seeks to drum up support for his reform agenda.\n\nJokowi has said he’ll retain Sri Mulyani Indrawati, currently finance minister, in his cabinet, though he has declined to say what role she’ll take.\n\nJokowi said it was not hard to find people capable of filling his cabinet. “They are scattered in all fields of work and professions -- academia, bureaucracy, politicians, students, also the military and police.”\n\n(Updates with Jokowi’s comment on Indrawati in penultimate paragraph. An earlier version of this story corrected cabinet period)", "description": "Jokowi Bemused by ‘Leak’ of New Indonesian Cabinet Lineup", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/picd67c00a5028c09a92b9341324c8edd49.jpg", "published_at": "2019-10-17"}