{"pub": "atlantic", "url": "https://theatlantic.com/family/archive/2019/10/my-dying-wife-doesnt-want-her-stepfather-at-the-funeral/599515", "downloaded_at": "2019-10-07 12:05:12.508054+00:00", "title": "Dear Therapist: My Wife Is Dying and Doesn’t Want Estranged Family At Her Funeral", "language": "en", "text": "Louis\n\nSan Antonio, Texas\n\nDear Louis,\n\nI’m so sorry that your wife is ill, and I can only imagine that the prospect of her wishes not being met adds substantially to the stress you’re experiencing. But what seems to be getting lost in the understandable turmoil is that your wife is still here, which means she has agency over how she interacts with these people before the funeral happens.\n\nLet’s back up for a minute. What’s complicated about funerals is that not everyone agrees on whom they’re for. Are funerals for the dying, comforted by the knowledge that they’ll be surrounded by friends and family when laid to rest? Or are funerals for the living, a chance to grieve in the company of others and get one final goodbye? Whose comfort and peace of mind are funerals for?\n\nIt sounds like you and your wife believe that funerals are for the person who died, and therefore this person should determine before her death who will be there. And it sounds like your mother-in-law believes that funerals are for the living, and therefore that your wife’s ex-stepfather and siblings will want to be there. You probably won’t resolve this philosophical difference—though understanding it may help you to be more compassionate toward your mother-in-law’s view—but you do agree on one thing: These family members mean to attend the funeral.\n\nThe question is, why? You don’t say what these relationships are like now—whether your wife is on speaking terms with these relatives; whether they know about her prognosis; whether they’ve shown any concern for her; whether, perhaps, you’ve kept your wife’s condition from them so they haven’t had an opportunity to share their concern. Nor do you say how your wife was mistreated growing up, or whether her mom has acknowledged the extent of the mistreatment. Maybe your wife spoke with her mom about her wishes because she’s no longer in contact with these relatives, but by not communicating with them directly, she puts herself in a position of powerlessness, which may be how she felt growing up and again during the divorce.\n\nBanning people from a funeral is both a personal request and a strong public statement. At least in part, it’s a declaration to all who attend that these people hurt your wife deeply, and in this way, her pain would finally be acknowledged. This is what her wish is fundamentally about: a way for her to deal with the pain of the past.\n\nQuite clearly, though, there’s a catch. If banning them from the funeral represents a final, public acknowledgment of her pain, the one person who needs that acknowledgment most won’t be alive to see it. So maybe it’s worth considering what might bring your wife even more peace than their absence at her funeral: the opportunity to be heard by them now. In my therapy practice, I’ve seen people with terminal illnesses spend the time they have left in different ways. Some people don’t change much—they hold on to their anger and resentments and die with them firmly in place. Others step far outside their comfort zone and grow tremendously in ways that feel immensely gratifying.", "description": "I want to respect my wife’s wishes, but am not sure that her excluded family members will.", "authors": ["Lori Gottlieb"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/Funeral_final/facebook.jpg?1570414178", "published_at": "2019-10-07"}