{"pub": "fox", "url": "https://foxbusiness.com/technology/legionnaires-outbreak-kills-1-leaves-over-100-sick-in-nc-possibly-linked-to-hot-tubs", "downloaded_at": "2019-10-07 19:46:43.541075+00:00", "title": "Did hot tubs cause an outbreak of Legionnaires' that killed 1, made 120 ill", "language": "en", "text": "An outbreak of Legionnaires' disease, a type of pneumonia, has sickened more than 100 people and left one person dead in North Carolina, according to health officials.\n\nContinue Reading Below\n\nThe North Carolina Department of Health and Human Services are in the midst of trying to determine the source of the outbreak but have hinted that it may be tied to hot tubs that were on display during a state fair in Septemeber.\n\nAs of Oct. 3, 120 cases of Legionnaires’ disease had been reported in people who attended or worked at the NC Mountain State Fair which spanned just over a week ending on Sept. 15.\n\nAnd eight others who attended the fair have Pontiac fever, which is a milder form of the infection. One person has since died while there have been over 80 hospitalizations, according to officials.\n\nLegionnaires’ disease is a type of pneumonia caused by Legionella bacteria. People can become infected by breathing in mist or accidentally swallowing water that contains the bacteria, according to the Centers for Disease Control.\n\nThe bacteria live in freshwater environments and can become a health concern — as in this case — when it grows and spreads in human-made building water systems. The number of cases reported to CDC has been on the rise since 2000 with almost 7,500 cases being reported in 2017, according to government data.\n\nAccording to preliminary findings, those who were diagnosed were more likely to have walked by hot tubs at an event center during the latter half of the fair compared to those who did not get sick.\n\nHealth officials also reported early results from laboratory testing of environmental samples. So far, testing has identified Legionella bacteria in one water sample taken from the center where fairgoers were allegedly exposed.\n\n“Finding Legionella in one water sample is an important piece of the puzzle, but it does not tell us how so many people were exposed at this event,” said Dr. Zack Moore, state epidemiologist. “To get Legionnaires’ disease or Pontiac fever, you have to breathe in Legionella in aerosolized water, meaning small droplets like mists or vapors.”\n\nThe North Carolina Department of Agriculture and Consumer Services reiterated the disease is a rare infection even though the bacteria that cause it can be found in nature and in man-made water systems.\n\nRegardless, they are taking precautions regarding the use of the facility until they are confident that it does not pose any danger to the community.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\n\"The decision has been made to suspend the rental of the Davis Event Center at this time while we review and implement mitigation plans for the facility,” the North Carolina Department of Agriculture and Consumer Services said. So far the department added they have “taken steps to minimize water aerosolization opportunities on the grounds, as this is considered the means by which the Legionella bacteria is contracted. While we all feel confident that the facility is safe, we want to take these proactive mitigation measures to reassure the public and our employees.\"\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nHealth officials are actively monitoring for new cases of the disease and that since Oct. 3, there has been no indication of an ongoing exposure since the fair ended.", "description": "An outbreak of Legionnaires' disease, a type of pneumonia, has sickened nearly 130 people and left another dead in North Carolina, according to health officials.", "authors": ["Daniella Genovese"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/water-hot-tub.jpg?ve=1&tl=1", "published_at": "2019-10-07"}