{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/celebs-you-forgot-been-arrested-20748615", "downloaded_at": "2019-10-29 23:58:56.812999+00:00", "title": "Nine surprising celebrity arrests - including Reese Witherspoon and Hugh Grant", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nOver the weekend, Supernatural and Gilmore Girls star Jared Padalecki, 37, was arrested for allegedly assaulting two people outside a bar in Austin, Texas.\n\nThe news about the dad-of-three shocked his fans and proved a big talking point on Twitter , with many people discussing how celebrities are human and sometimes they make \"poor decisions\", just like the rest of us.\n\nIn light of this, here's a look at some other celebrities who have been arrested over the years - including Cher, Bruno Mars and Matthew McConaughey.\n\n(Image: Getty)\n\n(Image: Getty)\n\nReese Witherspoon\n\nThe Legally Blonde star had a run-in with the law back in 2013.\n\nThe Oscar-winner was arrested in Atlanta for disorderly conduct after her husband Jim Toth was pulled over by traffic police.\n\nAs Toth was breathalysed, Witherspoon is said to have refused to get back into the car and told police: \"Do you know my name. You’re about to find out who I am. You're about to be on national news.\"\n\nThe actress apologised for her behaviour in a statement after being released on bail.\n\nShe said: \"I clearly had one drink too many and I am deeply embarrassed about the things I said.\n\n\"It was definitely a scary situation and I was frightened for my husband, but that is no excuse.\"\n\n(Image: Getty Images)\n\nHugh Grant\n\nIn 1995, hot off the back of Four Weddings and a Funeral, everyone's favourite rom-com star was arrested in Los Angeles alongside sex worker Divine Brown (real name Estella Marie Thompson) for \"lewd conduct\".\n\nIt is believed the actor was caught receiving oral sex in his car, after meeting Divine on the notorious Sunset Strip.\n\nThe 59-year-old, who was dating actress Liz Hurley at the time, has described the incident as a moment of \"insanity\".\n\nIn a statement he said: \"Last night I did something completely insane.\n\n\"I have hurt people I love and embarrassed people I work with. For both things I am more sorry than I can ever possibly say.\"\n\n(Image: Netflix)\n\nWinona Ryder\n\nRyder, who is known for roles in Stranger Things and Heathers, was arrested in December 2001 for shoplifting.\n\nThe actress was accused of stealing over $5,000 worth of designer clothing and accessories from Saks, Fifth Avenue.\n\nThe 48-year-old was convicted of grand theft, shoplifting and vandalism but was acquitted on the charge of burglary.\n\nAs a result, she was sentenced to three years probation, 480 hours of community service, $3,700 worth of fines plus ordered to pay $6,355 back to the Saks store and attend counselling.\n\n(Image: GC)\n\nStephen Fry\n\nAs a teen, back before he became a household name, Fry was arrested and spent three months in prison for credit card fraud.\n\nHe is said to have taken a coat from a family friend when leaving a pub and later found the card in the pocket.\n\nHe went on a spending spree and was picked up by police in Swindon.\n\nUpon his release, he returned to Norfolk, where he had grown up, to complete his A Levels at City College Norwich.\n\n(Image: Splash News)\n\nNina Dobrev\n\nIn 2009, ahead of the premiere of her hit show, The Vampire Diaries, Dobrev was arrested alongside three of her co-stars, Candice King, Kayla Ewell and Sara Canning.\n\nThe four women got into a spot of trouble in Georgia after the sheriff's department caught them having a risky photoshoot on a bridge, distracting drivers.\n\nThey were charged with disorderly conduct and released after paying a fine.\n\n(Image: ETIENNE LAURENT/EPA-EFE/REX)\n\nKeanu Reeves\n\nThe star of The Matrix and The Lake House was pulled over and arrested in 1993 for drink driving.\n\nHe avoided a harsh sentence by admitting to driving under the influence and reckless driving and was later released.\n\nCher\n\nAt the age of just 13, Cher was arrested after she \"borrowed\" a friend's car to go to a drive-in movie theatre.\n\nThe teen had been asked to watch her friend's car while he went off to do something, but got tired of waiting.\n\nHer mother, Georgia Holt, shared a photo of Cher's mug shot on The Tonight Show in 2013 and said: \"[The police] called me at 3:30 in the morning and said we have your daughter down here at the station.\"\n\n(Image: WireImage)\n\nBruno Mars\n\nThe Just The Way You Are singer was arrested in Las Vegas in 2010 for possession of cocaine.\n\nSpeaking about the incident, he said: \"I was young, man! I was in f***ing Vegas. I wasn't thinking.\"\n\nThe felony charges against him were later dropped.\n\n(Image: AFP)\n\nMatthew McConaughey\n\nHollywood star Matthew McConaughey was arrested in 1999 on suspicion of possession of marijuana, possession of drug paraphernalia and resisting transportation.\n\nHis neighbours called the police to make a noise complaint at 3am and when officers arrived at his house in Texas, they found him naked as the day he was born and playing bongo drums.\n\nHe was ultimately charged only with resisting transportation.\n\nSpeaking in 2016, the Dallas Buyers Club actor, who was just 29 at the time of arrest, joked about the incident.\n\n\"What's wrong with beating on your drums in your birthday suit?\" he quipped. \"I have no regrets about the way I got there.\"", "description": "A number of famous faces have been arrested over the last few years", "authors": ["Courtney Pochin", "Image", "Getty", "Getty Images", "Netflix", "Gc", "Splash News", "Etienne Laurent Epa-Efe Rex", "Wireimage", "Afp"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article16480790.ece/ALTERNATES/s1200/2_Reese-Witherspoon.jpg", "published_at": "2019-10-29"}