{"pub": "news.com.au", "url": "https://adelaidenow.com.au/news/south-australia/cat-shot-with-pellet-gun-in-flagstaff-hill-prompts-warning-to-pet-owners/news-story/cf3db4adf339cab1b3b4da03e294312b", "downloaded_at": "2019-10-29 05:59:43.337700+00:00", "title": "Cat shot with pellet gun in Flagstaff Hill", "language": "en", "text": "A devastated family has been forced to put down their pet cat after he was shot multiple times in the face with an air rifle.\n\nDistraught owner Tania Jones is urging the community to keep a close eye on their pets after her beloved six-year-old cat Black Beard – known affectionately as BB – had to be euthanised after someone repeatedly shot him with an air rifle at Flagstaff Hill last week.\n\n“He had holes in his body – in his face, his ears and his nose,” Ms Jones said.\n\n“I just can’t believe someone would do that to our beautiful boy.”\n\nmedia_camera BB was repeatedly shot with a pellet gun.\n\nBB had been missing for a week when he managed to return home with injuries to his face on last Monday.\n\nMs Jones initially believed he had been in a fight with another cat and rushed him to the vet.\n\nHowever, once in surgery, the vet found several pellets lodged in his head – including in his eye – and pellet marks on his body.\n\nShe said the family had no choice but to put him down.\n\n“We are all devastated,” she said. “My son named him BB because he had a little black beard.\n\n“The other animals are looking around for him – he was the most beautiful cat – he would come in and lick the dog’s ears and he never (hunted) and brought in any animals.”\n\nShe said she now wanted to stop it from happening to anyone else’s pet.\n\n“I just want to make the community aware that someone has performed a really cruel act so it doesn’t happen to anyone else.”\n\nMs Jones said police were investigating the incident and had been out door-knocking her street and had collected the pellets from the vet.\n\n“The support from people has been amazing, it’s a hard thing to come forward about, but if anyone knows anything please come forward,” she said.\n\nA police spokeswoman said anyone with information should contact Crime Stoppers on 1800 333 000 or online at crimestopperssa.com.au", "description": "In a shocking incident, a Flagstaff Hill familys cat has been shot multiple times in the face with an air rifle — forcing them to put him down.", "authors": [], "top_image": "https://cdn.newsapi.com.au/image/v1/2877ec580dd903d3fbc6313f7ce70773", "published_at": "2019-10-28"}