{"pub": "realclearpolitics", "title": "Trump took a page out of the WWE’s playbook", "url": "https://nypost.com/2019/08/25/trump-took-a-page-out-of-the-wwes-playbook", "language": "en", "published_at": "2019-08-25", "downloaded_at": "2019-09-03 01:01:09.651584+00:00", "text": "When you attend one of his rallies, as I did last week in New Hampshire, it is obvious that Donald Trump has modeled his presidential persona on WWE pro wrestling.\n\nThe banter, the jokes, the trash-talking, the catchphrases, the crowd manipulation, the belligerent patriotism, the villain-slamming: It’s all straight out of a preordained WWE storyline.\n\nTrump applies the patriot choke to “heels” like China, the Squad, Pocahontas, Sleepy Joe, Crooked Hillary and radical-left Dems.\n\nHe has dragged in the media, too, as villains. Penned in the center of the rally arena behind metal barriers, he assigns us a character as the crowd boos: “Fake News,” the heel, or sometimes “The Enemy of the People!”\n\nHis extravagant blond bouffant, tanned skin and uniform of suit and overlong tie can be fully appreciated in this context.\n\nIt is simultaneously alarming and amusing that the Leader of the Free World is performing like a fictional bad guy, but it needs to be understood, because much of what he says and tweets is only half-serious.\n\nThat’s not because he’s channeling “Hitler, Stalin and Mao,” as a CNN guest claimed on Sunday, but because this is how he communicates the great drama of his presidency — in wrestling allegory, as a spectacle of excess.\n\nLast week was a case in point, when Trump called himself “the Chosen One” in a sardonic aside during one of the comic “Chopper Talk” press conferences on the South Lawn of the White House.\n\nThe “Fake News Media” played its role to perfection, ginning up stories about the president’s “Messiah complex,” which allowed him to extend the storyline with weekend tweets from the G-7.\n\n“When I looked up to the sky and jokingly said, ‘I am the chosen one,’ at a press conference two days ago, referring to taking on Trade with China, little did I realize that the media would claim that I had a ‘Messiah complex,’” he tweeted.\n\nBy yesterday, this most villainous of heels had become “the Fake and Disgusting News” in Trump’s daily banter blasted out on the @realDonaldTrump Twitter handle.\n\nHis Twitter feed, with its outlandish, self-aggrandizing dramas, is an extension of the WWE theme.\n\nHis tweet about buying Greenland extended into a mock feud with the Danish prime minister.\n\nThe storyline served to distract attention from a plunging Dow, as did Trump’s tweet casting Fed Chairman Jerome Powell as a heel.\n\nFrom a political point of view, Trump’s WWE appropriation makes perfect sense, since the wrestling audience is huge — 800 million households worldwide every week, says WWE — and its demographic aligns with those of his voters: 60 percent are male, 60 percent are white, and more than 60 percent are not college graduates.\n\nEven his feud with The Mooch, former communications director Anthony Scaramucci, is a WWE storyline. The Mooch is a babyface-turned-heel who appears at Joe Biden events. Trump tweets that he is a “highly unstable nut job.”\n\nIs Trump a good guy or a bad guy?\n\n“He’s a heel to some. He’s a babyface to others,” says “Stone Cold” Steve Austin, once the greatest wrestler in WWE history, who now hosts a podcast drawing 2 million downloads and a USA show, “Straight Up Steve Austin.”\n\nTrump seems to have modeled himself on Austin, who was an anti-authoritarian, blue-collar, cussing heel who didn’t care how he was perceived and was so admired by audiences that he “turned face.”\n\nLike Austin, Trump’s persona is champion of the underdog, “the People’s Billionaire,” the “heel” who picks fights and always prevails.\n\n“The crowd know it’s fake but they believe, just like if you went to a movie.”\n\nThis is why Trump’s fans let him get away with extravagant untruths that drive his media critics mad.\n\nIt was audiences in Trump’s hometown who turned WWE villains into good guys, says Austin, at Madison Square Garden and the Nassau Coliseum.\n\n“They’re a great crowd but they’re tough, especially on babyfaces. Sometimes heels get more cheers,” Austin goes on.\n\n“In today’s age, people tend to be more entertained by the trash-talking of the heels rather than the good-guy characteristics of the wholesome babyface [who] always plays by the rules.”\n\nThis is where Trump learned his crowd skills, from decades sitting in the front row of Wrestlemania, studying the form of stars like Austin and a wrestler-turned-politician, Jesse “The Body” Ventura, who became governor of Minnesota.\n\nA friend of WWE owner Vince McMahon, Trump staged two of the first Wrestlemanias in Atlantic City in the late 1980s, was incorporated into storylines and inducted into the WWE Hall of Fame.\n\nAs if to underscore the debt his performance art owes to his old friend, Trump on Sunday tweeted, “Happy Birthday, Vince.”\n\nTrump’s original catchphrase was “You’re fired.” Today it’s “Make America great again,” which audiences at his rallies chant along with him.\n\nHis ability to excite the crowd is, in the tweet of “The Greatest Mayor,” babyface Rudy Giuliani, “a unique and potent political weapon.”\n\nLike the audience, the “Fake News Media,” especially the “Failing New York Times,” suspends disbelief and plays the role Trump assigns it because, in the end, it’s good for business.\n\nTrump’s WWE presidency is both a pantomime about justice and a morality play, as Roland Barthes wrote of wrestling in his 1957 essay.\n\nEven Trump’s name is a wrestling trope, since the dictionary definition is to defeat someone publicly.\n\nBut whether his is a “trumped up” presidency or the real deal, only the voters will decide.\n\nOne dope ruins bus ride for all\n\nThe normalization of marijuana is causing trouble for bus passengers who don’t want to get sick — or high — on their way home, according to reader Jim.\n\nHe was on an express bus going over the 59th Street Bridge one recent afternoon when “the bus started filling up with marijuana smoke.”\n\n“The female driver pulled the bus over on Northern Boulevard, called dispatch and explained the situation. She then got off the bus along with a few elderly women so as not to inhale the smoke.”\n\nJim and another passenger then asked the pot smoker “to please stop,” but the response was cursing.\n\nAfter more than half an hour of waiting around, the driver took the passengers to another location where they could change buses.\n\nIt took Jim an extra hour to get home.\n\nThis is what comes from pandering to potheads.\n\nBeware of ‘softer’ CEOs\n\nWhen America’s richest capitalists go woke, beware.\n\nJP Morgan boss Jamie Dimon, best known for helping spark a financial crisis and then profiting from it, has joined with almost 200 CEOs of big American companies to issue a letter promising a new, softer capitalism with an emphasis on social responsibility.\n\n“While each of our individual companies serves its own corporate purpose, we share a fundamental commitment to all of our stakeholders … We commit to deliver value to all of them, for the future success of our companies, our communities and our country.”\n\nReally, they should stick to making money. Social engineering attempts by unelected, unaccountable elites always end badly, not least by making their companies go broke.", "description": "When you attend one of his rallies, as I did last week in New Hampshire, it is obvious that Donald Trump has modeled his presidential persona on WWE pro-wrestling.", "authors": ["Miranda Devine", "August"], "top_image": "https://thenypost.files.wordpress.com/2019/08/donald-trump-13.jpg?quality=90&strip=all&w=1200"}