{"pub": "independent", "url": "https://independent.co.uk/travel/news-and-advice/klm-flight-train-amsterdam-shiphol-brussels-thalys-emissions-a9108446.html", "downloaded_at": "2019-09-17 11:25:46.787772+00:00", "title": "Dutch airline replaces Brussels flight with high-speed train to cut emissions", "language": "en", "text": "Dutch airline KLM is replacing one of its daily flights between Amsterdam Schiphol airport and Brussels with a high-speed train service.\n\nThe carrier will cut down from five flights a day to four from 29 March 2020, swapping one flight for seat capacity onboard a Thalys train.\n\nHowever, KLM passengers have been promised that the rail option will match the service they would receive travelling by plane.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIt’s part of the airline’s long-term plan to reduce the number of flights between Brussels and Amsterdam and to gradually replace short-haul hops with rail services – providing the train can match the speed, reliability and comfort of air travel.\n\n“Intermodal transport involving trains and planes remains a complex and challenging business,” said KLM president and chief executive Pieter Elbers.\n\nShape Created with Sketch. World's best train journeys Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. World's best train journeys 1/10 Belmond Andean Explorer Belmond Andean Explorer Belmond 2/10 Coast Starlight Coast Starlight Amtrak 3/10 TranzAlpine TranzAlpine TranzAlpine 4/10 Rovos Rail Rovos Rail Rovos Rail 5/10 Interregional Portugal Interregional Portugal Interregional Portugal 6/10 Glacier Express Glacier Express Glacier Express 7/10 East Lancashire Railway East Lancashire Railway East Lancashire Railway 8/10 Durango & Silverton Durango & Silverton Durango & Silverton 9/10 Caledonian Sleeper Caledonian Sleeper Peter Devlin 10/10 Belmond Eastern & Oriental The breezy observation car on the Belmond Eastern & Oriental Express Belmond 1/10 Belmond Andean Explorer Belmond Andean Explorer Belmond 2/10 Coast Starlight Coast Starlight Amtrak 3/10 TranzAlpine TranzAlpine TranzAlpine 4/10 Rovos Rail Rovos Rail Rovos Rail 5/10 Interregional Portugal Interregional Portugal Interregional Portugal 6/10 Glacier Express Glacier Express Glacier Express 7/10 East Lancashire Railway East Lancashire Railway East Lancashire Railway 8/10 Durango & Silverton Durango & Silverton Durango & Silverton 9/10 Caledonian Sleeper Caledonian Sleeper Peter Devlin 10/10 Belmond Eastern & Oriental The breezy observation car on the Belmond Eastern & Oriental Express Belmond\n\n“Speed is key, not only in terms of the train itself, but also the transfer process at the airport. We aim to make maximum progress in both areas.\n\n“Reducing our frequency from five to four flights a day is a good way of gaining more experience with Air&Rail services.”\n\nThe move is partly in response to slot restrictions at Amsterdam airport (limiting the number of flights KLM can operate), and partly down to KLM’s “Fly Responsibly” commitment.\n\nThis initiative aims to create a sustainable future for air transport, and incorporates “all of KLM’s current and future efforts to improve the sustainability of its activities”. These include inviting consumers to offset the carbon emissions from their flights, and inviting companies to compensate for business travel by investing in the airline’s Corporate BioFuel Programme.\n\nSurprisingly for an airline, KLM announced this summer that it wanted to encourage passengers to “make responsible decisions about flying”.\n\n“Flying – after all these years the feeling is still magical. For many of us it changed our world forever,” Elbers wrote in an open letter.\n\n“When we started 100 years ago, our major concern was your safety. Little did we know about the impact we would have on the environment. Today we know aviation comes with another big responsibility – to make sure our children have a planet to explore, as well.”\n\nElbers said KLM would share its “best practices and tools” around sustainability with its competitors, and is asking the aviation industry to share their knowledge in turn.\n\nThe campaign was supported by a video, which asked air travellers: “Do you always have to meet face to face?”, ”could you take the train instead?” and “could you contribute by compensating your CO2 emissions or packing light?”", "description": "Dutch airline KLM is replacing one of its daily flights between Amsterdam Schiphol airport and Brussels with a high-speed train service. The carrier will cut down from five flights a day to four from 29 March 2020, swapping one flight for seat capacity onboard a Thalys train.", "authors": ["Helen Coffey"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/17/11/thalys.jpg", "published_at": "2019-09-17"}