{"pub": "independent", "url": "https://independent.co.uk/independentminds/ivf-notting-hill-yummy-mummy-happy-valley-a9082161.html", "downloaded_at": "2019-09-04 23:48:14.336762+00:00", "published_at": "2019-09-04", "title": "‘Forget helicopter parenting. I’m a whirlwind – the yin to nanny Rosalee’s yang’", "language": "en", "text": "Absence really does make the heart grow fonder and this was the case when the kid’s nanny, Rosalee, returned from the Philippines. Not wanting to burst that bubble, I resisted the temptation to check my name in her phone contacts to see if, indeed, I am still a bura (witch in Tagilog).\n\nEven my friends, who had first said it was the universe removing her from my life for the better, now thought it was some kind of lesson for us both in appreciating each other – which perhaps it was. Lola was excited and stood by the window waiting for her to arrive. We all briefly hugged before her now-retired mum, who used to clean at my dad’s house, launched into “but she needs a pay rise”, which was long overdue.\n\nI noticed her mum was dripping in gold jewellery – how strange? Is it from Accessorise or real gold? I wonder. I was under the impression all the money Rosalee made went back to her family in the Philippines?\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nI get distracted as Rosalee gets out a present for Lola – a nylon Paw Patrol coat with attachable gloves – and realise the pay rise is a must, as I let her mum out, with a reassuring wink. “All in hand I say,” as she leaves. “I will give her a pay rise just as soon as I go back to work.”\n\nBeing a single parent with a toddler and a baby means that unless you have some help, daily life is like being trapped in a mental asylum. Luckily my dad helps me financially or else I would not be able to go back to work; childcare is just too expensive.\n\nMy mum died 19 years ago and my sister is not really around in that capacity. My two brothers are out of London – in Norfolk and Oxford. Alex’s mum is in Blackpool. My dad is like my third child.\n\nI am alone but at least I have a second pair of hands with Rosalee – even if she is moody at times. “It is a very hard job Char,” she used to say as I rushed out the door to work before I went on maternity leave with baby number two. I had been up all night breastfeeding Lola, walked the dog before breakfast, and scrubbed the remnants of her red nail polish off the fridge door.\n\nAnd when I was at work I would often think of Rosalee, probably back at home having a lie-down, while Lola watched videos of “Baby Shark” and “Wheels on the Bus” on her iPad. But what can I do? I need help and she is the one. I simply could not go through her leaving again – it had been beyond traumatic. Better the devil you know, I told myself regularly.\n\nHow many toddlers want to still the mind? I can’t even get Lola to sit still while she watches Peppa Pig\n\nI’m the opposite of a relaxed, yoga-loving yummy mummy – the women I see everywhere I look in Notting Hill, who have banker husbands, who enjoy quiet time with their little ones and attend baby massage classes. I realised the other day that I hadn’t sat down once and played with the baby since she was born – she is now one year old.\n\nI was taken aback when a yummy mummy sent me a WhatsApp message only the other day, inviting me to a meditation class in Kensington for children: of course there’s a class for mums and babies that includes guided meditation. Hello? How many toddlers want to still the mind? I can’t even get Lola to sit still while she watches Peppa Pig.\n\nThey lunch at the Electric on the Portobello Road, which is part of the Soho House chain, wearing £90 Bodyism gym leggings and they eat nothing but lean protein. I’m wearing baggy jumpers in 85-degree heat to hide my belly, which is bigger than the average yummy mummy tum was at full-term pregnancy.\n\nI’m hoping the weight will fall off me because I’m always so manic. The kids seem happy though. Maybe it’s because I’m not a helicopter parent – I’m more of a whirlwind. I am yin and to Rosalee’s yang: we complement each other, I start to think, because I do everything and she is, well, more “relaxed’’.\n\nI push the Babyzen Yoyo stroller for Liberty – a great device – which folds into hand luggage on a plane, while juggling the dog and a board on the back for Lola to stand on in a very skilled way. I dash along Westbourne Grove on my way to a singing class in Notting Hill that teaches kids to do sign language before they can talk. I pass shops like Gwenyth Paltrow’s Goop, which is a lifestyle brand – not a slime my kids play with. And I wonder, am I living in heaven or hell.\n\nSometimes I lie awake at night and wonder what Alex would make of it all if he was still alive? First, he would be shell-shocked that I had even one baby, let alone two. He would never have agreed to a second child in a million years. He would have loved kissing and cuddling them and throwing them all over the place while blowing them a raspberry. But sometimes at night, when the baby’s crying finally subsides, I can hear him say to me: “Thank god I’m not here.”", "description": "Absence really does make the heart grow fonder and this was the case when the kid’s nanny, Rosalee, returned from the Philippines. Not wanting to burst that bubble, I resisted the temptation to check my name in her phone contacts to see if, indeed, I am still a bura (witch in Tagilog).", "authors": ["Charlotte Cripps"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/04/16/nappy-valley-6.jpg"}