{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/the_americas/seven-story-apartment-building-in-upscale-brazil-neighborhood-is-latest-to-collapse-without-warning/2019/10/15/5b400a04-ef62-11e9-bb7e-d2026ee0c199_story.html", "downloaded_at": "2019-10-15 23:05:46.463710+00:00", "title": "High-rise apartment building in upscale Brazil neighborhood is latest to collapse without warning", "language": "en", "text": "Firefighters searched the rubble for survivors.\n\n“For now we are trying to hear sounds that indicate where people are,” Fortaleza fire spokesman Romario Fernandes told the Associated Press. “There are several layers of debris.”\n\nAD\n\nAD\n\nArchitecture student David Sampaio lived on the first floor of the building. He was in the hallway, heading to class, when the structure collapsed.\n\nTrapped under debris, he sent a photo to his family’s chat group to let them know he was still alive. He and 10 other survivors were rescued.\n\n“I’m very happy my son had a second chance at life,” Sampaio’s father told the local news site Globo.com. “But this collapse was preventable.”\n\nThe cause of the collapse was unclear. But building residents reportedly had shared concerns on social media about a construction project that had exposed rebar in foundation pillars.\n\n“They are breaking the whole concrete structure that surrounds the pillars,” one resident wrote in messages published by the Fortaleza newspaper Diario do Nordeste. “I’m getting very scared of that.”\n\nAD\n\nAD\n\nThe disaster revealed vulnerabilities in Brazil’s urban infrastructure, long bedeviled by structural hazards, lax oversight and occupation by squatters. Now as economic stagnation strangles the country and more structures fall into disrepair, such collapses have become a reoccurring problem.\n\nTwenty-three people were killed in April when a building in a poor part of Rio de Janeiro collapsed after being soaked by days of rain.\n\nSeven died in May 2018 when a Sao Paulo high rise occupied by squatters caught fire and crumbled.\n\nA few months later, in September, a fire raged through Rio’s 200-year-old national museum, destroying nearly the entire collection. A faulty air conditioner was blamed, but the building lacked fire doors, sprinklers or water hoses.\n\nAD\n\nSeventeen people were killed in 2012 when three adjacent office buildings in Rio collapsed, one after another.\n\nAD\n\nThe challenge of solving the country’s infrastructure problem is immense: Just to maintain and modernize existing structures, the consulting firm Inter B concluded this year, Brazil would have to double its 2019 investment in infrastructure to nearly $100 billion.\n\nBut since Brazil’s economy slowed to a standstill, public spending as a percentage of gross domestic product has shrunk to half what it once was.\n\n“It is essential that public funds be restored so infrastructure investment can be sustainably restarted,” Inter B President Cláudio Frischtak wrote. Even private investment requires public planning, he said.\n\nAD\n\nIn an effort to strengthen the country’s infrastructure, President Jair Bolsonaro launched a plan recently to double private investment in the sector by 2022.\n\nBrazil’s infrastructure woes have been aggravated by housing shortages in major cities. In Greater Sao Paulo, 1.2 million families live as squatters in abandoned buildings or makeshift houses or are homeless, according to the municipal housing secretary. Housing rights activists often take over dilapidated buildings to pressure the government to provide affordable housing. More than 150 buildings in the city have been seized by squatters.\n\nAD\n\nWith few affordable options, many families are forced to live in makeshift homes in slums outside the city. Under heavy rains or in mudslides, these houses are often the first to crumble.\n\nAD", "description": "At least one person is dead and 10 people are missing after the building in Fortaleza came down.", "authors": ["Terrence Mccoy", "Reporter Covering Social Issues", "Marina Lopes"], "top_image": "https://www.washingtonpost.com/resizer/tnymkHaJrzqzLtjNmR1641FfadA=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/QFQTLFHPMQI6TCPL5RLM2QKHGI.jpg", "published_at": "2019-10-15"}