{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7561945/British-tourist-horrified-bizarre-eight-legged-creature-South-Africa.html", "downloaded_at": "2019-10-11 13:18:15.508022+00:00", "title": "British tourist is horrified by bizarre eight-legged creature in South Africa", "language": "en", "text": "This is the skin-crawling moment a British tourist encounters a creature like no other – an eight-legged specimen that's not quite a spider and not quite a scorpion.\n\nPedro Goss, 18, was visiting Royal Natal National Park in South Africa when he spotted the mysterious creature moving at high speed.\n\n'I was on a five-hour walk around the park, on a dried mud path on a mountain about 2,500 feet above sea level, bordering the mountains on Lesotho,' he said.\n\n'I spotted it in the middle of the path moving very strangely, like nothing I've ever seen before.\n\nDespite its appearance the creepy-crawly is neither a scorpion nor a spider but a small type of predator known as a solifugae\n\nThe creature is commonly called a camel spider, wind spider, wind scorpion or a sun spider - but is in actual fact a different type of invertebrate\n\n'At first I thought it was a spider with scorpion-like looks, but after a closer look I had no idea and tried to research what it was.'\n\nAstri Leroy, chairman of South Africa's Spider Club, said Pedro had encountered a solifugae – a creature that's been called both a spider and a scorpion, but in fact is neither.\n\n'In English they are variously called camel spiders, wind spiders, wind scorpions and sun spiders, but they are neither spiders nor scorpions,' she said.\n\n'They are fierce little predators and quite aggressive with a high metabolic rate so they have to eat a lot and if they can overpower another small creature they will do so.\n\n'This means that their prey is not only insects and other invertebrates but also small vertebrates if they can catch them.\n\n'They have no venom but they are fast and strong and have a four-part scissor-like set of jaws lined with sharp little teeth and two beady eyes.'\n\nDespite their small appearance the bugs are incredibly fast and strong and have a four-part scissor-like set of jaws that can\n\nWhen threatened the bug tends to dig itself a hole and burrow itself into the earth\n\nIn Pedro's clip, the creature is scuttling around quickly and appears to be burrowing into the earth.\n\n'The movement of it was rapid and it was changing direction very quickly,' said Pedro, from London.\n\n'At the time of when I saw it, it was digging a hole with its head, burrowing and shovelling dirt with its back legs out of the hole.'\n\nMrs Leroy said this was typical behaviour when the solifugae feels threatened.\n\n'I don't think they see too well and those hairs are sensory organs which pick up airborne and other vibrations,' she said.\n\n'In addition they have a further set of sensory organs under their fourth pair of legs called racquet organs or malleoli.'\n\nThese 'feel' the substrate because it is important for them to know what kind of soil they are on.\n\n'If they are caught out in the open and feel threatened they will dig a hole in the ground at high speed and disappear.'\n\nA close-up shows the creature and its hairs which act as a sensory organ picking up vibrations\n\nA professional photograph of the creature (right) shows its many legs and large body in great detail. The image on the left shows the one that Pedro Goss came across in the South African wild\n\nFor Pedro, who was visiting family in Lesotho, it's an encounter he won't soon forget.\n\n'Being from London it was a great opportunity for me to see other forms of wildlife than the common English pigeon, a seagull nibbling a chip or a rat on the underground,' he said.", "description": "Pedro Goss, 18, was visiting Royal Natal National Park in South Africa when he spotted the mysterious creature moving at high speed across the ground at a strange angle.", "authors": ["Michael Havis For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/12/19579070-0-image-a-13_1570792861557.jpg", "published_at": "2019-10-11"}