{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/government-quietly-shelves-porn-block-20630906", "downloaded_at": "2019-10-16 21:09:39.300389+00:00", "title": "Government quietly shelves 'porn block' plans after years of delay", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThe Government has quietly shelved plans to introduce statutory age verification for online pornography.\n\nInstead of the so-called 'porn block', ministers will punt the development of a \"duty of care\" scheme out to a new arms-length regulator.\n\nThe plan has been beset by delays and criticism since it was first mooted by David Cameron in 2013.\n\nUnder the plans, commercial porn sites would have been forced to show they are verifying users are over 18.\n\nUsers would have been forced to submit ID details online, like a driver's licence or passport, or buy a voucher from a high street shop.\n\nBut campaigners said despite the promise of safeguards, it would be possible to connect a user with their browsing habits.\n\n(Image: Getty Images)\n\nEx-Culture Secretary Matt Hancock claimed the porn block would be \"fully in place\" by \"April 2018\".\n\nBut it was stalled amid criticism - and the revelation it could cost millions in legal battles against the government.\n\nNewspaper reports then suggested it would launch by April 2019, but these turned out not to be correct.\n\nA date of July 15 was eventually announced in mid-April.\n\nAnd in June, then-Culture Secretary Jeremy Wright said it would take another six months to iron out kinks in the policy.\n\n(Image: Getty)\n\nHe apologised and announced an investigation after officials made a \"mistake\" - by failing to notify the EU about part of the plan.\n\nIn a humiliating statement to MPs, Mr Wright branded the error an \"administrative oversight\".\n\nIn a statement released today, current Culture Secretary Nicky Morgan confirmed the project was being shelved.\n\n\"The government has concluded that this objective of coherence will be best achieved through our wider online harms proposals and, as a consequence, will not be commencing Part 3 of the Digital Economy Act 2017 concerning age verification for online pornography,\" she said.\n\n\"The Digital Economy Act objectives will therefore be delivered through our proposed online harms regulatory regime.\n\n\"This course of action will give the regulator discretion on the most effective means for companies to meet their duty of care.\"", "description": "The plan was first suggested by David Cameron in 2013 and it's been beset by delays and criticism", "authors": ["Mikey Smith", "Image", "Getty", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article5269995.ece/ALTERNATES/s1200/MAIN-Revenge-porn.jpg", "published_at": "2019-10-16"}