{"pub": "bbc", "url": "https://bbc.com/news/uk-england-suffolk-49950968", "downloaded_at": "2019-10-07 09:12:14.268412+00:00", "title": "Sausage dogs fill cafe as Suffolk mass walk rained off", "language": "en", "text": "Image caption Soggy sausage dogs sleeping at the seaside in Suffolk\n\nMore than 100 dachshunds and their owners braved torrential rain for a trip to the seaside.\n\nThey came from as far as Edinburgh for the sixth Southwold Sausage Walk in Suffolk, which was due to take place on Sunday.\n\nBut it had to be called off because of heavy rain, so a pier cafe offered shelter to people and pets.\n\nThe event was in aid of charities that support dogs with a spinal condition called intervertebral disc disease.\n\nImage caption Event organiser Stuart McBurney said: \"We've been overwhelmed. There's people from Edinburgh, London, Manchester and all over. It's got me pretty emotional\"\n\nImage caption It would have been the sixth walk and a record 600 dachshunds were expected to take part\n\nImage caption Jamie Taylor, pictured with daughter Corin, said: \"It's just unfortunate that it's rained but the atmosphere is great. This has got to be the most dachshunds in a café at one time\"\n\nImage caption Fiona Bensly (L) said: \"This event is great. It's a shame about the weather but we've still had lots of sausage fun\"\n\nImage caption Kes Vadika from Colchester said: \"We wanted just to meet up with more standard dachshunds as there are not many in the UK now, most people go for the miniature version\"\n\nImage caption A cafe on Southwold pier opened up specially to offer shelter to pets and people\n\nImage caption Torrential rain hit Suffolk and Norfolk on Sunday\n\nPhotographs by Martin Barber.\n\nYou may also be interested in:", "description": "More than 100 dachshunds and their owners brave torrential rain for a trip to the seaside.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/E8DC/production/_109121695_360962e0-35d6-418f-af25-22ed64518977.jpg", "published_at": "2019-10-06"}