{"pub": "vice", "url": "https://vice.com/en_us/article/j5yn9g/felicity-huffman-now-has-her-weekend-free-cause-shes-not-in-jail", "downloaded_at": "2019-10-25 21:56:54.545216+00:00", "title": "Felicity Huffman Now Has Her Weekend Free ('Cause She's Not in Jail)", "language": "en", "text": "Want the best of VICE News straight to your inbox? Sign up here.\n\nActress Felicity Huffman got out of federal prison Friday, just 11 days into a 14-day sentence for her role in the infamous college admissions bribery scandal that’s swept up dozens of wealthy and famous parents.\n\nThe “Desperate Housewives” star reported to the minimum-security prison in Dublin, California, on Oct. 15 after she pleaded guilty to charges of fraud and conspiracy related to paying to have her daughter’s incorrect SAT answers fixed. It’s standard for inmates to be released early if they’re set to be released on a weekend, a prison official told NBC News.\n\nU.S. District Judge Indira Talwani also ordered last month that Huffman pay a $30,000 fine and perform 250 hours of community service. Now that she’s out of prison, she’ll undergo a year of supervised release.\n\nHer crimes were made public earlier this year when an FBI sting operation called “Operation Varsity Blues” revealed that Huffman and 51 other people schemed to get undeserving kids into elite universities through bribery and cheating. Huffman was the first parent to receive a prison sentence, and has claimed her daughter never knew she’d paid the scheme’s ringleader, Rick Singer, $15,000 to correct her test.\n\nSo far, 19 of the 35 parents charged in the scandal — including Huffman — have pleaded guilty to charges largely centering around fraud or money laundering. Eleven of the parents who have refused the plea, including actress Lori Loughlin, were hit with new federal bribery charges this week.\n\nMany of the parents who have pleaded guilty have received fairly modest sentences of a few weeks to a few months. Most recently, Jane Buckingham, a Beverly Hills businesswoman who helped rig her son’s ACT score, was sentenced to three weeks in prison Wednesday, according to the Los Angeles Times. She paid Singer $35,000 to correct her son’s answers, and is among the 11 parents who have been sentenced so far. Singer, meanwhile, pleaded guilty to racketeering conspiracy, money laundering conspiracy, fraud charges, and obstruction of justice.\n\nCover: Felicity Huffman leaves federal court after her sentencing in a nationwide college admissions bribery scandal, Friday, Sept. 13, 2019, in Boston. (AP Photo/Elise Amendola)", "description": "The actor, the first parent in the Varsity Blues scandal to receive a prison sentence, was released early", "authors": [], "top_image": "https://video-images.vice.com/articles/5db322f5bd02cf008c539436/lede/1572020983130-AP_19256740124673.jpeg?crop=1xw:0.7515671641791045xh;center,center&resize=1200:*", "published_at": "2019-10-25"}