{"pub": "cnn", "url": "https://bleacherreport.com/articles/2860430-stephen-strasburg-adds-to-postseason-legend-as-nationals-force-game-7-vs-astros", "downloaded_at": "2019-10-30 06:03:00.916794+00:00", "title": "Stephen Strasburg Adds to Postseason Legend as Nationals Force Game 7 vs. Astros", "language": "en", "text": "Matt Slocum/Associated Press\n\nSo much happened in Game 6 of the 2019 World Series, but there's a fundamental reason the Washington Nationals put themselves a win away from their first championship.\n\nTheir ace, Stephen Strasburg, was simply the best player on the field Tuesday night.\n\nThe Houston Astros had just as many answers for Strasburg as they did in Game 2, which is to say \"none.\" He spearheaded a 7-2 Nationals win at Minute Maid Park with 8.1 innings of utter filth.\n\nIt's thus largely because of Strasburg that the Nationals shrugged off three straight losses at home in Games 3, 4 and 5 to even the series at three wins apiece. A decisive Game 7 looms Wednesday night.\n\nWith any luck, it'll be even half as dramatic and entertaining as Game 6.\n\nThe night started with the Nationals matching their total hits with runners in scoring position over three games in Washington on an RBI single by Anthony Rendon in the first inning. The Astros, however, answered with a two-run first.\n\nThe capper was Alex Bregman's solo home run, which came with a rather, ahem, batty celebration.\n\nBoth Strasburg and Astros ace Justin Verlander settled down after that, but the latter hit an all-too-familiar wall—he now owns a 5.68 ERA in seven career World Series starts—in the fifth inning. Adam Eaton knotted the score with a solo homer, and Juan Soto gave the Nationals the lead with a solo blast of his own.\n\nFor his own celebration, Soto staged something of an homage to the likely American League MVP standing at third base:\n\n\"I saw what Bregman did in the first inning...I was like, 'That looks pretty cool. I wanna do that,'\" the 21-year-old said on MLB Network after the game.\n\nWith that, there were twice as many lead changes just halfway through Game 6 (two) as there had been through the first five games (one). The way the game was going, yet another seemed almost inevitable.\n\nAnd yet another might indeed have come if the Nationals had let a hugely controversial call in the seventh get the better of them.\n\nWith nobody out and a runner on first base, Trea Turner hit a soft ground ball that Houston right-hander Brad Peacock picked up and threw past first baseman Yuli Gurriel into right field. But rather than the Nationals having runners on second and third with nobody out, Turner was called out for running out of the baseline.\n\nMatt Slocum/Associated Press\n\nThere was a lengthy delay while the umpiring crew talked it over with replay officials in New York, even though the ruling itself wasn't technically reviewable.\n\n\"The violation was when he [Turner] kept Gurriel from being able to catch the ball,\" Major League Baseball's chief baseball officer, Joe Torre, explained after the game, per Astros field reporter Julia Morales. \"It's a judgment call. The right call.\"\n\nThe Nationals dugout was understandably steamed, and manager Dave Martinez was later ejected after a heated argument during the seventh-inning stretch.\n\nYet in between those two events, Rendon came to the rescue with a two-run homer that quelled fears of the call on Turner ruining Game 6 and, by extension, the entire World Series:\n\nFor good measure, Rendon later added a two-run double in the ninth inning that ran his RBI count to five and effectively put the game out of reach.\n\nThe utter strangeness of this World Series is difficult to understate. The road team has now won all six games. And while the Nationals and Astros sure seem like a good match—the run differential is 28 to 27 in Houston's favor—Washington's 5-4 victory in Game 1 marks the only truly close contest of the series.\n\nIt will be decided one way or another in Game 7, but anyone who claims to know how that's going to go is full of every type of \"it.\"\n\nThe pitching matchup is between two veteran aces in Zack Greinke and Max Scherzer, but the former is struggling and the latter couldn't even dress himself because of neck spasms as recently as Sunday. Neither of these offenses, meanwhile, has enjoyed anything even resembling consistency of late.\n\nRegardless of how Game 7 pans out, however, the 2019 World Series may ultimately be remembered as the finest hour of one Stephen Strasburg.\n\nMike Ehrmann/Getty Images\n\nThough Strasburg seemed in for a rough night when he served up two runs in the first, he indicated to Fox Sports' Tom Verducci that he realized he was tipping his pitches and adjusted accordingly.\n\nAstros hitters could thereafter do nothing against the 31-year-old right-hander, who had his fastball humming in the mid-90s and all his pitches breaking this way and that at the bottom of the strike zone. His changeup was especially lethal, drawing five swings-and-misses out of only 17 total offerings.\n\nTuesday's outing marked the fifth start and sixth overall appearance for Strasburg in the 2019 postseason, and it would be an understatement to say he's made the most of them. Across 36.1 innings, he's racked up a 1.98 ERA with 47 strikeouts and four walks, only three of which were unintentional.\n\nThis, coupled with Strasburg's preexisting October track record, brings his career ERA to 1.46 over 55.1 postseason innings. Couple this, in turn, with 10 regular-season campaigns marked by a 3.17 ERA, a 4.5 strikeout-to-walk ratio and three All-Star berths, and all available evidence says he's made good on the hype that surrounded his selection at No. 1 all the way back in 2009.\n\nIt's all but a given that Strasburg will opt out of the four years and $100 million remaining on the $175 million deal he signed in 2017. A dependable and clutch ace like himself can certainly do better on the open market.\n\nThe only pity is that Strasburg won't have a hand in securing himself a ring in Wednesday's Game 7. But by doing everything in his power to at least get the Nationals to that point, he's bound to be remembered as a hero in Washington no matter what happens.\n\nStats courtesy of Baseball Reference, FanGraphs and Baseball Savant.", "description": "So much happened in Game 6 of the 2019 World Series, but there's a fundamental reason the  Washington Nationals  put themselves a win away from their first championship...", "authors": ["Zachary D. Rymer"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/835/674/hi-res-bfbec9aa23b727fb0f2f63bf62f5521a_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-10-30"}