{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-norway-oil/norway-says-33-oil-firms-seek-exploration-blocks-in-mature-areas-idUKKCN1VP0IL", "downloaded_at": "2019-09-04 08:06:35.655785+00:00", "published_at": "2019-09-04", "title": "Norway says 33 oil firms seek exploration blocks in mature areas", "language": "en", "text": "OSLO (Reuters) - Thirty-three oil companies submitted bids for exploration blocks offshore Norway in a so-called predefined areas (APA) licensing round, the Ministry of Oil and Energy said on Wednesday.\n\nThis year’s round comprised 48 blocks in the Arctic Barents Sea, 37 blocks in the Norwegian Sea and five in the North Sea.\n\nBidders included oil majors Shell (RDSa.L), ConocoPhillips (COP.N) and Total (TOTF.PA). Equinor (EQNR.OL), Aker BP (AKERBP.OL), Lundin Petroleum (LUPE.ST), DNO (DNO.OL) and Eni’s (ENI.MI) Vaar Energi were also on the list.\n\nA number of private-equity-backed firms bid, such as Crysoar, which this year acquired ConocoPhillips assets in the British North Sea, and Neptune Energy. So did Russia’s Lukoil (LKOH.MM) and RN Nordic, a wholly owned Rosneft (ROSN.MM) subsidiary.\n\n“This shows that there is high interest from the companies,” Oil Minister Kjell-Boerge Freiberg told a news conference.\n\n“Identifying more resources through exploration is vital for Norwegian employment, future value creation and our welfare state,” he added.\n\nAfter processing the applications, the ministry aims to award licenses in early 2020.\n\nAnnual APA rounds are aimed at expanding acreage around already explored areas, where new discoveries can be tied in to the existing pipelines and platforms.\n\nSeparate from the APA awards, Norway also conducts numbered licensing rounds, which include frontier parts of the Norwegian continental shelf, such as the remote eastern Barents Sea where any field development will be more expensive.\n\nThe Norwegian Petroleum Directorate estimates that two-thirds of Norway’s undiscovered oil and gas resources are in the Barents Sea, but exploration results have been disappointing in the last few years.\n\nThe APA applications give reason to believe oil firms will also continue to seek more acreage in frontier areas, Freiberg said.\n\n“I’m optimistic, because we see historically high interest in the Barents Sea from this round,” he added.\n\nThe government aims to announce the next numbered licensing round before Norway’s 2021 general election, but must first agree an updated plan on areas to exempt due to environmental concerns, particularly in the Barents.", "description": "Thirty-three oil companies submitted bids for exploration blocks offshore Norway in a so-called predefined areas (APA) licensing round, the Ministry of Oil and Energy said on Wednesday.", "authors": ["Nerijus Adomaitis", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png"}