{"pub": "washingtonpost", "url": "https://washingtonpost.com/business/2019/09/03/can-an-owner-homeowners-association-install-security-cameras", "downloaded_at": "2019-09-03 23:43:33.769892+00:00", "title": "Installing security cameras in a homeowners’ association to prevent break-ins", "language": "en", "published_at": "2019-09-03", "text": "\n\nSafety is a big issue, but so is privacy. Follow the governing documents before installing surveillance cameras. (Tolga Akmen/AFP/Getty Images)\n\nAfter recent break-ins, a homeowner who lives in a homeowners’ association wants to install surveillance cameras outside his home and in the association-owned common areas. What should he know before putting in cameras?\n\nSecurity is a big issue for homeowners’ associations. Everyone wants a safe and secure home. But a board also must balance the privacy concerns of owners. Here are some issues to keep in mind when deciding to install security cameras.\n\nOnly the association is authorized to install anything in the common areas. Although it is not unheard of, there are very few circumstances in which a homeowner would be granted permission to install anything within association-owned common areas.\n\n[Is it legal to require adult supervision of children at a condo swimming pool?]\n\nBefore an owner considers installing a security camera, he should consult the association’s bylaws and declaration. Almost every association has within its governing documents a section that requires owners to obtain approval of any improvement or change to the exterior of their property. The installation of a surveillance camera would be subject to this requirement. Failure to obtain written approval could result in fines and legal action against the homeowner to remove the camera.\n\nThe written approval by the association should include restrictions not to place the camera in a location that will encroach upon neighbors’ privacy. Approvals should also restrict the placement of motion-sensor or other exterior lights. A homeowner cannot install lights that are directed toward an exterior room or window of a neighboring house or unit.\n\nBesides restrictions on changes to the exterior, almost all associations have a provision within their governing documents that prohibits nuisances. Owners and occupants are prohibited from using their property in such a way that “will or might disturb the peace, quiet, safety, comfort, or serenity of the occupants of surrounding property.” They are not allowed to do anything that “tends to cause embarrassment, discomfort, annoyance, or nuisance to any person.” In deciding whether to approve a request for installation of a camera, the board or architectural review committee should determine whether the camera will violate the nuisance provisions.\n\nRather than personally installing cameras, an owner may ask the board to install them.\n\n[Who is responsible for installing and maintaining an electric car charging station at a condo building?]\n\nGenerally, it is not the duty of the association to install surveillance cameras in a common area. A duty could (but not definitively) exist if the association knows criminal activity or acts of harassment have or are likely to occur in common areas. If homeowners request that the association install surveillance cameras in response to an increase in car or home break-ins, the board should consult its attorney and insurance agent and carefully weigh the pros and cons of such installation.\n\nIf the board votes to install cameras, they should never be installed in such a way that violates a person’s “reasonable expectation of privacy.” This includes locations such as a pool and/or clubhouse bathroom/changing rooms or in a location where it is possible for the camera to record activity within an owner’s or occupant’s house or unit.\n\nBefore installing security cameras, the board should contact its attorney to inquire about whether there is any law requiring signs to be posted to inform homeowners, occupants and visitors that they are being monitored by cameras. Even if signs are not required by local or state law, posting them could add to the cameras’ deterrent effects.\n\nIf the association installs surveillance cameras in common areas, the board should adopt a written policy that should at minimum address the following:\n\n1. What happens when the footage is created? The policy should identify who will review the footage and when. The board must set expectations as to the level of security being provided by the cameras. The community should be aware that no one is continually monitoring the footage if that is the case.\n\n2. Notice of who can have access to the footage. The policy must state that footage will be turned over to law enforcement upon request and that it may be viewed by the association’s board or community manager or another party in the event of a subpoena or discovery request. Otherwise, association members do not have access to it. Video footage is a tool of the association and the community manger and not a service provided to the association members, and it is not a part of the regular business records maintained by the association to which all members are entitled to inspect and view.\n\n3. How long should recordings be kept before they’re destroyed? There’s no specific time required, but footage should be maintained for at least as long as the state’s statute of limitations for personal injury.\n\nScott Weiss is an attorney at Ortale Kelley Law Firm in Nashville and a fellow of the Community Associations Institute College of Community Association Lawyers. This column is not legal advice and should not be acted upon without obtaining legal counsel. Send questions to government@caionline.org.", "description": "Safety is a big issue, but so is privacy. Follow the governing documents before installing surveillance cameras.", "authors": ["Scott Weiss", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/au4Jk5x-jjD05q-Pd-yzbGyCIv8=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/4K2NKGGAHAI6TKFQP3MKBVO4LU.jpg"}