{"pub": "nymag", "url": "https://vulture.com/2019/09/the-masked-singer-season-2-review.html", "downloaded_at": "2019-09-26 21:01:05.943448+00:00", "title": "The Masked Singer Season 2 Review", "language": "en", "text": "Skeleton performs in The Masked Singer. Photo: Michael Becker/FOX\n\nThe Masked Singer, in which judges try to guess the identities of celebrities who sing and dance on a garishly lit stage while wearing ornate yet expressionless creature suits, is the kind of show that sounds like you’re making it up when you describe it to others. The more details you offer, the more you begin to wonder if you actually saw it yourself or just dreamed it.\n\nNow entering its second season on Fox’s broadcast network, the series is based on a hit South Korean program. Once you know that it’s an import, The Masked Singer makes more sense. It’s hard to imagine Americans coming up with a series where musical performers (some professionals, some talented amateurs) sing and dance their hearts out while clad in outfits that would look equally at home in an old Saturday-morning kids’ series, a mid-century Japanese kaiju flick, or a vaguely hellish theme park: a sparkly gold lion; an adorable unicorn; a hippo with the blocky shape of a 1980s video-game character; a white rabbit with a steampunk-gilded body suit and glowing red eyes. And if Americans were to come up with such a series on their own, the execution wouldn’t be as poker-faced as it is here.\n\nThe Masked Singer is marketed as an elimination-based competition show in the mold of American Idol and The Voice, and it is that. But it also inhabits a hyperspecific game-show niche that includes Identity, To Tell the Truth, What’s My Line?, and I’ve Got a Secret, while coating the guessing-game format with a layer of psychedelic expressionism. The contestants are described and addressed only by their alter egos, which tend to be a single noun; the announcer of the season-two premiere promises “Rottweiler versus Ladybug” and “Tree versus Ice Cream.” If you happened on the show at random, you’d feel compelled to watch at least a bit of it, if only to figure out why a bipedal deer in a gas mask was literally hoofing it while belting Imagine Dragons’ “Thunder.” That the deer was unmasked last season to reveal football legend turned sportscaster Terry Bradshaw was the icing on the cake; that one of the judges, Robin Thicke, correctly ID’d him by the way he shrugged his shoulders when he laughed was the icing on the icing on the cake.\n\nThe end product is as close to pure escapism as you’re going to see on American TV at the moment. Although the presence of Jenny McCarthy-Wahlberg, one of the best-known anti-vaccination advocates, on the judging panel might prove a dealbreaker for some; it’s hard to appreciate her playful detective work when you remember she’s doing her part to bring back measles. The chemistry between her, Thicke, and the other regular judges — actor-comedian Ken Jeong and singer-songwriter-dancer Nicole Scherzinger — is enthusiastic and funny, although the editors could do a better job of cutting out repetitious guesses (seemingly everyone could be an athlete, a Broadway star, or a magician) and snap judgments on training that tend to be proved wrong (all four judges regularly declare that a singer doesn’t have a professional voice, only to learn that they have recorded or performed professionally).\n\nThe most exciting contestants are the ones who treat their appearances as a surreal extension of therapy. Last season, Tori Spelling, a.k.a. the Unicorn, sang “Oops, I Did It Again,” seemingly a sideways reference to her days as a tabloid fixture, and during a “personal clues” segment, she hauled out the manual typewriter that once belonged to her father and employer, Beverly Hills 90210 producer Aaron Spelling. Margaret Cho, a.k.a. the Poodle, sang Cyndi Lauper’s “Time After Time,” and in backstory videos and question-and-answer segments with the judges, she alluded to her struggles to succeed as an Asian-American comic in a business dominated by white men and the impact of her political material on her career. When Cho removed her headpiece to face the panel, a stunned Jeong, who co-starred with her on the short-lived Dr. Ken, stood up and exclaimed, “This is a pioneer in Asian-American comedy! You are the reason I am a comedian. I love you so much, you have no idea.”\n\nDonnie Osmond, a.k.a. the Peacock, who became a milquetoast superstar in the 1970s while performing with his sister Marie and the rest of their musical siblings, has always had a streak of ruthless ambition and a vague undercurrent of darkness; it showed itself briefly a couple of decades ago when he reimagined himself as a stubbly pop star in the vein of solo George Michael. But when you saw him perform in character as a creature who suggested a purple humanoid bird version of the Las Vegas–era Elvis, he was almost disturbingly sexy, lending credence to the show’s oft-repeated insistence that putting on a mask can clarify a person’s essence and unleash once-buried aspects of their talent.\n\nStill, the most vivid confirmation of the first season came courtesy of Joey Fatone, who has spent more than a decade trying to escape his formative years as the baritone in the boy band ’N Sync. He committed so completely to the character of the aforementioned Rabbit that the judges found him disturbing at times, likening him to Donnie Darko. Fatone even gave the character a spasmodic twitch and continued to do it throughout interview and judging segments. If Fatone one day ends up winning an Oscar playing a psycho for Martin Scorsese, he should start his acceptance speech by thanking the people of South Korea.\n\n*A version of this article appears in the September 30, 2019, issue of New York Magazine. Subscribe Now!", "description": "Matt Zoller Seitz reviews season 2 of Fox’s reality singing competition ‘The Masked Singer.’ It’s pure escapism TV, but you might think you’re losing your mind.", "authors": ["Matt Zoller Seitz"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/26/26-masked-singer-review.w1200.h630.jpg", "published_at": "2019-09-26"}