{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7539745/Pregnant-Nadia-Essex-displays-bump-chic-striped-dress-reveals-new-brunette-locks.html", "downloaded_at": "2019-10-05 06:26:32.914111+00:00", "title": "Pregnant Nadia Essex displays her bump in chic striped dress and reveals her new brunette locks", "language": "en", "text": "She recently revealed she feels like 'a terrible mother' before even giving birth after being turned down for two potential homes 'because she is pregnant.'\n\nAnd Nadia Essex treated herself to a makeover in London on Friday as she went from blonde to brunette.\n\nThe former Celebs Go Dating star, 37, who is almost five months pregnant, displayed her baby bump in a red, pink, white and green candy striped dress.\n\nChange: Nadia Essex treated herself to a makeover in London on Friday as she went from blonde to brunette\n\nHair dye: The star showed off her new look as she made an exit from a hair salon\n\nThe blooming star paired this with a pair of white trainers and a chic pastel coat.\n\nHer newly dyed brunette locks were styled in soft waves, parted on the side, while her pretty features were enhanced with a radiant palette of make-up.\n\nThe star was seen giving what appeared to be her hair stylist a kiss on the cheek, before she made a stylish exit.\n\nThe sighting comes as Nadia, who has been staying with a friend and attempting to secure a property to rent for the second half of her pregnancy, yet told MailOnline on Thursday that she 'can't provide a home for my baby because of pure discrimination'.\n\nBye: The star was seen giving what appeared to be her hair stylist a kiss on the cheek, before she made a stylish exit\n\nGlow: The former Celebs Go Dating star, 37, who is almost five months pregnant, displayed her baby bump in a red, pink, white and green candy striped dress\n\nTransformed: The star looked delighted as she showed off her new look\n\nHome hunting: The sighting comes as Nadia, who has been been attempting to secure a property to rent for the second half of her pregnancy, yet told MailOnline on Thursday that she 'can't provide a home for my baby because of pure discrimination'\n\nThe dating expert has attempted to rent two London properties in recent days and has been turned down, she says, 'because she is pregnant'.\n\nThe first fell through when, while waiting to hear from her estate agent, she posted to social media about her mental health and that she has come off anti-depressants while carrying her child.\n\nShe was shortly afterwards refused a lease, after the agent informed her that the landlord had 'declined her offer', allegedly after seeing her candid Instagram post.\n\nNadia revealed to MailOnline: 'I think my second offer on a place has also been turned down because I called them to tell them I’m pregnant after the last drama and they called back 30 mins later and said their landlord had said no too\n\n'It really has knocked my confidence. I feel like a terrible mother already as I can’t provide a home for my baby because of pure discrimination!'\n\nA roof over her head: The dating expert has attempted to rent two London properties in recent days and has been turned down, she says, 'because she is pregnant'\n\nNadia has been staying with a pal - who changed her walk-in-wardrobe into a second bedroom for Nadia while she was living there - leaving the reality star fearful that she will have to continue living there after her baby is born.'\n\nNadia has had a trying year, after leaving her show, Celebs Go Dating, after co-dating guru Eden Blackman departed the series amid a flurry of accusations.\n\nNadia resigned from the show shortly after and took Eden and the production company to court, claiming harassment had taken place.\n\nDue to a technicality the case was dismissed.\n\nThe star is hopeful she will be able to arrange a new place to live as soon as possible, having had to move out of her previous home earlier this year.\n\nNadia revealed to MailOnline: 'I think my second offer on a place has also been turned down because I called them to tell them I’m pregnant after the last drama and they called back 30 mins later and said their landlord had said no too'\n\nCandid: The TV personality has embraced her pregnancy, posting candidly to Instagram about the experiences she is going through and sharing snaps of her changing body\n\nThe TV personality has embraced her pregnancy, posting candidly to Instagram about the experiences she is going through and sharing snaps of her changing body.\n\nOn Wednesday she uploaded a photo of her body - 18 weeks into her pregnancy.\n\nShe captioned the snap: 'My body is changing faster than ever before and right in front of my eyes. Posting this is like ripping off a plaster.\n\n'This is scary but before I get too in my own head, too anxious, too scared to accept and love my body and the changes fully I wanted to post it.\n\n'Get it out there. It’s done. This is me. My wonderful body is growing a human soul. It is amazing! [sic]'", "description": "Nadia Essex treated herself to a makeover in London on Friday as she went from blonde to brunette.", "authors": ["Eve Buckland", "Andrew Bullock For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/23/19318190-0-image-a-4_1570228759043.jpg", "published_at": "2019-10-04"}