{"pub": "metro", "url": "https://metro.co.uk/2019/10/29/who-are-the-panesar-brothers-in-eastenders-and-who-plays-them-11005246", "downloaded_at": "2019-10-30 00:01:50.381180+00:00", "title": "Who are the Panesar brothers in EastEnders and who plays them?", "language": "en", "text": "Meet Kheerat, Jags and Vinny Panesar (Picture: BBC)\n\nEastEnders is set to see new arrivals the Panesars make their mark on Albert Square tonight as the family moves in to Walford.\n\nThe family, of Punjabi Sikh heritage, have already made their presence known in the Square after a recent confrontation with Ben Mitchell (Max Bowden) – and they’re also set to feud with one of Walford’s big families following their arrival.\n\nSo just who are the brothers, exactly – and who are they played by?\n\nHere’s what you need to know about the newcomers…\n\nWho are the Panesar brothers in EastEnders?\n\nThe Panesars are brothers Kheerat, Jags and Vinny – described by show bosses as ‘charming by nature – but a force to be reckoned with.’\n\nKheerat and Jags have already confronted Ben Mitchell (Picture: BBC)\n\nEldest brother Kheerat is a successful businessman – while middle brother Jags, who idolises his brother, lives in his shadow – with nothing ever seeming to go right for him.\n\nAdvertisement\n\nAdvertisement\n\nMeanwhile youngest brother Vinny is seemingly sweet – but viewers will discover that behind that innocent exterior he is no angel.\n\n‘What’s really interesting about them is that Kheerat’s 31, Jag’s the middle one – a bit younger at 27 – and then you’ve got Vinny, the ingenue, and yet he’s got the shortest fuse in history,’ executive producer Jon Sen told metro.co.uk.\n\n‘Obviously EastEnders is a show which prides itself on diversity and representing modern London and modern Britain and we were really keen on finding a way of telling stories from the Sikh community, so they arrive —these three siblings who are very different in and of themselves.’\n\nWho are the Panesar brothers played by?\n\nEldest brother Kheerat is played by Jaz Deol, who’s previously been seen in short-lived ITV drama The Halcyon, as well as Love, Lies and Records, Together and Lovesick, among others.\n\nHe also provides the voice of Henry Green in the video game Assassin’s Creed: Syndicate.\n\nJags is played by Amar Adatia, whose previous credits include Doctors, Dangerous Game, The Path To 9/11 and Brief Encounters.\n\nMeanwhile youngest sibling Vinny is played by Shiv Jalota, who has just one other credit to his name – 2016 short film Heavy Weight.\n\nEastEnders airs Mondays and Fridays on BBC One at 7.30pm and on Tuesdays and Thursdays at 8pm.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: EastEnders spoilers: Mel Owen exposes Sharon Mitchell and Keanu Taylor’s secret publicly?\n\nAdvertisement Advertisement", "description": "The Panesar clan are set to move into Albert Square tonight - but who are the EastEnders newcomers and who plays them?", "authors": ["Caroline Westbrook"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/08/The-Panesars-a9c0_1572359400.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-29"}