{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-usa-china-muslims-pompeo/pompeo-says-chinas-treatment-of-muslims-enormous-human-right-violation-pbs-interview-idUKKBN1WO2TH", "downloaded_at": "2019-10-10 00:44:58.613675+00:00", "title": "Pompeo says China's treatment of Muslims 'enormous human right violation' -PBS interview", "language": "en", "text": "WASHINGTON (Reuters) - U.S. Secretary of State Mike Pompeo said in a television interview on Wednesday that China’s treatment of Muslims, including the Uighurs, in western China was an “enormous human rights violation” and Washington will continue to raise the issue.\n\nFILE PHOTO: U.S. Secretary of State Mike Pompeo delivers statements at the State Department in Washington, U.S., October 9, 2019.REUTERS/Erin Scott\n\n“This is not only an enormous human rights violation, but we don’t think it’s in the best interests of the world or of China to engage in this kind of behaviour,” Pompeo told PBS.\n\nAsked whether Chinese President Xi Jinping was responsible, Pompeo said: “Xi Jinping leads the country just like the leader of a tank platoon, a small business or a country is responsible for the things that happen in your name.”\n\nPunishing Beijing for its treatment of Muslim minorities, the U.S. government this week widened its trade blacklist to include some of China’s top artificial intelligence startups and announced visa restrictions on Chinese government and Communist Party officials it believes responsible for the detention or abuse of Muslim minorities in Xinjiang province.\n\nChina has denied any mistreatment of Uighurs.\n\nThe Chinese Embassy in Washington, in a statement on Tuesday, denounced the visa action and said the U.S. accusations on human rights violations were “made-up pretexts” for interfering in China’s affairs.\n\nChina, which is engaged in a 15-month-old trade war with the United States, also views U.S. support for pro-democracy protests in Hong Kong as interfering with its sovereignty.\n\n“We’re going to continue to talk about these human rights violations,” Pompeo said. “As the president has said in another context in Hong Kong, we want to make sure that these issues are handled in a way that is humane.”\n\nAsked about a growing dispute over a tweet by a National Basketball Association (NBA) team official supporting the protests in Hong Kong, Pompeo said American businesses were waking up to the risks of operating in China.\n\n“The reputational cost to these companies I think will prove to be higher and higher as Beijing’s long arm reaches out to them and destroys their capacity for them, their employees - in the NBA’s case team members and general managers - to speak freely about their political opinions,” Pompeo said.", "description": "U.S. Secretary of State Mike Pompeo said in a television interview on Wednesday that China's treatment of Muslims, including the Uighurs, in western China was an \"enormous human rights violation\" and Washington will continue to raise the issue.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191009&t=2&i=1439011222&w=1200&r=LYNXMPEF9824B", "published_at": "2019-10-09"}