{"pub": "businessinsider", "url": "https://businessinsider.com/boris-johnson-jennifer-arcuri-police-watchdog-misconduct-public-office-investigation-2019-9", "downloaded_at": "2019-09-28 10:27:17.043719+00:00", "title": "Boris Johnson referred to police watchdog for alleged criminal offence of misconduct in public office", "language": "en", "text": "UK prime minister Boris Johnson faces a possible police investigation into the alleged offence of misconduct in public office.\n\nThe former Mayor of London was referred on Friday by the Greater London Authority to the Independent Office for Police conduct to decide whether a criminal investigation is warranted.\n\nThe prime minister could be investigated for the criminal offence of misconduct in public office which has a maximum sentence of life imprisonment.\n\nThe allegations related to Johnson allegedly granting public funds and access to foreign trade missions to his close friend Jennifer Arcuri.\n\nJohnson denies any impropriety and insits that \"everything was done entirely in the proper way.\"\n\nVisit Business Insider's homepage for more stories.\n\nPrime Minister Boris Johnson has been referred to the UK's official police watchdog to decide whether he should be investigated for the criminal offence of misconduct in public office, due to his relationship with the tech entrepreneur and former model Jennifer Arcuri.\n\nThe Greater London Authority has referred Johnson, who was London's de facto police commissioner during his time as Mayor of London, to the Independent Office for Police Conduct to assess whether he misused public funds by granting public funds and access to foreign trade missions, to his close friend.\n\nMisconduct in public office is a criminal offence with a maximum sentence of life imprisonment.\n\nA City Hall spokesperson said that \"Allegations have been brought to the attention of the Monitoring Officer that Boris Johnson maintained a friendship with Jennifer Arcuri and as a result of that friendship allowed Ms Arcuri to participate in trade missions and receive sponsorship monies in circumstances when she and her companies could not have expected otherwise to receive those benefits.\"\n\n\"The Monitoring Officer has a statutory duty to record any conduct matters that she becomes aware of relating to the Mayor is his capacity as equivalent to Police and Crime Commissioner for Greater London.\"\n\nA spokesperson for the Prime Minister insisted that Johnson had done nothing wrong.\n\n\"The prime minister, as mayor of London, did a huge amount of work when selling our capital city around the world, beating the drum for London and the UK,\" they said.\n\nWhat are the allegations against Boris Johnson?\n\nBoris Johnson and Jennifer Arcuri Innotech Summit / Youtube\n\nThe Sunday Times reported last week that Boris Johnson overruled officials to send a close friend on foreign trade missions, despite her business failing to meet eligibility criteria for the visits.\n\nJennifer Arcuri, who set up the tech firm Innotech, was also handed multiple grants by public bodies totalling more than £100,000, including an agency set up by Johnson.\n\nThe paper revealed that Johnson formed a \"close friendship\" with Arcuri, who worked on his campaign for Mayor and was seen repeatedly visiting her flat in Shoreditch, London.\n\nJohnson failed to declare the potential conflict of interest despite being obliged to by strict City Hall code of conduct rules.\n\nArcuri, who is a former model turned tech entrepreneur, was handed a £10,000 grant by an agency set up by Johnson and he attended multiple events organised by Arcuri.\n\nShe was sent on a series of trade missions, despite failing to meet the criteria for the trips, according to the paper. Correspondence seen by Business Insider confirms that his office intervened to overrule officials to ensure her attendance.\n\nArcuri was also awarded a £100,000 grant earlier this year by the Department for Digital, Culture, Media and Sport intended to help British businesses.\n\nThe grant is now the subject of a departmental investigation after the Times discovered that Arcuri's company's registered address is a rented house in Cheshire with Arcuri now living in California.\n\nA British phone number listed on the company's website was reportedly being redirected to California.\n\nIn a statement Arcuri said that: \"Any grants received by my companies and any trade mission I joined were purely in respect of my role as a legitimate businesswoman.\"\n\nArcuri has reportedly denied having a sexual relationship with Johnson, insisting that the prime minister only visited her flat for \"technology lessons.\"", "description": "London's City Hall has referred allegations about the Prime Minister's relationship with Jennifer Arcuri to the Independent Office for Police Conduct.", "authors": ["Adam Bienkov"], "top_image": "https://image.businessinsider.com/5d8ef8da2e22af2c807152c2?width=1200&format=jpeg", "published_at": "2019-09-28"}