{"pub": "yahoo", "url": "https://finance.yahoo.com/news/volkswagens-electric-highly-digitalized-connected-golf-made-world-094109253.html", "downloaded_at": "2019-10-26 09:32:40.178049+00:00", "title": "Volkswagen's electric, highly-digitalized and connected Golf has made its world premiere", "language": "en", "text": "On Thursday, Volkswagen finally took the wraps off the eighth-generation Golf after months of teasing.\n\nAfter counting down the launch of the Golf since earlier this year, Volkswagen unveiled the eighth generation this week, revealing its new streamlined styling and intelligent technologies.\n\nOut of all versions of the model launched over its 45-year existence, the company states that this is the most \"progressive\" iteration thanks to its electrified powertrain, digitalized interior, and smart software.\n\nOn the outside, the Golf adheres to design cues characteristic of the model including the shape, size, and skeletal architecture. The smaller components, like the grill and headlights, have been restyled to incorporate details with a horizontal span to give the model a bolder, more domineering stance despite its family-car aesthetic.\n\nThe most significant changes between this Golf and the seventh-generation model are found on the inside -- this iteration's cabin is almost unrecognizable due to its digital overhaul. Nearly all displays and controls have been digitalized and incorporate smart tech. In fact, the Golf doesn't just use all this intelligent technology to connect with its passengers but also to connect with the outside world.\n\nAs standard, the Golf responds to its environment with the Car2X system that uses swarm intelligence to receive \"signals from the traffic infrastructure and information from other vehicles up to 800 meters away\" which are delivered to the driver on the display.\n\nThe model is available in five different hybrid variants: three with a 48V lithium-ion battery and two plug-in hybrids with 13kWh lithium-ion batteries.\n\nThe new Volkswagen Golf will hit the market in December.\n\nhttps://www.youtube.com/watch?v=_Vwr-pVwx7I", "description": "On Thursday, Volkswagen finally took the wraps off the eighth-generation Golf after months of teasing.", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/9ecPulmpWbqr3dPFg8HArA--~B/aD0yMzA0O3c9NDA5NjtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_US/News/US-AFPRelax/db2019au01457_l.0e551091658.original.jpg", "published_at": "2019-10-25"}