{"pub": "reuters", "url": "https://in.reuters.com/article/uber-lawsuit-california/uber-is-sued-over-resistance-to-california-gig-employment-law-idINKCN1VX1VO", "downloaded_at": "2019-09-13 00:08:52.066340+00:00", "title": "Uber is sued over resistance to California 'gig' employment law", "language": "en", "text": "(Reuters) - A driver for Uber has sued the company for misclassifying its drivers as independent contractors, hours after California legislators voted to help thousands of those workers become, and enjoy the benefits of being, employees.\n\nFILE PHOTO: A screen displays the company logo for Uber Technologies Inc. on the day of it's IPO at the New York Stock Exchange (NYSE) in New York, U.S., May 10, 2019. REUTERS/Brendan McDermid\n\nThe proposed class action filed on Wednesday night by Uber driver Angela McRay appears to be the first since California’s senate passed landmark legislation that could affect workers in many industries, in addition to ride-sharing companies such as Uber Technologies Inc.\n\nGovernor Gavin Newsom supports the proposed law, which is known as Assembly Bill 5 and would take effect on Jan. 1, though it may undergo changes before it reaches his desk.\n\nMcRay, a Pittsburg, California, resident who said she has driven for Uber since November 2016, faulted the company for having “publicly stated that it intends to defy this statute,” by continuing to treat drivers as independent contractors.\n\n“This ongoing defiance of the law constitutes a willful violation of California law,” the complaint said. McRay is seeking damages for Uber drivers in California, and an injunction requiring compliance.\n\nUber Chief Legal Officer Tony West said on Wednesday that the law did not automatically reclassify drivers as employees, but made it harder to call them independent workers. “We can pass the harder test to the satisfaction of arbitrators and courts,” he said.\n\nAn Uber spokesman on Thursday said: “Under AB5, the classification test would now be different in California, but that doesn’t mean we won’t pass the test.”\n\nThe law has attracted national attention because of the size of California’s workforce, which includes several hundred thousand contract workers.\n\nLabor groups and other supporters of the law have said it would help long-suffering contractors by entitling them to coverage under minimum wage and overtime laws, and afford greater access to health insurance and expense reimbursements.\n\nThe law has been criticized by trade groups and “gig economy” companies dependent on contract workers because of the extra financial burdens.\n\nAssembly Bill 5 would codify a 2018 California Supreme Court decision that narrowed when employers could classify workers as independent contractors.\n\nUber, rival Lyft Inc and food delivery service DoorDash have pushed for separate legislation to boost driver pay and benefits while preserving their independent contractor status.\n\nIn March, Uber agreed to pay $20 million to settle a nearly six-year-old lawsuit by California and Massachusetts drivers over their classifications.\n\nThe case is McRay v Uber Technologies Inc, U.S. District Court, Northern District of California, No. 19-05723.", "description": "A driver for Uber has sued the company for misclassifying its drivers as independent contractors, hours after California legislators voted to help thousands of those workers become, and enjoy the benefits of being, employees.", "authors": ["Jonathan Stempel", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190912&t=2&i=1429100514&w=1200&r=LYNXNPEF8B1A6", "published_at": "2019-09-12"}