{"pub": "fox", "url": "https://foxnews.com/media/hillary-clinton-pompeo-barr-pence-tell-the-truth", "downloaded_at": "2019-10-03 07:28:35.242741+00:00", "published_at": "2019-10-03", "title": "Hillary Clinton offers advice to any Trump appointees implicated in impeachment probe: 'Tell the truth'", "language": "en", "text": "Hillary Clinton offered some advice Wednesday to high-ranking U.S. officials if they find themselves implicated in the Trump impeachment inquiry: \"Tell the truth.\"\n\nClinton was responding to MSNBC host Rachel Maddow, who suggested that figures such as Secretary of State Mike Pompeo, Attorney General William Barr and Vice President Mike Pence could find themselves swept up in any accusations that Democrats in Congress make against the president -- just as Nixon administration officials were linked to the Watergate scandal.\n\n\"Well, I think what many in the Nixon White House and administration concluded was the right thing to do was tell the truth. Tell the truth,\" Clinton said. \"And that would be advice that should be given to anybody caught up in this [Trump inquiry]. Because it's clear that the president has made a series of decisions to benefit himself and his political fortune at the expense of other matters in our government and the people you point to are certainly aware of that.\"\n\nHILLARY CLINTON CALLS TRUMP AN 'ILLEGITIMATE PRESIDENT' AND 'CORRUPT HUMAN TORNADO'\n\nClinton, who served as secretary of state from 2009 to 2013 under former President Barack Obama, expressed hope that Republican lawmakers will \"start thinking about putting country over party\" instead of letting Trump \"run roughshod over our Constitution, over the separation of powers, over checks and balances, over the rule of law,\" which she added, \"makes no sense to me.\"\n\n\"It is truly distressing to see people who are in our government, using it for ideological and personal and power-related partisan interest over above the best interest of our country,\" Clinton said.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nMany Republicans would argue that Clinton has her own affairs to worry about, primarily a federal investigation into her mishandling of classified information with regard to State Department emails.\n\nThe Washington Post, citing current and former U.S. officials, recently reported that as many as 130 current and former officials whose emails found their way into Clinton's inbox have been contacted by investigators in recent months.\n\nFox News' Nick Givas and Morgan Phillips contributed to this story.", "description": "Hillary Clinton offered some advice Wednesday to high-ranking U.S. officials if they find themselves implicated in the Trump impeachment inquiry: \"Tell the truth.\"", "authors": ["Joseph Wulfsohn", "Joseph A. Wulfsohn Is A Media Reporter For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Hillary-Pompeo-Barr-Pence.jpg"}