{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/carnival-corp-needs-a-new-direction-for-its-stock-price-15119830", "downloaded_at": "2019-10-09 00:28:06.175274+00:00", "title": "Carnival Corp. Needs a New Direction for Its Stock Price", "language": "en", "text": "A caller during the Lightning Round of Mad Money on Monday night asked Jim Cramer about Carnival Corp. (CCL) : \"This is having a hard time, but it yields 5% and I'd buy it,\" he said.\n\nIn this daily bar chart of CCL, below, we can see that prices have been cruising lower the past 12 months. CCL is trading below the declining 50-day moving average and the bearish 200-day moving average line. Rallies to the underside of the 200-day line were excellent selling opportunities.\n\nThe daily On-Balance-Volume (OBV) line has been in a downtrend from March and it tells us that sellers of CCL have been more aggressive.\n\nThe 12-day price momentum study in the lower panel is not revealing any bullish divergences as the pace of the decline has not slowed down one bit.\n\nIn this weekly bar chart of CCL, below, we can see that prices have been taking on water far more than the daily chart shows. Here decline started in late 2017 and the declining 40-week moving average line has helped define the downtrend.\n\nThe weekly OBV line shows weakness and so does the Moving Average Convergence Divergence (MACD) oscillator.\n\nIn this Point and Figure chart of CCL, below, we can see another way of showing the downtrend. A potential price target of $32 is being projected.\n\nBottom line strategy: The charts of CCL are headed down to the Caribbean to maybe the ABC Islands. Prices are extended and could bounce but our Point and Figure chart suggests a $32 price target is possible. Avoid the long side and wait for a last minute bargain to book that cruise.", "description": "Let's cruise the charts and indicators....CCL", "authors": ["Bruce Kamich", "Carnival Corp. Needs A New Direction For Its Stock Price", "Let'S Cruise The Charts", "Stocks Quotes In This Article", "James", "Rev Shark", "Jim Cramer", "Bob Lang", "Paul Price", "Doug Kass"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/carnival-cruise-boat-aerial-view.jpg", "published_at": "2019-10-08"}