{"pub": "independent", "title": "Sajid Javid must commit to doubling climate change spending, say top charities", "url": "https://independent.co.uk/news/uk/politics/sajid-javid-climate-change-spending-environment-zero-carbon-a9088941.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:02:59.848782+00:00", "text": "Public spending on the climate and nature must be more than doubled to at least £42bn a year, organisations backed by millions of Britons have urged.\n\nIn a letter to Sajid Javid, the chancellor, 18 groups ranging from the Women’s Institute to Greenpeace and the Woodland Trust called for this week’s spending review to kick-start an ambitious programme on the environment.\n\nBoosting spending will help provide warm, secure zero-carbon homes to millions of UK families, support electric vehicles and enhance public transport and protect and restore nature, they argue.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIt will also cement the UK as an “international climate champion” and should include a new five-year increased commitment to finance for poor countries to deal with global warming.\n\nThe organisations warn that without much more investment, the government will miss its target to cut greenhouse gases to zero overall by 2050 and leave the next generation with a “planet-sized debt”.\n\nShape Created with Sketch. Fighting climate change with trees: The facts Show all 6 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Fighting climate change with trees: The facts 1/6 The Independent / Getty 2/6 The Independent / Getty 3/6 The Independent / Getty 4/6 Getty 5/6 The Independent / Getty 6/6 The Independent / Getty 1/6 The Independent / Getty 2/6 The Independent / Getty 3/6 The Independent / Getty 4/6 Getty 5/6 The Independent / Getty 6/6 The Independent / Getty\n\nUpping public investment on spending for climate and nature from the current £17bn to at least £42bn a year – or around 5 per cent of public spending – will tackle social inequality, create jobs, improve people’s lives and protect British wildlife and nature, they said.\n\nIn the letter, the groups warn: “The climate and environmental crisis has no modern parallel and it demands your – and all of your government’s – urgent attention.”\n\nThey call for it to be treated as a long-term investment in the future, similar to education.\n\nMoney could come from phasing out support for fossil fuels and redirecting funding from high-carbon investment such as road building and Heathrow expansion.\n\nPolling by Opinium for the groups suggests more than half of people (52 per cent) think the government should be spending more on the environment, while only 8 per cent think it should be spending less.\n\nLynne Stubbings, chair of the National Federation of Women’s Institutes, said WI members felt passionately about the environment.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Inside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\n“In the midst of a climate emergency, people across the UK are sending a clear message to the government that we need further and faster action to protect our environment and safeguard our planet for the future.\n\n“We were pleased to see government commit to net-zero by 2050, but we now need to see this level of ambition reflected in government policies and action,” she said.\n\nJohn Sauven, executive director of Greenpeace UK, said: “No-one in government is still trying to argue that this is not an emergency, and yet no-one in government is acting as though it is.\n\n“We are still constantly pumping carbon into the atmosphere, and trying to ignore the problem will leave our children with a damaged world and a planet-sized debt.\n\n“There’s a strong economic case and an overwhelming moral imperative for the chancellor to act.”\n\nThe groups who have written to the Chancellor are: Amnesty International UK, CAFOD, Christian Aid, The Climate Coalition, CPRE, Friends of the Earth, Green Alliance, Greenpeace UK, UK Health Alliance on Climate Change, Islamic Relief, The National Federation of Women’s Institutes, National Union of Students, Oxfam GB, The Ramblers, The RSPB, Wildlife Trusts, the Woodland Trust and WWF-UK.\n\nPress Association", "description": "Public spending on the climate and nature must be more than doubled to at least £42bn a year, organisations backed by millions of Britons have urged. In a letter to Sajid Javid, the chancellor, 18 groups ranging from the Women’s Institute to Greenpeace and the Woodland Trust called for this week’s spending review to kick-start an ambitious programme on the environment.", "authors": ["Emily Beament"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/02/16/sajid-javid.jpg"}