{"pub": "reuters", "url": "https://in.reuters.com/article/thailand-panda/thai-zoo-solves-mystery-of-celebrity-pandas-death-idINKBN1WN1GQ", "downloaded_at": "2019-10-08 15:57:54.090188+00:00", "title": "Thai zoo solves mystery of celebrity panda's death", "language": "en", "text": "BANGKOK (Reuters) - When a celebrity giant panda died suddenly last month while on loan to Thailand’s Chiang Mai Zoo, millions of social media users in China demanded to know “What killed Chuang Chuang?”\n\nFILE PHOTO: Chuang Chuang, a giant panda on loan to Thailand from China, eats bamboo at the Chiang Mai Zoo in Chiang Mai province, north of Bangkok, September 3, 2005. REUTERS/Chaiwat Subprasom/File Photo\n\nOn Tuesday, they learned it was heart failure, according to a Chinese-assisted autopsy on the death of 19-year-old Chuang Chuang, who had been on loan from China since 2003 with his mate Lin Hui.\n\nThey were celebrities in Thailand, with media extensively covering their love life - including a “wedding” ceremony in 2005.\n\nChuang Chuang's relatively early demise sparked mourning among Thai fans and an outcry here on Chinese social media, where a hashtag seeming to blame Thailand for the death was viewed 250 million times.\n\nPandas generally live 14-20 years in the wild but can live up to 30 years in captivity.\n\nThe Chiang Mai Zoo said any speculation in China that Chuang Chuang - who was known for being obese - may have died due to careless feeding, neglect or even some kind of attack had proved unfounded.\n\n“The autopsy and analysis by Chinese-Thai experts showed that the nutrition health of Giant Panda Chuang Chuang was good, no external wounds were found and no foreign objects were found in his trachea,” the zoo said in a statement on Tuesday.\n\n“The cause of his death was heart failure, resulting in the lack of oxygen of internal organs and leading to his death.”\n\nThe zoo confirmed that Thailand would nonetheless pay unspecified compensation to Beijing as outlined in the original loan agreement.\n\nChuang Chuang’s mate, Lin Hui, would stay at the zoo for the time being, it said.\n\nChuang Chuang famously was put on a diet in 2007 when the zoo was trying to encourage he and Lin Hui to conceive.\n\nThe zoo even resorted to \"panda porn\" videos here of other pandas mating to encourage Chuang Chuang, but Lin Hui eventually conceived through artificial insemination.\n\nAfter Lin Hui gave birth in 2009, their offspring was featured on a 24-hour “Panda Channel” shown on a Thai TV network.\n\nBaby pandas are rarely born in captivity, and the offspring was eventually returned to China.\n\nSoon after Chuang Chuang’s death, footage of Lin Hui alone in her enclosure next to her mate’s empty pen was aired around the world and a Chinese official said there was talk she may be returned to China amid concerns she would be lonely.\n\nNo decision on her future has been made, but the zoo said “in the meantime, Thailand will continue (to) take best care of the remaining panda Lin Hui.”", "description": "When a celebrity giant panda died suddenly last month while on loan to Thailand's Chiang Mai Zoo, millions of social media users in China demanded to know \"What killed Chuang Chuang?\"", "authors": ["Panarat Thepgumpanat", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191008&t=2&i=1438484467&w=1200&r=LYNXMPEF970WK", "published_at": "2019-10-08"}