{"pub": "fox", "url": "https://foxnews.com/sports/jay-carney-obamas-former-spokesman-fat-shames-mlb-umpires-in-tweet", "downloaded_at": "2019-10-30 08:48:59.017477+00:00", "title": "Jay Carney, Obama’s former spokesman, fat-shames MLB umpires in ill-timed tweet following funeral", "language": "en", "text": "Jay Carney, the former Obama administration press secretary who is now a senior vice president at Amazon, raised eyebrows on Twitter on Tuesday with his reaction to what he saw as a blown call by umpires during Game 6 of the World Series.\n\n\"What a disgrace for the @Mlb,\" Carney tweeted. \"The entire ump crew is a bunch of overweight, diabetic, half-blind geriatrics. Bring in the machines.\"\n\nCarney was likely referring to the recent buzz about robot strike-callers that would, in theory, eliminate human error during games.\n\nBut his tweet about the umps was roundly criticized online.\n\n\"Diabetic\" isn't an insult and it has zero relevance to umpring so it's just hate speech,\" one Twitter user wrote.\n\nA day earlier, the World Series umpires he criticized reportedly took a charter flight for the funeral of their colleague Eric Cooper, a 24-year veteran for the league. Cooper died Oct. 20 at age 52 from a blood clot.\n\n\"This is a very bad tweet,\" one user commented.\n\n\"This tweet is worse than the call. Terrible,\" wrote another.\n\nAnother, who identified herself as a pediatric cardiologist, wrote, \"Omg Jay chill.\"\n\nCarney did not specify what call set him off. But Nationals manager Dave Martinez was ejected in the seventh inning for arguining a call of runner interference. Joe Torre, MLB’s chief of baseball, later defended the umpire’s call.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nAmazon's stock's recent performance may also be taking a toll on Carney. The stock was down another 14 points Tuesday, which followed last week’s 9 percent slide in after-hours trading.\n\nThe Nationals went on to win 7-2, forcing a Game 7.", "description": "Jay Carney, the former Obama administration press secretary who is now a senior vice president at Amazon, raised eyebrows on Twitter Tuesday with his reaction to what he saw as a blown call by umpires during Game 6 of the World Series.", "authors": ["Edmund Demarche", "Edmund Demarche Is A News Editor For Foxnews.Com. Follow Him On Twitter"], "top_image": "https://a57.foxnews.com/media2.foxnews.com/thumbnails/i/060114/640/360/060114_AfterBuzz_640.jpg", "published_at": "2019-10-30"}