{"pub": "yahoo", "url": "https://news.yahoo.com/rep-ilhan-omar-blasts-trump-031056415.html", "downloaded_at": "2019-09-19 23:15:39.409540+00:00", "title": "Rep. Ilhan Omar Blasts Trump Twitter Tout Of Post Claiming She Danced On 9/11 Anniversary", "language": "en", "text": "Click here to read the full article.\n\nRep. Ilhan Omar’s staff has contacted and asked then to remove President Donald Trump’s account and a tweet that cited a claim that Omar “partied” on the anniversary of the 9/11 attacks.\n\nEarlier Wednesday, Trump posted a tweet with a link to actor and comedian Terrence Williams account in which Williams claimed that Omar was dancing on 9/11. Trump said of Williams’s tweet, “IIhan Omar, a member of AOC Plus 3, will win us the Great State of Minnesota. The new face of the Democrat Party!”\n\nMore from Deadline\n\nThe video was later discovered to be of Omar dancing on Sept. 13 at a Congressional Black Caucus event.\n\nOmar said the President’s tweet continued “to spread lies that put my life at risk.” Omar claimed she has received threats. She appeared on CBS’s Face The Nation on Sunday and created a controversy by not addressing whether she understood the outrage generated by her “Some people did something remarks.” Instead, she focused on the post-9/11 backlash against Muslims.\n\nWilliams deleted his tweet later on Wednesday. Twitter has, so far, not commented on whether it will take action against President Trump, who left his tweet up.\n\nThis is from a CBC event we hosted this weekend to celebrate black women in Congress. The President of the United States is continuing to spread lies that put my life at risk. What is Twitter doing to combat this misinformation? https://t.co/XdkRVrU7mZ — Ilhan Omar (@IlhanMN) September 18, 2019\n\n\n\n\n\n\n\n\n\nIIhan Omar, a member of AOC Plus 3, will win us the Great State of Minnesota. The new face of the Democrat Party! https://t.co/aQFEygSa4D — Donald J. Trump (@realDonaldTrump) September 18, 2019\n\n\n\n\n\nSign up for Deadline's Newsletter. For the latest news, follow us on Facebook, Twitter, and Instagram.", "description": "Rep. Ilhan Omar's staff has contacted Twitter and asked then to remove President Donald Trump's account and a tweet that cited a claim that Omar \"partied\" on the anniversary of the 9/11 attacks. Earlier Wednesday, Trump posted a tweet with a link to actor and comedian Terrence Williams", "authors": ["Bruce Haring"], "top_image": "https://s.yimg.com/uu/api/res/1.2/VukJ8TGr3FGQlcefdgtlJQ--~B/aD0zNDE7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/deadline.com/5f3d1e24cb4f7f42ef1f3b039588cf33", "published_at": "2019-09-19"}