{"pub": "yahoo", "url": "https://yahoo.com/entertainment/shark-tank-star-kevin-o-learys-wife-charged-in-fatal-boat-crash-183610839.html", "downloaded_at": "2019-09-25 04:46:03.418410+00:00", "title": "'Shark Tank' star Kevin O'Leary's wife charged in fatal boat crash", "language": "en", "text": "Linda O'Leary, the wife of Shark Tank star Kevin O'Leary, has been charged with \"careless operation of a vessel\" for her involvement in a fatal boating accident last month. The driver of the other boat, Richard Ruh, was charged with \"failing to exhibit navigation light while underway,\" the Ontario Provincial Police (OPP) confirm to Yahoo Entertainment. The crash occurred on Aug. 24 on Lake Joseph in Ontario, killing two people and injuring three others.\n\nWhile Kevin O'Leary was not charged with any crime, his agent tells Yahoo Entertainment, \"Now that the authorities have concluded their thorough investigation, I have no further comment other than to say that our thoughts and prayers are with the friends and families of those who lost loved ones in this awful tragedy. Our hearts go out to them.\"\n\nNEW YORK, NY - SEPTEMBER 23: Kevin O'Leary and Linda O'Leary attend the Tribeca Talks Panel: 10 Years Of \"Shark Tank\" during the 2018 Tribeca TV Festival at Spring Studios on September 23, 2018 in New York City. (Photo by Dia Dipasupil/Getty Images) More\n\nA lawyer for Linda tells the Canadian Press the accident was \"a terrible tragedy,\" but added, \"we find it regrettable that the OPP has chosen to charged Mrs. O’Leary under the shipping regulations in circumstances where the person has always been a cautious, and certainly experienced boater, came in a collision with an unlit craft on a dark and moonless night on Lake Joseph.\"\n\nAccording to TMZ, the OPP obtained five videos from cameras in the area and concluded Linda was driving 17 mph around 11:30 p.m., which police say was not a safe speed. The website reports she plans to \"vigorously fight the charge.\" Meanwhile, the OPP claims Ruh was driving without navigation lights when the crash occurred, an issue that might be at the center of the case. Ruh purportedly insisted navigation lights were on.\n\nLinda O'Leary was administered a DUI test the night of the accident and passed. A rep for the Shark Tank star claimed the other boat fled the scene of the crash.\n\n\"Late Saturday night I was a passenger in a boat that had a tragic collision with another craft that had no navigation lights on and then fled the scene of the accident. I am fully cooperating with authorities,\" Kevin said in a statement at the time. \"Out of respect for the families who have lost loved ones and to fully support the ongoing investigation, I feel it is inappropriate to make further comments at this time. My thoughts are with all the families affected.\"\n\nGary Poltash, 64, died at the scene of the accident while 48-year-old Susanne Brito sustained major injuries and passed away at a local hospital. They were both passengers on Ruh's boat. The three others injured from both vessels were later released from the hospital.\n\nLinda O’Leary is due to appear in a Parry Sound, Ontario court on Oct. 29.\n\nRead more from Yahoo Entertainment:\n\nWant daily pop culture news delivered to your inbox? Sign up here for Yahoo Entertainment & Lifestyle’s newsletter.", "description": "Linda O’Leary reportedly plans to fight the charge.", "authors": ["Taryn Ryder"], "top_image": "https://s.yimg.com/uu/api/res/1.2/3defpUO0NbxqHfdxAmj_3Q--~B/aD0yMjE0O3c9MzAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-08/60bda430-c9b7-11e9-b39f-824e0e580d08", "published_at": "2019-09-24"}