{"pub": "time", "url": "https://time.com/5693924/donald-trump-jr-event-protest-florida", "downloaded_at": "2019-10-09 22:01:11.763005+00:00", "title": "Donald Trump Jr.'s University of Florida Speaking Engagement Has Led to Protests From Students Who Will Cover the Cost", "language": "en", "text": "Donald Trump Jr. plans to speak at the University of Florida Thursday, and the fact that he will be paid with school funds has sparked protests among students.\n\nTrump Jr. has been invited to campus by the college’s student government, along with his girlfriend, Kimberly Guilfoyle — a senior advisor for the President’s 2020 reelection campaign and former Fox News personality. Steve Orlando, spokesperson for the University of Florida, tells TIME says there is no specific topic Trump Jr. is expected to speak on but notes that it “can’t be a campaign appearance,” which is banned under the University of Florida’s student government regulations on money used for speakers. He adds that there will be increased security at the event and local, state and federal law enforcement will be present.\n\nThe duo will be paid $50,000 according to Orlando.\n\nThe event is funded by money from an activity and services fee, which is mandatory for students attending classes on the campus. And students say they are not happy about their money being used to fund an event they say “disrespects various communities on campus, misuses student fees and poses a safety risk for marginalized groups.”\n\nThe Brief Newsletter Sign up to receive the top stories you need to know right now. View Sample Sign Up Now\n\nThe event, which is organized by the ACCENT Speakers Bureau, part of the university’s student government, was announced on Oct. 1. Orlando said all available tickets — more than 800 — have already been “fully distributed.” Previous speakers in the last few years include comedian Hasan Minhaj, actor Kal Penn and right wing commentator Ben Shapiro.\n\nJust cancelling the event is not enough for protestors, who are also demanding an apology from organizers of the event for “causing undue stress to the student body and allowing student fees to subsidize a partisan political campaign,” according to a press release they issued.\n\nA spokesperson for Trump and Guilfoyle said that they are “extremely excited about speaking” at the University of Florida and bringing their “bold conservative perspectives.”\n\n“They look forward to the opportunity to engage in meaningful and thoughtful dialogue with everyone in attendance about the importance of freedom, capitalism and our Constitutional rights,” the spokesperson said.\n\nThe protesting group, organized under the name, #ChompTrump, plans to protest on Thursday at 5:30 p.m. at the University Auditorium. Organizers told TIME they expect more than 400 people to show up.\n\nJovanna Liuzzo, a freshman at the University of Florida studying political science and spokesperson for #ChompTrump, says the “Trump agenda is not representative of the entire student body” and that students are “not tolerant of hateful and discriminatory rhetoric.” A major concern for the group is safety, Liuzzo says, adding that any protester “is putting themselves at risk” by showing up. “With events like this, we have to be on the right side of history,” Liuzzo says.\n\nThe University of Florida issued a statement on Oct. 2 defending the right of the student government speakers bureau to invite Trump and Guilfoyle.\n\nThe university has “committed itself to ensuring that a wide variety of viewpoints are heard on campus as well as to protecting the First Amendment rights of all those in attendance,” the statement said. “At the same time, the university recognizes the right of members of its community to analytically and respectfully challenge ideas so long as such challenges are conducted in a civil manner that does not stifle the open expression of the opposing ideas.”\n\nOrlando said that state law forbids the school from weighing in on how student government spends money from the student activity and services fee. State law dictates that this fee “shall be determined by” student government.\n\nThis is not the first time the University of Florida has been embroiled in controversy over a speaker. White nationalist Richard Spencer gave a speech at the university in 2017 and was disrupted by dozens of protesters. Former Florida Gov. Rick Scott had declared a state of emergency ahead of Spencer’s speech, citing clashes that erupted at his past events at college campuses. Orlando notes, though, that Spencer was not invited to campus and came to speak of his “own accord.”\n\nContact us at editors@time.com.", "description": "Donald Trump Jr. plans to speak at the University of Florida Thursday, and his scheduled appearance has sparked protests among students.", "authors": ["Sanya Mansoor"], "top_image": "https://timedotcom.files.wordpress.com/2019/10/donald-trump-jr.jpg?quality=85&crop=0px%2C147px%2C1024px%2C536px&resize=1200%2C628&strip", "published_at": "2019-10-09"}