{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-stocks/british-blue-chips-trail-europe-as-brexit-deal-hopes-lift-pound-idUKKBN1WO0MG", "downloaded_at": "2019-10-09 10:57:46.134750+00:00", "title": "British blue-chips trail Europe as Brexit deal hopes lift pound", "language": "en", "text": "(Reuters) - London’s exporter-laden FTSE 100 lagged its European peers on Wednesday, as sterling gained on a report that the EU was ready to make a “major concession” on the Brexit divorce deal, while Just Eat helped the index hold on to slim gains.\n\nTraders looks at financial information on computer screens on the IG Index trading floor in London, Britain February 6, 2018. REUTERS/Simon Dawson/Files\n\nThe blue-chip index .FTSE, whose components make two-thirds of their earnings abroad, was slightly off the day's highs but was still up 0.1% by 0858 GMT, while the FTSE 250 .FTMC was down 0.1%.\n\nA report that the European bloc was ready to offer a concession to the contested Irish backstop plan lifted the pound, with exporter stocks clinging to gains made earlier in the session when Brexit sentiment was unclear.\n\nShares in companies that earn a chunk of their earnings in the U.S. dollar including GlaxoSmithKline (GSK.L) and Reckitt Benckiser (RB.L) were still offering the most support to the main index.\n\nJust Eat (JE.L) climbed 2% to top the FTSE 100 leader-board, after its Dutch rival Takeaway.com (TKWY.AS) reported a surge in quarterly orders.\n\nGVC (GVC.L) outperformed the midcap index with a 3% rise as the Ladbrokes owner boosted its annual core earnings target for the second time in three months on robust demand in its betting shops despite tighter regulation.\n\nThat news helped rival William Hill (WMH.L) gain 1.5%.\n\nFinancials .FTNMX8350, which have been hammered this year due to the Hong Kong protests and fears of a recession, rose 0.6%.\n\nThe sub-index has plunged 6% since the start of 2019, severely lagging a near 7% rise in the FTSE 100 over the same period and being the only major sector with year-to-date losses.\n\nThe recovery comes ahead of the release of minutes from the U.S. Federal Reserve’s last meeting scheduled later in the day, which could provide further insight on the extent to which the world’s biggest central bank will venture out to support any slowdown.\n\nWith Sino-U.S. talks set to resume tomorrow and as the chaotic Brexit process drags on, investor sentiment has been on the cautious side since the new quarter began.\n\nThose concerns also kept a lid on Wednesday’s rise.\n\n“Though a trade war breakthrough seems a distant prospect, there is always an element of unpredictably where Trump is concerned,” Spreadex analyst Connor Campbell said.\n\n“The next few days, then, are going to be nothing if not interesting.”\n\nFor a graphic on UK stocks, click here", "description": "London's exporter-laden FTSE 100 lagged its European peers on Wednesday, as sterling gained on a report that the EU was ready to make a \"major concession\" on the Brexit divorce deal, while Just Eat helped the index hold on to slim gains.", "authors": ["Muvija M", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191009&t=2&i=1438740914&w=1200&r=LYNXMPEF980FR", "published_at": "2019-10-09"}