{"pub": "npr", "url": "https://npr.org/sections/pictureshow/2019/10/30/772976683/inktober-challenge-pushes-artists-to-flex-their-creative-muscles", "downloaded_at": "2019-10-30 14:16:04.391225+00:00", "title": "Inktober Challenge Pushes Artists To Flex Their Creative Muscles", "language": "en", "text": "Inktober Challenge Pushes Artists To Flex Their Creative Muscles\n\nEach year, October brings pumpkins, witches and candy. But for artists, it also brings the annual tradition of Inktober. Illustrator and writer Jake Parker created the drawing challenge 10 years ago as a way to strengthen his ink-drawing skills.\n\nIn 2009, he announced on his blog that he was going to create and post an ink drawing every day in October, and he invited other artists to join him. Now, millions of drawings are posted to #inktober on Instagram.\n\n\"It's a lot to absorb and follow,\" Parker says.\n\nA few years ago, Parker introduced daily prompts: a daily word that could serve as inspiration for a drawing during Inktober. Some artists work on a consistent theme or project throughout the month; others prefer a less rigid approach.\n\n\"Every year, it's a chance to spend that time focused on a project that can be finished in a month or get a good chunk of it done in a month,\" Parker says. Some Inktober projects have turned into published books.\n\nThe goal is to post a new drawing each day, but it can be demanding to meet that pace.\n\n\"I'm all about building habits and even if I can find only 15 minutes to draw, I'll use this time the best I can,\" artist and illustrator Daria Golab writes in an email. \"At the same time if I miss a few days, I don't worry about it and will try to catch up but without putting too much pressure on it.\"\n\nAny artist can join the challenge, using any creative process the person wishes. Here is a selection of artists creating work for Inktober and their experiences, shared via email:\n\n\"I usually draw something simple every day,\" illustrator Nicole Xu writes. \" It's not a strict rule though. This Inktober, I was swamped with freelance work, so I had to take a break from inking so it didn't feel like a chore.\"\n\n\"I think of everyday items or topics that interest me and begin brainstorming how I can turn those subjects into art in the most eccentric way possible, while still keeping animals and nature as the main focus,\" illustrator Dominique Ramsey writes.\n\n\"I like to create pieces as often as I can,\" artist Michael Lindberg writes. \"Sometimes that means several drawings a week or just one. I enjoy the process of generating ideas and getting them out of my head.\"\n\n\"When it comes to Inktober or any other challenge, I try to post every single piece,\" Golab writes. \"Even if I don't really like it, I try not to subscribe to the idea of only showing good results. Good artists make bad works too!\"\n\n\"I have been creating pieces almost everyday this month,\" artist and architect Anu Sam writes. \"However it takes me much longer to perfect an artwork otherwise, seeking for just the right mood. Since my method of execution involves stippling I tend to work for hours on a single inked drawing for the day.\"", "description": "The annual drawing challenge began a decade ago as a way for one artist to strengthen his ink-drawing skills. Now, millions of drawings showcasing portraits, animals and more are shared each year.", "authors": ["Emily Bogle"], "top_image": "https://media.npr.org/assets/img/2019/10/25/inktober-promo_wide-7a5ef9baae73c3911eaeab2c76b069087efa7a4d.jpg?s=1400", "published_at": "2019-10-30"}