{"pub": "afr", "url": "https://afr.com/policy/foreign-affairs/balance-between-scrutiny-and-security-20191021-p532sn", "downloaded_at": "2019-10-21 11:29:01.102476+00:00", "title": "Balance between scrutiny and security", "language": "en", "text": "There has been a torrent of security laws to deal with real threats. Now they need an overhaul that explains to Australians what these powers are for.\n\nHow do we balance the rights and obligations of individuals, businesses and government in media matters? Three-step corrective action is called for: to review, consolidate and clarify national security legislation; to bolster safeguards against abuse of media freedoms; and to strengthen provisions for appeal against government overreach.\n\nAustralians hold dear the right to freedom of speech and the right of the media to report freely and frankly, exposing lies, corruption, and malfeasance. This freedom is a fundamental part of the fabric of our society, but it is becoming a serious point of contest. When media freedom is eroded, then confidence in governance is eroded as well. Corrective action is now required – and urgently.\n\nUnprotected, democracy can degenerate into mob rule, civil war and anarchy at one end of the spectrum, as seen in places like Syria; or into repressive elite rule, as in Vladimir's Putin’s Russia, at the other end. To avoid these illiberal alternatives taking root in an open society like Australia, we must guard closely the rights of freedom of expression that appear to be under challenge. A society that values openness, accountability and checks and balances is one that strives to defend itself against tendencies towards the abuse of power. Indeed, many of the freedoms we take for granted are made possible by a free media. This is inherent in belonging to a civil society in which the media, along with a robust university sector research and advocacy, has traditionally played an important role as a watchdog against corruption and abuse of power.\n\nTwo high-profile police raids have triggered a campaign in response.\n\nThat watchdog role appears to be under challenge and many factors combine to complicate the process of finding an amicable solution that government, the media and broader society can find acceptable and reassuring. The proliferation of social media and the empowerment of anti-social forces, ranging from unhinged (and sometimes computer savvy) loners to criminal gangs and malevolent domestic and foreign political forces, generates heightened concern. Much of the legislation introduced in the past two decades is intended to counter the corrosive effects of such elements on the security and stability of society.\n\nWhat complicates the situation is that it isn’t just one or two pieces of legislation, but a plethora of related, overlapping and interconnected laws that have been introduced since 2001, affecting various facets of national security.", "description": "There has been a torrent of security laws to deal with real threats. Now they need an overhaul that explains to Australians what these powers are for.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2447%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_0/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/14528690fd3db22252904ab0c239ee221e4af5f2", "published_at": "2019-10-21"}