{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7618681/Freestyle-Mountain-bike-rider-flies-ravine-Red-Bull-Rampage-competition.html", "downloaded_at": "2019-10-27 12:52:39.068027+00:00", "title": "Freestyle Mountain bike rider flies across a ravine at the Red Bull Rampage competition", "language": "en", "text": "Advertisement\n\nA freestyle mountain bike rider flew across a ravine in a terrifying stunt as he took on his competition during the Red Bull Rampage contest.\n\nStunt rider Brendan Fairclough had fans on the edge of their seats as he successfully completed the trick in Zion National Park, Utah.\n\nBrendan - who came fourth overall - also had the crowd in the palm of his hand as he landed an impressive back flip over a canyon.\n\nBrendan Fairclough of Great Britain completing a daring trick during finals at the Red Bull Rampage competition in Zion National Park, Utah\n\nThe annual event attracts 21 of the best freestyle mountain bike riders in the world as they go head-to-head in jaw-dropping stunts\n\nAndreu Lacondeguy of Spain flies through the air during finals at the Red Bull Rampage which sees the best mountain bike riders compete\n\nDue to the steep, rocky slopes these riders risk crashing down the side of sharp drops if they make a wrong turn. Pictured: Kurt Sorge of Canada\n\nDuring the competition the brave riders make their way down sandstone ridges attempting risky flips and tricks to win points. Pictured: Thomas Genon of Belgium takes on a steep drop\n\nMountain bike rider Brendan Fairclough (pictured in the air) flew across a ravine in a terrifying stunt as he took on his competition during the Red Bull Rampage contest\n\nThe athletes taking part are judged on the difficulty of the route that they pick. Szymon Godziek of Poland pictured making a landing during the contest\n\nBrandon Semenuk, Brett Rheeder and Tom Van Steenbergen, all from Canada on the podium at the Red Bull Rampage competition in Utah\n\nBrandon Semenuk of Canada during finals at the Red Bull Rampage. He now joins Kurt Sorge as a three-time winner of mountain biking's most iconic event\n\nOne rider is pictured in mid-air as he attempts a daring back flip in the hope of winning points with the judges\n\nThe annual event attracts 21 of the best freestyle mountain bike riders in the world as they go head-to-head in jaw-dropping stunts.\n\nDue to the steep, rocky slopes these riders risk crashing down the side of sharp drops if they make a wrong turn.\n\nDuring the competition the brave riders make their way down sandstone ridges attempting risky flips and tricks to win points.\n\nThe 21 athletes chosen to take on the challenge at this year's event thrilled and entertained with riding that showed creativity and skill\n\nEmil Johansson of Sweden impressed the crowds as he took his hands off the handlebars of his mountain bike whilst throwing himself off the side of a cliff\n\nThe Red Bull Rampage is an invitation-only free ride mountain bike competition held near Zion National Park in Virgin, Utah. Pictured: Graham Agassiz of Canada\n\nCarson Storch during practice at the Red Bull Rampage, which is an invitational only competition held in Utah\n\nBrendan Fairclough of the United Kingdom during practice at the Red Bull Rampage competition. He came fourth overall, behind three Canadians\n\nEmil Johansson of Sweden performs a jaw-dropping back flip as the sun starts to set over the Zion National Park in Utah on October 25\n\nBrendan (pictured) often posts updates about his competitions on his Instagram page which has thousands of supportive followers\n\nCrowds gather during finals at the Red Bull Rampage in Utah. The annual event is always packed with fans hoping to see impressive mountain bike tricks\n\nBrandon Semenuk took the victory on his first of two runs, with a ride packed full of tricks and technical riding\n\nTom Van Steenbergen during practice at the Red Bull Rampage as he throws himself off the side of a ravine to try and earn points\n\nAt the first ever Rampage in 2001, the prize money for the event was $8,000. In 2015, the total prize fund was $100,000\n\nThe event is similar to freeride skiing and snowboarding, where competitors are judged on their choice of lines down the course, their technical ability and the complexity of tricks\n\nOne competitor even attempted a base jump from a helicopter during finals at the Red Bull Rampage. The crowds on the bank below watched on\n\nRed Bull Rampage has become one of the biggest mountain biking events of the year attracting huge crowds (pictured) who watch in the Utah sunshine\n\nKurt Sorge of Canada and Graham Agassiz of Canada during practice at the Red Bull Rampage event which takes place every year\n\nBrandon Semenuk of Canada during finals at the Red Bull Rampage. He performed a back flip as the crowds watched on in awe\n\nThe athletes taking part are also judged on the difficulty of the route that they pick.\n\nBrandon Semenuk took the victory on his first of two runs, with a ride packed full of tricks and technical riding.\n\nHe now joins Kurt Sorge as a three-time winner of mountain biking's most iconic event.\n\n", "description": "Stunt rider Brendan Fairclough from the UK had fans on the edge of their seats as he completed the trick in Zion National Park, Utah, during the annual Red Bull Rampage competition.", "authors": ["Amelia Wynne For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/12/20242728-0-image-a-142_1572178298689.jpg", "published_at": "2019-10-27"}