{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/couple-pose-for-their-wedding-photos-in-front-of-california-wildfire-11008987", "downloaded_at": "2019-10-30 08:41:49.829544+00:00", "title": "Couple pose for their wedding photos in front of California wildfire", "language": "en", "text": "The Kincade fire burnt just miles away from this couple’s vineyard wedding (Picture: KMR Photography)\n\nA sunset wedding might be the dream for many brides and grooms but for this couple, the smoky orange sky in the back was a sign of tragedy.\n\nKatie and Curtis Ferland from Chicago, Illinois, had planned for the perfect day at Chateau St. Jean vineyard in Sonoma County, California.\n\nBut the special occasion was clouded by the Kincade wildfire spreading behind them.\n\nThe fire burned 54, 298 acres, destroying 94 buildings and forcing 2,000 people to evacuate their homes.\n\nOn the morning of their wedding the bride and groom had to move to a hotel after their Airbnb lost power.\n\nTheir plans for the rehearsal dinner had to be changed as most of their vendors and staff were forced to evacuate.\n\nBut the show went on as Katie wed Curtis. Photographer Karna Roa had the idea to capture the bride and groom with the fire burning at the back.\n\nAdvertisement\n\nAdvertisement\n\nShe explained to Metro.co.uk that this was the ‘new normal’ for California’s wine country.\n\nThe fire began on 23 October but the exact cause is unknown (AP Photo/Noah Berger)\n\nThe picture – which saw Katie and Curtis wearing face masks while donning stoic expressions, was inspired by a famous painting.\n\n‘The image was created in the style of the 1930s painting American Gothic,’ explained Karna of KMR Photography.\n\n‘The original painting by Grant Wood depicted normal life in 1930 in the United States.\n\n‘As the couple stood in the vineyard with masks I wondered if this was the “new normal” for the California Wine Country in 2019.’\n\nShe then posted the images on social media where they went viral. Users said the picture was ‘powerful’.\n\nKarna hopes to show people just how prevalent wildfires are in the state which has been plagued by at least nine wildfires since last week.\n\n‘I do hope this is raising awareness of the California fires across the nation and world.\n\n‘This is the fourth wedding I’ve shot that was threatened by wildfires. This is the first time I’ve created an image like this.’\n\nDespite all the obstacles on such a special occasion, Katie and Curtis felt they sent a strong message with their image.\n\nAdvertisement\n\nAdvertisement\n\nThe next morning, the wedding party had to be evacuated and moved to San Francisco where they could continue the celebrations.\n\nMORE: Inseparable kids who say they’ll be together forever stage fake wedding photoshoot\n\nMORE: Couple slammed for Handmaid’s Tale themed wedding photos\n\nMORE: Curious raccoons interrupt couple’s wedding photoshoot\n\nAdvertisement Advertisement", "description": "Katie and Curtis Ferland from Chicago, Illinois, had planned for the perfect day at Chateau St. Jean vineyard in Sonoma County, California.", "authors": ["Faima Bakar"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_93694530_1572422979.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}