{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/graham-plans-invite-giuliani-testify-ukraine-affair/story?id=66138303", "downloaded_at": "2019-10-09 00:35:28.794625+00:00", "title": "Graham plans to invite Giuliani to testify on Ukraine affair", "language": "en", "text": "Senate Judiciary Committee Chairman Lindsey Graham said Tuesday he intends to invite Rudy Giuliani, the president's personal attorney, to testify about what he called \"corruption in Ukraine\" and \"other improprieties involving Ukraine.\"\n\nInterested in Impeachment Inquiry? Add Impeachment Inquiry as an interest to stay up to date on the latest Impeachment Inquiry news, video, and analysis from ABC News. Add Interest\n\nIn a series of tweets Tuesday morning, Graham, a strong supporter of President Donald Trump, cited \"disturbing allegations\" made by Giuliani that he said the committee needs to hear more about, in contrast to the House impeachment probe being led by Democrats.\n\n\"Given the House of Representatives’ behavior, it is time for the Senate to inquire about corruption and other improprieties involving Ukraine,\" Graham, R-S.C.,said in his tweet. \"Therefore I will offer to Mr. Giuliani the opportunity to come before the Senate Judiciary Committee to inform the committee of his concerns.\"\n\nA spokesperson for Graham said it is unclear whether the testimony would happen in public or private.\n\nDemocratic Sen. Dianne Feinstein, the committee’s ranking member, said she, too, would like to hear from Giuliani.\n\n“I welcome the opportunity to question Rudy Giuliani under oath about his role in seeking the Ukrainian government’s assistance to investigate one of the president’s political rivals,\" Feinstein, D-Calif., said in a statement. “Democratic members have plenty of questions for Mr. Giuliani and this would give us an opportunity to help separate fact from fiction for the American people.”\n\nOther Democrats on the Senate Judiciary Committee, though, have previously told ABC News they do not want to hear from Giuliani.\n\n\"Rudy Giuliani is rapidly turning into a joke,\" Sen. Richard Blumenthal, D-Conn., said in late September.\n\nGiuliani did not immediately reply to request for comment by ABC News.\n\nAngela Weiss/AFP via Getty Images\n\nHouse Democrats have not sought a hearing with Giuliani in their impeachment inquiry, they say, to avoid a public spectacle, and instead subpoenaed him to provide documents and records to Congress by Oct. 15. He has not yet responded to the subpoenas and has cited \"substantial constitutional and legal issues\" that must be considered deciding how to respond.\n\nIt is not entirely clear which of Giuliani's comments specifically Graham was referencing, but in his tweets, he cited Giuliani's concerns surrounding the firing of former Ukraine Prosecutor General Viktor Shokin.\n\nTrump and his allies have repeatedly sought to advance the theory that Vice President Joe Biden used his position to push Ukraine's government to fire Shokin in order to shield his son, Hunter Biden, and Burisma, an energy company where his son served on the board, from an investigation.\n\nIn late September, Giuliani appeared on ABC's \"This Week\" and waved around a stack of documents he said were affidavits that proved that Shokin was dismissed from his post as a result of his investigation into Biden's son and Burisma.\n\nThat was not the only television appearance in recent weeks in which Giuliani has made similar allegations about the firing of Shokin.\n\nDespite Giuliani's comments, no evidence has emerged to support his theory that there was some sort of \"pay-for-play scheme\" by Biden related to Shokin's dismissal. There was widespread criticism of Shokin from several high-profile international leaders, including members of the European Union and International Monetary Fund, who said Biden's recommendation was well justified.\n\nGiuliani, meanwhile, is not the only person Graham has called on to appear before his committee. He's also called on the whistleblower, whose complaint about Trump's conversation with Ukraine's president launched an impeachment inquiry, to come and testify.\n\n\"If you want to tell the story about what bothers you, come to this committee and I'll dare everybody in the Senate to stop me,\" Graham said\n\nGraham has also stated on Fox News that the identity of the whistleblower should be made known.\n\n“Here’s what’s going to happen: If the whistleblowers’ allegations are turned into an impeachment article, it’s imperative that the whistleblower be interviewed in public, under oath, and cross-examined,” Graham said.", "description": "Senate Judiciary Committee Chairman Lindsey Graham, R-S.C., said Tuesday he intends to invite Rudy Giuliani, the president's personal attorney, to testify.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/graham-reuters-aa-191008_hpMain_16x9_992.jpg", "published_at": "2019-10-08"}