{"pub": "bbc", "url": "https://bbc.com/news/in-pictures-49964986", "downloaded_at": "2019-10-09 11:59:23.044848+00:00", "title": "Meet the residents of the Riba-Stirling-Prize-winning Passivhaus", "language": "en", "text": "The homes on Goldsmith Street in Norwich are a little different. Built by Norwich City Council to Passivhaus standard, they have just won the Riba Stirling Prize for architecture and could set the template for the future of social-housing developments.\n\nThese fuel-efficient homes, nearly 100 of them, are handed over with large blue ring binders, manuals filled with the dos and don'ts on how to manage your home.\n\n\"The day we got the keys, we were also given that,\" says Monika Bacik, as she points to the folder on the kitchen bench. Like many other residents, she is still getting used to the new technologies, such as the monitor that controls ventilation.\n\nOn the opposite side of the road, where the houses are subtly different, flipped around to allow for the perfect amount of sun, Alex Jenkins and Aziza Top live next door to each other. Not just neighbours but good friends thanks to their boys, who play together.\n\n\"Growing up, my parents would have to force me to come back into the house at the end of the day,\" says Aziza who lives with her husband, Riza, and two children, Olimjon and Firaz.\n\nImage caption Neighbours Aziza and Alex with baby Benjy\n\n\"Now I tell the kids, 'OK, let's go outside.'\"\n\nAnd in Goldsmith Street, there is plenty of outside to go into as interior space seamlessly extends outwards into the front and back gardens, facilitating communal interaction.\n\nSome have chosen to put chairs and tables in their front gardens, while others hang clothes lines.\n\n\"Tommy's level of exploring is just so much better,\" says Alex, who lives with her partner, Joe, and sons, Benjy and Tommy.\n\n\"Last night when it was tipping down with rain, he just ran outside and was living his best life playing in the puddles. Whereas before, he was so limited.\n\n\"There was a big puddle,\" says Tommy with a big grin on his face as he thinks about his adventure last night.\n\nImage caption Alex with her sons, Benjy and Tommy\n\nMonika lives here with her two children and husband, Karol.\n\nShe often sits in her kitchen as her girls, Maja and Zuzana, play in the garden and alleyway with their new friends.\n\n\"I can sit here and not have to worry about them, I know they are safe,\" Monika says.\n\nImage caption Monika and her daughter Maja\n\nImage caption Children can play in the secured alleyway\n\nWhat makes a Passivhaus?\n\nThe air inside the house is constantly refreshed\n\nLow energy use\n\nSuper insulation and triple-glazed windows\n\nOriented so the sun heats the house in the winter and external shading cools it in the summer\n\nImage caption Aziza and her son Olimjon outside their house\n\nAll three families lived in small flats before moving here through the Norwich council's bidding system. This allows social-housing tenants to apply for other housing that better meet their needs.\n\nAziza had been in the council's bidding system for four years before seeing an advert for this development, though at that stage it was little more than a parking space.\n\nShe was second on the list for the home she now lives in - luckily the family first on the list was given a property a few doors down.\n\n\"You just couldn't ask for more. A nice big kitchen, a garden. You should have seen my old kitchen,\" she says.\n\nThis development isn't just affordable, it offers a modern efficient home for lower-income households.\n\nThe Passivhaus design is not just about creating a community, the regulations on the build mean a substantial reduction in fuel costs.\n\nBefore moving to Goldsmith Street, Alex would often turn the oven on to warm the flat and wear extra layers of clothing rather than switching on the heating.\n\n\"When I say this to people who have never been in that situation before, they look at me as if I have been living in complete poverty,\" she says.\n\n\"Saving that money has meant we can do a lot more. Money doesn't feel as tight as it did.\"\n\nImage caption Maja and Monika's unicorn\n\nInterviews and photographs by Maria Nicola", "description": "Meet some of the residents of the UKs largest social housing scheme to achieve Passivhaus certification.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/1608E/production/_109145209_a6c2615b-dedb-4dcc-a21d-b49d2d3a5938.jpg", "published_at": "2019-10-09"}