{"pub": "heritage", "url": "https://heritage.org/trade/report/dont-trade-the-usmca-private-union-pension-bailout", "downloaded_at": "2019-09-27 12:36:39.962984+00:00", "published_at": "2019-09-27", "title": "Don’t Trade the USMCA for a Private Union Pension Bailout", "language": "en", "text": "Congressional approval of the United States–Mexico–Canada Agreement (USMCA) is a top priority for the Administration, which would like to see this trade agreement implemented within the next few months. In an effort to secure Democratic support for the House to take up the USMCA, Congress is flirting with the idea of attaching a taxpayer bailout for private union pension plans.\n\nMaintaining a free trade area in North America is crucial for American families, workers, and businesses. The USMCA is a revised agreement to replace the quarter-century-old North American Free Trade Agreement (NAFTA). The merits of the USMCA stand on their own, and there is no merit in bailing out reckless union pension plans without reforming the broken system. Doing so would threaten passage of the USMCA.\n\nPension managers who swindled unionized workers out of promised pension benefits with reckless plan management should face the consequences of their actions. A private union pension bailout would reward bad actors while punishing working Americans who are trying to save for their own retirement, as well as employers who played by the rules. Before even considering any bailout of private pension plans, Congress must first establish and enforce sound and consistent rules so that employers and unions cannot continue to rob workers of promised pension benefits by failing to set aside the funds to pay them.\n\nCongress should consider the USMCA and underfunded pensions in isolation of one another. Using a private union pension bailout to persuade lawmakers who are skeptical of the USMCA to support the deal would be reckless policy and end up hurting working Americans.\n\nThe Threat\n\nThe USMCA was signed by the three countries in November 2018 to replace the existing NAFTA. Congress continues to await implementing legislation from the Administration for the USMCA, which must then proceed through the legislative process.REF This is where a pension bailout could come in, as a way to secure support among certain Democrats who are looking for a must-pass vehicle to tack on to their obscure pension bailout. Attaching this unrelated pension bailout to the USMCA would be fiscally reckless and reward irresponsible pension managers without fixing the underlying issues driving the underfunding crisis.\n\nUnderfunded Multiemployer Pensions\n\nAcross the U.S., roughly 1,400 multiemployer pension plans are only 43 percent funded and have promised about 11 million workers and retirees $638 billion more than they have set aside to pay them.REF The situation is so bleak that even the government entity that provides pension insurance—the Pension Benefit Guaranty Corporation (PBGC)—will be bankrupt within six years. When that happens, workers and retirees with insolvent union-run pension plans could end up with mere pennies on the dollar in promised pension benefits.\n\nAlthough only about 10 percent of plans will run out of funds within the next decade or so, the multiemployer problem is pervasive. Fully 96 percent of all workers with multiemployer pensions are in plans that are less than 60 percent funded, and, it is only a matter of time before most multiemployer pension plans become insolvent.REF\n\nCongress’s Proposed Pension Bailout Without Reform. The House passed a pension bailout without reform in July. Under H.R. 397, the Rehabilitation for Multiemployer Pensions ActREF (and the similar Senate companion, the Butch Lewis Act),REF a select group of the worst-funded pension plans would receive over $100 billion in taxpayer dollars. Bailout funds would include annual installments of direct cash (including $3 billion per year for one of the largest plans) as well as taxpayer-subsidized, 30-year, interest-only balloon payment loans to invest in the stock market in hopes of earning higher returns than their low-interest loans.REF Such stock market arbitrage is wholly inappropriate for taxpayer funds.\n\nIn a letter responding to Senator Enzi’s inquiry on the bill’s costs, the Congressional Budget Office cautioned that even an estimated $100 billion provided to 139 select plansREF would not make those plans solvent: “About one-quarter of the affected pension plans would become insolvent in the 30-year loan period and would not fully repay their loans.… Most of the other plans would become insolvent in the decade following their repayment of their loans.”REF\n\nThat is because the proposed “solution” does absolutely nothing to address the problems that allowed employers and unions to effectively steal $638 billion in compensation from workers. On the contrary, by transferring broken pension promises to taxpayers without consequence, and without requiring unions and employers to fund their plans in the future, the proposal encourages even more reckless underfunding.REF\n\nIn addition to H.R. 397, Congress also held a hearing in July on another, more selective, pension bailout. H.R. 935, the Miner’s Pension Protection Act, would provide one single pension plan—the United Mine Workers of America’s (UMWA’s)—with hundreds of millions of dollars each year (up to $750 million total, including its unfunded health benefits) to make good on its broken pension promises.REF H.R. 935 would do nothing, however, to solve the problems that contributed to the UMWA’s unfunded pension and nothing to help or fix the more than 1,300 other significantly underfunded multiemployer pension plans.\n\nThe federal government should not be in the business of picking winners and losers among pension plans—that is unfair and destructive. Congress would implicitly put taxpayers on the hook to bail out all $638 billion of multiemployer pension plans’ broken promises as well as an estimated $4 trillion to $6 trillion in unfunded state and local pension promises. Policymakers should not open the door to any pension bailouts.\n\nA full-scale pension bailout could cost every worker in the U.S. an extra $42,000 in new taxes throughout his career. While such a bailout would leave federal taxpayers on the hook for broken private, and state and local, pension promises, it would do nothing to help those taxpayers with Congress’s failure to address the pension shortfall that will affect them—that is, Social Security’s $16.8 trillion shortfall.REF\n\nRecommendations for Congress\n\nCongress should address the multiemployer pension crisis immediately, as 83 percent of multiemployer pension plans are digging themselves into deeper holes each year.REF The solutions are not easy or painless, but they are straightforward and commonsense.REF Congress should:\n\nMaintain the current pension safety net by preserving the PBGC’s solvency. This includes managing the PBGC more like a private insurance system and collecting additional revenues from multiemployer stakeholders. The PBGC is not a taxpayer-financed entity and Congress should not turn it into one.\n\nThis includes managing the PBGC more like a private insurance system and collecting additional revenues from multiemployer stakeholders. The PBGC is not a taxpayer-financed entity and Congress should not turn it into one. Allow plans to minimize pension losses across participants. By establishing options for pension plans to prolong their solvency, including potential changes in benefit accruals and allowing modest pension reductions, policymakers can help plans to prolong their solvency and preserve higher pension benefits for older and younger workers alike.\n\nBy establishing options for pension plans to prolong their solvency, including potential changes in benefit accruals and allowing modest pension reductions, policymakers can help plans to prolong their solvency and preserve higher pension benefits for older and younger workers alike. Fix the problems so this never happens again. Broken pension promises are wrong, and workers should not lose out on the benefits they worked hard to earn while those who broke their promises walk away unscathed and wealthier. Multiemployer pension plans must be required to follow the same, sound funding rules as non-union pension plans, and employers and unions who promise pension benefits must be held accountable to pay them.\n\nBroken pension promises are wrong, and workers should not lose out on the benefits they worked hard to earn while those who broke their promises walk away unscathed and wealthier. Multiemployer pension plans must be required to follow the same, sound funding rules as non-union pension plans, and employers and unions who promise pension benefits must be held accountable to pay them. Establish a red line for pension bailouts. Taxpayer funds are not necessary to minimize pension losses and fix the multiemployer system. If Congress does decide to use taxpayer dollars to bail out private union pensions, it must include meaningful repercussions. Any pension plan that receives taxpayer money should not be allowed to promise any new benefits, and the PBGC should take over its management. Moreover, pension managers must be held accountable for reckless mismanagement and breaches of fiduciary responsibility.\n\nTaxpayer funds are not necessary to minimize pension losses and fix the multiemployer system. If Congress does decide to use taxpayer dollars to bail out private union pensions, it must include meaningful repercussions. Any pension plan that receives taxpayer money should not be allowed to promise any new benefits, and the PBGC should take over its management. Moreover, pension managers must be held accountable for reckless mismanagement and breaches of fiduciary responsibility. Consider the USMCA as a stand-alone bill and address unfunded pensions separately. The consequences of a pension bailout without reform are so enormous—both in taxpayer costs and the moral hazard and bad precedent it would set—that no trade deal could overcome the repercussions. When implementing legislation for the USMCA reaches Congress, policymakers should consider it as a stand-alone bill, instead of threatening it with an unjust and reckless private union pension bailout.\n\nKeep the Pension Bailout Off the USMCA\n\nPromoting free trade has nothing to do with confronting broken pension promises. At best, tying an esoteric bailout of private pension plans could derail a potentially productive and pro-growth trade deal, and at worst, it could force taxpayers to pay more for other workers’ pensions than they have in their own retirement accounts. Congress’s current approach would reward reckless union pension managers while hurting working Americans who are trying to save for their own retirement, as well as employers who played by the rules. The USMCA and unfunded private union pension plans are two separate issues that Congress should consider separately.\n\nRachel Greszler is Research Fellow in Economics, the Budget, and Entitlements in the Grover M. Hermann Center for the Federal Budget, of the Institute for Economic Freedom, at The Heritage Foundation. Tori K. Whiting is Jay Van Andel Trade Economist in the Thomas A. Roe Institute for Economic Policy, of the Institute for Economic Freedom.", "description": "Congressional approval of the United States–Mexico–Canada Agreement (USMCA) is a top priority for the Administration, which would like to see this trade agreement implemented within the next few months. In an effort to secure Democratic support for the House to take up the USMCA, Congress is flirting with the idea of attaching a taxpayer bailout for private union pension plans.", "authors": ["Rachel Greszler"], "top_image": "https://www.heritage.org/themes/heritage/src/images/bell.png"}