{"pub": "investingcom", "url": "https://investing.com/analysis/us-dollar-index-speculators-raised-bullish-bets-200466815", "downloaded_at": "2019-09-22 15:37:44.269109+00:00", "title": "U.S. Dollar Index Speculators Raised Bullish Bets", "language": "en", "text": "USD Index COT Futures Large Trader Positions\n\nUS Dollar Index Speculator Positions\n\nLarge currency speculators sharply increased their net bullish positions in the futures markets again this week while New Zealand dollar traders pushed bets to a record bearish level, according to the latest Commitment of Traders (COT) data released by the Commodity Futures Trading Commission (CFTC) on Friday.\n\nThe non-commercial futures contracts of US Dollar Index futures, traded by large speculators and hedge funds, totaled a net position of 41,774 contracts in the data reported through Tuesday, September 17th. This was a weekly gain of 9,742 contracts from the previous week which had a total of 32,032 net contracts.\n\nThis week’s net position was the result of the gross bullish position (longs) rising by just 143 contracts (to a weekly total of 49,626 contracts) while the gross bearish position (shorts) dropped sharply by -9,599 contracts on the week (to a total of 7,852 contracts).\n\nThe US Dollar Index speculators boosted net positions by the largest one-week amount since June 19th of 2018, which is a span of sixty-five weeks. Dollar bets have now gained for ten out of the past twelve weeks and this week’s jump puts the current dollar standing at the most bullish level since April 25th of 2017.\n\nIndividual Currencies Data this week:\n\nIn the other major currency contracts data, we saw three substantial changes (+ or – 10,000 contracts) in the speculators category and three others very close to that level as well this week.\n\nNew Zealand dollar speculator positions did not drop by over 10,000 contracts this week but did manage to hit a record high bearish level at over -36,000 contracts. This eclipses the previous record of -35,412 contracts on October 16th of 2018. The NZD bets have fallen in five out of the last six weeks and have now been in an overall bearish position for twenty-seven consecutive weeks.\n\nEuro positions dropped sharply this week by over -18,000 contracts and fell for a fourth consecutive week. The euro net position is now at the most bearish level since June 11th. Overall, the euro speculative level has been in bearish territory for 51 straight weeks.\n\nAustralian dollar bets improved sharply this week by over +12,000 contracts and have now improved for five straight weeks. The recent rise in sentiment has brought the overall net position to the least bearish level since February 26th.\n\nMexican peso bets dropped this week by over -14,000 net contracts and fell for the sixth time out of the past seven weeks. The peso speculative position has continued on a slow decline in recent weeks and months after reaching an all-time record high of +156,030 contracts on April 16th.\n\nOverall, the major currencies that saw improving speculator positions this week were the US dollar index (9,742 weekly change in contracts), British pound sterling (6,109 contracts), Canadian dollar (8,300 contracts) and the Australian dollar (12,932 contracts).\n\nThe currencies whose speculative bets declined this week were the euro (-18,717 weekly change in contracts), Japanese yen (-8,729 contracts), Swiss franc (-1,664 contracts), New Zealand dollar (-6,253 contracts) and the Mexican peso (-14,011 contracts).\n\nChart: Current Strength of Each Currency compared to their 3-Year Range\n\nCurrent Strength Of Each Currency\n\nSee table and individual currency charts below.\n\nTable of Large Speculator Levels & Weekly Changes:\n\nTable Of Large Speculator Levels & Weekly Changes\n\nThis latest COT data is through Tuesday and shows a quick view of how large speculators or non-commercials (for-profit traders) were positioned in the futures markets. All currency positions are in direct relation to the US dollar where, for example, a bet for the euro is a bet that the euro will rise versus the dollar while a bet against the euro will be a bet that the dollar will gain versus the euro.\n\nWeekly Charts: Large Trader Weekly Positions vs Price\n\nEuroFX:\n\nEuroFX COT Futures Large Trader Positions\n\nThe large speculator standing this week recorded a net position of -68,559 contracts in the data reported through Tuesday. This was a weekly reduction of -18,717 contracts from the previous week which had a total of -49,842 net contracts.\n\nBritish Pound Sterling:\n\nBritish Pound Sterling COT Futures Large Trader Positions\n\nThe large speculator level recorded a net position of -86,124 contracts in the data reported this week. This was a weekly rise of 6,109 contracts from the previous week which had a total of -92,233 net contracts.\n\nJapanese Yen:\n\nJapanese Yen COT Futures Large Trader Positions\n\nLarge speculators totaled a net position of 23,862 contracts in this week’s data. This was a weekly decline of -8,729 contracts from the previous week which had a total of 32,591 net contracts.\n\nSwiss Franc:\n\nSwiss Franc COT Futures Large Trader Positions\n\nThe speculator standing this week came in at a net position of -4,556 contracts in the data through Tuesday. This was a weekly decline of -1,664 contracts from the previous week which had a total of -2,892 net contracts.\n\nCanadian Dollar:\n\nCanadian Dollar COT Futures Large Trader Positions\n\nspeculators equaled a net position of 19,823 contracts this week. This was an advance of 8,300 contracts from the previous week which had a total of 11,523 net contracts.\n\nAustralian Dollar:\n\nAustralian Dollar COT Futures Large Trader Positions\n\nThe large speculator positions in futures was a net position of -40,082 contracts this week in the data ending Tuesday. This was a weekly increase of 12,932 contracts from the previous week which had a total of -53,014 net contracts.\n\nNew Zealand Dollar:\n\nNew Zealand Dollar COT Futures Large Trader Positions\n\nThe speculative standing resulted in a net position of -36,043 contracts this week in the latest COT data. This was a weekly lowering of -6,253 contracts from the previous week which had a total of -29,790 net contracts.\n\nMexican Peso:\n\nMexican Peso COT Futures Large Trader Positions\n\nspeculators recorded a net position of 81,626 contracts this week. This was a weekly lowering of -14,011 contracts from the previous week which had a total of 95,637 net contracts.", "description": "Forex Analysis by Zachary Storella covering: EUR/USD, GBP/USD, USD/JPY, USD/CHF. Read Zachary Storella's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-22"}