{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/the-story-behind-that-delightful-ad-astra-cameo", "downloaded_at": "2019-09-23 04:28:09.771564+00:00", "title": "The Story Behind That Delightful Ad Astra Cameo", "language": "en", "text": "Brad Pitt in Ad Astra. (Image: Disney/Fox)\n\nAd Astra is a thoughtful movie, a cosmic Heart of Darkness featuring Brad Pitt as a quiet and calm astronaut searching for his father. Serious business, in other words. But even serious business needs a little fun.\n\nAs explained in a new story by Entertainment Weekly (and the spoilers here are only minor, so no worries), that fun came in the form of a cameo, one that involved a decent amount of begging on the part of director James Grey and that very nearly stole the show from Brad Pitt in the process of making it happen.\n\nThe cameo in question is from Natasha Lyonne, brilliant actress of Orange is the New Black and Russian Doll fame, who director Grey cast to provide “a burst of life and vitality” during her one day of shooting.\n\n“I’d met [Natasha] a few times and liked her enormously. She’s great. She’s also incredibly talented, and I begged her to do this part for a day,” Grey told EW. In the film, she plays a pleasant, cheerful administrator who meets Pitt’s character at a fairly serious moment — though she, of course, doesn’t quite share the mood.\n\nGrey initially met Lyonne during an audition for his film The Immigrant, and later on they were neighbours for a while, an experience he described as “like having this exploding, vital ball of life right near you. Due to those experiences, he had been wanting to cast her in a film in some time. And when she finally came on set, it was magical.\n\n“The movie is pretty heavy and dark, so it was a flash of humour. All of a sudden on Mars, you’re hooking up with a 1950s New York secretary!” Grey said. She reportedly improvised several minutes of footage that didn’t make the film, and that shooting, in fact, ran into a bit of trouble when the camera naturally shifted to her. Grey explained, “There was a lot of laughing going on that day. She’s a riveting actress, so the cinematographer operating the handheld camera kept panning over to her. I kept saying, ‘No, we love her, but the scene is about [Brad’s] entrance into this base,’ but she was doing all of this cool stuff!.”\n\nLittle bits of tonal variation can really make a film like this, especially when that lightened mood feels uncanny or strange in contrast to the rest of the movie. And Lyonne certainly nailed it.\n\nAd Astra is in theatres now.", "description": "Ad Astra is a thoughtful movie, a cosmic Heart of Darkness featuring Brad Pitt as a quiet and calm astronaut searching for his father. Serious business, in other words. But even serious business needs a little fun....", "authors": ["Ryan F. Mandelbaum", "Sarah Basford"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/wc2qn2wtn8azq765xbki.jpg", "published_at": "2019-09-23"}