{"pub": "arstechnica", "url": "https://arstechnica.com/tech-policy/2019/10/army-aims-to-test-extreme-long-range-strategic-cannon", "downloaded_at": "2019-10-15 23:04:03.965534+00:00", "title": "Bringing in the big gun: Army paves way for “strategic cannon”", "language": "en", "text": "In 2017, the US Army established a collection of cross-functional teams (CFTs) aimed at rapidly pushing forward key technologies to advance the services' next generation of capabilities. One of those teams was the Long Range Precision Fires \"pilot,\" an effort to develop the next generation of Army artillery—including \"deep fires,\" an artillery capability that can strike at strategic targets well within an adversary's defenses.\n\nThat effort has spawned what Army Futures Command chief Gen. John Murray described to Congress last year as \"the Strategic Long Range Cannon, which conceivably could have a range of up to 1,000 nautical miles\" (1,150 miles, or 1,850 kilometers).\n\nThe Strategic Long Range Cannon program is now advancing through its first set of technical hurdles. Col. John Rafferty, head of the Long Range Precision Fires CFT, told Defense News in advance of this week's Association of the US Army (AUSA) Annual Meeting that the Army wants to demonstrate a prototype of the gun system by 2023. Currently, the Army is working with the Center for Army Analysis and the Research and Analysis Center at White Sands Missile Range to confirm the technical feasibility of the cannon. The Army is preparing to perform early tests at Naval Support Facility Dahlgren, the site of the Navy's test range for naval artillery.\n\nRafferty told Defense News that the road to the full prototype test will have to pass through \"big technology gates\" along the way. He added, \"We're about to knock down one of those gates with a test at Dahlgren.\" Dalhgren has been the site of a number of advanced gun tests, including the Navy's aborted railgun project.\n\nThe first test is an early ballistic evaluation. But there are much bigger technical issues that lay beyond that—including whether the range the Army seeks can be achieved without the projectiles being too expensive to fire, as happened with the Navy's Advanced Gun System.\n\nBut there's strong incentive for the Army to succeed because an extreme-long-range gun could help deal with the difficulty posed by adversaries with advanced over-the-horizon radar, shore defenses, and air defense systems—such as the kind being put in place by China in the South China Sea.\n\n\"One of the ways to solve that problem is to deliver surface-to-surface fires that can penetrate this complex and disintegrate its network and create windows of opportunity for the joint force to exploit,\" Rafferty said.", "description": "US aims for test of  artillery prototype with range of over 1,000 miles by 2023.", "authors": ["Sean Gallagher"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/10/4979024-760x380.jpg", "published_at": "2019-10-04"}