{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/john-kirby-former-nintendo-lawyer-and-kirbys-namesake-dies-at-79", "downloaded_at": "2019-10-05 00:05:15.401338+00:00", "title": "John Kirby, Former Nintendo Lawyer And Kirby's Namesake, Dies At 79", "language": "en", "text": "This week, the man after whom Nintendo’s iconic pink blob Kirby was named passed away. John Kirby, who died on October 3 from a form of blood cancer, represented Nintendo in the company’s 1984 case about whether Donkey Kong violated Universal Studios’ copyright for King Kong. John Kirby helped Nintendo win that case, which is why Donkey Kong has kept its name and plot throughout its lifetime as a beloved Nintendo franchise. It’s also why Kirby was the name of a hero with a beloved franchise of his own.\n\nAccording to the New York Times obituary, John Kirby worked with Nintendo for many years, and in that time, he also received a sailboat called “Donkey Kong” for winning the critical case.\n\nBefore any of that, though, Kirby spent his early career serving as the special assistant to the head of the U.S. Department of Justice’s Civil Rights Division in the 1960s, during the height of the civil rights movement.\n\nKirby’s work in civil rights law began with an internship at the Department of Justice, the obituary explains, where he “gathered voting records throughout the South that demonstrated evidence of wide-spread discrimination against African-Americans.\n\nHis discovery of methods such as literacy tests specifically designed to exclude African-Americans from voting helped form the basis of the Voting Rights Act of 1965. While at the Civil Rights Division, he also found himself personally escorting African- American children into segregated schools, surrounded by federal marshals.”\n\nThat’s an impressive namesake. The Times’ obituary invites the public to make contributions in his name to Kirby Scholarship Fund at Fordham University, as well as the Merton College Charitable Corporation and The Joseph F. Cullman, Jr. Institute for Patient Experience at Mount Sinai Hospital.", "description": "This week, the man after whom Nintendo’s iconic pink blob Kirby was named passed away. John Kirby, who died on October 3 from a form of blood cancer, represented Nintendo in the company’s 1984 case about whether Donkey Kong violated Universal Studios’ copyright for King Kong. John Kirby helped Nintendo win that...", "authors": ["Alex Walker"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/uhd4zjhbiyeixjjym4ym.jpg", "published_at": "2019-10-05"}