{"pub": "reuters", "url": "https://reuters.com/article/us-southkorea-economy-rates-poll/bank-of-korea-seen-cutting-rates-this-week-reuters-poll-idUSKBN1WT0FX", "downloaded_at": "2019-10-14 06:38:45.550124+00:00", "title": "Bank of Korea seen cutting rates this week: Reuters poll", "language": "en", "text": "SEOUL (Reuters) - South Korea’s central bank will likely cut its policy interest rate this week to support slowing economic growth and weak price pressures, a Reuters poll showed.\n\nFILE PHOTO: The logo of the Bank of Korea is seen in Seoul, South Korea, November 30, 2017. REUTERS/Kim Hong-Ji/File Photo\n\nAll but one of 31 analysts surveyed by Reuters expect the Bank of Korea (BOK) to cut its seven-day repurchase rate KROCRT=ECI by 25 basis points to 1.25% at its monetary policy board meeting on Wednesday, matching a record-low rate seen until late 2017 and the second cut in three months.\n\nA slim majority of 17 respondents see a third cut coming by the third quarter of 2020, while seven others forecast the bank standing pat throughout next year.\n\nWhile signs of progress in U.S.-China trade negotiations have provided some cause for optimism in South Korea, analysts say it won’t be enough to reduce the need for more immediate policy support.\n\n“Though the rate cut will only have limited effect, the BOK should cut the rate now in order to add even a slight support to the economy,” said Cho Yong-gu, economist at Shinyoung Securities, who sees a rate cut on Wednesday and another to come in the third quarter next year.\n\nU.S. President Donald Trump on Friday outlined the first phase of a deal to end a trade war with China and suspended a threatened tariff hike, but officials on both sides said much more work needed to be done before an accord could be agreed.\n\nFreya Beamish, chief Asia economist at Pantheon Macroeconomics, believes the worst of the South Korea’s economic slowdown may already be over, which could give the central bank some room to pause.\n\n“We believe that the bank will want to wait for the third quarter GDP report due out next week,” said Beamish. “The bar for additional easing is high, at least judging by Governor Lee’s comments, which suggest that the growth slowdown would have taken another leg down for the BOK to consider cutting again.”\n\nThe BOK began its easing cycle in July when it cut the key interest rate for the first time in three years, but it held the rate on hold at its last meeting on Aug. 30.\n\nGlobal investment banks have downgraded their forecasts for South Korea’s 2019 economic growth, with some expecting growth to slow below 2% from 2.7% set last year. Inflation is also seen missing the central bank’s 2% target by a significant margin.\n\nLast month, BOK Governor Lee Ju-yeol said economic growth this year would likely miss the bank’s 2.2% forecast but stopped short of formally revising down growth projections or affirming market expectations for further rate cuts this year.\n\nThe BOK is scheduled to release third quarter gross domestic product estimates on Oct. 24. The economy grew 1.9% during the first half of this year over a year earlier.", "description": "South Korea's central bank will likely cut its policy interest rate this week to support slowing economic growth and weak price pressures, a Reuters poll showed.", "authors": ["Joori Roh", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191014&t=2&i=1440599426&w=1200&r=LYNXMPEF9D0C9", "published_at": "2019-10-14"}