{"pub": "yahoo", "url": "https://finance.yahoo.com/news/latest-france-help-saudi-investigate-063123936.html", "downloaded_at": "2019-09-19 23:51:40.308195+00:00", "title": "The Latest: UN chief: Experts on way to probe Saudi attacks", "language": "en", "text": "FILE - In this Saturday, Sept. 14, 2019 file photo, a satellite image from Planet Labs Inc. shows thick black smoke rising from Saudi Aramco's Abqaiq oil processing facility in Buqyaq, Saudi Arabia. The assault on the beating heart of Saudi Arabia's vast oil empire follows a new and dangerous pattern that's emerged across the Persian Gulf this summer of precise attacks that leave few obvious clues of who launched them. (Planet Labs Inc via AP, File)\n\nDUBAI, United Arab Emirates (AP) — The Latest on tensions in the Persian Gulf (all times local):\n\n10:00 p.m.\n\nU.N. Secretary-General Antonio Guterres says U.N. experts have already left for Saudi Arabia to investigate attacks on key Saudi oil installations.\n\nSaudi Arabia's Ministry of Foreign Affairs said Monday it would \"invite U.N. and international experts to view the situation on the ground and to participate in the investigations.\"\n\nGuterres told reporters Wednesday the experts were sent under the U.N. Security Council resolution that endorsed the 2015 nuclear deal between Iran and major powers. It requires the secretary-general to report every six months on the implementation of the nuclear agreement, which includes restrictions on arms-related transfers to and from Iran.\n\nU.N. deputy spokesman Farhan Haq said the experts sent to Saudi Arabia contribute to those reports and monitor sanctions against Yemen.\n\nGuterres again condemned Saturday's attacks, calling them \"a dramatic escalation in the Gulf\" that must be halted.\n\n\"We absolutely need to create the conditions to avoid a major confrontation in the Gulf,\" he said. \"As we have seen by the immediate impact on oil markets, if there would be a major confrontation in the Gulf it would have devastating consequences for the region and globally.\"\n\n___\n\n9:00 p.m.\n\nBritish Prime Minister Boris Johnson has agreed with President Donald Trump that there must be \"a united diplomatic response from international partners\" to the weekend attacks on Saudi oil facilities.\n\nJohnson's office said the two leaders spoke by phone on Wednesday.\n\nBritain has joined the U.S. and others in condemning Saturday's attacks on the heart of the Saudi oil industry, but says it's too early to say who is to blame.\n\nThe U.S. alleges Iran launched the attacks, which were claimed by Yemeni rebels. Saudi Arabia has stopping short of directly accusing Iran of launching the assault but says Iranian cruise missiles and drones were used.\n\nIran denies involvement.\n\nTensions in the Gulf have risen since Trump unilaterally withdrew the U.S. from Tehran's 2015 nuclear deal with world powers. Britain and other European countries are still abiding by the agreement.\n\n___\n\n8:30 p.m.\n\nYemen's Houthi rebels are threatening to attack the United Arab Emirates, days after they claimed attacks on key oil facilities in Saudi Arabia.\n\nYahia Sarie, a spokesman for the Houthi forces, told a press conference Wednesday that they have \"dozens of targets\" in the UAE that \"could be targeted at any time.\"\n\nSaudi Arabia and the UAE have fought a yearslong war in Yemen that's killed tens of thousands of people.\n\nHe also alleged that they used \"other drones to disrupt the enemy so the main drones can reach the target\" during Saturday's attacks.\n\nThe pre-dawn strikes hit a Saudi oil field and the world's largest crude oil processing plant, disrupting the kingdom's oil production.\n\n___\n\n6:55 p.m.\n\nThe Saudi military has shown journalists what they describe as an Iranian cruise missile and drones used in an attack this weekend that targeted the heart of Saudi Arabia's oil industry.\n\nSaudi officials showed journalists the material at a news conference Wednesday in Riyadh, the kingdom's capital.\n\nThey said the cruise missile, which had what appeared to be a jet engine attached to it, was a land attack cruise missile that failed to explode.\n\nOn Saturday, an attack struck the world's biggest oil processing facility in Saudi Arabia, as well as an oil field. Though Yemen's Houthi rebels claimed the assault, the U.S. alleges Iran was behind it.\n\nTehran has denied being involved and warned the U.S. it would retaliate \"immediately\" if targeted over it.\n\n___\n\n6:50 p.m.\n\nA Saudi military spokesman says an attack on its oil industry came \"from the north.\"\n\nCol. Turki al-Maliki did not elaborate, but to the north across the Persian Gulf is Iraq and Iran.\n\nHe spoke at a news conference Wednesday in Riyadh, the kingdom's capital.\n\nAl-Maliki said the attack was \"unquestionable sponsored by Iran.\"\n\nOn Saturday, an attack struck the world's biggest oil processing facility in Saudi Arabia, as well as an oil field. Though Yemen's Houthi rebels claimed the assault, the U.S. alleges Iran was behind it.\n\nTehran has denied being involved and warned the U.S. it would retaliate \"immediately\" if targeted over it.\n\nStory continues", "description": "U.N. Secretary-General Antonio Guterres says U.N. experts have already left for Saudi Arabia to investigate attacks on key Saudi oil installations.  Guterres told reporters Wednesday the experts were sent under the U.N. Security Council resolution that endorsed the 2015 nuclear deal between Iran and", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/CS6QIWQPueh.KMzI_uSimw--~B/aD0yMjUxO3c9NDAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/ecdab3b2d02f253f1c74cc8f64944eaf", "published_at": "2019-09-18"}