{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/10/autonomous-retail", "downloaded_at": "2019-10-11 00:16:57.311557+00:00", "title": "To beat Amazon Go, Standard Cognition buys cashierless DeepMagic – TechCrunch", "language": "en", "text": "Valued at $535 million, autonomous retail startup Standard Cognition has emerged as a soon-to-be tech giant and the best hope for merchants to compete with Amazon Go. Cashierless checkout is poised to transform brick-and-mortar commerce, and shop owners fear having to battle Amazon’s technology alone or partner with it, exposing data it could use against them.\n\nThe $86 million-funded Standard Cognition is racing to equip storefronts with an independent alternative using cameras to track what customers grab and charge them. But Amazon’s early start in the space poses a risk that it could patent troll the startup. So today, Standard Cognition announced it has acquired DeepMagic, a pioneer in autonomous retail kiosks.\n\n“We’re not an aggressive company by any means. My personal stance on patents is that maybe they’re not the way the world should work,” says Standard Cognition CEO Jordan Fisher. “But given the larger player in the space, I think it’s the right thing to do so we have coverage and can protect ourselves.”\n\nDeepMagic lets customers swipe a payment card when entering a smaller kiosk or store, pick up items that are detected by cameras and simply walk out while having their card charged. The idea is that businesses could operate satellite micro-storefronts in malls, apartment buildings and more without staff. DeepMagic was easier to deploy since the kiosks were built from the ground up to eliminate annoying checkout lines.\n\nStandard Cognition, meanwhile, focuses on retrofitting full-sized grocers and other stores, like the one in minor league baseball’s The Worcester Red Sox’s upcoming stadium, as well as others it hasn’t announced. It currently has one experimental shop of its own in San Francisco. Rollouts with partners are more challenging because the startup doesn’t design the building form factor or inventory, but is addressing a much bigger market of existing storefronts. It claims it can grow profit margins for shops by up to 100%.\n\nStandard Cognition sees the smaller footprint spots outfitted by DeepMagic as a crucial piece of the autonomous retail landscape. So it’s acquiring DeepMagic’s technology, and bringing on co-founder and CEO Bernd Schoner as a consultant. Standard Cognition won’t pick up DeepMagic’s staffers or pilot contracts, but it’s considering how to integrate the technology as it ramps up its own deployments. “We were both tackling this problem with a strong focus on the power of computer vision, so it made sense to align ourselves with Standard,” Schoner tells TechCrunch. “We think Standard is in the best position to win this race.”\n\nDeepMagic was mostly founder-funded, but the five-employee company had raised $150,000 from angel investors since starting in New York in 2017. Yet Standard Cognition, which was founded a few months later, raised a $35 million Series B in July from EQT Ventures and Initialized. It has become a center of gravity in cashierless tech, having pulled in half the total $118 million invested in the space in 2018. Now it’s consolidating the space with the DeepMagic buy and its acquisition of retail mapping startup Explorer.ai in January.\n\nThe purpose of the buying spree is getting to market first. “Every day, the thing is speed. I think this is going to be a very fast market. Every day counts. One of my biggest jobs is to keep everybody as motivated today as they will be in five years,” says Fisher. “Six months today will translate to 20% market share in five years. That’s crazy and it’s a huge motivating factor. Moving fast enough that we can get the lion’s share of the market is what keeps me up at night.”\n\nThe company also has to outpace fellow startups like direct competitors Zippin, Trigo and Grabango. Along the way, Standard Cognition has been focused on developing unbiased anti-theft technology that doesn’t care what a person looks like, just what items disappear from shelves. Fisher says it’s also looking into how it can make sure it doesn’t unabashedly grow unemployment. “We’re creating more jobs than we’re displacing right now,” Fisher claims, saying it needs people for data labeling to train its artificial intelligence.\n\nStandard Cognition’s co-founder and CEO hopes Amazon will find it just as challenging if it tries to move from running its own 18 or so Go stores to equipping other businesses. The startup also hopes to capitalize on fears about how Amazon might use partners’ data the way it does in e-commerce. “I don’t think that’s minor at all. Do they get the insights? Can they leverage that to have a better offering on Amazon.com and in their brick-and-mortar stores?,” Fisher asks. “Our product offering has none of those strings attached. There’s no ulterior motives.”", "description": "Valued at $535 million, autonomous retail startup Standard Cognition has emerged as a soon-to-be tech giant and the best hope for merchants to compete with Amazon Go. Cashierless checkout is poised to transform brick-and-mortar commerce, and shop owners fear having to battle Amazon’s technology alone or partner with it, exposing data it could use against […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/Standard-Cognition-Autonomous-Retail.png?w=753", "published_at": "2019-10-10"}