{"pub": "americanconservative", "url": "https://catholiccitizens.org/news/87275/vatican-all-but-wipes-out-conservative-order-of-nuns-for-too-much-prayer", "downloaded_at": "2019-10-28 04:30:37.632489+00:00", "title": "Vatican all but wipes out conservative order of nuns for ‘too much prayer’", "language": "en", "text": "By Matthew Cullinan Hoffman, LifeSite News, June 7, 2019\n\nAll but five of the 39 Little Sisters of Mary, Mother of the Redeemer, a conservative French religious order, have been relieved of their vows by the Vatican after refusing to submit to a group of Vatican-appointed commissioners led by a habitless liberal nun who wanted to impose “modern orientations” on the group, in the sister’s words.\n\nAccording to their lay supporters, the sisters were accused of a variety of offenses against modern sensibilities, including engaging in “too much prayer,” the use of the traditional habits, “deviant authoritarianism,” being “too classical” in their thinking, and being “unmoving” in their adherence to the charism of their institute.\n\nThe 34 nuns, who dress in traditional habits and care for the disabled and elderly in four different nursing homes, have been asked to relinquish their facilities and their religious dress now that they are no longer considered members of their institute. The fate of the nursing homes and their residents is now in question.\n\nThe ruling comes from the Holy See’s Congregation for Institutes of Consecrated Life and Societies of Apostolic Life, which oversees religious orders and institutes, led by Cardinal João Braz de Aviz. Previous attempts by the sisters to overturn the congregation’s rulings against them by appealing to the Supreme Tribunal of the Apostolic Signatura have failed, with the court reportedly dismissing their case without allowing them to fully present their arguments.\n\n“Having looked to remaining faithful, as much to the Church as to the charism granted by Our Lord to Mother Marie de la Croix, having tried to find, many many times, a path of dialogue with Rome, having offered peaceful solutions, no agreement having been found, the authorities in Rome in charge of the Consecrated Life have now decided to choose to release us from our religious vows,” the sisters announced on June 3, following the issuance of the decision on May 23.\n\n“Whilst it is true that in the context of the moral pressure and the impasse that we found ourselves in, we were driven, last October, against our profound wishes, to ask to be released from our vows, since no other solution had ever been offered to enable us to remain in communion with the Church: we are profoundly wounded by this and remain sadly surprised that Rome has preferred to accept that request rather than accepting the peaceful solutions which we had put forward and which were possible,” the sisters added.\n\nThe lay-led Association in Support of the Little Sisters denounced the decision as a “grievous injustice” and blamed the bishop of the Diocese of Laval, Thierry Scherrer, for a personal vendetta against the group’s conservative mother superior that has now led to the destruction of the order.\n\n“Mgr Scherrer wanted the head of the Superior General on a platter,” wrote the association. “An entire Congregation has been destroyed!”\n\n“This unjust and violent decision gives rise to grave damage both moral and material to the Little Sisters of Mary who have given their lives in the service of the Church, in perfect fidelity to their religious vocation,” they add.\n\n“Authoritarianism” and “moral harassment” from Church authorites led to destruction\n\nThe nuns were also reportedly under attack by the archbishop of Toulouse, Robert Le Gall, who prohibited one of the nuns’ houses from attending their more traditional form of Mass in their community chapel, apparently following their refusal to participate in Le Gall’s mass at the nursing home chapel due to their rejection of his liturgical practices.\n\nAccording to their lay supporters, the sisters were accused of a variety of offenses against modern sensibilities, including engaging in “too much prayer,” the use of the traditional habits, “deviant authoritarianism,” being “too classical” in their thinking, and being “unmoving” in their adherence to the charism of their institute. They also say the commissioners tried to turn the sisters against each other, offering prestigious positions in the order if they would conform to the commissioner’s authority, but their tactics failed. When the nuns refused to admit the commissioners, they were threatened with excommunication and requested to be relieved of their vows to avoid that outcome.\n\nThe sisters’ support association is threatening to undertake legal measures against those who have brought about the destruction of the institute as an act of “moral harassment,” which is actionable under French law. The association promised that “as a matter of justice legitimate actions will be undertaken against those responsible, whatever their involvement, to obtain redress and to reveal the entire truth about this affair.”\n\nThe support association says the decision to relieve the sisters of their vows instead of working out a solution with them came at the behest of Sr. Geneviève Médevielle, the principal apostolic commissioner named by the Vatican. Médevielle is a religious sister who dresses in lay clothing and wears a short haircut without a head covering. She is a professor of ethics at the Catholic Institute of Paris and the author of the recently published book Migrants, Francis, and us. Médevielle writes in defense of Amoris Laetitia against “conservatives and traditionalists” who criticize it.\n\nThe French Catholic newspaper La Croix further reported yesterday that the sisters “today are threatening Sister Geneviève Medevielle with a lawsuit for moral harassment.”\n\nSr. Geneviève Médevielle\n\n“It was with an authoritarianism and in a context of moral harassment, initiated by the Bishop of Laval, Mgr Scherrer, that the ecclesiastical authorities preferred to reduce the Little Sisters of Mary the Redeemer to the lay state, on 23rd May 2019, rather than opting for a peaceful solution, repeatedly proposed by the Little Sisters, but never really considered by the Congregation in Rome!” the support association declares on its website.\n\nOur suffering enables us to live our vocation more fully, say sisters\n\nThe sisters, for their part, say they will continue to live their life of prayer and see their suffering as enabling them to live their vocation even more deeply.\n\n“Certainly, we have not lived through these two sorrowful years in order to lose the treasure which is for us the charism received from Mother Marie de la Croix. We want to continue to live together, in a life of prayer and service. Ecce!” the sisters write.\n\n“Paradoxically and mysteriously, we live perhaps more than ever perhaps what is at the heart of our vocation: following in the way of Our Lady, to take our part of suffering in the fulfilment of the plan of our Redemption, in reparation, for the saving of souls, for the sanctification of priests, for the Church so damaged by all sorts of scandals, for the world. If Christ, our souls’ spouse, judges us worthy of carrying such a Cross, we must render thanks to him, in all things.”\n\nRequests for comment from the Holy See were not answered by publication time.\n\nArticle first appeared at: https://www.lifesitenews.com/news/vatican-all-but-wipes-out-conservative-order-of-nuns-for-too-much-prayer", "description": "", "authors": ["Kevin Edward White"], "top_image": "https://catholiccitizens.org/wp-content/uploads/2019/06/little_sisters_of_mary_france_.jpg", "published_at": "2019-06-08"}