{"pub": "bbc", "url": "https://bbc.co.uk/news/science-environment-49648746", "downloaded_at": "2019-09-12 07:08:02.261122+00:00", "title": "Water found for first time on potentially habitable planet", "language": "en", "text": "Image copyright ESA/UCL Image caption Waterworld: up to 50% of the atmosphere of K2-18b may be composed of water\n\nAstronomers have for the first time discovered water in the atmosphere of a planet orbiting within the habitable zone of a distant star.\n\nThe finding makes the world - which is called K2-18b - a plausible candidate in the search for alien life.\n\nWithin 10 years, new space telescopes might be able to determine whether K2-18b's atmosphere contains gases that could be produced by living organisms.\n\nDetails were published in the scientific journal Nature Astronomy.\n\nThe lead scientist, Prof Giovanna Tinetti of University College London (UCL) described the discovery as \"mind blowing\".\n\n\"This is the first time that we have detected water on a planet in the habitable zone around a star where the temperature is potentially compatible with the presence of life,\" she said.\n\nThe habitable zone is the region around a star where temperatures are sufficiently benign for water to exist in liquid form on the surface of a planet.\n\nK2-18b is 111 light-years - about 650 million million miles - from Earth, too far to send a probe. So the only option is to wait for the next generation of space telescopes to be launched in the 2020s and to look for gasses in the planet's atmosphere that could only be produced by living organisms, according to UCL's Dr Ingo Waldmann.\n\n\"This is one of the biggest questions in science and we have always wondered if we are alone in the Universe,\" Dr Waldmann said. \"Within the next 10 years, we will know whether there are chemicals that are due to life in those atmospheres.\"\n\nWhat is an exoplanet?\n\nPlanets beyond our Solar System are called exoplanets\n\nThe first exoplanet was discovered in 1992, orbiting a pulsar (a neutron star that emits electromagnetic radiation)\n\nMore than 4,000 have been detected to date using several techniques\n\nMany of these worlds are large planets believed to resemble Jupiter or Neptune\n\nMany giant planets have been found orbiting very close to their stars\n\nThe team behind the discovery looked through the planets discovered by the Hubble Space Telescope between 2016 and 2017. The researchers determined some of the chemicals in their atmosphere by studying the changes to the starlight as the planets orbited their suns. The light filtered through the planets' atmospheres was subtly altered by the composition of the atmosphere.\n\nOnly K2-18b revealed the molecular signature of water, which is a vital ingredient for life on Earth. Computer modelling of the data suggested that up to 50% of its atmosphere could be water.\n\nThe new planet is just over twice the size of Earth and has a temperature cool enough to have liquid water, between zero and 40C.\n\nDr Angelos Tsiaras, a member of the UCL team, said that finding water in the atmosphere of a potentially habitable exoplanet was \"incredibly exciting\".\n\nHe said: \"It brings us closer to answering the fundamental question: Is the Earth unique?\"\n\nLong haul\n\nOne difficulty with this approach, though, is that astronomers can't agree on which gases would constitute evidence of life. That might be more of a longer haul.\n\nIt is likely to require a survey of the chemical composition of, perhaps, hundreds of worlds and an understanding of how they are created and evolve, according to Prof Tinetti.\n\n\"The Earth really stands out in our own Solar System. It has oxygen, water and ozone. But if we find all that around a planet around a distant star we have to be cautious about saying that it supports life,\" she said.\n\n\"This is why we need to understand not just a handful of planets in the galaxy but hundreds of them. And what we hope is that the habitable planets will stand out, that we will see a big difference between the planets that are habitable and the ones that are not.\"\n\nImage copyright ESA/STFC RAL Space/UCL/Europlanet-Science Office Image caption ESA's Ariel mission in 2028 could help confirm the presence of life on other worlds\n\nDr Beth Biller at Edinburgh University's Institute of Astronomy said she believed that evidence of life on a planet around a distant star would eventually be discovered.\n\n\"That would be a paradigm shift for all of humanity,\" she told BBC News.\n\n\"It's not going to be ET phoning home, necessarily - more likely microbes or some other simple life. Even so (when it happens) it's going to be huge\".\n\nThe prospective launch of Nasa's much delayed James Webb Space Telescope (JWST) in 2021, and the European Space Agency's Ariel mission seven years later, will enable astronomers to study in detail the atmospheres of the varied worlds that have been detected so far.\n\nWater has been detected on other planets but they have been either too big or too hot to support life. Cooler smaller planets are much harder to detect. The team at UCL was able to do this by developing algorithms capable of teasing out the chemical composition of the atmospheres of potentially habitable worlds\n\nK2-18b was discovered in 2015 and is one of hundreds of super-Earths - planets with a mass between Earth and Neptune - found by Nasa's Kepler spacecraft. Nasa's Tess mission is expected to detect hundreds more in coming years.\n\nThe research was funded by the European Research Council and the UK Science and Technology Facilities Council, which is part of the UK Research and Innovation agency (UKRI).\n\nFollow Pallab on Twitter", "description": "Astronomers discover water in the atmosphere of a \"habitable\" planet orbiting a distant star.", "authors": ["Pallab Ghosh", "Science Correspondent", "Bbc News"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/C56F/production/_108734505_k2-18b.png", "published_at": "2019-09-11"}