{"pub": "heritage", "url": "https://heritage.org/education/commentary/puerto-ricos-school-choice-reforms-are-helping-kids", "downloaded_at": "2019-10-16 20:32:05.272810+00:00", "title": "Puerto Rico’s School Choice Reforms Are Helping Kids", "language": "en", "text": "Last year brought a whirlwind of education opportunities to Puerto Rican families.\n\nThe island’s first charter school, Proyecto Vimenti, opened to serve disadvantaged children. The commonwealth’s legislature approved a private school scholarship program for children who are bullied, experience sexual harassment, or who have special needs.\n\nThese were notable victories for families where most have no alternative education options besides the local public schools.\n\nUnfortunately, some have tried to tie recent scandals involving government officials to these island-wide education reforms.\n\nFor instance, former Puerto Rico Secretary of Education Julia Keleher, along with five others, was arrested on federal charges of money laundering, theft, and wire fraud that steered $15.5 million to favored, but unqualified, businesses.\n\nOnly months later, Gov. Ricardo Rossello resigned in the wake of a volatile 13-day protest instigated by “a massive leak of chats among Rossello and his aides in which they disparaged his opponents in profane, sexist language and appeared dismissive of the struggles of ordinary Puerto Ricans,” SFGate reported.\n\nCorruption is not new to Puerto Rico. In fact, as a recent Heritage Foundation issue brief noted, in 2018, that the former Department of Sports and Recreation secretary was cited for “$9.8 million in a ‘kickback, fraud, and money laundering conspiracy’ involving vendors that worked with the territory’s department of education.”\n\nThe inspector general has reported similar findings to Congress for decades, finding that fraud and corruption are systemic and pervasive, including among the teachers unions.\n\nWhile politicians, bureaucrats, and lobbyists were embroiled in scandals, the school choice reforms introduced in 2018 have been helping children.\n\nFor example, the territory’s second charter school, Rosalina C. Martinez, opened this school year. The school will enroll up to 300 middle and high school students and aims to specifically strengthen student self-esteem and help children break out of generational cycles of poverty.\n\nSince more than 40% of families live below the federal poverty line in Puerto Rico, there are many children who stand to gain from the charter school’s mission.\n\nEven more children will have access to greater education choice next year since the territory plans to double the number of charter schools. Charter school expansion is capped by a law that says only 10% of Puerto Rico’s schools can attend “alianza (charter) schools.”\n\nThis year, Puerto Rico is launching a private school tuition scholarship called the Free School Selection Program. Participation numbers have yet to be released, but Andrew Ujifusa, an editor at Education Week, noted, “Voucher enrollment is capped at 1% of public school students for the upcoming school year, with the cap eventually rising to 3%.”\n\nCharter school and voucher expansion would be a boon to Puerto Rican children, many of whom have no education options besides their local public school. Private school is out of reach for most families because of pervasive poverty, and, more recently, the ravages of Hurricane Maria in 2017.\n\nPuerto Rican children clearly need more education options. The National Assessment of Educational Progress found that fourth- and eighth-graders are five grade levels behind their peers on the mainland in mathematics.\n\nMoreover, as of 2017, more than a quarter of Puerto Ricans ages 25 and older did not have a high school diploma, according to the Census Bureau.\n\nHigh school attainment is an important measure of education success. As University of Arkansas professor Patrick Wolf, commented, “When it comes to education, how far you go matters more in life than how much you know.”\n\nWolf’s remark is confirmed by Ron Haskins, Elizabeth Sawhill, and Brad Wilcox’s research on the success sequence, which demonstrates that those who “finish high school, get a full-time job, and wait until age 21 to get married and have children” are far more likely to join the middle class.\n\nSchool choice options, such as those in D.C. and Milwaukee, produced overall positive outcomes for high school attainment. As Puerto Rico’s school choice programs mature, they will have the opportunity to bear similar fruit.\n\nAs things stand, the traditional public schools in Puerto Rico have failed to meet the needs of children for decades, resulting in low attainment rates and poor performance on national assessments.\n\nIn light of the challenges the territory’s children face, such as hurricane recovery and widespread poverty, policymakers should abandon the policies that have repeatedly failed to enrich the lives of children. Instead, they should grow options that put power back in the hands of parents and give children the education they deserve.", "description": "Last year brought a whirlwind of education opportunities to Puerto Rican families. \n\nThe island’s first charter school, Proyecto Vimenti, opened to serve disadvantaged children. The commonwealth’s legislature approved a private school scholarship program for children who are bullied, experience sexual harassment, or who have special needs.", "authors": ["Jude Schwalbach", "Research Assistant", "Center For Education Policy", "Jude Is A Research Assistant In Education Policy At The Heritage Foundation."], "top_image": "https://www.heritage.org/sites/default/files/styles/facebook_optimized/public/images/2019-10/GettyImages-871265668.jpg?itok=eyz0E2rY", "published_at": "2019-10-16"}