{"pub": "atlantic", "url": "https://theatlantic.com/technology/archive/2019/10/zuckerberg-hearing-anti-vaxx-question-and-ads/600577", "downloaded_at": "2019-10-24 00:29:56.769160+00:00", "title": "A Telling Exchange at the Zuckerberg Hearing", "language": "en", "text": "“Are you 100 percent confident that vaccines pose no injury to any person on this planet?”\n\nThat was a real question asked today by Bill Posey, a congressman representing Florida’s Eighth District, to Facebook CEO Mark Zuckerberg. Facebook, for the record, is not a pharmaceutical company. Zuckerberg is not a medical professional. There are no indications that Libra, the proposed cryptocurrency that was supposedly the object of the House subcommittee hearing during which this exchange took place, will require its users to submit their vaccination records.\n\nPosey’s monologue—he claimed to “support vaccinations,” but was also “disappointed Facebook would consider interfering with free speech with vaccinations”—was shocking in not only its content, but also its context. Posey was complaining about changes Facebook announced in March: that it would reject ads that include misinformation about vaccines and stop recommending groups and pages that spread such misinformation. Today’s hearing was about whether, in starting a cryptocurrency, Facebook might destabilize the global financial system.\n\nBut the Facebook that wants to create a cryptocurrency is the same Facebook that has spent years inadvertently creating—and then recently, clumsily, trying to uncreate—the information ecosystem that provided the basis for Posey’s question in the first place. At the hearing, Posey said, “The federal government has created a vaccination trust fund that has paid out over $4 billion to compensate those who have been injured by vaccinations.” That’s not exactly right: He was referring to the Vaccine Injury Compensation Program, which my colleague James Hamblin reported on this spring. The program reimburses people who claim to have been injured by vaccines, and the process for determining which claims are valid is less than scientific. About 70 percent of the money was doled out in cases where no government body actually concluded that a vaccine was at fault.", "description": "How a question about vaccines made it into a hearing about cryptocurrency", "authors": ["Rachel Gutman"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/AP_19296617738504/facebook.jpg?1571853116", "published_at": "2019-10-23"}