{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7593171/Frances-Sebastien-Vahaamahina-sent-elbow-Aaron-Wainwright-World-Cup-clash-Wales.html", "downloaded_at": "2019-10-20 12:40:30.902887+00:00", "title": "Rugby World Cup: France's Sebastien Vahaamahina dismissed for elbow on Wales' Aaron Wainwright", "language": "en", "text": "France lock Sebastien Vahaamahina was sent off in his side's Rugby World Cup quarter-final against Wales after a crazy elbow on Wales' Aaron Wainwright that cost his side a place in the semi-finals.\n\nWales rallied after the dismissal and booked their semi-final spot after coming from behind to win 20-19.\n\nDuring a maul, Vahaamahina grappled his right arm around Wainwright's neck before pulling it away and launching his elbow back into his face.\n\nSebastien Vahaamahina saw red after his crazy elbow on Aaron Wainwright in the quarters\n\nThe Wales flanker winced in pain as the maul continued, with the incident being looked at in a TMO review by the referee soon after.\n\nAfter a short deliberation, Vahaamahina was dismissed, leaving his side to play the rest of the game with 14 men.\n\nFrance had been leading Wales 19-10 at the time of the elbow, where he was initially penalised for grabbing Wainwright around the neck.\n\nAfter grappling his arm around Wainwright, Vahaamahina smashes his elbow into his face\n\nLost his head!\n\n\n\nSebastien Vahaamahina has been shown a red card for this foul at the maul #WALvFRApic.twitter.com/i6b7B0aqPK — The Rugby Paper (@TheRugbyPaper) October 20, 2019\n\nAnd the reckless decision by Vahaamahina cost his side a place in the semi-finals after Wales went on to win 20-19.\n\nVahaamahina's elbow has left rugby fans and pundits baffled, with one calling it 'the dumbest decision of the Rugby World Cup'.\n\nAnother said the player 'doesn't learn' after referencing a mistake he made against Wales in the Six Nations.\n\nThe 27-year-old has made 45 appearances for France since making his bow in 2012. He has played three games at this year's Rugby World Cup for the French, scoring one try.\n\nSebastien Vahaamahina with the dumbest decision of the #RWC2019. How can any international rugby player even begin to think he should do that. I’m glad we won’t see him again in this tournament regardless of the result. #WALvFRA — Jake O'Flaherty (@jakoboflaherty) October 20, 2019\n\nSebastien Vahaamahina was the fool who threw a ludicrous pass which cost @FranceRugby against Wales in the 6N; now he’s brainlessly thrown an elbow in a RWC QF against the same opposition. He doesn’t learn does he? Perhaps @ASMOfficiel will send him to night school? — Martin Gillingham (@MartGillingham) October 20, 2019", "description": "France lock Sebastien Vahaamahina was sent off in his side's Rugby World Cup quarter-final against Wales after a crazy elbow on Aaron Wainwright that cost his side a place in the semi-finals.", "authors": ["Oli Gamp For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/10/19951426-0-image-a-34_1571562407352.jpg", "published_at": "2019-10-20"}