{"pub": "cnn", "url": "https://cnn.com/style/article/rihanna-savage-x-fenty/index.html", "downloaded_at": "2019-09-12 07:29:14.068795+00:00", "title": "Rihanna's Savage X Fenty show at New York Fashon Week", "language": "en", "text": "Written by CNN Staff\n\nSavage X Fenty, Rihanna's inclusive lingerie brand, pulled out all stops on the runway Tuesday night, as part of New York Fashion Week\n\nModels Alek Wek, Cara Delevingne and Joan Smalls, actress Laverne Cox and singer Normani were among the star talent wearing the latest Savage X Fenty F/W 2019 pieces, while the collection dropped the same day on Amazon Fashion. Halsey, Migos, Tierra Whack and DJ Khaled entertained the star-studded crowd.\n\nRihanna arrives at the Savage X Fenty show at Barclays Center in Brooklyn, New York. Credit: Kevin Mazur/Getty Images North America/Getty Images for Savage X Fenty\n\n\"My vision for the Savage X brand has always been having women feel confident and expressing themselves,\" said the musician turned entrepreneur, in a video showing behind the scenes of the design process posted on the online shopping portal.\n\n\"There's no rules with designing lingerie. You can go as comfortable as you want, you can go as sexy as you want,\" she added.\n\nRihanna's line ranges from comfortable (but stylish) leisurewear to ornate satin and lace lingerie, with a push-up t-shirt bra and a lace-up bodysuit among the bestsellers. Products come in a range of shades to match all skin tones -- no pinky-beige \"nude\" underwear here -- while the line comes in sizes 32A to 42H, XS to 3X.\n\n\"We want to make people look good and feel good,\" Rihanna said in a press release. \"We want you to feel sexy and have fun doing it.\"\n\nImages of the show remain scarce, as the event was recorded and will be streamed by Amazon Prime on September 20. Photos from the red carpet offer a glimpse of the celebrity attendees, however, with models Gigi and Bella Hadid, actors Vanessa Hudgens and Hailee Steinfeld and musicians Kehlani, Saweetie and Kacey Musgraves all spotted.\n\nRihanna performs during her Savage X Fenty show at New York Fashion Week. Credit: Dimitrios Kambouris/Getty Images North America/Getty Images for Savage X Fenty\n\nThis is the second time Savage X Fenty has shown at NYFW. Its debut last year -- using a diverse lineup and two pregnant models -- was widely praised for its focus on representation.\n\nThe show's closest parallel, the Victoria's Secret Fashion Show -- which was canceled this year, but is expected to return in the future -- has faced criticism for its lack of diversity. In 2018, Ed Razek, the former chief marketing officer of the brand's parent company (he resigned in August) told Vogue that the event wouldn't include transgender or plus-size models, saying \"the show is a fantasy.\"\n\nDays before Razek stepped down, Victoria's Secret hired model Valentina Sampaio for a campaign, making her their first trans model, but she's yet to walk a runway for the brand.\n\nThe Fenty brand has consistently prioritized inclusivity, from the groundbreaking shade range of her Fenty Beauty makeup line to the broad size range of her Fenty fashion house at LVMH , unusual for a luxury brand.\n\nRihanna also made history when she launched Fenty, becoming the first black woman to head an LVMH brand.\n\nAs her business portfolio expands across the fashion and beauty industries, Rihanna is making a very clear point: For Fenty, diversity is not a trend.", "description": "Savage x Fenty -- musician Rihanna's inclusive lingerie brand -- pulled out all stops on the runway Tuesday night, as part of New York Fashion Week.", "authors": ["Cnn Staff"], "top_image": "http://cdn.cnn.com/cnnnext/dam/assets/190911150316-savage-x-fenty-new-york-3-super-tease.jpg", "published_at": "2019-09-11"}