{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/1/los-angeles-county-bans-flavored-tobacco-products", "downloaded_at": "2019-10-02 02:28:11.443711+00:00", "title": "Los Angeles County bans flavored tobacco products", "language": "en", "text": "LOS ANGELES (AP) - Los Angeles County on Tuesday banned flavored tobacco products including e-cigarettes, chewing tobacco and menthol cigarettes amid concerns that the products appeal to young people.\n\nThe county’s Board of Supervisors voted unanimously to adopt the ban and to call on California Gov. Gavin Newsom to pass a statewide ban on vaping as health concerns grow.\n\nThe regulations are opposed by business owners and advocates of vaping who say e-cigarettes help people quit smoking. The vote came on a second reading after initial approval last week.\n\nThe ordinance takes effect in 30 days. Retailers will then have 180 days to clear their shelves of flavored tobacco and apply for updated licenses required under the new rules.\n\nCounty lawyers say online sales will not be prohibited, and users will not be punished under the ordinance, KNBC-TV reported.\n\nFlavored tobacco products are “driving the current vaping epidemic among youth,” county Department of Public Health Director Barbara Ferrer told the board last week.\n\n“As the number of vaping-related deaths and hospitalizations climb, and as more states have taken steps to protect youth from the harmful effects of vaping products, we need to support our state leaders and ask them to step in to protect the public,” said Supervisor Hilda Solis in a written statement following the vote. Solis introduced the motion.\n\nThe e-cigarette industry faces mounting scrutiny from federal and local governments over youth vaping as the 14th U.S. death linked to vaping was reported in Nebraska. More than a hundred California residents who vape have been hospitalized for lung damage, the state said.\n\nTuesday’s vote would affect Los Angeles County’s unincorporated areas and their approximately 1 million residents. The move also would effectively ban the sales of the flavored products, including menthol, to everyone.\n\nNewsom said last week that he wants lawmakers to send him legislation next year to ban vaping. Meanwhile California will spend $20 million on a public awareness campaign about the dangers of vaping nicotine and cannabis products and step up efforts to halt the sale of illicit products.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Los Angeles County on Tuesday banned flavored tobacco products including e-cigarettes, chewing tobacco and menthol cigarettes amid concerns that the products appeal to young people.", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-10-01"}