{"pub": "reuters", "url": "https://uk.reuters.com/article/us-germany-economy-industrial-orders/recession-risks-rise-for-germany-as-industrial-orders-plunge-idUKKCN1VQ0M1", "downloaded_at": "2019-09-05 10:33:22.353011+00:00", "title": "Recession risks rise for Germany as industrial orders plunge", "language": "en", "text": "BERLIN (Reuters) - Weaker demand from abroad drove a bigger-than-expected drop in German industrial orders in July, suggesting that struggling manufacturers could tip Europe’s biggest economy into a recession in the third quarter.\n\nFILE PHOTO: Steel rolls are pictured at the plant of German steel company Salzgitter AG in Salzgitter, Germany March 5, 2019. REUTERS/Fabian Bimmer\n\nGermany’s export-reliant economy is suffering from slower global growth and business uncertainty caused by U.S. President Donald Trump’s ‘America First’ trade policies and Britain’s planned, but delayed, exit from the European Union.\n\nContracts for ‘Made in Germany’ goods fell 2.7% from the previous month in July, data showed on Thursday, driven by a big drop in bookings from non-euro zone countries, the economy ministry said. That undershot a Reuters consensus forecast for a 1.5% drop.\n\n“The misery in manufacturing continues. The decline in new orders significantly increases the risk of a recession for the German economy,” VP Bank analyst Thomas Gitzel said.\n\nGermany’s gross domestic product contracted by 0.1% quarter-on-quarter in the second quarter on weaker exports, with the decrease in foreign sales mainly driven by Britain and below average demand from China.\n\n“The danger is great that negative growth will also be recorded in the third quarter,” Gitzel added.\n\nThe economy ministry said new orders in manufacturing had a weak start to the third quarter and that the outlook for the sector was also looking grim.\n\n“In light of still unresolved international trade conflicts and muted business expectations in manufacturing, there are still no signs of a fundamental improvement in the industrial sector in the coming months,” the ministry added.\n\nOrders from non-euro zone countries plunged nearly 7% on the month while demand from other euro zone countries and domestic bookings rose slightly, the data showed.\n\nWithout the distorting effects of bulk orders, industrial orders rose 0.5% on the month in July, the ministry added.\n\nThe overall reading for June was revised up to an increase of 2.7 from a previously reported 2.5% increase.\n\nLITTLE LIGHT\n\nThe VDMA business association said engineering orders in July fell by 3% in real terms from the previous year, driven by weaker demand from both domestic and foreign clients.\n\n“The business and export outlook is still gloomy for the second half of the year given the economic and political risks,” VDMA chief economist Ralph Wiechers said.\n\nGermany’s DIHK business association said that companies around the globe were reluctant to invest due to slowing world trade and growing business uncertainty.\n\n“So there is little light on the horizon for German industry which is characterized by its large share of capital goods producers,” DIHK economist Kevin Heidenreich.\n\nCarsten Brzeski from ING noted that the downward trend in manufacturing was not only driven by weaker foreign demand and trade conflicts.\n\n“Since the start of the year, domestic orders have actually dropped more than foreign orders, suggesting that global woes have reached the domestic economy,” Brzeski added.\n\nLabour market data showed last week that seasonally adjusted unemployment rose in August, eroding a pillar of growth that has helped support Germany’s traditionally export-driven economy.\n\nWith its sales abroad hit by a worsening trade climate, a global economic slowdown and the increasingly chaotic run-up to Brexit, the bulk of Germany’s growth momentum is now being generated domestically - a dependency that leaves it exposed to any weakening of the jobs market.\n\nGoldman Sachs Chief Financial Officer Stephen Scherr said on Thursday that the German economy is in the “early days of a slowdown”.\n\nThe government expects economic growth to slow to 0.5% this year from 1.5% in the previous year. This would be the weakest expansion since 2013 when the euro zone struggled amid a sovereign debt crisis.", "description": "Weaker demand from abroad drove a bigger-than-expected drop in German industrial orders in July, suggesting that struggling manufacturers could tip Europe's biggest economy into a recession in the third quarter.", "authors": ["Michael Nienaber", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190905&t=2&i=1426436549&w=1200&r=LYNXNPEF840G2", "published_at": "2019-09-05"}