{"pub": "cryptonews", "url": "https://cryptonews.com/guides/get-10-nextrope-lab-london-conference-2019-discount-coupon.htm", "downloaded_at": "2019-10-05 13:43:11.017563+00:00", "title": "Get 10% Nextrope Lab London Conference 2019 Discount Coupon", "language": "en", "text": "Nextrope Lab London: BLOCKCHAIN IN PRACTICE\n\nWe would like to invite you to the Nextrope Lab London - a two-day workshop that will equip you with practical knowledge about applications of Blockchain. It will provide you with tools and skills allowing to take full advantage of this still undiscovered technology. You will be guided you through the processes of designing a network, programming Smart Contracts, building DApps and taught all about the best practices of utilizing the Distributed Ledger Technology.\n\nFind more information at http://nextrope.com/london/ .\n\n-10% promo code: CryptoNews2019\n\nUse the code CryptoNews2019 to get a 10% discount for Nextrope Lab London: BLOCKCHAIN IN PRACTICE conference and workshop!\n\nNextrope Lab is one of the fastest growing blockchain-focused software houses in Europe. Its international team of experts is led by Forbes 30 under 30 entrepreneur Mateusz Maco, who is also the founder of FiveApp - the first widely used sign-language messenger apps for the European market.\n\nNextrope Lab’s 2-day crash course focuses on universal and practical programming on Ethereum and Hyperledger platforms. You will have a unique chance to explore Solidity, smart contracts, and other highly-valuable tools for building dApps from scratch, and will receive a certificate confirming your participation in the blockchain course.\n\nHow to Get Nextrope Lab London: Blockchain in Practice Conference & Workshop Discount\n\nFollow these steps to receive the 10% Nextrope Lab London 2019 conference and workshop discount.\n\n1. Go to http://nextrope.com/london/ and click “Buy Ticket Now.”\n\n2. A new window with event information will open. Hit “Buy Tickets” again.\n\n3. Choose the type of ticket you want to purchase and click “NEXT.”\n\n4. Type in the promo code CryptoNews2019, then click “APPLY,” and get 10% of the original ticket price.\n\n5. Complete the registration form and finish the purchase.\n\nHere you have it! A 10% discount ticket for Nextrope Lab London: Blockchain In Practice Conference & Workshop.\n\nEnjoy!", "description": "Follow these steps to receive the 10% Nextrope Lab London 2019 conference and workshop discount.", "authors": [], "top_image": "https://cimg.co/w/guides/0//", "published_at": "2019-10-05"}