{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7584761/Cardi-B-living-happily-husband-Offset-pair-reminisce-romantic-holiday.html", "downloaded_at": "2019-10-18 01:13:37.082588+00:00", "title": "Cardi B is living 'happily ever after' with husband Offset as the pair reminisce on romantic holiday", "language": "en", "text": "They've weathered personal storms and have remained a united force for the sake of their family.\n\nAnd Cardi B appeared to be completely in love with her husband Offset as she shared a photo of the couple kissing while on holiday.\n\nThe 27-year-old rapper was dressed to thrill wearing an all-red ensemble for an off-road adventure on all terrain vehicles with her lover.\n\nLove is in the air: Cardi B appeared to be completely in love with her husband Offset as she shared a photo of the couple kissing while on holiday\n\n'They prayed, they got they s**t together and they lived happily ever after ... until they argue about who got the best food New York or Atlanta?' she wrote on Instagram. 'Deff New York.'\n\nCardi's killer curves were on display as she rocked a pair of sheer neon shorts with matching bikini bottoms.\n\nA tiny triangle top covered up her ample assets and she added a matching bandanna to cover her hair.\n\nBlessed: The 27-year-old rapper was dressed to thrill wearing an all-red ensemble for an off-road adventure on all terrain vehicles with her lover\n\nA mood: Cardi's killer curves were on display as she rocked a pair of sheer neon shorts with matching bikini bottoms\n\nOffset casually placed his hand across his wife's backside while posing for the tropical shot.\n\nThe Migos rapper was in the same spirit as his wife, sharing 'we stand tall together' on a photo of the couple holding hands.\n\nTheir relationship played out in the public eye when she famously left him after one year of marriage amid multiple cheating allegations.\n\nPicture perfect: Cardi and Offset could barely keep their hands off each other during their tropical getaway\n\nJust months later in February, he was her plus one to the Grammy Awards where she nabbed the Best Rap Album statue for her debut record, Invasion of Privacy.\n\nCardi — who's real name is Belcalis Marlenis Almánzar — is riding high on the success of her career and took on a starring role alongside Jennifer Lopez in the true crime story of a team of strippers who take on Wall Street execs in the '90s called Hustlers.\n\nShe's not slowing down any time soon and recently announced on Instagram that new music in the works for 2020 with an album called Tiger Woods.", "description": "The 27-year-old rapper was dressed to thrill wearing an all-red ensemble for an off-road adventure on all terrain vehicles with her lover.", "authors": ["Tracy Wright For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/16/19845600-0-image-a-116_1571326628937.jpg", "published_at": "2019-10-17"}