{"pub": "reuters", "title": "Dechra ramps up contingency plan for a potential hard Brexit", "url": "https://uk.reuters.com/article/uk-dechra-pharma-brexit/dechra-ramps-up-contingency-plan-for-a-potential-hard-brexit-idUKKCN1VN0DW", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-02 09:08:21.603784+00:00", "text": "(Reuters) - Veterinary drugs producer Dechra Pharmaceuticals Plc (DPH.L) said on Monday it changed the ownership of all UK marketing authorisations to a new unit in the Netherlands, as it prepares for a potential hard Brexit.\n\nThe company said it shifted all the analytical testing methods for products made at its site in Skipton, England, to a new lab in Zagreb, Croatia and to its existing Bladel laboratory in southern Netherlands.\n\n“This will allow us to perform batch release within the EU in the likely event that there will be no mutual recognition of quality standards,” Dechra said in a statement.\n\nThe company said it had increased inventory in the supply chain to counter potential delays at ports and did not expect any material effect from the potential import or export tariffs.\n\nRisks related to Brexit include Britain potentially leaving the EU without a deal.\n\nBritish Prime Minister Boris Johnson recently announced plans to suspend parliament for more than a month ahead of an Oct. 31 deadline to take Britain out of the EU which he said he aimed to do with or without a deal.\n\nDechra did not disclose whether the new measures would impact jobs.\n\nThe company reported a 27% increase in full-year underlying operating profit to 127.4 million pounds ($156.41 million) and hiked its full-year dividend by 24% to 31.6 pence.", "description": "Veterinary drugs producer Dechra Pharmaceuticals Plc said on Monday it changed the ownership of all UK marketing authorisations to a new unit in the Netherlands, as it prepares for a potential hard Brexit.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png"}