{"pub": "aljazeera", "url": "https://aljazeera.com/ajimpact/hsbc-earnings-fall-short-expectations-lowers-forecast-191028045356950.html", "downloaded_at": "2019-10-28 13:29:07.618259+00:00", "title": "HSBC earnings fall short of expectations, lowers forecast", "language": "en", "text": "HSBC Holdings PLC on Monday warned of softer revenue growth in the year ahead after announcing a lower-than-expected quarterly pre-tax profit.\n\nThe bank also lowered a key growth target for next year, as it braces for a gloomier business outlook caused by a protracted trade war between China and the United States, easier borrowing conditions, unrest in its key market of Hong Kong and Brexit.\n\nMore:\n\nPre-tax profit at HSBC fell 18 percent to $4.8bn for the third quarter ended September 30, from $5.9bn a year earlier.\n\nThe results, announced in a statement by HSBC to the Hong Kong stock exchange, were lower than the $5.3bn average of analysts' estimates, according to the Reuters news agency.\n\nShares in Hong Kong-listed HSBC, which is Europe's biggest bank by assets, fell more than two percent as trading resumed after the midday break.\n\nInterim Chief Executive Noel Quinn flagged more changes ahead for the bank on Monday.\n\n\"Parts of our business, especially Asia, held up well in a challenging environment in the third quarter,\" he said in the earnings statement.\n\n\"However, in some parts, performance was not acceptable ... Our previous plans are no longer sufficient to improve performance for these businesses, given the softer outlook for revenue growth.\"\n\nHSBC cited a \"more challenging\" revenue outlook compared with the first half of this year.\n\nThe London-headquartered lender, which generates the bulk of its revenue and profit in Asia, said it would move capital away from low-return businesses and adjust its cost base.\n\n\"These actions, or any continuing deterioration in the revenue environment, could result in significant charges in [the fourth quarter of 2019] and subsequent periods, including the possible impairment of goodwill and additional restructuring charges,\" it said.\n\nThe Financial Times newspaper reported earlier this month that HSBC is planning to cut up to 10,000 jobs, or about four percent of its workforce, as part of its cost reduction plan. The cuts would be mainly targeted at highly-paid roles, the paper said citing two people briefed on the matter.\n\nThe results are the first under Quinn, and are widely seen by shareholders and insiders as a report card on his audition for the role full time.\n\nQuinn, 57, has made no secret that he is eager to secure the permanent appointment from Chairman Mark Tucker, who said in August the search for a CEO would take six to 12 months.\n\nA veteran of the bank since 1987, he was appointed to the interim role after John Flint left the post just 18 months after he began.\n\nHSBC had said then that a change to the bank's leadership was needed to address a \"challenging global environment\", the same day it announced a half-yearly rise in profit of 16 percent.\n\nQuinn faces the tough task of showing progress on HSBC's key priorities of further cost reduction and turning around its perennially underperforming US business.\n\nThe near- to medium-term outlook for the bank has also been clouded by the five-month-old anti-government protests in Hong Kong, its single-biggest profit centre.\n\nHong Kong is facing its first recession in 10 years as increasingly violent protests continue.\n\nBankruptcy petitions presented by debtors in Hong Kong rose nearly a fifth in the September quarter to 1,945 versus the same period a year earlier, government data showed.\n\nHSBC said its expected credit losses - including a \"charge to reflect the economic outlook in Hong Kong\" - increased by $400m in the third quarter. Revenue for the first nine months of the year in Hong Kong, however, rose seven percent.", "description": "US-China trade war, unrest in Hong Kong, Brexit and monetary policy easing are key factors dragging down the bank.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/7/d0142c1c9a9348c6ba43f4829349eebb_18.jpg", "published_at": "2019-10-28"}