{"pub": "washingtonpost", "url": "https://washingtonpost.com/realestate/blackburn-townhomes-has-several-units-for-sale-with-more-on-the-way/2019/09/16/2080b00e-d34b-11e9-86ac-0f250cc91758_story.html", "downloaded_at": "2019-09-17 11:25:36.305020+00:00", "title": "Blackburn Townhomes has several units for sale, with more on the way", "language": "en", "text": "\n\nBlackburn Townhomes in Manassas has more than 90 townhouses in the first section. About 90 have been sold. Six are for sale, starting at $392,990. (Benjamin C Tankersley/For The Washington Post)\n\nSabrina Beauchamp was decorating her kitchen one Wednesday morning, laying silk sunflowers atop the kitchen cabinets to create a border of orange and yellow blossoms.\n\nShe and her husband, Daniel, bought their townhouse all the way from West Africa, where they were living and working.\n\n“A year ago, we found out we were coming to D.C., so we started looking, and we quickly realized that renting inside the Beltway was unreasonably expensive. We just couldn’t do it,” Sabrina Beauchamp said. “We thought if we were going to pay that kind of rent, we might as well invest in ourselves.”\n\nThey looked at pictures and videos online. “One day Daniel was on his computer and yelled to me, ‘You’ve got to come here and see this place,’” she recalled. He had stumbled on Blackburn Townhomes in the Manassas area of Prince William County, Va.\n\n[They love the kitchen and the neighborhood cohesion of this new development in Odenton, Md.]\n\nAt first, they talked about buying a single-family house. “But then we recognized it was just two of us and a house was too much responsibility,” she said. “So we opted for a townhouse and got essentially the same square-footage for $100,000 less.”\n\nThe couple moved in August, and Daniel returned to work in early September. “It’ll take six months to get rid of all the boxes,” she said, “and we’re still waiting for our car to arrive from Africa, but we know for sure there’s more than enough room for us and our cats” — Fiona, 7, and Zeeba, 13.\n\n1 of 15 Full Screen Autoplay Close Skip Ad × Buying New | Blackburn Townhomes in Manassas, Va. View Photos The first section has more than 90 townhouses, several of which are still for sale, starting at $392,990. Caption The first section has more than 90 townhouses, several of which are still for sale, starting at $392,990. Benjamin C Tankersley/For The Washington Post Buy Photo Wait 1 second to continue.\n\nFlexible design: The three-story Blackburn Townhomes are part of a growing community in Prince William County about 35 miles southwest of the District. The first section, with more than 90 townhouses, is complete and mostly sold. Six are for sale. A second section, about the same size, is being developed now. Future amenities include a pool, clubhouse, fitness center and playground.\n\nThe six townhouses for sale have a Mozart or Strauss floor plan. Both are 20 feet wide, but the Mozart is 36 feet long and the Strauss, 42 feet long.\n\nThrough the front door of the Mozart model unit, you enter an open space that can be configured as a playroom, a lounge, an office or even a bedroom. A powder room is optional. Beyond is the two-car garage.\n\n[Light-filled rooms and convenient location among 11Q’s attractions]\n\nUp a flight of stairs is the open-plan living area, with the kitchen on one side and the living area on the other. The kitchen has a stove, counters and a refrigerator along one wall. The dishwasher and double sink are in the island. An optional deck can be built off the back of the townhouse and would be accessible through a double sliding glass door from the kitchen.\n\n\n\nThe kitchen is outfitted with Timberlake 42-inch maple cabinets and granite counters. (Benjamin C Tankersley/For The Washington Post)\n\nThree bedrooms occupy the top floor. The owner’s bedroom suite, with a private bathroom, is on one end, and two smaller bedrooms are on the opposite end. In between, the floor has a hallway bathroom and a closet wired for a washer and dryer.\n\nThe Beauchamps took advantage of an early buyer’s incentive program and selected several upgrades. For example, they had a four-foot extension added to the back of the townhouse and put a little office off the kitchen. They also got a much larger deck than is typical, 10 by 20 feet, with room for a table with chairs and more, including a grill and flower pots. “Other decks are half the size,” Sabrina Beauchamp said.\n\nWhat’s nearby: The city of Manassas, with many stores and other businesses, is close by. There’s a farmers market in historic Old Town Manassas. Virginia Gateway Shopping center, in Gainesville, is about a 10-minute drive.\n\nThe century-old aqua-colored water tower in Manassas is “so classic old town,” Sabrina Beauchamp said. “I love looking at it.”\n\nSchools: Sinclair Elementary, Stonewall Middle, Stonewall High.\n\nTransit: The community is about a mile from Interstate 66 and less than eight miles from the Virginia Railway Express Manassas Park station, with weekday commuter rail service to the District.\n\n\n\nThe Mozart model has a rear deck. One of the upgrades is a much larger deck, 10 by 20 feet, with room for a table with chairs and more, including a grill and flower pots. (Benjamin C Tankersley/For The Washington Post)", "description": "BUYING NEW | About 90 units have been sold already in the first section of the townhouse development in the Manassas, Va., area.", "authors": ["Audrey Hoffer", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/17MGHnDhmdz69VzGQ79RmpCnR_s=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/F3JZ4IWRUMI6TJRABKIWK3L5WY.jpg", "published_at": "2019-09-16"}