{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/warren-buffett-berkshire-hathaway-record-122-billion-cash-warns-crash-2019-8-1028476169", "downloaded_at": "2019-09-14 11:18:23.649377+00:00", "title": "Here's why Warren Buffett's record $122 billion cash pile could be a worrying sign for stock markets", "language": "en", "text": "Thomson Reuters\n\nWarren Buffett's mountain of cash may be a warning to investors that stocks are overvalued and that a crash is around the corner.\n\nThe investing guru's firm, Berkshire Hathaway, held a record $122 billion in cash at the end of June.\n\nThe conglomerate's cash is worth nearly 60% of its portfolio of public companies, the largest proportion since before the financial crisis.\n\nOne of Buffett's favorite yardsticks suggests the US stock market is more overvalued than it was at the height of the dot-com bubble and just before the financial crisis.\n\nWatch Berkshire Hathaway trade live.\n\nWarren Buffett's mountain of cash may be a warning to investors that stocks are overvalued and that a crash is around the corner.\n\nThe investing guru's Berkshire Hathaway conglomerate held a record $122 billion in cash at the end of June, funds that could be deployed to boost its holdings in Apple, Amazon, and Bank of America or used to acquire companies.\n\nBerkshire's cash pile is worth nearly 60% of its $208 billion portfolio of public companies. In the past 32 years, the group held more cash as a percentage of its portfolio only in the years leading up to the financial crisis of 2008, according to Bloomberg.\n\nOne reason Buffett might prefer to keep cash in the bank is that stocks are overvalued. The so-called Oracle of Omaha's favorite yardstick for the stock market — its capitalization as a percentage of gross domestic product — supports that claim.\n\nThat ratio reached 154% in 2017 — surpassing the 146% it notched at the height of the dot-com bubble in 2000 and the 137% it posted just before the financial crisis in 2007, Bloomberg said. Given the stock market's gains over the past 18 months, that percentage is undoubtedly even higher today.\n\nBerkshire Hathaway has been amassing cash for a while. The company boasted $111 billion at the end of June 2018, a record at the time. A crash didn't immediately follow, indicating the cash pile doesn't necessarily signal an imminent downturn.\n\nBuffett would prefer to put Berkshire Hathaway's cash to work in acquiring companies rather than buying stock, he wrote in his latest letter to shareholders. But current valuations are prohibitively high.\n\n\"We hope to move much of our excess liquidity into businesses that Berkshire will permanently own,\" he said. \"The immediate prospects for that, however, are not good: Prices are sky-high for businesses possessing decent long-term prospects.\"\n\n\"That disappointing reality means that 2019 will likely see us again expanding our holdings of marketable equities,\" he added. \"We continue, nevertheless, to hope for an elephant-sized acquisition.\"\n\nBuffett may just be waiting for a good deal, but if history is any guide, his cash hoard could signal a sell-off is coming soon.", "description": "Warren Buffett's mountain of cash may be a warning to investors that stocks are overvalued and that a crash is around the corner. The investing guru's fir...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d65084f2e22af0984230063-2400/rtx1bdps.jpg", "published_at": "2019-08-10"}