{"pub": "thehill", "url": "https://thehill.com/policy/international/466559-johnson-urges-uk-parliament-to-approve-brexit-deal", "downloaded_at": "2019-10-19 10:46:22.369531+00:00", "title": "Boris Johnson urges UK parliament to approve Brexit deal", "language": "en", "text": "British Prime Minister Boris Johnson urged members of parliament on Saturday to approve his Brexit deal ahead of a vote on the agreement for the U.K. to leave the European Union.\n\nJohnson implored parliament to pass the latest Brexit deal later in the day, saying the U.K. should \"move on and build a new relationship with our friends in the E.U.\"\n\n\"Now is the time for this great House of Commons to come together and bring the country together today,\" he said, \"as I believe people at home are hoping and expecting.\"\n\nADVERTISEMENT\n\nJohnson, who has vowed to remove the U.K. from the European bloc by an Oct. 31 deadline, called a further delay \"pointless, expensive and deeply corrosive of public trust.\"\n\nADVERTISEMENT\n\nThe prime minister needs a simple majority of 320 votes in parliament for his Brexit deal to pass, though it was unclear early Saturday if the measure would have enough votes.\n\nBritain's Labour Party has broadly opposed the newly negotiated Brexit plan, with opposition leader Jeremy Corbyn arguing Saturday that the plan is worse than a previous one negotiated under former Prime Minister Theresa May Theresa Mary May Boris Johnson says Brexit deal between UK, EU reached UK's Johnson sends EU 'final offer' on Brexit Saagar Enjeti warns 2020 Democrats against embracing Hillary Clinton MORE that failed.\n\nSaturday's vote comes after parliament voted three times on deals to withdraw from the E.U., with each one being voted down.\n\nCorbyn argued Saturday that the bill replaces protections for the environment and workers' rights with empty promises and would put the environment at risk.\n\n\"Labour is not prepared to sell out the communities that we represent, we are not prepared to sell out their future,\" he told parliament.\n\nThe rare Saturday vote is happening after Johnson secured the Brexit deal with the E.U. earlier this week.\n\nE.U. Council President Donald Tusk said Thursday that the major difference between the deal negotiated by Johnson and that for May was \"Johnson's acceptance to have customs checks at the point of entry to Northern Ireland.\"\n\nTusk said the new deal will \"avoid border checks\" between the Republic of Ireland and Northern Ireland.\n\nJohnson on Saturday cast his deal as a way to \"take back control\" of Britain's borders and to build on a peace agreement that helped curb violence in Northern Ireland.", "description": "British Prime Minister Boris Johnson urged members of parliament on Saturday to approve his Brexit deal ahead of a vote on the agreement for the U.K. to leave the European Union.", "authors": [], "top_image": "https://thehill.com/sites/default/files/johnsonboris_101919getty.jpg", "published_at": "2019-10-19"}