{"pub": "businessinsider", "url": "https://businessinsider.my/tony-fernandes-has-started-succession-planning-and-is-retiring-from-all-board-positions-except-airasia-and-airasia-x", "downloaded_at": "2019-09-19 09:41:23.885292+00:00", "title": "Tony Fernandes has started succession planning – and is retiring from all board positions, except AirAsia and AirAsia X", "language": "en", "text": "He said his board positions would go to “young amazing leaders” and help move “the next generation of AirAsia leaders to the forefront”. Reuters\n\nTony Fernandes is stepping down from all his board positions, except those in AirAsia Group and AirAsia X.\n\nThe AirAsia founder said in a series of tweets on Wednesday (Sept 18) that he would remain CEO of AirAsia Group and Airasia.com, the company’s new e-commerce app.\n\nAs the first step of stepping back and moving the next generation of @airasia leaders into the forefront I will be stepping down of all boards except @airasia group and airasia X. — Tony Fernandes (@tonyfernandes) September 18, 2019\n\nAlmost 19 years. 2 planes to 270 planes. So many people against us. But boy 600 million people have benefitted from our fighting for what’s right, not accepting monopolies, but unfortunately many people dislike me but hey you do what you think is right. — Tony Fernandes (@tonyfernandes) September 18, 2019\n\nFor clarity. I will remain on the board of @airasia and airasia x. And CEO of airasia group and ceo of https://t.co/KkvaO25LYW — Tony Fernandes (@tonyfernandes) September 18, 2019\n\nRest of my positions in the boards and management will go to my young amazing leaders. So so many of them. Leadership is about succession planning always giving youth a chance. #succession — Tony Fernandes (@tonyfernandes) September 18, 2019\n\nWhile he did not specify which board positions he was stepping down from and when, AirAsia also owns subsidiaries including Redbeat Ventures, RedCargo, and BigPay.\n\nFernandes’ announcement comes after AirAsia restructured its leadership team last month, Bloomberg reported.\n\nHe said his board positions would go to “young amazing leaders” and help move “the next generation of AirAsia leaders to the forefront”.\n\n“Leadership is about succession planning (and) always giving youth a chance,” he added.\n\nApart from AirAsia, the entrepreneur still sits on the boards of companies like Warner Music Malaysia and Tune Group.\n\nRead also:", "description": "Business Insider - He said his board positions would go to “young amazing leaders” and help move “the next generation of AirAsia leaders to the forefront”.. Read more at businessinsider.my", "authors": ["Rachel Genevieve Chia"], "top_image": "https://static.businessinsider.my/sites/3/2018/03/reuters-tonyfernandes-AIRASIA-DEAL.jpg", "published_at": "2019-09-19"}