{"pub": "investing.com", "url": "https://investing.com/news/stock-market-news/us-states-fight-back-against-purdues-bid-to-halt-opioid-lawsuits-1991934", "downloaded_at": "2019-10-05 00:12:04.697354+00:00", "title": "Sacklers reaped up to $13 billion from OxyContin maker, U.S. states say", "language": "en", "text": "© Reuters. FILE PHOTO: A bottle of prescription painkiller OxyContin, 40mg pills, made by Purdue Pharma L.D. sit on a counter at a local pharmacy in Provo\n\nBy Nate Raymond\n\n(Reuters) - OxyContin maker Purdue Pharma LP steered up to $13 billion in profits to the company's controlling Sackler family, according to U.S. states opposing efforts to halt lawsuits alleging the company and its owners helped fuel the U.S. opioid epidemic.\n\nThe wealthy Sacklers received the money from Purdue during an unspecified time frame, according to court filings and portions of a deposition filed in the drugmaker's bankruptcy proceedings this week.\n\nPurdue ultimately transferred $12 billion or $13 billion to the family, a company adviser testified in the deposition. The deposition, taken last week, was revealed in court filings on Thursday and Friday.\n\nThe financial figure is significantly larger than the roughly $4 billion previous lawsuits have alleged the Sacklers took out of Purdue, and was cited as part of a coordinated legal broadside on Friday against the company's attempts to shield itself and the family from sprawling opioid litigation.\n\nMany states want the Sacklers to contribute more than an initial $3 billion they have pledged toward resolving the lawsuits.\n\nAttorneys general from 24 states and the District of Columbia objected to Purdue's September request that a U.S. bankruptcy judge halt more than 2,600 lawsuits seeking billions of dollars in damages, and they raised financial transfers to the Sacklers in their legal arguments.\n\nSo, too, did lawyers representing 500 cities, counties and Native American tribes involved in the opioid litigation.\n\nSackler representatives did not immediately respond to requests for comment. A Purdue spokeswoman had no immediate comment. The company and family have denied allegations they contributed to the U.S. opioid crisis.\n\nThe lawsuits, largely brought by state and local governments, allege Purdue and the Sacklers contributed to a public health crisis that has claimed the lives of nearly 400,000 people since 1999 by aggressively marketing opioids while downplaying their addiction and overdose risks.\n\n\"The Sacklers are billionaires, they are not bankrupt,\" Massachusetts Attorney General Maura Healey, among the officials opposing Purdue's efforts to halt lawsuits, told Reuters in an interview. \"They should not be allowed to use the filing to shield their assets.\"\n\nPurdue filed for Chapter 11 bankruptcy protection last month after reaching a deal it valued at more than $10 billion that would resolve the bulk of the cases against the company and the Sacklers.\n\nThe company contends it needs the litigation against it and the Sacklers paused for about nine months so it can attempt to settle with hold-out plaintiffs and preserve money that would otherwise be spent fighting the cases.\n\nPurdue said the costs of continued litigation were \"staggering,\" putting its legal expenses this year at nearly $250 million.\n\n\"Without a stay of the litigation, only lawyers will win,\" the company said in a statement.\n\nTypically, a bankruptcy filing triggers an \"automatic stay\" of all litigation without a specific order from a judge.\n\nHowever, Purdue is seeking an injunction to stop the lawsuits because the Sacklers did not seek bankruptcy protection and there is an exception to the automatic stay for government actions that seek to enforce laws related to public health and safety.\n\nHealey said the exception gives the states a strong argument to move forward with their cases against the OxyContin maker. \"We're exercising our police power and have the right to do so,\" she said.\n\nThe Sacklers have offered to cede control of Purdue to the plaintiffs and contribute $3 billion, and potentially more through the sale of another pharmaceutical business they own, toward the proposed settlement. Purdue is also in discussions to resolve a U.S. Justice Department probe that could carry a financial penalty.\n\nHealey said the Sacklers should increase their contribution and she criticized the structure of the deal, which is premised in part on the continued sale of OxyContin, a drug that critics say helped launch the nation's opioid addiction crisis.", "description": "Sacklers reaped up to $13 billion from OxyContin maker, U.S. states say", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF930V8_L.jpg", "published_at": "2019-10-04"}