{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/best-coffee-shops-to-get-work-done-without-wework", "downloaded_at": "2019-09-27 15:05:42.220724+00:00", "title": "NO WEWORK? NO PROBLEM: Here are the best coffee shops to get your work done if you can’t afford a coworking space", "language": "en", "text": "Business Insider went to different coffee shops and cafes across Manhattan to figure out the best places to get done without a WeWork membership.\n\nWe ranked our experiences by the noise level, availability of outlets and bathrooms, and WiFi speed.\n\nAu Bon Pain and Starbucks took the top spots.\n\nVisit Business Insider's homepage for more stories.\n\nWith WeWork in tumult and more people than ever working from home, remote workers face a dilemma: Where can they actually get their tasks done?\n\nA \"hotdesk\" membership at a WeWork, which according to the company's website is targeted at individuals who need full-time access to a coworking space and lets them work in any of WeWork's coworking spaces, still comes with a steep pricetag. In New York, it will cost you $470 per month.\n\nWith that in mind, two Business Insider reporters spent a day doing their typical work — everything from editorial planning calls to writing stories — at six different coffee shops across Manhattan.\n\nWhile the company based in New York City, the reporters only spent time in coffee shops that are national chains (and some are international). Because the time spent in the shops were during the busier parts of the city, the experience probably varied from those of smaller cities or quieter parts of the Big Apple.\n\nBecause Business Insider wanted to cover as many spots as possible while spending enough time in each to get a feel for a working environment, two different reporters checked out three sites each. Juliana took upper and midtown Manhattan (and many selfies), while Allana stayed downtown and was too shy to take any selfies.\n\nRead more: Adam Neumann leaves a global empire of coworking spaces. These are the cities with the most WeWork offices, and how much they cost.\n\nThe reporters evaluated the coffee shop experiences on four different criteria: the noise and ambience of the store, the availability of outlets and seats, bathroom availability, and WiFi. Each category was ranked on a scale of five stars, with those scores averaged to find the winners.\n\nAlong the way, we had a few surprises — both positive and negative. From a shockingly good iced coffee to a conference call in Dunkin', here's what we learned.", "description": "We ranked our experiences by the noise level, availability of outlets and bathrooms, and WiFi speed.", "authors": ["Allana Akhtar", "Juliana Kaplan"], "top_image": "https://image.businessinsider.com/5d8cc4f92e22af5d236b4582?width=1200&format=jpeg", "published_at": "2019-09-27"}