{"pub": "cbc", "url": "https://cbc.ca/news/entertainment/emmy-awards-2019-emmys-1.5293430", "downloaded_at": "2019-09-23 01:33:06.833358+00:00", "title": "Marvelous Mrs. Maisel picks up early wins as Emmy Awards celebrate best of TV | CBC News", "language": "en", "text": "Alex Borstein and Tony Shalhoub of The Marvelous Mrs. Maisel won best supporting acting awards at Sunday's Emmy Awards, which included early and varied messages of female empowerment after the host-less ceremony kicked off with Homer Simpson.\n\n\"I want to dedicate this to the strength of a woman, to [series creator] Amy Sherman-Palladino, to every woman on the Maisel cast and crew,\" Borstein said, and to her mother and grandmother. Her grandmother survived because she was courageous enough to step out of a line that, Borstein intimated, would have led to her death at the hands of Nazi Germany.\n\n\"She stepped out of line. And for that, I am here and my children are here, so step out of line, ladies. Step out of line,\" said Borstein, who won the award last year.\n\nShalhoub added to his three Emmys which he earned for his signature series in Monk.\n\nPhoebe Waller-Bridge, creator and star of Fleabag, captured an early award best writing for a comedy. The award for the dark comedy about a dysfunctional, sex-addicted woman is proof \"a dirty, pervy, messed-up woman can make it to the Emmys,\" said Waller-Bridge.\n\nMoments later, Waller-Bridge won the best comedy actress honour. \"Noooo. Oh my God. Nooo,\" she said. \"I find acting really hard, and really painful.\"\n\nWaller-Bridge beat out Veep star Julia Louis-Dreyfus, who had she won would have become the most-honoured performer in Emmy history.\n\n'Television has never been bigger'\n\nThe awards opened without a host as promised Sunday, with an early exchange pitting Ben Stiller against Bob Newhart.\n\n\"I'm still alive,\" Newhart told Stiller, who introduced him as part of a wax museum comedy hall of fame that included Lucille Ball and other late legends.\n\nAn animated Homer made a brief appearance on stage until he was abruptly crushed, with Anderson of black-ish rushing in to, as he vowed, rescue the evening. He called Breaking Bad star Cranston on stage to tout the power of television from its beginning to the current golden age.\n\n\"Television has never been bigger. Television has never mattered more. And television has never been this damn good,\" Cranston said.", "description": "Alex Borstein and Tony Shalhoub of The Marvelous Mrs. Maisel won best supporting acting awards at Sunday's Emmy Awards.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5293495.1569200575!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/2019-primetime-emmy-awards-show.jpg", "published_at": "2019-09-23"}