{"pub": "euronews", "url": "https://euronews.com/2019/10/26/thousands-join-first-pride-march-in-taiwan-since-same-sex-marriage-was-legalised", "downloaded_at": "2019-10-27 00:43:42.658249+00:00", "title": "Thousands join first pride march in Taiwan since same-sex marriage was legalised", "language": "en", "text": "Thousands join first pride march in Taiwan since same-sex marriage was legalised\n\nMore than 100,000 people thronged the streets of Taiwan's capital Taipei on Saturday (October 26) for East Asia's largest Pride march, months after the self-ruled island began formally allowing same-sex marriage, the first place in Asia to do so.\n\nProudly democratic Taiwan is a bastion of liberal values in a part of the world where in many countries homosexuality remains illegal.\n\nSince legalisation on May 24, more than 2,150 same-sex couples have married in Taiwan, government data shows.\n\nOrganisers say more than 200,000 people were set to march in a parade that will end outside the Presidential Office.\n\nChi Chia-wei, an activist who brought a case to Taiwan's constitutional court that led to a landmark court ruling on same-sex marriage in 2017, told Reuters that everyone was extremely happy.\n\nSame-sex marriage remains illegal in Taiwan's giant neighbour China, which claims Taiwan as its sacred territory and has never renounced the use of force to bring the island under Beijing's control.\n\nLate last year, Taiwanese voters opposed same-sex marriage in a series of referendums, defining marriage as being between a man and a woman in civil law.", "description": "More than 100,000 people thronged the streets of Taiwan's capital Taipei on Saturday (October 26) for East Asia's largest Pride march, months after the self-ruled island began formally allowing same-sex marriage, the first place in Asia to do so.", "authors": [], "top_image": "https://static.euronews.com/articles/stories/04/26/06/14/1000x563_cmsv2_fd3eadaf-a1ec-5f1a-89ff-c6208dc24863-4260614.jpg", "published_at": "2019-10-26"}