{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7557599/Sienna-Miller-37-puts-cosy-display-beau-Lucas-Zwirner-28-American-Woman-screening.html", "downloaded_at": "2019-10-10 08:37:21.644377+00:00", "title": "Sienna Miller, 37, puts on cosy display with beau Lucas Zwirner, 28, after American Woman screening", "language": "en", "text": "She's been busy promoting her new drama film across the globe.\n\nAnd Sienna Miller, 37, was supported by her boyfriend Lucas Zwirner, 28, at the special screening of her film American Woman in London on Wednesday night.\n\nThe actress, 37, and writer, 28, appeared in good spirits as they headed home together after the star-studded event.\n\nSweet: Sienna Miller, 37, was supported by her boyfriend Lucas Zwirner, 28, at the special screening of her film American Woman in London on Wednesday night\n\nSienna looked sensational for the event in a 70s inspired look for her outing, wearing an asymmetrical brown dress teamed with a pair of electric blue boots.\n\nShe wore her hair down in perfectly coiffed waves and enhanced her pretty features with heavy bronzer and dark kohl.\n\nMeanwhile Lucas looked dapper in a pair of navy chinos with a matching jumper, white shirt and a black duffle coat.\n\nCosy: The actress, 37, and writer, 28, appeared in good spirits as they headed home together after the star-studded event\n\n70s-chic: Sienna looked sensational for the event in a 70s inspired look for her outing, wearing an asymmetrical brown dress teamed with a pair of electric blue boots\n\nThe couple, who met through mutual friends in New York, went public with their romance last year when they attended her ex Tom Sturridge's birthday party in London together.\n\nLucas, who currently oversees 25 book releases a year as editorial director of David Zwirner Books, is a Yale-educated literature aficionado.\n\nSienna's outing comes after the beauty called out 'liberal fascism' in dictating that only certain actors can play minority ethnic and gay roles, insisting 'everybody should be able to play everybody'.\n\nGorgeous: She wore her hair down in perfectly coiffed waves and enhanced her pretty features with heavy bronzer and dark kohl\n\nSmitten: The couple, who met through mutual friends in New York, went public with their romance last year when they attended her ex Tom Sturridge's birthday party in London together\n\nTalented: Sienna's beau Lucas, who currently oversees 25 book releases a year as editorial director of David Zwirner Books, is a Yale-educated literature aficionado\n\nDuring an interview the American-British actor, she opened up about her opinions on the film industry, criticising the 'whitewashing' of roles.\n\nShe weighed in on the debate about which roles actors should be able to play in terms of ethnic minority, gay and transgender characters.\n\nMiller told The Telegraph: 'It feels like liberal is becoming almost fascistic in its controlling of what can and cannot be done. It feels dangerous to me.'\n\nGorgeous: Sienna dared to be different in her beige frock, which boasted chocolate coloured stripes and a matching collar\n\nChic: The striking blonde added a pop of colour to her outfit thanks to her statement suede boots\n\nRock and roll: Sienna rubbed shoulders with Oasis rocker Noel Gallagher\n\nDapper: Meanwhile Lucas looked dapper in a pair of navy chinos with a matching jumper, white shirt and a black duffle coat\n\nSartorially-savvy: Mary Charteris cut a stylish figure in a button coat and suede brown boots\n\nRoyalty: Princess Eugenie of York (right) joined the girls for a snap\n\nRegal: Princess Eugenie also posed for a photo with Gala Gordon\n\nSmitten: Nick Grimshaw also attended the event and looked smitten as he walked hand-in-hand with his boyfriend Meshach Henry\n\nShe added that we should be able to make our own decisions about what we want to see and that it starts to feel 'complicated' when you start to legislate on what roles you can and cannot play.\n\nIn the interview she also opened up about how the MeToo movement has 'intersected unhappily with her own life'.\n\nMiller revealed she used to call Harvey Weinstein 'Pops' and said 'on some level' she did this to deflect her suspicions about him.\n\nRubbing shoulders: The royal also mingled with Sienna's boyfriend Lucas\n\nQuirky: Jess Morris showcased her kooky style as she also attended the American Woman screening", "description": "The actress, 37, and writer, 28, appeared in good spirits as they headed home together after the star-studded event.", "authors": ["Olivia Wheeler For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/08/19527752-0-image-a-4_1570692746315.jpg", "published_at": "2019-10-10"}