{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/da-cape-town-motion-of-no-confidence-against-jp-smith-suspended-20191014", "downloaded_at": "2019-10-14 23:33:17.320364+00:00", "title": "DA Cape Town motion of no confidence against JP Smith suspended", "language": "en", "text": "DA Cape Town caucus deputy leader JP Smith has dodged a motion of no confidence after it was withdrawn on Monday.\n\nDA Western Cape leader Bonginkosi Madikizela told News24 the motion was suspended.\n\n\"We agreed on mediation,\" Madikizela said.\n\nSmith was, according to a letter calling for the motion, accused of \"destructive behaviour\" and driving disunity within the caucus, IOL reported.\n\nIt was alleged that during this year's election campaign, Smith led meetings that \"plotted against\" and planned the \"removal\" of DA metro regional chairperson Grant Twigg.\n\nLast week, Twigg survived a motion of no confidence himself after being accused of not differentiating between party and state, as well as abusing his official position as a Mayco member in order to be re-elected, EWN reported.\n\nSmith told IOL the motion against him was a form of \"retaliation\" and \"tit for tat\".\n\nHe charged he had been through this before and people \"will come after you\" when you \"stand up and speak out\".\n\nAccording to the Mail and Guardian, the motion tabled by Courtney van Wyk noted findings of the Steenhuisen report into tensions in the party in the metro, which he charged found Smith at the \"centre of heightened tensions and disunity within the caucus\".\n\nThe motion read that several formal complaints of destructive and egregious behaviour had been reported to the caucus executive.\n\nOn Monday morning, Smith told News24 it was an \"internal caucus matter and in terms of caucus discipline I am not entitled to discuss it\".\n\n- Compiled by Tammy Petersen", "description": "The DA Cape Town caucus deputy leader JP Smith dodged a motion of no confidence after it was withdrawn.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7637/aa30063cbd79460e80df6fee82fa906c.jpg", "published_at": "2019-10-14"}