{"pub": "theverge", "url": "https://theverge.com/2019/10/18/20918732/oneplus-7t-pro-review-specs-features-price-camera-battery-life", "downloaded_at": "2019-10-18 07:05:48.219764+00:00", "title": "OnePlus 7T Pro review: small updates make a great phone slightly better", "language": "en", "text": "In the right circumstances, there’s nothing wrong with a minor spec bump, especially when it comes just six months after the device it’s improving on. That’s exactly what OnePlus has done with the £699 OnePlus 7T Pro, a newly upgraded version of the OnePlus 7 Pro from earlier this year. It’s coming to Europe and Asia but not the US.\n\nIf you’ve already read The Verge’s OnePlus 7T review, you’ll know what sort of improvements to expect from the Pro model. There’s a new macro camera mode, a bigger battery, and the phone’s processor is also slightly faster at rendering graphics. There’s nothing mind-blowing here, but it’s also a list of improvements that’s been added without having to make any compromises.\n\nThen again, if you’ve already read our OnePlus 7T review, you’ll also know that we called that phone “the best of the 7 Pro, for less” because with it, OnePlus took the Pro’s super-slick 90Hz refresh rate, and included it on a device that costs between $70 and $100 less. The OnePlus 7T Pro is objectively a better phone than the OnePlus 7 Pro, but it’s now got much stronger competition from its own maker in the form of the OnePlus 7T.\n\nOur review of OnePlus 7T Pro Verge Score 8.5 out of 10 Good Stuff Screen is still amazing\n\nBattery is still great\n\nCharges super fast Bad Stuff You can get a better camera for less\n\nNo wireless charging or official IP rating\n\n90Hz display no longer a OnePlus exclusive\n\nThe OnePlus 7T Pro is a very similar device to the OnePlus 7 Pro that was released earlier in the year. In fact, if you go back and read our OnePlus 7 Pro review from May, almost all of the points still apply to this new device.\n\nIn particular, the 7T Pro’s OLED screen is every bit as stunning as it was on the 7 Pro. It’s still got a super-smooth 90Hz refresh rate, it’s still super crisp, colorful, and bright, and it still curves elegantly around the edges of the device. It’s also still completely notchless, thanks to the phone’s small 16-megapixel pop-up selfie camera and an in-display fingerprint scanner that’s still wicked fast.\n\nWhen it comes to the changes OnePlus has made to the new phone, they can be a little hard to quantify. Take the processor spec bump as an example. OnePlus has equipped its latest device with a Qualcomm Snapdragon 855 Plus processor, which, in theory, means it’s 15 percent faster at rendering graphics.\n\nAgree to Continue: OnePlus 7T Pro Every smart device now requires you to agree to a series of terms and conditions before you can use it — contracts that no one actually reads. It’s impossible for us to read and analyze every single one of these agreements. But we’re going to start counting exactly how many times you have to hit “agree” to use devices when we review them since these are agreements most people don’t read and definitely can’t negotiate. While you’re setting up the OnePlus 7T Pro, you need to agree to the following in order to use your phone: OnePlus’ terms and conditions, End User License Agreement, and privacy policy\n\nGoogle Account terms and conditions Additionally, there are a couple of optional agreements that you need to get past during setup: Participation in the User Experience Program\n\nSystem stability reporting\n\nPush notifications for surveys and product updates\n\nBuilt-in app updates for the phone, contacts, and settings apps That leaves us with four mandatory agreements and four optional agreements for the OnePlus 7T Pro.\n\nIn practice, however, the actual improvement is hard to discern. What I will say is that I never once experienced slowdown while using the phone. The recently released Call of Duty: Mobile ran brilliantly, despite the phone’s high-resolution 1440p display, and there were no hiccups as I switched between apps. Is this an improvement over the 7 Pro? It’s hard to say, but I’m certainly not complaining.\n\nIt’s a similar story when it comes to battery life. The OnePlus 7T Pro has a 4,085mAh battery, which is technically a whole 85mAh more than the 7 Pro. Does this make a measurable difference? Who cares. What matters is that I struggled to drain the phone by more than 50 percent in a day. When I let the phone run down to zero, I found that it lasted me from 8AM until 4PM the following day. These were two comparatively light days of usage filled with mainly email reading and Twitter browsing, but you get the idea.\n\nThe OnePlus 7T Pro uses the company’s new Warp Charge 30T, which is apparently 23 percent faster than the Warp Charge 30 standard found in the 7 Pro. It works well, and it could charge my device quickly without it getting excessively warm. When charging a completely powered-down device, I found that I got 28 percent of charge after just 12 minutes, 46 percent after 20 minutes, 96 percent after an hour, and I was left with a fully charged device roughly one hour and five minutes after plugging it in. It’s still a bummer that OnePlus is using its own proprietary fast-charging technology (so you won’t get these same results from third-party chargers), but at least it works well.\n\nThe camera hardware inside the 7T Pro is basically unchanged from the 7 Pro, so I’m not going to spend too much time covering old ground. We went over this triple-camera array pretty extensively in our original 7 Pro review as well as when we compared it to the Pixel 3A. Suffice it to say, you’ll get reasonable photos out of the OnePlus 7 Pro, but they won’t be class-leading like the Pixel’s photos.\n\nThat’s not to say the camera is completely unchanged, though, because the OnePlus 7T Pro has inherited a couple of tricks from the 7T. There’s a new macro mode that will let you focus on objects that are as little as 2.5cm away, and the Nightscape mode now works when you’re using the wide angle camera. Both modes produce reasonable images, but it’s nothing mind-blowing.\n\nGrid View The phone’s new macro mode can take photographs of subjects from as little as 2.5cm away, although getting a good shot can be tricky. Photo by Jon Porter / The Verge\n\nThe phone’s night photography mode now works when using the ultra-wide angle camera.\n\nThis photo was also taken using the ultra-wide angle camera, but without the night photography mode enabled. Photo by Jon Porter / The Verge\n\nPhoto by Jon Porter / The Verge\n\nThe telephoto lens on the phone offers up to 3x optical zoom. Photo by Jon Porter / The Verge\n\nWhile the phone’s wide-angle lens has 117-degree field of view. Photo by Jon Porter / The Verge\n\nPhoto by Jon Porter / The Verge\n\nPhoto by Jon Porter / The Verge\n\nPhoto by Jon Porter / The Verge\n\nPhoto by Jon Porter / The Verge\n\nPhoto by Jon Porter / The Verge\n\nPhoto by Jon Porter / The Verge\n\nPhoto by Jon Porter / The Verge\n\nTaken with the phone’s wide-angle lens. Photo by Jon Porter / The Verge\n\nIn terms of software, you’re getting the same OxygenOS-flavored version of Android 10 that was present on the OnePlus 7T, and you can get a full rundown of its features in our previous review.\n\nThe OnePlus 7T Pro is every bit the great phone that the One Plus 7 Pro was when it released earlier this year. While a lot of upgrades — like its bigger, faster-charging battery and faster processor — are minor, none of them come with any noticeable downsides. In pretty much every way, the 7T Pro is a better device than the 7 Pro was — although the difference is small enough that I don’t think any 7 Pro owners out there need to worry about upgrading.\n\nIt’s a better device, but I don’t know if that means it’s the better purchasing decision. Last time around, you basically had to buy the OnePlus 7 Pro if you wanted its lovely high refresh rate screen. But this time, you can get a 90Hz display on the OnePlus 7T, and it costs £150 less. Sure, if you opt for it, you’ll have to put up with a notch, a lower resolution display, and a screen that doesn’t curve around the edges of your device, but those seem like reasonable compromises considering the price difference. There’s also the recently announced Google Pixel 4. At £669, it doesn’t offer you as much savings, and it’s got much bigger screen bezels, but given Google’s track record, it could get you a better camera.\n\nThe OnePlus 7T Pro is a high-spec phone with a reasonably good camera at a price that’s still cheaper than many other flagships. I don’t think it’s quite the steal it was now that the OnePlus 7T has inherited what I think is the 7 Pro’s best feature, its 90Hz refresh rate. But if you want to make sure you’re getting the absolute best phone that OnePlus currently produces (and one of the best smartphone screens, full stop), then the 7T Pro could yet earn its price premium.\n\nPhotography by Jon Porter / The Verge", "description": "OnePlus has updated its latest pro device with the new OnePlus 7T Pro. It features a minor spec bump and some improved camera features. Otherwise, this is a very similar device to the one OnePlus model that was released six months ago.", "authors": ["Jon Porter", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/l2Ad2_99hbkCZw0k78ffJ64x-Fo=/0x292:2040x1360/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19271033/jporter_191008_3717_0006.jpg", "published_at": "2019-10-18"}