{"pub": "bbc", "url": "https://bbc.com/news/world-us-canada-49645951", "downloaded_at": "2019-09-10 23:28:01.992345+00:00", "title": "'Lady M' cakes: Delivery man in hot water over alleged thefts", "language": "en", "text": "Image copyright Getty Images Image caption Mille crêpes cakes are made up of layers of delicately thin pancakes and cream\n\nA New York delivery driver who had access to a warehouse full of high-end cakes worth $90 (£73) each is accused of stealing them to resell for profit.\n\nDavid Lliviganay is alleged to have stolen some $90,000 worth of Lady M Confections' cakes.\n\nThe company is famous for its signature Mille Crêpes cake, popular with celebrities and on Instagram.\n\nMr Lliviganay is said to have stolen more than 1,000 of the pastries over a period of months.\n\nHe pleaded guilty to petty larceny earlier this year and is due to be sentenced later this month, but a new civil lawsuit has been filed in New York by the pâtisserie owners, The New York Times reports.\n\nAccording to the lawsuit, Mr Lliviganay took cakes from the company's freezers, starting in November last year until February this year, and sold them on to other vendors.\n\nHe was caught on surveillance camera taking cakes on several occasions, according to court papers.\n\nThe company learned of the scheme when it found out the crêpe cakes were being resold at a discount, the lawsuit alleges. It is seeking to recover the cost of the missing cakes as well as damages.\n\nThe coveted Mille Crêpes cakes, which can be worth up to $90 a pop, are made up of a stack of thin pancakes, layered with cream.\n\nThe high-end bakery - which has been featured in Oprah Winfrey's magazine and on Martha Stewart's show - began life in New York in 2002 and now has outlets in the US and Asia.\n\nYou may also be interested in:", "description": "He is alleged to have stolen some $90,000 worth of the highly Instagrammable Lady M Confections pastries.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/65A7/production/_108732062_gettyimages-588184736.jpg", "published_at": "2019-09-10"}