{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/teacher-dies-after-being-bitten-20759789", "downloaded_at": "2019-10-30 23:19:37.183633+00:00", "title": "Teacher dies after being bitten by insect while on Vietnam holiday during half term", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA popular history teacher died after falling ill on his first day back at school following a holiday in Vietnam.\n\nMedics believe 27-year-old Josh Brooker developed a blood infection caused by an insect bite.\n\nTributes have been paid to the teacher, who worked at the Hope Academy in Newton-le-Willows, the Liverpool Echo reports .\n\nJosh's dad James, 57, from Somerset, said the illness was unexpected and described him as \"kind, thoughtful, and gentle.\"\n\nHe fell ill shortly after returning to work on the first day of term after the school holidays when he developed feverish symptoms.\n\n(Image: Josh Brooker)\n\nJosh was admitted to the Liverpool Royal Hospital on September 3 and placed into intensive care after the infection affected his lungs.\n\nHe was then transferred to Wythenshawe Hospital in Manchester where his condition deteriorated.\n\nDoctors told his family that the staphylococcus bacteria that caused the infection is likely to have entered Josh's bloodstream due to the insect bite.\n\nOn 1 October, after spending almost a month in hospital, Josh passed away in intensive care at Wythenshawe Hospital.\n\nDad James said: \"Josh developed a bacterial infection from an insect bite. It got into his bloodstream which and caused abscesses close to his spine and in his lungs.\n\n\"He went travelling there on his own for the length of the school summer holidays. When he came back he told me it was the best thing he'd ever done.\n\n(Image: Josh Brooker)\n\n\"I picked him up from Manchester airport and he said he felt a bit under the weather and he had a bit of a cold.\n\n\"He came back and we didn't think much of it and he went back to work.\n\n\"He went in to school for an inset day but he said he began to feel really rough.\n\n\"The next day he tried to get a GP appointment but he could only get one that evening so he went to A&E.\n\n\"Josh's sister called me the next day told me that Josh was in hospital with an infection.\n\n\"Staff at the hospital noticed that he had an insect bite on his head which had become very sore and infected.\n\n\"A few days later he had to be sedated and was placed in intensive care.\n\n\"The infection gradually wore his body down and it then attacked his lungs and he became unable to breathe on his own.\n\n\"We were there every day by his side until the end. It was horrific. No parent should have to see their child die.\"\n\n(Image: Josh Brooker)\n\nJames said: \"The staff at the Royal and at Wythenshawe Hsopital were uniformly superb and I want to thank them for everything they did to try and save Josh. They did absolutely everything they could. \"\n\nJosh moved to Liverpool as a student, studying at the University of Liverpool before he graduated in 2014.\n\nHe trained to become a teacher at Liverpool Hope University and lived in the city.\n\nJames added: \"Josh was kind, thoughtful, and gentle. He was fun and he had a great sense of humour. His friends say he would always be up for a party but he was the sensible one.\n\n\"He fell in love with Liverpool when we took him here to the University open day. He never wanted to be anywhere else.\"\n\nJosh's family also thanked staff and students at the Hope Academy school .\n\nJames said: \"The school has been just brilliant.\n\n\"When Josh was in hospital I started writing emails to the school to update them on what was happening.\n\n\"The headteacher invited us to the school to meet Josh's colleagues and to see his classroom. That was a lovely thing for us because we had never seen where he worked.\n\n\"The way the school has gone about celebrating his life is incredible. They made a prayer wall with post-it notes where students have written kind messages.\n\n\"The school also sent us a memories box which the students and staff have written messages in which have helped us to grieve.\n\n\"Some of those are heartbreaking and made us cry. Some of them made us laugh out loud.\n\n\"A couple of weeks ago they held a celebration devoted to Josh that was themed around his life. They had a week of it and sent stuff on to us.\n\n\"It's the most lovely thing to know how much he touched the lives of others and it has really helped us.\n\n\"He loved working with the kids there and he would always talk about them in such a loving way.\"\n\nJames told the ECHO that the family is raising money for the Hope Care Fund, which helps provide after school activities for disadvantaged pupils, in Josh's memory.\n\nHe added: \"The Hope Care Fund is in line with Josh's passions. It supports disadvantaged pupils through after school sports clubs and gardening.\n\n\"Josh was passionate about supporting the physical and emotional wellbeing of the pupils and this is something he deeply cared about.\"\n\nMarie Adams, Head of School at the Hope Academy told the Liverpool Echo: \"Josh was part of our extended family. He was caring, kind and brought joy to his colleagues and students.\n\n\"Although taken far too soon, Josh accomplished many things in the time he spent with us- and these are the reasons why his memory will live on at Hope Academy and our wider community.\n\n\"Our thoughts and prayers are with his family and friends at this very difficult time.\"\n\nA link to the Hope Care fundraiser in Josh's memory can be found here .", "description": "Tragic Josh Booker, 27, was bitten in Vietnam but fell ill on his first day back at school in Newton-le-Willows in Merseyside", "authors": ["Max Clements", "Image", "Josh Brooker"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20760029.ece/ALTERNATES/s1200/0_Josh-Brooker.jpg", "published_at": "2019-10-30"}