{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/off-guard-vinny-magalhaes-says-pfl-saved-his-career-video", "downloaded_at": "2019-10-30 00:05:38.499438+00:00", "title": "Off Guard: Vinny Magalhaes says PFL pretty much saved his career", "language": "en", "text": "LAS VEGAS – Vinny Magalhaes has found new life with the PFL as he attempts to win a $1 million playoff prize.\n\nMagalhaes fell short last year in his pursuit in the light heavyweight final to Sean O’Connell, but is now looking to do it all again.\n\nMagalhaes split his two fights in this year’s PFL regular season, but qualified for the playoffs. In Thursday’s quarterfinal fight, he takes on Rashid Yusupov at Mandalay Bay Events Center in Las Vegas. If he wins, he’ll fight later on the same night in the semifinals.\n\nIt’s deja vu for Magalhaes, who won two fights in one night en route to the 2018 final. The UFC veteran says he prefers this format, in which he has a certain period of time to intensify his training as opposed to having to train all year ’round.\n\nAnd because of that, he’s been able to have a career resurgence with the PFL.\n\n“PFL pretty much saved my career,” Magalhaes told MMA Junkie. “Not just in a way of, ‘Oh, it’s better money.’ Yes, it is better money. You stay more consistent, yes, but in general, it turned me into a better athlete. I’ve been a lot more consistent in the gym throughout the year. I’m not doing camps anymore. It’s a seasonal thing. It’s not like I’m training 12 months nonstop, 365 days a year. I’m not doing that.”\n\nFor more from Magalhaes, check out the video above.", "description": "Heading into the PFL's 2019 light heavyweight playoffs, Vinny Magalhaes says the promotion saved his career.", "authors": ["Farah Hannoun", "George Garcia", "Simon Samano", "Nolan King", "Mma Junkie Staff", "Matt Erickson"], "top_image": "https://usatmmajunkie.files.wordpress.com/2019/09/off-guard-vinny-magalhaes.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-29"}