{"pub": "businessinsider", "url": "https://businessinsider.com/macys-free-same-day-delivery-select-markets-2019-9", "downloaded_at": "2019-09-19 23:19:15.050890+00:00", "title": "Macy's will test free same-day delivery in select markets for online orders over $75 — here's where you can get it", "language": "en", "text": "The race to same-day delivery is heating up, just in time for the holiday shopping season.\n\nMacy's is testing free same-day delivery in 30 markets for orders of $75 or more starting on October 1, Retail Dive confirmed. Though the department store first began offering same-day shipping in 2017, the pilot is the first time the retailer will ship orders for free, allowing shoppers to bypass the $8 fee.\n\nOrders placed before noon Monday through Saturday, as well as before 10 a.m. on Sunday, will be delivered the same day with the help of the company's existing partnership with delivery service Deliv.\n\nMacy's effort comes on the heels of Amazon announcing free one-day shipping for Prime subscribers in April, and it mirrors similar efforts from competitors like Walmart, which launched its own free delivery program for orders of $35 or more in March. A Macy's representative did not immediately return Business Insider's request for further comment.\n\nRead more: Walmart blows Amazon out of the water with its own free, next-day delivery\n\nSimilar to Walmart, Macy's is playing up the fact that shoppers do not need to be part of a paid program like Prime to participate. A spokesperson told Retail Dive that the service makes, \"Macy's the first department store to offer the program without requiring a membership fee.\"\n\n\"Over the last two years, we have made significant investments in new technology in our stores and on our website that have given us the ability to better serve our customer's needs wherever, whenever and however they want to shop with us,\" Jill Ramsey, Macy's chief product and digital revenue officer, told Retail Dive in a statement.\n\nThe pilot program will be accessible for a limited time in the following cities:", "description": "Macy's is rolling out a free same-day delivery pilot program in 30 markets across the US beginning on October 1.", "authors": ["Bethany Biron"], "top_image": "https://amp.businessinsider.com/images/5d83c6aa2e22af38f95e34f2-1920-960.jpg", "published_at": "2019-09-19"}