{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/obituaries/vladimir-bukovsky-soviet-dissenter-who-revealed-abuses-of-communist-system-dies-at-76/2019/10/30/bc2eb0aa-f98e-11e9-ac8c-8eced29ca6ef_story.html", "downloaded_at": "2019-10-31 00:08:27.237309+00:00", "title": "Vladimir Bukovsky, Soviet dissenter who revealed abuses of communist system, dies at 76", "language": "en", "text": "Mr. Bukovsky, who died Oct. 27 in Cambridge, England, at 76, was what the New York Times once described as a “hero of almost legendary proportion among the Soviet dissident movement.”\n\nAD\n\nHe was most known for publicizing the Soviet practice of branding dissidents, himself among them, as mentally ill and incarcerating them in psychiatric hospitals that functioned effectively as prisons where detainees lacked even an illusion of legal recourse.\n\nAD\n\nEven after the fall of the Soviet Union in 1991, while living in exile in Cambridge, he protested the suppression of basic freedoms in his homeland. Russian President Vladi­mir Putin, he said, was a “vengeful man, unpredictable and petty-minded.”\n\n“Our society is still sick,” Mr. Bukovsky had declared at the height of his dissident activities in the 1970s. “It is sick with the fear that we inherited from the time of Stalin’s terror. But the process of society’s spiritual regeneration has already begun and there is no stopping it.”\n\nAD\n\nAn inveterate dissident, Mr. Bukovsky had displayed his independence since age 12, his mother once recalled to a correspondent for the Times, when he goaded a school principal into threatening, “We’re going to gather evidence against you, Bukovsky, and you’ll be expelled.”\n\nAD\n\nHe was expelled from his high school and then, in 1961, from Moscow University for publishing writings critical of the Soviet regime and its trappings. His other early offenses included organizing public readings of the works of writers such as Boris Pasternak, the Nobel Prize-winning author whose book “Doctor Zhivago” had been banned in the Soviet Union, and Osip Mandelstam, regarded as one of the greatest Russian poets of the 20th century, who died in the gulag.\n\nMr. Bukovsky was first arrested in 1963, the beginning of nearly 12 years that he would spend in and out of prisons, performing forced labor and in the psychiatric hospitals whose existence he helped expose. In an effort to stifle protest, Soviet psychiatrists diagnosed dissidents with supposed disorders such as “sluggish schizophrenia” and placed them in asylums.\n\nAD\n\nIf the detainee did not accept the diagnosis, “it is considered a sign of a more advanced state of his illness, and he is treated accordingly,” Mr. Bukovsky reported, according to a 1977 dispatch in the Times. “If he does not yield, he may remain there forever. I know of cases where people have spent more than 10 years in psychiatric hospitals.”\n\nAD\n\nDuring his imprisonment, Mr. Bukovsky’s captors attempted to thwart his hunger strikes by force-feeding him through the nostril, an excruciating procedure that led him to denounce torture in all forms.\n\n“They straitjacketed me, tied me to a bed, and sat on my legs so that I would not jerk. The others held my shoulders and my head while a doctor was pushing the feeding tube into my nostril,” he wrote in an account published in The Washington Post in 2005.\n\nAD\n\n“The feeding pipe was thick, thicker than my nostril, and would not go in. Blood came gushing out of my nose and tears down my cheeks, but they kept pushing until the cartilages cracked. I guess I would have screamed if I could, but I could not with the pipe in my throat. I could breathe neither in nor out at first; I wheezed like a drowning man — my lungs felt ready to burst. The doctor also seemed ready to burst into tears.”\n\nAD\n\nMr. Bukovsky’s plight attracted the attention and condemnation of intellectual figures including Arthur Miller, Edward Albee and Vladi­mir Nabokov, as well as Amnesty International and members of the U.S. Congress. In 1976, in a dramatic episode of the Cold War facilitated by the United States, he was freed in exchange for the release in Chile of Luis Corvalán, the leader of the Communist Party in that country.\n\nMark Kramer, director of Cold War Studies at Harvard University, said in an interview that Mr. Bukovsky emerged from “his experience in the Soviet Union looking like such a remarkably admirable figure because he stuck to his principles even when he was paying an extremely severe price for them.”\n\nAD\n\n“He made that choice in favor of sticking to his principles and he had to pay a very dear price for it,” Kramer said. “It cost him 12 years in prison, 12 wasted years of life.”\n\nAD\n\nVladimir Konstantinovich Bukovsky was born Dec. 30, 1942, in Belebei, a town in the Urals, where his family had sought safety during World War II. They returned to Moscow after the war. His father was a member of the Soviet writers’ union, and his mother wrote children’s programs for Radio Moscow.\n\nMr. Bukovsky studied biophysics before he was expelled from Moscow University, later resuming his studies at King’s College Cambridge and Stanford University. He wrote books including a memoir, “To Build a Castle: My Life As A Dissenter,” and the volume “Judgment In Moscow: Soviet Crimes and Western Complicity.” His resistance efforts were chronicled in the recently published volume “The Compatriots: The Brutal and Chaotic History of Russia’s Exiles, Émigrés, and Agents Abroad” by Andrei Soldatov and Irina Borogan.\n\nAD\n\nDuring his exile, Mr. Bukovsky returned to Russia on occasions including the run-up to the 2008 presidential elections, in which he sought to challenge Putin’s successor, Dmitry Medvedev. Mr. Bukovsky was disqualified from the election, which Medvedev won before returning the post to Putin in 2012.\n\nAD\n\nIn recent years, Mr. Bukovsky again made headlines after British prosecutors charged him with 11 counts of child pornography offenses. He alleged that the illegal materials had been planted on his computer as a form of kompromat, or compromising material commonly used in the former Soviet Union to embarrass of blackmail political adversaries. After several delays, his trial was indefinitely postponed in 2018 because of his ill health.\n\nMr. Bukovsky’s only immediate survivor was a sister. Elizabeth Childs, president of the San Francisco-based Bukovsky Center, said that he died at a hospital in Cambridge and that the cause was cardiac arrest.\n\nAD\n\nAmid his investigation on child pornography charges, Mr. Bukovsky mounted another hunger strike.\n\n“After a while you slip into some kind of euphoria,” he told the London Guardian, describing the sensation. “You’re flying over the world. Imagination works perfectly. The brain is like a Swiss clock. Apparently the digestive function takes too much of blood and oxygen from our brain. Once you stop it, the brain works better than it did.”\n\nAD\n\nHe said he was not afraid of death. “How can you be afraid of something inevitable?” he asked. “It isn’t a senseless death. It’s a purposeful death. I’m an old man anyway.”\n\nRead more Washington Post obituaries\n\nAD", "description": "He spent nearly 12 years in Soviet prisons, psychiatric hospitals and forced labor and later became an outspoken critic of Russian President Vladimir Putin.", "authors": ["Emily Langer", "Obituary Writer"], "top_image": "https://www.washingtonpost.com/resizer/wLmWkLUiUV7DHlUMwpn3wmi4X6k=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MSAX6NHZSAI6TLEMR3HNFHFG54.jpg", "published_at": "2019-10-30"}