{"pub": "realclearpolitics", "url": "https://vanityfair.com/news/2019/10/what-george-papadopoulos-taught-me-about-trump", "downloaded_at": "2019-10-16 13:37:44.645682+00:00", "title": "What George Papadopoulos Taught Me About Trump’s Counter-Theory of Collusion", "language": "en", "text": "What is leading to the impeachment of Donald Trump is, on the face of it, simple. Trump abused his powers as president to pressure the government of Ukraine, a supplicant when it comes to the balance of military and financial power, into assisting him with a partisan investigation of his domestic political opponents. But understanding what precipitated and followed from that incident is complex. Much of the mess we’re seeing is due to a collision of two narratives that have been dominating Washington, DC: one of a president abusing his power versus another of a president falling prey to deep-state abuses of power. (Here, I’m using the term “deep state” to mean partisan factions within law enforcement and intelligence, not something more elaborate.) Because Trump’s enemies believe the former and his supporters believe the latter, there has been a recursive quality to the resulting conflicts. Trump got investigated and then sought to investigate the investigators, who now in turn seek to investigate Trump’s efforts to investigate the investigators. The Ukraine incident must be understood partially in this context.\n\nMost Americans have come to understand the basics of the theory that Trump conspired with Moscow. Fewer have become acquainted with the idea that the origins of Russiagate can be traced to a conspiracy of Trump’s enemies, which many Americans on the right have come to believe. Are they deluded or are they clear-sighted? As someone who spent several months on a profile of one of Trump’s erstwhile advisors, George Papadopoulos, who spent 12 days in prison for having lied to the FBI about his outreach to Russia, I wound up having to dig into this question in some detail. My reporting involved interviews with people from all over the world—sundry Greeks, Israelis, Australians, Italians, Brits, and of course Americans—and Papadopoulos also provided me with still-unreleased emails and communications between members of the Trump campaign. While I can’t be as terse as I would like about what I found, I hope at least to offer some clarity for all sides.\n\nThe first thing for the casual news consumer to understand is that the deep-state-abuses narrative of Russiagate and Ukrainegate isn’t just one story. People who suspect that the Trump campaign of 2016 was subject to abuses of power can be found on the non-establishment left as well as the right, and theories of who did what and why are too numerous to count. Broadly speaking, though, the mildest versions of the theory assert there was partisanship and conflicts of interest within the FBI and Department of Justice that led to a flouting of boundaries and protocol. This has been the thrust of many columns by, for instance, Kimberley Strassel in the Wall Street Journal. The most extreme versions of the theory lay out a multi-state conspiracy between government officials and intelligence operatives in Washington, London, Rome, Canberra, Athens, Ankara, and Tel Aviv. This is the narrative favored by Papadopoulos and a growing number of people on the right, including, it seems, the president himself.\n\nWe’ll start with the extreme theory, which is the one that has Trump’s allies going on investigative trips all over the world in an effort to separate fact from fantasy. Just last week, for instance, we could read that Attorney General William Barr visited Rome in September. In this version of events, George Papadopoulos was a pawn in a larger game—someone who was fed compromising information by agents provocateurs so that he would pass it on and create a pretext for investigations. Specifically, in the spring of 2016, when Papadopoulos had just joined the Trump campaign, he came into contact with a London-based Maltese professor named Joseph Mifsud. During a late-April meeting, Mifsud allegedly told Papadopoulos that the Russians had Hillary Clinton’s emails in their possession. A couple of weeks later, in early May, Papadopoulos had a drink with an Australian diplomat named Alexander Downer and mentioned that Russia had compromising information on Clinton. Several weeks later, Downer reported this exchange to U.S. authorities, triggering a major investigation of Trump’s campaign. In the extreme theory of events, all of this was a put-up job by anti-Trump factions within U.S., British, and Australian intelligence agencies, because they viewed Trump as a threat to global security.", "description": "I spent several months investigating the claim, now accepted by many Republicans, that the Trump campaign was set up. But after interviewing Papadopoulos and dozens of sources from around the world, I uncovered a more prosaic truth.", "authors": ["Condé Nast", "T.A. Fran", "Rich Mchugh", "Bess Levin", "Joe Hagan", "Joy Press", "Julie Miller", "Alison Durkee"], "top_image": "https://media.vanityfair.com/photos/5d9f9de76478d00009c48f62/16:9/w_2560,c_limit/George-Papadopoulos-Impeachment.jpg", "published_at": "2019-10-11"}