{"pub": "usatoday", "url": "https://usatoday.com/story/sports/soccer/2019/10/25/reign-fc-vlatko-andonovski-expected-named-uswnt-coach/2458879001", "downloaded_at": "2019-10-25 22:31:15.477906+00:00", "title": "Report: Reign FC coach Vlatko Andonovski to be named coach of US women’s soccer team", "language": "en", "text": "CLOSE\n\nU.S. Soccer is expected to name Vlatko Andonovski as the new head coach of the women’s national team.\n\nA person with knowledge of the deal said Andonovski, the current coach of the Reign FC in the National Women’s Soccer League, is expected to sign a contract with U.S. Soccer in the coming days. The person spoke Friday to The Associated Press on the condition of anonymity because the appointment had not been formally announced.\n\nU.S. Soccer announced a news conference to name the new coach on Monday in New York City.\n\nAndonovski, 43, was considered the front-runner for the job after Utah Royals coach Laura Harvey and North Carolina coach Paul Riley removed their names from consideration.\n\nVlatko Andonovski, shown here on the sidelines during the 2015 NWSL championship, was the head coach of FC Kansas City prior to becoming Reign FC coach. (Photo: Craig Mitchelldyer, AP)\n\nAndonovski replaces Jill Ellis, who led the U.S. team to back-to-back World Cup titles during her tenure as coach.\n\nAndonovski has been a head coach in the NWSL for the past seven seasons. He was coach of now-defunct FC Kansas City from the league’s inception in 2013 until the club folded in 2017. He won two league titles with the team.\n\nAndonovski was named head coach of the Reign in late 2017 when Harvey went to Utah.\n\nThe Reign weathered a number of injuries this season and the absences of several players during the World Cup to make the playoffs for the second straight season. The Reign fell 4-1 to the North Carolina Courage last Sunday in the league semifinals. This season’s championship match between the Courage and the Chicago Red Stars is set for Sunday in Cary, North Carolina.\n\nALEX MORGAN: Announces she and her husband expecting a daughter in April\n\nCARLI LLOYD: 2019 World Cup 'was absolutely the worst time of my life'\n\nAndonovski, a native of Skopje, Macedonia, played for several teams in Europe before embarking on a professional indoor soccer career in the United States.\n\nAmong his first duties with the U.S. team will be preparing it for qualification for the 2020 Olympics in Tokyo. The United States has two more exhibition matches set for this year, against Sweden in Columbus, Ohio, on Nov. 7 and against Costa Rica in Jacksonville, Florida, on Nov. 10.\n\nEllis was named coach of the team in 2014 and led the U.S. to eight overall tournament titles, including victories at the World Cup in 2015 and earlier this year. Over the course of her tenure, the United States lost just seven matches.\n\nEllis announced her decision to step down just a little more than three weeks after the United States beat the Netherlands in Lyon, France, for the World Cup title. It was the team’s fourth overall championship in soccer’s premier tournament.\n\nHer last match came earlier this month when the team capped a five-game victory tour with a 1-1 draw with South Korea in Chicago.", "description": "Andonovski, the current coach of the Reign FC in the National Women’s Soccer League, is expected to sign a contract with U.S. Soccer within days.", "authors": ["The Associated Press", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/25/USAT/7b274174-268e-484b-93e8-1d51e0ee0936-uswnt.JPG?crop=3779,2126,x0,y251&width=3200&height=1680&fit=bounds", "published_at": "2019-10-25"}