{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKCN1VX10Q-OCASP", "downloaded_at": "2019-09-12 11:51:56.972358+00:00", "title": "Equipment expert gives insight into McIlroy dominance", "language": "en", "text": "(Reuters) - Rory McIlroy’s equipment guru has explained how a new driver, a different ball and a new model of putter helped the Northern Irishman return to top form and win the 2019 PGA Tour Player of the Year award.\n\nFILE PHOTO: Aug 25, 2019; Atlanta, GA, USA; Rory McIlroy celebrates winning the Tour Championship golf tournament at East Lake Golf Club. Mandatory Credit: Adam Hagy-USA TODAY Sports\n\nThe richly-talented McIlroy, a four-times major champion and on-and-off world number one, played well in 2018, but word circulated in golf circles that he was not completely happy with his equipment.\n\nSo late last year he made some changes and suitably armed, his form in 2019 was perhaps the best of his career, at least outside the majors, where he flirted with being in contention at the U.S. Open but was a non-factor in the other three.\n\nYet he still racked up three victories, all in big tournaments, and clinched the season-long FedEx Cup and a $15 million bonus.\n\n“Last year Rory’s driving wasn’t up to par for him,” TaylorMade vice-president of tour operations Keith Sbarbaro told Reuters as he offered a glimpse into his relationship with the player.\n\n“His driver was set up to go really far and it did. But it didn’t have enough control.”\n\nSbarbaro thought a switch to a ball with slightly more spin would help McIlroy, who has played TaylorMade equipment since signing a contract in 2017 that is worth $100 million over 10 years, according to some estimates.\n\n“He wanted a bit more spin on his wedges but I loved it because it gave him more spin on his driver also,” Sbarbaro said.\n\n“I thought it was a win-win going to the (different) ball. I just wanted him to get more spin on his driver.\n\n“He obviously had way more control, led the tour in strokes gained driving and (was second) in distance, so he didn’t really give up much. On Trackman (measuring device) he was probably giving up three or four yards.”\n\nMODEL OF CONSISTENCY Strokes gained is a complex statistical measure of how much advantage a player gets over the field in various aspects of the game. McIlroy was head and shoulders above anyone else in this measurement “off the tee” in the 2018-19 season.\n\nYet while outstanding driving was not a huge surprise for a player who has nearly always excelled with the big stick, McIlroy’s putting was more of a revelation.\n\nHe ranked 24th in strokes gained putting, after being a middling 97th in 2018, an improvement Sbarbaro describes as “huge”.\n\nSbarbaro explained how McIlroy came to use the putter, a Spider X model that has a thick line down the crown to help with alignment.\n\n“From the time he picked it up at our photo shoot he was pretty much in love with it,” he said.\n\n“The biggest comment his first putt was, ‘wow, this is so easy to line up. I’ve been struggling lining the putter up’.”\n\nFinally happy with his tools, McIlroy won the Players Championship, Canadian Open and Tour Championship in 2019, and was a model of consistency with 11 other top-10 finishes.\n\nAll of this convinced enough of his peers that he deserved their vote for Player of the Year, which was announced on Wednesday.\n\nSbarbaro cannot predict the future, but is confident McIlroy has at least found compatible tools as he seeks to break a major drought that stretches back to 2014.\n\n“I don’t see him changing anything soon,” he said.", "description": "Rory McIlroy's equipment guru has explained how a new driver, a different ball and a new model of putter helped the Northern Irishman return to top form and win the 2019 PGA Tour Player of the Year award.", "authors": ["Andrew Both", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190912&t=2&i=1429014880&w=1200&r=LYNXNPEF8B0M6-OCASP", "published_at": "2019-09-12"}