{"pub": "theverge", "url": "https://theverge.com/2019/10/9/20906657/virgin-orbit-mars-vehicle-deep-space-satellite-missions-launcherone-satrevolution", "downloaded_at": "2019-10-09 22:00:35.420773+00:00", "title": "Small satellite launcher Virgin Orbit announces plans to send tiny vehicles to Mars", "language": "en", "text": "Virgin Orbit has big plans to send small spacecraft to Mars, as soon as 2022. The company — an offshoot of Richard Branson’s space tourism company Virgin Galactic — announced today that it is partnering with nearly a dozen Polish universities and a Polish satellite maker called SatRevolution to design up to three robotic missions to the Red Planet over the next decade.\n\nIf successful, these missions could be the first purely commercial trips to Mars. Up until now, only four organizations have ever successfully made it to the Red Planet, and all of them have been government-led space organizations. Commercial companies like SpaceX have vowed to send spacecraft to Earth’s neighbor, but so far, Mars has been the sole domain of nation-states. “It’s still a pretty small club, and none of them have been something quite like this where it’s a consortium of companies and universities,” Will Pomerantz, the vice president of special projects at Virgin Orbit, tells The Verge. Plus, all of these space agency vehicles have typically been large — comparable to the size of buses and cars.\n\nthese missions could be the first purely commercial trips to Mars\n\nBut the Virgin Orbit team was inspired to take on this endeavor thanks to NASA’s recent InSight mission, which sent a lander to Mars in November of 2018. When the InSight lander launched, two small standardized spacecraft the size of cereal boxes — known as CubeSats — launched along with it, and traveled all the way to Mars trailing behind the vehicle. It marked the first time that CubeSats, or any small spacecraft of that size, had journeyed beyond the orbit of Earth and out into deep space. The pair of satellites performed exactly as intended, relaying signals from InSight back to Earth, proving that small satellites could be valuable on deep space missions for very low costs.\n\nNow, Virgin Orbit says it has figured out a way to send vehicles as light as 110 pounds (50 kilograms) into deep space with the company’s future rocket, called LauncherOne. Most of Virgin Orbit’s business plan revolves around launching small- to medium-sized satellites into low Earth orbit with the rocket, but Pomerantz says it’s possible to go even farther. “We spent some time internally looking at what the options are, and sort of discovered that we actually think we can do some things that are fairly interesting to places like the Moon and Mars, and the moons of Mars, and Venus, and maybe a couple of the asteroids in the asteroid belt,” he says.\n\n“we actually think we can do some things that are fairly interesting to places like the Moon and Mars.”\n\nAs part of the agreement, SatRevolution will build these future deep-space satellites, while the partnering Polish universities will come up with the mission concepts. The consortium has already proposed possible missions to take images of Mars and its moons, study the Red Planet’s atmosphere, and even look for water.\n\nUnlike most rockets, LauncherOne isn’t meant to launch from the ground, but is instead designed to take off from underneath the wing of an airplane. Virgin Orbit owns a Boeing 747 called Cosmic Girl, which is meant to hoist the rocket into the sky and then drop it. While in mid-air, the rocket’s engine will ignite and propel into Earth orbit. For a future deep-space mission, however, the rocket might contain an extra stage on top — essentially a small booster with an engine attached — that can propel a small satellite beyond the initial Earth orbit and into deep space. Ultimately, there are a number of different ways such a deep space mission could work, says Pomerantz, though the company isn’t going into specifics just yet.\n\nWhile these are all very lofty dreams, LauncherOne has yet to make its first flight. The Virgin Orbit team is getting close after performing a number of tests with both Cosmic Girl and the rocket, and Pomerantz says the plan is to fly the rocket before the end of the year (though the original goal was to fly this summer). The first flight will be critical for the company, paving the way for regular commercial operations and these potential deep-space flights.\n\n“This is really all about opening the aperture for what people can imagine they can do with a smaller vehicle — smaller satellites, smaller rockets,” says Pomerantz. “All this stuff that people, including myself, thought was impossible just a couple years ago are now starting to come to fruition, and people are getting more creative as they see each one of these things succeed.”", "description": "Virgin Orbit has big plans to send small spacecraft to Mars, as soon as 2022. The company — an offshoot of Richard Branson’s space tourism company Virgin Galactic — announced today that it is partnering with nearly a dozen Polish universities and a Polish satellite maker called SatRevolution to design up to three robotic missions to the Red Planet over the next decade.", "authors": ["Loren Grush", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/PKHXnmmQfa99pdeQh-f_2Ex7oOU=/0x40:2207x1195/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19273338/Virgin_Orbit_88.jpg", "published_at": "2019-10-09"}