{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/samsung-is-sending-a-galaxy-s10-5g-towards-space-for-some-reason", "downloaded_at": "2019-10-18 10:37:19.710218+00:00", "title": "Samsung Is Sending A Galaxy S10 5G Towards Space For Some Reason", "language": "en", "text": "Remember a few years back when everyone seemed to be sending stuff to space? Pies, smartphones, droids, Felix Baumgartner and a bunch of other stuff that I could spend all day listing. Well now Samsung is doing it too, by using a big balloon to send a Galaxy S10 5G up into the stratosphere for some reason.\n\nYes, opedants, I know it's not actually space, but it's still close enough that you need a space suit to survive the -65C temperatures and the complete lack of usable oxygen. 65,000 feet is a long way up, and from there the phone inside the payload will be taking pictures of the Earth.\n\nNormal people will also be able to take part, because Samsung is offering them the chance to send a picture of themselves to the spacephone will its floating above the planet. Those selfies are beamed up the phone, and the payload itself will take pictures of the earth and whatever is on the phone's display - the results of which will be sent back to Earth and then the person who send the original selfie.\n\nWeirdly this stunt doesn't seem to have much to do with 5G, since 5G signals don't reach that high. Instead it's focussing on how durable the phone is, and how it can handle the hostile environment at the fringes of the atmosphere. Not because people end up there very often, but because if it can handle space then the phone should be able to handle your clumsy self.\n\nIf you want to get involved you can send the selfie over to Samsung via this website. And nobody better consider sending any pictures of genitals.\n\nThis post originally appeared on Gizmodo UK, which is gobbling up the news in a different timezone.", "description": "Remember a few years back when everyone seemed to be sending stuff to space? Pies, smartphones, droids, Felix Baumgartner and a bunch of other stuff that I could spend all day listing. Well now Samsung is doing it too, by using a big balloon to send a Galaxy S10 5G up into the stratosphere for some reason....", "authors": ["Tom Mckay", "Aaron Gordon"], "top_image": "https://edge.alluremedia.com.au/m/g/2019/10/Screen-Shot-2019-10-18-at-10.29.24-am.png", "published_at": "2019-10-18"}