{"pub": "reuters", "url": "https://reuters.com/article/us-usa-autos-labor/uaw-boosts-strike-pay-as-gm-walkout-continues-idUSKBN1WR0NS", "downloaded_at": "2019-10-13 00:26:48.998775+00:00", "title": "UAW boosts strike pay as GM walkout continues", "language": "en", "text": "WASHINGTON (Reuters) - The United Auto Workers union said Saturday it will boost strike pay for 48,000 hourly workers at General Motors Co (GM.N) by $25 a week to $275 as a strike against the largest U.S. automaker nears the end of its fourth week.\n\nStriking union auto workers walk the picket line outside the General Motors Flint Truck Assembly in Flint, Michigan, U.S., October 9, 2019. REUTERS/Brian Snyder\n\nTalks were continuing late Saturday afternoon to try to resolve the longest nationwide strike at GM since 1970, both sides said.\n\nThe UAW also said it would allow members striking to take on part-time jobs without reducing their strike pay – as long as they perform picket-line duties. The strike pay hike was previously set to increase on Jan. 1.\n\nAlso Saturday, details of a revised GM contract offer emerged, with a person briefed on the matter confirming that GM had boosted its proposed ratification bonus by $1,000 to $9,000.\n\nGM has proposed 3% pay raises in the second and fourth year of the four-year-contract and 3% and 4% lump sum payments in the first and fourth year respectively, the person confirmed. The company would agree to make temporary workers permanent with three years of service and they would get a $3,000 bonus upon ratification of the contract.\n\nAbout 7% of GM’s hourly workforce are temporary workers.\n\nDetails of the revised GM contract offer made earlier this week first emerged in a screen shot posted on Facebook by an ABC-TV affiliate in Flint, Michigan. It’s not clear if GM has since revised any proposals.\n\nGM appealed directly to UAW employees in a blog post on Friday that laid out its latest offer aimed at ending the strike, drawing an angry response from the union that the automaker was trying to “starve ... workers off the picket lines.”\n\nThe GM appeal highlighted the conflict that has already cost it more than $1 billion and has also forced it to idle about 10,000 workers in Mexico and Canada and idle operations throughout North America.\n\nThe UAW strike began on Sept. 16, with the union seeking higher pay, greater job security, a bigger share of profit and protection of healthcare benefits. Credit Suisse estimated the loss could hit about $1.5 billion, and the Center for Automotive Research estimated the weekly costs to GM and the UAW strike fund at $450 million and $12 million, respectively.\n\nAs part of its revised offer, GM boosted the amount it plans to invest in the United States to about $9 billion from its previous offer of $7 billion, a source familiar with the offer said. The UAW responded with a counterproposal of its own on Friday.\n\nOf the new total, $7.7 billion would be invested directly in GM plants and the rest in joint ventures including a potential battery plant near the Lordstown, Ohio, factory that has been idled, the source said.\n\nThe company said the offer also includes increased compensation through wages and one-time payments, preserves industry-leading healthcare benefits without increasing workers’ costs and enhances profit sharing with unlimited upside.\n\nOne of the five issues still under discussion is the fate of four U.S. factories that GM has indicated could close.", "description": "The United Auto Workers union said Saturday it will boost strike pay for 48,000 hourly workers at General Motors Co by $25 a week to $275 as a strike against the largest U.S. automaker nears the end of its fourth week.", "authors": ["David Shepardson", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191012&t=2&i=1440174537&w=1200&r=LYNXMPEF9B0ND", "published_at": "2019-10-12"}