{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-germany-banks-hufeld/german-watchdog-against-ban-on-banks-charging-customers-for-deposits-idUKKCN1VQ19P", "downloaded_at": "2019-09-05 10:33:18.908704+00:00", "title": "German watchdog against ban on banks charging customers for deposits", "language": "en", "text": "FILE PHOTO: Felix Hufeld, President of Germany's Federal Financial Supervisory Authority BaFin (Bundesanstalt fuer Finanzdienstleistungsaufsicht) attends the G20 Germany 2017 Conference in Wiesbaden, Germany January 25, 2017. REUTERS/Ralph Orlowski\n\nFRANKFURT (Reuters) - Germany’s financial markets watchdog would not support banning banks from charging retail customers for storing their money, its president said on Thursday.\n\nBanks in Germany and elsewhere in Europe are under pressure from low interest rates and this has prompted debate about whether they could pass on the charges they incur for depositing cash with the central bank to their customers.\n\nBaFin president Felix Hufeld, asked about banning banks from charging customers for so-called negative interest rates, said he would not advise politicians to go in that direction.\n\nHis remarks follow similar comments from Germany’s central bank.\n\nBavaria’s premier Markus Soeder has suggested banks be prohibited from charging retail customers negative interest rates for accounts of less than 100,000 euros (£89,678).\n\nBut Hufeld’s comments highlight worries about the impact of low profitability on banks and the wider financial system.\n\nSince 2014, the European Central Bank has charged lenders to store their cash, with the so-called deposit rate currently at minus 0.4%.\n\nBanks in Germany paid 2.4 billion euros to the central bank to hold cash in 2018, the German government said in response to a parliamentary inquiry on negative interest rates.\n\nSome banks have passed along that cost to their corporate and wealthy clients, but banks have so far shied away from charging regular savers.", "description": "Germany's financial markets watchdog would not support banning banks from charging retail customers for storing their money, its president said on Thursday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190905&t=2&i=1426494902&w=1200&r=LYNXNPEF840X1", "published_at": "2019-09-05"}