{"pub": "cbs", "url": "https://cbsnews.com/news/california-ncaa-law-to-let-college-athletes-make-money-defying-ncaa", "downloaded_at": "2019-10-01 00:13:01.497241+00:00", "title": "California to let college athletes make money, defying NCAA", "language": "en", "text": "California's governor signed a first-in-the-nation law Monday that will let college athletes hire agents and make money from endorsements. The law, which the NCAA vigorously opposed, could upend amateur sports in the U.S. and trigger a legal challenge.\n\nUnder the law, which takes effect in 2023, students at public and private universities in the state will be allowed to sign deals with sneaker companies, soft drink makers or other advertisers and profit from their images, names or likenesses, just like the pros.\n\n\"It's going to change college sports for the better by having now the interest, finally, of the athletes on par with the interests of the institutions,\" Democratic Gov. Gavin Newsom said in a tweeted video. \"Now we're rebalancing that power arrangement.\"\n\nNewsom also predicted that five other states, including New York and Florida, will soon pass similar legislation so student-athletes can be compensated for their abilities and likeness. Two lawmakers in South Carolina have already announced plans to do so.\n\nThe new law applies to all sports, though the big money to be made is in football and basketball. It bars schools from kicking athletes off the team if they get paid. It does not apply to community colleges and prohibits athletes from accepting endorsement deals that conflict with their schools' existing contracts.\n\nEarlier this month, New York Senator Kevin Parker introduced a bill that mirrors California's legislation. Senate Bill S6722A, if passed as currently written, would require New York colleges to share 15 percent of their annual athletics revenue with student-athletes. The New York Collegiate Athletic Participation Compensation Act would also establish an injured athlete fund to help students who suffer career-ending injuries have income after graduation.\n\nNewsom said California's law re-balances the power between colleges and its student-athletes at a time when institutions have historically generated millions from students' talents.\n\nThe NCAA, which had asked Newsom to veto the bill, responded by saying it will consider its \"next steps\" while also moving forward with \"efforts to make adjustments to NCAA name, image and likeness rules that are both realistic in modern society and tied to higher education.\"\n\nEsports Hall of Famer reflects on growth of pro gaming\n\nThe NCAA, which has 1,100 member schools and claims nearly a half-million athletes, said that \"changes are needed to continue to support student-athletes,\" but that such changes must be done at a national level through the NCAA, not through a patchwork of state laws.\n\nBefore the governor signed the bill, the NCAA cautioned that the law would give California universities an unfair recruiting advantage, which could prompt the athletic association to bar them from competition.\n\nPowerhouse programs like the University of Southern California, the University of California, Los Angeles, Stanford University and the University of California, Berkeley, could find themselves banned.\n\nNewsom said he doesn't expect a lawsuit from the NCAA that would bar California colleges because the athletic association depends heavily on revenue generated by those schools.\n\nBut while the NCAA is the top governing body for college sports, membership is voluntary. If the California schools are forced out, they could form a new league.\n\nProfessional athletes have endorsed the law, including NBA superstar LeBron James, whose 14-year-old son is a closely watched basketball prospect in Los Angeles and will be 18 when the measure takes effect.\n\nOn Instagram, James exulted over the signing of the law, saying it will \"change the lives for countless athletes who deserve it!\"\n\nYou the man Governor Gav! Appreciate you as so many many more as well! 🙏🏾💪🏾✊🏾 https://t.co/scTWA8XRJu — LeBron James (@KingJames) September 30, 2019\n\nI’m so incredibly proud to share this moment with all of you. @gavinnewsom came to The Shop to do something that will change the lives for countless athletes who deserve it! @uninterrupted hosted the formal signing for SB 206 allowing college athletes to responsibly get paid. pic.twitter.com/NZQGg6PY9d — LeBron James (@KingJames) September 30, 2019\n\nDemocratic state Sen. Nancy Skinner, the bill's author, said the measure lets athletes share in the wealth they create.\n\n\"For decades, college sports has generated billions for all involved except the very people most responsible for creating the wealth. That's wrong,\" she said.\n\nAmericans will bet $8.5 billion on March Madness\n\nNewsom, a former student-athlete who played baseball at Santa Clara University, likewise portrayed the law as righting a wrong.\n\n\"It's a multi-billion dollar industry and that money has not necessarily benefited athletes,\" he said. \"This is about fairness. This is about equity and this is about time.\"\n\n\"Other college students with a talent, whether it be literature, music, or technological innovation, can monetize their skill and hard work,\" he added. \"Student athletes, however, are prohibited from being compensated while their respective colleges and universities make millions, often at great risk to athletes' health, academics, and professional careers.\"\n\nThe NCAA has steadfastly refused to pay players in most cases. But a committee led by Ohio State Athletic Director Gene Smith and Big East Commissioner Val Ackerman is studying other ways players could make money. Its report is expected in October.\n\nThe NCAA does let some athletes accept money in some instances. Tennis players can accept up to $10,000 in prize money per year, and Olympians can accept winnings from their competitions. Plus, schools in the big \"Power 5\" conferences can pay players yearly cost-of-living stipends of between $2,000 and $4,000.\n\nThe NCAA reported $1.1 billion in revenue in 2017.", "description": "Governor Gavin Newsom has signed a bill allowing college athletes to get sponsorship deals, just like pros", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/09/30/109d0ef6-3446-4ee9-bf18-987f1e8ea7e8/thumbnail/1200x630/24444e9e8e0680520c257a5554dc5a78/usc-gettyimages-1068942826.jpg", "published_at": "2019-09-30"}