{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/harvards-student-newspaper-chooses-ethical-journalism-over-pc-mobs-demands", "downloaded_at": "2019-10-25 01:45:32.508241+00:00", "title": "Harvard Students Protest Newspaper’s ICE Coverage", "language": "en", "text": "An anti-ICE rally in San Diego, Calif., July 2, 2018 (Mike Blake/Reuters)\n\nThe Crimson had the audacity to present balanced coverage of an anti-ICE protest.\n\nHarvard University’s student newspaper, the Harvard Crimson, was accused of “cultural insensitivity” and “blatantly endangering undocumented students” last month — all because it had adhered to journalistic ethics.\n\nIt’s true: According to an article in the Washington Post, all that the newspaper had done to deserve this was ask U.S. Immigration and Customs Enforcement representatives for comment on a story about an “Abolish ICE” protest. In other words? The paper’s reporters were attacked because they demonstrated basic journalism skills. It is, after all, not only not controversial to ask both sides for their views in a straight-news piece; it would actually be controversial not to.\n\nAdvertisement\n\nAdvertisement\n\nDespite this, the Post reports that “hundreds” of students signed a petition calling on the newspaper to stop talking to ICE completely. Their cause was quite obviously absurd, and it depresses me that hundreds of our nation’s (supposedly) best and brightest could actually be ignorant enough to sign something like that.\n\nThe good news? Rather than back down from the pressure, the newspaper stood its ground. Earlier this week, Crimson editors Angela N. Fu and Kristine E. Guillaume published a defense of the paper’s work.\n\n“The Crimson exists because of a belief that an uninformed campus would be a poorer one — that our readers have the right to be informed about the place where they live, work, and study,” the letter states. “In pursuit of that goal, we seek to follow a commonly accepted set of journalistic standards, similar to those followed by professional news organizations big and small.”\n\nIt continued:\n\nForemost among those standards is the belief that every party named in a story has a right to comment or contest criticism leveled against them. That’s why our reporters always make every effort to contact the individuals and institutions we write about — administrators, students, alumni, campus organizations, and yes, government agencies — before any story goes to press. We believe that this is the best way to ensure the integrity, fairness, and accuracy of our reporting.\n\nGood for them.\n\nYes, I understand how illogical it was that this was ever even a controversy to begin with. The truth is, though, we’re now living in a culture where people don’t always use logic. Particularly, the social-justice mob has a habit of just throwing around buzzwords instead – such as “insensitive” or “racist” or “sexist” — and fully expects that doing so will be enough to silence their opponents. Worse? It often works. Often, when the mob accuses a person of doing something offensive, the knee-jerk response is an apology. The pressure, after all, can be very intense — no one wants to be smeared, or even canceled, and sometimes an apology can seem like the only way out.\n\nI’m glad to see that the Harvard Crimson didn’t do this. These student editors stood up not only for journalism specifically, but also for logic in general. They rejected the idea that the offended person is always right, simply because he or she is offended. Not only is this great news on its own, but I also hope it will inspire others to stand up for what’s right in the future — rather than making the social-justice mob more powerful by caving to it out of fear.", "description": "The Harvard Crimson was criticized for asking ICE officials for comment in a story about an \"Abolish ICE\" protest.", "authors": ["Katherine Timpf", "Ilya Shapiro", "Tobias Hoonhout", "Kevin D. Williamson", "Victor Davis Hanson", "Jack Crowe", "Michael Brendan Dougherty", "Jim Geraghty", "Jonah Goldberg", "Read More"], "top_image": "https://i0.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/anti-ice-rally-san-diego.jpg?fit=1200%2C675&ssl=1", "published_at": "2019-10-25"}