{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7568947/MAFS-Cameron-Merchant-Jules-Robinsons-wedding-crisis.html", "downloaded_at": "2019-10-15 00:06:22.259493+00:00", "title": "MAFS: Cameron Merchant and Jules Robinson's 'wedding in crisis'", "language": "en", "text": "Friends of Married At First Sight 'golden couple' Cameron Merchant and Jules Robinson are reportedly worried their long-awaited wedding may be called off.\n\nAfter recently postponing their Hunter Valley ceremony from September to November 16, the pair have since decided on a last-minute change of venue, according to New Idea.\n\nThe couple have supposedly moved to a location in Sydney's CBD after 'signing a lucrative deal with Channel Nine' to televise the event.\n\nDrama! Friends of MAFS 'golden couple' Cameron Merchant and Jules Robinson are reportedly worried their long-awaited wedding may be called off. Pictured in Sydney on October 6\n\nA source told the publication: 'They needed somewhere central, so it was logistically easier to film. It was going to be too costly for the whole crew to travel so far away.'\n\nMeanwhile, Woman's Day reported that Jules, 37, and Cam, 35, are feeling pressure to have a perfect wedding in order to live up to their 'TV power couple status'.\n\nThe magazine's insider added that the couple's close friends and family are worried they may have hit a 'rough patch' while planning their big day.\n\n'Nobody quite understands why they needed to be engaged and married all within a year,' said a source.\n\nChange of plans: After recently postponing their Hunter Valley ceremony from September to November 16, the pair have since decided on a last-minute change of venue, according to New Idea. Pictured in Sydney on October 6\n\nCashing in! The couple have supposedly moved to a location in Sydney's CBD after 'signing a lucrative deal with Channel Nine' to televise the event\n\nNew Idea also claimed that Jules has been having second thoughts about her bridal party and recently decided to drop one of her bridesmaids.\n\nThe couple initially planned on marrying in Sydney's Centennial Park in September, on the one-year anniversary of their first meeting.\n\nBut in an interview with Yahoo! in September, Jules revealed she had decided to postpone their wedding because she wanted to lose weight.\n\nShe explained they had lost their $5,000 deposit on the venue, but believed it was the right decision as Jules had recently signed on as a Weight Watchers ambassador.\n\nFeeling the pressure? Meanwhile, Woman's Day reported that Jules and Cam are feeling pressure to have a perfect wedding in order to live up to their 'TV power couple status'\n\nToo much, too soon? 'Nobody quite understands why they needed to be engaged and married all within a year,' said an insider. Pictured in Sydney on July 12\n\n'It's a lifestyle choice and one I want to continue for the rest of my life and one I want to maintain because I've yo-yoed my whole life,' she said.\n\n'I've put on 10kg since I got married to Cam [on MAFS], and I've only just started saying it out loud and it's getting much more comfortable.'\n\nHowever, Jules' weight loss journey hasn't been smooth sailing, as she revealed earlier this month she had in fact gained weight on the program.\n\nDaily Mail Australia has contacted Jules and Cameron's manager for comment.", "description": "Friends of Married At First Sight 'golden couple' Cameron Merchant and Jules Robinson are reportedly worried their long-awaited wedding may be called off.", "authors": ["Joshua Fox For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/21/19665284-0-image-a-12_1570998990496.jpg", "published_at": "2019-10-13"}