{"pub": "indiatimes", "url": "https://indiatimes.com/sports/from-contracting-polio-at-8-months-to-winning-a-paralympic-bronze-rajinder-singh-rahelu-s-story-is-a-life-lesson-378633.html", "downloaded_at": "2019-10-26 06:43:23.981736+00:00", "title": "Rajinder Singh Rahelu:From Contracting Polio At 8 Months To Winning A Paralympic Bronze", "language": "en", "text": "Contracting polio at an early age is devastating but to lose the use of one's legs even before being able to walk can hurt. That is what happened to Rajinder Singh Rahelu. He contracted polio at the age of just 8 months which meant he ended up paralysed and needed a wheelchair to get around. But the man did not let it limit his dream.\n\nAfter completing his hire eudcation, Rahelu did not opt for further studies. Instead he took up powerlifting as a sport. He trained hard and soon started to appear in tournaments.\n\nTwitter\n\nIn 1997 he won the Punjab Open, but it was only a sign of things to come. In 2002, he won gold in the Asian Bench Press Championships. Earlier, in 1998, he had won the National Powerlifting Championship. When he started off, he was able to lift 70kg in his first bench press effort. Within 6 months he could lift 115kg. That's progress for you.\n\nBut more success was to follow. In the 2004 Paralympics he secured a bronze medal and received the Arjuna Award in 2006.\n\nDon't Miss 574 SHARES 15 K SHARES 57 K SHARES 17.5 K SHARES 8.4 K SHARES\n\nPTI\n\nIf one thought he was done after crossing 40, well think again. In 2014, he won a silver at the Commonwealth Games.\n\nParalysis has never stopped him from making India proud. The man who came from humble beginnings (his father was a bandmaster and his mother a maid), went on to make it big. His story is truly a life lesson and deserves to be told. People like him are proof that where there is a will, there is a way.", "description": "Contracting polio at an early age is devastating but to lose the use of one's legs even before being able to walk can hurt. That is what happened to Rajinder Singh Rahelu. He contracted polio at the age of just 8 months which meant he ended up paralysed and needed a wheelchair to get around. But the man did not let it limit his dream. After completing his hire eudcation, Rahelu did not opt for fur", "authors": ["Somak Adhikari"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/rajinder_singh_rahelu_is_a_fighter_1572066239_800x420.jpg", "published_at": "2019-10-26"}