{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/james-blunt-says-dad-might-20572562", "downloaded_at": "2019-10-13 18:43:09.926845+00:00", "title": "James Blunt says his dad might die on NHS waiting list for a kidney transplant", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nJames Blunt has revealed his father may die waiting for a kidney transplant on the NHS.\n\nThe singer’s dad Charles Blount, a former cavalry officer in the 13th/18th Royal Hussars, has stage four chronic kidney disease and needs an O positive organ donor.\n\nJames, 45, said: “I wanted to give him my kidney but I wasn’t a match. My sister wasn’t a match either and so we are waiting, because all we can do is wait.\n\n“The NHS has very strict criteria for who is at the top of the list and because of reasons of age and so on my father isn’t a priority.\n\n“We have no complaint about that. It’s absolutely right that younger people are given a priority - that is the way it should be.\n\n(Image: REUTERS)\n\n“But it is on your mind all the time and there is nothing you can do but wait and try to accept what can happen.”\n\nJames was interviewed by Event magazine ahead of the release of his new album Once Upon A Mind.\n\nIt includes a ballad called Monsters - about the pain of a son saying goodbye to his father at the end of his life.\n\nHe said: “I just played it to him. Just the two of us in a room. He listened and he said, ‘That’s the way it is’.\n\n“I can write a song about how I feel but I find expressing emotions one-to-one very difficult.\n\n“Classic public schoolboy. Not really taught to say what you feel.”", "description": "Singer reveals veteran father Charles Blount is on transplant waiting list that favours younger patients", "authors": ["Mark Jefferies", "Image", "Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20571613.ece/ALTERNATES/s1200/0_JS191596765.jpg", "published_at": "2019-10-13"}