{"pub": "fox", "url": "https://foxbusiness.com/markets/billionaire-ken-fisher-response-comparison-clients-getting-laid", "downloaded_at": "2019-10-10 15:08:44.702933+00:00", "title": "Billionaire Ken Fisher mystified by furor over his comparison of wooing clients with getting laid", "language": "en", "text": "Billionaire Ken Fisher believed he was just describing a fact of life when he compared wooing money-management clients with \"trying to get into a girl's pants.\"\n\nContinue Reading Below\n\nSo the founder of Fisher Investments was mystified by the outrage on social media and among a San Francisco audience who described the racy metaphors in his speech at the Tiburon CEO Summit this week as \"disappointing and disgusting,\" he told Bloomberg News in an interview.\n\nFisher's reaction illustrates the quandary facing high-profile executives with a reputation for blunt speech amid the #MeToo era's heightened sensitivity to sexual innuendo. During the past three years, allegations of sexual assault led to the arrest of movie producer Harvey Weinsten, while complaints of harassment prompted PBS to halt its broadcasting of the Charlie Rose show, prompted the ouster of CEO Les Moonves at CBS and led to the resignation of Sen. Al Franken, the Minnesota Democrat.\n\n“I have given a lot of talks, a lot of times, in a lot of places and said stuff like this and never gotten that type of response,” the 68-year-old told Bloomberg after the speech. “Mostly the audience understands what I am saying.”\n\nWhile using sexual metaphors for deal-making is common, if not always welcome, in private conversations on Wall Street, the difference for Fisher is that he was a headline speaker at a three-day conference of paying guests.\n\n\"It was a true debacle,\" Alex Chalekian, the founder and CEO of advisory firm Lake Avenue Financial, said in a video posted on Twitter. Fisher talked about tripping on hallucinogens, and compared money managers bragging to prospective clients with men showing their genitalia to women they're trying to pick up, he said.\n\n\"When I was listening to all of this stuff, I didn't know if this was a joke or what was going on, I was a deer in headlights,\" he recalled. \"My jaw dropped. So we need to change this -- we need to change it now.\"\n\nNeither Fisher Investments, which was founded in 1979 and manages $112 billion for its clients, nor Tiburon Strategic Advisors, which organized the event, immediately responded to requests for comment from FOX Business.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nIt was \"one of the most disgusting and disappointing moments in my career,\" Rachel Robasciotti, the founder of investment manager Robasciotti & Philipson, said on Twitter.\n\nAs for Fisher, he speculated to Bloomberg that he's any \"easy guy to dislike\" because of his firm's success.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\n\"I regret I accepted that speech invitation because it was kind of a pain in the neck,\" he told the news service. \"I wonder if anybody will be candid at one of these Tiburon events again.\"", "description": "Fisher's reaction illustrates the quandary facing blunt-spoken executives amid the #MeToo era's heightened sensitivity to sexual innuendo.", "authors": ["James Langford"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/Ken-Fisher-GettyImages.jpg?ve=1&tl=1", "published_at": "2019-10-10"}