{"pub": "atlantic", "url": "https://theatlantic.com/international/archive/2019/09/jeremy-corbyn-britain-foreign-policy/598564", "downloaded_at": "2019-09-23 07:31:19.510380+00:00", "title": "What Would Jeremy Corbyn Mean for Britain’s Foreign Policy?", "language": "en", "text": "BRIGHTON, England—Things are not all right here in Britain. Boris Johnson’s ruling Conservatives have lost their majority, and with it their ability to govern; Parliament has been suspended; and the country is weeks away from crashing out of the European Union, its closest neighbor and largest trading partner, without a withdrawal deal. In normal times, this moment would present a prime opportunity for a united and organized opposition to step in. But these are not normal times, and there is no such opposition party waiting in the wings. Instead, there is the Labour Party—and its leader, Jeremy Corbyn. “Our movement is strong, our movement is vibrant,” Corbyn told hundreds of party faithful at an opening rally of Labour’s annual conference in this English coastal town over the weekend. The Labour leader pledged to lead the party into an election “against a prime minister who wants to take us over the cliff out of the EU and into the arms of Donald Trump.”\n\n“I’m not having any of that,” he said amidst roaring cheers. “You’re not having any of that.” If ever an opposition was needed in Britain, it’s now. Still, voters remain largely wary of the Labour leader, and what his elevation to the country’s highest political office could mean for its future. Corbyn is the most left-wing leader the Labour Party has seen in decades, and his plans for the country, if elected, are equally as radical: The 70-year-old has pledged to oversee a revolution of the British economy, complete with the nationalization of public services such as intercity rail, water, and mail delivery, as well as the reversal of a decade of painful public-spending cuts imposed following the 2008 financial crisis. The Financial Times concluded that this program would cost hundreds of billions of pounds, and constitute “a fundamental redistribution of income and power.” But for all the attention that has been given to what a Corbyn government would mean for the future of Britain’s economy, relatively little has been paid to the potentially seismic impact it would have on Britain’s role in the world. Corbyn’s foreign-policy views are unlike those held by any other Labour leader, and are in many ways outside the mainstream of his own party, let alone the country. While any major economic plan would require Parliament’s consent, as prime minister, he would have significant sway over the country’s foreign agenda at a time when Britain’s global standing post-Brexit is still mired in doubt.\n\nCorbyn ascended to the Labour leadership in 2015, after more than 30 years on the backbenches of British politics. More a political activist than a career politician, he spent much of that time establishing himself firmly within the far left of the Labour Party, advocating on issues ranging from nuclear disarmament (which he supports) to unilateral military intervention (which he has long opposed). Considered among the party’s most rebellious members, Corbyn has voted against the Labour Party in Parliament more than 500 times. His transition from the fringes of the party to the very top came as a surprise to many, including Corbyn himself, and heralded a significant leftward shift in what had otherwise been a center-left party. Corbyn was boosted by thousands of new (mostly young) voters attracted to his message against public-spending cuts, as well as his decades-long tenure as an anti-war activist, including his opposition to Britain joining the U.S.-led invasion of Iraq. It also marked a rejection of the more centrist “Blairite” politics ushered in by former Prime Minister and Labour leader Tony Blair, with whom Corbyn has long been at odds. It was precisely because of Corbyn’s far-left credentials that many presumed his leadership bid didn’t stand a chance. Commentators dismissed him as a “maverick” candidate of the “loony left,” while Conservatives cheered his candidacy as a way of ensuring that Labour would be consigned to “electoral oblivion.” Even those within Labour who helped get Corbyn onto the ballot admitted they had no intention of voting for him, with several lawmakers saying they only lent him their support to broaden the leadership debate. In the end, Corbyn secured the backing of nearly 60 percent of party members, but only 10 percent of Labour parliamentarians.\n\nRead: Why Jeremy Corbyn isn’t fighting Brexit Since then, Corbyn has transformed Labour into a party in his own image: one that is unwaveringly anti-austerity, antiestablishment, anti-war, and crucially, stronger in number. Labour membership swelled from 200,000 members at the time of Corbyn’s election to upwards of half a million—nearly four times that of the Conservatives—in just two years. Though the surge in members didn’t prove enough to secure Labour’s electoral victory when former Prime Minister Theresa May called a snap election in 2017, the party was able to deny the Tories the outright majority May had been hoping for. “Whatever the final result,” Corbyn declared at the time, “our positive campaign has changed politics for the better.” Things haven’t exactly been smooth sailing for Labour since the election, though. Over the past year, the party has suffered a string of resignations by its more centrist lawmakers and the loss of tens of thousands of card-carrying Labour members over its handling of anti-Semitism allegations within its ranks, as well as the party’s ambiguous position on Brexit. Though the Labour Party formally backed the campaign to remain in the EU during the 2016 referendum, Corbyn’s own efforts to campaign in favor of EU membership were regarded as considerably lackluster. After all, the Labour leader had a long history of skepticism toward the EU, which is viewed by many on the far left as a capitalist club. Indeed, Corbyn voted against Britain’s entry to the European Economic Community (the precursor to the modern bloc) in 1975, and opposed the Maastricht and Lisbon treaties in 1993 and 2008, respectively, which established the EU’s further powers.\n\n“His instincts are much more euroskeptic than that of even [his] close allies,” Malcolm Chalmers, the deputy director general at the Royal United Services Institute, a London-based think tank, and a former senior special adviser to previous Labour Foreign Secretaries Jack Straw and Margaret Beckett, told me. Corbyn’s differences with party colleagues highlight the gulf within Labour over its Brexit policy—between those like the leader, who view the EU with suspicion, and those who see the bloc as guaranteeing some measure of basic workers’ rights and regulatory standards. The party was finally able to coalesce around a position this month, pledging to hold a confirmatory vote on any Brexit deal (including, were it able to form a government, one of its own), with an option to remain in the EU on the ballot. But there is less consensus on which side the Labour Party would ultimately support. While several of Corbyn’s colleagues have already come out in favor of backing remain regardless, Corbyn himself has signaled he will stay neutral. The first time I saw Corbyn in person, I very nearly didn’t. It was the eve of Labour’s 2018 party conference, in Liverpool, and a group of approximately 50 people had gathered outside the conference venue in Royal Albert Dock to hold a vigil for those affected by a worsening humanitarian crisis in Yemen. Standing in the center of them all was Corbyn, who—flanked by Labour’s foreign-affairs spokesperson, Emily Thornberry, and the comedian and political activist Eddie Izzard—decried the Conservative government’s continued arms sales to Saudi Arabia, which has led a years-long bombardment of Yemen. (Such arms sales have since been ruled unlawful by the Court of Appeal in London.)\n\n“If it were a Labour government … we would bring about an end to that conflict,” Corbyn told the crowd, which enthusiastically gathered around the Labour leader for a photo. With no security, no police, and minimal press, the gathering was evocative of classic Corbyn: the lifelong anti-war activist, campaigner, and trade-union organizer. And in many ways, through years of challenges to his leadership, accusations of anti-Semitism, and criticism of his Brexit policy (or lack therof), that is the Corbyn who remains in place to this day. Those who know the Labour leader say that many of his views, particularly on issues of foreign policy, haven’t fundamentally changed since he joined Parliament, let alone since he became Labour leader. “When I think back, I changed my position on some issues when I learned more about them or as the circumstances changed,” Mike Gapes, a former Labour lawmaker who entered Parliament with Corbyn in 1983, told me. “Most of Corbyn’s foreign-policy positions are identical today to what he always had: A pro-Castro, pro-Chávez, anti-imperialist view of the world.” Read: The implosion of Jeremy Corbyn Gapes was among the group of Labour parliamentarians who resigned en masse in February to protest the party’s lack of leadership on Brexit, and its failure to tackle its anti-Semitism crisis, as part of a largely stillborn attempt to form an independent political grouping. But Gapes, who previously represented Labour in Parliament’s foreign-affairs committee, said he had another reason, too: opposition to Corbyn’s foreign policy.\n\n“The general tenor of British foreign policy since the 1945 Labour government has been to establish the Western alliance, to support NATO, to be very much regarding the United States as our main ally,” Gapes said, adding that a Corbyn government would ensure those principles were “directly challenged.” Much of what a Prime Minister Corbyn’s foreign policy might look like is based on views that he has supported throughout his time in Parliament. An early sponsor of the Stop the War Coalition, a British campaign group founded following the 9/11 terrorist attacks, Corbyn was a vocal opponent of the U.S.-led invasions of Afghanistan and Iraq, as well as subsequent military interventions in Libya and Syria. He has voiced support for a two-state solution to the Israeli-Palestinian conflict, including a right of return for all Palestinian refugees. He has also expressed sympathy for the reunification of the Republic of Ireland and Northern Ireland (a particularly controversial position for a would-be prime minister, because Northern Ireland remains a part of the United Kingdom). Tom Kibasi, the director of the Institute for Public Policy Research, a progressive London-based think tank, told me many of Corbyn’s foreign-policy views are in line with mainstream opinion. “Most of the public don’t think bombing children in Yemen is a particularly good thing … Most of the public don’t think oppressing the rights of Palestinians is a good thing,” he said. “Labour’s foreign policy is controversial to the chattering media class, but to normal, ordinary people, it’s common sense.”\n\nBut some of the Labour leader’s views have gotten him into trouble in the past. Corbyn has referred to the militant groups Hamas and Hezbollah as “friends” (comments he has since disowned) and likened the actions of the Israeli government to that of the Nazis (comments that he also later condemned). He has called for the disbandment of NATO, dubbing the international alliance a “military Frankenstein,” and opposed foreign intervention in Venezuela, Syria, and Ukraine, leading critics to suggest he has lent support to oppressive regimes in Caracas, Damascus, and Moscow. More recently, Corbyn faced backlash from both sides of the House of Commons for his reluctance to blame Russia for its role in the nerve-agent attack in Salisbury last year. While many of Corbyn’s views are well established, less clear are his views on some of the biggest foreign-policy challenges Britain will face, from grappling with a rising China to balancing ties between the United States and the EU—though the Labour leader has frequently criticized the Conservative government on matters of domestic policy, he has rarely spoken out on these foreign-policy issues. And then there is the question of how his known views will translate into policy were he to lead Britain’s next government. Though prime ministers have significantly more latitude to make foreign-policy decisions, there are limits to what can be done unilaterally. “The prime minister has to obtain support from his cabinet and indeed his party in Parliament,” Chalmers, the deputy director general at RUSI, said. “There are some red lines the parliamentary party would simply not accept, which would threaten the viability of such a government.”\n\nNATO membership would likely be one such red line—even as Corbyn has refashioned Labour, the party apparatus largely remains deeply committed to Western defense and security institutions. (Thornberry has publicly said Labour is committed to the defense alliance.) Continued support for Britain’s nuclear-weapons system, Trident, would be another. (The party’s defense spokesperson, Nia Griffith, has said the party supports maintaining Britain’s independent deterrent.) So far, Corbyn has been willing to acquiesce on those issues. Though he has expressed support for scrapping Britain’s nuclear arsenal and has personally opposed the continued funding of Trident, he pledged to honor the party’s decision to maintain the program, a promise that featured in the party’s 2017 election manifesto. Corbyn’s position on using nuclear weapons isn’t simply hypothetical. As prime minister, one of the first things he would be required to do is write his four letters of last resort, handwritten instructions to Britain’s military leaders on what should happen in the event that Britain is hit with a nuclear attack. When asked whether Corbyn could go about limiting the country’s nuclear capacity another way—say, by instructing the military not to employ nuclear weapons under any circumstances—Chalmers said we’ll likely never know. “The impact of [letters of last resort] can be overstated, not least because the tradition is they’re never publicized,” he said, adding: “It would be a test, I think, of whether Jeremy Corbyn was prepared to obfuscate on this in a way which previous prime ministers have done … It’s more about how he would talk about it, rather than the actual letter.” Related Stories Britain’s Political Chaos Shows Everything Is Okay\n\nBoris Johnson, Brexit, and Britain’s Constitutional Quagmire\n\nWhy a ‘Brexit Election’ Will Make Things Worse\n\nIt’s Too Late for David Cameron to Apologize But perhaps the greatest impact a Corbyn premiership would have on Britain’s foreign policy is on which direction Britain decides to go post-Brexit, and whether it chooses to align more closely with its allies in Europe, with the Trump administration in the United States, or elsewhere. While both May and Johnson have prioritized courting President Donald Trump with the hopes of securing a post-Brexit trade deal with the United States, Corbyn has taken a more aggressive stance toward the American president, opting to skip a state dinner during Trump’s visit to Britain this year. (The Labour leader did, however, request a one-on-one meeting with Trump, which the president declined.) Despite the long-standing “special relationship” between the U.S. and Britain, much divides the two allies—particularly on issues such as climate change, trade, and the Iran nuclear deal. Though these differences haven’t proved enough to hinder the two countries’ deep defense and security partnership, some believe a Corbyn premiership would impose unprecedented strain on the alliance. A recent report by the Washington-based Hudson Institute, a conservative think tank, concluded that Corbyn’s apparent willingness to countenance friendlier ties with Russia, Iran, and China would make Britain less of a “reliable partner” to the U.S., and called into question the country’s continued membership in NATO and Five Eyes, the intelligence alliance between the U.S. and Britain, as well as Canada, Australia, and New Zealand. “There is a serious risk that any information passed to either Corbyn or his close allies could be compromised,” the report said, labeling the concerns a bipartisan issue. “Even a Democratic administration, if it wins the 2020 elections, will find the U.K. has become a less predictable ally.”", "description": "The Labour Party leader could be the country’s next prime minister, and could well redefine its role in the world.", "authors": ["Yasmeen Serhan"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/corbyn_FINAL/facebook.jpg?1569016523", "published_at": "2019-09-23"}