{"pub": "businessinsider", "url": "https://businessinsider.com/fbi-agents-therapy-raid-gruesome-arizona-human-body-center-2019-10", "downloaded_at": "2019-10-30 11:19:06.600148+00:00", "title": "FBI agents who discovered a torso with another person's head sewn onto it in a horrific raid on an Arizona body-donation center were so traumatized they needed counseling, court hears", "language": "en", "text": "FBI agents raiding an Arizona body-donation center in 2014 were so traumatized by what they saw that some needed therapy, an agent has said.\n\nOfficials closed the Biological Resource Center (BRC) in Phoenix after an investigation into the misuse of bodies donated for scientific research in exchange for free cremation later on.\n\n\"Some individuals refused to go back into the scene,\" ex-FBI special agent Mark Cwynar told the Maricopa County superior court on Tuesday, adding that many needed therapy afterwards.\n\nCwynar said his team found a \"cooler filled with male genitalia\" and a woman's head sewn onto a man's body in a \"Frankenstein\" manner.\n\n33 plaintiffs are suing BRC owner Stephen Gore, with some saying their relative's bodies were sold to the US military for blast tests without their consent.\n\nVisit Insider's homepage for more stories.\n\nSome FBI agents raiding an Arizona body-donation center in January 2014 were so scarred by what they found they needed counseling afterwards, an agent who took part in the raid has told a court.\n\nThe Biological Resource Center (BRC) in Phoenix, Arizona, was shut down after an investigation into the misuse of dead body parts.\n\nThe for-profit facility took dead bodies from relatives on the pretense of using them for scientific research, in exchange giving the deceased's relatives a free cremation service later on.\n\n\"I personally observed several individuals emotionally upset. Some individuals refused to go back into the scene,\" Retired FBI special agent Mark Cwynar said of the raid at the Maricopa County superior court on Tuesday.\n\nCwynar said several agents required counseling in the aftermath of the raid because of what they saw.\n\nPeople in hazmat suits stand outside the Biological Research Center in Phoenix. ABC 15\n\nCwynar said his team stumbled on piles of \"severed heads, hands, arms,\" a \"cooler filled with male genitalia,\" as well as a woman's head sewn onto a man's body in a \"Frankenstein\" manner.\n\nPhilip Guyett, a former \"body broker\" told Insider's Alexandra Ma the \"Frankenstein\" creation could be a way to make up a full body's worth of ashes, so a family would think it was all one person.\n\n33 plaintiffs are suing the center and owner Stephen Gore, claiming they were deceived about what happened to their relatives' bodies, saying some were sold for profit, and some to the US military for blast testing without consent.\n\nThe Biological Resource Center is seen in Phoenix, Arizona, on December 17, 2017. Reuters\n\nBodies were obtained through \"false statements\" and \"were literally used as crash test dummies, which meant they were used in experiments involving exposures to destructive forces, e.g. impacts, crashes, ballistic injuries and blasts,\" the law suit claims.\n\nOpening statements in the suit were heard at the Maricopa County superior court on Monday.\n\nTimothy O'Connor, a lawyer for BRC, said all 33 plaintiffs had signed a consent form when they handed their relative's remains over.\n\n\"There is no Arizona law that prohibits a company such as BRC, and others, from charging a fee for what they do, and that fee can include being for profit,\" he said.\n\nCwynar had submitted written testimony to the suit when it was first filed in 2015, saying he recalled seeing \"various unsettling scenes\" during the raid, some of which were a \"morbid joke.\"\n\nOne Arizona native suing BRC found out that his mother's body, which he donated in hopes that it could be sent for Alzheimer's research, was sold to the US Army to test the effects of roadside bombs on troops.\n\nStauffer said he found out after reading a 2016 Reuters investigation into the center.\n\nThe center sold whole bodies for $5,893 and a head with torso for $2,400, Reuters found.\n\nMichael Burg, a lawyer representing several of the plaintiffs, told the Phoenix New Times: \"They can't stop thinking how their loved one's head is now in Florida. They were cut up like a piece of meat. It's despicable.\"", "description": "Ex-FBI agent Mark Cwynar said he found a \"cooler filled with male genitalia\" during a 2014 raid on the Biological Resource Center (BRC) in Phoenix.", "authors": ["Bill Bostock"], "top_image": "https://image.businessinsider.com/5db96f7be94e86676b6a9549?width=1200&format=jpeg", "published_at": "2019-10-30"}