{"pub": "reuters", "url": "https://reuters.com/article/us-tech-antitrust-facebook/facebook-probe-by-u-s-states-expands-to-47-attorneys-general-idUSKBN1X1200", "downloaded_at": "2019-10-22 16:21:46.063320+00:00", "title": "Facebook probe by U.S. states expands to 47 attorneys general", "language": "en", "text": "FILE PHOTO: Attendees walk past a Facebook logo during Facebook Inc's F8 developers conference in San Jose, California, U.S., April 30, 2019. REUTERS/Stephen Lam\n\nWASHINGTON (Reuters) - A New York-led probe of Facebook Inc into allegations that the company put consumer data at risk and pushed up advertising rates has expanded to include attorneys general from 47 U.S. states and territories, New York Attorney General Letitia James said in a statement on Tuesday.\n\nThe investigation of Facebook announced in September had included Colorado, Florida, Iowa, Nebraska, North Carolina, Ohio, Tennessee and the District of Columbia. It now includes most U.S. states as well as the U.S. territory of Guam.\n\nFacebook shares were down more than 2% at $184.73 on Tuesday. The company had no immediate comment.\n\nThe statement provided a list of states involved in the probe and added that other states “cannot confirm their participation in pending investigations.” California, the largest state, was not on the list.\n\nSome states, particularly New York and Nebraska, have raised concerns that Facebook and other big tech companies engage in anti-competitive practices, expose consumer data to potential data theft and push up advertising prices.\n\nFacebook also faces probes by the U.S. Justice Department and the Federal Trade Commission, as well as the House of Representatives Judiciary Committee.\n\nThe Facebook investigations are part of a larger landscape of probes of big tech firms.\n\nReuters and others reported in June that the Justice Department and FTC had divided responsibility for the companies being investigated, with the Justice Department taking on Alphabet Inc’s Google and Apple Inc while the FTC looked into Facebook and Amazon.com Inc. The Justice Department later said it was opening a probe of online platforms, which would include Facebook.", "description": "A New York-led probe of Facebook Inc into allegations that the company put consumer data at risk and pushed up advertising rates has expanded to include attorneys general from 47 U.S. states and territories, New York Attorney General Letitia James said in a statement on Tuesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191022&t=2&i=1443788846&w=1200&r=LYNXMPEF9L1ES", "published_at": "2019-10-22"}