{"pub": "reuters", "url": "https://in.reuters.com/article/nigeria-entertainment-nollywood/action-nigerias-film-industry-draws-global-entertainment-brands-idINKCN1VV0I1", "downloaded_at": "2019-09-10 07:48:28.957380+00:00", "title": "Action! Nigeria's film industry draws global entertainment brands", "language": "en", "text": "LAGOS (Reuters) - “Oya!” shouts the director in Nigerian Pidgin English. Actors take their marks. Lighting blinks on. The film crew snaps into action after the order to hurry up.\n\nCrew members film a scene on the set of a ROK's film in Lagos, Nigeria July 21, 2019. Picture taken July 21, 2019. REUTERS/Temilade Adelaja\n\nIt’s another day in Nollywood, the affectionate nickname for Nigeria’s film industry - the world’s second most prolific after India’s Bollywood, producing hundreds of films and TV episodes each month.\n\nFor decades it was a factory churning out visual pulp fiction destined for the market stalls of DVD pirates. But Nollywood is increasingly grabbing the attention - and financing - of global entertainment brands.\n\nSome, like French group Vivendi’s Canal+, seek to harness Nigerian hustle and know-how to extend the lifespan of the traditional pay-TV model, which is bleeding customers in developed markets but still has a future in Africa.\n\nOthers, including South Africa’s MultiChoice, are using Nigeria as a testing ground for introducing streaming platforms in African markets with poor communications infrastructure and low income levels.\n\nIn both cases, it’s local production that’s benefiting.\n\n“Ten years ago Nollywood was very different,” Mary Njoku, whose ROK studios was acquired by Canal+ in July, told Reuters as the film crew worked in an abandoned hotel in Nigeria’s megacity Lagos. “Today we shoot with better cameras... We do things differently.”\n\nA room on the hotel’s top floor was standing in for a college dorm on “What Are Friends For?”, an ROK comedy series that will be among new shows aired by Canal+ in coming months.\n\nThe company first dipped its toe into Africa’s most populous country six years ago, buying up local films, dubbing them and airing them on a dedicated channel, Nollywood TV, to viewers in French-speaking Africa.\n\nThat success led to the creation of a second channel.\n\nThe deal with ROK secures a steady supply of new films and series as the firm eyes a further expansion of African content, said Fabrice Faux, Canal+ International’s chief content officer.\n\nSince it was founded six years ago, ROK has produced more than 540 films and 25 series. Under the Canal+ deal, Njoku says it aims to increase production from next year to around 300 films and 20 series annually.\n\nCanal+’s pivot to Africa - a golden opportunity for ROK - is a business necessity for the French company.\n\n“It is one of the very rare pay-TV markets that is growing and is growing very fast,” Faux told Reuters. “When I joined Canal+ International back in 2014, we had half a million (African subscribers) and now we have 4 million.”\n\nCompare that to mainland France where, as of last year, it had lost some 1.3 million individual subscribers since 2013.\n\nMuch of that decline arose from losing broadcasting rights to popular sporting events. But it also reflected stiff competition from streaming services such as Netflix and Amazon. However, Faux believes such rivals pose no threat in Africa due to a widespread lack of 4G coverage or fixed broadband internet on the continent.\n\nTo properly develop African markets, however, Canal+ must cater to their diverse audiences, Faux said.\n\nFrancophone Africa has no Nollywood equivalent. Producing shows there has been slow and expensive, as Canal+ has been forced to bring in film crews from Europe to shoot on location, Faux said. He now hopes Canal+ can use ROK to clone the Nollywood model.\n\n“The best knowledge and expertise is there in Nigeria. So it is our intention to try to bring some producers, technicians, directors to French-speaking Africa, for us to try to develop new production methods,” Faux said.\n\nTEMPORARY GLITCHES?\n\nIf Canal+ sees little threat from streaming services in Africa, MultiChoice - the first major entertainment group to realise Nollywood’s potential - is out to prove it wrong.\n\nIn its infancy in the 1990s, Nollywood churned out cheap films ranging from bawdy comedies to morality tales about witchcraft and infidelity.\n\nLow on production quality but high on entertainment value, these movies quickly garnered a fanatical following across Africa and its diaspora. And in 2003, MultiChoice launched Africa Magic - a Nollywood channel that would grow into a subscription package on its DStv satellite network.\n\nIn July, Showmax, MultiChoice’s fledgling video-streaming service, launched in Nigeria.\n\n“The Nollywood phenomenon makes it quite interesting from a content development point of view. You have a huge base of very loyal fans,” said Niclas Ekdahl, CEO of MultiChoice’s connected video division.\n\nShowmax - also available in South Africa and Kenya - is not alone in Nigeria’s video-on-demand market.\n\nU.S. streaming giant Netflix released “Lionheart”, its first original film produced in Nigeria, in January. It is also negotiating licence deals for Nigerian films such as “Chief Daddy”, a comedy that debuted on the platform in March.\n\nBut bringing streaming to African audiences won’t be easy. Expensive mobile data and low incomes make regular streaming unaffordable for many on the continent.\n\nOne gigabyte of data, enough to watch about three films, costs the equivalent of around $2.80 in Nigeria, while most people live on less than $2 a day.\n\nThe experience of Malaysian streaming platform iflix is a cautionary tale.\n\nIt launched in Nigeria in 2017, then expanded to Kenya, Ghana and Zimbabwe following a tie-up with Kwese TV, a subsidiary of Zimbabwe’s Econet Media Limited.\n\nHowever, data discounts and a pay-as-you-go option were not enough to sustain the business. In December, iflix sold its Africa business to the Econet group, which shut down the streaming service last month.\n\nShowmax’s Ekdahl remains undaunted, passing the challenges off as “temporary glitches”. The potential payoff - a largely untapped audience of 1 billion - is worth the effort of tailoring a business to African markets, he believes.\n\nShowmax partnered with mobile phone operators Vodacom, MTN and Telkom in South Africa and Safaricom in Kenya to offer reduced data and subscription fees. It aims to do the same in Nigeria.\n\nIt is also experimenting with installing wireless internet in public transport, so viewers can download content during their daily commutes without incurring data costs.\n\nSlideshow (5 Images)\n\nThe boom in interest in Nigeria’s film industry can only be a good thing, says Joshua Richard, a barrel-chested actor who plays a fanatically religious student on “What Are Friends For?”\n\nForeign investment will, he hopes, help Nollywood shake off a reputation for shoddy camerawork and muffled sound, while also leading to greater artistic recognition overseas.\n\n“It exposes African actors to a bigger audience,” he said. “We have lots of good content in Nollywood, but it doesn’t get the credit it deserves.”", "description": "\"Oya!\" shouts the director in Nigerian Pidgin English. Actors take their marks. Lighting blinks on. The film crew snaps into action after the order to hurry up.", "authors": ["Alexis Akwagyiram", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190910&t=2&i=1428215843&w=1200&r=LYNXNPEF890DF", "published_at": "2019-09-10"}