{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/olivia-buckland-sparkles-enjoys-pda-20650001", "downloaded_at": "2019-10-19 11:18:31.593171+00:00", "title": "Olivia Buckland sparkles as she enjoys PDA-fest with hubby Alex Bowen at glitzy awards", "language": "en", "text": "Get the biggest Daily Love Island stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLove Island stars Olivia Buckland and Alex Bowen are the picture of true love.\n\nAnd Olivia looked sensational as she arrived with her man in tow at the star-studded Deliveroo Awards 2019 at Shoreditch Town Hall in London on Thursday night.\n\nThe blonde bombshell, 25, wowed as she arrived at the glitzy bash wearing a dazzling navy gown with shimmering sequined embellishments.\n\nOlivia's glittering long dress featured a flattering sweetheart neckline and drew attention to the star's enviable figure.\n\n(Image: SplashNews.com)\n\n(Image: SplashNews.com)\n\nThe reality TV babe looked smitten as she cosied up to her handsome husband Alex Bowen, 27.\n\nThe married couple shared a romantic smooch outside the London venue as photographers snapped photos of the loved-up duo who strolled into the bash hand-in-hand.\n\nAlex put on his usual dapper display and donned a double-breasted grey jacket with black trousers, a simple T-shirt and gold chain necklace.\n\nThe power couple joined the likes of Made In Chelsea's Vogue Williams and Georgia 'Toff' Toffolo and TOWIE queen Gemma Collins at the fancy event.\n\n(Image: SplashNews.com)\n\n(Image: SplashNews.com)\n\nOlivia and Alex's appearance at the event come as they recently celebrated their one-year wedding anniversary last month.\n\nThe pair wed in September last year after falling in love on the 2016 series of Love Island, and are known as the ultimate power couple.\n\nThe power couple tied the knot in front of 98 guests at Gosfield Hall in Essex on 15 September 2018.\n\n(Image: SplashNews.com)\n\n(Image: SplashNews.com)\n\nThe Bowens celebrated the momentous anniversary in style as they pulled out all the stops for a lavish romantic break in Santorini.\n\nDescribed as the poster couple when it comes to the show’s romances, the pair have successfully managed to avoid any controversies and look to be going strong.\n\nThe couple recently returned to screens in their very own show on TLC, Olivia & Alex: Happily Ever After.\n\n(Image: SplashNews.com)\n\nThe show documents their married life with one another and their two French bulldogs.\n\nAlex was working as a scaffolder and Olivia was a sales executive when they shot to fame on the ITV show.\n\nOlivia And Alex: Happily Ever After airs on Fridays at 9pm on TLC.", "description": "The power couple looked as loved-up as ever as they made a dazzling arrival at the glitzy bash and shared a passionate smooch", "authors": ["Tiffany Wallis", "Image", "Splashnews.Com"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20650019.ece/ALTERNATES/s1200/0_The-Deliveroo-Awards-2019.jpg", "published_at": "2019-10-18"}