{"pub": "businessinsider", "url": "https://businessinsider.com/fastest-growing-us-cities-best-growing-economies-ranked", "downloaded_at": "2019-10-16 21:27:11.604017+00:00", "title": "The 25 fastest-growing cities in the US, ranked", "language": "en", "text": "WalletHub recently took a look at which US cities are currently seeing the most rapid economic growth.\n\nThe study analyzed 515 cities of different population sizes based on 17 metrics that measure a city's performance over a seven-year period. The metrics include unemployment rate decrease, population growth, and median household income growth, among others.\n\nAll 17 metrics were weighted to create a final score between 0 and 100 for each city.\n\nThe list singles out the South and the West as the fastest-growing regions.\n\nVisit Business Insider's homepage for more stories.\n\nMillennials are ditching giant hubs like New York City and San Francisco and looking to shack up elsewhere.\n\nRapid economic growth plays a key part in what makes up-and-coming cities attractive potential landing spots. WalletHub recently analyzed 515 US cities to identify the locales that experienced the highest levels of economic growth over the last seven years.\n\nRead more: The 20 worst US cities for financial stability\n\nEach city received a final growth score between 0 and 100 based on 17 relevant metrics. The metrics fell into categories representing sociodemographics or jobs and economy, including: population growth; college-educated population growth; job growth; median household income growth; growth in homes with $75,000+ annual income; decrease in unemployment rate; increase in number of businesses; and growth in regional GDP per capita.\n\nThe 25 cities that scored the highest are scattered across 12 states, most of which are clustered in the South and the West. Texas leads the list, appearing on the list seven times; Florida is close behind, with five cities ranked among the top 25.\n\nKeep reading for a look at the fastest-growing US cities. They are ranked below in ascending order of final score.", "description": "Cities of all sizes are experiencing rapid economic growth. Here's a look at the fastest-growing cities in the US, seven of which are in Texas.", "authors": ["Taylor Borden"], "top_image": "https://image.businessinsider.com/5da4aa5bcc4a0a77d8668ed8?width=1200&format=jpeg", "published_at": "2019-10-16"}