{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/giuliani-trump-impeachment-ukraine-lobby-marie-l-yovanovitch-a9152996.html", "downloaded_at": "2019-10-12 09:41:07.346423+00:00", "title": "Trump lawyer Rudy Giuliani 'under investigation' for lobbying Ukraine", "language": "en", "text": "Federal prosecutors in New York City are investigating whether President Donald Trump’s personal lawyer Rudy Giuliani broke lobbying laws in his dealings in Ukraine, according to two people familiar with the inquiry.\n\nThe investigators are examining Giuliani’s efforts to undermine the US ambassador to Ukraine, Marie L Yovanovitch, one of the people said. She was recalled in the spring as part of Mr Trump’s broader campaign to pressure Ukraine into helping his political prospects.\n\nThe investigation into Mr Giuliani is tied to the case against two of his associates who were arrested this week on campaign finance-related charges, the people familiar with the inquiry said. The associates were charged with funnelling illegal contributions to a congressman whose help they sought in removing Ms Yovanovitch.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nMr Giuliani has denied wrongdoing, but he acknowledged that he and the associates worked with Ukrainian prosecutors to collect potentially damaging information about Ms Yovanovitch and other targets of Trump and his allies, including former Vice President Joe Biden and his son Hunter Biden. Mr Giuliani shared that material this year with US government officials and a Trump-friendly columnist in an effort to undermine the ambassador and other Trump targets.\n\nFederal law requires US citizens to disclose to the Justice Department any contacts with the government or media in the United States at the direction or request of foreign politicians or government officials, regardless of whether they pay for the representation. Law enforcement officials have made clear in recent years that covert foreign influence is as great a threat to the country as spies trying to steal government secrets.\n\nShape Created with Sketch. Trump impeachment: Who's who in the Ukraine scandal Show all 19 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Trump impeachment: Who's who in the Ukraine scandal 1/19 Donald Trump Accused of abusing his office by pressing the Ukrainian president in a July phone call to help dig up dirt on Joe Biden, who may be his Democratic rival in the 2020 election. He also believes that Hillary Clinton’s deleted emails - a key factor in the 2016 election - may be in Ukraine, although it is not clear why. Reuters 2/19 The Whistleblower Believed to be a CIA agent who spent time at the White House, his complaint was largely based on second and third-hand accounts from worried White House staff. Although this is not unusual for such complaints, Trump and his supporters have seized on it to imply that his information is not reliable. Expected to give evidence to Congress voluntarily and in secret. Getty 3/19 The Second Whistleblower The lawyer for the first intelligence whistleblower is also representing a second whistleblower regarding the President's actions. Attorney Mark Zaid said that he and other lawyers on his team are now representing the second person, who is said to work in the intelligence community and has first-hand knowledge that supports claims made by the first whistleblower and has spoken to the intelligence community's inspector general. The second whistleblower has not yet filed their own complaint, but does not need to to be considered an official whistleblower. Getty 4/19 Rudy Giuliani Former mayor of New York, whose management of the aftermath of the September 11 attacks in 2001 won him worldwide praise. As Trump’s personal attorney he has been trying to find compromising material about the president’s enemies in Ukraine in what some have termed a “shadow” foreign policy. In a series of eccentric TV appearances he has claimed that the US state department asked him to get involved. Giuliani insists that he is fighting corruption on Trump’s behalf and has called himself a “hero”. AP 5/19 Volodymyr Zelensky The newly elected Ukrainian president - a former comic actor best known for playing a man who becomes president by accident - is seen frantically agreeing with Trump in the partial transcript of their July phone call released by the White House. With a Russian-backed insurgency in the east of his country, and the Crimea region seized by Vladimir Putin in 2014, Zelensky will have been eager to please his American counterpart, who had suspended vital military aid before their phone conversation. He says there was no pressure on him from Trump to do him the “favour” he was asked for. Zelensky appeared at an awkward press conference with Trump in New York during the United Nations general assembly, looking particularly uncomfortable when the American suggested he take part in talks with Putin. AFP/Getty 6/19 Mike Pence The vice-president was not on the controversial July call to the Ukrainian president but did get a read-out later. However, Trump announced that Pence had had “one or two” phone conversations of a similar nature, dragging him into the crisis. Pence himself denies any knowledge of any wrongdoing and has insisted that there is no issue with Trump’s actions. It has been speculated that Trump involved Pence as an insurance policy - if both are removed from power the presidency would go to Democratic House Speaker Nancy Pelosi, something no Republican would allow. AP 7/19 Rick Perry Trump reportedly told a meeting of Republicans that he made the controversial call to the Ukrainian president at the urging of his own energy secretary, Rick Perry, and that he didn’t even want to. The president apparently said that Perry wanted him to talk about liquefied natural gas - although there is no mention of it in the partial transcript of the phone call released by the White House. It is thought that Perry will step down from his role at the end of the year. Getty 8/19 Joe Biden The former vice-president is one of the frontrunners to win the Democratic nomination, which would make him Trump’s opponent in the 2020 election. Trump says that Biden pressured Ukraine to sack a prosecutor who was investigating an energy company that Biden’s son Hunter was on the board of, refusing to release US aid until this was done. However, pressure to fire the prosecutor came on a wide front from western countries. It is also believed that the investigation into the company, Burisma, had long been dormant. Reuters 9/19 Hunter Biden Joe Biden’s son has been accused of corruption by the president because of his business dealings in Ukraine and China. However, Trump has yet to produce any evidence of corruption and Biden’s lawyer insists he has done nothing wrong. AP 10/19 William Barr The attorney-general, who proved his loyalty to Trump with his handling of the Mueller report, was mentioned in the Ukraine call as someone president Volodymyr Zelensky should talk to about following up Trump’s preoccupations with the Biden’s and the Clinton emails. Nancy Pelosi has accused Barr of being part of a “cover-up of a cover-up”. AP 11/19 Mike Pompeo The secretary of state initially implied he knew little about the Ukraine phone call - but it later emerged that he was listening in at the time. He has since suggested that asking foreign leaders for favours is simply how international politics works. AFP via Getty 12/19 Nancy Pelosi The Democratic Speaker of the House had long resisted calls from within her own party to back a formal impeachment process against the president, apparently fearing a backlash from voters. On September 24, amid reports of the Ukraine call and the day before the White House released a partial transcript of it, she relented and announced an inquiry, saying: “The president must be held accountable. No one is above the law.” Getty 13/19 Adam Schiff Democratic chairman of the House intelligence committee, one of the three committees leading the inquiry. He was criticized by Republicans for giving what he called a “parody” of the Ukraine phone call during a hearing, with Trump and others saying he had been pretending that his damning characterisation was a verbatim reading of the phone call. He has also been criticised for claiming that his committee had had no contact with the whistleblower, only for it to emerge that the intelligence agent had contacted a staff member on the committee for guidance before filing the complaint. The Washington Post awarded Schiff a “four Pinocchios” rating, its worst rating for a dishonest statement. Reuters 14/19 Lev Parnas and Igor Fruman Florida-based businessmen and Republican donors Lev Parnas (pictured with Rudy Giuliani) and Igor Fruman were arrested on suspicion of campaign finance violations at Dulles International Airport near Washington DC on 9 October. Separately the Associated Press has reported that they were both involved in efforts to replace the management of Ukraine's gas company, Naftogaz, with new bosses who would steer lucrative contracts towards companies controlled by Trump allies. There is no suggestion of any criminal activity in these efforts. Reuters 15/19 Kurt Volker The former US ambassador to NATO was appointed special envoy to Ukraine, and is thought to have played a role in linking Giuliani with Ukraine officials. He resigned just before giving evidence to Congress, which had subpoenaed him. After his testimony it emerged that he had apparently told Giuliani that he was being fed false information about the Bidens from Ukrainian officials. Getty Images 16/19 Marie Yovanovitch A career diplomat who was appointed US ambassador to Ukraine towards the end of Barack Obama’s presidency. She was abruptly recalled from her post in May 2019 amid claims that she was not co-operating with Rudy Giuliani’s unorthodox activities in Ukraine. In the Ukraine phone call Trump refers to her as “the woman” and “bad news” and hints darkly at some sort of retribution, saying: “Well, she’s going to go through some things.” Subpoenaed to give evidence to Congress. AP 17/19 Gordon Sondland A Seattle hotelier who became US ambassador to the European Union after donating $1 million to Trump’s inauguration committee, despite having no diplomatic experience. According to the whistleblower, Sondland met Ukrainian politicians to help them “understand and respond to the differing messages they were receiving from official US channels on one hand and from Mr GIuliani on the other”. Subpoenaed to give evidence to Congress. Reuters 18/19 Gordon Kent A career diplomat, he was number two at the Ukraine embassy under Marie Yovanovitch. He has been subpoenaed to give evidence to Congress. Getty 19/19 Ulrich Brechbuhl An adviser to secretary of state Mike Pompeo, with whom he has run businesses. The two were also at West Point military academy together. Swiss-born Brechbuhl is said to handle “special diplomatic assignments”. Subpoenaed to give evidence to Congress. Getty 1/19 Donald Trump Accused of abusing his office by pressing the Ukrainian president in a July phone call to help dig up dirt on Joe Biden, who may be his Democratic rival in the 2020 election. He also believes that Hillary Clinton’s deleted emails - a key factor in the 2016 election - may be in Ukraine, although it is not clear why. Reuters 2/19 The Whistleblower Believed to be a CIA agent who spent time at the White House, his complaint was largely based on second and third-hand accounts from worried White House staff. Although this is not unusual for such complaints, Trump and his supporters have seized on it to imply that his information is not reliable. Expected to give evidence to Congress voluntarily and in secret. Getty 3/19 The Second Whistleblower The lawyer for the first intelligence whistleblower is also representing a second whistleblower regarding the President's actions. Attorney Mark Zaid said that he and other lawyers on his team are now representing the second person, who is said to work in the intelligence community and has first-hand knowledge that supports claims made by the first whistleblower and has spoken to the intelligence community's inspector general. The second whistleblower has not yet filed their own complaint, but does not need to to be considered an official whistleblower. Getty 4/19 Rudy Giuliani Former mayor of New York, whose management of the aftermath of the September 11 attacks in 2001 won him worldwide praise. As Trump’s personal attorney he has been trying to find compromising material about the president’s enemies in Ukraine in what some have termed a “shadow” foreign policy. In a series of eccentric TV appearances he has claimed that the US state department asked him to get involved. Giuliani insists that he is fighting corruption on Trump’s behalf and has called himself a “hero”. AP 5/19 Volodymyr Zelensky The newly elected Ukrainian president - a former comic actor best known for playing a man who becomes president by accident - is seen frantically agreeing with Trump in the partial transcript of their July phone call released by the White House. With a Russian-backed insurgency in the east of his country, and the Crimea region seized by Vladimir Putin in 2014, Zelensky will have been eager to please his American counterpart, who had suspended vital military aid before their phone conversation. He says there was no pressure on him from Trump to do him the “favour” he was asked for. Zelensky appeared at an awkward press conference with Trump in New York during the United Nations general assembly, looking particularly uncomfortable when the American suggested he take part in talks with Putin. AFP/Getty 6/19 Mike Pence The vice-president was not on the controversial July call to the Ukrainian president but did get a read-out later. However, Trump announced that Pence had had “one or two” phone conversations of a similar nature, dragging him into the crisis. Pence himself denies any knowledge of any wrongdoing and has insisted that there is no issue with Trump’s actions. It has been speculated that Trump involved Pence as an insurance policy - if both are removed from power the presidency would go to Democratic House Speaker Nancy Pelosi, something no Republican would allow. AP 7/19 Rick Perry Trump reportedly told a meeting of Republicans that he made the controversial call to the Ukrainian president at the urging of his own energy secretary, Rick Perry, and that he didn’t even want to. The president apparently said that Perry wanted him to talk about liquefied natural gas - although there is no mention of it in the partial transcript of the phone call released by the White House. It is thought that Perry will step down from his role at the end of the year. Getty 8/19 Joe Biden The former vice-president is one of the frontrunners to win the Democratic nomination, which would make him Trump’s opponent in the 2020 election. Trump says that Biden pressured Ukraine to sack a prosecutor who was investigating an energy company that Biden’s son Hunter was on the board of, refusing to release US aid until this was done. However, pressure to fire the prosecutor came on a wide front from western countries. It is also believed that the investigation into the company, Burisma, had long been dormant. Reuters 9/19 Hunter Biden Joe Biden’s son has been accused of corruption by the president because of his business dealings in Ukraine and China. However, Trump has yet to produce any evidence of corruption and Biden’s lawyer insists he has done nothing wrong. AP 10/19 William Barr The attorney-general, who proved his loyalty to Trump with his handling of the Mueller report, was mentioned in the Ukraine call as someone president Volodymyr Zelensky should talk to about following up Trump’s preoccupations with the Biden’s and the Clinton emails. Nancy Pelosi has accused Barr of being part of a “cover-up of a cover-up”. AP 11/19 Mike Pompeo The secretary of state initially implied he knew little about the Ukraine phone call - but it later emerged that he was listening in at the time. He has since suggested that asking foreign leaders for favours is simply how international politics works. AFP via Getty 12/19 Nancy Pelosi The Democratic Speaker of the House had long resisted calls from within her own party to back a formal impeachment process against the president, apparently fearing a backlash from voters. On September 24, amid reports of the Ukraine call and the day before the White House released a partial transcript of it, she relented and announced an inquiry, saying: “The president must be held accountable. No one is above the law.” Getty 13/19 Adam Schiff Democratic chairman of the House intelligence committee, one of the three committees leading the inquiry. He was criticized by Republicans for giving what he called a “parody” of the Ukraine phone call during a hearing, with Trump and others saying he had been pretending that his damning characterisation was a verbatim reading of the phone call. He has also been criticised for claiming that his committee had had no contact with the whistleblower, only for it to emerge that the intelligence agent had contacted a staff member on the committee for guidance before filing the complaint. The Washington Post awarded Schiff a “four Pinocchios” rating, its worst rating for a dishonest statement. Reuters 14/19 Lev Parnas and Igor Fruman Florida-based businessmen and Republican donors Lev Parnas (pictured with Rudy Giuliani) and Igor Fruman were arrested on suspicion of campaign finance violations at Dulles International Airport near Washington DC on 9 October. Separately the Associated Press has reported that they were both involved in efforts to replace the management of Ukraine's gas company, Naftogaz, with new bosses who would steer lucrative contracts towards companies controlled by Trump allies. There is no suggestion of any criminal activity in these efforts. Reuters 15/19 Kurt Volker The former US ambassador to NATO was appointed special envoy to Ukraine, and is thought to have played a role in linking Giuliani with Ukraine officials. He resigned just before giving evidence to Congress, which had subpoenaed him. After his testimony it emerged that he had apparently told Giuliani that he was being fed false information about the Bidens from Ukrainian officials. Getty Images 16/19 Marie Yovanovitch A career diplomat who was appointed US ambassador to Ukraine towards the end of Barack Obama’s presidency. She was abruptly recalled from her post in May 2019 amid claims that she was not co-operating with Rudy Giuliani’s unorthodox activities in Ukraine. In the Ukraine phone call Trump refers to her as “the woman” and “bad news” and hints darkly at some sort of retribution, saying: “Well, she’s going to go through some things.” Subpoenaed to give evidence to Congress. AP 17/19 Gordon Sondland A Seattle hotelier who became US ambassador to the European Union after donating $1 million to Trump’s inauguration committee, despite having no diplomatic experience. According to the whistleblower, Sondland met Ukrainian politicians to help them “understand and respond to the differing messages they were receiving from official US channels on one hand and from Mr GIuliani on the other”. Subpoenaed to give evidence to Congress. Reuters 18/19 Gordon Kent A career diplomat, he was number two at the Ukraine embassy under Marie Yovanovitch. He has been subpoenaed to give evidence to Congress. Getty 19/19 Ulrich Brechbuhl An adviser to secretary of state Mike Pompeo, with whom he has run businesses. The two were also at West Point military academy together. Swiss-born Brechbuhl is said to handle “special diplomatic assignments”. Subpoenaed to give evidence to Congress. Getty\n\nA criminal investigation of Mr Giuliani raises the stakes of the Ukraine scandal for the president, whose dealings with the country are already the subject of an impeachment inquiry. It is also a stark turn for Mr Giuliani, who now finds himself under scrutiny from the same US attorney’s office he led in the 1980s, when he first rose to prominence as a tough-on-crime prosecutor and later ascended to two terms as mayor of New York.\n\nIt was unclear how far the investigation has progressed, and there was no indication that prosecutors in Manhattan have decided to file additional charges in the case. A spokeswoman for the US attorney in Manhattan, Geoffrey S Berman, declined to comment.\n\nMr Giuliani said that federal prosecutors had no grounds to charge him with foreign lobbying disclosure violations because he said he was acting on behalf of Mr Trump, not the Ukrainian prosecutor, Yuriy Lutsenko, when he collected the information on Ms Yovanovitch and the others and relayed it to the US government and the news media.\n\n“Look, you can try to contort anything into anything, but if they have any degree of objectivity or fairness, it would be kind of ridiculous to say I was doing it on Lutsenko’s behalf when I was representing the president of the United States,” Mr Giuliani said. Mr Lutsenko had chafed at Ms Yovanovitch’s anti-corruption efforts and wanted her recalled from Kiev.\n\nMr Giuliani also said he was unaware of any investigation into him, and he defended the pressure campaign on Ukrainians, which he led, as legal and above board.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nCNN and other news organisations reported that federal prosecutors were scrutinising Mr Giuliani’s financial dealings with his associates, but it has not been previously reported that federal prosecutors in Manhattan are specifically investigating whether he violated foreign lobbying laws in his work in Ukraine.\n\nMs Yovanovitch told impeachment investigators Friday that Mr Trump had pressed for her removal for months even though the State Department believed she had “done nothing wrong.”\n\nMr Giuliani had receded from the spotlight in recent years while he built a brisk international consulting business, including work in Ukraine. But he re-emerged in the centre of the political stage last year, when Mr Trump retained him for the special counsel’s investigation into Russian election interference.\n\nRussia’s sabotage also ushered in a new focus at the Justice Department on enforcing the laws regulating foreign influence that had essentially sat dormant for a half-century and under which Mr Giuliani is now being investigated.\n\nMr Giuliani said that because Democrats had questioned his business consulting for foreign clients, his contracts explicitly say he does not lobby or act as an agent of foreigners.\n\nThrough his two associates who also worked to oust the ambassador, Lev Parnas and Igor Fruman, Mr Giuliani connected early this year with Mr Lutsenko, who served as Ukraine’s top prosecutor until August. Mr Parnas and Mr Fruman had previously connected Mr Giuliani to Mr Lutsenko’s predecessor, Viktor Shokin, late last year.\n\nMr Parnas had told people that Ms Yovanovitch was stymieing his efforts to pursue gas business in Ukraine. Mr Parnas also told people that one of his companies had paid Mr Giuliani hundreds of thousands of dollars for an unrelated US business venture, and Mr Giuliani said he advised Mr Parnas and Mr Fruman on a Ukrainian dispute.\n\nMr Lutsenko had sought to relay the information he had collected on Mr Trump’s targets to US law enforcement agencies and saw Mr Giuliani as someone who could make that happen. Mr Giuliani and Mr Lutsenko initially spoke over the phone and then met in person in New York in January.\n\nMr Lutsenko initially asked Mr Giuliani to represent him, according to the former mayor, who said he declined because it would have posed a conflict with his work for the president. Instead, Mr Giuliani said, he interviewed Mr Lutsenko for hours, then had one of his employees – a “professional investigator who works for my company” – write memos detailing the Ukrainian prosecutors’ claims about Ms Yovanovitch, Mr Biden and others.\n\nMr Giuliani said he provided those memos to Secretary of State Mike Pompeo this year and was told that the State Department passed the memos to the FBI. He did not say who told him.\n\nMr Giuliani said he also gave the memos to the columnist, John Solomon, who worked at the time for The Hill newspaper and published articles and videos critical of Ms Yovanovitch, the Bidens and other Trump targets. It was unclear to what degree Mr Giuliani’s memos served as fodder for Mr Solomon, who independently interviewed Mr Lutsenko and other sources.\n\nMr Solomon did not immediately respond to a request for comment.\n\nThe lobbying disclosure law contains an exemption for legal work, and Mr Giuliani said his efforts to unearth information and push both for investigations in Ukraine and for news coverage of his findings originated with his defence of Mr Trump in the special counsel’s investigation.\n\nHe acknowledged that his work morphed into a more general dragnet for dirt on Mr Trump’s targets but said that it was difficult to separate those lines of inquiry from his original mission of discrediting the origins of the special counsel’s investigation.\n\nMr Giuliani said Mr Lutsenko never specifically asked him to try to force Mr Yovanovitch’s recall, saying he concluded himself that Mr Lutsenko probably wanted her fired because he had complained that she was stifling his investigations.\n\n“He didn’t say to me, ‘I came here to get Yovanovitch fired.’ He came here because he said he had been trying to transmit this information to your government for the past year, and had been unable to do it,” Mr Giuliani said of his meeting in New York with Mr Lutsenko. “I transmitted the information to the right people.”\n\nThe president sought to distance himself earlier Friday from Mr Giuliani, saying he was uncertain when asked whether Mr Giuliani still represented him. “I haven’t spoken to Rudy,” Mr Trump told reporters. “I spoke to him yesterday quickly. He is a very good attorney, and he has been my attorney.”\n\nMr Giuliani later said that he still represented Trump.\n\nThe New York Times", "description": "Federal prosecutors in New York City are investigating whether President Donald Trump’s personal lawyer Rudy Giuliani broke lobbying laws in his dealings in Ukraine, according to two people familiar with the inquiry.", "authors": ["Michael S Schmidt", "Ben Protess", "Kenneth P Vogel", "William K Rashbaum"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/12/08/rudy-giuliani-ukraine.jpg", "published_at": "2019-10-12"}