{"pub": "guardian", "url": "https://theguardian.com/food/2019/sep/22/nigel-slater-chicken-tarragon-crumble-spiced-plum-crumble-recipes", "downloaded_at": "2019-09-22 06:40:54.286327+00:00", "title": "Nigel Slater’s chicken tarragon crumble and plum crumble recipes", "language": "en", "text": "As much as I like a pastry-topped pie, I also like a crisper, lighter and more crumbly crust to contrast with a soft and creamy filling. Which is what happened this week when we set out to make chicken and tarragon pie. There was bread to use up, as there so often is. So the bread went into the food processor to become soft, fresh crumbs and the butter we could have used to turn crumbs into crust was replaced with the golden, roasted skin from the chicken, cooked crisp and then finely chopped. The filling, protected by the layer of savoury crumbs, was a mixture of roast chicken, tarragon and cream. There were smiles all round.\n\nThere was a sweet crumble, too. Particularly juicy fruit often does better with a single crust. A bottom layer of pastry is rarely anything but soggy when your filling is plums or damsons, fruit that seems to produce gallons of sweet-sour purple juice.\n\nParticularly juicy fruit often does better with a single crust\n\nSo a single layer it was, and this time, not only a crisp affair but a spiced one, too. I fetched all the sweet gingerbread spices down from their tins – mace, cinnamon, ginger and cardamom – to bring an autumnal essence to the traditional recipe of butter, flour and sugar. If Hansel and Gretel had made crumble, this would have been it.\n\nChicken tarragon crumble\n\nA substantial, though not heavy, dish of chicken, tarragon and cream that easily wins over friends. Rather than using butter and flour, the crumble crust is made with the crisp chicken skin and coarse breadcrumbs, so it is worth making from scratch rather than using leftover roast chicken – the skin needs to be crisp and freshly roasted. Much of the flavour comes from using the roasting juices in the filling. Steamed spinach, the leaves kept whole, is a sound accompaniment alongside the creamy filling.\n\nServes 4\n\nchicken thighs\n\ngarlic cloves 8, large\n\nolive oil 4 tbsp, plus extra\n\nleeks 4, medium\n\nparsley 3 heaped tbsp, chopped\n\ntarragon leaves 2 heaped tbsp, chopped\n\ndouble cream 500ml\n\nfresh white breadcrumbs 150g\n\nYou will need a deep baking dish, measuring approximately 18x28cm.\n\nSet the oven at 200C/gas mark 6. Put the chicken thighs in a roasting tin, each one set slightly apart from the next. Tuck a clove of garlic, whole and unpeeled, under each then pour over the olive oil and season with salt and black pepper. Bake for about 45 minutes, basting half-way through, until they are crisp-skinned and cooked through.\n\nCut the leeks into 3cm rounds, discarding the darkest and toughest of the leaves, then rinse very thoroughly in cold running water. Put them in a deep pan, pour in the roasting juices and fat from the chicken pan, then cover with a piece of greaseproof paper and a lid and leave to cook over a low to moderate heat for about 10 minutes. Check their progress and stir them as they soften, making sure they do not colour.\n\nMeanwhile, remove the meat from the bones, setting the skin aside, and tear into large pieces.\n\nPlace the roasting tin over a moderate heat and pour in the cream, scraping at any roasted bits on the pan and stirring them into the cream. Put the chicken meat into the roasting tin, stir in the parsley and tarragon and the leeks and check the seasoning. Transfer to a large baking dish.\n\nChop the chicken skin, mix it with the breadcrumbs, then scatter over the chicken. Trickle olive oil over the crumbs and bake for 20-25 minutes, until the crust is crisp and the sauce is bubbling.\n\nSpiced plum crumble\n\nFacebook Twitter Pinterest ‘We won’t get into an argument if you bring out a jug of custard’: spiced plum crumble. Photograph: Jonathan Lovekin/The Observer\n\nOne can get into a terrible row about the best accompaniment for any sort of fruit crumble. You have team custard, then those who insist on cream and others still who vote for firmer, sharper crème fraîche or yogurt. The delightful sourness of the plums seems to me to beg for sweet, yellow double cream, but we won’t get into an argument if you bring out a jug of custard. This spiced crumble is just as good cold as it is hot, even after a night in the fridge. Oh, and I do think it is worth grinding the cardamom fresh – while ground cinnamon and mace keep their magic, it tends to disappear from cardamom rather more quickly.\n\nServes 6\n\ngreen cardamom pods 12\n\nground cinnamon 2 tsp\n\nground mace ½ tsp\n\nground ginger 3 tsp\n\nmixed spice 2 tsp\n\nplums 750g\n\ncaster sugar 50g\n\nplain flour 150g\n\nbutter 85g\n\nlight muscovado sugar 75g\n\nground almonds 75g\n\nYou will also need a round baking dish measuring approximately 22cm in diameter, lightly buttered.\n\nSet the oven at 180C/gas mark 4. Open the cardamom pods using a heavy weight, then extract the brown seeds from within. Crush the seeds to a powder in a spice mill or using a pestle and mortar. Mix the ground cardamom with the cinnamon, mace, ginger and mixed spice.\n\nThe delightful sourness of the plums seems to me to beg for sweet, yellow double cream\n\nHalve the plums and discard their stones. Toss the fruit and caster sugar together and pile into a buttered baking dish. Put the flour in a large mixing bowl. Cut the butter into small cubes and rub into the flour with your fingertips until it resembles fine breadcrumbs. Alternatively, blend in a food processor. Stir in the muscovado sugar, ground spices and almonds, then sprinkle lightly with a tbsp of water. Shake the bowl back and forth until you have crumbs of different sizes, then scatter over the fruit.\n\nBake for about 50 minutes until deep golden brown and the fruit is bubbling through the crust.\n\nFollow Nigel on Twitter @NigelSlater", "description": "Crumbly crusts add the perfect topping to the juiciest fillings, says Nigel Slater", "authors": ["Nigel Slater"], "top_image": "https://i.guim.co.uk/img/media/d8d433be8594a595f72431d06d3a9676acd5ca2a/0_525_7025_4215/master/7025.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=8c99e34dbda2650e0c9a2fdfd0c3ad60", "published_at": "2019-09-22"}