{"pub": "guardian", "url": "https://theguardian.com/politics/2019/sep/06/criticism-grows-boris-johnson-use-police-officers-political-speech", "downloaded_at": "2019-09-06 12:11:11.284140+00:00", "title": "Police chief says force was not told about Boris Johnson speech plan", "language": "en", "text": "West Yorkshire police have criticised Boris Johnson for making a political speech before a backdrop of its officers, with the chief constable saying the force was assured this would not happen but that Downing Street changed plans at the last minute.\n\nThe prime minister has faced widespread condemnation for seeming to abuse the impartiality of police officers by making partisan comments about Brexit and an election at a police training college in Wakefield, West Yorkshire, with officers lined up behind him.\n\nBoris Johnson: police chief 'disappointed' at use of officers for Brexit speech – live news Read more\n\nIn a statement released on Friday, West Yorkshire police said the visit was meant to have four stages: touring the mounted section; an informal chat with new student officers; a five-minute speech about plans to recruit 20,000 new officers; and a longer address at the National Police Air Service (NPAS) base at the same site, without any officers present.\n\nThe chief constable, John Robins, said minutes before the first speech the force was told that the NPAS visit had been cancelled. He said: “I was therefore disappointed to see my police officers as a backdrop to the part of the speech that was not related to recruitment. I repeat that I am pleased that we were chosen as the focal point of the national recruitment campaign launch, but the good news of extra officers was overshadowed by the media coverage of other events.\n\n“It was the understanding of West Yorkshire police that any involvement of our officers was solely about police officer recruitment. We had no prior knowledge that the speech would be broadened to other issues until it was delivered.”\n\nJohnson’s speech was delayed by almost an hour, with officers made to wait standing up in the sun. Near the end of the Johnson’s sometimes rambling speech, an officer behind him had to sit down after feeling faint.\n\nThe shadow policing minister, Louise Haigh, later wrote to the Cabinet Office asking why the police were used for a highly political speech.\n\nHaigh wrote: “Not only was the precious time of these officers wasted, either by diverting them from their duties or depriving them of much-needed rest, but through no fault of their own they were put in an intolerable position by the nakedly party-political direction the event took.”\n\nShe added: “Police regulations are clear that they are strictly non-party political and cannot give the perception of such.”\n\nBarry Sheerman (@BarrySheerman) Boris Johnson copies his mentor & hero Donald Trump by making highly political speech using young police officers as a backdrop!\n\nThe Police Federation of England and Wales also criticised the event. “I am surprised that police officers were used as a backdrop for a political speech in this way,” said John Apter, the organisation’s national chair. “I am sure that on reflection all concerned will agree that this was the wrong decision and it is disappointing that the focus has been taken away from the recruitment of 20,000 officers. This is what we should be talking about – this is what is important.”\n\nA Downing Street spokeswoman said: “The PM’s long-planned visit was highlighting a national recruitment campaign for 20,000 new officers, which has been welcomed across the police service. It gave the PM the opportunity to see first-hand the outstanding training which new recruits receive, and to meet those who have committed their lives to keeping us safe.”\n\nThe West Yorkshire police and crime commissioner, Mark Burns-Williamson, called on Johnson to apologise. “To use police officers as the backdrop to what became a political speech was inappropriate and they shouldn’t have been put in that position. It clearly turned into a rant about Brexit, the opposition and a potential general election. There’s no way that police officers should have formed the backdrop to a speech of that nature.”\n\nLabour’s Yvette Cooper, the chair of the home affairs select committee, said: “For Boris Johnson to make so many police stop their training and work to be part of his political stunt is an abuse of power. Police officers and trainees are overstretched and need to be able to get on with their job, not have to waste time listening to Boris Johnson’s political press conference.”", "description": "PM is facing growing criticism for making political speech before backdrop of officers", "authors": ["Matthew Weaver", "Peter Walker", "Kate Proctor", "John Crace"], "top_image": "https://i.guim.co.uk/img/media/2bdc39c946d1a37ebee299232c0cdc62d4aa6450/0_205_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=85c097d4b67e734c612d14f386a857b7", "published_at": "2019-09-06"}