{"pub": "fox", "url": "https://foxnews.com/media/like-a-dawn-of-the-dead-scene-tucker-talks-to-san-francisco-shopkeeper-bitten-twice-by-vagrants", "downloaded_at": "2019-09-19 06:03:18.162137+00:00", "title": "'Like a \"Dawn of the Dead\" scene': Tucker talks to San Francisco shopkeeper bitten by homeless man", "language": "en", "text": "A San Francisco business owner is recounting a second run-in with the city's homeless population that ended in him being bitten.\n\nGilles DeSaulniers told Tucker Carlson Wednesday about his encounter earlier this month with a homeless man that left him with muscle damage in his arm from the bite wound.\n\n\"The last event, it was a guy who came in and we asked him to leave, and he left. He came back 15 minutes later to harass the employee,\" he said.\n\nDeSaulniers said his staff tried to subdue the man as others called the police.\n\nSAN FRANCISCO HOMELESS STATS SOAR: CITY BLAMES BIG BUSINESS, RESIDENTS BLAME OFFICIALS\n\n\"In the process, he decided to bite me, and one of the statements he made was, 'Why are you even calling the police -- they're not going to do anything -- they're just going to let me go'.\"\n\nCarlson said it is unbelievable something like that could happen in an American city.\n\n\"This is like a 'Dawn of the Dead' scene -- you were bitten,\" he said.\n\nDeSaulniers said it wasn't the first time, either.\\\n\nHe said he was previously bitten by a \"drugged-out\" woman coming in off the street.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nAnother woman was found in his business' restroom \"passed out with a needle in her leg ... and turning blue,\" he said.\n\nThe latest incident, involving the man who bit him, reportedly occurred when the vagrant pushed DeSaulniers' sister as she attempted to eject him from the store for a second time.\n\nAdam Aschebrock, 29, was arrested and accused of aggravated assault and battery, according to ABC7.", "description": "A San Francisco business owner recounted his second run-in with the city's homeless population that ended in him being bitten.", "authors": ["Charles Creitz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/sf-shop-owner.jpg", "published_at": "2019-09-19"}