{"pub": "dailymail", "url": "https://dailymail.co.uk/money/markets/article-7610851/Astrazeneca-gets-shot-arm-new-drugs-boosts-sales-5bn.html", "downloaded_at": "2019-10-26 00:20:10.270944+00:00", "title": "Astrazeneca gets shot in the arm from new drugs boosts sales to £5bn", "language": "en", "text": "Astrazeneca has hiked its sales forecasts for the second time this year amid booming demand for its new medicines.\n\nThe pharmaceuticals group said a surge in third quarter revenues was down to the success of its cancer drugs and a strong performance in China.\n\nIt said revenues rose to £5billion in the three months to September, up from £4.2billion the previous year and higher than the £4.6billion predicted by analysts.\n\nHealthy sales: Astrazeneca said a surge in third quarter revenues was down to the success of its cancer drugs and a strong performance in China\n\nThe strong numbers sent shares up 5.6 per cent, or 384p, to 7303p.\n\nAstra credited its performance to new medicines such as cancer treatments Tagrisso and Lynparza, with sales jumping by 62 per cent to £2.1billion overall.\n\nTagrisso is a once-a-day pill to treat patients who have lung cancer, while its Lynparza twice-daily tablets are used to treat women with ovarian cancer who have previously had chemotherapy.\n\nBoth are only given to people with certain genetic mutations.\n\nThese drugs also did well in developing countries such as China, where sales rose by 85 per cent.\n\nBoss Pascal Soriot, said: ‘The performance reinforces our confidence in delivering sustainable earnings growth.’", "description": "The pharmaceuticals group said revenues rose to £5billion in the three months to September, up from £4.2billion the previous year and higher than the £4.6billion predicted by analysts.", "authors": ["City", "Finance Reporter For The Daily Mail", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/20/20148896-0-image-a-13_1571944837437.jpg", "published_at": "2019-10-24"}