{"pub": "investing.com", "url": "https://investing.com/news/economy/top-5-things-to-know-in-the-market-on-thursday-1981520", "downloaded_at": "2019-09-19 23:13:41.190221+00:00", "title": "Top 5 Things to Know in the Market on Thursday", "language": "en", "text": "© Reuters.\n\nInvesting.com -- Central banks around the world make different responses to the Federal Reserve's rate cut, U.S. stocks are set for a lower opening, and some fresh saber-rattling pushes oil prices back up. Here's what you need to know in financial markets on Thursday, 19th September.\n\n1. Manic monetary Thursday\n\nThe global monetary policy easing cycle continued overnight as and Hong Kong both cut official interest rates, although the more important left its key rate unchanged and hinted it may ease at its next meeting in October.\n\nIn Europe, the strengthened against both the dollar and the euro after the left its key rate unchanged but tweaked the way it will calculate the penalty rate on excess bank reserves going forward, a measure it said would reduce the side-effects of negative interest rates on banks. The pulled off what it said it is likely to be its last interest rate hike for the foreseeable future.\n\nThe and are still to announce their monetary policy decisions.\n\nThe decisions came as the Organization for Economic Cooperation and Development for global growth this year to 2.9%, the lowest in a decade.\n\n2. Stocks set to open lower\n\nU.S. stock markets are set to open lower, reversing a late rally at the end of Wednesday’s trading that left markets little changed on the day after the Federal Reserve’s policy decisions and press conference.\n\nBy 6 AM ET, were down 51 points or 0.2%, while the contract was also down 0.2% and the contract was down 0.3%.\n\nChairman Jerome Powell indicated at his press conference that the Fed didn’t expect any significant weakening in the U.S. economy in the near term. That thesis will be tested at 8:30 AM ET, when the releases its regular business survey. There will also be the weekly at the same time.\n\n3. Fed to soothe money market again\n\nThe Federal Reserve is set to hold an overnight repo to ease conditions in the U.S. money market for a third day running.\n\nAs it did on Wednesday, the Fed will offer a maximum of $75 billion to banks in overnight funds. Banks had asked for $80 billion at Wednesday’s auction, meaning that there was another scramble at the margin for overnight funds on the open market, which drove the Fed funds rate up to over 2.30%, above the Fed’s old target range of 2%-2.25%.\n\nThere’s still no consensus as to the long-term significance of this liquidity squeeze. If, as many argue, the causes are largely technical and short-term, overnight rates should logically return to their targeted level within days. If they don’t, then the Fed may come under pressure to start buying assets again.\n\n4. Microsoft (NASDAQ: ) bumps up dividend, buybacks\n\nMicrosoft (NASDAQ: ) shares are set to hog the spotlight after the company and expanded the volume of its stock buyback program after the closing bell on Wednesday.\n\nThe board raised its quarterly dividend by 11% to 51c, although that still leaves an implicit annual dividend yield of only 1.5%, below the 1.9% average for the S&P 500.\n\nAdditionally, the company increased its open-ended stock buyback program by another $40 billion, or just under 4% of its market capitalization.\n\n5. Oil rises again on the tweets of war, Iraq report\n\nOil prices rose again as tweets by revived fears of military conflict in the Gulf, only hours after Saudi Arabia and the U.S. had appeared to play down the near-term risk of war.\n\nIran's Javad Zarif told CNN that the Iranian response to any military strike on it by either the U.S. or Saudi Arabia would be \"all-out war.\"\n\nIran's Javad Zarif told CNN that the Iranian response to any military strike on it by either the U.S. or Saudi Arabia would be \"all-out war.\"\n\nThe market was also unnerved by reports that Saudi Arabia had asked to buy millions of barrels of crude from Iraq in order to ensure the kingdom meets its commitments to its own customers. That was seen as undermining Saudi officials’ claims that they will rapidly restore output to the level it was at before the attacks on key energy installations at the weekend.\n\nBy 6 AM, futures were up 1.7% at $59.02 a barrel, while futures were up 2.3% at $65.11 a barrel.", "description": "Top 5 Things to Know in the Market on Thursday", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB610XS_L.jpg", "published_at": "2019-09-19"}