{"pub": "fox", "url": "https://foxnews.com/media/ingraham-dems-contorting-their-views-just-to-oppose-trump", "downloaded_at": "2019-10-17 05:16:00.298724+00:00", "title": "Ingraham: Dems 'contorting their views' just to oppose Trump", "language": "en", "text": "Laura Ingraham ripped the Democratic field Wednesday night and accused the party of changing their policies in order to oppose President Trump, specifically with the Syrian withdrawal.\n\n\"The president has worked tirelessly to drain the swamp with massive deregulation, phenomenal judges and a tax cut for working families. Markets are up. Wages are up. Unemployment is way down across all key demographic groups and on foreign policy. He has likewise been remarkably consistent on his pledge to put America first,\" Ingraham said on \"The Ingraham Angle\" making the case for Trump. \"He said he was gonna do this and he's doing it. He's winding down foreign entanglements, long term military interventions that I seem to recall Democrats used to be against.\"\n\nON SYRIA, TRUMP ACCUSES GRAHAM OF WANTING 'TO STAY IN THE MIDDLE EAST FOR THE NEXT THOUSAND YEARS'\n\nIngraham criticized Democrats for not supporting Trump even though Obama made the same points regarding foreign conflicts during his presidency. She also accused the Democratic presidential candidates of opposing the president for the sake of opposing him.\n\n\"By the end of the evening it was obvious that the Democrats will say and do at this point almost anything, including contort their own views on key issues just to oppose Trump,\" Ingraham said, referencing the debate Tuesday night.\n\nThe host criticized former Vice President Joe Biden, Elizabeth Warren and Bernie Sanders for their policies.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"The candidates think Trump's a menace and he's got to go. But other than that, their policy prescriptions are kind of a mishmash,\" Ingraham said. \"Biden thinks that if he wins, things are just magically go back to Obama. That whole era when Democrats were partying at the White House with Stevie Wonder and Tom Hanks. As for Warren and Sanders, you know, adopting a European style socialist approach, which last time I checked isn't working anywhere in the world now.\"", "description": "Laura Ingraham ripped the Democratic field Wednesday night and accused the party of changing their policies in order to oppose President Trump, specifically with the Syrian withdrawal.", "authors": ["Victor Garcia"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/17/694940094001_6095420879001_6095422478001-vs.jpg", "published_at": "2019-10-17"}