{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/27/friday-briefing-bishops-call-tone-of-brexit-debate-unacceptable", "downloaded_at": "2019-09-27 07:15:49.484659+00:00", "title": "Friday briefing: Bishops call tone of Brexit debate 'unacceptable'", "language": "en", "text": "Top story: Johnson refuses to retract Jo Cox comments\n\nGood morning and welcome to the final briefing of the week, with Alison Rourke.\n\nChurch of England bishops say the tone of the Brexit debate has become unacceptable, as the PM continues to face intense criticism over his Commons performance. In a joint statement released today, they call for people inside and outside parliament to treat each other with greater respect, and it is “easy to descend into division and abuse”. They also offer thinly veiled criticism of the prime minister’s insistence that the supreme court was mistaken about proroguing parliament. “We call on politicians to adhere rigorously to the rule of law and on all to respect and uphold the impartiality of the courts and our judiciary,” they say. It follows a host of MPs speaking out about receiving threats and after Dominic Cummings suggested that only carrying out Brexit would calm the tensions. Boris Johnson has vowed to carry on referring to the Benn law against no-deal Brexit as the “surrender bill”. He also declined to retract his comments that the best way to honour Jo Cox was to get Brexit done. “The death of Jo Cox was an absolute tragedy which I think bought the House of Commons together in unison. But it’s also important to protect the right of MPs to speak freely in the House of Commons about important political matters and the fact of the so-called Benn Act is that it surrenders our powers.” Meanwhile, Whitehall’s spending watchdog says ministers still don’t know whether there are enough medicines, medical supplies or freight capacity to support the NHS if the UK leaves the EU without a deal on Halloween.\n\nPlay Video 0:58 Boris Johnson says he ‘deplores threats’ but will continue using same language – video\n\n‘This is a cover-up’ – Donald Trump has upped the ante in the Ukraine memo scandal, by likening the sources who gave the whistleblower the details of his now-infamous phone call to Ukraine’s leader to spies. “You know what we used to do in the old days, when we were smart, right? The spies and treason? We used to handle it a little differently than we do now,” Trump said. His comments came amid claims by the whistleblower that the White House intervened to “lock down” the transcript of the call, “especially the official word-for-word transcript of the call that was produced as is customary by the White House Situation Room”. Officials were directed by White House lawyers to remove the transcript from the computer system where “such transcripts are typically stored” the whistleblower said, and instead it was stored in a separate system used to handle classified information. According to the whistleblower, “this set of actions underscored to me that White House officials understood the gravity of what had transpired in the call.” The Democratic House Speaker, Nancy Pelosi, criticised the White House for trying to keep the transcript secret: “This is a cover-up”.\n\nPolice vetting – Forces are failing to deal with predatory officers among their ranks who target vulnerable victims of crime, witnesses and suspects, for sex. A report by HM Inspectorate of Constabulary and Fire & Rescue Services has revealed around 35,000 of the workforce have not been properly vetted. At West Midlands police, 52% of staff and officers were not vetted. For the Metropolitan police, the figure was 37% and 42% at Thames Valley police. Five forces – Devon and Cornwall, Hertfordshire, Northamptonshire, Nottinghamshire and West Yorkshire – were unable to provide inspectors any information about vetting. Meanwhile, Cleveland police has become the first force to be branded “failing” in all areas by inspectors and will be forced to take on special measures, which means the chief constable and police and crime commissioner will be called before a national board and questioned about their plans to ensure “critical improvements” are made.\n\nStena Impero – There are reports that the UK-flagged oil tanker detained by Iran in the Strait of Hormuz has exited the Iranian port of Bandar Abbas. The tanker was detained by the Revolutionary Guards in July for alleged marine violations two weeks after Britain seized an Iranian tanker off the territory of Gibraltar. It comes as the EU has privately warned Iran that it will be forced to start withdrawing from the 2015 nuclear deal if Tehran carries out threats to take new steps away from its commitments. The warning makes it clear the agreement is on life support as Tehran has said it will take further action in November if the US does not lift economic sanctions. Iran has already breached three of its commitments in the agreement, including on increasing its low-enriched uranium stockpile above agreed limits. The EU has refused for 16 months to join the US in pulling out of the deal, but tensions have escalated since the drone attack on Saudi oil facilities.\n\nNursing shortage – In a major U-turn, ministers are reconsidering financial aid for student nurses to help tackle the worsening shortage. The shortage in England’s health service has spiralled to 40,000 vacancies since George Osborne abolished bursaries and replaced them with student loans in 2015. Assistance could include cost of living grants of £3,000 to £5,000.\n\nWelsh wording – Cardiff council has backed a plan to give new streets in the city Welsh-only names. The council will also make sure existing signs on city centre streets will be in Welsh and English when they are upgraded. The policy, due to be put before the full council for final approval next month, says new streets should be given a Welsh name “consistent with the local heritage and history of the area”. The number of Welsh speakers in the capital has more than doubled in 40 years.\n\nBabies on a plane – Japan Airlines unveiled an online booking tool that indicates where infants and toddlers will be seated. When passengers with children aged between eight days and two years old reserve their seat, a child icon automatically appears on the seat plan, alerting other passengers who have yet to select their seats. The airline said the feature does not guarantee that passengers will be out of earshot of crying infants and will not appear if a flight is booked through a third party or part of a tour group. It attracted praise on social media including from one businessmen who suggested it “really ought to be mandatory across the board.”\n\nToday in Focus podcast: Prince Andrew’s damaged reputation\n\nLast week Jeffrey Epstein accuser Virginia Roberts did her first television interview, and in it restated claims that she had been made to have sex with Prince Andrew when she was 17. Royal correspondent Chris Ship discusses the Duke of York’s friendship with deceased paedophile Jeffrey Epstein. And: Labour MP Paula Sherriff on standing up to prime minister Boris Johnson.\n\nToday in Focus Prince Andrew's damaged reputation Sorry your browser does not support audio - but you can download here and listen https://audio.guim.co.uk/2019/09/26-68687-20191927_TIF_Andrew.mp3 00:00:00 00:29:47\n\nFacebook Twitter Pinterest Prince Andrew denies he had any form of relationship with Virginia Roberts. Photograph: Jonathan Brady/PA\n\nLunchtime read: Inside the student mental health crisis\n\nA surge in anxiety, mental breakdowns, depression and stress is sweeping British university campuses. “Above all, a growing proportion just seem terrified of failure, and experience the whole process of learning and assessment as an unforgiving ordeal that offers no room for creativity or mistakes,” says William Davies, lecturer at Goldsmiths and author of The Happiness Industry, a book about the commercialisation of wellbeing. One study found that six times more young people in England (aged four to 24) have psychological problems today than a generation ago, in 1995. Samira Shackle looks at the complex issues campuses are facing and the strategies universities are using to help and support their students.\n\nSport\n\nEngland were caught up in the high-tackle storm that has engulfed the Rugby World Cup with Owen Farrell lucky to avoid serious injury after a sickening blow to the head against the USA and Piers Francis facing a possible ban. As was entirely apt for this summer of summers, Essex clinched the County Championship not with a damp whimper but in a heart-stopping afternoon at Taunton. The IAAF is discreetly moving away from using the term “fastest loser” on the eve of the world championships after complaints that the phrase might devalue athletes’ achievements. Fiorentina made Arsenal’s cruise into the last 16 of the Champions League a little more uncomfortable than they would have liked but a Kim Little penalty and a Vivianne Miedema goal either side of the break ensured a 2-0 win in north London. It is almost a year to the day since Salford secured survival on the final day of the Super League season: now they are just one win away from a first appearance in the Grand Final having beaten Castleford. Andy Murray produced another encouraging performance before being outlasted 4-6, 6-2, 6-4 by Australia’s Alex de Minaur in two hours and 42 minutes in the second round of the Zhuhai Championships in China. And organisers of the 2022 World Cup in Qatar are close to a deal that would lead to alcohol being subsidised and more readily available during the tournament.\n\nBusiness\n\nBritain has its highest level of empty shops in five years as stores are hit by rising costs and low consumer confidence. Nearly 12% of shopping locations were empty in the first half of 2019, up 0.6% compared with the same period last year, according to research from Local Data Company’s review of 3,000 retail centres. Major chains have shrunk dramatically, with 3,508 fewer sites operating compared with a year ago after a fall of 2,848 in the first half of 2018, with Toys R Us, Poundworld and Maplin going bust and retailers such as New Look, Carpetright and Mothercare undergoing restructures.\n\nThe pound is buying €1.129 and $1.233.\n\nThe papers\n\nFacebook Twitter Pinterest Photograph: The Guardian\n\nMost of the front pages lead on news of Boris Johnson’s determination to continue using “surrender” language in the Brexit debate, or claims from the US whistleblower about Trump’s call with Ukraine.\n\nThe Express says: “Boris: I won’t surrender no deal threat”, the i reports on comments by Rachel Johnson: “Johnson’s sister joins criticism of ‘bully’ PM”, the Times quotes a senior cabinet minister in its headline: “‘Deliver Brexit or face riots’”, and the Telegraph has: “Cummings: What do MPs expect?” with the prime minster’s adviser saying it wasn’t surprising some people were angry about the Brexit delay.\n\nThe FT’s lead is: “White House covered up Trump’s Ukraine call, says whistleblower” and the Guardian has: “White House accused of cover-up over Trump call”.\n\nThe Mail’s splash is a report that: “Bank scammers steal £1m a day”, the Sun has news that Strictly’s Shirley Ballas is having her implants removed over cancer fears: “I’m having breast op on Tuesday, back in Strictly by Saturday” and the Mirror has a story of drink-driving charges against Derby Country football players: “Footie stars drink shame”.\n\nSign up\n\nThe Guardian Morning Briefing is delivered to thousands of inboxes bright and early every weekday. If you are not already receiving it by email, you can sign up here.\n\nFor more news: www.theguardian.com", "description": "PM won’t abandon ‘surrender’ language … White House accused of cover-up over Ukraine memo … and one airline’s solution to crying babies on a plane", "authors": ["Alison Rourke"], "top_image": "https://i.guim.co.uk/img/media/c2ca2004f2b452a7ce85b0f330c08658022a755e/65_51_2748_1649/master/2748.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=172168b0ccee398d7183b6610a6449a0", "published_at": "2019-09-27"}