{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/09/15/new-york-times-pr-department-clarifies-questions-raised-about-new-kavanaugh-accusation-n2553123", "downloaded_at": "2019-09-15 23:10:04.868180+00:00", "title": "New York Times' PR Department 'Clarifies' Questions Raised About New Kavanaugh Accusation", "language": "en", "text": "The New York Times on Saturday published an opinion piece from reporters Robin Pogrebin and Kate Kelly, who claim to have details about a new accuser and sexual assault allegation against Supreme Court Justice Brett Kavanaugh. The piece was an excerpt from their upcoming book, “The Education of Brett Kavanaugh: An Investigation.”\n\nThe excerpt showed up in the opinion section, which caused confusion.\n\nWe would like to address the questions we’re seeing related to a book excerpt in today’s Sunday Review section. — NYTimes Communications (@NYTimesPR) September 15, 2019\n\nThe book, “The Education of Brett Kavanaugh: An Investigation” by New York Times reporters Robin Pogrebin and Kate Kelly, is a well-reported and newsworthy account that reveals new details and sheds new light on a matter of significant national interest. — NYTimes Communications (@NYTimesPR) September 15, 2019\n\nThe excerpt of the book was published in the Sunday Review, a section that includes both news analysis and opinion pieces. The section frequently runs excerpts of books produced by Times reporters. — NYTimes Communications (@NYTimesPR) September 15, 2019\n\nBut, according to the Times, the excerpt didn't show up in the newspaper beforehand because the revelation came about during the book's research.\n\nThe new revelations contained in the piece were uncovered during the reporting process for the book, which is why this information did not appear in The Times before the excerpt. — NYTimes Communications (@NYTimesPR) September 15, 2019\n\nAnd, to make things worse, someone at the news outlet wrote a disgusting tweet promoting the excerpt. But it wasn't long before the tweet was deleted.\n\nThe Times said they are \"reviewing the decision-making with those involved\" in handing the outlet's social media accounts.\n\nAlso, a tweet that went out from the @NYTOpinion account yesterday was clearly inappropriate and offensive. We apologize for it and are reviewing the decision-making with those involved. — NYTimes Communications (@NYTimesPR) September 15, 2019\n\nThe Federalist's Mollie Hemingway pointed out a couple very important facts about this book, the biggest issue being the lack of corroboration.\n\nThe book notes, quietly, that the woman Max Stier named as having been supposedly victimized by Kavanaugh and friends denies any memory of the alleged event. Seems, I don’t know, significant. — Mollie (@MZHemingway) September 15, 2019\n\nAuthors go after Kavanaugh as “disingenuous” for quoting incendiary things said **about him** by Senate Democrats while ignoring that Trump had said “acidic” and “denigrating” things like when he “belittled the North Korean leader Kim Jong-in.” Really. — Mollie (@MZHemingway) September 15, 2019\n\nLeland Keyser, the sole female witness named by Christine Blasey Ford is quoted by NYT reporters saying \"I don't have any confidence in the story.\" We previously published the full explosive details in Justice on Trial. — Mollie (@MZHemingway) September 15, 2019\n\nThe NYT reporters, it goes without saying, downplay the significance of this and all the other many facts/stories/quotes/details that cast doubt on the unsupported allegations against Kavanaugh. — Mollie (@MZHemingway) September 15, 2019\n\nThe Times is quick, yet again, to drag Kavanaugh's name through the mud yet they cherry pick what \"facts\" they present. Even based on the wording and phrases used in the excerpt, it's clear the reporters have their own personal vendetta: they want Kavanaugh ousted from the Supreme Court.", "description": "Nice try..09/15/2019 19:10:04PM EST.", "authors": ["Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/283/4b28ff5f-8664-4e42-bae7-acd9d0849d0e.jpg", "published_at": "2019-09-15"}