{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/china-s-economy-grew-at-slowest-rate-since-the-1990s-and-it-could-yet-get-worse-1028610179", "downloaded_at": "2019-10-18 10:38:30.792457+00:00", "title": "China's economy grew at slowest rate since the 1990s — and it could yet get worse", "language": "en", "text": "REUTERS/Aly Song\n\nChina's economy grew at 6% between July and September — the slowest growth rate since 1992.\n\nMuch of this was down to slowing demand from abroad, as the trade war weighs on Chinese production.\n\nThe fear is that this slowdown will have knock-on effects to other major economies, like Germany, and could further drag global growth.\n\nView Markets Insider's homepage for more stories.\n\nChina economy grew at 6% in the last quarter, the slowest since 1992, as the trade war bites into the global economy.\n\nThe number, from China's National Bureau of Statistics, missed analyst expectations of 6.1% from Bloomberg's median, as a slowdown in industry outweighed a pick up in services activity. Julian Evans-Pritchard, China economist at Capital Economics, says it's the lowest growth rate the country has posted since quarterly figures were released in 1992.\n\nMuch of this slowdown can be attributed to slowing demand from abroad, both for Chinese goods going out and foreign goods coming into China — with the trade war playing a large part in this due to the decline in American imports and exports.\n\n\"Pressure on economic activity should intensify in the coming months,\" Evans-Pritchard said in an email. \"Cooling global demand will continue to weigh on exports, fiscal constraints mean that infrastructure spending will wane in the near-term, and the recent boom in property construction looks set to unwind.\"\n\nEvans-Pritchard added he expects monetary policy to loosen to help drive growth, but \"it will take time for this to put a floor beneath economic growth.\"\n\nFears now that the global economy is flirting with a recession will have grown due to the figures coming from China, given the importance China plays in the world economic system — other countries that rely on China such as Germany will be hampered by this, as we have already seen manufacturing slip in the past year.\n\nLast week the IMF's chief economist, Gita Gopinath, warned that trade wars could slow global growth to the slowest rate since the financial crisis of 2008/9.\n\n\"The weakness in growth is driven by a sharp deterioration in manufacturing activity and global trade, with higher tariffs and prolonged trade policy uncertainty damaging investment and demand for capital goods,\" Gopinath said adding that \"To rejuvenate growth, policymakers must undo the trade barriers put in place with durable agreements, rein in geopolitical tensions, and reduce domestic policy uncertainty.\"\n\nElsewhere in the report, China saw an uptick in industrial production from 4.4% in August to 5.8% in September as well as retail sales moving from 7.5% to 7.8%.\n\nCapital Economics", "description": "China's economy grew at 6% between July and September — the slowest growth rate since 1992. Much of this was down to slowing demand from abroad, as ...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5da9698bcc4a0a21040be913-1999/china-chinese-trader-shanghai-stocks.jpg", "published_at": "2019-10-18"}