{"pub": "businessinsider", "url": "https://businessinsider.com/shay-bradley-pranked-his-funeral-with-recorded-message-2019-10", "downloaded_at": "2019-10-15 16:55:32.161681+00:00", "title": "A dead man pranked his family at his own funeral by using a recording to scream 'Let me out!' as they put his coffin in the ground", "language": "en", "text": "At a funeral held for Shay Bradley in Kilkenny, Ireland, over the weekend, he pranked his loved ones with a message from beyond the grave.\n\nAs Bradley's coffin was lowered into the ground, the recording said: \"Hello, hello — let me out! Where the f--- am I? Let me out, let me out. It's f------ dark in here.\"\n\nAccording to an obituary for Bradley, he died after a \"long illness.\"\n\nHis daughter, Andrea Bradley, told HuffPost that her father recorded the audio about a year ago in preparation for his death.\n\nShe said in a Facebook post that his dying wish was to have the audio recording played during his funeral.\n\nVisit Insider's homepage for more stories.\n\nA man in Ireland got the last laugh at his funeral after pranking mourners with a recording from beyond the grave.\n\nLoved ones attending the funeral of Shay Bradley, a 62-year-old veteran of the Irish Defence Force, were shocked when they heard his voice as his coffin was lowered into the ground in Kilkenny, Ireland.\n\n\"Hello, hello — let me out!,\" a prerecorded message from Bradley said, according to a video of the prank posted on Twitter.\n\n\"Where the f--- am I? Let me out, let me out. It's f------ dark in here. Is that the priest I can hear? This is Shay, I'm in the box. No, in f------ front of you. I'm dead.\"\n\nBradley then began singing \"Hello again, hello. Hello, I just called to say goodbye.\"\n\nYou can see video of the prank below:\n\nAccording to an obituary for Bradley published by Fanagans Funeral Directors, he died after a \"long illness.\"\n\nBradley's daughter, Andrea Bradley, told HuffPost that her father's dying wish was to have the audio recording played during his funeral.\n\nShe told HuffPost that her father recorded the audio about a year ago, and the only people who knew about it were her, her brother, and her nephew. Days before the funeral, Andrea's brother told their mother and the rest of his siblings about the prank.\n\nRead more: A YouTuber tricked influencers into thinking they'd been sent pieces of the moon, but it was actually just gravel\n\n\"He wanted to make sure my mam would be laughing leaving the cemetery, not crying,\" she told HuffPost. She said her parents had been married for 43 years.\n\nAndrea added that her father's recording was a way of \"saying not only goodbye, but to also say 'OK the sadness is over now, here is a laugh so you can go and celebrate my life with a smile on your face.'\"", "description": "At a funeral held for Shay Bradley in Ireland on October 12, loved ones were shocked when they heard his voice coming from the coffin.", "authors": ["Kelly Mclaughlin"], "top_image": "https://image.businessinsider.com/5da5f166695b581d88717ed2?width=1200&format=jpeg", "published_at": "2019-10-15"}