{"pub": "telegraph", "url": "https://telegraph.co.uk/travel/cruises/articles/greece-cruise-on-board-seadream-II", "downloaded_at": "2019-10-05 14:47:21.882128+00:00", "title": "Island-hopping in Greece on the cruise ship that thinks it's a luxury yacht", "language": "en", "text": "“They’re plump, they’re sassy and they floss their teeth.” I had just stepped off a tender boat into the furnace-hot heat of Hydra and our SeaDream tour manager, Jeff, was introducing the local transport. A heat haze that danced above the jetty but I could just make out a handful of tethered donkeys at the far end. Groomed, lustrous and well padded, these were the Mercedes of donkeys. With one eye on my flip-flops and the other on the ladders of steps that comb the hillside town one of the muleteers handed me his card. “For later,” he winked.\n\nAlthough I had no intention of riding one, donkeys are the modus operandi on this car-free, picture-postcard Greek island. It is said that during Leonard Cohen’s stint here in the Sixties Hydra’s famous adopted son knew he had become one of the locals when the rubbish collector began calling at his house, (which I later hoped to find), with a donkey. Mules move everything from groceries and building supplies to fridges, octogenarians and mountains of lemons. All of these loads overtook me as I wound uphill past townhouses, pocket-sized chapels and mansions flanked by exotic gardens and well-tended courtyards towards the Monastery of St Constantine.\n\nThis was much-needed exercise. While most passengers on the 112-passenger SeaDream II had spent a few days in our ship’s embarkation port of Dubrovnik, or were enjoying the luxury of a back-to-back cruise, I had arrived fresh from the office and as tightly wound as a Swiss clock at a Brexit negotiating table. With stops at Itea, Hydra, Patmos, Naxos and Mykonos we would sail through maritime passages that resonate with mythology.\n\nBut as we approached our first port, Itea, and SeaDream II emptied out for excursions to Delos, or a cycle ride through Parnassos National Park, I flopped onto one of the ship’s day beds and lined up my Kindle with the horizon – and pretty much stayed that way for two days. It doesn’t take long to slip into the rhythm of life at sea when each day the sun shines, breakfast segues into lunch and the ship motors gently on to drop anchor at the next harbour.", "description": "At first, the absence of announcements (so prevalent on larger ships) gave me FOMO.", "authors": ["Teresa Machan", "Travel Writer"], "top_image": "https://www.telegraph.co.uk/content/dam/Travel/Cruise/luxury/Hydra-iStock-crop-xlarge.jpg?imwidth=1200", "published_at": "2019-10-04"}