{"pub": "reuters", "url": "https://in.reuters.com/article/fashion-trend-wrap-up/prints-great-and-small-dominate-colourful-spring-catwalks-idINKBN1WH1L2", "downloaded_at": "2019-10-02 15:43:07.361683+00:00", "published_at": "2019-10-02", "title": "Prints great and small dominate colorful spring catwalks", "language": "en", "text": "(Reuters) - Wondering what to wear for your holiday next summer? Plenty of colors and bold prints in all shapes and forms, according to designers who presented their latest creations on the catwalks of New York, London, Milan and Paris.\n\nFILE PHOTO: Models present creations by designer Virginie Viard as part of her Spring/Summer 2020 women's ready-to-wear collection show for fashion house Chanel during the Paris Fashion Week in Paris, France, October 1, 2019. REUTERS/Gonzalo Fuentes\n\nAfter nearly four weeks of runway shows that began in New York in early September, the spring/summer 2020 womenswear catwalk calendar wrapped up in Paris on Tuesday with colorful presentations at Chanel and Louis Vuitton.\n\nBrightly-colored wigs and plenty of animal prints at the Jeremy Scott show in New York kicked off the trend. There were florals at the Carolina Herrera show.\n\n“For spring everyone loves a good print,” said Marielle Bobo, fashion director at Essence magazine. “Mixed prints was something we saw a lot of on the runways here in New York.”\n\nBobo said she noted a lot of lime green creations. Bright colors opened the London shows, which kicked off with Mark Fast’s rainforest-inspired line. Bold colors also popped up on dresses and shoes at Molly Goddard and Victoria Beckham.\n\n“We’ve seen some great use of color, whether it’s nude tones mixed in with saturated oranges and greens and blues,” London-based stylist PC Williams said.\n\n“Interesting uses of design details, I loved particularly the feathering and fringing detail used in a lot of designs.”\n\nFringes appeared at Burberry, where creative chief Riccardo Tisci decorated skirts, sleeves and dresses with them. He nodded to nature, putting trees and animals on printed tops and skirts.\n\nThe nature theme was also evident in Milan, where Giorgio Armani called his collection “Earth”; the jungle theme took over the Versace and Dolce & Gabbana catwalks, where tropical prints dominated.\n\nOn the leopard print Dolce & Gabbana catwalk, models wore safari-inspired khaki ensembles, before giraffe, tiger, zebra and leopard prints took over. Parrots and pelicans adorned designs as did florals, fruit and tropical leaf patterns.\n\n“We saw really the explosion of the jungle style from Versace with Jennifer Lopez on the catwalk with the jungle dress ... to Dolce & Gabbana (with) this background of the jungle and all this animal print,” Silvia Grilli, Grazia Italy editor-in-chief said.\n\nSUSTAINABILITY\n\nThe green theme continued in Paris, where Christian Dior unveiled looks marked by vines, thorns and thistles, while Stella McCartney’s used recycled polyester, organic cotton and sustainable raffia in her fluid and floral creations.\n\n“The big color of the season is teal-blue,” Godfrey Deeny, Global editor-in-chief of FashionNetwork.com, said, also noting “a form of hyper-romanticism” on the Paris catwalks.\n\n“It’s maybe an expression once again of the environment. It’s very pure, oceanic color. It’s a color associated with nature, with a bird.”\n\nSlideshow (2 Images)\n\nAs consumers become more aware of the industry’s environmental impact, brands are seeking to better their green credentials. Burberry said its show had been certified as carbon neutral while Dior’s catwalk was lined with trees that were to be replanted around Paris.\n\n“Sustainability is the big buzz word of the season,” Deeny said. “But sometimes it means taking your own material or own ideas and re-purposing it, upcycling it and re-imagining it.”\n\nFor footwear, fashionistas noted an array of heels, sandals and boots.", "description": "Wondering what to wear for your holiday next summer? Plenty of colors and bold prints in all shapes and forms, according to designers who presented their latest creations on the catwalks of New York, London, Milan and Paris.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191002&t=2&i=1436272672&w=1200&r=LYNXMPEF91150"}