{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7567651/Lynda-Bellinghams-widow-marrying-new-partner-church-funeral-held-in.html", "downloaded_at": "2019-10-13 09:27:13.549071+00:00", "title": "Lynda Bellingham's widow is marrying his new partner in the SAME church her funeral was held in", "language": "en", "text": "Lynda Bellingham's widower has revealed he will marry his new girlfriend in the same church his late wife's funeral was held in.\n\n\n\n\n\nMichael Pattemore, 64, is set wed his new partner Pam Shotton, and claims he has the blessing of 'Oxo mum' Lynda, whom he was married to for eight years before she died from bowel cancer in 2014 at the age of 66.\n\n\n\n\n\nHe revealed to the Sunday Mirror that he popped the question to Pam - who also lost her husband to cancer - during a church service, and insisted that the Loose Women star had given him her blessing on her death bed and is 'wishing them both well'.\n\nLynda Bellingham's widower Michael Pattemore will soon remarry his new girlfriend Pam Shotton in the same church his late wife's funeral was held in. He claims he has the blessing of 'Oxo mum' Lynda, who he was married to for eight years and feels she is 'wishing them both well'\n\nMichael began dating office manager Pam in 2017 after meeting through a mutual friend and previously descprbed her as a 'tonic'\n\nHe said: 'I got down on bended knee and asked Pam to marry me during a church service and she said, \"Yes\".\n\n'Lynda told me when she was sick in hospital, \"I want to think you'll find another love one day\".\n\n'I know she is looking down on us both and wishing us well. I feel her presence all the time. Not many people get a second chance like this.'\n\nMichael began dating office manager Pam in 2017 after meeting through a mutual friend and previously described her as a 'tonic'.\n\nIt was revealed in the same year that Michael had re-written his will to cut Lynda's children - his stepsons - out of any inheritance from their mother's estate.\n\nHe says the decision was made after suffering '18 months of hell' as the grown up sons of the 'Oxo mum' accused him of being a gold digger and squandering money on luxury holidays.\n\n'Oxo mum' Lynda tragically died from bowel cancer in 2014 at the age of 66 and her husband said she gave him her blessing on her death bed\n\nThe former timeshare salesman also confessed that the choice was going back on a promise to his late wife that her sons Michael, 34, and Robbie, 29, would be looked after financially when he dies.\n\nHe estimated they would miss out on an inheritance of up to £2m from a property portfolio of five homes.\n\nPattemore said in his original will he had agreed that Bellingham's sons would receive £1m from his estate after his death. Whatever money was left would then be split with his son and daughter, with all four children getting an equal share.\n\nUnder the terms of the new will, all the money that will come from the sale of his property portfolio will go to his son Bradley and daughter Stacey.\n\nLynda joined as a panelist on ITV's Loose Women in 2007 and was a contestant in the 2009 series of Strictly Come Dancing\n\nMichael and Paul will not get any money from their stepfather's estate which is estimated to be over £5m and could be even more in the decades to follow.\n\nPattemore said: 'When my will was written at the same time as Lynda's I said I agreed that the first million from my estate after my death would go to her sons.\n\n'That was what she wanted and I happily agreed to put it in the will. The remainder of the estate would then be split four ways - between her sons and my son and daughter.\n\n'That will never happen now. I have re-written the will and they will get nothing from me.\n\nDuring the 1980s Ms Bellingham was dubbed the 'nation's favourite mum' thanks to her role on the Oxo adverts\n\n'I have not made the decision lightly, but they have made their position very clear by challenging the will and spreading stories about me.'\n\nDuring the 1980s, Lynda was dubbed the 'nation's favourite mum' thanks to her role on the Oxo adverts as a loving wife who cooked up mouthwatering meals for her family.\n\nShe joined as a panelist on ITV's Loose Women in 2007 and was a contestant in the 2009 series of Strictly Come Dancing.", "description": "Lynda Bellingham's widower Michael Pattemore, 64, will marry his new girlfriend Pam Shotton in the same church his late wife's funeral was held in after she died of cancer in 2014", "authors": ["Monica Greep For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/10/19650120-0-image-a-89_1570957283734.jpg", "published_at": "2019-10-13"}