{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/danielle-lloyd-names-rebekh-vardy-20551829", "downloaded_at": "2019-10-10 15:26:08.191844+00:00", "title": "Danielle Lloyd names Rebekah Vardy as secret wag and brands her 'not a girls girl'", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nDanielle Lloyd has slammed Rebekah Vardy in an explosive Twitter row sparked by her falling out with Coleen Rooney.\n\nRebekah, 37, took to Twitter this morning to brand Danielle a liar who had begged her to find her a husband, following the latter's appearance on This Morning in which she said Coleen's allegations against her rival are probably true.\n\nRebekah had tweeted: \"Danielle Lloyd making false claims on @thismorning that we have had ‘similar run-ins’ is utter b*****ks. She is just fuming that I ‘didn’t get Jamie recruiting’ for her like she asked me to...\n\nAnd Danielle, 35, wasted no time responding, accusing her of being The Sun's Secret Wag columnist who anonymously writes scathing articles about footballers' wives and girlfriends.\n\n(Image: Ken McKay/ITV/REX)\n\n(Image: REX/Shutterstock)\n\nShe posted: \"@RebekahVardy do you mean like how the sun recruited you Luv! #secretwag.\n\n\"We are all entitled to our opinions and we all know it came from your account.️ Attacking me won’t take that away another low blow by you #notagirlsgirl.\"\n\npoll loading Was Coleen right to publicly name Vardy as leak? 500+ VOTES SO FAR YES NO\n\nYesterday Coleen claimed that Rebekah had been lifting posts from her private Instagram account to sell as stories to the press.\n\nShe said she'd managed to catch her in the act by making her Instagram stories only visible to Rebekah.\n\n(Image: RebekahVardy/Twitter)\n\n(Image: Twitter)\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nColeen created a string of fake updates from her life, including choosing gender selection for her next baby and a flooding in her house, which all made it into the media.\n\nShe called her out on Twitter, finishing the post with the now iconic line: \"It's... Rebekah Vardy's account.\"\n\nBut Rebekah claimed someone had hacked her account and they were the one who sold the stories.\n\n(Image: Twitter)\n\nAnd when Danielle was invited to discuss the spat on This Morning she said it was very likely the leaks came from Rebekah.\n\nDanielle said: \"I wasn’t that shocked. I’ve had run-ins with Rebekah before over similar things. Obviously like everyone else you read it and are like 'oh my gosh', but I wasn’t as shocked seeing who it allegedly was.\n\n\"It's definitely come out of Becky's account. I think she did it. Sadly I really do. It's a shame as she probably didn't think she was going to get caught out.\"", "description": "Rebekah, 37, had branded Danielle a liar who had begged her to find her a husband after she took Coleen Rooney's side", "authors": ["Molly Pike", "Image", "Ken Mckay Itv Rex", "Rex Shutterstock", "Rebekahvardy Twitter", "Twitter"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article12074511.ece/ALTERNATES/s1200/Loose-Women-TV-show-London-UK-22-Feb-2018.jpg", "published_at": "2019-10-10"}