{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7568967/Sue-Perkins-says-groped-monk-filmed-BBC-documentary.html", "downloaded_at": "2019-10-13 23:34:30.101860+00:00", "title": "Sue Perkins says she was groped by monk as she filmed BBC documentary", "language": "en", "text": "Broadcaster Sue Perkins has told how she was groped by a hermit monk while filming for a BBC television show – as the camera crew laughed.\n\nThe presenter, 50, said the experience happened during shooting in Cambodia for an episode of the 2014 documentary The Mekong River with Sue Perkins.\n\nShe recalled how the hermit was supposed to be talking about 'how awful life was under the Khmer Rouge' – but ended up groping her breasts and bottom.\n\nBroadcaster Sue Perkins, 50, has told how she was groped by a hermit monk while filming for a BBC television show in Cambodia\n\nDescribing the encounter, Miss Perkins told the Cheltenham Literature Festival: 'I go in and the first thing he does... is he smashes his head against mine...\n\n'And he keeps it there. He keeps it there for about five minutes... Then he puts his hands on my shoulders and whispers something. I thought what an incredible experience this wise man is.'\n\nBut the next thing was, she said, 'His hands go down and to my waist... Then they moved round and really firmly, very firmly, just, on my j**s...\n\n'Then... he was on my a*** for five minutes and then I was just saying \"thank you, namaste\".'\n\nMiss Perkins said the hermit, who then winked, was an 'absolute a******e'.\n\nShe recalled how the hermit was supposed to be talking about 'how awful life was under the Khmer Rouge' – but ended up groping her breasts and bottom\n\nShe added: 'But when we were in there, my mate and the camera crew were crying with laughter...\n\n'At the end, he cut the interview short, groped me again and then went 'call me'.'\n\nMiss Perkins, who co-hosted The Great British Bake Off from 2010 to 2016, was appearing to promote her book East of Croydon.\n\nThe BBC said it was unable to comment.\n\nIt is understood no complaint was made by Miss Perkins when the show was filmed.", "description": "The presenter, 50, said the hermit groped her breasts and bottom during shooting in Cambodia for a documentary. It is understood that she made no official complaint when the show was filmed.", "authors": ["Richard Marsden For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/21/19665488-0-image-a-17_1570998901446.jpg", "published_at": "2019-10-13"}