{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/09/28/feinstein-i-want-to-see-a-wordforword-transcript-of-trumps-call-with-ukrainian-president-n2553858", "downloaded_at": "2019-09-28 21:24:52.544163+00:00", "title": "Feinstein: I Want To See A 'Word-For-Word' Transcript Of Trump's Call With Ukrainian President", "language": "en", "text": "Senate Intelligence Committee member Sen. Dianne Feinstein (D-CA) said she wants to see a \"word-for-word\" transcript of President Donald Trump's call with Ukrainian President Volodymyr Zelensky, The Hill reported. Her desire for the supposed transcript comes after meeting with acting Director of National Intelligence (DNI) Joseph Maguire and the intelligence community’s inspector general Michael Atkinson on Thursday.\n\nAccording to Feinstein, the whistleblower's complaint \"suggests that an 'official word-for-word transcript of the call' was produced,\" and Congress should have access to the document.\n\n\"If so, it should be provided to Congress for review. Congress has a constitutional oversight duty. It’s important that we understand who took actions to hide details of the call with Zelensky and how high those actions reached,\" Feinstein said. \"I find the whistleblower complaint to be highly credible. It suggests that the president used his office to demand political favors from a foreign country and that White House personnel knew this was wrong and tried to cover it up by burying details of the call with Ukrainian President Zelensky.\"\n\nOn Wednesday, a “complete, fully declassified and unredacted transcript” of Trump and Zelensky's phone call was released, although it didn't have the exact, verbatim language between the two leaders.\n\nDemocrats are relying on this transcript to push for a formal impeachment inquiry, which Speaker Nancy Pelosi (D-CA) announced on Tuesday. They made the call for a formal impeachment inquiry before obtaining the transcript or knowing what was said between Trump and Zelensky.", "description": "Geez..09/28/2019 17:20:14PM EST.", "authors": ["Beth Baumann", "Cortney O'Brien", "Guy Benson"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/271/ae08fd17-9882-4ab1-8a7a-c8d3978a80da.jpg", "published_at": "2019-09-28"}