{"pub": "marketwatch", "url": "https://marketwatch.com/story/another-alarm-rings-for-the-stock-market-but-theres-no-reason-to-panic-2019-10-02", "downloaded_at": "2019-10-03 07:26:52.370552+00:00", "published_at": "2019-10-02", "title": "Another alarm rings for the stock market, but there’s no reason to panic", "language": "en", "text": "Another alarm rang for the stock market when a survey of purchasing managers of American factories fell to a level last seen during the Great Recession.\n\nIs this a reason to panic? Let’s explore with the help of a chart.\n\nChart\n\nPlease click here for an annotated chart of a Dow ETF DIA, -1.80%, which mirrors the Dow Jones Industrial Average DJIA, -1.86%.\n\nNote the following:\n\n• The chart shows when September’s ISM manufacturing data were released. The index came in at 47.8%. A number less than 50% indicates contraction.\n\n• The chart shows that the stock market fell after the ISM data were released.\n\n• The chart shows the Arora signal to start a short-term trade by short-selling Nasdaq 100 ETF QQQ, -1.72%. For those who could not short but are aggressive, a signal was given to buy leveraged inverse ETF SQQQ, +5.17% for a short-term trade. The ETF rises when the stock market falls.\n\n• Both short-term trades are profitable, as of this writing. Partial profits have been taken on them.\n\n• The chart shows that long-term Arora portfolios are up to 62% protected at this time. The protection is reviewed daily.\n\n• Under these market conditions, investors ought to consider Arora’s 18th Law of Investing and Trading: “Diversifying by time frames provides a consistent stream of profits.”\n\n• The chart shows that the relative strength index (RSI) is oversold. In plain English, this means that the stock market can easily stage a big jump up on even the slightest bit of good news. The good news may come from data related to services.\n\n• The chart shows that volume did not jump during the selloff. This indicates that this was not a high-conviction selloff.\n\n• Investors should pay special attention to the word “manufacturing.” The data were related to manufacturing. Manufacturing is only a small part of the U.S. economy.\n\n• There have been previous instances when this manufacturing data indicated a recession but there subsequently was none, and the stock market went on to new highs.\n\n• More critical are ISM data related to services, weekly unemployment claims and the upcoming jobs report.\n\nAsk Arora: Nigam Arora answers your questions about investing in stocks, ETFs, bonds, gold and silver, oil and currencies. Have a question? Send it to Nigam Arora.\n\nStocks to watch\n\nInvestors ought to carefully watch the following stocks to get better indications of where the stock market may go.\n\n• Apple AAPL, -2.51% stock is key. As of this writing, the consensus on Wall Street is that China will not make an example of Apple even if the trade war escalates and consumers will keep on buying expensive Apple products and services at a higher rate than the present even if a recession occurs.\n\nThere is a better than 70% probability that Wall Street’s consensus on Apple is wrong. There is significantly higher risk in Apple stock than generally believed. Apple fans, before sending me hate mail, note that Apple stock was originally bought at $18.73 in The Arora Report’s long-term portfolio. An important key to success in investing and trading is to look at the data completely objectively and never through the lens of one’s wishes and needs.\n\n• Microsoft MSFT, -1.77% has been the go-to stock for bulls. Wall Street has come to believe that Microsoft is positioned in such a way that “heads,” you win, and “tails,” you win. On the surface it seems true. However, if you dig deeper, there is a high probability that Wall Street is wrong.\n\n• Consider watching Amazon AMZN, -1.29%, Google holding company Alphabet GOOG, -2.36% GOOGL, -2.33% and Facebook FB, -0.69% because they are leaders.\n\n• Semiconductor stocks are often early indicators. Watch Micron Technology MU, -0.76% NVDA, -0.55%, Intel INTC, -2.70% and AMD AMD, -1.56%.\n\n• Watch Chinese stocks Alibaba BABA, +0.38% and JD.com JD, -0.46%.\n\n• Watch Mainland China ETF ASHR, -0.26% and Chinese internet ETF KWEB, +0.24%.\n\n• Watch recent IPOs, especially Uber ( UBER, -0.51% Lyft LYFT, -2.98%, Peloton PTON, +0.40% and CrowdStrike CRWD, -2.18%.\n\nWhat to do now\n\nInvestors ought to pay serious attention to leading economic indicators related to services. At this time, leading economic indicators carry the most weight in our adaptive ZYX Asset Allocation Model. Adaptive means that the model automatically changes with market conditions. Static models do not work well as market conditions change. In general, right now investors ought to protect their long-term portfolios with a good amount of cash and hedges.\n\nUnder these market conditions, volatility is expected to rise. Instead of falling a victim to volatility by emotional responses, or following rigid methodologies of years gone by such as fixed-percentage stops at one particular point, investors ought to bring more sophistication to the stock market and take advantage of the volatility both with short-term and long-term positions.\n\nAggressive investors who are sophisticated ought to consider selectively short-selling. Note that short-selling involves higher risks. Lately we have been seeing more profitable short-selling trades.\n\nAll investors should consider having access to trades using inverse ETFs from reliable, proven sources.\n\nEmerging markets in Asia such as India, Indonesia and Vietnam may present lucrative opportunities if there is no quick trade deal with China.\n\nDisclosure: Subscribers to The Arora Report may have positions in the securities mentioned in this article or may take positions at any time. Nigam Arora is an investor, engineer and nuclear physicist by background who has founded two Inc. 500 fastest-growing companies. He is the founder of The Arora Report, which publishes four newsletters. Nigam can be reached at Nigam@TheAroraReport.com.", "description": "The manufacturing report was dismal, but more important is the health of service industries.", "authors": ["Nigam Arora"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GL432_alarm__ZG_20180623111238.jpg"}