{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7549893/Women-stressed-pregnancy-affect-babies-brain-development.html", "downloaded_at": "2019-10-08 12:55:35.229810+00:00", "title": "Women who are stressed in pregnancy could affect their babies' brain development", "language": "en", "text": "Stress in pregnancy could damage the brains of premature babies and put them at risk of anxiety, scientists have discovered.\n\nResearchers asked 251 mothers of babies born prematurely about their experience of stress, from moving house to bereavement, while they were expecting.\n\nThey found women who were more stressed before or during pregnancy had babies whose white matter developed differently.\n\nWhite matter consists of 'tracts' made of fibres which send messages between the different parts of the brain.\n\nAlterations have been linked to anxiety, autism, OCD and other mood disorders in children and adults.\n\nThe researchers at King's College London believe stress hormones, such as cortisol, reach the baby in the womb through the placenta and affect their development.\n\nBut the team said further trials are needed to prove whether the changes in white matter could lead to adverse effects in the children as they age.\n\nWomen who are stressed in pregnancy could change their babies' brains and put them at risk of anxiety, scientists at King's College London have discovered\n\nThe team of researchers said it is the first time the effect of stress in pregnancy on premature babies has been studied.\n\nMore than one in ten babies are born premature worldwide, according to figures. It is defined as being born before the 37th week of pregnancy.\n\nIn the study, the mothers filled out a questionnaire about their experiences of stress. Their babies were all born between 23 and 33 weeks.\n\nStressful events ranged from moving house or taking an exam, to more severe stress like bereavement, separation or divorce.\n\nAcademics gave the women a severity score from zero to 270, based on how many stressors they experienced and how severe they were.\n\nWhen the babies reached 37 weeks of age, the researchers used MRI scans to look at the structure of the white matter in their brain.\n\nDr Lautarescu said: 'We found in the mums more stressed during pregnancy and the period before birth, white matter was altered in the babies.'\n\nWhite matter is tissue that connects different areas of the brain. It's made of nerves that communicate brain signals.\n\nAlterations were mainly seen in the uncinate fasciculus tract, which connects the amygdala with the prefrontal cortex. It is involved in emotion, learning and memory.\n\nThe researchers used MRI scans to look at the structure of the white matter in the babies' brains .An illustration shows the uncinate fasciculus (blue) and another white matter tract called the inferior longitudinal fasciculus (green)\n\nHOW DOES STRESS AFFECT PREGNANCY? Stress in pregnancy makes women more vulnerable to smoking and air pollution, research suggested in July 2017. Highly-stressed pregnant women who smoke are significantly more likely to have low-birth weight babies than more relaxed expecting smokers, a study review found. The combination of high stress and air pollution also increases the risk of having a low-birth weight baby, the research adds. Senior author Professor Tracey Woodruff, from the University of California, San Francisco, said: 'It appears that stress may amplify the health effects of toxic chemical exposure, which means that for some people, toxic chemicals become more toxic.' Co-author Professor Rachel Morello-Frosch, from the University of California, Berkeley, added: 'The bottom line is that poverty-related stress may make people more susceptible to the negative effects of environmental health hazards, and that needs to be a consideration for policymakers and regulators.' The researchers analysed 17 human studies and 22 animal trials that investigated the link between stress, chemicals and foetal development. Stress was defined by factors such as socioeconomic status. Professor Morello-Frosch added: 'While the evidence on the combined effects of chemicals and stress is new and emerging, it is clearly suggestive of an important question of social justice.'\n\nAbnormal structures of white matter in this tract have been previously been linked with a number of psychiatric disorders, including antisocial behaviour, autism, anxiety, OCD and mood disorders in studies of children and adults.\n\nExplaining the findings, the academics said stress hormones in the mother may pass down to their babies and affect their own hormone levels in the womb.\n\nThe authors wrote: 'This is supported by findings suggesting that maternal cortisol can pass through the placenta and that infants born to mothers who experienced a mood disorder during pregnancy show increased cortisol and norepinephrine, as well as decreased dopamine and serotonin.'\n\nDopamine and serotonin are brain chemicals that are often regarded as the 'happy hormones' because a lack of them is considered to play a role in causing depression.\n\nHaving low levels at such an early and critical stage of life may affect brain development, in turn leading to behavioural problems, the researchers said.\n\nDr James Findon, a lecturer in psychology at the Institute of Psychiatry, Psychology and Neuroscience, King’s College London, who was not involved in the research, said: 'This study adds to the literature on the impact of prenatal stress on offspring.\n\n'However, because the participants in this study were babies, it is unclear at this stage if these brain changes will lead to adverse outcomes.'\n\nThe study, however, did not find a relationship between maternal anxiety and white matter structure.\n\nThe team said this is likely because anxiety and stress trigger different inflammatory responses, and experiencing stress doesn't necessarily coincide with anxiety.\n\nWith mounting evidence showing the consequences of poor maternal mental health, the scientists said more support needs to be offered by GPs.\n\nDr Lautarescu said: 'No-one is asking these women about stress and hence they don't receive any support.\n\n'If we try to help these women either during the pregnancy or in the early post-natal period with some sort of intervention this will not only help the mother, but may also prevent impaired brain development in the baby and improve their outcomes overall.'\n\nThe study was published in the journal Biological Psychiatry.", "description": "Scientists at King's College London asked mothers about their stress levels during pregnancy. They found changes in white matter tracts, which has been linked to several mental health problems.", "authors": ["Vanessa Chalmers Health Reporter For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/12/19435778-0-image-a-10_1570532660806.jpg", "published_at": "2019-10-08"}