{"pub": "investingcom", "url": "https://za.investing.com/news/forex-news/south-african-rand-weaker-as-investors-seek-shelter-in-dollar-1962230", "downloaded_at": "2019-09-30 06:38:50.765514+00:00", "title": "South African rand weaker as investors seek shelter in dollar", "language": "en", "text": "© Reuters. South African rand weaker as investors seek shelter in dollar\n\nJOHANNESBURG, Sept 30 (Reuters) - South Africa's rand weakened early on Monday as the dollar gained against riskier currencies, with investors watching developments in the China-U.S. trade dispute and a slew of domestic and global economic indicators this week.\n\nAt 0610 GMT, the rand ZAR=D3 traded at 15.1800 per dollar, 0.3% weaker than its close on Friday, when the currency fell to a session low of 15.1975, its weakest since Sept. 3.\n\nRisk assets took a hit in U.S. trade on Friday following news that President Donald Trump's administration is considering radical new financial pressure tactics on Beijing, including the possibility of delisting Chinese companies from U.S. stock exchanges. pressure on emerging markets is mounting, as the U.S. continues to make waves in the global market,\" Bianca Botes, Treasury Partner at Peregrine Treasury Solutions, said in a note.\n\n\"Washington announced over the weekend that the U.S. was investigating ways to limit its portfolio investment flows to China, although the U.S. Treasury subsequently denied plans to block Chinese listings on U.S. stock exchanges.\"\n\nOn the data front, British economic growth and U.S. manufacturing indicators are due later on Monday, with U.S. employment figures set to be released at the end of the week.\n\nLocally, markets will look to August trade balance numbers due at 1200 GMT.\n\nIn fixed income, the yield on the benchmark government bond due in 2026 ZAR186= added 4 basis points to 8.335%, reflecting weaker bond prices.", "description": "South African rand weaker as investors seek shelter in dollar", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEA6K0IO_L.jpg", "published_at": "2019-09-30"}