{"pub": "breitbart", "url": "https://breitbart.com/news/no-deal-brexit-risks-nissans-future-in-europe-chief", "downloaded_at": "2019-10-11 05:10:39.462389+00:00", "title": "No-deal Brexit risks Nissan’s future in Europe: chief", "language": "en", "text": "London (AFP) – The head of Nissan in Europe warned Thursday that a chaotic no-deal Brexit would threaten the Japanese car giant’s future in the region — and its key UK factory.\n\nNissan Europe Chairman Gianluca de Ficchy was speaking at Britain’s biggest car plant in Sunderland, northeast England, where production of its new Juke compact sports utility vehicle was due to start.\n\n“If a no-deal scenario means the sudden application of WTO (World Trade Organization) tariffs, we know in that case our business model won’t be sustainable in the future,” he said according to British media.\n\nThe Sunderland plant has a workforce of almost 7,000 people and manufactures more than 400,000 cars per year, most of which are exported to the rest of the EU.\n\n– ‘Business model in jeopardy’ –\n\n“Our industry works with lower margins and if we are in a situation in which tomorrow we have to apply 10 percent export duties to 70 percent of our production, the entire business model for Nissan Europe will be in jeopardy,” de Ficchy added.\n\n“That’s the reason why we continue to work with all scenarios.”\n\nNissan had already hinted last week that it could be forced to axe its Sunderland hub if Britain left the European Union at the end of October with no divorce agreement in place.\n\nAnd in the shorter term, it could also review a decision to make the latest model of the Qashqai in Britain. The popular car accounts for two-thirds of Sunderland’s output.\n\nDe Ficchy added Thursday that the company’s recent decision to stop night shifts was not linked to Brexit, but was due to the need to optimise production of the three models it builds — which comprise the Juke, the Qashqai sport utility vehicle and the Leaf electric car.\n\n“It is important to have some clear discussions about the future and about the situation in which we have to operate, which we have with Brexit,” added De Ficchy.\n\n“There has been many speculations about the current uncertainty. I wish to clarify the Nissan position about that.\n\n“We have been working together in Europe to define all the risks associated with Brexit coming in and we think we are all really well prepared.\n\n“I think from an operational point of view we have worked in order to prepare for all the different scenarios.”\n\nNissan has repeatedly called upon the UK government to spell out the nature of the future post-Brexit trading relationship between London and the continent.\n\n– ‘Seismic’ effect –\n\nThe European auto industry warned last month of catastrophic effects of a no-deal Brexit, arguing it would have a “seismic” impact on car-making.\n\nIn a rare joint statement, chiefs from 23 auto business associations across Europe joined forces to caution against a brutal exit from the bloc by Britain, where giants BMW, Peugeot PSA and Nissan have factories.\n\nThanks to the EU’s single market, automakers have supply chains that criss-cross the Channel and Britain is the destination of around 10 percent of vehicles assembled on the continent, according to industry data.\n\nBritain’s largely foreign-owned car sector, which has repeatedly warned over the impact of Brexit, also faces shockwaves from a Chinese economic slowdown — and from Beijing’s trade war with the United States.\n\nSales are also hitting the skids on weak demand for high-polluting diesel models amid a broader UK government push for cleaner transport.", "description": "London (AFP) – The head of Nissan in Europe warned Thursday that a chaotic no-deal Brexit would threaten the Japanese car giant’s future in", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/10/e777b7_no-deal-brexit-throw-spanner-in-works-no-deal-brexit-risks-nissan-future-640x335.jpg", "published_at": "2019-10-10"}