{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7540915/Owen-Farrell-dismisses-concussion-fears-England-star-falls-victim-second-bad-tackle.html", "downloaded_at": "2019-10-05 23:04:03.637264+00:00", "title": "Owen Farrell dismisses concussion fears as the England star falls victim to second bad tackle", "language": "en", "text": "Owen Farrell dismissed concern for his wellbeing after he was the victim of a dangerous tackle to the head in England's 39-10 victory over Argentina at Tokyo Stadium.\n\nEddie Jones's men became the first team to secure their place in the World Cup quarter-finals after posting a third-successive bonus-point win that cements their position at the summit of Pool C.\n\nThe match turned when lock Tomas Lavanini became the fifth player to be sent off at Japan 2019 after he caught Farrell on the jaw with his shoulder in the 18th minute.\n\nOwen Farrell was on the receiving end of a poor challenge in England's win over Argentina\n\nThe England star was struck to the neck by Tomas Lavanini in the early stages of the game\n\nNine days earlier Farrell was the victim of a similar challenge by the USA's John Quill, who was also shown a red card.\n\nFarrell was treated by a medic on the pitch but alarm has been raised that he was not sent for a head injury assessment (HIA).\n\n'I feel fine. It's obviously concussion that's the worry but I didn't get hit anywhere near the top of the head,' England's captain said.\n\n'Maybe your jaw gets a bit sore but I was fine and there was no need for a HIA.'\n\nThe illegal tackle on Farrell ignited one of several flashpoints in a feisty encounter.\n\n'I probably wouldn't call them fights! There was a lot of stuff off the ball. It's not something we want to get caught up in but we tried to look after our players,' Farrell said.\n\nThe collision led to a brawl between players from both sides who were angered by the tackle\n\nA comfortable victory was marred by Billy Vunipola's ankle injury that meant the No 8 was unable to appear for the second half.\n\nJones confirmed that the joint had been twisted, adding: 'We don't think it's too serious.'\n\nA report emerged overnight that Jones was hoping to attend the funeral of his Randwick mentor Jeff Sayle, which takes place in Australia on the eve of next weekend's climax to Pool C against France.\n\nThe flight from Tokyo to Sydney takes nine-and-a-half hours and England's head coach admitted the logistics involved makes it unlikely he would be present.\n\n'Unless the RFU hire a concord for me, it'll be quite difficult to go,' Jones said.\n\nWelsh referee Nigel Owens sent Lavanini off, the fifth red card of this year's tournament\n\n'I'm negotiating with BA, concord and the RFU to see what we can do. Obviously I'd like to go but I've got a lot of responsibility here. I'm conscious of that.\n\n'The travel makes it difficult so I doubt very much that I'll be going, as much as I'd like to.'\n\nEngland will face Wales or Australia in the quarter-finals depending on the outcome of their clash with France.\n\n'We're just worried about France next week. It's qualification for the quarter-finals but the emphasis is just about getting better for the next game,' Jones said.\n\n'When Argentina went down to 14 men, they possibly had a psychological lift and it's human nature that we dropped off a little bit because you think you're going to win the game.\n\n'I was really pleased with how the players came back in the second half and dominated. If you'd have said we'd have 15 points after three games, we'd be pretty happy.'\n\nArgentina coach Mario Ledesma admitted Lavanini's dismissal was justified as he counted the cost of a result that effectively dumps the Pumas out of the World Cup.\n\n'It had a big impact because it was early in the game and I thought it was fair. We lost some power in the forwards and that's why we had a very difficult game,' Ledesma said.", "description": "Eddie Jones 's men became the first team to secure their place in the World Cup quarter-finals after posting a third-successive bonus-point win that cements their position at top of Pool C.", "authors": ["Duncan Bech", "Pa England Rugcorrespondent"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/14/19333602-0-image-a-11_1570282331864.jpg", "published_at": "2019-10-05"}