{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/kim-kendall-were-100-percent-181200038.html", "downloaded_at": "2019-09-23 19:13:57.371737+00:00", "title": "Kim and Kendall Were 100 Percent \"Not Briefed” About Being Laughed at During Emmys", "language": "en", "text": "From Cosmopolitan\n\nKim Kardashian and Kendall Jenner weren't told that their Emmys teleprompter bit was a joke before presenting.\n\nThe audience ended up laughing at Kim and Kendall, who looked pretty pissed/awkward.\n\nKim Kardashian and Kendall Jenner presented an award during the 2019 Emmys last night, and the entire ordeal was best described as deeply uncomfortable and awkward for everyone involved including me. Mostly because the Emmys audience started laughing at them.\n\nBASICALLY, it seems like people in the audience thought Kim was making a joke when she said \"Our family knows firsthand how truly compelling television comes from real people just being themselves.\" Ya know, because literally no one would describe Keeping Up with the Kardashians as \"real people just being themselves\" let alone describe the show as \"unfiltered and unscripted,\" which Kendall tried to claim.\n\nBut here's the deal: turns out this moment was meant to be tongue-and-cheek, and Kim and Kendall simply hadn't gotten a chance to be briefed on their teleprompter script before the show. In other words, they didn't realize that they were supposed to deliver those lines as a joke. At least that's what a source implied to Us Weekly, saying that Kim and Kendall “were not briefed” about the the script being “a joke\" and that “it was definitely a bit awkward.”\n\n\n\nAnd while the sisters looked pretty pissed at the audience's laughter, apparently they weren't sweating it. “Kim and Kendall were good sports about it,” another source told the magazine. “The line was supposed to be funny. They weren’t bothered by people laughing.”\n\nCool, I'll still be here all:\n\nDid everyone just laugh after The Kardashians after said something how they “are just being themselves?” Haha\n\n\n\nSo awkward. #Emmys2019 pic.twitter.com/2bcWjZVVBl\n\n\n\n— 𝕋𝕙𝕖𝕄𝕖𝕤𝕤𝕪𝕄𝕚𝕟𝕕𝕠𝕗𝕄𝕖 (@MessyMindofMe) September 23, 2019\n\nYou Might Also Like", "description": "No words, just 😬.", "authors": ["Mehera"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.F8vLGymYDs7r4ODBnkGSw--~B/aD0xNDQwO3c9Mjg3ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/cosmopolitan_438/ad064025b045f9ee0e7f5215f562acf2", "published_at": "2019-09-23"}