{"pub": "cbs", "url": "https://cbsnews.com/news/u-s-immigration-deal-with-el-salvador-trump-administration-signs-asylum-accord-with-violence-ridden-nation", "downloaded_at": "2019-09-20 22:40:05.820145+00:00", "title": "U.S. signs asylum deal with violence-ridden El Salvador to deter migrants", "language": "en", "text": "Washington — The Trump administration on Friday announced it had brokered an immigration accord with El Salvador designed to ensure the government of this small Central American country — one the most dangerous nations in the Western Hemisphere — offers refuge to migrants from all corners of the world journeying to the U.S.\n\nThe deal, unveiled by Acting Homeland Security Secretary Kevin McAleenan, is one of several controversial multilateral accords the administration has sought to forge with countries in Central America's so-called Northern Triangle to curb migration of families to the U.S., which skyrocketed in May but has decreased in recent months.\n\nMcAleenan, who has spent much of his interim tenure leading diplomatic engagements with countries where the bulk of U.S.-bound migrants are coming from or transiting through, helped broker a similar \"safe third country\" deal earlier in the summer with Guatemala. Under the proposal, which has not been implemented, the U.S. would deport asylum seekers who traveled from other countries through Guatemala to reach the U.S.-Mexico border — and these migrants would be required to seek asylum in Guatemala instead.\n\nThe text of the agreement with the Salvadoran government, now led by the popular center-right President Nayib Bukele, was not immediately available. But the deal is expected to target migrants from countries like Nicaragua, Cuba, Venezuela, Brazil and central African nations who travel through El Salvador hoping to reach American soil.\n\nMigrants from El Salvador wait to be attended by Salvadoran migration authorities in La Hachadura, El Salvador, Oct. 31, 2018. Diana Ulloa / AP\n\nStanding alongside El Salvador's Foreign Minister Alexandra Hill Tinoco during a press conference in Washington, McAleenan said the two countries had reached an \"asylum cooperative agreement,\" telling reporters that the U.S. would help El Salvador bolster its asylum system.\n\nWhen asked whether the agreement entails the U.S. denying asylum to migrants who traveled to El Salvador — and did not seek refuge there — on their way to America's southern border, the secretary called that a \"potential use of the agreement.\"\n\n\"The core of it is recognizing El Salvador's development of their own asylum system and a commitment to help them build that capacity,\" McAleenan said. \"As we work together to target irregular migration flows through the region, that is one potential use of the agreement: that individuals crossing through El Salvador should be able to seek protection there — and we want to enforce the integrity of that process throughout the region.\"\n\nMcAleenan also outlined bilateral strategy to combat organized crime, drug trafficking and human smuggling and to foster economic opportunity in El Salvador.\n\nHill Tinoco, meanwhile, focused almost exclusively on her government's efforts to end \"forced migration\" of its citizens, promote investment in the country and secure permanent protections for the Salvadorans living in the U.S. with Temporary Protected Status (TPS) — a program the Trump administration has sought to terminate. She said the uncertain status of approximately 200,000 Salvadorans who have TPS will be part of future discussions with the U.S.\n\nActing U.S. Homeland Security Secretary Kevin McAleenan, left, and Salvadoran President Nayib Bukele attend a meeting in San Salvador, El Salvador, Wednesday, Aug. 28, 2019. Salvador Melendez / AP\n\nLike the deal with Guatemala, which has seen an exodus of its citizens in recent months because of suffocating poverty and crop failures in some parts of country, the agreement with El Salvador on Friday is sure to draw criticism from immigrants' advocates, who believe the small Central American country has no business promising protection to desperate migrants.\n\n\"Trying to think that a large number of people would actually be able to seek asylum in El Salvador just doesn't seem to be realistic — not in the short-term,\" Ariel Ruiz, an analyst at the Migration Policy Institute, told CBS News.\n\nRuiz said the \"real solution\" to reduce irregular migration in the region involve measures to ensure that the U.S. and Mexico have more efficient and fair asylum systems, as well as continued investment to quell poverty, violence and political instability in Central America. Earlier this year, President Trump instructed the State Department to cut most future foreign aid to these countries, faulting the governments there for not doing enough to prevent their citizens from leaving.\n\nAlthough it also suffers from the political corruption and economic inequality that has plagued Central America for decades, El Salvador's most pressing issue for years has been gang warfare and widespread insecurity.\n\nNew border patrol agents and a national police look out over La Paz River in La Hachadura, El Salvador, on the border with Guatemala, Thursday, Sept. 12, 2019, as part of a deployment of 800 police and soldiers to patrol blind spots along its borders where migrant smugglers and transnational criminals operate. The deployment is part of an agreement between the Salvadoran government and acting U.S. Homeland Security Secretary Kevin McAleenan to slow the flow of migrants trying to reach the United States. Moises Castillo / AP\n\nOver the past decades, El Salvador has consistently topped the list of countries with the highest homicide rates that are not in open war. A bitter feud between the two transnational gangs Mara Salvatrucha, or MS-13, and Barrio 18 has made the small nation an epicenter of extrajudicial killings, murders for hire, rape, arms trafficking and human smuggling.\n\nRecently, the small country has experienced substantial comic growth, but nearly 40% of Salvadorans still live below the poverty line, according to an analysis by the World Bank.", "description": "El Salvador has consistently topped the list of countries with the highest homicide rates that are not in open war", "authors": ["Camilo Montoya-Galvez"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/09/20/5cc1e067-9b28-451d-b2a0-9ef2676b22ad/thumbnail/1200x630/cd419bfb99c91a28be6571bd89babc09/ap-18305843585378.jpg", "published_at": "2019-09-20"}