{"pub": "aljazeera", "url": "https://aljazeera.com/ajimpact/uaw-rejects-gm-offer-strike-spurs-6000-mexico-furloughs-191001210159056.html", "downloaded_at": "2019-10-02 00:36:21.912147+00:00", "title": "UAW rejects new GM offer, as strike spurs 6,000 Mexico furloughs", "language": "en", "text": "The United Automobile Workers union has said it rejected a new comprehensive offer from General Motors Co to end a two-week-old strike, saying the United States automaker came up short on several fronts including wages, healthcare and temporary workers.\n\nThe union said on Tuesday that it made a counterproposal and warned \"there are still many important issues that remain unresolved\".\n\nFor its part, GM said the strike by workers in the US forced it to halt production at its pickup and transmission plants in Silao, Mexico, resulting in furloughs for 6,000 workers.\n\nAffected Mexican workers are being paid a percentage of their salaries, with some workers using vacation time to continue receiving their full salaries.\n\nAbout 48,000 UAW members went on strike on September 16 seeking higher pay, greater job security, a bigger share of the leading US automaker's profits and protection of healthcare benefits.\n\nUAW Vice President Terry Dittes told union members in a letter that the GM offer \"came up short\" on issues such as health insurance coverage and job security.\n\nBut the union said that it is committed \"to exploring all options in order to reach an agreement\".\n\n'Builds a stronger future'\n\nGM said in a statement that it continues \"to negotiate and exchange proposals, and remain committed to reaching an agreement that builds a stronger future for our employees and our company\".\n\nThe statements on \"comprehensive proposals\" indicate the talks have shifted into a higher gear as the dispute is taking a toll on both the automaker and striking UAW workers, whose $250 a week from the union strike fund is a fraction of their normal pay.\n\nBoth sides face broader risks should the US economy slow down. Data released on Tuesday showed the US manufacturing sector contracted in September to its weakest level in more than a decade.\n\nStocks fell broadly on the report, and GM's share price was down more than three percent.\n\nThe strike had previously forced GM to lay off at least 2,000 Canadian workers and temporarily close an engine plant in Mexico. Many suppliers have halted or scaled back operations.\n\nJPMorgan auto analyst Ryan Brinkman estimated in a research note that the strike has cost GM over $1bn, but that the company may be able to recover some lost profit in the fourth quarter. He said GM has $82m a day in lost profit.\n\nGM in Mexico said that \"for the moment\" its three other Mexican plants – in Ramos Arizpe, San Luis Potosi and Toluca – are working normally. A spokesman in Mexico said the plants still had parts available, but the company could not say how many more days the plants would remain open.\n\nThe spokesman declined to estimate the daily cost of suspending operations at the Silao complex.", "description": "Labour action could cost United States automaker $1bn, as union workers receive small fraction of regular salaries.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/1/a598d9cdb0b34a19be737633ca3da711_18.jpg", "published_at": "2019-10-01"}