{"pub": "usatoday", "url": "https://usatoday.com/story/news/politics/elections/2019/10/14/ohio-debate-why-democrats-have-tough-road-2020-ohio/3973743002", "downloaded_at": "2019-10-16 00:31:38.770476+00:00", "title": "Why Democrats have a tough road in 2020 in Ohio", "language": "en", "text": "CLOSE Ohio has long been a bellwether in presidential elections. But that may be changing. A look at Ohio's changing population and election tendencies. Michael Nyerges, Cincinnati Enquirer\n\nAs Ohio goes, so goes the country.\n\nThat was the conventional thinking among politicos for over a century. Only three presidents in the past 150 years have won the White House without winning Ohio. (Attention trivia buffs: Answer at bottom.)\n\nBut more future presidents will likely join the three on the list of presidents who didn't win Ohio.\n\nOhio has started to go its own way, hanging a right after 2016. Trump won the state by 8 percentage points in 2016.\n\nTwo years later, many expected a \"blue wave\" of Democrats to sweep into Congress in reaction against Trump. That wave - which allowed Democrats to regain the U.S. House - missed Ohio.\n\nDemographically too, Ohio is starting to veer farther away from national microcosm status.\n\nIt's not like Ohio is Idaho-irrelevant yet. After all, the Democratic presidential debate on October 15 in the Columbus suburb of Westerville shows the Democrats still think of Ohio from time to time.\n\nBut the state won't likely regain its political prominence for the foreseeable future. Here's why:\n\nCLOSE The 2020 election is nearing and with that, comes the caucuses and primary elections. But what’s the difference? Just the FAQs, USA TODAY\n\nOhio looked more like Texas in 2016\n\nWhen the Democrats look to spend their money to defeat Trump in 2020, they'll look at states they came close to winning in 2016.\n\nAnd Ohio isn't one of them. Trump won by eight percentage points. He won Texas by nine percentage points.\n\nIn the surrounding swing states of Michigan, Pennsylvania and Wisconsin, Trump won by less than one point.\n\nTrump's narrow victories in southern states Georgia (5 percentage points) and North Carolina (2.6) might tempt Democrats to focus more resources there, said Herb Asher, a professor of political science at Ohio State University.\n\n\"To be a swing state, your vote has to be competitive,\" Asher said. \"It has to make a difference in the outcome.\"\n\n'Blue Wave' in 2018 did not moisten Ohio\n\nWhile Dems did pick up 40 seats to regain control of the U.S. House, the blue wave missed Ohio.\n\nRepublicans won all statewide partisan races in 2018 except one: Democratic Sen. Sherrod Brown, who was bolstered by incumbency and 40 yearsof statewide name recognition. He beat Cleveland-area congressman and businessman Jim Renacci by 6.8 percentage points. Renacci made it close even though he jumped into the race late, to take the place of Republican Ohio treasurer Josh Mandel, who dropped out for personal reasons.\n\nRepublican dominance started decades ago\n\nIt's not just about a lack of a Buckeye blue wave in 2018. It's been a blue drought statewide for much longer.\n\nRepublicans have dominated statewide executive offices in Ohio for decades. Since 1991, five of the past six governors and four of the past five secretaries of state have been Republican.\n\nThe Republicans run up the score in statewide elections in the small and medium-sized counties, predominantly rural. Democratic votes have become increasingly more concentrated in the cities of Cincinnati, Cleveland, Columbus and Toledo.\n\nThe results of presidential elections over the past 40 years show how Democrats have had to change their strategy in Ohio.\n\nJimmy Carter in 1976 and Bill Clinton in 1992 won heavily in the rural Appalachian areas. Carter picked up 10 counties in the southeastern part of the state that year and Clinton won 11, according to data from elections guru Mike Dawson.\n\nSince Clinton, the best a Democratic president has mustered in that region is four counties. In 2012 and 2016, the only southeastern Ohio County Democratic presidential candidates were able to win was Athens County, home to Ohio University.\n\nOhio whiter, older than nation\n\nOhio is not the miniaturized version of the nation it was for most of the nation's history.\n\nIt's older and whiter than the rapidly diversifying nation.\n\nAt least since 1950, Ohio has had a higher percentage of white people in the nation compared to the national average. But that gap has widened in the past 20 years, according to the U.S. Census.\n\nIn 1980, 88% of Ohio's population was white compared to 80% across the country.\n\nThe last Census in 2010 showed 81% of the state was white while the rest of the country was 63% white.\n\nOhioans are also slightly older than the average American. The median age in Ohio is 39.3 years, compared to 37.8 for the rest of the country, according to the latest estimates from the U.S. Census Bureau.\n\nOver the past 30 years, the median age gap between Ohioans and the rest of the country has grown by 1.1 years, according to the U.S. Census Bureau.\n\nRemember the War of 1812?\n\nAs Ohio's population growth has slowed, its electoral importance goes down.\n\nOhio was still a sparsely populated frontier the last time the state held such a small share of the nation's electoral votes in 1812.\n\nToday, Ohio has 18 electoral votes, accounting for 3.3% of the total 538. The state dipped below 20 electors after the 2010 U.S. Census for the first time since 1832. That's down from a high of 26 achieved in the 1930s and 1960s.\n\nThe number of members of Congress, the House plus the Senate, make up the formula to decide each state's number of electors.\n\nSince congressional representation is decided by population, Ohio's slow growth relative to the rest of the nation hasn't helped its status as a bellwether.\n\nExperts predict Ohio's influence to further wane after the next census when the state is expected to lose a congressional seat, dropping the number of Ohio's congress members to 15 and the number of electoral seats to 17.\n\nIs hope lost? Should Ohio fold up and become part of Michigan? Not yet.\n\nSuburbs around the cities are turning blue, or at least purple, Asher said.\n\n\"I happen to think Ohio is still an important state,\" Asher said. \"The ray of hope for the Democrats is what is happening in some of our suburban areas.\"\n\nTrivia answer: The three candidates to win the White House without winning Ohio: Grover Cleveland in 1884 and 1892, Franklin Delano Roosevelt in 1944 and John F. Kennedy in 1960.\n\nRead or Share this story: https://www.usatoday.com/story/news/politics/elections/2019/10/14/ohio-debate-why-democrats-have-tough-road-2020-ohio/3973743002/", "description": "More future presidents will likely join Cleveland, FDR and JFK on the list of presidents who didn't win Ohio.", "authors": ["Scott Wartman", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/07/PCIN/356abec5-dc70-4450-b7ae-cfd5d397ab38-101018_EARLYVOTING_2018_011.jpg?crop=5183,2916,x0,y263&width=3200&height=1680&fit=bounds", "published_at": "2019-10-14"}