{"pub": "axios", "url": "https://kansas.com/entertainment/ent-columns-blogs/keeper-of-the-plans/article208445814.html", "downloaded_at": "2019-10-30 23:20:25.215340+00:00", "title": "Wichita living: Parking garage converted to loft apartments", "language": "en", "text": "In some bigger cities, Michael Ramsey’s concept is the stuff of urbanists’ dreams.\n\nSure, the concept of living in a parking garage has been tested in Atlanta, but no one has completed a retrofit that quite mirrors the scale of Wichita’s Broadway Autopark.\n\nOver the span of the past two years, Ramsey and his Bokeh Development team have converted a neglected downtown parking garage at 303 S. Broadway into 44 high-end apartment units.\n\nThe apartments-in-a-garage officially opened on April 1, and about 20 of the units are already leased or pre-leased, according to Brittany Wahlers, assistant property manager at Broadway Autopark.\n\nExplore where you live. Subscribe for 12 FREE weeks of unlimited digital access. SAVE NOW\n\nNow a parking garage that once was a bustling, valet-attended spot in downtown half a century ago is serving a new clientele.\n\n“We’re getting a lot of interest, a lot of people curious as to how they turned a parking garage into apartments,” Wahlers said.\n\nWhat's in the building?\n\nThe top four floors of the five-story garage are essentially split between parking and apartments. Each floor has 10 apartments on the east side (each with a terrace overlooking Broadway) and a few parking spots (as well as one quirky unit) on the west side. Residents have doorside parking.\n\n“One of the things that you hear a lot about downtown is parking – even though there’s plenty of parking, there’s this perception that residential parking is hard to find,” said Jeremy Luginbill, principal at Lifeboat Creative. The agency handles Bokeh Development’s branding and public relations efforts.\n\n“(Bokeh) kind of took what has always been a negative perception and flipped it on its head and said, ‘Here you go, we’ve got parking at the front door for anyone that’s been an issue for.’ ”\n\nIt’s a secured-access garage, as residents need a door opener or a code to get past the first floor.\n\nAll of the units are between 650 and 670 square feet, and they get progressively pricier the higher you go.\n\nRent ranges from $800 to $1,000 a month, depending on what floor the apartment is on.\n\nThey are all one-bedroom apartments with full-size kitchens (with a half-size dishwasher). All of the kitchen furnishings look starkly industrial against the concrete walls and ceilings – the cabinets, for example, look like repurposed black toolboxes (to fit the garage theme).\n\nSimilar to its fellow Bokeh property, The Lux, every apartment features an accent wall painted one of the three official colors of the complex: terra cotta, green or gold.\n\nEach apartment’s balcony overlooking Broadway is only semi-private, separated from its neighbor by a waist-high wall.\n\n“A lot of Bokeh Development’s properties are about community and developing community,” Luginbill said. “(The low walls) are on purpose, to keep people engaged with each other.”\n\nThere’s a “trash chute” on each floor of the garage, where residents can dump bags of trash that then plummet earthbound into a Dumpster.\n\nThe complex also has a first-floor common room equipped with a 24-hour fitness center, dog wash and entertainment room. In that common room, there are tinted windows original to the garage, Luginbill said – and painted parking lines still visible on the floor.\n\n“If you look at a lot of Bokeh Development’s properties, they don’t strip down to the studs; they don’t tear it apart,” Luginbill said. “They use as much as can be used there and build it up to what it potentially will be.”\n\nConverting a pre-existing concrete parking garage into apartments was not particularly cost-effective, Luginbill said.\n\n“It’s more costly to do it that way, but (Bokeh’s) philosophy is retaining that character, retaining what built Wichita downtown and carrying that into the future,” Luginbill said. “Putting up walls is fairly easy. It’s getting all the electrical, plumbing and HVAC into a space that wasn’t intended to have it originally.”\n\nUnlike The Lux, which prides itself on its LEED certification of energy efficiency, Broadway Autopark is not LEED-certified, “but we did every step to make it as green as possible and as energy-efficient as possible,” Wahlers said.\n\nIt’s unclear exactly how expensive the project was, as Luginbill said “that’s not stuff that Bokeh shares.”\n\nIn 2016, the Eagle reported the project was expected to cost around $5 million.\n\nThere’s talk about adding a rooftop patio to the Broadway Autopark later, but that hasn’t been finalized.\n\nHistory of the garage\n\nKnightley’s Parking Garage – now known as Broadway Autopark – has been a staple of the downtown landscape since it was built in 1949.\n\nIt’s a popular subject of downtown photography, and recently a Rose Hill student’s drawing of the building was awarded top honors at the Scholastic Art and Writing Awards.\n\nThe Modern-style parking garage, with rounded walls and porthole windows, was built as the post-war automobile industry boomed.\n\nWealthy Wichitans would drop their cars off with a valet at the garage before going shopping downtown. As customers shopped, downtown merchants would ship their purchases to Knightley’s Parking Garage. The parking attendants would use a dumbwaiter to go between floors.\n\nThere was a safe used to guard valuable purchases and an air-conditioned waiting room in the garage.\n\nThe garage was open 24/7, 365 days a year until the early 1980s, when it was shuttered.\n\nIt sat vacant and trash-filled for the next few decades, until Ramsey and fellow developer Robert Eyster got hold of the building in 2016.\n\n“It was rough — not structurally, but cosmetically it was a disaster,” Luginbill said. “There was trash everywhere. There was graffiti all over the walls.”\n\nIt was listed on the National Register of Historic Places later that year, and the renovations began. The city also loaned Bokeh Development $620,000 for façade improvements at the garage property in 2016.\n\nInside the office area, crews found parking tickets that they estimated had been on the ground there “at least 30-plus years,“ Luginbill said.\n\nThe renovations took a little more than two years to complete.\n\nBroadway Autopark is a few blocks south of where a mass of downtown apartments have clustered in recent years along Douglas and areas northward. It’s also the first new downtown apartment complex to bear a Broadway address.\n\n“It just shows the expansion of what downtown is going to be – it’s pushing that core outward and creating more interest in downtown as a whole, not just the same street,” Luginbill said. “It’s just another step in that evolution of downtown.”\n\nIt's just across the street from the former Greyhound Bus building — recently abandoned — and rises up among surface parking lots in the block.\n\nBut there's hope that Broadway Autopark will be the catalyst for future developments along the Broadway corridor, which is the \"primary north-south spine\" of downtown, said Jason Gregory, executive vice president of Downtown Wichita.\n\n\"Sometimes it just takes that first project to spark an area, and we think it has the potential to do that,\" Gregory said. \"You have the critical mass of the former state office building, the Henry's — those are prime for redevelopment, too. If — not if, when — those are activated, there's a lot of connectivity there.\"\n\nThe apartments were designed by Shelden Architecture, and Farha Construction (which now has offices in the building's ground floor) was the contractor for the project.\n\nFor more information about the building, visit www.broadwayautopark.com.", "description": "The Broadway Autopark, a 44-unit residential complex, opened on April 1. The apartments were built into the former Knightley's Parking Garage at 303 S. Broadway in downtown Wichita. The parking garage has been converted into apartments.", "authors": [], "top_image": "https://cf-images.us-east-1.prod.boltdns.net/v1/static/5615998028001/a0d5aa4d-5c05-44bd-91bf-aafdccda10f3/49fdd31f-1957-4118-a7c0-bae9c1fe2971/1280x720/match/image.jpg", "published_at": "2019-10-30"}