{"pub": "guardian", "url": "https://theguardian.com/artanddesign/2019/sep/14/chicago-architecture-biennial-review", "downloaded_at": "2019-09-15 00:09:10.655903+00:00", "title": "Chicago Architecture biennial reveals the city’s true foundations", "language": "en", "text": "Crown Hall, at the Illinois Institute of Technology in Chicago, is an icon of modern architecture. Designed by Mies van der Rohe and completed in 1956, it is a crystalline glass box framed in slender black steel, symmetrical, raised above the ground, reached by a central ceremonial flight of steps. It is the acme of the pure disciplined abstract style that Mies brought from Germany to the United States. When the reaction to such architecture arrived in the 1970s, the American-born, London-based Charles Jencks, the man who first attached the label “postmodern” to architecture, singled out Crown Hall both for its lack of familiar decorative language and for the absurdity of making a school of architecture (which is what it is) look like a temple.\n\nUnmentioned in this stylistic debate is Mecca Flats, the building that Crown Hall replaced. This was a courtyarded apartment building, originally a hotel, that had become a centre of African American life in Chicago, the inspiration for a blues song by Jimmy Blythe and a long poem by Gwendolyn Brooks. It was demolished in the name of “urban renewal”, after a decade-long fight to save it. “A Negro slum,” Harper’s magazine called it. “You watch,” said one of the residents as it was being demolished, “a lot of people who lived here, they gonna die from grief.”\n\nThe Mecca Flats story is emblematic of the power struggles, often racially driven, that have shaped Chicago. The intention of Yesomi Umolu, the artistic director of this year’s Chicago Architecture Biennial, is to represent the “myriad of stories”, like that of the Mecca, that make a city.\n\nRedlining was practised in Chicago, whereby banking and other services were denied to districts populated by minorities\n\nChicago has several claims to architectural and urbanistic fame – as the birthplace of the skyscraper, for fertilising the talents of Louis Sullivan and Frank Lloyd Wright as well as Mies, and as the launchpad of the City Beautiful movement, which aimed to counter urban squalor with parks and monuments. Under the title “… And other such stories” Umolu’s biennial aims to bring out the social and political forces behind these great works.\n\nWhile Chicago “has always been a site of radical imagination in relation to architecture”, as she says, “there isn’t architectural form without history and narrative”. It is for her “the quintessential American city”. It was built on land taken from Native Americans, and its gridded street plan reflects the patterns of the land surveys that were part of that appropriation. It grew rich on produce from the prairies. If it welcomed African Americans migrating from the southern states, it also segregated their neighbourhoods and obstructed their access to the home-ownership that was held up to white people as an ideal of American citizenship. Redlining was practised there, the process by which banking and other services would be denied to districts populated by minorities. “You cannot not talk about Chicago through the lens of segregation,” says Umolu.\n\nFacebook Twitter Pinterest The inner court of Mecca Flats, demolished in 1952 to make way for Mies van der Rohe’s Crown Hall. Photograph: Wallace Kirkland/The LIFE Picture Collection via Getty Images\n\nAt the same time, a place made by brute power, with inequality and exploitation built into the fabric, can – in what is a paradox of cities generally – become a haven for freedom, opportunity and tolerance. Chicago, she points out, was a centre of the civil rights movement, fostered early labour movements and launched the political career of Barack Obama. The city once renowned for hard-nosed, white, male mayors, some of them on the edge of criminality, is now run by Lori Lightfoot, black, female and gay. Umolu’s biennial, which opens next week, will therefore combine sometimes grim histories with inspiring reactions to them.\n\nShe grew up in London, studied architecture at the University of Edinburgh and worked for British practices before becoming a curator of contemporary art and moving to the US. Coming now from the direction of art, she has a different perspective from those in the architectural profession. Her biennial will be less a showcase of singular works by skilled individuals, more an attempt to “amplify” what she calls “socially engaged practice”, which might be by artists or activists as much as by architects. She gives as an example the Sweet Water Foundation, which has made a city block in Chicago’s South Side into a community farm, with workshops, classrooms, art gallery and meeting hall attached.\n\nThe main venue of the Biennial is the Chicago Cultural Centre, a magnificent former library in the heart of the city. Here there will be a large-scale model of a traditional Chicago worker’s cottage, and “a multi-channel video installation” about “the ways in which communities coalesce”. There will be ceramic floor tiles from Mecca Flats, discovered during recent renovations of Crown Hall, whose colours revivify a building otherwise remembered through monochrome photographs. There will be displays on São Paulo, Vancouver and Johannesburg, cities with issues comparable to but distinct from Chicago’s.\n\nFacebook Twitter Pinterest Crown Hall, Illinois Institute of Technology, Chicago. Photograph: David Cherepuschak/Alamy\n\nThe biennial will also be manifest in other locations, for example by bringing a former elementary school building back to life, and aims to have an influence beyond its four-month run. It is promoting an initiative by Mass Design Group, designers of the much-praised National Memorial to Peace and Justice, to create a memorial to victims of gun violence. A preliminary version, made up of personal belongings donated by victims’ families, will be on show in Chicago.\n\nThe Chicago Architecture Biennial is set to be, in other words, as pure an expression of liberal values, applied to the realm of city-building, as you could hope to find. In the polarised politics of the present, in which the same country can produce both a President Trump and a Mayor Lightfoot – a conflict sometimes framed as one of big cities versus the rest – it is extremely obvious where Umolu and the biennial stand. She does not claim to have all the answers – which, as the questions are vast, is realistic – but she does at least want to point out some basic truths about the ways cities are shaped, and to offer examples of how to respond.", "description": "Inspired by its black mayor and a British curator, Chicago is reviving the political narratives that shaped its cityscape", "authors": ["Rowan Moore"], "top_image": "https://i.guim.co.uk/img/media/f1ce6ac9f482000c9f7c4c88f6079c115b16e733/0_27_5901_3541/master/5901.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=8fb5487c2825e99874b132bd6f6f6978", "published_at": "2019-09-14"}