{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7552143/Woolworths-launches-half-price-sale-popular-cosmetic-brands-Maybelline-LOreal-MCo.html", "downloaded_at": "2019-10-09 01:23:00.065072+00:00", "title": "Shoppers in a frenzy as Woolworths, Dan Murphy's and Big W launch MASSIVE 48-hour online sale", "language": "en", "text": "The Woolworths group is launching a massive two day online sale with huge reductions on tech, alcohol, furniture and online grocery orders.\n\nFor the next 48 hours, savvy shoppers can nab deals at Dan Murphy's, Big W, BWS and Cellarmasters.\n\n'Our online sales have been a big hit with customers looking to save both time and money throughout 2019,' a Woolworths Group spokesperson told FEMAIL.\n\nThe Woolworth group is launching a massive two day online sale with huge reductions on tech, alcohol, furniture and online grocery orders\n\n'With this sale we're delighted to bring together online offers from all Woolworths Group retail brands at the same time.\n\n'There is great value on offer across a wide range of categories, and it comes at an ideal time just ahead of Christmas.'\n\nThe news comes after the supermarket giant announced a massive sale on cosmetics with half-price discounts on popular brands like Maybelline, L'Oreal and MCo.\n\nShoppers have 48-hours to nab a stunning range of deals at outlets owned by the Woolworths group (Big W, pictured left and alcohol retailers Dan Murphy's, pictured right)\n\nWhat are the best deals in the 48-hour Woolworths Group sale frenzy? BIG W Samsung Galaxy Tablet 10.5\" $249 - Save $150\n\n20% off all LEGO\n\nLogitech Crayon for Ipad $69 - Save $60\n\nCanon EOS 3000D DSLR Camera $399 - Save $200\n\nHuggies Mega Nappies $36 - Save $4\n\n1/2 price Barefoot Investor Book $9.50 - Save $9.50\n\nBig Savings on Selected Dyson and selected small appliances\n\n1/2 price Kodu Sofa $199 - save $200\n\n1/2 price Kodu Armchair $99 - save $100\n\n1/2 price Cadbury Favourites 570g $10 - Save $10 WOOLWORTHS 10% off online orders over $150* BWS 10% off online orders over $100 DAN MURPHY'S Spend $100 online and get $15 off\n\nSpend $200 online and get $35 off\n\nSpend $300 online and get $75 off CELLARMASTERS 25% off sitewide w/ free delivery (min spend $120)\n\nMakeup fans can nab 50 per cent off on select beauty tools with a five-piece brush set by Ecotools reduced from $30 to an affordable $15.\n\nThe cosmetics sale is ready underway which means shoppers will need to hurry to their local store or the website to get their hands on their favourite products before stocks sell.\n\nMaybelline's incredible range of mascaras tends to be considered make up bag must-haves by industry experts\n\nIf your product is looking a little worse for wear, Woolworths sale makes it the perfect time to stock up with a range the famous brand now half price.\n\nLash Sensational Washable mascara in deepest black, by Maybelline, was priced at $22. With the discount, it is now $11.\n\nOther deals include Maybelline's Colossal Volumising Mascara, reduced from $20 to $10 and the brand's Define A lash in very black, reduced from $19.50 to $9.\n\nMaybelline mascaras included in the discount are its Lash Sensational, priced at $11 (pictured left) and its Colossal Volumising mascara, $10 (pictured right)\n\nBeauty bag essentials include a liquid eyeliner by L'Oreal, priced at $12.50 (pictured left), a 'kissproof' lip colour by Rimmel, $9.50 (pictured centre) and lipsticks by Maybelline's sensational Matte lipstick range, $9 (pictured right)\n\nWhen it comes to creating a winged eye, your hero product is a liquid eyeliner with a fine tip.\n\nOne which does the trick and won't break the bank is L'Oreal's Superliner Superstar. This was priced at $25 whereas now it's a mere $12.50.\n\nA selection of lipsticks and lipglosses have also been included by Woolworths in its cosmetics clear out.\n\nTwo MCo products included in the sale are an eyeliner in smokey black, $4 (pictured left) and a beauty blender, $4.25 (pictured right)\n\nRimmel's Provocalips, a two-step product designed to lock in colour was priced at $19. With the discount is it now on offer for an affordable $9.50.\n\nThose looking to update worn out lipsticks with fresh colours for spring should consider Maybelline's Sensational Matte Lipstick range, now priced at $9.\n\nAlthough the product is matte, it comes laden with oils to keep lips smooth, soft and well-hydrated.\n\nThis stunning selection of make up brushes by Ecotools (pictured) was priced at $30 whereas now it is a mere $15\n\nA selection of makeup items by MCo including an eyeliner and brow tool also features as part of the stellar discount.\n\nThe brand's waterproof 'eye define' eyeliner in smokey black was priced at $8 whereas now it is available for a mere $4.\n\nThis 2-1 make up pencil sharpener is priced at at a very purse-friendly $3\n\nMCo's Instant brows, a product which comes with a brow defining pencil at one end and a spoolie at the other has been reduced to an affordable $5.50.\n\nIf you're armed with the right tools, it is possible to recreate any beauty look that's currently trending.\n\nEssentials to feature as part of the sale include a stunning five-piece brush set by Ecotools, reduced from $30 to $15.\n\nAn MCo beauty blender, an item which promises to help your make up coverage flawless, is available for a mere $4.25.\n\nOne of the most useful items you can have in your possession is a dedicated make up pencil sharpener.\n\nMCo is also offering a dual sharpener designed to fit regular and larger-sized pencils for an affordable $3.", "description": "The Woolworths group is launching a massive two day online sale with huge reductions on tech, alcohol, furniture and online grocery orders.", "authors": ["Emilia Mazza For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/02/19469774-0-image-a-31_1570583514430.jpg", "published_at": "2019-10-08"}