{"pub": "thehill", "url": "https://thehill.com/homenews/administration/464790-trump-defends-turkey-in-wake-of-fierce-gop-criticism", "downloaded_at": "2019-10-08 15:08:56.176208+00:00", "title": "Trump defends Turkey in wake of fierce GOP criticism", "language": "en", "text": "President Trump Donald John TrumpTrump campaign slams Minneapolis mayor, Target Center for 'attempting to extort' them with rally security fees Susan Rice calls Trump decision to pull troops from Syria 'batshit crazy' Ex-Trump officials met with Zelensky campaign aides at Trump hotel earlier this year: report MORE on Tuesday defended Turkey as a NATO ally and strong trade partner of the United States one day after he was savagely criticized by Republicans for his decision to withdraw U.S. forces from northern Syria.\n\nTrump did so at the behest of Turkish President Recep Tayyip Erdoğan, and the move paves the way for Turkey to launch a military offensive into the area against Kurdish forces that have been loyal to the U.S. in the fight against ISIS.\n\nTrump insisted that his administration had \"in no way\" abandoned the Kurds and was supplying the allied force with money and weapons.\n\nADVERTISEMENT\n\n\"So many people conveniently forget that Turkey is a big trading partner of the United States, in fact they make the structural steel frame for our F-35 Fighter Jet,\" Trump tweeted. \"They have also been good to deal with, helping me to save many lives at Idlib Province, and returning, in very good health, at my request, Pastor Brunson, who had many years of a long prison term remaining.\"\n\nTrump highlighted that Turkey is a member of the NATO alliance and noted that Erdoğan will visit the White House on Nov. 13.\n\n.....good health, at my request, Pastor Brunson, who had many years of a long prison term remaining. Also remember, and importantly, that Turkey is an important member in good standing of NATO. He is coming to the U.S. as my guest on November 13th. #ENDENDLESSWARS — Donald J. Trump (@realDonaldTrump) October 8, 2019\n\nTurkey was removed from the F-35 program in July after it purchased a Russian missile defense system.\n\nPastor Andrew Brunson was detained for nearly two years on allegations that he was connected to a failed coup against Erdoğan in 2016.\n\nThe president's tweet defending the Turks and Erdoğan will likely spur further criticism that he is siding with an authoritarian leader. It marked a shift in tone from a day earlier when he asserted that he could \"obliterate\" Turkey's economy if the country did anything \"out of line.\" Trump did not specify what that would entail.\n\nThe White House announced late Sunday that Turkey will soon be launching a military operation in northern Syria and that U.S. troops will no longer be “in the immediate area” when it happens. The U.S. had more than 1,000 troops deployed in northern Syria, working closely with Kurdish-led forces that Turkey considers terrorists.\n\nSen. Lindsey Graham Lindsey Olin GrahamSusan Rice calls Trump decision to pull troops from Syria 'batshit crazy' Pat Robertson 'absolutely appalled' by Trump's Syria announcement Overnight Defense: Republicans urge Trump to reverse course on Syria | Dems subpoena Pentagon in impeachment probe | North Korea talks falter MORE (R-S.C.), Senate Majority Leader Mitch McConnell Addison (Mitch) Mitchell McConnellSusan Rice calls Trump decision to pull troops from Syria 'batshit crazy' Overnight Defense: Republicans urge Trump to reverse course on Syria | Dems subpoena Pentagon in impeachment probe | North Korea talks falter Trump defends Syria move: 'It's time to come back home' MORE (R-Ky.) and former U.S. Ambassador to the United Nations Nikki Haley Nimrata (Nikki) HaleyOvernight Defense: Republicans urge Trump to reverse course on Syria | Dems subpoena Pentagon in impeachment probe | North Korea talks falter Five things to know about Trump's decision on Syria, Turkey and the Kurds Trump defends Syria move: 'It's time to come back home' MORE were among the dozens of Republicans critical of Trump. They all said a U.S. retreat could harm relationships with allies and lay the foundation for a resurgence of ISIS.\n\nHaley's tweet criticizing the move included the hashtag #TurkeyIsNotOurFriend.\n\nA senior administration official insisted that Trump was not giving a \"green light\" to Turkey to carry out any operation, though the president's defense of Turkey on Tuesday will likely raise additional questions about his position.\n\nAsked Monday about the Kurdish fighters, thousands of whom have died fighting alongside U.S. forces in the region and the remainder of whom would be vulnerable without U.S. support, Trump described them as a \"natural enemy\" of Turkey before arguing against prolonged American involvement in the region.\n\n\"We’re willing to do what we have to do, but there has to be an endgame,\" he said. \"And if you stay, it’s going to be the same thing. Eventually you’re going to have to leave.\"", "description": "President Trump on Tuesday defended Turkey as a NATO ally and strong trade partner of the United States one day after he was", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_100419as12_lead.jpg", "published_at": "2019-10-08"}