{"pub": "cnn", "url": "https://cnn.com/2019/10/24/tech/china-quantum-computing-intl-hnk/index.html", "downloaded_at": "2019-10-24 13:58:05.211713+00:00", "title": "Quantum supremacy: US moves ahead of China, but the race isn't over yet", "language": "en", "text": "Hong Kong (CNN Business) Sometimes being first isn't all it's cracked up to be.\n\nraced past China this week in the quest for \"quantum supremacy\" with its claim that a machine developed by the company can solve a problem in 200 seconds that would take the world's fastest supercomputer 10,000 years.\n\nBut just as the Soviet Union was the first to put both a satellite and a human being into orbit, before going on to lose the space race, China may be poised to outstrip any American achievements in a specific field of quantum technology — communication.\n\nBeijing's gains in this area — which could make its communications unhackable — may leave US spies in the dark just as the US-China rivalry is heating up, a prospect that has led to great alarm in Washington.\n\nQuantum supremacy\n\nWhile Google's announcement has drawn skepticism from some of its rivals, and this would not be the first time a claim of \"quantum supremacy\" has been rebuffed , it nevertheless represents a clear step towards the rise of quantum computers.\n\n\"This is a hugely important milestone for the field,\" said Joe Fitzsimons, chief executive of Horizon Quantum Computing . \"The Google result shows that for the first time there is a quantum processor that can do something that a conventional computer cannot do, or at least that a conventional computer cannot do without enormous effort.\"\n\nIn normal computers, data being processed exists in one state at a time — a one, or a zero. Quantum computers , on the other hand, manipulate qubits, which can simultaneously be both a one and a zero, or any combination of the two. The difference means much faster processing speeds, and potentially solving problems and processing data that would take traditional machines millennia.\n\nThis will have applications well beyond physics and mathematics. Quantum computers could lead to breakthroughs in self-learning artificial intelligence (AI), provide medical insights by simulating incredibly complex biological molecules, and simultaneously break all existing cryptographic keys while setting the stage for uncrackable quantum encryption.\n\nThe last point is why many nation states — led by the US and China — have taken a strong interest in quantum computing. The first country to achieve quantum encryption could theoretically go completely \"dark\" to its rivals, hiding all its information from traditional digital surveillance methods. On the flip side, major gains in quantum computing could undo existing means of keeping data secret.\n\nQuantum computers refer to supercomputers, like that built by Google, which use qubits to process huge amounts of data that would be beyond the capabilities of traditional machines. Quantum communication uses the nature of quantum particles to encrypt data in a way that it cannot be put under surveillance without warning the people being watched.\n\n\"Quantum computers are coming, and if it's going to be five, 10 or 15 years before we can decrypt any messages sent in the past, that definitely sends a chill down the spine of any security agency around the world,\" said Dimitris Angelakis , principal investigator at Singapore's Center for Quantum Technologies.\n\nBut while Google may have made an important step this week, the company is by no means alone in investing in quantum computing research, and the next major milestone — an unambiguous demonstration of quantum advantage — remains out of reach.\n\n\"Quantum advantage means demonstrating computational supremacy for a meaningful problem, showing that a quantum processor has been built which is more useful than a conventional computer for at least one problem,\" said Fitzsimons. \"The path to large-scale quantum computing is more of a marathon than a sprint. The current result certainly places Google at the front of the pack, but there is still a long way to the finish line.\"\n\nIf Google is leading the pack, most of the runners clustered behind it are not fellow Silicon Valley companies, but their Chinese competitors and the country's well-funded research institutes.\n\nJUST WATCHED How Google got its start Replay More Videos ... MUST WATCH How Google got its start 01:47\n\nChinese qubits\n\nIn an influential paper last year for the Center for a New American Security, authors Elsa Kania and John Costello wrote that \"China is positioning itself as a powerhouse in quantum science.\"\n\n\"At the highest levels, China's leaders recognize the strategic potential of quantum science and technology to enhance economic and military dimensions of national power,\" they argued. \"These quantum ambitions are intertwined with China's national strategic objective to become a science and technology superpower.\"\n\nFor years now, China has been pouring billions of dollars into funding quantum research, with a particular focus on uncrackable encrypted communication, enabling it to dodge US surveillance.\n\nPan is widely recognized as one of the foremost experts in this field, and was named as one of Nature's top ten people who mattered in science for 2017 , for having \"lit a fire under the country's efforts in quantum technology.\"\n\nUTSC has led efforts to build a China-wide quantum communications network , which would link Beijing, Shanghai, Guangzhou and five other cities via satellites and fiber-optic cables. In a presentation at a conference in Shanghai in August co-organized by the International Telecommunications Union (ITU), a United Nations body, Pan explained how quantum satellites could be used to provide \"unconditional security\" in transmitting data that would be unhackable and impervious to surveillance.\n\nHe also led the research team behind Micius, the world's first quantum satellite, launched by China in 2016 . Named for the ancient Chinese philosopher Mozi, the satellite successfully managed a video call in 2017 between Beijing and Vienna using quantum encryption, making it impossible to eavesdrop upon.\n\nPan is currently building a new quantum research lab in Hefei, into which the government has already pumped more than a billion dollars.\n\n\"We were only the follower and the learner at the birth of modern information science,\" he told MIT Technology Review last year . \"Now we have a chance ... to be a leader.\"\n\nFitzsimons, the Horizon CEO, said that while China \"has had tremendous accomplishments in the field of quantum communication,\" it lags behind the United States and Europe in terms of quantum computation.\n\nAlibaba BABA Baidu BIDU Tencent TCEHY \"The focus on quantum computation in China came after quantum communication, and so is later in bearing fruit,\" he said. \"In recent years, there has been a dramatic increase in efforts both at universities in China and at technology companies, such asand Huawei, focused on computation, which have begun to yield results.\"\n\nJUST WATCHED How China state media is spinning lackluster GDP growth Replay More Videos ... MUST WATCH How China state media is spinning lackluster GDP growth 01:56\n\nQuantum arms race\n\nThe potential benefits of quantum computing to China have been recognized at the highest levels. Quantum technologies were highlighted in the country's 13th Five Year Plan , introduced in 2016, and that same year were mentioned by President Xi himself in a speech announcing the Belt and Road Initiative, his vast trade and infrastructure program.\n\nAs well as government funding, private Chinese companies — like their Silicon Valley rivals — are also getting into the quantum research game: Alibaba alone has pumped around $15 billion into labs focused on future technologies, including quantum computing.\n\ntwice as many patents related to quantum information technology (QIT) as the United States in 2017, and more than 70% of academic QIT patents since 2012 have been awarded to Chinese universities, with US institutions a distant second at 12%. According to Patinformatics , an analysis firm, Chinese organizations filed nearlytwice as many patents related to quantum information technology (QIT) as the United States in 2017, and more than 70% of academic QIT patents since 2012 have been awarded to Chinese universities, with US institutions a distant second at 12%.\n\nBeijing's massive funding, and the advances by Chinese scientists, have not gone unnoticed in Washington.\n\n\"China's advances in quantum science could impact the future military and strategic balance, perhaps even leapfrogging traditional US military-technological advantages,\" Kania and Costello wrote in their report, adding that the US \"should build upon and redouble existing efforts to remain a leader, or at least a major contender, in the development of quantum technologies.\"\n\nTheir recommendations, and similar warnings from other experts, have borne fruit.\n\nIn August, President Donald Trump signed into law the National Quantum Initiative Act. The law authorized an extra $1.2 billion in research funding over five years, as well as establishing a national quantum committee to coordinate research and public funding for the field.\n\nIn the statement enacting the law, the White House said it would \"ensure continued American leadership in quantum information science and technology applications.\"\n\nWhile the United States is starting to match China for funding, Angelakis, the Singapore-based expert, said that \"the biggest challenge in the field in the next few years is not money.\"\n\nAs the field grows, competition for talent is also growing -- a factor that is affected by geopolitics and security concerns over quantum technologies. Angelakis compared the situation to early research into nuclear energy, which rapidly got overtaken and co-opted by governments, with research classified and sharing of discoveries limited, though he was quick to point out that quantum technology does not have as devastating a military use.\n\n\"There's definitely a race going on and the current geopolitical situation is not helping the real science to progress,\" Angelakis said. \"There are cases of people being denied visas ... it could be something that is very negative in the short term because we are still evolving this technology.\"", "description": "Sometimes being first isn't all it's cracked up to be.", "authors": ["Analysis James Griffiths"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191024152640-china-us-quantum-computing-super-tease.jpg", "published_at": "2019-10-24"}