{"pub": "nymag", "url": "https://vulture.com/2019/09/joel-kim-booster-sunnyside-stand-up-interview.html", "downloaded_at": "2019-09-26 16:43:43.360163+00:00", "title": "How Years of Stand-up Led Joel Kim Booster to Sunnyside", "language": "en", "text": "Joel Kim Booster. Photo: Frazer Harrison/Getty Images\n\nJoel Kim Booster isn’t worried about being seen as intellectual. His stand-up persona is defined by an understanding of his own attractiveness and a willingness to admit to stupidity. On his 2017 comedy album Model Minority, he jokes about never having worn a condom because of his lack of sex education, a result of his Christian homeschooling. In his Late Late Show set from earlier this year, he explains that he’s not a bad driver because he’s Asian, but because he refuses to wear his glasses and he texts.\n\nAt a time when so many performers are falling flat as they desperately attempt to make a political statement with their work, Booster’s lack of interest in shoehorning politics into his material makes his work a hell of a lot more organically insightful and entertaining. In recent years, Booster has parlayed his entertainingly brash stage persona into a career as a TV writer for Big Mouth and The Other Two, along with a reimagining of Pride and Prejudice for Quibi, a role on Shrill, and now as a series regular on NBC’s Sunnyside.\n\nThe sitcom follows a former city councilman (Kal Penn) as he scrambles for cash after being kicked out of office after a drunken rant of his goes viral. He accepts payment for meet-and-greets, selfies, and autographs, but when a group of immigrants hires him to help with their naturalization test, he’s got no choice but to work a bit harder for his money. Booster’s absurdly wealthy character, Jun Ho, is certainly in need of assistance in the studying department, but he’s much more interested in the prospect of paying someone to take the exam for him than he is to actually learn anything himself.\n\nAhead of tonight’s Sunnyside premiere, Vulture spoke with Booster about settling into his trademark hot-idiot persona, growing up in the Midwest, and working hard.\n\nHow did you come to the role on Sunnyside? It seems very suited to your stand-up character.\n\nI was asked to audition in the height of pilot season. It was one of many one-off auditions that came in during that time. I think I was on a cruise when I got that audition, and I read the script somewhere in the middle of the Caribbean. When I got back and I auditioned for it, the character description originally — or maybe the read that the casting director asked for — was definitely more Wall Street douchebag bro, more in that realm. Probably because I was just getting back off of that cruise, I was exhausted and I was like, “I can’t do that. I don’t have the range.” Or at least I didn’t that day.\n\nDuring pilot season you’re going into so many auditions, and I think at that point I was just like, “Fuck it, I’m going to give it this read because I know I can do this. If they don’t like it, it’s just another audition, and if they do like it, great.” I got lucky because they liked it. They definitely wanted to see more of that. I think the other thing for me too is that there’s already a comically stupid Asian on NBC on a Mike Schur show, and I was very conscious of not wanting to do Manny Jacinto, because he does it so well and because they probably knew they didn’t want to do a rehash of that character.\n\nWere you always interested in acting as well as stand-up?\n\nIt’s kind of funny, because when I was growing up this was plan A. I always wanted to act. I saw my sister in a school play when I was very young, 5 or 6. From then on, that was all I wanted. I think it’s also a little-kid thing; the only job I really understood was acting because all I did was watch TV all day. I loved attention and I wanted to be an actor. You sort of grow up and you realize how unrealistic that job is, and you scale down. I was like, “Okay, I want to be on Broadway,” and then you realize that’s very unrealistic. Then, “Okay, I’ll do regional theater,” and I got to school and I realized I could write. I thought, “That seems more realistic,” and then you realize how unrealistic television writing is.\n\nI moved to Chicago sort of thinking that I’d carve out a very modest existence for myself as a playwright and a theater actor. Then stand-up came along. It felt like a more accessible way into the industry, which sounds crazy to think about now. I’d sort of given up on acting when I started doing stand-up. I didn’t think that that was ever going to happen for me. The whole reason I started doing stand-up was because I felt like the roles I was being brought in for were boring, one-dimensional token characters, and I didn’t feel that way. Stand-up was an outlet for me to create a version of myself onstage that felt more authentic, or at least more interesting if not authentic. It’s kind of funny that through stand-up I ended up back at my plan A.\n\nIn a profile in the Fader, you mentioned that when you started doing stand-up you were taken to self-deprecating humor. What inspired your shift to such a confident stage persona?\n\nIt’s kind of two things. I was influenced by the way that stand-up sort of shifted. I think there was a moment when that sort of self-deprecating vulnerability felt really interesting to me creatively. It felt like it was a way to connect to audiences, but I think I got bored of it creatively. I think a lot of people do it — it’s sort of an expected angle to take when you step out onstage. It’s an easy way to get an audience on your side. You step out onstage and you say, “Oh, I’m a sad sack. I feel bad about myself because of x, y, and z.” It’s a way to engender sympathy from the audience and then to surprise them with laughter.\n\nIt felt more challenging to me, after a while, to walk out onstage and see if I could turn the audience against me but still make them laugh. Trying to convince an audience that you don’t need laughter even though you’re debasing yourself onstage is much more fun. Comedy, for me, is really about that turn, the surprise factor of it.\n\nThe other part of it is that I stopped feeling that way about myself. I don’t know which came first; it’s hard for me to think back on that time when I started to shift into feeling a little bit more self-possessed and a little bit more confident. I feel like sometimes I might have reverse engineered it — that I made that decision to shift into that character onstage, and then I started to buy it a bit in real life. It’s hard for me to gauge.\n\nDo you think your approach to writing material for stand-up has changed now that you write for a few different shows, too?\n\nIt really is such a different muscle that I’m using in the room. Writing jokes for a character or situations is so contextual in a way that my stand-up isn’t. The context for my stand-up is me. I’m really good in the room, but most stand-ups, I think, are hired on television shows to pitch jokes, like hard jokes — and I do a lot of that, but I’m really a structure guy. I studied dramatic writing and structure, and I really love to write full scripts. And I don’t know, you’d have to ask my bosses this, but I think I’m more a story guy than a jokes guy in the room, so it does feel like I’m exercising two different parts of my brain when I’m writing for myself versus writing for someone on Big Mouth or a character on The Other Two. Although there are a couple of jokes on Big Mouth this year that I sort of concurrently pitched in the room and used in my stand-up, and there’s at least one joke in The Other Two that made it in, that have actually ruined the jokes for stand-up. I can no longer use them in my set because I pitched slightly different versions in those two rooms. It’s sort of a double-edged sword.\n\nDo you still work on writing outside of writers’ rooms and stand-up?\n\nYeah! Right now I’m writing a show for Quibi, and right now in this stage it’s a lot of shooting Sunnyside, then coming home after work and writing that. Do I find time to do it personally? No. Am I writing a lot on spec? Absolutely not. I will do that when I’m not working. I prefer to write the full script then present it to someone, rather than pitch it and try to write it and sell it on pitch. But I’m sort of forced into doing that. I would go crazy if I didn’t have too much work to do.\n\nDo you think growing up in the Midwest prepared you to perform for audiences who may not have the same views as you?\n\nIt probably did. I’m very much confident in the intrinsic, universal humor in my experience and what I’m talking about onstage. I’m all over the country with a lot of this stuff, and I’m not sure necessarily that growing up in the Midwest prepared me for that — I think it’s just the constant having to present some of these bits to people who aren’t in New York or L.A. It’s shaped the way I present a lot of my material. I feel like growing up in the Midwest prepared me for the hard work of it all, but I feel like I’ve spent my entire life trying to break out of the passive-aggressive nature of pleasing everybody that I grew up around. [The Midwest is] so polite, and I’m quite rude onstage, and I think that’s a sort of direct reaction to the way that I was brought up.\n\nI’ve listened to interviews where you talk about the pressure, at the beginning of your career, of saying something insightful and intellectual about your experiences of racism and homophobia. I’ve read that your new stand-up is less identity-focused, but do you still feel the pressure of speaking on these things when you’re working at venues where people may be less interested in your point of view?\n\nI feel less of a pressure to speak generally about these big ideas. It’s still there, but it’s a bit more stealthy. I’m less interested in going onstage and baldly talking about my experiences with racism or homophobia. It’s still there in dribs and drabs, but it’s layered underneath more absurd observations of small, everyday life things. If you get it, you see those layers underneath a story about going to a house party and being one of three Asians there. You see it, but now all of that stuff is ingrained in popular culture. I don’t like to get into it on an intellectual level with audiences. I feel like they’re all reading about it on social media, and it’s more fun to try to sneak it in.", "description": "An interview with comedian Joel Kim Booster about landing a role on NBC’s new comedy ‘Sunnyside’ and his work as a stand-up.", "authors": ["Rachel Davies"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/26/26-joel-kim-booster-chat-room-silo.w1200.h630.jpg", "published_at": "2019-09-26"}