{"pub": "thehill", "url": "https://thehill.com/opinion/finance/466751-democrats-clashes-with-trump-must-not-imperil-trade-with-mexico-and-canada", "downloaded_at": "2019-10-24 13:56:41.975410+00:00", "title": "Democrats' clashes with Trump must not imperil trade with Mexico and Canada", "language": "en", "text": "It is increasingly urgent that the United States achieve stability and predictability with its two largest trading partners. The International Monetary Fund (IMF) warns of a “synchronized global slowdown” powered significantly by trade tensions, and the Institute of International Finance flags 20-year highs in global trade and economic uncertainty.\n\n“Getting to Yes” on the United States-Mexico-Canada Agreement (USMCA) this year would diminish these threats in North America.\n\nMexico and Canada are the No. 1 and No. 2 U.S. trading partners, respectively. They are America’s two largest export markets. The U.S. and they invest heavily in each other. America makes far more together with these neighbors than it makes with any other nation in the world. North American trade supports over 11 million U.S. jobs.\n\nADVERTISEMENT\n\nPassing USMCA will provide clear rules for commerce in North America for at least 16 years. Businesses and farmers will have the certainty needed to plan and invest in the massive North American marketplace — even if trade uncertainty still prevails with China and Europe, the U.S.’s other major commercial partners. Under the present circumstances, many companies are taking a wait-and-see attitude before making greater investments in the region.\n\nU.S. business and farm organizations are pressing hard for approval. U.S. unions and Democrats in Congress remain skeptical. House Democrats and U.S. Trade Representative Robert Lighthizer Robert (Bob) Emmet LighthizerPelosi sounds hopeful on new NAFTA deal despite tensions with White House On The Money: Economy adds 164K jobs in July | Trump signs two-year budget deal, but border showdown looms | US, EU strike deal on beef exports Chinese, US negotiators fine-tuning details of trade agreement: report MORE are engaged in talks to find common ground, especially over labor and enforcement issues in USMCA.\n\nMost observers believe USMCA approval needs to take place this year, before the 2020 U.S. presidential and congressional elections effectively close the chances for a positive vote until 2021.\n\nThough USMCA is not perfect, it modernizes the current NAFTA, incorporating technological and trade practice changes of the past 25 years and offering valuable benefits.\n\nLeaving these three deeply intertwined economies subject to threats of ending NAFTA from President Trump Donald John TrumpSchedule for additional depositions in impeachment inquiry revealed Sondland attorney disputes key portions of Taylor testimony: report Impeachment inquiry might be public by mid-November: report MORE or to future unpredictable actions by the U.S. — such as the U.S. tariffs on steel and aluminum, which sparked counter-tariffs on U.S. farm goods — is not a desirable future for U.S. workers, businesses and farmers, or for Mexico and Canada.\n\nADVERTISEMENT\n\nThis is of particular importance to Mexico. It sells 80 percent of its exports to the U.S. and the IMF predicts its economy will grow only 0.4 percent this year and 1.3 percent next year. There is great need for the long-term predictability that approving USMCA would bring.\n\nPassage in 2019 depends on Lighthizer reaching an agreement with the Democratic majority in the House of Representatives that Mexico and Canada can accept. The Democrats have focused primarily on the means for enforcing labor provisions in the USMCA, with particular attention to whether Mexico’s labor reforms will allow Mexican unions and workers to exercise full rights in dealing with employers. U.S. unions long have argued that Mexico’s laws and practices allow employers to control unions and keep wages suppressed.\n\nMexico’s government under President Andres Manuel Lopez Obrador, however, passed significant labor reforms early in 2019 that established new rules for labor and union rights, and authorized a new court system and other institutions to implement those rules. Turning the reforms into a functioning system will be difficult and require substantial investment to build the new labor institutions and to support the emergence of democratic unions through elections.\n\nU.S. unions and their congressional supporters are demanding assurances that the Mexican government will act promptly and invest sufficient resources. President Lopez Obrador sent a letter to House Ways and Means Committee Chairman Richard Neal Richard Edmund NealHouse progressives to push for floor amendments on Pelosi drug price bill Overnight Health Care — Presented by Partnership for America's Health Care Future — Four companies reach 0M settlement in opioid lawsuit | Deal opens door to larger settlements | House panel to consider vaping tax | Drug pricing markup tomorrow House Democrats ask judge to dismiss Trump lawsuit over NY tax return law MORE (D-Mass.) last week promising such action.\n\nNeal heads the team of congresspersons designated by House Speaker Nancy Pelosi Nancy PelosiSpeier to run for Oversight gavel Graham nixes plan to send Pelosi letter warning GOP won't convict Trump House passes third bill aimed at preventing foreign election interference MORE (D-Calif.) to negotiate with Lighthizer on labor provisions and enforcement, as well as on concerns about environmental issues and some drug pricing provisions in the USMCA draft. Pelosi and key Democratic Congress members signal that they are on a path to possible agreement, while unions continue to flag concerns.\n\nMexico’s labor reform is a historic opportunity for positive change. The U.S. unions and Democrats should be considering not only steps to bolster “enforcement” of Mexico’s USMCA commitments but ways in which the U.S. can support implementation of reforms.\n\n“Getting to Yes” on USMCA also can open opportunities for better cooperation on addressing the smuggling of hard drugs into the U.S. and dealing with violent cartels operating in Mexico, which are funded by drug sales in the U.S. The recent cartel violence in Mexico underscores the urgency of the problems. Approving USMCA also will support forging more sustainable longer-term solutions to migration challenges at the U.S.-Mexico border.\n\nThe U.S. has a strong interest in a prospering and stable Mexico. A growing Mexican economy, and one less plagued by violence, will generate fewer individuals seeking to enter the U.S. improperly.\n\nThe clashes between President Trump and House Democrats over impeachment sour the atmosphere for reaching agreement. Some Democrats will be hesitant to approve an agreement that the president will claim as a major victory, especially if they cannot show that Congress significantly improved the agreement.\n\nPelosi will need to consider those factors when deciding whether to bring USMCA to a vote in the House. In addition, Mexico and Canada will need to sign onto any provisions worked out between House Democrats and the U.S. administration.\n\nIn the weeks ahead, creativity to design specific substantive fixes and to meet political needs of all parties will be key. Whatever happens, the parties should not impose further blows on the trilateral economic partnership the U.S. has built with Canada and Mexico. The players should also realize that a choice to leave NAFTA in place with continuing uncertainty risks freezing potential investment, when that boost is needed, given the adverse global environment and increasingly complicated security and economic situation in Mexico.\n\nCongressional leaders and the Trump administration must demonstrate that the U.S. is committed to maintaining a stable, predictable and mutually beneficial relationship. If a path forward on USMCA is found this year, North America’s economies will greatly benefit.\n\nEarl Anthony Wayne is a former U.S. Ambassador to Mexico, co-chair of the advisory board at the Wilson Center’s Mexico Institute, and a diplomat in residence at American University’s School of International Service. Follow him on Twitter @EAnthonyWayne.", "description": "With impeachment talk, some Democrats will be hesitant to approve the USMCA if the president can claim a major victory.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_pelosinancy_100819asgn_lead.jpg", "published_at": "2019-10-24"}