{"pub": "yahoo", "url": "https://news.yahoo.com/mississippi-man-pleads-guilty-cross-002840405.html", "downloaded_at": "2019-09-12 12:43:48.904469+00:00", "title": "Mississippi man pleads guilty to cross burning, sentenced to 11 years in federal prison", "language": "en", "text": "HATTIESBURG, Miss. – A man who pleaded guilty to burning a cross outside the home of a black family in Mississippi was sentenced Tuesday to 11 years in federal prison.\n\nLouie Revette, 38, of Collins pleaded guilty in April to one count of interference with housing rights, a federal civil rights violation, and one count of using fire during the commission of a federal felony for the 2017 incident.\n\nIn his plea, Revette admitted he went to what he knew to be a predominantly black neighborhood in Seminary, about 70 miles south of Jackson. He and another man, Graham Williamson, who also pleaded guilty, built a cross to burn near the home of a juvenile. The two men placed the cross near the youth's home and lit it on fire.\n\nRevette said he built and burned the cross to threaten, frighten and intimidate the teen and other black residents because of their race and color.\n\nCross burning: White Mississippi man charged in federal hate crime case\n\nBut in court Tuesday, U.S. District Judge Keith Starrett said the crime was not entirely based on race, although he did not elaborate on what else motivated Revette to burn the cross.\n\nRegardless of motive, Starrett said \"cross burning is a big deal\" and as a child in McComb \"in the cross burning capital of the South,\" he was fully aware of the fear and intimidation elicited by cross burnings and church fires.\"\n\n\"It is not an act of courage to come in the night and try to intimidate somebody,\" the judge said.\n\nRevette's family and friends wept as he told Starrett he was sorry for what he had done and wished the incident never happened.\n\n\"I want everyone to know I'm not proud of what happened,\" he said. \"I hate what I did. I can't even believe I did that. I never done anything like that before in my life.\"\n\nAttorneys for the government sought a longer sentence for Revette, saying he was instrumental in perpetrating the crime and recruiting others to join him in the commission of the cross burning. In addition, the government said, the intended victim was particularly vulnerable since he was a 16-year-old in the 10th grade.\n\nNone of the victim's family was in court for the sentencing, but the victim's grandmother, Rose Marie Shears, conveyed through the U.S. Attorney's Office that it brought back a lot of the fear and terror of the past. She said she is afraid now that Revette and Williamson or others \"will come back to get them.\"\n\nShears asked the court to give Revette a long prison sentence – between 20 and 40 years – so he could not come back and further terrorize her family.\n\n\"I thought that 'those days' were over,\" she told Julia Gegenheimer, an attorney for the government, on Monday. \"This act has brought it all back.\"\n\nRevette said he wished he could take it all back.\n\n\"I wish the family was here,\" he said. \"I don't want no hatred between his family and myself.\"\n\nHe told Starrett he agreed when the judge said sometimes you have to be locked up to be set free and wants to put the incident behind him.\n\n\"I hate that I had to hurt (the victim) to get to where I am now, but I thank God for rescuing me,\" he said.\n\nWilliamson, who pleaded guilty in June, will be sentenced Nov. 5.\n\nFollow Lici Beveridge on Twitter: @licibev\n\nThis article originally appeared on Mississippi Clarion Ledger: Cross burning: Mississippi man pleads guilty, sentenced to 11 years", "description": "Louie Revette pleaded guilty in April for his part in burning a cross outside the home of a black family in Seminary, Mississippi.", "authors": ["Lici Beveridge", "Mississippi Clarion Ledger"], "top_image": "https://s.yimg.com/uu/api/res/1.2/kT1d9HTv2p4.Eg2HVMqanw--~B/aD00MDMyO3c9MzAyNDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/5c691f3f78564172c82b5e09d96af821", "published_at": "2019-09-11"}