{"pub": "businessinsider", "url": "https://businesstimes.com.sg/banking-finance/us-bank-to-slash-branch-jobs-nationwide-in-digital-push", "downloaded_at": "2019-10-22 20:43:28.740361+00:00", "title": "US bank to slash branch jobs nationwide in digital push", "language": "en", "text": "US Bancorp is undergoing a sweeping reduction of branch jobs numbering in the thousands as it reacts to more customers doing their banking online.\n\n[NEW YORK] US Bancorp is undergoing a sweeping reduction of branch jobs numbering in the thousands as it reacts to more customers doing their banking online.\n\nSome job categories, including teller coordinator and assistant branch manager, are being eliminated or will have headcount greatly reduced. The cuts on will represent less than 2 per cent of the bank's 74,000 employees, spokeswoman Molly Snyder said. Chief Executive Officer Andy Cecere said in a memo to staff that US Bancorp \"made the difficult decision to eliminate their jobs because customer behaviors have changed.\"\n\nThe nation's fifth-largest bank by deposits will also add some new roles and a training programme so existing employees can widen their skill sets, according to the memo. None of US Bank's roughly 3,700 branches will be closed as part of the moves, according to Ms Snyder, who confirmed the contents of Cecere's memo and declined to comment on the exact number of cuts.\n\nMs Snyder said the firm will begin hiring client-relationship consultants and business-banking development consultants among other new roles to work in the branches.\n\nsentifi.com Market voices on:\n\nBanks have for years been reassessing the role of branches in their strategies as customers increasingly handle their finances online. US Bancorp has said it plans to lean heavily on digital offerings and enter new markets with a \"branch-light concept.\" Earlier this year, the firm hired Derek White from Banco Bilbao Vizcaya Argentaria SA as chief digital officer to boost innovation.\n\nA McKinsey & Co study released Monday said banks are heading \"into an arms race on technology\" as new competitors like fintech startups try to take market share. Financial-services incumbents need to take dramatic action to fund innovation, or risk being left behind, the report says. Banks allocate just 35 per cent of their information-technology budgets to innovation, while fintechs spend more than 70 per cent, McKinsey said.\n\nBLOOMBERG", "description": ": THE BUSINESS TIMES Banking & Finance - [NEW YORK] US Bancorp is undergoing a sweeping reduction of branch jobs numbering in the thousands as it reacts to more customers doing their banking online. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/articles/2019/10/22/file6u2k4a327z71h0u3hyk.jpg?itok=7k9AhK8o", "published_at": "2019-10-22"}