{"pub": "metro", "url": "https://metro.co.uk/2019/10/23/unbelievable-jeff-chris-kamara-swaps-football-stands-recording-studio-releases-christmas-album-10968397", "downloaded_at": "2019-10-23 11:01:28.776587+00:00", "title": "Chris Kamara swaps football for recording studio as he releases Christmas album", "language": "en", "text": "Chris Kamara is releasing an album of Christmas covers (Picture: WireImage)\n\nChris Kamara is one of the most famous sports pundits in the world, with his catchphrase ‘Unbelievable, Jeff!’ known all over the world.\n\nBut the 61-year-old is swapping the football stands for the recording studio, as he prepares to release his debut album.\n\nYes, seriously.\n\nNot only is the former Portsmouth footballer set to tackle the charts, but he’s also coming for Michael Buble’s crown with his very own Christmas covers album.\n\nAnd we’re already living for it.\n\nSpeaking about his musical side, Kammy explained: ‘I know it might be surprising to some, but anyone who knows me – especially those who shared a changing room with me in my playing days who first told me I could sing – will tell you what a big fan I am of big band music.\n\nKammy’s Here’s To Christmas is released on 15 November\n\n‘Never in my wildest dreams did I think I’d get to record a full album, though!\n\nAdvertisement\n\nAdvertisement\n\n‘Here’s to Christmas is something I’m really proud of and I think it stands up as something fun, but something that doesn’t sound half bad too – an album to get everyone into the swing of Christmas!’\n\nChris is planning to get us all in the festive mood by belting out some of the biggest Christmas songs around, including Let It Snow, Rudolph The Red Nose Reindeer, Jingle Bells and Walking In A Winter Wonderland.\n\nWe’re kind of gutted that All I Want For Christmas didn’t get a look in, Kammy…\n\nWe can’t believe this, Kammy (Picture: Getty)\n\nBut the Ninja Warriors host is adamant he’s not just a novelty act, but a serious chart contender.\n\n‘Initially, I thought we would do lots of gimmicky things and we’ll have a laugh,’ he told The Sun.\n\n‘I’ve been asked to release songs called Unbelievable all the time and I actually wouldn’t have minded.\n\n‘Then they told me, “No, no, this is a serious album, we’ve got belief in you that this’ll do OK. We think you’re good”.\n\n‘I never thought in my wildest dreams I’d ever be offered a record deal, and to get a Christmas No1 would be huge for any performer, let alone an ex-footballer.’\n\nAdvertisement\n\nAdvertisement\n\nYou better believe it, Jeff!\n\nChris Kamara’s Here’s To Christmas is released on 15 November.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: First look at Last Tango In Halifax series 5 as series returns for 2020\n\nMORE: Geordie Shore’s Aaron Chalmers announces he’s going to be a dad – days after split from girlfriend", "description": "Chris Kamara swaps football stands for recording studio as he releases Christmas album full of covers", "authors": ["Rishma Dosani"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/comp-1571823840_1571824031.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-23"}