{"pub": "nytimes", "url": "https://nytimes.com/2019/10/15/opinion/rich-kids-can-spare-some-of-their-inheritance.html", "downloaded_at": "2019-10-15 23:04:29.875015+00:00", "title": "Opinion | Rich Kids Can Spare Some of Their Inheritance", "language": "en", "text": "The latest increase in the estate tax exemption came in the 2017 Tax Cuts and Jobs Act. It doubled the already generous exemption to $22.8 million from $11.4 million for couples. Congress hid much of the long-term revenue loss from the 2017 law by scheduling many provisions, including the estate tax exemption increase, to expire in 2026. It is a good bet, however, that Congress will make the exemption increase permanent.\n\nTwo Democratic presidential candidates have proposals to curb wealth concentration. Senator Elizabeth Warren proposes an annual tax on net wealth — assets over $50 million would be taxed at 2 percent; assets assessed to be over $1 billion would face an extra 1 percent. Senator Bernie Sanders wants an even larger wealth tax , which he estimates would yield roughly twice as much revenue as Ms. Warren’s plan. Mr. Sanders also has a plan that would cut today’s estate tax exemption — to a still-generous $7 million for couples — and raise today’s flat 40 percent rate to a range of 45 percent to 77 percent, with the highest rate applicable only to the estates of billionaires.\n\nDespite vigorous advocacy by these two candidates, the chances of enacting and — of equal importance — sustaining either tax long-term is poor.\n\nA dozen or so countries used to have wealth taxes, although none at rates approaching those Ms. Warren and Mr. Sanders seek. And all but six countries have effectively abandoned them. One reason is that a broad wealth tax can work only if all or most assets of every potentially taxable person are valued every year. That is a Sisyphean task under the best of circumstances. It would be an impossible challenge in the United States, where chronically underfunded tax administrators are already unable to prevent hundreds of billions of income tax dollars from being lost each year to evasion.\n\nMr. Sanders’s proposal to reinvigorate the estate tax has many attractions. But the political obstacles are formidable. Opponents have successfully branded it a “death tax,” arousing primal instincts against adding an economic penalty to a time of emotional pain and loss. And so estate taxes continue to poll badly, even though an exceptional few people face them.", "description": "A tax on inherited money or property — unlike wealth or estate taxes — would be hard for even the fanciest accountants to shake.", "authors": ["Henry Aaron"], "top_image": "https://static01.nyt.com/images/2019/10/15/opinion/15Aaron/15Aaron-facebookJumbo.jpg", "published_at": "2019-10-15"}