{"pub": "yahoo", "url": "https://yahoo.com/entertainment/jenny-mccarthy-emmys-red-carpet-photo-203017285.html", "downloaded_at": "2019-09-25 04:42:26.906366+00:00", "title": "People Are Annoyed At This Photo Of Jenny McCarthy Sprawled On The Emmys Red Carpet", "language": "en", "text": "It seems that making mistakes is pretty exhausting work.\n\nOn Monday, Jenny McCarthy posted a photo to Twitter of herself sprawled on the Emmys red carpet after wrapping her pre-show coverage for Fox on Sunday.\n\n“Thank you so much for watching!” McCarthy wrote alongside the photo. “Appreciate the [love] and support so much. ... And now I sleep.”\n\nThank you so much for watching! Appreciate the ❤️ and support so much. 💃❤️💃❤️💃\n\nAnd now I sleep. pic.twitter.com/CzunQf6f1E — Jenny McC-Wahlberg (@JennyMcCarthy) September 23, 2019\n\nThe tweet was presumably meant to be cute, but some on Twitter didn’t find it so amusing ― especially since the “Masked Singer” judge had butchered an interview on the red carpet with Christina Applegate, who was nominated for Outstanding Lead Actress in a Comedy Series for her role on Netflix’s “Dead to Me.” (Phoebe Waller-Bridge would end up winning that category for “Fleabag.”)\n\nDuring their awkward exchange, not only did McCarthy, 46, coyly attempt to make Applegate, 47, appear much older than she is, but she also asked her how it felt to be “nominated for your own show” for the first time. McCarthy apparently didn’t know that Applegate had been nominated for Outstanding Lead Actress in a Comedy Series twice before, for ABC’s “Samantha Who?”\n\nWith this disaster of an interview fresh in their minds, people on Twitter sounded off at McCarthy. Many made references to her 2008 book “Louder Than Words: A Mother’s Journey in Healing Autism,” in which she argued that vaccines weakened her son’s immune system and sparked his autism. There is essentially no scientific basis to the idea that vaccines lead to autism, in spite of what McCarthy and others have said.\n\nKeep scrolling for more reactions to McCarthy’s red carpet antics.\n\nWatching you bomb during that twin wreck was something. Dare I say apocalyptic? Do you feel ok? Perhaps you’ve contracted some kind of virus that could’ve easily been averted by, say, a vaccine? — Slightly Optimistic FinsFan (@nicko6568) September 23, 2019\n\nChristina applegate handled your ignorance so well yesterday. Glad you can sleep about it — peter the metor (@peterthemeteor) September 23, 2019\n\nApparently your knowledge of the Emmy nominations was equal to your knowledge of vaccines. I loved @1capplegate dragging you — Anne Madison (@madisonfive) September 23, 2019\n\nYou were HORRIBLE — Just me (@rudedogwon) September 23, 2019\n\n#ChristinaApplegate is not your senior 🤦‍♀️🤦‍♀️ insert foot into big mouth 👄 — ❤️🇨🇦🌈🌝💉Schvanky💉🌝🇨🇦🌈❤️ (@Schvanky) September 24, 2019\n\nIs this the wicked witch of the west right before the house falls on her — Joan McNamara (@JoanieMcNamara) September 23, 2019\n\nYour interviews were painful to watch... pic.twitter.com/C1htiIfLGP — Maria (@NFW22b) September 23, 2019\n\nSorry but you suck at this job. Do your homework before interviewing people. — Bev (@bsyovat) September 24, 2019\n\nMe watching you interview Christina Applegate.. pic.twitter.com/IJ4GhHJZzf — Lisa Marks Jackson (@Lisaj3221) September 23, 2019\n\nGood. Get some rest so you can wake up refreshed and hurt more people with your antivax nonsense. — Molly Hodgdon (@Manglewood) September 23, 2019\n\nLove HuffPost? Become a founding member of HuffPost Plus today.\n\nThis article originally appeared on HuffPost.", "description": "“Christina Applegate handled your ignorance so well yesterday,” one commenter said. “Glad you can sleep about it.”", "authors": ["Elyse Wanshel"], "top_image": "https://s.yimg.com/uu/api/res/1.2/yeotqubWSSiVQlpGo06Apg--~B/aD0yNTk2O3c9Mzg5NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://img.huffingtonpost.com/asset/5d8a67252200003100fbf20c.jpg", "published_at": "2019-09-24"}