{"pub": "fox", "url": "https://foxnews.com/media/jason-chaffetz-exposes-democrats-behind-the-scenes-tactics-to-change-our-election-process", "downloaded_at": "2019-09-07 02:27:10.457773+00:00", "title": "Jason Chaffetz exposes Democrats' 'behind-the-scenes tactics' to change our election process", "language": "en", "text": "Democrats want to change the Electoral College and are implementing “behind-the-scenes tactics” to achieve their goal, said Fox News contributor and former Rep. Jason Chaffetz to Fox News.\n\nChaffetz, a Republican who served Utah’s 3rd congressional district from 2009 until his retirement in 2017, told “Fox & Friends” on Friday that Democrats are \"using the levers of government to try to negate the 2016 election but then do things in 2020 that they should never, ever do.”\n\nSECOND 2020 DEMOCRATIC PRIMARY DEBATE -- NIGHT 1 LIVE BLOG\n\nAmong the “behind-the-scenes” tactics Democrats are using is “vote harvesting,” Chaffetz claimed.\n\n“If the Democrats had their way, they want to be able to go out and collect everybody’s ballots without you having to go to the poll[s].”\n\n“You could supposedly sign it, but they want to collect this. They did it in California. They took about eight seats from Republicans in California.”\n\n“They did it in California, they did it in Arizona, they want to make it legal,” said Chaffetz, former chair of the House oversight committee.\n\nChaffetz said his new book, “Power Grab,” is premised on what Democrats are “doing behind the scenes” to invalidate the 2016 election results and undermine the election process.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“There are a lot of tactics and things that they do to try to change the way we’re doing the election. They want to change the Electoral College, they want to make vote harvesting legal, and they’re doing this behind the scenes.”\n\nChaffetz also said that the “left’s” use of “intimidation” and “shaming” - like the recent suggested Hollywood blacklist of Trump supporters - is actually making President Trump “stronger politically than he has ever been before.”", "description": "Democrats want to change the Electoral College and are implementing “behind-the-scenes tactics” to achieve their goal, Fox News contributor and former Rep. Jason Chaffetz told Fox News.", "authors": ["Joshua Nelson", "Joshua Nelson Is A Freelance Reporter For Fox News."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Screen-Shot-2019-09-06-at-10.15.59-AM.png", "published_at": "2019-09-06"}