{"pub": "marketwatch", "url": "https://marketwatch.com/story/congress-set-for-maneuvering-to-avoid-another-government-shutdown-2019-09-07", "downloaded_at": "2019-09-07 13:36:48.233476+00:00", "title": "Congress set for maneuvering to avoid another government shutdown", "language": "en", "text": "With a limited amount of time to avoid a second government shutdown this year, members of the Senate Appropriations Committee might end up in a full-fledged sprint.\n\nPrior to the August recess, the House passed 10 out of 12 of its annual funding bills. The Senate reached a two-year budget agreement in addition to voting to raise the debt ceiling. Now it’s up to the upper chamber’s appropriators to decide how best to divide the pie among government departments.\n\nThe bills they will be voting on starting Thursday include funding for the departments of Defense, State, Labor, Education, Health and Human Services and Energy.\n\nAlabama Republican Sen. Richard Shelby, who chairs the committee, said before the recess that he is hoping to bundle at least three of the bills together to ensure the bulk of government programs receive funding.\n\nHouse Democrats, however, fear that the Senate committee will not reach a resolution before an Oct. 1 deadline. To avoid a shutdown, House Majority Leader Steny Hoyer said in a letter to Democratic colleagues that a vote to enact a stopgap measure will take place in the coming week.\n\n“As we wait for them to complete their work so that we can begin conference negotiations,” Hoyer wrote, “a continuing resolution will be necessary to prevent another government shutdown like the one we experienced earlier this year, which harmed thousands of American families.”\n\nIf passed, the stopgap measure will temporarily avert a shutdown and buy lawmakers more time to reach a longer-term resolution.\n\nSee: Last government shutdown ranked as the longest on record — by a wide margin\n\nThen there are matters that look more like a marathon. Unlike funding the government, many items on Congress’s to-do list are not subject to a hard deadline. Here are some of the issues where lawmakers may pace themselves in order to reach the finish line.\n\nDrug pricing\n\nBefore the recess, members of the Senate Finance Committee began pushing legislation that would curb drug-price rises by placing some caps on out-of-pocket spending in Medicare.\n\nOther Washington efforts to rein in pharmaceutical prices have included bills that aim to deter pharma companies from blocking or delaying generic competition, as well as a Trump administration plan to curb rebates that have gone to pharmacy benefit managers. In addition, another bill would require drug makers to justify large price hikes and high launch prices.\n\nThere is a “significant chance” for Congressional action this fall on drug pricing, said lobbyist Bruce Mehlman from the firm Mehlman Castagnetti Rosen & Thomas in a recent note.\n\nFacebook’s cryptocurrency\n\nCalifornia Democratic Rep. Maxine Waters, who serves as the chairwoman of the House Financial Services Committee, said that the panel plans to resume its investigation into Facebook Inc.’s FB, -1.79% cryptocurrency, Libra. Shortly before the recess, the head of Facebook’s crypto effort — David Marcus — testified before that House panel and the Senate Banking Committee.\n\nMarcus agreed to comply with government regulation, but his testimony failed to curb lawmakers’ concerns regarding Facebook’s ability to limit access to the virtual currency and its potential to be used as a money-laundering tool.\n\nRead more: Facebook’s Libra could be more dangerous than 9/11, congressman says\n\nWaters also said that her committee will be seeking testimony from top financial regulators including Treasury Secretary Steven Mnuchin and Consumer Financial Protection Bureau Director Kathy Kraninger.\n\nCannabis banking\n\nThe cannabis industry has disclosed spending more than $1.6 million so far this year to lobby lawmakers on matters such as passing the SAFE Banking Act, which would offer protections for banks that serve cannabis companies, as well as the STATES Act, which would help states that have legalized marijuana.\n\nBefore the August recess, Idaho GOP Sen. Mike Crapo, who chairs the Senate Banking Committee, suggested there are strong grounds for reducing the vulnerability of banks that work with the booming marijuana industry. But analysts still have sounded downbeat on the prospects of the SAFE Banking Act.\n\nGun control\n\nIn the wake of 2019’s many mass shootings, Democratic lawmakers are expected to push for increased gun-control laws. Meanwhile, Senate Majority Leader Mitch McConnell suggested in the past week that his fellow Republican lawmakers are placing the burden on President Donald Trump to propose a plan to curtail gun violence.\n\nMcConnell added that he expects to hear back from the White House this coming week and wants to make sure that senators “would actually be making a law and not just having serial votes.”\n\nRobocalls\n\nThe House in July passed a bill known as the Stopping Bad Robocalls Act by a sweeping majority of 429-3.\n\nOne consumer advocate — the National Consumer Law Center’s Margot Saunders — has said the bill goes the farthest in cracking down on robocalls compared with other bills such as the TRACED Act, which passed the Senate in May in a 97-1 vote. In a recent column for the Hill, Saunders called for lawmakers to pass the provisions of both the Stopping Bad Robocalls Act and the TRACED Act into law.\n\nMehlman, the lobbyist, said there is a “significant chance” for Congressional action this fall on robocalls.\n\nRelated: How to avoid getting scammed when planning a last-minute getaway\n\nAnd see: Scam robocallers stole nearly $1 billion last year", "description": "With a limited amount of time to avoid a second government shutdown this year, the Senate Appropriations Committee might end up in a full-fledged sprint....", "authors": ["Elisabeth Buchwald"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ856_congre_ZG_20190906154006.jpg", "published_at": "2019-09-07"}