{"pub": "businessinsider", "url": "https://businessinsider.co.za/salary-depression-twitter-khaya-fm-thabo-mokwele-how-to-survive-on-salary-2019-10", "downloaded_at": "2019-10-10 15:24:11.840309+00:00", "title": "“Your salary can’t afford that”: SA tweets on #SalaryDepression", "language": "en", "text": "South Africans on Twitter shared how they battle with #SalaryDepression every month.\n\nThis after radio presenter Thabo Mokwele on world mental health day asked listeners if they struggle with it.\n\nThe SARB recently revealed that local salary growth was the lowest ever.\n\nFor more visit Business Insider.\n\nSouth Africans flooded Twitter to share their struggles and give advice on how to survive the month on a single salary.\n\nUnder the hashtag #SalaryDepression, Twitter users shared advice on how best to save money, and some of the biggest mistakes they’ve made spending money.\n\nThe hashtag started trending on Thursday, which is also world mental health day, shortly after Khaya FM presenter Thabo Mokwele (@tboseZA) asked followers if they suffer from #SalaryDepression.\n\nDo you suffer from #SalaryDepression? What’s the cause? What time of the month does it hit you? — #TOS5 Out NOW (@tboseZA) October 10, 2019\n\n[3 T SPOONS] on how #SalaryDepression affects you?? Emotional Intelligence. You are a grumpy employee these days?? Your Freedom. Phone calls make you anxious?? Relationships. Black tax. Friends going out every week. Your salary can’t afford all of that#TheBestTInTheCity pic.twitter.com/ZMtmxF9gR8 — Kaya FM Music (@KayaFMMusic) October 10, 2019\n\nUsers were quick to share how they are affected by #salarydepression, with some saying they only work to survive.\n\nLol I can relate, I can spend so much in a day and survive the whole month with R50 ??????????, lol it's not funny but hey #salarydepression https://t.co/zC5jjhNeis — Avi-Rai (@rythmstunes) October 10, 2019\n\nI never knew what that was until I left home. Kunzima kwa department of pay your own bills #SalaryDepression — A Teacher (@nkulee_101) October 10, 2019\n\nDesperation lead us to take salary offers that are below standard. Now you in there, unhappy because the salary doesn’t match the work. Companies do 5% yearly increase meaning it will still be way less than what you deserve. #SalaryDepression — ukhanki (@TboozeSA) October 10, 2019\n\nEveryday ke #SalaryDepression from payday until the next payday, cost of living is too high, no matter how much you try to live within your means. Those basic needs cost a lot?????? — Kgabe (@kgabe20) October 10, 2019\n\nFew days ago I took my car for a service, I had R6 200 which i had been saving since January for December.Anyway, I ended up paying R5 900, for Major Service and brakes replacement.#IamNotOkay#SalaryDepression — Be Kind To Yourself (@CreatorGoddess1) October 10, 2019\n\n@Lungswa shared that #SalaryDepression hits them from the first day of the month, to the last day of the month.\n\n#SalaryDepression hits me from the 1st til 31st pic.twitter.com/WRFifdc2CK — Lungiswa Jonas (@Lungswa) October 10, 2019\n\n#SalaryDepression You get paid today, in the next three days you are left with nothing and wait for month end to get paid again. Its sad guys — marvellous mashiane (@Marvellous_mash) October 10, 2019\n\nIt just hit me guys, I work for taxi fare each month ??????#SalaryDepression pic.twitter.com/1R3etTDbNN — prynsess (@daimon_rank) October 10, 2019\n\n#SalaryDepression pay day its lik any other day... After notification debit orders be like uyaphi lo?!!! pic.twitter.com/yxFErr73zq — Carol Nthabi Mohlala (@mohlala_carol) October 10, 2019\n\n@ThabisoMngoma1 said it is the salary that he receives which gives him #SalaryDepression.\n\n#SalaryDepression, Funny enough my salary is supposed to free me from financial stress but it seems like it buys me stress, depression, tears and more problems before it buys me food and other items I really need.????????????. We need a whole night prayer for our salaries guys?? pic.twitter.com/0Db4vkqtvp — Thabiso Mngoma (@ThabisoMngoma1) October 10, 2019\n\n#SalaryDepression Then you get increase ye-R400 in the middle of the year knowing ukuthi medical aid izunyuka January nge R300. Basically ndixhensa same place. pic.twitter.com/uJAhyheEeR — Thembalihle Tshefu (@ThembalihleTs) October 10, 2019\n\nSome of you have family members who can make Just one phone call to get you good job's but they won't because they don’t wanna see you succeeding banithanda nihlupheka ??#SalaryDepression pic.twitter.com/MFToINH1Vs — Mommy ?? (@Bahumi15) October 10, 2019\n\n#salarydepression Everyday of my life.. i dont go slaying because i carry my loved one. I try as little as I can to make myself happy but they always come first. that's where my blessing are ?? — Thembani Akim (@ThembaniAkim) October 10, 2019\n\n@MsTshepy said food and fuel is the cause of #SalaryDepression.\n\nFood and petrol are the cause of #SalaryDepression hei we paying more from month to month pic.twitter.com/76BV5EZ5Ha — Tshepiso Mongale (@MsTshepy) October 10, 2019\n\n#SalaryDepression at least we are left with 20days before we get paid...the rest is history pic.twitter.com/YIxsb69RER — Moemedi (@o_moemedi) October 10, 2019\n\n#SalaryDepression After receiving that sms , things are not balancing pic.twitter.com/sythlmjOSD — mpho (@mphochwenyane) October 10, 2019\n\n#SalaryDepression you be sitting like this in a taxi on payday ??taxi e fete ka wena pic.twitter.com/XI3v1U8NbF — mpho (@mphochwenyane) October 10, 2019\n\n@sthe_213 said #SalaryDepression is caused by Black Tax and the cost of living, among others.\n\n#SalaryDepression caused by slave salary + cost of living + government tax + black tax + peer pressure. — $the Khumalo ???? (@sthe_213) October 10, 2019\n\n#SalaryDepression caused by slave salary + cost of living + government tax + black tax + peer pressure. — $the Khumalo ???? (@sthe_213) October 10, 2019\n\nSome users gave South Africans advice on how to wisely spend their money.\n\n@AshleyPhaka suggested that people get hospital plans instead of medical aid.\n\n#SalaryDepression cancel medical aid and get hospital plan. Reduce your debit orders by paying them off and avoiding taking more of them. Delete your banking app, it makes it easier to spend the little money you have — Ash With Da Dash ?? (@AshleyPhaka) October 10, 2019\n\n@VNoruka said he stays out of debt by living a simple life.\n\n#SalaryDepression????????it was in 2007,I managed to pay off all my https://t.co/5zH1Ag4WHJ I'm coping I have learned to simplify my life. — Vuyo Noruka (@VNoruka) October 10, 2019\n\nOthers said those with salaries should consider themselves lucky as many South Africans are still looking for work.\n\nSome of you are already on stage 3 of depression which is salary depression while many of us are still on stage 1 of depression which is unemployment depression. Unemployment depression slap harder than salary depression. But I don't condone underpaying workers #SalaryDepression — Politics Analysts ???? (@CPhungwayo) October 10, 2019\n\nThe South African Reserve Bank (SARB) recently revealed that South African salary growth was the lowest ever at just 1%, Fin24 reported.\n\nThis means local salaries are not keeping up with inflation of around 4%.", "description": "The SARB recently revealed that local salary growth was the lowest ever.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9461/f7c9448ce4e946b6b64eff6428210e8a.png", "published_at": "2019-10-10"}