{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/transfer-news/man-utd-target-saul-niguez-20645328", "downloaded_at": "2019-10-18 04:50:39.599647+00:00", "title": "Man Utd target Saul Niguez alongside James Maddison 'at top of wish list'", "language": "en", "text": "Get the biggest Manchester United FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nManchester United have reportedly placed Atletico Madrid midfielder Saul Niguez alongside James Maddison at the top of their midfield wishlist.\n\nUnited are ready to spend big on six or seven players in the next two transfer windows, following the club's worst start to a league season for 30 years.\n\nBoss Ole Gunnar Solskjaer needs to make improvements throughout his squad, with signings targeted at centre-back, left-back, midfield and up front.\n\nAnd 24-year-old central midfielder Saul has joined Leicester ace Maddison and Lyon striker Moussa Dembele at the top of United's list of transfer targets, according to the Sun .\n\nSaul's deal with Atletico keeps him at the club until 2026, but he is reported to have a release clause of £135m.\n\n(Image: REUTERS)\n\nPaul Pogba is still being linked with interest from Real Madrid and Juventus ahead of the January transfer window - and if United decide to cash in on the French midfielder they will certainly be able to afford Spain international Saul.\n\nAnd United haven't been afraid to splash the cash, having signed Harry Maguire from Leicester for £80million in the summer after pricing Manchester City out of the race for the centre-half.\n\nPogba is injured ahead of United's clash with Liverpool at old Trafford on Sunday, and was pictured talking to Madrid boss Zinedine Zidane during a chance meeting between the two in Dubai this week.\n\n(Image: Action Images via Reuters)\n\nUnited have also been linked with moves for Juventus striker Mario Mandzukic, Leicester left-back Ben Chilwell and West Ham midfielder Declan Rice - while Spanish publication Marca even linked them with a swoop for PSG star Kylian Mbappe.\n\nWhile United have been focusing on signing young, homegrown players who can help build the future at the club, there is a recognition that they may need to bring in some more experienced players such as 33-year-old Mandzukic - possibly in January - to ensure the team's form doesn't nosedive too much.", "description": "Niguez reportedly has a £135m release clause - but United need to spend big to make improvements throughout the squad", "authors": ["Gareth Bicknell", "Image", "Reuters", "Action Images Via Reuters"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article14229880.ece/ALTERNATES/s1200/0_La-Liga-Santander-Deportivo-Alaves-v-Atletico-Madrid.jpg", "published_at": "2019-10-18"}