{"pub": "marketwatch", "url": "https://mansionglobal.com/articles/brexit-fracas-put-off-u-k-house-sellers-in-september-208094", "downloaded_at": "2019-10-11 00:22:38.389496+00:00", "title": "Brexit Fracas Puts Off U.K. House Sellers in September", "language": "en", "text": "A measure of U.K. home listings sunk to its lowest reading in three years in September, as a slowdown in the British housing market puts off would-be sellers.\n\n\n\nA sweeping majority of surveyed real estate agents said the number of new listings on their books was the same or fell in September, according to the results of a monthly poll released Thursday by the Royal Institute of Chartered Surveyors. The survey of some 547 real estate offices found agents identified “heightened economic and political uncertainty as a contributing factor behind the sluggish picture,” according to the report.\n\n\n\nMore: Four-Story Stone House in England’s Posh Cotswolds Asks £3.95 Million\n\nMost agents also reported a slowdown in sales and new buyer inquiries during September, according to the report.\n\n\n\nEven with a Brexit deadline officially scheduled for Oct. 31, industry professionals reported little hope for a turnaround in the near future. A majority of those surveyed said they expected prices and sales to remain flat or fall over the next three months.\n\n\n\nThe slowdown in sales and price growth has steadily spread from its previous concentration around London and Southeast England to the rest of the country. Every region in the U.K., with the exception of Northern Ireland, reported a decline in new listings in September.\n\n\n\nNorth Yorkshire estate agent T. W. Pennington, of auctioneers Northallerton Auctions Ltd., commented in the survey that political uncertainty is having a “detrimental effect on the level of new instructions in the residential market.”\n\n\n\nMeanwhile, an estate agent indicated that the political fracas has stymied the usual influx of Londoners house hunting in Kent, a popular commuter region.\n\n\n\nFrom Penta: China’s Rich List Shrinks, But the Cash Pile Grows\n\n“Unless there is a speedy resolution to the ongoing impasse, it does seem inevitable that the stand-off between purchasers and sellers will deepen, making it harder to complete transactions,” said Simon Rubinsohn, RICS chief economist.\n\n\n\nHe added that a worsening slowdown in sales would have a knock-on effect for the national economy “as the normal spend on furniture, fittings and appliances that typically accompanies a house move is also put on hold.”\n\n", "description": "", "authors": ["Beckie Strum"], "top_image": "https://images.mansionglobal.com/im-115841?size=1.5005861664712778&width=1280", "published_at": "2019-10-10"}