{"pub": "mirror", "url": "https://mirror.co.uk/news/us-news/dwarf-girl-accused-being-adult-20542103", "downloaded_at": "2019-10-09 08:29:56.569754+00:00", "title": "Dwarf girl accused of being adult 'sociopath' is a child, insists birth mum", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThe biological mum of \"abandoned dwarf\" Natalia Barnett claims she is still a child despite her adoptive parents claims she is a 30-year-old \"sociopath\".\n\nThe woman who gave her up for adoption, Anna Volodymyrivna Gava, 40, has now come forward and maintains Natalia has a rare form of dwarfism and is still just a teenager.\n\nSpeaking through a translator near her home in Mykolaiv, Ukraine, Anna said that she had been urged to give her daughter up for adoption by her mother and doctors sixteen years ago.\n\nShe told the Daily Mail : \"Doctors told me to leave the baby: 'Leave her, don’t ruin your life', they said. Both them and my mum told me to leave her.\n\nNatalia suffers form Spondyloepimetaphyseal dysplasia, a bone disorder that would prevent her from growing taller than three feet.\n\nAnna says she learned six months into her pregnancy that Natalia would be born with a \"complex pathology\".\n\n(Image: Kristine Barnett)\n\nAfter giving birth, Anna placed the newborn into an orphanage where she stayed for five years until a home was eventually found for her in the United States.\n\nShe recalled how her daughter had \"short arms and legs, with no neck\" when she was delivered.\n\n\"They said the baby would never be good, that she would never be able to move, that she would be chained to a chair or to a bed, Anna said.\n\n\"She now lives in America with adoptive parents who want to ditch her. I thought everything was okay with her and it turned out that it's not all okay.\"\n\nAnna says she now regrets putting her daughter up for adoption and begged for her to return to Ukraine when she is 18-years-old.\n\n\"Daughter, forgive me for what happened 16 years ago. Visit soon for me to see you.\n\nKristine Barnett, 45, and Michael Barnett, 43, say 3ft tall Natalia, who suffers from dwarfism, 'pretended' to be six when in fact she was 16 years older.\n\n(Image: Facebook)\n\nThe girl's adoptive mother claims Natalia threatened to stab her and her then-husband in their sleep, pushed her towards an electric fence and poured bleach in her coffee.\n\nShe also alleged Natalia was suffering a severe psychological illness 'only diagnosed in adults' and her illness led her to jump from moving cars and smearing blood over mirrors.\n\nThe now divorced couple were charged over claims they rented a flat for Natalia and then severed contact with her when they moved to Canada in 2013.\n\nAccording to court documents, Natalia was a minor child and dependent of the pair when they left her to fend for herself in Lafayette, Indiana.\n\nThey admit leaving Natalia behind but claim she was legally classed as an adult after they obtained an emergency court order in 2012, that ruled she was not eight but 22 following advice from medical experts.\n\n(Image: Tippecanoe County Jail)\n\n(Image: Tippecanoe County Jail)\n\nThe pair, from Indiana, US, have appeared in court charged with child neglect.\n\nNatalia is now living with Antwon Mans, a 36-year-old pastor, his wife Cynthia, 39, and their five children in Lafayette.", "description": "Anna Volodymyrivna Gava, from Ukraine, says her daughter Natalia Barnett - who suffers from Spondyloepimetaphyseal dysplasia - is still just a teenager", "authors": ["Neil Murphy", "Lorraine King", "Image", "Kristine Barnett", "Facebook", "Tippecanoe County Jail"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20163218.ece/ALTERNATES/s1200/3_She-tried-to-kill-us-Indiana-mother-who-adopted-6-year-old-Ukrainian-girl-with-dwarfism-has-been.jpg", "published_at": "2019-10-09"}