{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/boris-johnson-brexit-deal-latest-news-dup-proposal-arlene-foster-today-a9159286.html", "downloaded_at": "2019-10-17 08:07:36.669256+00:00", "title": "Boris Johnson's Brexit plan receives crushing blow as DUP say they cannot 'support what is being suggested'", "language": "en", "text": "Boris Johnson's Brexit plan has received a crushing blow just hours ahead of a critical EU summit, as the DUP said they \"could not support\" current proposals.\n\nIt comes as the prime minister prepares to meet with his European counterparts in Brussels with No 10 was on the brink of securing a new Brexit deal.\n\nBut in a statement released at 7am on Thursday, Mr Johnson's hopes of avoiding a Brexit extension appeared to be dashed by the DUP, who prop up the Conservatives at Westminster.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nWithin minutes of the announcement from the DUP leader Arlene Foster and her deputy, Nigel Dodds, the pound fell 0.5 per cent against the dollar and the euro.\n\n\"We have been involved in ongoing discussions with the government,\" the pair said. \"As things stand, we could not support what is being suggested on customs and consent issues, and there is a lack of clarity on VAT.\"\n\nBut they did not entirely rule out the possibility of support a future agreement, adding: \"We will continue to work with the government to try and get a sensible deal that works for Northern Ireland and protects the economic and constitutional integrity of the United Kingdom.\"\n\nShape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Boris Johnson and Brexit merchandise for sale at the Tory conference 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty 1/10 A Boris Johnson doll for sale at the Conservative Party Conference in Manchester on 29 September PA 2/10 Mugs with Boris Johnson's portrait for sale at the Conservative Party Conference in Manchester on 29 September AP 3/10 A Boris Johnson themed T-shirt for sale at the Conservative Party Conference in Manchester on 29 September AFP/Getty 4/10 Boris Johnson and other Conservative themed cards for sale at the Conservative Party Conference in Manchester on 29 September AP 5/10 Boris Johnson posters for sale at the Conservative Party Conference in Manchester on 29 September EPA 6/10 Copies of The Conservative newspaper are ready to be distributed during the Conservative Party conference on 30 September Getty 7/10 \"GET BREXIT DONE\" mugs alongside other Conservative merchandise at the party conference in Manchester on 29 September PA 8/10 Assorted Conservative merchandise for sale at the party conference in Manchester on 29 September PA 9/10 Books about Jacob Rees-Mogg and Jeremy Corbyn for sale at the Conservative Party conference in Manchester on 29 September Getty 10/10 A variety of books for sale at the Conservative Party conference in Manchester on 29 September Getty\n\nThe decision from the DUP effectively torpedoes the prime minister's hopes of passing any Brexit deal through the House of Commons on Saturday. He had been in close contact with Ms Foster and Mr Dodds in recent days, as he attempt to shore up their party's support.\n\nHousing secretary Robert Jenrick told BBC Breakfast: \"We always knew these negotiations were going to be difficult and we're going to go down to the line.\"\n\nAsked whether the prime minister would meet with the DUP today, Mr Jenrick added: \"I don't know the exact arrangements for the next few hours, but be assured the Prime Minister and his team are in intensive negotiations with all parties, including with the DUP.\n\n\"We want to provide sufficient comfort for the DUP and unionists in Northern Ireland to feel that the arrangements we would put in place with this deal are sufficient to give them comfort to support it.\"\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nAddressing MPs on Wednesday, Stephen Barclay, the Brexit secretary, conceded that Mr Johnson will write a letter asking for an Article 50 extension if no deal is in place by 19 October.\n\nThis is despite Mr Johnson repeatedly ruling out asking for a further delay under his \"do or die\" commitment to leave the EU by the current Halloween deadline.\n\nAhead of the DUP's statement, however, Steve Baker, who chairs the European Research Group of hardline Brexiteer Conservative MPs, signalled that his group could give its backing.\n\n\"We know there will be compromises, but we will be looking at this deal in minute detail, with a view to supporting it,\" he told Sky News after a Downing Street meeting. \"But until we get that text, we can't say.\"", "description": "Boris Johnson's Brexit plan has received a crushing blow just hours ahead of a critical EU summit, as the DUP said they \"could not support\" current proposals.  It comes as the prime minister prepares to meet with his European counterparts in Brussels with No 10 was on the brink of securing a new Brexit deal.", "authors": ["Ashley Cowburn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/17/07/boris-johnson.jpg", "published_at": "2019-10-17"}