{"pub": "theverge", "url": "https://theverge.com/2018/11/6/18064552/macbook-air-2018-review-retina-keyboard-apple-features-battery-price", "downloaded_at": "2019-10-05 14:33:24.409885+00:00", "title": "Apple MacBook Air (2018) review: the present of computing", "language": "en", "text": "The fan is blowing on this brand-new MacBook Air with Retina Display. It’s a familiar sound: a computer trying to cool down a processor that’s being overtaxed by one of the eight or so apps I have running. (In this case, it’s TweetDeck going rogue.) But it’s also a sound you don’t hear on more futuristic computers like the iPad, the Surface Pro, or even the Pixelbook. Still, fan or not, the computer is handling everything I’m doing just fine, and a quick restart of the app quiets it down.\n\nThat fan is a weird place to start when talking about the new $1,199 MacBook Air. I’d rather jump into all the many good things there are to talk about: the pixel density on the new display, smaller bezels, Touch ID, the T2 security chip, a larger trackpad, and a smaller design. I’ll get into all that. But I want to hang with this fan noise for another minute because its whirring encapsulates the most important thing to know about this MacBook Air.\n\nNamely: it’s a computer that will let you do whatever you want, even though some of those things are probably beyond its capabilities. It won’t say “no” when you want to open 20 tabs and eight apps and then edit a photo. (Though, sometimes, with a fan and spinning beachball, it will say “uncle.”) Most of all, it’s a computer that is familiar. It does everything you expect in a way that you’re used to.\n\nSometimes, that’s enough.\n\nWhen I started testing the new MacBook Air, I spent a lot of time thinking about what I should compare it to. For $100 more, you could get a 13-inch MacBook Pro with a more powerful processor and brighter screen that only weighs 0.27 pounds more. You could also opt for a 12-inch MacBook with a slightly less powerful processor that weighs 0.72 pounds less. You wouldn’t get Touch ID with either, but the point is that choosing between this new Air and existing MacBooks is not as easy as it ought to be.\n\nIs this new Air like a 12-inch MacBook, just blown up to a slightly bigger size? Is it more like a 13-inch MacBook Pro (sans Touch Bar), just with cheaper parts? After all, if you set the latter down next to this new Air, you can barely tell them apart.\n\nMy answer is that it’s both of those things. But the more truthful answer is that it doesn’t matter. People who have purchased one of those MacBooks already have a fairly modern, powerful computer that’s nice to use. The comparison that actually matters is to the old MacBook Air. There are a ton of people who have been hanging on to theirs because it was so good and so reliable.\n\nComparing a 2018 laptop to one that hasn’t had a significant update since 2015 is going to strike tech enthusiasts as ridiculous. Of course the new Air is going to beat out the old Air on a whole host of metrics. But that’s precisely the point: Apple waited entirely too long to release something like this new Air, so people have been waiting.\n\nUSB-C is still the future, but we’re waiting for it to be everywhere — RIP MagSafe\n\nIf you’re one of those people, you’ve got a lot to catch up on. This new MacBook Air essentially takes all of the new stuff Apple has been doing with laptops for the past three years and builds it into a single device. So let’s just get into what you’re in for.\n\nFirst: ports and charging. Say goodbye to MagSafe for power forever. The new Air has two USB-C ports that you use to plug everything in, including power. It’s the new standard for pretty much everything except iPhones. Though, as a standard, it is taking longer to, well, standardize than anybody would like.\n\nThe new charging cable doesn’t pop out when you trip on it, but that will not be the thing that impacts you the most. Instead, welcome to #donglelife. You’re going to need a few adapters to make sure everything that you currently plug into your old laptop will work on the new one. Fortunately, there are now some nice USB-C hubs that combine everything together. So the upside is you can have just a single cable at your desk for your monitor, power, USB-A, SD cards, and everything else.\n\nThere is a headphone jack, thankfully, but no SD card slot. Sorry.\n\nSecond is the screen. More than any other upgrade on the MacBook Air, this is the one you’re going to love. It’s a Retina Display, which, in this case, equates to a resolution of 2560 x 1600 pixels. It’s sharp and beautiful under a glossy pane of glass, with much smaller bezels. Those bezels are not as tiny as what you can get on some Windows laptops, but it’s still a massive improvement over the old Air.\n\nThere is one knock on the screen, though: it doesn’t get as bright as I would like. The spec on it is a max of 300 nits, but the important thing to know is you’ll be cranking up the brightness to near 100 percent more often. I haven’t had a problem viewing this screen, even in bright rooms, but I do have a vague worry that it’s affecting my battery life to have it cranked up higher.\n\nOkay, two knocks: it’s not a touchscreen. Apple’s macOS isn’t designed to work with touch at all, so it’s not here. Most other computers these days — whatever their form factor — do support touch.\n\nThird: the keyboard. It’s Apple’s newer “butterfly” design, which means that the key travel is super shallow, dust could potentially break it, and typing can be kind of loud. This third-generation version of it is designed to mitigate those last two concerns with a membrane that sits underneath the keycaps. You’ll find it’s a little weird to type on for the first day, but you’ll get used to it. Some people still really don’t like it, but I’m not one of them: I really like this keyboard, even if it is a little clacky.\n\nFourth is Touch ID and security. You can log in with just your fingerprint now, and it’s ridiculously fast and accurate. I’ve been able to just quickly tap it like any key and unlock my computer. It’s not as convenient as the face unlock you get with Windows Hello-compatible computers, but it’s close. Best of all, you get Touch ID without having to get the silly Touch Bar that’s on MacBook Pros. Instead, you just have real, regular function keys.\n\nTouch ID is powered by Apple’s T2 chip, which is a little thing that keeps the entire laptop secure. It protects your fingerprint, encrypts the SSD without taxing the processor, and even turns the microphones off when the laptop is closed. It also handles a random assortment of other tasks, like video encoding and audio processing for the speakers to give them a wider soundstage. Those speakers are louder, too.\n\nFifth: a big upgrade for the trackpad. It’s way bigger now, though not quite as big as what you’ll find on a MacBook Pro. More importantly, it has the unfortunately named “Force Touch” feature, which means you can press down anywhere on the pad to get a satisfying click. You might not think your MacBook Air’s trackpad was bad, but trust me, this is so much nicer.\n\nSixth is just overall build quality. This laptop feels a lot nicer than the old MacBook Air. It fits the same size screen in a smaller body, but it’s not as thin or as light as the thinnest and lightest of laptops you can get today. When the first Air came out, it amazed everybody. This one, though very well-built, does not stand out from the pack when it comes to size or weight.\n\nApple says it’s made of 100 percent recycled aluminum, but it feels just like any other Apple laptop. In fact, you could say it recycles a lot the design ideas from both the 12-inch MacBook and the 13-inch MacBook Pro into this Air-shaped tapered design.\n\nSeventh and last, let’s talk about specs. The story with specs gets a little complicated because the story with Intel processors is a little complicated. The processor inside the new MacBook Air is an 8th Gen, dual-core Intel Core i5, which sounds pretty good. And it is pretty good — but not all Intel processors are created equal.\n\nThe thing that neither Apple nor Intel will make easy for you to see is that this is a “Y-series” processor, which means that it’s more of a low-power chip than what you’d get on a MacBook Pro or many Windows laptops. That detail might not matter for the average MacBook Air buyer, but it’s important for people who want a thin laptop that also happens to be powerful. I am one of those people, and I instinctively look down my nose at the Y-series.\n\nMacBook Air with Retina Display specs Display: 13.3-inch Retina Display, 2560 x 1600, 300 nits max brightness\n\nSecurity: Touch ID, T2 chip\n\nProcessor: 8th Gen Intel Core dual-core i5 Y-Series, 1.6GHz\n\nStorage: 128GB, configurable to 1.5TB\n\nRAM: 8GB, configurable to 16GB\n\nBattery: 50.3Wh, claimed 12 hours of web browsing\n\nPorts: two Thunderbolt 3 USB-C, one headphone jack\n\nDimensions: 0.61 x 11.97 x 8.36 inches\n\nWeight: 2.75 pounds\n\nThe complicated part is that Apple doesn’t just take a chip off the line and slap it in. Instead, it does some customization. So this Y-series chip is powered up to 7 watts, which is a higher wattage than what other laptops usually do with the same processor. In other words, don’t judge this laptop by the label on its processor.\n\nSo let me just bottom line it: this new MacBook Air is faster than the old MacBook Air, but not by the kind of margin you’d expect after three years (or even one, if you happened to buy the 2017 model). You can do all of the same stuff you can do on your current Air. I have been running a half-dozen apps at a time along with more than a dozen tabs in Chrome, and everything is pretty okay. I think for what most people will do with this laptop, it’s fine. The base $1,199 model comes with 8GB of RAM (which is enough for most people) and 128GB of storage (which is not).\n\nIf you’re hoping you’ll be able to upgrade and get way faster video editing or process a ton of RAW photos at once, get a MacBook Pro. Those kinds of tasks will bring this Air to a chug and spin up those fans. I have found it to be more capable and powerful than the 12-inch MacBook, but, again, the difference is not as big as I’d hoped.\n\nI don’t think of any of this as a problem, though — not really. The Air can do everything I want it to in my daily workflow. I just want to be clear that my daily workflow doesn’t push the limits of this processor. My guess is that if you’re still using a MacBook Air, neither does yours.\n\nAs for battery life, I am not getting Apple’s claimed 12 hours of web browsing time. (Though, to be fair, nobody I know uses a computer only to browse the web in Safari for 12 hours straight.) I’d say I’m safely getting seven hours of fairly active use: a mix of browsing, email, Slack, Twitter, some photo editing, and some more intense testing from time to time. You could probably get more than that with a little restraint, but one of those restraints would be a screen ratcheted down to a fairly dim brightness. It’s not a battery life champion, in other words, but I can almost guarantee you it’ll last longer than the decrepit battery in your current Air.\n\nIs all of this worth $1,200? Yes. The performance and quality of this MacBook Air justify its price. Do I wish that Apple had found a way to make a slightly less expensive laptop? My answer is also yes. (I am fully aware that those two ideas conflict.) As I said, the already-existing MacBooks might better fit your needs.\n\nThe real issue here is that you can get an iPad Pro or a Windows Laptop or even a Chromebook for less money that does almost everything this thing can do — almost everything. But there’s one very important thing they can’t do: run macOS.\n\nNow that the new MacBook Air is finally here, it’s par for the laptop course\n\nAnd that’s the deal. People like the Mac. It’s great to have a computer that does all of the computer stuff you want in a way you’re familiar with. Until recently, the best computer for most people was the MacBook Air, and Apple took way too long to update it. So people have been waiting. And waiting.\n\nNow, the wait is over. But if you were hoping that lightning would strike twice and this new MacBook Air would be as revolutionary as the old MacBook Air, well, it’s not. It’s basically a MacBook that finally includes all of the stuff that has been happening with laptops for the past few years. It is on par with the rest of the laptop world, but it hasn’t moved beyond it. Sometimes that means the fan is going to spin up on you.\n\nIf you’re the kind of person who can switch to Windows, you can find something just as good and probably a little bit faster for less money. Microsoft’s Surface Laptop 2 and Surface Pro 6, for example, are really solid. But a lot of people just want a good, modern, reliable Mac. Nothing fancy, really. They just deserve something that’s up to par.\n\nAnd for those people, the ones who have been hanging on to that old MacBook Air, this is a nice upgrade. It’s par for the course — and that’s probably enough.", "description": "Apple has finally updated its iconic MacBook Air laptop with a Retina Display, a new keyboard, and new ports. Can it live up to the original Air? Dieter Bohn explains in our full review.", "authors": ["Dieter Bohn", "Nov"], "top_image": "https://cdn.vox-cdn.com/thumbor/GoCi_a6Td0iTUplJoKYH7tmL2XY=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/13390445/vpavic_181104_3068_0169.jpg", "published_at": "2018-11-06"}