{"pub": "dailymail", "url": "https://dailymail.co.uk/money/cardsloans/article-2287120/LISA-BUCKINGHAM-Exam-time-predatory-payday-gang.html", "downloaded_at": "2019-10-05 08:36:21.422581+00:00", "title": "LISA BUCKINGHAM: Exam time for the predatory payday gang", "language": "en", "text": "LISA BUCKINGHAM: Time to take a long hard look at the predatory payday loan gang\n\nPayday lender:Wonga admitted to MPs that up to 15 per cent of its customers do not repay their loans\n\n\n\n\n\nThe University of East London last week became the first such institution to outlaw payday loan firms from anywhere on its campus, amid increasing evidence that its students are taking desperate measures to get out of debt.\n\n\n\nThe ban is far reaching, including online and even stretching to refusing to stock magazines with advertisements from the payday lenders.\n\n\n\nStudents are, of course, not usually the finest examples of financial literacy.\n\n\n\nBut UEL’s deep concerns will resonate far more widely among those who deal with the increasing numbers in our society who are struggling with debt and have fallen prey to the apparent charms of a short-term fix offered by the payday gang.\n\nThe Office of Fair Trading is about to write to the 50 largest payday lenders to point out where it thinks they may be falling short of fair standards.\n\n\n\nThis is, however, likely to be far from a solution to the plague that is now gripping Britain.\n\n\n\nThe lenders argue that any ‘innovation’ tends to attract controversy in its early days. One executive involved in the sector who I met last week likened it to the early days of double- glazing sales when cowboys were rampant, concluding happily that nowadays no one would have any issues with buying double-glazing.\n\n\n\nThe sector also claims that it has a self-imposed cap on loans. Yes, the interest rates of up to 4,000 per cent are usurious, but if a borrower cannot repay after six months, interest is no longer rolled up.\n\n\n\nEven if you do not compound the interest rate, that would still mean that someone who borrowed only £100 would be staring at a £2,000 liability.\n\n\n\nAnd while the payday lenders claim to turn down about 90 per cent of loan applicants, Wonga –the best known – admitted to a select committee of MPs recently that up to 15 per cent of its customers do not repay their loans, though it claims it checks applicants.\n\n\n\nThere may be a very few people for whom an exorbitantly expensive short- term loan is an answer.\n\nThe problem is that most in this nascent industry have, conveniently, very little idea of the circumstances of people who are using their services.\n\n\n\nMany, though, are people who are already struggling with credit card debt – not itself a cheap form of borrowing.\n\n\n\nBritain has become a haven for many overseas companies who are finding that the interest rates they can charge in their home markets are capped.\n\n\n\nThe OFT appears a long way from suggesting a similar cap on loan rates, which make even the harshest of doorstep lenders look reasonable.\n\n\n\nThere is an argument for new ideas in consumer credit and our mainstream banks are hardly angels with their punitive rates for unauthorised overdrafts.\n\n\n\nIt is time for our politicians to look seriously at this predatory group of companies. The students at UEL are not the only ones who are being driven to the point of despair and need rescuing from the clutches of a morally dubious industry.\n\nAs savers abandon all hope: we could help them with an Isa break\n\n\n\nIf savers haven’t already abandoned all hope, then the words of Charlie Bean, Bank of England Deputy Governor, last week will make sure they do.\n\n\n\nThere is, he told MPs, absolutely no prospect of savers getting the chance of a decent rate of interest until the economy is in a better position.\n\n\n\nBean was too judicious, of course, to give any indication of when he expected that to be. But for savers it will be far too far away.\n\n\n\nAs we edge towards the next Election, with the reek of the Eastleigh humiliation fresh in the air, George Osborne will frantically want to do something to please in this month’s Budget.\n\n\n\nThe Chancellor has precious little room for manoeuvre and, as he made clear when Britain’s AAA rating was downgraded by Moody’s, he has no intention to splash the cash. Nor should he.\n\n\n\nOsborne can, though, give hope to millions of savers – not by increasing the amount they earn on their savings but by upping the amount of cash they can put in an Isa, where the interest is tax-free.\n\n\n\nIt is a nonsense that savers can put only half their £11,280 tax-proof allowance into a cash Isa. Although share prices have been rising recently, not all savers want to be forced to put money into the stock market.\n\n", "description": "The OFT is about to write to the 50 largest payday lenders to point out where it thinks they may be falling short, but such moves are not enough.", "authors": ["Lisa Buckingham For The Daily Mail", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/i/pix/2013/03/02/article-0-1498C13D000005DC-387_1024x615_large.jpg", "published_at": "2013-03-02"}