{"pub": "realclearpolitics", "url": "https://msn.com/en-us/news/politics/white-house-aides-feared-that-trump-had-another-ukraine-back-channel/ar-AAJfppS", "downloaded_at": "2019-10-24 15:00:23.487843+00:00", "title": "White House Aides Feared That Trump Had Another Ukraine Back Channel", "language": "en", "text": "© Doug Mills/The New York Times House investigators are scrutinizing the actions of a White House official who previously worked for Republicans on the House Intelligence Committee.\n\nWASHINGTON — When Kashyap Patel was an aide to the House Intelligence Committee in the first years of the Trump administration, he played a key role in helping Republicans try to undermine the Russia investigation, writing a memo that accused law enforcement officials of abusing their power.\n\nThe memo, which consumed Washington for weeks, was widely dismissed as a biased argument of cherry-picked facts. But it galvanized President Trump’s allies and made Mr. Patel a hero among them. After Republicans ceded control of Congress this year, he landed on Mr. Trump’s National Security Council staff.\n\nColleagues there initially questioned the role of Mr. Patel, who took few notes in meetings and had little expertise for his initial portfolio, which covered the United Nations. Within months, senior White House officials began to suspect he had won Mr. Trump’s ear and had effectively created a back channel to the president that could warp American policy, according to congressional testimony and interviews.\n\nColleagues grew alarmed after hearing that Mr. Trump had referred to Mr. Patel as one of his top Ukraine policy specialists and that the president wanted to discuss related documents with him, according to people briefed on the matter. Mr. Patel sought to discuss allegations of surveillance abuses by law enforcement officials with Mr. Trump, an administration official said. Mr. Patel, who is known as Kash, is now assigned to work on counterterrorism issues, not Ukraine.\n\nSign Up For the Morning Briefing Newsletter\n\nAny involvement by Mr. Patel in Ukraine issues would signal another attempt by Mr. Trump’s political loyalists to go around American policymakers to shape policy toward Kiev. It was separate, two of the people said, from the irregular, informal channel led by the president’s lawyer Rudolph W. Giuliani and Gordon D. Sondland, the American ambassador to the European Union, that is the subject of House Democrats’ impeachment investigation.\n\nFriends of Mr. Patel dismissed the concerns among senior national security officials as conspiracy theories by Mr. Trump’s critics. The White House declined to comment.\n\nHouse impeachment investigators are scrutinizing Mr. Patel’s actions as well, the people said. The investigators have asked witnesses about Mr. Patel and are trying to determine any role he played in the shadow foreign policy Mr. Trump was conducting as he pushed the Ukrainian government to incriminate his political rivals by announcing investigations into them.\n\nThe contents of the documents were not clear, nor was it clear how Mr. Trump got them. Typically, aides prepare policy briefings for presidents that several agencies sign off on in a highly controlled process. But Mr. Trump has adopted a much more freewheeling approach, taking in unverified information from sources both inside and outside the White House and seeking out and promoting assertions that fit his narrative.\n\nFiona Hill, the National Security Council’s former senior director for Eurasian and Russian affairs, testified to House investigators last week that she believed Mr. Patel was improperly becoming involved in Ukraine policy and was sending information to Mr. Trump, some of the people said.\n\nMs. Hill grew alarmed earlier this year when an aide from the White House executive secretary’s office told her that Mr. Trump wanted to talk to Mr. Patel and identified him as the National Security Council’s “Ukraine director,” a position held by one of Ms. Hill’s deputies. The aide said Mr. Trump wanted to meet with Mr. Patel about documents he had received on Ukraine.\n\nMs. Hill responded by asking who Mr. Patel was. While the aide from the executive secretary’s office did not state explicitly that Mr. Patel sent the Ukraine documents to Mr. Trump, Ms. Hill understood that to be the implication, according to a person familiar with her testimony.\n\nMr. Patel’s apparent communications with the president prompted Ms. Hill to raise concerns with her superiors, including John R. Bolton, then the national security adviser, that Mr. Patel was meddling outside his portfolio. As early as May, Ms. Hill had begun discussing with colleagues her concerns about whether Mr. Patel was running a shadow effort on Ukraine at the White House, according to four people briefed on the discussions.\n\nTwo other witnesses in the impeachment investigation, Mr. Sondland and George P. Kent, another State Department official, testified that they had not encountered him in their work, according to people familiar with the inquiry.\n\nMr. Patel joined the National Security Council in February and began getting involved in Ukraine matters in April, as Mr. Giuliani pushed the Ukrainian government to discredit evidence against Paul Manafort, Mr. Trump’s former campaign chairman. It was not clear who hired him.\n\nMr. Patel was previously best known as a lead author of the politically charged memo released early last year accusing the F.B.I. and Justice Department leaders of abusing their power in the early stages of the Russia investigation.\n\nMr. Patel worked at the time as an investigator for the House Intelligence Committee under Representative Devin Nunes of California, who ran the panel when Republicans had control of the chamber. Mr. Patel’s efforts to discredit the Russia investigation made him a minor celebrity in conservative circles but a divisive figure on Capitol Hill.\n\nAs an intelligence committee aide, Mr. Patel helped investigate the theory that Ukrainians were responsible for spreading information about Russia’s interference in the 2016 presidential election. Mr. Trump has returned to the accusation of Ukrainian meddling repeatedly in public and private conversations.\n\nOn the National Security Council, Mr. Patel first worked with officials in a directorate called International Organizations and Alliances that was devoted to advancing American interests at the United Nations and on human rights and other international issues.\n\nSome National Security Council aides questioned whether Mr. Patel’s experience as Mr. Nunes’s investigator was relevant to overseeing American policy toward the United Nations, a person familiar with his hiring said.\n\nUnder Mr. Bolton’s watch, Mr. Patel was later given a more senior role in the counterterrorism directorate. That fit more directly with his background as a onetime federal counterterrorism prosecutor, but some officials said Mr. Patel was promoted to a senior director position unusually quickly.\n\nMr. Patel is closely aligned on the National Security Council staff with another alumnus of Mr. Nunes’s committee, Michael Ellis, now a top White House lawyer. Mr. Ellis worked for Mr. Nunes for years as a lawyer on the House Intelligence Committee and helped champion Mr. Patel’s work on the staff, a person familiar with their roles said.\n\nMr. Ellis was involved in another bizarre episode early in the Trump administration in which he and another White House lawyer printed highly classified reports to show Mr. Nunes, who used them to accuse Obama administration officials of spying on Mr. Trump and his associates. The claims quickly unraveled, and Mr. Nunes eventually recused himself from his committee’s own Russia investigation as a result.\n\nMr. Patel’s role as an investigator for Mr. Nunes is highlighted in a book by Lee Smith, a conservative journalist, set to be published next week. The book asserts without evidence that the so-called deep state of career government bureaucrats and members of the news media embarked on a grand scheme to thwart Mr. Trump from being president.\n\nMr. Nunes hired Mr. Patel because he “knew the nature of the enemy,” Mr. Smith wrote.\n\n“I hired him to bust down doors,” Mr. Nunes said in the book.\n\nThe memo that Mr. Patel wrote as a House Intelligence Committee aide focused on the F.B.I.’s use of a dossier of explosive, unverified claims about Mr. Trump that Christopher Steele, a former British spy, compiled in 2016 for a Democratic-funded research mission. House Republicans long ago seized on the dossier as evidence that the Russia investigation was tainted, to little avail.\n\nAs part of their inquiry, House Republicans looked into whether Mr. Steele relied on sources from Ukraine for his research and whether the former American ambassador to Ukraine, Marie L. Yovanovitch, had ties to the research firm that hired Mr. Steele.\n\nMs. Yovanovitch was a casualty of Mr. Giuliani’s efforts in Ukraine as well; she was recalled from her post in the spring as Mr. Trump became convinced she had disparaged him, a charge she denies. Mr. Nunes, Mr. Patel’s former boss, has long accused her of speaking out against the president.\n\nBut Ms. Yovanovitch said that one of her bosses told her she was being ousted even though she had done “nothing wrong,” according to her testimony.\n\nMaggie Haberman and Danny Hakim contributed reporting from New York.", "description": "When Kashyap Patel was an aide to the House Intelligence Committee in the first years of the Trump administration, he played a key role in helping Republicans try to undermine the Russia investigation, writing a memo that accused law enforcement officials of abusing their power. The memo, which consumed Washington for weeks, was widely dismissed as a biased argument of cherry-picked facts. But it galvanized President Trump’s allies...", "authors": [], "top_image": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAJfQx1.img?h=169&w=300&m=6&q=60&o=f&l=f", "published_at": "2019-10-24"}