{"pub": "yahoo", "url": "https://finance.yahoo.com/news/why-shares-general-electric-today-200400374.html", "downloaded_at": "2019-09-04 23:48:13.696315+00:00", "published_at": "2019-09-04", "title": "Why Shares of General Electric Are Up Today", "language": "en", "text": "What happened\n\nShares of General Electric (NYSE: GE) were up more than 6% Wednesday after a prominent analyst returned from a breakfast with management encouraged about the progress GE is making. The jump is not enough to recover all of what was lost last month when it was the target of a short attack, but the stock has been moving in the right direction in recent weeks.\n\nSo what\n\nOnetime highflier General Electric has fallen far off the list of top growth stocks, plagued by financial weakness made worse by poor acquisitions and mismanagement. CEO Larry Culp took over in October 2018 with a plan to streamline operations and return the company to growth, but even bulls concede his ambitious plan will take years to play out.\n\nSome, including Bernie Madoff whistleblower Harry Markopolos, have suggested that the rot inside GE is much worse than the company has disclosed.\n\nA GE engine on a test platform. More\n\nGE is hoping products like its LEAP engine will help power future results. Image source: GE.\n\nAnalysts are beginning to weigh in, and have been generally supportive of GE. Earlier in the week, Deutsche Bank analyst Nicole DeBlase wrote that while GE's insurance businesses are \"messy,\" she said her team found some of Markopolos' arguments \"to be weak, while others are plainly incorrect.\"\n\nCiti analyst Andrew Kaplowitz chimed in on Wednesday, saying that he walked away from a breakfast with Culp and other managers encouraged by GE's \"positive momentum.\" While there is still considerable work to be done, Kaplowitz concluded \"meaningful progress is underway\" and GE's potential for improvements into 2020 \"could be more significant than we think some investors appreciate.\"\n\nNow what\n\nThere is understandable relief from investors in hearing that the worst-case scenario for GE is unlikely. But this is still a troubled company with a long road to recovery. Even after the Wednesday rally, shares are still down 12% from the beginning of August. And at best, Culp and his team are going to need multiple quarters to get GE up and running again.\n\nFor shareholders who were worried they should take their losses and abandon a sinking ship after the Markopolos report, the current news flow should be encouraging. But investors thinking of buying in should proceed cautiously. Even if a turnaround is in GE's future, it is going to take time.\n\nMore From The Motley Fool\n\nLou Whiteman has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.\n\nThis article was originally published on Fool.com", "description": "Analysts are pushing back at the worst-case scenarios.", "authors": ["Lou Whiteman", "The Motley Fool"], "top_image": "https://s.yimg.com/uu/api/res/1.2/QiPrXYnZkq_ixHGEh2zlmg--~B/aD01MDA7dz03MDA7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en-US/homerun/motleyfool.com/4712a7e3a0cac09af26cbfa84f466466"}