{"pub": "scmp", "url": "https://yp.scmp.com/go-to-gurus/advice/article/114029/decluttering-tips-professional-better-productivity-home-and-school", "downloaded_at": "2019-10-05 13:23:39.868078+00:00", "title": "Decluttering tips from a professional for better productivity at home and school", "language": "en", "text": "Perhaps you were FINALLY able to get your room cleaned over the summer holiday, but as soon as the new school term starts, you know you’re going to see piles of papers build up on your desk all over again. And soon your bedroom floor will look like some disastrous art project exploded on it. Sound familiar?\n\nTo help you put an end to this vicious cycle, we spoke to Orange Tam, a local tidying expert, to help you stay organised and boost your productivity.\n\nA guide to minimalism: 5 tips on tidying up and decluttering Marie Kondo would approve of\n\nA member of the National Association of Productivity and Organising Professionals, Tam worked in the financial sector for 13 years and became a full-time professional organiser in May to help Hongkongers take control of the messy chaos in their lives.\n\n“The professional organising industry is booming, especially with the rise of nano flats in the city. More people are seeking the help of professionals to become more efficient at home and at school,” says Tam.\n\nTam’s process of decluttering is not only about sorting out and tidying up spaces. She also works closely with her clients to set up a system to make sure they don’t fall back into old bad habits.\n\n“Much of the work is not about dealing with someone’s belongings, but with the person and their relationship with material things – which many people equate with happiness,” says Tam.\n\nSince Hong Kong is a city full of malls, it can be very easy to buy too much stuff and collect clutter. Photo: Shutterstock\n\n“Material things can enhance our lives and improve our overall well-being. But, if they’re bought without thinking, they can create distraction in our lives.”\n\nThis is when professional organisers like Tam come into the picture. “Hong Kong is a city with a shopping addiction. With malls everywhere, it’s so easy to buy things you don’t need. It’s not surprising that many of us succumb to compulsive buying.”\n\n5 easy ways to makeover your bedroom on a budget\n\nOne of the major culprits adding to the problem is the clothing industry. Tam says fast fashion has completely changed the way we shop for clothes, leading to excessive buying. She adds that the average teenager’s wardrobe has more than 100 items, and that less than one third of these will be worn more than four times a year.\n\nAnother item on the guilty list is books. “Some students see books as a status symbol. They simply collect books and don’t read them.”\n\nLook familiar? The rise of fast fashion - clothes produced quickly and cheaply - has encouraged us to by more clothes than we actually wear. Photo: Shutterstock\n\nTam shares her experience working with students, some of whom are starting university and have shared an apartment with their parents since they were young. She found that they tend to hold onto things from their primary and secondary school days, and eventually come to a point where their room is overflowing with unnecessary items. According to Tam, these students need help decluttering not just to sort out their living quarters, but also to start the next chapter of their life with a clean slate.\n\nShe explains, “Decluttering is a journey that allows us to rediscover the important things in our life, because time, money and space, especially in Hong Kong, are scarce. A messy living space can be mentally draining, as we are subconsciously reminded of the tasks that are left unfinished. This adds to the anxiety of starting school.”\n\nTam suggests decluttering at least once every school term, and spending some time to sort through old papers and notes. One tip is to store them in different coloured magazine holders according to subject, and to keep them somewhere you can see them so they don’t become neglected. She also advises against buying extra storage boxes as they only encourage you to fill them up with stuff.\n\nHK sustainable fashion designer Kay Wong on why minimalism should be the next big trend\n\nThese rules do not just apply at home. Tam says students can benefit from learning in a more organised space, too. She compares the classroom desk to a chef’s work station. “Two words: work clean. A restaurant kitchen is an incredibly hectic place, and being organised is an important part of cooking. Also, you’re more likely to injure yourself if your station is a mess. Similarly, in a classroom, having unnecessary items lying around creates ‘visual noise’ that affects your level of concentration,” explains Tam.\n\n“Decluttering is more than just a lifestyle. Being organised allows you to focus better at school, save time looking for misplaced items, and reduces stress, so you’ll end up feeling good about yourself,” she adds.\n\n“And what better way to begin the new school year than with a clutter-free bedroom?”\n\nEdited by Nicole Moraleda", "description": "We speak to tidying expert Orange Tam about how to organise your space and how it will help clear your mind and study more effectively.", "authors": [], "top_image": "https://yp.scmp.com/sites/default/files/styles/900x506/public/images/shopping_2.jpg", "published_at": "2019-10-05"}