{"pub": "investing.com", "url": "https://investing.com/analysis/dollar-drops-to-twoweek-low-as-safehaven-bid-ebbs-on-trade-optimism-200472547", "downloaded_at": "2019-10-11 08:19:28.829875+00:00", "title": "Dollar Drops To Two-Week Low As Safe-Haven Bid Ebbs On Trade Optimism", "language": "en", "text": "The fell to two-week lows on Thursday, with safe-haven demand for the currency waning, as investors grew optimistic about a trade deal between the United States and China.\n\n“There is growing optimism that we could get some partial agreement on trade between the U.S. and China. I think both sides are needing to have a win,” said Edward Moya, senior market analyst, at OANDA in New York.\n\n“So there is less safe-haven demand for the dollar. If we get some type of trade deal or mini-agreement or mandate, you’re going to see that being supportive of European assets. We’re seeing the euro now back above $1.10, which has been the resistance,” he added.\n\nChinese Vice Premier Liu He said on Thursday China is willing to reach an agreement with the United States on matters that both sides care about so as to prevent friction from leading to any further escalation, the state news agency Xinhua reported.\n\nLiu, China’s top trade negotiator, made his comment in Washington when he met with U.S. officials. Trade talks between the two countries started on Thursday.\n\nThe markets also largely shrugged off core U.S. inflation data that was lower than forecast.\n\nThe , a gauge of the greenback’s value against six major currencies, was on track for its biggest daily drop in five weeks.\n\nThe yen, another safe haven in times of geopolitical and financial stress, also slid to a one-week trough against the dollar, weakening as well against riskier currencies but with higher yields such as the Australian dollar.\n\nEarlier reports that the United States is weighing a currency pact with China that could also see a planned tariff hike next week being suspended fueled a rally in risky assets, and kicked of weakness in the dollar.\n\nIn mid-morning trading, the .DXY fell 0.3% to 98.83 and was on track for its biggest single-day drop since Sept. 4.\n\nThe dollar’s weakness ignited a rally in the euro with the single currency rallying to a two-week high. The euro was last at $1.1017, up 0.4%, as hedge funds cut back their extreme short bets.\n\nAgainst the safe-haven yen, however, the dollar was last up 0.4% at 107.87 yen .\n\nThe dollar was little moved after data showed U.S. consumer prices were unchanged in September and underlying inflation slipped. The report supported expectations the Federal Reserve will cut interest rates in October for the third time this year.\n\nThe U.S. consumer price index edged up 0.1% in August. Economists polled by Reuters had forecast the CPI nudging up 0.1% in September and rising 1.8% on a year-on-year basis. Excluding the volatile food and energy components, the CPI climbed 0.1% after gaining 0.3% for three straight months.\n\nMarket bets for a quarter—point U.S. rate cut swelled to 85% at its next policy meeting in October, compared to 53% a month earlier.\n\nOriginal Post", "description": "Forex Analysis by MarketPulse (Ed Moya) covering: EUR/USD, USD/JPY, US Dollar Index Futures. Read MarketPulse (Ed Moya)'s latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-11"}