{"pub": "independent", "url": "https://independent.co.uk/environment/voting-age-16-climate-breakdown-toxic-inheritance-ippr-a9108706.html", "downloaded_at": "2019-09-17 23:26:01.239491+00:00", "title": "Voting age should be lowered to 16 to avert climate breakdown, think tank says", "language": "en", "text": "The voting age should be lowered to 16 because today’s young people are the ones that face a “toxic inheritance” of environmental crises, a leading think tank has said.\n\nClimate change, the loss of wildlife and damage to the oceans and soils will be problems that the next generation will have to deal with, a report from the Institute for Public Policy Research (IPPR) has warned.\n\nWithout urgent action, future generations will not just be economically worse off than their parents, they will face huge challenges from environmental damage, the report found.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThis will be partly the result of greenhouse gas emissions caused by older generations and “decisions taken by elites in these generations, most of whom have only a small chance of being alive by 2050”, it said.\n\nAs a result, the authors call for votes at 16 – as is already the case for Holyrood and local elections in Scotland – to give a voice to those who will face the consequences of what older generations are doing to the world and give them a say on their future.\n\nShape Created with Sketch. Extinction Rebellion protesters block roads in five cities Show all 22 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Extinction Rebellion protesters block roads in five cities 1/22 Demonstrators from the Extinction Rebellion climate environmental activist group protest outside of The Royal Courts of Justice on The Strand in central London AFP/Getty Images 2/22 Extinction Rebellion demonstrators with a green boat in Cardiff PA 3/22 Environmental campaigners take part in a road blockade climate change protest organised by the group Extinction Rebellion in Leeds city centre, West Yorkshire Dan Rowlands / SWNS.com 4/22 Extinction Rebellion protesters occupy Bristol Bridge as part of a \"Summer Uprising\" in Bristol SWNS 5/22 Extinction Rebellion Scotland hold a protest on Trongate, Glasgow SWNS 6/22 Activists block roads near the Tron Clock tower in Glasgow Getty Images 7/22 Police speak with an Extinction Rebellion protester sitting on a boat they have parked outside the Royal Courts of Justice in London PA 8/22 Extinction Rebellion Activists block roads near the Tron Clock tower in Glasgow Getty Images 9/22 Activists block roads near the Tron Clock tower in Glasgow Getty Images 10/22 Protesters occupy Bristol Bridge in Bristol SWNS 11/22 Protesters from Extinction Rebellion outside the Royal Courts of Justice in London PA 12/22 Protesters from Extinction Rebellion outside the Royal Courts of Justice in London PA 13/22 Protests outside of The Royal Courts of Justice AFP/Getty Images 14/22 Police officers walk stand in front of a blue boat belonging to Extinction Rebellion protesters outside the Royal Courts of Justice EPA 15/22 Protesters from Extinction Rebellion in Leeds PA 16/22 Protesters from Extinction Rebellion in Leeds PA 17/22 Demonstrators listen to speakers as they protest outside of The Royal Courts of Justice AFP/Getty Images 18/22 Environmental campaigners take part in a road blockade climate change protest organised by the group Extinction Rebellion in Leeds city centre Dan Rowlands / SWNS.com 19/22 Environmental campaigners take part in a road blockade climate change protest organised by the group Extinction Rebellion in Leeds city centre, West Yorkshire Dan Rowlands / SWNS.com 20/22 Environmental campaigners take part in a road blockade climate change protest organised by the group Extinction Rebellion in Leeds city centre, West Yorkshire Dan Rowlands / SWNS.com 21/22 Environmental campaigners take part in a road blockade climate change protest organised by the group Extinction Rebellion in Leeds city centre Dan Rowlands / SWNS.com 22/22 Environmental campaigners take part in a road blockade climate change protest organised by the group Extinction Rebellion in Leeds city centre Dan Rowlands / SWNS.com 1/22 Demonstrators from the Extinction Rebellion climate environmental activist group protest outside of The Royal Courts of Justice on The Strand in central London AFP/Getty Images 2/22 Extinction Rebellion demonstrators with a green boat in Cardiff PA 3/22 Environmental campaigners take part in a road blockade climate change protest organised by the group Extinction Rebellion in Leeds city centre, West Yorkshire Dan Rowlands / SWNS.com 4/22 Extinction Rebellion protesters occupy Bristol Bridge as part of a \"Summer Uprising\" in Bristol SWNS 5/22 Extinction Rebellion Scotland hold a protest on Trongate, Glasgow SWNS 6/22 Activists block roads near the Tron Clock tower in Glasgow Getty Images 7/22 Police speak with an Extinction Rebellion protester sitting on a boat they have parked outside the Royal Courts of Justice in London PA 8/22 Extinction Rebellion Activists block roads near the Tron Clock tower in Glasgow Getty Images 9/22 Activists block roads near the Tron Clock tower in Glasgow Getty Images 10/22 Protesters occupy Bristol Bridge in Bristol SWNS 11/22 Protesters from Extinction Rebellion outside the Royal Courts of Justice in London PA 12/22 Protesters from Extinction Rebellion outside the Royal Courts of Justice in London PA 13/22 Protests outside of The Royal Courts of Justice AFP/Getty Images 14/22 Police officers walk stand in front of a blue boat belonging to Extinction Rebellion protesters outside the Royal Courts of Justice EPA 15/22 Protesters from Extinction Rebellion in Leeds PA 16/22 Protesters from Extinction Rebellion in Leeds PA 17/22 Demonstrators listen to speakers as they protest outside of The Royal Courts of Justice AFP/Getty Images 18/22 Environmental campaigners take part in a road blockade climate change protest organised by the group Extinction Rebellion in Leeds city centre Dan Rowlands / SWNS.com 19/22 Environmental campaigners take part in a road blockade climate change protest organised by the group Extinction Rebellion in Leeds city centre, West Yorkshire Dan Rowlands / SWNS.com 20/22 Environmental campaigners take part in a road blockade climate change protest organised by the group Extinction Rebellion in Leeds city centre, West Yorkshire Dan Rowlands / SWNS.com 21/22 Environmental campaigners take part in a road blockade climate change protest organised by the group Extinction Rebellion in Leeds city centre Dan Rowlands / SWNS.com 22/22 Environmental campaigners take part in a road blockade climate change protest organised by the group Extinction Rebellion in Leeds city centre Dan Rowlands / SWNS.com\n\nIt also calls for a “Future Generations Act” which would provide a formal legal recognition of the right of future generations to live in a world with a stable environment, and make sure policy-making takes that into account.\n\nGreater value should also be given to environmental projects which have long-term benefits for future generations in the process of making public investment decisions, it says.\n\nThe report comes ahead of global climate strikes later this week when children and students across the UK are set to walk out of lessons and lectures to call for urgent action from politicians to tackle the climate and wildlife crises.\n\nIn the UK, one of the demands of the climate strikers is to lower the voting age to 16, in recognition they have the greatest stake in the future.\n\nLuke Murphy, Head of IPPR’s Environmental Justice Commission, said: “Current and future generations face a toxic inheritance as a consequence of environmental breakdown. Political leaders and policymakers must recognise the duty they owe to the next and future generations. Crucially, they must act to protect them by giving legal recognition to their rights and by giving them a voice in our political system.”\n\nIn order to limit environmental breakdown younger generations will have to use far smaller quantities of resources over their lifetimes than older generations, the report states. They will have to build sustainable economic models and cope with issues such as food prices pushed up by extreme weather hitting production and the emotional toll of dealing with rapid change and damage to society.\n\nShadow minister for voter engagement and youth affairs, Cat Smith, said: “Our young people are a force to be reckoned with, who are taking to the street, leading the climate strikes and using their voices to influence positive change. Yet instead of being supported and valued, young people continue to have their voices ignored by this government.\n\n“At the next election, Labour will set out a bold policy agenda that will radically change young people’s lives, including tackling the climate crisis, scrapping tuition fees, and extending the vote to 16-year-olds.”\n\nBut a Cabinet Office spokesperson said: “The age of 18, not 16, is widely recognised as the age at which one becomes an adult. Full citizenship rights – from drinking, to smoking, to voting – should only be gained at adulthood. What is vital is that we educate people from a younger age about democracy and give them the confidence and enthusiasm to participate when they are 18.\n\n“The Government has developed a variety of programmes to deliver this and works in partnership with schools and civil society groups across the country.”", "description": "The voting age should be lowered to 16 because today’s young people are the ones that face a “toxic inheritance” of environmental crises, a leading think tank has said.  Climate change, the loss of wildlife and damage to the oceans and soils will be problems that the next generation will have to deal with, a report from the Institute for Public Policy Research (IPPR) has", "authors": ["Emily Beament", "Phoebe Weston"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/30/19/Extinction-Rebellion-manchester.jpg", "published_at": "2019-09-17"}