{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/3/us-coast-guard-updates-its-tattoo-policy-to-align-", "downloaded_at": "2019-10-03 23:35:47.323002+00:00", "published_at": "2019-10-03", "title": "U.S. Coast Guard updates its tattoo policy to align with 'current trends'", "language": "en", "text": "The U.S. Coast Guard announced Thursday it is changing its tattoo policy for new recruits and current service members, effective immediately.\n\n“The policy change will ensure the Coast Guard’s workforce presents a sharp and professional military appearance to the public while permitting body art that is consistent with the Coast Guard’s core values. Aligning the policy closer to current tattoo trends also allows the Coast Guard to increase the pool of otherwise-qualified potential applicants,” the service said in a statement.\n\nThe new rules say tattoos and/or brand logos may not be visible above the collar of the Coast Guard’s Operational Dress Uniform’s crew neck T-shirt.\n\nOne finger tattoo per hand is permitted however, to be situated between the first knuckle and second knuckle. One ring tattoo per hand remains authorized, but no tattoos are authorized on the thumbs.\n\nA single one-inch tattoo per hand is authorized on the hand between the wrist and the base of the finger. No tattoos are authorized on the palms though.\n\n“I am pleased to see the Coast Guard’s new tattoo policy reinforces a professional appearance to the public while adopting some of the very same tattoo standards that are now acceptable among the public,” said Master Chief Petty Officer of the Coast Guard Jason Vanderhaden. “The new tattoo policy will expand our recruiting candidate pool and provide those already serving in the Coast Guard with a few new options.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The U.S. Coast Guard announced Thursday it is changing its tattoo policy for new recruits and current service members, effective immediately.", "authors": ["The Washington Times Http", "Jennifer Harper"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2017/04/08/fairbank_tattoo_shop_66254_c0-946-2521-2415_s1770x1032.jpg?b4641105f95670737498143ee434adfa23ffcbe1"}