{"pub": "huffpost", "url": "https://huffpost.com/entry/failed-champagne-photo-alyssa-snodsmith-collin-hewett_l_5db06dd9e4b01ca2a8562693", "downloaded_at": "2019-10-23 17:14:38.181984+00:00", "title": "Couple Strikes Internet Gold With Failed Engagement Photos", "language": "en", "text": "If this couple can survive their engagement photos, they can probably get through anything.\n\nOn Saturday, Collin Hewett and Alyssa Snodsmith decided to celebrate their planned June 2020 wedding date with some engagement photos at Greene Valley Forest Preserve in Naperville, Illinois.\n\nSnodsmith, 24, was inspired by a photo she found on Pinterest of a man lovingly pouring Champagne into the mouth of his betrothed.\n\n“We just thought it was fun. It kinda just matches us,” Snodsmith told BuzzFeed. “We just like to have fun.”\n\nBut the couple’s actual engagement photos turned out to be a long way from what they envisioned, as Hewett, 23, explained on Twitter.\n\nSo me and Alyssa took our engagements pictures yesterday. She found a Pinterest picture that she wanted to try and recreate\n\n.\n\n.\n\n.\n\nI botched it pic.twitter.com/oSSUCB4o6A — Big Stack Dibbles Jr (@collinhewett17) October 20, 2019\n\nHewett takes full blame for the Champagne spillage.\n\n“I was trying so hard to pour it slowly that when it started to kind of trickle out at the end, I over-adjusted and it came pouring out all over her,” he told Time.\n\nSnodsmith told EliteDaily the spill happened 10 minutes into the picture-taking session, “so I thought my makeup and hair was going to be ruined for the rest of the photo shoot. But it wasn’t!”\n\nFortunately, she brought a second outfit!\n\nOf course, photo fails are fail-safe on Twitter. Accordingly, Hewett’s post made a big splash, being liked nearly a half-million times since he posted the pics on Sunday.\n\nThe reaction was strong enough that Snodsmith chimed in a few hours later.\n\nSnodsmith said she’s happy the couple’s bubbly moment is immortalized forever, and promised the pictures “absolutely” will be framed in their future home.\n\n“Knowing our friends and family, they will probably broadcast them at our bridal showers and our wedding,” she told EliteDaily.\n\nBut don’t expect Hewett and Snodsmith to reenact the Champagne photos when their wedding takes place next summer in Grand Rapids, Michigan.", "description": "Collin Hewett and Alyssa Snodsmith envisioned a romantic picture of him pouring Champagne into her mouth. The reality was all wet.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5db06ed7210000ae2534ad51.jpeg?cache=YcwLxYcse0&ops=1778_1000", "published_at": "2019-10-23"}