{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7569435/Singing-dancing-Haitians-flock-streets-anti-government-protest.html", "downloaded_at": "2019-10-13 23:38:17.806525+00:00", "title": "Singing and dancing, Haitians flock to streets in...", "language": "en", "text": "By Andres Martinez Casares and Andre Paultre\n\nPORT-AU-PRINCE, Oct 13 (Reuters) - Thousands of Haitians packed the streets in Port-Au-Prince on Sunday to call for President Jovenel Moise's resignation, singing and dancing in a carnival-like protest led by artists after weeks of intensifying anti-government demonstrations.\n\nOpposition leaders and their supporters in the nation of 11 million people, the poorest in the Americas, have called for Moise to step down as anger grows over fuel and food shortages, a steep currency devaluation and corruption allegations.\n\nMoise, who has denied wrongdoing, has taken few public steps to address the grievances, adding to anger at the government. He took office in 2017 and has two years left in his term.\n\nUp to about 10,000 people, including men and women wearing white in a show of solidarity, marched in the capital and its outskirts on Sunday to upbeat music blasting from trucks outfitted with powerful speakers, in a scene reminiscent of Haiti's cherished carnival celebrations.\n\n\"We have to change the system. We do not have access to housing, we have nothing to eat ... children cannot go to school,\" said Michelet, a protester who declined to give his last name. \"The cost of living is increasing and Jovenel is not doing anything serious about it.\"\n\nPort-Au-Prince Mayor Youri Chevry said he was heartened to see artists and musicians spearheading the demonstration.\n\n\"They are leading this movement today to help the people find solutions for their long-standing demands,\" he told a local radio station.\n\nUnlike previous marches in which protesters clashed with police, the day was largely peaceful.\n\nAt least 17 people have been killed and 189 injured in the recent stretch of protests, according to Haiti's National Network for the Defense of Human Rights.\n\n(Reporting by Andres Martinez Casares and Andre Paultre; Writing by Daina Beth Solomon and Peter Cooney)", "description": "By Andres Martinez Casares and Andre PaultrePORT-AU-PRINCE, Oct 13 (Reuters) - Thousands of Haitians  packed the streets in Port-Au-Prince on Sunday to call...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-13"}