{"pub": "cbc", "url": "https://cbc.ca/news/politics/parties-targeting-families-election-ballot-1.5287035", "downloaded_at": "2019-09-18 05:09:37.831417+00:00", "title": "So far, families with children are the real winners in this election campaign | CBC News", "language": "en", "text": "The parties vying for power in this election are scrambling to offer more perks to families with children as the affordability of everyday life has become a central theme of the federal campaign.\n\nThis courtship of young families is motivated, in part, by the outsized influence suburban dwellers will play in this election.\n\nThe Liberal and Conservatives parties have both targeted the Greater Toronto Area and suburban Vancouver — areas that went solidly Tory in 2011 only to move en masse to the Liberal column in 2015 — as places to pick up seats on the road to a majority government.\n\nBeyond self-interest, the parties are looking to tackle the liquidity crunch that many younger families are facing in an era when work is precarious and buying a home is a stretch.\n\nSince the Great Recession of 2008-09, Canadian households have become substantially more indebted.\n\nAccording to Statistics Canada, the national household debt-to-disposable-income ratio is now 175 per cent, fully 70 points more than our neighbours to the south. The national median mortgage debt, measured in 2016 dollars, has risen from $95,400 in 1999 to $190,000 in 2016. The numbers are substantially higher in the GTA and in B.C.\n\nWith a greater percentage of income directed at large mortgage liabilities, the parties know tax breaks and/or a benefits boost will be welcomed by younger parents and struggling families — and what is on offer from each party on this front could be a serious ballot-box motivator.\n\nConservative Leader Andrew Scheer and his wife Jill conduct a cheer with children playing soccer at a campaign event in Kelowna, B.C. (Frank Gunn/Canadian Press)\n\nThe Liberals are promising young voters an improved first-time home buyer benefit and tax-free parental leave. The Tories are promising a \"universal\" tax cut and tax credits for kids enrolled in sports and the arts. The NDP is touting more public housing and a national child-care program. The Greens want everyone to have a guaranteed livable income and access to child care.\n\nMillennials are now the largest voter bloc\n\nWhile parties have traditionally targeted older voters, given their comparatively higher voter turnout rates, the major parties are seemingly laser-focused on millennials — generally, those people born 1981 to 1996 — and Generation X — people born between 1965 and 1980 — this time.\n\nWe've heard little from the parties about new increases to retirement benefits or more support for seniors.\n\nMillennials, now the largest generation of Canadians, at 37 per cent of the total population, will form the largest voting cohort in the 2019 election. They will be crucial to any party's electoral success.\n\nBut there's also a qualitative reason as to why most of these promised perks are targeted at the younger among us and that's because the baby boomer generation has only a fraction of the debt shouldered by other age cohorts and more than double the average net worth.\n\nPaul Kershaw is a professor at the University of British Columbia, and the founder of Generation Squeeze, a non-partisan advocacy group that represents the interests of people 45 and younger.\n\nHe said for so long government spending on social supports have been disproportionately targeted at seniors.\n\nEven with the flurry of campaign promises targeted at young families, Kershaw said most of the commitments are still \"incremental.\"\n\n\"I think the parties are trying to do some catch-up — by tinkering with tax cuts and child benefits — without levelling with the intergenerational tensions that exist in public finance,\" he said in an interview.\n\nGovernment spends billions on seniors\n\nFor example, Old Age Security payments are projected to increase by $17.3 billion between 2018-19 and 2023-24 for a total of $70.6 billion in pension spending. (OAS is different than the contributory Canada Pension Plan.)\n\nHealth spending will increase by $8 billion, from $38.6 to $46.6 billion, in the same time period, half of which goes to Canadians over the age of 65, who represent less than 20 per cent of the population.\n\nThe Canada Child Benefit (CCB), by comparison, will cost the federal treasury about $23 billion this fiscal year.\n\n\"These annual increases to spending that targets seniors are much larger than the relatively small sums of money that many parties have been promising for the generations raising young kids, especially when they just tinker with tax breaks,\" Kershaw said.\n\n\"We need public policy changes that reduce costs of taking parental leave and using child-care services so that they no longer add up to additional rent-sized costs.\"\n\nTrudeau to sweeten Canada Child Benefit\n\nTo that end, the Liberal team is promising to sweeten the CCB — the government's signature achievement in the last Parliament — which provides thousands of dollars in support payments to nine out of 10 families to help them raise their children.\n\nOn Tuesday, Justin Trudeau said a re-elected Liberal government will offer more up to $1,000 more to parents with newborns through the CCB.\n\nOn employment insurance (EI) maternity and parental benefits, the Liberal party is promising to making those payments entirely tax-free at source.\n\nThey've also promised a new 15-week leave program for adoptive parents, a new benefit that will be welcomed by some in the LGTBQ community, a key Liberal voting demographic.\n\nTrudeau has also said, if elected, a Liberal government would expand the First-Time Home Buyer Incentive to include pricier properties in the GTA, Vancouver and Victoria to account for sky-high valuations in those markets.\n\nNDP leader Jagmeet Singh high-fives a child as he arrives at a campaign stop in Ottawa. (Adrian Wyld/Canadian Press)\n\nNot to be out done, Conservative Leader Andrew Scheer has been on announcement blitz in the first seven days of the campaign, rolling out a new tax cut plan that will reduce the bill owing at tax time for virtually everyone in the country.\n\nScheer promises 'universal' tax cut\n\nHe's also promised to revive Harper era tax credits that offset the cost of sports and arts programming for kids, something thousands of middle-class soccer moms and hockey dads claimed when the program was last in place.\n\nScheer, who was first to propose such a measure, long before the Liberal announcement, is also championing a plan that will offer non-refundable tax credits to new parents on EI benefits.\n\nHe's rolled these policies out during campaign stops in suburban Toronto, suburban Ottawa, suburban Vancouver and in the mid-sized city of Trois-Riveries, Que. — all of which are family-rich locales.\n\nBeyond the tax tinkering, NDP Leader Jagmeet Singh is targeting urban dwellers with a plan to build more than 500,000 new, affordable homes over 10 years to address the housing crunch that has resulted in such high debt levels. He has also promised a national daycare program.\n\nThe Green Party has promised a guaranteed income for all Canadians some time by mid-century. They've also promised to scrap the first-time home buyer tax credit and funnel more money into the existing national housing strategy to build more affordable units.", "description": "The parties vying for power in this election are scrambling to offer more perks to families with children as the affordability of everyday life has become a central theme of the federal campaign.", "authors": ["Parliamentary Bureau", "John Paul", "J.P.", "Tasker Is A Reporter In The Cbc'S Parliamentary Bureau In Ottawa. He Can Be Reached At John.Tasker Cbc.Ca.", "Follow J.P. On Twitter"], "top_image": "https://i.cbc.ca/1.5287732.1568768083!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/jagmeet-singh-justin-trudeau-andrew-scheer.jpg", "published_at": "2019-09-17"}