{"pub": "fox", "url": "https://foxnews.com/media/brad-wenstrup-adam-schiff-ukraine-call", "downloaded_at": "2019-09-26 20:55:11.235377+00:00", "title": "Rep. Wenstrup calls out Schiff for 'parody' description of Trump-Ukraine call: Media will 'run with his narrative'", "language": "en", "text": "Rep. Brad Wenstrup, R-Ohio, went after House Intelligence Committee Chairman Adam Schiff, D-Calif., for presenting a faulty narrative to the American public Thursday about what transpired on a phone call between President Trump and the president of Ukraine.\n\nWenstrup, a member of the committee, spoke on \"Outnumbered Overtime\" after the hearing with Acting Director of National Intelligence Joseph Maguire, who was called to testify about his handling of the explosive whistleblower complaint alleging Trump pressured the Ukrainian president to investigate the Biden family.\n\nSchiff was called out during the hearing for at one point reading a fictionalized version of the phone call, later defending the statements as \"parody\" intended for dramatic effect.\n\n\"He made this up to fit his narrative. We have the transcript. ... He puts it out there and most of the media will run with that, they'll run with his narrative,\" said Wenstrup, arguing Trump and Volodymyr Zelensky both ran on cleaning up corruption in their respective countries and were discussing that during the call.\n\nWHISTLEBLOWER COMPLAINT HAS BEEN DECLASSIFIED AND CONTAINS NO 'SURPRISES,' GOP LAWMAKER SAYS\n\nThe hearing began shortly after the public release of a whistleblower complaint involving Trump asking the president of Ukraine to investigate Joe Biden and his son, Hunter. The complaint alleged that Trump used the \"power of his office to solicit interference\" from a foreign country in the 2020 election -- and that White House officials subsequently tried to \"lock down\" records of that phone call.\n\nREAD THE WHISTLEBLOWER'S COMPLAINT\n\n\"In the days following the phone call, I learned from multiple U.S. officials that senior White House officials had intervened to 'lock down' all records of the phone call, especially the official word-for-word transcript of the call that was produced -- as is customary -- by the White House Situation Room,\" the complaint says.\n\nMaguire's reputation was also on trial Thursday. He has come under fire from Democrats for initially withholding a copy of the complaint from lawmakers. That standoff was technically resolved when the complaint was declassified, and released to the public, in advance of the hearing. But Maguire was still pressed for answers from Democratic committee members on why his office did not hand over the complaint at first.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nMaguire insisted he is \"not partisan\" and \"not political,\" reminding the panel that he served under eight presidents and has taken the oath of office 11 times.\n\nWenstrup said Democrats tried to \"demean\" Maguire in the hearing and \"tear down\" a person of integrity. He said he believes the whistleblower will soon be called to testify behind closed doors so Democrats can say \"whatever they want\" about his testimony.\n\nFox News' Ronn Blitzer and Brooke Singman contributed to this report.", "description": "Rep. Brad Wenstrup, R-Ohio, went after House Intelligence Committee Chairman Adam Schiff, D-Calif., for presenting a faulty narrative to the American public Thursday about what transpired on a phone call between President Trump and the president of Ukraine.", "authors": ["David Montanaro", "David Montanaro Is A Senior Editor With Fox News."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Wenstrup-Schiff.jpg", "published_at": "2019-09-26"}