{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7587705/Last-Soviet-leader-Gorbachev-urges-Russia-U-S-hold-nuclear-talks.html", "downloaded_at": "2019-10-19 11:59:24.881541+00:00", "title": "Last Soviet leader Gorbachev urges Russia, US to hold nuclear talks", "language": "en", "text": "The last Soviet leader of Russia warned today that the world is drifting into a dangerous era and pleaded with Moscow and Washington to hold urgent nuclear arms talks.\n\nMikhail Gorbachev said world leaders were slipping into using militarised politics, singling out President Donald Trump as well as his own leader, Vladamir Putin.\n\nGorbachev, whose 1980s arms control push and democracy-oriented reforms at home helped end the Cold War, made the comments two months after the demise of a landmark nuclear pact he signed with Ronald Reagan in 1987.\n\nPresident Donald Trump's administration formally pulled out of the Intermediate-Range Nuclear Forces Treaty (INF) in August, accusing Moscow of violating it, and then tested a missile with a range previously banned under the treaty.\n\nFormer Soviet president Mikhail Gorbachev called on Trump and Putin to hold urgent nuclear talks. He is pictured (above) arriving for ceremonies marking the 75th anniversary of the victory over Nazi Germany in World War Two in May\n\nRussian President Vladimir Putin denied Russia violated the INF missile treaty. He is pictured (above) speaking at a Russian cinematography university in Moscow yesterday\n\nMoscow denied flouting the accord, but President Vladimir Putin has said Russia now has no option but to produce previously banned missiles to ensure its own security.\n\nGorbachev begged Trump and Putin to climb down from their positions and hold talks about entering back into an arms truce.\n\nHe told the daily newspaper Izvestia: 'There are dangerous trends - they are all in plain sight. I would single out two. They are the disregard for international law and the militarisation of world politics.'\n\nThe last major nuclear arms control treaty between Russia and the United States, the New START treaty, is due to expire in 2021.\n\nIt limits the number of strategic nuclear warheads the world's two biggest nuclear powers can deploy.\n\nPutin has said Moscow is ready to extend the pact, but has complained about what he sees as a US refusal to engage properly on the subject.\n\nPresident Donald Trump pulled out of the INF treaty with Russia in August. He is pictured (above) speaking during a 'Keep America Great' Campaign Rally in Dallas, Texas, yesterday\n\nPresident Ronald Reagan (right) and then-Soviet leader Mikhail Gorbachev signing the Intermediate-Range Nuclear Forces treaty in the White House on December 8, 1987\n\nUS officials have said it could be scrapped when it expires and replaced with something else.\n\nGorbachev said the collapse of the INF treaty made the need for US-Russia talks all the more urgent.\n\nAlthough the 88-year-old has no direct influence in Washington and Moscow these days, his views still carry weight with some policymakers given his role in helping craft the global arms control architecture.\n\nGorbachev added: 'It turned out this treaty was the most important pillar of strategic stability. We need talks so that its destruction does not exacerbate the threat of war.'\n\nAmerica blamed Russia for violating the treaty by developing this 9M729 cruise missile (pictured), and said that tearing up the deal is necessary so it can counter the threat\n\nThe launching of a Kalibr high-precision ship-based land attack cruise missile from the Admiral Gorshkov frigate as part of the Grom-2019 military exercise yesterday\n\nThe 1987 nuclear arms treaty was credited with helping to bring an end to the Cold War, and its demise sparked fears of a new arms race as both sides blamed the other for the deal's end.\n\nThe move prompted fears of a new nuclear arms race between America and Russia, which could also drag in China.\n\nIn the aftermath of the US pullout, Trump defended the decision to rip up a pact with Russia, saying he intends for the US to always be first in nuclear weaponry.\n\nHe went on to say he had been talking with Putin and China about a new nuclear arms treaty.\n\nNATO joined America in blaming Russia for the deal's collapse, but said it had no desire to start a new arms race in Europe.", "description": "Mikhail Gorbachev, the last Soviet leader, warned that the world was drifting into a dangerous era of militarised politics and urged Moscow and Washington to have urgent nuclear arms control talks.", "authors": ["Chris Dyer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/13/19882440-0-image-a-20_1571400010252.jpg", "published_at": "2019-10-18"}