{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/18/WS5da905dba310cf3e355712af.html", "downloaded_at": "2019-10-18 01:03:32.513071+00:00", "title": "New book looks at New China from its founding until today", "language": "en", "text": "By Wei Haisheng | China Daily | Updated: 2019-10-18 08:22\n\nThe English version of the recently published book, A Concise History of the People's Republic of China (1949-2019), compiled by the Institute of Contemporary China Studies.\n\nAhead of the 70th anniversary of the founding of the People's Republic of China on Oct 1, the Chinese and English versions of A Concise History of the People's Republic of China (1949-2019), compiled by the Institute of Contemporary China Studies, were published by Contemporary China Publishing House.\n\nThe book summarizes the striving of New China in the past 70 years in simple language. The endeavors of generations of Chinese have turned China from an agricultural country with a backward economy into the world's second-largest economy. Various undertakings are moving forward and comprehensive national strength is upgrading.\n\nChina took only several decades to complete the tasks that took developed countries several centuries. Numerous great events, achievements, theoretical results and heroic models emerged. The book vividly displays the development process of New China in about 230 pages, making it easy for readers to understand the historical process in a short time.\n\nEarnest Hemingway once said that if a writer knew enough about the content of one's writing, he would omit what he understood. However, readers would want to know about the things omitted.\n\nReading this book, one will have similar feelings.\n\nReading is usually fragmented in modern times, since information availability has exploded. The book is convenient for readers to learn about national history within limited time. Its short chapters are helpful for readers to rapidly form a coherent understanding of New China. This is of significance for correctly understanding historical issues, investigating the relationship between the periods before and after the reform and opening-up, resisting historical nihilism and avoiding the tendency to see things in a one-sided way.\n\nConsidering cultural differences and the vast content of New China's history, the scale of spreading this legacy overseas has been limited. The book has simple chapters and excellent translation to engage overseas readers. Hence, it plays an important role in spreading the Chinese voice and telling Chinese stories.\n\nIt elaborates upon the \"China road\" and \"China spirit\" with objective historical facts. Over the past 70 years, the Chinese people have realized a leap forward from standing up to growing rich and then becoming strong. The rapid rise is awesome for the country and the world.\n\nOn one hand, the international community often misunderstands China. It sometimes even reaches the point of slander, causing some countries and regions to panic and become hostile to China's rise. On the other hand, people in China also have historical nihilism, and some are directed by individual cases and one-sided remarks leading to epistemic fallacy.\n\nPeople at home and abroad need to understand China more completely. The book may help them know the overall situation in the shortest time. Domestic readers will understand the hardships and the historical inevitability that China has grown from standing up to becoming rich and strong.\n\nFor foreign readers, the book showcases the pioneering experiences of the Chinese people. It reflects China's national integrity and the peaceful and inclusive characteristics of the Chinese nation. It explains to the world that the rise of China fundamentally relies on the diligence of the Chinese people other than other means.\n\nAt the same time, it explains to the world that China is still a large developing country and faces difficulties in reform and development. China cannot be separated from the world and vice versa. The building of a community with a shared future for mankind is the demand of China's development and will bring fortune to the peaceful development of the world.\n\nFor developing countries, the book shows the successful practice of scientific socialism in China. It vividly displays the processes, practices and the great achievements of socialism with Chinese characteristics.\n\nMany countries suffered from governance dilemmas after the 2008 economic crisis, which made people with breadth of vision start to drop racial and ideological prejudices to re-examine China and recognize scientific socialism.\n\nThe 70-year history of New China is not only the march toward the revitalization of the Chinese nation but also the process of exploring scientific socialism. In this regard, China is blazing a path for the happiness of all mankind.\n\nThe author is deputy director of the Chinese Communist Party History and Documentation Research Institute in Beijing.", "description": "Ahead of the 70th anniversary of the founding of the People's Republic of China on Oct 1, the Chinese and English versions of A Concise History of the People's Republic of China (1949-2019), compiled by the Institute of Contemporary China Studies, were published by Contemporary China Publishing House.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/18/5da905dba310cf3e97a1cb2a.jpeg", "published_at": "2019-10-18"}