{"pub": "fox", "url": "https://foxnews.com/media/martina-navratilova-richard-grenell-tammy-bruce", "downloaded_at": "2019-10-15 16:28:49.186636+00:00", "title": "Tennis great Martina Navratilova's attack on Amb Richard Grenell and why it matters: Tammy Bruce", "language": "en", "text": "There's an important lesson to be learned after a new Twitter fight between Tennis Hall of Famer Martina Navratilova and U.S. Ambassador to Germany Richard Grenell, said Fox Nation host Tammy Bruce.\n\nBRUCE URGES AMERICANS TO EDUCATE THEMSELVES ON: 'WHY THE LEFT IS WORTH FIGHTING AGAINST'\n\n\"It reveals what's driving today's left, what is affecting people who are liberals,\" Bruce said on her Fox Nation show, \"Get Tammy Bruce.\" \"It provides some significant insight as to ... the kind of pressure the left puts on liberals, both famous and regulars... when it comes to the pressure to conform.\"\n\nNavratilova's dispute with the ambassador was sparked by a tweet from Grenell marking his grandfather's first return visit to Normandy, France since he landed there as a soldier during World War II.\n\nOn October 13, Grenell tweeted, \"In Normandy, where a hero Grandfather tells his grandson what it was like to be a 19 yr old Ohio teenager arriving in France to fight the Nazis.\"\n\nGrenell included a picture of his grandfather and his partner Matt Lashey standing among the graves of fallen U.S. troops.\n\nNavratilova replied to that tweet, apparently attacking Grenell for his role in the Trump administration and referencing the conflict in Syria.\n\n\"You tweet this while our troops are under fire thanks to your guy trump? Have you any idea about what is going on in Syria now? #crickets,\" she tweeted.\n\nGrenell responded, writing, \"My 95 yr old grandfather visits Normandy for the first time after he landed there as a 19 yr old teenager and you ridicule his moment? Seek help immediately! You have #TrumpDerangementSyndrome #greatestgeneration.\"\n\nBruce agreed with Grenell's assessment of Navratilova's mentality. \"I think it's clear she does ... not every single thing is about President Trump for or against him,\" but Bruce also argued that there is more to this story than meets the eye.\n\n\"Here's the background about why this matters and what this tells us about Martina, but more than that about everyone else on the left and the pressure to conform,\" Bruce said.\n\nBruce said she believes that Navratilova has been trying to find her way back into the good grace of the left, ever since she wrote a controversial opinion piece, for which she later apologized, criticizing the participation of transgender athletes in women's sports.\n\nNavratilova is one of the world's most accomplished athletes, with a long list of achievements that includes winning the Wimbledon women's singles title a record nine times.\n\n\"Martina, who has been clearly a part of women's sports most of her life chimed in on what she felt was an unfairness,\" observed Bruce. \"Now you can agree or disagree with her approach. Her point was that it effectively is unfair.\"\n\nIn response to Navratilova's column, the group, Athlete Ally, which is a nonprofit whose mission is “to end rampant homophobia, transphobia in sport and to activate the athletic community to exercise their leadership to champion LGBTQ equality,” said it was removing the tennis great as its organization's ambassador and from its advisory board.\n\n\"The backlash was swift and extraordinary,\" said Bruce. \"She was punished effectively and shunned, and expelled from an advocacy group over her opinion in this regard. And this from a woman who arguably has done some of the most good work in diplomacy and advocacy for gay women, for gays in general, for minorities, for women in sports.\"\n\nBRUCE: TRUMP HATERS CONSUMED WITH RAGE, SPEW UNHINGED RHETORIC\n\n\"This is what we now refer to as the cancel culture where you are to be destroyed if you say something that is unapproved,\" Bruce continued. \"I think that this exchange with Rick is a reflection now of her effort for at least the last 10 months to try to reingratiate herself with a community that had been mercilessly punishing her.\"\n\nBruce concluded, \"It is this kind of intimidation and pressure that liberals feel... That's the overall message. 'Look what we will do to her if you do not conform'... Shame on her, but also perhaps it's time to feel sorry for her and so many others in this position.\"\n\nFor Bruce's full remarks join Fox Nation and watch \"Get Tammy Bruce\" today.\n\nCLICK HERE TO SIGN UP FOR A FOX NATION FREE TRIAL\n\nFox Nation programs are viewable on-demand and from your mobile device app, but available only for Fox Nation subscribers. Go to Fox Nation to start a free trial and watch the extensive library from Tomi Lahren, Pete Hegseth, Abby Hornacek, Laura Ingraham, Greg Gutfeld, Judge Andrew Napolitano and many more of your favorite Fox News personalities.\n\nKathleen Joyce contributor to this report", "description": "Fox Nation host Tammy Bruce said there's an important lesson to be learned after a recent Twitter fight between Tennis Hall of Famer Martina Navratilova and U.S. Ambassador to Germany Richard Grenell.", "authors": ["Matt London"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Richard-Grenell-split.jpeg", "published_at": "2019-10-15"}