{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7597429/This-banter-surely-Hugo-Lloris-shock-Ballon-dOr-nomination-slammed-Twitter.html", "downloaded_at": "2019-10-22 15:16:55.173138+00:00", "title": "'This is banter surely!' Hugo Lloris' shock Ballon d'Or nomination slammed on Twitter", "language": "en", "text": "The nomination of Hugo Lloris in the 30-man shortlist for this year's Ballon d'Or has stunned supporters... with many scathing the decision on Twitter!\n\nThe Tottenham captain did lead his side to the Champions League final last season, after miraculous wins against Manchester City and Ajax.\n\nHowever, the 32-year-old goalkeeper has had an indifferent year in between the sticks, and his shortlisting on Monday has caused quite a stir on social media.\n\nSpurs' Hugo Lloris was named on the 30-man shortlist for the Ballon d'Or award on Monday\n\nThe Ballon d'Or is the unofficial prize for the best player in the world, and is an award presented by France Football - Virgil Van Dijk, Lionel Messi and Cristiano Ronaldo are the favourites for this year's gong.\n\nLloris is currently out of action, after dislocating his elbow in the process of conceding a goal in the opening minutes at Brighton on October 5, and will not be back until the New Year.\n\nBefore that though, the Frenchman conceded seven goals as Tottenham were on the receiving end of a mauling against Bayern Munich in the Champions League.\n\nHugo Lloris screams in pain after injuring his elbow in the opening minutes against Brighton\n\nDanny Ings pounces on Lloris' misjudgement but Tottenham did go on to win the game 2-1\n\nHowever, a tough few weeks for Lloris started at home to Southampton on September 28.\n\nHe tried a Cruyff turn inside his own six-yard box, but Saints striker Danny Ings wouldn't be fooled, and tapped the ball into the empty net.\n\nThe World Cup winner produced a similar gaffe in the World Cup final last year against Croatia, when Mario Mandzukic was the beneficiary.", "description": "Lloris has had an indifferent year, and his shortlisting on Monday has caused quite a stir on social media despite leading Spurs to last season's Champions League final.", "authors": ["Kieran Jackson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/18/20000886-0-image-a-3_1571677875257.jpg", "published_at": "2019-10-21"}