{"pub": "fox", "url": "https://foxnews.com/sports/jets-jamal-adams-wins-appeal-fine", "downloaded_at": "2019-10-11 12:47:20.792514+00:00", "title": "New York Jets' Jamal Adams wins appeal of fine, plans to use money in a special way", "language": "en", "text": "New York Jets safety Jamal Adams won his appeal of a fine for a hit he leveled on Cleveland Browns quarterback Baker Mayfield in their Week 2 matchup.\n\nAdams was fined $21,056 initially for the hit and expressed his displeasure over it, calling the NFL a joke over the penalty. On Thursday, league appeals officer Derrick Brooks rescinded the fine.\n\nBALTIMORE RAVENS' LAMAR JACKSON REACHES OUT TO PHOTOGRAPHER HE RAN OVER DURING GAME\n\n“Ha ha! I told you if you just listened to me,” Adams told reporters at practice, according to ESPN. “I'm going to be completely honest, and I'm going to tell you straight up: I knew I was going to win it because it was legal.”\n\nThe third-year defensive back said he’s going to put the money to good use now.\n\nNEW ENGLAND PATRIOTS' MATTHEW SLATER CRITICIZES NFL OVER THURSDAY NIGHT GAMES\n\nWhat is Adams going to do with it?\n\nSpend it on his mother for her birthday, he said.\n\n\"Ha ha! Yep, I got that -- what was it, like 22? -- back in my pocket. Oh my god. ... I'm just happy it wasn't taken out [of my paycheck] because now I can spend that lovely money on my mother for her birthday. I'm excited about that,\" he said.\n\nIn four games this season, Adams has racked up 20 total tackles, one interception return for a touchdown and three pass defenses.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nHe will have to anchor the Jets’ secondary as they take on the Dallas Cowboys in a huge Week 6 matchup. New York will be looking for their first win of the year.", "description": "New York Jets safety Jamal Adams won his appeal of a fine for a hit he leveled on Cleveland Browns quarterback Baker Mayfield in their Week 2 matchup.", "authors": ["Ryan Gaydos", "Ryan Gaydos Is A Sports Reporter For Foxnews.Com", "Foxbusiness.Com. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/NFL-Jamal-Adams.jpg", "published_at": "2019-10-11"}