{"pub": "usatoday", "url": "https://usatoday.com/story/travel/destinations/2019/10/21/lonely-planet-best-travel-spots-2020-dc-number-2-city/4058691002", "downloaded_at": "2019-10-22 13:34:20.802852+00:00", "title": "Lonely Planet names Washington, D.C., the second-best city in the world to visit in 2020", "language": "en", "text": "USA TODAY\n\nLonely Planet has released its 15th annual list of best places to visit, which includes exotic lands such as … Washington, D.C.?\n\nIndeed, our nation's capital is No. 2 on the travel resource's ranking of top cities to visit in 2020, because, according to Lonely Planet, \"the excitement of the year's presidential election\" ties into the city's celebration of the 100th anniversary of the 19th amendment, which gave women the right to vote. Washington will have new museum exhibits, new trees and a refreshed waterfront, all for your visiting pleasure.\n\nHere are the other places the made the global list, including one other U.S. city:\n\n1. Salzburg, Austria\n\nThe alpine city's Salzburg Festival is turning 100 (Lonely Planet likes to honor centennials) with special concerts, plays and readings.\n\n2. Washington\n\nLonely Planet says the city's \"innovative floating wetlands system\" has made the District of Columbia greener than ever.\n\n3. Cairo\n\nThe Grand Egyptian Museum is set to open in 2020, adjacent to the Giza Pyramids\n\n4. Galway, Ireland\n\nThe region has been named the 2020 European Capital of Culture, which means it will host hundreds of events including music, theater and dance.\n\n5. Bonn, Germany\n\n2020 marks Beethoven's 250th birthday, which means travelers can expect plenty of concerts and installations in honor of the world-famous maestro.\n\n6. La Paz, Bolivia\n\nWith its cable cars (there will be 11 in 2020) and new culinary schools, La Paz has become more of a destination.\n\n7. Kochi, India\n\nKochi, the location of the world's first fully solar-powered airport, is showing plenty of street art at the Kochi-Muziris Biennale next year.\n\n8. Vancouver, Canada\n\nLonely Planet recommends a visit to Vancouver because the city is a leader in urban sustainability.\n\n9. Dubai, United Arab Emirates\n\nThe emirate has several new reasons to visit, including the six-month-long World Expo 2020 and the Museum of the Future.\n\n10. Denver\n\nAccording to Lonely Planet, the city has hip new hotels, food halls and a multimedia ride called \"Kaleidoscape\" at Elitch Gardens Theme and Water Park.\n\nFrom last year:Lonely Planet picks the top travel destinations for 2019", "description": "Lonely Planet has compiled its annual ranking of 10 best countries, cities, regions and best-value destinations. What made the lists?", "authors": [], "top_image": "https://www.gannett-cdn.com/presto/2019/10/22/USAT/7c8143ed-fec7-4a95-836c-e996c326afb6-XXX_5P8A1222.JPG?crop=2999,1687,x0,y0&width=2530&height=1687&format=pjpg&auto=webp", "published_at": "2019-10-21"}