{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/couples-4500-dream-holiday-tatters-20541579", "downloaded_at": "2019-10-09 02:05:31.763508+00:00", "title": "Couple's £4,500 dream holiday in tatters after China refuse entry for 'no reason'", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA couple who saved £4,500 for a dream wedding anniversary trip weren't even allowed to leave the airport\n\nKate Hayes, 67, and her husband Ray Hayes, 72, from Skelmersdale , planned the trip of a lifetime with a golden wedding anniversary cruise\n\nA couple missed out on their dream wedding anniversary cruise after being refused entry to China when they landed in Beijing.\n\nThe couple, who have four grandchildren, spent £4,500 on a trip taking in Cambodia, Vietnam, Hong Kong and Singapore, report the Liverpool Echo.\n\nBut when they landed in Beijing on October 3, after two back-to-back flights, they claim they were refused entry by border officials. They weren't even allowed to leave the airport.\n\n(Image: British Airways)\n\nMum-of-three Kate said she and Ray were treated \"like criminals\" and stuck in there for 18 hours before being forced to fly straight home and miss their dream cruise.\n\nSpeaking to the ECHO , Kate said: \"We took two back to back flights to arrive in Beijing and when we got to the desk after waiting in the queue they took our photos and looked at our passports.\n\n\"They told us to go and take a seat. A lady escorted us to the side. We were going to do three days in Beijing and then we were going to board the cruise.\n\n(Image: Liverpool Echo)\n\n\"They escorted us to the left and there were a lot of people sitting down and they told us we hadn't been given entry.\n\n\"There were fellow passengers who were saying we weren't getting into Beijing. We sat for a few hours with no advice or anything.\n\n\"We called an immigration officer over. His response was that they didn't have a reason [for refusing us entry to the country] - they don't have to give us one.\n\n\"We were sat in an airport for 18 hours. There were quite a few people from Liverpool and we said we will all stay in the airport.\n\n(Image: Getty Images)\n\n\"You're allowed to stay in the airport for 24 hours but we were told that after that we were going to be arrested.\"\n\nKate said: \"Panic set in then - everyone started trying to get flights. The panic set in. We tried to go to the next stop where the ship was going to be in Japan.\"\n\nHowever, shelling out for more flights to try and get to Japan to meet the ship at the next stop would have cost the couple hundreds of pounds - plus the cost of further transfers and accommodation.\n\nThe couple, who booked their holiday through Iglu Cruises, paid extra for excursions once they were on board the ship - like exploring the tunnels of Vietnam.\n\nThey also planned a three day holiday in China before the ship set sail, exploring the Great Wall and taking in the Forbidden City.\n\n(Image: Getty Images/RooM RF)\n\nBut despite all their planning and thousands of pounds, the couple didn't even make it outside the airport and missed their anniversary cruise.\n\nThey claim they were treated appallingly by airport staff, with Kate telling the ECHO : \"They were so bloody arrogant. They were smirking - we were treated like criminals.\n\n\"There were wives without their husbands, one guy his son was getting married in Beijing this week and they weren't letting him in.\"\n\nShe added: \"The security had us up against the wall saying don't move, passing our passports around and laughing at us. It was an awful experience.\n\n\"When you're in a strange country it's really scary. They just didn't like us.\"\n\n(Image: Getty)\n\nThey fear they will also have lost all the money spent on their trip, which was due to start in Beijing and end in Singapore on October 19 before flying back to Manchester.\n\nKate and Ray were forced to transfer their flight home from Singapore to an immediate flight back to the UK from Beijing with Ethiad Airlines.\n\nRay hit out at Iglu, who he claims have told the couple they will receive no refund for their ordeal.\n\nHe said: \"We've had no support from them. We will get no money back as far as they're concerned because it's a government decision.\"\n\nThe couple claim they were offered a £250 good will gesture by Iglu and that they were encouraged to attempt to re-enter customs to see if they would be allowed into the country.\n\nHowever, by the time they spoke to Iglu, any attempt to re-enter customs would have made them miss their return flight that was transferred over.\n\n(Image: Getty Images/AWL Images RM)\n\nThe ECHO approached Iglu for a comment but they did not respond by the time of publication.\n\nA spokesperson said: \"Iglu is aware some passengers experienced travel issues over the weekend whilst travelling in China.\n\n\"Exact details are still emerging but Iglu is working with partners and the authorities to ascertain a clear understanding of the circumstances.\n\n\"Iglu continues to liaise with the affected parties. Iglu is making arrangements for a goodwill gesture of £250pp to be provided to their customers affected by the incident.\"", "description": "In the end Kate Hayes, 67, and her husband Ray Hayes, 72, couldn't even leave Beijing Airport", "authors": ["Emilia Bona", "Image", "Liverpool Echo", "British Airways", "Getty Images", "Getty Images Room Rf", "Getty", "Getty Images Awl Images Rm"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20541608.ece/ALTERNATES/s1200/0_JS195415180.jpg", "published_at": "2019-10-09"}