{"pub": "investing.com", "url": "https://in.investing.com/news/commodities-news/nagpur-soybean-soyoil-soymeal-open-october-18-2019-2008447", "downloaded_at": "2019-10-18 08:55:31.239652+00:00", "title": "Nagpur Soybean, Soyoil, Soymeal Open- October 18, 2019", "language": "en", "text": "Nagpur Soybean, Soyoil, Soymeal Open- October 18, 2019\n\nCommodities 25 minutes ago (Oct 18, 2019 14:00)\n\n© Reuters. Nagpur Soybean, Soyoil, Soymeal Open- October 18, 2019 Nagpur Soybean, Soyoil, Soymeal Open-October 18, 2018 Nagpur, Oct 18 (Reuters) – Steady conditions persisted in major edible oils in Vidarbha region of Western Maharashtra as oil prices hovered around previous day's level on small bouts of trading. Absence of buying interest and easy condition on Madhya Pradesh oil market mainly kept prices unchanged. A majority of traders adopted wait and watch move because of weak trend in American soya digam prices, sources said Friday. ***** VIDARBHA MARKETS OILS * Soyabean, cottonseed, groundnut loose, groundnut refined, sunflower refined, linseed, rapeseed, castor and coconut KP oil ruled steady here in sluggish trading activity. * Traders expect nearly steady trend in major edible and non-edible oils here. SOYMEAL * Soymeal prices today ruled steady here on subdued demand from local traders. Good recovery in international soymeal prices also affected sentiment. SOYABEAN * Soyabean prices showed upward tendency in Nagpur Agriculture Produce Marketing Committee (APMC) on increased demand from local crushing plants. Fresh rise in Madhya Pradesh soyabean prices and reported demand from South-based plants also boosted prices. About 4,000 soyabean bags reported for auction in Nagpur APMC, according to sources. Nagpur soybean prices in rupees/tonne: -----Soybean yellow----- Soybean black Available Previous (Auction price) (Auction price) Market delivery 28,000-34,250 27,700-34,100 (Available price) Market delivery 28,100-34,350 27,800-34,200 (Traders price) Plant delivery 37,200-37,500 32,200-37,500 Soybean yellow arrivals (in 90-kg bags) and prices (in rupees per tonne) in Vidarbha, according to officials of Agriculture Produce Marketing Committee and trade sources. Deliveries Available prices Hinganghat Akola Amravati Khamgaon Wardha Umred Chandrapur Soyabean plant prices at other places in Maharashtra : Adilabad – n.a., Akola – 38,000, Washim – 37,000, Khamgaon – 37,200, Dhulia – 38,500, Hingoli – 37,800, Jalna – 36,500, Nandurbar – 37,800, Latur – 37,800, Nanded – 37,800, Solapur – 37,500, Sangli – 37,000. Sunflower arrivals (in 50-kg bag), Rapeseed (in 40 Kg bag), groundnut and Dhaniya arrivals (in 40 kg bag), linseed arrival (90 kg bag), Dhan arrival (75 kg bag), cotton (100 kg) and prices (in rupees per 100 kilogram) in Nagpur, according to APMC sources: Deliveries Available prices Previous close Sunflower 2,400-2,600 Groundnut 700-900 Linseed 4,300-4,600 Castor 2,850-3,000 Rapeseed 1,520-1,625 7,500-8,000 Dhaniya 5,400-5,800 Bajra Gavarani Corn 2,100-2,300 1,900-2,150 Cotton 4,300-4,600 NAGPUR Today's open Previous close Soyoil refined crushing plant delivery Soyoil solvent crushing plant delivery Cottonseed refined Cottonseed solvent Groundnut oil – loose (10 kg) 1,240 1,240 Groundnut oil refined (15 Litre) 1,830 1,830 Sunflower oil refined (10 kg) Linseed oil (10 kg) Rapeseed oil (for 15 kg) 1,300 1,300 Castor oil (for 15 kg) 1,730 1,730 Coconut KP oil (for 15 kg) 3,060 3,060 AMRAVATI Soyoil refined Soyoil Solvent Cottonseed refined Cottonseed solvent AKOLA Soyoil refined Soyoil Solvent Cottonseed refined oil Cottonseed solvent DHULIA Soyoil refined KHAMGAON Soyoil refined JALNA Soyoil refined NANDED Soyoil refined Soyoil refined prices at other places in Maharashtra : Latur - 756, Khamgaon – 764, Washim – 762, Solapur – 765, Sangli – 765. (Please add 5% Goods and Service Tax on Soyabean and Cotton oil prices. Soyabean and Cottonseed oil - 10 litre) Nagpur soymeal prices in rupees per tonne Today's open Previous Close Soymeal (Nagpur) 35,000-35,500 35,000-35,500 Soymeal prices at other places in Maharashtra : Akola – 36,500, Washim – 33,300, Dhulia – 35,700, Hingoli – 36,000, Jalna – 35,000, Nandurbar – 35,700, Khamgaon – 32,500, Latur – 34,200, Nanded – 34,100, Solapur – 35,100, Dharwad – 35,200, Sangli – 35,500 WEATHER (NAGPUR) Maximum temp. 32.6 degree Celsius, minimum temp. 20.7 degree Celsius Rainfall : Nil FORECAST: Partly cloudy sky with one or two spells of rains or thunder-showers. Maximum and minimum temperature likely to be around 32 degree Celsius and 21 degree Celsius respectively. Note: n.a.--not available (For oils, transport costs are excluded from plant delivery prices, but included in market prices)\n\nNagpur Soybean, Soyoil, Soymeal Open- October 18, 2019", "description": "Nagpur Soybean, Soyoil, Soymeal Open- October 18, 2019", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEDA60XS_L.jpg", "published_at": "2019-10-18"}