{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/christina-aguileras-song-for-morticia-addams-in-the-new-addams-family-totally-slaps-actually", "downloaded_at": "2019-09-30 10:46:08.428669+00:00", "title": "Christina Aguilera's Song For Morticia Addams In The New Addams Family Totally Slaps, Actually", "language": "en", "text": "Shout out to Beth Elderkin for the great gif. (Gif: United Artists)\n\nEverything about The Addams Family beyond the (admittedly great) casting has confused me. A new animated adaptation of the creepy family? OK, I get it, but the art style… seems a little off? The plot involves them, uh, going to New Jersey? And there’s been almost no marketing? Every bit of new information that trickles out about this film, I become more wary. Surely the Addams Family, inspiration to goth nerds everywhere, deserves better.\n\nI was expecting to find the same thing when I read that Christina Aguilera had made a song for Morticia Addams to go on the soundtrack of the new film. Aguilera’s pretty great, obviously, but it seemed like just another baffling detail in a baffling film. Well, readers, I’m here to tell you I was mistaken: Christina Aguilera’s Morticia Addams song, “Haunted Heart,” totally fucking rules.\n\nThis song treats Morticia Addams for what she is: a total badass. It’s got this haunted torch song feel, as Aguilera’s voice crisply carries us through a gothic love story. This is Morticia as a loud, powerful, terrifying heroine, precisely the goth icon generations of weirdos have fallen in love with. Listening to “Haunted Heart,” I’m terrified of this woman, and I also want to be her. I at least want to watch her makeup tutorials, even though they probably involve murder.\n\nI’m still sceptical of The Addams Family. But I’m hoping that we get something worthy of this badass song.\n\nThe Addams Family is in theatres December 5.", "description": "Everything about The Addams Family beyond the (admittedly great) casting has confused me. A new animated adaptation of the creepy family? OK, I get it, but the art style… seems a little off? The plot involves them, uh, going to New Jersey? And there’s been almost no marketing? Every bit of new information that...", "authors": ["David Nield", "James Whitbrook"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/mo5arpqjq0iqr3v2xzkz.jpg", "published_at": "2019-09-30"}