{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/zuma-has-a-case-to-answer-to-da-comments-on-dismissal-of-stay-of-prosecution-bid-20191011", "downloaded_at": "2019-10-11 13:04:20.825821+00:00", "title": "Zuma has a case to answer to - DA comments on dismissal of stay of prosecution bid", "language": "en", "text": "Former President Jacob Zuma is seen inside the Pietermaritzburg High Court during his hearing for an application for a permanent stay of prosecution on May 24, 2019 in Pietermaritzburg. (Gallo Images/Sowetan/Thulie Dlamini)\n\nThe DA has welcomed the decision of the KwaZulu-Natal High Court in Pietermaritzburg to dismiss former president Jacob Zuma’s application for a permanent stay of prosecution, maintaining that there is a case he has to answer to.\n\nNews24 earlier reported that a full Bench of the court, comprising judges Thoba Poyo-Dlwati, Bhekisisa Mnguni and Esther Steyn, heard arguments in the matter in May this year.\n\nThe judges handed down judgment on Friday, dismissing the stay application with costs.\n\nAS IT HAPPENED | Jacob Zuma stay of prosecution application dismissed\n\nThe ruling paves the way for the trial.\n\nZuma faces 18 charges of fraud, corruption, money laundering and racketeering, relating to the arms deal. It is alleged that he received 783 payments, totalling just over R4m from his then financial adviser Schabir Shaik and his Nkobi group of companies between 1996 and 2005.\n\nHe and his co-accused, French arms dealer Thales, are expected to be tried on October 15.\n\nDA MP Glynnis Breytenbach said the main opposition party was always at the forefront of the fight to make sure that Zuma was not allowed to escape accountability, despite his attempts to interfere with the workings of the National Prosecuting Authority (NPA).\n\n\"In 2009, after the dismissal of our initial application to overturn the decision of then National Director of Public Prosecutions (NDPP), Mokotedi Mpshe, to drop the charges against Mr Zuma, we embarked on lengthy legal processes to have the so-called ‘spy tapes’ released,\" Breytenbach said in a statement.\n\nREAD| Arms deal ruling: Seriti's conduct may now be called into question - analyst\n\n\"Mpshe's decision was based on these ‘spy tapes’ and we believed it essential for transparency and justice that these recordings be made available for scrutiny.\"\n\nThe so-called spy tapes are secretly recorded conversations of then NPA boss Bulelani Ngcuka and Scorpions boss Leonard McCarthy discussing when Zuma should be charged in the run-up to Polokwane.\n\nBreytenbach added that the DA finally forced Zuma to hand over the spy types in 2014 and in 2017, the Supreme Court of Appeal upheld a ruling declaring that Mpshe's decision to drop the charges was irrational.\n\n\"We are encouraged by the ruling of the court to believe that Zuma will eventually have to face his day in court. The arc of the moral universe is often said to be long, but ultimately bending toward justice. The DA will not rest until justice has been done.”\n\nCope also welcomed the judgment.\n\nREAD MORE| Zuma corruption case: Thales wants charges quashed\n\nCope spokesperson Dennis Bloem said: \"We, however, will not be surprised if Zuma and his legal team applied for leave to appeal the judgment resulting in many further years of delay.\"\n\n\"Cope is already used to Zuma's tricks and delaying tactics that he has always relied upon in his belief that the charges would just disappear.\"\n\nBloem added that Cope always maintained that no one was above the law and said \"Zuma must just face the music right away as the time for his trial has finally arrived\".\n\n\"The cancer of corruption will not be healed in this country if our courts allowed further delays in the money laundering and corruption charges against the former president.\"", "description": "The DA has welcomed the decision of the KwaZulu-Natal High Court in Pietermaritzburg to dismiss former president Jacob Zuma’s application for a permanent stay of prosecution, maintaining that there is a case he has to answer to.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/5995/7124f5cac6894092b8d01a9e81004935.jpg", "published_at": "2019-10-11"}