{"pub": "marketwatch", "url": "https://marketwatch.com/story/chipotles-online-sales-grow-but-so-do-expenses-2019-10-22", "downloaded_at": "2019-10-23 08:29:13.121577+00:00", "title": "Chipotle's online sales grow, but so do expenses", "language": "en", "text": "Chipotle Mexican Grill Inc. is selling more burritos as the chain pushes online sales, though handling deliveries is coming at a cost.\n\nThe company said Tuesday that online sales grew 88% during its third-quarter, now accounting for 18% of its business. But delivery expenses grew during the quarter ending in September, and administrative costs increased during the quarter compared with the previous year's period.\n\nChipotle pointed to price increases made last year as helping to boost comparable restaurant sales, but transactions also grew during the quarter. Many other restaurant chains have struggled to attract more customers in the U.S., including McDonald's Corp. The burger chain said Tuesday that guest visits were down during its most recent quarter.\n\nThe burrito chain reported adjusted earnings per share of $3.82 on $1.4 billion in income, excluding one-time events, for its third quarter. The company's earnings per share were up 77% from last year's period.\n\nAnalysts polled by FactSet projected earnings per share of $3.21, excluding one-time items, and sales of $1.38 billion. Same-store sales of 11% also beat analyst expectations of 9.3%.\n\nShares in the Newport Beach, Calif.,-based company were flat in aftermarket trading. Its stock had nearly doubled this year through Monday's close.\n\nThe chain, which had weathered health safety scares, is improving under Chief Executive Brian Niccol, a former CEO of Taco Bell who took the top slot at Chipotle last year. The chain has reported some of the swiftest digital business in the industry.\n\nChipotle will soon face tough comparisons from a year ago, when it ramped up heavy promotions of delivery deals through its DoorDash Inc. partnership. Same-store sales are expected to fall in the chain's next fiscal year, according to FactSet.\n\nThe chain is trying to keep up business through deals for members of its loyalty program and the launch last month of carne asada, a sliced steak dish that costs more than many of the chain's other items.\n\nThe company reported adjusted earnings during the quarter of $3.47, more than double last year's profits. It said new stores this year would be at the lower end of prior guidance at 144 to 155 new locations, a rate expected to increase next year.\n\nWrite to Heather Haddon at heather.haddon@wsj.com", "description": "Chipotle Mexican Grill Inc. is selling more burritos as the chain pushes online sales, though handling deliveries is coming at a cost. The company said...", "authors": ["Heather Haddon"], "top_image": "https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png", "published_at": "2019-10-22"}