{"pub": "cnbc", "url": "https://cnbc.com/2019/10/16/here-are-the-top-stock-picks-of-rising-hedge-fund-stars.html", "downloaded_at": "2019-10-16 23:12:59.763911+00:00", "title": "Here are the top stock picks of rising hedge fund stars", "language": "en", "text": "A number of Wall Street's rising hedge fund managers revealed their top stock picks on Wednesday at the annual Sohn San Francisco Investment Conference.\n\nThe conference is best known for hedge fund managers making market moving presentations as well as introducing up-and-coming hedge fund stars in the Next Wave Sohn panel.\n\nThe Sohn conference held in San Francisco is the West Coast version of the investment conferences that began in New York. The conferences, presented in partnership with CNBC, benefit education and other children's causes.\n\nHere are some of picks from the rising star fund managers.\n\nStephen Perkins, Toronado Capital Management\n\nBlackline (BL)\n\nToronado Capital Management touted software company Blackline as its top pick at the conference. Blackline, specializing in finance and accounting software for mid-size companies, is used by more than 230,000 customers in 130 countries, with a strong retention rate 97% since 2015.\n\nBlackline's product replaces Microsoft Excel with a \"digitally automated workflows,\" which is the \"leading product\" in the space, portfolio manager Stephen Perkins said. He added that more than half of the Fortune 50 companies use its software.\n\nThe company has a large market that is \"underpenetrated,\" and it's also expanding sales effort, which could boost growth in the long run, Perkins said.\n\nTouk Sinantha, AltraVue Capital\n\nSIGA Techonologies (SIGA)\n\nAltraVue Capital's top stock pick goes to pharmaceutical company SIGA Techonologies, which focused on anti-viral smallpox treatment.\n\nThe company is a \"super unconventional biotech\" because of its specialty in smallpox, portfolio manager Touk Sinantha, who sees a more than 30% upside for the stock in 12 months.\n\nSIGA has over $100 million in net cash and its research and development expense is funded by the government, Sinantha said. It already has $600 million contract signed which will expired in seven years, she added.\n\nIts international sales expansion in the G-8 companies already stockpiling vaccines will also give the stock a push, Sinantha said.\n\nRaj Venkatesan, Trinity Alps Capital Partners\n\nAfya (AFYA trades in the U.S. as American Depository Receipts)\n\nTrinity Alps Capital Partners' best idea is Afya, a Brazilian company specialized in medical education.\n\nThe demographics are \"compelling\" in Brazil for medical education as 70% of the medical schools are private, manager Raj Venkatesan said.\n\nAfya is \"a pure play\" in Brazilian medical education as 85% of its earnings deprive from medicine schools education and 15% invests in medical education software, Venkatesan said, who believes the company can grow its earnings 2.5 times in the next five years.\n\nChristopher Weldon, Stamina Capital\n\nAdyen (ADYYF)\n\nStamina Capital recommended Adyen, a payment processor headquartered in the Netherlands.\n\nAdyen has a similar transaction based model as Visa's with limited incremental cost per transaction, portfolio manager Christopher Weldon said.\n\nThe company is the lowest-cost payment processor used by many fast-growing tech companies including Uber, Netflix, Facebook, Spotify and Etsy, Weldon said.\n\nStamina believes the stock, which became public in June 2018, has the potential to double in three years, driven by a 35% increase in revenue.", "description": "A number of Wall Street's rising hedge fund managers revealed their top stock picks at the annual Sohn San Francisco Investment Conference.", "authors": ["Yun Li"], "top_image": "https://image.cnbcfm.com/api/v1/image/106185484-1571254841607sohn.jpg?v=1571257702", "published_at": "2019-10-16"}