{"pub": "wsj", "url": "https://wsj.com/articles/trump-australian-prime-minister-look-to-reinforce-an-at-times-strained-alliance-11568983183?mod=rsswn", "downloaded_at": "2019-09-20 12:55:45.936601+00:00", "title": "Trump, Australian Prime Minister Look to Reinforce an at-Times Strained Alliance", "language": "en", "text": "WASHINGTON—President Trump is hosting Australian Prime Minister Scott Morrison for a White House state visit, with the goal of reinforcing a longtime alliance that has faced some recent challenges.\n\nThis will be only the second time Mr. Trump has hosted a state visit at the White House. At the previous one, France’s President Emmanuel Macron was the guest of honor.\n\nA senior White House official who offered a preview of Friday’s event said the visit is aimed at making sure the global supply of rare-earth minerals is “stable and secure” and “not easily disrupted by shocks and outside influences”—including China, whose growing influence has bolstered the need for the U.S. to strengthen relationships in the region.\n\nSpace cooperation and plastic waste management will also be discussed, the official said. On Sunday, Messrs. Trump and Morrison are scheduled to meet in Ohio for a tour of a new Australian-owned paper-recycling mill.\n\nThe two countries have cooperated on a number of national-security challenges in recent years, from efforts to denuclearize North Korea to the war against the Islamic State group. Australia is also one of the largest importers of U.S. arms. But a number of incidents since Mr. Trump was elected have tested their bond.\n\nWeeks before Mr. Morrison’s arrival in Washington, the standard advance-planning process hit a bump in the road.\n\nMr. Morrison was determined to bring as part of his delegation Hillsong Church Pastor Brian Houston —the man he frequently refers to as his “mentor” —but the White House vetoed the idea, telling his office that Mr. Houston was not invited, according to a person familiar with the discussions.\n\nBrian Houston in 2015 was censured by the Australian government’s royal commission into child sexual abuse for failing to report his father, Frank Houston, to police for the alleged sexual abuse of children in his church. The highly publicized child abuse commission ran four years. Before his death in 2004 aged 82, Frank Houston confessed to sexually abusing a boy in New Zealand three decades earlier, and was immediately removed from ministry by his son.\n\nBrian Houston defended his behavior at the time of his censure. He didn’t respond to a request for comment for this article.\n\nAfter several rounds of discussions across the 14 time zones between Washington and Canberra, Mr. Morrison agreed to leave the pastor at home, according to several people familiar with the matter.\n\nAn Australian government spokesman didn’t respond to questions about the disagreement over Mr. Houston, but said that invitations to the state dinner are entirely at the discretion of the White House and as has been the case previously, is expected to include people from all walks of life from politics to sport to business, entertainment, science and technology and religion.\n\nThe White House didn’t respond to a request for comment.\n\nWhile the disagreement over Brian Houston’s participation was relatively brief, some recent disputes between the two countries have had a deeper impact.\n\nLast spring, Mr. Trump threatened steel and aluminum tariffs in a phone call with Mr. Morrison, according to a person briefed on the call. White House officials had discussed possible tariffs as a response to a spike in Australia’s aluminum into the U.S. market.\n\nThe threat caught Mr. Morrison by surprise, and prompted him to order minor policy changes that helped Australia keep its exemption status on global steel and aluminum tariffs imposed by the Trump administration “for now,” the official said.\n\nRecognizing that navigating Mr. Trump’s unpredictable foreign policy can be a challenge, Mr. Morrison has also developed a close bond with Vice President Mike Pence, a fellow conservative Christian, with whom he often exchanges friendly “Christian cards,” according to people familiar with the exchanges.\n\nMr. Morrison’s predecessor also had some difficult moments with Mr. Trump.\n\nDays after Mr. Trump took office, the transcript of Mr. Trump’s first conversation with Australia’s then-Prime Minister Malcolm Turnbull leaked to the media. In it, Mr. Trump lashed out at an Obama-era refugee deal under which the U.S. would take up to 1,250 refugees that Australia houses in detention camps on the Pacific island nations of Nauru and Papua New Guinea.\n\nAccording to the transcript, Mr. Trump told Mr. Turnbull that the deal was “stupid,” ″disgusting” and “horrible,” adding: “This deal will make me look terrible....I am going to get killed on this thing.”\n\nMonths later, a recording leaked of Mr. Turnbull mimicking Mr. Trump in an off-the-record speech, and joking about his poll numbers, his attacks on “fake news” media, and his alleged links to Russia.\n\nIn the recording, Mr. Turnbull is heard saying: “The Donald and I, we are winning and winning in the polls. We are winning so much, we are winning, we are winning like we have never won before. We are winning in the polls. We are, we are. Not the fake polls. Not the fake polls. They’re the ones we’re not winning in.”\n\nAustralian officials dismissed the incident at the time, noting that productive partnerships can develop out of even the rockiest of relationships.\n\nWrite to Vivian Salama at vivian.salama@wsj.com", "description": "President Trump is hosting Australian Prime Minister Scott Morrison for a White House state visit, with the goal of reinforcing a longtime alliance that has faced some recent challenges.", "authors": ["Vivian Salama", "Vivian.Salama Wsj.Com"], "top_image": "https://images.wsj.net/im-109145/social", "published_at": "2019-09-20"}