{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/16/house-antitrust-probe-sparks-replies-goole-amazon-", "downloaded_at": "2019-10-16 20:35:57.081895+00:00", "title": "House antitrust probe prompts replies from Google, Amazon, Apple, Facebook: Judiciary Committee", "language": "en", "text": "Silicon Valley titans at the center of a congressional antitrust probe have begun responding to inquiries from Capitol Hill, lawmakers leading the investigation said.\n\nGoogle’s parent company Alphabet, Amazon, Apple and Facebook have each replied to requests for information made by the House Judiciary Committee, its top Democrat and Republican said in a joint statement Tuesday.\n\n“While we do not yet have all of the information we requested, we expect that all four companies will provide the information in short order,” said Judiciary Committee Chairman Jerrold Nadler, New York Democrat, and ranking member Doug Collins, Georgia Republican.\n\n“The committee will review all of the information received from the companies in order to help inform next steps,” the lawmakers added. “We will hold additional hearings, discussions and roundtables as our investigation continues.”\n\nThe statement was cosigned by David Cicilline, Rhode Island Democrat, and Rep. Jim Sensenbrenner, Wisconsin Republican, the chair and ranking member of the panel’s subcommittee on Antitrust, Commercial and Administrative Law, respectively.\n\nEach of the tech giants was contacted last month by the House Judiciary Committee and asked to provide a range of material related to antitrust matters, including emails and other internal data.\n\n“We look forward to their continued compliance with the committee’s investigation,” said the statement.\n\nNone of the companies immediately returned messages requesting comment.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Silicon Valley titans at the center of a congressional antitrust probe have begun responding to inquiries from Capitol Hill, lawmakers leading the investigation said.", "authors": ["The Washington Times Http", "Andrew Blake"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/06/10/congress_russia_probe_42710_c0-176-4222-2638_s1200x700.jpg?86a056f8619e190ea15a8e37bbfcb2c007e9ad49", "published_at": "2019-10-16"}