{"pub": "hotair", "url": "https://hotair.com/archives/allahpundit/2019/09/08/mark-sanford-yes-im-running-president-republican-primary-trump", "downloaded_at": "2019-09-08 23:28:43.522261+00:00", "title": "Mark Sanford: Yes, I’m running for president in the Republican primary against Trump", "language": "en", "text": "What primary? I thought the primary was canceled.\n\nI’m surprised Sanford pulled the trigger. He’s been talking about running for months but always as just one option for his next step, even noting in the “ad” he cut a few months ago that he might pass on a presidential run and start an “advocacy organization” focused on federal spending instead. Sure seemed like he was teasing a primary challenge to Trump to get free media buzz for whatever his actual plans were.\n\nNope. He’s doing it.\n\nMark Sanford explains why he is running against President Trump in the Republican primary. Only on Fox News Sunday. Check your local listings. #FoxNews #FNS pic.twitter.com/KYKo12QDZK — FoxNewsSunday (@FoxNewsSunday) September 8, 2019\n\nAs of yesterday, his home state of South Carolina won’t even be holding a presidential primary in the spring. So why’s Sanford running? To do damage to Trump in the media, I assume. Now that he’s in the race, news networks will be even more eager than they were before to give him airtime. He’ll have six months to make the case against the president every day to “soft” Trump supporters. How does that shake out next fall?\n\nThe interesting thing about Sanford’s candidacy is how it complements the other insurgent campaign against Trump. Joe Walsh isn’t running on issues; his anti-Trump pitch aims squarely (and ironically) at character and fitness. Sanford’s the one running on issues, specifically the mind-boggling deficit Trump is somehow running in the midst of a booming economy. Can he win the Republican nomination reminding center-righties and the phony fiscal hawks who used to call themselves “tea partiers” that POTUS has completely upended party dogma on spending? Nah. Can he make some reluctant Trump voters a little more reluctant to reward Trump with another term, particularly with Walsh using his own media appearances to highlight the embarrassing Trump tweet/photo op du jour?\n\nMaybe, yeah. The number of Trump voters whom he and Walsh help turn against the president may be marginal but the 2016 election was won at the margins in key states. If nothing else, it may surprise some casual GOP voters who dislike Trump but don’t follow politics closely to learn that he has several primary challengers now. Sanford and Walsh are marginally mainstreaming the idea that it’s okay for Republicans to not want to reelect the president. Again, margins are important.\n\nSanford’s candidacy might complement another (potential) challenger besides Walsh. He’s buddies with Justin Amash, who’s weighing a run for the Libertarian Party’s nomination. If Sanford can galvanize, say, 10 percent of Republican voters to oppose Trump on grounds of fiscal responsibility, those Republicans would potentially be primed to switch to Amash in the general election. I wonder, in fact, if that’s not the plan here, with Sanford prepared to “pass the baton” to Amash and endorse him in the general election. A guy who’s consumed with profligate spending can’t rightly support a Democrat against Trump, after all. (Walsh, who’s focused on character above all, potentially could.) Maybe the idea is to build a small but meaningful libertarian constituency on the right that’ll endure through the primary and into the general election and frighten Trump into taking spending more seriously.\n\nImagine if that constituency ended up helping elect Bernie Sanders president by siphoning off votes from POTUS.\n\nSanford’s campaign website is already live and features two introductory videos, one called “Why I’m Running” that hammers at spending and the other called “Two Other Things” that addresses norms and humility, a more Walsh-ian critique of Trump but one which Sanford’s clearly designating as secondary in his campaign. Trump’s going to lash out at him for his bizarre episode years ago as governor in which he disappeared to go be with his mistress in Argentina but that may end up doing POTUS more harm than good. It’s a fair hit, it’s just that character attacks are destined to backfire on him by reminding people of their misgivings about Trump’s own character. (“This guy is goofing on Sanford for infidelity?”) He’s better off ignoring all of his challengers and hoping Republican voters do too. Exit question: Is this revenge for Trump wrecking Sanford’s House primary last year?", "description": "Revenge?", "authors": ["Ed Morrissey", "Jazz Shaw", "John Sexton", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/09/s.jpg", "published_at": "2019-09-08"}