{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201909/27/WS5d8e1156a310cf3e3556df8d.html", "downloaded_at": "2019-10-09 02:43:43.964082+00:00", "title": "China appreciates Japan's willingness to promote Sino-Japanese ties", "language": "en", "text": "Xinhua | Updated: 2019-09-27 21:40\n\nJapan's Prime Minister Shinzo Abe addresses the 74th session of the United Nations General Assembly at UN headquarters in New York City, New York, US, on Sept 24, 2019. [Photo/Agencies]\n\nBEIJING -- China on Friday voiced its appreciation of Japanese Prime Minister Shinzo Abe's congratulations on the 70th anniversary of the founding of the People's Republic of China (PRC) and his willingness to further develop China-Japan relations.\n\nForeign Ministry spokesperson Geng Shuang made the remarks at a press briefing in Beijing.\n\nAccording to report, the Chinese Embassy in Japan held a reception to celebrate the 70th anniversary of the founding of the PRC on Thursday. Abe sent a video to the reception to congratulate the 70th anniversary of the founding of the PRC.\n\nThis year marks the 70th anniversary of the founding of the PRC, Geng said, adding that Japanese Prime Minister Shinzo Abe sent a video to extend festival greetings to the Chinese people and reiterated his willingness to promote Sino-Japanese relations.\n\nThe Chinese side appreciates this and thinks that it reflects the positive momentum of the current improvement in Sino-Japanese relations, Geng said.\n\nGeng said that the leaders of China and Japan had a successful meeting in Osaka in June and had reached an important consensus on building Sino-Japanese relations that meets the requirements of the new era.\n\n\"We are willing to work with Japan, on the basis of abiding by the principles of the four China-Japan political documents, to step up good interactions, manage and control differences in a constructive manner and promote the healthy and steady development of China-Japan relations,\" Geng said.", "description": "China on Friday voiced its appreciation of Japanese Prime Minister Shinzo Abe's congratulations on the 70th anniversary of the founding of the People's Republic of China (PRC) and his willingness to further develop China-Japan relations.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201909/27/5d8e1156a310cf3e979e73dc.jpeg", "published_at": "2019-09-27"}