{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7586189/Red-Arrows-touch-base-delight-pilots-families-whirlwind-tour-North-America.html", "downloaded_at": "2019-10-18 01:10:45.430810+00:00", "title": "Red Arrows touch down at base to delight of pilots' families after whirlwind tour of North America", "language": "en", "text": "Advertisement\n\nThe Red Arrows marked the end of their tour of North America yesterday after touching down in RAF Scampton.\n\nPilots performed a flypast before landing at the site to meet their families after spending 11 weeks in the United States and Canada.\n\nThe Western Hawk tour marked the first time the Red Arrows have been to North America since 2008, representing the most ambitious tour of the region ever undertaken by the team.\n\nWith stops across the continent, the coast-to-coast tour comprised of a combination of nearly 20 aerobatic displays, several iconic flypasts and 100 separate ground engagement activities - ranging from business receptions to sessions aimed at inspiring young people.\n\nThe tour was touted as an indication of the UK's continuing commitment to enduring relationships, mutual prosperity and extensive security cooperation in the region.\n\nThe Red Arrows mark the last day of their Western Hawk tour with their arrival into RAF Scampton (pictured: Pilots on October 17)\n\nThe Royal Air Force Aerobatic Team, The Red Arrows fly over Niagara Falls, Canada, during their tour of North America\n\nSaluting the Statue of Liberty, the city of New York and the United States of America - the Red Arrows stage a flypast over the Hudson River in August\n\nThe iconic Red Arrows marked the end of their tour of North America yesterday (pictured: Red Arrows over New York)\n\nImages show the jets performing a flypast, then landing with the pilots being greeted by their family members\n\nThe Royal Air Force Aerobatic Team, The Red Arrows flypast the Golden Gate Bridge, San Francisco trailing the Red, White and blue smoke over the bridge\n\nPilots performed a flypast before landing at the site to meet their families after spending 11 weeks in the United States and Canada\n\nThe Western Hawk tour marked the first time the Red Arrows have been to North America since 2008, representing the most ambitious tour of the region ever undertaken by the team (pictured: RAF Scampton, October 17)\n\nWith stops across the continent, the coast-to-coast tour comprised of a combination of nearly 20 aerobatic displays\n\nSpeaking at the Royal International Air Tattoo (RIAT), Gloucestershire, Minister for the Armed Forces, Mark Lancaster, said: 'The United Kingdom shares a deep and enduring defence relationship with both Canada and the US.'\n\nIt is 11 years since the Red Arrows last visited the continent and the massive tour included 108 people, made up of pilots, engineers and support staff.\n\nThe Red Arrows will now continue training at their base at RAF Scampton in Lincolnshire and the new team of pilots for next year's shows and flypasts will shortly be announced.\n\nThe 2020 programme will be the team's 56th season and it is anticipated that millions of people will see the Red Arrows carry out a trademark combination of precision flying and dynamic loops, rolls and close-passes.\n\nThe Red Arrows performed a flypast for the Nationals Baseball game against the Houston Astros in Washington DC on August 27, 2019\n\nPictured: Red Arrows flypast the Golden Gate Bridge, San Francisco trailing the Red, White and blue smoke over the bridge\n\nThe tour was touted as an indication of the UK's continuing commitment to enduring relationships, mutual prosperity and extensive security cooperation in the region (pictured: The Red Arrows flypast over Niagara Falls)\n\nOn October 17 2019 the Red Arrows marked the last day of their Western Hawk tour with their arrival into RAF Scampton\n\nSpeaking at the Royal International Air Tattoo (RIAT), Gloucestershire, Minister for the Armed Forces, Mark Lancaster, said: 'The United Kingdom shares a deep and enduring defence relationship with both Canada and the US' (pictured: One of the jets at RAF Scampton)\n\nIt is 11 years since the Red Arrows last visited the continent and the massive tour included 108 people, made up of pilots, engineers and support staff (pictured: The Red Arrows flypast over Niagara Falls)\n\nThe Red Arrows will now continue training at their base at RAF Scampton in Lincolnshire and the new team of pilots for next year's shows and flypasts will shortly be announced\n\nThe 2020 programme will be the team's 56th season and it is anticipated that millions of people will see the Red Arrows carry out a trademark combination of precision flying and dynamic loops, rolls and close-passes\n\nPictured: Children rushing to greet a pilot as he emerges from his Red Arrows jet at RAF Scampton on October 17\n\nTwo weeks ago during the tour the Red Arrows painted the skies red, white and blue over the Golden Gate Bridge in San Francisco on the biggest-ever North American tour.\n\nStunning images show the Hawk T1 jets ripping over San Francisco Bay in California, issuing great streams of smoke in the colours of the Union Jack.\n\nThe Ministry of Defence say the 11 week deployment is 'to promote the best of British and deepen partnerships with close friends and allies.'\n\nThe MoD added: 'The tour provides chance to celebrate and enhance international trade and investment between the UK, Canada and the US, worth more than £208 billion in 2018 ...\n\n'Each of the pilots has previous fast-jet, operational experience flying the Tornado, Typhoon or Harrier, enabling the RAF to secure the skies and protect the nation and its interests, 365-days a year.'\n\nWestern Hawk 19 was comprised of 12 Hawk aircraft and one Atlas A400M transport jet.\n\nThe Royal Air Force aerobatic team, the Red Arrows flypast the Golden Gate Bridge, San Francisco trailing the Red, White and blue smoke over the iconic bridge as part of their biggest-ever North American tour\n\nRed, white and blue smoke is painted over the San Francisco Bay by nine of the Red Arrows' Hawk T1 jets as they wrap up their tour across the US and Canada\n\nNine of the Red Arrows fly in a triangle formation over the San Francisco Bay on Tuesday. The Ministry of Defence say the 11 week deployment is 'to promote the best of British and deepen partnerships with close friends and allies'\n\nThe famous Red Arrow of the RAF flypast the famous Golden Gate Bridge in California in early October. The flight over the Golden Gate Bridge was one of a number of 'iconic flypasts' billed by the RAF, as well as 20 acrobatic shows as part of their tour\n\nHazy red, white and blue smoke drifts in the wind over the San Francisco Bay as the RAF Hawk jets rip over the water. In addition to flying, the servicemen have been giving dozens of talks on the ground at business receptions and to young people aimed at promoting science, technology and engineering\n\nOne flank of the RAF's formation issues white smoke as part of their display, San Francisco is seen in the background as jets roar across the bay\n\nThe MoD say: 'The tour provides chance to celebrate and enhance international trade and investment between the UK, Canada and the US, worth more than £208 billion in 2018' (pictured: the jets going past the famous bridge on Tuesday)\n\nMore than 100 personnel have toured across the continent with 12 Hawk aircraft and an Atlas A400M transport jet. The Red Arrows are based at RAF Scampton in Lincolnshire\n\nThe RAF's aerobatic team have made their way west across the continent, leaving their base in Lincolnshire they went north to Scotland, and then across to Iceland and Greenland, before reaching Canada on the first stop of their deployment", "description": "Pilots performed a flypast before landing at RAF Scampton yesterday to meet their families after spending 11 weeks in the United States and Canada.", "authors": ["Henry Martin For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/00/19861034-0-image-a-83_1571355017252.jpg", "published_at": "2019-10-18"}