{"pub": "washingtontimes", "title": "BOOK REVIEW: 'The Smallest Minority'", "url": "https://washingtontimes.com/news/2019/aug/14/book-review-smallest-minority", "language": "en", "published_at": "2019-08-14", "downloaded_at": "2019-09-02 07:11:32.543964+00:00", "text": "ANALYSIS/OPINION:\n\nKevin D. Williamson, longtime columnist and roving correspondent for National Review before and after a much-publicized brief interlude at The Atlantic, has worked as deputy managing editor and theater critic for the New Criterion, done a tour for the Mumbai-based Indian Express Group, where he learned to beware of monkeys and the gifts they throw, and reported and written for the Lubbock Avalanche-Journal. He also directed journalism and communications programs at George Mason University, and worked as an adjunct professor at the King’s College.\n\nIn all, an impressive resume for any professional journalist, to say nothing of a journalist who, despite the occasional obscenities and vulgarisms purposely dropped like monkey gifts into the great wash of rhetoric and page-long paragraphs, still produces elegant prose — a prose that is demonstrably, in the new age of social media, increasingly less and less in demand.\n\nA typical sampling, from a chapter titled “The Pond Moves the Scum, Not the Other Way Round”: “Let’s talk about democracy … I come not to praise democracy but to bury it. And I don’t mean just the vulgar majoritarianism of the Barack Obama ‘I won’ variety … No, I mean the basic fundamental thing: the idea that public institutions approach perfection the more closely they approximate the fickle and ignorant demands of the demos, and approach glory in greater degree the more ruthlessly they subject the members of a society to the Rousseauean ‘general will,’ that great fiction that has proved itself such a convenient enabler of savagery, that anybody should give the furry crack of a rat’s patootie what blockheads think just because the blockheads exist and walk around on real estate adjacent to our own.”\n\nThis was the writer, the libertarian that Jeffrey Goldberg, editor of the The Atlantic, the venerable middle-brow magazine in search of its soul, thought would give him ideological balance. And when the offer of a full-time writing job came from one of the last top-line magazines left in the country, Mr. Williamson took it. But Mr. Goldberg soon found he’d made an error — the job offer was a mistake, and what Mr. Williamson calls the “mob,” including such publications as The New York Times and The Washington Post, were digging for disqualifying items.\n\nThey claimed to have found one in a Twitterism in which Mr. Williamson suggested that those states still practicing capital punishment consider applying it to cases of abortion, perhaps in the form of hanging. It was clearly meant to be satirical, albeit somewhat tastelessly so, and in other places he had expressed opposition to capital punishment.\n\nBut no matter. He was fired before he started, ostensibly the result of a piece of attempted satire. Mr. Williamson did at one point attempt to defend himself to Mr. Goldberg by pointing to outrageous statements by regular Atlantic contributors, among them “the late Christopher Hitchens who … had in the very pages of The Atlantic written a very persuasive justification for political violence up to and including murder.”\n\nMr. Goldberg’s response: “‘Hitchens was in the family. You are not.’”\n\n“And that, of course,” writes Mr. Williamson, “is what all this is really all about.” (In a footnote, he says of Mr. Hitchens: “the one time I ever encountered the famous atheist was, oddly enough, in church, at ten in the morning. He was drunk.”)\n\nAll in all, given the increasing loss of literate commentary and the increasing pressure to conform brought by social media, Mr. Williamson is fortunate to be back at National Review, no doubt in large part thanks to the good offices of Rich Lowry, Bill Buckley’s successor, who had warned him to expect trouble.\n\nJay Nordlinger, one of National Review’s most astute senior editors, put it this way on the eve of Mr. Williamson’s departure for The Atlantic, “My friend Kevin has the mind and spirit of a writer. He has gifts of sympathy and ratiocination and broadness. He has an awareness of history and a knowledge of literature. He keeps abreast of the times and also has a sense of the timeless. He likes fun, even mischief. Then there’s style. (WFB prized style almost to a fault) … He belonged at Bill Buckley’s magazine … In a way, he’ll be an NR writer wherever he goes.”\n\nMany of us who once worked for Bill Buckley at National Review know the feeling.\n\n• John R. Coyne Jr., a former White House speechwriter, is co-author of “Strictly Right: William F. Buckley Jr. and the American Conservative Movement” (Wiley).\n\n• • •\n\nTHE SMALLEST MINORITY: INDEPENDENT THINKING IN THE AGE OF POLITICS\n\nBy Kevin D. Williamson\n\nRegnery Gateway, $28.99, 242 pages\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Kevin D. Williamson, longtime columnist and roving correspondent for National Review before and after a much-publicized brief interlude at The Atlantic, has worked as deputy managing editor and theater critic for the New Criterion, done a tour for the Mumbai-based Indian Express Group, where he learned to beware of monkeys and the gifts they throw, and reported and written for the Lubbock Avalanche-Journal.", "authors": ["The Washington Times Http", "John R. Coyne Jr."], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/08/14/SAXoPicture-07E41344-438071848_c0-0-878-511_s1770x1032.jpg?6d32a95e7b1635f0101061f3b85a16213b477a26"}