{"pub": "huffpost", "url": "https://huffpost.com/entry/taco-bell-recalls-two-million-pounds-of-beef-metal-shavings_n_5da5f2afe4b0f6f0ce081ed3", "downloaded_at": "2019-10-15 23:04:39.754055+00:00", "title": "Taco Bell Recalls 2.3 Million Pounds Of Beef After Finding Metal Fragments", "language": "en", "text": "Taco Bell recalled about 2.3 million pounds of seasoned beef after a customer discovered metal shavings in their food, the fast food chain said in a statement Tuesday.\n\nThe voluntary action involved restaurants in 21 states in the Southeast, Northeast and Midwest. Taco Bell said all of its affected locations confirmed by Monday that they had thrown out the meat, which the U.S. Department of Agriculture said “may be contaminated with extraneous materials, specifically metal shavings.”\n\n“As soon as we received the first consumer complaint, we immediately acted to remove the product from the affected restaurants and proactively worked with the supplier to inform the USDA of our steps to protect our guests,” Julie Masino, Taco Bell’s North America president, said in the statement.\n\nTaco Bell’s meat came from Kenosha Beef International, a Columbus, Ohio, packing plant that distributed the product in cases containing eight five-pound plastic bags marked for use in tacos and burritos, the USDA said. The company shipped the meat to distribution centers in Michigan, New Jersey, New York, Ohio and Virginia, which then sent it to Taco Bell locations.\n\nKenosha told the USDA on Saturday that it had received three customer complaints.\n\n“There have been no confirmed reports of adverse reactions due to consumption of these products,” the USDA said.\n\nNeither Taco Bell nor the USDA speculated on how metal shavings got into food.\n\nThe recall follows Taco Bell’s July tortilla shortage, which, although short-lived, spurred complaints on social media from irked customers.", "description": "The fast food chain said it realized there was an issue with its seasoned beef when a customer reported finding a metal shaving in food.", "authors": ["Trends Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5da5f3222100001a0e3471ea.jpeg?cache=8ypecde82j&ops=1778_1000", "published_at": "2019-10-15"}