{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7627267/Fourth-grader-charged-making-terroristic-threats-compiling-kill-list-classmates.html", "downloaded_at": "2019-10-30 00:11:41.359449+00:00", "title": "Fourth grader charged with making terroristic threats after compiling a 'kill list' of classmates", "language": "en", "text": "An elementary school student in Georgia will be charged with making terroristic threats after authorities say the pupil made a 'kill list' of their classmates.\n\nThe student - a fourth grader at Montgomery Elementary School in Dekalb County - has not been identified and their exact age has not been shared.\n\nBecause of the nature of the crime, the child will be charged with making terrostic threats on a process summons.\n\nScroll down for video\n\nThe student - a fourth grader at Montgomery Elementary School in Dekalb County - has not been identified and their exact age has not been shared\n\nThe student won't be arrested and will instead be processed in juvenile intake, WSB-TV reports.\n\nThe list was discovered after the DeKalb County School District conducted a thorough investigation.\n\nMontgomery counselors and social workers were made available to provide support to those in need.\n\nThe list was discovered after the DeKalb County School District conducted a thorough investigation at the school\n\nThe student's mother was unaware of the incident until she was notified by local reporters.\n\n'I'm terrified, and to know that I haven't been alerted in my email yet from the school or the district really upsets me,' said the student's mother, Lauren Taylor.\n\nOfficials shared that there did not appear to be any immediate danger for students at the school.", "description": "The student - a fourth grader at Montgomery Elementary School in Dekalb County - has not been identified and their exact age has not been shared.", "authors": ["Matthew Wright For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/18/20341514-0-image-a-19_1572375285206.jpg", "published_at": "2019-10-29"}