{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/coinbase-gets-e-money-license-in-ireland-expanding-european-foothold", "downloaded_at": "2019-10-12 02:07:01.629388+00:00", "title": "Coinbase Gets E-Money License In Ireland, Expanding European Foothold", "language": "en", "text": "Coinbase is expanding its European foothold with an e-money license from the Central Bank of Ireland.\n\n“One of just a few companies”\n\nOn Oct. 11, Zeeshan Feroz, the CEO of the United Kingdom arm of San Francisco-based cryptocurrency exchange Coinbase, announced that the exchange had become “one of just a few companies,” to have received an e-money license in Ireland.\n\nCoinbase opened its first office in Dublin, Ireland, in October 2018 to help expand its operations in Europe and as a contingency plan for when the U.K. leaves the EU. The Coinbase U.K. CEO said:\n\n“Europe represents a huge opportunity for Coinbase and today’s announcement is another positive step for us in the region. The approval from the Central Bank of Ireland will now enable us to expand our Irish operation and deliver a better product to customers across some of our fastest-growing markets. It will also allow us to secure passporting for our customers across the EU and EEA.”\n\nMartin Shanahan, CEO of IDA Ireland reportedly congratulated Coinbase on receiving the e-money license from the Central Bank. IDA Ireland is the Irish state agency responsible for attracting foreign investment to the country. Shanahan said:\n\n“Coinbase’s choice of Dublin for this operation reinforces the strength of Ireland as a destination for financial services companies, providing a consistent, certain, pro-enterprise policy environment for businesses to grow and thrive.”\n\nCoinbase among the cleanest crypto exchanges\n\nCointelegraph recently reported that according to a report by the Canada-based Blockchain Transparency Institute (BTI), Coinbase is one of the cleanest cryptocurrency exchanges in the industry.", "description": "Cryptocurrency exchange Coinbase is expanding its European foothold with its newly received e-money license from the Central Bank of Ireland", "authors": ["Joeri Cant"], "top_image": "https://images.cointelegraph.com/images/740_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9lOTdiYWUzMjM3OWY2M2QzMzZiMTM4Mjk3ZDIwNDM1YS5qcGc=.jpg", "published_at": "2019-10-12"}