{"pub": "dailymail", "url": "https://dailymail.co.uk/debate/article-7564523/PETER-OBORNE-Not-Disraeli-PM-cunning-U-turn.html", "downloaded_at": "2019-10-12 00:14:05.432513+00:00", "title": "PETER OBORNE: Not since Disraeli has a PM made such a cunning U-turn", "language": "en", "text": "With trademark bravado, Boris Johnson has repeatedly said he’s willing to take Britain out of the EU without a deal. But I have always suspected that has been partly bluster.\n\nConfronted now with no wriggle room to deliver a No Deal Brexit, he has accepted that a deal must be struck with Brussels.\n\nThere is one principal reason for this: fear of the consequences of No Deal and a dawning realisation that it could result in electoral defeat for the Tories.\n\nDespite his bravura promises, Johnson hasn’t managed to negotiate a penny discount. To his credit, though, Johnson looks set to have achieved — and this is very important — a different way of solving the sticky Irish border problem\n\nShortly after becoming PM, he was taken aside by officials who spelt out in stark terms what a No Deal Brexit really meant.\n\nChaos. Delays. Possible civil disorder. Medical shortages.\n\nAnd over the longer term, the risk of permanent damage to the British economy.\n\nMichael Gove, in charge of Brexit preparations, described them with insouciant understatement as ‘bumps in the road’.\n\nMore cynical observers would point out that Johnson has said that one of his idols is the Victorian era Tory, Benjamin Disraeli, who was known for compromising again and again as he climbed what he called the ‘greasy pole’ of politics\n\nNo prime minister would want to be held responsible for such a mess. Least of all Boris Johnson. He wants to remain in No 10 for as long as possible.\n\nSome inside Downing Street, in particular the PM’s senior adviser Dominic Cummings, pressed for the No Deal option to be kept on the table.\n\nHowever, after seven defeats in the Commons and a Supreme Court defeat, that possibility died on Wednesday when Johnson met former minister Damian Green, leader of the One Nation group of 80 Tory MPs.\n\nGreen said they could never support a Conservative election manifesto that campaigned on a platform of a No Deal Brexit, in effect aligning the Tories with the Brexit Party.\n\nThe warning was that Johnson risked splitting the Tory Party in half if he continued to entertain the idea of No Deal.\n\nThe game was up.\n\nSuch was the immediate background to Boris Johnson’s meeting on Merseyside with the Irish Taoiseach.\n\nWhat Johnson has now done is revert to the so-called Ireland-only backstop proposals. We will see as negotiations proceed this weekend whether agreement on this can be achieved with Brussels. The Irish Taoiseach is pictured above\n\nCummings went with him. But in a sign that this Rasputin figure had been compromised, he wore a suit rather than his customary unironed shirt, jeans and fleece.\n\nWhat’s more, he was with Cabinet Secretary Sir Mark Sedwill, meaning that if notoriously indiscreet Cummings leaked any information, it would be clear where it came from.\n\nOff-the-cuff Trump-style text messages have been replaced by correct confidentiality.\n\nJohnson and Irish PM Leo Varadkar talked business.\n\nSedwill, now properly in the driving seat, got down to work at last on the reality and enormity of the October 31 Brexit deadline.\n\nFor Johnson, a deal with Varadkar is now the only way to honour his promise to take Britain out of the EU on Halloween. This meant he was ready to make concessions.\n\nAs a result, the deal he now proposes is based on the one agreed by Theresa May a year ago and fashioned by her EU negotiator Sir Olly Robbins.\n\nTheir work has not been wasted. Quite the opposite.\n\nFor Johnson, a deal with Varadkar is now the only way to honour his promise to take Britain out of the EU on Halloween. This meant he was ready to make concessions. The pair are pictured at a meeting on Thursday\n\nUnder the provisional agreement that has been reached, Johnson is expected to sign off on most of May’s central document, the Withdrawal Arrangement. About 150,000 words — or 599 pages.\n\nYes. We are talking about the document supported consistently by this newspaper earlier this year but knocked back by die-hard anti-EU Tory MPs and by a mindless Labour Party.\n\nIronically, it was initially opposed, too, by Boris Johnson with his Tory Right-wing allies.\n\nThe agreement, among other things, commits Britain to recognise the rights of EU citizens here and for the UK government to pay a divorce bill of just under £40 billion.\n\nDespite his bravura promises, Johnson hasn’t managed to negotiate a penny discount.\n\nTo his credit, though, Johnson looks set to have achieved — and this is very important — a different way of solving the sticky Irish border problem.\n\nHow to avoid creating a hard border between the North and the Republic of Ireland once Britain leaves the EU, meaning two different customs regimes either side of the border.\n\nAlso, obviating the need for customs posts, which would be in contradiction to the Good Friday Agreement, and which would inevitably become targets for the men of violence.\n\nWith trademark bravado, Boris Johnson has repeatedly said he’s willing to take Britain out of the EU without a deal. But I have always suspected that has been partly bluster. He is pictured with Ireland's Taoiseach Leo Varadkar\n\nMrs May’s solution was the ‘backstop’, which, in order to secure the support of the Democratic Unionist Party (DUP) in the North, meant Britain would remain part of the EU Customs Union and Single Market until a post-Brexit free trade deal could be negotiated.\n\nBut critics branded this Brino — Brexit In Name Only.\n\nWhat Johnson has now done is revert to the so-called Ireland-only backstop proposals.\n\nWe will see as negotiations proceed this weekend whether agreement on this can be achieved with Brussels.\n\nNonetheless, there is no avoiding the fact that it means a separate status for the Northern Ireland economy. Crucially, it would also be subject to democratic confirmation by the Northern Ireland Assembly.\n\nHowever, what is already crystal clear is that Johnson calculates that he can carry such a deal through the Commons in the face of potential opposition from the DUP and some remaining Tory rebels. He may need support from pro-Brexit Labour dissident MPs — which he may well get.\n\nAll this suggests that the last months have been wasted in a pointless saga of faction-fighting.\n\nSurely, this is something that will not be lost on Boris Johnson.\n\nHe will realise that the deal being negotiated this weekend is very similar to the arrangement Theresa May settled on 18 months ago. At the time, one senior Tory criticised her deal as ‘crazy’ because he said it would mean the UK collecting taxes on behalf of the EU.\n\nThe name of that critic? It was Boris Johnson. In other words, he now seems set to accept a Brexit which he was reluctant to countenance earlier in the year.\n\nThat’s the Boris I know in a nutshell. He’ll do anything to be popular and keep himself in power. Above all, he’s a pragmatist. A generous supporter would say he’s doing this as a One Nation Tory.\n\nMore cynical observers would point out that Johnson has said that one of his idols is the Victorian era Tory, Benjamin Disraeli, who was known for compromising again and again as he climbed what he called the ‘greasy pole’ of politics.\n\nThe most notorious example of Disraeli’s perfidy involved the Tory split over the Corn Laws in the 1840s. Tory prime minister Robert Peel resolved to end protection for British farmers to make food cheaper for ordinary people.\n\nIn other words, he now seems set to accept a Brexit which he was reluctant to countenance earlier in the year. That’s the Boris I know in a nutshell. He’ll do anything to be popular and keep himself in power\n\nDisraeli led the Tory rebellion against the measure on behalf of landowners, destroyed Peel’s career, became Tory leader himself, then abandoned his opposition to the Corn Laws.\n\nCynicism and opportunism on an epic scale. For his part, Johnson is banking on the belief that since his Brexit credentials are beyond dispute, he can be trusted when he makes concessions.\n\nBut will his plan work? We may not know the full details for some time.\n\nWill the DUP cry foul? They’ve issued a holding statement which, significantly, does not damn Johnson’s deal.\n\nWhat about hardline No Dealers on the Tory backbenches? Will they feel betrayed? Encouragingly, for Johnson, they’ve made helpful noises.\n\nHowever, even if a deal gets done with Brussels, the European Parliament must still vote on it.\n\nAnd then, next Saturday, on what will be a huge day for British democracy, MPs will vote on the deal — a very, very long 1,212 days after the British people voted to leave the EU.\n\nThere are still a host of obstacles ahead. But given Brexit fatigue at the Palace of Westminster — and MPs’ awareness of greater fatigue across the whole country — Boris Johnson’s agreement is now an odds-on favourite.", "description": "PETER OBORNE: Johnson is banking on the belief that since his Brexit credentials are beyond dispute, he can be trusted when he makes concessions. But will his plan work?", "authors": ["Peter Oborne For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/22/19608624-0-image-a-18_1570828747168.jpg", "published_at": "2019-10-11"}