{"pub": "bbc", "url": "https://bbc.com/news/business-49723246", "downloaded_at": "2019-09-17 00:58:01.369497+00:00", "title": "WeWork 'may delay stock market listing'", "language": "en", "text": "Image copyright WeWork\n\nThe hotly-anticipated stock market listing of WeWork's parent company could be delayed until at least October, according to reports.\n\nWe Company's planned flotation has been dogged by worries that investors are going cold on the office sharing firm, which once had a valuation of $47bn.\n\nSeveral reports in the US, including in the Wall Street Journal, said a delay was now being considered.\n\nWe Company was due to start marketing the business to investors this week.\n\nThe potential delay comes after Reuters reported last week that We Company might seek a valuation in its IPO of between $10bn and $12bn, a dramatic discount to the mooted $47bn price tag suggested in January.\n\nIn the past few months, We Company has faced concerns over its corporate governance standards, as well as the sustainability of its business model, which relies on a mix of long-term liabilities and short-term revenue.\n\nSome analysts have questioned how such a business model would weather an economic downturn.\n\nEarlier this month, founder Adam Neumann returned $5.9m worth of stock to the firm, which he had controversially received in exchange for his trademark of \"We\".\n\nConcerns about slowing global growth could also contribute to a difficult ride in the public markets, as seen in other high-profile offerings this year, such as Uber.\n\nSince WeWork's start in New York in 2010, it has expanded to more than 500 locations in 111 cities across 29 countries.\n\nHowever, that rapid expansion has been expensive. WeWork lost about $1.6bn last year, despite revenue nearly doubling.", "description": "The US company's flotation had been one of the most hotly-anticipated financial events of the year.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/88EA/production/_104205053_wework_index_1.jpg", "published_at": "2019-09-16"}