{"pub": "fox", "url": "https://foxnews.com/world/hong-kong-murder-suspect-protests-carrie-lam", "downloaded_at": "2019-10-20 00:13:10.122017+00:00", "title": "Hong Kong murder suspect who sparked protests ready to turn himself in, Carrie Lam says", "language": "en", "text": "The murder suspect whose case sparked Hong Kong’s ongoing protest movement now wants to surrender to authorities, Hong Kong’s leader said Saturday.\n\nHong Kong Chief Executive Carrie Lam told reporters her government would “actively follow up” on a letter she received from Chan Tong-Kai looking to turn himself in.\n\nChan is wanted by Taiwan authorities for allegedly killing his pregnant girlfriend during a trip to the island in February of last year. After returning to Hong Kong, he was not sent back to Taiwan to face charges because Hong Kong does not have an extradition agreement. This prompted Beijing-friendly Lam to propose an extradition bill, which would allow prisoners to also be sent back to mainland China to face prosecution.\n\nWhat followed were months of violent protests ravaging the financial hub. Lam eventually withdrew the controversial bill in September, yet protests pressed on by angry residents who believe mainland China is encroaching upon Hong Kong’s Western-style democratic freedoms.\n\nTaiwan itself said in May that it would not agree to Chan’s transfer if the extradition bill would put Taiwanese citizens at risk of being sent to the mainland.\n\nChan was, however, jailed in Hong Kong on money laundering charges and is due to be released on Wednesday.\n\nHONG KONG PROTESTERS PARODY XI JINPING, LEBRON JAMES TO PROTEST GOVERNMENT BAN ON MASKS\n\nReverend Canon Peter Koon Ho-ming, a top Anglican priest who has been visiting Chan weekly in jail, said the 20-year-old Hong Kong student hoped his surrender would ease the chaos in his home city, according to the South China Morning Post.\n\n“I have been visiting him for more than half a year now. At first he was worried about turning himself in, but after talking to lawyers from Taiwan and with his family, he made the decision last month,” said the Anglican church official. “I told him that he’s still young. How many more years can he hide from this? Even if he’s jailed for more than 10 years, he can still have a new start, rather than living in guilt.”\n\nINDIA POLICE SAY 'CUNNING SERIAL KILLER' ARRESTED IN DEATHS OF 6 FAMILY MEMBERS\n\nTaiwan’s Ministry of Justice urged Hong Kong on Thursday to keep Chan in prison and investigate him for the killing. Lam and other Hong Kong officials have ruled that prospect out.\n\nA source close to the government told the South China Morning Post it was “ridiculous” for Taipei to urge Hong Kong to detain Chan beyond his jail sentence.\n\nCLICK HERE FOR THE FOX NEWS APP\n\n“It would be unlawful for the Hong Kong government to continue to detain Chan after he walks free,” the source said. “It was Taipei authorities which issued an order for Chan’s arrest but now they don’t want him.”\n\nThe Associated Press contributed to this report.", "description": "The murder suspect whose case sparked Hong Kong’s protest movement now wants to surrender to authorities, Hong Kong’s leader said Saturday.", "authors": ["Morgan Phillips"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/16/694940094001_6095247059001_6095253792001-vs.jpg", "published_at": "2019-10-19"}