{"pub": "independent", "title": "Do companies still test toiletries and household cleaners on animals and how can you tell?", "url": "https://independent.co.uk/infact/animal-testing-cruelty-free-cosmetics-toiletries-household-products-a8877221.html", "language": "en", "published_at": "2019-04-23", "downloaded_at": "2019-09-02 07:31:39.142946+00:00", "text": "It may be the smell you like or that the colour of the bottle matches your decor.\n\nBut when you choose a soap, cleaner or laundry powder you probably don’t give much thought to whether the label hides a secret.\n\nWorldwide, an estimated 500,000 animals are still suffering for cleaning products – including some in Britain.\n\nBut public information on animal testing for household cleaning products and toiletries is scant or confusing.\n\nShoppers could be forgiven for thinking that products labelled “cruelty-free” are just that, or that animal tests were outlawed long ago.\n\nBut things aren’t that simple.\n\n1 What animal tests are still carried out?\n\nRabbits, guinea pigs, mice, rats and even fish are used in experiments that include having chemicals dripped into their eyes, forced down their throats or rubbed onto their skin, while others are made to inhale toxic substances. Reactions may include vomiting, tremors, organ failure, blindness, swollen and painful eyes, skin soreness, paralysis and even death.\n\nManufacturers may claim on the labels that items were “not tested on animals” - referring to just the final product - but the ingredients could still have been tested.\n\nSome toiletries and household items feature a rabbit logo - but not all slogans and logos are created equally.\n\nThe washing-up liquids, laundry powders, oven cleaners, lavatory bleaches, wipes, sprays, perfumes, shampoos and liquid soaps that we all use every day could still involve animal testing.\n\n2 What’s the situation on household products?\n\nThere is a big difference in the laws on household products and personal toiletries (known as “cosmetics” - a heading that includes shaving products and shampoos).\n\nIn November 2015 a UK ban on the testing of household products on animals took effect after a coalition government pledge, but after the policy was watered down, the ban applies only to finished products.\n\nThere is a “qualified” ban on the testing of ingredients for household products, in line with European chemical testing rules, allowing chemical ingredients for pesticides to still be legally tested on animals in the UK.\n\nHome Office figures revealed that the number of animals used for household product testing actually rose in the first year of the ban, to nearly 700.\n\nThe following year, 2017, there were 450 animal experiments for household product ingredients in the UK, the figures showed.\n\nSome brands became hugely popular because they stood for being against animal testing. But some shoppers were shocked last year when two of their favourites, Ecover and Method, were taken over by SC Johnson - whose brands include Duck, Glade, Pledge and Mr Muscle - which openly admits using animals.\n\nHowever, both say they are still cruelty-free. Method says it ensures its suppliers do not test on animals, and Ecover says it is certified by Cruelty Free International.\n\nShoppers may also be wary of claims such as “this product is not tested on animals”, which can hide the fact that its ingredients may be tested on animals, and “this company does not test on animals”, which may simply mean the company contracts out its testing of products and ingredients to other firms.\n\nThere is no EU-wide ban on testing household products or ingredients.\n\n3 What’s the situation on toiletries?\n\nAnimal-welfare groups including the RSPCA and Animal Defenders International say there are already more than enough cosmetics products available and thousands of existing cosmetics ingredients are accepted as safe.\n\nBrands such as Lush and Neals Yard have long been famous for their cruelty-free stances.\n\nIn 2013 the European Union banned the sale and importation of cosmetics products newly tested on animals - or that contain any ingredients that have been tested.\n\nSome exceptions are allowed, though - ingredients may still be tested on animals under certain circumstances, \"by the back door\", as Peta says.\n\nAlthough the law refers to “cosmetics” it means more than just make-up - it means all personal-care items such as washes, cleansers, shampoos, conditioners and creams.\n\nAnd in recent years more than 40 countries including India, New Zealand, South Korea, Switzerland, and last month Australia, have banned the sale of cosmetics containing ingredients tested on animals.\n\nBut in others - including China, the United States and Japan - animals are still used to test both ingredients and products.\n\nChina has long insisted that cosmetics be tested on animals in the belief this ensures their safety. However, the country has recently loosened this requirement; animal tests for some cosmetics products manufactured there will no longer be compulsory. One brand that sells there, Avon, this month announced it would work to influence China to adopt alternatives to animal tests.\n\nThe EU Cosmetics Directive bars manufacturers from countries such as China and the US from selling their products in Europe if they have been animal-tested.\n\n4 Can consumer pressure change policies?\n\nIt can.\n\nEarlier this year, after years of debate over animal experimentation, toiletry giants Procter & Gamble, maker of Head & Shoulders, and Unilever, maker of Dove, both agreed to support Humane Society International's #BeCrueltyFree campaign, which aims to ban such testing for cosmetics in all big global beauty markets by 2023.\n\nAnd even China has recently taken a step closer to a ban on animal testing of personal grooming products, promising an end to compulsory post-market testing of finished products.\n\nBut meanwhile companies that profit from testing outside Europe by selling to China may still do business in the UK or have subsidiaries that do - leading many animal lovers to boycott their products to avoid supporting the company.\n\nA high-profile such case was the Body Shop. Famous for being cruelty-free when it was founded, it was bought up in 2006 by L’Oreal’s parent company, leading many fans to boycott it, returning only in 2017 when its new Brazilian owner pledged to be entirely cruelty-free.\n\nPeople for the Ethical Treatment of Animals (Peta) says of non-EU manufacturers that unless they have a policy on the ingredients they use, it is very likely that the ingredients will have been tested on animals.\n\nAnd, naturally, if and when the UK leaves the EU, this could potentially open the country up to imports of a variety of goods that do not fall under strict European anti-animal test laws.\n\nHowever, the government insists these standards will be incorporated into UK law post-Brexit, and has said in writing it is committed to maintaining the EU marketing ban on goods tested on animals outside the EU.\n\n5 How can we know which products involve testing and which don’t?\n\nThe good news is that there are definitive guides and websites to use as a shortcut.\n\nHousehold products and toiletries may be endorsed by either charity the Naturewatch Foundation or by Cruelty Free International – formerly the British Union for the Abolition of Vivisection (BUAV), whose leaping bunny logo is widely used and much imitated.\n\nThe CFI logo guarantees no animal testing of the ingredients, no animal testing of finished products and no animal testing in foreign markets.\n\nThere are some anomalies shoppers should be aware of. Sainsbury’s own-brand toiletries, for example, are endorsed by CFI but the supermarket’s household products such as washing-up liquid and household cleaners are not.\n\nWaitrose own-brand household cleaners, by contrast, do carry the logo.\n\nCFI has a database searchable by brand name or product type.\n\nNaturewatch, which publishes Compassionate Shopping Guides listing cruelty-free alternatives to big brands, uses stricter criteria than CFI, to take account of policies of parent companies.\n\n“If a parent company doesn’t have a cruelty-free policy in place, then its brands and any subsidiary companies won’t be endorsed by us – even if they claim to be cruelty-free and are endorsed by other organisations,” it says.\n\nMarks & Spencer and the Co-op are probably the biggest brands included in the guide.\n\nBig brands endorsed by CFI include Bulldog, Honesty Cosmetics, Morrisons (toiletries only), Neals Yard and Superdrug. Naturewatch, however, does not endorse Superdrug.\n\nBoth watchdogs insist companies adopt a fixed cut-off date policy in order to gain endorsement.\n\nCompanies that have a rolling cut-off-date policy, allowing them to introduce products a few years after animal tests, are barred.\n\n6 Apart from buying cruelty-free what else can I do?\n\nCruelty Free International has teamed up with The Body Shop to launch a petition calling on the UN to adopt an international convention ending animal testing for cosmetics products and ingredients everywhere and for ever. Humane Society International also wants people to pledge to be cruelty-free.", "description": "It may be the smell you like or that the colour of the bottle matches your decor. But when you choose a soap, cleaner or laundry powder you probably don’t give much thought to whether the label hides a secret. Worldwide, an estimated 500,000 animals are still suffering for cleaning products – including some in Britain. But public information on animal testing for household", "authors": ["Jane Dalton"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/04/20/17/istock-873899690.jpg"}