{"pub": "yahoo", "url": "https://news.yahoo.com/2020-vision-wednesday-attacked-over-her-account-of-losing-a-job-because-she-was-pregnant-warren-shows-shes-learned-how-to-fight-back-against-trump-152745007.html", "downloaded_at": "2019-10-09 19:06:26.324769+00:00", "title": "2020 Vision Wednesday: Attacked over her account of losing a job because she was pregnant, Warren shows she's learned how to fight back against Trump", "language": "en", "text": "Welcome to 2020 Vision, the Yahoo News column covering the presidential race with one key takeaway every weekday and a wrap-up each weekend. Reminder: There are 117 days until the Iowa caucuses and 391 days until the 2020 election.\n\nAlmost exactly one year ago, Sen. Elizabeth Warren faced the first big test of her campaign: how to address skepticism — and, from President Trump, mockery — about her long-standing claims of Native American heritage.\n\nIt was a test that pretty much everyone, including Warren herself, agrees that she failed. Her candidacy almost didn’t recover.\n\nOn Tuesday, the Massachusetts senator faced the second big test of her campaign — and this time she took a different approach that seems to be working better. The shift suggests that Warren, despite lingering doubts about her “electability,” has finally learned how to handle the increased scrutiny that her steady rise in the polls will attract — a development that could ease fears among Democrats about how she might stack up against Trump. (She now leads Joe Biden — whose campaign has sometimes seemed at a loss over how to confront Trump’s attacks — for the first time in the Democratic primary polls.)\n\nThe second controversy had the potential to damage Warren if only because it was so similar to the first. On Monday, the Washington Free Beacon, a conservative newspaper, published a report intended to cast doubt on a central chapter in the story Warren tells about herself on the stump (and in her 2014 memoir, “A Fighting Chance”).\n\nAfter graduating from the University of Houston in 1970 with a degree in speech pathology and audiology, Warren moved to New Jersey with her then-husband, Jim. She was subsequently hired as a speech therapist by the Riverdale school board. One year later, she says, she was let go.\n\n“By the end of the school year, I was pretty obviously pregnant,” Warren writes in her book. “The principal did what I think a lot of principals did back then — wished me good luck, didn’t ask me back for the next school year, and hired someone else for the job.”\n\nAccording to Warren, it was a pivotal moment for her — one that set her on the path to law school, academia and eventually public service. The Free Beacon, however, found minutes of an April 21, 1971, meeting showing that the school board had approved a second-year teaching contract for Warren — and minutes from a separate board meeting two months later noting that her resignation had been “accepted with regret.”\n\nOthers quickly piled on, pointing to a 2007 interview in which Warren didn’t mention being let go by the principal, recalling instead that she “went back to graduate school and took a couple of courses in education and said, ‘I don’t think this is going to work out for me,’” then ultimately “had a baby and stayed home for a couple of years.” CBS News, meanwhile, dug up contemporaneous newspaper clips reporting that Warren was “leaving to raise a family” and had “resigned for personal reasons.”\n\nPhoto: Ringo H.W. Chiu/AP More\n\nAccording to Warren’s critics on both the right and the left, this was all part of a pattern — bending the truth to make her life story sound a little better, a little sharper, a little more dramatic.\n\nExcept that, as Warren quickly pointed out in her response, it wasn’t.\n\nThe senator’s initial reaction was mild. “After becoming a public figure I opened up more about different pieces in my life,” she said when CBS News asked why her account had “changed. “And this was one of them.”\n\nBut on Tuesday she came out swinging.", "description": "The senator’s initial reaction was mild.", "authors": ["Andrew Romano", "West Coast Correspondent"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.LMX42bz5vCvLdxWflF7cA--~B/aD0yODA0O3c9NDgwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/3798b620-eaa1-11e9-bde7-3d33cdb76646", "published_at": "2019-10-09"}