{"pub": "yahoo", "url": "https://finance.yahoo.com/news/vaping-crisis-claims-first-british-092514843.html", "downloaded_at": "2019-09-27 02:44:24.763913+00:00", "title": "Vaping Crisis Claims Its First British Victim", "language": "en", "text": "(Bloomberg Opinion) -- The crisis engulfing the American vaping industry has claimed its first European victim. Imperial Brands Plc, the British-based maker of Winston cigarettes in the U.S. and the Blu electronic device, cut its sales and profit guidance on Thursday, a day after Altria Group Inc. and Philip Morris International Inc. called off their merger talks amid increasing Washington scrutiny of illnesses associated with the smoking alternative.\n\nImperial in part blamed a slowdown in U.S. demand for electronic cigarettes for its expectation of flat earnings in the year to Sept. 30. It had anticipated expansion of between 4% and 8%. Revenue will expand by 2%, at the low end of its 1% to 4% range. The shares fell as much as 11%.\n\nSome American retailers, including Walmart Inc. have stopped selling e-cigarettes, while President Donald Trump is moving to ban flavored products and nicotine pods. All of this came together to weigh on Imperial’s sales in the final quarter, when it was also running a big marketing campaign for its Blu device.\n\nSo far the problems haven’t spread to Europe or Japan (the most developed market for devices that heat rather than burn tobacco). Imperial expects sales of its new generation products to increase by 50% this year. That may look eye-watering but it’s below previous expectations.\n\nThis is a worry for all of Big Tobacco, which is investing billions of pounds in innovative new products. Philip Morris has developed the iQos “heat not burn” device, while British American Tobacco Plc has a suite of alternatives.\n\nThe idea is that manufacturers use the cash flows from their traditional cigarettes business to develop products they describe as lower risk. As smoking rates decline, these devices are meant to pick up the slack among consumers. The transition hasn’t been smooth. Growth slowed in Japan last year, where older people proved more reluctant to follow tech-savvy early adopters of alternatives.\n\nThe scrutiny in the U.S. is clearly a serious problem for this potentially huge, but nascent market. Yet there’s an irony too: The crackdown on vaping might drive some of the adults who’ve switched to vapes back to cigarettes.\n\nAlthough gross profit margins on alternatives are approaching those of cigarettes, according to Duncan Fox, an analyst at Bloomberg Intelligence, the traditional product remains the driver of profit and cash flow for the industry. A slower decline in the numbers of traditional tobacco smokers would be terrible for public health, but it might end up easing some of the financial pressure on Big Tobacco, at least in the short term. While the industry has always been a big dividend payer, there have been increasing doubts about whether this is sustainable.\n\nGreater regulation of alternatives could also play to the big companies’ advantage. Most — though not all — of the individuals who’ve fallen ill used black-market vaping pods. A tightening of the rules could favor the devices made by large manufacturers, which have decades of experience lobbying lawmakers. These companies have deep pockets for research and development too.\n\nNevertheless, unless the industry can develop alternatives that are genuinely less harmful, the outlook for what was Big Tobacco’s last great hope looks bleak. Expect more vaping dreams to go up in smoke.\n\nTo contact the author of this story: Andrea Felsted at afelsted@bloomberg.net\n\nTo contact the editor responsible for this story: James Boxell at jboxell@bloomberg.net\n\nThis column does not necessarily reflect the opinion of the editorial board or Bloomberg LP and its owners.\n\nAndrea Felsted is a Bloomberg Opinion columnist covering the consumer and retail industries. She previously worked at the Financial Times.\n\nFor more articles like this, please visit us at bloomberg.com/opinion\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg Opinion) -- The crisis engulfing the American vaping industry has claimed its first European victim. Imperial Brands Plc, the British-based maker of Winston cigarettes in the U.S. and the Blu electronic device, cut its sales and profit guidance on Thursday, a day after Altria Group Inc. and", "authors": ["Andrea Felsted"], "top_image": "https://s.yimg.com/uu/api/res/1.2/edOGDjfgy.yCSzB7FHouYQ--~B/aD03NzY7dz0xMjk2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_opinion_268/eea5998b9fbe3f6d128f24c7c1b83920", "published_at": "2019-09-26"}