{"pub": "metro", "url": "https://metro.co.uk/2019/10/20/amy-schumer-best-time-pal-jennifer-lawrences-wedding-10953013", "downloaded_at": "2019-10-20 23:25:46.598905+00:00", "title": "Amy Schumer ‘had the best time’ at pal Jennifer Lawrence’s wedding", "language": "en", "text": "Amy Schumer and Jennifer are long-time friends (Picture: AP/Getty)\n\nAmy Schumer has said she ‘had the best time’ at Jennifer Lawrence’s A-list wedding.\n\nThe comic also hinted at the outfits she and husband Chris Fischer wore to the nuptials in a since-deleted social media post.\n\nThe I Feel pretty actress shared a photo of Tilda Swinton as the White Witch in 2015 film ‘The Chronicles of Narnia: The Lion, the Witch and the Wardrobe’, along with her dwarf servant.\n\nUm, OK.\n\nShe shared the pic along with the caption: ‘Chris and I had the best time #balmain.’\n\nJennifer wed Cooke Maroney on Saturday 20 October in a lavish ceremony in Newport, Rhode Island.\n\nOther celebrity guests at the ceremony included Keeping Up With the Kardashians star Kris Jenner and 21 Bridges actress Sienna Miller.\n\nKiran Shah and Tilda Swinton in The Chronicles of Narnia: The Lion The Witch and the Wardrobe (Picture: Rex Features)\n\nThen, of course, there was also J-Law’s ultimate celebrity BFF, Adele.\n\nAdvertisement\n\nAdvertisement\n\nJennifer, who won an Oscar for Best Actress in 2012 for her role in Silver Linings Playbook, reportedly wore a Dior gown for the wedding.\n\nThe actresses are close friends (Picture: Getty Images)\n\nJennifer’s wedding comes after Good Morning Britain host Piers Morgan mocked her on live television for making her wedding registry wish list on Amazon last month.\n\n‘You know what Jennifer,’ he said. ‘It’s all a bit tacky love. Seriously, you’re a great actress, you’ve made brilliant movies and a few turkeys, this is not a good look seriously.’\n\nCooke Maroney married Jen yesterday in Rhode Island (Picture: Rex Features)\n\nHe added: ‘Putting out your cheap and cheerful wedding list on Amazon. Seriously. Not a good look.’\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Jennifer Lawrence marries Cooke Maroney in front of a-list guests Adele, Cameron Diaz and Amy Schumer\n\nMORE: Amy Schumer tells troll she’d be ‘disappointed if son liked The Big Bang Theory’ in epic take down", "description": "Amy Schumer was just one of a long list of celebrity guests at Jennifer Lawrence's wedding, including Kris Jenner, Adele and Sienna Miller.", "authors": ["Jamie Tabberer"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90920460_1571610010.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-20"}