{"pub": "usatoday", "url": "https://mmajunkie.usatoday.com/2019/10/jeremy-stephens-says-yair-rodriguez-trying-to-be-something-hes-not-ufc-boston-video", "downloaded_at": "2019-10-16 21:11:00.377896+00:00", "title": "Jeremy Stephens: Yair Rodriguez trying to be something he's not and will find out hard way at UFC Boston", "language": "en", "text": "CAMBRIDGE, Mass. – Jeremy Stephens is looking to make Yair Rodriguez pay for everything he has said.\n\nHe rematches Rodriguez in the co-main event of UFC on ESPN 6 in Boston, and is coming into Friday night with bad intentions.\n\nRodriguez (12-2 MMA, 7-1 UFC) accused Stephens (28-16 MMA, 15-15 UFC) of looking for a way out after he accidentally poked him in the eye seconds into their first fight in Mexico City in September. That main event was ruled a no contest after just 15 seconds.\n\nStephens isn’t buying Rodriguez’s tough act and said he hopes to teach him a lesson by delivering a vicious knockout. “Lil’ Heathen,” who describes himself as a savage, certainly doesn’t think “El Pantera” deserves to be put in the same light as him.\n\n“He’s the ‘Karate Kid,’ man,” Stephens said at a UFC on ESPN 6 media day Wednesday. “He’s a ‘Karate Kid.’ I don’t think he is, bro. I think he’s trying to be something that he’s not, and he’s going to find out the hard way come Friday night when his lights are out.”\n\nThe fans in the hostile Mexico City crowd were disappointed they didn’t get to see Rodriguez go to battle Sept. 21 and showered Stephens with beer and concessions on his way out of the arena.\n\nOn the bright side, Stephens said he’s glad he didn’t take Rodriguez out in Mexico City since he can’t even imagine how the crowd would have reacted then.\n\n“What if I would have knocked him out in Mexico? You saw how they treated me there – (they) probably would have killed me,” Stephens said. “It’s all good though. It’s a great thing. It’s going to make it that much better when I put him on the canvas and he’s staring up at the lights asking what happened and I’m celebrating the win. It’s just going to make it that much better. After all this (expletive) that’s gone down, when I put his lights out, it’s going to be a great night. It’s going to be a huge night for me.”\n\nStephens is on a two-fight losing skid, but thinks he’s very much a player in the featherweight division. With the fashion that he ends fights, he hopes to notch another stoppage victory and potentially jump into the Brian Ortega vs. Chan Sung Jung fight that is set to headline UFC on ESPN+ 23 in Busan, South Korea, in Dcecember.\n\nShould either one pull out, he’d be happy to fill in.\n\n“I’ll look to be next in line for if ‘Zombie’ or Ortega drops off, so you bet your ass I’ll fight one or two more times by the end of the year if it’s possible,” Stephens said.", "description": "Jeremy Stephens thinks Yair Rodriguez is trying to be someone that he's not and vows to teach him a hard lesson at UFC on ESPN 6.", "authors": ["Farah Hannoun", "Dan Tom", "Nolan King", "Mike Bohn", "John Morgan", "Simon Head", "The Blue Corner", "Abbey Subhan", "Simon Samano"], "top_image": "https://usatmmajunkie.files.wordpress.com/2019/10/jeremy-stephens-ufc-boston-video.jpg?w=1000&h=576&crop=1", "published_at": "2019-10-16"}