{"pub": "cbs", "url": "https://cbsnews.com/news/automation-why-automation-could-hit-black-workers-harder-than-other-groups", "downloaded_at": "2019-10-10 18:36:51.739783+00:00", "title": "Why automation could hit black workers harder than other groups", "language": "en", "text": "African Americans stand to lose thousands jobs to automation in some of the nation's largest cities over the next decade, according to new research from McKinsey & Co.\n\nThe management consultancy found that blacks in the fast-food, retail and customer-service industries — especially those in \"support roles\" like cashiers, office clerks, stockroom laborers and call-center representatives — are most vulnerable to their jobs disappearing as companies invest more in labor-replacing technologies. In all, African-Americans are projected to lose a total of 132,000 jobs between now and 2030 due to automation, researchers said.\n\nOf course, other groups are also under threat. Latinos could see roughly a quarter of their jobs automated out of existence, according to McKinsey, while Asians, whites and others will also be affected.\n\nWhile automation often conjures up visions of factory floors full of robots, as is now common among automakers and other manufacturers, tech is displacing workers in less obvious ways. Automated services have already taken over such tasks as ordering a meal at McDonald's, paying a credit card balance by phone or checking in at the airport.\n\nThat is only the beginning. In 2016 alone, tech companies around the world spent upwards of $30 billion on artificial intelligence focused on automating work, McKinsey previously estimated.\n\n\"We think it's good for productivity that companies are looking into this, but the other side is to understand how it impacts workers,\" said Shelley Stewart III, a McKinsey partner who co-authored the most recent study. \"Both the private and public sector have that obligation.\"\n\nHow to be successful in an increasingly automated world\n\nTo estimate the future impact of automation on different groups of employees, McKinsey combined data from the U.S. Census, Labor Department and the Internal Revenue Service. Around the country, blacks in Baltimore, Chicago, Detroit and Washington, D.C., are likely to see the biggest job losses due to automation, according to the firm. That's because these cities have the highest concentration of African-American workers and the lowest expected rates of job growth for blacks.\n\nVerlisa Leonard, a customer service representative who works just outside of Detroit, expressed concern that her job could vanish in the near future, especially since her company already uses an automated system to screen incoming calls.\n\n\"Right now, I feel like they need us, but they will find a way to get rid of us if there's something that costs less,\" said Leonard, 26. \"And I'm not happy with that because I believe we, as a society, need customer service reps.\"\n\nShe hopes to enroll in college soon and study to become a registered nurse. Landing a nursing job in a hospital or clinic is a more stable job, Leonard said, \"because they can't get rid of doctors.\"\n\nBlacks losing jobs to automation could exacerbate the nation's racial income gap, researchers said. In 2018, the median household income for whites was $70,642, compared to $51,450 for Latinos and $41,361 for blacks, Census data show. Closing that gap could boost the U.S. economy by $1.5 trillion by 2028, researchers said.\n\nRobots could be to blame for workers' stagnant wages\n\nAutomation may have the most deleterious impact on black men 35 and younger with only a high school diploma, McKinsey said. Black women are better positioned to stave off job loss because they have a strong presence in the education and health care sectors, according to the firm.\n\n\"Occupations such as nursing assistants and home health aides have a lower automation potential due to the need for dynamic, physical motions and deep interpersonal connections,\" researchers wrote.\n\nBlack workers in jobs slated for automation should talk to their employer and see if there are opportunities to move into a different role, Stewart said.\n\n\"This is not about painting a dismal picture of 'our fate is our fate',\" Stewart said. \"We want to frame up in a real, fact-based way what the situation is, and we really want people to focus on what the solutions are.\"\n\nBlack workers could curb the impact of automation by getting a college education, transitioning into a role that's harder to automate or moving to communities where economists have predicted job growth, the report said. Researchers said Atlanta, Charlotte, Dallas, Houston and Orlando are likely to see stronger job growth despite the trend toward automation.", "description": "AI, robots and other technologies that supplant human labor threaten to widen the racial wealth gap in the U.S.", "authors": ["Khristopher J. Brooks"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2019/10/09/67e70d44-0ff1-445e-a54c-39fda6614937/thumbnail/1200x630/43823fcd5941953084a552439978d11f/gettyimages-1004082664.jpg", "published_at": "2019-10-10"}