{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7630339/Its-Red-Sea-Heavy-rain-stains-British-beach-deep-orange.html", "downloaded_at": "2019-10-30 14:37:38.296087+00:00", "title": "It's the Red Sea! Heavy rain stains British beach deep orange", "language": "en", "text": "Advertisement\n\nThese pictures show how heavy rain washed rust-coloured mud from cliffs down into the surf, staining a beach deep orange and giving the sea a red hue.\n\nEleanor Ansell, 21, went with her father, Mark, 56, to take the family dog, Pippin, for a walk and expected it to be a normal trip to the beach.\n\nBut when they got there they were shocked as instead of calm blue waters, they saw a blood red sea and darkly stained sand. Peppercombe beach, near Westward Ho!, Devon, turned the unusual colour after water ran off a nearby cliff, staining everything in its path.\n\nMark Overton, the chairman of North Devon Cricket Club, said: 'It was totally extraordinary. It's a place we walk regularly and we got down to the beach and it looked really weird.\n\n'We were thinking, \"what has happened?\" It had just been torrentially raining and the water was running straight off hills and down the cliff face. The cliff face is red so it was picking up that colour and pulling it across the beach.'\n\nMs Ansell, a university student, visited the beach with her father on Saturday afternoon and described it as a 'surreal scene'.\n\nThey had arrived shortly after a torrential downpour which had seen weather warnings issued across the county. The beach, at the foot of Peppercombe valley which is only accessible by foot, backs on to a series of striking, red cliffs.\n\nConsisting of mud and sandstone, the cliffs are believed to be more than 280 million years old. And when the rain is heavy, it turns the run-off water red and drains down to the sea. The secluded beach is operated by the National Trust.\n\nPippin's walk to the beach in Devon was made all the more bizarre by his owner's realisation that the beach had been turned a deep orange. Eleanor Ansell explained that the strange sight awaits visitors when heavy rain his the cliffs (pictured) then carries its colouring down onto the seafront with the running water\n\nTorrential rain in Westward Ho!, Devon, have drained colour from the cliffs, with the deep orange being carried down onto the seafront and into the ocean. The strange sight comes after rivers burst their banks across the country and the south-west in particular experienced heavy flooding, with freezing temperatures set to follow\n\nHuge Devon downpours have meant that the cliff's colour has bled down onto the sand at Westward Ho! (pictured) as the surface on the cliff erodes under the heavy rain, staining the water as it runs onto the beach and out into the ocean in a strange sight that awaits tourists and locals in the south-west of England today", "description": "Eleanor Ansell was stunned when she took her dog, Pippin, to Peppercombe beach to find that heavy Devon downpours had flushed orange mud onto the sand and into the sea.", "authors": ["Sebastian Murphy-Bates For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/12/20373908-0-image-a-2_1572438221972.jpg", "published_at": "2019-10-30"}