{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/i-may-be-old-and-crippled-but-there-is-nothing-wrong-with-my-hands-man-with-prosthetic-leg-in-viral-hugo-video-20191003", "downloaded_at": "2019-10-05 11:19:58.695560+00:00", "title": "'I may be old and crippled, but there is nothing wrong with my hands' - man with prosthetic leg in viral 'Hugo' video", "language": "en", "text": "Did Hugo ever phone the police? According to Wynand Janssen, the man with the prosthetic limb who chased after the car in that viral video, he is still waiting for the authorities to arrive.\n\nThe family has since moved to a \"lekker plekkie\" in Pretoria West after the infamous brawl, Janssen told Jacaranda FM's Rian van Heerden in a radio interview.\n\nThe video was taken more than a year ago by a neighbour when they lived in Pretoria North.\n\nJanssen, who lost his leg 25 years ago when a two-ton forklift fell on it, told the broadcaster he had been painting a portrait of a pink flamingo when his wife called him as the brawl broke out.\n\nEk wonder is dit in Danville of Brakpan? pic.twitter.com/dvzHhBVxQh — Moegvirpolitiek (@Frederi21904348) September 17, 2019\n\nAccording to Janssen, his married son was friends with the blonde woman in the video. Her boyfriend, however, didn't think their relationship was platonic and had brought his friends to beat up who he thought was his love rival.\n\nJanssen had come out of the house and found his wife brandishing a steel pipe – not a crutch as initially thought.\n\n\"I stormed out, they split and I followed them,\" he told Van Heerden, explaining he had tried to stop the car. \"I may be old and crippled, but there is nothing wrong with my hands,\" Janssen said in Afrikaans.\n\nEveryone involved had been completely sober, he said.\n\nA neighbour, who Janssen believed was named Martie, recorded the brawl and is the voice shouting in the recording for Hugo to phone the police. He had only indicated to her to go back into her house, he maintained. She is friends with the landlord, and despite warning them that they would be \"put out on Monday\", they only left two months later. They now live in Mountain View.\n\n\"If you fight, you fight man to man. You don't go fetch a lot of other children to tackle and stuff. I was just trying to protect my kids and wife.\"\n\nWATCH: 'Hugo, call the police!'\n\nWhen asked if he could \"donner\" well, he replied, \"If you look carefully, my teeth are out and my fists are broken. I did at one time, but I repented, you know.\"\n\nVan Heerden told Janssen some people now called them \"Stompie en die Boksombende\". He said if it amused those that say it, it was \"alright\".\n\nAnd their new neighbours? \"They like us,\" Janssen said with a laugh.\n\nThe dramatic video, in which punches are traded, people pull each other's hair and expletives fly, went viral in South Africa last month, YOU previously reported.\n\nAlthough it was not clear what caused the fighting at the time, many a South African expressed views on it, the magazine reported.\n\n- Compiled by Tammy Petersen.", "description": "Did Hugo ever phone the police? According to Wynand Janssen, the man with the prosthetic limb who chased after the car in that viral video, he is still waiting for the authorities to arrive.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9432/270c1d75e16744c9a4ab4a0fd0458d29.png", "published_at": "2019-10-03"}