{"pub": "huffpost", "url": "https://huffpost.com/entry/girl-dies-amusement-park-ride-deerfield-township-harvest-festival_n_5da417fce4b06ddfc51ca4ee", "downloaded_at": "2019-10-14 10:11:14.064382+00:00", "title": "10-Year-Old Girl Dies After Being Thrown From Amusement Park Ride At New Jersey Festival", "language": "en", "text": "A 10-year-old girl died on Saturday evening after being flung from a ride at the annual Deerfield Township Harvest Festival in New Jersey.\n\nState police said in a statement that the child, who has not been named, had suffered critical injuries after being abruptly ejected from a ride called “Extreme,” which police identified as a Wisdom Super Sizzler amusement park ride that spins suspended riders in different directions.\n\nThe girl, who witnesses told WPVI was “motionless” after being thrown, was airlifted to Cooper University Hospital, police said. She was pronounced dead at the hospital at 7:20 p.m., about an hour after the accident occurred.\n\nWorkers testing “Extreme” today at Deerfield Twp. Harvest Festival. Last night, @NJSP say a 10YO girl died from her injuries after she was ejected from ride. Skelly’s Amusements say state cleared them to run other rides-but they decided to close them today @FOX29philly pic.twitter.com/okzy5j1K2C — Kelly Rule (@KellyRuleTV) October 13, 2019\n\nAuthorities are conducting an investigation into the circumstances around the child’s death. Skelly’s Amusements, the company that operated the rides and games for the Harvest Festival, said it was fully cooperating with the probe.\n\n“We are absolutely heartbroken. Words cannot express our feelings and we extend our deepest sympathies to the individual’s family and loved ones. We ask that you keep them in your thoughts,” the company said on Facebook.\n\nRides currently closed for the Deerfield Township Harvest Festival after 10 year old girl is killed after falling out of ride called Extreme. @6abc pic.twitter.com/rBIgzofWM2 — Bob Brooks (@BobBrooks6abc) October 13, 2019\n\nThe Harvest Festival, which is in its 41st year, continued as scheduled on Sunday ― the last day of the event; but organizers said it would cancel a planned parade.\n\nSkelly’s, which according to New Jersey Family magazine has provided rides to the festival for three decades, said it would also cancel all rides on Sunday.\n\n“Even though we have been given permission to operate the other rides by the state, we don’t have it in our heart,” the company said on Facebook, adding that it would be issuing refunds to customers.\n\nThere’s a growing makeshift memorial for the 10-year-old girl who died after being thrown from a ride at the Deerfield Twp Harvest Festival @CBSPhilly https://t.co/SbMRJ0QiDz pic.twitter.com/045C3XCPXx — Matt Petrillo (@MattPetrillo) October 13, 2019\n\nPeople who know the girl’s family told NJ.com that they had been shocked and heartbroken to learn of the fatal accident.\n\n“You come thinking the kids will be safe, not a freak accident,” festivalgoer Alex Ortiz, a Deerfield Township resident whose daughter was friends with the victim, told the outlet.", "description": "The girl was ejected from a ride called \"Extreme\" on Saturday at the annual Deerfield Township Harvest Festival, police said.", "authors": ["Senior Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5da41d662100004207344b65.png?cache=cglzurt6va&ops=1778_1000", "published_at": "2019-10-14"}