{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7555083/Most-Britons-think-Lyme-disease-denial-expert-says.html", "downloaded_at": "2019-10-09 19:19:42.434006+00:00", "title": "Most Britons who think they have Lyme disease are in denial, expert says", "language": "en", "text": "Most people in the UK who think they have Lyme disease 'probably do not', according to a leading expert.\n\nHundreds of patients who show symptoms consistent with the condition are actually suffering from chronic fatigue syndrome, scientists say.\n\nBut because of the stigma attached to the syndrome, they do not want to accept the diagnosis.\n\nThere's no proven cause and no cure for the mysterious disease, which is marked by otherwise inexplicable tiredness, pain, poor sleep and sometimes dizziness and brain fog.\n\nSurrounded by so many questions, patients' complaints are often dismissed by families, strangers and even physicians who think their symptoms may be in their heads.\n\nDr Sarah Logan, a lead consultant at the Hospital for Tropical Disease, University College London Hospitals, said: 'I think that most people who think they have got Lyme disease in the UK, probably don't.\n\n'Most people who now think that they may have had Lyme disease, in fact have a syndrome that is more in keeping with chronic fatigue syndrome.\n\nA leading expert has claimed most people in the UK who think they have Lyme disease 'probably do not'. The condition is spread to humans via bites from infected ticks which often leaves a circular red rash (file)\n\n'And because there is increased awareness about it, they are testing for Lyme Disease.\n\n'Then they are going on to various different Lyme disease forum on the internet and being told, \"well actually the UK tests are rubbish, but you need to send it off to Germany.\"\n\n'And then they are coming back with a test that is positive and saying \"you doctors are all wrong and I don't have Chronic Fatigue Syndrome, I have Chronic Lyme disease\".'\n\nLyme disease was thought to affects around 3,000 people in the UK each year and 30,000 annually in the US.\n\nWhat is Chronic Fatigue Syndrome? Chronic fatigue syndrome (CFS) is a complicated disorder characterised by extreme fatigue. It can't be explained by any underlying medical condition. The fatigue may worsen with physical or mental activity, but doesn't improve with rest. This condition is also known as myalgic encephalomyelitis (ME). Sometimes it's abbreviated as ME/CFS. The cause of chronic fatigue syndrome is unknown, although there are many theories - ranging from viral infections to psychological stress. Some experts believe chronic fatigue syndrome might be triggered by a combination of factors. Surrounded by so many questions, patients' complaints are often dismissed by families, strangers and even physicians who think their symptoms may be in their heads. Source: Mayoclinic.org\n\nThe bacterial infection is spread to humans via bites from infected ticks which often leaves a circular red rash - often described as a bullseye on a dartboard.\n\nThe condition can also cause flu-like symptoms and, if left untreated, spread to the joints, heart and nervous system and be deadly.\n\nSeverely affected patients may experience paralysis of their facial muscles, memory problems or difficulty concentrating.\n\nIn later stages of the disease, inflammation of the eye, spinal cord and brain may develop, leading to a loss of vision and increased sensitivity to light.\n\nDr Logan said doctors often shy away from diagnosing patients with Chronic Fatigue Syndrome because of the stigma attached to it.\n\nThe mystery around the condition and lack of treatments makes doctors cautious to diagnose the condition, Dr Logan claims.\n\nShe added: 'It is the sort of syndrome that is difficult for people to hear when they are told that they might have it.\n\n'It is also difficult for doctors to give the diagnosis because at the moment our treatments and out support network within the NHS for patients with chronic fatigue is not great.\n\n'I think we are not doing these patients a great service at the moment by not confronting the issue upfront.\n\n'To be honest I think GPs probably do shy away a little bit from spelling out those words to patients, because they feel this is terribly unsatisfying for everybody.\n\nHundreds of patients who show symptoms consistent with the condition are actually suffering from chronic fatigue syndrome, according to Dr Sarah Logan (pictured), from the University College London Hospitals\n\n'I think there is a bit about patients not wanting to hear it because of all those stigma reasons.\n\n'And there is a little bit about GPs hoping - probably not unreasonably - \"let's look for an alternative diagnosis because then that is something we can treat\".'\n\nDr Logan said that in these instances, by the time a Lyme disease test comes back negative the seed has already been planted in the patient's mind.\n\nShe claims this often causes them to seek another test from a Lyme disease clinic and fork out up to £600 for a consultation and test that has not been validated.", "description": "Dr Sarah Logan, a lead consultant at the Hospital for Tropical Disease, University College London Hospitals, said hundreds of patients were refusing to accept their CFS diagnosis due to stigma.", "authors": ["Connor Boyd Health Reporter For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/17/19501096-0-image-a-23_1570638355163.jpg", "published_at": "2019-10-09"}