{"pub": "yahoo", "url": "https://news.yahoo.com/egypt-says-talks-over-ethiopias-191746384.html", "downloaded_at": "2019-10-06 07:27:23.585400+00:00", "title": "Egypt says talks over Ethiopia's Nile dam deadlocked, calls for mediation", "language": "en", "text": "Ethiopia's Grand Renaissance Dam is seen as it undergoes construction work on the river Nile in Guba Woreda\n\nKHARTOUM (Reuters) - Egypt said on Saturday that talks with Sudan and Ethiopia over the operation of a $4 billion hydropower dam that Ethiopia is constructing on the Nile have reached a deadlock, and it called for international mediation.\n\nThe Grand Ethiopian Renaissance Dam (GERD), announced in 2011, is designed to be the centerpiece of the Horn of Africa country's bid to become the continent's biggest power exporter, generating more than 6,000 megawatts.\n\nBut Egypt fears the dam will restrict the flow of the Nile, the economic lifeblood of all three countries, from Ethiopia's highlands through the deserts of Sudan and on to Egypt's fields and reservoirs.\n\nEgypt relies on the Nile for 90% of its fresh water.\n\n\"Talks have reached a deadlock as a result of the Ethiopian side's inflexibility,\" the Egyptian ministry of water resources and irrigation said in a statement.\n\n\"Egypt has called for involving an international party in the Renaissance Dam negotiations to mediate between the three countries and help...reaching a fair and balanced agreement,\" it said after talks in the Sudanese capital Khartoum between the three countries' water resources ministers.\n\n\n\n\n\n(Reporting by Khaled Abdelaziz, Ahmed Tolba, Momen Saeed Atallah and Alaa Swilam; Writing by Mahmoud Mourad; Editing by Ulf Laessing and Hugh Lawson)", "description": "Egypt said on Saturday that talks with Sudan and Ethiopia over the operation of a $4 billion hydropower dam that Ethiopia is constructing on the Nile have reached a deadlock, and it called for international mediation.  Egypt relies on the Nile for 90% of its fresh water.", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/YaR8eRzi_8q6W7yhgAfAuw--~B/aD0zMDA7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/a6d1d69b0cc1c2fa25513be8dc55c2a8", "published_at": "2019-10-05"}