{"pub": "news24", "url": "https://health24.com/Medical/Stop-smoking/News/flavours-draw-young-people-to-lifetime-addiction-of-vaping-20191025-2", "downloaded_at": "2019-10-27 12:14:09.582311+00:00", "title": "Flavours draw young people to lifetime addiction of vaping", "language": "en", "text": "Flavours draw young people to lifetime addiction of vaping A study found that twice as many kids and young adults who first try a flavoured e-cigarette will still be vaping a year later, compared with those who first try a tobacco-flavoured vape.\n\nWhat keeps kids hooked on vaping? ~\n\nTasty flavours entice young people to try e-cigarettes, getting them hooked on what can become a lifetime habit, a new study shows.\n\n\"Children and youth prefer sweet flavours. We know that flavours increase appeal to young or inexperienced users,\" said lead researcher Andrea Villanti, an associate professor with the University of Vermont's Center on Behavior and Health. \"Something that tastes like candy is more palatable to a young person than tobacco flavour on its own.\"\n\nOnly tobacco and menthol flavours\n\nHer team found that young people who first try a flavoured vape, cigar or smokeless tobacco are much more likely to still be using that product a year later.\n\nFor example, twice as many kids and young adults who first try a flavoured e-cigarette will still be vaping a year later, compared with those who first try a tobacco-flavoured vape, the study found.\n\nThe results support recent efforts by the Trump administration and some states to ban flavoured e-cigarettes.\n\nIn response to growing pressure, e-cigarette maker Juul announced last week that it would suspend sales of all flavoured pods for its vaping device. Only tobacco and menthol flavours will remain on the market, pending review by the US Food and Drug Administration.\n\nBut Villanti noted that the problem extends far beyond vaping.\n\n\"E-cigarettes are getting a lot of attention right now, and they also have a lot of flavours, but this is a problem we have across all product categories,\" Villanti said. \"It's not just an e-cigarette issue.\"\n\nOngoing federally funded study\n\nRegulations against flavourings in tobacco products remain weak, Villanti said. Cigarettes are the only tobacco product in which flavours are banned, although menthol cigarettes have been allowed to remain on the market.\n\nTo see whether flavours attract young people to tobacco and then help keep them using, Villanti and her team used data from an ongoing federally funded study that tracks tobacco use in the United States.\n\nThe researchers assessed data collected in 2013–2014 to see whether people are more likely to first try a flavoured e-cigarette or other tobacco product. They then looked at data gathered a year later to see if those who first tried a flavoured product were still using tobacco.\n\nSeven out of 10 kids who were new users of tobacco first tried a flavoured product, as well as more than half of young adults, researchers found.\n\nThose young adults who started with a flavoured product were more likely to stick with it, data from the second wave revealed. Current daily users included:\n\nTwice as many first-time users of flavoured e-cigarettes or pipe tobacco\n\nThree and a half times as many filtered cigar users\n\nTwice as many hookah tobacco users\n\nHalf again as many users of cigarillos, cigars or smokeless tobacco\n\nEven more compelling data\n\n\"If you're younger than 25, the first product you probably use is flavoured and you're more likely to continue to use tobacco products if you're introduced to a flavoured product first,\" said Dr Jamie Rutland, who reviewed the study. He's an assistant clinical professor of pulmonology and critical care at the University of California, Riverside.\n\nAdults also were more likely to keep using a tobacco product if they first tried a flavoured version, the study showed.\n\nThe new study \"confirms what everybody already thought,\" Rutland said, adding that flavours have contributed to the recent boom in vaping.\n\n\"This was a study done five years ago, when they collected the data,\" noted Rutland, an American Lung Association national spokesman. \"I think the data, if they collected it now, would be even more compelling.\"\n\nThe new study was published in the journal JAMA Network Open.\n\nImage credit: iStock\n\n", "description": "A study found that twice as many kids and young adults who first try a flavoured e-cigarette will still be vaping a year later, compared with those who first try a tobacco-flavoured vape.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8334/cb0272bc91854e39acd8e40cce04e623.jpg", "published_at": "2019-10-25"}