{"pub": "yahoo", "url": "https://news.yahoo.com/johnson-first-battle-mps-2020-135617927.html", "downloaded_at": "2019-10-22 15:21:45.867581+00:00", "title": "Johnson’s First Battle With MPs: The 2020 Trade Cliff Edge", "language": "en", "text": "(Bloomberg) -- As Boris Johnson prepares for a knife-edge vote on his Brexit deal tonight, the big question dogging some of the waverers is: how do we stop another no-deal cliff edge a year from now?\n\nAccording to the bill, published late on Monday, Britain will have until 2020 to sign a trade agreement with the European Union. But if that doesn’t happen, and the two sides fail to agree to extend the transition period, the country could still crash out of the EU.\n\nThe decision to extend lies in the hands of ministers rather than parliament -- something that the MPs who have thus far managed to take the Oct. 31 cliff edge off the table are desperately seeking to prevent. At the same time, that same threat might well have convinced some of the hardest Brexiteers to swing behind the Johnson deal.\n\nLawmakers vote tonight on whether they agree with the general principles of the bill, and then on Johnson’s plan to fast-track the law through parliament. If that second vote fails, opponents to Johnson’s plan are likely to pounce.\n\nFormer Conservative MP Nick Boles, who now sits as an independent in Parliament, has proposed an amendment that would force the government to seek an extension of the transition period to Dec. 2022 if it hasn’t agreed a deal with the EU by the deadline at the end of next year.\n\nEven if he succeeds in getting his Brexit deal through Parliament, Johnson may find that reaching a trade deal in less time than it took to negotiate the Withdrawal Agreement won’t be easy. EU members states all have their own axes to grind -- France, for example, wants access to British waters for its fishermen -- and may demand a high price from Johnson.\n\nTo contact the reporter on this story: Edward Evans in London at eevans3@bloomberg.net\n\nTo contact the editor responsible for this story: Heather Harris at hharris5@bloomberg.net\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- As Boris Johnson prepares for a knife-edge vote on his Brexit deal tonight, the big question dogging some of the waverers is: how do we stop another no-deal cliff edge a year from now?According to the bill, published late on Monday, Britain will have until 2020 to sign a trade agreement", "authors": ["Edward Evans"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-22"}