{"pub": "fox", "url": "https://foxnews.com/health/holes-in-the-heart-united-kingdom-baby", "downloaded_at": "2019-09-20 22:59:07.829807+00:00", "title": "Mom told 'healthy' son has 2 holes in heart: 'I feel like I have been abandoned'", "language": "en", "text": "A British mom who claims she was told her infant son was healthy both before and after he was born recently learned the young boy will require open-heart surgery for a previously undetected condition.\n\nAbigail Hetherington, 19, told the South West News Service (SWNS) that her infant son Vincent was recently diagnosed with a heart murmur and two holes in his heart.\n\nThe conditions were detected when a doctor treating Vincent for a stomach bug noticed the murmur while listening to his heartbeat. Both conditions were later confirmed by doctors at the Royal Blackburn Hospital. Vincent was eight weeks old at the time.\n\nZANTAC CANCER CONCERNS HALT SHIPMENTS OF GENERIC VERSIONS OF POPULAR HEARTBURN MEDICATION\n\n\"It's been absolutely awful, I was told I had a perfectly healthy baby and I trusted the fact that he was OK,” Hetherington, of Accrington, England, said.\n\n“I came home and went to an out-of-hours GP surgery because he had a tummy bug, next thing we were shipped to the hospital,” she continued. \"The doctor said 'you're aware of his heart murmur, aren't you?' as if I already knew.”\n\nThe new mom said she feels especially let down because she underwent extensive scans and tests while pregnant to ensure her then-unborn son did not have a rare developmental disorder called Cornelia de Lange syndrome. Hetherington’s brother has the disorder, which prompted her to get tested.\n\nAlthough Cornelia de Lange syndrome can cause congenital heart defects, according to the Genetic and Rare Diseases Information Center, it was not clear if Vincent’s heart conditions are a result of the disorder.\n\n“I feel like I have been abandoned, the NHS [National Health Service] has completely failed me,” she said. \"It is causing me quite a lot of anxiety, I can't leave him in a room on his own, I'm always worried something might happen.”\n\n\"I have never left him alone for more than five minutes, it's going to be hard to hand him over for surgery for four hours and then longer when he is in intensive care,” she added.\n\nHetherington’s mother and Vincent’s grandmother, Christina Hetherington, told SWNS her daughter would have been more prepared if doctors had detected Vincent’s heart murmur and holes in his heart sooner.\n\n“We are extremely upset and traumatized at this sudden shock and are struggling to understand why this has not been detected during Abigail’s pregnancy, given the fact that she had multiple fetal medicine 4D scans to look for any kind of abnormalities,” she said.\n\nMOM WHOSE SON WAS BULLIED, ATTEMPTED SUICIDE SPEAKS OUT: 'MY GUT DROPPED'\n\nAn atrial septal defect “is a birth defect of the heart in which there is a hole in the wall (septum) that divides the upper chambers (atria) of the heart,” according to the Centers for Disease Control and Prevention (CDC). The holes often vary in size; some require surgery while others don’t. A hole can sometimes close on its own.\n\n“The hole increases the amount of blood that flows through the lungs and over time, it may cause damage to the blood vessels in the lungs,” the CDC notes, adding “damage to the blood vessels in the lungs may cause problems in adulthood, such as high blood pressure in the lungs and heart failure. Other problems may include abnormal heartbeat and increased risk of stroke.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nRoughly one in every 770 babies in the U.S. are born with an atrial septal defect each year, the federal agency says.", "description": "A British mom who claims she was told her infant son was healthy both before and after he was born recently learned the young boy will require open-heart surgery for a previously undetected condition.", "authors": ["Madeline Farber", "Madeline Farber Is A Reporter For Fox News. You Can Follow Her On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/mothers-heartac-412997.jpg", "published_at": "2019-09-20"}