{"pub": "townhall", "url": "https://townhall.com/columnists/rachelmarsden/2019/10/23/canadas-trudeau-will-have-to-choose-between-populism-and-socialism-n2555162", "downloaded_at": "2019-10-23 09:36:00.167221+00:00", "title": "Canada's Trudeau Will Have to Choose Between Populism and Socialism", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nPARIS -- Former U.S. Secretary of State Hillary Clinton and Canadian Conservative Party leader Andrew Scheer now have something in common. They can both spend the rest of their lives complaining that they won the popular vote but still lost a national election.\n\nCanadian Prime Minister Justin Trudeau kept his job but lost the popular vote in Monday's federal election. Conservatives won 34.4 percent of the popular vote, while Liberals won 33.1 percent -- a difference of more than 243,000 votes. Trudeau's Liberal Party lost its parliamentary majority, falling 13 seats short of the 170 required to ram through whatever new legislation he wants. Still, Trudeau won. There will be no massive outcry about the electoral map or seat distribution.\n\nClinton's camp blamed her loss on the Electoral College, Russian President Vladimir Putin and self-hating women who committed treason against their gender by voting for Donald Trump. While there may have been an appetite for that kind of whining among Clinton's establishment supporters, Canadians have zero appetite for post-electoral whining, let alone the kind that lasts for years.\n\nThere has never been an instance in Canada where the credibility of a national election was contested by the losers all the way up to the next election. It would be one thing if the Trump presidency represented an anomaly in U.S. politics, but it doesn't. When George W. Bush defeated Al Gore for the presidency in 2000 despite losing the popular vote, for the next eight years we were bombarded with whining that Bush had \"stolen\" the election and somehow wasn't a legitimate president.\n\nPost-electoral behavior in Canada reflects a stark difference between the two countries, which otherwise have far more in common than not, culturally speaking. Once a Canadian election is over, everyone is expected to become pragmatic for the sake of the country. And at no time does this hold more true than when Canadian voters issue a minority government mandate like they did this week. What this means for Trudeau is that voters don't like what he's done enough to continue giving him carte blanche to do whatever his party wants. Voters have forced him into a situation where he has to convince at least one other smaller party with at least 13 seats to vote along with his centrist Liberal Party in order to pass legislation.\n\nThe question is: Which smaller party will be the kingmaker? Since the Conservatives aren't likely to start voting in favor of legislation proposed by the Liberals, Trudeau's options will be reduced to an alliance with either populism or socialism. And based on how Canadians just voted, one of these choices will be perceived as better than the other.\n\nIt's safe to say that Canadians rejected the unabashed socialism promoted by the New Democratic Party in this election, with the party having lost 18 of its 42 seats. Any effort by Trudeau to shift further left to capture support from the socialists will not only kill Canada's economy but also any support for his policies.\n\nTrudeau's only other avenue to get anything done in this new government is to negotiate with the populist, protectionist, and separatist Bloc Quebecois -- a party that doesn't exist outside of francophone-dominated Quebec but now holds 32 seats, third most behind the Liberals and Conservatives. The Bloc was the big story in this election, having gained 22 seats.\n\nSo what does Bloc Quebecois stand for? First and foremost, the protection of French-Canadian heritage and culture. Traditionally, this meant protecting mostly French-speaking Quebec against encroachment by Anglophone Canada. But these days, it more often means a desire for fewer immigrants (and a values test for those who enter the country). The Bloc wants Quebec to be exempt from the federal multiculturalism law that mandates coexistence over common identity. It also wants mandatory knowledge of French as a condition of Canadian citizenship in Quebec, and suspension of the Safe Third Country Agreement with the U.S. -- a loophole that has allowed migrants expelled from America to seek asylum in Canada at unofficial border crossing points.\n\nAny supporter of populism or nationalism in the world can find items they like in the Bloc Quebecois platform. Limited-government conservatives can also find common ground in the Bloc's focus on independence from the federal government.\n\nGranted, there's also a dose of wealth redistribution in the Bloc platform, but collaborating on the Bloc's more left-leaning issues -- as with those of the socialist New Democratic Party platform that Canadian voters soundly rejected -- is a surefire recipe for future electoral defeat for Trudeau's Liberals.\n\nThe popular vote shifted right, the left tanked and the populists surged. That's the message Trudeau needs to grasp in order to cobble together a coherent new vision for Canada.", "description": "PARIS -- Former U.S. Secretary of State Hillary Clinton and .10/23/2019 5:35:59AM EST.", "authors": ["Rachel Marsden", "Matt Vespa", "Timothy Meads", "Julio Rosas"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/93/9d5202c8-a723-4995-9a8d-174a474b53cd.png", "published_at": "2019-10-23"}