{"pub": "thehill", "url": "https://thehill.com/opinion/international/465502-stockholm-breakdown-reflects-north-koreas-failure-to-compromise", "downloaded_at": "2019-10-12 17:47:48.132682+00:00", "title": "Stockholm breakdown reflects North Korea's failure to compromise", "language": "en", "text": "Working-level talks in Stockholm between the United States and North Korea broke down last weekend. While pursuing diplomacy is important in fostering bilateral trust, the Trump administration’s efforts have not yielded any success. Washington must re-think its North Korea policy, because Pyongyang shows no sign that it takes these talks seriously.\n\nKim Myong-gil, North Korea’s chief negotiator, blamed the U.S. for the failure in talks. He threatened that if the U.S. is “not well prepared” for future discussions, a “terrible incident could happen.” Despite North Korea’s persistent attacks on Washington’s unwillingness to provide concessions such as sanctions relief, the Trump administration rightly continues to withhold them due to North Korea’s lack of reciprocal actions. Washington recognizes that diplomacy cannot succeed unless Pyongyang makes a strategic decision to relinquish its nuclear program.\n\nUnfortunately, the regime has yet to get the message. In a post-Stockholm propaganda blitz, North Korea introduced a new acronym to describe its broad demands of America: “complete and irreversible withdrawal of the hostile policy” (CIWH). This formulation appears to be a tongue-in-cheek answer to the U.S. demand for “complete, verifiable, irreversible dismantlement” (CVID) of Pyongyang’s nuclear program.\n\nADVERTISEMENT\n\nNorth Korea’s harsh response to the Stockholm meeting is a near replay of the failed Hanoi summit last February. In Vietnam, Kim Jong Un Kim Jong UnIn Syria, making America ashamed again — and weaker To tame America: Kim Jong Un's stealth mind tricks North Korea warns it may resume nuclear, ballistic missile tests MORE kept pressing Trump to lift all sanctions implemented after 2016 and to provide other concessions before providing proportionate reciprocal actions, leading Trump to walk away. Now, in Stockholm, Kim’s working-level negotiators continued to issue these demands and then walked out after more than eight hours of discussion, hoping they could pressure the U.S. negotiators to capitulate in order to keep the dialogue open.\n\nKim Myong Gil’s caustic statement is an example of North Korea’s negotiating strategy of employing threats and provocations in order to extort political and economic concessions from the U.S. and its allies. For instance, just days prior to the Stockholm meeting, North Korea tested a submarine-launched ballistic missile designed to enhance deterrence and eventually provide the regime with a second strike capability. Kim likely believed that developing this crucial deterrent capability would enhance his negotiating leverage. The missile test was one of 12 ballistic missile and rocket tests that North Korea conducted since this May to threaten South Korea, Japan, and the U.S.\n\nKim likely feels confident continuing his hardball tactics because he perceives a lack of resolve from the Trump administration. The burden-sharing negotiations between the ROK and the U.S., including the U.S. demand for $5 billion to pay for U.S. troops in South Korea, has severely strained the ROK/U.S. alliance. In the last year President Trump Donald John TrumpFederal prosecutors investigating Giuliani: report House Foreign Affairs Committee Chairman and top Republican to introduce sanctions bill against Turkey Trump lashes out at 2020 Dems, impeachment inquiry MORE decided to suspend large-scale exercises, calling them a waste of money and “provocative” war games. These moves appeared to reflect Trump’s 2016 campaign promise to remove U.S. troops from South Korea.\n\nKim is also likely heartened by President Trump’s decision on Sunday to withdraw U.S. troops from Northern Syria in response to a demand from Turkey’s leader Recep Tayyip Erdogan. President Trump’s decision in the Middle East has sparked expert criticism that Trump forces allies to lose trust in the U.S. commitment and credibility as security partners. If President Trump cut a similar deal with Kim Jong Un in exchange for Pyongyang’s dubious promises toward denuclearization, Kim would pocket a significant concession of U.S. disengagement from the Korean peninsula that helps North Korea achieve its divide and conquer strategy — divide the ROK/US alliance to conquer the ROK.\n\nThese U.S. moves may have sent Kim the message that the U.S. wants an agreement more than the DPRK. A deal could give President Trump a foreign policy success prior to the 2020 election cycle and possibly help Trump garner popularity in the upcoming presidential race. As far back as April, Kim put an expiration date of the end of 2019 on direct U.S.-DPRK diplomatic engagement, demanding the U.S. make a “bold decision” to improve relations. Furthermore, Kim likely believed Stockholm would give him his usual victory of getting something for nothing.\n\nADVERTISEMENT\n\nStill, to Kim’s chagrin, both President Trump and South Korean president Moon Jae-in continue to state that there can be no sanctions relief without substantive progress toward denuclearization of the north. Unfortunately, Kim refuses to accept this reality.\n\nThe U.S. can only break this diplomatic deadlock by considering a new North Korea policy that forces Kim to rethink the strategic value of his nuclear weapons program. To achieve this, the U.S. should implement a renewed maximum pressure campaign integrating stronger and smarter sanctions, enhanced military deterrence, cyber operations, and information and influence activities, in short, unrelenting pressure.\n\nSuch a campaign may increase risk and tensions in the near term. However, the U.S. and its allies have more to risk by continuing the status quo. This is because as long as the North Korean regime seeks to maintain or advance its nuclear weapon and ballistic missile programs, the regime will want to conduct periodic missile and weapons tests. Such tests would aim not only to create diplomatic provocations, but also to ensure its weapons can actually be used in wartime situations. In turn, Kim may feel emboldened to initiate a limited military operation to assert his dominance on the Korean peninsula.\n\nThe success of a new U.S. pressure campaign will depend on the Trump administration’s ability to establish a shared consensus among key allies and partners. Washington must be clear with South Korea and Japan that the objective of this new pressure campaign is to persuade Kim to permanently relinquish his nuclear and missile programs. This would entail the North Koreans and U.S negotiators reaching a consensus on defining and detailing Pyongyang’s path towards its verifiable dismantlement of its nuclear program. Such a process would include creating a comprehensive roadmap for the dismantlement process and a declaration of Pyongyang’s hitherto undeclared facilities.\n\nGiven the longstanding intransigence of the Kim family regime, optimism is hardly warranted. However, so long as the U.S. remains steadfast and committed to its alliances with South Korea and Japan, it is worth the effort to try to influence Kim Jong-un Kim Jong UnIn Syria, making America ashamed again — and weaker To tame America: Kim Jong Un's stealth mind tricks North Korea warns it may resume nuclear, ballistic missile tests MORE to make the right strategic decisions.\n\nDavid Maxwell, a 30-year veteran of the U.S. Army and a retired Special Forces colonel, is a senior fellow at the Foundation for Defense of Democracies, where Mathew Ha is a research associate. Both contribute to FDD’s Center on Military and Political Power. Follow them on Twitter @davidmaxwell161 and @matjunsuk. Follow FDD on Twitter @FDD and @FDD_CMPP. FDD is a Washington, DC-based, nonpartisan research institute focusing on national security and foreign policy.", "description": "Washington must re-think its North Korea policy, because Pyongyang shows no sign that it takes these talks seriously.", "authors": [], "top_image": "https://thehill.com/sites/default/files/kimjongun_041819getty.jpg", "published_at": "2019-10-12"}