{"pub": "news24", "url": "https://netwerk24.com/ZA/Tygerburger/Nuus/taxi-violence-spreads-to-happy-valley-20190910-2", "downloaded_at": "2019-10-15 23:07:27.052057+00:00", "title": "Taxi violence spreads to Happy Valley", "language": "en", "text": "A shootout, allegedly involving clashing taxi gangs occurred in Happy Valley on Sunday 25 August.\n\nOn the day, motorists and pedestrians travelling around the Blackheath railway station (and industrial area) were cautioned to avoid the area on the Eerste River and Surrounding Areas Facebook page.\n\nThe post described the incident as “volatile” and “dangerous”. Vehicles were reportedly attacked, and taxis set alight.\n\n“Several vehicles were stoned and shot at, allegedly by gangsters; three taxis were burnt out so far by the gangsters, after a fight between taxi operators and the gangsters in the area,” the post reads. “Police have deployed the anti-gang unit and other police forces in the area to stabilise and arrest these culprits”.\n\nPolice spokesperson Capt FC van Wyk confirmed the deployment, as well as attempts to arrange a peace talk between the affected parties so as to resolve their differences. “Several police officers and law enforcement agencies were deployed in the area, that is currently stabilised and monitored,” says Van Wyk. “This process is closely monitored by police.”\n\nHe confirms a total of four cases were registered at Mfuleni police station following the hostile affair: two cases of hijacking, and two of attempted murder. According to Van Wyk, one suspect has been arrested in conjunction with one of the attempted murder cases. Van Wyk confirms that nobody was harmed during the turmoil amidst two taxi’s being set ablaze. “In the other attempted murder case shots were fired at a private vehicle,” says van Wyk. “No one was injured.”", "description": "A shootout, allegedly involving clashing taxi gangs occurred in Happy Valley on Sunday 25 August.", "authors": ["Lebogang Tlou"], "top_image": "http://graph.facebook.com/1470345243209060/picture", "published_at": "2019-09-11"}