{"pub": "huffpost", "url": "https://huffpost.com/entry/democratic-voters-gun-control-poll-background-checks-buyback-licensing_n_5d76969fe4b075210230f64b", "downloaded_at": "2019-09-12 07:11:20.291401+00:00", "published_at": "2019-09-11", "title": "Democratic Voters Are Ready To Go Big On Gun Control", "language": "en", "text": "The first order of business for Democrats was clear. On Monday, Congress returned from its August recess, and the party’s leaders ― House Speaker Nancy Pelosi and Senate Minority Leader Chuck Schumer ― rushed to hold a press conference demanding action on gun control legislation following a trio of high-profile mass shootings during lawmakers’ monthlong break.\n\n“We’re here today for one simple reason,” Schumer declared. “Too many Americans are losing their lives to gun violence.”\n\nThe fix, Pelosi said, was to pass the same universal background check legislation in the Senate that already passed in the House.\n\nSchumer and Pelosi’s answer to gun violence, and an epidemic of mass shootings, is the same answer Democrats have been giving since at least 2013: universal background checks for gun purchases, and potentially a ban on assault weapons. As a political strategy, it’s worked: Both policies are supported by a majority of Americans, and Democratic support for gun control ― and the perception that Republicans are in hock to an increasingly unpopular National Rifle Association ― was a key reason suburban voters helped Democrats win back control of the House in 2018.\n\nBut that policy consensus may be melting away, a sign of just how quickly the political conversation around guns has shifted in favor of Democrats. Presidential candidates, led by New Jersey Sen. Cory Booker and former Texas Rep. Beto O’Rourke, are pushing for more aggressive action aimed at reducing the number of guns in American hands: a national gun licensing system and a mandatory buyback of assault weapons.\n\n“It’s pretty clear that we have too many guns. It’s too easy to buy them. It’s far too easy to possess weapons that were designed for war,” said O’Rourke, who debuted a more ambitious gun control plan, including a mandatory assault weapon buyback, after a mass shooter killed 22 people in a possible hate crime at a Walmart in his hometown of El Paso. Earlier in the campaign, O’Rourke had said even gun licensing may go “too far.”\n\nNow? “They don’t go far enough,” O’Rourke said of background checks in a phone interview. “I understand the logic of it, and at one point it was compelling enough for me. There’s a lot of consensus between Republicans and Democrats, between gun owners and non-gun owners.”\n\nMARK RALSTON via Getty Images Former Texas Rep. Beto O'Rourke has refocused his presidential campaign around gun control.\n\nGun control is expected to be a major topic during Thursday night’s presidential debate in Houston. In addition to the massacre in El Paso, a second mass shooting in the state, along with one in Dayton, Ohio, has elevated the question of how to combat gun violence ― already a major issue in the Democratic primary ― to the forefront of voters’ minds. Even if moderators don’t aggressively question candidates on it, O’Rourke is expected to make it a focus.\n\nThose more aggressive positions are supported by a majority of Democrats, according to a new HuffPost/YouGov poll. But more moderate members of the party, including some first-term members of Congress, are arguing these positions ― unthinkable just a few years ago ― are overly aggressive and unnecessary, and could turn an issue where Democrats clearly have the upper hand into a political dead weight. It’s also unclear if a Democratic Congress could muster the votes to pass the proposals ― the House is struggling to pass an assault weapons ban.\n\n“The NRA is going to make it sound like you’re making every single person’s gun illegal,” said Lanae Erickson, the senior vice president for social policy and politics at the centrist group Third Way, which has highlighted the political advantages of talking about gun control in the past. “I just don’t think it’s helpful. Why are we talking about this when it’s never going to happen anytime soon on the federal level?”\n\nThe answer is simple: because voters, especially potential primary voters, are responding. Gun licensing, the preferred policy response of many gun control advocates, has been embraced by Booker and Massachusetts Sen. Elizabeth Warren. Seventy-one percent of registered voters, and 91% of Democrats, said they support “requiring individuals to obtain a license before being able to purchase a gun.” Fifty-two percent of all registered voters support a voluntary buyback of assault weapons, including 80% of Democrats.\n\nThe politics of a mandatory assault weapon buyback, where the government would theoretically force assault weapon owners to hand over their weapons in exchange for cash, is trickier: 42% of registered voters support a mandatory program, while 44% oppose it. Still, it remains a political winner in a Democratic primary: 69% of Democrats support a mandatory buyback.\n\nWhile buybacks have received much of the attention ― California Sen. Kamala Harris and Booker endorsed them when talking with reporters in New Hampshire this past weekend, with even Pete Buttigieg, a more moderate candidate, declining to rule out a proposal ― many gun policy advocates are more excited about gun licensing.\n\n“I expect virtually every presidential candidate to have something positive to say about gun licensing. It’s effective, popular, and already being implemented in red and blue states,” said Peter Ambler, the executive director of Giffords, which is named after the former congresswoman who was shot in 2011. “I don’t see how this could possibly hurt a Democratic nominee in 2020.”\n\nThe era of triangulation is over, this notion that ... if we ask for small things, we’ll be able to work with the other side and make progress on these small things. Igor Volsky, executive director of Guns Down America Action Fund\n\nSome form of gun licensing, which requires a potential gun owner to get a permit from local or state authorities before purchasing a weapon, is already the law in 15 states, including conservative, rural states like Iowa and Nebraska. While the exact details of the laws vary from state to state, a study of Connecticut’s relatively new gun licensing law found its firearm homicide rate plummeted 40%, and its firearm suicide rate dropped by 15%.\n\n“You have to make firearms harder to get. You have to raise the standard for gun ownership,” said Igor Volsky, the executive director of Guns Down America Action Fund, which has pushed for Democrats to adopt bolder gun control policies. Speaking of Massachusetts and Connecticut, which have the strictest licensing proposals: “It’s no coincidence that they have far lower rates and far fewer guns. We know these policies save lives.”\n\nBut moderate Democrats fear gun licensing can quickly sound like a gun registry in an NRA television ad. Rep. Susan Wild, a freshman member who represents a Democratic-leaning swing district near Allentown, Pennsylvania, told reporters as much after a town hall last month.\n\n“I think that plays into people’s fears that the government is coming to take their guns,” she said. “I don’t know that I feel that we need to have some sort of federal registry or something.”\n\nIowa Rep. Cindy Axne, another first-term Democrat who represents a more rural swing district, said she believed policies beyond an assault weapons ban and background checks were unnecessary.\n\n“If we put in background checks and ban military-style assault weapons, we will virtually solve the problem,” she said. “We’ve got to be thoughtful that we’re not too onerous as well.”\n\nStill, both women support an assault weapons ban ― something the House could potentially take up this fall ― and Wild was open to an assault weapons buyback.\n\nOfficial Republican Party organs, which are in a defensive crouch on gun control, have largely ignored the new proposals, even as they criticize Democrats for left-leaning policies on immigration, climate change and economics.\n\nVolsky and other advocates point to three trends as the major reason the gun debate has shifted so rapidly. The first is the deterioration of the NRA, which has largely stopped supporting Democrats ― giving moderates little incentive to work with the group ― and now finds itself in chaos; the second is the shift, after the massacre at Marjory Stoneman Douglas High School, as Democrats saw their future voters place the issue at the top of their agenda; and the third is the collapse of the political middle in Congress more broadly.\n\n“They’re recognizing, especially after the 2016 election, is that the era of triangulation is over,” Volsky said. “This notion that the gun control movement has worked from over the past 20 years, that if we ask for small things, we’ll be able to work with the other side and make progress on these small things.”\n\nThe HuffPost/YouGov poll found 58% of registered voters support stricter gun control laws, while 35% oppose them. Eighty percent support universal background checks, while 15% of registered voters oppose them. An assault weapons ban is slightly more contentious: 58% of registered voters support one, with 32% in opposition.\n\nOther gun control proposals floated during the 2020 campaign, including Warren’s plan to raise excise taxes on guns and Vermont Sen. Bernie Sanders’ plan to ban the importation of assault weapons, are also popular. Forty-nine percent of registered voters, including 80% of Democrats, support raising taxes on guns and ammunition, while 40% oppose it. Three-fifths of registered voters support a ban on the importation of assault weapons, including 80% of Democrats. Just 28% of registered voters would oppose one.\n\nThe HuffPost/YouGov poll consisted of 1,000 completed interviews conducted Aug. 29 to Aug. 31 among U.S. adults, using a sample selected from YouGov’s opt-in online panel to match the demographics and other characteristics of the adult U.S. population.\n\nHuffPost has teamed up with YouGov to conduct daily opinion polls. You can learn more about this project and take part in YouGov’s nationally representative opinion polling. More details on the polls’ methodology are available here. Most surveys report a margin of error that represents some but not all potential survey errors. YouGov’s reports include a model-based margin of error, which rests on a specific set of statistical assumptions about the selected sample rather than the standard methodology for random probability sampling. If these assumptions are wrong, the model-based margin of error may also be inaccurate. Click here for a more detailed explanation of the model-based margin of error.", "description": "Polling shows the party’s voters back ambitious proposals from 2020 presidential candidates. But members of Congress are more cautious.", "authors": ["Senior Political Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d77f1c32300005805512b56.jpeg?cache=igvahg3eyb&ops=1778_1000"}