{"pub": "huffpost", "url": "https://huffpost.com/entry/kylie-jenner-travis-scott-tyga-rumors_n_5d960c6de4b0da7f6622c4e5", "downloaded_at": "2019-10-03 23:27:31.822286+00:00", "published_at": "2019-10-03", "title": "Kylie Jenner Breaks Silence On 'Dramatic' Travis Scott, Tyga Rumors", "language": "en", "text": "It’s Kylie Jenner versus the internet as rumors about her personal life continue to swirl.\n\nThe beauty mogul broke her silence on reports that she and rapper Travis Scott split after two years of dating and rumors that she’d boomeranged back to her ex-boyfriend Tyga.\n\n“The internet makes everything 100 times more dramatic than what it really is. There was no ‘2am date with Tyga,’” she wrote on Twitter Thursday. “You see me drop two of my friends off at a studio that he happened to be at.”\n\nThe internet makes everything 100 times more dramatic than what it really is. There was no “2am date with Tyga”. You see me drop two of my friends off at a studio that he happened to be at. — Kylie Jenner (@KylieJenner) October 3, 2019\n\nJenner reunited with the “Rack City” rapper amid her break from Scott at the Sunset Marquis hotel on Tuesday when she and a group of friends crossed paths with her ex at a recording studio on the premises.\n\nThe two previously dated on and off for years before calling it quits officially in 2017.\n\nSean Zanni via Getty Images Kylie Jenner and Tyga attend an event together in September 2016 before their split.\n\n“It wasn’t an intentional jab at Travis, but she did hangout with Tyga for a bit,” an unnamed source told E! News about the platonic run-in. “Nothing romantic is going on.”\n\nThe reality TV star also went on to note that she and Scott are committed to co-parenting their 1-year-old daughter, Stormi, seemingly confirming reports that they’d indeed split by describing their relationship as a “friendship.”\n\n“Travis and i are on great terms and our main focus right now is Stormi,” she added. “Our friendship and our daughter is priority.”\n\nTravis and i are on great terms and our main focus right now is Stormi ‼️ our friendship and our daughter is priority — Kylie Jenner (@KylieJenner) October 3, 2019\n\nJenner and Scott are “taking some time” apart after their two-year whirlwind romance came to an end weeks ago, according to multiple reports, as they apparently clashed when it came to lifestyle differences.\n\n“Kylie is all about family life and really wants a second baby,” an unnamed source told People about their split. “He hasn’t been giving her the commitment that she needs. Travis isn’t ready to give her all that she wants.”\n\nJon Kopaloff via Getty Images Travis Scott, Stormi Webster and Jenner attend the premiere of Netflix's \"Travis Scott: Look Mom I Can Fly\" in September.\n\nJenner hasn’t exactly played coy about her desire to give Stormi a sibling, writing in a birthday post to Scott back in April “let’s fuck around and have another baby.”\n\nThe two were last seen together at the premiere of Scott’s Netflix documentary, “Travis Scott: Look Mom I Can Fly,” where the couple showed up on the red carpet together with their daughter.\n\nBut since then, Jenner has stepped out solo and was noticeably sans a date at Hailey Baldwin and Justin Bieber‘s wedding on Monday evening, which she attended with Stormi; her mom, Kris Jenner; and sister Kendall Jenner.\n\nThis article has been updated with more background information.", "description": "The beauty mogul seemingly confirmed that she's indeed single once again.", "authors": ["Entertainment Writer"], "top_image": "https://img.huffingtonpost.com/asset/5d960cf0210000a40251fde0.jpeg?cache=3lunqkpkvs&ops=1778_1000"}