{"pub": "realclearpolitics", "url": "https://realclearmarkets.com/articles/2019/10/24/with_citgo_juan_guaido_is_offering_trump_a_false_choice_103954.html", "downloaded_at": "2019-10-24 13:58:29.094030+00:00", "title": "With Citgo, Juan Guaido Is Offering Trump a False Choice", "language": "en", "text": "In recent weeks, the Middle East has been the focus of debate about the Trump Administration’s foreign policy – and whether or not the President has made a strategic error in abandoning some erstwhile allies in the region.\n\nIn a matter of days, attention will likely turn back to another of the President’s key foreign policy decisions – this time in Venezuela. The Trump Administration displayed bold diplomacy in recognizing Juan Guaidó as the Interim President of Venezuela, given the clearly illegitimate nature of Nicolas Maduro’s regime. Despite the U.S. support – and that of dozens of other countries – Guaidó has been unable to dislodge Maduro, and political stalemate reigns in the country, threatening a significant policy headache for the Trump Administration.\n\nOn October 28, a bond payment will come due on Venezuela’s state oil monopoly, PdVSA – almost $1 billion will be due to bondholders, and if Venezuela does not pay, it will default. This possible outcome poses both economic and political questions that will reverberate loudly in the halls of Washington, and on the factory floors across several U.S. cities. Why? Because PdVSA is the owner of Citgo, a major U.S. oil refiner that holds 5% of U.S. refining capacity – and PdVSA put up a majority stake (50.1%) in Citgo as collateral on its 2016 bond sale. Now, if default happens, the creditors can take possession of the Citgo shares to which they are entitled under New York law where the bond was issued.\n\nThis being Venezuela, of course, things are never that simple. First, PdVSA is under sanctions as part of the Trump Administration’s broad sanctions regime targeted at Maduro which would prevent anyone – including bondholders – from making economic transactions with PdVSA. But the Trump Administration solved that problem earlier by issuing ‘General License 5’, which specifically allows the PdVSA bond contract to remain in force. This means the bondholders can assert their rights come October 28.\n\nHowever, there is another complicating factor, and it involves Guaidó. Having been recognized by the U.S. courts as Interim President, Guaidó has used his status to exert control over Venezuelan assets abroad – including Citgo. Guaidó has even appointed an ad hoc Board for the Houston-based refiner. His interest, though, is more than political or technocratic. The Guaidó movement desperately needs cash to finance its continued struggle inside Venezuela – and Citgo is a potential gold mine. Guaidó has been lobbying the White House for an Asset Protection Order (APO), a quasi-judicial process that would mean PDVSA didn’t have to pay any of its obligations in the United States (and would, thus, retain the spare cash that Guaidó so covets).\n\nThis presents a tough decision for the Trump Administration. On one side sits the rule of law, sanctity of contracts and private property – and of course the fact that the bondholder class includes major U.S. pension funds, in particular thousands of teachers in states like Ohio, Wisconsin and Texas. On the other hand sits the survival chances of a Venezuelan opposition leader upon whom the Administration has placed a great amount of hope and little diplomatic capital.\n\nCan the Trump Administration, in an election year, really prioritize the interests of an unproven foreign leader ahead of the interests (and economic needs) of thousands of U.S. teachers and their pensions? Surely not: and the Administration would be right not to do so. This is not just politics – there are significant principles at stake. Juan Guaidó is our friend and ally, but he is fighting for his political life and sees Citgo’s assets as his to spend towards that goal. He is playing President Trump by framing the choice as one between supporting Maduro or supporting his revolution. That is a false choice, and Trump needs to tell him so.\n\nThere is a better option available: in international finance, there is always room for a negotiated settlement. All that is needed is goodwill on both sides of the table. Here, it seems that bondholders ready to negotiate, but Guaidó has appeared inflexible, the lure of Citgo’s loot may simply be too strong. This is where the Trump Administration can make a positive difference. As the only real superpower in this story, America’s endorsement of Guaidó was the most significant element in his rise to fame and power. That provides leverage – and it must be used. Prevail upon Guaidó to defuse the situation, enter negotiations, and resolve this tricky problem amicably. President Trump has shown no compunction in speaking firmly with other leaders: it is surely now the time to deploy that firmness with our friend Juan Guaidó and press him to make a deal.\n\nThe PdVSA / Citgo issue is not intractable, far from it. Political will is needed from Guaidó– but to get there, political pressure will be needed from Washington D.C. The clock is ticking down to October 28, and the worst of all outcomes would be to strengthen Maduro further. Guaidó is about to discover that he has indeed campaigned in poetry – and captured the attention of the world – but governing in prose is now called for, for the sake of his country and to avoid a damaging default. The U.S. must apply all possible pressure to ensure that the sober, mature path of negotiations is followed. The last thing that Venezuela needs is more intransigence.", "description": "In recent weeks, the Middle East has been the focus of debate about the Trump Administration\u0092s foreign policy \u0096 and whether or not the President has made a strategic error in abandoning some...", "authors": [], "top_image": "https://assets.realclear.com/images/47/472539_5_.jpg", "published_at": "2019-10-24"}