{"pub": "investing.com", "url": "https://bitcoinist.com/major-chinese-bank-invests-in-popular-bitcoin-wallet", "downloaded_at": "2019-10-28 09:54:37.306109+00:00", "title": "Chinese Bitcoin FOMO: Major Bank Invests in Popular BTC Wallet", "language": "en", "text": "Bitcoin News Chinese Bitcoin FOMO: Major Bank Invests in Popular BTC Wallet\n\nChinese bitcoin FOMO appears to be on the rise as a major bank has reportedly invested in a local wallet platform. This report marks another significant crypto and blockchain-related development from China as the country appears to be moving towards government-approved adoption.\n\nChina Merchants Bank Invests in BTC Wallet Service\n\nTweeting on Monday (October 28, 2019), Dovey Wan co-founder of Primitive Ventures revealed that China Merchants Bank has invested in BitPie — a non-custodial bitcoin wallet service.\n\nChina… China Merchant Bank just announced invested in BitPie, the Bitcoin wallet with longest history and most users back in China … 😳😳😳 Tho it's a non-custodial wallet there can be a non-zero chance ….[redacted] 🤐🤐🤐 — Dovey 以德服人 Wan 🗝 🦖 (@DoveyWan) October 28, 2019\n\nAccording to Wan, BitPie is the longest-serving bitcoin wallet platform in China, with the most users. The investment in BitPie comes only a couple of months after the bank’s shares fell 13.7% amid ongoing investigations in the U.S. for involvement with North Korean state actors.\n\nFor Wan, however, the move is part of a growing trend of crypto and blockchain nationalization in China. The Primitive Ventures chief, remarked:\n\nAll I can say is this to me it’s a sign of [the] beginning of the nationalization of Bitcoin/Cryptocurrency related infra in mainland [China]. Eventually, all things can be state-owned, or at least partially (mining, ASIC, exchanges, wallets, etc).\n\nDespite the 2017 ban on crypto trading and initial coin offerings (ICOs), p2p trading is allowed in China. There are even reports that major exchanges run bitcoin over-the-counter (OTC) desks via marketplaces on popular Chinese payment services like Alipay and WeChat Pay.\n\nChinese Bitcoin FOMO on the Rise\n\nIf Wan’s deductions prove accurate, then there could be a wave of institutional involvement in bitcoin and cryptos in general. Such a development could provide a further boost to the already growing retail crypto interest in China.\n\nCome next year, the cryptography law will come into effect. Reports suggest that the new law aims to provide a robust regulatory framework for crypto and blockchain technology, as well as, making China more competitive in the emerging digital landscape.\n\nAs previously reported by Bitcoinist, bitcoin FOMO in China is on the rise. Since the country’s President XI Jinping made mention of blockchain technology, there has been a surge of positive interest sweeping across the country.\n\nSearch trends from Chinese search engines like Baidu show a significant uptick in bitcoin and crypto interest. Also, Chinese altcoins like NEO and ONT have been coasting on this positive wave of enthusiasm with massive price gains.\n\nDo you think China is moving towards the nationalization of it’s crypto and blockchain industry? Let us know in the comments below.\n\nImages via Shutterstock, Twitter: @DoveyWan\n\n", "description": "Chinese bitcoin FOMO appears to be on the rise as a major bank has reportedly invested in a local wallet platform. Read on.", "authors": ["Osato Avan-Nomayo", "Christine Vasileva", "Emilio Janus", "Martin Young", "Anatol Antonovici"], "top_image": "https://bitcoinist.com/wp-content/uploads/2019/10/28th-October-3-1920x1200.jpg", "published_at": "2019-10-28"}