{"pub": "washingtonpost", "url": "https://washingtonpost.com/lifestyle/food/the-stars-of-the-show-at-cut-by-wolfgang-puck-might-surprise-you/2019/09/11/a7499f9c-ca9a-11e9-a1fe-ca46e8d573c0_story.html", "downloaded_at": "2019-09-18 23:20:40.307225+00:00", "title": "Cut by Wolfgang Puck review: At D.C.'s newest steakhouse, the stars of the show might surprise you", "language": "en", "text": "\n\nA tomahawk steak sits in front of the open kitchen at Cut by Wolfgang Puck in the Rosewood Hotel in Georgetown. (Deb Lindsey/For The Washington Post)\n\nFood critic\n\n(Good/Excellent)\n\nI was of two minds when news broke that the freshly minted Rosewood Hotel in Georgetown planned to host the eighth Cut by Wolfgang Puck.\n\nOn the one hand, I have fond memories of dinner at the California chef’s first steakhouse, in Los Angeles, the weekend of the 2006 Academy Awards. The meal held its own against the scenery, which found me sitting next to “Grey’s Anatomy” star Sandra Oh and mere tables away when Tom Cruise and Katie Holmes slipped through a side door and strolled through the exhibition kitchen shortly before their daughter Suri came into the world. A true Hollywood moment!\n\n[Tom Sietsema’s favorite places to eat right now]\n\nDifferently, I felt Washington had reached a tipping point (again) with steakhouses, no matter their lineage or the size of their grills.\n\nWith three meals at Cut behind me, I still feel that way. The market doesn’t crave more meat, try as hard as this restaurant sometimes does to promote it. “I’ve got dinner for you!” a smile in a suit announces as companions and I are perusing menus. Everyone’s eyes widen. The gent’s hoisting a tomahawk — 40 ounces of crimson prime rib-eye — on a black walnut board. “Dry-aged 50 days,” the attendant says. Ten inches of jutting bone add to the spectacle.\n\n\n\nCharred leeks with toasted hazelnuts, Tuscan olive oil and preserved Meyer lemon. (Deb Lindsey/For The Washington Post)\n\nOra king salmon with ramp kimchi and apple. (Deb Lindsey/For The Washington Post)\n\nIt would be easy for Wolfgang Puck to phone it in at this stage of his long and varied career. One of America’s original celebrity chefs, the Austrian native, 70, counts 26 restaurants in his far-flung empire and walls of awards to his credit, a Michelin star for the original Cut included. Puck isn’t merely going through the motions in Washington, however. Instead, he and Andrew Skala, 39 — a Puck protege whose 12-year tenure with the master most recently found him at the Cut in New York — have composed a menu for the times that’s well supplied with vegetables and seafood, occasionally in cunning guises.\n\n[Market Lunch may be the only thing in town that brings both parties to the table]\n\nYou may think you know what charred leeks will look like. You will be surprised to encounter a vegetable that’s been cooked over coals, freed from its blackened exterior and spread across a plate: “Flat onion soup!” a friend says admiringly of the presentation. The soft interior of the leeks has the supple texture of fresh pasta; a shower of toasted hazelnuts and a ginger-sparked vinaigrette transform the vegetable into a sumptuous salad. Eggplant is roasted in the fire as well, until its outside caramelizes and its flesh turns creamy. The starter is served with a green curry whose herbs and chiles are ground with a mortar and pestle, assuring brightness, and garnished with crushed peanuts.\n\n\n\nBlue crab fried rice with country smoked ham, sweet corn and garlic chives. (Deb Lindsey/For The Washington Post)\n\nUnless it’s Chiko, your neighborhood Asian carryout has nothing on the seafood fried rice at Cut, which mixes smoked ham in the grains and bundles the rice in a lacy egg crepe, then tops it with nuggets of blue crab and a delicately sweet wash of garlic and oyster sauce. Washington’s Cut is one of only two to offer a seafood bar. From the civilized lounge off the lobby come raw fish dishes that are as beautiful as they are refreshing. Coconut milk floats slices of rockfish that are rousing with lime and crisped with rice in one first course, enjoyed with a tapioca chip for scooping. Lusher still are coins of scallops decorated with summery minced peaches, fiery serrano chile and sea salt for faint crunch.\n\nThe pastas taste as if they passed through a silk mill before they reach you. Sage-scented tortelloni oozes mascarpone, ricotta and corn when you bite down. A neat heap of tagliatelle scattered with sweet crab and torn basil is simple and lovely.\n\n[In Richmond, two new enchanting reasons to drive and dine]\n\nA hotel restaurant is almost as obligated to serve chicken as it is to offer room service. Cut raises the bar with a sunny marinade of lemon and oregano and an equally bright chimichurri around the chicken. Its black patches reveal time on the same Grillworks grill that give the New York sirloin and filet mignon their sizzle.\n\nA chorus of hellos follow you from host stand to table and just as many staff thank you as you depart. Service is well-meaning, if sometimes intrusive. The best interruptions involve something being made or finished tableside. In view of recipients, Cut presents a duck, along with einkorn flour tortillas and Bing cherries (DIY tacos!) and completes a dark chocolate souffle by splitting its hot dome to accommodate a scoop of coconut-pecan ice cream. Worth the 15-minute wait. There are few bargains, but plenty of treats, on the wine list. The night of the shared $130 tomahawk steak, a sommelier chose an almost-as-dear bottle of Keenan cabernet sauvignon to wash it back. Cassis and blackberry notes followed.\n\n\n\nExecutive chef Andrew Skala presents dishes in the kitchen at Cut. (Deb Lindsey/For The Washington Post)\n\nSkala, a native of Cleveland, says he spent a year or so getting to know Washington and finding purveyors for Cut. Time well spent. Seylou Bakery is behind the brown bread at lunch (dinner features the restaurant’s own soft pretzel rolls and flaky “everything” biscuits). Oysters can be splashed with a local luxury, a mignonette made with Lindera Farms floral Black Locust vinegar. A section called “nose to tail” gathers steaks from suppliers as close as Seven Hills Food in Virginia and as far away as Miyazaki prefecture in Japan.\n\nSadly, for all the hype surrounding the tomahawk, the meat didn’t deliver. Sure, it was cooked to the degree of doneness we requested. But my search team failed to find the depth of flavor — the mineral tang — expected of long-aged beef. Sauce, please.\n\n[At Punjab Grill, there are plenty of gilt-y pleasures]\n\nIf it’s anything but steak you want, branch out and try a youthful Puck memory, veal Holstein schnitzel with jolts from capers and anchovies, or an organ meat. Veal sweetbreads are just as fans desire them — gently crisp to begin and creamy after that — and their richness is nicely countered with a salsa verde made with black garlic and Bing cherries in late summer. Two pounds of Maine lobster is two pounds of sublime eating. The usual butter is replaced by aji amarillo, and I prefer the saucy novelty. Diners are encouraged to round out their entrees with a side dish or two for sharing. Avoid the strangely sweet mushrooms with shishito peppers in favor of the puffy potato tarte Tatin swirled with roasted onions.\n\n\n\nDark chocolate souffle. (Deb Lindsey/For The Washington Post)\n\nKeep in mind Puck’s Austrian roots and finish with kaiserschmarren, a pancake with the fluffiness of a souffle that’s torn to pieces and served with macerated strawberries.\n\nReached by walking past a wall of wine, the dining room, plainly decorated in brick but offering a canal view, comes with some unfortunate design flaws: chairs whose backs end right in the middle of diners’ backs and acoustics likely to dissuade you from staying for dessert.\n\nNot every meal sounds as if there’s a jackhammer in the room, but one dinner stood out for lingering at 95 decibels. My party couldn’t wait to get outside, where I mulled the possibility of lowering a restaurant rating for the noise alone, as numerous readers have asked me to do over the years.\n\nSurely Cut wants to be remembered for its cooking, which can be wonderful, rather than its clamor: singing taste buds vs. ringing ears.\n\nFor stories, features such as Date Lab, Gene Weingarten and more, visit WP Magazine. Follow the Magazine on Twitter. Like us on Facebook. Email us at wpmagazine@washpost.com.", "description": "2.5 stars | D.C. doesn’t need just another steakhouse — and this isn’t one.", "authors": ["Tom Sietsema", "Food Critic", "September At Am", "Tom Sietsema Has Been The Washington Post'S Food Critic Since He Previously Worked For The Microsoft Corp.", "Where He Launched Sidewalk.Com", "The Seattle Post-Intelligencer", "The San Francisco Chronicle", "The Milwaukee Journal. He Has Also Written For Food"], "top_image": "https://www.washingtonpost.com/resizer/SRu_9adReO8Nc7XhiwQQIEmQcqQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DPFM2XWN5EI6TJRABKIWK3L5WY.jpg", "published_at": "2019-09-11"}