{"pub": "cnn", "title": "Italian Prime Minister Giuseppe Conte returns as the country patches a new government back together", "url": "https://cnn.com/2019/08/29/europe/italy-new-government-five-star-movement-democratic-party-coalition-intl/index.html", "language": "", "published_at": "2019-08-29", "downloaded_at": "2019-09-02 07:08:03.221263+00:00", "text": "Rome (CNN) Nine days after he resigned when Italy's government collapsed, Giuseppe Conte has returned as Prime Minister to form a new one that will exclude hardline leader Matteo Salvini from power.\n\nItaly's president re-appointed Conte to the role on Thursday, as the political crisis plaguing the country in recent weeks began to subside.\n\nConte will lead a new government comprised of the anti-establishment Five Star Movement (M5S) and the center-left opposition Democratic Party (PD) . The rival parties agreed Wednesday to form a coalition to prevent snap elections that would likely have been won by Salvini's far-right League party.\n\nConte accepted the role with reservation, saying Thursday that he would immediately start working with all parliamentary groups, and that Italy must return to being an advocate for Europe and \"a country which is open to everyone.\"\n\n\"This is a moment for courage and determination -- a determination which will not be dogged by obstacles,\" he said.\n\nThe previous coalition between M5S and the League Party fell apart last week after months of infighting over key policies. Hoping to seize on his rise in popularity, Salvini pushed for a no-confidence vote on Conte, but the plan backfired after he was excluded from the new government.\n\nIn a bitter, live address on Facebook Thursday, Salvini hit back at Conte's re-appointment and called the formation of the new coalition \"a real theft of democracy\" that doesn't represent the Italian people.\n\nHe then called on his supporters to mobilize throughout the country in September and to come together in a massive rally on October 19 in Rome.\n\n\"Rest assured you won't get rid of me,\" Salvini said. \"I don't give up easily.\"\n\nOn Wednesday, Salvini told reporters that the \"only thing that unites them (M5S and PD) is their hatred of the League\" and that the \"the truth is that 60 million Italians are being held hostage by 100 parliamentarians who are dead scared of losing their seats.\"\n\n'A new humanism'\n\nSalvini and his euroskeptic, anti-immigrant, xenophobic right-wing League party -- who were once seen as a fringe movement -- had seen a massive boost in popularity across the country since last year's parliamentary elections.\n\nBut for many who had feared Italy was walking down a dangerous path, his fall from parliamentary power this week will be hailed as a victory.\n\nSalvini had run on a promised to expel half a million illegal immigrants from Italy. During his time as the interior minister, the firebrand populist only amped up that rhetoric, often slugging at migrant and minority communities with incendiary remarks, such as implying that the country's low birth rate -- which is tied to the country's sluggish economy-- was being used as an excuse to \"import immigrants.\" He also spearheaded a series of anit-migrant policies, including shuttering Italy's ports to rescue vessels in the Mediterranean.\n\nSalvini's push for new elections ultimately backfired.\n\nThe Five Star movement is also an anti-globalization, anti-free trade party which had gained ground with an electorate fed up with Italy's economic decline and its mainstream politicians. Their policies include a push for more environmental protections, public transport, free access to water sustainable development and the right to internet access.\n\nThe center-left Democratic Party, who had suffered a blow to its leadership in the 2018 elections following the populist parties' gains, will now work together with anti-establishment M5S.\n\nOn Wednesday, those party's leaders told Italy's President Sergio Mattarella that Conte should lead the new government once again.\n\nSpeaking on Thursday, Conte spoke optimistically about the future. He said that while he has often made public addresses that referenced the term \"a new humanism,\" he \"never thought this could be a slogan for government -- I have always thought of it as the ideal vision for the entire country.\"\n\nNicola Zingaretti, the PD's leader, said Wednesday that the coalition marked a \"real turning point\" for Italy, and stressed that it was \"not just a handover of power.\"\n\n\"We love Italy and we believe that it is worth trying this experiment,\" Zingaretti told reporters.\n\nConte, a law professor who had never held political office prior to his appointment, became prime minister in June 2018, the compromise choice to lead the previous coalition of populist parties.\n\nIn his speech on Thursday, Conte noted he had \"more than one doubt\" about taking that role again but that he had \"overcome those doubts.\"\n\n\"It will be full of obstacles but I am passionately committed to the task for this country that I love,\" Conte said. The prime minister also announced he would appoint new government ministers over the coming days.", "description": "Nine days after he resigned when Italy's government collapsed, Giuseppe Conte has returned as Prime Minister to form a new one that will exclude hardline leader Matteo Salvini from power.", "authors": ["Livia Borghese", "Kara Fox"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190829095552-italian-prime-minister-giuseppe-conte-file-super-tease.jpg"}