{"pub": "yahoo", "url": "https://sports.yahoo.com/bill-belichick-reacts-release-ben-224948485.html", "downloaded_at": "2019-10-08 13:00:48.483485+00:00", "title": "Bill Belichick reacts to release of Ben Watson: 'There wasn't a roster spot'", "language": "en", "text": "The New England Patriots released tight end Benjamin Watson on Monday, leaving him free to sign with any other team.\n\nThe 38-year-old veteran was suspended for the first four games of the regular season because of a failed drug test. He was eligible to return in Week 5 against the Washington Redskins but wasn't activated by Saturday's deadline.\n\nBill Belichick was asked about the decision to part ways with Watson during his Monday afternoon appearance on WEEI's \"Ordway, Merloni and Fauria\", and the Patriots head coach said it came down to not having a roster spot available.\n\nScroll to continue with content Ad\n\n\"Just don't have a roster spot. We only have so many roster spots. If we put somebody on, we have to take somebody off,\" Belichick explained. \"Right now, there wasn't a roster spot. We didn't feel like there was somebody we could create a roster spot with. Everybody came out of the game healthy. We have a decent team. So, I think that's where we're at.\"\n\nThe Patriots haven't received a ton of production from tight ends Ryan Izzo and Matt LaCosse through five games, although Sunday's win over the Redskins was a step in the right direction for both players. New England's decision to carry three quarterbacks on the roster also is an interesting one.\n\nWhat's next for Watson? Not retirement, according to NFL Media's Ian Rapoport.\n\n#Patriots TE Ben Watson, who was not activated today by New England meaning his tenure is over, does want to keep playing, I'm told. So retirement gets pushed off against as he looks for a new home. — Ian Rapoport (@RapSheet) October 7, 2019\n\nStory continues\n\nWatson should be able to help a contender. He tallied 35 receptions for 400 yards and two touchdowns with the New Orleans Saints last season. He has a wealth of playoff experience, too.\n\nClick here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device.\n\nBill Belichick reacts to release of Ben Watson: 'There wasn't a roster spot' originally appeared on NBC Sports Boston", "description": "The New England Patriots released tight end Benjamin Watson on Monday, leaving him free to sign with any other team.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/oX_OjyGMyCBnlmn.8JYfeQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MTkuMDQzODI0NzAxMTk1Mw--/https://s.yimg.com/uu/api/res/1.2/NxV6g.mVffHVOugmSycc9Q--~B/aD00MjM7dz03NTM7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/csnne.com/10236a3c289fe11c0d31a7ab98a9d385", "published_at": "2019-10-07"}