{"pub": "yahoo", "url": "https://news.yahoo.com/trump-hails-syria-cease-fire-040351337.html", "downloaded_at": "2019-10-18 04:53:53.513053+00:00", "title": "Trump hails Syria cease-fire after playing role in crisis", "language": "en", "text": "ANKARA, Turkey (AP) — President Donald Trump framed the U.S.-brokered cease-fire deal with Turkey as \"a great day for civilization\" but its effect was largely to mitigate a foreign policy crisis widely seen to be of his own making.\n\nAfter hours of negotiation in Ankara, the two nations on Thursday agreed to a five-day cease-fire in the Turks' deadly attacks on Kurdish fighters in northern Syria. The Kurds were U.S. allies in the fight against the Islamic State but came under assault after Trump ordered U.S. troops to leave the area earlier this month.\n\nThe agreement requires the Kurds to vacate a swath of territory in Syria along the Turkish border in an arrangement that largely solidifies Turkey's position and aims in the weeklong conflict.\n\nU.S. Vice President Mike Pence, who reached the deal with Turkish President Recep Tayyip Erdogan, hailed the agreement as the way to end the bloodshed caused by Turkey's invasion.\n\nBut he remained silent on whether it amounted to a second abandonment of America's former Kurdish allies, many of whom are branded as terrorists by Ankara. The deal includes a conditional halt to American economic sanctions and no apparent long-term consequences for Turkey for its actions.\n\nTurkish troops and Turkish-backed Syrian fighters launched their offensive against Kurdish forces in northern Syria a week ago, two days after Trump suddenly announced he was withdrawing the U.S. military from the area.\n\nTrump was widely criticized for turning on the Kurds, who had taken heavy casualties as partners with the U.S. in fighting IS extremists since 2016.\n\nWhile U.S. officials have insisted that Trump did not authorize Turkey's invasion and only that he was not persuasive enough in making the case against it to Erdogan, the cease-fire codifies nearly all of Turkey's stated goals in the conflict.\n\nTurkish Foreign Minister Mevlut Cavusoglu said the United States had accepted the idea of a \"safe zone\" long pushed by Turkey, and he insisted Turkish armed forces will control the zone. He also made clear that Turkey will not stop at a previously limited zone; he said Turkish control of the Syrian side of the border must extend all the way to the Iraqi border.\n\nCaught in the middle, the commander of Kurdish-led forces in Syria, Mazloum Abdi, told Kurdish TV, \"We will do whatever we can for the success of the cease-fire agreement.\" But one Kurdish official, Razan Hiddo, declared that Kurdish people would refuse to live under Turkish occupation.\n\nTrump seemed to endorse the Turkish aim of ridding the Syrian side of the border of the Kurdish fighters. \"They had to have it cleaned out,\" he said.\n\nDuring a campaign rally in Texas Thursday night, Trump said, \"Sometimes you have to let them fight, like two kids in a lot, you got to let them fight and then you pull them apart.\"\n\nIn the negotiations, a senior U.S. official said, Pence and national security adviser Robert O'Brien expressed condolences to Erdogan and his military commanders over their dead and injured in the week-long campaign.\n\nLeading U.S. lawmakers were less than pleased than Trump.\n\nSen. Mitt Romney, the Republicans' presidential nominee in 2012, said he welcomed the cease-fire but wanted to know what America's role in the region would be and why Turkey was facing no consequences for its invasion.\n\n\"Further, the cease-fire does not change the fact that America has abandoned an ally,\" he said on the Senate floor.\n\nA senior U.S. official insisted that the agreement was negotiated in consultation with Kurdish forces and Pence said the U.S. would \"facilitate\" the Kurds' pullout, but he did not say if that would include the use of American troops.\n\nThe Pentagon had no immediate comment.\n\nAs Pence was speaking in Ankara, U.S. troops were continuing to board aircraft leaving northern Syria. Officials said a couple of hundred had already departed, with hundreds more consolidated at a few bases waiting to move out.\n\nSen. Lindsey Graham, a Trump confidant who has criticized the president's pullout, said he thinks U.S. troops will be needed as part of an effort to implement and enforce a halt to the fighting.\n\n\"There's just no way around it,\" he said. \"We need to maintain control of the skies\" and work with the Kurds.\n\nWhile the cease-fire seemed likely to temporarily slow legislation in Congress aimed at punishing Turkey and condemning Trump's U.S. troop withdrawal, lawmakers gave no sign of completely dropping the measures.", "description": "President Donald Trump framed the U.S.-brokered cease-fire deal with Turkey as \"a great day for civilization\" but its effect was largely to mitigate a foreign policy crisis widely seen to be of his own making.  After hours of negotiation in Ankara, the two nations on Thursday agreed to a five-day", "authors": ["Zeke Miller"], "top_image": "https://s.yimg.com/uu/api/res/1.2/z1FgAIJD0Fhe_U_0SmnenQ--~B/aD0zMDk2O3c9NDY0NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/51aa6f19d5078aab7777a5c40f3a0994", "published_at": "2019-10-18"}