{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/3/book-review-working-winston", "downloaded_at": "2019-09-03 23:43:07.045765+00:00", "title": "BOOK REVIEW: 'Working With Winston'", "language": "en", "published_at": "2019-09-03", "text": "ANALYSIS/OPINION:\n\nIn the age of unsung women, they made global history and it was perhaps the most unlikely of men who led them.\n\nWinston Churchill represented the past far more than the future. Born in Blenheim Castle, grandson of the Duke of Marlborough, he embodied the English aristocracy, becoming a maverick rebel of a politician and taking on Hitler, the German dictator, at a time when Wold War II was underway with the Nazi threat looming. The British empire was at risk. It was also a time when women were hardly even second-class citizens, scrambling for low-level jobs and excluded from social or political prominence. From their ranks Churchill chose his secretaries, which was hardly an accolade in those days, but they emerged as a new breed who are credited with helping him win the war.\n\nThose who became part of the prime minister’s army were armed with pencils and notepads and the conviction that they were better than anyone thought they were, on many levels — and working for Churchill let them prove it. And it was no fun. They worked day and night doing what their boss called “taking down,” which meant bringing to life the words that became immortal to a nation struggling to survive.\n\nIn the foreword, Randolph Churchill, the prime minister’s grandson, emphasizes that these women endured Winston’s behavior under the most trying of circumstances. “This is Churchill at work … under severe stress, with work habits that could only be described as eccentric.”\n\nAs told in oral histories, diaries and memoirs, a Churchill secretary’s working day began invariably at 8 a.m. in his bedroom, where he began to read papers and dictate his famous “action day memoranda” on everything from the conduct of the war to his next home production project. He dictated, army officers talked, secretaries scribbled frantically, a pet budgerigar perched on his head, his cigar was lit. “A veritable circus” was how one secretary described it. And he was not easy to work for.\n\nHe was a man of his time, impatient, arrogant and brilliant yet oddly lovable to a group of women drawn from all levels of society who displayed the kind of loyalty that verged on devotion and who often returned to work for him after the war. They were what Churchill called his “secret circle,” the author writes.\n\n“You can hear in their voices the self-confidence that allowed them to serve without being servile to work when confronted with a boss in his bed or his bath.” In private they called him “the old man” and built their own world that clashed yet meshed with his. And they accepted the limitations that still governed social life in Britain.\n\nThe author emphasizes, “These extraordinary women tell us much about the man that we could not learn from his self-description or from reports of colleagues to whom he had reason to defer, to charm or to heed. We see through the eyes of these women what Churchill, a consummate actor, revealed of himself … how he treated his subordinates, women he had no reason to impress. It is to these tales that we turn.”\n\nMs. Stelzer has come up with an extraordinary collection of memories from women who were as extraordinary as their boss because they understood each other in a way that transcended the social and the mundane. They treasured Churchill and he treasured them. For its insight into small strange world, the book should be treasured.\n\n• Muriel Dobbin is a former White House and national political reporter for McClatchy newspapers and the Baltimore Sun.\n\n• • •\n\nWORKING WITH WINSTON: THE UNSUNG WOMEN BEHIND BRITAIN’S GREATEST STATESMAN\n\nBy Cita Stelzer\n\nForeword by Randolph Churchill\n\nPegasus, $28.95, 400 pages\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "In the age of unsung women, they made global history and it was perhaps the most unlikely of men who led them.", "authors": ["The Washington Times Http", "Muriel Dobbin"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/03/SAXoPicture-07D6061C-156808829_c0-0-878-511_s1770x1032.jpg?6d32a95e7b1635f0101061f3b85a16213b477a26"}