{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/former-ottawa-rough-riders-head-coach-george-brancato-dead-at-88-1.5332010", "downloaded_at": "2019-10-24 04:35:53.582324+00:00", "title": "Former Ottawa Rough Riders head coach George Brancato dead at age 88 | CBC News", "language": "en", "text": "George Brancato, who won Grey Cups with the Ottawa Rough Riders as a player, assistant coach and head coach, has died. He was 88.\n\nThe Redblacks, Ottawa's current CFL team, confirmed Brancato's death in an email Wednesday. Brancato, a native of Brooklyn, N.Y., was a halfback/defensive back with Ottawa from 1957-62.\n\nThe five-foot-seven, 177-pound former LSU star earned his first Grey Cup as a player with the Riders in 1960 before claiming a second in '73 as an assistant coach with the club.\n\nHe took over as Ottawa's head coach in 1974 when Jack Gotta left the CFL team for Birmingham of the now-defunct World Football League.\n\nAfter capturing the Annis Stukus Trophy as the CFL's top coach in 1975, Brancato guided the Riders to a 23-20 Grey Cup win over Saskatchewan in 1976 in Toronto.\n\nTight end Tony Gabriel cemented the victory for Ottawa with a 24-yard TD grab late in the fourth quarter from quarterback Tom Clements, a play affectionately dubbed \"The Catch.\"\n\nIn a 2016 interview, Brancato told the story of the Ottawa Rough Riders' Grey Cup win over Saskatchewan in 1976. Tight end Tony Gabriel cemented the victory with a grab late in the fourth quarter from quarterback Tom Clements. 2:00\n\n'The Ice Man'\n\nBrancato and the Riders narrowly missed registering the biggest upset in Grey Cup history five years later. After finishing the regular season with a 5-11 record, Ottawa surged to a 20-1 halftime lead over the heavily favoured Edmonton Eskimos (14-4-1). But the Eskimos, with Hall of Fame quarterback Warren Moon, rallied for the 26-23 victory at Montreal's Olympic Stadium. Kicker Dave Cutler's 27-yard field goal late in the fourth quarter provided Edmonton with the fourth of its five straight CFL titles (1978-82).\n\nBrancato was fired following the '84 season after the Riders posted a 4-12 record. He compiled an 82-90-4 regular-season record with the Riders, finishing behind only the legendary Frank Clair (116) in victories. Brancato's teams were 8-10 in the playoffs.\n\nGeorge Brancato, left, with Jordan Case. (Scott Grant) It was during his CFL coaching tenure that Brancato earned the nickname \"The Ice Man,\" because he routinely chewed ice on the sidelines.\n\nReturned to coaching\n\nBrancato returned to coaching in 1989 with the Arena Football League's Chicago Bruisers. After the franchise folded, he served as an assistant with the Dallas Texans.\n\nHe rejoined the Riders in 1993 as a special-teams and secondary coach on Ron Smeltzer's staff. The following year he was an offensive co-ordinator with the expansion Shreveport Pirates.\n\nBrancato was also an assistant coach with Saskatchewan (1985-86). He finished his coaching career in the AFL with Anaheim and Florida, retiring after the '99 campaign.\n\nBrancato played both offence and defence, spending time in the NFL with the Chicago Cardinals (1954-55). He made his CFL debut as a running back with the Montreal Alouettes in 1956 and played mostly on defence with Ottawa but still made appearances on the offensive side of the ball.\n\nBrancato was a CFL all-star in 1961 and was inducted into the Ottawa Sports Hall of Fame in 2002.", "description": "George Brancato, who won Grey Cups with the Ottawa Rough Riders as a player, assistant coach and head coach, has died. He was 88.", "authors": ["The Canadian Press"], "top_image": "https://i.cbc.ca/1.5332155.1571849487!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/brancato.jpg", "published_at": "2019-10-23"}