{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/usc-frosh-qb-kedon-slovis-returns-to-start-at-notr", "downloaded_at": "2019-10-09 04:34:55.429625+00:00", "title": "USC frosh QB Kedon Slovis returns to start at Notre Dame", "language": "en", "text": "LOS ANGELES (AP) - Freshman quarterback Kedon Slovis will return from an apparent concussion to start for Southern California at No. 9 Notre Dame on Saturday night.\n\nUSC coach Clay Helton made the announcement Tuesday night after practice.\n\nThe Trojans (3-2) have had three starting quarterbacks in their first five games thanks to injuries, and the 18-year-old Slovis has missed most of the past two games. After being medically cleared to return, Slovis will get the shot to lead USC against the powerhouse Irish in the schools’ famed intersectional rivalry game.\n\n“There’s not that much more you can ask for,” Slovis said. “It’s Notre Dame and USC. … They’re a good team, obviously one of the best teams in the nation, but Coach Helton is going to put together a great game plan for us.”\n\nSlovis got hurt on a heavy hit during the opening series of USC’s win over then-No. 10 Utah on Sept. 20. He sat out of a loss at Washington on Sept. 28 for the Trojans, who had last week off.\n\n“He does not look out of form to me,” Helton said of Slovis, who threw to receivers during the Trojans’ week off. “He looks really good, and we’ll continue through the week. Today, I thought he was very decisive with his decision-making. So hopefully that continues and he carries it to South Bend.”\n\nThe 18-year-old Slovis took over for injured starter J.T. Daniels at halftime of the Trojans’ season opener and led them to a win over Fresno State. He propelled USC past Stanford one week later with a record-setting performance for a USC freshman quarterback in his first start, passing for 377 yards and three touchdowns.\n\nDespite throwing three interceptions in an overtime loss at BYU one week later, Slovis still ranks second in the FBS in completion percentage (.779), trailing only LSU’s Joe Burrow.\n\nMatt Fink replaced Slovis for the past two games, leading USC to a win over the Utes and a loss to the Huskies. Fink went 40 of 62 for 514 yards in his appearances, while Slovis is 60 of 77 for 732 yards.\n\nBoth quarterbacks have thrown four interceptions apiece in coordinator Graham Harrell’s version of the Air Raid offense. Harrell has been an ardent supporter of Slovis since spring ball, noting the freshman’s surprising maturity and an ability to thrive in the up-tempo offensive scheme.\n\n“I’m impressed with a lot of things about him, but since the day he’s been here, I don’t ever think it’s been too big of a moment for him,” Harrell said. “Never had the big eyes or the deer-in-the-headlights look. He always carries himself with confidence and expects good things to happen.”\n\nUSC got more good injury news Tuesday when Helton confirmed that half of his starting secondary could be back in uniform.\n\nSafety Talanoa Hufanga is expected to play at Notre Dame after missing USC’s last game with an apparent concussion. Hufanga was in the middle of a breakout sophomore season as the Trojans’ leading tackler before his head injury and a shoulder problem, but the bye week helped him greatly, Helton said.\n\nCornerback Olaijah Griffin also is progressing toward a return Saturday after missing the Trojans’ loss at Washington with a back injury, Helton said.\n\n___\n\nMore AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP_Top25\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Freshman quarterback Kedon Slovis will return from an apparent concussion to start for Southern California at No. 9 Notre Dame on Saturday night.", "authors": ["The Washington Times Http", "Greg Beacham"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/08/usc_slovis_football_11875_c0-128-3063-1913_s1770x1032.jpg?8068bf1cf25d65af48cc888050c666e1933f4500", "published_at": "2019-10-08"}