{"pub": "investing.com", "url": "https://ph.investing.com/news/commodities-news/preciousgold-rises-as-stocks-ease-on-brexit-tech-concerns-71120", "downloaded_at": "2019-10-23 11:00:15.080812+00:00", "title": "PRECIOUS-Gold rises as stocks ease on Brexit, tech concerns", "language": "en", "text": "© Reuters. PRECIOUS-Gold rises as stocks ease on Brexit, tech concerns\n\n* Texas Instruments revenue forecast hits chipmakers\n\n* Markets focus on Fed talks on Oct. 29 and 30\n\n* GRAPHIC-2019 asset returns: http://tmsnrt.rs/2jvdmXl\n\n\n\n(Updates prices, adds comments and details)\n\nBy Sumita Layek\n\nOct 23 (Reuters) - Gold firmed on Wednesday as uncertainty\n\nover Britain's upcoming exit from the European Union and\n\nconcerns over a slowdown in the global technology sector weighed\n\non stocks, prompting investors to seek refuge in bullion.\n\nSpot gold was up 0.5% at $1,494.28 per ounce as of\n\n0938 GMT. U.S. gold futures GCcv1 rose 0.7% to $1,497.40 per\n\nounce.\n\n\"There is a bit of risk aversion in equity markets and gold\n\nis up again after consolidating over last few days. There are\n\nsome bargain hunters in the gold market, especially as equities\n\nare down today,\" said Julius Baer analyst Carsten Menke.\n\nEuropean shares dipped for the first time this week as a\n\nprofit warning from Texas Instruments raised worries about the\n\nglobal microchip industry, while UK lawmakers hit the pause\n\nbutton on Brexit. .EU British Prime Minister Boris Johnson said on Tuesday it was\n\nup to the EU to decide whether it wanted to delay Brexit and for\n\nhow long, after a defeat in parliament made ratification of his\n\ndeal by the Oct. 31 deadline almost impossible. Meanwhile, China's Vice Foreign Minister Le Yucheng said on\n\nTuesday said Beijing and Washington have achieved some progress\n\nin trade talks.\n\nTit-for-tat tariffs between both the countries have rattled\n\nfinancial markets and stirred up global recessionary fears.\n\n\"The U.S.-China trade truce that was agreed a few weeks ago\n\nweighed on a little bit on sentiment in the gold market, but we\n\nneed to acknowledge that this was more of a paper deal at least\n\nfor now,\" Menke said.\n\n\"The tariffs and the growth uncertainty remain in place so\n\nthis is still positive for gold.\"\n\nInvestors are now awaiting the U.S. Federal Reserve's\n\nmeeting at the end of the month to see if the central bank will\n\ncut rates for a third time this year. FEDWATCH\n\nDavid Govett, head of precious metals at Marex Spectron,\n\nsaid financial market players were expecting the Fed to cut\n\nrates again.\n\n\"So if they don't, it will be short term negative for gold.\n\nIf they do, it won't be as bullish because it is already written\n\ninto the markets,\" he said.\n\n\"We're going to see gold make a move back up above $1,500;\n\nthere's too much going on in the world for it to stay down\n\nhere.\"\n\nElsewhere, silver was up 0.4% at $17.59 an ounce.\n\nPlatinum XPT= rose 0.4% to $894.94 and palladium XPD= was\n\nsteady at $1,755.60 per ounce.\n\n\n\n", "description": "PRECIOUS-Gold rises as stocks ease on Brexit, tech concerns", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPED1M0ED_L.jpg", "published_at": "2019-10-23"}