{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/books/2019/10/27/how-dan-piepenbring-finished-princes-memoir-without-prince/2457211001", "downloaded_at": "2019-10-28 00:32:33.722583+00:00", "title": "Making Prince's memoir, without Prince: Dan Piepenbring on editing 'The Beautiful Ones'", "language": "en", "text": "USA TODAY\n\nHow do you complete an autobiography without the subject?\n\nDan Piepenbring, an advisory editor at the Paris Review, faced that challenge.\n\nBefore his death on April 21, 2016, Prince had signed a deal to write a book – an autobiography of sorts.\n\nHe had selected Piepenbring to be his co-writer.\n\nFour days before he died, Prince called Piepenbring to quash any idea that he wasn't doing well, as news spread of an emergency plane-landing due to his health.\n\n\"It was just so comforting to hear his voice and I remember that conversation being the first basic reality of talking to him, picking up where we left off. It was such a nourishing feeling,\" Piepenbring says.\n\nPrince sounded excited to get to work. He wanted to dive into the lyrics of \"When Doves Cry\" with Piepenbring. They would get together as soon as possible.\n\nThen, while riding on a Metro-North train to Connecticut with a friend, Piepenbring found out that the icon had died. And suddenly, the entire collaboration began to seem like it was just a dream.\n\nPiepenbring was left with three months' worth of sporadic calls and 30-some pages of unfinished manuscript scrawled on a legal pad.\n\nWhat to do with that was a big question. Prince hadn't exactly left a template.\n\n\"It would change minute to minute, it was in constant flux,\" Piepenbring says. \"He really never stopped, even once he was going down a certain road, he was thinking about a different way of doing things.\"\n\nIt was going to be an autobiography, but also a manual for the music industry and creative communit. At one point, Prince asked Piepenbring if they could write a book that would solve racism.\n\nBut was any book even possible anymore? Piepenbring went to Paisley Park to find out in June 2016 with his editor, agent and publisher.\n\n\"It was really eerie and really humbling because with exception of what the investigators had taken out, it was exactly how he left it,\" Piepenbring says.\n\nThey decided they could make it happen.\n\nThe process took years. Starting with the unfinished pages of memoir draft, they went on to analyze materials that were being archived at Paisley Park in real time.\n\nThose pages, for Piepenbring, became the real heart of the book. Little things though, will stick out to different people, all of it deepening the connection between the reader and the icon.\n\nThey structured the book in accordance with what it seemed Prince had wanted.\n\n\"That really informed what made the cut,\" Piepenbring says.\n\nThe book includes handwritten lyrics, photographs, doodles – artifacts that were part of Prince's creative process – things that would possibly make a reader feel like they had been in the room with Prince while he was creating.\n\nPiepenbring thinks the book turned out as unconventionally as Prince would have liked but he can never say for sure whether or not the musical genius would have approved of the final product.\n\n\"I am always really reluctant to say for certain about what he would think about anything,\" Piepenbring explains. \"I have to imagine he would be pleased with the book.\"\n\nEvery time Piepenbring made a prediction about what Prince would do or how he would want to collaborate on the book, he was wrong, he learned while working with him.\n\n\"He flouts your expectations at every juncture,\" Piepenbring says.\n\nPrince's death:Superstar didn't know he was taking fentanyl; no one charged with a crime\n\nPrince’s ‘purple family’:Remembers the star at Paisley Park\n\nPiepenbring says that he came away with a greater understanding of how hard Prince had to work to realize the gifts and talents he was born with.\n\n\"I really adored and respected him going into this and you always worry about meeting your idols,\" said Piepenbring. \"I really am so lucky because I only came away with a greater awe for him.\"\n\nPiepenbring hopes that the book deepens everyone's connection to Prince's music.\n\n\"[When a] superstar dies, there's a flattening that takes place,\" he says. \"Their legacy ends up reduced if conversation doesn't stay active.\"\n\nPiepenbring wants people to remember that he was more than a \"strange dude from Minneapolis who learned all these instruments.\"\n\nNow, after working on the book, when he goes back to the music, he hears evidence of the that boy who became the man who was the icon: Prince.\n\nFollow Morgan Hines on Twitter: @MorganEmHines.", "description": "How do you complete an autobiography without the subject? Dan Piepenbring, an advisory editor at the Paris Review, faced that challenge.", "authors": [], "top_image": "https://www.gannett-cdn.com/presto/2019/10/25/USAT/4034a5af-1705-48c5-9a8c-096d77ae6d00-DWAdbvKl.jpg?crop=1837,2450,x0,y143&width=1644&height=2450&format=pjpg&auto=webp", "published_at": "2019-10-27"}