{"pub": "guardian", "url": "https://theguardian.com/food/2019/oct/24/not-just-for-carving-chefs-on-the-twelve-most-delicious-ways-to-cook-pumpkin", "downloaded_at": "2019-10-24 06:42:16.487166+00:00", "title": "Not just for carving: chefs on the 12 most delicious ways to cook pumpkin", "language": "en", "text": "The statistics on Halloween food waste are suitably frightening. More than 8m pumpkins are expected to be binned uneaten this year, acccording to research by stock cube makers Knorr and the food-waste charity Hubbub. That’s more than 18,000 tonnes of edible flesh. Most of us do not even consider pumpkins food.\n\nThat misunderstanding has been compounded by carving pumpkins occasionally being labelled “for ornamental use only”. But that is changing: Tesco, Sainsbury’s and Waitrose, for example, do not use such labelling; all of their carving pumpkins are edible.\n\nIt can be hard work to hollow out these thin-walled but robust monsters, discard the toughest fibrous bits, separate the seeds and create something tasty from the watery flesh. But you can make delicious food from even the most unpromising pumpkin. Here are some ideas from chefs, bakers and cookery writers.\n\nPumpkin and sage picnic pie\n\nThe wet flesh in bigger pumpkins lends itself to pie fillings. Roast chunks with lots of garlic until caramelised and toss it in a blitzed dressing of sage, lemon zest and oil. Line a bread tin with shortcrust pastry (at home, I use all-butter Jus-Rol) and pack the mix in. After cooking – 45 minutes at 210C (190C fan)/410F/gas mark 7 – the filling will still be juicy and the pastry perfect – and you get that mosaic effect of the dressing and its flavours running around the chunks and right through the pie.\n\nCalum Franklin, executive chef, Holborn Dining Rooms, London\n\nPumpkin tortelli\n\nHalloween pumpkins can be watery, so once you’ve cooked the flesh, hang it in a colander overnight to get rid of as much liquid as possible. You want intense flavour. These tortelli come from Lombardy and they are basically pumpkin mixed with mostarda (mustard oil and fruit preserve) and parmesan, stuffed into pasta and served with sage butter. It isn’t measured exactly; it’s down to taste. Puree the mixture if you like, too. I would recommend people make fresh pasta for this. Roll it out thinly in one long strip, dot your pumpkin mix on, fold it over, seal it, cut it – I use a square shape – and you have lovely tortelli.\n\nAngela Hartnett, chef-owner, Murano, London\n\nPumpkin sourdough\n\nWhen you add roasted, liquidised pumpkin to sourdough (200g to 1kg of flour; reduce the water slightly), you get a gorgeous loaf. It imparts a natural earthy flavour, as well as making the crumb noticeably softer. And you get a crisper crust. After removing any fibrous material around the seeds, gently dry them in a low oven and roast them with salt and olive oil – you can put them in the bread, too. The key thing to know when adding seeds is that they suck moisture from bread. Immediately after roasting them, pour a little water over the seeds and they will absorb it. You will get all the toasted flavour, but no dry seeds.\n\nAidan Monks, owner-baker, Lovingly Artisan, Cumbria\n\nPumpkin jam\n\nTechnically, because it contains seeds, pumpkin is a fruit – so why not treat it as one? Finely chop the flesh, add a little water and a handful of brown sugar and let it bubble until pulpy. Blitz with a hand blender, put it back on the stove and cook it until it is thick and spitting. Let it cool and thicken and there you go: pumpkin jam. It’s sweet, so stick it on dark rye sourdough. It needs that bitterness.\n\nAndrew Dargue, chef-owner, Vanilla Black, London\n\nBroad bean and pumpkin stew\n\nLocro de zapallo is a classic Peruvian, originally Andean, dish, usually served with white rice. The quick, easy version is: sauté sliced onions, garlic and red chilli in olive oil, add pumpkin (250g per person, roughly cubed) and vegetable stock, and cook until the pumpkin breaks down but still retains some chunks. To finish, add cooked broad beans, tons of chopped parsley and a dash of cumin. It should be a vibrantly orange, garlicky, thick, sloppy stew, fresh with parsley. This is vegan but, if you want, add cream and crumbled feta.\n\nMartin Morales, chef-owner, Ceviche restaurants, London\n\nArnadí de calabaza\n\nIdeally, choose a smaller, sweeter pumpkin for this tasty, simple Valencian dessert. Cover the pumpkin with foil and bake for about an hour at 190C (170C fan)/gas mark 5. In a sieve, press out as much water as possible and then mash it until smooth. To make four portions, mix 400g of pumpkin with 50g ground almonds, 60g sugar, one egg yolk, half a teaspoon of cinnamon and lemon zest. Spoon it into individual ramekins, top with blanched almonds and honey and bake until golden. We serve it with homemade turrón ice cream.\n\nJoe Wright, chef-owner, Porta, Chester\n\nSweetcorn and pumpkin chowder\n\nA light, vegan hug-in-a-bowl for autumn. Sauté onion, minced garlic and charred sweetcorn with four tablespoons of olive oil. Add a tablespoon of plain or gluten-free flour, followed by cubes of pumpkin – you can use any, from fibrous Halloween types to our favourite acorn squash. Then, adding veg stock slowly, cook until it is just soft. Finish with seasoning, chopped flat-leaf parsley and roasted pumpkin seeds.\n\nSamantha Evans, chef-owner, Hang Fire Southern Kitchen, Barry, Wales\n\nChana chaat\n\nDry-fried pumpkin seeds – keep them moving in the pan so they don’t burn – are great in adventurous salads. They work especially well as a nutty complement to sweet-sour pops of fresh fruit. One of my favourites is our take on chana chaat. This sees toasted pumpkin seeds, couscous, chickpeas, raisins, a little fresh tomato and pomegranate seeds tossed together, seasoned and drizzled with coriander-mint dressing, made by blitzing fresh coriander, toasted coriander seeds, mint, sugar, pickled chillies, sunflower seeds, turmeric and lime juice.\n\nNaved Nasir, executive chef, Dishoom\n\nRed pipian sauce\n\nThis pre-Hispanic Mexican recipe uses pumpkin seeds, with the red coming from charred tomatoes and dried guajillo chilli. Roast 800g of tomatoes, 500g of onions and peeled garlic, turning occasionally. Toast 25g of chillies for about 30 seconds, then soften them in boiling water. In a blender, process all the ingredients and 380g of toasted pumpkin seeds until smooth. Pass the salsa through a strainer, season and serve with the roasted chicken or pumpkin. It’s a kiss of spiciness – but not overpowering.\n\nMartha Ortiz, chef-patron, Ella Canta, London\n\nSpiced pumpkin panna cotta\n\nThis is my take on a pumpkin spiced latte. To make six, put half a tablespoon of coffee granules in 300ml of milk – granules work best to get that proper coffee taste – and heat until infused. Then add 360ml of cooked pumpkin puree, 420ml of double cream, 120ml of caster sugar and a teaspoon of cinnamon, mix it together and bring it almost to the boil. Off the heat, add three sheets of pre-soaked bronze leaf gelatine. Whisk thoroughly and sieve it. Pour into moulds and allow six hours to set.\n\nRoberta Hall, chef-owner, The Little Chartroom, Edinburgh\n\n\n\nPumpkin and lentil wellington\n\nA warm, hearty core to a vegan roast. Seeds and excess innards extracted, dice a pumpkin’s edible core into 2cm cubes and bake at 210C (190 fan)/410F/gas mark 7 with oil and garlic for 35 minutes. Meanwhile, simmer the lentils in water with diced onion, bay leaves and thyme. Using Jus-Rol puff pastry, roll out a long rectangle. Leaving space at one edge to roll it over, add the pumpkin, drained lentils and onions mixture lengthways, minus the bay leaves and thyme. Brush the seal with soya milk, roll it over, brush the exterior, sprinkle with salt and bake on greaseproof paper until golden, about 30 minutes. Slice, serve.\n\nNathan Wattam, head chef, Common, Manchester\n\nFermented pumpkin\n\nRemove the rubber seal from a Kilner jar (some air needs to escape) and add your pumpkin flesh, leaving a one-third space at the top because it will expand. Add small amounts of sympathetic spices – nutmeg, cinnamon, smoky black cardamom – plus enough water to completely cover the pumpkin, and 2% salt (eg 20g salt to 1kg pumpkin). Leave that in a warm kitchen for four days; the lactobacillus fermentation will start and it will turn sour and pickle-like. Refrigerated, it lasts for ages. We use it pureed with game or as a base for savoury tarts.\n\nMatthew Pennington, chef-owner, the Ethicurean, near Bristol", "description": "From chowders to sourdough, restaurateurs and cooks explain how to get the best from the orange gourds", "authors": ["Tony Naylor"], "top_image": "https://i.guim.co.uk/img/media/d114e92b86afd9a86a50e97f69b26724eb58a7da/0_1318_3883_2330/master/3883.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=5c6f989424b4a7ff4bc4fa00eb71f15a", "published_at": "2019-10-24"}