{"pub": "cnbc", "url": "https://cnbc.com/2019/09/20/beverly-hills-mansion-includes-delos-wellness-features.html", "downloaded_at": "2019-09-20 22:47:31.687063+00:00", "title": "Forget 'smart' houses: This $24.5 million 'wellness mansion' in Beverly Hills has ergonomic floors and lights that mimic sunrise", "language": "en", "text": "A $24.5 million home located in Beverly Hills is being touted as, not just a smart house, but a \"wellness house,\" according to Douglas Elliman Real Estate.\n\nThe over 10,000-square-foot mansion is tricked out with innovative health features that go way beyond a home gym.\n\nThe health-obsessed will appreciate the amenities, including a built-in intelligent home network called Darwin. This system controls the light, air and water throughout the home to enhance your well-being, including your sleep.\n\nFor example, Darwin's lighting system is set to mimic the sunrise and sunset to sync with your body's internal clock or circadian rhythm. This allows you to fall asleep and wake up easier. The bathrooms, on the other hand, are outfitted with bright white light to provide an energy boost in the morning.\n\nA purified air system continuously monitors and removes contaminants that may enter the home, like pollen and pollutants. And the water is filtered to get rid of chlorine. (Small amounts of chlorine are safe but some people may be more sensitive to it.)\n\nEven the floors are made with treated wood that's ergonomic and boosts your posture.\n\nThese interior details are signature to Delos, a wellness real estate company known for designing health-promoting homes and workplaces. Wellness guru Deepak Chopra and actor Leonardo DiCaprio sit on the company's advisory board.", "description": "\"Wellness real estate\" company Delos added features to this Beverly Hills mansion from ergonomic floors to a Himalayan salt room to enhance residents' health, sleep and well-being. Take a look inside.", "authors": ["Cory Stieg"], "top_image": "https://image.cnbcfm.com/api/v1/image/106134791-1568752411241summitridge_0011.jpg?v=1568752669", "published_at": "2019-09-20"}