{"pub": "rt", "url": "https://rt.com/news/470730-pentagon-troops-saudi-iran/ ", "downloaded_at": "2019-10-11 20:24:20.853930+00:00", "title": "Pentagon sending 2,000+ more troops to ‘assure and enhance defense’ of Saudi Arabia amid tensions with Iran", "language": "en", "text": "The US is beefing up military might in the Middle East, saying it will send more troops, fighter jets and missile defense systems to Saudi Arabia amid escalating tensions with Iran.\n\nUS Secretary of Defense Mark Esper has authorized the deployment of two fighter squadrons, one Air Expeditionary Wing (AEW), two batteries of Patriot missile defense systems and one Terminal High Altitude Area Defense system (THAAD), Pentagon spokesman Jonathan Hoffman said Friday.\n\nThis is in addition to the 200 or so troops, Patriots and radar systems whose deployment was announced two weeks ago, and amounts to 3,000 troops “extended or authorized within the last month,” Hoffman clarified.\n\nAlso on rt.com 200 troops, 4 radars, 1 Patriot battery: Pentagon announces Saudi Arabia deployment details\n\nThe Pentagon has increased the number of US forces in the Central Command (CENTCOM) area of operations by about 14,000 since May this year, as it continues to lock horns with Tehran. Not all of those went to Saudi Arabia, however, as CENTCOM’s area of operations covers the entire Middle East, including Afghanistan and Syria.\n\nThe US “does not seek conflict with the Iranian regime, but we will retain a robust military capability in the region that is ready to respond to any crisis and will defend US forces and interests in the region,” Hoffman said.\n\nAlso on rt.com Tehran confirms Iranian tanker hit by 2 projectiles, says attack resulted in oil spill\n\nNews of the deployment comes hours after reports that an Iranian tanker was struck by two projectiles in the Red Sea, some 60 miles (96 km) from the Saudi port of Jeddah. The National Iranian Tanker Company (NITC) said the Sinopa was damaged but not on fire, and was still en route to the Persian Gulf.\n\nIran too has been accused of targeting oil tankers with acts of sabotage, promting the US to announce a multinational maritime security mission in the Persian Gulf. Tehran however denies the accusations, and the US has not provided proof to back up its claims.\n\nLike this story? Share it with a friend!", "description": "The US is beefing up military might in the Middle East, saying it will send more troops, fighter jets and missile defense systems to Saudi Arabia amid escalating tensions with Iran.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5da0b4c885f5407fd6356341.jpg", "published_at": "2019-10-11"}