{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/post-scandal-nobel-award-literature-prizes-year-191010024841993.html", "downloaded_at": "2019-10-10 06:17:50.506366+00:00", "title": "Post-scandal Nobel to award two literature prizes this year", "language": "en", "text": "The Swedish Academy will announce two Nobel laureates for literature on Thursday, after postponing last year's prize over a sexual harassment scandal.\n\nExperts say the academy will seek to avoid ruffling any feathers as it attempts to move on from last year's scandal when the husband of one of its members was jailed for rape.\n\nIn the run-up to the announcement at 1100 GMT, when the academy will reveal one winner for 2018 and one for 2019, many of the writers creating a buzz are women including poet Anne Carson and novelist Margaret Atwood, who are from Canada, as well as Polish writer and activist Olga Tokarczuk, and French Guadeloupean Maryse Conde, according to betting site Unibet.\n\nStockholm's literary circles have also speculated about Romanian poet and novelist Mircea Cartarescu, Polish writer Hanna Krall, Antiguan-American author Jamaica Kincaid, South Korean Han Kang and Joyce Carol Oates from the United States.\n\nDating back to 1786, the Swedish Academy is at pains to repair its reputation after the scandal exposed scheming, conflicts of interest, harassment and a culture of silence among its 18 members, long-esteemed as the country's guardians of culture.\n\nThe revelations shook Sweden, a Lutheran nation that prides itself on transparency and consensual democracy and is intolerant of inequality.\n\nLeft in tatters by the debacle, the Academy, tasked with selecting the Nobel Literature laureate, postponed the 2018 prize until this year - the first delay in 70 years.\n\nNobel sex scandal\n\nNow revamped with new members and statutes, it is widely expected to pick writers who will not lead to further controversy, and at least one is almost certain to be a woman, literary critics interviewed by AFP predicted.\n\nSince 1901, only 14 of the 114 literature laureates have been women.\n\nCanadian novelist Margaret Atwood is being talked about as a possible winner this year [File: Dylan Martinez/Reuters]\n\nThe Academy does not release a shortlist. While possible winners are always anyone's guess, the speculation is even more rampant this year given the many changes within the institution.\n\nAmong many other names cited as possible winners are Chinese fiction writer Can Xue, Japanese author Haruki Murakami and Russian novelist Lyudmila Ulitskaya.\n\nThe Academy's woes began in November 2017 when it disagreed about how to manage its close ties to Frenchman Jean-Claude Arnault, accused and later convicted of rape.\n\nArnault is married to Katarina Frostenson, a member of the Academy who later resigned over the scandal at the height of the #MeToo movement against harassment of women.\n\nThe pair also ran a cultural club in Stockholm that received funding from the body.\n\nUltimately, seven members quit the Academy, including then-permanent secretary Sara Danius.\n\n\"From having been associated with literature of the highest order, the Nobel Prize is for many now associated with #MeToo ... and a dysfunctional organisation,\" Swedish literary critic Madelaine Levy told the AFP news agency.\n\nNovelist Kazuo Ishiguro was the last person to receive the Nobel prize in literature. The award was not made last year. [Jonas Ekstromer/TT News Agency via Reuters]\n\nReputational damage\n\nThe empty seats have since been filled, and literature professor Mats Malm took over as the permanent secretary in June.\n\n\n\n\"The changes have been very productive and we are hopeful for the future,\" Malm told AFP in an interview just days before the prize announcement.\n\n\n\nHe acknowledged the affair had tainted the institution and said improvements were still needed.\n\n\n\n\"A lot of hard work remains, of that we are certain.\"\n\nRetired publisher Svante Weyler said he thought the Academy's - and prize's - reputation could be repaired, \"but only through wise choices of laureates.\"\n\nGiving the nod to US singer-songwriter Bob Dylan in 2016 also led some to question the Academy's judgement.\n\nWeyler expected the Academy would try hard to steer clear of controversy, and probably go for one author highly regarded in literary circles and one with broader appeal - but \"absolutely no one that can cause a controversial political discussion,\" he said.\n\nThe Academy used to be the sole arbiter of who gets the Nobel Literature Prize.\n\nBut following demands of external oversight from the Nobel Foundation which manages the prize money, the selection committee has been altered to include five members from outside the body.\n\nGiven the stain on the Academy's reputation, Levy raised the possibility \"that those given the award won't accept it\" - as French philosopher Jean-Paul Sartre did in 1964.\n\nThis year's laureates - especially if either is male - can expect their work and personal life to come under great scrutiny, in particular for expressions of misogyny, Levy added.", "description": "Winners for 2018 and 2019 will be announced on Thursday after a sex scandal forced last year's award to be postponed.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/10/995e47c288a241b0a5c8ce28e41724d7_18.jpg", "published_at": "2019-10-10"}