{"pub": "dailymail", "url": "https://dailymail.co.uk/money/news/article-7566277/Post-Office-veto-save-Barclays-just-7m-year-bank-3-5bn-profit-2018.html", "downloaded_at": "2019-10-13 23:37:54.829863+00:00", "title": "Post Office veto will save Barclays just £7m a year", "language": "en", "text": "Barclays will save just £7million a year by blocking its customers from withdrawing cash from the Post Office, sources told The Mail on Sunday.\n\nThe bank is understood to have taken the drastic step last week because of a hike in the fees the Post Office charges to allow bank customers to obtain cash.\n\nBarclays was slammed by MPs and campaigners when it revealed it was backing out of the industry-wide arrangement which ensures bank customers can access their money even if their local branches have been shut.\n\nBarclays was slammed by MPs and campaigners when it revealed it was blocking its customers from withdrawing cash from the Post Office\n\nThe option to use the Post Office was created as a lifeline for communities left without banking services and is offered by all major banks including Lloyds, RBS, Santander and HSBC.\n\nBarclays made a £3.5billion profit in 2018, dwarfing the £7million a year the Post Office was charging to allow its customers to withdraw cash. Jes Staley, chief executive of Barclays, was paid £3.4million last year.\n\nAdam Rowse, Barclays managing director for branch-based banking, said: ‘Despite removing cash withdrawals, our financial contribution to the Post Office for the banking framework will actually increase in 2020.’\n\nBusiness Secretary Andrea Leadsom described the move as ‘very disappointing’. Labour MP Rachel Reeves, chair of the business committee, is due to hold crunch talks with Catherine McGrath, Barclays’ managing director of retail banking.\n\nCritics have warned that while bank customers can perform basic transactions at a Post Office, they are unable to discuss their mortgage, switch savings accounts or make a complaint.\n\nA Post Office spokesman said: ‘We are continuing to have a presence across the country whilst banks – including Barclays – are closing down branches.\n\n‘We’re delighted that we were able to negotiate a higher rate from the banks so that our postmasters broadly receive three times more for providing everyday banking services.’", "description": "Barclays will save just £7million a year by blocking its customers from withdrawing cash from the Post Office, sources told The Mail on Sunday.", "authors": ["Helen Cahill For The Mail On Sunday", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/17/19631304-0-image-a-63_1570898898339.jpg", "published_at": "2019-10-12"}