{"pub": "reuters", "url": "https://reuters.com/article/us-poland-election-government/polands-pis-mulls-personnel-changes-to-energy-brief-in-new-government-idUSKBN1WU0R4", "downloaded_at": "2019-10-15 08:06:10.211503+00:00", "title": "Poland's PiS mulls personnel changes to energy brief in new government", "language": "en", "text": "FILE PHOTO: Poland's ruling party Law and Justice (PiS) leader Jaroslaw Kaczynski waves after the exit poll results are announced in Warsaw, Poland, October 13, 2019. REUTERS/Kacper Pempel\n\nWARSAW (Reuters) - Poland’s ruling Law and Justice (PiS) party is considering some changes in the government after it won a weekend parliamentary election, including in the field of energy policy, Jacek Sasin, a PiS member and Deputy Prime Minister said on Tuesday.\n\nPiS narrowly won a second term in power, final results from Sunday’s vote showed, but its drive to push through its conservative agenda may be hampered by a loss of the upper house.\n\nMateusz Morawiecki would continue as Poland’s prime minister, Sasin said, adding there could be soon minor changes among officials responsible for energy matters, without giving further details.\n\n“Mateusz Morawiecki remains the prime minister, nothing changes here,” Sasin said.\n\nThe energy portfolio has previously been split between the ministers of energy and the environment, as well as a minister for entrepreneurship and technology, with the prime minister also personally overseeing some energy-related issues.\n\nAnalysts said a potential replacement of Energy Minister Krzysztof Tchorzewski could boost the shares of Poland’s listed state-run energy companies, as the minister had been criticized by private investors for launching policies they said undermined the utilities’ profitability.\n\nUnder Tchorzewski, who intervened on the energy market with a power price cap, utilities stopped paying out dividends and had to support troubled coal mines.\n\n“If ...Tchorzewski loses his job or loses the ultimate supervision of utilities which could, for instance, be redirected to the prime minister we would expect some upside potential for utilities which may start to pay dividends again,” Ipopema Securities said in a research note.", "description": "Poland's ruling Law and Justice (PiS) party is considering some changes in the government after it won a weekend parliamentary election, including in the field of energy policy, Jacek Sasin, a PiS member and Deputy Prime Minister said on Tuesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191015&t=2&i=1441012075&w=1200&r=LYNXMPEF9E0D5", "published_at": "2019-10-15"}