{"pub": "atlantic", "url": "https://theatlantic.com/entertainment/archive/2019/09/margaret-atwood-handmaids-tale-sequel-the-testaments/597385", "downloaded_at": "2019-09-05 11:26:11.508397+00:00", "title": "The Challenge of Margaret Atwood", "language": "en", "text": "Early last month, I crossed the international border from the United States to Canada—a relatively simple act that also feels a touch more fraught these days than it used to. During the final phase of the third security checkpoint at Billy Bishop Toronto City Airport, so close to the end that I could see Lake Ontario sparkling through the large windows, a stern border guard had some questions. Why are you here? For work. What do you do? I’m a journalist doing an interview. Who with? Margaret Atwood. With that, the dark-haired guard fixed me with a look that was almost like disappointment. “Oh, her,” she said, waving me through. “Everybody always comes for her.” It’s funny to imagine, but not improbable: hordes of brash reporters storming polite Toronto hourly demanding not Drake, not Abel “The Weeknd” Tesfaye, not even an erstwhile Raptor or Maple Leaf, but Atwood, the 79-year-old author and high priestess of Canada’s literary arts. A lovely idea, but it’s not true, Atwood told me later, when we were settled in a hotel suite, after she’d raided the minibar for salted cashews and quizzed me briefly about the iniquity of the new British prime minister, Boris Johnson. You can’t write and do press at the same time; it’s too distracting. And Atwood is almost always writing. It isn’t that she minds doing interviews—she prefers it now to when she first started doing press, in the 1960s and ’70s, when reporters “couldn’t quite get their heads around female people writing, and also Canadian people writing,” and seemed fairly hostile to the idea of both. And now it’s different because—?\n\nShe tilted her neck upward regally, fluffing her gray curls so they sprung outward, an imperious, septuagenarian Orphan Annie in the gentle afternoon light. “Because”—her eyes twinkled at me—“I’m venerable.” Queen Margaret, soothsayer, poet, sometime Game of Thrones fan, historical encyclopedia, Booker Prize winner, is indeed venerable. Thirty-four years ago she published The Handmaid’s Tale, a work of speculative fiction imagining a repressive theocracy in the United States, and ever since she’s been name-checked virtually every time reproductive rights are restricted, or biblical language is invoked to justify appalling actions. The book is narrated by a handmaid whose only title connotes the man she’s assigned to bear children for through acts of rape—she’s called Offred, to signify that she is the property “of Fred” Waterford, an elite commander in the totalitarian Republic of Gilead. Almost instantaneously, The Handmaid’s Tale became a modern classic. Its portrayal of radical religious fanatics staging a coup in an America ravaged by infertility, pollution, and disease was inspired in no small part by George Orwell’s 1984, which was also the year when much of it was written, while the Christian right’s Moral Majority movement was at its peak. Atwood began work on it while living in what was then a walled Berlin; she finished it in Tuscaloosa, Alabama, where she’d been warned not to ride a bicycle outside, which would cause locals to assume she was a communist and try to run her off the road. Soviet authoritarianism and cloying American paranoia bookended the creation of her story.\n\nThough The Handmaid’s Tale has never been out of print, and though Atwood maintains that popular interest in it crests with every American election, it became even more of a phenomenon in late 2016, after the Donald Trump–Mike Pence ticket prevailed in the U.S. presidential election and only a few months before a television adaptation of the novel debuted on Hulu. The visual iconography of the handmaids—women depersonalized by scarlet cloaks, rendered faceless by wraparound white bonnets—became a fixture at protests and assemblies around the world. But before any of this had happened, Atwood had already decided, earlier in 2016, to write a sequel. We had met in this Toronto hotel room to discuss The Testaments, the most anticipated book of the year, and a novel so exciting that Atwood’s first event on release day, September 10, is being live-streamed to more than 1,000 cinemas around the world. The book is under such tight security that when a galley was couriered to me in August, it bore a fake name and a fake title, and was accompanied by a non-disclosure agreement. The Testaments, set about 15 years after the events of The Handmaid’s Tale and structured around the testimony of three women, is the kind of release that booksellers dream of, with its associated panel discussions and costume parties. (One event at a London bookstore features embroidery and placard making.) And every time I asked Atwood a question about it, she deflected it with the instinctual dexterity of Roger Federer on Centre Court. A query about whether the TV show altered her perception of her characters prompted a dissertation on the 50 shades of red that the Hulu costume designer Ane Crabtree went through to get the handmaids’ outfits right. A question about how she tried to channel the voice of a 16-year-old girl spawned an anecdote about Dustin Hoffman and Laurence Olivier on the set of Marathon Man. A back-and-forth about why she wanted to revisit The Handmaid’s Tale’s antagonist, Aunt Lydia, whose sense of humor and self-awareness is sharper in The Testaments than anyone might have imagined, led Atwood to say, “Of course, the question is, what do Mother Superiors think about in their spare time? What about Hildegard von Bingen? She certainly lived her life on the edge.”\n\nAbout an hour in, after Atwood and I had discussed the children of the hippies, Nathaniel Hawthorne’s utopian romances, Madeleine Albright’s warnings against fascism, Morris dancing (“We don’t quite know what it means. Was it a pagan thing? A fertility ritual?”), and Margery Kempe, “a mystic who did quite a lot of crying,” I was beginning to understand that Atwood did not want to talk about The Testaments, really, and that the questions I was asking her were irritating because they kept demanding an interpretation of a book that she didn’t wish to interpret. The last line of The Handmaid’s Tale—“Are there any questions?”—hints at the deliberate ambiguity of her stories. Everything I was trying to get her to do—explain characters she created, or events she invented for them—seemed to be everything she was most politely but ardently opposed to doing. Part of that, I’m guessing—she obviously wouldn’t tell me—is because Atwood is dancing around a line. The Handmaid’s Tale has been a 1990 movie, an opera, a play, a ballet, a one-woman show, and the inspiration for a concept album by the band Lakes of Canada. But over the past three years, as waves of readers have claimed the novel as a symbol of the “resistance,” and as Hulu’s TV adaptation has expanded her story in new—sometimes questionable—directions, the fictional world of Gilead has become a phenomenon that threatens to escape its author’s hold.\n\nAtwood said she’s okay with that. She darts back and forth between embracing the hype—the live-stream for the book release, she told me proudly, is the “biggest one” the producers have ever done—and downplaying it. (The most fuss she’s ever gotten at home in Toronto, she said, was when she faced off against Mayor Rob Ford in an effort to maintain adequate funding for local libraries.) So much in Atwood’s work is about duality: pairs, or doubles, or opposing forces striking each other out. And if The Handmaid’s Tale is all about Offred’s passivity and powerlessness, The Testaments is defined by action. Its characters find power in unlikely places. They make bargains that seal their fate. They wield influence and significant authority over others. They make decisions, and so must readers. The character of Aunt Lydia, in particular, has an arc that challenges simplistic readings of The Handmaid’s Tale. Her narrative could be interpreted as an author trying to regain authority over her own universe, while still leaving enough space for the readers she knows will cast their own verdict. “There are different sorts and levels of judgmentalism in people,” Atwood said. She said she doesn’t want to frame the book explicitly, because she knows each reader “brings to every book who they are, and each one of those who they ares is different.” Faced with the same situations as the characters in The Testaments, “the question for them is, probably, what would you do? What would you have done?”\n\nAunt Lydia is a faint presence in The Handmaid’s Tale, but she casts a heavy shadow. When Offred is first captured by Gilead agents in the novel while trying to flee to Canada, she’s transported to the Rachel and Leah Center, named for the Old Testament passages upon which Gilead’s regime is based. (“And when Rachel saw that she bare Jacob no children, Rachel envied her sister; and said unto Jacob, Give me children, or else I die ... And she said, Behold my maid Bilhah, go in unto her; and she shall bear upon my knees, that I may also have children by her.”) Presiding over the Rachel and Leah Center, where women are drugged, disciplined, and trained to be handmaids, is Aunt Lydia, one of the women tasked with enforcing this new system of reproductive assignment. Filtered through Offred’s perspective, Aunt Lydia is less a person than a slogan generator—the maxims she spouts about women doing their duty plague Offred’s narrative, impossible to shake out of her memory. With “the tremulous smile of a beggar, the weak-eyed blinking, the gaze upwards,” Aunt Lydia is portrayed more as an irritant than an active oppressor. When Atwood wrote The Handmaid’s Tale, she told me in her dry, steady voice, she “wasn’t thinking about [Lydia] that much at all.” Until she read Jean Rhys’s Wide Sargasso Sea, she never paid much attention to Mr. Rochester’s wife, either. “She’s sort of a fixture, like a lamp or something. You aren’t thinking about her past or her inner life or anything else about her. She’s just an impediment to Jane Eyre getting married.” She offered me a cashew.\n\nOver the years, people kept asking Atwood whether she would write a sequel to The Handmaid’s Tale, and she kept saying no. Because what they were asking, she thought, is whether she would continue the story of Offred, and the answer to that was definitive. “That would be impossible,” she said. “You couldn’t really recreate that voice, you couldn’t build that out anymore.” But jumping forward in time, to examine Gilead’s second generation, seemed more layered with possibility. What would Gilead look like once it outgrew its “first flush of ideological weirdness,” as Atwood put it? With every revolution, she said, there’s the smashing-up-stained-glass-windows phase (Oliver Cromwell) and the butchering-the-Cossacks phase (the Bolsheviks), and then there’s what happens next. What, in Gilead, would happen next? As she thought about continuing the story, Aunt Lydia—weak-eyed, blinking, inanimate—seemed to her like a fairly obvious choice of character to revisit. (“I’ve always been a Richard III fan,” Atwood said, obliquely.) The book is divided among three narratives: One is Lydia’s, written illegally in blue ink and hidden inside a copy of Cardinal Newman’s Apologia Pro Vita Sua: A Defense of One’s Own Life. One is the recorded testimony of a young woman named Agnes about growing up in Gilead. (The name will be familiar to viewers of the Hulu series.) The third is the testimony of a teenage girl named Daisy who grew up over the border in Canada, and who can’t shake the feeling that her parents are keeping something from her. When I mentioned to Atwood that I loved the contrast between the voices of Agnes and Daisy, she fixed me with an inscrutable gaze and said, “Ye-es, well you would, wouldn’t you?”\n\nLydia, though, is the most dynamic presence, and the one who gets the most attention from the author. Without giving too much away, her perspective dominates The Testaments and offers crucial new detail and context about how Gilead was founded. Lydia’s narrative is labeled “the Ardua Hall Holograph” in the novel, with holograph seeming to have a double meaning—someone who was once flat is becoming three-dimensional in front of our eyes. Related Stories The Visceral, Woman-Centric Horror of The Handmaid's Tale\n\nThe Handmaid's Tale Treats Guilt as an Epidemic\n\nThe Growing Paradox of The Handmaid’s Tale\n\nThe Cruelty of Aunt Lydia In the Hulu Handmaid’s adaptation by Bruce Miller, now in its third season, Lydia is a formidable creature played by the astonishing Ann Dowd, a character who fluctuates disorientingly between zealotry, empathy, and ritualized sadism. It is very hard, Atwood said, to answer the question of whether the series has influenced the way she thinks about her own characters. “Of course, it has to in some way. I don’t sit around thinking about what millimeter it changes this or that.” Words, she said, are always subject to interpretation, whereas film and TV are more literal. In the original novel, Lydia is seen entirely from the outside. In the television series, she gets more depth, thanks to Dowd’s multilayered performance and Miller’s expansion of her biography. But The Testaments makes her something else again: a chronicler of Gilead who in some sense challenges both Offred’s appraisal of her and the reader’s. While Atwood’s sequel and the television series don’t stick rigidly to the same story lines, they have a fascinatingly symbiotic and cordial relationship that seems unlike any other in literature, or Hollywood. “We’re in touch,” is how Atwood described her interactions with Miller, which she characterizes as “very respectful.” The goal on both sides is not to do anything that directly contradicts something the other person has done, or might want to do. (HBO’s Game of Thrones, unable to wait for George R. R. Martin’s final novels before finishing its series, famously went off in its own direction.) Offred, played by Elisabeth Moss, is named June in the show, which Atwood understands, because she says it’s impossible to have a TV character without a name—you can’t have everyone keep saying, “Hey, you,” for multiple seasons. Similarly, while Gilead in the novel is a white-nationalist state, Hulu’s diversity policy, she said, necessitated Miller’s making his version of Gilead essentially color-blind.\n\nIn jumping forward in time with The Testaments, Atwood is leaving Miller space to finish June’s story. There are also revelations in The Testaments that confirm specific details in the series, including the names of Offred’s two children. For that, Atwood said, each side got to pick a name. The TV people chose Agnes, which means “holy,” or “chaste.” She chose Nicole, which means “victory of the people.” Atwood was meticulous in her efforts not to say anything evaluative about the Hulu series, although she did say that she loves Miller. (She also adores Sarah Polley, whom she said did a “tippity-top job” in adapting her 1996 novel, Alias Grace, for CBC and Netflix.) And yet, by focusing so much of The Testaments on Aunt Lydia, Atwood also appears to be staking her own, unchallengeable claim to the character. For the duration of her career, people have tried to put Atwood in boxes—Female Writer, Feminist Writer, Political Writer, Canadian Writer, Prophet. (The only label she seems to appreciate, for the record, is “clairvoyant,” since the world has gone on to graciously prove her right on several occasions.) In a blistering 1976 essay titled “On Being a Woman Writer,” Atwood rails against the people who’ve tried to claim her for various political causes, against what she sees as “the development of a one-dimensional Feminist Criticism,” and against interviewers who insist on “trying to find out what sort of person you are.” The worst interviewer of all, she writes, is “Miss Message,” a person incapable of understanding her work for what it is (fiction), and hell-bent on trying to get her to say something about an issue that turns her into “an exponent, spokeswoman, or theorist.” (When I read this essay a few weeks after our interview, I gulped.)\n\nThe adoption of The Handmaid’s Tale as a seminal feminist text has always troubled her—large parts of the novel are a repudiation of the second-wave feminism embodied in Offred’s memories of her mother. For similar reasons, Atwood has tended not to identify herself as a feminist, although by most modern interpretations of the term she fits the bill. She wanted to write The Handmaid’s Tale, she documents in her 2005 book Moving Targets, as a counterpoint to speculative works such as 1984 that had sidelined women characters—to create “a dystopia from the female point of view.” However, she clarifies, “this does not make The Handmaid’s Tale a ‘feminist dystopia,’ except insofar as giving a woman a voice and an inner life will always be considered feminist by those who think women ought not to have these things.” Her rejection of “feminist” as a label, then, isn’t because she doesn’t think women are and should be equal to men in intellect and status and humanity. It seems to be related to the imperfect ways in which her work has been co-opted over the years. More than ever since the 2016 election, feminism has become a marketing tool—a gauzy, Spotify-playlist-blasting, pussy-hat-wearing, immensely profitable bandwagon. The ill-fated announcement in 2018 of a branded Handmaid’s Tale wine collection, featuring an “earthy” Offred Pinot Noir, a “bold” Ofglen Cabernet, and a “sophisticated” Serena Joy Bordeaux Blanc, exemplified late capitalism’s most shameless instincts to sell things to women. (The wine collection was canceled, following significant backlash, just 24 hours after it was announced.)\n\nAtwood’s Offred—compelling, astute, and utterly powerless—isn’t a feminist icon. (The Hulu series might disagree on this note.) She’s a character in a novel. So, too, is Aunt Lydia. In electing to dedicate so much of The Testaments to Lydia’s narrative, Atwood is making sure that readers remember this about her work. Her characters aren’t meant to be quoted in inspirational memes, or reproduced on placards, or held up as paragons of empowerment or feminist virtue. They’re meant to be compelling to read about. Atwood has long chafed at the idea that she’s doing women a disservice by painting them as complex individuals with the capacity to be as good and bad as men are. Women, both as characters and as people, she writes in the 1978 essay “The Curse of Eve—Or, What I Learned in School,” have to “be allowed their imperfections.” (When I made the fatal error of saying something platitudinous about what women can do when they work together, Atwood responded in a flash, “Them and bonobo chimps.”) The Testaments, then, is both a novel and an act of correction. Being as venerable as Atwood is inevitably means you will be claimed by the world, and to be claimed by the world means having your work interpreted (and co-opted) by people whose intentions and ideas don’t always align with yours. It means having film and television writers rework your stories into different forms, and stretch and remodel them in ways that you might be okay with, or you might not. The imperfect interpretation of Atwood’s work is so inevitable that it’s written into The Handmaid’s Tale, in a final section of the novel set hundreds of years in the future wherein a professor of “Gilead Studies” tries to analyze the tapes on which Offred’s narrative has been recorded, bringing his own biases to the process.", "description": "With her new book—the much-awaited sequel to The Handmaid’s Tale—the Canadian author is leading a resistance. But it’s not the one you might think.", "authors": ["Sophie Gilbert"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/GettyImages_886965880/facebook.jpg?1567649387", "published_at": "2019-09-05"}