{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7577163/Channel-Seven-weather-presenter-Jane-Bunn-hosts-important-charity-event.html", "downloaded_at": "2019-10-16 03:58:14.436525+00:00", "title": "Channel Seven weather presenter Jane Bunn hosts important charity event", "language": "en", "text": "Weather presenter Jane Bunn lent her star power to a charity event last week.\n\nThe 40-year-old Channel Seven weather presenter hosted the Purple Ladies Lunch on Friday.\n\nUnsurprisingly, Jane was well-prepared for the chilly weather in Melbourne, wearing a conservative yet figure-hugging top and pale blue flowing skirt.\n\nGenerous Jane! Weather presenter Jane Bunn lent her star power to a charity event last week. The 40-year-old Channel Seven weather presenter hosted the Purple Ladies Lunch on Friday\n\nThe event was designed to raise money to fight bone marrow failure syndromes and Jane was happy to help, praising the event online.\n\n'What an afternoon hosting 180 ladies at the Purple Ladies Lunch, hearing stories from an inspirational lineup of speakers - all to raise funds for #maddiesvision,' she wrote on Instagram.\n\nMaddie's Vision is dedicated to Maddie Riewoldt, who tragically died after living with the autoimmune disease Aplastic Anaemia for five years.\n\nStar power: Jane was joined by Alex Fevola, second from left, and Fifi Box, middle\n\nRed carpet ready: Jane recently put on a glamorous show as she attended the launch of the Caulfield Cup Carnival\n\nAlso in attendance was former St Kilda player Nick Riewoldt, who backed the event and thanked Jane online for her support, as well as Alex Fevola and Fifi Box.\n\nMeanwhile, Jane's recently spoke about the unfortunate downside of her soaring popularity.\n\nShe told the Herald Sun that while many of her Internet fans are perfectly polite, others bombard her with lewd comments.\n\n'I will [only] answer your question if it is clean. If it is all above board, I am very happy to answer your question, if it is not, I am not going to give you that time,' she said.\n\nJane added: 'I will literally skim comments so fast and all I am looking for is a weather question, as in has someone asked something that is legitimately about the weather that I can help with.'", "description": "Weather presenter Jane Bunn lent her star power to a charity event last week.", "authors": ["Tom Place For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/23/19762764-0-image-a-5_1571179326671.jpg", "published_at": "2019-10-16"}