{"pub": "washingtonpost", "url": "https://washingtonpost.com/entertainment/tv/emmy-night-proved-two-things-tv-shows-are-great-right-now-and-some-awards-shows-really-really-need-a-host/2019/09/22/3e3e2820-dd86-11e9-8dc8-498eabc129a0_story.html", "downloaded_at": "2019-09-23 07:31:19.505428+00:00", "title": "2019 Emmys: TV shows are great right now and some awards shows really, really need a host", "language": "en", "text": "TV critic\n\nHBO’s “Game of Thrones” won its final Emmy Award for outstanding drama series Sunday night, for the season nobody really liked, the season everyone nitpicked to death — and good for them.\n\nWhat are you gonna do about it? Take solace in Amazon Prime’s “Fleabag,” a rare gem of a show that won outstanding comedy series. It’s British and brilliant, and has gained in popularity all year long as more and more viewers raved about it to their friends. People telling you to watch “Fleabag” aren’t any more annoying than all those people who told you to watch “Game of Thrones,” right?\n\nNow, with that business out of the way, let’s talk about these hostless awards shows: It doesn’t always work out so well, does it?\n\n“You know what has a host?” asked ABC’s late-night host Jimmy Kimmel, called to the stage at one point to present a category with his CBS rival, Stephen Colbert. “Applebee’s has a host.”\n\nBoth men have hosted past Emmy Awards shows, and although they were joking about the absence of one, the night’s proceedings actually validated their digs. “You know who the real victims are, here?” Colbert asked. “Us.” Followed by a joke that producers of awards shows might as well hand over all hosting duties to that ubiquitous in-home listening device, Alexa.\n\nAnd sure enough, the voice of Alexa butted in and presented the nominees. (Let’s be careful here, guys. Too many awards shows like this one and Alexa really will get the job.)\n\nWhereas the most recent Academy Awards seemed to function well enough without a host, the producers of Fox’s telecast decided to make a running gag of it from the get-go and throughout the night, dragging Homer Simpson, Anthony Anderson and Bryan Cranston into a sad opening bit about pinch-hitting and the glories of television and so on. It was the start of a sluggish and somewhat messy evening of odd segues and handoffs.\n\nMeanwhile, it was the viewer’s good luck that the nominees in most of the categories were across-the-board stellar, representing some of the best TV made this century so far. TV is so good that we’ve apparently added an “in memoriam” reel to the Emmy proceedings for all the shows that had their final seasons in the past year.\n\nGratifying victories for viewers and critics alike included Billy Porter’s lead actor award for the FX drama “Pose” (“The category is love, y’all,” Porter proclaimed in the voice of his character, Pray Tell, “LOVE”); a win for HBO’s “Chernobyl” for outstanding limited series; Jharrel Jerome’s lead actor award for Netflix’s limited series “When They See Us”; and Michelle Williams’s lead actress award for her portrayal of Broadway legend Gwen Verdon in FX’s limited series “Fosse/Verdon” and her empowerment-laced, ­listen-to-\n\nwomen and pay-them-equally acceptance speech. (Standing ovation for that.)\n\nAlex Borstein won her second consecutive supporting actress Emmy for Amazon Prime’s comedy “The Marvelous Mrs. Maisel” — and she gave one of the evening’s other rousing acceptance speeches, with a salute to the memory of her Holocaust-surviving grandmother, who had the courage, Borstein said, to step out of a firing-squad line. “So step out of line, ladies,” Borstein said. “Step out of line!”\n\nAnother highlight were two more well-deserved Emmys for Phoebe Waller-Bridge, riding high now that everyone has found and fallen for “Fleabag.” When she won one of the night’s early awards, for comedy series writing, Waller-Bridge said, “I find writing really, really hard and really painful, but I’d like to say honestly from the bottom of my heart, the reason I do it is this.” And she held up her shiny Emmy statuette. Cheeky thing.\n\nMinutes later she was back onstage, having won the best actress award for comedy — beating “Veep’s” Julia Louis-Dreyfus, who stood to win her seventh Emmy for that show. Waller-Bridge accepted her second statuette and brilliantly began the same speech: “I find acting really hard and really painful but it’s really all about this.” No wonder everybody adores her.\n\nBut back to the hostlessness problem. I like the idea in theory, but now we have an example of how it can go wrong in practice.\n\nAfter a promising early bit with Ben Stiller presenting lifelike wax figures of comedy legends George Burns, Lucille Ball and Bob Newhart (who, at 90, turned out to be alive and ticked off at the suggestion that he isn’t), the evening’s stabs at lighthearted non-hosting momentum began to sink. Precious time was given over to known attention whores, like late-night host James Corden, actor and cutup Ken Jeong (who attempted to make a Tik-Tok clip) and “Righteous Gemstones” co-star Adam DeVine, trying his best at the center of an intentionally bad musical number. If nothing else, a host could read the room and self-deprecate as necessary.\n\nAt one point even the production booth took a turn narrating the show. “Cue Kardashians,” a woman in front of a wall of monitors commanded, and lo, they were cued — Kim Kardashian and Kendall Jenner, who elicited some guffaws from the audience by suggesting that reality TV depicts people as they really are. (Yeah, sure.)\n\nActor Thomas Lennon served as a sort of off-screen emcee and snappy snarker — a lousy assignment for such a likable and funny guy. He was saddled with terrible lines, such as: “It is now official, Patricia Arquette goes to the Emmy stage more frequently than she goes to Trader Joe’s. (Arquette, who won supporting actress in a limited series for her role in “The Act,” wasn’t feeling so jokey, however, and instead gave a moving salute to her late sister, Alexis, a transgender activist and actor who died . . . in 2016.)\n\nAn awkward low point came when the stars of “Game of Thrones,” on hand to kick off the presentation of the limited-series categories, were stiffly lined up on the stage and forced to read lines about their feelings about the end of their blockbuster run. They looked like they’d rather be anyplace else — and that’s weird, because this is supposed to be their last big night together, after a year of final folderol. Maybe they’re more than over it.\n\nThe cast of “Veep” was brought out for a similar police lineup and proper send-off, but they demonstrated a far better knack for not taking themselves too seriously. Louis-Dreyfus, especially: “I’m sorry,” she deadpanned. “I was told I would be up here alone.” (She who laughs last, or something like that.)\n\nDisclosure: The Washington Post is owned by Amazon chief executive Jeff Bezos.", "description": "‘Game of Thrones’ and ‘Fleabag’ won the biggest prizes on a night when the telecast itself was sluggish and somewhat messy.", "authors": ["Hank Stuever", "Tv Critic", "September At Pm", "Hank Stuever Has Been The Washington Post'S Tv Critic Since He Joined The Paper In As A Reporter For The Style Section", "Where He Covered Popular Culture."], "top_image": "https://www.washingtonpost.com/resizer/VLHzuYMX7VCzecfpCKxpFSceBHc=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/R56LC3W5TQI6TPUWNLNYDAQ6SA.jpg", "published_at": "2019-09-22"}