{"pub": "cnn", "title": "Eating more gluten early in life is tied to children's higher risk of celiac disease", "url": "https://cnn.com/2019/08/13/health/gluten-celiac-disease-children-trnd/index.html", "language": "", "published_at": "2019-08-13", "downloaded_at": "2019-09-02 07:39:17.757290+00:00", "text": "(CNN) Bad news for lovers of bread, pasta and baked goods : Eating lots of gluten-heavy foods from a young age could eventually lead to gluten intolerance.\n\nA study published Tuesday in the journal JAMA suggests that eating higher-than-normal levels of gluten during the first five years of life can increase a child's likelihood of developing celiac disease, a digestive disorder that damages the small intestine.\n\nHigher gluten intake was associated with a 6.1% increased risk of celiac disease autoimmunity, an immunological response to gluten, and a 7.2% increased risk of celiac disease per each additional gram or gluten per day, according to the study.\n\nResearchers evaluated more than 6,600 newborns in the United States, Finland, Germany and Sweden born between 2004 to 2010. All of the children carried a genotype associated with Type 1 diabetes and celiac disease.\n\nEvery few months, the study's authors recorded the children's gluten intake until the age of 5 and compared the levels to reference amounts of gluten intake in healthy children at each age\n\nOver the course of the study, 1,216 of the children -- nearly 20% -- developed celiac disease autoimmunity, the first sign of the body's negative response to the protein, said study author Carin Andrén Aronsson, study manager at the Unit for Diabetes & Celiac Disease at Lund University in Sweden.\n\nAnother 450 participants developed celiac disease, about 7%. Most of the diagnoses occurred between the ages of 2 and 3, according to the study.\n\nCeliac disease affects millions of people\n\nIn people diagnosed with celiac disease, eating gluten damages the lining of the small intestine and prevents nutrient absorption. It's estimated to affect about 1 in 100 people worldwide, and more than 2 million people might not even know they have it, according to the Celiac Disease Foundation\n\nGluten intake is considered to be a factor in developing celiac disease, but according to Tuesday's study, quantity plays a major role, too.\n\nGoing gluten-free is increasingly popular\n\nGluten-free foods are increasingly popular, even for those without a gluten intolerance . Since the 1940s, the diet has been touted as a way to reduce bloating and shed weight, though nutritionists today don't necessarily support those claims.\n\nWhen dieters cut out gluten, they sometimes risk nutritional problems. Gluten-free products often replace glutenous ingredients with things like tapioca and white rice flour, which often contain higher amounts of calories, sugar and fat than gluten, dietitian Julie Stefanski told CNN in 2018\n\nGluten products can also be high in fiber and fortified with vitamins and iron, so eliminating the source of those nutrients could cause digestive problems for those without celiac disease, she said.\n\nDitching gluten completely is the only way to manage celiac disease, according to the University of Chicago's Celiac Disease Center . Aronsson recommends that parents of young children with the gene temper their level of gluten consumption to prevent the onset.\n\nStill, she said, there's no known \"safe limit\" of gluten for children who carry the genotype for celiac disease.", "description": "Bad news for lovers of bread, pasta and baked goods: Eating lots of gluten-heavy foods from a young age could eventually lead to gluten intolerance.", "authors": ["Scottie Andrew"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/181015173418-04-panera-whole-grain-label-file-restricted-super-tease.jpg"}