{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-2457932/David-Beckham-sports-baker-boy-hat-returns-LA.html", "downloaded_at": "2019-10-22 13:56:29.946467+00:00", "title": "David Beckham sports baker boy hat as he returns to LA", "language": "en", "text": "The fabulous baker boy! David Beckham sports his favourite floppy hat as he returns to Los Angeles with a mysterious black case\n\n\n\nHe was last spotted prancing across a London rooftop in his briefs while filming a new ad for his latest underwear range.\n\n\n\nBut it was a fully clothed David Beckham who touched down in Los Angeles on Saturday carrying a very large leather case.\n\n\n\nThe former England captain looked casual in a loose fitting T-shirt that adequately displayed his distinctive sleeve tattoos as he made his way out of the city’s LAX airport.\n\nWhat's in the box? David Beckham leaves LAX airport in Los Angeles carrying a large black case on Saturday\n\nBeckham, 38, matched his simple top with a pair of equally conventional slim fitting jeans, while the overall look got a relaxed flourish courtesy of his scuffed boots.\n\n\n\nThe obligatory shades – de-rigueur in sunny LA – were present and correct, while the floppy ‘Baker-Boy’ hat, something of a mainstay on the Beckham head of late, finished things off.\n\nWhile the contents of his large leather case remained a mystery, it looked big enough to store the weighty £14.1 million he paid himself last year from his image rights company.\n\n\n\nBeckham retired from football at the end of last season after helping French side Paris Saint Germain claim the Ligue 1 title.\n\nThe fabulous baker boy: David Beckham sports his favourite 'Baker-Boy' hat as he makes his way out of LAX carrying a large black case on Saturday\n\n\n\nBut despite stepping away from the game that made him rich and famous the former Manchester United, Real Madrid and Los Angeles Galaxy midfielder has boosted his earnings thanks to a string of lucrative commercial deals.\n\n\n\nThose include his long-term sponsorship with Adidas, a successful line in fragrances and the underwear range he endorses for popular high-street chain H&M.\n\n\n\nFootwork Productions – the London based company that is co-directed by David and Victoria Beckham – boosted its annual turnover by a healthy eight per-cent following his retirement.\n\n\n\nThe company had previously outlined its manifesto ‘the exploitation of David Beckham’s name and image rights.’\n\n\n\nBeckham’s last promotional activity came in September, when he paraded across a Brick Lane rooftop in London’s East End, often attached to a safety harness, while he filmed a new commercial for his H&M range.\n\nPreviously: The former England captain was also spotted parading across a London rooftop in his briefs while he filmed a new advert for high street chain H&M\n\n\n\n\n\n\n\n", "description": "The former footballer was dressed casually as he jetted into Southern California on Saturday lugging a very distinctive case.", "authors": ["Jason Chester"], "top_image": "https://i.dailymail.co.uk/i/pix/2013/10/13/article-0-18B83A6B00000578-477_636x382.jpg", "published_at": "2013-10-13"}