{"pub": "financialpost", "url": "https://business.financialpost.com/opinion/terence-corcoran-call-for-immigration-boom-so-canada-reaches-100-million-people-a-blueprint-for-more-state-intervention", "downloaded_at": "2019-10-25 16:04:23.464672+00:00", "title": "Terence Corcoran: Call for immigration boom so Canada reaches 100 million people a blueprint for more state intervention", "language": "en", "text": "In October 2016, about a year after Justin Trudeau’s Liberals were elected with a majority, the government’s Advisory Council on Economic Growth’s first report set out a bold agenda: Canada should aim to become a nation of 100 million by the end of the century.\n\nThe council, headed by one of Trudeau’s economic gurus, Dominic Barton, proposed increasing annual immigration to 450,000 a year by 2021, launching the country toward escalating prosperity created by “skilled and talented people” eager to build a nation of “inclusive economic growth.”\n\nThrough the fevered immigration environment of the last three years, the objective has mostly faded from the policy agenda. In the wake of another election, Barton and other advocates of an immigration boom are back with another report on the same ambitious theme.\n\nThe new report from Century Initiative, an organization co-founded by Barton, reiterates the grand claims that a larger population is the key to a prosperous economic future. “We believe that putting Canada on track for a population of 100 million Canadians in 2100 should be central to Canada’s bold response to this century’s challenges,” the report says.\n\nAlong with Barton — former global head of McKinsey & Company and now Canada’s ambassador to China — the Century Initiative’s backers include Goldy Hyder, CEO of the Business Council of Canada, and Mark Wiseman, former head of the Canada Pension Plan Investment Board. Whether their new report, titled For a Bigger, Bolder Canada, can trigger a national crusade for a new immigration boom is debatable.\n\nCanada needs immigrants. Along with the United States — where former President John F. Kennedy’s last book was titled A Nation of Immigrants — Canada was built by newcomers, most of them refugees of one sort or another, who brought their talents, ambitions and cultures to a country that still today remains a vast under-populated wilderness.\n\nIn the current economic and political environment, smothered as it is in angst about climate change and warnings of global over-population and man-made environmental crises, amid clashing cultural and religious nationalisms and border-fencing plans, calls for opening Canada to more immigrants seems somewhat out of touch. To describe Canada today as a vast under-populated wilderness is itself politically incorrect. Such wilderness should be protected, not exploited by grubby humans looking for growth.\n\nThe report tries to edge through the environmental arguments against a larger population by claiming that the existing trajectory of growth leaves Canada with a shortage of people to take on environmental challenges, including climate change. “Building a low-carbon economy requires scale, innovation and capital,” says the report, and a small population “limits the fiscal and human resources we need to move to a greener energy future.”\n\nThat’s a tricky proposition. If Canada had more people, the country could more effectively deal with shutting down the Alberta fossil-fuel industry?\n\nThe report’s call for a bigger and bolder country is actually a blueprint for bigger and bolder government planning and significant government intervention — beginning with a call for a “strategic immigration” plan and leading to the development of a “national childcare strategy” that includes policies to subsidize parental leave to overcome Canada’s “fertility gap.”\n\nNeither this country nor any other can accommodate open-border immigration, but the report’s prescriptions come with a controlling and elitist slant. Immigrants would have to be selected through “better systems to match immigrants to industries, sectors and places where they are most needed and have the best chance of succeeding.” Canada, it says, needs younger workers and an “influx of highly educated professionals, skilled trades people, general labourers and entrepreneurs.”\n\nCanada also needs a “50-year national infrastructure plan that has long-term funding certainty and can both revitalize existing assets and build new links — physical and digital — to connect Canadians, facilitate business and accommodate a country with 100 million people.” At the same time, governments should create “mega regions” of dense populations to create “nodes of economic activity.”\n\nOpening Canada to more immigrants is a sound idea that needs the backing of a lot more intellectual and conceptual heft than the economic jargon that fills Century Initiative report. While it contains many valuable insights, it is also grounded in excessive state planning and intervention. As one might expect from an organization associated with Dominic Barton, there’s a certain Xi Jinping tone to the prescriptions.\n\nDreams of a Canada filled with 100 million people date back more than a century. In 1896, the Liberal government of Wilfrid Laurier set up immigration promotion schemes that attracted more than three million immigrants between 1897 and 1914 — Poles, Russians, Germans, Italians, Chinese, Japanese, Irish and other nationals. Canada’s population increased by 40 per cent during the period.\n\nThe case for opening Canada’s borders remains strong. The question is whether Canada’s current leadership is able to re-create Laurier’s enthusiasm. He imagined 60 million by 2000; we are now at 37.7 million. A national dream of 100 million involves a wide and expanding view of the country. To do that will require a major shift in policy and perspectives on the state of the environment, climate change, economics and the nature of individual freedom.\n\nFinancial Post\n\n• Email: tcorcoran@nationalpost.com | Twitter: terencecorcoran", "description": "A report from an organization co-founded by Dominic Barton brings a certain Xi Jinping tone to prescriptions for a bigger, bolder Canada", "authors": [], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/dominic-barton.jpg", "published_at": "2019-10-25"}