{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/16/police-clash-with-catalonia-protesters-in-second-night-of-violence", "downloaded_at": "2019-10-16 13:54:20.045789+00:00", "title": "Jailed Catalan leaders call for end to violent protests", "language": "en", "text": "Plea comes as Madrid says violence will be met with ‘firm, proportional and united’ response\n\nThe nine Catalan leaders jailed this week over their roles in the failed push for regional independence two years ago have appealed for peaceful protests following two consecutive nights of violent unrest.\n\nTheir joint plea came as the Spanish government warned that the violent protests, which have led to dozens of arrests, would be met with a “firm, proportional and united” response.\n\nIn a tweet sent on Wednesday morning, the nine prisoners called for a huge but peaceful response to their imprisonment by Spain’s supreme court on Monday.\n\n“All support to mobilisations and massive and peaceful marches,” wrote the nine, who include the former regional vice-president Oriol Junqueras and two influential grassroots leaders, Jordi Sànchez and Jordi Cuixart. “No violence represents us.”\n\nPlanned peaceful demonstrations in Barcelona erupted into running battles with the police on Tuesday evening.\n\nProtesters lit fires and erected makeshift barricades in the city centre before the crowd was dispersed by baton charges by Spanish and Catalan police, as far as Passeig de Gràcia, the elegant boulevard that is home to many of the city’s most exclusive shops and hotels.\n\nBy mid-evening, dozens of fires had been lit on the boulevard and surrounding streets as helicopters hovered overhead. Makeshift barricades were set up with rubbish containers as skirmishes between demonstrators and police continued, with riot police firing numerous rounds of rubber bullets.\n\nSimilar scenes were witnessed in the other main Catalan cities of Tarragona, Girona and Lleida, where dozens of people were reportedly injured.\n\nThe Spanish government said 51 people had been arrested across Catalonia on Monday and Tuesday, and 54 officers from the regional police force and 18 from the national force had been injured.\n\n“A minority is trying to impose violence on the streets of Catalonia, especially in Barcelona. Tarragona, Girona and Lleida,” the government said in a statement.\n\n“It’s obvious that what we’re seeing is not a peaceful civic movement, but one coordinated by groups who use violence to upset co-existence in Catalonia.”\n\nThe statement paid tribute to the efforts of the police, adding: “The Spanish government’s unwavering aim is to guarantee safety and co-existence within Catalonia, and that is what it will do through its commitment to firmness, proportionality and unity.”\n\nThe caretaker government, led by the prime minister, Pedro Sánchez, has already said it could activate article 155 of the constitution, which would allow it to suspend the regional government and assume direct rule of the region.\n\nSánchez will meet the leader of the three main opposition parties on Wednesday to discuss the situation.\n\nPablo Casado, the leader of the conservative People’s party (PP), has called on Sánchez to activate the national security law, arguing that it is needed to ensure that Catalan police and intelligence services were brought under the control of the central government.\n\nSpain’s interior minister, Fernando Grande-Marlaska, appeared to rule out any drastic action, saying the national police force was working very well in partnership with its Catalan counterpart and adding: “At the moment there’s no need to alarm anybody.”\n\nGrande-Marlaska told the Catalan public broadcaster TV3 that the great majority of Catalans had reacted to the supreme court verdict with peaceful protests. But he called on the Catalan president, Quim Torra, to demonstrate “his clear opposition to the use of violence”.\n\nTorra has been criticised for calling for civil disobedience while sending in Catalan riot police to restore order. Torra said on Tuesday that the convicted prisoners were proud of the demonstrators and urged them to continue to mobilise over the coming days.\n\nThe calls for calm were echoed by Catalonia’s vice-president, who pointed out that the regional independence movement had always prided itself on peaceful actions and that violence would only play into the hands of its opponents.\n\n“Let’s not give them what they’re after,” Pere Aragonès tweeted on Tuesday night. “Let’s not hand them the hidden gift of a 155. We must defend our citizens and our institutions. Let’s refrain from violent behaviour.”\n\nTuesday’s disturbances came a day after thousands of pro-independence protesters attempted to shut down Barcelona airport, leading to police charges.\n\nCatalan health authorities said medical personnel had attended to 131 people on Monday. Twenty-four people were taken to hospital, including one man who suffered an eye injury that may have been caused by a rubber bullet.\n\nFive marches have been called for Wednesday, with protesters setting off to Barcelona from Girona, Tarragona, Vic, Berga and Tárrega. They are due to arrive in the Catalan capital on Friday, when a major demonstration and general strike are planned.\n\nAlthough Tuesday’s demonstrations were called by the Catalan national assembly, which has previously organised the independence movement’s peaceful and spectacular demonstrations, it appears that it may have lost the initiative to the so-called Committees for the Defence of the Republic (CDRs), who favour direct action and confrontation.\n\nMonday’s airport protest, meanwhile, was coordinated by a social network group called the Tsunami Democràtic.\n\nOn Wednesday, it also urged people to protest peacefully, saying: “Non-violence is a fundamental strategy of our movement owing to both conviction and the fact that it works: the civil disobedience movements of the past decades have repeatedly demonstrated its effectiveness.”\n\nThe latest unrest erupted on Monday after Spain’s supreme court acquitted the nine defendants of the charge of violent rebellion but convicted them variously of sedition, misuse of public funds and disobedience over their roles in the failed push for independence two years ago.\n\nJunqueras was jailed for 13 years, while Sànchez and Cuixart received nine-year sentences. The six others were given terms of between 10-and-a-half and 12 years.\n\nHours after the verdicts were announced, an international arrest warrant was reissued for the former Catalan president Carles Puigdemont, who spearheaded the push for independence.\n\nIt said Puigdemont, who fled to Belgium to avoid arrest by the Spanish authorities, was wanted for alleged sedition and misuse of public funds.", "description": "Plea comes as Madrid says violence will be met with ‘firm, proportional and united’ response", "authors": ["Sam Jones", "Stephen Burgen", "Carles Puigdemont"], "top_image": "https://i.guim.co.uk/img/media/54c448cb05444fa306db9ccff39a2b63e945e2cb/0_137_5184_3110/master/5184.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e177303943a0f5ddf23a80ee0f65f661", "published_at": "2019-10-16"}