{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/05/WS5d9802b0a310cf3e3556ed55.html", "downloaded_at": "2019-10-05 13:32:40.646928+00:00", "title": "China's Greater Bay Area busy laying foundation for innovation", "language": "en", "text": "Xinhua | Updated: 2019-10-05 10:40\n\nThe Hong Kong-Zhuhai-Macao Bridge promotes the development of the Greater Bay Area. WANG SHANGLIN/FOR CHINA DAILY\n\nGUANGZHOU -- Hong Kong man Andy Ng was surprised his shared workspace Timetable was rented out completely only six months after it had started operation in Guangzhou, capital of South China's Guangdong province.\n\nWhile studying economics at City University of Hong Kong, Ng set up his first business, developing an online education platform, but soon realized the Hong Kong market was too small. After earning a master's degree in the UK in 2017, Ng returned to China and chose Guangzhou as his new base.\n\nTimetable is now accumulating popularity and even fans in Dianping.com, China's major online consumer guide. Ng feels lucky that his business caught the implementation of the Guangdong-Hong Kong-Macao Greater Bay Area (GBA) development plan.\n\nThe bay area, covering 56,000 square km, comprises Hong Kong and Macao, as well as nine cities in Guangdong. It had a combined population of about 70 million at the end of 2017, and is one of the most open and dynamic regions in China.\n\nIn July 2017, a framework agreement on the development of the bay area was signed. On February 18 this year, China issued the more specific Outline Development Plan for the Guangdong-Hong Kong-Macao Greater Bay Area. One of its major aims is to develop the area into an international innovation and technology hub.\n\nThe plan proposes that innovation and entrepreneurship resources be shared in the bay area to provide more opportunities for young Hong Kong and Macao entrepreneurs.\n\nTimetable is a startup base of the Guangzhou Tianhe Hong Kong and Macao Youth Association, which has assisted 65 enterprises founded by Hong Kong and Macao young people since its establishment in October 2017.\n\nThe association and its four bases provide a package of services from training and registering to policy and legal consultation, said Chen Jingzhan, one of the association founders.", "description": "Hong Kong man Andy Ng was surprised his shared workspace Timetable was rented out completely only six months after it had started operation in Guangzhou, capital of South China's Guangdong province.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/05/5d9802b0a310cf3e979fd4c0.jpeg", "published_at": "2019-10-05"}