{"pub": "axios", "url": "https://axios.com/scoop-top-homeland-security-aide-resigns-amid-tensions-with-white-house-53e1f433-b3e1-476d-8299-3de2b3efd66f.html", "downloaded_at": "2019-10-12 00:16:17.372145+00:00", "title": "Top aide to DHS Secretary Kevin McAleenan resigns over tensions with White House", "language": "en", "text": "\"Meehan, who was in Panama in advance of the secretary's visit during the Flores rollout, made the decision to leave government a couple of weeks ago,\" a senior DHS official told Axios.\n\nThe White House and DHS did not respond to Axios' requests for comment.\n\nBehind the scenes: These growing tensions were exacerbated by what some White House officials saw as DHS’ botched rollout of a new proposal that would reverse the Flores agreement, a decades-old court decision that prevents the government from holding minors in detention for longer than 20 days with their parents, per sources with direct knowledge.\n\nWhite House press and communications officials were frustrated with McAleenan for holding a press conference about the new proposal at the Ronald Reagan building, which houses U.S. Customs and Border Patrol's D.C. office, rather than at a location like the White House that would have attracted more media attention, according to senior administration officials.\n\n\"Flores is a huge deal to the president,\" a senior official said. \"This is the underpinning of the whole fight. This just seems to me this is a very important rollout and they ... undersold it at the Reagan Center.\n\n\"[McAleenan] could have been on all the TVs if he wanted to. But not everybody's taking live coverage from the Reagan Center at the last minute. At some point something has got to go right at DHS with their messaging and rollouts.\"\n\nTrump was also dissatisfied with the coverage of the July ICE raids. Stories from Breitbart and the New York Times that stated that only 35 of the roughly 2,000 migrants ICE targeted were detained angered the president, a source with direct knowledge said. Not long after the raids, Carol Danko, the spokesperson for ICE, was pushed out, White House officials tell us. Danko says she resigned.\n\nA senior White House official added in a text: “Decision to fire Carol Danko was made by ICE, not WH, although we support whatever they feel is necessary to manage their team. There was disagreement between WH and DHS Comms on how to execute the Flores rollout, but COS ultimately signed off on the plan as executed.”\n\nHowever, a source familiar says the decision to remove Danko was made by senior DHS officials, not ICE officials.\n\nThe big picture: McAleenan's position at DHS has been fraught for weeks, and it's an open secret within the White House and DHS that Trump prefers acting U.S. Citizenship and Immigration Services director Ken Cuccinelli and acting Customs and Border Protection director Mark Morgan, who have fiercely defended his immigration policies on TV.\n\nCNN reported earlier this month that McAleenan was prepared to resign in June and that he had felt \"undermined\" by subordinate immigration hardliners.\n\nMcAleenan, who Trump has called \"an Obama guy,\" was a career official before becoming a political appointee under Trump.\n\n\"Going from [former DHS Secretary Kirstjen] Nielsen to McAleenan makes no sense,\" a senior administration official said. \"McAleenan doesn’t agree with the president on immigration, and that’s no secret. It’s unclear why he's even still there.\"\n\nEditor's note: This story has been updated with new details about Danko's removal, and to reflect that McAleenan's position at DHS, not ICE, has been fraught for weeks.", "description": "His exit comes amid frustration in the White House over DHS's handling of major policy rollouts.", "authors": [], "top_image": "https://images.axios.com/LrbXpvvxL276XGFNeyszmt9aCEk=/0x94:4193x2453/1920x1080/2019/08/22/1566490200158.jpg", "published_at": "2019-08-22"}