{"pub": "yahoo", "url": "https://news.yahoo.com/dallas-tv-station-apologizes-for-prioritizing-cowboys-game-over-tornado-warning-022614636.html", "downloaded_at": "2019-10-22 15:40:17.419206+00:00", "title": "Dallas TV station apologizes for prioritizing Cowboys game over tornado warning", "language": "en", "text": "Viewers will be mad either way, so it's probably best to err on the side of potentially life-saving information over a football game. (Tom Pennington/Getty Images)\n\nPowerful tornadoes swept across Dallas on Sunday night, destroying property but sparing lives.\n\nMayor Eric Johnson declared the city “very fortunate,” and meteorologist Patrick Marsh told the Associated Press that early alerts led to residents taking shelter as no fatalities were reported in the storm’s aftermath.\n\nDallas station blasted for sticking with Cowboys game\n\nOne local station declined to prioritize delivering that alert to its viewers. The Dallas Cowboys were playing the Philadelphia Eagles on NBC 5, which delayed breaking into programming to deliver a tornado warning during the game.\n\n[Watch live NFL games on the Yahoo Sports app, here's how]\n\nSome residents questioned the station’s priorities, blasting the decision on Twitter to not break away from the game.\n\nSo there's been several tornadoes in the DFW Metro this evening and the NBC affiliate there did not break away from Sunday Night Football to cover the weather. People are justly angry. #txwx pic.twitter.com/QyBF7Wvi8Z — Sam Ritter (@ritter_wx) October 21, 2019\n\nNBC 5 apologizes\n\nThe backlash prompted an apology Monday afternoon from NBC 5 management:\n\n“During Sunday night's Dallas Cowboys game, we made a mistake by not immediately interrupting the football game with a Tornado Warning,” the NBC 5 statement reads. Although our meteorologists were tracking thunderstorms across the area when the National Weather Service issued a Tornado Warning for Dallas County, we delayed breaking into programming for six minutes. Our meteorologists were also streaming live weather coverage throughout the evening on our site, NBCDFW.com. We also alerted the football audience to our weather livestream throughout the game. When it comes to dealing with severe weather, we know that seconds matter. We should have broken into football programming sooner. We apologize and want you to know that we’re doing everything in our power to make sure this does not happen again. We look forward to regaining the trust of anyone we may have disappointed.”\n\nFans also get mad when their games are interrupted\n\nSunday’s drama wasn’t the first time a dire weather warning in the region created conflict. Tulsa, Oklahoma meteorologist George Flickinger was fired in 2006 for his programming decision during an outbreak of wildfires during an NFL game.\n\nExcept he wasn’t punished for failing to deliver the news. He lost his job for breaking into a game between the Seattle Seahawks vs. New York Giants on KOKI 23 to warn viewers of the wildfires, many of whom were upset with the interruption.\n\nFlickinger found himself in a similar situation in May during an NBA playoff Game 7 between the Denver Nuggets and Portland Trail Blazers. This time he was working for WSET in Lynchburg, Virginia.\n\nHe made the same call, interrupting the broadcast with a double box to warn residents of tornadoes in the area.\n\nMeteorologist scolds angry sports fans\n\nOnce again, he received angry feedback. But this time he kept his job — and delivered a stern message for viewers who complained.\n\nAfter playing voicemails from angry viewers, Flickinger declined to apologize for the programming interruption as the station showed images of tornado devastation.\n\n“Thankfully, no lives were lost, and that’s why when we go on TV and stay on over programming and commercials,” Flickinger said. “You never know when someone new is tuning in and looking for critical information to protect themselves and their families. We take this responsibility very seriously, and if we had a chance to do it all over again, we would. Thank you for watching ABC 13, especially during severe weather.”\n\nFortunately nobody died in either of the tornado outbreaks. The lesson learned here is that viewers will be mad either way, whether a station does or doesn’t break into weather programming during a sporting event. So it’s probably best to err on the side of delivering potentially life-saving information.\n\nMore from Yahoo Sports:\n\n\n\n\n\n", "description": "Viewers will be mad either way, so it's probably best to err on the side of potentially life-saving information.", "authors": ["Jason Owens"], "top_image": "https://s.yimg.com/uu/api/res/1.2/r34koqLeEY9IEx9uzFdKrg--~B/aD0zMTE2O3c9NDY3NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/83dbad30-f46f-11e9-9f4b-694f1d52d0f7", "published_at": "2019-10-22"}