{"pub": "marketwatch", "url": "https://marketwatch.com/story/microsofts-earnings-report-will-likely-make-believers-out-of-cloud-software-skeptics-2019-10-22", "downloaded_at": "2019-10-22 16:05:54.561487+00:00", "title": "Microsoft’s earnings report will likely make believers out of cloud-software skeptics", "language": "en", "text": "Microsoft’s quarterly results to be released this week will tell us whether fears about the cloud-software industry are warranted.\n\nRevenue growth in the cloud sector has been phenomenal and, according to research firm Gartner, is poised to accelerate.\n\nMorgan Stanley and Evercore ISI analysts aren’t so bullish. They downgraded some cloud companies before they released earnings. The stock market showed tension cracks last week when Workday WDAY, +0.62% said human-capital-management-software growth was slowing to a 20% pace. Shares of Workday, Okta OKTA, -0.46% and Slack Technologies WORK, -5.05% among other companies, tumbled in response.\n\nThis week, we will see if the momentum from growth to value picks up steam. Don’t be surprised if cloud companies continue to report strong earnings. The goal for investors is to tune out the noise, as cloud-revenue growth is likely to defy the odds.\n\nIn a sweet spot\n\nMicrosoft MSFT, -0.36% is at an inflection point for cloud software (also known as SaaS) and cloud infrastructure (IaaS). Well-rewarded revenue growth in the cloud sector has taken more than a decade to accumulate, measuring a market worth $40 billion in IaaS and $95 billion in SaaS. However, it will take only three years to double this revenue. Although many cloud stocks will reap those benefits, Microsoft is especially well-positioned.\n\nAccording to Gartner, the cloud-services industry will grow at nearly three times the rate of overall IT services through 2022. Cloud infrastructure-as-a-service will grow at 27.5% in 2019 to $38.9 billion, and will reach 76.6 billion by 2022, or nearly 100% growth.\n\nOther areas where Microsoft excels, including platform-as-a-service (PaaS) and SaaS, will also nearly double. This helps to cement Microsoft’s IaaS market share, as Gartner also predicts 90% of organizations will purchase public cloud IaaS and PaaS from a single provider.\n\nAlthough it’s likely there will be some ups and downs on a quarterly basis, the market may be surprised to find that growth across the cloud industry occurs with, or without, a perfect economy.\n\nThis has been a challenging time for tech stocks, yet Microsoft’s shares have returned nearly 29% (with dividends reinvested) for one year through Oct. 18, compared with much lower returns for Amazon.com AMZN, -0.71%, Alphabet GOOG, -0.22% GOOGL, -0.21% and Apple AAPL, +0.27% :\n\nFactSet\n\nPrevious earnings reports\n\nMicrosoft’s stock has performed better because its hybrid cloud strategy began to take hold in 2018, two years after the first technical preview in 2016, and this spurred faster growth than the market estimated.\n\nLast quarter, Microsoft beat revenue expectations by $920 million and the consensus earnings per share (EPS) estimate by $0.16. The company exceeded expectations handily in the two quarters before that as well.\n\nMicrosoft will report fiscal first-quarter results Oct. 23 after the market close. The company’s fiscal fourth quarter was its best yet for commercial cloud, with revenue increasing 39% year-over-year. Azure had the strongest growth at 64%, followed by Dynamics 365 at 45% and Office 365 Commercial at 31%.\n\nHybrid cloud requires a closer look, and not only because it’s been showing up in the financial statements under Azure. It’s important to consider what will set Microsoft apart from other cloud IaaS providers, including Amazon, the leader, and Google Cloud. This is key to forecasting future earnings.\n\nHybrid cloud allows for scenarios where customers can keep their most sensitive data on their own servers while sending workloads to the private or public cloud that gain an advantage from mining data more efficiently and require improved accuracy and productivity.\n\nAzure’s strength in offering both on-premise and cloud in a hybrid solution has prompted Amazon to chase Microsoft with recent efforts to improve its hybrid strategy. Today, Azure claims more than 95% of the Fortune 500 as customers because of its hybrid flexibility.\n\nSecurity is a key concern\n\nUnderstanding hybrid provides transparency into how managers of companies with big budgets think and how they evaluate the cloud. Security is clearly a concern as on-premise servers continue to be in demand as a counterpart to the public and private cloud.\n\nThe Department of Defense (DoD) is a perfect example of an entity that would want to keep its most secure data with on-premise servers while leveraging the cloud for artificial intelligence and machine learning. Fortune 500 companies with substantial intellectual property are additional examples.\n\nI wrote a long-form analysis on why Microsoft would be a strong contender for a Pentagon contract when pundits had zeroed in on Oracle ORCL, -0.82%, International Business Machines IBM, +0.26% and Amazon. The contract is worth $10 billion over 10 years.\n\nBeyond the $1 billion in annual revenue, it’s the implications of which company the Pentagon chooses that is most important. That’s because the winner likely has the best security.\n\nThere are many instances in recent years where the DoD chose Microsoft for software and operating systems. Recently, the Pentagon awarded Microsoft a $7.6 billion contract to provide software. The Defense Enterprise Office Solution (DEOS) will provide email, calendar, video-calling and productivity tools to the U.S. military.\n\nIn May 2018, the U.S. intelligence community extended its agreement to use Microsoft products such as Azure Government, Office 365 and Windows 10 in a joint licensing agreement with Dell. At the time, Microsoft said more than “10 million government customers from every federal cabinet level, including the Department of Defense” rely on its Cloud for Government.\n\nIn November 2018, Microsoft won a $480 million contract with the DoD to bring 100,000 augmented-reality headsets into the military’s arsenal. The two-year contract will help soldiers prepare for combat training.\n\nThere were more contracts in 2016 to provide technical support to the Defense Information Systems Agency (DISA) and a contract that took effect in 2017 to provide 4 million laptops, desktops and mobile devices.\n\nMicrosoft’s advantage\n\nThere is no evidence that cloud revenue growth will slow in the short term. There could be minor earnings fluctuations, but the trend is carrying a lot of force, with projections to accelerate two to three times faster than what we’ve seen over the past decade. Microsoft is well-positioned across all cloud segments, and has an advantage with hybrid cloud solutions and security.\n\nDisclosure: The writer maintains a position in Microsoft shares.\n\nBeth Kindig is a San Francisco-based technology analyst with more than a decade of experience in analyzing private and public technology companies. She publishes a free newsletter on tech stocks at Beth.Technology and runs a premium research service .", "description": "The company is well-positioned for further gains, reflecting accelerating revenue growth in the industry.", "authors": ["Beth Kindig"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT725_MSFT_2_ZG_20191021144505.jpg", "published_at": "2019-10-22"}