{"pub": "reuters", "url": "https://ca.reuters.com/article/sportsNews/idCAKBN1WP23T-OCASP", "downloaded_at": "2019-10-10 15:12:23.556913+00:00", "title": "Take 5: Shanahan vs. McVay highlights Week 6", "language": "en", "text": "Two of the NFL’s brightest offensive schemers - the San Francisco 49ers’ Kyle Shanahan and the Los Angeles Rams’ Sean McVay - joined the NFC West in 2017, but they haven’t faced each other as contenders ... until Sunday.\n\nFILE PHOTO: Sep 22, 2019; Santa Clara, CA, USA; San Francisco 49ers head coach Kyle Shanahan stands on the field before the start of the game against the Pittsburgh Steelers at Levi's Stadium. Mandatory Credit: Cary Edmondson-USA TODAY Sports\n\nMcVay’s Rams have won three of four from Shanahan’s 49ers, with the only loss a meaningless season finale in 2017. But the Niners are roaring at 4-0, with schemes clicking on both sides of the ball, while the Rams are trying to solve recurring woes.\n\nLet’s explore both sides of the ball in Sunday’s critical divisional battle.\n\n1. Shanahan starting to get his due\n\nIt’s too extreme to call Shanahan underrated, but his scheming brilliance has taken a backseat to McVay’s since both were hired. That’s understandable — the Rams’ offense has been far more productive — but it’s partially because McVay has had better personnel.\n\nMcVay is the hottest name to media and fans, but coaches and personnel staff study Shanahan’s work just as closely, maybe even more. That’s not a knock on McVay, but rather speaks to Shanahan’s creativity and nuance, especially in his diverse run game.\n\nTrue to the Shanahan reputation, he relies heavily on zone (outside, inside, split) but also mixes in gap-scheme runs like counter and trap. Those aren’t just changeups — Shanahan disguises them to look like his core runs, only for defenses to commonly recognize too late. Add in wrinkles like jet and orbit motion, sift blocks and arc releases, and you get explosive runs (plus more elements to feature in play-action concepts).\n\nIt will be fascinating to see how Shanahan adapts without a core piece in fullback Kyle Juszczyk. Rather than signing a replacement, the 49ers will ask tight ends help fill the Swiss Army knife role. George Kittle is capable, but moving him full-time would leave a bigger hole at tight end, where Kittle is a top receiving option.\n\nHowever it shakes out, expect the Niners to emphasize 12 (one back, two TEs) and 13 (one back, three TE) personnel. Not only does Shanahan prefer heavier sets, but Wade Phillips’ defense is most exploitable in its base 3-4. There, Shanahan can scheme ways to get his backs and tight ends isolated on inexperienced linebacker Bryce Hager.\n\n2. Rams, McVay fighting off 2018 demons\n\nAs Shanahan’s offense has surged, McVay’s has drifted backward, with the same culprit. “Blueprints” of how to solve a given opponent are often overblown, but teams have repeatedly recreated what gave the Rams trouble late last year.\n\nThe Lions (in Week 13) used primarily Cover-4 against the Rams with moderate success, and Vic Fangio’s Bears shut them down a week later with heavy doses of Cover-4 behind 6-1 fronts (six men on the line of scrimmage, one off-ball linebacker) to disrupt McVay’s outside-zone running game. The Patriots did the same in Super Bowl LIII, and opponents in 2019 are unsurprisingly following suit.\n\nThe Rams still rank ninth in yards per play (5.99) but just 16th in yards per carry (4.18). They’ve countered 6-1 fronts with crack-toss plays attacking the perimeter, but defenses haven’t relented. Toss plays can only work so many times, as they rely partially on surprise.\n\nSome issues might fix themselves as new starters Joe Noteboom (left guard) and Brian Allen (center) gain experience, but it might be time for McVay to, like Shanahan, incorporate more diversity in the run game. With a mini bye for the Rams, and the 49ers on short rest, new looks could thrive on Sunday.\n\nCoordinator Robert Saleh has the 49ers’ defense disguising coverages well and playing extremely fast behind a great front four. McVay might need a few changeups to gain the upper hand.\n\n3. The so-called “blueprint” on Mahomes\n\nSpeaking of blueprints, many have pointed out that the Colts and Lions each gave Kansas City Chiefs quarterback Patrick Mahomes trouble in consecutive weeks with predominantly man coverage. Even more notable, the Colts did so despite a banged-up defense that normally skews zone-heavy.\n\nThere are common threads here — even dating back to the AFC Championship Game — but it’s hardly time to suggest teams have discovered Mahomes’ kryptonite.\n\nHe’s been without the game’s fastest player (Tyreek Hill) and his left tackle (Eric Fisher), then lost Sammy Watkins and aggravated his left ankle injury against the Colts. Hill and Watkins drastically change the equation when playing man coverage against the Chiefs.\n\nThe Texans, Sunday’s opponent, play plenty of man principles but mostly from an off position out of Cover-4. Expect Andy Reid and Mahomes to exploit a few such looks for big plays, unless J.J. Watt, Whitney Mercilus & Co. can completely overwhelm K.C.’s battered O-line.\n\n4. Which Eagles’ O-line shows up?\n\nPerhaps the league’s most talented unit, the Philadelphia Eagles’ offensive line doesn’t always play to its ceiling. Center Jason Kelce and especially right tackle Lane Johnson go through lulls now and then, between stretches of dominance.\n\nBut the Eagles’ front five tend to bring their best against top competition, which they’ll see on Sunday at the Vikings. Danielle Hunter (5.0 sacks, eight QB hits) remains an elite rusher, and Everson Griffen (3.0, nine) looks more like his 2017 self (13.0, 25) than the 2018 version (5.5, 15) who missed five games. Linval Joseph is one of the league’s stoutest nose tackles, a tough matchup for the undersized Kelce.\n\nEagles left tackle Jason Peters has started to show some cracks at age 37, though right guard Brandon Brooks has been even better than most could hope coming off a January ACL tear.\n\nThis should be an excellent battle, which could well decide the game.\n\n5. Browns must fix run defense, and fast\n\nThe Cleveland Browns have allowed 448 rushing yards over the last two games at 6.5 yards per carry. That’s usually a losing recipe, even in today’s pass-happy NFL.\n\nQuestions about the Browns’ discipline have centered around mercurial personalities and foolish penalties, but their run-defense discipline has been glaringly poor.\n\nUp front, Larry Ogunjobi runs hot and cold, while free agent import Sheldon Richardson has too often tried to penetrate and make plays himself. Rather than clogging holes and occupying blockers, he’s been washed down the line or upfield, widening other gaps and giving O-linemen cleaner access to Cleveland’s linebackers.\n\nExacerbating the issue, linebacker Mack Wilson — starting for injured Christian Kirksey — looks like the fifth-round rookie he is. A great athlete who plays like a teething puppy (i.e. biting at everything he sees), Wilson has been late diagnosing runs and caught out of his gap.\n\nCleveland’s pass defense has quietly excelled (6.62 yards per attempt allowed, 10th in the NFL) despite injuries, but that won’t matter against the run-happy Seahawks on Sunday if they can plow right through on the ground.\n\n—By David DeChant (@DavidDeChant), Field Level Media", "description": "Two of the NFL's brightest offensive schemers - the San Francisco 49ers' Kyle Shanahan and the Los Angeles Rams' Sean McVay - joined the NFC West in 2017, but they haven't faced each other as contenders ... until Sunday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439293200&w=1200&r=LYNXMPEF991EH-OCASP", "published_at": "2019-10-10"}