{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7604855/Boris-Johnson-hits-traffickers-Essex-lorry-tragedy.html", "downloaded_at": "2019-10-23 17:20:26.060661+00:00", "title": "Boris Johnson hits out at people traffickers after 39 are found dead in Essex lorry", "language": "en", "text": "Prime Minister Boris Johnson has today said that people traffickers 'should be hunted down and brought to justice', after 39 bodies were discovered in an Essex lorry container.\n\nIt comes as Home Secretary Priti Patel has also pledged for tougher sentences for human traffickers.\n\nPolice today began the task of identifying the victims, including a teenager, discovered at the Waterglade Industrial Park in Grays early on Wednesday.\n\nPolice said the lorry driver, a 25-year-old man from Northern Ireland, had been arrested on suspicion of murder.\n\nSpeaking at Prime Minister's Questions Mr Johnson said the situation was an 'unimaginable tragedy and truly heartbreaking'.\n\nPrime Minister Boris Johnson (pictured above) said those responsible should be 'hunted down'\n\nPutting the Brexit crisis aside, he said the 'full force of the law' would come down on those responsible.\n\nHe added: 'I know that the thoughts and prayers of all members will be with those who lost their lives and their loved ones.\n\n'I'm receiving regular updates. The Home Office will work closely with Essex Police as we establish exactly what has happened.'\n\nThe lorry is from Bulgaria and entered the UK at Holyhead in north Wales, one of the main ports for ferries from Ireland.\n\nPolice have said tracking the route of the lorry 'will be a key line of inquiry' amid concerns it may have made its way to the British mainland unchecked by avoiding the ports of Calais and Dover, which have more stringent monitoring of people smuggling.\n\nLabour leader Jeremy Corbyn also reflected on the tragedy, branding it 'unbelievable'.\n\nJeremy Corbyn (pictured above) also reflected on the tragedy, branding it 'unbelievable'\n\nPolice move the lorry container where bodies were discovered, in Grays, Essex as media outlets are also pictured on the scene\n\nHe said: 'Can we just think for a moment of what it must have been like for those 39 people, obviously in a desperate and dangerous situation, for their lives to end, suffocated to death in a container?'\n\nMs Patel also highlighted that she would be happy to engage in discussions with the Ministry of Justice in order to see what could be done about the situation.\n\nShe said that 'Home Office immigration officials will be working closely alongside them to establish how this horrific event came to happen.'\n\nHer comments came as Independent MP John Woodcock asked if Ms Patel would commit to reviewing the sentencing guidelines for human trafficking.\n\nPriti Patel (above) said she would be happy to engage in discussions with the Ministry of Justice\n\nMP John Woodcock asked if Ms Patel would commit to reviewing the sentencing guidelines for human trafficking\n\nMr Woodcock said despite the murder investigation, not every human trafficker subjects human beings to the same conditions.\n\n'And so in due course, will she commit to reviewing the sentencing guidelines for human trafficking. Is there not a case potentially to bring them into line with attempted murder where of course the maximum sentence is life imprisonment?'\n\nMs Patel replied: 'What we have seen basically through the actions of these traffickers is the worst of humanity and it is right that we use our law enforcement and all aspects of the law through existing legislation to make sure that justice is served and that the perpetrators are prosecuted.\n\n'He's raised the point about sentencing and of course we have frameworks right now for the sentencing guidelines. It's something that I'm very happy to discuss with the Ministry of Justice to see what more we can do.'\n\nTory Maria Miller (Basingstoke) called on Ms Patel to make sure that the police and CPS (Crown Prosecution Service) 'use the full force of the law' to tackle modern slavery.\n\nShe said: 'Particularly the freezing of assets of those who could be involved at an early stage, so that they are not able to squirrel away their criminal funds from such a murderous activity.'\n\nMs Patel replied: 'We must use every single lever of law enforcement as well to confiscate funds and assets of these individuals.'\n\nThis is while Thurrock MP Jackie Doyle-Price said the people smugglers responsible must be caught.\n\nShe told the House of Commons: 'To put 39 people into a locked metal container shows a contempt for human life that is evil.\n\n'The best thing we can do in memory of those victims is to find the perpetrators and bring them to justice.'\n\nRichard Burnett, chief executive of the Road Haulage Association also said drivers are targeted by the groups 'week in, week out'.\n\nHe said that it has 'posed a massive issue to hauliers for years'.\n\n'Drivers are facing challenges from smugglers and from gangs continuously. They have to be very careful about where they park up, they have to be very careful about checking seals on their trailers to make sure nobody has broken in.\n\nMigrants on the roof of a lorry as it moves along the A16 in Calais, France\n\n'There's a set of rules laid out by the Home Office to ensure that hauliers and drivers are checking to make sure they haven't got any migrants on board.'\n\nHe added that this has been a 'long term issue' and highlighted that several driver had also been attacked in recent weeks.\n\n'One was 'woken in the early hours of the morning by gun shots', he added.\n\nMigrant gangs are 'very sophisticated' in how they go about accessing trailers, he explained.\n\n'They'll cut holes through roofs, they'll pull doors back, they'll unbolt the doors and then re-bolt the doors.'", "description": "The Prime Minister's comments come after police began the task of identifying the victims, including a teenager, discovered at the Waterglade Industrial Park in Grays.", "authors": ["Terri-Ann Williams For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/18/20094122-0-image-a-18_1571850306760.jpg", "published_at": "2019-10-23"}