{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/jilted-lover-who-shared-revenge-20524725", "downloaded_at": "2019-10-07 00:21:52.674844+00:00", "title": "Jilted lover who shared revenge porn photos of ex-partner avoids jail", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA man cruelly shared explicit revenge porn photos of his former partner after she dumped him, a court heard.\n\nLuke Foley, 22, of Grimsby North Lincolnshire, also threatened to share the photos around the East Marsh area of the town.\n\nFoley admitted the revenge porn offence and was sentenced to 15 months in prison suspended for two years, Grimsby Live reports.\n\nHe also admitted affray from April 18 last year, when he attacked three band members at a music studio in Grimsby, and a burglary at a hair salon where £5,000 worth of hair and beauty products were stolen.\n\nJudge Roger Thomas QC ordered him to carry out 100 hours of unpaid work and undergo 15 days of rehabilitation activities.\n\n(Image: PA)\n\nThe judge said he was giving Foley a chance to mend his behaviour.\n\nJeremy Evans prosecuting said Foley had admitted sharing intimate photographs of his former partner after she ended their relationship.\n\nHe had threatened to disclose the photographs \"all over the East Marsh area of Grimsby.\"\n\nAnother of the offences he faced in court was the theft of £5,000 worth of hair and beauty products from Salon 17 in Batley, where he now lives.\n\nForensic investigators had taken blood samples from the scene. But they did not find a match from the police database.\n\nIt was not until Foley was arrested for other matters that the match was made, said Mr Evans.\n\nHe told how on April 8, last year three band members were packing up equipment from Cornerstone Studio in Pasture Street, Grimsby when they were confronted by Foley.\n\nMinutes later at around 9pm, Foley returned with associates armed with a baseball bat and a Staffordshire terrier which was not on its lead.\n\nViolence erupted and the band members' vehicle windscreen was smashed.\n\nThey and the studio owner sought refuge in the studio until Humberside Police attended. Foley was later arrested.\n\nMr Evans read details of a burglary at an hotel in Drury Lane, Wakefield where a guest had a mobile phone and identity cards stolen from his room in a sneak burglary which Foley also admitted.\n\nFor the defendant, Craig Sutcliffe said his client had gone downhill since suffering mental health difficulties and he is receiving help and now has family support.", "description": "Luke Foley, 22, of Grimsby North Lincolnshire, also threatened to share the photos around the East Marsh area of the town", "authors": ["Brendan Mcfadden", "Peter Craig", "Image", "Men Media", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20525031.ece/ALTERNATES/s1200/0_JS194992227.jpg", "published_at": "2019-10-06"}