{"pub": "businessinsider", "url": "https://businessinsider.co.za/coffee-regulations-impact-chicory-mixtures-like-ricoffy-2019-9", "downloaded_at": "2019-09-06 12:18:52.736283+00:00", "title": "South Africa has new draft rules about hot drinks, and Ricoffy, Frisco, and Koffiehuis are definitely not coffee – not even nearly", "language": "en", "text": "South Africa has new draft rules about what can be sold as coffee, and what can't.\n\nChicory mixtures have a place in the rules – but to be coffee mixtures, they need to be at least half coffee.\n\nThat means three South African favourites will definitely, absolutely, and undoubtedly not be coffee.\n\nFor more stories go to www.businessinsider.co.za.\n\nSouth Africa has new draft rules about what may or may not be sold as coffee in South Africa – and some firm favourite mixtures that reference coffee in their names will be in the \"not\" list.\n\n\n\nThe department of agriculture, land reform and rural development last week issued the first draft of “regulations relating to coffee, chicory and related products intended for sale in the Republic of South Africa, in terms of legislation that allows it to set standards for agricultural products.\n\nThe rules specify 11 categories of \"coffee, chicory and related products\" that range from pure ground coffee to pure chicory. Those include \"mixed coffee\" or \"coffee mixture\", which must be at least 75% coffee.\n\nThere is also a category for \"coffee and chicory mixture\", which can be up to half chicory – though it must still have a caffeine content of at least 0.6%.\n\nAt that lower limit, a coffee and chicory mixture will not have much of a kick. Under the draft rules instant coffee must have a caffeine content of at least 2.25% – nearly four times greater than coffee and chicory mix minimum – and instant decaffeinated coffee may contain up to 0.3% caffeine.\n\nAnything called \"coffee\" must be just that; neither ground coffee nor instant coffee may contain any flavouring or colouring under the rules. Ground coffee, or coffee powder, is also required to have \"the characteristic coffee flavour\".\n\nSee also: This is how the price of a cappuccino in South Africa compares to the rest of the world\n\nInstant coffee, meanwhile, must \"dissolve in boiling water in 30 seconds with moderate stirring\" to qualify for the name.\n\nCoffee essence, or liquid coffee extract, may have glycerol or sugar added – but no other ingredients.\n\nBy that standard Koffiehuis, which translates literally as \"Coffee House\", is not coffee because it contains glucose.\n\nMeanwhile neither Frisco nor Ricoffy qualifies as coffee under the draft rules, or as coffee mixtures – or even as coffee and chicory mixture. Both contain only 25% coffee.\n\nThe regulations are open for public comment until the end of September.\n\n\n\n\n\nReceive a daily email with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "Draft regulations about what you may or may not sell as coffee in South Africa say that even a coffee and chicory mixture must be at least half coffee and have a minimum level of caffeine.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9323/e654edac625747db8e671d4eb0f47ee5.png", "published_at": "2019-09-06"}