{"pub": "cbc", "url": "https://cbc.ca/radio/unreserved/uncovering-the-complicated-history-of-blankets-in-indigenous-communities-1.5264926/the-complicated-history-of-the-hudson-s-bay-point-blanket-1.5272430", "downloaded_at": "2019-09-13 00:57:25.612172+00:00", "published_at": "2019-09-06", "title": "CBC Radio", "language": "en", "text": "The iconic Hudson's Bay point blanket has a complicated history with Indigenous people in Canada. These blankets first appeared in Canadian trading posts in the 1700s, and aside from bedding, they also served as a form of currency, and were fashioned into robes.\n\nBut they took on a darker history, with rumours swirling that they were used to spread smallpox among First Nations in the 1700s and 1800s.\n\nPaul Hackett is an assistant professor for the University of Saskatchewan's faculty of geography. (Provided by Paul Hackett) \"I found absolutely no evidence that the Hudson's Bay company ever purposely infected anybody with blankets and smallpox,\" said professor Paul Hackett from the University of Saskatchewan, who has researched the history of the Hudson Bay blanket.\n\n\"That would have been very much against the interests of the Hudson's Bay Company to release a lethal disease among the people who are supplying their furs and buying their goods.\"\n\nBut even though Hackett never found proof in historical documents, he can't guarantee it never happened, considering he has heard oral history referencing similar practices.\n\n\"We know for instance in the 1700s that the British certainly purposely transmitted smallpox during the Seven Years' War at Fort Pitt, which is now Pittsburgh,\" said Hackett.\n\n\"And I'm wondering if there isn't some conflation of these things … and again, that's not me saying that it hasn't happened [in Canada] or that it isn't valid.\"\n\nWhether or not the Hudson's Bay Company transmitted smallpox with blankets, that narrative continues to appear in contemporary art produced by Indigenous people.\n\nAn iconic Indigenous print that prominently features the Hudson's Bay point blanket is Rosalie Favell's I Awoke to Find My Spirit Had Returned.\n\nRosalie Favell. I awoke to find my spirit had returned, 1999. (Resilience Project)\n\n\"It shows her awakening beneath the Hudson's Bay blanket, and onlooking is the cast of The Wizard of Oz. And instead of the uncle, it is Louis Riel looking through the window,\" said Jaimie Isaac, curator of Indigenous and contemporary art at the Winnipeg Art Gallery, where the piece is currently housed.\n\nIsaac said that the iconic point blanket continues to pop up in Indigenous art because \"it's emblematic of the trade histories … [and] the smallpox epidemic that happened in the early 1800s.\"\n\nIn her research, Isaac said she has read that Hudson's Bay Blankets were referred to in spreading smallpox.\n\n\"The research that I've looked through [said] there were letters apparently that were found and it was the commander in chief of British forces in North America, Jeffrey Amherst, in 1763 that encouraged the use of blankets infected with smallpox as a means of biological warfare,\" she said.\n\nBut whether or not the spread of the disease was intentional is unknown, said Isaac.\n\n\"The blankets were coming from European ships here to North America to then traded with First Nations … so the question on whether it was intentional or not is questionable.\"\n\nToday, artists are using the blanket to open up a discussion about Indigenous histories.\n\n\"To bring that material into contemporary narratives around our own histories, you know, it's another form of trade,\" said Isaac.\n\n\"By trading that information that we know, and that people have researched, and to bring that into a larger Canadian dialogue to kind of dismantle what we know about our histories … is a really interesting way of using the blanket in art.\"", "description": "The iconic Hudson's Bay point blanket has a complicated history with Indigenous people in Canada. These blankets first appeared in Canadian trading posts in the 1700s, and aside from bedding, they also served as a form of currency, and were fashioned into robes. But these blankets took on a darker history, with rumours they were used to spread smallpox.", "authors": ["Stephanie Cram"], "top_image": "https://i.cbc.ca/1.5273141.1567781396!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/rosanna-and-jamie.jpg"}