{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7615533/Rodgers-lauds-perfect-Leicester-performance-Saints-hit-nine.html", "downloaded_at": "2019-10-26 00:25:30.255167+00:00", "title": "Rodgers lauds `perfect´ Leicester performance as Saints...", "language": "en", "text": "Leicester boss Brendan Rodgers hailed a “perfect performance” after his side equalled the biggest win in Premier League history by demolishing 10-man Southampton 9-0.\n\nAyoze Perez and Jamie Vardy both scored hat-tricks as the Foxes matched Manchester United’s thumping March 1995 victory over Ipswich. It was also the biggest away win in the English top flight.\n\nBen Chilwell, Youri Tielemans and James Maddison were also on the scoresheet at St Mary’s as Leicester climbed up to second place in the table.\n\nLeicester City are on ☁️9️⃣ pic.twitter.com/pY8fdxnBsw — Premier League (@premierleague) October 25, 2019\n\nEmbarrassed Saints played for 78 minutes a man light after Ryan Bertrand became the first top-flight player to be shown a red card following a VAR review after his dangerous challenge on Perez in the build-up to Chilwell’s early opener.\n\n“It was the perfect performance. From the very first whistle in the game we showed our intent,” said Rodgers.\n\n“I’m so pleased with the performance, it had everything you could want.\n\nLeicester manager Brendan Rodgers was delighted with his side´s display (Andrew Matthews/PA)\n\n“We went in front, deservedly so. And then when Ryan got sent off, we showed a wonderful demonstration of how to play against 10 men.\n\n“The players made it look a lot easier than it actually is.\n\n“All round collectively it was an absolutely outstanding night and brilliant for the supporters to travel all the way down here on a wet night.\n\n“To see the team score nine goals and be very focused, hopefully they will be very proud.\n\n“It’s a brilliant win that equals records.”\n\nThe sensational scoreline inflicted a record defeat on the desperate hosts.\n\nPerez and Vardy, meanwhile, became only the second set of team-mates to score trebles in a Premier League after Jermaine Pennant and Robert Pires managed it against Saints for Arsenal in May 2003.\n\nThey each left the stadium clutching a match ball.\n\n0⃣-9⃣!! Unbelievable night! 😊🙃 You wouldn’t know how much I wanted to share this! 👉🏽⚽👈🏽👉🏽⚽👈🏽👉🏽⚽👈🏽 Come on @lcfc pic.twitter.com/pcbXALmWTI — Ayoze Perez (@AyozePG) October 25, 2019\n\nAfter being five goals up at the break, Rodgers was thrilled to see his players maintain their ruthless display in the second 45 minutes.\n\n“The message at half-time when it was 5-0 was to see it as 0-0 and go out and show we’re a really, really good side by pushing and showing a hungry mentality,” he said.\n\n“To go out and do what we did and show that ruthless streak, it shows we’re making steps to being a ruthless side.”", "description": "Ayoze Perez and Jamie Vardy both scored hat-tricks for the rampant Foxes.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/00/wire-20201660-1572045250-11_636x382.jpg", "published_at": "2019-10-25"}