{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/new-evidence-suggests-neanderthals-were-capable-of-starting-fires", "downloaded_at": "2019-10-25 23:52:46.791764+00:00", "title": "New Evidence Suggests Neanderthals Were Capable Of Starting Fires", "language": "en", "text": "Artist’s depiction of Neanderthals around a fire. (Illustration: James Ives)\n\nNeanderthals were regular users of fire, but archaeologists aren’t certain if these extinct hominins were capable of starting their own fires or if they sourced their flames from natural sources. New geochemical evidence suggests Neanderthals did in fact possess the cultural capacity to spark their own Paleolithic barbecues.\n\nIt pains me to admit, but if I were lost in the wilderness and I needed to start a fire without the benefit of a lighter or match, well, safe to say it would be a very cold night. Indeed, the ability to conjure flame still seems borderline magical to me—so imagine what the capacity to start a fire from scratch must have meant to early humans.\n\nAt some point, our ancestors harnessed the power of the flame to keep warm, cook food, produce new materials, shoo away predators, and illuminate dark caves. And of course, it provided a classic social setting, namely the campfire circle.\n\nArchaeological evidence suggests hominins of various types were using fire as far back as 1.5 million years ago, but no one really knows how they acquired that fire. This paradigm-shifting ability—to both intentionally start and control fire—is known as pyrotechnology, and it’s traditionally thought to be the exclusive domain of our species, Homo sapiens.\n\nBut as new evidence presented this week in Scientific Reports suggests, Neanderthals did possess the capacity to start their own fires. Using hydrocarbon and isotopic evidence, researchers from the University of Connecticut showed that certain fire-using Neanderthals had poor access to wildfires, so the only possible way for them to acquire it was by starting it themselves.\n\n“Fire was presumed to be the domain of Homo sapiens but now we know that other ancient humans like Neanderthals could create it,” said Daniel Adler, a co-author of the new study and an associate professor in anthropology at the University of Connecticut, in a press release. “So perhaps we are not so special after all.”\n\nWe know Neanderthals and other hominins used fire based on archaeological evidence like the remnants of fire pits and charred animal bones. But evidence also exists to show that Neanderthals had the requisite materials for sparking fires, namely blocks of manganese dioxide (scrapings from this material can assist with fire production, as it can be set alight at lower temperatures compared to other materials). That said, competing evidence from France has linked Neanderthal fire use to warmer periods, when forests are dense with flammable material and when the odds of lightning strikes are higher—important factors for determining the likelihood of wildfires. This and other evidence has been used to claim that Neanderthals weren’t pyrotechnologically capable, as it was easy for them to grab flames from burning bushes.\n\nFor the new study, Adler and his colleagues sought to test this hypothesis, that is, to determine if fire use among Neanderthals could indeed be correlated with the occurrence of natural wildfires.\n\nA critical component of this research is a molecule called polycyclic aromatic hydrocarbons (PAHs). PAHs are released when organic materials are burned, and they can provide a record of fire over geological timescales. They also come in two varieties: light and heavy. The light kind, lPAHs, can travel vast distances, while the heavy kind, hPAHs, remain localised. For the study, the researchers analysed lPHAs found inside Lusakert Cave 1 in Armenia—a known Neanderthal cave—as evidence of fire use, and hPHAs found outside the cave as evidence of wildfires. The scientists also looked at isotopic data taken from fossilized plants, specifically from the wax found on leaves, to determine what the climatic conditions were like at the time.\n\nA total of 18 sedimentary layers from Lusakert Cave 1 were analysed, a time period spanning 60,000 to 40,000 years ago. The hHPAs in these layers, along with other archaeological data, pointed to extensive use of fires by Neanderthals in this cave. During the same time period, however, wildfires outside of the cave were rare. What’s more, the isotopic data didn’t point to anything particularly unusual in terms of fire-friendly environmental conditions, such as excessive aridity. This led the authors to “reject the hypothesis” that fire use among Neanderthals was “predicated on its natural occurrence in the regional environment,” according to the paper. If anything, the new evidence points to the “habitual use” of fire by Neanderthals “during periods of low wildfire frequency,” wrote the authors in the study.\n\nChemist and co-author Alex Brittingham described it this way in the press release: “It seems they were able to control fire outside of the natural availability of wildfires.”\n\nA challenge facing the researchers was to take all this data and keep it within the same time frame.\n\n“In an archaeological context like we find at Lusakert Cave, we are forced to answer all questions on longer timescales,” said Brittingham in an email to Gizmodo. “So all of the data that we present in this publication, whether it is the climate from the leaf waxes, fire data from PAHs, or data on human occupation from lithics, are time averaged. So, when we compare these independent datasets we compare them between different identified stratigraphic layers.”\n\nNeedless to say, this study presents indirect evidence in support of Neanderthal pyrotechnology, as opposed to direct evidence such as manganese dioxide blocks or other clues. More evidence will be needed to make a stronger case, but this latest effort is a good step in that direction.\n\nAnother potential limitation of this research is the possibility that the sedimentary materials moved around over the years, or became degraded or diluted through the processes of erosion.\n\n“However, given the good preservation of other hydrocarbons at the site, we do not believe this is an issue,” Brittingham told Gizmodo.\n\nThat Neanderthals had the capacity to start fires isn’t a huge shocker. These hominins demonstrated the capacity for abstract thinking, as evidenced by their cave paintings. They also forged tools and manufactured their own glue, so they were quite creative and industrious. What’s more, they managed to eke out an existence across much of Eurasia for an impressive 360,000 years. Notions that they survived for so long without the ability to start fires or that their extinction was somehow tied to their lack of pyrotechnic ability seem to be the more far-fetched conclusions.", "description": "Neanderthals were regular users of fire, but archaeologists aren’t certain if these extinct hominins were capable of starting their own fires or if they sourced their flames from natural sources. New geochemical evidence suggests Neanderthals did in fact possess the cultural capacity to spark their own Paleolithic...", "authors": ["Matt Hopkins", "Victoria Song"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/t4jf0gl48d4ucdhukzdx.jpg", "published_at": "2019-10-25"}