{"pub": "cbc", "url": "https://cbc.ca/news/politics/scheer-national-energy-corridor-announcement-1.5301488", "downloaded_at": "2019-09-28 21:31:28.896571+00:00", "title": "Conservative government would create national energy corridor, Scheer says | CBC News", "language": "en", "text": "Andrew Scheer says a Conservative government would build a single coast-to-coast energy corridor to transport Canada's natural resources if elected.\n\nThe project would be used to move things like oil, gas, hydroelectricity and telecommunications.\n\n\"Our natural resources can be a source for good,\" Scheer said, at an announcement Saturday in Edmonton in front of a backdrop of oil and gas workers.\n\nThe party says the corridor would minimize environmental impacts, increase certainty for investors and create jobs. Scheer did not specify on Saturday what projects or infrastructure could be part of this corridor.\n\nConservative Leader Andrew Scheer says he will ensure there is a regulatory framework that would allow for projects to be built along the corridor. 1:25\n\nThe Conservatives say they would appoint a task force of experts to provide recommendations on how to build the corridor. It would be expected to deliver recommendations within six months.\n\nThe panel would consider Indigenous consultations, the role of provincial laws, uses for the corridor, cost, benefits for regions and industries and a potential route.\n\nAfter the party receives the suggestions, Scheer said they would start work with the provinces and Indigenous people to move forward on the project.\n\nThe path such a corridor would have to take through Quebec to reach the Atlantic Ocean could be a trigger point, as Premier François Legault has been clear that his province doesn't want another pipeline.\n\nScheer acknowledged there will be criticism of this proposal, but said he believes it can be completed.\n\nThe party's news release said the Parliamentary Budget Officer has estimated the cost of this promise, but as of Saturday afternoon that report had not been published.\n\nThe Conservative leader drew on examples of Louis St. Laurent's vision for the Trans-Canada Highway and John Diefenbaker's permanent road to the Arctic Circle. Scheer had previously compared the creation of such a pathway to building the railway in the days of Confederation.\n\nConservative premiers supportive\n\nScheer first outlined his vision for an energy corridor in May.\n\n\"I want to talk about a national corridor that would move Canadian oil, gas, electricity, telecommunications and potentially anything else that runs along the ground,\" he had said.\n\nAt the time, he didn't specify the geography, cost or timeline. Scheer said he believed it was something the different provinces could agree on.\n\nNew Brunswick Premier Blaine Higgs​​​​, Alberta Premier Jason Kenney and Saskatchewan Premier Scott Moe — all Conservative — support Scheer's proposal. The topic was also brought up in July during the premiers' Council of the Federation meeting.\n\nAt the announcement in Edmonton on Saturday, Scheer criticized the Liberals and Justin Trudeau for scaring away investments in Canada's energy sector. The federal government bought the Trans Mountain pipeline last year for $4.5 billion after the proponent, Kinder Morgan, expressed dissatisfaction in the delays and uncertainty. There are still no shovels in the ground as the project has faced numerous court challenges.", "description": "Andrew Scheer says a Conservative government would build a single coast-to-coast energy corridor to transport Canada's natural resources if elected.", "authors": [], "top_image": "https://i.cbc.ca/1.5301598.1569696579!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/fedelxn-conservatives-20190928.jpg", "published_at": "2019-09-28"}