{"pub": "vice", "url": "https://vice.com/en_asia/article/pa7abm/australian-pair-arrested-impersonating-cops-police-issuing-fines", "downloaded_at": "2019-09-09 11:45:23.657568+00:00", "title": "Australian Pair Arrested for Impersonating Cops and Issuing On-the-Spot ‘Fines’", "language": "en", "text": "This article originally appeared on VICE Australia.\n\nTwo South Australian men have been arrested for allegedly impersonating police officers, carrying out traffic stops, and issuing a fake fine to a driver who they then took to a petrol station so he could withdraw money. Police allege that the pair pulled over three cars in separate incidents across Adelaide last week, flashing a badge and claiming to be officers of the law.\n\nIn one case, the men reportedly \"identified themselves to the driver as police officers before issuing him with a fine and driving him to a petrol station to withdraw money,\" according to a statement by South Australia Police. \"He was returned to his vehicle and the men took an amount of money from him before leaving the area.\"\n\nAnother of the victims “questioned the validity of the suspect and he returned to his car and drove off.\" Police have since issued a warning to the public, saying that officers never request payments be made on the spot.\n\nBoth men were arrested over the weekend. One, aged 34 years old, was charged with three counts of impersonating a police officer, unlawful detention, aggravated robbery, and two counts of driving disqualified. The other, 28 years old, was also charged with impersonating an officer. They were due to face court today.\n\nThis isn’t the only case in recent memory where people have been caught impersonating Australian cops. Last week, VICE reported on the case of a Melbourne ice addict who donned a police uniform and “raided” another drug user’s house. In that case, the culprit used his faux authority to frisk two men for contraband, claiming their stash of ice and cannabis before later being arrested in a violent confrontation with the actual police. He was sentenced to 11-and-a-half years behind bars.\n\nFollow Gavin on Twitter or Instagram", "description": "In one case, the men drove a victim to a petrol station so he could withdraw money and pay the \"fine.\"", "authors": ["Gavin Butler", "Caleb Quinley", "Sarah Ngu"], "top_image": "https://video-images.vice.com/articles/5d75bf98e5959e000888f0d3/lede/1568007022734-pjimage-2019-09-09T151353233.jpeg?crop=1xw:1xh;center,center&resize=1200:*", "published_at": "2019-09-09"}