{"pub": "investingcom", "url": "https://in.investing.com/news/commodities-news/preciousgold-up-on-soft-dollar-set-for-first-weekly-gain-in-four-1988353", "downloaded_at": "2019-09-20 05:14:24.174417+00:00", "title": "PRECIOUS-Gold up on soft dollar, set for first weekly gain in four", "language": "en", "text": "© Reuters. PRECIOUS-Gold up on soft dollar, set for first weekly gain in four\n\n* Dollar gives up gains against most major currencies\n\n* Spot gold stuck in narrow range of $1,488-$1,514/oz -technicals\n\n* Palladium hits fresh record high of $1,635.55/oz (Adds quotes, details, updates prices)\n\nBy Eileen Soreng\n\nSept 20 (Reuters) - Gold prices edged higher on Friday and were set for their first weekly gain in one month, supported by a softer dollar and caution about developments in Sino-U.S. trade talks.\n\nSpot gold was up 0.3% at $1,503.20 per ounce, as of 0353 GMT, and was on track for its first weekly gain in four, having risen nearly 1% so far this week.\n\nU.S. GCv1 were also up 0.3% at $1,510.9 per ounce.\n\nA weaker U.S. dollar is giving gold a little bit of an upward drift,\" Michael McCarthy, chief market strategist at CMC (NS: ) Markets said, adding that \"prices are still very much in the middle of a trading range and pinned to $1,500 level.\"\n\nThe dollar nursed losses against most major currencies on Friday, as central banks in Switzerland and the UK refrained from cutting rates, while risk appetite ebbed on caution about U.S-China trade talks. USD/\n\n\"Investors are all waiting on any further developments in the trade negotiations as they move towards October meeting and that may provide next big driver for gold prices,\" McCarthy said.\n\nU.S. and Chinese deputy trade negotiators resumed face-to-face talks for the first time in nearly two months on Thursday, trying to lay the groundwork for high-level talks in early October. prices have risen about 17% this year mainly on the back of a the U.S.-China trade tensions, concerns over the outlook for the global economy and the prospect of monetary easing by central banks.\n\nThe Fed had cut interest rates for the second time this year on Wednesday to help sustain economic expansion but gave mixed signals on future rate cuts. precious metal will remain supported as investors deliberate heightened market risks and accommodative economic policies for the near term, Phillip Futures analyst Benjamin Lu said in a note.\n\nOn the technical front, signals are mixed for spot gold as it is stuck in a narrow range of $1,488-$1,514 per ounce, according to Reuters technical analyst Wang Tao. palladium gained 0.7% to $1,634.74 per ounce, having earlier climbed to a fresh record peak of $1,635.55.\n\nPlatinum rose 0.5% to $942.00 per ounce and silver was up 0.6% at $17.88.", "description": "PRECIOUS-Gold up on soft dollar, set for first weekly gain in four", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPED1M0ED_L.jpg", "published_at": "2019-09-20"}