{"pub": "independent", "title": "Jeremy Corbyn faces an interesting choice – will he demand that the people decide?", "url": "https://independent.co.uk/voices/editorials/jeremy-corbyn-brexit-referendum-european-elections-tig-change-uk-farage-party-a8868591.html", "language": "en", "published_at": "2019-04-13", "downloaded_at": "2019-09-02 07:33:29.265436+00:00", "text": "For many months Labour’s leaders have hedged and fudged and dodged on the subject of a new referendum on Brexit. Now Jeremy Corbyn must make a decision. The European parliament elections are going ahead.\n\nThey could be cancelled, even up to 22 May, the day before polling, if the House of Commons approves the EU withdrawal agreement, but that seems unlikely. Even if the plug is pulled at the last moment, the campaign is starting already and all the parties will have to decide what manifesto they will offer the voters.\n\nAs we report today, the Labour leader is coming under pressure from many of his shadow cabinet colleagues to harden the commitment to a referendum on any Brexit deal. So far, it is an option that has to be kept “on the table”, and senior members of the shadow cabinet have said different things about whether it would be required under any circumstances and about what might be on the ballot paper.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThere are arguments of principle and tactics for making the promise clearer and more emphatic. The argument of principle is that a new referendum is the only democratic way to resolve the Brexit morass. Parliament and the nation are now divided three ways, between leaving the EU with a deal, leaving without a deal, or not leaving at all.\n\nShape Created with Sketch. Farage launches his new Brexit Party: in pictures Show all 10 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Farage launches his new Brexit Party: in pictures 1/10 Nigel Farage speaks at the launch of his new Brexit Party's campaign for the European elections Reuters 2/10 Brexit Party candidate Annunziata Rees-Mogg, sister of Conservative MP Jacob Rees-Mogg, speaks at the launch AFP/Getty 3/10 A supporter waits for Farage to speak AFP/Getty 4/10 Supporters wait for Farage to speak AFP/Getty 5/10 Farage's socks Reuters 6/10 Farage and prospective candidate Annunziata Rees-Mogg wait at the launch AFP/Getty 7/10 Supporters listen as Farage speaks AFP/Getty 8/10 Free T-shirts for all attendees AFP/Getty 9/10 Posters on the seats for supporters of the Brexit Party AFP/Getty 10/10 A safety sign is pictured AFP/Getty 1/10 Nigel Farage speaks at the launch of his new Brexit Party's campaign for the European elections Reuters 2/10 Brexit Party candidate Annunziata Rees-Mogg, sister of Conservative MP Jacob Rees-Mogg, speaks at the launch AFP/Getty 3/10 A supporter waits for Farage to speak AFP/Getty 4/10 Supporters wait for Farage to speak AFP/Getty 5/10 Farage's socks Reuters 6/10 Farage and prospective candidate Annunziata Rees-Mogg wait at the launch AFP/Getty 7/10 Supporters listen as Farage speaks AFP/Getty 8/10 Free T-shirts for all attendees AFP/Getty 9/10 Posters on the seats for supporters of the Brexit Party AFP/Getty 10/10 A safety sign is pictured AFP/Getty\n\nThis was not a situation that was foreseen at the time of the 2016 referendum. Then it was assumed that we would negotiate a deal and leave. That history has now been rewritten by fundamentalist Brexiteers as being a vote to leave without a deal – although they say a deal, entirely on the UK’s terms, would have been an acceptable optional extra.\n\nThus the Leave majority at that referendum has fractured. Many Conservative MPs and party members regard the prime minister’s exit deal as a form of remaining in the EU. They have more in common with Nigel Farage’s Brexit Party than they do with their own leader.\n\nThere is no majority in the House of Commons for either a no-deal Brexit or for the prime minister’s deal, and no way of restructuring the way MPs vote seems likely to yield one – despite the pretence by Ms May and Mr Corbyn that they are negotiating to find one.\n\nThe only way to avoid endless deadlock and repeated requests for extensions to the Brexit deadline, therefore, is to return the decision to the people, as The Independent has argued since last year.\n\nAnd if the argument of principle does not persuade Mr Corbyn, the tactical case should do so. He knows that the petition to revoke Article 50 has attracted 6 million signatures. He knows too that Labour won 4 million votes in the last European elections five years ago. And he knows that the Independent Group of MPs, standing as Change UK, are likely to attract considerable support in next month’s elections. Change UK will be campaigning on a platform of a new referendum with a view to cancelling Brexit.\n\nJust as there will be many Tory voters tempted to vote for Mr Farage’s new outfit, there will be many Labour voters keen to vote for the new pro-EU option. If Mr Corbyn wants to maximise the Labour vote, he should match Heidi Allen and Chuka Umunna’s policy of a referendum.\n\nThis is an important test for the Labour leader. If he is in doubt, he should listen to his own democratic instincts and say: let the people decide.", "description": "For many months Labour’s leaders have hedged and fudged and dodged on the subject of a new referendum on Brexit. Now Jeremy Corbyn must make a decision. The European parliament elections are going ahead.  They could be cancelled, even up to 22 May, the day before polling, if the House of Commons approves the EU withdrawal agreement, but that seems unlikely. Even if the plug is", "authors": [], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/04/10/20/Corbyn.jpg"}