{"pub": "foxnews", "url": "https://foxnews.com/world/china-children-killed-first-day-of-school-attack", "downloaded_at": "2019-09-03 23:44:15.413244+00:00", "title": "Chinese man kills 8 children in attack on first day of school: police", "language": "en", "published_at": "2019-09-03", "text": "A man who recently served time for attempted murder allegedly killed eight children and injured two others who were attending their first day of school in China, police said.\n\nThe 40-year-old man, only identified by the surname Yu, was taken into custody late Monday after he allegedly attacked the kids at an elementary school in Chaoyangpo village of Enshi city in Hubei province.\n\nHONG KONG STUDENTS SKIP FIRST DAY OF SCHOOL TO HOLD ANTI-GOVERNMENT PROTESTS\n\nIt was not immediately clear how the children were attacked.\n\nThe man was released from Hubei prison last June after serving a sentence for attempted murder, according to local media. A possible motive was not immediately clear either.\n\nThe attack is the latest in a string of similar incidents in China.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nIn January, 20 children were injured after a man attacked them inside an elementary school in Beijing — and in June 2018, two children were stabbed to death by a man outside an elementary school in Shanghai.\n\nIn April of last year, nine were killed and more than a dozen injured outside a middle school in northwestern Shaanxi province by an attacker who allegedly was a former pupil seeking revenge for having been bullied.\n\nThe Associated Press contributed to this report.", "description": "A man — who recently served time for attempted murder —allegedly killed eight children and injured two others who were attending their first day of school in China, police said.", "authors": ["Nicole Darrah", "Nicole Darrah Covers Breaking", "Trending News For Foxnews.Com. Follow Her On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/CHINA-CRIME-GettyImages-1079317854.jpg"}