{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/wework-bonds-hit-record-low-on-risky-jpmorgan-refinancing-deal-2019-10-1028600845", "downloaded_at": "2019-10-15 16:56:36.435825+00:00", "title": "Investors are more worried than ever that WeWork won’t be able to pay down its debt", "language": "en", "text": "Reuters\n\nWeWork bonds hit record lows early Tuesday following reports that the company is eyeing a risky refinancing package from JPMorgan.\n\nThe co-working company's 7.875% bonds maturing in 2025 sank to 79.3 cents on the dollar Tuesday morning.\n\nThe JPMorgan package would amount to roughly $5 billion and may include $2 billion in unsecured payment-in-kind with an unusually heavy 15% coupon, according to a Bloomberg report.\n\nRead the full timeline of WeWork's downfall here.\n\nWeWork's bonds hit record lows early Tuesday after reports claimed the company is eyeing a risky refinancing offer from JPMorgan.\n\nThe co-working company's 7.875% bonds maturing in 2025 tanked to 79.3 cents on the dollar Tuesday morning. The notes saw a similar tumble in late September after news of its cancelled IPO fueled investor worry.\n\nThe firm is reportedly favoring a refinancing deal with JPMorgan over an offer from SoftBank, according to Bloomberg. The proposed refinancing package would amount to roughly $5 billion and may include $2 billion of unsecured payment-in-kind with a weighty 15% coupon.\n\nThe news arrived a day after it was reported SoftBank was looking to purchase a controlling stake in WeWork. The Japanese investment giant has been one of WeWork's biggest investors, and has invested at least $11 billion in the firm. A controlling stake would reportedly cost at least $1o billion.\n\nThe lifeline would secure capital WeWork was previously expecting to take in from its public offering. However, the package is risky for the firm's bondholders, as WeWork's murky financial prospects and shifted leadership leave it in a relatively precarious position.\n\nRead more: Morgan Stanley says WeWork's failed IPO marks the end of an era for unprofitable unicorns — and explains why it leaves the market's tech kingpins vulnerable\n\nWeWork pulled plans for a 2019 IPO after analyst scrutiny marred the company's lofty valuation and led to CEO Adam Neumann's stepping down. The company's board named executives Sebastian Gunningham and Artie Minson to replace Neumann as co-CEOs.\n\n\"We have decided to postpone our IPO to focus on our core business, the fundamentals of which remain strong,\" Minson and Gunningham said in a September 30 statement. \"We have every intention to operate WeWork as a public company and look forward to revisiting the public equity markets in the future.\"\n\nThe bonds hit all-time highs in August after the company said in its IPO filing it would pay off a portion of the bonds and raise an additional $6 billion in debt funding should it succeed in its public offering by the end of the year.\n\nNow read more markets coverage from Markets Insider and Business Insider:\n\nWells Fargo posts earnings miss driven by $1.6 billion expense linked to scandals\n\nGoldman Sachs' quarter soured by disappointing banking revenue, write-downs for Uber and other investments\n\nHedge funds pumped more than $200 million into a family of crypto funds last quarter even though performance tanked", "description": "WeWork bonds hit record lows early Tuesday following reports that the company is eyeing a risky refinancing package from JPMorgan. The co-working company'...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5da5cfb04af90922d735a364-2400/2019-10-13t221747z1lynxmpef9c0pqrtroptp4wework-layoffs.jpg", "published_at": "2019-10-10"}