{"pub": "dailybeast", "url": "https://thedailybeast.com/us-prosecutors-are-out-to-crack-russias-crooked-money-machine", "downloaded_at": "2019-10-04 16:55:54.698841+00:00", "title": "U.S. Prosecutors Are Out to Crack Russia’s Crooked Money Machine", "language": "en", "text": "U.S. federal prosecutors just won’t let go of their three-year-old criminal action against alleged beneficiaries of stolen and laundered Russian taxpayer money.\n\nIt was launched as part of what’s known as the Magnitsky Affair, a contentious story of scandal, cover-ups and smear campaigns that dates back more than a decade. Over the years, the Kremlin has used every tool it can, including the fate of Russian orphans who might be adopted by Americans, as it tries to thwart calls for justice from the U.S. Congress and the administration.\n\nSo far, the Kremlin has failed. (Who knows what will happen if there’s a Trump presidency?) And the prosecutors doggedly keep after a tentacular organization, trying to untangle schemes they allege were just about as complicated as they were brazen.\n\nSo when Andrey Pavlov arrived at Washington’s Dulles Airport on September 15, expecting to attend an international conference without incident, the U.S. Department of Justice served him with a subpoena to appear before a grand jury in Manhattan on Wednesday, September 21.\n\nSuch proceedings are secret, but Pavlov, described by American officials as the lawyer for a notorious Russian mafia organization, was expected to face tough questioning about his role in what’s alleged to be a far-reaching fraud and money laundering operation in which companies were “stolen”—reregistered without the knowledge of their owner—then used to file lawsuits that were settled for hugely inflated amounts which subsequently had to be paid off with Russian tax money.\n\nSergei Magnitsky was a tax attorney who discovered and exposed the alleged fraud, only to find himself arrested and defamed by the Putin government before dying in jail in 2009 under suspicious circumstances. Washington responded with the passage of a landmark U.S. human rights law named after the principal victim and designed to sanction and blacklist his assailants.\n\nThe specific case in question here is against Prevezon Holdings Ltd., a Cyprus-registered company. According to U.S. District Attorney Preet Bharara, $14 million of its allegedly ill-gotten gains wound up in Bank of America accounts and Gotham real estate, including condos in the Financial District and Midtown whose market prices were in the low seven figures.\n\nAs laid out in the so-called Magnitsky Act passed by the U.S. Congress in 2011, tax attorney Magnitsky had uncovered an elaborate $230 million tax scam perpetrated using stolen and re-registered subsidiary companies belonging to a client, the investment firm Hermitage Capital, which was co-founded by British financier Bill Browder.\n\nOfficers of Russia’s Interior Ministry and Moscow tax bureaus, Magnitsky found, were actually hirelings of the Klyuev Group, which Sen. John McCain has since described as a “dangerous transnational criminal organization.”\n\nInstead of thanking Magnitsky for his dot-connecting sleuthing, however, the Russian authorities first ignored his disclosures, then arrested him on the pretext that he was the perpetrator of a separate tax fraud himself. He was denied urgent medical treatment during his year-long pretrial detention and was physically tortured for a brief period in a Moscow prison isolation cell where he was left to die in 2009.\n\nIn 2011, in Russia’s first and only posthumous trial, Magnitsky was found guilty of tax evasion.\n\nMonitors ranging from Amnesty International to the European Union to Russia’s own Presidential Human Rights Commission have characterized Magnitsky as a victim, even as the Kremlin insists he died of a “heart attack” and was himself a financial criminal.\n\nAndrey Pavlov, U.S. officials say, is the consigliere for the Klyuev Group. He has denied being so, in spite of voluminous documentary evidence seen and previously described by The Daily Beast that proves his legal involvement in lawsuits brought against the confiscated Hermitage subsidiaries. There is also video footage showing him accompanying Dmitry Klyuev, an ex-con and reportedly the capo di tutti capi of the eponymous syndicate, to a meeting at the OSCE Parliamentary Assembly in Monaco in August 2012.\n\nThe fraud basically worked like this: The Klyuev Group allegedly used the three stolen Hermitage subsidiaries which traded in energy commodities — Rilend, Makhaon, and Parfenion — to fake a series of lawsuits against them in order to then claim tax liabilities.\n\nMembers of the Group, or those seconded by it, worked both sides on each lawsuit, acting on behalf of both plaintiff companies and the defendant subsidiaries in order to seek wildly inflated damages in the hundreds of millions of dollars. All of these amounts were duly awarded by the courts in proceedings that sometimes lasted as little as five minutes. (For a more detailed description of each of the cases, see here.)\n\nAccording to the lawyer for a plaintiff company in one of the dummied-up lawsuits who testified before Russia’s FBI-like Investigative Committee, Pavlov in effect acted as counsel for the rival parties. Moreover, Pavlov’s wife and law partner, Yulia Mayorova also represented one of the stolen Hermitage subsidiaries in a separate lawsuit. To date, Mayorova has not confirmed nor denied her involvement in this lawsuit.\n\nHermitage Capital, meanwhile, had no idea its subsidiaries had been re-registered under new ownerships and used for these fake litigations—until Sergei Magnitsky discovered they had been.\n\nThe Klyuev Group, according to this accounting, was thus able to seek a $230 million tax relief by claiming gigantic losses for all three subsidiaries for the annual tax year of 2007. The entire refund, the largest in Russian history, was approved on Christmas Eve.\n\nBharara’s jurisdiction derives from where the U.S. government says some of this ill-gotten money wound up on American soil, via the Prevezon holding company. The U.S. Attorney demanded that Pavlov present himself at 40 Foley Square and bring with him any and all non-privileged correspondence with Dmitry Klyuev, as well as with Natalia Veselnitskaya, the Russian lawyer defending the family that legally owns Prevezon. (Pavlov’s lawyers, when contacted by The Daily Beast, refused to comment on whether or not their client actually turned up in court yesterday.)\n\n“The United States Of America vs. Prevezon Holdings Ltd” has at times resembled the Showtime series Billions as guest-scripted by Ian Fleming.\n\nIn December 2015, for instance. the U.S. government accused the Russian owners of Prevezon, who were deposed as witnesses in the case, of racking up $50,000 in expenses including nights at the Plaza Hotel, 18-course dinners with bottles of expensive wines and grappa, for a duration exceeding the time they were in New York being deposed.\n\nBharara’s office also named Petr Katsyv, the father of one of the deposed witnesses, Denis Katsyv, who is the legal owner of Prevezon, as having offered to become an informant to the FBI in exchange for a negotiated settlement that would free up some of his son’s frozen assets.\n\nKatsyv père isn’t any old paterfamilias; he is the vice president of Russian Railways, the powerful state-owned rail company whose former president, Vladimir Yakunin is not only a long-time confidant of Vladimir Putin but personally implicated in a host of corruption scandals back home, including the exorbitant contracting costs that went into preparations for the 2014 Winter Olympic Games in Sochi, as catalogued by murdered opposition figure and former deputy prime minister Boris Nemtsov.\n\nNext, The Daily Beast learned that Pavlov’s own $1,400-an-hour attorney was Lord Peter Goldsmith, now a senior partner at the international law firm Debevoise & Plimpton, but once British Prime Minister Tony Blair’s attorney general—the same one who made the somewhat dubious legal case for invading Iraq. As it happens, Prevezon’s U.S. counsel is also Debevoise, as documents seen by The Daily Beast demonstrates. The firm has New York offices and the company is specifically represented by senior partner Michael Mukasey, who is himself the former U.S. Attorney General under President George W. Bush.\n\nDebevoise, meanwhile, had outsourced its private investigation for defending Pavlov to Andrew Fulton, a former high-ranking MI6 spy once stationed in Washington, D.C. His retainer, according to the hiring agreement seen by The Daily Beast in April of this year, was a handsome $71,000.\n\nFulton was then seconded by Rossiya-1, Russia’s state-owned and most-watched television channel, for its shambolic documentary The Browder Effect. He was tasked with “authenticating” clearly fraudulent documents purporting to show that Bill Browder, the CEO of Hermitage Capital and now Magnitsky’s chief flame-tender, who campaigns globally to recover the stolen tax money and penalize the gangsters of the Klyuev Group, was actually a longstanding CIA and/or MI6 agent codenamed “Solomon.” Browder in turn is said to have recruited Russian opposition leader and anti-corruption crusader Alexey Navalny, codenamed “Freedom,” to Western security services.\n\nWhy were the documents clearly fraudulent? Well, apart from being written in hilariously bad or stilted English, one of the documents claims to identify Browder’s case officer as Valerie Plame, in 2009. The CIA officer, famously outed by the Bush administration during its media war over Iraqi WMDs, resigned from the Agency in 2007, as she was wont to remind Twitter when The Browder Effect aired to international derision.\n\nAlthough Browder is not a party to the ongoing Prevezon case in New York’s Southern District, he was deposed as a witness back in February and has since become an imago and prime mover for this criminal prosecution, according to Prevezon’s defense team, possibly because that team used to represent Browder’s hedge fund.\n\nUnbelievably, in yet another vertiginous twist to this legal saga, Hermitage’s counsel in investigating the $230 million tax fraud eight years ago was the U.S. law firm BakerHostetler. It is now representing Prevezon in New York federal court, which has prompted Hermitage’s new attorney Jacob Buchdahl to file a motion seeking BakerHostetler’s dismissal owing to what he calls a clear conflict of interest. As a result, the case is suspended pending a district court ruling on that motion.\n\nIndeed, BakerHostetler has stated in a pretrial hearing that its former client Hermitage “is central to everything” related to its new client, Prevezon’s asset forfeiture headaches. The firm argues that in an effort to vindicate his dead lawyer via a relentless public relations and lobbying campaign, Browder has defamed innocent Russian businessmen and state officials.\n\nOne of these, former Interior Ministry policeman Major Pavel Karpov, whom Magnitsky identified as a key agent of the Klyuev Group and who was duly sanctioned by the U.S. government for his cited role in the Hermitage theft, even sued Browder in British High Court in 2012 for libel.\n\nHe lost.\n\nKarpov, who lives in Russia, has since been given a three-month sentence in absentia for being in contempt of court for failing to appear to provide information about his unpaid costs for the suit: $877,800.\n\nFinally, Natalia Veselnitskaya, the Russian counsel for the Katsyv family, who herself spent two $1,000 nights in lavish comfort at the Plaza after her client had been deposed, was shown to be involved in a Kremlin lobbying effort to kill the next iteration of the Magnitsky Act, the 2012 law that aims to deny visa entry to any Russian officials identified as part of the Klyuev Group or its accomplices, and to freeze whatever assets they may have in the United States.\n\nShe also heads up a newly-registered Delaware NGO known euphemistically as the Human Rights Accountability Global Initiative Foundation. Its objective seems to be cancelling the Magnitsky Act as part of a quid pro quo arrangement for the Kremlin’s cancellation of a controversial and retaliatory ban on American adoption of Russian orphans.\n\nThat same arrangement has been mooted, in a confidential letter given to California Rep. Dana Rohrabacher by Russian officials. In May, Rohrabacher, who is broadly sympathetic with Russian foreign policy and a critic of sanctions against its state officials or institutions, unsuccessfully tried to block the mark-up of a more expansive sequel to the legislation, one that would sanction human rights offenders from any country. Rohrabacher’s spokesman told The Daily Beast at the time that the “congressman simply wants to give [the letter] careful consideration. He recognizes that various partisans are impatient for a conclusion, but he wants intellectual honesty to prevail, which requires some patience.”\n\n“Sergei Magnitsky did not uncover any theft referred to in the Magnitsky Act,” Veselnitskaya has said, neglecting to mention her role in defending an oligarchic family implicated by Washington in having benefited from the very theft the slain attorney uncovered. What’s stated in the Magnitsky Act is wrong, she insists. “No one tortured him and no one killed Sergei Magnitsky,” she said.", "description": "The feds bring an alleged lawyer for the Russian mob before a grand jury in the Magnitsky investigations.", "authors": ["Michael Weiss"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1439,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1492109429/articles/2016/09/22/u-s-prosecutors-are-out-to-crack-russia-s-crooked-money-machine/160922-weiss-russian-mob-tease_gxzzzz", "published_at": "2016-09-22"}