{"pub": "investing.com", "url": "https://za.investing.com/news/forex-news/south-africas-rand-tumbles-1-as-eskom-plans-nationwide-power-cuts-1966435", "downloaded_at": "2019-10-16 07:29:27.854672+00:00", "title": "South Africa's rand tumbles 1% as Eskom plans nationwide power cuts", "language": "en", "text": "South Africa's rand tumbles 1% as Eskom plans nationwide power cuts\n\nJOHANNESBURG, Oct 16 (Reuters) - South Africa's rand tumbled more than 1% on Wednesday to its softest level in a week after state power utility Eskom said it would implement nationwide blackouts for the first time in more than six months due to capacity shortages.\n\nThe rand ZAR=D3 was 1% weaker at 15.0550 per dollar, its lowest since Oct. 10, as of 0615 GMT.\n\nEskom said it will cut up to 2,000 megawatts of power from the national grid on Wednesday due to a shortage of generating capacity, starting at 0700 GMT (9 am local time) and up until 2100 GMT. comments pushed the rand past the crucial 15.00 mark, with deeper losses likely as the session wears on, traders said.\n\nStruggling state power firm Eskom implemented one of the worst power cuts in several years in February, hurting small businesses without backup power generators and industrial firms that consume large volumes of power. was an initial knee-jerk reaction to the announcement. And the longer it (blackouts) goes on, the worse it will be for the rand,\" said currency dealer at TreasuryOne Andre Botha.\n\n\"Any improvement (in sentiment) will depend on clarity we get from now on about what is happening. But there's definitely negative risk across the board,\" Botha said.\n\nA debilitating round of power cuts in February and March pushed first-quarter economic growth into contraction and raised the likelihood of the country losing its last investment-grade rating.\n\nBonds also weakened, with the yield on the benchmark government paper due in 2026 ZAR186= up 3.5 basis points to 8.27%.", "description": "South Africa's rand tumbles 1% as Eskom plans nationwide power cuts", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/south_african_rand_800x533_L_1411971483.jpg", "published_at": "2019-10-16"}