{"pub": "independent", "url": "https://independent.co.uk/sport/football/football-league/haringey-borough-racial-abuse-walk-off-yeovil-town-goalkeeper-fa-cup-a9163086.html", "downloaded_at": "2019-10-19 16:22:19.509360+00:00", "title": "Haringey Borough walk off after goalkeeper ‘racially abused’ by Yeovil Town fans during FA Cup qualifier", "language": "en", "text": "Haringey Borough players walked off the pitch during their FA Cup qualifier against Yeovil Town after allegations of racial abuse from visiting supporters.\n\nHaringey’s goalkeeper, Douglas Pajetat, was reportedly subjected to abuse from a travelling contingent of Yeovil fans, with further accusations of spitting and bottle-throwing aimed at the Cameroonian.\n\nYeovil’s captain attempted to speak with the supporters, as well as the referee, before the home team took the decision to leave the pitch. Pajetat’s teammate, Coby Rowe, was visibly enraged and had to be restrained by security.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nStewards then attempted to escort a number of supporters out of the stadium, but they refused to leave as the game was delayed for 10 minutes as the players consulted with officials in the dressing room.\n\nAfter the match, Harringey tweeted: “Sorry for the late update but wanted to make sure we gave correct information. Game has been abandoned following racial abuse. Horrendous afternoon.\n\nShape Created with Sketch. Racism in football Show all 16 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Racism in football 1/16 Pierre-Emerick Aubameyang Gabonese striker has banana hurled at him by Tottenham supporters Getty 2/16 Kalidou Kouliably Napoli centre-back abused by Inter Milan supporters EPA 3/16 Renne Hector Tottenham Ladies player racially abused by former Sheffield United striker Sophie Jones Tottenham Hotspur FC via Getty Images 4/16 Callum Hudson-Odoi Chelsea starlet racially abused by Dynamo Kiev supporters Reuters 5/16 Raheem Sterling Manchester City star racially abused by supporters in Montenegro Getty 6/16 Danny Rose England full-back racially abused by Montenegro supporters PA 7/16 Moise Kean Juventus teenager racially abused by Cagliari supporters Getty 8/16 Duane Holmes Derby midfielder racially abused by Wigan fan Action Plus via Getty Images 9/16 Nathan Byrne Wigan player racially abused over social media Getty 10/16 Wilfried Zaha Crystal Palace forward racially abused over social media Reuters 11/16 Ashley Young Full-back racially abused by Manchester United fans on social media after Barcelona defeat Getty Images 12/16 Tiemoue Bakayoko Tiemoue Bakayoko was racially abused during AC Milan’s Coppa Italia clash with Lazio Getty 13/16 Malcom Malcom was racially abused during his debut for Zenit St. Petersburg Alexander Demianchuk/TASS 14/16 Tammy Abraham Tammy Abraham missed the crucial penalty as Chelsea lost to Liverpool in the Uefa Super Cup, which sparked racial abuse from Twitter trolls online Reuters 15/16 Paul Pogba Paul Pogba was sent racial abuse on Twitter after missing a penalty for Man United in the 1-1 draw at Wolves Reuters 16/16 Juan Jesus Roma's Juan Jesus was abused over social media Getty 1/16 Pierre-Emerick Aubameyang Gabonese striker has banana hurled at him by Tottenham supporters Getty 2/16 Kalidou Kouliably Napoli centre-back abused by Inter Milan supporters EPA 3/16 Renne Hector Tottenham Ladies player racially abused by former Sheffield United striker Sophie Jones Tottenham Hotspur FC via Getty Images 4/16 Callum Hudson-Odoi Chelsea starlet racially abused by Dynamo Kiev supporters Reuters 5/16 Raheem Sterling Manchester City star racially abused by supporters in Montenegro Getty 6/16 Danny Rose England full-back racially abused by Montenegro supporters PA 7/16 Moise Kean Juventus teenager racially abused by Cagliari supporters Getty 8/16 Duane Holmes Derby midfielder racially abused by Wigan fan Action Plus via Getty Images 9/16 Nathan Byrne Wigan player racially abused over social media Getty 10/16 Wilfried Zaha Crystal Palace forward racially abused over social media Reuters 11/16 Ashley Young Full-back racially abused by Manchester United fans on social media after Barcelona defeat Getty Images 12/16 Tiemoue Bakayoko Tiemoue Bakayoko was racially abused during AC Milan’s Coppa Italia clash with Lazio Getty 13/16 Malcom Malcom was racially abused during his debut for Zenit St. Petersburg Alexander Demianchuk/TASS 14/16 Tammy Abraham Tammy Abraham missed the crucial penalty as Chelsea lost to Liverpool in the Uefa Super Cup, which sparked racial abuse from Twitter trolls online Reuters 15/16 Paul Pogba Paul Pogba was sent racial abuse on Twitter after missing a penalty for Man United in the 1-1 draw at Wolves Reuters 16/16 Juan Jesus Roma's Juan Jesus was abused over social media Getty\n\n“It must be said that 99.9% of @YTFC fans are also disgusted by what’s happened as much as we are. One club, one community.”\n\nThe incident comes just days after England’s Euro 2020 qualifier was twice halted due to racist abuse from Bulgarian supporters.\n\nAfter the match, FA chairman Greg Clarke highlighted that England still has its own issues to address regarding racism in the sport.\n\n“I think at UEFA we need to really address that, but to be perfectly frank we also still need to address racism in England.\n\n“We still have it, we have it throughout the pyramid, we see examples of it every week from the professional game down to the grassroots game.\n\n“We shouldn’t take the moral high ground, we should join a movement to drive racism out of our game and have zero tolerance for it.”", "description": "Haringey Borough players walked off the pitch during their FA Cup qualifier against Yeovil Town after allegations of racial abuse from visiting supporters. Haringey’s goalkeeper, Douglas Pajetat, was reportedly subjected to abuse from a travelling contingent of Yeovil fans, with further accusations of spitting and bottle-throwing aimed at the Cameroonian.", "authors": ["Tom Kershaw"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/09/26/17/breaking-4.png", "published_at": "2019-10-19"}