{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/universal-credit-labour-corbyn-benefit-policy-manifesto-election-iain-duncan-smith-a9123441.html", "downloaded_at": "2019-09-28 00:57:39.210936+00:00", "title": "Universal credit to be scrapped by Labour government, Corbyn says", "language": "en", "text": "Universal credit will be scrapped if Labour wins power, Jeremy Corbyn has announced, arguing the move will prevent 300,000 children falling into poverty.\n\nThe Labour leader ended uncertainty over the party’s stance, vowing the “worst aspects” of the bungled benefit would be reversed immediately – with an entirely new system in place within a parliament.\n\nThe much-criticised Department for Work and Pensions will also disappear, to be replaced by a department for social security, charged with treating people with “dignity and respect”.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“Universal credit has been an unmitigated disaster,” Mr Corbyn will say – in a speech to be delivered in the Essex constituency of Iain Duncan Smith, the former minister who introduced it.\n\n“As well as being behind schedule and over budget, it is inhumane and cruel, driving people into poverty and hardship.”\n\nShape Created with Sketch. Brexit and climate protests at Labour party conference: In pictures Show all 12 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Brexit and climate protests at Labour party conference: In pictures 1/12 Labour leader Jeremy Corbyn walks past anti-Brexit campaigner on the second day of the party conference in Brighton AFP/Getty 2/12 A protester holds a sign mocking Labour leader Jeremy Corbyn's Brexit stance at the party conference in Brighton EPA 3/12 Activists from anti-climate change movement Extinction Rebellion march on the Labour conference in Brighton AFP/Getty 4/12 Delegates take part in an informal vote on Labour's Brexitr stance at the party conference in Brighton AFP/Getty 5/12 Shadow foreign secretary Emily Thornberry leads a march in support of a second referendum on Brexit Getty 6/12 Anti-Brexit protesters take part in a People's Vote rally during the Labour party conference in Brighton EPA 7/12 Extinction RebelliActivists from anti-climate change movement Extinction Rebellion march on the Labour conference in Brightonon EPA 8/12 Extinction Rebellion activists march on the Labour conference in Brighton AFP/Getty 9/12 A delegate arrives carrying a briefing from the Labour Representation Committee to the Labour party conference in Brighton Getty 10/12 Prominent anti-Brexit campaigner Steve Bray protests on Brighton beach during the Labour party conference Reuters 11/12 Anti-Brexit protesters take part in a People's Vote rally during the Labour party conference in Brighton EPA 12/12 Activists raise a banner calling for the Labour party to restore the original Clause 4 of its constitution, which would pledge the party to nationalising all industry Getty 1/12 Labour leader Jeremy Corbyn walks past anti-Brexit campaigner on the second day of the party conference in Brighton AFP/Getty 2/12 A protester holds a sign mocking Labour leader Jeremy Corbyn's Brexit stance at the party conference in Brighton EPA 3/12 Activists from anti-climate change movement Extinction Rebellion march on the Labour conference in Brighton AFP/Getty 4/12 Delegates take part in an informal vote on Labour's Brexitr stance at the party conference in Brighton AFP/Getty 5/12 Shadow foreign secretary Emily Thornberry leads a march in support of a second referendum on Brexit Getty 6/12 Anti-Brexit protesters take part in a People's Vote rally during the Labour party conference in Brighton EPA 7/12 Extinction RebelliActivists from anti-climate change movement Extinction Rebellion march on the Labour conference in Brightonon EPA 8/12 Extinction Rebellion activists march on the Labour conference in Brighton AFP/Getty 9/12 A delegate arrives carrying a briefing from the Labour Representation Committee to the Labour party conference in Brighton Getty 10/12 Prominent anti-Brexit campaigner Steve Bray protests on Brighton beach during the Labour party conference Reuters 11/12 Anti-Brexit protesters take part in a People's Vote rally during the Labour party conference in Brighton EPA 12/12 Activists raise a banner calling for the Labour party to restore the original Clause 4 of its constitution, which would pledge the party to nationalising all industry Getty\n\nSome Labour ministers had suggested universal credit could merely be reshaped, rather than scrapped outright, but Mr Corbyn pledged sweeping “immediate” changes to:\n\n* End the two-child limit for receiving the benefit, which official figures show has affected almost 600,000 children.\n\n* Pay the benefit after two weeks – after repeated criticism of the DWP for failing to end five-week waits, as promised.\n\n* Allow ‘split payments’ – after warnings that single household payments penalise women, particularly those at risk of domestic violence – and pay the child element to the primary carer.\n\n* Make payments directly to landlords, as with housing benefit, after an explosion in debt owed by vulnerable tenants.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Inside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\n* End the ‘digital only’ requirement, arguing it penalises who are not computer literate, recruiting 5,000 additional advisors to deliver the change.\n\nMr Corbyn will announce that Labour will also end the overall benefit cap, set at £20,000 a year outside London, and suspend the “punitive sanctions regime” for claimants failing to comply with DWP rules.\n\n“When a Labour government takes office, we will introduce an emergency package of reforms to end the worst aspects of universal credit,” he added.\n\n“And we will introduce a new system that will be based on the principles of dignity and respect – and it will alleviate and end poverty, not drive people into it.”\n\nThe Child Poverty Action Group has warned that the two-child limit will plunge 300,000 more children into poverty by the time universal credit is fully rolled out in 2024.\n\nTherese Coffey, the new work and pensions secretary, has said nothing about universal credit since taking the job in late July, despite pressure to stop its extension to up to three million more people.\n\nHer predecessor, Amber Rudd, admitted in February that universal credit was likely to be the main cause for claimants seeking emergency aid at food banks.\n\nThe Scottish government already offers claimants the option of a twice-weekly payment and for housing payments to go directly to landlords, with “a substantial take-up”, Labour said.", "description": "Universal credit will be scrapped if Labour wins power, Jeremy Corbyn has announced, arguing the move will prevent 300,000 children falling into poverty.", "authors": ["Rob Merrick"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/10/27/14/universal-credit.jpg", "published_at": "2019-09-27"}