{"pub": "fox", "url": "https://foxnews.com/media/trump-impeachment-adam-schiff-matt-gaetz-jeffrey-lord", "downloaded_at": "2019-10-05 12:24:00.809131+00:00", "title": "Matt Gaetz: Democrats' impeachment inquiry 'politically illegitimate' -- and public will see that", "language": "en", "text": "The American people will recognize Democrats' effort to impeach President Trump as a \"politically illegitimate exercise,\" according to Rep. Matt Gaetz, R-Fla.\n\nDemocrats have decided to be less transparent in their latest endeavor against Trump because past congressional hearings didn't pan out as planned, Gaetz claimed Friday on \"Hannity.\"\n\n\"The radical left and their allies in the fake news media have been uncontent to just disagree with him, and so they have been trying to delegitimize his election,\" he said. \"They're going to rush to an impeachment and the American people will see it as the politically illegitimate exercise that it is.\"\n\n\"They're going to rush to an impeachment and the American people will see it as the politically illegitimate exercise that it is.\" — U.S. Rep. Matt Gaetz, R-Fla.\n\nWASHINGTON POST AWARDS ADAM SCHIFF 'FOUR PINOCCHIOS' FOR FALSE COMMENTS ABOUT WHISTLEBLOWER\n\nGaetz, who serves on the House Judiciary Committee, also claimed that House hearings featuring former Nixon White House counsel John Dean, ex-Special Counsel Robert Mueller, and Corey Lewandowski backfired for Democrats.\n\n\"They're not interested in developing the evidence -- they're not actually interested in holding hearings and bringing people forward,\" he said, calling the three hearings \"disaster[s] for Democrats.\"\n\nHe called the Russia investigation a \"hoax\" and said Democrats pushing forward with the Trump impeachment inquiry are not getting routine participation from all members of Congress.\n\nGaetz questioned why Rep. Adam Schiff, D-Calif., remains chairman of the powerful House Intelligence Committee despite a claim about the Ukraine whistleblower that earned him four \"Pinocchio's\" from the Washington Post.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nThe Post he hadn't told the truth about his knowledge of the Ukraine whistleblower. Schiff has played a leading role in investigating the Trump-Ukraine scandal but hasn’t been truthful in the process, according to Washington Post fact-checker Glenn Kessler.\n\n“Schiff’s answers are especially interesting in the wake of reports in The New York Times and The Washington Post that the whistleblower approached a House Intelligence Committee staff member for guidance before filing a complaint with the Intelligence Community inspector general,” Kessler wrote.\n\nOn \"Hannity,\" Gaetz claimed Schiff, \"lied to the American people for two and a half years.\"\n\n\"How is Adam Schiff even the chairman of a committee in the Congress right now?\" he asked. \"That guy should be gone.\"\n\nFox News' Brian Flood contributed to this report.", "description": "The American people will recognize Democrats' effort to impeach President Trump as a \"politically illegitimate exercise,\" according to Rep. Matt Gaetz, R-Fla.", "authors": ["Charles Creitz", "U.S. Rep. Matt Gaetz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/06/Hannity-Gaetz-FOX.jpg", "published_at": "2019-10-05"}