{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/woman-quits-job-funeral-director-become-professional-mermaid-earning-100-hour-10873525", "downloaded_at": "2019-10-07 07:39:47.125651+00:00", "title": "Woman quits job as funeral director to become a professional mermaid", "language": "en", "text": "‘You have to learn how to control your breathing and your heart rate’ (Picture: Solent News)\n\nA woman has made a drastic career change to become a full-time mermaid after realising that her job as a funeral director was making her miserable.\n\nJasmine Seales, from Basingstoke, says she would often ‘end up crying to myself’ at the funeral home because dealing with grieving families was so hard.\n\nSo the 28-year-old quit her job after she was inspired to become a professional mermaid. She has even vowed ‘I’ll do it until it puts me in a wheelchair’ because she loves it so much.\n\nNow she trains in the water up to twice a week and can hold her breath underwater for an impressive two minutes and 35 seconds.\n\nJasmine can earn up to £100 per hour (Picture: Solent News)\n\nShe wears bejewelled bras and ‘dragon skin platinum silicone’ mermaid tails when she performs at festivals, birthday parties and events – and she can earn up to £100 an hour.\n\nAdvertisement\n\nAdvertisement\n\nJasmine, who has fibromyalgia, discovered the unique sport when she was at Bestival on the Isle of Wight and knew she had to try it.\n\n‘There was a girl there doing displays and it just looked really interesting,’ she says.\n\n‘I got speaking to her and I thought why not give it a go. It has been a life-changing decision.’\n\nBut being a professional mermaid isn’t all glamorous photoshoots on the beach – you actually have to be really skilled. Jasmine has had to train rigorously at camp to learn to control her breathing under the water.\n\nThe niche sport is starting to gain popularity in the UK (Picture: Solent News)\n\n‘I train once or twice a week and just being in the water in general really helps my body in check.\n\n‘When training, you have to learn how to control your breathing and your heart rate to be able to perform underwater for prolonged periods of time.\n\n‘At first, it feels pretty unnatural, but the more you do it you become used to it.’\n\nJasmine explains that the niche sport has been booming in the US for a while and is only just starting to gain popularity here in the UK.\n\n‘It has just been so much fun and it’s a really creative thing to do,’ she adds.\n\nAdvertisement\n\nAdvertisement\n\nJasmine even took part in the Miss Mermaid UK pageant this weekend, which was held to raise money and awareness for the organisation Sea Shepard UK.\n\nMORE: Miss Trans Queen India crowns its third winner – and the prize is cosmetic surgery\n\nMORE: Halloween boobs are back, so get the glitter and glue out\n\nMORE: Strong Women: ‘Two of my friends took their own lives – now I’m walking 1,600 miles to raise awareness’\n\nAdvertisement Advertisement", "description": "Jasmine Seales is loving her new career as a professional mermaid. She trains to hold her breath so she can perform at parties and festivals.", "authors": ["Natalie Morris"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_88783006_1570431798.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}