{"pub": "independent", "url": "https://independent.co.uk/life-style/david-beckham-personal-trainer-shona-vertue-biggest-mistakes-in-gym-weight-loss-a8533066.html", "downloaded_at": "2019-09-25 13:51:05.214071+00:00", "title": "David Beckham's former personal trainer reveals 3 biggest mistakes women make in the gym", "language": "en", "text": "Gyms can be strange. Plagued by toxic stereotypes which condition men to relentlessly pump iron while women avoid lifting weights out of fear of bulking up, it’s no surprise that so many of us are getting it wrong when we work out.\n\nIt can be particularly tricky for women, who are fed a Victoria’s Secret narrative of beauty from a young age which presents a slim and toned physique as the ultimate goal, exacerbating anxieties about becoming 'too muscly'.\n\nPlus, personal trainers can be expensive, leaving many of us turning to Instagram for guidance, copying fitness influencers with no formal training which may lead to poor form and injuries.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThese are just some of the ways women may be doing themselves a disservice when it comes to exercise, explains Shona Vertue, former personal trainer for David Beckham.\n\nSpeaking to The Independent, the Australian fitness expert, who is working with AXA PPP healthcare for National Fitness Day this month, reveals the three biggest mistakes women make in the gym - and how to rectify them.\n\n1. Not lifting heavy weights\n\nWhile the physical benefits of lifting weights as a woman are well-documented, Vertue stresses the psychological value too and argues that not enough women are making the most of the weights room in gyms.\n\n“There’s so much empowerment you can get from picking up heavy things,” she says.\n\n“Often women are told to lift these tiny pink dumbbells which is ridiculous - have you ever lifted a woman’s handbag?\n\n“It’s so much heavier than what a man carries, which is essentially just his wallet and his phone.”\n\n“We need to have the strength, we’re carrying a kid in one arm and a laptop in the other.\n\n“Women need to be stronger than they’ve been told in the past.”\n\n2. Wasting time trying to ‘spot reduce’\n\nAll you have to do is search ‘how to get abs’ on Google to see the extent at which we are sold the myth that one simple set of exercises will give us chiselled abs.\n\nOr, you could type ‘how to get perky glutes’ for a similar stream of false promises.\n\nTrying to target fat loss in certain body parts, or ‘spot reducing’, as it’s known, is not possible, explains Vertue.\n\n“We need to think about the body as a whole. If you only have a little bit of time, you want to choose compound movements: squats, lunges and push-ups.\n\n“These will work your entire body and mean you will have to work out for less time,” she explains.\n\n3. Taking advice from unqualified people\n\nThanks to the advent of social media, everyone with a smartphone and a sports bra can fancy themselves as a fitness influencer.\n\nWhile Instagram can be a useful tool for PTs to build their personal brand, there’s nothing stopping Jane Doe from telling thousands of followers to ‘burpee till the cows come home’ without so much as a personal training qualification.\n\nA lot of the time, when we copy routines posted on the ‘gram, we’re doing them wrong, Vertue says.\n\nNot only could this lead to injury, but she explains that incorrect form can change the way it affects your body from an aesthetic point of view.\n\n“It’s important to pay attention to form because how you actually move is going to make a difference to the aesthetic that you build,” she says.\n\n“For example, if you’re doing an overhead press and using your traps, you’re going to build big muscles on top of your shoulders.\n\n“However, if you do it properly, you’re going to sculpt the areas you want to.”\n\nShona Vertue has partnered with AXA PPP healthcare to launch their 2018 Flying Start campaign for National Fitness Day. For more information please visit www.axappphealthcare.co.uk/myflyingstart", "description": "Gyms can be strange. Plagued by toxic stereotypes which condition men to relentlessly pump iron while women avoid lifting weights out of fear of bulking up, it’s no surprise that so many of us are getting it wrong when we work out. It can be particularly tricky for women, who are fed a Victoria’s Secret narrative of beauty from a young age which presents a slim and toned", "authors": ["Olivia Petter"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2018/09/11/16/screen-shot-2018-09-11-at-16.46.52.png", "published_at": "2019-09-25"}