{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7583861/Italys-court-orders-retrial-former-Carige-chairman.html", "downloaded_at": "2019-10-17 12:00:13.731360+00:00", "title": "Italy's top court orders retrial of former Carige chairman", "language": "en", "text": "By Domenico Lusi\n\nROME, Oct 17 (Reuters) - Italy's top court has ordered a retrial of Giovanni Berneschi, former chairman of bailed-out regional bank Carige, who has been sentenced to eight years and seven months in jail for criminal association and money laundering.\n\nPlaced under arrest in 2014, Berneschi, 82, and other defendants were first convicted in 2017 by a Genoa court, a sentence upheld the following year by an appeal court in the port city where Carige is headquartered.\n\nBerneschi and the other defendants have always denied any wrongdoing.\n\nBerneschi and the others will now be tried again in Milan, a lawyer for two of the defendants said on Thursday, citing a ruling read out in the court late on Wednesday.\n\nUnder Italian law, a trial has to be held in the city where the most serious offence took place. In previous rulings, criminal association had been deemed the most serious offence.\n\nBut Italy's highest court upheld a claim by the defendants' lawyers that the most serious offence is that of money laundering, which was allegedly committed in Milan.\n\n\"We still have to face the Milan trial but I can already tell you this: I'll ask for million of euros in damages for what I went through with my family, all the pain we endured,\" Berneschi said in an interview on Thursday with Genoa daily Il Secolo XIX.\n\n\"I look at this city ... I have financed all of Genoa's main projects ... and they treated me like the worst thief. Now I can start holding my head high again,\" he added.\n\nBerneschi was ousted from his job in September 2013 after 20 years as Carige's chairman in a management overhaul imposed by supervisors following audits that revealed poor lending practices, a large derivatives exposure and questionable accounting methods.\n\nAfter being placed under special administration by the European Central Bank in January, Carige was kept afloat by other Italian banks, which shouldered the bulk of a 900 million euro ($1 billion) rescue.\n\nShareholders in Carige last month approved a 700 million euro cash call, relinquishing control of the bank to save it from liquidation after years of losses.\n\nUnder Italian rules, the statute of limitations for the most serious offence in the new trial runs out in around five years, the defence lawyer said, indicating the trial may not reach completion given the lengthy duration of court proceedings in the country. ($1 = 0.8998 euros) (Writing by Sabina Suzzi and Valentina Za, Editing by Keith Weir and Jane Merriman)", "description": "By Domenico LusiROME, Oct 17 (Reuters) - Italy's top court has ordered a  retrial of Giovanni Berneschi, former chairman of bailed-out  regional bank Carige,...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-17"}