{"pub": "breitbart", "url": "https://breitbart.com/border/2019/10/10/migrant-protests-close-border-city-bridge-into-texas", "downloaded_at": "2019-10-11 00:16:57.327179+00:00", "title": "Migrant Protests Close Border City Bridge into Texas", "language": "en", "text": "Federal authorities were forced to close traffic at an international port of entry in Brownsville, Texas, after a group of approximately 300 migrants gathered in protest after not being allowed to pass.\n\nThe incident began on Thursday shortly after 1 a.m. when a group of close to 300 migrants collected at the mid-point of the pedestrian bridge, prompting a temporary shutdown, U.S. Customs and Border Protection revealed.\n\nBrownsville is immediately north of the Mexican border city of Matamoros, where hundreds of migrants are gathered as they wait for their turn to request entry or asylum. Since only a certain number are allowed daily, the rest make camp around the international bridge.\n\nTraffic resumed briefly at 3:45 a.m., but by 8.a.m. authorities were forced to close all lanes again due to renewed protest actions. Mexican authorities have asked them to disperse since they were disrupting regular traffic between the border cities.\n\nIldefonso Ortiz is an award-winning journalist with Breitbart Texas. He co-founded Breitbart Texas’ Cartel Chronicles project with Brandon Darby and senior Breitbart management. You can follow him on Twitter and on Facebook. He can be contacted at Iortiz@breitbart.com.\n\nBrandon Darby is the managing director and editor-in-chief of Breitbart Texas. He co-founded Breitbart Texas’ Cartel Chronicles project with Ildefonso Ortiz and senior Breitbart management. Follow him on Twitter and Facebook. He can be contacted at bdarby@breitbart.com.\n\n“J.A. Espinoza” and Tony Aranda from Breitbart Texas’ Cartel Chronicles project contributed to this report.", "description": "Authorities were forced to close an international port of entry in Brownsville, Texas, after a group of migrants gathered in protest.", "authors": ["Ildefonso Ortiz", "Brandon Darby"], "top_image": "https://media.breitbart.com/media/2019/10/Matamoros-Bridge-640x335.png", "published_at": "2019-10-10"}