{"pub": "npr", "url": "https://npr.org/2019/10/26/773041703/gene-weingarten-mines-magic-from-just-one-day", "downloaded_at": "2019-10-26 23:59:15.359924+00:00", "title": "Gene Weingarten Mines Magic From Just 'One Day'", "language": "en", "text": "Gene Weingarten Mines Magic From Just 'One Day'\n\nOne Day The Extraordinary Story of an Ordinary 24 Hours in America by Gene Weingarten Hardcover, 374 pages | purchase close overlay Buy Featured Book Your purchase helps support NPR programming. How?\n\nHow much human life goes into a single day? Life and death, effort and rest, love, loss, and striving. Gene Weingarten — who's won two Pulitzer Prizes for his Washington Post feature writing — decided to try and tell stories from a single day in history, and remind us of the preciousness of life in everyday moments.\n\nHis new book is One Day: The Extraordinary Story of an Ordinary 24 Hours in America. Weingarten calls the book the ultimate extension of his \"hammer and nail\" technique. \"As an editor I once had five different writers walk into a room, take out five phone books, and hammer a nail into each phone book,\" he says, \"and the deal was, they had to write a profile of whoever that nail stopped at. It was risky. But you know, I have the philosophy that there's a story in everything. And they proved it true.\"\n\nInterview Highlights\n\nOn deciding which day to write about\n\nI went to a restaurant, brought [an] old green fedora. Inside were 63 crumpled pieces of paper — 31 on the first drawing, drawn by a little boy for the day of the year. 12 in the second one for the month the year, and 20 for the third one; I had limited the year to one of 20 years. I wanted people alive who I could talk to who remembered what happened. So we limited it to 1969 to 1989.\n\nOn the chosen date, Sunday, December 28, 1986\n\nJournalists will tell you that the absolutely worst news day of the week is Sunday. And this was a Sunday. The absolutely worst news week of the year is the sleepy one between Christmas and New Year's, and at least at first glance, 1986 didn't ring any great news bells with me. We seemed to have the worst day of the week in the worst week of the year in a bad year.\n\nOn one of the stories that did happen that day — a Dallas firefighter's act of courage\n\nHe did the proverbial thing: He rushed into a burning building. In his case, he could have put an oxygen mask on, but he had heard that there were children in there, and he didn't take the time to do it. He used this primitive technique that firefighters can use if they have the nerve: He grabbed his air from the [firehose] nozzle. You know there's a little ring of air around the nozzle as it's pouring the water out. And he went in. There were two children. One did not survive. One did. And the one who survived, survived with phenomenal injuries.\n\nOn Michael Anthony Green, the surviving child\n\nHe is deeply disfigured, to the point where initially it's hard to look at him. He knows that, he acknowledges that. He actually has worked in a haunted house without any makeup on. He has that kind of attitude toward what happened ... it was his idea. After a very short period of time in talking to this amazing young man, you kind of forget that he looks different. It's a phenomenon I didn't think I would experience and I did.\n\nOn researching with Google\n\nThe book has these tragedies in it. It also has stories that are ostensibly simple and straightforward. And what I did find is that the deeper you dig, you find out that nothing is really simple or straightforward.\n\nGoogling the date gives you a lead. What happens after that is the follow-up, and that's where the magic arrives. The lead you get is essentially a tip to something that might have happened that day. In the follow-up, you get all of the depths and some — some — of the follow-up just turned into unbelievable stories, way deeper than the initial story suggested.\n\nOn how we missed all these stories the first time around\n\nWe were engaged in our own lives. You know, the book has these tragedies in it. It also has stories that are ostensibly simple and straightforward. And what I did find is that the deeper you dig, you find out that nothing is really simple or straightforward.\n\nThere is a couple that met on the day for five minutes. They then went on a date the next day, and on this date they got pretty drunk and announced to a roomful of people that they were engaged! And on the following day the man moved in with the woman — which is the day he learned for the first time that she had two sons. He just hadn't thought to ask. Now obviously, this is a relationship doomed. Well they're still together. And they're still in love, and it's just this wonderful happy story about love and persistence.\n\nOn whether he could choose most any day in history and still have this range of stories\n\nI am now absolutely certain. I don't think it matters what day you would pick. You would get different stories but they would still cover this amazing scope of life.\n\nThis story was edited for radio by Samantha Balaban and Ed McNulty, and adapted for the Web by Petra Mayer", "description": "The humorist asked three strangers to pick a random day, month and year out of a hat — December 28, 1986, as it turned out. And then he set out to document every single thing he could for that day.", "authors": ["Scott Simon", "Gene Weingarten"], "top_image": "https://media.npr.org/assets/img/2019/10/24/one-day_pm_wide-1c876b726afc10fd562ddb97a5852719ff3c149b.jpg?s=1400", "published_at": "2019-10-26"}