{"pub": "washingtonpost", "url": "https://washingtonpost.com/climate-environment/2019/09/24/trump-officials-threaten-withhold-highway-funds-california-its-chronic-air-quality-problems/?tid=pm_pop", "downloaded_at": "2019-09-24 16:01:17.020061+00:00", "title": "Trump officials threaten to withhold highway funds from California for its ‘chronic air quality problems’", "language": "en", "text": "In a predated letter sent late Monday to the California Air Resources Board, EPA Administrator Andrew Wheeler suggested that the state “has failed to carry out its most basic tasks under the Clean Air Act,” and needs to either update its plans to tackle air pollution or risk losing federal highway funds. California receives billions in highway funding from the U.S. government every year, and federal officials have the right to halt that money if they determine that a state is not taking sufficient steps to show how it aims to cut air pollution such as soot or smog-forming ozone.\n\nIn the letter, Wheeler notes that 34 million Californians live in areas that don’t meet federal National Ambient Air Quality Standards, more than twice as many residents than any other state. California has more than 130 “state implementation plans,” which serve as blueprints for how California would tackle these pollutants, awaiting federal approval.\n\n“California has the worst air quality in the United States,” he wrote, adding that many of its plans “are inactive and appear to have fundamental issues” that would keep them from getting approved.\n\nThe decision to invoke a rarely used federal punishment represents the latest salvo in the Trump administration’s feud with California over environmental and other policy issues. Just last week, the EPA joined the Transportation Department in revoking California’s right to set stricter pollution limits on cars and light trucks.\n\nCalifornia officials have repeatedly argued that they have sought to impose stricter limits on greenhouse gas emissions from vehicles as part of a broader effort to tackle air pollution in their state. The vehicle standards the Trump administration is blocking, CARB chairwoman Mary Nichols said last week, “are necessary to protect the public health standards and welfare.”\n\nNichols could not immediately be reached for comment Tuesday.\n\nBill Becker, president of Becker Environmental Consulting, said in a phone interview that it did not make sense for the administration to punish California for failing to address air pollution in the state when it was simultaneously blocking its efforts to cut down on these emissions.\n\n“Isn’t it ironic that EPA is taking away some of the important regulatory tools for meeting the federal health-based standards, and then sanctioning California?” Becker said. “It’s like the kid killing his parents, and then pleading for mercy because he’s an orphan.”", "description": "Trump administration officials threatened Tuesday to withhold federal highway funds from California, arguing that it had failed to show what steps it's taking to improve its air quality. The move by the Environmental Protection Agency escalates the fierce battle between President Trump and the left-leaning state, and could put billions in federal funds in jeopardy.", "authors": ["Juliet Eilperin", "Reporter Covering Domestic Policy", "National Affairs", "Dino Grandoni", "Reporter Covering Energy", "Environmental Policy"], "top_image": "https://www.washingtonpost.com/resizer/3-28YmApGcWDqXcKZ7rkjQeTjo4=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/3NQBJ7VBYQI6TJ3H26VYJLXT5E.jpg", "published_at": "2019-09-24"}