{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/elizabeth-warren-highlights-violence-transgender-women-color-reads/story?id=65768871", "downloaded_at": "2019-09-22 00:27:17.437479+00:00", "title": "Elizabeth Warren highlights violence against transgender women of color, reads names of those killed this year", "language": "en", "text": "Senator Elizabeth Warren, D-MA., was the penultimate speaker at Friday night’s forum focused on LGBTQ issues, and took the stage with a powerful opening statement.\n\nInterested in Elizabeth Warren? Add Elizabeth Warren as an interest to stay up to date on the latest Elizabeth Warren news, video, and analysis from ABC News. Add Interest\n\n“If elected President, what should LGBTQ Americans expect from the first 100 days in office?” moderator Lyz Lenz asked Warren.\n\n“I’m not going to tell you - I’m going to show you,” Warren said, taking out a small slip of pink paper.\n\n“Dana Martin, Jazzaline Ware, Ashanti Carmon, Claire Legato, Muhlaysia Booker,” Warren read. Her voice began to shake.\n\n“Michelle ‘Tamika’ Washington, Paris Cameron, Chanel Lindsey, Chanel Scurlock, Zoe Spears, Brooklyn Lindsey, Denali, Berries Stuckey, Kiki Fantroy, Pebbles LaDime ‘Dime’ Doe, Tracy Single, Bailey Reeves, Bee Love Slater, Ja’leyah-Jamar.”\n\nJoshua Lott/Getty Images\n\nShe read their names, carefully pronouncing each of the 18 transgender women of color who have been killed so far this year.\n\n“It is time for a President of the United States of America to say their names,” Warren said.\n\nDrew Angerer/Getty Images\n\nWarren’s acknowledgment of those 18 women called attention to an LGBTQ community concern that has yet to see much spotlight on the 2020 stage, but she and several of her fellow candidates have tried to bring the issue to the fore.\n\nSaying their names out loud served as a larger call for attention and action to an issue that largely goes underreported.\n\nThe crowd met her words with a standing ovation.\n\nThe transgender community faces a staggering rate of discrimination, poverty and homelessness. Trans women of color particularly are at steep risk of marginalization, violence and erasure.\n\nAt least 18 transgender people have been killed this year, according to the Human Rights Campaign. The group tracked 29 killings in 2018, the most it ever recorded in a year.\n\nSince 2013, HRC has tracked at least 145 transgender deaths due to violence, with most victims being black transgender women. But the organization said the violence is hard to track due to misgendering -- incorrectly applying gender labels -- and transphobia.\n\nScott Olson/Getty Images\n\nIn June Texas Rep. Beto O’Rourke invoked the names of two trans women of color killed in his home state of Texas. He named them while leading a Pride run in New York City, just as he unveiled his proposal for achieving equality for LGBTQ Americans.\n\nSouth Bend, Ind., Mayor Pete Buttigieg has also called attention to the issue, speaking out about the violence against, and the obstacles faced by trans women of color. Friday night at the GLAAD-hosted forum, he also spoke about his experiences facing discrimination as a gay man. Former Vice President Joe Biden has also addressed the five African American transgender women who had at that time already been killed in 2019, and Senator Cory Booker, D-NJ., also spoke clearly about the need for trans-specific protections.", "description": "Elizabeth Warren named the 18 transgender women of color who have been killed this year at the LGBTQ forum in Iowa.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Politics/warren-01-as-gty-190921_hpMain_16x9_992.jpg", "published_at": "2019-09-21"}