{"pub": "townhall", "url": "https://townhall.com/tipsheet/timothymeads/2019/09/24/those-idiot-protesters-caused-dcs-metro-to-be-a-pain-for-working-class-americans-n2553562", "downloaded_at": "2019-09-24 15:13:50.451587+00:00", "title": "Those Idiot Protesters Caused DC's Metro System To Be A Giant Pain For Working Class Americans", "language": "en", "text": "It is Monday morning and you are delayed on the Washington, D.C. Metro -- again. You check on the WMATA website to see what the hold up is. Turns out, it is protester activity. You mindlessly check Twitter while you wait and see that the global warming Woodstock known as ShutDownDC is occurring. Cars, it turns out, are impacted by these tree huggers as well. Surely, the delay must be caused by some sort of riot between the far-right and far-left. You suddenly realize, actually, the protesters' entire goal was to force Americans heading to work in D.C. to be delayed. You then read about some guy twerking who is holding up traffic. \"What is twerking?\" you wonder. In your search, you see a video of a grown man in Daisy Dukes shaking his butt near the Capitol building as he protests climate change. Your train still has not arrived and you somewhat wonder if we all deserve to be wiped off the planet in an apocalyptic environmental disaster. Monday mornings stink, you sigh in disbelief.\n\nI would have to imagine thousands of D.C. commuters found themselves in that exact scenario this week as ShutDownDC caused an absolute headache for anybody trying to get to work Monday morning.\n\nAaron Ross Powell of Cato Institute tweeted, \"I've been told by pro-#ShutDownDC people that their protests aren't making commutes difficult for lower-income DC residents who take the bus because the protesters aren't interfering with buses. WMATA begs to differ.\"\n\nI've been told by pro-#ShutDownDC people that their protests aren't making commutes difficult for lower-income DC residents who take the bus because the protesters aren't interfering with buses. WMATA begs to differ. https://t.co/gfY2U0d52L — Aaron Ross Powell (@ARossP) September 23, 2019\n\nThere were at least 32 lines affected by the protest. Lower income workers, the very people the left claim to support, were affected by the protest as they tried to work. Comfortably Smug captured what this looked like for thousands of people.\n\n.@AndrewCFollett is right: unlike what #shutdowndc is saying, their blockade is clearly and obviously impacting bus riders, and even WMATA is admitting to it: pic.twitter.com/fbbxTb6NpT — Ashley Rae Goldenberg (@Communism_Kills) September 23, 2019\n\nWhen asked how they felt about harming low-income workers chances to feed their families and earn a living, the left simply we responded that protesting climate change was more important. The Daily Caller News Foundation recorded the interaction.\n\nClimate protesters on my way to work decide that their protest is more important than a low-income worker’s job pic.twitter.com/DHuBjlMGqm — Katrina B Haydon?? (@katrinabhaydon) September 23, 2019\n\nAs The Federalist's David Marcus said, \"White privilege is not having to work on Monday morning so you can stop people in a majority POC city from getting to their jobs.\"\n\nWhite privilege is not having to work on Monday morning so you can stop people in a majority POC city from getting to their jobs. https://t.co/KOvlKcHi2s — David Marcus (@BlueBoxDave) September 23, 2019\n\nAs our very own metro-riding Cortney O'Brien can testify, the delays lasted well into the afternoon on the metro system due to overcrowding from people ditching their cars in exchange for DC's subway system. What a disaster.", "description": ".09/24/2019 11:09:34AM EST.", "authors": ["Timothy Meads", "Cortney O'Brien", "Matt Vespa", "Beth Baumann", "Leah Barkoukis"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/images/2019/267/749f2512-900d-45a3-aae4-81438e34447c.png", "published_at": "2019-09-24"}