{"pub": "reuters", "url": "https://in.reuters.com/article/soccer-spain-preview/still-missing-messi-barca-challenged-to-make-things-click-against-valencia-idINKCN1VX1EA", "downloaded_at": "2019-09-12 12:49:50.449629+00:00", "title": "Still missing Messi, Barca challenged to 'make things click' against Valencia", "language": "en", "text": "BARCELONA (Reuters) - With Lionel Messi still injured, faltering La Liga champions Barcelona host Valencia on Saturday needing to prove they can produce big performances without their talisman.\n\nSoccer Football - Joan Gamper Trophy - Barcelona v Arsenal - Camp Nou, Barcelona, Spain - August 4, 2019 Barcelona's Lionel Messi waves to fans before the match REUTERS/Albert Gea\n\nMessi has not played a minute of football this season due to a calf injury and without him Barca have made their worst start to a campaign since 2008, taking four points from three games.\n\nWhile they thrashed Real Betis 5-2 in their previous home game, they stumbled to a 2-2 draw at promoted Osasuna in their last outing, failing to have a shot on goal in the first half in a performance coach Ernesto Valverde described as “awful”.\n\nMessi, who confirmed he will not be back to face Valencia and still does not know when he will return, urged his team mates to take a step up after their haphazard start.\n\n“It has been a strange start because we have had a lot more injuries than normal,” Messi told newspaper Sport.\n\n“I’m not worried although we are all aware that we cannot afford to make a bad start like this and after the international break we need to make things click, strengthen as a team and start winning matches.”\n\nMessi’s fellow forwards Ousmane Dembele and Luis Suarez also remain injured ahead of the visit of Valencia, who Barca failed to beat in three games last season, including losing 2-1 to them in the Copa del Rey final.\n\nValencia are in a turmoil of their own, however, after coach Marcelino, who transformed them from fallen giants to fiercely competitive top-four contenders, was sacked due to a reported fall out with owner Peter Lim over transfer policy.\n\nThe inexperienced Albert Celades, the former coach of Spain’s under-21 side, has been given the job amid widespread criticism.\n\n“Marcelino fulfilled every objective he was hired for, sacking him is an outrage,” said former Valencia goalkeeper Santiago Canizares.\n\n“Celades has only coached youth players and has no credentials to work in the top flight. He has no idea what he has gotten himself in for and what the dressing room is like. He will have his work cut out from the start.”\n\nElsewhere on Saturday, leaders Atletico Madrid visit Real Sociedad in the first game at the revamped Anoeta stadium looking to make it four wins out of four.\n\nReal Madrid host Levante missing a total of nine players, with Luka Modric the latest to suffer an injury.", "description": "With Lionel Messi still injured, faltering La Liga champions Barcelona host Valencia on Saturday needing to prove they can produce big performances without their talisman.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190912&t=2&i=1429047496&w=1200&r=LYNXNPEF8B0VT", "published_at": "2019-09-12"}