{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7618183/Woods-builds-three-shot-lead-Matsuyama-round.html", "downloaded_at": "2019-10-27 04:47:19.010720+00:00", "title": "Woods builds three-shot lead over Matsuyama after third...", "language": "en", "text": "By Andrew Both\n\nCHIBA, Japan, Oct 27 (Reuters) - Tiger Woods left the field building a commanding three-stroke lead over Hideki Matsuyama after the third round at the Zozo Championship on Sunday.\n\nWoods teed off with a two-shot advantage and after teasing his chasers with an opening three-putt bogey, he surged clear with six birdies, before stumbling with a late bogey after chunking his third shot at the par-five 14th.\n\nHe shot four-under-par 66, though a three-put par at the par-five 18th left him clearly frustrated.\n\nIn his first event since undergoing arthroscopic knee surgery two months ago, Woods posted a 16-under 194 total with one round left at Narashino Country Club.\n\nLocal favorite Matsuyama, making a rare appearance in his homeland, birdied the final hole to grab second spot on 13-under, while American Gary Woodland (68) was third on 12-under.\n\nPlaying in front of a sellout crowd after Saturday's second round was completed behind closed doors sans spectators due to some muddy conditions that were deemed unsafe, leader Woods put on a clinic for most of the round.\n\nA win by Woods would be his 82nd on the PGA Tour, matching Sam Snead's record.\n\nAnd it would leave the 43-year-old highly likely to pass Snead sooner rather than later. Snead was 52 when he recorded his final victory.\n\nThe final round resumed almost immediately on what was going to be a marathon day for the field after the 6.30 a.m. local time start.\n\nThe marathon was a result of Friday's washout. Some players should complete 72 holes by time darkness falls at 5 p.m. (0800 GMT), but the leaders seem destined to return on Monday morning.\n\nThat should be but a minor imposition for Woods, what with his private jet and all. (Editing by Amlan Chakraborty)", "description": "By Andrew BothCHIBA, Japan, Oct 27 (Reuters) - Tiger Woods left the field building a commanding three-stroke lead over Hideki Matsuyama after the third round...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-27"}