{"pub": "yahoo", "url": "https://news.yahoo.com/tyshawn-lee-murder-trial-chicago-201758921.html", "downloaded_at": "2019-10-04 09:21:01.074859+00:00", "title": "Jury finds Chicago gang member guilty in the murder of 9-year-old Tyshawn Lee", "language": "en", "text": "CHICAGO — After just a few hours of deliberation late Thursday night, a Cook County jury found a man guilty of first degree murder of Tyshawn Lee, a 9-year-old boy who was shot and killed in one of Chicago's most horrific crimes.\n\nJurors found Dwright Boone-Doty guilty of murder in the first degree for shooting the boy in the head after promising to buy him a treat. Boone-Doty led the boy into an alley and executed him in a gang hit that shocked the nation for its brutality.\n\nBoone-Doty and another man, Corey Morgan, were tried before separate juries. Morgan's jury was still deliberating as of Thursday night.\n\nSeveral members of the boy's family held hands as the court read the verdict. Upon hearing the verdict, they began crying.\n\nA third man involved in the murder, Kevin Edwards, has already pleaded guilty to first-degree murder in exchange for a 25-year prison sentence.\n\n“Tyshawn Lee’s life is over, way too short. Although his life is over, his story isn’t,\" state's attorney Craig Ingleford told the jury earlier in the day during closing arguments. \"It’s an ending you get to write. It will never be a happy ending, but it can be a just one.”\n\nTyshawn was a fourth grader in November 2015 when he was killed by gang members to send a message to his father, an alleged member of a rival gang, prosecutors say. The killing was seen by many as underscoring the viciousness of warring factions in Chicago.\n\nMurder of 9-year-old Tyshawn Lee: Gang members will stand trial\n\nTrial begins: 'Heinous' gang-related murder of 9-year-old Tyshawn Lee\n\nOver the past two and a half weeks, the jury has borne witness to the horrifying details of the child's execution-style murder, with testimony ranging from police to family members.\n\nAfter school on Nov. 2, 2015, Tyshawn was sitting on a swing at the park down the street from his grandmother's house when a man approached him, dribbled his basketball, offered to buy him a snack and then led him to an alley, where he shot the child several times at close range, prosecutors say.\n\nThe execution-style shooting was an act of revenge, according to prosecutors. Boone-Doty and Morgan, members of the same gang, believed that a rival faction had killed Morgan's 25-year-old brother and wounded his mother a month earlier.\n\nThis undated file photo provided by the Chicago Police Department shows Dwright Boone-Doty, 22, who was charged with first-degree murder in the Nov. 2, 2015, death of 9-year-old Tyshawn Lee. More\n\nMorgan and Boone-Doty were angered by the attack and wanted to get back at Tyshawn's father, Pierre Stokes, who was also an alleged member of the rival gang, prosecutors say. So Boone-Doty struck up a conversation with Tyshawn and led him to the alley.\n\nShell casings at the scene of the crime and the associated gun would eventually be linked back to Morgan and his brother, Anthony Morgan, who purchased the gun from a man in New Mexico.\n\nA major moment in the case came last week, when a witness revealed how officers first recovered the weapon used to murder Tyshawn: In 2017, a squad car pulled up on an empty lot where a rap video was being filmed, causing \"several dozen people\" to flee the scene, leaving behind five guns, according to Sun-Times reporting. One of those guns was linked to Tyshawn's murder.\n\nThe revelation angered Morgan's lawyers, who wondered why individuals involved with the video were not brought in for questioning. On Thursday, Cook County Circuit Judge Thaddeus Wilson said that the new information did not merit a mistrial.\n\nThe final week of testimony packed a punch.\n\nOn Monday, jurors heard recordings of Boone-Doty from 2015 bragging about the murder to a jailhouse informant, who was secretly wearing a wire. In the recording, Boone-Doty can be heard rehashing how he lured Tyshawn into the alley and laughing about how he shot the boy.", "description": "A jury found gang member Drwight Boone-Doty guilty Thursday in the murder of Tyshawn Lee, a 9-year-old boy was shot and killed.", "authors": ["Grace Hauck", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/nxvCPLMze322wLXRykxYtA--~B/aD00MDY4O3c9MzQ4OTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/31862c1e2d2c2d7c225760937a4191b2", "published_at": "2019-10-04"}