{"pub": "vice", "url": "https://vice.com/en_us/article/43k55w/the-most-important-right-to-repair-hearing-yet-is-on-monday", "downloaded_at": "2019-10-19 10:54:00.638964+00:00", "title": "The Most Important Right-to-Repair Hearing Yet Is on Monday", "language": "en", "text": "On Monday, the right-to-repair movement will have its best chance at advancing legislation that would make it easier to repair your gadgets.\n\nThe Massachusetts state legislature is holding a three-hour hearing on the Digital Right to Repair act, a bill that would require electronics manufacturers to sell repair parts and tools, make repair guides available, and would prevent them from using software to artificially prevent repair.\n\nSo far this year, 19 other states have considered similar legislation. It hasn’t passed in any of them. But Massachusetts is one of the most likely states to pass the legislation, for a few different reasons. Most notably, the legislation is modeled on a law passed unanimously in Massachusetts in 2012 that won independent auto shops the right to repair, meaning lawmakers there are familiar with the legislation and the benefits that it has had for auto repair shops not just in Massachusetts but around the country.\n\nCrucially, important legislative hurdles have already been cleared in the state: Both the House and Senate bills are identical and has broad support from both Democrats and Republicans in the legislature. The hearing is going to be held in the Gardner Auditorium, which holds 600 people, making this the largest and highest-profile hearing on the topic in any state thus far.\n\n“Definitely the most visible attention we've had yet from legislators,” Gay Gordon-Byrne, the executive director of Repair.org, which has been pushing the bill around the country, told Motherboard. “Both the House and Senate bills match and are very well supported by cosponsors. 76 cosponsors in the House and 27 in the Senate.”\n\nGordon-Byrne and other supporters, such as iFixit, are hoping that people who are interested in the legislation will show up to demonstrate that big tech’s anti-repair actions have affected both small businesses and ordinary consumers.\n\n“Anyone who supports the issue, anyone who is willing to give a personal testimony that could relate to this, we want them to show up,” Kay-Kay Clapp, the global director of communications at iFixit, said. “We’re on the big stage so we want to show up a lot of people and give support to this.”\n\nIt's a particularly crucial time for the right-to-repair movement. The Federal Trade Commission has begun studying the issue, and Democratic presidential frontrunners Elizabeth Warren and Bernie Sanders have both called for national right-to-repair legislation. That legislation may end up being unnecessary if Massachusetts (or any other state) passes a law first. In 2014, after Massachusetts passed the auto right to repair law, manufacturers signed a memorandum of understanding stating that they would honor the law nationwide, rather than contend with different rules in different states.\n\niFixit has set up an Eventbrite page with more information about the hearing for people who'd like to attend.", "description": "Massachusetts is vying to become the first state to protect consumers' right to repair their electronics.", "authors": [], "top_image": "https://video-images.vice.com/articles/5daa1b1ffbf646000a37ff9f/lede/1571429689791-GettyImages-994246100.jpeg?crop=1xw:0.8419xh;0xw,0.03xh&resize=1200:*", "published_at": "2019-10-18"}