{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/29/joe-maddon-wont-return-cubs-manager", "downloaded_at": "2019-09-29 23:32:47.775982+00:00", "title": "Joe Maddon won't return as Cubs manager", "language": "en", "text": "From the moment Joe Maddon joined the Chicago Cubs, taking the reins in a Wrigleyville bar five years ago, he talked about winning.\n\nHe was the right manager at the right time for a franchise that had experienced mostly terrible timing for more than a century. Right until Maddon’s time in Chicago ran out.\n\nThe Cubs will have a new manager next season after Maddon and president of baseball operations Theo Epstein announced Sunday it was time for a change after three years of declining results that culminated in the team missing the playoffs for the first time since 2014.\n\nMaddon and Epstein met after Saturday’s 8-6 victory at St. Louis, and then shared their plans before Sunday’s finale against the Cardinals. Maddon’s contract expires after the game.\n\nThe change in the dugout begins what could be an active offseason for the Cubs, and the 65-year-old Maddon once again becomes one of baseball’s top free agents.\n\nWhile Maddon is out after five seasons, he is tied to Chicago forever after managing the Cubs to the 2016 World Series title for the franchise’s first championship in 108 years.\n\nChicago also made it to the NL Championship Series in 2015 and 2017, but it lost in the wild-card round last October and tumbled out of the playoff race altogether this year. Weighed down by a puzzling discrepancy between their 51 wins at Wrigley Field and 33 victories on the road before the finale, the Cubs finished third in the NL Central.\n\n“You look at the home and road splits and what we’ve done on the road … I mean these are like some really crazy, hard-to-wrap-your-mind-around things,” Maddon said in September. “I don’t know if somebody’s going to dig deeply enough to really figure it out, but it’s really, just to have your mind try to extrapolate what is going on here, it’s hard to pinpoint anything.”\n\nThe Cubs were in position to make the playoffs for much of this season. They had a half-game lead in the NL Central on Aug. 22. They had control of an NL wild card into September.\n\nBut a nine-game slide, including five consecutive one-run losses for the first time since 1915, wiped out their postseason chances and sealed Maddon’s fate.\n\n“We just weren’t able to get over the hump,” he said.\n\nPer the Cubs‘ request, Maddon employed a more hands-on approach this year, especially on the hitting side, but the lineup was still plagued by inconsistency. There also were surprising fielding and baserunning issues given the Cubs‘ strength in those areas since Maddon took over.\n\nWith Maddon gone, the focus turns to Epstein, and the club’s continued inability to develop pitching help for the major league roster. Yu Darvish rediscovered his form after it looked as if the Japanese right-hander might have trouble living up to his $126 million, six-year contract, but reliever Brandon Morrow’s $21 million, two-year deal was a costly mistake.\n\nEven with the disappointing finish each of the past two years, Maddon likely will have plenty of suitors. And there will be a ton of interest in the Cubs‘ job.\n\nThe last time Maddon was available, Epstein fired Rick Renteria after just one year to create an opening in Chicago.\n\nMaddon’s arrival in November 2014 coincided with the ascent of an impressive wave of prospects. A month after Maddon signed on, Jon Lester joined the Cubs in free agency, and the team took off from there.\n\nChicago won 103 games on its way to the NL Central title three years ago. After eliminating San Francisco and the Los Angeles Dodgers in the playoffs, the Cubs stopped their historic championship drought by beating the Cleveland Indians in a memorable Game 7 in the World Series.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "From the moment Joe Maddon joined the Chicago Cubs, taking the reins in a Wrigleyville bar five years ago, he talked about winning.", "authors": ["The Washington Times Http", "Jay Cohen"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/25/Cubs_Pirates_Baseball_32535.jpg-8c140_c0-229-5472-3419_s1770x1032.jpg?6f9ce78ee1a3a25672569ab4bf84dc3559d8855e", "published_at": "2019-09-29"}