{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7555849/Fascinating-photographs-reveal-rare-glimpse-ancient-mahu-community.html", "downloaded_at": "2019-10-10 00:12:43.781799+00:00", "title": "Fascinating photographs reveal a rare glimpse into the ancient 'mahu' community", "language": "en", "text": "Advertisement\n\nFascinating and vibrant portraits of the 'mahu' on the Polynesian island of Tahiti offer a rare glimpse into the ancient spiritual community who identify as neither male nor female.\n\nThe extraordinary series of photographs showcase the island's 'third gender' painted in bright colours and adorned in flower garlands and shells as they pose on idyllic beaches against a backdrop of the South Pacific Ocean.\n\nThe images, captured by Swiss-Guinean photographer Namsa Leuba - for her new exhibition 'Illusions: The Myth of the 'Vahine' through Gender Dysphoria' - offer an intimate portrayal of the fascinating culture who exist outwith the male-female divide.\n\nIn Tahiti, 'mahu' are born biologically male but family and friends believe they do not conform to traditional gender roles from an early age.\n\nFascinating and vibrant portraits of the 'mahu' on the Polynesian island of Tahiti offer a rare glimpse into the ancient spiritual community who identify as neither male nor female\n\nThe group play key spiritual roles in the community, as guardians of rituals, dance and also to provide care for children and the elderly.\n\n'Mahu have this other sense that men or women don't have,' Ms Leuba, who immerses herself in the culture for six months a year, told CNN. 'It is well known in (French Polynesia) that they have something special.'\n\nThe photographer - who met most of her subjects as strangers on the street - interviews them for hours before taking their picture in order to gain their trust.\n\n'Sometimes I would hear some really (tough) stuff that has happened to them, and it was totally not sexy or glamorous. It was difficult. And others were well-accepted by their family and their community,' Ms Leuba told the publication.\n\nHer series of photographs also include people who identify as 'rae-rae' - transgender women who often pursue gender reassignment surgery unlike mahu.\n\n'For me, it was very important to see (the subject's) beauty and the power -- in my pictures, it's very strong look, a strong posture -- and to (allow them to) make themselves beautiful,' she said.\n\nThe extraordinary series of photographs showcase the island's 'third gender' painted in bright colours and adorned in flower garlands and shells as they pose on idyllic beaches against a backdrop of the South Pacific Ocean\n\nThe images, captured by Swiss-Guinean photographer Namsa Leuba - for her new exhibition 'Illusions: The Myth of the 'Vahine' through Gender Dysphoria' - offer an intimate portrayal of the fascinating culture who exist outwith the male-female divide\n\nIn Tahiti, 'mahu' are born biologically male but are recognised by family and friends as not conforming to traditional gender roles from an early age\n\nThe group play key spiritual roles in the community, as guardians of rituals, dance and also to provide care for children and the elderly\n\nThe photographer - who met most of her subjects as strangers on the street - interviews them for hours before taking their picture in order to gain their trust", "description": "The extraordinary series of photographs showcase the island's 'third gender' painted in bright colours and adorned in flower garlands as they pose against a backdrop of the South Pacific Ocean.", "authors": ["Sophie Law For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/20/19508142-0-image-a-21_1570651014642.jpg", "published_at": "2019-10-09"}