{"pub": "investing.com", "url": "https://uk.investing.com/news/stock-market-news/delta-buys-19-billion-latam-stake-snatching-partner-away-from-american-airlines-1971208", "downloaded_at": "2019-09-27 02:45:16.110235+00:00", "title": "Delta buys $1.9 billion LATAM stake, snatching partner away from American Airlines", "language": "en", "text": "By Tracy Rucinski\n\nCHICAGO (Reuters) - Delta Air Lines (N: ) said on Thursday it would buy a 20% stake in LATAM Airlines Group (SN: ) for $1.9 billion, (£1.5 billion) creating a major new airline partnership and ending the Chilean carrier's ties with American Airlines.\n\nThe surprise deal with Latin America's largest carrier will give Delta a much bigger footprint in the region, a key growth market in which LATAM flies to dozens of destinations including cities in Argentina, Peru and Brazil.\n\nThe LATAM deal is Delta's largest since it merged with Northwest Airlines a decade ago.\n\nAmerican Airlines Group Inc (O: ), which has long been the leading U.S. carrier in the region and was pursuing a deeper route alliance with LATAM, said the loss of its Chilean partner would not have a significant impact on its financial results.\n\nAmerican added that its LATAM partnership had limited upside after the Chilean Supreme Court struck down the two carriers' plans for further route cooperation that would have also involved oneworld alliance members British Airways and Iberia.\n\n\"This is a body blow for American, but not a lethal body blow. It means that Delta will have more access to Latin America than it did before, but American already has much of that in its back pocket,\" independent aviation analyst Mike Boyd said.\n\nFollowing its tie-up with Delta, LATAM will exit oneworld and pursue route options with Delta and its partner Grupo Aeromexico (MX: ), which belong to the rival SkyTeam alliance. It has not, however, decided whether to officially join SkyTeam.\n\nOneworld said LATAM had advised it would leave the alliance in \"due course\" in line with contractual requirements, without naming a specific date.\n\nAirlines increasingly have bilateral codeshare arrangements outside major alliances. Qantas Airways Ltd (AX: ), a oneworld member, said it would retain its codeshare partnership with LATAM despite the Chilean carrier's departure from the alliance.\n\nDELTA PARTNERSHIP\n\nAs a result of the deal, Delta will sell its stake in Brazil's largest airline Gol (SA: ), a LATAM rival.\n\nDelta does not expect regulatory obstacles for its tie-up with LATAM, where it will gain representation on the board of directors. The plan envisions growth for both carriers, which currently overlap on only one route, Chief Executive Ed Bastian told Reuters.\n\n\"I think it's a great fit,\" he said.\n\nAtlanta-based Delta expects the LATAM deal to be accretive to earnings per share over the next two years and add $1 billion in revenue growth over five years, Bastian said.\n\nDelta is using newly issued debt and available cash for the deal. It will also provide LATAM with an additional $350 million to help it transition out of oneworld and plug into Delta's network.\n\nThe two can start code-sharing before they receive government, regulatory and anti-trust approval for the larger tie-up, a process Bastian said he expects to take between 12 and 24 months.\n\nDelta will also acquire four A350 aircraft from LATAM and assume LATAM's commitment to purchase another 10 A350s to be delivered between 2020 and 2025 for an undisclosed sum.\n\nApart from its stake in Grupo Aeromexico, Delta also has holdings in Air France KLM (PA: ), China Eastern (SS: ), Virgin Atlantic and Korean Air Lines Co's (KS: ) parent company.\n\nIt has also been negotiating a 10% stake in Alitalia as part of its strategy to boost its international presence through equity investments. That plan has not changed with the LATAM deal, which Delta started studying about three months ago after an approach by a third party, Bastian said.\n\nDelta has seen its shares and earnings outpace U.S. rivals this year. Its stock closed 0.8% higher before the announcement.", "description": "Delta buys $1.9 billion LATAM stake, snatching partner away from American Airlines", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8Q06E_L.jpg", "published_at": "2019-09-27"}