{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/4/leading-man-qb-baker-mayfield-brings-hope-hype-to-", "downloaded_at": "2019-09-04 08:06:34.109278+00:00", "published_at": "2019-09-04", "title": "Leading man: QB Baker Mayfield brings hope, hype to Browns", "language": "en", "text": "CLEVELAND (AP) - The service elevator door slides open and Baker Mayfield politely waits for his wife, Emily, to exit and then follows her down a hallway into the downtown hotel’s restaurant.\n\nBefore beginning a photo shoot for a recently signed endorsement deal, the Browns’ swaggering, second-year quarterback looks out the giant floor-to-ceiling windows 32 stories above Cleveland.\n\nOn this clear August afternoon, sailboats slice across Lake Erie’s blue-green waters just beyond the Rock & Roll Hall of Fame, while sun bathers dot the grassy mall where LeBron James and the Cavaliers paraded following their NBA championship three years ago. A few blocks south, just past construction cranes symbolizing the city’s rise, the Indians push toward a possible playoff spot in the early innings of a day/night doubleheader.\n\nAs Mayfield looks toward FirstEnergy Stadium, home of the Browns, the empty orange seats seem to glow.\n\n“Awesome view,” Mayfield says.\n\nClearly, he’s on top of Cleveland.\n\nOnly 13 starts into his career, Mayfield, whose selection as the No. 1 overall pick in 2018 drew a mixed reaction here and around the league, has Cleveland’s football pulse racing. Around here, the Browns, so bad for so long, are back.\n\nSometimes arrogant, always assured, the 24-year-old quarterback is being hailed as the franchise’s savior, the one to finally lead the Browns from the gutter to glory.\n\nIn whirlwind fashion, Mayfield has captured Cleveland’s heart: “Baker 2:16” T-shirts are for sale around town, and there’s no shortage of No. 6 jerseys or headbands like the one he wears under his orange, logo-less helmet.\n\nFrom the moment he came off the bench in Week 3 and led a comeback win over the New York Jets, ending Cleveland’s 19-game winless streak, Mayfield has felt at home. The kid from Texas with the Texas-sized chip on his shoulder believes his passion meshes perfectly in a city where football’s more than a game.\n\n“There are characteristics and values that I have that go hand in hand with what the people of Cleveland have,” Mayfield tells The Associated Press. “I think all natural relationships happen very quickly because it’s meant to be, and I think this is one of those things where it was just meant to be. I relate to the people here on a lot of facets: the blue-collar work ethic mentality and just embracing it.\n\n“People here want their football team to be great and it’s a football town, and I want my team to be great.”\n\nHe’s already given glimpses of potential greatness.\n\nLast season, Mayfield broke Peyton Manning’s rookie record with 27 touchdown passes in just 14 games. He did it with pinpoint accuracy and a fearless style that included trash-talking opponents; giving a cold shoulder to former Browns coach Hue Jackson; and following a three-TD performance by saying, “I woke up feeling real dangerous,” a catch phrase that’s now part of the local lexicon.\n\nMayfield further endeared himself to Cleveland fans this summer by biting into a beer can and chugging the contents while being shown on the scoreboard at an Indians game.\n\n“Yeah, first time,” Mayfield says chuckling about his now-famous guzzle.\n\nSome of his actions have not played well outside of the area, but the same also could have been said for Tom Brady, Brett Favre and Jim McMahon.\n\nBecause of Mayfield, and a roster injected with new talented players including star receiver Odell Beckham Jr., the Browns are viewed as legitimate contenders this season. That may seem a little farfetched, a lot premature. But the Browns, who went 0-16 two years ago and have been a disgrace for much of their expansion era, are the league’s trendy pick in the AFC North, at least.\n\nThe young quarterback is unfazed by the hype.\n\n“I was made to be able to kind of handle these types of situations,” he said. “What a difference a year makes, huh? From not getting reps with the ones (starters) at training camp to being the guy here and just being comfortable in it. It doesn’t surprise me, because I just go with the flow, take the punches and run with it and really just take it one day at a time.\n\n“It could become overwhelming if you look at everything on the outside or worry too much. Take it a day at a time, and I’m living out a dream.”\n\nThere is immediate pressure to win. That weight will fall on Mayfield and Freddie Kitchens, who started last season as Cleveland’s running backs coach before an eight-game stint as offensive coordinator convinced general John Dorsey and owners Dee and Jimmy Haslam to make him the team’s sixth coach in 10 years.\n\nLike his quarterback, Kitchens, who played the positon at Alabama, doesn’t mince words with his southern drawl. He’s loyal, direct, unabashed.\n\n“He is who he is. He doesn’t care what anybody thinks,” Mayfield said. “He holds nothing back, but that’s the best part about it. … He’s never going to lie to you. He’s going to set you straight and tell you the truth - whether you like it or not.”\n\nMayfield’s summer was smooth - mostly. He got married in July. Cleveland’s training camp was drama free, save for Beckham sitting out all four preseason games, and Mayfield making headlines for an interview in which he questioned the New York Giants’ decision to select quarterback Daniel Jones in the draft’s first round.\n\nMayfield’s comments weren’t out of character, but seemed unnecessary, and he contacted Jones to clear the air. But the remarks fueled outside opinions of Mayfield, who has been labeled bratty, obnoxious, childish.\n\nMayfield knows he has haters, but he thinks their dislike is unjustified.\n\n“I wouldn’t say that there’s a misconception or that I’m misunderstood,” he said. “I think it’s more of a getting to know me and who I am. I’m very blunt, very honest. And if I feel a certain way, most people know it. You can have a first impression, but until you really come to talk to me, you really don’t know me.\n\n“Everybody is guilty of it at some point.”\n\nMayfield chooses his words carefully when discussing how far the Browns will go in 2019. Nothing is given, injuries could derail plans, and Mayfield knows he’ll get everyone’s best shot.\n\nBut the talent is undeniable, and if things go just right, Cleveland, once a pro football dynasty, could be back in the conversation in January.\n\n“You look at the difference in the roster,” Mayfield said. “We’ve got guys who have been in winning situations or they really, truly want to win. That’s why they’re here.”\n\nIt’s in the distance, but he can almost see Cleveland’s celebration.\n\n“Mentally, I have a picture prepared,” he said. “But I think this town doesn’t even know what it’s going to be like, and that’s the best part. It’s going to be unbelievable. That’s the goal.”\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The service elevator door slides open and Baker Mayfield politely waits for his wife, Emily, to exit and then follows her down a hallway into the downtown hotel's restaurant.", "authors": ["The Washington Times Http", "Tom Withers"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/04/browns_mayfield_vision_football_85676_c0-140-3354-2095_s1770x1032.jpg?c236d573bb26512ce238ea0ebedcf34fa95bf36c"}