{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-thyssenkrupp-cuts/new-thyssenkrupp-ceo-prepares-ground-for-major-job-cuts-idUKKBN1WO0NU", "downloaded_at": "2019-10-09 12:44:15.005230+00:00", "title": "New Thyssenkrupp CEO prepares ground for major job cuts", "language": "en", "text": "DUESSELDORF, Germany (Reuters) - New Thyssenkrupp (TKAG.DE) chief executive Martina Merz on Wednesday paved the way for deeper job cuts at the ailing conglomerate, telling employees in an internal memo such a step was necessary for a much-needed turnaround.\n\nFILE PHOTO: Martina Merz, supervisory board chairwoman of German steelmaker ThyssenKrupp AG, who is set to replace outgoing CEO Guido Kerkhoff on an interim bases is pictured at the company's annual shareholders meeting 2019 in Bochum, Germany February 1, 2019. REUTERS/Wolfgang Rattay/File Photo\n\nThrown into crisis by a chain of events that started with activist fund Elliott [ECAL.UL] taking a stake last year, Thyssenkrupp is desperately trying to improve its operating performance and simplify its overly complex structure.\n\nTo do that, it is planning to list or sell its elevator division and is willing to sell majority stakes in its struggling car parts and plant engineering divisions, which Merz said are facing significant changes.\n\n“It is true that this will not be possible without significant job cuts,” Merz said in the memo seen by Reuters. “This is about strengthening businesses and improving performance. This is not a sellout.”\n\nHer remarks come about a week after she dropped her chairman mandate and took over as CEO, replacing Guido Kerkhoff, whose efforts to implement the turnaround were seen as too slow and lacking determination.\n\nThyssenkrupp previously said it would cut 6,000 of the group’s 162,000 jobs, a step seen by sources familiar with the matter as insufficient to improve the group’s cost structure. Deutsche Bank (DBKGn.DE), for example, has announced 18,000 cuts, out of a total of 92,000 jobs.\n\nMerz said she would give a general update on the group’s new organizational structure at the end of November and that employees would have clarity in early 2020. “We will do this in a fair and transparent way,” she said.\n\nMerz said some of Thyssenkrupp’s business areas would shed organizational layers, which has led to the resignation of Marcel Fasswald, head of Thyssenkrupp’s Industrial Solutions division, which will be renamed Plant Technology.\n\nAs part of the revamp, the company’s Components Technology division, which builds car parts and has faced margin pressure due to a global downturn in the industry, will be renamed Automotive Technology.\n\nMerz remained tight-lipped on the ongoing auction process for Thyssenkrupp’s elevator division, only confirming that preparations for a listing were ongoing while offers made by potential bidders were being examined.\n\nSources told Reuters a day earlier that Thyssenkrupp was planning to give potential bidders access to the data room of its elevator division in the coming days.", "description": "New Thyssenkrupp chief executive Martina Merz on Wednesday paved the way for deeper job cuts at the ailing conglomerate, telling employees in an internal memo such a step was necessary for a much-needed turnaround.", "authors": ["Tom Käckenhoff", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191009&t=2&i=1438746003&w=1200&r=LYNXMPEF980GZ", "published_at": "2019-10-09"}