{"pub": "cbc", "title": "", "url": "https://cbc.ca/books/the-places-it-ll-go-dr-seuss-exhibition-opening-in-toronto-1.5264602", "language": "en", "published_at": "2019-08-29", "downloaded_at": "2019-09-02 07:07:22.558969+00:00", "text": "Dr. Seuss is hitting the road this fall, starting with a stop in Toronto at Square One Shopping Centre, with a large interactive exhibit that will immerse visitors in some of the most iconic books by the beloved children's writer.\n\nThe exhibit is centred on a maze based on Oh, the Places You'll Go, the Dr. Seuss book that urges children to explore the world and move mountains despite the pitfalls and challenges. Children and adults will be able to explore rooms based on The Cat in the Hat, The Lorax, Did I Ever Tell You How Lucky You Are? and other works.\n\n\n\nThe 1,400-square-metre exhibition announced publicly Wednesday is scheduled to open in Toronto in October. There are plans to take it to Boston, Seattle, Houston and several other North American cities.\n\n\n\n\"I wanted to explore the books and bring the characters to life in a new and engaging way,\" said Susan Brandt, president of San Diego-based Dr. Seuss Enterprises, the company founded by Audrey Geisel, the late widow of Theodor Seuss Geisel, who under the pen name Dr. Seuss wrote and illustrated dozens of children's books.\n\nBecause the exhibit is based on Geisel's children's books, there are no references to his earlier and more controversial political cartoons.\n\nThe maze inspired by Oh, the Places You'll Go features thousands of suspended balloons.\n\nVisitors entering The Lorax room can wander through a forest of truffula trees. The If I Ran the Circus room features a working carousel, while Horton Hears a Who! consists of a field of waist-high pink clover.\n\nWith files from CBC Books.", "description": "A large interactive exhibit inspired by Dr. Seuss's children's books will be touring North America this fall.", "authors": [], "top_image": "https://i.cbc.ca/1.5264642.1567105129!/fileImage/httpImage/image.png_gen/derivatives/16x9_620/dr-seuss-exhibit-2019.png"}