{"pub": "washingtonpost", "url": "https://washingtonpost.com/climate-environment/2019/10/25/americans-would-rather-reduce-oil-gas-exploration-than-drill-baby-drill", "downloaded_at": "2019-10-25 16:19:11.897158+00:00", "title": "Americans would rather reduce oil and gas exploration than ‘drill, baby, drill’", "language": "en", "text": "Just over half, 51 percent, said energy exploration should be reduced on federal lands, and 53 percent said it should be reduced offshore. Another 32 percent said it should stay as is on both federal lands and waters.\n\nLess than 15 percent support an increase in drilling on public lands or at sea.\n\nThe poll comes as the Trump administration is issuing hundreds of new permits to explore for fossil fuels on taxpayer-owned land, particularly in the West. The administration is also considering a plan that would open 95 percent of the outer continental shelf to leasing and potentially to drilling, making it the largest proposed expansion in U.S. history.\n\nAD\n\nAD\n\n“My personal feeling is we do not hold businesses responsible when spills occur and other things happen,” said Brian Nichols, a 51-year-old Republican in New Mexico who said drilling should decrease. “Until businesses stand up and be responsible for things they do to the land, we should not allow them to drill.”\n\nNichols said his view was influenced by the BP Deepwater Horizon oil spill in 2010, when some 168 million gallons poured into the Gulf of Mexico, soiling the seafood fisheries in Louisiana and Mississippi.\n\nThe poll also comes amid bids by two leading Democratic presidential candidates to woo voters by targeting drilling as part of their climate change policies.\n\nAD\n\n“On my first day as president, I will sign an executive order that puts a total moratorium on all new fossil fuel leases for drilling offshore and on public lands,” Sen. Elizabeth Warren (D-Mass.) tweeted last month. “And I will ban fracking — everywhere.”\n\nAD\n\nA ban on fracking would affect private lands and scale back the power of state governments to issue or refuse to grant permits.\n\nSen. Bernie Sanders (I-Vt.) said the nation should “leave fossil fuels in the ground” and he vowed to end new and current drilling on land. In a campaign document released in August titled “The Green New Deal,” Sanders said his administration would not grant new offshore leasing permits to oil companies, and he would require companies operating offshore to fix oil and greenhouse gas leaks in pipelines and other infrastructure.\n\nAD\n\nTrump said more energy exploration and drilling will make the United States less reliant on imports from the Middle East and other oil-producing nations. But for now, much of the Trump administration’s ambition to expand drilling is on hold because of court challenges.\n\nAD\n\nA federal judge blocked drilling in Wyoming earlier this year, ruling that the administration failed to show whether the practice would worsen climate change.\n\nThe administration’s proposal to expand offshore drilling in the Atlantic and Pacific oceans has come under bipartisan opposition by the governors of nearly every state that would be affected. Federal government approval of several permits to search for oil deposits in the Atlantic using seismic mapping was legally challenged by environmentalists and state attorneys and is mired in a federal court in South Carolina.\n\nAD\n\nThe Post-KFF poll follows findings of earlier surveys that show support for oil and gas drilling waning over the past decade. In 2008, 75 percent of adults favored an expansion of offshore drilling, according to a survey by Yale and George Mason universities. That was the year then-vice presidential nominee Sarah Palin rallied the Republican convention with chants of “drill, baby, drill.”\n\nAD\n\nBut after the BP oil spill, support for offshore drilling started to drop. As oil poured from the site that June, support slid to 62 percent. Six years later in March, shortly before Trump was elected, 58 percent of registered voters supported expanded drilling, and this spring it sank to 53 percent. While Yale-GMU surveys asked whether adults supported or opposed expanded drilling off the U.S. coast, the Post-KFF survey asked whether drilling should be increased, decreased or left as it is.\n\n“I live in the Florida Panhandle. I see what happens to the animals when we mess with the environment like that,” said Bernadette Kyle, a 44-year-old educator. “We were directly affected by the BP oil. It was so sad. We had a lot of students volunteer to clean the birds. I don’t think it’s worth the gamble.”\n\nAD\n\nKyle, a Democrat, lamented that “seafood during that time was ruined” and that “there was a sheen on the ocean” in Gulfport, Miss., when she and her husband visited during the spill. “It wasn’t even safe to go in the water at that time,” she said.\n\nAD\n\nDuring his first months in office, Trump vowed to expand offshore and onshore drilling to achieve “American energy dominance” to end the country’s reliance on oil imports. His administration stripped away regulations that barred drilling on federal land in the West and lowered safety rules on oil platforms operating in the Gulf.\n\nThe president sought to expand drilling to the Arctic National Wildlife Refuge, a pristine area in Alaska that had been off-limits. On the Eastern Seaboard, Trump’s expansion plan included the coasts of every state, from Maine to Florida.\n\nAD\n\nWhile the governors of Alaska and Maine supported the offshore plan, governors south of Maine, along with their congressional delegations, mobilized against it.\n\nLawmakers in New Jersey, New York and Delaware passed bipartisan legislation banning the construction of pipes and other equipment needed to convey oil to shore in a bid to thwart Trump’s ambitions.\n\nAD\n\nThe Post-KFF poll, however, reflected a wide partisan divide. Democrats drove support for decreasing drilling on public lands; 69 percent said it should be scaled back. Nearly three-quarters of Democrats favor a decrease in offshore drilling. Among Republicans, however, just 20 percent favored a drilling rollback onshore and 26 percent offshore.\n\nAD\n\nRepublicans were far more likely to favor the current level of drilling without any expansion. A narrow 51 percent majority said it should stay as it is onshore and 45 percent said the same about offshore drilling.\n\nIndependents also favored a reduction in onshore drilling, but by a smaller margin, 56 percent, than among Democrats. A similar 52 percent preferred an offshore decrease.\n\nIn St. Petersburg, Fla., Philip Steers, 70, enthusiastically supports an offshore drilling expansion — even in his state, where government officials are united in opposition.\n\nAD\n\n“It’s just a critical product that you have to have in the United States,” said Steers, a Republican retiree who worked for Saudi Aramco, the Saudi state-owned oil company. “I know people worry about destroying the [beach] view; that’s not true. It creates jobs and provides valuable resources that are needed. It’s a myth some people think oil destroys the environment.”\n\nAD\n\nAs far as Steers is concerned, the BP spill was an anomaly. “Oil companies want to make money,” he said. “They don’t want to lose their oil. We would spend a lot on safety. There are too many hazardous things that can happen, so you have to be careful.”\n\nHazardous things happen far more often than most Americans realize. In the gulf, the nation’s largest and most productive offshore oil region, an average of 20 uncontrolled releases of oil — or blowouts — for every 1,000 wells takes place in state and federal waters each year. A fire erupts offshore every three days, on average, and hundreds of workers are injured annually.\n\nAD\n\nOne of those is the Taylor Energy spill, which took place after a hurricane in 2004. The site off Louisiana has released oil for 15 years, and the spill is only beginning to be controlled. A containment system had recovered 63,000 gallons of oil as of July, but some estimates of the amount spilled since the beginning — as high as 3.5 million barrels, or 147 million gallons — dwarf that number.\n\nThough the Post-KFF poll showed opposition to expanded drilling, other parts of the poll showed that most people are reluctant to pay significantly higher energy costs to rein in climate change.\n\nGail Adams, spokeswoman of the International Association of Geophysical Contractors, one part of the oil industry, said “just as there are Americans who support limiting natural gas and oil development, there are also many Americans who are not willing to pay increased energy costs that will result from this myopic view.”\n\nThe Post-KFF survey was conducted online and by telephone from July 9 to Aug. 5, among a national sample of 2,293 adults through AmeriSpeak, a survey panel recruited through random selection of U.S. households by NORC at the University of Chicago. Questions on fossil fuel extraction were asked of subsamples of 1,104-1,189 adults and have a margin of error of plus or minus four percentage points.", "description": "A new poll finds a clear majority of Americans says oil and natural gas drilling should be curtailed or maintained at current level. But opinions were divided along partisan lines.", "authors": ["Darryl Fears", "Reporter Focusing On The Chesapeake Bay", "Issues Affecting Wildlife", "Scott Clement", "Polling Director"], "top_image": "https://www.washingtonpost.com/resizer/dLoufbfjflg2NMrTmzFohQapWQs=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/NGSMVBTNSMI6TO7HDR4Y7OAFGY.jpg", "published_at": "2019-10-25"}