{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/england-fans-back-three-lions-20572344", "downloaded_at": "2019-10-13 18:44:26.878722+00:00", "title": "England fans back Three Lions stars stance of walking off if racially abused in Bulgaria", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nEngland fans have vowed to stand by their heroes - even if they walk off the pitch against Bulgaria.\n\nAround 3,400 are expected in Sofia for our Euro 2020 qualifier, with the team warning that they are ready to leave the field of play if they are racially abused.\n\nThree Lions supporters have vowed to stick by them whether they play on, or protest by abandoning the game.\n\nIt would be the first time that an England team has taken such an extreme measure.\n\nBut accountant Brad Morris, 22, of Blackburn, in Prague to see our 2-1 defeat by the Czech Republic, said: \"If you were black, you would feel completely differently.\n\n(Image: PA)\n\n\"It is up to them to choose. Nobody can really understand how that must make you feel when you are targeted - unless you have been through it yourself.\"\n\nHis friend Nathan Jones, an NHS worker, agreed with Raheem Sterling's stance that the best way to hit back at bigots is to stay on the pitch and win.\n\n(Image: Getty Images)\n\n\"There will always be punishment from authorities,\" he added. \"For some fans it may be a once in a lifetime trip abroad to see them; as much as I think you need to take action, you have to think of the fans too.\"\n\nAnother of the seven-strong group, Ryan Duncan, 22, who works for a tool hire firm, added: \"Staying on the field and winning when they abuse you is better than walking off.\"\n\nAround 2,200 Three Lions fans are making the trip from Prague to Sofia for the game. It will be played with 5,000 seats empty as punishment after racist chants during Bulgaria games against Kosovo and the Czech Republic in June.\n\nTammy Abraham, the Chelsea striker, had said that England are ready to walk off.\n\n(Image: Action Images via Reuters)\n\nGareth Southgate plans to follow the UEFA three-step protocol, which gives officials the power to ask for announcements warning that the game will be suspended and then abandoned if abuse is not halted.\n\n\"We had a meeting at the start of the week about things that could happen but that may not happen,\" said Southgate on Sunday. \"There is a (three-step) protocol in place that UEFA have set. Hopefully we don't have to cross that bridge.\"\n\nMan City's Raheem Sterling called on football's authorities to crack down on racism after England stars were abused in their match against Montenegro in March.\n\nHe said that the players would trust in the system. \"At this moment, yes, I have full faith in UEFA,\" he added.\n\nAshley Young, Theo Walcott and Ashley Cole were all subjected to monkey chants when we last played in Bulgaria in 2011. The Bulgarian FA were fined 40,000 Euros.\n\n(Image: PA Archive/PA Images)\n\nBut the problem persists with club side Levski Sofia fined after last year's Bulgarian Cup final, when one young fan appeared with a swastika painted on his bare chest alongside another performing a Nazi salute.\n\nFears our players will be abused were described as \"groundless, inappropriate and unnecessary\" by the Bulgarian FA.\n\nEngland need to win to qualify for the finals, and hope Kosovo fail to beat Montenegro.", "description": "Around 3,400 England fans are expected in Sofia for the Euro 2020 qualifier against Bulgaria on Monday night", "authors": ["Jeremy Armstrong", "Image", "Pa", "Getty Images", "Action Images Via Reuters", "Pa Archive Pa Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20572361.ece/ALTERNATES/s1200/0_Czech-Republic-v-England-UEFA-Euro-2020-Qualifying-Group-A-Sinobo-Stadium.jpg", "published_at": "2019-10-13"}