{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7591805/Kelvin-Fletcher-received-physio-ahead-Strictly-Come-Dancing-performance.html", "downloaded_at": "2019-10-20 03:40:05.374620+00:00", "title": "Kelvin Fletcher received physio ahead of his Strictly Come Dancing performance", "language": "en", "text": "Kelvin Fletcher stripped down to his underpants for physio ahead of his appearance on Strictly Come Dancing on Saturday.\n\nThe former Emmerdale star got fans excited when he revealed his bare legs and pants on his Instagram story just hours before heading to the dance floor.\n\nThe 35-year-old's video showed him lying down in the doctor's surgery wearing only a sweatshirt and his underwear.\n\nRacy: Kelvin Fletcher stripped down to his underpants for physio ahead of his appearance on Strictly Come Dancing on Saturday\n\nA caption read: 'Pre show physio'.\n\nKelvin is partnered with professional dancer Oti Mabuse, 29, and has wowed audiences with his impressive skills.\n\nLast week Kelvin and Oti were hailed as the 'perfect match' as they scored a whopping 36 points out of 40 for their skilled Rumba.\n\nThe duo narrowly missed out on the top spot behind Karim Zeroual and Amy Dowden, who were awarded 38 points for their Tango routine during the fourth edition of the live shows.\n\nRevealing: The former Emmerdale star got fans excited when he revealed his bare legs and pants on his Instagram story just hours before heading to the dance floor\n\nGetting in the preparation: The 35-year-old's video showed him lying down in the doctor's surgery wearing only a sweatshirt and his underwear\n\nKelvin was drafted in to the show as a last-minute replacement for the injured Jamie Laing but has defied all expectations with his skills.\n\nHowever, he is no longer being considered for the upcoming series of Dancing on Ice, according to reports.\n\nA source told MailOnline that the Emmerdale star cannot be considered for the ITV show due to contractual obligations, despite claims he impressed bosses with his dancing skills.\n\nIdeal fit: Last week Kelvin and Oti Mabuse, 29, were hailed as the 'perfect match' as they scored a whopping 36 points out of 40 for their skilled Rumba\n\nA source had earlier told The Sun: 'The door is still being left open for Kelvin to return to DOI.\n\n'He had been agonising for ages whether to take up the Strictly opportunity after being so far in advanced stages of talks with DOI. But they still want him on the show for potentially the series after next.'\n\nKelvin recently revealed he works out at 5am before commencing his 12-hour dance rehearsals in order to maintain his rippling muscular physique.\n\nA secret dancer: Kelvin was drafted in to the show as a last-minute replacement for the injured Jamie Laing but has defied all expectations with his skills\n\nDuring an interview with GQ, Kelvin revealed that his intense 90 minute gym sessions are usually followed by a breakfast of scrambled eggs on toast and yogurt.\n\nKelvin's training with Oti kick-starts at 10am and he will eventually get home at around 10.30pm to have his dinner and head to bed.\n\nOn top of his high calorie intake, the soap star also tries to drink four litres of water a day in order to stay hydrated during the gruelling sessions.", "description": "The 35-year-old's video showed him lying down in the doctor's surgery wearing only a sweatshirt and his underwear.", "authors": ["Harry Howard For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/19/19933338-0-image-a-14_1571508430098.jpg", "published_at": "2019-10-20"}