{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/vinnie-jones-gets-message-support-20734373", "downloaded_at": "2019-10-27 12:12:06.614560+00:00", "title": "Vinnie Jones gets message of support from Charles Bronson after wife’s death", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nVinnie Jones picked up an unusual fan after receiving a message of support from Britain’s most violent prisoner - Charles Bronson.\n\nBronson, 66, reached out to Vinnie following the star’s appearance on Good Morning Britain where he opened up about his wife Tanya’s death.\n\nThe star was left devastated when Tanya tragically passed away in July, days before he was due to audition for X Factor : Celebrity.\n\nVinnie wept during an emotional interview with the Sunday Mirror about the loss of Tanya at just 53.\n\nBronson claimed to have been moved by Vinnie’s words, writing: “Vinnie I seen you on Piers Morgan - absolute unbelievable.\n\n(Image: Tim Merry)\n\n(Image: Sunday Mirror)\n\n“Honestly the way you come across, you’re a proper geezer. It’s tough for you. You’ve lost a bloody diamond of your life.\n\n\"But the way you put it over really touched me mate. I thought f****g brilliant. It (will) get easier with time. No doubt.\n\n\"I was sitting here, I thought blimey, from hod carrier to Hollywood, marrying that beautiful, beautiful lady. You was a good husband. She was a good wife. Be strong mate.\"\n\n(Image: ITV)\n\n(Image: Sunday Mirror)\n\nBronson has also recently experienced tragedy of his own after his wife Paula Williamson was found dead at her Stoke-on-Trent home in July 2019.\n\nThe 38-year-old actress met the infamous criminal in prison in late 2016, and they were married in November 2017.\n\nTheir marriage was yet to be annulled when she died.\n\nBronson also used his video message to wish Vinnie luck ahead of his appearance on X Factor: Celebrity.\n\n(Image: Getty)\n\nIn a video message, Bronson - who allegedly prefers the surname Salvador these days - said: “Respect to you mate; you’re a good man. The best.\n\n\"I say to the lads I don’t think you was ever a great footballer but you was a hard footballer. [sic]\n\n\"And you played with your heart. You put everything into it mate. 'Ere respect to you.\n\n\"Now listen. I’m hoping to get out in a couple of years; I want you to come to my freedom party.\n\n\"Now I know you don’t drink no more, you ain't had a drop for a few years now. [But] you and me mate, we’ll sit in a corner with a pot of tea mate and have a chat. How’s that?\"\n\n(Image: ITV)\n\nVinnie told The Sun on Sunday that receiving the surprise message from Britain’s most notorious convict was “surreal”.\n\nThe 54-year-old added: “\"Let's hope Charlie and his mates have phones on the inside so they can pick up the phone and vote for me!\n\n\"And be careful, judges - I've got friends on the inside...!\"\n\nDo you have a story to sell? Get in touch with us at webcelebs@trinitymirror.com or call us direct 0207 29 33033", "description": "Britain's most violent criminal reached out to the ex-footballer after he opened up about wife Tanya's death and his chances on X Factor: Celebrity", "authors": ["Sofia Petkar", "Image", "Tim Merry", "Sunday Mirror", "Itv", "Getty"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20469421.ece/ALTERNATES/s1200/2_Vinnie-JonesA.jpg", "published_at": "2019-10-27"}