{"pub": "cbc", "url": "https://cbc.ca/life/culture/your-horoscope-for-the-week-ahead-halloween-and-a-new-mercury-retrograde-unearth-deeply-buried-feels-1.5335423", "downloaded_at": "2019-10-28 13:22:47.559365+00:00", "title": "CBC Life", "language": "en", "text": "Get ready to enter another once-in-four-month whirlwind journey through a Mercury retrograde cycle. Mercury, the planet of communication and strategy, comes to a full stop on Thursday and begins a three-week retrograde (backward) cycle until November 20. Mercury, aka Hermes, is a cheeky mythological character with a notorious reputation as a prankster.\n\nThis is a work-in-progress period of time, so it's normally advised to not make final decisions, sign contracts or buy technological equipment. The important thing is to not worry about it. Important information might play a hiding game when Mercury moves through this cycle.\n\nMercury's retrograde journey will be in introspective Scorpio, so financial and relationship issues are likely to be highlighted. This is a time to solve problems and make improvements.\n\nVenus moves into sanguine Sagittarius on Friday, the day after Halloween. That will lift the mood and carve up plenty of smiling pumpkins.\n\nIt's also the time of the Celtic Festival of Samhain which fell on October 31st and November 1st. It marks the midpoint between the Fall Equinox and Winter Solstice. It's a time of lighting fires and illuminating the unconscious realms of our own psyche. Fire was regarded as a divinity. Samhain was seen to be a time of transition, when the boundary between the material world and the spiritual or otherworld grew thin. It was believed that spirits or fairies would enter our world.\n\nListen to the silence. It's a time of healing and the growth of self-understanding. Secrets will be revealed.\n\nHere is your horoscope for the week of Monday, October 28, 2019.\n\nAries\n\nYou've been having qualms about your hopes to live the life you've always dreamed of having. You need to place more trust in your own talents and abilities. Mercury's change of direction this week will give you a little push in the right direction. It will lead to an auspicious upturn in your fortunes. Instead of living your life in a state of self-doubt, you will take action with certainty and clarity. An understanding will be reached that will clear away a complication. Assert yourself boldly where appropriate. You have more power and influence than you know.\n\nTaurus\n\nA big push is coming that will inspire you to undertake a plan or project. The energy backing you is strong. You hold the balance of power in a sensitive situation. It will all work fine as long as you are careful to not get caught up in some convoluted situation. Mercury's change in direction is warning you to give a wide berth to melodramas. You don't want to jeopardize your good luck. All is well as long as you keep your emotions on an even keel. Steer yourself carefully and assert yourself boldly where appropriate. Relax and recognize your skills and make the most of them.\n\nGemini\n\nA litany of ills is causing you to doubt your fortunes. There's a long list of things to object to, feel unnerved by or worry about. Is it possible, though, that you might be overly sensitive to everything? Pay attention to how you feel, but at the same time don't overreact. You'll look back at this at some point in the near future and realize that very little of what's now bothering you is important. Mercury's change in direction will bring an illuminating realization. You'll achieve the peace of mind that comes with knowing that you've made the right choice at a crucial point in your life.\n\nCancer\n\nIf you feel good about your decisions and actions, the right consequences will ensue. In other words, it's not so much what you've done, but your mood that determines results. Smile and destiny will treat you kindly. Mercury's change of direction will teach you to dwell less on upsetting memories and more on recollections that inspire you. You now can start creating the kind of future you've always dreamed of, but never dared hope for. Obstacles you're trying to circumvent can be handily overcome if you can simply trust in your power to put things right.\n\nLeo\n\nFailure often precedes success. In fact, it usually does. Mistakes have been made, but now those errors of judgments are turning into blessings. A new cycle of success is beginning. Confidence, stamina and a thick skin are the essential ingredients to achieving your dreams. The Mercury retrograde will help you understand that you must never give up. Your ability to be flexible and adaptable in the face of challenges is your key to success. So, stay with it, especially now since something you dearly desire is close at hand. You're in a position of distinct advantage.\n\nVirgo\n\nFor quite some time now, you've been carrying the heavy baggage of frustration, disappointment and disillusionment. And let's not forget the biggest culprit of all — guilt. That's a lot to handle. The tide is turning. The stars have begun an inner transformation that's unloading you of all these debilitating emotions. Hope and optimism are on the rise. The liberating power of the sky is purging you of all that is holding you back. There will always be difficulties, but you'll deal with them quickly and efficiently. Move forward knowing that things will work out well. Get ready to laugh like you've never laughed before!\n\nLibra\n\nThere are too many short-sighted individuals who can't see your bold and far-reaching vision. Don't let that hold you back. Be confident of who you are. With all that you're up against, your chances seem slim of ever achieving your hopes and dreams. Yet, quite the reverse is true. The Mercury retrograde will guide you to understanding that all your troubles have surprisingly bestowed a great advantage upon you. All will be revealed if you're positive and determined. The universe works in mysterious ways! The only route for you now is forward with no looking back. Your life is changing for the better.\n\nScorpio\n\nThere's a rush on to make an important decision, but the sky is unequivocal in urging you to pull on the reins and hold your horses. Haste makes waste as they say, so slow the world down and take things at your own comfortable speed. The odds are firmly on your side, so there's no need to let anxiety get the better of you. The Mercury retrograde will help you crystallize an idea and get a clear picture of what you must do. You're in an influential position to make something happen. Where you once felt ineffectual, you're now skilled and proficient in doing the necessary.\n\nSagittarius\n\nLogic has been turned upside down. It seems that someone is defending the indefensible. No matter how set in their ways they've become, you have it in you to alter something significant. Mercury's change in direction will provide you with some valuable information that will make a big difference. Be alert, but at the same time be careful to not jump to impulsive conclusions. There's more to a certain story than you yet know. Thoroughly check all the facts, even ones that might make you cringe. You'll soon have a lot more to go on. Then you'll have a clear picture of what's happening and what you need to do.\n\nCapricorn\n\nIt's exciting to act on an intuitive whim and respond to events with spontaneity. But acting on impulse does come with a high price if we make a bad choice. The Mercury retrograde will compel you to seek advice and plan your strategy. You'll find, though, that what seems like a ludicrous impulse is more than mere caprice. Your heart says there's another way to look at a situation. Pay close attention to your feelings rather than what your head is telling you. Yes, keep them both in balance, but you'll find that the truth, when it comes, will shout out to you loud and clear.\n\nAquarius\n\nYou'll be glad to know that a period of flux that you've been living through won't last forever. You're on your way to achieving a crucial and immensely significant goal. The Mercury retrograde will divert you onto a faster and more direct trajectory to where you need to be. You'll find yourself being decisive about what you will and will not put up with anymore. You'll have to be on your toes, though, because as fast as you think you've got something settled, it changes. Nonetheless, you'll manage to stabilize your place in a chaotic world. Be strong within yourself and everything will turn out perfectly.\n\nPisces\n\nIt's blatantly obvious that you need to devote more time to your own personal needs rather than continually altering your agenda to suit the demands of others. Doing so will bring a long period of emotional deprivation to an end. The Mercury retrograde will lead you into the fathomless depths of your unconscious. Old forgotten memories will bubble up and remind you of your true path to fulfilment. An opportunity will arise, if it hasn't already, to pursue and fulfil a creative talent that was repressed years ago. You're giving shape and form to your ideals. There's so much to look forward to.", "description": "Listen to the silence. It’s a time of healing and the growth of self-understanding.", "authors": [], "top_image": "https://i.cbc.ca/1.5336393.1572040026!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/horoscope-ft-img.jpg", "published_at": "2019-10-28"}