{"pub": "cryptonews", "url": "https://cryptonews.com/exclusives/casa-looks-for-fresh-capital-to-catch-a-bigger-bitcoin-wave-4745.htm", "downloaded_at": "2019-10-05 13:19:23.820453+00:00", "title": "Casa Looks For Fresh Capital to Catch a Bigger Bitcoin Wave", "language": "en", "text": "Jameson Lopp. Source: Cryptonews.com\n\nCasa, the U.S.-based private key security specialist, also known for its plug-and-play Bitcoin and Lightning node, is looking to raise more capital to finance their business growth as the company aims to ride the Bitcoin adoption wave, Chief Technology Officer (CTO) Jameson Lopp told Cryptonews.com.\n\n“We have basically maxed out the size of our engineering team that we can afford to employ. We have a ton of ideas, we want to have a lot more engineers and definitely we are gonna need a lot more capital in order to do that,” he said, adding that the company might “be able to announce something before the end of the year.”\n\nIn the meantime, their strategy is to get more people interested in some of the free or cheaper lower-tier products.\n\n“If we can get them interested in the system and happy with our user interface and general experience, then they’ll probably expand and want to start using other products within the suite. If we put out a lot of products, we get a lot of interest. As Bitcoin continues to expand we just want to ride that wave,” the CTO explained.\n\nAlso, he stressed that today many crypto users may not be willing to invest in their asset security as “they don’t have much to lose.”\n\n“As Bitcoin continues to grow, they will have more to lose, it’ll be riskier and they’ll be willing to basically pay more to insure it,” Lopp said.\n\nTheir core product is the Casa Keymaster, or the multisignature vault, that might cost up to USD 420 per month, depending on the security level.\n\n“We have a decent number of users that are top tier, who pay thousands of dollars a year because they are securing potentially millions of dollars worth of value,” the CTO said, adding that their user base has increased as they’ve introduced some cheaper tiers, including a free one.\n\n______\n\nWatch the whole interview with Jameson Lopp below:", "description": "Casa, the U.S.-based private key security specialist, also known for its plug-and-play Bitcoin and Lightning node, is looking to raise more capital to finance their business growth as the company aims to ride the Bitcoin adoption wave, Chief Technology Officer (CTO) Jameson Lopp told Cryptonews.com.", "authors": ["Eimantas Žemaitis", "Linas Kmieliauskas"], "top_image": "https://cimg.co/w/articles/0/5d8/d8a584ae89.png", "published_at": "2019-09-26"}