{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7566531/Man-United-rule-spending-binge-January-transfer-window-strict-policy-not-panic-buy.html", "downloaded_at": "2019-10-13 00:21:26.443033+00:00", "title": "Man United rule out spending binge in January transfer window with strict policy not to panic buy", "language": "en", "text": "Ole Gunnar Solskjaer wants Manchester United to use a giant Spanish consultancy service to help with the club's recruitment drive.\n\nSolskjaer has recommended to United they join the client list of Madrid-based company Driblab which has a detailed database on more than 100,000 players and potential signings.\n\nA dozen clubs in La Liga are already subscribers as are Nottingham Forest who used the available information before making a number of signings in the summer to aid their promotion push to the Premier League.\n\nOle Gunnar Solskjaer wants Man United to use a Spanish consultancy service for recruitment\n\nDriblab evaluates the strengths and weaknesses of players from the age of 16 in more than a hundred different competitions - down to the detail of how injuries affect their ability or run and kick the ball.\n\nThey also use an advanced algorithm to draw up an expected goals formula to see if attackers and goalkeepers are performing above or below standard.\n\nThough United have a worldwide scouting team that feed information into Solskajer and Mike Phelan in order to make recommendations to transfer chiefs Ed Woodward and Matt Judge, there is a feeling the club have to embrace modern technology as well to unearth bargains like Liverpool did with Philippe Coutinho.\n\nLiverpool have used technology for several years and were able to discover Philippe Coutinho\n\nUnited are committed to rebuilding a squad that are 12th in the Premier League and won just three of 11 matches in all competitions this season.\n\nSo far, they have relied on the eyes and ears of Solskjaer, Mike Phelan, veteran scout Jim Lawlor and his recruitment staff.\n\nThey have given transfer chiefs Ed Woodward and Matt Judge the names of half-a-dozen targets but United would prefer to wait until the summer to make big signings having had their fingers burned on Alexis Sanchez in the January 2018 transfer window.\n\nOn that occasion, the club backed Jose Mourinho by giving Sanchez record wages to gazzump Manchester City but the move turned into a disaster with the Chilean scoring just five goals for his £42million salary before joining Inter Milan on loan.\n\nThe pressure is on Ed Woodward to once again delve into the market and buy more players\n\nLyon striker Moussa Dembele, 23, is believed be on United's wishlist but the club are prepared to wait to sign him rather than pay the French club's asking price of £71million which would smack of a panic buy.\n\nThey are also reluctant to rip up their plans and change targets in January as a knee-jerk reaction to them becoming available.\n\nInsiders say they have learned how Liverpool waited six months to sign Virgil van Dijk rather than splash their money on an inferior player in the interim to help a leaky defence.\n\nPrivately, Solskjaer feels he will have to finish in the top six as a bare minimum this season to keep his job and would need to win a trophy next year.\n\nThe club are prepared to give the under-fire manager some time given the rebuilding job needed but significantly the new transfer policy, which began last summer with the acquisitions of Harry Maguire, Aaron wan-Bissaka and Daniel James, is now the blueprint for future windows regardless who is in the hot seat.", "description": "Ole Gunnar Solskjaer wants Manchester United to use a giant Spanish consultancy service to help with the club's recruitment drive.", "authors": ["Joe Bernstein For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/20/19633564-0-image-a-44_1570908018987.jpg", "published_at": "2019-10-12"}