{"pub": "guardian", "url": "https://theguardian.com/football/2019/sep/15/tammy-abraham-chelsea-wolves-mason-mount-fikayo-tomori", "downloaded_at": "2019-09-15 14:30:05.921951+00:00", "title": "Tammy Abraham revels up front but Chelsea need to tighten up at the back", "language": "en", "text": "Striker is profiting from Chelsea’s openness in attack as he showed in the 5-2 win at Wolves but it is leaving them vulnerable in defence\n\nYouth products scoring goals. A verve and excitement in forward areas. Goals, fun, joy. It was all there for Chelsea at Wolves on Saturday. Fikayo Tomori was a revelation stepping out from a rejigged defensive line. Tammy Abraham scored a hat-trick to take his tally to seven in three games. Mason Mount again found space and devastating angles in the final third.\n\nAnd yet when Romain Saïss’s 69th-minute header found its way in via the hands of Kepa Arrizabalaga and Abraham to make it 4-1, Wolves’ players were rushing to get the ball back to the centre-circle; it seemed like more than consolation. When, with the score at 4-2, the board went up to signal six minutes of injury time, there was a great roar from the home crowd: they felt there was a real chance of a famous comeback. With this Chelsea side, you suspect, no lead will ever seem quite safe.\n\nTammy Abraham scores hat-trick and own goal as Chelsea hammer Wolves Read more\n\nOn Saturday night, Abraham stood as the leading scorer in the Premier League, having scored more goals than 14 of the other sides in the division. It’s just as well he has hit such a rich seam, though: at the whistle Chelsea had conceded more than anybody but Norwich. In those details lie the story of the game and, perhaps, of Chelsea’s season.\n\nAbraham was brilliant. His weirdly detached performance at Old Trafford on the opening weekend of the season when he looked lightweight, perhaps not quite ready for the rigours of the Premier League, feels a long time ago now. Perhaps he was not quite sure he belonged; perhaps Harry Maguire makes most strikers look unimposing.\n\nFacebook Twitter Pinterest Chelsea’s Tammy Abraham, who won seven aerial duels, heads home his side’s third goal against Wolves. Photograph: Hannah McKay/Reuters\n\nHere he tormented poor Conor Coady. Of the seven aerial duels Abraham won in the game, the most significant came after 34 minutes as he applied the slightest pressure to the defender’s left arm to ease in front of him and guide Marcos Alonso’s cross past Rui Patricio to make it 3-0. He had the beating of him on the ground as well, showing great strength and awareness to stand him up 10 minutes into the second half, before a moment of deception, a burst of pace and emphatic finish to add the fourth. All that, and Jorginho at last had his first assist in a Chelsea shirt.\n\nFrank Lampard says place in the top six cannot be guaranteed for Chelsea Read more\n\nAbraham had already shown his predatory instinct, seizing on a loose ball in the box after Mount had (probably) been fouled and calmly steering his finish not into the yawning right side of the goal towards which Patricio was flinging himself, but back into the smaller space the keeper had come from, to which there was no chance of him getting back. The talk afterwards was of an England call-up; the obstacle, surely, is less Abraham’s own form than that of those already in Gareth Southgate’s squad.\n\nOther than his reluctance to field young players, the main criticism of Maurizio Sarri last season was how dull a lot of Chelsea’s football was, at least after a frantic start to the campaign. Frank Lampard has resolved that. But openness at one end has brought openness at the other.\n\nAs for Nuno Espírito Santo he spoke of a “bad” day and for Wolves it was. For all Chelsea were good in the first half, Wolves were terrible. Last season they notably relished the battle against the big six; here, perhaps missing Willy Boly, they were oddly tentative. The first and third goals were a result of defenders being dilatory in closing opponents down. Two weeks ago at Stamford Bridge, Sheffield United seemed to have a collective realisation about 10 minutes before half-time that Chelsea could be got at. They were 1-0 down at the time and about to concede a second but salvaged a point. Wolves were 3-0 down when they realised and then conceded a fourth on the break thanks to Abraham’s brilliance, and yet they were still in the game as it went into injury-time.\n\nFacebook Twitter Pinterest Chelsea’s Mason Mount found space and devastating angles in the final third in the 5-2 win over Wolves at Molineux. Photograph: Paul Currie/BPI/Rex/Shutterstock\n\nLampard switched to a 3-4-2-1 in part, he said, to offer more defensive cover while also getting Mount and Willian into awkward areas. Tomori certainly enjoyed the freedom it gave him. It was that formation, of course, that Antonio Conte won the title with in 2017 and it was striking here that only three players remained from his classic starting XI, and one of them – Cesar Azpilicueta – was playing in a different position. The transition at Chelsea has been surprisingly abrupt and for that allowances should be made.\n\nThere is also N’Golo Kanté to return and, perhaps, with him, the new shape will prove a solution. The suspicion, though, must be that the issue is organisation and mindset rather than formation. Chelsea should revel in the win and in the way their academy products, given their chance, are seizing it. But they should also be aware that no side ever won anything letting in two goals and more per game.", "description": "Striker is profiting from Chelsea’s openness in attack as he showed in the 5-2 win at Wolves but it is leaving them vulnerable in defence", "authors": ["Jonathan Wilson"], "top_image": "https://i.guim.co.uk/img/media/b251accd00126d4099bf0b048991316827b46994/0_38_5169_3102/master/5169.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=f13ecd9e8f736f25f6603e601bb0aca3", "published_at": "2019-09-15"}