{"pub": "cnbc", "url": "https://cnbc.com/2019/09/23/why-twitter-cmo-leslie-berland-holds-meetings-outdoors.html", "downloaded_at": "2019-09-23 17:16:58.942661+00:00", "title": "Twitter CMO Leslie Berland says this simple change brings more 'openness' to meetings", "language": "en", "text": "\"I love doing walking meetings and I love doing meetings out in the open air,\" she says. \"I think it brings such openness in thinking and, you know, I am a big fan of fresh air.\"\n\nBerland manages more than 100 people, and says she takes a non-traditional approach to meetings with her team. She tells CNBC Make It that instead of holding meetings inside the office, she prefers to host meetings in public places where she can walk and talk at the same time.\n\nNow, as both CMO and head of people at Twitter, Berland is also responsible for maintaining a healthy internal work culture where \"the people who work at Twitter reflect and represent the people who are on Twitter every single day.\"\n\nSince becoming Twitter's first-ever chief marketing officer in 2016, Leslie Berland has helped to solidify the company's brand and marketing direction.\n\nBerland is based in New York City but travels regularly with Twitter CEO Jack Dorsey to the company's more than 35 offices around the world. Regardless of where she's working, she says, she always tries to hold her meetings outside.\n\n\"I think that when you get your body moving it just gets the juices flowing in a different way,\" she says. \"It relaxes the conversation. It brings about much more open thinking and there's an energy to being in outside spaces and outside areas that I love.\"\n\nLike Berland, Facebook CEO Mark Zuckerberg and LinkedIn CEO Jeff Weiner believe in walking meetings, as did the late Steve Jobs.\n\nIn the book \"Steve Jobs\" by Walter Isaacson, it's revealed that the late Apple founder did some of his best thinking while taking a walk. And in a 2011 New York Times article, it was reported that Zuckerberg even takes potential employees on a walk through the woods before delivering his pitch about working at the company.\n\n\"In addition to the obvious fitness benefits,\" Weiner wrote in a blog post on LinkedIn, \"this meeting format essentially eliminates distractions, so I find it to be a much more productive way to spend time.\"\n\nA Stanford University study found that walking helps to increase creative thinking by an average of 60%. The researchers reached this conclusion after asking 176 college students to complete a set of tasks while sitting, and then again while walking. When the experiment was done, it was found that participants were far more creative when walking rather than sitting.\n\n\"Walking is an easy-to-implement strategy to increase appropriate novel idea generation,\" the authors of the study wrote. \"When there is a premium on generating new ideas in the workday, it should be beneficial to incorporate walks.\"\n\nLike this story? Subscribe to CNBC Make It on YouTube!\n\nDon't miss: The go-to interview question this Twitter executive always asks before making a new hire", "description": "Twitter CMO Leslie Berland manages more than 100 people, and says she takes a non-traditional approach to meetings with her team.", "authors": ["Courtney Connley"], "top_image": "https://image.cnbcfm.com/api/v1/image/106124469-1568223945907leslieberland8551.jpg?v=1568223999", "published_at": "2019-09-23"}