{"pub": "huffpost", "url": "https://huffpost.com/entry/ukraine-president-volodymyr-zelenskiy-no-blackmail-call-with-trump_n_5d9ef16ce4b087efdba87851", "downloaded_at": "2019-10-10 15:06:13.685201+00:00", "title": "Ukraine President Insists There Was 'No Blackmail' In Phone Call With Trump", "language": "en", "text": "KYIV, Ukraine (AP) — Ukrainian President Volodymyr Zelenskiy says there was “no blackmail” in the phone call with U.S. President Donald Trump that helped spark an impeachment inquiry.\n\nResponding Thursday to questions from The Associated Press, Zelenskiy said he only learned after their July 25 phone call that the U.S. had blocked hundreds of millions of dollars in military aid to Ukraine.\n\n“We didn’t speak about this” during the July call, Zelenskiy said, saying the military aid wasn’t the “theme” of the conversation. He spoke Thursday during an unusual, all-day “media marathon” in a Kyiv food court amid growing questions about his actions as president.\n\nZelensky, at the start of his marathon Q+A session said Trump call did not influence relations, said only aim was to secure meeting. \"We knew before that the relations were tired. They wanted to know where their cash had gone to.\" Insists no blackmail involved — Oliver Carroll (@olliecarroll) October 10, 2019\n\nTrump asked Zelenskiy during the call to investigate Democratic rival Joe Biden, according to a rough White House transcript. Congressional Democrats believe Trump was holding up the aid to use as leverage to pressure Ukraine and advance his domestic political interests ahead of next year’s U.S. presidential election.\n\nTrump said the military aid was frozen because of concerns about corruption in Ukraine, but the move prompted congressional outcry and the money was released in September.\n\nThe July call is central to the impeachment inquiry, and embarrassed Zelenskiy because it showed him as eager to please Trump and critical of European partners.\n\nZelenskiy wouldn’t say whether the Ukrainians have a different version of the transcript or whether the White House version accurately reflects the content of the leaders’ conversation.\n\nZelenskiy said he thought the call would lead to an in-person meeting with Trump, and wanted the American leader to come to Ukraine. Zelenskiy said the “key question” for him was to try to persuade the White House to “change its rhetoric” about Ukraine as a corrupt and untrustworthy country.\n\nHe said he had “several calls” with Trump, but bristled at repeated questions about their relationship. “We are an independent country, we have relations with many countries,” not just the U.S.\n\nZelenskiy is notably trying to end a five-year conflict with Russia-backed separatist in eastern Ukraine, and is treading carefully to ensure continued support from the U.S. while trying to make peace with powerful neighbor Russia.\n\nIn the July call, Trump sought help on two fronts. The first involves Trump’s claims that Ukraine allied with the Democrats in a plot to derail his 2016 presidential campaign. No evidence of such a plot has emerged.\n\nAt the same time, Trump is also pushing Ukraine to investigate any potential wrongdoing by Biden and his son Hunter, who served on the board of a Ukrainian gas company. Trump has said the United States has an “absolute right” to ask foreign leaders to investigate corruption cases, though no one has produced evidence of criminal wrongdoing by the Bidens.", "description": "Volodymyr Zelenskiy said Thursday that the U.S. president had not blackmailed him during the call, which helped trigger an impeachment inquiry into Trump.", "authors": [], "top_image": "https://img.huffingtonpost.com/asset/5d9ef6ea210000290734372c.jpeg?cache=ek3xjauwug&ops=1778_1000", "published_at": "2019-10-10"}