{"pub": "mirror", "url": "https://mirror.co.uk/money/happiest-jobs-britain-unveiled-along-20559224", "downloaded_at": "2019-10-11 12:33:34.291646+00:00", "title": "Happiest jobs in Britain unveiled - along with careers that make people saddest", "language": "en", "text": "Get the biggest money stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nLandscaping is the happiest profession in the UK, according to a new study by local services Bark.com .\n\nBut it's bad news for cleaners, with the profession ranked as top for careers that made people unhappy.\n\nThat's according to the 40,000 plus British professionals asked how they felt about their jobs.\n\nBark co-founded Kai Feller said: “Being happy at work is very important, both for an employee and an employer.\n\n\"The happier your staff are, the more productive they’ll be, and aside from this, employers should always want their employees to feel happy and valued.\"\n\n(Image: Getty Images/Flickr RF)\n\nAfter landscapers, dog walkers were the next most content in their work - with some 78% saying their job made them very happy.\n\nCounselling was the next best scoring profession, where almost three people in four (74%) were happy in their work.\n\nWhen asked what the favourite thing about their work was, two people in three in the happiest professions said ‘working outside’.\n\nThe top five jobs for happiness were:\n\nLandscapers - 86% Dog Walkers - 78% Counsellors - 74% Wedding Photographers - 68% Personal trainers - 65%\n\n(Image: Getty Images)\n\nOn the other side of the coin, people working in the least happy sectors, said the worst thing about their work was that is had \"no real value\".\n\nThe five unhappiest professions were:\n\nCleaners - 73% Plumbers - 68% Accountants - 61% Electricians - 60% Life Coaches - 57%\n\nYou can see the full list of the 10 happiest and unhappiest professions in the UK here .", "description": "If Monday mornings fill you with dread you're far from alone, but there are people out there who positively spring out of bed at the thought of going to work", "authors": ["James Andrews", "Image", "Getty Images Maskot", "Getty Images Flickr Rf", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20559248.ece/ALTERNATES/s1200/0_Senior-therapist-counseling-young-patient-while-sitting-by-bookshelf-during-therapy-session.jpg", "published_at": "2019-10-11"}