{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7593177/Labour-second-referendum-Brexit-legislation-brought-in.html", "downloaded_at": "2019-10-20 12:25:27.332564+00:00", "title": "Labour will back second referendum when Brexit legislation is brought in", "language": "en", "text": "Advertisement\n\nLabour will back a second referendum when Boris Johnson brings his Brexit legislation to Parliament this week, two party heavyweights said today.\n\nSir Keir Starmer and John McDonnell said the Labour front bench would support an amendment demanding a 'People's Vote' which could stop Brexit altogether.\n\nHowever, Jeremy Corbyn may not table the amendment himself to avoid 'alienating' other pro-Remain parties, shadow chancellor Mr McDonnell said.\n\nMeanwhile, Sir Keir suggested Labour will also launch a bid to change the PM's deal so that the UK would stay in a customs union with the EU after Brexit.\n\nSuch a move could cause a major headache for the government because there is a chance that a majority of MPs would back the prospect of a softer Brexit.\n\nMr Johnson must pass an Act of Parliament to get his deal through by October 31 but faces a battle to win a majority in what will be a series of knife-edge votes.\n\nKeir Starmer refuses to rule out running for Labour leader Shadow Brexit secretary Keir Starmer today refused to rule out running for Labour leader himself. Jeremy Corbyn would be under heavy pressure to resign as leader if Labour lost the next general election. Asked by Andrew Marr if the next leader should be a woman, Mr Starmer said there was a 'very strong case' for the party to have its first female leader. 'I'm clearly not a woman and I don't think that's going to change any time soon,' Mr Starmer joked. But pressed on whether he would run, he said he was 'not going to start answering' about his leadership ambitions. 'I'm not even discussing that, I'm 100 per cent behind Jeremy Corbyn,' he said. 'I am working with Jeremy Corbyn to try to win the next general election. 'I think what's most important is that we build on what we've got at the moment and we build on that 2017 manifesto that was so popular in our movement.' Mr Starmer is the favourite with some bookmakers to succeed Mr Corbyn.\n\nSpeaking on the BBC's Andrew Marr Show, shadow Brexit secretary Mr Starmer said a Labour-backed referendum would include an option to remain in the EU.\n\n'We need an amendment to say that whatever deal gets through, it should be subject to a referendum where that deal is put to the public and they're asked do you want to leave on these terms or would you rather remain in the EU,' Mr Starmer said.\n\n'It's inevitable, it's been down many times. When that bill goes down it is inevitable that that amendment will be put down.\n\n'We have already voted, I think, three times as a party for a second referendum with a three-line whip behind it.\n\n'A growing number of people now think the only way truly to settle this is to ask people do you want to leave on these terms or would you rather remain?'.\n\nAsked if the Labour front bench would back the amendment, Mr Starmer said: 'That is the clear policy.'\n\nHowever, he refused to say how he would vote in such a referendum, echoing Jeremy Corbyn who has similarly dodged the question.\n\nSir Keir also confirmed Labour will push for a customs union.\n\nHe said: 'We have been arguing for a very long time now for a customs union with the EU and for single market alignment.'\n\nMr Johnson's current Brexit deal would see the UK leave the EU customs union, allowing Britain to strike its own trade agreements in the future.\n\nLabour has long advocated a softer Brexit plan which would see the UK stay closer aligned to the bloc and stay in a customs union with Brussels.\n\nIf MPs agreed to Labour's amendment to add a customs union requirement to the PM's agreement Mr Johnson would likely have no choice but to pull the final vote on his deal and go back to the drawing board.\n\nHe is adamant he could never accept the kind of soft Brexit demanded by Labour.\n\nMr McDonnell has previously said he would vote for Remain in a second referendum.\n\nUp to a million people marched in favour of a second referendum while the Commons met for an unusual Saturday sitting yesterday.\n\nFront bench support: Keir Starmer (speaking at the dispatch box) and John McDonnell (left) both said today that Labour would back a second referendum\n\nLabour's Shadow Brexit secretary Keir Starmer (pictured on the BBC's Andrew Marr Show today) said the opposition front bench would back a People's Vote\n\nWhat happens next in the Brexit process? - Could Mr Johnson still get his deal through Parliament? Yes, but time is running out before the October 31 deadline as the European Parliament would also need to ratify it. Without a meaningful vote, support for the agreement has not yet been tested. Though the PM has attracted support from a number of prominent Brexiteer Tories, the DUP is strongly opposed to the deal. - If there is to be another vote, when will it happen? Jacob Rees-Mogg, the leader of the House of Commons, said the government wants to hold another meaningful vote on Mr Johnson's deal on Monday. The Commons Speaker, John Bercow, said he would consider whether to allow the government's plans. Welsh Labour MP Chris Bryant said, in a point of order, that it is not good practice for a Government to keep holding debates on the exact same subject. If a vote does happen, one unnamed Scottish opposition MP has been quoted as saying next week will not be a simple case of the Government just winning a vote on their new deal. 'We'll amend it (over and over). It'll be totally disfigured. A different bill entirely,' the MP reportedly said. - What about the letters sent last night? Under the terms of the so-called Benn Act, which was passed against the PM's wishes, Mr Johnson was compelled to write to the EU asking for a three-month Brexit extension if he had not secured a deal by 11pm UK time on October 19. He sent one unsigned letter asking for a delay, another making clear the first was from MPs and a third urging the EU not to grant an extension. - Will the EU agree to an extension? Despite European Commission president Jean-Claude Juncker raising doubts over another Brexit delay, the decision needs to be taken by all 27 remaining EU states, not him. However, the EU could set a different length to an extension, either shorter or longer than the three-month one cited in the Benn Act. The EU could decide not to formally respond to such a letter from the PM until it sees if Mr Johnson can get the Withdrawal Agreement Bill through Parliament next week.\n\nMr McDonnell was among those who addressed People's Vote supporters at the Westminster rally.\n\nSpeaking to Sophy Ridge on Sky News, Mr McDonnell said an amendment for a second vote would 'almost inevitably come up'.\n\nThe legislation may be brought in as early as Tuesday this week.\n\nThe Government may try another 'meaningful vote' on Monday before introducing the legislation, but Speaker John Bercow may rule it out of order.\n\n'We've always said, if Boris Johnson is confident about this deal, go back to the people with it,' the shadow chancellor said.\n\n'We voted for the Kyle-Wilson amendment before which called for a second referendum.\n\n'Tactically, these things are often better moved from the back benches where you can secure cross-party support and where you're not alienating people purely and simply because it's the leader of the opposition moving it.\n\n'What we've said is Boris Johnson should take this deal back to the people.'\n\nMr Corbyn has previously proved toxic in cross-party discussions.\n\nLib Dem leader Jo Swinson has repeatedly refused to back Mr Corbyn as head of a proposed 'government of national unity' to delay Brexit.\n\nMr McDonnell said another Meaningful Vote on the deal on Monday would be 'pointless' and a 'political stunt' and advocated instead for the 'real Parliamentary process of scrutinising that legislation'.\n\nDiscussing Mr Johnson's begrudging request for a Brexit delay, Mr Starmer said the PM was behaving in a 'childlike' way.\n\n'He's being childlike, the law is very clear. he should have signed one letter in accordance with the law,' Mr Starmer said.\n\n'If we crash out because of what he's done with the letters in 11 days, he bears personal responsibility for that.\n\n'His deal is a very, very bad deal and it has within it a trapdoor to no deal at the end of next year.\n\n'It is essential that we expose this deal for what it is, because it's a deal that fundamentally changes our economy and our approach.\n\n'We will put down amendments to make sure that the future destination is a close economic relationship with the EU.'\n\nThe Labour frontbencher was also pressed on how a referendum would work in practice when the Conservatives remain in power.\n\nEven if an amendment is passed, it is likely that further legislation would be needed to organise a public vote.\n\nMr McDonnell told Sky News this morning that another Meaningful Vote on the deal on Monday would be 'pointless' and a 'political stunt'\n\nExperts say it would take at least 22 weeks - nearly six months - to arrange and hold a valid referendum.\n\n'I accept that's probably the timeframe, I think it could be shortened a bit but probably not much,' Mr Starmer said.\n\n'If a general election comes first, as you know the Labour Party is saying we would seek to improve the deal but still put it back against Remain in a referendum.'\n\nMr Starmer also said Labour would be open to talking to the DUP following their opposition to Boris Johnson's Brexit deal.\n\nHe said: 'I would openly invite the DUP to talk to us. 'If you want to work with us to improve the situation we're in, our door is open to that discussion.'\n\nAfter initially ruling one out, Jeremy Corbyn has inched towards supporting a second referendum under pressure from activists.\n\nThe party has long tried to steer a middle way between its flocks of Remain-supporting voters, especially in London, and its supporters in Leave-voting constituencies, especially in the North of England.\n\nBut Labour's equivocation was widely blamed for its disastrous result at the European Parliament elections in May, where it came third behind the Brexit Party and the Lib Dems, who are full-throatedly anti-Brexit.\n\nJohn McDonnell in Westminster yesterday where he addressed a 'People's Vote' rally demanding a second referendum on Brexit\n\nThe Government hopes to bring another 'meaningful vote' on the Brexit deal on Monday but Speaker John Bercow (pictured in the chair yesterday) may rule it out of order\n\nAfter Mr Johnson lost the crunch vote yesterday, the Speaker hinted he could block a Government attempt to bring another 'meaningful vote' on Monday.\n\nJacob Rees-Mogg, the leader of the House of Commons, suggested the Government would bring the vote before introducing Withdrawal Agreement legislation this week.\n\nBut Mr Bercow has previously ruled that MPs cannot hold repeated votes on the same question.\n\nCiting a precedent dating back to 1604, he ruled in March that then-PM Theresa May could not bring the same withdrawal deal back to Parliament without changes.\n\nThe ruling enraged Conservative MPs who accused him of sparking a 'constitutional crisis'.\n\nThe Commons yesterday backed an amendment by former Tory MP Oliver Letwin which effectively delayed a decision on Mr Johnson's Brexit deal.\n\nThat forced Mr Johnson to send a reluctant delay request to Brussels, in compliance with the Benn Act which was rammed through Parliament by Remainers last month.\n\nHowever, Mr Johnson accompanied the request with another letter saying he did not want an extension.\n\nRemainers have accused him of flouting the spirit of the Benn Act and the issue could end up in court this week.", "description": "Keir Starmer and John McDonnell said the Labour front bench would support an amendment demanding a 'People's Vote' that could stop Britain leaving the EU altogether.", "authors": ["Tim Stickings For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/10/19952038-0-image-a-7_1571564043448.jpg", "published_at": "2019-10-20"}