{"pub": "breitbart", "url": "https://breitbart.com/national-security/2019/09/26/libyan-president-at-the-u-n-foreigners-urged-war-criminal-haftar-to-attack-tripoli", "downloaded_at": "2019-10-05 05:56:52.295050+00:00", "title": "Libyan President at the U.N.: Foreigners Urged Haftar to Attack Tripoli", "language": "en", "text": "“It is no exaggeration to say that the stability and civilian nature of Libya is a critical matter, not only for Libya’s stability but the region and the world,” Falez Mustafa Serraj, president of the internationally-recognized Government of National Accord (GNA) of Libya, told the U.N. General Assembly on Wednesday.\n\nSerraj said Libya was in crisis due to “negative foreign interference that led to institutional and political division” and noted the crisis has grown to the point where Libya’s capital city of Tripoli was attacked by the forces of a rival Libyan government.\n\nSerraj said those forces enjoy “foreign financial and military support” and referred to their commander, General Khalifa Haftar, as a “criminal.” He noted the siege of Tripoli began while the U.N. secretary-general happened to be visiting the city in April in an effort to arrange a peaceable political solution to LIbya’s ills.\n\n“His coup has failed, and here he is today, repeating once again his desperate attempts to militarize the country and to block our path towards a modern civilian state, ridiculing the revolution of the Libyan people and their sacrifices that were offered to rid the country of dictatorship,” Serraj said of Haftar.\n\n“What encouraged this war criminal to carry out this aggression is the report he received from certain states for years, in flagrant violation of Security Council resolutions on the arms ban,” said Serraj. “This led him to be deluded and believe he could enter the capital in two days, but his delusions were destroyed and the world has come to know his reality, and to know that he is a bloody criminal seeking power.”\n\nSerraj claimed that much of Haftar’s foreign support drained away after he was trounced by the defenders of Tripoli and exposed as a “failure,” but it is “unfortunate” that he still has some foreign patrons, including the United Arab Emirates, which has “allowed its territories to be a media forum for Haftar to issue his hate speech and incitement.”\n\n“In addition, French Javelin missiles were found after the liberation of the city of Gideon in the center of the aggressor’s operations,” he said.\n\n“We also find it strange the positions of some states, particularly our neighbor Egypt, who lecture us on democracy and a civilian state, and the economy, and how to distribute wealth,” Serraj continued.\n\n“We denounce these efforts that support the war criminal and support coup plotters in violation of Security Council resolutions,” he said. “We confirm that we will continue to respond to the aggressor and defeat him, despite whatever support he receives, and we consider his supporters morally and legally responsible.”\n\nSerraj said Haftar’s “widespread” human rights violations include “extrajudicial killings and forced displacement” and the recruitment of child soldiers. These offenses have resulted in over 3,000 casualties plus “hundreds of thousands” of refugees. He said Haftar’s forces have deliberately attacked civilian targets, including airports and hospitals.\n\nSerraj asked the United Nations to send a fact-finding mission to Libya and asked the International Criminal Court (ICC) to open an investigation of Haftar.\n\nSerraj rejected Haftar’s claims to be “fighting terrorism” and said he has misled the international community.\n\n“National Accord forces are the ones who have fought terrorism,” he insisted. “We continue to work together to root out terrorism wherever it is, and we will continue to battle until we uproot all of terrorism. Our soldiers who have fought the terrorist organization are the ones who are fighting back the aggression against the capital now.”\n\nSerraj accused Haftar of trying to split Libya in two and launch a war between the eastern and western halves. He called on the political leaders allied with Haftar to abandon him and work with the Government of National Accord to create a “modern civilian state” across the entire country.\n\n“I call upon all youth who have been convinced of war by a war-obsessed man to return securely and safely to their homes, and to take the side of the nation,” he said.\n\nSerraj said his government’s commitment to dialogue and political solutions does not extend to Haftar, who can no longer be regarded as a “partner for peace.”\n\n“There is no room in dialogue for someone who wants to militarize the state,” he said.\n\nAfter reviewing some of his government’s efforts to decentralize power and spread funding across all of Libya, Serraj warned against “attempts to sell Libyan oil outside of legal means,” because “oil is the property of all Libyans and its management is the responsibility of the national oil company alone.”\n\nThe GNA president strove to reassure the U.N. General Assembly that progress has been made on national security – a necessary precondition for restoring national prosperity and international trade – but his assessment was not entirely reassuring: “Before [Haftar’s] aggression, we achieved positive strides in this regard, which has led to the return of several diplomatic missions to Tripoli. We were able to contain most armed groups, and implemented programs to collect weapons, and integrated former militants into national institutions.”\n\nSerraj criticized the international community for remaining silent while crowded migrant centers have been subjected to bombing attacks. He stressed that the Libyan people are “victims of migration, not the cause of migration” into Europe, and pledged to continue cooperation with the “target states of migrants” to address the issue, which he said could only be permanently addressed by encouraging “development in origin states.”\n\n“My country, as a transit point of migrants, critically needs political support in proportion to the challenge so that we can build the necessary institutions to control borders, to limit this phenomenon and minimize its impact,” he said.\n\n“A stable Libya will be able to secure its borders and will be able to provide job opportunities to hundreds of thousands as per Libyan labor law,” he pledged.\n\nDespite all of the Libyan woes he brought to the General Assembly, Serraj still found time to conclude his speech with a call for an independent Palestinian state with East Jerusalem as its capital,” and for a “peaceful, political solution in Syria and Yemen.”", "description": "Falez Mustafa Serraj of Libya's Government of National Accord tells the U.N. foreign support inspired rogue General Khalifa Haftar to attack.", "authors": ["John Hayward"], "top_image": "https://media.breitbart.com/media/2019/09/Falez-Mustafa-Serraj-640x335.jpg", "published_at": "2019-09-26"}