{"pub": "guardian", "url": "https://theguardian.com/artanddesign/2019/oct/19/kehinde-wiley-rumors-of-war-times-square-richmond-virginia-kara-walker-turbine-hall-tate-modern", "downloaded_at": "2019-10-20 06:51:28.448795+00:00", "title": "Urban warrior in Nikes and a hoodie leads charge against white orthodoxy", "language": "en", "text": "“It’s a lot to be asked, to pledge allegiance to a country, to a world, that keeps you invisible.”\n\nTurbine Hall artist Kara Walker: 'Apparently, the only thing I am is black' Read more\n\nSo said Valerie Jo Bradley, president of Save Harlem Now!, applauding news of a statue by Vinnie Bagwell, to be erected in Manhattan, that will memorialize enslaved women victimized by the 19th-century gynecologist Dr J Marion Sims.\n\nBut she might equally have been referring to two other projects, one in London and one in New York, in which the African American artists Kara Walker and Kehinde Wiley have produced sculptures on a heroic scale. Like Bagwell, both give greater visibility to the historically overlooked and challenge the legitimacy of some we have honored in the past.\n\nPublic art has long been used to exalt the powerful without counting the cost of their power. On a grand scale, Edwin Lutyens’ design for New Delhi commemorated the exploitative Raj by emulating the capitals of ancient empires, ornate fountains and sculptural monuments the conspicuous totems of prestige.\n\nRumors of War is all about the veneration of questionable heroes\n\nIt was the same in London, Paris and Cape Town, in Washington and other American cities. Circles and squares were consecrated with allegorical memorials. Skilled craftsmanship and exceptional artistry made some of history’s most murderous vandals and unworthy sovereigns into marble saints.\n\nNow Walker has installed her whimsical fountain, Fons Americanus, in the Tate Modern Turbine Hall. It was inspired by a chance passing of Sir Aston Webb’s grandiloquent Victoria Memorial, across town, outside Buckingham Palace. Walker’s imagination was captured by the outrageous pomp of the thing. Crowned by a gilded, winged Victory, buttressed by personifications of constancy and courage, the queen-empress is both revered icon and the world’s grandmother.\n\nRome, where Walker was a fellow at the American Academy, was another pivotal influence. Baroque monumentality, she says, left her “perversely moved”. She also recalled the experience as disarmingly “treacherous”.\n\nIronically, this was the very quality which gained her recognition. In works like Gone, innocent-seeming silhouetted paper cutouts beguiled with lyrical dexterity. On closer inspection, they belied a shocking narrative of slavery.\n\nWalker’s Tate Modern fountain is no less damning of America and no less clever, its allusions unending. But it is impossible to mistake it as merely “pretty”. Weary of empty elegance, Walker rebukes the past. Arm yourself, she tells us, with what really happened.\n\nConversely, Wiley’s Rumors of War effectively subverts entrenched authority by adhering to the strictest orthodoxy. A towering bronze rider on horseback, it will be on display through November, above the crowds of Times Square.\n\nThe work will speak louder still when it reaches its permanent home\n\nThough Wiley’s urban warrior in his Nikes and hoodie mimics a statue of the Confederate general Jeb Stuart in Richmond, Virginia, it also confronts the statue of Theodore Roosevelt outside the American Museum of Natural History a couple of miles away. The Roosevelt statue casts the 26th president astride a steed, in the role of “great white father”. Commandingly assuming his burden, he leads a Native American and black man, half-clothed and on foot, towards the sunrise and civilization.\n\nWiley’s work also answers the column erected 20 blocks south of Roosevelt in New York, at Columbus Circle, to glorify the very founder of America’s imperialist criminality.\n\nRumors of War is all about the veneration of questionable heroes. Wiley employs traditional artifice to invest his black man with every convention of noble bearing, including a charging horse. But he is not out to make a black aristocrat. He simply wants to show his humanity.\n\nThe work will speak louder still when it reaches its permanent home. Once installed in Richmond, the capital of the Confederacy, before the Virginia Museum of Fine Arts, it will confront some of the most insidiously beautiful memorials on one of the most misleadingly lovely streets in all America: Monument Avenue.\n\nDevised in the late 19th century, this exquisitely landscaped boulevard is an open-air pantheon of Confederate worthies. In such places, unaware or off one’s guard, it can seem that beauty alone might atone for the ignoble.\n\nFacebook Twitter Pinterest Fons Americanus by Kara Walker at Tate Modern. Photograph: Peter Summers/Getty Images\n\nWiley has set out “to expose the beautiful and terrible potentiality of art to sculpt the language of domination”. But will his work offer a sufficient corrective? Certainly it will be an improvement over PaulDiPasquale’s trite and tortured memorial to Arthur Ashe, installed on Monument Avenue in 1996.\n\nRepresentations of blacks by white sculptors have not always been triumphs. In New York, Gabriel Koren’s Frederick Douglass and Malcolm X are marvellous but Robert Graham’s Duke Ellington, static and stolid, was a missed opportunity.\n\nKehinde Wiley: 'When I first started painting black women, it was a return home' Read more\n\nThe way to parity of recognition and public patronage is strewn with risk and failure. In the late 1930s, the brilliant African American sculptor Richmond Barthé conceived a bronze youth, nude but for broken shackles, as a memorial to the statesman James Weldon Johnson, to stand on 110th Street and Seventh Avenue. Thanks to local prudery and Robert Moses, it was never realized.\n\nA statue to J Marion Sims was. Indisputably, his breakthroughs saved lives. But they were achieved through experiments on enslaved women. Killing their infants, he laid the blame on “black uncleanliness”, not his own incompetence. How can he possibly still be acclaimed?\n\nWhen the decision to replace the monument to Sims was made, four finalists emerged: Bagwell, Wiley, Simone Leigh and Wangechi Mutu. Panelists selected by the city voted in favor of Leigh. That meant disregarding community preference for Bagwell’s 18ft Victory Beyond Sims. Deferring to Harlemites, Leigh withdrew.\n\n“With all we’ve done, some still contend, what we do, whatever’s done to us, doesn’t matter,” said Bradley, of Save Harlem Now! “With this monument and other efforts in collaboration with local stakeholders, we’re out to assure that everyone learns about the remarkable attainment of women and people of color. We’ve a long way to go.”", "description": "Rumors of War, by the black artist Kehinde Wiley, will soon move to the heart of the Confederacy. He is not alone in his challenge", "authors": ["Michael Henry Adams"], "top_image": "https://i.guim.co.uk/img/media/fb64b4fc9a56ca87b9d2d520d1b331b9b823cf3d/0_59_4028_2417/master/4028.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=21cc49afde11b4fca4cf107f9153006f", "published_at": "2019-10-19"}