{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7539861/George-Michael-hid-gay-protect-career-Andrew-Ridgeley-says.html", "downloaded_at": "2019-10-05 08:25:13.710270+00:00", "title": "George Michael hid being gay to protect his career in the US, Andrew Ridgeley says", "language": "en", "text": "George Michael’s struggles to keep up the pretence he was straight during his Wham! heyday have been revealed by bandmate Andrew Ridgeley.\n\nRidgeley knew Michael was gay in 1983 when the pair were shooting Club Tropicana, but it was 15 years before he came out publicly.\n\nIn his autobiography published yesterday, he tells how Michael kept up the ‘facade’ for fear that going public could damage his career and chance of competing with stars such as Michael Jackson.\n\nRidgeley knew Michael was gay in 1983 when the pair were shooting Club Tropicana, but it was 15 years before he came out publicly. In his autobiography published yesterday, he tells how Michael kept up the ‘facade’ for fear that going public could damage his career and chance of competing with stars such as Michael Jackson\n\nRidgeley, now 56, said the tragic singer was ‘beset by confusion as a consequence of his sexuality’ and struggled to ‘define the reality beneath the public image’.\n\n‘Beyond the close inner circle nobody really had a clue, so while the reality of maintaining the facade wasn’t tearing George apart, some cracks were definitely starting to show,’ he writes.\n\nHe adds that Michael’s ‘ambition to succeed had taken priority over everything else’ including his ability to be honest about his sexuality.\n\n‘He was driven by an unstoppable desire to fulfil his potential, but that had come at a price,’ he said.\n\n‘What the real implications were for George, I can’t say, but I knew he was never comfortable with the added interest that came with Wham! hitting the big time.’\n\nIn mourning: Wham! star Andrew Ridgeley admitted in his autobiography, which was released on Thursday, that he still has 'a number of questions' over George Michael's death\n\nHe said George was ‘adamant his sexuality should be kept under wraps’ which ‘created a whole unwelcome extra level of stress for him to manage’. Ridgeley, who said he never met any boyfriends that Michael might have had during his time in the band, added: ‘He thought coming out would scupper chances of competing with artists like Madonna and Michael Jackson in the States.’\n\nMichael refused to come out even after his boyfriend Anselmo Feleppa died from Aids in 1993. Ridgeley said that it had ‘devastated’ the star but he had been ‘unable to discuss it in public’. ‘Had he spoken out earlier, who knows how differently things might have played out.’\n\nHe added: ‘While his confidence had grown as Wham! had been wound down, George was now struggling with what being George meant. What had be become? He was bothered about whether or not it was something he could live with.’\n\nStill has questions: Following George's tragic passing on Christmas Day in 2016, Andrew explained in his book: 'Without any real closure, the grieving seemed terribly raw'\n\nMichael and Ridgeley met as schoolboys in Bushey, remaining friends until the singer’s death on Christmas Day in 2016.\n\nIn the autobiography, entitled Wham! George and Me, Ridgeley details the moment Michael came out to him as gay in a hotel in Ibiza where they were filming the Club Tropicana video.\n\nHe tells how their friend and backing singer Shirlie Holliman was also in the room ‘perched on a large sofa in the suite’.\n\n‘George was still in bed. He smiled as I came in,’ he wrote.\n\n‘The mood in the room was so relaxed and familiar, yet what George was about to reveal was clearly a big deal for him. “I didn’t know whether to tell you this”, he said, looking across at Shirlie, “but I’m going to. I’m gay”.’\n\nDespite their close bond, Ridgeley admits in the book that he was sometimes ‘envious’ of Michael. He writes that, while he was ‘amazed’ by his friend’s ‘prodigious talent’, it ‘would have been fabulous to have some of that stardust sprinkled upon me’.\n\nAlthough Michael’s cause of death has been recorded as being due to a heart condition, Ridgeley said he still has many unanswered questions about his passing.\n\n‘He seemed to be in good health at the time and there are conflicting reports about the night that preceded his passing,’ he said.\n\n‘That the circumstances of his death seemed unclear only compounded the distress. Without any real closure the grieving seemed terribly raw.’\n\nHe added: ‘A heart condition was eventually recorded as the cause of death, but there are still a number of questions. It now seems as if we may never know what really happened.’", "description": "Andrew Ridgeley knew Michael was gay in 1983 when the pair were shooting Club Tropicana, but it was 15 years before he came out publicly.", "authors": ["Jennifer Rusenior Showbiz Correspondent For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/08/19326258-0-image-a-9_1570259868832.jpg", "published_at": "2019-10-04"}