{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/linkedin-executive-dan-shapero-career-change-advice-internal-mobility-2019-10", "downloaded_at": "2019-10-09 12:49:40.046691+00:00", "title": "A LinkedIn executive's 3-step plan to making a meaningful career change can help anyone who feels stuck in their job", "language": "en", "text": "LinkedIn executive Dan Shapero switched from sales to product using three key strategies that any professional can apply.\n\nHe found support at work and at home, developed a backup plan, and set a timeline for the career transition.\n\nNow Shapero is leveraging that experience as VP of global sales at LinkedIn.\n\nClick here for more BI Prime stories.\n\nDan Shapero had worked on LinkedIn's executive team for six years when the CEO asked him: \"What are your career ambitions?\"\n\nIt was 2014, and Shapero was vice president of global sales for LinkedIn's recruiting business, Talent Solutions, managing about 1,200 people around the world. He was walking outside in San Francisco with CEO Jeff Weiner, and he answered Weiner's question honestly.\n\n\"I expressed this excitement for one day being able to be a great technology company leader,\" Shapero told Business Insider at LinkedIn's Talent Connect conference, which took place in September 2019, in Dallas.\n\nWeiner was equally candid in his response. Shapero remembers him saying, \"You're doing a fantastic job, but you may not be learning the skills you need to do what you ultimately want to do someday.\"\n\nThat is to say, unless Shapero made some meaningful job changes, he probably wouldn't achieve his career goals. \"That was a hard message to hear in the moment,\" Shapero said. But he knew it was true. \"I couldn't be the best version of myself in that [professional] capacity without having this experience.\"\n\nShapero took a month to mull over the conversation, after which he returned to Weiner and told him: \"Let's do it.\" He was going to leave his current position in sales and develop the skills necessary to be a leader on LinkedIn's product team.\n\nFrom there, Shapero embarked on what he called a \"tour of duty,\" in which he was an individual contributor (not a manager) working on different LinkedIn products.\n\nLooking back on the process of redesigning his career trajectory, Shapero sees it as a three-pronged approach that any professional can use to retool their career.\n\nRead more: How to make a drastic career change, from an executive coach who's helped countless people unhappy at work\n\n1. Find sponsorship.\n\nShapero said he had buy-in from both Weiner and his direct manager (Mike Gamson, who was then senior vice president of global solutions at LinkedIn).\n\nIt helped that Shapero had excelled in his current role, significantly increasing the number of clients registered with LinkedIn's recruiting business. So his managers were open to facilitating his next move, where he would continue to grow the organization.\n\n\"When you're used to doing a job with a certain level of mastery and you're moving into a job where you don't have that level of mastery,\" Shapero said, \"having support around you is really important.\"\n\n2. Develop a plan B.\n\nBefore making any big decisions, Shapero talked to his wife about what they would do if the career transition didn't pan out.\n\nBy this point, Shapero had found a successor to be VP of global sales for Talent Solutions, so he couldn't simply go back to that role. Instead, he knew he'd have to find a similar job at a different company (or at LinkedIn, if a position was available).\n\nThe job search might be difficult, Shapero said, \"but I'd at least thought it through.\" And that psychological preparation \"was helpful in allowing me to relax,\" Shapero said. When he made mistakes in the process, he was less inclined to throw his hands up and call the whole transition a waste of time.\n\n3. Set a timeline.\n\nShapero gave himself two years to make the pivot from sales to product.\n\nFor two years, he'd invest in developing the skills and experience necessary for a product role at LinkedIn. If after two years, he still didn't feel comfortable with or ready for the change, he'd call it quits.\n\nThis timeline was key, if only because it freed him somewhat from rumination. When you're planning your next career move, Shapero said, \"it's important not to spend every minute asking yourself whether you've made the right decision.\"\n\nAs it turned out, it took roughly six months for Shapero and his colleagues to prepare for the transition. For the two years after that, Shapero served as director of product management for LinkedIn's Careers products (products for job-seekers).\n\nUltimately, Shapero was able to leverage his experience on both the sales and product teams in taking on new, hybrid roles.\n\nMonths after Microsoft acquired LinkedIn in 2016, Shapero became head of product for multiple departments, including LinkedIn Learning Solutions (an education platform for employees) and Talent Solutions. And in 2018, he became head of global sales for the entire company.\n\nMany organizations are open to employees making career changes\n\nShapero's experience reflects the recent shift away from the proverbial career ladder to something less linear, and potentially more fulfilling. It's less about steady upward progression (say, from analyst to VP to senior VP in one department at one company) and more about making lateral moves between teams or even between industries.\n\nRead more: A former Google exec reveals the 3 questions you should ask yourself before making a career change\n\nFor example, former Googler and Facebook exec Libby Leffler started out at Facebook as a client partner, then became a business lead to the chief operating officer and a strategic partnerships manager.\n\nAs Leffler previously told Business Insider, \"I wasn't only focused on the next level up. I was really always drawn to things that intrigued me, gave me the chance to learn as much as I could, and gave me the opportunity to learn something new, with plenty of room for experimentation.\"\n\nA growing number of companies, especially in the tech industry, support this type of career path through \"internal mobility,\" or letting employees try out roles on different teams. For employees, internal mobility keeps things novel and interesting; for employers, it's a way to retain top talent who might otherwise seek challenges at another organization.\n\nAs for Shapero, he suspects it was more practical for him to change roles within LinkedIn than to join another organization. He already knew how the business worked and he'd built relationships throughout the company, both of which helped him in his new job.\n\n\"Even if some of the core product skills were new to me,\" Shapero said, \"I can only imagine that doing that at a completely new organization would have been that much harder.\"", "description": "LinkedIn exec Dan Shapero switched from sales to product using three key strategies. Now he's leveraging that experience as VP of global sales.", "authors": ["Shana Lebowitz"], "top_image": "https://image.businessinsider.com/5d9cb0c95d21aa4f763e6824?width=1200&format=jpeg", "published_at": "2019-10-09"}