{"pub": "npr", "title": "Beijing Responds To Trump's Tweets On U.S.-China Trade War", "url": "https://npr.org/2019/08/28/754962739/beijing-responds-to-trumps-tweets-on-u-s-china-trade-war", "language": "en", "published_at": "2019-08-28", "downloaded_at": "2019-09-02 06:59:10.214086+00:00", "text": "Beijing Responds To Trump's Tweets On U.S.-China Trade War\n\nNPR's Rachel Martin talks to China-based business consultant James McGregor about Beijing's response to President Trump's tweets, and what that reveals about its stance toward the trade war.\n\nRACHEL MARTIN, HOST:\n\nIn just a few days, a new round of U.S. tariffs on Chinese goods will take effect. It's the latest move in the escalating trade war between Washington and Beijing. For his part, President Trump personally raised the pressure on China by telling U.S. companies to find an alternative. To talk about Beijing's response, we reached James McGregor. He's the China chairman for APCO Worldwide, a business and political consulting firm for foreign companies based in China. Thank you so much for being with us.\n\nJAMES MCGREGOR: Happy to do it.\n\nMARTIN: From what you're seeing in China's state media, the press there - the headlines, the stories - how is Beijing responding to President Trump? What's their strategy when it comes to him?\n\nMCGREGOR: China's taking two tacks. On one hand, they have statements coming out of various people under Xi and also the state media that said, we need consultations based on equality and mutual respect, we need to treat conditions to reengage, decoupling doesn't help either side. On the other hand, you're not going to keep China down, don't misjudge our determination. Even the ministry of commerce think tank said that this is actually the most comfortable stage of the negotiations because the tariffs are going to hurt the U.S. more than China, and China will win.\n\nSo there's a hard position, and there's also a soft position. But at this point, really, how do they engage? 'Cause what are they engaging with?\n\nMARTIN: Well, let me ask you about something you said. You said there's hesitancy about decoupling. Are there voices within China that say, maybe we should pursue a more isolationist trade strategy? Is that what that means, decoupling?\n\nMCGREGOR: China, actually - to be honest with you, this is a Sputnik moment for them. They're not going to talk decoupling now but, actually, they're working on it. This has served China to be a real wakeup call that you can't depend on the U.S., and you can't be dependent on the U.S., whether it's for agriculture goods or whether for technology. And so they've been doing this for years, and now they're just redoubling their efforts to get suppliers from different parts of the world. And also, Xi Jinping talks a lot about self-reliance.\n\nMARTIN: I mean, when you talk about China beginning to redouble efforts to become more economically independent, to build up their own, say, technology industry, do they have the capacity to do that, and how long would it take?\n\nMCGREGOR: They've been working very hard to develop other export markets for many years other than a dependence on the United States. China can develop its own technology sector. There's tens of thousands of Chinese, very smart, capable people who have gone to MIT, Carnegie Mellon, Cal Polytech, who've worked for everybody from Siemens to Google to Microsoft. And those people are back in China, and they're building companies. And they've got all - they've got the money to do it, and they've got the market to do it and they've got the government's backing.\n\nSo we have to kind of get over ourselves that, you know, we're in this great position and that China's going to bend at the knee to us. We've got to wake up and compete against China 'cause they're on the move, despite, you know, the trade war causing some significant problems in their economy. So they're kind of waiting 'cause they actually think this is going to hurt us a lot more than them 'cause they've got a lot more control. They've got a lot more control of their economy, and they've got a lot more control of their financial system. And they don't have a democracy.\n\nI mean, you know, we're now facing where the corn growers are saying they can't support Trump in 2020, things like that, because all this stuff is coming home to roost in our economy.\n\nMARTIN: James McGregor. He's China chairman of the business and political consulting firm APCO Worldwide. Jim, thank you so much for your time.\n\nMCGREGOR: Glad to do it.\n\nCopyright © 2019 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.", "description": "NPR's Rachel Martin talks to China-based business consultant James McGregor about Beijing's response to President Trump's tweets, and what that reveals about its stance toward the trade war.", "authors": [], "top_image": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400"}