{"pub": "realclearpolitics", "url": "https://thehill.com/opinion/columnists/461848-katie-pavlich-the-democrats-desperate-do-overs", "downloaded_at": "2019-09-19 23:09:50.691672+00:00", "title": "Katie Pavlich: The Democrats' desperate do-overs", "language": "en", "text": "When Donald Trump was elected President of the United States on Nov. 7, 2016, it came as a shock to the country. The tough campaign worked for the billionaire businessman, who had never held public office before. He tore down the once reliable blue wall of Wisconsin, Michigan and Pennsylvania, beating the Clinton dynasty once and for all.\n\nThis is when the delusion and denial began.\n\nADVERTISEMENT\n\nDemocrats and their allies in the media, led by twice failed presidential candidate Hillary Clinton Hillary Diane Rodham ClintonQueer Marine veteran launches House bid after incumbent California Rep. Susan Davis announces retirement Poll: Trump neck and neck with top 2020 Democrats in Florida Former immigration judge fined, temporarily banned from federal service for promoting Clinton policies MORE, were stunned and in disbelief. Instead of accepting the results put forward by the voting American public, Democrats tried to discredit Trump’s victory through allegations of cheating and Russian collusion.\n\n“You can run the best campaign, you can even become the nominee, and you can have the election stolen from you,” Clinton said during a May 2019 speech in California.\n\nBut as former special counsel Robert Mueller Robert (Bob) Swan MuellerLewandowski says Mueller report was 'very clear' in proving 'there was no obstruction,' despite having 'never' read it Fox's Cavuto roasts Trump over criticism of network Mueller report fades from political conversation MORE found, despite Russian efforts to interfere, the election was not stolen.\n\nFor two years, Democrats argued Mueller’s report would be the final say, no matter where the facts of the investigation would lead. As soon as the report was published without statements of collusion and obstruction of justice, House Democrats vowed to launch their own probe, with a hope of leading to impeachment.\n\n“This Committee has already covered the central findings of the Special Counsel’s investigation,” House Judiciary Committee Chairman Jerry Nadler Jerrold (Jerry) Lewis NadlerPelosi: Lewandowski should have been held in contempt 'right then and there' Nadler's House committee holds a faux hearing in search of a false crime Lewandowski says he's under no obligation to speak truthfully to the media MORE (D-N.Y.) said recently while announcing a new “impeachment inquiry.”\n\n“Our investigation is not only about obstruction. Our work must also extend beyond the four corners of the Mueller Report. We have a responsibility to consider allegations of federal election crimes, self-dealing, violations of the Constitution’s Emoluments Clause, and a failure to defend our nation from future attacks by foreign adversaries,” he continued.\n\nA Mueller do-over won’t yield different results, no matter how many statements Nadler makers.\n\nWhich brings us to this week.\n\nAfter The New York Times ran a story with a “new” sexual misconduct allegation against Supreme Court Justice Brett Kavanaugh Brett Michael KavanaughPelosi: Lewandowski should have been held in contempt 'right then and there' Kavanaugh book authors dismayed about Democrats 'rush to judgment' on impeachment calls Clinton celebrates first visibly pregnant CEO to be on business magazine cover MORE, Democrats wasted no time calling for his impeachment. Those running for president were especially fast in doing so.\n\n“I sat through those hearings. Brett Kavanaugh lied to the U.S. Senate and most importantly to the American people. He was put on the Court through a sham process and his place on the Court is an insult to the pursuit of truth and justice. He must be impeached,” Sen. Kalama Harris (D-Calif.) said.\n\n“Brett Kavanaugh’s confirmation should have never happened in the first place. It was the result of a broken process designed by Senate Republicans to brush aside deeply troubling and credible allegations,” Sen. Cory Booker Cory Anthony BookerBiden lead shrinks, Sanders and Warren close gap: poll Media and candidates should be ashamed that they don't talk about obesity CNN announces details for LGBTQ town hall MORE (D-N.J.) piled on. “This new allegation and additional corroborating evidence adds to a long list of reasons why Brett Kavanaugh should not be a Supreme Court justice. I stand with survivors and countless other Americans in calling for impeachment proceedings to begin.”\n\n“Last year the Kavanaugh nomination was rammed through the Senate without a thorough examination of the allegations against him. Confirmation is not exoneration, and these newest revelations are disturbing. Like the man who appointed him, Kavanaugh should be impeached.,” Sen. Elizabeth Warren Elizabeth Ann WarrenBiden lead shrinks, Sanders and Warren close gap: poll Defense bill talks set to start amid wall fight Biden allies: Warren is taking a bite out of his electability argument MORE (D-Mass.) added.\n\nBut after running the story for 24 hours, the Times issued a correction and noted that the woman in question doesn’t remember the incident.\n\n“An earlier version of this article, which was adapted from a forthcoming book, did not include one element of the book’s account regarding an assertion by a Yale classmate that friends of Brett Kavanaugh pushed his penis into the hand of a female student at a drunken dorm party,” an editor’s note states. “The book reports that the female student declined to be interviewed and friends say that she does not recall the incident. That information has been added to the article.”\n\nNo recollection of an incident means there is no victim. With no victim, there isn’t a story. Regardless, because Kavanaugh was appointed to the Supreme Court by President Trump Donald John TrumpTrump conversation with foreign leader part of complaint that led to standoff between intel chief, Congress: report Pelosi: Lewandowski should have been held in contempt 'right then and there' Trump to withdraw FEMA chief nominee: report MORE, he must be destroyed.\n\nDemocrats and again their allies in the media, conveniently ignore the facts of Kavanaugh’s confirmation process and the investigations surrounding the hearings.\n\nThe Senate Judiciary Committee, stocked with investigators from both sides of the political aisle, released a 400-page report in November 2018. In it, investigators explain how multiple accusations against Kavanaugh were investigated, who they interviewed and whether evidence or corroboration verified the claims against him.\n\n“After an extensive investigation that included the thorough review of all potentially credible evidence submitted and interviews of more than 40 individuals with information relating to the allegations, including classmates and friends of all those involved, Committee investigators found no witness who could provide any verifiable evidence to support any of the allegations brought against Justice Kavanaugh,” the report states. “In other words, following the separate and extensive investigations by both the Committee and the FBI, there was no evidence to substantiate any of the claims of sexual assault made against Justice Kavanaugh.”\n\nThese are the facts on Kavanaugh. They will not change.\n\nThere have been endless investigations into all things Trump, whether it’s his bogus connection to Russia or his appointment of Brett Kavanaugh to the Supreme Court. We have the results and because they aren’t what Democrats want, they’re only interested in partisan, smear ridden do-overs.\n\nPavlich is the editor for Townhall.com and a Fox News contributor.", "description": "When Donald Trump was elected President of the United States on Nov. 7, 2016, it came as a shock to the country.", "authors": [], "top_image": "https://thehill.com/sites/default/files/pavlich_illustration_thehill.jpg", "published_at": "2019-09-17"}