{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7555829/England-boss-Gareth-Southgate-Mason-Mount-England-debut-against-Czech-Republic.html", "downloaded_at": "2019-10-10 00:10:10.191267+00:00", "title": "England boss Gareth Southgate may give Mason Mount his full England debut against Czech Republic", "language": "en", "text": "Gareth Southgate is considering handing Mason Mount his full England debut on Friday at the expense of Chelsea team-mate Ross Barkley.\n\nHaving replaced Barkley in the Blues midfield, Mount is now pushing hard to dislodge him from the national team, too.\n\nSportsmail understands Southgate is considering deploying the 20-year-old in the No 10 role for England's Euro 2020 qualifier against Czech Republic in Prague on Friday night.\n\nEngland boss Gareth Southgate trusts in Mason Mount and could start him on Friday night\n\nMount impressed Southgate in his substitute appearances against Bulgaria and Kosovo.\n\nBarkley started ahead of Mount for both of those victories, but has since lost his Chelsea place to the youngster.\n\nMount has started six of Chelsea's games since the last international fixtures, while Barkley has started just twice, against Grimsby in the Carabao Cup and Brighton.\n\nMount is understood to be ahead of James Maddison in Southgate's thinking. Leicester playmaker Maddison is carrying a slight injury which has affected his ability to train at St George's Park this week.\n\nThe Chelsea youngster featured as a substitute in qualifiers against Bulgaria and Kosovo\n\nSouthgate used a 4-3-2-1 system in England's previous two games but he has explored the possibility of playing a 4-2-3-1 in training sessions this week.\n\nThis could see Mount play in an advanced central midfield role flanked by Raheem Sterling and either Jadon Sancho or Marcus Rashford. Liverpool's Jordan Henderson and Declan Rice of West Ham would be deployed as the anchormen at the base of midfield.\n\nSouthgate has shown his squad videos of Barcelona as he attempts to impress on the Three Lions the need for a more possession-based style of play.\n\nHe has scored four Premier League goals for Chelsea and is a key man for boss Frank Lampard\n\nTrent Alexander-Arnold, meanwhile, is targeting back-to-back clean sheets in Prague and Sofia to prove that the error-strewn defensive display against Kosovo last month was a one off.\n\nSportsmail reported after the 5-3 victory at St Mary's last month that England players would hold a summit to address the problems that marred a vibrant attacking display and the Liverpool defender confirmed that the meeting is necessary.\n\nHe shows a smile in training alongside defender Tyrone Mings and midfielder Declan Rice\n\nMount has already taken Ross Barkley's place at Chelsea and now has his sights set on England\n\n'We analyse our games and know what is going right and what is not,' said Alexander-Arnold, who is vying with Atletico Madrid's Kieran Trippier for the right back position.\n\n'We have not had the meeting yet but we will have it to make sure (the mistakes) do not happen again. We were not happy with the goals we conceded against Kosovo and we need to work on it.'", "description": "Sportsmail understands Southgate is considering deploying the 20-year-old in the No 10 role for England's Euro 2020 qualifier against Czech Republic in Prague on Friday night.", "authors": ["Sami Mokbel For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/20/19506548-0-image-a-54_1570648066755.jpg", "published_at": "2019-10-09"}