{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/university-apologizes-for-touting-diverse-student-body-with-video-of-all-white-students-154657545.html", "downloaded_at": "2019-10-02 00:34:27.593554+00:00", "title": "University apologizes for touting diverse student body with video of all-white students", "language": "en", "text": "The University of Wisconsin-Madison has issued an apology after its homecoming committee touted the diversity of the student body in a video featuring almost exclusively white students on campus.\n\nThe student-created video, which was released on Facebook this Sunday (and has since been deleted), became the target of criticism on social media immediately when students pointed out that the “underrepresented populations” mentioned had been left out of the feature entirely. “We represent 127 countries and all 50 states,” the video’s narrator says as an all-white marching band appears. “We have broken barriers, made changes and can say that home is forever and always where we are.”\n\nPayton Wade, a senior at the university, tells Yahoo Lifestyle that she was “shocked” to see the lack of representation of students of color — especially after the committee had filmed a lengthy segment with her historically black sorority, Epsilon Delta Chapter of Alpha Kappa Alpha Sorority.\n\n“Someone within the homecoming committee sent an email to our president, and they just asked us to send in a few words of what we think ‘home’ is when we think of UW,” Wade says, before explaining that she and her sorority sisters dedicated over an hour of their time to film for the project. “They just told us that we would be in the larger video and they would let us know once everything’s done and send us the footage. And then that’s when one of my friends sent us the link to the video and we realized not only were we not in it, but there were no students of color in it, really at all.”\n\nWade took to both Facebook and Twitter to express her disappointment, posting a recording of the since-deleted video itself.\n\nAs if being on a campus where you are unwanted and have to fight every day just to survive and make it isn’t bad enough @UWMadison is back at it again reminding us that we don’t belong here and that there is no room for Black students here. #SurvivingUW #HomeIsWhite #TheRealUW pic.twitter.com/7dTzAs4TRm — 👑 Payton 👑 (@payton_renee_) September 30, 2019\n\nHere is the video the @UWMadison homecoming committee posted pic.twitter.com/5rSbf4wgE9 — 👑 Payton 👑 (@payton_renee_) September 30, 2019\n\n“Being Black at this school is a daily struggle both mentally and physically,” she wrote on Facebook. “It is hard to have pride for a school where you know you are not wanted and where they obviously do not consider this our home as well. I am disappointed in this university once again, but I am not surprised.”\n\nWade explains that she considered transferring out of UW-Madison her freshman year after experiencing micro-aggressions in her dorm. She even had one encounter with a resident assistant there who told her, “If you want to keep living here, you’re gonna have to get it together. I know people like you are loud.”\n\nA 2015 graduate, Anthony Wright — who also posted about the video on Twitter — tells Yahoo Lifestyle that he’s in disbelief to see the problems he faced years ago persisting. “Marginalized students are still fighting to have their UW experience included in the story of the university,” Wright says. “The fact that the university gave this group the chance to be a part of this story and chose to not feature it for whatever reason, is counter to the diverse and inclusive narrative it pushes.”\n\nThe Wisconsin homecoming committee posted an apology to its Facebook page on Monday evening. In it, the committee took responsibility for the images that were omitted from the final feature.\n\n\n\n\n\nThe Wisconsin Alumni Association, which sponsors the student committee, also addressed the video with a statement that reads: “We apologize that the video produced by the committee gave only a partial representation of the UW-Madison student body. WAA is deeply committed to diversity and inclusion and will listen to our student, alumni, and campus partners on ways to move forward.”\n\nThe university also published an apology to both students and alumni for the pain caused by the video.\n\n“We know that, both historically and today, students of color and other under-represented groups do not feel as welcome on our campus as majority students. As a community, we must commit to and invest in ways to change this. One important way is to ensure active participation and authentic involvement by Badgers of many different identities in all aspects of campus life. Unfortunately, as the student Homecoming Committee and the Wisconsin Alumni Association have acknowledged, a student video promoting Homecoming failed to do this,” the statement reads in part.", "description": "Students of color at the University of Wisconsin-Madison are speaking out about being excluded from a video touting a diverse student body.", "authors": ["Kerry Justich"], "top_image": "https://s.yimg.com/uu/api/res/1.2/mbyKeRuCUdd1YlnEtpVjog--~B/aD0xMTU0O3c9MTM4MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-10/911dc070-e455-11e9-b7b1-2ab5a491b1bc", "published_at": "2019-10-01"}