{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/scottish-court-rejects-bid-force-uk-pm-seek-brexit-delay-191007135507791.html", "downloaded_at": "2019-10-07 20:05:38.169410+00:00", "title": "Scottish court rejects bid to force UK PM to seek Brexit delay", "language": "en", "text": "A Scottish court has rejected a bid by campaigners seeking an order to force British Prime Minister Boris Johnson to ask for a Brexit delay if he has not struck a deal with the European Union in less than two weeks time.\n\nThe court on Monday concluded there was no need to take any pre-emptive action against Johnson because he had given legal assurances that he would abide by a law compelling him to ask the EU for an extension if no divorce deal had been agreed.\n\n\"The government accepts that in executing its political policy it must comply with the 2019 Act,\" the judge, Paul Cullen, said in his ruling.\n\n\"That being the government's clearly stated position before the court, there is no need for coercive orders against it or against the prime minister to be pronounced.\"\n\n191002144925437\n\nLast month, the United Kingdom's Parliament passed legislation, known as the \"Benn Act\", which requires Johnson to send a letter to the EU asking for a delay if he fails to agree to a deal by October 19 unless he has legislators' approval to leave without any agreement.\n\nWith the clock ticking down to Britain's departure on October 31, Johnson has consistently said he will not ask for a Brexit delay and that he would rather be \"dead in a ditch\" than seek any further extension.\n\nBut he has also said he will not break a law that forces him to request one if no withdrawal agreement deal has been agreed without explaining that apparent contradiction.\n\nAppeal forthcoming\n\nAnti-Brexit campaigners, who believe Johnson will use a legal loophole or send a second letter, threatening to sabotage EU processes if they grant a Brexit delay, asked Scotland's Outer House of the Court of Session to issue an order compelling him to comply with the Benn Act.\n\nBut the judge said assurances given by the government's top legal officer in Scotland not to frustrate the Benn Act meant it was unnecessary to do so.\n\n181201182945771\n\n\"The Advocate General has set out clearly and unequivocally the Prime Minister's intention to comply with his statutory duties,\" he said.\n\n\"This has been done so by way of detailed and specific averments in written pleadings put before the court on the professional responsibility of those acting for the Prime Minister and the government.\"\n\nHe said \"extrajudicial\" statements could not be taken as \"conclusive statements of the government's understanding of its legal obligations\".\n\nLawyer Jo Maugham, one of the campaigners who sought the order, said they expected Scotland's highest court to hear their appeal on Tuesday.", "description": "Anti-Brexit campaigners to appeal Scottish court ruling as Britain's October 31 European Union departure date nears.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/9/24/5b87e6fa712e4a248dc4a05946acd639_18.jpg", "published_at": "2019-10-07"}