{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/formulaone/article-7520927/Helmut-Marko-insists-Vettel-no-future-Ferrari-following-Russian-Grand-Prix-fiasco.html", "downloaded_at": "2019-10-05 08:46:03.911930+00:00", "title": "Helmut Marko insists Vettel has no future with Ferrari following Russian Grand Prix fiasco", "language": "en", "text": "Sebastian Vettel has been told by the man who discovered him that his Ferrari career is over.\n\nHelmut Marko, motor sport adviser to Red Bull, guided the German through the junior ranks, handing him his Toro Rosso debut in 2007 before overseeing his four consecutive world titles at the start of the decade.\n\nLike most observers at last Sunday's Russian Grand Prix, Marko was taken aback by how Vettel was embarrassed by Ferrari.\n\nSebastian Vettel (right) stares at Ferrari team-mate Charles Leclerc in Sochi\n\nDespite earning £37million a year and supposedly being the Scuderia's No 1 driver, Vettel was told pre-race that if he jumped from third to first at the start he must hand the lead back to team-mate Charles Leclerc.\n\nThe 21-year-old Leclerc is the rising star with six poles and two wins this season but it is almost unbelievable that Ferrari would effectively prevent Vettel from winning so that that the junior man might. In the end, Hamilton took the victory after Vettel's engine failed and Ferrari kept pointing the gun at their own feet.\n\nMarko, who has previously backed Vettel to rekindle his form and career, said: 'Ferrari managed not to win despite having the fastest cars. And although he was the faster man, they sacrificed Sebastian. He has no future at Ferrari anymore.'\n\nHelmut Marko (right) discovered Vettel and has now said his prodigy has no future at Ferrari\n\nThe team's strategy in Russia favoured junior driver Charles Leclerc, not the former champion\n\nVettel, 32, has won just once in the last 13 months. He is contracted until the end of 2020 but it is now a question of whether his position is tenable or bearable. If he decided to quit, or Ferrari decided to push him, his deal could be paid out.\n\nJacques Villeneuve, champion in 1997, said: 'Vettel set his car up for the race and was much faster. Now Ferrari have a serious problem.\n\n'They didn't have to tell Vettel to return the place like that. They then spent the rest of the race thinking how to put Leclerc back in front. Karma punished them in the end. Vettel was faster and deserved to stay ahead.'\n\nAlthough Vettel has appeared out of sorts for a while, on Sunday night he wafted away the notion he would retire from the sport.\n\nThere have been suggestions that he might return to Red Bull, where he won his titles, but team principal Christian Horner has said that chapter has closed.", "description": "JONATHAN MCEVOY IN SOCHI: Sebastian Vettel has been told by the man who discovered him that his Ferrari career is over. Helmut Marko handed the German his debut with Toro Rosso in 2007.", "authors": ["Jonathan Mcevoy For Mailonine"], "top_image": "https://i.dailymail.co.uk/1s/2019/09/30/16/19113440-0-image-a-10_1569856940245.jpg", "published_at": "2019-09-30"}