{"pub": "yahoo", "url": "https://finance.yahoo.com/news/warren-releases-plan-benefit-unions-150805074.html", "downloaded_at": "2019-10-04 02:51:16.211651+00:00", "title": "Warren releases plan to benefit unions, eliminate 'right-to-work' states", "language": "en", "text": "Democratic presidential candidate Elizabeth Warren rolled out a plan she described as \"the most progressive and comprehensive agenda for workers since the New Deal\" on Thursday.\n\n\"We cannot have a truly democratic society with so little power in the hands of working people. We cannot have sustained and inclusive economic growth without a stronger labor movement,\" Warren wrote on her website. \"That's why returning power to working people will be the overarching goal of my presidency.\"\n\nWarren's far-reaching plan encompasses unions, a $15-an-hour federal minimum wage, rights for domestic workers and other topics. She promised to use \"bold executive action\" to accomplish her plan and pledged to only nominate Supreme Court justices who are advocates for workers.\n\nMuch of Warren's plan focuses on \"reversing the steady decline in union membership.\" If elected, she promised to prohibit states from enacting \"right-to-work\" laws for allowing employees to opt out of unions.\n\nWarren also addressed a big criticism of Medicare-for-all in Thursday's rollout. Many union members are happy with the health care status quo since their employers pay a huge percentage of their coverage costs. Warren claimed enacting Medicare-for-all would give unions more power.\n\n\"But in every contract negotiation that unions and employers pursue, the unchecked cost of health insurance threatens to consume the agenda and crowd out progress on other important issues like wage increases or enhanced retirement security. Medicare for All will break this pattern,\" she wrote.\n\nIn addition, Warren pledged to:\n\nGrant graduate students the ability to unionize and be treated as \"employees\"\n\nPush for more workers to be classified as \"employees,\" rather than \"independent contractors,\" granting them more rights\n\nPass the Domestic Workers Bill of Rights and the Fairness for Farm Workers Act\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nRelated Articles", "description": "Elizabeth Warren's far-reaching plan encompasses unions, a $15-an-hour federal minimum wage, rights for domestic workers and other topics.", "authors": ["Evie Fordham"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-03"}