{"pub": "cbs", "url": "https://cbsnews.com/news/afghanistan-war-why-us-troops-still-killed-how-much-taliban-territory-charlie-dagata-2019-09-19", "downloaded_at": "2019-09-19 23:09:06.832391+00:00", "title": "What is going on with the war in Afghanistan?", "language": "en", "text": "Kabul — Afghanistan is officially the most dangerous country in the world. That's according to the Institute for Economics and Peace's annual report. It just edged out Syria this year. From inside the country, you don't need statistics to tell you how dangerous Afghanistan is.\n\nThe day we arrived we drove past the scorched ground where a suicide bomber had just killed a U.S. soldier and 12 others, derailing the Taliban peace talks we'd come to report on.\n\nPresident Trump recently said that between the U.S.-led coalition and the Afghan military, \"we've hit our enemies harder than they have ever been hit before.\"\n\nGreen Beret's death in Afghanistan comes amid increased Taliban violence\n\nOn Tuesday the U.S. military announced that yet another American service member had been killed in action. There are still about 14,000 American forces in Afghanistan, and this year has already been the deadliest for them since the troop surge of 2014. Twin bombings on the same day left at least 48 other people dead, mostly civilians.\n\nThursday morning, another Taliban suicide bomb levelled a hospital in southern Afghanistan, killing dozens of civilians.\n\nLocal officials in the eastern province of Nangarhar, meanwhile, blamed the death of at least nine civilians, who were reportedly out harvesting pine nuts, on a U.S. \"precision\" airstrike. The U.S. military said it was investigating the claims of civilian casualties.\n\nMen carry a coffin of one of the victims of a drone strike, in Khogyani district of Nangarhar province, Afghanistan, September 19, 2019. REUTERS\n\nThe Taliban can move freely in more areas of Afghanistan than at any point since the U.S.-led invasion in 2001. It's not quite the same as saying the Taliban \"controls\" more territory. But more on that later.\n\nSo what's the deal?\n\nMetrics can be a murky business here in Afghanistan, which is why the U.S. military stopped counting months ago, a move criticized by the special U.S. inspector general at the time as \"like turning off the scoreboard at a football game.\"\n\n\"This year has been a total offensive for us,\" Afghan National Security Advisor Hamdullah Mohib told us this month. \"It has been one of the toughest fights of the last two decades.\"\n\nAfghan security officials on the impact of a U.S. withdrawal from Afghanistan\n\nThe Afghan Defense Ministry points to an offensive this week in Paktika, where Afghan forces backed by U.S. airstrikes resulted in the deaths of two provincial Taliban political leaders (\"shadow\" governors) and \"at least 85 Taliban fighters.\"\n\nBut the Afghan military can be just as prone to exaggeration as the Taliban.\n\n\"You know, I wouldn't term casualties alone as a measure of success,\" Mohib said. \"I think what's important is the Taliban are losing their narrative in Afghanistan. If there was a reason why they were fighting in the country, that no longer exists. They're fighting for power, and that doesn't attract a lot of support from any indigenous population.\"\n\nThe Taliban has justified its intensified campaign of violence as a sort of \"hurry up offense,\" a power and territory grab in order to gain leverage in the peace talks with the U.S., which President Trump just declared \"dead.\"\n\nAs for the Taliban \"controlling\" more territory than before the U.S. invasion, it depends on the definition of the word.\n\nSenior U.S. and Afghan military officials tell CBS News there has been a significant shift in strategy in the past nine months. Instead of setting up Afghan military checkpoints in areas dominated by Taliban fighters and with local populations sympathetic to them, and often in more rural areas, the decision has been made to pull forces back into the protection afforded by military bases.\n\nA U.S. officer described the checkpoints as \"sitting ducks.\"\n\nDefense officials say the move has resulted in lower Afghan military casualties in recent months. But of course, it also gives Taliban fighters the freedom to move around these areas as they wish. So are those \"Taliban-controlled\" areas? It depends who you ask.\n\nAsadullah Khalid says U.S. and Afghan troops are coordinating better than ever\n\nBut Defense Minister Asadullah Khalid says the tactic has paid off: For the first time in recent years, he says, the Taliban have suffered significantly more casualties than Afghan security forces.\n\nThe U.S. role\n\nSo where does that leave the prospect of a U.S. troop drawdown?\n\nAt 35 years old, U.S.-trained General Khoshal Sadat is the highest-ranking police official in Afghanistan. He describes the U.S. presence as \"critical, but mutually important\" if the goal is to hunt down and disable terrorist organizations operating on Afghan soil.\n\n\"Al Qaeda originated from here, and we still have remnants of al Qaeda in certain pockets of the country,\" Sadat told CBS News. \"We also see ISIS, and we have seen ISIS connections to the rest of the world.\"\n\nAfghan security chief warns of ISIS \"connections\" in U.S.\n\nHe says up the most important contributions the U.S. forces bring to the fight are \"air power and intelligence.\"\n\n\"It will be hard (if U.S. forces leave),\" he said. \"We will have to make serious decisions on where we want to consolidate our efforts.\"\n\nThe government of President Ashraf Ghani has been deeply critical of the U.S. talks with the Taliban, saying a deal with the terrorist organization that includes a drawdown of U.S. forces would be seen \"as a surrender.\"\n\nBut Mohib told us the Afghan military has been preparing contingency plans for an eventual U.S. withdrawal.\n\n\"It would put a lot of pressure on our country if there was a decision to withdraw troops without giving us time to prepare for it,\" he said. \"I think we both have invested in this partnership… any precipitous withdrawal would not be beneficial to either country.\"\n\nMeanwhile, Afghanistan is heading into a perilous period. The country is due to hold presidential elections on September 28. The Taliban has already issued death threats to school teachers and staff, warning they will be considered legitimate targets if they allow their schools to be used as polling stations.\n\nThey don't exactly seem to be the words of men who, as they claim, are open to resuming real peace talks with the U.S. Negotiators have been shuttling to countries like Russia and Iran in an effort to resuscitate talks in recent days.\n\nBut with no vision of peace on the horizon, for now, for both sides, it's war.", "description": "Trump says \"we've hit our enemies harder\" than ever, but this is the deadliest year for U.S. troops since 2014, and it's unclear when they might come home", "authors": ["Charlie D'Agata"], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/19/3c3cae35-7d72-4d55-9edf-b7d4a372b9cd/thumbnail/1200x630/8337715fb89a63139a62bb7efb33e32f/afghanistan-us-drone-strike.jpg", "published_at": "2019-09-19"}