{"pub": "wsj", "url": "https://wsj.com/articles/the-future-of-work-a-tale-of-multiple-americas-01568990900?mod=rsswn", "downloaded_at": "2019-09-20 22:55:47.471423+00:00", "title": "The Future of Work: A Tale of Multiple Americas", "language": "en", "text": "A forklift operator works to replenish the wine and spirits supply at Southern Wine and Spirits in Lakeland, Fla., Jan. 31, 2019. Photo: Scott McIntyre for The Wall Street Journal\n\nThe U.S. economy looks good by almost any measure. Unemployment is at historical lows. There are more job openings than unemployed people to fill them. Inflation remains low. A number of recent studies have concluded that over the next decade, the economy will create new occupations that will more than offset declines in jobs displaced by automation.\n\nWhy then are so many Americans so anxious about the future? Why do they feel left behind?\n\nA recent McKinsey & Co. report sheds light on these questions, presenting a detailed analysis of more than 3,000 U.S. counties and over 300 cities.\n\nThe study found that while the country is doing well in aggregate, there are essentially multiple Americas, some of which are doing quite well, while others risk falling further behind.\n\nDiverging trajectories\n\nMcKinsey used a mathematical clustering method to categorize U.S. cities and counties based on economic factors. The analysis revealed five distinct segments:\n\nUrban core. Twelve megacities, (such as New York, San Francisco, Boston, Atlanta, Miami) and 13 high-growth hubs, (San Jose, Seattle, Austin, Orlando, Raleigh) account for roughly 30% of the U.S. population. These are the nation’s most dynamic places, but they also have high levels of income inequality and affordable-housing shortages.\n\nUrban periphery. Home to 16% of the U.S. population, these are the extended suburbs of large metropolitan areas (such as Arlington, Va.; Riverside, Calif.; Bergen, N.J.).\n\nNiche cities. With 6% of the population, these include towns with major research universities (such as Ann Arbor, Mich.; Boulder, Colo.; Ithaca, N.Y.); fast-growing retirement communities, (Naples, Fla.; Hilton Head, S.C.; Prescott, Ariz.); and small technology and industrial clusters that offer a high quality of life at lower costs (Boise, Idaho; Reno, Nev.; Des Moines, Iowa; Charleston, S.C.).\n\nMixed middle. With almost a quarter of the population, these include midsize stable cities (such as Cleveland, St. Louis, Jacksonville, San Diego, Pittsburgh); smaller municipalities (Chattanooga, Tenn.; Burlington, Vt.; Little Rock, Ark.); and manufacturing hubs (Green Bay, Wis.; Logan, Utah; Tuscaloosa, Ala.). These cities aren't in distress but have slower growth, higher unemployment, and somewhat lower educational attainment than urban and niche cities. Some are on an upward trajectory, while others are in decline.\n\nLow-growth and rural areas. With 25% of the population, this group includes 54 trailing cities and more than 2,000 rural counties. Some are former industrial cities, (such as Flint, Mich.; Bridgeport, Conn.; Binghamton, N.Y.). These places have higher unemployment, lower educational attainment and older populations than the national average, and include some truly distressed areas.\n\nAutomation won't be felt evenly\n\nMcKinsey’s previous research found that while less than 5% of occupations will be entirely automated by 2030, 60% of jobs will be transformed through the automation of a significant fraction of their component tasks. Under most scenarios, there will be enough work to maintain full employment over the next decade, but workers will need to adapt as machines take over routine tasks and demand grows for work involving qualities that machines can't replicate. These transitions will be very challenging, especially for workers in communities whose local economies may not have the momentum to offset automation-related displacements.\n\nIn the past, economic divergence prompted people to move from distressed areas to those with stronger job markets. But geographic mobility is at historic lows. In 1990, 6.1% of Americans moved between counties or states; in 2017, only 3.6% did so. “Differentials in the cost of living, ties with family and friends, and a growing cultural divide all partially explain these patterns, but more research is needed to understand these patterns,” the report said.\n\nLocal economies could continue to diverge\n\nNet job growth through 2030 will likely be concentrated in urban areas, while much of the country may see little employment growth or even lose jobs. “The 25 megacities and high-growth hubs, plus their peripheries, may account for about 60 percent of net job growth by 2030, although they have just 44 percent of the population,” the report said. Rural counties, which account for 20% of jobs today, could see a decade of very low or even negative net job growth.\n\nLess-educated workers are most likely to be displaced\n\n“Individuals with a high school degree or less are four times more likely to hold highly automatable roles than those with bachelor’s degrees,\" according to the report. \"Given educational disparities, Hispanic and African-American workers may be hit hardest, with 12 million displaced. Nearly 15 million jobs held by young people could be lost, raising questions about career pathways. Workers over age 50 hold an additional 11.5 million at-risk jobs. The share of middle-wage jobs may shrink as growth concentrates at the high and low ends of the wage scale.”\n\nCharting a new course\n\nWhile each community must set its own agenda based on local economic conditions, the report concludes with a few key suggestions:\n\nConnect workers with new opportunities. This will help workers, especially those who need to switch jobs, pursue a different occupation or move to a new location.\n\nRetrain workers and providing lifelong learning. “The old model of front-loading education early in life needs to give way to lifelong learning. Training and education can no longer end when workers are in their twenties and carry them through the decades. Employers will be the natural providers of training and continuous learning opportunities for many workers.”\n\nStrengthen the social safety net. Governments need to help support workers as they transition between jobs. That can take many forms, including more flexible income support programs during periods of unemployment, relocation assistance, training grants and earned income tax credits. Portable benefits tied to the worker rather than the employer can help workers who need to switch jobs as well as the self-employed.\n\nIrving Wladawsky-Berger worked at IBM from 1970 to 2007, and has been a strategic adviser to Citigroup, HBO and Mastercard and a visiting professor at Imperial College. He's been affiliated with MIT since 2005, and is a regular contributor to CIO Journal.", "description": "The U.S. economy looks good by almost any measure. A number of recent studies have concluded that over the next decade, the economy will create new occupations that will more than offset declines in jobs displaced by automation. Why then are so many Americans so anxious about the future?", "authors": ["Irving Wladawsky-Berger"], "top_image": "https://images.wsj.net/im-109210", "published_at": "2019-09-20"}