{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7576735/Todd-Chrisley-suing-Georgia-tax-officials-claiming-one-relationship-daughter-smear-him.html", "downloaded_at": "2019-10-16 00:27:40.257220+00:00", "title": "Todd Chrisley suing Georgia tax officials claiming one had a relationship with daughter to smear him", "language": "en", "text": "Reality television personalities Todd and Julie Chrisley have accused a Georgia tax official of abusing his office to pursue 'bogus tax evasion claims' against them.\n\nThe Chrisley Knows Best stars filed a federal lawsuit Tuesday against Joshua Waites, the director of the Georgia Department of Revenue's office of special investigations, according to a statement from a spokesman for the couple.\n\nA text message obtained by TMZ from a contact labelled 'Josh' reads: 'So. Some stuff happened today. And we have a meeting the first of the year that is super big.\n\n'And is all about Todd. Like serious. So. I want to know if you would be willing to talk about him or her.'\n\nA Department of Revenue spokesman called the lawsuit 'unfounded' on Tuesday.\n\nTodd and Julie Chrisley on Tuesday sued the director of the Georgia Department of Revenue's office of special investigations, claiming he started a relationship with their daughter Lindsie as part of a smear campaign against\n\nLawsuit accuses Georgia tax official, Joshua Waites, of abusing his office to pursue 'bogus tax evasion claims' against them\n\nAlleges Waites disclosed private tax information of Michael & Julie Chrisley to their estranged daughter to get information from her pic.twitter.com/8HNfxw5frQ — Justin Gray (@JustinGrayWSB) October 15, 2019\n\nSpokesman William Gaston said in an email that he couldn't comment on the specifics of any investigation, settlement or pending litigation.\n\nThe lawsuit calls Waites an 'out-of-control public servant' who has used his position to 'violate the rights of innocent citizens for reasons that have more to do with securing publicity and money for his office than with enforcing the law.'\n\nWaites targeted the real estate mogul's estranged daughter, Lindsie Chrisley Campbell, and improperly shared confidential tax information to try to get compromising information on the family, the lawsuit alleges.\n\nIn another text massage, allegedly between Chrisley and the tax official, 'Josh' says: 'They are gonna need a different attorney than they are used to.'\n\nAfter receiving messages reading: 'This is just really bad' and 'I might be sick', the 'Josh' contact replies: 'You knew this day may come.'\n\nLindsie has been married to Will Campbell since 2012 but her father has alleged she cheated on Will with reality stars Robby Hayes and Josh Murray. Todd has said he found his daughter's elopement 'disrespectful'.\n\nHe also expressed disappointment when he found out his daughter was four months pregnant. Lindsie has a six-year-old son named Jackson.\n\nFormer Attorney General Mike Bowers is suing GA Dept of Revenue Investigstor Josh Waites individually on behalf of the Chrisley family in federal court - calling him “a rouge” - alleging illegally revealed the Chrisley’s income tax information pic.twitter.com/lMgsdwYBZN — Justin Gray (@JustinGrayWSB) October 15, 2019\n\nPerson sending iMessages, alleged to be Lindsie, who is married to Will Campbell (center) allegedly messaged the tax official about her son: 'I don't want Jackson to see or hear anything'\n\nLindsie and Will split for a year until January 2018.\n\nThe person sending iMessages, alleged to be Lindsie, then replies stating they have not been able to fall asleep at night until after 5am and writes: 'I don't want Jackson to see or hear anything.'\n\nChrisley Knows Best follows the tightknit, boisterous family living in Nashville. Much of the series emphasizes Todd Chrisley's obsessive yet comedic efforts to keep tabs on three of his kids, two of whom are in their 20s, and his mother. The family moved to Tennessee from the Atlanta area a few years ago.\n\n'It's a blessing I don't travel to Nashville anymore,' the message thread continues.\n\nThe series has aired on USA for seven seasons and recently premiered a spinoff called 'Growing Up Chrisley,' featuring his kids Chase and Savannah, who move to Los Angeles. Todd Chrisley also briefly hosted a talk show, 'According to Chrisley,' for the network. Todd, 51, and Julie Chrisley, 46, also have a podcast called 'Chrisley Confessions.'\n\nSeparately, the Chrisleys were indicted in August on federal charges of tax evasion, conspiracy, bank fraud and wire fraud. They have pleaded not guilty.\n\nThe couple said the 'bogus' claims cost them $150,000 to settle in the agreement which credited them with tax refunds for some tax years and said they owed nothing in others\n\n'The IRS completed their audit for the criminal side and then turned over the returns to us so we could bill them as well,' other messages from 'Josh' read. 'The Feds are pushing it because they are saying the 75 million deal is for real, including a show for your grandma. By herself.'\n\nAs a result of Waites alleged efforts, which ultimately failed, the Chrisleys were forced to 'incur substantial personal and financial hardship,' the suit says.\n\nThe lawsuit asks for a jury trial and seeks compensatory and punitive damages, as well as reimbursement for legal costs.\n\nThe Chrisleys last month reached an agreement to settle allegations that they failed to pay hundreds of thousands of dollars in state income taxes.\n\nThe agreement signed September 27 credited them with tax refunds for some tax years and said they owed nothing in others.\n\nAccording to the settlement, the Chrisleys agreed to pay a little under $150,000 to resolve the claims.\n\nDepartment of Revenue spokesman Gaston added Tuesday: 'Our investigators are fair and impartial in their work with a commitment to ensuring compliance with the law,' he wrote. 'This development is disappointing and their accusations are unfounded, but we will decline to provide any further comment on this matter.'", "description": "Reality television personalities Todd and Julie Chrisley in a Tuesday lawsuit accused Georgia tax official, Joshua Waites, of abusing his office to pursue 'bogus tax evasion claims' against them.", "authors": ["Leah Simpson For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/20/19756676-0-image-a-61_1571168567819.jpg", "published_at": "2019-10-15"}