{"pub": "cnn", "url": "https://bleacherreport.com/articles/2857537-padres-prospect-jacob-nix-arrested-tased-after-alleged-trespassing-via-dog-door?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-10-11 00:23:55.643531+00:00", "title": "Padres Prospect Jacob Nix Arrested, Tased After Alleged Trespassing Via Dog Door", "language": "en", "text": "Charlie Riedel/Associated Press\n\nSan Diego Padres prospect Jacob Nix was arrested after attempting to enter a house in Peoria, Arizona, through the doggy door, according to Joe Enea of ABC15 Arizona.\n\nThe homeowner reportedly kicked Nix in the face as he attempted entry, and the prospect was pulled out of the doggy door by 23-year-old Thomas Cosgrove. The homeowner then tased Nix as he attempted to flee the scene.\n\nBoth Nix and Cosgrove were arrested a few streets away from the house. The Padres prospect was charged with criminal trespassing.\n\nThe Padres released the following statement:\n\n\"We are aware of the alleged incident involving Jacob Nix last Sunday in Arizona. We take this matter seriously and have been in contact with the Commissioner's office and local authorities. Due to the ongoing legal proceedings, we will not have any further comment at this time.\"\n\nNix, 23, and Cosgrove are both pitchers in San Diego's farm system. Nix made nine starts for the Padres in the 2018 season, going 2-5 with a 7.02 ERA, 1.53 WHIP and 21 strikeouts in 42.1 innings. He spent the 2019 season in the minor leagues while recovering from an elbow injury. He also made one start in the Arizona Fall League.\n\nCosgrove, meanwhile, spent the 2019 season with the A+ Lake Elsinore Storm. It is unclear if he faces any charges in the incident.", "description": "San Diego Padres  prospect  Jacob Nix  was arrested after attempting to enter a house in Peoria, Arizona, through the doggy door, according to  Joe Enea  of ABC15 Arizona...", "authors": ["Timothy Rapp"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/832/440/hi-res-cbf04bb2550c7540b7a6d9801ac922b6_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-10-10"}