{"pub": "arirang", "url": "https://arirang.com/News/News_View.asp?nseq=245822", "downloaded_at": "2019-10-16 23:13:05.887478+00:00", "title": "News View :: The World On Arirang", "language": "en", "text": "In a press conference on Wednesday, organizers said that peace will indeed be a key topic at the summit.Although there are only 40 days left until the event, and although no official statement has been released regarding Kim's possible participation, many are saying there is still time for any last minute development.\"We continue to believe that if Chairman Kim visits, it will be positive for peace and stability on the Korean Peninsula.\"\"All 3-and-a-half million citizens of Busan dearly wish that Chairman Kim visits the city. We still cherish the time when we welcomed and met North Korean athletes and officials during the 2002 Asia Games. And I think the North also has a good image of Busan.\"ASEAN members have continuously supported the Moon administration's drive for peace on the Korean Peninsula.And it has already contributed to dialogue with Pyeongyang the first two historic North Korea-U.S. summits having been held in Singapore and Vietnam, and through the ASEAN Regional Forum, the only security dialogue that involves the North.He also expects President Moon Jae-in and the other leaders to announce a joint declaration at the end of the special summit, regarding ways to advance peace and prosperity on the Korean Peninsula.But organizers of the summit are also working on ways to turn the summit into a festive event for the public.Among such efforts is the ASEAN-Korea Train, carrying people from both South Korea and the ten ASEAN states.Hosted by the foreign ministry and organized by the ASEAN-Korea Centre, the event celebrates the 30 years of bilateral friendship and aims to expand people-to-people partnership.During the three-day journey, the train takes them to some major cities in the country.\"Taking the train from Seoul Station, the 200 guests from Korea and ASEAN nations travelled here, to the southeastern city of Busan, the host city for this special summit -- the largest international event under the Moon Jae-in administration.\"\"All cooperative exchanges begin with the people. The ASEAN-Korea Train lays the foundation that helps the people from the ten ASEAN nations and South Korea understand each other better and build friendship, so that they can work together for a brighter future.\"With the hosting of the South Korea-ASEAN Special Summit back in 2014, and other international conferences including the 2005 Asia-Pacific Economic Cooperation Summit under its belt, Busan is confident it will successfully host the South Korea-ASEAN Special Summit 2019 and step forward as a major pillar of Asia's economy.Park Hee-jun, Arirang News, Busan.", "description": "한국을 대표하는 글로벌 방송! The World On Arirang!", "authors": ["The Korea International Broadcasting Foundation"], "top_image": "http://www.arirang.com/arirang_blue.png", "published_at": "2019-10-16"}