{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/04/1925465/0/en/Lexington-Biosciences-Converts-Amounts-Owed-to-Unsecured-Demand-Loans.html", "downloaded_at": "2019-10-05 05:48:21.587262+00:00", "title": "Lexington Biosciences Converts Amounts Owed to Unsecured Demand Loans", "language": "en", "text": "VANCOUVER, British Columbia, Oct. 04, 2019 (GLOBE NEWSWIRE) -- Lexington Biosciences, Inc. (CSE: LNB) (the “Company” or “Lexington”) announces that it has reached agreement with third parties as well as certain directors and officers (collectively the “lenders”) of the Company to convert previous advances and unpaid amounts for services received of $654,186, in aggregate, into unsecured demand loans bearing interest at 16% per annum. As a result of the interest being applied retroactively to the date the advances or services were made the Company owed these parties $744,203 as at September 30, 2019, which is the aggregate amount of the unsecured demand loans issued.\n\n\n\nIn consideration for the conversion of the advances into unsecured demand loans, the Company will issue a total of 14,880,465 bonus warrants (“Warrants”) to the lenders at a deemed price per share of $0.05. The Warrants will be exercisable for a period of 24 months into common shares of the Company at a price of $0.05 each.\n\nOn Behalf of the Board,\n\n“Eric Willis”\n\nEric Willis\n\nCEO & Director\n\nCAUTIONARY DISCLAIMER STATEMENT: The Canadian Securities Exchange has not reviewed and does not accept responsibility for the adequacy or accuracy of the content of this news release.\n\nCautionary Note Regarding Forward-Looking Statements\n\nThis news release contains forward-looking statements relating to the potential sale of the HeartSentry technology and other statements that are not historical facts. Forward-looking statements are often identified by terms such as \"will\", \"may\", \"should\", \"anticipate\", \"expects\" and similar expressions. All statements other than statements of historical fact, included in this release are forward-looking statements that involve risks and uncertainties. There can be no assurance that such statements will prove to be accurate and actual results and future events could differ materially from those anticipated in such statements. Important factors that could cause actual results to differ materially from the Company's expectations include those relating to the ability to complete the sale and other risks detailed from time to time in the filings made by the Company with securities regulations.\n\nThe reader is cautioned that assumptions used in the preparation of any forward-looking information may prove to be incorrect. Events or circumstances may cause actual results to differ materially from those predicted, as a result of numerous known and unknown risks, uncertainties, and other factors, many of which are beyond the control of the Company. The reader is cautioned not to place undue reliance on any forward-looking information. Such information, although considered reasonable by management at the time of preparation, may prove to be incorrect and actual results may differ materially from those anticipated. Forward-looking statements contained in this news release are expressly qualified by this cautionary statement. The forward-looking statements contained in this news release are made as of the date of this news release and the Company will update or revise publicly any of the included forward- looking statements as expressly required by applicable law.", "description": "", "authors": ["Lexington Biosciences"], "top_image": "http://www.globenewswire.com/Attachment/LogoDisplay/503699?filename=503699.jpg&size=1", "published_at": "2019-10-04"}