{"pub": "yahoo", "url": "https://finance.yahoo.com/news/e-trade-joins-rivals-ending-200504093.html", "downloaded_at": "2019-10-04 03:04:45.723856+00:00", "title": "E*Trade Joins Rivals by Ending Commissions in Race to the Bottom", "language": "en", "text": "(Bloomberg) -- E*Trade Financial Corp. cut trading commissions to zero, joining major rivals in the race to the bottom and setting the stage for mergers among discount brokerages.\n\nThe end to commissions on U.S. listed stock, ETFs and options trades will go into effect Oct. 7, New York-based E*Trade said in a release Wednesday. Its options contract charge will be cut to 65 cents per contract for all traders. E*Trade estimates a loss of approximately $300 million per year in revenue from the drop in commissions.\n\nThe move shows the intensifying competition to lure retail investors who gravitate toward the cheapest offerings. Interactive Brokers Group Inc. in late September announced commission-free trading of U.S.-listed stocks and exchange-traded funds on its IBKR Lite platform. Charles Schwab Corp. and TD Ameritrade Holding Corp. also slashed trading fees to zero on Tuesday. The Schwab announcement sent the shares of all the brokerages plummeting.\n\nShares of TD Ameritrade extended their 3.3% decline in after-hours trading Wednesday.\n\nSince Interactive Brokers announced its commission-free offering, TD Ameritrade shares have fared the worst, losing nearly one-third of their value. E*Trade shares dropped about 20% in the period. Schwab is down about 13% and Interactive Brokers about 9%.\n\nE*Trade was an early disruptor in stock trading, offering retail investors a way to trade online. Amid heightened competition, the company has found itself searching for a way forward, making management changes, and reviewing its business. E*Trade named Michael Pizzi its chief executive officer in August, fueling analyst speculation that the company might be assessing strategic options like a sale.\n\nPossible Merger\n\nAnalysts have long pointed to TD Ameritrade as a prospective buyer of E*Trade, which is the smallest by market share of the top online brokers.\n\nSan Francisco-based Schwab, with about $3.7 trillion of client assets, gets a majority of its revenue from net interest income. Its decision to eliminate trading commissions may be coming at a perilous time as interest rates remain historically low. In September, the brokerage said it was cutting 600 jobs, or about 3% of its workforce, citing “an increasingly challenging economic environment.”\n\nThe company last cut its retail trading commissions to $4.95 from $6.95 in February 2017, matching cuts by Fidelity. Since then, assets at the firm have grown by about $800 billion from a combination of market gains and net new inflows.\n\nSource: company filings\n\nSchwab can make up for lost revenue by offering advice to clients approaching retirement, said Alois Pirker, Aite Group’s research director for wealth management.\n\nAmeritrade shares took the biggest hit, tumbling the most since 1999, after Schwab’s move on Oct. 1. Ameritrade is more exposed than its closest rivals because the company gets more than a third of its revenue from commissions in fees, said David Ritter, a senior analyst with Bloomberg Intelligence.\n\nThe shift to free commissions may prompt Ameritrade and E*Trade to reconsider a merger, Ritter said. The combination would put the brokerages in a better position to compete with Schwab.\n\nThe fee war has rattled the broader asset management industry as well. Since the middle of last year, firms including Fidelity Investments, Vanguard Group and JPMorgan Chase & Co. have eliminated fees and commissions on a range of offerings.\n\n(Updates with E*Trade CEO details in 7th paragraph.)\n\n--With assistance from Josh Friedman.\n\nTo contact the reporter on this story: Annie Massa in New York at amassa12@bloomberg.net\n\nTo contact the editors responsible for this story: Alan Mirabella at amirabella@bloomberg.net, Vincent Bielski, Melissa Karsh\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- E*Trade Financial Corp. cut trading commissions to zero, joining major rivals in the race to the bottom and setting the stage for mergers among discount brokerages.The end to commissions on U.S. listed stock, ETFs and options trades will go into effect Oct. 7, New York-based E*Trade said", "authors": ["Annie Massa"], "top_image": "https://s.yimg.com/uu/api/res/1.2/19Ql00Iyoe_05W7ECKEzkw--~B/aD0xMzMzO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_markets_842/62208ad4581646b9a30c2a14e7f53aee", "published_at": "2019-10-02"}