{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-royals-sheeran/gingers-unite-ed-sheeran-and-prince-harry-promote-mental-health-idUKKBN1WP1MA", "downloaded_at": "2019-10-10 18:36:00.549018+00:00", "title": "Gingers Unite: Ed Sheeran and Prince Harry promote mental health", "language": "en", "text": "LONDON (Reuters) - The doorbell rings to the tune of the British national anthem “God Save the Queen”, and Prince Harry opens the door to find Ed Sheeran on the threshold. Both men have red hair and beards.\n\nFILE PHOTO: Britain's Prince Harry, the Duke of Sussex, speaks at the Youth Employment Services (YES) Hub as he and his wife Meghan, the Duchess of Sussex, visit a township in Johannesburg, South Africa, October 2, 2019. Facundo Arrizabalaga\n\n“It’s like looking in the mirror,” the prince quips before ushering the pop star inside.\n\nThis is the opening scene of a video released on Thursday in which Queen Elizabeth’s grandson and the Grammy-winning musician join forces to campaign on an issue both care about deeply.\n\nThe clip, posted on Harry's Instagram page, here shows the pair sitting at a table talking about their joint passion, but after a short while it becomes clear there is a misunderstanding.\n\n“This for me is a subject and a conversation that is just not talked about enough. I think people all over the world are really suffering,” Harry says.\n\nSheeran responds that he has been trying to write a song about the issue to help raise awareness. He then adds: “People just don’t understand what it’s like for people like us.”\n\nLooking confused, Harry asks: “What?” So Sheeran elaborates: “You know, the jokes and snide comments, I just feel like it’s time that we stood up and said, you know, we’re not going to take this any more. We are ginger and we’re going to fight.”\n\nApparently embarrassed, Harry says: “OK. Slightly awkward,” before going on to explain that he was not talking about discrimination against people with red hair, but rather about World Mental Health Day.\n\nHastily deleting the words “GINGERS UNITE” from a document on his laptop, Sheeran quickly gets on-message and the video closes with the pair urging people to reach out to anyone who may be suffering from mental health problems.\n\nHarry, sixth-in-line to the British throne, has long campaigned on the issue. On Thursday, he was in Nottingham, central England, visiting community projects aimed at preventing mental health problems and violence among young people.\n\nHarry and his wife Meghan, whose official titles are the Duke and Duchess of Sussex, have increasingly used the Internet to engage directly with the public. Both have launched legal action against British media outlets over coverage they deem intrusive and inaccurate.", "description": "The doorbell rings to the tune of the British national anthem \"God Save the Queen\", and Prince Harry opens the door to find Ed Sheeran on the threshold. Both men have red hair and beards.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439324707&w=1200&r=LYNXMPEF991IB", "published_at": "2019-10-10"}