{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7606701/AOC-opens-hardship-living-public-eye-saying-just-want-human-being.html", "downloaded_at": "2019-10-24 06:47:33.479543+00:00", "title": "AOC opens up on hardship of living in public eye saying: 'I just want to be a human being'", "language": "en", "text": "The Democrat's life has been closely covered in the press since she won the primary in June 2018 and became the youngest woman elected to Congress\n\nThe Democrat's life has been closely covered in the press since she won the primary in June 2018 and became the youngest woman elected to Congress\n\nAOC voiced her support for Markle saying, 'I feel an enormous amount of empathy for her'\n\nThe 30-year-old Congresswoman is sharing her struggle after Duchess Meghan Markle called her public life 'complicated in an emotional interview\n\nAlexandria Ocasio-Cortez revealed she struggles to live in the public eye saying, 'sometimes I just want to be a human being'\n\nDemocrat firebrand Alexandria Ocasio-Cortez is opening up on the emotional toll of living in the spotlight saying, 'sometimes I just want to be a human being'.\n\nThe 30-year-old bartender turned Congresswoman was flung into the spotlight in June 2018 when she won the Democratic Party's election for New York's 14th congressional district and continued to make headlines for her work in Congress and attacks on Donald Trump.\n\nShe's now opening about the hardship of dealing with fame in response to Meghan Markle’s emotional interview on British television where she called her life in the public eye 'complicated'.\n\n'Sometimes I just want to be a human being. And you don’t get to be a human any more,' AOC said to the Huffington Post on Tuesday.\n\nAlexandria Ocasio-Cortez revealed she struggles to live in the public eye saying, 'sometimes I just want to be a human being'\n\nThe 30-year-old Congress freshman is sharing her struggle living in the spotlight after Duchess Meghan Markle called her public life 'complicated' in emotional interview on Friday\n\n'Everything you do from wearing sweatpants to the bodega to getting a haircut - every personal decision you make for yourself is never going to be yours any more,' she added.\n\nAOC retweeted Markle's interview on Twitter on Friday adding: 'Sudden prominence is a very dehumanizing experience. There’s a part of your life that you lose, & it later dawns on you that you’ll never get it back.'\n\n'The people who treat you like a human make all the difference,' she added.\n\nThe New York representative said she’s decided to speak out on the toll of living in the public eye and in the midst of public criticism after Markle shared her own traumatic journey in the limelight.\n\n'It’s hard. I don’t think anybody could understand that, but in all fairness, I had no idea, which probably sounds difficult to understand…' Markle said in an ITV documentary entitled Harry & Meghan: An African Journey.\n\n'I feel an enormous amount of empathy for her, because it requires an enormous amount of tools to be resilient – and also to stay human in that,' AOC said. 'There’s a lot of people that are going to say \"oh, boo-hoo,\" but I feel for her. I really feel for her.'\n\nAOC retweeted Markle's interview on Twitter on Friday adding: 'Sudden prominence is a very dehumanizing experience. There’s a part of your life that you lose, & it later dawns on you that you’ll never get it back'\n\nOcasio-Cortez’s life was flung into the blaring spotlight after she won the June 2018 primary and she was shocked to see the flurry of media attention covering every aspect from her life from her love life, family history and bartending career.\n\nShe called it one of the 'right up there with my family almost getting foreclosed on ― one of the most stressful experiences ever'.\n\n'You kind of grieve for that. It has its highs and it has its lows. A lot of people look at the highs, but sometimes it feels like you got a tattoo on your face that you didn’t ask for,' she said.\n\n'It’s hard. It’s very hard. Sometimes you just want to get a drink or eat a hamburger,' she added.\n\nAOC explained that the toughest part of her job in public service is that she can’t hide way from the public or the press.\n\nAOC has made history by beating Joseph Crowley who had held his Congress seat for two decades and was chairman of the House Democratic Caucus. She was also the youngest woman ever elected to Congress. Pictured above at her swearing in ceremony in January 2019\n\nTwitter users were quick to respond to AOC's candid take on fame, some supporting her and other criticizing her for her handling of public life\n\n'I can’t afford to be hidden away. In order for me to do my job, I need to be connected to people,' she said. 'My job is to love people. And that’s very difficult sometimes given the amount of barriers.'\n\nWhile life under constant public scrutiny may be difficult, AOC's historic career is one that merits coverage.\n\nShe made history beating Joseph Crowley who had held his Congress seat for two decades and was chairman of the House Democratic Caucus. She was also the youngest woman ever elected to Congress.\n\nSo just how does she cope with the fame? She said her family and friends keep her 'grounded'.", "description": "Congresswoman Alexandria Ocasio-Cortez, 30, is opening up on the emotional toll of living in the spotlight saying, 'sometimes I just want to be a human being'.", "authors": ["Marlene Lenthang For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/23/20106586-0-image-a-2_1571869117046.jpg", "published_at": "2019-10-23"}