{"pub": "reuters", "url": "https://reuters.com/article/us-snap-advertising/snap-launches-dynamic-ads-to-draw-more-advertisers-idUSKBN1WW1U5", "downloaded_at": "2019-10-17 14:44:35.186933+00:00", "title": "Snap launches dynamic ads to draw more advertisers", "language": "en", "text": "FILE PHOTO: The Snapchat app logo is seen on a smartphone in this picture illustration taken September 15, 2017. REUTERS/Dado Ruvic/Illustration\n\n(Reuters) - Snap Inc. (SNAP.N) said on Thursday it is introducing dynamic advertising that automatically create ads and target audiences in real-time, as the parent company of photo messaging app Snapchat looks to compete for digital ad dollars.\n\nSnap has grown revenue and its userbase as larger rivals Alphabet’s (GOOGL.O) Google and Facebook Inc (FB.O), which dominate the global digital advertising market, face regulatory scrutiny over their market control. Both Google and Facebook already offer dynamic ads.\n\nDynamic ad platforms pick items from advertisers’ product catalogs and target them automatically to people with relevant interests, removing the need to manually advertise each product individually. Snap is betting the convenience will attract more advertisers.\n\nFor example, Snap could automatically show sneakers to Snapchat users that have an interest in sports, displaying items from retailers that have uploaded their product catalogs.\n\nDavid Herrmann, an independent ad buyer based in Los Angeles who works with direct-to-consumer brands, said the new function was a compelling option for “direct response-focused” brands.\n\nSnap said while global advertisers would be able to use dynamic ad platform immediately, their campaigns will initially only reach U.S. Snapchat users, with a global rollout scheduled later.\n\nSnap remains a small player in the global digital ad market with 0.5% revenue share, compared with Google at 32% and Facebook at 21%, according to research firm eMarketer.", "description": "Snap Inc. said on Thursday it is introducing dynamic advertising that automatically create ads and target audiences in real-time, as the parent company of photo messaging app Snapchat looks to compete for digital ad dollars.", "authors": ["Sheila", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191017&t=2&i=1441893304&w=1200&r=LYNXMPEF9G1B4", "published_at": "2019-10-17"}