{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/29/federal-court-halts-alabamas-law-banning-nearly-al", "downloaded_at": "2019-10-30 00:06:41.090141+00:00", "title": "Federal court halts Alabama's law banning nearly all abortions", "language": "en", "text": "A federal judge blocked Alabama’s law criminalizing nearly all abortions in the state on Tuesday, ruling a ban on abortion during the early stages of pregnancy likely would infringe on women’s rights.\n\n“The U.S. Constitution forbids the prohibition of abortion prior to fetal viability,” wrote Judge Myron Herbert Thompson, a Carter appointee, in his 17-page order, issuing an injunction halting the law.\n\nThe statute, which was passed this year by the Alabama Legislature, was set to take effect Nov. 15. It placed a near-total ban on abortion in the state, imposing criminal liability on abortion providers for any completed or attempted abortion during any stage of pregnancy.\n\nA group of abortion providers, represented by the American Civil Liberties Union, challenged its validity, saying the law infringes on their patients’ liberty and privacy rights.\n\n“Today’s decision recognizes this ban for what it is: a blatantly unconstitutional attack on the fundamental right to abortion. The Alabama ban, and the others like it, are the culmination of a nationwide strategy to push abortion out of reach,” said Alexa Kolbi-Molinas, an attorney for the ACLU.\n\nThe judge recognized the Supreme Court has ruled states can legally regulate abortion based on health, but he said a near-total ban on all abortions likely conflicts with the court’s decades of precedent upholding a person’s right to terminate their pregnancy.\n\n“This bright-line rule governs bans, rather than mere regulations, of pre-viability abortions,” the judge wrote.\n\nThe Republican-controlled legislature in Alabama passed the law in May, saying it is meant to show that a fetus is a human with legal rights.\n\nAlabama’s Human Life Protection Act passed by a party-line vote. Amendments allowing exceptions for rape and incest were rejected. Republican Gov. Kay Ivey signed the bill into law the day after it was passed.\n\nIt was one of several laws curtailing the right to abortion passed in red states across the country, as pro-life advocates hope to push an abortion case up to the Supreme Court to take a swing at overturning Roe v. Wade, the 1973 landmark case legalizing abortion nationwide.\n\nAlabama Rep. Terri Collins, a Republican who pushed for the Alabama law, said the court’s decision is the first step in the legal process, suggesting the state will appeal the order to a higher court.\n\n“I remain confident that our mission will be successful and appreciate the support of millions of citizens who support our effort to preserve unborn life,” Ms. Collins said, according to AL.com.\n\nCourts also have blocked measures in Mississippi, Missouri, Kentucky, Georgia, and Ohio, according to the ACLU.\n\n“With this federal court ruling, it’s official: None of the state abortion bans passed earlier this year are in effect. Abortion remains legal in all 50 states,” the ACLU tweeted.\n\nThe Rev. Frank Pavone, national director of Priests for Life, said the judge could have allowed the Alabama law to take effect as the legal battle continues through the courts.\n\n“Every time a federal judge blocks an abortion law, Americans are reminded about the importance of having a pro-life president in the White House — for two terms — and a pro-life Senate. When all of President Trump’s judicial nominees are seated, it will no longer be par for the course for life-saving laws to be blocked. We look forward to that day,” Rev. Pavone said.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "A federal judge blocked Alabama's law criminalizing nearly all abortions in the state on Tuesday, ruling a ban on abortion during the early stages of pregnancy likely would infringe on women's rights.", "authors": ["The Washington Times Http", "Alex Swoyer"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/29/Alabama_Abortion_Law_14529.jpg-0a5cc_c0-83-2000-1249_s1200x700.jpg?97771ece8cf6ad276bbc4f4e72e64b186f039a1f", "published_at": "2019-10-29"}