{"pub": "independent", "url": "https://independent.co.uk/voices/editors-letter/train-brussels-luxembourg-brexit-johnson-a9107226.html", "downloaded_at": "2019-09-17 08:25:59.176289+00:00", "title": "The train makes criss-crossing Europe in pursuit of news a rare pleasure", "language": "en", "text": "You probably won’t be too surprised to hear that as The Independent’s Europe correspondent, I spend a lot of my time covering Brexit. I’m based in Brussels, and the EU institutions produce more than enough news of their own.\n\nBut “Europe” extends far beyond the plate glass towers of the commission. It’s nice – and indeed often necessary – to get out a bit to other parts of the continent, to get the full picture.\n\nI’m writing this from the train to Luxembourg, where I’ll be filing stories from today. Boris Johnson is in town to meet Jean-Claude Juncker and the country’s prime minister Xavier Bettel. We’re hoping to pin them down on their plans for Brexit.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nSome EU officials and other journalists bemoan the trek from Brussels to Luxembourg, which is a fairly common occurrence for all of us. The train is slow and takes three hours, winding its way through the Ardennes at a relatively sedate pace. But personally, I love it: Belgian trains are very comfortable, and there’s plenty of time to work on other stories or prepare for your trip – if you can tear yourself away from the scenery.\n\nOn a plane, you wouldn’t be able to call your editor, quiz contacts, or file stories. You’d be strapped in, and a working internet connection is rare. But a productive few hours, or even a whole day, is possible on rail.\n\nWherever possible I try to get the train to pursue stories in other European countries, instead of flying. Mostly because it’s a better experience, but also with one eye on The Independent’s carbon emissions. Greta Thunberg and the Flygskam movement have done a great job of popularising this kind of travel over the last year or so, but it’s always seemed like common sense to me.\n\nThe longest trip I’ve done for work was to Salzburg and back (11 hours by day train) for that crunch EU summit with Theresa May in September 2018 – a fantastic journey that I’d do again in a heartbeat. I got plenty of work done; both legs were practically like a normal day at the office. Sleeper services have also been useful for some trips: I took an overnight train to cover a speech by David Davis in Vienna; a very time-efficient way of doing things.\n\nBrussels’ central position in western Europe makes this all quite easy, but I’d encourage everyone to explore our continent this way.\n\nYours,\n\nJon Stone\n\nEurope correspondent", "description": "You probably won’t be too surprised to hear that as The Independent’s Europe correspondent, I spend a lot of my time covering Brexit. I’m based in Brussels, and the EU institutions produce more than enough news of their own. But “Europe” extends far beyond the plate glass towers of the commission. It’s nice – and indeed often necessary – to get out a bit to other parts of the", "authors": ["Jon Stone"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/16/13/istock-496243235.jpg", "published_at": "2019-09-17"}