{"pub": "businessinsider", "url": "https://businessinsider.com/geisinger-health-plan-keep-aging-pennsylvania-population-healthy-2019-9", "downloaded_at": "2019-09-28 21:47:15.172619+00:00", "title": "A health system hidden in the heart of Pennsylvania thinks it's cracked the code on caring for seniors. And it could be the future of healthcare.", "language": "en", "text": "Geisinger, a health system based in central Pennsylvania, is investing heavily in the basic care it provides, starting with seniors.\n\nThe hope is that by focusing on primary care and prevention, the health system, which also runs a health plan, could keep more people healthier and out of the hospital.\n\nGeisinger's efforts to care for an aging population are a preview of the challenges that the US as a whole will face in the coming decades.\n\nClick here for more BI Prime stories.\n\nMark Walters, a 69-year-0ld retired elementary-school teacher in Kingston, Pennsylvania, watched as a medical clinic on Wyoming Avenue was torn down and put back together over the course of seven months.\n\nAt the end of the construction emerged 65 Forward, a new kind of health clinic from Geisinger, a nonprofit health system headquartered in Danville, Pennsylvania. When his wife received a postcard about 65 Forward in the mail, the couple decided to check it out.\n\n\"This is a totally different concept,\" Walters said.\n\nThe clinic is at the leading edge of a big bet from the 11-hospital Geisinger system that it can take care of seniors in central Pennsylvania by letting doctors spend more time with them and by offering activities and snacks that turn the traditional doctor's office into a community center.\n\nGeisinger's efforts to care for an aging population provide something of a preview for the challenges that the US as a whole will face in the coming decades. In the 38 counties where the system operates in Pennsylvania, 19.6% of the population is already 65 or older. The system projects that'll rise to 21.9% in half a decade.\n\nThe US will cross the 20% mark about 2030, Census Bureau data shows.\n\n\"Leveraging primary care to coordinate care for the elderly is something that's needed everywhere,\" Robert Field, a professor of health management and policy at Drexel University, said. \"If they can pioneer effective approaches, then it's widely adaptable.\"\n\nCaring for seniors as the US ages\n\nThe health system is placing more of an emphasis on new ways to care for its seniors as Pennsylvania's 65-and-older population grows at a faster rate.\n\nIn addition to the clinics and a related primary-care redesign, Geisinger is building up its ability to take care of seniors in their homes and even investing in food pantries. Overhauling the clinic on Wyoming Avenue cost about $3 million, and Geisinger said it plans to invest millions more in its primary-care efforts.\n\n\"If you look at where can we make the biggest impact in the health of our communities, it's in primary care,\" the health system's CEO, Jaewon Ryu, MD, said. \"And it's especially true as people age.\"\n\nThe clinic is designed to serve an aging population. Zachary Tracer/Business Insider\n\nThe approach is aided by the fact that Geisinger is more than a health system. The company also operates an insurance plan, which covers many of the elderly patients Geisinger will see in the clinic. That gives the system a direct financial reason to try to keep those patients healthy and out of the hospital, investing in preventive services instead.\n\nPatients don't have to have Geisinger's insurance to join 65 Forward, but a system executive said the hope is to get them transitioned to Geisinger's insurance plans so that the clinic can cover more services in a more integrated way.\n\nIn all, Geisinger's health plan has more than 550,000 members, and the health system cares for more than a million patients a year.\n\nRead more: Big hospital systems are borrowing an 80-year-old idea to keep patients healthy and cut costs, and it could be the future of healthcare\n\nGeisinger's plan for its senior-focused 65 Forward clinics\n\nThe Kingston primary-care clinic is the first for Geisinger, which plans to open 15 locations over the next year and another 15 after that.\n\nFrom conception to launch, the project took about 15 months, Juli Molecavage, associate vice president of quality and primary-care services at Geisinger told Business Insider. The first clinic was a $3 million investment from Geisinger.\n\nWalking in, patients are greeted by a check-in desk and then directed to the lobby, which has with coffee, snacks, and an artificial fireplace. The ambiance is more hotel lobby than medical waiting room.\n\nAcross the hall are workout machines in a bustling community room where Walters had just attended a weekly balance class. Behind a set of doors lie exam rooms and a common area where doctors, nurses, and other healthcare professionals work while in between patients.\n\nPatients like Walters can go to the center for primary-care visits, in addition to getting X-rays and lab work. Down the road Geisinger will offer visits with specialists either in person or via virtual visits on large-screen TVs in the exam rooms.\n\nThe new clinics are modeled on the concierge-care models that Ryu, Geisinger's CEO, has seen in places like the Bay Area but won't charge extra fees.\n\n\"When you're 65 and older, all things being equal, you tend to have more chronic disease, and the one-size-fits-all approach of primary care just doesn't work,\" Ryu said.\n\nRead more: A new kind of doctor's office charges a monthly fee and doesn't take insurance\n\nGeisinger Health CEO Jaewon Ryu. Courtesy Geisinger\n\nDoctors will care for about 450 patients each, a much smaller number than in Geisinger's other clinics.\n\nFor James Tricarico, the first doctor to join the new clinic, that's just a fraction of patients he used to see at Geisinger's Pittston location. There, he estimates he was managing the health of more than 2,000 patients a year.\n\n\"This has been a world of difference,\" Tricarico said. He finds that the smaller patient load keeps him from losing touch with patients for months before having to catch up at the next visit.\n\nInstead, Tricarico can call or message patients directly, or catch up more frequently with the other caregivers in the office to hear how patients are doing. He's also got the time to bring them in for more frequent follow-up visits.\n\nZachary Tracer/Business Insider\n\nTricarico said he was drawn to 65 Forward because it reminded him of what he'd been able to do when he had his own independent practice before joining Geisinger. When the first location ended up being in his back yard, he jumped at the chance to join.\n\nThe Kingston location has added a second doctor, who starts in October and will also be able to take on up to 450 patients.\n\nBuilding a doctor's office that patients want to go to, even when they don't have an appointment\n\nThe 65 Forward locations are also designed to serve as community centers for seniors, hosting educational sessions, bridge leagues, and knitting groups. On the day Business Insider visited, a weekly fitness class was underway.\n\nWalters said once he and his wife came in for a visit, the two spent an hour talking to Tricarico and were told they were welcome to come by any time they felt lonely. They also took advantage of the 90-minute fitness class offered by 65 Forward. He's been a member of the new clinic for about four weeks.\n\n\"You feel good,\" Walters said. \"You come here and you don't feel like you're really rushed.\"\n\nSince joining, Walters has started spreading the word to neighbors and at his church.\n\nThe idea also draws on what primary-care companies have been building. Over the past few years, models like venture-backed Iora Health, family-owned ChenMed, and private-equity-backed Oak Street Health have picked up steam in their approaches to caring for elderly Americans, boosted by the growth of private Medicare plans.\n\nRead more: Meet the 8 companies changing how doctors get paid and building the future of medicine\n\nWhy a hospital system is investing in keeping patients out of the hospital\n\nBeyond 65 Forward, the system had been looking at team approaches to primary care for years. That accelerated about three years ago, when the health system introduced a program called \"Primary Care Redesign.\" The new model applies to most of Geisinger's clinics today.\n\nThat included defining panel sizes (keeping them between 1,900 and 2,000 patients per doctor), setting up care teams within practices, and giving doctors longer to meet with patients.\n\nGeisinger's flagship hospital in Danville, Pennsylvania. Zachary Tracer/Business Insider\n\nSome health systems have long emphasized primary care as a way to keep patients healthy at a lower cost. Kaiser Permanente, for instance, traces its roots to arrangements struck between industrial companies and hospitals in the 1930s and '40s to cover care for workers at a set monthly rate. The company's strategy is a favorite of Berkshire Hathaway Vice Chairman Charlie Munger and others who see it as a model for the future of healthcare in the US.\n\nBut for the most part, health systems aren't clamoring to invest heavily in primary-care or preventive services.\n\n\"Not everybody in the industry believes that that's true,\" Ryu said. For them, he said, it's hard to understand why services like a Fresh Food Farmacy — where those who are food insecure can pick up groceries in a space run by Geisinger — and at-home services would be included in the plan, rather than provided for by a philanthropic arm. \"I think you've got to believe that that actually has a return.\"\n\nFor instance, in the company's Geisinger At Home program, Ryu said it's seen hospital admissions drop 40 to 45% since the program started a year and a half ago. The program is available to members enrolled in Geisinger's Medicare Advantage health plan.\n\nRyu is hoping other health systems and doctors around the US will take note of the investment Geisinger's making in primary care.\n\n\"We want this to be the mecca for anything primary care and value-based,\" Ryu said. \"What we're creating here is a place where if you haven't gone and checked it out or if you haven't gone and spent time at Geisinger, then you haven't gone to the mecca.\"", "description": "Geisinger's efforts provide a preview of the challenges the entire US will face in the coming decades.", "authors": ["Lydia Ramsey", "Zachary Tracer"], "top_image": "https://image.businessinsider.com/5b059c4e6e8bbd1d008b570a?width=1200&format=jpeg", "published_at": "2019-09-28"}