{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/27/WS5db57c38a310cf3e35573d0f.html", "downloaded_at": "2019-10-27 11:58:51.005045+00:00", "title": "Be a forerunner of blockchain application: Editorial", "language": "en", "text": "chinadaily.com.cn | Updated: 2019-10-27 19:15\n\n[Photo/IC]\n\nOvernight, it seems blockchain has skyrocketed in China from being a concept limited mostly to industry insiders into a promising new territory of opportunities.\n\nAll because General Secretary Xi Jinping identified blockchain as \"a crucial breakthrough point for indigenous innovation of core technologies\" at the 18th collective study session of the Political Bureau of the Communist Party of China Central Committee on Thursday.\n\nThe CPC obviously regards blockchain as a commanding point of next-generation technologies that it cannot afford not to grasp. \"A contest has officially started,\" as one official media outlet declared. \"And China's goal is certain and singular: to be No 1.\"\n\nEach of the Political Bureau's study sessions focuses on an issue that the Party leadership has identified as being among the most outstanding challenges facing the country, and thus they are credible sources of clues to changes in national policy orientation.\n\nThemed \"Status Quo And Development Trends of Blockchain Technologies\", the 18th study session's embrace of blockchain was not only a reflection of the CPC's resolve to be \"a political party committed to learning\", but also a practical step to be competitive in the new technological revolution and update and refine its governance regime and capacities.\n\nBlockchain has been surrounded by suspicion and controversy since its inception. Yet it has been widely acclaimed for having the properties of decentralization, transparency and immutability.\n\nA number of domestic internet and financial service providers have come up with their own blockchain platforms in such fields as financing, public welfare, and commodity source-tracking. And, as illustrated by the upsurge of blockchain-related stocks, the new technology is likely to witness an immediate increase in its use in China.\n\nBut it will be interesting to see how things evolve when it comes to governance. At the study session, Xi highlighted the necessity to explore the use of blockchain data sharing models in enabling joint use and maintenance of administrative data between different departments and areas, with the aim of deepening reform to cut red tape and offering better public services.\n\nHe also called for the emerging technology to be applied to all aspects of the country's priority projects, such as education, employment, old-age care, targeted poverty alleviation, public health, food safety and social relief.\n\nConsidering the CPC's capability for implementing key national action programs, the resources at its disposal, its unique approach to governance, and especially what China is accomplishing in such fields as big data and artificial intelligence, there is no reason to doubt that the country can position itself at the forefront of blockchain technologies and their application.", "description": "Overnight, it seems blockchain has skyrocketed in China from being a concept limited mostly to industry insiders into a promising new territory of opportunities.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/27/5db57fe3a310cf3e97a31cc9.jpeg", "published_at": "2019-10-27"}