{"pub": "nymag", "url": "https://vulture.com/2019/10/what-time-is-the-democratic-debate-channels-how-to-watch.html", "downloaded_at": "2019-10-15 23:08:39.487944+00:00", "title": "Here’s How to Watch the Fourth Democratic Primary Debate", "language": "en", "text": "Photo: Saul Loeb/AFP/Getty Images\n\nTuesday, October 15, is the fourth Democratic Primary debate because the Democratic Party needs a leader for the 2020 presidential election and because Lorne Michaels needs cold opens. Tonight, the candidates will stunt onstage at Otterbein University in Westerville, Ohio. The number of candidates who qualified for this round are down to 12, which is still a ridiculously large number. Tonight’s debate has as many candidates as Steve Martin had children in Cheaper by the Dozen, the entire premise of which was just “12 is a very big number of people for there to be.” (And, yes, before you ask, Liz Warren would be the Hilary Duff and Bernie Sanders would be the Alyson Stoner, if the analogy held.) The participants are Joe Biden, Cory Booker, Pete Buttigieg, Julian Castro, Tulsi Gabbard, Kamala Harris, Amy Klobuchar, Beto O’Rourke, Bernie Sanders, Tom Steyer, Elizabeth Warren, and Andrew Yang. (Sorry, MariStannes.) How will any of the candidates have time to give meaningful answers or get a word in edgewise? It helps that the debate is slated for three hours — 8 p.m. ET to 11 p.m. ET — which is a decent amount of time; nearly twice the length of Cheaper by the Dozen. Also, there will be no opening statements, and hopefully moderators Anderson Cooper, Erin Burnett, and Marc Lacey will keep candidates’ responses and rebuttals to their respective allotments of 75 seconds and 45 seconds.\n\nCNN, CNN International, and CNN en Español will broadcast the debate on television at 8 p.m. ET, and cord cutters will be able to watch on the home pages of CNN.com, NYTimes.com, and the Facebook pages for CNN, CNN International, CNN Politics, CNN Replay, AC360, and Erin Burnett OutFront. If you buy into the theory that the endless, distended TV debate cycle is just a conspiracy by Big Podium to sell more podia, you can avert your eyes from the spectacle and listen to the debates on NPR or SiriusXM channels 116, 454, 795, or Alexa. Yes, Alexa will play you the debate audio if you ask nicely.\n\nFinally, if you have a Hulu account (or wish to sign up for a trial), you’ll be able to stream the Democratic debates live, with coverage beginning at 7 p.m. ET. This is an intriguing prospect because it’s not restricted just to Hulu + Live TV subscribers; whatever your plan, you can stream here beginning at 7 p.m. ET.", "description": "Tonight CNN airs the fourth Democratic Debate for the 2020 election in conjunction with the New York Times, with moderators including Anderson Cooper. Bernie Sanders, Elizabeth Warren, Joe Biden, and more will debate. Here’s how to watch and stream.", "authors": ["Rebecca Alter"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/15/15-democratic-debate.w1200.h630.jpg", "published_at": "2019-10-15"}