{"pub": "time", "url": "https://time.com/5671803/india-moon-lander-chandrayaan-2-located", "downloaded_at": "2019-09-08 23:26:35.619090+00:00", "title": "India Locates Missing Moon Lander Module on Lunar Surface", "language": "en", "text": "(NEW DELHI) — The lander module from India’s moon mission was located on the lunar surface on Sunday, one day after it lost contact with the space station, and efforts are underway to try to establish contact with it, the head of the nation’s space agency said.\n\nThe Press Trust of India news agency cited Indian Space and Research Organization chairman K. Sivan as saying cameras from the moon mission’s orbiter had located the lander. “It must have been a hard landing,” PTI quoted Sivan as saying.\n\nISRO officials could not be reached for comment.\n\nThe space agency said it lost touch with the Vikram lunar lander on Saturday as it made its final approach to the moon’s south pole to deploy a rover to search for signs of water.\n\nA successful landing would have made India just the fourth country to land a vessel on the lunar surface, and only the third to operate a robotic rover there.\n\nA live stream in Kolkata, India, shows Chandrayaan2 landing on the lunar surface on Sept. 7, 2019. Indranil Aditya—NurPhoto/Getty Images\n\nThe space agency said Saturday that the lander’s descent was normal until 2 kilometers (1.2 miles) from the lunar surface.\n\nThe roughly $140 million mission, known as Chandrayaan-2, was intended to study permanently shadowed moon craters that are thought to contain water deposits that were confirmed by the Chandrayaan-1 mission in 2008.\n\nThe latest mission lifted off on July 22 from the Satish Dhawan space center in Sriharikota, an island off the coast of the southern Indian state of Andhra Pradesh.\n\nAfter its launch, Chandrayaan-2 spent several weeks making its way toward the moon, ultimately entering lunar orbit on Aug. 20.\n\nThe Vikram lander separated from the mission’s orbiter on Sept. 2 and began a series of braking maneuvers to lower its orbit and ready itself for landing.\n\nOnly three nations — the United States, the former Soviet Union and China — have landed a spacecraft on the moon.\n\nContact us at editors@time.com.", "description": "The lander module from India's moon mission was located on the lunar surface on Sunday, a day after it lost contact with the space station.", "authors": ["Associated Press"], "top_image": "https://timedotcom.files.wordpress.com/2019/09/india-moon-landing.jpg?quality=85&w=1024&h=628&crop=1", "published_at": "2019-09-08"}