{"pub": "theverge", "url": "https://theverge.com/2019/9/13/20860403/amazon-studios-undone-animated-feature-rotoscoping-waking-life-scanner-darkly-richard-linklater", "downloaded_at": "2019-10-05 15:08:26.275308+00:00", "title": "Amazon’s Undone makes a terrific double feature with Waking Life", "language": "en", "text": "There are so many streaming options available these days, and so many conflicting recommendations, that it’s hard to see through all the crap you could be watching. Each Friday, The Verge’s Cut the Crap column simplifies the choice by sorting through the overwhelming multitude of movies and TV shows on subscription services and recommending a single perfect thing to watch this weekend.\n\nWhat to Watch\n\nWaking Life, an animated film that premiered at the 2001 Sundance Film Festival alongside Tape, a low-budget drama shot on a camcorder. Both films were directed by Richard Linklater, and as his first films following his major studio release The Newton Boys, they helped cement his reputation for unpredictability. But where Tape mostly received polite nods, Waking Life won over viewers who were beguiled by Linklater’s attempt to use animation to realize the landscape of dreams.\n\nWaking Life follows an unnamed protagonist (played by Dazed and Confused star Wiley Wiggins) through a series of vignettes featuring characters expressing their most deeply held views about the meaning of life via conversations or monologues. The protagonist describes the process as mostly “just people goin’ off about whatever.” That’s accurate, but as a description, it misses the complexity of the film, which touches on the function of language, technology’s possible role in human evolution, André Bazin, Philip K. Dick, fate, death, the unknowable nature of reality, and other topics.\n\nThe people he encounters, observes, or even just imagines include Linklater himself, Ethan Hawke and Julie Delpy (reprising their characters from Linklater’s Before Sunrise for the first time), Alex Jones (an Austin eccentric before he became an insidious influence on national politics), and famed New York tour guide Timothy Speed Levitch. Each presents an idea or a point of view for the protagonist to ponder. Then they fade away.\n\nThough the film has a progression that ultimately leads Wiggins’ character to consider the role of death in shaping meaning, it mostly drifts from one notion and memorable character to the next, letting the concepts and their presenters shape the animation. As Jones’ rant intensifies, for instance, his face turns red. Some characters look cartoony, others appear almost photorealistic. Backgrounds shimmer, bend, and melt away. The cumulative effect is of reality being pulled in and out of focus.\n\nThe rotoscoping process makes that effect possible. The animation style, broadly speaking, traces animation over live-action footage. It’s an old technique, but the film puts it to new uses, thanks to a computer program called Rotoshop, which is created by art director and programmer Bob Sabiston. Where hand-drawn rotoscoping had previously been used to make animation look more realistic, here, it makes the real world resemble animation.\n\nWhy Watch Now?\n\nSabiston, like Linklater, was based in Austin, and they collaborated again on the 2006 Philip K. Dick adaptation A Scanner Darkly. Sabiston’s work found an even larger national audience around the same time, through a series of bank commercials. In the years since, though, fewer people have explored the possibilities of computer-aided rotoscoping, up to the new Amazon series Undone.\n\nCreated by Kate Purdy and Raphael Bob-Waksberg and directed by Dutch animator Hisko Hulsing, the series stars Rosa Salazar as Alma, a young woman who experiences a traumatic car accident in the opening moments of the first episode. The circumstances that brought her to that moment and the choices she makes after the accident are wrapped up in a mystery from her past she previously didn’t even realize existed. Now, her late father (Bob Odenkirk) serves as her guide as she explores her own memories.\n\nUndone visibly draws on both A Scanner Darkly and Waking Life. From the former, it uses rotoscoping’s not-quite-solid quality to create an atmosphere of unease in the service of a science fiction plot. From the latter, it borrows the ability to blast reality open at any moment. In the second episode, Rosa cycles through several different variations on the same experience, each time watching as what she believes is really happening falls apart and cycles back on itself. Like Linklater on Waking Life, Hulsing understands how this particular style of animation can capture a feeling between sleep and wakefulness and how it shows that some stories can only be told in that space.\n\nWho It’s For\n\nWaking Life defies categorization, resembling no film so closely as Linklater’s Slacker, a live-action tour of an Austin populated by colorful characters with a lot on their mind and a willingness to share their thoughts. It’s a great film for anyone interested in provocative ideas married to striking imagery and moving at a pace that lets viewers savor both of those elements. It’s one for the dreamers.\n\nWhere To See It\n\nWaking Life is available to rent on all major streaming services.", "description": "Richard Linklater’s animated 2001 feature Waking Life and his eventual Philip K. Dick adaptation A Scanner Darkly showed what computer rotoscoping could do to enhance and deconstruct reality. The new Amazon Studios series Undone follows in his footsteps.", "authors": ["Keith Phipps", "Sep"], "top_image": "https://cdn.vox-cdn.com/thumbor/CJi2vZAAAOa6wQdQwgvEIxq5kC0=/0x0:1921x1006/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19189086/WakingLife2001.jpg", "published_at": "2019-09-13"}