{"pub": "yahoo", "url": "https://sports.yahoo.com/steelers-could-changes-wide-receiver-102043441.html", "downloaded_at": "2019-09-18 23:22:10.193682+00:00", "title": "Steelers could make changes at wide receiver", "language": "en", "text": "Steelers wideout JuJu Smith-Schuster said he didn’t think the team’s offense would change much, in the transition from quarterback Ben Roethlisberger to backup Mason Rudolph.\n\nBut there could be a personnel change at another position as well.\n\nVia Joe Rutter of the Pittsburgh Tribune-Review, coach Mike Tomlin seemed baffled by the recent struggles of starting wideout Donte Moncrief.\n\nScroll to continue with content Ad\n\n“I don’t know what to make of it,” coach Mike Tomlin said Tuesday. “I know we haven’t been able to depend on him to this point. He’s got some challenges and we have some challenges moving forward.”\n\nThrough two games, Moncrief has three receptions for 7 yards. He also has five drops, which is hardly what they were hoping for when he signed a two-year, $9 million contract this offseason.\n\nHe was pulled from last week’s game after a drop led to an interception, after four drops the week before against the Patriots.\n\nTomlin was asked if the veteran would get a chance to work through it and replied: “We’ll see.”\n\nTurning to James Washington (Rudolph’s college teammate) and rookie Diontae Johnson would be the obvious moves if they decide they can no longer trust Moncrief.", "description": "Steelers wideout JuJu Smith-Schuster said he didn't think the team's offense would change much, in the transition from quarterback Ben Roethlisberger to backup Mason Rudolph. But there could be a personnel change at another position as well. Via Joe Rutter of the Pittsburgh Tribune-Review, coach", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/x4I_Obd3Zebeo_xUCL1zMA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjAuNDcxNTEyNzcwMTM3Ng--/https://s.yimg.com/uu/api/res/1.2/nfFJl0_LxAOk4nbdT0F2Ig--~B/aD01NzM7dz0xMDE4O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/profootballtalk.nbcsports.com/4d9066e135176087e4d6c2389a33a08a", "published_at": "2019-09-18"}