{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7541777/Jihadi-Ja.html", "downloaded_at": "2019-10-05 23:16:28.769293+00:00", "title": "Jihadi Jack spotted in hellhole Syrian jail on TV by his parents", "language": "en", "text": "Gaunt and lying on the floor of a squalid, overcrowded jail in northern Syria, this is British jihadi Jack Letts – pictured just days ago.\n\nDubbed 'Jihadi Jack', he was filmed among dozens of fellow Islamic State (IS) prisoners, also in orange jumpsuits, who have been captured by Kurdish militia.\n\nThe 23-year-old Muslim convert from Oxfordshire, who declared himself an 'enemy of Britain' and fled to the Middle East to join IS, has been stripped of his UK citizenship.\n\nLast night, his mother Sally Lane pleaded for Letts to be allowed to return and face trial in this country so that he can be rescued from the conditions in which he is being held, but the Home Office has dismissed her plea.\n\nSeeing the first images of Letts in his cell since he was taken prisoner two years ago, she told The Mail on Sunday: 'It's heart-rending to see your son like this and to feel so completely powerless.\n\nWe have been pressing the Red Cross for months to tell us what the jail is really like, but they always refuse, saying that to release this information would jeopardise their access.\n\nMuslim convert Jack Letts, from Oxfordshire, has been pictured gaunt and lying on the floor in an overcrowded jail in northern Syria\n\nDubbed 'Jihadi Jack', he was filmed among dozens of fellow Islamic State (IS) prisoners, also in orange jumpsuits, who have been captured by Kurdish militia\n\nI suppose I always hoped Jack was exaggerating, but now it's clear that he wasn't – and that it's worse than my worst nightmares.'\n\nLetts left his comfortable, middle-class life in Britain for the brutal 'caliphate' run by the IS terrorist group in 2014.\n\nHe denies ever being a fighter. After denouncing IS as 'un-Islamic' in social media posts, he managed to escape from the caliphate's capital Raqqa in May 2017.\n\nSince then he has been held by the Kurdish YPG militia at the prison in the photos – believed to be in the city of Qamishli. He has not been charged or put on trial.\n\nIn occasional letters to his parents sent via the Red Cross, Letts has described how he is being held in a mass cell, with almost no furniture, boiling in summer and freezing in winter, with no access to exercise or the outdoors, and little opportunity to wash.\n\nSally and her husband, organic farmer John Letts, were convicted at the Old Bailey in June of supporting terrorism by sending Jack £223 in 2015, and found not guilty for trying to wire him a further £1,500 to pay a people smuggler to try to get him out.\n\nThe 23-year-old had previously declared himself an 'enemy of Britain'\n\nThey were given suspended sentences.\n\nIn one of his last acts as Home Secretary, Chancellor Sajid Javid revoked Jack's UK citizenship earlier this year. Letts is still a citizen of Canada, where his father comes from.\n\nSally, 57, spotted her son in the photo last week, after the Kurds allowed TV stations on both sides of the Atlantic to broadcast film from the jail.\n\nHe was shown at the start of a report by the US network CBS.\n\nSpeaking about the devastating impact, she said: 'I was horrified. He had told us there were 35 being held in his cell and that prisoners were forced to lie on the floor, and you can see that's true.\n\n'He said in his last letter he was never allowed out or to see the sun, and we must assume that must be true as well.'\n\nJohn, 58, added: 'It's very difficult to see a photo of the son you love, and took care of for 18 years, sleeping half-naked on a concrete floor crammed in a room with so many others, equally emaciated and suffering. Is this really the best way for our democracy to deal with this issue?'\n\nSally said that stripping Jack of his citizenship had solved nothing. 'If there is evidence he has committed a crime, then bring him home and put him on trial, and if he is guilty, send him to prison.\n\n'But he has been in this limbo for two-and-a-half years with no end in sight.'\n\nThe soldier-turned-Tory MP Crispin Blunt, a former chairman of the Commons Select Committee on Foreign Affairs, visited the prison last month and was able to meet Jack.\n\nHe said: 'He was brought to see me in a visitors' facility, and the conditions he described are confirmed by the photographs.\n\n'He was wearing prison uniform but he couldn't speak freely, because the prison governor was sitting next to us.'\n\nLast night, his mother Sally Lane (pictured with husband John) pleaded for Letts to be allowed to return and face trial in this country so that he can be rescued from the conditions in which he is being held, but the Home Office has dismissed her plea\n\nMr Blunt said that detaining thousands of IS captives from 54 countries was imposing an 'intolerable burden' on the Kurds, who had 'done most of the dying in achieving victory over IS' but who had very limited resources, and it was time to let the prisoners return to their countries of origin.\n\nHe added: 'The British Government should be taking responsibility for our nationals, not removing citizenship from them.\n\n'The situation the photos show is not sustainable. The prisoners need to go through a justice process. And if we can't get the courts to convict them, we have the means to put them under surveillance.'\n\nHowever, there was no sign last night that the images from the prison might persuade Home Secretary Priti Patel to change her policy.\n\nA Home Office source said: 'Jihadi Jack signed up to join people who hate this country, hate our beliefs and hate our way of life.\n\n'His parents, who have been convicted of funding terrorism by the British courts, are wasting their breath. Law-abiding Brits will think he's got off easy in that squalid prison. The thousands of victims of Jack's terrorist friends weren't that lucky.'\n\nCanada's government also has a policy of refusing to allow IS detainees home. Letts's parents are hoping to launch a joint legal action to challenge this with other families in the same position.\n\nYesterday Canada's foreign office was unavailable for comment.\n\nLast night, security sources revealed that more than 60 British jihadis are languishing in Kurdish custody in northern Syria, their numbers equally split between men and women.\n\nThe male jihadis are being kept in secret prisons, while the women and children are being kept in camps such as Roj, Al-Hol and Ayn Issa.\n\nOfficials believe that some of the detainees are battle-hardened jihadis who would pose serious danger to national security, and have had their British citizenships withdrawn to prevent them from returning to the UK.\n\nThese include El-Shafee Elsheikh, 31, and Alexanda Kotey, 35, members of a gang of British terrorists known as the Beatles, who imprisoned, tortured and beheaded Western hostages.\n\nThe most infamous of the group was Mohammed Emwazi, also known as Jihadi John, who beheaded at least five Western hostages, including two Britons, in front of the camera.\n\nAmong female detainees are Shamima Begum, 19 – one of three Bethnal Green Academy girls who ran away to Syria in 2014.\n\nShamima, who since gave birth to three children who have all died, is now in camp Roj in northern Syria.\n\nBegum, from Bethnal Green, East London, was first found by a British journalist earlier this year at the Al-Hol camp where she gave an interview saying she wants to come back to Britain.\n\nShe has also been stripped of her citizenship.\n\nTooba Gondal, 25, fled IS's last stand in Baghouz, south-east Syria, and arrived at Ayn Issa camp in the north of the country in April.\n\nShe is staying at the camp with a son aged 18 months and a three-year-old daughter.\n\nLast week, she issued a letter of apology to the people of Britain, pleading to come back to the UK.\n\nAdditional reporting: Abul Taher", "description": "Jack Letts has been pictured gaunt and lying on the floor in an overcrowded jail. The  Muslim convert, 23, from Oxfordshire, previously declared himself an 'enemy of Britain'.", "authors": ["David Rose For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/21/19342600-0-image-a-3_1570307811100.jpg", "published_at": "2019-10-05"}