{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/artist-creates-brilliant-paintings-of-the-queen-by-using-her-boobs-as-brushes-10874282", "downloaded_at": "2019-10-07 12:10:09.235678+00:00", "title": "Artist creates brilliant paintings of the Queen by using her boobs as brushes", "language": "en", "text": "You’ll never guess how this painting of Queen Elizabeth came to be (Picture: Caters)\n\nThis week in weirdly delightful news, a woman has been painting with her boobs, and the results are pretty great.\n\nArtist Nadia Matievskay from Belarus doesn’t paint fruit bowls or nude folks, she makes majestic illustrations of none other than Her Majesty the Queen.\n\nThe 21-year-old has been using Elizabeth II as her muse and her boobs as her brushes, and she even manages to sell her paintings.\n\nCovering her breasts in paint, Nadia has also been able to create stunning landscapes.\n\nNadia, who turned professional after painting her first piece as part of a challenge, angles her bits in different directions to create unique patterns and styles.\n\nIf you thought her quirky methods were new then you’d be wrong. Other women in the past have also got creative using their breasts.\n\nAnd who could forget Pricasso, the man who paints with his penis?\n\nAdvertisement\n\nAdvertisement\n\nWhile he’s painted many a politician and celeb, he hasn’t ventured onto dear old Lizzie. But perhaps that could be considered treason.\n\nWho knew breasts doubled as paintbrushes (Picture: Nadia Matievskay/Caters)\n\nMeanwhile, Nadia loves giving a shout out to the monarchy and says there’s even a growing demand for her work.\n\nShe said: ‘I love what I do and I see why there’s a demand.\n\n‘Of course, I realise that the way the paintings are created is what’s attracting attention to my art and I but I want to keep on making my art as much as possible.\n\n‘It’s difficult for me to say that I have a favourite painting. I love all of them.’\n\nNeat talent (Picture: Nadia Matievskay/Caters)\n\nNadia said she had never picked up a paintbrush until she began painting her unique pieces back in February.\n\nShe now sells her art using Facebook and Instagram and flogs the stuff across the globe.\n\nThe budding Picasso says she picked up her unique style of painting while she was completing an acting course.\n\nShe said: ‘One day our mission was to give each other some weird tasks.\n\n‘And my task was quite odd, to paint a picture with my breast and sell it. So, at the start, it was sort of just a joke.\n\n(Picture: Nadia Matievskay/Caters)\n\n‘I think my first experience was quite a success. It’s hard to evaluate it from the point of view of a painting technique as not many people paint like this but the colour was quite nice.\n\nAdvertisement\n\nAdvertisement\n\n‘Since then I started to source the information and study the twists and turns of breast painting.\n\n‘Every painting has its own story and feelings which I try to transfer through my art.’\n\nAnd another plus side – she gets to save money on aprons.\n\nMORE: Halloween boobs are back, so get the glitter and glue out\n\nMORE: Tattoo artist creates nipple tats to breast cancer survivors but the images keep getting deleted from Facebook\n\nMORE: Artist creates iconic optical illusion looks where she blends into the background\n\nAdvertisement Advertisement", "description": "Artist Nadia Matievskay from Minsk, Belarus, doesn't paint fruit bowls or nudes, she makes majestic illustrations of Her Majesty the Queen.", "authors": ["Faima Bakar"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_88795702_1570441448.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}