{"pub": "yahoo", "url": "https://news.yahoo.com/islamic-state-silent-baghdadi-death-151719061.html", "downloaded_at": "2019-10-30 09:25:21.649678+00:00", "title": "Islamic State silent on Baghdadi death as it searches for successor", "language": "en", "text": "FILE PHOTO: General view of damaged al-Nouri mosque, where Islamic State leader Abu Bakr al-Baghdadi declared his caliphate back in 2014, in the old city of Mosul\n\nBy Ulf Laessing and Omar Fahmy\n\nCAIRO (Reuters) - Islamic State supporters have responded with silence and disbelief days after the death of their leader Abu Bakr al-Baghdadi, suggesting a breakdown in the command structure of the Sunni militant group trying to agree on a successor.\n\nThere has been no official statement or mourning on Baghdadi on Islamic State's (IS) official Telegram channel since U.S. President Donald Trump announced on Sunday his killing at the hands of special operations forces in northwestern Syria.\n\nIts Amaq news agency Telegram has been continuing business as usual, posting since Sunday more than 30 claims of attacks in Syria, Egypt, Afghanistan and Iraq praising its fighters.\n\nThere has also been less chatter among jihadist supporters on social media compared to the killing of al Qaeda leader Osama bin Laden in 2011 and other militant leaders.\n\nAnalysts said the remains of Islamic State's leadership were in a state of shock probably trying to keep the group together and agree on a successor before confirming Baghdadi's killing.\n\n\"There is probably right now chaos inside what is left of the leadership. Key aides have been killed and documents destroyed,\" said Hisham al-Hashimi, an Iraqi expert on militant groups.\n\n\"They will want to agree on a successor before announcing the death,\" he said, adding that a split of the group could delay this.\n\nThe group might also need to rebrand itself since using Baghdadi's declared Islamic caliphate was no longer appropriate having lost the swathes of Iraq, Syria and Libya its fighters used to control until 2017, analysts said.\n\nMany of Baghdadi's followers were also killed, Trump said on Sunday.\n\nOn Tuesday, he wrote on Twitter the U.S. military had likely killed the person who likely would have succeeded Baghdadi as Islamic State leader. Trump did not specify who he was referring to, but a senior State Department official on Monday confirmed the killing of Abu al-Hassan al-Muhajir, Islamic State spokesman and a high-ranking IS figure, in an operation separate from the one that killed Baghdadi.\n\nIt took al Qaeda, another Sunni militant group following a similar ideology which carried out the Sept. 11, 2001, attacks on the United States, several days before it confirmed the killing of Osama bin Laden in a U.S. raid, said Aymenn al-Tamimi, a researcher at Swansea University focused on Islamic State.\n\nAbout six weeks passed before the group announced a successor to bin Laden.\n\n\"Islamic State could announce the death in their weekly news letter which could come out on Thursday if they were able to agree on a successor,\" said Tamimi.\n\nHe said Hajj Abdullah, a deputy of Baghdadi, was his likely successor, provided he was still alive.\n\nThere had been conflicting reports before whether Baghdadi was still alive after the Islamic State lost its last significant territory in Syria in March, resorting since then to hit-and-run guerrilla tactics.\n\nHis last audio message was in September.\n\n\n\n\n\nDEFIANCE\n\nThere has been less chatter online among supporters of militant groups compared to times when militants were previously killed.\n\nSocial media platforms such as Twitter are now quicker at deleting accounts linked to militants, while several Arab countries have stepped up online surveillance. That forces users to constantly change encrypted accounts.\n\nOf those Islamic State supporters who went online after Trump's announcement following an initial stunning silence, many voiced disbelief or dismissed the news as fake.\n\nA Telegram account linked to IS warned supporters not to believe an alleged image announcing the death. The message ended with \"God almighty preserve him (Baghdadi)\", suggesting the poster still believed Baghdadi was alive.\n\nOther supporters seemed ready to embrace his death, urging supporters to continue the jihadist fight in any case.\n\n\"Whatever happens the jihad convoy moves forward and will not stop even if the state is annihilated,\" one supporter wrote on a personal Telegram account.\n\nTamimi said there was not much mourning as many militant supporters were glad to see Baghdadi dead because he had in their view damaged the jihad project by his group's cruelty by meting out punishments such as amputations of legs and hands.\n\nHayat Tahrir al-Sham, the Sunni group formerly known as the Nusra Front and which dominates Idlib in northwestern Syria where Baghdadi was killed, praised his death.", "description": "Islamic State supporters have responded with silence and disbelief days after the death of their leader Abu Bakr al-Baghdadi, suggesting a breakdown in the command structure of the Sunni militant group trying to agree on a successor.  There has been no official statement or mourning on Baghdadi on Islamic", "authors": ["Ulf Laessing", "Omar Fahmy"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Xl6kYeY_xcHQYNC1KuRJew--~B/aD01MzM7dz03OTk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/fd725457a5343cde7450f9238390e680", "published_at": "2019-10-29"}