{"pub": "businessinsider", "url": "https://businesstimes.com.sg/transport/boeing-completes-year-of-turmoil-with-promise-to-indonesia-on-737-max-crash", "downloaded_at": "2019-10-26 00:07:31.878171+00:00", "title": "Boeing completes year of turmoil with promise to Indonesia on 737 MAX crash", "language": "en", "text": "Boeing Co on Friday promised to act on safety recommendations for its 737 MAX aircraft made in a new report by Indonesian investigators on the deadly Lion Air crash a year ago.\n\n[PARIS] Boeing Co on Friday promised to act on safety recommendations for its 737 MAX aircraft made in a new report by Indonesian investigators on the deadly Lion Air crash a year ago.\n\nThe company also voiced its grief over the Oct 29, 2018 crash after take off from Jakarta that killed all 189 people on board, a response that marked a shift in tone compared with its reaction to a preliminary report last November.\n\nIn a statement on Friday, Boeing chief executive Dennis Muilenburg outlined changes planned for the so-called MCAS cockpit software that has been widely linked to the accident and the crash of an Ethiopian Airlines jet five months later.\n\n\"We are addressing the (Indonesian accident agency) KNKT's safety recommendations and taking actions to enhance the safety of the 737 MAX to prevent the flight control conditions that occurred in this accident from ever happening again,\" he said.\n\nsentifi.com Market voices on:\n\nThe company's previous statement, which included no comment from Boeing leaders and was viewed as clumsy by some family representatives, indirectly pointed the finger at Lion Air's cockpit and ground crew by listing questions that the report hadn't answered.\n\nStay updated with\n\nBT newsletters Terms & conditions Sign up\n\nSenior aviation officials, speaking privately, as well as analysts and some Boeing insiders expressed surprise at the time, saying the statement tested the limits of a UN-backed (United Nations) agreement to prevent parties commenting on live investigations.\n\nThe rules against speaking out during investigations are usually strictly followed by all planemakers including Boeing.\n\n\"Boeing made a crucial misstep last year by attempting to deflect responsibility to third parties,\" said Ronn Torossian, chief executive of New York PR firm 5WPR.\n\n\"The fact of the matter is, organisations that admit fault and actively work to solve issues always come out looking more favourable than those who place blame on others.\"\n\nWith dozens of lawsuits pending, Boeing has not admitted liability. But in March it acknowledged that MCAS was one link in a wider chain of events when an Ethiopian Airlines 737 MAX also crashed, leading to a worldwide grounding of the fleet.\n\nIn their final report on Friday, Indonesian investigators highlighted design flaws in MCAS software while also revealing errors or confusion among crew and faulting airline operations.\n\n\"It was not wise to blame the pilots after the first report and it could have been said differently,\" said Paul Hayes, safety director at UK-based consultancy Ascend by Cirium.\n\n\"Yes, there were pilot errors but they should never been placed in that position inside the cockpit,\" he added.\n\nA Boeing spokesman said it had no further comment.\n\nHUMBLED\n\n\"We mourn with Lion Air, and we would like to express our deepest sympathies to the Lion Air family,\" Mr Muilenburg's statement on Friday said.\n\nThe statements bookended one of the most challenging years in Boeing's history, with the planemaker battling to restore trust and facing over US$8 billion in costs.\n\nMr Muilenburg was criticised for wooden appearances at the start of the 737 MAX crisis and but has said Boeing has been humbled by the two crashes, in which a total of 346 people died.\n\nHe now faces Congressional hearings next week under growing pressure to rebuild confidence in Boeing and its workhorse jet, having had his chairman role removed earlier this month.\n\nThe earlier statement also ignited a feud between Boeing and Lion Air co-founder Rusdi Kirana who threatened to cancel all planes on order. Lion Air is one of Boeing's largest customers.\n\nThe airline eventually sent a formal protest to Boeing over what it saw as an impermissible effort to cast blame before the probe was complete, two people familiar with the matter said. Since then the dispute has abated, at least in public.\n\nREUTERS", "description": ": THE BUSINESS TIMES Transport - [PARIS] Boeing Co on Friday promised to act on safety recommendations for its 737 MAX aircraft made in a new report by Indonesian investigators on the deadly Lion Air crash a year ago. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/26/nz_boeing_261033.jpg?itok=wEnsO9Q4", "published_at": "2019-10-25"}