{"pub": "nymag", "url": "https://thecut.com/2019/09/ask-polly-im-constantly-worried-my-boyfriend-will-leave-me.html", "downloaded_at": "2019-09-18 10:36:49.800301+00:00", "title": "‘I’m Constantly Worried My Boyfriend Will Leave Me!’", "language": "en", "text": "The Cut’s advice columnist Heather Havrilesky answers readers’ questions about how to be in the world. Got a question for Polly? Email askpolly@nymag.com. Photo: Paul John Davis/Getty Images\n\nDear Polly,\n\nWhat an amazing piece I stumbled upon of yours! Game changer. Inspiring. I want to be the person you described. The hard part is, I am in so many ways. I have a full life. I have been very successful (as you can see if you Google my name) in my creative career. I have many friends and I work on myself constantly. I am very social and hard working. Despite all this, a man’s love seems to be all that truly matters to me.\n\nI still can’t stop obsessing over whoever I’m in a relationship with. I have analyzed and known this about myself forever, but no matter what I try, I can’t seem to kick the need for reassurance that my boyfriend loves me.\n\nYour article at least helped me this morning when I was stuck circling obsessive thoughts about my boyfriend and taking to Google again to try and relieve some of this madness.\n\nMy boyfriend is amazing and open and communicative and talks me through my fears and anxiety, but nothing seems like enough. He is the most secure person I’ve been with — unafraid of communication. He openly says he thinks we’re a good team and asks me what I need in the moments I’m sad.\n\nI don’t know how to stop the cycling loop in my brain that thinks of him and wonders if he still loves me enough or if he’ll leave me soon. It’s always there, even when he talks me through my fears. God, I wish there was an answer.\n\nCan’t Stop Obsessing About My Boyfriend\n\nDear CSOAMB,\n\nThis is about more than obsessing. This is about walking around in a human body that wants way too much. The twitchy, needy, obsessive energy you’re training on your boyfriend right now could be trained on anyone or anything. When you’re obsessed with something, you’re imagining that there’s a cure for your dissatisfaction, your longing, your unsettled feelings, and you will find the solution, no matter what!\n\nEmotionally intense people often turn to the internet like it’s their own personal giant 8-ball. We treat it like a wise friend who can give us the answers we’re looking for. We trick ourselves into believing that there’s some cure for our longing and dissatisfaction, hidden somewhere online. We tell ourselves that we’re looking for information or even just killing time online, but there’s a stronger emotional motive than that: We’re looking for some way to feel whole, to feel loved, to feel calm, to feel turned on, to feel needed, to feel desired, to feel GOOD about the world and our places in it.\n\nLikewise, working very hard and being focused on your career can be a way of trying to feel whole. People who are successful at creative careers often have a long history of funneling their obsessive energy toward some goal: They socialize with a vengeance, they work hard, and they channel their insecurities and longings into figuring out how to be persuasive and entertaining. Their intense emotional insecurity drives them to crack the code: This is how you entertain people and win their love. This is how you charm people and convince them to put their confidence in you. This is how you seduce new friends and new lovers. This is how you squeeze every last ounce of love out of this broken world.\n\nBut the same looping thoughts that made it possible to crack that code can eat you alive once you’ve succeeded. Because your personality itself can feel like a cobbled-together life hack. You might win the job, the popularity, the hot guy, and the money, but there’s still a vulnerable, lost self that lives just underneath the surface. That’s why successful people are just as prone to spending too much time online, Googling random stuff and feeling lost. We like to pretend that only losers spin their wheels online, but social media is packed with successful people. These shiny virtual mazes tap into our weaknesses and amplify our escapism, our obsessions, our longings, and our vulnerability.\n\nLots of sensitive, hard-working people land in this Jekyll-and-Hyde position. You look whole to the outside world. You sound whole when you speak. But underneath it all, you feel needy. Even when someone says “I love you and I want you,” you doubt it, because “you” feels like a polished, persuasive invention. It’s hard to believe that anyone could love the weepy, obsessive weirdo who keeps going back to Google again and again with new worries and questions.\n\nAnd even when you’re not obsessed, you’re inconsistent. You’re an animal with needs, and you’re also a deeply sensitive soul with a past that’s complicated. You get out of bed in the morning and some days, you can tell your story without skipping a beat. But other days, you feel skinless. You want more than your body can contain. Some days, all you want is to be loved for who you are behind your story, underneath your hard work. You want to be loved without reservation, without hesitation. You want to know that you’ll be loved forever, no matter what.\n\nAnimals want too much. And even when we succeed and our hard work is completed, we discover that we aren’t at peace. That’s the hardest thing to achieve: Peace inside your crazy animal body. Peace inside your crazy animal mind. And when you have doubts and shame that you haven’t untangled and examined — slowly, patiently, with care! — it’s very easy to take all of your needs and desires and narrow them down to a single pinhole of light: I WANT LOVE. I WANT TO KNOW THAT I AM LOVED. I NEED THAT LOVE RIGHT NOW.\n\nThat’s your obsession. But if you didn’t want love, or if you had a different story about what might “heal” you, your obsession would sound different. You might believe you needed more sex, or a nicer house, or a bigger doughnut. (That’s not a metaphor, I mean a literal doughnut. Mmmm, doughnuts.)\n\nThe point is, we all have trouble finding peace. And intense problem solvers struggle with it more than most. You give us one thing and we want more things. What we want shifts constantly. We sometimes feel like we’re insatiable.\n\nSo stop beating yourself up for being the hard-working, creative person you are, and for caring about whether or not your boyfriend loves you enough. You love this guy. You’re invested. The stakes are high. You simply want to SOLVE THE PROBLEM THAT’S IN FRONT OF YOU.\n\nBut you do need to give up.\n\nBecause just as the internet won’t give you answers, love won’t heal you and bring you eternal peace. You can love being in love more than anything else in the world (I do!) and still know that it won’t save you from yourself. No matter how many times your brain tells you IF MY BOYFRIEND WILL JUST SAY HE WANTS TO BE WITH ME FOREVER, I WILL FINALLY FEEL COMFORTABLE AND GOOD, it’s not true. You have to let go of that fantasy and learn to accept this imperfect moment instead.\n\nWhen you feel needy and vulnerable, let yourself feel that way. It’s completely natural and human. You have to accept that you’re an emotional person. Because as long as you’re not okay with the truth of how vulnerable and scared you are, no one else will be either.\n\nThe language of your letter is a tell. You say: I’m very successful, Google me, I work on myself constantly, I’m very social, I work very hard. What you’re saying is, “I work so goddamn hard! I do everything right! So why am I still struggling?” That’s how I used to think when I first started writing this column. I already worked on myself constantly, and this column made me work even harder. So when things went wrong, I got very frustrated and I felt incredibly ashamed. Because didn’t I work harder than anyone? Didn’t I already solve this problem? When would all of this hard work be OVER?\n\nThat’s often what we associate with being loved: the end of all the hard work. I remember feeling that way, like once I finally found love, I would never have to work hard again.\n\nI expected to transcend my animal state. I expected to enter a state of eternal peace. Even when I discovered that my shame still outweighed all of my hard work, and that my shame would never go away completely, some part of me was attached to transcending it. I was still a perfectionist. And even once I addressed my shame so thoroughly that it no longer ruled my thoughts and actions — I still wanted more. Part of making peace with yourself includes making peace with the fact that you will always be a moody, insatiable animal.\n\nYour obsession is a way of escaping your real feelings, and pretending that you can tame your animal self, once and for all. You’re plastering over your feelings with thoughts. Quiet your thoughts instead. Forget your charming story. Forget all of that “be a warrior” shit I wrote at the end of the column you read, too. Be who you already are. Because your soft, worried, scared self is beautiful and worthy.\n\nNotice, also, that you’re uncomfortable with downtime. You need to recognize how much you LOVE hard work, but you also need more rest. Most people need more hard work at useful things and they also need much more REAL rest. Instead of drifting through a sea of distractions, we need concrete achievements followed by totally empty, thought-free downtime, when we can feel our feelings and just exist without judgment.\n\nSpend some time with an animal. They love hard work. If I keep my dogs inside all day, they run around in circles, barking. Or they gnaw on each other’s faces. And when they’re not making noise or messes, they’re sulking. But once they’re allowed the luxury of a long walk, they can sleep the rest of the day. They don’t deny themselves that rest, either.\n\nSo stop stigmatizing your true self and give yourself what you need. It sounds paradoxical, but sometimes when I’m extra anxious or obsessive, it’s a sign that my goals aren’t ambitious enough for my taste, and my downtime is too cluttered with distractions. I’m like a dog that needs a long run followed by a long nap. I need more work and better play.\n\nBut more than anything else, you have to learn to cultivate compassion for yourself. That might not be as inspiring as thinking of yourself as omnipotent or supernatural, but it’s the key to almost everything you want. Instead of asking yourself how valuable or charming you are, stand up for your needs and desires, even when they seem a little irrational. When your boyfriend comforts you, don’t think “He shouldn’t have to do this.” Think “This is how people show their love for each other. I deserve this. This feels good. This is how I want to live.” Feel grateful that you can go to these dark places in the company of another human being. No one is about to abandon you. So stop abandoning yourself.\n\nAnd when you feel like what he gives you isn’t quite enough, that it will never be enough? Sit with that. Notice it. Because when you’re an emotionally intense, obsessive, insatiable person, the world can never really give you enough. That’s why you have to learn to give yourself more.\n\nPolly\n\nPolly’s evil twin Molly has a newsletter; sign up here. Order Heather Havrilesky’s new book, What If This Were Enough?, here. Her advice column will appear here every Wednesday.\n\nGet Ask Polly delivered weekly. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nAll letters to askpolly@nymag.com become the property of Ask Polly and New York Media LLC and will be edited for length, clarity, and grammatical correctness.", "description": "In this week’s Ask Polly, the Cut’s advice columnist Heather Havrilesky answers a letter from a reader wondering how to stop obsessing over whether her boyfriend loves her enough.", "authors": ["Heather Havrilesky"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/17/17-ask-polly.w1200.h630.jpg", "published_at": "2019-09-18"}