{"pub": "dailybeast", "url": "https://thedailybeast.com/jeffrey-epstein-dead-in-manhattan-correctional-center-reports", "downloaded_at": "2019-10-01 09:26:14.742000+00:00", "title": "Jeffrey Epstein Is Dead After ‘Suicide Watch,’ but Trafficking Probe Lives as Feds Scramble for Answers", "language": "en", "text": "Pedophile Jeffrey Epstein, 66, has died inside a Manhattan correctional facility in what the Bureau of Prisons called an “apparent suicide.”\n\nThe mysterious multimillionaire—already a convicted sex offender in Florida—has been held without bail at the MCC since his surprise arrest on charges of child sex trafficking at New Jersey's Teterboro airport in early July, after he arrived on his private jet from Paris.\n\nEpstein had initially been held in general population at MCC, where he’d been targeted for extortion as a wealthy pedophile, a person with knowledge of his circumstances told The Daily Beast, before being transferred to a cell with a roommate in the Special Housing Unit separated from the rest of the prison and with extra security.\n\nHe had been placed on suicide watch after he was found in his cell in that unit “in medical distress” on July 23 with “apparent bruising on his neck” and was taken off the suicide watch six days later, The New York Times reported Saturday.\n\nThe person described the injuries from Epstein's first alleged suicide attempt as small abrasions around his neck, and said that while protocols were followed, Epstein had received no preferential treatment afterward.\n\nHe did get a cell to himself in the unit, where the rich man “lived like a pig in a sty” after that attempt, the person said, eating his meals off of the floor and constantly requesting more toilet paper.\n\nIn conversations with other inmates, he at times asked for their inmate numbers, presumably to put money into their accounts.\n\nA spokeswoman for the New York City Office of Chief Medical Examiner confirmed they had Epstein's body, and said, “We are investigating this death. Cause and manner are pending.”\n\nAt 6:39 a.m., staff at the Metropolitan Correctional Center in Manhattan called the Fire Department, which transported Epstein to New York Presbyterian-Lower Manhattan Hospital. He was pronounced dead there, a spokesman confirmed.\n\nAttorney General William Barr—whose father had hired Epstein to teach math at the tony private school Dalton in the late 70s—said in a statement Saturday morning: “I was appalled to learn that Jeffrey Epstein was found dead early this morning from an apparent suicide while in federal custody. Mr. Epstein’s death raises serious questions that must be answered. In addition to the FBI’s investigation, I have consulted with the Inspector General who is opening an investigation into the circumstances of Mr. Epstein’s death.\"\n\nSouthern District U.S. Attorney Geoffrey Berman said in a statement Saturday afternoon that “Today's events are disturbing, and we are deeply aware of their potential to present yet another hurdle to giving Epstein's many victims their day in Court.” He pointedly noted that “our investigation of the conduct charged in the indictment — which included a conspiracy count — remains ongoing.”\n\nThe financier's sudden demise comes only a day after newly unsealed court documents show one of his accusers claimed that he and socialite Ghislaine Maxwell trafficked her to powerful men for sex. Virginia Roberts Giuffre, who says Maxwell recruited her as a 16-year-old during her summer job at Mar-a-Lago, testified that Epstein and Maxwell lent her out for kinky sex with foreign heads of state, a wealthy Wall Streeter, a former U.S. senator, a highly-regarded scientist, and Britain's Prince Andrew.\n\n“The fact that Epstein took his own life within 24 hours of the unsealing of detailed and devastating documents and exhibits in Virginia Giuffre's lawsuit against Ghislaine Maxwell, which informed the public of the scope, scale and sophistication of the international sex trafficking operation Epstein conducted, is no coincidence,” Sigrid McCawley, a lawyer for Giuffre and other victims, and a partner at Boies, Schiller & Flexner, said.\n\n“We are hopeful that the government will continue to investigate and will focus on those who participated and facilitated Epstein's horrifying sex trafficking scheme that damaged so many,” she added.\n\nNone of the other men accused have been charged of a crime and all deny the allegations—as has Maxwell, a British socialite who was Epstein's girlfriend and served as his assistant.\n\nEpstein's death leaves behind a host of baffling questions which now may never be answered. That includes how he built his fortune—he claimed to manage money for billionaires, and served on the board of family charities for financial titans Leon Black and Les Wexner, but experts are dubious of his story and say he instead appeared to have expertise in moving money offshore. Others have speculated that he was blackmailing wealthy clients after luring them to his legendarily lusty parties with beautiful young girls on his private Caribbean island and at his palatial Manhattan townhouse.\n\nAlso unanswered: What Epstein was doing with a safe full of cash, loose diamonds, and an Austrian passport under an assumed name (and with a Saudi address), which feds uncovered when they raided his New York mansion.\n\nWhat is known is that Epstein moved in circles of astounding wealth and influence. He counted President Donald Trump as a friend—until the two fell out over real estate—and flew President Bill Clinton around on his private plane. He palled around with Prince Andrew, went into business with former Israeli Prime Minister Ehud Barak, and hosted salons and getaways for scientific geniuses.\n\nBut behind his glittering facade, Epstein peddled in darkness.\n\nScores of young women have come forward over more than a decade to accuse Epstein of sexual abuse, starting with dozens of underage girls in Florida. Two sisters have also claimed that Epstein and Maxwell raped one of them in Wexner's Ohio mansion, and molested the other while she was underage at the financier's remote Zorro Ranch in New Mexico.\n\nBut the U.S. Attorney's office in Miami decided not to pursue federal charges against the well-connected money man in 2007, allowing him instead to plead guilty in a sweetheart deal to a pair of state prostitution charges. He served 18 months, most of it in the Palm Beach County jail on a lenient work release program.\n\nThe plea deal—which also gave broad immunity to any of Epstein's potential co-conspirators—is now under intense scrutiny, with Florida Gov. Ron DeSantis directing state law enforcement to take over a probe into how Epstein was allowed to leave his cell for 12 hours a day to visit his office and his home. At least one woman has claimed that Epstein abused her while on his work release.\n\nMeanwhile, the feds will soon have to answer how the high-profile inmate managed to kill himself inside a secure lockup and after he'd been previously placed on suicide watch.\n\nAt the time of Epstein's first apparent suicide attempt, he shared a cell with Nicholas Tartaglione, a former police officer charged with kidnapping and murdering four people in 2016. Tartaglione had been housed in the SHU, bunking with Epstein, because corrections officials had allegedly found a cellphone in Tartaglione's previous cell.\n\nTartaglione's lawyer, Bruce Barket, told authorities his client had saved Epstein’s life during the first suicide attempt by alerting corrections officers. He claimed Tartaglione was being implicated in the suicide attempt because he’d recently complained about conditions at the Metropolitan Correctional Center, saying in a statement at the time that \"we warned the judge that officials at the jail would retaliate against Nick because we have been exposing the inhumane conditions at the facility.”\n\nFollowing Epstein's death, MCC cancelled all visits, both family and legal ones, with prisoners on Saturday.\n\nMark Fernich, one of Epstein’s civil attorneys, said in a personal statement Saturday morning that “overzealous prosecutors,” “pandering politicians,” “compliant judges,” “greedy plaintiff's lawyers,” “reckless jailers” and “breathless reporters” reviving public interest in “dated crimes for which he’d long since paid his debt to society under an arms length plea deal just because he had the misfortune to be a wealthy man in the #metoo era whose former prosecutor happened to take a job with President Trump” all had “Mr. Epstein’s blood on their hands.\"\n\nWith Epstein's death, victims and their advocates have again been denied their day in court. Julie Brown, whose reporting for the Miami Herald helped reignite the Epstein case, said on CNN Saturday morning that the focus will now turn on who else should be held accountable to bring justice to the young women whose childhoods were robbed by Epstein.\n\n“The fact that Jeffrey Epstein was able to commit the selfish act of taking his own life as his world of abuse, exploitation, and corruption unraveled is both unfortunate and predictable,” said Brad Edwards, a lawyer for Epstein's victims who has pursued the financier for years.\n\n“While he and I engaged in contentious legal battles for more than a decade, this is not the ending anyone was looking for. The victims deserved to see Epstein held accountable, and he owed it to everyone he hurt to accept responsibility for all of the pain he caused. We will continue to represent his victims and will not stop in their pursuit of finality and justice. It is never too late to come forward with information.”\n\nVictim Jennifer Araoz, who says Epstein and his minions recruited her from a New York high school and raped her when she was just 15, expressed anger on hearing the news of Epstein's suicide. “We have to live with the scars of his actions for the rest of our lives, while he will never face the consequences of the crimes he committed the pain and trauma he caused so many people. Epstein is gone, but justice must still be served,” she said.\n\n“I hope the authorities will pursue and prosecute his accomplices and enablers, and ensure redress for his victims.”\n\n—with additional reporting by Kelly Weill, Barbie Latza Nadeau, and Kate Briquelet", "description": "The convicted pedophile was being held without bail as he faced charges of child sex trafficking.", "authors": ["Pervaiz Shallwani", "Katie Baker", "Harry Siegel", "Senior Editor", "Managing Editor"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1684,w_2995,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1565442575/RTX72U8A_aai6mz", "published_at": "2019-08-10"}