{"pub": "euronews", "url": "https://euronews.com/2019/09/27/world-leaders-at-the-un-and-student-protests-are-not-enough-to-confront-the-climate-crisis", "downloaded_at": "2019-10-05 11:11:23.718450+00:00", "title": "World leaders at the UN and student protests are not enough to confront the climate crisis ǀ View", "language": "en", "text": "Since I left the United Nations in the summer of 2012, I feel a bit nostalgic for the high-level gatherings in New York every year when late September comes about. I was a member of the UN Secretariat, which means working for the UN Secretary-General and the world as a whole, not for any particular country. Nevertheless, I did enjoy passing by the General Assembly Hall and other meeting rooms to observe from up close the world’s greatest political leaders in action.\n\nOf course, because of my position, no matter what I thought of leaders like George W Bush, Tony Blair, Barack Obama, Benjamin Netanyahu, Vladimir Putin or Ignacio Lula da Silva, I would never make a face like that of young climate activist Greta Thunberg when she saw US President Trump passing near her at the UN. Initially I thought that these leaders really determined the future of humanity, as they often claimed in their speeches, and I tried to bring some positive energy around them, hoping that would help deal with the world’s unresolved problems.\n\nUnfortunately, Greta seems to have joined the political theatre and seems to have become a Hollywood production herself. Or maybe the coming weeks will prove me wrong and things will return to the prior state of innocence and truthfulness. Let’s see. Georgios Kostakos Executive Director of the Brussels-based Foundation for Global Governance and Sustainability (FOGGS)\n\nGradually I came to realise that these high-level meetings are primarily about symbolism, public relations and political theatre rather than actual decision-making for the future of the world. Whatever decisions or declarations are made, they have been negotiated among diplomats of the UN’s 193 member states, plus observers and even non-governmental players, over a period of several months before the New York festivities. Leaders basically come and say their piece, sign if there is anything to be signed, and then pose for the “family photo” of leaders.\n\nThis year has been no different, despite the special effects, special guests and special ambitions parading themselves in New York. One of the events that has already taken place on 23 September 2019 was about climate action. Leaders presented their plans for rescuing the planet from the scourge of climate change, several declaring that their countries would become carbon neutral by 2050. Global asset managers promised to align their wealth to the goals of the Paris Agreement and ensure a quick transition to a green economy.\n\nWhen I hear politicians declare ambitious targets for the future, I have by now learnt to doubt their veracity. 2050 is an eternity away for most - if not all - current leaders who won’t have the responsibility of delivering what they now promise thirty years and many election cycles down the road. Another thing that I have understood with time is that the above truth in no way reduces the enthusiasm, pomp and projected conviction with which each and all leaders make such announcements. As I said earlier, it is primarily about political theatre, playing the role of a leader without necessarily being one.\n\nA novel element in debates about climate change in recent months has been the movement of young people demanding action. It is a phenomenon worth studying in detail; how a lonely girl protesting outside the Swedish Parliament has become the symbol of climate activism and mobilise millions around the world in less than a year. Even more surprising is that, despite all this success, she seems to be talking sense and keeping her feet on the ground, literally if you consider her taking no planes to avoid high CO2 emissions.\n\nThis is what I thought until a couple of days ago, when I heard Greta’s intervention at the Climate Action Summit. After hearing just a few phrases, I was sure that something had gone wrong. What 16-year-old girl would use such elaborate language to describe her own situation and threaten leaders? It sounded more like a very militant grown-up had written the speech for her, with a grown-up language and perspective. Unfortunately, Greta seems to have joined the political theatre and seems to have become a Hollywood production herself. Or maybe the coming weeks will prove me wrong and things will return to the prior state of innocence and truthfulness. Let’s see.\n\nThe ultimate responsibility and power resides with us, as consumers, professionals, citizens and voters to change things. Screaming is good once, twice, maybe three times - but then the hard work has to start and it is high time that we start it. Georgios Kostakos Executive Director of the Brussels-based Foundation for Global Governance and Sustainability (FOGGS)\n\nIn any case, neither the political leaders, nor Greta, nor the millions of young people who follow her in protest even, can save the climate and the planet that we love. In the case of the protests, they could continue for ever, every Friday of the school year (holidays excluded) - and then what? Who is supposed to take action? What action should they take and in what way? Do we want declarations from governments and big companies that they will improve their behaviour?\n\nDo we want them to say that they will prohibit the selling of cars, end the extraction of fossil fuels, turn 100% to renewable sources for electricity production, reduce drastically the eating of meat, prosecute companies that benefit from farming in previously forested areas, and so on? Even if they did say these things, who would want them to happen? Would the students and their parents rush to approve?\n\nAll the things that need to be done to avoid a further worsening of the climate emergency and to adapt to its inevitable effects have an impact on individual citizens and actually require life-changing choices from each one of them. Each one of us. Are we ready to stop using private cars and adopt public transport, reduce meat and dairy consumption, pay to insulate our homes to avoid energy waste, make sure we do not contribute to food waste, install renewable energy sources etc? That is where the fight needs to be taken - and where it will be won or lost.\n\nThe ultimate responsibility and power resides with us, as consumers, professionals, citizens and voters to change things. Screaming is good once, twice, maybe three times - but then the hard work has to start and it is high time that we start it.\n\nGeorgios Kostakos is Executive Director of the Brussels-based Foundation for Global Governance and Sustainability (FOGGS). He has been extensively involved in global governance, sustainability and climate-related activities with the United Nations and beyond. One of the initiatives that FOGGS supports is the Citizens Climate Pledge.\n\n____________\n\nAre you a recognised expert in your field? At Euronews, we believe all views matter. Contact us at view@euronews.com to send pitches or submissions and be part of the conversation.", "description": "Because of my position, no matter what I thought of leaders like George W Bush, Tony Blair, Barack Obama, Benjamin Netanyahu, Vladimir Putin or Ignacio Lula da Silva, I would never make a face like that of young climate activist Greta Thunberg when she saw President Trump passing near her at the UN.", "authors": ["Georgios Kostakos", "Executive Director Of The Brussels-Based Foundation For Global Governance", "Sustainability", "Foggs"], "top_image": "https://static.euronews.com/articles/stories/04/18/93/20/1000x563_cmsv2_461755cf-457f-5d2c-9af1-713c555f89e9-4189320.jpg", "published_at": "2019-09-27"}