{"pub": "thenextweb", "url": "https://thenextweb.com/plugged/2019/10/16/cheap-stop-living-under-a-rock-get-the-maxed-out-surface-laptop-for-just-1049", "downloaded_at": "2019-10-16 13:32:53.849410+00:00", "title": "CHEAP: Stop living under a rock, get the maxed out Surface Laptop for just $1,049", "language": "en", "text": "Welcome to CHEAP, our series about things that are good, but most of all, cheap. CHEAP!\n\nEarlier this month, Microsoft announced the Surface Laptop 3 at its special event. While the entry-level configuration starts at $999, you will have to spend more than $2000 to get the top configurations.\n\nBut if you don’t want to spend too much money, and still get top-notch specs on a laptop, we’ve got a great deal for you. The maxed-out original Surface laptop is available for just $1,049, down from $2,699.\n\nEven after two years of its launch, the Surface Laptop’s specs hold its own weight.\n\nSpecifications:\n\n7th generation Intel Core i7 processor\n\n13.5-inch PixelSense touchscreen display with 2256 x 1504 resolution\n\n1TB SSD\n\n16GB RAM\n\nIntel HD Graphics 620\n\nBluetooth 4.0, Wi-Fi: 802.11ac Wireless LAN\n\nUSB 3.0, Mini DisplayPort, SD Card Slot.\n\nWindows 10 S\n\nThis configuration is more than enough for your daily work on the go, web surfing, and binge-watching some shows.\n\nDon’t miss out on this delicious deal. Get the maxed-out Mircosoft Surface Laptop for just $1,049 ($1,650 off).\n\nThis post includes affiliate links to products that you can buy online. If you purchase them through our links, we get a small cut of the revenue.\n\nFor more gear, gadget, and hardware news and reviews, follow Plugged on Twitter and Flipboard.", "description": "", "authors": ["Ivan Mehta", "October"], "top_image": "https://img-cdn.tnwcdn.com/image/plugged?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2FSurface-deal.jpg&signature=07e499cb18d8661e69db6ee1e47eddba", "published_at": "2019-10-16"}