{"pub": "fox", "url": "https://foxnews.com/politics/gordon-sondland-ambassador-involved-in-ukraine-controversy-to-testify-trump-told-him-no-quid-pro-quo", "downloaded_at": "2019-10-14 23:22:45.078812+00:00", "title": "Gordon Sondland, ambassador involved in Ukraine controversy, to testify Trump told him 'no quid pro quo'", "language": "en", "text": "The U.S. ambassador to the European Union, Gordon Sondland, is expected to tell congressional lawmakers on Thursday that President Trump told him there was no quid pro quo when it came to Trump’s controversial July phone call with Ukrainian President Volodymr Zelenskiy.\n\nA person familiar with his planned testimony told Fox News that Sondland is expected to say that his text message reassuring another envoy that there was no quid pro quo in their interactions with Ukraine was based on a phone call he had with Trump that lasted less than five minutes.\n\nSondland is also expected to tell Congress he has no knowledge of whether Trump was telling him the truth – only that he told him there was no quid pro quo --and that he believes the president’s reassurances and passed along in a text message exchange his own belief that the White House was not making military aid to Ukraine contingent on an investigation into a company linked to the family of a chief Democratic presidential rival, former Vice President Joe Biden.\n\n‘WHERE’S HUNTER?’ TRUMP ASKS, AS BIDEN’S SON PROMISES NOT TO WORK WITH FOREIGN COMPANIES IF FATHER WINS PRESIDENCY IN 2020\n\nIn the text exchange, the diplomats raised alarm that Trump appeared to up the ante, withholding military aid to Ukraine over the investigation.\n\nOne seasoned diplomat on the text message, William Taylor, called it \"crazy to withhold security assistance\" to Ukraine in exchange for \"help with a political campaign.\"\n\nSondland responded that the assertion is \"incorrect\" about Trump's intentions. \"The President has been crystal clear no quid pro quo's of any kind,\" he said in the text message.\n\nSondland was subpoenaed by several House committees when he failed to appear for questioning after the Trump administration blocked him from testifying. He announced Friday that he would appear for questioning on Capitol Hill this week, in apparent defiance of the State Department.\n\n“Ambassador Sondland has requested that the Department of State allow him to testify as soon as possible,” Jim McDermott, a lawyer representing Sondland, said in a statement emailed last Thursday. “Precisely because no one is above the law, Ambassador Sondland has turned over all relevant documents sought by Congress to the Department of State, as the Federal Records Act requires.”\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nOne witness who may not be called before Congress is the still-anonymous government whistleblower who touched off the impeachment inquiry. Top Democrats say testimony and evidence coming in from other witnesses, and even the president himself, are backing up the whistleblower's account of what transpired during Trump's July 25 phone call with Zelenskiy. Lawmakers have grown deeply concerned about protecting the person from Trump's threats over the matter and may not wish to risk exposing the whistleblower's identity.\n\nDemocratic Rep. Adam Schiff, chairman of the House Intelligence Committee, said Sunday, \"We don't need the whistleblower, who wasn't on the call, to tell us what took place during the call. We have the best evidence of that.\"\n\nSchiff said it \"may not be necessary\" to reveal the whistleblower's identity as the House gathers evidence. \"Our primary interest right now is making sure that that person is protected,\" he said.\n\nFox News’ Mike Emanuel and The Associated Press contributed to this report.", "description": "The U.S. ambassador to the European Union, Gordon Sondland, is expected to tell congressional lawmakers on Thursday that President Trump told him there was no quid pro quo when it came to Trump’s controversial July phone call with Ukrainian President Volodymr Zelenskiy.", "authors": ["Andrew O'Reilly"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/08/694940094001_6093276976001_6093273055001-vs.jpg", "published_at": "2019-10-14"}