{"pub": "yahoo", "url": "https://news.yahoo.com/russias-submarines-dangerous-used-war-063300750.html", "downloaded_at": "2019-10-05 00:04:27.905485+00:00", "title": "Russia's New Submarines Are Dangerous. But How Would They Be Used in War?", "language": "en", "text": "It’s no secret that the Russian navy is investing heavily in new classes of submarines, even while overall Russian military spending flatlines amid a wide economic crisis. But it’s less clear exactly what the Russians intend to do with potentially dozens of modern submarines in the event of war.\n\nWestern analysts should think creatively in order to suss out the Kremlin’s undersea intentions, Norman Polmar, a leading American naval analyst, wrote in Proceedings, the professional journal of the U.S. Naval Institute.\n\n“Submarines appear to have a high priority in Russia’s current efforts to rebuild its armed forces,” Polmar wrote in the October 2019 edition of Proceedings. “How will the submarines most likely be employed? The answer must be determined by thinking outside the box.”\n\nWhere the Russian navy is all but abandoning the production of new aircraft carriers, cruisers and other “blue-water” surface warships, it has recommitted to sustaining a large fleet of big, long-range submarines.\n\n“Although the navy is mainly made up of Soviet-era surface ships and submarines, an extensive modernization program is underway, focusing first on the submarine force,” the U.S. Defense Intelligence Agency reported in 2017. “Progress in submarine modernization is underway.\n\nAs recently as 2017, the Russian fleet operated 61 submarines. “Historically the backbone of the Russian navy, 75 percent of the 61 operational submarines are over 20 years old and are slowly being replaced,” the DIA explained.\n\nThree new classes account for the bulk of new production. The Borei- or Dolgorukiy-class, nuclear-powered ballistic-missile submarine, the Yasen-class, a nuclear-powered attack submarine and an improved version of the Kilo-class diesel-electric attack submarine.\n\nRead the original article.", "description": "Where the Russian navy is all but abandoning the production of new aircraft carriers, cruisers and other “blue-water” surface warships, it has recommitted to sustaining a large fleet of big, long-range submarines. Why?", "authors": ["David Axe"], "top_image": "https://s.yimg.com/uu/api/res/1.2/gnNqM4Tx2gj9j_gHBNIojQ--~B/aD03Nzg7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_national_interest_705/0bd5cf5d9c0c875d77053e0115e50bcd", "published_at": "2019-10-04"}