{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/19/everton-west-ham-premier-league-match-report", "downloaded_at": "2019-10-19 14:11:13.151445+00:00", "title": "Everton relief for Marco Silva as Bernard and Sigurdsson sink West Ham", "language": "en", "text": "Perhaps Marco Silva was right not to panic after all. The Everton manager’s job looks a lot safer after his side inflicted a first away defeat of the season on West Ham, climbing out of the bottom three in the process for a few hours at least.\n\nThis was by no means West Ham’s most convincing performance of the season – despite their league position they looked ponderous and lethargic from the start so it might be a little early for anyone to get carried away – though here at least was evidence that Everton can play in the way Silva expects.\n\nThe manager made five outfield changes from the dismal display at Burnley and was rewarded by the sight of players in blue passing quickly, finding each other well and putting direct pressure on the visitors’ defence from the outset. If one had to be critical it could be said that Everton’s decision-making in the final third was not as impressive as the application and appetite they showed over the rest of the pitch, one reason why their overall superiority did not show up in the scoreline, but a crowd-pleasing win was exactly what the club needed after a miserable few weeks.\n\nEverton 2-0 West Ham: Premier League – live! Read more\n\nBernard scored the goal that mattered early in the first half, fastening on to Theo Walcott’s delightfully disguised pass and appearing to take the wrong option in disdaining a first-time shot, only to outwit Arthur Masuaku and then Roberto Jiménez to find the net from an improbably narrow angle. West Ham could not complain; they could easily have gone behind 10 minutes earlier when a corner came through to Tom Davies at the far post and an indecisive finish allowed Jiménez to make a point-blank save.\n\nTime and again in the first half Everton would make rapid progress down the left through Bernard and Lucas Digne, only to run out of ideas on the edge of the West Ham area. Richarlison hit a post but shots from Walcott and Alex Iwobi were from too far out to cause Jiménez any problems. The same pattern continued in the second half, which began with an otherwise crisp finish by Richarlison being denied by an offside flag. Walcott hit the bar from 25 yards, Yerry Mina saw a couple of headers from corners saved and Iwobi missed a glorious chance to seal victory after excellent work by André Gomes and Djibril Sidibé, ghosting unchallenged into the area but putting his shot far too close to Jiménez.\n\nTottenham v Watford, Chelsea v Newcastle and more – live! Read more\n\nWest Ham were largely dormant for more than an hour, though as full time approached with a draw still a possibility they stepped up in search of an equaliser. They might have had one, too, but after a quiet afternoon Jordan Pickford’s reflexes were still up to keeping out a close range effort from Angelo Ogbonna in what amounted to the visitors’ best chance. By the time Gylfi Sigurdsson came on to bring a dramatic save from Jiménez at the other end before beating him with another shot from outside the area in added time, Everton could reflect that they ought to have won the game by three or four clear goals.\n\nWhile work on finishing and final delivery is obviously required, the main positive for Silva was a midfield that worked. Behind the front line Davies and Gomes operated smoothly and stylishly. Spectacular as Sigurdsson’s late strike was, the Iceland international can no longer take his place in the starting lineup for granted.", "description": "Everton took an early lead against West Ham through Bernard and did not pay for subsequent misses, with Gylfi Sigurdsson sealing a 2-0 win for the under-pressure Marco Silva", "authors": ["Paul Wilson"], "top_image": "https://i.guim.co.uk/img/media/b69121e1045da29715ac739494d73e4bb2fc1d5e/34_181_2947_1769/master/2947.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=4108fa6745877537b1f4d8b4456696e3", "published_at": "2019-10-19"}