{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7628793/Hilary-Duff-sports-mustard-coat-plaid-skirt-day-filming-Lizzie-McGuire-movie.html", "downloaded_at": "2019-10-30 04:16:23.900229+00:00", "title": "Hilary Duff sports mustard coat with a plaid skirt on first day of filming Lizzie McGuire movie", "language": "en", "text": "She's returning to the big screen to play a character that catapulted her into the spotlight at a young age.\n\nAnd Hilary Duff looked positively delighted on the first day of filming the new Lizzie McGuire movie in New York City on Tuesday afternoon.\n\nThe 32-year-old actress was all-smiles while dressed in a gorgeous mustard coat to film scenes in Washington Square Park.\n\nHey now! Hilary Duff looked positively delighted on the first day of filming the new Lizzie McGuire movie in New York City on Tuesday afternoon\n\nHilary looked impossibly chic wearing a yellow-and-black plaid blazer paired with a matching mini skirt.\n\nA host of gold necklaces were prominently displayed on top of a black crewneck top which was tucked into her skirt.\n\nAdding even more emphasis on the perfect color for the fall season, Duff stayed warm in a long mustard peacoat which dipped down below her knees.\n\nWhat dreams are made of: The 32-year-old actress was all-smiles while dressed in a gorgeous mustard coat to film scenes in Washington Square Park\n\nFashion forward: Hilary looked impossibly chic wearing a yellow-and-black plaid blazer paired with a matching mini skirt\n\nBack in action: She posted on Instagram with a slew of emojis to follow: 'Happy first LIZZIE day!!!!! NYC.....cue the rain'\n\nThe So Yesterday songstress pounded the pavement in a pair of black leather booties and carried an off-white leather purse across her shoulder.\n\nShe seemed to have no problems staying hydrated for the day as she carried a massive cup from Starbucks in one hand and a water bottle in the other.\n\nAnd the rainy weather wasn't much of a problem as Hilary walked back and forth on set with the help of a trusty umbrella handler.\n\nFunky: A host of gold necklaces were prominently displayed on top of a black crewneck top which was tucked into her skirt\n\nSeason's greetings: Adding even more emphasis on the perfect color for the fall season, Duff stayed warm in a long mustard peacoat which dipped down below her knees\n\nHelping hands: And the rainy weather wasn't much of a problem as Hilary walked back and forth on set with the help of a trusty umbrella handler\n\nThe Younger star was later spotted carrying a massive stuffed white llama through the park while filming.\n\nShe posted on Instagram with a slew of emojis to follow: 'Happy first LIZZIE day!!!!! NYC.....cue the rain.'\n\nFans were overjoyed when Hilary announced the return of their favorite Disney character during the D23 expo in Anaheim, California a few months ago.\n\nDuff starred as the Lizzie in the classic show which aired on the popular children's network for three years before turning into a movie.\n\nA mood: The Younger star was later spotted carrying a massive stuffed white llama through the park while filming", "description": "The 32-year-old actress was all-smiles while dressed in a gorgeous mustard coat to film scenes in Washington Square Park on Tuesday afternoon.", "authors": ["Tracy Wright For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/02/20357620-0-image-a-54_1572403921992.jpg", "published_at": "2019-10-30"}