{"pub": "yahoo", "url": "https://finance.yahoo.com/news/johnson-johnson-must-pay-8-bn-over-drug-032030769.html", "downloaded_at": "2019-10-09 12:50:49.690938+00:00", "title": "Johnson & Johnson must pay $8 bn over drug side effect: jury", "language": "en", "text": "Johnson & Johnson said it was \"confident (the ruling) will be overturned,\" calling the $8bn jury award against it \"grossly disproportionate\" (AFP Photo/Mark RALSTON)\n\nNew York (AFP) - A Pennsylvania jury ruled Tuesday that US pharmaceutical giant Johnson & Johnson must pay $8 billion in damages and interest for failing to warn that a psychiatric drug could cause breast growth in men.\n\nJohnson & Johnson and its subsidiary Janssen Pharmaceuticals were blamed as plaintiff Nicholas Murray told the Philadelphia court that the drug Risperdal, prescribed to treat schizophrenia and bipolar disorder, had made him grow breasts.\n\nThe company challenged the ruling in a statement, calling the damages awarded \"grossly disproportionate\" with the initial award in the case of $680,000.\n\n\"The company is confident (the ruling) will be overturned,\" the statement said, and \"will be immediately moving to set aside this excessive and unfounded verdict.\"\n\nIn the statement, Johnson & Johnson accused the court of preventing their defense team from presenting \"key evidence\" on Risperdal labeling.\n\nThe company is facing a series of complaints in state courts for failing to properly warn of Risperdal's side effects, including in Pennsylvania, California and Missouri.\n\nRisperdal, approved for the treatment of adults by the US Food and Drug Administration in 1993, brought in some $737 million (672 million euros) in sales in 2018.", "description": "A Pennsylvania jury ruled Tuesday that US pharmaceutical giant Johnson & Johnson must pay $8 billion in damages and interest for failing to warn that a psychiatric drug could cause breast growth in men.  Johnson & Johnson and its subsidiary Janssen Pharmaceuticals were blamed as plaintiff Nicholas Murray", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/L_KFzmtLalyhCUJj8Gzjog--~B/aD00OTY7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/b85ae9b1484d7aedf84ffb52f4c410c35f9b3dfc.jpg", "published_at": "2019-10-09"}