{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7547841/Perth-nightclub-manager-continues-shame-teenager-complained-drink-spiked.html", "downloaded_at": "2019-10-07 23:32:08.372440+00:00", "title": "Perth nightclub manager continues to shame teenager who complained her drink was spiked", "language": "en", "text": "A controversial nightclub manager has refused to back down after shaming a 19-year-old girl who complained her drink was spiked.\n\nShantel Smith, 19, visited Rapture Nightclub, in Perth's Northbridge entertainment district, on Saturday night and believes someone slipped something into her drink.\n\nShe reported the alleged incident to the venue but the club manager Neil Temple Scott replied that her claim was a 'beat up' and demanded proof.\n\nThe 66-year-old further ridiculed Ms Smith by sharing CCTV of the teenager at the club to social media on Monday morning as proof she hadn't been drugged.\n\nShantel Smith, 19, said she visited Rapture, in Perth's Northbridge entertainment district, on Saturday night and believes someone slipped something into her drink\n\n'Lets face it, why would somebody spike her drink? Why would they do that? What are they hoping to get? What is she hoping to get from it?' he told 9 News.\n\n'I don't know if she thinks she's special enough to be spiked, I don't know if that's how it works.'\n\nSpeaking to The West, Mr Scott said the 'plain Jane' teenager had more than likely made up the story for attention.\n\n'She's not a particularly attractive girl. It's just implausible to imagine that she had her drink spiked, it just doesn't sort of add up.'\n\n'She's just a very plain Jane type of girl. I can't understand why anybody would be possessed by her.'\n\nMs Smith described the nightclub's response as 'upsetting'.\n\nShe said: 'The response was definitely upsetting, the fact they took a couple of days to reply and you know they responded with such a horrible message was definitely very disappointing.'\n\nMs Smith said she only had two or three drinks before arriving and only had one drink inside before she became unwell.\n\n'I was then unconscious for the next two and a half hours, vomiting, and experiencing other common symptoms of a date rape drug,' she said in message to the nightclub.\n\nWhen she reported the alleged incident to the venue, Rapture Nightclub in Perth, it sent her this response instead of apologising\n\nWhat Ms Smith sent Rapture's Facebook page after her night out that prompted Mr Scott's response\n\nMs Smith said she didn't see any bouncers near the bar and suggested the club beef up its security to protect its reputation.\n\nInstead of addressing her concerns or apologising for what allegedly happened, the club instead fired back in their original response.\n\n'Why would anyone want to spike your drink? Did you attend a hospital and have your stomach pumped for evidence?' the response read.\n\n'Is this something you and your friends experience regularly? Would you like a crowd controller to hold your drink for you next time you attend a nightclub?\n\nSpeaking to Nine News , Mr Scott claimed he regretted sending the message but stood by his doubts. 'Lets face it, why would somebody spike her drink? Why would they do that? What are they hoping to get? What is she hoping to get from it?' he said\n\nMs Smith (pictured) described the nightclub's response as 'upsetting'\n\n'Do you think ten crowd controllers would be able to stop you having your drink spiked?\n\n'Are you worth someone trying to spike your drink?\n\n'We think this is a beat up and we believe that no one would be stupid enough to waste their drugs on spiking anyone's drink.'\n\nMs Smith was astonished by the reply and posted the message on social media.\n\nMs Smith, the victim, posted the response to Instagram and the social media pages of both Rapture and Mr Scott were bombarded with negative comments\n\nNeil Temple Scott, 66, ridiculed a young patron who complained to Rapture Nightclub in Perth that her drink was spiked on Saturday night\n\nRapture's Facebook page was soon bombarded with hundreds of negative reviews slamming the club's response.\n\nIn the wake of the social media blowout, Mr Scott posted CCTV of Ms Smith at the club.\n\n'The large girl with the white top, the short black skirt and the black and white shoes is Shantel Smith, the girl who claimed to have had her drink spiked,' he wrote.\n\n'She can be seen entering Rapture Nightclub at 10.58pm and leaving at 2.53am. Note none of her friends seems perturbed at all.\n\nMr Scott early on Monday morning he posted CCTV of Ms Smith entering the leaving the club to support his claim that her drink was never spiked\n\n'She seems in good spirits and did not leave the club once in the 2 hours 55 minutes of attendance. Nor did she seek help or assistance from any of the 14 staff on duty.'\n\nMr Scott was vilified for posting the CCTV footage online with hundreds of angry punters threatening to boycott the venue.\n\n'Regardless if this young girl was in fact spiked at your club is besides the point. You victimised and humiliated her,' one woman wrote.\n\n'Her first message to you wasn't even her trying to get anything out of it,' a second woman added.\n\n'It was just to make you aware of what happened and to try and prevent it happening to someone else! Your response back to her is why everyone's mad! These videos prove nothing except that you're a terrible person.'\n\nAnother conversation soon emerged allegedly showing the nightclub making a disgusting comment to a woman who asked about the dress code\n\nAnother conversation soon emerged showing the club making a disgusting comment to a woman who asked about the dress code.\n\n'Hey are black sweatpants acceptable to wear?' she asked.\n\n'If you get stopped at the door, just take them off. I'm sure that will be ok. Make sure you wear a gstring,' the club's Facebook page replied.\n\nMs Smith claimed to have been unconscious and throwing up for two and a half hours after her first drink at Rapture.\n\nVictims of GHB and other 'date rape' drugs usually only feel the effects for about three hours, or potentially less if they vomit some of it before it is absorbed.", "description": "Shantel Smith, 19, visited Rapture Nightclub, in Perth 's Northbridge entertainment district, on Saturday night and believes someone slipped something into her drink.", "authors": ["Zoe Zaczek", "Nic White For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/22/19414838-0-image-a-4_1570484230459.jpg", "published_at": "2019-10-07"}