{"pub": "guardian", "url": "https://theguardian.com/food/2019/sep/10/nigel-slaters-midweek-recipe-sweetcorn-chowder-soup", "downloaded_at": "2019-09-10 23:33:15.556209+00:00", "title": "Nigel Slater’s sweetcorn chowder", "language": "en", "text": "Capture the last days of summer with this simple soup, made from the season’s sweetest, sunniest vegetable\n\nThe recipe\n\nPeel and roughly chop 2 medium onions, then let them soften with 30g of butter and 2 tbsp of olive oil in a deep pan over a moderate heat.\n\nWhen the onions are soft and sticky, slice the kernels from 5 heads of sweetcorn, then set those from 1 head aside. Stir the sweetcorn into the onions, pour in 500ml of full cream milk and, if you have them, a couple of pieces of parmesan rind. Bring to the boil, lower the heat and simmer for 10 minutes.\n\nRemove the rinds, then ladle the soup into a blender and reduce to a smooth, creamy consistency. Return to the saucepan and keep warm.\n\nIn a shallow pan, fry 80g of fresh white breadcrumbs and 100g of chopped nduja over a moderate heat for a couple of minutes, then stir in the reserved sweetcorn kernels and continue cooking until the crumbs are rust-red and starting to crisp. Chop a handful of parsley leaves and stir them into the crumbs.\n\nLadle the soup into bowls, scatter the toasted nduja crumbs over the surface and eat immediately. Enough for 4.\n\nThe trick\n\nTo extract the kernels from the heads of sweetcorn, remove the papery husks and pull off and discard the silky fibres that lie underneath. Place the corn, standing on its stem end, on a chopping board, then slice downward with a large cook’s knife, moving round the head of corn until all the kernels are sliced off.\n\nThe twist\n\nIn place of nduja, use pancetta or bacon, cut into small dice. For a textural change, blend only half the soup until smooth, then stir the rest back into the pan.\n\nFollow Nigel on Twitter @NigelSlater", "description": "Capture the last days of summer with this simple soup, made from the season’s sweetest, sunniest vegetable", "authors": ["Nigel Slater"], "top_image": "https://i.guim.co.uk/img/media/e6d48be5519394ceb341c9684f24af98fdef704d/0_761_5126_3074/master/5126.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=2c56d8047533e555f279cebaf4e325c2", "published_at": "2019-09-10"}