{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/7/southwest-pilots-union-sues-boeing-over-grounding-", "downloaded_at": "2019-10-07 23:36:03.228346+00:00", "title": "Southwest pilots' union sues Boeing over grounding of plane", "language": "en", "text": "DALLAS (AP) - The union representing Southwest Airlines pilots is suing Boeing, saying its pilots are losing money because the company rushed an unsafe plane into service only to have the 737 Max grounded after two deadly crashes.\n\nThe Southwest Airlines Pilots Association said in the lawsuit filed Monday that Boeing misled pilots and airlines by not telling them about a new flight-control system called MCAS that is now at the center of investigations into the accidents.\n\nThe lawsuit, filed in a Texas state court in Dallas, could make it harder for Boeing to gain public confidence in the plane. Chicago-based Boeing hopes to use pilots in a campaign to reassure travelers once regulators approve changes that the company is making to the plane.\n\nSouthwest had more Max jets than any airline when the plane was grounded in March. It has canceled thousands of flights through early January as a result.\n\nThe president of the pilots’ union said in an interview that the lawsuit followed failed negotiations with Boeing over compensation for income that pilots have lost due to canceled flights. Also at issue were the union’s expenses to comply with a subpoena from the Justice Department, which is conducting a criminal investigation into Boeing’s representations to regulators who certified the plane.\n\nThe union leader, Jon Weaks, said he believes Boeing will make the plane safe and pilots will resume flying it.\n\n“When the plane comes back, it will be one of the most examined airplanes ever,” he said. “The problems they had with MCAS are being engineered out of it.”\n\nThe lawsuit, however, uses harsh language in condemning Boeing for what it told airlines and pilots about the Max, which went into service in 2017. Boeing sold the plane as a more fuel-efficient but otherwise lightly modified version of the 737, which has flown since the 1960s.\n\n“Those representations proved to be false,” the union says in its lawsuit. “The 737 MAX now is grounded worldwide because it is unsafe, unairworthy, and contrary to Boeing’s representations, distinct from the 737 family of aircraft that preceded it, which SWAPA pilots have flown for years.”\n\nCrashes involving Max jets in Indonesia and Ethiopia killed 346 people. The company faces dozens of lawsuits filed by passengers’ families and has settled a few for undisclosed terms. In July, it announced a $4.9 billion after-tax charge to cover compensation it expects to pay airlines in coming years to cover canceled flights.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The union representing Southwest Airlines pilots is suing Boeing, saying its pilots are losing money because the company rushed an unsafe plane into service only to have the 737 Max grounded after two deadly crashes.", "authors": ["The Washington Times Http", "David Koenig"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/07/boeing_plane-southwest_pilots_38702_c94-0-5400-3094_s1770x1032.jpg?f8e3c61af7373e6e2161fd87efc45b2d94c31e6d", "published_at": "2019-10-07"}