{"pub": "wsj", "url": "https://wsj.com/articles/eus-new-boss-invoking-european-way-of-life-sparks-partisan-brawl-11568885402?mod=rsswn", "downloaded_at": "2019-09-19 09:39:06.290211+00:00", "title": "EU’s New Boss, Invoking ‘European Way of Life,’ Sparks Partisan Brawl", "language": "en", "text": "The incoming European Commission president, Ursula von der Leyen, needs support from parliamentary political leaders to get her team of commissioners into office.\n\nBRUSSELS—Partisan bickering between Europe’s left and right is threatening to engulf the once-insulated technocratic institution of the European Commission as new leaders take charge.\n\nUrsula von der Leyen, set to become the commission’s new president in November, faces a showdown in the European Parliament on Thursday, as she meets political leaders who question her choice of words.\n\nMrs. von der Leyen, a former German defense minister, is accused by centrist and left-wing lawmakers of catering to the far right when drafting titles for her team of 26 commissioners. One of her eight deputies, in charge of migration, education and security, was given the title “Vice-President-Designate for Protecting our European Way of Life.”\n\nAnother, from Croatia, will become vice president for “Democracy and Demography,” while a third is tipped to be in charge of “Interinstitutional Relations and Foresight.”\n\nSHARE YOUR THOUGHTS Do you see the expression “our European way of life” as inclusive or xenophobic? Why? Join the conversation below.\n\nThe commission, the executive branch of the European Union, drafts regulations, imposes fines and negotiates trade deals, among other responsibilities. Mrs. von der Leyen has pledged to lead a “geopolitical commission” able to face down competition from China and the U.S.\n\nShe needs support from parliamentary political leaders to get her team of 26 commissioners voted into office in the coming weeks. If she stands firm on the titles, as she has pledged to, she could face delays in taking office as planned on Nov. 1.\n\nAlongside the title fight, some lawmakers have raised ethics questions about several designated commissioners. The parliament will hold three-hour hearings for each of the 26 nominees in the first week of October before deciding whether to approve or reject them for the proposed posts.\n\nLawmakers in European Parliament have the power to force Mrs. von der Leyen to reshuffle her team. Photo: vincent kessler/Reuters\n\nLawmakers have the power—and have used it with previous commissioners—to force Mrs. von der Leyen to reshuffle her team or ask countries to send new candidates. Newly proposed commissioners would then need to be screened, further delaying the process.\n\nMrs. von der Leyen has made several promises for her first 100 days in office, including new regulations on technology and the green economy.\n\n“Of course, words matter,” she said in an op-ed published on Monday in several European newspapers, her first since EU leaders picked her for the job in July. “For some, the European way of life is a loaded and politically charged term. But we cannot and must not let others take away our language from us: This is also part of who we are.”\n\nOne day earlier, France’s nationalist and anti-immigrant leader Marine Le Pen said the migration commissioner’s title “confirms our ideological victory” and that the EU was “forced to admit that immigration poses questions about the future of Europeans’ way of life.”\n\nMrs. von der Leyen’s ally in the European Parliament, German lawmaker Manfred Weber, who leads the center-right caucus in the house, on Tuesday defended the “correct definition of the European way of life, which is to rescue people in the Mediterranean, and not to close harbors.”\n\nMr. Weber also sparked outrage when asking reporters: “Is there someone in the room who wants to live the Chinese way of life, the African way of life or the American way of life?”\n\nCentrist, left-wing and Green politicians in the parliament have criticized the migration commissioner’s title and said Mrs. von der Leyen must change it or face trouble during the hearings.\n\nThe current commission president, Jean-Claude Juncker, also pitched in. “I don’t like the idea that the European way of life is opposed to migration,” he told broadcaster Euronews last week.\n\nMrs. von der Leyen maintains that the European way of life refers to fundamental values and human rights.\n\n“We have seen foreign powers interfere in our elections…and we have seen homegrown populists with cheap nationalistic slogans try to destabilize us from the inside,” she wrote in the op-ed. “We should not allow these forces to hijack the definition of the European way of life.”\n\nWhile some EU officials suggested it was a mistake for Mrs. von der Leyen to double down on a potentially poisonous identity debate, some analysts said it speaks to her character.\n\nGiven that she was appointed with the support of conservative governments in central and Eastern Europe, Mrs. von der Leyen made a conscious decision to alienate left-wing rather than right-wing politicians, said Camino Mortera-Martinez, a senior research fellow with the Centre for European Reform, a London-based think tank.\n\n“She’s much less a compromise figure than people thought,” Ms. Mortera-Martinez said.\n\nWrite to Valentina Pop at valentina.pop@wsj.com", "description": "Partisan bickering between Europe’s left and right is threatening to engulf the once-insulated technocratic institutions of the European Commission as new leaders take charge.", "authors": ["Valentina Pop", "Valentina.Pop Wsj.Com"], "top_image": "https://images.wsj.net/im-108408/social", "published_at": "2019-09-19"}