{"pub": "bbc", "url": "https://bbc.com/news/science-environment-49596734", "downloaded_at": "2019-09-06 12:18:29.223211+00:00", "title": "Stranded whales: Numbers on the rise around UK shores", "language": "en", "text": "Image copyright Getty Images Image caption A sperm whale lies dead after becoming beached in Norfolk\n\nThe number of whales and dolphins washing up around the UK coastline has risen, according to new figures.\n\nIn 2017 alone, 1,000 animals were stranded - more than in any year since records began.\n\nA total of 4,896 whales, dolphins and porpoises died on beaches between 2011 and 2017 - up 15% on the previous seven years.\n\nScientists found a number of causes for the deaths, including infectious diseases, fishing and plastic.\n\nIt's difficult to say conclusively what's driven the rise, but it's associated with multiple causes, including rises in some dolphin and whale populations, they say.\n\n\"Strandings aren't actually in and of themselves bad news,\" Rob Deaville of ZSL (Zoological Society of London), who led the report, told BBC News.\n\n\"There's a misconception that we're trying to stop strandings - we're not, we're trying to learn more about those that are due to human activities and then try and mitigate those where we can.\"\n\nIn some respects the data paints a bleak picture, but there are still positives to be drawn, he added.\n\nMore than 20 cetacean (whale, dolphin and porpoise) species were recorded over seven years - roughly a quarter of all cetacean species known in the world.\n\nOne, the dwarf sperm whale, had never before been seen in the UK.\n\nWhy are scientists investigating this?\n\nSince 1990, scientists have been investigating why whales, dolphins and porpoises wash up around the UK coastline.\n\nThis gives an insight into the health of marine wildlife in British waters, the changing patterns of different species, and threats from human impacts, such as chemical pollution, marine noise and accidental fishing.\n\nThe underlying causes of whales becoming stranded on beaches are not always clear, including any part played by humans.\n\nImage copyright Getty Images Image caption A rescue attempt fails to save a beached whale in Cornwall\n\nWhat did they find?\n\nOver seven years, post mortems were carried out on about 1,000 specimens, allowing the cause of death to be determined.\n\nAccidental entanglement in fishing gear accounted for about one in four deaths of common dolphins, and one in 10 for the harbour porpoise.\n\nOther deaths caused directly by humans included 25 animals struck by a ship and a single Cuvier's beaked whale which died in 2015 after swallowing marine litter.\n\nDeaville said more monitoring was needed on a global scale to get a better picture of the threats.\n\nHe told BBC News: \"Ultimately we want to make sure that our children and our children's children can still be out there and see these animals in the wild as we've been lucky to do so when we are alive.\"\n\nMembers of the public can report a stranded marine animal here through the UK Cetacean Strandings Investigation Programme .\n\nFollow Helen on Twitter.", "description": "Diseases, fishing and plastic are some of the causes of whales and dolphins washing up on shores.", "authors": ["Helen", "Bbc News"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/375C/production/_108627141_gettyimages-508527626.jpg", "published_at": "2019-09-06"}