{"pub": "usatoday", "url": "https://usatoday.com/story/sports/ncaaf/2019/10/26/oklahoma-state-upsets-no-23-iowa-state-34-27/40443791", "downloaded_at": "2019-10-27 00:15:17.290424+00:00", "title": "Oklahoma State upsets No. 23 Iowa State 34-27", "language": "en", "text": "CLOSE\n\nAMES, Iowa (AP) — Iowa State surged back into the Top 25 by making big plays on offense and limiting them on defense.\n\nOklahoma State stole the Cyclones' recipe, took care of the ball and escaped Ames with a potential season-changing upset. Freshman Spencer Sanders threw for 249 yards and two TDs, and Oklahoma State beat 23rd-ranked Iowa State 34-27 on Saturday to snap the Cyclones' three-game winning streak.\n\nChuba Hubbard had 116 yards rushing for the Cowboys (5-3, 2-3 Big 12), who used four big plays to snap their own two-game skid. The Pokes also forced three turnovers in the fourth quarter after entering play ranked 123rd nationally in turnover margin.\n\n\"This is a great life lesson for the boys from the standpoint of, just keep playing,\" Oklahoma State coach Mike Gundy said.\n\nMalcolm Rodriguez gave Oklahoma State a 34-27 lead with 6:47 to go on an interception he returned 26 yards for the eventual game-winning touchdown.\n\nIowa State (5-3, 3-2) then stuffed Hubbard on a 4th-and-1 near midfield with just under 3 minutes left. But quarterback Brock Purdy threw another ill-advised pass that was picked off shortly thereafter — then another interception in the final seconds that sealed the Cyclones' fate.\n\nIowa State was also just 5 of 16 on third downs, and Purdy gave it away three times in the fourth after throwing just four interceptions all season entering the day.\n\n\"We really didn't play Iowa State football,\" Iowa State coach Matt Campbell said. \"The big plays obviously, the turnovers, the third downs. I think it's really hard to beat anybody, especially a good team, that way. I put that on us (as coaches).\"\n\nOklahoma State jumped ahead 21-13 at halftime behind a 71-yard catch and run touchdown from Tylan Wallace, a 50-yard touchdown pass from Sanders to Braydon Johnson and a 65-yard scoring run from Hubbard.\n\nIowa State's defense stiffened in the second half, and touchdown runs of 9 and 4 yards by freshman Breece Hall pulled the Cyclones even at 27-all with 9:06 left.\n\nPurdy, whose brilliant play has been a major reason why Iowa State has been so strong since he took over last season, fell to 9-3 against Big 12 opponents. He finished 39 of 62 passing for 382 yards.\n\n\"Interestingly, they beat themselves with a quarterback that's really, really good,\" Gundy said.\n\nTylan Wallace had eight catches for 131 yards for Oklahoma State, which racked up 34 points despite not reaching Iowa State's red zone.\n\nHall had 76 yards on 18 carries after posting back-to-back 100-yard games.\n\nTHE TAKEAWAY\n\nIowa State: The longest play the Cyclones had allowed entering the day was 46 yards, so those breakdowns were very uncharacteristic of one of the Big 12's best defenses. The league remains wide open, especially after Oklahoma and Texas lost, but Iowa State squandered a golden opportunity to move up the standings.\n\nIt's not all on Purdy though, as Iowa State ran the ball just 25 times in 88 plays.\n\n\"It's hard to be the best version of us if we're going to be that unbalanced,\" Campbell said.\n\nOklahoma State: After turning it over eight times in the past two weeks, Sanders took much better care of the ball — though his third-quarter interception set up Hall's first touchdown run, which cut the Pokes' lead to 21-20. Still, Oklahoma State is just one win away from bowl eligibility with at least three winnable games to go. \"If we open up the passing game, we open up the running game. It keeps defenses on their toes,\" Johnson said.\n\nPOLL IMPLICATIONS\n\nThis loss should knock Iowa State out of the Top 25.\n\nHE SAID IT\n\n\"It just comes down to executing,\" Purdy said. \"The fourth quarter came rolling around and we just didn't execute. I didn't play to the best of my ability when it mattered.\"\n\nUP NEXT\n\nIowa State has next week off. The Cyclones play at Oklahoma on Nov. 9.\n\nOklahoma State hosts TCU on Saturday.\n\n___\n\nMore AP college football: https://apnews.com/tag/Collegefootball and https://twitter.com/AP_Top25\n\nCopyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "Sanders throws for 249 yards and two TDs; Oklahoma State upsets 23rd-ranked Iowa State 34-27, snapping Cyclones' 3-game winning streak", "authors": ["Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/a2e4b2bc4cb2abb203e3af0cf80922e8397f73f3/c=0-560-1560-1438/local/-/media/2019/10/26/USATODAY/usatsports/a32004de43f0429f92fca983387233e1.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-26"}