{"pub": "vice", "url": "https://vice.com/en_us/article/9kemv8/horrific-footage-shows-california-police-shooting-a-teen-in-the-back-of-the-head-cops-say-it-was-justified", "downloaded_at": "2019-10-26 06:42:13.637913+00:00", "title": "Horrific Footage Shows California Police Shooting a Teen in the Back of the Head. Cops Say It Was Justified.", "language": "en", "text": "New surveillance camera footage shows the moment Fresno, California, police shot an unarmed teenager in the back of the head as he frantically tried to escape arrest in April 2017.\n\nThe 16-year-old, Isiah Murrietta-Golding, died three days after the footage was recorded. His parents, who are divorced, each filed their own wrongful death lawsuits against Fresno last year, and the gruesome surveillance footage was released to several media outlets by one of their attorneys, Stuart Chandler, on Thursday.\n\nThe attorney also provided police body-camera footage to CNN, in which someone can be heard telling the officer “Good shoot” off-camera.\n\nThe surveillance video, meanwhile, shows the teenager hopping a fence into a small backyard as he’s being chased by officers on April 14, 2017. One cop jumps the fence and runs after him.\n\nREAD: An inmate was repeatedly shocked by a 'stun belt' after a sheriff's deputy dropped the remote in a toilet\n\nThen another officer — later named in court documents as Sgt. Ray Villalvazo — pulls out a service pistol, aims through a gap in the fence, and shoots the teen in the back of the head. The teen then crumples to the ground, and police handcuff his limp body.\n\nAn internal investigation into the shooting found no wrongdoing on Villalvazo’s part, because the officers had said they feared for their lives.\n\nPolice apparently thought the teen was armed because he was trying to hold up his sagging pants as he ran, according to a lawsuit filed by Murrietta-Golding’s father. Police took the teenager grabbing his waistband as a threat, and thought he was reaching for a weapon. But he was unarmed.\n\n\n\n“A picture is worth a thousand words, and this video is worth a million words,” Chandler, the attorney for Murrietta-Golding’s father, told The Washington Post. “It’s clear this shooting was not justified. He was running away, holding up his pants, posing no threat to anybody.”\n\nREAD: A cop pointed a gun at a pregnant woman and her family. It took 5 months to get him fired.\n\nBut police say they were chasing Murrietta-Golding because they wanted to question him over a shooting involving his brother that had occurred the day before, according to CNN.\n\nWhen they pulled over a car in which he was a passenger, the teen allegedly followed police commands for a short while before he fled. Because the teen was being questioned in connection to a homicide — the shooting resulted in a fatal car crash — Fresno police have said such lethal force was justified, according to CNN.\n\nMurrietta-Golding’s brother, who was arrested as a minor and therefore isn’t identifiable, eventually pleaded guilty to killing the 19-year-old who died crashing his car while fleeing his gunshots.\n\nCover: Screen capture from surveillance footage provided by attorney Stuart Chandler.", "description": "The 16-year-old died three days later.", "authors": [], "top_image": "https://video-images.vice.com/articles/5db305da4ee342008dd143b0/lede/1572013531613-Fresno-cops-shoot-teen.png?crop=1xw:0.9926470588235294xh;center,center&resize=1200:*", "published_at": "2019-10-25"}