{"pub": "bbc", "url": "https://bbc.com/news/technology-49973337", "downloaded_at": "2019-10-08 12:09:22.251677+00:00", "title": "Adobe shuts down Photoshop in Venezuela", "language": "en", "text": "Image copyright Getty Images Image caption Adobe is one the first tech firms to act on the sanctions imposed by the US government\n\nAccess to Photoshop and other Adobe software has been cut off in Venezuela as the firm seeks to comply with US sanctions.\n\nPresident Donald Trump banned virtually all trade with the country in August, a move aimed at increasing pressure on President Nicolás Maduro to step down.\n\nUsers have until 28 October to download content, after which accounts will be deactivated, Adobe said.\n\nIt is unclear whether other technology firms will follow suit.\n\nOn a help page, the firm explained: \"The US government issued executive order 13884, the practical effect of which is to prohibit almost all transactions and services between US companies, entities and individuals to Venezuela. To remain compliant with this order, Adobe is deactivating all accounts in Venezuela.\"\n\nIt said it had no idea how long the sanctions would be in effect but added: \"We will continue to monitor developments closely and will make every effort to restore services to Venezuela as soon as it is legally permissible to do so.\"\n\nIt said it \"was unable to issue refunds\" because the sanctions included \"sales, service, support, refunds, credits, etc\".\n\nAdobe has moved to a subscription-only model for the latest versions of its products meaning users will not be able to buy standalone versions.\n\nOne human rights advocate in the region, Geoff Ramsey, tweeted: \"Incredibly counterproductive. Any civil society NGO [non-governmental organisation] or independent media outlet that relies on registered copies of Photoshop, InDesign or Acrobat will be impacted.\"\n\nThe sanctions announced by President Trump freeze all Venezuelan government assets in the US and bar transactions with it. They are similar to sanctions imposed on North Korea, Iran and Cuba.\n\nThe US is one of more than 50 nations that do not recognise Mr Maduro as Venezuela's legitimate president.\n\nBut there has been criticism of the US sanctions.\n\nUN human rights chief Michelle Bachelet, a former president of Chile, said the sanctions were extremely broad and would hit the most vulnerable sections of society.", "description": "Users in the country have until the end of the month to save any work they have in their Adobe accounts.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/0C70/production/_109148130_adobelogo.gif", "published_at": "2019-10-08"}