{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/all-the-ways-you-can-try-and-fix-a-sticky-macbook-keyboard", "downloaded_at": "2019-09-25 04:53:02.067737+00:00", "title": "All The Ways You Can Try And Fix A Sticky MacBook Keyboard", "language": "en", "text": "Get your compressed air ready. (Photo: Gizmodo)\n\nSince Apple introduced its butterfly keyboard design in 2015, the problems with it have been very well documented — and they’re problems that I’ve experienced as well, with a 2018 MacBook Pro (the one with the third revision of butterfly keyboard, if you’re keeping count). If yours is also acting up, here’s what you can do.\n\nYou’ll find a long list of stories on the web, so here’s mine, briefly. A few months after buying the MacBook Pro, certain keys would start repeating themselves — the “o” and the “i” key are particularly susceptible to this, though reading through other online complaints it seems that any key can fall victim to the problem.\n\nNot long after that, the space bar started acting up as well — now I only get what I expect (a space) around three-quarters of the time. For the other 25 per cent of hits a myriad of things happen that shouldn’t. Sometimes it doesn’t register a tap at all, sometimes it registers two taps, and sometimes it goes really crazy and responds with a space, a period, and a space again.\n\nFor someone who writes for a living, this is hardly ideal — getting readable sentences together is difficult enough without having to go back and edit half of them again to remove typos introduced by Apple’s low-profile keyboard design.\n\nYou can probably imagine the frustration of reporting on Apple’s iPhone 11 launch with a temperamental space bar and keyboard—transcribing Tim Cook’s talk of making “products and technologies that are designed in the service of humanity” is a lot more difficult when you have to go back and add spaces and remove superfluous characters. And I wasn’t the only one.\n\nThank you, Unshaky, for blocking 3,454 phantom presses. (Screenshot: Gizmodo)\n\nSo that’s where we’re up to (and where I’m up to). The butterfly keyboard got a fourth revision this May, and we’re all hoping that Apple has finally fixed the problem, four years down the line — it seems as though it’s trying yet another material to keep dust and debris out of its keyboards, though it hasn’t said what that material is, or, Apple being Apple, said very much about the issue at all.\n\nThis sort of tale isn’t new — so if you’re suffering from the same problem, what can you do about it? First of all, I must give a hat tip to 9to5Mac and the incredibly useful (and free) Unshaky app, which tries to identify and block double keypresses in quick succession. If, like me, you’re waiting for the right time to take advantage of the repair program, it might give you a few months of leeway.\n\nUnshaky sits unassumingly in the menu bar going about its business, and you can disable it for certain keys if you’re only having problems with a few of them. The number of accidental (i.e. dodgy keyboard-related) presses it’s managed to block on my MacBook Pro is approaching 3,500, and it’s meant that my laptop has at least been usable while Apple has been deciding how to deal with its keyboard woes.\n\nApple’s own solution to the problem has turned out to be far less effective than Unshaky, at least for me. It suggests blowing some air at the problem, holding up your MacBook at an angle than using a can of compressed air to run down the keyboard from top to bottom and left to right. For best results, keep the can’s straw about half an inch from the keyboard, Apple says.\n\nApple has a guide to how to clean your keyboard. (Image: Apple)\n\nReader, I tried it: It didn’t help. Sentences are still appearing with more Os and Is in them than I need and without enough spaces. It’s possible that my air can technique wasn’t up to par, or the air itself was inferior, but the issue has persisted to this day.\n\nThe good news is that Apple has now decided to replace every keyboard that’s faulty (originally, my third-gen butterfly keyboard model was excluded from the repair program).\n\nThat stretches back to the original 2015 MacBook models and covers everything since, though the program only extends for four years, so you’ll need to act fast if you’ve got one of them (though you may have sorted a fix already anyway).\n\nYou need to head into an Apple Store, or an Apple Authorised Service Provider, to get the keyboard upgraded to the latest fourth-generation model, which we’re assuming isn’t blighted by sticky space bars or repeating letters. Alternatively, you may just get a few of the keys replaced. Check the official support page for full details.\n\nThe deal even covers the 2019 MacBook Air and MacBook Pro models, which doesn’t fill us with a huge amount of confidence that Apple thinks it’s made its keyboards robust enough to handle a bit of typing.\n\nI’m hoping that a professional Apple Store repair is going to be enough to get me a MacBook Pro with a keyboard that works — all I need to do now is clear a couple of days in the diary when I don’t need a laptop.", "description": "Since Apple introduced its butterfly keyboard design in 2015, the problems with it have been very well documented — and they’re problems that I’ve experienced as well, with a 2018 MacBook Pro (the one with the third revision of butterfly keyboard, if you’re keeping count). If yours is also acting up, here’s...", "authors": ["Tegan Jones", "Robb Holland"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/razg830earrfnfehrqog.jpg", "published_at": "2019-09-25"}