{"pub": "foxbusiness", "url": "https://foxbusiness.com/energy/us-flexes-oil-muscle-to-the-world", "downloaded_at": "2019-09-03 23:40:28.843675+00:00", "title": "US flexes oil muscle to the world", "language": "en", "published_at": "2019-08-22", "text": "The U.S. Strategic Petroleum Reserve (SPR) is having a back to school sale ... for oil. They are offering 10 million beautiful barrels of crude to the highest bidder.\n\nContinue Reading Below\n\nThe U.S. Department of Energy is offering the barrels of sour crude from the SPR for delivery between Oct. 1 and Nov. 30, according to a notice on Wednesday. The offer is part of a sale mandated by previous laws to raise funds to modernize the facility.\n\nWhile this might not seem all that exciting, you might want to stop and consider how historic this is and what it represents; America's dominance as an oil powerhouse.\n\nYou see the Strategic Petroleum Reserve was created in the aftermath of the Arab oil embargo. That event made the United States realize just how dependent we had become on foreign oil. Not only was that a threat to our economy but also to our national security. In response, the U.S. mandated the creation of the Strategic Petroleum Reserve as insurance that if the U.S. was cut off from supply, we would have oil in reserve to stop our economy from crashing. President Ford created the SPR with the signing of the Energy Policy and Conservation Act (EPCA) on December 22, 1975 authorizing the creation of a reserve that would store up to one billion barrels of petroleum.\n\nJust over a decade ago during the 2000 decade, there was a call to increase the seized of the reserve as there was a fear that with the rise of China and the world’s dwindling supply of resources, we would need even more oil to protect the U.S. from a potential oil threat. The U.S. bought more supply and the SPR hit its highest inventory level in December 27, 2009 bringing supply up to 726.6 million barrels on fears the world was running out of oil.\n\nAdvertisement\n\nSo when you think about the recently announced sale from the SPR in a world where we are seeing threats to oil tankers getting sized and Iran threating to make the world’s most important shipping lanes unsafe if their exports go the zero, that means we are confident enough to reduce the supply of oil in our oil security piggy bank. That would have been unthinkable just a few years ago.\n\nThe reason of course for that confidence is the fact that the U.S. energy industry, spurred on by free markets and the pursuit of profits, unlocked and unleased oil and gas. The reason why we have less to fear from geopolitical threats is because the U.S. energy industry responded to a threat and found a better way. Instead of oil and gas dependency, the Energy Information Administration declared the U.S. the world's largest producer of natural gas.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nThe Energy Information Administration reported that U.S. petroleum and natural gas production increased by 16 percent and by 12 percent, respectively, in 2018, and these totals combined established a new production record. That dethroned Saudi Arabia that has been cutting production to try to prop up prices. The United States surpassed Russia in 2011 to become the world's largest producer of natural gas. In fact the EIA says that last year’s increase in the United States was one of the largest absolute petroleum and natural gas production increases from a single country in history. So the oil is not needed. And considering the government started buying oil in the 1970’s, they can still sell it today at a good discount to current prices as the average price paid for oil in the SPR is $29.70 per barrel. So if you need a few barrels of oil before school starts, the SPR has it on sale.\n\nPhil Flynn is senior energy analyst at The PRICE Futures Group and a Fox Business Network contributor. He is one of the world's leading market analysts, providing individual investors, professional traders, and institutions with up-to-the-minute investment and risk management insight into global petroleum, gasoline, and energy markets. His precise and timely forecasts have come to be in great demand by industry and media worldwide and his impressive career goes back almost three decades, gaining attention with his market calls and energetic personality as writer of The Energy Report. You can contact Phil by phone at (888) 264-5665 or by email at pflynn@pricegroup.com.", "description": "The U.S. Strategic Petroleum Reserve sale shows just how strong the U.S. energy market is.", "authors": ["Phil Flynn"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/08/0/0/US-Oil-Getty.jpg?ve=1&tl=1"}