{"pub": "yahoo", "url": "https://sports.yahoo.com/nfl-power-rankings-andrew-luckless-colts-still-can-win-afc-south-with-jacoby-brissett-041146699.html", "downloaded_at": "2019-09-24 13:53:04.857696+00:00", "title": "NFL Power Rankings: Andrew Luck-less Colts still can win AFC South with Jacoby Brissett", "language": "en", "text": "The Indianapolis Colts were the favorites to win the AFC South before Andrew Luck retired. Funny enough, they still might be the favorite to win that division.\n\nJacoby Brissett has been pretty good.\n\nHe played very well on Sunday as the Colts won 27-24 against the Atlanta Falcons. Brissett completed his first 16 passes to start the game. He was 21-of-27 for 218 yards, two touchdowns and no interceptions at halftime. He finished with 310 yards.\n\nScroll to continue with content Ad\n\nNobody can completely replace Luck. He was a fantastic player. But Brissett isn’t too bad himself and the Colts have a much better team than they had in 2017, the last time Brissett was forced into the lineup to replace Luck.\n\n[Watch live NFL games on the Yahoo Sports app, here's how]\n\nIt seemed premature when the Colts gave Brissett a two-year, $30 million deal right after Luck’s retirement. Now it looks like it could be a smart investment. Brissett has a 112 passer rating through three games. The Colts seemed to open up the offense against Atlanta and Brissett was up for that challenge. Luck was great but prone to throwing interceptions. Brissett has one INT on 92 attempts this season and his 1.3 interception percentage in his career would be the best in NFL history if he had enough attempts to qualify.\n\nBrissett might not be Luck, but he is better than a lot of people gave him credit for. If he continues to play this well he’ll be in line for a huge payday after the 2020 season, and the Colts might end up winning a division title after all.\n\nStory continues\n\nWho else in the AFC South is all that impressive? Houston is 2-1 but there are still issues on that roster, especially with depth. The Jaguars are 1-2 with rookie quarterback Gardner Minshew starting (though he has looked pretty good at times). The Titans have lost two straight after a season-opening win at the Browns, and they don’t look very good.\n\nThe Colts were pretty much left for dead after Luck’s surprise retirement. Then they battled in their opener, losing an overtime game at the Los Angeles Chargers. They came back in Week 2 and won at the Titans. The Colts look like they’ll battle the Texans for the top spot in that division all season, even with their franchise quarterback in early retirement.\n\nFrank Reich is a very good coach. The Colts have a very good roster from top to bottom. And surprisingly enough, they’re not missing Luck very much through three games.\n\nIndianapolis Colts quarterback Jacoby Brissett has been a nice story since Andrew Luck's retirement. (AP)\n\nHere are the NFL Power Rankings after Week 3 of the season:\n\n32. Miami Dolphins (0-3, Last week: 32)\n\nThe Dolphins have not led once this season. There’s a chance we’re watching the worst team in NFL history (yes, the 1976 Buccaneers, but they had the excuse of being an expansion team).\n\n31. New York Jets (0-3, LW: 29)\n\nIn a strange way, Adam Gase probably is better off with Sam Darnold missing as much time as possible. If Darnold comes back and the Jets still are awful — and this is possible — is there any reason to bring Gase back for Year 2? At least the quarterback health issues would give him an excuse for this year.\n\n30. Washington Redskins (0-3, LW: 31)\n\nHad the Redskins rolled over after that 28-0 start on Monday night, Jay Gruden might not have survived to Week 4. Not that a meaningless second-half rally should determine his job status, but at least it was something. The first half on Monday night was miserable.\n\n29. Cincinnati Bengals (0-3, LW: 27)\n\nCincinnati has lost two very close road games. There have been some positive signs, but it’s still an 0-3 start with rookie head coach Zac Taylor. He has a challenge not letting his team get discouraged.\n\n28. Denver Broncos (0-3, LW: 26)\n\nSome bad turnovers and a bad holding call on a Royce Freeman touchdown turned their game at Green Bay around. The Broncos didn’t play that poorly. But they’re getting no big plays out of the defense, which is shocking for a Vic Fangio defense with Von Miller and Bradley Chubb. They’re the first team to go three games without a sack or turnover since sacks became an official stat in 1982, according to Nicky Jhabvala of The Athletic. That’s hard to believe.\n\n27. Arizona Cardinals (0-2-1, LW: 25)\n\nKyler Murray had only 173 passing yards on 43 attempts. His two interceptions were rough. And the Cardinals’ defense is not very good. This is all still very much a work in progress.\n\n26. Pittsburgh Steelers (0-3, LW: 23)\n\nThe theory was that the Steelers traded a 2020 first-round pick for Minkah Fitzpatrick because they were comfortable with Mason Rudolph. That never made much sense, and makes even less now that Rudolph had 174 yards in his first start, and 76 of those yards came on one big play to JuJu Smith-Schuster. They might regret sending that first-round pick away.\n\n25. Oakland Raiders (1-2, LW: 22)\n\nTight end Darren Waller has been a real find. Grabbing 13 receptions for 134 yards on 14 targets is impressive, no matter if most of it came in garbage time. It’s one of the few positives for the Raiders over the past two weeks.\n\n24. Tampa Bay Buccaneers (1-2, LW: 24)\n\nBruce Arians is a smart coach and willing to take a hit for someone else. So I have to assume that him saying he took a delay of game because a longer field goal would be easier for Matt Gay is not the absolute truth. At least I hope not.\n\n23. New York Giants (1-2, LW: 30)\n\nIt won’t be easy without Saquon Barkley, but they’re suddenly very entertaining with rookie quarterback Daniel Jones. He should have been starting since Day 1. I doubt the Giants will be in playoff contention, but it’s much tougher for them after punting the first two games to protect Eli Manning’s feelings and legacy.\n\n22. Tennessee Titans (1-2, LW: 17)\n\nThat Week 1 win at Cleveland looks like a fluke, or at least more of a reflection of the Browns than the Titans. Marcus Mariota is a shell of what he was his first two seasons. You have to wonder how long Mike Vrabel waits before trying Ryan Tannehill.\n\n21. Jacksonville Jaguars (1-2, LW: 28)\n\nI don’t want to overreact to Gardner Minshew. He’s a fun story and everyone loves him. The Jaguars’ offense also didn’t score a touchdown in the final three quarters last week. In Week 2 they scored one TD, on their 10th drive. He has been better than expected and throws a nice ball, but there’s still work to do.\n\n20. Atlanta Falcons (1-2, LW: 19)\n\nIf Julio Jones didn’t break a long touchdown on fourth down against the Eagles and the Falcons lose that Week 2 game, we might be on Dan Quinn watch right now. The Falcons have too much talent to be this unimpressive. The Falcons better not lose at home to the Titans on Sunday.\n\n19. Carolina Panthers (1-2, LW: 21)\n\nThe attention will go to Kyle Allen, and he certainly is intriguing. Don’t overlook the defense, which limited big plays and had eight sacks. That is what’s going to get the Panthers back to relevancy this season.\n\n18. Cleveland Browns (1-2, LW: 18)\n\nFreddie Kitchens had a great half-season as interim offensive coordinator. It made sense for the Browns to hire him. In retrospect, the hire doesn’t look good. At least at this early point in the season. The Browns’ offense has talent and has been bad. Kitchens’ play-calling has been questionable, and that’s being kind. It’s a big jump from offensive coordinator to head coach (and an even bigger jump when we remember he’d never called plays before midseason last year), and it looks like he has too much on his plate.\n\n17. Los Angeles Chargers (1-2, LW: 8)\n\nKeenan Allen had 13 catches for 183 yards and two touchdowns and the Chargers still lost at home to Houston. The defense got no pass rush against a bad Texans line and couldn’t slow down Deshaun Watson. Maybe the Chargers once again rally from a bad start, but that’s tough to do in the NFL. This has been a rough start to the season.\n\n16. Detroit Lions (2-0-1, LW: 20)\n\nI’m not sure what to make of the Lions. They’ve won two straight three-point games — winning in extremely close games isn’t something that can be counted on — and have been significantly outgained in both games. Detroit isn’t doing anything all that well through three games. But it hasn’t lost yet.\n\n15. Seattle Seahawks (2-1, LW: 10)\n\nThe Seahawks’ 2-0 start doesn’t look so hot anymore. They barely beat the 0-3 Bengals at home and barely beat the 0-3 Steelers with Mason Rudolph playing the second half. Given that, a lopsided home loss to a Saints team without Drew Brees becomes more concerning.\n\n14. Philadelphia Eagles (1-2, LW: 6)\n\nThe Eagles are a tough team to rank. I still like their roster and assume injuries have set them back. The truth remains they’re 1-2, needed a big comeback to beat a bad Washington team at home, lost to a 1-2 Falcons team and then the Lions at home. You either buy the potential or the results. And the results have not been very good.\n\n13. Indianapolis Colts (2-1, LW: 16)\n\nLosing safety Malik Hooker for 4-6 weeks due to a torn meniscus was the downside of Sunday’s win. Hooker has been very good when available, but he hasn’t stayed healthy for a full season yet.\n\n12. Houston Texans (2-1, LW: 15)\n\nCould you have named the Texans’ tight ends before Sunday? They had eight catches for 122 yards and three touchdowns in a win over the Chargers. (The answer is Jordan Akins and Darren Fells ... Deshaun Watson can make anyone better.)\n\n11. Chicago Bears (2-1, LW: 14)\n\nThe Bears took the air out of the ball after going up 28-0, and that made things a little closer than they’d have liked. Chicago’s first half was promising though, especially Mitchell Trubisky going 20-of-23 for 173 yards and three touchdowns before halftime.\n\n10. New Orleans Saints (2-1, LW: 13)\n\nAll things considered, Sunday was probably Alvin Kamara’s finest NFL moment. He had 16 of New Orleans’ 23 rushing attempts for 69 yards and a touchdown. He was targeted on 10 of Teddy Bridgewater’s 27 throws and caught nine for 92 yards and a touchdown. The Saints needed someone to step up big with Drew Brees out, and Kamara answered the call.\n\n9. San Francisco 49ers (3-0, LW: 12)\n\nThe 49ers had five turnovers and still won, which is really hard to do in the NFL. The 49ers won’t want the turnovers to repeat, but it says their win Sunday was a little more dominant than it might have looked by the final score.\n\n8. Baltimore Ravens (2-1, LW: 7)\n\nMark Ingram had 103 yards and three touchdowns in a loss. The Ravens threw it 43 times, mostly because they trailed the Chiefs most of the day, but they need to be wary about getting away from their identity, which is as a run-first team and letting Lamar Jackson’s passing play off of that.\n\n7. Buffalo Bills (3-0, LW: 9)\n\nI’m not sure if you get too hyped up about wins against the Jets, Giants and a tight victory over the Bengals, but 3-0 looks nice. We’ll find out if the Bills are legit this week, with the Patriots coming to town.\n\n6. Minnesota Vikings (2-1, LW: 11)\n\nThe Vikings beat bad teams and don’t beat good teams. That’s the pattern in the Kirk Cousins era. We can’t be sure if the Bears are good or not, but a game at Chicago will test that pattern.\n\n5. Green Bay Packers (3-0, LW: 5)\n\nThe Packers keep winning without Aaron Rodgers doing much. Is he now a second-tier quarterback, or is his slow start the product of a tough schedule of defenses through three weeks? Or is Matt LaFleur’s offense not that good? Green Bay keeps winning but at some point it’ll need more than the 215.7 yards per game it’s getting from Rodgers.\n\n4. Dallas Cowboys (3-0, LW: 4)\n\nThe Cowboys have a chance to be up three games on the Eagles after Week 4. The Eagles play at Green Bay on Thursday night. Dallas faces New Orleans, which isn’t as daunting with Drew Brees out. Unless you’re a big believer in the Daniel Jones-led Giants, a three-game lead over the Eagles would seem comfortable for this early in the season.\n\n3. Los Angeles Rams (3-0, LW: 2)\n\nThe Cowboys almost moved ahead of the Rams in this week’s rankings. Cleveland had its entire starting secondary out on Sunday night and the Rams still looked sluggish on offense. This is a good team and plenty of franchises would take a 3-0 start, but this still doesn’t look like the same team we saw last season. Dallas stays at No. 4 because it still hasn’t played a quality opponent, though that changes in Week 4 when the Cowboys go to New Orleans.\n\n2. Kansas City Chiefs (3-0, LW: 3)\n\nA Jalen Ramsey trade to the Chiefs makes too much sense for Kansas City. The offense is great again and maybe even better than last season, which is insane. The window to win a Super Bowl is wide open but it will still be hard to knock off ...\n\n1. New England Patriots (3-0, LW: 1)\n\nWith 2:03 left in the fourth quarter of the AFC championship game, Damien Williams of the Chiefs scored on a 2-yard touchdown run. It was Jan. 20. That’s the last time the Patriots’ defense allowed a touchdown, and New England has played four games since then.\n\n– – – – – – –\n\nFrank Schwab is a writer for Yahoo Sports. Have a tip? Email him at shutdown.corner@yahoo.com or follow him on Twitter! Follow @YahooSchwab\n\n\n\n", "description": "Andrew Luck retired and the Colts looked like they might be in trouble, but Jacoby Brissett has played well.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/Qcb1fjbpLreHfh1ijvc.PQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/G2RW3qE841vCMliE5goMAg--~B/aD0yODg3O3c9NDMzMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/d8680ba0-de53-11e9-bf63-093a3b66d5d1", "published_at": "2019-09-24"}