{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/3/trent-williams-plans-redskins-return-sooner-rather", "downloaded_at": "2019-09-03 23:42:59.852760+00:00", "title": "Trent Williams plans Redskins return 'sooner rather than later:' report", "language": "en", "published_at": "2019-09-03", "text": "Trent Williams‘ holdout could be coming to an end.\n\nOn “Hail to the Podcast,” a Redskins podcast from The Athletic, former Redskins cornerback DeAngelo Hall says he thinks the seven-time Pro Bowler may return to Washington “sooner rather than later” because he doesn’t want his contract to toll. Williams has until Week 10 to accrue a season.\n\nSome great insight here. From what I hear, “sooner rather than later” could even mean next week. A long nightmare of a summer for the #Redskins and their star LT could be coming to a close. https://t.co/lexjGkr8Ck — Ian Rapoport (@RapSheet) September 3, 2019\n\nHall said there is still “zero chance” Williams reports for Washington’s Week 1 game against the Philadelphia Eagles, but left open the door for a return after that.\n\n“Trent’s very smart,” Hall said. “He understands the business of things. He would not, he would not let a year ago by without getting that season credited it for itself.”\n\nHall said he has talked with both Williams and Bruce Allen throughout this holdout. On the NFL Network, Hall suggested Williams wanted to see changes to the team’s medical staff, but appeared to back away from that claim on the podcast.\n\n“Bruce told me he asked Trent, ‘Tell me who to fire and I’ll fire them,’” Hall said. “Trent’s response? ‘Man, I don’t want to cost anybody their job. I don’t want to put anybody’s livelihood in my hands.’”\n\nWilliams is upset over the handling of a benign tumor on his scalp, which required surgery. Williams has asked for either a trade or a new contract — neither of which the Redskins are willing to do. The 31-year-old has reportedly told friends he vows to never play for Washington again.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Former Redskins cornerback DeAngelo Hall says he thinks the seven-time Pro Bowler may return to Washington \"sooner rather than later.\"", "authors": ["The Washington Times Http", "Matthew Paras"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/07/25/redskins_football_70956_c0-101-2419-1511_s1770x1032.jpg?37c7d74ffb48163fa8d32a5dc0c799f7f22649f7"}