{"pub": "nymag", "url": "https://vulture.com/2019/10/ronan-farrow-book-catch-and-kill-highlights-and-details.html", "downloaded_at": "2019-10-24 14:59:52.326713+00:00", "title": "19 Shocking Details From Ronan Farrow’s New Book Catch and Kill", "language": "en", "text": "Photo: Getty Images\n\nNew Yorker reporter Ronan Farrow’s new book, Catch and Kill, chronicles his investigation into Harvey Weinstein, Matt Lauer, and the plethora of sexual-harassment and assault rumors that surrounded them. It also tracks the extent to which Weinstein wanted this story killed. There are double agents, spies, and one trustworthy anonymous source, making Catch and Kill read like a Hollywood blockbuster. But at the core of the book are the untold stories of women who were pushed to the periphery and the abuses they suffered. Here are some of the biggest, ugliest, and most heinous details from Farrow’s book.\n\nFarrow and Rose McGowan were contacted by Weinstein spies\n\nThroughout the book, Farrow is contacted by a journalist, Seth Freedman, who claimed to be working for The Guardian. In actuality, he is being used by Black Cube, an Israeli private security firm, to gather information for Weinstein. Rose McGowan becomes close friends with a Diana Filip, going so far as to share details of her book and her encounter with Weinstein. Diana Filip was really Stella Penn Pechanac, a Black Cube spy and former aspiring actress. Stella also posed as “Anna,” another Weinstein victim, in order to get close to Farrow.\n\nHarvey Weinstein once wrote a column about … a sexual harasser\n\nBack in college, Harvey Weinstein wrote a column called “Denny the Hustler” about a man who forced women into submission. “Denny the Hustler did not take no for an answer,” the column read, according to the book. “His whole approach was always a psychology of command, or in layman’s terms — ‘Look, baby, I’m probably the best-looking and most exciting person you’ll ever want to meet — and if you refuse to dance with me, I’ll probably crack this bottle of Schmidt’s over your head.’”\n\nThere are harassment claims against other NBC executives\n\nFarrow includes sexual-harassment allegations against several NBC employees, including NBC News chairman Andy Lack, MSNBC president Phil Griffin, and several other unnamed executives. Griffin allegedly took two female employees to a Times Square peep show and left when the performer asked for money.\n\nNBC had a history of pushing back on stories about Hollywood’s dark side\n\nFarrow recalls NBC News president Noah Oppenheim, who wrote the screenplay for Jackie, passing on a story about racial discrimination in Hollywood, among many others. “Look I’m ‘woke’ or whatever, I just don’t think our viewers want to see Will Smith complain about how hard he has it,” Oppenheim reportedly said.\n\nFarrow brought numerous allegations and a recording to NBC\n\nRose McGowan, Ambra Gutierrez, and Emily Nestor were willing to go on the record naming Weinstein as their perpetrator, along with numerous other allegations. Farrow had also secured a recording from Ambra Gutierrez’s police sting. NBC had Dateline producers review Farrow’s work, but the book claims they never listened to the tape. Ultimately, Dateline found the report to be “insufficiently visual.” They also claimed that Emily Nestor was “not ready to be outed,” despite Emily Nestor denying that she said anything like that to the producers. At this point, NBC News executive editor Richard Greenberg told Ronan Farrow and NBC News producer Rich McHugh to “stand down.”\n\nFarrow opens up about his sister Dylan’s decision to go public\n\nMultiple times in the book, Farrow cites calling his sister Dylan Farrow for advice on supporting the women coming forward. He also recalls not being wholly supportive years earlier, when Dylan herself wanted to publicize her claims against their father, Woody Allen. “We spent decades trying to put this thing behind us,” he recalled arguing with her. “I’m just now trying to launch something serious where people focus on the work. And you want to — want to reset the clock completely.”\n\nHillary Clinton and Lena Dunham make cameos\n\nHillary Clinton’s old friend and former special counsel to Bill Clinton, Lanny Davis, played a role in slowing down Farrow’s investigation for Harvey Weinstein. While Farrow was reporting the story, a representative for Clinton told him that she would no longer be available for an interview for his foreign-policy book. Once the New Yorker report came out, she made time. Lena Dunham, who was working with the Clinton campaign in 2016, told Farrow that she warned a Clinton communications staffer against having Harvey Weinstein as an event organizer. “I just want to let you know that Harvey’s a rapist and this is going to come out at some point,” she recalled saying.\n\nNBC shared a memo saying Ronan “never secured documentation.”\n\nAfter the New York Times story on Weinstein broke, Noah Oppenheim and NBC communications vice-president Mark Kornblau shared a memo with another news outlet saying that after two or three months Ronan “never secured any documentation and never persuaded any women to go on camera.” Later, after Farrow’s New Yorker story ran, Oppenheim told NBC News producers, include Rich McHugh, who pushed back, that NBC never had the story that the New Yorker had. In an internal memo obtained by People, NBC News chairman Andy Lack said all claims that NBC tried to cover up the reporting are “fundamentally untrue.”\n\nOne victim recalls finding erectile-dysfunction-medication syringes in Weinstein’s pocket\n\nFor the first year that Ally Canosa worked with Harvey Weinstein, she says she had to fend off countless instances of sexual harassment. In 2010, after Weinstein left a jacket at a meeting, she found “a pack of syringes that Googling revealed were a treatment for erectile dysfunction.” Canosa “reeled at the implications of him arming himself for sex ahead of their meetings.” Later, on August 12, 2010, Weinstein allegedly raped Canosa, beginning a five-year period in which he sexually assaulted and harassed her, according to court documents.\n\nWeinstein considered buying Rolling Stone\n\nWeinstein grew closer with American Media, Inc., CEO David Pecker. Once, he emailed Pecker proposing that they team up to buy Rolling Stone magazine for AMI. Pecker “demurred,” then replied, “I can reduce costs and bring the profits to $10mm …. If you want it you can own 52% for $45mm.”\n\nAn NBC attorney told a Weinstein employee that Farrow was fired before he even left the company\n\nSusan Weiner, an NBC attorney, told one of Lanny Davis’s attorneys working for Weinstein that Ronan Farrow was no longer working for NBC News before contract negotiations had begun. Some time later, Oppenheim told Farrow, “There’s just no room in the budget for you anymore.”\n\nEven Harvey Weinstein outed himself\n\nDuring the fact-checking process at The New Yorker, Harvey Weinstein confused one allegation for another that Ronan Farrow had not included in the story. “He’d mixed up a name we’d given him and a similar sounding one from his own memories,” Farrow wrote.\n\nFormer Enquirer editor Dylan Howard worked closely with Weinstein to cover up stories\n\nHoward allegedly told staff not to report on certain Weinstein stories, bought the rights to stories, then buried them (called a “catch and kill”), and dug up dirt on people like Ashley Judd, Rose McGowan, and Farrow in order to publish negative items about them. They even tailed Farrow’s now-fiancé Jon Lovett, before deciding that he was too boring. Later, federal prosecutors would cut a deal with the Enquirer’s parent company American Media, Inc., after they were caught catching and killing stories to help Donald Trump win the 2016 election.\n\nWeinstein reached out to Woody Allen for advice\n\nWhile his employees searched for dirt on Farrow, Weinstein called Woody Allen to seek advice and ask if he would intervene in Farrow’s reporting. “How did you deal with this?” Weinstein asked. Allen declined to help, saying, “Jeez, I’m so sorry. Good luck.” With no help from Allen, Farrow wrote that Weinstein turned to a book of Woody Allen interviews, written by a fan of his, that discredited Dylan Farrow, a district attorney, and a judge who suggested she was telling the truth about her father.\n\nAnthony Bourdain contacted David Remnick\n\nAfter Farrow spoke to Asia Argento, her partner, chef Anthony Bourdain, reached out to Remnick to show his support. “I am not a religious man,” he wrote. “But I pray you have the strength to run this story.”\n\nAttorney Lisa Bloom double-crossed Farrow\n\nFarrow confides in Bloom about his reporting, since she previously supported Dylan Farrow. In return, Bloom repeatedly reached out, asking how she could help and claiming she had a connection to Weinstein. When Farrow confronts her about telling Weinstein’s people about his reporting, Bloom simply replies, “I am his people.” In October 2017, she quit working with Weinstein.\n\nSeveral claims contradict NBC’s assertion that it did not know about Matt Lauer’s conduct\n\nMultiple victims told Farrow that they signed nondisclosure agreements and received settlements from the company after they complained about sexual harassment and discrimination. This includes Melissa Lonner, who told colleagues, including Ann Curry, that Matt Lauer exposed himself to her. NBC maintains that they had no knowledge of sexual misconduct in their company until Brooke Nevils came forward with rape allegations against Lauer. In May 2018, William Arkin, an investigator looking into NBC, told Farrow that two sources told him that Weinstein knew about Matt Lauer’s history and was “capable of revealing it.” NBC denies that any threat was communicated.\n\nNBC tried to get its Wikipedia wiped\n\nFollowing the Matt Lauer allegations and allegations that NBC was killing stories, it hired a “Wikipedia whitewasher” to erase references to Oppenheim, Weinstein, and Lauer and spin the material “in NBC’s favor.”\n\nAn anonymous source betrayed Black Cube.\n\nWhen fact-checking details with Black Cube, Farrow received two sets of contracts from two separate secure messaging services. One included details about using undercover spies to obtain info for Weinstein. The other did not. It quickly became apparent that someone within the Weinstein operation had anonymously leaked the documents. Their email was Sleeper1973, after a Woody Allen film. “I’m an insider who is fed up with BC’s false and devious ways of obtaining material illegally,” Sleeper wrote. “Moreover, in this case, I truly believe HW is a sex offender and I’m ashamed as a woman for participating.”", "description": "Ronan Farrow’s new book, “Catch and Kill,” details years of reporting and investigation into Harvey Weinstein. Here are some of the breakout moments.", "authors": ["Zoe Haylock"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/22/22-weinstein-farrow.w1200.h630.jpg", "published_at": "2019-10-24"}