{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7596953/Mother-shares-strange-genital-art-design-watch.html", "downloaded_at": "2019-10-28 09:52:23.277971+00:00", "title": "Mother shares strange genital art design watch", "language": "en", "text": "Swiss watch giant Swatch has caused a stir with one of its latest strap designs - after it appears to show male and female genitalia.\n\nA startled shopper took to the online discussion forum Mumsnet to share a link to the new SXY New Gent watch which comes with illustrations of male and female body parts, after her daughter found it while browsing through the brand's website.\n\nTaking to the site, the amused mother explained how her 'fortunately adult' daughter sent her the eyebrow-raising design.\n\nThe new creation costs £97 and is part of a collaboration between Swatch and students form the University of Art and Design in Lausanne, Switzerland\n\nStudents last laugh? Those looking to make a purchase can drag a virtual watch of the section of the design they would like to have printed on their accessory\n\nThe startled mother took to the online discussion forum Mumsnet to share the x-rated design that had been discovered by her daughter\n\nThe new SXY New Gent watch currently on sale on the Swiss watchmaker Swatch's website comes with illustrations of male and female body parts\n\nShe said: 'She was browsing the Swatch watches site and was looking at their pages of art where you can choose a section of a design or old master to have as the design on your watchstrap. Great idea. Not sure about this \"art\" design though. Would you wear it?'\n\nThe one-of-a-kind creation, which costs £97, is part of a collaboration between the watchmaker Swatch and students form the University of Art & Design in Lausanne, Switzerland.\n\nBuyers keen to make the purchase will be able to select which part of the design they would like printed on their watch by dragging a virtual watch over the different male and female body parts online.\n\nThe one-of-a-kind creation comes in five different designs and features both male and female body parts\n\nFollowing the comical post, social media users rushed to the platform to share their opinions on the artwork, which is among five unique designs currently on offer by the Swiss watchmaker.\n\nOne user wrote: 'Who designed this and thought ''great, lovely design these will fly off the shelves''. These will end up in the January sale'.\n\nAnother Mumsnet user added: 'That's the most bizarre thing I've ever seen.'\n\nFollowing the post, social media users rushed to the platform to share their thoughts on the unusual design\n\nWhile another member wrote: 'Not really me, but I think if you like something then wear it.'\n\nHowever, other members revealed that they were struggling to see the intricate genital artwork, with one claiming it simply looked like 'swirls and lines'.\n\nTaking to the social media platform, one wrote: 'What am I missing? Can just see swirls and lines!' while another added: 'I must be getting old as it just looked like a dotty pattern until I looked closer.'\n\nAnother user wrote: 'I though it was Liquorice Allsorts until I zoomed in!'", "description": "A startled British mother revealed how her daughter had found the eyebrow-raising design - which appears to show drawings of genitals - while browsing through the Swiss watchmaker's site.", "authors": ["Bhvishya Patel For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/16/19997894-0-image-a-8_1571672460749.jpg", "published_at": "2019-10-28"}