{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Wellness/kelly-staffords-message-fellow-moms-brain-tumor-time/story?id=66285349", "downloaded_at": "2019-10-15 23:05:32.650095+00:00", "title": "Kelly Stafford's message to fellow moms after brain tumor: 'You need to take some time to make sure you are OK'", "language": "en", "text": "Kelly Stafford, wife of Detroit Lions quarterback Matt Stafford, has a message for moms as she battles back after undergoing a 12-hour surgery in April to remove a brain tumor.\n\nInterested in NFL? Add NFL as an interest to stay up to date on the latest NFL news, video, and analysis from ABC News. Add Interest\n\n\"If there's anything I want people to take away from my story, it's for mothers,\" Stafford, a mom of three young daughters, wrote in a first-person essay for ESPN. \"If you ever feel the slightest bit off, you need to take the time to get it checked out. You don't have to put everything on your back. Sometimes, you need to take some time to make sure you are OK.\"\n\nStafford, 29, describes in her essay how she noticed small things like feeling dizzy after doing a ballet twirl with her daughters, but chalked it up to aging and being busy and didn't seek help.\n\n\"Matthew and I have three girls under the age of 2. I had my hands full,\" she wrote. \"As a mom, you're always on the run. You're chasing after your kids or worrying about your family. You tend to put yourself on the back burner. So I didn't feel the urgency to go to the doctor.\"\n\nStafford said it wasn't until she got dizzy while holding one of her daughters and almost dropped her that she, at the urging of her husband, agreed to go to the emergency room. Doctors there offered to do an MRI but she declined because they were heading on a family vacation.\n\nAbout two weeks later, during that vacation, Stafford underwent an MRI in California. Doctors discovered she had an acoustic neuroma, a type of benign brain tumor that can affect a person's hearing and balance.\n\nIn April, Stafford underwent surgery to remove her brain tumor that turned into a 12-hour ordeal after doctors saw an abnormal vein.\n\nThe surgery was a success -- she did not lose hearing or facial functions -- but Stafford is now sharing new details on her long road to a full recovery, including relearning to walk, battling extreme fatigue and being apart from her daughters.\n\n\"I wasn't able to see my girls for nearly two weeks. The doctors suggested it would be best for them to be out of the house, or wherever I was recovering,\" she wrote. \"Loud noises were hard for me. I couldn't lift my girls at all. They always want to be with me, or crawl on top of me. Learning to walk again was a process and having little ones running at your feet was probably not the best idea.\"\n\n\"When I finally got to see them, we met at a park. I didn't have to worry about them running up and jumping on me, I could just sit there and watch them play,\" she continued. \"Matthew taught the girls how to whisper and tell a secret, so they could be quiet while I was recovering. We also taught them to always say 'I love you'-- no matter what.\"\n\n\"[Matthew] was literally by my side at every step,\" she wrote. \"I had exercises I needed to do -- some of them were seemingly simple, like shaking my head left and right -- and Matthew helped me through all of it. The first month or two, we would try to walk down the street and sit on a bench and do the exercises. When a car passed by, it felt like a whirl.\"\n\n\"Doctors told me the more uncomfortable I can be, the better it will be in the long term because that's when your brain starts learning. I would walk on the sidewalk, then I would try walking through the mall, just to experience all the people going by,\" she continued. \"I couldn't really tell what I was seeing out of the right side. One person would look like four. Even if I tried to look right, it was hard.\"\n\nStafford has shared some details of her brain tumor journey on Instagram and explained she turned to social media because she was \"feeling really vulnerable, and felt like I needed a bunch of people on my team at that point.\"\n\n\"The amount of letters that poured into the facility -- so many prayers, a lot of holy water -- it was remarkable,\" she wrote of the response from fans. \"Matthew joked that our house looked like a bootleg flower shop.\"\n\nStafford noted she has only been to one football game this season -- because the games are loud and exhausting -- and explained that having a brain tumor has changed her outlook on football and life.\n\n\"This football season, in general, feels different for us. We have a different outlook,\" she wrote. \"Matthew is still going out there and doing everything he can for the team, but going through this, you realize that in the end, family is the only thing you have.\"\n\n\"So we're just making sure we have our family and that we're kind to everybody. Those are the things we focus on,\" Stafford wrote.\n\nStafford's recovery will continue for at least the next six months, she said, when she will hit the one-year anniversary of her surgery.\n\n\"I'll probably look into hearing aids for safety reasons soon. I do hope to go to football games again, but I don't want to injure the ear we worked so hard to save,\" she wrote. \"The doctors said it would take about a year for me to feel symptom-free and have the same energy I had before.\"\n\n\"Thursday, Oct. 17, marks six months. I'm really excited to hit that marker.\"", "description": "Stafford, a mom of three, underwent a 12-hour surgery to remove the tumor.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/190423_gma_pilgrim3_0742_hpMain_16x9_992.jpg", "published_at": "2019-10-15"}