{"pub": "bbc", "url": "https://bbc.com/news/business-49651116", "downloaded_at": "2019-09-10 23:38:16.853530+00:00", "title": "PSA boss compares no-deal Brexit to train crash", "language": "en", "text": "Image copyright Getty Images Image caption PSA bosses Carlos Tavares (left) and Michael Lohscheller warned of the effects of a no-deal Brexit\n\nThe head of the car group that owns Vauxhall has compared a no-deal Brexit to a head-on train crash.\n\nPSA chief Carlos Tavares also said if a no-deal Brexit had serious consequences for the car group, there would be an ethical responsibility to protect employees outside the UK.\n\nHe said the firm would take \"necessary decisions\" regarding PSA's UK plants.\n\nPSA also said it had halted investment at its UK factories while the outcome of Brexit remains unclear.\n\nMr Tavares, who was speaking at the Frankfurt motor show on Tuesday, has warned previously that Vauxhall plants at Ellesmere Port and Luton were under threat from Brexit.\n\n'Jobs at stake'\n\nMr Tavares castigated politicians on both sides for failing to find a solution to Brexit. Sending two trains to crash into one another at speed in order to demonstrate their muscles and determination, he said, did not seem to be the best approach.\n\nIn June, PSA Group announced plans to build a new version of the Vauxhall Astra at its Ellesmere Port factory in Cheshire.\n\nHowever, the company made it clear the investment would only take place if a suitable Brexit deal was reached.\n\nImage copyright Reuters Image caption Vauxhall's Ellesmere Port plant employs about 1,100 people\n\nAlso at the Frankfurt show, another PSA executive, the head of the company's Opel and Vauxhall brands, Michael Lohscheller, said Vauxhall could not make investment decisions \"without knowing what will happen\" with Brexit.\n\nMr Lohscheller added: \"Brexit could disrupt supply chains in Europe as well as Britain. There are jobs and investments at stake. Everybody needs to be aware of the responsibility.\"\n\nMeanwhile, the chief financial officer of BMW, Nicolas Peter, said that leaving the EU without a deal could force the company to cut production at its Mini plant in Oxford.\n\nThe German carmaker plans to shut the plant on 31 October and 1 November to guard against potential disruption, but on Tuesday Nicolas Peter said this could stretch to several weeks if necessary.\n\n\"This could have a financial impact on our colleagues working in Oxford,\" Mr Peter said.\n\nMeanwhile, Jaguar Land Rover's chief executive, Ralf Speth, warned that if the supply of parts into the UK was disrupted after Brexit, that could prevent production at its UK factories.\n\nBut he added that he could not comment on the overall effects of no-deal Brexit, because he simply did not have the information he needed.\n\nLast week, UN trade body Unctad warned that a no-deal Brexit would cost UK businesses at least $16bn (£13bn) in lost sales due to the imposition of tariffs on exports.\n\nBy its calculations, UK car exporters would be the hardest hit, losing about $5bn in sales to the EU.\n\nHowever, at the time the UK's Department for International Trade said it had signed continuity agreements with non-EU members, and that exporters would have access to the world's \"fastest growing markets through new free trade agreements\".", "description": "The company that owns Vauxhall says it will halt UK investment while the Brexit outcome remains uncertain.", "authors": ["Theo Leggett", "Business Correspondent", "Bbc News"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/C911/production/_108737415_psabosses.jpg", "published_at": "2019-09-10"}