{"pub": "businessinsider", "url": "https://businessinsider.com/amazon-shipping-costs-soar-over-9-billion-one-day-delivery-2019-10", "downloaded_at": "2019-10-26 00:06:16.588180+00:00", "title": "Amazon CEO Jeff Bezos touts a 'counterintiutive' benefit of faster shipping as costs soar", "language": "en", "text": "Amazon's shipping costs soared 46% in the third quarter to $9.6 billion.\n\nShipping costs are skyrocketing after Amazon said in April that it would speed up its free delivery promise from two days to one day for Prime members.\n\nAmazon said it planned to spend $1.5 billion on one-day shipping in the fourth quarter, up from $800 million in the second quarter.\n\nAmazon CEO Jeff Bezos suggested Thursday that one-day delivery is better for the environment. \"Although it's counterintuitive, the fastest delivery speeds generate the least carbon emissions because these products ship from fulfillment centers very close to the customer — it simply becomes impractical to use air or long ground routes,\" he said.\n\nVisit Business Insider's homepage for more stories.\n\nAmazon's shipping costs are ballooning as it speeds up delivery.\n\nThe company reported Thursday that global shipping costs in the third quarter soared 46% over last year to $9.6 billion. This follows year-over-year cost growth of 36% in the second quarter and 21% in the first quarter.\n\nShipping costs are skyrocketing after Amazon said in April that it would speed up its free-delivery promise from two days to one day for members of its Prime program.\n\nThe company said it planned to spend $1.5 billion on one-day shipping in the fourth quarter, up from $800 million in the second quarter.\n\nIn a statement on Thursday's earnings report, Amazon CEO Jeff Bezos highlighted the company's one-day delivery promise and suggested that speedier delivery is beneficial to the environment.\n\n\"Customers love the transition of Prime from two days to one day — they've already ordered billions of items with free one-day delivery this year,\" Bezos said. \"It's a big investment, and it's the right long-term decision for customers. And although it's counterintuitive, the fastest delivery speeds generate the least carbon emissions because these products ship from fulfillment centers very close to the customer — it simply becomes impractical to use air or long ground routes.\"\n\nThere's another direct benefit to Amazon moving to one-day shipping. It's driving shoppers to spend more.\n\n\"They are buying more often and they are buying more products,\" Amazon CFO Brian Olsavsky said Thursday.\n\nSure enough, Amazon's online store sales increased 22% in the third quarter, which is double the growth rate last year.", "description": "Amazon CEO Jeff Bezos said faster shipping speeds are better for the environment. Amazon plans to spend $1.5 billion on one-day delivery next quarter.", "authors": ["Hayley Peterson"], "top_image": "https://image.businessinsider.com/5d434dc1100a240a2f27dbf4?width=1200&format=jpeg", "published_at": "2019-10-25"}