{"pub": "townhall", "url": "https://townhall.com/tipsheet/juliorosas/2019/10/14/abc-news-uses-2017-kentucky-gun-shoot-for-report-about-turkish-military-bombing-kurd-civilians-n2554680", "downloaded_at": "2019-10-14 23:22:10.616414+00:00", "title": "ABC News Uses 2017 Kentucky Shooting Footage For Report About Turkey Bombing Kurdish Civilians", "language": "en", "text": "ABC News has retracted part of their report on Turkey bombing Kurdish civilians that aired during “World News Tonight\" on Sunday after video shown appears to have been taken in Kentucky in 2017.\n\n“This video, right here, appearing to show Turkey’s military bombing Kurd civilians in a Syrian border town. The Kurds, who fought alongside the U.S. against ISIS, now horrific reports of atrocities committed by Turkish-back fighters on those very allies,\" said anchor Tom Llamas as the video played.\n\nThe video shows hundreds of tracer rounds being fired as explosions are being set off.\n\n\"This video, obtained by ABC News, appears to show the fury of the Turkish attack on the border town of Tal Abyad two nights ago,\" foreign correspondent Ian Panell said as the video was played again.\n\nGizmodo put the video ABC News aired and another video titled, “Knob Creek night shoot 2017,\" side-by-side and they appear to be identical. Knob Creek Gun Range is famous for having large-scale machine gun shoots.\n\nThe 2017 video was taken at the range's biannual event called the “Military Gun Shoot & Military Gun Show.\"\n\nTwitter user Wojciech Pawelczyk, a supporter of President Trump, was among the first to question ABC News's report on Monday.\n\nWow! ABC News is trying to pass gun range videos as combat footage from Syria pic.twitter.com/zfTWtwwSfZ — Wojciech Pawelczyk ???????? (@PolishPatriotTM) October 14, 2019\n\nIn a tweet sent on Monday, \"World News Tonight\" said they have taken down the video and \"ABC News regrets the error.\"", "description": ".10/14/2019 19:18:55PM EST.", "authors": ["Julio Rosas", "Matt Vespa", "Katie Pavlich", "Timothy Meads"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/images/2019/287/8ada822d-f1e2-4983-9cfa-1c957bd6d56a.png", "published_at": "2019-10-14"}