{"pub": "washingtonpost", "title": "Juicy and lively, this $14 Spanish garnacha is brimming with berries", "url": "https://washingtonpost.com/lifestyle/food/juicy-and-lively-this-14-spanish-garnacha-is-brimming-with-berries/2019/08/30/7abdf530-c9b0-11e9-a1fe-ca46e8d573c0_story.html", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 07:05:25.452114+00:00", "text": "Exceptional Excellent Very Good\n\n\n\nFrom left, Arrocal 2017; Alain de la Treille Sauvignon Blanc 2018; Domaine Neferis Selian Carignan 2015; Legado del Moncayo Montaña Vendimia Seleccionada Garnacha 2017; Liquid Geography 2018. (Tom McCorkle/for The Washington Post)\n\nI’ve been on a western Mediterranean kick lately, especially enjoying some great bargains from Spain. This is the second week in a row a Spanish garnacha snags the greatest value of the week designation, another example where this category continues to shine. I was even more enamored of the tempranillo from Arrocal in Spain’s Ribera del Duero region. These would be fun to taste side-by-side with the Domaine Neferis Selian Carignan from Tunisia, while crossing another wine country off your list. All three are bold, juicy reds, ideal to pair with smoky grilled meats. And while the coals are warming up, slake your thirst with a delightful rosé from Spain or a crisp sauvignon blanc from the Loire Valley.\n\nGREAT VALUE\n\nLegado del Moncayo Montaña Vendimia Seleccionada Garnacha 2017\n\nCampo de Borja, Spain, $14\n\nSpain’s old garnacha vines produce some terrific value wines. This one is fun and juicy, with flavors of boysenberry, cherry and mint. Give it some time after pulling the cork, and it will reward your patience. Alcohol by volume: 14.5 percent.\n\nImported by Grapes of Spain, distributed by Elite (Grapes of Spain in Montgomery County): Available in the District at Calvert Woodley, Central Liquors, Modern Liquors. Available in Maryland at Beers & Cheers Too, Downtown Crown Wine and Beer, Finewine.com and On the Vine Craft Beer and Wine in Gaithersburg; Bo Brooks Lighthouse Liquors in Baltimore; the Bottle Shop in Potomac; Dawson’s Market in Rockville; Georgetown Square Wine and Beer in Bethesda; Knowles Station Wine & Co. and Old Town Market in Kensington; Locavino in Silver Spring; Wine Bin in Ellicott City; Wine Cellars of Annapolis. Available in Virginia at Arrowine and Cheese in Arlington, Dominion Wine and Beer in Falls Church, La Tienda in Williamsburg, Libbie Market in Richmond.\n\nGREAT VALUE\n\nArrocal 2017\n\nRibera del Duero, Spain, $19\n\nRibera del Duero produces some terrific red wines from the tempranillo grape. Arrocal is spicy and meaty, with notes of tobacco and blueberry and a satisfying, long finish. ABV: 14 percent.\n\nImported by Grapes of Spain, distributed by Elite (Grapes of Spain in Montgomery County): Available in the District at Cork Wine Bar and Market, Grand Cata, Rodman’s, S&R Liquors, Whole Foods Market in Tenleytown. Available in Maryland at B&B Beer and Wine, Beers and Cheers Too, Downtown Crown Wine and Beer and Finewine.com in Gaithersburg; Balducci’s, Cork 57 Beer and Wine and Georgetown Square Wine and Beer in Bethesda; Knowles Station Wine & Co. in Kensington; Locavino in Silver Spring; Magothy Wine & Spirits in Severna Park; Wine Bin in Ellicott City; Wine Source in Baltimore. Available in Virginia at Arrowine and Cheese in Arlington, Balducci’s (Alexandria, McLean); the Bottle Stop in Occoquan; Foods of All Nations, Market Street Wineshop and Wine Warehouse in Charlottesville; Leesburg Vintner in Leesburg; Locke Store in Millwood; Whole Foods Market in Fair Lakes.\n\nDomaine Neferis Selian Carignan 2015\n\nSidi Salem, Tunisia, $17\n\nTunisia doesn’t readily come to mind when we think of “wine country,” but viticulture there dates back to the time of the Phoenicians, with more recent influence from French colonial rule and Italian investment. Domaine Neferis is one of a handful of family wineries exploring the export market. This carignan is rugged and spicy, featuring brambly flavors of dark berries and wild herbs. Decant this for at least an hour before dinner, then pair it with a hearty roast or stew. There is also a delicious Selian Reserve and a carignan-syrah blend from 2009, showing that these wines can age well. ABV: 14.5 percent.\n\nImported and distributed by Travis Wine Imports: Available in the District at Cork & Fork, MacArthur Beverages and Potomac Wine & Spirits. Available in Virginia at Pentagon City Wine Merchant and Unwined (Alexandria, Belleview).\n\nGREAT VALUE\n\nLiquid Geography 2018\n\nBierzo, Spain, $12\n\nBierzo and the mencía grape are known for producing lively red wines. This tasty rosé is a fitting coda for summer. It’s a private label of the importer, Olé & Obrigado, with profits donated to charities. ABV: 12.5 percent.\n\nImported by Olé & Obrigado, distributed in the District and Maryland by Bacchus, in Virginia by Salveto: Available in the District at Ace Beverage, Modern Liquors, Wardman Wines. Available in Maryland at Eddie’s of Roland Park, North Charles Fine Wine & Spirits, Pinehurst Gourmet Wine Shoppe in Baltimore, Ocean Wine & Spirits in Glen Burnie. Available in Virginia at Balducci’s (Alexandria, McLean, Reston), Crystal City Wine Shop in Arlington, Department of Beer and Wine and Planet Wine & Gourmet in Alexandria, Leesburg Vintner in Leesburg, Unwined (Alexandria, Belleview), Wine Cabinet in Reston, the Wine Outlet (Great Falls, McLean, Vienna).\n\nGREAT VALUE\n\nAlain de la Treille Sauvignon Blanc 2018\n\nTouraine, Loire Valley, France, $13\n\nHere’s a straightforward, good-quality sauvignon blanc with some minerally Loire character. This is excellent on its own or with lighter meals. ABV: 12.5 percent.\n\nImported and distributed by Kysela: Available in the District at Cairo Wine & Liquor, Magruder’s, Rodman’s. Available in Maryland at 5 O’Clock Wines and Spirits in Owings Mills, Bay Ridge Wine & Spirits in Annapolis, the Bottle Shop in Potomac, Downtown Crown Wine and Beer in Gaithersburg, Georgetown Square Wine and Beer in Bethesda, Locavino in Silver Spring, Westside Wine Cellar & Beer in Derwood.\n\nAvailability information is based on distributor records. Wines might not be in stock at every listed store and might be sold at additional stores. Prices are approximate. Check Winesearcher.com to verify availability, or ask a favorite wine store to order through a distributor.", "description": "RECOMMENDED | Plus, a red from Tunisia, red and rosé wines from Spain and a Loire valley sauvignon blanc for end-of-summer sipping.", "authors": ["Dave Mcintyre", "Dave Mcintyre Writes About Wine Weekly. He Also Blogs At"], "top_image": "https://www.washingtonpost.com/resizer/FXJKYJL_VRgoVZSfKKjdCl-aKbk=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FFHOERWJ3QI6TFQVR4NDFFROAQ.jpg"}