{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/brexit-boris-johnson-un-supreme-court-speech-general-assembly-torture-a9119266.html", "downloaded_at": "2019-09-25 06:59:15.930359+00:00", "title": "Boris Johnson delivers bizarre speech to UN warning of 'terrifying limbless chickens' and comparing Brexit to having 'liver pecked out by an eagle'", "language": "en", "text": "Boris Johnson mostly avoided talking about Brexit during his rambling inaugural address to the UN General Assembly on the topic of AI.\n\nSpeaking in a late slot on Tuesday to a sparsely populated hall, Mr Johnson discussed the potential perils of new technological advances while hailing London as having \"the biggest tech [industry] anywhere in Europe\".\n\nThe speech came on a day when the Supreme Court ruled that his decision to prorogue Parliament was unlawful, making the address his last commitment before cutting his trip to New York short and returning early to the UK.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe prime minister littered his speech with jokes about futuristic \"hangover cures\", the threat of \"pink-eyed Terminators\", \"terrifying limbless chickens\" and household devices that \"monitor your nightmares, monitor your fridge\".\n\nBut he did manage to squeeze in one dig at his own country's MPs, accusing them of wanting the Brexit process to go on forever.\n\nHe made the comment during a discussion of the classical myth of Prometheus, a Titan condemned by Zeus to eternal torture.\n\n\"It is a trope as old as literature that any scientific advance is punished by the gods,\" he said. \"When Prometheus brought fire to mankind in a tube of fennel… Zeus punished him by chaining him to a Tartarian crag while his liver was pecked out by an eagle.\n\n\"And this went on forever. A bit like the experience of Brexit in the UK, if some of our Parliamentarians had their way.\"\n\nThe joke, as well as this and other classical references during Mr Johnson's speech, drew a few laughs but largely appeared to fall flat in the nearly deserted hall. The Press Association reported that London's UN ambassador Karen Pierce, at least, laughed along.\n\nOn AI, Mr Johnson said: \"Above all, we need to agree a common set of global principles to shape the norms and standards that will guide the development of emerging technology.\"\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Inside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nHe also extended an invitation to those gathered in the room.\n\n\"So - here's the good news - I invite you next year to a summit in London,\" he said, before praising the city for having \"perhaps half a million people working in tech alone\".\n\nShape Created with Sketch. Supreme Court verdict: Boris Johnson prorogation unlawful Show all 16 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Supreme Court verdict: Boris Johnson prorogation unlawful 1/16 The Supreme Court has ruled against Boris Johnson by declaring his government unlawfully shut down parliament for five weeks EPA 2/16 Lady Hale handed down the historic verdict, hailed by opposition MPs and anti-Brexit campaigners. She said all 11 judges were unanimous in deciding that the case is “justiciable”, so the government loses that part of the argument. “The court is bound to conclude therefore that the decision to advise Her Majesty to prorogue was unlawful because it had the effect of frustrating or preventing the ability of Parliament to carry out its constitutional functions.” EPA/Supreme Court 3/16 Gina Miller and her team react outside the Supreme Court are the verdict. She said: “Today is not a win for any individual or cause. It is a win for Parliamentary sovereignty, the separation of powers and independence of our British courts. Crucially, today’s ruling confirms that we are a nation governed by the rule of law, laws that everyone, even the Prime Minister, are subject to.\" PA 4/16 A person dressed as a caricature of British Prime Minister Boris Johnson in a prison uniform stands outside the Supreme Court AP 5/16 Labour leader Jeremy Corbyn called for Mr Johnson to “consider his position” following the landmark decision, while Lib Dem leader Jo Swinson said he was “not fit to be prime minister” Getty 6/16 Scottish National Party (SNP) Westminster leader Ian Blackford raises his arms as he comes outside. He said: \"This is an absolutely stunning judgement by the Supreme Court today.\" He went on to say, \"we all want to get back to work, and quite frankly, on the back of this, Boris Johnson must resign immediately.\" AFP/Getty 7/16 Crowds outside celebrated the verdict AP 8/16 Delegates at the Labour party conference applaud after hearing the news AFP/Getty 9/16 Speaker John Bercow said MPs must now “convene without delay” and confirmed the Commons would return at 11.30am on Wednesday AFP/Getty 10/16 Gina Miller said: \"“As a result of this judgment, Parliament is open, it was never prorogued. I urge MPs to get back to work immediately.” AP 11/16 MPs Anna Soubry, Liz Saville Roberts and Caroline Lucas, together with SNP leader Ian Blackford, react. Green MP Caroline Lucas has said the Supreme Court’s decision is “just the start” Reuters 12/16 “The UK deserves a Prime Minister and a Government who act with honesty, integrity and in a manner consistent with our constitution, at all times.\" AFP/Getty 13/16 AP 14/16 The SNP’s Joanna Cherry QC says: “Boris Johnson’s position is untenable and he should have the guts to resign.” PA 15/16 EPA 16/16 Tom Tugendhat MP returned to the chamber in the House of Commons within minutes of the Supreme Court ruling PA 1/16 The Supreme Court has ruled against Boris Johnson by declaring his government unlawfully shut down parliament for five weeks EPA 2/16 Lady Hale handed down the historic verdict, hailed by opposition MPs and anti-Brexit campaigners. She said all 11 judges were unanimous in deciding that the case is “justiciable”, so the government loses that part of the argument. “The court is bound to conclude therefore that the decision to advise Her Majesty to prorogue was unlawful because it had the effect of frustrating or preventing the ability of Parliament to carry out its constitutional functions.” EPA/Supreme Court 3/16 Gina Miller and her team react outside the Supreme Court are the verdict. She said: “Today is not a win for any individual or cause. It is a win for Parliamentary sovereignty, the separation of powers and independence of our British courts. Crucially, today’s ruling confirms that we are a nation governed by the rule of law, laws that everyone, even the Prime Minister, are subject to.\" PA 4/16 A person dressed as a caricature of British Prime Minister Boris Johnson in a prison uniform stands outside the Supreme Court AP 5/16 Labour leader Jeremy Corbyn called for Mr Johnson to “consider his position” following the landmark decision, while Lib Dem leader Jo Swinson said he was “not fit to be prime minister” Getty 6/16 Scottish National Party (SNP) Westminster leader Ian Blackford raises his arms as he comes outside. He said: \"This is an absolutely stunning judgement by the Supreme Court today.\" He went on to say, \"we all want to get back to work, and quite frankly, on the back of this, Boris Johnson must resign immediately.\" AFP/Getty 7/16 Crowds outside celebrated the verdict AP 8/16 Delegates at the Labour party conference applaud after hearing the news AFP/Getty 9/16 Speaker John Bercow said MPs must now “convene without delay” and confirmed the Commons would return at 11.30am on Wednesday AFP/Getty 10/16 Gina Miller said: \"“As a result of this judgment, Parliament is open, it was never prorogued. I urge MPs to get back to work immediately.” AP 11/16 MPs Anna Soubry, Liz Saville Roberts and Caroline Lucas, together with SNP leader Ian Blackford, react. Green MP Caroline Lucas has said the Supreme Court’s decision is “just the start” Reuters 12/16 “The UK deserves a Prime Minister and a Government who act with honesty, integrity and in a manner consistent with our constitution, at all times.\" AFP/Getty 13/16 AP 14/16 The SNP’s Joanna Cherry QC says: “Boris Johnson’s position is untenable and he should have the guts to resign.” PA 15/16 EPA 16/16 Tom Tugendhat MP returned to the chamber in the House of Commons within minutes of the Supreme Court ruling PA\n\n\"I hope you will come there, where we will seek to assemble the broadest possible coalition to take forward this vital task.\"\n\nIt was not clear if Mr Johnson was referring to London Tech Week, which began in 2014 and takes place each June, or a new event. Neither Downing Street nor the Department for Digital, Culture, Media & Sport were able to provide clarification.\n\nAdditional reporting by agencies", "description": "Boris Johnson mostly avoided talking about Brexit during his rambling inaugural address to the UN General Assembly on the topic of AI. Speaking in a late slot on Tuesday to a sparsely populated hall, Mr Johnson discussed the potential perils of new technological advances while hailing London as having \"the biggest tech [industry] anywhere in Europe\".", "authors": ["Adam Withnall"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/25/05/boris-johnson-brexit-un.jpg", "published_at": "2019-09-25"}