{"pub": "reuters", "url": "https://in.reuters.com/article/uk-indigo-airbus-exclusive/indias-indigo-places-historic-order-for-300-airbus-planes-idINKBN1X80UH", "downloaded_at": "2019-10-29 15:14:47.288194+00:00", "title": "India's IndiGo places historic order for 300 Airbus planes", "language": "en", "text": "NEW DELHI/PARIS (Reuters) - Indian budget carrier IndiGo has placed an order for 300 Airbus (AIR.PA) A320neo-family jets worth at least $33 billion (£26 billion) at recent catalogue prices, handing the European planemaker what could be its biggest ever order from a single carrier.\n\nFILE PHOTO: Passengers stand at the ticket counter of Indigo Airlines at the airport on the outskirts of Agartala, capital of India's northeastern state of Tripura, October 16, 2014. REUTERS/Jayanta Dey/File Photo\n\nThe mammoth deal includes Airbus’s newest jet, a long-range version of the single-aisle A320neo family called the A321XLR, the country’s biggest airline said in a statement on Tuesday.\n\nThis will take IndiGo’s total A320neo family aircraft ordersto 730 making it the world’s biggest customer for these planes.\n\n“This order is an important milestone, as it reiterates ourmission of strengthening air connectivity in India,” said Ronojoy Dutta, Chief Executive Officer, IndiGo.\n\nThe deal follows a fierce contest between Airbus and Boeing,which is seeking a new endorsement for its competing 737 MAX, grounded following two fatal accidents. Airbus’ A320neo family competes directly with the 737 MAX and the European planemaker has a strong grip on the Indian market.\n\nIndiGo’s announcement came hours after Reuters first exclusively reported the deal.\n\nIt also came days after IndiGo’s biggest quarterly loss,with the company hurt by issues surrounding engines from aformer supplier on A320neo-family jets already in the airline’s fleet.\n\nIn June, IndiGo dropped its original engine supplier, UnitedTechnologies (UTX.N) unit Pratt & Whitney, in favour of French-U.S. engine venture CFM by agreeing a record $20 billion deal for more than 600 engines to power Airbus jets already on order.\n\nCFM is jointly owned by France’s Safran (SAF.PA) and GeneralElectric (GE.N) of the United States.\n\nThe choice of engine manufacturer for this order will bemade at a later date, said Riyaz Peermohamed, IndiGo’s chief aircraft acquisition and financing officer.\n\nA new deal for 300 A320neo-family aircraft would be worth $33 billion at the most recent list prices, published in 2018,but a deal of this scale would come in well below half that after discounts, according to aircraft valuation experts.\n\nAirbus stopped publishing list prices earlier this year. In Paris, shares in Airbus rose as much as 1.4% afterReuters reported the expected order.\n\nRAPID TURNOVER\n\nMany of the latest batch of aircraft are not expected to bedelivered until mid-way through next decade, replacing othersonly just joining the IndiGo fleet.\n\nThe carrier is known for turning over aircraft quickly tokeep its average fleet age low, but such a strategy depends onoverall strong demand in the jet market.\n\nIndiGo was among the first carriers to buy the re-enginedA320neo in early 2011, in what Airbus at the time called arecord single deal involving 180 aircraft. It went on to becomeone of Airbus’s largest customers after a series of orders.\n\nTwo years ago, an unrelated U.S. private equity companycalled Indigo Partners placed a blockbuster order for 430 Airbusjets spread between four airlines.\n\nIn 1997, U.S. Airways placed an order for up to 400 AirbusA320 jets including options, but many were not delivered. IndiGo has expanded rapidly to claim almost half the Indianmarket as rivals such as bankrupt Jet Airways fall by thewayside. Its closest competitor is budget carrier SpiceJet Ltd(SPJT.NS), a Boeing operator.\n\nHowever its two co-founders, Rakesh Gangwal and Rahul Bhatia, have been embroiled in a dispute about corporategovernance of the airline that shows no signs of easing.", "description": "Indian budget carrier IndiGo has placed an order for 300 Airbus A320neo-family jets worth at least $33 billion (£26 billion) at recent catalogue prices, handing the European planemaker what could be its biggest ever order from a single carrier.", "authors": ["Aditi Shah", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191029&t=2&i=1446153705&w=1200&r=LYNXMPEF9S0I8", "published_at": "2019-10-29"}