{"pub": "thehill", "url": "https://thehill.com/blogs/in-the-know/in-the-know/465442-warren-says-shed-welcome-a-dwayne-johnson-presidential-bid-who", "downloaded_at": "2019-10-11 19:58:47.566848+00:00", "title": "Warren says she'd welcome a Dwayne Johnson presidential bid: 'Who doesn't like The Rock?'", "language": "en", "text": "Sen. Elizabeth Warren Elizabeth Ann WarrenDemocratic 2020 hopefuls tout LGBTQ plans at town hall Sanders opens up about heart attack in attempt to assuage health concerns 2020 Presidential Candidates MORE (D-Mass.) says she isn't afraid to take on Dwayne \"The Rock\" Johnson in a White House run, quipping she would \"welcome\" the wrestler-turned-actor into the presidential race.\n\n\"I know he would fight for the principles that he believes in — he’s my kind of guy!\" the 2020 presidential candidate told Entertainment Weekly with a laugh of Johnson, when asked about his frequent flirtations with running for president.\n\nADVERTISEMENT\n\nThe interview focused on one of Warren's favorite shows, HBO's \"Ballers,\" which stars Johnson as an ex-NFL player working as a financial manager for athletes.\n\n“It’s an interesting story that’s different from much of what’s on television,” Warren said, adding: “It tells you something about what it means to live a life dependent on a small set of physical skills.”\n\nJohnson told Vanity Fair last year that he \"seriously considered\" a presidential bid but ultimately opted not to run in 2020.\n\n“It’s a position that requires years of hard work and experience to learn the skills. There’s a lot of ground to cover, and due to my schedule, it’s not possible in 2020,” Johnson told the magazine.\n\nBut Warren, 70, appeared optimistic about the 47-year-old \"Fast and Furious\" star's chances.\n\n\"Who doesn’t like The Rock?\" she said. \"And I have to say, who doesn’t love The Rock’s wardrobe choices, don’t they just knock you out? Those vests and the pink shirts. ... Oh man, it is eye candy.\"", "description": "Sen. Elizabeth Warren (D-Mass.) says she isn't afraid to take on Dwayne \"The Rock\" Johnson in a White House run, quipping she would \"welcome\" the wrestler-turned-actor into the presidential race.", "authors": [], "top_image": "https://thehill.com/sites/default/files/johnsondwayne_10112019getty.jpg", "published_at": "2019-10-11"}