{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/19/faa-chief-meets-boeing-officials-tries-out-max-sim", "downloaded_at": "2019-09-19 23:12:14.800378+00:00", "title": "FAA chief meets Boeing officials, tries out Max simulator", "language": "en", "text": "DALLAS (AP) - The nation’s top aviation regulator tested new flight-control software for the Boeing 737 Max in a simulator on Thursday and gave it a favorable review.\n\nNew Federal Aviation Administration chief Stephen Dickson, who is a pilot, also toured the Max assembly line near Seattle and met with senior Boeing officials.\n\nThe Max has been grounded since March after two crashes killed 346 people. Boeing hopes the FAA will allow it to fly again in the next couple months. But Dickson said his agency has no timetable for reviewing changes that Boeing is making to the plane.\n\nBoeing has not yet submitted its safety analysis of the changes. Dickson said he has seen draft materials that still need more work. He did not provide details.\n\nThe FAA’s reputation was damaged by revelations it didn’t take part in determining the safety of a key flight-control system called MCAS before certifying the Max for flight in 2017. The system was implicated in both crashes, one off the coast of Indonesia last October, the other in Ethiopia in March.\n\nDickson, a former Air Force fighter pilot who flew earlier versions of the 737 during a long career at Delta Air Lines, had a session in a flight simulator to test changes Boeing has made to MCAS - making it less powerful and easier for pilots to control. After practicing simulations of normal flights, he planned to go back in the simulator and test failure situations later Thursday.\n\n“It handles like a 737,” he told The Associated Press. “The airplane handles very well from everything I can tell.”\n\nDickson said he will fly a Max jet - not just a simulator - before the plane is ungrounded.\n\nDickson also toured the Max assembly line in the Seattle suburb of Renton and spent “a couple hours” meeting with top officials of Boeing’s commercial airplanes business. Boeing CEO Dennis Muilenburg was not present, he said.\n\nCritics, including Democrats and some Republicans in Congress, have questioned the FAA’s practice of delegating many inspection and safety tasks to designated employees of aircraft manufacturers.\n\nBackers of delegation say it takes advantage of industry’s expertise. However, at Dickson’s Senate confirmation hearing in May, Sen. Richard Blumenthal, D-Conn., called it “safety on the cheap” and self-policing. Sen. Ted Cruz, R-Texas, said bureaucrats tend to become captives of industries they oversee, and he implored the mild-mannered Dickson, “Be pissed off that 346 people died.”\n\nDickson did not hint at any change in the FAA’s approach to aircraft certification either at that hearing or in a telephone interview.\n\n“The concept of delegation itself is a sound one,” he said Thursday. “It makes the FAA a more effective regulator, and it makes the manufacturer safer because we’re able to share data in real time.”\n\nBut, Dickson said, he will wait to see recommendations from a special Transportation Department committee and others before making any decisions about FAA’s process for certifying new aircraft.\n\nSome of those recommendations will come from international aviation regulators. The FAA gathered officials from dozens of foreign agencies in May in Texas, and it plans to do the same thing next week in Montreal.\n\nThe FAA, once unchallenged as the world’s foremost aviation regulator, now faces the very real - and embarrassing - possibility that other countries won’t immediately go along when it approves the 737 Max for flight.\n\nThe CEO of Ireland’s Ryanair said Thursday he doesn’t expect the plane to be back in service until February or March.\n\nCanaccord Genuity analyst Ken Herbert, just back from a big aviation conference in Europe, said consensus in the industry is that, while the FAA might un-ground the Max before the end of the year, Europe’s regulator is expected to take about three months longer - and could require Chicago-based Boeing to make additional changes to the plane. Regulators in Canada and India have also indicated they could break with the FAA.\n\nAny such phased return of the plane would be a scheduling headache for airlines and carry financial consequences for Boeing. If major countries keep the plane grounded longer, it will delay Boeing’s plans to ramp up production of the Max, which has continued but at a slower pace since April.\n\n___\n\nDavid Koenig can be reached at http://twitter.com/airlinewriter\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The nation's top aviation regulator tested new flight-control software for the Boeing 737 Max in a simulator on Thursday and gave it a favorable review.", "authors": ["The Washington Times Http", "David Koenig"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/19/faa_chief-boeing_plane_31174_c0-176-4200-2624_s1770x1032.jpg?880e31d266fff2efd4d3b484fc20e448a8eb6085", "published_at": "2019-09-19"}