{"pub": "bbc", "url": "https://bbc.com/news/world-middle-east-50059819", "downloaded_at": "2019-10-15 16:21:57.588077+00:00", "title": "Lebanon calls for help as forest fires spread", "language": "en", "text": "Image copyright EPA Image caption Drone footage shows the destruction as fires spread across Lebanon\n\nLebanon has asked for international help battling hundreds of forest fires that broke out on Monday and have spread abroad.\n\nThe blazes - the worst in decades - started in Lebanon's western mountains, amid a heatwave and strong winds.\n\nHeavy smoke was seen over Beirut and the city of Sidon, and one volunteer firefighter reportedly died.\n\nTwo forestry workers have also died in the north-western region of Latakia, according to Syrian state media.\n\nEight more were injured in the flames, Sana news agency said.\n\nLebanon's Interior Minister Raya El Hassan said the government had contacted several countries for help, and tweeted images of a Cypriot plane dropping water.\n\nImage copyright AFP/Getty Image caption Firefighters and the armed forces are tackling the blazes\n\nImage copyright AFP/Getty Image caption Large swathes of land have been affected\n\nRiot police equipped with water cannon were called to the Mount Lebanon region early on Tuesday after fire engines were overwhelmed.\n\nIt is unclear how the fires began. But Prime Minister Saad Hariri is reported to have said that if they were set intentionally, those responsible \"will pay a price\".\n\nThe volunteer firefighter is said to have died in the Chouf region, south-east of Beirut. The area is the site of the Al Shouf Cedar Nature Reserve, which has a large Lebanon cedar forest - the tree on the country's national flag.\n\nLebanon's civil defence authority has tweeted regular updates about the fight against the fires. Army and air force units are helping throughout the country.\n\nYou may also be interested in:", "description": "The worst fires in decades started in the western mountains and have spread into Syria.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/A950/production/_109244334_057315130.jpg", "published_at": "2019-10-15"}