{"pub": "independent", "url": "https://independent.co.uk/news/world/europe/erdogan-syria-turkey-refugees-safe-zone-kurds-trump-europe-borders-a9172311.html", "downloaded_at": "2019-10-27 00:41:52.204343+00:00", "title": "Turkey’s Erdogan threatens to send millions of refugees to Europe unless it backs Syria ‘safe zone’", "language": "en", "text": "Turkey’s president has vowed to send millions of refugees to Europe if countries do not back his proposals for them to be settled in a “safe zone” in Syria.\n\nDoubling down on his recent abrasive rhetoric, Recep Tayyip Erdogan warned he would “open the gates” for asylum seekers if European countries failed to support Ankara’s plans to resettle them in Syria’s northeast.\n\n“If Turkey’s plans for the return [of the refugees] ... is not supported, we will have no choice but to open our borders. We would open the borders, they can go to Europe,” Mr Erdogan said.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nTurkey hosts about 3.6 million Syrians – who fled conflict in their homeland – but wants to resettle up to two million of them back across the border.\n\nEarlier this month Mr Erdogan told European leaders he would “send 3.6 million refugees your way”, in retaliation to stinging international criticism of his country’s military operation in northern Syria.\n\nThe president said yesterday that Turkey would clear Kurdish YPG militia from the region – near its border – if Russia did not fulfil its obligations under a bilateral accord clinched this week.\n\nShape Created with Sketch. Turkey launches offensive into Syria Show all 25 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Turkey launches offensive into Syria 1/25 Turkish soldiers with armored vehicles EPA 2/25 A woman flees with her children during Turkish bombardment on Syria's northeastern town of Ras al-Ain AFP/Getty 3/25 AFP/Getty 4/25 The first group of Turkish infantry prepare to enter Syria on the border Getty 5/25 Civilians flee AFP/Getty 6/25 Smoke billows from targets inside Syria AP 7/25 Turkish armoured vehicles enter Syria in Akcakale Getty 8/25 Civilians leave as smoke rises from Ras al-Ain AFP 9/25 A multi-rocket launcher fires in an unknown location Turkish Defence Ministry via Reuters 10/25 People wave as Turkish soldiers prepare to cross the border Getty 11/25 Girls stand together in Ras al Ain town Reuters 12/25 A woman walks as smoke billows following Turkish bombardment in Syria's northeastern town of Ras al-Ain AFP/Getty 13/25 A Turkish army's tank drives down from a truck towards the border with Syria AFP/Getty 14/25 Turkish jet taxis on tarmac after returning to a military base in southeast Diyarbakir Reuters 15/25 A Turkish armored vehicle drives down a road during a military operation in Kurdish areas of northern Syria EPA 16/25 People sit on belongings at a back of a truck as they flee Ras al Ain town Reuters 17/25 Turkey-backed Syrian opposition fighters enter Tel Abyad AFP/Getty 18/25 Civilians flee AFP/Getty 19/25 People flee Tal Abyad North Press Agency/Reuters TV 20/25 People wave as Turkish soldiers prepare to cross the border into Syria Getty 21/25 Civilians flee with their belongings AFP/Getty 22/25 AFP/Getty 23/25 Turkish President Recep Tayyip Erdogan, right, speaks with Defense Minister Hulusi Akar, left, as they watch the operation by Turkish forces in Kurdish areas EPA 24/25 Smoke rises from the Syrian town of Tal Abyad AFP/Getty 25/25 Turkey-backed members of Syrian National Army prepare for moving to Turkey with heavy armed vehicles EPA 1/25 Turkish soldiers with armored vehicles EPA 2/25 A woman flees with her children during Turkish bombardment on Syria's northeastern town of Ras al-Ain AFP/Getty 3/25 AFP/Getty 4/25 The first group of Turkish infantry prepare to enter Syria on the border Getty 5/25 Civilians flee AFP/Getty 6/25 Smoke billows from targets inside Syria AP 7/25 Turkish armoured vehicles enter Syria in Akcakale Getty 8/25 Civilians leave as smoke rises from Ras al-Ain AFP 9/25 A multi-rocket launcher fires in an unknown location Turkish Defence Ministry via Reuters 10/25 People wave as Turkish soldiers prepare to cross the border Getty 11/25 Girls stand together in Ras al Ain town Reuters 12/25 A woman walks as smoke billows following Turkish bombardment in Syria's northeastern town of Ras al-Ain AFP/Getty 13/25 A Turkish army's tank drives down from a truck towards the border with Syria AFP/Getty 14/25 Turkish jet taxis on tarmac after returning to a military base in southeast Diyarbakir Reuters 15/25 A Turkish armored vehicle drives down a road during a military operation in Kurdish areas of northern Syria EPA 16/25 People sit on belongings at a back of a truck as they flee Ras al Ain town Reuters 17/25 Turkey-backed Syrian opposition fighters enter Tel Abyad AFP/Getty 18/25 Civilians flee AFP/Getty 19/25 People flee Tal Abyad North Press Agency/Reuters TV 20/25 People wave as Turkish soldiers prepare to cross the border into Syria Getty 21/25 Civilians flee with their belongings AFP/Getty 22/25 AFP/Getty 23/25 Turkish President Recep Tayyip Erdogan, right, speaks with Defense Minister Hulusi Akar, left, as they watch the operation by Turkish forces in Kurdish areas EPA 24/25 Smoke rises from the Syrian town of Tal Abyad AFP/Getty 25/25 Turkey-backed members of Syrian National Army prepare for moving to Turkey with heavy armed vehicles EPA\n\nUnder the deal hammered out by Mr Erdogan and Mr Vladimir Putin on Tuesday, Russian military police and Syrian border guards are meant to clear YPG fighters – described as terrorists linked to Kurdish insurgents in southeast Turkey by Ankara – from within 19 miles of the border.\n\n“If this area is not cleared from terrorists at the end of the 150 hours, then we will handle the situation by ourselves and will do all the cleansing work,” Mr Erdogan said, in a speech in Istanbul.\n\nIn a move sure to further infuriate Ankara, former prosecutor and UN investigator Carla Del Ponte said in an interview, published yesterday, that Mr Erdogan should be investigated and indicted for war crimes over the incursion.\n\n“For Erdogan to be able to invade Syrian territory to destroy the Kurds is unbelievable,” said Ms Del Ponte, a former Swiss attorney general who prosecuted war crimes in Rwanda and former Yugoslavia.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\n“An investigation should be opened into him and he should be charged with war crimes,” she told the Swiss newspaper Schweiz am Wochenende in an interview.\n\nTwo human rights groups this week accused Turkey of risking Syrian refugees’ lives by forcibly returning them to a “war zone” in the north of their country.\n\nDozens of Syrians have been “arbitrarily” detained by Turkish authorities and deported across the border to Idlib province, Human Rights Watch and Amnesty International said.\n\nBut yesterday foreign minister Mr Mevlut Cavusoglu disputed the allegations against Turkey, saying it was providing humanitarian aid to civilians there and would not tolerate any human rights violations in areas where its is operating.\n\nSpeaking at a joint press conference with German foreign minister Mr Heiko Maas, Mr Cavusoglu said there was no question of forcibly returning refugees to Syria.\n\nReuters contributed to this report", "description": "Turkey’s president has vowed to send millions of refugees to Europe if countries do not back his proposals for them to be settled in a “safe zone” in Syria. Doubling down on his recent abrasive rhetoric, Recep Tayyip Erdogan warned he would “open the gates” for asylum seekers if European countries failed to support Ankara’s plans to resettle them in Syria’s northeast.", "authors": ["Chris Baynes"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/26/16/erdogan-threatens-to-send-millions-of-refugees-to-europe.jpg", "published_at": "2019-10-26"}