{"pub": "news24", "url": "https://parent24.com/Family/Parenting/this-is-the-painful-truth-in-our-country-one-dads-letter-about-the-lack-of-support-men-get-has-resonated-with-many-fathers-across-sa-20190425", "downloaded_at": "2019-10-14 23:22:30.533643+00:00", "title": "This is the painful truth in our country: One dad's letter about the lack of support men get has resonated with many fathers across SA", "language": "en", "text": "\"This is the painful truth in our country\": One dad's letter about the lack of support men get has resonated with many fathers across SA\n\n“I could write a book on how the system in SA has always screwed the father in the best interest of the mother not the child.” Parents comment on custody battles, the justice system and the lack of support dads seem to get in South Africa.\n\nOne of our readers wrote in to us in the hope of sharing his story and shedding a light on the many struggles of single dads in South Africa. “The story of this single mom is awesome,” he wrote, referring to a previous story of ours, but “there is sometimes a story from a father’s perspective that needs to be understood.”\n\nHe told us about his personal story, and also advocated for all single parents – men specifically.\n\n“I have found so many dads trying to get to their kids, wanting to support the kids, trying to be part of their lives... however the legal system seems to be biased.”\n\nRead his full story here: \"Men in South Africa get no real support\": A dad's story about his life as a single parent, fighting for his kids\n\nWe got so many responses from parents who related to this dad's story. Dads, and moms, wrote in to share their story and thoughts on the lack of support fathers get in South Africa. \"This is the painful truth in our country,\" wrote one, while many highlighted the fact that “the system in SA has always screwed the father in the best interest of the mother, not the child.\"\n\n\n\n\"This is the painful truth in our country\"\n\nOne dad commented:\n\n“This is the painful truth in our country.\n\n“Men are always painted badly to their children, as non-caring or supportive. My older son has recently joined me at home, from his mother's family, while he is attending college here in Jozi. I heard from his aunt, my sister, that he had commented one day that the treatment he is given, by both me and my family, is not what he has been made to believe all his upbringing. So I concur with this guy, men are not supported as much as we wish by our justice system or social services.”\n\nAnother shared his painful truth:\n\n“I have spent close to R500k on access to my daughter. I have three FA reports stating I must have access and four High Court orders.\n\n“The first bias is when the formula, these so-called plans, act as though it’s the first time I am meeting my kid even though I changed her nappies for the first 2 years of her life, I woke her up every morning at 6 and fed her, I fetched her every day from crèche... now I'm a stranger and have to have supervised visitation? Only I don't even get the supervised visitation and haven't for the past 5 years effectively making me a stranger to my daughter.\n\n“Her mother doesn't have to follow any court orders because no one will enforce it. It's not worth the paper it's written on. When I go to the police they say the court must enforce it and when I go to the court they say the police must enforce it. When I shut down the whole police station until someone opens a contempt case for me I get a call from the prosecutor two weeks later saying it's not contempt because the kid had a runny nose.\n\n“Five years later I give up and wait for my kid to come find me.”\n\n“I could write a book on how the system in SA has always screwed the father over in the best interest of the mother but not the child,” commented another.\n\nAlso read: Local dad shares what it's like being denied access to his daughter\n\n“Go to court, they will assist you with a parenting plan suitable for both parties”\n\nLegal experts weighed in too, offering advice.\n\nObservation Bongza, a social worker, said he has done his utmost best to explain the importance of a child having both parents in their life. “Most fathers would come and want my help in the office,” he said. “Because my focus is on the best interests of the child, neither the mother nor the father, many have been helped and are enjoying their lives.”\n\nSk Sekhwela echoed this sentiment, urging parents to continue to seek help.\n\n“I work in the legal fraternity and I see fathers given access to their kids always,” he said. “Go to court, they will assist you with a parenting plan suitable for both parties, unless of course if there are other circumstances that persuade the court not to give access to the other party.”\n\nAlso read: \"I am a 47-year-old divorced mom of two boys and a rescue puppy – this is what a \"normal day\" looks like for me\"\n\n“Parents (both of them) have a responsibility to parent”\n\nMen and women alike gave many reasons as to why the courts would give custody to the mother, or the mother wouldn't allow the father to see their baby.\n\n“The woman is jealous of the new lady in his life”, “he did not pay damages”, “he does not pay maintenance” – these were just a few reasons that many brought up. But one reader commented that ultimately, and despite the issues plaguing South Africa, “parents have a responsibility to parent.”\n\n\"Co-parenting post relationship is a complex issue at the best of times. There is no doubt that our law is great on paper but difficult to enforce.\n\n\"Parents don't have rights, the children have rights, the children have a right to an equal relationship with both parents and a right to be financially supported by both parents, this right is enshrined in our Constitution.\n\n\"Parents have a responsibility to parent; emotionally, physically and financially. We have broken people becoming parents and then expect to be whole parents.\n\n\"We have a historical context, apartheid, migrant labour, unequal rights, culture, patriarchy etc. that has contributed to the current situation. Our progressive law has not been provided the necessary support to ensure that the legislation can be enforced. There should have been programmes or development put in place to change societal norms 25 years ago to encourage responsible parenting to be in line with our legislation.\n\n\"Now our systems are under-resourced and under strain to police and play referee in a broken society.\n\n\"Parents who part ways should be mandated to go to co-parenting classes; should they refuse, their rights should be forfeited until such time as they do.\n\n\"No legal system is going to fix a broken society, only education and a conciliatory approach will.\n\n\"Until then we will continue to battle the exes, the stereotyping and the widening the parenting gender war.\"\n\nChat back:\n\nAre you a single parent? Are you struggling to see your kids? Tell us your story and we may publish it.\n\n\n\nAlso read:", "description": "“I could write a book on how the system in SA has always screwed the father in the best interest of the mother not the child.” Parents comment on custody battles, the justice system and the lack of support dads seem to get in South Africa.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8779/a9987190c44542579accff47654dbe62.jpg", "published_at": "2019-04-25"}