{"pub": "businessinsider", "url": "https://businessinsider.com/california-approves-statewide-rent-control-to-deal-with-housing-crunch-2019-9", "downloaded_at": "2019-09-13 18:35:43.519606+00:00", "title": "California approves statewide rent control to deal with housing crunch", "language": "en", "text": "A \"For Rent\" sign is posted outside a residential home in Carlsbad, California Reuters\n\nLOS ANGELES (Reuters) - California lawmakers on Wednesday passed a statewide cap on annual rent increases for most tenants, the boldest step yet to address an affordable housing crunch that has helped push people into the streets.\n\nThe bill limits annual rent increases to 5% after inflation and takes effect from March of this year. It also imposes restriction on evictions - a significant factor in the state's burgeoning homeless population.\n\nDemocratic Gov. Gavin Newsom, who has put affordable housing at the top of his priorities since taking office in January, brokered the negotiations on the legislation. He said he would sign the bill, one of a batch of laws being passed in the final week of the legislative session.\n\n\"In this year's State of the State address, I asked the Legislature to send me a strong renter protection package,\" Newsom said in a statement after the bill passed. \"Today, they sent me the strongest package in America.\"\n\nThe new eviction protections will help \"provide California with important new tools to combat our state's broader housing and affordability crisis,\" he said.\n\nThe California Business Roundtable said in a statement it supported the legislation because it creates \"a statewide standard that will put more than 95 percent of multifamily units under a consistent and uniform rent standard.\"\n\nThe legislation provides \"certainty to both renters and developers during our ongoing housing crisis,\" California Business Roundtable President Rob Lapsley said in the statement.\n\nCalifornia law had previously contrained the ability of local governments to impose rent controls. It is the first state to impose a statewide cap on rent increases.\n\n(Reporting by Sharon Bernstein; writing by Bill Tarrant; editing by Darren Schuettler)", "description": "LOS ANGELES (Reuters) - California lawmakers on Wednesday passed a statewide cap on annual rent increases for most tenants, the boldest step yet to address an affordable housing crunch that has helped push people into the streets.", "authors": [], "top_image": "https://media.businessinsider.com/public/assets/BI/US/favicons/apple-touch-icon.png", "published_at": "2019-09-11"}