{"pub": "theverge", "url": "https://theverge.com/2019/6/19/18691659/metarama-gaming-music-festival-ninja-marshmello-lineup-announce-pricing", "downloaded_at": "2019-10-05 14:36:16.945262+00:00", "title": "Fortnite superstar Ninja and DJ Marshmello are headlining a gaming and music festival in Las Vegas", "language": "en", "text": "The next big act for Tyler “Ninja” Blevins, the Fortnite star and Twitch streamer, is headlining a music festival. Well, to be clear, it’s both a music and a gaming festival, a unique hybrid experience in Las Vegas dubbed Metarama. The event, which revealed its lineup this morning, is being put together by C3 Presents, the massive and experienced organization behind Chicago’s Lollapalooza and its various international editions, as well as Texas’ Austin City Limits festival. The website describes it as “a first-of-its-kind festival experience where the worlds of gaming, live music, e-sports, comedy, streaming, cosplay, and more collide.”\n\nNinja is the big act on the bill alongside his friend, superstar DJ and electronic music producer Marshmello, an avid gaming fan who’s performed a live concert from inside Epic Games’ Fortnite and even been transformed into a Fortnite skin players could purchase and play as. Ninja and Marshmello were also teammates for Epic’s first ever officially sanctioned Fortnite tournament during last year’s E3, where they won the entire charity event.\n\nMetarama will feature popular ‘Fortnite’ streamers alongside big-name music acts\n\nMarshmello, who still dons his signature helmet and keeps his identity under wraps (although he has been identified as 27-year-old Chris Comstock), is having a big year coming off last year’s hit “Happier.” Following his record-breaking Fortnite appearance and merchandise tie-in, he’s worked on big crossover hits with indie group Chvrches and post-hardcore act A Day To Remember. He’s also now got his own brand of actual marshmallows. Headlining a gaming-music hybrid festival seems like a perfect fit for the artist, especially when paired with Ninja and the crew of Fortnite streamers that have built enormous careers off the game.\n\nOther big music names on the lineup include Logic, Snoop Dogg, Lil Yachty, and Witt Lowry. On the gaming and YouTube side, creator Seán William McLoughlin, aka “Jacksepticeye,” will be in attendance alongside big Fortnite names like Ben “Dr Lupo” Lupo, Imane “Pokimane” Anys, Jack “Courage” Dunlop, Nick “Nickmercs” Kolcheff, and Timothy “Timthetatman” Betar.\n\nAccording to Metarama’s festival page, the streamers will be broadcasting “live from the festival grounds, and attendees will have the opportunity to drop-in to the streamer zone to play alongside them.” There will also be gaming tournaments, live exhibition matches between Overwatch League teams, drone racing, VR experiences, and an on-site arcade. All the while, there will be two main stages for the big music performances.\n\nThe festival is taking place October 19th and 20th at Las Vegas Strip’s Festival Grounds venue. Tickets are on sale now for $150 for the weekend, and at a discounted rate for groups. There are also VIP and other premium packages that offer meet-and-greets with streamers.\n\nThe whole thing sounds like a fascinating experiment in trying to bridge the cultures of gaming and music in the real world, now that it’s clear the fan bases overlap significantly online. Beyond Marshmello, a number of the participating music acts, like Cray and Ducky, are big into gaming and streaming on Twitch. And Lil Yachty is officially signed to e-sports organization Faze Clan. Even Snoop Dogg runs his own e-sports tournament organization appropriately called the Gangsta Gaming League.\n\nLast year, Ninja debuted his own album produced in partnership with electronic music label Astralwerks, giving him a steady stream of songs from popular artists like Tycho and Dillon Francis he can legally play on stream without fear of running afoul of copyright laws. “I’m stoked about this project, first because I truly love the music, but also because I think this is another big step towards bridging the gap between music artists and gamers,” Ninja told EDM.com at the time. “Our worlds keep getting more and more connected, and this feels like the next step — hopefully, this can become the soundtrack to gaming.”\n\nNow, this October, it sounds like C3 is going to try to bring this all together in a massive gathering that will be one part e-sports tournament, one part music festival, and one part streaming and YouTube creator extravaganza.", "description": "The next big act for Tyler \"Ninja\" Blevins, the Fortnite star and Twitch streamer, is headlining a music festival. Well, to be clear, it’s both a music and a gaming festival, a unique hybrid experience dubbed Metarama in Las Vegas. The event, which revealed its lineup this morning, is being put together by C3 Presents, the massive and experienced organization behind Chicago’s Lollapalooza.", "authors": ["Nick Statt", "Jun"], "top_image": "https://cdn.vox-cdn.com/thumbor/whwyXa2GHrJLVbGomZkbH_YzU3w=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/11540765/nstatt_180611_2668_0015.jpg", "published_at": "2019-06-19"}