{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/iranian-women-allowed-watch-national-20549739", "downloaded_at": "2019-10-10 06:17:16.123841+00:00", "title": "Iranian women allowed to watch national side for first time in 40 years", "language": "en", "text": "Get the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nThe Iranian authorities must lift all restrictions on women attending football matches, said Amnesty International ahead of Iran’s World Cup qualifier against Cambodia at Tehran’s Azadi Stadium on Thursday.\n\nThursday’s game marks the first time Iran will allow women into Azadi Stadium since the shocking death of the 'Blue Girl' fan Sahar Khodayari, who set herself on fire last month after being summoned to face charges in connection with her attempt to enter the stadium.\n\nUnder international pressure since Khodayari’s death, the authorities have allowed a quota of tickets to be sold to women for tomorrow’s game, though only four sections - totalling around 3,500 seats - of the 78,000-capacity Azadi Stadium have been allocated to women spectators.\n\nPhilip Luther, Amnesty International’s Middle East and North Africa Director, said: “Iran’s decision to allow a token number of women into the stadium for tomorrow’s football match is a cynical publicity stunt by the authorities intended to whitewash their image following the global outcry over Sahar Khodayari’s tragic death.\n\n“Anything short of a full reversal of the ban on women accessing all football stadiums is an insult to Sahar Khodayari’s memory and an affront to the rights of all the women of Iran who have been courageously campaigning for the ban to be lifted.\n\n(Image: AFP/Getty Images)\n\n“The Iranian authorities should lift all restrictions on women attending football matches, including domestic league games, across the country.\n\n“The international community, including world football’s governing body FIFA, must also ensure that women are permitted to attend all matches freely and without discrimination.\n\n“FIFA has a responsibility to respect human rights throughout its operations, and the power under its statutes to take definitive and urgent action to address a situation which it has allowed to continue for far too long.”\n\n(Image: Alexander Demianchuk/TASS)\n\nAt least 40 women arrested in past two years\n\nFIFA has recently reiterated its position that women in Iran should be permitted to enter football stadiums to watch matches. Despite this and other calls, the Iranian authorities have not lifted all restrictions on women attending football matches.\n\nSince the beginning of 2018, at least 40 women have been arrested and some prosecuted for attempting to enter football stadiums.\n\nAmnesty has called on the Iranian authorities to immediately and unconditionally drop all charges against any woman facing prosecution for attempting to enter a football stadium or protesting against such restrictions.\n\nSince 1981, Iran has banned female spectators from football and other stadiums, Human Rights Watch reports.\n\nThe stadium ban is not written into law or regulation but is ruthlessly enforced by the country’s authorities.\n\nPrior to the Islamic revolution of 1979, women were allowed to attend sporting events.", "description": "But Amnesty International says it's a publicity stunt and calls for all restrictions to be lifted after 'Blue Girl' death", "authors": ["Gareth Bicknell", "Image", "Twitter", "Afp Getty Images", "Alexander Demianchuk Tass"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20549738.ece/ALTERNATES/s1200/0_Iran-football-fan-dies-after-fire-protest.jpg", "published_at": "2019-10-10"}