{"pub": "yahoo", "url": "https://sports.yahoo.com/richard-sherman-annoyed-baker-mayfield-101210768.html", "downloaded_at": "2019-10-08 12:12:02.704781+00:00", "title": "Richard Sherman annoyed at Baker Mayfield’s handshake snub", "language": "en", "text": "Richard Sherman was annoyed with Baker Mayfield before the game even started.\n\nIn fact, it was the Browns quarterback’s refusal to shake hands during the pregame coin toss that had the 49ers corner on edge.\n\n“What’s amazing, and annoying, was him not shaking hands at the beginning,” Sherman told Mike Silver of NFL.com. “That’s some college s—. It’s ridiculous. We’re all trying to get psyched up, but shaking hands with your opponent — that’s NFL etiquette. And when you pull bush league stuff, that’s disrespectful to the game. And believe me, that’s gonna get us fired up.”\n\nScroll to continue with content Ad\n\nApparently it did, as Sherman picked off Mayfield two minutes into the game. Sherman wasn’t the only one to take a shot at Mayfield on a miserable night, as Nick Bosa clowned his college-era flag-waving celebration.\n\nSherman said it was particularly offensive for a young player to not participate in the perfunctory ritual.\n\n“Respect the game,” Sherman said. “You can have rivals, but pay your respect in that moment — especially when you’re young. He hasn’t earned anything in this league. How many games has he won? He’s acting like he was the MVP last year. If [Patrick] Mahomes did that, it would be one thing. But he would never do that, because he has too much respect for the game.\n\n“And when you see a guy who doesn’t? You humble him every chance you get. Because eventually, he will have respect for the league — or he’ll be out of it.”\n\nOf course, Sherman’s never been afraid to play with a bit of edge himself, but Monday night, he was willing to pile on after a miserable night by Mayfield. Sherman mentioned Mayfield’s preseason slight of Giants rookie Daniel Jones in GQ as further evidence.\n\nStory continues\n\n“There’s no reason for him to say and do those things, especially given how little he’s accomplished,” Sherman said. “That’s where he’s gonna have to grow up. He might get there, but he has a long way to go.”\n\nAnd he apparently needs to begin by shaking hands.", "description": "Richard Sherman was annoyed with Baker Mayfield before the game even started. In fact, it was the Browns quarterback's refusal to shake hands during the pregame coin toss that had the 49ers corner on edge. \"What's amazing, and annoying, was him not shaking hands at the beginning,\" Sherman", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/.3qygiUdpWn39.2m9Rfgaw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTExNTg7aD02NTA-/https://s.yimg.com/uu/api/res/1.2/GKjkzTs5AaO7xgk6A4a9aw--~B/aD0zMjU7dz01Nzk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/profootballtalk.nbcsports.com/9729bee81ef1bc795d6fc79e5472d7a2", "published_at": "2019-10-08"}