{"pub": "scmp", "url": "https://scmp.com/news/world/middle-east/article/3032694/european-footballs-governing-body-uefa-will-examine-turkey", "downloaded_at": "2019-10-13 00:16:28.143439+00:00", "title": "European football’s governing body UEFA will ‘examine’ Turkey footballers’ military salute", "language": "en", "text": "A number of countries have condemned Turkey’s offensive, and Finland, Norway and The Netherlands have already announced that they are stopping arms exports to the country.\n\nActivists wave flags and show banners as they protest against the ongoing Turkish military operation in the Syrian border region and the Kurdish territories, in Cologne. Photo: EPA-EFE Share:\n\nA meeting in Luxembourg Monday of the European Union’s foreign affairs committee will decide on a coordinated European approach to the issue, French statement said.\n\nSUBSCRIBE TO SCMP TODAY: INTL EDITION Get updates direct to your inbox SUBMIT By registering, you agree to our T&C and Privacy Policy Thank you for your subscription. other newsletters. You can also view our\n\nIt noted France’s “firm condemnation of the unilateral offensive engaged by Turkey in the northeast of Syria”.\n\nBoth the French and German statements Saturday warned that the offensive could have serious humanitarian consequences.\n\nGermany will not issue any new permits for any military equipment that could be used in Syria by Turkey, Foreign Minister Heiko Maas was quoted as saying in the Sunday edition of Bild newspaper.\n\nResponding to Germany’s announcement, Turkey’s Foreign Minister Mevlut Cavusoglu told Germany’s Deutsche Welle radio that it was “a question of national security, a question of survival”.\n\nAny arms embargo would only strengthen their resolve, he added.\n\n“Even if our allies support the terrorist organisation, even if we are alone, even if an embargo is imposed, whatever they do, our struggle is directed against the terrorist organisation,” he said, referring to the Kurdish Peoples’ Protection Units (YPG).\n\nThe YPG has been the backbone of the Kurdish-led Syrian Democratic Forces who were the main partner on the ground in the US-led campaign against the Islamic State group.\n\nAnkara considers the YPG a “terrorist” offshoot of Kurdish rebels who have been fighting an insurgency against the Turkish state for three decades.\n\nThousands of people marched in several European countries Saturday to protest the Turkish assault and condemn US President Donald Trump for having abandoned the Kurds as a key ally.", "description": "The salute was made after Cenk Tosun’s winning goal for Turkey in the game against Albania in Istanbul on Friday.", "authors": [], "top_image": "https://cdn.i-scmp.com/sites/default/files/styles/og_image_scmp_generic/public/d8/images/methode/2019/10/13/5f2c8ce6-ed41-11e9-9e8e-4022fb9638c4_image_hires_065453.jpg?itok=GsO5Y7rK&v=1570920900", "published_at": "2019-10-12"}