{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7594705/Barclays-17m-DAY-profits-10m-save-Post-Office-paln.html", "downloaded_at": "2019-10-20 23:45:01.162803+00:00", "title": "Barclays made £17m A DAY in profits - £10m more than it will save with Post Office paln", "language": "en", "text": "Barclays raked in almost £17million in profits a day over the summer – £10million more than it expects to save annually from its cash ban at post offices.\n\nFigures this week are expected to show that the bank made £1.5billion in profits from July to September.\n\nBut they come amid the bank’s decision to stop its customers from withdrawing money at post offices from January – a move that is supposed to save Barclays £7million a year.\n\nFigures this week are expected to show that the bank made £1.5billion in profits from July to September\n\nDavid Amess, Conservative MP for Southend West, said: ‘This is appalling.\n\n‘I’ve been banking with Barclays since I could open a bank account and its customer service has become increasingly poor. They only care about their shareholders. Youngsters are much more tolerant of using new technology, like online banking. But we really do have an ageing population and many people struggle to use technology.\n\n‘For Barclays, £7million is peanuts. If they need to make cuts, they should be looking elsewhere.’\n\nThe Mail has highlighted how thousands of Barclays customers face being left without access to cash as part of our Save Our Local Post Offices campaign.\n\nThis newspaper has received scores of emails and letters of protest and 11,000 people have signed an online petition demanding that Barclays performs a U-turn.\n\nAnd Business Secretary Andrea Leadsom waded into the row last week, ordering Barclays to backtrack on its decision.\n\nShe brought up the subject in a meeting about small business finance, while Post Office minister Kelly Tolhurst made a formal call to Barclays’ UK chief executive Matt Hammerstein asking him to reverse the ban.\n\nMiss Tolhurst said: ‘Barclays’ decision is really disappointing.\n\n‘This is something I’ve been raising with all the banks over a period of time. I expect them to support the Post Office and postmasters to deliver a vital service.\n\n‘The secretary of state is as disappointed as I am with the decision. I’m really thankful for the campaign the Daily Mail has run.’\n\nLast week, 124 MPs also accused the bank of abandoning its most vulnerable customers and adding to the ‘cash crisis’.\n\nThis newspaper has received scores of emails and letters of protest and 11,000 people have signed an online petition demanding that Barclays performs a U-turn\n\nThe ban will force customers to use local cashback services, new banking ‘pods’ or a special cheque-cashing service. Last year, Barclays customers made 15million cash withdrawals through the Post Office network and deposited cash five million times.\n\nJohn and Jean Stephens have banked with Barclays for the best part of 60 years and use the post office at their village shop in Llangurig, Mid Wales, to withdraw money. Their nearest Barclays is 20 miles away and three bank branches have closed since they moved to Llangurig 13 years ago.\n\nMr Stephens said: ‘Everybody needs cash around here – to pay the milkman and to buy logs for the fire... Barclays does not seem to care about its customers. It has made this decision without considering us.’\n\nBarclays’ £1.5bn profits for the third quarter of the year are slightly down from the £1.6bn it raked in over the same three months last year, according to analysts.\n\nPart of this fall is due to so-called ‘bad loan’ impairment charges, as more borrowers struggled to pay off their loans.\n\nAnd the profits do not take into account the huge hit Barclays will take from PPI mis-selling claims, which surged in the run-up to the final deadline on August 29.\n\nBarclays has also been criticised by investor Ed Bramson for its humdrum performance.\n\nGary Greenwood, an analyst at investment group Shore Capital, said: ‘For the banking industry, there’s pressure on revenues and Barclays isn’t alone.\n\n‘I’m sure they are looking at a whole range of places to cut costs. No stone will be left unturned.’", "description": "Figures this week are expected to show that the British bank made £1.5billion in profits from July to September.", "authors": ["Lucy White For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/00/19969792-0-image-a-8_1571613578538.jpg", "published_at": "2019-10-20"}