{"pub": "guardian", "url": "https://theguardian.com/artanddesign/2019/oct/08/buy-a-classic-sport-photograph-alex-fergusons-hairdryer-treatment", "downloaded_at": "2019-10-08 15:08:00.003271+00:00", "title": "Buy a classic sport photograph: Alex Ferguson's hairdryer treatment", "language": "en", "text": "What better way to depict Sir Alex Ferguson in a photograph? If there’s one football manager synonymous with ranting on the sidelines at players and officials, it’s the fiery Scotsman. This picture of Fergie was shot during a first division match against Luton in October 1987, less than a year after he joined Manchester United. At that point in time, he had every reason to chastise his players: old, unfit and too keen on booze, many of them were soon shipped out of the club and, over time, replaced with young academy prospects, precipitating the greatest period of domestic dominance in the Premier League era. Ferguson claimed 38 trophies at United – including 13 Premier League titles, five FA Cups and two Champions Leagues. By the time of his retirement in 2013, everyone from David Beckham to Cristiano Ronaldo could attest to the fury of Fergie’s so-called ‘hairdryer treatment’.\n\nPhotograph: Mark Leech/Offside\n\nWords: Jonny Weeks\n\nBuy your exclusive print here\n\nPrice\n\n£55 including delivery\n\nPrints\n\nPhotographs are 30x40cm and presented on museum-grade, fine-art paper stocks, with archival standards guaranteeing quality for 100-plus years. All editions are printed and quality checked by experts at theprintspace, the UK’s leading photo and fine-art print provider.\n\nDelivery\n\nArtworks are dispatched via Royal Mail and delivered within three to five working days. Theprintspace takes great care in packaging your artwork, with a no-quibble satisfaction guarantee should you be unhappy in any way. Global shipping is available.\n\nContact\n\nEmail: guardianprintsales@theprintspace.co.uk", "description": "The fourth of a new Guardian Print Shop series featuring classic sports images from the likes of Gerry Cranham, Mark Leech and Tom Jenkins", "authors": [], "top_image": "https://i.guim.co.uk/img/media/cc75adfe4f5fcc958cddbf5bb7057fbb439be013/0_1290_2930_1757/master/2930.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=02d260ceb430735a3a60cbbfe00b1d61", "published_at": "2019-10-08"}