{"pub": "breitbart", "url": "https://breitbart.com/news/nba-decides-to-remain-silent-for-rest-of-china-trip", "downloaded_at": "2019-10-11 12:37:51.784561+00:00", "title": "NBA decides to remain silent for rest of China trip", "language": "en", "text": "The NBA will complete its trip to China in silence.\n\nSaturday’s game between the Los Angeles Lakers and the Brooklyn Nets to end this year’s NBA China Games series will be played as scheduled in Shenzhen, though there will be no news conferences for players or coaches before or after that contest.\n\nThe NBA came to that conclusion after talking with the teams and the National Basketball Players Association about what would be best for players.\n\n“We have decided not to hold media availability for our teams for the remainder of our trip in China,” the NBA said. “They have been placed into a complicated and unprecedented situation while abroad and we believe it would be unfair to ask them to address these matters in real time.”\n\nOn Thursday, it was the Chinese that stopped NBA Commissioner Adam Silver and the teams from holding news conferences before or after the Lakers-Nets game in Shanghai. That was part of the Chinese response to the rift that started when Houston Rockets general manager Daryl Morey tweeted support for anti-government protesters in Hong Kong and intensified when Silver defended Morey’s right to exercise free speech.\n\nThis time, it was the NBA’s call.\n\nUnder normal circumstances, the Lakers and Nets may have spoken Friday in advance of the game and then coaches and players would be made available to talk both before and after Saturday’s contest. No player or coach from either team has reacted publicly to the fallout surrounding Morey’s tweet, which was deleted quickly though continues to remain a major problem for the league and its relationship with the world’s most populous country.\n\nThe Rockets were asked repeatedly about the situation during their two-game trip to Japan earlier this week for games with the reigning NBA champion Toronto Raptors. A Rockets media relations official stopped Houston guards James Harden and Russell Westbrook from answering a question from a CNN reporter Thursday about whether they would continue to speak out about political and societal matters. That prompted an apology from the NBA, who said that decision “was inconsistent with how the NBA conducts media events.”\n\nIn Tokyo, Rockets coach Mike D’Antoni said questions about the China-NBA rift are thorny to answer.\n\n“You can’t answer questions like that because you’re wrong no matter what,” D’Antoni said. “I’m here to speak basketball, talk basketball. … Hey, I coach basketball. I’m not a diplomat.”\n\nSilver spoke earlier this week and said the league would continue protecting freedom of expression for its players and employees. Morey’s tweet was criticized by Nets chairman Joe Tsai, who is in China for this week’s games and is a co-founder of Chinese e-commerce giant Alibaba.\n\n“I don’t think it’s inconsistent to both be apologetic that that was the outcome of that speech but at the same time support Daryl’s right to his freedom of expression and Joe Tsai’s right to respond,” Silver said.\n\n___\n\nMore AP NBA: https://apnews.com/NBA and https://twitter.com/AP_Sports", "description": "The NBA will complete its trip to China in silence. Saturday's game between the Los Angeles Lakers and the Brooklyn Nets to end this year's NBA China", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/11/df9b7d_week-was-in-asia-photo-gallery-39724-in-oct-2019-photo-worker-takes-billboard-640x335.jpg", "published_at": "2019-10-11"}