{"pub": "npr", "url": "https://npr.org/2019/10/09/768720084/thousands-of-women-will-at-last-be-allowed-to-attend-a-soccer-match-in-iran", "downloaded_at": "2019-10-10 00:04:04.949430+00:00", "title": "Thousands Of Women Will At Last Be Allowed To Attend A Soccer Match In Iran", "language": "en", "text": "Thousands Of Women Will At Last Be Allowed To Attend A Soccer Match In Iran\n\nEnlarge this image toggle caption Atta Kenare/AFP via Getty Images Atta Kenare/AFP via Getty Images\n\nFor some 40 years, women have been largely banned from attending soccer matches at Iran's stadiums. But under pressure from FIFA, soccer's governing body, Iranian authorities are allowing a few thousand women to watch a game Thursday at Tehran's Azadi Stadium – in a section separate from men.\n\nWomen were permitted to buy about 3,500 tickets to watch a World Cup qualifier between the men's teams of Iran and Cambodia.\n\nThe change comes after an Iranian woman set herself on fire and died last month, as she faced charges arising from her trying to enter the stadium to watch a match. The woman, 29-year-old soccer fan Sahar Khodayari, had dressed up as a man to try to get into the game. When security guards discerned that she was a woman, she was expelled and charged with \"appearing in public without a hijab.\"\n\nThe ban has been in place since 1979's Islamic revolution, with only small groups of women allowed to attend a handful of matches in recent years.\n\nIranian sports journalist Raha Purbakhsh is among those who got a ticket to Thursday's match. She told news service AFP that she last stepped into Azadi stadium about 25 years ago with her father.\n\n\"I still can't believe it's happening because after all these years watching every match on TV, I'm going to be able to experience everything in person,\" she said. \"I'll be able to feel the stands, and closely watch the game itself.\"\n\nBut some say it's not enough. Amnesty International criticized Iran's authorities for allotting so few tickets to women in a stadium that can seat 78,000. It's not clear how many tickets have been made available to men.\n\n\"Iran's decision to allow a token number of women into the stadium for tomorrow's football match is a cynical publicity stunt by the authorities intended to whitewash their image following the global outcry over Sahar Khodayari's tragic death,\" Philip Luther, Amnesty's Middle East and North Africa Research and Advocacy Director, said in a statement.\n\n\"Instead of taking half-hearted steps to address their discriminatory treatment of women who want to watch football, the Iranian authorities should lift all restrictions on women attending football matches, including domestic league games, across the country,\" he said. \"The international community, including world football's governing body, FIFA, must also ensure that woman are permitted to attend all matches.\"\n\nFIFA statutes prohibit discrimination on the basis of gender. The governing body says the arrangement for Thursday's match is a pragmatic solution as it works toward lasting change in Iran.\n\n\"It's not just about one match,\" FIFA's head of social responsibility and education Joyce Cook told the BBC. \"We're not going to turn our eyes away from this. We're totally focused on making sure women can attend this match on 10 October and working just as pragmatically to ensure women also can attend local matches in league football - but it's about what follows as well. FIFA has a very firm stand - fans are equally entitled to attend matches.\"\n\nIranian Vice President for Parliamentary Affairs Hossein-Ali Amiri said last month that some of the country's stadiums were being prepared for the entry of women, by adding separate gates and seating.\n\nThe group Open Stadiums has long campaigned for women's right to watch games in Iran's arenas. The organization's leader, who goes by the pseudonym Sara, told Reuters that many of the women who bought tickets to Thursday's match aren't actually soccer fans.\n\n\"[T]hey just want to break this discrimination,\" she said. \"For years [equal stadium access] has been a demand from the women's rights movement in Iran and as a part of exclusion from the public spaces. It's not just about football.\"\n\n\"People are doing this just to show that if you give capacity to us, we will use it.\"", "description": "\"After all these years watching every match on TV, I'm going to be able to experience everything in person,\" said Raha Purbakhsh, one of 3,500 women who bought tickets to Thursday's game.", "authors": ["Laurel Wamsley"], "top_image": "https://media.npr.org/assets/img/2019/10/09/gettyimages-1174663564_wide-68b456c04cb29c95a097877b7fed99ab63e5dc57.jpg?s=1400", "published_at": "2019-10-09"}