{"pub": "reuters", "url": "https://reuters.com/article/us-un-assembly-trump-china/trumps-china-trade-rhetoric-turns-harsh-at-u-n-says-wont-take-bad-deal-idUSKBN1W91ZC", "downloaded_at": "2019-09-25 04:44:14.832660+00:00", "title": "Trump's China trade rhetoric turns harsh at U.N., says won't take 'bad deal'", "language": "en", "text": "UNITED NATIONS (Reuters) - U.S. President Donald Trump delivered a stinging rebuke to China’s trade practices on Tuesday at the United Nations General Assembly, saying he would not accept a “bad deal” in U.S.-China trade negotiations.\n\nFour days after deputy U.S. and Chinese negotiators held inconclusive talks in Washington, Trump’s remarks were anything but conciliatory and emphasized the need to correct structural economic abuses at the heart of the countries’ nearly 15-month trade war.\n\nHe said Beijing had failed to keep promises it made when China joined the World Trade Organization in 2001 and was engaging in predatory practices that had cost millions of jobs in the United States and other countries.\n\n“Not only has China declined to adopt promised reforms, it has embraced an economic model dependent on massive market barriers, heavy state subsidies, currency manipulation, product dumping, forced technology transfers and the theft of intellectual property and also trade secrets on a grand scale,” Trump said.\n\n“As far as America is concerned, those days are over.”\n\nAlthough Trump held out hope that the United States and China could still reach a trade deal, he made clear he wanted a deal that would rebalance the relationship between the two economic superpowers.\n\n“The American people are absolutely committed to restoring balance in our relationship with China. Hopefully, we can reach an agreement that will be beneficial for both countries,” Trump said. “As I have made very clear, I will not accept a bad deal.”\n\nTrump also recently said he was not interested in a “partial deal” to ease tensions with China, saying that he would hold out for a “complete deal.”\n\nHARSH RHETORIC, STOCK FALL\n\nU.S. stocks gave up modest gains and fell into negative territory after Trump’s U.N. address, which some investors said marked a reversal of the more constructive tone that had surrounded the negotiations last week. [.N]\n\n“Trump’s comments to the U.N. were very antagonistic toward China. In the last couple of weeks there’s been optimism trade would go in a positive direction,” said Chris Zaccarelli, chief investment officer at Independent Advisor Alliance, an investment advisory group based in Charlotte, North Carolina.\n\n“It was the tone and the fact he listed out in great detail all the gripes the U.S. has with China,” Zaccarelli said. “All that trade optimism that’s been building has been sucked out of the air and replaced with pessimism.”\n\nTrump’s speech highlighted the plight of U.S. memory chip maker Micron Technology (MU.O), which has become a symbol of U.S. assertions that China fails to protect American intellectual property and steals it or forces the transfer of it. Two years ago Micron accused a Chinese state firm of stealing its chip designs.\n\n“Soon, the Chinese company obtains patents for nearly an identical product, and Micron was banned from selling its own goods in China,” Trump said, “But we are seeking justice.”\n\nHe added that the United States lost 60,000 factories and 4.2 million manufacturing jobs since China joined the World Trade Organization.\n\n“The rhetoric around China and President Trump’s speech was as harsh as we have heard,” said Art Hogan, chief market strategist at brokerage National Securities Corp in New York.\n\nChina’s top official at the U.N. General Assembly, Foreign Minister Wang Yi, sat silently during Trump’s remarks, showing no reaction on camera.\n\nWang is due to speak on U.S.-China relations on Tuesday evening at a business event in New York.\n\nCHINA SOY PURCHASES\n\nThe tone of Trump’s speech also was at odds with some recent steps by China to meet his request for purchases of more American farm products. On Monday, Chinese importers bought about 10 shiploads of U.S. soybeans - about 600,000 tonnes.\n\nChina’s customs commission will exclude certain amounts of U.S. soybeans, pork and other products from its retaliatory tariffs, the official Xinhua news agency said on Tuesday.\n\nThe purchases were made following last week’s trade talks, which both the U.S. and Chinese sides characterized as “productive.” People familiar with the trade talks said no new Chinese proposals were presented, and the countries agreed to continue minister-level talks in early October.\n\nIn his U.N. speech, Trump also drew a link between resolving the U.S.-China trade dispute and Beijing’s treatment of Hong Kong. Washington was “carefully monitoring the situation in Hong Kong,” he said.”The world fully expects that the Chinese government will honor its binding treaty made with the British and registered with the United Nations, in which China commits to protect Hong Kong’s freedom, legal system and democratic ways of life,” Trump said. Hong Kong was a British colony until 1997.\n\n“How China chooses to handle the situation will say a great deal about its role in the world in the future. We are all counting on President Xi as a great leader,” Trump added.\n\nU.S. President Donald Trump addresses the 74th session of the United Nations General Assembly at U.N. headquarters in New York City, New York, U.S., September 24, 2019. REUTERS/Carlo Allegri\n\nTrump also touched on trade with Japan in his speech, saying that he and Japanese Prime Minister Shinzo Abe on Wednesday would “continue our progress in finalizing a terrific new trade deal.”\n\nIt remains unclear whether the two countries will sign the deal at their bilateral meeting or whether Japanese requests for assurances that Trump won’t hit them with autos tariffs will delay the final agreement.\n\n(This story corrects typographical error in headline to make it “Trump’s China ...” instead of “Trumps’ China ...”)", "description": "U.S. President Donald Trump delivered a stinging rebuke to China's trade practices on Tuesday at the United Nations General Assembly, saying he would not accept a \"bad deal\" in U.S.-China trade negotiations.", "authors": ["Jeff Mason", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20190924&t=2&i=1433381588&w=1200&r=LYNXMPEF8N1C2", "published_at": "2019-09-24"}