{"pub": "guardian", "url": "https://theguardian.com/world/2019/sep/22/protesters-and-police-clash-in-egypt-for-second-day-running", "downloaded_at": "2019-09-22 05:13:04.907134+00:00", "title": "Protesters and police clash in Egypt for second day running", "language": "en", "text": "Teargas and live rounds fired at demonstrators in Suez after crowds call for the removal of president Abdel Fattah al-Sisi\n\nProtesters and police clash in Egypt for second day running\n\nEgyptian security forces have clashed with hundreds of anti-government protesters in the port city of Suez in a second day of demonstrations against the Sisi regime, firing tear gas and live rounds.\n\nA heavy security presence was also maintained in Cairo’s Tahrir Square on Saturday, the epicentre of Egypt’s 2011 revolution, after protests in several cities on Friday called for the removal of general-turned-president Abdel Fattah al-Sisi.\n\nUN postpones anti-torture conference in Cairo after backlash Read more\n\nSuch demonstrations are rare after Egypt effectively banned protests under a law passed following the 2013 military ouster of the late Islamist president, Mohamed Morsi.\n\nBut discontent over rising prices has been swelling in Egypt, where Sisi’s government has imposed strict austerity measures since 2016 as part of a $12bn loan package from the International Monetary Fund.\n\nNearly one in three Egyptians live below the poverty line, on less than $1.40 a day, according to official figures released in July.\n\nAmr Khalifa (@Cairo67Unedited) Wow. Chants in #Suez tonight are \" there is but one God and #Sisi is the enemy of God \"#السويس_أم_الثورة #ميدان_التحرير_الان pic.twitter.com/hypO6yqWDX\n\nOn Saturday protesters headed into the centre of Suez for the second night in a row, where they were met by security forces barricading the streets and armoured vehicles.\n\n“There were about 200 or so people. They (security forces) fired tear gas, rubber and live bullets and there were injuries,” a man who took part in the demonstration but declined to be named told AFP.\n\nAnother resident, who also preferred to remain anonymous, said the tear gas was so thick it had reached her apartment block a few kilometres away from the turbulent downtown area.\n\nHassan Hassan (@hxhassan) A demonstration in #Suez against El-Sisi. pic.twitter.com/uUy7TBLZGc\n\n“My nose started burning up. The smell was seeping through the balcony. I also saw some youth run and hide in our street”, the woman said.\n\nOn late Friday, hundreds of Egyptians poured through the streets of Cairo, chanting slogans including “Leave, Sisi!” and demanding the “fall of the regime”.\n\nAt least 74 people were arrested after clashes between the crowds and police in the capital, a security source told AFP.\n\nThe protests came after Mohamed Aly, an exiled businessman and opponent of Sisi posted calls online for demonstrations.\n\nHe upped the pressure on Saturday in an expletive-filled video, imploring Egyptians to join a “million-man march” next Friday and to fill all “major squares” of the country.\n\n“This is a people’s revolution... We have to link up together as one... and organise going down to the major squares,” he said in a Facebook appeal to his followers.\n\nThe construction contractor has been posting videos online since early September, accusing Sisi and the military of rampant corruption.\n\nThe president denied the allegations last week, saying he was “honest and faithful” to his people and the military.\n\nBut on Friday demonstrators took to the streets in Cairo after a highly charged football match between local powerhouses Al Ahly and Zamalek.\n\n“I think it’s safe to say that the events of the past few weeks, including the development last night, pose the most serious legitimacy crisis facing Sisi,” Nael Shama, a Cairo-based political analyst, told AFP.\n\n“No one shouted bread, freedom, social justice like in 2011, they escalated straight to ‘Leave’ from the first minute,” Shama noted.\n\nOn social media thousands shared footage of Friday’s demonstrations, which sprang up in several cities, including sizeable crowds blocking traffic in Alexandria, Al-Mahalla, Damietta, Mansoura and Suez.\n\n“This is the first time people take to the streets in many years but I am not sure it will be the last,” Shama added.\n\nUnder Sisi’s rule, authorities have launched a broad crackdown on dissidents, jailing thousands of Islamists as well as secular activists and popular bloggers.\n\nThe government’s foreign media accreditation body released a statement late Saturday cautioning international journalists that their reporting of events “should not be exaggerated”, without explicitly mentioning the protests.", "description": "Teargas and live rounds fired at demonstrators in Suez after crowds call for the removal of president Abdel Fattah al-Sisi", "authors": ["Agence France-Presse"], "top_image": "https://i.guim.co.uk/img/media/7a9097a2f7e62133c33ba48a29e3c8d6ae76ff67/0_13_2368_1421/master/2368.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=0176beb96324ecb51c0a63373574777e", "published_at": "2019-09-22"}