{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/13/no-18-michigan-state-set-for-rematch-with-arizona-", "downloaded_at": "2019-09-13 07:15:41.989286+00:00", "title": "No. 18 Michigan State set for rematch with Arizona State", "language": "en", "text": "This was the moment early last season when Michigan State’s offense hit its first major snag.\n\nFaced with a tricky nonconference test on the road, the Spartans wasted opportunities throughout the game and eventually lost to Arizona State on a last-second field goal.\n\n“It don’t sit with me right,” wide receiver Weston Bridges said.\n\nMichigan State lost that game 16-13, and that proved to be a sign of things to come. The Spartans sputtered to a 7-6 season and were held under 20 points in each of their losses. This year there are signs of improvement, but No. 18 Michigan State will be put to the test Saturday at Spartan Stadium in a rematch with Arizona State.\n\n“We’ve got a confidence level,” Spartans coach Mark Dantonio said. “I think that we’ve been a confident football team, especially on the defensive side of the ball. You know, went a little bit back and forth, obviously had a lot of injuries last year, but big step this past week.”\n\nAfter an underwhelming opener against Tulsa, Michigan State (2-0) broke out offensively last weekend in a 51-17 win over Western Michigan. By contrast, Arizona State (2-0) struggled to put away Sacramento State in a 19-7 victory.\n\nThe Spartans are favored by about two touchdowns this weekend.\n\n“We’re gonna play a team that’s, this is a legitimate football team. They’re big time,” Arizona State coach Herm Edwards said. “They’re good, and they’re gonna stop you. Sometimes, you’re going to do everything right, and they’re just going to beat you. And you can’t worry about that because that’s going to happen. That’s what I call ball.”\n\nDantonio can take over Michigan State’s career lead in victories with a win this week. He and Duffy Daugherty are tied for first place at 109.\n\nThings to watch when the Spartans host the Sun Devils:\n\nRUNNING GAME\n\nArizona State’s Eno Benjamin needs 45 yards rushing to reach 2,000 for his career, but he’ll be up against a defense that excels against the run. Michigan State was No. 1 in the nation against the run last season and has allowed minus-6 yards on the ground so far this year.\n\nHOME STATE\n\nMichigan State quarterback Brian Lewerke is from Phoenix, so this is a special matchup for him. He threw for 314 yards and a touchdown in the loss at Arizona State last year.\n\nSTREAK\n\nArizona State has scored more than seven points in 136 consecutive games, the longest active streak in the FBS. The Sun Devils had only three points entering the fourth quarter last year before rallying to beat Michigan State.\n\nPASS RUSH\n\nJayden Daniels was the first true freshman quarterback to start the season opener for Arizona State. Through two games, he has thrown for 588 yards and three touchdowns with no interceptions - but the Sun Devils have allowed six sacks in two games.\n\n“Offensive linemen, it takes them longer to develop than any other position,” offensive coordinator Rob Likens said. “You can get away with young receivers, a young running back, you can even get away at times with a young quarterback, but offensive linemen, it just takes time. We’re going to have to develop those guys. We’re going to have to protect them in what we do and it’s not going to be easy.”\n\nRECORD\n\nDantonio was reflective this week when asked about Daugherty’s record. Daugherty coached the Spartans from 1954-72, going 109-69-5.\n\n“Duffy was ahead of his time. He recruited all across America - brought players in from the South,” Dantonio said. “When I came here and I walked into what was the Duffy Daugherty Center at that time, sort of a little hall of history there, and I was amazed.”\n\n___\n\nFollow Noah Trister at https://twitter.com/noahtrister\n\n___\n\nMore AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP_Top25\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "This was the moment early last season when Michigan State's offense hit its first major snag.", "authors": ["The Washington Times Http", "Noah Trister"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/08/w_michigan_michigan_st_football_61232_c0-163-4182-2601_s1770x1032.jpg?1a94ffd897cc416e3a5e7aa54b6c9db9c28c12dc", "published_at": "2019-09-13"}