{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/20/prophet-muhammad-facebook-post-violence-4-dead-doz", "downloaded_at": "2019-10-20 17:01:51.174362+00:00", "title": "Four dead, dozens injured in violence over Facebook post", "language": "en", "text": "DHAKA, Bangladesh — At least four people were killed and dozens injured Sunday after security officials in southern Bangladesh opened fire to disperse hundreds of Muslims during a protest over an alleged social media post undermining Islam’s Prophet Muhammad, police said.\n\nThe violence took place in Borhanuddin in the southern district of Bhola when angry protesters demanded the punishment of a Hindu man for the alleged Facebook comment, said local police chief Sarkar Mohammad Kaisar. The man denied making the comment, saying his Facebook account had been hacked.\n\nKaisar said four people were killed and the injured, including about a dozen police officials, were being treated in local hospitals. Bangladesh’s leading newspapers said about 100 people were injured.\n\nBhola is 72 miles (116 kilometers) south of the capital, Dhaka.\n\nLocal authorities held a meeting Sunday to try to defuse the tensions that began Friday as the Facebook post gained attention in the area. But the angry protesters started attacking security officials, prompting them to retaliate, Kaisar said.\n\nHe said that following a complaint by the Facebook account holder, police detained three people for allegedly hacking the account.\n\nCommunal tensions often pop up in Muslim-majority Bangladesh, with minority groups saying they face discrimination.\n\nBangladesh is a parliamentary democracy and its legal system is based on British common law. Despite demands by hard-line Islamist groups, authorities in Bangladesh have long refused to introduce tougher Islamic laws in the South Asian nation.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "At least four people were killed and dozens injured Sunday after security officials in southern Bangladesh opened fire to disperse hundreds of Muslims during a protest over an alleged social media post undermining Islam's Prophet Muhammad, police said.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2016/07/28/Earns_Facebook.JPEG-3ac5e_c0-40-4381-2595_s1200x700.jpg?6fa45ef89f39244a492ca252679b1809416131fb", "published_at": "2019-10-20"}