{"pub": "euronews", "url": "https://euronews.com/2019/10/16/elizabeth-warren-under-fire-democratic-debate-n1066881", "downloaded_at": "2019-10-16 01:38:15.908699+00:00", "title": "Elizabeth Warren under fire at Democratic debate", "language": "en", "text": "Sen. Elizabeth Warren entered Tuesday night's Democratic presidential primary debate as the new frontrunner in the race — and the bulls-eye on her back became a target for the other candidates on the stage.\n\nWarren took repeated shotsfrom lower-tier candidates, including several from Minnesota Sen. Amy Klobuchar, who accused her of being deceitful by not acknowledging her Medicare for All plan would raise taxes on the middle class, as Sen. Bernie Sanders admitted.\n\n\"At least Bernie's being honest here,\" Klobuchar said. \"I'm sorry Elizabeth, but you have not said that.\"\n\nKlobuchar also suggested that Warren would never be able to get her plan through Congress, while Klobuchar said she could pass her plan.\n\n\"The difference between a plan and a pipe dream is something that you can actually get done,\" the Minnesota senator said.\n\nSouth Bend Mayor Pete Buttigieg also accused Warren of dodging the question, saying, \"This is why people here in the Midwest are so frustrated with Washington in general.\"\n\nHe also said Warren didn't have a clear way to pay for her health plan.\n\n\"Your signature, senator, is to have a plan for everything — except this,\" Buttigieg said.\n\nWarren seemed prepared for the attacks, and was quick to return fire, calling Buttigieg's plan, \"Medicare for all who can afford it.\"\n\nFormer Texas Rep. Beto O'Rourke offered that Warren's tax the rich talk sounded too tough, and that she's more focused \"on being punitive\" than \"lifting people up.\"\n\n\"I'm shocked at the notion anyone thinks I'm punitive,\" Warren said.", "description": "''There's a difference between a plan and a pipe dream,\" Sen. Amy Klobuchar said to the Massachusetts Democrat.", "authors": [], "top_image": "https://static.euronews.com/articles/4236700/1000x563_nbc-191015-elizabeth-warren-debate-ew-839p_15309adf84b021ecbf418f1852d7aabb.jpg", "published_at": "2019-10-16"}