{"pub": "reuters", "url": "https://in.reuters.com/article/us-china-steel/chinas-steel-industry-fragmentation-worsening-official-idINKBN1WU1MC", "downloaded_at": "2019-10-15 12:29:09.126598+00:00", "title": "China's steel industry fragmentation worsening: official", "language": "en", "text": "FILE PHOTO: A worker walks past steel rolls at the Chongqing Iron and Steel plant in Changshou, Chongqing, China August 6, 2018. REUTERS/Damir Sagolj\n\nBEIJING (Reuters) - China’s steel sector fragmentation is worsening, an industry official said on Tuesday, citing unplanned new capacity at small mills undermining government efforts to restructure and merge companies in the huge industry.\n\nBeijing has been trying to consolidate the world’s largest steel market to curb excess capacity and pollution and has set a goal for its top 10 steelmakers to own 60% of production capacity by 2020.\n\nHowever, Chinese Society for Metals (CSM) president Gan Yong said the trend is for less rather than more consolidation, saying unplanned capacity expansion at smaller mills was coming online while their big mostly state-owened rivals were struggling to do the same as quickly.\n\n“There are some places using steel as a key contributor to economic growth as demand is robust,” Gan told Reuters on the sidelines of an industry event, adding some regions in China were not managing overcapacity controls very strictly.\n\nThe Ministry of Industry and Information Technology recently warned that the sector is still having trouble with increasing illegal capacity, including new mills not approved by the government and those that were supposed to be shut in capacity swaps.\n\nGan warned of growing competition in high-end products too. “There are signs of overcapacity in stainless steel, electrical steel and auto sheet steel,” he said.\n\nIn the first eight months of 2019, the world’s top steelmaker churned out 665 million tonnes of crude steel, up 9.1% on the year.\n\nProduction by members registered with the China Iron and Steel Association (CISA), mostly state-owned firms, grew at 5.9% year-on-year during that period. Production by non-members, mostly private firms, surged 19.4%, according to CISA.\n\nChina has eliminated 140 million tonnes of steel capacity at 700 small mills and 150 million tonnes of inefficient capacity at larger firms in the past four years as part of its environmental crackdown and supply-side reform.", "description": "China's steel sector fragmentation is worsening, an industry official said on Tuesday, citing unplanned new capacity at small mills undermining government efforts to restructure and merge companies in the huge industry.", "authors": ["Min Zhang", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191015&t=2&i=1441094608&w=1200&r=LYNXMPEF9E0ZH", "published_at": "2019-10-15"}