{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/29/familiar-problems-plague-cardinals-in-27-10-loss-t", "downloaded_at": "2019-09-30 02:18:45.866209+00:00", "title": "Familiar problems plague Cardinals in 27-10 loss to Seahawks", "language": "en", "text": "GLENDALE, Ariz. (AP) - Arizona quarterback Kyler Murray was impressive at times with his arm and legs, made rookie mistakes at others.\n\nThe Cardinals moved the ball most of the game, yet struggled to score touchdowns when they got deep into Seattle’s end of the field.\n\nArizona’s defense gave up big plays and committed penalties at key moments, couldn’t stop the Seahawks from going on a game-sealing drive after the offense finally got into the end zone. They were burned by another tight end, too.\n\nSame script as Arizona’s first three games, similar result.\n\nHaunted by the same mistakes plaguing them all season, the Cardinals made little progress and remained winless after losing to the Seahawks 27-10 on Sunday.\n\n“We want to play better, obviously,” Arizona coach Kliff Kingsbury said. “Negative plays have hurt us offensively and defensively untimely penalties at times and some missed tackles. It’s all on us coaches and players to get better. We have to get better. I like the competitive spirit we’re playing with. The execution is lacking at times and that’s on all of us.”\n\nThe Cardinals (0-3-1) entered the season brimming with excitement. They had Murray, the Heisman Trophy winner and No. 1 overall draft pick, and an innovative offense in their first year under Kingsbury.\n\nArizona played Detroit to a tie in its season opener, yet kept up the buzz with a scintillating comeback to nearly snatch away a victory.\n\nThe past three games have been more fizzle than sizzle.\n\nThe Cardinals have been slow starters most of the season - last week against Carolina being the exception - and were again in an early hole against the Seahawks (3-1), trailing by 10-0 in the first quarter, 20-3 at halftime.\n\nArizona’s offense did its part - until reaching the red zone.\n\nJust as they have all season, the Cardinals struggled once they reached the opponents’ 20-yard line, forced to kick field goals instead of scoring touchdowns.\n\nUnlike the previous games, Zane Gonzalez didn’t come through; he made one of his three field-goal attempts after starting the season with nine straight makes.\n\n“Obviously, if you’re in the red zone that many times and we don’t score, it’s tough,” said Cardinals running back David Johnson, who had 11 catches for 99 yards and 40 yards rushing on 11 carries.\n\nMurray made some dynamic plays, throwing for 241 yards and scoring his first NFL rushing touchdown on a 9-yard run in the fourth quarter. He also had an interception returned for a 27-yard touchdown by Jadeveon Clowney in the first quarter - albeit on a spectacular play - and was sacked a couple of times (four total) trying to extend plays instead of throwing the ball away.\n\n“Everybody in the building understands what we have, how it is supposed to go, how it is supposed to look,” said Murray, who hit 22 of 32 passes. “There are flashes but we haven’t put it a together. Once we put it all together, we will be fine.”\n\nArizona’s defense gave up big plays in key third-down situations and hurt itself with penalties at inopportune moments.\n\nThe Cardinals also couldn’t come through after Murray’s TD run cut the score to 20-10, allowing the Seahawks to grind them down on a 15-play, 75-yard drive that ate up nearly 13 minutes and ended with C.J. Procise’s 9-yard, game-clinching touchdown run.\n\nAnd yet another tight end got the best of the Cardinals. They game-planned to stop Seattle’s tight ends after four previous tight ends had big games and failed again. Will Dissly caught eight passes for 57 yards, including a 9-yard TD in the second quarter.\n\n“We obviously didn’t execute the plan as well as we’d hoped,” Kingsbury said. “That tight end is a solid player, but we’ve got to do a better job on him.”\n\nArizona did have one bit of positive news: Larry Fitzgerald passed Tony Gonzalez for second on the NFL’s all-time receptions list with 1,326.\n\nThe Cardinals also had a bit of bad news when fellow receiver Christian Kirk twisted his right leg awkwardly while being tackled in the closing seconds.\n\nBut that’s the way it’s gone for Arizona so far this season.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Arizona quarterback Kyler Murray was impressive at times with his arm and legs, made rookie mistakes at others.", "authors": ["The Washington Times Http", "John Marshall"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/29/seahawks_cardinals_football_84512_c0-101-2424-1514_s1770x1032.jpg?5128c0542677d92cd7ef62739fc5054768e2243d", "published_at": "2019-09-29"}