{"pub": "afr", "url": "https://afr.com/companies/financial-services/qe-in-australia-far-from-a-fait-accompli-20191006-p52y0d", "downloaded_at": "2019-10-06 13:13:10.669433+00:00", "title": "QE in Australia far from a fait accompli", "language": "en", "text": "The RBA's lack of enthusiasm for going down this path is palpable. Only two months ago, Lowe told a parliamentary committee that it seemed \"unlikely\" the RBA would need to resort to unconventional monetary stimulus.\n\nAnd he expressed his hope that the RBA could avoid resorting to unorthodox monetary stimulus measures used by central banks in Europe, the United States and Japan.\n\nBut, as a cautious central banker, he was careful to avoid locking the RBA into an inflexible position. \"We are prepared to do unconventional things if the circumstances warrant it,\" he said.\n\nIt would be extremely difficult to justify adopting experimental monetary policies that have significant negative side effects.\n\nThis leaves the RBA board in an invidious position. Certainly, economic growth has tumbled to 1.4 per cent, its slowest clip in a decade, and inflationary pressures remain muted.\n\nStill, employment growth has been strong, and the housing market – particularly in Sydney and Melbourne – is rebounding strongly. In this situation, it would be extremely difficult to justify adopting experimental monetary policies that have significant negative side effects.\n\nThe Reserve Bank is running out of room to cut interest rates any further, but the economy is not in such a parlous state to justify the use of extreme monetary measures. David Rowe\n\n\"Monetary policy cannot deliver medium-term growth,\" Lowe told an approving audience of the world's top central bankers at the Jackson Hole symposium in August. \"We risk just pushing up asset prices.\"\n\nAdvertisement\n\nFaced with this policy dilemma, the RBA board could well decide that the best course of action is to refrain from rushing to adopt unconventional monetary stimulus.\n\nIf the economy were to slow further, the Morrison government would come under huge political pressure to abandon its obsession with securing a budgetary surplus in favour of more sensible policies to boost economic activity, such as increasing infrastructure spending or pushing through additional tax cuts.\n\nThere's no doubt that Frydenberg's preoccupation with eliminating the budget deficit has undercut the effectiveness of the RBA's latest volley of rate cuts.\n\nLast month, Frydenberg declared the budget was \"back in balance\" for the first time in 11 years, with a modest cash deficit of only $690 million for the 2018-19 financial year compared with the hefty $10.1 billion deficit the previous year.\n\nFiscal policy has been at odds with monetary policy.\n\nBut this means that fiscal policy has been at odds with monetary policy. Tighter budgetary policy has been weighing on economic activity at the same time as the RBA has been trying to stimulate growth with lower interest rates.\n\nAs Lowe noted in a speech in Darwin in early July: \"We will achieve better outcomes for society as a whole if the various arms of public policy are all pointing in the same direction.\"\n\nOf course, if global economic growth slumped, or if financial markets experienced a fresh round of turbulence, the RBA would likely decide that circumstances justified the use of unconventional monetary policies.\n\nAdvertisement\n\nAnd it's had ample opportunity to observe the effectiveness of the various monetary experiments run by major central banks over the past decade.\n\nAs Lowe told a parliamentary committee back in August, if the RBA ever found itself in the position where it could not cut short-term interest rates any further, the next option would be to buy government bonds so as to drive down long-term bond yields.\n\n\"I think the focus would be on trying to reduce the risk-free interest rate,\" he said. \"If circumstances warranted it, we could take action to lower the risk-free rates further out along the time spectrum.\"\n\nThis practice of buying government bonds – known as quantitative easing, or QE – was developed by the US Federal Reserve at the height of the financial crisis, and was adopted by the European Central Bank and the Bank of Japan.\n\nThe aim is to push down long-term bond yields, which translates into lower borrowing costs for consumers and businesses. Lower bond yields also encourage investors to buy riskier assets, such as stocks and corporate bonds.\n\nBut the RBA is well aware that QE isn't a universal panacea for economic woes.\n\nAs RBA deputy governor Guy Debelle noted in a speech last December, the Fed's first round of QE was very effective in restoring confidence and liquidity to financial markets at a time when major institutions were refusing to lend to each other.\n\n\"The central bank actions were designed to alleviate the credit crunch ... The aim was to keep the credit flowing and limit the need for fire sales wherever possible,\" he said.\n\nAdvertisement\n\n\"An important motivation for this first phase of quantitative easing in the US and elsewhere was addressing the market dysfunction ... This first phase of QE was particularly effective. My view is that subsequent phases of QE had diminishing returns.\"\n\nDebelle also noted that the impact of QE in Australia is likely to differ from the US experience.\n\nIn the first place, he noted, the decline in bond yields is likely to be greater, simply because government debt levels are lower. \"There are less government bonds here, which may make QE more effective\", he noted.\n\nOn the other hand, the reduction in borrowing costs for households and small businesses is likely to be muted, because these are more closely tied to short-term interest rates.\n\n\"Most of the traction in terms of borrowing rates in Australia is at the short end of the curve rather than the longer end of the curve, which might reduce the effectiveness of QE.\"", "description": "The Reserve Bank is running out of room to cut interest rates any further, but the economy is not in such a parlous state to justify the use of extreme monetary measures.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.6372%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_395%2C$y_248/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/1c213c8b220c997a85b38b36248dd5f79923bc91", "published_at": "2019-10-06"}