{"pub": "arynews", "url": "https://arysports.tv/djokovic-federer-bow-shanghai-next-gen-stars-roar-semis", "downloaded_at": "2019-10-12 16:06:19.076509+00:00", "title": "Djokovic, Federer bow out in Shanghai as ‘Next Gen’ stars roar into semis", "language": "en", "text": "The next generation of youngsters made their mark at the Shanghai Masters as Stefanos Tsitsipas and Alexander Zverev knocked out former champions Novak Djokovic and Roger Federer respectively, booking their semi-final spots on Friday.\n\nSixth seed Tsitsipas battled back from a set down to defeat top seed Djokovic 3-6 7-5 6-3 to register his first victory over a reigning world number one.\n\nThe 21-year-old came into the match having sealed his place in next month’s season-ending ATP Finals and celebrated with his second career win over Djokovic in three meetings.\n\n“He had the high-quality tennis and he played well after his serve. He was backing up his serve with really good, aggressive first shots in the rally,” Japan Open winner Djokovic told reporters.\n\n“I didn’t make him defend enough. I just gave him enough time to really dictate the play… and he deserved to win.”\n\nGermany’s fifth seed Zverev beat a spirited Federer 6-3 6-7(7) 6-3 in a dramatic affair that lasted a little over two hours.\n\nStaring down the barrel in the second set, Federer saved five match points to force a decider where he failed to keep his composure, receiving a rare point penalty for ball abuse.\n\nZverev took his opportunities in the final set and finished the encounter with 43 winners to Federer’s 21.\n\n“He will always make it tricky for you like he did today with me, and you always got to play your best tennis to have a chance,” Zverev said.\n\n“I knew if I’m going to keep playing the way I played the first two sets, I’m going to have a chance in the third as well.”\n\nZverev will next meet Italy’s 23-year-old Matteo Berrettini, who defeated China Open champion Dominic Thiem 7-6(8) 6-4. Tsitsipas takes on U.S. Open runner-up Daniil Medvedev, who overcame Italy’s Fabio Fognini 6-3 7-6(4).\n\nFor the first time since the tournament’s inaugural edition in 2009, none of the ‘Big Four’ — Djokovic, Rafa Nadal, Federer and Andy Murray — are in contention for the trophy.\n\nDjokovic, Nadal, Federer, Medvedev, Thiem and Tsitsipas have booked their places for the ATP Finals, with two spots still up for grabs for the tournament in London.\n\nComments\n\ncomments", "description": "The next generation of youngsters made their mark at the Shanghai Masters as Stefanos Tsitsipas and Alexander Zverev knocked out former champions Novak Djokovic and Roger Federer respectively, booking their semi-final spots on Friday.", "authors": [], "top_image": "https://arysports.tv/wp-content/uploads/2019/10/Djokovic-1.jpg", "published_at": "2019-10-12"}