{"pub": "investing.com", "url": "https://ng.investing.com/news/forex-news/forexyen-franc-sink-as-fading-risks-take-shine-off-safehavens-47763", "downloaded_at": "2019-09-10 07:47:22.694198+00:00", "title": "REFILE-FOREX-Yen, franc sink as fading risks take shine off safe-havens", "language": "en", "text": "© Reuters. REFILE-FOREX-Yen, franc sink as fading risks take shine off safe-havens\n\n(Corrects day of the week in lede)\n\n* Positive mood drives traders from safe havens\n\n* Mnuchin touts trade progress, Germany reportedly mulls\n\nstimulus\n\n* Yen, franc, gold and silver sold\n\n\n\nBy Tom Westbrook\n\nSINGAPORE, Sept 10 (Reuters) - The yen and swiss franc fell\n\nto five-week troughs on Tuesday as investors looked for\n\nhigher-risk currencies, emboldened by a report of German\n\nstimulus plans, diminishing chances of a no-deal Brexit and\n\nhopes of a trade war breakthrough.\n\nSilver and gold were also sold in the slide\n\nthat pushed the yen JPY=EBS as low as 107.49 per dollar, and\n\nthe franc to $0.9922, with both also losing ground to the\n\neuro.\n\n\"Over the past 24 hours there has been a move towards more\n\nrisk-friendly, pro-growth currencies,\" Rodrigo Catril, senior FX\n\nstrategist at National Australia Bank in Sydney.\n\n\"But it is kind of a lull period following a whole stream of\n\npositive news last week. We're in a wait-and-see mode with major\n\nrisk events like Brexit and trade negotiations being kicked down\n\nthe road.\"\n\nThe pound GBP=D3 stood just under a six-week high of\n\n$1.2385, hit overnight after a British law blocking a no-deal\n\nexit from the European Union came into force. The South Korean won and New Zealand dollar\n\ndrifted higher, the won holding close to a month high at 1,191.0\n\nper dollar and the kiwi close to a three-week peak at $0.6434.\n\nExuberance was held back, however, by weak Chinese economic\n\ndata that hit equities markets, with factory-gate prices\n\nshrinking at their fastest pace since August. Ratings house Fitch on Tuesday cut growth forecasts for\n\nEurope and China citing rising protectionism. The yuan CNY=CFXS held mostly flat around 7.1169 per\n\ndollar.\n\nTraders also remained cautious ahead of a key European\n\nCentral Bank meeting on Thursday, at which policymakers are\n\nexpected to ease monetary policy. The euro EUR=EBS was flat at $1.1043, underneath an\n\novernight high of $1.1067 hit following a Reuters report that\n\nGermany may set up public investment agencies to boost fiscal\n\nstimulus without breaching national spending rules. \"This news caused some people to revise down their\n\nexpectations for Thursday's ECB meeting, although I think that's\n\nentirely premature,\" said Marshall Gittler, chief strategist at\n\nACLS Global, in a note.\n\n\"I think the small rally in EUR today just sets up the\n\ncurrency for a bigger fall on Thursday.\"\n\nMarket hopes for a trade breakthrough, meanwhile, rested on\n\nconfidence overnight from U.S. Treasury Secretary Steven\n\nMnuchin. He told Fox television that there had been \"a lot of\n\nprogress\" on a U.S-China trade deal and that the U.S. side was\n\n\"prepared to negotiate\". The remarks pushed U.S. benchmark 10-year Treasuries\n\nto a three-week high where they held in Asian trade.\n\nThe dollar was flat against a basket of currencies at\n\n98.359.\n\nSterling barely shifted when Britain's parliament voted, as\n\nexpected, to stymie Prime Minister Boris Johnson's bid for an\n\nearly election, which prompted him to vow that he would secure a\n\nBrexit deal at an EU summit next month.\n\n\"While I am loath to go anywhere near the pound, I like what\n\nI see in the price action,\" said Chris Weston, head of research\n\nat Melbourne forex brokerage Pepperstone Group.\n\n\"If kicks up through $1.2354 again, I would be\n\nlooking for longs, with a stop through $1.2234.\"\n\n\n\n", "description": "REFILE-FOREX-Yen, franc sink as fading risks take shine off safe-havens", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC0O0HA_L.jpg", "published_at": "2019-09-10"}