{"pub": "reuters", "url": "https://reuters.com/article/us-health-vaping-massachusetts/vape-shop-owners-sue-massachusetts-over-product-sale-ban-idUSKBN1WG2HT", "downloaded_at": "2019-10-01 09:25:41.399921+00:00", "title": "Vape shop owners sue Massachusetts over product sale ban", "language": "en", "text": "FILE PHOTO: A man exits a vape shop in Jersey City, New Jersey, U.S., September 12, 2019. REUTERS/Eduardo Munoz\n\n(Reuters) - Several vape shop owners are suing the state of Massachusetts for implementing a four-month ban on sales of all vaping products and asked the court to deem it “unconstitutional.”\n\nMassachusetts imposed a ban on sales of all e-cigarettes and supplies, both those used for tobacco and marijuana, which is legal in the state, citing a national public health emergency.\n\nU.S. health officials are investigating a mysterious vaping-related respiratory illness that has so far caused 12 deaths and sickened 805 people.\n\nThe ban will impact customers, wholesalers and corporations, the plaintiffs said in a lawsuit filed in the U.S. District Court of Massachusetts on Sunday.\n\nThe plaintiffs argue that the ban undermines the U.S. Food and Drug Administration’s assessment that the Electronic Nicotine Delivery Systems (ENDS) products and e-liquids are safe to use and distribute.\n\nThe plaintiffs for the case are Mass Dynamics LLC, Boston Vapor LLC and Vick’s Vape Shop.\n\nThe Centers for Disease Control and Prevention has urged people to not use e-cigarettes with marijuana ingredient tetrahydrocannabinol (THC) as latest data suggests that the high-inducing component may play a role in causing respiratory illness.", "description": "Several vape shop owners are suing the state of Massachusetts for implementing a four-month ban on sales of all vaping products and asked the court to deem it \"unconstitutional.\"", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191001&t=2&i=1435704918&w=1200&r=LYNXMPEF901QN", "published_at": "2019-10-01"}