{"pub": "yahoo", "url": "https://sg.style.yahoo.com/last-black-man-san-francisco-083851414.html", "downloaded_at": "2019-10-24 09:57:08.847593+00:00", "title": "The Last Black Man in San Francisco review: tender, lyrical proof that there's no place like home", "language": "en", "text": "Dir: Joe Talbot. Cast: Jimmie Fails, Jonathan Majors, Danny Glover, Thora Birch, Tichina Arnold, Rob Morgan, Mike Epps. 15 cert, 121 mins\n\nBeing priced out of a neighbourhood, and wanting back in, are especial sore spots for the character played by Jimmie Fails, a wonderful newcomer to films, in The Last Black Man in San Francisco. Two generations earlier, his grandfather built a house – a classic, Queen Anne-style neoclassical job with a witch’s hat spire, up a hill in the city’s Fillmore District. But then gentrification took hold, while the down-and-out likes of Jimmie – for Fails plays a version of himself here – had to settle for floorspace in someone else’s bedroom.\n\nEven the house’s white, middle-class owners are being forced to foreclose thanks to an inheritance dispute, and they’re openly heartbroken about it. But Jimmie watches, and Jimmie waits. While his best friend, a dreamy playwright called Mont (Jonathan Majors), keeps guard, he’s been tending to the place on the sly – sneaking up to repaint the exteriors, and dreaming of sanctuary inside. When it’s left empty for months on the trot, the pair of them go one step further, and break in.\n\nThis sketch of a plot is based on the life story of Jimmie, who spent the early days of his childhood in a similar abode, before becoming periodically homeless, and living in a car with his dad, played by a typically excellent Rob Morgan. The film – a debut for Joe Talbot, who won Best Director at Sundance earlier this year – springs off Jimmie’s tale with a yearning lyricism that sets it apart. It’s sensationally well-shot by another relative newcomer to the medium, the cinematographer Adam Newport-Berra, who captures multiple San Franciscos nestling together at once, revelling in its fairytale contours, but always conjuring the sense of a kingdom under lock and key.\n\nThere’s one gloriously composed telephoto shot of Jimmie skateboarding down one of the city’s steepest streets, snaking his way from top to bottom. It’s hard to forget. He and Mont nonchalantly claim whatever spaces they pass through, however suspiciously they’re stared at: the script doesn’t need to push its racial themes home too overtly, other than having all the white characters call them “man” a lot.\n\nJimmie, with his rueful, placatory manner, feels like the kind of protagonist we’ve got to know in Jim Jarmusch’s films. Accused of dressing like a white-boy hipster in lumberjack plaid, he’s evidently a different breed from some of the other guys in the neighbourhood, who congregate snarlingly on the street, all mouth, and no employment.\n\nMont, with a pencil always behind one ear, is an interestingly awkward figure, unable to convincingly say the N word, and testing out his latest play – a fiery two-hander – by swapping positions on a pier to upbraid himself. When he seemingly takes leave of his senses, crossing a street to confront the gang-bangers, he does so by eccentrically giving them director's notes – asking them to be more convincing, less clichéd, versions of themselves.\n\nThe offbeat characterisation prods away intelligently at the way black guys get stereotyped on screen. And the friendship between Jimmie and Mont has a lovely, understated warmth – it’s a bedrock. Danny Glover has a small role as Mont’s blind grandfather, who needs old movies, like the Frisco-set noir thriller D.O.A. (1949), audio-described to him from their couch. It’s an in-joke how urgent, in contrast to this low-key gem, the storytelling is there – D.O.A.’s main character is dying from the start. The self-own recurs when Mont semi-apologetically admits his play “doesn’t have much plot yet”.\n\nIn turn, it’s a film about place, this, not plot – vacating a home, regaining it, vacating it again. We have just enough time to get settled, to enjoy the sunlight pouring in on Jimmie's family heirlooms, that we feel the ache when we’re thrown out. In a week of unusually dominant music scores, this one by Emile Mosseri gets the last word – it’s all tender, jazzy majesty, with haunted oboes and foghorn tubas coming up in the bass. It may not be quite like any score you’ve heard before, and it has a strange, magical impact. The whole film lifts and sighs as a lament for vanished birthrights, while coaxing these characters to cherish what they have.\n\nSubscriber reward: Click here to save up to 40% on tickets at more than 250 cinemas across the UK", "description": "Dir: Joe Talbot. Cast: Jimmie Fails, Jonathan Majors, Danny Glover, Thora Birch, Tichina Arnold, Rob Morgan, Mike Epps. 15 cert, 121 mins", "authors": ["Tim Robey"], "top_image": "https://s.yimg.com/uu/api/res/1.2/E9dvDLWwPrdjOqRIsYayaA--~B/aD0xNTYzO3c9MjUwMTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-GB/the_telegraph_818/e7c8b485df0288bca1fc8ab26298fcd5", "published_at": "2019-10-24"}