{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/top-10-places-to-download-or-stream-movies-for-free-legally", "downloaded_at": "2019-10-04 02:36:07.066661+00:00", "title": "How To (Legally) Download Or Stream Movies For Free", "language": "en", "text": "It's easy to find movies to download or stream; even for law-abiding popcorn munchers! If you're flying straight and narrow or want to support and watch films that are free, public domain, or whose creators want them free and openly shared, here are some great sites to bookmark - and visit when you want something new to watch.\n\nIllustration by Nick Criscuolo.\n\nAustralia's publicly funded free-to-air TV channels provide on demand access to thousands of free movies and documentaries. Handily, the apps are available on a range of smart TVs and video consoles which makes it easy to watch on your big screen television. The user interfaces aren't nearly as polished as Netflix and the like, but they do get the job done (and you don't have a to pay a cent for the privilege.)\n\nYou can also catch free online movies via tenplay, nine now and 7plus.\n\nVimeo is most certainly second seat to YouTube when it comes to size and popularity, but it's still a great video upload service for short film and independent filmmakers and for people who want the freedom and flexibility of a mobile-friendly, HD-capable upload service with great privacy and video management controls and an upbeat community of users.\n\nFor those folks just looking for something great to watch, Vimeo's Staff Picks is full of gems that run the gamut from drama to documentary to science fiction and back again. Best of all, you can either grab the Vimeo mobile apps to take your movies with you, or stream Vimeo films directly to your TV through your Chromecast, Roku, Xbox, or Apple TV.\n\nIf you'd rather download than stream, Public Domain Torrents is the place to go. As you'd expect, a number of the films available for download there are pretty old, or classic cinema, but that doesn't mean they're not completely free to download and watch whenever you want, as often as you choose.\n\nBest of all, many of the films here are available in versions that are optimised or encoded for specific mobile devices, or you can just grab the highest quality download and do the encoding yourself, it's up to you.\n\nTopDocumentaryFilms, or TDF, is another great documentary site - and probably one that's a little more up to date with more recent films. Like WatchDocumentary.org, the site has loads of documentaries broken up by category, from war and global conflict and crime to health and environment.\n\nIt's a little easier to navigate and the site has a community of users who provide ratings for each film and can comment on them so you have an idea of what you're in for before you watch. If you'd like a starting point, check out their top 100 documentary list to see what people are watching, or check the front page for their featured films.\n\nLike other documentary sites, they're a bit more of an aggregator, and their content is pulled from YouTube, Vimeo, and other sources - but that also makes it a convenient one-stop shop for what you want to see.\n\nIf the name doesn't give it away immediately, Classic Cinema Online is ideal for those old, classic movie buffs who love the era of black and white films and artistically painted movie posters. Classics like Gregory Peck's Moby Dick and the original Lone Ranger film are among some of the site's highlights, but if you dive deeper you can find treasures like the 1952 Mutiny and the 1932 Secret of Dr. Kildare, among others.\n\nIf you're looking for something specific, you can sort by category using the menu in the upper right, check out the serials available, or just check out the old, super classic silent films from the menu up there too. If you love old movies the Golden Age of Hollywood (or just look back on it with rose coloured glasses from time to time,) this site is for you.\n\nWith thousands of free TV shows and movies, and names and titles you'll probably recognise, PopcornFlix is owned and operated by Screen Media Ventures, an independent distributor of TV shows and media to the television market - which means they have the rights for a great deal of shows.\n\nThe service prides itself on the fact that none of its programs or movies are more than two clicks away and they're all completely free to watch on your computer, or through their mobile apps or other supported devices.\n\nTheir distribution rights mean you'll find full National Geographic series catalogues, so you can catch up on episodes of Wild Justice or Alaska State Troopers, or sit back and watch Inspector Gadget or Rugrats Gone Wild.\n\nMoviesFoundOnline collects free films, independent films, stand-up comedy, TV shows and other media freely available around the web. From full films to indie TV series to classic film, you can browse the site's categories across the top - like short films, documentaries, viral videos, or comedy to name a few - to find something you're interested in specifically.\n\nIt's worth pointing out that since MoviesFoundOnline doesn't upload or host the media themselves, some of it may wind up vanishing if there's a copyright claim, but they do host a lot of great, freely available and difficult to find movies and TV recordings that would otherwise fall by the wayside of time.\n\nOwned by Sony (which is why there's so much to watch), Crackle is often overlooked when people discuss free streaming media on the web, but it's present on a number of mobile devices and set-top boxes. You do have to sign up for an account, but once you do you can create a watchlist, get recommendations on what to watch based on the things you like, and browse the full library of TV shows and movies, including Comedians in Cars Getting Coffee and Sports Jeopardy!, or TV series' like Firefly and Seinfeld.\n\nThat's part of the beauty of Crackle - you'll absolutely find movies you've heard of, shows you actually want to watch, and more, and it's all free - as long as you're willing to watch commercials and ads occasionally.\n\nNo list of freely available TV shows and movies would be complete without YouTube and not because of the sheer volume of ripped and pirated media available there - in fact, YouTube is home to many free movies and TV shows, many of which are YouTube originals and others that are available via Creative Commons or shared in the public domain.\n\nMany YouTube originals are vanishing behind the paid curtain of YouTube Red, but there are still plenty to be found and lots of entertaining shows and movies - and channels to subscribe to. For example, the Paramount Vault channel is packed with free movies and that's just the tip of the iceberg.\n\nThe Internet Archive is a repository for all sorts of things, and while you probably know it for the ever-useful Wayback Machine, it's also great for public domain films, independent media, TV broadcasts and newsreels and other media that you're free to use and remix on your own as well as sit back and enjoy for yourself.\n\nThere are plenty of movies, organised by category like sci-fi, horror, or film noir, but also art films, educational videos and films, special collections that were made available to the Internet Archive for posterity, documentaries and even stock footage. It's not the most easily browse-able, or organised for non-computer screens and good luck getting that video on a bigger screen unless you download it first, but it's certainly a treasure trove.\n\nThis story has been updated since its original publication.", "description": "It's easy to find movies to download or stream; even for law-abiding popcorn munchers! If you're flying straight and narrow or want to support and watch films that are free, public domain, or whose creators want them free and openly shared, here are some great sites to bookmark - and visit when you want something new...", "authors": ["Alan Henry", "Tooran Alizadeh"], "top_image": "https://edge.alluremedia.com.au/m/l/2018/03/Dogma.jpg", "published_at": "2019-10-04"}