{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7623781/MAFS-Martha-Kalifatidis-reveals-living-parents.html", "downloaded_at": "2019-10-29 02:18:11.195357+00:00", "title": "MAFS' Martha Kalifatidis reveals she is STILL living with her parents", "language": "en", "text": "She's the Married At First Sight star who previously boasted that her parents live in a multi-million dollar 'Versace' mansion.\n\nAnd Martha Kalifatidis says she has no plans to move out of her family home because her boyfriend, Michael Brunelli, lives just 'five minutes away'.\n\nSpeaking to Daily Mail Australia, the 31-year-old makeup artist said: 'Eventually we are going to move in together but right now things are still quite up in the air.'\n\n'No rush': Martha Kalifatidis has no plans to move out of her parents' home, telling Daily Mail Australia she is staying put because her boyfriend, Michael Brunelli, lives 'five minutes away'\n\nShe added: 'He lives five minutes away from my parents' house, I am still living at my parents' house. We are going to get there [moving in together], but we're in no rush.'\n\nMartha explained that her recent holiday to Mexico and the U.S. with Michael has 'made [her] more sure' she wants them to live together.\n\n'I think for me, our trip sort of set everything in stone a little bit more. It made me more sure about how much I love him,' she said.\n\nMoving forward: Martha (pictured at her parents' mansion) said, 'Eventually [Michael and I] are going to move in together but right now things are still quite up in the air'\n\nLast month, Martha and Michael jetted to North America to celebrate one year since they filmed their non-legally binding MAFS wedding.\n\nThey documented their trip on Instagram, sharing several photos of themselves exploring the landmarks of New York City and Los Cabos, among other destinations.\n\nIn one of their holiday snaps, the genetically-blessed couple posed in a hole-in-the-wall pizzeria in Times Square.\n\nHolidaymakers: Last month, Martha and Michael jetted to North America to celebrate one year since they filmed their non-legally binding MAFS wedding. Pictured in New York City\n\n'Happiness': In one of their holiday snaps, the genetically-blessed couple posed in a hole-in-the-wall pizzeria in Times Square\n\nOn September 29, Martha marked their one-year 'wedding' anniversary by sharing a photo to Instagram of herself naked and embracing Michael on a balcony.\n\nThe caption simply read: 'One year, my dear.'\n\nMarried At First Sight returns to Channel Nine for a seventh season in 2020.", "description": "She's the Married At First Sight star who previously boasted that her parents live in a multi-million dollar 'Versace' mansion.", "authors": ["Mary Mrad", "Candice Jackson For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/23/20303906-0-image-a-29_1572305108495.jpg", "published_at": "2019-10-29"}