{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7596591/Crystal-Palace-weighing-ambitious-January-swoop-Chelseas-Olivier-Giroud.html", "downloaded_at": "2019-10-21 15:14:56.044894+00:00", "title": "Crystal Palace 'weighing up ambitious January swoop for Chelsea's Olivier Giroud'", "language": "en", "text": "Crystal Palace are keen to add some firepower to their struggling front-line with an ambitious January swoop for Chelsea striker Olivier Giroud, according to reports.\n\nPalace have had to make do with Christian Benteke and Jordan Ayew leading the line this season, and are desperate to add a more prolific front-man to their ranks.\n\nGiroud is unsettled at Chelsea, and The Sun report that Palace are keen to make the most of his uncertain future and move for his services in January.\n\nCrystal Palace are said to be weighing up a January swoop for Chelsea striker Olivier Giroud\n\nGiroud has been playing, and scoring, for the French national team but wants more club time\n\nThe Eagles have a good relationship with Chelsea, having previously loaned some of their players - Ruben Loftus-Cheek and Michy Batshuayi are two recent, successful examples - and the south Londoners hope they can get another over the line.\n\nGiroud has scored just once for the Blues this season - in the European Super Cup against Liverpool - and has found game time hard to come by.\n\nOn the international stage he has been prolific, netting three in four matches, but the Frenchman is desperate for more time on the pitch at domestic level too.\n\nChristian Benteke is without a goal this season and Palace want to sign another striker\n\nRoy Hodgson is hoping he can spend some of the club's finances on a striker in January\n\nReports state that the 33-year-old has already held talks with manager Frank Lampard about his future, with his contract expiring at the end of the season.\n\nGiroud fears that his lack of football will see him miss out on a place in France's squad for the European Championships next summer, making it even more important that he finds some football in the second half of the campaign.\n\nGiroud cost Chelsea £18million when they signed him from Arsenal in 2018, and he signed a year's extension to his £100,000-a-week deal back in May.", "description": "Crystal Palace have had to make do with Christian Benteke and Jordan Ayew leading the line this season, and are desperate to add a more prolific front-man to their ranks in the next transfer window.", "authors": ["Ben Nagle For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/14/19991310-0-image-a-122_1571664102319.jpg", "published_at": "2019-10-21"}