{"pub": "breitbart", "url": "https://breitbart.com/2020-election/2019/10/05/virgil-the-truth-about-the-bidens-hiding-in-plain-sight", "downloaded_at": "2019-10-05 22:59:48.175306+00:00", "title": "Virgil: The Truth About the Bidens–Hiding in Plain Sight", "language": "en", "text": "As creator of the modern detective story, Edgar Allan Poe always had a good plot twist up his sleeve. For instance, “The Purloined Letter,” from 1844, takes the reader by surprise: The incriminating letter, thought to be expertly hidden, hasn’t been hidden at all—it’s been hiding in plain sight.\n\nThe Simplicity of a Mystery\n\nThat is, while the police had been looking high and low for the incriminating letter —peeking into walls, pulling up floorboards—they hadn’t thought simply to look on the suspect’s desk. At the end of the story, the ace private eye explains that the suspect “had deposited the letter immediately beneath the nose of the whole world, by way of best preventing any portion of that world from perceiving it.”\n\nOne reason the Poe story endures is that we’ve all had moments like that: when we didn’t notice something that was obvious—precisely because it was obvious.\n\nVirgil always felt that way about the Clinton Global Initiative: It was an obvious conspiracy staring us in the face. Surely we can all remember that giant international influence-peddling system that has mostly faded away, now that Bill and Hillary don’t have much influence to peddle. Yet for years, plutocrats and miscreants would pay millions to cadge some of the Clintons’ celebrity—and hope, too, of course, that President Hillary Clinton would deliver for them in the future.\n\nIt was all happening right before our eyes, on a swanky stage in Manhattan, and yet most reporters and chatterers thought that what the Clintons were doing was great. (And yes, no doubt, plenty was happening offstage, and that was not so great; too bad so few were interested.)\n\nHunter in Plain Sight\n\nToday, Virgil feels similarly about the case of Hunter Biden, son of presidential candidate Joe Biden; it’s been beneath the nose of the whole world. And yet, of course, that’s the one place where the Main Stream Media hasn’t wished to look, or at least not looked long enough to reach some obvious conclusions.\n\nInstead, the MSM has been in an uproar over the way that President Trump and Rudy Giuliani have been pressing their argument against the Bidens. Indeed, every day—probably more like every hour—Trump & Giuliani are accused of some new bad thing. And yet in the meantime, Hunter Biden’s profitable relationships with Ukrainian and Chinese businesses are mostly treated like old news, non-news, or barely news at all.\n\nWhy was Hunter a “success” in international business? It’s never required the brain of a great detective to figure that one out.\n\nInterestingly, the basic outlines of Hunter’s international dealings have been out there for many years—beneath the nose of the whole world, as Poe might say—because at least some reporters were nevertheless curious.\n\nIn 2012 Fox Business News’ Charles Gasparino was writing unflatteringly about Hunter’s many business dealings. And in 2014, The Daily Beast’s Lloyd Green zeroed in on the younger Biden’s doings with the Ukrainian energy firm Burisma.\n\nThen, in 2018, an investigative digger by the name of Peter Schweizer published a long story in The New York Post, further detailing Hunter’s many dealings with China. (We’ll come back to Schweizer in a moment.)\n\nStill, the Hunter story wasn’t important during the Obama presidency, perhaps because reporters and their editors didn’t want to do anything to besmirch the Obama-Biden administration. And maybe, too, it was because in those years, it was common enough that well-connected folks did international deals of that kind.\n\nSo okay, the younger Biden was up to his armpits in international business, but so were a lot of politically connected people, including Mitt Romney, John Kerry, and Jeb Bush. And then, when Trump came into office, well, who had time to worry about anything other than going after … him?\n\nSo that’s why the Biden information just sat there, even after it was converted into Google-able news stories. Hunter, a man with no obvious skills and a distinctly checkered history, was suddenly doing very well in international business, specifically, in Ukraine and China. The facts were right beneath our nose, hiding in plain sight, and yet the agenda-setting news outlets—the ones with the power to connect the dots of isolated stories—never saw fit to connect them into a Biden narrative. It’s the existence, or not, of a narrative that determines whether a given story ever gains airspeed.\n\nIndeed, the Hunter story didn’t take off until last month, in the days after September 18, when The Washington Post first printed the allegations of the so-called whistleblower who accused the American president of muscling Ukraine’s president to dish dirt on the Biden family.\n\nSoon thereafter, Hunter was in the news, big time; no wonder Giuliani took to calling himself “the real whistleblower”—blowing the whistle, that is, on the Bidens.\n\nYet now that the Hunter story has taken off, there’s pushback from the MSM. It’s no longer possible for journos to ignore the facts about Hunter, but it might be possible to put these facts in some sort of anti-Trump context.\n\nFor example, here’s a blaring October 2 headline atop Bloomberg News: “Trump’s Impeachment Saga Stems From a Political Hit Job Gone Bad.” So from that headline, we’re supposed to summon up mental images of hired killers and the bad people who hire them — you know, baddies such as Trump.\n\nSo let Bloomberg reporter Joshua Green lay out his argument:\n\nThe irony of President Trump’s sudden impeachment peril is that it’s the unintended result of an effort to help him: a political hit job aimed at a likely opponent (Joe Biden) and funded by a major right-wing donor (Rebekah Mercer) that Trump and his lawyer (Rudy Giuliani) impatiently hijacked, with consequences that could turn out to be disastrous for them.\n\nOkay, so maybe we need to unpack that a bit. The assertion about the “major right-wing donor,” Rebekah Mercer, refers to Mercer’s role as chairwoman of the Government Accountability Institute (GAI). The president of GAI is Peter Schweizer, the investigative digger whom we met earlier. Schweizer, in fact, is the author of eight books of history and muckraking, the best known of which is probably Clinton Cash: The Untold Story of How and Why Foreign Governments and Businesses Helped Make Bill and Hillary Rich; published in 2015, it had a substantial impact on the 2016 presidential campaign.\n\nIn 2018, Schweizer published the book that’s at issue in the Biden case, Secret Empires: How the American Political Class Hides Corruption and Enriches Family and Friends. As the title suggests, Schweizer’s critique is far-reaching, ranging from the family of Joe Biden to the family of John Kerry and Theresa Heinz, whose offspring went into business with Hunter. Also mentioned, and not so nicely, in Schweizer’s book was Sen. Mitch McConnell, as well as various well-paid hangers-on with the Obama administration. As the title emphasizes, Schweizer’s target was the bipartisan “political class,” as in, you know, swamp dwellers. There are many of them lurking around, in both parties.\n\nNowadays, if one wants to attack Schweizer, one can do so. However, in the process, it’s hard not to get into the substance of Schweizer’s book, including the seamy details about the Bidens. Let’s consider the concession made by Bloomberg’s Green:\n\nNor was it difficult for GAI to turn up examples of ethically questionable behavior by Biden’s family members and publish the information in Secret Empires. . . . To all appearances, Hunter Biden was cashing in on the family name in a way that’s common among political families in both parties.\n\nWe can pause right here and emphasize that these are the words of Green, not Schweizer: ethically questionable behavior by Biden’s family members . . . cashing in on the family name.\n\nIn other words, we can see that for Schweizer and GAI, the feeling must be at least a little bit of mission accomplished: Even some of the MSM concedes that Hunter is a swamp thing. So the situation today doesn’t at all justify that blazing Bloomberg headline, “Political Hit Job Gone Bad.” It would be better, and more accurate, to use the header, “Diggers Raise Questions that Reporters, Too, Should be Asking.”\n\nMoreover, as Green observes, Schweizer is actually rather modest in his claims about Hunter and Joe. That might change, to be sure, if Schweizer had subpoena power, but he doesn’t. So all he can do is assemble the facts as he can uncover them:\n\nAs with Clinton Cash, Schweizer didn’t allege in his book on the Bidens that any laws were broken. Instead, his reporting laid out a suggestive timeline that led readers to the inescapable conclusion that what had transpired reeked of influence-peddling and moral, if not legal, corruption—the sort of self-dealing voters despise.\n\nAs they say about swampy Washington, the scandal isn’t what’s illegal—the real scandal is what’s legal. That is, what’s assumed to be okay in Powertown, just as a matter of course.\n\nSo we can let David Marcus, writing for The Federalist, sum up what we know about Hunter and Ukraine:\n\nWe know that Hunter Biden took an extremely lucrative job from a Ukrainian energy concern for which he had no relevant experience. Is it really so strange for Americans to want to know if what he was really offering was access to the vice president?\n\nAnd about Hunter and China:\n\nLikewise we know that Hunter Biden traveled to China with his father on Air Force Two in 2013, and that during that trip he met with a Chinese banker, and 10 days after the trip the Chinese granted a license for a new fund on which Hunter was a board member.\n\nMarcus further adds:\n\nPerhaps these are just coincidences. Perhaps Hunter Biden possesses some vast expertise in business that he honed while snorting cocaine during his time in the Navy. But it does not seem completely unreasonable to imagine his proximity to the White House might have played a role in his hiring.\n\nSo there it is. Maybe it’s all legal. But if it is all legal—then that’s the real scandal. In any case, soon enough, the voters might well be able to pass judgement on the Bidens.\n\nThere’s More!\n\nYet even if some reporters, such as Green, are now conceding the basic reality of the Bidens, not all pressies are willing to do so—or at least, they are vastly more eager, instead, to pound Trump.\n\nFor instance, The Washington Post jumped in with this headline: “Trump’s false claims about Hunter Biden’s China dealings.” The Post pointed to reports that Hunter had helped arrange a handshake between his father and a Chinese businessman (possible other details, such as a photograph, or words exchanged, were not mentioned). And then, 12 days later, Hunter joined the board of that businessman’s company. Does that seem a little bit interesting?\n\nYet a lawyer for Hunter assured the Post that there was nothing to see: “To date, Mr. Biden has not received any return or compensation on account of this investment or his position on the board of directors.” Such legalese might be good enough for the Post and most journalists, but the rest of us can spot the possible loopholes: Did Hunter possibly receive consulting fees, bonuses, equity stakes—or free drugs?\n\nIn the meantime, GAI’s Schweizer keeps pressing for answers; as he said on Fox News on October 3:\n\nThe bottom line is, at the end of the day, this needs to be investigated. What we know for a fact . . . is in Ukraine and in China – the only two countries where Joe Biden was the point person on U.S. foreign policy – his son cashed in big time in both countries. Why that in and of itself should not be investigated, I for the life of me can’t understand. And do we want a country where political leaders, Republicans, Democrats, whoever, are cashing in that way? I don’t think so.\n\nIn fact, others, too, are waiting for answers. For instance, here’s conservative activist Phil Kerpen, tweeting on October 4:\n\nStill waiting for the non-corrupt theory of why Hunter Biden got paid about $3 million by Burisma to sit on its board while his dad was VP.\n\nYes, we’re all still waiting for a good explanation for that not-so-mysterious mystery. In the meantime, there’s both bad news and good news:\n\nThe bad news is that the swampy reality of the Bidens is there beneath our nose.\n\nThe good news is that it’s not quite so hidden anymore.", "description": "The bad news is that the swampy reality of the Bidens is there beneath our nose. The good news is that it’s not quite so hidden anymore.", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/Joe-and-Hunter-Biden-Virgil-640x335.jpg", "published_at": "2019-10-05"}