{"pub": "politico", "url": "https://politico.eu/article/in-brexit-talks-belfast-loyalists-see-risk-of-return-to-violence", "downloaded_at": "2019-09-23 04:26:48.217462+00:00", "title": "In Brexit talks, Belfast loyalists see risk of return to violence", "language": "en", "text": "BELFAST — For the three former members of a Northern Irish loyalist paramilitary group, the stakes in the Brexit negotiations could hardly be higher. Handled badly, they say, Britain’s effort to leave the European Union could threaten the island’s fragile peace.\n\nJohn, Harry and Tom — curt, graying men now in their 60s or older — each spent time in prison for their role in the conflict that divided Northern Ireland between the republicans who sought a united Ireland and the loyalists who wanted the region to remain part of the U.K.\n\nOnce members of the Ulster Volunteer Force — one of the two main loyalist paramilitary groups that carried out a three-decade-long campaign of bombing and shooting — they’re speaking in the offices of a charity working to further the peace and help former combatants integrate back into society. Wary of public exposure as former combatants, the three agreed to speak only on the condition that their voices not be recorded and only their first names be published.\n\nLess than 120 meters away rises Belfast’s biggest “peace wall” — a towering barrier separating their community, the loyalist neighborhood Shankill, from an Irish republican area on the other side. More than 20 years after the 1998 Good Friday Agreement brought a formal end to the fighting, gates are still closed at night to prevent skirmishes between the two communities: On both sides, there's demand to keep the barriers in place so residents can feel safe.\n\nIn a conversation in which tensions were broken with flashes of black humor — often at Westminster's expense — the three men said they had supported the 1998 peace agreement that led the paramilitaries to gradually disarm. But they spoke of serious reservations about how it has worked out in practice. Tensions are rising, they said, warning of civil unrest and violence — depending what happens with Brexit.\n\n\"I was 20 when I joined the UVF,\" said John, the most senior of the three. \"If I was 20 now, I would certainly be looking for something to join.\"\n\nView from the Shankill\n\nThe area of Belfast where the three men have agreed to speak to POLITICO is one of the parts of Northern Ireland where the region’s divisions are most visibly stark. The streets around the offices where they are sitting are emblazoned with Union Flags, poppies, and tributes to victims of attacks by the nationalist Irish Republican Army. On the other side of the peace wall, the neighborhood is dominated by Irish tricolors, republican lilies and murals of hunger strikers.\n\nRecent months have seen an escalation of violence in Ireland by dissident republicans, with a spate of serious bomb attacks, the killing of a journalist and rioting. There are clear signs that those involved are young people who were born in peace time.\n\n\"I was 20 when I joined the UVF. If I was 20 now, I would certainly be looking for something to join.\" — former Ulster Volunteer Force member John\n\nOn the loyalist side of the sectarian divide, pro-British violent actors retain a strong role in communities in Northern Ireland, and while efforts to reduce violence at the interface between communities have been successful, locals describe rising tensions and fear a return to conflict that feels more likely than it has in two decades.\n\nBefore the peace agreement, the UVF was one of the two major paramilitary groups, which along with the Ulster Defence Association carried out shootings and bombings in Northern Ireland and the republic, mostly killing Catholic civilians.\n\nThey gradually disarmed after the peace deal, but remain banned as terrorist organizations by Britain. Membership of either group is a crime.\n\nNowadays, loyalist violence is largely directed inwards toward their own communities, often targeting young people who are perceived to be out of line. The Police Service of Northern Ireland attributes roughly 50 punishment beatings a year to loyalist groups, and a handful of punishment shootings. Some loyalist areas are in the worst pockets of deprivation in the U.K., and the appeal of paramilitarism is linked to lack of opportunities.\n\nHarry was at pains to distinguish the true paramilitaries of the past, who should have put down their weapons, from individuals who he says merely claim the brand to run “criminal gangs.” The three men act as mediators within the community and between the police and residents, encouraging locals to come to them with problems as a first point of call.\n\nThey described their work as struggling to keep a lid on grassroots anger. \"Loyalists are not getting the credit for their work in the community,\" said Harry. \"Obviously there are still paramilitaries out there, and they don't get credit for what they do to prevent things being much worse.\"\n\n\"They're there because the people want them there,\" added John.\n\nBrexit divide\n\nAt the heart of the rising tensions, they said, is Brexit.\n\nMembership of the EU was not a salient issue locally before the referendum, but the vote accentuated yet another underlying division.\n\nNorthern Ireland voted to remain by a majority of 56 percent, but the result was sharply split along sectarian lines. Brexit had broad support among unionists and was almost uniformly rejected by nationalists. The debate since has inflamed acrimony between the sides as they find themselves holding opposite views on an intractable question that both see as having extremely high stakes.\n\nTo make matters worse, the referendum took place at a time when cooperation was already under strain. Since January 2017, the Belfast governing assembly of Stormont has collapsed, with the two sides unable to reach an agreement to govern together as required by the peace deal.\n\nJohn, Tom and Harry described events as building on lingering dissatisfaction they felt with the way the peace process has developed since the Good Friday Agreement.\n\nThey see moves to include aspects of Irish identity and culture in Northern Ireland — for example, the nationalist party Sinn Féin's campaign to grant official status to the Irish language — as a threat to the region’s place in the U.K. and an attack on British identity.\n\nThey cast historical inquiries and quests for justice as attempts to rewrite a history in which they saw themselves as acting in defense of their communities, and to assist the police and British Army in their campaign against the IRA.\n\n\"We voted in support of the Good Friday Agreement,” said Harry, but he indicated that he’s not sure he would do so again.\n\n“I think if there was a rerun of the referendum [on the peace deal] now it would be defeated,\" he said. \"I think the unionists will see that they've been sold a pup.\"\n\nJohn, Tom and Harry described events as building on lingering dissatisfaction they felt with the way the peace process has developed since the Good Friday Agreement.\n\nTom said loyalists have been aggravated by calls by nationalists for a referendum on the reunification of Ireland, as polls have indicated an uptick in support for the idea since Brexit.\n\nLoyalists agreed to the peace deal on the understanding it would end discussion of the matter, he said: \"It was sold to the two communities differently. To unionists it was a settlement, to nationalists it was provisional.\"\n\nThe peace deal, he added, now seems to him as beginning a process that only had unity as its final conclusion — a view held by those long opposed to the agreement.\n\nBackstop pressure\n\nUnlike John and Harry, who voted for Brexit out of anger at the establishment and dislike of immigration and the EU, Tom voted Remain.\n\nHe foresaw that the issue could disturb the gentle acquiescence that had been growing in wider society regarding the question of Northern Ireland's constitutional status.\n\n\"I had a notion that this would cause constitutional issues,\" Tom said. \"We've come through a difficult period in Northern Ireland.”\n\n“Probably the last thing we needed was Brexit,” he added.\n\nIt certainly doesn’t help that the negotiations between the U.K. and the EU have got stuck on disagreements over the so-called Irish backstop, an effort to prevent the return of a hard border between Northern Ireland and the Republic of Ireland.\n\nWhile some loyalists would welcome a visible border as a victory against nationalists, most see it something that would be deeply impractical — and destabilizing.\n\n\"Nobody in their right mind wants a no-deal,\" said Harry. \"But there would be some what we call rednecks out there who want it, and even want a border.\"\n\n\"Probably the last thing we needed was Brexit\" — former Ulster Volunteer Force member Tom\n\nThe trouble with the backstop is that it could symbolize a separation between Northern Ireland and the rest of the U.K. — especially if avoiding a hard border on Ireland requires further regulatory or customs checks for goods traveling to and from the U.K.\n\nConceived as a technocratic solution, it was described as a threat to the union by Theresa May when she was prime minister and as amounting to \"annexation\" of Northern Ireland by the EU by Arlene Foster, leader of the region’s hardline Democratic Unionist Party.\n\nPolling indicates the backstop would be accepted by a majority in Northern Ireland, but as with Brexit, views on it are sharply split along sectarian lines, with a majority of unionists against it.\n\nIf the government accepts the backstop, it would amount to Britain \"throwing us under a bus,” said John.\n\nHe interpreted recent reports of possible investment in Northern Ireland with a bridge to Scotland or a contract for the struggling shipyard Harland and Wolff as a \"warning sign\" that London is buttering up loyalists for betrayal.\n\nIn a sign of how Brexit has split society along sectarian lines on the issue of EU membership, EU flags have begun to be included on the top of loyalist bonfires, alongside other opposed symbols like the Irish tricolor.\n\nFlag protests\n\nThe extent to which Brexit has become caught up in existing tensions can be seen in the “flag protests” — sporadic demonstrations by loyalists in Northern Ireland.\n\nThey began in 2012, when a sudden and unforeseen riot broke out at Belfast City Hall after councilors voted to reduce the number days on which the Union Flag is flown from 365 to 18, in line with British government guidelines.\n\nIt set off 15 weeks of wildcat unrest in which vehicles were burnt, roads were blocked, and constituency offices of the Alliance party, which had proposed the motion, were ransacked. The protests drew the interest of the British far right, which has been attempting to gain inroads in loyalist communities.\n\nJamie Bryson, a loyalist blogger and activist who rose to prominence during the flag protests, supported Brexit in the hope that it would destroy the Good Friday Agreement. He now supports a no-deal, because he thinks it would destroy the accord once and for all.\n\nBryson predicted mass unrest if anything that \"looks like a backstop, smells like a backstop\" is accepted, describing it as the most serious threat to the union since the outbreak of the Troubles in 1969.\n\n\"I think we'd be in uncharted territory,\" Bryson said. \"You would see a mass movement of unionists taking to the street in peaceful protest, but the problem with that is whenever a mass amount of people take to the streets that can end in violence.\"\n\n‘How things will end’\n\nSara Houston, a policy researcher and community worker familiar with loyalist areas of east Belfast — a flashpoint during the flag protests — agreed there is a growing disillusionment with the peace.\n\nA return to violence feels more likely than it ever had in her lifetime. \"I was only born in '89, so I didn’t grow up in the Troubles. This summer has felt seriously tense, especially in the relations between political parties,\" Houston said.\n\n\"I don’t think they’re aware of how much that stirs people up on the ground. There's a risk that loyalist paramilitaries will start to take to the streets.\"\n\nFew think that there could be a full repeat of the worst-case scenario: a reignition of the cycles of retaliatory violence that consumed Northern Ireland in the 1970s and '80s. Society has changed significantly, and the paramilitaries are very far from having the men and power they once had.\n\n\"This summer has felt seriously tense, especially in the relations between political parties\" — policy researcher and community worker Sara Houston\n\nBut the former paramilitary combatants predicted this could change in an instant, if the flames of Brexit came in contact with the right ingredients on the ground. \"If the young people had a charismatic leader, it would make the flag protests look like a picnic,\" said Harry.\n\nThe major worry is the increasingly active dissident republicans, and the diffuse but watchful loyalists, coming into conflict — which could even happen by accident.\n\n\"I don't see a huge appetite for a return to violent conflict,” said Tom. “But if by accident, or design, republicans were to inflict harm on the unionist, loyalist community, well, the past tells us how things will end.\"\n\n\"Although I don't see any appetite towards conflict now, if you had told me when I was 17 or 18 that we were destined for 30 years of conflict I would have told you to eat your hat,” he added.\n\nThis article is part of POLITICO’s premium Brexit service for professionals: Brexit Pro. To test our expert policy coverage of the implications and next steps per industry, email pro@politico.eu for a complimentary trial.", "description": "Northern Ireland voted to remain by a majority of 56 percent, but the result was sharply split along sectarian lines.", "authors": ["Naomi O'Leary", "Annabelle Dickson", "Cristina Gallardo"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/09/belfast1_260x180-1200x628.jpg", "published_at": "2019-09-21"}