{"pub": "metro", "url": "https://metro.co.uk/2019/10/12/the-best-bluetooth-speaker-you-can-buy-just-got-a-lick-of-paint-10902382", "downloaded_at": "2019-10-12 15:14:57.306201+00:00", "title": "The best Bluetooth speaker you can buy just got a lick of paint", "language": "en", "text": "When it comes to Bluetooth speakers, you’d be forgiven for thinking the innovation train left the station a long time ago.\n\nBut Ultimate Ears, a division of Logitech, has consistently been putting out excellent products that boast excellent sound and a weatherproof rugged design.\n\nThere’s a fair degree of choice depending on how much you want to spend and how much sound you’re looking for. Over time, the company has introduced extra features, like Amazon’s Alexa or a wireless charging pad.\n\nBut the latest addition is a much more aesthetic one: you can customise the Boom 3 through the online myBoom Studio. It’s a bit like what Microsoft did with its Xbox Design Lab.\n\nYou can choose from thousands of different possibilities for the device by mixing up the different elements. For example, there’s the fabric that covers the cylindrical speaker as well as the famous +/- volume buttons. The hang loop and end caps of the speaker can also be customised in colours like ‘lagoon’, ‘denim’ and ‘seashell’.\n\nAdvertisement\n\nAdvertisement\n\nThere’s also the option to add a name, message or other kind of engraving to the rubberised spine running the length of the device.\n\nYou can be a little less ostentatious, if that’s your thing (Ultimate Ears)\n\nWe quite like this one (Ultimate Ears)\n\n‘Our speakers have always reflected the unique styles of our listeners, but up until today, our fans were limited with the colour and design options we made available to them,’ explained Charlotte Johs, general manager of Ultimate Ears.\n\n‘With myBOOM 3, we’ve created this enjoyable and unique design studio where music enthusiasts can show their creativity and give their favourite Ultimate Ears BOOM 3 speaker a truly personalised look and feel.’\n\nAlthough pricey, at £150, the myBoom 3 version offers impressive 360-degree sound and is rated IP67 water and dust resistant.\n\nThe UE Boom series are about the best Bluetooth speakers you can buy (Ultimate Ears)\n\nIf you have any other Boom speakers knocking around (like this year’s also-excellent Wonderboom 2), you can pair them up using the PartyUp feature – giving you battery powered stereo or surround sound.", "description": "Ultimate Ears excellent Boom 3 can now be customised", "authors": ["Jeff Parsons"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/MyBoom-3-867d_1570799625.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-12"}