{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/wales-vs-south-africa-team-news-latest-rugby-world-cup-2019-warren-gatland-semi-final-liam-williams-a9170346.html", "downloaded_at": "2019-10-25 03:27:46.329692+00:00", "title": "Rugby World Cup 2019: Warren Gatland names Wales starting XV for semi-final against South Africa", "language": "en", "text": "Wales will be without full-back Liam Williams for Sunday’s semi-final against South Africa after being ruled out for the remainder of the Rugby World Cup – though the return of Jonathan Davies at centre comes as a boost for Warren Gatland’s men.\n\nThe 28-year-old, who has won 62 caps and started all Wales’ World Cup games except one, picked up an ankle injury in an “accidental collision” during training this week.\n\n“His prognosis will be established in the forthcoming days,” the Welsh Rugby Union said in a statement on Friday morning. “No replacement has been called up at this stage.”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nLeigh Halfpenny, Wales’ third highest record points scorer, fills his place at full-back for the Yokohama showdown.\n\nWilliams joins Josh Navidi as Wales’ latest injury casualty, with the forward also unavailable for the rest of the tournament due to a hamstring injury. The No 8 is replaced by Ross Moriarty.\n\nMeanwhile, Davies is back in action after initial concerns over his fitness, bringing with him 79 caps’ worth of experience to the midfield.\n\nShape Created with Sketch. Wales vs South Africa: Warren Gatland's starting XV Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Wales vs South Africa: Warren Gatland's starting XV 1/15 Wyn Jones AFP via Getty Images 2/15 Ken Owens AFP via Getty Images 3/15 Tomas Francis AFP via Getty Images 4/15 Jake Ball Getty Images 5/15 Alun Wyn Jones Getty Images 6/15 Aaron Wainwright AFP via Getty Images 7/15 Justin Tipuric Getty Images 8/15 Ross Moriarty Getty Images 9/15 Gareth Davies AFP via Getty Images 10/15 Dan Biggar AFP via Getty Images 11/15 Josh Adams AFP via Getty Images 12/15 Hadleigh Parkes AFP via Getty Images 13/15 Jonathan Davies AFP via Getty Images 14/15 George North Getty Images 15/15 Leigh Halfpenny PA 1/15 Wyn Jones AFP via Getty Images 2/15 Ken Owens AFP via Getty Images 3/15 Tomas Francis AFP via Getty Images 4/15 Jake Ball Getty Images 5/15 Alun Wyn Jones Getty Images 6/15 Aaron Wainwright AFP via Getty Images 7/15 Justin Tipuric Getty Images 8/15 Ross Moriarty Getty Images 9/15 Gareth Davies AFP via Getty Images 10/15 Dan Biggar AFP via Getty Images 11/15 Josh Adams AFP via Getty Images 12/15 Hadleigh Parkes AFP via Getty Images 13/15 Jonathan Davies AFP via Getty Images 14/15 George North Getty Images 15/15 Leigh Halfpenny PA\n\nThe 31-year-old missed the quarter-final victory over France because of a knee problem suffered in the Pool D victory over Fiji, but the Scarlets man returns to replace Owen Watkin, partnering Hadleigh Parkes in the centre.\n\nElsewhere, scrum-half Gareth Davies will win his 50th cap, lining up alongside Dan Biggar at half-back.\n\nGatland retains the same front-five who have served him well at the tournament, with skipper Alun Wyn Jones making his 142nd Test appearance for Wales.\n\nThat puts him level with Italy captain Sergio Parisse on international rugby's all-time appearance chart, just six Tests behind New Zealand World Cup-winning skipper Richie McCaw.\n\nWales squad\n\nStarting XV: 15. Leigh Halfpenny (Scarlets) (84 Caps), 14. George North (Ospreys) (90 Caps), 13. Jonathan Davies (Scarlets) (79 Caps), 12. Hadleigh Parkes (Scarlets) (23 Caps), 11. Josh Adams (Cardiff Blues) (19 Caps), 10. Dan Biggar (Northampton Saints) (77 Caps), 9. Gareth Davies (Scarlets) (49 Caps), 1. Wyn Jones (Scarlets) (20 Caps), 2. Ken Owens (Scarlets) (71 Caps), 3. Tomas Francis (Exeter Chiefs) (47 Caps), 4. Jake Ball (Scarlets) (40 Caps), 5. Alun Wyn Jones (Ospreys) (132 Caps) (CAPT), 6. Aaron Wainwright (Dragons) (17 Caps), 7. Justin Tipuric (Ospreys) (70 Caps), 8. Ross Moriarty (Dragons) (39 Caps).\n\nReplacements: Elliot Dee (Dragons) (27 Caps), 17. Rhys Carre (Saracens) (4 Caps)18. Dillon Lewis (Cardiff Blues) (20 Caps)19. Adam Beard (Ospreys) (18 Caps)20. Aaron Shingler (Scarlets) (24 Caps)21. Tomos Williams (Cardiff Blues) (14 Caps)22. Rhys Patchell (Scarlets) (17 Caps)23. Owen Watkin (Ospreys) (20 Caps).", "description": "Wales will be without full-back Liam Williams for Sunday’s semi-final against South Africa after being ruled out for the remainder of the Rugby World Cup – though the return of Jonathan Davies at centre comes as a boost for Warren Gatland’s men. The 28-year-old, who has won 62 caps and started all Wales’ World Cup games except one, picked up an ankle injury in an “accidental", "authors": ["Samuel Lovett"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/25/02/liam-williams.jpg", "published_at": "2019-10-25"}