{"pub": "fox", "url": "https://foxnews.com/us/nearly-naked-man-recorded-trying-to-force-his-way-into-school-bus-on-california-freeway-video", "downloaded_at": "2019-09-18 05:10:26.628253+00:00", "title": "Video shows nearly naked man trying to force his way into school bus on California freeway", "language": "en", "text": "A nearly naked man was recorded on video early Tuesday running after a school bus in the middle of a California freeway and trying to force his way in.\n\nThe bizarre incident took place on Interstate 5 in Newhall, about an hour’s drive north of Los Angeles. The unidentified man could be seen pounding on the bus windows as it sat in bumper-to-bumper traffic.\n\n“The guy started getting closer and closer,” the driver later told Los Angeles’ Fox 11. “I have no idea why he approached us. Everything was locked because we were driving. We never opened the door.”\n\nCALIFORNIA MAN WARNS OF FAKE MASS SHOOTING AT COUNTY FAIR SO HE WOULDN'T HAVE TO GO WITH PARENTS, POLICE SAY\n\nThe bus had just dropped students off at school and was carrying other drivers heading back to the bus yard, according to the station.\n\nThe freeway was briefly shut down while authorities detained the suspect, officials said.\n\nShortly before the freeway incident, the suspect was captured on surveillance video breaking into the Newhall Church of Nazarene.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe church’s pastor, Josh Johnson, told Fox 11 the suspect was “out of his mind” and yelling. He said the suspect vandalized church property before fleeing the scene and running onto the interstate.\n\nThe suspect is charged with one count of felony vandalism, Fox 11 reported. He reportedly has a past conviction for attempted carjacking.", "description": "A nearly naked man was recorded on video early Tuesday running after a school bus in the middle of a California freeway and trying to force his way in.", "authors": ["Bradford Betz", "Bradford Betz Is An Editor For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Newhall.jpg", "published_at": "2019-09-17"}