{"pub": "nytimes", "url": "https://nytimes.com/2019/09/11/opinion/democratic-debate.html", "downloaded_at": "2019-09-12 07:19:01.251699+00:00", "title": "Opinion | 10 Candidates, No Weather Maps", "language": "en", "text": "There’s a popular presumption that Biden needs to perform at least decently in these events if he wants to win the nomination. But having trouble handling Senator Warren in verbal combat is way different from being able to hold your own against Donald Trump. Particularly when the subject gets to whether a president should make up his own weather maps.\n\nHow much of the audience will be thinking about age? Biden, as the whole world knows, will soon turn 77. And Sanders is 78. Warren is 70, but she campaigns like a maniac — her record for posing for selfies with her fans has probably passed 45,000 by now.\n\nBiden is taking things fairly easy, in a world where hitting 13 events in three weeks is sort of like goofing off. Still, if he can stand up on the stage for three hours trying to look both genial and hard-charging, that’s a pretty good sign that his age doesn’t matter.\n\nOr at least doesn’t matter above all else. There are a few troubling precedents. One of the presidents who was oldest at the time of his inauguration, William Henry Harrison, died after a month in office. And the very oldest, Donald Trump, has been known to forget which country his father was born in.\n\nMeanwhile, I’m betting Kamala Harris, 54, will try to vie with Pete Buttigieg, 37, in an appeal to the youth vote. Only saying that because she just sent out an anti-Trump fund-raising email with the subject line “This dude’s gotta go.”\n\nIt’s sometimes a little hard to keep track of the actual issues when everybody’s vying to be youthful/likable/powerful/memorable/not-disaster-prone. Warren and Biden’s history of fighting over financial law will surely surface. They tangled in 2005 when credit companies wanted to make it harder for average Americans to declare bankruptcy. She sided with average Americans and he sided with, um, the banks. Which of them do you think will try to bring that up?\n\nHappy to report there will no longer be any questions in which everybody has to raise a hand. (“Do you think a mass murderer who once assaulted a beloved guard who was the sole support of 14 grandchildren should be allowed to vote? Yes or no?”)", "description": "How many Democrats does it take to fill a campaign? It’s debatable.", "authors": ["Gail Collins"], "top_image": "https://static01.nyt.com/images/2019/09/11/opinion/11collins2/11collins2-facebookJumbo.jpg", "published_at": "2019-09-11"}