{"pub": "businessinsider", "url": "https://businessinsider.com/iran-says-british-oil-tanker-could-be-released-soon-2019-9", "downloaded_at": "2019-09-08 23:27:06.752249+00:00", "title": "Iran says it could release a seized British oil tanker soon", "language": "en", "text": "DUBAI (Reuters) - The British-flagged oil tanker seized by Iran could be released after the imminent completion of legal proceedings against the tanker, Iranian state television reported on Sunday.\n\nIran seized the British tanker near the Strait of Hormuz for alleged marine violations two weeks after British forces detained an Iranian tanker near Gibraltar, accusing it of shipping oil to Syria in violation of European Union sanctions.\n\n\"I hope the procedures will be completed soon and this tanker will be released,\" Foreign Ministry spokesman Abbas Mousavi told the television station.\n\nRead more: Iran was able to capture a British oil tanker because it only gave the Royal Navy 1 hour's notice to escort it, rather than 24, former UK Defence Secretary says\n\nThe Iranian tanker detained by British forces was later released and Iran has since freed seven of the 23 crew members of the Swedish-owned British-flagged Stena Impero tanker - one Russian, one Latvian and five Indian nationals .\n\nA Russian embassy official in Tehran has said that the remaining 16 crew members will remain on the ship \"until the fate of the tanker itself is decided\".\n\nMousavi was quoted by state news agency IRNA as saying that the released Iranian tanker has delivered its oil after docking somewhere in the Mediterranean region.\n\nThe tanker Adrian Darya 1, which went dark off Syria last week, has been photographed by satellite off the Syrian port of Tartus. The tanker was detained in Gibraltar for allegedly breaking sanctions on Syria.\n\nIran said in late August that it had sold the oil on the tanker and the purchaser would decide the destination of the cargo.\n\n(Reporting by Dubai newsroom; Editing by Andrew Cawthorne and David Goodman)", "description": "The British-flagged oil tanker seized by Iran could be released after the imminent completion of legal proceedings against the tanker.", "authors": [], "top_image": "https://amp.businessinsider.com/images/5d7529592e22af37e7585122-1136-568.jpg", "published_at": "2019-09-08"}