{"pub": "townhall", "title": "Several Colorado groups are rallying and joining forces in support .09/02/2019 3:16:28AM EST.", "url": "https://townhall.com/watchdog/colorado/2017/09/18/colorado-groups-beat-drum-federal-tax-reform-n10949", "language": "en", "published_at": "2017-09-18", "downloaded_at": "2019-09-02 07:16:28.911471+00:00", "text": "Several Colorado groups are rallying and joining forces in support of GOP proposals to simplify and reform the nation’s tax system, which they see as a drag on both economic growth and a more prosperous middle class.\n\nBut for others in the state, advancing certain tax reforms seems problematic, especially when Republicans have offered few concrete details about their proposals.\n\nAmericans for Prosperity-Colorado recently rallied more than 100 supporters in Denver during an event that featured Colorado Rep. Ken Buck, R-Windsor, as keynote speaker. The organization has chapters in 36 states and has garnered financial support from billionaires Charles and David Koch.\n\n“We are very interested in seeing loopholes closed that seem to only benefit the well-connected,” Tamra Farah, deputy state director of AFP-Colorado, told Watchdog.org.\n\nThe most recent major tax reform proposals passed by Congress and signed into law resulted in tax cuts amounting to roughly $2,500 per capita per year, Farah said. Such changes can go a long way in helping the average American to purchase groceries or find better housing, she said.\n\nThe hours Americans spend preparing taxes also need to be slashed, according to Farah.\n\n“Even that is a hindrance to the economy,” she said.\n\nThe nation has the highest corporate income tax compared to other developed nations, a recent White House press release said. That ultimately hurts the middle class through reduced economic growth and fewer added jobs, according to Farah.\n\n“If corporations are paying an excessive amount in taxes, they are not able to spend some of that money … on growing their businesses,” she said.\n\nThe Colorado Business Roundtable has also joined the tax reform bandwagon. The business advocacy group has launched a tax reform coalition with the state’s Farm Bureau, manufacturers, chambers of commerce and small businesses, according to its president, Jeff Wasden.\n\n“You’re starting to see urgency around tax reform,” Wasden told Watchdog.org. “This president has learned lessons from the health care debacle.”\n\nWasden, who expects tax reform to pass this year, noted that President Donald Trump has already visited North Dakota and Missouri to make speeches on tax reform and has cut a deal with congressional Democrats Nancy Pelosi and Charles Schumer on the federal debt ceiling.\n\nTrump is setting the stage and building the coalitions needed to make tax reform possible, he said.\n\n“Congress and the White House understand this is an important time in our nation’s history,” Wasden said, arguing that it’s been three decades since the last comprehensive review of the U.S. tax system was accomplished.\n\nThe nitty-gritty of federal tax reform must focus on a fairer, simpler code, a competitive corporate income tax rate, tax relief for average Americans and efforts to encourage corporations to take money that is now parked overseas and invest it in the American economy, he said.\n\nA competitive corporate income tax might be 25 percent, according to Wasden, down from the current federal rate of 35 percent.\n\n“It’s placing a $262 billion burden on our economy,” he said of the existing tax code. Over six billion hours are spent each year to comply with the current tax regulations, Wasden said, citing the Internal Revenue Service’s Taxpayer Advocate Service.\n\nA fairer tax code would go a long ways to benefit the economy in Colorado, where nearly 900 companies operate internationally and generated $149 billion for the economy in 2013, he said.\n\nMichael Waggoner, a tax expert and University of Colorado, Boulder, law professor, agrees that a high corporate tax rate can discourage investment in the United States, but corporate profits are at record levels today — at the same time that wages for the average American have been flat-lining for decades, he said.\n\n“U.S. corporations are so awash in cash that it is hard to see how they need any more cash to be able to hire and invest,” Waggoner said in an email to Watchdog.org.\n\nOne solution could be to cut corporate tax rates while eliminating business deductions, which would produce revenue neutrality and a simpler system, he said. But such a change would create winners and losers within the economy, setting up a political fight as losers resist the proposed changes, according to Waggoner.\n\nIn addition, creating tax incentives to encourage companies to invest may not be as significant as other issues facing businesses, so the incentives may end up being wasted, he said.\n\nAnother problem involves businesses choosing between spending on equipment or labor to expand their operations. The tax system currently encourages business to spend on capital projects and equipment, while hiring people burdens businesses with liabilities, Waggoner said, including Social Security taxes, unemployment compensation, retirement plans and health insurance.\n\nAs a result, “there will be fewer jobs, and fewer jobs mean less competition for employees, which means lower wages,” he said.", "description": "Several Colorado groups are rallying and joining forces in support .09/02/2019 3:16:28AM EST.", "authors": ["Michael Carroll", "Beth Baumann"], "top_image": "https://media.townhall.com/_townhall/resources/images/thog.png"}