{"pub": "npr", "url": "https://npr.org/sections/health-shots/2019/09/27/765230011/u-s-justice-department-charges-35-people-in-fraudulent-genetic-testing-scheme", "downloaded_at": "2019-09-28 01:00:32.910636+00:00", "title": "U.S. Justice Department Charges 35 People In Fraudulent Genetic Testing Scheme", "language": "en", "text": "U.S. Justice Department Charges 35 People In Fraudulent Genetic Testing Scheme\n\nEnlarge this image toggle caption Al Drago/Bloomberg/Getty Images Al Drago/Bloomberg/Getty Images\n\nThe U.S. Justice Department announced a crackdown Friday on companies it says were selling and performing fraudulent genetic testing for cancer, bringing charges against 35 individuals associated with dozens of telemarketing companies and testing labs.\n\nThe federal investigation, called Operation Double Helix, targeted schemes that allegedly focused on people 65 and older. The schemes allegedly involved laboratories paying illegal kickbacks and bribes to medical professionals who were working with fraudulent telemarketers, in exchange for the referral of Medicare beneficiaries.\n\nAccording to the DOJ, the schemes cost the Medicare program more than $2 billion in unnecessary charges.\n\nAmong those charged were 10 medical professionals, including nine doctors.\n\n\"The elderly and disabled are being preyed upon,\" says Joe Beemsterboer, senior deputy chief of the fraud section in the criminal division of the DOJ.\n\nIt was one of the largest health care fraud schemes in U.S. history, Beemsterboer, says, and it worked on many levels — involving many players, including \"those collecting patient information, to those selling it, to those doctors corruptly prescribing these genetic tests, to the labs corruptly billing the Medicare program.\"\n\nAccording to Shimon Richmond, assistant Inspector General for investigations with the U.S. Department of Health and Human Services, this is how the alleged scheme worked: Telemarketing companies trolled elderly Medicare beneficiaries online, or called them on the phone or even sent people to approach beneficiaries face-to-face at health fairs, senior centers, low-income housing areas or religious institutions like churches and synagogues.\n\nSeniors were offered, at no cost to them, genetic testing to estimate their cancer risk or determine how well certain drugs would work for them. All they had to do, the elderly people were told, was provide their Medicare information, a copy of their driver's license and a bit of DNA collected from a swab of saliva from inside their cheek.\n\nThe sales pitch also included lots of aggressive scare tactics, Richmond says, such as telling patients that if they didn't have the testing done they could end up suffering from a variety of possibly fatal conditions.\n\nOnce recruiters got the information they wanted, they would try to get the patient's own health care provider to write a prescription for the test. If that didn't work, the recruiters asked one of their own cadre of doctors to write prescriptions for patients they didn't know.\n\n\"And these doctors, in many cases, have zero contact with the patient and no knowledge of their health care situation or needs,\" Richmond says.\n\nThe genetic test may have been offered free to such patients, but there was money to be made from Medicare reimbursement. Typically that payment – anywhere from $10,000 to $18,000 or more, Richmond says — would be split between the worker who recruited the patient, the doctor writing the prescription, the lab that did the test and the telemarketing company that organized the alleged scheme.\n\nOften, the labs didn't even send results to patients, Richmond says. And when they did there was no counselling or help interpreting the findings.\n\n\"So patients were left with a report that's meaningless to them and its certainly not providing them with any benefit in terms of their health care,\" says Richmond.\n\nThe testing could also financially harm the patient down the road, he adds. For example, if, in the future, the patient's legitimate doctor were to determine that the patient actually needs a genetic test for a certain condition, Medicare likely wouldn't cover it, citing an earlier payment.\n\nThe U.S. Department of Health and Human Services Office of Inspector General has previously issued a fraud alert for consumers in an effort to educate the public about such schemes.\n\nRichmond says beneficiaries who believe they may have been victimized by the schemes can call 1-800-HHS-TIPS or they can file a complaint online.\n\nIf convicted, the defendants arrested Friday could face decades in prison, Beemsterboer says.", "description": "Doctors, labworkers and telemarketers from around the U.S. were among those arrested in the investigation of a scheme that the DOJ alleges defrauded seniors and Medicare.", "authors": ["Patti Neighmond"], "top_image": "https://media.npr.org/assets/img/2019/09/27/doj-1_wide-3bb2d63630cc6898a71a8ff76cfe0d2c4690695d.jpg?s=1400", "published_at": "2019-09-27"}