{"pub": "indiatimes", "url": "https://indiatimes.com/trending/environment/jaguar-eats-plastic-bottle-paul-goldstein-pantanal-brazil-377735.html", "downloaded_at": "2019-10-13 18:35:51.107457+00:00", "title": "Image Of Jaguar Trying To Eat A Plastic Bottle Is Proof We've Destroyed Nature Beyond Repair", "language": "en", "text": "The war against plastic is ongoing. While we can still control its production and clean our beaches, we can hardly do anything to get all kinds of plastic out of oceans and other water bodies. Images of fishes choking to death inside plastic bags or seals getting their necks fatally stuck inside plastic Frisbees, have sadly become common.\n\nNow the images which show a wild jaguar taking interest in a discarded plastic bottle, captured by a British photographer, are going viral.\n\nPaul Goldstein\n\nPaul Goldstein, witnessed this disturbing scene in Pantanal, the world's largest tropical wetland, Brazil, only this week.\n\nThe three-year-old male jaguar is toying with a green plastic bottle; it almost seems it wants to bite into it, but thankfully it cannot.\n\nPaul Goldstein\n\nDon't Miss 323 SHARES 361 SHARES 2.8 K SHARES 348 SHARES\n\n“This bottle would have floated downstream during the wet season but it must have had some scent to attract this boy. Guiding a dozen people to see jaguars in their own vast wetland back yard is and always will be a thrill, but scenes like this are not,” Daily Mail quoted Paul as saying.\n\nHe further said that he hopes that the distressing image becomes the “poster child for plastic abuse and its hideous worldwide proliferation.”\n\nPaul Goldstein\n\n“I hope this image shocks people but more importantly I hope it stirs politicians into action as drastic plastic abuse has reached tipping point. Many people are incredibly conscious of this issue now, making huge steps to cut or eradicate their plastic intake, yet these worthy actions will only really matter when governments stop 'bottling brave decisions',” he said.\n\nLike we said, we would not be able to clear our oceans and all the water bodies of all the plastic that is already there, but we can take better, stricter care going forward.", "description": "The war against plastic is ongoing. While we can still control its production and clean our beaches, we can hardly do anything to get all kinds of plastic out of oceans and other water bodies. Images of fishes choking to death inside plastic bags or seals getting their necks fatally stuck inside plastic frisbees have sadly become common.", "authors": ["Shreya Chauhan"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/leopard_1570968706_800x420.jpg", "published_at": "2019-10-13"}