{"pub": "reuters", "title": "Peru to boost border security after stricter entry rule for Venezuelans", "url": "https://uk.reuters.com/article/uk-venezuela-migration-peru/peru-to-boost-border-security-after-stricter-entry-rule-for-venezuelans-idUKKCN1VN233?il=0", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:11:51.195697+00:00", "text": "LIMA (Reuters) - Peru plans to beef up security at its border with Ecuador to prevent illegal immigration, after stricter entry requirements for Venezuelans led to a 90% drop in legal crossings, a government official said on Monday.\n\nMore than 850,000 Venezuelans have fled their homeland for Peru in recent years, part of a mass exodus from the Caribbean nation as it faces a crippling economic crisis.\n\nBut in June, Peru started requiring Venezuelans who arrive to already have visas, part of stricter policies for Venezuelans in some South American nations.\n\n“The entry of Venezuelan migrants to our country has dropped dramatically and today it’s 90% less than what we saw in June,” Foreign Minister Nestor Popolizio told journalists.\n\nPopolizio said his ministry was working with the interior ministry and police to make sure Venezuelan migrants were not evading the new requirements by crossing illegally.\n\n“We’re engaged in a very direct coordination ... to ensure more protection all along our border and to avoid illegal entries,” Popolizio said.\n\nPopolizio said Peru was one of 11 countries in the region trying to coordinate their policies on handling immigration from Venezuela.\n\nAfter Peru started requiring visas of Venezuelans, Chile and Ecuador implemented similar measures. All three countries also now require Venezuelans to have passports, a document that is hard to obtain for the growing ranks of poor Venezuelans.", "description": "Peru plans to beef up security at its border with Ecuador to prevent illegal immigration, after stricter entry requirements for Venezuelans led to a 90% drop in legal crossings, a government official said on Monday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png"}