{"pub": "investingcom", "url": "https://fortune.com/2019/09/20/ripple-xrp-securities-lawsuit", "downloaded_at": "2019-09-20 08:16:47.501516+00:00", "title": "Ripple Asks to Toss Lawsuit Over Crypto Securities", "language": "en", "text": "The cryptocurrency company Ripple has asked a federal court to throw out a class action lawsuit in which investors allege it illegally sold unregistered securities.\n\nThe case is significant because it has the potential to resolve the contentious legal question of when cryptocurrencies should be classified as a security—and expose companies like Ripple to potentially massive liability.\n\nThe class action lawsuit, filed in Oakland, California, came about after various investors sued in 2018, claiming they lost money after Ripple induced them to buy XRP, a cryptocurrency that is integral to the company's business operations. The lawsuit seeks unspecified damages and a declaration that XRP is a security.\n\nIn seeking to dismiss the complaint, Ripple touches on the legal classification of XRP only briefly, stating federal regulators have concluded that it is a currency and a commodity rather than a security.\n\nInstead, Ripple's primary argument is that the case can't go forward because it was filed too late. The company invokes a law that shields companies from lawsuits related to the sale of unregistered securities once three years has passed.\n\nWhile the investors have characterized Ripple's initial sale of XRP as \"ongoing\" and \"never-ending,\" the company points to the investors' own complaint to point out that its first XRP sale took place in 2013. The lawsuit, therefore, falls well outside the three year window, Ripple claims.\n\nRipple's request for dismissal also alleges that the investors bought the XRP from the secondary market, rather than directly. Furthermore, the plaintiffs can't rely on California consumer laws in light of overriding federal securities rules, the document states.\n\nThe new filing comes at as Ripple and other cryptocurrency companies continue to press Congress for clearer rules on how to regulate digital money. If Ripple prevails on its procedural arguments, it's unlikely the judge will weigh in on defining the legal status of cryptocurrency.\n\nMeanwhile, the SEC has signaled that two cryptocurrencies—Bitcoin and Ethereum—are exempt from securities laws, but has left the status of others like XRP in limbo. At the same time, regulators in the U.K. last month suggested XRP is not a security.\n\nSince its inception, Ripple—which still owns the majority of the 100 billion XRP created in 2013—has evolved to offer cross-border remittance and payment services that claim to offer lower transaction costs by leveraging cryptocurrency. Earlier this year, the company announced it had taken a $50 million stake in money transmission service Moneygram.", "description": "A closely watched lawsuit could fizzle.", "authors": ["Lisa Marie Segarra", "Anne Fisher", "Robert Hackett", "Thomas Black"], "top_image": "https://content.fortune.com/wp-content/uploads/2018/04/gettyimages-910140810.jpg?resize=1200,600", "published_at": "2019-09-20"}