{"pub": "indiatimes", "url": "https://timesofindia.indiatimes.com/blogs/toi-editorials/blame-games-bengals-political-violence-deserves-all-round-condemnation-dont-reduce-it-to-tu-tu-main-main", "downloaded_at": "2019-10-13 23:33:40.489923+00:00", "title": "Blame games: Bengal’s political violence deserves all-round condemnation. Don’t reduce it to tu tu main main", "language": "en", "text": "With Bengal gripped by political violence that could be spiralling out of control political motives were quick to be attributed, unsurprisingly, to the gruesome murder of a young schoolteacher, his wife and son in Murshidabad. While the Sangh Parivar claims that the slain Bandhu Prakash Pal paid for his proximity to RSS, his maternal relatives and police are thinking otherwise.\n\nBJP makes an entirely fair point when it condemns the pathetic state of law and order in Bengal. But right wing potshots at liberals for not condemning the Murshidabad murders reduces the discourse around violence, which deserves condemnation no matter who commits it, to a “tu tu main main” farce. Few will stake their credibility in giving a political colour to a crime unless the evidence is compelling. Still Aparna Sen, one of the 49 letter writers recently accused of sedition, was quick to ask Bengal chief minister Mamata Banerjee for justice for Pal and protection of all Bengalis irrespective of political affiliation.\n\nLiberals speaking out on lynchings have raised the hackles of Hindutva proponents. It goes without saying that political violence of all categories must be condemned. But while there are often two sides to violence between political parties, surely lynchings are in a special category of their own. They involve, in effect, public executions by a crazed mob – assured of their immunity as they even circulate videos of their exploits – of hapless, non-political individuals who have no organized group to speak for them. Surely, no civilised society can permit this and liberals cannot be blamed for condemning such lynchings (the real question is why RSS chief Mohan Bhagwat proves so equivocal about them). Moreover, if as Indians we share the same democratic space there must be consensus against all political violence – shared by right, left and centre.", "description": "With Bengal gripped by political violence that could be spiralling out of control political motives were quick to be attributed, unsurprisingly, to the gruesome murder of a young schoolteacher, his wife and son in Murshidabad....", "authors": ["Toi Edit"], "top_image": "https://timesofindia.indiatimes.com/blogs/wp-content/uploads/2019/01/toiedit-logo.jpg", "published_at": "2019-10-13"}