{"pub": "metro", "url": "https://metro.co.uk/2019/10/16/sullis-act-proposed-tackle-cyber-bullying-fx-stars-suspected-suicide-10927013", "downloaded_at": "2019-10-16 08:30:23.535670+00:00", "title": "Sulli dead: Lawmakers propose bill Sulli's Act to tackle cyber bullying", "language": "en", "text": "Sulli died on Monday (Picture: Han Myung-Gu/WireImage)\n\nA bill in memory of Sulli is being proposed to tackle trolling online, following the K-pop star’s death.\n\nThe 25-year-old was found dead at her home in Seongnam on Monday, with police working off the assumption that she took her own life.\n\nSulli, who was a member of girl band f(x) from 2009 until 2015, struggled with receiving malicious comments online, and went on hiatus from f(x) in 2014 due to the abuse.\n\nAccording to Soompi, lawmakers in Korea are proposing the ‘Sulli Act’ to counter cruel comments online.\n\nThe bill was reportedly proposed by nine members of the National Assembly, and will be supported by 200 celebrities who were friends or colleagues of Sulli or those who have experienced such abuse themselves.\n\nSulli left f(x) for good in 2015 after experiencing online abuse (Picture: Han Myung-Gu/WireImage)\n\nThe report also claims that 100 organisations including the Global Culture & Art Solidarity, Federation of Korean Trade Unions, and Korean Government Employee’s Union will support the bill.\n\nAdvertisement\n\nAdvertisement\n\nSulli’s Act will be proposed officially in early December at the National Assembly.\n\nThis comes as the Korea Entertainment Management Association (CEMA) pledged to take action in ‘eradicating cyber violence’.\n\nA statement from the organisation read: ‘We express our deepest condolences for Sulli’s passing, and may she rest in peace.\n\n‘We are revealing our stance below with regard to our plan to prevent pop culture artists from being hurt. CEMA is an organisation that stands at the forefront of the advancement of Korean entertainment business and is working toward the wholesome and systematic advancement and establishment of such businesses, as well as the protection of employees and artists so that our popular culture can set down upright roots.\n\nSulli is suspected to have taken her own life (Picture: EPA/YONHAP)\n\nAs anonymous verbal attacks and malicious rumours are ever increasing to the point of becoming a serious societal issue, our organisation will no longer stand by as cyber terror in the form of malicious comments go well beyond what people can accept as public figures and begin to trample people’s dignity and hurt their friends and loved ones. We are announcing that we will be taking action.\n\n‘In June 2016, CEMA joined hands with the Korea Creative Content Agency (KOCCA) and artists in affiliated companies for the campaign to promote wholesome language on the internet. Unfortunately, though we started a movement for posting positive comments, the government was unable to sustain this, and we regret that the campaign ended as a single event. Our organisation has faced the unfortunate events surrounding Sulli, an artist in our member company SM Entertainment.\n\nAdvertisement\n\nAdvertisement\n\n‘We will no longer stand idly by, and we will do our best to eradicate cyber violence and malicious commenters. As other victims have done in the past, we will take the spreading of rumours and malicious comments and the crimes of the commenters very seriously, and we will no longer overlook these issues.’\n\nThey continued: ‘Regarding cyber terrorism, we will not stop because of apologies or expressions of reflection. Instead, we will root out malicious commenters, and we will make requests and petitions to investigative bodies and to the government so that the commenters can be strictly punished. Nothing will be forgiven, and strong action will be taken. Once again, we will be taking strong legal action on all fronts against malicious comments directed at pop culture business professionals and artists.\n\n‘Moreover, our organisation will stand at the forefront of societal action with regards to the eradication and prevention of cyber terror and malicious comments that defame and tarnish the reputation of pop culture artists. We will continue to stand at the forefront of the fostering of an upright society and the development of pop culture business.’\n\nSulli – real name Choi Jin-ri – had recently been an MC on the JTBC show Night of Hate Comments, which saw her read out the cruel comments that she received online.\n\nAdvertisement\n\nPolice have confirmed they do not suspect homicide in Sulli’s death, following the results of a preliminary autopsy.\n\nNeed support? Contact the Samaritans For emotional support you can call the Samaritans 24-hour helpline on 116 123, email jo@samaritans.org, visit a Samaritans branch in person or go to the Samaritans website.\n\nMORE: Sulli autopsy results released as police confirm no suspicion of homicide", "description": "Lawmakers in Korea have proposed a bill to tackle cyber bullying after the death of former f(x) star Sulli.", "authors": ["Emma Kelly"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1051834704_1571211223.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-16"}