{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/15/north-korea-and-south-korea-play-to-a-0-0-draw", "downloaded_at": "2019-10-15 15:05:43.153979+00:00", "title": "North Korea and South Korea play to a 0-0 draw", "language": "en", "text": "SEOUL, South Korea (AP) - North Korea and South Korea played to a 0-0 draw on Tuesday in an empty stadium in Pyongyang.\n\nThe World Cup qualifying match, the first competitive meeting between the two countries in North Korea, was not broadcast in South Korea.\n\nFIFA president Gianni Infantino was in Pyongyang but South Korean fans and media were denied visas for the match at Kim Il Sung Stadium, which seats about 50,000 spectators.\n\n“It is frustrating as we did not get the result we wanted,” South Korea coach Paulo Bento said. “We are still in first place and our target is to stay there.”\n\nSouth Korea, which has lost only once in 18 meetings with its neighbor, leads Group H with seven points from three games, ahead of North Korea on goal difference.\n\nThe two teams previously played in a friendly in Pyongyang in 1990.\n\nAlso, Australia maintained its perfect record with a 7-1 rout of Taiwan to stay at the top of Group B.\n\nAdam Taggart and Jackson Irvine both scored twice in the first half. Harry Souttar added two more after the break while Jamie Maclaren provided another.\n\nChina dropped its first points with a 0-0 draw in the Philippines, while Japan beat Tajikistan 3-0.\n\nThe winners of the eight five-team groups and the four-best second-place finishers will progress to the next round.\n\n___\n\nMore AP soccer: https://apnews.com/apf-Soccer and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "North Korea and South Korea played to a 0-0 draw on Tuesday in an empty stadium in Pyongyang.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/15/north_korea_koreas_world_cup_qualifier_66637_c0-167-4000-2500_s1200x700.jpg?309b4467e1f3a2a8ff765db9a91ebeb327dbd582", "published_at": "2019-10-15"}