{"pub": "cbc", "url": "https://cbc.ca/radio/podcastplaylist/sean-rameswaram-from-today-explained-on-his-favourite-podcasts-and-keeping-daily-news-creative-1.5321077", "downloaded_at": "2019-10-20 00:15:44.452592+00:00", "title": "CBC Radio", "language": "en", "text": "With today's rapidly changing news cycle, daily news podcasts make it easier to keep up with current affairs – especially for those on-the-go. While news consumption can sometimes feel draining, Vox's Today Explained is a creative, refreshing take on the daily news podcast format. Hosted by Sean Rameswaram, the podcast seamlessly guides listeners through current events as they happen, one episode at a time.\n\nBefore coming to Vox, Sean worked at WNYC where he created a pop culture podcast called Sideshow and worked on More Perfect. You may also remember him as a guest host on CBC's q and a former co-host on Podcast Playlist!\n\nThis week, Sean Rameswaram joins us as a guest curator. You can find his picks below.\n\nPodcasts featured this week:\n\nToday Explained – 'Old Town Road' may be one of the most popular songs in the world. But it's also the most controversial. Charlie Harding, co-host of the Switched on Pop podcast, joins Sean to figure out what makes a song \"count\" as country.\n\nRadiolab – \"John Scott was the professional hockey player that every fan loved to hate. A tough guy. A brawler. A goon. But when an impish pundit named Puck Daddy called on fans to vote for Scott to play alongside the world's greatest players in the NHL All-Star Game, Scott found himself facing off against fans, commentators, and the powers that be.\"\n\n10 Things That Scare Me – \"Chris Miller is an elementary school art teacher, and an artist, who lives in Milwaukee.\" He shares the 10 things he's most afraid of.\n\nThe Big One – If an earthquake were to strike, would you have a survival plan at the ready? Host Jacob Margolis and Producer Misha Euceph break down everything you need to know to survive.\n\nThe WALKING Podcast – \"Acclaimed journalist and author Jon Mooallem takes a walk through tranquil woodlands of the Pacific Northwest. No talking; just walking. Ambient. Pleasing. Unusual.\"\n\nWhat's your favourite podcast right now? Email, tweet us @PodcastPlaylist, or find us on Facebook.\n\nFor more great podcasts, check out CBC's podcast portal, subscribe in Apple Podcasts.", "description": "We're joined this week by Sean Rameswaram – the host of Vox's 'Today Explained' and former co-host of 'Podcast Playlist'. He shares his favourite podcasts.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5325116.1571345080!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/sean-rameswaram-headline.jpg", "published_at": "2019-10-18"}