{"pub": "investing.com", "title": "Euro Falls to Two-Year Low Amid Trade Concerns, Trump Ire", "url": "https://investing.com/news/forex-news/euro-falls-to-twoyear-low-amid-trade-concerns-trump-ire-1967664", "language": "en", "published_at": "2019-08-30", "downloaded_at": "2019-09-02 08:05:42.795626+00:00", "text": "(Bloomberg) -- The euro sank below $1.10 for the first time since May 2017 amid low liquidity on a late-summer trading session.\n\nThe common currency lost as much as 0.7% against the U.S. dollar, getting as low as $1.0976. The selloff picked up dramatically around 11 a.m. in New York as London closed for the month and after currency options expired.\n\nWith U.S. markets shut Monday for Labor Day, traders may be hesitant to hold big positions going into the long weekend. And that’s especially true with new U.S. tariffs on Chinese imports poised to take effect Sunday as the trade war between the world’s two largest economies rages on.\n\n“The direction of travel for world trade-industrial production is still heading south -- which is a euro negative,” Chris Turner, a foreign-exchange strategist at ING Groep (AS: ) NV, said in an email.\n\nThe euro remained weak in early afternoon trading, setting a fresh daily low of $1.0976 at 1:02 p.m. in New York.\n\nThe common currency tumbled even after U.S. President Donald Trump complained Friday, yet again, about the dollar’s strength and the euro’s weakness, which makes American exports less competitive. Meanwhile, Italian bonds fell as the country’s political crisis took another twist with officials clashing as they attempted to form a new ruling coalition.\n\nThis comes at a time when European Central Bank staff are working on a stimulus proposal for policy makers to consider at their Sept. 12 meeting, amid rising expectations the institution will cut interest rates further below zero and consider fresh asset purchases.\n\nTraders also executed stop orders Friday to sell the euro as it weakened, helping to accelerate the move lower.\n\nBrad Bechtel, a strategist at Jefferies, said there were stops through the prior August lows and then again through $1.1000. Traders execute stop orders at predetermined levels to curb losses.", "description": "Euro Falls to Two-Year Low Amid Trade Concerns, Trump Ire", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/pic36d3bbf4f39d0ee648732f555635d0de.jpg"}