{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/gen-x-least-likely-share-financial-details-with-spouse", "downloaded_at": "2019-10-27 00:26:42.703892+00:00", "title": "Gen Xers might be stressed, broke, and in debt, but they're the least likely to talk to their spouse about it", "language": "en", "text": "A majority of couples have shared their personal financial details, like how much they earn or have saved, with their partner or spouse, according to a survey from Insider and Morning Consult.\n\nHowever, about 18% of Gen Xers say that they haven't shared this information, which will make it difficult for them to plan for mutual financial goals like retirement.\n\nRead more personal finance coverage.\n\nMoney is hard to talk about — even with the people you love most.\n\nA survey by Morning Consult and Insider asked 2,000 Americans about their finances. Included in this survey was a question for married couples: whether or not they've shared their salaries and savings with their spouse. The survey found that baby boomers and millennials were more likely to be open about their financial situations with their spouse, while Gen Xers were the most likely to keep it to themselves.\n\nGen Xers are facing some problems with money that make this conversation dire. As Business Insider has previously reported, Gen Xers largely aren't prepared for retirement, and a significant percentage of them are dealing with debt, whether that's credit card debt or personal loans. (And they're hugely stressed about it.)\n\nBut, it seems, they're less likely to address those worries — or the numbers behind them — with their partners than the members of other generations.\n\nGen Xers are the least likely to talk about money in their marriage\n\nPlenty of married couples are talking about money.\n\nA solid 87.3% of married baby boomers and 87.5% of married millennials reported that they have shared relevant financial information with their spouse. Married Gen Xers, however, just aren't sharing as often — 82.6% reported sharing their financial details with their spouse.\n\nThat means that while 12.7% of married baby boomers and 12.5% of millennials aren't being upfront about money, 17.4% of married Gen Xers don't know much about their spouse's financial situation, putting them in an even more precarious position to plan for big life events.\n\nThe survey also asked the same question to people cohabiting but not married in relationships. Among unmarried people who reported living with partners, the gap between generations is less dramatic: 22.4% of Gen Xers haven't shared financial details with their partner. Neither have 20% of millennials or 16.7% of baby boomers.\n\nGen X is struggling financially on all fronts\n\nInsider's survey largely found that Gen X is in a precarious financial position compared to other generations.\n\nAbout half of Gen Xers don't even have a retirement account, reports Business Insider's Tanza Loudenback. And, another 13% have retirement accounts but aren't actively contributing to them, which means that they're missing out on perks that could help them get ahead, like valuable employer matches.\n\nIt's just just retirement that's weighing on this generation. About 50% of Gen Xers have some amount of credit card debt, reports Business Insider's Hillary Hoffower, and about 64% of Gen Xers who have credit card debt say that it's stressful. In a survey by Schwab Retirement Plan Services, 42% of Gen Xers who have a retirement plan say they're more focused on paying off debt than they are saving for retirement.\n\nA long-term goal like retirement takes two people both on the same page, which can't happen without some frank money conversations. Financial planner Christine Centino told Business Insider that couples who are on the same page about money are often working towards mutual goals. She says that couples who have talked about money and are on the same page are the couples who come into her office organized, and are asking questions like: \"'We want to buy a house, or we want to save for this, or can we retire?\"\n\nFinancial planner Heather Winston says that sooner is better to start talking about money, telling Business Insider contributor Natalia Lusinski, \"It won't always be easy, but addressing the difficult conversation will be critical to establishing a strong foundation for your future together.\"", "description": "About 18% of Gen Xers say they haven't talked to their spouse about how much they earn and save, which makes it hard to plan for the future.", "authors": ["Liz Knueven"], "top_image": "https://image.businessinsider.com/5db344fddee019089c634ae3?width=1200&format=jpeg", "published_at": "2019-10-26"}