{"pub": "cbc", "url": "https://cbc.ca/news/business/boeing-737-1.5307170", "downloaded_at": "2019-10-03 23:29:24.586130+00:00", "published_at": "2019-10-03", "title": "FAA orders airlines to inspect dozens of Boeing 737s for structural cracks | CBC News", "language": "en", "text": "The U.S. Federal Aviation Administration said on Wednesday that aircraft operators must inspect 165 Boeing 737 NG airliners for structural cracks within seven days after the issue was found on a small number of planes.\n\nBoeing Co notified the FAA of the issue after it discovered cracks on an aircraft undergoing modifications in China. The FAA said subsequent inspections found similar cracks in a small number of additional planes. The FAA said planes with fewer flights will eventually get inspected.\n\nThe order covers a total of 1,911 U.S. registered planes. The inspections can be done visually and should require about an hour per airplane, the FAA said.\n\nThe cracks are on what is known as the pickle fork — a part that attaches the plane's fuselage, or body, to the wing structure and manages forces.\n\nSouthwest Airlines Co, United Airlines and American Airlines Inc are among carriers that fly the 737 NG. The NG includes the 737-600, -700,-700C,-800, -900, and -900ER.\n\nSouthwest said it began the inspections on Tuesday and will fully comply within the required time. The company said it has not located any \"unusual findings.\"\n\nThe airline added it has \"developed a schedule to perform overnight inspections\" and does not expect operational disruptions.\n\nAmerican Airlines spokesman Ross Feinstein said none of the company's 737-800 fleet \"fall into the seven-day requirement.\" The company anticipates around 80 737-800 aircraft will require this inspection in the next eight months and the inspections won't impact its operation.\n\nThe FAA said the inspections would look for \"cracking of the left and right hand side outboard chords of frame fittings and failsafe straps.\" It said the issue \"could adversely affect the structural integrity of the airplane and result in loss of control of the airplane.\"\n\nThe 737 NG is the third-generation 737 and version before the now-grounded 737 Max, which is not impacted by the issue.\n\nBoeing said on Friday it has been in contact with 737 NG operators about the discovery of cracks, but added \"no in-service issues have been reported.\"\n\nReuters and other outlets late on Friday reported the planned inspections, but the FAA had not discovered overall details. The order will take effect on Thursday.\n\nAircraft with more than 30,000 cycles must be inspected within seven days, while planes between 22,600 and 29,999 cycles must be inspected within 1,000 cycles, which typically correspond to the number of flights. The FAA wants operators to \"report their findings to the agency immediately.\"\n\nUnited said it also does not fall under the seven-day time frame, and 80 of its airplanes are \"between the 22,600 and 29,999 cycles\" and will be inspected as required.", "description": "The U.S. Federal Aviation Administration said aircraft operators must inspect 165 Boeing 737 NG airliners for structural cracks within seven days after the issue was found on a small number of planes.", "authors": ["Thomson Reuters"], "top_image": "https://i.cbc.ca/1.5307172.1570109948!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/boeing-737.jpg"}