{"pub": "npr", "url": "https://npr.org/2019/09/23/763355554/thomas-cook-airline-collapse-triggers-largest-peacetime-repatriation-in-u-k-hist", "downloaded_at": "2019-09-23 17:17:47.635805+00:00", "title": "Thomas Cook Airline Collapse Triggers Largest Peacetime Repatriation In U.K. History", "language": "en", "text": "Thomas Cook Airline Collapse Triggers Largest Peacetime Repatriation In U.K. History\n\nEnlarge this image toggle caption Iakovos Hatzistavrou/AFP/Getty Images Iakovos Hatzistavrou/AFP/Getty Images\n\nThe Thomas Cook travel agency and airline abruptly collapsed Monday morning, putting tens of thousands of jobs at risk. More than 150,000 travelers are currently abroad, leaving the U.K. government to carry out what Foreign Secretary Dominic Raab calls the \"biggest peacetime repatriation in U.K. history.\"\n\nIt's a stark turn of events for a company with more than 170 years of history, whose roots stretch back to the height of the British Empire.\n\nFor anyone who currently has a flight booked on the company's airline, Thomas Cook says, \"please do not travel to your U.K. airport as your flight will not be operating and you will not be able to travel.\"\n\nThe job of bringing Thomas Cook customers home falls to the United Kingdom's Civil Aviation Authority, which says the number of travelers who must be brought home from abroad is \"unprecedented.\" The agency says it has \"secured a fleet of aircraft from around the world\" to bring passengers home.\n\n\"We have launched, at very short notice, what is effectively one of the U.K.'s largest airlines,\" says Civil Aviation Authority CEO Richard Moriarty.\n\nThose passengers won't have to pay extra fees for their flights; they'll also be allowed to file claims for a refund to cover out-of-pocket expenses, or to cover airfare if they're forced to book their own return flights. The repatriation program will run for the next two weeks, through Sunday Oct. 6.\n\nSome 50,000 Thomas Cook customers are currently on holiday in Greece, Tourism Minister Haris Theocharis says. An estimated 22,000 people will be repatriated within the next three days, he says, adding that the first 15 planes will touch down in Greek locations Monday.\n\nThe aviation authority has launched a new website to help Thomas Cook travelers find repatriation flights and advice.\n\nThe tour operator and travel company says it has \"ceased trading,\" meaning it's heading toward liquidation after years of struggling to turn a profit in a changing travel industry.\n\nIn late August, Thomas Cook's problems led it to sell a majority stake to Chinese investment group Fosun, which stepped in with a rescue offer worth more than $1 billion. But that wasn't enough to save the company. On Friday, the U.K. government turned away a bailout request of roughly $250 million, setting the company on a path to be wound down.\n\nIn a recap of the venerable travel company's arc, NPR's Frank Langfitt reports:\n\n\"Thomas Cook worked as a teenage cabinet's apprentice, then turned to organizing rail trips in rural England in the 1840s. The eponymous company grew into a global travel brand with its own airline. But eventually it succumbed to a variety of changes, including the rise of low-cost air carriers and the Internet, which allows people to design their own vacations.\"\n\nOn social media, the Thomas Cook Cares account — meant to handle customer issues — posted an abrupt announcement early Monday reading, \"We are sorry to announce that Thomas Cook has ceased trading with immediate effect.\"\n\nCustomers who might have hoped to contact Thomas Cook Cares with questions about the move are told, \"This account will not be monitored.\"\n\nThere were some pointed responses to that message, but many replies mourned the loss of a heralded British company that had served its customers well for decades.\n\n\"Best wishes to you all, it must have been horrible handling this without knowing about your own situation,\" the most popular response reads.", "description": "The Thomas Cook travel agency and airline abruptly collapsed Monday morning, with more than 150,000 travelers currently abroad.", "authors": ["Bill Chappell"], "top_image": "https://media.npr.org/assets/img/2019/09/23/gettyimages-1170373657_wide-e0dac050ffa7e2547514f058d7dc01ff7b570a45.jpg?s=1400", "published_at": "2019-09-23"}