{"pub": "townhall", "title": "How to lose weight with mindfulness", "url": "https://townhall.com/health/weight-loss/2017/09/25/lose-weight-mindfulness-n11734", "language": "en", "published_at": "2017-09-25", "downloaded_at": "2019-09-02 07:24:59.033873+00:00", "text": "What if I told you that the best weight-loss plan doesn’t cost a dime? It doesn’t involve a new fad, it doesn’t involve you giving up your favorite foods, it doesn’t make you count points or read labels, and it doesn’t involve meetings or expensive, frozen pre-made meals that taste like chalk. It’s true, and that’s not even the best part! Numerous studies have shown this weight-loss plan helps people lose weight faster and keep weight off\n\nMindful vs. Mindless Eating\n\nPlowing through a meal in a matter of minutes\n\nEating while driving\n\nEating while walking\n\nEating while chatting with another person\n\nEating while reading\n\nEating while watching TV\n\nNoshing on something after dinner because you were bored\n\nEating as a way of dealing with stress\n\nSnacking on food as you are cooking a meal or putting leftovers away\n\nGrazing at a snack table during a party\n\nbetter than popular “diets.” It’s called mindful eating. And though mindful eating might be a new concept to you, it’s not hard to learn, which means you can start shedding pounds today.Though this article is about mindful eating, I first want to talk with you about mindless eating. Mindless eating can be any of the following:There are many other examples of mindless eating. At its core, mindless eating is when your mind is occupied with other things instead of just the act of eating. It’s become almost a daily routine in our society that we eat our meals while doing something else. Research has shown that when we don’t pay attention to what we are eating, we’re doing two things. First, we don’t enjoy the food as much. Second, we eat more food than our bodies need . There is about a 20-30 minute gap in time between when we swallow food and when our stomach signals to the brain that it’s beginning to fill up. Taking that into consideration, here’s something to think about: When you ate your dinner last night, did it take you about 20-30 minutes to finish your plate? I’m willing to bet that most people finish their meal well within that time frame. I admit that was kind of a trick question, because another problem with the American diet is portion sizes, especially at restaurants. We are served far more food than what is considered a healthy portion based on a 2,000 calorie diet, or even a 2,500 calorie diet. So if you eat all your food in under 30 minutes, your stomach will not have been given the chance to tell you (via your brain) that it is full. This is where the technique of mindful eating comes into play.\n\nTips to Become a Mindful Eater\n\nAsk yourself: Why am I eating? How hungry am I? Is this food healthy?\n\nEliminate distractions—phones, TVs, music. Eat in silence. Be ready to use all of your senses.\n\nPut your utensil down after taking a bite. Do not pick the utensil until you have swallowed your food.\n\nWhile chewing, think about the different flavors and textures. This will enhance them and make you enjoy them more.\n\nChew each bite thoroughly and do not swallow until it is completely liquified.\n\nDo not rush your meal.\n\nThroughout your meal, continue to ask yourself why you are eating and how hungry you are.\n\nStop eating when you are full.\n\nIf you’ve been a mindless eater for most of your life, it will take practice to become a mindful eater. Here are some basic steps.Doing these things isn’t difficult per se, but like any new routine, it has to take the place of an old routine. And routines are hard to replace. I admit that my busy schedule causes me to sometimes eat mindlessly, too. So I suggest that you start out by picking one meal a day to be a mindful eater, preferably breakfast or dinner because there are usually less distractions in your day at those times. Let’s put these steps into action using a guinea pig—me. Here is how I mindfully eat one of my favorite foods, a big colorful salad filled with vegetables . First, I turn off my phone and TV. Then I look at all these healthy vegetables one by one and think about all the nutrients in them. I put my nose near the bowl and smell the flavors and freshness. As I take a bite and start slowly chewing, I put my fork down and put all of my senses to use for everything in my mouth. Juicy tomatoes, spicy radish slices, and red onion, crispy romaine lettuce, savory chunks of medium-rare steak, the\n\nHow Mindful Eating Helps You\n\nReferences\n\nacidity of the dressing , and so on. With every bite, I do this again until either I am full or the salad is gone. And when it is gone, I wait another 15 minutes to eat anything else so my body has time to digest the food and signal to my brain if I have had enough.Let me be clear: Mindful eating is not a diet . It’s not about giving up any of your favorite foods. It’s doesn’t involve reading labels or counting points. It’s bigger than that. At its core, it’s about paying attention to everything about the food you are eating—what you are eating, why you are eating it, how much of it you are eating, where you are eating it, and so on. Eating mindfully means eating less. That’s because mindfully eating a meal will take longer than 20-30 minutes. It’s likely that during your meal, you will find yourself becoming full. That’s your cue to put the fork down and start packing up your leftovers. However, I encourage you to do this part quickly to avoid any mindless picking and grazing at the rest of your meal. Get it in your fridge and get on with the rest of your day feeling lighter and healthier. Mindful eating is proven to shed pounds effectively and permanently. It’s a testament of what we can do if we put our minds to it.", "description": "What if I told you that the best weight-loss plan .09/02/2019 3:24:58AM EST.", "authors": ["Beth Baumann"], "top_image": "https://media.townhall.com/_townhall/resources/images/thog.png"}