{"pub": "rt", "url": "https://rtd.rt.com/films/no-breaks-no-fear-ice-speedway-european-championship-krysov", "downloaded_at": "2019-10-05 10:19:30.770968+00:00", "title": "The hottest Ice Speedway riders show why theirs is the coolest sport — RTD", "language": "en", "text": "Ice speedway is the hard man’s hardest motorcycle sport. Just like regular speedway, motorcyclists race around a track on bikes with no brakes. In this version though, the tires are fitted with 2.8 cm spikes to grip the ice, and they can reach speeds of 130 km an hour. Collisions are commonplace, and the riders wear armour-like protection.\n\nIn ice speedway, four motorcyclists line up to race against each other on an icy circuit.\n\nAlthough ice speedway was born in North-Western Europe in the 1920s and 1930s, Russians quickly came to dominate the sport: other countries hold races on artificial rinks, but in Russia, they take place outdoors in temperatures below -20°C, giving Russian drivers a more challenging experience. International competitions are always held in the previous champion’s home country, so most race meetings tend to be in Russia.\n\nIce speedway is popular in Northern Europe, but Russia is the only country where competitions generally take place outdoors, by -20°C or less.\n\nSo, what does it take to win at ice speedway: grit, guts or tactics? To find out, RTD follows two very different racers as they gear up for the European Individual Ice Speedway Championship final held over a weekend in Vyatskie Polyana, in the Kirov region deep in central Russia.\n\nTomi Kirilov, a truck driver from Tampere in Finland, is a veteran of the sport but also a pure amateur. For Tomi Kirilov, competing means starting with a thirty-hour van drive with his mechanic friends who keep his bike in fighting condition. Despite his lack of sleep, he lines up to race on the first day but then faces temptation at the evening banquet.\n\nIce speedway racers have a special technique for taking corners. This involves leaning into the turn so much that their leg almost scrapes the ground, and they wear pads to protect their limbs from serious injury.\n\nEduard Krysov, or Edik for short, from Russia, was runner up in the last European championship. He manages to clear the snow on a frozen lake at night to get in some extra practice. His stunts don’t always come off; however, numerous falls have caused spinal compression fractures that shrink vertebrae; his many injuries take an astonishing toll on his body.\n\nTo grip the ice, the motorbikes used in ice racing have spiked tires up to 2.8 cm long.\n\nOn the day, riders are pitted against each other four at a time: heat winners are awarded three points. As the competition progresses, points add up, and the pecking order is challenged. Tomi Filipov is philosophical about his chances. With a longstanding rivalry between Eduard Krysov and Jan Klatowski, a Czech challenger with hopes for the podium, Tomi’s participation throws a spanner in the works.", "description": "In ice speedway, motorcyclists race without breaks. RTD shadows Tomi Kirilov and Eduard Krysov at the European Individual Ice Speedway Championships in Vyatskie Polyana, Russia, with surprising results", "authors": [], "top_image": "https://cdni-rt.secure2.footprint.net/rtd-files/films/no-breaks-no-fear-ice-speedway-european-championship-krysov/no-breaks-no-fear-ice-speedway-european-championship-krysov_1-mail0.jpg", "published_at": "2019-07-31"}