{"pub": "washingtonpost", "url": "https://washingtonpost.com/outlook/2019/09/09/schwarzenegger-too-many-voters-live-under-minority-rule-heres-why", "downloaded_at": "2019-09-09 11:46:04.757960+00:00", "title": "Schwarzenegger: Too many voters live under minority rule. Here’s why.", "language": "en", "text": "\n\nFormer California governor Arnold Schwarzenegger addresses protesters in front of the Supreme Court in 2017 after the justices heard arguments on gerrymandering. (Bill O'Leary/The Washington Post)\n\nWhen a North Carolina court overturned the state’s legislative map as an unconstitutional partisan gerrymander last week, the unanimous decision provided much more than a needed victory free and fair elections. It was also a valuable reminder: Partisan gerrymandering affects much more than Congress, distorting representation in state houses and senates nationwide.\n\nA stunning number of Americans — more than 59 million — live under minority rule in a state where the party with fewer votes in the 2018 election nevertheless controls a majority of seats in the legislature. Democratic candidates for the North Carolina House and Senate won a solid majority of the statewide vote last fall, but Republicans nevertheless won 54 percent of House seats and 58 percent of Senate seats. “Representatives are choosing voters based upon sophisticated partisan sorting,” a bipartisan panel of judges concluded. “It is the carefully crafted will of the map drawer that dominates.”\n\nBut North Carolina is not alone. Five other states — Michigan, Wisconsin, Virginia, Ohio and Pennsylvania — have minority rule in one or both of their legislative chambers, according to a study from a team headed by Christian Grose of the USC Schwarzenegger Institute. While it will come as no surprise that, in all six of these states, the party with the undue majorities also controlled the map-drawing, the statistics should nevertheless chill all of us who believe in the power of one person, one vote.\n\nThe partisan gerrymander in Virginia’s House of Delegates, for example, holds this ugly distinction: Republicans hold a majority of seats — just under 51 percent — with just 44.5 percent of the 2017 vote. That’s the lowest popular vote share for any legislative majority in the nation. Earlier this year, a federal court put a new, neutral map in place for Virginia’s upcoming House election.\n\nWisconsin, where partisan mapmakers maximized their gains with even greater ruthlessness and efficiency, has received no such remedy. Only 44.7 percent of voters there cast ballots for Republican Assembly candidates in 2018, but the GOP nevertheless won 64.6 percent of the seats. The Wisconsin map was initially overturned by a federal court, but it was allowed to stand after the U.S. Supreme Court ruled partisan gerrymandering “nonjusticiable,” meaning the issue can’t be resolved by judges, at the federal level.\n\nIt’s a similar story in Pennsylvania and Michigan. In the Keystone State, Republican state House candidates earned 45.6 percent of the votes but 54.2 percent of the seats. In Michigan, meanwhile, 47.4 percent of voters favored Republicans, but the maps helped the GOP claim just under 53 percent of the seats.\n\nThese states’ upper chambers are just as badly gerrymandered. Pennsylvania, Michigan and North Carolina all have senates where the party with fewer votes holds control — which means the entire legislature is dominated by the minority party. Add to that Ohio: In 2018, just over half of the Buckeye State’s Senate seats were up for election. Republicans won 47.2 percent of the vote but 58.8 percent of the seats.\n\n[I’m a Democrat. But Ohio’s GOP got out its crayons, and now my vote doesn’t count.]\n\nNothing explains this consistent partisan bias other than the maps themselves. State and federal courts have carefully considered, and rejected, the mythical notion that the state’s political geography or natural clustering — Democrats packed into the cities, Republicans spread more efficiently throughout suburbs or rural areas — provided the GOP edge. Time and again, the judges have pointed out the real culprits: partisan legislators with unfettered control of redistricting, aided by powerful mapmaking software and precise, block-level voting and demographic data on individuals.\n\nNot all partisan gerrymanders result in minority rule. Instead, the maps sometimes create yawning, disproportional gaps between the percentage of the vote earned by a party and the number of seats they win. In six states — Arkansas, Kentucky, Nevada, Oklahoma, Tennessee and Wisconsin — that gap is actually greater than 15 percentage points. In Nevada, for example, state House Democrats won just over 51 percent of the vote but translated that into 69 percent of the seats.\n\nAll of this is bad for democracy. Gerrymandering insulates politicians from the voters. It entrenches a party in power, providing a firewall that preserves a majority even when the other side wins more votes. It pushes our politics to the extremes and leads to policy outcomes that a majority of citizens disagree with but remain powerless to do anything about. All Americans, regardless of party, ought to be outraged over the way it debases free elections and fair results.\n\nA growing number are outraged — and taking action. Last fall, residents of Michigan, Colorado, Utah and Missouri voted overwhelmingly to reform redistricting, remove the power from legislators and bring it closer to the people.\n\nBut the states that allow such initiatives are dwindling. Politicians don’t always respect the results: In Michigan, for example, the state Senate cut the secretary of state’s budget in an attempt to make it harder to fund the redistricting commission, and Republicans in Missouri’s legislature nearly rolled back the referendum there. The constitutional challenge that worked in North Carolina probably could be replicated in only about half of states, where there are “free and fair” or “free and open” election guarantees in the state constitutions. A genuine solution to this deeply political problem will somehow have to be a political one, and we’re running out of time before the next redistricting, which follows the 2020 Census.\n\nThe North Carolina decision helps guide the way: There, the exasperated judges demanded that every line be drawn in public, with the computer screen in clear view and using limited data. Transparency is essential. But so is the deeply American value of majority rule. Here’s another idea: When a party wins more votes, but fewer seats, it triggers an automatic nonpartisan remapping. The 59 million Americans living under entrenched minority rule deserve nothing less.", "description": "A recent North Carolina ruling should remind us just how widespread gerrymandering is.", "authors": ["Arnold Schwarzenegger", "David Daley", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/M3RxNaoJbHr-IwgcjR-iLDfBzQU=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/VK5IKGVIKUI6PGUYA4KA2LXNAI.jpg", "published_at": "2019-09-09"}