{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7612127/Cody-Simpsons-bizarre-link-Australian-radio-host-Alan-Jones.html", "downloaded_at": "2019-10-25 16:51:37.954491+00:00", "title": "Cody Simpson's bizarre link to Australian radio host Alan Jones", "language": "en", "text": "He has dated a slew of Hollywood stars prior to his romance with Miley Cyrus, including Gigi Hadid, Kylie Jenner and Aliana Lohan.\n\nAnd it's now been revealed that Cody Simpson, 22, boasts another powerful connection, this time through his best mate Jake Thrupp.\n\nThe singer's friend is an aspiring broadcaster and the protégé of Australian 2GB radio host, Alan Jones, 78.\n\nWho doesn't he know? Cody Simpson has a connection to Australian radio broadcaster Alan Jones (right), 78\n\nJake, 22, who hails from the Gold Coast, has been on Alan's payroll since April 2018 on a part-time basis as he continues his politics degree at the University of Sydney.\n\nNot only is Jake employed by Alan, but also his mother Chantrel, who swapped a job at hardware chain Bunnings for managing the media star's Queensland properties.\n\nAlan has taken Jake under his wing, treating him to overseas trips and allowing him a guest spot on his Sky News program.\n\nLearning from the best: Cody's best mate Jake Thrupp (pictured) is an aspiring broadcaster and the protégé of Australian 2GB radio host Alan\n\nBright future: Jake, who has his own podcast, A Week with Jake Thrupp, has been on Alan's payroll since April 2018 on a part-time basis\n\nJake, who has his own podcast, A Week with Jake Thrupp, spoke of his relationship with his mentor in an interview with The Sunday Telegraph this month.\n\n'I connected with Alan a couple of years back when he was doing charity work in Queensland and I was working for Tweed Heads councillor James Owen,' he said.\n\n'Alan was keen to donate some prizes for the (2017) Lismore floods and I was working in James' office. Alan made contact and we started emailing back and forth, and that's how we got to know each other.'\n\nAlan, who is known for making controversial comments on air, told The Sydney Morning Herald earlier this month that Jake's employment 'gets him from A to B'.\n\nBest pals: Jake is often spotted hanging out with Cody in Australia and abroad\n\n'The family are Queensland friends of mine. He is part-time with me because he's a student at university,' he said.\n\n'When he transferred from Queensland University to Sydney University, I gave him employment which is not full-time. But he gets me from A to B.'\n\nCody has been best pals with Jake since his teen years, and the pair often feature on one another's social media accounts.\n\nFor Jake's 16th birthday, Cody shared a photo of the two next to an outdoor pool, and described him as his 'Gold Coast beach brother'.\n\nThe lads have also been pictured attending red carpet events in the US, and Jake once accompanied Cody to a basketball game with Kendall and Kylie Jenner.", "description": "Cody Simpson, 22, has yet another connection to a personality in the media and entertainment industry.", "authors": ["Kristy Johnson For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/04/20164664-0-image-a-82_1571975835111.jpg", "published_at": "2019-10-25"}