{"pub": "fox", "url": "https://foxnews.com/us/man-allegedly-walks-351-miles-for-sex-with-teen-who-was-undercover-cop", "downloaded_at": "2019-10-14 10:12:43.885204+00:00", "title": "Man allegedly walks 351 miles for sex with teen, who was undercover cop", "language": "en", "text": "A convicted pedophile from Indiana was busted for trying to have sex with a 14-year-old girl — after walking 351 miles to meet her, according to authorities.\n\nTommy Lee Jenkins, 32, began an X-rated instant-message exchange with a teen named “Kylee” in Wisconsin who was actually a sheriff’s deputy, according to the US Attorney’s Office.\n\nJenkins asked her for sexually explicit photographs while badgering her to meet him for sex in Whitestown, Ind., where he lived, officials said.\n\nWhen she refused, he set off on foot for where she supposedly was, in Neenah, Wisc. — repeatedly sending her explicit messages and updating her on the progress of his desperate hike, according to prosecutors.\n\nHis mammoth trek ended with a surprise — with sheriff’s deputies and an FBI agent waiting to bust him, authorities announced Friday.\n\nJenkins was charged with using a computer to attempt to persuade, induce or entice a minor to engage in unlawful sexual activity. He faces 10 years to life in prison if convicted.\n\nHis messages to ‘Kylee” included telling her he wanted them to have 500 kids together, including one within a year, according to the Oshkosh Northwestern.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\n“Our nation faces an epidemic of child sexual abuse, with the Internet making it too easy for predators to communicate with children across the country,” said US Attorney Matthew Krueger.\n\nClick here for more from the New York Post", "description": "A convicted pedophile from Indiana was busted for trying to have sex with a 14-year-old girl — after walking 351 miles to meet her, according to authorities.", "authors": [], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/VN2HCJZ7FBCDHHVU4MBFQM75OQ.jpg", "published_at": "2019-10-14"}