{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7609983/Down-Thai-fisherman-stumbles-precious-WHALE-VOMIT-worth-estimated-320-000.html", "downloaded_at": "2019-10-25 00:13:25.358067+00:00", "title": "Down-and-out Thai fisherman stumbles across precious WHALE VOMIT worth an estimated $320,000", "language": "en", "text": "A broke fisherman is set for a windfall after landing a huge lump of valuable whale vomit.\n\nJumrus Thiachot, 55, spotted the 14lbs piece of Ambergris while he was walking along the beach in Koh Samui of Surat Thani, southern Thailand, earlier this year.\n\nThe fisherman - unsure of what it was - kept it in his shed and carried on working, earning around 400 baht, the equivalent of £10.25 a day.\n\nJumrus asked neighbour to help him check the substance and they 'cut slices off' but told him their tests had not been successful.\n\nThe whale vomit found by broke fisherman Jumrus Thiachot which weighs 14lbs and is valued at an estimated $320,000\n\nThe fisherman - unsure of what it was - kept the vomit in his shed and carried on working, earning around 400 baht, the equivalent of £10.25 a day\n\nSurat Thani provincial governor Witchawuth Jinto (centre) arrived with specialists and they confirmed that the chunk, found by fisherman Jumrus Thiachot, 55, (right), contained more than 80 percent of Ambergris\n\nOfficials from the local government finally visited the fisherman at his home on Tuesday where they confirmed the waxy lump was genuine whale vomit.\n\nJumrus's prize catch could be worth as much as US$320,000, based on previous sale prices of Ambergris.\n\nThe cash-strapped fisherman said that he had been waiting for almost a year before he contacted the authorities.\n\nHe said: 'Three of my neighbours came after my nephew told the villagers that I found a whale vomit.\n\n'They asked for slices and said that they will run some checks to prove that it was really a whale vomit, but they said the tests didn't show anything.\n\n'I needed to know the truth, so that why I contacted the authorities to check. Now I know it is real whale vomit I will sell it.'\n\nJumrus's prize catch could be worth as much as US$320,000, based on previous sale prices of Ambergris\n\nThe cash-strapped fisherman said that he had been waiting for almost a year before he contacted the authorities\n\nAmbergrisis produced by sperm whales when their bile ducts in the gastrointestinal tract make secretions to ease the passage of large or sharp objects. The whale them vomits the mucilage which solidifies and has a foul smell\n\nSurat Thani provincial governor Witchawuth Jinto arrived with specialists and they confirmed that the chunk contained more than 80 percent of Ambergris.\n\nWitchawuth said they are now advising Jumrus on what he should do next to get the best price for his lucky find.\n\nAmbergrisis produced by sperm whales when their bile ducts in the gastrointestinal tract make secretions to ease the passage of large or sharp objects. The whale them vomits the mucilage which solidifies and has a foul smell.\n\nHowever, after the mucilage dries out the chunk will start to smell good which makes it a sought-after ingredient in the perfume fragrance industry, because of its good long-lasting smell.\n\nIn April 2016, a 1.57 kilogram ambergris ball found in Lancashire sold for GBP50,000 while in November of the same year, three Omani fishermen found 80 kilograms of ambergris and sold it for US $3million.", "description": "Down-and-out Thai fisherman Jumrus Thiachot, 55, struck gold when he found a valuable lump of whale vomit while walking along the beach of Koh Samui earlier this year.", "authors": ["Sophie Tanno For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/24/17/20143408-0-image-a-2_1571935379325.jpg", "published_at": "2019-10-24"}