{"pub": "yahoo", "url": "https://news.yahoo.com/india-criticizes-chinese-trade-policies-052358482.html", "downloaded_at": "2019-09-09 06:54:00.854439+00:00", "title": "India Criticizes Chinese Trade Policies", "language": "en", "text": "(Bloomberg) -- Terms of Trade is a daily newsletter that untangles a world embroiled in trade wars. Sign up here.\n\nIndian External Affairs Minister Subrahmanyam Jaishankar on Monday criticized China for what he described as one-sided trade policies, casting doubt over the progress of negotiations for a pan-Asian free trade agreement.\n\nSpeaking during a panel discussion in Singapore, the minister said India remained skeptical over “unfair” market access and “Chinese protectionist policies” that have created a significant trade deficit between the two nations. India’s trade deficit with China was $53.6 billion in the fiscal year ended March 2019.\n\n“The big concerns of India are of course, one, its relationship with China because we have an enormous trade deficit with China,” Jaishankar said in response to a question regarding the ongoing negotiations for Regional Comprehensive Economic Partnership, or RCEP.\n\nNegotiators have expressed hope that RCEP -- which includes all 10 of Southeast Asia’s Asean countries, as well as Japan, South Korea, Australia, New Zealand, India and China -- would be delivered by the end of the year. While ministers from the 16 participating countries reaffirmed their commitment to reaching a deal this year following negotiations in Bangkok over the weekend, it is unclear whether such a goal will be met.\n\nJaishankar said he was unsure what was discussed in the latest round of negotiations, but noted that India’s involvement would hinge on a mutually equitable, depoliticized arrangement.\n\n“RCEP at the end of the day is an economic negotiation. It has a strategic implication, but the merits of the RCEP outcome have to be economic,” said Jaishankar. “It has to be sold for its strength and I think if that was more self-evident to Indians I think you would get clearly a much stronger resonance.”\n\nSingaporean Foreign Minister Vivian Balakrishnan, who was also on the panel, urged India to reconsider its position on RCEP, saying that Beijing and New Delhi would have to come to terms on trade eventually.\n\n“I am making the argument that it is worth making the effort, because this would be a game changer,” Balakrishnan said.\n\nTo contact the reporter on this story: Philip J. Heijmans in Singapore at pheijmans1@bloomberg.net\n\nTo contact the editors responsible for this story: Ruth Pollard at rpollard2@bloomberg.net, Karthikeyan Sundaram\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Terms of Trade is a daily newsletter that untangles a world embroiled in trade wars. Sign up here. Indian External Affairs Minister Subrahmanyam Jaishankar on Monday criticized China for what he described as one-sided trade policies, casting doubt over the progress of negotiations for", "authors": ["Philip J. Heijmans"], "top_image": "https://s.yimg.com/os/mit/media/m/social/images/social_default_logo-1481777.png", "published_at": "2019-09-09"}