{"pub": "axios", "url": "https://axios.com/big-tech-local-politics-seattle-san-francisco-amazon-313404f2-264a-427a-bf36-0a4c87a76514.html", "downloaded_at": "2019-10-25 23:49:22.933220+00:00", "title": "Big Tech's hyperlocal fights", "language": "en", "text": "\"Some of these tech companies with this 'move fast, break things' ethos have learned that when you get involved with local politics, your brand can suffer,\" says Jason McDaniel, a political science professor at San Francisco State University.\n\nThink how New York's backlash against Amazon HQ2 drove the company out of town.\n\nbacklash against Amazon HQ2 drove the company out of town. San Francisco passed a homelessness tax on businesses.\n\npassed a homelessness tax on businesses. Mountain View passed a per employee \"head tax\" aimed at Google, which will end up costing the company millions every year.\n\nLocal politics are becoming too costly for the companies to ignore, says Margaret O'Mara, a tech historian at the University of Washington. \"They're now finally playing in local politics. It's becoming important not only to their public image, but also their bottom line.\"\n\nWhat's happening: Amazon has put $1.4 million into the Seattle City Council race this year. It's \"a staggering sum for a city election, let alone from a company that was M.I.A. in local politics for years,\" the New York Times' Karen Weise writes. Just four years ago, Amazon spent $25,000.\n\n“We believe it is critical that our hometown has a City Council that is focused on pragmatic solutions to our shared challenges in transportation, homelessness, climate change and public safety,\" an Amazon spokesperson said in a statement.\n\nMoney in San Francisco's elections is reaching new heights, too. The past two City Hall elections saw $7 million and $8 million in spending, reports the San Francisco Chronicle.\n\nTech giants are also putting money into local projects — often trying to address housing and transit crises fueled by their own growth.\n\nJust this week, Facebook committed $1 billion for Bay Area housing. Google made the same pledge earlier this year.\n\nFacebook committed $1 billion for Bay Area housing. Google made the same pledge earlier this year. Microsoft pledged $500 million for affordable housing in Seattle.\n\npledged $500 million for affordable housing in Seattle. Amazon has given money to address homelessness in Seattle as well as Arlington, Virginia, the home of its second headquarters.\n\nBut, but, but: \"Politics is not a vending machine,\" says Lee Drutman, a scholar at New America. And in some cases, spending too much can work against tech giants.\n\nIn Seattle, progressive candidates are latching onto Amazon's big political contribution as a talking point. Kshama Sawant, who is the most vocal anti-Amazon Seattle council member, tweeted, “EMERGENCY! Amazon just dropped a $1 million bomb on Seattle elections — we can’t let Jeff Bezos buy City Hall!”\n\nAnd in San Francisco, Juul garnered widespread backlash after it spent millions to support a ballot measure overturning a ban on the sale of e-cigarettes. The company later pulled support for the measure.\n\nWhat to watch: As the techlash intensifies, eyes are on federal regulators, but local and state lawmakers will be in the crux of the action, too, O'Mara says. \"We're in for a really interesting 5–10 years in which this issue of tech regulation is going to be a really defining political question — at every level.\"\n\nGo deeper: Cities, not Congress, are clipping Big Tech's wings", "description": "Some of their toughest, priciest fights are in their hometowns.", "authors": [], "top_image": "https://images.axios.com/2K5dCn37gz7Govu67fXF2v7NR5M=/0x0:1280x720/1920x1080/2019/10/23/1571868546424.jpg", "published_at": "2019-10-24"}