{"pub": "axios", "url": "https://axios.com/private-equity-thirst-for-health-care-providers-1528737485-195192d5-db93-4c57-9a28-4b7af191d42e.html", "downloaded_at": "2019-10-23 10:52:28.002442+00:00", "title": "Private equity's thirst for health care providers", "language": "en", "text": "The bottom line: Physician groups, emergency room staffing, and air and ground ambulances can (and in most cases do) make a lot of money because people will use their services regardless of the price.\n\nPhysicians and ambulances can opt out of an insurance company's network, unbeknown to a patient, if they feel they aren't getting paid enough — and patients are saddled with the remaining costs.\n\n\"If you're willing to engage in some fairly unsavory billing practices, (these services) could be quite lucrative,\" said Zack Cooper, a Yale health economist who has studied out-of-network billing.\n\nPhysician and ambulance groups contend they need to bill commercial insurance more to make up for shortfalls in Medicare and Medicaid, but that cost-shifting theory often falls flat.\n\n\"Unless they can point to a credible study of a causal connection between public payer rates and private ones, I would not believe cost shifting exists in this market,\" health economist and New York Times Upshot contributor Austin Frakt said in an email when asked about air ambulances.\n\nDriving the news: Before the KKR-Envision deal, private equity flocked to health care knowing the profit potential.\n\nKKR bought Envision's ground ambulance subsidiary last year for $2.4 billion.\n\nBlackstone Group bought TeamHealth, a competitor to Envision, in 2016 for $6.1 billion.\n\nAir Methods was bought out by American Securities last year in a deal valued at $2.5 billion.\n\nPrivate equity firms are reportedly circling Mednax.\n\nSpecialty physician groups also are receiving a lot of private equity interest based on the patients they treat.\n\nThe big question for the latest KKR deal: Will Envision stay transparent about its efforts to reduce surprise medical bills? Going private means health care groups don't have to disclose a whole lot about their finances or strategy.\n\nKKR did not respond to questions. Envision said in a statement it would live up to its pledge to move almost all of its out-of-network contracts to in-network contracts by the end of this year.\n\nSen. Claire McCaskill still has not updated the public about her inquiry into Envision's billing practices.\n\nLooking ahead: Private equity owners don't have incentives to eradicate out-of-network practices, which Cooper called the \"ugly pockets of the U.S. health care system.\"\n\n\"That's just discouraging, and it makes people want to go to single payer,\" Cooper said.", "description": "Market power rules health care and attracts private equity.", "authors": [], "top_image": "https://images.axios.com/lwc74-VK1nLgCeIYbPSTFP_N-00=/0x144:3800x2282/1920x1080/2018/06/11/1528737490841.jpg", "published_at": "2018-06-11"}