{"pub": "nationalreview", "url": "https://nationalreview.com/2019/07/alexei-navalny-russian-opposition-leader-what-if-he-dies", "downloaded_at": "2019-10-07 12:05:50.295498+00:00", "title": "Russian Opposition Leader Alexei Navalny: What If He Dies?", "language": "en", "text": "Russian opposition leader Alexei Navalny (right) greets protesters in Moscow on July 20, 2019. (Shamil Zhumatov / Reuters)\n\nOn Russia, Iran, the U.S., decency, wine, a marvelous photo, and more\n\nFor years now, some of us have said, “It’s amazing he’s still alive.” We’re talking about Alexei Navalny, the leader of the Russian opposition. (The previous such leader, Boris Nemtsov, was murdered within sight of the Kremlin in 2015.) Over and over, Navalny has been attacked — physically, that is. In the past few days, it is possible he has been the victim of a poison attack.\n\nAdvertisement\n\nAdvertisement\n\nThey’re not shy about poisoning, Putin’s guys. (For a story about Navalny, go here.)\n\nA question: What if Navalny dies? What will the reaction of the rest of the world be, and of the United States in particular? (Years ago, we enjoyed the designation “Leader of the Free World.”) Will there be a shrug, as in the murder of Jamal Khashoggi? A statement of regret from the State Department? Something a bit sterner, possibly?\n\nWill a mouthy, conscientious member of Congress say something?\n\nThese are things to be thought of, even now.\n\nAdvertisement\n\nAdvertisement\n\nLast year, President Trump was asked who ought to be held accountable for the Khashoggi murder. “Maybe the world should be held accountable,” he answered, “because the world is a vicious place.”\n\nNext time, we will do better, I hope.\n\n• Here is a report from last week:\n\nA prominent LGBT rights campaigner has been found dead with multiple stab wounds and signs of strangulation in the Russian city of St Petersburg. The body of a 41-year-old woman was found in bushes near her home in the city on Sunday, local police said. Relatives and friends later named the victim as Yelena Grigoryeva . . . Ms Grigoryeva, who had reportedly received death threats, regularly campaigned for human rights in Russia.\n\nThey are possibly the most careless people in the world, these Russian activists. They keep losing their lives.\n\n• In this new era of strongmen, who will defend democracy? Who will stick up for it, even fight for it? Look to the streets of Hong Kong and Moscow, where democracy protesters are being beaten by thugs. I admire them no end — the protesters, that is, not the thugs. Would I be among those protesters? Would you?\n\nFor myself, I can’t answer with confidence.\n\nAdvertisement\n\nAdvertisement\n\nI wish someone in the United States would utter a peep for them — not scribblers and yakkers like me, but an official. If it can’t be the president, how about a congressman, how about anybody? Someone willing to express the solidarity, or at least the best wishes, of the American people?\n\nHe likes to keep a low profile, following the example of his ex-president father, but I nominate George W. Bush.\n\n• According to reports, the Iranian economy is in free fall. Hurray, I guess. But I must tell you something: One reason I prize Magnitsky sanctions is that they target individuals — wrongdoers, human-rights violators, villains — not populations at large.\n\nWill our sanctions on Iran backfire? Will they cause a pro-American population to turn against us and rally to their oppressive regime? I don’t know.\n\nBut these are questions that policymakers always have to weigh (and I’m sure ours have).\n\n• The temperature is awfully high in America now — I’m not talking about the weather, although the heat, in some places, has been rough. I’m talking about politics, and race in particular.\n\nAdvertisement\n\nThis is only 2019. How about 2020, when the presidential election is in full swing? How much higher can the temperature go? Will America be able to take it, without combusting?\n\nFor years, through the Reagan administration, Michael Kinsley predicted “a long hot summer” — because people would rebel against the depredations of the Reaganites, essentially. The long hot summer never came. Kinsley, to his credit, joked about it.\n\nAnyway, I hope the summer of 2020 is on the cool side, but I’m not predicting it (especially having no training in meteorology).\n\n• For reasons I could explain, I went back to a book review I wrote in 2017. I covered two books, actually: a collection by Gertrude Himmelfarb and a collection of Kenneth Minogue. In this review, I quoted Roger Scruton, and I think I will do a little pasting — copying and pasting.\n\nHere goes:\n\nScruton, after Minogue’s passing, wrote an appreciation, saying, “In many ways he was a model of the conservative activist. He was not in the business of destroying things or angering people. He was in the business of defending old-fashioned civility against ideological rage, and he believed this was the real meaning of the freedom that the English-speaking peoples have created and enjoyed.” Scruton also said, “For Ken Minogue, decency was not just a way of doing things, but also the point of doing them.” That is an unusual, striking sentence, worth pondering.\n\nYes. I am thinking of David French, my friend and colleague, who has been attacked as — well, too decent to be a real conservative, and to get things done. David was moved to write a piece called “Decency Is No Barrier to Justice or the Common Good” (here).\n\nDavid is a warrior — in the courtroom, on the battlefield (the literal one), in journalism, and in still other arenas. But he’s not a jackass, which a lot of people resent.\n\nAdvertisement\n\nAdvertisement\n\n(I understand them, so help me. I touched on this in an article earlier this year, here.)\n\n• Look, far be it from me to comment on wine — I have no standing. (Whines, yes; wines, no.) But President Trump tweeted, “I’ve always said American wine is better than French wine!”\n\nMy feeling is: Maybe we give them this one. Wine. If we Yanks need to boast — “where there’s never a boast or brag” — there are other things . . .\n\n• Speaking of tweets, I loved one from Tiana Lowe of the Washington Examiner, formerly of National Review. She was reacting to a story headlined “Is it weird for adults to visit Disney parks without kids? Twitter fiercely debates.” She wrote, “I just cannot imagine having the energy to care if other people minding their own business went to an amusement park.”\n\nThis reminded me of something George Bush said, a long time ago. (I mean Bush the Elder.) It went something like this: “One reason I’m a conservative is that I don’t toss and turn nights, worried that someone, somewhere, is having a good time.”\n\nAdvertisement\n\n(I realize that today’s Right does not consider Bush to have been a conservative. During his career, however, he was a right-wing monster, at least in the eyes of the Left.)\n\n• Care for a little language? Here’s a golf article from Reuters. The headline: “Koepka dominates one-sided bout with McIlroy in Memphis.” If you have “dominates,” you don’t need “one-sided.” That’s redundant.\n\nBut I loved a phrase within the article — one that is new to me: “. . . McIlroy missed a short birdie putt at the third hole from inside four feet and never recovered, his body language the only evidence needed that he was not quite on-song.”\n\nOn-song. Must be a Britishism. A good one.\n\n• Here’s an old-fashioned word: moxie. More and more, I admire this, as one of the best qualities. It came to mind when I was reading this piece by Will E. Young, who was a student journalist at Liberty University. What moxie this kid had, and has. It’ll stand him in good stead as he journeys onward.\n\n• Some names? I have a new young colleague named Chris Tremoglie — Three Wives. I said, “Ah, a bigamist!” This week, I got a letter from a man named Cinquemani. I said, “Thank you, my five-handed friend!” (He replied, “That would have made Grandpa smile.”)\n\nAs regular readers know, I’m fond of names, and always interested in them, and I bet these two names have very good stories behind them, unknown to us moderns.\n\n• Every day, I hear talk of “privilege.” And, almost always, people mean the material. If I were the exhorting type, I would exhort all parents: Make your children “privileged” — with good books, good music, good games, good humor, sound morals, and, above all, real love.\n\n• I saw a photo the other day and thought — and said — “Magazine-worthy.” It was snapped by our Molly Powell — National Review’s Molly Powell — who lives in New Hampshire. With her permission, I share it with you.\n\nA bit of New Hampshire on a late afternoon, with bee balm and daylilies gracing the stage:", "description": "On Russia, Iran, the U.S., decency, wine, a photo, and more.", "authors": ["Jay Nordlinger", "Mairead Mcardle", "Jonah Goldberg", "David French", "Matthew Continetti", "Jack Crowe", "Tobias Hoonhout", "Kyle Smith", "Rich Lowry", "Read More"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2019/07/alexei-navalny-supporters.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-07-31"}