{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/22/trump-doles-out-45-million-white-helmets-syria", "downloaded_at": "2019-10-23 10:01:15.604940+00:00", "title": "Trump doles out $4.5 million to 'White Helmets' in Syria", "language": "en", "text": "President Trump authorized $4.5 million in direct support Tuesday to the Syrian Civilian Defense, the white-helmeted volunteers who offer medical assistance and conduct search-and-rescue missions in war-torn Syria.\n\nWhite House press secretary Stephanie Grisham said the group has saved 115,000 people during the eight-year civil war in Syria, including many ethnic and religious minorities.\n\n“The United States encourages our allies and partners to join us in our support for the SCD and in our efforts to protect civilians, religious and ethnic minorities, and other innocent victims of the Syrian conflict,” she said.\n\nMr. Trump disbursed funding as he grapples with the fallout of his decision to withdraw dozens of U.S. troops from a buffer zone along the Turkish-Syrian border. Critics say it allowed Turkish President Recep Tayyip Erdogan to overrun Kurdish fighters who helped the U.S. rout the Islamic State.\n\nMr. Erdogan has vowed to continue his operation if “YPG” fighters — Kurdish militants he considers to be aligned with terrorists — do not clear out of a safe zone outlined by the U.S.-negotiated cease-fire that expires Tuesday.\n\nSome of Mr. Trump’s closest allies fear he blundered with his initial withdrawal of troops.\n\nEvangelical supporters are worried that Christians and other religious minorities will lose their foothold in this corner of the Middle East, though Mr. Trump is moving to alleviate their concerns by offering financial support to relief groups.\n\nEDITOR’S NOTE: A previous version of this story misstated the amount authorized by President Trump.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "President Trump authorized $4.5 million in direct support Tuesday to the Syrian Civilian Defense, the white-helmeted volunteers who offer medical assistance and conduct search-and-rescue missions in war-torn Syria.", "authors": ["The Washington Times Http", "Tom Howell Jr."], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/07/28/syria_98308_c0-52-2500-1510_s1200x700.jpg?c899525f5b4583ee9f1f266f98dee6e32f98fe15", "published_at": "2019-10-22"}