{"pub": "blastingnews", "url": "https://us.blastingnews.com/sports/2019/10/nfl-week-6-new-england-patriots-continue-winning-chiefs-lose-002999245.html", "downloaded_at": "2019-10-14 23:18:44.534226+00:00", "title": "NFL Week 6: New England Patriots continue winning, Chiefs lose", "language": "en", "text": "NFL Week 6 clearly outlines the situation. The New England Patriots continue their journey. Kansas City Chiefs lost to Houston Rockets. San Francisco 49ers are exceptional and undefeated, and they stopped the Los Angeles Rams at home. Seattle Seahawks and the New Orleans Saints also deserve a well-deserved win, while the Dallas Cowboys lost to New York Jets. New England Patriots beat the New York Giants.\n\nThis is the fifth success, also determined by the weak attack of NY. Barkley is missing on the field, while Michel and Edelman have distinguished themselves for the Pats.\n\nThe Panthers, despite the absence of the star Cam Newton, won against Tampa Bay Buccaneers, who made mistakes. The latest NFL news, as Sporting News reports, concerns the fall of the Chiefs against the Texans. It's the second time in a row.\n\nMinnesota Vikings dominated the first half against Philadelphia Eagles, holding out even in the second half. In this match, Diggs and Cousins distinguished themselves. New Orleans played well won against New Orleans Saints. The victory of the 49ers was a good one, and they remain undefeated. Los Angeles Chargers failed to overtake the Pittsburgh Steelers. Other notable NFL victories include the New York Jets and Baltimore Ravens.\n\nDon’t miss the latest news! Click on the topic you interest most. We'll keep you updated with all the news you shouldn't miss. NFL\n\nNFL, San Francisco reborn\n\nSan Francisco, in yesterday's NFL game, gave an outstanding result. The team was playing at the Super Bowl finalists' house. The team distinguished itself for its exceptional defense, against which the Los Angeles Rams could not do anything. The players were at their best, especially Bosa. Even the Niners were exceptional. Kittle stood out on the field, especially for his running and his game full of quality and quantity.\n\nKittle has proved to be a guarantee, a complete and robust player, able to handle the ball in any way and with confidence. The team is balanced and strong.\n\nPanthers: fourth victory in the NBA without Cam Newton\n\nThe Chiefs had an alarming second knockout. Kansas City is in trouble after a thriving year, and coach Ray has to try to trust the team again. The victory of the Panthers was beautiful, even without the presence of Cam Newton, replaced by Allen, who played reliably and cleanly.\n\nAn unexpected victory came from the Jets who were able to field Darnold again after he recovered from his Mononucleosis. Despite previously missed wins, they won against the Cowboys. The Saints have not stopped despite the lack of star Brees. The high-level team showed on the field that they can defend themselves. So, the sun is shining on the bay. Stay tuned for the next NFL news.", "description": "San Francisco 49ers stopped the Los Angeles Rams at home, Panthers beat Buccaneers.", "authors": ["Zeegee Cecilio", "Oliver Vandervoort", "Read More On The Same Topic Susan B.", "'Days Of Our Lives' Spoilers", "Xander", "Sarah Connected", "Gabi Desperate", "Nba China Games", "Nets Vs Lakers", "Injury For Irvine"], "top_image": "https://staticr1.blastingcdn.com/media/photogallery/2019/10/14/os/b_1200x630/nfl-panthers-surprise-in-tottenham-house-sport-pesa-official-twitter-profile_2338957.jpg", "published_at": "2019-10-14"}