{"pub": "businessinsider", "url": "https://businessinsider.com/how-to-keep-samsung-galaxy-s10-screen-on", "downloaded_at": "2019-09-26 21:06:53.867401+00:00", "title": "How to keep your Samsung Galaxy S10's screen on all the time, or whenever you're looking at it", "language": "en", "text": "Your Samsung Galaxy S10 has several options to keep its screen on for extended periods of time.\n\nEven when the Galaxy S10 is sleeping, you can set the \"Always On Display\" to constantly show the time, date, and important notification icons.\n\nA feature called \"Smart stay\" can also keep the screen on whenever you're looking at it, so it won't turn off while you're reading the screen.\n\nVisit Business Insider's homepage for more stories.\n\nYour Samsung Galaxy S10 has a couple of features that can keep its screen on. A feature called \"Always On Display\" will show details like the time, date, and various notification icons even when the phone is sleeping.\n\nBy default, \"Always On Display\" isn't really on all the time, but you can easily change that in your settings.\n\nIn addition, you can change the behavior of the main S10 display so the screen remains on as long as you're looking at it — this is an incredibly convenient feature, since many phones shut off the display even while you're looking at it, since it's unaware you're still paying attention.\n\nCheck out the products mentioned in this article:\n\nHow to keep the Samsung Galaxy S10's screen on all the time with 'Always On Display'\n\n1. Start the Settings app.\n\n2. Tap \"Lock screen.\"\n\nYou can configure the \"Always On Display\" in the Lock Screen settings. Dave Johnson/Business Insider\n\n3. Tap \"Always On Display.\"\n\n4. If the \"Always On Display\" isn't turned on, swipe the button to the right to enable the feature.\n\nTurn on \"Always On Display\" to see date, time, and other info on the screen when the phone is asleep. Dave Johnson/Business Insider\n\n5. Tap \"Display Mode.\"\n\n6. Choose your desired setting. If you want the \"Always On Display\" to appear all the time, tap \"Show Always.\"\n\nHow to keep the Samsung Galaxy S10 screen on when you're looking at it\n\n1. Start the Settings app.\n\n2. Tap \"Advanced features.\"\n\n3. Tap \"Motion and gestures.\"\n\n4. Turn on \"Smart stay\" by swiping the button to the right.\n\n\"Smart stay\" uses the phone's camera to know whether you're looking at it or not. Dave Johnson/Business Insider\n\nNow, the screen won't turn off prematurely — it will stay on whenever you are looking at it.\n\nRelated coverage from How To Do Everything: Tech:", "description": "To keep your Samsung Galaxy S10 screen on all the time, you can activate the \"Always On Display\" in your settings, or turn on \"Smart stay.\"", "authors": ["Dave Johnson"], "top_image": "https://image.businessinsider.com/5d8d0b0f2e22af09e724e96c?width=1200&format=jpeg", "published_at": "2019-09-26"}