{"pub": "marketwatch", "url": "https://marketwatch.com/story/trump-and-turkey-just-made-the-us-fight-against-terrorists-even-harder-2019-10-09", "downloaded_at": "2019-10-09 18:27:59.708415+00:00", "title": "Trump and Turkey just made the U.S. fight against terrorists even harder", "language": "en", "text": "President Trump is making an enormous gamble: After speaking with Turkish President Recep Tayyip Erdoğan on Oct. 6, he announced that United States military forces in northeastern Syria would stand aside and let the Turkish military take territory now controlled by Syrian Kurds.\n\nThe odds are this will make preventing ISIS’s comeback harder, not easier.\n\nRead: Erdogan orders Turkish military offensive in northern Syria in wake of U.S. troop pullout\n\nNortheastern Syria is controlled by the Syrian Democratic Forces (SDF), whose military wing, the People’s Protection Forces (YPG), did the lion’s share of the fighting and dying in 2017-2019 to defeat ISIS in Syria, just as Iraqi forces, including the Peshmerga, fought and died to expel ISIS from Iraq. The United States and an international coalition, including Turkey, provided air power, intelligence and support that was essential for ISIS’s defeat. This was a shared victory.\n\nTurkey is right that the SDF is associated with the Kurdistan Workers Party (PKK). The PKK has carried out a decades-long insurgency against the Turkish government in which tens of thousands have died. The United States designated the PKK a Foreign Terrorist Organization in 1997, and both the United States and, eventually, Europe helped Turkey against the PKK by targeting financing and recruitment efforts.\n\nHowever, the United States made a strategic choice, first by the Obama administration in 2016, then reaffirmed by the Trump administration in early 2017, to work with the SDF as the fastest way to defeat ISIS and liberate the territory ISIS took from Syria and Iraq in 2013-2014.\n\nBy all accounts, ISIS has now gone underground and is working to stage another comeback. ISIS’s predecessor, al Qaeda in Iraq (AQI), was defeated in 2010-2011. ISIS re-emerged three years later, in 2013-2014, stronger than AQI was. In 2019, ISIS preserved enough of its fighters to start to intimidate local civilians into allowing ISIS to operate.\n\nCounterterrorism experts have seen this before. Terrorists’ best hope is to establish a safe haven from which they can regroup, plan, use the internet, recruit, train and organize. This is the lesson from terrorist safe havens in Afghanistan before 9/11, al Qaeda in Iraq (AQI), al Qaeda in the Arabian Peninsula, ISIS and other terrorists in Libya, and both al Qaeda and ISIS in Syria. All of these safe havens were used to target the United States or American citizens overseas.\n\nISIS will rebuild its safe haven in northeast Syria before Syria can build an effective counter-ISIS presence there.\n\nPresident Trump’s decision is a gamble for two reasons. First, he is counting on “Turkey, Europe, Syria, Iran, Iraq, Russia and the Kurds” to “figure the situation out.”\n\nSome of these countries, especially Syria, have proved totally unreliable in the past. Syria let thousands of AQI fighters transit its borders and airports in 2003-2011. Regime survival is always Syria’s top priority, and the Assad regime has higher priorities than security in the northeast. ISIS will rebuild its safe haven in northeast Syria before Syria can build an effective counter-ISIS presence there.\n\nTurkey has improved its Syria border security considerably in recent years, but Turkey wants to control a zone along the border, not all SDF-controlled territory. ISIS will still be able to get some percentage of operators and materiel across the border. A Turkish-SDF conflict will cause the YPG to prioritize defending Syrian Kurds from Turkish forces. The SDF—even apart from feeling betrayed by President Trump—won’t prioritize going after ISIS remnants or guarding captured ISIS fighters.\n\nResting U.S. security on other countries also looks like a gamble. Iraq is facing its own internal challenges. The Europeans are likely to leave Syria. Iran and Russia have a history of inflaming the Syrian conflict, not dampening it.\n\nThe President’s second gamble is that the United States will be able to stop ISIS terrorists before they get to the United States. “Crush ISIS again if they come anywhere near us” works if ISIS plans a conventional military attack, but that is not what ISIS would do. Stopping ISIS terrorist attacks requires more than just the Department of Homeland Security stopping terrorists from boarding planes, or the FBI arresting terrorists after they enter.\n\nTrump’s “Crush ISIS if they come near us” logic doesn’t recognize that ISIS can radicalize new fighters over the internet.\n\nSuccess requires collecting intelligence overseas, often provided by our foreign partners like Turkey. Threatening Turkey with economic ruin is not likely to help the next time Turkey decides whether to share a sensitive source with the United States.\n\nThe “Crush ISIS if they come near us” logic also doesn’t recognize that ISIS can radicalize new fighters over the internet to carry out attacks like Orlando in 2016, which killed 49 people.\n\nNo country, especially the United States, wants to be embroiled in “forever wars,” but it requires a better understanding of how wars end, especially against groups like ISIS and al Qaeda. President Trump’s desire that other countries do more to fight terrorists echoes statements of previous administrations of both parties who ended up disappointed for a reason.\n\nHistory has shown that defeating terrorists militarily, alone, has never been enough. Other governments need to be strong enough to prevent terrorists from re-establishing safe havens. Military efforts need to partner with adequately resourced civilian efforts, here and overseas, to strengthen aviation security, border security and civilian counterterrorism capabilities. Our goal should be to disrupt terrorist plots as far from the United States as possible.\n\nTo prevent ISIS from re-establishing its safe haven in Syria, we can support military efforts, civilian efforts or both. But doing neither is surely a gamble.\n\nThomas S. Warrick is a nonresident senior fellow with the Middle East programs at the Atlantic Council. Before joining the Atlantic Council, from August 2008 to June 2019 he was the Deputy Assistant Secretary for Counterterrorism Policy at the U.S. Department of Homeland Security (DHS) and a career member of the Senior Executive Service.", "description": "Counterterrorism experts have seen this before.", "authors": ["Thomas S. Warrick"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS964_syria__ZG_20191009120152.jpg", "published_at": "2019-10-09"}