{"pub": "abcnews", "url": "https://abcnews.go.com/Health/man-charged-dwi-body-producing-alcohol/story?id=66582571", "downloaded_at": "2019-10-28 23:33:06.135766+00:00", "title": "Man charged with DWI, but his body was producing its own alcohol", "language": "en", "text": "When a North Carolina man in his late 40s was arrested for driving while intoxicated in 2011, his family, friends and doctors refused to believe he hadn't been drinking.\n\nThe reality turned out to be far weirder than lying about a DWI.\n\nIn 2015, doctors diagnosed the man with auto-brewery syndrome, also known as gut fermentation syndrome, a rare medical condition in which affected people's bodies convert carbohydrates into alcohol.\n\nIn other words, when people with auto-brewery syndrome eat pizza or pasta, they ferment that food in their guts and turn it into alcohol, raising their blood-alcohol levels without ever drinking a drop.\n\nJack Andersen/Getty Images\n\nThe man's case was reported by doctors at the Richmond University Medical Center in New York and published in the journal BMJ Open Gastroenterology.\n\n\"Patients with this condition become inebriated and suffer all the medical and social implications of alcoholism, including arrest for drunken driving,\" the authors wrote.\n\nDoctors believe the man's condition was triggered by antibiotics he took for a thumb injury in 2011.\n\nSoon afterwards, the man said, his personality changed. He had bouts of depression, suffered from \"brain fog\" and became uncharacteristically aggressive. He was treated with anti-depressants and anti-anxiety medications before his DWI a few years later.\n\nFinally, a relative who had read about a similar case in Ohio purchased a breathalyzer and convinced him to visit Ohio for laboratory testing and treatment.\n\nAfter years of anti-fungal therapy and a probiotics regimen under the direction of his doctors, the patient has been asymptomatic for about one-and-a-half years.\n\nAlthough case studies on auto-brewery syndrome date back to the 1970s, there aren't currently any established guidelines for diagnosing or treating people with the condition. Though rare, auto-brewery syndrome is probably underdiagnosed and is more common in people with diabetes, obesity and Crohn's disease.", "description": "Doctors diagnosed the man with auto-brewery syndrome, a rare medical condition in which affected people's bodies convert carbohydrates into alcohol.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Health/beer-gty-jt-191028_hpMain_16x9_992.jpg", "published_at": "2019-10-28"}