{"pub": "npr", "title": "National Review: The Trouble With TSA", "url": "https://npr.org/2010/11/24/131564357/national-review-the-trouble-with-tsa", "language": "en", "published_at": "2010-11-24", "downloaded_at": "2019-09-02 07:27:52.907635+00:00", "text": "National Review: The Trouble With TSA\n\ntoggle caption John Moore/Getty Images\n\nAndrew C. McCarthy, a senior fellow at the National Review Institute, is the author, most recently, of The Grand Jihad: How Islam and the Left Sabotage America.\n\nMore years ago than I care to remember, I prosecuted some violent drug dealers. During the trial, we got some reliable information that their associates were transferring contraband to them in prison, and they were smuggling some of it into the courtroom. Federal marshals were rightly concerned that some items could be used as weapons.\n\nWe tailored a response to the circumstances. As any reasonable person would appreciate, that meant weighing the danger involved, the adequacy of various protective steps to counter the danger, the rights of people who would be affected, and the fact that our main concern was security — not collecting evidence in anticipation of bringing charges.\n\nI agreed that the indicted defendants should be subjected to daily strip searches upon leaving and returning to prison — including cavity searches, since body cavities are notorious repositories of makeshift weapons and narcotics. This was appropriate not only because of the threat involved but because of that threat coupled with significant facts about the people involved. The indicted defendants had violent histories that included threats to kill witnesses and an attempt to murder an undercover police officer. They were in custody despite not yet having been convicted, because a judge had denied bail based on evidence that they posed a danger to the community. We had now caught them with items they were not supposed to have in the courtroom.\n\nPeople in prison are subject to highly intrusive searches; they have no expectation of privacy. To be sure, the government is given more latitude — relieved of the need to show probable cause for the search — because it is promoting safety, not trying to develop a prosecutable case. But what makes the search appropriate is the record of the people involved, not the abstract possibility of violence. A savage act is always possible. If that is all it took to justify gross infringements of liberty, such infringements would always and everywhere be justified. An intrusive search is reasonable, or not, based on what the people involved have done to prompt it, not simply because life is fraught with peril.\n\nThe remaining people coming to the courtroom each day presented circumstances very different from the defendants. There were the defendants' family members and associates, other trial participants (jurors, court reporters, the judge, and the lawyers for each side), some members of the press, and spectators (ordinary people who would come by to watch trials).\n\nThe family members and associates were neither charged nor in custody, though some were suspected of collusion in the drug dealers' activities. Like all members of the public, they had had to pass through cursory courthouse screening upon entering the building. This included the presentation of identification and passing through a magnetometer — which, while far from perfect in ferreting out weapons, does detect guns, knives, and other metal objects. So we opted against any further physical searches absent some new indication that one of these folks possessed an item that could be used as a weapon. Still, the marshals were instructed to watch them carefully in the courtroom and keep them physically separated from the defendants — if contact was sought for some reason, defense lawyers could ask the judge for permission and the judge could then work with the marshals to set the ground rules.\n\nAs for the remaining trial attendees, all of whom had also gone through the screening process, there was no reason for added concern. Of course the threat situation dictated that the marshals remain on their toes. But a pro can easily do that without hassling everyone in sight. And that's exactly how these pros handled it: smoothly, realistically balancing the risk of something terrible being attempted against the huge unlikelihood of its being attempted by the vast majority of the people in the courtroom.\n\nImagine, though, if the marshals had said: \"Let's just cavity-search everyone — after all, you never know.\"\n\nIn essence, that is exactly what the Transportation Security Administration is doing with its perverse — in every sense of the word — security procedures. At a number of the nation's most heavily trafficked airports, in the midst of the Thanksgiving holiday, when people routinely fly in order to be with faraway loved ones, the TSA is saying: Let's suspect everyone of being a terrorist, no matter how groundless the suspicion, and move immediately to the most intrusive search procedures in our toolkit.\n\nThis is a rank violation of the Fourth Amendment. In my long-ago trial, it would have been thought obscene to make violent drug traffickers the measure of every person's privacy rights. There would have to be something more — some concrete basis for suspicion, particular to the person. Yet, the TSA is making the savage jihadist its lodestar for navigating the threat it audaciously presumes to be posed by every American.\n\nAt its website, the TSA cheerily informs us that its unnerving electro-strip searches, and the alternative you get to choose — having TSA officials grope the breasts, buttocks, and genitalia of yourself, your spouse, your children, your elderly parents, etc. — pass constitutional muster as \"administrative searches.\" Under this line of Fourth Amendment jurisprudence, the agency insists, a warrantless search \"is valid...if it is 'no more intrusive or intensive than necessary, in light of current technology, to detect weapons or explosives'\" — a proposition for which it quotes a Ninth Circuit case from 37 years ago (United States v. Davis). If you don't like it, the TSA concludes, you \"may avoid the search by electing not to fly.\" How very reasonable!\n\nSpeaking of reasonableness, the Supreme Court reaffirmed in the 2001 Knights case that it is \"the touchstone of the Fourth Amendment.\" Determining whether a search is reasonable requires an assessment of \"all the circumstances\" — not just the potential threat to public safety and the state of modern technology, but the intrusiveness of the proposed search, its likely effectiveness, and the degree of privacy Americans may reasonably expect from their government under the circumstances.\n\nThe threat to public safety from the terrorist use of aircraft is obviously great, but no greater than countless other scenarios. We don't unleash the government to commit what would otherwise be sexual assault and the infliction of emotional distress on nothing more than an abstract threat. The threat of terrorism is ubiquitous. On the other side of the equation, the search tactics at issue would scarcely be more of a privacy invasion if agents were stripping passengers and performing cavity searches.\n\nWorse, the tactics are ineffective. TSA chief John Pistole admits that he intentionally delayed notifying the public about the new procedures because he didn't want to tip off the terrorists. Of course, tipping them off would be irrelevant if the procedures were an ironclad protection, but they are easily evaded — by those with an interest in evading them — through choosing airports where they are not in place, using explosive components they cannot detect, and hiding components in body cavities against which the procedures are ineffective.\n\nMost significant, the government is ignoring the most material element: discrimination, based on characteristics known to be associated with the threat. Discrimination has been turned into a dirty word, but we want our law-enforcement, intelligence, and security services to employ it sensibly. If everyone is a suspect, then no one is a suspect — meaning the real threats get no real attention.\n\nWhat justified the different gradations of Fourth Amendment treatment in my courtroom years ago were the very different circumstances of each category of person. To be sure, everyone would have been safer from being attacked by a weapon if everyone had been cavity-searched. But what sense would it make if, to get to this purportedly optimal safety level, everyone had been attacked by the authorities — forcibly subjected to a humiliating search without having done a blessed thing to provoke suspicion? And is it really an answer to say, \"Well, if you don't want to endure it, stay out of the public's courthouses\"?\n\nWhether it's the case of the Christmas bomber, the Fort Hood bomber, or the World Trade Center bombers from 17 years ago, our government, again and again, has consciously avoided the common denominators of Islamist ideology and anti-American animus that should have raised caution signs. We have knowingly granted entry into our country, and often into our institutions, to people who have meant us harm. The officials whose job it is to protect us have decided to protect Muslim sensibilities by treating every American as a suspected mass-murderer. To feel better about themselves, to inoculate themselves from bogus charges of racism and Islamophobia, they have decided to mortify everyone.\n\nMany things may be said about this approach, but reasonable is not one of them. I'd start with unconstitutional.", "description": "Andrew C. McCarthy of the National Review argues that with controversial new rules for flying, TSA has decided to treat all passengers as terrorists, rather than root out those who seek to do harm.", "authors": ["Andrew C. Mccarthy"], "top_image": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400"}