{"pub": "mirror", "url": "https://mirror.co.uk/news/world-news/mum-begs-donations-after-142mph-20644770", "downloaded_at": "2019-10-18 01:10:06.471217+00:00", "title": "Mum begs for donations after 142mph police chase with sobbing daughter in back", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA young girl sobbed in the back seat as her motoring mum raced to the potentially deadly speeds of 142mph.\n\nMargarita Tomovska decided to put the pedal to the metal when cops started chasing her in Illawarra, Australia.\n\nAfter 10 minutes of racing through the town's streets the 28-year-old decided to pull over.\n\nPolice officers were horrified to discover that Tomovska's daughter was sitting in an unrestrained car seat in the back.\n\nThe three-year-old was crying following the horrific ride, The Daily Star reported.\n\n(Image: margaritatomovska/Instagram)\n\nAt New South Wales District Court the single mum was locked up for 18 months for the high speed chase.\n\nThe night before the case Tomovska went onto social media to boast about the £8,000 outfit she had bought for the trial.\n\nShe has previous when it comes to causing a stir.\n\nTomovaka ruffled feathers at a previous hearing she was photographed arriving at court dressed in jewelled Gucci sunglasses and Christian Louboutin shoes.\n\nShe set up a Go Fund Me page begging for cash because she could not get a job post-arrest, and sticking two fingers up at the police.\n\n\"I know you all don't know me but I'm actually not a bad person,\" she wrote.\n\n(Image: margaritatomovska/Instagram)\n\n(Image: margaritatomovska/Instagram)\n\n\"These dogs are liers [sic] and have something against me for no reason as I'm sure I'm not the only one.\n\n\"Due to the b******t that they have made up about me… they have restricted my rights to see my daughter.”\n\nPleading for help, she signed off: “It's about time we fight back. Enough is enough!\n\n“Thank you in advance for your support.”\n\nTomovska was found guilty of speeding on November 13.\n\nHer defence lawyer had claimed she had been under duress from Christopher King who sat beside her in the Mercedes.\n\nHe is such a large man that police officers needed two sets of handcuffs to restrain him.\n\n(Image: margaritatomovska/Instagram)\n\nMagistrate Susan McGowan rejected the lawyer's arguments and said: \"Would a reasonable person act as she did with a little girl in the back of the car? I don’t think they would.”\n\nPolice prosecutor Sergeant Amelia Wall told the court there was videos on Instagram of her car during the police chase.\n\nThe lawyer added: \"Playing the victim on a GoFundMe page titled ‘Fight Raptor’ trying to raise $100,000 for her own use, all the while gloating on social media about spending thousands on clothing and accessories.\n\n“Reprehensible and deplorable. Ms Tomovska needs to be denounced.\n\n“The risk she posed to the community far outweighs any need she has for licence.”", "description": "Margarita Tomovska led the police on a hair-raising chase through the streets of llawarra in Australia", "authors": ["Milo Boyd", "Image", "Margaritatomovska Instagram"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20644892.ece/ALTERNATES/s1200/0_EXCLUSIVE-Mercedes-Mum-who-led-cops-on-a-high-speed-chase-in-her-$260k-car-is-begging-for-$100.jpg", "published_at": "2019-10-17"}