{"pub": "investing.com", "url": "https://investing.com/news/stock-market-news/asian-markets-mixed-chinese-stocks-rise-as-beijing-willing-to-buy-more-us-goods-1987502", "downloaded_at": "2019-09-27 03:56:41.685884+00:00", "title": "Asian Markets Mixed; Chinese Stocks Rise as Beijing Willing to Buy More U.S. Goods", "language": "en", "text": "© Reuters.\n\nInvesting.com - Asian markets were mixed in morning trade on Friday. Chinese stocks rose following reports that Beijing’s top diplomat said the country is willing to purchase more U.S.-made goods.\n\nWang Yi, China’s foreign minister, said in response to questions from Reuters that trade discussions could yield results if both China and the U.S. \"take more enthusiastic measures\" to show goodwill and reduce \"pessimistic language\" in their trade dispute.\n\nHe said Washington has shown goodwill by easing tariffs on a range of Chinese products.\n\n\"And so, (on) the Chinese side, we are willing to buy more products that are needed by the Chinese market,\" Wang said.\n\n\"We hope both sides can take more enthusiastic measures, reduce pessimistic language and actions. If everyone does this, talks will not only resume, but will proceed and yield results.\"\n\nChina’s Shanghai Composite and the gained 0.1% and 0.5% respectively by 10:50 PM ET (02:50 GMT).\n\nOfficials from both sides will resume talks in October in Washington.\n\nOn the data front, the National Bureau of Statistics reported on Friday that China’s were down 2% in August from a year earlier. That compared with a 2.6% gain in July.\n\nJapan’s Nikkei 225 fell 1.3%. Data showed that the Tokyo’s grew 0.5% in September from a year earlier, slowing from a 0.7% rise in August.\n\nToyota Motor Corp (T: ) made headlines after the Nikkei newspaper reported today that the company is planning to increase its shares in Subaru Corp (T: ) to more than 20% from the current 17%.\n\nThe investment could cost more than 70 billion yen ($650 million), the newspaper said without citing sources.\n\nSouth Korea’s KOSPI was down 1.0%.\n\nDown under, Australia’s ASX 200 gained 0.4%.", "description": "Asian Markets Mixed; Chinese Stocks Rise as Beijing Willing to Buy More U.S. Goods", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB810CQ_L.jpg", "published_at": "2019-09-27"}