{"pub": "reuters", "url": "https://reuters.com/article/us-france-protests-yellow/french-police-break-up-yellow-vest-and-black-bloc-protests-in-paris-idUSKBN1W609X", "downloaded_at": "2019-09-21 15:47:20.206796+00:00", "title": "French police break up 'yellow vest' and 'black bloc' protests in Paris", "language": "en", "text": "PARIS (Reuters) - French police fired tear gas and made over a hundred arrests in Paris on Saturday as they dispersed “yellow vest” protesters attempting unauthorized rallies and black-masked demonstrators who disrupted a climate march.\n\nPolice had made 137 arrests in Paris by mid-afternoon and had pushed back around one hundred protesters who gathered on the Champs-Elysees shopping avenue, the Paris police prefecture said.\n\nThe government deployed a massive police presence as it feared yellow-vest supporters and other activists, including “black bloc” anarchists, would take advantage of authorized protests over climate change and pension reform.\n\nSome 7,500 police were mobilized, several districts including the Champs-Elysees were made out-of-bounds for protests, and over 30 metro stations closed.\n\nThe climate rally saw sporadic confrontations between police and masked demonstrators who had infiltrated the march.\n\nGroups wearing black clothing associated with the so-called black bloc anarchist movement formed barricades, set fire to bins and a motorbike, and threw paint over the front of a bank.\n\nSimilar skirmishes occurred later in the march with the prefecture again attributing violence to black blocs. Police responded with tear gas.\n\nThe violence tarnished an otherwise peaceful march that brought thousands of people, including some yellow vests, onto the streets, a day after marches in Paris and other cities worldwide to demand government action against climate change.\n\nDemonstrators carried slogans like “End oil now” and “End of the world” while some held carnival effigies, including one of President Emmanuel Macron wearing a crown marked “King of bla-bla”.\n\nThe yellow vests, named after motorists’ high-visibility jackets, were holding a 45th consecutive Saturday of action. The movement emerged late last year, triggered by fuel tax rises and swelling into a revolt against Macron’s style of government.\n\nSome of their protests have been marked by rioting, partly blamed on black blocs.\n\nSlideshow (6 Images)\n\nA separate march on Saturday was called by the FO trade union to contest the government’s planned overhaul of France’s retirement system. The proposed reform prompted a strike by metro workers on Sept. 13, shutting most of the underground network.\n\nThe authorities have also been taking precautions so protesters do not disrupt an annual heritage event this weekend that gives the public special access to many historic sites.\n\nSome sites like the Arc de Triomphe monument have been closed while others like the Elysee presidential palace have required visitors to register in advance.", "description": "French police fired tear gas and made over a hundred arrests in Paris on Saturday as they dispersed \"yellow vest\" protesters attempting unauthorized rallies and black-masked demonstrators who disrupted a climate march.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190921&t=2&i=1432317124&w=1200&r=LYNXMPEF8K0B6", "published_at": "2019-09-21"}