{"pub": "townhall", "url": "https://townhall.com/columnists/rossmarchand/2019/09/23/taxpayers-and-consumers-need-beware-of-costly-green-trojan-horses-n2553507", "downloaded_at": "2019-09-23 17:22:51.440000+00:00", "title": "Taxpayers and Consumers Need Beware of Costly, 'Green' Trojan Horses", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nSome 3,000 years ago in Anatolia, the Greeks laying siege to Troy had a brilliant idea: sneak some men into the city through a wooden horse masked as a gift and then the gates could be opened for the rest of the army. The Trojan Horse may have been a genius military maneuver, but it shouldn’t translate to expensive and unnecessary public policy.\n\nDemocrats will have to learn this the hard way as they attempt to sneak their disastrous “Green New Deal” proposal through Congress bit by bit through other, vital pieces of legislation. In particular, rumors abound that lawmakers will try to resurrect and expand the Electric Vehicle (EV) tax credit via must-pass bills circulating through Congress. For the sake of consumers and taxpayers across America, members of Congress should stop trying to sneak costly Trojan Horses into unrelated legislation. Americans deserve a transparent lawmaking process that produces policies to the benefit of all.\n\nTo radical members of Congress tirelessly championing a Green New Deal, trillions of dollars in new spending and costly “renewable” mandates aren’t enough. The EV credit, which has promised buyers an up-to-$7,500 reprieve off their tax bills for nearly a decade, is quickly being phased out. Carmakers are only allowed to benefit from this misguided policy for their first 200,000 EVs sold, and top producers such as GM and Tesla sped past the limit in 2018. A vocal minority of pro-EV (at any cost) lawmakers are pushing to keep the tax credit and expand it beyond the 200,000-car limit.\n\nThere’s just one problem: these lawmakers never stopped to consider the redistributive consequences of their preferred policy. In 2018, Dr. Wayne Winegarden of the Pacific Research Institute calculated that nearly 80 percent of EV tax credit beneficiaries are from households raking in six-figures. The finding is unsurprising, jiving with many economists and policymakers’ suspicion that the tax credit has merely benefited wealthier-than-average Americans who would’ve purchased these fashionable cars anyway.\n\nMeanwhile, the average American household pays dearly for these stealth EV subsidies. A 2018 study by NERA Economic Consulting found that U.S. households on the whole would stand to lose nearly $100 billion over the next 15 years if the credit was expanded and the cap lifted. That works out to more than $700 in increased costs per household, a high cost to pay for a projected 1 percent decline in gasoline demand.\n\nCarbon emissions would barely budge, and a turbocharged EV tax credit would actually wreak havoc on the environment (and labor rights). The World Economic Forum notes, “raw materials needed for batteries are extracted at a high human and environmental toll. This includes, for example, child labour, health and safety hazards in informal work, poverty and pollution. Second, a recycling challenge looms over the eleven million tonnes of spent lithium-ion batteries forecast to be discarded by 2030, with few systems in place to enable reuse and recycling in a circular economy for batteries.”\n\nPlenty of the inputs needed for electric batteries come from beleaguered, battle-torn countries such as the Democratic Republic of Congo, where mineral extraction work makes Middle Eastern oil drilling look like a walk in the park. Having investigated these Congolese mines, the Washington Post reports, “[M]ining activity exposes local communities to levels of toxic metals that appear to be linked to ailments that include breathing problems and birth defects, health officials say.” And, according to Reuters, “Demand for electric vehicles is fueling a rise in child labor in cobalt mines in the Democratic Republic of Congo.”\n\nEV-centric policies go against every principle that progressives purportedly stand for. Electric vehicle production relies on awful labor and environmental practices and federal financing relies on regressive wealth redistribution. But the urge to appear “green” to donors and (some) constituents trumps all, and lawmakers appear to have little problem subverting transparency to jam these misguided policies through Congress. Fortunately, such attempts will prove far less effective than the Greeks’ Trojan Horse gambit. Concerned Americans are standing guard at the gate, ready to call out misguided policies ruminating in smoke-filled rooms. The Green New Deal sure didn’t look pretty in the daylight, and it won’t fare any better incognito.\n\nRoss Marchand is the director of policy for the Taxpayers Protection Alliance.", "description": "Some 3,000 years ago in Anatolia, the Greeks laying siege .09/23/2019 13:20:27PM EST.", "authors": ["Ross Marchand", "Katie Pavlich", "Cortney O'Brien", "Guy Benson"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2017/291/fc01ab88-af7a-4423-9a96-724ee19fa37b.jpg", "published_at": "2019-09-23"}