{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7596823/Former-candidate-Apprentice-accuses-producers-sabotaging-tasks.html", "downloaded_at": "2019-10-22 13:49:04.749698+00:00", "title": "Former The Apprentice contestant says producers 'sabotage' tasks", "language": "en", "text": "A former candidate on BBC's The Apprentice, who quit in week four of series 12 because she found it 'overwhelming', has accused the show of 'emotional abuse at the expense of 'entertainment''.\n\nAleksandra King, 41, from Buckinghamshire, who signed an NDA 'protecting The Apprentice brand' before taking part, recently wrote a letter to MPs for the Digital, Culture, Media and Sport committee's inquiry into reality TV, with a series of allegations against the hit reality show.\n\nAmong her claims is that the show's production team would deliberately sabotage tasks, 'creating great TV while potentially ruining the reputation, career and even life of the affected candidate(s)'.\n\nShe has also stated that candidates are given limited communication with the outside world and even other contestants, in order to keep emotions for the camera.\n\nAleksandra King, 41, (pictured) who quit BBC's The Apprentice in week four of series 12, has written a letter to MPs accusing the producers of 'sabotaging' candidates\n\nAleksandra (pictured with fellow contestants and Alan Sugar) claims candidates were given limited sleep and irregular meals\n\n'Candidates were also not allowed to speak each other for long periods of times, sometimes up to a couple of hours, so that feelings and emotions were bottled up and stored for the cameras,' she explained.\n\n'I found this ‘silencing’ very uncomfortable, unnatural and debilitating. When we were finally allowed to ‘speak’, emotions soared which caused horrible fighting, swearing and in some cases even very aggressive behaviour.'\n\nShe also claimed that she was only allowed one 10-minute phone call a week with her family, supervised by a member of the production team.\n\nAleksandra who appeared on The Apprentice in 2016, detailed in her letter fury over not being able to speak out when her sweet-making task was tampered with.\n\nAleksandra (pictured) claims she was at 'the end of' her line when she made the decision to leave the show, following a task with cracked sweets\n\nShe claims to have checked the stock's quality and quantities before leaving it in 'perfect condition' with a group of production staff.\n\n'Upon returning to our stock we were shocked to see that not only was there stock missing but that our candy sticks were also cracked,' she wrote.\n\nThe former candidate says she was put in an embarrassing position of having to continue with the damaged stock, knowing that millions of viewers would assume it was down to her incompetence.\n\nShe continued: 'I was conscious this would damage my reputation and addressed it with production at the time stating that I know what they did and that I wasn't going to allow it. There was however not much I could do at the time'.\n\nProducer's have responded to the allegations of sabotage, denying that they tampered with tasks.\n\nThe mother-of-three, also claimed that candidates are given limited time to sleep - as little as four hours a night - and made to wait hours between meals, which could end up being just a small sandwich.\n\nAleksandra (pictured) claims she wants to prevent future candidates from becoming 'victims of emotional abuse at the expense of 'entertainment''\n\nUnable to discuss the 'true goings on' due to legal threats, Aleksandra said that she was at 'the end of my line' when she made the decision to leave the show.\n\nA spokesperson for The Apprentice said:\n\nA spokesperson for The Apprentice said: 'We represent candidates in a fair and balanced light, and everything seen on screen is an accurate portrayal of events.\n\n'We have rules and guidelines for each task to ensure that tasks are fairly executed for each team. These rules are not a form of sabotage, but instead ensure that there is a level playing field for all candidates to complete the task.\n\n'The wellbeing of the candidates that take part in The Apprentice is of paramount importance, and we have a thorough and robust duty of care protocol in place which includes an experienced network of support for all candidates before, during and after filming.'\n\nAleksandra concluded her letter with the claim that she hopes to support the committee in 'ensuring that future candidates do not become victims of emotional abuse at the expense of 'entertainment''.\n\nA number of reality TV shows have been criticised in recent months for how they treat their cast, following the death of Jeremy Kyle guest Steve Dymond, and Love Island stars Mike Thalassitis and Sophie Gradon.", "description": "Aleksandra King, 41, from Buckinghamshire, who quit The Apprentice in week four of series 12, has written a letter to MPs listing a number of allegations against the show.", "authors": ["Latoya Gayle For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/16/19997618-0-image-a-24_1571672097043.jpg", "published_at": "2019-10-21"}