{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7621383/Strictlys-Catherine-Tyldesley-admits-body-confidence-low-show.html", "downloaded_at": "2019-10-28 13:45:55.495519+00:00", "title": "Strictly's Catherine Tyldesley admits her body confidence was 'beyond low' before the show", "language": "en", "text": "She was the fifth celebrity to leave Strictly Come Dancing after a controversial judges' vote on Sunday night.\n\nBut despite her shock exit, Catherine Tyldesley has praised the BBC show for giving her her confidence back.\n\nWriting an emotional message on Instagram hours after viewers saw her leave the competition, the former Coronation Street star admitted her body confidence was 'beyond low' before she took to the dance floor.\n\nGrateful: Catherine Tyldesley, who was voted off the show on Sunday, has praised Strictly Come Dancing and her partner Johannes Radebe for giving her her confidence back\n\nSharing a photo of herself crying with her professional dance partner Johannes Radebe after finding out their fate, Catherine told fans she was grateful for her time on the show.\n\n'When I started my journey my confidence was low,' the actress explained. 'My belief in what I could achieve on the show was extremely low. The expectations on my humble body - beyond low.'\n\nThanking Johannes, she continued: 'What Johannes gave me was priceless Confidence ,Belief, Love- and Laughter beyond words!'\n\nEmotional: Writing on Instagram, the former Coronation Street star admitted her body confidence was 'beyond low' before she took to the dance floor\n\nConfidence: 'When I started my journey my confidence was low,' the actress explained. 'My belief in what I could achieve on the show was extremely low'\n\n'This man is a gift to the world. If there were more people like him the world would be spectacular (with shed loads of!) He taught me how to walk in high heels, he taught me how to ‘own it’... he taught me to love and appreciate what my body could achieve.'\n\n'I’m often low on body confidence- but I’m so proud of the limits that I’ve thoroughly pushed on this wonderful journey. I did it for me.'\n\nCatherine, who is mum to son Alfie, three, added that she was inspired by other mothers, declaring: 'I also did it for the hundreds of mums out there who felt they’d lost a little bit of themselves, the women out there who’d become negative about their body. The women who found it hard to look in the mirror and love what they saw.'\n\nClose friends: Thanking Johannes, she continued: 'What Johannes gave me was priceless Confidence ,Belief, Love- and Laughter beyond words!'\n\n'I’m proud of my body and my mind for getting me through this wonderful but incredibly tough experience. Push your limits ladies and be grateful for everything you’re wonderful body can achieve. ‘Dance like NOBODY is watching’.'\n\nCatherine and Johannes were voted out of Strictly on Sunday, after losing the dance off to BBC presenter Mike Bushell and his partner Katya Jones.\n\nCatherine and Johannes had to perform their Cha Cha once again at the end of the show's Halloween Week, after scraping the bottom of the leaderboard with a score of 24 out of a possible 40.\n\nMotherhood: Catherine, who is mum to son Alfie, three, added that she was inspired by other mothers who may have felt they'd 'lost themselves'\n\nJudge Shirley Ballas cast the deciding vote that sent her home, but Catherine remained positive, as she said of Johannes: 'He’s like my best friend… Just the opportunity to work with amazing people and get critiqued off amazing people.\n\n'I never thought I’d say this, I’m going to keep it up because I fell in love with it! I’ve loved every second, this man has changed my life!'\n\nSpeaking to host Tess Daly, Johannes said: 'The beautiful thing is that I need to thank Strictly Come Dancing for the opportunity…\n\n'Most of all, I want to say thank you to this woman. She has been a light for me. Thank you for accepting me for who I am and for showing me joy every day.'", "description": "Writing an emotional message on Instagram hours after viewers saw her leave the competition, the former Coronation Street star admitted her body confidence was 'beyond low'.", "authors": ["Joanna Crawley For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/10/20274470-0-image-a-43_1572258609403.jpg", "published_at": "2019-10-28"}