{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/katie-price-leaving-country-again-20578498", "downloaded_at": "2019-10-14 23:27:33.440735+00:00", "title": "Katie Price leaving the country again despite facing bankruptcy and homelessness by Christmas", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nKatie Price has revealed on social media that she is leaving the country later this week - despite facing bankruptcy and homlessness.\n\nThe former glamour model, 41, shared her plans by taking to her Instagram stories in order find out if any of her 2.1 million followers could apply a weft of hair extensions for her - ahead of her departure on Thursday.\n\nExplaining what she wanted doing, the mother-of-five penned: \"Anybody that does a full head of weaves with my hair plaited underneath please message ASAP as going away for a TV show Thursday.\"\n\nThe busty star did not reveal which show she is taking part in or where the location is.\n\nIt comes after Katie is facing bankruptcy by Christmas after allegedly failing to pay back her spiralling debts.\n\nThe star had taken out an individual voluntary arrangement (IVA) 12 months ago and was supposed to be paying off £12,000 a month to her various creditors.\n\n(Image: Tim P. Whitby/Getty Images)\n\nBut the TV star allegedly failed to satisfy the terms of her debt plan and last month a bankruptcy charge was laid on her West Sussex mansion.\n\nToday at the Insolvency and Companies Court, Judge Sally Barber ordered Price to be served with a draft petition notice within seven days.\n\nShe will then have to return to the same court next month to hear whether she will be made bankrupt.\n\nMr Taylor from JMW Solicitors told the judge he had been in email contact with Price in the last two and a bit weeks, but she had failed to attend an appointment with her creditors.\n\n(Image: officialkatieprice/Instagram)\n\n\"Technically it’s not an adjournment so I'm extending time,\" said Judge Barber.\n\n\"Service will be effective on the expiry of seven days of completion of such sending of the email and such posting.\n\n\"Once you've done both, service will be effective on the expiry of seven days.\n\n(Image: Brett D. Cove / Splash News)\n\n(Image: Youtube)\n\n\"I also extend the time for hearing the bankruptcy petition - I think six weeks.\"\n\nPrice will return to the insolvency court on on November 27.\n\nA spokesman for HMRC, which is believed to be one of Katie's creditors, said they would not comment on individual cases.\n\nIn recent months, Katie has splurged on holidays abroad, home renovation projects and multiple rounds of plastic surgery, which she hinted she was getting for a reduced rate or for free in exchange for Instagram exposure of the clinic in question.", "description": "The former glamour model is set to jet off on Thursday even though she faces bankruptcy", "authors": ["Sara-Aisha Kent", "Image", "Tim P. Whitby Getty Images", "Officialkatieprice Instagram", "Brett D. Cove", "Splash News", "Youtube"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20575566.ece/ALTERNATES/s1200/1_The-National-Television-Awards-2018.jpg", "published_at": "2019-10-14"}