{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7621895/FBI-NYPD-warn-ISIS-target-NYC-marathon.html", "downloaded_at": "2019-10-29 00:20:39.581669+00:00", "title": "FBI and NYPD warn ISIS could target the NYC marathon", "language": "en", "text": "The FBI and NYPD are warning that ISIS could target the New York City Marathon next weekend in the wake of the killing of the terror group's leader Abu Bakr al-Baghdadi.\n\nAuthorities, including the FBI, NYPD and Homeland Security, issued a joint threat assessment on Friday - prior to Baghdadi's death - for the upcoming New York City Marathon.\n\nThe warning specifically mentioned the terror group and detailed how ISIS sympathizers have been recently posting propaganda urging attacks in New York, ABC News reports.\n\nThe FBI and NYPD are warning that ISIS could target the New York City Marathon next weekend in the wake of the killing of the terror group's leader Abu Bakr al-Baghdadi\n\nU.S. authorities warned that the sympathizers were posting about stabbing onlookers on the street and running over people with a van.\n\nDailyMail.com has contacted the NYPD about their increased security efforts ahead of the marathon on Sunday, which draws in more than 50,000 runners.\n\nThe FBI is currently investigating more than 1,000 cases of ISIS suspects in the U.S. alone.\n\nDespite Baghdadi's death in Syria on Saturday night in a raid carried out by American forces, authorities have warned that the militant group still remains a threat, including in the U.S.\n\nThe key to the ISIS is its 'kill where you are' ethos, encouraging a far-flung network of followers, including those in the United States, to commit violence however and wherever they can.\n\nArmed police look on before the start of last year's New York City Marathon. The FBI and NYPD are warning that ISIS could target the New York City Marathon next weekend\n\nAbu Bakr al-Baghdadi died on Saturday after detonating his own suicide vest during the targeted raid on his lair in Syria's Idlib province\n\nThat jihadist message is likely to live on even with the death of Baghdadi.\n\nIt is that global reach that makes ISIS a continuing worry, including for U.S. officials seeking to protect the homeland.\n\nBaghdadi served as a direct inspiration for extremists in the United States, where multiple jihadists in the last five years invoked his name as they carried out deadly acts of violence.\n\nOmar Mateen, the gunman who in 2016 killed 49 people inside an Orlando, Florida nightclub, pledged allegiance to Baghdadi during a 911 call in which he identified himself as an Islamic soldier.\n\nMonths earlier, Tashfeen Malik, who along with her husband killed 14 people at a San Bernardino, California, holiday party, took to Facebook after her massacre was already underway to declare her support for Baghdadi.", "description": "Authorities, including the FBI, NYPD and Homeland Security, issued a joint threat assessment on Friday - prior to Abu Bakr al-Baghdadi's death - for the upcoming New York City Marathon.", "authors": ["Emily Crane For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/15/20281168-0-image-a-24_1572275606401.jpg", "published_at": "2019-10-28"}