{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7578135/U-S-edges-China-race-fund-Bougainville-independence-vote.html", "downloaded_at": "2019-10-16 03:56:26.916997+00:00", "title": "U.S. edges China out of race to fund Bougainville...", "language": "en", "text": "By Jonathan Barrett\n\nSYDNEY, Oct 16 (Reuters) - The United States and its Pacific allies have plugged a funding gap that endangered next month's independence referendum in Papua New Guinea (PNG)'s region of Bougainville, in a strategic move that also sidelined China, two sources told Reuters.\n\nWestern nations are looking to rein in China's influence in the increasingly contested Pacific, where it has recently drawn away two of Taiwan's allies, Kiribati and the Solomon Islands, triggering a strong rebuke from the United States.\n\nThe vote in PNG's autonomous region of Bougainville, formerly the site of a bloody civil conflict, will run from Nov. 23 to Dec. 7, and could trigger separation negotiations to create a new nation in the strategic waters of the Pacific.\n\nTwo sources with direct knowledge of the arrangements in Bougainville told Reuters China was not blocked from helping fund the referendum, but neither was it invited to contribute when the shortfall emerged.\n\n\"It's just that the invitation never arrived, or, rather, was never sent,\" one source said.\n\nThe second source said the West wanted to limit China's engagement with what could soon be the world's newest nation, strategically located in waters separating Asia and the Americas.\n\nChina's Foreign Ministry did not immediately respond to questions from Reuters.\n\nThe funding shortfall emerged early this year amid preparations, overseen by former Irish Prime Minister Bertie Ahern, to register the votes of 300,000 people, most of them spread over the main island of Bougainville, nearby Buka, and other outlying islands.\n\nThe United States, along with Australia, New Zealand and Japan, helped plug the funding gap of 7.1 million kina ($2 million), according to a breakdown of funding arrangements provided to Reuters by the Bougainville Referendum Commission.\n\nPNG is the biggest contributor, setting aside 18.7 million kina ($5.4 million). The referendum commission did not respond to questions why China, a major financier to PNG and the region, did not contribute.\n\nBougainville was regarded as a strategic location during World War Two, hosting several naval aircraft bases of the occupying imperial Japanese army.\n\nIts referendum is part of a peace process negotiated at the end of a decade-long conflict in 1998 largely focused on how to allocate profit from the now shuttered Panguna gold and copper mine, then run by a forerunner of Rio Tinto .\n\nThere was also discord over the environmental impact of the mining operations.\n\nThe conflict between Bougainville's rebel guerrilla army and PNG forces killed as many as 20,000, the worst violence in the region known as Oceania since the Second World War.\n\nSince the conflict, there has been little development in the resource-rich region, the former economic powerhouse of PNG.\n\nWhile the referendum is expected to overwhelmingly back independence, Australian think tank the Lowy Institute says, there is uncertainty over how an independent Bougainville could fund itself, as it now relies on support from PNG.\n\nThe final step would be a vote in parliament after separation terms are agreed.\n\n\"The outcome of the referendum will have to be firstly ratified by the Papua New Guinea national parliament,\" Wera Mori, the commerce and industry minister, told Reuters in an interview. \"It would be subjected to a negotiated outcome.\" ($1=3.4904 kinas)\n\n(Reporting by Jonathan Barrett in Sydney; Additional reporting by Catherine Cadell in Beijing; Editing by Clarence Fernandez)", "description": "By Jonathan BarrettSYDNEY, Oct 16 (Reuters) - The United States and its Pacific  allies have plugged a funding gap that endangered next month's  independence...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-16"}