{"pub": "independent", "url": "https://independent.co.uk/independentminds/long-reads/testaments-magaret-atwood-dystopian-fiction-future-book-a9094531.html", "downloaded_at": "2019-09-09 00:34:23.233585+00:00", "title": "The Testaments: What does our future look like according to dystopian fiction?", "language": "en", "text": "The Testaments, the long-awaited sequel to Margaret Atwood’s 1985 novel The Handmaid’s Tale, is finally here – and has never been more timely.\n\nSet 15 years after the first book, The Testaments once again delves into the world of Gilead – an ultra-conservative, Christian fundamentalist United States of America, where women’s rights have been stamped out, rebellion is dealt with in brutal fashion, but where life can be good… so long as you’re a straight, white male.\n\nThere has been renewed interest in The Handmaid’s Tale since the TV adaptation and expansion of the novel, which recently concluded its third series on Channel 4. Since Donald Trump took office, many people have suggested his divisive policies are eerie reflections of what Atwood presented 34 years ago – so much so that protesters against Trump’s administration have adopted the red cloak and white bonnet uniform of the handmaids in Atwood’s vision.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIn 1985, when The Handmaid’s Tale was published, it was literary dystopian science fiction. It was a future we might have wandered into, had we not been a bit cleverer than that. She posits a vicious coup in which an ultra-right-wing regime takes control and immediately begins dismantling people’s rights.\n\nA fertility crisis means that women with childbearing capabilities become handmaids, forced to endure ritual rape at the hands of the leaders of the new order, participated in by their wives. Other women become domestic staff, little more than slaves. And those handmaids who do bear children are forcibly parted from their babies, which are given to the ruling elite.\n\nThe main character in the book is called Offred – from “of Fred”, meaning she is literally the property of the new republic high-up to whom she has been assigned. Her former identity is stripped away: she becomes a mere branded chattel.\n\nAtwood’s original novel did indeed have its seeds in the reality of 1985, when Ronald Reagan was president, the Christian right was on the rise, and there was much backlash against hard-won women’s rights, including that to abortion.\n\nThe expectation was that things would get better. And yet here we are in 2019, where women’s reproductive rights are under attack in the US, where the children of refugees and immigrants at America’s border are forcibly torn from their parents’ arms and locked in cages, where the #MeToo movement pulled back the veil on systematic abuse of women by men in positions of power.\n\nOf course, Atwood was by no means the first author to tackle the idea of a dystopian future, and she won’t be the last. Over the past century, many writers have presented bleak future visions – a sign at a fork in the road, warning us to head in the right direction. But how many times have we heeded them, and how many times have we ended up in the nightmarish dystopias dredged from the imaginations of authors?\n\nShape Created with Sketch. The 25 best books by women Show all 25 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The 25 best books by women 1/25 Pride and Prejudice – Jane Austen Austen remains one of history’s greatest masters in two tricky literary fields: the world of romance and the world of social satire. Pride and Prejudice, then, sees her at the peak of her powers. Through the eyes of Elizabeth Bennet, her sharp-witted protagonist, we witness upper-class Regency England as both a dream and a farce. Not all is as it seems, and society betrays its holloweness when it deems that money should trump love. 2/25 Their Eyes Were Watching God - Zora Neale Hurston Despite the fact that Hurston was a key figure in the Harlem Renaissance of the 1920s and 1930s, Their Eyes Were Watching God was largely rejected by her peers. It was during the 1970s and 1980s that her novel was essentially rediscovered, with many contemporary black feminists heralding the genius of her work. The novel focuses on Janie Crawford, a black woman who refuses to give in to bitterness or sorrow, as she navigates three marriages and a life marked by poverty. It’s a story bursting with passion and soulfulness. 3/25 The Lottery and Other Stories – Shirley Jackson Jackson probed the darkest corners of the American psyche during the 1940s and 1950s, all thanks to her collections of ghost stories, including 1959’s The Haunting of Hill House, which was recently adapted into a Netflix series. With several novels and over 200 short stories for readers to get lost in, there are very few horror writers like her. That’s especially true when it comes to (arguably) her greatest work, 1948’s The Lottery, which traces a small town’s annual tradition to its sinister conclusion. 4/25 To Kill a Mockingbird – Harper Lee A Pulitzer Prize winner, To Kill a Mockingbird has carved its place in history. Its depiction of racial injustice in the American Deep South was startling frank for the 1960s, in a way that undeniably had a social impact at the time – it became an instant sensation and is now widely taught in American schools. Lee writes about the world’s cruelties with an honesty and compassion that still resonates, with the character of Atticus Finch becoming a enduring model of integrity for the legal profession. 5/25 Kindred - Octavia E Butler Butler was a key figure in sci-fi history, expanding the boundaries of what the genre could achieve and what it could come to represent. First published in 1979, the book still feels as fresh as ever in its first-person account of a young black writer, Dana, who through strange circumstances, finds herself travelling between her own reality and a pre-Civil War Maryland plantation. It’s through this unusual theme that Butler can explore the lasting trauma of America’s history on African-Americans today. 6/25 Jane Eyre – Charlotte Brontë Jane Eyre feels, in many ways, thoroughly modern today. Although originally published under the pen name “Currer Bell”, it feels likes a dive into the mind of Brontë herself. The story is told through a first-person narrative that feels so psychologically intimate, it’s as if she’s sharing the secrets of her own world with us. We follow Jane through her school years, all the way to her later employment by Mr Rochester, a tortured soul who she falls madly in love with, with many aspects of her journey reflecting elements of Brontë’s own life. 7/25 Half of a Yellow Sun – Chimamanda Ngozi Adichie Adichie, who was born in Nigeria, is considered one of the most original literary voices of her generation. You can see why this is when reading Half of a Yellow Sun, which depicts the brutality of the Nigerian Civil War of the late 1960s, as seen through four different perspectives: twin daughters of a wealthy businessman, a British citizen, a professor, and a houseboy. It’s history via an achingly human lens. 8/25 White Teeth – Zadie Smith Smith remains a modern titan of the British literary scene, thanks partially to White Teeth, which is considered one of the most sensational fiction debuts of all time, becoming an immediate bestseller and sweeping up multiple awards. It’s a tale of two men – Bangladeshi Samad Iqbal and Englishman Archie Jones – who become friends after being stationed together during WWII. Their return to London sees the book examine British post-war attitudes to those from formerly colonised countries, although Smith ensures the subject is approached with both heart and a sense of humour. 9/25 The Hour of the Star - Clarice Lispector Lispector was a literary innovator. The Hour of the Star, published posthumously in 1977, invents a narrator named Rodrigo SM, who in turns tells the story of Macabéa, a poor young woman who hails from Alagoas, where Lispector’s family first settled when they immigrated to Brazil. However, the way Rodrigo perceives Macabéa, and reckons with her story, itself creates a dialogue between the two characters, calling into question notions of identity and authorship. 10/25 Mrs Dalloway – Virginia Woolf One of literature’s sharpest minds and inspiration to the feminist movement in the 1970s, Woolf not only helped pioneer the use of the stream of consciousness as a narrative device, but utilised it to speak openly about sexuality, mental illness, and gender roles. The novel largely follows the inner thoughts of two characters, Clarissa Dalloway and Septimus Smith, one a high-society woman in post-WWI England and the other a veteran suffering from shell shock. 11/25 A Good Man Is Hard to Find and Other Stories – Flannery O’Connor O’Connor wrote hard stories for a hard world. Her unsentimental, sardonic use of the Southern Gothic style helped weave her own take on the parable, in which the morally weak often face violent, painful punishment for their misdeeds. That said, the door is always open for transformation and spiritual awakening by the story’s conclusion, with her work frequently confronting ideas of morality and ethics through the lens of her own Catholic faith. 12/25 Persepolis – Marjane Satrapi At times, it seems less like Persepolis is a story. Satrapi’s graphic novel, published in two volumes in 2000 and 2004, feels more like an invitation, as she takes our hand and leads us through her childhood and early adult years, so that we can see through the eyes of a curious, funny, smart young girl who must face the personal repercussions of war and religious extremism in Iran during and after the Islamic Revolution. It’s the political seen through the personal, but it’s always Satrapi’s own spirit that shines the brightest. 13/25 Frankenstein – Mary Shelley Many have now come to consider Shelley’s Frankenstein as the first pure work of science-fiction, with a central narrative driven a character’s exploration of a world beyond what we already know. Not only is it significant for its later influence on culture, but Shelley’s work, initially published anonymously, is astonishing in both its emotional vitality and its philosophical implications. It’s a work where we both feel the anguish of the misunderstood, while also reckoning with the concept of man’s unbridled power. 14/25 Beloved – Toni Morrison Beloved takes its inspiration from the true story of Margaret Garner, who escaped slavery in Kentucky in 1856 and fled to Ohio, a free state. However, the story itself focuses on a protagonist named Sethe, a former slave, whose home is haunted by a malevolent presence that she believes is her eldest daughter. It’s through this vivid sense of magical realism that Morrison can confront the unfathomable trauma that slavery has inflicted on the African-American collective memory. 15/25 The Handmaid’s Tale – Margaret Atwood Although the book has received increased attention thanks to Hulu’s critically acclaimed TV adaptation, it’s all thanks to the fierceness of Atwood’s critical analysis of gender politics. Her 1985 book, which imagines a near-future New England controlled by a totalitarian state, in which women are completely subjugated to men, has only become increasingly relevant – and prescient. Her work provides a continued reminder that it doesn’t take much for our world to slip into complete dystopia. 16/25 Middlemarch - George Eliot Mary Anne Evans, amongst other concerns, feared that her work, Middlemarch, would be dismissed entirely due to the notion that women’s writing was strictly light and romantic. And so, instead, it was published in eight instalments across 1871 and 1872 under the name George Eliot. The book is far from light; set in the fictitious Midlands town of Middlemarch, it follows a vast, sweeping narrative that encompasses subjects of religion, idealism, and political reform. 17/25 Little Fires Everywhere – Celeste Ng Ng writes about American suburbia with an astounding clarity, perhaps partially because she considers the act of writing about one’s hometown as a little like “writing about a relative”, with an attachment that perceives both their greatest attributes and their flaws. Little Fires Everywhere is her second novel to take place in Shaker Heights, Ohio, where she grew up, and focuses on a new arrival to the town, who sense of mystery disrupts its residents’s obsession with structure and rules. 18/25 The Bell Jar – Sylvia Plath Famous for its popularity with teenage girls, Plath’s work speaks to clearly to an adolescent precisely because it makes no attempt to sugar-coat the prospect of the entrance into adulthood. The book’s protagonist, Esther, a young woman attempting to establish herself in New York, feels more like a front for Plath to discuss her own experiences of struggling with mental health, especially in the context of the 1950s, when women’s concerns were so rarely paid attention to. There is an honesty to Esther’s frustration that has been a comfort to many. 19/25 My Brilliant Friend - Elena Ferrante My Brilliant Friend is only one part of Ferrante’s four-book series, known as the Neapolitan Novels. As the first chapter, it is, de facto, the most well known of the series, but it’s also an invitation to such raw intimacy that readers will be unable to resist delving into the rest. Ferrante serves as a pseudonym, allowing the books to illuminate with candor the friendship between two women, born in Naples in 1944, who try to find peace in a world of violence and misogyny. 20/25 The Age of Innocence – Edith Wharton Edith Wharton captures with vigour both the opulence and the suffocating claustrophobia of New York’s Gilded Age, as two future newlyweds – in every other way society’s perfect vision of man and woman – find their union disrupted by the arrival of a cousin shrouded in scandal. The Age of Innocence is a wistful, romantic novel that still succeeds in treating society’s hypocrisy with an acute sense of disdain. 21/25 The Color Purple – Alice Walker Marking a rare mastery of the epistolary novel, The Color Purple focuses on the experiences of black women living in the US South during the 1930s. Although it deals with themes of abuse and violence, the honesty in Walker’s voice is disarming in a way that opens us up to her protagonist’s journey towards self-realisation and personal freedom. It’s no wonder that the book’s continued relevance saw it both adapted into 1985 film, directed by Steven Spielberg, and a Broadway musical. 22/25 Rebecca – Daphne du Maurier Rebecca remains one the finest examples of Gothic literature, despite the fact that du Maurier wasn’t writing within the confines of some drafty Victorian castle; rather, she was examining the world of spirits during the interwar period. In its story of a woman whose whirlwind courtship with a widower turns sour when she becomes haunted by the lingering presence of her husband’s first wife, Rebecca is a book filled with suppressed desires, loss, and a looming sense of threat. 23/25 The God of Small Things - Arundhati Roy As Roy’s debut novel, it’s an extraordinary first outing. Roy contrasts the innocence of childhood, as seen in the book’s protagonists, fraternal twins Rahel and Estha, with the rising political turmoil in Kerala during 1969. It also features a non-sequential approach to narrative, with the novel intricately weaving between the twins’s reunion in 1993 and the lengthy flashback and sidetracks, all painted with a massive sense of scope and imagination. 24/25 Murder on the Orient Express - Agatha Christie We may know every twist and turn of Christie’s best works by now, but there’s still a frisson to how intricately and confidently she pulls the rug from underneath readers. Murder on the Orient Express still feels like her most enthralling work, as famed Belgian detective Hercule Poirot finds himself in the midst of a murder scene, after his train is blocked by the heavy snowfall and a passenger is found dead, making the rest of those on board all instant suspects. 25/25 The Tale of Genji – Murasaki Shikibu The oldest book on this list, this classic of Japanese literature was written by Shikibu, a noblewoman and lady-in-waiting, in the early 11th century. Although the original manuscript no longer exists, what’s been passed down to us now was translated initially into modern Japanese, with English translations being published at a later time. An account of the life Hikaru Genji, the son of the emperor, it’s a masterful work of psychological portraiture, which offers a rare glimpse into the cultural customs of post-classical Japan. 1/25 Pride and Prejudice – Jane Austen Austen remains one of history’s greatest masters in two tricky literary fields: the world of romance and the world of social satire. Pride and Prejudice, then, sees her at the peak of her powers. Through the eyes of Elizabeth Bennet, her sharp-witted protagonist, we witness upper-class Regency England as both a dream and a farce. Not all is as it seems, and society betrays its holloweness when it deems that money should trump love. 2/25 Their Eyes Were Watching God - Zora Neale Hurston Despite the fact that Hurston was a key figure in the Harlem Renaissance of the 1920s and 1930s, Their Eyes Were Watching God was largely rejected by her peers. It was during the 1970s and 1980s that her novel was essentially rediscovered, with many contemporary black feminists heralding the genius of her work. The novel focuses on Janie Crawford, a black woman who refuses to give in to bitterness or sorrow, as she navigates three marriages and a life marked by poverty. It’s a story bursting with passion and soulfulness. 3/25 The Lottery and Other Stories – Shirley Jackson Jackson probed the darkest corners of the American psyche during the 1940s and 1950s, all thanks to her collections of ghost stories, including 1959’s The Haunting of Hill House, which was recently adapted into a Netflix series. With several novels and over 200 short stories for readers to get lost in, there are very few horror writers like her. That’s especially true when it comes to (arguably) her greatest work, 1948’s The Lottery, which traces a small town’s annual tradition to its sinister conclusion. 4/25 To Kill a Mockingbird – Harper Lee A Pulitzer Prize winner, To Kill a Mockingbird has carved its place in history. Its depiction of racial injustice in the American Deep South was startling frank for the 1960s, in a way that undeniably had a social impact at the time – it became an instant sensation and is now widely taught in American schools. Lee writes about the world’s cruelties with an honesty and compassion that still resonates, with the character of Atticus Finch becoming a enduring model of integrity for the legal profession. 5/25 Kindred - Octavia E Butler Butler was a key figure in sci-fi history, expanding the boundaries of what the genre could achieve and what it could come to represent. First published in 1979, the book still feels as fresh as ever in its first-person account of a young black writer, Dana, who through strange circumstances, finds herself travelling between her own reality and a pre-Civil War Maryland plantation. It’s through this unusual theme that Butler can explore the lasting trauma of America’s history on African-Americans today. 6/25 Jane Eyre – Charlotte Brontë Jane Eyre feels, in many ways, thoroughly modern today. Although originally published under the pen name “Currer Bell”, it feels likes a dive into the mind of Brontë herself. The story is told through a first-person narrative that feels so psychologically intimate, it’s as if she’s sharing the secrets of her own world with us. We follow Jane through her school years, all the way to her later employment by Mr Rochester, a tortured soul who she falls madly in love with, with many aspects of her journey reflecting elements of Brontë’s own life. 7/25 Half of a Yellow Sun – Chimamanda Ngozi Adichie Adichie, who was born in Nigeria, is considered one of the most original literary voices of her generation. You can see why this is when reading Half of a Yellow Sun, which depicts the brutality of the Nigerian Civil War of the late 1960s, as seen through four different perspectives: twin daughters of a wealthy businessman, a British citizen, a professor, and a houseboy. It’s history via an achingly human lens. 8/25 White Teeth – Zadie Smith Smith remains a modern titan of the British literary scene, thanks partially to White Teeth, which is considered one of the most sensational fiction debuts of all time, becoming an immediate bestseller and sweeping up multiple awards. It’s a tale of two men – Bangladeshi Samad Iqbal and Englishman Archie Jones – who become friends after being stationed together during WWII. Their return to London sees the book examine British post-war attitudes to those from formerly colonised countries, although Smith ensures the subject is approached with both heart and a sense of humour. 9/25 The Hour of the Star - Clarice Lispector Lispector was a literary innovator. The Hour of the Star, published posthumously in 1977, invents a narrator named Rodrigo SM, who in turns tells the story of Macabéa, a poor young woman who hails from Alagoas, where Lispector’s family first settled when they immigrated to Brazil. However, the way Rodrigo perceives Macabéa, and reckons with her story, itself creates a dialogue between the two characters, calling into question notions of identity and authorship. 10/25 Mrs Dalloway – Virginia Woolf One of literature’s sharpest minds and inspiration to the feminist movement in the 1970s, Woolf not only helped pioneer the use of the stream of consciousness as a narrative device, but utilised it to speak openly about sexuality, mental illness, and gender roles. The novel largely follows the inner thoughts of two characters, Clarissa Dalloway and Septimus Smith, one a high-society woman in post-WWI England and the other a veteran suffering from shell shock. 11/25 A Good Man Is Hard to Find and Other Stories – Flannery O’Connor O’Connor wrote hard stories for a hard world. Her unsentimental, sardonic use of the Southern Gothic style helped weave her own take on the parable, in which the morally weak often face violent, painful punishment for their misdeeds. That said, the door is always open for transformation and spiritual awakening by the story’s conclusion, with her work frequently confronting ideas of morality and ethics through the lens of her own Catholic faith. 12/25 Persepolis – Marjane Satrapi At times, it seems less like Persepolis is a story. Satrapi’s graphic novel, published in two volumes in 2000 and 2004, feels more like an invitation, as she takes our hand and leads us through her childhood and early adult years, so that we can see through the eyes of a curious, funny, smart young girl who must face the personal repercussions of war and religious extremism in Iran during and after the Islamic Revolution. It’s the political seen through the personal, but it’s always Satrapi’s own spirit that shines the brightest. 13/25 Frankenstein – Mary Shelley Many have now come to consider Shelley’s Frankenstein as the first pure work of science-fiction, with a central narrative driven a character’s exploration of a world beyond what we already know. Not only is it significant for its later influence on culture, but Shelley’s work, initially published anonymously, is astonishing in both its emotional vitality and its philosophical implications. It’s a work where we both feel the anguish of the misunderstood, while also reckoning with the concept of man’s unbridled power. 14/25 Beloved – Toni Morrison Beloved takes its inspiration from the true story of Margaret Garner, who escaped slavery in Kentucky in 1856 and fled to Ohio, a free state. However, the story itself focuses on a protagonist named Sethe, a former slave, whose home is haunted by a malevolent presence that she believes is her eldest daughter. It’s through this vivid sense of magical realism that Morrison can confront the unfathomable trauma that slavery has inflicted on the African-American collective memory. 15/25 The Handmaid’s Tale – Margaret Atwood Although the book has received increased attention thanks to Hulu’s critically acclaimed TV adaptation, it’s all thanks to the fierceness of Atwood’s critical analysis of gender politics. Her 1985 book, which imagines a near-future New England controlled by a totalitarian state, in which women are completely subjugated to men, has only become increasingly relevant – and prescient. Her work provides a continued reminder that it doesn’t take much for our world to slip into complete dystopia. 16/25 Middlemarch - George Eliot Mary Anne Evans, amongst other concerns, feared that her work, Middlemarch, would be dismissed entirely due to the notion that women’s writing was strictly light and romantic. And so, instead, it was published in eight instalments across 1871 and 1872 under the name George Eliot. The book is far from light; set in the fictitious Midlands town of Middlemarch, it follows a vast, sweeping narrative that encompasses subjects of religion, idealism, and political reform. 17/25 Little Fires Everywhere – Celeste Ng Ng writes about American suburbia with an astounding clarity, perhaps partially because she considers the act of writing about one’s hometown as a little like “writing about a relative”, with an attachment that perceives both their greatest attributes and their flaws. Little Fires Everywhere is her second novel to take place in Shaker Heights, Ohio, where she grew up, and focuses on a new arrival to the town, who sense of mystery disrupts its residents’s obsession with structure and rules. 18/25 The Bell Jar – Sylvia Plath Famous for its popularity with teenage girls, Plath’s work speaks to clearly to an adolescent precisely because it makes no attempt to sugar-coat the prospect of the entrance into adulthood. The book’s protagonist, Esther, a young woman attempting to establish herself in New York, feels more like a front for Plath to discuss her own experiences of struggling with mental health, especially in the context of the 1950s, when women’s concerns were so rarely paid attention to. There is an honesty to Esther’s frustration that has been a comfort to many. 19/25 My Brilliant Friend - Elena Ferrante My Brilliant Friend is only one part of Ferrante’s four-book series, known as the Neapolitan Novels. As the first chapter, it is, de facto, the most well known of the series, but it’s also an invitation to such raw intimacy that readers will be unable to resist delving into the rest. Ferrante serves as a pseudonym, allowing the books to illuminate with candor the friendship between two women, born in Naples in 1944, who try to find peace in a world of violence and misogyny. 20/25 The Age of Innocence – Edith Wharton Edith Wharton captures with vigour both the opulence and the suffocating claustrophobia of New York’s Gilded Age, as two future newlyweds – in every other way society’s perfect vision of man and woman – find their union disrupted by the arrival of a cousin shrouded in scandal. The Age of Innocence is a wistful, romantic novel that still succeeds in treating society’s hypocrisy with an acute sense of disdain. 21/25 The Color Purple – Alice Walker Marking a rare mastery of the epistolary novel, The Color Purple focuses on the experiences of black women living in the US South during the 1930s. Although it deals with themes of abuse and violence, the honesty in Walker’s voice is disarming in a way that opens us up to her protagonist’s journey towards self-realisation and personal freedom. It’s no wonder that the book’s continued relevance saw it both adapted into 1985 film, directed by Steven Spielberg, and a Broadway musical. 22/25 Rebecca – Daphne du Maurier Rebecca remains one the finest examples of Gothic literature, despite the fact that du Maurier wasn’t writing within the confines of some drafty Victorian castle; rather, she was examining the world of spirits during the interwar period. In its story of a woman whose whirlwind courtship with a widower turns sour when she becomes haunted by the lingering presence of her husband’s first wife, Rebecca is a book filled with suppressed desires, loss, and a looming sense of threat. 23/25 The God of Small Things - Arundhati Roy As Roy’s debut novel, it’s an extraordinary first outing. Roy contrasts the innocence of childhood, as seen in the book’s protagonists, fraternal twins Rahel and Estha, with the rising political turmoil in Kerala during 1969. It also features a non-sequential approach to narrative, with the novel intricately weaving between the twins’s reunion in 1993 and the lengthy flashback and sidetracks, all painted with a massive sense of scope and imagination. 24/25 Murder on the Orient Express - Agatha Christie We may know every twist and turn of Christie’s best works by now, but there’s still a frisson to how intricately and confidently she pulls the rug from underneath readers. Murder on the Orient Express still feels like her most enthralling work, as famed Belgian detective Hercule Poirot finds himself in the midst of a murder scene, after his train is blocked by the heavy snowfall and a passenger is found dead, making the rest of those on board all instant suspects. 25/25 The Tale of Genji – Murasaki Shikibu The oldest book on this list, this classic of Japanese literature was written by Shikibu, a noblewoman and lady-in-waiting, in the early 11th century. Although the original manuscript no longer exists, what’s been passed down to us now was translated initially into modern Japanese, with English translations being published at a later time. An account of the life Hikaru Genji, the son of the emperor, it’s a masterful work of psychological portraiture, which offers a rare glimpse into the cultural customs of post-classical Japan.\n\nNineteen Eighty-Four – George Orwell (1948)\n\nThe classic piece of dystopian fiction, Nineteen Eighty-Four has become a watchword for the all-powerful, omniscient surveillance state envisaged as Airstrip One by Orwell in the years after the Second World War. Its ever-present leader, Big Brother, gave his name to a voyeuristic TV show where the masses watched disparate individuals incarcerated together and only released at the whim of the public who tuned in to watch them every day. That sounds like something from the novel, but obviously it’s real life.\n\nNineteen Eighty-Four’s totalitarian state controlled everything down to people’s thoughts, where history is constantly revised to reflect ever-changing politics and diplomacy, where war is constantly waged – by the Ministry of Peace – against and beside constantly shifting allies and enemies, where grim, mass-market pornography is churned out to keep the workers mollified, where everyone is constantly watched by a network of screens and cameras and nothing is ever private. It’s a place where if you bombard someone with enough propaganda – and, failing that, torture them – then they will believe anything, even that two plus two equals five.\n\nThe parallels with our lives are so obvious as to hardly require explanation. We are watched wherever we go by CCTV cameras – there’s even facial recognition technology in place at King’s Cross. Reading this on a phone or laptop? Someone might well be watching you through the camera. And how much information does Facebook hold on you, exactly?\n\nThe Hunger Games – Suzanne Collins (2008)\n\nTwo sequels followed, and, of course, a massive movie franchise, which veered towards action, thrills and adventure. But there’s a lot in the original book to pick through as America becomes a deeply divided nation with the downtrodden proles of the outer districts digging coal and growing food to service the louche, rich, metropolitan elite in the Capitol.\n\nPlenty there to provide relevance for modern times, but the central concept of The Hunger Games, in which unwilling participants have to fight to the death to win a life of luxury and comfort, all before the greedy gaze of the Capitol’s denizens, conflates the last days of Rome with our contemporary obsession with increasingly cruel and emotionally brutal reality TV game shows.\n\nThe Drowned World – JG Ballard (1962)\n\nYou’d think, when a literary giant of the quality of JG Ballard was writing about climate change almost 60 years ago, we might have taken it a bit more seriously before now. Ballard’s future world posited an America dotted with tropical lagoons and a flooded, abandoned London.\n\nIt might be said that The Drowned World is more apocalyptic fiction than dystopian – dystopia suggests a totalitarian society like Orwell’s, sections of society beaten down and oppressed. But The Drowned World is no Mad Max wasteland; there is nominal society, still. Society that allowed the cataclysm to happen, just as we appear to be allowing it to happen to us right now.\n\nLast year the United Nations’ Intergovernmental Panel on Climate Change issued a stark warning: we have 12 years to save the planet. A dozen years to ensure that global warming does not rise about 1.5C. Beyond that, even half a degree, and we’ll see widespread flooding, droughts, poverty, extremes of heat and cold, and massive displacement of people.\n\nOh, and just for your information, that was nearly a year ago. So let’s call it 11 years to save the world.\n\nOryx and Crake – Margaret Atwood (2003)\n\nThe Handmaid’s Tale author turned her attention in the years after the millennium to a different sort of future, one that examined our relationship with science, what we could do with it, and just how far we were prepared to go.\n\nOryx and Crake is about what happens when science is not only unfettered by human conscience, but driven by profit-hungry corporations, specifically in the fields of genetic modification. Why have a chicken that runs around being stupid when you can breed one with no brain and lots and lots of breast meat? What would happen if all those old jokes were brought to life and you crossed a wolf with a dog? What if you spliced a pig and a human so you could have an endless supply of spare organs such as hearts and kidneys?\n\nIt’s a complex novel, that deals with complex issues. Science is indeed making great strides today towards those very goals. Massachusetts General Hospital and Harvard Medical School, for example, “grew” a heart from stem cells – which, we would think, is a good thing. But as Atwood tells us, what hurtling scientific progress needs is someone to look up from the microscope now and again and say, “Yes, we can do this... but should we?”\n\nThe Death of Grass – John Christopher (1956)\n\nChristopher was an English science fiction author who went on to write the young adult series The Tripods, but The Death of Grass (adapted for film as No Blade of Grass) was a much darker affair.\n\nAlso chilling is the speed with which the country devolves into savagery as the government’s unpreparedness means food, water and power rapidly run out. Makes you look forward to a no-deal Brexit, doesn’t it?\n\nAgain, it’s more apocalyptic than straight dystopian, but does offer us some interesting parallels with modern life. A virus that attacks rice crops devastates east Asia, causing a huge famine. When a strain of it is found in the UK, the government develops and deploys a new pesticide, which has the unfortunate result of mutating the virus and causes it to destroy not just rice crops but barley and wheat, plunging the country into anarchy.\n\nThere are some interesting and quite terrifying scenarios within the book. One is how governments take a sledgehammer to crack a nut – rather than breeding virus-resistant crops, they make a pesticide that worsens the situation. And as society gets out of control and the virus rages across the country, the officials draw up plans to drop hydrogens bomb on the major cities. Fanciful beyond belief, of course... until you remember it was just last week that Trump was talking about throwing nukes at hurricanes.\n\nAlso chilling is the speed with which the country devolves into savagery as the government’s unpreparedness means food, water and power rapidly run out. Makes you look forward to a no-deal Brexit, doesn’t it?\n\nThe Children of Men – PD James (1992)\n\nIn the middle of the 20th century, science fiction envisaged a future where the world was plagued by overpopulation, no doubt as a result of the post-Second World War baby boom. Harry Harrison’s 1966 novel Make Room! Make Room! was about such a situation, perhaps more famously filmed in 1973 as Soylent Green, in which the problem of how to feed an expanding population at a time of depleted resources and dying seas due to climate change is solved by providing mass-produced processed food such as the titular treat. Spoiler alert: Soylent Green is people.\n\nMore famous as a crime writer, PD James delved into dystopian fiction in 1992 by, like Atwood before her, going in the other direction and envisaging not a populating boom but a “baby bust” as rampaging infertility means the human race will probably die out not with a bang but a whimper.\n\nLast year, The Lancet published its annual Global Burden of Disease study which showed that out of 195 nations across the world, 91 of them now have fertility rates “below replacement levels” – which means that more people are dying than are being born. The 2018 worldwide fertility rate was 2.4 births per woman, down from around five in the 1960s, when Harrison wrote Make Room! Make Room!\n\nThe Machine Stops – EM Forster (1909)\n\nHere’s an interesting one, a rare excursion into dystopian fiction from the author of A Room with a View and Howard’s End. Some unspecified disaster means humanity has taken to living below the surface of the Earth. They live largely alone, in tiny apartments, and all their physical needs are met by the Machine, which provides food and water and keeps the lights on. Humanity’s social needs are met by the Machine as well, in a rather astonishing prediction of the internet and social media.\n\nEach human is connected via the Machine and encouraged to discuss and promote “ideas”, none of them the result of original thinking. Eventually, the humans forget they were the ones who created the Machine, and venerate it as a god. They become fearful of those who are still interested to go outside and investigate the Earth’s surface, suspicious of those who talk of connecting with nature. Anyone who questions or distrusts the Machine is threatened with “homelessness” – expulsion from the network. And just in case those parallels aren’t enough for you, the people are strongly encouraged to “like” what the strangers they connect with say to them on the system. Tweet that, why don’t you.\n\nNever Let Me Go – Kazuo Ishiguro (2005)\n\nWhere Oryx and Crake leaps into rampant genetic engineering with wild abandon, Never Let Me Go is more measured, genteel and ultimately creepy. The children of an isolated boarding school learn that they are clones, bred purely to be farmed for organs for sick “real” humans, ultimately dying young as their bodies are harvested to the point of exhaustion.\n\nClones have been a staple of science fiction for decades, but have never been as close to reality as they are now. In October 2018, it was announced that twin girls born in China were thought to be the world’s first gene-edited babies.\n\nThe girls were born via IVF but the embryos’ DNA was genetically manipulated via the use of Crispr technology – in this case, to modify genes to give resistance to the HIV virus.\n\nThere has been widespread international disquiet and criticism of the process, with doubt cast on whether the experiment was actually carried out or, conversely, suspicions that more modification might have been made in other tests.\n\nEither way, that particular genie is either out of the bottle, or very close to it, which could bring Ishiguro’s vision of bodies custom-bred to provide spare organs much nearer reality.\n\nNone of these novels has got everything exactly right. They might not precisely be the worlds we live in. But bear in mind: what is a dystopian future for some is actually a utopia for others. The men of Gilead and the decadent ruling classes of Panem are actually living their best lives. We shouldn’t just fear dystopian fiction coming true, we should fear the people who want it to.", "description": "The Testaments, the long-awaited sequel to Margaret Atwood’s 1985 novel The Handmaid’s Tale, is finally here – and has never been more timely.", "authors": ["David Barnett"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/06/14/The-Handmaids-Tale.jpg", "published_at": "2019-09-08"}