{"pub": "marketwatch", "url": "https://marketwatch.com/story/weekend-roundup-where-to-retire-on-5-million-outside-california-teslas-surprise-a-nobel-prize-and-biotech-stocks-2019-10-25", "downloaded_at": "2019-10-25 16:24:22.068976+00:00", "title": "Weekend roundup: Where to retire on $5 million, outside California | Tesla’s surprise | A Nobel Prize and biotech stocks", "language": "en", "text": "Catey Hill helps MarketWatch readers find retirement destinations that fit their specific wish lists. Most are looking for cheaper places to live. But now a reader with a net worth of $5 million wants someplace that isn’t stiflingly hot, has good health care and isn’t in California. She offered three suggestions, and hundreds of readers added their own recommendations. What’s yours?\n\nHere are more MarketWatch articles for good weekend reading about finances, investing and retirement.\n\nTesla does it again\n\nTesla TSLA, +5.45% surprised analysts with strong third-quarter earnings and cash flow, as its operating margins improved. But something similar happened a year ago, when it seemed Tesla had turned the corner. Then subsequent quarters were less rosy. Will history repeat? Here’s a sampling of opinion:\n\n• Tim Mullaney: Tesla’s road gets easier from here\n\n• Tae Kim at Barron’s: Don’t trust Tesla stock’s big move — here’s why\n\n• Vitaly Katsenelson: Tesla’s future might not be in Elon Musk’s hands\n\n• Nigam Arora: Tesla’s Musk awakens the bulls, but prudent investors should go slow\n\nA Nobel approach to selecting biotech stocks\n\nStocks in the biotechnology space are notoriously volatile — the results of drug trials can make or break companies, especially small ones. So Michael Brush looks to James Allison, a cancer-therapy researcher who was awarded the Nobel Prize, for long-term investments in the sector.\n\nFacts won’t win an argument\n\nWhy does someone continue to argue, even when you are absolutely sure of your facts? Eleanor Gordon-Smith suggests a different approach that involves understanding where the other person is coming from.\n\nHere’s where a successful hedge-fund manager thinks you should invest\n\nSilvia Ascarelli interviews Larry Hite, a money manager with an excellent performance record who is very excited about one particular area of the stock market.\n\nOpen enrollment season is almost here — consider doing this\n\nIf your employer provides health insurance, making this change can save you money now while giving you an opportunity to invest more for retirement.\n\nSchwab may drive another revolution for investors\n\nCharles Schwab SCHW, +0.21% is a pioneer in lowering commissions for investors, including its recent move to eliminate most online commissions. Now the company is eyeing another pioneering move: allowing investors to buy fractional shares of stock, which could be a game changer for the ETF and mutual-fund industries.\n\nGrowth has been a winner, but maybe value’s time has come\n\nGrowth-stock strategies have crushed value-oriented strategies over the past 12 years. Now Mark Hulbert has data indicating it may be time to switch to value.\n\nRelated: Here are Wall Street’s favorite value stocks\n\nAn emergency estate plan\n\nQuentin Fottrell — MarktWatch’s moneyist — helps a reader who has been diagnosed with stage 3 cancer and is debating when to tell family about his estate planning.\n\nWant more from MarketWatch? Check out our Personal Finance Daily or other newsletters, and get the latest news, personal finance and investing advice.", "description": "Also, a warning about free stock trades.", "authors": ["Philip Van Doorn", "Investing Columnist"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT535_honolu_ZG_20191017131944.jpg", "published_at": "2019-10-25"}