{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/15/exclusive-ann-coulter-out-of-touch-media-shocked-voters-want-to-be-prioritized-before-wall-street", "downloaded_at": "2019-10-15 23:53:07.261127+00:00", "title": "Coulter: Media 'Shocked' that Voters Want to be Prioritized 'Before Wall St'", "language": "en", "text": "New York Times best-selling author and populist conservative columnist Ann Coulter says the establishment media is so out-of-touch that they are “shocked” when voters support candidates promising to “put Americans before Wall Street.”\n\nIn an exclusive interview with SiriusXM Patriot’s Breitbart News Tonight, Coulter describes how the establishment media never sees populist-nationalist movements coming despite history often repeating itself.\n\nLISTEN:\n\n“Every decade or so somebody comes along — Pat Buchanan, Ross Perot, Donald Trump — and says essentially the same things, you know, defends the working class Americans and put Americans before Wall Street and every time the media is shocked,” Coulter said. “‘It’s weird, this guy just speaks the truth and it’s popular, how did that happen?’ It happens every time.”\n\nIn the 2016 presidential election, while Trump campaigned on a platform of less immigration, less free trade, and less foreign intervention, his opponent Hillary Clinton vowed to continue the neoconservative-neoliberal agenda that has ruled Washington, D.C. for the last three decades.\n\nOn election night, the establishment media was left shocked after they falsely predicted that Clinton would beat Trump, as detailed by Breitbart News’s John Nolte.\n\nCoulter said 2020 Democrats are seemingly mimicking the establishment media’s out-of-touch behavior by endorsing a whole host of far-left cultural issues like transgender surgery for children and drag queen storytime for toddlers.\n\n“All of the cultural stuff, the gay marriage, the transgenders, the drag queen holidays … please let them keep talking about that,” Coulter said.\n\n“It gets a lot of applause at the Democrat debates, but out in America there are a lot of Democrats — I’m not entirely sure why they’re Democrats and they haven’t figured out that the party hates them — the more they wake up normal, middle class, and working class Americans of every race, color, and creed to realize that the Democrat Party, they are the party of the very, very wealthy, and they are foot soldiers, you know whoever is willing to riot and shoot cops on their side,” Coulter said.\n\nJohn Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.", "description": "Ann Coulter says the media is so out-of-touch that they are \"shocked\" when voters support candidates promising to prioritize Americans.", "authors": ["John Binder"], "top_image": "https://media.breitbart.com/media/2018/03/Ann-Coulter-Associated-Press.jpg", "published_at": "2019-10-15"}