{"pub": "npr", "title": "Making 'Surviving R. Kelly': A Conversation With Executive Producer Dream Hampton", "url": "https://npr.org/2019/01/03/681851521/lifetimes-series-about-r-kelly-depicts-a-darker-side-to-the-singer", "language": "en", "published_at": "2019-01-03", "downloaded_at": "2019-09-02 07:02:57.126020+00:00", "text": "Making 'Surviving R. Kelly': A Conversation With Executive Producer Dream Hampton\n\nEnlarge this image toggle caption Mike Pont/Getty Images Mike Pont/Getty Images\n\nListen at the audio link to hear Eric Deggans' review of Surviving R. Kelly. Read on for his extended interview with the show's executive producer, cultural critic dream hampton.\n\nWhen executive producer dream hampton was pulling together Lifetime's exhaustive six-part docuseries Surviving R. Kelly, she made a point of reaching out to stars in the music business about the show's core allegations: that one of R&B's biggest-selling talents has spent decades pursuing sex with underage girls, maintaining abusive relationships with women and videotaping sexual activities without their consent.\n\nThe program about R. Kelly, which began airing Thursday and concludes Saturday, features a few big names in music, like Grammy winner John Legend and radio host Tom Joyner. But according to hampton, many more stars said no.\n\n\"We asked everyone,\" hampton says, noting they also asked people from the record labels that have released Kelly's work. \"I think [they said no because] they'd have to deal with their own complicity.\"\n\nSurviving R. Kelly makes the case that the music industry and many fans have downplayed or ignored controversies around Kelly as he allegedly used his fame and wealth to refine his strategies for seducing underage girls and young women. At its core is a succession of interviews with women who say the singer held them in residences and studios where they had to ask his permission to eat and use the bathroom; sometimes, they were cut off from family and friends, and were physically abused.\n\nAll of the women who say in the docuseries that they were abused by Kelly have previously made public allegations against the singer, but Surviving R. Kelly's power comes in hearing their stories told on camera, and all together.\n\nKelly has denied such allegations in the past; the series notes in each episode that the singer and his representatives did not respond after several attempts to get their comments. TMZ reported Thursday that an attorney for Kelly sent a letter threatening to sue Lifetime if it aired the program, but no such legal action has yet been announced. (R. Kelly's management declined to comment to NPR about the series or any possible legal action related to it.)\n\nFeaturing material from more than 50 interviews, the show reaches back to the singer's earliest days, when he was Robert Sylvester Kelly growing up in Chicago. Producers spoke to two of Kelly's brothers, his ex-wife, music journalists and several of Kelly's former employees, along with experts in psychology and abuse who spoke about the dynamics of how such relationships evolve.\n\nAnd several major controversies from Kelly's past are explored in detail — from his marriage to 15-year-old protégée Aaliyah in the mid-1990s to the appearance of a leaked sex tape in the early 2000s allegedly showing him with an underage girl, his prosecution and acquittal six years later on child pornography charges connected to that video and recent allegations he has isolated young women in something resembling a \"sex cult.\"\n\nIn an interview with NPR, hampton — who is an occasional contributor to NPR Music — talked about how, given Kelly's success and range of projects, she believes that \"dozens, if not hundreds of people\" had to be complicit in helping him.\n\nThis interview has been edited for length and clarity.\n\nEric Deggans: Let's start with you coming onto this project, and how you wound up being the showrunner on this docuseries.\n\ndream hampton: I was not thinking about R. Kelly. I mean, he has been somewhere in the back of my mind, particularly when the stories about Harvey Weinstein began to break and when the #MeToo movement really began to pick up steam. And like [#MeToo founder] Tarana Burke, I remember thinking, \"Why isn't R. Kelly being held accountable in this moment?\"\n\nBut I can't say that I was thinking about doing some exposé on him. I was invited into this project by an executive at Bunim/Murray [Productions] — and that executive, Jesse Daniels, and Tamara Simmons, another co-EP on this project, have been holding these relationships with some of his survivors for months before I came on board. I remember talking to them early on, kind of figuring out if we were going to work together. ... Having been adjacent in some ways to the music industry, when there was one, I knew that it it took dozens, if not hundreds of people, for R. Kelly to operate as long as he has in the way that he has.\n\nYou've talked about feeling like you, yourself, had a missed opportunity with R. Kelly years ago, where you interviewed him but weren't aware fully of all that he was doing.\n\nWhen I went to interview R. Kelly, it was the summer of 2000 and I was doing a story for Vibe magazine. We knew about the early marriage for sure: We knew that this 27-year-old man had married a 15-year-old, not unlike Elvis having married 14-year-old Priscilla. [Editor's note: See correction below. Elvis and Priscilla Presley met when she was 14 but did not marry for eight more years.] There have been those relationships, if we're honest, in our own families when we go back just a couple of generations — how old was our grandfather when he married our grandmother, and so on and so forth. But it was disgusting. ... I absolutely asked him about Aaliyah. He was offended that I had. I remember he called me afterwards to kind of yell at me about it being in there.\n\nWhat began to become clear a few months after my story was published, with [Chicago-based reporter] Jim DeRogatis' relentless reporting that really began in December of 2000 with the leak of the sex tape, was how many cases [Kelly] began to settle after Aaliyah. [DeRogatis is also a host of member station WBEZ's program Sound Opinions. -ed.] That this wasn't just some very not-OK marriage to a teenager — and I don't mean to make light of that, it's incredibly not OK. But that this was predatory behavior, that he had settled several lawsuits with teenagers, and then this sex abuse tape comes out.\n\nIt is with great regret that I say that I missed it. And to Vibe's credit — Danyel Smith was editor-in-chief at the time — my story probably hit the streets in September, and by the time Jim's story comes out in December, Danyel sent someone from Vibe right back out to get the story right on R. Kelly. But that wasn't me.\n\nYou got some very key people. I mean, his ex-wife [Andrea Kelly, who has accused R. Kelly of physical abuse]. Sparkle, his former protégée, who maintains that she introduced the underage girl who is the victim in the video to him. You got two of his brothers to speak on camera. How did you get these people, and how did you get them to talk about these subjects that are so tough to talk about?\n\nSparkle has a really good friend and manager ... who vetted me for weeks, and I really appreciated how guarded he was of her. She testified at the trial that that was her teenage niece being abused by R. Kelly on camera, a girl that she had introduced to him at 12, just as she introduced a lot of her family.\n\nHer story to me, and I don't mean to sound too production-y, but it was a get. I'd heard Andrea Kelly tell a bit of her story; I had heard the brothers in different places, on radio, talk about their brother, and I knew those relationships were estranged. Sparkle was someone who, when she came forward, she risked it all, and she lost it all. Jive Records dropped her when she testified against R. Kelly. She of course was one of his artists, so he wasn't going to manage or produce her anymore, and I'm sure she didn't want that. But more than that, she lost her family. She talked about not speaking to her family for a decade because of coming forward. One of the things that she was most reticent about was reopening those wounds and possibly not being able to spend Christmas with her family because she was doing this show.\n\nAnd that was a common theme: Yes, these girls' lives are destroyed, but you see whole families who, decades later, are still dealing with the trauma that R. Kelly has left behind.\n\nHow long did it take you to pull these stories, all this material together?\n\nWell, there were some false starts in terms of how we were going to tell the story. Again, Tamara Simmons and Jesse Daniels had been holding the space for these relationships [with accusers]. Tamara Simmons in particular was getting calls at 3 in the morning from the families — and then the families would introduce us to new victims, some of whom wanted to come on camera, many of whom did not.\n\nEnlarge this image toggle caption Courtesy of Lifetime Courtesy of Lifetime\n\nAnd then, I come from a history of having done cultural criticism, so I was able to get a lot of those voices in there: Nelson George, [NPR correspondent] Ann Powers, Jamilah Lemieux. But when it came to industry insiders, I got a whole bunch of noes. I really want to shout out John Legend for even coming on camera — someone with his stature just agreeing to go on the record and say what he said.\n\nWhy do you think they said no?\n\nI think they'd have to deal with their own complicity. There's a whole lot of \"what about\"-ism; that is one of the ways that we see conversations around abuse derailed all of the time, whether it's Weinstein and we get the \"What about the casting couch in Hollywood in the '30s?\" And like, what? We're talking about this person and we're talking about these cases.\n\nThere are various messages in the series saying you guys tried to get a response from R. Kelly and he has not responded. [This interview was recorded on Jan. 2, the day before the first two episodes aired. -ed.] Is that still true?\n\nR. Kelly and his team have been given many of the quotes that are in the piece, many of the facts and obviously an opportunity to be interviewed several times. And he has turned us down.\n\nIs there any concern that he might sue?\n\nI mean, I think we had those concerns every single day that we were in production. There was never an interview that I conducted that didn't have an attorney from Bunim/Murray in the room. A&E, who owns Lifetime, is a publicly held company and they have their legal department.So this was vetted beyond anything I've ever done before.\n\nI know these are different cases, but I think about Bill Cosby and how people, for some reason, just seemed to get amnesia about the allegations against him — until we hit about 2015 and it seemed that our sensibility about those allegations changed. People took them more seriously, he wasn't able to mount this whole rehabilitation tour that he had kind of built for himself, and he wound up being charged with crimes and and convicted.\n\nDo you think that a series like this is meeting that moment? That maybe our feelings in regard to all these things that he's been accused of and connected to over the decades have changed enough that people are going to react differently?\n\nWell, I think it's because of the work of people like the creators of #MuteRKelly, who are also in the docuseries, that somewhere like Lifetime was even interested. Say they were interested before; they knew that this was the moment that they could actually get this made.\n\nBut moreover, I filmed a #MuteRKelly protest in my hometown, Detroit, at a concert that he was at. And I watched those protesters, black women, be yelled at by other black women and black men. \"Get a man.\" \"He was found innocent.\" \"You need to go home.\" It disgusted me. If we were out there protesting about any number of issues ... we would not have been met with the kind of scorn from black people that those protesters were met with.\n\nAnd so it's those people — I want them to be unable to loudly declare their defense of R. Kelly. They can do it quietly. They can play their R. Kelly records and do whatever they want to do. But they should have some shame attached to that.\n\nYou had to cancel one screening because there were threats called in. Now we're at the point of having the series here, on television. Are you concerned at all about what his more devoted fans might do when it hits the public?\n\nI'm not afraid of R. Kelly or his fans. I mean, they can't call in and cancel what's going to be in people's living rooms. I think that whatever energy they think they're about to engage in trying to defend him ... they all need to be looking at themselves. Don't come looking for the girls; definitely don't come looking for me. Look in the mirror.", "description": "Accusations of sex crimes and abuse have followed Kelly for 20 years. hampton's new Lifetime docuseries makes the case that fans, peers and the industry have been protecting the singer all along.", "authors": ["Eric Deggans"], "top_image": "https://media.npr.org/assets/img/2019/01/04/gettyimages-490064598_wide-491f4b69312375e0f51a85e087dcaae1fbd7fba7.jpg?s=1400"}