{"pub": "businessinsider", "url": "https://businessinsider.com/founder-tesla-apple-shares-favorite-class-wharton-business-school-adam-grant", "downloaded_at": "2019-10-09 18:55:34.343213+00:00", "title": "A founder who worked at Tesla and Apple says one class taught by a legendary Wharton professor inspired how he runs his business. Here are the big psychological insights he gained.", "language": "en", "text": "Sankarshan Murthy is the founder of Bumblebee Spaces, a robotics startup.\n\nBefore starting his company, Murthy worked at Apple as a product manager, then at Tesla as a staff product technologist.\n\nAs a graduate of the Wharton School at the University of Pennsylvania, one of the best MBA programs in the world, Murthy attributes a lot of his business mindset to his favorite class in business school.\n\nThis course was Organizational Behavior, lead by Adam Grant, which taught students how to generate ideas, build team trust, and find flow at work.\n\nClick here for more BI Prime stories.\n\nAfter Sankarshan Murthy got two master's degrees — one in mechanical engineering from the University of Maryland, Baltimore County, and the other in technology management from the Wharton School at the University of Pennsylvania (one of the leading business schools in the world) — it was on to work at Apple and then Tesla.\n\nThe native of India was a product manager for the iPhone and Apple Watch from 2012 to 2016. Then at Tesla he was a staff product technologist, working on the Model Y electric vehicle and learning the value of jumping on an idea, unfettered by company bureaucracy.\n\nElon Musk \"set up the organization in such a way that there are no information blockers,\" Murthy told Business Insider. \"So, if you find something inspirational to work on, or you find a problem that needs to be fixed, you get to jump on it and take it. That gives a certain level of empowerment to the people working there.\"\n\nRead more: An engineer who spent 15 years working at Apple shares what it takes to land a role at the tech giant, where engineers are paid over $100,000 a year\n\nThat free-spirit atmosphere is something Murthy hopes to achieve with his own company, Bumblebee Spaces, which he started in 2017 and has been featured in Inc., the New York Times, and CNBC.\n\nBumblebee's mission is to create \"a new way to live by unlocking the third dimension,\" according to the company's website. To do this, it uses smart robots and artificial intelligence to increase usable space and reduce a room's footprint by storing objects in the ceiling and retrieving them on demand.\n\nThe company's videos show the possibilities of this futuristic outlook — you can put away your bed, your nightstand, or almost any other piece of furniture with the press of a button.\n\nMurthy says one of his greatest influences when launching his company was a class that he took at Wharton with Professor Adam Grant called Organizational Behavior. Grant is the Saul P. Steinberg professor of management and professor of psychology at the business school who has been recognized as Wharton's top-rated professor for seven straight years. He's also been recognized in Fortune's 40 under 40 list and the author of three New York Times bestselling books.\n\nMurthy shared with Business Insider the best lessons he gained from Grant's course.\n\nThe Organizational Behavior curriculum covers motivation, methods of generating ideas, team trust building, finding flow at work, human psychology, and personality traits\n\nThe Wharton course sparked inspiration for Murthy almost as soon as he sat down in the classroom for the first time.\n\n\"It was like, oh my god, we cracked something about how the human mind works,\" Murthy recalled about being in Grant's class. \"We didn't know exactly what to do with\" the discovery, he added, \"but it was a real mind bender.\"\n\nAssignments involved actual idea generation, covering different methods of negotiation, and job crafting to find the best flow at work.\n\n\"The job crafting exercise really helped me craft my own role as a founder, and now I choose to find ways to craft my role to be close to product since that's what I enjoy most,\" Murthy said. \"If for consecutive days I find myself working on things that I don't find flow in, I craft my role to make the best impact. This technique has worked very well for me in big companies as well as startups.\"\n\nRead more: Here's exactly what it takes to get into Wharton's MBA program, the No. 1 business school in the world\n\nMurthy said he learned from Grant's class that traditional brainstorming — people suggesting ideas in a group setting — isn't effective because quieter people are less likely to participate and others may hold back their creative ideas with \"conformity norms kicking in and people nodding along.\"\n\nAdam Grant, Saul P. Steinberg professor of management and professor of psychology at Wharton. George Lange\n\n\"So, at Bumblebee we don't brainstorm at work,\" he said. \"We allow folks to bake their ideas on their own and present within schedule and cost constraints.\"\n\nAll the lessons Murthy picked up from the class have played a crucial role in how he builds his Bumblebee Spaces team, negotiates internally and externally, and understands people's psychological motivations.\n\n\"Every human interaction is influenced by various psychological factors, along with incentives. Everyone thinks they're making rational decisions, but it's so far from the truth,\" he said. \"I realized very quickly, like in building Bumblebee, the most important thing — more than customer experience, competitors, technology — is people, and how you interact with people. It's either you're trying to convince people to invest in the company or join the company or be among the early adopters of the technology. And not every decision is made as a rational decision.\"\n\nWhen it comes to team building, Murthy said he learned that having an underdog mindset can be especially motivating for employees.\n\n\"We [at Bumblebee] feel like special forces, we're pirates,\" he explained. \"You're super tight, you get a sense of camaraderie, you get a sense of kind of taking on the system, and you feel like there's something to prove. We're pirates in real estate; we really don't belong in the real estate industry. This gives us that black-sheep feeling — we don't belong, but we're going to change the world.\"\n\nMurthy also discovered that passion can be an especially powerful business tool when running a company.\n\n\"What I took away from his class was the underlying forces of how people approach decision making [and] how people approach transactions in general,\" Murthy said. \"If they're truly in love with what they're doing — the love for the mission, the love for the company — and you're able to activate the love hormones in some way, when there's so much love, people find a way to make things happen. So, we want to build this atmosphere in the company where people are just so stoked to be there.\"\n\nMilwaukee journalist Tom Kertscher was a 35-year newspaper reporter, finishing that career at the Milwaukee Journal Sentinel. Now a freelance writer, his work includes fact-check reporting for PolitiFact and sports reporting for Associated Press. His reporting on Steven Avery was featured in Making a Murderer. Kertscher is the author of sports books on Brett Favre and Al McGuire. Follow him at TomKertscher.com and on Twitter @KertscherNews and @KertscherSports.", "description": "As a startup founder, Sankarshan Murthy credits his business success to Adam Grant's Organizational Behavior class at Wharton. Here's what he learned.", "authors": ["Tom Kertscher"], "top_image": "https://image.businessinsider.com/5d9df866122bd52a011c6742?width=1200&format=jpeg", "published_at": "2019-10-09"}