{"pub": "washingtonpost", "url": "https://washingtonpost.com/history/2019/10/01/antique-audiotape-was-mystery-then-researcher-got-it-play-it-was-dispatch-d-day", "downloaded_at": "2019-10-02 00:35:33.562236+00:00", "title": "The antique audiotape was a mystery. Then a researcher got it to play. It was a dispatch from D-Day.", "language": "en", "text": "\n\nSoldiers crouch behind the bulwarks of a Coast Guard landing barge on their way to Normandy.\n\nThe sound from the scratchy audiotape is chilling.\n\n“Here we go again; another plane’s come over!” yells radio correspondent George Hicks as antiaircraft fire roars in the background. “Right over our port side. Tracers are making an arc right over our bow now. … Looks like we’re going to have a night tonight.”\n\n“Give it to them, boys!” he hollers.\n\nIt’s D-Day, 1944, and Hicks is on a ship off the coast of Normandy as it comes under attack by Nazi aircraft. He’s speaking into a primitive tape recorder that will soon be obsolete. But for more than 13 riveting minutes, he captures the raw sound of battle.\n\nOn Monday, a Florida researcher who discovered what appears to be the original tape of Hicks’s famous broadcast in an old log cabin donated it, and other historical artifacts, to the National D-Day Memorial in Bedford, Va.\n\nBruce Campbell, 63, of Loxahatchee drove the material from his home to the memorial and turned it over to John Long, the memorial foundation’s director of education.\n\nThe donation included recordings of all of Hicks’s reports, before, during and after D-Day, as well as recordings of other legendary World War II journalists, such as Edward R. Murrow. It also included rare parts of the primitive tape recorder that was used.\n\n“They freaked out,” Campbell said Tuesday of the memorial officials’ reaction.\n\nLong said in an email: “Imagine if someone found recordings of the Battle of Yorktown or Gettysburg.”\n\nThe Hicks D-Day report is iconic and frightening, and one of best pieces of audio to come out of World War II.\n\n“I’m listening to this, and I feel like I’m standing on the battleship with this guy,” Campbell said of the first time he heard it. “It made my hair stand up. … This is the original media and masters it was actually recorded on.”\n\n[One of D-Day's most famous, heroic assaults may have been unnecessary]\n\nApril Cheek-Messier, president of the memorial’s foundation, said: “We are absolutely overwhelmed and delighted. … It’s truly a window into not only one of the most important events of the last century, but also in real time [to] hear what” it sounded like.\n\nCopies of Hicks’s broadcast are well known, but “these are the originals,” she said in a telephone interview.\n\n“To me, it’s one of the most important broadcasts anyone has ever heard,” she said.\n\nGeorge Hicks was the 38-year-old London bureau chief for what was then the Blue radio network, a predecessor of ABC. He was on the deck of the USS Ancon, a key communications ship, and was using an early tape-recording machine known as a Recordgraph, which was later used to record the Nuremberg war crimes trials.\n\n\n\nA Recordgraph was a portable recorder that captured sound on Amertape. On the morning of June 6, 1944, reporters for the Red and Blue networks stationed in ships in the English Channel to cover the invasion used the new-for-its-time technology. (Stern collection)\n\nAs the ship stood off the French coast the evening of June 6, Hicks captured the sounds of German air attacks on the support vessels. His report is punctuated with the roar of gunfire, the drone of enemy aircraft and the cries of those on board.\n\nHis voice is tense but controlled, as he yells over a crescendo of antiaircraft fire. “Another one coming over! A cruiser right along side of us is pouring it up!”\n\nSomebody in the background is heard yelling.\n\nEarlier, Hicks, perhaps a little overwhelmed, had said: “If you’ll excuse me, I’ll just take a deep breath for a moment and stop speaking.”\n\nA few seconds later: “Something is burning and falling down through the sky,” he says. “Circling down. May be a hit plane.”\n\nThe gunfire resumes. It becomes continuous and deafening. Hicks tries to say something over the noise, but it’s hard to make out. As the gunfire dies down, men can be heard shouting and cheering, “we got one!”\n\n“They got one!” Hicks says. “They got one. … A great blotch of fire came down and is smoldering now just off our port side in the sea. Smoke and flame there.”\n\nAfter D-Day, Hicks went on to cover the ground war in Europe, where reporters were often in danger. One day, he rolled himself in a blanket to get some sleep and was picked up by an Army detail gathering the dead.\n\nAround Christmas 1944, he reported that four soldiers had been killed, and that he and other reporters barely escaped death in a Nazi air attack. He was slightly wounded.\n\nBack home, his D-Day report was a sensation. It was 13 minutes and 29 seconds in total.\n\nIt was played on stations across the country, starting on June 7, said Matthew Barton, a recorded sound curator at the Library of Congress.\n\n“I believe this will be regarded as one of the greatest records of the whole war,” New York columnist Zoe Beckley wrote a few weeks later. “If you heard it, it probably left you limp.”\n\nA record was made of his report and went on sale in music stores. Hicks got a bonus and his own radio program. A picture of him, wearing glasses, smoking a pipe and working on a typewriter, was used in a newspaper ad for the Red Cross.\n\nHe came home and got wartime speaking engagements, and later a star on the Hollywood Walk of Fame for radio personalities.\n\nBut after the war, he dropped from the headlines. Radio was being eclipsed by television. The Recordgraph was surpassed by new technology.\n\nHicks died at home in New York City in 1965 at age 59.\n\nIn 1994, Campbell, then a machinery mechanic in a chocolate factory and a resident of Mastic Beach, N.Y., bought the old cabin and its contents in Mattituck, about 30 miles away on Long Island. His wife, Maureen, was pregnant, and they needed a bigger house.\n\nThe cabin happened to be the former vacation retreat of the late Albert Stern, who was vice president of Frederick Hart & Co., the New York firm that manufactured the Recordgraph. He died in 1992.\n\nThe basement was filled with Stern’s dusty old belongings.\n\nAs Campbell began cleaning things out, “I ran across this stuff that says, 1944, VJ day, all these different things from the war,” he said. “I put them all in a plastic bag, [thinking] ‘These gotta be something, I’ll look at them another day.’ … I put them away, and life went on.”\n\nAmong the material were more than a dozen oblong boxes that held what looked like movie film. These were the Amertapes that contained the Hicks report and other recordings.\n\n\n\nAmertape allowed reporters to record on-the-scene broadcasts and capture the sounds of battle during World War II. (John Wilcher/National D-Day Memorial Foundation)\n\nFifteen years later, he said, he decided to research the mysterious trove he still had in his basement. “I finally looked at it after all those years, and that’s when [I started on] this path,” he said.\n\nHe said after he discovered the Amertapes, he had trouble finding something that could play them. He had no idea what was on them.\n\nFinally, he said, he found an electrical engineer, Adrian Tuddenham, in Bristol, England, who was an expert in antique audio machinery. Tuddenham had built a device that could play Amertapes from the war crimes trials.\n\nCampbell asked Tuddenham whether the expert could play his tapes. The answer was yes.\n\nIn 2004, Campbell flew to Bristol with his tapes in his carry-on luggage.\n\nWhen Campbell heard the Hicks audio, “the hair on my arms stood on end,” he said. “It was unbelievable.”\n\nCampbell, now the founder of a company that makes candle wicks, said he was asked to donate the material to the Library of Congress and to Britain’s Imperial War Museum. He declined. He tried to sell the items, but there were no buyers. “Everyone probably thought it was fake,” he said.\n\nEarlier this year, as the 75th anniversary of D-Day was celebrated at the Bedford memorial and around the world, Campbell said, he realized what he should do.\n\nHe had been to the National D-Day Memorial four years ago.\n\n“That’s the place” where the artifacts should be, he said.\n\nSeventy-five years ago, as D-Day closed, George Hicks sounded weary and somber when he signed off:\n\n“All around us is darkness,” he said. “It’s now 10 past 12, the beginning of June 7, 1944.”\n\n“We now return you to the United States.”\n\n\n\nArt Beltrone, left, a World War II artifacts appraiser, John Long, the National D-Day Memorial Foundation's director of education, and Bruce Campbell, who donated the Stern collection, open a tub filled with periodicals related to the Recordgraph and Amertape, used by journalists to record reports from the war front. (John Wilcher/National D-Day Memorial Foundation)\n\nRead more:\n\nBedford, Va., lost 20 men on D-Day. Seventy-five years later, the town honored their service.\n\nHow technology helped win the Normandy invasion and World War II\n\nThe radio reporter who witnessed D-Day and told the world what he saw\n\nThe Reagan D-Day speech that moved a nation", "description": "George Hicks’s award-winning audio of the deafening chaos of battle, found in a log cabin on Long Island, is being donated to the the National D-Day Memorial.", "authors": ["Michael E. Ruane", "Reporter Covering Local News", "Washington Institutions", "Historical Topics", "October At Pm"], "top_image": "https://www.washingtonpost.com/resizer/9w4neK-pxnwVGLrhJaip3ONU8Fw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/KMESZZHDSEI6TMFGHUBXEG4F54.jpg", "published_at": "2019-10-01"}