{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7544385/Eric-Dier-admits-Tottenham-crisis-losses-against-Brighton-Bayern-Munich.html", "downloaded_at": "2019-10-07 00:17:16.199660+00:00", "title": "Eric Dier admits Tottenham are in a 'crisis' after losses against Brighton and Bayern Munich", "language": "en", "text": "Eric Dier has admitted Tottenham are in the middle of a 'crisis' after their loss against Brighton.\n\nThe 3-0 defeat at the AMEX Stadium on Saturday followed a mid-week humbling at the hands of Bayern Munich in the Champions League — they lost 7-2 to the German giants.\n\nMauricio Pochettino's side are down in ninth in the Premier League after a stuttering start to the campaign.\n\nEric Dier has admitted Tottenham are in the middle of a 'crisis' after their loss against Brighton\n\nAnd Eric Dier, who was restored to the side for this weekend's game, was honest about the situation at Spurs.\n\n'We are obviously going through a difficult period,' said Dier. 'Is saying it's a crisis a bit too strong? No.\n\n'If you lose like we've lost in these last two games, it's ­normal. For us, this is the worst period we've been in, but we have to be all together and push through it.\n\nMauricio Pochettino's side have had a tough week, losing against Brighton and Bayern Munich\n\n'The stuff about the squad, I know that's not the case. But it's natural these things will come up now because of the situation we find ourselves in.\n\nHe continued: 'It's the first time that we've found ourselves in this position, we can't back down from it. We've got to push through it.'\n\nSpurs will take on Watford on October 19 in the Premier League.", "description": "The 3-0 defeat at the AMEX Stadium on Saturday followed a mid-week humbling at the hands of Bayern Munich in the Champions League - they lost 7-2 to the German giants.", "authors": ["Amitai Winehouse For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/23/19373980-0-image-a-65_1570401552964.jpg", "published_at": "2019-10-06"}