{"pub": "news24", "url": "https://wheels24.co.za/Motorsport/simola-hillclimb-2020-competitor-entries-now-open-20191005", "downloaded_at": "2019-10-05 12:29:52.699961+00:00", "title": "Simola Hillclimb 2020: Competitor entries now open", "language": "en", "text": "It's official. Preparations are underway as competitors and petrolheads alike will flock to the picturesque town of Knysna to witness high-performance cars duke it out for bragging rights and the lucrative king of the hill title.\n\nCompetitor entries have now officially opened for the 11th edition of the Simola Hillclimb, South Africa’s premier motorsport and motoring lifestyle event. The 'invitation only' event attracts some of the best cars and drivers from the country ready to tackle the 1.9km hill course.\n\nExcitement begins\n\nOrganisers have kept the categories and classes unchanged for 2020 due to the success of class changes made to the 2019 edition, except for minor adjustments to classes C1 and C5.\n\n\n\nWATCH: #OMGTR - Nissan wins at the Jaguar Simola Hillclimb\n\nAccording to sporting director Geoff Goddard, the selection process is not based on a first come first served principle.\n\n\"Request for invitations are not accepted on a first come first serve basis, but purely according to organisers’ criteria. Each year we have the very difficult task of selecting the final entries for the event and there is always disappointment among those that don’t make the cut.\n\nImage: Motorpress\n\n\"The event is significantly over-subscribed each year, and while we understand prospective participants’ desire to participate, and their frustration if they don’t make the final selection, our single most important consideration is what is best for the event as a whole,\" Goddard adds.\n\nApplications are welcome\n\nThe main aim of the organising team is to keep the show fresh, this includes showcasing drivers and cars not previously seen at previous events. The event encourages applications where every applicant will ultimately be judged fairly according to the Simola Hillclimb criteria.\n\nLast time out, Nissan dominated the field claiming the title for both road-going saloon cars and supercars, and modified saloon cars for the second year in a row.\n\nIf you need any reminding about just how action-packed these events can get, check out the video below of last year's Hillclimb:", "description": "It might only be seven months away, but competitor entries have now officially opened for the 11th edition of the Simola Hillclimb taking place in Knysna.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9437/321ce25d46e14d1bb964ae0d2945cfb3.jpg", "published_at": "2019-10-05"}