{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7582727/The-married-architect-26-says-studied-long-kids-shes-burnt-out.html", "downloaded_at": "2019-10-17 11:37:41.865551+00:00", "title": "The married architect, 26, who says she studied too long to have kids and now she's 'burnt out'", "language": "en", "text": "A married architect says years of studying has made the prospect of having children unrealistic.\n\nRachel Clements, 26, spent six years completing her degree in architecture but still has a two-year registration process to go.\n\nArchitects must undergo a minimum of seven years training, meaning many have reached their late 20s or early 30s by the time they're ready to start work.\n\nNow, the 26-year-old (left) is faced with finding alternative ways to have children with husband Daniel (right) or risk falling behind in the career she has spent years chasing\n\nNow, the 26-year-old is faced with finding alternative ways to have children with husband Daniel or risk falling behind in the career she has spent years chasing.\n\n'Often it comes down to the question of, ''Do I get registered, or do I start a family?'' she told ABC News.\n\n'I'm burnt-out. I'm tired. And to think now I have a registration process ahead of me that may take two years, and on top of that, whether my partner and I want to start a family, it definitely plays into the worry of what the next 10 years look like.'\n\nMs Clements said it takes most people in her field around ten years before they are qualified.\n\nBecause of the damage a gap can create on a career, the couple are now considering adoption or freezing her eggs.\n\nBecause of the damage a gap can create on a budding career, the couple (pictured) are now considering adoption or freezing her eggs\n\n'If you're going to take a year off work, it inevitably puts something on the backburner and often that's career progression. Particularly if you've spent a hell of a long time and a lot of effort to get to that point where you're registered,' she said.\n\nIn the Australia Talks National Survey, conducted by the ABC, 62 per cent of 25-29 year-olds said they struggled to maintain a healthy work-life balance.\n\nAlmost 50 per cent of women in the survey reported having issues with career opportunities compared to 40 per cent of men.\n\nAccording to the Gender Equity Insights 2019, one of the factors contributing to the gender pay gap in Australia is women missing promotions as they take time off to start a family.", "description": "A married  architect (right) has revealed that years of studying has made the prospect of having children unrealistic.", "authors": ["Tita Smith For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/11/19832070-0-image-a-3_1571308043436.jpg", "published_at": "2019-10-17"}