{"pub": "wsj", "url": "https://wsj.com/articles/global-drop-in-currencies-bruises-investors-11568194207?mod=rsswn", "downloaded_at": "2019-09-11 13:57:51.967270+00:00", "title": "Global Drop in Currencies Bruises Investors", "language": "en", "text": "Currencies around the world are tumbling to multiyear lows, bruising investors’ portfolios and fanning the flames of a global trade war.\n\nThe Chinese yuan recently hit its lowest level in more than a decade against the dollar, the euro dropped to a fresh two-year low last week and the British pound is at depths it hasn’t consistently plumbed since the 1980s.\n\nSome emerging-market currencies such as the Colombian peso have fallen to their lowest prices on record against the dollar, while Argentina has recently introduced capital controls after its peso plunged in August. Out of 41 currencies tracked by The Wall Street Journal, only nine are up against the dollar in 2019.\n\n“People are becoming more concerned about currencies because currencies are becoming more dangerous,” said Kit Juckes, global strategist at Société Générale.\n\nThe declines highlight how fears of a global slowdown and a burgeoning trade dispute between the U.S. and China have converged to ripple through markets in recent months. Central banks began cutting interest rates earlier this year, ending a short-lived period when many were tightening monetary policy or signaling that higher borrowing costs were on the way.\n\nAs falling rates and slowing growth drove bond yields lower, investors headed to the U.S., where the economy is relatively strong and the payout on Treasurys stands far above that offered by many other government bonds. That shift has weighed on large parts of the foreign-exchange market while pushing the dollar up to historic highs against the currencies of many U.S. trading partners.\n\nMr. Juckes is advising clients to bet on the dollar and Japanese yen rising against a variety of emerging-market currencies, including the South African rand, Polish zloty and South Korean won.\n\nMany countries are benefiting from cheaper currencies, which tend to make exporters’ products more competitive abroad and boost economic growth. That can leave their trading partners little choice but to allow their own currencies to weaken.\n\nArgentina’s peso has dropped more than 30% against the dollar in the past year. Photo: agustin marcarian/Reuters\n\nChina in early August allowed its yuan to drop below levels long thought to be sacrosanct after the U.S. announced additional tariffs in an escalating trade dispute between the two countries, accelerating this year’s slide in a broad range of currencies. The U.S., in response, designated China a currency manipulator for the first time since 1994.\n\nWhile Group of 20 nations have pledged not to use their exchange rates for competitive gains, most countries have done little to prevent their currencies from falling. A total of 14 central banks cut rates last month, including Mexico, India and Hong Kong, up from eight in July, according to the Bank for International Settlements. Lower rates tend to weaken currencies by making them less attractive to yield-seeking investors.\n\nRelated Video The Trump administration called China a currency manipulator after the yuan weakened past the psychologically important level of seven to the dollar. Here’s what this means for trade talks and the markets. Photo: Associated Press\n\nThe widespread declines could have a number of far-reaching effects.\n\nYear-to-date performance against the dollar of a selection of 41 currencies Ukrainian hryvnia: ▲ 10.9% 10% Israeli shekel: ▲ 5.5% 5 Canadian dollar: ▲ 3.7% 0 Swiss franc: ▼ -1.0% British pound: ▼ 3.1% Brazilian real: ▼ 4.9% –5 South Korean won: ▼ 6.5% Turkish lira: ▼ 8.3% –10 Uruguayan peso: ▼ 11.1% –15 –20 –25 –30 Argentine peso: ▼ 32.7% –35\n\nRich economies such as Europe are likely to welcome a weaker currency, which can stoke growth by making exports more competitive and help spur inflation. That is a goal that the European Central Bank has failed to achieve despite years of ultralow interest rates. The euro recently traded at $1.1045, down more than 6% from last September.\n\nFor developing countries, however, a depreciating currency can be a headache. Accelerating inflation can be a problem in emerging markets, where central banks must often fight to keep prices from rising too quickly.\n\nA falling currency makes it harder for developing countries to service their dollar-denominated debt. Too sharp a drop can unnerve investors, causing a stampede as money managers ditch emerging-market assets.\n\n“Most analysis of currency wars begins and ends with the view that the country that depreciates the most wins,” analysts at Standard Chartered said in a note to clients. However, “the likely winner is the country that can best handle the consequences of depreciation.”\n\nOne country now facing the consequences of a plunge in its currency is Argentina, where the government recently imposed capital controls and has frozen prices for gasoline and some food products as it fights to stem inflation, which runs at over 50%. The Argentine peso has dropped more than 30% against the dollar in the past year, and the country’s markets have hurt several prominent investors including the hedge fund Autonomy Capital, which lost $1 billion on investments tied to Argentina last month.\n\nThe list of currencies that are at or near multiyear lows against the dollar includes the New Zealand dollar and Chilean peso, which are heavily swayed by their countries’ trade links with China. In Europe, the currencies of Sweden, Norway and Poland have been hard hit by the region’s economic woes.\n\nNot all currencies are falling. Investors have cheered changes promised by Ukraine’s new president and pushed up the country’s hryvnia to make it one of the world’s best-performing currencies. Those seeking shelter from volatile markets and trade wars have piled into the Japanese yen and Swiss franc, although some are growing wary that the central banks in those countries may not tolerate their currencies rising for much longer.\n\nNewsletter Sign-up\n\nMeanwhile, the trade-weighted dollar index, which measures the greenback against the currencies of its trading partners, hit an all-time high this month. But the dollar’s persistent strength has raised the chances that the U.S. will intervene in markets to weaken the currency, a rare move that the Trump administration has previously rejected, analysts said.\n\n“There doesn’t seem to be any resolution to the trade war coming, and the currencies markets are responding to that negative feedback,” said Mark McCormick, global head of foreign-exchange strategy at TD Securities. “You can get burned on anything these days.”\n\nTo receive our Markets newsletter every morning in your inbox, click here.\n\nWrite to Ira Iosebashvili at ira.iosebashvili@wsj.com", "description": "Currencies around the world are tumbling to multiyear lows against the dollar, bruising investors’ portfolios and fanning the flames of a global trade war.", "authors": ["Ira Iosebashvili", "Ira.Iosebashvili Wsj.Com"], "top_image": "https://images.wsj.net/im-104992/social", "published_at": "2019-09-11"}