{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/22/redskins-bears-how-watch-tv-channel-what-time", "downloaded_at": "2019-09-22 15:25:04.112996+00:00", "title": "Redskins-Bears: How to watch and what to watch for", "language": "en", "text": "As the old song goes, “Are you ready for some football? A Monday night party?”\n\nYes, the Washington Redskins are back on primetime television as they continue to chase their first win of 2019. Here’s everything you need to know before the game.\n\nOpponent: Chicago Bears (1-1)\n\nWhere: FedEx Field, Landover, Maryland\n\nWhen: Monday, Sept. 23, 8:20 p.m.\n\nTelevision: ESPN\n\nRadio: The Team 980, ESPN 630AM\n\nWhat to watch for:\n\n- The Redskins’ defense wants to shore itself up after allowing more than 30 points to both the Eagles and the Cowboys. The answer could be Mitch Trubisky, Chicago’s struggling quarterback who has only managed 4.8 yards per pass attempt through two games this year. Having defensive lineman Jonathan Allen back on the pass rush would make things easier for Washington to keep the Bears at bay. Allen is questionable with a knee injury, but he was a full participant in Saturday’s practice and told reporters he will play.\n\n- Khalil Mack continues to live up to his reputation as one of the best defensive players in the NFL. Washington’s whole offensive line must contend with him this week, not just right tackle Morgan Moses. “The good thing is he lines up on both sides, so we don’t know which side he’s going to be on, unfortunately,” coach Jay Gruden said. “If we did, we’d put somebody over there and bang the heck out of him. We don’t know where he’s going to be.”\n\n- It’s “Monday Night Football,” so the Redskins are likely to lose. Why? Since the 2008 season, Washington is 2-15 on Mondays, among the worst marks in the NFL. The Redskins last won one of these big primetime games in 2014 over the Dallas Cowboys. If they are embarrassed on ESPN again this week, the good news is they don’t have another Monday night game the rest of the year.\n\n- Still no Jordan Reed: The tight end will miss his third straight game after suffering a concussion in the preseason. Vernon Davis and Jeremy Sprinkle again will be Washington’s top tight ends.\n\nPre-game reading:\n\nIn theory, Mitch Trubisky is coming to town at exactly the right time for the #Redskins, @Matthew_Paras writes. https://t.co/hsx7HWPMFQ — WashTimes Sports (@WashTimesSports) September 20, 2019\n\n#Redskins safety Collins blasts his former GM https://t.co/7LOv5djYpf — WashTimes Sports (@WashTimesSports) September 19, 2019\n\n#Redskins QB Keenum trying to get eyes in the “right place” after missing receivers, by @Matthew_Paras https://t.co/jig2tpE1f1 — WashTimes Sports (@WashTimesSports) September 19, 2019\n\nAs the Daniel Jones era gets underway with the #Giants, Dwayne Haskins is still patiently waiting his turn with the #Redskins, by @Matthew_Paras https://t.co/EjLynKvgd2 — WashTimes Sports (@WashTimesSports) September 18, 2019\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The Washington Redskins are back on primetime television as they continue to chase their first win of 2019. Here's everything you need to know before the game.", "authors": ["The Washington Times Http", "Washington Times Staff"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/16/Cowboys_Redskins_Football_93647.jpg-b5089_c0-157-3764-2351_s1770x1032.jpg?3fc653a00090958a0adfb429932cb5d5627dc5d6", "published_at": "2019-09-22"}