{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/ottawa-muslim-canadian-election-1.5319973", "downloaded_at": "2019-10-13 23:35:48.155045+00:00", "title": "From jobs to Islamophobia, Ottawa Muslims share their election priorities | CBC News", "language": "en", "text": "Microphones and lecterns were being set up in the Ottawa Mosque in Westboro Saturday as people gathered for the afternoon prayer.\n\nThat's because the house of worship was preparing to host its first federal election debate of the 2019 campaign, with five Ottawa Centre candidates sharing their views later that evening in front of more than 100 people.\n\n\"We are a non-partisan organization. For us, this is an education session for the community,\" said Ahmed Ibrahim, president of the Ottawa Muslim Association.\n\nIbrahim said he hoped the debate would encourage Muslim voters to head to the polls.\n\n\"The issue we are seeing is people don't know who to vote for. We are helping them to make their own decision,\" Ibrahim said.\n\n\"We are Muslims, we are part of Canada and we will continue to be part of Canada.\"\n\nPamphlets from Canadian-Muslim Vote — a campaign seeking to mobilize Muslim voters to hit advance polls — were on display at the Ottawa Mosque during Saturday evening's federal election debate. (Yasmine Mehdi/CBC)\n\nEconomy, climate change, Islamophobia\n\nThe themes discussed at Saturday's debate were diverse, ranging from immigration and climate change to Islamophobia and the economy.\n\n\"Muslim-Canadians are concerned about the economy. They are concerned about jobs, affordability,\" said debate moderator Ginella Massa.\n\n\"But then there are issues that impact them directly like racism and Islamophobia, immigration [and] Bill 21.\"\n\nThe debate, Massa added, was a good way to show that Muslim-Canadians are civically engaged, too.\n\n\"A lot of times, issues that relate to Muslims are talked about by politicians. [But] we are often used as rhetoric in this campaign without being engaged in these conversations,\" she pointed out.\n\nGinella Massa, a CityNews reporter, moderated a debate between five candidates running in Ottawa Centre on Oct. 12, 2019. (Yasmine Mehdi/CBC)\n\nStrong voting bloc\n\nAccording to the 2011 census, the latest data available, just over a million people in Canada self-identified as Muslim, representing 3.2 per cent of the country's total population.\n\nIn 2015, high voter turnout among Muslims helped Justin Trudeau form a majority government.\n\n\"There is concentration of Muslims in enough ridings in Ottawa that — depending on where they vote — they can actually swing ridings,\" said local activist Fareed Khan, who was at Saturday's debate.\n\n\"I think Canadian political parties need to pay greater attention to Muslims and to issues important to Muslims.\"\n\nIt's everyday stuff that we need to hear about. What are they going to do for the average Canadian? - Shukri Hilowle, voter\n\nShukri Hilowle, a young Gatineau paralegal who also attended, said she hasn't yet decided which party will get her vote.\n\n\"[When it came to] the stuff about Muslims that they discussed, [the candidates] were very politically correct. They said they were going to support us, but they didn't say how,\" Hilowle said.\n\n\"I know everybody is speaking about international relations and all that stuff, but right now with the housing crisis, jobs and healthcare, it's everyday stuff that we need to hear about. What are they going to do for the average Canadian?\"\n\nShukri Hilowle attended last night's debate. She thinks the candidates didn't say exactly how they planned to support Muslim communities. (Yasmine Mehdi/CBC)\n\nSafaa Habach says she's mostly concerned tuition debt.\n\n\"I'm struggling for my kids. They have more than $40,000 in OSAP debt,\" she said.\n\nHabach, who immigrated from Syria almost 20 years ago, also wishes political parties would do more to tackle discrimination.\n\n\"My son graduated five years ago and he can't find a job because his name is Mohammed,\" she said. \"What do we have to do? Change [his name] to find a job? That's not fair.\"\n\nThe mosque was full as debate attendees heard the five candidates explain their stances on issues like immigration, climate change, Islamophobia and the Canadian economy. (Yasmine Mehdi/CBC)\n\nNo PPC candidate\n\nThe organizers said they reached out to all 12 candidates running in Ottawa Centre, and five showed up: Liberal Catherine McKenna, New Democrat Emilie Taman, Conservative Carol Clemenhagen, Green Party Angela Keller-Herzog and independent candidate Chris Jones.\n\nMassa said the candidate for the People's Party of Canada cancelled, adding that she hoped to ask them about their party leader's stance on multiculturalism and immigration.\n\nParty leader Maxime Bernier previously criticized Justin Trudeau's \"extreme multiculturalism\", tweeting that \"having people live among us who reject basic Western values such as freedom, equality, tolerance and openness doesn't make us strong.\"\n\n\"This was an opportunity for them to engage with the Muslim community and if they wanted to, dispel some of the misconceptions if they felt like they were painted unfairly,\" said Massa before the debate.\n\n\"Unfortunately we won't have a chance to ask them about that.\"\n\nPPC candidate Merylee Sevilla told CBC she was unable to attend \"due to a personal matter and conflict in the new change of date.\"\n\nIn an email, she said she offered to go to the mosque \"to have a discussion and be open to answering the questions that were asked.\"", "description": "From immigration and climate change to Islamophobia and the economy, members of Ottawa's Muslim community peppered candidates with questions during last night's debate at the Ottawa Mosque.", "authors": [], "top_image": "https://i.cbc.ca/1.5320004.1570995134!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/ginella-massa-ottawa-mosque-debate.jpg", "published_at": "2019-10-13"}