{"pub": "fox", "url": "https://foxnews.com/entertainment/gwyneth-paltrow-kerry-washington-jennifer-lopez-high-school-memories", "downloaded_at": "2019-10-24 02:31:23.770688+00:00", "title": "Gwyneth Paltrow, Kerry Washington dish on high school memories", "language": "en", "text": "It's a small world after all -- at least for actresses Gwyneth Paltrow and Kerry Washington.\n\nThe two New York natives once attended school together at the all-girls private Spence School in Manhattan. They recently came together on Paltrow's \"Goop\" podcast to reminisce about their high school days.\n\n\"This is so surreal,\" Paltrow said. \"I was in an a capella singing group called 'Triple Trio.' We were holding auditions because a bunch of us were graduating and in walks Kerry Washington. The most beautiful eight-grader comes in so confident. She opened her mouth and the most exquisite voice came out.\"\n\nGWYNETH PALTROW ON FORGETTING MARVEL MOVIES SHE'S BEEN IN: 'THERE ARE SO MANY'\n\nWhen Paltrow asked why Washington doesn't sing any more, the \"Scandal\" star, 42, said that she's \"never really had the right opportunity\" to sing publicly.\n\nPaltrow, 47, has shown off her singing chops in \"Country Strong\" and her Emmy-winning performance in \"Glee,\" and Washington will be featured in the upcoming movie musical \"The Prom.\"\n\nThat wasn't where the encounters with future stars ended, however, as Washington also revealed that Jennifer Lopez was once her substitute dance teacher.\n\nUnfortunately, high school wasn't all song and dance for Washington, who said she often struggled with being black in a predominantly white school.\n\n\"It was an absolute culture shock,\" Washington said. \"We were rich in the Bronx because we had [...] two cars and a dishwasher and a microwave. Then I got to Spence and it was [...] helipads on peoples' roofs in the Hamptons. I really didn't know how to comprehend it.\"\n\nWashington said she felt isolated by the differences between herself and her peers.\n\n\"I remember in that moment thinking, 'I cannot present any of these feelings I'm having right now, because it will identify me as other.' These are my new friends at Spence and this is their norm,\" Washington said. \"If I ask a bunch of questions or act like this is weird, I will identify myself as being outside their circle. So I have to act like this is normal and figure out what the f--k is going on.\"\n\nKERRY WASHINGTON: WE SPEND TOO MUCH TIME ONLY TALKING TO PEOPLE WHO AGREE WITH US\n\nThat, and avoiding sharing her feelings with her parents, led to Washington's understanding of how to play different roles, eventually leading her down her current career path.\n\n\"I didn't become an actor because of that, but I did start to understand, oh there is a level of identity that is about performance,\" Washington said. \"I started to look at my life almost anthropologically. Like, when I get on the subway in the morning, there is a particular way that people walk and talk and dress and eat and breathe even. Forty-five minutes later, there is a totally different way that people walk and talk and dress and breathe... I just started understanding all of these cultural indicators and what code-switching looked like and felt like.\"\n\nWashington called Paltrow and Lopez, 50, \"beacons\" who helped her \"find her way in this world that was so, so foreign.\"\n\n\"By the way, Gwyneth was always cool,\" she added.\n\nCLICK HERE TO GET THE FOX NEWS APP", "description": "It's a small world after all -- at least for actresses Gwyneth Paltrow and Kerry Washington.", "authors": ["Nate Day"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/Gwyneth-paltrow-kerry-washington.jpg", "published_at": "2019-10-23"}