{"pub": "nationalreview", "url": "https://nationalreview.com/2019/09/thank-you-archbishop-chaput-good-and-holy-spiritual-father", "downloaded_at": "2019-10-07 12:13:29.712246+00:00", "title": "Gratitude for Archbishop Chaput, a Good & Holy Spiritual Father", "language": "en", "text": "Archibishop Chaput attends a news conference at the Vatican in 2014. (Tony Gentile/Reuters)\n\nGratitude for a good and holy spiritual father\n\n‘The future belongs to people who believe in something beyond themselves, and who live and sacrifice accordingly. It belongs to people who think and hope inter-generationally.”\n\nArchbishop Charles J. Chaput said that in a 2016 lecture at the University of Notre Dame. It is characteristic of him and pretty well describes him. Chaput, the archbishop of Philadelphia, celebrated his 75th birthday on September 27. That’s technical retirement time. It’s up to Rome whether or not he moves on and someone else moves in. At a time when Catholic bishops are more typically in the news because files are being looked through and allegations are under investigation, it’s worth noting that in his life as a bishop, Archbishop Chaput has been a good spiritual father to many people — maybe especially lay people trying to live Catholic lives in the world faithfully and even courageously. He’s a great gift, a man of humility and clarity and humor and courage.\n\nAdvertisement\n\nAdvertisement\n\nWhen Pope Francis came to the United States four years ago for the World Meeting of Families in Philadelphia, the theme of the event and visit was “Love is our mission.” Well, Archbishop Chaput loves well. Around the time of the pope’s visit, he highlighted so many of the social services provided by the church in the City of Brotherly Love, truly treating others as brothers and sisters and beloved sons and daughters. And we are often unable to see the world apart from political labels and ideological colonies (as the pope himself has put it). Chaput is someone who frequently tries to get us beyond that, so we can be leaven where we find ourselves. (Even as he’s caricatured as a right-winger, but that’s not seeing the man in full. That’s seeing through a hyper-politicized lens.)\n\nI remember one interview years ago in which he said that if you had asked him decades ago which major political party would become the defender of legal abortion, he would never have imagined that it would wind up being the Democratic party. There were simply too many Catholics in the Democratic party around the time of the sexual revolution. Surely the Catholics would never let the party go down into such grave darkness without a fight.\n\nAdvertisement\n\nNow the Democratic party seems to be a wholly owned subsidiary of Planned Parenthood. And it seems almost quaint that the late Catholic New York governor Mario Cuomo, in a speech at Notre Dame, once tried to justify how he personally opposed abortion while publicly supporting it. Or, it’s quaint when compared with the current Empire State governor, his son Andrew, who expanded abortion access and then celebrated it by lighting up the Freedom Tower in a soft pink. A symbol of new life, a rebuilding — the tower raised in the ruins of the World Trade Center that was destroyed on 9/11 — was dragged into the misery of our abortion addiction.\n\nAdvertisement\n\nI say addiction because we could get ourselves out of this culture of death, we could work on common-ground issues such as promoting adoption and supporting crisis-pregnancy centers and maternity homes and paid family leave and things that will genuinely help women and children and families, that will support women so that they do not feel forced to choose between life and death.\n\nAdvertisement\n\nIt’s not a right-wing thing to oppose a culture of death, and to want to help women and families. It’s a human thing. And certainly, it’s what Catholics ought to be doing: loving one another and the most vulnerable.\n\nI’m a little stubborn about social media. I know it can be a cesspool, but it can also be an instrument of light. Good people shouldn’t give up on it. Engage in a detached and humble way, without getting sucked into the frequently angry, prideful back-and-forths. Just as Chaput wanted Catholics in the Democratic party (and Republican) to stick up for life and truth and light, that’s the mission wherever a Christian is. That’s why Christians are good to have around. If they read Scripture and take it seriously, they are going to live virtuously, they are going to go out of their way to be leaven in the world, tapping into some of the gratuitous love we believe God has for us. Think about the belief that the Creator of the Universe gave us life and is an active part of our lives. That He gave us all good things. That makes us grateful people. And grateful people show their joy even on social media.\n\nAdvertisement\n\nI bring this up because, for a number of years now, I’ve gone online, when I am free, to Mass with Archbishop Chaput at the cathedral in Center City Philadelphia. His homilies are always those of a good father who is walking God’s children through the Gospels, showing how they are meant to guide our lives. They are challenging, and it’s hard not to be moved to renew the commitment to living this life right, keeping focused on the God Christians say is our Savior. It’s a reminder that even social media can be used for light and good.\n\nAdvertisement\n\nAdvertisement\n\nIn his 2017 book Strangers in a Strange Land: Living the Catholic Faith in a Post-Christian World, Chaput wrote about hope as different from optimism. “Upbeat feelings are fickle. They don’t last long if we look hard at the problems in our own lives and the world around us.” Hope, on the other hand, “is like a muscle or a skill that, with practice, lets us throw a fastball or play the piano.” It’s also a gift of faith and “an act of trust in God’s future.”\n\nHe also even just hours ago delivered a message that has been consistent for as long as I’ve been listening to him: If you do not care for the poor, you will go to hell. We cannot ignore people. We must love. I’ve never heard anyone in my entire cradle Catholic life put it so starkly. I’m grateful. It means I look at people differently and I feel sorry for myself less.\n\nAdvertisement\n\nObviously not everyone in the world, and not everyone reading this column, is a religious believer. But those of us who call ourselves Christian owe it to truth and to our neighbors of all persuasions to live hope. Otherwise we’ll be stuck in miserable politics, miserable culture, letting people slip into despair. We’re created for something better. And thanks be to God for good men such as Charles J. Chaput who have said “yes” to the will of God in their lives. Pray for more good men to live good lives as shepherds of souls, wherever they find themselves. And let’s follow their lead and encourage them and challenge them as they encourage and challenge us. Thinking and hoping beyond ourselves.\n\nThis column is based on one available through Andrews McMeel Universal’s Newspaper Enterprise Association.", "description": "Thanks be to God for good men like Charles J. Chaput who have said “yes” to the will of God in their lives. Pray for more good men to live good lives as shepherds of souls", "authors": ["Kathryn Jean Lopez", "Mairead Mcardle", "Jonah Goldberg", "David French", "Matthew Continetti", "Brian Stewart", "Jack Crowe", "Tobias Hoonhout", "Kyle Smith", "Read More"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2019/09/archbishop-chaput.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-09-30"}