{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/10/11/cuban-soccer-player-reportedly-goes-missing-before-nations-league-match-dc", "downloaded_at": "2019-10-11 19:49:21.890955+00:00", "title": "Cuban soccer player reportedly goes missing before Nations League match in D.C.", "language": "en", "text": "A Cuban soccer player has reportedly gone missing ahead of the Nations League match against the United States on Friday night at Audi Field, the latest apparent defection by a player from the men’s national team.\n\nYonaidis Garcia, a 22-year-old defender, left the delegation shortly after its arrival in Washington on Thursday, according to ADN Cuba, a news website, which cited an anonymous source.\n\nA U.S. spokeswoman handling the Cuban team’s communications deferred to a spokesman for Concacaf, the governing body overseeing the competition. There was no immediate comment.\n\nGarcia played for Cuba’s under-23 squad in Olympic qualifying but did not appear in either of the senior team’s two Nations League matches against Canada. He was included on Cuba’s 40-man preliminary roster for the Concacaf Gold Cup this past summer but did not make the final cut.\n\nDuring the Gold Cup, four Cuban players defected. Last year, 12 left the team during an under-20 tournament in Florida. Four years ago, several players went missing.\n\nThe last time the senior squad played in Washington, exactly 11 years ago for a World Cup qualifier, two players ran from the team hotel in Crystal City and did not return.\n\nSince 1999, more than 50 Cuban soccer players, most notably longtime MLS midfielder Osvaldo Alonso, have defected while on duty in the United States or Canada.\n\nRead more:\n\nOne Cuban soccer player is able to chase his pro dream in the U.S. — without defecting\n\nU.S. soccer kicks off Nations League, where matches are meaningful but competition is meh\n\nChristian Pulisic vows to ‘keep pushing’ with Chelsea as he returns to play with U.S. national team\n\nJozy Altidore will miss USMNT matches with injury", "description": "Yonaidis Garcia, a 22-year-old defender, left the delegation shortly after its arrival in Washington on Thursday, according to the news website ADN Cuba.", "authors": ["Steven Goff", "Reporter Covering Soccer", "D.C. United", "Mls", "U.S. National Teams", "World Cup", "Plus Some College Basketball.", "October At Pm", "Steven Goff Has Covered Soccer For The Washington Post Since The Early His Beats Include D.C. United", "The U.S. National Teams. He Has Been On Assignment At Every World Cup Since"], "top_image": "https://www.washingtonpost.com/resizer/kyH6-BwuC6HC0uaMaUN2VqQH-GA=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/ID37OCR7KAI6TBNNO6PPAX6Z3A.jpg", "published_at": "2019-10-11"}