{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7553937/Stunned-beachgoer-60-finds-seashell-spitting-image-9-11-monster-OSAMA-BIN-LADEN.html", "downloaded_at": "2019-10-09 12:11:57.731059+00:00", "title": "Stunned beachgoer, 60, finds seashell that is spitting image of 9/11 monster OSAMA BIN LADEN", "language": "en", "text": "A woman was shocked when she discovered a seashell that looked just like terrorist Osama Bin Laden while taking a stroll on the beach.\n\nDebra Oliver was stunned when she spotted the unique shell on Winchelsea Beach in East Sussex.\n\nThe 60-year-old had been out with her husband Martin 62, and the pair had been celebrating their 42nd wedding anniversary.\n\nDebra said she had been drawn to the 'curious-looking' find and thought the shell bore an uncanny resemblance to the al-Qaeda terrorist and joked, 'funny that - he was buried at sea too'.\n\nThe unique shell (right), which looks like terrorist Osama Bin Laden (left) was found on a beach in East Sussex\n\nDebra (right) had been out celebrating her wedding anniversary with her husband Martin (left) when she found the shell\n\nLegal secretary Debra, of Brentsford, west London said she 'fell apart laughing' and kept it 'as a little memento'.\n\nShe said: 'It's not that often you find a seashell that looks like anyone at all, so finding Osama bin Laden was amazing.\n\n'We'd all gone for a walk on the beach, which is covered in millions and millions of shells and pebbles.\n\n'I was drawn to this curious-looking shell, and went to pick it up. When I looked at it properly up close, I thought it looked like Jesus.\n\nDeborah (pictured above) joked about finding the shell at the beach as Bin Laden was buried at sea\n\n'I then saw a turban on the top, and realised who was staring up at me in the palm of my hand - Osama bin Laden.'\n\nWhile many people thought the shell looked most like 9/11 perpetrator Bin Laden, others thought the seashell resembled ex-Supreme Leader of Iran Ayatollah Khomeini.\n\nBin laden was a Saudi Arabian extremist who founded terror group Al-Qaeda. He use the group to plan terror attacks across the world.\n\nIn 2011 he was shot and killed by US Navy Seals in a remote area of Pakistan where he had been hiding out with a local family.\n\nThe killing of the terrorist was carried out under the orders of former President Barack Obama.\n\nAfter the shooting he was buried at sea off a US aircraft carrier.\n\nHe is most know for his attack on September 11 2011 in which nearly 3,000 people died.\n\nAfter that he became the subject of a decade-long man-hunt with the FBI offering a $25 million bounty for the terrorist.", "description": "Debra Oliver was stunned when she spotted the unique Osama Bin Laden shell (pictured) on Winchelsea Beach in East Sussex.", "authors": ["Terri-Ann Williams For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/11/19486772-0-image-a-21_1570618225130.jpg", "published_at": "2019-10-09"}