{"pub": "investing.com", "url": "https://investing.com/news/economy/pitting-tencent-against-alibaba-couldve-made-you-27-this-year-2006151", "downloaded_at": "2019-10-29 04:01:38.817321+00:00", "title": "Pitting Tencent Against Alibaba Could’ve Made You 27% This Year", "language": "en", "text": "(Bloomberg) -- Sign up for Next China, a weekly email on where the nation stands now and where it's going next.\n\nBetting on the gulf in performance between shares of two Chinese internet giants has been a slam-dunk trade this year -- and it may have further to run.\n\nInvestors who have adopted a pair trade strategy to short Tencent Holdings Ltd. while taking a long position in Alibaba (NYSE: ) Group Holding Ltd. could have made as much as 27% this year excluding dividends and execution costs, with the trade set for its best annual return in five years. The tactic turned more profitable in October, after Hong Kong-listed Tencent slumped to a nine-month low following a series of block trades.\n\n“In the long-term, the trend is probably going to continue,” said Castor Pang, head of research at Core Pacific-Yamaichi International (HK) Ltd. in Hong Kong. “A period of fast mobile-game growth in China seems to be over, and restrictions on mobile games by the government aren’t helping Tencent.”\n\nOn the other hand, Alibaba is focused on China’s online consumption, which remains strong, Pang said. Its shares rose 2.5% on Monday.\n\nA pair trade strategy typically involves taking two correlated securities, shorting one and going long on the other. The bigger the gap between performance, the more profitable the trade usually becomes. While Alibaba was up around 30% year-to-date in the U.S., Tencent has pared its gain to less than 3%, having lost around $87 billion in market value since April.\n\nTencent has been trying to bounce back from last year’s regulatory clampdown that hit its games business. China is once again approving games, albeit at a slower pace. But Tencent’s losses accelerated last week amid theories that ranged from souring sentiment from mainland investors to concerns that its decision to air National Basketball Association games may backfire.\n\nTo be sure, some investors remain bullish on Tencent, which along with Alibaba is due to report quarterly earnings next month. Among the analysts tracked by Bloomberg who cover Tencent, none have a sell rating on the stock.\n\nBut with Alibaba seen to benefit from possible measures by Beijing to boost consumption in support of a faltering economy, the trend looks set to continue, said Paul Pong, managing director at Pegasus Fund Managers Ltd.\n\n“Tencent’s growth mainly relies on games and advertisement. But fewer companies will boost marketing expenses when the economy is bad, while the government has tightened game approvals,” he said.\n\n(Updates share prices throughout)", "description": "Pitting Tencent Against Alibaba Could’ve Made You 27% This Year", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/pic4222ae6eca24e2d8f0cb866f193b3d4c.jpg", "published_at": "2019-10-29"}