{"pub": "realclearpolitics", "url": "https://msn.com/en-us/news/opinion/republicans-only-pretend-to-be-patriots/ar-AAHJJCC", "downloaded_at": "2019-09-24 13:35:23.869671+00:00", "published_at": "2019-09-24", "title": "Republicans Only Pretend to Be Patriots", "language": "en", "text": "© Gabriella Demczuk for The New York Times\n\nEditor’s note: The opinions in this article are the author’s, as published by our content partner, and do not necessarily represent the views of MSN or Microsoft.\n\nRepublicans have spent the past half-century portraying themselves as more patriotic, more committed to national security than Democrats. Richard Nixon’s victory in 1972, Ronald Reagan’s victory in 1980 and George W. Bush’s victory in 2004 (the only presidential election out of the past seven in which the Republican won the popular vote) all depended in part on posing as the candidate more prepared to confront menacing foreigners.\n\nAnd Barack Obama faced constant, scurrilous accusations of being too deferential to foreign rulers. Remember the “apology tour,” or the assertions that he had bowed to overseas leaders?\n\nBut now we have a president who really is unpatriotic to the point of betraying American values and interests. We don’t know the full extent of Donald Trump’s malfeasance — we don’t know, for example, how much his policies have been shaped by the money foreign governments have been lavishing on his businesses. But even what we do know — his admitted solicitation of foreign help in digging up dirt on political rivals, his praise for brutal autocrats — would have had Republicans howling about treason if a Democrat had done it.\n\nYet almost all G.O.P. politicians seem perfectly fine with Trump’s behavior. Which means that it’s time to call Republican superpatriotism what it was long before Trump appeared on the scene: a fraud.\n\nSign Up For the Morning Briefing Newsletter\n\nAfter all, a true patriot is willing to make some sacrifice, to give up some personal or policy goal, in the national interest. Can anyone point to any prominent figure in the modern Republican Party who has done that?\n\nIn fact, the periods in which Republicans worked hardest to wrap themselves in the flag and question Democrats’ loyalty were also periods in which the G.O.P. doubled down on its usual domestic agenda of making the rich richer. Even as George W. Bush’s administration was hyping the war on terrorism and leading America to war on false pretenses, the party was pushing for tax cuts: “Nothing,” declared Tom DeLay, the House Republican leader at the time, “is more important in the face of a war than cutting taxes.”\n\nBut if Republican superpatriotism has always been a fraud, why were so many Americans taken in? After all, polling suggests that except for a brief period after the extent of the Iraq debacle became clear, the public has consistently viewed the G.O.P. as stronger than Democrats on national security.\n\nMy guess, although I’d love to see some serious research from political scientists, is that for most of the past half-century the G.O.P.’s patriotic posturing dovetailed with its domestic political strategy, which centered on hostility to the Other.\n\n[For an even deeper look at what’s on Paul Krugman’s mind, sign up for his weekly newsletter.]\n\nRepublicans positioned themselves as the champions of white, small-town America against people of color and cosmopolitan urban elites; they also posed as the nation’s defenders against international Communism and Islamic extremism, which in reality had nothing to do either with each other or with domestic racial tensions, but somehow fit psychologically because they involved strange people with funny names.\n\nThe irony is that in the past few years this paranoid fantasy, in which a major U.S. political party is de facto allied with an international movement hostile to American values, has actually become true. But the party in question is the G.O.P., which under Trump has effectively become part of a cross-national coalition of authoritarian white nationalists. Republicans were never the patriots they pretended to be, but at this point they’ve pretty much crossed the line into being foreign agents.\n\nAnd why have both professional Republicans and the party’s base gone along with this? You need to think of Trump’s foreign entanglements in the context of a G.O.P. establishment that realizes that its domestic agenda is deeply unpopular, and a rank-and-file that sees itself on the losing side of demographic and social change. The result is a party that is increasingly willing to play dirty, violating democratic norms, to hold on to power.\n\nAnd once a party has decided to do whatever it takes to prevail politically, there’s no reason to expect the foul play to stop at the water’s edge. If a party is willing to rig political outcomes by preventing minorities from voting, if it’s willing to use extreme gerrymandering to retain power even when voters reject it, why won’t it be equally willing to encourage foreign powers to subvert U.S. elections? A bit of treason is just part of the package.\n\nWhich brings me to the political question of the moment: Should Democrats begin an impeachment inquiry? Such an inquiry almost certainly wouldn’t remove Trump from office, because Republicans in the Senate wouldn’t vote to convict. But that misses the point.\n\nWhat an impeachment process would do now is get the truth about who really cares about defending America and its values — and who doesn’t — out into the open. By forcing Republicans to explicitly condone behavior they would have called treason if a Democrat did it, Nancy Pelosi and her colleagues can finally put an end to the G.O.P.’s long pretense of being more patriotic than its opponents.\n\nThe Times is committed to publishing a diversity of letters to the editor. We’d like to hear what you think about this or any of our articles. Here are some tips. And here’s our email: letters@nytimes.com.\n\nFollow The New York Times Opinion section on Facebook, Twitter (@NYTopinion) and Instagram.", "description": "Republicans have spent the past half-century portraying themselves as more patriotic, more committed to national security than Democrats. Richard Nixon’s victory in 1972, Ronald Reagan’s victory in 1980 and George W. Bush’s victory in 2004 (the only presidential election out of the past seven in which the Republican won the popular vote) all depended in part on posing as the candidate more prepared to confront menacing foreigners. And Barack...", "authors": [], "top_image": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAHJvLY.img?h=169&w=300&m=6&q=60&o=f&l=f&x=960&y=586"}