{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/iran-chinese-state-oil-firm-withdraws-5bn-deal-191006191347427.html", "downloaded_at": "2019-10-07 00:16:12.271226+00:00", "title": "Iran says Chinese state oil firm withdraws from $5bn deal", "language": "en", "text": "China's state oil company has pulled out of a $5bn deal to develop a portion of Iran's massive offshore natural gas field, the Islamic republic's oil minister said on Sunday, an agreement from which France's Total SA earlier withdrew over US sanctions.\n\nThe South Pars field deal, struck in the wake of Iran's 2015 nuclear deal with world powers, appears to be just the latest business casualty of America's pressure campaign on Tehran following President Donald Trump's unilateral withdrawal of the US from the deal.\n\nIt also comes as China and the US engage in their own trade war, as Beijing and Washington levy billions of dollars of tariffs on each other's goods.\n\nOil Minister Bijan Zangeneh, quoted by the ministry's SHANA news agency, said on Sunday that the China National Petroleum Corp was \"no longer in the project.\"\n\nHe did not elaborate or give any reason for the withdrawal, though SHANA said the company \"had pulled out of a contract\" to develop the field.\n\nOfficials in Beijing did not immediately acknowledge their decision. Phone calls to the CNPC rang unanswered on Sunday and its website bore no mention of the withdrawal.\n\nHowever, Iranian Foreign Minister Mohammad Javad Zarif separately complained on Sunday about the US campaign against Tehran and its impact on foreign investments.\n\n\"We have been facing plenty of problems in the field of investment because of the US maximum pressure policy,\" Zarif told a parliamentary committee, according to the semi-official Tasnim news agency. \"We are trying to remove the problems.\"\n\nTehran-based political analyst Saeed Leilaz said he believed that despite China's departure from the project, \"China will remain Iran's main trade partner\".\n\nLeilaz said that was because a large portion of past oil revenue from China had remained in the country, enabling Tehran to buy goods it needed from China without transferring money from Iran, thereby evading US sanctions on Iran's banking system.\n\nIran holds the world's second-largest known reserves of natural gas and the world's fourth-largest oil reserves.\n\nMuch of its natural gas comes from its massive South Pars field, which it shares with Qatar. The initial plan for the development of South Pars involved building 20 wells and two wellhead platforms, a project that would have a capacity of 2 billion cubic feet of natural gas a day.\n\nUnder terms of the initial deal, Total was to have a 50.1 percent stake, with CNPC getting 30 percent and the Iranian firm Petropars getting 19.9 percent.\n\nWith Total's withdrawal, CNPC had taken over the French firm's stake. Now Petropars will develop the field alone, Zangeneh said.\n\nTotal first pulled out of Iran in 2006 as United Nations sanctions first took hold over fears Iran's atomic programme would be used to build nuclear weapons. Tehran has maintained its programme is only for peaceful purposes.\n\nIran cancelled another CNPC contract in 2012 amid increasing international sanctions which led to the 2015 nuclear deal.\n\nAfter withdrawing from the nuclear deal with Tehran over a year ago, the US imposed sanctions on Iran that have kept it from selling its oil abroad and have crippled its economy.\n\nIran has since begun breaking terms of the nuclear deal. In late September, the US sanctioned Chinese shipping firms it said were ferrying Iranian crude oil.\n\nThere also have been a series of attacks across the Middle East that the US blames on Iran.\n\nTensions peaked on September 14, when a missile and drone attack hit Saudi oil installations, causing oil prices to spike by the biggest percentage since the 1991 Gulf War.\n\nWhile Yemen's Iranian-linked Houthi rebels claimed the assault, Saudi Arabia says it was \"unquestionably sponsored by Iran\".\n\nIran denies being responsible and has warned any retaliatory attack targeting it will result in an \"all-out war.\"", "description": "The Chinese company has pulled out of the deal in what appears to be the latest economic setback due to US sanctions.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/6/16e047c79e36437e911860e64a594844_18.jpg", "published_at": "2019-10-06"}