{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7541441/U-S-North-Korea-nuclear-talks-broken-N-Korea-negotiator.html", "downloaded_at": "2019-10-05 23:03:07.641284+00:00", "title": "U.S.-North Korea nuclear talks have broken off - N.Korea negotiator", "language": "en", "text": "Working-level nuclear talks between North Korea and the United States have broken off, North Korea's chief negotiator said on Saturday.\n\n'The negotiations have not fulfilled our expectation and finally broke off,' the North's chief nuclear negotiator, Kim Myong Gil, told reporters through an interpreter outside the country's embassy in Stockholm.\n\nThe North Korean delegation arrived in Stockholm on Thursday for the working-level denuclearization talks.\n\nKim blamed Washington for bringing 'nothing to the negotiation table' at the meeting, which came after months of stalemate.\n\nHe said talks broke down 'entirely because the U.S. has not discarded its old stance and attitude.'\n\nNorth's chief nuclear negotiator, Kim Myong Gil (seen on the steps), gives a statement to the media outside Pyongyang's embassy in Stockholm, Sweden on Saturday\n\nBut State Department spokesperson Morgan Ortagus said Kim's comments did 'not reflect the content or the spirit' of the 'good discussions' that took place over eight-and-a-half hours, adding that the U.S. accepted an invitation from Sweden to return to Stockholm in two weeks to continue discussions.\n\nThe talks with Stephen Biegun, US President Donald Trump's special envoy, were a much-anticipated resumption of dialogue after a Hanoi meeting in late February between Trump and North Korean leader Kim Jong Un failed to yield a breakthrough.\n\nIt came also after Pyongyang's defiant test of a sea-launched ballistic missile this week.\n\nAn underwater-launched missile fell inside Japan's exclusive economic zone Wednesday.\n\n'The US raised expectations and offered suggestions like flexible approach, new methods and creative solutions but they have disappointed us greatly, and dampened our enthusiasm for negotiations by bringing nothing to the negotiation table,' Kim said.\n\nThe situation on the Korean peninsula 'stands at the crossroads of dialogue or confrontation,' he said.\n\nThe meeting place was a heavily guarded venue on an island off Stockholm, several hundred yards from the North Korean embassy, an AFP correspondent said.\n\nBecause the U.S. does not have official diplomatic relations with North Korea, Sweden has often acted as a bridge between Washington and Pyongyang.\n\nAs it got underway, Swedish Foreign Minister Ann Linde tweeted: 'I am encouraged that US and (North Korean) working level delegations are currently in Sweden to hold talks.\n\nPyongyang tested what it called a 'super-large' rocket on Wednesday just hours after it said it was willing to resume working-level talks with Washington\n\n'Dialogue needed to reach denuclearization and peaceful solution,' she said.\n\nIn a statement, Ortagus said the U.S. delegation 'previewed a number of new initiatives that would allow us to make progress in each of the four pillars' of a joint statement issued after Trump and Kim's first summit in Singapore.\n\n'The United States and the DPRK will not overcome a legacy of 70 years of war and hostility on the Korean Peninsula through the course of a single Saturday,' Ortagus said\n\nSimilar-level talks on North Korea's nuclear disarmament were held in Stockholm in March 2018 and then in January this year.\n\nNorth Korea claimed to have entered a new phase in its defense capability with Wednesday's test of a submarine-launched ballistic missile - the most provocative since Pyongyang began a dialogue with Washington in 2018.\n\nNorth Korea frequently couples diplomatic overtures with military moves as a way of maintaining pressure on negotiating partners, analysts say, and may believe this weapons system gives it added leverage.\n\nThe Pentagon said Thursday the missile seems to have been launched from a 'sea-based platform' and not a submarine.\n\nTrump has said he sees no problem with a string of short-range rocket tests conducted previously by North Korea, while insisting his personal ties with the North's leader remain good.\n\nThe launch was the most provocative by North Korea since it resumed dialogue with the United States in 2018. UN Security Council resolutions ban Pyongyang from using ballistic missile technology.\n\nPhotos carried by Pyongyang's official Rodong Sinmun newspaper showed a black and white missile emerging from the water and appearing to shoot into the sky.\n\nThe images also showed a small towing vessel next to the missile, which analysts said indicates the test was conducted from a submersible barge rather than an actual submarine, and that the system was in its early stages.\n\n'The new-type ballistic missile was fired in vertical mode' in the waters off Wonsan Bay, the Korean Central News Agency (KCNA) reported, identifying the weapon as a Pukguksong-3 and saying it 'ushered in a new phase in containing the outside forces' threat.'\n\nThe United Nations Security Council meanwhile is expected to hold closed-door talks early next week on the latest test, diplomats said.\n\nThose talks were requested by Britain, France and Germany, as the European powers push for the world body to keep up pressure on Pyongyang which is under heavy US and UN sanctions over its weapons program.\n\nNorth Korea is banned from ballistic missile launches by Security Council resolutions.\n\nIt is also under three sets of UN sanctions adopted in 2017 in an effort to force it to give up its nuclear and ballistic weapons programs.\n\nThe North Koreans and the United States broke off negotiations just hours after they started. The above image shows President Trump (right) with Kim Jong-un at their first summit in Singapore in June 2018\n\nThey limit North Korea's oil imports and impose bans linked to its exports of coal, fish and textiles.\n\nSince the US-North Korea talks began, Russia and China have been calling for the UN to start lifting sanctions so as to create momentum towards the North's denuclearization.\n\nBut the United States has refused.", "description": "North Korea's chief nuclear negotiator, Kim Myong Gil, announced the end of nuclear talks with the United States on the steps of his country's embassy in Stockholm, Sweden on Saturday.", "authors": [], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/20/19340238-0-image-a-36_1570302089535.jpg", "published_at": "2019-10-05"}