{"pub": "theverge", "url": "https://theverge.com/2019/10/15/20915250/sony-360-reality-audio-release-date-amazon-partners", "downloaded_at": "2019-10-15 23:06:45.273954+00:00", "title": "Sony is launching its 360-degree audio format this fall", "language": "en", "text": "Sony has announced that its new 360 Reality Audio technology will launch in late fall with several partners. The format involves object-based spatial audio that places various elements of a music track around the listener in a virtual spherical environment. The experience is designed to replicate live music, with instruments and vocals coming from different directions.\n\nAt launch, there will be around 1,000 songs available in 360 Reality Audio, including tracks from artists like Pharrell Williams, Bob Dylan, and Billy Joel. Sony has also captured live performances from artists such as Charlie XCX and Kodaline and converted them to the new format. Sony will of course be able to leverage music from its own record label, but the company says it’s also working with Universal, Warner, and Live Nation to add more content.\n\nSony has partnered with Amazon Music HD, Deezer, and Tidal\n\n“360 Reality Audio is a proof point that innovation never stops,” Sony Electronics (North America) president and COO Mike Fasulo said in a press release. “The confluence of deep technical roots, tireless artists and forward-thinking hardware and semiconductor partners illustrates the tremendous draw of this radical new way to make music even more moving. Together with valued industry partners, Sony has architected the most powerful, realistic music experience for listeners and a new medium for artists to create.”\n\nAs for how you’ll actually get to listen to 360 Reality Audio, Sony has partnered with Amazon Music HD, Deezer, Tidal, and nugs.net. That’s bad news for Spotify or Apple Music users, then, but Sony does call out Amazon’s promising new Echo Studio as a way to play back this music natively. Other speakers will require Sony’s 360 Reality Audio decoder along with “multiple speaker units and signal processing technology,” so it’s unlikely that this’ll work for many existing setups.\n\nHowever, at launch the only mobile app support will come through “headphones from most manufacturers” when used with the Tidal, Deezer, and nugs.net iOS and Android apps. Certain recent Sony headphones will also be able to produce a “custom immersive musical field” through the Headphones Connect app, although it’s not clear how exactly that’ll work with external content.\n\nThis will clearly be something that needs to be experienced in person to judge. Sony does appear to be making its best effort to make this a thing, but the same could have been said of various Sony-backed formats in recent decades. The news that it’ll work on Amazon’s new high-end Echo gives it a pretty good use case right out of the gates, though, and we’re looking forward to hearing more.", "description": "Sony has announced that its new 360 Reality Audio technology will launch in late fall with several partners. The format involves object-based spatial audio that places various elements of a music track around the listener in a virtual spherical environment. The experience is designed to replicate live music, with instruments and vocals coming from different directions.", "authors": ["Sam Byford", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/f796jlpPJ1MlombztjVZKKc4ax4=/0x38:2040x1106/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19230650/DSCF5804.jpg", "published_at": "2019-10-15"}