{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/14/brexit-loyalists-warn-bombs-limerick-boris-abandons-northern-ireland-eu", "downloaded_at": "2019-10-14 23:25:35.364029+00:00", "title": "Threats of 'Bombs in Limerick' if Boris Abandons Northern Ireland to EU", "language": "en", "text": "Members of loyalist paramilitary groups in Northern Ireland have threatened action if Boris Johnson’s Brexit deal devalues the status of Northern Ireland in the United Kingdom.\n\nSpeaking to The Times on Sunday, well-known loyalist Robert Girvan said: “I can’t see loyalism of any strand just walking into a situation where there is any type of economic union with the Irish Republic. I was talking to someone who said we’ll see how hard the border is if bombs start going off in Limerick.”\n\nUnited Kingdom, Republic of Ireland Leaders in Last-Minute Meet to Discuss Brexit Deal https://t.co/g87NH4W9CZ — Breitbart London (@BreitbartLondon) October 10, 2019\n\nHe went on to say: “This is not empty rhetoric. When a loyalist says ‘over my dead body’, they mean it. The dog is in the trap and we are waiting to see when the hare will be released.”\n\nAt issue are the rumoured customs and regulatory checks on the Irish Sea in Boris Johnson’s latest attempt at striking a deal with the European Union. Loyalists in Northern Ireland believe this is a move that would align their economy more with Dublin than London, which they feel could lead to a united Ireland.\n\nThreats of violence harken back to the times of ‘The Troubles’, a conflict that consumed Northern Ireland by terrorists in favour of Irish unification and to a lesser degree loyalist paramilitary groups like the Ulster Volunteer Force and Ulster Defence Association (UDA).\n\nA member of the UDA told The Times: “Boris Johnson has shafted the loyalist people of Northern Ireland. The Democratic Unionist Party [DUP] are not the only people Boris should be consulting.”", "description": "Loyalists in Northern Ireland have threatened action if Boris Johnson’s deal devalues the status of Northern Ireland", "authors": ["Kurt Zindulka"], "top_image": "https://media.breitbart.com/media/2019/10/Loyalist-paramilitaries-640x335.png", "published_at": "2019-10-14"}