{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/why-plane-tires-dont-explode-during-landing-2019-10", "downloaded_at": "2019-10-26 00:04:07.295038+00:00", "title": "Why plane tires don't explode during landing", "language": "en", "text": "Plane tires can handle thousands of pounds of weight and high speeds — and it's mostly due to how they're made.\n\nA combination of sturdy materials and nitrogen create a tire strong enough to handle the rigorous conditions upon landing.\n\nGoodyear, one of the leading manufacturers of plane tires, gave Business Insider a look into its factory to see how it ensures tires are up to its standards.\n\nVisit Business Insider's homepage for more stories.\n\nFollowing is a transcript of the video.\n\nNarrator: If you dropped a watermelon at 170 mph, it would be a mess. Strap over 500,000 pounds to its back and it would be, well, nothing.\n\nBut airplane tires manage that impact every day, without incident. They're made to withstand hitting the pavement at extreme speeds, all while supporting an entire commercial jet. Don't think too hard about it next time you're in the air, but 45 inches of rubber is the only thing standing between you and the tarmac during landing.\n\nSo, what makes them tough enough for the job?\n\nIf you've ever driven down a US highway, you've probably seen shredded tires along the way. Semitruck tires aren't supposed to explode, but they do. Airplane tires? Not so much. There are a few differences between the two.\n\nFirst of all, a semitruck isn't falling out of the sky as part of its route. Those tires don't need to be made to withstand the same high speeds and weights. Airplane tires, on the other hand, need to be reinforced.\n\nBrandy Moorhead: They're made with a combination of proprietary synthetic rubber compounds, which are paired with aluminum steel reinforcements and nylon and aramid fabrics.\n\nNarrator: That's Brandy. She's in charge of Goodyear's aircraft tires, and she told us that airplane tires are inflated twice as much as truck tires and six times as much as a car's. That's because the higher the pressure, the firmer the tire, and the more strength it has to support the plane. And when they're inflated, it's not with regular air. Airplane tires are filled with nitrogen.\n\nBrandy: Nitrogen is an inert gas, so high temperatures and pressure changes have less effect.\n\nNarrator: Plane tires are subjected to the most rigorous conditions of any vehicle tire. When Goodyear develops a new airplane tire, it starts with a prototype. Then the tires are tested beyond their breaking points. They're tested for speed, pressure, and the ability to handle a load up to 38 tons. So they have to be made very differently than other tires. Instead of the blocky design seen on a lot of car tires, plane tires get groovy.\n\nBrandy: That blocked pattern enables different maneuvering and different characteristics of ride and handling, which are required by an automobile, as opposed to just an aircraft that takes off and lands on a runway. The reason we have grooves in an aircraft tire at all is because we need to evacuate water if we were to land on a wet surface.\n\nNarrator: Commercial jets usually have around 20 tires and touch down about 500 times before they have to be retread, which can be done seven times before the tire's no better than scrap rubber. And tires at the nose of the plane tend to have shorter life spans than the rest.\n\nIt takes two mechanics up to an hour to change a single tire. They raise the tire only 5 centimeters off the ground, which doesn't feel like enough room to fit a thumb, let alone change a plane tire. The mechanics take off the hubcap and reduce the tire pressure from 200 to 30 psi, which reduces the risk of it exploding as the bolts and nuts holding it on the plane are removed. A sleeve protects the axle, and a lifting tool pulls the tire off. The axle sleeve is then greased, and the new tire is slid smoothly on. And then things move in reverse: nuts and bolts, tire reinflated to 200, hubcap back on, and the whole thing is gently lowered 5 centimeters back onto the ground.\n\nSo, what happens after 500 landings, seven retreadings, and uncountable \"This is your captain speaking\"s? A lot of the tires get recycled into playground mulch and even other tires for farming equipment. Those tires will be made from old plane tires, but not like them. There's no need. Because if a farmer is using their tractor the same way they'd use a plane, well, they're doing it wrong.", "description": "Plane tires need to support thousands of pounds of weight at high speeds, so why don't they pop? We talked to Goodyear, who told us why.", "authors": ["Jade Tungul"], "top_image": "https://image.businessinsider.com/5daf70474af9090d354eaf54?width=1200&format=jpeg", "published_at": "2019-10-24"}