{"pub": "vice", "url": "https://vice.com/en_asia/article/ne853z/cops-rescue-five-owls-being-delivered-to-an-occultist-for-a-diwali-sacrifice", "downloaded_at": "2019-10-24 13:55:49.210634+00:00", "title": "Cops Rescue Five Owls Being Delivered to an Occultist for a Diwali Sacrifice", "language": "en", "text": "This article originally appeared on VICE India.\n\nThe Ghaziabad police managed to save five owls that were being delivered to an occultist for sacrifice on the night of Diwali, The Times of India reports.\n\nThe owls, which are considered one of India’s most precious birds, were worth Rs one crore ($141,160).\n\nIn India, owls are protected under the Wildlife Act of India, making the hunting, trade and utilisation of the animals or their body parts illegal. The international trade of owls is also restricted under the Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES).\n\nTwo men, identified by police as Sumit and Pradeep, were delivering the owls on a motorbike when cops caught them. They hid the owls in buckets.\n\nGoddess Lakshmi is celebrated on Diwali night, and occultists sacrifice her vaahan (vehicle/mount), the owl, because they believe it will bring prosperity and get rid of bad luck. Because of this, police say the smuggling of owls has increased in the past years, and spikes around Diwali time. Some occult practitioners also believe owl parts can cure certain illnesses and fight evil spirits.\n\n“Every part of an owl’s body has significance in sorcery and black magic,\" Abrar Ahmad, an ornithologist, told The Times of India. \"A live owl buried during Diwali outside the door of a house is supposed to bring prosperity. In one of the rituals, the bird is even blinded before it is slowly killed over days.\" A factsheet published by wildlife trade monitoring network TRAFFIC says: \"Use of owls in black magic and sorcery linked with superstition, totems, and taboos drives the illegal trade of owls in India. Shaman or black magic practitioners, frequently referred to as tantrics in India, prescribe the use of parts from live owls such as skull, feathers, ear tuffs, claws, heart, liver, kidney, blood, eyes, fat, beak, tears, eggshells, meat, and bones for ceremonial pujas and rituals.\"\n\nWith regards to the recent case, the police handed over the owls to the forest department, while the two men are in jail. They are trying to track down and arrest exorcists in the area.\n\nAlthough it is not sure how many owls are smuggled in India every year, TRAFFIC estimates the figure is in the thousands.\n\nFind Edoardo on Twitter and Instagram.", "description": "The Festival of Lights is actually a dark time for the bird because of its status as Goddess Lakshmi's vehicle.", "authors": [], "top_image": "https://video-images.vice.com/articles/5db135ab1b88db0092b875a8/lede/1571895640174-pjimage-26.jpeg?crop=1xw:1xh;center,center&resize=1200:*", "published_at": "2019-10-24"}