{"pub": "wsj", "url": "https://wsj.com/articles/how-to-get-rid-of-carbon-emissions-pay-farmers-to-bury-them-11568211869?mod=rsswn", "downloaded_at": "2019-09-12 07:19:20.326746+00:00", "title": "How to Get Rid of Carbon Emissions: Pay Farmers to Bury Them", "language": "en", "text": "AINSWORTH, Iowa—What if there was a way to combat climate change that didn’t require technological breakthroughs, carbon taxes or eliminating all fossil fuels?\n\nSuch a solution might lie here in an Iowa cornfield beneath the feet of Mitchell Hora, a seventh-generation farmer. Mr. Hora experiments with “regenerative growing practices” that improve soil health, boost yields, reduce water and fertilizer use, and carry a significant collateral benefit: they sequester in the soil carbon released from burning fossil fuels.\n\nMr. Hora could soon be rewarded for providing this social benefit. Indigo Ag Inc., a Boston-based company specializing in agricultural technology and management, is setting up a market for carbon credits. Companies and consumers with voluntary or compulsory commitments to reduce their carbon footprint can, rather than reduce emissions themselves, pay farmers to do it for them. Via the Indigo Carbon marketplace, they can pay farmers like Mr. Hora $15 to sequester one metric ton of carbon dioxide in the soil.\n\n“I’ve been doing all of this out of my own pocket,” says Mr. Hora. “Most farmers cannot take on that kind of risk, to experiment and to try to change. But now, with Indigo Carbon, it gives them that incentive to actually try.”\n\nMitchell Hora inspects some corn in Iowa on Aug. 22. Photo: Greg Ip/The Wall Street Journal\n\nDavid Perry, Indigo’s chief executive, is almost messianic about the potential: “We could soak up half to 100% of all the carbon dioxide emitted since the industrial revolution,” or roughly one trillion tons.\n\nThe Rodale Institute, a think tank that promotes organic agriculture and has partnered with Indigo, cites trials that suggest through regenerative growing practices, an acre of agricultural land can sequester one to 2.6 tons of carbon dioxide a year. Extrapolating to the world, that equals the about 37 billion metric tons of carbon dioxide released globally through fossil fuel use each year.\n\nThat’s not realistic, according to Rattan Lal, a soil scientist who heads the Carbon Management and Sequestration Center at Ohio State University. He says the maximum soil sequestration that can be achieved, under ideal conditions, is nine billion tons and even that—given the political and practical obstacles—“is a dream.” In 2015 France persuaded the world to commit to raising the carbon content of soil by 0.4% per year and it has yet to trigger any meaningful action.\n\nA more feasible goal, he says, would be six billion tons globally, including one billion in the U.S. That won’t absorb all or even most fossil-fuel emissions, but could offset those from sectors with no realistic alternative to fossil fuels, such as aviation and steel making.\n\nFarmer Mike Thomas also uses ’regenerative growing practices.’ Photo: Greg Ip/The Wall Street Journal\n\nExisting schemes encourage carbon sequestration in forests but face an intrinsic tension: A landowner must give up the income a forest generates—such as wood, paper or as farmland—for the world’s greater good. By contrast, increasing soil’s carbon content makes farming potentially more profitable.\n\nPlants convert atmospheric carbon dioxide into carbon through photosynthesis. As plants die they deposit that carbon in the soil. Traditional farming undoes that process. Tilling disturbs carbon structures, causing them to recombine with oxygen and enter the atmosphere as carbon dioxide, while fertilizers, pesticides and herbicides leach carbon into the water and air while generating nitrous oxide, a potent greenhouse gas.\n\nRegenerative farming reduces atmospheric carbon dioxide by increasing the volume of plants grown and keeping more of their carbon in the soil when they die. Instead of disturbing the soil with tilling, farmers drill holes to plant seeds. Rather than leave the earth between cash crops bare, they plant cover crops that reduce erosion and add plant matter. Indigo sells seeds treated with naturally occurring microbes to resist pest and fungal disease and drought, reducing the dependence on pesticides, fungicides, water and genetically modified organisms.\n\nThe resulting soil holds more nutrients and moisture. Mr. Hora holds out a shovel of black, moist soil that is literally crawling with life: “This is exciting, there are at least half a dozen worms in this shovelful.” He boasts that his soil can absorb two inches of rain in 20 minutes, while it runs off other farms.\n\nRegenerative farmers say healthier plants result. Mike Thomas, a farmer in western Iowa, says no-till farming and Indigo seeds helped his corn and soybeans survive a drought earlier this year with less stress. A neighbor asked what he sprayed them with to get such results. He answered, “We didn’t spray them with anything.”\n\nU.S. Farmers on China Tariffs: ‘This Isn’t Just a Chess Match’ The trade war with China is putting a strain on the U.S. agriculture industry. WSJ’s Jason Bellini sat down with a group of farmers from the corn, beef, soybean, and dairy industries to hear how tariffs are affecting their businesses.\n\nHealthier plants can lead to higher yields and thus revenue, while reduced irrigation, fertilizer and spraying saves money. So why do so few farmers practice regenerative farming? In part, because of the transition cost—such as for specialty seeds and equipment like a no-till seed drill—and the risk that yields will drop at first.\n\nMr. Perry says carbon credits received through Indigo’s market should defray those costs and exceed many farmers’ regular crop income. While Indigo will advise farmers on regenerative practices, “once you create the economic incentive, likely we’ll find lots of methods that aren’t known today.”\n\nIndigo has so far signed up farmers with more than two million acres for its carbon market and is currently negotiating to sign up companies that will purchase the carbon credits to meet voluntary emissions commitments. If all goes according to plan, farmers could see their first payments a year from now.\n\nBut voluntary carbon commitments are too small to achieve meaningful emissions reductions. That would require some federal involvement. Most politicians, even Republicans, accept climate change is a reality but are reluctant to act because regulations and carbon taxes are so unpopular.\n\nIn theory, the federal government could avoid that stigma by paying farmers a carbon credit, which is in effect a negative carbon tax. Indeed, last year Congress passed a budget bill that included an expanded tax credit to energy companies that capture and store carbon dioxide underground.\n\nSoil sequestration has two advantages over carbon capture and storage: the technology has been proven safe and effective and farmers enjoy more bipartisan support than oil companies. Democratic presidential candidate Bernie Sanders last month proposed paying farmers $160 billion for soil improvements that sequester carbon.\n\nMeanwhile, President Trump has authorized $28 billion to farmers injured by the trade war with China.\n\nGiven all that, paying farmers $15 billion to sequester a billion tons of carbon dioxide starts to seem cheap.\n\nSHARE YOUR THOUGHTS Should taxpayers pay farmers to adopt practices that reverse climate change? Why or why not? Join the conversation below.\n\nWrite to Greg Ip at greg.ip@wsj.com", "description": "What if there was a way to combat climate change that didn’t require technological breakthroughs, carbon taxes or eliminating all fossil fuels? Look to Iowa for the answer.", "authors": ["Greg Ip"], "top_image": "https://images.wsj.net/im-105721/social", "published_at": "2019-09-11"}