{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/20/alonso-hits-50th-homer-degrom-mets-beat-reds-8-1", "downloaded_at": "2019-09-21 03:39:43.456795+00:00", "title": "Alonso hits 50th homer; deGrom, Mets beat Reds 8-1", "language": "en", "text": "CINCINNATI (AP) - Pete Alonso felt going into the season that reaching 50 home runs was possible.\n\nNow that he’s there, it’s become hard to believe.\n\nNew York’s rookie first baseman hit his major league-leading 50th home run, Jacob deGrom pitched shutout ball for seven innings and the Mets beat the Cincinnati Reds 8-1 Friday night.\n\n“It was always in the realm of possibility,” Alonso said. “It’s hard to wrap my mind around it. It means the world to me, but I don’t think I’ll be able to appreciate it until after the season.”\n\nAmed Rosario hit a two-run homer and Jeff McNeil added a solo shot for the Mets, who remained 3 1/2 games behind Milwaukee for the second NL wild card after the Brewers beat the Pirates 10-1.\n\nAlonso is two homers shy of Yankees star Aaron Judge’s 2017 total for the rookie record. The right-handed hitter connected on a two-run blast in the eighth inning against reliever Sal Romano, reaching for a down-and-away fastball and lining it an estimated 437 feet to the faux riverboat smokestacks in right-center field.\n\n“The catcher reached down and to the right and he reached out and flicked it to the steam towers,” New York manager Mickey Callaway said. “It was a well-executed pitch. I don’t know what you do if you’re a pitcher. (Former Red) Todd Frazier said he’s never seen a left-hander hit one there.”\n\nAlonso is the second rookie to reach 50 homers, and he leads Cincinnati’s Eugenio Suarez by two for most in the majors.\n\nThe Reds intentionally walked Alonso during New York’s three-run ninth.\n\nCincinnati rookie Aristides Aquino led off the ninth with a homer. The midseason call-up has 17 home runs in 49 games this season.\n\nDeGrom (10-8) struck out nine and didn’t walk anybody to match his win total from last season, when he won the NL Cy Young Award. He could be a repeat winner after dropping his ERA to 2.51.\n\n“I’ve been able to locate all my pitches and throw them when I want,” deGrom said. “Having the feel of my curve and changeup and moving the fastball in and our helps keep them off balance.\n\nMcNeil broke up the scoreless tie with his 23rd homer, a towering drive into the visitors’ bullpen down the right field line with one out in the sixth inning.\n\nRosario followed J.D. Davis’s two-out walk with a two-run shot to left-center field, his 14th homer.\n\nThose were two of the three hits allowed by Luis Castillo in seven innings. Castillo (15-7) struck out seven and walked three.\n\n“We got to see first-hand why deGrom is so good,” Reds manager David Bell said .”I saw really sharp stuff. He had it all going. I saw the same thing with Castillo. He was really good. You can’t do much better than that. You’d like to have those two pitches back, but he was really good.”\n\nSEVENS ARE WILD\n\nThe start was deGrom’s seventh straight and 11th in his last 12 in which he logged exactly seven innings.\n\nMINGLING\n\nMarty Brennaman, retiring this year after 46 seasons as a Reds broadcaster, and partner Jeff Brantley broadcast the game from a special booth built near a section of lower-level seats.\n\nLORENZEN’S CLEMENTE\n\nReds pitcher Michael Lorenzen was honored before the game as the Reds nominee for the Roberto Clemente Award. Lorenzen, who also plays outfield, wears No. 21 in honor of Clemente.\n\nMOVING UP\n\nCastillo’s seven strikeouts boosted his season total to 218, good for a tie with Aaron Harag in 2007 for ninth on the franchise’s single-season strikeout list. Tom Seaver is eighth with 226 in 1978.\n\nTRAINER’S ROOM\n\nMets: RHP Robert Gsellman’s bullpen session went “extremely well,” Callaway said. A Saturday evaluation will determine whether the next step is pitching live batting practice. Gsellman has been out since August 14 with right triceps tightness.\n\nReds: Manager David Bell considers the return of OF Jesse Winker (cervical strain) this season “highly unlikely.” Winker has been sidelined since August 22.\n\nUP NEXT\n\nMets: RHP Zack Wheeler (11-7) is 5-1 with a 2.93 ERA over his last 10 starts. New York is 7-3 in those games.\n\nReds: RHP Anthony DeSclafani (9-9) is 0-3 with a 6.75 ERA in four career starts against the Mets.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Pete Alonso felt going into the season that reaching 50 home runs was possible.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/20/mets_reds_baseball_40020_c0-180-4302-2688_s1770x1032.jpg?4dddf05cff45dca76343df699e08fcff78895688", "published_at": "2019-09-20"}