{"pub": "businessinsider", "url": "https://businessinsider.com/how-make-someone-like-you-5-minutes-with-likability-approach-2019-9", "downloaded_at": "2019-10-02 15:44:05.016717+00:00", "published_at": "2019-09-30", "title": "How to make someone like you in under 5 minutes, according to a relationship expert", "language": "en", "text": "Debra Roberts, LCSW, is an author, a relationship expert, and a communication specialist with over 20 years of experience working with challenging relationships.\n\nThe need to be liked is a fundamentally human one. And people do business with people that they like.\n\nEmployers should be teaching with their employees about the importance of likability and relationship building.\n\nEmployees should recognize the other person's experience, learn, listen, and validate it.\n\nVisit Business Insider's homepage for more stories.\n\nWe all want to be liked.\n\nDr. Roger Covin, a clinical psychologist (and author of The Need to be Liked) refers to our need to be liked as \"a fundamental human drive that most people are born with, and it is completely normal.\"\n\nSo how do we take this concept of likeability and apply it to real life relationships, both in business and in our personal lives?\n\nA research study from 2009 describes wanting to be liked as The Fundamental Principle of Liking (FPL). FPL states that at a basic level, people like others whom they believe have positive, desirable traits, such as generosity and kindness. These positive traits are at the core of building lasting relationships.\n\nAnd in business circles, a popular saying is that \"people do business with people they know, like, and trust.\" Simply put, \"being liked\" is a critical part of starting a new business relationship with a customer or employee.\n\nDebra Roberts. Courtesy of Debra Roberts\n\nWith this in mind, employers should be teaching their employees about likability and the importance of relationship building so they can create immediate positive connections with customers and quickly be seen as trustworthy. As those relationships develop, customer retention will increase and ultimately, that customer's lifetime value will boost the company's revenue. It's a win-win and all it starts with basic training for how to be an effective communicator.\n\nYet, most business owners presume the training process is difficult and time-consuming, and they don't know how to teach this likability skillset to their employees. In reality, it only takes a few minutes … and it's well worth the effort.\n\nRead more: I'm an executive headhunter and emotional intelligence expert. Here's my 3-pronged solution for making salary negotiations easier.\n\nWhether you're a business owner who wants your employees to learn effective relationship building skills, or on a first date and hoping to have a second, here's a great five-minute \"likability approach\" to increase your odds for success:\n\nA great 5-minute approach\n\nLet's start from the beginning. By nature, people respond positively when another person makes them feel important, heard, and cared for.\n\nThis is why I always recommend that you start by listening to the other person's needs and concerns. Listen with genuine curiosity and interest. Validate their experience (i.e. their feelings) and a relationship will automatically begin to grow.\n\nYou don't necessarily have to agree with the other person's feelings or opinions, but you must respectfully and authentically acknowledge their experience in that moment … because everyone wants to feel heard and important; it lets them know they matter to you.\n\nIt's that simple.\n\nThe bottom line is: the more important the relationship is to you, the more important it is to demonstrate an understanding of the other person's experience. This is how we connect with others.\n\nWhen an employer takes a few minutes to sit with an unhappy employee and tries to understand the reasons for their dissatisfaction, that's the start of a connection. The employee likes that his/her boss took time to check in. It shows concern and caring.\n\nIf a customer service rep begins a conversation with a tough customer by acknowledging the long shipping delays and apologizing for the inconvenience, rather than avoiding the potential confrontation, the conversation has a better chance of going in a positive direction. It's their responsibility to let the customer know they matter and that their happiness is important to the company. In both scenarios, the focus of the interaction is on the current experience that the employee or the customer is having. When we recognize the other person's experience, we are starting to build a relationship.\n\nAfter employees use these skills, to learn, listen, and validate their customer's experience, the connection can become immediate and automatic.\n\nWhile it obviously takes time to fully grow trust and feel safe in any relationship, it's a much quicker process to start by connecting and getting the other person to like you. We can create that instant connection (in five minutes or less) with an employee, a customer, or even a first date, when we make a conscious effort to actively understand the other person and connect with their experience. Regardless of the type of relationship, in business or your personal life, it's all the same strategy.\n\nPay attention, listen, and validate. Let the other person know that what they're saying and how they're feeling matters to you, and you'll be on your way.\n\nDebra Roberts, LCSW, is an author, a relationship expert and a communication specialist. She has over 20 years of experience working with all types of challenging relationships. She's the author of The Relationship Protocol, a practical communication model for starting conversations, defusing conflicts, and having more fulfilling relationships. Visit TheRelationshipProtocol.com", "description": "People want to do business with people that they like. Building that likability is often easier than we think.", "authors": ["Debra Roberts"], "top_image": "https://image.businessinsider.com/5d8e17c52e22af17ce7921ed?width=1200&format=jpeg"}