{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/quant-traders-train-their-algorithms-invest-like-warren-buffett-2019-10-1028614698", "downloaded_at": "2019-10-21 13:19:43.194687+00:00", "title": "A team of quant traders are training their algorithms to invest like Warren Buffett", "language": "en", "text": "Paul Morigi/Getty Images for Fortune/Time Inc\n\nA team of quantitative traders in London are training their algorithms to invest like Warren Buffett.\n\nUnlike many algorithmic trading funds that constantly buy and sell assets, Havelock London aims to identify undervalued businesses and invest for the long term, according to the Financial Times.\n\n\"Traditionally, quants are a mile wide and an inch deep,\" founder and CEO Matthew Beddall told the newspaper. \"We try to be a mile deep and an inch wide.\"\n\nVisit Business Insider's homepage for more stories.\n\nA team of quantitative traders in London are training their algorithms to invest like Warren Buffett.\n\nAlgorithmic trading typically involves constantly buying and selling assets. Havelock London, which operates out of a basement office sandwiched between a pub and a Chinese restaurant, wants to buck that trend.\n\n\"Traditionally, quants are a mile wide and an inch deep,\" Matthew Beddall, Havelock's founder and CEO, told the Financial Times. \"We try to be a mile deep and an inch wide.\"\n\nHavelock aims to emulate Buffett and his mentor, Benjamin Graham, by applying the principles of 'value investing' — spotting companies whose intrinsic value isn't fully captured by their market valuation.\n\nThe firm's six employees track 38 companies at the moment, and combine their judgement with computing power to identify undervalued businesses and invest in them for the long term, the Financial Times reported.\n\n\"At the heart of what we do is estimating what a company is worth based on the economics of its underlying business (aka intrinsic value),\" Beddall told Markets Insider. \"We then place much more weight on our view of the value of a company, than that of the current market price.\n\n\"The simple idea that investors should focus all of their attention on figuring out what companies are worth comes squarely from following Buffett's common sense teachings,\" he added.\n\nBeddall — the former investment chief of Winton Capital Management, one of the world's largest quantitative hedge funds — founded Havelock in August 2018. The firm now boasts £14 million ($18.2 million) in assets, and invests in stocks and both government and corporate bonds without leverage or shorting. It has returned 5% to date, outstripping the MSCI World Index over the same period, the Financial Times reported.\n\nBuffett, the CEO and chairman of Berkshire Hathaway, became one of the world's richest people by investing in companies such as Coca-Cola, Bank of America, and more recently Apple.\n\nHowever, the so-called \"Oracle of Omaha\" has come under fire in recent months for a succession of bad bets and missed opportunities, and his failure to deploy the more than $120 billion on his conglomerate's balance sheet.\n\nRead more: Warren Buffett made 12 predictions about bitcoin, table tennis, and his death — here's how they turned out\n\nBeddall raised two of Buffett's own defenses when asked about the famed investor's recent underperformance: the size of Buffett's portfolio means he \"needs to hunt down a really big elephant to move the needle,\" and Buffett has preferred to hold on to cash than join the rush of investors paying a high premium for growth companies.\n\nHe also added that he doesn't view Buffett's mistakes as entirely negative.\n\n\"He has made some unwise decisions, like purchasing IBM. I find this inspiring as it suggests that he is human! No matter how good a batter you are, you wouldn't expect to hit every ball out of the park.\"\n\nRead more: Warren Buffett's favorite business is a little chocolate maker with an 8000% return. Here are 5 reasons why he loves See's Candies.", "description": "A team of quantitative traders in London are training their algorithms to invest like Warren Buffett. Unlike many algorithmic trading funds that constant...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5dad82a04af9095e960e4c03-2400/gettyimages-492446672.jpg", "published_at": "2019-10-10"}