{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/5/trump-campaign-launches-volunteer-impeachment-defe", "downloaded_at": "2019-10-05 22:58:27.631350+00:00", "title": "Trump campaign launches 'Impeachment Defense Task Force' to rally voters", "language": "en", "text": "The GOP has begun to rally its grassroots forces as House Democrats’ impeachment inquiry escalates.\n\nPresident Trump’s re-election campaign has launched the Impeachment Defense Task Force, a new national volunteer squad to address the challenge.\n\n“Out-of-touch Democrats are ignoring the will of their voters to pursue a baseless, unpopular impeachment witch hunt. The Democrats refuse to accept the results of the 2016 election and are on a never-ending fishing expedition to tear down President Trump,” the organizers advise in their outreach, which calls on Republicans to knock on doors, make phone calls and register voters.\n\n“We need your help in standing up to these members of Congress across the nation to stop the madness. Tell them to end the impeachment inquiry and get back to work for the American people,” the outreach said.\n\n“The Democrats’ constant personal attacks, vicious lies, and now these baseless impeachment attacks, have never had anything to do with President Trump.\n\nTheir goal has always been to silence you. They want to steal you voice and you vote. The president needs you on his side in this fight. Our country is at stake.”\n\nYou can find their pitch online at StoptheMadness.gop\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The GOP has begun to rally its grassroots forces as House Democrats' impeachment inquiry escalates.", "authors": ["The Washington Times Http", "Jennifer Harper"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/05/Screen_Shot_2019-10-05_at_8.20.51_AM_c130-0-1069-548_s1770x1032.png?9382e69a80fd38e39dee9ebf9622d3e47a086de0", "published_at": "2019-10-05"}