{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/29/WS5db72c8da310cf3e355740a9.html", "downloaded_at": "2019-10-29 00:15:41.525626+00:00", "title": "Questions remain over grounded Boeing 737 MAX", "language": "en", "text": "By SCOTT REEVES in New York | China Daily | Updated: 2019-10-29 01:59\n\nThe crash on Oct 29 last year in Indonesia involves the Boeing 737 Max, a single-aisle, medium-range, twin-engine plane. Photo provided to China Daily\n\nAirliner still out of service year after Indonesian crash\n\nSeveral days after a Boeing 737 MAX flown by Lion Air plunged into the sea off Java, Indonesia, family members of those killed scattered flowers on the water, their faces contorted in grief. Some wept quietly.\n\nFive months later, mourners gathered in Addis Ababa, the Ethiopian capital, for a memorial service after a Boeing MAX flown by Ethiopian Airlines slammed into the ground at about 885 kilometers per hour shortly after takeoff.\n\nRelatives were offered small bags of scorched earth from the crash site to bury, as most of the victims had perished in a fireball that swept through the plane.\n\nThe crashes — on Oct 29 last year in Indonesia , and March 30 in Ethiopia — killed a total of 346 passengers and crew. Both incidents involved Boeing 737 MAX, a single-aisle, medium-range twin-engine planes. The aircraft is the manufacturer's top seller and is priced at about $135 million.\n\nOne year after the crash in Indonesia, the 737 MAX remains grounded, and beyond the central question of how and when the plane will be recertified to resume commercial flights, there is one other: Will passengers believe the MAX is safe?\n\nInvestigators have focused on the automated anti-stall device that may have erroneously pointed the noses of the planes down to gain speed to prevent a midair stall, sending them instead into fatal plunges.\n\nChina was the first country to ground the aircraft and the United States the most recent.\n\nDevelopment of the MAX was announced in 2011, and the plane entered commercial service six years later. It had been flown safely worldwide, suggesting that the pilots may bear some of the responsibility for the two crashes. But a key issue is how the Federal Aviation Administration , or FAA, certified the aircraft.\n\nRobert Mann, president of aviation consulting company R.W. Mann & Co in Port Washington, New York, said: \"With any aviation accident, it's never just one thing. It's a series of faults that together create an unfortunate outcome. The MAX is systemically fixable.\"\n\nThe aircraft derived from the designs of earlier planes.\n\nThe first Boeing 737 flew in 1967, and some 10,500 variants in four generations have been built in the Original, Classic, Next Generation and MAX classes. Boeing updated its design as required. This keeps costs down.\n\nThe company has about 4,600 MAX orders pending. In April, it reduced production of the aircraft to 42 planes a month from 52, but expects to boost output to 57 a month by the end of next year.\n\nUpdating an existing plane meant pilots needed only a short training program based on computers to qualify to fly the MAX, rather than costly and time-consuming training on a flight simulator.\n\nAmerican Airlines, one of Boeing's best customers for more than 10 years, said it was close to buying several hundred planes from Airbus, Boeing's chief competitor.\n\nBoeing knew it had to act aggressively and quickly to preserve its market share, and abandoned plans for an entirely new plane because design, testing and certification by the FAA and other regulators could take as long as 10 years. Instead, the company updated an existing plane, the NG.\n\nKey changes\n\nThe new, fuel-efficient engines on the MAX are larger and positioned farther forward on the wing and closer to the fuselage than those on the NG, its predecessor.\n\nThe extra weight changed the plane's handling characteristics, meaning that the MAX performed differently than previous versions of the Boeing 737. The nose of the new model could rise when flying at low speeds or unexpectedly when cruising. If the nose rose too high, the plane could go into an aerodynamic midair stall.\n\nTo compensate, Boeing developed the Maneuvering Characteristics Augmentation System, or MCAS, an automated anti-stall device designed to point the nose of the plane down to gain speed to avoid a stall.\n\nBoeing sought to develop a plane that flew like previous versions of the 737 — and succeeded. Pilots familiar with the NG could easily fly the MAX. But the company did not immediately inform pilots about MCAS, its purpose or how to override it in an emergency.\n\nInvestigators believe MCAS may have erroneously pointed the nose of the planes involved in the Indonesian and Ethiopian crashes down and into a fatal plunge.\n\nInitially, Boeing did not include details of the MCAS in the manual for pilots, because it believed the software would work unobtrusively in the background. The first MAX fuselage was completed in 2015, while the first test flight was carried out without incident in January 2016. The FAA certified the plane for commercial service in March the following year.\n\nRegulators worldwide followed the FAA's lead and quickly issued approvals. In May 2017, the first delivery was made to Malindo Air, a subsidiary of Lion Air, and the carrier's first commercial flight took off later that month. At the time of the crashes, there were about 300 737 MAX jets in service around the world.\n\nCertification questioned\n\nThe Lion Air and Ethiopian Airlines crashes changed everything. In April, the FAA asked regulators from nine countries, including China, to take part in the Joint Authorities Technical Review, or JATR, of the US regulator's oversight and approval of the MAX's automated anti-stall device, the MCAS.\n\nThe JATR found that the FAA evaluated the anti-stall device piecemeal without regard to its overall performance, making it difficult to determine if it complied with regulations.\n\nIn its 69-page report, the review stated, \"MCAS was not evaluated as a complete integrated function in the certification documents submitted to the FAA. The lack of unified top-down development and evaluation of the system function and its safety analyses, combined with the extensive fragmented documentation, made it difficult to assess whether compliance was fully demonstrated.\"\n\nJames Hall, managing partner of Hall & Associates in Washington and former chairman of the National Transportation Safety Board, has consistently criticized the self-certification procedure for giving too much authority to Boeing and, in effect, allowing the manufacturer to certify its own aircraft.\n\n\"I hope (the US) Congress will limit the delegation of responsibility without active oversight in future reviews,\" he said.\n\nBut Mann, from R.W. Mann & Co, said innovations in the aircraft industry often outpace the ability of regulators to evaluate them. It therefore made sense for Boeing to take part in the review. The key is balance and oversight.\n\n\"This is a shared issue between Boeing and the FAA,\" Mann added.\n\nThe JATR said that to assure safety, the FAA needs to reform its practice of delegating key parts of certification to industry engineers.\n\n\"With adequate FAA engagement and oversight, the extent of delegation does not in itself compromise safety,\" the JATR report said. \"However, in the Boeing 737 MAX program, the FAA had inadequate awareness of the MCAS function which, coupled with limited involvement, resulted in an inability of the FAA to provide an independent assessment of the adequacy of the Boeing-proposed certification activities associated with MCAS.\"\n\nThe FAA vowed to change the way aircraft are certified.\n\nFAA Administrator Steve Dickson said in a statement: \"I will review every recommendation and take appropriate action. We welcome the unvarnished and independent review. We are confident that our openness to these efforts will further bolster aviation safety worldwide.\"\n\nReturn to service\n\nBoeing believes the MAX will return to service in the fourth quarter of this year, but nevertheless set aside $5 billion to cover costs arising from the plane being grounded. The three US airlines that fly MAX jets have cancelled flights using the plane through early January.\n\nPilots at Southwest Airlines, which has 34 MAXs, the largest operator of the plane in the US, believe the aircraft will not return to service until February — a month later than major US airlines expect and as much as two months later than the aircraft manufacturer's target.\n\nOscar Munoz, United Airlines' CEO, told CNBC \"no one knows\" when the plane will fly again.\n\nThe European Union Aviation Safety Agency, or EASA, said it would do its own testing on the MAX, rather than follow the FAA's lead. This almost certainly means further delay in recertifying the plane's return to service.\n\nEASA's test flights will likely take place in December after testing by the FAA. Results will be shared with EU member nations so that the MAX can be cleared to enter the trading bloc's air space.\n\nHow these fixes are approved will determine how quickly the plane returns to service. If the MAX is considered a derivative of previous 737 models, approval is straightforward and should be completed quickly.\n\nIt would take at least 45 days to prepare the planes for flight after recertification. But if regulators determine that the updated MCAS changes basic handling of the aircraft, it could require certification as a new plane. That is likely be a lengthy and costly process, delaying a return, analysts said.\n\nIt is also unclear what additional training MAX pilots will have to undergo. Some regulators may require only a course based on computers, but others may demand simulator training, further delaying the plane's return.\n\nDifferent regulators may approve a return to service at varying times and under different conditions. If so, this could create a staggered return and lead to international scheduling problems if one nation has recertified it but another has not.\n\nIn 2016, an instant-message exchange between a Boeing test pilot and a colleague appeared to criticize the performance of modifications to the MCAS system. News of the exchange drove Boeing's stock down, but the discussion centered on the performance of the flight simulator — not the MAX's anti-stall device.\n\nLawsuits filed\n\nLawsuits alleging wrongful death, negligence and product liability have been filed in Chicago, where Boeing is headquartered. The US legal system tends to be more generous in awarding damages than courts elsewhere in the world.\n\nFloyd Wisner, founder of the Wisner law firm near Chicago, negotiated an out-of-court settlement for 11 families of those killed in the Lion Air crash. Boeing will pay about $1.2 million for each relative who died.\n\nWisner, who has been a lawyer for 42 years and has handled major aircraft crash cases for the past 20, said: \"Airplane crashes are terrible and families never get over them. Family members think of what their loved ones went through in the final minutes before the crash.\n\n\"Unlike driving, where you can pull over if something's wrong, passengers at 30,000 feet (9,144 meters) have no control. This compounds the families' grief. There's a hole in their hearts.\"\n\nHe said most family members want to know what caused a crash, who was responsible and to ensure similar factors never kill passengers in the future. When satisfied about those points, the discussion turns to compensation. Many use the money to educate surviving children and to meet living expenses, especially if the primary earner died in the crash.\n\n\"It's compensation,\" Wisner said. \"They're not making anything. That's why the settlement money isn't taxed in the US. It tries to make you whole, but those who have lost a loved one in a plane crash will never be whole again. I still get notes from people I represented years ago. Some say their child has completed college and enclose a photo.\"\n\nMichael Stumo and his family, whose 24-year-old daughter, Samya, died in the Ethiopian Airlines crash, have sought to determine what happened and why. He told National Public Radio: \"We're traumatized. We don't want to be doing this. But we want to avoid a third crash.\"\n\nBoeing has set aside $100 million to help families affected by the crashes. The company said in a statement: \"Boeing extends our heartfelt condolences and sympathies to the families and loved ones aboard Lion Air Flight 610 and Ethiopian Airlines Flight 302.\"\n\nFinal moments\n\nThe National Transportation Safety Board, an independent federal agency, is tasked with investigating the cause of airplane crashes.\n\nIn a preliminary report on the 737 MAX disasters it said: \"The pilot responses differed and did not match the assumption of pilot responses to unintended MCAS operation on which Boeing based its hazard classifications within the safety assessment that the FAA approved and used to ensure the design safely accommodated failures.\"\n\nThe pilots of the Lion Air and Ethiopian Airlines flights may have been overwhelmed by alarms and may not have followed established procedures to regain control of their aircraft.\n\nThe aircraft flight recorders, or black boxes, recovered after the crashes showed that multiple alarms activated. These included a device that vibrated the pilot's control column, audible warnings that the planes were too close to the ground and a \"clacker\" to indicate they were flying too fast. There were also multiple warning lights alerting the pilots to dangerous speed and altitude.\n\nBoth planes flew erratically with sharp fluctuation in altitude as the pilots attempted to regain control.\n\nFive minutes after takeoff, Ethiopian Airlines' 737 Max plunged into the ground at about 885 kilometers per hour.", "description": "Several days after a Boeing 737 MAX flown by Lion Air plunged into the sea off Java, Indonesia, family members of those killed scattered flowers on the water, their faces contorted in grief. Some wept quietly.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/29/5db77ccda310cf3e97a34faf.jpeg", "published_at": "2019-10-29"}