{"pub": "news24", "url": "https://w24.co.za/Lifestyle/he-provided-for-us-so-my-mother-let-him-abuse-me-20191016-6", "downloaded_at": "2019-10-16 21:11:15.172417+00:00", "title": "‘He provided for us – so my mother let him abuse me’", "language": "en", "text": "\"He kept on abusing me, and started saying that I belonged to him.\"\n\nLucy* was 12 years old when her neighbour's 24-year-old friend started abusing her. Her mother knew – and let it happen because he bought them a flat and supported them financially.\n\n\"I was twelve years old. My parents were divorced and two older sisters were out of the house when my mother and I moved into a small one-bedroom flat in the south of Joburg.\n\nIt was there we met Tom*, through our new neighbour. He was 24 years old, a big man working as a lifeguard at the public swimming pool. My mom befriended and allowed him into our home to help with whatever needed fixing. He often came around and took a liking to me.\n\nI was very naive and soft hearted – I still played with Barbies. The facts of life were never explained to me.\n\nI was in Standard 5 (Grade 7), when I came home one day to find Tom waiting for me. He took me and proceeded to sexually abuse me. I was so scared and frozen and did not understand what was happening.\n\nIt was not just a one-off thing. He kept on abusing me, and started saying that I belonged to him. Once I told him to leave me alone and he freaked out and left, only to return a few hours later. He had been drinking and tried to jump off the top story of our block of flats while he held onto me.\n\nHis friend that lived next door came to my rescue and my mom pulled me one side while his friend tried to calm him down. My mother told me to \"give him whatever he wants or he will kill us\".\n\nRead more: How my obsessive husband almost destroyed my life\n\nShe let him abuse me while she slept in the room next door. She allowed him to do this because he was financially stable while we were struggling and he bought a bigger flat for us. My mom was rather pleased at the money she would save because he would provide for us.\n\nThis went on for two years. He often got drunk and would come after me, and threatened me with his shotgun to my head.\n\nWhen I started high school, I was not allowed to do any school activities. If he saw me talking to any boys, I would be punished.\n\nI began to understand that this was not a normal situation and wanted to be set free. When I was 14, I finally got the guts to go lay charges against him at the police station, and we were able to move away via police escort. But my mother begged me to drop all charges against him -- and I did.\n\nTom died a few years later and that made it easier for me to forgive him. But I think that my mother hurt me more than he did.\n\nIt broke my heart that she let him touch me while she slept in the next room, but I still longed for her love.\n\nI was constantly told to get over it and move on and I know this is not the path to forgiveness and peace. Talking, sharing regarding any type of abuse, is the first step to recovery.\n\nRead more: ‘Marrying this man was the worst mistake of my life’\n\nI know would really like to do a counseling course and start a support group for all woman who have suffered or are still is suffering any form of abuse, whether its emotional, physical, sexual or mental abuse.\n\nI can only pray that all those who have suffered a similar situation can find forgiveness and peace.\"\n\n*Names have been changed.\n\nIf you are a victim of abuse, there is help. Call Lifeline on 021 461 1111.\n\nThis story was submitted to YOU by one of our readers and has been minimally edited.\n\nDo you have an incredible story to tell? Whether it’s an incredible achievement, a heartbreaking obstacle you were forced to overcome, or just something that made you laugh – share your story with us and you could feature in YOU or on our website. Email us your story: web@you.co.za", "description": "\"He kept on abusing me, and started saying that I belonged to him.\"", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9482/e1f3907e6fa24dbf9f66947909a7fb71.jpg", "published_at": "2019-10-16"}