{"pub": "nymag", "url": "https://nymag.com/strategist/article/best-hotel-style-sheets.html", "downloaded_at": "2019-10-03 07:23:18.757668+00:00", "published_at": "2019-10-02", "title": "The Best Sheets, According to Hotel Insiders", "language": "en", "text": "8 items in this article Photo: Frette\n\nPeople who know hotels know sheets. They have to: If a guest gets into bed to find that the sheets are scratchy, or hot, or simply ill-fitting, the hotel is going to hear about it. “A bed and its linens can make or break the whole hotel experience,” says Alexandra Champalimaud, founder of Champalimaud Design, a firm whose projects include the Waldorf Astoria in Chengdu, Four Seasons Hotel in Jakarta, and newly restored Troutbeck country house in Dutchess County, New York. “Which is why, when we re-designed Troutbeck, we knew one of our main focuses was going to be on creating a particularly beautiful sleeping experience with crisp, smooth linens.”\n\nIn order to determine what hotel insiders consider the best, most comfortable, and most durable (something hotel people know better than anyone — they wash their sheets daily, which means they learn quickly which pill and fray quickly and which maintain their integrity over time) sheets, we spoke to some 25 of them, from the interior designer of the Shinola Hotel in Detroit to the director of housekeeping at Texas’s Camp Comfort. Two winners emerged quickly from the pack — one brand was recommended by six of our experts, the other by five. And for sheet lovers who have particular, nitpicky sheet preferences — linen fanatics, for instance, or those who will only deign to sleep on sateen — we asked our experts for the best of the best in those categories as well.\n\nThe Overall Best Sheets\n\nFrette Hotel Classic Sheet Set It will come as no surprise to anyone who frequents upscale hotels that Frette, a circa-1860 Italian company that has supplied linens to everyone from the Italian royal family to nearly every luxury hotel around the world (the Danieli in Venice, the Ritz in Paris, the Peninsula in Hong Kong), handily bested the competition. When Champalimaud was designing Troutbeck, she chose Frette because “their quality is simply exquisite.” Ave Bradley, SVP of design and creative director for Kimpton, collaborated with Frette to customize sheets for each of their 68 hotels. Rob Arthur, the general manager at the Ivy Hotel in Baltimore (which has a four-diamond rating from the AAA), sampled more than 50 types of sheets before deciding on Frette. Like Champalimaud, he was drawn to the brand’s “ultra-luxurious fabric” and “simple yet chic” designs. For Amy Finsilver, general manager of XV Beacon in Boston, Frette’s durability was the deal sealer; the fabric, she says, “remains smooth after many, many washes.” While the products Frette supplies to its hospitality partners are not available for direct purchase, Frette’s Hotel Classic Collection is. Christine Gachot, the interior designer of the buzzy Shinola Hotel in Detroit, actually prefers the direct-to-consumer version. “The super-crisp white percale sheets that you can buy through their website are just top, top quality,” she says. Ron Gorodesky, managing director at the Reeds at Shelter Haven in Stone Harbor, New Jersey, who has used Frette bedding for years, says guests frequently request sheet-purchasing info before checkout. “They’re as soft as a cloud, and our guests just love them,” he says. $425 at Saks Fifth Avenue Buy $450 at Frette Buy\n\nA Dupe for the Overall Best Sheet\n\nGarnier-Thiebaut Nice Queen Sheet Set Mariano Galante, director of housekeeping at Sonnenalp Hotel in Vail, Colorado, was a Frette devotee for years. But eventually he discovered Garnier-Thiebaut. The 186-year-old French company made 100 percent cotton sheets — with a 320-thread-count percale — that didn’t shrink or ever seem to lose their softness. And they did this at half the cost of a Frette set. He was sold. [Editor’s note: there’s actually a pretty solid selection of GT sheets on Amazon — click here — though inventory appears to be low. Their duvet covers are available on Wayfair.] $140 at Gracious Style Buy\n\nThe Second-Best Sheets\n\nComphy Sheet Set Other than Frette, the name that came up again and again was Comphy, a synthetic American brand originally designed for spas. “Nearly every guest comments how much they love our beds and bedding,” says Kate Sheldon, co-owner of the Sheldon Chalet in Denali, Alaska. “Comphy’s sheets have an ultra-luxurious touch and feel: In them, you’re never too warm or too chilly. Plus, since they’re ultra-light, they dry faster than cotton — and dry wrinkle-free.” Lisa Kelleher, the co-owner of Camp Comfort in Comfort, Texas, uses Comphy as well — and frequently gets asked by guests where they can buy them for themselves. Kennley Selby, the director of design and owner of the Surf Hotel in Buena Vista, Colorado, likes Comphy so much that she uses their sheets in the hotel and at home, as does Matthew Carroll, the owner of Jail Hill Inn in Galena, Illinois (one of the highest-rated B&Bs in the country). “These sheets are easily the most talked-about amenity in my suites,” he says. “Almost every morning at breakfast when I ask guests how their night was, their first comment is how soft and amazing the sheets are. I have been in the hospitality industry for over 18 years, and they are the best I have ever worked with. They are wrinkle resistant, they are durable against stains, and they look crisp and new every time we make a bed, which is very important when you’re dealing with an upscale property.” From $138 at Comphy Buy\n\nThe Best Linen Sheets\n\nMatteo Mica Linen Sheet Set “I’ve been in love with Matteo sheets since a stay-over in a friend’s guest room several years ago,” says Melanie Raines, director of design at New Waterloo, the hospitality management and development company behind Austin’s South Congress Hotel. As soon as she got home, she upgraded her own sheets — and eventually incorporated the line into her work in hospitality. “Matteo offers the loveliest fabrics, all made in a sort of ‘slow-batch’ manufacturing process in Los Angeles,” says Raines. “Prior to my switch, I had linen sheets from West Elm. They served me well but were in a different ballpark in terms of quality and detailing: Matteo’s are soft but not worn-in, breathable, textured, and the right amount of refined without being slick.” They are also, she says, the perfect hotel sheets. “Durability in commercial washer/dryers is as important as feel and design when it comes to picking sheets for the rooms,” she says. “And to the surprise of the entire New Waterloo staff, Matteo bedding actually gets better with each wash, while still retaining its structure.” $485 at Matteo Los Angeles Buy\n\nThe Best Eco-conscious Sheets\n\nRivolta Carmignani Classic Bedding Set Rivolta Carmignani are the sheets of choice at the Mokara Hotel & Spa in San Antonio — in part because they are certified STeP by OEKO-TEX. This makes them 100 percent ecofriendly, says Laura McKoy, creative director and vice-president of interior design for Omni Hotels & Resorts. Also, they’re super-cozy. Says McKoy, “They’re made of very high-quality Egyptian cotton, bleached, then mercerized, and hand-finished in a way that makes them feel really buttery.” From $259 at Eric & Gustaf Buy\n\nThe Best Sateen Sheets\n\nKassatex 300-Thread-Count Sateen Sheet Set Another bargain pick with an Uber-luxe, high-end feel comes courtesy of Richard Fernandez, director of guest experience at EAST, Miami. He loves Kassatex’s sateen sheets because they’re made with 100 percent combed long staple cotton, a.k.a. “the most luxurious cotton in the world because of its softness, coolness to the touch, and durability.” $100 at Kassatex Buy\n\nget the strategist newsletter Actually good deals, smart shopping advice, and exclusive discounts. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nThe Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.", "description": "The Best Sheets, According To Hotel Insiders 2019  including Frette Hotel Classic Sheet Set, Garnier-Thiebaut Bordeaux 320TC King Duvet Set, Comphy Sheet Set, Matteo Los Angeles Vintage Linen Sheet Set and FlaxLinens Belgian Linen Simple Sheets.", "authors": ["Ashlea Halpern"], "top_image": "https://pixel.nymag.com/imgs/daily/strategist/2019/09/20/hotel-bedsheets/20-hotel-bedsheets-LEDE.w1200.h630.jpg"}