{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7576797/Australian-Jock-Palfreeman-released-custody-Bulgaria.html", "downloaded_at": "2019-10-15 23:14:25.530723+00:00", "title": "Australian Jock Palfreeman is released from custody in Bulgaria", "language": "en", "text": "Jock Palfreeman has been released from custody in Bulgaria but is not allowed to leave the country while his parole is being appealed.\n\n'Of course I am happy. I am out of prison today, for the second time. I hope everything will be over quickly,' he told reporters on Tuesday night.\n\nThe Australian was last month granted parole after serving 11 years of a 20-year sentence for killing a Bulgarian man in a street brawl in 2007.\n\nBut instead of being released, Palfreeman was held in Busmantsi Detention Centre in Sofia.\n\nJock Palfreeman speaks to journalists as he leaves migrants' detention centre in Busmantsi, Bulgaria\n\nJock Palfreeman (pictured) has been released from custody in Bulgaria but is not allowed to leave the country while his parole is being appealed\n\nPalfreeman leaves migrants' detention centre in Busmantsi, Bulgaria after his release\n\nPolice confiscated Palfreeman's his passport to stop him leaving the country\n\nOn Tuesday night he was finally released but said police confiscated his passport to stop him leaving the country.\n\n'An hour before they told me they were releasing me, 40 police officers went through my cell,' he said.\n\n'They took my Australian passport. That was very strange. Some high ranking officer told me I had no right to a passport since I'm banned from leaving the country.'\n\nPalfreeman said he was not sure where he would stay but said Bulgarian people would look after him.\n\nI am out of prison today, for the second time. I hope everything will be over quickly\n\n'I'm confident they'll keep me safe. They've kept me safe for 12 years,' he said.\n\n'A lot of people think I've received a lot of support from Australia during those 12 years [but] the truth is that the ones who have supported me during those 12 years have all been Bulgarian.'\n\nIn an extraordinary snub to his countrymen, Palfreeman, who speaks Bulgarian, said he didn't want to come home.\n\n'If I had a choice, I would stay in Bulgaria. For those 12 years, it was only Bulgarians that helped me,' he said. 'Australians became interested in me only recently.\n\n'I will have to go back to Australia after the Bulgarian authorities allow me to do that as I have to sort out some documents,' he said.\n\nA senior interior ministry official said: 'He will have to show up at an interior ministry office once a week until a ban to leave the country, issued back in 2011, is lifted.'\n\nIn the stabbing Andrei Monov, 23, was killed and Antoan Zahariev, 19, was wounded.\n\nPalfreeman, 32, who was serving in the British army at the time, said he acted in self-defence and was trying to protect gypsies from being attacked by the Bulgarians.\n\nOn Tuesday night Palfreeman was finally released from detention but said police confiscated his passport to stop him leaving the country\n\nHe was granted parole by a panel of three judges. However, Bulgaria's Chief Prosecutor Sotir Tsatsarov made an application to the country's highest court to have his parole revoked, arguing two of the judges had a conflict of interest.\n\nNationalist political parties have organised demonstrations in the capital Sofia against his release.\n\nAfter being granted parole, former Sydney private schoolboy Palfreeman was transferred from prison to an immigration detention centre.\n\nBulgaria's interior ministry said prosecutors ordered he not leave the country and he must be held because he lacks valid identification documents.\n\nAustralia issued him an emergency passport and said he should be permitted to go home.\n\nAustralian Foreign Minister Marise Payne said she was 'deeply disappointed' that Palfreeman was kept in custody in Bulgaria.\n\nAustralian Paul 'Jock' Palfreeman leaves the immigration detention centre in Busmantsi\n\nBulgaria's interior ministry said prosecutors ordered he not leave the country and he must be held because he lacks valid identification documents\n\n'We would be very concerned if factors other than the normal legal premises that operate in Bulgaria were at play in his case,' Payne told reporters last week.\n\n'And we have most clearly and explicitly sought his release from immigration detention and his return to Australia.'\n\nPalfreeman's lawyer, Kalin Angelov, described the appeal of the parole decision as 'absurd'.\n\n'It is frustrating to everyone here,' he told reporters after the court's announcement on Monday.\n\nHe said he did not know what the court's decision would be.\n\n'That is the million-dollar question,' Angelov said.", "description": "Palfreeman has served 11 years of a 20-year sentence since being found guilty of murder and attempted murder in the stabbing of two Bulgarian youths during a Sofia street brawl in 2007.", "authors": ["Charlie Moore For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/20/19756982-0-image-a-17_1571169096131.jpg", "published_at": "2019-10-15"}