{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Culture/kate-gosselin-readies-twin-daughters-college-dont-apologize/story?id=66028057", "downloaded_at": "2019-10-04 01:21:28.856256+00:00", "published_at": "2019-10-03", "title": "Kate Gosselin readies her twin daughters for college: 'I don’t apologize for my tears'", "language": "en", "text": "Believe it or not, Mady and Cara Gosselin are heading off to college!\n\nThe two oldest daughters of Kate and Jon Gosselin, whose childhoods unfolded on \"Jon & Kate Plus 8\" and later \"Kate Plus 8,\" are all ready for this next stage of their lives.\n\nAnd in their corner, of course, is mom Kate Gosselin -- and she let the world know it in an emotional social media post this week.\n\n\"I love these kids fiercely... and I don’t apologize for my tears,\" she began Wednesday.\n\nIn the picture, the girls are all smiles and holding up signs with their names. Viewers were introduced to the family back in 2007, after the twins were joined by six siblings, with the hit show \"Jon & Kate Plus 8.\" Over 12 years, the world has watched the twin girls grow up before our eyes.\n\n\"Times have been so tough and so needlessly unfair for them. Despite it all, they’ve turned out to be such wonderful amazing human beings,\" she added. \"I cannot wait to see what lies ahead for each of them once they get away from those who have tried to destroy them versus protect them!\"\n\nGosselin wasn't specific about who or what she was referring to.\n\nAs for her girls, in addition to being full-time students, they've been acting as consultants for her mom's quest for love in \"Kate Plus Date.\"\n\nGosselin has been proudly posting pics of them helping to pick out suitable men to date their mom for a new reality show.\n\n\"Oh, Mady! The things she picks up on! This guy said the WORST thing you can ever say to us.... like nails on a chalkboard to us! \" she wrote in July after a not-so-great outing.", "description": "Believe it or not, Mady and Cara Gosselin from", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/gosselin-file-gty-ml-191003_hpMain_16x9_992.jpg"}