{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/sugarcrm-announces-fall-19-release-with-laser-focus-on-end-users", "downloaded_at": "2019-10-09 18:31:21.544116+00:00", "title": "SugarCRM Announces Fall '19 Release with Laser Focus on End Users", "language": "en", "text": "Latest Enhancements Support Mission of Helping Companies Create Customers for Life\n\nCUPERTINO, Calif. — SugarCRM Inc.®, the company that helps organizations deliver exceptional customer experiences, today announced new powerful product features with the Fall ‘19 release, placing an emphasis on self-service, automation and collaboration. These enhancements will result in increased customer satisfaction, lead conversion rates, and cost reductions.\n\n“We are relentlessly innovating on our products,” said SugarCRM CEO, Craig Charlton. “We move with a sense of purpose, and the objective of this release is to enhance the experience of our customer’s customers.”\n\nA key new feature of Sugar Serve is the Self-Service Portal, which allows Sugar customers to provide branded experiences for their customers where they can find answers to issues, create and track service cases, communicate with customer service agents and perform other pertinent functions related to case management.\n\nOther highlights of the release include new features across the Sugar portfolio:\n\nSelf-Service\n\nSugarCloud Insights: Provides visibility and monthly email notifications to customers on their SugarCloud storage consumption across Sugar Sell, Sugar Serve, Enterprise and Professional\n\nProvides visibility and monthly email notifications to customers on their SugarCloud storage consumption across Sugar Sell, Sugar Serve, Enterprise and Professional CRM Sync Dashboard: Provides more visibility into the status of data synchronization between Sugar Market and Sugar Sell, Enterprise, and Professional, allowing for better alignment between marketing and sales functions\n\nAutomation\n\nSugarIdentity: Now available for customers in EMEA and APAC, SugarIdentity has also been enhanced to enable automated user lifecycle management with external identity provider services and support Single Sign On with Sugar’s Outlook Plugin (OPI) add on\n\nNow available for customers in EMEA and APAC, SugarIdentity has also been enhanced to enable automated user lifecycle management with external identity provider services and support Single Sign On with Sugar’s Outlook Plugin (OPI) add on Sales process automation: Sugar Sell includes workflows that help customers automate key business processes, such as lead routing with new business centers, discount approval flows, and automated pipeline reminders\n\nCollaboration\n\nCollaboration via mobile: Allows customers to access the Sugar comment log from their mobile device to add comments, view interaction history, and collaborate with team members on accounts, opportunities and support cases to stay in sync at all times\n\n“We’re excited about the Fall ‘19 release, which follows on the heels of unveiling our newest products, Sugar Discover and Sugar Connect,” added Charlton. “This announcement goes hand in hand with our overall vision and commitment to anticipating and fulfilling needs before customers realize they have them.”\n\nTo learn more about SugarCRM’s Fall ‘19 Release, visit our website.\n\nAbout SugarCRM\n\nSugarCRM is a customer experience leader enabling businesses to create profitable customer relationships by delivering highly relevant, personalized experiences throughout the customer journey. We empower companies to strengthen existing customer relationships, create new ones through actionable insights and intelligent automation and better understand the customer at every stage of the journey. This enables businesses to accelerate demand generation, grow revenue, deliver superior customer care and increase loyalty. Our easy-to-use, intuitive platform makes customer experience easy and accessible for everyone, allowing marketing, sales and services professionals to focus on high-impact, value-added activities that create customers for life.\n\nBased in Silicon Valley, SugarCRM is backed by Accel-KKR. More than 2 million individuals in over 120 countries rely on SugarCRM.\n\nTo learn more visit www.sugarcrm.com or follow @SugarCRM.\n\nNOTE: SugarCRM and the SugarCRM logo are registered trademarks of SugarCRM Inc. Third-party trademarks mentioned are the property of their respective owners.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191009005047/en/\n\nContacts\n\nAngela Connor\n\nChange Agent Communications\n\nangela@changeagentcommunications.com\n\n919-635-8527", "description": "Latest Enhancements Support Mission of Helping Companies Create Customers for LifeCUPERTINO, Calif. — SugarCRM Inc.®, the company that helps organizations deliver exceptional customer experiences, today announced new powerful product features with the Fall ‘19 release, placing an em...", "authors": [], "top_image": "https://mms.businesswire.com/media/20191009005047/en/748533/3/Logo_2.jpg", "published_at": "2019-10-09"}