{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/22/october-is-national-domestic-violence-awareness-mo", "downloaded_at": "2019-10-23 10:02:57.540546+00:00", "title": "October is National Domestic Violence Awareness Month", "language": "en", "text": "ANALYSIS/OPINION:\n\nI recall a comedian many years ago telling a joke about a man who was arrested for wife-beating. He was convicted and the judge charged him a $10 entertainment tax.\n\nThe joke received a huge laugh then. These days we treat domestic violence much more seriously. Accordingly, President Trump issued a presidential proclamation that designated October as National Domestic Violence Awareness Month.\n\n“Domestic violence poisons relationships, destroys lives and shatters the bedrock of our society — the family. Homes should be places of comfort and stability where love and mutual respect thrive. Domestic violence erodes this environment, leaving many Americans in potentially life-threatening situations. As a nation, we must resolve to have zero tolerance for acts of domestic violence. During National Domestic Violence Awareness Month, we reaffirm our steadfast commitment to empowering survivors and ending this deeply destructive abuse,” the proclamation stated.\n\nMr. Trump also stated in the proclamation that his administration has made it a priority to provide victims of domestic violence with needed assistance. The Department of Justice’s Office on Violence Against Women (OVW) funds critical services and training across the country to prevent domestic violence and to support law enforcement efforts to hold domestic violence offenders accountable for their crimes.\n\n“In fiscal years 2018 and 2019, approximately $8 billion — a historic amount — has been made available for victim services through the Department of Justice’s Office for Victims of Crime, funding more than 3,000 domestic violence local service providers and national domestic violence hotlines,” Mr. Trump stated. “These services assist more than 2 million domestic violence victims annually, helping individuals and families heal from physical and psychological wounds.”\n\nAccording to the Justice Department, domestic violence includes felony or misdemeanor crimes of violence committed by a current or former spouse or intimate partner of the victim, by a person with whom the victim shares a child in common, by a person who is cohabitating with or has cohabitated with the victim as a spouse or intimate partner, by a person similarly situated to a spouse of the victim under the domestic or family violence laws of the jurisdiction receiving grant monies, or by any other person against an adult or youth victim who is protected from that person’s acts under the domestic or family violence laws of the jurisdiction.\n\nAs a writer, I’ve accompanied police officers out on patrol many times. A good number of cops have told me that they disliked responding to calls of domestic disputes where they often encounter the aftermath of domestic violence. The disputes often involve drugs and alcohol abuse, and a backdrop of complicated family conflicts. The cops told me that witnessing the suffering of the women and children saddens them and they feel anger toward the person who caused the pain. It is often a struggle to remain professional, I’ve been told.\n\nWhile accompanying the cops I’ve seen the aftermath of domestic violence, and I too was touched by the battered and traumatized women and children.\n\nOver the years, I’ve listened to a good number of police officers speak about their experiences of dealing with domestic violence. The officers explained that domestic violence is one of the most common of all the crimes they encounter.\n\n“There are three times as many cases of reported domestic violence than reported rapes, but only one out of ten are ever reported,” I recall one female sergeant telling me. “Men are sometimes victims of assaults as well,” she added, “but it’s likely they don’t report it out of shame from being beaten by their wives.”\n\nBattered women come in all races, classes, ages and educational and religious backgrounds, the sergeant noted. “They are the wives of doctors, lawyers, government officials, policemen and judges, as well as unemployed men. Many of the women stay in a violent home because they are trapped by economic circumstances, and there are very few places a woman with children can go to in an emergency.”\n\nWomen who are beaten often lose their confidence. Psychological abuse often accompanies physical abuse. Often an abusive husband threatens to find the woman if she leaves him and kill her and/or the children, and sadly in some cases this has happened.\n\n“No person should be subjected to the fear, shame, and humiliation that an abusive relationship produces, and leaving these relationships is not easy,” the Justice Department said in a statement. “On this National Domestic Violence Awareness Month let us take the time to educate ourselves about how to support friends or family members who are fighting to free themselves from abuse and unite to give a voice to those who suffer in silence.”\n\nIn an emergency, victims of domestic violence should call 911 immediately. Victims can also call the National Domestic Violence Hotline at 1-800-799-SAFE. Or visit www.TheHotline.org.\n\n• Paul Davis covers crime, espionage and terrorism.\n\nSign up for Daily Opinion Newsletter Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Domestic violence poisons relationships, destroys lives and shatters the bedrock of our society -- the family. Homes should be places of comfort and stability where love and mutual respect thrive.", "authors": ["The Washington Times Http", "Paul Davis"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/22/B3davisLGdomesticvi_c0-150-1600-1083_s1200x700.jpg?4671275373e5d3de2becb7be55dbb0e396ecdae3", "published_at": "2019-10-22"}