{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/15/WS5da52c23a310cf3e3557086a.html", "downloaded_at": "2019-10-15 04:26:23.463060+00:00", "title": "Chinese enterprises to help end Zimbabwe's chronic water problems", "language": "en", "text": "By Tonderayi Mukeredzi in Harare, Zimbabwe | China Daily | Updated: 2019-10-15 10:17\n\nA woman with a baby on her back collects water in Mabvuku, a highly-populated suburb in Harare, Zimbabwe. [Photo/Agencies]\n\nChina has stepped up again to help Zimbabwe in a moment of need. This is after the Harare City Council last week approved four Chinese companies to implement over $1 million worth of critical water and wastewater works intended to end the capital city's water crisis.\n\nThe four companies - China Gezhouba Group Co or CGGC, China Geo-Engineering Co (CGEC), Sino-Hydro, and China Machinery and Engineering Co or CMEC - will carry out the works through a loan facility totaling more than $860 million that is guaranteed by the government of Zimbabwe.\n\nUnder the deal, SinoHydro will fund and construct the Lyndhurst sewage treatment plant and expand the Crowborough sewage at a cost of $237 million. CGGC on the other hand, will fund water distribution network rehabilitation in 11 high density suburbs for $351 million.\n\nFor $280 million, CMEC will install pumps at Morton Jaffray and Warren Control, construct new water pumping mains to Alexandra Park reservoirs, Hatcliffe reservoirs, Highlands reservoirs New City, Southern Incorporated areas, and expansion of Adylinn pumping mains while CMEC will implement water and wastewater projects for the Harare Metropolitan Master Plan for Reliable Water Supply Services.\n\nThe fourth company, CGEC, which will soon sign an agreement with Harare, will upgrade and rehabilitate water distribution networks in the city for $176.7 million.\n\nHerbert Gomba, mayor of Harare, said the city had contracted the Chinese companies to find a lasting solution to the water crisis plaguing the city captured by systemic water shortages, nonrevenue water leakages, obsolete sewer and water pipes with a view to improve the infrastructure.\n\nGomba said after finalizing the deals within the next three months, his council expected the works to be completed in three years.\n\nHosiah Chisango, the town clerk, said the council was using its land as collateral to unlock funding for the projects but the government had already guaranteed the funds required for the project to begin and that includes a 10 percent loan guarantee for the project amounting to $86 million.\n\nHarare is battling a water crisis caused by depressed water production and only manages to produce 100 million liters against a daily average demand of 450 million liters, a factor that has forced the municipality to introduce a water rationing schedule where residents only access water once or twice per week.\n\nThe quality of raw water in Lake Chivero and Manyame, the city's main water reservoirs has deteriorated over the years due to pollution, disposal of raw sewage and untreated industrial waste into the water reservoirs. The dirty water means the council has to fork out at least $3 million every month to purchase water purification chemicals but the city is faced with challenges to procure water treatment chemicals due to biting shortages of foreign currency.\n\nThe water and wastewater projects will add to many other major infrastructure projects financed by Chinese financial institutions or the government and implemented by Chinese companies. These include the expansion of Kariba South, which added 300MW to the national grid, the current expansion of Hwange Thermal Power Station which upon completion will add 600MW to the grid, the rehabilitation of the Robert Mugabe International Airport and the refurbishment of the Victoria Falls International Airport.\n\nIn the true spirit of a \"friend in need is a friend indeed\", earlier this year, when the country was struck by Cyclone Idai, China swiftly provided Zimbabwe with $800,000 in cash for emergency humanitarian assistance and some food items. China has also recently provided $13 million from the South to South Cooperation Assistance Fund to the World Food Program, United Nations Development Program and United Nations Children's Fund for providing emergency food assistance to Zimbabwe.", "description": "China has stepped up again to help Zimbabwe in a moment of need. This is after the Harare City Council last week approved four Chinese companies to implement over $1 million worth of critical water and wastewater works intended to end the capital city's water crisis.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/15/5da52c23a310cf3e97a1456b.jpeg", "published_at": "2019-10-15"}