{"pub": "metro", "url": "https://metro.co.uk/2019/10/17/zoe-tates-exit-remains-one-emmerdales-iconic-scenes-10935265", "downloaded_at": "2019-10-17 11:36:10.924434+00:00", "title": "Zoe Tate’s exit remains one of Emmerdale’s most iconic scenes", "language": "en", "text": "As far as exits go, Emmerdale is generally second to none – and the dynamite departure of the iconic Zoe Tate remains up there with one of campest and most spectacular ends for a soap legend ever.\n\nFollowing the tragic death of Leah Bracknell after a three year battle with stage 4 lung cancer, fans are fondly remembering some of Zoe’s best moments – from the time she torched the church during a schizophrenic episode to the storyline which saw her embark on a passionate affair with Charity Dingle (Emma Atkins).\n\nBut the stand out moment was Zoe’s last as she strolled out of Home Farm and had the last smirk as she gave the King family a house warming present to remember. With the help of her cohort Callum, Zoe left the premises for the last time with her daughter Jean and Kim’s son James in tow.\n\nBut as the Kings, led by Tom, looked smugly at their new estate, a deliberate gas leak caused Home Farm to explode. As it blew up, Zoe allowed herself a satisfied smile before departing he Dales for good – and in the 15 years which followed, fans wanted to see more of her and were eager for a return.\n\nAdvertisement\n\nAdvertisement\n\nFans have been sharing fond wishes and memories of Leah as Zoe following her passing and Head of Drama John Whiston spoke on behalf of the show with a tribute.\n\nIn a statement, he said: ‘Everyone on Emmerdale is very sad to hear of the death of Leah Bracknell. Leah was a hugely popular member of the Emmerdale cast for over 16 years. During that time she featured in some of the show’s most high profile and explosive plots and always delivered a pitch perfect performance. Zoe Tate was one of soaps first lesbian characters and Leah made sure the character was both exciting and credible. Leah herself was a very generous and caring colleague, much loved by cast and crew alike.’\n\nAdvertisement Advertisement", "description": "Relive the spectacular moment.", "authors": ["Duncan Lindsay"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/zoe-tate-265d_1571308611.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-17"}