{"pub": "hotair", "url": "https://hotair.com/archives/ed-morrissey/2019/10/18/reuters-hunter-biden-never-went-ukraine-five-years-burismas-board", "downloaded_at": "2019-10-19 11:08:08.907944+00:00", "title": "Reuters: Hunter Biden never worked in Ukraine in five years on Burisma’s board", "language": "en", "text": "No one has yet provided an adequate answer as to how Hunter Biden got a job on Burisma’s board, having absolutely no experience in either energy or Ukraine, apart from having a father serving as Vice President of the US. Reuters tries to unravel another mystery today — just what did Biden fils do on the board once he got the job? “He was a ceremonial figure,” one of their sources at Burisma tells their reporting team, one who never bothered to come to Ukraine at all in the five years he worked as a director for the Ukrainian energy company:\n\nDuring his time on the board of one of Ukraine’s largest natural gas companies, Hunter Biden, the son of former U.S. Vice-President Joe Biden, was regarded as a helpful non-executive director with a powerful name, according to people familiar with Biden’s role at the company. … Interviews with more than a dozen people, including executives and former prosecutors in Ukraine, paint a picture of a director who provided advice on legal issues, corporate finance and strategy during a five-year term on the board, which ended in April of this year. Biden never visited Ukraine for company business during that time, according to three of the people.\n\nBiden got $50,000 a month in salary and never had to come to the home office? That’s quite a gig, especially for a corporate board director. Normally, those positions involve responsibility for overseeing the operations of the organization and ensuring regulatory compliance, which is tough to do when one never sets foot in the country where the corporation operates.\n\nSo what was his purpose, beyond sucking up money and whatever “ceremonial” duties Biden could perform from afar? Three guesses:\n\nOleksandr Onyshchenko, a businessman and former member of the Ukrainian parliament who knows the Burisma founder, said it had been Zlochevsky’s idea to appoint Biden as a director. “It was to protect (the company)” at a time when it was facing investigations, said Onyshchenko, who left the country in 2016. In the run up to Biden’s appointment, a popular uprising led to the removal of the Russian-backed Yanukovich in February 2014.\n\nWhy would Biden be important in that context? Zlochevsky served as a minister in Yanukovich’s government prior to his ouster and would have been viewed with deep suspicion by both the new government in Kyiv and the US as compromised by Russian ties. That would have been even more the case after the February 2014 seizure of Crimea by Russia as retaliation for chasing Yanukovich out of the country. Zlochevsky hired Hunter and his business associate Devon Archer to the board in April 2014 as Russia continued consolidating their grip on Crimea.\n\nZlochevsky clearly wanted to ingratiate himself to the US by hiring well-connected people to Burisma for “protection.” He was willing to pay good money for it too, well beyond the corporate-board salary:\n\nAccording to payment records reviewed by Reuters that two former Ukrainian law enforcement officials say are Burisma’s, the company paid about $3.4 million to a company that was controlled by Archer called Rosemont Seneca Bohai LLC between April 2014 and November 2015. Specifically, the records show 18 months in which two payments of $83,333 per month were paid to Rosemont Seneca Bohai for “consulting services.” The two sources said that one of those monthly payments was intended for Biden and one for Archer. Reuters was not able to independently verify the authenticity of the documents or how much money Hunter Biden received.\n\nThat adds up to $1.5 million each, over and above the $3 million Hunter got over five years on his salary. What did Burisma get in return? According to Reuters, Hunter did some consulting on potential acquisitions in Europe and the US which never materialized. Part of that effort required finding new investors, Reuters reports, for whom having the son of the VP might be pretty useful to instill confidence.\n\nNot only did Hunter Biden have no real qualifications for this role, he did no real work for Burisma either. He was window dressing, an attempt an influence peddling — with no real indication that it was unsuccessful, either. Small wonder, then, that State Department officials started sounding the alarm within months of his hiring by Burisma — only to be shut down by the Vice President’s office.\n\nDemocrats want to keep ignoring just how corrupt this appears while trying to paint Trump with the appearance of impropriety over attempts to expose it. That’s going to be a very neat trick, one that will take the full cooperation of the media to accomplish. Reuters just went off the reservation; will an American news outlet (other than Fox) do their jobs rather than carry water for the Democrats?", "description": "“He was a ceremonial figure.\"", "authors": ["Ed Morrissey", "John Sexton", "Karen Townsend"], "top_image": "https://hotair.com/wp/wp-content/uploads/2019/10/hunter-joe-biden.jpeg", "published_at": "2019-10-18"}