{"pub": "yahoo", "url": "https://finance.yahoo.com/news/perk-portfolio-starbucks-132145742.html", "downloaded_at": "2019-09-25 13:55:02.158517+00:00", "title": "Perk up Your Portfolio with Starbucks", "language": "en", "text": "Traders on Wall Street must have had their coffee before they arrived at work yesterday because everyone appeared to be in a pleasant, bullish mood. This gives us a great opportunity to put our shares of Starbucks (SBUX) to work.\n\nLast Friday, our SBUX September 20th $94 puts expired in the money, and we had shares of SBUX put to us. Now that we own those shares, we can continue to generate instant income from SBUX by selling covered calls against the stock.\n\nWhat Pushed Prices Down?\n\n\n\nSBUX had been trading well above $95 per share, but it started to slide in early September. The company shared a weaker-than-expected forecast for 2020, with the CFO saying its growth would be below its “ongoing growth model of 10%.”\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThe company also announced it would cooperate with the U.S. Securities and Exchange Commission (SEC) regarding questions the SEC raised questions about SBUX’s revenue-recognition policy. When the company agreed to provide additional disclosure, its share prices dropped.\n\nWhile all of this led to us being put the stock, we aren’t convinced SBUX will stay down for long. SBUX won an appeal against an EU demand that SBUX repay €30 million in taxes to the Netherlands, which may provide a boost, and the stock’s technical formation is still very appealing.\n\nCould SBUX Break above $94?\n\n\n\nSBUX is still consolidating in the same range it has been in for the past two weeks. It bounced up from the support level it established just above $89, but it hasn’t been able to break above resistance at $92.\n\nDaily Chart of Starbucks (SBUX) — Chart Source: TradingView\n\nHowever, with the recent court ruling and the general bullishness on Wall Street, we don’t expect the stock to stay in this trading range much longer. We’re looking for SBUX to climb back up to the trading range it was in during August.\n\nWe bought shares of SBUX at $94 per share when the stock was put to us, and we think $94 would make a good strike price for a covered call. The $94 calls offer a solid premium, and if SBUX does continue to climb higher, like we think it will, we may get called out of this trade. By selling calls with the same strike price as our entry, we can ensure we break even on the stock portion of the trade while we make money selling options.\n\nWe recommend picking an expiration date before SBUX reports quarterly earnings in October. That way, we can avoid any complications from post-earnings volatility.\n\nTo find out which SBUX covered calls we’re selling—and to get access to our full portfolio of income-generating trades—sign up for a risk-free trial of Strategic Trader today.\n\nInvestorPlace advisers John Jagerson and S. Wade Hansen, both Chartered Market Technician (CMT) designees, are co-founders of LearningMarkets.com, as well as the co-editors of Strategic Trader.\n\nThe post Perk up Your Portfolio with Starbucks appeared first on InvestorPlace.", "description": "Traders on Wall Street must have had their coffee before they arrived at work yesterday because everyone appeared to be in a pleasant, bullish mood. This gives us a great opportunity to put our shares of Starbucks (SBUX) to work.Last Friday, our SBUX September 20th $94 puts expired in the money, and", "authors": ["John Jagerson", "Wade Hansen"], "top_image": "https://s.yimg.com/uu/api/res/1.2/9VMguVE0GiRX5bJvOPnx3g--~B/aD00MDA7dz03Mjg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/6c163f340d07a7c0d3ad662cbba7f5e2", "published_at": "2019-09-24"}