{"pub": "atlantic", "url": "https://theatlantic.com/entertainment/archive/2019/09/netflixs-unbelievable-different-sort-rape-drama/597946", "downloaded_at": "2019-09-13 18:08:07.517001+00:00", "title": "Netflix’s Unbelievable Is a Different Sort of Drama About Sexual Assault", "language": "en", "text": "Rarely have dramas interrogated the aftereffects of sexual trauma; even more rarely have they tackled the topic without eventually sidelining it. But Unbelievable concentrates its spotlight entirely on the subject, and its eight episodes can be tough to watch: Marie, played by Kaitlyn Dever (Booksmart), is inscrutable, even maddening, as she struggles to keep the details of her rape straight. The episodes, which toggle between two timelines and multiple cases, are loaded with exposition, law-enforcement terminology, and uncomfortable flashbacks. The most pulse-pounding sequence in the early episodes isn’t the one in which a detective draws her gun to corner a suspect; it’s the one in which she and another Colorado detective call every police department in the state after hours, trying to track down similar cases while at an empty office, at dinner with their families, or out walking the dog, off the clock but desperate to find their next lead.\n\n“I haven’t read a lot of scripts that talk about [rape] the way we do,” Dever told me, shaking her head, when we spoke in late August. “Not often.”\n\nEven Miller and Armstrong, long before Unbelievable was made, saw the difficulty in potentially adapting a story of rape for the screen, attributing the challenge to the delicate nature of such cases. “Many detectives avoided sex crimes if they could,” they wrote in A False Report. “They weren’t as high profile as homicides; nobody came looking to do a movie about a rape case. Where homicides were black and white, rape was filled with grays. And rape victims were alive and hurting. Their pain was always in your face—and you could never, ever look away.”\n\nFor the writer and showrunner Susannah Grant (Erin Brockovich), though, that’s exactly why Unbelievable had to be made: The series could take certain truths about rape cases—that there is no “perfect” victim, no “perfect” case, no “perfect” investigation—and present them so that viewers couldn’t look away. “There was one thing I thought was really important to show,” she told me. “[And that] was, people don’t just have one reaction to a trauma.”\n\nGrant and her fellow producers, including the anchor Katie Couric and Marie herself (credited only as “Marie”), sought a filmmaker who understood how to capture “emotional complexity.” They found her in the director Lisa Cholodenko (The Kids Are Alright), who set the series’ candid tone by overseeing its first three episodes. “I found it to be a compelling yarn, and not much in a true-crime kind of way, but more as a human story about people’s fallibility and projections and missed perceptions,” Cholodenko explained to me over the phone. “On so many levels, it was just a really compelling story about the human condition.”", "description": "The new series aims to make viewers uncomfortable—but its creators say that’s the key to adapting a real-life rape case for the screen.", "authors": ["Shirley Li"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/Unbelievable/facebook.jpg?1568390921", "published_at": "2019-09-13"}