{"pub": "dailybeast", "url": "https://thedailybeast.com/trump-its-up-to-pompeo-if-marie-yovanovitch-keeps-her-job", "downloaded_at": "2019-10-13 04:57:35.227474+00:00", "title": "Trump: It’s Up to Pompeo if Marie Yovanovitch Keeps Her Job", "language": "en", "text": "A day after the former U.S. ambassador to Ukraine testified to lawmakers that President Trump and his personal attorney plotted to force her ouster, Trump went on Fox News and said it would be up to Secretary of State Mike Pompeo to determine whether or not to permanently fire her.\n\nThe prospect of Marie Yovanovitch losing her position with the State Department came up during an interview with Fox News host Jeanine Pirro on Saturday night. Asked by Pirro whether Yovanovitch would “keep her job” or “will you fire her,” Trump initially wavered, claiming he had no idea what her testimony included.\n\nBut he wouldn’t rule out the possibility of her getting axed.\n\n“I don’t know very much about her. I know that supposedly she was very partisan, and she was a Clinton-type person, but whether or not she keeps the job, I’d leave that up to Mike Pompeo,” he said.\n\nHe went on to insist that he knows nothing about Yovanovitch, who in fact “may be a very fine person,” despite having disparaged her in the same phone conversation with the Ukrainian president that is now at the center of an impeachment inquiry against him.\n\nTrump and his personal attorney are accused of using backchannels and shadow diplomacy in Ukraine to both target Trump’s biggest potential political rival in 2020, former vice president Joe Biden, and try to legitimize claims that pro-Clinton Ukrainian officials conspired against Trump in the 2016 election.\n\nYovanovitch’s ouster is at the center of those efforts, as she has reportedly said she was sidelined to clear the way for Giuliani’s pressure campaign on Ukrainian officials.\n\nTrump claimed it was Ukrainian President Volodymyr Zelensky who took issue with the ambassador.\n\n“But even if you listen to the very good conversation that I had — a very, very good, no pressure, congenial conversation with the new president of Ukraine — he had some things that were not flattering to say about her. And that came out of the blue,” he told Pirro.\n\nAccording to the White House’s own readout of Trump’s July 25th call with Zelensky, however, it was Trump who first criticized Yovanovitch, telling Zelensky he just wanted to “let him know” that Yovanovitch, at that point already the former ambassador, was “bad news.” Zelensky, who appeared desperate to please throughout the phone call, told Trump he agreed with him.\n\nYovanovitch was unexpectedly forced out of her post in May, months ahead of schedule, at the height of Giuliani’s endeavors to have Ukrainian authorities pursue investigations into widely debunked corruption allegations against Biden.\n\nGiuliani has admitted that he reminded Trump ahead of Yovanovitch's removal that she was not loyal to him and complained to the president that she was hindering efforts to have the Bidens investigated. Trump reportedly ordered her out after those complaints.", "description": "He claims he doesn’t “know very much” about the ex-U.S. ambassador to Ukraine who testified that he forced her out. But he told Ukraine’s president she was “bad news” back in July.", "authors": ["Allison Quinn", "News Editor"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_2350,w_4178,x_0,y_121/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1570940830/RTS2QTCU_ea5zzo", "published_at": "2019-10-13"}