{"pub": "reuters", "url": "https://reuters.com/article/us-usa-boeing-airplanes/cracks-found-on-38-of-810-boeing-737-ng-jets-inspected-globally-idUSKBN1WP2BD", "downloaded_at": "2019-10-11 00:29:05.651933+00:00", "title": "Cracks found on 38 of 810 Boeing 737 NG jets inspected globally", "language": "en", "text": "WASHINGTON (Reuters) - Boeing Co (BA.N) said on Thursday that airlines had inspected 810 of the company’s 737 NG jets around the world and found 38 structural cracks requiring repair and replacement of the affected parts.\n\nFILE PHOTO: In this file photo, Boeing employees work on the tail of a Boeing 737 NG at the Boeing plant in Renton, Washington Dec 7, 2015. REUTERS/Matt Mills McKnight/File Photo\n\nThe planes will be grounded until the repairs are made, Boeing and airline officials said. Nearly 5% of inspections have found cracks in a “pickle fork” - a part that attaches the plane’s fuselage, or body, to the wing structure and manages forces.\n\nThe 737 NG is the third-generation 737 and version before the now-grounded 737 MAX, which is not impacted by the cracking issue.\n\nOn Wednesday, Southwest Airlines Co (LUV.N) and Brazil’s Gol Linhas Aereas (GOLL4.SA) grounded at least 13 737 NG airplanes after U.S. regulators ordered urgent inspections. The U.S. Federal Aviation Administration (FAA) last week told U.S aircraft operators to inspect 165 older 737 NGs for structural cracks, but it now appears the actual number of planes covered is more than 200.\n\nThe FAA said late on Thursday “a small number of aircraft based in the United States have been removed from service while Boeing develops instructions for customers to repair or replace the affected parts.”\n\nThe agency added it “is working with the manufacturer and other international aviation safety regulators to better understand the factors that led to the formation of the cracks.”\n\nSouthwest spokeswoman Brandy King said of more than 200 high-use airplanes it had found cracks on two planes and grounded them. She declined to say if cracks had been found on any other jets but said the airline planned an update next week.\n\n“We do not have a timeline for when the airplanes will be returned to service, we are working with Boeing to schedule the upcoming repairs,” King said.\n\nBoeing shares fell 1% to close at $371.00 on Thursday.\n\nAmerican Airlines (AAL.O) and United Airlines (UAL.O) said earlier this week they have not seen any cracks on their airplanes.\n\nRaymond James analyst Savanthi Syth wrote in a research note Thursday that the findings from the 737 NG inspections could “potentially take up to 4% of capacity off-line between mid-Oct and mid-Dec.”\n\nPlanes with cracks “may need to be taken out of the fleet for up to 60 days for maintenance,” Syth said.\n\nThe FAA last week said inspections would look for “cracking of the left and right hand side outboard chords of frame fittings and failsafe straps.”\n\nIt added that the cracking “could adversely affect the structural integrity of the airplane and result in loss of control of the airplane.”\n\nAircraft with more than 30,000 cycles must be inspected within seven days, while planes between 22,600 and 29,999 cycles must be inspected within 1,000 cycles, which typically correspond to the number of flights. In total, 1,911 U.S. 737 NGs are covered by the FAA directive.", "description": "Boeing Co said on Thursday that airlines had inspected 810 of the company's 737 NG jets around the world and found 38 structural cracks requiring repair and replacement of the affected parts.", "authors": ["David Shepardson", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439435364&w=1200&r=LYNXMPEF991L1", "published_at": "2019-10-10"}