{"pub": "aljazeera", "url": "https://aljazeera.com/ajimpact/wework-debacle-hits-softbank-plans-megafund-191004133347218.html", "downloaded_at": "2019-10-04 17:02:47.709732+00:00", "title": "WeWork debacle hits SoftBank's plans for second megafund", "language": "en", "text": "SoftBank Group founder and CEO Masayoshi Son is struggling to raise money for a second enormous technology investment fund in the wake of the spectacular meltdown surrounding The We Company's now postponed initial public offering (IPO), and sliding valuation of other major investments, according to two people familiar with the situation.\n\nSon is still determined to go ahead with Vision Fund 2 even though some of his lieutenants have urged a delay, the two people with knowledge of SoftBank's internal discussions told Reuters news agency.\n\nBut the fund is likely to be far smaller, at least at the outset, than the $108bn that SoftBank said it had lined up when it announced the fund in July, the sources told Reuters.\n\nMajor investors have yet to sign on, leaving a $38bn pledge from publicly traded SoftBank Group itself as the only large commitment, according to the sources.\n\nThe size of that pledge may itself be in doubt given some of the recent investment setbacks the company has suffered and the lack of available cash on its balance sheet, according to a Reuters analysis.\n\nVision Fund and the Tokyo-based SoftBank Group declined to comment on the progress of Vision Fund 2.\n\nThe implosion in the valuation of The We Company, parent of office-sharing startup WeWork, and questions about its business model have dented Son's reputation as a savvy investor and point to a big write-down by the first Vision Fund.\n\nSoftBank and the Vision Fund together poured more than $10bn into We Company, investing some of that at a valuation of $47bn in January. But We Company recently abandoned plans for an IPO that would have pegged the company's worth at just $10bn to $12bn.\n\nIf the second fund comes in well short of Son's goal or gets scrapped, it will have broad implications for Silicon Valley venture capitalists, entrepreneurs and Wall Street financiers.\n\nThe first Vision Fund, which raised $97bn, upended the tech-investing world with large bets on fast-growing but unproven companies.\n\nIt was bigger than the aggregate amount raised by the United States' entire venture capital industry in 2018, giving Son huge influence over the startup market.\n\nSceptics say the troubles at We Company and the poor public market performance of marquee but money-losing Vision Fund companies such as Uber Technologies Inc and Slack Technologies Inc will trigger a big decline in the value of numerous so-called \"unicorn\" startups - new companies worth more than $1bn.\n\n\"The radiation is spreading everywhere,\" said Scott Galloway, an author and one-time entrepreneur who teaches marketing at New York University and who has been closely following the We Company turmoil.\n\nThere are investments in the 80-plus companies Vision Fund has financed that appear to be paying off quickly.\n\nDelivery company DoorDash, for one, has rocketed in value, at least on paper, from $1.4bn last March to $12.6bn in May. SoftBank, which owns about a third of the Vision Fund, in July reported a 62 percent return on its investment, including management and performance fees.\n\nSon also has a track record of big scores: the $20m he put into China's Alibaba Group Holding Ltd in 2000 is now worth more than $100bn, for example.\n\nMany analysts rate SoftBank Group a buy and say it still has borrowing capacity, and its majority-owned telecom and internet media unit throws off healthy profits.\n\nDebt piles up\n\nBack in July, SoftBank said a group of companies - including technology behemoths Apple Inc and Microsoft Corp, as well as a slew of Japanese banks, and the United Kingdom's Standard Chartered Plc - would contribute to Vision Fund 2.\n\nHowever, it is unclear how firm those commitments are, and none of the corporate investors have a track record of making multibillion-dollar commitments to an outside venture fund.\n\nMicrosoft, Apple and Standard Chartered declined to comment.\n\nThe Japanese institutions are mostly contributing only small amounts, sources familiar with the matter said. At least one financial investor is planning to make loans to the fund rather than contribute cash.\n\nJapanese investment bank Nomura Holdings Inc, which was the lead underwriter for the IPO of SoftBank's telecom unit, has decided not to put money into the new fund, according to a source familiar with its plans. Nomura declined to comment.\n\nSaudi Arabia's Public Investment Fund (PIF), which contributed $45bn to the first Vision Fund, does not have large amounts of fresh cash to invest until it receives payment from a pending asset sale or proceeds from the planned public offering of the oil firm Aramco, according to people familiar with its finances.\n\nThe Aramco offering is long delayed and there is no guarantee it will go ahead even next year.\n\nThe United Arab Emirates' Mubadala fund still intends to invest in Vision Fund 2, but is seeking more say in the investments, a source familiar with the discussions said.\n\n\"Our rights to weigh in on investments are of course part of the consideration as we assess Vision Fund 2,\" a spokesman for Mubadala said.\n\nPIF declined to comment.\n\nStrains on SoftBank\n\nThe worsening turmoil at We Company will continue to be a strain on SoftBank and the first Vision Fund.\n\nThe price of We Company bonds has sunk, its credit ratings have been slashed and big cutbacks are expected at the company, including the possibility of thousands of layoffs.\n\nSome real estate investors and analysts say that without further investment from Son or his entities, the company will be difficult to stabilise given the size of its future financial commitments.\n\nThat is just one of the calls on SoftBank's money. Some of the investors in the first Vision Fund receive interest payments of seven percent annually on their stakes, an unusual structure that creates an ongoing need for cash.\n\nSome of that has come from the sale of stakes in Indian e-commerce firm Flipkart and publicly traded chipmaker Nvidia Corp, but SoftBank has also borrowed money to fund payouts to investors.\n\nSoftBank also faces the risk that a deal to merge its money-losing US telecom carrier Sprint Corp with T-Mobile US Inc could be blocked by an antitrust lawsuit from US states. If that happens, it will leave SoftBank with an expensive liability, analysts say.\n\nSoftBank's stock has fallen 13 percent over the past month and is now trading at its lowest level since January. SoftBank's operating cash flow also turned negative last quarter and it could struggle to raise tens of billions of dollars in cash, a Reuters analysis of its balance sheet shows.\n\nSoftBank does not have significant cash on hand to finance the new fund. As of June 30, it had $27.41bn of cash and cash equivalents on its balance sheet. However, this and other current assets were more than matched by near-term liabilities.\n\nThe public offerings in recent months have been a big sore spot. Since they listed, shares in ride-hailing group Uber are down 34 percent and software company Slack's stock has lost four percent, though it is down 41 percent from its high in June.\n\nThe value of other ride-sharing and self-driving technology companies could also be in question as sentiment in that sector cools.\n\nTogether with the decline in the value of We Company, those results are expected to drag down the Vision Fund's returns, though it is difficult to get a grip on precise numbers.\n\nSoftBank Group reports overall Vision Fund performance based on a variety of internal valuation metrics, but it does not publicly disclose the numbers on individual companies.\n\nSon's financing plans for the second Vision Fund are based on a steady stream of IPOs of existing Vision Fund companies. But with the appetite for IPOs of unprofitable companies waning and concerns about a possible global recession building, the timing isn't the best.\n\n\"I think that it's incredibly likely that they'll postpone their plans for … fundraising efforts around Vision Fund 2,\" predicted Andrea Lamari Walne, a Silicon Valley-based partner at Manhattan Venture Partners, which facilitates secondary transactions.", "description": "The meltdown over We Company's ditched IPO dented SoftBank CEO Masayoshi Son's reputation as a savvy investor.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/4/82ee55cc79274d95b435e3a7e2bd6873_18.jpg", "published_at": "2019-10-04"}