{"pub": "wsj", "title": "Some Companies Offer a New Benefit: Payroll Advances and Loans", "url": "https://wsj.com/articles/some-companies-offer-a-new-benefit-payroll-advances-and-loans-11567416601?mod=rsswn", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:02:13.709373+00:00", "text": "A growing number of companies are helping workers gain access to payroll advances and loans, reflecting concern over the impact money problems are having on productivity levels and worker retention.\n\nEmployers including Walmart Inc. WMT 0.16% and Pima County, Ariz., have recently added these services. The aim is to help cash-strapped employees, many with damaged credit, cover unexpected expenses without resorting to high-cost debt.\n\n“Employers have woken up to the fact that a majority of workers are having a lot of trouble simply getting by, never mind getting ahead,” said Sophie Raseman, head of financial solutions at Brightside, a company Comcast Corp. co-founded that provides financial guidance to workers and is testing payroll loans with some corporate clients.\n\nRead More Pay-Access Apps Face Regulatory Test\n\nWorkers typically access the services online. The payroll-advance programs generally give employees the option to accelerate a portion of their next paycheck for a fee that often amounts to a few dollars. The loans are typically a couple thousand dollars, and are repaid through automatic payroll deductions over a few months to a year or longer. Approval and interest rates, generally 6% to 36%, often depend on factors including a borrower’s credit score.\n\nBecause the services deduct repayments from workers’ paychecks before the money goes to their bank accounts, default rates tend to be low.\n\nAccording to an Employee Benefit Research Institute survey of 250 employers last year, 12% offer accelerated pay. The same percentage offer short-term loans repaid through payroll deductions. Another 4% and 6% plan to add the services, respectively.\n\nLauren Saunders, associate director of the National Consumer Law Center, said payroll-advance services may create “a cycle of chronic early spending.”\n\nSHARE YOUR THOUGHTS What benefits or drawbacks do you see to your employer offering services that provide payroll advances or loans? Join the conversation below.\n\nCompanies, meanwhile, are responding to data that indicate American workers are financially stressed. While incomes have been stagnant for many, expenses for items including health care and education have risen.\n\nEmployers are concerned about the impact on productivity and turnover. Research by Todd Baker, a senior fellow at Columbia University’s Richman Center for Business, Law and Public Policy, looked at 16 companies in the U.K. that offered payroll loans and found that borrowers had, on average, an annualized attrition rate 28% lower than the rate for all employees.\n\nMary Haynes, chief executive of Nazareth Home, which runs long-term-care facilities in Louisville, Ky., said the company began offering accelerated paychecks through PayActiv Inc. two years ago after realizing many of its staff were incurring late fees and using payday loans. PayActiv works with 500 employers, including Walmart.\n\nOf Nazareth’s 400 employees, 338 are enrolled in PayActiv and 280 use it regularly, Ms. Haynes said.\n\nThe benefit attracts workers and saves Nazareth money, Ms. Haynes said, by “practically eliminating” its use of a staffing agency some workers preferred because the agency provided access to paycheck advances.\n\nTypically, payday loans charge $15 for every $100 borrowed. Bank overdraft fees often cost about $35. In contrast, PayActiv charges $5 per pay period when an employee uses the service, which also includes financial counseling and online bill payments.\n\nSome point out that a $5 fee can equate to a high annualized percentage rate on a small short-term loan.\n\nState officials also have concerns. Regulators in 10 states, including New York, are investigating whether the payroll-advance services are violating state banking laws. The companies that provide this service maintain that they give employees access to money they have already earned and aren’t lenders.\n\nRobyn McGuffin, a medication technician at Nazareth Home, says PayActiv has helped her avoid late and overdraft fees of as much as $80 a month.\n\nMs. McGuffin, 36 years old, says she typically uses PayActiv once or twice per pay period, generally for bills due before her next paycheck arrives. The Louisville resident also used it to buy a new car battery and cover her fiancé’s share of the household expenses when he was temporarily out of work due to a medical emergency.\n\nBy avoiding late fees, Ms. McGuffin, who earns about $16 an hour, said she has been able to splurge on the occasional restaurant meal or toy for her daughter. “I don’t freak out as much about bills, because I know I have the option to access money if I need to.”\n\nSome employers pair loans or accelerated paychecks with online tools to help workers budget, reduce debt and amass emergency savings.\n\nWalmart introduced salary advances in late 2017. It has seen employees rely less on payday loans and bank overdrafts, said David Hoke, who oversees health and well-being.\n\nEmployees pay $6 a month to use PayActiv. It is embedded in an app called Even, which also includes a budgeting service that nudges users to save surpluses. Walmart covers the cost for one month per quarter and caps the amount workers can accelerate at 50% of pay. Of the company’s 1.4 million workers, 380,000 are frequent app users, Mr. Hoke said.\n\nFor those in need of larger sums, some employers offer loan services that typically advance as much as $5,000, with repayments deducted from workers’ paychecks over four months to a couple years.\n\nLender Kashable approves “more than 60%” of applicants, said co-CEO Einat Steklov. It considers factors including job tenure and credit scores.\n\nThe average user has a subprime credit score and pays an annual interest rate of about 20%, Ms. Steklov said. Kashable’s default rate is 5%. Borrowers who leave their jobs before repaying in full generally switch to automated bank transfers.\n\nPima County, Ariz., has offered its 7,000 employees Kashable loans since 2016. Nearly 500 workers, many with credit scores below 650, have borrowed an average of $2,000 each, said county supervisor Richard Elías.\n\nMr. Elías said nearly half reported using the loan to pay off higher-cost debt, and many purchased or repaired cars.\n\n“Anything we can do to make the economic lives of our workers more stable benefits us” in the form of higher productivity, said Mr. Elías.\n\nWrite to Anne Tergesen at anne.tergesen@wsj.com", "description": "More companies are helping workers gain access to payroll advances and loans, reflecting concern over the impact money problems are having on productivity levels and worker retention.", "authors": ["Anne Tergesen", "Anne.Tergesen Wsj.Com"], "top_image": "https://images.wsj.net/im-101900/social"}