{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/22/the-latest-tropical-storm-karen-enters-southeast-c", "downloaded_at": "2019-09-22 23:11:36.543842+00:00", "title": "The Latest: Tropical Storm Karen enters southeast Caribbean", "language": "en", "text": "MIAMI (AP) - The Latest on tropical weather (all times local):\n\n5 p.m.\n\nTropical Storm Karen is continuing to spread blustery winds and flooding rains around the southern Windward Islands.\n\nKaren formed earlier Sunday and is now about 85 miles (140 kilometers) northwest of Grenada. The National Hurricane Center said the storm had top sustained winds of 40 mph (65 kph) as of Sunday afternoon and was expected to approach Puerto Rico and the U.S. and British Virgin Islands on Tuesday. Forecasters say the storm could bring tropical storm-force winds and heavy rains and flash flooding to those islands on its approach.\n\nElsewhere, Tropical Storm Jerry is raising the risk of tropical storm-force winds as it moves closer to Bermuda. But forecasters say it’s still too early to determine what impacts Jerry may have on Bermuda. At 5 p.m. Sunday, Jerry’s center was located about 405 miles (655 kilometers) south-southwest of Bermuda. Jerry has top sustained winds of 65 mph (100 kph).\n\n____\n\n2 p.m.\n\nTropical Storm Karen is moving into the southeastern Caribbean Sea, pushing gusty winds and heavy rains across the southern Windward Islands.\n\nKaren became the 11th named storm of the current Atlantic hurricane season earlier Sunday. At 2 p.m. Sunday afternoon, its center was located about 60 miles (95 kilometers) north of Grenada. The U.S. National Hurricane Center in Miami says Karen has top sustained winds of 40 mph (65 kph) and is moving to the west-northwest at 13 mph (20 kph).\n\nA tropical storm warning is in effect for Grenada and St. Vincent and the Grenadines. A tropical storm watch now covers the U.S. Virgin Islands, the British Virgin Islands, and Puerto Rico. Forecasts say Karen will cross the eastern Caribbean between now and Monday and is expected to approach Puerto Rico and the Virgin Islands on Tuesday.\n\nThe hurricane center says it expects the storm to change little in strength over the coming 48 hours.\n\n___\n\n12:10 p.m.\n\nThe 11th named storm of the hurricane season has developed in the Atlantic.\n\nThe National Hurricane Center said Tropical Storm Karen formed early Sunday near the Windward Islands.\n\nMaximum sustained winds were near 40 mph (65 kph).\n\nA tropical storm warning was in effect for Trinidad and Tobago, Grenada and St. Vincent and the Grenadines, suggesting tropical storm conditions are likely in the next 12 hours.\n\nA tropical storm watch also was issued for Puerto Rico and the Virgin Islands, meaning tropical storm conditions are possible in the next 48 hours.\n\nBy midday Sunday, Karen was moving toward the west-northwest around 13 mph (20 kph), and a northwest turn was expected Monday.\n\nThe storm was expected to approach Puerto Rico and the Virgin Islands on Tuesday.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Latest on tropical weather (all times local):", "authors": ["The Washington Times Http"], "top_image": "", "published_at": "2019-09-22"}