{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7582905/Painful-moment-3ft-pike-sinks-teeth-Russian-fishermans-groin-wont-let-go.html", "downloaded_at": "2019-10-17 11:36:02.270218+00:00", "title": "Painful moment 3ft pike sinks its teeth into Russian fisherman's groin and won't let go", "language": "en", "text": "The embarrassing incident was recorded on a fishing boat on a Russian river\n\nHe then awkwardly used a knife to prise its jaw open without the fish biting again\n\nA pike was spotted sinking its teeth into a fisherman's groin after being caught\n\nThis is the rather awkward moment a pike sank its teeth into the groin of the Russian fisherman trying to catch it.\n\nThe underwater angler, named Artemiy, is seen standing wide-legged in a wet suit on a boat with the wriggling fish firmly attached to his manhood.\n\nHe had been fishing with friends on a Russian river when he caught the nibbler.\n\nIn the footage, Artemiy's friends hold back their laughter as he struggles to pull the sharp-toothed fish from his groin.\n\nHis friend Tyoma asks: 'Are your testicles alive?'\n\nHe replies with relief: 'She missed.'\n\nThis is the rather awkward moment a pike sank its teeth into the groin of Russian underwater angler Artemiy who was trying to catch it\n\nBut rather than struggle with creature, Artemiy keeps his composure, and first picks the other pike he has caught off his blade.\n\nArtemiy then grabs a knife to free himself from the pike's clenched teeth, his mate helpfully says: 'Don't cut off anything there.'\n\nThe angler says: 'This is the first time I've seen such a thing.'\n\nBut his friend is still worried about Artemiy getting bitten in his privates.\n\nArtemiy then grabs a knife to free himself from the pike's clenched teeth, his mate helpfully says: 'Don't cut off anything there'\n\n'I'm afraid she'll snap her teeth again,' he said.\n\nBut eventually as the video shows he cuts the fish free.\n\nFresh water northern pike can be found in rivers across Canada, the USA, Britain and parts of Western Russia.\n\nNot particularly picky with their food, pike use their several hundred teeth to feed on other fish, frogs, or even waterbirds.", "description": "Underwater angler Artemiy was fishing on a Russian river with friends when an angry northern pike bit his groin and refused to let go.", "authors": ["Will Stewart For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/11/19831498-0-image-a-12_1571307119328.jpg", "published_at": "2019-10-17"}