{"pub": "metro", "url": "https://metro.co.uk/2019/10/08/dead-baby-sea-turtle-104-pieces-plastic-stomach-10880938", "downloaded_at": "2019-10-08 11:40:28.942311+00:00", "title": "Dead baby sea turtle had 104 pieces of plastic in its stomach", "language": "en", "text": "The depressing realities of our plastic pollution (Gumbo Limbo Nature Center)\n\nA heartbreaking image of a dead Loggerhead turtle is being circulated on Facebook after it was found to have 104 pieces of plastic in its stomach.\n\nThe baby turtle, no bigger than the palm of your hand, was found in Florida last week by the Gumbo Limbo Nature Center in Boca Raton.\n\nThe staff there pulled out the pieces of plastic and laid them in rows – providing a visceral reminder of the dangers of millions of tonnes of plastic currently being dumped into our oceans each year.\n\n‘Not such a happy #TurtleTuesday this week,’ the Gumbo Limbo team posted on their Facebook account.\n\n‘It’s washback season at Gumbo Limbo and weak, tiny turtles are washing up along the coastline needing our help. Unfortunately, not every washback survives. 100% of our washbacks that didn’t make it had plastic in their intestinal tracts.\n\nAdvertisement\n\nAdvertisement\n\n‘This turtle, which would fit in the palm of your hand, had eaten 104 pieces of plastic. This is a sad reminder that we all need to do our part to keep our oceans plastic free.’\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nThe turtle had been eating various different kinds of plastic, staff revealed.\n\n‘We found a piece of a balloon. There was a wrapper that goes on the outside of bottles,’ Whitney Crowder, the sea turtle rehabilitation coordinator at Gumbo Limbo, told the South Florida Sun Sentinel .\n\nLike all marine life, turtles are at huge risk from plastic in the oceans (Getty Images)\n\nA ‘washback’ turtle is a baby turtle that could only make it a few miles out to sea before being washed back to shore.\n\nFlorida is an important breeding ground for turtles, with five different species making their nests on the beaches there. These include the loggerhead turtle (Caretta caretta), green turtle (Chelonia mydas), leatherback turtle (Dermochelys coriacea), Kemp’s ridley turtle (Lepidochelys kempii) and hawksbill turtle (Eretmochelys imbricata).\n\nA turtle’s early years will be spent drifting around seaweed to find small shrimp and crustaceans to eat. Unfortunately, in 2019, they will also find heaps of manufactured non-biodegradable plastic in there as well.", "description": "The heartbreaking picture was shared on Facebook", "authors": ["Jeff Parsons"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_88954616_1570530718.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-08"}