{"pub": "rt", "url": "https://rt.com/news/470485-turkey-cross-syria-soon-erdogan-aide", "downloaded_at": "2019-10-09 02:12:10.653822+00:00", "title": "Turkey warns Kurdish fighters it will enter Syria ‘shortly’", "language": "en", "text": "The Turkish government has issued a warning to Kurdish fighters in Syria, stating it will enter the country “shortly” along with a force of allied militants, where it will conduct border-clearing operations.\n\n“The Turkish military, together with the Free Syrian Army, will cross the Turkish-Syrian border shortly. YPG militants have two options: They can defect or we will have [to] stop them from disrupting our counter-ISIS efforts,” Turkish government spokesman Fahrettin Altun said in a tweet on Tuesday.\n\nThe Turkish military, together with the Free Syrian Army, will cross the Turkish-Syrian border shortly.\n\n\n\nYPG militants have two options: They can defect or we will have stop them from disrupting our counter-ISIS efforts.https://t.co/vQByIUQHQB — Fahrettin Altun (@fahrettinaltun) October 8, 2019\n\nThe warning comes on the heels of a minor American military pullout from the region, clearing the way for the Turkish operation. Airstrikes on Kurdish positions along the Syrian-Iraqi border were reported less than a day after the move, as Ankara prepared for its incursion.Turkey has long complained about the presence of Kurdish militia fighters along the border in northern Syria, arguing they are allied with the Kurdistan Workers Party (PKK), an armed group in Turkey which has feuded with the government intermittently for decades.\n\nAlso on rt.com Kurdish leaders mull cooperation with Damascus & Moscow as US pulls troops from northern Syria\n\nAnkara hopes to push the Kurdish fighters away from the border to create a “safe zone,” where it plans to resettle millions of Syrian refugees currently living in Turkey.\n\nOver nearly seven years of war in Syria, the Kurds have proved a potent force against the Islamic State, particularly in the north and east, where fighters grouped under the umbrella of the “Syrian Democratic Forces” (SDF) took back dozens of IS-held towns backed by US airpower and other material support. The fighters are now left with few options but to retreat, though some have mulled a partnership with Damascus, hoping to hold off the Turkish attack.\n\nIn addition to Turkish regulars, the upcoming border-clearing operation will include fighters from the “Free Syrian Army,” a loose collection of militants backed by Ankara.\n\nIf you like this story, share it with a friend!", "description": "The Turkish government has issued a warning to Kurdish fighters in Syria, stating it will enter the country “shortly” along with a force of allied militants, where it will conduct border-clearing operations.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5d9d2c192030276b37174772.JPG", "published_at": "2019-10-09"}