{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7577365/Facebook-revamps-bug-bounty-program-paid-50-000-hackers-discover-flaws.html", "downloaded_at": "2019-10-15 23:13:39.429610+00:00", "title": "Facebook revamps 'bug bounty' program that has paid as much as $50,000 to hackers who discover flaws", "language": "en", "text": "Facebook will beef up incentives for its bug bounty program which offers payouts for hackers that discover flaws in the platform's system design.\n\nIn a blog post on Tuesday, Facebook announced that it will now let participants in its bug bounty program actively assess third-party apps for security flaws instead of 'passively observing the vulnerability.'\n\nThis means that with the app developers blessing, researchers will be able to be more proactive in their efforts by testing apps actively as opposed to watching on the sideline.\n\nFacebook has expanded a bug bounty program designed to identify security flaws on its platform (Stock photo)\n\nAccording to Facebook, will likely increase the scope of its bounty program.\n\n'This change significantly increases the scope of the security research that our bug bounty community can share with us and get rewarded for when they find potential vulnerabilities in these external apps and websites,' said Dan Gurfinkel, Security Engineering Manager for Facebook in a statement.\n\nWhite hat hackers that report security flaws to Facebook will receive a minimum of $500 for low-security threats and the platform says there will be no upper limit on the highest payment.\n\nAccording to Wired, the largest bounty ever reported to Facebook received $50,000. Apple's bug bounty program has a maximum reward of $1 million.\n\n'As always, we will issue rewards based on the impact of each valid report and other factors indicated within our terms, with a minimum reward of $500,' wrote the platform.\n\nThe company says it will also now provide bonuses of up to $15,000 and all the way down to $1,000 for flaws found in its native apps. That sum will be added on to the initial bounty pay-out.\n\nBug bounty programs are designed to help expand companies' resources for identifying and closing security flaws in their systems and are now employed by nearly every major tech company, including Google, Apple, and Amazon.\n\nIn July Google also increased incentives offered through its bug bounty program, doubling the max pay-out from $15,000 to up to $30,000.", "description": "Facebook announced on Tuesday that it will now let participants in its bug bounty program actively assess third-party apps for security flaws instead of 'passively observing the vulnerability.'", "authors": ["James Pero For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/22/18587498-0-image-a-14_1571174975522.jpg", "published_at": "2019-10-15"}