{"pub": "usatoday", "url": "https://usatoday.com/story/sports/nba/grizzlies/2019/10/13/memphis-grizzlies-marko-guduric-nba-serbia-yugoslavia/3968759002", "downloaded_at": "2019-10-13 18:38:42.794017+00:00", "title": "How a childhood of terror and triumph shaped Memphis Grizzlies wing Marko Guduric", "language": "en", "text": "CLOSE Watch first-year Memphis Grizzlies wing Marko Guduric display his shooting stroke in a preseason practice. David Cobb, The Commercial Appeal\n\nMEMPHIS — When Marko Guduric returns to the remote mountain town Priboj, where he was raised in Serbia, he no longer plays on the outdoor basketball courts that he used as a child.\n\nHe cherishes his time off too much to risk injury for the sake of nostalgia.\n\nBut those long — often cold — days on the hard courts in Priboj define who Guduric is as he begins his NBA career with the Memphis Grizzlies.\n\n\"I would never change my childhood for anything,\" Guduric said\n\nIt was a childhood fist marked by terror and then by a triumph that put Guduric on a path to the highest level of basketball.\n\nWarning sirens\n\nGuduric, 24, remembers hearing sirens warning that the planes and their bombs were coming.\n\n\"You have to go and hide in the basement just in case,\" Guduric said.\n\nLIMITED TIME OFFERS: Get full access to the Commercial Appeal\n\nNATO spent nearly three months in 1999 conducting air strikes on Guduric's home country, then known as Yugoslavia.\n\nThe attacks came in response to what NATO described as the nation's \"ethnic cleansing\" of Albanians. But the strikes also resulted in between 488 and 527 civilian deaths, according to Human Rights Watch.\n\n\"Innocent people died because of politics and whatever,\" Guduric said. \"That was my childhood. It was a difficult time, but I survived it.\"\n\nNext came triumph.\n\nMonumental victory\n\nThe 2002 FIBA World Championship tournament in Indiana pitted a solid collection of U.S. NBA players against a field of the world's best.\n\nThat included a Yugoslavian team led by NBA All-Stars Peja Stojakovic and Vlade Divac.\n\nThere were sparse crowds in Indianapolis' biggest venues during the 11-day competition.\n\nBut when Yugoslavia played, it was appointment television in Priboj.\n\n“It was crazy,\" Guduric said. \"Basketball is a big thing in Serbia.\"\n\nIt became an even bigger thing when Yugoslavia beat the U.S. 81-78 in the quarterfinals on its way to a world championship.\n\n\"That was the moment,\" Guduric said. \"I was 7 years old. That was the moment I fell in love with basketball.”\n\nHe remembers the outdoor courts in Priboj filling up after Yugoslavia's victory.\n\n\"As a kid, you were just proud and you go out and immediately play on the streets,\" Guduric said.\n\nA headline in The Commercial Appeal after the U.S. loss read, \"Losses give USA rude awakening.\"\n\nIn Yugoslavia, the victory brought a sense of pride amid geopolitical turbulence.\n\n\"Thousands of people celebrated in the center of Belgrade, and in all parts of the city,\" read one Serbian news account of the game's aftermath. \"The end of the game was also marked by fireworks, firecrackers and gunfire from a wide variety of weapons.\"\n\nGuduric can still rattle off who was on that USA team: Reggie Miller, Paul Pierce, Andre Miller and Jermaine O’Neal, among them.\n\nFenerbahce's Marko Guduric, right, drives to the basket as Madrid's Facundo Campazzo tries to block him during their Final Four Euroleague third place basketball match between Real Madrid and Fenerbahce Beko Istanbul at the Fernando Buesa Arena in Vitoria, Spain, Sunday, May 19, 2019. (Photo: Alvaro Barrientos, AP)\n\nThe path to America\n\nA Wikipedia page for Priboj lists soccer and handball players among its notable residents.\n\nGuduric is the only basketball player listed.\n\nWhile Yugoslavia and Serbia have produced numerous NBA players, Priboj has not.\n\nGuduric first played soccer, a sport that his father and uncle enjoyed.\n\nBut after the 2002 world championship, his heart was set.\n\n\"The first time I touched the ball, that feeling, it’s just unbelievable,\" Guduric said.\n\nThere was just one problem.\n\n\"We had only one gym and you could never play there as a kid,\" Guduric said. \"So you had to play outside.”\n\nSo he did.\n\nHe recalls wearing a hoodie and practicing in temperatures around 40 degrees as he pursued his dream.\n\nFinally, when Guduric was 15, his family moved to the Serbian capital of Belgrade.\n\nBy 18, he had signed with Crvena zvezda, a professional team in Belgrade, and in 2017 he signed with a Turkish team in the EuroLeague.\n\nMarko Guduric of Serbia is challenged by Gian Clavell of Puerto Rico during their FIBA Basketball World Cup, at the Wuhan Sports Center in Wuhan in central China's Hubei province, Friday, Sept. 6, 2019. (AP Photo/Andy Wong) (Photo: Andy Wong, AP)\n\nThere, Guduric hit 47.7% of his 3-pointers in 36 games during the 2018-19 season, according to Basketball Reference.\n\nThe Grizzlies noticed and signed him as a free agent to a two-year contract this offseason.\n\n“This is a global game,\" said Grizzlies executive vice president of basketball operations Zach Kleiman. \"You can find players anywhere you can look. ... In searching for shooting, it’s something that jumped out.\"\n\nNow Guduric is in the United States for the first time preparing for his rookie season in the NBA.\n\n“Growing up and playing basketball, you want to become and NBA player one day,\" he said.\n\nGuduric's place on the Grizzlies\n\nGuduric scored 22 points on 10-of-15 shooting (2-of-6 from 3-point range) in the Grizzlies' first two preseason games.\n\nWith the team's wing rotation not solidified, he has an opportunity to claim early playing time in first-year coach Taylor Jenkins' system, which encourages 3-point shooters to \"let it fly.\"\n\n\"I think his body is getting adapted to how fast we want to get up and down the floor,\" Jenkins said. \"Another guy who can help create for us. Pick-and-roll wise you can put the ball in his hands in the flow of the offense.\"\n\nMemphis Grizzlies guard Marko Guduric (23) plays in the second half of an exhibition NBA basketball game against Maccabi Haifa Sunday, Oct. 6, 2019, in Memphis, Tenn. (AP Photo/Brandon Dill) (Photo: Brandon Dill, AP)\n\nThe Grizzlies must finalize their 15-man roster by Oct. 21. Through two preseason games, Guduric appears likely to make the cut.\n\nKleiman sees Guduric not just as a shooter but as a high-IQ player who can make plays off the dribble and play \"good team defense.\"\n\nMaking Priboj proud\n\nGuduric knows the history of his hometown well. He knows that a few decades ago, it was a manufacturing hub churning out vehicles for the military.\n\n\"My town was actually one of the richest towns,\" he said.\n\nBut when Guduric returns to Priboj now, he sees struggle.\n\n\"After the war — we’ve had many wars — after that period everything just went bad,\" he said.\n\nSo as Guduric emerges in the NBA, he is not only achieving a personal dream. He is hoping to be an inspiration.", "description": "Marko Guduric is not just fulfilling a personal dream with the Memphis Grizzlies. He is hoping  to inspire his struggling Serbian hometown.", "authors": ["David Cobb", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/09/PMCA/f1ea1397-6957-48ee-a6f4-afe7cc578621-Grizz_10.jpg?crop=2594,1460,x0,y729&width=3200&height=1680&fit=bounds", "published_at": "2019-10-13"}