{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/26/hot-pursuit-athletes-chase-world-medals-in-swelter", "downloaded_at": "2019-09-26 16:51:28.734930+00:00", "title": "Hot pursuit: Athletes chase world medals in sweltering Qatar", "language": "en", "text": "DOHA, Qatar (AP) - Marathons at midnight. Training sessions in saunas. Cooling vests packed with ice. Air conditioners humming inside an outdoor stadium.\n\nCoaches, athletes and event organizers have been at their creative best in an attempt to beat the heat at world championships in Qatar. For 10 days, athletes will run, throw and jump in the desert, where the 100-degree temperatures (38 Celsius) and 70 percent humidity will be every bit as fierce as anyone they line up against.\n\nIt will be a track meet like no other - good practice for next year’s Olympics in Tokyo, which is expected to be every bit as much of a sizzler - and quite a challenge for the nearly 2,000 participants descending on Doha to go for gold, silver and bronze in some of the most extreme conditions they’ve ever faced.\n\n“I’ve never raced in heat at this level,” American marathoner Roberta Groner said.\n\nOrganizers scheduled both marathons - beginning with Friday’s women’s event - to start a minute before midnight, and for the race walks to kick off at 11:30 p.m., figuring that pounding the streets under floodlights was better than doing it under the broiling sun.\n\nThis week, the sea breeze kicking off the Persian Gulf has actually made it more humid at night - it was 90 degrees (32 C) with 69 percent humidity and a real-feel temperature of 104 (40 C) at midnight Thursday - and the question has now become whether they’ve simply traded one problem for another.\n\n“The thing with these athletes, they don’t know when to stop. They’re too competitive,” said associate professor of physiology Santiago Lorenzo, a former Olympic decathlete who has done studies on the effects of heat on athletes. “They’ll keep running until they drop. So the organizing committee, they have to make sure they think about the safety of their runners.”\n\nIAAF president Sebastian Coe bristled at the notion that taking world championships to the desert in September was folly, and wouldn’t bite when asked about speculation that more than half of Friday night’s 70-woman field might not finish the race. He said there will be more water, and more medical staff, on the course. Everyone will be keeping a keen eye open for signs of dehydration, heat exhaustion and heat stroke.\n\n“We want as many people to finish in as good a shape as possible,” Coe said. “The medical team will be very alert. The heat is not the big issue. Anyone who has run or competed knows you can deal with heat, but humidity is a challenge.”\n\nQatar retrofitted Khalifa International Stadium, an open-roof venue, with air conditioning - one piece of this country’s plan to become a big-time host of major sporting events. The World Cup soccer tournament will be there in three years, and the track championships will offer an instructive glimpse into how the system works at one of Doha’s crown-jewel venues.\n\n“It was very, very nice in here compared to the walk from the car into the stadium,” American steeplechaser Emma Coburn said during a news conference Wednesday inside the 48,000-seat stadium.\n\nIndeed, temperatures inside are a good 20 degrees cooler than in the parking lot.\n\nAnd still, adjustments are being made.\n\nOne example comes from an unlikely place: Shot putter Ryan Crouser said he’s been running hot water over the shots before he brings them outside for practice so they won’t get slick with condensation.\n\n“We’ve been heating them up to 100 degrees to get them above the dew point,” Crouser said.\n\nThe U.S. and other countries are keeping ice-filled cooling vests at the ready, while some teams are sending their athletes into saunas as part of a training regimen designed to prepare them for the conditions.\n\nAfter a recent practice, distance runner Molly Huddle posted a picture of the readings on her phone.\n\nHumidity: 80%. Dew point: 83%. Feels like: 112 F (44 C).\n\nThe time was 9:32 p.m.\n\nAlso on social media, a tweet from Nigerian discus thrower Chioma Onyekwere: “Heading to my first practice in Doha. Hoping the heat won’t be the end of me.”\n\nThe IAAF has done away with its tradition of holding both day and night sessions, instead choosing to pack all the action into the evening hours and avoid the daytime highs, which can still approach 105 (40 C), even in early fall.\n\nNobody will stay up later than the marathoners.\n\nAmerican Andrew Epperson, an assistant cross country coach at Colorado State, will keep his body clock on Colorado time, traveling to Doha only a few days before the men’s marathon, which takes place Oct. 5. He’s been practicing at 3 p.m. in Colorado - when it’s midnight in Doha. His plan is to not adjust to the local time, and instead just fly in, stay on his normal time and then compete.\n\n“I’m pretty familiar with humidity and burning and some warm conditions,” Epperson cracked. He grew up in Houston.\n\nMeanwhile, Groner, the American marathoner who races Friday night, wore tights and two long-sleeved shirts on her recent training runs in New Jersey.\n\nThankfully, headlamps won’t be required. The marathon course is set on a well-lit, looped path along the waterfront of Doha. The backdrop is the city’s tableau of futuristic skyscrapers, giving the TV cameras a chance to capture some cool looking scenery despite the stifling heat.\n\nBack inside the stadium, the air conditioning will run full steam during the day to keep things cool, then be turned off when actual competition starts, lest the currents affect the sprinters, or blow a javelin or discus off line.\n\nDifferent, for sure. But not enough to faze high jumper Vashti Cunningham. She trains in the desert climes of Las Vegas and recently won the U.S. title during a broiling weekend in Des Moines, Iowa.\n\n“But there’s hotter to come,” Cunningham said.\n\nTrack at the Tokyo Olympics starts July 31, 2020. The temperature there on July 31, 2019 was 95 degrees (35 C).\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Marathons at midnight. Training sessions in saunas. Cooling vests packed with ice. Air conditioners humming inside an outdoor stadium.", "authors": ["The Washington Times Http", "Pat Graham", "Eddie Pells"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/26/qatar_athletics_worlds_54771_c133-0-2745-1523_s1770x1032.jpg?2f3ff69b5c41d8656cf09628774f2ecd8e672972", "published_at": "2019-09-26"}