{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-sterling/sterling-rebounds-as-brexit-breakthrough-hopes-grow-idUKKBN1WO0S1", "downloaded_at": "2019-10-09 10:51:18.027278+00:00", "title": "Sterling rebounds as Brexit breakthrough hopes grow", "language": "en", "text": "LONDON (Reuters) - Sterling jumped more than 0.5% against the U.S. dollar on Wednesday after the Times newspaper said the European Union was ready to agree to a major concession in Brexit negotiations.\n\nAn English ten Pound note is seen in an illustration taken March 16, 2016. REUTERS/Phil Noble/Illustration/Files\n\nThe bloc is prepared to offer a mechanism for the Northern Irish assembly to leave a new so-called backstop after a number of years, the report said.\n\n(Graphic: GBP Positions here)\n\n“By allowing Northern Ireland to take the decision on whether they want to stay in the EU or not, the market has taken this news positively as it will be a major step towards a breakthrough in the Brexit deadlock,” said Lee Hardman, a currency strategist at MUFG based in London.\n\nThe pound was last up 0.4% at $1.2265 GBP=D3, after spiking to as much as $1.2292. It was also up against the euro by 0.2% at 89.54 pence EURGBP=D3.\n\nThe British currency has been on the back foot in early London trading on media reports that British Prime Minister Boris Johnson faces rebellion in his cabinet if he leads the country to a no-deal Brexit.\n\nA “very large number” of Conservative members of parliament are prepared to resign if the UK faces leaving the EU without a deal, the Times newspaper reported, citing an unnamed cabinet minister.\n\nThe Financial Times reported on Wednesday that a least 50 members of parliament from the party will revolt against a general election manifesto pledging to pursue a no-deal Brexit.\n\nMeanwhile, the Guardian reported that the European Union may offer to extend the Brexit deadline until June 2020.\n\nJane Foley, a senior foreign exchange strategist at Rabobank, said the market remains highly sensitive to Brexit news and so rhetoric from key players in the Brexit decision-making process could have an impact.\n\nPrime Minister Boris Johnson has consistently said the United Kingdom will leave the EU on Oct. 31 with or without a deal.", "description": "Sterling jumped more than 0.5% against the U.S. dollar on Wednesday after the Times newspaper said the European Union was ready to agree to a major concession in Brexit negotiations.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191009&t=2&i=1438770480&w=1200&r=LYNXMPEF980LC", "published_at": "2019-10-09"}