{"pub": "marketwatch", "url": "https://marketwatch.com/story/snap-earnings-show-continued-strong-user-growth-stock-heads-higher-in-late-trading-2019-10-22", "downloaded_at": "2019-10-23 08:34:58.182878+00:00", "title": "Snap earnings show continued strong user growth, but stock slides in late trading", "language": "en", "text": "Snap Inc. shares went on a jagged ride Tuesday afternoon despite an earnings report that showed continued strong gains in users and revenue.\n\nSnap SNAP, -3.98% announced that active users increased by 7 million, a better-than-expected gain following Snapchat’s best quarter for user growth in its history. The company revealed third-quarter losses of $227.4 million, or 16 cents a share, on revenue of $446.2 million, up from sales of $298 million in the same quarter a year ago. After adjusting for stock-based compensation and other expenses, Snap reported losses of 4 cents a share, better than an adjusted loss of 12 cents a share in the year-ago quarter.\n\nAnalysts on average expected Snap to report adjusted losses of 5 cents a share on sales of $435 million, while adding about 4 million new daily active users, according to FactSet. Snap stock, which closed with a 3.9% decline at $14.01, initially dropped more than 7% in after-hours trading, then quickly moved to gains, but then fell again to losses of more than 5%.\n\nSnap Chief Executive Evan Spiegel said that he expected the company would break even on an adjusted-Ebitda basis in the fourth quarter, which would easily be the closest thing to profitability the young company has ever presented.\n\n“The growth in our business this year has put us on a clear path to Q4 Adjusted EBITDA profitability, and we are excited about reaching this important milestone as a team,” Spiegel said in remarks prepared for a conference call scheduled for 2 p.m. Pacific time.\n\nSnap said that it expects to report adjusted Ebitda of up to $20 million on revenue of $540 million to $560 million in the holiday quarter, which is typically its largest of the year thanks to increased advertising budgets; analysts on average were projecting a break-even quarter on an adjusted basis with sales of $555 million, according to FactSet. Snap also projected the addition of another 4 million to 5 million users in the fourth quarter, after blowing away the third-quarter forecast of 2 million to 4 million net additions.\n\nSnap’s stock has been one of the biggest success stories in a mixed year for tech, rising more than 150% so far in 2019 as Snapchat has defied expectations that its user base would shrink. Executives have credited a redesigned mobile app for Alphabet Inc.’s GOOGL, -0.25% GOOG, -0.27% Android operating system, which is more similar to the experience that Snap offers on its Apple Inc. AAPL, -0.23% iOS-based app.\n\n“We are particularly grateful for the investor community that has supported us through the many changes we have made over the past few years to evolve our business and we are looking forward to building an enduring partnership with our investor base that will allow us to better serve our community and make a positive difference in the world,” Spiegel said toward the end of his prepared remarks. “Thank you for the trust you have placed in us.”\n\nIn addition to the revamped Android app, Snapchat also introduced new filters in the second quarter that allowed users to see what they might look like at different ages, which was believed to be the spark for record user growth in that quarter. Many analysts were hoping that Snap’s push into social gaming could continue that momentum in the third quarter.\n\n“We believe that while Facebook’s audience and broader business has evolved in such a way that gaming distribution is no longer a meaningful point of investor conversation, Snap is uniquely positioned to recreate a similar social gaming platform business on mobile,” Evercore ISI analyst Kevin Rippey wrote in a September upgrade of Snap stock, harking back to a time when Facebook Inc. FB, -3.91% brought in users and cash through popular social games on its platform such as Zynga Inc.’s ZNGA, -2.54% “Farmville.”", "description": "Snap Inc. shares went on a jagged ride Tuesday afternoon despite an earnings report that showed continued strong gains in users and revenue.", "authors": ["Jeremy C. Owens", "Technology Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-GY407_snap11_ZG_20181112173938.jpg", "published_at": "2019-10-22"}