{"pub": "marketwatch", "url": "https://marketwatch.com/story/wendys-says-breakfast-will-account-for-at-least-10-of-sales-2019-10-14", "downloaded_at": "2019-10-15 12:29:06.663089+00:00", "title": "Wendy’s says breakfast will account for at least 10% of sales", "language": "en", "text": "Wendy’s Co. is confident that this time they’ve got breakfast right, and they think it will pay off big time.\n\nDuring its Friday investor event, Wendy’s WEN, +1.78% executives talked up the breakfast entry, which the fast-food company is launching in 2020 and is putting $20 million behind.\n\nWendy’s has tried, unsuccessfully, to add a breakfast menu in the past. Kurt Kane, president of the company’s U.S. business, said the issues of the past were due to the operational complexity of the previous breakfast menus.\n\n“We know what to expect and what we’re anticipating is that breakfast sales will quickly grow to at least 10% of the total day for our business,” Kane said, according to a FactSet transcript. “We have not seen cannibalization in our restaurants where we’ve brought in breakfast.”\n\nThis time around, Wendy’s has 18 unique breakfast SKUs (stock keeping units) versus 45 previously, and the company has the support of franchisees to bolster this new part of the business. There’s going to be a big media push. And in the past, the breakfast menu has required $10,000 in equipment, whereas this time around, there’s no investment.\n\n“So we believe that this is incremental to our business overall, and that’s what makes it so financially powerful,” said Kane.\n\nRead: Impossible Burger couldn’t be sold in supermarkets until company secured FDA approval of game-changing ingredient\n\nSome analysts aren’t so sure.\n\n“[B]reakfast competition is likely to be intense and initial marketing spend must be appropriate,” UBS said. Analysts note that the “long-term could be outsize.”\n\nUBS rates Wendy’s stock neutral and moved its price target up $1 to $21.\n\n“We were surprised management did not incorporate some level of conservatism stemming from potential cannibalization of legacy dayparts and what we anticipate could be an aggressive response from competitors,” wrote Wedbush analysts led by Nick Setyan. “We hope they prove us wrong, but we bake in some conservatism and model system sales growth of 10% in 2020, below the low end of the guidance range.”\n\nWedbush rates Wendy’s shares neutral and moved its price target up $2 to $22.\n\nFor fiscal 2020, Wendy’s expects global systemwide sales of $12.0 billion to $12.5 billion. During the investor event, Chief Financial Officer Gunther Plosch said that breakfast will account for between $600 million and $800 million in sales.\n\n“You will also know that we are going to have losses still in 2020, right, because the first profitable year is 2021,” he said.\n\nSunTrust Robinson Humphrey is bullish about breakfast, and rates Wendy’s stock buy with a $26 price target, up from $24.\n\nSee: ‘Totally bizarre!’ - nutritionists see red over study playing down the health risks of red meat\n\n“We expect breakfast to be successful due to strong performance in test markets, operational simplicity and franchisee alignment around the launch,” analyst Jake Bartlett wrote. In addition, breakfast has lower food costs and the marketing effort should drive customer awareness.\n\nSunTrust expects breakfast to become 6% of sales in 2020, 9.5% in 2021, and 11% of sales in 2022. And Bartlett expect it to drive 5.5% in U.S. same-store sales in 2020.\n\nMoreover, SunTrust says Wendy’s has more to fuel its same-store sales growth besides breakfast, including restaurant remodels and digital sales with the addition of Uber Eats and in-app delivery ordering by the end of 2019.\n\nWendy’s stock has rallied 35.5% for the year to date while the S&P 500 index SPX, -0.14% is up 18.3% for the period.", "description": "Wendy’s discussed its breakfast menu plans at length during its investor event, expressing confidence that it will quickly grow to a sizable portion of sales.", "authors": ["Tonya Garcia"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR001_wendys_ZG_20190910102134.jpg", "published_at": "2019-10-14"}