{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-poland-election-factbox/factbox-polands-ruling-nationalists-unfinished-business-idUKKBN1WN1I9", "downloaded_at": "2019-10-08 15:18:41.792925+00:00", "title": "Factbox: Poland's ruling nationalists' unfinished business", "language": "en", "text": "WARSAW (Reuters) - Poland’s nationalist Law and Justice (PiS) party has alienated European allies and divided families at home with a series of reforms tackling courts, media, cultural institutions and education.\n\nFollowing is a rundown of policies implemented by PiS during its four years in office as well as reform ambitions it has described ahead of Sunday’s parliamentary election, which polls show it is likely to win.\n\nRULE OF LAW\n\nCritics say PiS has given the ruling majority too much control over the justice system, in some cases contradicting the constitution. The party denies this, saying its reforms aim to make the court system more efficient and fair.\n\nIt has merged the positions of justice minister and prosecutor general, giving a politician direct oversight over criminal proceedings.\n\nIt changed the structure of the Supreme Court so that judges appointed under its rule will decide on the validity of elections, and gave parliament the power to select members of the National Council of the Judiciary which appoints all judges.\n\nPresident Andrzej Duda, a PiS ally, appointed Julia Przylebska, whom PiS leader Jaroslaw Kaczynski refers to as a “close friend”, to head a tribunal that rules on the constitutionality of acts of law.\n\nIncluded in PiS-sponsored changes to the criminal code is life sentence without parole, considered inhumane by the European Court of Human Rights.\n\nMore changes are planned. In its election programme PiS says it will lift the immunity of judges and prosecutors and change the rules on the immunity of lawmakers, leaving the decision to charge them with crimes to the prosecutor general.\n\nPiS also says it will continue its reform of the judiciary, without giving further details.\n\nFISCAL POLICY\n\nPiS has vastly raised welfare spending, while increasing VAT collection rates. It plans a balanced budget for 2020, although rating agencies say that it’s unlikely to succeed.\n\nSpending on families rose under PiS to 4% of GDP from 1.78% in 2015. The increase largely consists of a flagship child subsidy which grants parents 500 zlotys ($127) per month per child.\n\nAhead of European elections in May, the government gave a one-off payment of 1100 zlotys to every pensioner. Such a payment is not included in budget plans for 2020, but PiS says the benefit will be paid out if it wins the elections.\n\nThe government has also been steadily raising the monthly minimum wage which has gone up from 1750 zlotys in 2015 to 2600 zlotys planned for 2020. It’s set at 4000 zlotys for 2023.\n\nIt says its goal is to change Poland’s economic model so it’s no longer seen as a cheap labour destination for foreign manufacturers and the service industry.\n\nPiS is planning to raise retirement contributions for high-earners, as part of its goal to redistribute wealth.\n\nINVESTMENT\n\nPiS has said repeatedly that domestic capital should control strategic parts of the economy. Since it won power, the share of bank capital in Polish hands rose to nearly 60% from around 41% in 2015, following the purchase of a stake in Bank Pekao (PEO.WA) from Italy’s UniCredit (CRDI.MI).\n\nPiS is also planning large scale investments such as the construction of a hub airport in central Poland and building a canal through the Vistula Spit, which environmental activists say raises concerns.\n\nPiS wants to continue big energy projects that will help Poland maintain its reliance on coal, while also pledging to reduce carbon emissions, although its goals are less ambitious than EU consensus.\n\nIt wants to build a 1 gigawatt (GW) power station in Ostroleka, in north-eastern Poland, by 2023, which is expected to be the country’s last coal-fuelled plant.\n\nPiS wants to build a gas link to Norway to tap North Sea gas fields, and expand its infrastructure at home to be able to receive more seaborne oil from sources other than Russia.\n\nPiS has changed the majority of chief executives at state-owned companies, in some cases several times.\n\nEDUCATION, CULTURE AND MEDIA\n\nPiS has overhauled the structure and curricula of Polish schools in order include more patriotic education, national history and literature.\n\nIt wants to build a network of museums of “strategic importance for Poland”, such as the Museum of Polish History, as part of its “politics of history”, aiming to promote Poland’s vision of the past at home and abroad.\n\nNews coverage by state broadcaster TVP has become biased towards the ruling party, under changes to its management structure introduced by PiS.\n\nPiS officials have signalled the party will consider steps to bring more news outlets under the control of Polish capital during its second term, in a policy similar to that of its ally, Hungarian Prime Minister Viktor Orban.\n\nPiS also said in its programme it aims to regulate journalists by creating a professional organisation supervising their ethical standards, giving rise to accusations it wants to limit free speech.\n\nSoon after coming to power, PiS stopped financing in vitro fertilisation (IVF) treatments from the state budget.", "description": "Poland's nationalist Law and Justice (PiS) party has alienated European allies and divided families at home with a series of reforms tackling courts, media, cultural institutions and education.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-08"}