{"pub": "vice", "url": "https://vice.com/en_us/article/ne8kwd/trump-says-the-chaos-in-northern-syria-which-he-helped-create-has-nothing-to-do-with-us", "downloaded_at": "2019-10-17 11:34:44.459883+00:00", "title": "Trump Says the Chaos in Northern Syria, Which He Helped Create, “Has Nothing To Do With Us”", "language": "en", "text": "President Donald Trump offered a new position on his chaotic withdrawal from Northern Syria: He's washed his hands of it entirely.\n\nFresh off of trying and failing to persuade Turkish President Recep Tayyip Erdoğan to pull back on his brutal invasion into Syria, Trump attempted to distance the U.S. from the mess, then he attacked the Kurds, the U.S.' most effective ally in the fight against ISIS, just because.\n\n“Our soldiers are not in harm's way, as they shouldn't be, as two countries fight over land that has nothing to do with us,” Trump said Wednesday, during comments in the Oval Office before a press conference with Italian President Sergio Mattarella. “It’s not our border.”\n\n“Syria’s friendly with the Kurds. The Kurds are very well protected,” Trump added. “Plus, they know how to fight. And, by the way, they’re no angels.”\n\nHe went on to attack the Kurds again, referring to the Kurdistan Workers’ Party, a militant organization inside Turkey also known as the PKK, as “part of the Kurds” and “probably worse at terror, more of a terrorist threat in many ways, than ISIS.”\n\nIn doing so, Trump appeared to be echoing Erdoğan, who has regularly pushed such claims against the Kurds.\n\nThe Kurdish forces in Syria, for their part, have been forced to make awkward alliances, joining forces with Bashar Assad’s Russia-backed government, in order to fight for their survival as the Turks continue a brutal offensive against them. It's not clear how many fighters have been killed since the Turkish offensive started on Oct. 9, but at least 160,000 civilians have been displaced, according to the U.N.’s Office for the Coordination of Humanitarian Affairs.\n\nRead: Trump’s Betrayal of the Kurds Is as Incoherent as It Is Dangerous\n\nTrump left the Kurds exposed in Northern Syria when he announced that he’d withdraw U.S. troops from the area. That effectively gave Turkey the green light to launch its long-threatened attack on Kurdish forces, who they argue are terrorists. Since then the administration has struggled to offer a coherent strategy for the region, vacillating between trying to broker a ceasefire and throwing the Kurds, once a key U.S. ally, under the bus.\n\nErdoğan, meanwhile, has insisted that he won’t back off. Sanctions or not, his country will go ahead its attack on the Kurds in Syria.\n\nThat's been a gift to ISIS, whose members have seized on the chaos. Hundreds of ISIS prisoners have escaped detention camps in Northern Syria after Kurdish forces abandoned their posts to weather the Turkish offensive.\n\nOn Wednesday Trump again tried to downplay the threat that those ISIS fighters could pose to the U.S., saying that the prisoners were released “just for effect.” He also repeated his claim that ISIS escapees were primarily Europe’s problem, not America’s.\n\nAs Trump downplayed the crisis in Northern Syria, Vice President Mike Pence and Secretary of State Mike Pompeo were boarding a plane to Turkey to continue their effort to broker a ceasefire.\n\nCover: President Donald Trump listens during a meeting with Italian President Sergio Mattarella in the Oval Office of the White House, Wednesday, Oct. 16, 2019, in Washington. (AP Photo/Evan Vucci)", "description": "He also attacked the Kurds.", "authors": [], "top_image": "https://video-images.vice.com/articles/5da75474df4e600009d5ef1b/lede/1571247893413-AP_19289548576730.jpeg?crop=1xw:0.8425xh;0xw,0xh&resize=1200:*", "published_at": "2019-10-16"}