{"pub": "afr", "url": "https://afr.com/companies/professional-services/misuse-of-supply-chain-financing-totally-unacceptable-20191030-p535m7", "downloaded_at": "2019-10-30 06:03:53.591913+00:00", "title": "Misuse of supply chain financing 'totally unacceptable'", "language": "en", "text": "\"The federal government has said they will exclude companies from government tenders if they are paying slowly and we are putting more pressure on the government to do exactly that.\"\n\nSupply chain finance refers to any methods that helps firms fund their supply chains, with so-called \"reverse factoring\" one of the most popular schemes.\n\nIn these schemes, big companies hire banks or financiers like Greensill Capital to make agreements with their suppliers. The supplier gets to choose exactly when it wants to be paid the full amount of money it is owed, with payment dates as soon as 10 days after goods and services are delivered.\n\nThe higher the credit rating of the big company initiating the early payment scheme, the lower the fees charged to suppliers and the more confidence banks and financiers have that they can collect the monies owed.\n\nBig companies like construction group CIMIC – which has been delaying payments to suppliers by at least 65 days – and Telstra use supply chain financing to extend formal payment terms.\n\nShadow spokesman for small business Brendan O'Connor said Labor welcomed the focus on reverse factoring arrangements and that Small Business Minister Michaelia Cash should publicly lend her support to the review. \"To date the minister has been silent on the issue of reverse factoring,\" Mr O'Connor said.\n\nA \"significant number\" of small businesses had contacted the ombudsman in relation to supply chain financing issues but it did not know how many companies were using the schemes, Ms Carnell said.\n\nAdvertisement\n\nThe ombudsman will contact accounting bodies and other industry organisations. Small businesses and family enterprises that have experienced supply chain financing have been urged to contribute to the review.\n\nAn interim report is expected to be released in March, followed by a full report by the end of April.\n\nConcern over the increasing use of supply chain financing schemes is rising globally. A letter sent to the US Financial Accounting Standards Board (FASB) in early October from the big four accounting firms said that while typical payment terms with suppliers historically might have been 60 to 90 days, some entities are now trying to negotiate payment terms with suppliers of up to 180, 210, or even 364 days.\n\nThe big four pointed out that because there are no specific disclosure requirements under US accounting regulations, there has been limited disclosure of supply chain financing schemes.\n\nThey have asked the FASB to require more disclosure to increase the schemes' transparency and clarify whether the owed invoices should be classified as trade payables or debt.\n\nUnder current accounting regulations in Australia and internationally, companies do not have to report the owed invoices as debt on their balance sheet and can instead account for them under trade payables, boosting cash flows.", "description": "The small business ombudsman will review whether companies are deliberately using financing schemes to manipulate their accounts and delay paying suppliers.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2032%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_53%2C$y_76/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/12fb299b918645c5b39fd0ee00b93a0cf75769fd", "published_at": "2019-10-30"}