{"pub": "businessinsider", "url": "https://businessinsider.my/apple-iphone-11-review-vs-pro-camera-features-2019-9", "downloaded_at": "2019-09-21 00:02:15.473883+00:00", "title": "After spending two full days with Apple’s new iPhones, I’m convinced the iPhone 11 is the best choice for most people — here’s why", "language": "en", "text": "source Crystal Cox/Business Insider\n\nApple’s iPhone 11, iPhone 11 Pro, and iPhone 11 Pro Max are launching Friday.\n\nAll three phones bring noticeable camera upgrades that make it possible to take ultrawide shots and capture better images in the dark.\n\nThe phones also offer great battery life that can easily last more than a day on a single charge.\n\nBut if you’re considering upgrading, it’s probably worth it only if you’re using an older model like the iPhone 7.\n\nVisit Business Insider’s homepage for more stories.\n\nIf you’ve owned an iPhone from day one – or at least for the past five years or so – you’ve probably come to expect major leaps in features and performance whenever a new model is announced in September.\n\nAfter all, the iPhone 5S from 2013 introduced a fingerprint reader to Apple’s smartphones, for the first time allowing users to unlock their device without having to peck in their passcode. The iPhone 6 from 2014 heralded a dramatic redesign with a larger screen that came to define how iPhones would look until the iPhone X launched in 2017.\n\nNow, in 2019, I’m here to tell you that the days of expecting major technological advancements that fundamentally change what we can do with our phones every year – or even every two years – may be behind us.\n\nThe iPhone 11 and the iPhone 11 Pro, which are launching in stores Friday, share many characteristics with the iPhone XS and the iPhone XR, which Apple introduced last year. They come in the same screen sizes, can recognize your face through Face ID just like the iPhone X phones before it, and have the same notch cutout near the top of the screen for the selfie camera and facial-recognition sensors.\n\nRead more: How Apple’s new iPhone 11 Pro compares to its biggest rival, Samsung’s Galaxy S10\n\nBut they also improve on the iPhone in the areas that matter most: namely when it comes to camera quality and battery life. That’s as important as ever for Apple, which has been grappling with slowing iPhone sales as smartphone shipments, in general, have been declining.\n\nThe iPhone 11 starts at $700, while the iPhone 11 Pro starts at $1,000, and the larger 11 Pro Max will set you back at least $1,100.\n\nHere’s a closer look at what it’s been like to use the iPhone 11 and the iPhone 11 Pro over the past few days.\n\nCamera\n\nsource Crystal Cox/Business Insider\n\nIf you’re trying to tell the difference between last year’s iPhone and the iPhone 11 or the iPhone 11 Pro, the camera will be a dead giveaway.\n\nThe iPhone is getting a triple-lens camera for the first time with the iPhone 11 Pro and the 11 Pro Max, the Pro’s larger sibling that comes with a 6.5-inch display. And the less expensive iPhone 11 comes with a dual camera, an important characteristic that distinguishes it from last year’s iPhone XR.\n\nAll three phones include a 12-megapixel ultrawide-angle camera with a 120-degree field of view and a 12-megapixel wide-angle lens. That ultrawide-angle camera makes it possible to capture more of the scene in a single shot – meaning you should no longer have to tell everyone to squeeze in tight to fit in the frame when taking group shots.\n\nThis is by no means a feature that’s entirely new to smartphones; Samsung’s Galaxy S10 and the OnePlus 7 Pro already offer this too.\n\nThe Pro model also has a 12-megapixel telephoto lens for achieving a better zoom unlike the iPhone 11. In addition to offering a more sophisticated zoom, you can also switch between this telephoto lens and the wide-angle lens to change the perspective of your portrait mode shots thanks to the Pro model’s third lens.\n\nThe ultrawide-angle camera is a useful addition to the iPhone, but it’s the iPhone 11’s new Night Mode that impressed me the most during my testing. The mode automatically kicks in when you’re taking photos in a dark environment, and I’ve found that shots taken on the iPhone 11 in the dark came out crisper, brighter, and clearer than those taken on the Galaxy S10 or the Google Pixel 3a XL. This feature works on all three of Apple’s new iPhones.\n\nWhen shooting in a daytime outdoor setting, the iPhone 11 certainly performed well – but was only marginally better, if at all, than the much less expensive $480 Pixel 3a XL. Both phones took images that were vibrant and sharp with accurate color, outperforming the Galaxy S10’s photos, which looked overexposed in comparison.\n\nThe iPhone’s selfie camera is also getting an upgrade from 7 megapixels on last year’s model to 12 megapixels on this year’s lineup. And selfies taken on the iPhone definitely look great, especially when compared with those taken on the Galaxy S10, which once again made colors look too bright and blown out. The Pixel 3a XL gives the iPhone 11 tough competition, but I still felt that the iPhone’s image offered more defined details.\n\nScroll through the images below to see a few sample shots.\n\niPhone 11 (Bright outdoor shot)\n\nsource Business Insider/Lisa Eadicicco\n\nGoogle Pixel 3a XL (Bright outdoor shot)\n\nsource Business Insider/Lisa Eadicicco\n\nSamsung Galaxy S10 (Bright outdoor shot)\n\nsource Business Insider/Lisa Eadicicco\n\niPhone 11 Pro (Low light)\n\nsource Business Insider/Lisa Eadicicco\n\nGoogle Pixel 3a (Low light)\n\nsource Business Insider/Lisa Eadicicco\n\nSamsung Galaxy S10 (Low light)\n\nsource Business Insider/Lisa Eadicicco\n\nBattery life\n\nsource Crystal Cox/Business Insider\n\nWith the iPhone 11, you can rest assured that you won’t be left stranded in search of a power outlet. I used the iPhone 11 Pro for roughly a day and a half – about 32 hours – without charging it and still had about 15% of its battery left.\n\nI’d usually consider that to be normal; after all, most of the phones I test can last for about a day and a half on a single charge. But I accidentally left the phone’s screen at maximum brightness for about two hours after a video shoot – while also setting the display to never time out – and was still able to get regular battery life. (This was while using the regular Pro; you can probably expect to get slightly longer battery life out of the larger Pro Max.)\n\nThe iPhone 11 seems to be performing well when it comes to battery life, too. At the time of writing, I’ve been using the phone from about 6:30 a.m. to 5:45 p.m., and I still have 71% of juice left.\n\nBattery life will always vary depending on how you use your phone. During this testing period, I used these phones for checking email, browsing social media, taking photos, streaming music (roughly one to two hours) and video (roughly 20 minutes), and checking my job’s Slack channel. If you use your phone for similar tasks, you can probably expect battery results like this.\n\nThe new iPhones also finally come with an 18-watt charger for juicing up your device more quickly – a much-requested upgrade from the smaller charging brick that older iPhones came with.\n\nDesign\n\nsource Crystal Cox/Business Insider\n\nThere’s another physical characteristic that makes the new iPhones stand out from their predecessors: their colors and design. The iPhone 11 Pro and the Pro Max have a new textured matte back, which gives the phones a more premium feel. It also makes them less prone to fingerprint smudges if you’re brave enough to use them without a case compared with rivals like the Galaxy S10.\n\nThe iPhone 11 has the more familiar glossy glass back that makes it resemble the iPhone XR, but it comes in new colors that have a pastel-like aesthetic.\n\nOne trait that hasn’t changed much, however, is the notch cutout that sits near the top of the display. It’s just as noticeable as it was last year and the year before on the iPhone X, which is somewhat disappointing considering other smartphone makers like Samsung have done more to make that cutout blend more seamlessly into the phone’s display.\n\nSamsung, for example, has squeezed the front-facing camera and facial-recognition sensors into a tiny circular space carved out near the top of the screen on its Galaxy S10 and Galaxy Note 10 phones. That makes the design seem all the more striking since it creates a more convincing illusion that the screen stretches from edge-to-edge.\n\nBut that may have its consequences, however, as the Galaxy S10’s facial recognition is said to be less secure than Apple’s, and security should definitely be prioritized over aesthetics.\n\nThe new iPhones also lack an in-screen fingerprint sensor unlike rivals such as Samsung, which means you have fewer choices of how to unlock your phone compared with alternatives.\n\nThe iPhone 11 Pro has gotten some enhancements when it comes to durability, too. The Pro models can withstand being submerged in up to 4 meters of water for as long as 30 minutes. Last year’s iPhones, and the iPhone 11, can handle being dunked in only 2 meters of water for the same period of time.\n\nDisplay and audio\n\nsource Crystal Cox/Business Insider\n\nThe iPhone 11 and the 11 Pro have also gotten some minor upgrades when it comes to the display and audio quality. The Pro’s screen is now brighter than that of last year’s iPhone (and the 11), but you’ll most likely notice this only when using the phone outdoors in very sunny conditions.\n\nThe cheaper iPhone 11 also has an LCD screen versus the 11 Pro’s OLED screen, similar to the difference between last year’s iPhone XR and iPhone XS. This isn’t too noticeable in everyday use, but the difference does become obvious whenever the screen turns mostly black – whether it be a dark transition between scenes in a movie trailer or a wallpaper with a mostly black backdrop. That’s because LCD screens can’t reach the same level of blackness as OLED displays.\n\nAll of the new iPhones also have spatial audio playback, which provides a mildly noticeable boost in sound quality. This was most evident when watching movie trailers on the 11 versus the iPhone XS Max, since it made the cinema score sound richer and more full-bodied. But since I use headphones more often when listening to music or watching video on my phone, I didn’t find myself making use of the spatial audio very much.\n\nShould you get it?\n\nsource Crystal Cox/Business Insider\n\nIf you’re trying to decide whether to upgrade to the newest iPhones, I’d urge you to think about what features matter most to you and how much you’re willing to spend.\n\nThe upgrade is certainly worth it if you’re operating on an older model like the iPhone 7 or earlier, but if you have an iPhone X or an iPhone XS, you’ll probably want to hold off for at least another year or so. Unless you’re really itching to try to use that ultrawide-angle camera or take better photos in the dark, the improvements in this year’s model most likely aren’t crucial enough to justify an upgrade.\n\nPerhaps you already know you want the latest iPhones, but you’re not sure whether to go with the iPhone 11 or the 11 Pro. That decision boils down to how much having an extra camera lens really matters to you.\n\nThe iPhone 11 Pro has a telephoto lens for better zooming in addition to its wide-angle and ultrawide-angle lens; both of the latter are also found on the iPhone 11 Pro. That extra lens also gives you more flexibility when it comes to taking Portrait Mode shots, since you can opt for a bokeh-style shot with a tighter zoom through the telephoto lens or one that takes in more of the scene with the wide-angle lens.\n\nThe iPhone 11 Pro’s screen is also brighter than the 11’s and offers better contrast and deeper blacks, but you probably wouldn’t notice that enough to let it significantly affect your buying decision.\n\nThe iPhone 11, given the fact that it shares many of the features of the Pro at a much lower price, is probably the right choice for most people. But camera professionals who need the flexibility of shooting with three lenses instead of two might be more interested in the Pro.\n\nTaken together, the updates in the iPhone 11 and the iPhone 11 Pro also say a lot about the state of the smartphone industry. That Apple is positioning its lower-cost iPhone 11 as its flagship model this year shows that it learned an important lesson from last year’s iPhone XS and XR launches – many people don’t want to pay $1,000 or more for a new smartphone.\n\nThe fact that Apple is catering toward professional photographers and videographers with its new iPhones is also notable. It suggests that in an era in which people are holding onto their smartphones longer than before, the company is looking to niche audiences – not just general buyers – to encourage upgrades.", "description": "Business Insider - Apple's iPhone 11 and iPhone 11 Pro are launching on Friday. Here's a closer look at what it's like to use them.. Read more at businessinsider.my", "authors": ["Lisa Eadicicco", "Business Insider Us"], "top_image": "https://static.businessinsider.my/sites/3/2019/09/5d8157ce2e22af60a35cb319.jpg", "published_at": "2019-09-20"}