{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/asia_pacific/hong-kongs-domestic-workers-feel-caught-between-both-sides-in-information-war/2019/10/22/2f15fb1c-ea0a-11e9-a329-7378fbfa1b63_story.html", "downloaded_at": "2019-10-23 10:29:30.440875+00:00", "title": "Hong Kong's domestic workers feel caught between both sides in ‘information war’", "language": "en", "text": "The reward for being an informant: $25,500 to $127,500, a staggering sum for a domestic worker whose legal minimum wage is $590 a month.\n\nIt’s not certain whether the tips-for-money offer was genuine or simply a new type of anti-protester screed. This much is clear: The bitter information wars in Hong Kong keep taking new turns since pro-democracy demonstrators took to the streets in June.\n\nAD\n\nAD\n\nThis time it is Hong Kong’s domestic workers being drawn into the political tensions. The leaflets, which first appeared last month, did not specifically call out domestic workers, With writing in Bahasa, their target was evident.\n\nThe fliers — whether real or not — have accomplished at least some disruptions and indicate an intent to sow distrust and paranoia among Hong Kongers.\n\nSuddenly, domestic workers feel under more scrutiny. Meanwhile, their employers — mainly expatriate workers and well-off Hong Kong families — are left wondering whether they might be watched in their own homes.\n\n'Information war'\n\n“Information war is a psychological warfare. Divide and conquer is a proven strategy,” said Masato Kajimoto, a disinformation expert and assistant professor at the University of Hong Kong’s Journalism and Media Studies Center. “It is hard to go on protesting if one cannot trust the people who live with him or her at home.”\n\nAD\n\nAD\n\nHong Kong’s nearly 400,000 domestic workers — about half from Indonesia — have largely been on the sidelines in the unrest. The community has come into sharper focus since police shot an Indonesian journalist, Veby Mega Indah, with a projectile on Sept. 29, blinding her right eye.\n\nHong Kong’s Muslim community — which includes many from Indonesia — also came into focus on Sunday after a police water cannon sprayed the entrance of the city’s largest mosque with blue-dye while clearing an anti-government protest. Hong Kong’s leader Carrie Lam visited the mosque on Monday to apologize.\n\nTargeting domestic helpers as potential informants carries an eerie resonance with China’s Cultural Revolution, a decade of political upheaval that began in the mid-1960s and included public denunciations of those considered at odds with the state.\n\nAD\n\nAD\n\nIt also highlights one of the central fears of protesters: that China will systematically erode the freedoms granted to Hong Kong under the “one country, two systems” policy promised when Beijing took control of the former British colony in 1997.\n\n“Cultural Revolution again! For consideration of safety, please don’t let your domestic helper know if you participate in the protest or not!” said one Facebook message about the fliers. The post had more than 1,200 shares.\n\nNuraini Hasan, 27, a domestic worker from Indonesia’s Lombok island, called the leaflet dangerous. She also said he believed it was fake, intended only to ripple fear through communities of domestic workers in Hong Kong led by Indonesians and Filipinos.\n\nAD\n\n“We Indonesians don’t believe this,” Hasan said.\n\n'Throwing a bunch of seeds'\n\nThe flier’s architect remains unknown. It lists a website, 803.hk, with a domain registered under the name of Leung Chun-ying, a former leader of Hong Kong who is considered supportive of Beijing.\n\nThe site was launched after protesters threw a Chinese flag into Hong Kong’s harbor on Aug. 3 and offers rewards for information. Leung advertised the site multiple times on his Facebook page. In another post, he called on “drivers, maids, fast-food store staff, convenience store staff” to be whistleblowers.\n\nThe hotline linked to 803.hk did not return messages for comment left by The Washington Post. Leung’s office did not reply to requests for comment.\n\nAD\n\nAD\n\nThe challenge in quashing dissent in Hong Kong is pinpointing it.\n\nWith all protest activity orchestrated anonymously online, the movement is largely leaderless. This leaves pro-government groups without an “obvious place to look” for targets, said Jeffrey Wasserstrom, a historian of modern China at the University of California at Irvine.\n\n“The power of that means it’s much harder to break the back of the movement,” Wasserstrom said. “But from the side of oppression, it seems to have led to the idea of using any means to find who’s participating.”\n\nPuja Kapai, a law professor at the University of Hong Kong and expert on minority rights, called the fliers “a call to essentially participate in covert spying activities.”\n\nAD\n\n“Maybe [the creators of the flier] are just throwing a bunch of seeds out there to see which one shows the sign of blossoming,” said Kajimoto, the disinformation expert.\n\nAD\n\nSkepticism\n\nAside from the brief social media frenzy, the flier’s sloppy translation and sketchy presentation failed to woo domestic workers.\n\nAmong dozens of Indonesian migrant workers approached by The Post, few recognized the leaflet. Those who did called it fake and said they would never jeopardize their job. By and large, indifference was the prevailing sentiment.\n\nHong Kong is home to more than 174,000 Indonesians, 95 percent of whom are domestic workers, according to 2018 immigration figures provided by Hong Kong’s Indonesian Consulate.\n\nAD\n\n“Some Facebook posts are not real. I don’t care about that,” said an Indonesian domestic worker, Rina, 33, when shown the flier.\n\n“I come here just as a domestic helper. I just want to work,” said Rina, who asked that only her first name be used to avoid potential problems with authorities.\n\nAD\n\nIn August, Facebook, Twitter and YouTube identified more than 200,000 China-based accounts linked to what Twitter described as a “significant state-backed information operation … deliberately and specifically attempting to sow political discord in Hong Kong.”\n\nHong Kong’s Indonesian Consulate also had no information pertaining to the flier, calling it “quite unprecedented.”\n\nAD\n\n“During this social and political crisis in Hong Kong, we have encountered a lot of unconfirmed or even false information … that are circulated among Indonesians living in Hong Kong,” Erwin M. Akbar, consul for Consular Affairs, wrote in a statement to The Post. “Our effort in the Consulate is focused on ensuring that the Indonesian Migrant Workers are not involved in the current situation in Hong Kong.” This includes not sharing any views on social media.\n\nAD\n\n“Some care, some don’t know,” said Hasan, the worker from Lombok, “We don’t want to be very close, but need to know what is [happening]. This our workplace.”\n\nShibani Mahtani and Tiffany Liang contributed to this report.", "description": "A mysterious flier aimed at Indonesian workers called for information on “radical protesters.”", "authors": ["Casey Quackenbush"], "top_image": "https://www.washingtonpost.com/resizer/VbCfTnqVKeiWhmJNIU_hzJhlgEQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/HOI5GQHSQII6TNSIO26PQ3VWPY.jpg", "published_at": "2019-10-22"}