{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7566419/Video-footage-emerges-orgy-aboard-yacht-involving-Hungary-PM-Viktor-Orbans-political-ally.html", "downloaded_at": "2019-10-13 00:33:24.171034+00:00", "title": "Video footage emerges of an orgy aboard a yacht involving Hungary PM Viktor Orban's political ally", "language": "en", "text": "Footage has emerged of a Hungarian mayor engaging in sex acts with a bevy of prostitutes during an orgy on a yacht.\n\nZsolt Borkai, a 54-year-old married father-of-two, has become embroiled in a sex scandal just days before Hungary's election after footage of the allegedly cocaine-fuelled party appeared on porn websites.\n\nThe mayor of the Hungarian city of Gyor is an ally of the country's Prime Minister, Victor Orban, and has refused to resign from his role.\n\nOrban's chief of staff called the release of the sex videos the 'low point of Hungarian political life'.\n\nZsolt Borkai, a 54-year-old married father-of-two, has become embroiled in a sex scandal just days before Hungary's election\n\nThe mayor of the Hungarian city of Gyor is an ally of the country's Prime Minister, Victor Orban, and has refused to resign from his role\n\nAnd another sex video was leaked featured an opposing politician, Tamas Wittinghoff, the mayor of a town near Budapest.\n\nBoth men said they had apologised to their families but had no plans to abandon their candidacies.\n\nBorkai was allegedly accompanied by a male friend, Zoltan Rakosfalvy, and a number of prostitutes on a yacht trip around the Adriatic Sea off the coast of Dubrovnik.\n\nReports also said that two videos, which reportedly appeared on the world's largest adult site, Pornhub, have since been taken down.\n\nViktor Orban's (left) eight-year rule over Hungary has come under threat since the release of Borkai's (right) orgy\n\nHowever, the footage has since leaked onto other pornographic sites.\n\nBorkai initially denied his involvement and accused the opposition of planting the footage but has since issued an apology and admitted to taking part in the orgy.\n\nAt first the right-wing politician said: 'I consider the lies published about me to be part of an opposition campaign aimed to divert attention away from their own incompetence.'\n\nHungarians will be choosing over 3,100 mayors and 16,000 councillors nationwide in tomorrow's vote, which is expected to have serious consequences ahead of a parliamentary election in 2022.\n\nOrban's chief of staff called the release of the sex videos the 'low point of Hungarian political life'\n\nBorkai was allegedly accompanied by a male friend, Zoltan Rakosfalvy, and a number of prostitutes on a yacht trip around the Adriatic Sea off the coast of Dubrovnik\n\nHungarians will be choosing over 3,100 mayors and 16,000 councillors nationwide in tomorrow's vote, which is expected to have serious consequences ahead of a parliamentary election in 2022\n\nAnd the opposition party, Momentum, seized the opportunity to win voters over by putting up posters saying 'public funds, cocaine, whores', to contrast with the ruling party's slogan of 'God, nation, family'.\n\nHungary's ruling elite usually manage to drown scandals involving the ruling party but the sex tape slipped through the net.\n\nEven if the opposition party manages to make big gains in the election, it will still be an uphill battle to overtake Orban.\n\nOrban, who has been in power for eight years, counts on the EU's economic growth, surging wages and propaganda to keep him in power.\n\nAnd he has pledged to financially punish cities if they switch political allegiances.", "description": "Zsolt Borkai, a 54-year-old married father-of-two, has become embroiled in a sex scandal just days before Hungary's election after footage of the allegedly cocaine-fuelled party appeared on porn sites.", "authors": ["Isabella Nikolic For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/19/19633364-0-image-a-25_1570906041182.jpg", "published_at": "2019-10-12"}