{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/16/cardi-b-bernie-sanders-supporter-says-trump-will-b", "downloaded_at": "2019-10-16 20:55:20.842619+00:00", "title": "Sanders-supporting rapper Cardi B says 'Trump will be' reelected", "language": "en", "text": "Rapper Cardi B, who endorsed Sen. Bernard Sanders in both his 2016 and 2020 presidential campaigns, said Tuesday that she thinks President Trump will win reelection.\n\nCardi B spoke with fellow rappers T.I. and Chance the Rapper for T.I.’s “expediTIously” podcast when she and Chance agreed the 2020 election was looking bleak for Democrats.\n\n“You all can quote me on this a couple of years down the line,” Chance said, The Hill reported. “I think Trump is going to win again at the next election because he’s got the biggest base.”\n\n“He is,” Cardi B said. “I believe it.”\n\n“I really hate to say it, but sometimes I do believe that Trump will be winning,” she continued. “Just because due to the fact that every single time I don’t see nobody saying that they love a Democratic candidate. There’s no candidate that people are saying like, ‘We love [them], we want them to win.’”\n\nCardi B complained that people vote with their “feelings,” which she said are based on racism and religion and not about which candidate puts forth the best ideas.\n\n“Every single time he always talk about how he want to take away Medicare and [expletive] like that,” she said. “A poor white man that’s getting Medicare is not even caring that he’s saying that, he just cares that he hates Mexicans and he want to get rid of them.\n\n“A lot of people vote with feelings in America and a lot of their feelings is racism and religion,” she added.\n\nDespite her prediction, Cardi B is sticking with Mr. Sanders because he cares for all Americans and not just white people, she said.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Rapper Cardi B, who endorsed Sen. Bernie Sanders in both his 2016 and 2020 presidential campaigns, said Tuesday that she thinks President Trump will win reelection.", "authors": ["The Washington Times Http", "Jessica Chasmar"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/03/28/people_cardi_b_68020_c0-11-3430-2011_s1200x700.jpg?d6868fab03613f9dfe09d37bcd6484ff6944f0c0", "published_at": "2019-10-16"}