{"pub": "dailymail", "url": "https://dailymail.co.uk/money/experts/article-7563431/Dad-passed-away-South-Africa-partner-inheritance-do.html", "downloaded_at": "2019-10-18 07:06:48.250066+00:00", "title": "Dad passed away in South Africa and his partner has made off with the inheritance - what can we do?", "language": "en", "text": "My partner's father moved to South Africa from Britain in the late 1970s, leaving behind a wife and three children.\n\nHis wife later divorced him for abandonment. She passed away several years ago.\n\nMy partner and his brothers had re-established links with their dad, went out to visit and kept in touch by telephone.\n\nDad was living in a property he had purchased, but had a partner (not married) that lived with him. He had a car and other assets. He had no other children in South Africa or elsewhere.\n\nAs a former British colony, South Africa's legal system is similar to the United Kingdom's. But if you have inherited money or property in the country it's best to get a local lawyer to help you\n\nHe passed away two years ago – the UK family found out after the funeral had taken place. Any attempt to make contact with his partner have been ignored – the phone line is disconnected.\n\nHe always said that his estate would go to his three sons – but I understand the laws may be different in South Africa. How do we find out whether there are any assets due to his (adult) children?\n\nAngelique Ruzicka of This is Money replies: You're right to feel suspicious about the way in which this has all been handled.\n\nIt's worth pointing out that the dad may have course told his sons that his estate would be divided up that way, but he could have been telling a different story to his girlfriend.\n\nNicolette Koch says that if the deceased had a valid will, the estate will be wound up in terms of the will (testament) and his wishes\n\nThe good news is that as South Africa was a former British colony the laws are relatively similar.\n\nIt's important to firstly establish if he left a will.\n\nNicolette Koch, partner at law firm Adams and Adams says: 'If the deceased had a will, the estate will be wound up in terms of the will (testament) and the wishes of the deceased - if it was a valid will.'\n\nAccording to Janine Bredenkamp, an attorney at J.B.Inc who has administered estates for over 25 years, if he died without a will then South Africa's Intestate Succession Act 81 of 1987, would apply.\n\nSection 1 [1] [b] states that: 'If after the commencement of this Act a person dies intestate, either wholly or in part, and is survived by a descendant, but not by a spouse, such descendant shall inherit the intestate.'\n\nBredenkamp says: 'This means that the children inherit the estate.'\n\nHow can I find out about the property and other assets?\n\nIn order to get more information on the inheritance, your partner and his siblings would have to do some detective work and research.\n\nBredenkamp explains: 'The matter of tracking down the assets and finding out what is happening to the estate is a little more complicated.\n\n'We would have to have the deceased's identity number, birth date or date of death.\n\n'This would enable us to conduct a search at the Masters Office to see if the estate has been reported and who the executor is.\n\n'It will enable us to do property searches to see what properties are or were registered in his name.\n\n'We would also be able to do checks with companies such as Verify.'\n\nIf you already have this information available to you and you have someone you trust that can check this information for you and is based in South Africa then you can get this information from the Deeds Office directly.\n\nThe Deeds Office is responsible for the registration, management and maintenance of the property registry of South Africa.\n\nIt is possible to get some information remotely with regard to the property he lived in.\n\nProperty listing site Property24.com allows you to get a report on properties and these will include details such as: transfer history, buyer's and seller's details, bond information and a property valuation.\n\nWhat if his partner made of with or sold the assets?\n\nTwo years has transpired since the death of your partner's father and it is entirely possible for his girlfriend to have, in this time, sold off all or some of the assets.\n\nBut Willie Fourie, head of estate and trust advisory services at PSG Wealth says she would still have to comply with the provisions of the Intestate Succession Act or it would amount to a criminal offense and she could be liable for fraud.\n\nWillie Fourie of PSG Wealth says that the children of the estate could sue the father's partner for fraud if she has sold any of the assets and filed incorrect information with the Master's Office.\n\nHe says: 'A search of the records of the deeds office in South Africa will show whether the deceased's immovable property is still registered in his name or not. If it was transferred the records will state to whom and when it was transferred.\n\n'The same will apply to the motor vehicle and other assets.\n\n'This information would also have to be included in the Liquidation & Distribution account that the executor has to file with the Master's Office to account for the assets of the deceased and proof of the transfer of these assets to the heirs of the deceased.'\n\nShe may have even been able to apply to be the executor of the estate in the interim but would only have been able to do so at the discretion of the Masters Office.\n\nIn South Africa, an executor of an estate can charge a fee of 3.5 per cent of the value of the estate and 6 per cent of interested earned after the death.\n\nShe may be legally entitled to a portion of the estate. Veldhuizen explains: 'This would only be if she can show that she was in some kind of universal partnership where she contributed to the household, e.g. paid the bond or bought the groceries. But this is difficult to prove.'\n\nIf think you do need to find an attorney to represent your partner and his sibling's affairs in South Africa, it's best to contact the Law Society of South Africa to get an accredited specialist that can help.", "description": "My partner's father died in South Africa and his girlfriend has cut all ties with us after the funeral. We think she may have made of with the inheritance - what can we do?", "authors": ["Angelique Ruzicka For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/15/19593570-0-image-a-7_1570805882937.jpg", "published_at": "2019-10-18"}