{"pub": "realclearpolitics", "url": "https://thefederalist.com/2019/09/05/devin-nunes-sues-fusion-gps-over-false-media-smears-and-bogus-ethics-claims", "downloaded_at": "2019-09-06 12:07:04.827283+00:00", "title": "Devin Nunes Sues Fusion GPS Over Smears And Bogus Ethics Claims", "language": "en", "text": "The former chairman of the House Intelligence Committee sued Fusion GPS and its founder in a sweeping suit alleging conspiracy to obstruct investigations into Russian interference in the 2016 election.\n\nIn the suit, Rep. Devin Nunes, R-Calif., alleges Fusion GPS worked directly with a tax-exempt organization to intimidate and harass him over his investigation into Russian meddling in the 2016 election. That organization, Campaign for Accountability, filed bogus ethics complaints with the Office of Congressional Ethics to sideline Nunes as he investigated Fusion GPS’s role in the false claims that President Donald Trump treasonously colluded with Russia to steal the 2016 election from Hillary Clinton.\n\nFusion GPS, which hired Christopher Steele to smear Trump with a dossier of unsubstantiated allegations, previously worked on behalf of Russian interests to thwart U.S. sanctions against the regime of Vladimir Putin and its wealthiest backers. Steele, the former foreign spy tapped by Fusion GPS to develop the claims that launched a years-long investigation against Trump and his supporters, similarly worked for sanctioned Russian oligarch Oleg Deripaska.\n\nIn the complaint, Nunes specifically alleges that Campaign for Accountability funneled $140,000 to Fusion GPS in 2018 for unspecified “research.” Campaign for America, a tax-exempt organization that claims to be non-partisan but is known for targeting conservative Republicans, received $1.3 million in contributions and grants last year. The group does not identify its donors, although Nunes says one of them is the left-wing New Venture Fund.\n\nThrough dogged efforts, Nunes discovered the secret funders of the dossier in 2016 were the Hillary Clinton campaign and the Democratic National Committee, information that Fusion GPS desperately sought to conceal. The money for the anti-Trump operation that spawned unprecedented surveillance of the Trump campaign, and eventually a sprawling, multi-year special counsel probe that uncovered no collusion, was funneled through Perkins Coie, a Democrat-connected law firm.\n\nThe anti-Trump operation, including the Russia collusion portion, was later taken over by the Democracy Integrity Project, an organization run by a former staffer to Sen. Dianne Feinstein, D-Calif., named Dan Jones. Jones told federal investigators that he was spearheading a $50 million campaign against Trump, centering around false allegations of treasonous collusion with Russia.\n\nFusion GPS and connected groups received $3.8 million from Democracy Integrity Project, the complaint alleges. More than $3 million went to Fusion GPS, with smaller amounts paid to Walsingham Partners Ltd., Steele’s London-based firm, Edward Austin, Ltd., a London consultancy operated by a Fusion GPS contractor, and Zuckerman Spaeder, the law firm that represents Fusion GPS on dossier-related legal matters.\n\n“Fusion GPS, [founder Glenn] Simpson and Steele fraudulently developed the ‘Steele Dossier’ and disseminated it to U.S. Government officials and the press as if the salacious accusations were true. Plaintiff investigated this wrongdoing, causing Fusion GPS and Simpson to retaliate against him and to take action that was intended to harass, intimidate and influence Plaintiff in the performance of his congressional investigation,” the complaint concludes, adding, “Defendants’ corrupt acts of racketeering are part of their regular way of doing business. That way of doing business must end here and now.”\n\nNunes seeks $9.9 million in damages.", "description": "Rep. Devin Nunes alleges Fusion GPS worked to intimidate and harass him over his investigation into Russian meddling in the 2016 election.", "authors": ["Mollie Hemingway"], "top_image": "https://thefederalist.com/wp-content/uploads/2019/09/38736707490_896fad6ca2_k.jpg", "published_at": "2019-09-05"}