{"pub": "independent", "url": "https://independent.co.uk/sport/rugby/rugby-union/international/david-pocock-retires-australia-rugby-world-cup-2019-japan-a9094211.html", "downloaded_at": "2019-09-07 02:38:22.307378+00:00", "title": "Australia back row David Pocock announces he will retire from international rugby after the 2019 Rugby World Cup", "language": "en", "text": "Australia back row David Pocock has announced that he will retire from international rugby at the conclusion of the 2019 Rugby World Cup in Japan.\n\nPocock, 31, has made nearly 80 appearances for the Wallabies despite a number of injuries and a sabbatical in 2017.\n\nPocock will captain Australia in his final game on home soil against Samoa this weekend.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“I guess on a personal note, it adds a bit,” he said.\n\n“You reflect on the time you’ve had in the Wallabies jersey, what you’ve tried to add, the legacy you hope you’ll leave and then just the opportunity to play in front of family and friends one last time. We know that without a good team performance, it won’t be as special.”\n\nShape Created with Sketch. Rugby World Cup 2019 kits Show all 22 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Rugby World Cup 2019 kits 1/22 Australia Home 2/22 Australia Alternative 3/22 England Home 4/22 England Alternative 5/22 Fiji Home 6/22 Fiji Alternative 7/22 France Home 8/22 France Alternative 9/22 Ireland Home 10/22 Ireland Alternative 11/22 Japan Home 12/22 Japan Alternative 13/22 New Zealand Home 14/22 New Zealand Alternative 15/22 Samoa Home 16/22 Samoa Alternative 17/22 Scotland Home 18/22 Scotland Alternative 19/22 South Africa Home 20/22 South Africa Alternative 21/22 Wales Home 22/22 Wales Alternative 1/22 Australia Home 2/22 Australia Alternative 3/22 England Home 4/22 England Alternative 5/22 Fiji Home 6/22 Fiji Alternative 7/22 France Home 8/22 France Alternative 9/22 Ireland Home 10/22 Ireland Alternative 11/22 Japan Home 12/22 Japan Alternative 13/22 New Zealand Home 14/22 New Zealand Alternative 15/22 Samoa Home 16/22 Samoa Alternative 17/22 Scotland Home 18/22 Scotland Alternative 19/22 South Africa Home 20/22 South Africa Alternative 21/22 Wales Home 22/22 Wales Alternative\n\nOne of the game’s arch kleptomaniacs, Pocock has been a fine breakdown operator since the beginning of his career. Tough in the tackle and limpet-like over the ball, Pocock excelled in the 2011 World Cup as Australia reached the semi-final, and his partnership with Michael Hooper was fundamental to the Wallabies’ progress to the 2015 World Cup final. The pair look set to be reunited at seven and eight in Japan.\n\nSocially conscious, the Zimbabwe-born back row has raised awareness of environmental issues and campaigned against homophobia and for marriage equality, with Pocock and partner Emma Palandri delaying their legal marriage until the latter was granted in Australia.\n\nPocock will leave the game earlier than some, but his stealing style has placed great strain on his body, with a number of serious knee problems and other injuries disrupting his career. Indeed, this weekend’s game with Samoa will be his first since 8 March after a reoccurrence of a calf issue.\n\nAnd while he leaves a sizeable hole in Australia’s back row, Pocock thinks there are a good group of potential successors.\n\n“I think looking at the flankers coming through, I think we’re in good hands and that’s exciting for Australian rugby,”\n\nScrum-half Will Genia, hooker Tatafu Polota-Nau and prop Sekope Kepu have also announced they will retire once World Cup business is concluded.\n\n“I feel like I’ve put a lot into it, I’ve really enjoyed it, benefited a huge amount,” Pocock concluded.\n\n“As an immigrant to Australia, rugby has provided me with somewhere to make friends, to feel like I belong and obviously gone on to get huge opportunities playing professional rugby.”", "description": "Australia back row David Pocock has announced that he will retire from international rugby at the conclusion of the 2019 Rugby World Cup in Japan. Pocock, 31, has made nearly 80 appearances for the Wallabies despite a number of injuries and a sabbatical in 2017. Pocock will captain Australia in his final game on home soil against Samoa this weekend. “I guess on a personal", "authors": ["Harry Latham-Coyle"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/05/28/10/david-pocock-0.jpg", "published_at": "2019-09-06"}