{"pub": "foxnews", "url": "https://foxnews.com/politics/north-carolina-state-judges-throw-out-districts-drawn-for-gop-advantage", "downloaded_at": "2019-09-03 23:38:33.934808+00:00", "title": "North Carolina judges throw out districts drawn for GOP advantage", "language": "en", "published_at": "2019-09-03", "text": "Just over a month after the Supreme Court effectively punted the partisan fight over gerrymandering to state courts, a North Carolina trial court has rejected state legislative district maps, saying lawmakers took extreme advantage to help elect a maximum number of Republicans.\n\nThe three-judge panel of state judges unanimously ruled Tuesday that courts can step in to decide when partisan advantage goes so far that it diminishes democracy. The judges gave lawmakers two weeks to try again.\n\n\"Partisan intent predominated over all other redistricting criteria resulting in extreme partisan gerrymandered legislative maps,\" the judges wrote in their ruling. \"The effect of these carefully crafted partisan maps is that, in all but the most unusual election scenarios, the Republican Party will control a majority of both chambers of the General Assembly. In other words, the Court finds that in many election environments, it is the carefully crafted maps, and not the will of the voters, that dictate the election outcomes in a significant number of legislative districts and, ultimately, the majority control of the General Assembly.\"\n\nLawyers for North Carolina Republican legislators had argued there was no clear way for judges to know what kinds of map-making is unacceptable, since \"redistricting is political because of what it is, not because of who does it.\" Any complaints about how districts were drawn would vanish if Democrats could lead some GOP voters to change their minds and voted with them, GOP lawyers said.\n\nNevertheless, the state judges specifically found that the way the majority-Republican General Assembly redrew legislative district maps in 2017 violated the rights of Democratic voters under the state constitution's equal protection and freedom of assembly clauses.\n\n\"The court declares that the 2017 House and Senate plans are unconstitutional and invalid because there is no reasonable doubt each plan violates the rights of plaintiffs and other Democratic voters under the North Carolina Constitution's Equal Protection Clause ... the Free Elections Clause ... and the Freedom of Speech and Freedom of Assembly Clauses,\" the judges wrote.\n\nThe court said it would \"afford the General Assembly two weeks from the date of this order, namely through Sept. 18, 2019, to enact remedial maps for the House and Senate legislative districts for the 2020 election.\"\n\nSUPREME COURT RULES GERRYMANDER QUESTIONS ARE BEYOND THE SCOPE OF FEDERAL COURTS\n\nThe criteria for drawing the new districts, the judges said, should include contiguity (\"Legislative districts shall be comprised of contiguous territory. Contiguity by water is sufficient.\"); \"Equal Population\"; \"County Groupings and Traversals\"; \"Compactness\"; \"Fewer Split Precincts\"; \"Municipal Boundaries\"; \"Incumbency Protections\" (so that incumbents are not unduly positioned in the \"same election district\"); and \"Election Data\" (\"Partisan considerations and election results data shall not be used in the drawing\" of districts).\n\nUsing 2010 federal census data, the judges said, districts should \"comply with the +/- 5 percent population deviation standard\" from district to district, as established under previous North Carolina case law.\n\nRepublican North Carolina Senate Leader Phil Berger told Fox News in a statement that he would accept the ruling, even though he characterized it as legally incorrect.\n\n\"It is not the free will of the People that is fairly ascertained through extreme partisan gerrymandering.\" — North Carolina 3-judge panel, in a unanimous opinion\n\n\"This case is the next step in Eric Holder’s drive to use judges to create a Democratic majority,\" Berger said, referring to Holder's role as chair of the National Democratic Redistricting Committee. \"Thwarted at the U.S. Supreme Court, Holder has turned to state courts with Democratic majorities to, in his own words, 'favorably position Democrats' to game the redistricting process.\"\n\nBerger continued: \"We disagree with the court’s ruling as it contradicts the Constitution and binding legal precedent, but we intend to respect the court's decision and finally put this divisive battle behind us. Nearly a decade of relentless litigation has strained the legitimacy of this state’s institutions, and the relationship between its leaders, to the breaking point. It’s time to move on. To end this matter once and for all, we will follow the court’s instruction and move forward with adoption of a nonpartisan map.\"\n\nRedistricting is the process of redrawing voting districts for state legislatures and Congress after every decennial census. Gerrymandering describes when the redistricting is slanted to give one political party a majority in as many districts as possible. North Carolina's legislative districts were redrawn in 2017 after a federal court determined they were an illegal gerrymander that sought to weaken the voting strength of minority voters.\n\nBut the group Common Cause and more than 30 registered Democratic voters sued over the legislative maps, saying the districts were still so gerrymandered they unconstitutionally insulated Republicans from changes in voting behavior.\n\nCommon Cause and other plaintiffs had asked the court to order half the House districts and 21 of 50 Senate maps redrawn quickly.\n\nAn appeal is expected and the outcome could be months away. The state Supreme Court's composition is 6-1 in favor of Democrats.\n\nEvidence introduced during the two-week trial in July included computer records created by Tom Hofeller, a now-dead GOP redistricting guru who helped draw the 2017 legislative maps. Those files, collected by Hofeller's estranged daughter after his death and shared with Common Cause, showed that Republican advantage was the overall objective of the latest redistricting.\n\nSome of Hofeller's files were also used in separate litigation in New York challenging a plan by President Donald Trump's administration to include a citizenship question on the 2020 U.S. census.\n\nThe 2017 maps \"do not permit voters to freely choose their representative, but rather representatives are choosing voters based upon sophisticated partisan sorting. It is not the free will of the People that is fairly ascertained through extreme partisan gerrymandering. Rather, it is the carefully crafted will of the map drawer that predominates,\" the judges ruled.\n\nThe North Carolina lawsuit marks at least the eighth legal action challenging state election district maps since the current round of redistricting began in 2011. The lawsuits resulted in redrawing congressional lines in 2016 and legislative districts in 2017 — both to address racial bias.\n\nIn June, the U.S. Supreme Court, in a 5-4 ruling, said federal judges have no role in policing partisan redistricting, effectively removing the courts from the process and leaving controversial congressional maps in North Carolina and Maryland in place.\n\nThe opinion on gerrymandering, authored by Chief Justice John Roberts, stated that federal courts do not have jurisdiction to rule on political questions such as this. It is up to lawmakers to deal with such issues, the court said.\n\nThe Supreme Court ruling left the door open for state courts to rule on issues that come up with state rules.\n\nCLICK HERE FOR THE FOX NEWS APP\n\nRedistricting fights have rocked the country in recent weeks. In August, the Michigan Republican Party sued to block the formation of a commission to draw congressional and legislative lines in 2021, saying the voter-approved change is unconstitutional because there will be no reliable way to verify the panel's political makeup.\n\nThe federal lawsuit, the second filed by Republicans in less than a month, seeks an injunction against Democratic Secretary of State Jocelyn Benson, whose office is implementing the law.\n\nCongressional districts will eventually be redrawn, following the results of the 2020 census, which itself is the subject of another high-profile case centered on whether the Trump administration can include a question that asks whether people are U.S. citizens.\n\nFox News' Ronn Blitzer, Bill Mears, and The Associated Press contributed to this report.", "description": "Just more than a month after the Supreme Court effectively punted the partisan fight over gerrymandering to state courts, a North Carolina trial court has rejected state legislative district maps, saying lawmakers took extreme advantage from drawing districts to help elect a maximum number of Republicans.", "authors": ["Gregg Re", "North Carolina Panel", "In A Unanimous Opinion", "Gregg Re Is A Lawyer", "Editor Based In Los Angeles. Follow Him On Twitter"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/06/27/694940094001_6053197744001_6053209413001-vs.jpg"}