{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/20/uk-to-repatriate-isis-children-in-syria", "downloaded_at": "2019-10-20 06:52:40.469533+00:00", "title": "Britain makes move to bring home Isis children stranded in Syria", "language": "en", "text": "British officials have taken the first steps to repatriate children stranded in Syria by liaising directly with agencies on the ground to identify unaccompanied minors for “safe passage” back to the UK.\n\nWhitehall sources have confirmed they are working with “various agencies” in north-east Syria – believed to include the International Committee of the Red Cross – to kickstart the process of transferring children of British parents linked to Islamic State back to the UK.\n\nAmong the first cases identified are three orphans, believed to have travelled to Syria with their parents from London five years ago and who are currently in Raqqa, under the control of the Kurdish-dominated militia, the Syrian Democratic Forces.\n\nTransporting the children to Iraq, where they can be flown from the city of Erbil to the UK, has been evaluated by Kurdish officials and British charities as both quick and safe, especially during the five-day ceasefire.\n\nThe development comes before an appeal this week by Shamima Begum against the removal of her UK citizenship by the former home secretary Sajid Javid. Begum, then aged 15, travelled to Syria in 2015 to join Isis from her east London home.\n\nLawyers for Begum, currently in al-Roj refugee camp in north-east Syria, will argue the decision was “unlawful”. The four-day hearing will take place at the Special Immigration Appeals Commission, a specialist court that hears challenges to decisions to remove someone’s British citizenship on national security grounds.\n\nOn Friday it emerged that Belgium and other European states were preparing to repatriate citizens accused of having Isis links from north-east Syria, taking advantage of the ceasefire.\n\nElsewhere Save the Children, among a handful of charities operating in the country’s north-east, confirmed that the region’s major refugee camps, al-Roj and al-Hol, where there are an estimated 30 unaccompanied British children, remain unaffected by fighting following the Turkish invasion this month.\n\nA spokesperson said that transferring British minors from Syria to the UK was currently relatively straightforward. “While things are evolving rapidly, our latest information is that transportation out of the area is possible and border crossings between Syria and Iraq remain open,” they said. The Kurdish administration is described as “extremely supportive” in facilitating future repatriations, as long as they are negotiated with UK government officials.\n\nUntil last week the UK government’s position towards repatriating British children was that it remained too dangerous for officials to attempt a rescue. However, following Turkey’s invasion of the north of Syria, the foreign secretary, Dominic Raab, hinted at a policy change, suggesting British orphans and unaccompanied minors could be returned to the UK.\n\nThe Foreign Office said: “We are looking at orphans and unaccompanied minors who bear UK nationality and whether they can be provided safe passage to return to the UK. We will examine every single case where we are asked for consular assistance, but this process is far from straightforward.”\n\nSave the Children added: “This looks like a step in the right direction but for this to translate into a real change of policy we need to know that government is working on how to bring all British children to the UK while we still can.”\n\nAs well as Belgium it is understood that France and Germany are currently examining how to exploit the ceasefire announced by US vice-president Mike Pence on Thursday to repatriate women and children.", "description": "Whitehall sources are working with local agencies to bring back minors born to Islamic State fighters", "authors": ["Mark Townsend"], "top_image": "https://i.guim.co.uk/img/media/0bc8050d19de84d4b5837b1cff0614399c458060/0_1084_4274_2564/master/4274.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=48af43f59773ed10ab35d41ab8816a8c", "published_at": "2019-10-20"}