{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/22/ballon-dor-organizer-explains-why-neymar-was-left-", "downloaded_at": "2019-10-22 13:32:32.682059+00:00", "title": "Ballon d'Or organizer explains why Neymar was left off list", "language": "en", "text": "PARIS (AP) - Too many injuries. A Champions League ban for insulting match officials. Hitting a fan after losing the French Cup final. Agitating for a transfer from Paris Saint-Germain.\n\nNeymar’s absence from the list of 30 Ballon d’Or candidates was explained Tuesday by France Football magazine which organizes the prestigious award.\n\nThe magazine said events in what it called Neymar’s “année noire” (black year) justified his failure to be nominated for the first time since 2010.\n\nOn the field, Neymar was injured and missed many key games, including Brazil’s Copa America title run and PSG’s Champions League Round of 16 exit against Manchester United.\n\nNeymar was suspended for PSG’s first two Champions League group-stage games this season for insulting the match officials who gave Man United a decisive stoppage-time penalty.\n\nThe Paris-based magazine also criticized the “summer soap opera” of Neymar’s failed attempts to force a move from PSG back to his former club Barcelona.\n\nNeymar has never won the Ballon d’Or. He was third in 2015 and 2017.\n\n___\n\nMore AP soccer: https://apnews.com/Soccer and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Too many injuries. A Champions League ban for insulting match officials. Hitting a fan after losing the French Cup final. Agitating for a transfer from Paris Saint-Germain.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/13/singapore_brazil_nigeria_soccer_92391_c0-45-1080-675_s1200x700.jpg?01524f11dd32fb44d61b076d415546f66a2d3d0a", "published_at": "2019-10-22"}