{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/29/trent-williams-ends-holdout-after-not-being-traded", "downloaded_at": "2019-10-30 00:05:19.878811+00:00", "title": "Trent Williams ends holdout after not being traded: report", "language": "en", "text": "After not being traded before the NFL trade deadline, the Redskins left tackle reported to the team’s facility Tuesday — ending his months-long absence from the team. The seven-time Pro Bowler was upset with the Redskins over his contract and the team’s medical staff’s handling of a benign tumor on his scalp, vowing to never play for Washington again.\n\nWilliams, though, likely returned so he can be credited with a year toward free agency. The 31-year-old has two years left on his contract, and if he had skipped the entire season, his contract would have carried over for another season. He will get an accrued season if he is on the roster for six-or-more regular-season games.\n\nThe Redskins, meanwhile, weren’t able to find a trade suitor for Williams before Tuesday’s 4 p.m. deadline. Washington was reportedly asking for a first-round pick and a quality player in return for Williams.\n\nFor months, the Redskins had been unwilling to engage in trade talks — preferring to fine Williams for his absence — but the team began entertaining offers Monday. The Cleveland Browns were among the teams interested, but viewed the asking price as too high. Washington, for instance, asked for Pro Bowl cornerback Denzel Ward in return, according to the NFL Network. That was a non-starter.\n\nBrowns general manager John Dorsey said earlier this month he had conversations with Redskins president Bruce Allen over Williams, but noted “it takes two to tango.”\n\nIt is not known if Williams will suit up for the Redskins now that he has returned. Washington will have to make a transaction to activate him to the 53-man roster. Veteran Donald Penn, 36, has filled in at left tackle in Williams’ absence.\n\nWilliams returns to a Redskins team quite different from the one he played for last season. For one, his offensive line coach, Bill Callahan, was promoted to interim coach after Jay Gruden was fired for an 0-5 start. The Redskins are just 1-7 this season, far worse from last year’s 7-9 team.\n\nIn his return, Williams is set to make $5.7 million for the rest of the season. He was scheduled to make nearly $11 million at the beginning of the year, but forfeited game checks due to his holdout. He was also subject to fines — accruing costs of more than $1 million for his time away.\n\nThe Redskins could always look to trade Williams again this offseason. It is unknown if Washington, however, will be able to secure a first-round pick as Williams turns 32 in July and whatever team trades for him will likely give him an extension. The Redskins, according to ESPN, believe Williams’ value will be higher closer to the draft.\n\nIn addition to not dealing Williams, the Redskins stood pat at the trade deadline.\n\nWashington had been looking to move cornerback Josh Norman, who has struggled this season. Norman is in the fourth year of his five-year, $75 million contract, and teams were reportedly not interested in taking on the 31-year-old’s salary. The team also reportedly turned down an offer for running back Adrian Peterson.\n\nTuesday ended up being a quieter day for the NFL as most of the league’s significant trades happened last week. Only one deal happened hours before the deadline: The Los Angeles Rams sent cornerback Aqib Talib to the Miami Dolphins. The deal was a salary dump as the Rams included a fifth-round pick in order for the winless Dolphins to take Talib’s contract.", "description": "After not being traded before the NFL trade deadline, the Redskins left tackle reported to the team's facility Tuesday -- ending his months-long absence from the team.", "authors": ["The Washington Times Http", "Matthew Paras"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/16/Browns_Trade_Talk_Football_08449.jpg-4527b_c0-0-2980-1738_s1200x700.jpg?79a9a92fd86eab04402343dd01836ed1fc1867d7", "published_at": "2019-10-29"}