{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/tesla-stock-price-falls-on-weak-q3-vehicle-production-data-2019-10-1028574415", "downloaded_at": "2019-10-03 23:28:14.193647+00:00", "published_at": "2019-10-03", "title": "Tesla tumbles 7% after producing a disappointing number of vehicles last quarter (TSLA)", "language": "en", "text": "Ng Han Guan/Associated Press\n\nShares of Tesla traded as much as 7% lower on Thursday morning after the company reported disappointing vehicle-production data.\n\nThe electric-car maker said on Wednesday that it produced 96,155 vehicles and delivered 97,000 during the third quarter, setting a company record and falling toward the low end of analysts' consensus estimates of 95,000 to 100,000.\n\n\"Our delivery count should be viewed as slightly conservative, as we only count a car as delivered if it is transferred to the customer and all paperwork is correct,\" Tesla said in a press release.\n\nWatch Tesla trade live.\n\nTesla's stock price fell as much as 7% on Thursday morning after the company reported disappointing vehicle-production data on Wednesday.\n\nTesla produced 96,155 vehicles and delivered 97,000, setting a company record and hitting the low end of Wall Street's consensus estimates of 95,000 to 100,000.\n\nHere's the breakdown from Tesla's press release:\n\nModels S and X: 16,318 produced, 17,400 delivered\n\n16,318 produced, 17,400 delivered Model 3: 79,837 produced, 79,600 delivered\n\n\"Our delivery count should be viewed as slightly conservative, as we only count a car as delivered if it is transferred to the customer and all paperwork is correct,\" Tesla said in a press release. \"Final numbers could vary by up to 0.5% or more.\"\n\nThe company also said it was heading into the fourth quarter with an increased order backlog. Tesla previously said it hoped to deliver 360,000 to 400,000 cars in 2019.\n\nAccording to the Needham analyst Rajvindra S. Gill, Tesla, which has delivered about 255,000 vehicles so far this year, would need to ship more than 104,000 cars in the fourth quarter to reach the low end of its target.\n\n\"We are skeptical of its ability to record such a high number of deliveries given the competitive pressure in Europe and declining tax credits,\" Gill said in a note to clients on Thursday.\n\nIn a leaked email last week, Tesla CEO Elon Musk said the company had a chance to deliver more than 100,000 cars in the third quarter.\n\nThe Wedbush analyst Daniel Ives said the most important number from the company's Wednesday release was the better-than-expected Model 3 deliveries, which remains the \"linchpin of the Tesla growth story for the coming years.\" Wall Street had estimated that Model 3 deliveries would be 77,010 for the period.\n\nShares of Tesla were down nearly 27% year-to-date through Wednesday's close.\n\nRead more: Ray Dalio warns the White House's latest plan to clamp down on Chinese investment could soon become a reality. Here's why he thinks 'all market participants need to worry.'\n\nMarkets Insider", "description": "Shares of Tesla traded as much as 7% lower on Thursday morning after the company reported disappointing vehicle-production data. The electric-car maker sa...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d95e4aa4f9e731b882e8329-2400/53865e65eab8eaa90e497606.jpg"}