{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7612009/Retired-AFL-hardman-Barry-Hall-shows-ripped-body-fight-Paul-Gallen.html", "downloaded_at": "2019-10-26 00:26:00.972632+00:00", "title": "Retired AFL hardman Barry Hall shows off his ripped body before fight with Paul Gallen", "language": "en", "text": "Former AFL star Barry Hall has been training hard ahead of his debut boxing match against ex-NRL player Paul Gallen.\n\nThe 42-year-old, who stands at 6ft 4in, shared a video of himself hitting a punchbag in the gym on Friday.\n\nHe captioned it: 'While @paulgallen13 has been talking, I've been honing on my skill & power... it will shut him up in the ring.'\n\nFormer AFL star Barry Hall (pictured) has been training hard ahead of his debut boxing match against ex-NRL player Paul Gallen\n\nThe two former footballers will get in the ring for a one-off heavyweight stoush dubbed the 'code war' at Melbourne's Margaret Court Arena on November 15\n\nThe post received dozens of messages from fans, with many commenting on Hall's ripped physique.\n\n'You're a MACHINE mate,' said one. 'Rip him apart,' added another.\n\nGallen, who has nine professional fights under his belt since retiring from the Cronulla Sharks and is favourite to win, has also been hard at work.\n\nThe 38-year-old, who is 5ft 11in, has been training the UK and has shared his preparations on social media.\n\nHe uploaded a training video of him in the right with the caption: 'I hope ya training hard Barry because we'll be saying 'bye bye Barry' on the 15th.'\n\nThe two former footballers will get in the ring for a one-off heavyweight stoush dubbed the 'code war' at Melbourne's Margaret Court Arena on November 15.\n\nHall hasn't fought since he was 16 - a year after he won the Victorian age title.\n\nHe dropped boxing for football and went on to play with St Kilda, Sydney Swans and Western Bulldogs.\n\nA noted hardman on the AFL field, Hall was famously suspended for seven weeks for knocking out West Coast Eagles defender Brent Staker with a vicious blow to the head.\n\nGallen, who has nine amateur fights under his belt since retiring from the Cronulla Sharks, has also been hard at work (pictured)\n\nFour years younger, Cronulla great Gallen retired from the NRL last month after 19 seasons but has fought nine times since making his debut in 2014 for nine victories - five by KO.\n\nDespite his time out of the ring, Hall said he felt confident about his chances.\n\nHe said he weighed about the same as his playing days which ended in 2011 and has kept up his fitness.\n\n'A lot of people will say I'm too old but I know my body and I know what I'm capable of,' Hall said.\n\n'It's a long time between drinks but I'm training twice a day and I'm enjoying it so far.\n\n'I'm very comfortable in the ring.'\n\nHe said he'd been sparring regularly with boxers of Gallen's burly build, given he holds a 14cm height advantage over the rugby league great.\n\nHall admitted it would be hard to take Gallen down.\n\n'He's tough and he walks through a lot of bloke's punches and we're aware of that and he will get to me at some stage but I'm not going to stand there and cop it.'\n\nCronulla great Gallen (pictured) retired from the NRL last month after 19 seasons but has fought nine times since making his debut in 2014 for nine victories - five by KO\n\nWith his last win a second-round KO of John Hopoate in Sydney in February, Gallen has also stepped up his training.\n\nHe headed to the UK on a speaking tour but lined up gyms and sparring partners to keep his preparation on track.\n\nGallen said Hall was a formidable opponent, who he'd long been warned off by players he knew at the Swans.\n\n'He's already had 16 amateur fights which is more than me so he's going to know what he's doing,' Gallen said.\n\n'Guys who fight as amateurs get taught the basics of boxing and that's the most important thing and that will all come back to him.\n\n'But I don't think he's going to be able to keep up with the pace I'm going to go at, he won't be able to cop it so once we get in there it's going to be a shock for him.'", "description": "Former AFL star Barry Hall has been training hard ahead of his debut boxing match against ex-NRL player Paul Gallen. The 42-year-old, who stands at 6ft 4in, shared a video of himself hitting a punchbag.", "authors": ["Charlie Moore For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/05/20163896-0-image-a-23_1571976332966.jpg", "published_at": "2019-10-25"}