{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/23/alex-morgan-pregnant-tokyo-olympics", "downloaded_at": "2019-10-23 23:29:21.803839+00:00", "title": "Alex Morgan announces she's due to give birth three months before Olympics", "language": "en", "text": "USA international Alex Morgan announced she was pregnant with her first child on Tuesday and is due in April, three months before the 2020 Olympics.\n\nWhat’s the tea? The meaning behind Alex Morgan’s goal celebration Read more\n\nThe 30-year-old striker, who married LA Galaxy midfielder Servando Carrasco in 2014, did not specify whether she plans on trying to play for the US team in Tokyo.\n\n“We are already in love and we haven’t even met her yet,” Morgan said on social media. “Newest member of the Carrasco family, coming soon.”\n\nThe Orlando Pride star was awarded the silver boot at this summer’s World Cup in France, finishing as the joint top scorer with six goals but losing out to Megan Rapinoe on a fewest minutes tiebreaker.\n\nMorgan, who’s scored 107 times in 169 international appearances, tallied three goals on her Olympic debut in London including a 123rd-minute winner against Canada in the semi-finals, helping the US to a gold medal. She then led the team with two goals at the Rio Games, where the Americans were ousted by Sweden in the quarter-finals.\n\nThe USA co-captain would not be the first mother to play for the national team at the Olympics. Both Joy Fawcett (in 1996 and 2000) and Christie Rampone (2008 and 2012) played in the Summer Games after giving birth.\n\nThe opening ceremony of the Tokyo Olympics takes place on 24 July, though the women’s soccer competition begins two days earlier.", "description": "USA international Alex Morgan announced she was pregnant with her first child on Tuesday and is due in April, three months before the 2020 Olympics", "authors": ["Guardian Sport"], "top_image": "https://i.guim.co.uk/img/media/f141cf2b6daff40fdc25822735fd70cc4672cc21/0_98_4000_2399/master/4000.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=58e76de3dc8915047981e0fc213a30ab", "published_at": "2019-10-23"}