{"pub": "atlantic", "url": "https://theatlantic.com/politics/archive/2019/08/ben-howe-evangelical-christians-support-trump/596308", "downloaded_at": "2019-09-05 03:50:48.511094+00:00", "title": "Why Some Christians ‘Love the Meanest Parts’ of Trump", "language": "en", "published_at": "2019-08-18", "text": "Howe’s book mirrors the frenzied intellectual mode of the Trump era. Over the course of some 200-plus pages, he spends a lot of time talking about Twitter and micro-events from the insane Trumpian news cycle. Very few “regular” people show up in his book—he relies on the work of reporters and the statements of a few prominent evangelical Trump supporters to make a broad case about rot in the American church. While Howe sometimes seems to write from within an echo chamber, his keyboard-warrior style also yields the most compelling sections of the book, in which he reflects on the toxic culture of right-wing media.\n\nRead: On praying for the president\n\nConservatives who are so-called Never Trumpers are a rare breed to find in the wild, although you might not know it from the plush media gigs and small mountain of book deals this crowd has collected since Trump got elected. I wanted to talk with Howe because his rage is personal—it’s his church, his gospel, and his identity that he believes have been co-opted.\n\nOur conversation has been edited for length and clarity.\n\nEmma Green: What bothers you so much about the wholesale evangelical support for Donald Trump?\n\nBen Howe: There is not necessarily anything inherently wrong with a transactional relationship with a president. But Trump brings a few problems. The first is the kind of support he demands, which is a loyalty even when he does something wrong. If you want to stay on his good side, you have to support what he did and even laud him for it.\n\nThe late ’70s, with Jerry Falwell and the Moral Majority—the whole idea was that they were bringing something to Washington: expectations of morality and character. Now it seems like evangelicals are there to put faith around basic Republican politics.\n\nGreen: So it’s the hypocrisy that bothers you?\n\nHowe: Hypocrisy irritates me, but it’s not the objective of the book to have people go, “Those guys are hypocrites.” People know they’re hypocrites. But I think people are misidentifying why they’re hypocrites, and that’s what I wanted to address.\n\nGreen: You grew up in this world, right?\n\nHowe: Yes.\n\nGreen: Does that add to your irritation?\n\nHowe: It is important for people to understand that I’m coming from within this movement. I’m not outside of it, looking in. I know what I’m talking about because this has been my life.\n\nGreen: You talk a lot about the bitterness that motivates evangelicals in the realm of politics. Where does that come from?\n\nHowe: It comes from a reasonably understandable place. If people feel that their motives are impugned, if they feel they’re not bad people but are being told they are—being told they’re racist or misogynist—it can foster a mentality of victimhood.\n\nIn the minds of a lot of conservatives, the left exists to impugn their motives, and the Republican Party regularly lied to them and said they would defend them and then didn’t. And that was the establishment. Trump became their hero, because he hated the establishment, and he beat up on the media, and he was fighting back against all these forces. The more he fights, the more they feel justified, like, He’s our hero because we needed someone to do this for us.", "description": "The writer Ben Howe grew up in the world of conservative evangelicalism. When he looks at the religious right now, all he sees is a thirst for power and domination.", "authors": ["Emma Green"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/08/RTX3ECZI/facebook.jpg?1565985630"}