{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-storm-dorian-bahamas-spill/equinor-reports-onshore-oil-spill-in-bahamas-after-hurricane-idUKKCN1VQ1B1", "downloaded_at": "2019-09-05 11:26:49.213980+00:00", "title": "Equinor reports onshore oil spill in Bahamas after hurricane", "language": "en", "text": "OSLO (Reuters) - Equinor has discovered an oil spill at its storage terminal in the Bahamas in the aftermath of hurricane Dorian, the Norwegian energy company said in a statement on Thursday.\n\nOn its website, Equinor described the terminal as a key business on the Grand Bahama island, with a location intended to strengthen the company’s market and trading position in the Caribbean region.\n\n“Our initial aerial assessment of the South Riding Point facility has found that the terminal has sustained damage and oil has been observed on the ground outside of the onshore tanks,” Equinor said.\n\n“It is too early to indicate any volumes. At this point there are no observations of any oil spill at sea,” it added.\n\nAn undated photo of the facility showed it has 10 large storage tanks located on a plot of land by the ocean.\n\nAll of Equinor’s 54 employees on the island are confirmed safe and accounted for, the company said.\n\nIn preparation for the hurricane, Equinor shut down operations at the South Riding Point terminal on Aug. 31, and none of its staff were at the site during the storm.\n\n“We have informed the local authorities of our initial assessment and remain in dialogue with them,” Equinor said.\n\n“While weather conditions on the island have improved, road conditions and flooding continue to impact our ability to assess the situation and the scope of damages to the terminal and its surroundings.”", "description": "Equinor has discovered an oil spill at its storage terminal in the Bahamas in the aftermath of hurricane Dorian, the Norwegian energy company said in a statement on Thursday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-05"}