{"pub": "rt", "url": "https://rt.com/news/471641-lebanon-soldiers-protesters-hugging/ ", "downloaded_at": "2019-10-23 15:58:53.262229+00:00", "title": "WATCH protesters hug WEEPING soldiers during anti-government rallies in Lebanon", "language": "en", "text": "Touching scenes played out amidst massive protest rallies in Lebanon as several protesters embraced dewy-eyed soldiers during the standoff. The public anger was earlier sparked by plans for tax hikes.\n\nA video, posted on social media, shows two protesters comforting a soldier in full gear, who appears to be overwhelmed by emotion as he stands securing the perimeter. They gently pat the man on the cheek and shoulders.\n\nThe peaceful #LebanonProtests continue for day 7. Look at this soldier weeping tears of joy while people comfort him, overwhelmed by everyone's energy, when everyone around them is chanting the national anthem. The country has never seen such unity in some 50 years 🇱🇧 #Lebanonpic.twitter.com/kZUKe3HE9R — GallowBoob (@TheGallowBoob) October 23, 2019\n\nOther protesters are waving national flags and singing the national anthem, as more armed soldiers calmly stand next to them.\n\nIn a similar video, a protester and a soldier warmly hug each other, with chants heard at the background.\n\nUnder the rain, #LebaneseArmy retreats stays aside & refrains from opening roadblocks. Another emotional video of a protester & a soldier weeping , hugging each other #LebanonProtests#lebanonrevolution#لبنان__ينتفضpic.twitter.com/wEDEnDl2nG — Shada Omar شدا عمر (@Shadaomar) October 23, 2019\n\nAn earlier clip from the rallies, which went viral, showed the protesters singing a popular children’s song ‘Baby Shark’ to a small frightened boy in a bid to calm him. The song later became one of the protests’ unofficial anthems.\n\nThe Lebanese began blocking roads and holding rallies last week, protesting against the government’s plans to raise the value-added tax and introduce a new tax on the use of internet calling apps such a WhatsApp. The government later rolled back the tax hikes and proposed a number of economic reforms instead. The protesters, however, refused to leave the streets, demanding that Prime Minister Saad Hariri resigns.\n\nDespite remaining largely peaceful, the protests have at times led to sporadic clashes with police and some rioting.\n\nAlso on rt.com WATCH Lebanon protesters sing ‘Baby Shark’ to frightened child amid heated protests sparked by tax hikes (PHOTOS)\n\nThink your friends would be interested? Share this story!", "description": "Touching scenes played out amidst massive protest rallies in Lebanon as several protesters embraced dewy-eyed soldiers during the standoff. The public anger was earlier sparked by plans for tax hikes.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5db0596085f54023a849017c.jpg", "published_at": "2019-10-23"}