{"pub": "afr", "url": "https://afr.com/policy/foreign-affairs/the-overreach-of-well-meaning-global-bureaucrats-20191006-p52y0p", "downloaded_at": "2019-10-06 03:10:28.584230+00:00", "title": "The overreach of well-meaning global bureaucrats", "language": "en", "text": "So back to our Prime Minister's speech to the Lowy Institute. This was a speech in the best traditions of the Howard government’s foreign policy. Let us call it the Howard doctrine. At its most basic, it recognises the nation state as the foundation of the international system, but beyond that we engage with international institutions to advance our national interests. National sovereignty is axiomatic. What Morrison says is true of all countries. Rwanda wants to run its own affairs. So does China. So do we. As three countries, we couldn’t be more different. But the idea that some multilateral institution is going to sweep in and tell us all to reorganise our economies, destroying millions of jobs, and we are going to obey those instructions is just science fiction.\n\nOur three countries all co-operate with the rest of the world in our own ways according to our own priorities. Co-operation with others can enhance Australia’s security. That’s why we have ANZUS and it’s why I negotiated the Lombok Treaty with Indonesia. It’s also why I built the trilateral strategic dialogue with the United States and Japan. Trade agreements have enhanced our prosperity and the existence of international law, much of which emanates from the UN Security Council and UN conventions, suits us well.\n\nI wasn’t averse to International agreements. I signed the Comprehensive Nuclear-Test-Ban Treaty after I’d taken it to the UN General Assembly for adoption. I signed the Ottawa anti-landmine treaty and joined the new International Criminal Court. I’m sure the Morrison government will, over time, sign international instruments.\n\nBut let’s be clear. We shouldn’t be forced to sign agreements we don’t want to sign because we judge they are inimical to our national interest.\n\nI only once remember meeting anyone who worked for the UN who wasn’t what the left now likes to call 'progressive'.\n\nLooking at what’s emerging from the mouths of UN officials in recent weeks, it sounds like the place has been taken over by the left of America’s Democratic Party. The constant demands from UN officials for free movement of people, thereby undermining national sovereignty, the UN's denigration of capitalism and now its demand there be a total restructuring of the global economy, which would plunge the world into a great depression – a depression that would consign hundreds of millions of people to poverty again and cause civil unrest – just alienates the UN from the mainstream of most societies.\n\nI worked for the UN for six years and made many friends there. But I only once remember meeting anyone who worked for the UN who wasn’t what the left now likes to call “progressive”. He was, as it happened, an Australian. I well recall the whole of the UN’s Department of Political Affairs having an in-house party at the time of Barack Obama’s inauguration – a celebration of the end of the Bush presidency.\n\nThe truth is, the UN secretariat is politically an extension of the left pseudo-intellectualism of American liberal arts colleges. Since the ascent of the former social-democratic prime minister of Portugal to the post of UN secretary-general, I can’t think of a single conservative he’s appointed to anything. I might be wrong. But if he has, it would be one or two. Like universities, the UN staff talk about diversity but reject intellectual and political diversity.\n\nAdvertisement\n\nPaul Keating once said that if there was no UN we’d have to invent it. He was right. It serves an important purpose. But as Morrison implied in his Lowy lecture, multilateral institutions have their value but they also have their limits. Ultimately, the citizens of each nation state have the final say, not officials and diplomats in Turtle Bay, New York.\n\nThat’s not just the view of Australia. It’s the view of Rwanda and China and just about every other government in the world\n\nIt pays not just to listen to the \"quiet Australians\" but also to deal with the world as it is. Putting our own voters before the musings of international bureaucrats doesn’t make us inward looking. It makes us realistic.", "description": "Putting our own voters before the musings of international organisations doesn’t make us inward looking. It makes us realistic.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2814%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_238%2C$y_44/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/14cd88828d21f73df9f06b795c095adc66f392c3", "published_at": "2019-10-06"}