{"pub": "bbc", "url": "https://bbc.com/news/world-us-canada-50216280", "downloaded_at": "2019-10-29 06:11:52.118825+00:00", "title": "California faces huge power cuts as wildfires rage", "language": "en", "text": "Media playback is unsupported on your device Media caption Wildfire rages in Los Angeles\n\nAn estimated 1.5 million more people in California are set to lose power on Tuesday as a utility firm tries to stop damaged cables triggering wildfires.\n\nPacific Gas & Electric (PG&E) already faces an investigation by regulators after cutting supplies to 970,000 homes and businesses.\n\nIt announced that another 650,000 properties would face precautionary shut-offs on Tuesday amid high winds.\n\nWildfires fanned by the strong winds are raging in two parts of the state.\n\nThousands of residents near the wealthy Brentwood neighbourhood of Los Angeles have been told to evacuate because of a wildfire that began early on Monday.\n\nCelebrities including the actor-turned-politician Arnold Schwarzenegger are among those fleeing the fast-moving Getty Fire, which started near the Getty Center arts complex.\n\nFurther north in Sonoma County, a larger fire has forced 180,000 people from their homes.\n\nCalifornia's governor has declared a state-wide emergency.\n\nWhat about the power cuts?\n\nOn Monday regulators announced a formal inquiry into whether energy utilities broke rules by pre-emptively cutting power to an estimated 2.5 million people as wildfire risks soared.\n\nThey did not name any utilities but analysts said PG&E was responsible for the bulk of the \"public safety power shut-offs\".\n\nImage copyright Reuters Image caption Those fighting the flames had been \"overwhelmed\", a fire chief said\n\nThe company filed for bankruptcy in January after facing hundreds of lawsuits from victims of wildfires in 2017 and 2018.\n\nOf the 970,000 properties hit by the most recent cuts, under half had their services back by Monday, the Associated Press reported.\n\nDespite criticism that the precautionary blackouts were too widespread and too disruptive, PG&E said more would come on Tuesday and Wednesday because further strong winds were expected.\n\nThe company said it had logged more than 20 preliminary reports of damage to its network from the most recent windstorm.\n\nIn a video posted to Twitter on Saturday, Governor Gavin Newsom said the power cuts were \"infuriating everyone, and rightfully so\".\n\nWhere are the fires now?\n\nIn Los Angeles, the Getty Fire has burned over 600 acres (242 ha) and about 10,000 buildings are in the mandatory evacuation zone.\n\nAt least eight homes have been destroyed and five others damaged.\n\nNBA star Lebron James was among those forced to flee, and actor and former state governor Arnold Schwarzenegger said he had also evacuated.\n\n\"If you are in an evacuation zone, don't screw around,\" Mr Schwarzenegger tweeted. \"Get out.\"\n\nLA fire chief Ralph Terrazas said fire crews had been \"overwhelmed\" by the scale of the fires.\n\n\"They had to make some tough decisions on which houses they were able to protect,\" he said.\n\n\"Many times it depends on where the ember lands. I saw homes that were adjacent to homes that were totally destroyed, without any damage.\"\n\nMedia playback is unsupported on your device Media caption Sonoma County residents react to raging fire\n\nIn northern California, schools remain closed in Sonoma County as tens of thousands of homes and businesses are under threat.\n\nSonoma has been ravaged by the Kincade Fire, which started on Wednesday and has burned through 50,000 acres of land, fanned by the winds.\n\nThe Kincade Fire began seven minutes after a nearby power line was damaged, but PG&E has not yet confirmed if the power glitch started the blaze.\n\nAbout 180,000 people have been ordered to evacuate, with roads around Santa Rosa north of San Francisco packed with cars as people tried to flee.\n\nThere are fears the flames could cross the 101 highway and enter areas that have not seen wildfires since the 1940s.", "description": "A further 1.5 million people are set to lose power as high winds fan flames across the state.", "authors": [], "top_image": "https://ichef.bbci.co.uk/images/ic/1024x576/p07s9tc1.jpg", "published_at": "2019-10-29"}