{"pub": "breitbart", "url": "https://breitbart.com/news/french-captain-benneteau-names-unchanged-team-for-fed-cup-final", "downloaded_at": "2019-10-28 13:20:46.837326+00:00", "title": "French captain Benneteau names unchanged team for Fed Cup final", "language": "en", "text": "Paris (AFP) – France captain Julien Benneteau kept faith with the five women who sealed the semi-final win against Romania in April by naming an unchanged team on Monday for the Fed Cup final against Australia.\n\nKristina Mladenovic, ranked 39 in the world, will be backed by Caroline Garcia (45), Alize Cornet (60), Fiona Ferro (63) and Pauline Parmentier (121) in next month’s final in Perth.\n\n“So far, these five players have turned up every time,” said Benneteau. “I have confidence in these five to take up this huge challenge.”\n\nWorld number one Ashleigh Barty and veteran Samantha Stosur spearhead Australia’s team as they target a first title since 1974.\n\nFrance, who won the Fed Cup in 1997 and 2003, qualified for the final with a thrilling 3-2 win over Romania in Rennes in spite of losing two singles matches to Simona Halep.\n\nCaroline Garcia and Pauline Parmentier both won in the singles to set up a deciding doubles match in which Garcia and Mladenovic beat Halep and Monica Niculescu.\n\n“Today, there is only Fiona who has not played singles in this Fed Cup campaign,” said Benneteau.\n\n“I told them, and I will tell them again, that I need everyone and that everyone must be prepared to play anytime and against anybody, in singles or in doubles.”\n\nMladenovic, Garcia and Cornet all played in the 2016 final when France lost 3-2 to the Czech Republic.\n\nThe Fed Cup final takes place in Perth on November 9-10.", "description": "Paris (AFP) – France captain Julien Benneteau kept faith with the five women who sealed the semi-final win against Romania in April by naming an", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/28/7ec23e_world-number-39-kristina-mladenovic-is-top-ranked-player-in-france-team-640x335.jpg", "published_at": "2019-10-28"}