{"pub": "news24", "url": "https://news24.com/Green/News/artist-scientist-breathes-new-life-into-ancient-fossils-20190927", "downloaded_at": "2019-10-05 11:27:21.630346+00:00", "title": "Artist-scientist breathes new life into ancient fossils", "language": "en", "text": "It measures up to 10 metres (32.5 feet) from snout to tail, has four stumpy legs and - most noticeable of all - boasts a jaw lined with scary, jagged teeth.\n\nEven in pastel colours, this depiction of a rauisuchian - a forerunner of today's crocodiles that roamed the world more than 200 million years ago in the Triassic period - causes a shiver to run down the spine.\n\nYet the drawing of the dino-chomping terror is not part of a teen sci-fi magazine, but an illustration to accompany a deeply serious scientific study published by South Africa's University of the Witwatersrand.\n\nIt is the work of Viktor Radermacher, a South African who is half scientist and half artist.\n\nHe is a \"palaeo-artist\" - his job is to give the world an idea of what these long-extinct species looked like, but rooted in scientific scrutiny of their fossilised remains.\n\n\"Palaeo-art is... trying our best to reconstruct what these animals look like and try to breathe some life into these old stone bones,\" said Radermacher.\n\n\"Whenever I'm doing these artworks I'm trying to inject some realism but still inject some sort of drama and some sort of exciting composition that shows off these animals behaving naturally, but also showing off the scientific relevance.\"\n\nHe added: \"For me, palaeo-art really is the closest thing that we have to time travel.\"\n\nJonah Choiniere, a professor of palaeontology at the university, said researchers had submitted a 30-page study to describe their findings about a exceptionally preserved rauisuchian fossil, found in Rosendal, central South Africa, in 2015.\n\n\"The artwork Viktor is doing summarises those 30 pages in about a quarter of a page worth of space,\" he said admiringly.", "description": "It measures up to 10 metres (32.5 feet) from snout to tail, has four stumpy legs and - most noticeable of all - boasts a jaw lined with scary, jagged teeth.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8393/8759055ffdeb4a5c93d1981bcc21b372.png", "published_at": "2019-09-30"}