{"pub": "businessinsider", "url": "https://businessinsider.com/california-effort-to-regulate-hr-tech-highlights-broader-issue", "downloaded_at": "2019-09-28 21:47:21.249137+00:00", "title": "There are no laws regulating the use of AI in the hiring process, and it's setting back how companies recruit. Here are the people trying to change that.", "language": "en", "text": "Advocates, including companies that make AI-based hiring platforms, were pushing California lawmakers to pass a resolution they say would have encouraged companies to further use technology to eliminate bias in recruitment.\n\nThe failure to enact it, however, highlights a growing concern among executives who worry that use of the tech could expose their company to legal liability.\n\nThe CEO of one firm who offers an AI-based hiring platform says usage would not only help reduce bias, but also spur economic benefit for firms that would be able to better match prospective employees to open roles.\n\nClick here for more BI Prime stories.\n\nCalifornia recently failed to take a key step toward trying to govern the use of artificial intelligence in hiring. While the effort didn't garner many headlines, it signals the looming battle facing governments and businesses as the technology becomes more widespread.\n\nThe first-of-its-kind measure would not have codified anything into law. Instead, it simply would have directed lawmakers in the state to craft a set of standards to oversee AI-based recruitment tools. Supporters, which include companies that offer these type of platforms, are hoping to continue to push the resolution once California resumes its legislative session next year.\n\nWhile initial attempts have been made at legislating on AI-related issues, the lack of any actual laws on the subject threaten to delay more widespread adoption of high-powered recruitment tech that backers, like Pymetrics CEO and cofounder Frida Polli, say will lead to more diversity in hiring.\n\n\"Under the current legal system, one could use technology to reduce bias, show year-over-year diversity gains, and yet still be sued for discrimination,\" Polli, whose company offers an AI-based recruitment platform, told Business Insider.\n\nCompanies still skeptical of using AI in hiring\n\nIncreasingly, companies are automating aspects of hiring like the initial review of resumes. Many organizations, however, remain hesitant. In a survey of mid-sized, privately-held firms, Deloitte found that 55 percent of respondents were concerned that using AI in the recruitment process could be in violation of regulatory or legal requirements.\n\nSupporters say successful passage of the California resolution would have begun to ease those worries and laid the groundwork for future efforts to ensure the technology operates appropriately. It was also viewed as the first step in what backers hope will eventually become a national movement.\n\nAnd for good reason. Alongside New York, California is often looked to as a first-mover on measures to ensure equality in the workplace. Adoption of measures in those two states often lead to a cascade effect across other cities and states in the US.\n\nIf resolutions or laws relating to AI-based recruitment tools are enacted, Polli argues the result would not only be a boon to diversity in the workforce, but also produce an economic benefit for firms.\n\n\"Once you remove that bias altogether and you just look at the numbers, you're able to have people included in the [hiring] process that previously would have been excluded,\" she said.\n\nThe Pymetrics platform blocks out information like where a candidate went to school or their gender. Instead, it asks individuals to play a series of games that ultimately measure over 70 mental and emotional traits, including memory and risk-taking. The goal is to encourage more diversity in hiring.\n\nFrom 1990 to 2017, white applicants with nearly identical resumes were 36 percent more likely to advance in the hiring process compared to black applicants and 24 percent more likely than Latino candidates, according to a meta-analysis — or study of studies — in the prestigious Proceedings of the National Academy of Sciences.\n\nOther studies have shown that every open position in a corporation receives an average of at least 250 applications. Even with the large number of resumes, the ultimate hire \"fails 50 percent of the time,\" according to Polli. For companies, employee turnover on average costs 33 percent of that individual's yearly salary.\n\n\"If there was any other business unit where that was the outcome, someone would get fired,\" she said.\n\n'We always lead with the business problem'\n\nWhen they first started marketing the tool, Polli and her team didn't initially view it as a diversity program and instead touted it as an assessment tool that would better match prospective employees to the job best suited for them. It wasn't until they began meeting with companies that they realized the platform came with the added benefit of reducing bias.\n\n\"We always lead with the business problem that we are trying to solve,\" Polli said.\n\nBut the company soon came upon a problem: businesses were worried they could open themselves up to legal liability by using the tool. According to Polli, executives would tell them: \"Our lawyers are saying there is a fear because we don't want to get sued or we don't even want to open up the case where someone would sue us.\"\n\nThe concern, legal experts say, is that the algorithms used by the AI-based platforms could also have inherent biases that influence decision-making. Google, for example, faced criticism when a program to pinpoint hate speech online began flagging online comments that included African-American vernacular.\n\nCalifornia supporters plan to plow ahead after loss\n\nPolli's team knew when creating the platform they were entering a highly regulated space and worked to start finding ways to alleviate any legal concerns. They turned to California initially given its history of strong workplace protections.\n\nThe state, for example, passed a hallmark law that would prohibit companies from labeling some employees as contractors, a tool that critics say was used as an end-run to avoid providing benefits like healthcare.\n\nRead more: Uber and Lyft just took a major blow in California, and now they're gearing up for war\n\nDespite the failure of the resolution on AI in hiring, its key sponsor doesn't plan to give up the push and is hoping to even introduce formal legislation in future sessions — which would carry the weight of law if enacted. California's legislative period ended earlier this month and restarts in January 2020.\n\n\"Even now, I'm getting really good input on what people expect me to look at as we move forward,\" California Assemblymember Reggie Jones-Sawyer, a Democrat, told Business Insider earlier this month.\n\nWhy job concerns could stymie progress\n\nOne concern among his fellow lawmakers, however, is that writing the resolution into law could lead organizations to eliminate corporate recruiters in favor of the AI-powered technology platforms. That's a common worry among skeptics of the technology: that it could lead to massive job losses.\n\nJones-Sawyer argues that is not the case. \"We still need human input in hiring. This is just a tool to help human resource officers be able to get the best qualified people,\" he said.\n\nPolli and her team could face a similar challenge in New York City, where they've begun preliminary meetings with activist groups. The hope is that successful passage in California and New York will lead to swift adoption of similar measures in other cities and states across the U.S.\n\nWhile the effort from Polli and others is still in the relatively nascent stages, it signals the broader legislative and legal battle around artificial intelligence that will likely pickup steam as the technology matures.", "description": "Key advocate Frida Polli, the CEO of Pymetrics, argues that broader use of AI-powered hiring tools could eliminate bias and spur economic gain.", "authors": ["Joe Williams"], "top_image": "https://image.businessinsider.com/5d8e48ca2e22af7e4b3c20d9?width=1200&format=jpeg", "published_at": "2019-09-28"}