{"pub": "cbs", "url": "https://cbsnews.com/news/uss-george-h-w-bush-navy-sailors-suicides-portsmouth-and-norfolk-virginia-police-confirm", "downloaded_at": "2019-09-24 15:15:19.992358+00:00", "title": "Navy confirms string of recent suicides by USS George H.W. Bush sailors", "language": "en", "text": "Four service members of the United States Navy have died by suicide between July and September of this year, officials have confirmed. The suicides involved four sailors assigned to the USS George H.W. Bush aircraft carrier. Although two of the sailors killed themselves on the same day, the suicides did not occur on board the ship and authorities have said there is nothing to indicate the deaths are linked.\n\nIn a Facebook post, Captain Sean Bailey, Commanding Officer of USS George H.W. Bush, confirmed that a number of suicides have taken place by crew members in the last two years.\n\n\"It is with a heavy heart that I can confirm the loss of three Sailors last week in separate, unrelated incidents from apparent suicide. My heart is broken,\" Bailey wrote. \"These deaths mark the third, fourth, and fifth crew member suicides in the last two years. Now is the time to come together as a crew and as a family to grieve, to support each other, and to care for those in need.\"\n\nThe Navy Times reported that on July 16 Machinist's Mate 3rd Class Robert John Bartulewicz III died by suicide. The Navy Times reported that last week, three more deaths were ruled as suicides by authorities in Norfolk and Portsmouth, Virginia. Chief Electronics Nuclear Technician James Harold Shelton died on September 14. Aviation Ordnanceman 1st Class Vincent Michael Forline and Airman Ethan Thomas Lee Stuart died on September 19.\n\nNorfolk Police Department Public Information Officer Daniel Hudson confirmed the deaths of three Navy officers to CBS News. Police classified the cause of each death as undetermined because only a medical examiner can classify the deaths as a suicide.\n\nAccording to Norfolk police, around 12:30 a.m. on July 16, 2019, Bartulewicz III was found inside a vehicle in a parking lot. Police received a call for a man slumped over in a vehicle. He was pronounced dead from a gunshot wound, and it was determined by police at the scene to be self-inflicted.\n\nAround 9:45 a.m on September 14, Shelton was found inside a vehicle after police received a call for a man slumped over in a car. He was pronounced dead from a gunshot would, which police determined was self-inflicted.\n\nAt 6:30 p.m. on September 19, Stuart was found inside a residence in Norfolk. According to police, Stuart's roommate said he found Stuart inside his room with a gunshot wound. He was pronounced dead at the scene.\n\nThe USS George H.W. Bush warship has been docked at Norfolk Naval Shipyard Police officers in Portsmouth, Virginia where it is undergoing 28 months of repairs. Police in Portsmouth and Norfolk, along with Naval Criminal Investigative Agents, have been in change of investigating the suicides.\n\nThe U.S. Navy did not immediately return CBS News' request for comment.\n\nFor immediate help if you are in a crisis, call the toll-free National Suicide Prevention Lifeline at 1-800-273-TALK (8255), available 24 hours a day, seven days a week. All calls are confidential.", "description": "The suicides involved four sailors assigned to the George H.W. Bush aircraft carrier docked in Virginia", "authors": ["Brian Pascus"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2018/09/18/5d08a87d-b468-49ae-95ae-39b5009dcfd9/thumbnail/1200x630/57e56376b27896e9ed94b44eefea0912/ussghw.jpg", "published_at": "2019-09-24"}