{"pub": "cnbc", "url": "https://cnbc.com/2019/10/01/uaw-submits-counter-offer-to-comprehensive-deal-from-gm.html", "downloaded_at": "2019-10-02 00:34:36.806013+00:00", "title": "UAW submits counteroffer to 'comprehensive,' yet unsatisfactory, deal from GM", "language": "en", "text": "United Auto Workers members on strike picket outside General Motors' Detroit-Hamtramck Assembly plant on Sept. 25, 2019 with Vermont Sen. Bernie Sanders (far left) in Detroit. Michael Wayland / CNBC\n\nDETROIT — The United Auto Workers union on Tuesday submitted a counterproposal to a \"comprehensive,\" yet unsatisfactory, contract deal offered by General Motors. UAW Vice President Terry Dittes, in a letter sent to union members Tuesday, said the proposal GM submitted to the union Monday night \"did not satisfy\" the \"contract demands or needs\" of members. He said the UAW is \"awaiting GM's next proposal to the union.\" The most recent proposal by GM, according to Dittes, \"came up short\" in many areas such as health care, wages and temporary employees — all issues that have been reported to be sticking points in the negotiations.\n\n\"We remain committed, however, to exploring all options in order to reach an agreement that meets the needs of our Membership,\" he wrote. GM declined to comment on Dittes' letter or the details of the proposals, saying officials \"continue to negotiate and exchange proposals and remain committed to reaching an agreement that builds a stronger future for our employees and our company.\" This is at least the third proposed deal since the union decided to go on strike. Workers began picketing after the automaker offered terms, prior to a Sept. 14 contract deadline, that included over $7 billion in new investments, creation or retention of 5,400 jobs, and wage or lump-sum increases each year. The back-and-forth of deals, like any negotiations, is common. However, Colin Lightbody, a labor consultant and longtime negotiator for Fiat Chrysler, questions the amount of progress that's being made at the table. \"It just seems like it's Groundhog Day,\" he said. \"The issues appear to be the same. I'm not sure how much progress is being made. It seems like really slow progress.\" Art Schwartz, president of Labor and Economics Associates and a longtime labor relations negotiator at GM, said the talks could be progressing more than the union is letting on, as it's traditionally taboo for either side to negotiate in public. \"The letter is going to say what the union wants their members to hear, but nobody gets everything they want in a collective bargaining agreement,\" he said. \"If the union is holding out for 'my way or the highway,' the bargaining is in trouble.\"", "description": "United Auto Workers Vice President Terry Dittes, in a letter to union members on Tuesday, said the most recent proposal by GM \"did not satisfy\" the \"contract demands or needs\" of members.", "authors": ["Michael Wayland"], "top_image": "https://image.cnbcfm.com/api/v1/image/106152992-1569598497518img_5279.jpg?v=1569598603", "published_at": "2019-10-01"}