{"pub": "yahoo", "url": "https://finance.yahoo.com/news/how-facebooks-libra-would-work-yahoo-u-153549088.html", "downloaded_at": "2019-10-27 00:42:29.530048+00:00", "title": "How Facebook’s Libra would work: Yahoo U", "language": "en", "text": "Facebook CEO Mark Zuckerberg was grilled by lawmakers this week on the company's cryptocurrency project Libra. The project has attracted the attention of regulators and policymakers all over the world. But what is Libra, and how does it work?\n\nAmong many other talking points, Zuckerberg made a point of calling Libra a payment system, and not money.\n\nAs Facebook laid out in its white paper in June, Libra is intended to be a way to send money instantly, with low fees, to people all over the world. Currently, sending money abroad (through SWIFT interbank transfers or wire services like Western Union) can take several days. These processes can also be pretty expensive.\n\nWith Libra, a Facebook user would sign up for a “Calibra” wallet and send units of Libra to another Calibra wallet holder. Since there are no transacting banks in this case, the transfer happens instantaneously on Facebook’s blockchain. There's no multi-day delay in debiting and crediting the money from one bank to the other.\n\nBut what makes Libra novel and different from Bitcoin or other cryptocurrencies is its partnership with a consortium of companies like Lyft, Uber, Spotify, and Vodafone to help it develop and use the blockchain.\n\nInstead of having to convert the Libra into domestic currency to call an Uber or pay for your monthly Vodafone bill, users could pay directly in units of Libra. That would dramatically, in theory, reduce the costs of foreign exchange conversion.\n\nBut a slew of companies have bailed from the project: Booking Holdings, Mercado Pago, PayPal, eBay, MasterCard, and also Visa and Stripe. David Marcus, the head of the Facebook subsidiary heading Libra’s development, told Yahoo Finance that non-founding members of Libra will still be able to transact in Libra whenever the project launches.\n\nLibra concerns\n\nThe exodus of companies from the project is just one problem facing Libra.\n\nRegulators have also expressed worry about the financial stability of the project. Facebook has 2.7 billion users and if a substantial amount of people on that platform opt to use Calibra wallets as a de facto bank, there are concerns that the blockchain could be large enough to present what they call “systemic” risk to the financial system. Federal Reserve Chairman Jerome Powell has shared this concern with Congress.\n\nFacebook acknowledges this risk.\n\n“We should assume that there is a chance that this could have systemic risk and design it in a way that it cannot become a systemic risk,” Marcus told Yahoo Finance.\n\nLibra also bills itself as what they call a “pseudonymous” set up, where Calibra wallets are tied to addresses that are not linked to their real world identities. This raises questions about how authorities follow the money if Libra is being used for illegal activities.\n\nThere's also privacy concerns. Facebook was fined $5 billion from the FTC for privacy reasons earlier in the year. Although Facebook insists that its subsidiary company, Calibra, will be handling the project separately, lawmakers have pressed hard on Zuckerberg to assure that users will be protected.\n\nLibra has targeted a launch date of the first half of 2020. But Zuckerberg told Capitol Hill earlier this week that they won't launch it until U.S. regulators give them the green light.\n\nValentina Caval is a producer at Yahoo Finance. Brian Cheung is a reporter at Yahoo Finance.\n\nRead and watch more of Yahoo U here\n\nRead the latest financial and business news from Yahoo Finance\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.", "description": "Facebook CEO Mark Zuckerberg was grilled by lawmaker's on the company's cryptocurrency project Libra. But how would Libra actually work?", "authors": ["Valentina Caval", "Brian Cheung"], "top_image": "https://s.yimg.com/uu/api/res/1.2/d_s2uwi4c2TGffBgba4MaA--~B/aD0zMzY5O3c9NDkyMjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/b46b1cb0-f7e9-11e9-a7a9-d301d0bf1035", "published_at": "2019-10-26"}