{"pub": "yahoo", "url": "https://finance.yahoo.com/news/costco-cost-register-earnings-comps-111311553.html", "downloaded_at": "2019-10-03 10:51:35.559200+00:00", "published_at": "2019-10-02", "title": "Will Costco (COST) Register Earnings & Comps Growth in Q4?", "language": "en", "text": "Costco Wholesale Corporation COST is slated to report fourth-quarter fiscal 2019 results on Oct 3. The Issaquah, WA-based company has outperformed the Zacks Consensus Estimate in the trailing four quarters, with an average positive earnings surprise of 6%. In the last reported quarter, the company delivered a positive earnings surprise of 3.3%. Let’s see how things are shaping up prior to this announcement.\n\nThe Zacks Consensus Estimate for the quarter under review is $2.54, suggesting growth of roughly 7.6% from the year-ago quarter. We note that the Zacks Consensus Estimate has advanced by a penny in the past 30 days. The Zacks Consensus Estimate for revenues currently stands at $47,258 million, indicating an improvement of 6.4% from the year-ago reported figure.\n\nFactors Influencing Costco’s Performance\n\nCostco continues to be one of the dominant retail wholesalers based on the breadth and quality of merchandise offered. In fact, the company’s strategy to sell products at heavily discounted prices has helped it to remain on growth track. We believe that the company’s growth strategies, sturdy comparable sales (comps) performance and strong membership trends are likely to fuel the top line in the to-be-reported quarter.\n\nNotably, comps for the month of August rose 5.5%, following an increase of 5.6%, 5.4% and 4.2% in July, June, and May, respectively. The Zacks Consensus Estimate for comps indicates growth of 5.2% in the third quarter.\n\nCostco has been able to create a niche for itself on the back of growth strategies, better price management, strong membership trends and increasing penetration of e-commerce business. A differentiated product range enables the company to provide an upscale shopping experience, resulting in market share gains and higher sales per square foot.\n\nThe company is fast adopting the omni-channel mantra to provide a seamless shopping experience, whether online or in-stores. It is steadily expanding e-commerce capabilities in the United States, Canada, the U.K., Mexico, Korea and Taiwan. E-commerce comparable sales surged 23.9% in the month of August, following an increase of 21.3%, 15.7%, 20.2% in the months of July, June and May, respectively.\n\nCertainly, the decent performance indicates that the company’s growth efforts have been fueling traffic across both the online and brick-and-mortar platforms. However, analysts pointed that any incremental investments or aggressive pricing strategy may weigh on margins. Moreover, rising SG&A expenses and stiff competition also remain concerns.\n\nCostco Wholesale Corporation Price, Consensus and EPS Surprise\n\nCostco Wholesale Corporation Price, Consensus and EPS Surprise More\n\nCostco Wholesale Corporation price-consensus-eps-surprise-chart | Costco Wholesale Corporation Quote\n\nWhat the Zacks Model Unveils?\n\nOur proven model shows that Costco is likely to beat estimates this quarter. A stock needs to have both — a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) and a positive Earnings ESP — for this to happen. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\n\nCostco has a Zacks Rank #3 and an Earnings ESP of +0.37%. This makes us reasonably confident of an earnings beat.\n\nOther Stocks With Favorable Combination\n\nHere are some other companies you may want to consider as our model shows that these too have the right combination of elements to post an earnings beat:\n\nBurlington Stores, Inc. BURL has an Earnings ESP of +0.45% and a Zacks Rank #2. You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nUrban Outfitters, Inc. URBN has an Earnings ESP of +8.63% and a Zacks Rank #3.\n\nAbercrombie & Fitch Co. ANF has an Earnings ESP of +7.05% and a Zacks Rank #3.\n\n7 Best Stocks for the Next 30 Days\n\nJust released: Experts distill 7 elite stocks from the current list of 220 Zacks Rank #1 Strong Buys. They deem these tickers “Most Likely for Early Price Pops.”\n\nSince 1988, the full list has beaten the market more than 2X over with an average gain of +24.6% per year. So be sure to give these hand-picked 7 your immediate attention.\n\nStory continues", "description": "Costco's (COST) growth strategies, sturdy comparable sales performance and strong membership trends are likely to favorably impact fourth-quarter results.", "authors": ["Zacks Equity Research"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Nm54FzePdDFPL7mGGf7JmQ--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/44263f48df9be6f8f1d10cb79541249a"}