{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7545747/Climate-activists-block-key-traffic-hub-Berlin.html", "downloaded_at": "2019-10-07 09:37:26.752403+00:00", "title": "Climate activists block key traffic hub in Berlin", "language": "en", "text": "BERLIN, Oct 7 (Reuters) - Dozens of climate change activists blocked traffic at a main square in Berlin on Monday, kicking off a week of protests intended to force the German government to take more drastic measures to protect the environment.\n\nDefying almost freezing temperatures, activists singing \"Solid as a rock, rooted as a tree\" gathered at dawn at the iconic Victory Column near Berlin's Tiergarten park.\n\nAt sunset some were sleeping in insulated bags in the middle of the roundabout as police on motorbikes drove by. No arrests were made and the protest remains peaceful.\n\nPolice blocked the five avenues that converge on the roundabout to prevent cars and buses from reaching the demonstration, which would have resulted in traffic chaos during the morning rush hour.\n\nOther activists rode on bicycles across the city to draw attention to their campaign, organised by the environmental group Extinction Rebellion, which held simultaneous protests in Amsterdam.\n\nChancellor Angela Merkel's government is expected on Wednesday to approve the main details of landmark climate protection measures that have been described as unambitious by critics.\n\nAt the centre of their outrage is a decision to introduce a carbon dioxide price of 10 euros ($10.96) a tonne for transport and heating in buildings from 2021 and gradually increase it to 35 euros in 2025.\n\nEconomists and activists had hoped for a starting price of at least 40 euros and point to Switzerland where that price is about 90 euros for heating with fossil fuels. ($1 = 0.9122 euros) (Reporting by Hannibal Hanschke, Writing by Joseph Nasr, Editing by Ed Osmond)", "description": "BERLIN, Oct 7 (Reuters) - Dozens of climate change activists  blocked traffic at a main square in Berlin on Monday, kicking  off a week of protests intended...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-07"}