{"pub": "metro", "url": "https://metro.co.uk/2019/10/06/andreas-pereira-cannot-hide-frustration-manchester-united-team-mate-fred-newcastle-clash-10872255", "downloaded_at": "2019-10-07 00:16:31.836645+00:00", "title": "Andreas Pereira cannot hide frustration with Manchester United team-mate Fred during Newcastle clash", "language": "en", "text": "United endured a dismal game at Newcastle (Picture: Getty)\n\nAndreas Pereira could not hide his frustration with Fred following a miscontrol from his team-mate during Manchester United’s loss to Newcastle United.\n\nUnited were left chasing the game in the final 15 minutes at St James’ Park after Matty Longstaff’s strike had given Newcastle the lead.\n\nThe visitors were mounting an attack when Pereira passed to Fred, but somehow the ball evaded the Brazilian and rolled out harmlessly for a throw-in.\n\nAs Fred threw his hands up in the air, cameras picked up Pereira’s baffled reaction to his team-mate’s unforced error.\n\nJust look at Periera, he so shocked Fred cannot control a simple pass OMG. We paid 52million for this guy 😂😂😂#NEWMUN #OleOut Manchester United pic.twitter.com/a6txMaLR3o — Ghana Chris Brown😎🎩 (@Nana_Yaw_Xander) October 6, 2019\n\nFred is just one of many United players struggling for form this season and the result at Newcastle leaves the Red Devils in 12th place after eight Premier League games.\n\nAdvertisement\n\nAdvertisement\n\nOle Gunnar Solskjaer cut a frustrated figure on the touchline during the game and bemoaned his side’s lack of organisation.\n\n‘We weren’t set up for the counter-attack,’ said Solskjaer. ‘We conceded at least two goals – Everton away Wolves away – from our own corners, maybe two against Everton in one game.\n\n‘And that shouldn’t happen and with the pace we’ve got, we should lock that corner down.\n\n‘But it’s impossible to get the message across, because we gave the Newcastle fans something to cheer today, we gave them a game that they wanted, end-to-end at times.\n\nFred let the ball get away from him (Picture: Rex Features)\n\n‘We gave them too many counter-attacks, lifted their crowd, you could see they were behind their team, behind [Steve] Brucey and it was impossible for me to put one or two players where they should have been.\n\n‘There are players that try to organise it but couldn’t and when that happens, six or seven back in our own box, but we couldn’t defend that ball.\n\n‘There were two attempts to tackle, from Dan [James] and Fred. We’re trying but lacking in that composure and that organiser there.’", "description": "Andreas Pereira could not hide his frustration with Fred following a miscontrol from his team-mate during Manchester United's loss to Newcastle United. United were left chasing the game in the...", "authors": ["Metro Sport Reporter"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/Andreas-Pereiras-reaction-to-Fred-miscontrolling-ball-f6fc_1570389676.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-06"}