{"pub": "reuters", "url": "https://in.reuters.com/article/soccer-italy-racism/italian-pundit-dropped-after-lukaku-banana-comment-idINKBN1W1288", "downloaded_at": "2019-09-16 23:19:34.076841+00:00", "title": "Italian pundit dropped after Lukaku banana comment", "language": "en", "text": "ROME (Reuters) - A veteran Italian pundit has been told he will not be invited back onto one of the country’s Sunday night round table programmes after suggesting Inter Milan forward Romelu Lukaku could only be stopped by giving him bananas to eat.\n\nFILE PHOTO: Soccer Football - Serie A - Inter Milan v Udinese - San Siro, Milan, Italy - September 14, 2019 Udinese's Walace in action with Inter Milan's Romelu Lukaku REUTERS/Daniele Mascolo/File Photo\n\nThe remark came two weeks after Belgium striker Lukaku, who has only been playing in Italy for one month, was subjected to monkey chants by supporters at Cagliari when he stepped up to take a penalty against the Sardinian side.\n\nLuciano Passirani was praising Lukaku’s qualities when he made the remark during the Qui Studio a Voi Stadio programme on Telelombardia.\n\n“Lukaku is one of the best signings Inter could have made. I don’t see another player like him on any other team in Italy, not in Milan, in Juventus, in Roma, in Lazio,” he said.\n\n“This guy kills you in one-on-ones, if you go against him, you will fall. Either you have 10 bananas to eat, that you give to him, or...”\n\nThe presenter immediately reprimanded Passirani, who said the remark was meant as a joke.\n\nFabio Ravezzani, the programme director, later announced that, despite being “the first person to apologise”, Passirani would not be appearing again.\n\n“Mr Passirani is 80 years old and to compliment Lukaku he used a metaphor that turned out to be racist,” he said.\n\nLukaku said last month that football was going backwards in the fight against racism.\n\nAfter the Cagliari incident, the Curva Nord group of hardcore Inter fans posted a message on Facebook which claimed the behaviour of Cagliari fans was not racist.\n\n“You have to understand that Italy is not like many other north European countries where racism is a REAL problem. We understand that it could have seemed racist to you, but it is not like that,” it said.\n\nItalian football has been blighted by racism incidents over the last decade. In 2013, AC Milan walked off the pitch during a friendly against a lower division side in protest at racist chanting against some of their players.\n\nIn 2014, Carlo Tavecchio was elected head of the Italian Football federation (FIGC) weeks after making a comment about a fictitious African player he named Opti Poba “eating bananas.”\n\nThe FIGC cleared him of wrongdoing but he was barred from holding any position with soccer’s world governing body FIFA for six months.\n\nHe resigned in 2017 after Italy failed to qualify for the World Cup in Russia.", "description": "A veteran Italian pundit has been told he will not be invited back onto one of the country's Sunday night round table programmes after suggesting Inter Milan forward Romelu Lukaku could only be stopped by giving him bananas to eat.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190916&t=2&i=1430533841&w=1200&r=LYNXMPEF8F1AL", "published_at": "2019-09-16"}