{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7591337/Dominic-Cummings-portrayed-demonic-NAZI-giant-effigy-raised-anti-Brexit-mob.html", "downloaded_at": "2019-10-19 15:17:03.075309+00:00", "title": "Dominic Cummings is portrayed as a demonic NAZI in giant effigy raised by anti-Brexit mob", "language": "en", "text": "An effigy of Number 10 adviser Dominic Cummings dressed as a Nazi formed the centrepiece of today's Remainer march on Parliament.\n\nThe model of the arch-Brexiteer controlling a puppet Boris Johnson was wheeled down Whitehall as part of the mammoth People's Vote rally.\n\nWith 'Demonic Cummings' etched on its head, the effigy was wearing an SS-style armband and had a Union Flag toothbrush moustache.\n\nBut official organisers of the demonstration distanced themselves from the blimp and shrugged off responsibility.\n\nAn effigy of Number 10 adviser Dominic Cummings dressed as a Nazi formed the centrepiece of today's Remainer march on Parliament\n\nMr Cummings (pictured arriving in Downing Street this morning) has been credited with masterminding the Prime Minister's scorched earth approach to Brexit negotiations\n\nA People's Vote spokesperson told MailOnline: 'This is a crowd of up to one million people, and we're not responsible for every placard, poster or sign.\n\n'We have many criticisms of Dominic Cummings, but we do not think he's a demon.'\n\nAlong the side of the effigy, which is positioned on a float, are the words: 'Cummings, master of puppets (muppets).'\n\nThe effigy was first seen early this morning ahead of the march which later drew tens of thousands of grassroots Remainers.\n\nMr Cummings led the Vote Leave campaign to victory in the 2016 referendum, before being asked to join Mr Johnson's new administration in Downing Street.\n\nHe has been credited with masterminding the Prime Minister's scorched earth approach to Brexit negotiations.\n\nThe strategist also grabbed headlines when he sacked an adviser to chancellor Sajid Javid who he suspected of leaking government information.\n\nAlong the side of the effigy, which is positioned on a float, are the words: 'Cummings, master of puppets (muppets)'\n\nOfficial organisers of the demonstration distanced themselves from the blimp and shrugged off responsibility\n\nDespite her protests, Mr Cummings had her frogmarched out of Number 10 by the police.\n\nPoliticians, celebrities and even the headline-grabbing eco-warrior known as Mr Broccoli are among today's Remainer ranks which are calling for a second Brexit referendum.\n\nIn addition to the thousands of banners and placards calling for a fresh poll, some also referred to elevating 'love over hate'.\n\nBrexit tension threatened to boil over today as Remain activists on the People's Vote march clashed with a Leave counter-protest.\n\nHeated exchanges between campaigners from either side of the political divide broke out in Parliament Square where tens of thousands of pro-EU activists had gathered to demand a second referendum.", "description": "The model of the arch-Brexiteer controlling a puppet Boris Johnson was wheeled down Whitehall as part of the mammoth People's Vote rally.", "authors": ["Jack Elsom For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/19/15/19926060-0-image-a-17_1571494410280.jpg", "published_at": "2019-10-19"}