{"pub": "cbc", "url": "https://cbc.ca/news/canada/north/yukon-sourtoe-cocktail-griffiths-reunion-1.5294340", "downloaded_at": "2019-09-24 00:54:00.797014+00:00", "title": "Have we met? U.K. man reunited with amputated toe in Yukon bar | CBC News", "language": "en", "text": "He travelled a long way, for a drink — and not a particularly appetizing one.\n\nNick Griffiths, a U.K. man who lost three toes to frostbite last year in Yukon, returned to the territory on Monday to gulp back a special cocktail at a Dawson City bar.\n\nBobbing in the glass was one of his own dried, amputated digits.\n\n\"We've been saving the big toe for him to do,\" said Adam Gerle, general manager at the Downtown Hotel, home of the infamous \"Sourtoe Cocktail.\"\n\nThe tradition of slurping down a shot of whiskey spiked with a severed digit began in the 1970s when a local man, Captain Dick Stevenson, discovered an amputated toe while cleaning out a cabin and used it to found the Sourtoe Cocktail Club.\n\nThe Sourtoe Cocktail — a shot of whiskey with a toe bobbing in the glass — is a Dawson City tradition that began in the 1970s. (Philippe Morin/CBC)\n\nA drinker must let the toe touch their lips to join the club. There are now more than 100,000 members.\n\nGriffiths promised his toes to the hotel after he suffered severe frostbite in the 2018 Yukon Arctic Ultra, a long distance, backcountry race through the Yukon wilderness in midwinter. Several competitors that year were forced out of the race by frostbite — one man later lost both his feet.\n\nGriffiths's toes were removed after he returned to the U.K. He then dropped two of them in the mail to Dawson, as he wanted to see them \"recycled and reused.\"\n\n\"They arrived on my desk, regular mail,\" said Gerle. \"I don't know how legal that was, but they arrived.\"\n\nBig toe a 'beauty'\n\nThe Downtown Hotel usually has a few gnarled old toes in rotation, but is always on the lookout for others to add to the mix. A tongue-in-cheek newspaper ad asks for donations.\n\nGriffiths's gifted toes are \"kind of a big deal,\" Gerle said.\n\n\"We've been looking for a big toe for a few years, so everyone's pretty excited about it,\" Gerle said, ahead of Griffiths's visit on Monday.\n\nGriffiths mailed two of his toes to Dawson City from his home in Bolton, England, earlier this year, along with a note that read, 'Hope you get these bad boys OK.' (Submitted by Downtown Hotel)\n\nThe bar's \"Toe Master,\" Terry Lee, said it takes about six weeks stored in rock salt to properly dry an amputated digit.\n\n\"Nick's big toe is a BEAUTY,\" Lee wrote in a statement.\n\nThe bar planned to hold a special ceremony on Monday night to introduce Griffiths's big toe to bar patrons, and reunite the man from Bolton, England, with his erstwhile appendage.\n\n\"Doing the Sourtoe Cocktail with my own big toe will be a memory I will take to the grave,\" Griffiths said in a statement.", "description": "Nick Griffiths of Bolton, England, lost three toes to frostbite last year after participating in a backcountry race in Yukon. Now, one of his amputated toes is the key ingredient in Dawson City's famous \"Sourtoe Cocktail.\"", "authors": [], "top_image": "https://i.cbc.ca/1.5294742.1569278271!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/nick-griffiths.jpg", "published_at": "2019-09-23"}