{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7543309/Bachelors-Simone-Ormeshers-post-baby-body-days-giving-birth.html", "downloaded_at": "2019-10-07 00:20:28.623661+00:00", "title": "Bachelor's Simone Ormesher's post-baby body days after giving birth", "language": "en", "text": "Former Bachelor star Simone Ormesher welcomed her first child, daughter Gracie-Mae, on Wednesday.\n\nAnd on Saturday, the 27-year-old took to Instagram to share a candid mirror selfie of her post-baby body.\n\nSporting a grey crop top and navy briefs, the personal trainer told her followers that she will focus on 'clean eating and slowly getting back' into a fitness routine.\n\n'Clean eating and slowly getting back into my fitness routine': The Bachelor's Simone Ormesher, 27, shared a candid photo (left) of her post-baby body to Instagram on Saturday, three days after giving birth. Pictured on the right in August\n\n'PP [postpartum] life day three. It's definitely not easy but absolutely love being a mum, there is no feeling or love like that,' Simone addressed her followers.\n\nThe blonde went on to reveal her postpartum recovery, including sore breasts and hormonal shifts.\n\n'My life right now... Forgot to put breast pads in on the way home from the hospital, so here's me leaking milk,' she wrote.\n\nFirst-time mother: The personal trainer welcomed her first child, daughter Gracie-Mae, on Wednesday, and shared the happy news with her Instagram followers on Thursday\n\nBundle of joy: Sharing photos of the newborn, Simone wrote in part: 'Welcome to the world, Gracie-Mae Kathleen Thorne. She is more beautiful than we could have ever imagined'\n\n'Cried over 20 times today already as I am feeling so overwhelmed with love for our baby girl and struggling with the recovery, and my boobies hurt like a mother f***er.'\n\n'I have never experienced pain like this in my life. I will talk about my labour soon in a post but I just wanted to jump on here and let you know I will be tracking my recovery and my body journey.'\n\nSimone concluded by saying she will be 'taking it super easy and soaking in mum life for the next six weeks.'\n\nBy her side: Simone's partner Matt Thorne (left) was by her side when she went into labour on Wednesday\n\n'Focusing on clean eating and then [I] will slowly get back into my fitness routine once my mind and body is healed.'\n\nSimone announced her baby girl's arrival to Instagram on Thursday.\n\nSharing photos of the newborn, she wrote in part: 'Welcome to the world, Gracie-Mae Kathleen Thorne. She is more beautiful than we could have ever imagined.'\n\nSimone's partner Matt Thorne was by her side when she went into labour on Wednesday.\n\nOn September 24, Simone showed off her heavily pregnant frame in a photo shared to Instagram, alongside the caption: 'It feels like it's never going to end'\n\nOn September 24, she showed off her heavily pregnant frame in a photo shared to Instagram, alongside the caption: 'It feels like it's never going to end.'\n\nShe added: 'I'm experiencing some pains mainly when I'm walking around as [the baby] is now very low, so fingers crossed she won't be much longer.'\n\nSimone rose to fame in 2017, when she was a contestant on Matty Johnson's season of The Bachelor.\n\nShe was later invited to star on season one of Bachelor in Paradise, where she had a short-lived romance with Apollo Jackson.", "description": "Former Bachelor star Simone Ormesher welcomed her first child, daughter Gracie-Mae, on Wednesday.", "authors": ["Kristy Johnson For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/14/19362074-0-image-a-89_1570369608406.jpg", "published_at": "2019-10-06"}