{"pub": "cbc", "url": "https://cbc.ca/books/marianne-micros-s-eye-explores-the-myths-and-old-world-magic-within-her-greek-heritage-1.5333318", "downloaded_at": "2019-10-29 00:23:18.283604+00:00", "title": "Marianne Micros's Eye explores the myths and old world magic within her Greek heritage | CBC Books", "language": "en", "text": "Marianne Micros's collection of short fiction, Eye, draws from old world magic — particularly ancient Greece — to tell stories of nymphs, changelings and wise women through the ages. The evil eye, predictions and omens of death play a role in many of these stories, preying on the characters' relationships and fears.\n\nMicros is the author of poetry and short fiction. She used to teach English at the University of Guelph.\n\nEye is a finalist for the Governor General's Literary Award for fiction. The winners will be announced on Oct. 29, 2019.\n\nMicros spoke to CBC Books about writing Eye.\n\nThose old stories\n\n\"These stories were all written at different times in my life. I am of Greek heritage and I've lived in Greek villages where there still exists a belief in myths and superstition. I told these stories much like how the original myths were told. But I did update and modernize the stories.\n\nThe cover of the book actually shows the evil eye amulet that people still wear for protection. I was fascinated by that. I'm fascinated by folk tales, mythology and magic. - Marianne Micros\n\n\"The cover of the book actually shows the evil eye amulet that people still wear for protection. I was fascinated by that. I'm fascinated by folk tales, mythology and magic.\"\n\nThe meaning of myth\n\n\"Myths, unlike other forms of literature from earlier times, deal with real issues of the people, not just the upper classes. This is perhaps why they have endured. Some of these people, even if they didn't write, told stories orally. I find that a lot of stories were told by mothers to their daughters, to help them with the growing up process. I have a lot of mother-daughter stuff going on in these stories, in addition to family relationships, the loss of women's power and the old ways.\n\nI'm thinking a lot about what those old stories have tell us about women. - Marianne Micros\n\n\"That's why I focused a lot on those women who were the healers in the village. People would go to them for help but then after a while nobody believed in them anymore. I'm thinking a lot about what those old stories have to tell us about women.\"\n\nMother and child reunion\n\n\"I wanted to bring out what was in the background of these myths to explore family dynamics such as sibling rivalry and mother-child issues.The story of the birthday gift is based on my mother, believe it or not.\n\n\"I made up a lot of things around it but I wanted to look at the way superstition and ghosts still exist in our minds — and how they carry through and are changed over the years.\"\n\nThe power of woman\n\n\"There was something about the spontaneity of life in Greece back in the day I am drawn to. I want to convey that feeling, in addition to exploring the meaning behind these old stories and folk tales. I want to convey something about women right through the ages and some of the beliefs that help women, like the belief in the Virgin Mary.\n\nThe concept of mothers is a big deal for me, as is exploring the old in the new magic that exists around us. - Marianne Micros\n\n\"It can be helpful and consoling to look to a mother figure as a woman. The concept of mothers is a big deal for me, as is exploring the old and the new magic that exists around us.\"\n\nMarianne Micros's comments have been edited for length and clarity.", "description": "Eye is a finalist for the Governor General's Literary Award for fiction. The winners will be announced on Oct. 29, 2019.", "authors": [], "top_image": "https://i.cbc.ca/1.5303342.1569875583!/fileImage/httpImage/image.png_gen/derivatives/16x9_620/eye-by-marianne-micros.png", "published_at": "2019-10-28"}