{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7629575/Bundaberg-man-purchased-pot-using-dead-mothers-12-000-inheritance.html", "downloaded_at": "2019-10-30 14:32:26.060458+00:00", "title": "Bundaberg man purchased pot using his dead mother's $12,000 inheritance", "language": "en", "text": "A pothead was caught with 1.5 kilograms of marijuana after he spent his dead mother's $12,000 inheritance on the drug.\n\nJim Christodoulou, 60, was found by police with 1.422 kilograms of cannabis, $2,340 in cash and scales at his home in the Bundaberg region, Queensland, in December 2018.\n\nHe pleaded guilty in September and was sentenced to nine months in jail, according to Sunshine Coast Daily.\n\nJim Christodoulou (pictured), 60, was found by police with 1.422 kilograms of cannabis, $2,340 in cash and scales at his home in December 2018\n\nChristodoulou claimed the sentence was excessive as he never sold the drug, saying he only used it to ease back pain.\n\nHe said he had been using the drug for 20 years after fracturing his back.\n\nThe man denied that the drugs were to be sold for profit. He had no history of drug charges in the past.\n\nChristodoulou claimed the sentence was excessive as he never sold the drug - he only used it to ease back pain following a horse riding accident 20 years ago (stock)\n\nDespite Christodoulou's denials the judge - William Everson - did not believe the drugs were solely for personal use.\n\nChristodoulou was sentenced last month to nine months in prison - however he appealed the length of the sentence because he believed it was excessive.\n\nThe court denied the appeal this week.", "description": "Jim Christodoulou, 60, was found with 1.422 kilograms of pot in his Bundaberg home in 2018. He bought the drugs using his dead mother's inheritance money.", "authors": ["Claudia Poposki For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/09/20366406-0-image-a-5_1572427570202.jpg", "published_at": "2019-10-30"}