{"pub": "realclearpolitics", "url": "https://msn.com/en-us/news/politics/giulianis-ukraine-team-in-search-of-influence-dirt-and-money/ar-AAIBc2s", "downloaded_at": "2019-10-11 19:40:11.513354+00:00", "title": "Giuliani’s Ukraine Team: In Search of Influence, Dirt and Money", "language": "en", "text": "© Erin Schaff for The New York Times Rudolph W. Giuliani, President Trump’s personal lawyer, pushed the Ukrainian government to investigate former Vice President Joseph R. Biden Jr. and his son Hunter Biden.\n\nWASHINGTON — When Rudolph W. Giuliani set out to dredge up damaging information on President Trump’s rivals in Ukraine, he turned to a native of the former Soviet republic with whom he already had a lucrative business relationship.\n\nLev Parnas, a Ukrainian-American businessman with a trail of debts and lawsuits, had known Mr. Giuliani casually for years through Republican political circles. Last year, their relationship deepened when a company he helped found retained Mr. Giuliani — associates of Mr. Parnas said he told them he paid hundreds of thousands of dollars — for what Mr. Giuliani said on Thursday was business and legal advice.\n\nSign Up For the Morning Briefing Newsletter\n\nEven as he worked with Mr. Parnas’s company, Fraud Guarantee, Mr. Giuliani increasingly relied on Mr. Parnas to carry out Mr. Trump’s quest for evidence in Ukraine that would undercut the legitimacy of the special counsel’s investigation into Russia’s interference on his behalf in the 2016 election and help him heading into his 2020 re-election campaign.\n\n\n\nMr. Giuliani dispatched Mr. Parnas and an associate, Igor Fruman, a Belarusian-American businessman, to Kiev, the Ukrainian capital, where, despite fending off creditors at home, BuzzFeed reported, they ran up big charges at a strip club and the Hilton International hotel. Their mission was to find people and information that could be used to undermine the special counsel’s investigation, and also to damage former Vice President Joseph R. Biden Jr., a prospective Democratic challenger to Mr. Trump.\n\nOver the past year, the two men connected Mr. Giuliani with Ukrainians who were willing to participate in efforts to push a largely unsubstantiated narrative about the Bidens. They played a key role in a campaign by pro-Trump forces to press for the removal of the United States ambassador to Ukraine on the grounds that she had not shown sufficient loyalty to the president as he pursued his agenda there.\n\nThey met regularly with Mr. Giuliani, often at the Trump International hotel in Washington. And all the while, they were pursuing their own business schemes and, according to an indictment unsealed on Thursday, illegally funneling campaign contributions in the United States in the service of both their political and business activities.\n\nThe indictment, along with interviews and other documents, show Mr. Parnas, Mr. Fruman and their associates as somewhat hapless operators, scrambling recklessly to use their new connections to the highest levels of American politics to seek financial gain while guiding Mr. Giuliani, the former New York City mayor, into a Ukrainian political culture rife with self-dealing and ever-shifting alliances.\n\nThe indictment provided new details about the dealings of Mr. Parnas and Mr. Fruman, as well as a pair of associates, including David Correia, who with Mr. Parnas helped found Fraud Guarantee, the fraud prevention and mitigation company that retained Mr. Giuliani. The four men were charged with campaign finance violations related to their efforts to enlist public officials in their moneymaking efforts and their political efforts in Ukraine.\n\nThe indictment does not name or identify Mr. Giuliani or Mr. Trump. But it helps show how Mr. Giuliani, who was retained by Mr. Trump as a personal lawyer to fend off one challenge to his presidency — the investigation by the special counsel, Robert S. Mueller III — helped steer his client into another: dealings with Ukraine that are now at the heart of the impeachment inquiry by House Democrats.\n\nThe congressional committees overseeing the impeachment inquiry have subpoenaed Mr. Giuliani for records related to his efforts in Ukraine, including records related to Mr. Parnas, Mr. Fruman and Semyon Kislin, another Ukrainian-born businessman.\n\nMr. Parnas and Mr. Fruman had been asked to appear before House investigators this week, but declined to appear. And on Thursday, the congressional committees issued subpoenas demanding they produce documents by Wednesday, while signaling that the committees still expected the pair to testify to Congress.\n\nThe two men did get something useful for their Ukrainian efforts from Pete Sessions, then a Republican member of Congress from Texas, who is not identified in the indictment. It says that after making substantial campaign donations to him, Mr. Parnas asked Mr. Sessions for help last year in pressing the Trump administration to remove the United States ambassador to Ukraine, Marie L. Yovanovitch. Mr. Sessions subsequently wrote a letter to Secretary of State Mike Pompeo criticizing Ms. Yovanovitch and seeking to have her dismissed.\n\nMr. Parnas had told associates that she was not open to his proposals related to the lucrative gas business in Ukraine, where Mr. Parnas pitched a natural gas deal to the chief executive of Naftogaz, as The New York Times reported last month.\n\nMs. Yovanovitch had also come under fire from a Ukrainian prosecutor, Yuriy Lutsenko, who was connected to Mr. Giuliani by Mr. Parnas and Mr. Fruman and played a key role in Mr. Giuliani’s efforts to promote investigations into Mr. Trump’s rivals.\n\nWhile the indictment did not identify any officials by name, it said that Mr. Parnas, in his effort to oust Ms. Yovanovitch, acted, “at least in part, at the request of one or more Ukrainian government officials.”\n\nMr. Giuliani also said he provided legal advice to Mr. Parnas and Mr. Fruman after their efforts in Ukraine brought them into conflict with a powerful oligarch, Ihor Kolomoisky.\n\nMr. Kolomoisky said in interviews in the Ukrainian news media that Mr. Parnas and Mr. Fruman traveled to see him in Israel in April, ostensibly to talk about their plans to sell gas to Ukraine. But, he said, the two men then pushed him to arrange a meeting between Mr. Giuliani and Ukraine’s newly elected president, Volodymyr Zelensky. Mr. Giuliani had been seeking to press Mr. Zelensky to agree to investigate the Bidens and Ukraine’s role in the 2016 election, and had been working with Mr. Parnas to lay the groundwork for the effort, as The Times first reported in May.\n\nUpon returning to Ukraine, Mr. Kolomoisky threatened in May to expose Mr. Parnas and Mr. Fruman. Mr. Giuliani, in turn, posted on Twitter that the oligarch had “defamed” Mr. Parnas and Mr. Fruman, “and I have advised them to press charges.” He also warned Mr. Zelensky not to surround himself with allies of Mr. Kolomoisky.\n\nMr. Parnas, Mr. Fruman and Mr. Giuliani were frequently spotted together over the past year at the Trump International hotel in Washington, and were overheard discussing politics and energy projects, including a methane initiative in Uzbekistan. Mr. Giuliani and his associates were to be paid at least $100,000 for the project, on which Mr. Parnas offered advice.\n\nThe project did not pan out, Mr. Giuliani said.\n\nMr. Parnas said in an interview last month that he and Mr. Fruman were self-financing their efforts on behalf of Mr. Giuliani’s political work in Ukraine and that those “have nothing to do with our business.”\n\nHe added, “My only business with Giuliani was a long time ago,” and involved an insurance company that Mr. Parnas suggested he owned that Mr. Giuliani “offered some advice on.”\n\nIn an interview on Thursday, Mr. Giuliani at first seemed to acknowledge having advised Fraud Guarantee in 2018, then backtracked.\n\n“I can’t acknowledge it’s Fraud Guarantee, I don’t think,” he said.\n\n“I can acknowledge I gave them substantial business advice,” he said, adding that one of his companies trains institutional customers in security work, including “how to investigate crimes, from murder to terrorism to fraud.” He said that “most of it is subdivisions of government, but every once in a while it is a private enterprise.”\n\nLate last month, he seemed to minimize the campaign finance issues facing Mr. Parnas and Mr. Fruman, saying in an interview, “I referred them to a campaign finance expert, who pretty much resolved it.”\n\nOn Thursday, Mr. Giuliani said he did not regret working with Mr. Parnas and Mr. Fruman in Ukraine. “I have to presume they’re innocent,” he said, adding: “There are a lot of motives going on trying to smear people, so I wouldn’t say that I regret it, no. Who else would I have turned to?”\n\nIn April 2018, Mr. Parnas and Mr. Fruman incorporated a company called Global Energy Producers ostensibly as a vehicle to engage in the trade of liquefied natural gas — a commodity American officials have long urged Ukraine to buy from the United States.\n\nIn weeks, the company attracted notice in Republican finance circles with major donations to committees supporting Mr. Trump and his allies. It gave $325,000 to America First Action, a pro-Trump super PAC; $50,000 to a political action committee affiliated with the Trump-endorsed candidate for Florida governor in 2018, Ron DeSantis, and $15,000 to a super PAC supporting the 2018 Senate campaign of the West Virginia attorney general, Patrick Morrisey.\n\nThe donation spree prompted legal filings by a former business partner of Mr. Parnas who was trying to collect more than $510,000 from Mr. Parnas from a 2016 federal judgment.", "description": "When Rudolph W. Giuliani set out to dredge up damaging information on President Trump’s rivals in Ukraine, he turned to a native of the former Soviet republic with whom he already had a lucrative business relationship. Lev Parnas, a Ukrainian-American businessman with a trail of debts and lawsuits, had known Mr. Giuliani casually for years.", "authors": [], "top_image": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AAIBlJy.img?h=169&w=300&m=6&q=60&o=f&l=f&x=681&y=206", "published_at": "2019-10-11"}