{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/daniel-james-insists-not-knocked-20574069", "downloaded_at": "2019-10-13 23:42:20.897149+00:00", "title": "Daniel James insists he was not knocked out during Wales' draw with Croatia", "language": "en", "text": "Get the biggest Manchester United FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nManchester United winger Daniel James has denied suggestions he lost consciousness after a nasty collision during Wales' Euro 2020 qualifier against Croatia on Sunday night.\n\nThe 21-year-old was left sprawled on the ground after taking a blow to the head during an aerial challenge with Croatia's Domagoj Vida in the first half of the 1-1 draw at Cardiff City Stadium.\n\nJames was quickly treated by medical staff and was able to make his way off the field before returning to the pitch a few minutes later and playing the remainder of the match.\n\nAlthough there were concerns over the Red Devils' winger, he explained he had not been knocked out by the first-half challenge.\n\n\"There was a few tackles flying in but you always expect it in these games,\" he told Sky Sports after the match.\n\n(Image: EMPICS Sport)\n\n(Image: Getty Images)\n\n\"I'm fine. I think he just caught me in the head but I didn't get knocked out fortunately.\"\n\nThe decision to allow James to continue playing just a few minutes after going down raised concerns among many of those watching the game, including former Hull City midfielder Ryan Mason .\n\nMason, who was forced to retire after fracturing his skull against Chelsea in 2017, tweeted : \"Daniel James was just knocked out unconscious! Yet 3 minutes later he has been allowed back onto the pitch.\"\n\nHowever, Wales boss Ryan Giggs also played down the incident, insisting that James had passed all the necessary concussion protocols.\n\n(Image: Getty Images)\n\nHe said: \"Daniel James went down and stayed down with a bit of acting.\n\n\"But the medical staff went over, he was compos mentis and we did all the checks at half-time and he was fine.\"\n\nAfter falling behind to an early goal from Nikola Vlasic in the first 10 minutes of the Group E clash, Gareth Bale was able to get Wales back on level terms on the stroke of half-time to secure a draw for Giggs' side.\n\nThe point gives Wales hope of qualifying for Euro 2020 when the final round of matches take place in November.", "description": "The Manchester United winger was involved in a head collision with Domagoj Vida during the 1-1 draw", "authors": ["Hassan Rashed", "Image", "Empics Sport", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20573276.ece/ALTERNATES/s1200/0_Wales-v-Croatia-UEFA-Euro-2020-Qualifier.jpg", "published_at": "2019-10-13"}