{"pub": "washingtonpost", "url": "https://washingtonpost.com/photography/2019/09/04/our-future-is-being-determined-lab-out-west-revisiting-cult-classic-photojournalism-exploring-california-s", "downloaded_at": "2019-09-04 23:48:13.008984+00:00", "published_at": "2019-09-04", "title": "‘Our future is being determined in the lab out West’: Revisiting a classic exploring California in the 1960s", "language": "en", "text": "Photo Editor\n\n\n\nBrucemas Day, Venice. From \"California Trip,\" reissued by Anthology Editions. (Dennis Stock/Magnum Photos)\n\n\n\nNovato. From \"California Trip,\" reissued by Anthology Editions. (Dennis Stock/Magnum Photos)\n\nUnless you are a fan of photojournalism and acquainted with its history, you may not recognize the name Dennis Stock. But if you are at all curious about American pop culture, you probably know at least one of his photographs. Stock made the now-iconic photograph of James Dean, bundled up in a black coat with a cigarette dangling from his lips, walking through a damp Times Square in 1955.\n\nStock also documented other celebrities, including Billie Holiday, Duke Ellington, Audrey Hepburn and Marlon Brando. In 1968, Stock headed toward California, where he would make the photographs that would form another classic work, the book “California Trip.”\n\n1968 was a year of turmoil for the United States, a time of social, cultural and political upheaval. For five weeks, Stock traveled up and down the California highways, documenting the counterculture. The hippie scene was at its peak. California was then, and still is, a place many Americans looked to as a hub of innovation and progression. Now, some 50 years later, reading Stock’s introduction to “California Trip” still seems of the moment:\n\n“Every idea that Western man explores in his pursuit of the best of all possible worlds will be searched at the head lab — California. Technological and spiritual quests vibrate throughout the state, intermingling, often creating the ethereal. … Our future is being determined in the lab out West.”\n\nThose words seem to ring true for us even today, don’t they?\n\n“California Trip” has long been considered an iconic work, but until now, it has been out of print and too expensive for most people. But thanks to Anthology Editions, an independent book publisher in Brooklyn, it is back in a reprint that is faithful to the original. You can find out more about the book and how to purchase it on the publisher’s website, here.\n\n\n\nLake Tahoe. From \"California Trip,\" reissued by Anthology Editions. (Dennis Stock/Magnum Photos)\n\n\n\nCulver City. From \"California Trip,\" reissued by Anthology Editions. (Dennis Stock/Magnum Photos)\n\n\n\nMars Station, Goldstone. From \"California Trip,\" reissued by Anthology Editions. (Dennis Stock/Magnum Photos)\n\n\n\nSan Diego. From \"California Trip,\" reissued by Anthology Editions. (Dennis Stock/Magnum Photos) (Dennis Stock / Magnum Photos/Dennis Stock / Magnum Photos)\n\n\n\nVenice. From \"California Trip,\" reissued by Anthology Editions. (Dennis Stock/Magnum Photos) (Dennis Stock / Magnum Photos/Dennis Stock / Magnum Photos)\n\n\n\nPlaya del Rey. From \"California Trip,\" reissued by Anthology Editions. (Dennis Stock/Magnum Photos)\n\nIn Sight is The Washington Post’s photography blog for visual narrative. This platform showcases compelling and diverse imagery from staff and freelance photographers, news agencies and archives. If you are interested in submitting a story to In Sight, please complete this form.\n\nMore on In Sight:\n\nSurreal photos from a two-year odyssey experiencing rural Australia’s Bachelor and Spinster Balls\n\nThese twin brothers from Buenos Aires have never lived apart since the day they were born\n\nThese high school photographers crafted a stunning account of their lives in Appalachian Ohio", "description": "A reprint of photographer Dennis Stock's \"California Trip\" makes the classic book available again.", "authors": ["Kenneth Dickerman", "Photo Editor"], "top_image": "https://www.washingtonpost.com/resizer/W0qA3UoaSmJ2EuH2tsXY3Ra3Xmw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/SOQ5ABWOOYI6TJRABKIWK3L5WY.jpg"}