{"pub": "cnbc", "url": "https://cnbc.com/2019/09/13/on-a-sunny-day-this-german-factory-runs-completely-on-solar-power.html", "downloaded_at": "2019-09-13 11:09:26.652850+00:00", "title": "On a sunny day this German factory runs completely on solar power", "language": "en", "text": "Multinational tech firm ABB claims to have opened a factory that can generate all of its energy needs via solar power.\n\nIn May 2019, Zurich-headquartered ABB unveiled what it described as a CO2-neutral factory in the town of Luedenscheid, Germany. The site employs around 800 people to manufacture electrical equipment such as power sockets and switchers.\n\nThe facility, which is operated by ABB subsidiary Busch-Jaeger, is supported by a huge solar photovoltaic system that has been installed over its car park. According to ABB, it can produce 1100 megawatt hours of power each year, enough to meet the annual needs of 340 homes.\n\n\"On a sunny day this location doesn't need to be connected to the grid,\" Tarak Mehta, president of ABB's electrification business, told CNBC's \"Sustainable Energy.\"\n\nCombined with a cogeneration plant, the factory site generates roughly 14% more energy than it needs, so surplus power is fed back to the grid. A battery system with a capacity of 275 kilowatt hours provides energy storage.\n\n\"What we want to do with our strategy is to demonstrate for our customers how … you go to a carbon neutral location, where there are eight hundred people working, a manufacturing site which consumes a lot of energy but at the same time can be sustainable,\" Mehta added.\n\nAccording to ABB, the technology at the site will help to save around 630 tonnes of carbon dioxide each year.\n\n\"The system here in Luedenscheid actually conserves resources by integrating the renewables and the energy that comes from the photovoltaic cells and linking back together with the battery storage system,\" Oliver Iltisberger, managing director of Smart Buildings at ABB, said.", "description": "Technology and innovation are changing the way factories operate.", "authors": ["Anmar Frangoul"], "top_image": "https://image.cnbcfm.com/api/v1/image/106126145-1568296192486luedenscheid_mission_to_zero.jpg?v=1568296251", "published_at": "2019-09-13"}