{"pub": "politico", "url": "https://politico.com/story/2019/09/15/moderate-democrats-pelosi-impeachment-1495832", "downloaded_at": "2019-09-15 14:30:43.515462+00:00", "title": "Moderate Democrats warn Pelosi of impeachment obsession", "language": "en", "text": "House Speaker Nancy Pelosi has worked to tamp down speculation about impeachment in recent news briefings, shifting to discussions of the House Democrats’ bills in progress. | Chip Somodevilla/Getty Images congress Moderate Democrats warn Pelosi of impeachment obsession Vulnerable House Democrats fear the party's drive toward impeachment will undercut them in 2020.\n\nA day before the House Judiciary Committee took its biggest step yet toward impeachment last week, moderate Democratic Rep. Anthony Brindisi voiced his frustrations directly to Speaker Nancy Pelosi.\n\nThe battleground freshman told Pelosi and other leaders at a closed-door meeting that he and other centrists feared that talk of impeaching President Donald Trump was threatening to swamp the Democratic agenda, according to multiple people in the room.\n\nStory Continued Below\n\n“It’s very frustrating for me — someone coming from a district that was one of the districts that helped get us into the majority — having so much focus on things like impeachment or other issues that are divisive,” Brindisi said in an interview, adding that he’s been talking to fellow swing-district freshmen who have similar concerns with the fall agenda. “We should be focusing on the kitchen table issues.”\n\nIn the same meeting, another moderate in the room, Rep. Stephanie Murphy (D-Fla.), pointed to alarming polling from the Democrats’ campaign arm, which showed that voters think the party is “prioritizing impeachment over other issues,” according to an internal summary obtained by POLITICO.\n\nPelosi responded by saying she was keenly aware of their concerns, and reiterated that the caucus does not have 218 votes for impeachment. And she stressed that only the full House has the power to launch proceedings — a statement that seems to conflict with the Judiciary Committee’s position that it is currently engaged in an impeachment investigation.\n\nPOLITICO Playbook newsletter Sign up today to receive the #1-rated newsletter in politics Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nThe comments by Brindisi and Murphy are the latest sign of the mounting frustration among the Democratic caucus’ small, but mighty, moderate wing. Since returning from the summer break, centrist Democrats have been venting — to each other and directly to Pelosi, House Majority Leader Steny Hoyer and Judiciary Chairman Jerry Nadler — about what they fear the public sees as a fixation on impeachment that could undermine their reelection prospects in 2020, multiple lawmakers and aides said.\n\nPelosi’s efforts to tamp down talk of impeachment, expressed in private and in public, so far haven’t appeased the caucus’ centrist wing.\n\nAnother vulnerable freshman, Rep. Max Rose, gave the same warnings about impeachment in a private meeting with Nadler. A few days later, Rose unleashed his frustrations publicly with an op-ed in his hometown paper, cautioning that Democrats are “in danger of losing the trust of the American people” with its unrelenting focus on Trump.\n\n“I’m doing what I think is the right thing to do,” Rose said in an interview, adding that no single incident propelled him to write the op-ed. “I want to see this party — and I know it has it in it — get to work passing substantive infrastructure and health care bills by the end of the year.”\n\nThe centrists’ aversion to impeachment, however, is just as strong as progressives’ insistence that failing to impeach Trump would be a dereliction of duty — a direct clash that will only further divide the caucus and test Democratic leaders through the 2020 election.\n\n“We have to do our job,” Rep. Alexandria Ocasio-Cortez (pictured) told reporters last week. | J. Scott Applewhite/AP Photo\n\n“We have to do our job,” Rep. Alexandria Ocasio-Cortez told reporters last week. “I want to see every Republican go on the record and knowingly vote against impeachment of this president, knowing his corruption, having it on the record so that they can have that stain on their careers for the rest of their lives.”\n\nMany Democratic moderates say they recognize that Pelosi and her deputies have tried to contain the impeachment furor from becoming all-consuming on Capitol Hill.\n\nBut as momentum builds — in part because of Nadler’s committee vote to approve guidelines for his probe — some lawmakers privately wonder whether Democratic leadership has a strategy to pull them out of the messaging mess they’ve got themselves in.\n\nPelosi has worked to shut down talk about impeachment, both in her news briefings and in some private meetings this week, pivoting instead to the caucus’ bills in progress.\n\nBut Hoyer, her top deputy, fueled headlines after he was forced to walk back comments on the subject after telling reporters the House was not yet in an impeachment investigation — putting him at odds with Nadler’s phrasing.\n\nIt was exactly the kind of media circus Democrats sought to avoid in their first week back from the long summer recess.\n\nDemocrats from hard-fought seats, including the 31 districts held by Democrats that Trump won in 2016, say they fear the investigations are overtaking their work on other issues.\n\nFor instance, the same week that the Judiciary Committee voted to advance the House investigations into Trump, the panel also approved some of the strongest gun measures in a generation in the wake of this summer’s deadly spate of shootings.\n\nHouse Majority Leader Steny Hoyer. | Win McNamee/Getty Images\n\nHoyer, too, has heard directly from some moderates in the caucus who worry that the House investigations would drown out their work on health care and economic issues throughout the fall, according to a senior Democratic aide.\n\n“The fear is that you will be exclusively focused on it, to the exclusion of all the other things we need to do in the Congress of the United States,” Hoyer told reporters last week.\n\nMany House centrists, particularly members of the Blue Dog Coalition, have sought to pivot from talking about Trump’s alleged corruption and obstruction to a piece of the Mueller report that’s a lot less controversial: election security.\n\nThe Blue Dog Coalition offered a kind of counterprogramming last Thursday — timed just hours after the Judiciary Committee’s vote — with nearly a dozen members taking part in interviews, floor speeches or social media posts to help nudge the narrative away from impeachment and toward the need to safeguard elections.\n\n“I certainly think that the election security elements of the Mueller report have not been given a due amount of coverage and awareness that’s necessary,” Murphy told reporters Thursday, when asked about the event coinciding with the Judiciary vote.\n\nFor months, moderates have sidestepped the slow march toward supporting impeachment within their caucus. But the number of Democratic holdouts has been shrinking, and less than 40 percent of the caucus is now opposed or undecided, many out of deference to Pelosi.\n\nThat only complicates Democrats’ struggle to communicate their agenda to the public.\n\nInternal polling conducted for the Democratic Congressional Campaign Committee in August found that 54 percent of voters nationally think the party’s top focus in Congress is investigating Trump — though just 10 percent believe that should be the priority.\n\nIn good news for the party, the poll found that Democrats have an 8-point advantage in the generic congressional ballot in 2020, with record enthusiasm ahead of the next election.\n\nStill, it said voters’ perceptions are “not aligning with the issues voters said were most important for Congress to address,” a perception that has remained unchanged for months, according to a Democratic official familiar with the polling.\n\nAnd some Democrats says they can’t blame the public for the perception.\n\n“If I wake up every morning and go to bed every night, and look at the TV during the day, and it says impeachment, impeachment, impeachment, investigation. Then what is the American public going to think?” Rep. Tom O’Halleran, co-chair of the House Blue Dog Coalition, said in an interview.\n\n“It’s kind of a Beltway process here. ‘Everything’s about impeachment,’” the Arizona Democrat said, stressing the House’s other work on items like the recent two-year budget deal. “Maybe that message isn’t getting out there in the way it needs to get out there. I know I can’t do it.”\n\nLaura Barrón-López contributed to this report.\n\n", "description": "Vulnerable House Democrats fear the party's drive toward impeachment will undercut them in 2020.", "authors": ["Sarah Ferris"], "top_image": "https://static.politico.com/fb/59/4c1669f041218c9e6c747e05827a/190913-pelosi-gty-773.jpg", "published_at": "2019-09-15"}