{"pub": "cbc", "url": "https://cbc.ca/sports/hockey/nhl/nhl-leafs-sharks-recap-oct-25-1.5336301", "downloaded_at": "2019-10-26 02:11:01.560419+00:00", "title": "CBC Sports", "language": "en", "text": "Morgan Rielly scored the winner with 5:29 left in the third period as the Toronto Maple Leafs defeated the San Jose Sharks 4-1 on Friday night.\n\nIlya Mikheyev, with a goal and an assist, Jake Muzzin and Auston Matthews also scored for Toronto (6-4-2). Frederik Andersen made 14 saves.\n\nKevin Labanc replied for San Jose (4-6-1), which got 25 stops from Martin Jones.\n\nRielly took a pass from William Nylander off the rush and buried his third of the season upstairs on Jones as the Leafs picked up just their second victory in the last five games.\n\nTied 1-1 through 40 minutes, Toronto couldn't do anything on two power plays early in the third — falling to 0 for 5 on the night — before Andersen had to make a good pad save on Evander Kane at the other end.\n\nMatthews then ripped a shot off the rush with under eight minutes to play that Jones smothered before Mitch Marner stickhandled around the Sharks goalie on the next shift, but couldn't tuck his effort home.\n\nAfter the Leafs pushed ahead 2-1, the Sharks pulled Jones for the extra attacker. Kasperi Kapanen inexplicably missed the empty net from in tight, but Mikheyev iced it with 47.5 seconds left as Toronto breathed a huge sigh of relief.\n\nMatthews then scored his ninth with Jones back in the San Jose net to make it 4-1.\n\nDown 1-0 late in the second period in front of an increasingly restless crowd of 19,102 at Scotiabank Arena, the nervous-looking Leafs pulled even with 1.9 seconds left on the clock when Muzzin floated down in front of the Sharks' net and buried a feed from Jason Spezza.\n\nMatthews takes big hit from Dillon\n\nMatthews took a big hit from San Jose defenceman Brenden Dillon midway through the second period after delivering a pass at the offensive blue line. The Toronto centre finished his shift and drew a tripping penalty, but headed to the locker room after returning to the bench.\n\nMatthews shaken up by this hit from Dillon. <a href=\"https://twitter.com/hashtag/LeafsForever?src=hash&ref_src=twsrc%5Etfw\">#LeafsForever</a> <a href=\"https://t.co/QSkKETTXkh\">pic.twitter.com/QSkKETTXkh</a> —@LeafsNews\n\nMatthews, who returned for the third period, was inches away from scoring earlier in the second, but the puck briefly nestled against the post on the goal line before San Jose's net was dislodged.\n\nThe Sharks suited up for their second game in as many nights following Thursday's 4-2 victory in Montreal, while the Leafs played the front end of their third back-to-back already this season. Toronto visits the Canadiens on Saturday.\n\nFriday marked the return of San Jose's Patrick Marleau to Toronto after he signed with his old team earlier this month. The 40-year-old winger spent the last two seasons with the Leafs, and developed a strong relationship with Matthews and Marner.\n\nBut Marleau, who is in his 20th season with the Sharks, and his US$6.25-million salary was a casualty of Toronto's cap crunch this summer that was ironically largely the result of Marner needing a big-money contract extension.\n\nPatrick Marleau warms up before his first game back against his former teammates. (Hans Deryk/The Canadian Press)\n\nMarleau waived his no-movement clause to facilitate a trade with the Carolina Hurricanes, who tried to convince him to join the Eastern Conference finalists, but his heart was in San Jose and was bought out. The Sharks didn't initially see a fit, but agreed to a one-year deal at the league minimum on Oct. 9.\n\nToronto — which entered Friday a scuffling 1-2-1 over its last following a string of undisciplined performances — wanted to get off to a fast start and could have easily gone up a goal or two before the Sharks opened the scoring.\n\nMatthews and Nylander had good chances on an early Leafs power play before Rielly and Alexander Kerfoot both came close on Jones at even strength.\n\nBut the visitors weathered that storm and got on the board midway through the first when Labanc tipped a Brent Burns point shot past Andersen.\n\nSpezza had a terrific opportunity off a nice setup from Kapanen to grab his first goal with the Leafs, but Jones was there to deny the veteran centre.\n\nMarleau gets a tribute\n\nA native of Aneroid, Sask., Marleau entered Friday with six points (two goals, four assists) through six contests this season, and coincidentally played his 1,500th career game in a San Jose uniform.\n\nMarleau, who was honoured with a video tribute during the first television timeout at Scotiabank Arena, has now suited up 1,663 times in the NHL with the Sharks and Leafs.\n\nThank you Patrick, for everything you did for our Leafs Nation family, and making us a part of yours. <a href=\"https://t.co/c8R7j42g2d\">pic.twitter.com/c8R7j42g2d</a> —@MapleLeafs\n\nNotes: Marleau is the seventh player in NHL history to dress for 1,500 games with one team. He sits 103 games back of tying Gordie Howe's all-time NHL record of 1,767...Marleau told reporters a couple hours before puck drop he and Marner discussed the latter's contract negotiations with Toronto this summer. Marleau also said he advised Matthews about the charge against the then-21-year-old centre for disorderly conduct and disruptive behaviour stemming from an alleged incident in his hometown of Scottsdale, Ariz., back in May — something the Leafs didn't learn of until late September. None of the allegations against Matthews have been tested in court.", "description": "Jake Muzzin, Morgan Reilly, Ilya Mikheyev, and Auston Matthews each scored one to lead the Leafs 4-1 against the San Jose Sharks on Friday.", "authors": [], "top_image": "https://i.cbc.ca/1.5336667.1572052095!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/sharks-maple-leafs-mikheyev-and-muzzin.jpg", "published_at": "2019-10-26"}