{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/pa/article-7596521/Brexit-decision-postponed-judges-PM-fully-complies-Benn-Act.html", "downloaded_at": "2019-10-21 13:32:23.148275+00:00", "title": "Brexit decision postponed by judges to see if PM `fully...", "language": "en", "text": "Judges at Scotland’s highest civil court are waiting to see if Boris Johnson fully complies with the Benn Act in seeking a Brexit extension before making a decision on whether he has broken the law.\n\nAt the hearing before the Court of Session in Edinburgh on Monday, it was accepted the Prime Minister had observed part of the legislation by sending the request by letter to the EU.\n\nThis is despite the fact he did not sign it and also sent a second letter – which he did put his name to – that said a delay would be a mistake.\n\nAidan O´Neill QC described the way Boris Johnson sent the Brexit request as `unusual´ (Jane Barlow/PA)\n\nPetitioners including businessman Dale Vince, Jolyon Maugham QC and SNP MP Joanna Cherry QC have now been granted a request by three of Scotland’s most senior judges to postpone any decision to see if the terms of the Act have been fully carried out.\n\nThis includes waiting to see if any potential extension granted by the EU is accepted by the Prime Minister.\n\nAidan O’Neill QC, representing the petitioners, described the manner in which the letter was sent as “unusual”.\n\nHe added: “We don’t know when the EU will come back with a response for the request.\n\n“So it depends on it coming back and ensuring the Prime Minister carried out the duties imposed upon him within the Benn Act.”\n\nMr O’Neill claimed there was a breach of the principle that Mr Johnson would not try to frustrate the purposes of the legislation, but this would also be for the court to decide at a later date.\n\nJudge Lord Brodie said: “I think it is fair to say it was a very carefully written letter.”\n\nMr O’Neill said the Prime Minister was “sailing very close to the wind” and “not entirely in accord with spirit” of the Act by sending the second letter, in which he said an extension would “damage” the UK’s interests.\n\nI am delighted with the Court's decision. It is a pity to have to say it, but this is not a Prime Minister who can be trusted to comply with the law. And because he cannot be trusted he must be supervised. — Jo Maugham QC (@JolyonMaugham) October 21, 2019\n\nThe case could also be made null if Parliament accepts the withdrawal deal brought to them by the Prime Minister.\n\nDavid Johnston QC, representing the UK Government, argued the appeal should be dismissed as the letter had been sent.\n\nThe court said it would return to the matter at a later date.\n\nDuring the case’s first hearing on October 9, the Government’s lawyers assured the court Mr Johnson would adhere to the law in writing and before the judges – despite the Prime Minister’s repeated public declarations he would never request an extension.\n\nThe case was then postponed until after the deadline for the extension letter to be sent under the terms of the legislation.\n\nJudge Lord Carloway said the decision would be delayed under similar terms to those in previous hearing.\n\nHe said: “The court considers that the case should be continued until clear that the obligations under the 2019 Act have been complied with in full.”\n\nEuropean Commission president Donald Tusk confirmed at 10pm on Saturday that he had received the Prime Minister’s request, tweeting: “The extension request has just arrived. I will now start consulting EU leaders on how to react.”\n\nIn his signed letter, Mr Johnson wrote: “A further extension would damage the interests of the UK and our EU partners, and the relationship between us.”\n\nThe letter, to Mr Tusk and copied to European Council president Jean-Claude Juncker, refers to his regret at being defeated over the Letwin amendment in the House of Commons on Saturday.\n\nIt states: “Regrettably, Parliament missed the opportunity to inject momentum into the ratification process for the new Withdrawal Agreement.”\n\nMPs voted by 322 to 306 in favour of amending the Brexit deal to withhold the Commons’ approval until the necessary UK legislation to leave the EU has been passed.\n\nThe Government’s response was to cancel Saturday’s vote on the deal, with it expected to be brought back before MPs this week.", "description": "Petitioners now want to see if Boris Johnson will accept any potential extension granted by the EU.", "authors": ["Press Association"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/13/wire-19990322-1571661838-955_636x382.jpg", "published_at": "2019-10-21"}