{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/early-retirement-live-frugal-to-build-wealth-2019-10", "downloaded_at": "2019-10-09 18:49:09.558022+00:00", "title": "A 36-year-old New York lawyer who makes $270,000 says he lives off rice and beans so he can save 70% of his salary. He's part of a growing movement of pinching pennies to retire early.", "language": "en", "text": "Some people will do anything to escape the rat race.\n\nJust ask Daniel, 36, a Manhattan corporate lawyer earning $270,000 a year, who told Suzy Weiss of the New York Post that he lives in New Jersey to avoid city taxes, lives on rice and beans, owns one patched-together suit per weekday for work, and layers up during the winter instead of turning the heat on — all so he can save 70% of his salary and retire early.\n\nIt's working: He's saved more than $400,000 and is set to retire in three years, Weiss wrote.\n\nOther six-figure earners Weiss talked to have similar goals and are pulling out all the stops to reach them, from banning buying drinks out to wearing shoes that are falling apart.\n\nThey all hope to join the \"Financial Independence, Retire Early\" movement that was popularized when \"Your Money or Your Life\" was published 20 years ago. It's nothing new — but more millennials are becoming interested in the community, according to Weiss.\n\nRead more: What 8 people wish they knew before retiring in their 20s and 30s\n\nLiving on less helps early retirees stay on track\n\nBeing content with less and refusing to succumb to lifestyle inflation are the tickets to staying on track to retire early.\n\nJ.P. Livingston, who runs a personal-finance blog called The Money Habit, built a nest egg of more than $2 million before retiring at 28. Livingston worked in Manhattan's finance industry and earned $100,000 in her first post-grad job, she previously told Business Insider.\n\nBut determined to retire early, she tucked away 70% of her take-home pay. In an effort to be more frugal, she bought furniture from Craigslist and chose a living situation more modest than one she could have afforded — with a roommate in a three-floor walk-up on the Upper East Side for $1,050 a month (reasonable rent in a New Yorker's eyes).\n\nEven those not working in traditional high-salaried careers make do with a frugal lifestyle. Consider Joe and Ali Olson, who quit their jobs as public-school teachers in their early 30s with $1 million in the bank. They saved 75% of their income and lived in a 400-square-foot home, keeping their annual expenses to about $20,000, Business Insider previously reported.\n\nRead more: A day in the life of a 34-year-old early retiree who lives in NYC, grew his net worth to $1.25 million in just 5 years, and wakes up at 7:30 a.m.\n\nFrugality is the key to building wealth\n\nRegardless of early-retirement goals, frugality is the key to building wealth.\n\nLook no further than Warren Buffett, who still lives in the modest home in Omaha, Nebraska, that he bought for $276,700 (in today's dollars), or Richard Branson, who is famously frugal when it comes to buying luxury items.\n\nFrugal lifestyles help millionaires get rich in the first place, according to Sarah Stanley Fallaw, the director of research for the Affluent Market Institute and an author of \"The Next Millionaire Next Door: Enduring Strategies for Building Wealth,\" in which she surveyed more than 600 millionaires in America.\n\nShe studied the characteristics most predictive of net worth and found that six behaviors, which she called \"wealth factors,\" were related to net-worth potential, regardless of age or income. One of those is frugality: a commitment to saving, spending less, and sticking to a budget.\n\n\"Spending above your means, spending instead of saving for retirement, spending in anticipation of becoming wealthy makes you a slave to the paycheck, even with a stellar level of income,\" she wrote.", "description": "An increasing number of millennials are trying to retire early. To stay on track for financial independence, many commit to a frugal lifestyle.", "authors": ["Hillary Hoffower"], "top_image": "https://image.businessinsider.com/5d9e002e122bd537e3348662?width=1200&format=jpeg", "published_at": "2019-10-09"}