{"pub": "americanconservative", "url": "https://theguardian.com/world/2012/jun/30/syria-peace-plan-kofi-annan", "downloaded_at": "2019-10-21 01:36:21.740949+00:00", "title": "Failure of Syria peace plan 'risks wider regional conflict'", "language": "en", "text": "This article is more than 7 years old\n\nThis article is more than 7 years old\n\nThere will be grave consequences if crisis talks at the United Nations fail to agree on a political resolution to end the violence in Syria, Kofi Annan has warned.\n\nThe joint Arab League-UN envoy told delegates at the emergency meeting in Geneva, including the foreign ministers of the UN security council's five permanent members and representatives from the European Union and Arab states, that history \"will judge us all harshly if we prove incapable of taking the right path today\".\n\nAnnan's warning was echoed by the British foreign secretary, William Hague, who said it would be a catastrophe if the meeting failed to agree on a peace plan.\n\nHopes had been raised in recent days that the conference at the UN's Palais des Nations was the best opportunity to find a peaceful solution to an escalating conflict that has claimed more than 15,000 lives. However, US and Russia have remained divided over key issues.\n\nAnnan said the war in Syria risked spilling over into a wider regional conflict of \"grave severity\".\n\n\"By being here today you suggest intention to show leadership, but can you follow through?\" he asked the delegates.\n\nAnnan all but criticised the representatives of the international community for failing to halt the bloodshed, saying the crisis should never have reached this point.\n\n\"Either unite to secure your common interests, or divide and surely fail in your own individual way. Without your unity, your common resolve and your action now … nobody can win and everyone will lose in some way.\"\n\nHague ruled out President Bashar al-Assad and his closest allies from future involvement in Syria's political process and called for moves towards fresh sanctions against the regime from the security council next week.\n\nHe told the meeting: \"We face a heavy responsibility today. The world is looking to us for leadership and action to end the bloodshed and horror in Syria.\n\n\"We have a choice: we can unite around a robust and effective plan to achieve a ceasefire and a political transition in Syria and we can agree to give this plan the force and backing of a UN security council resolution. Armed with that, we can launch a concerted attempt to halt the violence once and for all.\n\n\"Or we can fail to overcome these differences, miss the opportunity to achieve a diplomatic breakthrough, and watch the situation deteriorate further. Of course, we benefit from having a six-point plan in front of us.\n\n\"The cost of any such failure would be … to turn a humanitarian crisis into a catastrophe.\"\n\nThe mood of pessimism was reinforced by a senior US official, who said the talks may or may not reach a deal on Saturday.\n\nAs the talks broke for lunch with no breakthrough, officials were instructed to redraft the negotiating text, in particular a section in Annan's six-point plan with which the Russian delegation is not happy.\n\nMoscow objects to the US and UK position, which is implicit in the original wording, that Assad and his closest associates would be excluded from future involvement in the country's governance, a central demand of the Syrian rebels.\n\n\"Ultimately, we want to stop the bloodshed in Syria. If that comes through political dialogue, we are willing to do that,\" said Khalid Saleh, a spokesman for the Syrian National Council, a coalition of Syrian opposition groups in Istanbul, Turkey. \"We are not willing to negotiate [with] Mr Assad and those who have murdered Syrians. We are not going to negotiate unless they leave Syria.\"\n\nRussia, Syria's most important ally, insists that Syrians alone should be masters of their fate, ruling out an internationally imposed solution.\n\nThe talks came as Syrian troops entered the besieged town of Douma near the capital, Damascus. which has been under siege for several weeks.", "description": "Kofi Annan and William Hague warn Geneva delegates to find solution to bloodshed or face grave consequences", "authors": ["Peter Beaumont"], "top_image": "https://i.guim.co.uk/img/static/sys-images/Guardian/Pix/pictures/2012/6/30/1341066526064/A-Syrian-girl-allegedly-i-008.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctYWdlLTIwMTIucG5n&enable=upscale&s=0c95a52b763a90b1c98bc28cc1fa266a", "published_at": "2012-06-30"}