{"pub": "arstechnica", "url": "https://arstechnica.com/gaming/2019/09/__trashed-14", "downloaded_at": "2019-10-05 11:02:30.895086+00:00", "title": "On Netflix and next projects, a night in genre-king Bong Joon-Ho’s lecture hall", "language": "en", "text": "AUSTIN, Texas—Usually when people line up for two hours or more in Austin, Texas, barbecue awaits at the other end. But the Fleming Lecture Hall at the University of Texas didn't suddenly start producing world-class brisket last Wednesday. Instead, in what may be a first, roughly 700 people lined up and then descended upon the humble classroom for a lecture at 5pm on a weeknight.\n\nTechnically, it was a guest lecture. And in fairness, it's not every Wednesday that South Korean genre film legend Bong Joon-Ho (Snowpiercer, Okja) is both in Austin and available to sit for student questions.\n\nBut the best genre-film festival in the US (Fantastic Fest) was taking place a few miles south of UT's campus throughout last week, and Bong's latest work, Parasite, screened among the closing films. The filmmaker's PR rep also happens to be a UT alum, and so a special campus viewing took place earlier in the week ahead of this—the one time no one seemed willing to skip an evening lecture.\n\nNot film school, but films then school\n\nBong started by quickly admitting to not being the ideal role model for any future film students in attendance. He studied sociology back in his university days in the 1980s, but really he spent more time in a nearby theater than any classroom. \"When I first went to college, I thought, 'I'll major in anything and join a film club,'\" Bong said. (The filmmaker took questions in English but largely responded for the audience via a translator.) \"So I did and rarely went to class.\"\n\nBut South Korea at that time was itself an education—the country was essentially transitioning out from underneath a military regime, so Bong supplemented his sociology studies simply by keeping his head up. \"Society was very dynamic with students still protesting,\" he said. \"Observing the students around me was my education rather than just textbooks.\"\n\nAny advice, teach? Given a significant portion of the audience was made of UT film students, Bong did offer some practical tips for filmmakers. For instance, he tries to begin his scripts with scenarios rather than individuals. \"I come up with the plot and situations—I will rarely begin with a character, but I always think, 'What would they do in this situation,' no matter how random it may be,\" he said. \"Sometimes when a very passionate actor comes to me and says, 'I wrote a three years diary for my character,' and they want [the character's] personal history, I'm also curious about what they're writing. I prefer to maintain that curiosity. I don't believe [a character's] actions and psychology is consistent; they can change depending on the situation.\" Given a significant portion of the audience was made of UT film students, Bong did offer some practical tips for filmmakers. For instance, he tries to begin his scripts with scenarios rather than individuals. \"I come up with the plot and situations—I will rarely begin with a character, but I always think, 'What would they do in this situation,' no matter how random it may be,\" he said. \"Sometimes when a very passionate actor comes to me and says, 'I wrote a three years diary for my character,' and they want [the character's] personal history, I'm also curious about what they're writing. I prefer to maintain that curiosity. I don't believe [a character's] actions and psychology is consistent; they can change depending on the situation.\" And when it comes to translating that script to the set from the director's chair, Bong suggests focusing on the literal vision. \"I don't think it makes sense to direct their performance. Actor's act; I just help,\" he said. \"So I think about relationships between the actor and the camera—how is it moving? What size is the frame? I tend to obsess over story boards, and you won't find a lot of differences between them and finished films. I meticulously set up the camera and set, then throw actors on there. It's a bit of a paradox, because then I ask them to relax and improvise. I like to be surprised.\"\n\nFor fans of Bong's work, that dynamic between those in control and those subjected to it likely sounds familiar. In the sci-fi/action mash-up Snowpiercer, survivors of some climate change counteractions gone wrong live on a train arranged by societal standing. In the horror thriller Mother, a small village treats a boy with intellectual disabilities poorly to their detriment. Near-future Okja has corporations versus animal activists; Parasite is 99% versus the 1%. Often this dynamic gets dressed up in multiple genres, but the central idea is very based in reality.\n\n\"With Parasite, in the US and Europe, they comment on how the film mixes genres,\" Bong said when asked about how his films get received differently across the globe. \"But Korean audiences see it as close to reality. A lot of people mention how their lives are; some smelled themselves after leaving the theater.\"\n\nWhile the writer/director's cultural nuance came on campus, Bong's affinity for genre started long before that. He recalls studying some Asian filmmakers closely at university (like Hou Hsiao-hsien), but \"the films that have permeated my body and stay in my bloodstream are the genre films from the US I watched when I was little.\"\n\nAs a kid, Bong recalls staying up late at night until his family fell asleep in order to watch AFKN, a network broadcasting American productions for servicemen stationed in Korea at the time. He loved the thrillers of John Schlesinger (Midnight Cowboy), for instance, and obviously these influences became ingrained only to later resurface in things like Snowpiercer and Parasite.\n\n\"They played a lot of midnight films with quite a lot of sex and violence, films you couldn't see on Korean channels at the time,\" he said. \"And because I didn't know English, I'd construct the narrative on my own. I only realized later these are famous films, stuff from John Carpenter and Brian De Palma.\"\n\n\n\nNetflix and what's next\n\nBong didn't want to spoil much about Parasite for anyone who hadn't yet seen it—after all, the film will have its US theatrical release beginning October 11. So he kept his comments on the film general, discussing its inspirations (he thought of three central characters: a father, a son, and a maid, and toyed with it as a stage play) and praising the actors (especially longtime collaborator Song Kang-ho). \"I wrote the script with him in mind, and a couple of scenes are only possible with him,\" Bong said. \"He's basically an amplifier—regardless of what emotions I want to portray through his character, he delivers ten-fold, a hundred-fold.\"\n\nSrsly, what about Parasite? What makes a good film? A clever story that grips the audience and offers a little escapism? Thought-provoking ideas that stick with viewers long after leaving a theater? Artistry of the highest order, a mix of acted scenes or iconic frames not to be forgotten? No matter how you define it, Parasite fits. What makes a good film? A clever story that grips the audience and offers a little escapism? Thought-provoking ideas that stick with viewers long after leaving a theater? Artistry of the highest order, a mix of acted scenes or iconic frames not to be forgotten? No matter how you define it, Parasite fits. Ars caught a press screening at Fantastic Fest earlier on Wednesday and then spent the rest of the day thinking about all the themes and ideas presented. It's less genre-y than Bong's prior films but no less enjoyable. Even with a two-hour runtime, Parasite engages you at every moment through its performances, striking visuals, and truly unique plot. It's genuinely a Valvano movie experience—you'll think, you'll laugh, and you might even cry (the film's coda induced some audible sniffles at the screening).\n\nInstead, the night's film discussions turned toward Bong's other projects. For instance, Bong's last film to compete at Cannes (Okja) eventually landed at Netflix; why not do the same with Parasite?\n\n\"From the beginning [at Netflix], I was guaranteed the Director's Cut in the contract and had R-rating approval,\" Bong said, expressing admiration for how much control the streaming giant gives creators. \"They said, 'It's OK if they roll around in blood at the slaughterhouse.' So whether in the US or Korea, as long as I'm guaranteed control, I'd work anywhere.\"\n\nBeyond being the reason audiences are unlikely to see Bong do a Marvel movie any time soon, that control is a big motivator for Bong to continually push for theatrical releases of his films. He sees great benefits in streaming services—more people enjoy films, it encourages archival preservation—but no viewing experience preserves a director's vision quite like the theater.\n\n\"It's not that the screen is big or you're watching with others, but it's the only place you can't press pause,\" Bong said. \"Whether it's Netflix, DVDs, Blu-ray, you can pause to go to the bathroom or because someone is calling. But as a filmmaker, I believe a film is one unit from beginning to end—there's a pace and rhythm. Just like a conductor or composer, I want that singular unit, and the theater is the only place that preserves that.\"\n\nEven though he didn't want to discuss Parasite in-depth, that didn't stop Bong from teasing his next project—something he's already thinking about and working toward. UT Radio, Television, and Film Department Chair Noah Isenberg moderated the discussion and had read in Korean media that Bong was working on something centered around a disaster in Seoul, so he ended by asking for any information the director would offer up. What can you tell us?\n\n\"Well, it's a secret,\" Bong began, allowing a moment or two for silence before finally indulging everyone. \"I don't know if you can call it horror, because in all my films the genre is ambiguous. But if you have to describe it, it's 'horror-action' and a disaster that happens in Seoul. I've had this idea since 2001, so I've been developing it for 18 years, and now I have an obsession. I really do have to shoot this movie.\n\n\"To give you one hint, it's not a film you can shoot in NYC or Chicago: it only works if all the pedestrians on the street have the same skin tone.\"", "description": "Ahead of Parasite's US release, the director treats Texas fans to pseudo film school.", "authors": ["Nathan Mattise"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/09/IMG_20190925_171410-760x380.jpg", "published_at": "2019-09-28"}