{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7557461/Delhi-hawkers-free-threat-eviction-five-year-delay.html", "downloaded_at": "2019-10-10 06:19:25.839141+00:00", "title": "Delhi hawkers to be free from threat of eviction after...", "language": "en", "text": "By Rina Chandran\n\nMUMBAI, Oct 10 (Thomson Reuters Foundation) - Delhi is set to become the first Indian city to fully implement a law that protects street vendors against the threat of eviction, authorities in the capital said on Thursday, five years after the landmark legislation was first introduced.\n\nDelhi government officials have set up Town Vending Committees (TVC), which will survey hawkers in the city and then issue vending certificates to give them the right to do business from a fixed spot, Chief Minister Arvind Kejriwal said.\n\n\"Without street vendors, no city can function. We just need to regularise them so that other citizens are not inconvenienced,\" Kejriwal posted on Twitter.\n\n\"Vendors will get the right to make an honest living, and they will not be harassed by the police and other authorities,\" he said, adding that licences would be issued before the end of the year.\n\nWith Asian towns and cities expanding and striving to become more international and attract investment, street vendors and hawkers are viewed increasingly as a hindrance to city planning.\n\nVendors selling everything from snacks and tea to toys and clothes are a common sight in India's cities, with items for sale spread out on pavements or in mobile carts.\n\nThe Street Vendors' Act was introduced by federal lawmakers in 2014 to help protect the country's hawkers from eviction, with states required to establish hawking zones, set up TVCs and issue licences.\n\nUnlicensed hawkers are often targeted for bribes by criminals or corrupt officials and police, and flee eviction drives which are becoming more common as cities modernise and competition for space grows from pedestrians and cars.\n\n\"The law emerged after a long struggle for improved livelihood security, legality and protection from eviction,\" said Shivani Chaudhry, executive director of the Housing and Land Rights Network, a non-profit in Delhi.\n\n\"Street vendors form the backbone of the city economy. Non-implementation of the law has resulted in their continued persecution, including arbitrary evictions, and lack of recognition of their rights,\" she said.\n\nNo states had fully implemented the 2014 act, according to the National Association of Street Vendors of India (NASVI).\n\nMembers of NASVI, who are staging a protest in Delhi on Thursday against the slow rollout of the law, said there was still no detailed plan for its implementation in the capital.\n\n\"There is a lack of political will to implement the law, and there is a pushback from citizens because of the misconception that vendors cause congestion,\" said Shalini Sinha at WIEGO, a global non-profit that helps informal workers.\n\n\"But walkability is not at odds with street vending, and authorities should be more concerned about livelihoods than vehicle parking,\" she told the Thomson Reuters Foundation.\n\nDelhi has now set up 28 TVCs with representatives from street vendors, the municipal commission, police and town planners, who will conduct the survey.\n\nBut there are few other details on the law's rollout, said Arbind Singh, a coordinator for NASVI.\n\n\"The same authorities promised implementation five years ago. Now, with local elections in Delhi due soon, the promise of implementation looks to be just a political gimmick,\" he said, referring to polls due by February next year.\n\n\"Meanwhile, evictions continue - so we are very skeptical.\"\n\n(Reporting by Rina Chandran @rinachandran; Editing by Michael Taylor. Please credit the Thomson Reuters Foundation, the charitable arm of Thomson Reuters, that covers humanitarian news, women's and LGBT+ rights, human trafficking, property rights, and climate change. Visit http://news.trust.org)", "description": "By Rina ChandranMUMBAI, Oct 10 (Thomson Reuters Foundation) - Delhi is set  to become the first Indian city to fully implement a law that  protects street...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-10"}