{"pub": "yahoo", "url": "https://sg.style.yahoo.com/lizzie-mcguire-trio-original-cast-210515483.html", "downloaded_at": "2019-10-25 01:48:19.964296+00:00", "title": "‘Lizzie McGuire': Trio of Original Cast Members Join Hilary Duff in Disney+ Sequel Series", "language": "en", "text": "Hilary Duff is reuniting with her original “Lizzie McGuire” family for the upcoming sequel series at Disney+.\n\nHallie Todd, Robert Carradine and Jake Thomas have signed on to reprise their roles as Jo, Sam and Matt McGuire, Lizzie’s parents and little brother. This week, the foursome reunited after 15 years and did a read-through of the first episode.\n\n“Just like there is no Lizzie McGuire without Hilary Duff, there is no McGuire family without Hallie, Robert, and Jake,” said Gary Marsh, president and chief creative officer of Disney Channels Worldwide. “The original series holds a special place in the hearts of so many, and we can’t wait to introduce fans, both old and new, to an older, wiser, yet still perfectly imperfect Lizzie.”\n\nThe sequel picks up as Lizzie McGuire is just about to turn 30. Here is the rest of the official description: “She seemingly has it all – her dream job as an assistant to a fancy New York City decorator, her dream guy and a picturesque Brooklyn apartment – but things aren’t always as they seem. With a little help from her friends, her loving family and her 13-year-old alter-ego in animated form, Lizzie navigates the ups and downs of adulthood.”\n\nTerri Minsky, creator of the original series, returns as showrunner and executive producer of the Salty Pictures, Inc. production. Hilary Duff and Rachel Winter will also executive-produce, while Ranada Shepard serves as co-executive producer.\n\nRead original story ‘Lizzie McGuire': Trio of Original Cast Members Join Hilary Duff in Disney+ Sequel Series At TheWrap", "description": "Hilary Duff is reuniting with her original “Lizzie McGuire” family for the upcoming sequel series at Disney+.Hallie Todd, Robert Carradine and Jake Thomas have signed on to reprise their roles as Jo, Sam and Matt McGuire, Lizzie’s parents and little brother. This week, the foursome reunited after 15", "authors": ["Margeaux Sippell"], "top_image": "https://s.yimg.com/uu/api/res/1.2/EpHT43dRVFRuzxNd9K7hLA--~B/aD00MDA7dz02MTg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/thewrap.com/aeee034b76f4c39f6eb7c9c66813c0da", "published_at": "2019-10-24"}