{"pub": "cnbc", "url": "https://cnbc.com/2019/10/30/deutsche-bank-q3-2019-earnings.html", "downloaded_at": "2019-10-30 06:54:10.778472+00:00", "title": "Deutsche Bank posts 832 million euro loss amid major restructuring", "language": "en", "text": "Deutsche Bank reported a net loss that missed market expectations on Wednesday as a major restructuring plan continues to weigh on the German lender.\n\nIt reported a net loss of 832 million euros ($924 million) for the third quarter of 2019. Analysts were expecting a loss of 778 million euros, according to data from Refinitiv. It had reported a net profit of 229 million euros in the third quarter of 2018, but a loss of 3.15 billion euros in the second quarter of this year.\n\nHere are some of the key highlights:\n\nTotal net revenues: 5.3 billion euros in the third quarter vs. 6.2 billion euros a year ago.\n\nCommon equity tier 1 ratio stood at 13.4% in the third quarter, vs. 14% a year ago.\n\nTotal non interest expenses: 5.8 billion euros in the third quarter, vs. 5.6 billion euros a year ago.\n\n\"Despite having launched the most comprehensive restructuring of our bank in two decades, we delivered profits in our four core businesses during the quarter and grew loans and assets under management,\" Christian Sewing, chief executive officer of Deutsche Bank, said in a statement.\n\nHe added: \"Transformation is fully underway with tangible progress on costs and de-risking. A 13.4% CET1 ratio underlines our strength.\"\n\nThe embattled German lender has struggled since the global financial crisis of 2008 and the subsequent debt crisis in the euro area. The bank has faced billion-dollar fines, increased market competition, a lower market share in both commercial and investment banking, as well as a series of management changes.\n\nEarlier this year, Deutsche Bank announced a wide restructuring plan in an attempt to revive its business. At the time, Sewing said the bank would be exiting its global equities business, scale back investment banking and slash thousands of jobs. The German bank also plans to cut 18,000 jobs worldwide by 2022.\n\nAt the end of the third quarter of 2019, Deutsche Bank reported that it had 89,958 employees — a 5% drop from a year ago.", "description": "Deutsche Bank reported a net loss that missed market expectations on Wednesday.", "authors": ["Silvia Amaro"], "top_image": "https://image.cnbcfm.com/api/v1/image/104089618-GettyImages-616037752.jpg?v=1568875983", "published_at": "2019-10-30"}