{"pub": "foxnews", "url": "https://foxnews.com/politics/kamala-harris-doubles-down-on-call-for-kavanaughs-impeachment-the-allegations-are-credible", "downloaded_at": "2019-09-17 08:26:10.226816+00:00", "title": "Kamala Harris doubles down on call for Kavanaugh's impeachment: The allegations are 'credible'", "language": "en", "text": "Sen. Kamala Harris, D-Calif., reiterated her call for the impeachment of Supreme Court Justice Brett Kavanaugh following the criticized New York Times story that revived sexual misconduct allegations.\n\nAppearing on MSNBC Monday night, Harris referred to Kavanaugh's confirmation as a \"sham process,\" claiming she wasn't \"given all of the information\" at the time that was available.\n\n\"Christine Blasey Ford, who literally had nothing to gain by coming forward... nothing to gain. She had a perfect life. And she looked at the fact that this guy was being nominated and said, 'the American people had the right to know what I know,' and she was treated like a criminal,\" Harris said.\n\nThe 2020 hopeful blasted the White House for limiting the scope of the FBI investigation into Kavanaugh and said the process that confirmed him \"has created a crisis of confidence in that court.\"\n\nTRUMP RIPS NEW YORK TIMES OVER KAVANAUGH PIECE, CALLS FOR RESIGNATION OF ANYONE INVOLVED IN 'SMEAR STORY'\n\n\"So yes, I call for impeachment,\" Harris told MSNBC host Rachel Maddow. \"I believe that is the clearest way for us to get an investigation of these allegations and we should open an investigation of these allegations.\"\n\nShe added that \"the American people and the system of justice\" deserve a meaningful investigation and later suggested an \"outside counsel.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nOver the weekend, before The Times issued the major revision clarifying that the alleged accuser did not recall the alleged assault, Harris among other presidential candidates called for Kavanaugh's impeachment.\n\n\"I sat through those hearings. Brett Kavanaugh lied to the U.S. Senate and most importantly to the American people. He was put on the Court through a sham process and his place on the Court is an insult to the pursuit of truth and justice. He must be impeached,\" Harris wrote.", "description": "Sen. Kamala Harris, D-Calif., reiterated her call for the impeachment of Supreme Court Justice Brett Kavanaugh following the criticized New York Times story that revived the sexual misconduct allegations.", "authors": ["Joseph Wulfsohn", "Joseph A. Wulfsohn Is A Media Reporter For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Kamala-Harris.jpg", "published_at": "2019-09-17"}