{"pub": "nyt", "url": "https://nytimes.com/2019/09/23/opinion/trump-whistle-blower-impeachment.html", "downloaded_at": "2019-09-23 19:11:38.470204+00:00", "title": "Opinion | Nancy Pelosi’s Failure to Launch", "language": "en", "text": "The most Pelosi has done is to write that if the whistle-blower’s complaint is kept from Congress, the administration “will be entering a grave new chapter of lawlessness which will take us into a whole new stage of investigation.” Given the impunity Trump has enjoyed so far, this does not seem like a threat with teeth.\n\nUltimately, no one can know the political consequences of impeachment in advance. I find it hard to imagine how months of televised hearings into a widely hated president’s comprehensive corruption could help him, but I can’t see the future. Perhaps impeachment in the House without removal in the Senate would allow Trump to convince some voters he’s been exonerated, though so does the failure to impeach him at all.\n\nPolls show that impeachment doesn’t have majority support, so there’s a political risk for Democrats in trying to lead public opinion rather than follow it. But surely there’s also a risk in appearing weak and irresolute. Already, frustration with Pelosi in the Democratic base is threatening to curdle into despair. “I see the grass-roots activists who helped build the wave last year really wondering what they built that wave for,” Ezra Levin, co-founder of the progressive group Indivisible, told me.\n\nIn the end, our system offers no mechanism besides impeachment to check a president who operates like a mob boss. It’s true that Democrats will remove Trump only by beating him in 2020, but he is already cheating in that election, just as he did in 2016, and paying no price for it.\n\nA formal impeachment process would, if nothing else, give new weight to Democratic claims when they go to court to enforce subpoenas or pry loose documents the administration is trying to hide. It would show that Democrats are serious when they say that Trump’s behavior is intolerable, and potentially allow them to seize control of the day-to-day narrative of this rancid presidency. Trump does not want to be impeached — a Monday Politico headline says, “Trump’s team is trying to stop impeachment before it starts.” It’s hard to imagine why any Democratic leader would assist them.", "description": "The House speaker’s hesitation on impeachment empowers a lawless president.", "authors": ["Michelle Goldberg"], "top_image": "https://static01.nyt.com/images/2019/09/23/opinion/32goldbergSub/32goldbergSub-facebookJumbo.jpg", "published_at": "2019-09-23"}