{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/20/sabathia-moving-to-bullpen-as-yankees-prep-for-pla", "downloaded_at": "2019-09-21 00:01:41.904087+00:00", "title": "Sabathia moving to bullpen as Yankees prep for playoffs", "language": "en", "text": "NEW YORK (AP) - Yankees pitcher CC Sabathia is getting set to close his career as a reliever.\n\nNew York manager Aaron Boone said before Friday night’s game against Toronto that Sabathia will work out of the bullpen next week as the AL East champions prepare for the playoffs.\n\nThe 39-year-old lefty has pitched in relief just once in his 19-season career, going 1 1/3 innings in a deciding Game 5 loss to Detroit in the 2011 AL Division Series.\n\nSabathia’s other 583 appearances have all come as a starter. He is 5-8 in 22 starts with a 4.99 ERA this season and has dealt with knee trouble.\n\nSabathia has said this will be his last year playing in the majors.\n\nThe Yankees are still figuring out their rotation for the postseason, which begins Oct. 4 with the best-of-five Division Series. Masahiro Tanaka, James Paxson, J.A. Happ and Luis Severino are among the candidates to start.\n\nSeverino came back from a lat injury and made his season debut with four shutout innings in a start Tuesday. Domingo Germán, the team’s top winner at 18-4, was put on administrative leave Thursday under Major League Baseball’s domestic violence policy and his status for the postseason is uncertain.\n\nBoone said he anticipates using Sabathia in a controlled setting next week at Tampa Bay. If that goes well, Boone said he would try it “a little more on the fly” next weekend at Texas. Boone envisions a “significant role” for Sabathia in the postseason.\n\n“That’s why we want to do this a couple of times. He’s certainly on board with it and wants to do it,” Boone said.\n\n“I feel like for obviously as much as he has to deal with the knee, I feel like he’s in at least a pretty good place right now to be able to do it,” Boone said.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Yankees pitcher CC Sabathia is getting set to close his career as a reliever.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/20/angels_yankees_baseball_16618_c0-160-3814-2383_s1770x1032.jpg?4a920a9724f3aa2c815110b9689d6c798dcbb704", "published_at": "2019-09-20"}