{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/man-bowel-disease-humiliated-after-20539274", "downloaded_at": "2019-10-09 00:39:56.482817+00:00", "title": "Man with bowel disease 'humiliated' after Starbucks gave him deadline to leave toilet", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA man with bowel disease was left 'humiliated' after Starbucks staff threatened to open the door unless he left in 1-2 minutes.\n\nCouncillor Matt Downey, 23, was visiting London for a job interview and had popped into Starbucks on Sloane Square in Chelsea to grab a drink.\n\nWhile in the branch, Mr Downey suffered a flare up of his bowel condition and was forced to use the disabled toilet for around 20 minutes.\n\nHowever, while in the toilet, Mr Downey claimed staff began knocking on the door and demanding he leave or risk them opening the loo with a staff key.\n\nMr Donwey, Lib Dem Councillor for Ely East in Cambridgeshire, said he sat in the toilet \"terrified\" about what could happen and left the branch close to tears and humiliated.\n\nDescribing the traumatic incident, he said: \"I was just in the loo and started getting some knocking.\n\n\"I said a polite \"hi\" as you do, but then the knocking became incessant and the person said I've been in there too long.\n\n\"They said something about me being in there hours and it had been around 20 minutes.\n\n\"They said I needed to open the door or they'll use the staff key to open it.\"\n\nMr Downey was \"gobsmacked\" when he was then allegedly given a \"deadline\" to leave the toilet.\n\nHe added: \"They then gave me a deadline of two minutes and then one minute. I was pretty terrified and embarrassed.\"\n\nMr Downey claims he was then forced to reveal his private medical issues not only to staff, but to any customers in earshot of the door - describing the experience as \"humiliating\".\n\nBut the young councillor, who studied economics at Manchester University, said staff continued to ask him to leave while banging on the door.\n\nHe added: \"I repeatedly mentioned that I had a bowel disease but they kept up their threats.\n\n(Image: Facebook)\n\n\"Thankfully I finished without them doing anything.\"\n\nWhen Mr Downey left the toilet, he claims there was no queue of customers waiting to use the loo.\n\nHe went on to approach staff behind the counter about who was banging on the door, claiming a number of baristas said they had no idea what banging he was talking about.\n\nMr Downey added: \"When I was coming out of the loo it was awful because I thought everyone as looking at me.\n\n\"I then go and ask the staff what happened and they say they don't know anything about it and basically shrug about it.\n\n\"I'm just gobsmacked and am a complete mix of emotions. I just left the shop because I felt I was going to burst into tears.\n\n\"I was in London for a job interview and the whole thing left me feeling quite distressed.\"\n\n(Image: Facebook)\n\nA staff member at the branch, who wishes to remain anonymous, admitted to banging on the door along with a number of other staff members.\n\nHe said: \"The man was in there for 40 minutes and a long queue of people were waiting and knocking. I also knocked on the door and said, 'can you be quicker please, people are waiting'.\n\n\"First I asked if he was OK and then I asked how long he needed. He didn't say how long he needed.\"\n\nWhen asked who knocked on the door out of the staff members, the worker said \"I think everybody did.\"\n\nMirror Online has approached Starbucks for a comment.", "description": "EXCLUSIVE: Councillor Matt Downey, 23, was forced to use the Starbucks toilet in Chelsea, London, when his bowel disease flared up - but claims staff members banged on the disabled toilet door and threatened to open it with a staff key", "authors": ["Abigail O'Leary", "Image", "Facebook"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20539517.ece/ALTERNATES/s1200/0_THP_CHP_081019Slug_10560JPG.jpg", "published_at": "2019-10-08"}