{"pub": "abcnews", "url": "https://abcnews.go.com/Weird/wireStory/nevada-desert-towns-prep-storm-area-51-influx-65710824", "downloaded_at": "2019-09-19 06:01:18.376243+00:00", "published_at": "2019-09-19", "title": "Stage set in Nevada as Earthlings arrive for Area 51 events", "language": "en", "text": "The stage was set Thursday for music and other space-themed entertainment as Earthlings descended on the Nevada desert for events inspired by an internet hoax known as \"Storm Area 51.\"\n\n\"It started as a joke, but it's not a joke for us,\" Alon Burton, guitarist and member of the group Wily Savage, said as he and several other men wrestled a tarp over a makeshift stage near the Little A'Le'Inn motel and cafe in Rachel.\n\nGusts of wind billowed the white canopy like a sailboat spinnaker as they tied it down.\n\n\"We know people will come out. We just don't know how many,\" he said.\n\nBy early afternoon, several hundred people had made their way to the site where secrecy surrounding Area 51 has long fueled speculation that it's where the government studies space aliens.\n\nAs they arrived for the weekend events, campers in trucks and trailers staked out space on federal land across a highway.\n\nAnticipating a big crowd, a beer company had produced alien-themed cans, and a brothel in offered discounts to \"E.T. enthusiasts.\"\n\nEvents were planned in Rachel and Hiko, a 45-minute drive away, the two towns closest to Area 51.\n\nThe festivities sparked by the internet joke inviting people to \"see them aliens\" could become a cultural marker, monumental dud or something in between.\n\n\"This phenomenon is really a perfect blend of interest in aliens and the supernatural, government conspiracies, and the desire to know what we don't know,\" said Michael Ian Borer, a University of Nevada, Las Vegas, sociologist who researches pop culture and paranormal activity.\n\nThe result, Borer said, was \"hope and fear\" for events that include the \"Area 51 Basecamp,\" featuring music, speakers and movies in Hiko and festivals in Rachel and Las Vegas competing for the name \"Alienstock.\"\n\n\"People desire to be part of something, to be ahead of the curve,\" Borer said. \"Area 51 is a place where normal, ordinary citizens can't go. When you tell people they can't do something, they just want to do it more.\"\n\nEric Holt, the Lincoln County emergency manager overseeing preparations, said he believed authorities could handle 30,000 visitors at the events in Rachel and Hiko.\n\nStill, neighbors braced for trouble after millions of people responded to the \"Storm Area 51\" Facebook post weeks ago.\n\nJoerg Arnu, a Rachel resident who can see the festival grounds from his home, said he installed outdoor floodlights, fencing and \"No Trespassing\" signs on his 30-acre property.\n\nHe also organized a radio-equipped night watch of neighbors who fear there won't be enough water, food, trash bins or toilets for visitors.\n\n\"Those that know what to expect camping in the desert are going to have a good time,\" Arnu said.\n\nHowever, others won't if they show up in shorts and flip-flops, he said.\n\n\"That doesn't protect you against critters, snakes and scorpions,\" Arnu said. \"It will get cold at night. They're not going to find what they're looking for, and they are going to get angry.\"\n\nSome cellphones didn't work Thursday in Rachel, and officials expect what service there was to eventually be overwhelmed.\n\nThe Federal Aviation Administration closed nearby air space, although Air Force jets could be heard in the sun-drenched skies, along with an occasional sonic boom.\n\nGeorge Harris, owner of the Alien Research Center souvenir store in Hiko, said the \"Area 51 Basecamp\" Friday and Saturday will focus on music, movies and talks about extraterrestrial lore.\n\nElectronic dance music DJ and recording artist Paul Oakenfold is Friday's headliner in Hiko.\n\nThe event also promises up to 60 food trucks and vendors, trash and electric service, and a robust security and medical staff.\n\nHarris said he was prepared for as many as 15,000 people and expected they would appreciate taking selfies with a replica of the Area 51 back gate without having to travel several miles to the real thing.\n\n\"We just want people to be safe,\" Harris said. \"As long as they don't go on the desert floor and destroy the ecosystem, everyone will have a good time.\"\n\nBurton said he had promises from almost 50 performers to appear at the Rachel site, off a state road dubbed Extraterrestrial Highway.\n\nThe U.S. Air Force has issued stern warnings for people not to approach the gates of the Nevada Test and Training Range, where Area 51 is located.\n\nAuthorities in Nye County, home to a conspicuously green establishment called the Area 51 Alien Center, are discouraging Earthlings from trying to find extraterrestrials.\n\n\"We're taking precautions and checking the back roads,\" Sheriff Sharon Wehrly said.\n\nHer deputies last week arrested two Dutch tourists attracted by \"Storm Area 51.\" The men pleaded guilty to trespassing at a secure U.S. site nowhere near Area 51 and promised to pay thousands in fines.\n\nArnu said the military added razor wire to barbed cattle fencing on the Area 51 boundary near his home, installed more cameras and battery-powered lighting, and erected an imposing spike barrier just inside a gate. He noted a new sign telling trespassers they'll be arrested and fined $1,000.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Lifestyle/WireAP_64d71a6e7a45435a81da2247fb76d2d0_16x9_992.jpg"}