{"pub": "atlantic", "url": "https://theatlantic.com/ideas/archive/2019/09/what-the-whistle-blowers-memo-taught-me/598939", "downloaded_at": "2019-09-27 12:36:39.956015+00:00", "title": "What the Whistle-Blower’s Memo Taught Me", "language": "en", "text": "On all of these counts, the whistleblower complaint comes across as highly credible. The writer expressly acknowledges the limits of his or her knowledge and also measures contemporaneous accounts from public sources against the private information reportedly conveyed. The full complaint also carefully points out which information was reported in the press, including by the Ukrainian government, which information came from private sources, and what information was potentially classified. The whistleblower is also careful to delineate what information is known and what is still not known—such as why President Trump allegedly directed that nearly $400 million in military assistance to Ukraine be suspended in July.\n\nNotably, the complaint is not based on direct knowledge. Secondhand information is, of course, less reliable than first-hand information—as Trump’s defenders were eager to point out. But intelligence is frequently secondhand. If intelligence reports included information only from those who were literally in the room when the nuclear weapon was made, there wouldn’t be many intelligence reports.\n\nImportantly, the whistleblower makes clear up front, on page 1 of the complaint, “I was not a direct witness to the events described.” There is no hiding the ball. The whistleblower then says, “I found my colleagues’ accounts of these events to be credible because, in almost all cases, multiple officials recounted fact patterns that were consistent with one another. In addition, a variety of information consistent with these private accounts has been reported publicly.”\n\nThe most important word here is multiple—which, according to the writer, means “more than half a dozen U.S. officials.” And the word appears in relation to each of the most serious claims in the complaint. Multiple officials allegedly told the whistleblower about: the July 25 call between Trump and Ukrainian President Volodymyr Zelensky; the disturbing transfer of the verbatim transcript to a classified system in an alleged effort to “lock down” all records of the phone call; contacts between Trump’s personal attorney, Rudolph Giuliani, and Ukrainian officials that reportedly circumvented the national security decision-making processes; the communication to Ukrainian leaders that a meeting or phone call between Trump and his Ukrainian counterpart depended on Zelenskyy’s willingness to “play ball” on the issues Giuliani had publicly raised involving investigations that would help Trump in his 2020 reelection bid; and that the instruction to suspend military assistance to Ukraine had come directly from the president.\n\nWe’re not talking about relaying rumors by the lone office gossip or low-level bureaucrats on the fringes of the decision-making apparatus. The multiple sources in the complaint are all said to be U.S. officials, many with “direct knowledge” of the events described, including “White House officials.”", "description": "Trump’s defenders have dismissed the complaint against him as hearsay. But good intelligence often comes secondhand.", "authors": ["Amy Zegart", "Contributing Editor At"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/RTX74KAD/facebook.jpg?1569586499", "published_at": "2019-09-27"}