{"pub": "yahoo", "url": "https://sports.yahoo.com/penn-state-stays-undefeated-narrowly-holds-off-michigan-2821-031401941.html", "downloaded_at": "2019-10-20 12:51:20.661571+00:00", "title": "Penn State stays undefeated, narrowly holds off Michigan 28-21", "language": "en", "text": "KJ Hamler (1) caught two touchdown passes in Penn State's 28-21 win over Michigan. (Photo by Gregory Fisher/Icon Sportswire via Getty Images)\n\nNo. 7 Penn State’s undefeated season is still alive. But it wasn’t easy.\n\nThe Nittany Lions jumped out to a 21-0 lead over No. 16 Michigan, but they needed a goal-line stand in the final minutes just to come away with a 28-21 win in front of a raucous white-out crowd at Beaver Stadium.\n\nScroll to continue with content Ad\n\nThe PSU team that dominated the first half was flat for the majority of the second half. Other than a 53-yard touchdown bomb from Sean Clifford to K.J. Hamler that extended the lead to 28-14, the Nittany Lions barely moved the ball.\n\nAnd the vaunted Penn State defense was on its heels as Michigan mounted a comeback. The Wolverines cut PSU’s lead to 28-21 on a fourth-and-goal Shea Patterson quarterback sneak with 8:48 to play and then quickly forced the PSU offense to go three-and-out.\n\nFrom there, Michigan regained possession near midfield and quickly marched into the red zone. Again, the Wolverines faced a fourth-and-goal — this time from the 3-yard line.\n\nPatterson’s first read was covered up and he was able to escape pressure off the edge to deliver a ball to Ronnie Bell in the end zone. Bell dropped the pass, giving the ball back to the Nittany Lions.\n\n(via ESPN)\n\nPSU regained possession, picked up a first down and ran out the clock to seal a dramatic victory that will keep the College Football Playoff firmly in the Nittany Lions’ sights.\n\nWhat does this mean for Penn State?\n\nMost importantly, the win means Penn State is still one of college football’s unbeatens. At 7-0 and 4-0 in Big Ten play, the Nittany Lions kept pace with No. 4 Ohio State in the Big Ten East.\n\nStory continues\n\nThose two are marching toward a showdown in Columbus on Nov. 4, but the Nittany Lions will have a few tough games beforehand. Next week, PSU heads to East Lansing to face a reeling Michigan State team coming off a bye. PSU also has a road game against No. 20 Minnesota, an undefeated team poised to continue rising in the rankings.\n\nPenn State has faced two tough defenses the past two weeks — Iowa and Michigan — but it has some issues to address on offense. PSU was able to gash the Wolverines with some big plays, particularly the touchdown passes to Hamler. But the PSU offense, which finished with 283 yards, was stagnant for much of the second half and has not shown much consistency with Clifford in the passing game. That’s an obvious area for improvement for the Nittany Lions as the season progresses.\n\nWhat does this mean for Michigan?\n\nAnother year, another disappointment for the Wolverines under Jim Harbaugh. The Wolverines, now 5-2 (3-2 Big Ten) on the year, finally found some success on offense this week, but it was only after they fell behind 21-0.\n\nMichigan is clearly the third-best team in the division, and that’s just not what fans expected when Harbaugh took over in 2015. The schedule doesn’t let up, either. The Wolverines will host No. 8 Notre Dame next week and still have the Buckeyes on the schedule on Nov. 30.\n\nMichigan has still never beaten OSU during Harbaugh’s tenure. Overall, OSU holds a seven-game winning streak in the series.\n\nMore from Yahoo Sports:", "description": "Penn State’s undefeated season is still alive. But it didn't come easy against Michigan.", "authors": ["Sam Cooper"], "top_image": "https://s.yimg.com/ny/api/res/1.2/FoKfgWIKStccDWTJ7cT2kA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/dk2Z1GyHlGZVUEj2McnoFg--~B/aD0yNDQ5O3c9MzY3NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/5489a120-f2e1-11e9-b1ee-5ae3177b4916", "published_at": "2019-10-20"}