{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/the-commonwell-mutual-insurance-group-deploys-guidewire-insuranceplatform-in-deloittes-insurcloud", "downloaded_at": "2019-10-08 13:00:31.631662+00:00", "title": "The Commonwell Mutual Insurance Group Deploys Guidewire InsurancePlatform in Deloitte's InsurCloud", "language": "en", "text": "Canadian general insurer to leverage Guidewire Core and Data products in the cloud to drive innovation and speed to market and increase business growth\n\nLINDSAY, Ontario & SAN MATEO, Calif. — The Commonwell Mutual Insurance Group, an Ontario, Canada-based mutual insurer, and Guidewire Software, Inc. (NYSE: GWRE), provider of the industry platform Property and Casualty (P&C) insurers rely upon, announced that The Commonwell successfully deployed Guidewire InsurancePlatform* Core and Data products. The Commonwell is modernizing its technology infrastructure to drive innovation and speed to market and increase business growth. Their Guidewire systems will run as a part of Deloitte’s InsurCloud, a cloud with implementation, ongoing services, and support from Deloitte, a Guidewire PartnerConnect™ Consulting Premier member. Guidewire’s core, reinsurance, and data products have been simultaneously deployed across all lines of business in Ontario, including automobile, farm, residential, and small commercial.\n\nTim Shauf, president and chief executive officer, The Commonwell said, “We realized that our goal of significantly increasing our premium growth and membership, while maintaining our high standards of member value, broker experience, and employee engagement, required a fundamental shift in how our supporting technology was deployed. By deploying InsurCloud, The Commonwell has successfully delivered immediate member experience benefits as part of our strategic business transformation, both across our organization and distribution partner network.”\n\n“InsurancePlatform deployed in InsurCloud has significantly enhanced our member, agent, and broker experience by increasing efficiencies in underwriting, billing, and rating accuracy,” said Enrico Mastrangeli, vice president, Distribution and Member Innovation, The Commonwell. “Through Commonwell Connect, our brokers will have a seamless single sign-on journey from their broker management system into The Commonwell Guidewire core systems. This enhances their ability to act as trusted advocates who can provide new customers with a once-and-done experience through a real-time enabled technology platform.”\n\nJennifer Baziuk, vice president, Transformation and Strategic Delivery, The Commonwell, said, “Thanks to the strong partnership Guidewire and Deloitte have, and the InsurCloud solution, we were able to complete the project early and under budget. We will now be able to move towards a digital business model with Guidewire products as our foundation, further transforming our business and changing how the IT and Data Management & Data Reporting team operates.”\n\nDaniel Shum, managing partner, InsurCloud Solutions, Deloitte Canada, said, “We are honored by The Commonwell’s confidence in InsurCloud and their trust in Deloitte for the implementation, hosting, and management of their Guidewire InsurancePlatform systems.”\n\n“We congratulate The Commonwell on its successful InsurancePlatform deployment,” said Mike Polelle, chief delivery officer, Guidewire Software. “We applaud The Commonwell’s commitment to maintaining mutual, cooperative values that are represented in its relationships with agents, brokers, and policyholders. We are excited to see the company embrace the cloud as it adapts its business for success in the rapidly-changing Ontario insurance market.”\n\n* The Commonwell deployed Guidewire InsuranceSuite™ and Guidewire Reinsurance Management™ as its new core operations software systems for underwriting, policy administration, reinsurance, claims, and billing management. The company also deployed Guidewire DataHub™ and Guidewire InfoCenter™ for enterprise-wide data management and analytics.\n\nAbout The Commonwell Mutual Insurance Group\n\nEstablished January 1, 2014, The Commonwell Mutual Insurance Group is a merger of three longstanding mutual insurance companies that has been built on more than a century of hands-on commitment to the local communities it serves. Since its founding almost six years ago, The Commonwell Mutual Insurance Group operates on the same historical premise of its three legacy companies – maintaining a focus on local presence and service that builds strong long-term relationships for the benefit of the greater community. www.thecommonwell.ca\n\nAbout Deloitte Canada\n\nDeloitte provides audit & assurance, consulting, financial advisory, risk advisory, tax and related services to public and private clients spanning multiple industries. Deloitte serves four out of five Fortune Global 500® companies through a globally connected network of member firms in more than 150 countries and territories bringing world-class capabilities, insights and service to address clients’ most complex business challenges. To learn more about how Deloitte’s approximately 264,000 professionals—9,400 of whom are based in Canada—make an impact that matters, please connect with us on LinkedIn, Twitter or Facebook.\n\nDeloitte LLP, an Ontario limited liability partnership, is the Canadian member firm of Deloitte Touche Tohmatsu Limited. Deloitte refers to one or more of Deloitte Touche Tohmatsu Limited, a UK private company limited by guarantee, and its network of member firms, each of which is a legally separate and independent entity. Please see www.deloitte.com/about for a detailed description of the legal structure of Deloitte Touche Tohmatsu Limited and its member firms.\n\nAbout Guidewire Software\n\nGuidewire delivers the industry platform that Property and Casualty (P&C) insurers rely upon to adapt and succeed in a time of accelerating change. We provide the software, services, and partner ecosystem to enable our customers to run, differentiate, and grow their business. We are privileged to serve more than 350 companies in 34 countries. For more information, please visit www.guidewire.com and follow us on twitter: @Guidewire_PandC.\n\nNOTE: For information about Guidewire’s trademarks, visit https://www.guidewire.com/legal-notices.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191008005334/en/\n\nContacts\n\nDiana Stott\n\nDirector, Communications\n\nGuidewire Software, Inc.\n\n+1.650.356.4941\n\ndstott@guidewire.com\n\nDaniel Shum\n\nManaging Partner, InsurCloud Solutions\n\nDeloitte Canada\n\ndashum@deloitte.ca\n\nMichael-Elizabeth Paczek\n\nManager Communication & Brand\n\nThe Commonwell Mutual Insurance Group\n\n+1.705-324-2146 Ext 1409\n\nmpaczek@thecommonwell.ca", "description": "Canadian general insurer to leverage Guidewire Core and Data products in the cloud to drive innovation and speed to market and increase business growthLINDSAY, Ontario & SAN MATEO, Calif.", "authors": [], "top_image": "https://mms.businesswire.com/media/20191008005334/en/560949/3/guidewire_logo_new_2color_h_screen.jpg", "published_at": "2019-10-08"}