{"pub": "indiatimes", "url": "https://indiatimes.com/trending/wtf/who-is-hindustani-bhau-the-viral-meme-guy-on-bigg-boss-13-wild-card-378773.html", "downloaded_at": "2019-10-29 06:26:13.580073+00:00", "title": "All You Need To Know About Hindustani Bhau, The Viral Meme Sensation Now On Bigg Boss 13!", "language": "en", "text": "All You Need To Know About Hindustani Bhau, The Viral Meme Sensation Now On Bigg Boss 13!\n\nAll You Need To Know About Hindustani Bhau, The Viral Meme Sensation Now On Bigg Boss 13!\n\nIndia's biggest and most watched reality show is all about making things crazier with every passing episode, because TRPs.\n\nSafe to say, the people running it have what it takes to make things extra maddening, with the kind of people they pick for the show. For instance, the latest wild card entrant is a viral meme sensation called Hindustani Bhau.\n\nNow, for those who aren't in tune with the mindless memes that float around online, Hindustani Bhau is the king of 'B*ll Sh*t' artists.\n\nHindustani Bhau aka Vikas Jayaram Phatak, is a TikTok and YouTube star, who is most fondly known as the 'Pehli Fursat' guy. He shot to 'fame' after he made some controversial statements against people he thinks are anti-national.\n\nWhat makes him so popular is the expletives-filled rant that he pulls off with ease - that's the only reason he turned into one of the most-memed guys on the Internet. Mostly he is seen sitting in a Maruti Ertiga car talking to the camera.\n\nBhau has over 1M subscribers on YouTube, and after entering the Bigg Boss, Vikas claimed to be a Sanjay Dutt fan and recited some of his dialogues. He also gave the contestants nicknames such as chana masala (Mahira), dukhi aatma (Rashami).\n\nDon't Miss 321 SHARES 18 K SHARES 26.4 K SHARES 22.4 K SHARES 9.6 K SHARES\n\n*Hindustani Bhau Enters BB House*\n\n*Someone Misbehaves with him*\n\nLe Bhau: pic.twitter.com/4LlnbxI3wc — 🅰 🅺 🅰 🆂 🅷 ❤ (@BaeRozgaar__) October 26, 2019\n\nThere's a reason people like Hindustani Bhau are chosen for a show like Bigg Boss - his nonsensical views, overtly controversial statements (which more often than not, make no sense) and over the top attitude.\n\nAll of which constitutes the perfect remedy to start some god-awful fights in the house.\n\nFor those (like me) who haven't given Bigg Boss a chance, it's best to stick to your guns. There's really no point wasting an hour everyday to see people plot, plan and employ cheap strategies to make each other miserable.\n\nBigboss TRP this year going down in every episode\n\nLe Hindustani Bhau : pic.twitter.com/7jv5bvM8yA — Rishabh pahava (@ImRp97) October 26, 2019\n\nThe only highlights that have come from Bigg Boss are fights. From Dolly Bindra's 'Baap Matt Jaa' meltdown to Pooja Mishra's extra dramatic 'Your're asking for it, your dying for it' outburst. There's nothing sensible coming out of the show.\n\nThere's a study which says that people who watch reality shows, show signs of lower verbal IQ, as well as increased aggressiveness. So, do you really want to waste an hour with this kind of negativity?\n\nYou have one life to live and Bigg Boss probably shouldn't feature anywhere in your daily schedule. Period.", "description": "Click here to find out who Hindustani Bhau aka Vikas Jayaram Phatak is. A Tik-Tok and YouTube star, who is most fondly known as “Pehli Fursat” guy. Find out how he became popular with controversial rants against people he thinks are anti-national. What makes him so popular is the expletives-filled rant that he pulls off with ease, that's the only reason he turned into one of the most memed guys.", "authors": ["Kc Archana"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/bhau_1572324945_800x420.jpg", "published_at": "2019-10-29"}