{"pub": "fox", "url": "https://foxnews.com/us/new-york-city-first-responders-critical-condition", "downloaded_at": "2019-10-18 03:21:30.270227+00:00", "title": "Two New York City EMTs in critical condition after suffering separate medical emergencies at same crash", "language": "en", "text": "Two New York City EMTs were in critical condition Thursday night after they suffered from separate medical emergencies at the same crash while on the job.\n\n“It is an extremely tragic coincidence,” FDNY Commissioner Daniel Nigro said. “Thankfully both of these members were able to be transported and are still alive. It’s somewhat amazing, considering the serious nature of both of these conditions.”\n\nOfficials said New York City Fire Department (FDNY) EMT Liam Glinane, 63, was transporting an ambulance by himself from one location to another when he suffered a stroke around 1:30 p.m. ET while driving on the Brooklyn Queens Expressway in Queens.\n\nThe stroke caused him to slightly veer off the road and he crashed into another vehicle, according to the FDNY. Officials said the crash was minor and was not the cause of his medical condition.\n\nNEW YORK CITY LAWMAKERS APPROVE PLAN TO CLOSE RIKERS JAIL COMPLEX BY 2026\n\nFDNY officials said EMS Lt. Raymond Wang, 47, was in a separate ambulance doing a ride-along with a physician when they stopped to help after the crash that involved Glinane. Wang suddenly became unconscious, officials said.\n\n“Lieutenant Raymond Wang was responding to the incident and when he arrived on scene to treat EMT Glinane, he suffered an aortic aneurysm,” Nigro told reporters at Elmhurst Hospital in Queens, where he and New York City Mayor Bill de Blasio provided an update on the two EMS members.\n\nBoth Wang and Glinane were later transferred to Mount Sinai Hospital in Manhattan and remained in critical condition, officials said.\n\n“Lt. Wang was transported to Elmhurst Hospital and was treated rapidly, and he has now been transported to Mount Sinai in Manhattan for the purpose of attempting to repair the aneurysm,” Nigro said.\n\nOfficials said Wang, a 19-year veteran of the FDNY, remained in critical condition.\n\n“EMT Glinane was transported to Mt. Sinai in Queens, and is now also being transported to Mount Sinai in Manhattan for additional treatment as a result of his stroke. Our thoughts and prayers are with both,” Nigro said.\n\nNYPD COP DIES AFTER SHOOTOUT WITH SUSPECT IN THE BRONX\n\nDe Blasio said Glinane, who has served the city for 28 years, was in critical but stable condition.\n\nCity officials said it's a bizarre coincidence that both first responders experienced medical conditions around the same time.\n\n“I just ask that all New Yorkers keep these two good men and their families in your thoughts and prayers at this absolutely crucial and sensitive time,” New York City Mayor Bill de Blasio said at a news conference.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nOfficials said investigations into what happened were ongoing.", "description": "Two New York City EMTs were in critical condition Thursday night after they suffered from separate medical emergencies at the same crash while on the job.", "authors": ["Talia Kaplan", "Talia Kaplan Is A Reporter For Foxnews.Com. Follow Her On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/FDNy-Ambulance.jpg", "published_at": "2019-10-18"}