{"pub": "dailymail", "url": "https://dailymail.co.uk/usshowbiz/article-7548795/Kirsten-Dunst-smiles-alongside-fiance-Jesse-Plemons-Breaking-Bad-movie-El-Camino.html", "downloaded_at": "2019-10-08 05:14:21.421732+00:00", "title": "Kirsten Dunst is all smiles alongside fiance Jesse Plemons at the Breaking Bad movie El Camino", "language": "en", "text": "Kirsten Dunst was all smiles alongside her fiance, Breaking Bad star Jesse Plemons, at the premiere of the new Breaking Bad movie El Camino.\n\nThe 37 year old actress looked radiant while hitting the red carpet at the Regency Village Theater in Westwood, California on Monday night.\n\nPlemons played the mild-mannered Todd in the final season of Breaking Bad, though his character is not featured in the movie El Camino.\n\nAll smiles: Kirsten Dunst was all smiles alongside her fiance, Breaking Bad star Jesse Plemons, at the premiere of the new Breaking Bad movie El Camino\n\nRadiant: The 37 year old actress looked radiant while hitting the red carpet at the Regency Village Theater in Westwood, California on Monday night\n\nDunst was wearing a slightly low-cut navy blue dress with teal earrings and tan pumps to the premiere event.\n\nPlemons was sporting a more casual look, with a white dress shirt under a brown suede coat .\n\nHe completed his look with black pants and brown cowboy boots for the premiere screening.\n\nKirsten's look: Dunst was wearing a slightly low-cut navy blue dress with teal earrings and tan pumps to the premiere event\n\nJesse's look: Plemons was sporting a more casual look, with a white dress shirt under a brown suede coat\n\nDunst and Plemons met while filming Season 2 of the hit FX anthology series Fargo, and started dating.\n\nThey announced their engagement in 2018, and Dunst gave birth to their first child, son Ennis, in May 2018.\n\nThere is no word yet on when Dunst and Plemmons will tie the knot quite yet, but both actors are quite in-demand.\n\nHappy couple: Dunst and Plemons met while filming Season 2 of the hit FX anthology series Fargo, and started dating\n\nDunst currently stars in the Showtime series On Becoming a God in Central Florida, which debuted on Showtime in August.\n\nThe series is set in 1992, following a minimum wage water park employee (Dunst), who cons her way to the top of a multi-billion dollar pyramid scheme.\n\nShe stars alongside Ted Levine, Julie Benz and Mel Rodriguez, with Showtime issuing a Season 2 renewal in late September.\n\nNew show: Dunst currently stars in the Showtime series On Becoming a God in Central Florida, which debuted on Showtime in August\n\nPlemons stars as Chuckie O'Brien in the highly-anticipated drama The Irishman, starring Al Pacino and Robert De Niro, arriving on Netflix November 27.\n\nHe also stars in Antlers with Keri Russell, in theaters next year, along with Disney's Jungle Cruise with Dwayne Johnson and Emily Blunt, arriving July 24, 2020.\n\nHe is also attached to star in Jesus Was My Homeboy with Lakeith Stanfield and Daniel Kaluuya and The Bell Jar with Dakota Fanning.\n\nComing soon: Plemons stars as Chuckie O'Brien in the highly-anticipated drama The Irishman, starring Al Pacino and Robert De Niro, arriving on Netflix November 27\n\nNew movies: He also stars in Antlers with Keri Russell, in theaters next year, along with Disney's Jungle Cruise with Dwayne Johnson and Emily Blunt, arriving July 24, 2020", "description": "Kirsten Dunst was all smiles alongside her fiance, Breaking Bad star Jesse Plemons, at the premiere of the new Breaking Bad movie El Camino.", "authors": ["Brian Gallagher For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/04/19425788-0-image-a-70_1570506888127.jpg", "published_at": "2019-10-08"}