{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7629317/Three-dead-nine-injured-mass-shooting-Long-Beach.html", "downloaded_at": "2019-10-30 07:55:43.161713+00:00", "title": "Three dead and nine injured in mass shooting at a Halloween party in Long Beach", "language": "en", "text": "At least three people are dead and nine have been wounded after a mass shooting at a Halloween party in Long Beach.\n\nPolice and the fire brigade were called to a house near the busy intersection of Temple Avenue and 7th Street around 10.45pm local time.\n\nOfficers said two hooded men opened fire at the home and are still at large. They were unable to immediately give a motive for the shooting.\n\nThree men have been shot dead and nine others wounded after two hooded gunmen opened fire at a Halloween party in Long Beach\n\nPolice and the fire brigade were called to a home in south Long Beach around 10.45pm local time Tuesday to reports of multiple shots fired\n\nLong Beach Fire Department said all three of the dead are adult males.\n\nFive of the wounded required immediate medical attention before being taken to hospital, though there was no further information on the condition of the wounded.\n\nFire Department spokesman Jake Heflin told the Long Beach Post that all of the victims appeared to be in their 20s.\n\nThree bodies were visible on the ground while paramedics were treating people on a grassy area outside a nail salon before loading them into ambulances, ABC7 reports.\n\nIt appears the shooting happened in an alley outside the home, as several shell casings were visible on the ground.\n\nNeighbours told the Los Angeles Times that there were up to 20 shots, in multiple bursts of gunfire.\n\nFive of the wounded required immediate medical treatment and transport to hospital while four others were transported later, firefighters said\n\nNeighbours said there were multiple bursts of gunfire with up to 20 shots ringing out\n\nOne local, who gave his name only as 'Martin', said he heard a car accelerating ahead of him and swerving suddenly before the shots started.\n\n'Then all I hear is pop, pop, pop, a bunch of pops– maybe like 20 shots. It was a lot,' he said.\n\nOthers said they first mistook the sound for fireworks before realising it was gunfire, then ran for safety.", "description": "At least three people are dead and nine have been injured after two hooded gunmen opened fire at a house party in south Long Beach around 10.45pm Tuesday, police and the fire brigade have said.", "authors": ["Chris Pleasance For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/07/20363478-0-image-a-15_1572420385891.jpg", "published_at": "2019-10-30"}