{"pub": "townhall", "url": "https://townhall.com/columnists/humbertofontova/2019/09/14/trump-tougher-on-cuba-than-was-john-bolton-n2553070", "downloaded_at": "2019-09-14 05:27:09.623489+00:00", "title": "Trump Tougher on Cuba Than was John Bolton?", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\n“President Trump on Thursday pushed back on the idea that former national security adviser John Bolton was too much of a hawk — asserting that it was Bolton who was constraining him. “In fact, my views on Venezuela, and especially Cuba, were far stronger than those of John Bolton. He was holding me back!”\n\n“But that’s crazy, Humberto!” respond some amigos. “I mean, isn’t Trump’s “the art of the deal” guy? Doesn’t he claim to be willing to sit down with our adversaries and try to work things out, rather than immediately sound the bugles and waste trillions of U.S. taxpayer dollars on pointless wars? Isn’t he a tough-nosed businessman who opposes all these Deep-State-backed foreign interventions that serve no American interests whatsoever?\n\nYes. Exactly. And you see, amigos: Tightening the so-called Cuba embargo amounts to a form of non-intervention in service of American interests. And that’s what The Castro regime’s agents-of-influence (on the payroll and off) who infest the U.S. media, liberal and libertarian think tanks, the Democratic Party, Academia, etc. desperately try to hide.\n\nYou see, amigos: The Castro Crime Family has gleefully fleeced taxpayers from the European Union to Canada, from Mexico to South Africa—in brief, the taxpayers of virtually every nation whose government granted trade credits to these kleptocrats—in brief, to the taxpayers of virtually every nation whose government refrains from “embargoing” the Castro-Crime-Family.\n\nWe’ve been spared such fleecing because on Oct. 1960—right after Castro’s gunmen stole $7 billion from U.S. businessmen and tortured and murdered a few who resisted-- President Eisenhower imposed the first economic sanctions against the thieving, mass-murdering Stalinists who mostly (still) run Cuba. These sanctions grew into one of the CROWN JEWELS of recent U.S. foreign policy: The Cuba embargo.\n\nAmong the main provisions of the so-called Cuba embargo is that the Castro-Family-Crime-Syndicate pay cash up front through a third–party bank for all U.S. medical and agricultural products; no Ex-Im (U.S. taxpayer) financing of such sales. This cash-up-front policy has kept the U.S. taxpayer among the few who've been spared fleecing by the Castro-regime.\n\nAs exhibit A, all of the following outfits have historically clamored against the so-called Cuba embargo and done everything in their power to undermine and loophole it:\n\nThe Council on Foreign Relations, The Wall Street Journal, The New York Times, the U.S. Chamber of Commerce, The Trilateral Commission, The Davos Group, The Organization of American States, The Vatican, the Congressional Black Caucus, The Carlyle Investment Group (George Soros among its founders,) The Open Society Foundation (bankrolled by George Soros,) The CATO Institute, The Congressional Hispanic Caucus, The Brookings Institute, the Carnegie Endowment for International Peace, the Farm Lobby, The United Nations, The U.S. Conference of Catholic Bishops, The World Council of Churches., etc.\n\nI trust that anyone that even glances at the fruits of Obama’s 16 month “engagement” with the Castro-Family- Crime-Syndicate marvels. Because never in the course of U.S. diplomacy has so much been surrendered by so many to so few for so little.\n\nNot a penny of the $7 billion Castro stole at gunpoint from Americans (while torturing and murdering a few Americans who resisted) has been compensated—or even acknowledged. Some of the FBI’s most wanted terrorists still live like celebrities in Cuba. All this after Castro promptly got his murdering (of Americans) terrorists back as bonus to an economic lifeline from Obama—in the nick of time and much of it at the expense of the U.S. taxpayer.\n\nIn fact, “engagement” with Castro’s Cuba and opposition to U.S. sanctions against the Castro-Family-Crime-Syndicate ranks among the oldest and most treasured of the Deep State/International Elite’s pet causes.\n\nThe media mantra that Obama was courageously and innovatively “trying something new” with Cuba is beyond idiotic—for people actually familiar with U.S. history that is.\n\nGiven Donald Trump’s deep ties with south Florida he undoubtedly got the real (i.e. non-Fake News Media/Academia) scoop on U.S.–Cuba relations, and thus learned the futility of “engagement,” as defined by liberals.\n\nIn fact, U.S. engagement with the Castro brothers began before they were even in office. \"Me and my staff were all Fidelistas.\" (Robert Reynolds, the CIA's \"Caribbean Desk's specialist on the Cuban Revolution\" from 1957-1960.)\n\n\"Everyone in the CIA and everyone at State was pro-Castro, except [Republican] ambassador Earl Smith.\" (CIA operative in Santiago Cuba, Robert Weicha.)\n\nTheir advice was taken, and January 7, 1959, thus marks a milestone in U.S. diplomatic history. Never before had the State Department extended diplomatic recognition to a Latin American government as quickly as they bestowed this benediction on Fidel Castro's that day.\n\nNothing so frantically fast had been bestowed upon \"U.S.-backed\" Fulgencio Batista seven years earlier. Batista had in fact been punished by a U.S. arms embargo and heavy diplomatic pressure to resign for a year. Batista was subsequently denied exile in the U.S. and not even allowed to set foot in the country that “backed\" him.\n\nIn fact, during Castro's first 16 months in power, the U.S. State Department made over 10 back-channel diplomatic attempts to ascertain the cause of Castro's tantrums and further \"engage\" him. Argentine President Arturo Frondizi was the conduit for many of these and recounts their utter futility in his memoirs.\n\nResult: In July 1960, Castro's KGB-trained security forces stormed into 5,911 U.S.-owned businesses in Cuba and stole them all at Soviet gunpoint -- $2 billion was heisted from outraged U.S. businessmen and stockholders. Not that all Americans surrendered their legal and hard-earned property peacefully. Among some who resisted where Bobby Fuller, whose family farm would contribute to a Soviet-style Kolkhoze, and Howard Anderson, whose profitable Jeep dealership was coveted by Castro's henchmen. Both U.S. citizens were murdered by Castro and Che's firing squads, after torture.\n\nIn July 1961, JFK's special counsel Richard Goodwin met with Che Guevara in Uruguay and reported back to Kennedy: \"Che says that Cuba wants an understanding with the U.S.; the Cubans have no intention of making an alliance with the Soviets. So we should make it clear to Castro that we want to help Cuba.\" (How Che managed a straight face during this conversation requires an article of its own.)\n\nResult: Soviet nuclear missiles, locked and loaded, were in Cuba a year later -- and pointed at Goodwin and Kennedy's very homes.\n\nRonald Reagan sent Alexander Haig to meet personally in Mexico City with Cuba's \"Vice President\" Carlos Raphael Rodriguez to feel him out. Then he sent diplomatic whiz Gen. Vernon Walters to Havana for a meeting with the Maximum Leader himself.\n\nResult: Cubans practically take over Grenada, El Salvador, and Nicaragua. (But unlike the aforementioned Democrats, Reagan responded to Castro's response -- and with pretty dramatic results.)\n\nPresident Clinton tried playing nice again in the '90s, removing travel restrictions, etc.\n\nResult: Three U.S. citizens and one resident who flew humanitarian flights over the Florida straits (Brothers to the Rescue) were murdered in cold blood by Castro’s MiGs. Castro agent Ana Belen Montes moles her way to head of the Defense Intelligence Agency's Cuba division, resulting in the deepest and most damaging penetration of the U.S. Defense Department by an enemy agent in modern history.", "description": "“President Trump on Thursday pushed back on the idea that .09/14/2019 1:25:46AM EST.", "authors": ["Humberto Fontova", "Timothy Meads", "Matt Vespa", "Katie Pavlich"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/296/0027a8c4-36a2-48ca-84e8-30ed9e64ef0b.jpg", "published_at": "2019-09-14"}