{"pub": "usatoday", "url": "https://usatoday.com/story/money/2019/10/18/planning-to-live-on-social-security-checks/40320863", "downloaded_at": "2019-10-19 11:29:11.967265+00:00", "title": "Planning to live on Social Security? Consider doing this", "language": "en", "text": "CLOSE With a rapidly growing aging population, securing Social Security funds is now more crucial than ever. But how did we get here in the first place? Just the FAQs, USA TODAY\n\nIt's possible to live on Social Security if you scale your expenses accordingly. That means you have to find a way to keep your housing costs as low as possible since, for most people, that's the biggest expense they pay each month.\n\nIt being possible, it should be noted, does not mean it's a good idea. Social Security will generally replace about 40% of your former earnings for average earners. Living on that and that alone is likely a very challenging, if not bleak, existence. Attempting to live solely on Social Security is dangerous and puts you at great risk for major financial problems.\n\nIf you have no other choice, though, it may be possible to squeak by on the $1,471 a month the average person receives in Social Security. Of course, some people receive a lower monthly benefit, while others will have a partner or spouse to share expenses.\n\nThere's no exact formula because every person has a different set of financial factors. You, for example, may retire but have a car loan or lease payment, while someone else may be paying off credit card debt or dealing with other financial issues.\n\nRetirement: Only 1 in 5 Americans achieves this key financial goal\n\nHow to live on Social Security alone\n\nIt's important to note that nobody should plan on living solely on Social Security. Ideally, you should have started saving early in your working life or at least put some money away at some point. Many people who did not save much may own a home and be able to move someplace cheaper to make it easier to survive without working.\n\nIf you only have Social Security and have no appreciable assets, it's very important to understand your budget and get your expenses in line – $1,471 is not very much money, and stretching to cover the basics can be a challenge.\n\nFor someone who has no debts or significant assets and gets a Social Security check in that range, you will have to make a strong plan. One thing you should consider is living in a state that doesn’t tax Social Security. You'll want to find one that also has affordable housing, low property taxes, and a generally low cost of living. After that, it's important to find appropriate housing and that's possible in some states that court retired workers.\n\nIn Florida, for example, there are countless 55+ communities that cater to lower-income retirees. Some of these offer manufactured homes for rent or purchase where rents on a one-bedroom can be below $600 a month, buying a similar unit may cost between $15,000-$45,000. If you buy, it's important to remember that you will generally have to pay to lease the land where your manufactured/mobile home sits and that in the vast majority of cases manufactured homes are assets that lose value over time (like a car) – they don't gain like a traditional home does.\n\nFlorida and other retiree-friendly states also have some condo complexes that are strictly for people 55-and-over where rents fall into the below-$600 range. In addition, there are also senior-friendly RV parks where you can rent or buy.\n\nNone of these options are luxurious, but if you shop around, it's possible to find warm, well-kept communities with pools, clubhouses, and active social calendars. Your actual home will be small but that may be offset by living in a community with shared amenities and spaces.\n\nHow we ditched debt: Little splurges on the path to freedom\n\nManage the rest of your expenses\n\nIf you bring in $1,471 a month and spend $600 on rent or housing, then you have very little left over. It's hot in Florida and running air conditioning costs money. You may also want an internet connection and a phone plan, which are both as close to necessities as possible.\n\nThere are ways to save money here. Shop around when you look at 55+ communities because some include internet or at least have public WiFi in the community spaces. Others may offer cable and have water included. Do your homework and remember that nothing is free so be careful about rent or fees that are priced to include things you don't want.\n\nIf you are pretty careful, you may be able to cover rent, lot, or HOA fees plus utilities, phone, and internet for under $800. That leaves you about $620 a month to cover food, clothing, and, well, everything else.\n\nThe reality is that few people would want to get by solely on Social Security because the scenario mentioned above includes little to no room for healthcare and that's likely to be an expense for most seniors (even with Medicaid). The picture gets a little better for couples (or even roommates) as that's a way to half housing costs.\n\nJust because you can do something does not mean you want to do it or that it would be pleasant. Even if retirement is coming up soon for you, it's best to keep working longer or even part-time to avoid having to make the tough choices and sacrifices required to possibly get by on Social Security alone.\n\nThe Motley Fool has a disclosure policy.\n\nThe Motley Fool is a USA TODAY content partner offering financial news, analysis and commentary designed to help people take control of their financial lives. Its content is produced independently of USA TODAY.\n\nRead or Share this story: https://www.usatoday.com/story/money/2019/10/18/planning-to-live-on-social-security-checks/40320863/", "description": "It's not easy and not advisable, but it's possible in some cases.", "authors": ["Daniel B. Kline", "The Motley Fool", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/9e1f6e2ee20f44aa1f3be4f71e9f3e52b6ae2c7e/c=0-110-2121-1303/local/-/media/2019/10/15/USATODAY/usatsports/MotleyFool-TMOT-b2b050db-piggy-bank.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-18"}