{"pub": "metro", "url": "https://metro.co.uk/2019/10/23/rose-mcgowan-suing-harvey-weinstein-lawyers-diabolical-illegal-smear-allegations-10973182", "downloaded_at": "2019-10-24 07:51:06.701368+00:00", "title": "Rose McGowan suing Harvey Weinstein and lawyers over smear allegations", "language": "en", "text": "Harvey Weinstein and Rose McGowan in 2007 (Picture: Getty)\n\nRose McGowan is suing Harvey Weinstein and his former lawyers over claims they discredited her allegations and smeared her name.\n\nThe 45-year-old actress was one of the first people to bring sexual assault accusations against the disgraced producer when she alleged he had raped her at the Sundance film festival in 1997.\n\nThe actress has now decided to file legal documents against Weinstein and his lawyers Lisa Bloom and David Boies.\n\nAccording to TMZ, Rose filed legal documents to sue the trio, which state the case ‘is about a diabolical and illegal effort by one of America’s most powerful men and his representatives to silence sexual-assault victims, and it is about the courageous women and journalists who persisted to reveal the truth’.\n\nThe Charmed star claims that back in 2016, she had plans to write a memoir and motivational book titled Brave – which she eventually released in 2018- that would include details about her allegations against Weinstein.\n\nRose was one of the first people to bring sexual assault accusations against the disgraced producer (Picture: Wireimage)\n\nShe then alleges Weinstein learned about these plans and ‘tapped into his team of fixers’ with the goal of ensuring Rose’s story never saw the light of day, ‘and – if it did – that no one would believe her’.\n\nAdvertisement\n\nAdvertisement\n\nRose’s documents claim Weinstein’s lawyers worked together and ‘tried to steal’ the unpublished book, and attempted to buy her silence, alleging that if they couldn’t stop her, they planned to ruin her reputation.\n\nWeinstein’s current lawyer Phyllis Kupferstein has already slammed Rose’s claims.\n\nIn a statement to TMZ, she said: ‘Once and for all, Rose McGowan will be shown to be what she is; a publicity seeker looking for money. From the moment she sought a multi-million dollar payout in return for not making these baseless allegations, which we rejected, we knew that she was waiting for an opportune time to begin this.\n\n‘We will demonstrate that this case has no legal merit.’\n\nRose McGowan released her book Brave in 2018 (Picture: Backgrid)\n\nA representative for Lisa Bloom has also responded to the allegations, claiming it is ‘inexcusable’ that the lawyer has been involved in the lawsuit.\n\nThey said: ‘It is inexcusable that Ms. McGowan chose to include my client in her lawsuit. Facts matter.\n\n‘There is simply no credible factual or legal basis for her claims against my client. We look forward to our day in court to set the record straight.”", "description": "Rose McGowan was one of the first people to bring sexual assault accusations against Harvey Weinstein.", "authors": ["Rebecca Lewis"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2018/04/sei_7919352_1571868716.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-23"}