{"pub": "usatoday", "url": "https://usatoday.com/story/news/nation/2019/10/17/tropical-storm-warnings-issued-gulf-coast-system-gains-strength-nestor/4008009002", "downloaded_at": "2019-10-18 01:15:27.671316+00:00", "title": "'Dangerous' surge possible: Tropical storm warnings issued for Gulf Coast as system gains strength", "language": "en", "text": "CLOSE A severe storm struck the northeast United States on Oct. 16 carrying monstrous amounts of rain with it. Jonathan Petramala was in Rockaway Beach, New York, with more details. Accuweather\n\nStory Highlights The storm will most likely make landfall somewhere along the Florida Panhandle.\n\nThis system has the potential to bring heavy rainfall, damaging winds and a coastal storm surge.\n\nIf its winds reach 39 mph, it would become the hurricane season's 14th named storm, Nestor.\n\nTropical storm warnings have been issued for the Gulf Coast as a system gathers strength in the western Gulf of Mexico.\n\nThe National Hurricane Center says the disturbance that could become Tropical Storm Nestor is likely to develop into a tropical or subtropical system in the next day or two.\n\n\"Tropical development can occur at any time into Saturday as the system travels northeastward over the warm waters of the Gulf of Mexico,\" said Dan Kottlowski, an AccuWeather hurricane expert.\n\nForecasters issued a tropical storm warning for southeastern Louisiana and the northern Gulf Coast from the Alabama-Mississippi line to the Big Bend area of Florida. A tropical storm warning means that tropical storm conditions are expected somewhere within the warning area within 36 hours, the Weather Channel said.\n\nThe storm will most likely make landfall somewhere along the Florida Panhandle.\n\nThe projected path of the weather system that's expected to become Tropical Storm Nestor. (Photo: National Hurricane Center)\n\n\"This system has the potential to bring heavy rainfall, damaging winds and a coastal storm surge to parts of the Florida Panhandle and northwestern Florida during Saturday morning,\" Kottlowski said.\n\n\"Dangerous storm surge inundation of up to 5 feet above ground level is possible along the Florida Gulf Coast from Indian Pass to Clearwater,\" the hurricane center said.\n\nWild weather: Bomb cyclone or 'explosive cyclogenesis' knocks out power to 600,000 during a 'wild night'\n\nAccuWeather predicted that drenching rain and localized flooding will be the main impacts from the storm as it moves along over the southeastern states. Urban flooding can occur even though much of the Southeast states could stand more rain because of ongoing drought conditions.\n\nThe system could still be a tropical storm on Sunday morning over eastern North Carolina before moving back over water, forecasters said.\n\nAs of Thursday morning, the disturbance, now known as Potential Tropical Cyclone 16, had maximum sustained winds of 40 mph and was located about 570 miles southwest of the mouth of the Mississippi River. It was moving to the north-northeast at 9 mph.\n\nContributing: The Associated Press\n\n10 AM CDT: NHC has initiated advisories on Potential Tropical Cyclone Sixteen. Here are the Key Messages for that system, which is expected to bring storm surge and wind hazards to portions of the Gulf Coast https://t.co/tW4KeFW0gBpic.twitter.com/GBtv78GUvv — National Hurricane Center (@NHC_Atlantic) October 17, 2019\n\nRead or Share this story: https://www.usatoday.com/story/news/nation/2019/10/17/tropical-storm-warnings-issued-gulf-coast-system-gains-strength-nestor/4008009002/", "description": "Tropical storm warnings have been issued for the Gulf Coast as a system that could become Tropical Storm Nestor strengthens in the Gulf of Mexico.", "authors": ["Doyle Rice", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/17/USAT/97c90366-5fdb-41d4-8d40-9a1578a6d326-ptc16.jpg?crop=816,459,x0,y14&width=3200&height=1680&fit=bounds", "published_at": "2019-10-17"}