{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/10/trump-says-blank-strap-instead-of-jockstrap.html", "downloaded_at": "2019-10-03 07:24:15.551201+00:00", "published_at": "2019-10-02", "title": "Trump Attacks Democrats for ‘Bullshit’ Probes but Won’t Say ‘Jockstrap’", "language": "en", "text": "Trump’s daily rant. Photo: Chip Somodevilla/Getty Images\n\nFor the second time as president, Donald Trump tweeted “bullshit” Wednesday. As in the word bullshit. The first time he used the noun in a presidential tweet came in April, when he referred to claims in Robert Mueller’s report as “total bullshit.” (Things he labeled “bullshit” prior to becoming president include climate change, the Oscars, and a New York story about Roger Ailes.)\n\nWednesday’s tweet was the first time he made the “BULLSHIT” all caps, though.\n\n“The Do Nothing Democrats should be focused on building up our Country,” Trump wrote, “not wasting everyone’s time and energy on BULLSHIT, which is what they have been doing ever since I got overwhelmingly elected in 2016, 223-306. Get a better candidate this time, you’ll need it!”\n\nThe Do Nothing Democrats should be focused on building up our Country, not wasting everyone’s time and energy on BULLSHIT, which is what they have been doing ever since I got overwhelmingly elected in 2016, 223-306. Get a better candidate this time, you’ll need it! — Donald J. Trump (@realDonaldTrump) October 2, 2019\n\nThe tweet, in which Trump gets Hillary Clinton’s electoral-vote total wrong, was made even more amusing by what happened next. While sitting next to Finland’s president in the Oval Office, Trump ranted about San Francisco, Nancy Pelosi, and “Shifty” Adam Schiff. At one point he tore into Schiff, the chairman of the House Intelligence Committee, for not sufficiently respecting Secretary of State Mike Pompeo.\n\n“You know, there’s an expression,” Trump told reporters. “He couldn’t carry his ‘blank’ strap. I won’t say it because they’ll say it was so terrible to say. But that guy couldn’t carry his ‘blank’ strap,” Trump said, refusing to say jockstrap.\n\nTrump’s prudishness in that moment, which came just minutes after he tweeted “BULLSHIT,” is just the latest mystery to surround a man who becomes more inscrutable by the day.\n\nFuming, Trump rants that Adam Schiff couldnt carry Mike Pompeo's \"blank strap\" (jock strap) pic.twitter.com/qpvvIjCHZR — Oliver Willis (@owillis) October 2, 2019", "description": "Donald Trump tweeted the word “bullshit” Wednesday, but then in the Oval Office he censored himself, saying “’blank’ strap” instead of “jockstrap.”", "authors": ["Adam K. Raymond"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/10/02/02-trump-rant.w1200.h630.jpg"}