{"pub": "politico", "url": "https://politico.eu/article/ukraine-president-says-he-never-met-with-trumps-personal-attorney", "downloaded_at": "2019-10-02 00:34:17.204720+00:00", "published_at": "2019-10-01", "title": "Ukraine president says he never met with Trump’s personal attorney", "language": "en", "text": "Ukrainian President Volodymyr Zelenskiy | Sean Gallup/Getty Images Ukraine president says he never met with Trump’s personal attorney The comment comes a day after Giuliani was hit with a subpoena from the US House Intelligence Committee.\n\nUkrainian President Volodymyr Zelenskiy said Tuesday he has never met U.S. President Donald Trump’s personal attorney Rudy Giuliani, who is involved in an escalating impeachment inquiry by House Democrats.\n\n“I’ve never met Rudy Giuliani, never,” Zelenskiy said at a news conference in Kiev. “And never had any phone calls with him.”\n\nThe comment comes a day after Giuliani was hit with a subpoena from the House Intelligence Committee to produce documents related to Trump’s July phone call with the Ukrainian president. During the call, Trump urged Zelenskiy to work with both Giuliani and Attorney General William Barr on a potential investigation into former Vice President Joe Biden and his son.\n\nZelenskiy on Tuesday insisted that he cannot be pressured by any foreign leader, attempting to dismiss the notion that Trump had strong-armed him regarding the Bidens.\n\n“I’d like to tell you that I never feel pressure. I have lots of people who would like to put pressure on me here and abroad. But I'm the president of an independent Ukraine and I’d like to think and my actions suggest no one can put pressure on me,” Zelenskiy said.\n\nA rough transcript of the phone call released last week by the White House revealed Zelenskiy had a personal assistant speak to Giuliani, and the Ukrainian president assured Trump that he hoped “very much that Mr. Giuliani will be able to travel to Ukraine and we will meet once he comes to Ukraine.”\n\nTrump told Zelenskiy during the call that he would have Giuliani call him, according to the transcript.", "description": "The comment comes a day after Giuliani was hit with a subpoena from the US House Intelligence Committee.", "authors": ["Oma Seddiq", "David M. Herszenhorn", "Nahal Toosi"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/GettyImages-1178365920-1200x628.jpg"}