{"pub": "metro", "url": "https://metro.co.uk/2019/10/15/when-are-the-nta-awards-2020-on-tv-and-who-is-nominated-10916916", "downloaded_at": "2019-10-15 08:04:00.761326+00:00", "title": "When are the NTA Awards 2020 on TV and who is nominated?", "language": "en", "text": "David Walliams is the new host of the NTAs (Picture: Tom Nicholson/REX)\n\nThe National Television Awards, one of TV’s biggest nights of the year, is coming around again in January 2020 and next year’s bash is promising to be their biggest yet.\n\nThe Awards show, which asks the British public to vote for their favourite and most loved TV stars and shows to win the top prizes, is entering its 25th year in 2020.\n\nComedian, author and Britain’s Got Talent judge David Walliams is on board as a brand new host for 2020, and he will be leading the celebrations for the NTA’s silver anniversary show.\n\nDavid has taken over from veteran NTAs host Dermot O’Leary, who announced back in February 2019 that he had decided to step down after hosting the annual ceremony every January for ten years.\n\n‘It’s been a tough decision because we have had a ball over the last decade, but 10 years feels about right,’ the X Factor presenter said in a heartfelt post.\n\nAdvertisement\n\nAdvertisement\n\nAfter the announcement that David Walliams would be taking the reigns from Dermot, David commented: ‘I am thrilled to be the new host of the NTAs — and will ensure I also win them all.’\n\nBut who is up for an award next year and how can you vote to make sure your favourites go home with the coveted awards on the night?\n\nNTA nominees 2020\n\nToday (15th October) the nominees for the National Television Awards 2020 have been revealed and voting has officially opened.\n\nThere are 14 different categories for 2020, including a brand new ‘Challenge’ category in which hit shows such as The Circle and Race Across The World are long listed alongside the likes of favourites such as Love Island and The Great British Bake Off.\n\nGBBO is up for more awards again in 2020 (Picture: Love Productions / Channel 4 / Mark Bourdillon)\n\nIn the New Drama category, gripping BBC show The Capture is longlisted against the likes of Suranne Jones’ period drama Gentleman Jack, Chernobyl, Cleaning Up, Mrs Wilson, World On Fire and A Confession.\n\nDramas that weren’t new this year but still returned to our screens to surprise and delight us are longlisted in the Drama category, and these include Line of Duty, Peaky Blinders, Call The Midwife, Victoria and Vera, as well as the final season of Poldark. They will all be contending in the drama category with multi-award winning show Killing Eve, which stars Jodie Comer, who just bagged an Emmy for her performance in the show.\n\nJodie Comer collects her Emmy award for Outstanding Actress in a Drama! HUGE congratulations!! #KillingEve pic.twitter.com/uKoRZDVZ0b — Killing Eve News (@KillingEveNews) September 23, 2019\n\nAdvertisement\n\nAdvertisement\n\nCompetition is tight in the Comedy category too this year, as Phoebe Waller-Bridge’s multi-Emmy Award winning show Fleabag is up against Derry Girls and Ricky Gervais’s After Life amongst others.\n\nIn the Serial Drama Category, EastEnders and Coronation Street will both be vying to break Emmerdale’s three-year winning streak, while the TV Presenter category could see Ant & Dec take home the gong for the 19th year running. No biggie.\n\nAnt and Dec won The Bruce Forsyth Entertainment Award and TV Presenter Awards at the NTAs in 2018 (Picture: Dave J Hogan/Getty Images)\n\nThe other categories are:\n\nTalent Show\n\nFactual\n\nDrama Performance\n\nThe Bruce Forsyth Entertainment Award\n\nSerial Drama Performance\n\nNewcomer\n\nLive Magazine Show\n\nTV Judge\n\nHow to vote in the NTAs 2020\n\nThe first round of voting for the NTAs is now open, letting the public pick their favourites from the long list before the first round of voting closes and the shortlist is revealed.\n\nThe shortlist will be announced in January when the final round of voting begins and all winners are announced live at the NTAs.\n\nVoting is open until 11pm Friday 25 October 2019 and there are two ways to vote:\n\nVisit the website and vote online at – www.nationaltvawards.com.\n\nOR, phone: 0844 646 2060 to ask for a voting form. Calls cost 5p plus your network access charge.\n\nWhen are the National Television Awards 2020 and are they on TV?\n\nThe NTAs 2020 are taking place on Tuesday 28 January 2020, live from London’s O2 Arena.\n\nAs always, they will air live on ITV, usually kicking off between 7pm and 8pm.\n\nAdvertisement\n\nCan you get tickets to the NTAs?\n\nIf you want to be there to watch the awards live and rub shoulders with the stars, tickets are available to the public for the NTAs. Visit nationaltvawards.com for more information.\n\nMORE: NTAs 2019 after-parties look like a right hoot\n\nMORE: Ant and Dec in ‘genuine shock’ as they win TV Presenter at National Television Awards for 18th year in a row", "description": "The National Television Awards, one of TV’s biggest nights of the year, is in a few months time and next year’s bash could be the best yet.", "authors": ["Rachael Martin"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_88333575-e1571065162649_1571126116.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-15"}