{"pub": "reuters", "url": "https://in.reuters.com/article/blackrock-results/blackrock-beats-profit-estimates-as-assets-swell-to-nearly-7-trillion-idINKBN1WU1Y2", "downloaded_at": "2019-10-15 15:02:31.499874+00:00", "title": "BlackRock beats profit estimates as assets swell to nearly $7 trillion", "language": "en", "text": "NEW YORK (Reuters) - BlackRock Inc, the world’s largest asset manager, exceeded analysts’ estimates for quarterly profit on Tuesday, as investors poured money into its fixed-income funds and cash management business amid worries about global growth.\n\nA sign for BlackRock Inc hangs above their building in New York U.S., July 16, 2018. REUTERS/Lucas Jackson/Files\n\nThe company attracted $84.25 billion in new money during the third quarter, boosting the total assets it manages to $6.96 trillion.\n\nInvestors preferred BlackRock’s low-fee passive-investment products over its actively managed funds. BlackRock’s iShares ETFs took in $41.5 billion of new money, up 15% from the prior quarter.\n\nBlackRock’s cash management business drew net inflows of $32 billion in the third quarter, taking total assets for this business to $510 billion.\n\n“Whether there is risk-on trade in a quarter or risk-off trade in a quarter, we seem to be winning more share of wallet,” Chief Executive Larry Fink said in an interview with Reuters.\n\nGlobal financial markets were roiled in the third quarter amid heightened trade tensions between the United States and China. The trade dispute fueled worries over the outlook for global growth and weighed on investors’ appetite for riskier assets like stocks.\n\n“We are seeing de-risking and that’s why you are seeing a lot of money rotating into fixed income products as opposed to stock funds and you are also seeing a lot of money flowing into cash management products,” said Kyle Sanders, an analyst with St. Louis-based financial services firm Edward Jones.\n\n“What we like is the consistency in their ability to continue to capture assets, bring more in the door, regardless of what the market is doing,” he said.\n\nFor the quarter ended Sept. 30, net income fell to $7.15 per share, down from $7.54 per share a year earlier, but topped analysts’ expectation for $6.96 per share, according to IBES data from Refinitiv.\n\nRevenue rose by 3% to $3.69 billion, driven by higher base fees and technology services revenue, offset in part by lower performance fees, the company said.\n\nBlackRock, which is trying to become a bigger provider of technology used by Wall Street firms to combat competitive pricing pressures in the asset management business, grew technology unit revenue by 30% to $259 million.\n\nBlackRock shares, up about 10.5% this year, were up about 1.8% in U.S. trading before the opening bell.", "description": "BlackRock Inc, the world's largest asset manager, exceeded analysts' estimates for quarterly profit on Tuesday, as investors poured money into its fixed-income funds and cash management business amid worries about global growth.", "authors": ["Saqib Iqbal Ahmed", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191015&t=2&i=1441128025&w=1200&r=LYNXMPEF9E17Q", "published_at": "2019-10-15"}