{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/despite-her-fashion-accolades-cardi-132720766.html", "downloaded_at": "2019-10-12 17:50:54.090460+00:00", "title": "Despite Her Fashion Accolades, Cardi B Isn't in a Rush to Start Her Own Fashion Brand", "language": "en", "text": "\"It would have to be on a certain point of my music career where I don't have to still prove myself,\" she says.\n\nSally Singer and Cardi B speaking on Vogue's Forces of Fashion panel. Photo: Corey Tenold for Vogue Magazine More\n\nIn the current vernacular, the word \"iconic\" is casually and frequently dropped, a colloquialism seemingly indiscriminate of whether that something or someone is actually worthy of the title.\n\nStill, there are those cultural icons who break through the noise. In this case, it's Cardi B, the multi-hyphenate musician, fashion designer-in-training, and actress, who Vogue deemed an icon at its 2019 Forces of Fashion conference. While Cardi, née Belcalis Almanzar, sat with Vogue Creative Director Sally Singer to discuss the merits of iconography and the artist's rapid ascent towards it, the conversation quickly evolved into one about her recent slew of fashion-capital-F moments, borrowing from the cache of establishment designers and injecting it with her own star power.\n\nOf late, there was the 2019 Grammy's red carpet, in which Cardi transported us to 1995 in Thiery Mugler under-the-sea couture; next, and in what is either a coincidence or a brilliantly executed feat of subaquatic delight, the 27-year-old arrived at this year's Met Gala in a Thom Browne lobster red Camp showstopper. More recently, a handful of triumphant appearances during Paris Fashion Week — again, Thom Browne for a business suitable two-piecer, a viral Richard Quinn look, and one $34,000 Chanel ensemble for good measure — help solidify Cardi B's fashion iconography.\n\n\"Paris to me, it was just like another level. I work so hard to these levels to be able to go to these shows,\" Cardi says. \"But let me tell you something, when it comes to the fashion industry, they don't care if you got a number one hit, all the awards, if you just ain't stylin' right, they just ain't gonna invite you to their shows, they just don't care. You gotta be into it, you gotta have that sense of style. It's something you gotta prove. I feel like it took years for me to prove it, and I finally am where I want to be.\"\n\n(Speaking of icons, it's at this moment that Cardi sings acapella \"This is What Dreams Are Made Of\" from the \"Lizzie McGuire Movie\" circa 2003, noting that the song is on repeat in her head because it's how she feels \"every single time I get invited to these fashion events because we work our asses off, we make sure everything is on point.\")\n\nOutside of luxury, Cardi B has also made a name for herself in the fast fashion space, with her two successful Fashion Nova collaborative collections; the second reportedly sold $1 million in 24 hours, nearly selling out.\n\n\"I collaborated with Fashion Nova and for my first collection it was difficult because we started designing and looking through things and I was seven months pregnant, so I was restricted from traveling and I had to see a lot of clothes through FaceTime,\" the Bronx native recalls. \"I couldn't feel the material and see how it translated in person, and that was very difficult for me…but it did really good.\"\n\nThe crash course in fashion production and the fast fashion supply chain constraints held their own surprises for Cardi. \"There were a lot of times I was frustrated. We had to work on a certain type of budget, so the clothes could be at a certain type of price, and then some of the material I hated, it's like when you see the sketching it looks amazing and it's like, 'Who the hell picked this?' 'You picked this.' 'Well, I hate it do it again.' That was such a challenge.\"\n\nDespite the experience — and naming Rihanna as an inspiration during the conversation on stage — Cardi is in no rush to start an independent line, at least not until she accomplishes more in the music space, she says.\n\n\"If I ever [design a clothing brand,] it would have to be on a certain point of my music career where I don't have to still prove myself,\" the singer says. \"I feel like Rihanna is at the point in her career where she don't gotta release music, she already proved herself, she's already there, she already put her time in, as well as Kanye [West.] He's been doing it for a long time, so he can and she can focus on their clothing brands.\"\n\nAs if the 1995 Mugler look was prophetic, the world is Cardi B's oyster, despite any of her own reservations.\n\nNever miss the latest fashion industry news. Sign up for the Fashionista daily newsletter.", "description": "In the current vernacular, the word \"iconic\" is casually and frequently dropped, a colloquialism seemingly indiscriminate of whether that something or someone is actually worthy of the title. Still, there are those cultural icons who break through the noise. In this case, it's Cardi B,", "authors": ["Alexandra Mondalek"], "top_image": "https://s.yimg.com/uu/api/res/1.2/QfQfqu1BNh9gdakIZux_Jw--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/fashionista_850/500408424ffd9a2ec363ee69b960779d", "published_at": "2019-10-11"}