{"pub": "marketwatch", "url": "https://marketwatch.com/story/slack-shares-plunge-15-on-weak-earnings-guidance-2019-09-04", "downloaded_at": "2019-09-04 23:48:13.540107+00:00", "published_at": "2019-09-04", "title": "Slack shares plunge 13% on weak earnings guidance", "language": "en", "text": "Slack Technologies Inc.’s first earnings report as a public company landed with a thud on Wednesday, pushing its already-depressed shares down 13% in premarket trading.\n\nThe workplace-communications company reported second-quarter results that exceeded Wall Street estimates but forecast a slightly larger-than-expected loss for its current quarter, renewing concerns about its road to profitability and revenue growth. Slack said it expects to lose 8 cents to 9 cents a share; analysts polled by FactSet have estimated 7 cents.\n\n“Slack has taken a positive first step right out of the gate, and we are encouraged by steady fundamentals and healthy guide,” MKM Partners analyst Rohit Kulkarni said in a note late Wednesday, in which he gave Slack shares a Buy rating and price target of $40. “However, Slack’s valuation [$14.5 billion] remains elevated. We expect investors to continue to apply premium valuation multiples as we expect Street estimates to grind higher.”\n\nThe weak guidance overshadowed what was generally a good quarter. Slack WORK, +1.84% reported a non-GAAP loss of 14 cents a share, and said revenue improved 58% to $145 million. Analysts surveyed by FactSet had expected a loss of 19 cents a share on revenue of $141.3 million. For the year, FactSet is predicting a loss of 42 cents a share on revenue of $600.6 million.\n\n“We believe channel-based collaboration is so superior to email-based communication for work, that this shift is inevitable,” Slack CEO Stewart Butterfield said in a statement announcing the results.\n\nIt may be the fastest-growing software-as-a-service (SaaS) company ever, but Slack’s results following a disappointing direct public offering underscore deep-seated concerns among investors about its growth trajectory. After opening at $38.50 on June 20 and climbing to $42, shares have sunk to $31.07 in Thursday’s premarket trading, though they shot up 8% during Wednesday’s regular session. (The S&P 500 index SPX, -1.61% has gained 17% this year.)\n\nGrowth remains a principle worry. Slack’s revenue rose 110% in fiscal years 2017-2018, but slowed to 82% in 2018-2019 and the company is now forecasting 51% in the current fiscal year, with revenue between $603 million and $610 million. Slack reported $400 million in fiscal 2019 revenue. On Wednesday, Slack said it expects Q3 revenue to grow 46% to 48%, to $154 million to $156 million.\n\nRead more: Opinion: Slack’s missteps have now made the stock a ‘buy’ at the right price\n\nA major obstacle to Slack’s growth is Microsoft Corp. MSFT, -1.70% , which includes the Teams work chat app in Office 365 business subscriptions. In July, Microsoft released statistics suggesting Teams is more widely used than Slack, largely because of adoption among companies that use Microsoft productivity software.\n\nLess than 1% of Slack’s customer base is comprised of customers that spend more than $100,000 a year, according to Bloomberg Intelligence analyst Andrew Eisenson. Slack said it had 720 of those big spenders in the last quarter, up 75% year-over-year. The company surpassed 100,000 paid customers for the quarter.\n\n“I want to emphasize the critical nature of true scalability for our enterprise customers,” Butterfield said in a conference call with analysts late Wednesday. “Only Slack’s Enterprise Grid product can support the scale and structure of the largest organizations in the world.”", "description": "Slack Technologies Inc.’s first earnings report as a public company landed with a thud on Wednesday, pushing its already-depressed shares down in premarket...", "authors": ["Jon Swartz", "Senior Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ597_Slack_ZG_20190903152710.jpg"}