{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/crypto-markets-turn-red-with-btc-price-stuck-below-8-100", "downloaded_at": "2019-10-23 10:01:47.158870+00:00", "title": "Crypto Markets Turn Red, With BTC Price Stuck Below $8,100", "language": "en", "text": "Tuesday, Oct. 22 — Crypto markets are mostly showing red candlesticks, while Bitcoin (BTC) fails to impress with a sudden drop below the $8,100 price point.\n\nCryptocurrency market daily overview. Source: Coin360\n\nBitcoin was trading above the $8,200 price mark for the better part of the day, but has dipped below $8,100 in recent hours. The world’s largest cryptocurrency traded at an intraday high of nearly $8,300, before losing ground towards its current trading price of around $8,040. BTC is reporting a loss of almost 2% on the past 24 hours.\n\nBTC daily price chart. Source: Coin360\n\nFor the second time, Bitcoin attempted to break above the $8,300 price point only to endure swift rejection. As Cointelegraph previously reported, BTC did not show any impressive price movements since the start of the weekend, when it managed to exit the $7,000 range.\n\nEther (ETH), meanwhile, is currently sitting at $171.3 per coin. The number one altcoin saw a small dip in sync with BTC and is showing a loss of around 1.3% at publishing time.\n\nCointelegraph contributor Rakesh Upadhyay recently said that the bulls have been buying the dip close to $169 for the last few days. A positive sign, according to Upadhyay, because that means that buyers are not waiting for Ether to drop to the bottom of the range at $161.056. He added:\n\n“If the bulls can push the price above the moving averages, a rally to the top of the range at $196.483 is possible. A break of this level can carry the price to $235.70 with minor resistance at $223.999.”\n\nEther seven-day price chart. Source: Coin360\n\nXRP has been trading relatively flat for the better part of the day. The third-largest coin by market capitalization is currently trading at $0.2902 per coin, down 0.54% at press time. The news of San Francisco-based blockchain startup Ripple, adding three new appointments to its global regulatory team and joining the Blockchain Association, did not have any effect on the price of XRP.\n\nXRP seven-day price chart. Source: Coin360\n\nTop 20 altcoins turn red\n\nAll of the top 20 coins are showing red candlesticks, with Bitcoin SV (BSV) taking the title of worst top-20 performer of the day, showing a 4.5% loss on the day. Cosmos (ATOM) and Tezos (XTZ) follow closely with losses of more than 3% each.\n\nAlthough not in the top 20, the number 27 by market cap, Brave Browser’s Basic Attention Token (BAT), is showing impressive gains of more than 11% on the day, to trade at $0.24 per coin at press time.\n\nThe overall cryptocurrency market cap decreased from $223.3 billion to $218.5 billion, with Bitcoin making up 66.3% of the total.", "description": "Cryptocurrency markets are mostly showing red candlesticks, while Bitcoin price is struggling below the $8,100 mark", "authors": ["Joeri Cant"], "top_image": "https://images.cointelegraph.com/images/740_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9jZmU1YzNiNjNjZmRiMmFlMDg5MWZmNDI4NWUzNDBkZS5qcGc=.jpg", "published_at": "2019-10-23"}