{"pub": "metro", "url": "https://metro.co.uk/2019/10/23/paul-hollywood-forced-to-apologise-to-great-british-bake-off-viewers-over-insensitive-diabetes-joke-10971463", "downloaded_at": "2019-10-24 02:29:36.263285+00:00", "title": "Paul Hollywood apologises to Great British Bake Off fans over diabetes joke", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nPaul Hollywood has apologised to The Great British Bake Off fans after he made an ‘insensitive’ joke about diabetes.\n\nThe TV chef upset some viewers after suggesting that one contestant’s Chelsea Buns looked like ‘diabetes on a plate’.\n\nAnd while some people took the 53-year-old’s comment as a bit of fun, others were quick to voice that the remark was both ‘stupid’ and ‘uneducated’.\n\nOne appalled fan wrote on social media: ‘Anyone else shocked at Paul Hollywood’s “diabetes on a plate” comment when discussing a dessert on tonight’s episode of GBBO?\n\nAdvertisement\n\nAdvertisement\n\n‘I feel like this kind of stuff just reinforces uneducated and frankly stupid ideas and questions about diabetes, for example, “did you get it cos you eat too much cake?” and my personal favourite, “if you ate this Mars bar, would you die?”‘\n\nPaul with his Bake Off pals (Picture: Love Productions / Channel 4 / Mark Bourdillon)\n\nAnother raged: ‘It’s like a dad joke but way off base. He’s only making himself look stupid. No one else.’\n\nOne viewer was so angered by the gag that they said it was ‘irresponsible’.\n\nThe tweeted: ‘It is very irresponsible and untrue to say it of anyone, whatever their type of diabetes.’\n\nHe quickly issued an apology… (Picture: Instagram)\n\nSoon after the influx of messages and tweets, Paul took to Instagram to issue an apology to anyone he offended.\n\nHe wrote: ‘A sweet treat, Chelsea buns … a remark re:- diabetes I made on tonight’s show was thoughtless and I meant no harm, as both my grandad and my own mother suffer/ suffered from diabetes … apologies X.’\n\nDespite the backlash, some stood up for the baker.\n\nOne wrote: ‘We love you, Paul, the way you are. You shouldn’t apologise.’\n\nAnother added: ‘You meant no harm and that is all that matters and you apologized.’\n\nAdvertisement\n\nAdvertisement\n\nLast night’s Bake Off saw Steph Blackwell, David Atherton and Alice Fevronia confirmed as this year’s finalists after Rosie Brandreth-Poynter was sent home for her disappointing break.\n\nThe Great British Bake Off final airs Tuesday at 8pm on Channel 4.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: The Great British Bake Off star Steph admits her cakes ‘look like boobs’ in brilliant mishap\n\nMORE: Great British Bake Off 2019: ‘Gutted’ Rosie crashes out as she admits competition was tough on her family", "description": "Paul Hollywood under fire from Bake Off viewers after 'insensitive' diabetes joke", "authors": ["Abbie Bray"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/09/PRI_81588055-e1569652390747_1571846384.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-23"}