{"pub": "reuters", "url": "https://af.reuters.com/article/topNews/idAFKBN1WY09H-OZATP", "downloaded_at": "2019-10-19 12:33:06.421285+00:00", "title": "Ebola concentrated in Congo mining area, still an emergency -WHO", "language": "en", "text": "GENEVA (Reuters) - Ebola is infecting and killing people in a gold mining area of eastern Democratic Republic of Congo, and the “complex and dangerous” outbreak still constitutes an international emergency, the World Health Organization (WHO) said on Friday.\n\nKavota Mugisha Robert, a healthcare worker, who volunteered in the Ebola response, decontaminates his colleague after he entered the house of 85-year-old woman, suspected of dying of Ebola, in the eastern Congolese town of Beni in the Democratic Republic of Congo, October 8, 2019. REUTERS/Zohra Bensemra\n\nThe virus has infected 3,227 people and killed 2,154 of them since the outbreak was declared in August 2018 and went on to became the world’s second worst outbreak, it said.\n\nThe WHO’s Emergency Committee on Ebola reviewed the situation since declaring the outbreak an international emergency on July 17. In a statement on Friday, it said the epidemic is “currently concentrated in the Mandima health zone in the Biakato mine health area”.\n\n“This outbreak remains a complex and dangerous outbreak,” WHO director-general Tedros Adhanom Ghebreyesus told a news conference, adding that he had accepted the independent panel’s recommendation to maintain the emergency status.\n\n“But one thing would like to underline, even if this Ebola ends it may come back, because there is instability in eastern DRC and political instability and lack of security. These are pre-conditions,” he said.\n\nFifteen new confirmed cases were reported in North Kivu and Ituri provinces in the week to Oct. 13, the WHO said in its latest update. This compared with nearly 130 cases per week at the peak in April.\n\nBut insecurity and access issues in parts of Mandima, including the Biakato mines, hamper finding infected people and tracing their contacts, as well as ensuring safe burials, it said.\n\nThirty-one of the 50 Ebola cases reported in the last three weeks were from or linked to Biakato, WHO figures show.\n\n“I do believe there will be further cases to be found in the Biakato mines area,” said Dr. Michael Ryan, executive director of WHO’s Health Emergencies Programme.\n\n“The area is that remote and the communities are that deep in the countryside, that it will be another week to two weeks before we can be sure that there is not undetected transmission\n\nin that zone,” he added.\n\nIn Mambasa and most of Mandima, experts have a good handle on the virus’ evolution, Ryan said.\n\n“But in the areas of Lwemba and Biakato mine we still don’t have a full picture as to where the virus may be.\n\n“So we don’t believe we are dealing with a catastrophic situation, the numbers are extremely low compared to before, but we don’t fully understand the dynamics of transmission in the Biakoto mine area,” he said.", "description": "Ebola is infecting and killing people in a gold mining area of eastern Democratic Republic of Congo, and the \"complex and dangerous\" outbreak still constitutes an international emergency, the World Health Organization (WHO) said on Friday.", "authors": ["Stephanie Nebehay", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191019&t=2&i=1442628293&w=1200&r=LYNXMPEF9I07Z-OZATP", "published_at": "2019-10-19"}