{"pub": "metro", "url": "https://metro.co.uk/2019/10/06/manchester-united-angry-paul-pogba-contract-claims-10869381", "downloaded_at": "2019-10-06 11:33:14.595860+00:00", "title": "Manchester United angry at Paul Pogba contract claims", "language": "en", "text": "United were unhappy with claims made about Paul Pogba (Picture: Getty Images)\n\nManchester United have been angered by claims that Paul Pogba is asking for a £600,000-a-week contract to stay at Old Trafford and have insisted the midfielder has not made any fresh wage demands.\n\nPogba has long been linked with a move away from the club and is thought to be keen on joining Real Madrid but a summer transfer failed to materialise with United unwilling to let him leave.\n\nHe has only played two games this season due to an ankle problem but there have still been rumours claiming he expects a super-expensive new deal.\n\nPaul Pogba has struggled with injury (Picture: Getty Images)\n\nWest Ham vice-chairman Karren Brady referenced the reports that claimed he wanted £600,000-a-week in a recent column for The Sun – an article that suggested United would be better off cashing in on the France international.\n\nAdvertisement\n\nAdvertisement\n\nHowever, United chiefs have hit back at claims that Pogba is demanding such a ridiculous wage hike.\n\nA club source said told the Daily Mail: ‘Paul still has two years left on his current deal with an option of an extra year so there’s been no talks about a new contract and nothing from Paul saying he wants an increase in wages.\n\n‘He’s fully focused on getting 100 per cent fit again and helping the team. Anyone that says he’s been asking for £600,000-a-week is wrong and it’s a surprise to us when someone in the game like Karren Brady [West Ham vice-chairman] refers to it.’\n\nOle Gunnar Solskjaer’s side take on Newcastle on Sunday. It is unclear whether Pogba will be fit enough to start for the Red Devils.\n\nMORE: Sean Longstaff told to ignore dream Manchester United transfer\n\nMORE: Paul Merson warns Arsenal, Man Utd, Spurs and Chelsea over Leicester’s top-four chances", "description": "Manchester United have been angered by claims that Paul Pogba is asking for a £600,000-a-week contract to stay at Old Trafford and have insisted the midfielder has not made any...", "authors": ["Metro Sport Reporter"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1178207676_1570351453.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-06"}