{"pub": "independent", "url": "https://independent.co.uk/voices/brexit-march-peoples-vote-final-say-second-referendum-london-diane-abbott-a9159526.html", "downloaded_at": "2019-10-17 09:17:37.341398+00:00", "title": "The march for a Final Say will be huge because Brexit is the biggest political issue we've ever faced", "language": "en", "text": "The Final Say march in London this Saturday is likely to be enormous. The fact is that Brexit is the single biggest issue driving British politics right now. It has brought down two Conservative prime ministers; it is possible that it could soon dispatch three.\n\nThe prospect of a second referendum is itself controversial. Yet, in the current circumstances, this controversy is unwarranted: politics is above all an expression of what people are in favour of, not what they are against. Any policy built primarily on what people are against quickly falls apart. This applies to David Cameron’s 2016 ill-conceived Brexit referendum.\n\nLabour respects the outcome of that referendum, but all it showed was that there was, in 2016, a majority against continued membership of the European Union. So be it. But there was no agreement expressed on what people wanted instead. The entire struggle over the last three years has been to try to establish that alternative.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe foolish claim that we could have a \"clean break Brexit\" is bluster. The only thing that will be cleanly broken is the economy and our living standards, and the wrangling with the EU would continue for years afterwards.\n\nLabour has consistently argued to defend and improve the living standards of the British people. Some may claim that the Brexit referendum gives the government a mandate to Leave irrespective of how much worse off people will be, but politics is not a branch of mass telepathy. There is no divining what people \"really meant\" in that first referendum. There is only what was on the ballot paper: in or out. And there is no evidence that a majority of the British people are happy to be worse off in order to leave the EU.\n\nShape Created with Sketch. Final Say petition delivered to Downing Street Show all 30 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Final Say petition delivered to Downing Street 1/30 Today the Independent's Final Say campaign and People's Vote delivered to 10 Downing Street their respective petitions calling for a public referendum on Theresa May's Brexit deal The Independent/Lucy Young 2/30 L to R: Christian Broughton, Editor, The Independent, Justine Greening, Conservative MP for Putney, Labour MP for Streatham Chuka Umunna, Lara Anne Spirit from People's Vote, Caroline Lucas, Green Party MP for Brighton Pavilion, Holly Baxter, Co-Editor Independent Voices and Christina Koci-Edwards from People's Vote hand in a petition to Downing Street The Independent/Lucy Young 3/30 Front row L to R: Christina Koci-Edwards from People's Vote, Caroline Lucas, Green Party MP for Brighton Pavilion, Labour MP for Streatham Chuka Umunna, Christian Broughton, Editor, The Independent, Vince Cable Lib Dem MP for Twickenham, Lara Anne Spirit from People's Vote and Justine Greening, Conservative MP for Putney The Independent/Lucy Young 4/30 The Independent/Lucy Young 5/30 The Independent's editor Christian Broughton delivered over one million Final Say signatures and People's Vote spokesman Chuka Umunna MP delivered 300,000 signatures to Downing Street on Monday December 3 at midday The Independent/Lucy Young 6/30 A supporter of the second referendum helps Vince Cable Lib Dem MP for Twickenham out of the rain during a protest The Independent/Lucy Young 7/30 The Independent/Lucy Young 8/30 L to R: Labour MP for Streatham Chuka Umunna, Lara Anne Spirit from People's Vote, Christian Broughton, Editor, The Independent, Caroline Lucas, Green Party MP for Brighton Pavilion, Justine Greening, Conservative MP for Putney and Christina Koci-Edwards from People's Vote on their way to hand in a petition to Downing Street The Independent/Lucy Young 9/30 Christian Broughton, Editor, The Independent, Justine Greening, Conservative MP for Putney and Labour MP for Streatham Chuka Umunna hand in the petition to Downing Street The Independent/Lucy Young 10/30 The Independent/Lucy Young 11/30 The Independent/Lucy Young 12/30 The Independent/Lucy Young 13/30 The Independent/Lucy Young 14/30 The Independent/Lucy Young 15/30 Caroline Lucas, Green Party MP for Brighton Pavilion, Labour MP for Streatham Chuka Umunna and Justine Greening, Conservative MP for Putney hand in petitions to Downing Street The Independent/Lucy Young 16/30 The Independent/Lucy Young 17/30 The Independent/Lucy Young 18/30 The Independent/Lucy Young 19/30 The Independent/Lucy Young 20/30 The Independent/Lucy Young 21/30 The Independent/Lucy Young 22/30 The Independent/Lucy Young 23/30 The Independent/Lucy Young 24/30 The Independent/Lucy Young 25/30 The Independent/Lucy Young 26/30 The Independent/Lucy Young 27/30 The Independent/Lucy Young 28/30 The Independent/Lucy Young 29/30 The Independent/Lucy Young 30/30 The Independent/Lucy Young 1/30 Today the Independent's Final Say campaign and People's Vote delivered to 10 Downing Street their respective petitions calling for a public referendum on Theresa May's Brexit deal The Independent/Lucy Young 2/30 L to R: Christian Broughton, Editor, The Independent, Justine Greening, Conservative MP for Putney, Labour MP for Streatham Chuka Umunna, Lara Anne Spirit from People's Vote, Caroline Lucas, Green Party MP for Brighton Pavilion, Holly Baxter, Co-Editor Independent Voices and Christina Koci-Edwards from People's Vote hand in a petition to Downing Street The Independent/Lucy Young 3/30 Front row L to R: Christina Koci-Edwards from People's Vote, Caroline Lucas, Green Party MP for Brighton Pavilion, Labour MP for Streatham Chuka Umunna, Christian Broughton, Editor, The Independent, Vince Cable Lib Dem MP for Twickenham, Lara Anne Spirit from People's Vote and Justine Greening, Conservative MP for Putney The Independent/Lucy Young 4/30 The Independent/Lucy Young 5/30 The Independent's editor Christian Broughton delivered over one million Final Say signatures and People's Vote spokesman Chuka Umunna MP delivered 300,000 signatures to Downing Street on Monday December 3 at midday The Independent/Lucy Young 6/30 A supporter of the second referendum helps Vince Cable Lib Dem MP for Twickenham out of the rain during a protest The Independent/Lucy Young 7/30 The Independent/Lucy Young 8/30 L to R: Labour MP for Streatham Chuka Umunna, Lara Anne Spirit from People's Vote, Christian Broughton, Editor, The Independent, Caroline Lucas, Green Party MP for Brighton Pavilion, Justine Greening, Conservative MP for Putney and Christina Koci-Edwards from People's Vote on their way to hand in a petition to Downing Street The Independent/Lucy Young 9/30 Christian Broughton, Editor, The Independent, Justine Greening, Conservative MP for Putney and Labour MP for Streatham Chuka Umunna hand in the petition to Downing Street The Independent/Lucy Young 10/30 The Independent/Lucy Young 11/30 The Independent/Lucy Young 12/30 The Independent/Lucy Young 13/30 The Independent/Lucy Young 14/30 The Independent/Lucy Young 15/30 Caroline Lucas, Green Party MP for Brighton Pavilion, Labour MP for Streatham Chuka Umunna and Justine Greening, Conservative MP for Putney hand in petitions to Downing Street The Independent/Lucy Young 16/30 The Independent/Lucy Young 17/30 The Independent/Lucy Young 18/30 The Independent/Lucy Young 19/30 The Independent/Lucy Young 20/30 The Independent/Lucy Young 21/30 The Independent/Lucy Young 22/30 The Independent/Lucy Young 23/30 The Independent/Lucy Young 24/30 The Independent/Lucy Young 25/30 The Independent/Lucy Young 26/30 The Independent/Lucy Young 27/30 The Independent/Lucy Young 28/30 The Independent/Lucy Young 29/30 The Independent/Lucy Young 30/30 The Independent/Lucy Young\n\nAs all the Leave campaign fantasies have gone to die where pledges from Boris Johnson repose, the Tory proposition is equally straightforward. It is a Trump Brexit. Once the US president had set his policy on promoting Brexit, favouring Nigel Farage, making his support for Boris Johnson conditional on achieving a no deal exit and threatening to put the NHS on the table, then the overwhelming bulk of the Tory party fell into line.\n\nThe actual Brexit in front of us is one that will, as Trump wants, \"Make America Great Again\" via Britain – with all the lower safety and food standards and environmental protections, the accelerated privatisation of our public services and the Americanisation of our workforce that entails.\n\nBoris Johnson’s latest proposals still take Britain outside a customs union and with no alignment to the single market. On the contrary, he is consciously aiming for the scope to race to the bottom. That is what a no-deal Brexit entails. Under these circumstances, there is a concrete choice: a \"Trump Deal\" for Britain, versus a deal which protects our own rights and living standards.\n\nLabour’s policy is clear: will block no deal. We will then call a general election. We will negotiate a reasonable Leave option, which keeps us in the customs union and closely aligned to the Single Market, to protect jobs, living standards and the environment. And finally we will put that option back to the people, versus the option of Remain.\n\nLabour is the only party standing across Britain that is committed to delivering a second referendum on Brexit – neither the Tories nor the Liberal Democrats will offer that if they are in government.\n\nThe march on Saturday will be huge, because the issue is huge. So large that all political forces have been affected. I know that Labour has, and I believe that the People’s Vote campaign has redirected its focus on opposing Brexit too.\n\nThe time for divisiveness is long gone. All of us who oppose the Trump, Farage and Johnson's Brexit must come together, to represent the best interests of the majority.", "description": "The Final Say march in London this Saturday is likely to be enormous. The fact is that Brexit is the single biggest issue driving British politics right now. It has brought down two Conservative prime ministers; it is possible that it could soon dispatch three.", "authors": ["Diane Abbott"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/09/19/Brexit-.jpg", "published_at": "2019-10-17"}