{"pub": "metro", "url": "https://metro.co.uk/2019/10/08/couple-get-married-hospital-room-groom-rushed-brain-surgery-wedding-day-10879663", "downloaded_at": "2019-10-08 09:39:04.369187+00:00", "title": "Couple marry in hospital after groom has brain surgery on wedding day", "language": "en", "text": "Jessica and Timothy tied the knot in hospital a week after the groom woke up from a medically induced coma (Picture: Jessica Berty /SWNS.COM)\n\nA bride and groom tied the knot in a hospital room after their wedding day was interrupted by brain surgery.\n\nJessica Dhans, 30, spent what was meant to be her wedding day watching as Timothy Berty, 25, was rushed into the emergency room to remove the left side of his skull due to an abscess on his brain.\n\nTimothy woke up from a medically-induced coma two days later. His first words to Jessica were: ‘You, me, forever.’\n\nThe couple, who met in 2013 and got engaged in 2014, spent years planning their wedding.\n\nThe $10,000 event was set to take place in a local firehouse where Timothy worked as a volunteer firefighter.\n\nBut two days before the wedding, the engineer began behaving strangely.\n\nJessica, who works for a medical provider, said: ‘Everything was going to plan then the day before our wedding rehearsal dinner, we were setting up the firehouse and Timothy kept falling asleep.\n\nTimothy was rushed to hospital the day before his planned wedding and needed urgent surgery on his brain (Picture: Jessica Berty /SWNS.COM)\n\n‘He had a really bad headache. He was falling asleep on the floor and on tables. He went home to sleep and the next morning, when I woke up, he wasn’t in bed.\n\nAdvertisement\n\nAdvertisement\n\n‘Timothy was in the living room, watching TV and he was talking gibberish.\n\n‘He thought he was speaking to me in sentences but he wasn’t making any sense.’\n\nJessica was so stressed out about the wedding planning that she didn’t realise Timothy was ill.\n\nOn her way to meet her mum the day before the wedding, Jessica called Timothy’s mother Amy to ask her to check on him.\n\nAn hour later Amy called Jessica to say that Timothy needed to go to hospital. Timothy was air-lifted to UPMC Presbyterean Hospital in Pittsburgh, PA.\n\nFollowing surgery Timothy had to wear a hockey helmet to protect his brain as he was missing half his skull Picture: Jessica Berty /SWNS.COM)\n\nDoctors told Jessica that a sinus infection had spread to Timothy’s brain and resulted in an abscess.\n\n‘He had a sinus infection but because he had a deviated septum it couldn’t drain out,’ Jessica said.\n\n‘It went up into his brain and his brain swelled. We sat in the hospital at 6.30 in the morning on what would have been our wedding day.\n\n‘The surgeon came in and asked to talk to him. But Timothy couldn’t talk, he was grunting at this point.\n\n‘The surgeon told me he had to go to the ER as Timothy had an abscess on his brain.’\n\nFollowing surgery Timothy was put in a medically induced coma for two days.\n\nThe family had to contact guests and tell them the wedding was off.\n\nThe couple have matching tattoos with the first words Timothy said when he came out of his coma: ‘you, me, forever’. (Picture: Jessica Berty /SWNS.COM)\n\nJessica said: ‘We told everyone that they could still go to the firehouse as everything was set up, the food was there and the cake was there.\n\nAdvertisement\n\nAdvertisement\n\n‘Everyone said it was horrible and the weirdest wedding – the bride and groom and their parents weren’t there. I expect it was very morbid.\n\n‘Timothy got out of surgery at one pm and our wedding was supposed to be at three.’\n\nWhen Timothy woke up from his coma, he was upset to learn the wedding hadn’t happened, and wanted to get married as soon as they could.\n\nOne week later they tied the knot in Timothy’s hospital room.\n\n‘It was pretty much another regular day,’ Jessica said.\n\n‘Timothy kept asking about us getting married.\n\n‘I messaged our friend Courtney Gondringer, 28, who is an ordained minister, and I asked her if she was free that night. She came over after work.\n\n‘The nurses got Timothy dressed because he was still hooked up to drains and tubes. My mom and I got dressed in the bathroom.’\n\nTwo weeks later, after 23 days in hospital, Timothy was discharged and returned home where Jessica gave her new husband nightly feeds through a tube, sponge baths, and antibiotics twice a day.\n\nThe couple eventually got matching tattoos of the first words Timothy said when he came out of the coma: ‘you, me, forever’.\n\nTimothy said: ‘I wanted us to get married as soon as we could. Jessica never left my side, she stuck with me, she was there the whole time. I truly knew that this was the girl that I needed to marry.\n\nAdvertisement\n\n‘It was so frightening. It changed my perspective. I’m not as active as I want to be but I am getting there.\n\n‘It feels great to be a married man. I am just happy that I found my perfect mate.’\n\nDo you have a powerful wedding story to share? Get in touch by emailing MetroLifestyleTeam@Metro.co.uk.\n\nMORE: Newlyweds go straight from their wedding to McDonald’s\n\nMORE: Huda Beauty’s new Nude Obsessions Eyeshadow Palettes cater to all skin tones\n\nAdvertisement Advertisement", "description": "Jessica Dhans, 30, spent what was meant to be her wedding day watching as Timothy Berty, 25, was rushed into the emergency room.", "authors": ["Ellen Scott"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_887952221_1570514781.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-08"}