{"pub": "washingtonpost", "url": "https://washingtonpost.com/business/economy/white-house-delayed-ukraine-trade-decision-in-august-a-signal-that-us-suspension-of-cooperation-extended-beyond-security-funds/2019/10/24/a42b8992-f67d-11e9-8cf0-4cc99f74d127_story.html", "downloaded_at": "2019-10-24 23:55:28.560035+00:00", "title": "White House delayed Ukraine trade decision in August, a signal that U.S. suspension of cooperation extended beyond security funds", "language": "en", "text": "The August exchange between Bolton and Lighthizer over the trade matter represents the first indication that the administration’s suspension of assistance to Ukraine extended beyond the congressionally authorized military aid and security assistance to other government programs. It is not clear whether Trump directed Bolton to intervene over Ukraine’s trade privileges or was even aware of the discussion.\n\nAD\n\nAD\n\n“It was pulled back shortly before it was going to POTUS’ desk,” one administration official said, referring to the Ukraine paperwork and using an acronym for the U.S. president. “Bolton intervened with Lighthizer to block it.”\n\nIn response to questions from The Washington Post, another administration official said the presidential proclamation about the trade status of Ukraine and two other nations had been held up for several weeks in the office of the White House staff secretary as part of a routine “country review process.”\n\nOne former U.S. government official said the president wanted “the total elimination” of the global trade program at issue. Known as the “generalized system of preferences,” or GSP, it allows 120 countries to ship roughly 1.5 percent of total U.S. imports without paying tariffs.\n\nAD\n\nAD\n\nBut in March 2018, Trump signed legislation reauthorizing the program through 2020, and Lighthizer in recent weeks has been negotiating with India over restoring its GSP status, which was suspended in March.\n\nBolton resigned Sept. 10, one day before the administration released the military aid under pressure from lawmakers.\n\nIn early October, nearly two months after withdrawing the initial effort to restore Ukraine’s trade privileges, Lighthizer sent the necessary paperwork to the White House for a second time. He later withdrew it again, on Oct. 17, amid an intensifying storm over the president’s policy toward Ukraine.\n\nThe administration now plans to include the restoration of some of Ukraine’s suspended privileges in a package of trade measures slated for release this month, a person briefed on the planning said.\n\nAD\n\nAD\n\nThis account is based on interviews with 10 current and former administration officials, who spoke on the condition of anonymity to discuss internal deliberations. Through a spokeswoman, Bolton declined to comment. The White House declined to comment. Lighthizer’s office did not respond to requests for comment.\n\nBolton’s intervention came as the president was telling White House aides that any assistance for Ukraine depended upon Zelensky publicly stating that his government would investigate Hunter Biden’s role as a board member of the Ukrainian gas company Burisma, according to congressional testimony this week by acting U.S. ambassador William B. Taylor Jr.\n\n“The president doesn’t want to provide any assistance at all,” Taylor said Tim Morrison, the National Security Council’s top Russia official, told him Aug. 22.\n\nAD\n\nAD\n\nFive days later, Bolton arrived in Kyiv for a meeting with Zelensky. And Sept. 1, Gordon Sondland, U.S. ambassador to the European Union, who was coordinating the administration’s Ukraine policy, told Taylor that “everything” depended upon Zelensky saying publicly that he would investigate Joe Biden and allegations of Ukrainian interference in the 2016 U.S. election, Taylor told the House impeachment inquiry Tuesday.\n\nBolton did not share Trump’s view that Ukraine might be a source of damaging political information, but he was privy to weeks of back-and-forth within the administration and in Kyiv about the military aid.\n\nTaylor testified Tuesday that Bolton was “so irritated” by a linkage between “investigations” and a proposed meeting between Trump and Zelensky that he had shut down a July 10 White House Ukraine policy gathering and told National Security Council staffers there “that they should have nothing to do with domestic politics.”\n\nAD\n\nAD\n\nBolton also had instructed the then-head of Russia policy at the NSC to “brief the lawyers,” according to a copy of Taylor’s opening statement obtained by The Washington Post.\n\nAt issue in Bolton’s warning over the trade privileges was Lighthizer’s recommendation to the White House that the president reinstate Ukraine’s ability to export some products to the United States on a duty-free basis. Roughly a third of Ukraine’s benefits under the program was suspended in December 2017 amid long-standing concerns that the country was routinely violating U.S. intellectual property rights.\n\nThat suspension took effect in May 2018. After the Ukrainian government then took steps to address the U.S. criticism, such as by passing a law to improve the collection of copyright royalties, officials in the Office of the U.S. Trade Representative (USTR) considered allowing the country to regain about a third of its suspended duty-free privileges.\n\nAD\n\nAD\n\nOver the summer, USTR officials reached out to the International Intellectual Property Alliance, or IIPA, an industry coalition that had filed the initial complaint against Ukraine, to ask if it would object if the government restored some of Ukraine’s GSP rights. IIPA represents copyright holders in the music, film, book and software industries who are being cheated out of millions of dollars in royalty payments.\n\nLong a haven for piracy, Ukraine was one of 11 countries this year listed on USTR’s priority watch list for intellectual property violations. U.S. officials say Ukrainian government offices often use counterfeit software. Black-market operators produce pirated physical and digital products. Some claim to represent copyright holders and collect royalty payments on their behalf but then fail to distribute them to the artists.\n\n“We were supportive of the U.S. government decision one way or the other,” said Eric Schwartz, an attorney representing IIPA.\n\nAD\n\nAD\n\nUSTR’s decision to partially suspend Ukraine’s duty-free privileges affected products such as chocolate bars, helium, mushrooms, deodorant and telescopic gun sights, according to a 2017 Federal Register notice.\n\nThe partial suspension dramatically affected U.S. imports of those individual products. Ukrainian chocolate shipments to the United States last year fell by more than half to $110,000 from $247,500, according to the U.S. International Trade Commission’s online database.\n\nBut Ukraine is a minor participant in the GSP program, and its partial suspension carried only modest financial consequences. Of the country’s $1.4 billion in sales to American customers last year, just $51 million entered the United States via the duty-free program.\n\nAD\n\nIndia, which also has been suspended from the program, is its largest beneficiary, with $6.3 billion in U.S. sales last year.\n\nAD\n\n“We really haven’t heard much about this suspension from the Ukraine side,” said Morgan Williams, president of the U.S.-Ukraine Business Council. “We think they ought to be more interested in it.”\n\nOver the years, various Ukrainian governments have failed to follow through on repeated promises to tighten their enforcement of intellectual property rights. At a USTR hearing in September 2017, Vitalii Tarasiuk, head of the economics and trade office at the Ukrainian Embassy in Washington, said intellectual property protection was “one of the top priorities” for their government.\n\nHe also said “ongoing Russian aggression” limited the resources Kyiv could devote to improving its intellectual property environment.\n\nTrump took office vowing to crack down on foreign countries that had taken advantage of the United States in trade. Even as he confronted major trading partners such as China and the European Union, the president dispatched Lighthizer to address shortcomings in smaller trade programs.\n\nThree days before Christmas 2017, the president cracked down on Ukraine for a chronic failure to “provide adequate and effective protection of intellectual property rights (IPR) despite years of encouragement and assistance from the U.S. Government,” according to a USTR statement at the time.\n\n“President Trump has sent a clear message that the United States will vigorously enforce eligibility criteria for preferential access to the U.S. market,” Lighthizer said in announcing the move. “Beneficiary countries choose to either work with USTR to meet trade preference eligibility criteria or face enforcement actions. The administration is committed to ensuring that other countries keep their end of the bargain in our trade relationships.”\n\nTrump delayed the effective date of the partial suspension for 120 days, saying Ukraine “has a viable path to remedy the situation, including improving the current legal regime governing royalty reimbursement to right holders’ organizations.”\n\nWhen Kyiv failed to act quickly enough, the administration implemented the partial cutoff April 26, 2018. Ukraine subsequently passed legislation to address some of the White House’s concerns. The measure was welcomed by U.S. industry and government officials. But it left in place existing rogue operators, many with government connections, a major shortcoming in the eyes of American critics.\n\nStill, U.S. officials, with industry support, thought it made sense to reward Ukraine’s efforts by restoring to duty-free status some of the products that had been eliminated last year.\n\nPer routine practice, Lighthizer’s recommendation was reviewed widely in the administration this year, including at the Office of Management and Budget and the State Department. The formal paperwork was sent to the White House staff secretary’s office but never advanced to the president’s desk for signature, officials said.\n\nIn response to questions, a senior administration official last month said the Ukraine decision had been delayed as part of a routine review. This month, the Ukraine announcement was set to be packaged with separate trade actions involving Thailand and Mali, and was readied for action.\n\nThen as the Ukraine-focused House impeachment inquiry gathered steam, Lighthizer yanked the Ukraine recommendation for a second time.", "description": "John Bolton, then-national security adviser, had warned the U.S. trade representative that President Trump probably would oppose any action that benefited the government in Kyiv.", "authors": ["David J. Lynch", "Financial Writer Covering Trade", "Josh Dawsey", "Reporter Covering The White House"], "top_image": "https://www.washingtonpost.com/resizer/7ejcHWf99hgLOnf-THV2iLjIb58=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/X6ZP4WXWU4I6TMWSD434TWBNXM.jpg", "published_at": "2019-10-24"}