{"pub": "bbc", "url": "https://bbc.com/news/world-australia-50077792", "downloaded_at": "2019-10-17 05:16:39.789448+00:00", "title": "Former Anglican dean jailed for raping boy in Australia", "language": "en", "text": "Image copyright Royal commission Image caption Graeme Lawrence speaks at a national inquiry into sexual abuse in 2016\n\nA former Anglican Dean of Newcastle in Australia has been jailed for raping a 15-year-old boy in 1991.\n\nGraeme Lawrence, now 77, is reported to be the second most senior Australian religious figure to be convicted of child sexual abuse, after Catholic Cardinal George Pell.\n\nLawrence was Anglican dean in the New South Wales city when he lured the boy to his home and raped him.\n\nA court rejected Lawrence's assertion that he had never met his victim.\n\nJudge Tim Gartelmann sentenced Lawrence to spend a maximum of eight years in jail, saying he had exploited his position of power to abuse the boy.\n\n\"The victim and his mother must have trusted him because he was the dean,\" Judge Gartelmann told the Newcastle District Court, the Australian Associated Press reported.\n\nThe court heard Lawrence had invited the boy to his home following a youth concert at Newcastle's Christchurch Cathedral.\n\nHe had forced the boy - who \"was so scared he was shaking\" - to the floor before raping him, the judge said on Thursday.\n\nLawrence served as dean for 24 years until 2008, but was defrocked by the Anglican church in 2012 after the abuse allegations came to light.\n\nMedia playback is unsupported on your device Media caption Church 'should emphasise prevention' in positions of trust\n\nHe will be eligible for parole after four-and-a-half years.\n\nPell, one of the Catholic Church's most senior figures, was jailed for six years in March after being convicted of sexually abusing two boys in the 1990s.\n\nThe former Vatican treasurer is waiting to learn whether his final bid to overturn his convictions will be heard by a court.", "description": "Graeme Lawrence is the second most senior Australian religious figure to be jailed for sexual abuse.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/A7B8/production/_109263924_8037918-4x3-940x705.jpg", "published_at": "2019-10-17"}