{"pub": "businessinsider", "url": "https://businessinsider.com/ex-canopy-growth-ceo-bruce-lintons-talks-about-new-ventures-2019-9", "downloaded_at": "2019-09-18 23:24:18.030803+00:00", "title": "The man who built Canopy Growth into the world's biggest cannabis grower before being ousted told us why he picked pet-food CBD and psychedelics for his next ventures", "language": "en", "text": "The ex-CEO of the cannabis giant Canopy Growth can't sit still for long.\n\nIn July, Bruce Linton was ousted from the company he founded and built into the largest legal cannabis producer after the Constellation Brands-controlled board pushed for a focus on quarterly profits, rather than splashy acquisitions. Now he's ready to discuss his next act.\n\nLinton is taking on new positions as the executive chairman of Gage Cannabis Co., a Michigan dispensary chain; as a special adviser at Better Choice Co., a CBD-pet-food supplier; and as a director at Mind Medicine, a company developing psychedelic-based drugs for FDA approval.\n\nRead more: Here are the 3 top pot stocks to bet on in the US and one to avoid, according to Wall Street's leading cannabis analyst\n\nApart from his active roles, Linton will become an activist investor — the \"good kind,\" according to a statement — at Slang Worldwide, a cannabis company, and DNA Genetics. Canopy Growth signed partnerships with these companies under Linton's tenure.\n\nBusiness Insider caught up with Linton on Tuesday afternoon on the sidelines of the Cannabis Private Investment Summit in Manhattan, New York. We discussed how he chose the companies he wanted to work with and talked about the burgeoning opportunity in psychedelics, and he shared some insight into the issues facing the Canadian cannabis sector, including the highly public meltdown of the cannabis grower CannTrust.\n\n'I'm cheering for the entrepreneur'\n\nLinton said he was initially reluctant to get back into cannabis, and he spent some time after he was fired in July thinking about how he could get involved with companies working on climate-change issues, instead.\n\n\"I thought about something totally different to do,\" Linton said. \"If I never do anything in cannabis again, people will say 'Man, that guy was a genius. He was there, it went boom.'\"\n\nBut in the first few weeks after his ouster, he said he was fielding a lot of calls and emails from cannabis companies eager to bring him on board.\n\n\"I said 'no thanks,' and they thought I was negotiating,\" Linton said. \"I was like, I'm f---ing busy. I'm not negotiating.\"\n\nThen, Linton said, they came back and doubled their offers. He said he selected the companies because he wanted to have a comprehensive view of what was going on in cannabis, both geographically and categorywise.\n\nLinton spent time with the leaders of a few different companies, having them come and visit with him and his family in his hometown of Ottawa, Ontario. He went for long \"four-to-five hour\" drives with the entrepreneurs so they could talk and see if they aligned.\n\n\"I'm not really cheering for money; I'm cheering for the entrepreneur,\" Linton said. \"So I don't want to cheer for an idiot.\"\n\nLinton is branching out into a venture focused on psychedelic therapies. Richard Vogel/AP\n\nPsychedelics, dispensaries, and CBD pet food\n\nLinton said he picked companies to fit a \"short-, medium-, and long-term\" growth cycle. Gage, the dispensary chain, opened its first store on Saturday, and Linton said it was set to grow rapidly in the near future.\n\nWhile it's still early days in the psychedelic field, Linton said that was a long-term opportunity because Mind Medicine is focused on drug trials and Food and Drug Administration approval, which can take years.\n\n\"I think the intellectual property is going to be around dosage-control systems\" for psychedelics like psilocybin-containing mushrooms, Linton said. One of the key areas that Mind Medicine is working on is a plant-derived product that can help wean people off of opioids, he said.\n\nLinton is also nearing a deal to work with a US cannabis company or multistate operator. While speaking with Business Insider, he was wearing a shirt with the logo of that company covered by a blank piece of paper attached with clothespins, as he said the deal hadn't closed yet.\n\nCannTrust let the Canadian cannabis sector 'take punch after punch'\n\nNow that Linton is not running a publicly traded cannabis company, he had some harsh words for his former competitor CannTrust, the Canadian cannabis company that has been at the center of a series of corporate scandals over growing illegal marijuana in unlicensed facilities.\n\nLinton said people at CannTrust wanted to \"get rich quick.\"\n\nRead more: Here's the pitch deck that cannabis-beverage startup K-Zen used to raise $5 million from seasoned Silicon Valley VC firm DCM Ventures\n\nCannTrust let the Canadian cannabis sector \"take punch after punch because of their bad behavior,\" Linton said. He's not wrong: A recent poll conducted in Canada by the market-research firm Ipsos found that cannabis companies were suffering from extremely low favorability ratings, just ahead of mortgage lenders and tobacco companies, and well behind the oil-and-gas, carbonated-soft-drink, and alcohol industries.\n\n\"It's one of those cases where on every level, there failed to be good governance and good execution after an issue,\" Linton said.\n\nAs the CEO of a company, if you \"learn something you didn't want to know\" — like illegal cannabis in your facility — \"then you have to be strong enough to say, 'I now know something I don't like, and we're going to change it and identify it to the authorities and move on in a regulated way,'\" Linton said.", "description": "Bruce Linton is pursuing new ventures both inside and outside of the cannabis space. We caught up with him on Tuesday.", "authors": ["Jeremy Berke"], "top_image": "https://amp.businessinsider.com/images/5d8256de2e22af76a75051f2-1920-960.jpg", "published_at": "2019-09-18"}