{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7600289/Mother-daughter-related-Queen-died-South-Africa-crash.html", "downloaded_at": "2019-10-22 13:42:12.501004+00:00", "title": "Mother and daughter related to the Queen died in South Africa crash", "language": "en", "text": "A mother and daughter who were distant relations of the Queen died after they were involved in a head-on car crash as they returned from a safari in South Africa, an inquest has heard.\n\nLouise Sword, 53, and her 12-year-old daughter Tabitha, of Lurgashall, West Sussex, died after their SUV collided with a Mercedes near Zinkwazi during their holiday.\n\nMrs Sword was the sister-in-law of Lady Helen Windsor - the daughter of Duke and Duchess of Kent - who is 43rd in line to the throne. Louise's brother Tim Taylor is Lady Helen's husband.\n\nLouise Sword, 53, and her 12-year-old daughter Tabitha tragically died in a crash in South Africa, an inquest near their home in Sussex has heard\n\nThe family were on a summer holiday and were returning to their lodge in Kwazulu-Natal, South Africa after spending the day on safari.\n\nBut as they drove along the N2 highway a Hyundai H100 car driving towards them on the northbound carriageway suffered a blow out in a rear tyre and began to slow down.\n\nA Mercedes travelling behind the Hyundai swerved 'at the last minute' in an attempt to avoid the car which had not activated its hazard lights or pulled over to the side of the road.\n\nThe Mercedes veered into the southbound carriageway, clipping the Hyandai as it went and then smashed head-on into the the Swords' Toyota Fortuner SUV which was travelling in the opposite direction.\n\nThe driver of the Mercedes was killed in the horrific crash and wreckage was strewn all over the road.\n\nAn inquest into their deaths in Crawley, West Sussex heard Tabitha, who was a rear seat passenger, died after suffering catastrophic injuries in the crash at around 2.30pm on August 10 last year.\n\nHer mother was airlifted to a hospital in Durban but died of her injuries on the journey and was pronounced dead on arrival Ethekwini Hospital.\n\nPost-mortem examinations found both died as a result of injuries sustained in the crash, the hearing was told.\n\nA Mercedes travelling in the other direction from theirs swerved into the path of their SUV\n\nMrs Sword's husband Alistair, 53, a financial marketeer, and son Benjamin, 11, who were also in the car, suffered serious injuries but survived.\n\nPenelope Schofield, West Sussex coroner, said: 'It appears they were involved in a head-on collision with a vehicle that was travelling on the wrong side of the woad which was doing so because it had to take evasive action.\n\n'I can only surmise that the Mercedes driver did not notice the Hyundai was slowing down and took evasive action at the last minute.'\n\nShe said: 'We want to put on record our condolences to the family for the loss of Louise and Tabitha in the most tragic circumstances.'\n\nThe coroner concluded that both mother and daughter died as a result of a road traffic collision in South Africa.\n\nLady Helen was a fashion ambassador to Giorgio Armani for 17 years and also worked alongside the art dealer Karsten Schubert.\n\nMr Taylor is an art dealer and runs a gallery opposite the exclusive Connaught Hotel near Hyde Park, one of the most expensive areas of London.\n\nThe couple have two sons and two daughters. Columbus, 24, Cassius, 21, Eloise, 15, and Estella, 13.", "description": "Louise Sword, 53, and her 12-year-old daughter Tabitha, of Lurgashall, West Sussex, died after their SUV collided with a Mercedes near Zinkwazi during their holiday.", "authors": ["Jaya Narain", "Richard Spillett For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/13/20034072-0-image-a-80_1571746460865.jpg", "published_at": "2019-10-22"}