{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7587597/Lamborghini-Aventador-owner-fined-50-parking-fine.html", "downloaded_at": "2019-10-18 10:37:18.679210+00:00", "title": "Lamborghini Aventador owner fined £50 parking fine", "language": "en", "text": "A wealthy businessman has lashed out in anger after he was slapped with a parking ticket because his £270,000 Lamborghini Aventador exceeded the edge of the bay.\n\nGary Digva, 37, parked his yellow 217mph supercar near Nottingham city centre and went for a workout at a nearby gym where he trains roughly four times a week.\n\nBut the business owner was left enraged when he returned and found the £50 fine, claiming that the width of the vehicle meant he could not fit in the regular space.\n\nA wealthy businessman has lashed out in anger after he was slapped with a parking ticket because his £270,000 Lamborghini Aventador exceeded the edge of the bay\n\nGary Digva (left), 37, parked his yellow 217mph supercar near Nottingham city centre and went for a workout at a nearby gym where he trains roughly four times a week\n\nNottingham City Council's parking wardens had issued him the ticket for his car 'not fitting fully within the bay'.\n\nDrivers 'must park as close to the kerb as possible' at bays in the city for safety purposes and to avoid obstructing other vehicles and cyclists, the council stressed.\n\nBut Mr Digva felt he was targeted for 'having a nice car'.\n\n'I park in that bay four times a week to go to the Edwards Performance gym and all my cars fit outside the bays as they are too small for bigger vehicles,' he said.\n\nBut the business owner was left enraged when he returned and found the £50 fine, claiming that the width of the vehicle meant he could not fit in the regular space\n\n'It doesn't have any signs anywhere about saying the whole car has to fit within the bay. I think that's misleading.\n\n'I am barely over the line as well. It's not a huge issue. But now I'm facing a fine.\n\n'There was an obstruction on the pavement - the parking meter - so I didn't park right up to the kerb.\n\nI park in that bay four times a week to go to Edwards Performance gym and all my cars fit outside the bays\n\n'I just feel like I was fined because I have a nice car to be honest. I was just going to the gym. I paid to park. I'm not trying to fleece anyone.\n\n'I believe the bays are no longer suitable for the cars of today. They are wider and bigger now. '\n\nMr Digva is now liable for a £50 fine, if paid within 28 days of being issued - it can be reduced to £25 if paid within 14 days.\n\nBut he has said he will take the matter further with the council through appeals and is refusing to pay the notice.\n\nMr Digva is the owner of Road Angel, which sells a range of travel products across the UK including dash cams, reversing aides and a device that provides up-to-date information on the roads\n\nA Nottingham City Council spokesperson said: 'We're sorry to hear that Mr Digva feels his fine was unfair and he is welcome to challenge it through the official appeals process.\n\n'It was issued because his car was parked outside the white lines of the parking bay and a distance from the kerb.\n\n'Drivers are not permitted to park like this, even if they have a valid ticket or permit, because it can create an obstruction for other vehicles and particularly cyclists.'\n\nMr Digva is the owner of Road Angel, which sells a range of travel products across the UK including dash cams, reversing aides and a device that provides up-to-date information on the roads.", "description": "Gary Digva, 37, parked his yellow 217mph supercar near Nottingham city centre and went for a workout at a nearby gym where he trains four times a week. He was enraged to find a £50 parking fine.", "authors": ["Rod Ardehali For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/10/19877426-0-image-a-69_1571391819410.jpg", "published_at": "2019-10-18"}