{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7564541/Tackle-football-like-smoking-warms-PSA-youth-tack-CTE.html", "downloaded_at": "2019-10-12 00:32:17.137881+00:00", "title": "'Tackle football is like smoking' warms PSA about youth tack and CTE", "language": "en", "text": "A gut-wrenching public service announcement shows youth football players in crisp uniforms puffing on cigarettes, comparing tackle ball to smoking because both do more damage the earlier kids start.\n\nIn the case of football, that's brain damage, linked to chronic traumatic encephalopathy, or CTE, the devastating disease thought to have driven late NFL player Aaron Hernandez to suicide in 2017.\n\nSimilarly, the lungs never grow to their full potential if you start smoking before age 25, when they stop developing.\n\nCTE is cause by repeated head traumas, and brains don't bounce back from injury as well under the age of 12, studies suggest.\n\nSo delaying playing tackle football until after age 14 could help protect kids against the earliest, worst damage to their developing brains, the PSA from the Concussion Legacy Foundation argues.\n\nSCROLL FOR VIDEO\n\nA new PSA compares tackle football for young to smoking, in that the risks of developing CTE later in life are 10-times higher if a child starts at five, compared to starting at 14, just as starting to smoke at a young age is far more dangerous\n\nThe PSA starts off as a sunny all-American afternoon.\n\nBoys who look to be about 10 line up along the line of scrimmage, hike the ball, run a play, and a red jerseyed-player and a blue jerseyed-player thud to the ground in a tackle.\n\nTheir helmeted heads bounce a little against the field.\n\nIn the background, a coach asks if their alright, congratulates them on a good play, and hands out celbretory cigarettes.\n\nA cloud of smoke from one child's cigarette all but fills the screen, obscuring the little boy holding it.\n\nIn another shot, a mother looks proud, even gleeful to light her son's cigarette as he sits in uniform on the bench.\n\nYoung boys heads thud to the ground in the video. The longer a person plays football, the greater their odds of CTE. The damage is worst for kids under 12 whose brains don't recover as fully, according to prior research\n\nBrain scans show the drastic differences between a normal 27-year-old's brain after death and the shape of former NFL player Aaron Hernandez, who was confirmed to have CTE after his 2017 suicide, which doctors say was likely driven by the devastating football-linked disease\n\nAccording to statistics from an accompanying Concussion Legacy Foundation study, kids that start playing tackle football at age five are 10 times more likely to winde up with CTE than are kids who start at 14.\n\nIn fact, a study published Thursday, found that that CTE risks are not even directly correlated to the number of concussions someone sustains over a lifetime - but of how many year's they spend playing football.\n\nFor every 2.6 years someone plays the sport, their risk doubles.\n\nSo for a career player who retires from the NFL at the average age of 35, the difference in his CTE risks varies considerably based on whether he started playing at five or 14.\n\nIn the PSA, smoke fills the screen at one point, obscuring a child. At its end, a child's voice asks, 'you wouldn't let me smoke, why should I start tackle?'\n\nThe player that started at age five would be at about 43 percent greater risk of developing CTE than the player who started at 14.\n\nThe authors of the new study found that a player with CTE was 10-times more likely to have played football for 14.5 years.\n\nLike smoking, the best way to prevent the devastating disease associated with football is to never play.\n\nBut if children are going to play the rough sport, it's safer for them to wait to start until they're older.\n\n'You wouldn't let me smoke,' says the PSA's young quarterback, poised to catch a hike.\n\n'Why should I start tackle?'", "description": "People who started playing tackle football at age five are 10-times more likely to develop CTE later in life than those who started at 14, a Concussion Legacy Foundation PSA video warns.", "authors": ["Natalie Rahhal Deputy Health Editor For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/23/19609400-0-image-a-20_1570832832241.jpg", "published_at": "2019-10-11"}