{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/10/rocket-labs-new-5-year-faa-license-will-help-it-streamline-its-rocket-launch-process", "downloaded_at": "2019-10-11 00:16:45.211151+00:00", "title": "Rocket Lab’s new 5-year FAA license will help it streamline its rocket launch process – TechCrunch", "language": "en", "text": "Rocket Lab has received a new five-year Launch Operator License from the Federal Aviation Administration, which grants it permission to do multiple launches of its Electron rocket from its LC-1 launch site in New Zealand without having to seek individual clearance for each one. While not the only limiting factor, this should help Rocket Lab increase the frequency of its launches from LC-1, servicing more customers more often for commercial small satellite customers.\n\nUntil now, Rocket Lab has had to obtain a license (or multiple licenses) from the FAA for each individual rocket it flew — the company has seemingly managed that process just fine to date, but it’s an added process that probably adds a lot of time and effort to each launch attempt, even if it hasn’t directly flummoxed any mission to date.\n\nRocket Lab says this will provide a “streamlined path to orbit” for its customers, however, which should make it easier for the company to operate its flexible model that is designed to work better with the shifting timelines of small sat startups and younger commercial space companies, while still ensuring that Rocket Lab’s launch capacity is used to maximum effect. Rocket Lab just recently swapped one payload for another for an upcoming launch, for example.\n\nRocket Lab is part of the Commercial Spaceflight Federation, an industry consortium that also includes SpaceX, Virgin Galactic, Relativity Space and others that is petitioning the FAA for reforms to regulations that would update them to better suit the current state of the commercial space business. SpaceX CEO Elon Musk recently praised the FAA as a partner that it has been able to work with very efficiently, speaking specifically about the licensing process regarding its ongoing Starship test program.\n\nThis license isn’t tied to the agency’s overall process for licensing U.S.-based launches (LC-1 is in New Zealand, after all) but it is another indication that the current FAA is more than willing to work with younger commercial space companies to ensure they can do business in an efficient manner.", "description": "Rocket Lab has received a new five-year Launch Operator License from the Federal Aviation Administration, which grants it permission to do multiple launches of its Electron rocket from its LC-1 launch site in New Zealand without having to seek individual clearance for each one. While not the only limiting factor, this should help Rocket Lab […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/10/EGioPQUVUAA5SxM.jpeg?w=699", "published_at": "2019-10-10"}