{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/trump-syria-turkey-isis-kurdish-forces-war-latest-a9149571.html", "downloaded_at": "2019-10-09 18:53:00.455155+00:00", "title": "Trump calls Turkey's military offensive in Syria 'a bad idea' after allowing invasion", "language": "en", "text": "Donald Trump says he \"does not endorse\" Turkey's military offensive in Syria, which he made possible in part by pulling American forces from the region.\n\nThe comment was made in a statement released by the White House, in which he claimed Turkey is committed to ensuring the safety of civilians, in spite of concerns that the country will target Kurdish fighters who helped fight against the Isis insurgency there.\n\n\"This morning, Turkey, a NATO member, invaded Syria. The United States does not endorse this attack and has made it clear to Turkey that this operation is a bad idea,\" the statement says. \"There are no American soldiers in the area. From the first day I entered the political arena, I made it clear that I did not want to fight these endless, senseless wars—especially those that don’t benefit the United States.\"\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHe continues: \"Turkey has committed to protecting civilians, protecting religious minorities, including Christians, and ensuring no humanitarian crisis takes place—and we will hold them to this commitment. In addition, Turkey is now responsible for ensuring all ISIS fighters being held captive remain in prison and that ISIS does not reconstitute in any way, shape, or form. We expect Turkey to abide by all of its commitments, and we continue to monitor the situation closely.\"\n\nTurkish president Recep Tayyip Erdogan announced the start of the military offensive on Wednesday, just days after Mr Trump said he would be pulling American troops from the border area.\n\nThe decision by Mr Trump has been met with widespread criticism in Washington, even among staunch supporters of the president like senator Lindsey Graham.\n\nMeanwhile, on the ground in Syria, reports have emerged of chaos and roads stuck with gridlock following the start of the offensive, which has included air strikes and artillery fire.\n\nThe Kurdish-led Syrian Democratic Forces (SDF) have said that at least two civilians have been killed, and two others injured in the village of Misharrafa, which is located west of Ras al-Ain.\n\nThe SDF has played a crucial role in fighting off Isis in the region, and had long been an ally to the United States there.\n\nTurkey, meanwhile, views the Kurdish forces as a terrorist group.", "description": "Donald Trump says he \"does not endorse\" Turkey's military offensive in Syria, which he made possible in part by pulling American forces from the region. The comment was made in a statement released by the White House, in which he claimed Turkey is committed to ensuring the safety of civilians, in spite of concerns that the country will target Kurdish fighters who helped fight", "authors": ["Clark Mindock"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/09/13/Donald-Trump-Turkey-Syria.jpg", "published_at": "2019-10-09"}