{"pub": "euronews", "url": "https://euronews.com/2019/10/26/protests-iraq-find-outlet-world-snapchat-n1072266", "downloaded_at": "2019-10-26 00:54:50.740476+00:00", "title": "Protests in Iraq find an outlet to the world: Snapchat", "language": "en", "text": "Iraqi protesters returned to streets around the country Friday to resume anti-government protests, but only one social media service wasn't blocked from offering a window into the ongoing unrest: Snapchat.\n\nReuters reported that at least 25 people were killed during the day's protests, with almost 1,800 people injured across the country. Protests began peacefully in the country Oct. 1 but escalated quickly and turned violent after security forces used tear gas, water cannons, and live ammunitionon protesters.\n\nProtesters are demanding more jobs, an improvement in basic services and an end to government corruption.\n\nIraqi authorities restricted access to social platformsincluding Facebook, Instagram and Twitter a day after the initial protests, disconnecting protesters and making it more difficult for them to organize. A couple of days later, the government plunged the country into a total digital blackout for several days. It was not immediately clear why Snapchat had been left unblocked or if it had been part of the government's initial ban.\n\nWhile Snapchat is most associated in the United States with younger users, the app is popular across the Middle East.\n\nNBC News was able to view hundreds of videos coming in from cities across Iraq documenting the entire day of demonstrations via Snapchat's interactive heatmap. Footage shared from the capital,f Baghdad, showed thousands of protesters flooding Tahrir Square waving Iraqi flags in the air.\n\nWhile some parts of the demonstration appeared peaceful with protesters dancing and chanting, other videos showed tear gas canisters being used to disperse people who had gathered throughout the city. Videos continued to show protesters out in the streets well after 10 p.m. local time. One man filmed a crowd chanting, \"People want to topple the regime.\"\n\nMany Iraqis have been using virtual private networks (VPNs) to circumvent the social media restrictions, allowing for some footage of demonstrations to trickle through to the outside world. VPNs are used around the world to sidestep government restrictions on the internet.\n\nAnti-government protesters try to break into the provincial council building during a demonstration in Basra, Iraq, on Oct. 25, 2019. Nabil al-Jurani\n\nInternet access has returned to parts of Iraq, but social media platforms still remain inaccessible without a VPN.\n\n\"The state imposed a near-total telecommunication shutdown in most regions, severely limiting press coverage and transparency around the ongoing crisis,\" according toNetblocks, a nongovernmental group that tracks internet disruptions and shutdowns around the world.\n\nNetblocks confirmed that Snapchat is still available in the country. Netblocks ran an analysis of the networks of leading fix-lined and internet mobile providers in Iraq and it found that most major social media platforms are still down in the country, though Snapchat is not blocked.\n\nFriday marked the first day of protests since demonstrations were suspended after 150 protesters were shot and killed by security forces two weeks ago.\n\nEven after the government announced reforms Oct. 8, protesters continued to take to the streets across the country Friday. And for the first time, the entire day was documented and shared chronologically.\n\nNetblocks confirmed that connectivity hasn't returned to ordinary levels since the Oct. 2 shutdown.\n\n\"If this is the case, the blocking of platforms really shapes which social media people use,\" said Alp Toker, executive director of Netblocks.", "description": "NBC News was able to view hundreds of videos coming in from cities across Iraq documenting the entire day of demonstrations via Snapchat's interactive heatmap.", "authors": [], "top_image": "https://static.euronews.com/articles/4259976/1000x563_nbc-191025-iraq-protests-se-339p_1a07014f8b5847b6d9e0c5296b9893dc.jpg", "published_at": "2019-10-26"}