{"pub": "afr", "url": "https://afr.com/companies/telecommunications/vocus-releases-proof-nbn-is-bypassing-retailers-20191020-p532dt", "downloaded_at": "2019-10-20 13:28:07.439811+00:00", "title": "Vocus releases 'proof' NBN is bypassing retailers", "language": "en", "text": "Vocus, which is both a retailer and an infrastructure provider like NBN Co, claimed NBN Co was violating its wholesale-only mandate set out in the 2016 Statement of Expectations, in which the government sets out the parameters of NBN Co's remit.\n\n\"The government expects the network to be a wholesale-only access network, available to all access seekers, that operates at the lowest practical level in the network stack,\" the Statement of Expectation reads.\n\nVocus chief executive Kevin Russell said: \"Decide for yourself if NBN is ‘wholesale-only’ when its industry engagement (i.e. direct sales) team works with end users on tender designs, proposes a 100 per cent NBN solution to meet the end user’s requirements, then lists which retailers are capable of delivering those requirements.\"\n\nDenies anything wrong\n\nVocus' decision to share the letter from the NBN came a week after Mr Russell became the first telco chief to openly attack the NBN for its controversial push into the enterprise space.\n\nTelstra chairman John Mullen soon followed suit, saying: \"It seems a waste of collective resources to be delaying investment in the consumer roll-out to people yet to be connected, and instead be focusing investment in the enterprise market where the NBN's duplicating existing high-speed fibre for no service or speed advantage.\"\n\nBut NBN Co denies there is anything wrong with its policy of doing these sorts of deals directly with end users. It points out that it is permitted to enter into a contract with residential customers to extend a fibre-to-the-node connection all the way to the premises. In such deals the customer pays NBN directly for the extension, but when it comes to using that fibre connection, they must go through a retailer.\n\nUnder the deal proposed in the letter, NBN Co says it is doing the same thing with a business customer by agreeing to build the infrastructure. Once the infrastructure is complete, the customer must go through a retailer if it wants to use the fibre connection.\n\nAdvertisement\n\nPaul Tyler, NBN Co chief customer officer for business, said: \"NBN Co is ... accused of overstepping the mark as a wholesaler. To be clear, we do not provide carriage services directly to end users. We do, however, engage directly with end users to educate them on the availability of business NBN offerings and in some cases contract with end users to upgrade their underlying NBN network technology.\n\n\"Carriage services are always provided to end users through a retailer. Despite mischievous claims to the contrary, NBN Co does not recommend retailers nor provide sales leads, NBN Co is not involved in setting retail prices or terms and does not require exclusive use of NBN Co infrastructure. Those arrangements are struck directly between end users and their chosen retailer.\"\n\n'Strict commercial basis'\n\nMr Russell also complained that NBN Co, as a government-underwritten company, was able to undercut commercial competitors because it didn't need to generate a commercial rate of return. Across the operations, NBN Co is targeting an internal rate of return of 3.2 per cent. Vocus says its investors look for closer to 15 per cent.\n\nBut Mr Tyler rejected this argument, saying: \"When we invest in the enterprise market, we do so on a strict commercial basis that requires a high internal rate of return. In fact, our business plans call for these returns to be higher than other segments so we can use the revenue from this market to reinvest in upgrading the residential network.\"\n\nTwo weeks ago the Australian Competition and Consumer Commission issued NBN Co with an official warning for \"serious breach\" of its impartiality obligations, after it found the government-owned company had been discriminating between retailers of its enterprise products.\n\nBut ACCC chairman Rod Sims said NBN Co's move into the enterprise segment was good for competition overall, and has said nothing about NBN Co doing deals directly with end users. The federal government has also given NBN Co its full backing to pursue market share in the business segment.", "description": "Telecoms firm Vocus has released a document it claims proves NBN Co is violating its wholesale-only mandate by directly contacting end users.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.1839%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_55/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/5c4cdeca1db91d1c66688cbd7d090b420b155486", "published_at": "2019-10-20"}