{"pub": "reuters", "url": "https://reuters.com/article/us-hongkong-protests/hong-kong-goes-quiet-as-subway-shops-close-after-night-of-violence-idUSKBN1WK012", "downloaded_at": "2019-10-05 22:57:31.604379+00:00", "title": "Hong Kong goes quiet as subway, shops close after night of violence", "language": "en", "text": "HONG KONG (Reuters) - Hong Kong fell eerily silent on Saturday, with the subway and most shopping malls closed in an unprecedented shutdown of one of the world’s biggest commercial centers after the government invoked emergency measures to curb months of unrest.\n\nHundreds of anti-government protesters defied a ban on face masks and took to the streets across the Chinese-ruled city earlier in the day. But by evening they had largely dispersed in preparation for bigger marches planned for Sunday.\n\nRail operator MTR Corp suspended all services, paralyzing transport in the Asian financial hub, while malls and shops closed early after a night of chaos in which police shot a teenage boy and protesters torched businesses and metro stations.\n\nProtests had erupted on Friday across the former British colony hours after its embattled leader, Carrie Lam, invoked colonial-era emergency powers for the first time in more than 50 years to ban the use of face masks demonstrators have been using to hide their identities.\n\nThe night’s “extreme violence” justified the use of the emergency law, Beijing-backed Lam said in a television address on Saturday.\n\n“The radical behavior of rioters took Hong Kong through a very dark night, leaving society today half-paralyzed,” she said in pre-recorded remarks.\n\n“The extreme violence clearly illustrated that Hong Kong’s public safety is widely endangered. That’s the concrete reason that we had to invoke emergency law yesterday to introduce the anti-mask law.”\n\nUndeterred by the ban and transport shutdown, several hundred pro-democracy protesters - many wearing masks - marched through the normally bustling shopping district of Causeway Bay on Saturday, but there was no repeat of Friday’s violence.\n\nOther groups gathered in Sheung Shui close to the border with mainland China and in the busy shopping and tourist district of Tsim Sha Tsui.\n\n“We felt we had to get out and show our basic right to wear a mask,” said one protester, Sue, 22, who wore a black mask and dark glasses to the Causeway Bay march.\n\nRelated Coverage U.N. calls for probe into violence related to Hong Kong protests\n\n“The government needs to learn it can’t squeeze Hong Kong people like this.”\n\nThe increasingly violent demonstrations that have roiled the city for four months began in opposition to a bill that would have allowed people to be extradited to mainland China for trial. They have since spiraled into a broader pro-democracy movement.\n\nThe unrest has plunged Hong Kong into its biggest political crisis since its handover from Britain to China in 1997 under a “one country, two systems” formula that granted it autonomy and broad freedoms not enjoyed on the mainland.\n\nChina’s Hong Kong and Macao Affairs Office said on Friday the protests were evolving into a revolution backed by foreign forces and could not continue indefinitely.\n\nThe United Nations human rights chief called on Saturday for an independent probe into the violence seen during the protests.\n\nMichelle Bachelet told a media conference in Kuala Lumpur the U.N. was: “alarmed by the injuries to the police and protesters, including journalists and protesters shot by law enforcement officers”.\n\nTRANSPORT SHUTDOWN\n\nMTR Corp shut its network, which carries about 5 million passengers a day, while shopping malls and supermarkets also closed in a blow for a city on the edge of recession.\n\n“As we are no longer in a position to provide safe and reliable service to passengers in the circumstances, the corporation had no choice but to make the decision to suspend the service of its entire network,” MTR said in a statement.\n\nProtesters had set fires at stations as well as to an empty train, and injured two staff, added MTR.\n\nAnti-government protesters wearing masks attend a protest in central Hong Kong, China October 5, 2019. REUTERS/Jorge Silva\n\nThe airport express, one of the most popular routes to the airport, re-opened with a restricted service on Saturday, MTR said.\n\nMore than a dozen shopping malls, supermarkets, and branches of Bank of China (Hong Kong), Bank of East Asia, and Industrial and Commercial Bank of China, which have been targeted by protesters, did not open on Saturday.\n\nShoppers formed long lines in supermarkets ahead of the expected closures.\n\nCompanies across Hong Kong, the Asian base for many global businesses, are increasingly walking a tightrope between the protesters and China’s Communist Party rulers in Beijing.\n\nOn Saturday, shoe brand Vans came under fire from Hong Kong internet users for removing from its website a design submitted in an online competition that showed Hong Kong protesters clad in yellow hard-hats.\n\nIn a statement, Vans said designs were removed “in line with our company’s long-held values of respect and tolerance, as well as our clearly communicated guidelines for this competition”.\n\nFACE MASK BAN\n\nThe ban on face masks, which took effect on Saturday, was ordered under emergency laws that allow authorities to “make any regulations whatsoever” in what they deem to be the public interest.\n\nThe move enraged protesters, however, who took to the streets on Friday night to vent their anger, many wearing masks in open defiance. Some set fires, hurled petrol bombs at police and burned the Chinese national flag, in a direct challenge to authorities in Beijing.\n\nBachelet said on Saturday that face masks should not be used to provoke violence, but she warned Hong Kong against using the ban to target particular groups or curtail the right to freedom of assembly.\n\nPolice said an officer in Yuen Long, a district in the outlying New Territories that saw fierce clashes in July, had fired a shot in self-defense on Friday night after a protester threw a petrol bomb at him, setting him on fire.\n\nSlideshow (18 Images)\n\nMedia said a 14-year-old boy was shot and the city’s Hospital Authority said his condition was now stable but gave no further details.\n\nAlso late on Friday, about 100 demonstrators besieged a branch of the Bank of China (Hong Kong) in the high-end shopping district of Causeway Bay, while across the harbor in the district of Kowloon, protesters smashed the glass store front of a China Life Insurance branch.\n\nPolice fired volleys of tear gas to disperse protesters in flashpoint districts such as Causeway Bay, Sha Tin and Wong Tai Sin, underscoring the challenges they face as protests show no sign of letting up.\n\nHospital authorities said 31 people were hurt in Friday’s protests, two of them seriously.", "description": "Hong Kong fell eerily silent on Saturday, with the subway and most shopping malls closed in an unprecedented shutdown of one of the world's biggest commercial centers after the government invoked emergency measures to curb months of unrest.", "authors": ["Felix Tam", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191005&t=2&i=1437314969&w=1200&r=LYNXNPEF9404U", "published_at": "2019-10-05"}