{"pub": "theverge", "url": "https://theverge.com/2019/10/16/20917619/skydio-2-dock-drone-self-flying-autonomous-box-dronedeploy-mapping-surveillance", "downloaded_at": "2019-10-16 20:40:34.784671+00:00", "title": "Skydio has a motorized charging box to make its self-flying drone truly autonomous", "language": "en", "text": "Skydio makes one of the most incredible drones on the market, and while we haven’t gotten to review the new Skydio 2 yet, the tiny California startup is already setting its ambitions higher than prosumers and videographers. For industrial and commercial entities, it wants to remove humans from the equation entirely, letting them rely on its obstacle-dodging, self-flying technology for automated mapping and surveillance.\n\nTo that end, it’s announcing the Skydio 2 Dock, a drone-in-a-box solution that theoretically lets the Skydio 2 fly mission after mission all by itself. As you can see in the video above, it’s got a motorized door and slide-out arm that the drone can land on as well as a built-in charging station for a special version of the Skydio 2’s battery with contact pins on the bottom.\n\nSkydio co-founder Adam Bry tells me that his drone can find its way back to the box without GPS, thanks to its visual and inertial navigation systems, and it can land precisely on that pad time after time, thanks to a pair of visual markers on top. He wouldn’t tell me how long they’ve tested it at a stretch, but he showed me a video of it landing while blasted with a 25 mph gust of wind from a leaf blower. Bry says it should be able to do that in practice.\n\nThe weatherproof box is also designed to hold the drone securely for transport. Bry says it’ll work as carry-on luggage, and there’s a Wi-Fi- and Ethernet-connected computer to automatically beam data back home after each mission — missions that will likely be flown through Skydio partner DroneDeploy to start. You can plug the box into a normal AC outlet, or into 12V DC power if you wanted to mount it to an SUV or truck. “Mounting this to a work vehicle or a first responder’s vehicle makes a lot of sense, and that’s why we want to have the 12V DC option,” says Bry.\n\nIt’s definitely not the first drone dock we’ve seen or even the first drone-in-a-box. We introduced you to Sunflower Labs’ drone surveillance system for homeowners in 2018, and Percepto has a drone-in-a-box system called Sparrow that was chosen to inspect an Italian power plant last May. Here’s a cool video of that one:\n\nSkydio’s dock doesn’t swap out the battery, unlike some. It’ll only charge it at normal speed, which can take about an hour.\n\nOf course, a system like this won’t be much use yet in the United States or other drone-restrictive countries where laws require drones to have a human pilot who can see the aircraft at all times. Percepto’s press release actually mentions that the drone flying over the Italian power plant is still supervised by a human operator, “as Italy’s regulatory framework does not currently allow fully autonomous drone flight.”\n\nFor many mapping and surveillance missions, you also wouldn’t necessarily need Skydio’s main selling point of obstacle avoidance. Just fly a drone up high enough, and it can see what you need to photograph far below. But Skydio says its drone can account for changes that would frustrate other systems, like how the cranes at a construction site will move around.\n\nPerhaps more importantly, Bry claims the Skydio 2 Dock will be cheaper than anything else on the market. While other options can cost “many tens or hundreds of thousands of dollars,” he says the Dock will be “vastly more accessible than any other drone-in-a-box solution that has been talked about.”\n\nBut he won’t say how much it will cost or when it’ll launch, except that it’ll be a slow rollout with select customers early next year. As you can see in our video tour of Skydio’s facilities below, the company only has a tiny assembly line building everything it makes. It only took one day for that assembly line to hit capacity for all the drones it’ll ship by the end of the year.", "description": "With the Skydio 2 Dock, a drone-in-a-box solution, the California startup wants to let companies rely on its obstacle-dodging, self-flying drone for automated mapping and surveillance — no humans needed.", "authors": ["Sean Hollister", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/9L-NObxP85BcbVvotPVlcT4m5bU=/0x131:3341x1880/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19293003/Skydio_Dock_Takeoff__1_.jpg", "published_at": "2019-10-16"}