{"pub": "bbc", "url": "https://bbc.com/news/business-50216964", "downloaded_at": "2019-10-29 06:13:44.045641+00:00", "title": "Hong Kong's leader issues fresh recession warning", "language": "en", "text": "Image copyright Getty Images\n\nHong Kong's leader Carrie Lam said the territory is likely to record negative growth for the year as months of protests have knocked the economy.\n\nThe unrest has disrupted businesses and dealt a particularly heavy blow to the tourism and retail sectors.\n\nThe warning comes ahead of preliminary gross domestic product figures due on Thursday that are expected to show Hong Kong entered a technical recession.\n\nThat is defined as two consecutive quarters of negative growth.\n\nIn a briefing in Hong Kong on Tuesday, Ms Lam said the third quarter growth numbers are likely to show that outcome.\n\nTo combat the slowdown, she said the city has so far injected more than HK$20bn ($2.6bn; £2bn) to support the economy including the transport, tourism and retail sectors.\n\nMs Lam said the government will deliver more relief measures, without giving specific details.\n\nHer comments follow a similar warning from the territory's Finance Secretary Paul Chan over the weekend. He said it would be \"extremely difficult\" to hit the government's pre-protest forecast of growth of between 0% and 1% for 2019.\n\n\"The blow to our economy [from the protests] is comprehensive,\" Mr Chan said.\n\nThe demonstrations began over a proposed extradition bill between the territory and mainland China, and have evolved into demands for greater freedoms.\n\nImage copyright Getty Images Image caption Five months of protests in Hong Kong have hit the territory's economy\n\nHong Kong is part of China, but its citizens have more autonomy than those on the mainland.\n\nClashes between police and activists have become increasingly violent, with police using tear gas and protesters storming parliament.\n\nThose protests have led to a sharp decline in tourist arrivals, with visitor numbers expected to have slumped 50% in October.\n\nHong Kong was one of the world's most visited cities last year, with 30 million tourists.\n\nRetailers have also been hard hit. Some shops have been forced to shorten trading hours, while workers report fears over their safety as well as getting to work.\n\nMr Chan said in August that retail sales had plunged more than 25% - the biggest monthly drop on record.", "description": "Ms Lam says the economy is likely to have contracted as long-running protests continue.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/95B4/production/_109442383_carrielamsmall.jpg", "published_at": "2019-10-29"}