{"pub": "nationalreview", "url": "https://nationalreview.com/corner/game-of-thrones-episode-two-pace-problems", "downloaded_at": "2019-10-05 06:55:35.952660+00:00", "title": "Game of Thrones Episode Two Review: Speed Things Up", "language": "en", "text": "Kit Harington and Emilia Clarke in Game of Thrones (HBO)\n\nSpoilers below!\n\nI generally agree with much of what David has written about the first two installments of the final season of Game of Thrones. But I want to throw in a criticism I’ve been mulling.\n\nFor a long time there were rumors that the final episodes of Game of Thrones would be extra long, perhaps even “movie-length.” After watching last night’s episode, I think that would have been better. The pacing of both episodes has been off. In the first, the reunions were almost all way too short. The conversation between Arya and the Hound should have been allowed to breathe, instead it butted-up against the reunion with Gendry which also seemed stunted. All of the interactions we’ve been waiting for were clipped. Sanda and Dany should have done a couple rounds. The romantic stuff between Jon Snow and Dany was visually cool (Dragons!), but felt like box-checking. Gotta show they’re still a couple!\n\nThere are exceptions. For example, the interaction in episode one between Dany and Sam, as David has written, was really well done. And I did think the teaser shot of Jamie seeing Bran at the end of episode one was great and their conversation last night was just right.\n\nBut in last night’s episode we had a bit of the reverse problem. I take David’s point about crafting the “deep breath before the plunge” but at times it felt like padding. And some of it came at the expense of some scenes that should have been drawn out. I, for one, would have loved to hear a lot more of Tyrion’s conversation with Bran. I’m of mixed minds about how they handled the most important conversation so far, between Jon and Dany about his real identity. This, after all, is the heart of the coming intrigue. Cutting it short for understandable reasons, while teasing her fearful contemplation of losing her claim to the throne might have been the right call.\n\nBut there was another problem with last night’s installment. Because viewers have been trained to look for cues and clues who is next to die, much of the episode seemed like an effort for people to get their “Who’s about to buy the farm?” bingo cards filled out. It’s like that scene in Hardhome when the wilding mom tells her daughters she’ll be joining them soon on another boat — you knew she was about to become an ice zombie. The stuff with Grey Worm last night seemed like a textbook example of the how the gods — old, new, many-faced, and fire — laugh when man plans. The Knighting of Brienne, combined with her battle assignment, was indeed poignant. But it also felt like she was getting her metaphorical gold watch before her retirement as a character. I’m particularly worried that all of the talk about the crypt being the safest place is a huge setup for some close-quarter tragic carnage.\n\nI think if they had combined these two episodes into a single 90-minute-plus movie, they would have worked out a lot of these issues better, leaving episode two for the Mother of all Battles and the Final Four for the more interesting stuff. Of course, I could be wrong. We won’t know until we see the whole thing play out. But that’s how I felt as they unfolded.", "description": "Viewers spent most of the episode trying to figure out who is going to be killed next.", "authors": ["Jonah Goldberg", "Andrew C. Mccarthy", "Alexandra Desanctis", "Kevin D. Williamson", "John Yoo", "Jim Geraghty", "Kyle Smith", "David French", "Mairead Mcardle", "Victor Davis Hanson"], "top_image": "https://i1.wp.com/www.nationalreview.com/wp-content/uploads/2019/04/MV5BNzA2MjI3ODY5MF5BMl5BanBnXkFtZTgwNDIxNDEzMzI@._V1_SY1000_CR0015021000_AL_.jpg?fit=1200%2C701&ssl=1", "published_at": "2019-04-22"}