{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/oct/08/the-guardian-view-on-faltering-brexit-talks-a-no-deal-election-is-on-the-cards", "downloaded_at": "2019-10-09 07:09:25.444428+00:00", "title": "The Guardian view on faltering Brexit talks: a no-deal election is on the cards | Editorial", "language": "en", "text": "European governments have been justifiably sceptical about Boris Johnson’s approach to Brexit negotiations. After Tuesday’s extraordinary developments, scepticism may have hardened into the certainty that they are dealing with a government willing to risk a no-deal future in order to win a general election. According to a briefing from a No 10 aide, the German chancellor, Angela Merkel, told the prime minister that “the UK cannot leave [the EU] without leaving Northern Ireland behind in a customs union and in full alignment for ever”. The source added that this made a deal look impossible now and in the long term. Earlier, another off-the-record steer from Downing Street had suggested that if negotiations broke down, the Conservative party would fight an election on a no-deal ticket.\n\nIn Berlin, a government spokesman refused to comment on the Merkel-Johnson phone call. In Brussels, officials said they did not recognise the comments attributed to Ms Merkel as EU policy. The European council president, Donald Tusk, was more forthright, tweeting directly to the prime minister: “What’s at stake is not winning some stupid blame game.”\n\nWhatever was actually said, this crunch week of negotiations has morphed into precisely that, because of Downing Street’s decision to brief in such incendiary fashion. It will be hard to row back from here, as evidence mounts that a breakdown in negotiations is something Mr Johnson and his chief adviser, Dominic Cummings, are ready to actively seek, as long as they can pin it on the perfidy of the EU. The truth is that the government probably still wants a deal, not least to avoid the chaotic and dangerous consequences that its own plan, Operation Yellowhammer, identified. But its “two borders for four years” plan – requiring single-market checks between Britain and Northern Ireland, and customs checks on the island of Ireland – is almost certainly not going to be the basis for one. As has been made clear from the outset of negotiations, the EU will not countenance the physical infrastructure that would necessarily accompany such checks in Ireland, creating a de facto border and undermining the Good Friday agreement.\n\nGiven this reality, Mr Johnson may be refocusing on what has been his overwhelming priority all along: winning a general election. If negotiations break down, Mr Johnson is obliged by the Benn act to seek an extension to the 31 October deadline. In any subsequent election, he will need to convince furious leave voters that it wasn’t his fault he failed to deliver. It may well serve this purpose for the meltdown to be as acrimonious as possible, with the EU, as well as parliament, in the dock. That would allow an election to be fought on a no-deal platform, neutralising the threat from Nigel Farage’s Brexit party, in the expectation that the remain vote will stay split.\n\nOn Tuesday night parliament was again prorogued – lawfully on this occasion – ahead of the Queen’s speech next week. When it reconvenes on Monday, it will still be true that a majority in the House of Commons opposes no deal. It will still be true that a no-deal Brexit on 31 October is illegal. If talks on a deal do collapse this week, MPs must ensure that parliamentary sovereignty over the process is upheld. That is the first task. But given Tuesday’s developments, which once again revealed this government’s dangerous disregard for the national interest, that seems likely to be only the beginning of the battle to prevent no deal.", "description": "Editorial: The blame game has begun after a No 10 briefing of an Angela Merkel phone call. A public row serves the government’s purpose", "authors": [], "top_image": "https://i.guim.co.uk/img/uploads/2019/10/08/10439151n.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=bbc9576347eaad6b38c2dcec73edfdb4", "published_at": "2019-10-08"}