{"pub": "guardian", "url": "https://theguardian.com/football/2019/sep/25/chelsea-grimsby-carabao-cup-match-report", "downloaded_at": "2019-09-25 23:30:42.593143+00:00", "title": "Hudson-Odoi scores on return to round off Chelsea’s 7-1 romp against Grimsby", "language": "en", "text": "The biggest cheer of the night was reserved for the moment when Callum Hudson-Odoi wriggled into the Grimsby area in the 89th minute, checked inside, swerved to the left and cracked a low shot past James McKeown’s despairing dive. It was a fine way for the 18-year-old to celebrate his new five-year deal and the latest in a growing list of reasons for Frank Lampard to give thanks to Chelsea’s flourishing academy.\n\nMK Dons v Liverpool, Manchester United v Rochdale: Carabao Cup – live! Read more\n\nThere were plenty of positives as Lampard collected his first home win of the season. Chelsea had six youth players on the pitch and four more on the bench by the end of this 7-1 romp, with Ian Maatsen and Tino Anjorin coming on their debuts midway through the second half. Billy Gilmour, bright and inventive in midfield, caught the eye on his first start. Marc Guehi, only 19, belied his tender years with an assured debut in central defence. And Reece James, the youngster tipped to take Cesar Azpilicueta’s place at right-back one day, introduced himself to the first team with a lovely goal, curling in a precise shot from 25 yards with eight minutes left.\n\nBut Lampard, whose side host Manchester United in the fourth round, wants more. He was unhappy that Chelsea missed a chance to keep their first clean sheet of the season and his analysis even included criticism of Hudson-Odoi’s performance in the first half. Lampard said that the left winger, grasping for sharpness on his return from a serious achilles injury, had ignored instructions to run behind Grimsby’s defence. Strong words were required in the dressing room at half-time.\n\nYet Hudson-Odoi grew into the game in the second half, as did Christian Pulisic on the opposite flank, and Lampard would also heap generous praise on his youngsters. “The two young lads improved the team when they came on,” Chelsea’s manager said.\n\n“Billy Gilmour ran the game from midfield. Marc Guehi was solid. The opportunities are there but now the hard work really begins to get in there regularly.”\n\nAmid the focus on the kids there was also encouragement for some of Lampard’s more experienced players. Four minutes had passed when Ross Barkley fizzed a low drive inside McKeown’s near post. The hosts built on Barkley’s first goal of the season three minutes later, a deflected cross from James reaching Michy Batshuayi, who grabbed his first goal for Chelsea since January 2018 with a sharp finish.\n\nFacebook Twitter Pinterest Reece James (left) scored Chelsea’s fifth on his debut, on a night when Frank Lampard also gave Tino Anjorin his first outing. Photograph: Chris Lee/Chelsea FC via Getty Images\n\nHowever the League Two side halved the deficit in the 19th minute, exposing Chelsea’s defensive frailties when Kurt Zouma allowed a long punt to squeeze through to Matt Green, whose venomous shot sent the noisy travelling contingent wild.\n\nLampard called Grimsby’s goal a disaster but Chelsea continued to dominate, earning a penalty when Green fouled Zouma. This time, however, spot-kick duties did not fall to Barkley, who missed from 12 yards against Valencia last week. Pedro stepped up to send McKeown the wrong way. “The good thing in my job is I can choose who does things and I chose Pedro to be captain and take a penalty tonight,” Lampard said.\n\nA fourth goal arrived when James conjured a brilliant assist, jabbing a cross into the six-yard box with the outside of his right boot. Zouma prodded in from close range.\n\nJames looked the part after returning from an ankle injury. “Reece’s performances last year at Wigan, in the team of the year in the championship, showed the talent he’s got,” Lampard said. “He’s got a great player and person to look up to in Azpilicueta. It’s just the start for Reece.” The best was yet to come from the 19-year-old, who made it 5-1 in the 82nd minute. Pulisic also became more of an influence, creating Batshuayi’s second, and there was still time for Hudson-Odoi, twisting and turning on the left, to round off a comprehensive win.", "description": "Callum Hudson-Odoi struck Chelsea’s seventh and Michy Batshuayi scored twice in a 7-1 victory over Grimsby in the Carabao Cup third round", "authors": ["Jacob Steinberg"], "top_image": "https://i.guim.co.uk/img/media/17e39078261c22af5ef734106797c405f5cc109a/372_180_2540_1524/master/2540.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d3f49f475d34540c3f90267011889eff", "published_at": "2019-09-25"}