{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/13/wiesberger-wins-italian-open-tops-race-to-dubai-ra", "downloaded_at": "2019-10-13 18:37:09.946256+00:00", "title": "Wiesberger wins Italian Open, tops Race to Dubai rankings", "language": "en", "text": "ROME (AP) - Bernd Wiesberger moved atop the Race to Dubai rankings by winning the Italian Open on Sunday for his second Rolex Series victory of the year.\n\nWiesberger carded a bogey-free 6-under 65 at Olgiata Golf Club for a one-stroke victory over Matthew Fitzpatrick after beginning the day three strokes behind the Englishman.\n\nFitzpatrick had chances to get into a playoff but missed both an eagle putt on the 17th hole that lipped around the cup and a birdie effort on No. 18.\n\nIt was Wiesberger’s third win of the season after Denmark in May and the Scottish Open - which is also in the Rolex Series - in July. The 34-year-old Austrian also finished in a tie for second in the Irish Open.\n\n“I’ve played really well in the right events,” said Wiesberger, who finished 16 under overall. “Just really excited what’s ahead of us in the last few events.”\n\nWiesberger has 4,198 points in the Race to Dubai, ahead of Jon Ram (3,898), British Open champion Shane Lowry (3,535) and Fitzpatrick (2,865).\n\nHe joins Rahm, Alex Noren, Justin Rose and Danny Willett as multiple winners in the Rolex Series.\n\nIt was the seventh career win on the European Tour for Wiesberger, who missed the last seven months of last year with a wrist injury.\n\n“I’ve been really good putting myself in positions and staying there,” Wiesberger said after earning a winner’s check of $1.1 million. “I just really enjoy my time and being back out there, because I know how tough it was when I had to withdraw from these events last year. It’s just really full enjoyment out there when I’m in position.”\n\nWiesberger also moved to a career-high 22nd in the world golf rankings, boosting his chances of making a Ryder Cup debut next year.\n\nAmerican Kurt Kitayama finished third, four shots behind Wiesberger and one stroke ahead of Andrew Johnston, Robert MacIntyre and Matthias Schwab.\n\nFrancesco Laporta was the top Italian in a tie for seventh while Andrea Pavan tied for 10th on his home course.\n\nWith a $7 million purse, the Italian Open returned to Rome after 17 years as the local federation attempts to boost interest ahead of the 2022 Ryder Cup at the nearby Marco Simone club .\n\nTotal attendance for the four days was 29,000.\n\n“This week couldn’t have been better in terms of re-embracing Rome and preparing for 2022,” said Italian golf federation president Franco Chimenti. “We had four days of perfect sunshine - which is something we’re used to in Rome.”\n\nChimenti announced that next year’s tournament will also be played at Olgiata, before the tournament moves to Marco Simone in 2021.\n\n___\n\nMore AP golf: https://apnews.com/apf-Golf and https://twitter.com/AP_Sports\n\n___\n\nAndrew Dampf on Twitter: www.twitter.com/AndrewDampf\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Bernd Wiesberger moved atop the Race to Dubai rankings by winning the Italian Open on Sunday for his second Rolex Series victory of the year.", "authors": ["The Washington Times Http", "Andrew Dampf"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/13/italy_golf_italian_open_85568_c0-128-3072-1920_s1200x700.jpg?2791a79b282b5245e57d245c61336aa81c8132d8", "published_at": "2019-10-13"}