{"pub": "fox", "url": "https://foxbusiness.com/technology/amazon-may-seek-rematch-with-microsoft-the-pentagon", "downloaded_at": "2019-10-29 02:26:52.518040+00:00", "title": "Amazon may seek cloud rematch with Microsoft and the Pentagon", "language": "en", "text": "Heavyweight fights have a history of holding a rematch – especially when the champ is knocked out. That boxing tradition may play out in the tech sector with Amazon, Microsoft and the Pentagon.\n\nContinue Reading Below\n\nAccording to Reuters, Amazon could challenge the Pentagon’s awarding of the Joint Enterprise Defense Infrastructure (JEDI) to Microsoft next week due to public comments and alleged actions made by President Trump. Microsoft was awarded the contract in an upset last Friday, on Monday the stock soared to a new record.\n\nAccording to the military issues web site Task & Purpose, former Defense Secretary James Mattis was directed by the president to \"screw Amazon.\" Task & Purpose reported this story in \"Holding The Line: Inside Trump's Pentagon with Secretary Mattis\" a new book from Penguin Random House written by former Mattis speechwriter and communications director Guy Snodgrass.\n\nAMAZON MAY BECOME BIGGEST NATIONAL SECURITY PLAYER\n\nTask & Purpose obtained an advanced copy of the book. FOX Business has not yet seen a copy.\n\nBeyond the book, President Trump has routinely tossed barbs at Amazon and its founder Jeff Bezos who also owns The Washington Post, which has often reported unfavorable stories about the Trump Administration. Last week the Wall Street Journal reported that the White House has canceled its subscription to the Post (as well as The New York Times) and is informing other government agencies not to renew subscriptions.\n\nTrump blasted the paper for \"FAKE NEWS!\" in August.\n\nSpeaking to several legal experts, Reuters said that Amazon could pursue what amounts to an appeal on two fronts:\n\n1) Seek an immediate stay for Government Accountability Office which audits government spending and operations and reports the results to Congress.\n\n2) File a complaint with the U.S. Court of Federal Claims, which hears monetary claims against the U.S. government including contract claims and bid protests according to the court’s web site.\n\nTicker Security Last Change Change % AMZN AMAZON.COM INC. 1,777.08 +15.75 +0.89% MSFT MICROSOFT CORP. 144.19 +3.46 +2.46% ORCL ORACLE CORPORATION 54.64 +0.47 +0.87% IBM INTERNATIONAL BUSINESS MACHINES CORP. 135.97 +0.53 +0.39%\n\nAmazon Web Services has long been seen as the leader in providing cloud computing services. Given that it already provides those services for the Central Intelligence Agency, it was believed by many to be odds on favorite to win the Department of Defense contract. IBM and Oracle were also reportedly early bidders for the contract.\n\nPRESIDENT TRUMP SAYS 'RICH GUYS' ARE ‘PAYING A LOT OF RENT’ TO LAUNCH ROCKETS\n\nCloud computing is a hotly contested – and profitable – sector for tech companies. AWS reported about $9 billion in sales last quarter in last week’s earnings report. Morningstar in a research note last month that said AWS was worth $550 billion and wrote that that figure makes “AWS the fourth-most-valuable company in the world, trailing only Microsoft, Apple and Alphabet, and ahead of other tech giants like Facebook and Alibaba.”\n\nFOX Business' inquiries to Amazon were not returned at the time of publication.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE", "description": "Amazon could challenge its loss of $10 billion Pentagon cloud contract", "authors": [], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/AP19298849771206.jpg?ve=1&tl=1", "published_at": "2019-10-28"}