{"pub": "bbc", "url": "https://bbc.com/news/world-africa-49865776", "downloaded_at": "2019-09-28 21:30:34.208834+00:00", "title": "Mugabe funeral: Zimbabwe ex-president laid to rest in Kutama", "language": "en", "text": "Image copyright Reuters\n\nZimbabwe's former President Robert Mugabe has been laid to rest in the rural village where he was born, three weeks after his death at the age of 95.\n\nHe was buried in the courtyard of his home in Kutama, about 90km (55 miles) west of the capital Harare.\n\nMugabe died in a Singapore hospital on 6 September, nearly two years after a coup ended his 37 years in power.\n\nThe Mugabe family decided on a private burial in Kutama after weeks of argument with the government.\n\nMinisters had wanted the body to rest at the National Heroes Acre in Harare. A mausoleum for the former president was being constructed at the site, which is reserved for heroes of Zimbabwe's liberation struggle.\n\nBut Mugabe's family said he had wanted to be buried at his rural home, close to his late mother Bona.\n\nNo senior government officials were among the audience at a pre-burial service in Kutama on Saturday, which was attended by hundreds of mourners. A sparsely attended state funeral was held for Mugabe in Harare on 14 September.\n\nIn Kutama, Mugabe's widow Grace and his children accompanied the coffin, which was draped in the green, yellow, red and black flag of Zimbabwe.\n\nMedia playback is unsupported on your device Media caption Mugabe: From war hero to resignation\n\nMugabe, a guerrilla leader who fought against white minority rule in what was then Rhodesia, took power after independence from Britain in 1980.\n\nInitially lauded as an icon of African liberation, his rule became steadily more repressive as he clamped down on political opponents.\n\nImage copyright Reuters Image caption Grace Mugabe accompanied the coffin\n\nDisastrous economic and agricultural policies drove the once-prosperous country into the ground, and millions fled abroad.\n\nMugabe was brought down by army generals in 2017. His deputy Emmerson Mnangagwa was elected president in 2018", "description": "Zimbabwe's ex-president is laid to rest in Kutama, three weeks after his death at the age of 95.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/17445/production/_109010359_mediaitem109010358.jpg", "published_at": "2019-09-28"}