{"pub": "washingtonpost", "url": "https://washingtonpost.com/podcasts/post-reports/inside-the-republican-reckoning-over-trumps-possible-impeachment?tid=aud_hpto_postreportslnch", "downloaded_at": "2019-10-07 23:30:44.504512+00:00", "title": "Inside the Republican reckoning over Trump’s possible impeachment.", "language": "en", "text": "Phil Rucker on how the impeachment inquiry into the president is paralyzing the GOP. Anton Troianovski reports on what climate change means in Siberia. And voices from the Hong Kong protest movement.\n\nPost Reports is the daily podcast from The Washington Post. Unparalleled reporting. Expert insight. Clear analysis. Everything you’ve come to expect from the newsroom of The Post -- for your ears.\n\n‘Paralysis’ in the Republican Party in the face of impeachment inquiry\n\nA torrent of impeachment developments has triggered a reckoning in the Republican Party, paralyzing many of its officeholders as they weigh their political futures, legacies and, ultimately, their allegiance to a president who has held them captive.\n\n\n\n\n\nPresident Trump’s efforts to pressure a foreign power to target a domestic political rival have driven his party into a bunker, with lawmakers bracing for an extended battle led by a general whose orders are often confusing and contradictory.\n\n\n\n\n\n“We’re seeing varying degrees of silence,” Phil Rucker says of the response from Republican senators. “Clearly they want to stand with their president, who is the leader of their party. They also clearly have concerns about his conduct.”\n\n\n\n\n\nShould the House impeach Trump, his trial would be in the Senate, where the Republican majority would decide his fate. While GOP senators have engaged in hushed conversations about constitutional and moral considerations, according to Rucker their calculations at this point are almost entirely political.\n\n\n\n\n\nMore on this topic:\n\n\n\n\n\nSiberia’s melting permafrost\n\nIn climate change science and policymaking, a rise in temperature of two degrees Celsius is a threshold where it’s believed irreversible harm sets in. In many parts of Siberia, the temperature has already risen roughly three degrees Celsius, or 5.4 degrees Fahrenheit, since preindustrial times.\n\n\n\n\n\nThat’s triple the global average.\n\n\n\n\n\nAnton Troianovski is a reporter based in Moscow, and he traveled to northern Siberia to track the changing ecosystem.\n\n“This area has always been really one of the most difficult places in Russia,” he says of a place of unimaginable cold, remoteness and desolation. Its people had to adapt to the rise of communism, to the Gulag labor camps and the fall of the Soviet Union, “now they’re scrambling to adapt to climate change.”\n\n\n\n\n\nMore on this topic:\n\n\n\n\n\nProtests in Hong Kong continue unabated\n\nOn Friday, Hong Kong chief executive Carrie Lam announced a ban on face masks for protesters. In response, tens of thousands protested by donning Guy Fawkes masks, surgical masks, dish towels and even paper bags.\n\n\n\n\n\nProtests have been going for more than four months. They began over a bill that would allow the semiautonomous region of Hong Kong to extradite people to mainland China.\n\n\n\n\n\nBut some of the pro-democracy movement’s most prominents activists say it is about much more than the extradition bill. Kate Woodsome sat down with Joshua Wong, Nathan Law, Brian Leung and Denise Ho, who explained the protesters’ demands.\n\n\n\n\n\nMore on this topic:", "description": "Phil Rucker on how the impeachment inquiry into the president is paralyzing the GOP. Anton Troianovski reports on what climate change means in Siberia. And voices from the Hong Kong protest movement.", "authors": [], "top_image": "https://www.washingtonpost.com/pbox.php?url=https://podcast.posttv.com/podcast/20191007/t_1570476728494_name_WLISO2GBMNC2FNKHFLYFT6KKAY.jpeg&w=1484&op=resize&opt=1&filter=antialias&t=20170517", "published_at": "2019-10-07"}