{"pub": "wsj", "url": "https://marketwatch.com/story/aphria-shares-rocket-22-premarket-after-company-posts-surprise-q1-profit-2019-10-15?mod=rsswn", "downloaded_at": "2019-10-15 11:22:43.305260+00:00", "title": "Aphria shares rocket 22% premarket after company posts surprise Q1 profit", "language": "en", "text": "U.S.-listed shares of Canadian cannabis company Aphria Inc. APHA, -7.43% APHA, +0.32% rose 22% in premarket trade Tuesday, after the company posted a profit for its fiscal first quarter, and not the loss that analysts were expecting. Leamington, Ontario-based Aphria said it had net income of C$16.4 million ($12.4 million), or 7 cents a share, after net income of C$21.2 million, or 9 cents a share, in the year-earlier period. The FactSet consensus was for a loss of 2 cents a share. Revenue came to C$126.1 million, up from C$13.3 million a year ago, but below the C$131.0 million FactSet consensus. Revenue was below the C$128.6 million posted for the fourth quarter, due to a change in business strategy at CC Pharma to maximize profitability after recent changes in the German government's medical reimbursement model. The company sold more than 3,317 kg equivalents in the adult-use market and 1,354 kg equivalents in the medical cannabis market. The average retail selling price before excise tax fell to C$7.56 from C$7.66 in the prior quarter, mostly due to a higher percentage of medical cannabis sales. The company said it still expects fiscal 2020 revenue of about C$650 million to C$700 million. Shares have fallen 24% in 2019 through Monday, while the ETFMG Alternative Harvest ETF MJ, -1.29% has fallen 26% and the S&P 500 SPX, -0.14% has gained 18%.", "description": "U.S.-listed shares of Canadian cannabis company Aphria Inc. rose 22% in premarket trade Tuesday, after the company posted a profit for its fiscal first...", "authors": ["Ciara Linnane", "Corporate News Editor"], "top_image": "https://mw3.wsj.net/mw5/content/logos/mw_logo_social.png", "published_at": "2019-10-15"}