{"pub": "yahoo", "url": "https://yahoo.com/entertainment/chrisley-knows-best-stars-had-192316288.html", "downloaded_at": "2019-10-06 03:14:49.647986+00:00", "title": "'Chrisley Knows Best' Stars Had 'Lengthy Scheme' To Hide Income, Lied To The IRS Says Prosecutors", "language": "en", "text": "Details of the allegations against Todd and Julie Chrisley are being laid out by federal prosecutors and they say the reality star couple straight up lied to the IRS about their income.\n\nAccording to new legal documents, obtained by The Blast, prosecutors are arguing to not allow Todd and Julie Chrisley to move part of their case from Georgia to Tennessee.\n\nRelated:\n\n'Chrisley Knows Best' Star Todd Chrisley Gets Support From 'RHOA' Star Kandi Burruss\n\n'Chrisley Knows Best' Stars Todd and Julie Chrisley Plea For More Time To Review Evidence in Criminal Case\n\n'Chrisley Knows Best' Stars Todd and Julie Chrisley Ordered To Not Contact Alleged Victims Or Take Out Loans\n\nTodd And Julie Chrisley's Lawyers Strongly Defend Their Clients Against Fraud Charges\n\nTodd & Julie Chrisley to Be Arrested By U.S. Marshals, Warrants Issued for Reality Stars\n\nView photos\n\nIn the docs, prosecutors says the \"Chrisley defendants engaged in a lengthy scheme to shelter income, lie to the IRS, and evade payment of taxes.\"\n\nView photos\n\nAs for where the crimes were allegedly took place, they say the Chrisley's committed, \"numerous acts in the Northern District of Georgia long before they allegedly moved to Tennessee in 2016\".\n\nProsecutors allege the Chrisley's used their former accountant Peter Tarantino to help structure there \"scheme\" and he was located in Roswell, Georgia.\n\nView photos", "description": "New Details Of Scandal", "authors": ["Mike Walters"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Wm_kJHnlyGBi78XoY4q2uA--~B/aD02MTA7dz0xMDgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/theblast_73/13f8d15e655f5956f6d2aeb2f7d24516", "published_at": "2019-10-05"}