{"pub": "fox", "url": "https://foxnews.com/opinion/christen-limbaugh-bloom-could-you-answer-someones-prayer", "downloaded_at": "2019-10-27 11:53:00.859095+00:00", "title": "Christen Limbaugh Bloom: Could you be the answer to someone else's prayer?", "language": "en", "text": "I asked myself this question the other day because of a recurring theme in my Bible study on the Book of Ephesians. Having read this book many times in the past, this study has personally reinforced for me the belief of many theologians, which is that the Bible always has new lessons to teach us, no matter how many times we’ve read it.\n\nFor the first time, my eyes have been opened to the message of unity in the church woven repeatedly throughout the message of Ephesians. In fact, it’s so prevalent I’m shocked I never noticed it there before.\n\nI now realize that this theme of church unity probably never stood out to me because until very recently, I didn’t fully understand what “church unity” means at its core. I’ve heard the term “community” used countless times in church. But I’ve always associated this word with Bible studies and small groups.\n\nBut through this study, God has enlightened my perspective on how I envision unity within the church. It began when my pastor, Josh Kelsey of C3 NYC Church, preached a sermon specifically on this topic. At that time, I had already known I’d be studying the Book of Ephesians in the next month, but had no idea the book was so focused on this idea.\n\nWhen I started reading through the study, I was amazed to find so many of the themes my pastor had preached just weeks before resurfacing through an entirely different medium. I love these instances when God makes things so obvious as though He’s waving a neon sign of the message in your face.\n\nGABRIEL ETZEL: THIS IS WHY WE SHOULD PRAY FOR OUR PRESIDENT\n\nIn response I thought, “Alright God, I hear You loud and clear – unity in the church is important and something You clearly want me to understand ... but what does it actually, practically look like?”\n\nThe Apostle Paul wrote in Ephesians 4:16 that as members of the church we are called to speak in truth and to act as “supporting ligaments” who grow and build each other up through love in order to fully grow into spiritual maturity as one body under Christ.\n\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\n\nThis verse makes clear that when individuals decide to put their faith in Jesus and follow Him, they automatically become part of something bigger than themselves: the church (Christ’s body). Being a part of this body shouldn’t consist solely of membership in a physical church or small group.\n\nGod asks us to shift our perspective to seek every opportunity to help others know Him better, and to see every person as someone who He created to make the body of the church better.\n\nAs Christians, we are not only called to encourage others and build one another up, it’s actually an essential part of God’s design for the church.\n\nWe all need reassurance from fellow believers, and we each have something in ourselves – given to us by God – that others need from us. Paul warns us that if we fail to obey this command, we will never reach our full potential and neither will the church. God creates every human being for a specific purpose to contribute something unique to His body.\n\nWith this in mind, believers should all think of themselves as potential answers to the prayers and problems of others. God has given each of us special gifts that the world needs, but we have to stay connected to Him and offer ourselves to be used by Him in order for these possibilities to come to fruition.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nOpen your mind to the opportunities God is placing in your life right now to encourage the people around you and share His love.\n\n“For we are God’s handiwork, created in Christ Jesus to do good works, which God prepared in advance for us to do.” (Ephesians 2:10)\n\nCLICK HERE TO READ MORE BY CHRISTEN LIMBAUGH BLOOM", "description": "Believers should all think of themselves as potential answers to the prayers and problems of others.", "authors": ["Christen Limbaugh Bloom", "Christen Limbaugh Bloom Is The Creator Of Haplous", "A Christian Blog For Women Seeking Peace In A Stressful World. Her Writing Focuses On Practical", "Basteps", "Individuals Can Take When Pursuing A Relationship With God. Christen Is A Missouri Girl Turned Manhattanite Who Loves God", "Her Husband", "Iced Coffee Year-Round", "Connecting With Other Women. You Can Follow Christen S Blog On Instagram At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/871fa319-TitanicCross2.jpg", "published_at": "2019-10-26"}