{"pub": "yahoo", "url": "https://sg.style.yahoo.com/20-un-scary-horror-films-205723143.html", "downloaded_at": "2019-10-24 00:34:15.903688+00:00", "title": "20 Unscary Horror Movies, Starting With Jennifer Aniston’s ‘Leprechaun’ (Photos)", "language": "en", "text": "Phantoms’ (1998): Starring Ben Affleck and Rose McGowan, the 1998 film adaption of Dean Kootz’s novel recounts the tale of small-town Snowfield, Colorado plagued by a subterranean entity known only as the Ancient Enemy. The visiting Lisa Pailey (McGowan) and local law enforcement officers team up to combat the mysterious force and to revert the town back to peace and well-being. Though “Phantoms,” directed by Joe Chappelle, makes for cheap thrills with some unexpected jump scares, its convoluted storyline and shoddy special effects job warrant more laughs than screams.\n\nMirrors’ (2008) Alexandre Aja’s “Mirrors” follows former NYPD officer Ben Carson (Kiefer Sutherland) turned abandoned department store night guard as he attempts to unravel the demonic background of his new workplace and protect his loved ones. While “Mirrors” presents an eerie narrative idea, it’s been panned for tripping on itself with an over-complicated plot, botchy dialogue and unnecessarily graphic imagery — making an overall unsatisfactory spook.\n\nSecret Window’ (2004): More a psychological thriller than a horror film, David Koepp’s “Secret Window” centers around recently divorced writer Mort Rainey (Johnny Depp) and his quest to define a perfect ending for his upcoming novel. When an unknown man by the name of John Shooter (John Turturro) accuses Rainey of plagiarism, Rainey begins to recall the violent reality of his actions. “Secret Window,” more confusing than haunting, not only paints a bad picture for those suffering with mental illness, but also leaves the audience with an unmoving, unclear ending.\n\nCursed’ (2005): A film fit for Halloween,”Cursed” stars Christina Ricci and Jessie Eisenberg and hails from prolific slasher film director Wes Craven. Victims of an initially unknown infection, siblings Ellie and Jimmy Meyers figure out their werewolf abilities while sleuthing to find the epidemic’s origins.”Cursed,” bringing supernatural STDs and werewolf cat fights, does provide unintentionally funny thrills but happens to come off as a hyper-aware horror parody.\n\nHouse of Wax’ (2005): Even Paris Hilton couldn’t make “House of Wax” fabulous. In the 2005 flick, a group of college students on their way to the big game find themselves in the mercy of strangers and stranded miles away from the nearest town of Ambrose, where the main attraction is the abandoned Trudy’s House of Wax. While exploring the small town’s museum, the group discovers a disturbing truth behind the seemingly perfect wax figurines that forces them to find a way out. A lackluster and accidentally comedic remake of the 1953 original, “House of Wax” gives an okay addition to the slasher genre.\n\nUrban Legend’ (1998): Starring Jared Leto and Alicia Witt, “Urban Legend” takes an amalgamation of age old superstitions and myths and presents it in an unoriginal slasher format. Pendleton Univeristy student Natalie Simon seeks to get to the bottom of a string of urban legend-inspired murders affecting her friends and loved ones, before she becomes the killer’s next victim. Debuting nearly two years after “Scream,” “Urban Legend” fails to bring anything original or particularly scary to liven up its lifeless and cliched plot.\n\nMaximum Overdrive’ (1986): A horror film turned dark comedy starring Emilio Estevez, “Maximum Overdrive” exemplifies why Stephen King has not directed a horror movie since 1986. Taking place in a small North Carolina town, the film explores the chaos that ensues when daily household machines, from lawn-mowers to big-rig trucks, seek to exact murderous revenge on the human race. Though the juxtaposition between King’s horrific mind and his campy film direction may be the only shocking aspect to the flick, the effort one takes to enjoy “Maximum Overdrive” as a comedy rather than a horror film is well worth it in the end.\n\nLeprechaun'(1993): An evil Leprechaun, played by Warwick Davis, stops at nothing to find every last bit of his gold in “Leprechaun.” The film’s stars, including a young Jennifer Anniston, performed to the best of their abilities considering what they were given to work with – a flat plot complimented with even blander writing. Whether it’s Davis’s Leprechaun mask or the ludicrous one-liners, “Leprechaun” possesses no terrifying bone in its existence.\n\nAnaconda’ (1997): When a team of documentarians and a snake-hunter in the Amazon forest encounter a giant, man-eating snake, things get a little twisted. Featuring an all-star roster that includes Owen Wilson, Jennifer Lopez and Ice Cube, the 1997 adventure horror picture relies too heavily on its absurd low-quality CGI villain to instill a sense of fear.\n\nWolf’ (1994): What do you get when you combine a work demotion, a love triangle and werewolves? An overall spook-less experience starring Jack Nicholson and Michelle Pfieffer that takes itself too seriously to thrive as a horror film. Though “Wolf” displays impressive horror make-up, its subliminal dialogue about human nature encourages audiences to think rather than scream.\n\nThe Wolfman’ (2010): Emily Blunt, Benicio Del Toro and Anthony Hopkins star in a lousy, CGI-saturated remake of a 1941 horror classic. Following a Shakespearean actor’s somber homecoming turned gruesomely violent, “The Wolfman” allows Del Toro to deliver nuanced performances as both the monster and victim of a supernatural family curse. However, not even the actor’s skills could compensate for the shoddy CGI job.\n\nThe Wicker Man’ (2006): Policeman Edward Malus, played by Nicholas Cage, finds himself in an eerie, dystopian island when the search for his ex-fiancée’s daughter takes a wicked turn. The 2006 take on the 1973 film of the same title thrives with horror tropes like pentagrams, crows and disembodied laughs, but stumbles on itself with its utterly scattered, yet laughable ending.\n\nThe Nun’ (2018): Joining the latest flick in the “Conjuring” franchise, “American Horror Story” star Taissa Farmiga investigates a Romanian monastery gone unholy. Similar to the other films in the “Conjuring” universe, “The Nun” seems to build its slow narrative around its plethora of jump scares, bringing nothing new or unexpected to the table.\n\nTruth or Dare’ (2018): College students, played by the likes of Lucy Hale and Tyler Posey, find themselves in the hands of a blood-thirsty demon after playing a game of truth or dare in an abandoned church in Tijuana. With a mostly predictable plot line and old fear gimmicks, the truth is this Blumhouse film didn’t dare to move beyond the typical techniques of cheap horror films.\n\nParanormal Activity 2’ (2010): Simultaneously a sequel and a prequel, “Paranormal Activity 2” stars Brian Boland and Katie Featherson in yet another found footage horror movie. This time documenting a family’s efforts to keep their baby boy safe from demonic forces, the second film in the franchise fails to move beyond its predecessor’s shadow, inciting the exact same feelings of anxiety and suspense as the first.\n\nThe Human Centipede (First Sequence)’ (2009): A retired German surgeon, played by Dieter Laser, kidnaps tourists to fulfill his demented fantasy of conjoining multiple humans. The excessively grotesque picture, rife with visceral imagery of torn and ill-stitched flesh, flounders as a flick that keeps viewers up at night but succeeds at disturbing the human psyche.\n\nSlender Man’ (2018): Starring Julia Goldani Telles and Joey King, the film adaptation of the video game urban legend is the lowest reviewed film on the list. Though one can appreciate writer David Birke’s effort to place a cohesive narrative behind the 2012 computer game, the overall product features unoriginal scare tactics and a boring storytelling format despite its star power.\n\nThe Sixth Sense'(1999): Bruce Willis as child psychologist Malcom Crowe attempts to do right by his client Cole Sear, played by Haley Joel Osment, who can see the deceased walk among the living. The 1999 film offers watchers an original narrative with the signature M. Night Shyamalan twist, but brings more emotional involvement and thought than necessary for a work that serves to chill and shock.\n\nThe Happening’ (2008): Mark Wahlberg and Zooey Deschanel attempt to escape the vengeful forces of nature eradicating the human race with air-born toxins. The thriller possesses a flat and unevenly paced storyline as it also unsuccessfully, yet comedically weaponizes trees and plants in what could have been a poignant eco-thriller.\n\nThir13en Ghosts’ (2001): Following the death of his ghost hunter uncle, widower Aruther Kriticos (played by Tony Shalhoub) inherits his uncle’s estate, a large glass house also inhabited by 12 captive ghosts. Whether it’s the goofy dialogue or the silly-looking ghosts, “Thir13en Ghosts” provides a nonsensical experience that no amount of star power, smog or flashing lights can save.\n\nBook of Shadows: Blair Witch 2000: After the widespread popularity of “The Blair Witch Project” a group of graduate students, played by Jeffrey Donovan and Erica Leerhsen, visit the eerie town of Burkittsville, Maryland in the hopes of experiencing the Blair Witch for themselves. Falling in the shadows of its incomparable predecessor, “Book of Shadows” lacks originality in format and narrative but tries to compensate by predictably borrowing elements from the first in the franchise.\n\nPsycho’ (1998): Some may say that imitation is the best form of flattery, but this horror flick feels more like a low-quality copy and paste of the 1960 original. Vince Vaughn starring as Norman Bates, struggles to display the unnerving delivery former demonstrated by Anthony Perkins, further tainting the mediocre remake.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRead original story 20 Unscary Horror Movies, Starting With Jennifer Aniston’s ‘Leprechaun’ (Photos) At TheWrap", "description": "Phantoms’ (1998): Starring Ben Affleck and Rose McGowan, the 1998 film adaption of Dean Kootz’s novel recounts the tale of small-town Snowfield, Colorado plagued by a subterranean entity known only as the Ancient Enemy. The visiting Lisa Pailey (McGowan) and local law enforcement officers team up to", "authors": ["Alexandra Del Rosario"], "top_image": "https://s.yimg.com/uu/api/res/1.2/5QTeXawpxYssuwgsZH78UQ--~B/aD00MDA7dz02MTg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/thewrap.com/d0313b7d5c62dd84ebbde5fd06d50421", "published_at": "2019-10-23"}