{"pub": "thestreet", "url": "https://realmoney.thestreet.com/jim-cramer/jim-cramer-american-companies-winning-in-china-are-indispensable-15138923", "downloaded_at": "2019-10-29 02:17:14.514461+00:00", "title": "Jim Cramer: American Companies Winning in China Are Indispensable", "language": "en", "text": "Here's a wild one. We all know that are relations with China are in rapid deterioration. Why not? Our president wants it that way. I believe our understated goal is to have the Chinese make an agreement, one they can't live up to, but one that gives our companies more chances to get out of China. As China, once again, buys nothing, you suspect that President Trump will accelerate tariffs in order to look like he hasn't been had. This was the way of the Argentinian talks, it's the way of the Washington talks. The soft-liners make their gains, think Secretary Mnuchin and Chief Economic Advisory Larry Kudlow, then the Chinese disappoint and then the hardest liner, Peter Navarro, tells the president \"I told you so.\" The president actually doesn't mind the face off. It's kind of like The Apprentice, with the Mnuchin-Kudlow team going down the elevator while the Navarro team wins and all during the contest, the president can prove the intransigence of the talks, the futility of the talks, causing the ratings to surge and the votes to pile up all the while forcing the hands of the Hasbros (HAS) and the Restoration Hardwares (RH) to source away from China.\n\nBut the story's not all that negative. We are discovering that there are some real winners in China, American companies that have, somehow worked their way into the heart of Chinese commerce even as the gates to China seem to close more quickly every day.\n\nWho is winning in China, who is proving indispensable?\n\nLast night we had several companies that saw a tremendous improvement in Chinese business, a surge even, and it is worth noting how it has been done.\n\nLet's start with PayPal (PYPL) . In a tour de force quarter, CEO Dan Schulman shocked the analyst community with how he was able to conquer the world's largest and fastest growing financial market by buying 70% of GoPay which has licenses for on-line and mobile transactions and industrial e-commerce, back in September.\n\n\"So first of all, obviously, it's incredibly meaningful event to be the first non-Chinese company to obtain a payments license to process domestic online payments in China,\" he noted. \"It's a tangible example of China opening its financial market. We have been working this diligently for years. When I say diligent, I mean literally almost every single day and and have calls and have been working this. And, we worked quite closely with the PBOC, with other authorities inside of China. We worked with the administration here to enable all this to happen.\" The secrets to cracking China gleaned from the PayPal call? One, work closely with the regulators; two, invest quite heavily in compliance and risk management; three, be a strong collaborator with the financial system rather than disrupt it or go around it; four, be innovative but within the existing structure; and five, offer a differentiated value proposition to both Chinese merchants and consumers by working closely with existing Chinese financial institutions. Dan had to do it because China is the world's largest e-commerce market with 500 million online shoppers with $2 trillion of online sales, more than 50% of the global online retail market. That's a heck of a lot better than working with a declining eBay (EBAY) business.\n\nTo sum it up, you can make it but play by the rules.\n\nWe saw a similar event at Tesla (TSLA) last night where Tesla revealed that it built a new Gigafactory in China in 10 months, clearly with the support of the government. Source there, build there, hire and it can all come together.\n\nLam Research (LRCX) , the giant semiconductor equipment company, saw a nice expansion in China. As CFO Doug Bettinger said on last night's call: \"The China region quarterly performance was higher than the historical average.\" They are a must buy in China to make equipment that is used for 5G.\n\nWhat's the key here to work in this contentious environment from these examples? Simple: hire a lot of people, work with the government, play by the rules, and be indispensable when it comes to making new, proprietary technology.\n\nI wish there were more ways. I wish it was about China buying Boeing (BA) planes or soybeans. But those are working. Maybe they won't with this president. Or maybe they won't work at all.\n\n(Lam Research is a holding in Jim Cramer's Action Alerts PLUS member club. Want to be alerted before Jim Cramer buys or sells LRCX? Learn more now.)", "description": "Hire a lot of people, work with the Chinese government, and play by the rules....HAS", "authors": ["Jim Cramer", "American Companies Winning In China Are Indispensable", "Hire A Lot Of People", "Work With The Chinese Government", "Play The Rules.", "Stocks Quotes In This Article", "Bob Lang", "Gary Berman", "Doug Kass", "Bruce Kamich"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/4f4da840-ca16-11e7-89de-e5c47224d441.png", "published_at": "2019-10-24"}