{"pub": "euronews", "url": "https://euronews.com/2019/10/29/california-man-who-stole-lemur-zoo-sentenced-90-days-prison-n1073166", "downloaded_at": "2019-10-29 06:14:04.462717+00:00", "title": "California man who stole lemur from zoo sentenced to 3 months in prison", "language": "en", "text": "A Southern California man has been sentenced to 90 days for stealing North America's oldest ring-tailed lemur in captivity from a zoo.\n\nAquinas Kasbar, 19, of Newport Beach, was also ordered to pay $8,486 in restitution to the Santa Ana Zoo in Orange County for the July 27, 2018, break-in, which occurred after the zoo had closed for the night, the U.S. Attorney's Office for the Central District of California said Monday in a statement.\n\nThis undated booking photo provided by the Orange County District Attorney\\'s Office shows Aquinas Kasbar, 19, of Newport Beach, Calif. Orange County District Attorney\\'s Office via AP\n\nKasbar was accused of using bolt cutters to cut a hole in the enclosure and taking the lemur, named Isaac, who was 32 years old at the time.\n\nThe next day, the animal was left in a plastic container outside a Newport Beach hotel, with notes saying that it belongs to the zoo and to contact police, prosecutors said.\n\nThe lemur was unharmed and returned to the zoo.\n\nThe hole cut into the enclosure for lemurs and capuchin monkeys allowed several other animals to escape, but they were all recaptured, prosecutors said.\n\nKasbar pleaded guilty on July 8 to one misdemeanor count of unlawfully taking an endangered species.\n\nThis May 2019 photo provided by the Santa Ana Zoo, shows 32-year-old Isaac, the oldest captive ring-tailed lemur in North America, in Santa Ana, Calif. Aquinas Kasbar, 19, of Newport Beach, Calif., who admitted stealing a ring-tailed lemur from a Southern California zoo, was sentenced to three months in federal prison Monday, Oct. 28, 2019. Santa Ana Zoo via AP\n\nHis attorney, Brian Gurwitz, said in May that Kasbar \"quickly realized it was a bad decision, and he took steps that night to ensure that it would be returned safely to the zoo.\"\n\nHe called it \"a poor youthful decision made by a high school student.\"\n\nRing-tailed lemurs are considered endangered, in part because of the illegal pet trade, but Kasbar intended to keep the animal as a pet, prosecutors said. Isaac has since turned 33 years old, and a lemur's lifespan typically is between 20 years and 25 years, the U.S. attorney's office said.", "description": "The teen later abandoned the animal outside a hotel with a note, and prosecutors say the suspect had hoped to keep it as a pet.", "authors": [], "top_image": "https://static.euronews.com/articles/4266478/1000x563_nbc-190520-aquinas-kasbar-ac-949p_35be73680f66c5c3d82f0b3ff900fe27.jpg", "published_at": "2019-10-29"}