{"pub": "yahoo", "url": "https://news.yahoo.com/61-old-man-dies-n-210320343.html", "downloaded_at": "2019-09-04 23:48:13.836909+00:00", "published_at": "2019-09-03", "title": "61-Year-Old Man Dies in N.C. After Getting Caught in Rip Current Caused by Hurricane Dorian", "language": "en", "text": "61-Year-Old Man Dies in N.C. After Getting Caught in Rip Current Caused by Hurricane Dorian\n\nPark officials are urging the public to be very careful when swimming along the North Carolina coast after a 61-year-old man died in battered waters likely brought on by Hurricane Dorian’s approach.\n\nThe unnamed man, from Virginia, was not wearing a flotation device in the water off Cape Hatteras National Seashore near Hatteras Village, North Carolina, on Sunday when a bystander saw him “in apparent distress,” park officials said in a statement. The bystander managed to pull him to shore, where he was met by rescue personnel who performed CPR on the swimmer.\n\nThe man did not survive.\n\n“Our staff offer our deepest sympathies to his family and friends,” National Parks of Eastern North Carolina Superintendent David Hallac said in the statement. “We urge all visitors to be very careful when swimming in the Atlantic Ocean, especially with the approaching storm. Additionally we would like to thank the Hatteras Island Rescue Squad for their swift response.”\n\nHurricane Dorian moves near Florida's east coast in the Atlantic Ocean on Tuesday, Sept. 3 | AP/Shutterstock More\n\nThe man’s cause of death is unknown and the medical examiner did not immediately respond to a request for comment from PEOPLE.\n\nPark officials said that there was a high risk of rip currents for most of the beaches along Cape Hatteras National Seashore, with several rip currents spotted in the area.\n\nThe death comes as the U.S. braces for Hurricane Dorian, which is heading to the mainland as a Category 2 storm after pummeling the Bahamas as a Category 5 hurricane over the weekend.\n\nCape Hatteras National Seashore roadside sign | Jeffrey Greenberg/Universal Images Group via Getty More\n\nHurricane Dorian ravaged the Bahamas for over 36 hours after striking the region on Sunday, packing deadly floodwaters, heavy rain and fierce winds, the Washington Post reported.\n\nRELATED: Hurricane Dorian Moving ‘Dangerously Close’ to Florida After Killing 5 in the Bahamas\n\nFive people have been confirmed dead in the Bahamas, including an 8-year-old boy who likely drowned as his family fled the storm in the Abaco Islands over the weekend. The storm damaged or destroyed several homes and businesses in the Bahamas, Bahamian Prime Minister Hubert Minnis said at a recent news conference. The storm only began moving out of the Bahamas on Tuesday. By the time Dorian departs completely from the area, parts of the Bahamas will have seen more than 30 inches of rain, according to CNN.\n\nNow, North Carolina, South Carolina, Florida, Georgia and Virginia have all declared states of emergency as Hurricane Dorian threatens several coasts.", "description": "Man, 61, Dies in Rough N.C. Surf Caused by Hurricane Dorian", "authors": ["Char Adams"], "top_image": "https://s.yimg.com/uu/api/res/1.2/1KrEvDsg.Nrz8.vHFhzeOA--~B/aD02MTY7dz0xMDAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/people_218/bd2edc32e5a726cc8ce942039a48f075"}