{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/12/mystics-kristi-toliver-being-injured-first-time-means-learning-let-go", "downloaded_at": "2019-09-13 00:57:28.274648+00:00", "published_at": "2019-09-12", "title": "For Mystics’ Kristi Toliver, being injured for the first time means learning to let go", "language": "en", "text": "But in the past five weeks, Toliver has been forced to confront what she is hard-wired against.\n\nThe last game she played was against Indiana on Aug. 8, when an on-court collision left her with a deep bone bruise and a strain on the outside of the medial collateral ligament in her right knee. Since then, Washington has gone 10-1 despite being extremely thin at the guard position and has locked up the top seed in the WNBA playoffs, which will begin for the Mystics on Tuesday with Game 1 of a best-of-five semifinal series against an opponent determined by Sunday’s second-round, single-elimination matchups.\n\nAD\n\nAD\n\nToliver has been rehabbing in hopes of returning for the playoffs at some point, though she doesn’t know exactly when.\n\n“My Game 1 is whenever my Game 1 is,” Toliver said Thursday in her first appearance in front of reporters since her injury. Thursday was her fifth day back on court but her first practice with the team in more than a month. The Mystics scrimmaged against their male practice squad; Toliver saw 20 minutes of half-court action and five minutes of full-court action.\n\nToliver said she hopes to contribute significantly in the postseason and that the only hurdle left is being able to practice five-on-five without too much pain afterward.\n\nAD\n\n“Now the biggest issue is getting used to her brace and getting her cardio, her wind back a little bit,” Washington Coach-General Manager Mike Thibault said. “It’s a balance between that and soreness, too.”\n\nAD\n\nDelle Donne and Thibault take stock as honors start to roll in\n\nFor Toliver, the journey back to the court has involved much more than keeping her upper body in shape and adjusting to her custom-made knee brace. Athletes who routinely deal with injury are accustomed to the particular physical grind of rehab, not to mention the mental toil — the lonely days when the rest of the team is on the road and you spend long, sedentary evenings trying to stave off boredom and anxiety about whether you will be the same player when you get back.\n\nIt was all new for Toliver, who remains the Mystics’ third-leading scorer (13 points per game) even though she has played just 23 games. The last time she missed a game was seven years ago, when she attended her grandmother’s funeral. At 32, she’s the rare player who has never had a serious injury. She even tried to practice as normal the day after her injury until Elena Delle Donne, who had her own knee bone bruise a year ago, noticed her limping.\n\nAD\n\n“Only she could convince me to go to the training room and actually see what was up,” Toliver said.\n\nAD\n\nShe was reluctant to give in and sit out, then she was reluctant to accept how long her process of recovery would be — Delle Donne has said complications relating to her bone bruise lingered because she continued to play through the injury — so Toliver turned to books on meditation to help her stay in the moment and not get ahead of herself.\n\n“When you meditate, you’re trying to be where you are. Then, of course, you’re going to get distracted, but can you bring yourself back? That’s like my practice,” Toliver said. “When I’m sitting around and I’m thinking like: ‘God, what am I going to be like when I get back out there? Am I going to be able to defend? Am I going to be able to push the tempo? Shoot, pass, whatever?’ You have to bring it back. Because you don’t have control over that right now, all you can do is focus on getting better and doing your best in that process.”\n\nAD\n\nToliver spent every day at the Mystics’ practice facility, watching practice and doing rehab around two-hour stints in a hyperbaric chamber, where she caught up on movies she never had time for before — “The Big Lebowski,” “Goodfellas” and “Harlem Nights” among them.\n\nAD\n\nShe stayed engaged by activating the part of her brain that she uses during the offseason as an assistant coach with the Wizards. She watched every game she missed twice — first as a cheerleader, sitting on the bench wearing her brace and a suit, then as if she were a scout for the opposing team, texting her teammates and coaches her observations.\n\n“I’m texting her during halftime at games when we’re on the road. She’s talking to me before games here, during games here, after games here. She’s been really huge not only for this team but personally for me, too,” starting guard Natasha Cloud said.\n\nAD\n\nIn her absence, Toliver said she has seen the team’s defense improve and players such as Cloud, Ariel Atkins and Aerial Powers grow up, which she thinks only will help the Mystics during the playoffs.\n\nAD\n\nRegardless of when she returns to the court, Toliver now knows she can make an impact elsewhere.\n\n“I learned that I am able to surrender to a crappy circumstance and accept things as they are and find a way to contribute even when I can’t actively be on the floor,” Toliver said. “For me, it’s always like, I want to make my teammates better — I was always out there. That’s how I made them better, through my play. I had to find other ways. That’s the first time I ever experienced that, and I’m more valuable than just being, you know, Kristi Toliver, point guard on the floor.”\n\nRead more:\n\nWNBA playoffs: Schedule, favorites and how to watch\n\n‘Insane numbers’: NBA stars welcome Elena Delle Donne to the 50-40-90 club\n\nSally Jenkins: I don’t know what Antonio Brown did, but he’s already damned by misogynist language\n\nAD", "description": "The guard and veteran leader is hopeful to return from a knee injury for the playoffs, which start for the Mystics on Tuesday, but said she has learned to “accept things as they are.\"", "authors": ["Ava Wallace", "Reporter Covering Local Colleges"], "top_image": "https://www.washingtonpost.com/resizer/Sywy12nUPjsI8g6lJ54oQTJQAOQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/AWI6CZUFD4I6THLT4K5GXPY3TM.jpg"}