{"pub": "investing.com", "url": "https://investing.com/news/stock-market-news/japan-stocks-higher-at-close-of-trade-nikkei-225-up-025-2000054", "downloaded_at": "2019-10-21 08:56:53.439383+00:00", "title": "Japan stocks higher at close of trade; Nikkei 225 up 0.25%", "language": "en", "text": "© Reuters. Japan stocks higher at close of trade; Nikkei 225 up 0.25%\n\nInvesting.com – Japan stocks were higher after the close on Monday, as gains in the , and sectors led shares higher.\n\nAt the close in Tokyo, the gained 0.25% to hit a new 6-months high.\n\nThe best performers of the session on the were Daiwa House Industry Co., Ltd. (T: ), which rose 2.48% or 89.0 points to trade at 3676.0 at the close. Meanwhile, Daiwa Securities Group Inc. (T: ) added 2.46% or 11.9 points to end at 495.3 and Kobe Steel, Ltd. (T: ) was up 2.32% or 13.0 points to 574.0 in late trade.\n\nThe worst performers of the session were Taiyo Yuden Co., Ltd. (T: ), which fell 2.71% or 80.0 points to trade at 2868.0 at the close. Daiichi Sankyo Co., Ltd. (T: ) declined 2.67% or 182.0 points to end at 6632.0 and Tokai Carbon Co., Ltd. (T: ) was down 2.36% or 27.0 points to 1118.0.\n\nRising stocks outnumbered declining ones on the Tokyo Stock Exchange by 2357 to 1140 and 250 ended unchanged.\n\nShares in Daiwa House Industry Co., Ltd. (T: ) rose to 52-week highs; rising 2.48% or 89.0 to 3676.0.\n\nThe , which measures the implied volatility of Nikkei 225 options, was unchanged 0.00% to 15.63.\n\nCrude oil for December delivery was up 0.20% or 0.11 to $53.98 a barrel. Elsewhere in commodities trading, Brent oil for delivery in December fell 0.02% or 0.01 to hit $59.41 a barrel, while the December Gold Futures contract fell 0.02% or 0.25 to trade at $1493.85 a troy ounce.\n\nUSD/JPY was up 0.12% to 108.55, while EUR/JPY rose 0.21% to 121.11.\n\nThe US Dollar Index Futures was up 0.07% at 97.072.", "description": "Japan stocks higher at close of trade; Nikkei 225 up 0.25%", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEA670B3_L.jpg", "published_at": "2019-10-21"}