{"pub": "reuters", "url": "https://in.reuters.com/article/uk-spain-politics-catalonia-leader/jailed-catalan-separatist-leader-says-new-referendum-inevitable-idINKBN1WU0FT", "downloaded_at": "2019-10-15 11:23:51.533873+00:00", "title": "Jailed Catalan separatist leader says new referendum inevitable", "language": "en", "text": "BARCELONA (Reuters) - The jailing of Catalan separatists for their role in a failed secession bid will only galvanise the region’s independence movement and another referendum is inevitable, the leader hit by the heaviest jail sentence told Reuters.\n\nJailed Catalan politician Oriol Junqueras attends the first session of parliament following a general election in Madrid, Spain, May 21, 2019. REUTERS/Sergio Perez/Pool/Files\n\nFormer regional government deputy leader Oriol Junqueras and eight others were convicted of sedition on Monday by the Supreme Court and sentenced to terms ranging from 9-13 years.\n\nThe ruling triggered protests across the wealthy northeastern region whose independence drive plunged Spain into full-blown political crisis in October 2017, when the leaders organised a referendum that courts had ruled illegal and made a short-lived declaration of independence.\n\n“This sentence will not weaken the independence movement, quite the contrary,” Junqueras told Reuters in his first interview after the sentence. “We’re not going to stop thinking what we think, ideals can’t be derailed by (jail) sentences.”\n\nAll the defendants were acquitted of the gravest charge, rebellion, but the length of the prison terms - which Junqueras said they planned to appeal in a European court - prompted anger in Catalonia.\n\nOn Monday, demonstrators blocked roads and regional railways there and thousands descended on Barcelona’s international airport, where some clashed with police.\n\nThose behind the airport protest, the Tsunami Democratic group, called for protesters to keep returning to the street. A spokesman for the airport said it had cancelled 110 flights on Monday and a further 45 on Tuesday.\n\n“Never, never, never have separatists acted violently, never,” added Junqueras, in emailed answers to questions passed on to Reuters by his staff late on Monday.\n\n“What I’m sure of is that this conflict is to be resolved via ballot boxes ... we are convinced that sooner or later a referendum is inevitable because otherwise, how can we give a voice to the citizens?”.\n\nCatalan regional leader Quim Torra said on Tuesday his government would continue to defend the right to self determination, and that another referendum was “(the) most positive solution for trying to solve this.”\n\nTwo years after the debacle of the first plebiscite, Catalonia’s independence drive still dominates much of Spain’s fractured political debate.\n\nThe country’s main national parties are divided on whether to grant the region additional autonomy on top of the administrative and budgetary controls it already holds - but all except the far-left Podemos oppose holding a referendum on independence.\n\nBesides, sharp divisions within Catalonia itself over the issue of independence have contributed to taking the steam out of the independence movement in recent months, with protests drawing smaller crowds.\n\nAsked what message he had for the independence movement after the sentencing, Junqueras said: “That prison and exile have made us stronger and makes us ever more convinced, if that is possible, in our profoundly democratic beliefs.”\n\nHe and the others planned to appeal the sentences at the European Court of Human Rights in Strasbourg, he said.", "description": "The jailing of Catalan separatists for their role in a failed secession bid will only galvanise the region's independence movement and another referendum is inevitable, the leader hit by the heaviest jail sentence told Reuters.", "authors": ["Joan Faus", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191015&t=2&i=1440984101&w=1200&r=LYNXMPEF9E07E", "published_at": "2019-10-15"}