{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Wellness/doctor-weighs-eating-book-introduces-pegan-diet/story?id=66457764", "downloaded_at": "2019-10-23 15:03:44.224056+00:00", "title": "Doctor weighs in on what you should be really eating in a new book and introduces new 'pegan' diet", "language": "en", "text": "Many families struggle figuring out what to make for dinner even when they have a fridge stocked with food that they can easily make into a meal.\n\nBut one doctor is helping others tackling the question in a new book that introduces the \"pegan\" diet.\n\n\"One out of every two Americans -- actually it’s 60% now -- are sick,\" Dr. Mark Hyman told \"Good Morning America.\" \"Seventy-five percent of us are overweight. And it’s the food we’re eating.\"\n\nCourtesy Nicole Franzen\n\nHyman, the author of \"Food: What the Heck Should I Cook?\" coined the term \"pegan\" after realizing that there were certain principles from vegan and a paleo diets that are beneficial for people as well as the planet.\n\n\"It’s universal principles for how to eat well if you’re a human being,\" Hyman told \"GMA.\" \"It includes all the food categories that people eat, but in each category it tells you which are the foods you should choose in that category.\"\n\nThe secret to the pegan diet is non-starchy veggies, like broccoli, asparagus and greens.\n\n\"Vegetables have very few calories, but lots of nutrients. So they’re high in fiber,\" he said.\n\nHyman recommends that 75% of your plate should be filled with non-starchy vegetables, followed by healthy fats like avocados and nuts; high-quality protein, such as pasture-raised chicken and grass-fed meat; and starchy vegetables like potatoes and winter squash.\n\nHe said, \"It’s also important to understand that the quality of the food you eat matters most. And that’s really what pegan is about. It’s about the quality of the food.\"\n\nIn his new book, The New York Times bestselling author features more than 100 recipes to promote weight loss and lifelong health. He hopes to inspire others to eat food that they love and food that’s nourishing, healing and good for the planet.\n\nHere are some of the recipes from his new book:\n\nSuperfood smoothie bowl\n\nSmoothies aren’t just for drinking. This smoothie bowl lets you enjoy a thicker consistency with an ever-so-satisfying crunch on top. The MCT oil provides energy-boosting fats while the fresh ginger fights dangerous inflammation. Blueberries and spinach are two of my favorite brain-boosting foods, thanks to their respective amounts of anthocyanins and vitamin K -- together, they elevate this smoothie bowl to another level.\n\nCourtesy Nicole Franzen\n\nServes: 1\n\nPrep Time: 5 minutes\n\nCook Time: 8 minutes\n\n\n\nIngredients:\n\n\n\nSpiced Walnuts\n\n¼ cup raw walnuts, chopped and toasted\n\n¼ teaspoon ground cinnamon\n\nPinch of sea salt\n\n\n\nSmoothie Base\n\n1 cup loosely packed baby spinach\n\n½ cup frozen blueberries\n\n¼ cup frozen cauliflower\n\n½ cup filtered water\n\n1 tablespoon MCT oil\n\n1 tablespoon almond butter\n\n1 teaspoon lemon juice\n\n1 teaspoon vanilla extract\n\n1 teaspoon spirulina powder, plus more for garnish\n\n1 teaspoon micro-grated peeled fresh ginger\n\n¼ teaspoon ground cinnamon\n\n\n\nToppings\n\n¼ cup fresh blueberries\n\n¼ cup chopped fresh strawberries\n\n2 teaspoons pomegranate seeds\n\n1 ½ teaspoons cacao nibs\n\n1 teaspoon hemp seeds\n\n\n\nInstructions:\n\n\n\n1. For the walnuts: Preheat the oven to 350°F. Place the walnuts on a baking sheet and toast for 8 minutes, until fragrant. In a small bowl, combine the walnuts with the cinnamon and salt. Toss to coat, then set aside to cool.\n\n\n\n2. For the smoothie base: Combine all the ingredients in a high-speed blender and puree until smooth.\n\n\n\n3. For the toppings: Pour the smoothie into a bowl and garnish with the spiced walnuts, blueberries, strawberries, pomegranate seeds, cacao nibs, and hemp seeds. Sprinkle a dusting of spirulina on top and enjoy.\n\n\n\nUltra-creamy cashew-butter coffee\n\nCashew butter is rich in minerals and heart-healthy monounsaturated fats. These fats, in combination with the medium-chain triglycerides found in coconut milk, give this drink an ultra-creamy texture and help to balance the effects of caffeine, keeping you focused and alert all morning long.\n\nCourtesy Nicole Franzen\n\nServes: 1\n\nPrep Time: 5 minutes\n\n\n\nIngredients:\n\n1 cup coffee (regular or decaf) 2 tablespoons cashew butter\n\n1 tablespoon full-fat unsweetened coconut milk\n\n2 teaspoons hazelnut extract (optional)\n\nPinch of sea salt\n\nPinch of raw cacao powder\n\n\n\nInstructions:\n\n\n\n1. Combine the coffee, cashew butter, coconut milk, hazelnut extract (if using), and salt in a blender and blend until smooth. Pour into a mug and garnish with a sprinkle of cacao powder. Can be enjoyed warm or over ice.\n\n\n\nTahini rainbow cabbage salad\n\nPurple cabbage has a crunch and a natural sweetness. Its beautiful color is a sign of powerful antioxidants called anthocyanins, which are especially beneficial for the cardiovascular and neurological systems. A variety of colorful vegetables, a creamy tahini dressing and hard-boiled eggs create a salad that is a complete meal, and sure to leave you feeling satisfied.\n\nServes: 4\n\nPrep Time: 20 minutes\n\nCook Time: 15 minutes\n\n\n\nEggs\n\n8 large pasture-raised eggs\n\n1 tablespoon extra virgin olive oil\n\n½ teaspoon sea salt\n\n¼ teaspoon freshly ground black pepper\n\n\n\nTahini Dressing\n\n¼ cup tahini\n\n3 tablespoons extra virgin olive oil\n\n2 tablespoons filtered water\n\n1 tablespoon plus 1 teaspoon lemon juice\n\n1 tablespoon plus 1 teaspoon gluten-free tamari or coconut aminos\n\n2 teaspoons pressed garlic\n\n¼ teaspoon freshly ground black pepper\n\n\n\nSalad\n\n2 cups shredded purple cabbage\n\n3 cups finely chopped spinach\n\n1 cup finely diced red bell pepper\n\n1 cup grated carrots\n\n¼ cup plus 2 tablespoons finely chopped fresh cilantro\n\n1 avocado, pitted, peeled, and chopped\n\n¾ cup crumbled goat feta cheese\n\n\n\nInstructions:\n\n\n\n1. For the eggs: Prepare a medium bowl of ice water. Bring a medium pot of water to a boil over high heat. Gently add the eggs and boil for 13 minutes. Immediately plunge the eggs into the ice bath and let sit for 5 minutes. Gently tap the eggs on the counter to crack, then peel each and cut in half. In a bowl, gently mix the egg halves with the olive oil, salt, and pepper.\n\n\n\n2. For the dressing: Combine all the ingredients in a jar and mix until fully blended.\n\n\n\n3. To assemble the salad: Combine the cabbage, spinach, bell pepper, carrots, and cilantro in a large salad bowl and toss to combine. Just before serving, add the dressing and massage the salad until well combined. Add the eggs, avocado, and feta, gently turning the mixture once to lightly coat with dressing.\n\n\n\nAvocado mayo\n\nMayonnaise can be a healthy, go-to condiment -- but only if it contains the right kind of oil. Most store-bought varieties include canola oil or other inflammatory fats, but not this version. My homemade mayo uses avocado oil, which provides oleic acid that supports heart health and lutein, an antioxidant that benefits eyesight. Keep a jar on hand so you can easily add a dollop of tangy flavor to your favorite dishes.\n\nCourtesy Nicole Franzen\n\nMakes: 1 ½ cups\n\nPrep Time: 10 minutes\n\n\n\nIngredients:\n\n2 large pasture-raised egg yolks\n\n1 tablespoon lemon juice\n\n2 teaspoons brown mustard\n\n1 teaspoon sea salt\n\n1 ½ cups avocado oil\n\n\n\nInstructions:\n\n\n\n1. Place the egg yolks, lemon juice, mustard, and salt in a food processor and blend well.\n\n\n\n2. While the machine is running, add the avocado oil very slowly, a few drops at a time. Once the mixture starts to thicken, add the remaining oil in a very slow, thin stream until fully incorporated.\n\n\n\n3. Store the mayo in an airtight container in the refrigerator and consume within 1 week.\n\n\n\nToasted sage butternut pizza\n\nCauliflower makes the perfect crust for these delicious pizzas. Topped with a creamy butternut squash sauce, toasted sage and gooey goat cheese, this is sure to become a new household favorite. It’s a much healthier alternative to regular pizza -- made out of white flour and dairy -- since it contains a variety of vitamins and minerals and has a lower-glycemic index.\n\nCourtesy Nicole Franzen\n\nServes: 4 to 6\n\nPrep Time: 20 minutes\n\nCook Time: 45 minutes\n\n\n\nIngredients:\n\n\n\nButternut Squash Purée\n\n1 small butternut squash (about 1 pound)\n\n2 tablespoons avocado oil\n\n2 tablespoons ghee or coconut oil\n\n3 shallots, chopped\n\n¼ cup chicken broth or filtered water\n\n¼ cup canned coconut cream (unshaken so cream and water are separated)\n\n2 cloves garlic, sliced\n\n\n\nCauliflower Crust\n\n1 medium cauliflower\n\n3 large pasture-raised eggs\n\n1 tablespoon Dijon mustard\n\n1 teaspoon dried oregano\n\n2 teaspoons sea salt\n\n1 ½ teaspoons freshly ground black pepper\n\n2⁄3 cup almond flour (or 1 cup chickpea flour)\n\n\n\nToppings\n\n2 tablespoons avocado oil\n\n36 small to medium fresh sage leaves\n\n½ cup grated hard sheep or goat cheese\n\n¼ cup pepitas\n\n1 tablespoon plus 1 teaspoon raw honey (optional)\n\nPinch of Maldon salt or other flaked salt (optional)\n\n\n\nInstructions:\n\n\n\n1. To roast the squash for the puree: Preheat the oven to 425°F using a convection setting if possible. Line two baking sheets with parchment paper. Remove the skin from the squash and chop into small cubes. In a baking dish, toss the squash with the avocado oil; roast for 25 minutes or until browned. Keep the oven on.\n\n\n\n2. Meanwhile, for the crust: To rice the cauliflower, remove the outer green leaves and most of the stem. Chop the remaining cauliflower into medium chunks and pulse in a food processor until it resembles a fine grain. Alternatively, you can grate the cauliflower on a box grater.\n\n\n\n3. Whisk the eggs in a small bowl. Add the cauliflower, mustard, oregano, 1 teaspoon of the salt, and ½ teaspoon of the pepper and mix well. Add the almond flour and mix again. Divide the cauliflower mixture among the two baking sheets, forming 2 oval crusts with hands, ⅛- to ¼-inch thick. Bake the cauliflower crusts for 7 minutes. Remove from the oven, flip the crusts, and rotate the baking sheets between the top and bottom oven racks. Bake for another 8 minutes, until golden, then remove from the oven but keep the oven on.\n\n\n\n4. To finish the squash puree: Heat the ghee in a medium pan until shimmering. Add the shallots and saute 5 minutes. Add the roasted squash, broth, coconut cream, and garlic. Cook for 2 minutes, until hot.\n\n\n\n5. Let cool, then puree in a high-speed blender.\n\n\n\n6. For the sage topping: Heat the avocado oil in a small pan. Add the sage leaves and cook for 45 seconds, until aromatic and slightly crisp. Remove from the heat.\n\n\n\n7. To top the pizzas: Top both crusts with the squash puree, then add the sage leaves, cheese, and pepitas. Bake for 5 minutes, until the cheese is melted. Top the pizzas with the honey and Maldon salt, if desired, and serve.\n\n\n\n\"Food: What the Heck Should I Cook?\" is available now.", "description": "Doctor Mark Hyman talks about food that people should be eating in a new book and introduces", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/hyman-cookbook-ht-aa-191022_hpMain_16x9_992.jpg", "published_at": "2019-10-23"}