{"pub": "yahoo", "url": "https://news.yahoo.com/migrants-wanting-request-asylum-camp-144743736.html", "downloaded_at": "2019-10-12 09:46:35.408009+00:00", "title": "US-Mexico border bridge reopens after migrant campout", "language": "en", "text": "Migrant women sleep after camping out on the Gateway International Bridge that connects downtown Matamoros, Mexico with Brownsville, Thursday, Oct. 10, 2019. Migrants wanting to request asylum camped out on the international bridge leading from Mexico into Brownsville, Texas, causing a closure of the span. (AP Photo/Fernando Llano)\n\nMATAMOROS, Mexico (AP) — Migrants wanting to request asylum camped out on a U.S.-Mexico border bridge Thursday, leading to a half-day closure of a span linking the Mexican city of Matamoros to Brownsville, Texas.\n\nHundreds of migrants from Central America and elsewhere stretched out on the bridge before dawn, with some lying on mats or their coats. The crowd included children and babies.\n\nU.S. Customs and Border Protection said in a statement that traffic on the Gateway International Bridge \"was temporarily halted at about 1:30 a.m. after a group of 250-300 migrants without entry documents\" gathered at the bridge's midpoint.\n\nThe blockage also caused long lines to form at the other international crossings leading out of Matamoros.\n\nBut in the late afternoon, after a 13-hour shutdown, the migrants left and U.S. authorities reopened the crossing, which handles about 80% of the Brownsville-Matamoros pedestrian traffic.\n\nErnesto Banegas, 51, a construction worker from Honduras, said migrants moved to the bridge after rumors spread that they might be allowed to enter the United States.\n\nThe migrants said they were tired of waiting to make their initial claims for asylum at the U.S. border crossing.\n\n\"We do not want to block traffic. We just want someone to talk to us, and this was the only way to do it,\" said Banegas, who fled his country after his 5-year-old son was kidnapped.\n\nCarla Moradel, 21, who was sent back to Mexico after crossing into the U.S., said she has been waiting for two months and just wanted officials to say \"yes or no.\"\n\n\"If they had clearly told me, 'No,' I would have gone back to Honduras, but I think there is still a chance,\" said Moradel, who also left Honduras with her 5-year-old son because she couldn't find work.\n\nUnder a policy known as metering, U.S. officials at many border bridges accept only a few asylum-seekers a day. The Associated Press found about 19,000 names on waiting lists in four border cities visited in late July.\n\nFrustration with U.S. policies aimed at limiting asylum requests has sparked mass attempts to cross border entries before. But Thursday's camp-out on the Mexican side of the Matamoros bridge appeared to be more of a protest than an attempt to cross.\n\nIn the afternoon, Matamoros Mayor Mario Alberto López walked onto the bridge to talk to the migrants and try to convince them to reopen the span.\n\nMigrants told the mayor they were living in dirty conditions in Matamoros with little shelter or access to toilets, and he promised to send cleaning crews and set up washing facilities.\n\nSeguismundo Doguín, National Immigration Institute delegate in Tamaulipas, said the protesters' demands were heard and relayed to U.S. officials, and that the migrants at the bridge were offered to be taken in at a shelter to await their court dates in better conditions.\n\nThe migrants cleared the roadbed of the bridge and remained blocking the sidewalk portion.\n\nBut López and others pointed out that the blockade had caused inconveniences for Matamoros residents who need to cross for work, shopping or other reasons.\n\nLiliana Ramírez, 35, who sells flavored shaved ice to crossing pedestrians, said it was a lost day with zero sales.\n\nSuch protests \"harm everyone,\" Ramírez said. \"Also (the migrants) — things are going to be made more difficult for them.\"\n\nShe also complained about trash left at the camp.\n\nOrlando Valerio, a 53-year-old Nicaraguan migrant, said he missed his asylum hearing appointment because of the protest.\n\n\"I understand them, I am one of them,\" Valerio said. \"But they can't block things this way.\"\n\nThe CBP statement said migrants who had been returned to Mexico to wait for hearings on their asylum cases (a policy known as MPP, or Migrant Protection Protocol), but who could not cross due to the closure would be given new dates.\n\nSome locals were sympathetic to the migrants.\n\nFrancisco Tovar, who plays piano at a bar near the border, said people could have crossed elsewhere.\n\n\"These are political questions, and the United States and Mexico have to do something,\" he said.\n\nMoments after traffic resumed Thursday, U.S. agents staged one of their regular anti-riot exercises. Smoke canisters were fired and the crossing was closed again, though this time for just a couple of minutes.\n\n___\n\nAssociated Press writer Alfredo Peña in Ciudad Victoria, Mexico, contributed to this report.", "description": "Migrants wanting to request asylum camped out on a U.S.-Mexico border bridge Thursday, leading to a half-day closure of a span linking the Mexican city of Matamoros to Brownsville, Texas.  Hundreds of migrants from Central America and elsewhere stretched out on the bridge before dawn, with some lying", "authors": ["Maria Verza"], "top_image": "https://s.yimg.com/uu/api/res/1.2/BjVrPJwC42jHdD59cSkL.Q--~B/aD0zNTY4O3c9NTA5MTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/15653ab5f7ca1679647f271160e4d53c", "published_at": "2019-10-10"}