{"pub": "usatoday", "url": "https://usatoday.com/story/life/parenting/2019/10/03/in-vitro-fertilization-twin-births-dropping-us-cdc/3852018002", "downloaded_at": "2019-10-05 14:09:42.707643+00:00", "title": "Twin births are dropping in the US. Health officials say that's a good thing.", "language": "en", "text": "CLOSE Seven babies were born just months apart from each other at a fire department in Salisbury, North Carolina. USA TODAY\n\nNEW YORK – Fewer U.S. families are seeing double, according to a government report that finds a drop in new twins.\n\nTwin births steadily increased for more than three decades, driven largely by older white moms undergoing fertility treatments.\n\nBut the rate of twin births apparently peaked in 2014 and has fallen 4% since. Last year, the rate hit its lowest point in a decade, the Centers for Disease Control and Prevention reported Thursday.\n\nThe drop is modest, but health officials say it is good news. Pregnancy with more than one raises the risks of complications and death for both the mother and her fetuses. Complications include premature birth and a low birth weight.\n\n“In the media, there are often stories about very cute twins and talking about how great to have two babies at the same time,” said the CDC’s Dr. Dmitry Kissin. But “these stories don’t focus on the risk.”\n\nTwinning: Eminem's daughter Hailie Jade looks just like him in new photo\n\n'It definitely gets harder': Jennifer Garner laments not being able to pick out her kids' Halloween costumes anymore\n\nLast year, about 124,000 babies were twins – about 1 of every 31 births, the same as a decade earlier. The rate peaked at 1 in 29 in 2014.\n\nThe CDC did not release figures on triplets or other multiple births, but said data suggests it’s trending the same way.\n\nWhy the decline? Experts can’t say for sure. But Joyce Martin, the report’s lead author, noted the decrease occurred only in white women and in women 30 or older. Those women are the biggest customers of expensive in vitro fertilization treatments, which are involved in roughly 15% of multiple births. And there’s been a shift in how that technique is done.\n\nIn this Aug. 14, 2013 file photo, an in vitro fertilization embryologist works on a petri dish at a fertility clinic in London. In vitro fertilization involves surgically removing eggs from a woman’s ovaries, combining them with sperm in a laboratory, and transferring the days-old embryo to the woman’s uterus. (Photo: Sang Tan, AP)\n\nIn vitro fertilization involves surgically removing eggs from a woman’s ovaries, combining them with sperm in the laboratory, and transferring the days-old embryo to the woman’s uterus. More than a decade ago, it was standard to implant two or more embryos to improve the chances of success. But that also greatly increased the odds of more than one baby.\n\nParenting: Spanking children may soon be illegal in Scotland, considered a form of assault\n\nSince then, there have been advances in growing embryos longer in the lab and testing them for genetic problems. That’s allowed doctors to select the best single embryo to use, said Dr. Aaron Styer, an infertility treatment specialist in Chestnut Hill, Massachusetts.\n\nThe success rate for one embryo rose from about 20% in the 1980s to around 50% today, he said. Meanwhile, insurers and medical organizations increasingly have been pushing doctors to transfer single embryos more often.\n\nPatients have bought into it. They understand that’s the ideal pregnancy, Styer said.\n\nToday, about two-thirds of IVF procedures use one embryo, according to the CDC’s Kissin.\n\nRead or Share this story: https://www.usatoday.com/story/life/parenting/2019/10/03/in-vitro-fertilization-twin-births-dropping-us-cdc/3852018002/", "description": "Fewer U.S. families are seeing double. The rate of twin births peaked in 2014 and has fallen 4% since, the CDC says.", "authors": ["Mike Stobbe", "Associated Press", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/03/USAT/32f1733d-3274-46fb-898b-438d73445f11-AP_Fewer_Twiins.JPG?crop=4901,2757,x0,y249&width=3200&height=1680&fit=bounds", "published_at": "2019-10-03"}