{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-eu-sterling/brexit-stumble-slightly-dents-pounds-euphoria-as-trading-resumes-idUKKBN1WZ0HX", "downloaded_at": "2019-10-20 23:22:27.780306+00:00", "title": "Brexit stumble slightly dents pound's euphoria as trading resumes", "language": "en", "text": "LONDON (Reuters) - Sterling slipped half a percent as world currency markets opened for the first time since the UK parliament delayed a crucial vote on a Brexit withdrawal agreement.\n\nFILE PHOTO: British sterling banknotes stacked in piles at the Money Service Austria company's headquarters in Vienna, Austria, November 16, 2017. REUTERS/Leonhard Foeger/File Photo\n\nAs trading opened in Wellington, New Zealand, the pound GBP-D4 slipped 0.6% to $1.2929, but the bulk of its recent rally held amid confidence that a disorderly exit from the European Union would still be avoided.\n\nThe British currency closed on Friday just below the $1.30 mark, right at the peak of a 6.5% surge it has enjoyed since British Prime Minister Boris Johnson first made a breakthrough on striking an EU divorce deal on Oct. 10.\n\nThe pound strengthened as Johnson agreed a revised deal at an EU summit on Thursday, but on Saturday parliament frustrated his plan by withholding its approval vote until formal ratification legislation is passed.\n\nWhile the British government still insists the country will leave the bloc come Oct. 31, the consensus view is that a no-deal Brexit by default will be avoided.\n\nAgainst the euro, the pound slipped 0.2% to 86.3 pence EURGBP=D3, off the five-month highs touched last week.\n\nGraphic: Sterling falls (here)\n\nCommenting on the pound’s slight retreat as Asian markets opened, BNP Paribas strategist Parisha Saimbi said the move roughly fell in line with expectations.\n\n“We were expecting that there would be some initial disappointment on the markets (...) but ultimately, we do expect markets to find some support, as the risks for the end outcome are still tilted to the upside”, she said.\n\nStill, the bank’s chief UK economist, Paul Hollingsworth, warned of a possible “turbulent week ahead” as Boris Johnson tries to push his deal through parliament.\n\nWhile many outcomes of the parliamentary battle to come - such as amendments calling for a second referendum or the UK staying in the EU customs union - could frustrate Johnson politically, they would also likely prevent a no-deal Brexit and therefore be seen favourably for the pound, he argued.\n\nGoldman Sachs (GS.N) on Sunday cut the probability it assigns to a “no-deal” Brexit to just 5% from 10% previously, while The Sunday Times reported the EU would delay Brexit until February 2020 if a deal doesn’t make it through parliament this week.\n\nSpeaking before markets opened in Asia, Timothy Graf, strategist at U.S. asset manager State Street, said the pound may have been “a little bit overbought” last week, but Saturday’s vote in the House of Commons implies a no-deal departure is now unlikely.\n\n“It’s a positive in the sense that we have avoided the worst outcome”, he said.\n\nKallum Pickering, a senior economist at Berenberg, made a similar case.\n\n“I would not be selling on Monday morning on the basis of the news over the weekend,” he said.\n\nBANKS DROP EXTRA SUNDAY STAFF PLANS\n\nOn Saturday Deutsche Bank strategist Oliver Harvey said his bank retained a “constructive outlook on the UK” and a positive view on the pound.\n\n“The only remaining tail risk is that EU27 leaders do not agree to an extension (which seems unlikely) or that in a subsequent election the no-deal Brexit Party performs sufficiently strongly to enter government,” Harvey said.\n\nPeter Lowman, chief investment officer at Investment Quorum, said there is a possibility that the opening of the markets could prove somewhat uneventful, given the lack of visibility.\n\nInvestors who built positions on the pound and UK stocks expecting a favourable outcome had little reason to change their minds, he argued.\n\nIn London, investment banks had been ready to implement special measures to ensure that they and their clients could tackle a potential volatility surge on Sunday evening, with additional staff on trading desks.\n\nRussell Lascala, head of foreign exchange trading at Deutsche Bank, said his team wasn’t expecting a dramatic session of trading and that plans to call in 20 additional people had been abandoned.\n\n“I don’t think we’re going to see much when the market opens later on Sunday,” he said.\n\nA spokeswoman at Citi said on Friday that the bank would be hosting a conference call with former British foreign minister William Hague to help its clients to analyse the country’s political situation.", "description": "Sterling slipped half a percent as world currency markets opened for the first time since the UK parliament delayed a crucial vote on a Brexit withdrawal agreement.", "authors": ["Julien Ponthus", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191020&t=2&i=1443046135&w=1200&r=LYNXMPEF9J0JG", "published_at": "2019-10-20"}