{"pub": "vice", "url": "https://vice.com/en_us/article/ywaq9v/will-the-26-new-sexual-allegations-against-trump-be-ignored-like-the-rest", "downloaded_at": "2019-10-09 18:37:11.012486+00:00", "title": "Will the 26 New Sexual Allegations Against Trump Be Ignored Like the Rest?", "language": "en", "text": "Another woman has just accused the president of sexual assault, and the depressing thing is that it barely feels like news.\n\nIn an Esquire excerpt from a new book, a woman named Karen Johnson said that in the early 2000s, Donald Trump committed what amounts to an attack on her while she was at a New Year's Eve party with her ailing husband.\n\n\"I was just walking to the bathroom. I was grabbed and pulled behind a tapestry, and it was him. And I'm a tall girl and I had six-inch heels on, and I still remember looking up at him. And he's strong, and he just kissed me,\" she told Barry Levine and Monique El-Faizy, the authors of All the President's Women. \"I was so scared because of who he was... I don't even know where it came from. I didn't have a say in the matter.\" She added that his approach bore similarities to the behavior he admitted to in that infamous Access Hollywood tape that surfaced during the 2016 campaign. \"When he says that thing, 'Grab them in the pussy,' that hits me hard because when he grabbed me and pulled me into the tapestry, that's where he grabbed me—he grabbed me there in my front and pulled me in.\"\n\nThis sort of charge would be shocking were it directed at any other public figure, but Trump has been accused of similar behavior by almost two dozen women. He's accused all of them of lying, and also said that when he essentially bragged about the same behavior he's accused of on Access Hollywood those \"words don't reflect who I am.\" In 2016, enough voters either bought those denials, thought Hillary Clinton's behavior was somehow worse, or simply didn't care. Since then, Trump's alleged assaults on women have rarely dominated headlines or been highlighted by Democratic leaders. The argument that these accusations are likely to be true and therefore disqualify Trump from the presidency on a fundamental level is rarely ever made anymore. The president may be a serial assaulter of women, yet the country's attention wanders.\n\nEven when Trump was accused of outright rape by the writer E. Jean Carroll earlier this year, it amounted to a blip. Partly this may be because the media didn't give it enough attention. But it's also true that Trump's base has shown a willingness to simply ignore whatever ugly behavior their leader is accused of. A majority of the president's supporters and congressional Republicans appear to not care about any of this.\n\nTrump has been at the center of so many scandals—the latest of which threatens to result in his impeachment—that Karen Johnson's accusations may be largely ignored. There are another 42 instances of \"alleged inappropriate behavior\" in All the President's Women, according to Esquire, including 25 more \"instances of unwanted sexual contact.\" Yet the chance of the book sparking an outcry are essentially nil.\n\nIt's horrible to contemplate the idea of the president's alleged actions—grabbing women, kissing them against their will, in Carroll’s case forcing his penis inside her as she struggles desperately to escape. It's perhaps more horrible to imagine all the people who have decided to greet these accusations with a collective shrug. But Trump retaining his power despite charges of mistreating women is not an aberration in American life. He got away with it for so long—and continues to evade serious consequences—because society has always protected men like him.\n\nSign up for our newsletter to get the best of VICE delivered to your inbox daily.\n\nFollow Harry Cheadle on Twitter.", "description": "A new book titled 'All the President's Women' includes new stories about the president's alleged grotesque behavior.", "authors": [], "top_image": "https://video-images.vice.com/articles/5d9dfc37c94537000a1540e9/lede/1570638736273-donald-trump-models.jpeg?crop=1xw:0.3817xh;0xw,0.024xh&resize=1200:*", "published_at": "2019-10-09"}