{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-election-interference/british-electoral-system-unprepared-to-resist-foreign-interference-officials-say-idUKKCN1VV2AV", "downloaded_at": "2019-09-10 23:42:59.141540+00:00", "title": "British electoral system unprepared to resist foreign interference, officials say", "language": "en", "text": "LONDON (Reuters) - With an election looming, Britain does not have time to implement measures to resist the sort of social media and “fake news” campaigns involving suspected foreign actors that have affected some Western nations, officials say.\n\nIn the wake of the 2016 referendum in which British voters decided by 52 to 48 percent to leave the European Union, defeated pro-EU campaigners and some experts alleged that misleading social media messaging and disinformation circulated by Russia had influenced the referendum result.\n\nBut while British government officials and politicians have extensively discussed tightening laws governing who can register to vote and how politically related advertising and social media promotions could be regulated, they so far have done little to implement such election security measures.\n\nPrime Minister Boris Johnson and main opposition parties see an earlier than scheduled election, perhaps as soon as this autumn, as a way to break the deadlock over Brexit three years after the referendum, but they differ on timing.\n\nIn the meantime, British government bodies are offering conflicting assessments of the recent impact of misinformation and social media messaging on British politics.\n\nIn 2018, Andrew Parker, director of Britain’s internal security agency, known as MI5, said he knew of no evidence that foreign government interference had influenced the Brexit referendum result.\n\n“I’m not aware of any information suggesting that the outcome was determined by any sort of interference,” Parker told journalists after a speech in Berlin, though he declined to answer a follow-up question regarding whether Russia had attempted such interference.\n\nHOSTILE ACTORS\n\nHowever, in a report issued earlier this year, a parliamentary committee challenged the spies’ assessment.\n\nThe British government “cannot state definitively that there was ‘no evidence of successful interference’ in our democratic process, as the term ‘successful’ is impossible to define in retrospect,” the House of Commons Committee on Digital, Culture, Media and Sport reported.\n\n“There is, however, strong evidence that points to hostile state actors influencing democratic processes,” the committee said. It said that anti-EU articles about the referendum circulated by Russian-backed media outlets RT and Sputnik had a much wider “social reach” than similar content posted by official pro-“leave” Brexit campaign websites.\n\nMoscow denies interference in the Brexit process.\n\nFollowing the Brexit referendum and Commons committee investigation, British government agencies started developing plans for tightening polling procedures and instituting controls over election-related social media.\n\nBritain’s Cabinet Office, through which the prime minister and his top aides direct government policy, issued detailed proposals to outlaw intimidation of candidates and require greater disclosures by online campaigners.\n\nOne government official said a key plan was to implement a “digital imprints regime for online election campaign material” by the end of 2019, with the aim of increasing awareness of disinformation and making elections more transparent.\n\nThe Cabinet Office has also prepared legislation which would create a new offence of intimidating candidates and campaigners in the run-up to an election, the official said. Those convicted would be banned from standing for public office for five years.\n\nURGENCY\n\nHowever, neither of these proposals has been approved by parliament and it is unclear how they could move through the legislative process before the next general election, now likely before the end of 2019, officials acknowledge.\n\n“The government recognises the seriousness and urgency of introducing these commitments, but it is important that we consult properly and consider the views of others to make sure the regulatory framework is as watertight as possible,” one official said.\n\nA Cabinet Office spokeswoman said Britain had not seen evidence of successful interference in its democratic processes by a foreign government.\n\n“Despite this, we will continue to ensure our electoral system is safeguarded against future threats,” she said.\n\nDuring local government elections last May, Britain’s Electoral Commission, an agency with relatively limited powers, conducted surveys in ten jurisdictions where voters were asked to show identification documentation.\n\nA Commission spokeswoman said that nearly everyone asked to show identification did so without difficulty although it remained unclear how this might work in a parliamentary election.\n\nAcademic experts give the British government credit for at least investigating electoral weaknesses and proposing remedies.\n\nBut Professor Philip Howard of Oxford University’s Internet Institute noted that, among other shortcomings, there is no law barring people from running for office if found guilty of intimidating or abusive behaviour.", "description": "With an election looming, Britain does not have time to implement measures to resist the sort of social media and \"fake news\" campaigns involving suspected foreign actors that have affected some Western nations, officials say.", "authors": ["Mark Hosenball", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-10"}