{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7595077/Activist-owner-Hobart-pub-vows-broadcast-animal-cruelty-report-instead-Melbourne-Cup.html", "downloaded_at": "2019-10-21 06:43:25.145253+00:00", "title": "Activist owner of Hobart pub vows to broadcast animal cruelty report instead of Melbourne Cup", "language": "en", "text": "The publican of an iconic pub has defied the wishes of her business partner with the controversial decision to boycott the race that stops a nation.\n\nThe Cascade Hotel in South Hobart will not show the Melbourne Cup on November 5 and instead screen the explosive investigation into animal cruelty in the racing industry that rocked the country when it aired on ABC's 7.30 last week.\n\nPatrons who join publican Mel Bush for the viewing that day will receive a free glass of sparkling wine.\n\nShe took to the hotel's Facebook page on Saturday night to explain her decision after it sparked a divisive reaction online.\n\nMel Bush told Daily Mail Australia her decision to not show the Melbourne Cup hasn't gone down well with her business partner and husband Mal O'Brien (pictured together)\n\n'As many will be aware, we have a TAB facility at our hotel which I personally do not support,' Ms Bush posted.\n\n'Those who know me will be aware that I am not a supporter of horse or greyhound racing and advocate for greater regulation of the industry at the very least in the hope that those who treat our four legged extreme athletes with less regard than should be afforded them may be brought to account.'\n\nThe bold decision hasn't gone down well with her business partner, who also happens to be her husband Mal O'Brien.\n\n'Things are a bit tense but it's the one time he is not going to fight me for the remote,' Ms Bush told Daily Mail Australia.\n\n'He's laying low at the moment as he's copping a bit from the locals. He enjoys a punt whereas I'm opposed to gambling.'\n\n'A lot of the locals who come here won't be happy but it's not going to be a huge surprise to them. All of them know where I stand on the issue.\n\nThe Cascade Hotel (pictured) is one of Hobart's iconic and historic pubs\n\nThe publican's decision to not show the Melbourne Cup has sparked a divisive reaction\n\nMs Bush has been opposed to the horse and greyhound racing industries for as long as she can remember.\n\n'It's not a knee jerk reaction but I think the 7.30 investigation has given everyone a chance to pause,' she said.\n\n'I know my decision isn't going to change the world.\n\n'But I hope the viewing is an opportunity to open people's eyes of what's happening in the racing industry and think about where their hard earned dollars are going every time they place a bet. I also hope they put the welfare of these elite athletes first.'\n\nMel Bush (pictured) knows she's not going to change the world but hopes to open people's eyes of what's happening in the racing industry\n\nShe said the response has generally been positive so far.\n\n'I had a call from a 82-year-old woman who used to love a flutter tell me that while she will still enjoy watching the horses, she will never bet again,' Ms Bush told Daily Mail Australia.\n\n'There's been a groundswell of support, particularly here in Tasmania.'\n\nMs Bush's post on the hotel's Facebook page sparked a mixed reaction online.\n\n'Great decision. As business owners we have the ability to make these stands, challenging 'traditions\" as cruel and horrific as this doco exposed is not about people feeling a bit put out or perhaps uncomfortable that they have supported the industry- it's the bigger picture,' one woman commented.\n\nAnother added: 'Thank you for your stand, my only bet is Melbourne Cup never again. Hope to get in for a drink. Horses greyhounds, cattle & sheep our treatment of animals is a disgrace.'\n\nMany called on other pubs across Australia to follow suit.\n\nMel Bush (centre) and her husband Mal O'Brien took over the Cascade Hotel in 2016\n\nInstead of the Melbourne Cup, the hotel will show a screening of ABC's explosive investigation (pictured) that rocked the racing industry to its core\n\nBut many others disagreed.\n\n'What absolute bull. Just because some Neanderthals at an abattoir are cruel why go after racing. Most of those poor horses were NOT racehorses. Those people need to face the full penalties for cruelty. A few people not going to a cup lunch at a pub will have NO impact on their behaviour,' one punter posted.\n\nAnother added: 'What about your patrons. This can’t be the right thing to do in the service industry.'", "description": "The publican of an iconic pub in Hobart has defied the wishes of her business partner with the controversial decision to boycott the race that stops a nation.", "authors": ["Kylie Stevens For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/05/19975974-0-image-a-64_1571633834878.jpg", "published_at": "2019-10-21"}