{"pub": "yahoo", "url": "https://news.yahoo.com/insight-carmakers-repair-shops-clash-110000567.html", "downloaded_at": "2019-10-30 11:19:41.078988+00:00", "title": "INSIGHT-Carmakers and repair shops clash as automation upends aftermarket", "language": "en", "text": "* Complex crash-avoidance tech at center of heated dispute\n\n* Many carmakers say only authorized repairs ensure safety\n\n* Independent repair shops argue they are being shut out\n\n* Winners could control $800 bln aftermarket in digital era\n\n* GRAPHIC-Car safety tech: https://tmsnrt.rs/2MfpRE6\n\nBy Tina Bellon\n\nOct 30 (Reuters) - The rapid rise of crash-avoidance technology has set carmakers and repair shops on course for a collision that could determine who controls the $800 billion auto aftermarket in the digital age.\n\nGiven the unprecedented sophistication of the systems, which include lane-keeping assistance, automatic braking and blind spot detection, many automakers say only parts and repairs from their authorized dealers can ensure safety.\n\nThis has drawn fire from the independent repair shops and suppliers that currently dominate the aftermarket. They say they can produce parts and fix cars at a fraction of the cost to drivers but are being locked out.\n\nSubaru, to take one car company, tells customers any problems caused by substitute replacement parts for its EyeSight system are not covered under its warranty: \"Protect yourself and your investment by keeping your car 100% Subaru.\"\n\nIt is not alone is issuing such guidance. A Reuters review of automaker positions on advanced driver assistance systems (ADAS) repair and calibration showed that Nissan, its luxury division Infiniti and Volvo also say parts and repairs from unauthorized dealers will affect their warranties.\n\nSome companies such as General Motors and Honda , meanwhile, say original parts and authorized installation and repairs are important to ensure safety, but stop short of warranty warnings.\n\nThe aftermarket dispute is escalating in the United States. Independent repair shops and parts makers have asked the Federal Trade Commission (FTC), the government agency responsible for consumer protection, and state lawmakers to intervene.\n\nThey want carmakers to be prohibited from making warranties conditional on original ADAS parts or service, bringing the new tech in line with rules on traditional auto equipment, and want access to the latest diagnostic data from vehicle software.\n\n\"The auto industry is creating the false narrative that you can either have safety or you can have repairability,\" said Paul McCarthy, president of the Motor & Equipment Manufacturers Association (MEMA) of independent suppliers.\n\nThe car industry, however, argues the level of sophistication of the new technology changes the aftermarket game. The Auto Alliance, a U.S. trade group representing automakers, says they provide the required training and information, but that shops often lack the resources or expertise.\n\n\"Technology is allowing for great advancements in safety, so it is incumbent on technicians to stay current,\" a spokesman said.\n\nThe FTC, which is still soliciting industry views and public comments on the repair issue, declined to comment.\n\nRegardless of the rights and wrongs, the rise of automated driving software is set to reshape the sector, and there's much to fight over: the aftermarket auto repair industry is worth $390 billion a year in the United States, and more than double that globally, according to trade groups and analysts.\n\nWhoever wins will be in pole position to benefit from the anticipated self-driving car revolution, for which ADAS features are considered a precursor.\n\n\n\n\n\nCOMPLEX AND COSTLY\n\nCurrently only 10% of all cars on U.S. roads are equipped with ADAS, but that number is expected to grow rapidly, with carmakers pledging to outfit almost every new vehicle with forward collision warning and city-speed automatic emergency braking by 2020. See GRAPHIC: https://tmsnrt.rs/31UcGMR\n\nCornering the aftermarket would give automakers – currently battling falling sales - a shot in the arm. But this would be potentially devastating for the network of independent \"mom and pop\" shops that carry out most U.S. repairs and employ millions of people.\n\nThe new systems contain cameras, radar and ultrasonic sensors built into bumpers, fenders, mirrors and windshields, which make fixing vehicles after even minor collisions more complicated and expensive than ever.\n\nEdward Salamy, executive director of the Automotive Body Parts Association, said independent suppliers could produce ADAS parts for 25% to 50% of the price charged by automakers.", "description": "The rapid rise of crash-avoidance technology has set carmakers and repair shops on course for a collision that could determine who controls the $800 billion auto aftermarket in the digital age.  Given the unprecedented sophistication of the systems, which include lane-keeping assistance, automatic braking", "authors": ["Tina Bellon"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-30"}