{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/4/alexandria-ocasio-cortezs-baffling-tweet-dan-crens", "downloaded_at": "2019-09-04 23:48:12.649687+00:00", "published_at": "2019-09-04", "title": "Alexandria Ocasio-Cortez's baffling tweet to Dan Crenshaw", "language": "en", "text": "ANALYSIS/OPINION:\n\nRep. Alexandria Ocasio-Cortez fired off a flippant tweet Rep. Dan Crenshaw’s way, telling the Texas congressman he ought not lend his guns to his friends because they’re “likely” to have “abused their spouse or have a violent criminal record,” she wrote.\n\nWhat?\n\nHopefully, she was speaking without thinking — in trademark AOC style — and not actually accusing Crenshaw of hanging out with hoodlums.\n\nYou decide.\n\nHere’s what Crenshaw first tweeted, in context of referencing a story about a woman who used a handgun to defend herself against five alleged robbers, The Hill reported: “Situations like this story are why we protect the 2nd Amendment. Side note: With universal background checks, I wouldn’t be able to let my friends borrow my handgun when they travel alone like this. We would make felons out of people just for defending themselves.”\n\nOcasio-Cortez weighed in shortly after with — again, trademark AOC style — this somewhat baffling message.\n\n“You are a member of Congress,” she tweeted back to Crenshaw. “Why are you ‘lending’ guns to people unsupervised who can’t pass a basic background check? The people you’re giving a gun to have likely abused their spouse or have a violent criminal record, & you may not know it. Why on earth would you do that?”\n\nDid Ocasio-Cortez just accuse Crenshaw of having friends who were wife beaters and violent criminals?\n\nMethinks she did.\n\nRegardless, laws already address the transfer or lending of firearms to friends and strangers alike. For instance, federal law recognizes the right of gun owners to sell or loan weapons to others, so long as those others aren’t already barred from owning, buying or using guns. State laws vary.\n\nApparently — so don’t congressional opinions.\n\nOf which, on this, as on most topics, Ocasio-Cortez should keep to herself.\n\n• Cheryl Chumley can be reached at [email protected] or on Twitter, @ckchumley.\n\n\n\n\n\nSign up for Daily Opinion Newsletter\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Rep. Alexandria Ocasio-Cortez fired off a flippant tweet Rep. Dan Crenshaw's way, telling the Texas congressman he ought not lend his guns to his friends because they're \"likely\" to have \"abused their spouse or have a violent criminal record,\" she wrote. What?", "authors": ["The Washington Times Http", "Cheryl K. Chumley"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/07/26/Pelosi_AOC_49930.jpg-d9d07_c0-335-4000-2667_s1770x1032.jpg?ee19028539f29a052c900e7d1499ec319dc5a685"}