{"pub": "yahoo", "url": "https://yahoo.com/entertainment/demi-lovato-posts-unedited-bikini-photo-showing-her-cellulite-heres-me-raw-real-112831824.html", "downloaded_at": "2019-09-07 02:18:44.360678+00:00", "title": "Demi Lovato posts unedited bikini photo showing her cellulite: 'Here's me, raw, real'", "language": "en", "text": "Here is the “raw, real” Demi Lovato.\n\nThe singer and actress, 27, shared an unedited bikini photo showing her cellulite on Thursday and the post is being widely praised for its body-positive message.\n\n“This is my biggest fear,” the Instagram began. “A photo of me in a bikini unedited.”\n\nLovato said she was “just literally sooooo tired of being ashamed of my body, editing it ... so that others think I’m THEIR idea of what beautiful is, but it’s just not me. This is what I got.”\n\nLovato, who went on to rename her cellulite “celluLIT,” said in this “new chapter” — post overdose amid a comeback with new management, an upcoming album and acting gigs in the works (Will & Grace!) — it’s about “being authentic to who I am rather than trying to meet someone else’s standards. So here’s me, unashamed, unafraid and proud to own a body that has fought through so much and will continue to amaze me when I hopefully give birth one day.”\n\nLovato also wrote about how she’s relieved to be done with “a strenuous workout schedule” on top of 14-hour workdays and “depriving myself from a real birthday cake rather than opting for watermelon & whip cream with candles because I was terrified of REAL cake and was miserable on some crazy diet sh**.”\n\nShe continued, “Here’s me, RAW, REAL! And I love me. And you should love you too! Now back to the studio. I’m working on an anthem.”\n\nIn a P.S., she added, “Just so everyone’s clear. I’m not stoked on my appearance BUT I am appreciative of it and sometimes that’s the best I can do. I hope to inspire someone to appreciate their body today too.”\n\nAnd inspire she did. Messages of praise from her fans — famous and non flowed in. Amy Schumer, Ashley Graham and Alyssa Milano all reshared the post with positive messages.\n\nView photos (Screenshot: Amy Schumer via Instagram) More\n\nView photos (Screenshot: Demi Lovato via Instagram) More\n\nOthers commented on her bravery — and beauty. Here are some messages from her manager, Scooter Braun, model Hailey Baldwin, Lovato’s mother Dianna de la Garza, Bebe Rexha, Will & Grace’s Megan Mullally and many others:", "description": "Here is the “raw, real” Demi Lovato.", "authors": ["Suzy Byrne", "Editor", "Yahoo Entertainment"], "top_image": "https://s.yimg.com/uu/api/res/1.2/nXoSyuhY0ghkD486iOpq5w--~B/aD0xMjI2O3c9MTU5ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/07ac55f0-d095-11e9-bbed-9417faab4959", "published_at": "2019-09-06"}