{"pub": "nationalreview", "url": "https://washingtonexaminer.com/opinion/columnists/thinking-clearly-about-trump-and-aid-to-ukraine", "downloaded_at": "2019-10-22 13:27:51.464164+00:00", "title": "Thinking clearly about Trump and aid to Ukraine", "language": "en", "text": "There's been a lot of confusion about what, exactly, President Trump's concerns were before withholding and later approving U.S. military aid to Ukraine. Mick Mulvaney, the acting White House chief of staff, made a hash of things during his much-discussed press conference on Thursday. Media coverage of Mulvaney's appearance just made things worse. So now, some clarification.\n\nIn various statements, the president or top aides have listed five reasons for his concern about U.S. aid to Ukraine:\n\n1.) Trump's general dislike of foreign aid. \"President Trump is not a big fan of foreign aid,\" Mulvaney said Thursday. \"Never has been; still isn't. Doesn't like spending money overseas, especially when it's poorly spent.\"\n\nStarting with his campaign and continuing from his first budget, Trump has proposed cutting U.S. foreign aid. Entirely apart from the Ukraine matter, Trump has on a number of occasions taken steps to block or slow the delivery of U.S. aid to a number of nations.\n\nFor example, in August 2018, the Office of Management and Budget directed the State Department to make a list of roughly $3 billion in foreign aid that had not yet been spent. The White House's idea was to block the spending until the end of that fiscal year, Sept. 30, 2018, and then return it to the U.S. Treasury. But it took just a few weeks for the White House to back off its plan in the face of congressional opposition. This August, the OMB did the same thing, with the same result — except for Ukraine.\n\n2.) Trump's concern that other countries do not contribute enough to foreign aid. This, again, is a point Trump has made many times, starting with his campaign and throughout his presidency. It was his main critique of NATO, and it is a concern that extends to Ukraine.\n\n\"We do a lot for Ukraine,\" Trump told President Volodymyr Zelensky in the July 25 phone conversation that started the Ukraine matter. \"We spend a lot of effort and a lot of time. Much more than the European countries are doing and they should be helping you more than they are. Germany does almost nothing for you. All they do is talk, and I think it's something that you should really ask them about.\"\n\nWhile not fully accurate — Trump was wrong that other countries give little aid to Ukraine but right that they give little lethal military aid — the Zelensky conversation was a concise statement of Trump's attitude.\n\n3.) Trump's general concern about corruption in Ukraine. The president believes Ukraine has a big corruption problem, and in that view, Trump is in line with previous administrations and the rest of the world. Trump would be unique if he did not think corruption was a major problem in Ukraine. \"There is a long history of corruption and of basically Ukraine oligarchs getting their way in the Ukrainian system,\" a senior Obama administration official, reflecting a widely held view, said before one of then-Vice President Joe Biden's trips to Ukraine in December 2015.\n\nThere is also, of course, a long history of nations, including the United States, attaching anti-corruption conditions to aid to Ukraine. During a now-famous appearance in 2018, Biden recounted a March 2016 visit to Ukraine in which he insisted the government fire prosecutor general Viktor Shokin before receiving $1 billion in U.S. loan guarantees. \"I said, 'You're not getting the billion,'\" Biden recalled. \"I'm going to be leaving here in, I think it was about six hours. I looked at them and said, 'I'm leaving in six hours. If the prosecutor is not fired, you're not getting the money.'\"\n\n\"Well, son of a bitch,\" Biden said, delivering the punchline: \"He got fired.\" Another condition successfully attached to U.S. aid to Ukraine.\n\n4.) Trump's desire to see Ukraine assist in an inquiry of the Russia-2016 campaign investigation. To some readers, the most baffling portion of the Trump-Zelensky rough transcript was when Trump said, \"Our country has been through a lot and Ukraine knows a lot about it. I would like you to find out what happened with this whole situation with Ukraine. They say Crowdstrike ... I guess you have one of your wealthy people ... The server, they say Ukraine has it. There are a lot of things that went on, the whole situation.\"\n\nIt turned out that Trump was curious about a theory, one which appears to have no basis in fact, that someone in Ukraine somehow possesses the Democratic National Committee server that was hacked in 2016 and which the DNC did not let investigators examine. But there is a larger issue in what Trump said, and that is the ongoing Justice Department investigation into the origins of the Trump-Russia investigation. It's publicly known that John Durham, the U.S. attorney chosen by Attorney General William Barr to conduct the investigation, has been in contact with a number of foreign countries, including Ukraine, as part of the investigation. Trump has also heard from some Republicans that some Ukrainian officials had information to offer U.S. investigators. So he wanted Ukrainian assistance.\n\n5.) Trump's desire to see Ukraine investigate the business dealings of Biden's son, Hunter. The final part of the president's view of foreign aid to Ukraine was his belief that the elder Biden, when he was vice president, might have corruptly pressed the Ukrainians to fire a prosecutor — see above — to spare Hunter Biden, who had a suspiciously lucrative deal with the Ukrainian energy company Burisma.\n\n\"There's a lot of talk about Biden's son, that Biden stopped the prosecution and a lot of people want to find out about that so whatever you can do with the attorney general would be great,\" Trump told Zelensky in the phone call. \"Biden went around bragging that he stopped the prosecution, so if you can look into it ... It sounds horrible to me.\"\n\nSo there they are — the five reasons behind Trump's action on Ukraine. The first three are not only entirely legitimate but unremarkable. But there has been considerable controversy and confusion about the last two.\n\nTrump's desire to see Ukraine assist in the 2016 \"investigation of the investigation\" was entirely reasonable. Mulvaney referred to \"whether or not [Ukraine was] cooperating in an ongoing investigation with our Department of Justice — that's completely legitimate.\" In fact, some part of the U.S. government has been investigating the 2016 election since at least mid-2016. There is still an investigation going on — Durham's — and it would not be unusual for the government to want Ukraine to cooperate. After all, Robert Mueller's special counsel investigation sought and received the cooperation of several foreign countries. Investigating 2016 is something that has been standard procedure for the last few years.\n\nIt is the final reason — Trump's desire to see Ukraine investigate the Bidens — that set off the Ukraine affair. It differs fundamentally from the other four in that it would involve an investigation of a current political rival of the president. While a few Republicans and commentators have sought to defend Trump's request, others have suggested that the president should admit that it was improper but argue that it was simply not bad enough to warrant impeachment. \"A truthful and sound defense,\" National Review editor Rich Lowry wrote recently, \"would give ground on the impropriety of the focus on the Bidens, but emphasize that nothing came from any pressure campaign, which was quickly abandoned.\"\n\nOne fact that has gotten lost in the Mulvaney controversy is that the chief of staff clearly said Trump held up aid to Ukraine in part because he, Trump, wanted Ukraine to assist in the Durham investigation. At the same time, Mulvaney just as clearly denied that investigating the Bidens played any role in Trump's decision to withhold aid.\n\nSome press coverage conflated the two and reported that Mulvaney had admitted Trump held up the aid while demanding Ukraine \"investigate Democrats.\" Mulvaney, the New York Times said, \"told reporters that military aid was held back in part to prod Ukraine to investigate Democrats.\" The Washington Post reported that Mulvaney admitted \"that Trump withheld aid meant for Ukraine to push the government there to investigate Democrats.\"\n\nBut that is not what Mulvaney said at all. Investigating the roots of the Trump-Russia investigation is not \"investigating Democrats.\" It is investigating the actions of U.S. intelligence and law enforcement agencies during the 2016 campaign. Holding back aid to force Ukraine to investigate the Bidens would be \"investigating Democrats,\" but Mulvaney specifically denied that Trump did that.\n\nSo the story is more complicated than some press coverage suggests. Four of Trump's reasons for withholding aid were legitimate. The fifth was not. But the fact remains that the president had acceptable reasons to temporarily hold back aid. There's more to the story than just Trump's fifth reason. And on that, perhaps the president should just take Lowry's advice and move on.", "description": "There's been a lot of confusion about what, exactly, President Trump's concerns were before withholding and later approving U.S. military aid to Ukraine. Mick Mulvaney, the acting White House chief of staff, made a hash of things during his much-discussed press conference on Thursday. Media coverage of Mulvaney's appearance just made things worse. So now, some clarification.", "authors": [], "top_image": "https://mediadc.brightspotcdn.com/dims4/default/c54c623/2147483647/strip/true/crop/2290x1202+0+0/resize/1200x630!/quality/90/?url=https%3A%2F%2Fmediadc.brightspotcdn.com%2F30%2Fa3%2F944ca0304e3a8039475110cb7f34%2Ftrump-ukraine-aid.jpg", "published_at": "2019-10-21"}