{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/lebanon-protesters-reject-government-reform-promises-191021143954538.html", "downloaded_at": "2019-10-24 15:01:39.870079+00:00", "title": "Lebanon protesters reject government reform promises", "language": "en", "text": "Lebanon's Prime Minister Saad Hariri on Monday announced a series of new reforms and a 2020 budget but it has failed to appease the protesters who continued to demonstrate demanding the resignation of the government.\n\nThe approved reforms included cutting in half the salaries of some current and former politicians, abolishing the Ministry of Information and other obsolete state institutions and reforming the listless state-run power sector, Hariri said in a televised speech from the presidential palace, which followed a five-hour emergency cabinet meeting.\n\n\"These decisions are not designed as a trade-off. They are not to ask you to stop expressing your anger. That is your decision to make,\" Hariri said in a televised news conference.\n\nHundreds of thousands of people have flooded the streets since Thursday, furious at a political class they accuse of pushing the economy to the point of collapse.\n\n191021080734203\n\nPeople blocked roads for a fifth day across the country, demanding new elections and a new cabinet to be headed by a council of non-political judges.\n\nReporting from Beirut, Al Jazeera's Zenia Khodr said the announced reforms, which also included a pledge to pass laws to create an anti-corruption committee by the end of the year did not meet protesters' demands that the government resign and that a council of non-political judges take over leadership of the country until elections can be held.\n\nHariri said that he supported the demonstrators' call for early elections.\n\n\"We have heard you. If your demand is early parliamentary elections, it is your voice only that decides. I, Saad Hariri, am with you in this demand.\"\n\nShortly after Hariri spoke protesters started shouting \"revolution, revolution,\" as major roads leading to the capital, Beirut, remained blocked by burning tyres while schools, businesses and banks were closed.\n\nMaya Mhana, a teacher listening to the speech in central Beirut with other protesters, was not convinced. \"We are remaining in the streets; we don't believe a single word he said,\" she said.\n\n{articleGUID}\n\nProtesters sang the national anthem into the night and continued to demonstrate in other parts of the country, including the northern city of Tripoli and Sidon in the south.\n\nHariri, addressing the protesters, said the measures agreed on Monday might not meet their demands but were a start towards achieving some of them. The government must work to recover the people's trust, he said.\n\n\"You are the compass and ... your movement frankly is what led us to this decision today,\" added Hariri, who said big steps had been taken towards fighting corruption and waste.\n\nMany protesters said they do not trust any plan by the current government with one demonstrator describing the cabinet's promises as \"a painkilling injection.\"\n\n\"I have zero-percent trust in this government,\" Reem Mouwaad, a special needs teacher, said.\n\nThe approved 2020 budget includes no new taxes and projects a deficit of about 0.6 percent, much less than the targeted level of about seven percent for 2019.\n\nThe reforms also include plan in which the country's central bank and the banking sector, which are flush with cash, will help in reducing the country's deficit by about $3.4bn in 2020.\n\n'Smoke and mirrors'\n\n191019202831786\n\nLebanon's leaders, including influential Shia leader Hassan Nasrallah, have said that the government's resignation at this time would only deepen the crisis gripping the small Mediterranean country.\n\nProtesters have also called for laws that would pave the way for technocrats to take power, while preventing the same sectarian leaders from doing so.\n\n\"For people here, it's too little too late,\" said Al Jazeera's Khodr. \"[Protesters] say these are just promises and promises that they’ve heard time and time again.\"\n\nMany who gathered in the streets of Beirut on Monday had little hope the government would follow through in the promises, which they had previously made during the elections of 2018 and the garbage crisis of 2015, when the government was unable to produce a plan to deal with the country's waste.\n\nA woman named Chantal had joined the protests in Beirut with her little daughter, who had a Lebanese flag painted on her cheek.\n\n\"This is all just smoke and mirrors,\" she told the AFP news agency.\n\n\"How do we know these reforms will be implemented?\" she said.\n\n{articleGUID}\n\nThe five days of protests, which began on Thursday, have been particularly extraordinary because of their size, geographic reach and their appeal across ethnic lines, Al Jazeera's Khodr added.\n\nLebanon has a sectarian government in which various government roles and the number of seats in parliament are allocated based on ethnic groups. Political movements in the country are normally divided along those lines and often struggle to draw nationwide appeal.\n\n\"In many ways, a revolution has already happened in this country,\" she said. \"The young, the old, Muslim, Christian, poor. They've come together. They're no longer listening to the narrative of their sectarian leaders that tell them if you unite, if you live together, things are not going to work out.\"", "description": "A raft of economic reforms fails to quell protesters, who continue to demonstrate demanding government's resignation.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/21/41bdd8493e614d94a2d96547e6d67e8d_18.jpg", "published_at": "2019-10-21"}