{"pub": "foxnews", "url": "https://foxnews.com/food-drink/bar-anonymous-500-dollars-broken-sign-45-years", "downloaded_at": "2019-09-08 23:28:54.141409+00:00", "title": "Bar receives anonymous $500 and a shocking confession: '45 years ago I broke the Zoo Bar sign'", "language": "en", "text": "It’s never too late to make amends.\n\nA bar in Lincoln, Neb., recently received an envelope that reportedly contained $500 and a letter from an anonymous source apologizing for breaking their sign. The bar was shocked, as the sign hadn’t recently been damaged.\n\nIn fact, the letter was apparently referencing an event that happened 45 years ago.\n\nZoo Bar in Lincoln, Neb., has been open for 46 years, 1011 Now reports. They reportedly received an envelope with cash inside and a note that read, “45 years ago I broke the Zoo Bar sign. Here is my restitution.” The envelope apparently had no return address on it.\n\nThe bar’s owner was surprised to receive the letter and wondered what prompted the anonymous sign breaker to finally try to make amends.\n\nRESTAURANT SERVER'S HEARTWARMING MOMENT WITH WWII VETERAN GOES VIRAL: 'IT WAS A TOUCHING SIGHT'\n\n“Did this really torment them all that long,” Pete Watters, Zoo Bar’s owner, told 1011 Now, “or is it something else that inspired them to do that?”\n\nWatters took ownership of the bar 18 years ago, but he first started working there as a bartender 33 years ago. By that point, the sign-breaking-incident was already 12 years in the past.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nZoo Bar’s owner at the time of the sign breaking has since passed away, but Watters thinks he would’ve appreciated the letter. “I think he would have thought it was great, too,” Watters told 1011 Now. “It would have been a fun thing to share with him.”\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\nWatters apparently has no idea who wrote the letter, but he would like to thank them. “It’s really humbling to know that somebody cared enough about this place that they wanted to make it right,” he told 1011 Now.", "description": "An anonymous person is trying to make amends with a bar 45 years after he allegedly broke their sign.", "authors": ["Michael Hollan"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Envelope-money.jpg", "published_at": "2019-09-08"}