{"pub": "metro", "url": "https://metro.co.uk/2019/10/06/mason-mount-issues-injury-update-chelseas-win-southampton-10872356", "downloaded_at": "2019-10-07 00:16:40.006600+00:00", "title": "Mason Mount issues injury update after Chelsea’s win over Southampton", "language": "en", "text": "Mount was on the scoresheet again for Chelsea (Picture: Getty)\n\nMason Mount allayed fears he had suffered another ankle injury after being spotted with strapping on his ankle following Chelsea’s win over Southampton.\n\nChelsea beat Southampton 4-1 at St Mary’s on Sunday, with Mount getting on the scoresheet in another impressive performance from the 20-year-old.\n\nMount has been nursing an ankle issue in the last month, but assured fans he would be linking up with the England squad during the international break.\n\n‘Yeah, I’m fine,’ Mount told Chelsea TV when asked about his ankle.\n\nChelsea ran out 4-1 winners at Southampton (Picture: Reuters)\n\n‘It’s just precautionary. Trying to keep the swelling down.\n\n‘You always have a little bit of swelling there when you have an injury, but yeah, I’m fine.’\n\nAdvertisement\n\nAdvertisement\n\nMount will link up with Gareth Southgate’s squad for the next two weeks and will be joined by Fikayo Tomori, Ross Barkley, and Tammy Abraham.\n\nLampard was full of praise for his young stars following the victory over the Saints, but reserved special praise for Willian.\n\n‘The balance at the moment is good and that needs to stay and improve,’ said Lampard\n\n‘That comes down to those boys and a lot of them are mates, they came through together. ‘It’s nice for me, it’s great in my position, because the young players, when they’ve got the attitudes that they’ve got, it’s great to coach because they want to improve all of the time.\n\nFour Chelsea players have been called up to the England squad (Picture: Reuters)\n\n‘But the experienced players around them… Willian was the standout one today, without a doubt for me.\n\n‘His work ethic off the ball, we talk to the wingers and what we want off the ball we can show them that video of what Willian did today. ‘His quality, his bursts of pace, on the ball what he can do, the last four or five games I think he’s been our best player.\n\n‘And that’s a great thing to say when you’ve got players who are examples on the pitch around these young boys.’", "description": "Mason Mount allayed fears he had suffered another ankle injury after being spotted with strapping on his ankle following Chelsea's win over Southampton. Chelsea beat Southampton 4-1 at St Mary's...", "authors": ["Metro Sport Reporter"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1179356437_1570393137.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-06"}