{"pub": "businessinsider", "url": "https://businessinsider.com/gardner-minshew-break-his-hand-with-a-hammer-2019-9", "downloaded_at": "2019-09-25 23:34:48.588426+00:00", "title": "'What would you do to play more ball?': Gardner Minshew explains why he attempted to break his own hand with a hammer in college", "language": "en", "text": "Jacksonville Jaguars rookie quarterback Gardner Minshew is one of the hottest players in the NFL after stepping in for an injured Nick Foles in Week 1.\n\nOn Wednesday, Minshew explained to reporters why he once attempted to break his own hand with a hammer in college.\n\nMinshew first told the story on Barstool Sports' \"Pardon My Take\" podcast, explaining that it was the only path he saw towards getting a redshirt and another year of college eligibility.\n\nMinshew told reporters on Wednesday it was a \"pretty dumb\" idea, but said he'd do \"damn near anything\" to keep playing football.\n\nDespite hammering his own hand, Minshew's path to the NFL appears to have worked out even better than he could have imagined.\n\nVisit Business Insider's homepage for more stories.\n\nJacksonville Jaguars rookie quarterback Gardner Minshew has proven himself one of the rising stars of the league three weeks into the 2019 NFL season.\n\nAfter stepping in for injured Nick Foles, Minshew and his mustache have taken to the job with confidence. The Jags fell one two-point conversion short of upsetting the Texans in Week 2, and then Minshew got his first career win in Week 3 over the Titans.\n\nMinshew was second in the country in passing yards at Washington State last year and had quite a journey to the NFL. Before landing at Washington State, Minshew almost gave up on his NFL dream to get a coaching job at Alabama as a graduate assistant under Nick Saban.\n\nRead more: The NFL's hottest rookie QB almost gave up on an NFL career in college because he wanted to learn to be a coach under Nick Saban\n\nLast week, as a guest on Barstool Sports' \"Pardon My Take,\" Minshew revealed that he once attempted to break his own hand with a hammer in order to preserve another year of eligibility.\n\nThe idea came after Minshew had transferred from Northwest Mississippi Community College to join East Carolina. With two seniors in front of him, Minshew hoped to redshirt his first year and start for the Pirates through his final three years of eligibility, but was forced to give up his redshirt after seeing game action.\n\n\"So, you know, I get an idea,\" Minshew said. \"I go home, I grab a bottle of Jack Daniels and I grab a hammer. And, I go back into my room, I take a pull of the Jack Daniels, I put my hand down on the table and BOOM! BOOM! BOOM! One, two, three, hit the hell out of my hand, dude.\"\n\nMinshew said he took a few more attempts, but was ultimately unable to break his own hand, later telling his coach that he had accidentally slammed his hand in a car door.\n\nOn Wednesday, Minshew explained his reasoning for his wild college decision to reporters.\n\n\"That was the only way for me to get a redshirt at the time, was to get a medical [red shirt],\" Minshew said. \"So I had the bright idea to break my hand. But it didn't work, I guess, fortunately.\"\n\n\"Looking back it was pretty dumb — believe it or not, breaking your hand is pretty dumb,\" Minshew said. \"But I always tell people, 'What would you do to play more ball?' And that's damn near anything.\"\n\nAs it turns out, Minshew didn't need to break his own hand to play more ball — after his career-year at Washington State, Minshew was selected by the Jaguars in the sixth round of the draft, and now is getting his shot in the NFL.\n\nNFL POWER RANKINGS: Where every team stands heading into Week 4\n\nEagles receiver invites hero fan to game after he called out the player for his miscues on the local news\n\nTop 14 waiver-wire pickups for Week 4 of fantasy football\n\n'I would trade me for that': Former Dolphins lineman Laremy Tunsil told the team to trade him after seeing what the Texans offered in return", "description": "Gardner Minshew once went through drastic lengths to ensure that he would be able to play as much college football as NCAA rules would allow.", "authors": ["Tyler Lauletta"], "top_image": "https://image.businessinsider.com/5d8bbb1e2e22af407756f2fa?width=1200&format=jpeg", "published_at": "2019-09-25"}