{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7580101/Alabama-student-arrested-threatening-BOMB-Louisiana-States-Tiger-Stadium.html", "downloaded_at": "2019-10-16 21:43:32.842397+00:00", "title": "Alabama student arrested for 'threatening to BOMB Louisiana State's Tiger Stadium'", "language": "en", "text": "Connor Bruce Croll, 19, allegedly threatened to bomb LSU's Tiger Stadium to stop Saturday's game against Florida because his friend was on the verge of losing a large bet\n\nA University of Alabama student is accused of threatening to bomb Louisiana State's Tiger Stadium during the school's Saturday night football game against the University of Florida.\n\nThe Tuscaloosa News reports 19-year-old Connor Bruce Croll of Crozet, Virginia, was arrested by officers at the Alabama school and jailed Sunday as a 'fugitive from justice.'\n\nAccording to WBRZ Baton Rouge, police located the source of the call following the bomb threat and then brought in Croll for questioning. He then admitted to making the threat to stop the game because 'his friend was on the verge of losing a large bet,' according to the police report.\n\nCroll faces unspecified charges in Baton Rouge, Louisiana. Authorities didn't immediately provide further detail about the nature of the threat or say whether Croll intended to carry it out. The newspaper didn't say if Croll had a lawyer.\n\nTotal attendance for Saturday's game at Tiger Stadium was 102,321.\n\nCroll threatened to bomb LSU's Tiger Stadium Saturday, as 102,321 fans watched LSU-Florida\n\nUniversity of Alabama spokesman Chris Bryant says pranks and threats can have serious ramifications and require an appropriate response. He says the school is cooperating with authorities but can't provide details on the arrest of or allegations against the freshman.\n\n'We are aware of the arrest of a UA freshman over the weekend,' read Alabama's statement. 'Threats and pranks can have serious ramifications and necessitate an appropriate response. The university and UAPD are cooperating fully with the investigation, but we cannot provide any additional details on a pending matter.\n\n'UA will follow its student conduct policies and procedures. The LSU community has always been gracious to us, and we regret these events.'\n\nAn LSU spokesperson could not directly address the situation.\n\n'While LSU cannot discuss specific security measures, it is important for the general public to know that LSU Police and officials, along with federal and local law enforcement agencies on location, have protocol in place to respond immediately and appropriately to real and perceived threats at Tiger Stadium and all campus facilities,' LSU's media relations director told The Tuscaloosa News.\n\n'In this case, protocol was followed efficiently and effectively to quickly ascertain the source of the threat. That protocol including an immediate sweep of the stadium and a multi-agency investigation, which led to the suspect being identified within minutes and arrested soon thereafter.\n\n'LSU appreciates the cooperation of all agencies and the University of Alabama and UAPD in this very serious matter. There is nothing more important than the safety and well-being of the public on campus.'", "description": "A University of Alabama student is accused of threatening to bomb Louisiana State's Tiger Stadium during the school's Saturday night football game against the University of Florida.", "authors": ["Associated Press", "Alex Raskin Sports News Editor For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/16/19795254-0-image-a-44_1571240681421.jpg", "published_at": "2019-10-16"}