{"pub": "time", "url": "https://time.com/5704536/imf-economic-growth-china-us-trade-deal", "downloaded_at": "2019-10-18 02:03:27.523059+00:00", "title": "IMF Head: More Needed to Boost Growth Than Sino-U.S. Deal", "language": "en", "text": "WASHINGTON (AP) — The International Monetary Fund’s new leader said Thursday that a trade truce between the United States and China could trim expected losses to the world economy but won’t be enough to produce strong global growth.\n\nBefore last week’s tentative trade agreement, the IMF had estimated that higher trade tariffs would mean eight-tenths of a percentage point of lost economic input by the end of next year.\n\nThe IMF’s managing director, Kristalina Georgieva, said a new estimate that factors in the U.S.-China deal slightly reduces that lost input, to a still-significant 0.6%. She said more must be done by the world’s two biggest economies to resolve their disputes, and all countries must try to overhaul trade rules.\n\n“Our hope is to move from a trade truce to a trade peace,” she told reporters.\n\nThe Brief Newsletter Sign up to receive the top stories you need to know right now. View Sample Sign Up Now\n\nThe IMF released an updated economic outlook Tuesday that projected global growth for this year at 3%. That would be the weakest showing since a negative 0.1% in 2009, in the wake of the worst financial crisis since the 1930s.\n\nThe IMF has estimated that the punitive tariffs imposed in disputes including the U.S.-China trade war could cost the global economy as much as $700 billion in lost output by the end of next year, an amount equivalent to the annual output of Switzerland.\n\nGeorgieva, a Bulgarian economist who had held the No. 2 job at the World Bank, was tapped last month to take over at the IMF, succeeding Christine Lagarde.\n\nGeorgieva spoke to reporters before three days of discussions among finance officials as part of the fall meetings of the 189-nation IMF and its sister lending institution, the World Bank.\n\nShe said she hoped the discussions would focus on ways to ease trade tensions and begin the groundwork to update the rules of world trade. The Trump administration has repeatedly attacked the Geneva-based World Trade Organization, saying it is biased against the United States.\n\n“We have been reaching agreements on trade based primarily on the past,” she said. She noted that global commerce has been transformed in recent years by advances in technology, and those advances need to be acknowledged in new trade rules.\n\nDavid Malpass, head of the World Bank, said his focus for the meetings would be efforts to ensure that everything possible is done to restart global growth, given that the 700 million people living in extreme poverty — one in 12 people on the planet — will be the most harmed by a prolonged slowdown.\n\n“There is an urgency to what we’re doing because of the challenges facing development,” Malpass said. “Global growth is slowing, investment is sluggish, manufacturing activity is soft and trade is weakening.”\n\nIn addition to the IMF and World Bank discussions, finance ministers and the heads of central banks from the Group of 20, the world’s biggest economies, will meet Friday. Trade is likely to be a top agenda item.\n\nLast week, the United States and China reached a temporary cease fire in their trade fight when President Donald Trump announced he was suspending a tariff increase on $250 billion of Chinese products that was to take effect this week.\n\nBriefing reporters Wednesday night, Treasury Secretary Steven Mnuchin said U.S. and Chinese negotiators were working to hammer out details on this “phase one” agreement.\n\nHe said he and U.S. Trade Representative Robert Lighthizer would speak by phone with Chinese Vice Premier Liu He next week and planned to meet with him in Santiago, Chile, before the Asia Pacific Economic Cooperation leaders’ summit on Nov. 16-17.\n\nIt is expected that Trump and Chinese President Xi Jinping will meet at that summit to sign the initial phase of the deal, if it is finalized by that time.\n\nMnuchin said the administration has made no decision yet on whether it will postpone 15% tariffs on $160 billion in Chinese goods still due to take effect on Dec. 15.\n\nContact us at editors@time.com.", "description": "Kristalina Georgieva says a truce between the U.S. and China could trim expected losses but won't be enough to produce strong global growth.", "authors": ["Martin Crutsinger"], "top_image": "https://timedotcom.files.wordpress.com/2019/10/ap19290525602674.jpg?quality=85&w=1200&h=628&crop=1", "published_at": "2019-10-18"}