{"pub": "abcnews", "url": "https://abcnews.go.com/US/video-duck-beaten-killed-broomstick-high-school-football/story?id=65504724", "downloaded_at": "2019-09-10 23:30:39.634784+00:00", "title": "Video of duck being beaten and killed with broomstick by high school football players infuriates community", "language": "en", "text": "Graphic video of several high school football players luring a duck out of the water and beating it to death with a broomstick has landed several New Hampshire high school football players in hot water.\n\nThe incident, which is alleged to have happened two weeks ago at a football camp in Moultonborough, New Hampshire, involved several football players from Kennett High School, according to ABC News’ New Hampshire affiliate WMUR.\n\nThe video shows the players standing around before luring a wild duck out of the water before one of them hits the duck hard with a broomstick which gravely injured the animal. Another student then approached the duck and allegedly euthanized it to put it out of its misery.\n\n\"The heinous activity of a duck being hit over the head with a broomstick is what ended up happening,\" said Superintendent Kevin Richard when being interviewed by WMUR. \"And then another student ended up euthanizing the duck. It was hurt pretty badly.\"\n\nThe boys football coaches were informed of what happened a few days later and they then informed the police and the New Hampshire Fish and Game Department who were brought in to investigate the killing.\n\n\"These students are juveniles, so they cannot be charged with anything,\" said Fish and Game Major David Walsh to WMUR. \"Their parents would be charged, and the fines are small, so suspensions and community service, everyone agreed, would be the effective punishment.\"\n\nIn spite of a tweet from the New Hampshire Fish and Game Department saying the students received swift and harsh punishment, the incident has outraged the community.\n\nRegarding the situation w/ the children who killed the duck, the media were not originally aware of the entire situation. The kids involved did receive substantial consequences. F&G Law feels the school acted swiftly and appropriately and has been working w/ them from the start. — NHfishandgame (@NHfishandgame) September 9, 2019\n\n\"There are very strong opinions both ways, and you try to come back with what you think is reasonable, and also recognizing that these are adolescents that make bad choices,” said Superintendent Richard about the incident.\n\nThe school has allegedly received many phone calls from the public upset with what happened.\n\nA petition on the website Change.org asking for a harsher punishment for the boys involved has already been signed by more than 1,700 people in just three days.\n\n“The people who were involved are disgusting. How could they laugh when they killed a living being. I 100% support this petition and I pray that those people get a worse punishment,” said Emily Wansor who signed the petition.\n\n“Animal cruelty is just one step in what can become a very disturbing future for any of these kids. Strict and firm legal consequences are necessary, and it’s absurd that this grotesque behaviour is basically being brushed off,” said Tammy Shah, another person who wants to see harsher punishment for the football players.\n\nSuperintendent Richard told WMUR that the students received punishments ranging from game suspensions, counselling, community service and that they received different levels of punishment based on their involvement.\n\n\"Some mental health pieces, social and emotional pieces and educational components related to it,\" Richard said when asked about the student’s punishments. “This was a grievous mistake.”", "description": "Graphic video of several high school football players luring a duck out of the water and beating it to death with a broomstick has landed several students in trouble.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/kennett-school-ht-wmur-ml-190910_hpMain_16x9_992.jpg", "published_at": "2019-09-10"}