{"pub": "realclearpolitics", "url": "https://vox.com/policy-and-politics/2019/9/27/20885360/impeach-donald-trump-ukraine", "downloaded_at": "2019-09-28 01:01:08.043552+00:00", "title": "3 things impeaching Donald Trump will accomplish", "language": "en", "text": "In Federalist 65, Alexander Hamilton considers the problem of impeachment. The process, the Constitution framer writes, is meant for offenses “denominated POLITICAL, as they relate chiefly to injuries done immediately to the society itself.”\n\nPolitical offenses are, by nature, politicized. They “agitate the passions of the whole community” and “divide it into parties more or less friendly or inimical to the accused.” The danger, Hamilton says, is that the impeachment process will be decided “more by the comparative strength of parties, than by the real demonstrations of innocence or guilt.” If that proves either the perception or the reality of impeachment, the process loses its legitimacy, and America loses critical protection against tyrants and criminals.\n\nEverything, then, rests on the independence and authority of the body charged with impeachment. Hamilton admitted that there was no tribunal capable of “the most exact standard of perfection,” but the best possible hope lay with the Senate. He believed that no “other body would be likely to feel CONFIDENCE ENOUGH IN ITS OWN SITUATION, to preserve, unawed and uninfluenced, the necessary impartiality between an INDIVIDUAL accused, and the REPRESENTATIVES OF THE PEOPLE.”\n\nHe was wrong.\n\nPresident Donald Trump faces impeachment after repeatedly asking the president of Ukraine to investigate Joe Biden, Trump’s chief domestic political rival, a week after Trump froze the country’s military aid. When Ukrainian President Volodymyr Zelensky brought up the aid, Trump responded, “I would like you to do us a favor though” and turned the conversation to Biden. All of this is confirmed in a call record released by Trump’s own White House.\n\nHamilton wrote in defense of a political system he thought would resist organized political parties. Today, the Senate makes no pretense to impartiality. The modern Senate, like the House, is controlled by a political party — and it is the political party Trump leads.\n\n“If this is the ‘launching point’ for House Democrats’ impeachment process, they’ve already overplayed their hand,” Majority Leader Mitch McConnell told Politico.\n\n“The Senate will never convict President Trump,” his longtime No. 2, Sen. John Cornyn, said before even reading the whistleblower’s report.\n\nImpeachment was meant to be a political remedy for political offenses. But over time, it has mutated into something quite different: a partisan remedy for political offenses. And partisan remedies are subject to partisan considerations. If Trump falls before an impeachment trial, the Republican Party will be left in wreckage. The GOP’s leaders can’t permit the destruction of their own party. They will protect Trump at all costs.\n\n“I think we have seen the total collapse of this very basic obligation of Congress under the weight of partisan polarization — particularly on the right — and it is dramatic,” says Julian Zelizer, a presidential historian at Princeton University. “Trump has exposed it rather than triggered it.”\n\nThere have been only three serious presidential impeachment efforts in American history. Every single one of them came when Congress was controlled by the opposition party. “Impeachment has essentially never been effective, except maybe as a deterrent,” says Matt Glassman, who is a senior fellow at Georgetown University’s Government Affairs Institute.\n\nBut deterrents matter. Rather than focusing on what impeachment cannot do, it’s worth looking at what it can. The impeachment process, as it stands now, is broken. It almost certainly will not lead to Trump’s removal, no matter how damning the investigation’s findings. But that doesn’t make it useless. It can act as a sanction to Trump and his successors, unearth information voters will need when deciding whether to reelect Trump, and provide a warning to foreign countries that would seek influence over our politics.\n\nThat is not sufficient, but it will have to be enough.\n\n1) Impeachment as public disgrace\n\n“We tend to think of impeachment as a mechanism of removal,” says Lilliana Mason, a political scientist at the University of Maryland, “but it tends to be used as a mechanism of sanction. It’s not that you don’t get to be president anymore. It’s that you’ve done something very bad and we’ll tell everyone and publicize it. ”\n\nImpeachment acts as a form of public disgrace. To be one of only four impeached presidents in American history, even if you are not convicted by the Senate, is to know an asterisk will be forever attached to your presidency, your offenses prominently recorded. It’s a humiliation for you and a warning to your successors.\n\nThat’s one way in which impeachment acts as a deterrent. It’s a statement that a particular action falls outside the boundaries of normal American politics, that the behavior violated the public trust in a historic fashion.\n\nThis is not as strong a punishment as removal from office, of course. But it’s a stronger punishment than some Democrats issuing critical press releases before moving onto other issues. And it may yet lead to removal from office.\n\n2) Impeachment and the 2020 election\n\nIn impeachment, the House’s role is to bring and try the case, while the Senate’s role is to judge the accused. The problem facing the country right now is that Senate leadership has flatly stated that it would never, under any circumstances, convict the accused. Given the two-thirds supermajority required for removal, McConnell and Cornyn’s guarantees hold weight.\n\nBut the Senate isn’t the only possible judge of an impeachment case. In 2020, Americans will go to the polls to vote for the next president. If the House conducts a serious, thorough impeachment investigation, the revelations of that inquiry will inform their choice. Indeed, if Senate Republicans are stonewalling accountability for a clearly corrupt president, it may affect Americans’ choices in Senate elections, too.\n\nMoreover, Trump’s offense is directly relevant to the 2020 election. In trying the case before the “judge” of the 2020 electorate, House Democrats will be elevating Trump’s offense to the proper jury.\n\nA well-constructed impeachment inquiry will harm Trump’s reelection bid. Of course, the flip is that an ill-constructed impeachment drive will boost it. But House Democrats seem intent on building their case carefully. Speaker Pelosi resisted impeachment after the Mueller report, in part because the absence of collusion made it a weak case for impeachment.\n\nNow Trump has attempted collusion in the plain text of a call record released by his own White House, and the case for impeachment is markedly stronger. Where Democrats were split on the impeachment question after Mueller, Republicans are the ones who are beginning to split, with Vermont’s GOP governor backing impeachment.\n\nTrump wanted to run for reelection atop a booming economy. Now he will run as the candidate arguing that his demands of Ukraine did not quite rise to the level of quid pro quo. It’s not a great bumper sticker.\n\n3) Impeachment is a message to foreign countries\n\nIn 2016, Russia reached into the US presidential election to help elect Donald Trump. Its investment was returned in spades. Trump, perhaps pleased by the result and emboldened by the wan aftermath of the Mueller investigation, subsequently asked Ukraine to launch an investigation on his behalf, in an effort to undermine one of his most formidable domestic political rivals.\n\nThe question for any foreign country facing an opportunity or request to intervene in America’s election is what they may gain and what they may lose. For Ukraine, the potential gains were clear: military aid and anything else that might flow from nurturing Trump’s goodwill.\n\nThe spotlight of impeachment makes the costs clearer, too. A foreign country that is asked to intervene in an American election may see its activities exposed, much to the fury of the other political party and the public. Ukraine may want Trump’s goodwill, but it doesn’t want the Democrats’ ill will or the distraction and infamy of this investigation.\n\nImpeachment, in this case, acts as a message to other countries. “There is an element of saying to foreign governments, ‘We’re not going to allow this to happen,’” says Mason. “It may just be theater, but it’s necessary theater to protect American elections.”\n\nImpeachment is broken, but not useless\n\nIn his farewell address, President George Washington spoke against “the common and continual mischiefs of the spirit of party.” In particular, he warned that partisan infighting “opens the door to foreign influence and corruption, which finds a facilitated access to the government itself through the channels of party passions.”\n\nWe live now in the world Washington feared. Party polarization has broken the American political system’s mechanisms of accountability. Republicans have fallen in line behind Trump, placing their loyalty to him, and to each other, above any sense of public accountability. And in doing, they have opened American politics to foreign influence and corruption — both from opportunists, like Russia, and enlisted allies of Trump’s, like Ukraine.\n\nA system of partisan accountability often means no system of accountability at all. It creates eras in which corruption flourishes, so long as that corruption is to the benefit of the party in power. That American politics has no answer for official wrongdoing in periods of unified government is chilling. Elections are not, on their own, sufficient — without rigorous systems of oversight, investigation, and accountability, the public often doesn’t know of the wrongdoing it should punish.\n\nHamilton wasn’t, in the end, just the author of Federalist 65. He was also the author of much of Washington’s farewell address. Sadly, it’s his pessimism about an America driven by party, rather than his optimism about the Senate, that rings true today.\n\nStill, even a broken impeachment process has its uses. The Senate may refuse its role, but through a properly designed impeachment process, the House can focus the public’s attention, send a message to the world, and create a record for the future.", "description": "The case for impeachment, even if it can’t oust Trump.", "authors": ["Ezra Klein", "Sep"], "top_image": "https://cdn.vox-cdn.com/thumbor/2oT_2JInD2reAEDuAkPsBsULuAY=/0x0:3000x1571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19236907/GettyImages_969746660.jpg", "published_at": "2019-09-27"}