{"pub": "reuters", "title": "Box Office: 'Angel Has Fallen' Sears Competition Over Labor Day Weekend", "url": "https://ca.reuters.com/article/entertainmentNews/idCAKCN1VM1EN-OCAEN", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:27:52.798292+00:00", "text": "FILE PHOTO: Gerard Butler and Morgan Brown attend the premiere for the film “Angel Has Fallen” in Los Angeles, California, U.S., August 20, 2019. REUTERS/Mario Anzuoni/File Photo\n\nLOS ANGELES, (Variety.com) - Lionsgate and Millennium’s “Angel Has Fallen” ruled the box office during an expectedly quiet Labor Day weekend. The third entry in the action franchise generated $11.5 million over the weekend and should close out the holiday with $14.4 million.\n\nWithout any new nationwide offerings from a major Hollywood studio, those ticket sales were enough to maintain first place on domestic box office charts. After two weekends in theaters, the Gerard Butler-led “Angel Has Fallen” has earned $43.6 million.\n\nBlumhouse Tilt and OTL took on the last weekend of summer, closing out popcorn season with “Don’t Let Go.” The supernatural thriller debuted with $2.4 million from 920 North American theaters and is expected to finish the holiday weekend with $3 million. David Oyelowo stars as a detective working to solve the murder of his niece (portrayed by Storm Reid) when he surprisingly gets a phone call from her. “Don’t Let Go” premiered at Sundance under the name “Relive.”\n\nThe final movie to launch this summer is Forrest Film’s drama “Bennett’s War,” which is hoping to hit half a million in box office receipts through Monday. Over the weekend, the movie collected $445,151.\n\nLabor Day weekend isn’t usually a busy time of year for moviegoing, so holdovers including Universal’s “Good Boys” and “Hobbs & Shaw” and Disney’s “The Lion King.”\n\nUniversal’s “Good Boys” held steady at No. 2, pocketing $9.1 million over the weekend for an estimated $11.5 million Labor Day weekend. After three weeks in theaters, the R-rated comedy has earned a solid $58 million.\n\nDisney’s “The Lion King” nabbed third place, earning $6.7 million during its seventh outing and eyeing $8.8 million through the four-day weekend. Through Sunday, the photorealistic remake has earned $521 million in North America. “The Lion King” is now the seventh-biggest movie in history with $1.562 billion globally, passing “Furious 7” ($1.516 billion) and “The Avengers ($1.519 million).\n\nIn fourth, Universal’s “Hobbs & Shaw” generated $6.2 million over the weekend and should finish the holiday with $8 million. The “Fast & Furious” spinoff, starring Dwayne Wade and Jason Statham, has made $158.86 million at the domestic box office and $684.2 million worldwide.\n\nSony’s “Overcomer” amassed $5.7 million for a fifth-place finish. The faith-based film looks to end Monday with $7.8 million, which would bring North American ticket sales to $19.4 million.", "description": "LOS ANGELES, (Variety.com) - Lionsgate and Millennium's \"Angel Has Fallen\" ruled the box office during an expectedly quiet Labor Day weekend. The third entry in the action franchise generated $11.5 million over the weekend and should close out the holiday with $14.4 million.", "authors": ["Rebecca Rubin", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190901&t=2&i=1425109185&w=1200&r=LYNXNPEF801R4-OCAEN"}