{"pub": "yahoo", "url": "https://sports.yahoo.com/michael-jordan-opens-7-million-medical-clinic-in-charlotte-the-first-of-2-000554175.html", "downloaded_at": "2019-10-18 03:25:08.201439+00:00", "title": "Michael Jordan opens first of 2 Charlotte medical clinics made possible by $7.2 million donation", "language": "en", "text": "Six-time NBA champion Michael Jordan was moved to tears Thursday as he formally opened the first of two clinics funded by his family in Charlotte, North Carolina, the Charlotte Observer reported.\n\n“This is a very emotional thing for me to be able to give back to a community that has supported me over the years,” Jordan said as he unveiled the Novant Health Michael Jordan Family Medical Clinic. He donated $7.2 million for the two clinics.\n\nThe Novant Health Michael Jordan Family Medical Clinic is open for business!📍3149 Freedom Drive Charlotte, NC 28202 pic.twitter.com/gbS2AzZInA — Novant Health (@NovantHealth) October 17, 2019\n\nScroll to continue with content Ad\n\nThe clinic will provide care to an underprivileged part of the community, including primary and preventive care for those who are uninsured or underinsured. It is also staffed with social workers, behavioral health experts, oral health practitioners, and physical therapists.\n\nExpected to serve 35,000 children and adults over the next five years, according to the Observer, the clinic opened for business three weeks ago and has already seen 300 patients.\n\n“I’ve gone off and made my life in Illinois and other places,” Jordan said, in reference to the prime of his career spent with the Chicago Bulls. “But I know where it all begins.”\n\nIn partnership with the Charlotte Hornets, which he owns, Jordan had already given nearly $750,000 to the Novant Health Community Care Cruiser over the years. He also donated to “literacy efforts in low-income Charlotte neighborhoods.”\n\nStory continues\n\n“It’s not the financials but [it’s] from the heart — a passion from what this city, this state has given back to me,” Jordan said. “I can never repay what you have given to me. But this is a start.”\n\nMichael Jordan continued his philanthropic endeavors in Charlotte with the first of two medical clinics. (AP Photo/Chuck Burton)\n\nMore from Yahoo Sports:", "description": "The six-time NBA champion was moved to tears at a ribbon-cutting ceremony Thursday.", "authors": ["Torrey Hart"], "top_image": "https://s.yimg.com/ny/api/res/1.2/jFSTDSM2Hjn44tqnz9KelA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03OTIuNTMzMzMzMzMzMzMzMw--/https://s.yimg.com/uu/api/res/1.2/aF2d3D6gvxRoaAmCJmDI.Q--~B/aD0yODgxO3c9NDY1MTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/24f4f020-f13a-11e9-bbfe-51edc28a6b8b", "published_at": "2019-10-18"}