{"pub": "cnbc", "url": "https://cnbc.com/2019/09/05/fed-rates-investors-unlikely-to-be-satisfied-with-quarter-point-cut.html", "downloaded_at": "2019-09-06 12:06:53.701653+00:00", "title": "The Fed is expected to cut rates only a quarter point, and that may not satisfy markets", "language": "en", "text": "\"If the Fed continues to go gradually, it will never get ahead of the markets,\" said Joseph LaVorgna, chief Americas economist at Natixis. \"The Fed is not very strategic in its thinking. It needs to focus more on what's happening globally.\"\n\nA 25 basis point reduction would bring the Fed's benchmark overnight lending rate to a range between 1.75% and 2%. Assuming the rate would trade around the midpoint, that would still leave it about 30 basis points above where the 10-year Treasury note traded Thursday afternoon.\n\nIf the Federal Reserve follows expectations and cuts interest rates by a quarter point later this month, it will still leave the central bank well behind where the bond market thinks it should be.\n\nWhat's happening globally is a strong trend toward zero and negative nominal rates on sovereign debt, across the euro zone to Japan and elsewhere. The Fed has resisted the trend even though many of its officials have indicated they suspect that the next economic downturn will see a return to near-zero rates, and former Chairman Alan Greenspan has speculated that the U.S. might well go negative at some point.\n\nA quarter-point reduction would follow a July cut that was the first in 11 years.\n\nStill, it would be unlikely to placate President Donald Trump and it could leave the central bank open to charges that it is tone-deaf about market and economic data signals warning of a pronounced slowdown even if chances of an actual recession anytime soon remain remote.\n\nA reduction also would still see the U.S. with the highest policy rate of any G-7 nation.\n\n\"If the Fed only goes 25, that's a risk-off event for equities. The Fed needs to think more holistically and look more where global rates are,\" said LaVorgna, who advocates a 75 basis point cut that the Sept. 17-18 Federal Open Market Committee meeting, though he knows there is no chance of it happening.\n\n\"They have to go back to data dependence and mean it,\" he added. \"They have to go more. That's why I'm arguing for 75. That's what would uninvert the curve.\"\n\nThe data currently is sending mixed signals.\n\nManufacturing indicators like the Markit PMI and Institute for Supply Manufacturing are pointing to a modest contraction. However, the ISM nonmanufacturing index released Thursday showed the slowness has not spilled over into the services industry, which generates more activity in the U.S. economy and is the primary driver of job growth.\n\n\"On one hand, while the manufacturing and manufacturing-linked data is moderating and providing an ample amount of ammunition to stimulate, the employment and the price stability and inflation-based data doesn't,\" said Lisa Shalett, chief investment officer at Morgan Stanley Wealth Management. \"Inflation actually may be bouncing back a little bit from what had been a lot of deflationary fears earlier in the year.\"\n\nShalett said the conflicting economic signals plus Trump's criticisms have put the Fed in a difficult position, where it risks either looking stubborn by not cutting aggressively or political by moving faster than it has indicated would be necessary under current conditions.\n\nAfter all, Fed Chairman Jerome Powell said after the July reduction that it was merely a \"midcycle\" adjustment and shouldn't be interpreted as part of a longer-run loosening strategy.\n\n\"They're going to have to get hit in the face with it,\" Shalett said of the conditions necessary for more aggressive cuts. \"They're going to have to wait until they get a bad employment number, a really weak inflation number, or some exogenous shock or negative GDP number to get them to feel a greater sense of urgency, to get them to feel that they are justified in the face of questions about their independence.\"", "description": "A quarter-point reduction would follow a July cut that was the first in 11 years. Still, it would be unlikely to placate President Trump.", "authors": ["Jeff Cox"], "top_image": "https://image.cnbcfm.com/api/v1/image/106111686-15676156310301u8a1736.jpg?v=1567616136", "published_at": "2019-09-05"}