{"pub": "reuters", "url": "https://af.reuters.com/article/worldNews/idAFKBN1WJ153", "downloaded_at": "2019-10-04 12:40:00.673324+00:00", "title": "As Trump attacks intensify, Biden supporters stand firm - for now", "language": "en", "text": "ALLENTOWN, Pa. (Reuters) - Joan Fialkov, a 66-year-old retired teacher and lifelong Democratic voter from Pennsylvania, believes Joe Biden can restore some stability to the country after Donald Trump’s presidency.\n\nFILE PHOTO: Former U.S. Vice President and Democratic presidential hopeful Joe Biden makes a statement during an event in Wilmington, Delaware, U.S., September 24, 2019. REUTERS/Bastiaan Slabbers/File Photo\n\nBut his smears of Biden make her nervous as she recalls his attacks on 2016 Democratic presidential candidate Hillary Clinton.\n\n“I think Hillary Clinton lost because Trump and the Republicans were able to raise doubts even when there was really nothing there,” Fialkov said on Wednesday at a town hall event in Allentown, Pennsylvania.\n\nWhile Biden’s campaign is trying to leverage the moment as a political opportunity, Trump’s apparent determination to use vague allegations of corruption to hurt his opponent presents an ongoing challenge for the former vice president.\n\nAlready facing an impeachment inquiry by the U.S. House of Representatives for pressuring Ukraine to probe Biden and his son Hunter’s business dealings in that country, Trump on Thursday called on China to investigate the Bidens as well.\n\nBiden has portrayed Trump’s strategy as evidence the president sees him as the likely winner and most dangerous opponent among the 19 candidates seeking the Democratic nomination to face him in the November 2020 election.\n\nDick Harpootlian, a Biden supporter in the early voting state of South Carolina, said Trump’s attacks show Democratic primary voters that Trump is most fearful of Biden. “The best endorsement Joe Biden can get is from Donald Trump,” he said.\n\nBut some also worry that Trump’s repeated charges of corruption may stick to Biden in the long term.\n\nA recent Monmouth University poll found that 43% of registered voters believe Biden pressured Ukraine to keep it from investigating his son’s business interests there, including 21% of Democrats and 39% of independents.\n\nSince news broke of a whistleblower complaint over Trump’s call with Ukraine, Biden’s campaign team has furiously denied Trump’s claims have any legitimacy.\n\nAnd so far, Trump’s relentless airing of conspiracy theories does not seem to have damaged Biden politically.\n\nA frontrunner for much of the 2020 Democratic race, Biden, 76, has not lost significant support in national polls since Trump’s request of the Ukraine government came to light.\n\nNearly 10 Democratic voters interviewed by Reuters this week said they stood by Biden, and Trump’s tactics would not influence their views.”I like Biden, though I am still undecided. But we can’t let Trump drag us down into these silly debates that only distract from his own problems,” said Pete Leffler, a healthcare worker who attended the Allentown town hall.\n\nMike McMullon, 67, of St. Charles, Missouri, agreed Trump’s attacks would not soften his support for Biden. “It’s a schoolyard tactic and I’m not buying it,” McMullon said.\n\nEven so, he wants to know the facts about the claims around Biden and his son. “If Joe Biden had any involvement or profited from what’s going on, there’s some vulnerability,” he said.\n\nLINGERING PROBLEMS\n\nFor weeks, Biden’s biggest problem has not been Trump but U.S. Senator Elizabeth Warren of Massachusetts who is also vying for the Democratic nomination.\n\nBiden dropped two percentage points – to 18% - in the latest Sept 26-30 Reuters/Ipsos poll of Democratic-leaning voters after the House launched its impeachment probe of Trump’s dealings with Ukraine.\n\nBut he has fallen 12 points since June, and Warren trails him now by just four points.\n\nKyle Kondik, a University of Virginia political analyst, did not see any connection between Trump’s attacks on Biden and the tightening of the race.\n\n“Warren has been rising for months, and I don’t think there’s any spike associated with Ukraine,” he said.\n\nWarren and other Democratic challengers such as U.S. Senator Kamala Harris of California have refrained from criticizing Biden or his son, who had business dealings in China and Ukraine during his father’s vice presidency.\n\nAdam Green of the Progressive Change Campaign Committee, which supports Warren, said Democrats need to stay focused on Trump’s conduct and the impeachment inquiry.\n\nAt a United Auto Workers picket line in Reno, Nevada on Thursday, retired letter carrier Leslie Maxwell Burton, 67, said Biden is the only candidate who can beat Trump. She does not think less of him because of Trump’s claims and does not expect others will either.\n\n“Everybody knows the stuff that comes out of his mouth is just falsehoods and lies,” she said of Trump.", "description": "Joan Fialkov, a 66-year-old retired teacher and lifelong Democratic voter from Pennsylvania, believes Joe Biden can restore some stability to the country after Donald Trump's presidency.", "authors": ["James Oliphant", "Jarrett Renshaw", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191004&t=2&i=1436987536&w=1200&r=LYNXMPEF930SS", "published_at": "2019-10-04"}