{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/kind-words-is-a-game-where-you-send-confessional-letters-to-online-strangers", "downloaded_at": "2019-09-15 07:44:33.083090+00:00", "title": "Kind Words Is A Game Where You Send Confessional Letters To Online Strangers", "language": "en", "text": "“I always read the stuff people send me the wrong way,” a stranger on Kind Words, a new PC game where you write and receive confessional letters. “I read it as if they are upset with me and don’t want to talk to me. They’ve always told me this isn’t how they feel, but I just can’t stop thinking that.”\n\nScanning the letter, my first thought was, “Who among us?” I wrote them a response of encouragement, reminding them to trust their friends. Moments later, I received a koala sticker acknowledging its receipt.\n\nIn Kind Words, you play as an avatar in a small, cosy room who writes letters against the background of self-described “low-fi chill beats,” evoking the viral YouTube channel. The player can click through dozens of letters sent by real people, some of which touched on frustrations around joblessness, college crushes, protests in Hong Kong, or the first Borderlands 3 boss. You can choose to respond to letters however you want, and if the sender likes your response, they can send you a sticker. Writing a letter yourself feels like whispering a secret into your pillow and, from under it, hearing a chorus of compliments and acknowledgement. Thankfully, the game warns players against bullying or sharing personal information like Discord or social media links.\n\nKind Words Is Basically Wholesome Twitter With A Cute Deer If Twitter was less of a hellscape and had lo-fi beats playing in the background whenever you scrolled through your feed, the experience of it might be a little like Kind Words. Read more\n\nSome of the letters I encountered described serious struggles with mental health; Kind Words links players to mental health resources in its “Help” section. In an interview with Polygon, developer Ziba Scott explained how he sends letters “directly to players which appear in word balloons as spoken by our game’s guide, Ella the Female Mail Deer,” sometimes thanking players for sending in reports about inappropriate or worrying behaviour in others’ notes when the game was exclusive to Humble Bundle before its Steam launch. It’s to be seen whether kind words outweigh crass ones (I have, so far, encountered no trolling). The entire tone of a sensitive online space like this can shift depending on how well its community moderates itself.\n\nGetting into the groove of reading others’ most personal thoughts and sending a couple lines of encouragement never quite felt like a game, but it like a seperate zone of vulnerability and love. A big surprise for me was how uniformly kind (and quick) responses were to my letters. “I’m a little jealous that you’ve been able to become more outspoken,” read one, replying to my letter about a personality change. “That’s something I’m trying to work on myself, and, geez, it’s hard.”\n\nReceiving six or seven responses to one letter was, at first, overwhelming. After some time, as the music sunk in and I fell into a flow state with the give-and-take of letters, Kind Words became more of an environment or a mood than a set of actions and mechanics. I hadn’t expected to feel so much so soon.", "description": "“I always read the stuff people send me the wrong way,” a stranger on Kind Words, a new PC game where you write and receive confessional letters. “I read it as if they are upset with me and don’t want to talk to me. They’ve always told me this isn’t how they feel, but I just can’t stop thinking that.”...", "authors": ["Alex Walker", "Joshua Rivera"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/w1bwp5hxs6q2efwh6rpe.jpg", "published_at": "2019-09-15"}