{"pub": "breitbart", "url": "https://breitbart.com/2020-election/2019/10/15/live-updates-democrats-debate-in-ohio", "downloaded_at": "2019-10-15 23:52:56.952020+00:00", "title": "***Live Updates*** Democrats Debate in Ohio", "language": "en", "text": "Twelve presidential candidates will debate at Otterbein University in Westerville, Ohio, on Tuesday evening.\n\nElizabeth Warren, Joe Biden, Andrew Yang, Bernie Sanders, Pete Buttigieg, Kamala Harris, Robert Francis “Beto” O’Rourke, Cory Booker, Julian Castro, Tulsi Gabbard, Tom Steyer, and Amy Klobuchar will be on stage for the CNN/New York Times presidential debate.\n\nCNN anchors Anderson Cooper and Erin Burnett will moderate the debate with New York Times Editor Marc Lacey.\n\nStay tuned to Breitbart News for live updates. All times eastern.\n\n—\n\n7:36 PM: DNC Chair Tom Perez thinks Democrats can take back Ohio in 2020. Democrats want Ohio to be the state that ends Trump’s presidency. Perez rips Trump and says the election is not about “left versus right” but about “right versus wrong.”\n\n7:35 PM: Watch what Ohio residents think of Democrats–Video from Breitbart’s Matt perdie and Zenny phuong in Ohio:\n\n7:30 PM: CNN hyping the number of candidates (12) on stage as if it is a good thing.\n\nIs the word out that Dems are not allowed to talk about Hunter Biden at the debate? If he did nothing wrong taking those jobs, why’d he promise not to do it again? Why’d he say he discussed it with his father when his father says they didn’t? Many questions. Will Dems ask? — Tim Murtaugh (@TimMurtaugh) October 15, 2019\n\nTrump campaign putting its massive war chest to use:\n\n.@TeamTrump “has taken out a full-page, full-color, local newspaper advertisement ahead of the Democrats' debate in Ohio tonight… running in the Columbus Dispatch contrasting Democrats’ disastrous plans for America with @realDonaldTrump’s clear record of accomplishments.” ⬇️ pic.twitter.com/FxnDJe2hSO — Kayleigh McEnany (@kayleighmcenany) October 15, 2019\n\nSome more strong grassroots fundraising numbers for Yang. Will he get more than five minutes to speak tonight?\n\nHoly cow – thank you #YangGang as we are about to hit our goal of 40,000 donations in the few days leading up to the debate!! There is nothing we cannot do together. Ƕ💪 — Andrew Yang (@AndrewYang) October 15, 2019\n\n(Matt Perdie/Breitbart News)\n\nWill be interesting to see if top impeachment activist Steyer starts attacking other candidates…\n\nDonald Trump is a criminal and so are his associates. https://t.co/gZB3g7wJiB — Tom Steyer (@TomSteyer) October 15, 2019\n\nWarren v. Mayor Pete:\n\nNotable: A Warren campaign official says this policy is retroactive — so executives at these types of orgs who’ve given more than $200 should expect to see that money returned. https://t.co/J7wqz966T2 — Sahil Kapur (@sahilkapur) October 15, 2019\n\nSmall-dollar grassroots campaigns, aka what Buttegieg insults here as “pocket change,” out-fundraise him by millions. Our nation’s leaders should be working to end the era of big money politics, not protect it. & Beto’s gun policy isn’t “picking a fight,” it’s taking a stand. https://t.co/a6k7rgXHiD — Alexandria Ocasio-Cortez (@AOC) October 14, 2019\n\nTrump trying to lock up Ohio, the B1G swing state he is most likely to win:", "description": "Twelve presidential candidates will debate in Westerville, Ohio, on Tuesday evening. Elizabeth Warren, Joe Biden, Andrew Yang, Bernie Sanders, Pete Buttigieg, Kamala Harris, Robert Francis “Beto” O’Rourke, Cory Booker, Julian Castro, Tulsi Gabbard, Tom Steyer, and Amy Klobuchar will be on stage at Otterbein University. CNN anchors Anderson Cooper and Erin Burnett will moderate the debate with New York Times Editor Marc Lacey. Stay tuned to Breitbart News for live updates. All times eastern. | 2020 Election", "authors": ["Tony Lee"], "top_image": "https://media.breitbart.com/media/2019/10/CNN-NYT-Debate-Ohio-Democrats-AP-640x335.jpg", "published_at": "2019-10-15"}