{"pub": "nymag", "url": "https://nymag.com/intelligencer/2019/09/how-tax-policy-gave-us-white-claw.html", "downloaded_at": "2019-09-04 23:48:16.101972+00:00", "published_at": "2019-09-04", "title": "How Tax Policy Gave Us White Claw", "language": "en", "text": "He’ll feel okay about this tomorrow. Photo: Konstantin Sergeyev\n\nI’m kind of amazed the White Claw craze didn’t happen sooner.\n\nAs a gay man in New York with a well-stocked bar, I am used to my friends coming to my apartment and asking for vodka sodas. What people like about a vodka soda is what it doesn’t contain. All it has is alcohol, water, and carbonation — no extra flavorings, no caffeine, and no calorie content other than from alcohol. It’s the chicken breast of mixed drinks: broadly acceptable, gets the job done, nothing fancy. So, why did it take so long for it to come ready-to-drink in a can?\n\nPart of the answer lies in the fact White Claw, which markets itself as “hard seltzer” and “spiked sparkling water,” is not precisely a vodka soda in a can. It doesn’t contain vodka or any other distilled spirits. Instead it is made through fermentation, like beer, but starting from a base of sugar instead of cereal grains like barley. Then, carbonated water and flavoring are added.\n\nBecause White Claw is brewed like beer, it’s taxed like beer, which is important because beer is taxed in the U.S. at a much lower rate than spirits. If you made a product similar to White Claw by mixing vodka with seltzer and putting it in a can, a six-pack would be subject to almost $2 in additional taxes when sold in New York City.\n\nBecause of this tax quirk, beverage companies have long sought ways to make flavored cocktail-like beverages for the U.S. market by brewing instead of distilling. Zima, Smirnoff Ice, and Mike’s Hard Lemonade are all “malternative” beverages, brewed from grain, like beer. A problem with malternatives has been the need to find ways to mask the beer-like flavor that results from brewing. To that end, these drinks have added sugar and strong citrus flavors, which a lot of consumers like. But they don’t serve as a replacement for a vodka soda.\n\nThe key advancement with White Claw and its competitors in the “spiked seltzer” market is the use of sugar base for fermentation, which leads to a more neutral flavor than you can get by fermenting barley or other grains. This makes it possible to mix a palatable beverage with little or no added sugar and only subtle flavorings. Unflavored White Claw contains no sugar (all the sugar in the base is converted to alcohol during fermentation) while flavored versions contain just a small amount of sugar: two grams per can.\n\nThere’s another way White Claw isn’t quite like a vodka soda: It contains 5 percent alcohol by volume, similar to many beers. Most vodkas are 40 percent alcohol by volume, so to make an equally strong vodka soda, you’d need to mix one part vodka with seven parts of seltzer. Most people pour with a heavier hand than that, whether at home or at a bar. So if you think White Claw tastes very different from a vodka soda, that might just be because it’s weaker.\n\nA friend and I set out to do a taste test: Could we tell the difference between unflavored White Claw and an equally strong vodka soda made with Ketel One? In my case, the answer was no: Presented with three unlabeled glasses of beverage, I was unable to tell which of the three was different. My friend, however, guessed correctly, characterizing the White Claw as having a slight soju flavor. We were able to distinguish Grapefruit White Claw from a vodka soda made with Pamplemousse LaCroix, but we chalked that up to a difference in the styles of grapefruit flavoring.\n\nIn my view, the beer-like alcohol content of White Claw is a feature, compared to the hand-mixed vodka sodas you might drink it as a replacement for.\n\nPeople like vodka soda because it’s refreshing and light, as alcoholic beverages go. It’s the sort of thing you drink when you don’t want to focus on your drink as a culinary experience. It may be the sort of thing you drink several of in a sitting. So it is probably advantageous to you, as a consumer who wants to feel that you made good choices the following day, if it comes in a standardized form where each 12-ounce serving contains the equivalent of just one shot of liquor.\n\nAnd this gives me reason to suspect “spiked seltzer” is more than just a fad. It’s not exactly a novel product. It’s a new product that combines positive elements of two extremely well-established products: the low-calorie content, drinkability, and convenience of a light beer, and the neutral flavor and effervescence of a vodka soda. Those beverages have remained very popular for a very long time, and the same consumer preferences should be able to sustain this one, too.\n\nUpdate: This story originally overstated the additional tax White Claw would be subject to if it contained hard alcohol. It is a bit less than $2 per six-pack, not more than $2.", "description": "Vodka soda is the chicken breast of alcoholic beverages. Why did it take so long to make something like it available in a can?", "authors": ["Josh Barro"], "top_image": "https://pixel.nymag.com/imgs/daily/intelligencer/2019/09/03/03-white-claw.w1200.h630.jpg"}