{"pub": "npr", "url": "https://npr.org/2019/10/22/772291876/top-aide-to-former-defense-chief-james-mattis-recounts-what-the-general-has-not", "downloaded_at": "2019-10-22 20:44:52.480382+00:00", "title": "Top Aide To Former Defense Chief James Mattis Recounts What The General Has Not", "language": "en", "text": "Top Aide To Former Defense Chief James Mattis Recounts What The General Has Not\n\nFor all of you who've been waiting for a tell-all account of Jim Mattis' 710 days as President Trump's first Pentagon chief, that book has now been written.\n\nIt is not Call Sign Chaos: Learning to Lead, the book Mattis published in September that recounts many battles he fought — but only those that came before a president-elect Trump tapped him to be defense secretary. Mattis maddeningly refuses in that tome to go into his time serving a president who's still in office.\n\nInstead, Holding the Line: Inside Trump's Pentagon with Secretary Mattis essentially picks up the story where the former defense secretary left off. And its author had unique access to his subject: former Navy commander Guy \"Bus\" Snodgrass spent 17 months as Mattis' chief speechwriter and communications director before quitting four months prior to Mattis' own departure.\n\nThis is not, it would seem, a book the Pentagon was eager to see published. It took a lawsuit to spring Snodgrass' memoir in September from the Department of Defense, where it had languished for months in a mandatory pre-publication review.\n\nNor was Mattis pleased to learn one of his top aides was chronicling the drama of a Pentagon under Trump as commander in chief. \"I regret that you appear to be violating the trust that permitted you as a member of my staff to be in private meetings in my office,\" Mattis rebuked Snodgrass in an email that became part of the lawsuit. \"You understand that you would have been in none of those meetings, taking none of the notes your publisher high-lighted in the initial press release you sent to me, had I known you intended to violate that trust.\"\n\nSnodgrass appears to have followed the advice he describes the philosopher and longshoreman Eric Hoffer having once offered Mattis himself. \"Make sure you write down everything interesting you find,\" the former defense secretary's wordsmith quotes Mattis recounting a youthful encounter with Hoffer. Snodgrass does not reveal in his book just how he went about recording the many private conversations and interactions he describes — a significant lapse for readers wondering how in the world he reproduces those scenes verbatim — but his lawsuit rejects the Pentagon's contention that he, like Mattis himself, kept meticulous daily chronicles in black Moleskine notebooks.\n\nWhat we get in this latest reminiscence on Washington in the times of Trump is really two books. One is the memoir of an ambitious, eager-to-please naval officer who struggles to keep up with a fast-moving boss and the vicissitudes of back-stabbing top aides. The other book is what the world of Washington and beyond have been craving and what seems to have inspired the book's Holding the Line title: an insider's account of how Mattis dealt with the conundrum of how to stay in good graces with Trump while at the same time trying to shore up the very international alliances Trump detested.\n\nMuch of what Snodgrass writes about Trump has already been reported. But the \"insider's sometimes shocking account\" promised by his publisher does ring true when it comes to the speechwriter's fly-on-the-wall vignettes of Trump's interactions with Mattis.\n\nIn a chapter titled \"Trumped,\" Snodgrass portrays Mattis and then-Secretary of State Rex Tillerson as \"alarmed\" as they scrambled to put together Trump's first Pentagon briefing in July 2017. Trump had recently announced the U.S. was withdrawing from the Paris Agreement on curbing climate change, a move Snodgrass says \"was viewed by staff members in Mattis' office primarily as a way to dismantle yet another piece of President Obama's legacy.\"\n\nMattis had been getting a string of phone calls from allies startled by the Paris accord pullout, and he and Tillerson both saw the Pentagon briefing as an opportunity to sway Trump. Snodgrass writes:\n\n\"If only Trump could be made to recognize the value America derives from a strong relationship with allies and the stability afforded by the forward presence of our troops, they thought, surely he'd reconsider and alter course.\"\n\nIt was not to be. As Snodgrass, the lead organizer of the briefing, looked on from an adjacent control room, Mattis got off to a bad start with a frowning Trump at the head of the table in the Tank (as the secure briefing room is known at the Pentagon). \"Mattis tends to turn professorial during important meetings,\" his speechwriter cum public speaking critic recalls, \"providing the audience with excessive detail rather than tailoring his approach to the group he's speaking with. This instinct worsens when he is anxious about an event.\"\n\nTrump had brought his own agenda. Topping it was a military parade in Washington like one he'd recently seen in France. \"We should blow everybody away with this parade,\" Trump told the room. \"The French had an amazing parade on Bastille Day with tanks and everything. Why can't we do that?\"\n\nHe did not hear any objections, despite Snodgrass' assertion that \"Mattis and his team were adamantly opposed to a military parade down Pennsylvania Avenue, concerned that a parade like what Trump wanted would harken back to Soviet Union-like displays of authoriatrian power.\" Mattis was concerned too about such a show eroding the military's reputation for being apolitical, but he \"deflected and played for more time by saying, 'We'll take a look at some options and get back to you, Mr. President.'\"\n\nAs Trump \"veered from topic to topic like a squirrel caught in traffic, dashing one way and then another,\" Mattis, according to Snodgrass, \"began to shut down, sitting back in his chair with a distant, defeated look on his face.\"\n\nSnodgrass' eavesdropping of the briefing from the Tank's control room was interrupted, he says, by a Secret Service agent who poked his head in, \"apparently uncomfortable with the conversation and the light it cast on the president.\" The agent, apparently detailed to Trump, asked Snodgrass and a military officer on Tillerson's team who was with him if they still needed to be in that room. \"Yes, yes we did. Just try to get us to leave,\" the book's author states, though not as a quote — it appears to be more simply a thought that went through his head than his actual reply to an official who was quite likely being overzealous in protecting Trump.\n\nIn another chapter titled \"Policy by Tweet,\" Snodgrass describes Trump tweeting, without notifying the Pentagon, that \"after consulting with my Generals and military experts,\" he was banning transgender persons from serving in the military. A month earlier, Mattis had ordered a six-month study of the issue, in order to delay any action on the Obama-era initiative of allowing transgender people to serve openly in the military. Mattis was back in his Richland, Wash., hometown when Trump blindsided the Pentagon with his August 2017 transgender ban tweet; upon returning, Snodgrass writes, the defense secretary portrayed the Trump administration as doing a number on itself. \"He formed his right hand into a make-believe pistol and pointed it towards his temple, saying 'No one move or the hostage gets it!'\"\n\nBy the time Trump had his second Pentagon briefing in Jan. 2018, he had already agreed to sending an additional 5,000 U.S. troops to Afghanistan. While that key decision and Mattis' successful push for it oddly are unmentioned in the book, Snodgrass does describe a belligerant, scowling Trump when the nation's longest-ever war comes up at the briefing. \"Seriously, who gives a shit about Afghanistan?\" Trump asks. \"We should follow China's policy — just go into Afghanistan and take out all that wealth.\"\n\nWhat was perhaps Mattis' most public act of defiance toward Trump is described at an Oct. 2017 Senate hearing on the Iran nuclear deal, a legacy of the Obama administration. The Pentagon chief, asked if remaining in the deal was in the national security interest, paused a few dramatic seconds before replying, \"Yes, senator, I do.\"\n\nIt was an open break with Trump's vow to dump the deal. \"Mattis had confided to me before the hearing that he worried about leaving the agreement under false pretenses,\" Snodgrass writes, adding \"When America gives her word, she should keep it.\"\n\nThrough much of the book, Snodgrass portrays Mattis as a calming influence in a chaotic administration, a \"secretary of reassurance\" who kept an \"immaculately clean\" desk that once belonged to Gens. John \"Black Jack\" Pershing and George C. Marshall. Like Marshall, Mattis needed a congressional waiver to serve as defense secretary since he had completed only three of a required minimum of seven years of having been retired from active duty in the military.\n\nSnodgrass was himself an active duty commander in the Navy when he became Mattis' speechwriter in March 2017. Many others in the defense secretary's office had similar backgrounds. \"Most of us were white, male, and military,\" Snodgrass notes. \"We were built primarily for speed and our ability to keep up with Mattis' furious pace. But that didn't make it the right choice.\"\n\nGroup-think was a peril with such a homogeneous crew. \"A greater civilian presence with a more diverse experience base would have increased our corporate knowledge,\" Snodgrass writes, \"and softened the civilian-military relationship concerns that plagued senior leaders in the Pentagon.\"\n\nOne of those concerns was how Mattis' Pentagon dealt with the reporters who covered the agency. A case in point, Snodgrass says, was top Pentagon spokeswoman Dana White, whom \"members of the press loathed\".\n\n\"White had pulled me aside early on during my tenure with Mattis,\" Snodgrass writes. \"'Never forget, Bus. The press is the enemy. They are not your friend,'\" he quotes her warning him. Mattis appeared to share White's disdain for the fourth estate. Snodgrass writes of \"a culture of fear that trickled down from the secretary into each of the services,\" with Mattis making clear to his top officials that \"no senior defense official ever speaks off the record.\" In other words, nobody was to talk to reporters on background, which is the not-for-direct-attribution arrangement by which those of us who've covered the Pentagon learn what's really going on there.\n\nDespite Mattis' testy relationship with reporters, Snodgrass contends they largely gave him a pass when matters arose that might cut his tenure short at the Pentagon. A case in point was Mattis having remained on the board of directors of the fraudulent blood testing firm Theranos until shortly before being sworn in as defense secretary. His head of security at the Pentagon was Jim Rivera, who had previously been the head of security at Theranos. \"It was a nightmare scenario,\" Snodgrass writes, \"a made-for-television scandal involving a retired Marine and current secretary of defense.\" Still, it never became a big story.\n\nSnodgrass thinks he knows why. \"No one wanted to risk taking down Mattis,\" he concludes about the scant coverage of Mattis' ties to Theranos. Curious why Pentagon reporters did not press Mattis about an unflattering NBC report by Courtney Kube that described Mattis being shut out by the Trump White House, Snodgrass (who calls Kube's article \"deadly accurate\") asks Wall Street Journal Pentagon reporter Gordon Lubold for an explanation.\n\n\"Look, at the end of the day we're all Americans,\" Snodgrass quotes Lubold as replying. \"If Mattis goes, who's left? There are things we wish were different [in their relationship with Mattis] but he's defending the nation in more ways than one. We all know that.\"\n\nLubold tells NPR he did discuss his colleagues' coverage of Mattis with Snodgrass, but dismisses the quote attributed to him as \"fiction.\" According to an e-mailed statement from a Dow Jones/Wall Street Journal spokesperson, \"The comments attributed to Gordon Lubold are grossly mischaracterized. They do not reflect the scope, context or tenor of an off-the-record conversation with Mr. Snodgrass.\"\n\nThat's the rub with a tell-all exposé like the one Snodgrass has authored: The accuracy and veracity of many of his quotes are difficult, if not impossible, to check. Snodgrass names, for example, the Rex Tillerson aide who was in the control room at the Pentagon with him for Trump's first briefing there as Lt. Col. Brian Griese of the U.S. Army. An extensive online search for this military officer who could possibly confirm Snodgrass' account found no such person. At the Pentagon, a search by the U.S. Army's public affairs office also failed to find any Brian Griese in the Army's personnel records.\n\nThe book is also not without errors. Snodgrass portrays Mattis as having \"zinged the press in July 2017 by granting his first exclusive interview to a high school student named Teddy Fischer.\" That was two months after Mattis sat down for an exclusive interview with CBS News' John Dickerson.\n\nIn a chapter about rolling out the public version of the National Defense Review, Snodgrass describes Mattis wanting \"a central location where it would be easier to ensure a positive outcome.\" He says Howard University, a historically black university that's 2.3 miles from the Capitol, was \"deemed too distant from Capitol Hill to attract Congressional staffers.\" Instead, \"we finally settled on Johns Hopkins,\" which is a few blocks farther from the Capitol than Howard University. It's also not Johns Hopkins University, which is in Baltimore, but rather a division of that institution universally known as the School for Advanced International Studies, or SAIS.\n\nSnodgrass was no longer working for Mattis when the defense secretary handed his resignation to Trump in December 2018. Still, the former speechwriter says Mattis' departure was not a spur-of-the-moment decision. \"Mattis had already decided to resign the previous summer,\" Snodgrass writes. He says he stumbled across an unscheduled meeting Mattis was having with Trump's then-chief of staff, John Kelly, and was told by Mattis' scheduler that the two men were discussing when they'd be quitting. \"The boss is planning to leave this winter,\" he quotes the unnamed staffer as saying, \"but Kelly is going to stay on at the White House.\"\n\nMattis' waning days at the helm of the Pentagon disappointed Snodgrass, who was by then watching him from the outside. \"What bothered me during these final few months were Mattis' public statements in support of policies that I knew he personally loathed,\" he writes. \"Near the top of the list was the deployment of US troops to the southern border with Mexico in the fall of 2018.\"\n\nIn one of those public statements, Mattis responded to criticism of the border deployments saying the U.S. military \"doesn't do stunts.\" Snodgrass claims to have known better, having heard Mattis discuss previous deployments. \"I knew that's exactly what he thought the situation was — a political stunt.\"\n\nIn doing this book, Snodgrass appears to have burned his bridges with Mattis. \"Nothing, absolutely nothing, made the boss angrier than leaks to the press,\" he writes of Mattis while the two were still a team.\n\nAnd while Mattis may be blowing a gasket over this geyser of a leak, he might also appreciate how the man once in charge of putting words in his mouth has — for the most part — painted a flattering verbal picture of him: a military man turned civilian, holding the line when he could.", "description": "Holding the Line is the tell-all many wished Mattis' own Call Sign Chaos had been. But for all of Guy Snodgrass' in-the-room accounts, there are some unverifiable elements and inaccuracies.", "authors": ["David Welna"], "top_image": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400", "published_at": "2019-10-22"}