{"pub": "townhall", "url": "https://redstate.com/nick-arama/2019/10/13/greg-gutfeld-and-tom-shillue-do-a-masterful-roast-of-adam-schiff", "downloaded_at": "2019-10-14 11:46:57.426707+00:00", "title": "Greg Gutfeld and Tom Shillue Do a Masterful Roast of Adam Schiff", "language": "en", "text": "Saturday Night Live used to be funny. But it’s been hit or miss for a long time, with more miss than hit.\n\nThey could take a lesson from Greg Gutfeld and Tom Shillue.\n\nIt’s too common to parody President Donald Trump.\n\nWhat you really need is a parody of the man who thinks he can conduct an impeachment without a vote on an inquiry, who thinks he can hold hearings in secret and the American people wouldn’t question it.\n\nYou need a parody of Rep. Adam Schiff (D-CA).\n\nNow some might say that Schiff himself is a parody of a congress person. And while there is something to be said for that, certainly, perhaps it’s good to have one that amuses us rather than one which infuriates us.\n\nShillue delivered a masterful impersonation of Schiff, right down to the eyes.\n\nIf you need a laugh, here you go.\n\nHey @nbcsnl, want to at least pretend to be non-partisan? How about hiring @tomshillue to give his spot-on impersonation of @AdamSchiff? Just amazing … and also horrifying … @GregGutfeldShow pic.twitter.com/oU7WuxgUI6 — Scott Morefield (@SKMorefield) October 13, 2019\n\nYikes, that’s pretty much straight on. Hilariously funny and downright creepy at the same time.\n\nAlthough next time, Shillue should practice how to parody leaking out of committee meetings to media.\n\nGutfeld is right amidst the humor.\n\nIf Schiff really thinks he can take down a president and change election results because they lost, he’s going to find some very unhappy Americans giving him a very different message come November 2020.\n\nAnd that’s no joke.", "description": "Greg Gutfeld and Tom Shillue Do a Masterful Roast of Adam Schiff", "authors": ["Nick Arama", "Joe Cunningham", "Alex Parker", "Posted At Pm On October"], "top_image": "https://www.redstate.com/wp-content/uploads/2019/10/Screen-Shot-2019-10-13-at-9.06.59-PM.png", "published_at": "2019-10-13"}