{"pub": "cbc", "url": "https://cbc.ca/music/leonard-cohen-kim-harris-tobi-and-more-songs-you-need-to-hear-this-week-1.5339561", "downloaded_at": "2019-10-30 14:18:53.392685+00:00", "title": "Leonard Cohen, Kim Harris, TOBi and more: songs you need to hear this week | CBC Music", "language": "en", "text": "Here at CBC Music, we're always on high alert for new songs by Canadian artists.\n\nThis week, we're listening to new tracks from Kim Harris, TOBi and DillanPonders featuring IDK, as well as a new posthumous track from Leonard Cohen. Scroll down to find out why you need to listen, too.\n\nWhat new Canadian tunes are you currently obsessed with? Share them with us on Twitter @CBCMusic.\n\n'Happens to the Heart,' Leonard Cohen\n\nAlmost three years after Leonard Cohen's death, the Montreal legend's weighty voice is still permeating music, both in the artists he inspired in his lifetime and now in his first posthumous release. \"Happens to the Heart\" is the second single from the upcoming album, Thanks for the Dance. Framing Cohen's slow, measured cadence with simple flamenco guitar riffs and sparse piano, the track is built around the songwriter's powerful words like its opening refrain: \"I was always working steady/ but I never called it art.\"\n\nThe accompanying video, directed by Daniel Askill, takes inspiration from Cohen's five-year experience as a Buddhist monk. In a statement , Askill said, \"This film is a quiet, symbolic narrative that charts the letting go of ego and the trappings of fame.\" Cohen's son, Adam, helmed the new album, adding in a statement , \"In composing and arranging the music for his words, we chose characteristic musical signatures, in this way keeping him with us.\" On \"Happens to the Heart,\" Cohen is as present as ever. Longtime fans won't be disappointed.\n\n— Melody Lau\n\n'Once You Were Wondrous,' Kim Harris\n\nKim Harris has always had a knack for vividly connecting us to nature through her lyrics — 2014's \" In the Woods \" and \" The Weight of it All ,\" plus 2019's \"Heirloom\" come to mind — but there's something much more intentional in the songwriter's new video when she transitions from Halifax's Centennial Pool to the much wilder winds and sands of a Nova Scotia beach. The assertive opening rhythm of her four-bar piano bed drops off before Harris launches into the chorus with a resounding \"Wake up!\" as she walks to the tide line, soon to be surrounded by friends. All glitter and florals, waves and rocks, everything connected by a call for self-assertion — it's one hell of a mood board for 2019.\n\n\"I wanted to make a video, where I could 'glow without apologizing,' with other women like me, as extensions of myself,\" explains Harris via email. \"I wanted to be swimming, I wanted to be in formations together on a beach, mystic and ethereal. In the planning stages, as I spoke with people about the treatment for this video, the first reaction was always an immediate, 'How brave of you!' All well-meaning, some would follow by interrogating their initial reaction, or try to soften it. It is rare to see big bodies presented as objects of beauty. It is political to put my fat queer body in a gold bathing suit for the public. But does it have to be?\n\n\"We live in a world that both hates and fears fat bodies. Living in one as an artist, it's impossible to separate my life from my work. Along with a team of queer filmmakers, I made the video for 'Once You Were Wondrous' as an offering of the beauty and splendour of bodies like mine, in celebration, because I needed to.\"\n\n— Holly Gordon\n\n'Beige,' TOBi, Harrison\n\nThere's a theme emerging in the music of soul/hip-hop artist TOBi: a preoccupation with comparing the past and present, the before and after. \"I'm good at movin' on, good at lookin' strong,\" he asserted on \"Growth\" from his debut full-length, Still — an instance of what he calls \"post-traumatic growth.\"\n\nNow, on his first collaboration with Harrison, TOBi is at it again, trying to get both the past and present of a relationship to align. \"If your heart is where my home at/ baby girl, I'm a nomad cuz you keep on moving ways,\" he despairs. Beige, an in-between colour, represents this frustrating liminal state, with electric piano and a drowsy beat creating the perfect bed for TOBi's fluently sung verses.\n\n— Robert Rowat\n\n'Jurassic,' DillanPonders feat. IDK\n\nRemember the raptors' ferocity in the 1993 movie Jurassic Park? That's the same energy DillanPonders and IDK bring to their latest track, \"Jurassic,\" as they tear apart the beat like ravenous dinosaurs. Over bouncing bells and banging 808s, DillanPonders' grizzled voice and IDK's raucous flows unite on this dynamic assault of a song. DillanPonders' honesty about addiction, violence and homelessness — and his commitment to his fans — has built a dedicated community around him. It is fitting that he has teamed up with Maryland rapper IDK, whose approach mirrors his own. Together, the two bring that honesty to \"Jurassic,\" questioning their competition and challenging how we perceive ourselves.\n\n— Natasha Ramoutar", "description": "4 fresh tracks to add to your playlist.", "authors": [], "top_image": "https://i.cbc.ca/1.5339838.1572374828!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/kim-harris.jpg", "published_at": "2019-10-30"}