{"pub": "mirror", "url": "https://mirror.co.uk/news/us-news/donald-trump-humiliated-world-series-20740651", "downloaded_at": "2019-10-28 09:51:06.056851+00:00", "title": "Donald Trump humiliated at World Series as stadium loudly chants 'lock him up'", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nDonald Trump was jeered by unhappy baseball fans as they chanted 'lock him up' as the President appeared on the big screen.\n\nThe boos rung out from a section of the stadium as he watched game five of the World Series in Washington.\n\nTrump appeared on a display screen at the Washington Nationals Park between innings of the Game 5 match-up between the Washington Nationals and the Houston Astros.\n\nThe president, along with First Lady Melania Trump and several lawmakers, appeared live as part of a video package thanking US troops for their service.\n\nHe was there celebrating one of the biggest wins of his tenure just hours earlier - confirming the death of ISIS mastermind Abu Bakr al-Baghdad .\n\n(Image: Avalon.red)\n\n(Image: CNP/startraksphoto.com)\n\nTrump say the terrorist had been \"obliterated\" and spent his final moments in \"utter fear, total panic and dread\".\n\nBut it didn't seem to sway thousands of baseball fans as the hometown crowd cheered fans and soldiers displayed earlier on the screen.\n\nThere were boos and isolated chants when Trump appeared as the videos went around the world.\n\nTrump was taking some time out after overseeing the \"dangerous and daring\" raid by US special forces overnight in Syria that saw personnel dodge booby traps and accomplish the mission \"in grand style\".\n\nHe announced the \"brutal killer's\" death at a press conference held at The White House.\n\nHe said \"running and crying coward\" Baghdadi detonated a suicide vest, killing himself and three innocent children who he had dragged into a tunnel.\n\n(Image: Getty Images)\n\nTrump added that the thug's body had been \"mutilated\" by the blast, but test results from the aftermath of the raid had positively identified him.\n\n\"Abu Bakr al-Baghdadi is dead,\" said the gleeful president.\n\n\"He died like a dog, he died like a coward. The world is now a much safer place.\n\n\"He was a sick and depraved man and now he's gone.\"", "description": "The baseball fans turned on the US President, 73, just hours after one of the biggest triumphs of his administration", "authors": ["Sam Elliott", "Image", "Avalon.Red", "Cnp Startraksphoto.Com", "Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20740667.ece/ALTERNATES/s1200/0_President-Donald-Trump-and-Congressional-GOP-Members-Attend-Game-5-of-the-World-Series.jpg", "published_at": "2019-10-28"}