{"pub": "wsj", "url": "https://wsj.com/articles/walmart-to-stop-selling-all-e-cigarettes-11569003925?mod=rsswn", "downloaded_at": "2019-09-20 22:45:18.313365+00:00", "title": "Walmart to Stop Selling All E-Cigarettes", "language": "en", "text": "Walmart Inc. WMT -0.11% will stop selling all e-cigarettes in its U.S. stores, citing regulatory uncertainty around the vaping devices after the White House announced plans to ban most flavors.\n\nThe world’s biggest retailer said it would stop carrying the devices after it winds down its current inventory of e-cigarettes. It carries a variety of e-cigarette brands, including market leader Juul.\n\n“Given the growing federal, state and local regulatory complexity and uncertainty regarding e-cigarettes, we plan to discontinue the sale of electronic nicotine delivery products at all Walmart and Sam’s Club U.S. locations,” a Walmart spokeswoman said.\n\nIn May Walmart said it would raise the minimum age to purchase tobacco products to 21 in all stores and would stop selling fruit-flavored e-cigarettes, amid pressure from regulators to curb use by children and teens. Walmart’s decision to halt all sales was earlier reported by CNBC.\n\nPresident Trump announced plans last week to ban all flavored e-cigarettes, including mint and menthol, citing a surge in underage vaping. The move poses a major threat to a fast-growing market dominated by Juul Labs Inc.\n\nAt the same time, health officials are investigating hundreds of lung ailments linked to vaping in recent weeks. They haven’t identified the precise cause, but most of the patients have reported vaping marijuana products. Others say they have only vaped nicotine products.\n\nSo far, the Centers for Disease Control and Prevention has identified 530 confirmed or probable cases of vaping-associated pulmonary illnesses. There have been eight deaths.\n\nRelated Video Altria, the maker of Marlboro cigarettes, recently invested almost $13 billion in e-cigarette company Juul. Some experts say in its early days Juul mirrored the tobacco industry’s promotional playbook in an effort to hook young people. Photo: Natalia V. Osipova/The Wall Street Journal\n\nWrite to Sarah Nassauer at sarah.nassauer@wsj.com\n\nCorrections & Amplifications\n\nWalmart Inc. doesn’t sell Njoy brand e-cigarettes. An earlier version of this article incorrectly stated that the retailer sells the brand.", "description": "Walmart will stop selling all e-cigarettes in its U.S. stores, citing regulatory uncertainty around the vaping devices after the White House announced plans to ban most flavors.", "authors": ["Sarah Nassauer", "Sarah.Nassauer Wsj.Com"], "top_image": "https://images.wsj.net/im-109349/social", "published_at": "2019-09-20"}