{"pub": "businessinsider", "url": "https://businessinsider.co.za/jobs-available-in-south-africa-adzuna-apply-cities-with-most-jobs-provinces-with-most-jobs-gauteng-johannesburg-cape-town-durban-2019-10", "downloaded_at": "2019-10-04 07:41:51.728871+00:00", "title": "These are the cities and sectors in South Africa with the most jobs", "language": "en", "text": "Online job aggregator Adzuna created a list of the cities with the most jobs available in SA.\n\nJohannesburg had the most jobs going, followed by Cape Town, and Tshwane.\n\nMost jobs were offered for people in the IT sector in Cape Town, Johannesburg, and Tshwane.\n\nFor more go to Business Insider.\n\nJohannesburg has more jobs on offer than Cape Town and Tshwane combined, a new survey by online job aggregator Adzuna has found.\n\nAdzuna ranked the top ten cities with the most jobs on offer by combing through the more than 140,000 job postings on its platform.\n\nIt also looked at the industries in which jobs were offered to find the industries offering the most jobs.\n\nThe South African provinces with the most jobs on offer, according to Adzuna, were:\n\nGauteng: 21,118 Western Cape: 14,956 KwaZulu-Natal: 6,967 Eastern Cape: 2,924 Mpumalanga: 1,417 Free State: 739 Limpopo: 724 North West: 605 Northern Cape: 479\n\nSouth African cities with the most jobs on offer, according to Adzuna.\n\nJohannesburg: 16,608 Cape Town: 12,062 Tshwane: 4,669 Durban: 4,198 East Rand: 2,442 Port Elizabeth: 1,323 Winelands: 976 East London: 710 Bloemfontein: 423 Pietermaritzburg: 373\n\nJesse Green, Adzuna South Africa’s country manager, said the most jobs in Johannesburg were offered in the IT, finance, and engineering sectors, with few jobs going in healthcare, retail, and human resources.\n\nJohannesburg makes up 39% of all IT and tech-related jobs on offer in South Africa, Green said.\n\nCape Town and Pretoria also had big appetites for IT professionals.\n\nIn Durban, people in engineering, accounting, and administration were most in demand, while in the East Rand people in finance, administration, and sales were most sought after.\n\n\n\nThere was little demand for people in logistics, customer service, and manufacturing anywhere in South Africa.\n\nReceive a daily email with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "Most jobs were offered for people in the IT sector in Cape Town, Johannesburg, and Tshwane.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9139/c639947c60eb494e83767b907ca84d98.png", "published_at": "2019-10-04"}