{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/trump-tweets-ordering-sanctions-iran-pompeo-heads-saudi/story?id=65689798", "downloaded_at": "2019-09-18 23:24:44.390912+00:00", "title": "Saudis say Iran 'sponsored' attack on oil facilities, Pompeo calls it an 'act of war'", "language": "en", "text": "The Saudi government on Wednesday publicly accused Iran of \"sponsoring\" the attack on its oil facilities over the weekend -- an accusation that will have serious consequences for a region already on edge, but that still stopped short of total blame.\n\nHamad I Mohammed/Reuters\n\nInterested in Iran? Add Iran as an interest to stay up to date on the latest Iran news, video, and analysis from ABC News. Add Interest\n\nThe Saudi charge comes days after the U.S. already accused Iran of responsibility. Secretary of State Mike Pompeo arrived in Saudi Arabia Wednesday, blasting Iran for \"an act of war\" and saying the attacks had the \"fingerprints of the Ayatollah,\" Iran's Supreme Leader Ayatollah Ali Khamenei.\n\nWeighing how to respond, President Donald Trump said Wednesday that he ordered \"substantially\" increased sanctions on Tehran, already struggling under a near total oil embargo and intense U.S. economic pressure.\n\nAmr Nabil/AP\n\nDuring a news conference in Riyadh on Wednesday, the Saudi defense ministry showed what they said was surveillance footage of the missiles traveling south from Iran and displayed remnants of some of the Iranian drones it said were used in the attack. Iran has denied responsibility for the attack, which was claimed by Houthi rebels in Saudi Arabia's southern neighbor Yemen, where a Saudi-led coalition has been fighting for over four years.\n\nAmr Nabil/AP\n\nHamad I Mohammed/Reuters\n\nAfter the large-scale attack against the two oil facilities, Trump tweeted Sunday that the U.S. was \"locked and loaded,\" but waiting for the Saudis to verify Iran's culpability and provide guidance on \"under what terms we would proceed!\"\n\nIn the briefing, Saudi military spokesperson Col. Turki al Malki stopped short of accusing Iran of launching the missiles and drones from its territory -- as U.S. officials have done -- but said, \"The attack was launched from the north and was unquestionably sponsored by Iran ... This is the kind of weapon the Iranian regime and the Iranian IRGC are using against the civilian object and facilities infrastructure.\"\n\nThe main oil processing facility at Abqaiq was hit by 18 drones, according to al Malki, and the oil field at Khurais was hit by four land-based cruise missiles, with three more falling short. There were at total of 25 drones, although it's unclear what happened to the other ones.\n\n\"When we determine the launch point, it will be announced,\" al Malki said, adding analysis of the recovered drones was ongoing.\n\nA team of U.S. military forensics specialists, along with U.N. investigators, are on the ground helping with that process and other evidence-gathering, Gen. Joseph Dunford, the chairman of the Joint Chiefs of Staff, said Tuesday. The U.S. is compiling \"compelling forensic evidence\" from the debris of the cruise missiles and drones, a U.S. official told ABC News Tuesday, which will help \"provide a compelling case of where they came from.\"\n\nAlexander Drago/Reuters\n\nBeyond the forensic evidence, Pompeo told reporters traveling with him there is strong circumstantial evidence, including that the weapons used haven't been deployed by Iran out of its borders. He added that the intelligence community has \"high confidence\" the weapons were not in the Houthis' arsenal, calling the group the \"well-known, frequently lying Houthis.\"\n\nThe U.S. was \"blessed there were no Americans killed in this attack, but any time you have an act of war of this nature, there's always risk that could happen,\" he added.\n\nIn Jeddah meeting Saudi Crown Prince Mohammed bin Salman before later traveling to the United Arab Emirates, Pompeo said he is \"working to build out a coalition to develop a plan to deter\" Iran and put \"infrastructures and resources... in place such that attacks like this would be less successful.\"\n\nCritical to that deterrence, Pompeo said, would be intense economic pressure, and Trump tweeted Wednesday that he was ordering Treasury Secretary Steven Mnuchin to increase sanctions in response to the attack.\n\n\"I have just instructed the Secretary of the Treasury to substantially increase Sanctions on the country of Iran!\" he tweeted while traveling in California.\n\nI have just instructed the Secretary of the Treasury to substantially increase Sanctions on the country of Iran! — Donald J. Trump (@realDonaldTrump) September 18, 2019\n\nSaul Loeb/AFP/Getty Images, FILE\n\nIran is already struggling under intense U.S. sanctions that have targeted its top leaders and key industries, especially oil, metallurgy, and its financial sector. In August, the U.S. placed sanctions on Iranian Foreign Minister Javad Zarif, which Iran called \"childish.\"\n\nIn June, Trump announced what he called \"hard hitting\" sanctions on Iran, including on Supreme Leader Ayatollah Ali Khamenei.\n\nThat came just weeks after Trump authorized new sanctions on Iranian iron, steel, aluminum, and copper sectors, which the White House said comprise 10 percent of Iran's export economy on the one-year anniversary of Trump withdrawing from the Iran nuclear accord. Iran also marked the anniversary by beginning its own slow, but steady withdrawal from the deal, first expanding its enriched uranium stockpile, then enriching uranium at higher levels, and most recently, installing advanced centrifuges that could expand their enrichment capacity.\n\nTensions have risen throughout the Middle East since Trump's withdrawal, with Iran trying to increase the pressure on the U.S. and others in response to the American economic sanctions campaign. After the U.S. ended all waivers for its oil sanctions, forcing countries to stop purchasing Iranian crude, Iranian forces attacked commercial tankers in the Persian Gulf and seized a handful of ships and their crews.\n\nThe skirmishes, tensions, and intense rhetoric have raised fears of a clash that leads to a wider war. In June, Iran shot down an American drone, prompting Trump to order a military response before canceling it.", "description": "President Donald Trump on Wednesday said he was ordering his Treasury secretary to increase sanctions on Iran following the attack on Saudi Arabian oil facilities.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/trump-june-2019-south-lawn-gty-jc-190916_hpMain_2_16x9_992.jpg", "published_at": "2019-09-18"}