{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7606755/Strong-borders-save-lives-argues-MARK-ALMOND.html", "downloaded_at": "2019-10-24 02:36:30.278849+00:00", "title": "Strong borders save lives, argues MARK ALMOND", "language": "en", "text": "What was discovered in Essex yesterday is so horrible it seems almost beyond comprehension.\n\nYet the deaths of the 39 migrants who came here to Britain for a better life only to perish in a refrigerated container, drives home with gruesome reality the desperation of those trying to reach our shores.\n\nTragically, this calamity is far from unique — indeed, something like it was inevitable given Britain’s and other European countries’ lackadaisical attitude to the relentless and tragic flow of migrants to Western shores.\n\nhe deaths of the 39 migrants who came here to Britain for a better life only to perish in a refrigerated container, drives home with gruesome reality the desperation of those trying to reach our shores\n\nEvery time migrants perish in this way or die in equally upsetting circumstances, we throw our hands up in horror. Every time we promise to do something about it — and then it happens again.\n\nBack in 2000, 58 people were found dead at Dover in an airtight lorry container that had come from Zeebrugge in Belgium, just as yesterday’s mobile charnel house had done. The politicians promised a major crackdown.\n\nIn 2014, trafficking victims were found crammed inside a shipping container at Tilbury Dock on the Thames — again from Zeebrugge.\n\nOne man was dead but 34 others, including at least seven children, survived. These were the lucky ones — dock workers had heard them screaming and banging on the side of the container.\n\nIt is not just Britain’s problem either — continental Europe has witnessed its own horrors. In 2015, 71 men, women and children were discovered dead in Austria in an abandoned truck which had come from Serbia. One of the victims, Lida Rahm, was less than a year old.\n\nThe people-smuggling trade is callous, uncaring and conducted with subterfuge. How many other deaths have taken place unnoticed over the years?\n\nAnd these are just the deaths we hear about. The people-smuggling trade is callous, uncaring and conducted with subterfuge. How many other deaths have taken place unnoticed over the years?\n\nEvery time there is a grisly body count, there is that equally gruesome ritual when politicians and pundits line up to express grief and promise to stop it ever recurring.\n\nThen, after a decent interval, the costs and complexity of doing anything to stop the trade in human cargo mean that a few cosmetic measures are adopted, but things go on much as before. What is so depressing in this Essex case is the feeling it could have been avoided. Only in May this year, the National Crime Agency (NCA) warned that because security had been stepped up in French ports such as Calais, migrants and smuggling gangs had turned their attention to Belgian ports.\n\nAnd in 2016 the annual threat assessment published by the Border Force identified Zeebrugge as a key port of embarkation for clandestine arrivals. The NCA also warned in 2016 that people smugglers were trying to bring migrants into the UK at ‘less busy’ ports including Purfleet in Essex — where the container in which the 39 migrants died came in to Britain.\n\nOf course, there is no simple solution to the problem of mass migration from the war-torn Middle East and Africa to Europe. These people, desperate to escape violence and poverty at home, are determined to get to the bright lights of our affluent societies in the West, which is to them a passport to security and well-being.\n\nWhat’s more, the migrants are prepared to risk everything because, in the majority of cases, their journeys are successful, and if they land in Europe, they get to stay.\n\nIt’s true that thousands die every year crossing the Mediterranean from North Africa. But the fact is that migrants think the gamble is worth it — for every life lost in crossing the Med in 2016, for example, there were 50 successful landings\n\nIt’s true that thousands die every year crossing the Mediterranean from North Africa. But the fact is that migrants think the gamble is worth it — for every life lost in crossing the Med in 2016, for example, there were 50 successful landings: a death rate of just 2 per cent. The Britons and Irish who emigrated to America in search of a better life faced far higher chances of dying yet risked the passage. So why wouldn’t today’s migrants to Europe from Africa take the same risk?\n\nThe idea of setting out in a small boat for 21 miles across the world’s busiest shipping lane, from Calais to the Kent coast, seems madness to most of us. But nearly 1,500 have managed it this year — including, as the Mail’s Sue Reid reported, two shivering migrants from Iran in a blow-up kayak that had cost them £220, baling out the vessel with their hands as it threatened to sink in a cold August storm.\n\nThe tenacity of the migrants will not evaporate with the platitudes of politicians. The smugglers who cram their human cargo on unseaworthy boats and in airtight containers will not give up their profits because of our expressions of horror.\n\nNor will the geopolitical pressure behind mass migration vanish overnight. The destruction of Colonel Gaddafi’s Libya in 2011 paved the way for the re-opening of the old slave-trade routes across the Sahara to the Mediterranean coast.\n\nBecause of the anarchy in the country, millions of migrants are now travelling north along them hoping to get to the West, with the help of modern-day slave traders who charge up to £10,000 a passage.\n\nBut nations across Europe, including Britain, have been woefully negligent over the problem of mass migration and its brutal consequences\n\nTurkey’s President Erdogan has the West over a barrel on migration. Turkey has 3.6 million Syrian refugees and Erdogan is threatening to open the floodgates because of Western criticism of his aggressive policies in north-eastern Syria.\n\nLetting a second human tsunami into the EU in this way would recreate the political chaos unleashed in Germany and its neighbours in 2015 when Angela Merkel welcomed one million refugees into the country.\n\nGiven this migrationary pressure, governments — not least in Britain — need to think hard and fast about the issues raised by the Essex horror. Because unless something is done, it won’t be the last. Hollow promises and business as usual won’t wash any more.\n\nOf course, there are huge problems in getting to the bottom of smuggling rings which operate across two or three continents and in a host of different legal systems. Politicians in some poorer EU countries have an interest in the racket which makes all-European solutions which work difficult to implement.\n\nBut nations across Europe, including Britain, have been woefully negligent over the problem of mass migration and its brutal consequences.\n\nOf course, there must be cooperation with other countries. But Westminster’s most pressing task must be to concentrate on beefing up border security — which, as that NCA report showed, was hopelessly porous back in 2016.\n\nWe need huge investment in patrol boats both to deter illegal migrants, but also to pick up those foolhardy enough to try to cross the Channel in inflatable dinghies. We need considerably higher border manpower, as well as more and better equipment to detect stowaways crammed into trucks. High-tech kit such as thermal imaging devices should be available at all ports — major and minor — 24/7.\n\nThe horror expressed by politicians yesterday is no doubt genuine. Everyone shares it. But action speaks louder than words.\n\nCooperation with our European neighbours would be best. But if it is not possible, then surely our island can get its own borders in order if it really wants to stop this criminal traffic in lives.\n\nWhen indignation cools it should not turn into indifference, but instead into determination to eradicate once and for all the incentive for migrants to undertake their deadly journeys.\n\nMark Almond is director of the Crisis Research Institute, Oxford.", "description": "Something like it was inevitable given Britain's and other European countries' lackadaisical attitude to the relentless and tragic flow of migrants to Western shores, writes MARK ALMOND.", "authors": ["Mark Almond For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/22/20104096-0-image-a-17_1571866309047.jpg", "published_at": "2019-10-23"}