{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/breaking-harry-styles-stalker-swerves-20664508", "downloaded_at": "2019-10-21 11:28:55.028268+00:00", "title": "Harry Styles' stalker swerves jail after leaving singer scared in his own home", "language": "en", "text": "Get the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nHarry Styles' homeless stalker has swerved jail after being found guilty of stalking the One Direction singer after posting cash and notes through his letterbox.\n\nPablo Tarazaga-Orero, 26, has been handed a restraining order banning him from going to Harry's postcode, going within 250 metres from him, and attending any of his gigs.\n\nIf he breaks the strict conditions of the order, he could face jail.\n\n\"Failing to apply with a restraining order is a criminal offence and that offence carries a maximum five-year prison sentence,\" said District Judge Nigel Deane told him in sentencing.\n\n\"Firstly I am making a restraining order in any case it's going to be for an indefinite period and will include the following prohibit you from entering the following area highlighted in red.\n\n\"It centres on the home address of Harry Styles and some of the adjacent lanes to keep you well away from his address.\n\n\"You're not to contact directly or indirectly Harry Styles including posting any messages on any social media platforms.\"\n\nTarazaga-Orero has been told he must also complete a 12-month community order.\n\n(Image: Paul Davey/SWNS)\n\nHarry had been asked what outcome he would like at last week's trial.\n\n\"I would like him to get some help,\" the singer said of Tarazaga-Orero.\n\n\"I would also prefer to have no contact going forward with him, directly or indirectly. I would like to feel safe again.\"\n\nTarazaga-Orero has not worked since arriving in the UK except helping at the hostel where he stays in central London.\n\nHe was sentenced to a 12-month community order requiring 30 days of rehabilitation activity, and ordered to pay £335 in total including £250 costs.\n\nAt his trial, Tarazaga-Orero had denied one count of stalking between April and June this year, claiming Harry had offered him money to \"have some fun\" in a hotel, which the singer denied.\n\nBut the Spanish national was found guilty at Hendon Magistrates' Court.\n\nHarry had taken pity on the homeless man after seeing him sleeping rough at the bus station by his London home.\n\n(Image: Getty Images)\n\nHe offered to buy Tarazaga-Orero food or a hotel room, but the man told him he only ate vegan food and asked for edamame beans.\n\nDistrict Judge Nigel Deane heard how the next day, Harry bought the man two sandwiches, two salads and two muffins from a vegan cafe, but decided to stop interacting with Tarazaga-Orero following an \"odd\" incident.\n\n\"He asked me if I wanted to go to a restaurant to eat,\" Harry recalled at the trial.\n\n\"I told him I was on my way to work. I found it a little odd. His facial expression made me feel a little uneasy. It was like a smirk.\n\n(Image: Paul Davey/SWNS)\n\n\"Until that point, I never felt unsafe or uneasy in my own home.\"\n\nTwo months later, Harry said his stalker had \"lunged\" at him and \"blocked his path\" as he went running.\n\nTarazaga-Orero demanded money and continued staring after Harry as he ran off.\n\n\"I never really encountered this kind of behaviour before,\" he went on.\n\n(Image: PA)\n\n\"I've employed a night guard. I continue to lock my bedroom door at night.\"\n\nHe also said he continues to check for \"weak spots\" in his home.", "description": "Pablo Tarazaga-Orero stalked Harry Styles by posting money and notes through his letterbox, prompting the singer to install a lock on his bedroom door", "authors": ["Emmeline Saunders", "Image", "Paul Davey Swns", "Getty Images", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20664438.ece/ALTERNATES/s1200/0_SWNS_PABLO_TARAZAGA-ORERO_005.jpg", "published_at": "2019-10-21"}