{"pub": "financialpost", "url": "https://business.financialpost.com/pmn/press-releases-pmn/business-wire-news-releases-pmn/mouser-electronics-and-grant-imahara-explore-prototype-design-with-arduino-in-latest-engineering-big-ideas-series-video", "downloaded_at": "2019-10-09 18:38:34.970525+00:00", "title": "Mouser Electronics and Grant Imahara Explore Prototype Design with Arduino in Latest \"Engineering Big Ideas\" Series Video", "language": "en", "text": "MILAN — Mouser Electronics Inc. and celebrity engineer Grant Imahara today released the second video in the Engineering Big Ideas series, part of Mouser’s award-winning Empowering Innovation Together™ program. Watch the latest video at https://mou.sr/EIT2019-2.\n\n.@grantimahara & @MouserElec visit @mbanzi to talk about the #OpenSource movement, #prototyping and more in the latest #EngineeringBigIdeas video.\n\nIn the second video of the Engineering Big Ideas series, Mouser and Imahara take viewers along to Milan, Italy, for a visit to Arduino®, one of the world’s leading open-source hardware and software ecosystems. Imahara sits down with Arduino co-founder and CTO Massimo Banzi to examine the prototyping tools designers and developers use to understand and articulate the capabilities and limits of an idea. The pair also explores how the open source movement contributes to broadening access to innovation. The Engineering Big Ideas series is sponsored by Mouser’s valued suppliers Analog Devices, Intel®, Microchip Technology and Molex.\n\n“We are excited about this second episode of Engineering Big Ideas. Prototype design is meant to create something completely new,” said Glenn Smith, President and CEO of Mouser Electronics. “Through open source hardware and software, companies like Arduino present significant opportunity to designers and developers by removing barriers and opening gates to innovation.”\n\n“Open source is a perfect example of innovation through collaboration and shared access to knowledge,” added Imahara. “Rapid prototyping is a natural fit for this environment; ideas can come to life quickly and cost-effectively.”\n\nGlobal electronic component distributor Mouser Electronics is teaming up with engineer Grant Imahara for the fifth consecutive year to present the Engineering Big Ideas series, which explores the process of turning an idea into a product and examines the path to commercialization — from discovery to design and eventually development.\n\nThe Empowering Innovation Together program has been one of the most recognized and notable electronic component educational programs since 2015, highlighting a range of innovative developments from IoT and smart cities of the future to robotics technologies.\n\nTo learn more about this and all of Mouser’s Empowering Innovation Together series, visit www.mouser.com/empowering-innovation and follow Mouser on Facebook and Twitter.\n\nAbout Mouser Electronics\n\nMouser Electronics, a Berkshire Hathaway company, is an award-winning, authorized semiconductor and electronic component distributor focused on rapid New Product Introductions from its manufacturing partners for electronic design engineers and buyers. The global distributor’s website, Mouser.com, is available in multiple languages and currencies and features more than 5 million products from over 750 manufacturers. Mouser offers 26 support locations around the world to provide best-in-class customer service and ships globally to over 630,000 customers in 223 countries/territories from its 750,000 sq. ft. state-of-the-art facility south of Dallas, Texas. For more information, visit www.mouser.com.\n\nAbout Grant Imahara\n\nWell known in the engineering community, Grant Imahara has paired his engineering expertise with a successful TV and film career. In addition to his roles on MythBusters and BattleBots, Imahara has worked on many famous robotic characters, including R2-D2 from Star Wars, the talking robot skeleton sidekick Geoff Peterson from The Late Late Show with Craig Ferguson, and the Energizer Bunny.\n\nTrademarks\n\nMouser and Mouser Electronics are registered trademarks of Mouser Electronics, Inc. Intel is a registered trademark of Intel Corporation in the United States and other countries. All other products, logos, and company names mentioned herein may be trademarks of their respective owners.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20191009005523/en/\n\nContacts\n\nFor further information, contact:\n\nKevin Hess, Mouser Electronics\n\nSenior Vice President of Marketing\n\n(817) 804-3833\n\nKevin.Hess@mouser.com\n\nFor press inquiries, contact:\n\nKelly DeGarmo, Mouser Electronics\n\nCorporate Communications & Media Relations Manager\n\n(817) 804-7764\n\nKelly.DeGarmo@mouser.com", "description": "MILAN — Mouser Electronics Inc. and celebrity engineer Grant Imahara today released the second video in the Engineering Big Ideas series, part of Mouser’s award-winning Empowering Innovation Together™ program. Watch the latest video at https://mou.sr/EIT2019-2. .", "authors": [], "top_image": "https://mms.businesswire.com/media/20191009005523/en/695594/3/m-mouserelectronics-horizontal-fullcolor-blue.jpg", "published_at": "2019-10-09"}