{"pub": "abcnews", "url": "https://abcnews.go.com/US/school-bus-driver-arrested-alleged-dui-child-calls/story?id=65750417", "downloaded_at": "2019-09-20 22:37:12.920061+00:00", "title": "School bus driver arrested on alleged DUI after child calls 911 to report her 'drunk'", "language": "en", "text": "A Washington state bus driver school bus driver has been charged with driving under the influence after a student got home and called 911 to report her.\n\nOn Sept. 12 around 3:58 p.m., officers were tasked with locating a driver suspected of being under the influence, Longview police said in a statement.\n\nA person had called 911 to report that a woman was driving a Longview School Bus District bus and \"appeared to be intoxicated,\" police said.\n\nIn the 911 call, a child tells the dispatcher that he's making the call instead of his mother because she does not speak English.\n\n\"Ummm, yea, hello. ... We just got off the bus -- me and my friend. And on bus 8 … the bus driver, Catherine, she was drunk,\" a child can be heard telling the 911 dispatcher in audio released to ABC News. \"She passed three red lights and she got on the side road by the 76. And there's still kids on there. And I was telling my friend to get off with me -- and his sister -- but the bus driver wouldn't let him.\"\n\nThe child tells the dispatcher that the bus driver was \"wobbling.\"\n\n\"Her eyes, you can tell, she was drunk,\" he says.\n\nPolice said the 911 call center reached the school district's transportation office and got the school bus driver to stop on Nichols Boulevard. The driver was identified as 48-year-old Catherine L. Maccarone by police.\n\n\"Officers smelled an obvious odor of intoxicants coming from Maccarone,\" the police statement said.\n\nSTOCK PHOTO/Getty Images\n\nMaccarone was arrested for allegedly driving under the influence. There were no children on the bus at the time of the arrest, police said, but she had completed two afternoon bus routes. Police said they were trying to identify the passengers on that bus.\n\nThe Longview School District said Friday that Maccarone had been working as a bus driver for one year and that, to its knowledge, she had not been reported or investigated for similar alleged incidents in the past.\n\nRick Parrish, the district's communications coordinator, told ABC News Friday that up to 90 children may have been on the bus that day with Maccarone. He said that he had spoken to the student who made the 911 call as well as the student's parents.\n\nParrish said Maccarone was on paid leave while an investigation is underway.\n\n\"Depending on how any given investigation unfolds, the pay status could change,\" Parrish said.\n\nMaccarone was booked into the Cowlitz County jail on a DUI and reckless endangerment. She paid bond and was due back in court on Oct. 15, jail officials said. ABC News' attempts to reach Maccarone's public defender were not successful.\n\nPolice said that additional charges were possible as they continued their investigation and that the district was working with the police.\n\n\"At Longview Public Schools safety and security of our students and staff is a top priority,\" Parrish said in a statement Friday. \"The district will complete an investigation into the incident very soon and notify the public of the outcome. In the meantime, an initial review of transportation processes and procedures has taken place and resulted in changes to the bus key check out process. Additionally, the district has invited a state Department of Education transportation manager to review our transportation processes and provide feedback from improvement.\"", "description": "Before police arrested the school bus driver, the child told the 911 dispatcher that the driver had ran three red lights before dropping the child off at home.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/school-bus-stock-gty-jef-190920_hpMain_16x9_992.jpg", "published_at": "2019-09-20"}