{"pub": "afr", "url": "https://afr.com/world/south-america/in-agentina-fernandez-leads-macri-with-first-results-counted-20191028-p534wd", "downloaded_at": "2019-10-28 01:32:28.121039+00:00", "title": "In Argentina, Fernandez leads Macri with first results counted", "language": "en", "text": "He was the heavy favourite in the run-up to the vote, since winning a landslide victory in primaries in August. He extended that lead in pre-election opinion polls.\n\nArgentina's choice could have far-reaching implications. It is one of the world's top grain exporters, is stirring the energy world with its huge Vaca Muerta shale field and is on the cusp of restructuring talks with creditors over $US100 billion ($147 billion) in debt.\n\nPolling stations closed at 6 pm on Sunday (Monday 8am AEDT). Soon afterward, local media started to call the election in Fernandez's favour, although with few details about the size of his lead.\n\n\"I voted for Fernandez because I see people just very unhappy in the street and I want a country with a better economy and more social support,\" Carlos Berenguer, 71, said outside a polling station in the district of Palermo in Buenos Aires.\n\n\"What's in play in this election are simply two opposing views of the country,\" said José Luis Salomón, mayor of farming town Saladillo, who was supporting Macri.\n\nFernandez, a relative unknown until this year outside Argentine political circles, had held a 20-point lead in most opinion polls after thumping Macri in the August primary. Markets had been rattled after the primary as investors feared a populist political shift.\n\nThe primary result - and the market crash that followed - sharply altered the dynamic of the race, pushing the country further into economic crisis and making Macri the underdog in an election that most had thought would be a closely fought battle.\n\n\"We are in an enormous crisis and as a result, we all have to be very responsible for what's coming. It will be an effort from all of us,\" Fernandez said earlier in the day as he cast his vote in a Buenos Aires polling station.\n\nAdvertisement\n\nThe economy has taken centre stage with the country in the grip of recession for most of the past year, the outlook for growth darkening, annual inflation over 50 per cent, job numbers down and poverty up sharply.\n\nOthers said, however, they feared a return of the Peronist left, which they blamed for leaving an already broken economy when Macri came to power in 2015. Supporters of the president said Macri needed more time to sort things out.\n\n\"Even though it's been four complex years, I have hope Macri can fix it,\" said Pablo Nicolás, 36, an accountant, as he voted on Sunday. He added he did not trust Fernandez's running mate, former President Cristina Fernandez de Kirchner.\n\nMacri won backers with plans to reform Argentina's notoriously closed economy with trade deals and a successful push to lure foreign investment into energy projects and infrastructure.\n\nHis reform plans were badly hit in 2018 when a currency and debt crisis forced him to strike a deal with the International Monetary Fund for an eventual $US57 billion to help the country to pay its bills.\n\nMacri, casting his vote to cheers of \"Yes we can,\" said he understood the country was going through \"anxious\" times, but hoped a strong turnout would help his cause.\n\n\"There is a lot of interest and we understand that this is a historic election for our country,\" he told reporters.\n\nFernández looked poised, however, to take over Macri's mantle - as well as negotiations with creditors, including the IMF, about restructuring over $US100 billion in sovereign debt amid fears the country could face a damaging default.\n\nMost investors are already pricing in a Peronist opposition win, although a big victory could lead to renewed volatility in markets, which have been constrained by recently imposed capital controls.\n\nReuters", "description": "Argentina's Alberto Fernandez was leading the presidential election on Monday (AEDT) and was on track to win outright, according to a count of 73 per cent of the ballots.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.1993%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_104/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/10e55ad543e1431da97c04f48c83ff361651ca74", "published_at": "2019-10-28"}