{"pub": "metro", "url": "https://metro.co.uk/2019/10/10/mans-uber-ride-costs-1400-dozed-off-woke-midlands-10896581", "downloaded_at": "2019-10-10 15:14:56.484554+00:00", "title": "Man’s Uber ride costs £1400 after he dozed off and woke up in the Midlands", "language": "en", "text": "The customer has been left with a hefty fine (Picture: Getty/Twitter@Plastician)\n\nA man claims his Uber driver took him all the way to the Midlands from London despite him typing in his home destination as Croydon.\n\nMusician Chris Reed, who goes by the name Plastician, tweeted about the journey, which cost him more than £1400.\n\nHe said: ‘Spent this week trying to get answers from @uber as to how my driver managed to drive me halfway up the UK while I dozed off thinking I was headed from Fulham to Croydon.\n\n‘Woken up in the Midlands!\n\n‘Didn’t hear a peep from my driver. £1453.86.’\n\nHe also said that for the entire five and a half hour journey to and from Sleaford, in Lincolnshire, Uber’s prices were surging so it doubled the cost.\n\nThe man claims there is nowhere in the app that suggests he typed in the wrong address (Picture: Plastician)\n\nThe driver took him back to London but he has so far been unable to get a refund or proper response from the company.\n\nAdvertisement\n\nAdvertisement\n\nHe claims an Uber employee who first took his complaint call on Tuesday confirmed he had entered his home address as Croydon, south London, when he requested the ride.\n\nPlastician tweeted: ‘They are now denying this yet have no proof that I ever entered an address in Sleaford – a destination I have never been to in my LIFE.\n\n‘So after 4 frustrating days of trying to avoid having to plaster this over socials, a reminder @uber take ZERO responsibility for their passenger’s safety.\n\n‘NO indication inside my app of that address being entered by me.\n\n‘Drivers can change destinations on trip.’\n\nHe later added: ‘Don’t drink & drive but also, don’t drink and get in an @uber as this could happen to anyone.\n\n‘If I am forced to pay this ridiculous fare in it’s entirety then I at least hope it saves people reading this from the same happening to them.’\n\nUber responded saying: ‘Our team is reviewing your message and will be in touch via email. We appreciate your patience.’\n\nHe later updated followers to say he has still not had a response or refund for his trip.\n\nThanks everyone for their support in this Uber fiasco. They've still not made an attempt to contact me about it. I'm not chasing them anymore – they have my phone number already.@Uber_Support @Uber — Plastician (@Plastician) October 10, 2019\n\nAdvertisement\n\nAdvertisement\n\nMetro.co.uk has contacted Uber for comment.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "A man claims his Uber driver took him all the way to the Midlands from London despite him typing in his home destination as Croydon. Musician Chris Reed, who goes...", "authors": ["Zoe Drewett"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89269629_1570718428.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-10"}