{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/president-jimmy-carter-hospitalised-fall-191022121511782.html", "downloaded_at": "2019-10-22 14:02:23.725477+00:00", "title": "Former US President Jimmy Carter hospitalised after another fall", "language": "en", "text": "Former United States President Jimmy Carter has been hospitalised with a minor pelvic fracture after a fall on Monday night, the Carter Center said on Tuesday, the second such accident this month for the nation's oldest living president.\n\nCarter fell at his home in Plains, Georgia, the centre said in a post on Twitter, but added, \"he is in good spirits and is looking forward to recovering at home.\"\n\nFor now, he is being observed and treated at the Phoebe Sumter Medical Center in nearby Americus, Georgia, for observation and treatment, it said.\n\nCarter, 95, fell at his home earlier this month and required stitches to his face, but resumed work soon after on a homebuilding project for the nonprofit group Habitat for Humanity.\n\nIn May, the Democrat broke his hip, again at his home, requiring surgery. He was hospitalised briefly in 2017 for dehydration and was diagnosed with skin cancer in 2015.\n\n191007072408121\n\nCarter, a former peanut farmer and Georgia governor, was the nation's 39th president and served one term from 1977 to 1981.\n\nAfter his presidency, Carter went on to become an international fixture and a noted humanitarian. He won the Nobel Peace Prize in 2002 for his efforts towards finding peaceful solutions to international conflicts, advancing democracy and human rights, and promoting economic and social development.\n\nHe and his wife, Rosalynn, founded the Carter Center in 1982 to carry on their international and humanitarian work.", "description": "The Carter Center says the 95-year-old suffered a minor pelvic fracture, but is 'in good spirits'.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/7/efff2c60e099436fabf0695722742491_18.jpg", "published_at": "2019-10-22"}