{"pub": "huffpost", "url": "https://huffpost.com/entry/justin-bieber-taylor-swift-banana-meltdown_n_5d9b2064e4b0993898033296", "downloaded_at": "2019-10-07 19:46:08.680008+00:00", "title": "Justin Bieber Recreates Taylor Swift's Banana Meltdown And It's A Hoot", "language": "en", "text": "Justin Bieber just unpeeled his wicked sense of humor.\n\nIn an Instagram Live session on Sunday, the singer mocked Taylor Swift’s banana meltdown after LASIK surgery. (See the clip below.)\n\n“It’s not the banana that I wanted!” Bieber whined in his kitchen, mimicking Swift’s reaction. As his wife Hailey continued to film, the Biebs continued: “It’s not the right banana. It has no head!”\n\n📹 | Justin Bieber mocks Taylor’s Jimmy Fallon interview clip of Taylor after Lasik Surgery via Instagram Live pic.twitter.com/oPPAsMvQk1 — Taylor Swift Updates (Backup) (@TSUpdatesNYBU2) October 7, 2019\n\nPerhaps still buoyed by his recent second wedding to Hailey, the Biebs seemed positively giddy in his sendup.\n\nSwift was visiting “The Tonight Show” Thursday when host Jimmy Fallon playfully ambushed her with video showing her groggy and cranky after LASIK surgery. She hilariously lost it while fussing over bananas as she talked to her mother.\n\nWhile the Biebs’ impersonation seemed playful (and his wife commented that Swift’s moment was “funny”), some outlets suggested that the reenactment packed some shade as well, because of reported tensions between the two.\n\nRecently, Bieber defended his manager, Scooter Braun, after he purchased the rights to Swift’s master recordings. Braun’s acquisition prompted anger from Swift. She also accused Braun of bullying her in the past. Bieber wrote on Instagram that Braun always had her back, and that they both loved her.\n\nKevin Mazur/TCA 2011 via Getty Images Justin Bieber and Taylor Swift in 2011.", "description": "The \"Baby\" singer and wife Hailey teamed up for the joke on Instagram Live.", "authors": ["General Assignment Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d9b294b200000f2004eb866.png?ops=1778_1000", "published_at": "2019-10-07"}