{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/singapore-government-ready-to-take-action-amid-economic-downturn-heng ", "downloaded_at": "2019-09-27 03:53:48.228195+00:00", "title": "Singapore government ready to take action amid economic downturn: Heng", "language": "en", "text": "The government is watching closely how the economy will pan out by the end of the year, and stands ready to take action when needed, said Deputy Prime Minister Heng Swee Keat on Friday.\n\n[SINGAPORE] The government is watching closely how the economy will pan out by the end of the year, and stands ready to take action when needed, said Deputy Prime Minister Heng Swee Keat on Friday.\n\nHe was responding to statistics released by the Economic Development Board on Thursday, showing that Singapore's manufacturing output fell 8 per cent year-on-year in August on the back of sharp falls in electronics and precision engineering output.\n\nIn an hour-long radio interview with CNA938, Mr Heng said that although the downside risk to growth has increased amid China-US trade tensions, sectors such as financial and insurance services are doing well. Some areas even within electronics, such as data storage, have grown.\n\nSpeaking to radio presenters Arnold Gay and Yasmin Jonkers, he noted that although the International Monetary Fund has cut the global growth forecast several times this year, the Singapore government has countercyclical measures at its disposal.\n\nsentifi.com Market voices on:\n\n\"MAS is looking carefully at what is the appropriate exchange rate and will be announcing this as part of the normal monetary policy cycle.\"\n\nHe does not foresee the need for an extraordinary Budget, but said the government has planned for different scenarios and is looking at a range of measures depending on the state of the economy.\n\nWhat is more important is the need for critical structural changes to accompany these measures, he said.\n\nCiting China as an example of how many countries are reforming their economy, he added: \"When our trading partners change the structure of their economy and upgrade, we too must upgrade, otherwise we'll be left behind.\n\n\"We are helping our workers learn new skills, and working with companies to restructure jobs so their workers can do better.\"\n\nOn the international front, this means committing to a multilateral approach, and being prepared to create new trading links and trade specialisations.\n\nNoting that Singapore has inked many free trade agreements all over the world, he said: \"Maintaining Asean centrality is key... there is a lot of complementarity within Asean that makes it a good production base.\"\n\nAsked how the government intended to reconcile Singaporeans' fears of a recession with the impending Goods and Services Tax (GST) hike, Mr Heng explained that the increase in GST by 2 percentage points to 9 per cent, slated to kick in between 2021 and 2025, is needed so as not to pass on financial burden to future generations.\n\n\"The other option is we take a debt and our future generation pays for it - is that fair? Many countries take on debt which is not sustainable, the government becomes popular with the people for awhile.\"\n\nThe exact timing of the hike depends on how expenses go up and how incomes change, he said.\n\nRather than fund long-term infrastructure, it is meant to address rising healthcare expenditure from an ageing population.\n\n\"Today our restructured hospitals are heavily subsidised, and new drugs and treatment methods will be more costly.\"\n\nHe gave the assurance that the government will help Singaporeans cope with higher costs, and that he will announce a significant offset package when the GST is raised.\n\nTo Mr Gay's question on how a potential Cabinet reshuffle could play out ahead of the next general election, Mr Heng said that he and Prime Minister Lee Hsien Loong meet regularly, and PM Lee has been sharing \"quite a lot of his views\" with him.\n\nOn when elections will be held, Mr Heng would say only that \"it is coming nearer each day\".\n\nUltimately, he said, Singaporeans must stay united and work towards the common goal of realising their potential and fulfilling their aspirations - a challenge, given that misunderstandings can happen easily.\n\n\"This is always work in progress... but when it takes on racial or religious dimensions, it can be dangerous,\" he said, noting that all leaders should promote deeper understanding and appreciation of diversity.\n\nOn contentious issues such as economic divisions, LGBTQ and green activism, he said that the world is seeing increasing polarisation when single issues come to dominate the national discussion.\n\n\"We must work doubly hard to make sure these do not become fault lines. The key is...to look for areas of common interest and concerns for which we can work together.\n\n\"We are stronger by working together, than by working apart.\"\n\nStressing Singapore's vulnerability, he pointed out that it was a little red dot in a sea of almost 200 nations.\n\n\"How we keep ourselves cohesive and united is key to our success. If we spend all our energy fighting over issues big and small and fragment our society, we will be overtaken and not have a good future.\"\n\nObserving that some bigger nations could not agree even on the most fundamental issues, he said: \"They can bounce up and down and still survive, but Singapore does not have the luxury of such a wide margin.\"\n\nTHE STRAITS TIMES", "description": ": THE BUSINESS TIMES Government & Economy - [SINGAPORE] The government is watching closely how the economy will pan out by the end of the year, and stands ready to take action when needed, said Deputy Prime Minister Heng Swee Keat on Friday. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/09/27/nz_hsk_270961_0.jpg?itok=2VT_RI51", "published_at": "2019-09-27"}