{"pub": "cnbc", "url": "https://cnbc.com/2019/09/04/wall-street-strategists-are-finding-it-tougher-to-forecast-sp-500.html", "downloaded_at": "2019-09-05 00:07:13.246668+00:00", "title": "Wall Street has no idea how stocks will end 2019, with forecasts ranging from down 5% to up 11%", "language": "en", "published_at": "2019-09-04", "text": "Traders work on the floor of the New York Stock Exchange.\n\nLeading stock forecasters differ greatly on where the S&P 500 will go in the final four months of the year compared with predictions made this same time last year, a CNBC analysis has found.\n\nThe wide range of forecasts reflects the current tumultuous stock environment due to the fragile trade talks with China, a mystifying plunge in bond yields and emerging signs of a possible global recession.\n\nStrategists at Wall Street's top brokerages and investment banks see a broad array of possible outcomes by the end of December with Deutsche Bank calling for an 11% rally to 3,250 while Barclays and Morgan Stanley seeing another 5% downside from current levels to 2,750.\n\nThe 17 top stock prognosticators tracked by CNBC's Market Strategist Survey show Wall Street, on average, sees the S&P 500 drifting 2.2% higher from current levels by the end of the year. But the standard deviation between their forecasts — a gauge how spread out the guesses are — was 127 points or 4.4% of its current level.\n\nThat's in contrast to last year, when nearly half of respondents saw the large-cap index closing the year at 3,000. The standard deviation of those projections was 114, just under 4%.\n\nNone of the strategists, however, believes that the market will end the year with losses. The S&P 500 is already up 15.9% for the year, well above the December 2018 lows clinched during a Christmastime volatility spike. Even the most bearish forecasts from Morgan Stanley and Barclays imply a 9.6% gain for the year.\n\nDeutsche Bank's bullish call, which sees the broad market index at 3,250 by December, implies a 29.6% gain in 2019.\n\nThe latest update to a strategist's stock-market expectations came on Tuesday, when Bank of America's Savita Subramanian updated her outlook to reflect \"trade talk, political campaigning & tweets.\"\n\nWhile Subramanian left her 2,900 forecast untouched and noted that investors have been hesitant to rejoin the equity market, she wrote that geopolitical headwinds are enough to keep her on the sidelines for now.\n\n\"Dovish central banks and tepid equity positioning are supportive, but trade tensions/global growth concerns/geopolitical risks plus signs of margin compression and further downward risk estimates are likely to limit upside going forward,\" she wrote.\n\n\"These warring factors leave us neutral on the S&P 500,\" she added.", "description": "Stock forecasters are having a tougher time predicting where the S&P 500 will end up by year's end when compared with predictions made the same time last year.", "authors": ["Thomas Franck"], "top_image": "https://image.cnbcfm.com/api/v1/image/103448841-GettyImages-514173176.jpg?v=1567517982"}