{"pub": "washingtonpost", "url": "https://washingtonpost.com/weather/2019/09/24/dc-area-forecast-sunny-warm-comfortable-rest-week", "downloaded_at": "2019-09-24 13:48:27.239502+00:00", "title": "D.C.-area forecast: Sunny, warm and comfortable for the rest of the week", "language": "en", "text": "\n\nFirst day of autumn. (Tom Mockler) (Tom Mockler/Flickr/Tom Mockler/Flickr)\n\nTODAY’S DAILY DIGIT\n\nA somewhat subjective rating of the day’s weather, on a scale of 0 to 10.\n\n10/10: Comfortable humidity, ideal warmth and sunshine is my kind of sublime.\n\nEXPRESS FORECAST\n\nToday: Mostly sunny, a bit breezy. Highs: 78 to 82.\n\nTonight: Mostly clear. Lows: 53 to 61.\n\nTomorrow: Mostly sunny. Highs: 80 to 84.\n\nView the current weather at The Washington Post.\n\nFORECAST IN DETAIL\n\nHigh pressure builds in for the next few days, and while temperatures will still be warmer than average, our humidity will stay low enough to keep things comfortable. Yes, we still need rain, and any showers that eventually do come Sunday won’t put much of a dent in our precipitation deficit, but at least the weather will give us a more gentle transition into autumn.\n\nGet our daily forecasts on your Amazon Alexa device. Click here to find out how.\n\n\n\nx\n\nToday (Tuesday): Excellent weather with mostly sunny skies and temperatures reaching around 80 in the afternoon as humidity stays really low (dew points way down in the low 50s by afternoon). Winds blow from the northwest at around 10 mph, but look for some occasionally higher gusts. Confidence: High\n\nTonight: Mostly clear skies with comfortable temperatures that reach down into the low 50s in the outer suburbs to about 60 in the city. Light winds mainly from the northwest. Confidence: High\n\nFollow us on Facebook, Twitter and Instagram for the latest updates. For related traffic news, check out Gridlock. Keep reading for the forecast through the weekend …\n\n\n\nx\n\nTomorrow (Wednesday): Mostly sunny again with low humidity and warm temperatures in the low to mid-80s. Light winds blow mainly from the west. Confidence: High\n\nTomorrow night: Mostly clear again, with lows ranging mainly through the 60s. Confidence: High\n\nA LOOK AHEAD\n\nThursday is another mostly sunny day, but temperatures lean a bit toward the hotter side as highs reach the mid- to upper 80s to about 90 degrees. Like Monday, humidity remains quite low, so the heat will be quite tolerable. Thursday night is mostly clear again, with lows in the low 50s to low 60s. Confidence: Medium-High\n\nFriday should continue the mostly sunny streak with temperatures knocked back a bit, into the upper 70s to low 80s for highs along with low humidity once more. Mostly clear Friday night, with lows in the upper 50s to 60s. Confidence: Medium-High\n\nThe heat builds once again for the weekend, with partly sunny skies and highs in the upper 80s to low 90s on Saturday and potentially the low 90s on Sunday, with a chance to break some records. Humidity will still be tolerable, however. Lows on Saturday night dip into the 60s to about 70 under a few clouds. Some scattered showers are possible Sunday afternoon and evening, but confidence is low given this dry pattern. We need something bigger to break us out of it. Confidence: Medium", "description": "With yesterday's heat behind us, we will see sunny skies with temperatures in the 80s for the rest of the week.", "authors": ["Matt Rogers", "September At Am", "Matt Rogers Is A Meteorologist", "A Petworth Resident. He Is President", "Co-Founder Of Commodity Weather Group In Bethesda", "Md.", "Which Focuses On Weather Risks For The Energy", "Agriculture Sectors. Like Most Meteorologists", "His Passion For Weather Started Extremely Early In Life", "Has Never Let Go."], "top_image": "https://www.washingtonpost.com/resizer/88dAwqBat91p1eHweKYanQvBdlY=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LB7QWOVZ4ZEELJTTIZHFFHZQKU.jpg", "published_at": "2019-09-24"}