{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7565863/Ksenija-Lukich-ambassador-Korean-beauty-brand-AHC.html", "downloaded_at": "2019-10-12 15:20:37.698754+00:00", "title": "Ksenija Lukich becomes ambassador for Korean beauty brand AHC", "language": "en", "text": "It's one of Korea's most popular skincare brands, and a cult favourite with A-list celebrities like Anne Hathaway.\n\nAnd now Ksenija Lukich will be the latest ambassador for the AHC brand, announcing her new role to Confidential on Saturday.\n\nThe 29-year-old revealed: 'This is my first big skincare campaign and to do it with such an incredible brand is a real honour.'\n\n'I feel so lucky!' Ksenija Lukich (pictured) announced her 'first big skincare campaign' as ambassador for a cult Korean beauty brand AHC on Saturday\n\nShe added: 'I'm also off to Seoul next week to see the brand launch its first flagship store. I've been wanting to visit Korea for some time and I feel so lucky to be there with AHC.'\n\nKorean beauty products have become all the rage in recent years, with cutting-edge products that are favourite with stars and influencers.\n\nAHC is available exclusively at Myer, with affordable products ranging between the $50 and $80 range.\n\nThe 29-year-old revealed: 'This is my first big skincare campaign and to do it with such an incredible brand is a real honour'\n\nCream of the crop: AHC is available exclusively at Myer, with affordable products ranging between the $50 and $80 range\n\nIt comes after the The E! Australia host spoke out about her struggles with eczema.\n\n'It becomes really difficult when you're a television presenter and you're on TV with eczema on your eyes,' she said, according to Beauticate.\n\n'It's extremely difficult to cover because everything you use sinks into the dry areas and sort of flakes off. It's also uncomfortable putting makeup and product on top of dry, red skin.'\n\nShe added: 'I'm also off to Seoul next week to see the brand launch its first flagship store. I've been wanting to visit Korea for some time and I feel so lucky to be there with AHC'\n\nBlemish-free: It comes after the The E! Australia host spoke out about her struggles with eczema and how making simple lifestyle changes helped improve her skin\n\nShe previously told Mamamia two of her favourite products to help minimise flare ups including Cetaphil's RestoraDerm Skin Restoring Body Wash.\n\n'It's actually a body wash but it removes my makeup very well, it's super affordable and it works really well for me, it's really gentle,' she said.\n\nAnother product that she uses is the Trilogy Certified Organic Rosehip Oil.\n\n'At night time, I like to be super hydrating on my skin. Rosehip is good for healing, and for my scarring from eczema. I go through it all the time,' she said.", "description": "It's one of Korea's most popular skincare brands, and a cult favourite with A-list celebrities like Anne Hathaway.", "authors": ["Marta Jary For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/14/19626838-0-image-a-35_1570886758106.jpg", "published_at": "2019-10-12"}