{"pub": "indiatimes", "url": "https://indiatimes.com/sports/dwayne-the-rock-johnson-returns-to-wwe-we-could-smell-what-was-cooking-377192.html", "downloaded_at": "2019-10-05 13:34:11.654901+00:00", "title": "Dwayne 'The Rock' Johnson Returns To WWE & We Could Smell What Was Cooking", "language": "en", "text": "Dwayne 'The Rock' Johnson Returns To WWE & We Could Smell What Was Cooking\n\nDwayne 'The Rock' Johnson Returns To WWE & We Could Smell What Was Cooking\n\nCan you still smell it? The People's Champion has returned!\n\nWWE\n\nWWE Smackdown opened to electrifying atmosphere as Dwayne \"The Rock\" Johnson returned to the ring on, making an epic appearance on the premiere of Friday night shown on Fox, and the crowd went wild.\n\nThe Rock came out in support of Becky \"The Man\" Lynch, who was making her stand against reigning King of the Ring Baron Corbin, and the two wasted no time in getting down to business.\n\nRock started in his trademark fashion, taking the microphone and going on his traditional tirade of catchphrases that we have become synonymous with since our childhood.\n\nWWE\n\nDon't Miss 1.3 K SHARES 10.5 K SHARES 1.5 K SHARES 247 SHARES\n\n\"That's what happens when you come out and you insult the people,\" he warned. \"And that's what happens when you come out and you insult the jabroni-beating, pie-eating, trailblazing, eyebrow-raising from Los Angeles all the way to Japan. You're getting ready to get your monkey ass whooped by The Rock and The Man!\"\n\nThe talk soon turned into a brawl when the the two sprung into action, with Rock getting the better of Corbin, much to the delight of the noisy crowd.\n\nBecky Lynch rocketed across the ring with her signature leg drop, but the crowd went absolutely berserk when The Rock bounced off the ropes twice before standing over Corbin and dropping his signature \"People's Elbow.\"\n\nIt was the return of our childhood hero and it was a trip down the memory lane - the people's champion was back home and we coudn't contain the excitement.\n\nClearly, Dwayne Johnson always has a home at the WWE, though he's doing alright for himself in Hollywood as well. The actor was recently named the highest-paid actor of 2019.", "description": "Can you still smell it? The People's Champion has returned! WWE Smackdown opened to electrifying atmosphere as Dwayne The Rock Johnson. Becky Lynch rocketed across the ring with her signature leg drop, but the crowd went absolutely berserk when The Rock bounced off the ropes twice before standing over Corbin and dropping his signature People's Elbow.", "authors": ["Basit Aijaz"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/the_rock_1570276076_800x420.jpg", "published_at": "2019-10-05"}