{"pub": "zdnet", "url": "https://www.zdnet.com/article/samsung-to-launch-5g-modem-with-5-1gbps-download-speed", "downloaded_at": "2019-10-24 04:29:11.808531+00:00", "title": "Samsung to launch 5G modem with 5.1Gbps download speed", "language": "en", "text": "Image: Samsung\n\nSamsung Electronics has unveiled a new processor and modem that will power 5G smartphones next year.\n\nThe South Korean tech giant's Exynos Modem 5123 boasts download speed of 5.1Gbps, double that of currently commercialised products, the company said at Samsung Tech Day in Los Angeles.\n\nBy grouping eight divisions of spectrum together through carrier aggregation technology, it can also reach download speed of up to 7.35Gbps for mmWave spectrum, it said.\n\nIt boasts 3Gbps on LTE networks by supporting higher-order 1024 Quadrature Amplitude Modulation, Samsung added.\n\nSamsung also introduced Exynos 990, its next-generation mobile application processor. Made with a 7nm process, the octa-core processor has a dual core neural processing unit and an embedded Arm Mali-G77 GPU made on Valhall architecture.\n\nIt also has an image signal processor that can by synced with up to six image sensors.\n\nSamsung said it would start production of the two chips within the year. They will likely power flagship smartphones that are set to launch next year.\n\nEarlier this week, the company also showcased its 5G New Radio Access Unit that can support 28GHz spectrum and is compliant with the 3GPP NR standard.\n\nSamsung has been pushing 5G hard. On the product end, it was the first to launch a 5G smartphone with the Galaxy S10 5G. Its logic arm, Samsung System LSI, is a key supplier of the 5G chips from processors to modems that are underneath the hood of these devices.\n\nFor networks, it is currently the largest supplier of 5G radio stations in South Korea. The company is also supplying its mmWave spectrum equipment to US carriers and has deals to deploy them with Japan's KDDI next year.\n\nSamsung previously said it has aspirations to secure 20% market share in 5G network equipment by 2020.\n\nAlso announced at Tech Day, the company's memory business said it has begun mass production of its 12GB low-power double data rate 4X UFS-based multi-chip package which is aimed at mid-tier smartphones.\n\nRelated Coverage\n\nSamsung discontinues Linux on DeX with Android 10 rollout\n\nSamsung is shutting down its Linux on DeX projects after only 11 months.\n\nSamsung admits fingerprint reader flaw, promises software fix\n\nSamsung has promised to provide a software update to fix the glaring security issue that allows users to bypass the fingerprint reader through using third-party screen protectors.\n\nSamsung to launch smartphone with under-the-display front camera: Report\n\nThe new technology is expected to either be applied onto the upcoming Galaxy S11 or the next generation of the Galaxy Fold.\n\n5G and foldable phones: The promises and problems (TechRepublic)\n\nTechRepublic's Karen Roby and CNET's Jessica Dolcourt discuss the current and future state of the smartphone industry and the much-anticipated benefits of 5G.", "description": "Samsung's Exynos Modem 5123 boasts 5.1Gbps download speed for sub-6GHz spectrum and 7.35Gb for mmWave.", "authors": ["Cho Mu-Hyun"], "top_image": "https://zdnet2.cbsistatic.com/hub/i/r/2019/10/24/d4f534b6-85a0-448e-84e3-65db296f51dd/thumbnail/770x578/5b4ccc50abea7557a9bbfd32135b25b0/exynos-990-front-and-back.jpg", "published_at": "2019-10-24"}