{"pub": "independent", "url": "https://independent.co.uk/news/world/asia/china-panda-cafe-dogs-cute-pet-games-chengdu-a9167701.html", "downloaded_at": "2019-10-23 12:19:13.493937+00:00", "title": "Chinese cafe faces backlash after painting dogs to look like pandas", "language": "en", "text": "A cafe in China where chow-chow dogs have had their fur dyed so as to make them look like baby giant pandas has become a target for complaints over the treatment of the animals.\n\nThe Cute Pet Games Cafe in Chengdu, in China’s south western Sichuan province, opened last month, and at first glance appeared to be home to no fewer than six cuddly baby pandas.\n\nBut they were in fact white dogs whose faces, ears and limbs have been dyed black, giving them the appearance of panda bear cubs.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nA video of the rotund dogs wandering around, nibbling one another and being petted inside the cafe has gone viral on Chinese social media platform Weibo.\n\nAccording to Chengdu Business Daily, “in the store, there are six chow chow dogs who have successfully ‘transformed’,” the news outlet reports.\n\n“The customers in the store prefer to call them ‘panda dogs’,” it adds.\n\nThe cafe apparently offers the dying service so other people’s pets can be transformed into panda dogs for 1,500 yuan (£165).\n\nThe owner of the cafe, identified as a man named Mr Huang on Weibo, said the dye used was imported from Japan, and does not affect the animals.\n\nHe said the viral video had prompted a rise in visitor numbers.\n\nBut the dying of the dogs has drawn widespread criticism, with one vet telling Hongxing News it could do the animals serious damage.\n\n“This could damage their fur and skin,” Li Daibing told the news outlet.\n\nPeople in China pointed out on social media that hair dye can “damage people’s hair and scalp”, so it could therefore have the same impact on other animals.\n\nOthers said: “It’s really cute”.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nEarlier this year the organisers of the Latitude Festival in Suffolk were accused of “animal cruelty” for their regular festival practice of dying sheep bright colours.", "description": "A cafe in China where chow-chow dogs have had their fur dyed so as to make them look like baby giant pandas has become a target for complaints over the treatment of the animals. The Cute Pet Games Cafe in Chengdu, in China’s south western Sichuan province, opened last month, and at first glance appeared to be home to no fewer than six cuddly baby pandas.", "authors": ["Harry Cockburn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/23/12/panda-dog-2.jpg", "published_at": "2019-10-23"}