{"pub": "guardian", "url": "https://theguardian.com/commentisfree/2019/oct/22/northern-ireland-abortion-ban-triumph-grassroots-activism", "downloaded_at": "2019-10-22 13:27:33.141052+00:00", "title": "The end to Northern Ireland’s abortion ban is a triumph for grassroots activism | Anna Cafolla", "language": "en", "text": "It has been 1,009 days since the Stormont government in Northern Ireland collapsed in January 2017. While the building on the Belfast Hill has gained some mothballs and a politician here and there has been chided for morally and politically dubious holidays, Northern Irish citizens’ human rights have been dug from the bedrock of a patriarchal, religious-gilded state.\n\nIn June 2017, Belfast’s court of appeal ruled that it was up to the Northern Irish assembly to decide on the country’s restrictive abortion law. That same day, the British government monumentally announced funding for pregnant Northern Irish women to access abortion in England, pressured by Labour MP and ally Stella Creasy.\n\nThe DUP and anti-choice nationalist politicians, as well as religious leaders, have failed\n\nIn May 2018, the Republic of Ireland voted to repeal its archaic abortion restrictions – Stormont, still dormant. Earlier this month, Sarah Ewart, a woman forced to travel to England for an abortion after receiving a fatal foetal diagnosis, triumphed in her legal challenge to Northern Irland laws for breaching human rights. In over three years, thousands of women, girls, and pregnant people have travelled to access terminations elsewhere – an overwhelming number of journeys by car, plane, boat, and rail. People in Northern Ireland have long been constricted by some of the most crushing abortion laws in the world, making it illegal even in cases of incest and rape. At the time that power-sharing was obliterated and a political vacuum opened up, more than 160 pieces of legislation were halted, unable to receive ministerial backing. On day 410 of no functioning government, we were thrown by reports that found suicides in Northern Ireland since the Good Friday agreement outstripped the number of dead in the Troubles conflict, while supporting charities gave out with lack of funding. On the dark day 832, the journalist Lyra McKee – who wrote fiercely about Northern Ireland’s most urgent issues – was murdered in Derry by paramilitary gunfire. Calls swelled for unity, politicians rushed to engage in talks to restore the assembly, but nothing fruitful came. But on day 914, Westminster resoundingly voted to extend same-sex marriage and access to abortion to Northern Ireland, two historic decisions made within 15 minutes of each other.\n\nToday is day zero for a new, progressive Northern Ireland. At midnight last night, the 158-year-old ban on abortion was lifted in favour of decriminalisation. Yesterday saw the DUP and other anti-choice MLAs gather in a paltry attempt to restore the assembly and name a speaker, as a last-ditch attempt to smite law reform – a pathetic display of contempt for human rights. Other parties refused to attend, so the attempt at executive restoration has been little more than a pantomime. It feels bizarre, to will your political system’s continued chaos for the betterment of its people, but here we are.\n\nFacebook Twitter Pinterest ‘Contempt for human rights.’ Arlene Foster, leader of the Democratic Unionist party, at Stormont on Monday. Photograph: Charles McQuillan/Getty Images\n\nWe are on the cusp of a freedom that’s been fought for and crafted by years of fervent grassroots organising by groups like Alliance for Choice, individuals sharing their painful, unjust stories; and unrelenting collective solidarity. Over the years, Northern Ireland has borne witness to the criminalisation and persecution of women for accessing abortion pills at home – the police raids of activists’ homes and workplaces, a student betrayed to authorities by her housemates with evidence of her miscarriage scavenged from their bin, a mother prosecuted for procuring pills for her teenage daughter, a survivor of an abusive relationship. After today, no more criminal proceedings can be brought forward – finally, a very real, archaic threat can be shed: women won’t be dragged through the courts for their bodily choices. Through all this, Alliance for Choice’s pro-choice campaign stall in Belfast’s Corn Market has weathered it all, while escorts faithfully protected the users of the now-closed Marie Stopes clinic from anti-choice violence and abuse. Activists continue to be the voice of reason, while politicians either freeze or scramble – we owe this win for human rights to them all. And though we celebrate, we remember the traumatising horror of a journey it has been, and the people who suffered in its wake.\n\nWe are witnessing one of the most radical movements of contemporary feminism of this century. The cases for reproductive rights and bodily autonomy are inextricably linked to the fight for marriage equality and LGBTQ+ rights, a shared mission for freedom and choice. The DUP and anti-choice nationalist politicians, as well as NI’s religious leaders, and their attempts to play on religious and national identity have failed. The cries of “partisan issues” or “Westminster intervention” proved obselete. Attempts by anti-abortion acitivists to use the prospect of introducing the previously contentious Irish Language Act as a means to bring back power-sharing and then ultimately halt abortion reform have been railed against by Gaeilgeoirí (Irish speakers) and everyone who understands NI as a multi-issue state, where rights aren’t traded against each other. With stats showing 71% believe in a woman’s right to choose and 89% rejecting criminalisation, Northern Irish people are ready for change, the draconian laws are just catching up with them.\n\nAbortion rights used to get DUP to back Brexit deal, says Stella Creasy Read more\n\nThe monstrous culture, with its tentacles of religious ideology and political constraints long wrapped around Northern Ireland’s throat, are falling away.\n\nState-sanctioned shame that makes women merely vessels is peeling away, barriers that most corrosively affect the poor and marginalised pulled down. And whether Stormont returns to stasis or not, activists will continue to reject the enduring status quo that has used Northern Irish bodies as political pawns. These next few months will be ravaging, as the provisions and regulations must be formed by March 2020. Already, we’ve seen the difficulties of making inclusive, accessible abortion care in the Republic. But we have an opportunity to craft a new Northern Ireland in an image without persecution or barriers. Though hope can feel hard in a post-conflict society marred by political apathy, we’ve seen that love wins, the grassroots triumph, and that the North is well and truly now.\n\n• Anna Cafolla is a Belfast-born journalist specialising in women’s rights, Northern Ireland, youth culture and activism", "description": "Decriminalisation ends the persecution of women by a monstrous religious culture, says the Belfast-born journalist Anna Cafolla", "authors": ["Anna Cafolla"], "top_image": "https://i.guim.co.uk/img/media/0b48aabec1ef0c629fec462c7efdc76c776c0dce/0_274_4928_2957/master/4928.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=aa0dc90e7e1e485265abf840ad5a1926", "published_at": "2019-10-22"}