{"pub": "independent", "url": "https://independent.co.uk/news/uk/politics/labour-party-bankruptcy-antisemitism-investigation-corbyn-executive-a9153561.html", "downloaded_at": "2019-10-13 00:23:07.598251+00:00", "title": "Labour Party risks bankruptcy over antisemitism investigation, executive members fear", "language": "en", "text": "Members of Labour’s ruling executive have privately voiced fears that the party could be bankrupted as a result of an official inquiry into antisemitism, The Independent has learnt.\n\nMembers of the National Executive Committee (NEC) have expressed concerns that a damning verdict from the equalities watchdog about Labour’s handling of antisemitic abuse could open the party up to a slew of lawsuits from Jewish members and former members, possibly resulting in hefty damages having to be paid.\n\nIt is understood that the issue was discussed at a recent NEC meeting, with members of the committee voicing major concerns about the fallout from the probe and who would be financially responsible.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nParty bosses were asked what protections are in place for a scenario in which Labour has to cover the cost of multiple legal battles and potential payouts.\n\nTwo sources said the discussion was quickly “shut down” by party officials and allies of Jeremy Corbyn, and that the committee remains in the dark about the potential financial implications.\n\nShape Created with Sketch. Protests against Labour antisemitism Show all 14 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Protests against Labour antisemitism 1/14 Protesters clashed during the demonstration Reuters 2/14 Members of the Jewish community hold a protest against Labour party leader Jeremy Corbyn and antisemitism in the Labour Party AFP/Getty 3/14 Protesters hold placards and flags during a demonstration, organised by the British Board of Jewish Deputies for those who oppose antisemitism, in Parliament Square Reuters 4/14 Hundreds of people gathered in Parliament Square to protest against antisemitism in the Labour Party EPA 5/14 Labour MP Luciana Berger speaks during the protest PA 6/14 A protester blows through a shofar during the demonstration Getty 7/14 Members of London's Jewish community protest in support of Labour leader Jeremy Corbyn outside parliament EPA 8/14 Labour MP John Mann speaks during a protest against antisemitism PA 9/14 People protest against antisemitism in the Labour Party as Jewish community leaders have launched a scathing attack on Jeremy Corbyn, claiming he has sided with antisemites ‘again and again’ PA 10/14 Labour politicians Stella Creasy and Chuka Umunna leave after attending the demonstration Getty 11/14 A pro-Jeremy Corbyn protester holds a placard during a counter-protest Getty 12/14 A support of the Labour Party hold up a placard during the demonstration Reuters 13/14 Jeremy Corbyn supporters during the demo Reuters 14/14 A protester holds up a sign reading ‘For the many, not the Jew’ AFP 1/14 Protesters clashed during the demonstration Reuters 2/14 Members of the Jewish community hold a protest against Labour party leader Jeremy Corbyn and antisemitism in the Labour Party AFP/Getty 3/14 Protesters hold placards and flags during a demonstration, organised by the British Board of Jewish Deputies for those who oppose antisemitism, in Parliament Square Reuters 4/14 Hundreds of people gathered in Parliament Square to protest against antisemitism in the Labour Party EPA 5/14 Labour MP Luciana Berger speaks during the protest PA 6/14 A protester blows through a shofar during the demonstration Getty 7/14 Members of London's Jewish community protest in support of Labour leader Jeremy Corbyn outside parliament EPA 8/14 Labour MP John Mann speaks during a protest against antisemitism PA 9/14 People protest against antisemitism in the Labour Party as Jewish community leaders have launched a scathing attack on Jeremy Corbyn, claiming he has sided with antisemites ‘again and again’ PA 10/14 Labour politicians Stella Creasy and Chuka Umunna leave after attending the demonstration Getty 11/14 A pro-Jeremy Corbyn protester holds a placard during a counter-protest Getty 12/14 A support of the Labour Party hold up a placard during the demonstration Reuters 13/14 Jeremy Corbyn supporters during the demo Reuters 14/14 A protester holds up a sign reading ‘For the many, not the Jew’ AFP\n\nThe fears are fuelled by the party’s worsening finances. Figures revealed this week showed that Labour made a loss of £655,000 last year, compared to a profit of £1.45m the year before, as a result of a fall in membership, rising staffing costs and losses incurred by last summer’s Labour Live event. The party's finances are likely to come under further strain if it has to fight a general election later this year.\n\nSome NEC members are worried that the financial situation could become unmanageable if the Equality and Human Rights Commission (EHRC) finds that the party has failed to protect Jewish members.\n\nThe watchdog opened a formal investigation into Labour in August and is due to report next year. The Independent understands that multiple NEC members and other senior party figures have been asked to give evidence to the inquiry.\n\nAmid growing concern about the outcome of the inquiry, several NEC members are understood to have asked officials what indemnity Labour has, following fears that members of the committee may have to personally foot the bill if the party runs out of money.\n\nThey believe that, like trustees of a charity, they are legally and financially responsible for the party.\n\nInside Politics newsletter The latest news on Brexit, politics and beyond direct to your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive updates on politics every morning by email Update newsletter preferences\n\nOthers committee members are said to have been “stunned” when it was pointed out that they may be personally liable.\n\nOne NEC member said of the EHRC inquiry: “If it’s really bad then it opens up all sorts of possibilities and it has been raised that the whole thing could basically bankrupt the party.\n\n“People are really worried. The party has been asked to let us know what indemnity it has because there are concerns that NEC members are going to ultimately be responsible for this.\n\n“If we were a charity, the Charity Commission would have been all over us months ago. The EHRC is effectively playing the same role as the Charity Commission and we are effectively the trustees. That means we are legally responsible.”\n\nA second NEC member said: “There have been concerns raised about who is legally responsible for the Labour Party. Some of us are worried about this. The grown-ups on the NEC who do not have the backing of the trade unions are all concerned. We don’t know what’s happening.\n\n“I don’t think it’s occurred to most of the NEC that there could be financial implications, but it has to some of us. We’ve raised the question but haven’t had an answer.”\n\nAsked if they were confident the party would be able to cope financially with whatever the EHRC concludes, the member said: “No. There is no basis for that confidence.”\n\nAnother Labour source with an understanding of the situation added: “There are fears that if the EHRC goes against the party then individual victims will have the right to go for damages from the party, and who knows where that ends up – nobody can be sure because there’s no precedent for it.\n\n“Nobody quite knows what the liability is for the individuals NEC members. If they are liable then it makes it even more damaging that Jennie [Formby, Labour’s general secretary] and her team won’t share their understanding of what the damages might be and the possible implications. Clearly, NEC members are worried about that scenario but the conversation got completely shut down.”\n\nSuggesting that Labour could run out of money if it had to pay extensive damages, the source continued: “Councils all around the country are having to borrow money to pay victims of historic sexual injustice. The danger is that the Labour Party will have to do the same if it is subject to victim or class action, having been found to be institutionally antisemitic.”\n\nSome also voiced concerns that, in this scenario, there would be “another round of victim-blaming”, with Jewish people blamed by some for the party’s difficulties.\n\nNEC members have repeatedly raised concerns that, despite their legal responsibilities, they have not been allowed to read or contribute to the party’s response to the EHRC.\n\nThe response is understood to have been drafted by party officials in conjunction with Mr Corbyn’s team, but a small handful of NEC officers decided it should be submitted without being seen or approved by the wider committee.\n\nOne NEC member said: “We don’t know whether the party has made a very solid, sound presentation to the commission or the complete opposite. There is a total ignorance of what has been said on behalf of the party.\n\n“Most of the NEC don’t trouble themselves about these things. They haven’t worked out that they will have, potentially, as individuals, a legal responsibility.”\n\nLabour declined to comment, although sources said the party did not believe that individual NEC members could be held personally responsible.\n\nHowever, in a speech earlier this year, Baroness Hayter, Labour’s deputy leader in the House of Lords and a former NEC member and chair of the Labour Party, said: “There’s been a serious undermining of the NEC by denying its members, who have legal responsibility for the party, membership figures, financial structures, financial accounts, the submission in their names to the EHRC.”", "description": "Members of Labour’s ruling executive have privately voiced fears that the party could be bankrupted as a result of an official inquiry into antisemitism, The Independent has learnt. Members of the National Executive Committee (NEC) have expressed concerns that a damning verdict from the equalities watchdog about Labour’s handling of antisemitic abuse could open the party up to", "authors": ["Benjamin Kentish"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/21/23/jeremy-corbyn.jpg", "published_at": "2019-10-12"}