{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/29/ahmed-abu-ali-says-hes-another-victim-of-saudi-gov", "downloaded_at": "2019-10-30 02:24:48.472190+00:00", "title": "Imprisoned man says he's another victim of Saudi government", "language": "en", "text": "A man sentenced to life without parole for conspiring to assassinate President George W. Bush and providing support to al-Qaeda has mounted what is believed to be the first “Khashoggi defense” in federal court.\n\nAhmed Abu Ali’s attorneys filed a petition saying their client’s conviction should be vacated, saying that just like Jamal Khashoggi, The Washington Post journalist killed last year, he’s a victim of the Saudi government.\n\nIn a 19-page court filing submitted on the one-year anniversary of Khashoggi’s killing, they petitioned a federal court in Virginia to reconsider Ali’s sentence, saying their client was tortured and manipulated by the Saudi government’s secret service police, which has been accused of brutally murdering Khashoggi.\n\nThey say the Saudi government’s cover-up of the Khashoggi killing suggests it was too reckless for U.S. prosecutors to rely on when they went after Ali in 2005, eventually securing a conviction and a sentence of life in prison without parole.\n\n“The Saudi government will go to any lengths to cover up wrongdoing,” the court papers read.\n\nAli argued the Saudi officials initially denied any involvement with Khashoggi’s disappearance but later had to acknowledge he was murdered in their embassy in Turkey after international pressure, especially from Turkish investigators.\n\nAli’s attorneys say the same officials also tortured their client, forcing him to confess to involvement with al-Qaeda. They say he was whipped and not fed.\n\nThey argue that is grounds to give their client a do-over, arguing the Khashoggi murder reveals the Saudi government committed fraud on the court and tainted the prosecution of their client more than a decade ago.\n\n“The fraud now revealed shows that Saudi actors — with the knowledge and unfortunate assent of U.S. officials — subverted the administration of justice,” the court filing said.\n\nAli was sentenced to life without parole in 2006 after a jury found him guilty of nine counts related to conspiring with al-Qaeda terrorists.\n\nHe was raised in Falls Church, Virginia, but moved to Medina, Saudi Arabia, in 2000 to study Islamic theology as a college student.\n\nHe was arrested there while taking final exams, with authorities saying he was involved with an al-Qaeda cell.\n\nHe was held without formal charges for about two years in Saudi custody before eventually being indicted in the U.S. after Saudi officials recorded his confession.\n\nScott Sundby, a law professor at the University of Miami, said the petition was a “long shot” but he acknowledged the Khashoggi case creates some “headaches” for U.S. officials, who have long denied treating interrogation subjects poorly.\n\n“It is a creative and smart motion that has some very steep legal hills to climb, but may crack open a door or two if they can get a judge to grant a hearing,” Mr. Sundby said.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "A man sentenced to life without parole for conspiring to assassinate President George W. Bush and providing support to al-Qaeda has mounted what is believed to be the first \"Khashoggi defense\" in federal court.", "authors": ["The Washington Times Http", "Alex Swoyer"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2018/12/04/124_2018_beltway-gavel8201_c0-22-1000-605_s1200x700.jpg?58d1b89a44ab697917873c90ca3569949484ee85", "published_at": "2019-10-29"}