{"pub": "dailybeast", "url": "https://thedailybeast.com/the-best-coffee-makers-on-amazon-to-consider-right-now", "downloaded_at": "2019-09-16 11:59:44.244282+00:00", "title": "The Best Coffee Makers on Amazon to Consider Right Now", "language": "en", "text": "There are lots of ways to turn coffee beans into caffeine-heavy liquid, whether you like it cold, on your schedule, French-pressed, or as espresso. With all of these styles in mind and widening our aperture to several more, we found the best-selling and top-rated ways for you to make coffee at home, conveniently available on Amazon.\n\nKeurig K-Duo Plus Coffee Maker, $230 on Amazon: Previously launched exclusively at Walmart, Keurig’s latest is a great marriage of the K-Cup universe and the drip brew. Choose your preference and keep the freedom to change your mind indefinitely. The compact and stylish design will help you fit the K-Duo anywhere and a modular water reservoir can attach on either side or in the back, to best adjust to your counter space situation.\n\nMr. Coffee Simple Brew Coffee Maker, $18 on Amazon: No bells. Few whistles. Get a machine that will make it easy to brew coffee and do so for less than $20. Its warming plate is easy to clean and the machine lets you grab a cup while it’s brewing with a special auto-pause capability because mornings sometimes demand that type of urgency.\n\nChemex Classic Series, Pour-over Glass Coffeemaker, $35 on Amazon: You’ve seen this one at your caffeine-obsessed friends’ places and coffeehouse shelves for high prices. Here it is on Amazon with hundreds of high reviews, for a much more affordable price, and delivered for free in two days (for Prime members). Coffee the more old-fashioned way and keep your coffee fresh and delicious for days afterward with Amazon’s top-selling pour-over coffee maker.\n\nNespresso Inissia by De'Longhi Original Espresso Machine, $108 on Amazon: Espresso, black (or silver, if you prefer) and simple. From programmable espresso to single-serve coffee, the machine’s designed to get brewing in less than 30 seconds. The reservoir holds enough water to cycle through nine single serves before requiring a refill, which should carry you through the week.\n\nToddy Cold Brew System, $35 on Amazon: Yes, you can cold brew at home (in many ways) and this highly-rated option allows for hot drip coffee, cold brew, and even tea. The brewing container sits atop an included glass decanter and filters beans into coffee concentrate that’s substantially less acidic than its hot brew cousins. And Toddy promises that it “stays fresh for up to 2 weeks with no change to the flavor.”\n\nNEWSLETTERS The Scouted Newsletter Product recommendations that'll make your life better and tips to help you shop smarter. Subscribe By Clicking \"Subscribe\" you agree to have read the Terms of Use and Privacy Policy\n\nMORE FROM SCOUTED:\n\nScouted is internet shopping with a pulse. Follow us on Twitter and sign up for our newsletter for even more recommendations and exclusive content. Don’t forget to check out our coupon site to find great deals from your favorite brands. Please note that if you buy something featured in one of our posts, The Daily Beast may collect a share of sales.", "description": "Whatever way you like your coffee, make it easier (and more affordable) with a coffee maker.", "authors": ["Gideon Grudo", "Commerce Editorial Strategist"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1440,w_2560,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1568392801/coffee_hero_wrmuyd", "published_at": "2019-09-16"}