{"pub": "yahoo", "url": "https://news.yahoo.com/wells-fargo-banking-jobs-automation-174719853.html", "downloaded_at": "2019-10-03 07:26:29.530610+00:00", "published_at": "2019-10-02", "title": "Robots to replace 200,000 US jobs in banking in 10 years", "language": "en", "text": "As the September jobs report looms, a recent report from Wells Fargo is casting a bleak light on the future of banking jobs.\n\nThe report revealed that robots are likely to reduce headcount by 200,000 over the next decade throughout the financial industry in the U.S. Wells Fargo’s Mike Mayo spoke to Yahoo Finance’s On The Move this week and said banks will be investing significantly in technology over the next 10 years.\n\n“The next decade should be the biggest decade for banks in technology in history. You’re about to see the biggest capital for labor swap in history,” Mayo said.\n\nMayo said automation can reduce the amount of repetitive work being done by humans, such as data input in a mortgage application.\n\n“You have a lot less errors, you need a lot less people to do it, and the customer is a lot happier too,” Mayo said.\n\nHis report notes that banks are already in the process of reducing headcount, claiming that U.S. banks have seen the largest decline in employee counts and branch locations in history.\n\nStill, Mayo says the finance industry in the U.S. spends more on tech than any other industry, about $150 billion annually. For a banking industry that has underperformed the market by 70% in this century, Mayo says the investment in technology should pay off in lower expenses over time, particularly for the larger banks.\n\n“This should lead to record efficiency and market share gains by scale players, reflecting our theme, ‘Goliath is Winning,’” Mayo wrote.\n\nAshley is a Production Assistant for Yahoo Finance. Follow her on Twitter @actuallynelson.\n\nBrian Cheung contributed to this article.\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.", "description": "As the September jobs report looms, a recent report from Wells Fargo is casting a bleak light on the future of banking jobs.", "authors": ["Ashley Nelson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/kBQyTx5YwhwJswavPtjmMw--~B/aD0zNjI2O3c9NTY0ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-10/1244df20-e53d-11e9-bff5-bb101d2b14c2"}