{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7595551/Royal-Marine-35-unleashed-drunken-foul-mouthed-tirade-Manchester-airport-staff.html", "downloaded_at": "2019-10-21 08:56:55.394767+00:00", "title": "Royal Marine, 35, unleashed drunken foul-mouthed tirade at Manchester airport staff", "language": "en", "text": "Benjamin Hoyle, 35, admitted racially aggravated threatening behaviour and other public order offences at Manchester Magistrate's (pictured leaving court)\n\nA boozed-up Royal Marine branded a Manchester airport attendant a 'fat f***ing tart in Primark shoes' when she stopped him from boarding his Ryanair flight to Ibiza.\n\nBenjamin Hoyle, 35, flew into a blistering sweary rant when he was prevented from flying from Manchester after sinking multiple beers and draining a bottle of Captain Morgan's rum from duty free.\n\nSpitting with rage, he tore into departure gate supervisor Kerry Boardman and also rounded on her Asian colleague, saying: 'You are the reason I was in Afghanistan - I was fighting you all over there.'\n\nThe reservist soldier from Birkenhead, Wirral, continued to unleash a volley of insults including 'slag', 'queer', 'b****' and 'munter' before police arrested him.\n\nBut not before Hoyle tried to plant a drunken kiss on a female passenger and told the other startled passengers: 'I'm in the marines I could f***ing take all of you out.'\n\nAt Manchester magistrates court, Hoyle admitted racially aggravated threatening behaviour and other public order offences and was ordered to complete 130 hours unpaid work as part of 12 months community order.\n\nHoyle flew into a sweary rant when he was prevented from flying from Manchester after sinking multiple beers and draining a bottle of Captain Morgan's rum from duty free\n\nThe reservist soldier (right in uniform and left on a plane), from Birkenhead, Wirral, unleashed a volley of insults including 'slag', 'queer', 'b****' and 'munter' before police arrested him\n\nThe court heard that the military man had booked a £2,000 holiday to Ibiza and was due to fly to the party island on June 19 from gate 53 at Terminal Three, Manchester Airport.\n\nYet he arrived in no fit state to fly, having drunk four cans of beer on the train, 'further pints' at the airport bar and then polishing off a bottle of rum.\n\nMs Boardman, a supervisor at the aviation services company Swissport, spotted Hoyle staggering towards the gate and swiftly moved to intercept him for being too drunk.\n\nFurious, the marine snapped back: 'What? are you f***ing kidding? What the f*** you on about, you f***ing slag?\n\n'Look at you with your Primark shoes on. I'm wanting a refund, give me a f***ing refund. I am going to get you tomorrow you f***ing b****.'\n\nAs other passengers including children watched with horror, he turned to them and said: 'I'm in the marines I could f***ing take all of you out.\n\n'Look at you at you, sat there you f***ing mugs. Let's f*** off back to Liverpool you fat f***ing b****, munter, fat f***ing tart with Primark shoes on.'\n\nHoyle tried to plant a drunken kiss on a female passenger and told the other startled passengers: 'I'm in the marines I could f***ing take all of you out'\n\nDuring his rant, Hoyle also targeted Ms Boardman's male colleague Andrew Bradley, and said: 'Look at you sat there with your f***ing wig on. You better shut the f*** up or I'm going to take you all down, you f***ing queer with a wig on.'\n\n'I could f***ing kill you all if I wanted - I fought for you, you should be ashamed.'\n\nIt is thought the unruly soldier also tried to kiss a female passenger before police arrested him.\n\nWhen he sobered up he claimed he could barely remember the incident.\n\nStephen Varle prosecuting said: 'Ms Boardman was working alongside colleagues and Mr Bradley informed her that he had observed somebody who didn't appear to be in a fit state to board the flight.\n\n'He was falling about the place as he made his way to board the flight. He asked \"is this where I get my flight?\" but she then asked him to take a seat as she didn't believe he was fit to get on board due to the level of intoxication.\n\n'She then observed a second male approaching the gate 15 metres away, stumbling and swaying.\n\n'The male was extremely intoxicated and having difficulty walking in a straight line.\n\n'She observed him for approximately 20 seconds until he arrived at the gate. He was a lot taller then her and looking down with a glazed look in his eyes and a stare like she wasn't there.\n\n'He was swaying from side to side and Ms Boardman said, \"can you move to the side you have had too much to drink\", but she observed the males and they seemed to be confused by the nature of the incident.\n\nHoyle was ordered to complete 130 hours unpaid work as part of 12 months community order\n\n'She said \"lads you are far too intoxicated to get in this flight\" but the response was \"What the f***you on about?\"\n\n'This occurred in front of other passengers including men, women and children who were happy these males would not be boarding the flight.\n\n'But Ms Boardman said this particular incident had potential to escalate and she only felt safe when the police arrived.\n\n'Mr Bradley could tell the defendant was very drunk and was going to be a problem.\n\n'Kerry repeatedly said \"I have already told you, you have been refused to fly, take a seat\" but Andrew heard \"you fat f***ing b****, munter, fat f***ing with Primark shoes on.'\n\n'He then turned to Andrew and said 'you f***ing queer with a wig on.'\n\nAnother member of staff turned up and the defendant said \"you are the reason I was in Afghanistan, I was fighting you all over there.\"\n\n'He was getting in peoples faces and the opinion from Andrew Bradley was that he tried to kiss a female passenger. He was then arrested.\n\n'There was a large number of people in the vicinity who were going holiday. It should have been pleasant and fun experience for them but this defendant made it into something quite on the contrary.'\n\nIn interview Hoyle said he arrived at the airport around 6pm had four cans of beer on the train, further pints at the airport bar and bought a 70cl bottle of Captain Morgans rum at duty free for another drink mixed with coke.\n\nHe said he sat next to the gate and joined the queues but once he got to the front he was denied access and requested his money back.\n\nIt is thought the unruly soldier also tried to kiss a female passenger before police arrested him. When he sobered up he claimed he could barely remember the incident\n\nHe said he made enquires as to what to do next but claimed staff had grinned at him.\n\nHe told officers he was '2.5 drunk' on the 1-10 scale and added: 'I would not have used those sort of words. I have homosexual friends. This doesn't seem right, I wouldn't have said that it's far fetched That's not me.'\n\nIn mitigation defence lawyer Ms Lina Tsui-Cheung said: 'He was extremely intoxicated and cannot believe he would have said such hurtful remarks.\n\n'He wishes for me to express his full and deep remorse for his actions and wishes to apologise to those particular workers at the airport and members of the public who where present. This is an extremely out of character, and isolated incident.\n\n'Mr Hoyle had made a decision to go on a weeks holiday with an old friend and they hadn't seen each other for quite sometime.\n\n'They had checked into the departure lounge and were extremely jovial because they were very excited and looking forward to holiday and that resulted in them consuming alcohol.\n\n'He had spent a significant amount of money and became irate as he was refused admission. He was asking for a refund and remembered heightens state of becoming more irate at standing to lose a significant amount of money.\n\n'All in all over the holiday cost him £2,000. He felt goaded because the staff were smirking and laughing.'\n\n'He served in the army for seven years and has been serving with the marines for the past year in the reserves whilst awaiting final course completion before being referred to full service.\n\n'To his credit has abstained from alcohol since and made efforts in trying to address any difficulties that may have arisen of of this incident. He has an extremely good career and a good future in relation to the marines, fighting for our country.'\n\nHoyle was also ordered to pay £135 in costs and surcharges.", "description": "Benjamin Hoyle, 35, flew into a sweary rant when he was prevented from flying from Manchester after sinking multiple beers and draining a bottle of Captain Morgan's rum from duty free.", "authors": ["Jack Elsom For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/09/19980240-0-image-a-2_1571645123305.jpg", "published_at": "2019-10-21"}