{"pub": "politico", "url": "https://politico.com/story/2019/09/18/ilhan-omar-trump-twitter-9-11-1501933", "downloaded_at": "2019-09-18 23:22:21.225209+00:00", "title": "Ilhan Omar urges Twitter to take down Trump's false tweet", "language": "en", "text": "Rep. Ilhan Omar | Zach Gibson/Getty Images Congress Ilhan Omar urges Twitter to take down Trump's false tweet\n\nRep. Ilhan Omar (D-Minn.) today called on Twitter to take action against President Donald Trump’s account and remove a tweet in which he shared a false claim that Omar had “partied” on the anniversary of the Sept. 11 terrorist attacks.\n\n“They have a responsibility and they set community standards and clearly the president has shown many-a-times that he has violated their community standards,” she told POLITICO. “I don't even know why his account is not fully suspended — why he's not deplatformed.”\n\nStory Continued Below\n\nOmar said her staff has contacted Twitter regarding the president’s post, which echoed Trump’s repeated, debunked claims that American Muslims celebrated the attacks.\n\nTrump today shared a tweet by conservative actor and comedian Terrence Williams that erroneously claimed Omar was out dancing on the anniversary of 9/11. “IIhan Omar, a member of AOC Plus 3, will win us the Great State of Minnesota. The new face of the Democrat Party!” Trump wrote in a caption.\n\nIn fact, the video accompanying the tweet of Omar dancing was from a Sept. 13 Congressional Black Caucus event. Omar later rebuked the president for his rhetoric and Twitter for failing to take down the post. “The President of the United States is continuing to spread lies that put my life at risk. What is Twitter doing to combat this misinformation?” she tweeted.\n\nA Twitter spokesperson confirmed Williams has deleted his tweet, but the company did not comment on the president's post. Omar told POLITICO she's \"still getting threats\" because of Trump's retweet.", "description": "Trump shared a tweet that erroneously claimed Omar was out dancing on the anniversary of 9/11.", "authors": ["Cristiano Lima"], "top_image": "https://static.politico.com/15/66/84ece6784666b68794a93a779617/190918-omar-getty-773.jpg", "published_at": "2019-09-18"}