{"pub": "cbs", "url": "https://cbsnews.com/news/bahamas-tropical-storm-humberto-threatens-islands-after-hurricane-dorian-track-path-latest-updates-2019-09-14", "downloaded_at": "2019-09-15 00:13:57.723671+00:00", "title": "Tropical storm warning lifted for weary Bahamas", "language": "en", "text": "A tropical storm warning has been lifted for the Bahamas as the islands try to recover from the devastation from Hurricane Dorian. The new storm, Tropical Storm Humberto, is expected to become a hurricane by Sunday night, although the National Hurricane Center predicts the storm will take a sharp turn northeast away from coastal Florida.\n\nAs of 5 p.m. ET Saturday, Humberto was located 70 miles north of Great Abaco Island, with maximum sustained winds of 50 mph.\n\nU.N. Secretary General António Guterres toured the devastation from Dorian on Abaco Island on Saturday. He said he was \"horrified\" at what he saw.\n\n\"I've never seen such a level of systematic devastation,\" Guterres said. \"Hurricane Dorian has been classified as Category Five. I think it's category hell.\"\n\nGuterres said the U.N. would be coordinating with the government of the Bahamas.\n\nA group organized by retired Navy Seals and the conservation group Sea Shepherd has been loading up supplies to send to remote islands that may be impacted by the approaching storm. When CBS News caught up with them, the group had four tons of essentials — food, water and generators — it had loaded onto a ship.\n\nResidents are doing whatever they can to prepare. With few boats intact, locals are shuttling them to the few dozen people who remain. \"I mean, we really don't need another hurricane. As you can see, we don't need another one. But we just have to prepare,\" Sinetra Higgs told CBS News.\n\nThis image shows the trajectory of Tropical Storm Humberto on September 14, 2019. National Hurricane Center\n\nHurricane Dorian devastated the northern Bahamas. Entire neighborhoods were flattened, homes shredded, shipping containers and boats hurled inland. Some airports were submerged, while terminals were covered in debris.\n\nSome residents remain frustrated at the government's response, especially with another storm on the way. Many residents said that the only assistance they've gotten came from foreigners — and that they're still living without cell service, power and running water.\n\nThe Bahamian government said it's coordinating relief efforts from Nassau. But since most of the field teams come from private foreign aid groups, that's all the residents in hard-hit communities see.\n\nErrol Barnett contributed to this report.", "description": "The storm will likely take a sharp turn northeast away from coastal Florida", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/09/14/c110a176-41f8-4469-9e93-56ed3c35d083/thumbnail/1200x630/153267e3aa313a1120a7bbd38c6b5241/screen-shot-2019-09-14-at-3-13-12-pm.png", "published_at": "2019-09-14"}