{"pub": "huffpost", "url": "https://huffpost.com/entry/moderate-democrats-avoid-impeachment-backlash-so-far_n_5d9571cde4b0f5bf796f42b4", "downloaded_at": "2019-10-03 10:47:55.477018+00:00", "published_at": "2019-10-03", "title": "Moderate Democrats Avoid Impeachment Backlash So Far", "language": "en", "text": "STATEN ISLAND, N.Y. ― If moderate House Democrats are going to face a ferocious Republican backlash for supporting an impeachment investigation into President Donald Trump, it hasn’t started just yet.\n\nAt swing district town halls here and in the Lehigh Valley of Pennsylvania, two first-term Democrats, Reps. Max Rose of New York and Susan Wild of Pennsylvania, saw their newfound support for an impeachment inquiry met mostly with applause. Both are the type of moderates that Republicans have sworn would pay a steep political price for backing impeachment.\n\nTheir warm receptions show how rapidly the perceived politics of an impeachment inquiry are changing. Though Democrats long feared impeaching the president would gin up Trump’s fiercely conservative base voters and overshadow the party’s focus on health care and the economy, tightly crafted to appeal to swing voters. Instead, many Democratic operatives are increasingly seeing an impeachment inquiry as politically neutral.\n\nFor instance, Priorities USA ― the largest Democratic super-PAC and a longtime advocate of the idea Democrats should remain focused on economic issues ― released polling this week aimed at showing “major warning signs for the GOP” on impeachment. The poll, conducted by Civis Analytics, found 45% of likely 2020 voters support impeachment, while 40% oppose it. (The poll is broadly in line with other recent public polling, though.)\n\nAndrew Kelly / Reuters Rep. Max Rose (D-N.Y.) meets the press following a town hall where he announced his support for an impeachment inquiry into President Donald Trump.\n\nRose, a military veteran and proud member of the centrist Blue Dog Coalition, unseated Republican Rep. Dan Donovan in November in a district that Trump won by nearly 10 percentage points in 2016. Until Wednesday evening, he had been one of just 11 House Democrats resisting coming out in favor of the impeachment inquiry.\n\nSpeaking to over 100 constituents at the Jewish Community Center of Staten Island on Wednesday, however, Rose revealed that Trump administration officials’ obstructionist attitude toward investigations of alleged misconduct had pushed him over the edge.\n\n“Instead of allaying our concerns, the president and his administration have poured gasoline on the fire. The American people have a right to know if their president used the power of his or her office to get a foreign power to interfere in our elections,” he said, eliciting applause from the audience.\n\nOn its face, Rose’s decision to embrace the impeachment inquiry in a district where Trump won by a larger margin than he did carries clear risk.\n\nBut Rose was facing Republican attacks for effectively supporting impeachment even before he had staked out a stance on the matter.\n\nThe Republican National Committee already began blasting him at the end of September as part of a $2 million ad campaign targeting Rose and other vulnerable House Democrats.\n\n“Instead of working to create more jobs, Rose wants more hearings,” the narrator of the RNC ad says as images of more liberal Democrats, such as Sen. Elizabeth Warren of Massachusetts and Rep. Alexandria Ocasio-Cortez of New York, appear on-screen.\n\nThis is just the beginning of an all-out fight to defend our democracy & our president.\n\n\n\nDozens of House Dems campaigned on working with @realDonaldTrump, yet fell in line with Pelosi & the Squad.\n\n\n\nVoters don't support this impeachment charade & it’s going to backfire come 2020! pic.twitter.com/fcb9Uvfvca — Ronna McDaniel (@GOPChairwoman) September 27, 2019\n\nNicole Malliotakis, the Republican New York Assemblywoman who has launched a bid to unseat Rose, nonetheless showcased how attacks against him could intensify now.\n\nRose, she tweeted, “tonight announced that he caved to Pelosi, AOC & socialist squad after saying he didn’t support impeachment.”\n\nSpeaking to reporters after the town hall, Rose, employing the sort of bravado native to his corner of New York, insisted that the attacks from Malliotakis and other Republicans did not frighten him.\n\n“I am not concerned at all by [House Republicans’ campaign arm] or anyone that wants to try and challenge me because they already tried once, and we kicked their ass,” he boasted, referring to his 2018 victory. “And guess what: That’s exactly what is going to happen again. They have been absolute jokes. They will continue to be jokes. And I look forward to beating them by an incredible margin.”\n\nAt the same time, Rose went out of his way during the town hall to distance himself from Ocasio-Cortez and other left-leaning Democrats whom Republicans have turned into a political cudgel against moderates like Rose.\n\n“On the one hand, we have Democrats who, before they have sworn the oath of office, want to impeach the president of the United States,” he said, making what appeared to be a veiled reference to comments by Rep. Rashida Tlaib of Michigan, a member of the group of progressive congresswomen known as “the Squad.” “On the other side, though, we have Republicans who swore the same oath that I did, but suddenly they become deaf, mute and blind whenever allegations against the president come up. That’s an even greater threat to our democracy.”\n\n(Wild, similarly, used a voter’s question to note she had worked to be a “sounding board and educator” after Omar and Tlaib made comments some considered anti-Semitic.)\n\nOn the campus of Muhlenberg College, Wild faced questions about improving public education, “Medicare for All” and climate change before a voter asked why she was more focused on impeachment than on improving schools in the area.\n\n“It’s a mistake to think that those of us in Washington are spending all of our time on impeachment,” she told the crowd of roughly 250 people.\n\nThe audience at the event was mostly on the side of Wild, who won her seat in this manufacturing-heavy area by 10 percentage points in 2018. Questioners who pressed her on impeachment were met with boos, while a voter who suggested House Intelligence Committee Chair Adam Schiff jail uncooperative Trump officials received applause. Before the event, Wild told reporters that phone calls to her office were running 85% in favor of impeachment or an impeachment inquiry.\n\nBill Clark via Getty Images Rep. Susan Wild talks with constituents following a town hall meeting at Muhlenberg College in Allentown, Pennsylvania. The crowd was largely supportive of her decision to back an impeachment inquiry.\n\nWild, who had opposed an impeachment inquiry until revelations about Trump pressuring Ukranian President Volodymyr Zelensky to reopen an investigation into Vice President Joe Biden’s son, said she felt “the administration left us no choice” but to back impeachment. And, she said, voters were behind them.\n\n“I think the issue of the Ukraine phone call is sufficiently troubling. And we’ve seen what the polls have done this week,” she told reporters, later adding that she wanted to keep the inquiry focused narrowly on Ukraine and avoid re-litigating special counsel Robert Mueller’s report into Russian interference in the 2016 election. “This was a single, discrete event that was very easy for people to understand.”\n\nWild’s focus on polling is telling. Many Democrats have been privately surprised at how well the issue polls after months of surveys showing a majority of American voters opposed to any effort to remove Trump from office. But polling on a fast-developing issue is tricky, and impeachment could still turn sour for Democrats. Republicans boast that the issue will fire up their base, and Trump’s reelection campaign said it raised more than $15 million in the days after Democrats began more solid moves toward impeachment proceedings.\n\nEven with an impeachment inquiry looming, Rose and Wild were happy to highlight their work on other issues ― and their constituencies were happy to discuss them.\n\nRose, whose town hall was devoted to transportation and commuter concerns, relished getting into the policy details on expanding bus and ferry routes. He touted his collaboration with Republican lawmakers on efforts to protect Staten Island commuters from toll hikes on the Verrazzano Bridge into Brooklyn. And he even welcomed the unlikely prospect of a federal, bipartisan infrastructure bill.\n\n“Nothing, nothing at all ― impeachment or otherwise ― will distract … me from my work fighting for you,” he declared.\n\nEven conservatives at Wild’s town hall weren’t focused on impeachment, instead asking what she was doing to help Trump combat China and about Hillary Clinton’s use of a private email server while secretary of state. Several liberal questioners focused on climate change, and others focused on education. Wild said the high cost of prescription drugs was the “number one issue” in the district.\n\n“I believe that I will get reelected on the basis of the work that I’ve done for the district and not on how this impeachment issue goes one way or another,” she told reporters.", "description": "At town halls in swing districts, there’s little evidence of broad anger from constituents.", "authors": ["Senior Political Reporter", "Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d9572aa2200008c01dc8e91.jpeg?cache=cmd4v0x44h&ops=1778_1000"}