{"pub": "businessinsider", "url": "https://businessinsider.my/les-amis-and-odette-are-singapores-new-three-michelin-star-restaurants", "downloaded_at": "2019-09-18 07:26:36.045903+00:00", "title": "Les Amis and Odette are Singapore’s new three-Michelin star restaurants", "language": "en", "text": "Four-year-old French restaurant Odette also nabbed the award for best restaurant in Asia this year. Odette\n\nWhen chef Joel Robuchon closed his Sentosa restaurant last year, Singapore was left without a three-Michelin-star establishment.\n\nRead also: Joel Robuchon dead at 73 – he was the world’s most Michelin-starred chef and mentored Gordon Ramsay\n\nThis year, however, there’s a bumper crop of two: French restaurants Les Amis and Odette, the Michelin Guide announced on Tuesday (Sept 17).\n\nBoth restaurants scored two Michelin stars last year.\n\nThis is the largest number of three-starred restaurants in Singapore since the Michelin Guide was established here in 2016.\n\nMichelin said that both restaurants had outstanding cuisine, the ability to evaluate and promote exceptional tables, and a “deep respect for the terroir and its products”.\n\nThe French word refers to the unique taste that a region’s soil, climate and sunlight give its wine.\n\nOdette – which is named after head chef Julien Royer’s grandmother – boasts a “discreet and intimate setting as elegant as the setting of the plates,” Michelin said.\n\nIt added that the food featured international flavors, subtle Asian touches and highly-mastered French techniques. Opened in 2015 and currently located in the National Gallery Singapore, the restaurant also snagged the title of Asia’s best restaurant earlier in March.\n\nChef Royer said the three-star rating was “beyond incredible”, given that the restaurant was barely four years old. “We’re truly humbled. This accolade is of course a celebration of the people behind Odette and deeply appreciated as affirmation of our hard work,” he added.\n\nMeanwhile, the French-inspired contemporary cuisine from Les Amis – which opened in 1994 – paid “impressive attention to the smallest detail” and elevated its high-quality produce.\n\nIts wine list of over 3,000 references was considered “one of the most dazzling in the Asian continent”, Michelin added.\n\nMichelin Guide International Director Gwendal Poullennec said that the two restaurants would “clearly position” Singapore as a gastronomic destination.\n\n“Getting a three-star is always a singular moment in a chef’s life, and I am convinced that’s the same feeling for a city or a country,” she added.\n\nThis year’s list also featured five two-Michelin star restaurants and 37 one-star restaurants, including two hawker stalls: Hill Street Tai Hwa Pork Noodle and Hawker Chan Soya Sauce Chicken Rice & Noodle.\n\nHere’s all the restaurants on the list:\n\nThree Michelin stars: Odette Les Amis Two Michelin stars: Saint Pierre Shisen Hanten Shoukouwa Waku Ghin Zén One Michelin star: Alma Basque Kitchen by Aitor Béni Braci Buona Terra Burnt Ends Candlenut Cheek Bistro Chef Kang’s Corner House Cut Garibaldi Hawker Chan Hill Street Tai Hwa Pork Noodle Iggy’s Imperial Treasure Fine Teochew Cuisine (Orchard) Jaan by Kirk Westaway Jag Jiang-Nan Chun Labyrinth Lei Garden Lerouy Ma Cuisine Meta Nouri Putien (Kitchener Road) Rhubarb Shinji (Bras Basah Road) Shinji (Tanglin Road) Summer Palace Summer Pavilion Sushi Ichi Sushi Kimura Table65 Terra The Song of Indi Vianney Massot\n\nRead also:", "description": "Business Insider - Time to save up!. Read more at businessinsider.my", "authors": ["Rachel Genevieve Chia"], "top_image": "https://static.businessinsider.my/sites/3/2019/03/20190327-Odette.png", "published_at": "2019-09-18"}