{"pub": "nymag", "url": "https://thecut.com/article/comme-si-jenni-lee-skin-care-routine.html", "downloaded_at": "2019-09-17 23:26:01.826265+00:00", "title": "How This Sock Designer Gets Her Skin So Good", "language": "en", "text": "Do you ever see someone on Instagram and think, Why is your skin so good? We do, so we started asking. Welcome to Why Is Your Skin So Good. Photo: Courtesy of Jenni Lee\n\nWant more skin care? Join our Facebook Group, the Beauty of It All.\n\nJenni Lee, the founder and designer behind luxury sock brand Comme Si, recognizes that she’s lucky not to have any “serious skin-care issues” but still deals with dryness and cystic acne. She turns to COSRX acne patches to treat those pesky areas, but the rest of her routine is inspired by her mom. “For my 14th birthday, my mom gifted me a Clarins set that included separate creams for day and night, and a toner,” says Lee. “I had grown up watching her religiously adhere to the now-popular multistep Korean skin-care routine.”\n\nShe also learned to wash her face every single night, a lesson she never forgot after her mom told her that going to bed with makeup and “daytime gunk” would make her age three times as fast. It’s a different story in the morning, when she uses only water to cleanse. “A beauty expert told me that when you wake up you have a lot of great natural oils on your face,” she explains, “and you shouldn’t strip that all away with a cleanser, especially if you went to bed with good products on your skin.”\n\nRead on for Lee’s extensive routine, including the skin butter that keeps away dryness and the retinol that gave her results in a week.\n\nNeutrogena Makeup Remover Cleansing Towelettes Twin-Pack “The first step in my nightly cleansing routine. I use these out of pure convenience; I’ve become addicted to how easy it is to remove makeup with them. On days that I don’t wear makeup, I’ll skip this step.” $13 for 2 at Ulta Beauty Buy\n\nThen I Met You Cleansing Duo “I was introduced to this product by my friend Charlotte, who started the brand. I have always been a fan of the double cleanse, so this was a natural product to add to my routine. The first step is an oil-based cleanser, and the second is a water-based cleanser. I love the texture of the balm, which has ingredients like seaberry oil, grape-seed oil, and olive oil in it. “In the past, I would double-cleanse by choosing two different cleansers myself. I really like that these come in a set, each with a specific purpose. The first is meant to remove oil-based stuff that’s on your face, like sunscreen and makeup, and the second removes water-based impurities, like sweat and grime. What I like most about these cleansers is that my face doesn’t feel like it’s completely stripped and raw, which a lot of cleansers do. Even though there are two steps, my skin still feels soft and supple.” $68 at Then I Met You Buy\n\nThayers Alcohol-Free Rose Petal Witch Hazel Facial Mist Toner $11 (was $12, now 8% off) “I love a spray-on toner, and Thayers is such a great drugstore find. This one contains rose petal, aloe vera, and witch hazel — the combination of which smells amazing, like getting a whiff of a bouquet of roses. It’s not overly scented, just a subtle hint. I spray this onto a clean face, and I also carry a travel-size bottle in my purse to refresh throughout the day.” $11 at Amazon Buy $11 at Amazon Buy\n\nSulwhasoo Concentrated Ginseng Renewing Serum “This is the serum I use during the day. I watched my mom use Sulhwasoo products for years, and she has that enviable ‘glass’ skin, so naturally I have an affinity for it. I remember using some of my mom’s products when I was younger and her saying that I didn’t need to use them because they were for anti-aging. I’m now at a stage where I’m testing some anti-aging products for preventative reasons. This serum has ginseng oil in it, which helps provide moisture and elasticity. I love the smell of ginseng — it’s earthy and herbal and reminds me of my mom. I find that it helps improve resilience; my skin is more supple and has more bounce. I’ve also noticed that my skin has a natural glow and a more refined texture. The serum is gel-like and has visible ‘bubbles’ of ginseng oil, which melt immediately on the skin when you apply.” $205 at Nordstrom Buy\n\nSunday Riley A+ High-Dose Retinoid Serum “This is the serum I use at night. It’s a stabilized retinoid product, meaning it’s more effective and less harsh than other retinoid products out there. To get scientific, the active ingredient that our skin cells react to is called retinoic acid, the purest form of which is available in prescription topicals — which are effective but also pretty harsh on the skin. Retinols are a derivative of retinoic acid (and much less harsh), but your skin has to convert it into retinoic acid through metabolization for it to have an effect. Hydroxypinacolone retinoate (HPR), which is in this serum, is a retinoic acid ester, which means it does not need to be converted. It’s interpreted by the skin cells just like retinoic acid. It has botanical ingredients like algae, cactus, and Hawaiian white honey, so you get the benefits without the traditional drawbacks of a retinol product. “I didn’t notice any side effects when I started using this, but you need to test it on a patch of your skin because it might not be suitable for all skin types. Since using this serum, my skin literally feels like a baby’s bottom. I noticed a difference in my complexion and the texture of my skin after a week. I would describe the results being similar to how my skin feels after a facial: refreshed and like porcelain.” $85 at Sephora Buy\n\nVijuve Anti-Aging Face Massager “I was originally looking for a face massager because I clench my jaw when I sleep and wanted to help relax and massage my jawline. I now love using this for dual functions: massaging and helping my skin absorb serum better. The massaging stimulates blood circulation. My face gets a little rosy when I’m using it, which helps absorb product better. I always use this in an upward motion and use it day and night.” $80 at Amazon Buy $80 at Amazon Buy\n\nSulwhasoo Bloomstay Vitalizing Water “I use this after applying a serum. This product really helps lock moisture in the skin. It’s a water-based product with a high concentration of plant extracts (plum blossom and Korean yuja), which are high in antioxidants and help soften and hydrate the skin. The texture is a little like slimy water but not in a gross way. “Sometimes I’ll switch this step for an essence, which goes on before serum to help absorb it. My skin is naturally dry, so I need to make an effort to use products that provide as much hydration as possible. I grew up watching my mom ‘pat’ (i.e., gently slap) her skin with essence and hydrating water formulas like this one. I remember thinking it was excessive at the time, but now I swear by the patting application. Similar to the face massager, patting helps stimulate blood circulation. With water-based formulas, it’s easy for the product to evaporate off your face versus actually delivering into your skin. By patting, I help my skin absorb the water for better results.” $75 at Nordstrom Buy\n\nSulwhasoo Bloomstay Vitalizing Cream “This is the cream I use during the day. Another Sulhwasoo product from the Bloomstay line, which is made from anti-oxidant-rich green plum blossom. It helps promote radiant and resilient skin. The texture is supersoft and light, which I love because I hate wearing heavy creams, especially during warmer months. The smell is also great — bright, floral, citrusy. I’ve gotten so used to the scent that it’s become a part of my ritual. It wakes me up.” $155 at Nordstrom Buy\n\nAHC Ageless Real Eye Cream For Face “My mom got this for me on her last trip to Korea. I always use a separate cream for under my eyes because the skin under our eyes is more sensitive and thinner than the rest of the face. This brand has a wide selection of eye creams that are actually designed to be used for the whole face. Since most eye creams have a higher concentration of anti-aging properties and ingredients, the idea is to apply this everywhere. I only use this under my eyes and on my laugh lines, areas where I am conscious about wrinkles or dullness.” $28 at Amazon Buy $28 at Amazon Buy\n\nVitruvi Organic Jojoba Oil “My friend Sara is the founder of Vitruvi, an essential-oils brand based in Vancouver. They have an entire selection of organic oils that you can mix and match to create your own skin-care regimen. I am using the organic jojoba oil because it has vitamin E and omegas. It’s great for overall radiance and also absorbs easily so it doesn’t feel too heavy on your skin. I use this as the last step of my skin-care regime day and night. I’ll alternate between using this oil or the Sunday Riley Superfood Oil, but I use just one oil at a time. “A reminder: Oil is not the enemy of oily skin! I used to hate facial oils because I thought they made my face more oily, not realizing that an oily face is the result of dehydration. Your skin overcompensates for the dryness by creating oil.” $18 at Vitruvi Buy\n\nLaneige Lip Sleeping Mask “I started using this as a travel must-have on planes, since you need extra moisture and protection. Now I use it every night and sometimes during the day as an extra-strength lip balm. I love that this doesn’t come off easily like most other lip balms.” $20 at Sephora Buy\n\nCocokind Skin Butter “My friend Priscilla is the founder of Cocokind, and I’ve been trying their skin-care and makeup products. I love their products because they are completely natural. This one contains coconut oil, shea butter, beeswax, and lavender. A lot of people forget to take care of other areas of their skin, like their hands, elbows, knees, feet. For anti-aging purposes, I always make sure to moisturize those areas, especially at night. This is the first coconut-oil product I’ve tried. I lotion my body religiously every day, but there are areas of my skin that always seem to get dry, especially overnight with drying factors like air conditioners in the summer and heaters in the winter. I like that this skin butter prevents dryness and almost works like a mask, like a barrier to dryness.” $14 at Cocokind Buy\n\nIf you buy something through our links, New York may earn an affiliate commission.\n\nStay in touch. Get the Cut newsletter delivered daily Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.", "description": "In this ‘Why Is Your Skin So Good,’ Comme Si founder Jenni Lee explains her skin-care routine, which includes a skin butter that acts like a “barrier to dryness” and a retinol that gave her results in a week.", "authors": ["Daise Bedolla"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/11/wiyssg-jenni-lee/jenni-lee.w1200.h630.jpg", "published_at": "2019-09-17"}