{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/16/ilhan-omar-reaffirms-support-for-peaceful-bds-move", "downloaded_at": "2019-09-16 23:13:54.795337+00:00", "title": "Rep. Ilhan Omar reaffirms support for 'peaceful' BDS movement", "language": "en", "text": "Rep. Ilhan Omar on Sunday reaffirmed her support for the controversial Boycott, Divestment and Sanctions movement against Israel, explaining that it allows people to demand justice from the country in a peaceful way.\n\nAppearing on CBS’s “Face The Nation,” Ms. Omar was asked by host Margaret Brennan whether she stood by her earlier calls for a boycott against Israel.\n\n“I think what is really important is for people to understand that you have to give people the opportunity to seek the kind of justice they want in a peaceful way,” the Minnesota Democrat answered. “And I think the opportunity to boycott, divest, sanction is the kind of pressure that leads to that peaceful process.”\n\nMs. Omar and fellow Squad member Rep. Rashida Tlaib were recently banned from visiting Israel over their support for the pro-Palestinian BDS movement. Israeli Prime Minister Benjamin Netanyahu explained at the time that the congresswomen only sought to damage the country.\n\nMs. Omar said Sunday that she hopes Israelis make a different decision when it comes to a Tuesday election, citing Mr. Netanyahu’s recent announcement that he would to annex territory in the Jordan Valley.\n\n“I certainly hope that the people of Israel make a different decision,” she said. “And my hope is that they recognize that his existence, his policies, his rhetoric really is contradictory to the peace that we are all hoping that that region receives and receives soon.\n\n“Just right now if you look at the annexation that’s taking place, for many of us in Congress there has been longstanding support for its two-state solution, and this annexation now is going to make sure that that peace process does not happen, and we will not get to a two-state solution,” she said.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Rep. Ilhan Omar on Sunday reaffirmed her support for the controversial Boycott, Divestment and Sanctions movement against Israel, explaining that it allows people to demand justice from the country in a peaceful way.", "authors": ["The Washington Times Http", "Jessica Chasmar"], "top_image": "", "published_at": "2019-09-16"}