{"pub": "mirror", "url": "https://mirror.co.uk/sport/other-sports/mma/conor-mcgregors-next-opponent-been-20566639", "downloaded_at": "2019-10-12 17:06:41.135440+00:00", "title": "Conor McGregor's next opponent has been identified by the UFC", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nConor McGregor will fight Justin Gaethje on his return to the UFC if the promotion has its way.\n\nThe Irishman has not fought since he was choked out by lightweight champion Khabib Nurmagomedov last October.\n\nBut he has stepped up his training in recent weeks and is plotting a return in early 2020.\n\nGaethje and Dustin Poirier have been named as McGregor's most likely opponents but the former's manager Ali Abdelaziz said this week: “They want him to fight Justin.”\n\nMeanwhile, Gaethje, who stopped Donald Cerrone in his last fight, has branded McGregor \"a coward\" for calling out Frankie Edgar and ignoring him.\n\n\"Conor keeps saying he is going to fight but I don’t think that’s true. But if he doesn’t want to fight he’s calling out the likes of Frankie Edgar,\" Gaethje told ESPN.\n\n(Image: SIPA USA/PA Images)\n\n\"No disrespect to Frankie Edgar but he’s 30 pounds lighter than us and that’s a coward move.\n\n\"The man is a coward deep down. I know that, he knows that, some of us know that. And if I fight him I get to show the world that, and that’s what he doesn't want.\"\n\nMcGregor is desperate to earn a rematch with Nurmagomedov but must first plot a route back into title contention.\n\nBut Gaethje has been left unimpressed by the Dubliner.\n\n(Image: Zuffa LLC via Getty Images)\n\n\"He keeps tweeting he’s gonna fight,\" said the American in an interview with TMZ Sports .\n\n\"I wrote him a message like f**king seven months ago just trying to be his friend.\n\n\"I’ve tried every route. I’m trying reverse psychology. I’m trying to be his friend.\n\n\"I’m trying every f**king route that there is to draw this man out and I can't draw him out.\"", "description": "McGregor has not fought since he was choked out by Khabib Nurmagomedov last October", "authors": ["Martin Domin", "Image", "Sipa Usa Pa Images", "Zuffa Llc Via Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20225987.ece/ALTERNATES/s1200/0_FILE-Conor-McGregor-Retires-From-MMA.jpg", "published_at": "2019-10-12"}