{"pub": "breitbart", "url": "https://breitbart.com/news/looming-pilot-shortage-lifts-aviation-schools", "downloaded_at": "2019-10-29 14:01:39.947441+00:00", "title": "Looming pilot shortage lifts aviation schools", "language": "en", "text": "DAYTONA BEACH, Fla., Oct. 29 (UPI) — A good economy, record levels of air travel and baby-boomer retirement are fueling record enrollment at aviation and aerospace schools around the nation.\n\nThe surge comes largely as a response to warnings from the air travel industry of looming global shortages for pilots and in those in related jobs. After the Sept. 11, 2001, terror attacks, pilots faced almost impossible odds of being hired at a major airline. Now some of them are being offered guaranteed jobs before they graduate.\n\nBoeing’s official pilot outlook for 2019 predicts that 804,000 new civil pilots will be need to fly its global fleet over the next 20 years, stemming from a mix of growth and retirements and other attrition. Boeing said the Asia Pacific region will lead worldwide growth in that pilot demand.\n\nUnited Airlines announced earlier this month that it expects half of its 12,500 pilots to retire in the next decade, and that it will hire 10,000 pilots during that period. United is one of several airlines offering so-called pathway programs, providing perks to some students who commit to working for them upon graduation.\n\nDelta Airlines office confirmed that it expects to hire more than 8,000 new pilots over the next decade, as many of its 13,000 pilots retire at the federally mandated age of 65.\n\nAccording to the U.S. Bureau of Labor Statistics, airline and commercial pilot demand is projected to grow 6 percent over 10 years. “Most job opportunities will arise from the need to replace pilots who leave the occupation,” the bureau said in its report on the industry.\n\nThe result will be increasing competition at the best flight schools and a lot of fresh, young faces in the cockpit and much better pay, said Kenneth Byrnes, chairman of flight training at Embry-Riddle Aeronautical University in Daytona Beach, Fla .\n\n“Right now, it’s the best time ever to be a pilot,” Byrnes said. “They know the sooner they graduate, the sooner they fly, and the sooner they can hit maximum salary in their career.”\n\nEmbry-Riddle’s Florida campus has had record numbers of freshmen for the past six years. This year’s incoming class at the nation’s largest university dedicated to aviation is 1,950 students, boosting total enrollment to about 7,000. That’s an increase of almost 300 students, or 18 percent, over last year.\n\nEmbry-Riddle says flight students can complete schooling in three years, and estimates that students can expect to pay $40,000 to $60,000 during that time to acquire required ratings. That’s on top of tuition, fees and books that run about $40,000 per year, although there are some differences depending on scholarships, in-state status and other variables.\n\nInternational demand for pilots also is showing up at Embry-Riddle, where 13.2 percent of the student body is international at the Daytona Beach campus and 6.5 percent is international at the school’s Prescott, Ariz., campus.\n\nThe Arizona campus also had its largest-ever incoming class this year with 850 new students, a 23 percent increase over 2018.\n\nOther flight schools from Ohio to California also are seeing surges in enrollment.\n\n“We are definitely feeling the crunch,” said Brian Strzempkowski, assistant director at Ohio State University’s Center for Aviation Studies. “Our flight school is completely full and we have a wait list.”\n\nEnrollment at the center rose by 100 students this year to 350 total, Strzempkowski said. Ohio State has raised pay for its flight instructors — usually recent graduates who need a few more hours of flight time to become a commercial pilot.\n\n“It’s getting harder to keep instructors around,” Strzempkowski said. “We’re looking at giving them full salary and benefits now, and other options.”\n\nSmaller aviation schools also are seeing a spike, said Fred Barez, chair of the aviation and technology department at San Jose State University in the Bay Area of California.\n\n“Our freshman class in aviation is the largest ever with 88 students, and 75 want to be pilots,” Barez said.\n\nWhile guaranteed jobs are real, criteria for admission to the best-known schools is rising. Embry-Riddle reported the highest academic achievement for its incoming freshmen, with an average grade-point average of 3.79 and average SAT score of 1,236.\n\nEmbry-Riddle said it only admitted 59 percent of applicants this year, compared with 71 percent and 70 percent in 2017 and 2018, respectively. Five years ago, the acceptance rate was about 80 percent.\n\n“That is a significant change, and we’re seeing a rapid growth in applications still,” said BJ Adams, dean of enrollment management in Daytona Beach. “We’ve got about 1,000 more applications at this time than we did two years ago.”\n\nThe demand for pilots is a major reason William Lackey, 19, from Maryland, pursues his aviation degree and pilot license at Embry-Riddle in Daytona Beach.\n\n“I kinda always wanted to be a pilot, but I know now everything is growing and they don’t have enough pilots to keep up with demand,” said Lackey, now in his second year.\n\nHe’s already done his first solo flight. He’s planning to become an instructor and then move to a commercial airline as soon as possible.\n\nEmbry-Riddle’s campus has doubled in size with gleaming new classroom buildings and a new student center. Its flight deck adjacent to Daytona Beach International Airport is completely full of planes — Cessna 172 Skyhawks and Diamond DA42s.\n\n“People are really getting interested in aviation as a career again,” said Mike Wiggins, chair of aeronautical science at Embry-Riddle, who has been at the school for more than 40 years. “It’s regaining the cachet it once had.”\n\nAbout six years ago, Wiggins said, entry-level pilots in the United States could expect only about $30,000 for a starting salary from flight schools or regional airlines. Now, starting pay is about $45,000, sometimes with bonuses that could bring that to $60,000, he said.\n\nAccording to the Bureau of Labor Statistics, the median salary for commercial pilots was $82,240 in 2018. The lowest 10 percent earned less than $44,660, and the highest 10 percent earned more than $160,480.", "description": "DAYTONA BEACH, Fla., Oct. 29 (UPI) — A good economy, record levels of air travel and baby-boomer retirement are fueling record enrollment at", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-29"}