{"pub": "cnbc", "url": "https://cnbc.com/2019/10/04/hong-kong-weighs-banning-face-masks-enacting-emergency-laws.html", "downloaded_at": "2019-10-04 02:34:55.343162+00:00", "title": "Hong Kong weighs banning face masks, enacting emergency laws as it struggles to contain violence", "language": "en", "text": "Protesters cover their faces to conceal their identity as they retreat away from riot police during the demonstration. Aidan Marzo | SOPA Images | LightRocket | Getty Images\n\nHong Kong's government is expected to discuss sweeping emergency laws on Friday that would include banning face masks at protests, two sources told Reuters, as the Chinese-ruled territory grapples with an escalating cycle of violence. Authorities have already loosened guidelines on the use of force by police, according to documents seen by Reuters on Thursday, as they struggle to stamp out anti-government protests that have rocked Hong Kong for nearly four months. The loosening of restrictions on the use of force by police came into effect just before some of the most violent turmoil yet at protests on Tuesday, when a teenaged secondary school student was shot by an officer in the chest and wounded — the first time a demonstrator had been hit by live fire. More than 100 people were wounded, after police fired about 1,400 rounds of tear gas, 900 rubber bullets and six live rounds as protesters threw petrol bombs and wielded sticks. The Beijing-backed local government was set to hold a meeting on Friday morning where it was likely to enact a colonial-era emergency law that has not been used in half a century, two sources with knowledge of the matter told Reuters. Media reports earlier on Thursday of an expected ban on face masks — which hundreds of thousands of protesters wear to conceal their identities and shield themselves from tear gas — sent Hong Kong's stock market up to a one-week high.\n\nGrowing opposition to the former British colony's government has plunged the financial hub into its biggest political crisis in decades and poses the gravest popular challenge to Chinese President Xi Jinping since he came to power. Protesters are angry about what they see as creeping interference by Beijing in their city's affairs despite a promise of autonomy in the \"one country, two systems\" formula under which Hong Kong returned to China in 1997. China dismisses accusations it is meddling and has accused foreign governments, including the United States and Britain, of stirring up anti-China sentiment. As speculation of an emergency law swirled, riot police on Thursday moved into districts across Hong Kong that have seen violent clashes between demonstrators and security forces in recent weeks. An angry crowd rounded on police, some of who were wearing black masks, in Taikoo metro station, in the east of Hong Kong island. They yelled, \"Take off your masks!\" One person was arrested. Police later fired multiple rounds of tear gas into a crowd who were jeering and chanting slogans of the pro-democracy movement. They cleared the streets before retreating into the station, which had been closed to commuters. Violence also broke out in Tuen Mun, in the New Territories, police said, where protesters built barricades and damaged government offices.\n\nUse of force\n\nLocal media Now TV and Cable TV reported the changes to the police procedures manual took effect on Sept. 30, the day before Tuesday's violence at widespread protests on China's National Day, during which the student was shot. Reuters could not confirm when the changes were made, but has seen police documents that showed changes to some guidelines on how officers could act when considering force. The updated guidelines also removed a line that said \"officers will be accountable for their own actions\", stating only that \"officers on the ground should exercise their own discretion to determine what level of force is justified in a given situation\". Police declined to comment when asked if amendments had been made to the manual. \"The guidelines on the use of force involve details of operation. It may affect the normal and effective operation of the police force and work of police on crime prevention if details are made public,\" police said in a statement to Reuters. Hong Kong's police have long been admired for their professionalism compared with some forces elsewhere in Asia. But the public has become increasingly hostile towards the force over past weeks amid accusations of heavy-handed tactics. Police say they have shown restraint. The unrest, which began over opposition to a now-withdrawn extradition bill that would have allowed people to be sent to mainland China for trial, shows no sign of letting up. Tony Tsang, the 18-year-old who was shot at close range as he fought an officer with what appeared to be a white pole, has since been charged with rioting, which carries a maximum 10-year sentence, and assaulting a police officer. Tsang is in hospital in a stable condition and was not able to attend a court session on Thursday, but his lawyer appeared on his behalf. About 200 supporters turned up to watch the proceedings.\n\n'Heinous crimes'", "description": "Authorities have already loosened guidelines on the use of force by police, according to documents seen by Reuters on Thursday.", "authors": [], "top_image": "https://image.cnbcfm.com/api/v1/image/106163706-1570155323422gettyimages-1166905543.jpeg?v=1570155395", "published_at": "2019-10-04"}