{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/17/2020-candidates-on-elijah-cummings-he-was-everything-right-about-america", "downloaded_at": "2019-10-18 01:11:51.899561+00:00", "title": "2020 Candidates on Cummings: He Was ‘Everything Right About America’", "language": "en", "text": "Several 2020 Democrat candidates reacted to Rep. Elijah Cummings’ (D-MD) death on Thursday, describing him as a “giant” in the House who embodied “everything right about America.”\n\nThe House Oversight Committee chairman passed away at Johns Hopkins Hospital early Thursday morning due to “complications concerning long-standing health challenges,” his office stated. Cummings had not returned to work due to an unnamed medical procedure and had not participated in a roll call vote since September 11, according to the Baltimore Sun.\n\nTributes have been pouring in on social media, and several of the 2020 Democrat candidates remarked on the lawmaker’s unexpected passing.\n\n“Rep. Elijah Cummings was a giant in the House, an unwavering champion for his district and all Americans, and a dear friend. My heart goes out to his wife Maya and his family,” Sen. Elizabeth Warren (D-MA) wrote.\n\n“Good people everywhere will miss his rumbling voice, his kind heart, and his deep conviction that every human being has worth,” she continued, adding, “Rest in power, Elijah”:\n\nGood people everywhere will miss his rumbling voice, his kind heart, and his deep conviction that every human being has worth. Rest in power, Elijah. — Elizabeth Warren (@ewarren) October 17, 2019\n\n“Elijah Cummings was a true public servant, his life defined by the love of his community and a fierce commitment to ensuring truth wins over power,” Joe Biden (D) said.\n\n“The whole Biden family sends our condolences to his wife, Maya, his children, and the entire city of Baltimore,” he added in a tweet, alongside a lengthier statement:\n\nElijah Cummings was a true public servant, his life defined by the love of his community and a fierce commitment to ensuring truth wins over power. The whole Biden family sends our condolences to his wife, Maya, his children, and the entire city of Baltimore. pic.twitter.com/jYbvQwZI1a — Joe Biden (@JoeBiden) October 17, 2019\n\n“We lost a giant today. Congressman Elijah Cummings was a fearless leader, a protector of democracy, and a fighter for the people of Maryland,” Sen. Kamala Harris (D-CA) wrote. “Our world is dimmer without him in it”:\n\nWe lost a giant today. Congressman Elijah Cummings was a fearless leader, a protector of democracy, and a fighter for the people of Maryland. Our world is dimmer without him in it. — Kamala Harris (@KamalaHarris) October 17, 2019\n\n“We lost one of our best. A son of sharecroppers, who went on to represent one of our greatest cities; a fighter for justice, who always led with love—Rep. Elijah Cummings was everything right about America,” Beto O’Rourke (D) tweeted.\n\n“He is already missed, but his legacy will be with us forever”:\n\nWe lost one of our best. A son of sharecroppers, who went on to represent one of our greatest cities; a fighter for justice, who always led with love—Rep. Elijah Cummings was everything right about America. He is already missed, but his legacy will be with us forever. — Beto O'Rourke (@BetoORourke) October 17, 2019\n\n“Very sad news this morning,” Rep. Tulsi Gabbard (D-HI) tweeted. “My heart goes out to the Cummings family during this difficult time. Elijah Cummings dedicated his life to service and will truly be missed”:\n\nVery sad news this morning. My heart goes out to the Cummings family during this difficult time. Elijah Cummings dedicated his life to service and will truly be missed. https://t.co/J4ZOZ8f2lu — Tulsi Gabbard (@TulsiGabbard) October 17, 2019\n\nMore:\n\nToday our country lost a true leader. Congressman Elijah Cummings was a friend, a passionate fighter for justice, and a powerful voice of moral conscience in our government who served his country for decades with dignity and integrity. I’m blessed to have known him. #RIPElijah — Cory Booker (@CoryBooker) October 17, 2019\n\nCongressman Elijah Cummings was a courageous moral leader and a relentless advocate for a better world. Our thoughts are with the Congressman's family and loved ones today. — Steve Bullock (@GovernorBullock) October 17, 2019\n\nWe are struck this morning to hear the news about the passing of Congressman Elijah Cummings. His death is a tragedy not just for the city of Baltimore, but for our entire nation, and for all of those who fight for justice.https://t.co/2syNdZD3if — Julián Castro (@JulianCastro) October 17, 2019\n\nWe’ve lost a leader like no other. Elijah Cummings was a lion when standing up for his beloved Baltimore & rights & truth. But he was also so kind, including to brand new senators like me a decade ago. His advice was as true as his love for his country. 💔 https://t.co/T5pLt24Jjv — Amy Klobuchar (@amyklobuchar) October 17, 2019\n\nRep. Elijah Cummings was a fierce champion for truth, justice and democracy—there was no one like him. He spent his lifetime fighting for Baltimore, Maryland and the American people. A huge loss for our nation. Andrea and I send our prayers to his wife and family. #RIPElijah https://t.co/0XwUQmQKMr — Congressman Tim Ryan (@RepTimRyan) October 17, 2019\n\nRep. Elijah Cummings was an outstanding leader who understood the stakes. He was a strong moral force both for civil rights and against Mr. Trump. He will be deeply missed. — Tom Steyer (@TomSteyer) October 17, 2019\n\nCongressman Elijah Cummings (1951-2019) was someone whose presence lifted all of us to a better place. The example of both his personhood and his politics blazed a trail for the rest of us to follow. May he Rest In Peace, and in his honor may we carry on. — Marianne Williamson (@marwilliamson) October 17, 2019\n\nThis is a tragic loss for Baltimore and the country. #RIPElijah https://t.co/a1UOT7Fg9S — Andrew Yang (@AndrewYang) October 17, 2019\n\nThrough our efforts to make prescription drugs affordable and expand dental care, I saw how committed he was to a more compassionate, humane society. He will be sorely missed. Our thoughts are with his family today. — Bernie Sanders (@SenSanders) October 17, 2019\n\nU.S. flags at both the Capitol and White House are being flown at half-staff in Cummings’ honor:", "description": "Several 2020 candidates reacted to Elijah Cummings' death, describing him as a \"giant\" in the House\" who was \"everything right about America.\"", "authors": ["Hannah Bleau"], "top_image": "https://media.breitbart.com/media/2019/10/Elijah-Cummings-640x335.jpg", "published_at": "2019-10-17"}