{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-soccer-spain-atm-mad-report/real-top-la-liga-after-derby-draw-at-atletico-idUKKBN1WD0OW", "downloaded_at": "2019-09-29 00:22:03.444008+00:00", "title": "Real top La Liga after derby draw at Atletico", "language": "en", "text": "MADRID (Reuters) - Real Madrid earned a 0-0 draw at neighbours Atletico Madrid in a tight derby to stay top of La Liga on Saturday, continuing their recovery after a disappointing start to the season.\n\nSoccer Football - La Liga Santander - Atletico Madrid v Real Madrid - Wanda Metropolitano, Madrid, Spain - September 28, 2019 Real Madrid's Gareth Bale in action with Atletico Madrid's Saul Niguez REUTERS/Juan Medina\n\nKarim Benzema came closest to scoring at the Wanda Metropolitano but Atletico goalkeeper Jan Oblak made a fine save to keep out the French forward’s header.\n\nAtletico forward Joao Felix twice fired wide in the first half and Real’s Gareth Bale lashed an effort off target after the break in a game of few chances.\n\nReal Madrid are top with 15 points from seven matches and Atletico stayed third with one point less.\n\n“I think with the game we played we deserved a lot more,” Real Madrid coach Zinedine Zidane told reporters. “In the end a point is a point. We had chances, the header from Benzema especially.\n\n“I can’t criticise my players over anything, I’m annoyed for them above all, but I’m happy with the game they played. They too are a bit disappointed not to take all the points.”\n\nReal’s Sergio Ramos and Atletico’s Kieran Trippier were lucky to avoid bookings for cynical fouls on Felix and Eden Hazard respectively in a cagey opening.\n\nAtletico’s club record signing Felix sneaked in behind Real’s defence but dragged an effort across the face of goal before whistling another shot just wide towards the end of the first half.\n\nAt the other end, Oblak made one solid save to tip Toni Kroos’s low drive around the post.\n\nBoth teams were more afraid of losing than hungry to win with a draw seemingly suiting both.\n\n“We have a lot of work to do (to get rid of) errors that we should not be committing, we have to keep working,” said Atletico coach Diego Simeone.\n\nRelated Coverage Resurgent Real Madrid show defensive progress in derby draw\n\n“In the first half we had more of the play but we couldn’t finish any of our chances. In the second. Oblak made that save from Benzema’s header. It was a hard-fought game, we both lacked what you need to win a game.”\n\nAfter a shaky start to the season and a 3-0 thrashing by Paris St Germain in the Champions League, Zidane has steadied the ship with wins over Sevilla, Osasuna and now a draw with a direct title rival.\n\nReal Sociedad, who are fifth, could displace Real at the top with a win over Sevilla on Sunday.", "description": "Real Madrid earned a 0-0 draw at neighbours Atletico Madrid in a tight derby to stay top of La Liga on Saturday, continuing their recovery after a disappointing start to the season.", "authors": ["Rik Sharma", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190928&t=2&i=1434989832&w=1200&r=LYNXMPEF8R0RQ", "published_at": "2019-09-28"}