{"pub": "washingtonpost", "title": "History will remember how Trump responded to Hong Kong", "url": "https://washingtonpost.com/opinions/global-opinions/history-will-remember-how-trump-responded-to-hong-kong/2019/09/01/25164118-ca65-11e9-be05-f76ac4ec618c_story.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:01:17.082007+00:00", "text": "Deputy Editorial Page Editor\n\nWhile President Trump plotted to annex Greenland, China’s Xi Jinping — a serious man — spent August weighing a decision that could shape the future of his country, and its relations with the world, for years to come.\n\nIt has nothing to do with purchases of U.S. soybeans or other concessions to give Trump a face-saving way out of his self-defeating trade war with Beijing. For now, Xi appears inclined to sit back and watch Trump’s mounting panic over the potential election-year consequences of his folly.\n\nInstead, Xi is considering whether to act on his regime’s repeated threats to crush Hong Kong’s pro-democracy movement by force. He has few other options to stop the mass demonstrations that have shaken the city this summer, which after 12 weeks are undiminished in strength. That’s because he has no intention of meeting the protesters’ demands for the resignation of Hong Kong’s pro-Beijing executive and the staging of free elections.\n\nAnd he has something of a deadline: On Oct. 1, huge celebrations of the 70th anniversary of the founding of his Communist regime are planned on the mainland. Counter-demonstrations in Hong Kong could spoil the show and cause Xi a humiliating loss of face.\n\nXi’s media and military commanders have been threatening intervention for weeks. They’ve tweeted propaganda videos of People’s Liberation Army troops using machine guns against “rioters”; they’ve massed elements of the paramilitary People’s Armed Police in the neighboring city of Shenzhen, where they’ve been carrying out exercises. Fresh soldiers were conspicuously rotated to the existing PLA garrison in Hong Kong last week.\n\nThe assumption among many Western analysts has been that Xi is hoping that the mere threat of force will cause the movement to retreat. So far, it hasn’t. On Saturday, protesters again battled police in Hong Kong’s streets after a planned march was banned. A week ago, more than 200,000 people formed human chains across the territory to reiterate the demand for direct elections. The week before that, an estimated 1.7 million — nearly a quarter of the population — turned out.\n\nThe regime has tried less conspicuous measures of force, such as dispatching gang members to beat up protesters and infiltrating marches with provocateurs. It has put pressure on Hong Kong businesses to discipline employees who join the marches. On Friday, it arrested several of the best-known opposition leaders. So far, nothing has worked.\n\nXi knows that the costs of intervention, or of an imposition by Hong Kong authorities of a state of emergency, would be large, which is why it hasn’t already happened. In addition to destroying the “one country, two systems” model for Hong Kong — which Beijing still hopes to peddle to Taiwan — the economic price would be huge. Though Hong Kong represents only 3 percent of China’s gross domestic product, some 60 percent of foreign investment in the mainland flows through the city, according to the Economist. Under U.S. law, the city is treated as a separate economic entity, allowing it to escape Trump’s tariffs.\n\nIf an intervention were bloody, most or all of that could be lost. Yet Xi no doubt is listening to arguments such as that recently advanced by the Communist Global Times newspaper, which editorialized that China could more easily manage the economic and diplomatic consequences of a crackdown than it could 30 years ago, when the Tiananmen movement was shattered by tanks. “China is much stronger and more mature, and its ability to manage complex situations has been greatly enhanced,” it said.\n\nMy guess is that the aftermath of a Hong Kong crackdown would be less like Tianamen, which wiped out the student-led democracy movement, and more like Communist Poland after the suppression of the Solidarity trade union in 1981. As in Poland, Hong Kong’s freedom movement is supported by the vast majority of the population. It cannot be stamped out — only forced to move underground. At some point, it likely would reemerge, especially if it had international support.\n\nThat, sadly, is the missing element in Xi’s calculus. In 1980, President Jimmy Carter bluntly warned the Soviet Union against the military intervention in Poland that it was then preparing, helping Solidarity to survive for 16 months. After Moscow settled for the imposition of martial law by the Polish Army, President Ronald Reagan imposed crippling sanctions and set up clandestine ratlines to help keep the movement alive.\n\nAs Xi has threatened Hong Kong, Trump repeatedly and publicly sympathized with him. Even under pressure from his advisers, the best he could do was muse that a crackdown would make it politically difficult for him to strike a trade deal. That’s why, while the histories of this summer will not remember Greenland, they may record that Trump opened the way to the suppression of the most important freedom movement Communist China has known.\n\nRead more from Jackson Diehl’s archive, follow him on Twitter or subscribe to his updates on Facebook.", "description": "As China weighs how to crackdown on protests, will the United States support democracy?", "authors": ["Jackson Diehl", "Deputy Editorial Page Editor", "Columnist Focusing On International Affairs", "September At Pm", "Jackson Diehl Is Deputy Editorial Page Editor Of The Post. He Is An Editorial Writer Specializing In Foreign Affairs", "Writes A Biweekly Column That Appears In Print On Mondays."], "top_image": "https://www.washingtonpost.com/resizer/dnop99HyfX2V9Zpf_3N2G0M51gE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/FNOLJYWKNQI6TIP6ZJDORVLTYA.jpg"}