{"pub": "yahoo", "url": "https://sports.yahoo.com/latest-world-record-holder-mayer-decathlon-172332812--spt.html", "downloaded_at": "2019-10-04 12:44:10.915271+00:00", "title": "The Latest: German Kaul wins decathlon world championship", "language": "en", "text": "Love it: Husband-wife win silvers in stunning night at track Shaunae Miller-Uibo, of Bahamas, wins her heat in the women's 400 meter semi finals at the World Athletics Championships in Doha, Qatar, Tuesday, Oct. 1, 2019. (AP Photo/Morry Gash)\n\nDOHA, Qatar (AP) -- The Latest on the track and field world championships early Friday (all times local):\n\n12:40 p.m.\n\nNiklas Kaul of Germany has won gold in the decathlon after a strong finish in the javelin and 1,500 meters.\n\nScroll to continue with content Ad\n\nKaul, who entered the meet No. 8 in the world, stormed into the lead by winning the final two events for a total 8,691 points.\n\nEstonia's Maicel Uibo, the husband of world 400 silver medalist Shaunae Miller-Uibo, was second with 8,604. He needed to stay close to Kaul in the final race but lost by more than 15 seconds. Miller-Uibo had won her medal just 45 minutes before the final decathlon event.\n\nThe bronze went to Canadian Damian Warner on 8,529.\n\nWorld record holder Kevin Mayer of France withdrew in tears in the eighth event, the pole vault, with injuries to his hamstring and Achilles tendon.\n\n''I prefer that happens here than at the Olympics,\" he said.\n\n---\n\n12:20 p.m.\n\nKatarina Johnson-Thompson has swept to the gold medal in the heptathlon, capping a steady rise to the top for the British competitor.\n\nJohnson-Thompson failed to reach the medals at the 2017 world championships and was second to Olympic champion Nafi Thiam at last year's European championships. Over seven events Wednesday and Thursday, however, she built enough of a points advantage to have a 10-second advantage over Thiam ahead of the final event, the 800 meters.\n\nJohnson-Thompson finished in dominant style, beating Thiam by 11 seconds in the 800. Thiam already looked to have given up the fight for gold when she opted not to take a third throw in the javelin, the penultimate event.\n\nJohnson-Thompson's points total of 6,981 was far ahead of Thiam's 6,677 and the 6,560 scored by bronze medalist Verena Preiner of Austria.\n\n---\n\n11:55 p.m.\n\nStory continues\n\nBahrain's Salwa Eid Naser has won the women's 400 meters in the third-fastest time ever, leaving Shaunae Miller-Uibo still without a world championship gold medal.\n\nNaser, who was born in Nigeria as Ebelechukwu Agbapuonwu and later switched allegiance to Bahrain, took the lead on the second turn and held off Miller-Uibo on the last stretch to win in 48.14 seconds. That's the fastest anyone has run in the 34 years since Marita Koch of East Germany set the world record at 47.60.\n\nShericka Jackson won bronze for Jamaica in 49.47.\n\nMiller-Uibo is the Olympic champion and won 400 silver in 2015 and 200 bronze in 2017.\n\nNaser is competing in Doha while Bahrain is part of a regional diplomatic and economic boycott of Qatar that has been in place since 2017.\n\n---\n\n11:40 p.m.\n\nChina's Gong Lijiao has successfully defended her world title in the shot put, while Jamaica's surge in the field events continued with silver.\n\nGong claimed the gold with a throw 19.55 meters, only her sixth-best result of the season but enough to beat Jamaican Danniel Thomas-Dodd's 19.47. Thomas-Dodd hit the 20-meter tape with one shot to roars from the Jamaicans in the crowd, but it was ruled a foul.\n\nChristina Schwanitz won bronze for Germany with 19.17.\n\nThomas-Dodd's medal is Jamaica's third in field events at these championships after men's long jump gold and men's discus silver. That's a new frontier for the traditional sprint power, whose only track medals to date are Shelley-Ann Fraser-Pryce's 100-meter gold and a silver in the mixed 4x400 relay.\n\n---\n\n11:20 p.m.\n\nSifan Hassan is firmly on course for her second gold medal of the championships after winning her 1,500-meter semifinal.\n\nThe Dutch runner hung at the back of the pack before kicking with 200 meters to go and claiming the win.\n\nHassan already has gold in the 10,000. She trains with the Nike Oregon Project headed by coach Alberto Salazar, who was banned four years Tuesday for doping offenses. Hassan herself has not been accused of any wrongdoing and is now working with a replacement coach.\n\nEuropean champion Laura Muir of Britain qualified third from her heat, which was won by United States runner Jenny Simpson.\n\nEarlier, Ayanleh Souleiman of Djibouti was fastest in the heats for the men's 1,500, while Kenyan Timothy Cheruiyot and Norwegian Jakob Ingebrigtsen also won their heats. Ingebrigsten's brother Filip qualified despite contact with Teddese Lemi which left the Ethiopian sprawling on the ground.\n\n---\n\n9:25 p.m.\n\nThere are now two bronze medalists in the men's 110-meter hurdles.\n\nSpanish hurdler Orlando Ortega will be awarded an extra bronze medal after Jamaican Omar McLeod collided with him during the hurdles final Wednesday.\n\nOrtega had been third when McLeod veered into his lane but finished fifth after the collision.\n\nThe championships jury rejected Spain's first appeal, saying the incident was ''not unusual in hurdles events,\" but reversed its decision Thursday evening. The statement announcing the ruling didn't say why the case was heard again or why the decision was changed.\n\nOriginal third-place finisher Pascal Martinot-Lagarde of France keeps his medal. Grant Holloway won the gold for the United States and Russian neutral athlete Sergey Shubenkov took the silver.\n\nThe championships has already awarded a double bronze in men's hammer when Wojciech Nowicki of Poland won an appeal over the validity of Hungarian Bence Halasz's throw for third place. Both were given the bronze at the ceremony Thursday after the jury declined to revoke Halasz's medal.\n\n---\n\n8:15 p.m.\n\nWorld record holder and defending champion Kevin Mayer is out of the decathlon.\n\nThe French decathlete pulled up with an apparent thigh injury during the pole vault, tears visible on his face.\n\nU.S. national champion Devon Williams is also out of contention for the medals after failing to clear his starting height in the pole vault.\n\nMayer was leading after the previous event, the discus, from Canadians Damian Warner and Pierce LePage.\n\n---\n\n8:10 p.m.\n\nShaunae Miller-Uibo is chasing the gold medal in the women's 400 meters on day 7 of the world track and field championships Thursday, while her husband Maicel Uibo targets the podium in the decathlon.\n\nMiller-Uibo's closest challengers in the 400 include Bahrain's Nigeria-born runner Salwa Eid Naser and the United States duo of Phyllis Francis and Wadeline Jonathas.\n\nThe Bahamian wanted to double up in the 400 and 200, but couldn't because of the championship scheduling.\n\nHer husband, Maicel Uibo, representing Estonia, is in contention for a medal in the decathlon. The heptathlon also ends Thursday, as does the women's shot put.\n\n---\n\nMore AP sports: https://apnews.com/apf-sports and https://twitter.com/AP-Sports", "description": "Niklas Kaul of Germany has won gold in the decathlon after a strong finish in the javelin and 1,500 meters.  Kaul, who entered the meet No. 8 in the world, stormed into the lead by winning the final two events for a total 8,691 points.  Estonia's Maicel Uibo, the husband of world 400 silver medalist", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/Oj0SyXYL2GnB7LPUhwZLFA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEwMjQ7aD02NzI-/https://s.yimg.com/uu/api/res/1.2/1x4wiC7xV2nrOXtsM8eA7g--~B/aD0zMzY7dz01MTI7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/Sports/ap/201910011306471885072", "published_at": "2019-10-03"}