{"pub": "investing.com", "url": "https://in.investing.com/analysis/indias-economic-woes-skindeep-or-deepseated-200432000", "downloaded_at": "2019-09-15 07:46:31.852149+00:00", "title": "India's Economic Woes: Skin-Deep or Deep-Seated?", "language": "en", "text": "Sitting in my bed room watching the cloudy sky, I feel sad. I get confused whether the effect is from the incessant rains for the last few days or is it the slow sipping in of the pervasive pessimism on Indian economy. Auto industry is crying recession while the SENSEX has been on choppy waters, perhaps reflective of the overall sentiment. Every day there is a warning from experts on imminent danger to our economy. Is it really that bad or are we just getting cagey for the elusive Sun, hidden behind the clouds?\n\nIt says there is no smoke without fire! There is sliding GDP growth rate, rising NBFC defaults (Altico Capital being latest), depressed PMI and falling consumer confidence (aka RBI consumer confidence survey). Hence, we need to first accept that the economy is showing significant weakness. We will try and peel the onion to see how deep the rot is and what we need to be wary off!\n\nRBI Policy Rate and Inflation\n\nSignificance\n\nLowering of rates are done to encourage spending but it also runs the risk of spiking inflation. A little bit of spike is okay, but the problem can get compounded if the monetary policy fails to spur growth but ends up in heating the economy (rise in inflation rate)\n\nRBI Policy vs. Inflation\n\nBehavior\n\nConclusion\n\nThe inverse relation seems abundantly clear. The fear of rising inflation with lowering rates in not unfounded but the latest inflation rate is still comfortably below the RBI comfort zone of 4%. Overall, inflation needs to be kept under watch.\n\nInflation Rate\n\nSignificance\n\nIf the rate is at risk of rising rapidly, then it will tie hands of RBI from further dipping the rates or even holding on to the lower rates. That’s primarily because more than growth, inflation control is a critical charter for RBI.\n\nBehavior\n\nInflation Component Breakdown\n\nConclusion\n\nF&B which has the maximum influence on inflation rate is on steady rise, primarily fueled by rising inflation in Vegetables and Milk products. Misc and Housing are just holding their forte. If food prices escalate, then it can be problematic. Overall, it needs to be reiterated that inflation needs to be kept under watch especially food/ vegetable prices as that hits the basic need of a human being.\n\nRBI Policy Rate Vs. GDP\n\nSignificance\n\nLowering of rates is supposed to spur growth and hence, GDP should rise on the back of increased private consumption.\n\nBehavior\n\nRBI Policy Rate vs. GDP Growth\n\nConclusion\n\nTill date, it seems not to be working that great. The GDP has been falling drastically for last two quarters despite RBI dropping the rates. No immediate conclusion can be made as the policy rate impact generally have lag impact on the overall economy. Hence, not so encouraging but need to wait & watch.\n\nGDP\n\nSignificance\n\nObviously, this is the grand macro parameter for economy and its performance\n\nBehavior\n\nExpenditure Graph\n\nGDP Expenditure Graph\n\nGVA Graph\n\nGVA Graph\n\nConclusion\n\nExpenditure Graph\n\nPrivate consumption growth (PFCE >50% contribution to GDP) is dismal (3.1% compared to 7.3% in Q1 of previous year) and reflects the dampening consumer sentiment on consumption. Reduction of policy rate has failed to bring much cheer to the same.\n\nThe other challenge is on gross fixed capital formation. The reduction in business investments in fixed assets reflects economic uncertainty. This goes partially hand in hand with PFCE as lack of consumer demand will trigger lower investment by business entities. Also, in times of economic uncertainty, capital becomes scarce. It is not necessarily a liquidity issue but more an issue of ability to attract capital (banks will be choosy on whom to lend).\n\nGVA Graph\n\nManufacturing; Financial, Real estate & Professional Services are two big contributors. The first is in deep trouble (0.6% growth) and has been on downward trend for last four quarters. Surprisingly service sector (FS, RE, PS) seems to also have applied brakes. Agriculture is a silver lining, still much below but getting better. Other component of service sector (Trade, Communication, Hotels) are in better shape. It can be safely concluded that Manufacturing is the biggest drag on the GDP. GVA is a production measure and drop in manufacturing growth perhaps reflect the reluctance to produce more unless the private consumption improves.\n\nIIP: Index of Industrial Production\n\nSignificance\n\nThis is an important indicator of general level of industrial activity and is a measure of short-term industrial growth. This can be a leading indicator to GDP. Like GDP, it has two representations, industry sector based and use-based.\n\nBehavior\n\nIndustry Sector based\n\nIIP Industry Sector\n\nIIP Use-Based\n\nUse-Based\n\nConclusion\n\nIndustry Sector Based\n\nManufacturing seems to be off the lows in July post hitting a all time low of 0.2% in June. Overall July IIP looks better but question is whether that will sustain under the current depressing economic condition (i.e. unless demand picks up). The April-June data aligns with our observation on GVA growth.\n\nUse Based\n\nThe deceleration in capital goods is in line with our observation in GDP where Gross capital formation growth is severely stunted. Deceleration in consumer durables is reflection of slowing down in consumer demand. The uncertainty in real estate is evident in the Infra/ Construction goods production. Consumer non-durable products which typically includes consumable goods e.g. FMCG products, foods & vegetables clocked healthy growth. Even under economic uncertainty, consumers will still buy the basic items.\n\nOverall, we see the GDP observations echoed out here. Consumption is muted and so is investments. But there is a silver lining, IIP July data is relatively better and use-based metrics also indicate better performance both on consumer durables and non-durables production. Manufacturing also clocked good growth in July.\n\nPMI (Purchasing Manger Index)\n\nSignificance\n\nPMI Manufacturing is an indicator of economic health of manufacturing sector. The PMI is a weighted average of the following five indices: New Orders (30%), Output (25%), Employment (20%), Suppliers’ Delivery Times (15%) and Stocks of Purchases (10%).\n\nPMI Service similarly represents the sentiment of the service sector. It is compiled by IHS Markit from responses to questionnaires sent to a panel of around 400 service sector companies. The sectors covered include consumer (excluding retail), transport, information, communication, finance, insurance, real estate and business services.\n\nBehavior\n\nPMI: Service and Manufacturing\n\nConclusion\n\nThe euphoria of July IIP numbers seems to be short lived as PMI manufacturing has shown a dip in August after a rise in July. Same is the case for Service PMI (both are mapped to the secondary axis). Ideally the PMI graph should be in inverse to RBI Policy trend as lower rates should reduce cost of capital/ production (+ growth in consumer demand) and hence, encourage growth in manufacturing. The other major inference is that the Service and the Manufacturing PMI seems to be decelerating in tandem. It is a very unfortunate scenario for an economy which is under stress and is also an indicator that the stress is more broad-based and structural.\n\nFrom the analysis till now, we can possibly summarize that there is a stress in the economy and it seems to be quite broad-based. There are some clear patterns that emerges from the study of the GDP components, Inflation components, IIP industry sector based and use-based data and PMI (Manufacturing and Service).\n\nKey signals/patterns\n\nThe stress in economy is real and is affecting both the manufacturing and the service vertical Manufacturing sector seems to be more severely impacted The steps taken till date seems to have only limited success in arresting the downfall Consumption is muted and more essentially, the discretionary spend (e.g. consumer durables) Capital is being conserved rather than invested by Industry/ Business entities Now, in next section we will revalidate the same with bank credit deployment, consumer spend pattern and saving pattern to understand whether there are liquidity issues or is the consumer behavioral data reflective of the observations made earlier.\n\nBank Credit Growth\n\nSignificance\n\nAvailability of credit in the system. Financing can be done by a varied set of players including banks, NBFCs, financial investors and even private investors. Here we will look into only the banking credit growth as a surrogate measure.\n\nBehavior\n\nGross Bank Credit Growth\n\nGross Bank Credit: Industry\n\nConclusion\n\nThere is no drying of the credit tap, at-least from the banking sector. Credit to industries has actually seen significant growth compared to previous year. It can also indicate that raising capital elsewhere is becoming a challenge for the industry and may reflect that industries are facing credit crunch due to lack of sales/ economic stress Service sector credit growth is slower than comparable period of last financial year. This can be an indicator of lower growth/ conservative expansion The retail loan portfolio (Personal Laon) split echoes the challenges in the consumer durables and the auto sector. While consumer durables loans have decelerated significantly, vehicle loan growth is also stunted compared to previous year. More importantly, May-July saw an increase in credit to consumer durable space in FY19, FY20 for same months is only getting worse. It may again reflect the conservative approach in the discretionary spend by consumers. It also seems the woes of real estate sector needs further investigation as personal loans for Housing is better compared to last year. The credit to NBFC sector is seeing lower growth. While the NBFC sector current woes on capital front is well known, the lower growth in credit to this sector perhaps indicates that banks are wary of throwing good money over bad and is lending cautiously and selectively In the Service sector credit, Retail and professional services is clocking much slower credit growth from start of calendar year FY19 only. This indicates that the consumption story may have started to grow bad much earlier than we thought. The slower growth in credit for retail and the professional services echoes our observation from the IIP and the GVA data as well, which showed a de-grow in consumer non-durables and slower growth in professional services respectively\n\nConsumer Spend Pattern\n\nSignificance\n\nThe payment data provides good insight into spend pattern of consumers. It may help us to infer whether there has been a perceptible change to justify saying that consumer demand has plateaued or declined.\n\nBehavior\n\nConsumer spend is very seasonal/ cyclical and the following data reflects the same (e.g. peaking during festive seasons etc.). The below graph plots M-o-M growth in consumer spend across major channels.\n\nEconomic Cycle\n\nCredit Card @POS\n\nCredit Card @ POS (Value)\n\nDebit Card @POS\n\nDebit Card @ POS (Value)\n\nDebit Card @ ATM\n\nDebit Card @ ATM (Value)\n\nMobile Payments (Value)\n\nMobile Payments\n\nNEFT Debits (Value)\n\nNEFT Debits\n\nConclusion\n\nThe spent by cards or mobile and even withdrawal of cash at ATM’s are showing worse performance compared to previous year and the impact is more perceptible in June month. Even NEFT debits took a significant dip in June before bouncing back in July. The July data will be important to understand how bad the slump is in spend or whether consumer spend picks up. We are just hitting the festive season and if the growth still remains stunted, then it may be creating a more vicious loop for the economy as a whole.\n\nMovement in Money Stock\n\nSignificance\n\nThe analysis of movement of money stock can give good insights on consumer behavior. For e.g. in an economy where consumers are skeptical of the economic condition, the natural affinity will be towards more savings.\n\nBehavior\n\nComponent of Money Stock\n\nConclusion\n\nJuly shows a significant growth in Term Deposit or less liquid money and indicates that people are gravitating towards savings. There is a perceptible growth in Demand Deposits (CASA) also Narrow money to Broad Money (total money supply) is showing a steady decrease. Since narrow money reflects liquid forms of money, it may signify that people are moving more money from liquid to more illiquid money (which can be TD or gold etc.) The money supply showed negative growth in April and June indicating less money in the system. Economy generally slows when there is less money in the system. We can also assume that the lowering of rates did not have enough impact on increasing money supply.\n\nSummary\n\nWe started with a question on whether the current noise on the economy a reflection of worsening situation or we are really are just being cynical. While it is for each one of us to make our own opinion based on the data, there is no denying of the fact that there are indeed challenges in the economy. In the below matrix, we summarize the key economic signals and the data points supporting it (RED means highly supportive of that statement while YELLOW means supportive/ confusing signals)\n\nEconomic Signal Summary\n\nThe silver lining is that many indicators are still in YELLOW stage and hence, the impact is still under control and provided the right initiatives are taken, it can bounce back/ stabilize at improved levels.\n\nSource: RBI and MOSPI for raw data\n\nThe author is a Director, Cloud Insight Team at Oracle (NYSE:ORCL) India. The article is in his individual capacity\n\nDisclaimer: The representations made in any article are the views of the author and not of the company. The views are be made in his personal capacity", "description": "Market Overview Analysis by Koushik Majumdar covering: . Read Koushik Majumdar's latest article on Investing.com India.", "authors": [], "top_image": "https://in.investing.com/analysis/not found", "published_at": "2019-09-14"}