{"pub": "mirror", "url": "https://mirror.co.uk/sport/rugby-league/bookmakers-refuse-pay-out-23400-20541244", "downloaded_at": "2019-10-09 00:52:37.986136+00:00", "title": "Pals thought they'd won £23,400 on double bet", "language": "en", "text": "Get the biggest Rugby stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nTwo Salford Red Devils fans have been left furious after believing they were £23,400 richer - only for bookies William Hill to refuse to pay out the bet.\n\nGary Smeaton and best pal, Kris Shenton, backed their team back in January when the odds were firmly against them.\n\nThe pair both stumped up £50 to place a single £100 \"double\" accumulator bet, backing Jackson Hastings at 25-1 to be named the Super League's \"Man of Steel\" and the Red Devils to finish in the top five at 8-1.\n\nAnd to their delight, both bets came in after the Red Devils reached the Grand Final at Old Trafford, where they face St Helens this Saturday, and Hastings clinched the Steve Prescott Man of Steel award under this season’s new voting system.\n\n(Image: Manchester Evening News)\n\nHowever bookies William Hill say they will not pay out the £23,400 to the two friends due to \"related contingency\" - where two bets are directly linked as one has a direct influence on the other.\n\nGary, a company director, told Manchester Evening News : \"I put the bet on nine months ago at the Swinton branch of William Hill. The guy in the bookie's wrote it out for me.\n\n\"My mate kept the betting slip. We never dreamed that it would ever come in.\n\n\"I never thought Salford would finish top five, but I did have an inkling about Hastings winning the Man of Steel. I am a massive Salford fan. I sponsor Tyrone McCarthy and the Devils' mascot.\n\n\"I was on holiday abroad when we beat Wigan to get to the Grand Final and then Jackson won his title. I was made up. Even Jackson's mum was pleased for me.\n\n\"Then she sent me a message after reading what William Hill had said and said she was gutted.\n\n(Image: Magi Haroun/REX/Shutterstock)\n\n\"William Hill have now said they regard our bet as two £50 bets and are prepared to pay out £1,700 to each of us.\n\n\"I am not settling for that. I will take it all the way, The Chief Executive of William Hill has refused to speak to me.\n\n\"Kris and I were so elated at the weekend. now we are so annoyed after coming down with a massive thud on Monday.\n\n\"I went back to the branch where I placed the bet and the person who wrote it out for me said he 'must have been half asleep' when he did it.\"\n\n(Image: Corbis via Getty Images)\n\nA spokesman for William Hill said: “As stated in our rules, a related contingency occurs when one or more parts of the bet placed affect the outcome of the bet.\n\n\"In this case, the prices of Jackson Hasting winning Man of Steel and Salford finishing in the top five are related. Were one outcome to happen, the other would be directly affected and as such the double price would be significantly smaller.\n\n“This bet has been struck as a result of human error and as such has been corrected. At no point was the double on offer before the start of the season. Unfortunately, we realise this is disappointing for the customer and we can only apologise.\n\n“In cases such as this, IBAS (Independent Betting Adjudication Service) offer an impartial adjudication on disputes between customers and licensed gambling operators.”", "description": "Gary Smeaton and best pal, Kris Shenton, backed their team back in January when the odds were firmly against them", "authors": ["Matt Maltby", "Image", "Manchester Evening News", "Magi Haroun Rex Shutterstock", "Corbis Via Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20541221.ece/ALTERNATES/s1200/0_Pals-Gary-Smeaton-and-best-mate-Kris-Shenton-thought-theyd-won-£23400-on-Salford-Red-Devils-sup.jpg", "published_at": "2019-10-08"}