{"pub": "theverge", "url": "https://theverge.com/2019/7/30/20746735/tool-music-spotify-apple-music-digital-streaming", "downloaded_at": "2019-10-05 14:42:24.962868+00:00", "title": "One of the last remaining music streaming holdouts has relented", "language": "en", "text": "Alongside the announcement of its first new album in over a decade, the rock band Tool has said that its catalog will finally be available to stream and to purchase digitally on August 2nd. In an Instagram post first spotted by Pitchfork, the band said its albums would available on “all digital and streaming formats,” which is expected to include the likes of Spotify, Apple Music, Pandora, and Amazon Prime Music.\n\nUntil now, Tool has been one of the biggest artists to refuse to sell its music digitally. However, over the years the band’s position has become more and more isolated, as the likes of The Beatles, Metallica, AC/DC, and Led Zeppelin have all caved one by one and allowed their music to be streamed as part of a monthly subscription. Billboard reports that just a couple of major artists are still not available to stream, including De La Soul and Aaliyah, the R&B artist who passed away in 2001.\n\nAs well as being available to stream, Tool’s music is also coming to digital services, which will likely include the iTunes Music Store, the service that came to define the digital music era after it launched in 2001. Somewhat ironically, Tool’s announcement comes as Apple prepares to discontinue iTunes, meaning the band was just months away from successfully skipping out on the iTunes generation entirely.", "description": "Tool has said that its catalog will finally be available to stream and to purchase digitally on August 2nd. In a post announcing the release, the band said its music would be available on \"all digital and streaming formats.\"", "authors": ["Jon Porter", "Jul"], "top_image": "https://cdn.vox-cdn.com/thumbor/Pz12Ys-MoAd-oGkMUzjpis4E1qA=/0x130:3416x1918/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/18366091/967035626.jpg.jpg", "published_at": "2019-07-30"}