{"pub": "reuters", "url": "https://af.reuters.com/article/sportsNews/idAFKCN1VX1TF-OZASP", "downloaded_at": "2019-09-13 00:57:29.970678+00:00", "published_at": "2019-09-12", "title": "Burns, Root lay solid platform for England", "language": "en", "text": "England's Rory Burns in action as he is caught out by Australia's Mitchell Marsh Action Images via Reuters/Andrew Boyers\n\nLONDON (Reuters) - Rory Burns and Joe Root took advantage of a lacklustre display by Australia to lift England to 86 for one at lunch on the first day of the fifth and final Ashes test at The Oval on Thursday.\n\nThe hosts lost the wicket of Joe Denly but Australia, who have retained the Ashes, failed to take advantage of favourable bowling conditions after winning the toss and spilled two catches as they bid to seal a 3-1 series victory.\n\nPat Cummins and Josh Hazlewood bowled tidy opening spells but the touring side’s vaunted pace attack lacked the consistent threat which has caused problems for England’s fragile top order throughout the series.\n\nDenly, on 14, played a loose stroke at a widish delivery from Cummins and edged to second slip where Steve Smith fumbled the chance before grabbing the ball before it hit the ground.\n\nThe opening partnership of 27 was the highest of the series but it was another failure for the 33-year-old Denly, who made battling fifties in the last two tests without staking a claim to a long-term place in the team.\n\nRoot, badly dropped on 24 by Peter Siddle at fine leg after playing a casual pull stroke, was also put down by Tim Paine off Cummins as the wicketkeeper failed to take the ball one-handed in front of first slip.\n\nBurns hit six fours in another determined knock and was 42 not out at the interval with Root on 28.", "description": "Rory Burns and Joe Root took advantage of a lacklustre display by Australia to lift England to 86 for one at lunch on the first day of the fifth and final Ashes test at The Oval on Thursday.", "authors": ["Ed Osmond", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190912&t=2&i=1429086470&w=1200&r=LYNXNPEF8B193-OZASP"}