{"pub": "blastingnews", "url": "https://uk.blastingnews.com/entertainment/2019/10/wham-stars-book-could-lead-to-big-screen-success-002994253.html", "downloaded_at": "2019-10-06 03:13:55.450969+00:00", "title": "Wham star’s book could lead to big screen success", "language": "en", "text": "Wham! star Andrew Ridgeley has endorsed the possibility that his new book could lead to big screen success in the future, as his musical partnership with the late George Michael has been captured in a biography released earlier this week. Published by Dutton, “Wham! George And Me” is the 56-year-old’s reflection on the memorable duo’s rise to fame in the eighties.\n\nRidgeley ultimately became the trusted sidekick of front man Michael, as their friendship grew after their first meeting at school in 1975, right through to the pair’s final emotional concert in 1986 at Wembley.\n\nGeorge Michael’s continued progression in the Music industry - following the amicable break-up of the pairing - was welcomed by Ridgeley when asked about it on “The Graham Norton Show” on Friday night.\n\nRidgeley enthused by film prospect\n\nHowever, he is clearly enthused by the idea of an opportunity to emulate the success of recent Film projects such as “Bohemian Rhapsody” and the Elton John vehicle “Rocketman”, as he told Radio 2 listeners in an interview.\n\nBoth of those films have proved immensely popular at the box office, with the Queen and Freddie Mercury inspired movie not only making over £700 million but also bagging a coveted Oscar for actor Rami Malek as a consequence.\n\nRidgeley told Radio 2 show star Nicki Chapman that the biography was “crying out” to be transformed into a big screen adaptation and in his opinion would “make a fantastic film.” The former Wham! guitarist added that it was “a story that lends itself to the big screen” and that it would be “marvellous” if that were to happen.\n\nDon’t miss the latest news! Click on the topic you interest most. We'll keep you updated with all the news you shouldn't miss. Film\n\nDeveloped a life-long friendship\n\nThe new biography takes readers back to the band’s early days as they propelled themselves into the public conscience amid a media storm surrounding their popularity. It tells the inside story of what it was like to be part of the juggernaut that was Wham! at the time. But also provides a candid look at how Ridgeley took a shy new boy at Bushey Meads School under his wing in 1975, how they seemed to hit it off from the start and were to develop a life-long friendship thereafter.\n\nThe book lets Wham! and George Michael fans look inside their crazy world at the height of their worldwide fame, besides reflecting on boyhood escapades that the pair shared, the laughs they enjoyed and the bad times they endured.\n\nWham! global success during the 80s\n\nThe Surrey born vocalist, songwriter and record producer enjoyed a flurry of chart success during the 80s as Michael and himself seemed to capture the spirit of the decade.\n\nBetween 1982 and 1986 they enjoyed a stellar period of fame with more than 30 million records sold globally, leaving a legacy of classic pop music tracks behind them such as “Last Christmas”, “Freedom”, “I’m Your Man” and “The Edge of Heaven”.", "description": "Andrew Ridgeley’s musical partnership with George Michael is captured in new biography.", "authors": ["Read More On The Same Topic Bryce Gibson", "Facebook Purchases 'Mind-Reading' Technology Company Ctrl-Labs", "John Lennon S Memory Evoked Opening Of Strawberry Field Project", "Paul Mccartney Hints At Possible Glastonbury Festival Return"], "top_image": "https://staticr1.blastingcdn.com/media/photogallery/2019/10/5/os/b_1200x630/wham-days-captured-in-new-biography-source-flickr-mary-mccoy_2334495.jpg", "published_at": "2019-10-05"}