{"pub": "cbc", "url": "https://cbc.ca/radio/asithappens/lawyer-for-family-of-man-killed-by-ex-dallas-police-officer-applauds-guilty-verdict-1.5304708", "downloaded_at": "2019-10-02 12:48:36.549545+00:00", "published_at": "2019-10-01", "title": "CBC Radio", "language": "en", "text": "Lawyer Daryl Washington is applauding the conviction of a former Dallas police officer found guilty of murder in the shooting death of her black neighbour.\n\nA jury reached the verdict on Tuesday in Amber Guyger's high-profile trial for the 2018 killing of Botham Jean after six days of witness testimony, but just a handful of hours of deliberation.\n\nGuyger had argued that the shooting was a tragic mistake. She said she went into Jean's apartment by mistake, thinking it was her own — and then shot Jean dead, thinking he was a burglar.\n\nWashington, the attorney for Jean's family, spoke with As it Happens host Carol off shortly after the verdict was released. Here is part of their conversation.\n\nMr. Washington, what was it like for Mr. Jean's family to hear this guilty verdict today?\n\nOh, it was [an] amazing relief to have this guilty verdict read. Because, as you know, often in this country, police officers have this huge halo above their head. So to get a guilty verdict against this officer meant a whole lot to this family.\n\nAnd, as you put it, there's also that she was a white police officer and the victim, Mr. Jean, was black.\n\nExactly. So it speaks to the great job that this jury did.\n\nCan you describe how people in the courtroom reacted when that verdict was read out?\n\nVery, very excited. Again, people are under the belief that, you know, no one was going to give this family a fair opportunity because this was a white police officer who tried to convince the jury that she made a mistake. We all know that it was not a mistake.\n\nFired Dallas police officer Amber Guyger gave emotional testimony last week in her murder trial, but a jury has rejected the claims of self-defence. (Jeremy Lock/Reuters)\n\nWas it fairly emotional in the courtroom today when this verdict was read?\n\nIt's extremely emotional, and it's still very emotional. I mean, it hasn't sunk in yet. And as you know, we're about to go to the sentencing phase. So we've gone over the first hurdle. So we understand now that we have another hurdle to cross.\n\nWe're talking about a case where this woman, Amber Guyger, she said that her defence was that it was a series of mistakes that led to this tragedy — that she was just in the wrong apartment, she'd gone into the wrong place thinking it was her place, thinks she's seeing an intruder and shot him. Do you have any sympathy for that story?\n\nAbsolutely none at all. This is a trained police officer. They talked about how confusing this apartment complex is. If this apartment complex was just that confusing, then we know that she should have been looking to make sure that she was in the proper apartment. So that excuse that she gave was just not acceptable.\n\nBotham Jean's mother, Allison Jean, centre, escorted by civil rights attorney Lee Merritt, right, is hugged by family members outside the courtroom after the verdict was handed down on Tuesday. (Tom Fox/The Dallas Morning News via AP)\n\nShe also [said] that she heard noise outside of that door before she actually went in. We know that the training, officers are taught to cover and conceal, and she didn't do any of that. So there was just no reason for Botham to have lost his life.\n\nThe defence also argued that the shooting, whether it was wrong or right, was in self-defence. She thought she was just defending herself. What did you argue to refute that?\n\nThere was absolutely no testimony that Bolton did anything threatening. She didn't say that Bolton pointed anything at her. We know now that Bolton had shorts on that didn't have pockets, so she couldn't say that he was reaching in his pocket and she thought he had a gun. None of that.\n\nShe just simply said that Bolton walked towards her ... and that was it. She didn't say anything threatening. So there was just no justification to use self-defence.\n\nWritten by Jonathan Ore with files from The Associated Press. Produced by Chris Harbord. Q&A edited for length and clarity.", "description": "Amber Guyger was found guilty of murder for shooting her black neighbour, Botham Jean, dead in his own apartment. Daryl Washington is says the victim's family feels a sense of \"amazing relief.\"", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5304894.1569962262!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/texas-crime-amber-guyger.jpg"}