{"pub": "townhall", "url": "https://townhall.com/columnists/stevesherman/2019/09/14/one-way-to-make-americas-defense-great-again-n2553072", "downloaded_at": "2019-09-14 05:28:56.505341+00:00", "title": "One Way to Make America’s Defense Great Again", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nPresident Ronald Reagan and Donald J. Trump have many things in common. One is the idea that we need to be a strong nation and we secure peace through strength. The most recent actions by President Trump to hike up defense spending, after years of neglect, is a great step to make America’s defense even stronger.\n\nAccording to Defense One, the president’s budget for this year requested increases in defense spending: “The Pentagon-specific portion of the request totals $718 billion, which is $33 billion (5 percent) higher than what Congress approved for the military in 2019.” CNBC reported in July that the congressional deal to get rid of the sequester’s automatic cuts to spending was removed from law and resulted in a hike in “discretionary spending to $1.37 trillion in fiscal year 2020, up from $1.32 trillion this year.” The deal “was also expected to set spending at $320 billion above sequester levels for fiscal years 2020 and 2021.” The budget and budget deal with Congress ended up adding cash to increase our Pentagon budget.\n\nAll that extra money also provides more opportunity for waste if not outright corruption. Like his hawkish predecessor, President Reagan had trouble with contractors pushing overpriced hammers and toilets. President Trump is being pushed to purchase overpriced fighter jets that have more than questionable usability.\n\nThe Defense Department needs to make smart decisions with the abundant resources they are being given. America needs a high-tech powerful military that can adapt quickly to a variety of threats around the world. The DOD should make sure to diversify our military to face all possible adversaries rather than attempt to use a one-size-fits-all approach to an unknown future.\n\nOne horrific example of the problem with this approach is the bungled handling of the F-35 fighter jet that has become a “show pony” riddled with decades of delays and budget busting overages. Not to mention the cost projections of over $1 trillion to maintain the aircraft. That’s in addition to the $406 billion Lockheed Martin now says it will take to build the aircraft…if that ever even happens on a useful level. Currently, the F-35 is also plagued with failure. There are real questions if this fighter can even fly in bad weather or at night. Something a $60,000 Cessna can do!\n\nA pentagon official stated, “There are limitations on [the F35’s] Instrument Flight Rules—what’s required to take an airplane into bad weather and to fly at night. America’s latest and greatest fighter, is restricted from flying in instrument meteorological conditions”\n\nOur nation needs diversity in all of the armed forces, but most definitely when it comes to fighter jets. The use of B-52s and F-15s as a way to scare Iran during a potential crisis shows that the Pentagon does need money to purchase a diverse arsenal of tools to fight emerging threats.\n\nMy son is a young American currently in Air Force ROTC on his way to actually being a fighter pilot. Decisions we make right now will determine what kind of aircraft he will fly against our enemies. Throwing more money at the F-35 is not helping make us safer as a nation. The DOD needs to realize the dream of one fighter jet that can do all and be all is dead. We need a plethora of aircraft and it’s time to spread the defense money around rather than watching it get gobbled up by the black hole that is the F-35 Joint Strike Fighter (JSF).\n\nThanks to a boost in funding the military is growing stronger, even with the mistakes like the F-35 JSF. Leaders must realize that the stealth F-35 is not the answer to every threat.\n\nPeace through strength. President Trump, like Reagan is building up the strength of our military. Peace will not only come by wielding a big stick. Diplomacy is also needed. Trump has emulated Reagan with his efforts at diplomacy. Reagan had breakthrough negotiations with the leader of the Soviet Union before the empire crashed. Trump is attempting to deal with the most challenging leaders in our world: North Korea, China, Venezuela, Iran and Afghanistan with a combination of diplomacy and threats of economic and military sanctions.\n\nHistory will write how successful President Trump was at these lofty goals. In an ever-dangerous world we need diverse choices at our disposal when we inevitably face our next enemy militarily...no matter who is president.", "description": "President Ronald Reagan and Donald J. Trump have many things .09/14/2019 1:25:44AM EST.", "authors": ["Steve Sherman", "Timothy Meads", "Matt Vespa", "Katie Pavlich"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/292/f39d55ae-f3f6-4948-a952-250e7ca4d9c9.jpg", "published_at": "2019-09-14"}