{"pub": "investingcom", "url": "https://za.investing.com/analysis/jse-market-trading-statistics-for-the-week-ending-27-september-2019-200431283", "downloaded_at": "2019-10-01 09:31:35.643169+00:00", "title": "JSE market trading statistics for the week ending 27 September 2019", "language": "en", "text": "We take a look at the Johannesburg Stock Exchange (JSE) trading statistics for the week ending 27 September 2019 and compare the numbers to that of a year ago.\n\nJohannesburg Stock Exchange (JSE)\n\nTrading statistics for the week ended 27 September 2019\n\nLast week Friday we covered the latest weekly world market wrap from Peregrine Treasury Services. Below an extract from the article pertaining to the latest for the South African\n\n\n\nRand outlook weak\n\nThe week ahead will once again leave us at the mercy of the global environment, with markets keeping a keen eye on unfolding events such as the motion to impeach President Trump, calls for Boris Johnson to step down and the ongoing trade dynamic between the US and China. From a data perspective, a few important releases are set to take place locally, including new vehicle sales and the Standard Bank (JO: ) PMI, while we will keep an eye on Chinese and US manufacturing PMI, US unemployment and UK GDP numbers. The has moved towards a leg weaker, with the new target level being set at R15.06/$, with a break above this signaling a new bout of weakness that could see the currency target R15.20. The rand starts the day trading at R15.05/$, R16.44/€ and R18.55/£\n\nTrading Statistics for the week ending 27 September 2019\n\n\n\nNumber of trades:\n\nNumber of trades (2019): 1 428 815\n\nNumber of trades (2018): 1 314 151\n\n% change year on year: 8.73%\n\n\n\nVolume traded:\n\nVolume traded (2019): 1 340 704 000\n\nVolume of traded (2018): 3 174 662 000\n\n% change year on year: -57.77%\n\n\n\nValue of trades:\n\nValue of trades (2019): R78 296 806 000\n\nValue of trades (2018): R86 427 854 000\n\n% change year on year: -9.41%\n\nForeign purchase/selling:\n\nNet sales/Purchases (2019): -R7 564 114 000\n\nNet sales/Purchases (2018): -R232 478 000\n\n​\n\nSo year to date (YTD) foreigners have been net seller/buyers:\n\nNet sales/Purchases (2019): -R69.504 billion\n\nNet sales/Purchases (2018): -R14.642 billion\n\n\n\nSo a year ago foreigners were net sellers of SA listed shares to the value of -R14.642 billion for the YTD while this year they have been net sellers to the tune of -R69.504 billion in the year to date (YTD). That is a R54.862 billion difference between the net buying/selling position last year compared to this year as foreigners accelerate their selling of SA's listed stocks.\n\n\n\nA clear sign that foreign capital is still leaving South African equities in vast amounts. This while the South African government continues to try and convince investors that South Africa is open for business. But the large scale corruption, poor government service delivery, slow economic growth, restrictive labor laws, worries about property rights, crime and general public disorder in the forms of strikes and looting are keeping potential investors away from South Africa.\n\nJSE total market capitalization:\n\nMarket Cap (2019): R17.505 trillion\n\nMarket Cap (2018): R14.247 trillion\n\n% change year on year: 22.87%\n\n\n\nSo as shown in the JSE total market capitalization above, the overall stock market of South Africa has increased significantly over the course of the last 12 months (and it would have been even higher if it wasn't for the tariff war between the USA and China). The markets had a particularly positive start to the year, with all four months of the year ending in positive territory. However, since then there has been a few negative months. Including September 2019 in which the JSE All Share Index ended down roughly 2%", "description": "Shares Analysis by John Maynard covering: USD/ZAR, Crude Oil WTI Futures, FTSE/JSE Top 40, Standard Bank Group Ltd. Read John Maynard's latest article on Investing.com South Africa.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-01"}