{"pub": "theverge", "url": "https://theverge.com/circuitbreaker/2019/10/1/20892995/64-megapixel-phone-camera-realme-xt-hands-on", "downloaded_at": "2019-10-05 15:09:01.331268+00:00", "title": "Do 64-megapixel phone cameras really make a difference?", "language": "en", "text": "Phones with 64-megapixel cameras are already starting to be released. In recent weeks we’ve seen the Realme XT, Xiaomi’s Redmi Note 8 Pro, and the Vivo Nex 3 announced with the same 64-megapixel Samsung GW1 sensor, and you can expect this to proliferate just like 48-megapixel phone cameras did throughout the first half of the year.\n\nI have the first of these phones, the Realme XT, in hand right now, so I thought I’d shoot some comparison photos to see what advantage the sensor can bring over the previous 48-megapixel chips. The Samsung sensor is basically the same thing but bigger — the pixels are the same size and use the same filter, so there’s just more of them across a larger surface area. Just as 48-megapixel phones shoot pixel-binned 12-megapixel shots by default, these 64-megapixel phones are designed to produce 16-megapixel images. You can, however, take full-resolution photos if you like.\n\nRelated Realme 5 and 5 Pro announced with quad cameras and low prices\n\nTo make for the closest comparison possible, I also shot pictures with the Realme 5 Pro, a similar new Realme device with the same Snapdragon 712 processor — this should theoretically mean we’re dealing with more or less the same image pipeline. The 5 Pro uses Sony’s 48-megapixel image sensor rather than Samsung’s, but Samsung’s 64-megapixel sensor now has the same full-resolution demosaicing technique as Sony — the company’s older 48-megapixel part did not.\n\nTo be clear, neither of these are close to flagship phones, so you shouldn’t expect incredible image quality in the first place. The Realme XT sells for about $225 in India, while the 5 Pro is even less expensive at under $200. But this 64-megapixel sensor is going to make its way into far more expensive phones, so it’s worth seeing what it’s capable of even in low-end devices.\n\nFirst off, here’s a mid-afternoon photo taken outdoors in good lighting, which should give the sensor the best chance of resolving detail.\n\nIf you zoom all the way into the default 16-megapixel shot, here’s how you’ll see the sign far in the distance.\n\nNow here’s a comparison of high-resolution modes. A sample from the Realme 5 Pro’s 48-megapixel camera is on the left, and the XT’s 64-megapixel mode is on the right.\n\nAs you can see, despite some heavy image processing all around, the 64-megapixel photo from the XT is by far the best. It resolves a lot more detail and retains more color information.\n\nOne quirk I noticed when testing the XT camera outdoors is that the full-resolution photos produce slightly different colors. In all cases, the 64-megapixel shot was tinted a little red, whereas the downsampled 16-megapixel images tended to be greener, and I found the same was true of the 5 Pro’s 48-megapixel images as well.\n\nThis probably has something to do with the sensor’s color filter, which uses a standard Bayer RGBG layout with 2x2 blocks for each virtual “pixel.” Full-resolution shots use a demosaicing algorithm to calculate color information for the actual pixels, and my guess is that this technique is overcompensating for the larger use of green in the filter.\n\nYou can see what I mean here.\n\nNext, let’s look at low-light performance. Here’s the same scene from before, but at close to midnight.\n\nNeither phone produces useful pixel-level detail in this kind of light, so let’s look at the building on the right instead. Again, here are crops of the 48-megapixel 5 Pro (left) and the 64-megapixel XT (right).\n\nThe XT is significantly more detailed and colorful, as it was in daylight, but this time you can see the compromises of noise and image processing. Look at the “Uchida” sign at the top of the building, for example — it’s easier to read on the XT, but the 5 Pro’s photo is much smoother, with little chroma noise to speak of.\n\nSurprisingly, the XT’s default 16-megapixel mode isn’t an improvement, although it’s supposed to help in low light:\n\nIt’s hard to make a judgement about the sensors’ respective performance either way. Perhaps the 5 Pro could have come close to the XT’s detail if it took a lighter touch with noise reduction. Or maybe Sony’s 48-megapixel sensor just has a different approach to handling high ISOs.\n\nLastly, let’s look at Realme’s “nightscape” night mode:\n\nGiven how night mode photos are constructed from various long-exposure shots, the overall effect is more important than pixel-level detail. But in my testing, I actually found that the 5 Pro tended to produce sharper results. Both phones’ night modes give you 12-megapixel pictures, and in the XT’s case the image is slightly cropped in to achieve this, which seems to compromise the quality a little. For some reason, Realme isn’t attempting to leverage the 64-megapixel sensor in its night mode.\n\nIncredible detail, but probably not that useful\n\nOverall, it’s clear that 64-megapixel sensors can produce incredibly detailed results in good conditions, offering a noticeable jump over even 48-megapixel sensors. But unless you’re planning to make huge prints of sunbathed landscapes, it’s probably not that useful a feature for most people. These phones shoot at a quarter of their resolution by default for a reason.\n\nRemember that the iPhone 11 and the Pixel 3, both of which are considered to be right at the peak of phone camera quality, manage to make do with smaller 12-megapixel sensors. Megapixel count or even physical sensor size just aren’t that meaningful at this point — the image processing pipeline and computational photography make a much bigger difference to how well your phone’s camera will perform.\n\nStill, I’m pretty impressed with the cameras on both of these phones considering their price points. Resolution aside, they produce photos that would have been unthinkable on similar devices just a couple of years ago. Google and Apple might not have anything to worry about, but this segment of the market is seeing rapid improvements.", "description": "The Realme XT is the world’s first phone with a new 64-megapixel camera sensor from Samsung. But what difference does this make in practice?", "authors": ["Sam Byford", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/5TII0t0t3nzc657WZZlpM-MRq1E=/0x146:2040x1214/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19248699/DSCF7120.jpg", "published_at": "2019-10-01"}