{"pub": "cbc", "url": "https://cbc.ca/life/video/pumpkin-spice-caramel-apples-1.5042084", "downloaded_at": "2019-10-09 22:05:31.474646+00:00", "title": "CBC Life", "language": "en", "text": "Few flavours have the power to dominate an entire season like Pumpkin Spice has done with fall. The souped-up seasoning has already infiltrated our lattes, cocktails, baked goods and even our deodorant (for real). Now, we’re bringing it to your candy apples!\n\nThese Pumpkin Spice Caramel Apples are an uber-festive take on the classic Halloween-time treat. They’re so simple to make, you can get the kids in on the fun, too. Not only are they bound to be the hit of the dessert table at your All Hallow’s Eve bash, you can keep on savouring them all autumn long.\n\nIngredients\n\n4 Granny Smith apples (or other apples of the same shape)\n\n4 cinnamon sticks, 5-6 inches long\n\n50 pieces wrapped caramel squares\n\n1 ½ tbsp whole milk\n\n1 cup pecans, toasted and chopped\n\n¼ cup raw sugar\n\n¼ tsp ground cinnamon\n\n¼ tsp ground ginger\n\n¼ tsp ground nutmeg\n\n¼ tsp ground cloves\n\nPreparation\n\nThis flavour combo is not just for your lattes. 1:10\n\nWash and thoroughly dry your apples. Place milk and unwrapped caramels in a microwave safe bowl. Melt in the microwave for 1 minute, stir, then melt for 1 minute more. Let cool for 3 minutes.\n\nRemove stems from your apples. Use a paring knife to make an incision into where the stem was. Turn your knife slightly to make a hole ¼ inch deep. This will make it easier to push the cinnamon stick in. Insert all 4 cinnamon sticks, then set aside.\n\nIn a bowl, mix together chopped pecans, raw sugar and spices. Sprinkle spice and nut mixture onto a large plate or flat baking tray.\n\nOne at a time, dip apples in caramel then roll in nut and spice mixture. Let cool on a parchment-lined plate and store in the fridge until you’re ready to enjoy!\n\nServings: Makes 4 caramel apples", "description": "This flavour combo is not just for your lattes.", "authors": ["Cbc Life"], "top_image": "https://i.cbc.ca/1.4376367.1552665406!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/pumpkin-spice-candy-apples.jpg", "published_at": "2019-03-04"}