{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/david-james-pictured-kissing-nadiya-20747646", "downloaded_at": "2019-10-29 15:11:44.132818+00:00", "title": "Strictly's David James pictured kissing Nadiya days before cosying up at Pride Of Britain", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nStrictly's David James and his former dance partner Nadiya Bychkova were spotted looking cosy at the Pride of Britain awards on Monday night.\n\nThe former footballer, 49, and professional dancer's tactile display follows on from David being pictured giving Nadiya, 30, a goodbye kiss after they appeared on Strictly Come Dancing's spin-off show it takes two last Wednesday.\n\nThe pair looked closer than ever as they headed home after chatting about the former England goalkeeper's exit from the dancing show.\n\nPhotos taken as they departed the studios showed the pair walking hand-in-hand as they strolled along the pavement being snapped by photographers.\n\nAs they parted ways, David wrapped his arm around Nadiya and planted a kiss on her bid her goodbye.\n\nNadiya was also pictured turning to blow David a kiss as he walked down the street behind her.\n\n(Image: BACKGRID)\n\nNadiya, who is reportedly dating Slovenian footballer Matij Skarabot, looked stunning as she stepped out in a tight-fitting low-cut red dress with a black blazer and nude heels.\n\nAnd David, who has a mystery girlfriend, looked handsome in a maroon suit, white shirt and trainers.\n\n(Image: BACKGRID)\n\nIt comes as the pair did little to stay apart, last night, as they walked the red-carpet together.\n\nProving they are closer than ever, the former dance partners were inseparable as they hugged and smiled on the red carpet before entering Grosvenor House hotel for the bash.\n\nThe duo were caught holding hands on a video as they went down for dinner, as they carried on with the steamy display.\n\n(Image: PA)\n\nThey quickly let go of hands as they entered the crowd of celebrities at the star-studded event.\n\nNadiya slipped into a semi-sheer fishtail gown and David donned a three-piece suit that he dressed-down with trainers.\n\n(Image: Mike Marsland/WireImage)\n\nAn eye-witness said: \"David and Nadiya looked very cosy inside the awards. They held each other's hands away from the cameras, and kept smiling at each other.\n\n\"They wouldn't even let go to walk down the stairs into the dinner room. Perhaps she needed his support while wearing that black dress, but David looked more than happy to be so close to her.\"", "description": "The Strictly Come Dancing star was pictured holding hands with his dancing partner and kissing her days before putting on a cosy display at Pride Of Britain awards", "authors": ["Sara-Aisha Kent", "Image", "Backgrid", "Pa", "Mike Marsland Wireimage"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20747589.ece/ALTERNATES/s1200/0_PAY-David-James-struggles-to-keep-his-hands-off-his-Strictly-Dance-Partner-Nadiya-Bychkova-as-they-exit.jpg", "published_at": "2019-10-29"}