{"pub": "businessinsider", "url": "https://businessinsider.com/devin-nunes-claims-democrats-want-nude-pictures-of-trump-2019-9", "downloaded_at": "2019-09-26 16:45:43.050687+00:00", "title": "Rep. Devin Nunes left everyone baffled by claiming Democrats wanted 'nude pictures' of Trump during a House Intelligence hearing", "language": "en", "text": "Rep. Devin Nunes, the Ranking Member of the House Permanent Select Committee on Intelligence, left everyone confused and baffled when he claimed at a Thursday hearing that Democrats wanted \"nude pictures\" of President Donald Trump.\n\nAt the hearing, Acting Director of National Intelligence Joseph Maguire appeared to discuss a whistleblower complaint from an intelligence community official.\n\nThe complaint, released to the public on Thursday morning, alleges that in a July phone call with Ukrainian President Volodymyr Zelensky, Trump undermined US national security by withholding $400 million in military aid to Ukraine to pressure the Ukrainian government to investigate the son of former Vice President Joe Biden.\n\nBoth Trump himself, his personal attorney Rudy Giuliani, and a White House memorandum of the call released on Tuesday confirm many of the details in the complaint.\n\nThe memo shows that Trump said on the call, \"we do a lot for Ukraine. We spend a lot of effort and a lot of time. Much more than the European countries are doing\" before encouraging him to investigate Biden.\n\nRead more: LIVE: Acting DNI Joseph Maguire testifies to Congress about an explosive whistleblower complaint against Trump\n\nNunes has been one of Trump's most staunch defenders on Capitol Hill amid both special counsel Robert Mueller's investigation into Russian interference in 2016 and the latest allegations that Trump compromised US national security.\n\n\"A Ukrainian official was a source for Nellie Orr, wife of Department of Justice official Bruce Orr, as she worked on the anti-Trump operation conducted by Fusion GPS and funded by the Democrats,\" Nunes said, presumably referring to the Steele Dossier, a large report of embarrassing information about Trump funded by the firm Fusion GPS.\n\nHe added: \"Of course, Democrats on this very committee negotiated with people who they thought were Ukrainians in order to obtain nude pictures of Trump,\" not clarifying what nude pictures or which committee members he was talking about.\n\nThe Internet reacted with plenty of bewilderment and confusion to Nunes' claim:", "description": "Nunes has been one of Trump's most staunch defenders on Capitol Hill amid investigations into Russian interference in 2016 and the latest allegations.", "authors": ["Grace Panetta"], "top_image": "https://amp.businessinsider.com/images/5d8cc7582e22af5c3774ff62-1920-960.jpg", "published_at": "2019-09-26"}