{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/30/1938083/0/en/ERES-to-Acquire-Nine-Property-Residential-Portfolio-in-the-Netherlands.html", "downloaded_at": "2019-10-30 16:02:18.626971+00:00", "title": "ERES to Acquire Nine Property Residential Portfolio in the Netherlands", "language": "en", "text": "TORONTO, Oct. 30, 2019 (GLOBE NEWSWIRE) -- European Residential Real Estate Investment Trust (\"ERES\") (TSXV:ERE.UN) announced today it has agreed to purchase from a third party a portfolio of nine properties containing a total of 294 residential suites in five attractive locations in the Netherlands (the “Acquisition Portfolio”). ERES will pay €67.3 million for the portfolio, financed by a new €39.5 million seven-year mortgage bearing an interest rate of 1.55% and a draw on ERES’s revolving credit facility of €26 million, with the balance in cash from the REIT’s recently completed CDN $166.8 million equity offering. Closing is anticipated on or around October 31, 2019.\n\n\n\nThe Acquisition Portfolio is currently 96.6% occupied with a weighted average occupied monthly rent of €937 (C$1,361) per suite, excluding service charge income. Over half of the properties are located in areas where ERES currently owns properties, with seventy-five percent of the rental suites liberalized and not subject to rent control. The Acquisition Portfolio will be managed by CAPREIT’s established regional office in the Netherlands.\n\n“We continue to enhance our size and scale in the strong and vibrant Netherlands residential rental market,” commented Phillip Burns, Chief Executive Officer. “So far this year, we have added 3,319 residential suites to our growing portfolio, increasing our total to 5,410 residential suites with an asset value of €1.18 billion (C$1.7 billion). We expect to continue to grow going forward and further drive value creation for our Unitholders.”\n\nABOUT ERES\n\nERES is an unincorporated, open-ended real estate investment trust. ERES’s Units are listed on the TSX-V under the symbol ERE.UN. ERES is Canada's only European-focused multi-residential REIT, with an initial focus on investing in high-quality multi-residential real estate properties in the Netherlands. ERES currently owns a portfolio of 131 multi-residential properties, comprised of 5,410 suites located in the Netherlands, and two office properties in Germany and one office property in Belgium.", "description": "", "authors": ["Eres Limited Partnership", "European Residential Real Estate Investment Trust"], "top_image": "", "published_at": "2019-10-30"}