{"pub": "investing.com", "url": "https://ph.investing.com/news/stock-market-news/stocks--us-futures-tepid-on-earnings-trade-concerns-67427", "downloaded_at": "2019-10-16 14:10:30.757196+00:00", "title": "Stocks - U.S. Futures Tepid on Earnings, Trade Concerns", "language": "en", "text": "© Reuters.\n\nInvesting.com - U.S. futures dipped on Wednesday as doubts lingered over a partial deal between the U.S. and China, while Bank of America's earnings came in a little ahead of expectations.\n\nChina’s Foreign Ministry said the government would take measures against the U.S. if a bill that supports Hong Kong protesters is passed.\n\nThe law would end a special trading status between the U.S. and Hong Kong until the State Department certifies annually that city authorities are respecting human rights. It was approved by the House and must be voted on by the Senate before becoming law. If it does, it will further complicate the interplay of commercial and political relations between the two countries.\n\nlost 26 points or 0.3% by 6:50 AM ET (10:50 GMT), while fell 75 points or 0.3% and S&P 500 futures were down 9 points or 0.3%.\n\nIn earnings news, Bank of America (NYSE: ) jumped 1.9% after it reported underlying profits that beat analysts' expectations.The lender said underlying net income rose 4% to $7.5 billion, or an adjusted 75 cents a share. A $2.1 billion impairment charge left the final EPS number at a more modest 56c, still just ahead of an expected 51c. Revenue was almost unchanged from a year earlier at $22.8 billion.\n\nAbbott Labs (NYSE: ) is also expected to report ahead of the open.\n\nAfter the close, Netflix (NASDAQ: ), IBM (NYSE: ), CSX (NASDAQ: ) and Kinder Morgan (NYSE: ) will also update markets on their financial results.\n\nPure Storage (NYSE: ) was among the top gainers in premarket trade, jumped 4.8%, while Johnson & Johnson (NYSE: ) rose 1.2%, extending Tuesday's earnings-related gains.\n\nStocks connected with China were lower, with Apple (NASDAQ: ) inching down 0.3%, while Advanced Micro Devices (NASDAQ: ) dipped 0.7% and NVIDIA Corporation (NASDAQ: ) down 0.4%.\n\nOn the data front, for September and a report for October will be released at 8:30 AM ET.\n\nIn commodities, inched up 0.2% to $1,486.45 a troy ounce, while the , which measures the greenback against a basket of six major currencies, was flat at 98.042. were steady at $52.84 a barrel.", "description": "Stocks - U.S. Futures Tepid on Earnings, Trade Concerns", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEAAB17X_L.jpg", "published_at": "2019-10-16"}