{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/syria-isis-relatives-fled-kurdish-camp-after-turkish-airstrike-2019-10", "downloaded_at": "2019-10-13 18:47:05.681667+00:00", "title": "Disaster is unfolding in Syria as videos emerge of US allies being slaughtered and hundreds of ISIS prisoners escape during airstrikes", "language": "en", "text": "As the Turkish invasion into northern Syria proceeds, the region has seemingly descended into violent chaos, with videos emerging of Turkish proxies slaughtering US allies.\n\nIn addition, about 700 relatives of ISIS fighters fled a Kurdish-run detention camp after a Turkish airstrike hit nearby, prompting 13,000 people, mostly displaced refugees, to flee.\n\nThe humanitarian aid group Save the Children confirmed to The New York Times that all foreign nationals, including the women and children who are relatives of ISIS fighters and were being held in a secure facility, had left the camp.\n\nIt is unclear whether the women and children escaped entirely or were apprehended by coalition forces who brought them to a central facility. Sources told the Times \"a mix of the two\" happened.\n\nThe Turkish invasion began shortly after President Donald Trump announced US troops would be repositioning away from Kurdish forces, who have been US allies in the fight against ISIS.\n\nOn Sunday, US Defense Secretary Mark Esper announced that the remaining 1,000 US troops in northern Syria would be withdrawn, as intelligence shows a more expansive Turkish invasion and a possible Kurdish counter-attack in conjunction with Syrian and Russian forces.\n\nVisit Business Insider's homepage for more stories.\n\nAs the fifth day of the Turkish invasion into northern Syria continues, seemingly prompted by President Donald Trump's announcement that US forces would be repositioned away from Kurdish US allies, reports of violent chaos have emerged from the region.\n\nIn addition, a US official told CNN that the campaign to defeast ISIS in Syria is \"over for now,\" and that ISIS \"has a second lease on life with nearly 100,000 [people] who will rejoin their jihad.\" The official said, in their opinion, \"US policy has failed.\"\n\nThe US State Department confirmed that reports show Havrin Khalaf, the civilian secretary general of the Future Syria Party, which is the Kurdish movement, has been captured and killed by Turkish-backed Syrian opposition fighters, in addition to other Kurdish fighters killed by the Turkish proxies.\n\nRead more: The US shared intelligence with Turkey that may have helped it target the Kurds in Syria\n\nVideos have surfaced online showing the Turkish-backed rebel forces slaughtering Kurdish fighters. In one video published by The New York Times, two Syrian Arab fighters restrain a Kurdish prisoner on the ground with his hands tied behind his back and shoot him multiple times.\n\nA Turkish MP from President Recep Tayyip Erdogan's party condemned the execution of unarmed war prisoners on Twitter in response. Turkey considers the Syrian Kurdish People's Protection Units (YPG) to be a terrorist organization. It is the dominant force of the Syrian Democratic Forces (SDF), which has partnered with the US to dismantle ISIS' hold in Syria.\n\nOn Sunday, US Defense Secretary Mark Esper said the remaining 1,000 US troops in northern Syria would be withdrawn, but US officials told The Daily Beast they will just be moved further away from the advancing Turkish forces. A Turkish airstrike nearly hit a small group of US soldiers stationed in Syria on Friday.\n\nA Turkish army armored vehicle advances in Syrian city of Tel Abyad, as seen from the Turkish border town of Akcakale on October 13, 2019 in Akcakale, Turkey. The military action is part of a campaign to extend Turkish control of more of northern Syria, a large swath of which is currently held by Syrian Kurds, whom Turkey regards as a threat. U.S. President Donald Trump recently ordered the withdrawal of U.S. troops from several Syrian outposts near the Turkish border. Photo by Burak Kara/Getty Images\n\nKurdish-held territory in northern Syria has been hit by Turkish airstrikes, freeing some ISIS prisoners in the process\n\nOn Saturday, the Turkish military said it had captured a key town on the Turkey-Syria border that had previously been under Kurdish control. In addition to crossing the northern Syrian border along Turkey's southeastern region, Esper said Sunday that new intelligence shows Turkey will be advancing even further south and west than originally planned.\n\nTrump has called the Turkish invasion a \"bad idea.\" He first announced the repositioning of US troops away from Kurdish allies after a phone call with Erdogan. The New York Times also reported that the US government shared intelligence with Turkey to help it target the Kurdish forces, after a disagreement between Trump and Erdogan over the US arming Kurdish forces.\n\nAs part of its offensive strike thus far, Turkish airstrikes have hit near and in towns south of the border, including near a camp that housed 13,000 people, mostly displaced refugees. Within the camp was also a secured facility that held about 700 women and children who are relatives of ISIS fighters.\n\nRead more: The US is preparing to pull its remaining 1,000 troops out of northern Syria as the Turkish offensive against the Kurds moves forward\n\nAfter the airstrike hit, all foreign nationals, including the ISIS affiliates, fled the camp. The humanitarian agency Save the Children confirmed to The New York Times that the women and children all fled the secured facility, and that some likely escaped, while others were apprehended by coalition forces and taken to a central facility.\n\nOther reports and videos have emerged, suggesting that more ISIS prisoners may have escaped among airstrikes in northern Syria, including potentially dangerous combatants, in addition to the women and children. Kurdish forces guarded ISIS prisoners in the region, but the ability to do so has been greatly impeded by the Turkish invasion.\n\nEsper also told CBS News on Sunday that Kurdish forces were planning a counter-attack against the Turkish military, and were soliciting an allegiance with Syrian fighters and Russian forces. US forces currently stationed in northern Syria could be caught in the crosshairs, prompting the supposed withdrawal.\n\nAnother US official said that a confrontation could occur between violent Turkish proxy forces and US troops unless the Turkish invasion is halted, as the rebel proxies continue to advance further south using extremist, violent tactics.", "description": "Northern Syria is descending into chaos as the Turkish invasion proceeds, with videos emerging of US allies being slaughtered by Turkish proxies.", "authors": ["Kat Tenbarge"], "top_image": "https://image.businessinsider.com/5da354c7cc4a0a59e6554426?width=1200&format=jpeg", "published_at": "2019-10-13"}