{"pub": "vice", "url": "https://news.vice.com/en_us/article/wjwknw/is-your-halloween-costume-offensive", "downloaded_at": "2019-10-23 23:22:36.261199+00:00", "title": "Is Your Halloween Costume Offensive?", "language": "en", "text": "It seems pretty clear: No one should wear blackface — or any costumes that perpetuate racial or ethnic tropes. But every year, politicians and celebrities still get it wrong.\n\nMost recently, a photo emerged of Canadian Prime Minister Justin Trudeau wearing brownface at a 2001 “Arabian Nights”-themed party at the school where he was a teacher. The yearbook photograph shows him wearing a turban and robes with his face, neck, and hands darkened.\n\nOther memorable instances include former Disney star Hilary Duff wearing a pilgrim costume with her then-boyfriend dressed in a Native American costume for a Halloween party in Beverly Hills.\n\n“Halloween is an exhausting time of the year for me,” said Henu Josephine Tarrant, a Native American of the Ho-Chunk, Rappahanock, Kuna, and Hopi tribes. “You're definitely probably going to see something offensive.”\n\n\n\nMany people of color feel belittled when they see their race, ethnicity, or culture turned into a costume.\n\n“If you are dressing up as someone who is supposed to be Mexican, using a sombrero, a mustache, a donkey, that tells me that you don't respect me,” said Sara Hinojos, an assistant professor at Queens College-CUNY. “For me, it’s a reflection of how the mainstream or people are treating Mexicans in general.”\n\nBut there are grey areas, too. What if you dress as a public figure whom you admire, like Barack Obama or Frida Kahlo? What if you dress as a character from a movie?\n\nVICE News brought together six people of color to review a variety of Halloween costumes and discuss how they would feel if they saw someone wearing them.\n\nCover: Nandi Howard and Sarah Deng discuss a Mulan Halloween costume.\n\nEdited by Jessica Opon and Danny Card.", "description": "We asked six people of color how to avoid ruining Halloween.", "authors": [], "top_image": "https://video-images.vice.com/articles/5db081af86c00a00925b312a/lede/1571851475840-haloweenracist34.jpeg?crop=1xw:0.8989xh;0xw,0xh&resize=1200:*", "published_at": "2019-10-23"}