{"pub": "bbc", "url": "https://bbc.com/news/business-49642179", "downloaded_at": "2019-09-09 23:23:22.619094+00:00", "title": "Former PM's Brexit negotiator joins Goldman Sachs", "language": "en", "text": "Image copyright Getty Images Image caption Olly Robbins was Theresa May's chief Brexit negotiator\n\nTheresa May's chief Brexit negotiator Olly Robbins will join investment bank Goldman Sachs after a sabbatical, the Cabinet Office has said.\n\nThe civil servant headed talks which led to the former prime minister's withdrawal agreement which formed the basis for the UK's exit from the EU.\n\nHowever, the deal repeatedly failed to get through Parliament, prompting Ms May to resign earlier this year.\n\nMr Robbins, 44, announced he would quit his role shortly afterwards.\n\nThe civil servant attracted criticism from prominent Brexit supporters who accused him of being too pro-EU.\n\nBut new Prime Minister Boris Johnson - who has himself has been fiercely critical of the withdrawal agreement - paid his own tribute to Mr Robbins on Monday.\n\n'Dedication to public service'\n\nMr Robbins will first spend a sabbatical at the University of Oxford, becoming the first holder of a visiting fellowship set up in memory of former Cabinet Secretary Jeremy Heywood.\n\n\"I am delighted that Olly will be the first permanent secretary to take up this fellowship in Jeremy Heywood's memory, which follows his many years of dedication to public service in a variety of different roles,\" Mr Johnson said.\n\nMr Robbins will leave the civil service at the end of the fellowship to become a managing director in Goldman Sachs' Investment Banking Division.\n\nHe will join former European Commission President Jose Manuel Barroso, who is the non-executive chairman of Goldman Sachs International.\n\nHe is not the only British politician to have gone into finance. Former Chancellor George Osborne earns £650,000 a year in a role with US investment fund Blackrock, while former Labour Chancellor Alistair Darling is a non-executive director at investment bank Morgan Stanley.", "description": "Olly Robbins, who helped negotiate the EU withdrawal agreement, will join the bank after a sabbatical.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/14E26/production/_108724558_gettyimages-1130398553.jpg", "published_at": "2019-09-09"}