{"pub": "nymag", "url": "https://vulture.com/2019/10/felicity-huffman-jail-time-cut.html", "downloaded_at": "2019-10-16 20:55:01.711589+00:00", "title": "Felicity Huffman Is Leaving Jail One (1) Day Early", "language": "en", "text": "Photo: Joseph Prezioso/AFP/Getty Images\n\nSurprise! Felicity Huffman will be serving only 13 days in jail for her involvement in the college-admissions scandal, as opposed to her original 14-day sentence. Per TMZ, the day Huffman was taken in and booked at the Federal Correctional Institution in Dublin, California, will be counted as one full day, even though she was only in custody for a few hours. And you know what — our scammin’ gal is keeping busy! As People reports, Huffman is enjoying 5 a.m. wake-up calls and round-the-clock meal service in her chic inmate uniform and has been given a window of 14 hours for outdoors time. She can also listen to music on a “pre-approved device” or fiddle with “one in-unit craft project at a time” if she wants to embrace her inner crochet and/or origami queen.\n\nEarlier this year, Huffman pleaded guilty to conspiracy to commit mail fraud and honest-services mail fraud and promptly released a statement of contrition. With her plea, Huffman admitted that she paid an admissions consultant $15,000 to get a higher SAT score for her oldest child. “I am in full acceptance of my guilt, and with deep regret and shame over what I have done, I accept full responsibility for my actions and will accept the consequences that stem from those actions,” she wrote, in part. “I am ashamed of the pain I have caused my daughter, my family, my friends, my colleagues and the educational community.” The other prominent Hollywood figure involved in “Operation Varsity Blues,” Lori Loughlin, has pleaded not guilty. She will face trial in Boston in early 2020.", "description": "Felicity Huffman will leave jail one day early, meaning she’s only going to serve 13 days out of her 14-day sentence.", "authors": ["Devon Ivie"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/10/16/16-felicity-huffman.w1200.h630.jpg", "published_at": "2019-10-16"}