{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/neighbours-complain-ongoing-problems-chelsea-rental-1.5268991", "downloaded_at": "2019-09-03 23:44:23.739407+00:00", "title": "Neighbours call for end to Chelsea 'party palace' | CBC News", "language": "en", "published_at": "2019-09-03", "text": "Neighbours on a quiet street in Chelsea, Que., are calling on the municipality to shut down a \"party palace\" they say is keeping them up at night.\n\nThe house on Musie Loop had been listed on Airbnb and at least one other short-term rental site since January 2018, but the listings were recently removed or disabled. It was listed as a \"Luxury Mansion with Indoor Pool and Sauna.\"\n\nThis [home] is completely disruptive to this quiet neighborhood here, and it's not fair to the taxpayers. - Tom Riefesel, neighbour\n\n\"The parties, they go on all night to where we can't sleep at night sometimes,\" said Karen Keanie, who has lived on the street for seven years.\n\nKeanie said there have been two or three disturbances per month for the past 18 months.\n\n\"We don't know who's living there, so when there are fights breaking out we don't know if it's going to come out onto the street,\" she said.\n\nAccording to this listing, the home has six bedrooms, four bathrooms, two wood fireplaces, a sauna, pool and three-car garage, all five minutes from Old Chelsea and near Nordik Spa-Nature. (bnb Daily)\n\nNeighbour called police\n\nKeanie said she's called police twice, once in July to report a large party that lasted until 3 a.m. and included fights in a neighbour's driveway, and again in August, when she said she witnessed a young woman being dragged from the passenger side of a car.\n\n\"She was screaming, 'Let me out, let me go!' and then [the car] sped off,\" Keanie said.\n\nKeanie said she wants to see stricter regulation of short-term rentals like the one on her street, and penalties when there are noise complaints.\n\n\"The municipality and municipal staff need to do what the citizens of Chelsea have put them in place to do, and they need to do their job and to shut things like this down,\" said Tom Riefesel, who also lives down the street from the home.\n\n\"This [home] is completely disruptive to this quiet neighborhood here, and it's not fair to the taxpayers,\" he said. \"The hollering that goes on when people are driving up the road looking for the place — 'Where's the party palace?' and that sort of thing.\"\n\nNeighbours also complain about garbage being left strewn in front of the home.\n\nChelsea Coun. Kay Kerman said she's heard numerous complaints about garbage, noise and fights at the property on Musie Loop. (Kimberley Molina/CBC)\n\nComplaints a surprise to owners\n\nBut the home's owners, Paul and Lindsay Azar, who said they bought the property in December 2017, expressed surprise when they learned neighbours have been disturbed.\n\n\"No one's ever contacted us,\" Lindsay Azar told CBC News. \"We're nice people.… We have good values, good morals. We don't want to disturb any neighbours, ever.\"\n\nThe couple, who gave CBC a partial tour of the home, said they've rented the property out on sites like Airbnb, and also loaned their house to family, friends and real estate clients, but said they spend at least half of the time living there themselves, when they're not in Ottawa or Montreal.\n\nLindsay Azar blames problems with garbage on poor curbside pickup.\n\nThe couple is inviting neighbours to contact them if they have concerns.\n\n\"If you Google my name, you'll find my phone number, my email, everything,\" Paul Azar said.\n\nBylaws forbid Airbnb rentals\n\nThe municipality's zoning bylaws don't allow short-term rental accommodation unless the owner of the home is present, such as a bed and breakfast, according to Chelsea Mayor Caryl Green.\n\nThe municipality is in the process of drafting a specific policy to address short-term rentals, but is waiting for the Quebec government to come out with its own law, she said.\n\n\"This particular case is pretty unique,\" said Chelsea Coun. Kay Kerman, whose ward contains Musie Loop.\n\nShe said she knows of other short-term rental properties in the area, but the house on Musie Loop is the only one generating complaints.\n\n\"We have neighbours who are anxious every weekend, [thinking] 'What now? What's it going to be this week?' I mean, it really has disrupted the everyday life of the people in this neighbourhood.\"\n\nWarnings, fines\n\nA new policy may limit the number of days a home can be rented out, or allow for warnings or fines for the owners of problem properties, Kerman said.\n\nThe municipality may also decide to send in private security companies to break up parties when bylaw officers aren't immediately available, she said.\n\nSeveral residents are planning to raise the issue with councillors at a public meeting Tuesday night.\n\nThe Azars said they would be willing to participate in any public consultations on a new short-term rental policy, and agree there should be regulations governing such properties.", "description": "Neighbours on a quiet street in Chelsea, Que., are calling on the municipality to shut down a \"party palace\" they say is keeping them up at night.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5269059.1567539989!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/tom-riefesel-chelsea-neighbour.JPG"}