{"pub": "yahoo", "url": "https://news.yahoo.com/real-threat-why-russias-air-120000306.html", "downloaded_at": "2019-10-13 18:41:56.552919+00:00", "title": "A Real Threat: Why Russia's Air Force Should Be Taken Seriously", "language": "en", "text": "Key point: Although behind America, Russia's air force is rapidly improving.\n\nWhen it comes to air power, it’s no secret that the United States and the West have often held an edge over Russia.\n\nThis dates at least as far back to World War II, when the United States and Britain were allied with Russia. While Russia supplied much of the manpower that ultimately defeated Nazi Germany, it was the United States and UK that took the lead in the strategic bombing campaigns against Germany. These trends largely continued during the Cold War, when the Warsaw Pact was numerically superior to NATO but the latter held the technological advantage, including in terms of aircraft. And even today, Russia’s Air Force doesn’t yet boast anything comparable to the latest American fifth-generation fighter jets like the F-22 Raptor and F-35 Joint Strike Fighter (JSF).\n\nThe fact that Russia hasn’t reached parity with the most advanced air force in the world should not detract from the fact that Moscow has produced some formidable aircraft over the years. Moreover, Moscow has proved willing to sell its aircraft to nations both large and small that the United States and Europe have shunned. And since many countries around the world don’t have a need for the most advanced technologies that Western planes boast, Russian aircraft often is an attractive, cheaper alternative to purchasing planes from the United States or European powers.\n\nAs a result, many air forces around the world are built around Soviet and Russian-made planes, or derivatives from them. And, with Russia undertaking a massive military modernization program in the coming years, this is likely to be true to a large extent for decades to come (albeit, Russia is likely to face greater competition from emerging defense exporters like China).\n\nAs such, any serious observer of air power around the world must have an appreciation of Russia’s top military planes. Here are several of the most dangerous ones:\n\nSukhoi Su-27\n\nSukhoi’s Su-27 (NATO reporting name “Flanker”) was the Soviet’s answer effort to then-new American aircraft like the F-15 and F-16. The plane conducted its maiden flight in the late 1970s and was introduced into service in the Soviet Air Force in 1985.\n\nRead the original article.", "description": "And why countries love to buy them.", "authors": ["Evan Gottesman"], "top_image": "https://s.yimg.com/uu/api/res/1.2/EjnaIioGJHsSFsDOLgZI5g--~B/aD05NjU7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_national_interest_705/0d1e13ff4bfeebe3128f7269f93b1c74", "published_at": "2019-10-13"}