{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/05/tennessee-wide-receiver-who-joked-about-losing-georgia-state-leaves-program", "downloaded_at": "2019-09-05 02:11:56.881226+00:00", "title": "Tennessee wide receiver who joked about losing to Georgia State leaves program", "language": "en", "published_at": "2019-09-05", "text": "\n\nThe Tennessee Volunteers suffered arguably the biggest upset of college football's opening week, losing to Georgia State, 38-30, on their home turf. (Silas Walker/Getty Images)\n\nTennessee wide receiver Jordan Murphy, who retweeted a joke about his team’s stunning 38-30 loss Saturday to Georgia State, is leaving the program, Volunteers Coach Jeremy Pruitt said during Wednesday’s Southeastern Conference coaches’ teleconference.\n\nMurphy did not play in the upset loss against the Football Championship Subdivision squad that went 2-10 in 2018. Pruitt said on Monday that the junior wideout, who caught 11 passes for 155 yards and a touchdown in 10 games last season, had been sick over the past week.\n\nEarlier this week, Murphy retweeted a joke poking fun at the Vols’ loss and the fact that the winning team also received $950,000 to play them. Murphy replied with the comment, “man y’all can’t tell me this ain’t funny.” He later deleted the tweet and temporarily deactivated his account after drawing the ire of angry Volunteers fans.\n\nTennessee’s Jordan Murphy tweeted this after the UT loss\n\n\n\nIt isn’t going over well with Vol fans pic.twitter.com/EJ3Wuzbryl — Matt Jones (@KySportsRadio) September 2, 2019\n\nHe has since reactivated his account and has been retweeting both supporters and those who are still angry with him for making light of the memorable loss.\n\nOne supportive note may have shed some light on Murphy’s decision to leave the Volunteers. In a tweet that tagged Murphy, the user posted, “He had to endure the biggest loss anyone can have as a teen his mom passed while at TN …”\n\nMurphy then replied, “Thank you ma.”\n\nPruitt confirmed that defensive back Terrell Bailey is also leaving the program. Bailey, a redshirt sophomore from New Orleans, also didn’t play against Georgia State. He appeared in nine games as a backup outside linebacker and special teams contributor in 2018. Pruitt said both players chose to leave the program.\n\nGeorgia State’s win over Tennessee was its first over a Power Five team since the program launched in 2010.\n\nTo rub salt in the wound, one Georgia State player said this week that a fellow FCS opponent will be a more difficult challenge than the SEC’s Volunteers.\n\n“I think (Furman) will give us a tougher battle than we faced Saturday, if you want to be honest,” safety Remy Lazarus told the Atlanta Journal-Constitution.\n\n“At the end of the day we won, they lost,” Panthers quarterback Dan Ellington said Monday. “We were just the better team. We went out and played and had a lot of fun that day I don’t think they had a lot of fun. I know their fans didn’t have fun.”\n\nMore college sports:\n\nYour college football team rolled in its opener. How excited should you really be?\n\nMichigan vs. Army is a guarantee game — it guarantees worry for both coaches\n\nIt was nice of Stephen Curry, but Howard University has issues a golf team won’t fix", "description": "Junior wideout Jordan Murphy didn't play in the Volunteers' stunning season-opening loss.", "authors": ["Jake Russell", "Sports News Aide", "September At Pm", "Jake Russell Has Been A Sports News Aide", "Blogger With The Washington Post Since His Book", "Things Nationals Fans Should Know", "Do Before They Die", "Was Published In"], "top_image": "https://www.washingtonpost.com/resizer/gqjYjcW_fErj8KlCec_o6bA20Dw=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/EXJ5IMWMEUI6TFQVR4NDFFROAQ.jpg"}