{"pub": "cbc", "url": "https://cbc.ca/arts/inthemaking/walter-scott-s-wendy-comics-depict-the-hilarious-and-tender-misadventures-of-an-aspiring-artist-1.5304774", "downloaded_at": "2019-10-03 07:17:17.137398+00:00", "published_at": "2019-10-02", "title": "CBC Arts", "language": "en", "text": "In Walter Scott's episode of In the Making, now streaming on CBC Gem, host Sean O'Neill joins Walter as he goes home to Kahnawá:ke, where he first started drawing comics as a kid, and as he debuts material from his new book in Montreal, the city where the character of Wendy was born. The \"Wendy-verse\" is woven throughout the episode, with animations created by Walter that bring Wendy to lo-fi yet remarkably vivid life. What is the Wendy-verse? Below, Sarah-Tai Black tells you all about it and why Wendy — and Walter — matter to her.\n\n\"I'm an artist and I have creative block. Also, I feel numb to my own experience of the world.\"\n\nLying on a couch, Kahnawá:ke-born artist Walter Scott's titular comic character Wendy speaks to her therapist in her trademark starkly self-conscious tone. This self-consciousness is not so much a heightened sense of self-awareness, but more a vulnerability of experience that is then flattened by Wendy herself — a way of navigating personal exposure in the wake of sharing certain depths of feeling. It's an emotional reflex that many can relate to, especially those who have spent the majority of their lives existing alongside the deeply ironic tone of post-2000s internet culture. At what point is it alright to be truly sincere about our interior lives, and publicly so? What might it mean to make art that centres around exactly such earnestness?\n\nThe creator of the Wendy comics, which follow the misadventures of a messy yet lovable aspiring artist, debuts material from his new book in Montreal, the city where Wendy was born. 5:10\n\nToronto-based Scott's Wendy series strikes the perfect balance between this ironic instinct and its ability to intuit and empathize with the myriad states of mind that exist anywhere in the vicinity of what may be called arts culture. Wendy herself is the perfect image of the white, middle-class \"art girl.\" A healthy dose of self-loathing and privilege patterns her world, but Scott never fully makes her the butt of the joke. Wendy is but one art world archetype his sympathetic satire works on with a prismatic sense of being. Wendy is all of us, and if she's not, then she's certainly someone we know.\n\nThere is a radicalism in a First Nations artist like Scott presenting us with the character Wendy (and the real-world typographies that go along with her) and using that same figure to bend our perception of what is and isn't stable or even known. Alongside the characters that Scott introduces and supports in relation to Wendy — or moreso, that Wendy herself is set in negative or positive relief to — there is a semi-autobiographical element to Wendy that destabilizes who exactly we think she might be.\n\nShe's self-involved both from a place of emotional immaturity as well as from the endurance needed to make art from the personal. She has trouble producing work or socializing or even waking up on time. She drinks to forget or because she's bored or because she's overcorrecting for having spent so much time alone trying to create or because she's just feeling reckless. She is talented but she doesn't know exactly what her talents are, or even what the purpose of those talents and their output may be. She's neurotic and otherwise a mess, but she also goes to therapy and is known to go to bed early with a cup of tea.\n\nWendy is the kind of art that is deeply personal in that it speaks directly to the origins of its making: the vulnerabilities we talk about in hushed tones; our failures — perceived or real — in the face of productivity, \"professionalism\" and respectability; the kind of work we wish more gallerists and curators and editors were interested in nurturing; the messy reality of lives seen largely to function as producers of culture, whatever that means. Wendy is the kind of work that perfectly exists precisely because it was never intended as work. And [extreme Wendy voice] isn't that what art is supposed to be?\n\nWendy. (Walter Scott)\n\nIn the Making takes you on an immersive journey inside the lives and work of Canada's leading artists. Stream the whole season now on CBC Gem, or watch it on CBC-TV Friday nights at 8:30 p.m. (9 p.m. NT).", "description": "In his sympathetic satire, Wendy is all of us — and if she's not, then she's certainly someone we know.", "authors": ["Sarah-Tai Black Is An Arts Curator", "Film Programmer", "Writer", "Speaker Who Lives", "Works In Toronto."], "top_image": "https://i.cbc.ca/1.5304851.1570028204!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/wendy.jpg"}