{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7601691/Shakhtar-Donetsk-2-2-Dinamo-Zagreb-Dodo-rescues-point-Ukranian-champions.html", "downloaded_at": "2019-10-23 11:07:49.123669+00:00", "title": "Shakhtar Donetsk 2-2 Dinamo Zagreb: Dodo rescues point for Ukranian champions", "language": "en", "text": "Shakhtar Donetsk scraped a 2-2 home draw against Dinamo Zagreb after the Ukrainian side took the lead and then came from behind in a pulsating Champions League Group C clash on Tuesday.\n\nThe result left both sides on four points from three games, two adrift of leaders Manchester City who were at home to Italian rivals Atalanta in the evening fixture.\n\nYevheniy Konoplyanka fired Shakhtar into a 16th-minute lead when he took a sublime pass from Brazilian-born midfielder Marlos into his stride and steered the ball past Dinamo keeper Dominik Livakovic from a tight angle.\n\nDodo (right) celebrates after scoring Shakhtar's second goal in a 2-2 draw with Dinamo Zagreb\n\nMislav Orsic (centre) celebrates after scoring the penalty which gave Dinamo Zagreb a 2-1 lead\n\nAfter being booked, Andriy Pyatov sees the resulting penalty fly past him and into the net\n\nMATCH FACTS Shakhtar: Pyatov, Bolbat (Dodo 66), Krivtsov, Matvyenko, dos Santos, Stepanenko, Lourenco, Marlos (Kovalenko 84), Taison, Konoplyanka (Solomon 66), Júnior Moraes Subs not used: Shevchenko, Khocholava, Marcos Antônio, Dentinho Bookings: Lourenco, Pyatov, Bolbat Goals: Konoplyanka (17), Dodo (75) Zagreb: Livakovic, Stojanovic, Théophile-Catherine, Dilaver, Peric, Leovac, Olmo, Ademi (Gojak 68), Moro, Orsic, Gavranovic (Petkovic 62) Subs not used: Zagorac, Hajrovic, Gojak, Situm, Ivanusec, Petkovic, Kadzior Bookings: Stojanovic, Peric, Dilaver, Ademi Goals: Olmo (25), Orsic (60) Referee: Antonio Miguel Mateu Lahoz\n\nThe home side's joy was short-lived, however, as the Croatian champions levelled nine minutes later when Spaniard Dani Olmo beat goalkeeper Andriy Pyatov to a Mislav Orsic cross and tucked the ball in at the near post.\n\nOrsic hit the woodwork after a dazzling solo run from deep inside his own half in the 49th minute before he gave Dinamo the lead on the hour as Shakhtar conceded a bizarre penalty.\n\nPyatov needlessly wrestled striker Mario Gavranovic to the ground as a corner was swung in and after a quick VAR check, Orsic blasted the spot-kick into the top corner.\n\nShakhtar got their equaliser in the 75th minute when Alan Patrick released Dodo with a defence-splitting pass and the second-half substitute rounded Livakovic before driving the ball home past two defenders on the line.\n\nOlmo missed a chance to grab a late winner for the visitors as he raced down the right flank and hit the outside of the post with a fizzing low shot.\n\nShakhtar players celebrate after taking the lead in the Champions League Group C match\n\nYevhen Konoplyanka pokes the ball beyond Dinamo Zagreb goalkeeper Dominik Livakovic\n\nDinamo Zagreb players celebrate after Dani Olmo's equalising goal in Kharkiv", "description": "Shakhtar Donetsk scraped a 2-2 home draw against Dinamo Zagreb after the Ukrainian side took the lead and then came from behind in a pulsating Champions League Group C clash on Tuesday.", "authors": ["Sportsmail Reporter", "Zoran Milosavljevic"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/19/20050208-0-image-a-12_1571770030497.jpg", "published_at": "2019-10-22"}