{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/9/colorado-editorial-roundup", "downloaded_at": "2019-10-09 22:11:28.381765+00:00", "title": "Colorado Editorial Roundup", "language": "en", "text": "The Durango Herald, Oct. 9, on homelessness problem being linked to mental illness and drugs:\n\nYou may have noticed that Durango shepherded part of its small homeless population at the end of September from an area near the Tech Center, where they were not supposed to camp, to a new site near the Purple Cliffs, behind Home Depot.\n\nWe are doing a little more than shuffling the homeless around in lieu of a solution to their predicament, but here is the kicker: So is everyone else, pretty much, in cities big and small. No one has found a solution - and it may be because no one has accurately diagnosed the problem.\n\nLos Angeles has about 44,000 people living on the streets within its city limits, a figure that is still growing, apparently.\n\nMichael Shellenberger, a California-based environmental activist, recently wrote a three-part series on California’s problem with homelessness for Forbes.com. “How did things get so bad in California?” he asks.\n\n“The state has long prided itself on being humanistic and innovative. It is home to some of the world’s largest public health philanthropies, best hospitals and most progressive policies on mental health and drug addiction. The Democrats have a super-majority. What went wrong?”\n\nAfter talking with front-line experts, including advocates for the homeless, Shellenberger, who identifies as a progressive, determines that this visible homelessness - people living on the streets - has been exacerbated by hyper-progressivism.\n\n“California made homelessness worse by making perfect housing the enemy of good housing, by liberalizing drug laws and by opposing mandatory treatment for mental illness and drug addiction,” he writes.\n\n“Homeless” is probably the wrong term and the wrong diagnosis for many of these street people. Neither a straight nor a crooked line, for example, can be drawn from a lack of affordable housing or a housing shortage to them.\n\n“I’ve rarely seen a normal, able-bodied, able-minded, non-drug-using homeless person who’s just down on their luck,” Los Angeles street physician Susan Partovi told Shellenberger. “Of the thousands of people I’ve worked with over 16 years, it’s like one or two people a year. And they’re the easiest to deal with.”\n\n“One hundred percent of the people on the streets are mentally impacted, on drugs, or both,” Rev. Andy Bales of L.A.’s Union Rescue Mission tells him.\n\n“Most of the time what people mean by the homelessness problem is really a drug problem and a mental illness problem,” Shellenberger reiterates.\n\nWhat is primarily wanting is not housing, which Los Angeles and other California communities have built at exorbitant cost, with relatively few units to show for it, but treatment for addiction, mental illness and their combinations. Some services are already available but are underused or ineffective more than underfunded.\n\nThat leaves involuntary commitment - but commitment to better therapeutic care.\n\nEven the best possible care probably would be less expensive than building housing, even tiny homes, for the number of people on the streets (or in designated campgrounds) who actually want homes or are able to make socially good decisions about housing.\n\n“The ACLU will come after me if I say the mentally ill need to be taken off the street,” Partovi tells Shellenberger, “so let me be clear that they need to be taken care of, too.”\n\nThere seem to be three pressing problems bedeviling the U.S. Two of them, the lack of access to affordable health care and global warming, get plenty of attention from about half of American politicians; Democrats and other reformers at least pay attention to them and generally are divided between moderate or incremental solutions, on the one hand, and radical plans to solve them by regulating capitalism more and redistributing wealth.\n\nThey do not talk as often about the third, much as it stares them in the face, on Skid Row or on a corner in downtown Durango; perhaps because we still do not know what to properly call it, or what it is; and because the remedy may fit no ideology but real and practical care.\n\nEditorial: https://bit.ly/30Z3G8H\n\n___\n\nThe Steamboat Pilot & Today, Oct. 8, on supporting a property tax providing funding for fire and EMS services:\n\nThis November, Steamboat Springs voters are being asked to approve the city’s first property tax in four decades. The two-mill levy would support the city’s fire department and EMS services, and we are endorsing the ballot question.\n\nThe process leading up to Steamboat Springs City Council’s decision to place 2A on the ballot was well thought out and involved the formation of a citizens advisory committee, tasked with studying the need and investigating various funding solutions. This committee included commercial property owners, who will be hit hardest by a property tax, as well as other key stakeholders.\n\nAnd after months of study and discussion, including talk of a 9-mill levy at one time, City Council opted to pursue a more conservative ask as recommended by the citizens committee.\n\nSteamboat is currently one of only seven cities out of 272 in the state that does not have a property tax, and we believe it’s time for voters to change that. A property tax provides the city with a much more predictable source of revenue, and it also requires second homeowners to pay their fair share for city services.\n\nReferendum 2A would be new money used to fund the hiring of additional firefighters. A portion of the revenue, above the cost of adding firefighting staff, would allow the city to begin saving for a new fire station. The tax revenue would not become part of the general revenue fund, and it would not be used to fund existing needs.\n\nIn our opinion, the need for additional firefighters is well documented. Steamboat Springs Fire Rescue has not added to its staff since 2010, and during the past nine years, call volume has increased by 42%. This year, calls are expected to surpass 2,500, and the department’s strategic plan has identified a clear need for more staff to handle a rising number of calls, which are driven by population growth and an increase in tourism.\n\nAccording to standards established by the National Fire Protection Association, 15 firefighters should respond to an actual fire, but now, the city has only eight firefighters to send to a fire call. If 2A should pass, Fire Rescue would be able to send 12 firefighters to the scene, bringing Steamboat closer to best practices.\n\nAdditional firefighting staff also means Fire Rescue has more manpower to cover the times when there are concurrent calls. According to statistics compiled by Fire Rescue, about 700 of the roughly 2,400 calls firefighters have responded to so far in 2019 have been concurrent calls, which leads to longer response times and more stress on department staffing, often requiring off-duty firefighters to be called in to assist.\n\nThe two-mill property tax is projected to generate about $1.4 million to $1.5 million annually. It will cost residential homeowners $15 a year per $100,000 actual valuation, and because of the Gallagher Amendment, commercial property owners will pay about four times that amount - $58 per $100,000 of actual valuation. The citizens advisory committee indicated they believed local businesses would support 2 mills but no more, and so, we believe this tax does not overburden commercial property owners.\n\nThe wording in the ballot language is very specific and mandates the tax revenue can only be used for funding new fire and EMS staff and a new fire station. The proposal is not extravagant, and it does not fully fund all that is laid out in Fire Rescue’s strategic plan, but it does allow the city to begin chipping away at the need for more firefighters to handle a steadily increasing call volume.\n\nIn particular, the property tax would pay for three additional firefighters in 2020 and four in 2021. And it should be noted that it takes three firefighters to fill one position when you’re staffing a fire station 24/7.\n\nWe believe Fire Rescue’s increasing call volume and current staffing level are putting public safety at risk, and we urge city residents to vote “yes” on 2A. This property tax will improve emergency and fire protection services in the city by decreasing response times, especially in the case of concurrent calls, and provide a mechanism for second homeowners to pay for fire protection, which we think is only fair.\n\nEditorial: https://bit.ly/2MvMJNS\n\n___\n\nThe Boulder Daily Camera, Oct. 5, on an affordable housing measure:\n\nThe need for more affordable housing in Boulder might be the most persistent and vexing problem city leaders grapple with. A pair of city council members has proposed a partial solution, which requires voter assent in November. The Camera Editorial Board recommends approval.\n\nThe measure that voters will be asked to consider - Boulder Ballot Issue 2I - would establish a Middle-Income Housing Program. Details are yet to be nailed down, but the program would work something like this: The city would borrow up to $10 million that it could in turn use to lend to qualified Boulder homebuyers who are otherwise priced out of the city. To qualify, a homebuyer would have to have worked in Boulder for at least two years and earn a maximum 120% of area median income (about $96,000 a year for a one-person household). The buyer would also have to meet asset restrictions. The program would help the qualified buyer purchase a home in Boulder that costs no more than the local median sales price (recently pegged, when the city compiled an information page about the proposal, at about $920,000 for a single-family residence and $435,000 for a condo or townhouse).\n\nThe buyer would contribute a down payment of at least 5%, and a commercial lender would cover much of purchase price. But the Middle-Income Housing Program would fill whatever gap might remain, up to a limit of maybe $150,000, between those amounts and the total sales price.\n\nThe city offers this example: Say an eligible applicant wants to buy a $600,000 home but qualifies for a commercial loan of only $432,000. The buyer contributes a 5% down payment, or $30,000, leaving a shortfall of $138,000 - this is the amount the city program would cover, through a second mortgage. The buyer would have to pay back the city - for example through refinancing or sale of the home - after 10 years.\n\nIn exchange for city assistance in buying a home, the buyer would agree to a permanent deed restriction that would limit any increase in the home’s market value to something like 2% appreciation per year. Every home purchased through the Middle-Income Housing Program would therefore become permanently affordable for middle-income buyers, and those homes would become increasingly affordable relative to market-rate homes so long as market appreciation outpaces the program’s appreciation cap.\n\nThe program has several attractive features. For one, it comes with little financial risk to the city. The city would take on debt only as qualified buyers step up to participate in the program, and the administration and investment-related costs are expected to be low, especially when weighed against the promise of these community benefits: an expanding affordable housing stock that doesn’t depend on new construction, and a reduction of the roughly 60,000 daily commutes to the city from elsewhere in the metro area. In cases where a buyer is unable to pay back the city after 10 years, the program would have a hardship provision designed to help participants avoid foreclosure. Though a deed restriction would cap the underlying appreciation of the home’s value, the restriction would not apply to capital improvements, such as a renovated kitchen, by which the owner could accrue extra equity.\n\nSome reservations are warranted. The ballot issue would merely authorize the city to incur debt to create permanently affordable housing for middle-income buyers, and all the details of the program would be left to future city councils to deliberate and adjust. Proponents say this gives the city flexibility to fine-tune the program as market conditions warrant, but it also leaves voters somewhat unsure about exactly what they’re voting on. The Middle-Income Housing Program is a pilot program, and nobody knows how many buyers would in fact want to participate. Even if the program proves popular, it would be expected to help convert to permanently affordable at most maybe 100 homes, unless the program is later expanded. Capacity participation would present its own problem, because at that point program participants who seek to sell their homes might have trouble finding a buyer, since the next eligible buyer would likely need city assistance that no longer would be available if the full $10 million is already spoken for.\n\nProponents insist the program will require relatively little staff time and expense, but it will involve some measure of new municipal bureaucracy. It’s reasonable to worry that the program could be spoiled by too much red tape, given the city’s checkered customer service reputation. The city’s goal is to make buyers in the program no less attractive to sellers than traditional buyers with a mortgage (as opposed to cash buyers). The program would pre-qualify participants, largely by accepting the qualifying status conferred by commercial lenders on the first mortgage. But other factors, such as a buyer education requirement, have the potential to compromise participants’ standing in the market. Interest rates in recent years have remained comparatively low, but what if they shoot up in future years? In such a scenario, Middle-Income Housing Program participants could face serious challenges when they try to refinance.\n\nBoulder has succeeded in expanding its low- and moderate-income housing stock - almost 8% of homes in the city are permanently affordable in these categories (compared to a city goal of 15 - but middle-income buyers find it increasingly difficult to afford a Boulder home. The Middle-Income Housing Program, developed by Council members Sam Weaver and Bob Yates, promises some relief. The proposal comes with some risks, but they are minimal, and the likely outcome is that dozens of families who otherwise could not do so will have an opportunity to put down roots in the community where they work.\n\nEditorial: https://bit.ly/2Vu3YDs\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The Durango Herald, Oct. 9, on homelessness problem being linked to mental illness and drugs:", "authors": ["The Washington Times Http", "The Associated Press"], "top_image": "", "published_at": "2019-10-09"}