{"pub": "foxnews", "url": "https://foxnews.com/media/mark-levin-kavanaugh-democrats-new-york-times", "downloaded_at": "2019-09-17 08:25:27.501240+00:00", "title": "Mark Levin blasts Dems, New York Times for trying to 'intimidate' Kavanaugh", "language": "en", "text": "The Democratic Party and the New York Times are united in their quest to intimidate people within President Trump's orbit, as well as the commander-in-chief himself, according to Mark Levin.\n\nThe supposed bombshell from The Times on Supreme Court Justice Brett Kavanaugh is the latest development in that apparent mission, Levin claimed Monday on \"The Mark Levin Show on Westwood One.\"\n\n\"We have an effort now by The New York Times and the Democrats to try and intimidate and threaten a Supreme Court justice,\" he said.\n\n\"No more talk about an 'independent judiciary'.\"\n\nNYT UPDATES KAVANAUGH 'BOMBSHELL' TO NOTE ACCUSER DOESN'T RECALL ALLEGED ASSAULT\n\nLevin added that Democrats and the mainstream media have been outraged whenever Trump questions a court decision -- but are fine with disseminating scurrilous allegations against a justice.\n\n\"You heard a cacophony of howling hyenas in the media,\" he said of blowback against Trump.\n\n\"But here we have virtually every -- not all -- virtually every Democrat running for the presidential nomination of their party calling for the impeachment of Kavanaugh -- they even don't have all the facts.\"\n\nThe \"Life, Liberty & Levin\" host added Democrats are using the term \"impeachment\" to stymie any official, including the president, with whom they disagree.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"This word... means anyone to whom they lose an election -- anyone who winds up on a court who they don't want to wind up on a court, they're now threatening to remove them,\" he said.\n\n\"This is the... mindset of the modern-day Democratic Party that celebrates AOC, Tlaib and Omar, and of course the Democratic Party press.\"\n\n\"Their primary target is our president, but anyone in his orbit... anybody who dares to vote for him, support him, speak out for him needs to be destroyed,\" he said of the media.\n\nThe former Reagan White House official continued, saying those repeatedly trying to damage Kavanaugh want to be in his head when he is writing his judicial opinions.", "description": "The Democratic Party and the New York Times are united in their quest to intimidate people within President Trump's orbit, as well as the commander-in-chief himself, according to Mark Levin.", "authors": ["Charles Creitz"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/Mark-Levin1.jpg", "published_at": "2019-09-17"}