{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/09/im-lifehacker-food-editor-claire-lower-and-this-is-how-i-eat", "downloaded_at": "2019-09-24 01:14:02.096002+00:00", "title": "I'm Lifehacker Food Editor Claire Lower And This Is How I Eat", "language": "en", "text": "Image: Supplied\n\nHello. It’s me, Claire. I’m the food editor here at Lifehacker, and as we’re taking a look at how the Lifehacker staff works, I thought I’d show you how I eat. In order to maintain the conversational flow of How I Eat, I had my boyfriend conduct the interview. Below you will find answers to all sorts of interesting questions such as “How much Diet Coke do you drink?,” “Is a corndog a breakfast food?,” and “What is ‘snack salt’?” Enjoy.\n\nCurrent gig: Food editor at Lifehacker\n\nWhat do you eat for breakfast?\n\nMost work days I don’t eat breakfast. When I wake up I’m too nervous to eat breakfast, and I usually start working right away. How I structure my day is I write my first article of at around 7:30 a.m. because it has to go up by 9, which is noon on the East Coast. So I roll out of bed, do that, and then usually write my second article. Sometimes that requires cooking something, but it’s usually not breakfast food. If I’m lucky it’s eggs, because then I can eat eggs at around 10:00 in the morning. But sometimes it’s not eggs, it’s something like a pork chop—which is also fine—but sometimes it’s a cheese dip, or something that I don’t want first thing in the morning. So I’ll take a taste of it. But the most successful breakfast routine I ever had was buying a big thing of cottage cheese and eating cottage cheese with halved cherry tomatoes in it.\n\nFor breakfast?\n\nFor breakfast, yeah, because that takes me no time. Or I’ll just eat three tablespoons of cottage cheese out of the container while standing in front of the fridge in between articles.\n\nSo you eat breakfast just to get energy for the day?\n\nWell, that’s only during the week. On the weekend it’s different. On Friday, if you’re here, sometimes you’ll get me a bagel or I’ll go get us both bagels after publishing my first article, before I have a cocktail for 3-Ingredient Happy Hour; it is kind of important to actually get something in my stomach for that. But on the weekends, what do we usually eat? Eggs, I guess.\n\nWhat’s your favourite way to cook eggs?\n\nI really like that olive oil fried egg that I was doing.\n\nSteak and olive oil-fried eggs (made for work but eaten for pleasure). (Photo: Claire Lower)\n\nOh yeah, those are good.\n\nIt gets real crispy on the edges and the yolk is still super runny. There’s something about that cooking method. I think it’s because I put a lot of oil in the pan, and the oil comes up just enough to completely cover the white—like submerge the white. The white gets completely cooked through, but the yolk kind of pokes up out of the oil so it stays runny. Poaching is fine, but I really like a super slow scramble. So on Sundays sometimes, when you go to do chores or whatever at your place—It’ll take me 45 minutes to scramble these eggs. It’s such a low heat and they taste like they have cheese in them but there’s no cheese in them. But really I only make those once every two months because it takes so long and I’m not very patient. A quicker way to get that result is to add cornstarch to the eggs, and you get a similar creamy texture.\n\nSo you don’t drink coffee every day?\n\nNot every morning. Sometimes I have coffee, but recently I haven’t been drinking coffee because I don’t think I actually like coffee that much. I like a dark roast. I know this town is really big on the bright, citrusy, fruity roasts. And I know this makes me a heathen, but I don’t like those and I wish that we could go back to some darker roasts. .I guess I like espresso the most. I’ll get an iced Americano, or if I do make coffee at home, I put an espresso roast in my regular coffee pot.\n\nDo you usually eat lunch?\n\nNo. I eat two meals a day. I guess we could call the first one “brunch,” but it’s not brunch food. But if I have eaten something breakfasty I’ll usually skip eating lunch, or I’ll just eat a couple more spoonfuls of cottage cheese. Mosey on over to the fridge and shove those in my mouth and keep working. But if I haven’t eaten and I’m really hungry, and I happen to go the grocery store that day I will get grocery store sushi. That’s easy and it doesn’t create any dirty dishes for me to clean.\n\nIf you think about it, a corn dog is a breakfast food.\n\nIt’s too bad—I was on a real big cottage cheese kick for about two months, and then one day I just got tired of it. And that happens a lot. I just get tired of things. It’s really hard to establish any sort of routine because the idea of eating the same thing two days in a row depresses me, for some reason. And I don’t know if it’s because my mum was a big batch person and I got tired of big batches. She would just make a big batch of stew, or gumbo—and gumbo is actually the only thing that I was happy to eat multiple days in a row because I love it—I should make gumbo. But yeah, I wouldn’t call it “lunch.” I usually eat something between 11 a.m. and 2:00 p.m. so we could call that “lunch,” I guess. Oh, I was eating turkey corn dogs for breakfast this week. If you think about it, a corn dog is a breakfast food.\n\nCan you explain?\n\nYeah. You have a sausage and then you have kind of a pancake batter around it. It’s basically pancakes and sausage on a stick. I think it counts as breakfast, and the Trader Joe’s turkey corn dogs are actually pretty good, and not that bad for you. I mean, they’re corndogs. I actually don’t like to think of food as “good” or “bad” because then I’ll go crazy. But I think I might get more frozen corn dogs.\n\nA normal breakfast (Photo: Claire Lower)\n\nFor breakfast? With poached eggs?\n\nNo, no! The poached eggs are the weekend breakfast. Corn dogs are a weekday breakfast. How I prepare them is I put them in the microwave and par-cook them for about a minute. But if you just microwave them, they’re too soft, so I pop them in the toaster oven after that.\n\nI should get more corn dogs. I should probably get more cottage cheese too. It keeps me from getting hangry because I can shovel it in my mouth. But what I’m really excited about tomorrow—what I’m going to make I think, for my Sunday brunch—I got bologna and American cheese, so I can start making bologna bowls again. Do you remember the bologna bowls?\n\nOh yeah. I was going to ask you what your favourite cold cut is.\n\nI do love bologna a lot, and not ironically. I think it’s really good. I mean mortadella is basically bologna—it’s fancier bougie bologna, with more fat in it—sometimes pistachios—but bologna is good, and I get infuriated when I can’t buy it at New Seasons because they think they’re too good for bologna. I really miss Bryan bologna, which is the brand that I would eat in Mississippi. We had a family friend who drove a truck for the Bryan company. I like their bacon and I like their bologna a lot. I like the bologna that has the red wax around it that you have to peel off. What other cold cuts? I really like ham.\n\nThe last time I had a Costco membership was when I was married, and our first big fight was about me buying prosciutto, which he called “overpriced ham.”\n\nWhat kind?\n\nWell, I love prosciutto, if we want to get fancy about it. I’ll just eat slices of it with nothing. When I had a Costco membership I would get two giant things of it, and I would just eat eight or more slices in a row by themselves. The last time I had a Costco membership was when I was married, and my first big fight with my ex was about me buying prosciutto, which he called “overpriced ham.”\n\nIs prosciutto a cold cut?\n\nIt’s a fancy cold cut. But yeah, I don’t like turkey really, but I do really like a honey ham or a Virginia ham. But as you know, we like it thinly sliced, almost shaved. So you can pile it up high. I would say ham, prosciutto, and bologna are my favourites. If I could only pick one it would be prosciutto. But what do I eat most often? Bologna. I eat bologna the most out of all of them. I think it has the most applications too, because it’s a good lunch sandwich. If you fry it it’s a good breakfast, and you can also make the bologna bowls so then it’s a vehicle for eggs. It gives us so many gifts, bologna, and I think it’s really underappreciated.\n\nWhat do you put on your bologna sandwich?\n\nTake two slices of white bread, a thinnish layer of mayonnaise, but you want it to cover the bread edge to edge. Mayonnaise on both sides, mustard on one side. The baloney goes on the mustard side, then the American cheese. Then you sandwich it all together. My grandmother taught me that mayonnaise on both breads is important.\n\nWhat do you like to cook for yourself?\n\nA lot of days I won’t feel like cooking anymore by the end of the day, so I’ll cook popcorn, but that doesn’t really count. But if I really want to cook a meal for myself, I’ll do a ribeye and a baked potato and a wedge salad, and I’ll just make a little steakhouse dinner for myself. I’ll even do a gin martini with an olive. Sometimes I’ll actually cook the bacon myself because then I can use the bacon grease to coat the baked potato. But recently I’ve been buying prepared bacon bits because I really like adding bacon bits to everything.\n\nMy favourite pork loin (Photo: Claire Lower)\n\nWhat else do I cook? I like roasting chickens a lot, and doing the labneh chicken where I marinade the whole thing in labneh. Because then we can have that one night—with some duck fat roasted potatoes and maybe a vegetable—and then we can use the leftover chicken to make enchiladas. I’ve been enjoying making enchiladas a lot recently. What else? We did the Korean barbecue thing and got a lot of meat from H Mart. Ooh! If I have the forethought to buy the inoculated koji rice, I like making shio koji and using it as a marinade for pork. A shio koji-marinated pork chop or pork loin is one of my favourite things to make, but I don’t make it that often because I forget to buy the fuzzy rice.\n\nIt sounds like if it wasn’t for this job you would just eat meat and popcorn.\n\nAnd salad! And I try to keep a fruit around, usually clementines or grapes or cherries. But I’ve been eating more salads. Particularly if I make a salad dressing for work that I really like—I did that burnt onion ranch.\n\nWhat’s your favourite food to eat when you’re sad?\n\nPhoto: Claire Lower\n\nWhen I’m sad I love a cheese plate. I’ll go to New Seasons and they sell the little cheese scraps, and it’s still three dollars for a tiny wedge of cheese. It’s still pretty expensive, but you can get a lot of them. So I’ll get a blue, something like a Gruyere if I can find that, and then some other random cheddar or some shit, and I’ll have that with pickles, olives, some sort of jam. The other night I took the Gruyere that we had and I dipped it in strawberry Bonne Maman jam, and that was a taste sensation.\n\nI’ll also do popcorn if I’m feeling a little fatigued. I’ll do the method where you add a ton of oil to the pot, pop it in that, and then add Amish cheese powder and nutritional yeast, so you get two kinds of cheesy flavour, and then I add MSG on top of that, and it is fantastic.\n\nSo is that the kind of thing you usually eat for supper?\n\nIt’s not all sad meals. Usually it’s whatever I’m cooking for my next article. I’ve been eating beef stew because I’m trying to perfect a beef stew recipe. I also took some pictures of what I have been eating so let’s look at those. Can I do this without messing up the recording? I think I can. Yes I can. Let’s look at my photos. So the other night, I had a box macaroni and cheese from Trader Joe’s with bacon bits in it.\n\nChaotic! (Photo: Claire Lower)\n\nI’m changing my question. What are the last five meals you ate?\n\nPhoto: Claire Lower\n\nMonday I think I just had french fries and martinis at Double Dragon. Tuesday I had boxed macaroni and cheese from Trader Joe’s. We bought that when I was sick and I didn’t feel like cooking. Then I put bacon bits in it, but I also put toum. And then I had rocky road Haagen-Dazs with my snack salt on top for dessert. And that was also the night that I dipped the cheese in the jam. Wednesday! The only picture I have Wednesday is a cocktail. But Wednesday was our leftover Lebanese food, all mixed together and fried in butter. It was mostly rice, so it was like fried rice. Then I added a couple of fried eggs, and sour cream for some reason. Thursday I went to Beast. So I had one really nice meal and the rest of it was like what a raccoon eats. I should be ashamed of myself, but I never am. On Sunday, for supper—here’s a picture. It’s cubes of Gruyere with Trader Joe’s cornichons, and then a Ferrari cocktail. And there’s actually a Juul in the background because you left yours here, and I think I was hitting that between sips of Ferrari.\n\nHow do you cook your tomato sauce?\n\nI like adding butter to my sauce. And you think that’s obscene because your people are from southern Italy, but I have spent more time in Northern Italy. But I think the Marcella Hazan sauce is a better soup than sauce. But I do think it’s a good base. I’ll usually add garlic, and wine, and a little fish sauce to that sauce, but I really like butter in a sauce. I think it adds richness. I think it adds a little body to it. Plus I’m from the south and we just really like butter. But if I’m making it for you I will—because you actually can taste the butter. I thought maybe I could sneak it past you, but you’ve caught it every time. You have a good palate and it’s gotten better since you switched from smoking to Juuling. But anyway, if I’m making it for you, I’ll start with sausage. Onion, so much garlic, tomato paste, deglaze with wine, whole tomatoes and I almost always add fish sauce.\n\nI should be ashamed of myself, but I never am.\n\nWhat is “snack salt”?\n\nSnack salt is salt that is good enough to eat by itself, which is the Maldon flake salt—the little pyramid flakes. I will take an individual flake of salt and mash it crunch it down! It’s like a chip! It’s like a potato chip but there’s no potato. It’s a salt crisp.\n\nWhat do you like to eat at fairs and carnivals?\n\nI like an elephant ear or a funnel cake. I like a fried Oreo or Snickers bar. I also really like a corn dog, obviously. The ribbon cut fries I think are fun but only at a carnival. I think they’re garbage fries anywhere else, for some reason. Corn. I love corn on the cob or elote. And then just anything with a lot of cheese sauce. Even if they’re just shitty nachos or potato wedges with cheese sauce.\n\nDo you prefer caramel apples or candy apples?\n\nYou know damn well! You know damn well it’s a caramel apple. Candy apples are pointless!\n\nWhat’s your favourite style of pizza?\n\nSo, since I’m from Mississippi I don’t really have any regional pizza loyalty. My first pizza memory is the barbecue pizza from Pizza Hut when I was four.\n\nYou like barbecue pizza?\n\nIt was the first pizza I had. Don’t be a snob! But what “kind” of pizza do I like? I like a crust that’s foldable, with bubbles on the edge, and I like it to be properly cooked on the bottom. I like cornmeal on the bottom. A red sauce that isn’t super sweet; I don’t love a sweet red sauce. And then I love Hawaiian. I love pineapple on pizza.\n\nI don’t have these regional shackles holding me back from experiencing things that taste good.\n\nOK, next question.\n\nNo. Wait. I’m not done with my pizza answers! I love Hawaiian. As Natalie Wynn mentioned in her interview, it’s a perfect balance of flavours, especially if you have a cured pork product along with it. You’ve got the salty. You’ve got the acid. You’ve got the sweet. You’ve got the richness from the cheese. It all makes perfect sense. But I also like the square-cut, Detroit-style pie with the cheese in the crust. Rowdy at Ranch makes a really good one and his ranch dressing is also really good.\n\nYou dip the pizza in the ranch, don’t you?\n\nI do dip the pizza in the ranch, because you know what? I don’t have these regional shackles holding me back from experiencing things that taste good.\n\nWhat’s your favourite fast food place?\n\nOK, so it’s between McDonald’s and Taco Bell. I love Popeyes a lot too. But Popeyes can be a little expensive. I have to have the red beans and rice, you have to have the macaroni and cheese, and then we both want mashed potatoes. And then why get fried chicken if you can’t have leftover fried chicken? Cold fried chicken is really good. So it’s about forty dollars but it is good. Also, here’s a tip! Mix the mashed potatoes into the red beans and rice. But my favourite is probably McDonald’s. An Egg McMuffin, hash browns, and Diet Coke is my favourite airport breakfast, and it’s my favourite hungover breakfast. Though now I’ve developed the Bologna McMuffin. I also love a Double Cheeseburger and some McNuggets, and I’m obsessed with the sweet and sour sauce, which is the best fry dipping sauce.\n\nDo you eat ever at the airport?\n\nVERY pleased with myself (Photo: Claire Lower)\n\nThe only time I do is if I have an early morning flight because I’m a really anxious traveller, so I’m one of those people who gets to the airport an hour and a half to two hours early no matter what. But yeah, I’ll get an Egg McMuffin, hash browns, and a Diet Coke. Other thank that eating in the airport depresses me. Though I have been tempted by a Panda Express. If I have a long layover I will usually get cheap airport wine—the cheapest one they have—or a kalimotxo, which is half red wine and half Coke.\n\nWhat’s one of the most memorable things you’ve eaten while travelling?\n\nI mean, everything in Copenhagen was quite good. And I didn’t get to have a full meal at Relae, but that celery root dish really surprised me. Chef Jonathan Tam was like “This is going to taste like lasagna,” and I—a person who does not care for celery or its root—was like “Uh huh, sure,” and then it did. The combination of the savoury oil and all that butter somehow tasted like lasagna—I still think about it.\n\nOther than that, two years ago I went to France—not for work—and some friends and I stayed at La Peetch—Julia Child’s freaking house—which you can rent. And we took cooking classes in her kitchen, and made and ate all sorts of amazing things. I learned how to make a proper soufflé and choux pastry, but more importantly I got to cook and then eat duck and potatoes au gratin.\n\nPhoto: Claire Lower\n\nBut—and this is kind of a dirtbag hack—one of my favourite things to do when I travel is buy a whole bunch of regional potato chips. That, and go to a McDonald’s. British McNuggets are very bland, but they had a Cadbury egg McFlurry, which ruled. The British are also very good with crisp flavours. Roasted ham crisps? Yes, please.\n\nPhoto: Claire Lower\n\nHow much Diet Coke do you drink?\n\nI just drank two litres in 24 hours.\n\nThat’s insane. How often do you do that?\n\nI purposely don’t keep it in the house because I will drink three to four cans a day if I have Diet Coke in the house. I’m trying to drink more water. I think it tastes really good with food. It cuts through a lot of rich and salty flavours but it’s not sweet like a sugary soda. I mean it’s sweet, but not in the way that sugar is. It doesn’t coat your mouth like sugar does. But, weirdly, Diet Coke is the only configuration of aspartame that I enjoy.\n\nCan we see the inside of your fridge?\n\nWouldn’t it be funny if I said “no”?\n\nPhoto: Claire Lower\n\nWhat condiments do you have in your fridge?\n\nAt any given time, I must have sour cream, soy sauce, fish sauce, mayonnaise—I have to have mayonnaise. I currently have three types of mayonnaise in my kitchen. I have Duke’s, which is a Southern brand that doesn’t contain any sugar, and I have a Korean mayonnaise which is super sweet. I have to keep ketchup around for you. And now we’re both really into the strawberry Bonne Maman jam and we went through a jar in two or three days.\n\nAre you a big dessert person?\n\nYes. I’m one of those people who likes both the savoury and the sweet. My favourite baked good is a brownie from a boxed mix. I love those because they cost three fucking dollars, and they come together real quick. I’ll use pistachio oil instead of vegetable oil, and that will make it a little nuttier. And sometimes I’ll use coffee instead of water too. And a box mix always has—the Ghirardelli one—it always has a perfect shiny crust. It’s chewy on the edges. It’s fudgy in the centre. They’re perfect. I don’t see a reason to spend any time measuring anything. I hate baking. I used to be a baker but it reminds me too much of my time in chemistry, with all the weighing and precision, and I just refuse to be part of that anymore. I opted out of that.\n\nWith snack salt, natch. (Photo: Claire Lower)\n\nBut one of my favourite desserts, which I’ve been very into recently, is a banana split. I like the one at Pied Cow the best, it’s just a classic. I fucking love ice cream. But the best ice cream place if I’m not getting a banana split? Pinolo Gelato. The pistachio gelato at Pinolo is so perfect, and their fior di latte! If you can just make something that’s essentially sweetened dairy—with no other flavours—and freeze, that and have it be transcendent, you know that your method of making ice cream—or gelato in this case—is good, and you’re not hiding anything behind crazy flavours.\n\nBanana splits I have known and loved (Photo: Claire Lower)\n\nDo you prefer cocktails, beer, or wine?\n\nWell I used to be heavily into craft beer and I was actually brewing my own beer for a while but now it makes me feel bloated and it makes me sneeze. Right before I turned 30 it started making me sneeze, which is apparently common for people with mould allergies, which I have. And since then I’ve kind of lost the taste for beer, though I will occasionally drink a cheap shitty beer, and that doesn’t make me sneeze. The fancier the beer, the more likely I am to sneeze. I like wine a lot and I do think I enjoy good wine, but I’ve avoided really understanding wine because I’m afraid once I develop that palate it’ll be another expensive thing that I’ll want to spend money on, and I don’t need that. Because, as you know, I am a cocktail drinker, and it helps that I’m friends with bartenders who, uh, help me out sometimes. But yeah, to answer your question: I’m a cocktail person.\n\nSometimes An elaborate grasshopper from Double Dragon. (Photo: Claire Lower)\n\nWhat kind of cocktails?\n\nI am a big gin drinker. I’m sure anyone who reads 3-Ingredient Happy Hour already knows all of this, but I like a martini, and I like tiki drinks but they’re like a fun, occasional party drink. I’ll drink a martini any fucking day of the week. I also am really into Hanky-Pankies. For some reason when I’m DJing I like Paper Planes, but that’s the only time I order them. And I also like super bitter amaro like Campari and Fernet. I like combining the two for a Ferrari, and then sprinkling a little salt in that. I put salt in everything.", "description": "Hello. It’s me, Claire. I’m the food editor here at Lifehacker, and as we’re taking a look at how the Lifehacker staff works, I thought I’d show you how I eat. In order to maintain the conversational flow of How I Eat, I had my boyfriend conduct the interview. Below you will find answers to all sorts of...", "authors": ["Lisa Rowan", "Emily Price"], "top_image": "https://edge.alluremedia.com.au/m/l/2019/09/Lowler.jpg", "published_at": "2019-09-24"}