{"pub": "bbc", "url": "https://bbc.com/news/business-50006720", "downloaded_at": "2019-10-10 18:34:15.480045+00:00", "title": "US sanctions Guptas for South African 'corruption'", "language": "en", "text": "Image copyright Gallo Images Image caption Ajay and Atul Gupta, and Sahara director, Duduzane Zuma\n\nThe US has placed economic sanctions on members of Gupta family and a business associate for their alleged roles in a \"significant corruption network\" in South Africa.\n\nThe three Gupta brothers, friends of former South African president Jacob Zuma, are accused of bribing politicians to advance their business.\n\nThe Guptas have denied wrongdoing.\n\nThe order forbids US entities from doing business with the men or handling their assets.\n\nThe US said the Guptas engaged in \"pay-to-play political patronage, which was orchestrated at the expense of the South African people\".\n\n\"The Guptas and [Salim] Essa have used their influence with prominent politicians and parties to line their pockets with ill-gotten gains,\" US Treasury official Sigal Mandelker said. \"We will continue to exclude from the U.S. financial system those who profit from corruption.\"\n\nThe order applies to Ajay, Atul, and Rajesh Gupta as well as Salim Essa.\n\nUS officials said it is intended to support South Africa's ongoing inquiry into the alleged corruption. It further isolates the Guptas, who had already been blacklisted at several South African banks.\n\nHow did this start?\n\nThe Gupta brothers arrived in South Africa from India in the 1990s and established computer business Sahara, later buying up stakes in mining and engineering companies, a luxury game lodge, a newspaper and a 24-hour news TV station.\n\nThey are accused of bribing officials to advance their business interests and win government contracts. They also employed members of Mr Zuma's family.\n\nThose ties had long shielded the family, but in 2018, with Mr Zuma's grip on power slipping, South African police raided the family's Johannesburg compound. Mr Zuma resigned shortly after.\n\nThe Guptas had already left the country, reportedly for the United Arab Emirates. At the time, many of their businesses were also in the process of closing down, changing hands or being targeted for seizure by authorities.\n\nThe scandal tarnished several global companies that had worked in the country, including financial consultants McKinsey, accounting giant KPMG and software firm SAP.\n\nBritish public relations giant Bell Pottinger was driven into administration.", "description": "The US Treasury Department said the Gupta family participated in a \"significant corruption network\" in South Africa.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/ED60/production/_109186706_2b17f812-8573-4b05-adb2-047c57bed827.jpg", "published_at": "2019-10-10"}