{"pub": "axios", "url": "https://axios.com/back-on-the-rise-malaria-rates-call-for-global-spending-surge-73fc1577-19ba-4630-9ca0-8ba5dea96002.html", "downloaded_at": "2019-10-10 15:09:33.071305+00:00", "title": "Back on the rise, malaria rates call for global spending surge", "language": "en", "text": "The background: In the last decade, philanthropic and government spending on malaria control increased 15-fold, hitting an estimated $2.7 billion per year since 2010. (The U.S. is the largest donor, contributing a little over 30% of the 2016 total.)\n\nThe impact, per the WHO:\n\nBetween 2000 and 2015, malaria incidence fell by 37% and mortality by 50%, averting 6.8 million deaths.\n\nIn that time, 17 countries — including China, Senegal and Bolivia — eliminated malaria and 21 came close.\n\nBetween 2010 and 2016, malaria deaths for children under five declined from 440,000 to 285,000.\n\nBut funding and treatment breakthroughs have recently plateaued: 2016 saw 5 million more cases than 2015. While a rise in resistance to antimalarial medication and sprays is partly to blame, conflict and economic shocks in countries like Nigeria, South Sudan, Yemen and Venezuela have also contributed.\n\nPoor, rural and indigenous populations — especially in conflict and post-conflict settings — remain the hardest hit. As of 2016, 15 countries in sub-Saharan Africa carried 80% of the global malaria burden. Their high infection rates are compounded by insufficient domestic budgets and struggling health systems.\n\nWhat to watch: The WHO rolled out a new child vaccine in three African countries earlier this year. But for a sustainable solution, afflicted countries need enough money to fortify their local health systems.\n\nTanvi Nagpal is acting director of the International Development Program and Practitioner in Residence at Johns Hopkins SAIS.", "description": "Despite progress, malaria still kills one child every two minutes.", "authors": [], "top_image": "https://images.axios.com/8OSgL5WjNfewD9XZ0539EQUY54g=/0x0:6000x3375/1920x1080/2018/04/06/1523039895191.jpg", "published_at": "2018-04-06"}