{"pub": "morningstar", "title": "Rupal Bhansali: The Long View Podcast", "url": "https://community.morningstar.com/t5/Market-Insights/Rupal-Bhansali-The-Long-View-Podcast/td-p/19992/jump-to/first-unread-message", "language": "en", "published_at": "2019-08-28", "downloaded_at": "2019-09-02 07:16:05.066221+00:00", "text": "I'm extremely impressed by Rupal Bhansali and really enjoyed this episode of the Long View Podcast.\n\nGreat insights from her on the need for second level qualitative thinking to be performed on top of the quantitative work that she sees as simply \"table stakes\" and not a source of alpha.\n\nI nodded my head vigorously to her point about doing the quantitative analysis to figure out the expectations implied by the stock price while recognizing that quantitative measures are largely extrapolative of the past. The key to her is to perform the deep qualitative business analysis on top of the quantitative work that may tell you whether the future is likely to be different than the past, and that that is how you find mispricings and create alpha.\n\nThis reminds me of the debate over MSFT over the last couple of years. Valuation aficionados like Chuck Carnevale have warned that it is dangerously overvalued, but that is if you assume the business will perform in the future like it did 8-10 years ago and should be valued similarly. I notice that MSFT is her largest holding by far in her global fund AGLOX (Ariel Global Investor), which gets my confirmation bias going as it is also my largest holding.\n\nMany brilliant points. She has a great, supple mind and has obviously thought very deeply about all topics investing related. Other than UL, I don't currently have any purely international exposure. I intend to follow and seriously consider AGLOX and AINTX (Ariel International). At the very least, I will look at the holdings of her funds for ideas.\n\nhttps://the-long-view.simplecast.com/episodes/rupal-bhansali", "description": "I'm extremely impressed by Rupal Bhansali and really enjoyed this episode of the Long View Podcast. Great insights from her on the need for second - 19992", "authors": ["Explorer"], "top_image": "https://zwcdr85544.i.lithium.com/html/assets/favicon.ico?15D4DC4041FDD3CD56F6121736C9C68D"}