{"pub": "thehill", "url": "https://thehill.com/policy/finance/467181-house-committee-approves-measure-taxing-nicotine-in-vaping-products", "downloaded_at": "2019-10-24 00:36:42.000982+00:00", "title": "House committee advances measure taxing nicotine in vaping products", "language": "en", "text": "The House Ways and Means Committee approved legislation Wednesday that would impose a federal tax on the nicotine used in liquid vaping products.\n\nThe move comes amid growing concerns over the health effects of vaping, as a respiratory illness linked to vaping products spreads across the country.\n\nADVERTISEMENT\n\nThe panel approved the measure in a mostly party-line vote of 24 to 15, with Rep. Lloyd Doggett Lloyd Alton DoggettHouse progressives to push for floor amendments on Pelosi drug price bill Overnight Health Care — Presented by Partnership for America's Health Care Future — Four companies reach 0M settlement in opioid lawsuit | Deal opens door to larger settlements | House panel to consider vaping tax | Drug pricing markup tomorrow Overnight Health Care — Presented by National Taxpayers Union —Dem wants more changes to Pelosi drug pricing bill | Ebola outbreak wanes, but funding lags | Johnson & Johnson recalls batch of baby powder after asbestos traces found MORE (D-Texas) voting present. Two Republicans, Reps. Tom Rice Hugh (Tom) Thompson RiceHouse committee advances measure taxing nicotine in vaping products Democrats struggle with repeal of key Trump tax provision The Hill's Morning Report - Trump struggles to replicate 2016 coalition MORE (S.C.) and Vern Buchanan Vernon Gale BuchananMORE (Fla.), voted with Democrats, while Rep. Stephanie Murphy Stephanie MurphyLawmakers set to host fundraisers focused on Nats' World Series trip House Democrats change drug pricing bill in bid to address progressive concerns Hillicon Valley: Zuckerberg to testify on Libra | Extremists find home on Telegram app | Warren blasts Facebook for not removing anti-Biden ad | California outlaws facial recognition in police body cameras | China rips US tech sanctions MORE (D-Fla.) joined Republicans in opposing the measure.\n\nRep. Tom Suozzi (D-N.Y.), the bill's sponsor, said the new tax would help decrease use of vaping products, particularly among teens and young adults.\n\n“A whole generation of our children are getting addicted to nicotine” through the use of vaping products, Suozzi said at Wednesday's markup. “For young people especially, who have less money and therefore higher price elasticity, taxes on vaping products are an effective way to decrease usage.\"\n\nThe Centers for Disease Control and Prevention this month said the median age of patients affected by the vaping illness is 23, and 79 percent of the patients are under the age of 35.\n\nTom Barthold, chief of staff for the Joint Committee on Taxation (JCT), told lawmakers that the proposed tax would lead to a projected 22 percent annual reduction in use of the affected vaping products.\n\nThe bill would extend the federal tax on nicotine in cigarettes to nicotine in vaping products, raising about $10 billion over a decade, according to the JCT.\n\nSeveral GOP members voiced concerns that the bill would not impose a tax on vaping products with THC, the main psychoactive compound in marijuana, despite the CDC’s findings of a greater correlation between THC vaping products and the illnesses than with nicotine vaping products.\n\nRep. George Holding George Edward Bell HoldingBetsy DeVos's playbook of political correctness Education Dept. cites disproportionate focus on 'positive aspects of Islam' in reviewing UNC-Duke grant funding Delay of new trade deal harms America's digital advantage MORE (R), whose North Carolina district includes tobacco businesses, argued that a tax on nicotine products alone would be ineffective.\n\nHe said the bill would make CBD and THC products relatively more affordable compared to nicotine vapor products subject to the proposed tax.\n\n“If we actually want to address the recent rise in vaping-related lung illnesses, it's intuitively obvious that these THC products are actually what we should be looking at,” Holding added.\n\nThe committee also approved by voice vote three bipartisan bills that would require certain high-deductible health plans to cover the cost of inhalers, allow the use of tax-advantaged accounts to purchase over-the-counter medications and menstrual-care products and expand accessibility to health savings accounts.\n\n\"This is a good package of bills, and I support each one individually,\" Murphy said at the markup. \"But the revenue generated from the vaping bill is not enough to pay for the new spending in the three other measures.\"\n\nSuozzi's office has argued that the revenue from the vaping bill would cover the costs of the other three measures.\n\nUpdated at 7:13 p.m.", "description": "The House Ways and Means Committee approved legislation Wednesday that would impose a federal tax on the nicotine used in liquid vaping products.", "authors": [], "top_image": "https://thehill.com/sites/default/files/vaping_092118getty.jpg", "published_at": "2019-10-23"}