{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7544117/Spurs-news-Levy-lucky-boss-realise-Pochettino-gone.html", "downloaded_at": "2019-10-07 00:10:32.697496+00:00", "title": "Spurs news: Levy is lucky to have this boss... he will realise that once Pochettino has gone", "language": "en", "text": "The moment I knew there was trouble on the horizon at Tottenham Hotspur was at the start of the season, when Mauricio Pochettino told us to refer to him as the 'coach' rather than the 'manager'.\n\n'I am not in charge and I know nothing about the situation of my players,' he said during their pre-season tour in July. 'The club needs to change my title and description. I am the boss deciding the strategic play, but in another area, I don't know. I feel like I am the coach.'\n\nThis was Pochettino letting us all know that he was in the dark about transfers and contract talks — and that is wrong. Spurs chairman Daniel Levy is so lucky to have this man working for him. This is one of the best bosses in world football, and he should be backed like it, too.\n\nMauricio Pochettino has had a tough week as Spurs manager after their loss to Brighton\n\nYou could tell there was an issue when he said he should be called the 'coach' in the summer\n\nLevy is a brilliant businessman, but I can't help feeling Tottenham missed the opportunity of a lifetime two years ago. They were in a superb position, one from which they could have properly kicked on.\n\nYet their strict salary cap and lack of spending has held them back. They have stood still while others have caught up. Arsenal used to look way behind their north London rivals but not anymore. The same goes for Chelsea and Leicester City, both of whom are now fighting with Spurs for a top-four finish.\n\nTreating Tottenham like a business rather than a football club is not right. That is not what it is about. Supporters don't buy tickets to go to that beautiful stadium because the numbers on the spreadsheets add up. Or because they know their wage bill is less than that of their rivals.\n\nPochettino has been hindered by the strict salary cap and lack of spending at Spurs\n\nThey turn up to watch their team play together and win together. They want to see a side being competitive, fighting for the biggest trophies. Yes, you can be applauded for bringing in players on the cheap, but you also need to buy the big names.\n\nYou need those ready made stars in your squad if you are to compete with the likes of Manchester City and Liverpool. Not only that, you need to pay them properly, too. Otherwise, players will refuse to sign contracts – as we have seen with Christian Eriksen and Co – and the squad will grow unsettled. All this has left Pochettino looking like a defeated man on that touchline.\n\nLevy has to take his share of the blame for the sorry situation they are in. A lot of fingers have been pointed at Poch but that's not right. Sacking the Argentine is not the answer. Spurs would only miss him when he's gone. It would be better to start backing him.\n\nDaniel Levy needs to start backing Mauricio Pochettino - sacking him is not the answer\n\nAfter Aston Villa’s 5-1 win at Norwich, John Terry wrote on Instagram: ‘That result has been coming.’ It really had.\n\nVilla twice let leads slip against Burnley the week before. They led 1-0 at Arsenal in September but went on to lose. The same happened at Tottenham in August.\n\nBut those Villa players persevered and got their reward at Carrow Road. They have good players – Wesley got two goals on Saturday, John McGinn showed why he will have no problem playing at this level, and Jack Grealish gave us further glimpses of his talents.\n\nThis result will give Villa so much belief. For injury-hit Norwich, this will have been tough to take, but I can still see all three promoted clubs staying up. They all look competitive, and I bet other teams are worried.\n\nAston Villa's 5-1 win against Norwich on Saturday afternoon had been coming\n\nWarning to Man Utd: There is no quick fix\n\nI joined Liverpool the year after they won the title in 1990. Back then, no one would believe you if you said they’d go 30 years without being crowned champions of England.\n\nYet here they are, three decades down the line, still fighting to end that drought.\n\nThat should come as a warning for Manchester United. There is no easy way back to being an elite club, no quick fix. United have tried throwing money at their problems – and failed spectacularly with some questionable signings made since Sir Alex Ferguson left in 2013.\n\nThey’ve tried changing managers, too. I don’t think Ole Gunnar Solskjaer is the right man for the job, but I don’t know who they could get in. You’d say Jose Mourinho if they hadn’t already sacked him!\n\nLike Liverpool, I suspect United are going to have to suffer before they return to former glories.\n\nThere's a warning for Manchester United — there will be no quick fix to their current problems\n\nLeicester have every right to feel aggrieved after the way they lost at Anfield. Brendan Rodgers said Sadio Mane ‘made the most of the contact’ from Marc Albrighton for the stoppage-time penalty, and he was right.\n\nYou knew when it went to VAR that they would not overturn it or tell referee Chris Kavanagh to check his pitch-side monitor.\n\nAt least goal-line technology is doing its job – awarding Tammy Abraham his brilliantly-lobbed goal against Southampton on Sunday.\n\nThe interview with Newcastle’s 19-year-old match-winner Matty Longstaff and his big brother Sean on Sky Sports was brilliant. These are two talented footballers but both are so modest.\n\nMatty insisted his strike was a ‘hit and hope’ but I’m not buying that. He knew what he was doing.\n\nHe let the ball go across his body, waited for the right moment, hit his shot pure and it sealed a super win over Manchester United. It repaid Steve Bruce’s faith in him.\n\nMatty Longstaff claimed his strike was 'hit and hope' but he clearly knew what he was doing", "description": "JAMIE REDKNAPP: The moment I knew there was trouble on the horizon at Tottenham was at the start of the season, when Mauricio Pochettino told us to refer to him as the 'coach'.", "authors": ["Jamie Redknapp For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/22/19371250-0-image-a-50_1570395607809.jpg", "published_at": "2019-10-06"}