{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/29/with-sean-rad-signed-on-as-co-founder-good-today-launches-new-tool-for-company-wide-donations", "downloaded_at": "2019-10-29 23:56:02.645059+00:00", "title": "With Sean Rad signed on as board member, Good Today launches new tool for company-wide donations – TechCrunch", "language": "en", "text": "Good Today offers a simple way for people to support a variety of charity organizations: By donating as little as 25 cents a day, supporters get a daily email allowing them to vote for one of two charity organizations, with the day’s donations split based on the votes.\n\nThe nonprofit, previously known as Good St., has been around for years — I wrote about it back in 2015 — but co-founder Joe Teplow said he’s refocused on it since selling his startup Rebel to Salesforce last year.\n\nThis week, Good Today is announcing its new branding, a new product designed specifically for companies and a number of notable figures who have signed up as founding board members: Joe Benun, Jeff Dobrinsky, Sean Rad (co-founder and former CEO at Tinder), Guy Oseary (the talent manager who co-founded Sound Ventures with Ashton Kutcher) and Molly Swenson (the RYOT co-founder who’s now chief impact officer at Live Nation’s Maverick).\n\n“Generosity is a learned behavior,” Rad told me. “If you think about the importance of waking up every single day, opening that email and learning about another cause, getting out of your own little bubble … very quickly it becomes an addictive habit.”\n\nRad also noted that these small donations can lead to a deeper engagement over time, as people discover organizations that they might want to support with larger donations or in other ways.\n\n“Over time, we’re going to be more than giving 25 cents a day,” he added. “The idea here is that if we could build a way to donate every single day, you sort of solve the biggest problem in charity as a whole, which is engagement. Once you get the engagement loop going, we’re going to be introducing other experiences.”\n\nGood Today has experimented with company-wide giving before, but Teplow said the product has been designed largely for individuals, and that until now, “If you wanted to bring your company onto the platform, it was a little bit hack-y.”\n\nGood Today for Teams is supposed to change that, allowing companies to sponsor their employees’ donations, along with integrating into Slack (where employees can vote for their preferred charity) and providing a dashboard where administrators can track their team’s votes and giving. It’s already being used by more than 20 companies, including Shutterstock, Jeffries, Splash and Maverick.", "description": "Good Today offers a simple way for people to support a variety of charity organizations: By donating as little as 25 cents a day, supporters get a daily email allowing them to vote for one of two charity organizations, with the day’s donations split based on the votes. The nonprofit, previously known as Good St., […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2014/12/549277847_8b294e9db9_o.png?w=533", "published_at": "2019-10-29"}