{"pub": "townhall", "url": "https://townhall.com/columnists/chrisstigall/2019/09/18/you-want-the-truth--some-still-cant-handle-the-truth-n2553326", "downloaded_at": "2019-09-18 23:22:12.554635+00:00", "title": "You Want The Truth? Some Still Can’t Handle The Truth.", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nOh, to live in a time when our politics weren’t a dumpster fire. Where polite discourse ended with all sides finding common ground. Chin-stroking academics could ponder the implications of this political theory or that piece of legislation and mild harrumphing would be the only sign of discord.\n\nI’m not sure when that was ever the reality of politics in the United States, but there are a great many who seem to long for such a historical fiction. Of course we know we’re not living in normal times as Victor Davis Hanson beautifully wrote this week.\n\nStill, some media friends and soft allies of Republicans continue to openly and exclusively chastise the abnormality of President Trump. Peggy Noonan referred to him as “a mental case and screwball” suggesting he’s “wearing thin” to his own supporters.\n\nConrad Black, an ex-media mogul President Trump just pardoned last year had the temerity to scold his rescuer’s “style.” If only he were more “presidential,” Black lamented.\n\nOh, to live in normal times where we had the luxury of these issues as our biggest national concerns. But these aren’t normal times and President Trump isn’t a normal leader. But maybe - just once - his critics could ask themselves what’s normal about his opposition while they’re at it.\n\nIs it normal for a major news organization like The New York Times to knowingly publish unsubstantiated smears about a Supreme Court Justice, only to return to try it again months after the confirmation battle ended?\n\nIs it normal for prominent American personalities to cheer for a recession that would hurt the personal finances of millions of fellow Americans just because they want the bad news for a president?\n\nIs it normal for United States Senators like Kamala Harris and Cory Booker to call Supreme Court justices liars or demand their impeachment even after a phony story about an alleged crime is discredited fully?\n\nIs it normal to hear candidates for president like Pete Buttigieg and governors of states like Ralph Northam state life doesn’t begin until “first breath” or that it should be legal to kill a baby after it’s born as long as you make it comfortable first.\n\nIs it normal for Islamist members of Congress to openly agitate against Jews and call for boycotting our strongest Middle Eastern ally Israel?\n\nIs it normal to hear candidates for president of the United States like Beto O’Rourke make statements like “we won’t allow” Americans to own perfectly legal, constitutionally-protected firearms any longer?\n\nIs it normal to hear multiple candidates for president and current United States senators like Elizabeth Warren and Bernie Sanders proudly tell Americans they won’t be allowed to keep their health insurance because their government-run scheme will be the only option going forward?\n\nIs it normal to hear a major political party attack law enforcement at our border, likening them to Nazi Germany and suggesting they be dissolved as a function of government?\n\nIs it normal to hear candidates for president suggest we American taxpayers are obligated to pay for illegal aliens’ health insurance?\n\nIs it normal for politicians to suggest all college debt should be forgiven or college should be paid for in full by taxpayers? What if you’re someone who’s already paid for your own college or paid off your loans?\n\nIs it normal when we learn the most powerful law enforcement agency in the world – the FBI – engaged in unprecedented, openly partisan dialogue amongst one another while abusing their domestic surveillance powers over fellow American citizens simply because they didn’t like their politics?\n\nIs it normal to hear members of Congress openly encourage harassment of their political opponents in restaurants, gas stations, and shopping malls?\n\nIs it normal to hear a candidate for president like Bernie Sanders boast he will raise your taxes and you’ll like it?\n\nIs it normal to hear a candidate for president like Elizabeth Warren go full Robin Hood and suggest confiscation of a percentage of valuables and assets just because you’re “rich?”\n\nIs it normal to call for the elimination of plentiful, powerful fossil fuel use that sustains our lives and livelihoods because of climate alarmist propaganda?\n\nIs it normal to hear prominent members of a major political party tell us what temperature we should keep our homes, or whether we should use indoor climate controls at all, or whether we should eat meat, or even raise livestock, or till ground for planting and harvesting crops, or whether we should have children and drive cars?\n\nNo, these are not normal times. We are not dealing with normal human behavior or rational, careful political debate. We’re at a frighteningly dangerous, totalitarian fork in the road as Americans. Veer left, all of the above and more await our future as a nation.\n\nOr we can choose to stand with the “wearisome screwball with a troublesome personality.”\n\nNo, these aren’t normal times. The country won’t be saved by “normal.” It’s time for Colonel Nathan Jessup from “A Few Good Men.”\n\nIt’s not a perfect analogy as the Colonel was the bad guy in the film. The point is he was willing to do the dirty work. So, no, we don’t want a “Code Red,” but that attitude is imperative. We want President Trump on that wall. We need him on that wall.\n\nYou good columnists and pundits who don’t think him palatable at cocktail parties might be wise to understand the protections he provides rather than continue to criticize the manner in which he provides them.\n\nHis existence still may be grotesque and incomprehensible to many in the halls of metropolitan, conservative salons. But unless they’re willing to stand the post with President Trump, I’d suggest they simply say “thank you” and be on their way.\n\nEditor's note: This post was updated to better explain the movie reference to \"A Few Good Men.\"", "description": "Oh, to live in a time when our politics weren’t .09/18/2019 19:22:13PM EST.", "authors": ["Chris Stigall", "Matt Vespa", "Guy Benson", "Cortney O'Brien"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/255/38dd4553-0fd5-4674-8a16-b130c150f7fa.png", "published_at": "2019-09-18"}