{"pub": "metro", "url": "https://metro.co.uk/2019/10/21/time-watch-orionids-meteor-shower-uk-tonight-2-10955036", "downloaded_at": "2019-10-21 11:30:16.664860+00:00", "title": "What time and where to watch the Orionids meteor shower in the UK tonight", "language": "en", "text": "It will be a late night for meteor fans this evening (Picture: Getty Images)\n\nThe skies above the UK will be filled with shooting stars tonight as the Orionid meteor shower hits its peak.\n\nThis is the second meteor shower in October after the Draconids lit up the sky at the start of the month.\n\nThe Orionids, which occur as the UK passes through the debris left by Halley’s comet, are a more active meteor shower and you may see as many as 25 streak overhead this evening..\n\nHalley takes around 76 years to make a complete revolution around the Sun. It will next be visible from Earth in 2061.\n\nOrionids are named after Orion, because the meteors seem to emerge or radiate from the same area in the sky as the constellation.\n\nAs ever, the best way to see them is to get as far away from light pollution as possible and just look upwards.\n\nAdvertisement\n\nAdvertisement\n\nWhat time is the Orionid meteor shower tonight?\n\nComposite image of the Orionids Meteor shower taken over the McCloud Falls in Northern California. (Goldpaint Photography)\n\nMORE: Orionids meteor shower set to light the night sky tonight in dazzling galactic spectacle\n\nAfter sunset this evening (which is at 5.55pm) the meteors could start to become visible, but your best chance to see them will be after 10pm.\n\nThe official ‘peak time’ for spotting meteors is about 11.30pm tonight.\n\nThey will be visible at different points in the sky from then until about 6am. When the sun begins to rise they will be much harder to see.\n\nThey will still be visible until around November 7, but tonight and tomorrow night are your best chance to see them.\n\nHow best to see the Orionid Meteor Shower\n\nThe Orionids meteor shower in full flow (Shutterstock / Brian Spencer)\n\nThere really is nothing special you have to do, simply get outside and look up, although you may have to be prepared to wait for a while.\n\nThe less light that is shining in surrounding areas the better, and your eyes will have to get used to the dark.\n\nHere’s a few top tips for getting into the meteor-spotting mindset:\n\nFind a secluded viewing spot, away from the city lights. Once at the venue, your eyes may take 15 to 20 minutes to get used to the dark.\n\nDress for the weather, and make sure you are comfortable, especially if you plan to stay out long. Bring a blanket or a comfortable chair with you—meteor watching can be a waiting game.\n\nOnce you have found your viewing spot, lie down on the ground and look up in the direction of the radiant. Use our Interactive Meteor Shower Sky Map or the table above to find the current direction of the radiant in the sky.\n\nAdvertisement\n\nAdvertisement\n\nWhat will the weather be like?\n\nPASS IT ON: The Orionid meteor shower peaks Monday night through the predawn hours of Tuesday morning. Up to 20 meteors will be possible per hour! #MeteorShower #Space pic.twitter.com/AtRwyPkntA — Mark Tarello (@mark_tarello) October 19, 2019\n\nMost people across the UK will get the chance to view the phenomenon, the weather forecasters have predicted.\n\nAccording to the Met Office, there will be a ridge of high pressure across the UK on Monday evening, producing dry weather and clear skies for most.\n\nWhile some in the far north west and far south east of the country may have some clouds to contend with, most will get a good view.", "description": "Don't miss the meteors!", "authors": ["Jeff Parsons"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_90979274_1571654190.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-21"}