{"pub": "independent", "title": "How Trump fell out of favour with Fox News", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-tweets-fox-news-attack-president-white-house-a9086676.html", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:38:35.785216+00:00", "text": "Tensions between the White House and Fox News ratcheted up this week after President Donald Trump declared the network was letting his supporters down and two on-air personalities said they “don’t work” for him.\n\nThe back-and-forth began on Wednesday when Trump took to Twitter to rebuke the network for airing an interview with Xochitl Hinojosa, a spokeswoman for the Democratic National Committee.\n\nMr Trump said Hinojosa was “heavily promoting” Democratic candidates with “zero pushback” from the anchor, Sandra Smith.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n“They should go all the way LEFT and I will still find a way to Win - That’s what I do, Win,” he wrote.\n\nReferring to the network as “the new Fox News,” he continued by saying the network “is letting millions of GREAT people down!”\n\n“We have to start looking for a new News Outlet,” he added. “Fox isn’t working for us anymore!”\n\nShape Created with Sketch. President Trump's most shocking attacks on the media Show all 16 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. President Trump's most shocking attacks on the media 1/16 \"You are fake news!\" Then President-elect Trump directed this insult to CNN's Jim Acosta while refusing him a question at a press conference on January 11 2017. The President-elect's anger was due to the publishing by Buzzfeed of unverified memos that implicated Michael Cohen in Russian collusion. CNN had reported on a briefing of Obama and Trump on the memos by US intelligence chiefs, but knowing the content to be unverified had not revealed it AFP/Getty 2/16 \"They are among the most dishonest human beings on earth\" President Trump said this of journalists during a visit to the CIA on the the day following his inauguration. His claim of having the largest crowd of any inauguration ceremony in history had been debunked and he clearly wasn't happy Reuters 3/16 \"Failing New York Times\" President Trump commonly addresses the New York Times in this way, contrary to its increasing profit margins and expanding global readership. He is pictured here in the midtown Manhattan office of the paper Getty 4/16 \"Enemy of the American People\" President Trump has since repeated the claim that such news outlets are the enemy of the people, often after they break negative stories about him 5/16 \"They have no sources\" Speaking at the Conservative Political Action Conference on February 24 2017, President Trump suggested that a Washington Post article with 9 sources was \"made up\". The article in question exposed how then National Security Advisor Michael Flynn had misled Vice President Mike Pence over a phone call to a Russian ambassador. That the article was \"made up\", while highly doubtful at the time, seems even less likely since Michael Flynn pleaded guilty to lying to the FBI about the same phone call Reuters 6/16 Access denied for major publications Protesters gathered outside of the New York Times office after Trump's White House barred a number of publications from attending a press briefing on February 24 2017. Just hours after the President had again denounced the media, then Press Secretary Sean Spicer denied access to news outlets such as CNN and the New York Times, while permitting Breitbart News, CBS, Fox and others AFP/Getty 7/16 \"#FNN\" On July 2 2017, President Trump tweeted an edited clip from his Wrestlemania XXIII appearance in which the CNN logo had been imposed onto the face of his wrestling opponent Vince McMahon. CNN is a common target for President Trump and here he suggests that he is getting the better of the network through his repeated attacks 8/16 \"The most powerful TV show in America\" On July 27 2017, President Trump quoted a New York Times article about Fox & Friends. The President is known to watch Fox & Friends every morning, often tweeting about matters discussed on the show, leading to speculation over its influence on his outlook and policies Getty 9/16 \"It's frankly disgusting the way the press is able to write whatever they want to write\" In a meeting with Canadian Prime Minister Justin Trudeau on October 11 2017, President Trump suggested that the press ought not to be allowed their constitutionally secured freedom. He added \"people should look into it\", suggesting that he also doesn't respect the protection of sources. At the time, he was angry at an NBC report claiming that the President had expressed a desire to return the size of the US' nuclear arsenal to its 1960s height, a claim that he and others in his administration dismissed as fake news AFP/Getty 10/16 \"negative (Fake)\" In a tweet on 9 May 2018, President Trump conflated negative reporting about him with fake news 11/16 \"I didn't criticise the Prime Minister\" In a press conference with the Prime Minister on his visit to Britain, President Trump disputed claims published in the Sun that he had criticised Mrs May's Brexit strategy Reuters 12/16 \"Horrible, horrendous people\" At a Republican rally in Pennsylvania on August 3 2018, President Trump deemed all journalists in attendance \"horrible, horrendous people\". He later denounced the \"fake, fake, disgusting news\" for falsely reporting that he was late to his meeting with the Queen when visiting Britain AFP/Getty 13/16 Trump's rhetoric \"very close to inciting violence\" In an interview with the Guardian on 13 August 2018, the outgoing UN High Commissioner for Human Rights Zeid Ra'ad al-Hussein suggested that President Trump's attacks on the press are \"very close to inciting violence\". Zeid singles out the President's repeated claim that the fake news (negative coverage) media is the \"enemy of the people\" as dangerous Reuters 14/16 \"anonymous source\" = fiction President Trump claimed that any report citing anonymous sources is fiction. The protection of sources is a vital matter of press freedom, without it a potential source's fear of repercussions could lead them to withhold important information 15/16 \"You are a rude, terrible person\" At a press conference in the wake of the midterms, President Trump clashed with CNN's Jim Acosta when he asked about the President's use of language during the campaign Reuters 16/16 \"I would never kill Journalists\" For any journalists frightened by President Trump's attacks on the press, perhaps you can take solace in his words from a campaign rally in Grand Rapids on December 21 2015. Responding to remarks over Vladimir Putin's handling of journalists, Trump stated: \"I hate some of these people, but I'd never kill them... I'll be honest - I would never kill them. Uhhh lets see.. no, I never would\" Getty 1/16 \"You are fake news!\" Then President-elect Trump directed this insult to CNN's Jim Acosta while refusing him a question at a press conference on January 11 2017. The President-elect's anger was due to the publishing by Buzzfeed of unverified memos that implicated Michael Cohen in Russian collusion. CNN had reported on a briefing of Obama and Trump on the memos by US intelligence chiefs, but knowing the content to be unverified had not revealed it AFP/Getty 2/16 \"They are among the most dishonest human beings on earth\" President Trump said this of journalists during a visit to the CIA on the the day following his inauguration. His claim of having the largest crowd of any inauguration ceremony in history had been debunked and he clearly wasn't happy Reuters 3/16 \"Failing New York Times\" President Trump commonly addresses the New York Times in this way, contrary to its increasing profit margins and expanding global readership. He is pictured here in the midtown Manhattan office of the paper Getty 4/16 \"Enemy of the American People\" President Trump has since repeated the claim that such news outlets are the enemy of the people, often after they break negative stories about him 5/16 \"They have no sources\" Speaking at the Conservative Political Action Conference on February 24 2017, President Trump suggested that a Washington Post article with 9 sources was \"made up\". The article in question exposed how then National Security Advisor Michael Flynn had misled Vice President Mike Pence over a phone call to a Russian ambassador. That the article was \"made up\", while highly doubtful at the time, seems even less likely since Michael Flynn pleaded guilty to lying to the FBI about the same phone call Reuters 6/16 Access denied for major publications Protesters gathered outside of the New York Times office after Trump's White House barred a number of publications from attending a press briefing on February 24 2017. Just hours after the President had again denounced the media, then Press Secretary Sean Spicer denied access to news outlets such as CNN and the New York Times, while permitting Breitbart News, CBS, Fox and others AFP/Getty 7/16 \"#FNN\" On July 2 2017, President Trump tweeted an edited clip from his Wrestlemania XXIII appearance in which the CNN logo had been imposed onto the face of his wrestling opponent Vince McMahon. CNN is a common target for President Trump and here he suggests that he is getting the better of the network through his repeated attacks 8/16 \"The most powerful TV show in America\" On July 27 2017, President Trump quoted a New York Times article about Fox & Friends. The President is known to watch Fox & Friends every morning, often tweeting about matters discussed on the show, leading to speculation over its influence on his outlook and policies Getty 9/16 \"It's frankly disgusting the way the press is able to write whatever they want to write\" In a meeting with Canadian Prime Minister Justin Trudeau on October 11 2017, President Trump suggested that the press ought not to be allowed their constitutionally secured freedom. He added \"people should look into it\", suggesting that he also doesn't respect the protection of sources. At the time, he was angry at an NBC report claiming that the President had expressed a desire to return the size of the US' nuclear arsenal to its 1960s height, a claim that he and others in his administration dismissed as fake news AFP/Getty 10/16 \"negative (Fake)\" In a tweet on 9 May 2018, President Trump conflated negative reporting about him with fake news 11/16 \"I didn't criticise the Prime Minister\" In a press conference with the Prime Minister on his visit to Britain, President Trump disputed claims published in the Sun that he had criticised Mrs May's Brexit strategy Reuters 12/16 \"Horrible, horrendous people\" At a Republican rally in Pennsylvania on August 3 2018, President Trump deemed all journalists in attendance \"horrible, horrendous people\". He later denounced the \"fake, fake, disgusting news\" for falsely reporting that he was late to his meeting with the Queen when visiting Britain AFP/Getty 13/16 Trump's rhetoric \"very close to inciting violence\" In an interview with the Guardian on 13 August 2018, the outgoing UN High Commissioner for Human Rights Zeid Ra'ad al-Hussein suggested that President Trump's attacks on the press are \"very close to inciting violence\". Zeid singles out the President's repeated claim that the fake news (negative coverage) media is the \"enemy of the people\" as dangerous Reuters 14/16 \"anonymous source\" = fiction President Trump claimed that any report citing anonymous sources is fiction. The protection of sources is a vital matter of press freedom, without it a potential source's fear of repercussions could lead them to withhold important information 15/16 \"You are a rude, terrible person\" At a press conference in the wake of the midterms, President Trump clashed with CNN's Jim Acosta when he asked about the President's use of language during the campaign Reuters 16/16 \"I would never kill Journalists\" For any journalists frightened by President Trump's attacks on the press, perhaps you can take solace in his words from a campaign rally in Grand Rapids on December 21 2015. Responding to remarks over Vladimir Putin's handling of journalists, Trump stated: \"I hate some of these people, but I'd never kill them... I'll be honest - I would never kill them. Uhhh lets see.. no, I never would\" Getty\n\nThis was not the first time that Mr Trump had expressed frustration with Fox News, but it was eye-opening.\n\nThe president has good relationships with many of Fox’s on-air personalities, including the hosts of “Fox & Friends,” Sean Hannity, Jeanine Pirro and Laura Ingraham. His former spokeswoman, Sarah Huckabee Sanders, signed on as a Fox News contributor last week.\n\nBut whether this is a sign of genuine deterioration in relations between the president and his preferred cable channel or a short-lived dust-up will be closely watched by news executives and throughout the Beltway.\n\nOn Thursday, two on-air personalities responded to Mr Trump’s tweets.\n\nNeil Cavuto, an anchor for Fox News and Fox Business Network who has been critical of Trump in the past, said on the air: “Mr. President, we don’t work for you. I don’t work for you. My job is to cover you, not fawn over you or rip you. Just report on you — to call balls and strikes on you. My job, Mr. President — our job here — is to keep score, not settle scores.”\n\n“You’re entitled to your point of view, Mr. President,” he continued. “But you’re not entitled to your own set of facts.”\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nBrit Hume, a senior political analyst for Fox News, echoed Mr Cavuto’s comments and tweeted, “Fox News isn’t supposed to work for you.”\n\n“We have tried to be fair to him in our news coverage,” Hume said in another tweet responding to someone who had asked why Mr Trump thought Fox worked for him. “Best example: we didn’t fall for the Russia conspiracy theory that ended in such a fiasco for other outlets. Plus, some of our opinion hosts support Trump. (Others don’t.)”\n\nFox News declined to comment. The White House declined to comment on Mr Trump’s complaints about Fox News or Mr Cavuto’s retort, preferring to leave the sparring to the president himself.\n\nWhile in office, Mr Trump has reserved his most cantankerous barbs for other news outlets. This week alone, he has attacked The New York Times, The Washington Post, Axios and NBC.\n\nBut the president has increased his criticism of Fox News in recent months. On Sunday, he said the network was “not what it used to be” when he expressed unhappiness with a poll.\n\nHe has also attacked Fox News contributor Donna Brazile, anchors Shepard Smith and Chris Wallace, and Fox analyst Juan Williams.\n\nEarly this month, Mr Trump said that “watching Fake News CNN” was better than watching Ms Smith’s show and that “whenever possible” he turned to the One America News Network. When Mr Wallace interviewed Democratic presidential candidate Pete Buttigieg in May, Mr Trump said Fox News was “moving more and more to the losing side.”\n\nBy Friday afternoon, it appeared that Mr Trump had other targets on his mind.\n\nOver the course of two hours, he had tweeted four videos on the Justice Department’s critical inspector general report regarding former FBI Director James Comey. All four clips featured guests criticising Mr Comey, and all four clips were from Fox News.\n\nNew York Times", "description": "Tensions between the White House and Fox News ratcheted up this week after President Donald Trump declared the network was letting his supporters down and two on-air personalities said they “don’t work” for him. The back-and-forth began on Wednesday when Trump took to Twitter to rebuke the network for airing an interview with Xochitl Hinojosa, a spokeswoman for the Democratic", "authors": ["John Koblin"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/31/14/donald-trump-press-conference.jpg"}