{"pub": "cbs", "url": "https://cbsnews.com/news/john-doe-who-accused-kevin-spacey-of-sexual-assault-dies-2019-09-18", "downloaded_at": "2019-09-19 06:01:16.807395+00:00", "title": "\"John Doe\" who accused Kevin Spacey of sexual assault dies", "language": "en", "text": "The anonymous massage therapist who accused actor Kevin Spacey of sexual assault has died, a lawyer for the man confirmed to CBS News on Wednesday. The individual, filed a lawsuit as \"John Doe,\" in September 2018 in California that accused Spacey of forcing him to grab Spacey's genitals twice during a massage session two years ago.\n\n\"His untimely death was, to his family, a devastating shock that they are struggling to process and is so recent that they have not yet held his funeral service,\" said Genie Harrison, an attorney for John Doe, in a statement.\n\nA notice of John Doe's death was filed in court by Spacey's attorneys on Tuesday afternoon, Harrison said. The filing triggers a 90-day countdown for an estate to be substituted substiuted for John Doe, Harrison said. Attorneys for Doe had notified Spacey's attorney of the death.\n\nHarrison accused Spacey and his attorneys of the notice in \"attempt to gain the advantage of a ticking clock.\"\n\nIn June, Doe was ordered to reveal his identity to Spacey and his attorneys but a judge allowed it would remain confidential in further proceedings.\n\nAccording to the second complaint filed in the case, Spacey allegedly tried to forcibly kiss John Doe and said something about having Spacey perform oral sex on the man, according to the Los Angeles Times.\n\nThe lawsuit is one of several cases that Spacey is facing for sexual misconduct. In July, prosecutors in Nantucket dropped a criminal groping case against Spacey that involved a then-18-year-old man. Much of that case hinged on a cell phone that the alleged victim said he used that night in 2016 contained incriminating text messages and videos. The case fell apart when the alleged victim pleaded the Fifth about possibly altering that evidence.", "description": "The filing triggers a 90-day countdown for an estate to be substituted substiuted for John Doe, attorneys for John Doe said", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/07/17/fab3cdb2-beb5-4e8b-a62c-16678bf5c6c3/thumbnail/1200x630/a2eea2b9ff082806f60b481869b4a64b/ap-19170693151002.jpg", "published_at": "2019-09-18"}