{"pub": "afr", "url": "https://afr.com/companies/healthcare-and-fitness/oneventures-leads-20-million-kira-biotech-fundraising-20191029-p535b0", "downloaded_at": "2019-10-30 14:21:19.189396+00:00", "title": "OneVentures leads $20 million Kira Biotech fundraising", "language": "en", "text": "\"The manufacturing is a large part of the expense because the antibody is made from living cells and it take a lot of process development to be able to make a drug that's purified, stable and able to be used to treat humans,\" he said.\n\n\"These things are always risky and can be hard to predict, but my hope is that it will be effective in graft versus host disease, which is a big unmet medical need. If it works really well it will allow patients to not just avoid the disease, but for more transplants to occur because the risks will be reduced.\"\n\nWhile there are existing treatments for graft versus host, most treatments are broad immunosuppressants and lead to a higher risk of other infections and illnesses, whereas the antibody being developed by Kira Biotech can target a specific cell type which directs the immune response.\n\nThe research was developed by the two Aussie scientists while they worked at Queensland's Mater Medical Research Institute and later at the ANZAC Research Institute and The University of Sydney. Professor Clark is now on the board of Kira.\n\nOneVentures managing partner Dr Paul Kelly first discovered the research 18 months ago after which the fund was instrumental in the creation of the venture.\n\nHe said while it is still early stage, the initial animal trials were enough to give the fund confidence in the potential of the therapy and he believed it could have a commercial product ready in five to 10 years.\n\n\"It’s a long path from research through to product so we had to think long and hard on the cost, timeframe, what the key milestones would be and who would manage that,\" he said.\n\n\"This is our biggest bet in immunology. We've made four other investments this year and this is one of the most significant.\"\n\nAll of the company's phase one clinical trials will be held in Australia and Dr Baker said the government's research and development incentives had been a major lure for healthcare companies globally to conduct research locally.\n\n\"The rebates ... make the amount of money you have to raise a lot more reasonable.\"", "description": "Kira Biotech is creating a treatment for graft versus host disease, which it hopes will lead to more transplants and more targeted treatments.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.3942%2C$multiply_0.7554%2C$ratio_1.776846%2C$width_1059%2C$x_295%2C$y_124/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/403da049db584da5ff8102d87b7aecec4644ee4d", "published_at": "2019-10-29"}