{"pub": "npr", "url": "https://npr.org/2019/10/10/768894793/2-giuliani-associates-arrested-on-campaign-finance-violations", "downloaded_at": "2019-10-10 18:28:53.641886+00:00", "title": "2 Giuliani Associates Arrested On Campaign Finance Violations", "language": "en", "text": "2 Giuliani Associates Arrested On Campaign Finance Violations\n\nEnlarge this image toggle caption Carolyn Kaster/AP Carolyn Kaster/AP\n\nUpdated at 12:53 p.m. ET\n\nTwo Florida-based businessmen who helped President Trump's personal attorney Rudy Giuliani in his efforts to dig up dirt on former Vice President Joe Biden in Ukraine have been arrested and charged with campaign finance violations in a separate matter.\n\nLev Parnas and Igor Fruman were arrested at Dulles International Airport outside Washington, D.C., on Wednesday night, according to the U.S. Attorney's Office in Manhattan. They were indicted by a grand jury in New York but are scheduled to make their initial court appearance in federal court in Virginia later this afternoon.\n\nAn attorney for the two men did not immediately respond to a request for comment. Giuliani declined to comment.\n\nAccording to the indictment, Parnas and Fruman face two counts of conspiracy, and one count each of false statements and falsification of business records. Two other associates, David Correia and Andrey Kukushkin, each face one count of conspiracy.\n\nThe indictment alleges the men \"conspired to circumvent the federal laws against foreign influence by engaging in a scheme to funnel foreign money to candidates for federal and state office so that the defendants could buy potential influence with candidates, campaigns, and the candidates' governments.\"\n\nThe indictment lays out two separate conspiracies that Parnas and Fruman allegedly engaged in.\n\nIn one, court papers say they set up a limited liability company, Global Energy Producers, through which they made $340,000 in contributions to two political action committees.\n\nThe contributions, the indictment alleges, were made in order to gain influence with politicians and help Parnas and Fruman \"advance their own personal financial interests and the political interests of Ukrainian government officials, including at least one Ukrainian government official with whom they were working.\"\n\nThe indictment says Parnas and Fruman met with a member of Congress identified only as \"congressman-1\" during the 2018 election cycle, for whom they had committed to raise $20,000.\n\nThe two met with the congressman and sought his \"assistance\" in getting the then-U.S. ambassador to Ukraine, Marie Yovanovitch, removed. The indictment says Parnas was working on this effort, at least in part, at the request of more Ukrainian government officials.\n\nYovanovitch ultimately was removed from her post this spring amid complaints from Giuliani and others. In the controversial July 25 phone call between President Trump and his Ukrainian counterpart, Trump refers to Yovanovitch as \"bad news\" and said, \"She's going to go through some things.\"\n\nYovanovitch is scheduled to testify behind closed doors on Friday as part of the House impeachment inquiry against Trump.\n\nWhile the congressman is not named in the indictment, details from the document and Federal Election Commission records point to it being former Texas Republican Pete Sessions, who lost his reelection bid in 2018.\n\nIn a separate alleged scheme, Parnas and Fruman allegedly worked with Correia and Kukushkin to make political donations — funded by an unnamed foreign national — to politicians and candidates at the state level to try to win their help securing licenses for a recreational marijuana business.\n\nAccording to the indictment, Parnas was born in Ukraine and Fruman in Belarus. Both are now U.S. citizens.\n\nThe indictment is not their only ongoing legal challenge.\n\nThey were also subpoenaed by House lawmakers as part of the impeachment inquiry for their roles helping Giuliani dig up information in Ukraine on Joe Biden and his son Hunter.\n\nParnas has told NPR that he worked as a fixer to help arrange meetings for Giuliani with current and former Ukrainian officials, including prosecutors.\n\nParnas and Fruman had been called to testify this week — although even before their indictment, they were not expected to show up for their closed-door depositions.", "description": "Lev Parnas and Igor Fruman are associates of President Trump's personal lawyer Rudy Giuliani and reportedly aided Giuliani's efforts to have Ukraine investigate former Vice President Joe Biden.", "authors": ["Ryan Lucas", "Brian Naylor"], "top_image": "https://media.npr.org/assets/img/2019/10/10/ap_18123078904944_wide-9516b9dbcbf7e45b2ab91b1dd3297ed5317bae8c.jpg?s=1400", "published_at": "2019-10-10"}