{"pub": "townhall", "url": "https://townhall.com/tipsheet/juliorosas/2019/10/07/house-democrats-looking-to-hide-whistleblowers-identity-to-protect-them-from-tru-n2554320", "downloaded_at": "2019-10-08 01:24:07.187839+00:00", "title": "House Democrats Looking to Hide Whistleblower's Identity to Protect Them From Trump Allies", "language": "en", "text": "House Democrats are considering taking steps to hide the identity of the whistleblower that sparked the impeachment inquiry against President Trump in order to have them testify.\n\nOfficials are considering having the whistleblower testify from a remote location and obscuring the individual’s appearance and voice, having the whistleblower sit behind a screen, or conducting an audio-only testimony, according to The Washington Post.\n\n“There are lots of different protocols and procedures we’re looking into to find out what works and doesn’t work to protect the identity of the whistleblower,” an official told the Post. “That is paramount.\"\n\nDemocrats said the steps are being considered because they are worried House Republicans will leak the whistleblower's identity. They also said they had to restrict access to the visitor logbook after Republicans staffers leaked names of individuals signing in for job interviews when the majority was hiring this year.\n\n“Adam Schiff and Nancy Pelosi are hell-bent on conducting their impeachment inquiry behind closed doors. Taxpayers deserve transparency throughout the impeachment process,\" a congressional official who is working on the impeachment inquiry told Townhall. \"It’s only fair that President Trump and the American people get to face the President’s accuser.\"\n\nTrump has said he deserves to meet with his accuser, who filed a report saying the president pushed Ukrainian President Volodymyr Zelensky to investigate the former Vice President Joe Biden and his son, Hunter, in exchange to providing military aid.\n\n\"Like every American, I deserve to meet my accuser, especially when this accuser, the so-called 'Whistleblower,' represented a perfect conversation with a foreign leader in a totally inaccurate and fraudulent way,\" Trump tweeted, adding, \"His lies were made in perhaps the most blatant and sinister manner ever seen in the great Chamber.\"\n\nLike every American, I deserve to meet my accuser, especially when this accuser, the so-called “Whistleblower,” represented a perfect conversation with a foreign leader in a totally inaccurate and fraudulent way. Then Schiff made up what I actually said by lying to Congress...... — Donald J. Trump (@realDonaldTrump) September 29, 2019", "description": ".10/07/2019 21:20:08PM EST.", "authors": ["Julio Rosas", "Beth Baumann", "Timothy Meads", "Cortney O'Brien"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/81/1a96d680-9dcd-4475-bcee-aca07c0291a6.jpg", "published_at": "2019-10-07"}