{"pub": "businessinsider", "url": "https://businessinsider.com/9-18-2019-internet-of-things-report", "downloaded_at": "2019-09-18 23:29:20.471492+00:00", "title": "IoT Report: How Internet of Things technology growth is reaching mainstream companies and consumers", "language": "en", "text": "The Internet of Things (IoT) is powering transformation for enterprises, consumers, and governments. Emerging tools and technologies like smart speakers, machine learning, and 5G are enabling huge gains to efficiency and more control at home and in the workplace.\n\nPlanned investments by companies in IoT technologies & solutions Business Insider Intelligence\n\nThe continued growth of the IoT industry is going to be a transformative force across all organizations. By integrating all of our modern day devices with internet connectivity, the IoT market is on pace to grow to over $3 trillion annually by 2026.\n\nBusiness Insider Intelligence is keeping its finger on the pulse of this ongoing revolution by conducting our third annual Global IoT Executive Survey, which provides us with critical insights on the most pivotal new developments within the IoT and explains how top-level perspectives are changing year to year. Our survey includes nearly 400 responses from key executives around the world, including C-suite and director-level respondents.\n\nThe proprietary data obtained in our survey has helped us continually refine our IoT market growth projections over the years. This year's survey data shows that companies' plans to invest in IoT solutions are accelerating with 5G on the horizon and an uptick in IoT adoption. We forecast that there will be more than 64 billion IoT devices by 2025, up from about 10 billion in 2018, and 9 billion in 2017.\n\nThrough this exclusive study and in-depth research into the field, Business Insider Intelligence details the components that make up the IoT ecosystem. We size the IoT market and use exclusive data to identify key trends in the connected devices sector. And we profile the enterprise, governmental, and consumer IoT segments individually, drilling down into the drivers and characteristics that are shaping each market.\n\nCompanies mentioned in this report are: Alibaba, Alphabet, Amazon, Apple, Around Analytics, Arm, AT&T, August Home, C3 IoT, China Mobile, Dallas Innovation Alliance, Dell, Ericsson, Filament, FogHorn, Google, Grubhub, Guardzilla, Huawei, ibex, Intel, Microsoft, Next, Nokia, Pandora, PsiKick, Qualcomm, SAM, Samsung, Sidewalk Labs, Spotify, STMicroelectronics, Verizon, Whirlpool, and Xage.\n\nHere are some key takeaways from the report:\n\nWe project that there will be more than 64 billion IoT devices by 2025, up from about 10 billion in 2018.\n\nBlockchain within the IoT is still generally the provenance of startups, and they're populating the marketplace with products that take advantage of the technology's characteristics. It's not going to upend the IoT, despite the technology's much-ballyhooed potential. And respondents to our survey of IoT providers seem, for the most part, to understand this. Just a small percentage think that blockchain will become a universal standard in the IoT. The vast majority said that blockchain will either be a tool that most companies employ at times, or a niche product that only certain solutions use.\n\nLightning-fast 5G networks will change how telecommunications shapes business and will also offer new and transformative possibilities in the IoT space. The new standard will further increase the appeal of cellular solutions in the areas where it's available. And that's why nearly half of IoT providers said they're planning to introduce support for 5G networks to their solutions within the next two years.\n\nThe report highlights the opinions and experiences of IoT decision-makers on topics that include: drivers for adoption; major challenges and pain points; deployment and maturity of IoT implementations; investment in and utilization of devices; the decision-making process; and forward- looking plans.\n\nIn full, the report:\n\nProvides a primer on the basics of the IoT ecosystem.\n\nOffers forecasts for the IoT moving forward, and highlights areas of interest in the coming years.\n\nLooks at who is and is not adopting the IoT, and why.\n\nHighlights drivers and challenges facing companies that are implementing IoT solutions.\n\nInterested in getting the full report? Here are three ways to access it:\n\nPurchase & download the full report from our research store. >> Purchase & Download Now Sign up for Connectivity & Tech Pro, Business Insider Intelligence's expert product suite keeping you up-to-date on the people, technologies, trends, and companies shaping the future of connectivity, delivered to your inbox 6x a week. >> Get Started Subscribe to a Premium pass to Business Insider Intelligence and gain immediate access to this report and more than 250 other expertly researched reports. As an added bonus, you'll also gain access to all future reports and daily newsletters to ensure you stay ahead of the curve and benefit personally and professionally. >> Learn More Now\n\nThe choice is yours. But however you decide to acquire this report, you've given yourself a powerful advantage in your understanding of the IoT.", "description": "The Internet of Things has come a long way, with more devices being integrated with internet connectivity. Learn about the continued rapid growth and development of a revolutionary industry.", "authors": ["Peter Newman"], "top_image": "https://amp.businessinsider.com/images/5c4f25812bdd7f3c051f2606-2732-1366.jpg", "published_at": "2019-01-28"}