{"pub": "financialpost", "url": "https://business.financialpost.com/commodities/mining/safe-haven-gold-aims-to-reinvent-itself-as-a-climate-risk-mitigation-asset-with-net-zero-emissions", "downloaded_at": "2019-10-23 23:24:20.707389+00:00", "title": "Safe-haven gold aims to reinvent itself as a 'climate risk mitigation' asset with 'net zero' emissions", "language": "en", "text": "This September, Newmont Goldcorp summoned a host of local and provincial dignitaries to Chapleau, Ontario, where it christened its Borden gold project, ‘the mine of the future.’\n\nIn an industry where a 40-ton diesel truck is considered modest-sized, the company wanted to build Borden into Canada’s first all-electric underground gold mine, a plan that has taken years — since the company was called Goldcorp — and cost hundreds of millions of dollars as executives criss-crossed the world in search of things like an electric haul truck.\n\n“We call it our $300-million pilot project,” Brent Bergeron told the Financial Post in 2018, who at the time headed up Goldcorp’s Corporate Affairs and Sustainability.\n\nThe mine is expected to finally begin commercial production in the fourth quarter of this year.\n\nNow, the World Gold Council is laying out a plan for the rest of the sector to follow in the company’s footsteps, and to collectively cut its emissions to ‘net zero’ by 2050. A report released on Wednesday suggests that doing so could help transform gold into a “climate risk mitigation asset,” in other words something that investors seek out in part because it lowers the overall emissions profile of their portfolio.\n\nIt ties into the Paris Agreement of 2015, in which nearly every major country with one exception — the United States — has committed to reducing emissions to limit the global temperature rise to less than two degrees, and to try to keep it from rising more than 1.5 degrees.\n\nWhile many sectors are likely to commit to decarbonizing, the report suggests that there is an investment case for the gold sector. It notes that gold, long considered a hedging asset that maintains value during risky times, could see its value rise in the face of climate change-caused market volatility. Going green could help the sector capitalize on this value, the report suggests.\n\nThe World Gold Council report offers a new, detailed breakdown of the gold sector’s carbon footprint, calculating it emits at least 126 million tonnes of CO2 per year.\n\nAbout 90 per cent of those are linked to production, including mining, milling, concentrating and smelting, refining and recycling and the indirect emissions from electricity consumption and the goods and suppliers used, the report found.\n\n“Once the gold has been mined, associated ongoing emissions are very tiny,” said Terry Heymann, chief financial officer of the World Gold Council.\n\nGold is going to become ever more important in an investors' portfolio Terry Heymann, World Gold Council\n\nA chart in the report breaks down gold production emissions as 45 per cent from purchased electricity, 30 to 35 per cent from diesel fuel combustion, 20 per cent from production and transport of fossil fuels and about 5 per cent from chemicals.\n\nMeanwhile, downstream consumption of gold is relatively small with a calculated 828,000 tons of CO2 emissions linked to gold jewellery, 4,500 tons linked to gold investment — presumably in the costs of storage and transport of gold — and also an additional 168 tons of CO2 produced by the gold in electronics, according to the report.\n\n“We’ve made the case, that while challenging, this is feasible for the gold mining sector,” said Heymann.\n\nThrough efficiency and process improvement measures such as the use of predictive analytics, converting to renewable energy sources and using renewable-energy powered transport, the sector can gradually move toward cutting emissions.\n\nFor example, companies sometimes often create mini-grids to power their mines to buffer against fluctuations in the power supply and often to rein in costs. Until recently, these mini grids relied mostly on diesel generation, but the report suggests there is an emerging business case for containerized systems based on renewable energy and storage systems that companies are already seizing on.\n\nVancouver’s B2Gold Inc. installed a seven megawatt solar plant at its mine in the desert in Namibia, reducing its reliance on diesel generators, and it is constructing a 30 MW solar plant at its Fekola Mine in Mali.\n\nOthers such as Vancouver’s Pretium Resources is reducing its diesel consumption at its Brucejack mine by constructing a transmission line to British Columbia’s hydro-based power grid.\n\nSome emissions, including those from chemicals, may be challenging to eliminate, and the report suggests the sector can invest in decarbonization projects elsewhere to offset these emissions.\n\n“As gold decarbonizes, gold will become an industry that has a lower emissions,” said Heymann, adding “Gold is going to become ever more important in an investors’ portfolio.”\n\nFinancial Post\n\n• Email: gfriedman@nationalpost.com | Twitter: GabeFriedz", "description": "The industry is repositioning itself as an asset investors would be eager to add to their portfolio to lower the overall emissions of their investments", "authors": [], "top_image": "https://financialpostcom.files.wordpress.com/2019/10/gold-1.jpg", "published_at": "2019-10-23"}