{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/15/german-security-services-want-more-powers-to-fight", "downloaded_at": "2019-10-15 08:02:36.952663+00:00", "title": "German security services want more powers to fight extremism", "language": "en", "text": "BERLIN (AP) - Germany’s security services said Tuesday they’re seeking greater powers to fight the kind of far-right extremism behind last week’s synagogue attack, including requiring internet companies to report illegal hate speech to police.\n\nA 27-year-old German man previously unknown to police confessed to carrying out the attack in the eastern city of Halle in which two people were killed Wednesday.\n\nThe suspected gunman, identified by prosecutors only as Stephan B. due to privacy rules, allegedly built the firearms he used with the help of online instructions, posted an anti-Semitic screed before the attack and later broadcast the shooting live on a popular gaming site.\n\nIn response to the attack and previous incidents, German officials have called for more officers to be devoted to tackling far-right extremism and a greater focus on online platforms they say are increasingly being used as a means of spreading far-right radicalism and linking up with like-minded people in a way already seen with Islamist extremism.\n\nThomas Haldenwang, who heads the BfV domestic intelligence agency, said the attack in Halle and similar shootings in Texas, New Zealand and Norway showed the need for security services to get better tools to tackle online extremism. In particular, he called for authorities to be given permission to install monitoring software on suspect’s devices so as to read their encrypted communication.\n\nHolger Muench, head of the Federal Criminal Police Office, said online threats and acts of violence are creating a “climate of fear” in Germany that is deterring people from volunteering for public office.\n\n“Right-wing crimes threaten our democracy,” Muench said. “The situation is serious.”\n\nThe country is still reeling from the killing of Walter Luebcke, a regional politician from Chancellor Angela Merkel’s party, who was shot dead at his home in June. Luebcke had vocally supported Merkel’s welcoming stance toward refugees in 2015 and the suspect in his killing is a far-right extremist with a string of convictions for violent anti-migrant crimes.\n\nMuench said his agency has identified 43 far-right extremists who are considered to constitute a serious threat, an increase of about a third since the start of the year. Overall, authorities say there are some 12,700 far-right extremists in Germany “prepared to use violence.”\n\nHe called for a bundle of measures including greater scrutiny of online hate postings, extending the period of time that security services can store data on possible extremists and for those who create and distribute lists of political enemies to be prosecuted.\n\nHe also proposed that an existing law requiring platforms such as Facebook and Twitter to swiftly remove illegal hate speech should be expanded to force them report such content to police.\n\nMuench suggested his office could become a central point of contact dealing with online hate crimes in the same way it already does for child pornography.\n\nFurther proposals include creating a special unit to investigate possible extremists in the police and other government departments, and a crackdown on known far-right groups.\n\nSecurity officials are particularly concerned that the ‘new right’ - groups that include factions within the Alternative for Germany party which entered the federal parliament two years ago - are providing the intellectual fodder for extremists.\n\nAuthorities are still investigating whether the suspect in the Halle shooting had ties to any known groups or individuals. At least five people watched the attack live as it happened, suggesting they may have known it was going to take place.\n\nThe suspect failed to force his way into the synagogue as scores of people inside were observing Judaism’s holiest day, Yom Kippur. He then shot and killed a 40-year-old German woman in the street outside and a 20-year-old man at a nearby kebab shop before fleeing. He was later arrested in Zeitz, about 50 kilometers (31 miles) south of Halle.\n\nThe suspect has admitted during questioning that he carried out the shooting and had anti-Semitic and right-wing extremist motives.\n\n___\n\nFollow Frank Jordans on Twitter at http://www.twitter.com/wirereporter\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Germany's security services said Tuesday they're seeking greater powers to fight the kind of far-right extremism behind last week's synagogue attack, including requiring internet companies to report illegal hate speech to police.", "authors": ["The Washington Times Http", "Frank Jordans"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/09/aptopix_germany_shooting_09252_c0-250-6000-3750_s1200x700.jpg?2cb823f519263a3e55a419724463fd44fb7f7c61", "published_at": "2019-10-15"}