{"pub": "foxnews", "url": "https://foxnews.com/media/kevin-mccarthy-defends-trump-ukraine-report", "downloaded_at": "2019-09-21 03:36:50.527728+00:00", "title": "House Minority Leader McCarthy defends Trump in wake of Ukraine report: 'More facts' are needed", "language": "en", "text": "House Minority Leader Kevin McCarthy defended President Trump Friday in the wake of a new report that claims the commander-in-chief asked the president of Ukraine numerous times in a single phone call to investigate former Vice President Joe Biden’s son.\n\n\"I think this president has been through enough. He’s proven he can do the job and why are people listening to his calls and selectively putting something out for political gain?\" McCarthy said on \"Special Report with Bret Baier.\"\n\n\"Let this president govern this nation. He’s proved he can do it economically,\" McCarthy said before adding \"This world is safer because of President Trump.\"\n\nThe Wall Street Journal reported Friday that, in a July phone call, Trump repeatedly asked Ukrainian President Volodymyr Zelensky to work with Trump lawyer Rudy Giuliani on a probe into Hunter Biden. The call came a month before Trump put a hold on $250 million in military aid to Ukraine -- a hold that was eventually released after objections from the Senate.\n\nCONTROVERSY OVER TRUMP PHONE CALL CENTERS ON UKRAINE, AS PRESIDENT DECRIES 'PARTISAN' COMPLAINT\n\nJoe Biden, now a Democratic presidential candidate, has faced scrutiny for months over his past role pressuring the country to fire its top prosecutor while he was leading a corruption investigation into a natural gas company that had ties to Hunter. Giuliani has suggested that Biden, as VP, worked to protect the company from investigation. Biden said on Friday that the claim has no credibility.\n\nBaier asked McCarthy if he had \"a problem\" with the reported request made by Trump, to which McCarthy replied that \"more facts\" are needed.\n\nBaier continued to press McCarthy, but he would not be drawn into commenting. \"You don't have any of the facts,\" McCarthy told Baier. \"Let's wait till next Thursday and let's go through the appropriate channels. Have we not learned this lesson how many times before.\"\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nFox News' Adam Shaw contributed to this report.", "description": "House Minority leader Kevin McCarthy defended President Trump Friday from a new report that alleges he asked the president of Ukraine numerous times in a single phone call to investigate former Vice President Joe Biden’s son.", "authors": ["Victor Garcia"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/20/694940094001_6088197622001_6088187685001-vs.jpg", "published_at": "2019-09-21"}