{"pub": "yahoo", "url": "https://sg.finance.yahoo.com/news/nissan-former-chair-ghosns-lawyers-021816709.html", "downloaded_at": "2019-10-24 08:03:32.776906+00:00", "title": "Nissan ex-chairman Ghosn's lawyers want charges dismissed", "language": "en", "text": "FILE - In this Oct. 6, 2017, file photo, former Nissan Motor chairman Carlos Ghosn attends a media conference outside Paris, France. Lawyers for Ghosn, who is awaiting trial in Japan, asked the Tokyo District Court on Thursday, Oct. 24, 2019 to dismiss all charges filed against him in his financial misconduct case. The papers his lawyers filed in the court last week allege prosecutorial misconduct will prevent Ghosn from having a fair trial. The fillings allege unlawful collusion between the prosecutors, government officials and executives at Nissan Motor Co. drummed up allegations of wrongdoing to remove him as chairman. (AP Photo/Michel Euler, File)\n\nTOKYO (AP) — The lawyers of former Nissan Chairman Carlos Ghosn, who is awaiting trial in Japan, said Thursday they have requested that financial misconduct charges against him be dismissed.\n\nThey said in a statement that they filed papers in Tokyo District Court alleging prosecutorial misconduct that would prevent Ghosn from having a fair trial.\n\nThe papers allege collusion between prosecutors, government officials and executives at Nissan Motor Co. to drum up criminal allegations in order to remove him as chairman.\n\nThe aim was to prevent Ghosn from further integrating Nissan with its French alliance partner Renault SA, they say.\n\n\"To execute this scheme, the prosecutors illegally ceded their investigative powers to certain Nissan employees and consultants, and together with Nissan, unlawfully trampled Mr. Ghosn's legal rights in Japan and around the world,\" the statement says.\n\nGhosn says he is innocent. He was arrested in November 2018 and is out on bail. The prosecutors say they are confident they have a case.\n\nThe statement cited as misconduct the alleged abuse of the plea-bargaining system to get false and misleading testimony from Nissan employees and reliance on Nissan's own investigation, which the lawyers call biased.\n\nIt also cited the seizure of papers related to his trial and media leaks intended to harm his reputation.\n\n\"We are asserting his innocence, but this filing asserts that, even before and beyond guilt or innocence, the case itself is unlawful,\" Junichiro Hironaka, one of the lawyers, told reporters.\n\n\"They wanted a criminal case and so they went digging around, back in time, to concoct a case.\"\n\nHironaka is known for winning acquittals in a nation with a 99% conviction rate. He is part of an international team of about a dozen lawyers hired by Ghosn.\n\nHironaka also accused the prosecutors of dragging their feet on presenting evidence, delaying the start of the trial, and hiding some evidence from the defense, including thousands of emails.\n\nHe said the latest filings, submitted last week, reflect the defense team's effort to tell its side of the story.\n\nUnder Japan's criminal justice system there is a lengthy stage of pre-trial sessions where the defense and prosecutors present evidence. The latest filing was part of such pre-trial procedures.\n\nThe court might not make any decision on the latest filing. In the meantime, the trial could start.\n\nIt is unclear when the trial would start or how long it will last, but it's expected to begin next year.\n\nWhen asked whether it was extreme to allege there was a conspiracy against Ghosn, Hironaka said: \"You may think this is extreme, but Mr. Ghosn's arrest is extreme.\"\n\nHe declined to give specifics, but said Ghosn's defense team included evidence to support its claims in the latest filings.\n\n\"They wanted to prevent Nissan to be handed over to France,\" Hironaka said.\n\nNissan declined comment, saying the company is not commenting on legal proceedings.\n\nGhosn was sent to Japan by Renault in the late 1990s and is credited with turning around a then near-bankrupt Nissan and helping transform it into one of the world's top auto alliances.\n\nThe charges against Ghosn allege under-reporting his promised compensation in documents and breaching trust in making dubious payments.\n\nGhosn's defense argues the promised compensation that allegedly wasn't properly reported was never agreed upon.\n\nThe defense also says allegations about dubious currency swaps caused no financial loss to Nissan and that payments to a Middle Eastern business were for legitimate services that benefited Nissan.\n\nHironaka said Ghosn is involved in preparing for his trial and attends pre-trial sessions, including Thursday's.\n\n\"He is doing fine,\" Hironaka said.\n\nGhosn's bail conditions forbid him to contact his wife, Carole, a requirement the defense has repeatedly asked be removed. Another such request was filed Thursday, Hironaka said.\n\nProsecutors say the restriction is to prevent Ghosn and his wife from colluding in ways that could jeopardize the case.\n\nSeparately, the legal team said Ghosn reached a civil settlement last month with the U.S. Securities and Exchange Commission in the SEC's investigation of alleged violations of U.S. securities laws.\n\nThe SEC case was settled \"with no findings or admission of wrongdoing,\" the defense team said.\n\n___\n\nFollow Yuri Kageyama on Twitter at https://twitter.com/yurikageyama\n\nOn Instagram https://www.instagram.com/yurikageyama/?hl=en", "description": "The lawyers of former Nissan Chairman Carlos Ghosn, who is awaiting trial in Japan, said Thursday they have requested that financial misconduct charges against him be dismissed.  The papers allege collusion between prosecutors, government officials and executives at Nissan Motor Co. to drum up criminal", "authors": ["Yuri Kageyama"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.2tMESvvZ.hNA7NLn3RhFw--~B/aD0zMDAwO3c9NDUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/sgap.org/769972cc766a50d2372fb096346d1fd5", "published_at": "2019-10-24"}