{"pub": "thehill", "url": "https://thehill.com/policy/transportation/464058-hartfords-bradley-airport-closed-after-wwii-vintage-plane-crash", "downloaded_at": "2019-10-05 13:24:58.770979+00:00", "title": "Hartford's Bradley airport closed after WWII vintage plane crash", "language": "en", "text": "Connecticut's Bradley International Airport in Hartford was forced to close on Wednesday after a vintage World War II-era plane flown by a private owner crashed at the airport.\n\nUSA Today reported that Connecticut's commissioner for the Department of Emergency Services and Public Protection reported fatalities in the incident, though exact details were not publicly released early Wednesday afternoon.\n\n\"There are fatalities, of which I will not tell you the number yet because during this investigation, it is far too early to discuss,\" commissioner James Rovella said at a news briefing.\n\nADVERTISEMENT\n\nAn airport spokesperson added that Bradley was closed, and that further information would be released as it became available.\n\n\"We can confirm that there was an accident involving a Collings Foundation World War II aircraft this morning at Bradley Airport,'' the airport's Twitter account wrote in a post. \"We have an active fire and rescue operation underway. The airport is closed. We will issue further updates as information becomes available.''\n\nWe can confirm that there was an accident involving a Collings Foundation World War II aircraft this morning at Bradley Airport. We have an active fire and rescue operation underway. The airport is closed. We will issue further updates as information becomes available. — Bradley Intl Airport (@Bradley_Airport) October 2, 2019\n\nThe Federal Aviation Administration (FAA) confirmed the crash in a statement released through Twitter, and added that the agency had implemented a ground stop for flights headed to Bradley.", "description": "Connecticut's Bradley International Airport in Hartford was forced to close on Wednesday after a vintage World War II-era plane flown by a private owner crashed at the airport.", "authors": [], "top_image": "https://thehill.com/sites/default/files/policelinetape11032017getty_1.jpg", "published_at": "2019-10-02"}