{"pub": "yahoo", "url": "https://sports.yahoo.com/ray-lewis-sends-heartfelt-message-200253048.html", "downloaded_at": "2019-09-13 20:11:32.656514+00:00", "title": "Ray Lewis sends heartfelt message to Eddie George and the late Steve McNair", "language": "en", "text": "Former Tennessee Titans stars Eddie George and the late Steve McNair will have their jersey retired at the team's home opener on Sunday.\n\nRavens legend Ray Lewis is no stranger to either. For years, his Baltimore defense was often given the daunting task of stopping the one-two punch of McNair and George. Additionally, Lewis and McNair were teammates in Baltimore for two seasons, 2006 and 2007.\n\nSo after hearing about jersey retirement news, Lewis offered a heartfelt message to two competitors turned friends that he played against several times in his career.\n\nScroll to continue with content Ad\n\nFrom competitors to brothers: Ray Lewis (@raylewis) sends a heartfelt message to @EddieGeorge2727 and the late Steve McNair\n\n\n\n\"If I told my son any man to be like, Eddie George and Steve McNair would be at the top of my list.\" pic.twitter.com/gWEwQhi7tk\n\n\n\n— Tennessee Titans (@Titans) September 12, 2019\n\n\"To a man that was once a competitor and now become a brother, congratulations bro,\" Lewis said on George. \"You brought out the best in me, and I think a lot of people don't realize why we became so close. All the way from 1995, me and you had something special, and it was built through competition. Now, I can't even tell my story without you, man.\"\n\nLewis then went on to address how the two of them changed his life, how his career would have been significantly different without these two.\n\nStory continues\n\n\"You and Steve McNair, rest in peace, forever changed my life,\" Lewis said. \"You showed me that hard work is one thing, but sacrifice in everything to get it done is a whole different thought process.\"\n\nGeorge spent eight years calling Nashville home, rushing for over 1,000 yards seven times and earning four Pro Bowl nods. He's the franchise's all-time rushing leader as well.\n\n\"Ed, let me tell you something. One of the greatest I've ever seen,\" Lewis said. \"One of the most intimidating running backs I've played against. The only reason that my game changed, the only reason that my career changed, is because I had to find a way to just get mentally prepared enough to deal with you.\"\n\nThe duo led Tennessee to a Super Bowl berth in the 1999-2000 season, coming up just a yard short of hoisting the Lombardi Trophy.\n\nBut it wasn't just the on-field accomplishments that made Lewis respect the pair of Titans greats. It was their character off the field that made them special.\n\n\"If I told my son any man to be like, Eddie George and Steve McNair would be at the top of my list,\" Lewis said.\n\nThat's some high praise from one of the greats. Congratulations to George and McNair.\n\nMORE RAVENS NEWS:\n\nRay Lewis sends heartfelt message to Eddie George and the late Steve McNair originally appeared on NBC Sports Washington", "description": "Ravens legend Ray Lewis sends heartfelt message to Eddie George and Steve McNair after hearing about their jersey retirement ceremony.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/SZNMk7HBUhvLWjyV49EDnw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyNjA7aD03NTY-/https://s.yimg.com/uu/api/res/1.2/nV7vd3R6._JjVBWVdLCbWg--~B/aD0zNzg7dz02MzA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/csnwashington.com/9c455b2e46d05c629dfb2cbe88a22950", "published_at": "2019-09-12"}