{"pub": "breitbart", "url": "https://breitbart.com/middle-east/2019/10/18/u-n-condemns-egypt-crackdown-on-political-activists", "downloaded_at": "2019-10-18 11:18:13.762547+00:00", "title": "U.N. Condemns Egypt Crackdown on Political Activists", "language": "en", "text": "Geneva (AFP) — The UN on Friday condemned Egypt over the recent arrests of prominent activists and demanded that Cairo probe allegations that they were tortured by the security services while in custody.\n\nSeveral activists who played key roles in the 2011 revolution have been arrested in recent weeks, including blogger and journalist Esraa Abdel Fattah and Alaa Abdel Fattah (pictured), an iconic figure in Egypt.\n\nAlaa Adbel Fattah and his lawyer, Mohamed el-Baqer — who is also being held — have both been accused of belonging to and providing funding for a terrorist group, the United Nations human rights office said.\n\n“People have a right to protest peacefully, and a right to express their opinions, including on social media,” rights office spokeswoman Ravina Shamdasani told reporters in Geneva.\n\n“They should never be arrested, detained ? let alone charged with serious offences such as terrorism ? simply for exercising those rights,” she added.\n\nEsraa Abdel Fattah has been accused by Egyptian authorities of collaborating with a terrorist organisation and “spreading false news,” according to the UN rights office.\n\nAfter her October 12 arrest, she was “beaten because she refused to unlock her mobile phone” and was “then allegedly forced to stand facing a wall for seven hours,” Shamdasani said.\n\nAlaa Abdel Fattah, best known for founding the 6th of April youth movement that helped mobilise millions of Egyptians in the uprising that toppled autocrat Hosni Mubarak in 2011, has also reportedly suffered physical abuse since his September 29 arrest.\n\n“Allegedly, prison officers blindfolded Mr. Abdel Fattah, forced him to strip down to his underwear and walk down a prison corridor while being struck on his back and neck,” Shamdasani said.\n\nThe rights office urged Egypt “to promptly and effectively investigate any allegations of torture or ill-treatment in detention.”\n\nActivists say that the crackdown that began in late September is one of the worst since President Abdel Fattah al-Sisi took power in 2014.\n\nEgypt passed a restrictive anti-protest law in 2013 after Sisi led the military ouster of Islamist president Mohamed Morsi. A renewable state of emergency also remains in force.", "description": "The UN on Friday condemned Egypt over the arrests of prominent activists and demanded that Cairo probe allegations that...", "authors": ["Simon Kent"], "top_image": "https://media.breitbart.com/media/2019/10/Alaa-Abdel-Fattah-640x335.jpg", "published_at": "2019-10-18"}