{"pub": "businessinsider", "title": "How To Remotely Sign Out Of Your Gmail Account", "url": "https://lifehacker.com.au/2019/09/how-to-remotely-sign-out-of-your-gmail-account", "language": "en", "published_at": "2019-09-03", "downloaded_at": "2019-09-03 00:56:01.802657+00:00", "text": "Image: Getty\n\nGmail is great, in that you can check your messages from pretty much any web connected device. But what if that web-connected device happens to be your friend’s computer and you forget to log out after you’re done?\n\nGmail actually offers the ability to remotely sign out of devices through its app. It’s something I’ve personally used a few times when I’ve passed a tablet off to a friend to borrow, realising after they’ve left my house that my email was still connected to it.\n\nIs it the worst thing if my friend sees my inbox? Probably not. That said, sometimes there are notifications for things I’ve purchased (perhaps for that friend) or other notes I’d rather stay private than putting them in the face of my pal.\n\nIf you accidentally leave yourself signed in on a device, signing out remotely is super simple.\n\nFirst, sign into Gmail on a device you do have. Scroll to the bottom of the page and select “Details.” A pop up will then show you all the places you’re currently logged in. Click “Sign out of all other Gmail web sessions” to log yourself out on your friend’s computer.\n\nFor devices, you’ll need to go to myaccount.google.com and then “Sign-in & security” followed by Device activity & notification. Under the “Recently used devices” portion you’ll see all of the devices that are currently authorised to access your Gmail account. Tap the device you want to revoke access for and then select Remove to remotely sign it out.", "description": "Gmail is great, in that you can check your messages from pretty much any web connected device. But what if that web-connected device happens to be your friend’s computer and you forget to log out after you’re done?...", "authors": ["Chris Jager", "Sarah Basford"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/b6xfjbpmr9now5fi8gto.jpg"}