{"pub": "yahoo", "url": "https://finance.yahoo.com/news/jpmorgan-leads-goldman-citi-wall-145218654.html", "downloaded_at": "2019-10-16 06:48:09.264412+00:00", "title": "JPMorgan Leads Goldman, Citi in a Wall Street Comeback Quarter", "language": "en", "text": "(Bloomberg) -- Months of market turmoil are pushing JPMorgan Chase & Co. even further ahead of the Wall Street pack.\n\nThe firm led by Jamie Dimon, which has built up its dominance in recent years, widened its edge on a variety of fronts in the third quarter, sending its shares to an all-time high Tuesday. The bank posted its biggest increase in revenue from fixed-income trading in almost three years, maintaining a more-than $1 billion lead on competitors across markets. It also announced a surprise jump in fees from investment banking, scoring its biggest advantage over Goldman Sachs Group Inc. in more than a year in the high-stakes business.\n\n“JPMorgan stacks up very well relative to its competitors in the U.S, particularly in the capital-markets area,” Fred Cannon, an analyst at KBW, said on Bloomberg Television.\n\nAnalysts had predicted industry results that would match a particularly tough quarter for Wall Street’s main businesses -- wracked by volatility in fixed-income markets, global trade tensions that weighed on cross-border deals and investor jitters that tripped up some of the year’s most highly anticipated public stock offerings. But JPMorgan and Citigroup Inc. leaned on debt underwriting units for fees. And Goldman Sachs found relief in stock trading, where it surpassed expectations.\n\nTwo more giant firms -- Bank of America Corp. and Morgan Stanley -- report their results on Wednesday and Thursday.\n\nPowerhouse Status\n\nIn the meantime, JPMorgan’s shares are climbing, up 3.5% at 2:42 p.m. in New York, the biggest jump since April.\n\nThe New York-based bank has long been known as a fixed-income powerhouse on both the trading and underwriting fronts, which helped establish it as the top Wall Street company by revenue after the financial crisis. Its strength in fixed-income in the quarter was offset by a surprise 5% decline in equity-trading revenue, which the bank blamed on derivatives. Analysts had been expecting a 5% increase.\n\nIn recent years, JPMorgan has been investing in technology and sharpening its focus on trade execution, trying to unseat Morgan Stanley as Wall Street’s top stock-trading shop. And as the pool of trading revenue has shrunk across the industry, Dimon has poured his attention into investment banking. His bank has hired dealmakers in key geographic regions and industries. The goal is to rank No. 1 anywhere the bank doesn’t already claim the top spot while defending its position in debt capital markets.\n\nIn the third quarter, JPMorgan also generated the highest profit from its consumer unit in more than five years as mortgage fees climbed and loan charge-offs fell from the second quarter.\n\nHere are the main takeaways as four of the six biggest U.S. banks reported results:\n\nGoldman Sachs\n\nThe firm’s trading rebound was overshadowed by a bigger slide in banking fees than analysts had projected and a $267 million hit on public equity investments such as ride-hailing company Uber Technologies Inc., Avantor Inc. and Tradeweb Markets Inc. The firm’s shares rose 0.7%.\n\nCitigroup\n\nCiti’s efforts to rein in costs -- including cutting almost 400 trading jobs -- haven’t borne fruit yet, as expenses ticked up 1.5% to exceed analysts’ estimates. Still, Citigroup’s shares climbed 2.2% as its investment bankers posted a surprise increase in revenue, led by a 7% jump in debt underwriting.\n\nWells Fargo\n\nWells Fargo & Co. took another chunky legal charge as it addresses recent scandals before the arrival of new Chief Executive Officer Charlie Scharf next week. The $1.6 billion litigation expense dragged down earnings, along with a bigger-than-expected drop in net interest income as the lender felt the sting of Federal Reserve rate cuts. Revenue, at least, surpassed analysts’ estimates, and the lender attracted more deposits. Shares climbed 2.5%.\n\n--With assistance from Jenny Surane, Sridhar Natarajan and Hannah Levitt.\n\nTo contact the reporters on this story: Michelle F. Davis in New York at mdavis194@bloomberg.net;Gwen Everett in New York at geverett10@bloomberg.net\n\nTo contact the editors responsible for this story: Michael J. Moore at mmoore55@bloomberg.net, David Scheer, Dan Reichl\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Months of market turmoil are pushing JPMorgan Chase & Co. even further ahead of the Wall Street pack.The firm led by Jamie Dimon, which has built up its dominance in recent years, widened its edge on a variety of fronts in the third quarter, sending its shares to an all-time high Tuesday", "authors": ["Michelle F. Davis", "Gwen Everett"], "top_image": "https://s.yimg.com/uu/api/res/1.2/9d8__t5eKeEOtVxJTmae2Q--~B/aD03OTA7dz0xMjk2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/e27404537503a034a863125ed2be96e7", "published_at": "2019-10-15"}