{"pub": "metro", "url": "https://metro.co.uk/2019/10/05/mario-kart-tour-is-a-disgrace-that-nintendo-should-be-ashamed-of-readers-feature-10865382", "downloaded_at": "2019-10-05 05:46:49.331002+00:00", "title": "Mario Kart Tour is a disgrace that Nintendo should be ashamed of – Reader’s Feature", "language": "en", "text": "Mario Kart Tour – not what you might expect from Nintendo\n\nA reader is appalled by the microtransactions and missing features of Mario Kart Tour and accuses Nintendo of selling out.\n\nAt this point I suspect a lot of ordinary gamers just ignore when a new Nintendo mobile game comes out, even though they’d be hyped to the hills if it was a console game. After the so-so Super Mario Run it’s all been quickly downhill in terms how they play, with Fire Emblem requiring no skill or thought to play, Animal Crossing feeling very empty, and Dr. Mario World being turned into a bland Candy Crush clone.\n\nBut that’s almost beside the point. The problem with the Nintendo mobile games is the microtransactions and the manipulation of players, which to me goes against everything Nintendo stands for. Their console games hardly ever have DLC, let alone microtransactions, and they would certainly never have timers, subscriptions, and loot boxes the way these games do.\n\nAdvertisement\n\nAdvertisement\n\nAs many have pointed out, Nintendo started out doing things very different, as Super Mario Run has no microtransactions of any kind. You get the first world for free and then pay a one-off fee to unlock everything else. Whatever you think of the game that was a very fair way of doing things, but it wasn’t a success and so with Fire Emblem Heroes they went full loot box/microtransaction and it was, and still is, a massive hit.\n\nNow, some have seen this as a reason to absolve Nintendo of any blame and instead say that it’s people’s fault for buying the games and their microtransactions. You can see their point, Nintendo tried to do things fairly but they were rejected and only found success by using less fair methods. And here we are where Mario Kart Tour has become an instant hit and possibly the biggest of their games so far. Even though – and this is outrageous all on its own – it doesn’t have a multiplayer mode.\n\nWhen Nintendo started making mobile games they were at the lowest point in their whole history, with the Wii U being a flop and the Switch not yet announced. Mobile was supposed to save them and even when the Switch became a hit people were happy for them to continue and make some easy money that could then be funnelled back into proper games. But to me that is a betrayal of everything I come to expect from Nintendo.\n\nAdvertisement\n\nAdvertisement\n\nI’m not putting them on a pedestal, as some kind of angelic company that only does things for fans – their handling of the Joy-Con drift had been awful, as one obvious example against that – but when it comes to their games they’re usually packed with content and it’s clear that the number one goal is for them to entertain. They have to, because that’s Nintendo’s bread and butter. They’re not known for graphics or online or anything like that, they’re know for fun, innovative, and highly polished games.\n\nMario Kart Tour is none of that.\n\nThe handling’s awful, the game’s missing its most important feature, and there’s hardly any content. Worse, you’re constantly being scammed to spend more money, including a monthly subscription that doesn’t do much more than open 200cc mode. I mean think about it. That sounds like a joke, but it’s real. The fact of whether people are lapping it up is besides the point, Nintendo shouldn’t be encouraging it. They should be fighting against the cheapening of video games and be against turning them into simple games of chance.\n\nMario Kart Tour is everything I thought Nintendo stood against and yet now it’s a massive hit and I fear what that means for their future. Just as loot boxes were starting to go out of fashion suddenly the ones bringing them back are the one company that used to be most against them. Nintendo, hang your head in shame.\n\nAdvertisement\n\nBy reader Ashton Marley\n\nThe reader’s feature does not necessary represent the views of GameCentral or Metro.\n\nYou can submit your own 500 to 600-word reader feature at any time, which if used will be published in the next appropriate weekend slot. As always, email gamecentral@ukmetro.co.uk and follow us on Twitter.", "description": "A reader is appalled by the microtransactions and missing features of Mario Kart Tour and accuses Nintendo of selling out.", "authors": [], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/09/H2x1_SmartDevice_MarioKartTour_image1600w-f660_1570230734.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-05"}