{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7602025/SCRUMS-WORD-Wales-royal-seal-approval-visit-Prince-Charles.html", "downloaded_at": "2019-10-23 11:07:10.051083+00:00", "title": "SCRUM'S THE WORD: Wales to get royal seal of approval with visit of Prince Charles", "language": "en", "text": "Jaco Peyper has been given the elbow by World Rugby from refereeing the World Cup semi-finals.\n\nThe South African referee sent off Sebastien Vahaamahina on Sunday and hours later was photographed with Welsh fans appearing to mimic the France lock's elbow on Aaron Wainwright.\n\nPeyper has apologised for the photo but has not been chosen to officiate this weekend.\n\nJaco Peyper has been given the elbow by World Rugby from refereeing World Cup semi-finals\n\nWelshman Nigel Owens will referee England v New Zealand, with France's Jerome Garces in charge of Wales v South Africa.\n\nWales will get a royal seal of approval on Wednesday ahead of their semi-final, as Prince Charles is set to visit them before the South Africa match.\n\nThe Prince of Wales will attend their training session on Thursday morning and meet Warren Gatland's squad.\n\nHe is in Japan to celebrate the enthronement of the new Emperor — Naruhito — and will attend a banquet in Tokyo with other royals and dignitaries from across the globe.\n\nThe last time an enthronement ceremony took place was in 1990, when Emperor Akihito formally ascended the throne.\n\nPrince Charles is set to visit the Wales squad ahead of their clash with South Africa\n\nSociete Generale have been the most aggressive of the sponsors in demanding compensation for World Cup postponements caused by Typhoon Hagibis.\n\nThe French bank was particularly unhappy that England's pool game with France was called off because broadcasters TF1 were expecting record viewing figures of up to 10million, and they are pushing for a financial settlement. TF1 and ITV are also entitled to a rebate.\n\nJonathan Joseph is eyeing a trip to Disneyland Tokyo, according to his England team-mates.\n\nEngland are staying in one of the resort's official hotels this week, located on the doorstep of the amusement park. 'Jonathan Joseph is a massive fan,' Anthony Watson revealed.\n\n'He loves Frozen — listens to it in his car! He hasn't managed to go down there yet but I am sure he might on our day off.'\n\nJonathan Joseph is eyeing a trip to Disneyland Tokyo, according to his England team-mates\n\nScott Barrett, the All Blacks lock forward, is sharing a room with his brother Beauden for the first time since he was nine years old.\n\nThere are three Barrett brothers in the squad, who are staying at a luxury five-star hotel in Tokyo.\n\nScott said: 'This week I am rooming with Beaudie for the first time since 2002 when he was on the top bunk on the farm! There were two sets of bunks and four of us in there.'", "description": "WORLD CUP DIARY: Wales will get a royal seal of approval on Wednesday ahead of their semi-final, as Prince Charles is set to visit them before the South Africa match.", "authors": ["Nik Simon For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/20/20052140-0-image-a-6_1571773326940.jpg", "published_at": "2019-10-22"}