{"pub": "businessinsider", "url": "https://businessinsider.com/invest-time-vision-statement-business-owner-entrepreneur2019-10", "downloaded_at": "2019-10-17 11:35:07.517462+00:00", "title": "How a serial entrepreneur uses vision statements to build multi-million dollar businesses", "language": "en", "text": "Serial entrepreneur and business coach Jennifer Dawn has built 2 multi-million dollar businesses, and works with entrepreneurs to grow \"exceptional\" businesses.\n\nDawn spoke with award-winning business podcast host John Lee Dumas for a recent episode of his show Entrepreneurs On Fire about how entrepreneurs can better meet their goals.\n\nAs life gets busier for entrepreneurs, Dawn advises them to slow down and refocus their priorities with a one-page (or shorter) vision statement that describes the ultimate direction of their business.\n\nDawn keeps her statement on her bedside table so it is the first thing she reads in the morning, and says it helps her prioritize and plan her day.\n\nVisit BI Prime for more stories.\n\nJennifer Dawn is a serial entrepreneur who has built two multi-million dollar businesses, is a published author, and an accomplished speaker. In her current role as business coach and founder of the Best Planner Ever system, she has influenced the careers of thousands of business owners and professionals.\n\nShe has seen — and lived through — the frustration that entrepreneurs experience when their lives get increasingly busy without results that match the effort they put in. Before Best Planner Ever, which offers productivity tools and services, she founded a software company that reached $1 million in annual sales and later led the software division of a manufacturing firm to grow its sales from $300,000 to more than $2 million in 2 years.\n\nNow she spends much of her time coaching and consulting. Many of the high-achievers Dawn works with come to her after finding their businesses in a place that is far from where they had hoped to be when starting out. Most seem to share an instinct to gut it out and just push harder in hopes of a breakthrough.\n\nThat approach is counterproductive, she said in a recent conversation with John Lee Dumas, the host of the award-winning Entrepreneurs on Fire podcast. Instead, she says it is important to slow down and think strategically about your vision for your business and personal growth. And a well-crafted vision statement is a simple tool for doing just that.\n\nAn effective vision statement is a concise, specific description of the results or outcomes you are seeking for your business or life. Essentially it is your ultimate goal or definition of success. The most important thing is that it is yours — no one else can define it for you.\n\nDon't confuse your goals with your vision\n\nEntrepreneurs typically excel at setting goals, but those goals can gradually drift out of alignment with the core vision they have for their business or their lives.\n\nThe hustle to set new goals can lead to what she says is the number one mistake: \"Most entrepreneurs don't take the time to slow down and get clear on their vision.\"\n\nIt is important to take the time to slow down and think strategically about your vision, or the ultimate outcome you want for your life or business, and write it down as a statement that you review often as you go forward. Dawn says she keeps a copy of her statement on her nightstand so that it is the first thing she reads in the morning.\n\nA successfully crafted vision statement shouldn't be long — one page is okay, one-half or two-thirds is better — and is a living document, so don't just file it away. Use it to plan your daily or weekly agenda, and update it as you and your business grow and change.\n\nIn an email with Business Insider, Dawn shared how one client said the exercise was like avoiding an entire year's worth of trial and error as she figures out the next move in her career.\n\n\"She spent a week working through the Vision class I teach and walked away with absolute clarity on her new business model, next steps, and even revenues goals through the end of 2020,\" Dawn said. \"Now all she has to do is execute, but the clarity and focus on her new direction is there so she won't waste time spinning her wheels.\"\n\nUse the ABC's of productivity\n\nOnce you have identified your vision, Dawn recommends using the ABC's of productivity to rank the priority of your daily tasks to orient each day toward making that a reality.\n\nA's are essential steps toward your vision that you resist acting on because they are outside your comfort zone.\n\nB's are the other essential things that you accomplish more comfortably.\n\nC's can be moved to later on in your calendar.\n\nD's can be delegated to someone else.\n\nE's can be safely eliminated because they don't align with your primary goals.\n\n\"We can all find 10 minutes once a day to do one thing that's going to push those goals forward and get us closer to our vision statement,\" she said.\n\nGet worries out of your head and onto the page\n\nIf you're feeling overwhelmed or you don't know where to begin writing your statement, Dawn has a few exercises.\n\n\"Our brains are not storage devices. They're thinking devices,\" she said.\n\nShe recommends making an unfiltered list of all the things you are worried or bothered by, and then ranking them using her ABC's. But it's important to remember: \"Everything is not an A,\" she says.\n\nSimilarly, making a list of everything you complain about and rewriting each line as a proactive phrase can form the basis for your vision statement by reframing present challenges as opportunities for future growth.\n\nThe exercises may sound simple, but they take practice\n\nWriting your vision statement may sound easy, but it will probably take several attempts to get right.\n\nStill, Dawn says the investment of time and attention in refining your vision statement is worth the effort:\"If you take the time to learn how to do it the right way, it will serve you for a lifetime.\"", "description": "The creator of the \"Best Planner Ever\" says crafting and refining a vision statement is essential to keeping your business aligned to your goals.", "authors": ["Dominick Reuter"], "top_image": "https://image.businessinsider.com/5da721944af9091e6250a333?width=1200&format=jpeg", "published_at": "2019-10-17"}