{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/i-just-want-to-cuddle-every-damn-animal-in-this-zoo", "downloaded_at": "2019-10-01 04:31:06.204769+00:00", "title": "I Just Want To Cuddle Every Damn Animal In This Zoo", "language": "en", "text": "Planet Zoo, a new PC game from Frontier, the makers of Planet Coaster, is currently in a beta available to players that pre-ordered the deluxe version of the game. It’s about running a zoo. In order to do that, you have to build enclosures, outfit habitats with the proper flora for the species — species from the African grasslands don’t want tropical plants in their habitats, for example — and make sure that each animal in your park is properly stimulated with toys and enrichment items. It’s all done incredibly well.\n\nI have small exhibits of warthogs, ostriches, peafowl and African wild dogs, and I’m trying to keep them happy and entertained. It’s harder than it looks. The peafowl and peahens that I bought for my first habitat weren’t quite happy until I got them a slow feeder, which kept them from getting bored, thus boring my guests. But even bored, the animals are cute.\n\nI spend long stretches of time trying to find the optimal angle to take pictures of them. There is clearly so much love and care taken to portray these animals and their behaviours. When I add a small pond to the warthog enclosure, they immediately begin to swim in and through it, to drink from it. When the sun sets in my Zoo, the amber light glistens on their skin. I am devoted to keeping these warthogs happy, by hook or by crook.\n\nIn Planet Zoo’s complex system of resource management, there’s always something to check on. To be able to buy toys and enrichment items for certain animals, you have to assign a veterinarian to study them. While that’s ongoing, you can add services for your park’s guests, though you have to meticulously create staff-only paths throughout the zoo because guests hate seeing behind the scenes.\n\nWhile you’re building, you might as well check on the integrity of your habitats’ walls, as they degrade over time. You don’t want one of your african wild dogs to escape, as one of mine had. My keepers caught it quickly, but the alert I got about a dangerous animal escaping gave me a fright.\n\nOn top of all that, every few months an inspector will come around, and part of the criteria on which your park is judged is education value. If you don’t have signs and audio recordings throughout the park to help teach your guests about the animals, you’ll have a hard time scoring points with your inspector. Education value helps keep your park open, and brings in new guests. New guests means more money, which you can use to keep sprucing up your park.\n\nI haven’t quite gotten a handle on all the ins and outs of running a zoo properly, mostly because I just want to adopt more animals. Watching my African wild dogs play with each other or lazily doze in the afternoon sun makes me yearn to be able to reach out and touch them. In particular, furry animals feel incredibly tactile, each one of them pettable, huggable, touchable. It makes me wish I had my own dog that I could hug to my chest as I play.\n\nIt comes as no surprise that Planet Zoo is my shit. I love simulation games with my entire heart. The obvious care taken to portray these animals accurately set this game apart. Like the tiny, digital visitors in my park, I just keep watching these animals with a sense of wonder.", "description": "Planet Zoo, a new PC game from Frontier, the makers of Planet Coaster, is currently in a beta available to players that pre-ordered the deluxe version of the game. It’s about running a zoo. In order to do that, you have to build enclosures, outfit habitats with the proper flora for the species — species from the...", "authors": ["Luke Plunkett", "Alex Walker"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/ercxfkzatlpzfnsoyoh2.jpg", "published_at": "2019-10-01"}