{"pub": "businessinsider", "url": "https://markets.businessinsider.com/news/stocks/goldman-sachs-sees-4-billion-flow-to-singapore-on-hong-kong-protests-2019-10-1028573359", "downloaded_at": "2019-10-03 10:54:07.552318+00:00", "published_at": "2019-10-03", "title": "Goldman Sachs says $4 billion flowed out of Hong Kong to Singapore because of the protests", "language": "en", "text": "REUTERS/Bobby Yip\n\nProtests in Hong Kong have raged on for months. Investors in the city are getting spooked and are taking their money to Singapore.\n\nGoldman Sachs analysed Hong Kong's banking system and found that $3 to $4 billion has moved out of the city to Singapore in the last three months.\n\nThey also found that local currency deposits fell in August by 1.6%, which was the biggest drop of 2019.\n\nView Markets Insider's homepage for more stories.\n\nAfter months of protest and unrest in Hong Kong, it looks like investors are now fleeing the city and taking their money to another Asian finance centre — Singapore.\n\nThat's according to two Goldman Sachs analysts Gurpreet Singh Sahi and Yingqiang Guo, who in a note released earlier this week, found that up to $4 billion has left Hong Kong due to the riots. In the note, the analysts converted all Hong Kong currency, which is pegged to US currency, into US dollars.\n\n\"We found modest net outflow from Hong Kong dollar deposits in Hong Kong and modest net inflow of FX deposits in Singapore,\" said Sahi and Guo.\n\nThat outflow, the two analysts estimated, came to about $3 to $4 billion in the last three months. Sahi and Guo also found that local currency deposits fell in August by 1.6%, which was the biggest drop of 2019, highlighting the effect of the protests on financial markets.\n\nThe analysts added this trend should continue as the protest rage on: \"The debate on HK outflow/liquidity will remain active and the data points for September (and beyond) critical in shaping the same.\"\n\nThe protests in Hong Kong have caused mass fluctuations in the market, with the Hong Kong Stock Exchange falling 17.9% since July.\n\nLikewise, Bloomberg reported, citing the Monetary Authority of Singapore, that foreign currency deposits in Singapore at international and domestic banks had risen $9.3 billion as of August. A good bulk of that was in July and August, where there was a 64% increase.\n\nHowever, the two analysts did add that this figure was still small \"compared to the HK$/US$ deposits balance in HK,\" which is roughly $878 billion/$653 billion.", "description": "Protests in Hong Kong have raged on for months. Investors in the city are getting spooked and are taking their money to Singapore.  Goldman Sachs ana...", "authors": ["Finanzen.Net Gmbh"], "top_image": "https://images.markets.businessinsider.com/image/5d95b02071cffc19f868f411-2400/rtr1seon.jpg"}