{"pub": "fox", "url": "https://foxnews.com/us/california-police-officer-killed-active-shooter", "downloaded_at": "2019-10-23 16:00:27.361310+00:00", "title": "California sheriff’s deputy shot dead, ride-along injured in 'active shooter incident,' officials say", "language": "en", "text": "A police officer was killed and a person with the officer on a ride-along was injured after an \"active shooter\" incident in Northern California early Wednesday, officials said.\n\nTwo men were in custody in connection with the incident, but the scene was still \"active\" later Wednesday morning, with a helicopter and large contingent of law enforcement in the area, officials said.\n\nThe El Dorado County Sheriff's Office identified the deceased as Sheriff’s Deputy Brian Ishmael and said on Facebook the incident occurred in the area of Ridge Road and Mount Aukum Road in the unincorporated community of Somerset, located about 60 miles east of Sacramento.\n\n\"It is with an extremely heavy heart that we announce that we lost a deputy in the line of duty this morning,\" the department said.\n\nOFFICERS KILLED IN THE LINE OF DUTY IN 2019\n\nThe deputy was responding to an unspecified call for service when he and the other person with him were shot at by an unknown number of people, according to police.\n\n\"Their condition is unknown at this time,\" police said of the injured person. Officials did not identify the other person, but a ride-along typically involves someone who is not law enforcement.\n\nCLICK HERE FOR COMPLETE COVERAGE OF 'BLUE LIVES LOST'\n\nA police officer could be seen in a video from FOX40 standing with his weapon drawn along a roadway near where the shooting took place. The incident remains under investigation by police.\n\n\"We ask that you please remain out of this area,\" authorities said. \"Residents, we ask that you remain vigilant and call 911 for any suspicious activity.\"\n\nCLICK HERE FOR THE FOX NEWS APP\n\nIshmael is described as a four-year veteran with the El Dorado County Sheriff’s office who previously worked for the Placerville Police Department.\n\n\"Our thoughts and prayers are with his family and friends,\" police said.\n\nA video posted by the department to Facebook showed the procession for the deputy on an area roadway.\n\nWorking in law enforcement is one of the most dangerous jobs in America. As of mid-September, 81 officers had died in the line of duty this year, with causes running the gamut from vehicular accidents and medical emergencies to homicides, according to data from the Officer Down Memorial Page.\n\nFox News' Greg Norman contributed to this report.", "description": "A police officer was killed and a person with the officer on a ride-along was injured after an \"active shooter\" incident in Northern California early Wednesday, officials said.", "authors": ["Travis Fedschun", "Travis Fedschun Is A Reporter For Foxnews.Com. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/CalifCopShot1.jpg", "published_at": "2019-10-23"}