{"pub": "yahoo", "url": "https://news.yahoo.com/chasten-buttigieg-goes-opening-act-105720891.html", "downloaded_at": "2019-09-23 04:27:57.547401+00:00", "title": "Chasten Buttigieg goes from opening act to fundraising star", "language": "en", "text": "Chasten Buttigieg has gone viral on social media and supported his husband on the presidential campaign trail. Now, he’s playing a new role for Pete Buttigieg’s 2020 bid: rainmaker.\n\nChasten is slated to be the sole headline draw for several Pete for America fundraisers over the next month, starting with an event in Chicago this week. In October, Chasten will swing through New York City for another fundraiser, followed by a trip overseas to raise money from Americans living in London on Oct. 22, according to event invitations obtained by POLITICO.\n\nChasten has also struck out on his own for other events, like a ribbon-cutting for a dozen new field offices in New Hampshire earlier this month, while Pete did the same for 20 offices in Iowa. The split-screen events show Chasten — a 30-year-old teacher who was nearly anonymous at the beginning of 2019 — cutting a campaign profile more akin to well-known former second lady Jill Biden than most 2020 spouses. And that prominence could be a force multiplier for the Buttigieg campaign through the fall, keeping the fundraising spigot open while Pete stumps in all-important Iowa and New Hampshire.\n\n\"Chasten is as big of a draw for people who want to connect with the campaign as Pete, and that’s at all levels, not just high-dollar fundraisers,” said John Atkinson, a Buttigieg donor based in Chicago. And, he added, “to the extent that Chasten frees up bandwidth for the candidate, that is a competitive advantage.\"\n\nSpouses can “speak for the candidate in a way no other surrogate can,” said Julianna Smoot, who led Barack Obama’s finance team in 2008, when Michelle Obama became a national draw.\n\nIt’s no different in 2020. Jill Biden has been aggressively deployed as a surrogate for her husband, former Vice President Joe Biden, both in public campaign events and private fundraisers, while Doug Emhoff, Sen. Kamala Harris’ husband, has also headlined his own fundraisers. Jane Sanders has played a critical strategic role in her husband’s political career, especially Sen. Bernie Sanders’ presidential runs. And Bruce Mann, Sen. Elizabeth Warren’s husband, occasionally lingers with reporters as he waits for his wife to navigate the often hourslong selfie line at the end of her campaign events.\n\nBut Buttigieg’s campaign is leaning on Chasten to a notable extent, playing off his rise to social media stardom by ramping up his public schedule since this summer. That has freed Pete to spend less time courting donors — which he’s done successfully, leading the Democratic field with nearly $25 million raised last quarter — and more time talking with voters in the early nominating states, where the campaign is putting a heavy emphasis on building its infrastructure.\n\n“He’s something of a secret weapon for this campaign,” Pete Buttigieg told POLITICO. “One of the things you need to do on a campaign, especially when you’re new on the scene, is introduce yourself and convey your values to as many people as possible. Chasten, through his own story and his own approach and his focus on making sure that people have a sense of belonging, really embodies a lot of the values of this campaign.”\n\nChasten’s spousal status stands out in its history-making context: He appeared on Time magazine’s cover with an arm around Pete and under the headline “First Family.”\n\n\"Chasten is introducing America to what a same-sex couple looks like,” said Stephanie Cutter, a Democratic consultant, who served as Barack Obama’s deputy campaign manager and Michelle Obama’s chief of staff. “In that, he does a remarkable job of humanizing Pete, a candidate who is already very relatable.”\n\nButtigieg donor invitations obtained by POLITICO show Chasten’s events cater to a mix of high- and low-dollar attendees. Tickets for the Sept. 24 event in Chicago range from $25 for “young professionals” up to $500 to be a co-host and guarantee a photo. In New York, “Cocktails and Conversation” at a Manhattan residence will cost donors $500 to $1,000. Chasten has already held Florida fundraisers in Miami, Tampa and St. Petersburg earlier this year.\n\nPete raises an average of about $100,000 per event, while Chasten is expected to bring in about a third of that, according to a person familiar with the fundraising totals.\n\nThough Chasten appears frequently in private settings for the campaign, he has kept a low profile with the media. In May, The Washington Post reported on Chasten’s upbringing, including his stint as a homeless community college student in Michigan, and he sat for a rare interview on \"CBS This Morning” alongside his husband — and their dogs.", "description": "Pete Buttigieg’s husband is now headlining fundraisers solo, helping power the mayor’s 2020 campaign as he focuses on Iowa and New Hampshire.", "authors": ["Elena Schneider"], "top_image": "https://s.yimg.com/uu/api/res/1.2/lSxCIBoq91APfrxbwI0uGQ--~B/aD03NzM7dz0xMTYwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/politico_453/e4cd03dac2c92c6eaaec1eeed181ace7", "published_at": "2019-09-22"}