{"pub": "news.com.au", "url": "https://news.com.au/sport/tennis/tennis-2019-wta-tour-ashleigh-barty-loses-in-straight-sets-to-aryna-sabalenka/news-story/47993d9b82b2a73add51694bd73f2c88", "downloaded_at": "2019-10-05 10:32:54.033835+00:00", "title": "Tennis 2019: WTA Tour, Ashleigh Barty loses in straight sets to Aryna Sabalenka", "language": "en", "text": "World No.1 Ashleigh Barty has lost in straight sets to Aryna Sabalenka in the semi-finals of Wuhan Open in China.\n\nThe Australian top seed, chasing her fourth trophy of 2019, lost 7-5 6-4 on Friday to the Ukrainian defending champion and No.9 seed.\n\nStream live coverage of the WTA and ATP Tours with ESPN and beIN SPORTS on KAYO. Get your 14-day free trial and start streaming instantly >\n\nBarty was broken twice in the opening set. She clawed back one service break but, despite saving a number of set points, lost the opener.\n\nSabalenka maintained her perfect winning record in Wuhan in reaching her second-consecutive final at the event.\n\nThe 21-year-old is one win away from joining Petra Kvitova as the only two-time champion at the Wuhan Open.\n\nIn a rematch of their semi-final at the same tournament last year, Sabalenka scraped through a tight battle with Roland Garros champion Barty in one hour and 43 minutes.\n\n“I’m so excited to be in the final, especially here. It was an amazing match, it was great level, I’m just happy right now,” said a beaming Sabalenka, who has improved to an impressive 28-6 win-loss mark in China, including 11-straight victories in Wuhan.\n\nSabalenka opened the match with a service break but a line-licking forehand winner from Barty allowed the Australian to draw level at 3-3. It looked like the top seed had stolen the momentum. She became more aggressive on return but Sabalenka broke again for a 6-5 lead.\n\nThe Ukrainian had to save two break points before finally converting on her third opportunity to wrap up the first set in 56 minutes.\n\nThe first five games of the second set went with serve before Barty requested the trainer to get treatment on her lower calf.\n\nSabalenka clinched the crucial break in the ninth game to go ahead 5-4 and secured victory with a stunning backhand winner.\n\nShe will face fifth-seeded Kvitova or American Alison Riske in the final.", "description": "World No.1 Ashleigh Barty has lost in straight sets to Aryna Sabalenka in the semi-finals of Wuhan Open in China.", "authors": [], "top_image": "https://cdn.newsapi.com.au/image/v1/a807fbcd7641a6dba7467ebc7af7577f?width=650", "published_at": "2019-09-27"}