{"pub": "breitbart", "url": "https://breitbart.com/news/the-streaming-wars-first-victim-your-wallet", "downloaded_at": "2019-10-29 02:22:48.476317+00:00", "title": "The streaming war’s first victim: your wallet", "language": "en", "text": "Los Angeles (AFP) – With two young daughters, Mery Montenegro is preparing to add Disney+ to her list of streaming subscriptions, which already includes Netflix, Hulu and Amazon — and, when combined with her cable TV bill, costs her almost $1,500 per year.\n\nHer eldest Victoria, 6, asks every day when the new platform will launch, with its impressive catalogue of films and series from all of Disney’s studios.\n\nThe answer is November 12: Mery, who works at an advertising agency in Washington, knows the date well. It’s the day she’ll start paying $6.99 more per month.\n\nDisney+, HBO Max (AT&T), Peacock (Comcast), Apple TV+ and the new short video platform Quibi are all players in a streaming war that will only grow worse at a time when more Americans prefer streaming to cable.\n\n“It’s going to have a huge impact on people’s budgets,” said Tom Nunan, an Oscar-winning film producer and professor at the University of California, Los Angeles (UCLA) School of Theater, Film and Television.\n\n“I don’t think that there is enough room for subscription relationships with all of these streamers for a typical American.”\n\nIn a Deloitte survey published in March, 69 percent of respondents said they had at least one streaming subscription, while 65 percent said they had cable.\n\nAnd while many households have cut the cord to go cable-free with the advent of streaming, 43 percent of those surveyed were paying for both.\n\nMery, 36, is in the third group, and not by choice.\n\nIn her neighborhood of Alexandria, west of the US capital, she says she found no internet-only option cheaper than her current plan, so she pays $90 per month for a cable subscription she “hardly” uses, other than for news or the occasional baseball game.\n\nTo that, she adds $5.99 each month for Hulu — the service’s cheapest plan, with commercials — and $16 for Netflix, which she considers essential.\n\n“I use it on the subway when I go to work, to cook, to watch something at home,” she explained.\n\nMery also pays $12.99 per month for e-commerce giant Amazon’s Prime membership, which includes its streaming service. Prime is also useful for renting movies, which Mery prefers over the cinema, curling up with a glass of wine after the girls have gone to bed.\n\nThat’s $124.98 per month, soon plus $6.99 for Disney+. Total: $131.97 per month, or $1,583.64 per year.\n\n– The irony of cable –\n\nThat’s where Mery draws the line, since she doesn’t want to spend her whole paycheck on subscriptions. But the streaming options are limitless.\n\nFrom YouTube, which has a Premium version for $11.99 per month, to platforms for Broadway lovers or wrestling fans, to all professional sports leagues, which offer different packages for fans.\n\nThe Los Angeles Times previously listed 40 streaming options, which would cost a total of $353.43 per month, but the Deloitte survey mentioned up to 300 different streaming services.\n\nAlmost half of people surveyed (47 percent) said they were “frustrated by the growing number of subscriptions and services,” which make it “harder to find the content they want,” the study said.\n\n“Back at the beginning, it wasn’t a hard decision… to sign up for Netflix or Amazon. It was just two streamers,” said Nunan.\n\n“But am I really going to sign up for six streamers or seven? As the normal consumer, I doubt it,” he said.\n\nGene Del Vecchio, a marketing professor at the University of Southern California (USC) who specializes in entertainment, estimated that users will end up with the same complaint that currently causes them to drop cable: they spend a lot of money for a lot of programs they don’t watch.\n\n“I think what may happen is that they will look for one a la carte menu,” he said.\n\n“They will start to say, I just want these individual shows, and I don’t want to pay for all of this other programming that I never watch.”\n\nAmazon already allows people to buy episodes or seasons, without subscribing to Prime Video.\n\nDel Vecchio also thinks subscription rates will increase over the next decade to finance original shows, and that streamers will seek to end the current strategy where several friends or family members share one account, in an effort to gain new paying users.\n\nAnother strategy, similar to cable plans, will be to offer discounted annual contracts. Disney+ is already doing this, as is Amazon.\n\n“Here’ the ironic thing: five, 10 years from now, it’s going to look like the cable industry all over again,” predicted Del Vecchio.", "description": "Los Angeles (AFP) – With two young daughters, Mery Montenegro is preparing to add Disney+ to her list of streaming subscriptions, which already", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/28/32a68c_launch-platform-disney-is-one-major-new-players-in-streaming-war-is-set-intensify-640x335.jpg", "published_at": "2019-10-28"}