{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7577433/Anderlecht-fined-handing-Vincent-Kompany-managerial-duties-without-correct-coaching-licence.html", "downloaded_at": "2019-10-15 23:53:07.464216+00:00", "title": "Anderlecht fined for handing Vincent Kompany managerial duties without correct coaching licence", "language": "en", "text": "Belgian giants Anderlecht were fined the maximum €5,000 (£4,320) on Tuesday for allowing Vincent Kompany to coach their team without the required diploma, the Belgian football association confirmed.\n\n'The club violated the regulations for a long time and despite that it being against the rules did not hesitate to publicly unveil a coach without a diploma,' the association's licensing committee said in a statement.\n\nBelgium requires the head coach at all its top-flight clubs to hold a UEFA Pro licence, which Kompany does not have.\n\nAnderlecht have been fined for appointing Vincent Kompany without correct qualifications\n\nHe was appointed player-coach in May in a bid to revive the ailing fortunes of the country's most successful team.\n\nAnderlecht argued that Simon Davies, the former Manchester City academy chief who followed Kompany to Brussels, was actually the head coach but the commission used the club's own media statements and video clips of the unveiling of Kompany to refute this.\n\nAnderlecht were also given a strong reprimand for insufficient respect for compliance with the regulations.\n\nThe former Manchester City defender has led his side just two wins from 10 league games\n\nAnderlecht have won only two of 10 league games under Kompany, who has also played but was then injured. They are in 13th place in the 16-team league.\n\nAnderlecht have since named Frank Vercauteren, who has the necessary diploma, as head coach, saying he was replacing Davies, who stays on as an assistant coach.\n\nBut it has not cleared up who is actually in charge at the club.\n\nAnderlecht said Vercauteren would be in charge on matchdays, suggesting that former Manchester City captain Kompany was still in overall command.", "description": "Belgian giants Anderlecht were fined the maximum €5,000  (£4,320) on Tuesday for allowing Vincent Kompany to coach their team without the required diploma", "authors": ["Mark Gleeson"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/23/19762002-0-image-a-75_1571177894188.jpg", "published_at": "2019-10-15"}