{"pub": "reuters", "url": "https://af.reuters.com/article/topNews/idAFKBN1WA1MN-OZATP", "downloaded_at": "2019-09-25 23:37:49.038296+00:00", "title": "Liberian hospital patients turned away as medical strike bites", "language": "en", "text": "MONROVIA (Reuters) - A medical workers’ strike in Liberia has paralysed the country’s already faltering health care system, leaving its biggest hospitals in disarray and thousands of patients without care.\n\nGovernment doctors, nurses and other staff are protesting against low wages, delayed payments and poor working conditions that include shortages of crucial equipment and regular electricity blackouts.\n\nLiberia, one of the world’s poorest countries where most people live without reliable access to electricity and clean water, suffered from a 2013-16 Ebola outbreak that killed more than 4,800 people, including more than 150 healthcare workers.\n\n“We are sitting and our children are sick, and they told us not to enter the gate,” said Gifty Harris, a young mother sitting against a wall with her baby on her lap outside the John F. Kennedy Medical Center, the largest hospital in the capital Monrovia.\n\n“I’m here for treatment, but the government do not want to pay the workers.”\n\nThe white halls of the hospital were empty and a heavy padlock on its gate kept patients waiting outside, sitting in the street in hope of treatment.\n\nUnion officials said they had been negotiating with the government for three months before launching the strike. They plan to strike until the government adheres to their demands, they said.\n\n“If we are going to go back, we will at least need to have supplies,” said George Poe Williams, secretary general of Liberia’s health workers’ union who estimates that 6,000 health workers are on strike.\n\n“Are we supposed to return to hospitals where there are no lights and we will have to use our cell phone lights to work?”\n\nRepresentatives of Liberia’s health ministry declined to comment.\n\nDuring a press conference on Monday, Liberia’s finance minister Samuel Tweah said that the government was doing “everything possible” to clear salary payments that have been backlogged since August, and that health workers should return to their posts while the government negotiates with union leadership.\n\nPatients in critical condition who occupied beds before the strike began have been allowed to remain in the public hospitals, but all others have been either discharged prematurely or turned away upon arrival.\n\n“If anything happens to us right now, the government will be responsible,” said Ruth Flomo, a pregnant 19-year-old who was turned away from the Du Port Road Health Center, another padlocked hospital.\n\n“The nurses are not helping because they are not getting paid. Their children are not going to school. They have to pay them.”", "description": "A medical workers' strike in Liberia has paralysed the country's already faltering health care system, leaving its biggest hospitals in disarray and thousands of patients without care.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-09-25"}