{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/12/story-lines-aplenty-as-browns-jets-square-off-mond", "downloaded_at": "2019-09-13 01:06:38.295848+00:00", "title": "Story lines aplenty as Browns-Jets square off Monday night", "language": "en", "text": "EAST RUTHERFORD, N.J. (AP) - Well, this isn’t quite how the Cleveland Browns and New York Jets expected to start the season.\n\nBoth are coming off opening losses and look to avoid going 0-2 with a Monday night matchup loaded with juicy story lines, surprising twists and a slight hint of desperation.\n\nAnd, it’s only Week 2.\n\n“I think every game is a must-win game,” Jets running back Le’Veon Bell said, “but obviously this game holds a lot of weight to it.”\n\nThe Browns didn’t live up to the preseason hype that had some making them potential Super Bowl contenders.\n\nInstead, Cleveland committed 18 penalties - the most by the team since 1951 - in a 43-13 loss to Tennessee that put early pressure on first-year coach Freddie Kitchens.\n\n“I feel a lot of confidence with this team that we’re going to get all the haters and naysayers out of here,” cornerback Denzel Ward said, “so I hope everybody’s all gone now and we’re just focused on us.”\n\nWell, most of the Browns, that is.\n\nWide receiver Odell Beckham Jr. returns to MetLife Stadium for the first time since being traded by the Giants in March. But that’s not even the biggest headline.\n\nNeither is all the attention on his expensive watch.\n\nBeckham spiced things up Thursday when he called out former Browns defensive coordinator Gregg Williams - now in the same role with the Jets - and said the coach instructed players to hurt him in a preseason game in 2017. He sustained a severe ankle injury when Cleveland’s Briean Boddy-Calhoun cut his legs out, something he says “changed my life forever” because he says it led to other injuries.\n\n“Just got to watch out for the cheap shots and the dirty hits and all the things that he likes to teach,” Beckham said.\n\nWilliams, of course, is facing the Browns for the first time since leading them to a 5-3 record after taking over when Hue Jackson was fired - and then losing out to Kitchens for the vacancy.\n\n“Obviously, he has a chip on his shoulder about this game,” Jets safety Jamal Adams said. “We’re going to go out there and play for him. He’s going to be all riled up.”\n\nAdam Gase was plenty fired up this week himself after the Jets blew a 16-0 third-quarter lead last Sunday in his debut for New York and lost 17-16 to Buffalo.\n\nWILD WEEK FOR JETS\n\nKicker Kaare Vedvik was waived after he missed an extra point and a 45-yard field goal, and Sam Ficken was signed to replace him.\n\nSecond-year defensive lineman Nathan Shepherd was suspended six games for two violations of the NFL’s policy on performance enhancers.\n\nThey swung a rare trade with New England, acquiring wide receiver Demaryius Thomas for a 2021 sixth-round draft pick.\n\nWide receiver Quincy Enunwa was lost for the season with his second neck injury in just over two years.\n\nAnd, then, the capper of ‘em all: Quarterback Sam Darnold was diagnosed with mononucleosis, likely sidelining him for several games. That means it’ll be Trevor Siemian starting against Baker Mayfield, who appears OK after needing X-rays on his hand Sunday, and the Browns on Monday night.\n\n“I guess maybe I’m messed up,” Gase said, trying to put a positive spin on it all. “I’m like, ‘Great, let’s go. Trevor is up, let’s go find a way to win the game.’”\n\nNEW YORK STATE OF MIND\n\nBeckham dismissed any extra motivation in going back to his old, New Jersey stomping grounds.\n\n“It is just another game,” he said. “It really is. ‘Monday Night Football’ in the lights. Just trying to get wins.”\n\nBut Beckham is an entertainer and loves the big stage, so he’ll undoubtedly try to put on a performance with the rest of the league watching.\n\nAnd speaking of watching, Beckham said he’ll sport the Richard Mille-designed watch: “if I want to wear it, I’ll wear it.” The league told the Browns that Beckham is violating their policy on “hard objects.”\n\nBAKER & THE JETS\n\nMayfield has fond memories of the Jets. He made his NFL debut against them last season, coming off the bench in Week 3 and leading the Browns to a 21-17 win to end Cleveland’s 19-game winless streak.\n\nFollowing the game, fans streamed from FirstEnergy Stadium singing, “Bak-er, May-field,” feeling the Browns had finally found their franchise quarterback. Mayfield took off from there, setting the league rookie record with 27 touchdown passes while leading Cleveland to a 7-8-1 record.\n\nBELL TOLLS\n\nBell had a solid return in his first game action in nearly 20 months. He rushed for 60 yards on 17 carries and caught six passes for 32 yards and a TD in his Jets debut. He also caught a pass for a 2-point conversion.\n\nThe star running back sat out practice Wednesday and had an MRI on a shoulder, but it came up clear and he should play against the Browns.\n\nHEARTBROKEN BROWNS\n\nIt was an emotional week for the Browns following the tragic death of defensive end Chris Smith’s girlfriend.\n\nPetara Cordero, who gave birth to the couple’s daughter last month, was struck by a car as she stood on a highway roadside Wednesday. She was a passenger in Smith’s Lamborghini, which blew a tire and spun out. The 26-year-old Cordero had exited the car when another car, driven by a 47-year-old woman who admitted to police she had been drinking, smashed into her.\n\n“It’s a tough situation,” guard Joel Bitonio said. “You forget about things when you’re in this building, sometimes the outside world you forget. We love this game and this game does a lot for us, but football comes second to a lot of things sometimes. We’re trying to pick Chris up and his family, his little baby and all those things. We’re thinking about him every chance we get.”\n\n___\n\nAP Sports Writer Tom Withers contributed.\n\n___\n\nMore AP NFL: https://apnews.com/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Well, this isn't quite how the Cleveland Browns and New York Jets expected to start the season.", "authors": ["The Washington Times Http", "Dennis Waszak Jr."], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/08/bills_jets_football_46282_c0-194-4631-2894_s1770x1032.jpg?d83da9526e94199626f17fb8a0f056784e19b050", "published_at": "2019-09-12"}