{"pub": "metro", "url": "https://metro.co.uk/2019/10/17/nadiya-hussain-confesses-frightening-opening-sexual-abuse-relative-10936953", "downloaded_at": "2019-10-18 01:13:15.243972+00:00", "title": "Nadiya Hussain: 'It was frightening opening up about sexual assault'", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nThe Great British Bake Off winner Nadiya Hussain says it was ‘frightening’ telling the world about the sexual abuse she suffered at the hands of a relative.\n\nSpeaking to the Daily Mail for the release of her memoir Finding My Voice (out today) earlier this month, she said the horrific experience ‘would have played a role in my panic disorder’.\n\nThe baker reflected on revealing what happened on Thursday’s Lorraine and said she wanted to help other readers who might be struggling.\n\nAdvertisement\n\nAdvertisement\n\nShe said: ‘It’s frightening. I’m not gonna lie there were moments where you read these headlines and what I wanted to do was take the book back and hide in a cave.’\n\nNadiya said her novel was for ’14-year-old me’ and also dedicated it to people ‘who are finding their voice and who feel like they are not represented.’\n\nThe 34-year-old went on: ‘I look at this platform that I’ve been given. I love cooking, I love baking, I love writing my cook books but this gives me the opportunity to say we all have a voice. Whether it’s at the tip of our tongue or stuck somewhere in here, we have an opportunity to say something.\n\n‘I feel like if I didn’t write this book and I didn’t write these stories, I’d be part of a bigger problem not a solution and I think it’s very important to speak.’\n\nNadiya hopes her book Finding My Voice will help others going through a tough time (Picture: ITV/REX)\n\nNadiya also had to endure bullying at school, and at one point she considered taking her own life as a ‘bus ticket’ away from misery.\n\nThe star attempted to overdose on tablets but was interrupted by the news that her mother was pregnant with her brother. She then decided to live on for her brother.\n\nAdvertisement\n\nAdvertisement\n\nNadiya had kept what happened to her to herself, admitting she only recently told her sister.\n\n‘I’ve only told my sisters recently and, growing up, I had a close friend at school who I told. It turned out a very similar thing had happened to her.\n\n‘It’s important to talk about it because it probably happens much more than we care to talk about.’\n\nLorraine airs weekdays from 8.30am on ITV.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Kris Jenner was ‘fearful of ugly family feud’ after Kim and Kourtney Kardashian’s explosive row\n\nMORE: Christine McGuinness clearly doesn’t feel the cold as she rocks vest and mini-skirt in October", "description": "Great British Bake Off star Nadiya Hussain: 'It was frightening opening up about sexual assault'", "authors": ["Sarah Deen"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_90271233-e1571324255655_1571324698.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-17"}