{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/reuters/article-7586955/Yuan-trades-flat-takes-weak-China-GDP-stride.html", "downloaded_at": "2019-10-18 04:50:14.449314+00:00", "title": "Yuan trades flat, takes weak China GDP in stride", "language": "en", "text": "SHANGHAI, Oct 18 (Reuters) - The yuan was barely changed against the dollar on Friday, even as data showed China's economic growth slipped to its weakest in nearly three decades, with traders saying the outcome was not a surprise. The Chinese currency, which surged earlier this week to a two-month high on optimism over progress in Sino-U.S. trade talks, is set for a second straight weekly gain. \"Expectations for the GDP data were not very good, so the outcome was actually fine,\" said a trader at a Chinese bank. \"The yuan market was reacting more to the downside trend in the dollar index.\" China's economic growth slowed more than expected to 6.0% in the third quarter from a year earlier, the weakest pace in at least 27-1/2 years, as demand at home and abroad faltered. However, the market and analysts took the downbeat data in stride. \"While GDP was a tad below expectations, this series has been very stable so the market may not pay too much attention to it as long as it has not dipped below 6%,\" said Frances Cheung, head of macro strategy for Asia at Westpac in Singapore. Tommy Xie, head of China research at OCBC Bank in Singapore said the headline GDP data came in shy of expectations, but some key indicators suggested the economy remained resilient. \"Fourth-quarter GDP will probably be around 6%. This will give China 6.1% for the whole year, on track to achieve the target of double income by 2020,\" Xie said, adding he sees no urgency for China to roll out \"any imminent\" easing measures. Beijing has pledged to double its GDP and per capita income by 2020 from 2010. Spot yuan opened at 7.0710 per dollar and was changing hands at 7.0777 by midday, only 5 pips weaker than the previous late session close. If the yuan finishes the late night session at the midday level, it would have gain 0.16 percent to the dollar for the week, after rising 0.83 percent a week earlier. The global dollar index, a gauge that measures dollar strength against six other major currencies, hovered at a two-month low after British Prime Minister Boris Johnson and European Union leaders agreed a new Brexit deal on Thursday. Optimism that U.S. and Chinese negotiators were moving along on a trade deal also lifted sentiment. China said on Thursday that it hoped to reach a phased trade agreement with the United States as soon as possible. \"If a deal can be inked in mid-Nov as expected, then I think yuan may try 7,\" OCBC's Xie said. U.S. President Donald Trump and Chinese President Xi Jinping are both scheduled to attend the summit of the Asia Pacific Economic Cooperation (APEC) countries in Chile next month. Trump hinted that a written agreement could be signed there. The global dollar index fell to 97.599 at midday from the previous close of 97.607. The offshore yuan was trading at 7.0785 per dollar as of midday. The yuan market at 0352 GMT: ONSHORE SPOT: Item Current Previous Change PBOC midpoint 7.069 7.0789 0.14% Spot yuan 7.0777 7.0772 -0.01% Divergence from 0.12% midpoint* Spot change YTD -2.89% Spot change since 2005 16.94% revaluation Key indexes: Item Current Previous Change Thomson 91.42 91.53 -0.1 Reuters/HKEX CNH index Dollar index 97.599 97.607 0.0 *Divergence of the dollar/yuan exchange rate. Negative number indicates that spot yuan is trading stronger than the midpoint. The People's Bank of China (PBOC) allows the exchange rate to rise or fall 2 percent from official midpoint rate it sets each morning. OFFSHORE CNH MARKET Instrument Current Difference from onshore Offshore spot yuan 7.0785 -0.01% * Offshore 7.1335 -0.90% non-deliverable forwards ** *Premium for offshore spot over onshore **Figure reflects difference from PBOC's official midpoint, since non-deliverable forwards are settled against the midpoint. . (Reporting by Winni Zhou and Andrew Galbraith Editing by Jacqueline Wong)", "description": "SHANGHAI, Oct 18 (Reuters) - The yuan was barely changed  against the dollar on Friday, even as data showed China's  economic growth slipped to its weakest...", "authors": [], "top_image": "https://i.dailymail.co.uk/i/pix/m_logo_636x382px.png", "published_at": "2019-10-18"}