{"pub": "yahoo", "url": "https://news.yahoo.com/tunisia-holds-third-parliament-polls-since-2011-revolt-035342176.html", "downloaded_at": "2019-10-08 09:38:29.796561+00:00", "title": "Exit polls show Islamist inspired party leading Tunisia election", "language": "en", "text": "Supporters of the Qalb Tounes (Heart of Tunisia) party of jailed business tycoon Nabil Karoui celebrate the first exit polls at the party's office in Tunis on Sunday (AFP Photo/FETHI BELAID)\n\nTunis (AFP) - Exit polls showed an established Islamist-inspired party leading that of a jailed business tycoon in Tunisia's legislative polls Sunday, weeks after a presidential election that reshaped the country's post-Arab Spring political landscape.\n\nPolling stations for the seven-million-strong electorate closed at 6:00 pm (1700 GMT). Ennahdha and Qalb Tounes (Heart of Tunisia) -- led by detained business tycoon Nabil Karoui -- were both swift to claim victory.\n\nTwo exit polls after the close of voting showed Ennahdha in the lead with 40 seats out of 217, while Qalb Tounes was in second, with one pollster giving it 35 seats, and another 33.\n\nHowever, preliminary official results are not expected until Wednesday.\n\nIn the runup to the legislative vote, Ennahdha and Qalb Tounes officially ruled out forming an alliance, and with a plethora of parties and movements running, the stage could be set for complex and rowdy negotiations -- or even a second poll.\n\nThe legislative vote comes after candidates aligned with traditional political parties were eclipsed by independent runners during the first round of presidential polls last month.\n\n\"According to preliminary results collected at voting stations, Qalb Tounes has come first\", party spokesman Hatem Mliki said.\n\nBut its main rival Ennahdha also claimed that it had \"according to preliminary results... won the elections\".\n\nIn the first round of the presidential vote Karoui, held since August on money-laundering charges, came second behind Kais Saied, an independent law professor.\n\nCourts rejected several appeals for his release during campaigning.\n\n- Low turnout -\n\nThe sidelining of the ruling political class in the first presidential round on September 15 was rooted in frustration over a stagnant economy, high unemployment, failing public services and rising prices.\n\nThe ink-stained fingers once proudly displayed after the 2011 revolution were briskly wiped clean as Tunisians fed up with the status quo cast ballots for lawmakers for the third time since the 2010-2011 uprising.\n\n\"I came to vote out of duty, nothing more,\" said Abdeljlil Frihi, in his 70s, scrubbing his finger and railing against a political class that \"sank\" the country.\n\nMohamed Daada, 60, said he had \"no hope for a positive change\" in Tunisia.\n\n\"I don't trust anyone or any political party. Life just gets worse in this country.\"\n\nMore than 15,000 candidates on 1,500 lists contested 217 seats in a parliament dominated by Ennahdha in alliance with centrist party Nidaa Tounes, which has been decimated by infighting.\n\nThe elections commission, ISIE, said turnout was 41.3 percent, well down from the 64 percent achieved in 2014.\n\nThe first round of the presidential poll achieved a turnout of 49 percent.\n\nThe presidential race may have overshadowed the legislative contest, but parliament is responsible for tackling the main challenges facing Tunisian society and observers were concerned about voter apathy.\n\n\"People no longer trust the old parties, and they don't know the new ones, so they're not motivated in this election,\" said Ali Rekiki, who works with Tunisian electoral monitor Mourakiboun.\n\nA strong showing for Qalb Tounes could bolster Karoui's presidential campaign and supporters say it might make a case for him to take over as prime minister if he loses to Saied.\n\nThe socially conservative professor has not come out in support of any party.\n\n- Complex talks, or new vote? -\n\nWith the electorate tired of political manoeuvring and the failure to improve living conditions since the ouster of late longtime autocrat Zine El Abidine Ben Ali, new movements have been vying for votes -- among them Qalb Tounes.\n\nThe party that emerges as the largest will have to negotiate with other factions in order to secure the support of a minimum of 109 deputies, in order to secure a parliamentary majority.\n\n\"Negotiations will probably take two weeks\", said political analyst Youssef Cherif.\n\nBut he also pointed to the risk of a new vote in the event that parties are unable to agree a viable alliance.\n\nIslamist populist lawyer Seifeddine Makhlouf's Karama party secured 17 or 18 seats in Sunday's polls, according to exit polls.\n\nParliament will have two months to agree on the formation of a new government in a country hailed as the Arab Spring's sole democratic success story but straining to meet the revolution's other demands of \"work and dignity\".\n\nWhile it has succeeded in curbing jihadist attacks that rocked the key tourist sector in 2015, Tunisia's economy remains hampered by austere International Monetary Fund-backed reforms.", "description": "Exit polls showed an established Islamist-inspired party leading that of a jailed business tycoon in Tunisia's legislative polls Sunday, weeks after a presidential election that reshaped the country's post-Arab Spring political landscape.  Ennahdha and Qalb Tounes (Heart of Tunisia) -- led by", "authors": ["Kaouther Larbi", "Caroline Nelly Perrot"], "top_image": "https://s.yimg.com/uu/api/res/1.2/CstzWVnNoyiUK6AGg6Rmjw--~B/aD01MTI7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/31af1d7892b99ef8026f19967bacefee1d05d4e6.jpg", "published_at": "2019-10-06"}