{"pub": "businessinsider", "url": "https://nordic.businessinsider.com/reasons-to-get-an-airline-credit-card", "downloaded_at": "2019-10-04 17:04:49.629036+00:00", "title": "Frequent flyer miles aren't always as valuable as Chase and Amex points, but you should still consider an airline credit card for these 5 reasons", "language": "en", "text": "When it comes to collecting travel rewards, most experts will tell you to focus on rewards credit cards that earn flexible currencies like Amex Membership Rewards, Chase Ultimate Rewards, and Citi ThankYou points. These currencies can be transferred to a variety of different airline and hotel rewards programs, giving you lots of redemption flexibility.\n\nHowever, there are still times when airline credit cards come in handy. Here are five instances when you should consider an airline co-branded credit card.\n\nKeep in mind that we're focusing on the rewards and perks that make these credit cards great options, not things like interest rates and late fees, which can far outweigh the value of any rewards.\n\nWhen you're working to earn credit card rewards, it's important to practice financial discipline, like paying your balances off in full each month, making payments on time, and not spending more than you can afford to pay back. Basically, treat your credit card like a debit card.\n\n1. You need lots of miles fast\n\nAirline co-branded credit cards generally offer pretty big sign-up bonuses, often north of 50,000 miles. If you need lots of miles fast and don't have time to save up, a co-branded airline credit card is a great way to top off your account quickly.\n\nMost airline credit cards do have a spending requirement averaging $3,000 within three months. One exception is the Barclay Aviator Red World Elite MasterCard, which simply requires a single purchase in any amount to earn the bonus.\n\n2. You're targeted for an amazing offer\n\nSometime credit card issuers target certain customers with sign-up bonuses that are just too good to pass up. A couple of months ago I received a 75,000-mile sign-up bonus for the Citi® AAdvantage® Platinum Select® World Elite Mastercard® and promptly applied for it. There's no telling when these higher bonuses may come around again. If you have a use for the miles, getting in on these bonuses is a no-brainer.\n\nTo ensure you're targeted for bigger credit card sign-up bonuses in the future, make sure you're opted in to receive marketing materials. Sometimes these offers are sent via email, though most of the time you can expect a flyer in the mail with an offer code.\n\nRead more: The best credit card sign-up bonuses available now\n\n3. You travel frequently with one airline, but not enough to earn status\n\nCo-branded cards can get you free checked bags, priority boarding, and elite-qualifying miles based on credit card spending. If you travel frequently with one airline but not enough to earn status, these benefits can really come in handy. Premium credit cards like the Delta Reserve® Credit Card from American Express go beyond free checked bags and priority boarding, with luxury perks like airport lounge access and airline fee credits.\n\n4. You're a frequent flyer who wants to get revenue requirements waived for elite status\n\nIt's not enough to rack up dozens of flights per year — many airlines nowadays require a certain amount spending on airfare to qualify for elite status. Luckily, there are a few airlines that waive revenue requirements based on co-branded credit card spending:\n\nAmerican Airlines AAdvantage\n\nThe Barclays Aviator Silver Card offers $3,000 Elite Qualifying Dollars (EQDs) when you spend $25,000 in a calendar year or earn $6,000 EQDs by spending $50,000 in a calendar year. The Aviator Red, Blue, and Business cards offer $3,000 EQDs for spending $25,000 in a calendar year.\n\nAmerican Airlines requires $3,000 to $15,000 in EQDs for elite status qualification. For most people, being able to complete EQD requirements via credit cards is much more preferable to spending $3,000 to $15,000 on airfare in a year.\n\nDelta SkyMiles\n\nDelta's Mile Qualifying Dollar (MQD) requirements range from $3,000 to $15,000. With the right credit card, you can complete all of these requirements via card spending. The following credit cards will waive the MQD requirement for Silver, Gold, and Platinum status if you spend at least $25,000 on your eligible card. Diamond MQM requirements are waived for those who spend $250,000 per year.\n\nThe following credit cards qualify for MQM waivers:\n\nUnited Airlines MileagePlus\n\nThe Premier Qualifying Dollars (PQDs) for United Silver, Gold, and Platinum status are waived for those who manage to spend $25,000 per calendar year on the following cards:\n\nUnited Explorer Card\n\nUnited Explorer Business Card\n\nUnited Club Card\n\nUnited MileagePlus Club Business Card\n\nUnited MileagePlus Presidential Plus Card (not open to new applicants)\n\n5. You want recurring benefits and discounted flights\n\nMany airline credit cards offer some pretty substantial perks to appeal to cardholders beyond the initial sign-up bonus. The Southwest Companion Pass is perhaps the most prominent example. Earn 110,000 miles on Southwest every year (credit card spending counts) and you can designate a traveling companion who will be able to fly for just the cost of taxes and fees.\n\nOther airline credit cards have similar benefits. The Alaska Airlines Visa Signature credit card offers a $121 companion fare ($99 plus taxes and fees) every year. The Citi AAdvantage Platinum card issues a $125 Travel Voucher to cardholders who complete $20,000 worth of spending every year. These benefits can far outweigh the annual fees on these credit cards.", "description": "Credit cards from Delta, United, and other airlines don't always earn the most valuable rewards, but they get you priority boarding and other perks.", "authors": ["Ariana Arghandewal"], "top_image": "https://image.businessinsider.com/5d975bf05d21aa0db77e1781?width=1200&format=jpeg", "published_at": "2019-10-04"}