{"pub": "metro", "url": "https://metro.co.uk/2019/10/10/ant-dec-reunite-im-celebrity-get-2019-viewers-get-boys-australia-10897593", "downloaded_at": "2019-10-11 00:15:59.272809+00:00", "title": "Ant McPartlin returns to I'm A Celebrity in new interactive advert", "language": "en", "text": "Ant and Dec are back together again (Picture: ITV)\n\nAnt McPartlin is making a return to the I’m A Celebrity… Get Me Out Of Here! jungle this year, after Holly Willoughby took up his spot alongside Declan Donnelly in 2018.\n\nTo celebrate the boys’ Australian reunion, viewers will get a chance to vote for what happens next in the new advert.\n\nThe first promo (due to air this Saturday) sees the Geordie duo making their way to the camp…via a boat. However, disaster seemingly strikes when their map gets blown away at sea.\n\nIt will then be up to fans watching at home to vote for what happens to the boys next, via the official I’m A Celebrity app.\n\nThey will have two options to choose from – Tropical Tides or Arctic Antics, so we know things will get worse on their trip to Oz before it gets better.\n\nAdvertisement\n\nAdvertisement\n\nThe scenario with the most votes will then be aired on TV in a few weeks time, leading up to the boys eventual arrival (hopefully!) to coincide with the start of the new series.\n\nAnt and Dec have filmed seven different promos altogether, so viewers really will be in for an epic quest where they get to decide the outcome.\n\nDec wore a sailor’s hat (Picture: ITV)\n\nAnt looked happy to be back (Picture: ITV)\n\nFans will get three times to vote for their chosen scenario over the next month.\n\nNow that I’m A Celebrity is officially returning, we shouldn’t just be concerned that Ant and Dec are technically lost at sea, there’s still so much speculation as to who will actually be appearing in the jungle this year.\n\nWe’ve compiled a handy break-down of everyone we think is in the running for a place at the campsite. Capital FM DJ Roman Kemp has also already refused to deny claims that he’s signed up for a stint on the show too.\n\nI’m A Celebrity returns to ITV1 this winter.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: I’m A Celebrity Extra Camp 2019 swaps Scarlett Moffat and Joe Swash for Emily Atack and Adam Thomas\n\nMORE: I’m A Celebrity 2019 line-up: Harry Redknapp accidentally lets slip Ian Wright is being paid £1 million to enter jungle", "description": "Ant and Dec are reunited for I'm A Celebrity... Get Me Out Of Here! 2019.", "authors": ["George Griffiths"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/ant-and-dec_1570741611.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-10"}