{"pub": "fox", "url": "https://foxnews.com/media/andrew-cuomo-n-word", "downloaded_at": "2019-10-15 23:11:28.634871+00:00", "title": "Gov. Andrew Cuomo uses uncensored N-word during live interview: 'Pardon my language'", "language": "en", "text": "New York Gov. Andrew Cuomo might want to avoid his little brother after using an uncensored version of the N-word during a live radio show on Tuesday.\n\nCNN pundit Chris Cuomo, the younger brother of the Democratic governor, famously said being called “Fredo” is “like the N-word” for Italians during a viral outburst earlier this year. Fredo is a reference to Fredo Corleone, the weak and facile brother in the movie “The Godfather,” who was played by John Cazale.\n\nTrump mocks CNN’s Chris Cuomo over viral video: ‘I thought Chris was Fredo also’\n\nThe older Cuomo sibling called into WAMC radio to discuss a variety of topics, including a recent New York Times opinion piece headlined, “How Italians Became ‘White.” The governor used the uncensored version of the N-word when discussing the Times piece.\n\n“They used an expression that Southern Italians were called, I believe they were saying Southern Italians, Sicilians – I’m half Sicilian – were called, quote-unquote and pardon my language, but I’m just quoting the Times: ‘n—r wops,'” Cuomo said without censoring the word.\n\n“N-word wops, as a derogatory comment,” Cuomo continued, using the abbreviation for the second reference.\n\nWAMC's Alan Chartock didn’t comment on Cuomo’s use of the word. In fairness to the governor, the Times did publish the uncensored word itself to describe racist terms used against Italian-Americans — but that didn’t stop critics from rushing to Twitter with thoughts.\n\nCNN'S CHRIS CUOMO SEEN IN UNVERIFIED VIDEO CURSING AT MAN WHO APPARENTLY CALLED HIM 'FREDO'\n\nBack in August, video of a confrontation the younger Cuomo brother/CNN pundit went viral when the “Cuomo Prime Time” namesake threatened a man who apparently had called him \"Fredo.\"\n\nTHIS IS CNN? PRIMETIME SHOWS FILLED WITH LIBERAL OPINION, NOT STRAIGHT NEWS AS NETWORK CLAIMS\n\nA video of the confrontation –which took place at a bar on New York's Shelter Island – began with the man telling Cuomo, \"I thought that was who you were,\" after referring to his as the fictional character.\n\n\"No, punk-ass b----es from the right call me 'Fredo.' My name is Chris Cuomo. I'm an anchor on CNN,\" Cuomo responded. \"It's a f---ing insult to your people. It's an insult to your f--kin' people. It's like the N-word for us. Is that a cool f---ing thing?\"\n\nThe video has now been viewed nearly 10 million times and President Trump even chimed in.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“I thought Chris was Fredo also. The truth hurts,” Trump tweeted.\n\nCuomo eventually acknowledged that he received support but said he shouldn’t “add to the ugliness” that he opposes.", "description": "New York Gov. Andrew Cuomo might want to avoid his little brother after using an uncensored version of the N-word during a live radio show on Tuesday.", "authors": ["Brian Flood", "Brian Flood Covers The Media For Fox News. Follow Him On Twitter At"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/08/RT-Cuomo.jpg", "published_at": "2019-10-15"}