{"pub": "guardian", "url": "https://theguardian.com/technology/2019/sep/04/facebook-users-phone-numbers-privacy-lapse", "downloaded_at": "2019-09-05 02:12:06.316506+00:00", "title": "Facebook confirms 419m phone numbers exposed in latest privacy lapse", "language": "en", "published_at": "2019-09-04", "text": "The information was stored in an online server that was not password protected, according to a report from TechCrunch\n\nHundreds of millions of Facebook users’ phone numbers were exposed in an open online database, the company confirmed Wednesday, in the latest example of Facebook’s past privacy lapses coming back to haunt its users.\n\nMore than 419m Facebook IDs and phone numbers were stored in an online server that was not password protected, the technology website TechCrunch reported. The dataset included about 133m records for users in the US, 18m records for users in the UK and 50m records for users in Vietnam.\n\nThe database was taken offline after TechCrunch contacted the web host.\n\nFacebook confirmed the report and said it was investigating when and by whom the database was compiled. A spokeswoman for the company also claimed that the actual number of users whose information was exposed was approximately 210m, because the 419m records contained duplicates.\n\nThe records were likely amassed using a tool that Facebook disabled in April 2018 in the aftermath of the Cambridge Analytica controversy. The revelations showed how Facebook’s lax approach to privacy had allowed a political consultancy to obtain personal information from tens of millions of profiles.\n\nFacebook emails seem to show Zuckerberg knew of privacy issues, report claims Read more\n\nUntil then, Facebook allowed anyone to search for users by their phone number, a seemingly benign tool for finding an individual with a common name that was also readily hijacked by data scrapers.\n\n“Malicious actors have also abused these features to scrape public profile information by submitting phone numbers or email addresses they already have through search,” chief technology officer Mike Schroepfer wrote at the time. “Given the scale and sophistication of the activity we’ve seen, we believe most people on Facebook could have had their public profile scraped in this way.”\n\nFacebook emphasized that the exposed data was “old” and would have been scraped prior to the April 2018 policy change.\n\n“This dataset is old and appears to have information obtained before we made changes last year to remove people’s ability to find others using their phone numbers,” a spokeswoman said in a statement. “The dataset has been taken down and we have seen no evidence that Facebook accounts were compromised.”\n\nThe spokeswoman did not respond to questions about whether Facebook would inform users whose information was exposed or offer any mitigation to those affected, saying only that the company was still investigating.\n\nFacebook’s characterization of the data as “old” notwithstanding, phone numbers are an increasingly important key to people’s identities – and a potential vulnerability. While not as sensitive as a social security number, they are important identifiers that can be used to easily obtain significant amounts of personal information about an individual and their family from online data brokers, as the New York Times reported in August.\n\nSkilled attackers can often leverage a mobile phone number and information gained through data brokers or social media sites (such as home address, previous addresses, family members, etc) to persuade mobile phone carriers to transfer a target’s phone number to a different phone.\n\nThe latest high-profile victim of this type of attack, which is known as Sim swapping, was Twitter chief executive officer Jack Dorsey, whose Twitter account was hijacked on Friday by a hacking group that appears to have gained control of his mobile phone number.\n\nOn Wednesday, Twitter announced that it was temporarily disabling the ability for users to send tweets through SMS, or text messages, due to “vulnerabilities that need to be addressed by mobile carriers”.", "description": "The information was stored in an online server that was not password protected, according to a report from TechCrunch", "authors": ["Julia Carrie Wong"], "top_image": "https://i.guim.co.uk/img/media/1eb9477762460085399bcbeca43ac46cab1f9c2f/0_52_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=83f9562d51e2630915cdd1b5b2ff199e"}