{"pub": "investing.com", "url": "https://in.investing.com/news/stock-market-news/care-ratings-for-indian-debt-instrumentsoct-30-2018210", "downloaded_at": "2019-10-30 09:04:14.850998+00:00", "title": "CARE ratings for Indian debt instruments-Oct 30", "language": "en", "text": "CARE ratings for Indian debt instruments-Oct 30\n\nStock Markets 10 minutes ago (Oct 30, 2019 14:24)\n\n© Reuters. CARE ratings for Indian debt instruments-Oct 30 Oct 30 (Reuters) - Below are the ratings awarded by Credit Analysis and Research Ltd. (CARE) for local debt instruments as of October 29, 2019. COMPANY INSTRUMENT RATING AMOUNT MOVEMENT (RS.MLN) ------- ---------- ------ ------- --------- LONG TERM RATINGS: ------------------ Elite Motors Pvt Ltd LT Bk Fac CARE B 73.9 Issuer not Cooperating /Stable Northern Arc 2019 Cl Rigi Originator Series A1 PTCs Withdrawn Ashish Securities Pvt Ltd- Northern Arc 2019 Cl Rigi Northern Arc 2019 Cl Rigi Originator Series A2 PTCs Withdrawn Ashish Securities Pvt Ltd- Northern Arc 2019 Cl Rigi Northern Arc 2019 Csl Lamos OriginatorSeries A1 PTCs Withdrawn Si Creva Capital Services Pvt Ltd- Northern Arc 2019 Csl Lamos Northern Arc 2019 Csl Lamos OriginatorSeries A2 PTCs Withdrawn Si Creva Capital Services Pvt Ltd- Northern Arc 2019 Csl Lamos Om Sugars Ltd LT Bk Fac CARE D 282.7 Issuer not Cooperating Shiraguppi Sugar Works Ltd LT Bk Fac CARE D 1961.6 Issuer not Cooperating Shiraguppi Sugar Works Ltd ST Bk Fac CARE D 3.7 Issuer not Cooperating Star Pcg Sme Series I Oct 19 Assignee Payouts CARE AA (SO) 2841.9 (Originator Indostar Capital Finance Ltd) Provisional Credit Opinion Equivalent to CARE AA (SO) Suresh Angadi Education Foundation LT Bk Fac CARE D 340.2 Issuer not Cooperating Vasmo Agro Nutri Product Pvt Ltd LT Bk Fac CARE D 400 Issuer Not cooperating; Based on best available information -------------------------------------------------------------------------------------------- $: Rating watch with positive implication #: Rating Watch with Developing implications @: Rating Watch with Negative Implications %: Rating under Credit Watch wd -Rating Stands Withdrawn sp -Rating Suspended pp -Principal Protected pn -Principal Not Protected CARE may apply + or - signs for ratings to reflect a comparative standing within the category. BG-Bank Guarantee; CC-Cash Credit; CCPS-Cumulative Convertible Preference Share; CD-Certificate of Deposit; CLO-Collateralized Loan Obligation; CPA-Claims Paying Ability; CP-Commercial Paper; CPS-convertible preference shares; CRPS- Cumulative Redeemable Convertible Preference shares; DDB-Deep Discount Bond; EPBI-Exchange premium bond; FBL-Fund Based Limits; FRB/FRN -Floating Rate Bond/Note; ICD -Inter Corporate Deposit; ITD-Immediate Term Debt; LOC-Letter of Credit; LT -Long Term; LTB -Long Term Borrowing; LTD -Long Term Debt; MOCD-multiple option convertible debenture; MTD -Medium term Debenture; MTN-medium term notes; NCD(SO) - Non-Convertible Debenture-(Structured Obligation); NCD-Non-convertible Debentures; NCRB-Non Convertible Redeemable Bonds; NM-Not Meaningful; OCD-optionally convertible debenture; OD-Over Draft; OFCD-Optionally Fully Convertible Debenture; PCD-Partially Convertible Debenture; PCN-partly convertible notes; PCPS-Partly Convertible Preference Share; POCD-partly optional; PP-privately placed; PSPC-Post Shipment & Packing Credit; PS-Preference Shares; PTC-Pass Through Certificates; RPS-Redeemable Preference Shares; SCPN-secured convertible preference notes; SDO-Structured Debt Obligation; SLR-Statutory Liquidity Ratio; SO-Structured Obligation; SPCD - Secured Partly Convertible Debentures; SPN-secured premium notes; STB-Short Term Bond; STD-Short Term Debentures; ST-Short Term; Sub. Bonds-Subordinate Bonds; TB-Taxable Bond; TFB-Tax Free Bond; TL-Term Loan; TOCD-triple option convertible debentures.\n\nCARE ratings for Indian debt instruments-Oct 30", "description": "CARE ratings for Indian debt instruments-Oct 30", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEB2N09U_L.jpg", "published_at": "2019-10-30"}