{"pub": "metro", "url": "https://metro.co.uk/2019/10/12/inseparable-kids-say-together-forever-stage-fake-wedding-photoshoot-10907449", "downloaded_at": "2019-10-12 16:06:03.053663+00:00", "title": "Kids who say they'll be together forever stage fake wedding photoshoot", "language": "en", "text": "Frankie Miller, nine, and Aubrey Butterly, eight, asked their friends to pose as bridesmaids and groomsmen for the fake wedding photoshoot (Picture: Dana Lee Photography LLC / Mercury Press)\n\nIs it weird to rope kids into the wedding industrial complex before they hit puberty?\n\nPerhaps – especially considering child marriage continues around the world.\n\nBut children aren’t likely to be thinking deeply about concepts like heteronormativity and whether love can really last forever – and if they’re determined to have a fake wedding with a pal, you’ll have to go along with it.\n\nSuch is the case of Frankie Miller, nine, and his ‘girlfriend’ Aubrey Butterly, eight, who have stubbornly declared that they will one day get married for real. They met at kindergarten three years ago and have been inseparable ever since.\n\nTo display their love, they decided to tie the knot in an unofficial ceremony (don’t worry, this wedding is not actually legally binding, as that would be wrong) at a community college in Bucks County, Pennsylvania.\n\nAdvertisement\n\nAdvertisement\n\nThe pair wore full on bride and groom attire and dragged in seven of their closest friends and family members to act as bridesmaids and groomsmen for the photos.\n\nFrankie’s mum Nicole, 38, said: ‘After they met, Frankie came home and told us all about Aubrey.\n\n‘He always referred to her as his best friend in the whole world.\n\nAfter sharing pizza the kids danced and posed for photos (Picture: Dana Lee Photography LLC / Mercury Press)\n\n‘One day, Frankie started referring to Aubrey as his girlfriend.\n\n‘He was so matter of fact about it, it was incredibly sweet.\n\n‘I don’t know if they’ll end up getting married when they’re older, but for now we just want them to have fun and experience all the amazing adventures life will bring.\n\n‘That’s exactly what this shoot was about – making precious memories.’\n\nOn their first Valentine’s Day together, Frankie went out and bought a toy unicorn, one fake rose and one real rose for Aubrey. When asked why, the young romantic explained to his mum that the real rose would die one day, but Aubrey would be able to keep the fake one forever.\n\nAfter unofficially tying the knot, it was time for cake (Picture: Dana Lee Photography LLC / Mercury Press)\n\nThree years after they met, Frankie, who is from a Catholic family, had his first Holy Communion in May.\n\nHe was having his photos taken by professional snapper Dana Smith for the celebration when he asked whether she’d be able to take photos of him and Aubrey all dressed up when they were older.\n\nAdvertisement\n\nAdvertisement\n\nDana and Nicole fell in love with the idea and, together with Aubrey’s mum Amanda, came up with the idea of a mock wedding.\n\nThe kids enjoyed pizzas together before getting into position for the photos.\n\nAfter posing for pictures they enjoyed their own wedding cake.\n\nThere was one tradition that had to be kept though: the wedding cake.\n\nAubrey’s mum Amanda, 35, a registered nurse and mum-of-two, said: ‘We just wanted the children to have fun and while some of the snaps were staged, most were just taken while they played together.\n\n‘They absolutely loved spending the day playing dress up.’\n\nMORE: Quiz: What should you dress up as for Halloween?\n\nMORE: What it’s like to get in trouble at work because of social media\n\nMORE: Dying man marries love of his life in wedding ceremony with every detail donated\n\nAdvertisement Advertisement", "description": "Frankie Miller, nine, and his 'girlfriend' Aubrey Butterly, eight, have stubbornly declared that they will one day get married for real.", "authors": ["Ellen Scott"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_88948260_1570893841.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-12"}