{"pub": "cbs", "url": "https://cbsnews.com/news/california-becomes-first-state-to-require-access-to-abortion-medication-at-public-colleges", "downloaded_at": "2019-10-12 00:24:41.251307+00:00", "title": "California becomes first state to require access to abortion medication at public colleges", "language": "en", "text": "California just became the first state in the U.S. to require public colleges to provide abortion medication to students on campus. Governor Gavin Newsom signed Senate Bill 24 — known as the \"College student Right to Access Act\" — into law Friday.\n\nUnder the new law, all 34 University of California and California State University systems will need to provide the medication, which is not currently offered on campuses, at no cost to students. They have until January 2023 to comply.\n\nA medical abortion is nonsurgical and noninvasive — it involves taking two prescription pills during the first 10 weeks of pregnancy to induce a miscarriage. It is not the same, however, as the morning-after pill, which delays or stops the release of an egg altogether.\n\nTo achieve true equality, women must have control over their own bodies.\n\n@GavinNewsom signed legislation expanding access to reproductive health care services, including @SenatorLeyva’s #SB24 to increase access to reproductive health care at UC & CSU campuses. #CaliforniaForAll pic.twitter.com/CSMDL8KG1U — Office of the Governor of California (@CAgovernor) October 11, 2019\n\nLawmakers said the legislation is critical during a time when the Trump administration is working to roll back access to life-saving abortion services.\n\n\"As other states and the federal government go backward, restricting reproductive freedom, in California we are moving forward, expanding access and reaffirming a woman's right choose,\" Governor Newsom said in a statement. \"We're removing barriers to reproductive health — increasing access on college campuses and using technology to modernize how patients interact with providers.\"\n\nFormer Governor Jerry Brown, also a Democrat, vetoed a similar piece of legislation in September 2018, claiming that students had easy access to off-campus reproductive health providers. Supporters argued centers are difficult to access for students without cars and the cost of the medication could be out of reach for many.\n\nAccording to a study in the Journal of Adolescent Health, about 62% of students at California universities were more than 30 minutes away from the closest abortion facility using public transportation. The study also found the average cost of the medication was $604 — a significant barrier for some students.\n\nThank you @CAgovernor @GavinNewsom for signing #SB24! With your signature, CA rejects the misguided paths that other states have taken in limiting access to abortion care. I look forward to partnering with you as we continue to fight for reproductive justice for all Californians. pic.twitter.com/OkXdGZyx5T — Connie Leyva (@SenatorLeyva) October 11, 2019\n\nThe state has already raised the necessary $10 million in private donations to set up and pay for the services. The law does not rely on state dollars, according to The Associated Press.\n\nWith a newly conservative Supreme Court, access to abortion has come under fire across the South and Midwest, where state lawmakers have raced to pass laws that ban the procedure in hopes of overturning Roe v. Wade, the 1973 Supreme Court case that effectively legalized the procedure nationwide.\n\n\"As states across our country are rolling back women's health care and access to abortion, California continues to lead the nation in protecting every individual's right to choose,\" said Senator Connie Leyva, who introduced the bill.\n\n\"By ensuring that abortion care is available on campus, college students will not have to choose between delaying important medical care or needing to travel long distances or even missing classes or work.\"", "description": "California students will soon have access to free medical abortions on campus — paid for by private donations", "authors": ["Sophie Lewis"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/10/11/7270578c-816a-486e-b942-5f8df2bf546e/thumbnail/1200x630/6682db83b980821c9868f37d324beeed/egn2llyvaaa-vqv.jpg", "published_at": "2019-10-11"}