{"pub": "indiatimes", "url": "https://idiva.com/news-opinion/news/football-legend-paul-gascoigne-forcefully-kissed-a-fat-woman-to-give-her-a-confidence-boost/18003628", "downloaded_at": "2019-10-16 13:58:39.294130+00:00", "title": "This Man Thought Forcefully Kissing A ‘Fat’ Woman Would Boost Her Confidence", "language": "en", "text": "Former Newcastle United player Paul Gascoigne is currently facing trial. The 52-year-old was charged with sexually assaulting a woman on a train under the influence of alcohol.\n\nPaul was arrested at the Durham station on 20 August 2018, and was charged with one count of sexual assault by touching in November. His defense is more shocking than the act itself.\n\nWhat happened on the train\n\nGascoigne was allegedly drunk and yelling cuss words on the train at Darlington, when he suddenly \"cornered\" his victim, who had already tried to keep a distance from him on catching a threatening vibe. Further, unable to control himself, he took her face in two hands and forced a “sloppy” kiss on her lips, causing the woman to recoil in shock, as other passengers immediately intervened.\n\nWilliam Mousley, the prosecuting lawyer told the media: \"This case concerns a brief but unpleasant assault with sexual overtones on a woman on train in August 2018 by a drunken male stranger in his 50s. It happened as she was making her way home from work.\"\n\nGascoigne’s excuse for kissing a woman without her consent\n\nAccording to the court, when confronted by other passengers on the train, Gascoigne told them he had tried to give her a \"confidence boost” which she obviously needed, since she was “fat.”\n\nFurther, reports claim that the unaccompanied woman noticed Gascoigne, but did not recognise him at the start. However, what she did notice was that he was drunk and swearing, telling other passengers he'd had to pay a guard for his ticket.\n\nGascoigne allegedly tried to engage with the woman he attacked, as well as other female passengers. In desperation, he even moved his suitcase around frantically and tried to sit on the same woman, causing her to move to a seat closer to the window. Mousley said: \"He continued trying to engage with her as she was looking out of the window and tapped her on the arm causing her to look round. Then, he put his hands on her cheeks and kissed her forcefully and sloppily on the lips. Upset and shocked, she pushed him away and told him to get off.\"\n\nThe woman reacts to Gascoigne’s move\n\nWhen quizzed on Gascoigne’s behaviour, the woman revealed that he was “definitely under the influence and seemed completely intoxicated.” Further, she explained how she put her headphones on and attempted to ignore the noise coming from Gascoigne, who was at that point, seated behind her.\n\nShe said: \"Midway through the journey he asked me if I was a palm reader. I said no and tried to keep looking forward. He kept saying sorry. I said 'It's fine'. I was just looking out of the window. He said sorry a second time, and then tapped my arm. I turned around to face him and he grabbed my face and kissed me full on the lips, and I was taken aback because it was just completely out of the blue.\"\n\nThe woman then said that once she realised what was happening, she pushed Gascoigne off and said, \"No, that's not OK.\" She added that she did not realise that it was Gascoigne until much later.\n\nGascoigne’s lawyer is a woman\n\nMichelle Heeley, the defending lawyer, alleged that the victim had been called a “fat cow” by a male passenger, after which her client, Gascoigne, was only trying to “boost her morale.” She said, “A male voice asked if you wanted a photograph with Mr Gascoigne, then said ‘why would you want a photo with that fat cow,’ something to that effect.”\n\nWhen the woman was quizzed about whether she remembers anyone being abusive to her about her weight, she denied it. “I have no recollection of that at all,” she said. Heeley asked the woman in court, “He said ‘don’t worry you are beautiful’ and that’s when he kissed you?” After which the woman responded, “I don’t recall that happening.”\n\nGascoigne has denied all claims.\n\n\n\n", "description": "Football legend Paul Gascoigne was accused of sexual assault on a train, under the influence of alcohol, where he allegedly kissed a stranger \"forcefully and sloppily.” In his defense, he told police he did it only to give the “fat lass” a confidence boost.", "authors": [], "top_image": "https://im.idiva.com/content/2019/Oct/iDiva_This-Man-Thought-Forcefully-Kissing-A-Fat-Woman-Would-Boost-Her-Confidence_Social_5da6e924b5c28.jpg", "published_at": "2019-10-16"}