{"pub": "townhall", "title": "BMI doesn't measure health. Exercise improves health. What measures should you pay attention to?", "url": "https://townhall.com/health/weight-loss/2018/05/15/bmi-doesnt-measure-health-exercise-improves-health-measures-pay-attention-n11790", "language": "en", "published_at": "2018-05-15", "downloaded_at": "2019-09-02 07:05:39.823728+00:00", "text": "In 1970, a 23-year-old Austrian named Arnold Alois Schwarzenegger became the youngest ever Mr. Universe. The Guinness Book of World Records once called him “the most perfectly developed man in the history of the world.” Standing at 6’2” and weighing 235 pounds, he could bench press more than 500 pounds and barely had a ribbon of fat. Yet, at his physical peak, his Body Mass Index (BMI) was 30.5, indicating that he was obese. Clearly, BMI is a flawed tool, yet it’s still widely used in the medical community as a critical assessment of a person’s overall health. Arnold Schwarzenegger is perhaps the perfect example two things I preach to my patients: 1. Why you shouldn’t worry too much about your BMI, and 2. How much you exercise is a far better metric of your overall health. Read on to discover what you should be paying attention to and why…\n\nImportant Health Vitals the BMI Doesn’t Measure\n\nBody Mass Index (BMI) follows a simple formula. Dividing your weight, in kilograms by your height in centimeters, squared, gives you a score that says that you are underweight (below 18.5), normal weight (18.5 to 24.9), overweight (25 to 29.9), or obese (30 or more). That’s it. No measure of waist circumference, lean muscle mass or bone structure. No blood tests to check cholesterol or sugar levels. No stress test to gauge physical fitness and endurance. Just height and weight. By the way, Arnold’s waist size as Mr. Olympia was 34, which is pretty small for a 6’2”, 235-pound man. But I digress. BMI was created in the 1830s, when it was a standard medical practice to prescribe mercury to treat everything from headaches to cuts to constipation. Fun fact: Ingesting mercury can lead to destruction of your nervous system and gastrointestinal systems, tooth loss, vision loss, bodily numbness, and much more. We no longer prescribe mercury for anything (thank goodness!) and we shouldn’t rely so heavily on BMI either. Among its many flaws, BMI’s fixation on weight is perhaps the biggest. Muscles weigh more than fat. Strong bones weigh more than frail bones. By nature, having more muscle and bone mass will drive up your BMI score (just like Arnold). Also, if you are drinking 8 to 10 cups of water each day (like you should), then you will have more water weight than someone who isn’t. That too will drive up your BMI. Simply put, a BMI measurement may say you are overweight or obese, but it’s not an assessment of true health. Perhaps more importantly, BMI does not measure other factors that are more critical to your total body health than your weight, such as:\n\nCholesterol levels\n\nAtherosclerosis (cholesterol-laden plague in your arteries)\n\nBlood sugar levels\n\nBlood oxygen saturation\n\nStrength and balance\n\nEmotional well-being\n\nExercise: The Magic Bullet to Your Health\n\nCholesterol levels: Exercise lowers your cholesterol levels by removing low-density lipoprotein (LDL… aka the bad cholesterol) from your blood and passing it to your liver, where it is converted to bile and digested. Having high LDL is linked to heart disease.\n\nExercise lowers your cholesterol levels by removing low-density lipoprotein (LDL… aka the bad cholesterol) from your blood and passing it to your liver, where it is converted to bile and digested. Having high LDL is linked to heart disease. Atherosclerosis: Exercise keeps arteries healthy by lowering LDL, boosting healthy HDL cholesterol, and reducing the risk of blood clots. Blood clots form for a variety of reasons – high blood pressure, diabetes, obesity, stress, and more – and exercise helps prevent all of those.\n\nExercise keeps arteries healthy by lowering LDL, boosting healthy HDL cholesterol, and reducing the risk of blood clots. Blood clots form for a variety of reasons – high blood pressure, diabetes, obesity, stress, and more – and exercise helps prevent all of those. Blood sugar & oxygen levels: When you exercise, your muscles use more glucose (the sugar in your blood). Also, when you exercise, your body needs more oxygen to keep moving, hence the deep breaths. Exercising regularly will maintain healthy levels of sugar and oxygen in your blood.\n\nWhen you exercise, your muscles use more glucose (the sugar in your blood). Also, when you exercise, your body needs more oxygen to keep moving, hence the deep breaths. Exercising regularly will maintain healthy levels of sugar and oxygen in your blood. Strength and balance: It’s no secret that exercise makes you stronger, but those stronger muscles and bones improve your balance too.\n\nIt’s no secret that exercise makes you stronger, but those stronger muscles and bones improve your balance too. Emotional well-being: Exercise is just as important as therapy and medication for your mental health. Exercise reduces anxiety and depression, improves your mood and self-esteem, and provides an outlet for your stress.\n\nI prioritize these factor over a patient’s BMI, and I suggest that patients test for them too. And when you put all that data together (including BMI), then you have a more comprehensive view of your health – areas where you are healthy and areas where you need to improve.We live in a fat-obsessed society. BMI feeds into that frenzy. I believe that BMI forces you to think that if you aren’t skinny then you aren’t healthy. The truth is that how much you exercise will have a far greater impact on your health and vitality than your BMI. In fact, exercise will improve all of the health factors mentioned above. Here’s how…\n\nFitness Versus Fatness\n\nIf you eat a healthy diet and exercise for at least 30 minutes a day, it doesn’t matter what your BMI score is. And it might not matter too much if you have some fat that doesn’t seem to go away. What that exercise is doing to the rest of your body is invaluable and cannot be replicated by anything else.All that said, BMI is not entirely a bad thing. It can still be a useful tool when combined with an assortment of others tools used to measure your health – blood testing, allergies, diet consultations, etc. I talk with patients about their BMI if they need a nudge to take care of themselves better – to eat better and to get more exercise. But you shouldn’t exercise in hopes that it will lower your BMI. It might actually increase it, and that’s not a bad thing. Instead, you should exercise for every other reason I listed above. Not only that, but the more you exercise… the more endurance you build… which allows you to exercise more… which means you get more out of your exercise… and so on. Call it the upward spiral! And finally, I want to put the issue of fitness-versus-fatness to rest. No matter your BMI, it’s important that you are happy with who you are. I advise my patients – and you – to just focus on being fit. Doing so allows you to reap all the benefits of exercise, which naturally makes you happier no matter how much you weigh or what your BMI is.\n\nReferences", "description": "In 1970, a 23-year-old Austrian named Arnold Alois Schwarzenegger became .09/02/2019 3:05:36AM EST.", "authors": ["Beth Baumann"], "top_image": "https://media.townhall.com/_townhall/resources/images/thog.png"}