{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/09/watch-avengers-endgames-final-battle-come-together-in-this-flashy-vfx-reel", "downloaded_at": "2019-09-10 23:27:04.884874+00:00", "title": "Watch Avengers: Endgame's Final Battle Come Together In This Flashy VFX Reel", "language": "en", "text": "You can’t fool me, Weta, I know Giant-Man was not filmed on a green screen, he’s not real. (Image: Marvel Studios/Weta Digital)\n\nThe cathartic release of Endgame’s cataclysmic final battle between the gathered heroes of a decade’s worth of Marvel blockbusters and the forces of Thanos is a moment of abject, indulgent spectacle in a movie crammed full of them. So it’s befitting that its own VFX reel is equally indulgent.\n\nWeta Digital have just released this new VFX reel of its work on Avengers: Endgame, primarily focusing on the film’s third act — which, understandably, required a considerable amount of effects work.\n\nHow else you gonna have Tessa Thompson fly in on a winged horse while a Paul Rudd the size of of a skyscraper punches a giant armoured space lizard in the face?\n\nIt, perhaps almost like Endgame itself at times, is a little too flashy for its own good.\n\nIt cleverly interweaves the final FX shots from the film with behind-the-scenes greenscreen material from filming to blend together what was real and what wasn’t, but to a point that it almost obfuscates it.\n\nI want to see more of the actual behind-the-scenes stuff, not just watch the last battle again! I’ve got a Blu-ray for that.\n\nBut there’s still some fun little moments in here to glimpse, like the choreography of Captain Marvel going toe-to-toe with Thanos (or rather Josh Brolin in a hilariously torso’d mocap rig), or the fact that actually, all Chris Evans was actually spinning around when Cap revealed his worthiness to wield Mjolnir was the hammer’s shaft:\n\nNext you’ll tell me the giant purple supervillain was a computer effect, too! (Image: Marvel Studios/Weta Digital)\n\nDoes that still count as worthy? I’m sure someone will find a way to endlessly debate over it, either way.", "description": "The cathartic release of Endgame’s cataclysmic final battle between the gathered heroes of a decade’s worth of Marvel blockbusters and the forces of Thanos is a moment of abject, indulgent spectacle in a movie crammed full of them. So it’s befitting that its own VFX reel is equally indulgent....", "authors": ["Jason Schreier", "Alex Walker"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/hujpv7hthqmivq6qjiey.jpg", "published_at": "2019-09-10"}