{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/sep/13/california-plastics-legislation-single-use", "downloaded_at": "2019-09-13 19:20:46.402283+00:00", "title": "Most ambitious US law to tackle single-use plastics faces make-or-break moment", "language": "en", "text": "Proposed legislation in California would commit to 75% reduction in plastic waste by 2030, and phase out most single-use packaging\n\nThe most ambitious US legislation to tackle the scourge of plastic pollution choking up oceans and piling up in landfills could pass in California Friday – or end up in the dustbin of history. Lawmakers are likely to vote on proposals that aim to phase out most single-use plastic packaging within the next decade.\n\nThe two identical bills – one introduced in the state assembly and one in the senate – commit to a 75% reduction in the waste statewide within 10 years. If passed into law, they would require manufacturers to ensure that all single-use packaging produced, sold and distributed in California is fully recyclable or compostable by 2030. Companies that fail to comply could face up to $50,000 a day in fines.\n\nEnvironmental groups say the legislation is significant because it compels the powerful companies that have gotten us hooked on cheap, disposable products to help solve the pollution crisis.\n\nSan Francisco airport announces ban on sales of plastic water bottles Read more\n\n“Single-use plastic packaging is somewhat of a reckless convenience,” said Geoff Shester of the environmental advocacy group Oceana, which lobbied for the legislation. “But we can’t just put the onus on consumers to solve the problem. We have to get industry involved.”\n\nBut the legislation has faced varying levels of opposition from the plastics industry and consumer goods manufacturers, which have forced through several changes to the bill in an effort to make the immediate ask on them less onerous.\n\nSome industry critics have said that the legislation is redundant as many large producers – including Nestle, Proctor & Gamble, Pepsi and Unilever – have already committed to reducing packaging waste. But the bill’s supporters say the government needs to be able to hold corporations to their word.\n\nPlastics groups have heavily invested in efforts to lobby against the legislation. Novolex Holdings, a South Carolina-based company that manufactures plastic bags, is funding an advocacy group called Californians for the Environment and Recycling to disseminate the message that the bills would make certain baby formula, packaged foods and personal hygiene products such as toothpaste inaccessible to Californians.\n\nFacebook Twitter Pinterest A tractor moves a pile of recyclables at the San Francisco recycling center on 22 April 2008. Recycling centers across the US are struggling. Photograph: Justin Sullivan/Getty Images\n\n“That’s nonsense,” Shester said. “No one is saying we’re going to be consuming less soda or less toothpaste. It’s just that the government and industry are going to have to come up with systems that we can all live with,” he said.\n\nAt this point, it’s still unclear how those new systems would work, said Julia Stein, a supervising attorney with UCLA’s environmental law clinic who wasn’t involved in the drafting of the legislation. “The bills do leave a lot of how this would all work undefined,” she said. Built into the legislation is the creation of a panel that includes representatives from local government, recyclers, product manufacturers and packaging designers to advise on specific regulations.\n\n“But passing the bills is certainly a big first step,” she said.\n\nPlastic wrapped in plastic: the wasteful reality of America's grocery stores Read more\n\nCurrently, less than 10% of the plastic sold in the US each year is recycled. Much of it ends up in landfills, some of it is burned, and millions of tons end up in the ocean. A recent Guardian investigation revealed that cities around the country are no longer recycling many types of plastic dropped into recycling bins, partly due to China’s ban on importing plastic waste from the US.\n\nRecycling centers across the US are also struggling. A drop in scrap values recently contributed to the shuttering of California’s largest recycling center operator rePlanet, which laid off 750 employees in August.\n\nA third bill under consideration in California aims to increase the demand for recycled plastic and boost the state’s struggling recycling industry by requiring beverage manufacturers to increase the amount of recycled content in plastic bottles over the next decade.\n\nThe state’s legislative year ends Friday – which means lawmakers have just a few more hours to either vote on plastics proposals or table them for further consideration.", "description": "Proposed legislation in California would commit to 75% reduction in plastic waste by 2030, and phase out most single-use packaging", "authors": ["Maanvi Singh"], "top_image": "https://i.guim.co.uk/img/media/0a0548bdceab9c5ada6694cca35b692cce9cf4cc/0_158_4724_2835/master/4724.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=e541ae74f1771336cf4e79c8f38c0702", "published_at": "2019-09-13"}