{"pub": "businessinsider", "title": "I only ate home-cooked food for a month, and I felt healthier, saved money, and became a better chef", "url": "https://businessinsider.sg/only-ate-home-cooked-food-for-a-month-what-happened-2019-8", "language": "en", "published_at": "2019-08-28", "downloaded_at": "2019-09-03 00:03:23.913170+00:00", "text": "caption By cooking all of my own meals, I became a better chef. source Paige Bennett\n\nFor an entire month, I cooked all of my own meals and didn’t order takeout or go to restaurants.\n\nI made so many surprisingly simple but tasty dishes, from muffins and cakes to tacos and avocado toast.\n\nOver the course of 31 days, I learned new cooking skills, became better at meal-prepping, discovered amazing staple recipes, and even enjoyed meals that were tastier than what I typically order from restaurants.\n\nVisit Insider’s homepage for more stories.\n\nAlthough I cook for myself regularly, I still tend to dine out or order in several times a week – and I started to wonder what exactly would happen if I stopped.\n\nSo even though I’m not a professional chef by any means, I challenged myself to eat only home-cooked meals for 31 days.\n\nHere’s what happened when I stopped eating at restaurants and ordering takeout for an entire month.\n\nThe first week turned out to be the most challenging one\n\nAt the start of the week, I was already missing the breakfasts and lunches that I usually get from food trucks with my coworkers.\n\nInstead of indulging in those grab-and-go breakfasts, I decided to make a large batch of homemade whole-wheat banana-chocolate-chip muffins, which I shared with some of my colleagues.\n\nEven though stepping out of the office for a meal is nice, it also felt meaningful to share something I made from scratch with friends. In a way, it also felt healthier to start my mornings with something I made because I knew which ingredients were in it.\n\nI kept the leftover muffins stored in the freezer and I ended up having enough to last me for two weeks’ worth of meals – this was a huge meal-prepping success for me and I was excited to have so many ready-made breakfasts.\n\nThroughout the week I opted for simple lunches that I could throw together quickly and bring to work. For the first week, I chose to eat salads consisting of spinach, mozzarella, olives, sun-dried tomatoes, salt, pepper, balsamic vinegar, and croutons (which I made from stale sourdough bread).\n\ncaption I even made the croutons myself. source Paige Bennett\n\nThis was pretty delicious for a few days, but I learned by the end of the week that I would need to switch up my daily lunches for the rest of the month or else my taste buds would get bored.\n\nMy dinners were more imaginative. During this week, I tested some black-bean pasta that I paired with homemade tomato sauce and the same salad I had for lunch. It was filling and I found that making a flavorful tomato sauce was about as easy as buying a jar of it from the grocery store.\n\nOne of my favorite meals of the week (and the entire month) was a completely serendipitous combination of a veggie patty with cheese and tomatoes and a sauce I whipped up with Greek-yogurt, ranch dressing, and buffalo sauce.\n\ncaption The vegetables didn’t go to waste! source Paige Bennett\n\nThe true stars of the meal, though, were the baked veggie fries that I was able to make using green beans, bell peppers, and zucchini that were on their way to going bad.\n\nThis meal was so delicious and I was glad I could reduce my food waste by using up my withering veggies in a way I had never thought of.\n\nI had a balance of easy meals and more involved recipes for the second week\n\nI knew that I would need to keep basic ingredients and recipes in mind as the experiment went on because I would be swamped with work and have little time to cook.\n\nFortunately, my breakfasts were already taken care of because of my frozen stash of banana-chocolate-chip muffins. Unfortunately, I ended up ill this week and skipped lunches for a few days because I felt terrible.\n\nOnce I was well again, I enjoyed some pinwheels made with whole-wheat wraps, vegan cream cheese, sun-dried tomatoes, basil, and spinach for lunch.\n\nOne of my staple meals of week two was avocado toast since I was able to concoct this quickly after my day job and before spending an evening writing.\n\nPlus, it kept me satisfied for hours. There were no bells and whistles here: just toasted sourdough bread, avocado, sea salt, pepper, and pepper flakes for a little heat.\n\ncaption Avocado toast is filling and easy. source Paige Bennett\n\nAt the end of the week, friends invited me out for dinner and drinks. Even though I wanted to get out of my apartment and spend time with them, I knew I needed to stick to my goal.\n\nSo, before I headed out, I made my own meal. I made a cheesy “tuna” pasta with whole-wheat bow-tie noodles, cheese, plant-based tuna, and peas.\n\nThis was another delicious dish that was quick and simple to throw together and it ended up becoming a staple meal I’d make again and again after the challenge ended.\n\nBy the time I got to the restaurant, I opted for one beer and plenty of water. I was a little bummed that I wasn’t enjoying some of the delicious-looking food that my friends ordered, but it was still nice to join them without breaking my commitment to this challenge.\n\nI was really into a groove by the third week and I felt confident testing out some new cooking and baking skills\n\nTo start the third week of the challenge, my partner and I decided to spend Sunday meal-prepping food for the days ahead. I wanted to make some Greek-style salads for my lunches and he wanted to try his hand at making homemade pita – a perfect match!\n\nFirst, I got to work filling containers with spinach, banana peppers, feta, falafel, and tomatoes. I also made a dressing by blending together Greek yogurt, dried dill, salt, and pepper.\n\nThen, we made our pitas. My partner handled mixing and rolling out the dough while I was in charge of keeping the pan at the right temperature, oiling the dough, and flipping and removing the pita when it had the ideal amount of browned bubbly spots.\n\ncaption Making pita was easier than I thought it would be. source Paige Bennett\n\nI cut some of the pitas up to use in my salads and we stored the rest in the freezer to use through the next couple of weeks. The pitas were really flavorful and they were so much cheaper than what we buy at the store.\n\ncaption I prepared salads to help me get through the week. source Paige Bennett\n\nNext up, I made a batch of whole-wheat lemon-blueberry muffins to eat for the final two weeks of the assignment. These ended up being even tastier than the banana-chocolate-chip variety.\n\nI made them using whole-wheat flour, Greek yogurt, and fresh fruit. Just one muffin kept me full and energized until lunch.\n\ncaption Muffins became a breakfast staple throughout the month. source Paige Bennett\n\nOf course, at the end of a long day spent cooking and working, I was ready for a quick dinner – grilled cheese. Although it wasn’t exactly healthy, it did make me happy and was a cheap alternative to ordering something for delivery.\n\ncaption Grilled cheese is so easy to make. source Paige Bennett\n\nWith breakfasts and lunches prepared for the third week, I chose to make quick dinners that were different from recipes I normally try.\n\nOne night, I roasted a tray of zucchini, onions, and mushrooms in the oven. I used that to fill tacos topped with shredded cheese and tomato. This was another one of my favorite meals from the challenge and I made it a few more times throughout the month.\n\ncaption The tacos didn’t take long to prepare at all. source Paige Bennett\n\nAnother night, I made whole-wheat pasta and plant-based “meatballs” tossed in a pink sauce, plus a side of sauteéd okra. Although this only took about 20 minutes to prepare, it was yummy and a nice change of pace from the normal tomato or cheese sauces that I frequently pair with pasta.\n\nFor lunch, I once again had a simple but satisfying meal. I topped some naan I had in the freezer with plant-based bacon, tomatoes, spinach, and cheese. After it came out of the oven, I drizzled it with Greek-yogurt ranch dressing.\n\ncaption My creation was delicious and super simple to make. source Paige Bennett\n\nThen, for dinner, my partner decided to make a hearty meal of steak and homemade mashed potatoes. I don’t eat meat, but I did have a hankering for gravy to pair with the potatoes and I also really wanted some peas and lima beans, so I made a grocery run.\n\nFor dinner, I ate a big plate of lima beans, peas, mashed potatoes, and an unbelievably savory mushroom gravy that I cannot wait to make on repeat this fall and winter.\n\ncaption I was able to satisfy my cravings without ordering take-out. source Paige Bennett\n\nIt’s a bit of a weird choice, but I was really proud of myself for hitting the grocery store to satisfy my cravings instead of ordering food.\n\nThe best part of the fourth week was a home-cooked brunch that rivaled what I usually get at restaurants\n\nI hadn’t had a brunch during this experiment and I really wanted to try to recreate the fun of this late-morning weekend meal at home.\n\nFortunately, my partner came to the rescue with an unbelievable Dutch baby (basically a big, puffy pancake baked in a cast-iron skillet) made with fresh peaches from our local farmer’s market.\n\ncaption My partner made this using fresh peaches. source Paige Bennett\n\nI still had this week’s breakfasts covered with the lemon-blueberry muffins and I decided to take dinner leftovers for lunch.\n\nFor my lunches and dinners, I did another round of the roasted-vegetable tacos from week three and I also had a bowl of rice and vegetables.\n\ncaption Some of my meals were simpler than others. source Paige Bennett\n\nOn a particularly lazy night, I went with my staple grilled-cheese sandwich with a side of tomato soup and okra, which I try to eat as much of as possible while it is in season.\n\nBut another superstar of week four and probably the entire month was the plum cake I whipped up when I was craving something sweet.\n\ncaption I was so proud of my baking skills. source Paige Bennett\n\nWith a rare night free from editing or writing duties, I decided to make a spice cake topped with fresh plums. Of course, this tasted delicious, but also it was just a gorgeous dessert.\n\nI snapped about 30 pictures of it, which I proudly showed to my coworkers the next day.\n\nI felt really accomplished during the final days of the challenge – I took away some sharpened cooking skills, saved money, and had a great experience\n\nBy the last few days of this challenge, I really found my groove. My dinners at this point were quick and delicious – roasted veggies, a plant-based protein, and pasta or rice.\n\nThis week, I also made some whole-wheat peach muffins, to carry me through the end of the assignment and beyond – muffins have now become my standard breakfast of choice for busy days.\n\ncaption Once again, I made a bunch of muffins. source Paige Bennett\n\nAlthough I certainly chose to make a lot of simple dishes, I still was impressed that I never caved during this month of eating at home. Even when my friends hit the food trucks for lunch or I was invited to dinner and drinks, I did not waver.\n\nPlus, I felt energized and even a bit healthier from eating so many fresh, local fruits and vegetables and I learned how to make quick meals that are far easier and honestly more delicious than ordering take-out.\n\ncaption By the end of the month, I felt pretty confident in my cooking abilities. source Paige Bennett\n\nI have always enjoyed cooking and I am not one to shy away from experimenting with new recipes, but I felt that my baking skills seriously improved during this challenge.\n\nI can make muffins in a flash and I now know how to make a show-stopping cake for any occasion. If I want pita, I am confident I can make a batch at home rather than overspending on a less flavorful package of pita at the grocery.\n\nPerhaps one of the biggest perks of eating at home this much is that I saved money to start putting toward more exciting things than mediocre delivery food, like a vacation.\n\nBut most importantly, I gained more confidence in the kitchen and I made great use of and found a deep appreciation for summer’s bountiful produce, which I will miss when citrus and squash become overbearing in the winter.", "description": "Business Insider - For a month, I avoided ordering take-out and going to restaurants so I could cut back on my spending and get better at meal-prepping.. Read more at businessinsider.sg", "authors": ["Paige Bennett"], "top_image": "https://static.businessinsider.sg/sites/2/2019/08/5d6560326f24eb00d70c2a22.jpg"}