{"pub": "breitbart", "url": "https://breitbart.com/local/2019/10/06/mom-arrested-after-she-allegedly-traded-toddler-used-car", "downloaded_at": "2019-10-07 20:08:10.055711+00:00", "title": "Mom Arrested After She Allegedly Traded Toddler for Used Car", "language": "en", "text": "A mother in Thomasville, North Carolina, was arrested Wednesday along with two other individuals after she allegedly traded her toddler for their used vehicle.\n\nReports said 45-year old Alice Leann Todd allegedly exchanged her then 1-year-old child with Tina Marie Chavis, 47, and Vicenio Mendoza Romero, 53, for their 1992 Plymouth Laser in 2018.\n\nOn July 23, police responded to a call regarding a toddler who was brought into the Wake Forest Baptist Health’s High Point Medical Center with bruising.\n\nReports said Chavis, who took the child to the hospital, originally claimed she was child’s mother but changed her story and said she was its adoptive parent. However, police said the woman had no documents to back up her claim.\n\nThe child was then given to a family member while police searched for Todd, the child’s biological mother, according to the Charlotte Observer.\n\nOnce investigators were able to locate her, they determined that Chavis and Romero had traded their vehicle for the child last year.\n\n“The three have been charged with the unlawful sale, surrender or purchase of a minor and are currently being held on $50,000 bonds at the Davidson County Jail,” according to KSHB Kansas City.\n\nCapt. Brad Saintsing with the Thomasville Police Department said Thursday that the department is still investigating the case and that more charges could be brought.\n\nThe three suspects are due to appear in court on October 21.\n\nIn August of 2012, a similar instance occurred when a man in Orange Park, Florida, went door-to-door at a motel, allegedly trying to trade a baby for food.\n\n“Orange Park police were trying to identify the man, who was picked up by a taxi at a McDonald’s between 10 p.m. and 11 p.m. on Saturday, but there is no record of any taxis picking them up,” according to NBC Miami.\n\nAuthorities said the man and baby were seen with a woman but the relationship between them was unknown.", "description": "A mother North Carolina, was arrested Wednesday along with two other individuals after she allegedly traded her toddler for their used car.", "authors": ["Amy Furr"], "top_image": "https://media.breitbart.com/media/2019/10/Alice-Leann-Todd-640x335.png", "published_at": "2019-10-06"}