{"pub": "fox", "url": "https://foxnews.com/entertainment/alec-baldwin-saturday-night-live-trump-role", "downloaded_at": "2019-09-07 02:12:32.453241+00:00", "title": "Alec Baldwin hated playing Trump on SNL, says he hoped 'a meteor hits this building and kills me'", "language": "en", "text": "Alec Baldwin said he despised playing President Donald Trump on “Saturday Night Live.”\n\nThe 61-year-old actor previously said he was “so done” with playing the role after taking up the mantle of the sketch series’ go-to presidential impersonator in the 2016-2017 season. Now, on the cusp of the show’s 45th season premiere, he explained that he has very little desire to keep doing his over-the-top portrayal of Trump.\n\nALEC BALDWIN REVEALS HE AND WIFE, HILARIA, WILL ‘HAVE A FIFTH’ BABY TOGETHER\n\n“I think every time I did Trump after the first season — the first season everybody was high, they were in a lot of pain, they were confused,” he explained in the Season 3 premiere of Kevin Nealon’s YouTube series “Hiking with Kevin.” “They thought, even if you didn’t like [Hillary Clinton], it is impossible that he would beat her. They just didn’t see that.”\n\nHe described his Emmy-winning portrayal in the first season as “fun, fun fun.”\n\n“Then, every time I did it — the second and third season I did it, I’d go into my room and I was like ‘I hope a meteor hits this building and kills me because I don’t want to do this ever again. I hate this.'”\n\nIRELAND BALDWIN POSTS CORN-Y BIKINI PIC, FANS AWAIT HER FAMOUS FAMILY'S COMMENTS\n\nBaldwin noted, however, that although he’s tired of doing the impression and believes others are tired of seeing him do it, he’ll still go out in public and get recognized by people telling him how much they liked it. That may not be enough to keep the star appearing on “Saturday Night Live.\"\n\n“What I don’t like is that I don’t think it’s doing anything,” he explained. “It’s not doing anything good or bad for him.”\n\nThe comments echo a statement he made in a June interview with USA Today, saying that it was time for him to step away from the role.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n“I can’t imagine I would do it again,” Baldwin said to the newspaper. “I just can’t. They should find somebody who wants to do it. They’re all my dear friends and I love going there, but the other thing is that I’m going to go to work this fall in a way I haven’t done in a while. My wife and I had a son a year ago, and since he was born, I’ve worked minimally because I wanted to be there for my wife and kids.\n\n\"But the party’s over this fall and I’ll be traveling,\" he said. \"SNL just crushes my weekends, and now weekends are going to become much more precious to me because that’s time with my kids.”", "description": "Actor Alec Baldwin spoke out about how much he despises playing President Donald Trump on “Saturday Night Live.”", "authors": ["Tyler Mccarthy"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/02/alec-baldwin-donald-trump-snl-saturday-night-live.jpg", "published_at": "2019-09-06"}