{"pub": "independent", "url": "https://independent.co.uk/news/world/europe/germany-shooting-synagogue-attack-latest-who-stephan-balliet-deaths-a9151776.html", "downloaded_at": "2019-10-11 13:01:11.069227+00:00", "title": "Neo-Nazi admits deadly Germany synagogue attack", "language": "en", "text": "A neo-Nazi accused of killing two people in a shooting near a synagogue in the German city of Halle has admitted to the antisemitic attack.\n\nStephan Balliet reportedly gave a detailed account of the attack, which he live-streamed after publishing a racist “manifesto” online, to a judge at Germany‘s federal court of justice.\n\nThe federal prosecutor’s office confirmed following Thursday evening’s court hearing that the 27-year-old had confessed to the crime and its antisemitic motive.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nBailliet attempted to storm a synagogue on Wednesday but was unable to break into the building. He shot dead a female passerby and a man in a Turkish kebab shop before fleeing a hijacked taxi after his homemade gun jammed.\n\nHe was arrested after crashing about 10 miles south of Halle, in central Germany.\n\nShape Created with Sketch. Germany synagogue shooting: Halle attack in photos Show all 25 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Germany synagogue shooting: Halle attack in photos 1/25 Police officers secure a synagogue in Halle. At least two people have been killed in the shootings at multiple locations in Germany AP 2/25 A man shots from a long-barreled gun ATV Studio Halle/Reuters TV 3/25 A police tank patrols at a crime scene near the Synagogue. The attack came during Yom Kippur, a Jewish religious festival that sees observers fast and pray at synagogues to atone for sins. EPA 4/25 The shooter walking in Halle ATV Studio Halle/Reuters TV 5/25 One victim's body was in the street outside the synagogue, while another victim was said to have been shot at a nearby kebab shop dpa via AP 6/25 Policemen climb over a wall close to the site of a shooting in Halle dpa/AFP/Getty 7/25 The shooting took place in the eastern German city of Halle 8/25 With the incident taking place on Humboldtstrasse, which houses a synagogue and Jewish cemetery AP 9/25 Local reports said one of the victims was killed outside a kebab shop around 600m away, where witnesses told Focus the assailant was wearing a helmet mounted with a camera, and wearing combat fatigues dpa/AFP/Getty 10/25 Police officer runs on a road in Halle dpa via AP 11/25 Police guard a crime scene EPA 12/25 Bullet casings after the shooting Reuters 13/25 Police officers block a road AP 14/25 A spokesperson for the local Jewish community told Der Spiegel that up to 80 worshippers were inside the synagogue at the time, but security measures at the synagogue's entrance \"withstood the attack\" AP 15/25 Reuters 16/25 Policemen walk through a street close to the site of a shooting dpa/AFP/Getty 17/25 dpa/AFP/Getty 18/25 Reuters 19/25 Police secure the area Reuters 20/25 A police officer walks onto the street at the scene of a fatal shooting in Halle Nonstopnews/Reuters TV 21/25 MZTV 22/25 Police block the area around the site of the shooting dpa/AFP/Getty 23/25 First responders attend to the scene Nonstopnews/Reuters TV 24/25 Police gather Reuters 25/25 Reuters 1/25 Police officers secure a synagogue in Halle. At least two people have been killed in the shootings at multiple locations in Germany AP 2/25 A man shots from a long-barreled gun ATV Studio Halle/Reuters TV 3/25 A police tank patrols at a crime scene near the Synagogue. The attack came during Yom Kippur, a Jewish religious festival that sees observers fast and pray at synagogues to atone for sins. EPA 4/25 The shooter walking in Halle ATV Studio Halle/Reuters TV 5/25 One victim's body was in the street outside the synagogue, while another victim was said to have been shot at a nearby kebab shop dpa via AP 6/25 Policemen climb over a wall close to the site of a shooting in Halle dpa/AFP/Getty 7/25 The shooting took place in the eastern German city of Halle 8/25 With the incident taking place on Humboldtstrasse, which houses a synagogue and Jewish cemetery AP 9/25 Local reports said one of the victims was killed outside a kebab shop around 600m away, where witnesses told Focus the assailant was wearing a helmet mounted with a camera, and wearing combat fatigues dpa/AFP/Getty 10/25 Police officer runs on a road in Halle dpa via AP 11/25 Police guard a crime scene EPA 12/25 Bullet casings after the shooting Reuters 13/25 Police officers block a road AP 14/25 A spokesperson for the local Jewish community told Der Spiegel that up to 80 worshippers were inside the synagogue at the time, but security measures at the synagogue's entrance \"withstood the attack\" AP 15/25 Reuters 16/25 Policemen walk through a street close to the site of a shooting dpa/AFP/Getty 17/25 dpa/AFP/Getty 18/25 Reuters 19/25 Police secure the area Reuters 20/25 A police officer walks onto the street at the scene of a fatal shooting in Halle Nonstopnews/Reuters TV 21/25 MZTV 22/25 Police block the area around the site of the shooting dpa/AFP/Getty 23/25 First responders attend to the scene Nonstopnews/Reuters TV 24/25 Police gather Reuters 25/25 Reuters\n\nBalliet has been charged with two counts of murder and the attempted murder of nine other people who were injured.\n\nHe gave an “extensive” account of the attack to an investigative judge during a court hearing which lasted for several hours on Thursday evening, according to German media reports.\n\nThe country’s chief federal prosecutor, Peter Frank, has said Balliet was motivated by “antisemitism, xenophobia and racism” and wanted to incite copycat attacks.\n\nInvestigators have seized evidence from the Halle flat he shared with his mother, including the 3D printer he is thought to have used to make the homemade weapons.\n\nIn an 11-page manifesto, containing frequent references to the gaming and online messageboard communities he seemingly frequented, Balliet outlined plans to massacre worshippers inside the synagogue on the Jewish holy day of Yom Kippur.\n\nIn footage broadcast live over streaming platform Twitch, he repeatedly called himself a “loser” for failing to break into the synagogue or kill more people.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nThe livestream stopped after Balliet dumped his helmet-mounted camera and abandoned his car while fleeing the scene of the shooting. Police found 4kg of explosives in the car.\n\nDetectives are looking to establish how Balliet was radicalised, how he obtained materials for the weapons and explosives, and whether anyone else knew of his plan to kill.\n\nIn an interview with German magazine Der Spiegel, Balliet's mother claimed he had nearly died taking drugs in his early 20s and emerged a different person.", "description": "A neo-Nazi accused of killing two people in a shooting near a synagogue in the German city of Halle has admitted to the antisemitic attack. Stephan Balliet reportedly gave a detailed account of the attack, which he live-streamed after publishing a racist “manifesto” online, to a judge at Germany‘s federal court of justice. The federal prosecutor’s office confirmed following", "authors": ["Chris Baynes"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/09/17/Germany-shooting.jpg", "published_at": "2019-10-11"}