{"pub": "nymag", "url": "https://vulture.com/2019/09/ford-v-ferrari-christian-bale-talks-in-his-real-voice.html", "downloaded_at": "2019-09-10 23:32:43.874448+00:00", "title": "Finally, a Movie With Christian Bale Talking in His Real Voice", "language": "en", "text": "Christian Bale’s version of racing legend Ken Miles in Ford v Ferrari is possibly the most British character onscreen at this year’s TIFF. Photo: Courtesy of TIFF\n\nBack in January, Christian Bale went onstage to accept the Golden Globe for Best Actor in a Comedy, and the world had a collective realization: Oh right, that’s what Christian Bale really sounds like. Though the actor was born in Wales and got his big break playing an English schoolboy abroad in Empire of the Sun, the bulk of his adult roles have seen him affect strong U.S. accents. Sure, his voice would occasionally return to Blighty in The Prestige or that leaked Terminator rant, but for the most part, when you thought of Bale, you heard Americans — his Boston squawk in The Fighter, his monotone baritone as Batman, his guttural rasp in Vice.\n\nOne of the many pleasures of James Mangold’s Ford v Ferrari, which just had its Canadian premiere at the Toronto International Film Festival, is that we’re finally getting a movie in which Christian Bale gets to talk in his acceptance-speech voice, by which I mean ’e gets tuh talk loik ’e’s playin’ de Artful Dodgah, innit? Bale stars as racing legend Ken Miles, who in the 1960s worked alongside designer Carroll Shelby (Matt Damon) to create a car for Ford that could compete with Ferrari at the famous 24 Hours of Le Mans race. Miles was born in Birmingham, but Bale mostly avoids going full Brummie. Instead, he uses the accent he employs in public appearances, though in one tender dialogue scene with his son I thought I detected a slight Welsh lilt.\n\nThe real Miles moved to L.A. in the 1950s, and the years spent away from home may have made his Englishness even more intense. The same might be true for Bale. As if to make up for spending the prime of his career playing Americans, Bale creates a version of Miles that’s possibly the most British character onscreen at this year’s TIFF, a festival that also features an actual Charles Dickens adaptation, plus Eddie Redmayne and Felicity Jones as Victorian hot-air balloonists. Except for scenes when he’s behind the wheel, Bale is almost never seen without a cup of tea in his hands. When he’s angry, he exclaims, “I don’t bloody think so!” When he wants to insult a rival, he says he’s “not batting on a full wicket.” His most frequent expression is “bloody ’ell,” which he says both in anger and astonishment. He even utters the phrase oh, be’ave. In fact, I don’t think he pronounces a single H in the entire movie.\n\nThere’s a prickliness to Miles, an impatience with authority, that feels idiomatic with a certain strain of Britishness. His conflict with the Ford executives is sparked when he dubs the new Mustang “a fookin’ terrible car,” and much of the film’s drama centers on whether he’ll be enough of a team player to please the gigantic corporation that’s signing his and Shelby’s checks. In this version of the story, it’s Damon’s good ol’ boy who’s responsible for smoothing over the cultural differences — Bale just gets to have fun, bleedin’ and bloodyin’ all over the place.\n\nFord v Ferrari will have a tough decision to make come Oscar time. Even more so than Green Book, it’s a true two-hander: The movie begins and ends with Damon, but in between Bale gets most of the red-meat scenes. Films have generally stopped running two actors in the lead-acting categories, and it seems likely one of them will eventually be bumped down to supporting. With the two men in a dead heat for screen time, I suspect the decision will ultimately come down to which category gives Bale the best chance at ending up at that podium again, giving us one more taste of that lovely accent. In the meantime, Ford v Ferrari will more than suffice.", "description": "Christian Bale’s version of racing legend Ken Miles in ‘Ford v Ferrari’ is possibly the most British character onscreen at this year’s Toronto International Film Festival.", "authors": ["Nate Jones"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/04/tiff/ford-v-ferrari.w1200.h630.jpg", "published_at": "2019-09-10"}