{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7547097/Shoppers-wild-35-coverless-John-Lewis-duvet.html", "downloaded_at": "2019-10-07 19:54:55.165459+00:00", "title": "Shoppers go wild over £35 coverless John Lewis duvet", "language": "en", "text": "Customers have praised a new coverless duvet released by John Lewis this month, which aims to reduce the time spent stripping and dressing the bed.\n\nThe washable bedding, by The Fine Bedding Company, is called the 'Night Owl Coverless Duvet' and retails at between £35 and £55, depending on whether it's single, double or king sized.\n\nAvailable in pink, grey and blue, it promises to be 'fast-drying' and is described as being 'filled with innovative, compressible fibres' making it 'easy to squeeze into the washing machine at an environmentally friendly temperature'.\n\nCustomers have praised a new coverless duvet released by John Lewis this month, which aims to reduce the time spent stripping and dressing the bed\n\nThe washable bedding, by The Fine Bedding Company, is called the 'Night Owl Coverless Duvet' and retails at between £35 and £55, depending on whether it's single, double or king sized\n\nThe description reads: 'This innovative Night Owl duvet from The Fine Bedding Company has a cosy and lightweight fibre filling and is encased in a soft-touch, printed polyester cover.\n\n'Its block colour design on both sides means that there is no need for a separate duvet cover. It's also machine washable and quick drying.'\n\nPresented in a sleeping back style cover, it is easily stored for those wishing to keep it aside for visiting guests.\n\nAnd shoppers flocked to the comments section to praise the innovative homeware.\n\nPresented in a sleeping back style cover, it is easily stored for those wishing to keep it for visiting guests\n\nAchieving an overall score of four and a half out of five stars, one happy customer wrote: 'Lovely soft smooth duvet, washes like a dream and dries quickly. Fabulous if you have a leaky child'.\n\nAnother added: 'Such a soft coverless duvet! Was very warm but also felt quite light when sleeping with it. Very easy to wash and dry and overall a really useful product!'.\n\nAnd a parent wrote: 'I got the single duvet for my son's bed, as he still has the occasional accident, so I thought it would be easier to wash and dry in one go.\n\n'I wasn't wrong, the whole duvet can be washed and dried in a couple of hours (weather dependent).'\n\nShoppers flocked to the comments section to praise the innovative homeware, adding: 'It was very nice not to have to make the extra effort to add a duvet cover, when re-making the bed.'\n\nRemarking on the dreaded task of changing the sheets, one customer wrote: 'It was very nice not to have to make the extra effort to add a duvet cover, when re-making the bed.\n\nThey added: 'Would also be great for sleepovers and camp outs as it comes in a handy draw string bag and is very light weight to carry. I would by another one for my daughter if there was a larger selection of colours.'\n\nElsewhere one said: 'Loved that this duvet was so light, cosy & dried so fast. Fluffy as a cloud - even after washing. No problem to wash, dry and get it back on the bed the same day.'\n\nAnd another concluded: 'Perfect for student sons who are not great at dressing beds! They love that it's so low maintenance. A quick shake & it looks like they actually dressed their beds! Lovely neutral print & handy bag for storage. We had the pale grey option which goes with everything.'", "description": "Customers have praised a new coverless duvet released by John Lewis this month, which aims to reduce the time spent stripping and dressing the bed.", "authors": ["Jessica Rach For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/07/18/19406366-0-image-a-38_1570468049462.jpg", "published_at": "2019-10-07"}