{"pub": "businessinsider", "url": "https://businessinsider.com/trump-suggests-white-house-staff-undergo-lie-detector-test-politico-2019-10", "downloaded_at": "2019-10-08 15:22:37.240562+00:00", "title": "Trump is reportedly so paranoid about leakers in the White House that he has discussed making his staff take lie-detector tests", "language": "en", "text": "President Donald Trump is so concerned about leakers in the White House that he has repeatedly suggested using lie-detector tests to weed them out, Politico reported Tuesday.\n\nSources told Politico that after seeing or reading reports about the inner workings of his presidency, Trump would demand that leakers be found and had put forward the idea of lie-detector tests numerous times.\n\n\"He talked about it a lot,\" a former official told the publication.\n\n\"I have been with the president since July 2015 and can say unequivocally that I have never heard suggesting polygraphs as a way to stop leaks,\" Stephanie Grisham, the White House press secretary, told Politico.\n\nTrump is facing an impeachment inquiry after a whistleblower raised concerns about his conversations with Ukraine's president.\n\nVisit Business Insider's homepage for more stories.\n\nUS President Donald Trump is so paranoid about leakers in the White House that he has repeatedly suggested that all staff members should undergo a lie-detector test, Politico reported Tuesday.\n\nFour former administration staffers told the publication that Trump had often raised the possibility of making staff members and aides take a polygraph test after news stories with leaked information about his presidency appeared.\n\nRead more: GOP lawmakers are reluctant to defend Trump on Ukraine because he's so erratic\n\n\"He talked about it a lot,\" a former official told the publication, adding that after reading and watching reports about his presidency, \"he'd be angry and ask, 'Why can't we stop these things?'\"\n\n\"He wanted to polygraph every employee in the building to unearth who it was who spoke to the press,\" another former official told Politico.\n\nThe White House did not immediately respond to a request for comment on the report.\n\nStephanie Grisham, the White House press secretary, told Politico: \"I have been with the president since July 2015 and can say unequivocally that I have never heard suggesting polygraphs as a way to stop leaks.\"\n\nTrump reportedly wants to subject staffers to lie-detector tests to weed out leaks. Jose Luis Magana/AP\n\nRead more: Trump is dragging down Biden with him as the Ukraine scandal threatens to upend his presidency\n\nInformation about the infighting and inner workings of the Trump White House has long been leaked to the media, with verbatim transcripts of phone calls with world leaders published in news reports in the early days of his presidency.\n\nThe leaks have consistently enraged the president. The number of officials patched into his phone calls with foreign heads of state was sharply reduced to cut off leaks, and details of sensitive calls have been moved to classified storage.\n\nTrump is facing an impeachment inquiry by House Democrats related to his attempt to push Ukrainian President Volodymyr Zelensky to investigate a political rival, Joe Biden, a frontrunner for the 2020 Democratic presidential nomination.\n\nTrump and Ukrainian President Volodymyr Zelensky on the sidelines of the United Nations General Assembly in September. Jonathan Ernst/Reuters\n\nTrump has denounced the person who provided information about his July 25 call with Zelensky to a whistleblower whose complaint ignited the impeachment inquiry. Trump has even said he is seeking the whistleblower's identity.\n\n\"I want to know who's the person who gave the whistleblower the information because that's close to a spy,\" Trump said in September in a closed-door meeting at the UN's headquarters in New York, according to The New York Times.\n\n\"You know what we used to do in the old days when we were smart with spies and treason, right? We used to handle it a little differently than we do now.\"", "description": "\"He wanted to polygraph every employee in the building to unearth who it was who spoke to the press,\" a former White House official told Politico.", "authors": ["Tom Porter"], "top_image": "https://image.businessinsider.com/5d9c75c8b1510247c977b6ea?width=1200&format=jpeg", "published_at": "2019-10-08"}