{"pub": "independent", "url": "https://independent.co.uk/independentpremium/bait-british-film-industry-bfi-netflix-a9123651.html", "downloaded_at": "2019-09-29 23:32:02.610646+00:00", "title": "The film that shows where the movie industry is going wrong", "language": "en", "text": "Bait is a Cornish film that has hooked critics and cinemagoers wherever it has been shown. The black and white feature tells the story of a Cornish fishing village and the tensions between residents and incomers, younger and older generations, that simmer within it. It’s both poignant and relevant. It also, however, has something to say about the film industry.\n\nDirector Mark Jenkin used clockwork cameras and 16mm film to shoot it. The sound effects and the actors’ voices were added afterwards, giving it the look of a foreign language film dubbed into English.\n\nPerhaps it’s this very uniqueness, in an era of CGI-heavy blockbusters, that put off the major chains. They were all invited to attend screenings by the British Film Institute, which is serving as the film’s distributor. They just didn’t bite.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe BFI is nonetheless delighted with its performance and the buzz it has generated. Bait has managed to sell out cinemas where it has been shown, driven by word of mouth and social media. The backing of high-profile critics such as Mark Kermode hasn’t hurt.\n\nBut even though it has become something of a sleeper success, it managed just 47 screens by its third week, having expanded from 24 in its opening week. Excluding pop-ups, Britain’s 775 cinemas boast a total of 4,340. So that’s a little over 1 per cent.\n\nShape Created with Sketch. Business news: In pictures Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Business news: In pictures 1/11 Corbyn wishes Amazon a happy birthday In a card sent to Amazon CEO Jeff Bezos on the company's 25th birthday, Labour leader Jeremy Corbyn writes: \"You owe the British people millions in taxes that pay for the public services that we all rely on. Please pay your fair share\" 2/11 No deal, no tariffs The government has announced that it would slash almost all tariffs in the event of a no-deal Brexit. Notable exceptions include cars and meat, which will see tariffs in place to protect British farmers Getty 3/11 Fingerprint payment NatWest is trialling a new bank card that will allow people to touch their hand to the card when paying rather than typing in a PIN number. The card will work by recognising the user's fingerprint NatWest/PA Wire 4/11 Mahabis bust High-end slipper retailer Mahabis has gone into administration. 2 Jan 2019 Mahabis 5/11 Costa Cola Coca-Cola has paid £3.9bn for Costa Coffee. A cafe chain is a new venture for the global soft drinks giant PA 6/11 RIP Payday Loans A funeral procession for payday loans was held in London on September 2. The future of pay day lenders is in doubt after Wonga, Britain's biggest, went into administration on August 30 PA 7/11 Musk irks investors and directors Elon Musk has concluded that Tesla will remain public. Investors and company directors were angry at Musk for tweeting unexpectedly that he was considering taking Tesla private and share prices had taken a tumble in the following weeks Getty 8/11 Jaguar warning Iconic British car maker Jaguar Land Rover warned on July 5, 2018 that a \"bad\" Brexit deal could jeopardise planned investment of more than $100 billion, upping corporate pressure as the government heads into crucial talks AFP/Getty 9/11 Spotif-IPO Spotify traded publically for the first time on the New York Stock Exchange on Tuesday. However, the company isn't issuing shares, but rather, shares held by Spotify's private investors will be sold AFP/Getty 10/11 French blue passports The deadline to award a contract to make blue British passports after Brexit has been extended by two weeks following a request by bidder De La Rue. The move comes after anger at the announcement British passports would be produced by Franco-Dutch firm Gemalto when De La Rue’s contract ends in July. The British firm said Gemalto was chosen only because it undercut the competition, but the UK company also admitted that it was not the cheapest choice in the tendering process. 11/11 Beast from the east economic impact The Beast from the East wiped £4m off of Flybe’s revenues due to flight cancellations, airport closures and delays, according to the budget airline’s estimates. Flybe said it cancelled 994 flights in the three months to 31 March, compared to 372 in the same period last year. 1/11 Corbyn wishes Amazon a happy birthday In a card sent to Amazon CEO Jeff Bezos on the company's 25th birthday, Labour leader Jeremy Corbyn writes: \"You owe the British people millions in taxes that pay for the public services that we all rely on. Please pay your fair share\" 2/11 No deal, no tariffs The government has announced that it would slash almost all tariffs in the event of a no-deal Brexit. Notable exceptions include cars and meat, which will see tariffs in place to protect British farmers Getty 3/11 Fingerprint payment NatWest is trialling a new bank card that will allow people to touch their hand to the card when paying rather than typing in a PIN number. The card will work by recognising the user's fingerprint NatWest/PA Wire 4/11 Mahabis bust High-end slipper retailer Mahabis has gone into administration. 2 Jan 2019 Mahabis 5/11 Costa Cola Coca-Cola has paid £3.9bn for Costa Coffee. A cafe chain is a new venture for the global soft drinks giant PA 6/11 RIP Payday Loans A funeral procession for payday loans was held in London on September 2. The future of pay day lenders is in doubt after Wonga, Britain's biggest, went into administration on August 30 PA 7/11 Musk irks investors and directors Elon Musk has concluded that Tesla will remain public. Investors and company directors were angry at Musk for tweeting unexpectedly that he was considering taking Tesla private and share prices had taken a tumble in the following weeks Getty 8/11 Jaguar warning Iconic British car maker Jaguar Land Rover warned on July 5, 2018 that a \"bad\" Brexit deal could jeopardise planned investment of more than $100 billion, upping corporate pressure as the government heads into crucial talks AFP/Getty 9/11 Spotif-IPO Spotify traded publically for the first time on the New York Stock Exchange on Tuesday. However, the company isn't issuing shares, but rather, shares held by Spotify's private investors will be sold AFP/Getty 10/11 French blue passports The deadline to award a contract to make blue British passports after Brexit has been extended by two weeks following a request by bidder De La Rue. The move comes after anger at the announcement British passports would be produced by Franco-Dutch firm Gemalto when De La Rue’s contract ends in July. The British firm said Gemalto was chosen only because it undercut the competition, but the UK company also admitted that it was not the cheapest choice in the tendering process. 11/11 Beast from the east economic impact The Beast from the East wiped £4m off of Flybe’s revenues due to flight cancellations, airport closures and delays, according to the budget airline’s estimates. Flybe said it cancelled 994 flights in the three months to 31 March, compared to 372 in the same period last year.\n\nOf course, a film like this is never going to have the appeal of a big-budget spectacular. It’s a small and intimate tale, although towards the end the tension is cranked up to thriller-like levels.\n\nBut it isn’t a difficult one. Notwithstanding its unusual look and feel, this isn’t one of those art-house movies people think they have to sing the praises of while privately wondering what they were watching and wishing they’d been to see the Avengers instead.\n\nMultiplexes are there to make money, so of course they will show what they think people want to watch. But Bait’s results on the screens it has graced, and the (justified) acclaim it has garnered from those lucky enough to see it, suggest those responsible for what gets into cinemas may be guilty of missing a trick.\n\nThis brings us to the heated debate that took place over another small, intimate, black and white film, this one with subtitles to boot. Roma was also seen on only a limited number of screens. It nonetheless got a very wide audience thanks to its ownership by Netflix.\n\nThe streaming giant’s dollars, an A-list director in the form of Alfonso Cuaron, and the same sort of rapturous critical reception Bait has achieved helped the film to 10 Oscar nominations and three wins. It was criminally cheated of the Best Film gong by Green Book.\n\nPart of the reason might have been the controversy it generated within the industry. Netflix refused cinema chains their cherished 90-day window of exclusivity, so it was shunned with just a small number of exceptions.\n\nThis irked a number of powerful film industry figures, including no less than Steven Spielberg, who said he felt it should have been classified as a “made for TV movie” and made ineligible for the awards.\n\nThe flip side is that Netflix did at least ensure Roma got seen by those without easy access to an art house or independent theatre willing to give it a run.\n\nIt’s true that competition for cinema space is fierce. There were 503 releases in 2008 but 787 in 2018. It’s also true that Britain’s big chains will sometimes take a shot on smaller films when there’s a gap between Disney/Marvel releases or big-name movies from the box office kingpin’s rivals.\n\nMy local showcase, for example, screened Dirty God, another small film produced in Britain, which tells the story of the survivor of an acid attack.\n\nBut there’s been no Bait to hook its customers. At least not yet. And that’s a shame.\n\nIts absence from multiplexes serves to strengthen the hand of those who argue that Netflix is democratising cinema by helping to get films seen that might otherwise get lost.\n\nIn the meantime, the BFI is planning to offer up Bait via its own streaming service. For now, its website offers a list of cinemas where the film is showing.\n\nIf you like interesting and original movies, hell, if you just like movies, it would be worth your perusing it. The more money this film makes, the wider the audience it will get. And an audience is what it deserves.", "description": "Bait is a Cornish film that has hooked critics and cinemagoers wherever it has been shown. The black and white feature tells the story of a Cornish fishing village and the tensions between residents and incomers, younger and older generations, that simmer within it. It’s both poignant and relevant. It also, however, has something to say about the film industry.", "authors": ["James Moore"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/29/12/bait.jpg", "published_at": "2019-09-29"}