{"pub": "atlantic", "url": "https://theatlantic.com/ideas/archive/2019/10/nba-must-choose-its-own-values-over-chinas/599626", "downloaded_at": "2019-10-09 00:20:48.256246+00:00", "title": "The NBA Is Going to Have to Choose", "language": "en", "text": "But criticizing China is a different story. As a result of Morey’s tweet, the Rockets—who have been highly visible in China ever since they drafted the Chinese basketball legend Yao Ming in 2002 —lost many of their sponsors from China and are banned from being shown in the country. The Chinese Basketball Association, the high-profile league that Yao now leads, is suspending its relationship with the Rockets. Morey has since backpedaled. For the NBA, smoothing things over with Chinese officials means capitulating in a way that compromises the values it regularly espouses—values that have endeared the league to many of its fans in America.\n\nThe league put out an abject statement on Sunday that read: “We recognize that the views expressed by Houston Rockets general manager Daryl Morey have deeply offended many of our friends and fans in China, which is regrettable. While Daryl has made it clear that his tweet does not represent the Rockets or the NBA, the values of the league support individuals’ educating themselves and sharing their views on matters important to them. We have great respect for the history and culture of China and hope that sports and the NBA can be used as a unifying force to bridge cultural divides and bring people together.”\n\nSeveral notable politicians, including some presidential candidates, took to social media to criticize the NBA for its response. Senator Ted Cruz, a Republican from Texas, tweeted his support for Morey, and the Democratic presidential candidate Elizabeth Warren accused the NBA of choosing “its pocketbook over its principles.”\n\nIt’s not a coincidence that some Republican politicians, such as Senator Marco Rubio of Florida, delight in pouncing on the NBA. While NFL executives lived in fear that Kaepernick’s protests would offend conservative white fans and conservative white owners, pro basketball didn’t seem to mind taking sides on political issues. Since Trump has been in office, not one NBA team has taken the customary trip to the White House to commemorate winning a league championship.\n\nBut Rubio and others are right about this: It’s much harder to stand on principle when that principle interferes with business relationships worth billions of dollars. The NBA recently signed a five-year extension, reportedly valued at $1.5 billion, with the China-based digital giant Tencent Holdings, which now won’t be including the Rockets as part of its coverage. NBA players have found China to be fertile financial ground. Several NBA stars, including James, Kobe Bryant, Steph Curry, and the Rockets guard James Harden regularly visit China to promote their merchandise and pad their pockets. Players, including the recently retired superstar Dwyane Wade, also have signed lucrative shoe deals with Chinese brands. Likely wanting to protect his own business interests in China, Harden did not stand with his GM. He apologized to Chinese citizens following a team practice in Tokyo, where the Rockets are playing preseason games.", "description": "Pro basketball was a progressive beacon, allowing players and coaches to speak their mind freely. And then China got involved.", "authors": ["Jemele Hill", "Staff Writer For"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/RTSRGBA-1/facebook.jpg?1570551225", "published_at": "2019-10-08"}