{"pub": "fox", "url": "https://foxnews.com/us/amber-alert-alabama-abducted-birthday-party", "downloaded_at": "2019-10-13 18:39:26.820773+00:00", "title": "Amber Alert in Alabama for girl, 3, abducted at birthday party", "language": "en", "text": "An Amber Alert was issued in Alabama after a 3-year-old girl attending a birthday party was snatched off the street.\n\nAuthorities said Kamille “Cupcake” McKinney was kidnapped Saturday evening in Birmingham by a man and a woman who may have been strangers to the child. The Amber Alert said the little girl was “believed to be in extreme danger.”\n\n“An abduction like this, a child just being taken off the street, is in no way common to the city of Birmingham,’’ said Birmingham Police Deputy Chief Scott Praytor, according to the Birmingham News. “We’re trying to make sure we get this child back to her family.”\n\nPolice don’t believe the kidnapping involved a custodial issue, according to the paper. Kamille's mother and father and extended family members were on the scene.\n\nCANADIAN MAN TRYING TO REST CALLS 911 TO COMPLAIN ABOUT AMBER ALERT\n\nNORTH CAROLINA WOMAN ARRESTED IN KIDNAPPING OF GIRL, 3, FOUND ALIVE AT CHURCH\n\nKamille was outside playing with other children when she was abducted. Police responded to Tom Brown Village, a public housing project, after the kidnapping, around 8:30 p.m.\n\nA man and a woman in an SUV were said to have driven away with the girl after the man got out and grabbed Kamille, the paper reported. The witness was an 11-year-old boy.\n\nThe SUV could have been a Toyota 4-Runner with rims and a “peanut butter brown” protruding bumper, the paper reported.\n\n“Nothing brings a city together like the welfare of a child,” Praytor told the News. “And if you look at this child, and the smile on this child’s face…this should bring the whole city together to help us find this child.”\n\nCLICK TO VISIT THE ALL-NEW FOXBUSINESS.COM\n\nHe added, “It’s imperative that we find this child.”", "description": "An Amber Alert was issued in Alabama after a 3-year-old girl attending a birthday party was snatched off the street.", "authors": ["Robert Gearty"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/kamilla.jpg", "published_at": "2019-10-13"}