{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7573225/Dora-Lost-City-Golds-Isabela-Moner-changes-honor-late-grandmother.html", "downloaded_at": "2019-10-15 02:17:32.994209+00:00", "title": "Dora And The Lost City Of Gold's Isabela Moner changes her name to honor her late grandmother", "language": "en", "text": "She charmed audiences and revived the Dora The Explore franchise with her live-action film adaptation released this summer.\n\nNow Isabela Moner is showing off her selfless side with a new last name to honor her late grandmother, Yolanda Merced Salazar Pittman.\n\nThe 18–year–old actress and singer announced that she'll be going by Isabela Merced from now on in an interview with Refinery29 published Monday.\n\nNew name: Isabela Moner, 18, revealed that she's changing her name to Isabela Merced to honor her late grandmother, according to a Refinery29 interview published Monday; shown October 7\n\n'Although Isabela Moner was my given name, Isabela Merced tells my story and my future,' she told the outlet via email.\n\nThe announcement came shortly before the Sicario: Day Of The Soldado actress was set to release a new single, Papi, on Friday, October 25.\n\nIsabela chose the new professional name as way to write her own 'story.'\n\n'This has been a very difficult year for my brothers, mom, and me. This is how I say goodbye to that and welcome a new chapter with those who are close to me,' she explained.\n\n'Isabela Merced represents everything that has and will continue to define me. It represents the values that were passed on from my grandmother.'\n\nNew story: Isabela made the announcement shortly before the release of her new bilingual single Papi on October 25\n\nHonoring her: 'Isabela Merced represents everything that has and will continue to define me. It represents the values that were passed on from my grandmother'; pictured in August\n\nIsabela described her grandmother as an essential part of her extended family.\n\n'She was a force of nature, unafraid of anything, always ready to take on every challenge and person that said she couldn’t. At the same time, she loved her familia; nothing came before that.'\n\nIt wasn't just her philosophy about life that inspired the rising star — they also shared similar personalities and tastes.\n\n'Her ideal day would be a day at the beach with the family, music, dancing, and eating alitas [chicken wings] or ceviche. This is me! I hope this continues on my grandmother’s legacy because she left us too soon.'\n\nWhat really matters: '[My grandmother] was a force of nature, unafraid of anything, always ready to take on every challenge and person that said she couldn’t. At the same time, she loved her familia; nothing came before that'; still from Dora And The Lost City Of Gold\n\nThough the Instant Family star feels a kinship with her grandmother, Isabela never actually met her, as she died when her mother was only 15.\n\n'My mother and I had emotional moments talking about her mom because she died when my mom was so young. My grandmother was the one who got my mother to the United States, and the reason that my mom had the opportunities that so many people do not have.\n\n'My grandmother sacrificed a lot for her daughters to live out the American dream she had for them,' she said.\n\nSame person: 'Her ideal day would be a day at the beach with the family, music, dancing, and eating [chicken wings] or ceviche . This is me! I hope this continues on my grandmother’s legacy because she left us too soon'; pictured in 2018\n\nThough she never met her, Isabela confessed that she though her grandmother's presence could be felt beyond the grave as her mother's guardian angel.\n\n'I hope that my fans learn to always respect the people who came before them — the people who got them to where they are. Because it's not a one-person thing. It is not \"I made it here by myself, I don't need anybody else.\"'\n\nDespite the impact of the life-altering decision, Isabela left most of her family members in the dark prior to her announcement, but she hopes her family back in Peru will appreciate the move.\n\nSocially conscious: Isabela said the track is a stand against toxic masculinity and womanizing men; still from Dora And The Lost City Of Gold\n\nThe actress and singer called her new track Papi a 'bop,' and revealed that the infectious song will feature lyrics in both English and Spanish.\n\nThough it's in the guise of a standard pop song, it takes a stand against toxic masculinity.\n\n'Something that is exciting about Papi is that the guy whom this song refers to will hear it. He — and other womanizing men — will hopefully get the message and treat ladies with the respect they deserve.'", "description": "Isabela Moner revealed in an interview Monday that she'll now be going by Isabela Merced, adopting the name of her Peruvian grandmother. Despite the honor, her abuela died before she was born.", "authors": ["Brian Marks For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/00/19716598-0-image-a-40_1571096914463.jpg", "published_at": "2019-10-15"}