{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/25/pbs-and-politico-to-host-sixth-2020-democrat-debate-in-los-angeles", "downloaded_at": "2019-10-25 22:11:56.939716+00:00", "title": "PBS and Politico to Host Sixth 2020 Democrat Debate in Los Angeles", "language": "en", "text": "PBS and Politico will team up to co-host the sixth 2020 Democrat presidential primary debate in Los Angeles in December, according to NBC News.\n\nThe debate’s moderators, exact date, and location are still unknown, per the news outlet. The report comes as the Democrat National Committee tightened the polling and fundraising requirements for the winter debate. According to Politico, “candidates must receive 4 percent support in at least four DNC-approved polls of primary voters nationally or in early-voting states (Iowa, New Hampshire, Nevada or South Carolina) — or, instead, they can qualify by hitting 6 percent in two approved early-state polls.” Further, White House contenders are required to have 200,000 unique donors and at least 800 donors in 20 states, the District of Columbia, or other U.S. territories.\n\nThe tighter debate requirements will put pressure on struggling and middle-tier candidates to boost their approval ratings and fundraising efforts. Based on Politico’s presidential tracker, former Vice President Joe Biden, Sen. Bernie Sanders (I-VT) and Sens. Elizabeth Warren (D-MA) have already qualified for the sixth debate.\n\nFormer Rep. Robert Francis “Beto” O’Rourke and technology entrepreneur Andrew Yang said they have met the donor thresholds for the December event.\n\nThe debate’s qualification deadline is December 12th.", "description": "PBS and Politico will team up to co-host the sixth Democrat presidential primary debate in Los Angeles in December, according to a report.", "authors": ["Joshua Caplan"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1181314032-640x335.jpg", "published_at": "2019-10-25"}