{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3069313&cloc=joongangdaily|home|online", "downloaded_at": "2019-10-22 13:21:15.049097+00:00", "title": "Louvre honors Leonardo, 500 years after death", "language": "en", "text": "“The Last Supper” by Leonardo da Vinci displayed at the Louvre on Sunday in Paris. A unique group of artworks is on display, in addition to its collection of paintings and drawings by the Italian master. The exhibition opens on Oct. 24. [AP/YONHAP]\n\nMuch about Leonardo da Vinci remains an enigma - the smile of the “Mona Lisa,” why the world’s most famous painter left so many works unfinished, and more recently, who bought the contentious “Salvator Mundi.”A new exhibit at the Louvre, however, opening Thursday and marking the 500th anniversary of the Italian master’s death, tries to sketch out as complete a picture of the artist and thinker as possible.Drawing from the Louvre’s permanent collection and institutions around the world, the exhibit brings together some 160 works. They include Leonardo’s masterpieces, dozens of studies and scientific sketches, and pieces by other artists in Leonardo’s orbit. Visitors can also experience a virtual reality portion of the exhibit that delves into the story behind the “Mona Lisa.’’“We wished, in order to pay homage to the artist, to be able to show the entirety of Leonardo da Vinci’s career and his development and to explain, ultimately, the sense of his life,’’ curator Vincent Delieuvin told The Associated Press.The exhibit runs through Feb. 24, 2020. Visitors must reserve tickets online in advance, and the Louvre said it has already pre-sold 220,000 tickets as of Monday morning.More than 10 years in the making, the project began when Louis Frank, the exhibit’s other curator, translated a Renaissance-era biography on the painter to round out existing knowledge about the artist’s life. That biographical emphasis is evident in the exhibit’s design, which traces the artist’s trajectory from his apprenticeship with Florentine sculptor Andrea del Verocchio to his death in France in 1519.With a whole room devoted to his scientific pursuits, it seeks to capture the quest for knowledge and perfection of a man Delieuvin called “a universal genius.’’“Leonardo da Vinci, he is one of those rare men, those personalities who fascinate us, because he was universal,’’ Delieuvin said. “He had an interest in all aspects of nature, we all see ourselves in his personality.’’Several of Leonardo’s completed paintings will be on display, including “La Belle Ferronniere’’ and “The Virgin and Child with Saint Anne.’’ The “Mona Lisa’’ will remain in its case, upstairs. Visitors will be able to see “Portrait of a Musician’’ on loan from the Vatican and “Benois Madonna’’ from St. Petersburg, among other works the Louvre borrowed for the occasion.Some pieces proved more difficult to obtain. The “Vitruvian Man,’’ Leonardo’s famous drawing of the ideally proportioned male figure, arrived in France from Venice’s Accademia Gallery only days before the exhibit’s opening.Italian heritage group Our Italy tried to block the loan, saying the drawing was too fragile to be moved. An Italian court originally suspended the loan before ruling last week that it could travel to France for eight weeks. In exchange, the Louvre will lend several works by Raphael to Rome next yearAP", "description": "", "authors": [], "top_image": "https://pds.joins.com/jmnet/koreajoongangdaily/_data/photo/2019/10/22185507.jpg", "published_at": "2019-10-22"}