{"pub": "reuters", "url": "https://ca.reuters.com/article/topNews/idCAKCN1VY027-OCATP", "downloaded_at": "2019-09-13 01:10:11.331971+00:00", "title": "Asian shares advance on U.S.-China trade hopes, ECB stimulus", "language": "en", "text": "TOKYO (Reuters) - Asian stocks advanced on Friday as hints of progress in the U.S.-China trade dispute and aggressive stimulus from the European Central Bank helped to counter worries about a global economic slowdown.\n\nFILE PHOTO: A man points out an electronic board showing the Nikkei stock index outside a brokerage in Tokyo, Japan, May 14, 2019. REUTERS/Kim Kyung-hoon\n\nMSCI’s broadest index of Asia-Pacific shares outside Japan ticked up 0.2%, while Japan’s Nikkei rose 0.4%.\n\nSentiment was also supported by U.S. President Donald Trump’s announcement that his administration would unveil a tax overhaul plan aimed at middle-income households next year.\n\n“Risk assets should find further support from accommodative policies, which are set to remain in vogue for some time, and not just in Europe as seen in the global easing trend,” said Esty Dwek, head of global market strategy at Natixis.\n\n“Nonetheless, we believe that trade uncertainty and growth concerns will not vanish, so any reprieve on either subject will be welcome. We also believe that some earnings growth will be needed for equities to grind higher,” she said.\n\nAlthough conflicting reports on Thursday about whether Trump administration officials had considered offering a limited trade deal to China made U.S. markets choppy, investors overall were sticking to hopes of more progress in upcoming talks.\n\nThe United States on Thursday welcomed China’s renewed purchases of U.S. farm goods while maintaining the threat of U.S. tariff hikes as the world’s two largest economies prepared the ground for talks aimed at breaking the logjam in their trade war.\n\nTrump said he preferred a comprehensive trade deal with China but did not rule out the possibility of an interim pact, even as he said an “easy” agreement would not be possible.\n\nMost economists in a new Reuters poll believed the trade dispute will worsen or at best stay the same over the coming year.\n\nThe U.S. S&P 500 closed within striking distance of its all-time closing high, rising 0.29% to 3,009.57, near record closing high of 3,024.50 marked in late July.[.N]\n\nPhiladelphia semiconductor shares index hit an all-time high while MSCI ACWI also came near this year’s high after seven straight days of gains by Thursday.\n\nThe European Central Bank delivered bigger-than-expected stimulus, cutting interest rates by 0.10 percentage point to minus 0.50 percent, promising that rates would stay low for longer and restarting bond purchases of 20 billion euros a month from November.\n\nThe resumption of quantitative easing had been seen as a close call and helped to boost risk assets.\n\nBut the euro quickly lost steam and European bond yields also rose as profit-taking set in.\n\nECB President Mario Draghi stepped up his rhetoric in calling for governments to spend their way out of a slowdown, highlighting the limitations of monetary policy and also fanning expectations of fiscal spending down the road.\n\nThe euro stood at $1.10615, having risen 0.5 percent on Thursday and staying near two-week high of $1.10875 hit in U.S. trade.\n\nRising risk appetite pushed the yen down to 108.15 yen per dollar. It hit a six-week low of 108.19 on Thursday.\n\nThe 10-year German Bund yields also rose back to minus 0.521%.\n\nThat also helped to lift the yield on 10-year U.S. Treasuries to as high as 1.081 percent, its highest level since early August.\n\nFed funds rate futures <0#FF:> price in an interest rate cut of 0.25 percentage point by the Fed next week but have effectively priced out any chance of a larger cut.\n\nThe Fed will announce its policy on Wednesday, followed by the Bank of Japan (BOJ) on Thursday.\n\nSources told Reuters the BOJ is leaning towards standing pat next week if markets are calm, but is brainstorming ways to deepen negative interest rates at minimal cost.\n\n“I think a rally in stock prices will run out of steam soon. It’s typical buy-on-rumor-sell-on-fact trade on central bank stimulus and will be over by the Fed and the BOJ’s meetings,” said Tatsushi Maeno, senior strategist at Okasan Asset Management.\n\n“People also seem to think there will be a deal between China and the States soon but you never know when suddenly Trump do about-face. We just saw that in May and August,” he added.\n\nOil prices were softer as a meeting of the OPEC+ alliance yielded no decision on deepening crude supply cuts.\n\nBrent crude futures fell 0.2% to $60.29 a barrel while U.S. West Texas Intermediate (WTI) crude lost 0.2% to $54.96.", "description": "Asian stocks advanced on Friday as hints of progress in the U.S.-China trade dispute and aggressive stimulus from the European Central Bank helped to counter worries about a global economic slowdown.", "authors": ["Hideyuki Sano", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190913&t=2&i=1429256781&w=1200&r=LYNXNPEF8C03A-OCATP", "published_at": "2019-09-13"}