{"pub": "reuters", "url": "https://reuters.com/article/us-usa-courts-secrecy-congress/u-s-house-leader-to-back-bill-limiting-court-secrecy-idUSKBN1WB32P", "downloaded_at": "2019-10-03 23:36:12.101269+00:00", "published_at": "2019-10-03", "title": "U.S. House leader to back bill limiting court secrecy", "language": "en", "text": "WASHINGTON (Reuters) - A high-ranking member of the U.S. House of Representatives on Thursday said he planned to reintroduce legislation that would make it harder for companies to keep the public in the dark about products that allegedly pose health and safety risks.\n\nFILE PHOTO: The dome of the U.S. Capitol Building is seen as the sun sets on Capitol Hill in Washington, U.S., July 26, 2019. REUTERS/Erin Scott/File Photo\n\nHouse Judiciary Committee Chairman Jerrold Nadler, a Democrat from New York, said he planned to reintroduce the Sunshine in Litigation Act. The long-debated bill would allow parties in litigation to share evidence related to public health and safety with state and federal regulators — even if a judge agreed the evidence should be sealed in court.\n\nNadler said at a congressional hearing on courtroom transparency that there was a “disturbing trend of routinely sealed court filings that conceal vital health and safety information from the public.”\n\nEarlier versions of the Sunshine in Litigation Act have failed amid opposition from business groups, who have said it would increase costs and burdens associated with civil litigation.\n\nNadler also said he planned to introduce legislation that would enable more live video recordings of some court proceedings.\n\nThursday's hearing on courtroom transparency followed a June 25 Reuters report that focused on judges who routinely keep important evidence secret in product liability cases. Two Reuters reporters who worked on the project, Lisa Girion and Dan Levine, appeared at the hearing to present their findings.\n\nThe Reuters investigation revealed that in almost half of the largest product liability cases over the past 20 years, judges agreed to seal information related to public health and safety. They almost never explained their reasons in the court record, as the law requires them to do.\n\nFederal Judge Richard Story acknowledged in his testimony at Thursday’s hearing that judges sometimes seal court filings without sufficiently considering the public’s right to view them. Story spoke on behalf of the Judicial Conference of the United States, which sets policies for the federal courts.\n\n“The truth of the matter is that, under the press of business, when a judge in a busy trial court is presented with a consent order from parties resolving a matter, that order may be entered and perhaps not looked at as closely in terms of the effect on access,” Story said.\n\nJudges need to acknowledge the issue, Story said, adding that he has been applying more scrutiny to a motion in a current case because the issue of transparency has been getting more attention.", "description": "A high-ranking member of the U.S. House of Representatives on Thursday said he planned to reintroduce legislation that would make it harder for companies to keep the public in the dark about products that allegedly pose health and safety risks.", "authors": ["Jan", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190926&t=2&i=1434325432&w=1200&r=LYNXMPEF8P25Q"}