{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/ira-claim-northern-ireland-brexit-20637372", "downloaded_at": "2019-10-16 21:04:06.698101+00:00", "title": "IRA claim Northern Ireland Brexit customs posts would be 'legitimate target'", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nIRA terrorists have claimed any border infrastructure in Northern Ireland would be a “legitimate target” for an attack.\n\nThe New IRA warning of an upsurge in violence came as Brexit talks were going down to the wire in Brussels.\n\nThe chilling intervention from the most active terror group in the province will fuel fears of a spike in attacks amid ongoing controversy over arrangements for the 310-mile frontier between Northern Ireland and the Republic, which forms the only land border between the UK and EU.\n\nAn unnamed terrorist, speaking to Channel 4 News, said: “The IRA is an army and as an army we are committed to armed struggle for political and social change in Ireland.\n\n“Bearing in mind any installation or aspects of British occupation within the Six Counties - be it at the border or elsewhere - any infrastructure would be a legitimate target for attack and armed actions against those infrastructures and against the people who are manning them.”\n\n(Image: Channel 4)\n\nBeing interviewed at an IRA safe house, he went on: “It’s important to understand that this is a country under occupation by Britain and as in any colonial situation the people have the right there to respond by all means necessary to that occupation.\n\n“Regardless of the form of occupation - whatever kind of border there is, be it soft or so-called hard border - that’s irrelevant.\n\n“We are talking about an illegal occupation here that means the IRA reserved the right to attack those who are upholding that illegal occupation along the border and elsewhere and the illegal partition that goes with it, and those who are upholding that.”\n\n(Image: Channel 4)\n\nThe man, who was reportedly authorised to speak on behalf of the New IRA army council, said Britain, Ireland and the EU “constantly speak about the border as if it’s been there two minutes and it’s only an issue with Brexit”.\n\nHe added: “There’s been a border since 1921, it’s been resisted, it is being resisted, it will be resisted regardless of any deal formed around it.”\n\nThe New IRA reached notoriety over the murder of journalist Lyra McKee, 29, in Londonderry in April.\n\nShe was shot in the head while covering riots on a housing estate.\n\nThe terror admitted carrying out the killing, claiming it offered “full and sincere apologies” to her family and friends.", "description": "An unnamed New IRA terrorist said any infrastructure would be a target - weather they were on the border or away from it", "authors": ["Ben Glaze", "Image", "Channel"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20637365.ece/ALTERNATES/s1200/0_New-IRA-says-border-infrastructure-would-be-legitimate-target-for-attack.jpg", "published_at": "2019-10-16"}