{"pub": "thehill", "url": "https://thehill.com/homenews/administration/465828-trump-hits-democrats-over-private-hearings-with-former-officials-most", "downloaded_at": "2019-10-15 15:04:13.386451+00:00", "title": "Trump hits Democrats over private hearings with former officials, 'most of whom I do not know'", "language": "en", "text": "President Trump Donald John TrumpBusiness school deans call for lifting country-specific visa caps Bolton told ex-Trump aide to call White House lawyers about Ukraine pressure campaign: report Federal prosecutors in New York examining Giuliani business dealings with Ukraine: report MORE on Tuesday complained that Democrats are \"allowing no transparency\" by holding closed-door hearings with a cavalcade of administration officials as part of the House impeachment inquiry.\n\nThe president claimed he did not know most of the individuals giving potentially damaging testimony about his dealings with Ukraine as numerous administration officials defy the White House's refusal to comply with the investigation.\n\nADVERTISEMENT\n\n\"Democrats are allowing no transparency at the Witch Hunt hearings. If Republicans ever did this they would be excoriated by the Fake News,\" Trump tweeted. \"Let the facts come out from the charade of people, most of whom I do not know, they are interviewing for 9 hours each, not selective leaks.\"\n\nDemocrats are allowing no transparency at the Witch Hunt hearings. If Republicans ever did this they would be excoriated by the Fake News. Let the facts come out from the charade of people, most of whom I do not know, they are interviewing for 9 hours each, not selective leaks. — Donald J. Trump (@realDonaldTrump) October 15, 2019\n\nTrump's tweets echoed calls from some Republican lawmakers who have called on Democrats to release the full transcripts of their private hearings with Trump administration officials.\n\nFiona Hill, a former special assistant to the president who specialized in Europe and Russia affairs, testified on Monday that Trump's personal lawyer Rudy Giuliani Rudy GiulianiBolton told ex-Trump aide to call White House lawyers about Ukraine pressure campaign: report Federal prosecutors in New York examining Giuliani business dealings with Ukraine: report Ex-Trump aide on Russia testifies for 10 hours as part of impeachment inquiry MORE and U.S. Ambassador to the European Union Gordon Sondland pursued a “shadow foreign policy” in Ukraine.\n\nHer testimony followed an appearance by former U.S. Ambassador to Ukraine Marie Yovanovitch, who testified that she was pushed out of her role because of “unfounded and false claims by people with clearly questionable motives.”\n\nThe White House counsel last week sent a letter to Speaker Nancy Pelosi Nancy PelosiPelosi says Trump sanctions package on Turkey 'falls very short' Graham throws support behind Trump's Turkey sanctions Feehery: Trump may be down, but he's not out yet MORE (D-Calif.) and three committee leaders stating that the administration would not cooperate with any of their requests related to the impeachment inquiry and unsuccessfully sought to block parts or all of the testimony from Hill and Yovanovitch.\n\nSondland, Deputy Assistant Secretary of State George Kent and a former top aide to Secretary of State Mike Pompeo Michael (Mike) Richard PompeoTrump: Let Assad, Russia or China protect the Kurds Reporter presses Pompeo on whether he met with Giuliani in Warsaw Pompeo: 'I wish the NBA would acknowledge' China's treatment of Uyghur Muslims MORE are among those still scheduled to testify this week.\n\nDemocrats formally launched an impeachment inquiry into Trump late last month, alleging he abused his office by urging Ukraine's president to “look into” former Vice President Joe Biden Joe BidenSupport drops for Medicare for All but increases for public option Bolton told ex-Trump aide to call White House lawyers about Ukraine pressure campaign: report Federal prosecutors in New York examining Giuliani business dealings with Ukraine: report MORE and his son Hunter Biden during a July phone call.", "description": "President Trump on Tuesday complained that Democrats are \"allowing no transparency\" by holding closed-door hearings with a cavalcade of administration officials as part of the House impeachment inquiry.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpdonald_100419as6_lead.jpg", "published_at": "2019-10-15"}