{"pub": "reuters", "url": "https://af.reuters.com/article/sportsNews/idAFKCN1WL06C-OZASP", "downloaded_at": "2019-10-06 11:29:42.678819+00:00", "title": "All Blacks run rampant to thrash Namibia in Tokyo", "language": "en", "text": "TOKYO (Reuters) - Defending champions New Zealand racked up the biggest points tally of the Rugby World Cup so far by running in 11 tries to hammer a spirited Namibia side 71-9 and charge back to the top of Pool B on Sunday.\n\nNew Zealand's TJ Perenara celebrates with team mates scoring their tenth try at the Tokyo Stadium in Japan. REUTERS/Issei Kato\n\nThe bonus point was secured before half time and although there might be concern at yellow cards shown to Nepo Laulala and Ofa Tuungafasi for high tackles, the All Blacks look in ominous form heading into their last pool match against Italy.\n\nOutstanding centre Anton Lienert-Brown, flying winger Sevu Reece and fullback Ben Smith all scored two tries and Jordie Barrett, making a first test start at flyhalf, also crossed and kicked eight conversions.\n\nNamibia, who have never won a World Cup match in 22 attempts, opened the scoring and drew within one point at 10-9 after half an hour but bridging the huge gulf in class was beyond them and their physical challenge waned as they tired.\n\n“First half was pretty disappointing, we didn’t turn up with the right attitude and the Namibians made us pay for it,” All Blacks coach Steve Hansen said.\n\n“They had more intent in the first half and played better than us in the first half.\n\n“That’s a good lesson isn’t it? Second half, there was plenty of good stuff in it.”\n\nAfter proving hard to put away in their only other meeting at the last World Cup when the All Blacks won 58-14, the Africans again proved competitive for much of the first half.\n\nHooker Torsten Van Jaarsveld and captain Johan Deysel gave them momentum while they also frustrated New Zealand at the breakdown by slowing down their ball or interfering with Aaron Smith’s delivery to the backs.\n\nThe crowd of more than 48,000 also had plenty to cheer about with Damian Stevens slotting three penalties and bringing Namibia to 10-9.\n\nLaulala was then sin binned and while the crowd might have thought they could be witness to one of the great World Cup upsets, the All Blacks went up a gear.\n\nThey controlled the ball better through phases and replacement prop Angus Ta’avao and Smith both crossed to give them a 24-9 lead at halftime and momentum well and truly shifted.\n\nThe All Blacks, who scored four tries in the opening 10 minutes of the second half against Canada on Wednesday, added three inside the first 12 on Sunday with Joe Moody smashing over before Lienert-Brown and Reece added their second tries.\n\nCaptain Sam Whitelock, who had not scored an international try in three years, then brought up the half century when he planted the ball at the bottom of the posts.\n\nThe effects of their physical efforts in the first half began to take its toll in the second on Namibia’s players with several being taken off with upper body injuries.\n\nThe All Blacks scored three further tries in the final 12 minutes with Smith adding his second before Barrett crossed and took his personal tally to 21 points.\n\nTJ Perenara then finished off the try of the match with a sensational dive in the corner from a sweeping movement that he started inside the All Blacks’ 22-metre area.\n\n“We are very proud of the players, the effort we put in and how we played the game, particularly in the first half... scoreboard looks painful but in terms of the performance, lots to take from match,” said Namibia coach Phil Davies.\n\n“To play at a World Cup is a fantastic opportunity and we focused on embracing the opportunity.\n\n“The players did themselves proud, focusing on that opportunity and rising to the challenge.”", "description": "Defending champions New Zealand racked up the biggest points tally of the Rugby World Cup so far by running in 11 tries to hammer a spirited Namibia side 71-9 and charge back to the top of Pool B on Sunday.", "authors": ["Greg Stutchbury", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191006&t=2&i=1437679652&w=1200&r=LYNXNPEF950A1-OZASP", "published_at": "2019-10-06"}