{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/trump-taliban-deal-afghanistan-peace-talks-negotiations-us-troops-a9097161.html", "downloaded_at": "2019-09-09 10:25:33.181620+00:00", "title": "Trump scuppered peace plan with Taliban 'by trying to take credit for deal'", "language": "en", "text": "A tentative peace deal between Taliban leaders and the US fell apart after Donald Trump moved to make the accord a spectacle as part of his re-election campaign, reports have suggested.\n\nThe US president announced he was calling off a secret meeting between senior members of the Taliban, the government of Afghanistan, and his own administration through a Twitter post on Saturday evening - laying blame on the Taliban’s car bomb killing of 12 people in Kabul including a US soldier.\n\nThe talks, slated to take place just days before the anniversary of 9/11 at presidential outpost Camp David, were due to seal an agreement that would see US troops withdraw from the country in return for Taliban assurances that they would not facilitate global terrorism.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nHowever reports from The New York Times have claimed the President’s drive to create a spectacle out of the accord had left the Taliban unwilling to proceed - and that officials from the militant group would only accept the terms if the deal was signed off before the meeting in America.\n\nThe agreement between the group and the US was struck in Doha, Qatar, by US Secretary of State Mike Pompeo and his negotiator, Zalmay Khalilzad over the course of a year. The settlement would have seen the remaining 140,000 US troops pull out of Afghanistan over the next 16 months - keeping the president’s 2016 campaign pledge to withdraw from the country - in return for assurances the Taliban would not house international terror groups as it did al-Qaeda in the wake of the 9/11 attacks.\n\nShape Created with Sketch. Afghanistan war: lives of children devastated by the endless conflict Show all 20 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Afghanistan war: lives of children devastated by the endless conflict 1/20 Andrew Quilty/Save the Children 2/20 Nooria*, 15 in the home her family has lived in for the past two years in Mazar-i Sharif She was forced to flee her home with her family after their town was attacked by armed groups. Nooria describes a rocket hitting her neighbours home killing many inside. They fled on foot with just the clothes on their backs and she now lives in Mazari Shariff where Save the Children have enrolled her in school and provide vocational training Andrew Quilty/Save the Children 3/20 Nooria* hopes for a future with no war; \"When they attacked our village, the rocket hit our neighbour's house and they all died. Our house then caught fire and we ran away. My friends who I used to play with - I still don't know if they are alive or if they are dead.” Andrew Quilty/Save the Children 4/20 “I'm hoping for a better future, to learn, to support my family and to get them out of this difficult life. And I'm hoping for a future where there is no war.” Andrew Quilty/Save the Children 5/20 Naveed*, 16 at his family home in Mazar-i Sharif Naveed lost his leg when he stepped on a mine aged just 8-years-old. He was herding the family's sheep in the mountains near their home when he triggered a landmine Andrew Quilty/Save the Children 6/20 After months of medical treatment his right leg was eventually amputated. He received physiotherapy and a prosthetic leg from the International Committee for the Red Cross in Mazar Andrew Quilty/Save the Children 7/20 Now enrolled in school, Naveed is being given vocational training by Save the Children. “For around a year I felt and dreamt that I still had my leg. But when I woke up and saw, there was no leg. Sometimes I’d feel with my hand to check and find it wasn't there.” Andrew Quilty/Save the Children 8/20 “If someone has loses their leg, it does not mean that they have lost their mind.\" Andrew Quilty/Save the Children 9/20 \"With the help of our minds we can continue to study, learn, and work to make the future of our families brighter.” Andrew Quilty/Save the Children 10/20 Naveed and Mahboob*, 55 (Naveed's father) Several years ago Neveed's father, Mahboob, was brutally beaten with rifle butts by armed groups after, he says, he failed to provide food for them while they were stationed in the family's village. He suffered brain damage which affected the right side of his body, speech and his brain function Andrew Quilty/Save the Children 11/20 Habiba*, 14, and Arezo*, 15 in a village outside Kabul Habiba and Arezo were injured with their mother three years ago in a suicide bombing in Kabul. Arezo is still traumatised from what she saw and has become completely withdrawn Andrew Quilty/Save the Children 12/20 Arezo's younger sister Habiba cares for her, takes her to lessons and anywhere she wants to go. They are both in school through Save the Children's 'Steps towards Afghan girls' education success' (STAGES) programme, which helps the most marginalised girls get access to education, stay in school and learn. Andrew Quilty/Save the Children 13/20 Habiba says: “When I woke up and I opened my eyes I saw lots of bodies and I thought I was not alive any more. It was horrible. I'll never forget that. Whenever there is a big sound she gets scared because she was traumatised by the sound she heard during the attack. I love my sister, and I help her with her lessons, I take her anywhere.\" Andrew Quilty/Save the Children 14/20 \"She's older than me but I feel like the older one because I support her. I hope for a better future for me and my sister.” Andrew Quilty/Save the Children 15/20 Khalida*, 10 in a classroom in a village outside Kabul Two years ago Khalida lost her 18-year old brother when he was killed in an explosion in Kabul. She misses him every day and says the family are still carrying the grief of his loss Andrew Quilty/Save the Children 16/20 \"Two years ago, my brother was going to Kabul when an explosion happened and he lost his life. We are still carrying the grief and are crying over him. At the time we were happy, everyone was happy. Now no-one is happy in the family. When I remember him, I cry and feel so bad. I hope for peace and that war will stop, and that nobody loses their brother” Andrew Quilty/Save the Children 17/20 “I want to get education to become a teacher. I want to teach others who have never been to school” Andrew Quilty/Save the Children 18/20 Sema*,11 at her family home in Kabul Sema recalls coming home from her aunt's house and being told that her father had been killed in a suicide attack Andrew Quilty/Save the Children 19/20 Sema still thinks about him every second and likes to look at his prayer beads (Tisbeh) to remember him. They hang from the curtain in the family home. She loves school and wants to become a teacher one day. Sema says she wants peace in her country to stop other children losing their fathers. “We still have lots of his belongings, like his car, his clothes, his watch, his shoes. Whenever we see them we cry. He gave us all so much love every moment and he is on our minds. I want for the powerful people around the world to stop the war and bring peace, because I don't want other children to lose their fathers.” Andrew Quilty/Save the Children 20/20 “I want to become a teacher to serve the country and I don't want any girls to be illiterate. I want to teach all the girls, so they have access to education.” *Names have been changed to protect identities Andrew Quilty/Save the Children 1/20 Andrew Quilty/Save the Children 2/20 Nooria*, 15 in the home her family has lived in for the past two years in Mazar-i Sharif She was forced to flee her home with her family after their town was attacked by armed groups. Nooria describes a rocket hitting her neighbours home killing many inside. They fled on foot with just the clothes on their backs and she now lives in Mazari Shariff where Save the Children have enrolled her in school and provide vocational training Andrew Quilty/Save the Children 3/20 Nooria* hopes for a future with no war; \"When they attacked our village, the rocket hit our neighbour's house and they all died. Our house then caught fire and we ran away. My friends who I used to play with - I still don't know if they are alive or if they are dead.” Andrew Quilty/Save the Children 4/20 “I'm hoping for a better future, to learn, to support my family and to get them out of this difficult life. And I'm hoping for a future where there is no war.” Andrew Quilty/Save the Children 5/20 Naveed*, 16 at his family home in Mazar-i Sharif Naveed lost his leg when he stepped on a mine aged just 8-years-old. He was herding the family's sheep in the mountains near their home when he triggered a landmine Andrew Quilty/Save the Children 6/20 After months of medical treatment his right leg was eventually amputated. He received physiotherapy and a prosthetic leg from the International Committee for the Red Cross in Mazar Andrew Quilty/Save the Children 7/20 Now enrolled in school, Naveed is being given vocational training by Save the Children. “For around a year I felt and dreamt that I still had my leg. But when I woke up and saw, there was no leg. Sometimes I’d feel with my hand to check and find it wasn't there.” Andrew Quilty/Save the Children 8/20 “If someone has loses their leg, it does not mean that they have lost their mind.\" Andrew Quilty/Save the Children 9/20 \"With the help of our minds we can continue to study, learn, and work to make the future of our families brighter.” Andrew Quilty/Save the Children 10/20 Naveed and Mahboob*, 55 (Naveed's father) Several years ago Neveed's father, Mahboob, was brutally beaten with rifle butts by armed groups after, he says, he failed to provide food for them while they were stationed in the family's village. He suffered brain damage which affected the right side of his body, speech and his brain function Andrew Quilty/Save the Children 11/20 Habiba*, 14, and Arezo*, 15 in a village outside Kabul Habiba and Arezo were injured with their mother three years ago in a suicide bombing in Kabul. Arezo is still traumatised from what she saw and has become completely withdrawn Andrew Quilty/Save the Children 12/20 Arezo's younger sister Habiba cares for her, takes her to lessons and anywhere she wants to go. They are both in school through Save the Children's 'Steps towards Afghan girls' education success' (STAGES) programme, which helps the most marginalised girls get access to education, stay in school and learn. Andrew Quilty/Save the Children 13/20 Habiba says: “When I woke up and I opened my eyes I saw lots of bodies and I thought I was not alive any more. It was horrible. I'll never forget that. Whenever there is a big sound she gets scared because she was traumatised by the sound she heard during the attack. I love my sister, and I help her with her lessons, I take her anywhere.\" Andrew Quilty/Save the Children 14/20 \"She's older than me but I feel like the older one because I support her. I hope for a better future for me and my sister.” Andrew Quilty/Save the Children 15/20 Khalida*, 10 in a classroom in a village outside Kabul Two years ago Khalida lost her 18-year old brother when he was killed in an explosion in Kabul. She misses him every day and says the family are still carrying the grief of his loss Andrew Quilty/Save the Children 16/20 \"Two years ago, my brother was going to Kabul when an explosion happened and he lost his life. We are still carrying the grief and are crying over him. At the time we were happy, everyone was happy. Now no-one is happy in the family. When I remember him, I cry and feel so bad. I hope for peace and that war will stop, and that nobody loses their brother” Andrew Quilty/Save the Children 17/20 “I want to get education to become a teacher. I want to teach others who have never been to school” Andrew Quilty/Save the Children 18/20 Sema*,11 at her family home in Kabul Sema recalls coming home from her aunt's house and being told that her father had been killed in a suicide attack Andrew Quilty/Save the Children 19/20 Sema still thinks about him every second and likes to look at his prayer beads (Tisbeh) to remember him. They hang from the curtain in the family home. She loves school and wants to become a teacher one day. Sema says she wants peace in her country to stop other children losing their fathers. “We still have lots of his belongings, like his car, his clothes, his watch, his shoes. Whenever we see them we cry. He gave us all so much love every moment and he is on our minds. I want for the powerful people around the world to stop the war and bring peace, because I don't want other children to lose their fathers.” Andrew Quilty/Save the Children 20/20 “I want to become a teacher to serve the country and I don't want any girls to be illiterate. I want to teach all the girls, so they have access to education.” *Names have been changed to protect identities Andrew Quilty/Save the Children\n\nBut with the deal finalised in principle and the final round of talks concluded on 1 September, Mr Trump is believed to have pushed for the President of Afghanistan, Ashraf Ghani, and Taliban leaders to meet him in Camp David - and to let him be the driving force in approving the deal.\n\nReports suggest the US leader had not wanted the meeting to be a celebration of an agreement already struck, and instead wanted to appear as the one to put the final pieces of the historic accord together.\n\nThe president’s push to be seen as a deal maker is reported to have been a sticking point for the Taliban, who argued the US were tricking them into “political suicide” - forcing them to accept the authority of Afghanistan’s government as they vie for control of provinces within the country.\n\nMeanwhile the Afghanistan government had their own misgivings, despite officials agreeing to the meeting to ensure they did not look like they were blocking the path to peace.\n\nOfficials from the country remained distant throughout the talks so as not to recognise the Taliban and scupper the re-election campaign of Mr Ghani, due to take place next month. The Afghani government were also not willing to accept the Trump administration using the release of Taliban prisoners in Afghani custody as potential leverage for the deal.\n\nThe accord was finally terminated by the American President after the Taliban claimed an attack that killed 12 people, including a US soldier. The death is reported to have unified the administration’s belief it should be cancelled - with mr Trump telling aides “This is off; we can’t do this,”, according to The New York Times.\n\nThe Taliban has since warned that Mr Trump’s decision would “harm America more than anyone else”.\n\nA spokesman for the militant group said talks had been completed “in a favourable atmosphere”, adding that the scrapping of the deal “harm America more than anyone else... will damage their status, will make it clear to the world its most hostile stance for peace, will increase its material and human losses, and its role will be known as shaky and fragile in political dealings”.", "description": "A tentative peace deal between Taliban leaders and the US fell apart after Donald Trump moved to make the accord a spectacle as part of his re-election campaign, reports have suggested.", "authors": ["Vincent Wood"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/01/08/08/donald-trump-border-wall.jpg", "published_at": "2019-09-09"}