{"pub": "reuters", "url": "https://af.reuters.com/article/investingNews/idAFKBN1WV1OS-OZABS", "downloaded_at": "2019-10-16 14:17:51.970204+00:00", "title": "World Bank court orders Tanzania pay $185 mln to Standard Chartered", "language": "en", "text": "DAR ES SALAAM (Reuters) - Tanzania has been ordered by a World Bank arbitration court to pay $185 million to the Hong Kong subsidiary of Standard Chartered for breaching an energy contract.\n\nA logo of Standard Chartered is displayed at the financial Central district in Hong Kong, China November 23, 2017. REUTERS/Bobby Yip\n\nThe court’s ruling, which was released on Tuesday, adds to pressure on the East African nation, which faces at least two other multi-million claims from international investors.\n\nThe case stems from a legal battle between the Tanzanian government and privately-owned independent power producer IPTL, which led to the dismissal of several cabinet ministers in 2014.\n\nThe award by the World Bank’s International Centre for Settlement of Investment Disputes is less than the $352.5 million sought by Standard Chartered Bank Hong Kong, which was not immediately available for comment.\n\nThe government of Tanzania denied any responsibility and said it was not planning to pay the damages.\n\n“Neither the government nor (state power company) TANESCO, have a legal liability in these cases,” Tanzania government spokesman Hassan Abbasi said on Twitter on Wednesday.\n\nTanzania’s attorney general Adelardus Kilangi said that IPTL, not the government, would have to pay Standard Chartered.\n\n“When the award says that the Tanzanian government should pay Standard Chartered Bank, the actual meaning is that the government should supervise IPTL to make the payment,” he told Reuters.\n\nIPTL did not immediately respond to requests for comment.\n\nTanzania faces at least two other cases at the World Bank tribunal.\n\nU.S. firm Symbion Power said in 2017 it was seeking $561 million from TANESCO at the Paris-based International Chamber of Commerce’s International Court of Arbitration for breach of contract.\n\nIn 2017, a Canadian construction firm seized one of Tanzania’s new Q400 turbo-prop planes in Canada over a $38 million lawsuit related to a compensation ruling by the International Court of Arbitration.\n\nAviation sources said Tanzania reached a settlement to secure the aircraft, which was released in March 2018.", "description": "Tanzania has been ordered by a World Bank arbitration court to pay $185 million to the Hong Kong subsidiary of Standard Chartered for breaching an energy contract.", "authors": ["Fumbuka Ng", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191016&t=2&i=1441484833&w=1200&r=LYNXMPEF9F152-OZABS", "published_at": "2019-10-16"}