{"pub": "vice", "url": "https://news.vice.com/en_us/article/j5yv9y/how-trump-got-on-the-wrong-side-of-ukraines-anti-corruption-fight", "downloaded_at": "2019-10-06 06:31:15.771554+00:00", "title": "How Trump Got On the Wrong Side of Ukraine’s Anti-Corruption Fight", "language": "en", "text": "President Trump and his allies have suggested that his phone call with Ukrainian president Volodymyr Zelensky, whose transcript shows that he pressed the foreign leader to investigate his main democratic rival, was all part of an innocent effort to help root out corruption in the former Soviet republic.\n\n\n\nThat’s not how Ukrainian anti-corruption campaigners see it.\n\nInstead, they see an American president who, with the help of his personal attorney Rudy Giuliani, has aligned himself with the very forces in the country they’ve been working to overcome — and whose intervention in their domestic affairs threatens to undo years of hard work.\n\n“We were fighting hard for independent criminal justice institutions in Ukraine,” says Daria Kaleniuk, the executive director of the Anti-Corruption Action Center, a Ukrainian NGO. “And with this phone call from President Trump, our entire fight is at [a] big risk because it is now not the Ukrainian president pushing for certain criminal investigations, it is the American president who is pushing the Ukrainian president to investigate a guy who the American president doesn’t like.”\n\nRead: Ukraine is now 'auditing' the Biden case.\n\n\n\nTo understand all this, you have to understand the infighting in Ukraine over who can wear the true mantle of “anti-corruption.” After the 2014 uprising that brought down the regime of the Russian-aligned leader, Viktor Yanukovych, a wave of young reformers created a bunch of new government agencies to investigate and prosecute high-level state corruption — without the interference of politicians.\n\n\"We are very, very disturbed that Ukraine is now involved in this fight between Democrats and Republicans.\"\n\nThe main agency — the National Anti-Corruption Bureau, or NABU — was powerful, but only on paper. In reality, Ukraine was still largely in the hands of powerful oligarchs, and a new president in Petro Poroshenko who sold himself as something different. Ultimately, Poroshenko slow-walked reforms and empowered NABU’s main competition: the office of the prosecutor general, which was headed at the time by a man named Viktor Shokin.\n\nThat name might sound familiar. Shokin is the guy who in 2016 was forced out of office, something then-Vice President Joe Biden later bragged about making happen.\n\nBut Shokin was also one of NABU’s main antagonists. His removal was called for by most international donor organizations, including the EU, the World Bank, even Republican senators — and celebrated as a major victory for the fight against corruption.\n\nRead: Your guide to the cast of Trump's Ukraine scandal.\n\n\n\nBut Shokin’s successor, Yuriy Lutsenko, a close ally of Poroshenko with no prior legal experience, didn’t immediately make things better.\n\nIn late 2017, Lutsenko’s office broke up a joint NABU-FBI investigation into a passports-for-cash scheme at the state migration office, arresting half a dozen agents and revealing the name of an undercover operative. Lutsenko said NABU had been conducting an illegal operation.\n\nThat put Lutsenko on a collision course with Trump’s own State Department.\n\n“Lutsenko hated the National Anti-corruption Bureau of Ukraine,” Kaleniuk says. “Precisely because NABU was independent, because NABU was trying to investigate untouchable people in Ukraine, like members of parliament, heads of state-owned companies. Lutsenko didn’t like that, so he tried to undermine NABU.”\n\nWATCH: How Ukrainians are still fighting corruption after a failed revolution.\n\nEarlier this year, Lutsenko seemed to find another way to remake his name: he started meeting with Giuliani about the possibility of reopening the investigation into the Bidens. He also spoke out in the American press, telling a conservative columnist to look into the links between Biden’s role in the firing of Shokin and the Burisma investigation.\n\nIt’s that version of events — one sympathetic to Ukraine’s controversial prosecutors general — that trickled up to Trump.\n\nCOVER: Ukrainian activists at the Prosecutor General's office in 2016, to protest its pressure on the National Anti-Corruption Bureau, or NABU. (Sergei Supinsky/AFP/Getty Images)\n\n", "description": "His call to Zelensky shows him siding with an office that activists have been fighting against", "authors": [], "top_image": "https://video-images.vice.com/articles/5d95f01c2dd1d2000adbe39e/lede/1570203015060-GettyImages-591058950.jpeg?crop=1xw:0.9133xh;0xw,0.0336xh&resize=1200:*", "published_at": "2019-10-04"}