{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-soccer-england-wsl/fa-announces-inaugural-womens-football-weekend-idUKKCN1VW1MA", "downloaded_at": "2019-09-11 14:11:06.887794+00:00", "title": "FA announces inaugural Women's Football Weekend", "language": "en", "text": "FILE PHOTO: Soccer Football - Women’s Super League - Chelsea v Tottenham Hotspur - Stamford Bridge, London, Britain - September 8, 2019 Tottenham Hotspur's Hannah Godfrey in action with Chelsea's Maren Mjelde Action Images via Reuters/Paul Childs/File Photo\n\n(Reuters) - Women’s Super League fixtures including the north London derby between Tottenham Hotspur and Arsenal will be part of the first ever Women’s Football Weekend in November, the Football Association said on Wednesday.\n\nThe FA said Nov. 16-17 event will become an annual attraction as it hopes to capitalise on the growing popularity of the women’s game in the country.\n\nMore than 62,000 supporters attended WSL’s opening-day fixtures on Sunday, including a record crowd of 31,213 for the first-ever Manchester derby at the Etihad Stadium.\n\nThe Women’s Football Weekend, which will take place during the men’s international break, will also see Liverpool host Everton and last season’s Champions League semi-finalists Chelsea welcome Championship winners Manchester United.\n\n“We are excited to announce the first ever Women’s Football Weekend, for what is sure to be another great moment in a year that has seen huge momentum behind the growth in popularity of women’s football,” Kelly Simmons, the FA’s director of women’s professional game, said in a statement,\n\n“Following on from a record-breaking FIFA Women’s World Cup and opening Barclays FA Women’s Super League weekend, there has never been a better time to visit your local team, and we encourage all supporters to get involved at all levels of the pyramid on 16-17 November.”\n\nThe Championship matches on the weekend will see London City Lionesses take on Crystal Palace, while early league leaders Durham meet London Bees.\n\nThere will also be a full league and cup fixture schedule across the rest of the women’s football pyramid.", "description": "Women's Super League fixtures including the north London derby between Tottenham Hotspur and Arsenal will be part of the first ever Women's Football Weekend in November, the Football Association said on Wednesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190911&t=2&i=1428681506&w=1200&r=LYNXNPEF8A0YW", "published_at": "2019-09-11"}