{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/strictlys-shirley-ballas-goes-wild-20550175", "downloaded_at": "2019-10-10 15:15:54.540389+00:00", "title": "Strictly's Shirley Ballas goes wild at Attitude Awards as she dazzles in silver flapper dress", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nShirley Ballas had the time of her life at last night's Attitude Awards - bringing the party spirit in a shimmering silver flapper dress.\n\nThe Strictly Come Dancing head judge let her hair down at the magazine awards ceremony, which celebrates the great and good in the LGBT+ community.\n\nShirley, 59, was joined by show choreographer Ian Waite, who filmed from their table as Shirley made her way up on stage to present an award.\n\n\"Can I say what an honour it is to be here,\" she told the audience.\n\n(Image: CURLEY)\n\n\"And on three glasses of wine when you don't drink... I've been going round the tables,\" she joked as guests clapped and cheered.\n\nShirley was later spotted strutting out of London's Roundhouse venue accompanied by a female friend as she flirted for the cameras.\n\nThe glamorous dance guru threw her black feathered cape off her shoulders as she collapsed into the back of her cab, roaring with laughter at the photographers papping her.\n\nShirley wore a floor-length silver sequinned gown that borrowed heavily from the 1920s.\n\n(Image: CURLEY)\n\n(Image: CURLEY)\n\nThe show-stopping embellished frock featured cape-style sleeves and a flirty cut-out to show off Shirley's cleavage.\n\nShe paired it with silver diamante earrings, a delicate necklace and peep-toe silver heels, completing the glam look with an embellished clutch bag and a slick of claret coloured lipstick.\n\nShe posed up with Cheryl Tweedy after the awards do, with Chezza looking drop-dead gorgeous in a gold mini-dress with a plunging neckline to show off her cleavage.\n\nCheryl paired her sequinned metallic number with thigh-high black boots and a velvet choker, and looked happy and relaxed as she chatted to the other guests.\n\n(Image: Instagram)\n\nShirley couldn't stop grinning as she left the ceremony clinging on to her goodie bag and flashing the peace sign at onlookers.\n\nInside the rowdy venue, Katherine Jenkins serenaded the guests with an operatic version of Somewhere Over The Rainbow.\n\nThe singer wore a plunging green gown with a textured skirt and beading on the bodice, teamed with slicked-back hair and minimal jewellery.\n\nLance Black, Cheryl and Tan France from Queer Eye were all among the stars presenting awards, which were picked up by Gareth Thomas, Sam Smith, Taron Egerton, Dr Ranj Singh and Christine and the Queens.", "description": "Strictly Come Dancing head judge Shirley Ballas was loving life at last night's boozy star-studded Attitude Awards", "authors": ["Emmeline Saunders", "Image", "Curley", "Instagram"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20550002.ece/ALTERNATES/s1200/0_PAY-Shirley-BallasAt-the-Attitude-Awards-at-the-Roundhouse.jpg", "published_at": "2019-10-10"}