{"pub": "yahoo", "url": "https://finance.yahoo.com/news/trump-impeachment-barr-gone-rogue-122303380.html", "downloaded_at": "2019-09-28 01:26:46.056319+00:00", "title": "Trump impeachment: Barr has 'gone rogue' to cover up allegations of Ukraine interference, says Pelosi", "language": "en", "text": "Just days after announcing a formal impeachment inquiry, Nancy Pelosi says that attorney general William Barr has “gone rogue” to protect Donald Trump’s presidency.\n\nMs Pelosi, the speaker of the House and the highest ranking Democrat in Congress, made the accusation during an appearance on MSNBC’s Morning Joe in which she said Mr Barr is a part of a White House “cover up” to brush aside concerns that the president attempted to abuse the power of his office to pressure Ukrainian president Volodymyr Zelensky to dig up dirt on Joe Biden.\n\n“He’s gone rogue,” Ms Pelosi said. “I think where they’re going is a cover up of a cover up.”\n\nShe continued: “I think it’s sad, to have the Justice Department go so rogue. Well, they have been for a while. And now it just makes matters worse.”\n\nThe comments come days after Ms Pelosi, who had previously resisted calls for impeachment, announced that the House would now start impeachment proceedings against Mr Trump.\n\nHer decision was sparked by a whistleblower complaint regarding a July phone call between Mr Trump and Mr Zelensky, in which the president asked the Ukrainian to investigate Mr Biden — a potential 2020 rival — as a “favour”, after discussing aid to the former Soviet country.\n\nThose allegations have been corroborated by a rough transcript of the phone call, which the White House released earlier this week.\n\nDemocrats now appear to be moving quickly on impeachment, saying that they will focus tightly on the Ukrainian issue, in spite of other concerns that have been raised during Mr Trump’s nearly three-year presidency.\n\nThe House intelligence committee is leading the charge, with representative Adam Schiff, the committee’s chairman, saying on Thursday that the whistleblower complaint provided a clear “road map” for investigators in the coming weeks. He also said that the committee would work through a two-week recess that is slated to start on Friday.\n\nEarly indications suggest that articles of impeachment may be filed by the end of October.\n\nRead more\n\nTrump rants nonsensically about his own spelling mistake\n\nTrump lashes out at 'spies' behind Ukraine complaint\n\nRudy Giuliani furiously defends involvement in Ukraine scandal", "description": "Just days after announcing a formal impeachment inquiry, Nancy Pelosi says that attorney general William Barr has “gone rogue” to protect Donald Trump’s presidency.Ms Pelosi, the speaker of the House and the highest ranking Democrat in Congress, made the accusation during an appearance on MSNBC’s Morning", "authors": ["Clark Mindock"], "top_image": "https://s.yimg.com/uu/api/res/1.2/2HlcZ5mwnX42nPFTchy7yg--~B/aD0zOTU7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/45e9a04249b8344bafd91496d1dd9155", "published_at": "2019-09-27"}