{"pub": "fox", "url": "https://foxnews.com/science/china-finds-mysterious-shiny-gel-dark-side-of-the-moon", "downloaded_at": "2019-09-07 13:40:55.255628+00:00", "title": "China finds mysterious and strange 'shiny gel' on dark side of the Moon", "language": "en", "text": "China's Chang'e-4 lunar rover, which successfully landed on the Moon in January, has found something rather strange and perplexing — an oddly colored \"gel-like\" substance that can't yet be explained.\n\nAccording to Our Space, a Chinese government-sanctioned publication that focuses on space and exploration, the substance is described as a \"gel with a mysterious luster.\"\n\nThe Yutu-2 rover made the discovery on lunar day 8 (July 25) and so far, the Chinese space agency has not yet said what it is. Outside researchers have suggested that the gel is \"melt glass\" that has been created from meteorites hitting the far side of Earth's natural satellite, according to Space.com.\n\nWATER MAY BE ALL OVER THE MOON, GIVING NEW HOPE FOR SUSTAIN LIFE\n\nOn July 28, the team operating Chang'e-4 was preparing to power down the Yutu-2 rover for daily maintenance when someone from the team looked at the images from the main camera and found a crater with oddly colored material.\n\nFrom there, the operating team spoke with lunar scientists and they decided to keep the rover on and investigate the oddity.\n\nThe Chinese Space Agency has not released any official photos of the gel yet, but it has been described in the rover's drive diary. Photos of the Yutu-2 rover and the tracks it has made on the Moon have been published on the official QQ China Lunar Exploration Project blog.\n\nOnly three countries, the U.S., China and Russia, have successfully \"soft-landed\" on the Moon.\n\nCLICK HERE TO GET THE FOX NEWS APP", "description": "China's Chang'e-4 lunar rover, which successfully landed on the Moon in January, has found something rather strange and perplexing — an oddly colored \"gel-like\" substance that can't yet be explained.", "authors": ["Chris Ciaccia"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/china-moon-1.jpg", "published_at": "2019-09-03"}