{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/europe/a-new-greek-leader-wants-people-to-obey-a-public-smoking-ban--for-real-this-time/2019/09/21/f21cd774-d4cb-11e9-8924-1db7dac797fb_story.html", "downloaded_at": "2019-09-22 00:30:22.889383+00:00", "title": "A new Greek leader wants people to obey a public smoking ban — for real, this time", "language": "en", "text": "Greeks, banned from smoking in nearly all public places, smoke in most of those places nonetheless.\n\nThey smoke inside police stations and government buildings. They smoke in sports arenas. They smoke in family restaurants and late-night bars. They smoke at the music venue where Maria Pavlopoulou — a cancer survivor who has puffed her way through breakups and financial distress — now spends her Friday and Saturday nights singing oldies in the cigarette haze.\n\n“Of course, I realize it’s an addiction,” said Pavlopoulou, 53, who then took a pouch of tobacco from her purse and rolled her next cigarette. “But smoking makes me feel that I’m well.”\n\nIn a country that has been stressed to the max over the past decade, tobacco is the main vice. Nearly 2 in 5 Greeks 15 and older smoke daily, the highest rate in Europe. World Health Organization numbers put Greece among the heaviest smoking countries globally.\n\n\n\n\n\nWhen his government took office in July, for the first time in memory, staffers and politicians stopped smoking inside the Parliament building.\n\nThe notion of enforcing a health law is, by itself, a sign of how post-crisis Greece may be changing.\n\nGreek authorities have a long, tormented track record of creating regulations — whether about parking or tax collection — and looking the other way. In the case of the smoking ban, furious bar and restaurant owners rebelled when it was imposed, saying they couldn’t afford to chase off customers during what became a historic recession.\n\nBut advocates for the ban say that if Greeks are now able to rally behind any law, it should be one that can help reduce medical costs, stem an epidemic and bring the country up to the health standards of much of the rest of Europe and the United States.\n\n“Clean air is a basic need,” said George Balafoutis, a Microsoft cybersecurity architect who launched a website listing the bars and restaurants nationwide — 464, as of now — that are already smoke-free.\n\nEnforcing the law, though, means confronting a nationwide addiction.\n\nSmoking starts early for Greeks, and kiosks sell cigarettes right in front of schools. Even the healthiest Greeks can’t easily get away. American basketball coach Rick Pitino, coaching a Greek club earlier this year, criticized fans for smoking inside the arena, saying they were “self-centered” and didn’t “care about young people and the athletes who are breathing it in.”\n\nAt one cancer clinic in Athens, doctors say half the patients continue to smoke during their treatment. At another hospital across town, those lighting up in front of an outdoor sign that tells them not to include patients, relatives and staff.\n\nThere among the smokers, a 67-year-old with an IV drip and circulation problems said she was told earlier that day by her doctor to stop. A 70-year-old said he was smoking “a little more than usual today,” because his daughter was having surgery. A 56-year-old said he was smoking because he was on his morning break; he’d liquidated his construction company in 2011, spent five years unemployed and then found a job at the hospital pushing gurneys.\n\n“I started smoking in the army — like most guys,” the hospital staffer, Anestis Aslanides, said with a shrug.\n\n\n\nAshtrays remain a common feature in Athens. (Loulou d'Aki/For The Washington Post)\n\nEven hospital cafes are filled with smokers. (Loulou d'Aki/For The Washington Post)\n\nWhile other countries consider restrictions on vaping, based on reports of a mysterious lung illness and emerging evidence that flavored nicotine liquid is hooking children, the risks of traditional cigarettes are far better understood — and more widespread.\n\nThe World Health Organization says more than 8 million people die every year from tobacco, including 1.2 million nonusers who are exposed to smoke secondhand.\n\nBecause of its failure to enforce the ban, Greece has far and away Europe’s smokiest restaurants, bars and workplaces. According to 2017 European Commission data, 78 percent of Greeks say they’re exposed to smoke when they go out to eat. In most European countries, that figure is below 10 percent.\n\nThe initial Greek antismoking law actually came in two attempts — a patchwork version in 2009, which never took hold, and then a more forceful version in 2010, which called for a complete ban on smoking in all indoor public spaces, excluding casinos and some large music venues. Businesses that violated the law could face fines of up to 10,000 euros.\n\nThe country’s U.S.-born, socialist prime minister at the time, George Papandreou, said the ban would help “make our country viable — not just its economy but in everyday life.” But by 2015, according to Greek media, a government hotline to report violators was defunct. By 2016, Greece’s deputy health minister was smoking his way through a news conference.\n\nNow, the new conservative government has said it is time for the country to change. It intends to start following through on fines for violators. One pulmonologist advising the government, Panagiotis Behrakis, said he is also pushing for a campaign describing secondhand smoke as a “human rights violation.”\n\nAlready, Greeks abide by nonsmoking rules in some places: on the Metro, for instance, and in department stores. Trendy new restaurants have opened with smoke-free rules, and the percentage of smokers has fallen slightly in recent years. Polls suggest most Greeks are in favor of enforcement.\n\nBut following laws in Greece has never been that simple.\n\n“I was two times pregnant during the parliamentary session, and I suffered tremendously,” said Niki Kerameus, Greece’s new education minister. “I couldn’t find a place in Parliament where I wasn’t exposed. If we don’t start enforcing the laws where they are actually voted, what hope is there for anybody else?”\n\nSome experts note, with curiosity, that Greeks are better at following smoking bans when they leave their country.\n\n“When you see them abroad, they respect — completely — the regulations and laws,” said Pagona Lagiou, an adjunct professor at Harvard University and a professor of epidemiology at the University of Athens Medical School. “At home, they are not doing quite so well.”\n\n“Think about it,” said Balafoutis, who by day designs cybersecurity programs for banks, government branches and pharmaceutical companies. “If they ignore this, what other laws are they cutting corners on? Cleanliness? Quality of meats? How they treat workers?”\n\n“Fix this,” he said, “and more fixing will happen.”\n\nBut some Greeks would prefer to continue smoking and put off dealing with some of their broader stresses.\n\nPavlopoulou, who moonlights as a singer, said she realizes she should stop smoking. In her day job, she works 12-hour shifts at a cardiologist’s office. She handles paperwork for insurance claims. The smokers always pay more.\n\n“It’s the No. 1 factor,” she said.\n\nStill, as Pavlopoulou tells it, through much of her life, cigarettes have been her comfort. She smoked when her mother died, and she smoked when straining to help several unemployed siblings during the economic crisis and she smoked throughout her treatment several years ago for bowel cancer. Maybe that cancer was related to smoking; maybe it wasn’t — Pavlopoulou isn’t sure. But she remembers the cigarettes she smoked in the months after her treatment, after the numbness and the other side effects from chemotherapy, after the panic attacks and the dizziness. She was forced to cut out red meat and fast food and soda, and when at last she went out with some friends, she was worried about whether she might die, and whether she could be her old self.\n\n“To have a cigarette,” she said, “made me feel part of life.”\n\nShe has kept her view on cigarettes in the years since, smoking a pack a day, and the venue where she sings — small, smoky — is one of the joints that has fully ignored the ban. On weekend nights, Pavlopoulou shares the stage with several other singers for four-hour sets, playing in front of a mostly older crowd that she says is probably not ready to change.\n\n“Let’s not forget,” Pavlopoulou said by way of explaining, “that Greeks have been through a lot these last years.”\n\nElinda Labropoulou contributed to this report.\n\nRead more\n\nWhere are all the children? How Greece’s financial crisis led to a baby bust.\n\nGreek elections bring a populist experiment to an end\n\nGreece voted populism out. Now it has to make sure it doesn’t return.\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "description": "Greeks have generally ignored a law passed a decade ago.", "authors": ["Chico Harlan", "Rome Bureau Chief Covering Southern Europe", "Sometimes Parts Beyond", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/REeMeeYZnexs8cdyoDBbHnE1aVo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RTPPMEG32AI6TINFCYVYVHE4UI.jpg", "published_at": "2019-09-21"}