{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7554829/Inside-Lydia-Fortes-glamorous-maternity-leave-stunning-European-getaways-Royal-Ascot.html", "downloaded_at": "2019-10-10 08:35:40.803961+00:00", "title": "Inside Lydia Forte's VERY glamorous maternity leave - from stunning European getaways to Royal Ascot", "language": "en", "text": "Many of us spend most of our maternity leave up to our eyes in nappies and enjoying the odd coffee with a friend down the local cafe during rare moments of respite.\n\nBut being a new mother to son Johnny, eight months, has done little to quench the insatiable wanderlust of hotel heiress Lydia Forte.\n\nThe 32-year-old, who appeared as a potential investor on BBC's Million Pound Menu last year, is the older daughter of Rocco Forte hotel group founder Sir Rocco Forte and group director of food and beverage at the chain.\n\nSince welcoming her first child with City banker husband Dimitri Chandris in February, London-based Lydia has continued to document her regular travels to exotic destinations on Instagram, sharing snaps with her 23,800 followers.\n\nRecently she shared a beach picnic snap from Dune Du Pyla - the tallest sand dune in France - showing off her tanned skin.\n\n'Last weekend celebrating special friends and the last of the summer rays before going back to work after a long maternity leave,' she captioned the post.\n\nBeing on maternity leave hasn't quenched Lydia's thirst for travel - in July she visited the Greek island of Ithaca, where she enjoyed the 'sound of the cicadas and the uneven lapping of the waves'\n\nFor her first Mother's Day in March, Lydia hit the slopes in Saint Moritz, Switzerland - sharing a snap of her cradling her son on a chalet balcony with snow-capped fir trees and mountains in the background\n\nIn April Lydia travelled to New York, where she indulged in a few days of culture, taking in exhibitions at the New Museum (pictured) and the Metropolitan Museum of Art\n\nAs well as trips to various Rocco Forte hotels over the past nine months, Lydia has enjoyed glamorous holidays in locations ranging from the Greek Islands to the Big Apple, and attended the glamorous Royal Ascot race meeting in June - with barely a hint of baby weight.\n\nFor her first Mother's Day in March, Lydia hit the ski slopes of Saint Moritz in Switzerland - sharing a snap of her cradling her son on a chalet balcony with snow-capped fir trees and mountains in the background.\n\nIn April Lydia travelled to New York, where she indulged in a few days of culture, taking in exhibitions at the New Museum and the Metropolitan Museum of Art.\n\nThe socialite previously revealed that she sets herself a strict weekend to-do list that includes 'one cultural thing with my husband' and 'at least one social event with a group of friends'.\n\nOn her final day Lydia shared a photo from her hotel room with a breathtaking view over the city\n\nLydia pictured in front of an abstract piece of art at the Metropolitan Museum of Art in New York, which she visited in April\n\nOn her final day in the city she shared a photo of baby Johnny from the bed of her hotel room, revealing a breathtaking view over the city through the window.\n\nShe captioned the post: 'We've had a lovely time. First subway trip, first time across the Atlantic, first visit to Grand Central and the Zoo, and first time hanging out downtown and visiting a museum for Johnny and Sir Stripy.'\n\nIn May, Lydia nipped over to Rome to pay a visit to the newest Rocco Forte Hotel and shared a snap on a balcony showing off its 'spectacular' view.\n\nAnother holiday in July saw Lydia travel to the idyllic Greek island of Ithaca, where she enjoyed the 'sound of the cicadas and the uneven lapping of the waves' and shared a snap from what looked like a luxurious yacht.\n\nThat same month she took baby Johnny on a family 'tourist' trip to Downing Street in London, posing for a snap on the famous steps.\n\nIn May, Lydia nipped over to Rome to pay a visit to the newest Rocco Forte Hotel and shared a snap on a balcony showing off its 'spectacular' view\n\nLydia looked chic in a pastel ensemble as she attended the glamorous Royal Ascot race meeting in June\n\nLydia and Dimitri took baby Johnny on a family 'tourist' trip to Downing Street in London in July, posing for a snap on the famous steps\n\nThough she was once tipped as a potential wife for Prince Harry - long before Meghan Markle came on the scene - Lydia has been with shipping heir husband Dimitri since the pair met while studying at Oxford University.\n\nThey got married in September 2016, in a weekend extravaganza in Tuscany which involved a dinner in the town's medieval cloisters prepared by a Michelin-starred chef and a feast at Lydia’s grandparents' 12th-century Tuscan castle, followed by a fireworks display in the early hours.\n\nHaving travelled to the Rocco Forte Hotel properties 'at least once a week' before going on maternity leave, it's clear Lydia was keen to keep her finger on the pulse of the family business.\n\nLydia pictured outside one of the three new hotels the luxury group opened this year in Sicily, with the others located in Rome and Shanghai\n\nIn August, Lydia shared a stunning sunset photo posing beside her sister Irene from another family hotel in Sciacca, Siciliy, on the 500-acre Verdura Spa resort\n\nIn early July she and Dimitri travelled to Masseria Torre Maizza in Puglia - a Rocco Forte hotel - and posted a stunning snap of her in a pink summer dress teamed with tan sandals in lush gardens.\n\nThis was one of the three new hotels the luxury group opened this year, with the others located in Rome and Shanghai.\n\nLydia has claimed she usually colour codes her outfits when travelling, so she doesn't 'need more than one day bag, one clutch, one coat, one pair of boots and one pair of heels'.\n\nOn the same Italian trip, Lydia posed beside a mural on the wall outside her favourite seaside restaurant wearing a daringly short kaftan - one from her mother Aliai's fashion range.\n\nIn September, Lydia shared a beach picnic snap from Dune Du Pyla - the tallest sand dune in France - showing off her tanned skin as she toasted the end of her maternity leave\n\nIn August, Lydia shared a stunning sunset photo from another family hotel in Sciacca, Siciliy, on the 500-acre Verdura Spa resort.\n\nShe posed beside her equally glamorous sister Irene, who is brand manager of the chain.\n\nOn the same trip Lydia posed beside a mural on the wall outside her favourite seaside restaurant wearing a daringly short kaftan - one from her mother Aliai's fashion range.", "description": "Since welcoming her first child with husband Dimitri Chandris in February, London-based Lydia Forte has continued to document her regular travels to exotic destinations on Instagram.", "authors": ["Hayley Richardson For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/17/19501332-0-image-a-45_1570638459989.jpg", "published_at": "2019-10-10"}