{"pub": "townhall", "url": "https://townhall.com/columnists/jasonrantz/2019/09/08/american-soccer-has-a-dangerous-love-affair-with-antifa-thuggery-n2552724", "downloaded_at": "2019-09-08 11:40:11.564050+00:00", "title": "American Soccer Has a Dangerous Love Affair With Antifa Thuggery", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nThere’s a war brewing between soccer fans and Major League Soccer (MLS) that could seriously stall the league’s growth. A flood of progressive fans from independent supporter groups are fighting tooth and nail to show their support at stadiums for the violent Antifa movement, thrusting their fringe political beliefs onto a family-friendly fan base just looking to watch a competitive soccer match.\n\nFor weeks, tensions have grown. MLS does not allow the display of controversial and overtly-political symbols at matches, a clear violation of the Fan Code of Conduct. Despite the ban on the Iron Front flag - a symbol co-opted by Antifa to justify their violent attacks - fans in Seattle, Portland, Vancouver B.C., and Atlanta proudly displayed the symbol anyway.\n\nThey’ve been told many times by the front offices of their clubs to stop bringing the flags and they’re not happy.\n\nThe Fight\n\nThese fans legitimately think they’re fighting Nazis in American cities.\n\nA Seattle Sounders independent fan group, Emerald City Supporters (ECS), fired off an angry and self-righteous statement: “No one should be oppressed or persecuted because of who they are. As with all things in life no one should feel they can’t attend a soccer match and support the club they love. Just like the Iron Front symbol, the Emerald City Supporters stand for the oppressed and the persecuted.”\n\nMembers of the Timbers Army, the fan club supporting the Portland Timbers, continued to fly the flags, even staging a 33 minute silent boycott during a pivotal match against their bitter rivals, the Sounders. The silence played towards the Sounders' favor, earning an early goal and eventual win. But these fans protesting to support Antifa don’t care much about the teams, they care about their own political viewpoints.\n\nConsequently, several Timbers fans received three-game suspensions, according to ESPN. The Atlanta United supporters’ group Resurgence saw nine members disciplined and in Vancouver B.C., a Whitecaps fan from the group Southsiders was given a warning for a violation.\n\nThe Context\n\nMLS teams in the Pacific Northwest have become known for their political activism, spending as much time professing their love of their teams as they do lecturing the public about their ideological views.\n\nSome groups are intentional in their identity. Gorilla FC, a Sounders fan group, actively calls itself Antifa. Some groups are traditional fan clubs, with leadership forcing political views on its members. None of these groups are especially measured or nuanced in their activism.\n\nThe 107 Independent Supporters Trust, the nonprofit group behind the Timbers Army and Rose City Riveters, declared in a statement: “Our fight is against white nationalists, white supremacists, and others that seek to bring hate and violence to our stadium, city, state, and country.”\n\nThese groups say the Iron Front flag isn’t political, insisting it’s about human rights. They are especially wrong, absolutely delusional and potentially dangerous.\n\nAntifa has a long history of illegal behavior, using violence to promote a political agenda. In Tacoma WA this summer, police shot and killed an Antifa member after they said he was throwing incendiary objects at an immigration detention center. In Portland, a group of Antifa thugs assaulted journalist Andy Ngo because they didn’t like his reporting. And of course, we’re familiar with their unhinged, violent tantrums in Berkeley.\n\nThese fans don’t see much wrong with the violence. Antifa activists justify the dangerous behavior as simply fighting fascism and racism — positioning themselves as morally righteous. After all, they’re the ones fighting literal Nazis. Only, they’re not.\n\nCase in point: I’m a talk show host in Seattle on KTTH. I was interested in this story because I’m passionate about politics and soccer. I found this story interesting and when I first covered it, members of fan groups almost immediately labeled me a white supremacist and a Nazi, to intimidate me into not continuing my critical coverage.\n\nI’m gay and Jewish. When an actual fascist or Nazi poses a threat, count me in for a fight. They’re coming for me first, not some privileged, white dude that can afford season tickets to an MLS club.\n\nAntifa - and their enablers in these fan groups - categorize most political opponents as Nazis. They condemn most conservatives, from mainstream Republicans to Tea Partiers, as bigots. It’s not that our beliefs are especially objectionable; it’s that these activists object to any views they do not hold. Thus, they dehumanize political opposition, cast them off as Nazis, giving themselves justification to turn to violence to silence people with differing opinions.\n\nThe Implications\n\nIt’s unclear how these fan groups will react, as we’re nearing the end of the season. But they’re pressuring the front offices of their organizations to work to rescind the bans on the politically controversial speech. These clubs - and the league - are in a tough position.\n\nThere is no doubt that these fan sections are active and lively. At their respective stadiums, they help create an exciting atmosphere, chanting, cheering, waving team flags, and unveiling amusing tifo displays. If they were to legitimately boycott games - as some have threatened - you would see it and feel it in these stadiums. Clubs have a reason to keep them happy and engaged.\n\nAt the same time, however, the MLS is interested in growing the league, expanding into new markets and better exposing the sport in the pre-existing markets. You’re alienating a huge potential fan base with overtly political commentary -- regardless of whether it’s a fringe Left position or fans simply waving a Betsy Ross flag (recently banned in Salt Lake at RSL games). We also know what injecting politics into sports can do for pre-existing fan bases. Look at what happened to the NFL.\n\nMy take? Keep your politics outside the stadiums. Politics divide; sports are supposed to unite. If you care about the sport, focus your attention on the team and the players. You betray your team support when diverting your attention, during a 90-minute game, to pursuing a fringe political belief. If you’re really concerned with some kind of Nazi threat, it seems to me you’d be better off not attending a game on a Sunday afternoon.", "description": "There’s a war brewing between soccer fans and Major League .09/08/2019 7:36:27AM EST.", "authors": ["Jason Rantz", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/308/f9b4c0ae-7ec1-438e-8c96-7e33d05f3802.jpg", "published_at": "2019-09-08"}