{"pub": "dailymail", "url": "https://thisismoney.co.uk/money/mortgageshome/article-7526173/Will-property-market-slow-ahead-Brexit.html", "downloaded_at": "2019-10-05 06:26:21.096866+00:00", "title": "Will the property market slow even further ahead of Brexit?", "language": "en", "text": "Advertisement\n\nThe UK housing market has been in the brace position since the EU referendum three years ago.\n\nIt has been a bumpy ride for the most part. Prices have ground to a halt in some parts of the country, while they have soared ahead in others.\n\nA report by Nationwide yesterday showed overall prices were up just 0.2 per cent on last year. It is the tenth month in a row that annual house prices have grown by less than 1 per cent. But the crash-landing many fear has yet to come.\n\nBritain's property market is blowing hot and cold, with areas that saw a mini-boom a few years ago, including London and the South East suffering, while locations that had lagged, such as regional cities and the North seeing more buoyant conditions\n\nWith 29 days until the Brexit deadline, there is a sense that October could be a crunch month for the housing sector.\n\nGet a deal with the EU and there could be a flurry of sales as the market breathes a sigh of relief. But some are warning of a 10 per cent drop if things go the other way.\n\nWe have been speaking to estate agents from across the country to find out which way the wind may blow and use the ONS / Land Registry's detailed house price to look at what has happened to property values.\n\nIs the mood turning in the property hotspots?\n\nIn 1799 William Wordsworth fell in love with a small cottage in Grasmere while on a walking tour of the Lake District and it was there he wrote his ode Home At Grasmere.\n\nMore than 200 years on and his eye for the property market has proven to be sound. South Lakeland, which includes the village of Grasmere, saw house prices soar by 8.1 per cent in the year to July, according to the ONS / land Registry figures, despite plummeting stocks elsewhere.\n\nThe region is one of those proving resilient while others flap in the face of Brexit turbulence. But the mood may be about to turn.\n\nLocal estate agents Armitstead Barnett recently ran an advertising campaign under the slogan 'summer is still here but winter is near'.\n\nIt might not be Wordsworth but the message is stark. Even agents in growth areas are beginning to worry.\n\nWait-and-see rules for cautious homebuyers\n\nThree million Britons say they have put off buying a home because of Brexit, according to figures published by Royal London this week.\n\nAndrew Holmes, head of residential sales at Armitstead Barnett, says: 'We've seen a flattening of the market.\n\nNew instructions have been slower, sales have been slower and people are just being a little more cautious. They don't want to overexpose themselves to Brexit. October is supposed to be a tipping point.'\n\nSome agents say it is only in the past few weeks that they have started to feel the pinch. Doncaster has seen a 3.6 per cent growth in house prices, but Mark Hunter, partner at Grice & Hunter, says business in the town has 'ground to a halt'.\n\nHe points to the bullish attitude of Boris Johnson in No 10, which is 'starting to concentrate people's minds'.\n\nAs October 31 draws closer and a possible end to the uncertainty — deal or no deal — is in sight, it seems to make sense for people to hold out for that bit longer.\n\nBut Mr Hunter warns that approach is fraught with danger. 'Should we crash out [of the EU without a deal], there could be serious implications,' he says. 'It's hard to say how far prices would fall but there's no point in talking it up.'\n\nWe delayed selling over Brexit uncertainty Terry Doyle has lived in the four-bedroom detached house with his wife, Maureen, for 41 years, but wants to downsize Terry Doyle has delayed putting his home in Doncaster on the market because of Brexit. The retired dentist, 77, says all the advice he has received from friends persuaded him to ‘wait and see’. Terry has lived in the four-bedroom detached house with his wife, Maureen, for 41 years, but wants to downsize. He decided to buy a £360,000 bungalow in Sheffield earlier this year so he could be nearer his three grandchildren. He now lives predominantly in Sheffield but occasionally goes back to Doncaster. ‘We aren’t getting any younger, so we went and bought it,’ he says. However, as Terry now owns two homes, he had to pay an extra 3 per cent stamp duty on the new property. And under downsizing rules, he must now sell his main residence by 2022 to have a chance of getting a refund. Terry’s approach typifies that of the nation. He bought out of necessity, but because his finances are healthy he doesn’t need to sell yet. He says: ‘It’s so close to the alleged Brexit breakthrough you may as well wait and see. We’re in no great rush to sell, and Brexit amplifies that mood. ‘I don’t really know whether it will go up or down in value. It could well sell today but we are being very leisurely.’ m.dilworth@dailymail.co.uk\n\nBut families still need homes\n\nNot everyone believes October will be make-or-break. Parts of the market have proven immune to Westminster wranglings and many hope that will continue.\n\nMid-market moves for families facing a change in circumstance remain strong. If you need to move closer to a school, or make room for a new arrival, Brexit is largely irrelevant. There are those who can't afford to 'wait and see' and need to get on with their lives.\n\nIndeed, the Nationwide report highlighted the fact that while the number of homes changing hands has gone down, buyer demand remains relatively stable.\n\nAgents Jackson-Stops operates in the mid-to-upper end of the market in Norfolk. Its average property price is £650,000 and it tends to deal in period properties, farm or country houses.\n\nManager Jonathan Weeks admits there are fewer properties on the market and a limited pool of buyers but that those who are active are serious about getting a deal.\n\n'The viewings have dropped but the ratio of viewings to offers is very good,' he says. 'It's a classic estate agents' phrase, but people getting divorced keep us in business.\n\n'Downsizers looking to retire in the countryside aren't so motivated. The so-called 'romantic side' of the business has slowed. They want to move but there is no time pressure, so why not wait until Brexit blows over?\n\n'But people who are moving out of necessity will continue to do so, and they are getting a fair price.'\n\nIn Nottingham, house prices have risen steadily at 2.6 per cent. Chartered surveyor David Hammond says turnover in the lower end of the market is healthy. 'People will continue to move out of rented accommodation or mum and dad's house,' he says.\n\nCautious: Three million Britons say they have put off buying a home because of Brexit, according to figures published by Royal London this week\n\nPockets of the country are bucking the trend\n\nPockets of the country appear totally unshaken by Brexit. Yorkshire and The Humber recorded the highest annual price growth at 3.2 per cent to July this year. Close behind is the North-West, where prices increased by 2.3 per cent.\n\nMalvern Hills in Worcestershire recorded a house price growth of 8.3 per cent.\n\nIt has been spurred on by its affordability, proximity to Worcester and Birmingham and opportunities for 'a traditional English lifestyle'. The mood there is one of unbridled optimism.\n\nWe've been expecting a slowdown for a long time, but we're doing so many viewings across all sectors of the market Colin Townsend, of agents John Goodwin, Malvern\n\n'Malvern is a hotspot at the moment,' says Colin Townsend, chartered surveyor at John Goodwin.\n\n'We've been expecting a slowdown for a long time, but we're doing so many viewings across all sectors of the market. There isn't any evidence that people don't want to make a decision this year.'\n\nMr Townsend believes Malvern has benefited from its position in the market. With an average house price of £273,698, it is not as expensive as the nearby Cotswolds or Cheltenham.\n\nThat has made it fertile ground for a range of clients, from local entrepreneurs, first-time buyers and downsizers to commuters.\n\nBut it is Devon that has seen the most startling growth. North Devon saw house prices soar by 14.8 per cent, the biggest in England.\n\nMike Adey, residential officer at Greenslade Taylor Hunt, says the region has profited from people seeking a new lifestyle away from the big cities. Renovations are particularly popular, he adds.\n\n'While I expect it to be quieter during the Brexit period, people need to get on with their lives,' he says. 'We live in a lovely part of the world and, hopefully, people continue to want to live here.'\n\nThe largest annual price growth by country was recorded in Wales, up by 4.2 per cent over the year to July.\n\nMid-market moves for families facing a change in circumstance remain strong. If you need to move closer to a school, or make room for a new arrival, Brexit is largely irrelevant\n\nStamp duty is hurting families moving up the ladder\n\nLondon has fared particularly poorly since the referendum. House prices have dropped by 1.4 per cent in the past year.\n\nThis is largely because prices have had farther to fall in the capital after years of rapid growth before the 2007-08 financial crisis.\n\nIts boroughs account for five of the ten worst performing regions. Newham has seen house prices fall by as much as 9.6 per cent.\n\nCamden is an outlier, recording a growth of 9.5 per cent. But it still costs an average of £477,813 to buy a house in London — more than twice the UK average of £232,710.\n\nJohn King, chairman of Andrew Scott Robertson, which operates around Wimbledon and Merton in South-West London, says the market has dropped by about 35‑40 per cent in terms of sales.\n\nHe accepts Brexit has played its part but says stamp duty has also been a factor. New rules in 2014 pushed up the cost of moving for anyone buying a house worth more than £937,500.\n\nBut even those purchasing properties worth £500,000, not far off the average property price in London, face a £15,000 tax bill.\n\nClients are worried about a Labour government carrying out those policies. It is frightening them John King, Andrew Scott Robertson, Wimbledon\n\nReceipts from stamp duty fell last year for the first time in a decade, according to figures released yesterday by HMRC. Revenue from the duty fell by 7 per cent to £11.9 billion up to April 2019 because of the UK's slowing housing market.\n\nMr King's greatest fear, however, is not the outcome of the Brexit negotiations but that of an imminent General Election.\n\nLabour has called for a 'progressive property tax', which would see owners charged more if they invested more into their home. It is also looking at slashing the inheritance tax threshold.\n\n'If we see a Labour victory, that could frighten people and they will be heading for Europe,' warns Mr King. 'It's undermining the confidence in the market, particularly for families who have potential inheritance decisions to make.\n\n'That is probably the biggest factor in the market at the moment. Clients are more worried about a Labour government carrying out those policies. It is frightening them.'\n\nPrepare for turbulence\n\nOne agent in Chesterfield warns in the latest Royal Institution of Chartered Surveyors survey that continued political instability will cause house prices to fall by 10 per cent. The report is full of surveyors echoing those concerns.\n\nMr Hunter says we are 'moving into a period which, in terms of the economy and property markets, could be one of the most influential in living memory'. Others put it bluntly: 'Politics, Brexit,' says one.\n\nBut it is impossible to find a consensus. Mr King says that while he has seen prices drop by 5 per cent, he doubts they will fall much further.\n\n'It will just bump along,' he says. Mr Hammond is less blasé. 'We are not prepared for a No Deal,' he says. 'The only thing we are prepared for is chaos.'\n\nSo for now, the general message appears to be: fasten your seatbelts and prepare for turbulence.\n\nm.dilworth@dailymail.co.uk", "description": "House prices are up just 0.2 per cent on last year, but the crash-landing many fear has yet to come. With 29 days until the Brexit deadline, there is a sense that October could be a crunch month.", "authors": ["Miles Dilworth For The Daily Mail", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/01/21/19173886-0-image-a-15_1569961221820.jpg", "published_at": "2019-10-01"}