{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7574297/Mother-obsessed-pageants-slashed-living-costs-order-pay-daughters-dresses.html", "downloaded_at": "2019-10-15 11:25:48.881141+00:00", "title": "Mother obsessed with pageants slashed her living costs in order to pay for her daughter's dresses", "language": "en", "text": "A pageant obsessed mother has slashed her weekly living costs in order to spend £7,500 on her toddlers competitions.\n\nScrimping on just £30 per week to feed her family of four, Portia Richmond, 27, from Derby, would rather spend any extra cash on glitzy dresses and spray tans for her only daughter, Amelia, three.\n\nWith one dress costing up to £500, Portia spares no expense on Amelia's pageant dresses - even if that means they all live on a tight food budget and only buy second- hand furniture.\n\nDodging the branded items and heading instead for the own-brand super savers, the devoted mother says Amelia's pageant wardrobe means everything to her.\n\nPortia, a stay-at-home mother, said: 'One pageant can cost more than £1,500, so I have to cut back on other costs.\n\nPortia Richmond, 27, from Derby, spent £7,500 on her daughter's Amelia's beauty pageants so far, even thought it means budgeting her food shop. Pictured: Portia and Amelia, thee, at home\n\nAmelia started competition in beauty pageant at the age of two. Now three, the toddler sports expensive outfits, spray tan and makeup . Pictured at a pageant\n\nPortia applying makeup to Amelia's face. In order to fund her daughter's pageant run, Portia had to cut costs on other living costs such as furniture and food shops\n\n'For the pageants, I've got to be looking at a minimum of £500 for one outfit and for make-up, spray-tan and hair, they're around £100.\n\n'Shoes cost about £30, photos are another £25 and with travel on top is another £20.\n\n'So we'll save where we can, so we can be sure Amelia can compete.\n\n'I know I'm quite tight when it comes to spending on other things such as food shopping but it's worth it.\n\nMother-of-two Portia waving on stage next to Amelia at a pageant. Portia, used to be a beauty queen herself, retiring from the pageant scene last year\n\nFavouring super savers deals instead of branded items, Portia said she would spend about £30 on weekly food shops, cooking big meals for her family and freezing the left-overs\n\nAmelia showing off one of her pageant dresses. A dress can cost between £300 to £500 for Portia, but the mother won't spend any expenses\n\n'For the four of us, I'll cook a spaghetti bolognese, feed us all and I freeze another four meals out of it, same with curry dishes, casserole and soup\n\n'I'll bulk buy my meat and freeze it so I just have to top up on veg each week.\n\n'I don't buy branded items, and if I need new furniture for the house then I'll buy them second hand, never brand new.'\n\nThe tot's mother hit back at trolls, fiercely defending her decision to allow her tot to start competing at three-year's-old - complete with spray tan, makeup and daring outfits.\n\nAmelia stands still as her mother applies fake tan on her upper body. Portia hot back at critiques and said her daughter loved competing\n\nPortia explained that the pageant world was nothing as cut-throat or mean as it had been depicted before. Amelia in one of her pageant outfits\n\nThe stay-at-home mother-of-two said her daughter was a natural at pageants, and added she did it on a budget. Amelia competing at a pageant\n\nPortia herself only stopped competing in pageants last year, and began her daughter's pageant career at age two - estimating she's spent around £7,500 on her toddler's journey so far.\n\nSpending the small fortune on everything from dresses, shoes and hairpieces, to spray tans, entry and make-up, Portia claims her tot's a natural and loves the make up and glamour.\n\nReflecting on Amelia's most recent pageant last month, which saw her move into a new age bracket, mother Portia said, 'We did this one on the cheap side.\n\n'The entry fee, with the jackpot extra which essentially means she gets extra competitions to enter in came to about £145.\n\n'For her three outfits, we could have spent about £1,500 but went nearer only £700 for this one.\n\nPortia said she was not pushing her daughter into competing, and that Amelia got into her costumes herself. Pictured at home, left, and on stage, right\n\nPortia is a former beauty queen who hung up the gowns last year. Pictured at two different pageants\n\n'But it still took time to get her ready, with a spray tan on the Saturday evening and then another one on the Sunday morning.\n\n'By 7:30am we get picked up and do everything there at the venue.\n\n'I start by curling her hair, and putting in her hairpiece, which takes about 45 mins.\n\n'Then I do her make-up, foundation, eye shadow, bronze, eye lashes, and glitter which is another half an hour.\n\nAmelia putting her makeup on herself. Preparing for a pageant is a really team effort, with the family pitching in, including Amelia's younger brother Coleson-Christopher, two\n\nThe toddler being crowned at a pageant. Portia said Amelia's father Jayce did not care for beauty pageants, but said it was because he had never seen her perform\n\n'Then I get her into her dress, and let her get comfortable.'\n\nPortia added, 'Amelia's dad, Jayce doesn't really agree with pageants, thinking if I'm going to get her into anything it should be something professional like dance not pageants.\n\n'But he's not seen her in one, so doesn't really understand it - Amelia is happy doing them, which is all that matters as you can seen how much she loves it.\n\n'Yet my son, Coleson-Christopher, two loves to help her practice for them at home.\n\n'It's worth it absolutely - we don't go without and we still have lovely home cooked healthy meals just like everyone else.\n\nGetting the toddler ready for a pageants is a serious business, which starts by two applications of spray tan\n\nAmelia looking at herself in a mirror. Portia said her relatives were very supportive of the toddler's pageants and would help with outfits and routines\n\nPortia in one of her pageants dresses. She said she wanted to get Amelia into modeling but said she turned to pageants instead\n\n'I just do it on a budget and love to see Amelia enjoying it - the community is like a family.'\n\nThe determined mother added: 'I wanted to get her into modelling initially but the work is more spasmodic and not as guaranteed.\n\n'Some people don't agree with the make-up but Amelia loves it.\n\n'They can call me a pushy mum, but at the end of the day, it's just like a dance competition with a crown at the end instead of a trophy.\n\nThe toddler playing around in one of her pageants' gowns. Portia said she felt spending less on food in order to afford the pageants was worth it\n\nAmelia in one of her outfits at home. Portia said her daughter had an itching to be on stage and loved the different pageants' themes\n\nThe toddler playing with her tiara. The mother and daughter rehearse the pageants' at home in order to get ready\n\nWEEKLY FOOD SAVINGS FOR PORTIA: ALDI OWN BRAND TINNED TOMATOES: 30P PER TIN ALDI OWN BRAND TINNED BAKED BEANS: 30P PER TIN ALDI OWN BRAND CRISPS: 18 PACK FOR £2 ALDI BREAD: 49P ALDI BROCOLLI, CARROTS, LEEKS: 39p BUTCHER OFFERS: MULTIPACKS FOR £20, RANGE OF CHICKEN, MINCE AND PORK TOTAL WEEKLY SPEND: £30\n\n'People have this preconceived notion that I'm pushing her into it, but that's not the case at all.\n\n'Amelia will come downstairs, twirling her baton or whatever prop she's going to use and want to practice.\n\n'People think it's a b***** environment, with mums competing but that's not an accurate perception.\n\n'Amelia loves doing it and loves the different themes - she's always itching to be on the stage, and I've already got family members helping me to make dresses and routines for the next show.\n\n'I hope she continues doing them into the 18+ Miss categories, and I'll invest as much as I need to into them - I'll even choreograph all her routines!'\n\nAmelia receiving a crown during a pageant. Portia assured that the perception that pageant mothers were 'b*****' was inaccurate\n\nAmelia at home with her crowns and gowns. Portia shops at Aldi and freezes most items in order to afford the pageants\n\nAmelia at a pageant. Portia said she'll continue to invest what she has to in order to finance her daughter's pageant run", "description": "Portia Richmond, 27, from Derby, is a former beauty queen herself, who decided to dedicate her time - and money - to her daughter Amelia's beauty queen career, with each pageant costing £1,500.", "authors": ["Claire Toureille For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/09/19730602-0-image-a-31_1571128570412.jpg", "published_at": "2019-10-15"}