{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7569557/Elton-John-brands-Michael-Jackson-mentally-ill-disturbing-new-memoir.html", "downloaded_at": "2019-10-14 02:11:33.407880+00:00", "title": "Elton John brands Michael Jackson 'mentally ill' and 'disturbing to be around' in his new memoir", "language": "en", "text": "Sir Elton John has branded late pop superstar Michael Jackson 'mentally ill' and 'disturbing to be around' in his new memoir, Me.\n\nBritish singer Elton, 72, developed a friendly relationship with Michael early on in his career, but has now admitted that over the years, he became concerned about the way in which he started to 'sequester himself away from the world'.\n\nHe wrote: 'I’d known Michael since he was 13 or 14... He was just the most adorable kid you could imagine.\n\nMemoir: Sir Elton John has branded late pop superstar Michael Jackson 'mentally ill' and 'disturbing to be around' in his new memoir, Me. Pictured together in 1978\n\n'But at some point in the intervening years, he started sequestering himself away from the world, and away from reality the way Elvis Presley did.'\n\nElton continued: 'God knows what was going on in his head, and God knows what prescription drugs he was being pumped full of, but every time I saw him in his later years I came away thinking the poor guy had totally lost his marbles.'\n\nHe added: 'I don’t mean that in the light-hearted way. He was genuinely mentally ill, a disturbing person to be around.'\n\nConcerns: Elton, 72, developed a friendly relationship with Michael early on in his career, but has now admitted that over the years, he became concerned about the star's reclusive ways\n\nRecalling a time he invited Michael to one of his parties, Elton claims the star wandered off and was found playing with his housekeeper's son, prompting Elton to surmise: 'For whatever reason, he couldn’t seem to cope with adult company at all.'\n\nMichael suddenly of an overdose of sedatives administered by his personal physician, Conard Murray, in 2009.\n\nThis year, the star was posthumously accused of child sexual abuse by two men who were friends with him as youngsters in the documentary Finding Neverland.\n\nMeanwhile, Elton's brother has hit back at the singer for vilifying their father in his new autobiography.\n\nStrong words: Elton said of Michael, 'I don’t mean that in the light-hearted way. He was genuinely mentally ill, a disturbing person to be around'\n\nThe Your Song singer has claimed in his memoirs that his father, the late Stanley Dwight, failed to support his career choice, and never told him he loved or was proud of him.\n\nBut Elton's half-brother Geoff, 53, has claimed the crooner only chooses to 'believe what he wants to believe' and that he seems to have suffered 'massive memory loss'.\n\n'I don’t understand because my mum, my dad and me, we all went to see him as his guests in Liverpool,' Geoff told The Mirror. 'That was definitely a concert, my dad was definitely there, he was definitely playing and we definitely watched it. I was five.\n\n'Either he has got massive memory loss and he genuinely thinks his dad hasn’t seen him in concert or maybe he wants to believe that.'\n\nTragic end: Michael suddenly of an overdose of sedatives administered by his personal physician, Conard Murray, in 2009. Pictured in 1990\n\nElton writes in the book: 'I don’t recall [my father] ever coming to see me play live, or talking about music with him. What I was doing clearly wasn’t really his thing.'\n\nHe also claims that he was afraid of him.\n\nGeoff - who works as a carpenter and has a different mother to Elton, after Stanley split from first wife Sheila in 1962 and remarried second wife Edna and had four more sons with her - also insisted that Stanley was from a different generation, who were less generous with expressing their feelings.\n\n[Elton] is playing the blame card. But our parents came from war, where men had to be men and women had to be women. It’s a different world,' Geoff said.\n\nMe: Elton John Official Autobiography by Elton John is published by Macmillan on October 15, £25. © Elton John 2019\n\n''My dad... I can remember him saying \"I love you\" but it was on his deathbed. There were four of us brothers there – Elton wasn’t. I said \"Dad, I love you\". And he said, \"Yes, love is what it is all about\". That generation just didn’t express emotion in the same way we do now.\n\n'My dad was proud of him, you could see when Elton popped up on TV, his eyes lit up.'\n\nElton’s spokesman said: 'Elton stands by what he said in the book about his dad never seeing him perform.'\n\nGeoff spoke earlier this year about the way his father was portrayed in the film biopic Rocketman.\n\nFocusing on Elton's life, Geoff insisted that the movie vilifies their dad yet again and told the Mail this summer: 'That's not the Dad I remember. Dad had a big heart and he loved us all equally. He was incredibly proud of Elton and everything that he achieved.'\n\nAfter their father's death, Elton and Geoff lost touch. Geoff chooses to lead an alternative lifestyle in the small town of Ruthin in North Wales, where he hand-makes yurts and harps and organises music festivals.\n\nMe: Elton John Official Autobiography by Elton John is published by Macmillan on October 15, £25. © Elton John 2019.\n\nTo order a copy for £12.50 (50 per cent discount) call 01603 648155 or go to mailshop.co.uk\n\nFREE delivery on all orders. Offer valid until until October 19, 2019.", "description": "British singer Elton, 72, became friends with Michael, but has admitted that over the years, he became concerned about the way in which he 'sequestered himself away from the world'.", "authors": ["Ryan Smith For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/01/19671932-0-image-a-421_1571014428151.jpg", "published_at": "2019-10-14"}