{"pub": "independent", "title": "Boris Johnson’s claim that no-deal Brexit is the ‘democratic verdict of the people’ is false", "url": "https://independent.co.uk/voices/editorials/boris-johnson-no-deal-brexit-corbyn-general-election-a9087861.html", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:18:03.240761+00:00", "text": "When parliament returns from its summer break on Tuesday for a momentous week, Boris Johnson will have the right to state his case for the UK to leave the EU with or without a deal on 31 October.\n\nHowever, he is not within his rights to offer MPs the false choice he posed in The Sunday Times: “Are you going to side with Jeremy Corbyn and those who want to cancel the referendum?\n\n“Are you going to side with those who want to scrub the democratic verdict of the people – and plunge this country into chaos? Or are you going to side with those of us who want to get on, deliver on the mandate of the people and focus with absolute, laser-like precision on the domestic agenda?”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIt is a move of which Donald Trump would be proud, an “us versus them” moment created by the Tory leadership candidate who promised to unite his party and country. It is coupled with threats to end the career of any Tory MP who votes for legislation to stop no deal this week, by ensuring they could not represent the party at the next election.\n\nMPs should not accept Mr Johnson’s “fundamental choice”; they must use the very little time he has left them to ensure a much wider choice. It is a bit rich for him to talk about the “chaos” of a Corbyn government when Whitehall warns that no deal could result in the chaos of shortages of medicines, food and fuel – and months of chaos at the ports.\n\nHe is also being disingenuous by equating “the mandate of the people” from 2016 with a no-deal departure. How can he claim a mandate for an outcome not discussed during the referendum campaign?\n\nMr Johnson insists he wants a deal, and that the EU is starting to give ground, although Brussels believes he is overhyping what is merely the EU’s willingness to listen to alternatives to the Irish backstop he has still not tabled. The chances of no deal look higher than the 50-50 he now gives it (a shift from his “million-to-one against” in June).\n\nAlthough there is no Commons majority for no deal, Mr Johnson would opt for one to meet his self-imposed deadline of 31 October. It would be disgraceful to deny parliament other options – including the ability to leave in an orderly way, with an agreement; a Final Say referendum and a general election. Mr Johnson might be attracted to an election – but again, only on his terms. His allies have floated the idea of a poll in early November, so the UK would crash out during a “Brexit election” before people had voted. It is a ludicrous proposition. MPs should work across party lines to ensure any election is held before 31 October so the public have a real choice, not a false one. Alternatively, they should insist on an extension to UK membership to provide enough time for an election or a referendum.\n\nSuch an extension would give Mr Johnson time to negotiate the deal he says he wants, and then get the necessary legislation through parliament. Even if he secured a revised agreement at the 17-18 October EU summit, he would need a short period of extra time to win parliamentary approval.\n\nIn another ominous sign, Michael Gove, the cabinet minister responsible for no-deal planning, suggested on Sunday the government would not necessarily implement a law passed by parliament to avert no deal. “Let’s see what the legislation says,” he told the BBC’s Andrew Marr Show. This would take Mr Johnson’s decision to suspend parliament for five weeks to an even more outrageous level: remarkably, Mr Gove was raising the prospect that ministers might defy the law of the land. The courts would surely have something to say about that.\n\nThat ministers can even contemplate such a proposal proves that MPs must insist on a proper choice – not one imposed by a prime minister who gives the impression of seeking to engineer no deal by hook or crook.", "description": "When parliament returns from its summer break on Tuesday for a momentous week, Boris Johnson will have the right to state his case for the UK to leave the EU with or without a deal on 31 October. However, he is not within his rights to offer MPs the false choice he posed in The Sunday Times: “Are you going to side with Jeremy Corbyn and those who want to cancel the referendum?", "authors": [], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/01/16/boris-johnson.jpg"}