{"pub": "investing.com", "url": "https://au.investing.com/news/forex-news/forexsterling-holds-gains-near-5month-top-on-brexit-deal-but-hurdles-remain-1974492", "downloaded_at": "2019-10-18 02:05:06.643866+00:00", "title": "FOREX-Sterling holds gains near 5-month top on Brexit deal, but hurdles remain", "language": "en", "text": "© Reuters. FOREX-Sterling holds gains near 5-month top on Brexit deal, but hurdles remain\n\n* Graphic: World FX rates in 2019 http://tmsnrt.rs/2egbfVh\n\n* Sterling on the up after new Brexit deal reached\n\n* British PM still needs to get deal through parliament\n\n* in focus before China GDP as trade war bites\n\nBy Stanley White\n\nTOKYO, Oct 18 (Reuters) - The British pound traded near a five-month high against the dollar and the euro after British Prime Minister Boris Johnson and European Union leaders agreed a new deal for Britain to exit the bloc.\n\nSterling's gains on the dollar helped push the greenback to a five-month low versus the euro and a three-week low against the Swiss franc.\n\nThe yuan held steady against the dollar in offshore trade before the release of China's GDP data. Economists have forecast the economy will grow at the weakest pace in more than 27 years in the third quarter due to a costly trade war with the United States.\n\nThe initial relief at securing the long-awaited Brexit deal could be brief, however, because the prime minister still needs to sell the agreement to sceptical lawmakers when parliament sits on Saturday. Britain does leave the EU, its economic growth is expected to slow, which is likely to be a negative for sterling in the longer term, analysts warn. []nL5N27262N]\n\n\"Assuming we clear the parliamentary hurdle, the pound has room to rise further because there are a lot of shorts to be unwound,\" said Takuya Kanda, general manager of the research department at Gaitame.com Research Institute in Tokyo.\n\n\"But after that, people will start to question whether this is really good for Britain's economy, and further gains in sterling could become difficult.\"\n\nThe pound GBP=D3 traded at $1.2870 in Asia on Friday, close to a five-month high of $1.2988 reached on Thursday after EU leaders unanimously backed the new Brexit deal with Britain.\n\nAgainst the euro EURGBP=D3 , sterling traded at 86.42 pence, near a five-month high of 85.77 pence.\n\nFor the week, the pound was on course for a 1.7% gain versus the dollar and a 0.9% increase against the common currency.\n\nBritain's new Brexit deal has a \"decent chance\" of clearing parliament on Saturday, finance minister Sajid Javid said, but some investors are wary because debate so far on Brexit has been fractious and difficult to predict.\n\nEven if Johnson can win approval in parliament, Britain is still on course for more distant economic ties and increased trade barriers with the EU, which many economists say will slow growth in the UK.\n\nFor now, sterling's gains and worries about weak U.S. economic data are pushing the greenback lower against other currencies.\n\nThe dollar traded at 0.9875 Swiss franc , close to the lowest since Sept. 25 and on course for its biggest weekly decline since Aug. 9.\n\nThe dollar was quoted at 108.57 yen, headed for its second week of gains.\n\nIn offshore trade, the yuan CNH=D3 traded at 7.0815 per dollar.\n\nChina is expected to post its weakest economic growth in at least 27-1/2 years in the third quarter when Beijing releases gross domestic product data at 0200 GMT.\n\nDownbeat data in recent months has highlighted weaker demand at home and abroad, fanning expectations that Beijing will need new measures to ward off a sharper slowdown due to a year-long trade war with the United States.\n\nThe world's two-largest economies have imposed tariffs on each other's goods in a dispute over China's trade and industrial policies that has slammed the brakes on global economic growth. ( Editing by Jacqueline Wong)", "description": "FOREX-Sterling holds gains near 5-month top on Brexit deal, but hurdles remain", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXMPEABB008_L.jpg", "published_at": "2019-10-18"}