{"pub": "independent", "url": "https://independent.co.uk/life-style/great-british-bake-off-rav-bansal-homophobic-letter-sikh-a9126531.html", "downloaded_at": "2019-10-01 00:16:30.561751+00:00", "title": "Former Bake Off star inundated with ‘love and positivity’ after receiving homophobic letter", "language": "en", "text": "Former Great British Bake Off contestant, Rav Bansal, has spoken of the “immense love and positivity” he has experienced after sharing a homophobic letter that he received from a fellow Sikh.\n\nRav, who appeared in the hit show in 2016, came out as gay in June this year.\n\nAlthough he expected to suffer a degree of hostility, Rav said that the letter, which he received last week, “cut deeper” than any other comments because it came from another Sikh.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe baker posted the letter to his Twitter account, admitting that it “upset me more than I should have allowed it to”.\n\nRav said that this is because his faith was the catalyst in helping him come out.\n\n“For me, my faith is something that's actually helped me overcome many of the kinds of issues that I had from having this secret,” Rav told Radio 1 Newsbeat.\n\n“The reason why this cut deeper is because Sikhism is supposed to be something that is really positive and empowering and here it was being used to essentially tear me down.\n\n”When you look at Sikhism, and what the religion teaches, it teaches equality, and it's supposed to be religion as welcoming and accepting of all people, regardless of who they are,\" he said.\n\nIn the letter, the person wrote of how they had previously supported Rav after following him on the popular baking show but, after seeing his coming out story earlier this year, was unable to do so any longer due to his “lustful behaviour”.\n\n“You promote a perverse lifestyle as if it is something you should be proud of,” it read, before going on to state that Rav should have kept his sexuality private.\n\nRav said that after reading the letter, it made him question what year he was living in.\n\n\"It took me some time to process the way religion was being used to kind of justify that opinion,\" he said.\n\nDespite the hateful letter, Rav stated that reactions to his coming out from other members of the Sikh community had been almost entirely positive.\n\n\"You don't often see an out Sikh person, particularly somebody who's visibly Sikh like myself - the fact I wear a turban and I have a beard,\" he said.\n\n\"So I knew that me coming out would be a big deal for people.\"\n\nSince sharing the letter online, however, Rav said he has received many messages of support.\n\n\"When I received the letter, of course it was upsetting, and it did anger me, but I don't think anger and negativity is productive,\" he said.\n\n\"So I kind of chose to remain positive and see what I can do to help others rather than alienate and dismiss people's opinions.\n\n\"Let's open up a conversation - not just among the Sikh community, but people in general - to highlight what is and what isn't acceptable when you're trying to kind of express your religious opinions to somebody else,” he said.", "description": "Former Great British Bake Off contestant, Rav Bansal, has spoken of the “immense love and positivity” he has experienced after sharing a homophobic letter that he received from a fellow Sikh.  Rav, who appeared in the hit show in 2016, came out as gay in June this year.", "authors": ["Joanna Whitehead"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/30/15/rav-bansal.jpg", "published_at": "2019-09-30"}