{"pub": "yahoo", "url": "https://finance.yahoo.com/news/big-vix-options-trade-braces-201042718.html", "downloaded_at": "2019-10-26 08:48:30.317773+00:00", "title": "Big VIX Options Trade Braces for a 2008-Like Volatility Surge", "language": "en", "text": "(Bloomberg) -- Someone is betting big that the U.S. stock market is on track for the kind of turbulence not seen since the global financial crisis.\n\nTrading in call options on the Cboe Volatility Index, known as the VIX, outweighed puts by more than 2-to-1 on Friday with the index at its lowest level since July as stocks rallied. The standout trade was one block of 50,000 April $65 calls that were bought for 10 cents. Those contracts would imply a surge in the VIX of almost 500% from its current level.\n\nWhile the magnitude of the strike price is remarkable, Macro Risk Advisors derivatives strategist Maxwell Grinacoff said the April expiration date is even more interesting. That time frame could capture the impact of a potential recession, a breakdown in U.S.-China trade talks and a variety of political risks linked to the Democratic presidential primary and impeachment proceedings against Donald Trump, he said in an interview.\n\nThe VIX uses options prices to track the 30-day implied volatility for stocks in the S&P 500 Index. It was trading around 13 on Friday as the benchmark equity gauge hovered near a record high.\n\nThe last time the VIX traded near 65 was during the height of the global financial crisis. It touched a record high of 89.53 in October 2008, about five months before the S&P 500’s rout reached its bottom.\n\nTo contact the reporter on this story: Gregory Calderone in New York at gcalderone7@bloomberg.net\n\nTo contact the editors responsible for this story: Catherine Larkin at clarkin4@bloomberg.net, Richard Richtmyer\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- Someone is betting big that the U.S. stock market is on track for the kind of turbulence not seen since the global financial crisis.Trading in call options on the Cboe Volatility Index, known as the VIX, outweighed puts by more than 2-to-1 on Friday with the index at its lowest level since", "authors": ["Gregory Calderone"], "top_image": "https://s.yimg.com/uu/api/res/1.2/lx7_Xm9c8t6gZE4B63ZYcw--~B/aD02NzU7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/bloomberg_markets_842/de78b05eeed515e2d875eb8a982bb4d6", "published_at": "2019-10-25"}