{"pub": "guardian", "url": "https://theguardian.com/sport/blog/2019/oct/19/sam-underhill-tom-curry-england-australia", "downloaded_at": "2019-10-19 14:10:21.027311+00:00", "title": "Dynamic duo Sam Underhill and Tom Curry give England comic-book gusto", "language": "en", "text": "Eddie Jones calls them his Kamikaze Kids, which fits – because the way Tom Curry and Sam Underhill play is right out of a comic book. You could picture it in Roy Lichtenstein prints. Pop! Pow! Whaam! Boom! They made 36 tackles between them against Australia, none better than the one Underhill put in on their strapping No 8 Isi Naisarani early in the first half, which was one of those blows that seem to reverse the entire flow of a game. It was in the 15th minute, or thereabouts, and Australia had made a hot start, thinking that they would catch England napping after that two-week break since they beat Argentina. It worked.\n\nEngland into World Cup semi-finals after bruising victory over Australia Read more\n\nThe Wallabies had England reeling from the very beginning. “We really had to dig in that first 20 minutes,” Jones said “They had 75% of the possession, good field position, and it was such an important part of the game because they’re a frontrunning team. But we hung in there. And then we got a bit of momentum back.” They did. It was Underhill’s tackle that won it for them. Attack, after all, is not just about what you do when you’ve got the ball.\n\nAfter that first Australia penalty, Farrell kicked the restart deep. Naisarani, almost two metres tall and 18-stone heavy, caught the ball and came charging right back at him. Then he ran smack into Underhill, who caught him flush in the gut, forced him back, lifted him off his feet and dumped him down in a heap. It was a ruinous tackle, the sort of blow that staggers an entire team backwards. And while Australia scrambled to repair the damage, someone knocked on. So England won an attacking scrum that led, indirectly, to their first try. You could call it the butterfly effect, but Underhill might not appreciate the comparison.\n\nPlay Video 1:36 'I've got a soft spot for New Zealand,' says England's Eddie Jones ahead of semi-final – video\n\nUnderneath all those swift and skilful touches England unfurled in this match – the slick no-look passes, swish steps and startling interceptions – this victory, their best since they beat Ireland in Dublin back in the very first game of the year, was won and lost in the contest between Curry and Underhill and the two men opposite them, David Pocock and Michael Hooper.\n\nThe Australian duo’s partnership lit up the last World Cup. But that was four years ago. Hooper and Pocock are older and smarter, but Curry and Underhill younger and faster. And it showed. It was tough on Pocock, one of the greatest players of his generation, but the game has no respect for reputations.\n\nPocock is only 31, which is no age in any other walk of life, but Test rugby is a cruel business and here he always seemed to be an inch away from where he needed to be. Such as right after that first try, when England scored their second in short succession. This one came when Pocock tried to throw an offload to Christian Lealiifano. He got it wrong and Henry Slade picked off the interception. Everyone’s eyes were following him upfield, but watch it back and it was Curry who was closing in on Pocock and who clattered him down the split second after the ball left his hands. And it was Curry again who ripped the ball away from Hooper later in the half to win a crucial turnover.\n\nFacebook Twitter Pinterest Sam Underhill sets his sights on Australia’s Will Genia. Photograph: David Rogers/Getty Images,\n\nCurry and Underhill’s best moment came when they teamed up on Reece Hodge as he came thundering in off his wing. Whack, Curry cut him down, and, smack, Underhill pounced and stole the ball off him. Again, he was just a fraction of a second ahead of Pocock, who arrived at the breakdown just a moment too late to stop him. But when Pocock went diving in to dig the ball out of another of those midfield collisions, Underhill swept down like a breaking wave and knocked him clean off his feet.\n\nHooper, meanwhile, whose game has always been characterised by its lunatic intensity, just could not seem to get into the action. Curry, though, could not be kept out of it.\n\nHe was the key man in another of those little turning points in the game, this one in the 60th minute. England were leading 27-16, and it was Australia’s last, best chance to get back into it. They had an attacking scrum five metres out from England’s tryline. Naisarani exploded off the back of it like someone had stuck a tack into his backside. He was sure to score, until Curry peeled off the scrum and threw himself underneath his feet. Naisarani went down but Australia worked the ball along the line, where Marika Koroibete came charging hard for the gap in front of him. Enter Curry, stage left in a hurry.\n\nEngland 40-16 Australia: Rugby World Cup quarter-final player ratings Read more\n\nHe came flying in from the side and knocked Koroibete off his feet and into next week. It was his second try-saving tackle in the space of 20 seconds or so.\n\nIt was not long afterwards that they announced he had won man of the match in a game where England had scored four fine tries. He deserved it just for his work rate as much as anything else. If he had been down the Soviet coalmines, Stakhanov would not have got a look in.\n\nEven so, after it was all over, Jones was pretty sparing with his praise. He does not want to spoil them when there are harder challenges coming up just next weekend. He needs them lean and hungry, because hard as they have worked, there is plenty more left to do yet.", "description": "For all England’s skilful touches, it was Eddie Jones’s Kamikaze Kids who dominated Australia with 36 hard-hitting tackles", "authors": ["Andy Bull"], "top_image": "https://i.guim.co.uk/img/media/824bf62e7e48afb1d16469c0eb9f84cf6dc12588/0_0_4647_2789/master/4647.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=6893cd47f2657933fe47865441fa8e7d", "published_at": "2019-10-19"}