{"pub": "cbc", "url": "https://cbc.ca/news/canada/windsor/eee-virus-mosquitoes-windsor-1.5322505", "downloaded_at": "2019-10-16 20:53:03.727232+00:00", "title": "Deadly mosquito-borne virus Eastern equine encephalitis found in Windsor | CBC News", "language": "en", "text": "The rare but deadly mosquito-borne virus Eastern equine encephalitis (EEE) has been found in Windsor, Ont., according to the Windsor-Essex County Health Unit.\n\nThe virus, responsible for human and horse deaths in a number of U.S. states, was found in a mosquito pool in Windsor.\n\nThe EEE virus moves primarily between birds and mosquitoes, but can be spread to humans and other mammals. Five people have died in Michigan from the virus, with nine other cases confirmed in the state.\n\nThe health unit said there have been no human cases of EEE identified in Windsor-Essex.\n\nEEE kills one in three people who develop severe symptoms. The virus is rare but dangerous, and symptoms include fever, chills and muscle and joint pain, according to the Michigan Department of Health and Human Services. It can cause inflammation and swelling in the brain.\n\nAccording to the Windsor-Essex County Health Unit, the cooler temperatures might not be cold enough to eliminate the risk posed by mosquitoes.\n\n\"This is a good reminder for everyone to continue to protect themselves against mosquitoes by removing any standing water and to take personal protective measures to avoid mosquito bites,\" Dr. Wajid Ahmed, medical officer of health, said in a statement.\n\nThe health unit conducts routine screening of identified mosquito pools and will distribute educational materials in the neighbourhood where the positive pool was identified.", "description": "The rare but deadly mosquito-borne virus Eastern equine encephalitis (EEE) has been found in Windsor, Ont., according to the Windsor-Essex County Health Unit.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.4777230.1533728276!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/frontpagekidsmosquitosucks.jpg", "published_at": "2019-10-16"}