{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/News/video/president-trump-defending-ukraine-scandal-twitter-video-65935055", "downloaded_at": "2019-09-29 23:33:42.271221+00:00", "title": "President Trump defending himself from Ukraine scandal in new Twitter video Video", "language": "en", "text": "Transcript for President Trump defending himself from Ukraine scandal in new Twitter video\n\nwhistle-blower investigation that could threaten the trump presidency including new poll numbers showing how this story is playing with the American people. A new ABC news poll asking whether this is a serious problem, two third of Americans saying yes, it is. Also trump defending himself in a new Twitter video and Nancy Pelosi and chuck Schumer out with some tough words of their own. George is standing by with analysis. We begin with David Wright at the white house. Good morning, David. Reporter: Good, Eva. Buckle up and get ready for a bumpy ride these next few weeks and months. Impeachment is already starting to consume most of the oxygen here in Washington politics. That can be dangerous for both parties. This weekend president trump signalled his intention to fight. What's going on now is the single greatest scam in the history of American politics. Reporter: A defiant video message from the white house rose garden blasting back at the Democrats. Because our country is at stake like never before. It's all very simple. They're trying to stop me because I'm fighting for you and I'll never let that happen. Reporter: The Democrats aren't flinching. People say you have to take a political risk to do that. That doesn't matter. That doesn't matter. We cannot have a president of the United States undermining his oath of office. Donald Trump, make no mistake about it, if the facts merit as Alfonso David said, Nancy Pelosi and chuck Schumer are coming for you. Reporter: Both sides are trying to litigate this in the media. The president's private attorney went on Fox News to mount his case. I didn't know what the statement said. I was asked beforehand should he release it. I said it's up to him. It's not going to matter. The statement could say good morning president zelensky and good morning president trump and they would have said there was a hidden signal. Reporter: The clock is ticking for both sides with the 2020 primaries due to start in January. Some Democrats say they hope to ready articles of impeachment by Thanksgiving and send them to the full house before Christmas. That's why, even though congress has just started a two-week recess, the house intelligence committee will hear Friday from the inspector general who escalated the initial whistle-blower complaint as a matter of urgent concern. Out on the campaign trail -- We have a lot of things to talk about. I've certainly talked about impeachment. Reporter: Impeachment is crowding out other issues the candidates planned to focus on. If you're relying on a weekly motel in order to be able to have a roof over your head and you've been run out of it, do you have time to follow the Ukraine scandal? I doubt it. My focus is on addressing the issues that keep people up at night. Reporter: Meanwhile the threat of impeachment is causing a review of scandal the trump white house had put in the past. Case in point, that meeting he had in the oval office with the Russia foreign minister and Russia ambassador. That was in may of 2017. The \"Washington post\" now reports that at that meeting trump told the Russians that he wasn't concerned about Moscow's meddling in the 2016 election because the U.S. Does the same thing around the world. Old meeting, new headline because everything now is getting a second look. Dan? Indeed, David right. Thank you very much. Joining us from the white house. We appreciate that. Let's bring in George Stephanopoulos who is hosting \"This week.\" Good morning. We want to talk about the \"Washington post\" headline in a second. Let's talk about Nancy Pelosi. You heard her acknowledging there's political risk. I want to take another look at the ABC news poll. It says 63% say that trump urging the Ukrainian president to investigate the Biden's is a is that a solid number? I think the number that's important is the number of Americans that support impeachment seems to be rising. They're higher than they've been at this stage for post impeachment proceedings, proceedings against Bill Clinton and Richard Nixon. Both started out with minority support and it climbed as the investigation continued and this investigation is just beginning. Let me ask another question looming over this for the Democrats. If they cannot prove a quid pro quo, in other words if they can't prove the president said to the Ukrainians I'm not going to give you military aid unless you investigate the Bidens, does that weaken their case? Let me turn it around. If you find a tape that the president says you're not getting the aid unless you investigate, that's a smoking gun. I think it's unlikely you'll find something that explicit. It's not necessary in the eyes of Democrats to proceed because they say it's an unequal relationship. The United States -- Ukraine needs the United States for military aid to protect against Russia, to help reform their system. If the president is making these requests there's an implicit quid pro quo there because of the unequal relationship. Let's go to the \"Washington post\" headline that David right mentioned there in his tag. The headline is trump told Russian officials he wasn't concerned about Moscow's interference in the U.S. Elections. According to the post, this is why they restricted access between the president and foreign leaders. What's your take on the significance of this? That was the meeting that the Russian press was there and the United States press wasn't. They had been barred from the meeting. You have to go back to that point in time. This is a time when the intelligence community which has a consensus that Russia did indeed interfere. A con concern shus sus they're still trying to interfere. That's a serious threat. Yet you have the president telling their foreign minister don't be concerned about it. Pretty astonishing. That's why I think you see Democrats pouncing on it. That's leads to another thing to remember as we're going through these impeachment proceedings. These investigations are always dynamic. You don't know what's going to come up as the investigation continues. The president has to be more concerned about what we don't know now than even what we do. Both sides have to be concerned for sure. George, thanks very much. Keep your eye on George today. He's got a big show this morning. He's going one on one with the president's personal attorney Rudy Giuliani, a name mentioned repeatedly in the whistle-blower complaint and Adam Schiff who is on the frontlines of the democratic investigation. It's coming up on \"This week\" later this morning. That's right here on ABC.\n\nThis transcript has been automatically generated and may not be 100% accurate.", "description": "Democratic leaders Nancy Pelosi and Chuck Schumer have raised serious concerns about the controversy.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/190929_gma_wright_hpMain_16x9_992.jpg", "published_at": "2019-09-29"}