{"pub": "cnn", "url": "https://bleacherreport.com/articles/2856528-russell-wilson-dazzles-with-4-tds-as-seahawks-beat-rams-30-29-in-tnf-thriller?utm_source=cnn.com&utm_campaign=editorial&utm_medium=referral", "downloaded_at": "2019-10-04 07:41:46.176613+00:00", "title": "Russell Wilson Dazzles with 4 TDs as Seahawks Beat Rams 30-29 in TNF Thriller", "language": "en", "text": "Elaine Thompson/Associated Press\n\nThe Seattle Seahawks defeated the Los Angeles Rams for the first time since October 2017.\n\nSeattle snapped a three-game losing streak against its NFC West rival with a 30-29 victory in Thursday’s showdown at CenturyLink Field and improved to 4-1 in the process. It is now in second place alone in the conference thanks in large part to Russell Wilson torching the Rams defense and finding Chris Carson for the game-winning touchdown on 4th-and-goal in the closing minutes of the fourth quarter.\n\nLos Angeles had a chance to answer, but Jared Goff threw an interception to Tedric Thompson on its penultimate possession before Greg Zuerlein missed what would have been a game-winning 44-yard field goal.\n\nThe reigning NFC champion Rams fell to 3-2 on the year and are now looking up at the Seahawks and the 3-0 San Francisco 49ers in the division.\n\nNotable Fantasy Stats\n\nRussell Wilson: 17-of-23 passing for 268 yards, four touchdowns and zero interceptions; eight carries for 32 yards\n\nChris Carson: 27 carries for 118 yards; one catch for five yards and one touchdown\n\nTyler Lockett: four catches for 51 yards and one touchdown\n\nWill Dissly: four catches for 81 yards\n\nJared Goff: 29-of-49 passing for 395 yards, one touchdown and one interception\n\nTodd Gurley: 15 carries for 51 yards and two touchdowns\n\nGerald Everett: seven catches for 136 yards\n\nCooper Kupp: nine catches for 117 yards and one touchdown\n\nRussell Wilson Shines as No-Doubt MVP Candidate\n\nOutside of a matchup with the 0-3-1 Arizona Cardinals, Seattle’s four games have been decided by a combined 10 points. It is clear this group will be involved in close contests throughout the season, and this back-and-forth showdown was no different.\n\nIndividual stars often make the difference in coin-flip games, and Seattle has one of the best in the league.\n\nWilson—who still hasn’t thrown a pick this year—neutralized a daunting Rams pass rush featuring Aaron Donald, consistently bought time with his legs, found lanes to run when needed and always kept his eyes downfield when on the move. That alone is challenging enough, and he made a habit of floating perfectly placed passes into tight windows in a master class of quarterback play.\n\nHis play-action fakes froze Los Angeles’ defense a number of times, including on a 40-yard dime to DK Metcalf for a touchdown, and made Will Dissly a more challenging matchup for the linebackers.\n\nThe five-time Pro Bowler wasted no time with a dazzling play in the first quarter when he dropped back on a play-action, scrambled to his left when nobody broke free and fired a pass on the run into the back corner of the end zone, which Tyler Lockett somehow pulled down while keeping both feet in bounds:\n\nIt may have been the throw and catch of the year on one play, but Wilson was even better directing a 12-play, 75-yard drive that took nearly seven minutes in the final quarter to give his team the lead for good.\n\nThose types of MVP drives will keep the Seahawks in the thick of the NFC playoff race all season and Wilson in the middle of the MVP battle.\n\nRams Defense Standing in Way of Super Bowl Sequel\n\nZuerlein will play the role of scapegoat for the Rams given his opportunity to win the game with a field goal, but the defending NFC champions have bigger problems than their kicker if they plan on reaching the Super Bowl two straight times.\n\nThe offensive weapons were on full display for much of the game. Goff spread the ball around as he directed the team into field-goal range from his own 7-yard line with no timeouts remaining on the final drive, Todd Gurley II scored twice, Gerald Everett emerged, and Cooper Kupp was his typically unstoppable self.\n\nYet, the defense that allowed a stunning 55 points in a loss to the Tampa Bay Buccaneers on Sunday struggled again and ultimately cost the team a critical road win against a fellow contender.\n\nThe secondary that couldn’t stop Jameis Winston, Mike Evans and Chris Godwin had no chance against Wilson, who recorded 268 yards and four touchdowns through the air even though he threw the ball just 23 times.\n\nThe group that couldn’t tackle David Moore on a bubble screen or stop Carson on the ground or from breaking free for his only catch with the game hanging in the balance still has to face Jimmy Garoppolo, Matt Ryan, Lamar Jackson, Kyler Murray, Wilson again and Dak Prescott, among others.\n\nDonald and the rest of the pass rush can only do so much. If the Rams don’t improve on the defensive side, they will be watching the Super Bowl from home this year.\n\nWhat’s Next?\n\nBoth teams face playoff contenders in Week 6. Seattle hits the road to face the Cleveland Browns, while Los Angeles hosts the 49ers in a crucial division matchup.", "description": "The Seattle Seahawks defeated the Los Angeles Rams for the first time since October 2017.      Seattle snapped a three-game losing streak against its NFC West rival with a 30-29 ...", "authors": ["Scott Polacek"], "top_image": "https://img.bleacherreport.net/img/images/photos/003/831/333/hi-res-fec4abdd5a98e71f988c26df41bb1a58_crop_exact.jpg?w=1200&h=1200&q=75", "published_at": "2019-10-04"}