{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/virginia-politics/emilys-list-makes-record-donation-to-virginia-democrats/2019/10/06/31cc69f4-e866-11e9-85c0-85a098e47b37_story.html", "downloaded_at": "2019-10-07 12:07:07.623345+00:00", "title": "Emily’s List makes record donation to Virginia Democrats", "language": "en", "text": "“We are hopeful that other individuals and organizations will follow our lead in directing their energy and support to these incredibly important state legislative races that too often remain underresourced and underfunded,” Stephanie Schriock, president of Emily’s List, said in a written statement.\n\nAD\n\nAD\n\nVirginia is one of four states with legislative elections this year, but the only one where control is considered up for grabs. Republicans are nursing razor-thin majorities with all 100 seats in the House of Delegates and all 40 in the state Senate on the ballot Nov. 5.\n\nRepublicans, who saw their 2-to-1 majority in the House nearly wiped out in an blue wave in 2017, have a 51-to-48 margin in the House and a 20-to-19 edge in the Senate, with one vacancy in each chamber. The contests are drawing national money and attention as a potential bellwether for 2020.\n\n“Virginia is at a turning point, and in 29 days, millions of voters will head to the polls in an election that will have a lasting impact on future generations and set the momentum for upcoming state legislative races across the country,” Schriock said.\n\nAD\n\nAD\n\nEMILY’s List, which has endorsed 39 women running this year in Virginia, has worked directly with some individual campaigns to provide advice on such things as fundraising and communications.\n\nSeveral of the endorsed candidates will receive direct, six-figure donations out of the $1.5 million, while $150,000 of it will go to the Democrats’ coordinated campaign, an Emily’s spokeswoman said.\n\nGOP legislative leaders have tried to play down abortion politics since 2012, when they backed a bill that would have forced most women seeking an abortion to first undergo a vaginal ultrasound. Facing a backlash over the invasive nature of the test, they found themselves ridiculed on “Saturday Night Live” and accused of waging a “war on women.”\n\nAD\n\nRepublicans thought abortion politics might favor them this year, after an uproar over a Democratic bill to loosen restrictions on late-term abortion. Under questioning from a Republican during a hearing on the bill in January, Del. Kathy Tran (D-Fairfax) said the measure would allow an abortion up to the moment of delivery. Tran later said she misspoke.\n\nAD\n\nWhen asked about the bill on a radio show, Gov. Ralph Northam (D), a pediatric neurologist, made comments that Republicans interpreted as an endorsement of infanticide. Northam, a pediatric neurologist who has volunteered as medical director for a pediatric hospice, appeared to be discussing life-support or other options for a newborn that is “not viable.” He refused to clarify his comments but called the suggestion that he would support killing infants “disgusting.”\n\nRepublicans hoped those controversies would allow them to paint Democrats as extremists on abortion. But they became wary of raising the issue with swing voters after several red states, including Alabama, moved to sharply limit abortion rights.\n\nPoll finds Virginia voters focused on gun policy ahead of pivotal election\n\nVirginia’s ‘off-off-year’ elections were once sleepy. And then came Trump.\n\nLocal newsletters: Local headlines (8 a.m.) | Afternoon Buzz (4 p.m.)\n\nLike PostLocal on Facebook | Follow @postlocal on Twitter | Latest local news\n\nAD", "description": "The $1.5M contribution comes on top of $600K given in June with another PAC.", "authors": ["Laura Vozzella", "Local Reporter Covering Virginia Politics"], "top_image": "https://www.washingtonpost.com/resizer/KUw_uAEm0f5WYTZW_ZO3tnzdAcw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/LZZMZIWZSEI6TP5RQSMIONUUOY.jpg", "published_at": "2019-10-06"}