{"pub": "fox", "url": "https://foxbusiness.com/real-estate/wework-facing-massive-rescue-plan-reports", "downloaded_at": "2019-10-22 13:21:34.420044+00:00", "title": "WeWork facing massive rescue plan", "language": "en", "text": "Changes are likely in store Tuesday for the financial and management operations of troubled WeWork.\n\nContinue Reading Below\n\nAccording to FOX Business' Charles Gasparino, the WeWork \"board will decide on a bank debt plan and a SoftBank plan tomorrow\" for the future of the office leasing company. SoftBank's move with WeWork comes, according to Gasparino, after the office workspace will likely consider lending terms presented tomorrow by JPMorgan Chase, which is trying to cobble together a syndicate of debt investors. FOX Business was first to report that the bank was seeking to raise capital for the company.\n\nSeveral reports have cited the SoftBank rescue as anywhere between $4 billion and $5 billion. Gasparino reports that two bailout plans will be presented tomorrow -- one from JPMorgan, which is more in line with a loan and a second from SoftBank, its largest investor, which may be more of a cash infusion.\n\nThe WeWork board may also choose a hybrid plan that combines equity from SoftBank and debt from the JP Morgan financing. All plans carry risk: JP Morgan plan would likely lead to a faster re-entry into the IPO market but it will likely be costly; WeWork could be forced to pay onerous interest rates given its shaky finances. If SoftBank takes a massive equity stake it would dilute many current investors and any IPO would be postponed indefinitely.\n\nWeWork was forced to pull its heavily hyped IPO last month — despite bankers at Goldman pitching valuations as high as $90 billion — after investors began studying its high debt levels, massive losses and its cash burn rate which appeared in its IPO prospectus. Investors balked at the stock sale because they believed these issues were glossed over by the company’s marketing pitches by co-founder and former CEO Adam Neumann through years of savvy promotion. Neumann was also accused of heavy personal spending under little oversight of the board.\n\nMany investors remain worried that the company is still facing undisclosed problems.\n\nSoftBank’s investments in the company that began in 2017 also provided a boost of confidence that papered over these issues and Neumann’s own questionable actions including cashing out roughly $700 million in his WeWork stock before the IPO.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nFOX Business' Charlie Gasparino and Lydia Moynihan contributed to this report.", "description": "WeWork facing massive changes amidst financial rescue efforts", "authors": ["Matthew Mcnulty"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/Adam-Neumann.jpg?ve=1&tl=1", "published_at": "2019-10-21"}