{"pub": "yahoo", "url": "https://news.yahoo.com/eus-tusk-slams-erdogan-threat-refugee-surge-094653441.html", "downloaded_at": "2019-10-12 02:11:13.146713+00:00", "title": "EU's Tusk slams Erdogan threat of new refugee surge 'blackmail'", "language": "en", "text": "EU Council President Donald Tusk accuses Turkey of attempting to \"weaponise\" the 3.6 million Syrian refugees it hosts to ward off criticism of its invasion of the war-torn country's Kurdish-ruled northeast (AFP Photo/Yiannis KOURTOGLOU)\n\nNicosia (AFP) - EU Council President Donald Tusk on Friday condemned as attempted \"blackmail\" a threat by the Turkish president to allow millions of refugees to head to Europe if the bloc criticises Ankara's offensive in Syria.\n\nTusk's comments came during a visit to EU member Cyprus, where he also slammed Turkey over its \"illegal\" drilling off the Mediterranean holiday island.\n\nTurkey is set to dominate the agenda at a meeting of EU foreign ministers in Luxembourg on Monday -- both for the Syria operation and for its continued controversial drilling operations off Cyprus.\n\n\"Turkey must understand that our main concern is that their actions may lead to another humanitarian catastrophe, which would be unacceptable,\" Tusk said.\n\n\"Nor will we ever accept that refugees are weaponised and used to blackmail us. That is why I consider yesterday's threats made by President (Recep Tayyip) Erdogan totally out of place,\" he added.\n\nErdogan made his comments on Thursday in the face of mounting condemnation from European governments of Ankara's long-threatened operation to enforce a buffer zone in northeastern Syria to accommodate some of the 3.6 million refugees currently living in Turkey.\n\n\"Hey EU, wake up. I say it again: if you try to frame our operation there as an invasion, our task is simple: we will open the doors and send 3.6 million migrants to you,\" the Turkish leader said.\n\nUnder a 2016 agreement with the EU, Turkey agreed to prevent refugees from leaving towards Europe in exchange for six billion euros and visa-free travel for its citizens, but has frequently criticised the lack of assistance from Brussels.\n\nTusk condemned Turkey's offensive, launched Wednesday, saying it was \"of grave concern and should stop\".\n\n\"A military intervention will only make matters worse,\" he added, saying it would exacerbate instability in the region, cause further civilian suffering and displacement as well as undermine the fight against the Islamic State group.\n\nTusk said he was vising Nicosia to demonstrate the EU's \"full solidarity\" in the face of Turkey's continued drilling activities in the waters off Cyprus.\n\n- 'Unprecedented escalation' -\n\n\"The European Council has strongly condemned these illegal actions. And in light of the new drilling activities by Turkey... I reconfirm that the EU stands united behind you,\" Tusk said after meeting Cypriot President Nicos Anastasiades.\n\nHe called on Ankara to end the drilling activities, which \"not only undermine the recent efforts to resume Cyprus settlement talks, but... also undermine good neighbourly relations between the EU as a whole and Turkey\".\n\nLast week, Nicosia accused Turkey of defying the bloc by sending another drilling ship to operate inside its waters.\n\nAccording to the Cyprus government, the area where the Turkish vessel is operating is clearly defined under international law as Cypriot territorial waters.\n\n\"These actions constitute an unprecedented escalation of Turkey's illegal behaviour and the most severe provocation so far,\" said Anastasiades.\n\n\"We cannot remain idle,\" he added, saying there was a need for a more \"concrete\" response to Turkey's actions.\n\nThe EU has issued repeated statements condemning the Turkish drilling bloc member Cyprus.\n\nMinisters will have further talks Monday about possible sanctions against individuals involved in the drilling.\n\nBut while Cyprus and Greece are pushing for such measures, diplomats say other countries are more cautious, fearing that sanctions could risk inflaming tensions with Ankara still further.\n\nTurkey is opposed to Nicosia's energy exploration plans and wants a say in the development of hydrocarbons in the region.\n\nAnkara also demands Turkish Cypriots on the divided island have their share of the profits from natural gas but argues a Cyprus solution must be found first.\n\nCyprus has pushed ahead with exploring for offshore energy resources despite the collapse in 2017 of UN-brokered talks to end the country's decades-long division.\n\nTurkey has had troops stationed in the country since 1974 when it invaded and occupied its northern third after a coup sponsored by the military junta then ruling Greece.", "description": "EU Council President Donald Tusk on Friday condemned as attempted \"blackmail\" a threat by the Turkish president to allow millions of refugees to head to Europe if the bloc criticises Ankara's offensive in Syria.  Tusk's comments came during a visit to EU member Cyprus, where he also", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/_jgiX59yBdwXSw0X8JXrKA--~B/aD01NDA7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/645dcf8937a690825f8c502e05e564396b3b7861.jpg", "published_at": "2019-10-11"}