{"pub": "guardian", "url": "https://theguardian.com/sport/live/2019/oct/09/wales-v-fiji-rugby-world-cup-2019-live", "downloaded_at": "2019-10-09 10:43:11.501995+00:00", "title": "Wales v Fiji: Rugby World Cup 2019 – live!", "language": "en", "text": "09:59\n\nPool D: The story so far\n\nThe only other upset of the pool stage saw Urugay beat Fiji Glorious though this was, it was not the upset a neutral might have chosen. Fiji are a side packed full of first‑class talent, who many fancied to make the quarter-finals. Alas, they are now reduced to trying to throw a spanner in someone else’s works (Wales’s). Otherwise, the key game in this pool was Wales-Australia, won by the former in just the sort of bloody-minded fashion they have made their own lately.\n\nWhat’s still at stake? Fiji may yet throw that spanner on Wednesday but it would be of limited use to them. Wales finish against Uruguay on Sunday and will surely take maximum points. In which case it would be Australia who likely benefit, the Wallabies finishing with a game against Georgia on Friday. An upset there is not quite out of the question, but it would be big – of Tonga‑France-in-2011 proportions, if not quite Brighton 2015. If Wales beat Fiji (and they are currently 17-point favourites to do so) they will top the group with a win over Uruguay, which would pitch Australia into the England‑New Zealand side of the draw. Fiji look safe for third place, which would mean Georgia back on the qualification beat for 2023.", "description": "Minute-by-minute report: Will Wales maintain their 100% record in Pool D when they face Fiji? Find out with Barry Glendenning", "authors": ["Barry Glendenning", "Michael Aylwin"], "top_image": "https://i.guim.co.uk/img/media/4e831c719bffb2b2dd09dd7a1a7627926277ed27/0_19_4306_2584/master/4306.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctbGl2ZS5wbmc&enable=upscale&s=25dcb752f6b5353d26d890d092cc73b8", "published_at": "2019-10-09"}