{"pub": "fox", "url": "https://foxnews.com/health/hy-vee-recalls-asian-entrees-undeclared-milk", "downloaded_at": "2019-09-12 07:43:30.238791+00:00", "title": "Hy-Vee recalls several Asian entrees over undeclared milk", "language": "en", "text": "An Iowa company has issued a recall for several varieties of Asian-inspired entrees over concerns that they may contain milk, which is not declared on the product labels.\n\nHy-Vee Inc., which produces Hy-Vee Mealtime Asian Entrees, said all impacted products are marked with a best-by date of Sept. 14, 2019, or Sept. 15, 2019.\n\nHAMBURGER BUNS RECALLED OVER CONCERNS THEY CONTAIN 'SMALL PIECES OF WHITE PLASTIC'\n\nThe company said the liquid egg used to make the fried rice in seven varieties of their product contains milk. While there have been no confirmed reports of adverse reactions to the ingredient, the company removed the products from shelves in stores located in Iowa, Illinois, Missouri, Kansas, Nebraska, South Dakota, Minnesota and Wisconsin.\n\nThe varieties include General’s Chicken 20 oz – Lot Code of 19250 or 19251; Sesame Chicken 20 oz – Lot Code of 19250 or 19251; Sweet Orange Chicken 20 oz – Lot Code of 19250 or 19251; Mongolian-Style Beef 20 oz – Lot Code 19250 or 19251; Cashew Chicken 20 oz – Lot Code of 19250 or 19251; Beef with Broccoli 20 oz – Lot Code of 19250 or 19251; and Fried Rice 16 oz – Lot Code 19250 or 19251.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nAccording to the recall notice on the FDA’s website, all other Asian-inspired items produced by Hy-Vee of the same variety but with different Lot Codes remain on shelves. Customers who purchased any of these products should dispose of them or return them to their local Hy-Vee store for a full refund.", "description": "There have been no confirmed reports of adverse reactions related to the recall.", "authors": ["Alexandria Hein"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/mealtime_chicken.jpg", "published_at": "2019-09-11"}