{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/hunter-biden-trump-resign-chinese-company-impeachment-ukraine-a9154126.html", "downloaded_at": "2019-10-13 18:45:21.665310+00:00", "title": "Hunter Biden steps down from board of Chinese company at centre of Trump allegations", "language": "en", "text": "Hunter Biden, the son of Democratic 2020 frontrunner Joe Biden, is stepping down from the board of a Chinese company at the centre of unverified allegations of wrongdoing by Donald Trump.\n\nThe 49-year-old lawyer and businessman will leave the board of BHR (Shanghai) Equity Investment Fund Management Company on 31 October, his attorney said in a statement.\n\nThe statement went on to say that Mr Biden had not received any profit from his time serving on the board.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThis contradicts claims repeatedly made by the president that Hunter Biden had taken up to $1.5 billion out of China as part of his involvement in the country. Mr Trump has called Mr Biden and his father \"crooked\" over Hunter's business dealings in China and Ukraine, but has so far not been able to produce any evidence for his claims.\n\nMr Trump is now at the centre of an impeachment inquiry which could remove him from office because of accusations that he pressured a foreign leader – Ukraine's Volodymyr Zelensky – to dig up or fabricate dirt on the Biden family.\n\nShape Created with Sketch. Trump impeachment: Who's who in the Ukraine scandal Show all 19 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Trump impeachment: Who's who in the Ukraine scandal 1/19 Donald Trump Accused of abusing his office by pressing the Ukrainian president in a July phone call to help dig up dirt on Joe Biden, who may be his Democratic rival in the 2020 election. He also believes that Hillary Clinton’s deleted emails - a key factor in the 2016 election - may be in Ukraine, although it is not clear why. Reuters 2/19 The Whistleblower Believed to be a CIA agent who spent time at the White House, his complaint was largely based on second and third-hand accounts from worried White House staff. Although this is not unusual for such complaints, Trump and his supporters have seized on it to imply that his information is not reliable. Expected to give evidence to Congress voluntarily and in secret. Getty 3/19 The Second Whistleblower The lawyer for the first intelligence whistleblower is also representing a second whistleblower regarding the President's actions. Attorney Mark Zaid said that he and other lawyers on his team are now representing the second person, who is said to work in the intelligence community and has first-hand knowledge that supports claims made by the first whistleblower and has spoken to the intelligence community's inspector general. The second whistleblower has not yet filed their own complaint, but does not need to to be considered an official whistleblower. Getty 4/19 Rudy Giuliani Former mayor of New York, whose management of the aftermath of the September 11 attacks in 2001 won him worldwide praise. As Trump’s personal attorney he has been trying to find compromising material about the president’s enemies in Ukraine in what some have termed a “shadow” foreign policy. In a series of eccentric TV appearances he has claimed that the US state department asked him to get involved. Giuliani insists that he is fighting corruption on Trump’s behalf and has called himself a “hero”. AP 5/19 Volodymyr Zelensky The newly elected Ukrainian president - a former comic actor best known for playing a man who becomes president by accident - is seen frantically agreeing with Trump in the partial transcript of their July phone call released by the White House. With a Russian-backed insurgency in the east of his country, and the Crimea region seized by Vladimir Putin in 2014, Zelensky will have been eager to please his American counterpart, who had suspended vital military aid before their phone conversation. He says there was no pressure on him from Trump to do him the “favour” he was asked for. Zelensky appeared at an awkward press conference with Trump in New York during the United Nations general assembly, looking particularly uncomfortable when the American suggested he take part in talks with Putin. AFP/Getty 6/19 Mike Pence The vice-president was not on the controversial July call to the Ukrainian president but did get a read-out later. However, Trump announced that Pence had had “one or two” phone conversations of a similar nature, dragging him into the crisis. Pence himself denies any knowledge of any wrongdoing and has insisted that there is no issue with Trump’s actions. It has been speculated that Trump involved Pence as an insurance policy - if both are removed from power the presidency would go to Democratic House Speaker Nancy Pelosi, something no Republican would allow. AP 7/19 Rick Perry Trump reportedly told a meeting of Republicans that he made the controversial call to the Ukrainian president at the urging of his own energy secretary, Rick Perry, and that he didn’t even want to. The president apparently said that Perry wanted him to talk about liquefied natural gas - although there is no mention of it in the partial transcript of the phone call released by the White House. It is thought that Perry will step down from his role at the end of the year. Getty 8/19 Joe Biden The former vice-president is one of the frontrunners to win the Democratic nomination, which would make him Trump’s opponent in the 2020 election. Trump says that Biden pressured Ukraine to sack a prosecutor who was investigating an energy company that Biden’s son Hunter was on the board of, refusing to release US aid until this was done. However, pressure to fire the prosecutor came on a wide front from western countries. It is also believed that the investigation into the company, Burisma, had long been dormant. Reuters 9/19 Hunter Biden Joe Biden’s son has been accused of corruption by the president because of his business dealings in Ukraine and China. However, Trump has yet to produce any evidence of corruption and Biden’s lawyer insists he has done nothing wrong. AP 10/19 William Barr The attorney-general, who proved his loyalty to Trump with his handling of the Mueller report, was mentioned in the Ukraine call as someone president Volodymyr Zelensky should talk to about following up Trump’s preoccupations with the Biden’s and the Clinton emails. Nancy Pelosi has accused Barr of being part of a “cover-up of a cover-up”. AP 11/19 Mike Pompeo The secretary of state initially implied he knew little about the Ukraine phone call - but it later emerged that he was listening in at the time. He has since suggested that asking foreign leaders for favours is simply how international politics works. AFP via Getty 12/19 Nancy Pelosi The Democratic Speaker of the House had long resisted calls from within her own party to back a formal impeachment process against the president, apparently fearing a backlash from voters. On September 24, amid reports of the Ukraine call and the day before the White House released a partial transcript of it, she relented and announced an inquiry, saying: “The president must be held accountable. No one is above the law.” Getty 13/19 Adam Schiff Democratic chairman of the House intelligence committee, one of the three committees leading the inquiry. He was criticized by Republicans for giving what he called a “parody” of the Ukraine phone call during a hearing, with Trump and others saying he had been pretending that his damning characterisation was a verbatim reading of the phone call. He has also been criticised for claiming that his committee had had no contact with the whistleblower, only for it to emerge that the intelligence agent had contacted a staff member on the committee for guidance before filing the complaint. The Washington Post awarded Schiff a “four Pinocchios” rating, its worst rating for a dishonest statement. Reuters 14/19 Lev Parnas and Igor Fruman Florida-based businessmen and Republican donors Lev Parnas (pictured with Rudy Giuliani) and Igor Fruman were arrested on suspicion of campaign finance violations at Dulles International Airport near Washington DC on 9 October. Separately the Associated Press has reported that they were both involved in efforts to replace the management of Ukraine's gas company, Naftogaz, with new bosses who would steer lucrative contracts towards companies controlled by Trump allies. There is no suggestion of any criminal activity in these efforts. Reuters 15/19 Kurt Volker The former US ambassador to NATO was appointed special envoy to Ukraine, and is thought to have played a role in linking Giuliani with Ukraine officials. He resigned just before giving evidence to Congress, which had subpoenaed him. After his testimony it emerged that he had apparently told Giuliani that he was being fed false information about the Bidens from Ukrainian officials. Getty Images 16/19 Marie Yovanovitch A career diplomat who was appointed US ambassador to Ukraine towards the end of Barack Obama’s presidency. She was abruptly recalled from her post in May 2019 amid claims that she was not co-operating with Rudy Giuliani’s unorthodox activities in Ukraine. In the Ukraine phone call Trump refers to her as “the woman” and “bad news” and hints darkly at some sort of retribution, saying: “Well, she’s going to go through some things.” Subpoenaed to give evidence to Congress. AP 17/19 Gordon Sondland A Seattle hotelier who became US ambassador to the European Union after donating $1 million to Trump’s inauguration committee, despite having no diplomatic experience. According to the whistleblower, Sondland met Ukrainian politicians to help them “understand and respond to the differing messages they were receiving from official US channels on one hand and from Mr GIuliani on the other”. Subpoenaed to give evidence to Congress. Reuters 18/19 Gordon Kent A career diplomat, he was number two at the Ukraine embassy under Marie Yovanovitch. He has been subpoenaed to give evidence to Congress. Getty 19/19 Ulrich Brechbuhl An adviser to secretary of state Mike Pompeo, with whom he has run businesses. The two were also at West Point military academy together. Swiss-born Brechbuhl is said to handle “special diplomatic assignments”. Subpoenaed to give evidence to Congress. Getty 1/19 Donald Trump Accused of abusing his office by pressing the Ukrainian president in a July phone call to help dig up dirt on Joe Biden, who may be his Democratic rival in the 2020 election. He also believes that Hillary Clinton’s deleted emails - a key factor in the 2016 election - may be in Ukraine, although it is not clear why. Reuters 2/19 The Whistleblower Believed to be a CIA agent who spent time at the White House, his complaint was largely based on second and third-hand accounts from worried White House staff. Although this is not unusual for such complaints, Trump and his supporters have seized on it to imply that his information is not reliable. Expected to give evidence to Congress voluntarily and in secret. Getty 3/19 The Second Whistleblower The lawyer for the first intelligence whistleblower is also representing a second whistleblower regarding the President's actions. Attorney Mark Zaid said that he and other lawyers on his team are now representing the second person, who is said to work in the intelligence community and has first-hand knowledge that supports claims made by the first whistleblower and has spoken to the intelligence community's inspector general. The second whistleblower has not yet filed their own complaint, but does not need to to be considered an official whistleblower. Getty 4/19 Rudy Giuliani Former mayor of New York, whose management of the aftermath of the September 11 attacks in 2001 won him worldwide praise. As Trump’s personal attorney he has been trying to find compromising material about the president’s enemies in Ukraine in what some have termed a “shadow” foreign policy. In a series of eccentric TV appearances he has claimed that the US state department asked him to get involved. Giuliani insists that he is fighting corruption on Trump’s behalf and has called himself a “hero”. AP 5/19 Volodymyr Zelensky The newly elected Ukrainian president - a former comic actor best known for playing a man who becomes president by accident - is seen frantically agreeing with Trump in the partial transcript of their July phone call released by the White House. With a Russian-backed insurgency in the east of his country, and the Crimea region seized by Vladimir Putin in 2014, Zelensky will have been eager to please his American counterpart, who had suspended vital military aid before their phone conversation. He says there was no pressure on him from Trump to do him the “favour” he was asked for. Zelensky appeared at an awkward press conference with Trump in New York during the United Nations general assembly, looking particularly uncomfortable when the American suggested he take part in talks with Putin. AFP/Getty 6/19 Mike Pence The vice-president was not on the controversial July call to the Ukrainian president but did get a read-out later. However, Trump announced that Pence had had “one or two” phone conversations of a similar nature, dragging him into the crisis. Pence himself denies any knowledge of any wrongdoing and has insisted that there is no issue with Trump’s actions. It has been speculated that Trump involved Pence as an insurance policy - if both are removed from power the presidency would go to Democratic House Speaker Nancy Pelosi, something no Republican would allow. AP 7/19 Rick Perry Trump reportedly told a meeting of Republicans that he made the controversial call to the Ukrainian president at the urging of his own energy secretary, Rick Perry, and that he didn’t even want to. The president apparently said that Perry wanted him to talk about liquefied natural gas - although there is no mention of it in the partial transcript of the phone call released by the White House. It is thought that Perry will step down from his role at the end of the year. Getty 8/19 Joe Biden The former vice-president is one of the frontrunners to win the Democratic nomination, which would make him Trump’s opponent in the 2020 election. Trump says that Biden pressured Ukraine to sack a prosecutor who was investigating an energy company that Biden’s son Hunter was on the board of, refusing to release US aid until this was done. However, pressure to fire the prosecutor came on a wide front from western countries. It is also believed that the investigation into the company, Burisma, had long been dormant. Reuters 9/19 Hunter Biden Joe Biden’s son has been accused of corruption by the president because of his business dealings in Ukraine and China. However, Trump has yet to produce any evidence of corruption and Biden’s lawyer insists he has done nothing wrong. AP 10/19 William Barr The attorney-general, who proved his loyalty to Trump with his handling of the Mueller report, was mentioned in the Ukraine call as someone president Volodymyr Zelensky should talk to about following up Trump’s preoccupations with the Biden’s and the Clinton emails. Nancy Pelosi has accused Barr of being part of a “cover-up of a cover-up”. AP 11/19 Mike Pompeo The secretary of state initially implied he knew little about the Ukraine phone call - but it later emerged that he was listening in at the time. He has since suggested that asking foreign leaders for favours is simply how international politics works. AFP via Getty 12/19 Nancy Pelosi The Democratic Speaker of the House had long resisted calls from within her own party to back a formal impeachment process against the president, apparently fearing a backlash from voters. On September 24, amid reports of the Ukraine call and the day before the White House released a partial transcript of it, she relented and announced an inquiry, saying: “The president must be held accountable. No one is above the law.” Getty 13/19 Adam Schiff Democratic chairman of the House intelligence committee, one of the three committees leading the inquiry. He was criticized by Republicans for giving what he called a “parody” of the Ukraine phone call during a hearing, with Trump and others saying he had been pretending that his damning characterisation was a verbatim reading of the phone call. He has also been criticised for claiming that his committee had had no contact with the whistleblower, only for it to emerge that the intelligence agent had contacted a staff member on the committee for guidance before filing the complaint. The Washington Post awarded Schiff a “four Pinocchios” rating, its worst rating for a dishonest statement. Reuters 14/19 Lev Parnas and Igor Fruman Florida-based businessmen and Republican donors Lev Parnas (pictured with Rudy Giuliani) and Igor Fruman were arrested on suspicion of campaign finance violations at Dulles International Airport near Washington DC on 9 October. Separately the Associated Press has reported that they were both involved in efforts to replace the management of Ukraine's gas company, Naftogaz, with new bosses who would steer lucrative contracts towards companies controlled by Trump allies. There is no suggestion of any criminal activity in these efforts. Reuters 15/19 Kurt Volker The former US ambassador to NATO was appointed special envoy to Ukraine, and is thought to have played a role in linking Giuliani with Ukraine officials. He resigned just before giving evidence to Congress, which had subpoenaed him. After his testimony it emerged that he had apparently told Giuliani that he was being fed false information about the Bidens from Ukrainian officials. Getty Images 16/19 Marie Yovanovitch A career diplomat who was appointed US ambassador to Ukraine towards the end of Barack Obama’s presidency. She was abruptly recalled from her post in May 2019 amid claims that she was not co-operating with Rudy Giuliani’s unorthodox activities in Ukraine. In the Ukraine phone call Trump refers to her as “the woman” and “bad news” and hints darkly at some sort of retribution, saying: “Well, she’s going to go through some things.” Subpoenaed to give evidence to Congress. AP 17/19 Gordon Sondland A Seattle hotelier who became US ambassador to the European Union after donating $1 million to Trump’s inauguration committee, despite having no diplomatic experience. According to the whistleblower, Sondland met Ukrainian politicians to help them “understand and respond to the differing messages they were receiving from official US channels on one hand and from Mr GIuliani on the other”. Subpoenaed to give evidence to Congress. Reuters 18/19 Gordon Kent A career diplomat, he was number two at the Ukraine embassy under Marie Yovanovitch. He has been subpoenaed to give evidence to Congress. Getty 19/19 Ulrich Brechbuhl An adviser to secretary of state Mike Pompeo, with whom he has run businesses. The two were also at West Point military academy together. Swiss-born Brechbuhl is said to handle “special diplomatic assignments”. Subpoenaed to give evidence to Congress. Getty\n\nDespite the threat to his presidency, Mr Trump later doubled down, saying not only Ukraine but China should investigate the Bidens for alleged corruption.\n\nAccording to most polls, Joe Biden is the frontrunner to win the Democratic presidential nomination for the 2020 election, which would pit him directly against Mr Trump.\n\nGeorge Mesires, Hunter Biden's attorney, said his client had done nothing wrong in his business dealings in either China or Ukraine.\n\nHe said: \"Hunter undertook these business activities independently. He did not believe it appropriate to discuss them with his father, nor did he. Hunter always understood that his father would be guided, entirely and unequivocally, by established US policy, irrespective of its effects on Hunter's professional interests.\n\n\"When Hunter engaged in his business pursuits, he believed that he was acting appropriately and in good faith. He never anticipated the barrage of false charges against both him and his father by the president of the United States.\"\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nHis statement goes on to say that, should Joe Biden be elected president next November, \"Hunter will readily comply with any and all guidelines or standards a President Biden may issue to address purported conflicts of interest, or the appearance of such conflicts, including any restrictions related to overseas business interests. In any event, Hunter will agree not to serve on boards of, or work on behalf of, foreign owned companies.\"\n\nMr Trump and his family have raised the pressure on Hunter Biden over the past week, seeking to popularise the phrase \"Where's Hunter\" as if to suggest that he is lying low.\n\nOn Saturday the president told reporters: \"I think Hunter Biden is a disgrace. You know, the number-one T-shirt selling right now is, \"Where's Hunter?\" I came up with that one last night.\"\n\nAnd on Thursday night Mr Trump's son Eric warmed up the crowd at a rally in Minnesota by trying to repurpose his father's notorious 2016 \"Lock her up\" chant against Hillary Clinton.\n\nSuggesting Hunter Biden be imprisoned for a crime for which there is so far no evidence, Eric Trump said: \"How do you think his son is feeling after embezzling a lot of money? A lot of crookedness, he is not feeling too good. Maybe 'Lock her up' goes to 'Lock him up'.”\n\nAfter Mr Biden's announcement that he was stepping down from the board of the Chinese company, the president tweeted: \"Where’s Hunter? He has totally disappeared! Now looks like he has raided and scammed even more countries! Media is AWOL.\"", "description": "Hunter Biden, the son of Democratic 2020 frontrunner Joe Biden, is stepping down from the board of a Chinese company at the centre of unverified allegations of wrongdoing by Donald Trump. The 49-year-old lawyer and businessman will leave the board of BHR (Shanghai) Equity Investment Fund Management Company on 31 October, his attorney said in a statement. The statement went on", "authors": ["Phil Thomas"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/04/00/bidens.jpg", "published_at": "2019-10-13"}