{"pub": "businessinsider", "url": "https://businessinsider.com/how-to-file-taxes-tax-return-instructions", "downloaded_at": "2019-10-02 00:38:55.159527+00:00", "title": "How to file taxes for 2019", "language": "en", "text": "Tax Day 2020, the last day to file your 2019 tax return, is Wednesday, April 15.\n\nIf your adjusted gross income for 2019 was less than $66,000, you can file your federal tax return — and sometimes state tax return as well — for free online.\n\nTax refunds typically arrive within three weeks of filing, and the IRS recommends receiving it via direct deposit.\n\nTax season will be here before we know it.\n\nThe deadline to submit your tax return in 2020 — or file an extension with the IRS — is Wednesday, April 15. The earlier you file, the sooner you'll get your refund if you're owed one.\n\nHere's what to expect when you submit your tax return next year.\n\nYou can file your taxes for free if you know where to look\n\nMany online tax services allow you to file your federal taxes for free — and sometimes state taxes as well — if your adjusted gross income was less than $66,000 in 2019. You can check your options using the IRS Free File lookup.\n\nYou can also download the IRS2Go app to find free tax-filing assistance, check your refund status, or make a payment.\n\nYou can still file for free if you make more than $66,000, but to do so, you'll need to use the Free File Fillable Forms. The IRS recommends using those forms only if you have experience preparing tax returns on your own.\n\nYou should receive all of your tax documents by early February\n\nBefore you file your taxes, you need to collect all your 2019 tax documents. If you're an employee, that means your W-2; if you're a freelancer, you may have multiple 1099 forms. In some cases, you may have other statements, such as income earned from an interest-bearing savings account or interest paid on a loan, or even taxable bitcoin gains.\n\nMost tax-related documents must be filed by your employer or other institution by January 31, and the statements must be postmarked by that date as well. That means you should have received everything you need by early February.\n\nIn the meantime, you can estimate your tax refund for this year using an online tax calculator.\n\nThe IRS recommends e-filing and choosing direct deposit\n\nThe IRS says the fastest way to get your tax refund is the method already used by most taxpayers: filing electronically and selecting direct deposit as the method for receiving your refund.\n\nThe IRS says direct deposit — which the government also uses for Social Security and Veterans Affairs payments — is \"simple, safe, and secure.\"\n\nPopular online tax services like TurboTax and H&R Block are easy to use, even for tax novices — but they aren't the only option for e-filing your taxes for free. If you plan to visit an accountant, make an appointment early to avoid the rush.\n\nYou should receive your tax refund within 21 days of filing\n\nYour tax refund should hit your bank account within three weeks of filing online, assuming you opt to receive it via direct deposit. Often, you'll get your money even faster.\n\nYou can check the status of your tax refund using the IRS's return-tracking service 24 hours after filing your tax return online or four weeks after mailing a return.\n\nStates that tax income also issue refunds, and you can check the status of your refund on your state's government website.\n\nIf you owe taxes, you don't have to pay all at once\n\nYour tax situation can change over time — for example, if you get married, buy a home, or have a child — so it's always a good idea to review your W-4 tax-withholding form at the start of a new year. If you didn't review your withholding this year, changes in your tax situation may result in a larger or smaller tax bill.\n\nRegardless of when you file your tax return, your 2019 tax bill is due April 15. You can file early and schedule a payment for that day (or anytime before) if you aren't quite ready to pay.\n\nBut, if you can't afford to pay your tax bill in full, don't pull out your credit card or ignore the situation. The IRS offers reasonable payment plans at much lower interest rates than most banks. You may even be able to settle the bill for less than you owe, called an offer in compromise, or request a deferment until you can make a payment.\n\nKeep copies of your old tax returns for at least 3 years\n\nYou don't have to save your tax returns forever. The IRS recommends holding onto copies for at least three years — the typical length of time the IRS would look back if you happen to get audited.\n\nMost audits cover returns filed over the past two years, but the IRS can go back further if the situation calls for it. But audits shouldn't be cause for worry for most taxpayers. Fewer than 1% of tax returns are audited by the IRS.\n\nWhen you dispose of old tax returns, make sure to properly shred the documents to protect against identity theft.\n\nWhat to do if you've been a victim of tax fraud\n\nTax season presents plenty of opportunity for would-be identity thieves. A stolen Social Security number can be used to file a fraudulent tax return and refund request, but it's not the only tax scam out there. The IRS keeps track of the most common tax-related crimes, and the list is long and varied.\n\nThe best way to protect against tax scams — especially potential identity theft — is to file your tax return as soon as possible.\n\nIf you think you are a victim of identity theft or tax fraud, you should report it to the Treasury Inspector General for Tax Administration. The IRS also has detailed instructions on what to do if you are a victim of tax fraud.\n\nThe US Department of Justice says the IRS never discusses personal tax issues through unsolicited emails or texts, or over social media. Be wary if you are contacted by someone claiming to be from the IRS who says you owe money. When the IRS needs to get in touch with a taxpayer, standard practice is to send a letter via the US Postal Service. If you receive an unexpected and suspicious email from the IRS, forward it to phishing@irs.gov.", "description": "Tax Day 2020, the last day to file your 2019 tax return, is Wednesday, April 15. Here's everything you need to know about filing your tax return.", "authors": ["Tanza Loudenback"], "top_image": "https://image.businessinsider.com/5d92418b2e22af252c3a8295?width=1200&format=jpeg", "published_at": "2019-10-01"}