{"pub": "metro", "url": "https://metro.co.uk/2019/10/11/bride-savagely-mocked-engagement-ring-looks-like-squirt-mayo-10901029", "downloaded_at": "2019-10-11 12:47:17.607330+00:00", "title": "Bride is savagely mocked for engagement ring that looks like ‘a squirt of mayo’", "language": "en", "text": "Most people compared it to white condiments (Picture: Facebook)\n\nFor most budding brides, showing off their engagement ring is a special moment.\n\nRegardless of whether the ring is nice or not, people know to say something complimentary or at the very least, keep their mouths shut.\n\nHowever, as we all know, these rules don’t seem apply to the internet and people can be pretty savage – as one bride recently discovered.\n\nThe woman posted an image of her ring, which used to belong to her great-grandmother, to the Facebook group That’s It I’m Ring Shaming and it was ripped to shreds in the comments section.\n\nIt is, admittedly, quite unique, with a white shape in the form of an ‘s’, fitted into an oval frame in a 14k gold band.\n\n‘I love it so much,’ she wrote on the post, but others did not share this view.\n\nSome of the moderately kinder comments said it was a ‘blob ring’ and that it ‘looks like a swan’, but the rest compared it to various white substances.\n\nAdvertisement\n\nAdvertisement\n\nOne person said: ‘It looks like a squirt of mayo.’\n\n‘Looks like a squirt of aioli,’ someone else wrote.\n\nA third person suggested it ‘looks like toothpaste’.\n\nOne particularly savage member of the group simply stated ‘it’s semen’. Ouch.\n\nAt least the bride can take comfort in that she’s not the only one to have her ring shamed in the group.\n\nPrevious delights include a ring that looks like a ‘prolapsed butthole’ and another which apparently resembled a ‘jewel encrusted speculum’.\n\nJust this morning, we also revealed a ‘door knob’ wedding ring, which someone said was ‘the most horrid ring’ they’d ever seen.\n\nThe lesson to learn here? Don’t post photos of your ring online.\n\nMORE: ‘Door knob’ wedding ring is being mercilessly teased online\n\nMORE: Mum asks ring-shaming group for help choosing a breastfeeding ring\n\nMORE: Bride-to-be shames partner of eight years for ‘tiny’ ring he bought her\n\nAdvertisement Advertisement", "description": "A photo of the ring, which belonged to her great-grandmother, was posted to the Facebook group That's It I'm Ring Shaming.", "authors": ["Almara Abgarian"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_89413329_1570791912.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-11"}