{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-eu-loopholes/explainer-looking-for-loopholes-how-could-uk-pm-johnson-avoid-delaying-brexit-idUKKBN1WB1RD", "downloaded_at": "2019-09-26 15:19:48.016928+00:00", "title": "Explainer: Looking for loopholes - How could PM Johnson avoid delaying Brexit?", "language": "en", "text": "LONDON (Reuters) - British Prime Minister Boris Johnson has said he will refuse to seek a delay to Brexit, raising fears he could try to exploit a loophole to bypass legislation aimed at preventing the country leaving the European Union without a deal.\n\nBritain's Prime Minister Boris Johnson leaves Downing Street in London, Britain, September 25, 2019. REUTERS/Henry Nicholls\n\nJohnson has made what appears to be two contradictory statements: he will obey the law, but will not request an extension to Britain’s scheduled Oct. 31 exit.\n\nJunior Brexit minister James Duddridge was repeatedly asked by lawmakers in parliament on Thursday how the prime minister could do both. He said the government’s “Plan A” was to get round the law by agreeing a Brexit deal.\n\nUnder the so-called Benn Act if, by Oct. 19, the government has not got parliamentary approval for a divorce deal with Brussels or for leaving the EU without a deal, Johnson must request a delay until Jan. 31, 2020. The act even gives a text of the letter he must send.\n\nSo how could Johnson avoid a Brexit delay?\n\n1) DOUBLE CROSS\n\nJolyon Maugham, a lawyer who is part of the legal team which defeated the government over its decision to suspend parliament, said a weakness of the law is that if a divorce deal is approved by parliament on, or prior to, Oct. 19, the obligation to request an extension will cease.\n\nHowever, Maugham says further preconditions need to be met before the divorce deal can be ratified and no-deal avoided. In particular, a separate law implementing the withdrawal agreement needs to be approved by parliament by Oct. 31.\n\nHe said there could be a scenario where lawmakers pass the divorce deal on or before Oct. 19, and therefore Johnson is not required to write the letter, but then the subsequent legislation gets blocked in parliament and Britain leaves without a deal.\n\n2) GET EU TO REJECT EXTENSION REQUEST\n\nThe British government could comply with the letter of the law but not the spirit of it, by requesting an extension but seeking to get the EU to reject it.\n\nIt could do this in a number of ways:\n\na) Send a second letter - The law sets out the wording of the letter the prime minister has to send to Brussels to request the delay. British media have reported he was considering sending a second letter making clear the government does not actually want a delay. Legal experts have said any second letter is likely to be considered unlawful however.\n\nb) Veto the extension - Any extension has to be agreed by all EU member states. Some lawmakers have suggested Britain could seek to veto its own extension request. Or persuade a country friendly to Britain, like Hungary, to veto it.\n\nc) Threaten sabotage - The Daily Telegraph newspaper quoted a source in Johnson’s office saying Britain would make clear it would sabotage any request for delay and then the delay itself. Britain could cause havoc to EU business during the delay, for example by vetoing key decisions.\n\n“Once people realise our plans, there is a good chance we won’t be offered a delay,” the source was quoted as saying.\n\n3) TWO CONFLICTING LAWS\n\nWhile the Benn Act requires Johnson to seek an extension to Brexit if parliament has not approved either a deal or leaving without a deal by Oct. 19, a different law, the European Union Withdrawal Act, states Britain will leave the EU on Oct. 31.\n\nIt is not clear which of these laws takes precedence.\n\nPro-Brexit Conservative lawmaker Bill Cash pointed to this in parliament on Thursday saying: “There is an apparent inconsistency between that (Benn) Act and the Withdrawal Act ... the reality is compliance is not just a simple question. It is a matter of grave importance in terms of which law is the law of the land.”\n\nThe government has repeatedly said only that it will comply with “the law”, without specifying which one. It may try and argue that it is following the law by taking Britain out on Oct. 31.\n\n4) IGNORE THE LAW\n\nFormer Conservative leader Iain Duncan Smith has urged Johnson to ignore the law and said he would be a Brexit “martyr”.\n\nIf this happened, Johnson could be found in contempt of court and risks being jailed.\n\nAnti-Brexit campaigners have filed a legal challenge in Scotland in an effort to compel Johnson to seek an extension to membership of the EU.\n\nThe case is being fronted by Maugham, who said this week the case could end up before the Supreme Court in mid-October. Maugham said that if Johnson refuses to seek an extension they would ask the court to make the extension application on the prime minister’s behalf.\n\n5) OTHER LOOPHOLE?\n\nIt is possible the government could have identified another unknown loophole. Questioned about the delay law in parliament on Thursday, Junior Brexit minister James Duddridge said it was “not perfect”.\n\nHe specifically cited an amendment to the law, put forward by opposition Labour lawmaker Stephen Kinnock, which sets out that a delay should be used to debate and approve a Brexit deal based largely on the agreement reached by Johnson’s predecessor Theresa May.\n\n“The Kinnock amendment that was passed, the government believes does have deficiencies and its effect is unclear,” he said.\n\nAsked whether he thought the law requires the prime minister to write a letter requesting an extension, he said “The government will take legal advice on this.”", "description": "British Prime Minister Boris Johnson has said he will refuse to seek a delay to Brexit, raising fears he could try to exploit a loophole to bypass legislation aimed at preventing the country leaving the European Union without a deal.", "authors": ["Andrew Macaskill", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190926&t=2&i=1434180499&w=1200&r=LYNXMPEF8P16S", "published_at": "2019-09-26"}