{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/watch-child-ripped-from-womans-arms-by-police-as-refugees-removed-from-unhcr-offices-20191030", "downloaded_at": "2019-10-30 14:25:25.672593+00:00", "title": "WATCH | Child ripped from woman's arms by police as refugees removed from UNHCR offices", "language": "en", "text": "A child is ripped from the arms of a woman during a forced removal of refugees from outside the UNHCR offices in Cape Town. (Screengrab, Bob Mwiinga Munyati)\n\nA child was ripped away from the arms of a defenceless woman as police forcibly removed hundreds of refugees from outside the offices of the UN High Commission for Refugees in Cape Town's CBD on Wednesday.\n\nForeign nationals and refugees have been conducting a peaceful sit-in protest over safety concerns in SA for the past few weeks outside the offices.\n\nNews24 reported on Wednesday that multiple police officers gathered around the site in St George's Mall and removed protesters.\n\nVideos of violent removals have been widely shared on social media.\n\nThe latest video shows police violently removing a girl from a woman on the ground, while she desperately tries to hold on to the child.\n\nThe child desperately grabs on to the woman, while three police officers force her to let go.\n\nThe violent exchange goes on for a couple of seconds, before the woman is overpowered and the child taken from her, with her left shaking her head at what she had just been through. The child is then taken away from her.\n\nWestern Cape police said in a statement that about 100 people had been arrested after \"they failed to heed the call to disperse\".\n\nPolice were assisting the enforcement of an October 18 court order to evict about 300 refugees and asylum seekers who were participating in the peaceful sit-in protest. The landlord of the property applied for the order.\n\nOfficials from the social development and home affairs departments were also present, News24 reported.\n\nSome of the evicted refugees have bee provided with a safe haven at the nearby Central Methodist Church.\n\n- Compiled by Kamva Somdyala", "description": "A child has been ripped away from the arms of a defenceless woman as police forcibly removed hundreds of refugees from outside the offices of the UN High Commission for Refugees in Cape Town.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9538/dd0991e4178e44328e0e52fbd9b8b979.jpg", "published_at": "2019-10-30"}