{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7539931/Hailey-Bieber-reps-Cornell-makes-coffee-run-Beverly-Hills-South-Carolina-wedding.html", "downloaded_at": "2019-10-05 07:58:09.068023+00:00", "title": "Hailey Bieber reps Cornell as she makes coffee run in Beverly Hills after South Carolina wedding", "language": "en", "text": "It's been a busy week for Hailey Bieber, who got married to her popstar hubby Justin for the second time on Monday in South Carolina.\n\nSince returning home to Los Angeles, the couple has already appeared together in Justin's 10,000 Hours video with Dan + Shay and a Calvin Klein campaign.\n\nBut Hailey kept it super casual Friday for a coffee run with a friend (and no Justin) in Beverly Hills.\n\nCoffee run: Hailey Bieber kept it super casual Friday for a coffee run with a friend (and no Justin) in Beverly Hills\n\nAlthough it still feels like summer in Southern California, she dressed for fall weather in an oversized grey Cornell sweatshirt.\n\nShe paired it with a black Oakland Raiders baseball cap, wearing her hair back in a bun.\n\nThe 22-year-old glammed it up a bit with some thick gold hoop earrings, a matching necklace and some blinged out rings, including her new $500k Tiffany engagement ring.\n\nHailey's friend repped Justin, sporting an oversized white t-shirt from his merch brand Drew.\n\nSweater weather: Although it still feels like summer in Southern California, she dressed for fall weather in an oversized grey Cornell sweatshirt\n\nHats off: She paired it with a black Oakland Raiders baseball cap, wearing her hair back in a bun\n\nMeanwhile: Hailey's husband Justin Bieber was spotted out shirtless in Beverly Hills\n\nHow thoughtful: The pop star appeared to be giving his assistant a plate of food\n\nJustin and Hailey got married Monday in South Carolina's Montage Palmetto Bluffs, having wed for the first time last year in New York City.\n\nThe star-studded guest list included some Jenners, some Baldwins and Justin's controversial manager Scooter Braun.\n\nThe couple put on a romantic display Friday, when they appeared in Justin and Dan + Shay's video for 10,000 Hours.\n\nVideo vixen: The couple put on a romantic display Friday, when they appeared in Justin and Dan + Shay's video for 10,000 Hours\n\nBed of flowers: It featured them donning white as they snuggled in a bed surrounded by lush floral arrangements\n\nStripped down: They then heated things up a bit for their appearance in the latest Calvin Klein campaign, which also features Kendall Jenner, Troye Sivan and A$AP Rocky\n\nIt featured them donning white as they snuggled in a bed surrounded by lush floral arrangements.\n\nThey then heated things up a bit for their appearance in the latest Calvin Klein campaign, which also features Kendall Jenner, Troye Sivan and A$AP Rocky.\n\nCelebrating the brand's 50th birthday, the video showed the newlyweds engaging in some PDA, while scantily clad in their Calvin Klein underwear.", "description": "The couple put on a romantic display Friday, when they appeared in Justin and Dan + Shay's video for 10,000 Hours. They then heated things up for the latest Calvin Klein campaign.", "authors": ["Glenn Garner For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/01/19320360-0-image-a-17_1570235567813.jpg", "published_at": "2019-10-05"}