{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/argentina-elections-2019-191026232325874.html", "downloaded_at": "2019-10-27 04:01:59.890003+00:00", "title": "Argentina elections: Five things to know", "language": "en", "text": "Buenos Aires, Argentina - Argentines will head to the polls on Sunday to choose a new president, in an election that observers say has a foregone conclusion.\n\nMost polls forecast that centre-left candidate Alberto Fernandez could win by about 20 percentage points, soundly beating incumbent President Mauricio Macri.\n\nArgentines are angry over the country's struggling economy and rising poverty.\n\n\n\nVoting stations are set to open at 8am local time (11:00 GMT) on October 27 and will close at 6pm (21:00 GMT).\n\nAs Argentines prepare to go to the polls, here is what you need to know.\n\n1. Who are the main candidates?\n\nAlthough there are six presidential candidates, the contest appears to be between just two: Macri, a conservative who is favoured by investors, and opposition leader Fernandez, a university professor and a moderate, who held a key role in the government of late President Nestor Kirchner.\n\nThe son of an industrial magnate, Macri represents the wealthy class in Argentina. He presided over the the Boca Juniors football club before serving eight years as mayor of Buenos Aires.\n\nArgentina's President and Current presidential candidate Mauricio Macri speaks during a closing campaign rally in Cordoba, Argentina [Carlos Garcia Rawlins/Reuters]\n\nFernandez, who has continued to teach law at the University of Buenos Aires during the campaign, is running with former President Cristina Fernandez de Kirchner. He had previously parted ways with Fernandez de Kirchner in her first term as president over a dispute about farming tariffs.\n\nUnder the banner of Frente de Todos (Front for all), Fernandez is seen as a more moderate figure than the divisive Fernandez de Kirchner, who is still dogged by allegations of corruption during her administration.\n\nBut Fernandez de Kirchner remains a potent political force in Argentina, commanding a sizeable chunk of the electorate and drawing large crowds. Many people say they are voting for her, not Fernandez.\n\nArgentina's presidential candidate Alberto Fernandez and his running mate former President Cristina Fernandez de Kirchner greet supporters during a closing campaign rally in Mar del Plata, Argentina [Agustin Marcarian/Reuters]\n\n2. How does voting work in Argentina?\n\nTo win the election in the first round, a candidate would need 45 percent of the vote, or 40 percent and a 10 point lead over the second place candidate. If no clear winner emerges, the candidates head to a second round runoff, which is scheduled for November 24.\n\nVoting is mandatory for citizens over the age of 18, and optional for 16- to 18-year-olds as well as for those who are over the age of 70. There are nearly 34 million registered voters.\n\nThe electorate will also be selecting 130 national deputies, and 24 national senators. In addition, three provinces will elect new governors, the city of Buenos Aires will elect its head of government and there will be elections for regional mayors.\n\n3. What are the main issues?\n\nArgentines say the election is all about the economy. Macri, of the Juntos Por El Cambio (Together for Change) coalition, took office in 2015 on a promise to revive and modernise Latin America's third largest economy. He ushered in an era of neoliberal policies, slashing government spending, eliminating subsidies and opening the country up to investment.\n\nMacri claimed some success at first, as the country briefly clawed its way out of recession, but austerity measures triggered mass protests on the street. In 2018, a financial crisis struck again forcing Macri to strike a $57bn bailout deal with the International Monetary Fund (IMF), which plunged the peso and hurt his support with voters who blame the lender for creating the conditions that led to the country's economic collapse in 2001.\n\nCampaign posters for opposition presidential candidate Alberto Fernandez are reflected in an electronic board that shows currency exchange in Buenos Aires's financial district [Ricardo Moraes/Reuters]\n\nThe economy has been struggling since, with rising unemployment and inflation, which is expected to reach 55 percent by the end of the year, according to the Argentine Central Bank. Poverty levels have reached 35 percent with more than half of the country's children living under the poverty line, according to the national statistics institute.\n\nIn August, Fernandez beat Macri by an unexpected 16 points in the primary elections - rattling the country's currency markets and driving the peso to record lows as investors feared a return to left-wing populism and interventionist policies.\n\n191026134638481\n\nCandidates have sparred over other issues such as legalising abortion, the battle against narcotrafficking and political corruption. The latter produced a testy exchange between Macri and Fernandez in the last televised debate, in which Macri accused his opponent of turning a blind eye to corrupt practices while he was in government. Fernandez said he had nothing to do with corruption. During the debate, Fernandez also mentioned investigations into members of Macri's family, including the president's deceased father. Macri said it was bad form to call into question his father, who cannot defend himself.\n\nStill, no other issue has dominated the conversation like the economic uncertainty gripping the country.\n\n\"Most of electorate has said that they want to change the crisis conductor,\" said Paola Zuban, a political scientist and director of investigations at the Argentine consultancy firm Gustavo Cordoba & Associates.\n\nShe added, however, that \"in economic terms, Fernandez will not have a lot of room to manoeuvre. He's in a difficult position.\"\n\nMacri's message has been one of staying the course and having patience. His campaign has highlighted the money poured into public infrastructure projects - sewers and roads that it said showed the government's commitment to fixing structural issues in the country. Macri also warned voters of the perils of going \"back to the past\".\n\nIn the lead up to the election, Fernandez has heavily criticised his opponent's handling of the economy. In a recent televised debate, he said the key to creating more employment is to encourage small businesses to open up again, and \"the first thing we're going to do is to make sure [small businesses] stop paying dolarised tariffs that only benefit the president's friends\". He has vowed to make tackling poverty and hunger a priority for his government.\n\n4. What has been Fernandez's appeal?\n\nZuban said Fernandez has been able to retain most of Fernandez de Kirchner's supporters, and expand on them. His politics have also appealed to younger voters, who make up almost 40 percent of the electorate.\n\n191024190655759\n\n\"The role of young people is fundamental in this election,\" she said.\n\n\"A huge portion of the electorate are millennials whose political participation is very different from voters who are over the age of 50, who are more likely to support Macri.\"\n\n5. What should you watch for after the elections?\n\nAll eyes will be on the markets to see their reaction if Fernandez wins.\n\nIn an interview with a local radio station on Monday, Fernandez said he hoped for calm.\n\n\"Argentines do not have to be nervous, I ask you to be confident because those who created this disaster are leaving,\" said Fernandez.", "description": "Polls show that Alberto Fernandez, with Cristina Fernandez de Kirchner as his running mate, is likely to unseat Macri.", "authors": ["Natalie Alcoba"], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/26/0b825219770e4b678d701507464b219c_18.jpg", "published_at": "2019-10-27"}