{"pub": "wsj", "url": "https://marketwatch.com/story/worries-over-us-china-trade-talks-limit-european-stocks-2019-10-07?mod=rsswn", "downloaded_at": "2019-10-07 12:13:55.776362+00:00", "title": "European stocks turn higher as Wall Street open approaches", "language": "en", "text": "Reuters A steel worker of Germany's industrial conglomerate ThyssenKrupp AG stands amid sparks of raw iron from a blast furnace at Germany's largest steel factory in Duisburg, Germany.\n\nEuropean stocks on Monday turned higher in afternoon trade, led by pharmaceutical and food producers.\n\nAfter losing 2.95% last week, the Stoxx Europe 600 SXXP, +0.32% increased 0.52% to 382.19.\n\nRelated: JPMorgan says it’s time to buy Europe stocks. Goldman Sachs says, not so fast\n\nThe German DAX DAX, +0.19% added 0.51% to 12073.79, the French CAC 40 PX1, +0.15% rose 0.42% to 5511.33 and the U.K. FTSE 100 UKX, +0.24% rose 0.41% to 7184.63.\n\nAfter a 372-point burst in the Dow Jones Industrial Average DJIA, +1.42% on Friday, U.S. stock futures ES00, -0.26% declined, as Bloomberg News reported China negotiators were trying to limit scope of talks. Chinese officials haven’t responded to the report.\n\nThe overall economic backdrop in Europe continues to be a concern. Germany on Monday reported a 0.6% drop in factory orders in August. That was worse than the 0.4% gain expected in a FactSet-compiled economist poll.\n\nBuilding materials supplier SIG SHI, -13.89% slumped 16% after saying a deterioration in U.K. and German trading conditions has “accelerated.”\n\nOsram Licht OSR, +2.26% shares fell over 4% after ams AMS, -0.64% said it didn’t get the necessary shareholder approval for its takeover bid to succeed. A rival consortium of Advent International and Bain Capital is trying to buy the German company.\n\nAms shares dropped 3% in Swiss trade.\n\n“As it stands, we see risks that the Osram share will retreat towards its pre-M&A bids levels unless new announcements are made re a potential new offer/intention of offer,” said analysts at Morgan Stanley.\n\nBayer BAYN, +2.86% shares rose 1.4% as Handelsblatt reported a U.S. trial relating to the herbicide Roundup has been postponed until next year, which the newspaper said was a sign the company was pursuing settlements.", "description": "European stocks on Monday turned higher in afternoon trade, led by pharmaceutical and food producers.", "authors": ["Steve Goldstein", "European Markets Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HS749_german_ZG_20191007045817.jpg", "published_at": "2019-10-07"}