{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/16/WS5da67acda310cf3e35570bb0.html", "downloaded_at": "2019-10-16 03:55:36.387228+00:00", "title": "Man gets prison time for subway indecency in Shanghai", "language": "en", "text": "By Cao Chen in Shanghai | China Daily | Updated: 2019-10-16 10:05\n\nA man convicted of compulsive indecency in a subway car in Shanghai was sentenced to six months imprisonment, Shanghai Jing'an District People's Court announced on Tuesday.\n\nIt was the city's first coercive indecent assault case in which the court issued a prison sentence.\n\nThe man, surnamed Wang, 34, sat closely beside a female minor on a subway car of metro line 8 for around five minutes on July 1, during which he touched the girl's breast by pretending to casually put his left hand on his right arm.\n\nThe girl moved to another seat to avoid the assault, but Wang kept following to harass her.\n\nWang later touched another woman's breast in the same way on the subway route. However, the woman confronted him and he was immediately arrested while trying to escape.\n\nThe court said the man's acts infringed on the victims' rights and caused public disorder.\n\nReports of sexual harassment on public transportation have been common.\n\nRecent cases include a man who was accused of using his cellphone to secretly take pictures of a woman under her skirt on the subway in Guangzhou, Guangdong province, and a man in Beijing who sexually harassed a woman on a bus. Both were arrested thanks to the assistance of fellow passengers.\n\n\"Criminals in such cases are normally sentenced to detention due to insufficient evidence,\" said Ren Haitao, an associate professor of law at East China Normal University. \"Victims often feel too ashamed to contact the police, and they avoid investigation.\"\n\nA report by the public opinion monitoring office of People's Daily in 2017 showed that among the 40 news reports on sexual harassment incidents on public transport in the first half of that year, only 20 percent of the victims called the police. Around 27 percent shouted at the offenders, while most reacted passively, simply leaving their seats quietly or staring back.\n\n\"As such, criminals repeatedly commit crimes, which put passengers' safety at risk on public transportation,\" Ding Dehong, deputy dean of the Shanghai Jing'an District People's Court, was quoted as saying by local online news outlet eastday.com after the closure of the case.\n\n\"This new case will help deter those with similar criminal intent, help control the crime rate and urge more women to fight for their rights and safety,\" Ding said.\n\nRen said victims should act to protect themselves by taking photos or videos on mobile phones for critical evidence.\n\n\"Shouting for help from people around, including passengers, security guards or police, is also vital for arresting the criminals,\" he said. \"Victims should also actively cooperate with the police in investigations.\"\n\nRen also noted new approaches could be explored by the government to prevent similar cases, such as launching women-only subway cars.", "description": "A man convicted of compulsive indecency in a subway car in Shanghai was sentenced to six months imprisonment, Shanghai Jing'an District People's Court announced on Tuesday.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/16/5da67acda310cf3e97a16d30.jpeg", "published_at": "2019-10-16"}