{"pub": "usatoday", "url": "https://usatoday.com/story/sports/mlb/playoffs/2019/10/29/how-to-watch-astros-vs-nationals-world-series-game-6-mlb-live-stream-schedule-tv-channel-start-time/2500050001", "downloaded_at": "2019-10-30 00:06:08.414278+00:00", "title": "How to watch Astros vs. Nationals: MLB live stream, schedule, TV channel, start time for World Series Game 6", "language": "en", "text": "USA TODAY Sports\n\nAfter winning three games in a row, the Houston Astros have a chance to secure their second World Series title in three years.\n\nThe Astros took all three games in Washington after dropping the first two at home, and now the series heads back to Houston for Game 6 – as well as a potential Game 7.\n\nWashington's offense was the big problem in Games 3-5, scoring just three runs total. The Nationals went 1-for-21 with runners in scoring in position in those games and the only hit didn't even plate a run.\n\nTuesday night's game features a heavyweight pitching matchup between Justin Verlander and Stephen Strasburg.\n\nTime: 8:07 p.m. ET\n\nTV channel: Fox\n\nLive stream: FoxSports.com, YouTube TV\n\nBetting: Full odds, lines at USA TODAY Sports\n\nThe 36-year-old Verlander (21-6, 2.58 ERA) hasn't been at his best in the postseason, going 0-3 in his last four starts, including losses in two potential clinchers – Game 4 of the ALDS and Game 5 of the ALCS. In six career World Series starts, Verlander is 0=5 with a 5.73 ERA, including a loss in Game 2 this year.\n\nFor Washington, Strasburg (18-6, 3.32 ERA) has been dominant this October. He's 4-0 with a 1.93 ERA and 40 strikeouts in 28 innings, and picked up the win in Game 2 in Houston.", "description": "After winning all three games in Washington, the Astros are on the brink of their second World Series title in three years", "authors": [], "top_image": "https://www.gannett-cdn.com/presto/2019/10/29/USAT/445439db-f494-419b-9ca9-51d712b02ee8-USATSI_13581850.jpg?crop=2773,1560,x100,y33&width=2340&height=1560&format=pjpg&auto=webp", "published_at": "2019-10-29"}