{"pub": "nytimes", "url": "https://nytimes.com/2019/09/28/opinion/sunday/chinese-nationalism.html", "downloaded_at": "2019-09-29 00:19:42.365666+00:00", "title": "Opinion | The Making of a Chinese Patriot", "language": "en", "text": "The first thing to note about Chinese patriotism is that it was born out of conflict. Unlike in a democratic country where the people vote to elect their leaders, the Chinese Communist Party first claimed the mantle of legitimacy after the Sino-Japanese War. That is, the party led the Chinese people to eventually overthrow “the rule of imperialism, feudalism and bureaucrat-capitalism,” and “founded the People’s Republic of China,” as the preamble of our Constitution puts it. As a result, to love the state means to endorse the party. “Without the Communist Party, there would be no New China,” the famous “red” song goes.\n\nAnd it was also born out of shame. Growing up, we learned that the Qing government was so weak that it signed many unfair treaties with the Western and Japanese colonizers over the course of the 19th century. We learned that even after the empire fell apart in 1911, the new government, dominated by warlords, was corrupt enough to let Japan occupy Shandong province after World War I. We learned that millions of our countrymen had been killed during the Sino-Japanese War. We internalized the trauma of the Nanjing Massacre in 1937-38.\n\nWe were steeped in this before we were even old enough to understand the messages we were supposed to be absorbing. Today, it is almost funny to recall that the first naked woman I saw on the big screen was from “Red Cherry,” one of the patriotic movies we watched as a mandatory part of our curriculum. In one scene, a Chinese teenager was forced to walk on the dinner table naked, showing a giant Nazi tattoo on her back to a group of German officers. Looking back, it’s a good antiwar movie, but I was only a primary school student. Sitting in the movie theater with my class, I had no idea what a Nazi was. What I remember was that it shocked me to see the girl’s bare body, and later to see a different girl trying to burn herself to remove a similar tattoo.\n\nIn other movies, we saw the famous 14-year-old Communist Party hero, Liu Hulan, walk courageously up to a fodder chopper, refusing to save her life by betraying the other party members in her village. We witnessed Chinese people being lynched, raped and buried alive by the Japanese, and watched as some of them still managed to chant patriotic slogans all the way to the end. When we returned to school from the movie theater, the teachers asked us to learn their spirit of “ningsibuqu” — to prefer to die than to surrender.\n\nAfter years of schooling, every Chinese national is left with a wardrobe of collective enemies: the Western countries and Japan. No sensible adult would be foolish enough to adopt this completely black-and-white view. But a hostile mind-set can still get the better of us when nationalistic sentiments are involved.", "description": "What happens when you mix rage, shame and pride with years of nationalist education?", "authors": ["Jianan Qian"], "top_image": "https://static01.nyt.com/images/2019/09/29/sunday-review/29Qian/29Qian-facebookJumbo.jpg", "published_at": "2019-09-28"}