{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Culture/whitney-houston-christmas-single-possibility-hologram-tour-coming/story?id=65382647", "downloaded_at": "2019-09-04 23:48:15.320933+00:00", "published_at": "2019-09-04", "title": "Whitney Houston Christmas single a 'possibility'; hologram tour coming in 2020", "language": "en", "text": "One of the surprise chart successes of 2019 has been \"Higher Love,\" Whitney Houston's version of the 1986 Steve Winwood hit that was remixed by superstar DJ Kygo.\n\nThe song has topped the Billboard dance chart and reached No. 2 on the British singles chart. Now, there's word that more Houston songs might be in the works.\n\nSeth Faber of Primary Wave, the company that has partnered with the late icon's estate, told Music Week that a Houston Christmas single is \"a possibility this year,\" since the company wants to \"take advantage of the momentum” by releasing more archival recordings. Houston died in 2012 at the age of 48.\n\nAs for an entire album of remixed songs, Faber said it could happen ... but further down the road.\n\nICYMI: Whitney Houston hologram tour to launch in UK https://t.co/nfJMMSlZrL pic.twitter.com/iepDJVtZd0 — Music Week (@MusicWeek) September 3, 2019\n\n“It’s possible we could get there, but in 2019 it feels like playing the singles game is more appropriate, especially because we have a finite amount of material,” Faber said.\n\n\"We need to be thinking about what’s going to happen five to seven years from now, to make the material that we have last and continue to attract new fans,\" he added.\n\nThe estate also hopes to attract more new fans by launching a Whitney Houston hologram tour, set to kick off in the U.K. next year. It's being staged by the same company that has an upcoming Buddy Holly/Roy Orbison hologram tour launching this year. The company is also developing an Amy Winehouse hologram tour.\n\n\"It will be an incredible show,\" said Faber. \"So much effort has gone into making the show as authentic as possible. It’s going to be a phenomenal experience.\"", "description": "What you need to know about the upcoming hologram tour for Whitney Houston.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/whitney-houston-file-gty-jef-190627_hpMain_16x9_992.jpg"}