{"pub": "breitbart", "url": "https://breitbart.com/news/no-19-michigan-leans-on-defense-to-beat-no-14-iowa-10-3", "downloaded_at": "2019-10-06 00:19:57.934694+00:00", "title": "No. 19 Michigan leans on defense to beat No. 14 Iowa 10-3", "language": "en", "text": "ANN ARBOR, Mich. (AP) — Leaning on a sack-making, turnover-producing defense, No. 19 Michigan earned a desperately needed win.\n\nZach Charbonnet ran for a 2-yard touchdown to give the Wolverines an early double-digit lead and their defense did the rest in a 10-3 win over No. 14 Iowa, forcing four turnovers and tallying eight sacks Saturday.\n\n“A defensive masterpiece,” coach Jim Harbaugh said.\n\nThe Wolverines (4-1, 2-1 Big Ten) were held scoreless over the final three quarters because they could not run or pass effectively, scoring just three points off the Hawkeyes’ turnovers.\n\n“We’re fortunate the defense came out and played they way they did,” Michigan quarterback Shea Patterson said. “Kept us in the game.”\n\nIowa (4-1, 1-1) failed to take advantage of favorable field position on its final two drives with a chance to extend the game or possibly win it with a touchdown and 2-point conversion. The Hawkeyes turned the ball over on downs at the Michigan 44 with 37 seconds left after a penalty- and sack-filled drive forced them to punt with a fourth-and-36 at midfield on the previous possession.\n\n“We didn’t help ourselves with some costly errors,” coach Kirk Ferentz said.\n\nIowa running back Mekhi Sargent fumbled on his team’s first snap, giving up the ball at the Hawkeyes 18. Michigan, though, had to settle for a field goal after gaining just 6 yards. The Wolverines took a 10-0 lead on their next drive, which started with a 51-yard pass to Nico Collins and finished with Charbonnet’s 2-yard run.\n\nIowa avoided a shutout with Keith Duncan’s 22-yard field goal early in the second quarter.\n\nThe Hawkeyes, though, did not score again. The sacks they gave up led to them finishing with 1 yard rushing. And Nate Stanley completed slightly more than half of his passes.\n\nMichigan defensive end Kwity Paye led the way with 2½ sacks before leaving the game, appearing to hurt his left hamstring.\n\nTHE TAKEAWAY\n\nIowa: Ball security will become a priority after giving away chances to win at the Big House. The Hawkeyes threw three interceptions and lost a fumble. They entered the game with only one turnover this season, tying Oregon State for the fewest in major college football.\n\n“We put ourselves in some tough circumstances, but I thought our defense really responded well,” Ferentz said. “It kept us in the game.”\n\nMichigan: Harbaugh hired Josh Gattis to be his offensive coordinator, giving the former Alabama assistant his first shot to call plays and run an offense. So far, it is not going well. The Wolverines failed to move the ball much after scoring 10 points in that opening quarter and have only played well with the ball in a 52-0 win over Rutgers last week.\n\n“We’re hitting our stride,” Harbaugh insisted.\n\nUNDER CENTER\n\nPatterson was 14 of 26 for 147 yards with an interception.\n\n“Shea, in particular, took what was there and sometimes nothing was there,” Harbaugh said. “Managed the game extremely well. Did the job on the turnovers. Won that battle.”\n\nStanley was 23 of 42 for 260 yards with three interceptions, ending a 139-pass streak without getting picked off.\n\n“They had a great plan as far as their blitzes were concerned,” Stanley said. “They did a lot of things that were very hard on us pickup-wise, probably the hardest we’ve seen all year, and quite possibly the hardest we’ll see all year.”\n\nPOLL IMPLICATIONS\n\nMichigan may move up a little in the poll and Iowa will likely drop in the poll.\n\nBIG HOUSE VISITOR\n\nFormer U.S. Secretary of State and National Security Adviser Condoleezza Rice was Michigan’s honorary captain.\n\nUP NEXT\n\nIowa: The Hawkeyes host No. 12 Penn State next Saturday.\n\nMichigan: The Wolverines visit Illinois next Saturday.\n\n___\n\nMore AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP_Top25", "description": "ANN ARBOR, Mich. (AP) — Leaning on a sack-making, turnover-producing defense, No. 19 Michigan earned a desperately needed win. Zach Charbonnet ran for a", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/ap/05/4ff371_aptopix-iowa-michigan-football-45695-michigan-defensive-lavert-hill-24-640x335.jpg", "published_at": "2019-10-05"}