{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7566375/Selena-Gomez-sports-chic-silk-cargo-pants-black-blouse-lunch-friends-Malibu.html", "downloaded_at": "2019-10-12 17:51:04.836316+00:00", "title": "Selena Gomez sports chic silk cargo pants and a black blouse for lunch with friends in Malibu", "language": "en", "text": "She's maintained relationships with a sturdy group of girls in her life.\n\nAnd Selena Gomez celebrated friendship on Friday afternoon as she stepped out with her squad for lunch at Nobu in Malibu, California.\n\nThe 27-year-old singer looked chic in silky blue cargo pants with a fitted T-shirt just days after sparking new romance rumors with Niall Horan.\n\nOut and about: Selena Gomez celebrated friendship on Friday afternoon as she stepped out with her squad for lunch at Nobu in Malibu, California\n\nSelena looked casually cool in a tight black shirt with three-quarter-length sleeves covering her arms.\n\nA pair of high-waisted blue cargo pants hugged her hips and billowed down to her ankles, revealing black leather booties.\n\nShe swept back her long, dark brown hair into a tight braid and shielded her eyes from the afternoon sun wearing a pair of classic Wayfarer Ray-Bans.\n\nPals: The 27-year-old singer looked chic in silky blue cargo pants with a fitted T-shirt just days after sparking new romance rumors with Niall Horan\n\nThe Hands To Myself songstress was joined by a few friends and wrapped her arm around a petite blonde while entering the seaside eatery.\n\nShe was recently spotted heading into Niall's home in Los Angeles carrying a bag of groceries, sparking new speculation that the pair were pursuing another chance at love.\n\nOn Thursday, Niall shared an Instagram snap from a group dinner where it appeared he had his arm wrapped around her.\n\nA look! She swept back her long, dark brown hair into a tight braid and shielded her eyes from the afternoon sun wearing a pair of classic Wayfarer Ray-Bans\n\nSources told E! that Selena and the One Direction star are 'not dating and have been hanging out as friends' for a while.\n\n'They have always been good friends and have kept in touch throughout the years,' the insider added.\n\nOn the night of the group dinner, Selena gave Niall and his new song Nice To Meet Ya a shout-out on her Instagram stories.\n\nFour years earlier the pairing were romantically linked after reportedly putting on a PDA packed display at Jenna Dewan's birthday party.", "description": "The 27-year-old singer looked chic in silky blue cargo pants with a fitted T-shirt just days after sparking new romance rumors with Niall Horan.", "authors": ["Tracy Wright For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/18/19632256-0-image-a-32_1570901914607.jpg", "published_at": "2019-10-12"}