{"pub": "guardian", "url": "https://theguardian.com/us-news/2019/oct/15/alexandria-ocasio-cortez-bernie-sanders-endorsement", "downloaded_at": "2019-10-16 05:10:22.556169+00:00", "title": "Alexandria Ocasio-Cortez to endorse Bernie Sanders for president", "language": "en", "text": "The progressive New York congresswoman will join the presidential candidate at a New York rally\n\nThe progressive congresswoman Alexandria Ocasio-Cortez is set to endorse Bernie Sanders in the race to be the Democratic party’s nominee for the White House next year.\n\nDuring the fourth Democratic debate on Tuesday night Sanders, who recently suffered a heart attack that raised questions about his health, teased the appearance of a surprise guest at a Bernie’s Back rally scheduled for Saturday in New York.\n\nThat triggered a wave of online speculation and a report from the Washington Post that Ocasio-Cortez would be joining the Vermont senator onstage and endorsing him in his bid for the presidency. The Guardian later confirmed the news.\n\nOcasio-Cortez’s shock move ends months of speculation about the plans of the Bronx politician, who is hugely popular with the progressive wing of the party.\n\nWarren under attack as Democrats spar in largest primary debate in US history Read more\n\nThe endorsement is a major coup for Sanders, whose campaign has failed to move to the top of a broad Democratic field, and a blow to his fellow progressive senator Elizabeth Warren of Massachusetts, who has emerged as the race’s new frontrunner.\n\nOcasio-Cortez is one of the four members of “the Squad”, a group of four freshman congresswomen of color whose liberal policies and pointed critiques of Donald Trump have earned them praise from many on the left and virulent attacks from many conservatives.\n\nThe other squad members are Michigan’s Rashida Tlaib, Minnesota’s Ilhan Omar and Massachusetts’ Ayanna Pressley. In a tweet, a senior CNN political journalist reported that Tlaib and Omar would also be endorsing Sanders.", "description": "The progressive New York congresswoman will join the presidential candidate at a New York rally", "authors": ["Joan E Greve", "Lauren Gambino"], "top_image": "https://i.guim.co.uk/img/media/363cfedac3a784327b7c1a9e7665a50b5c8f28c4/0_380_5489_3293/master/5489.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=df65b9dd8e5f15891c629c747d047d83", "published_at": "2019-10-15"}