{"pub": "reuters", "url": "https://ca.reuters.com/article/businessNews/idCAKBN1WC1BA-OCABS", "downloaded_at": "2019-09-27 12:09:12.036744+00:00", "title": "Spillover: world economies' next big headache", "language": "en", "text": "LONDON (Reuters) - Factories have been the first victims of the Trump-era global trade rows. Now the question is how much their troubles will spread to other parts of the world’s biggest economies: the so-called spillover effect.\n\nFILE PHOTO: steam is emitted from factories at sunset in Keihin industrial zone in Kawasaki, Japan February 13, 2017. REUTERS/Issei Kato/File Photo/File Photo\n\nThis week’s read-out from German purchasing managers showed an unexpected worsening of the recession in the manufacturing sector of Europe’s largest economy. But just as alarming was news that growth in services - by far the largest contributor to German output - was also losing momentum.\n\nA slew of data on Monday should give more insight into how much of a knock-on effect the manufacturing slump is having for the average German on the street, with retail sales figures due for August and jobless and inflation data for September.\n\nThen on Wednesday, top economic institutes are scheduled to update their growth forecasts for the German economy for this year and next. With a possible no-deal Brexit and the risk of higher U.S. tariffs on automobile imports from Europe, it could be pretty grim.\n\nSpillover from the US-China trade war was cited by Moody’s this week as a risk for Asian economies and is being watched closely by U.S. policymakers. For next week, their focus will be on just how badly U.S. industry is being hit.\n\nSome officials worry that the U.S. manufacturing sector may already be in recession.\n\nSt. Louis Federal Reserve President James Bullard - one of the Fed’s leading policy doves - raised that concern as part of his argument for a half percentage point rate cut at the bank’s meeting in mid-September, twice what the Fed delivered.\n\nNext week has the ISM manufacturing index for September due on Tuesday and factory employment figures out on Friday as part of the nonfarm payrolls report from the Bureau of Labor Statistics. Early estimates from Wall Street economists point to a modest rebound for ISM and some negligible factory job gains. Factory orders for August are then due on Thursday.\n\nSo far, there are signs that economies on both sides of the Atlantic are just about containing the fallout. In the United States, consumer spending in the second quarter grew 4.6%, while sentiment is actually improving in euro zone services.\n\nWHAT TO WATCH ELSEWHERE\n\nChinese manufacturing PMI for September due on Monday is expected to remain on hold notwithstanding the trade tensions with the United States.\n\nAway from the vexed Brexit debate, there is also a big data day in the UK on Monday with revised second quarter GDP figures - including current account deficit and business investment - as well as Bank of England consumer credit and mortgage approvals numbers.\n\nAmong those banks with rate-setting meetings are those of India (Friday) and Australia (Tuesday). For now, the jury is out on whether they will follow the easing trend being set by the Fed, the ECB and others.\n\nA LAST THOUGHT\n\nClimate change and its link to the economy made headlines at the United Nations gathering this week, with companies such as online retailer Amazon announcing plans to go carbon-neutral by 2040 and teenage campaigner Greta Thunberg slamming the “fairy tale” of never-ending economic growth.\n\nThat last thought is taboo in traditional economics, which holds that growth measured in Gross Domestic Product (GDP) is always desirable and is a proxy for a rise in general well-being.\n\nA new paper released by the Organisation for Economic Cooperation and Development (OECD) was therefore notable in concluding that “focusing on GDP outcomes alone can lead to suboptimal outcomes”, not least for tackling environmental degradation and poverty. It urged policymakers to look again at what constitutes economic success through the lens of well-being.\n\nhere", "description": "Factories have been the first victims of the Trump-era global trade rows. Now the question is how much their troubles will spread to other parts of the world's biggest economies: the so-called spillover effect.", "authors": ["Mark", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190927&t=2&i=1434520676&w=1200&r=LYNXMPEF8Q0U6-OCABS", "published_at": "2019-09-27"}