{"pub": "bbc", "url": "https://bbc.co.uk/news/newsbeat-50014058", "downloaded_at": "2019-10-11 12:44:01.232507+00:00", "title": "Tekashi 6ix9ine 'signs new £8m record deal in prison'", "language": "en", "text": "Image copyright Getty Images\n\nTekashi 6ix9ine has signed a new record deal in prison, according to reports in the United States.\n\nThe deal with label 10K Projects is said to be worth $10m (£8m) and is for two albums - one in English and Spanish.\n\nTekashi, real name Daniel Hernandez, is awaiting sentencing for racketeering and firearms charges in the US.\n\nHe had been facing up to 47 years in prison before agreeing to give evidence against other alleged gang members.\n\nRolling Stone says it's not yet clear whether the albums will feature totally new material or rely on existing music.\n\nThe rapper has been charged with six offences which include racketeering, carrying a firearm, assault with a dangerous weapon, and conspiracy murder charges.\n\nRacketeering is when people use criminal actions to repeatedly take money from others, and most likely associated with protection rackets.\n\nThe rapper was previously involved with a violent US gang called The Nine Trey Bloods.\n\nMedia playback is unsupported on your device Media caption 'They're calling him Tekashi Snitch 9ine'\n\nAs a way of trying to reduce his sentence, he entered into a plea deal with federal government and testified against other gang members in court.\n\nHe gave information on Anthony Ellison and Aljermiah Mack and both men have since been found convicted.\n\nEllison was also found guilty of kidnapping 6ix9ine, maiming and assault - while Mack was also found guilty on drug dealing charges.\n\nTekashi is set to be sentenced on December 18 and because of the information he's given on the other men, it's expected his jail time will be slashed.\n\nFollow Newsbeat on Instagram, Facebook, Twitter and YouTube.\n\nListen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.", "description": "Tekashi, real name Daniel Hernandez, is awaiting sentencing for racketeering and firearms charges.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/151DA/production/_104509468_gettyimages-1026030994.jpg", "published_at": "2019-10-11"}