{"pub": "cbc", "url": "https://cbc.ca/sports/golf/nick-taylor-shriners-hospitals-children-open-1.5308421", "downloaded_at": "2019-10-04 01:21:28.856256+00:00", "published_at": "2019-10-03", "title": "CBC Sports", "language": "en", "text": "Canada's Nick Taylor had to scramble for par on his opening two holes Thursday, and then he couldn't miss in the Shriners Hospitals for Children Open.\n\nTaylor, of Abbotsford, B.C., ran off a six-hole stretch at 6-under par, including a drive on the 314-yard 14th hole at the TPC Summerlin that stopped 5 feet away for eagle. He birdied all the par 5s, kept bogeys off his card and opened with an 8-under 63 for a two-shot lead among early starters.\n\nPhil Mickelson, who missed the cut last week at the Safeway Open in his season debut, had a 65 for his lowest round since late February.\n\nTaylor faced ideal conditions and the easier side at Summerlin to start his round, and he found himself having to get up-and-down to save par with 5-foot putts.\n\nWATCH | Taylor uses stretch of birdies to take 1st-round lead:\n\nNick Taylor of Abbotsford, B.C., shot an 8-under 63 to take the clubhouse lead during the first round of the Shriners Hospitals for Children Open in Las Vegas. 0:25\n\n\"The first two holes, I actually hit pretty good drives. Had a little bit of mud on it, so the ball just kind of took off oddly,\" Taylor said. \"Was able to make two good par saves, and from there was able to hit a bunch of greens, make some putts.\"\n\nThe 15th hole was a bonus. On the three par 5s, he was either on in two shots or just off the green.\n\n\"That always makes the round pretty easy,\" Taylor said.\n\nPhil Mickelson 2 shots back of lead\n\nMickelson, Brian Day and Sam Ryder were at 65. Adam Scott, who spent a year at UNLV as a teenager, was among those at 66.\n\nMickelson is playing Las Vegas for the first time since 2005, and he didn't start his season well when he chopped up the par 5s at Silverado — making a 9 on one of the easier holes — to miss the cut.\n\nLefty wasn't worried. Take out his play on the par 5s, and he felt his game was fine. He showed that Thursday, and finished his round with a 60-foot eagle attempt that had a chance to go in before leaving a short putt for his final birdie.\n\nThe 65 was his best score since a second-round 65 in the Mexico Championship.\n\nWith the fairways running tight and fast, Mickelson said he relied on a low cut to keep it in play and give himself chances.\n\n\"They're not going very far, but they're in play,\" he said. \"My iron play right now is really good, so I just want to give myself chances with my irons.\"\n\nHe said he needed only a \"subtle fix\" from how he played the par 5s at the Safeway Open and it was easy.\n\nStrongest field in more than 15 years\n\nBrooks Koepka, who had stem cell treatment on his left knee on Aug. 25 after the FedEx Cup ended, began his season by needing two birdies over the last four holes just to break par. He opened with a 70.\n\nTony Finau was at 68 after spending the last two weeks on the European Tour and flying eight time zones away to Las Vegas.\n\nDefending champion Bryson DeChambeau and Patrick Cantlay, who won the previous year, were among those playing the afternoon. Both are among the top 10 in the world ranking, giving Las Vegas its strongest field in more than 15 years.\n\nKoepka is the first No. 1 player in Las Vegas since Greg Norman in 1988.\n\nCanadian Graham DeLaet made his first PGA appearance in nearly two years because of a back injury.\n\nThe 37-year-old native of Weyburn, Sask., shot a 4-over 75. DeLaet had a triple bogey on No. 3 and was 7 over though 11 before rallying with three consecutive birdies from Nos. 13-15.\n\nMackenzie Hughes of Dundas, Ont., carded a one-under 70.\n\nAdam Hadwin of Abbotsford and Roger Sloan of Merritt, B.C., had afternoon tee times.", "description": "Nick Taylor had to scramble for par on his opening two holes Thursday, and then he couldn't miss in the Shriners Hospitals for Children Open. Taylor, of Abbotsford, B.C., opened with an 8-under 63 for a two-shot lead among early starters.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5308431.1570146991!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/nick-taylor.jpg"}