{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/17/open-border-activists-demand-95000-refugees-be-admitted-to-u-s-in-2020", "downloaded_at": "2019-10-18 01:13:18.102675+00:00", "title": "Open Border Activists Want 95,000 Refugees Admitted to U.S. in 2020", "language": "en", "text": "A dozen or so protesters from groups that advocate open borders and increasing refugee admissions were arrested this week as they approached the steps of the Capital wearing orange life jackets and chanting “No ban, no wall, sanctuary for all.”\n\nThe protesters and others who joined the rally to support the Guaranteed Refugee Admissions Ceiling Enhancement Act to set a minimum annual refugee cap at 95,000.\n\n“We welcome you on this day which despite the sunshine in many ways is a day of mourning,” the Rev. Sharon Stanley-Rea of the Disciples of Christ Church said at the event, referring to the Trump administration’s intention to cap the number of refugees to be allowed into the United States in fiscal year 2020 to 18,000.\n\n“We favor resettlement because of the ways it’s good for our communities,” Stanley-Rea said. “Because we know communities are better economically.”\n\n“We know that refugees make businesses stronger,” Stanley-Rea said, arguing that many businesses in America could not function without refugees.\n\n“On this day, a sad day of mourning as we face that very low refugee number, we are wearing most of us very dark colors as a sign of that mourning in our hearts,” Stanley-Rea said. “But we are also wearing life jackets.”\n\n“And for 18 of us, we are wearing life jackets to symbolize the 18,000 refugees that will be saved through refugee resettlement, but we do pray there will be many more,” Stanley-Rea said.\n\nSpeakers at the protest represented leftwing groups and religious institutions, including Nihad Awad, executive director of the Council on American-Islamic Relations (CAIR). Awad said he is a Palestinian refugee and did not disclose he is an activist with ties to extremists, a Breitbart News has reported:\n\nBreitbart has frequently noted that the CAIR group is so closely entwined with Islamists and with jihadis that court documents and news reports show that at least five of its people — either board members, employees or former employees — have been jailed or repatriated for various financial and terror-related offenses. Breitbart has also published evidence highlighted by critics showing that CAIR was named an unindicted co-conspirator in a Texas-based criminal effort to deliver $12 million to the Jew-hating HAMAS jihad group, that CAIR was founded with $490,000 from HAMAS, and that the FBI bans top-level meetings with CAIR officials. “The FBI policy restricting a formal relationship with CAIR remains … [but] does not preclude communication regarding investigative activity or allegations of civil rights violations,” said an Oct. 2015 email from FBI spokesman Christopher Allen.\n\nThe Rev. Seth Kapper-Dale of the Reformed Church of Highland Park, New Jersey, called the Trump administration’s refugee policies “racial and ethnic cleansing.”\n\nProtestors gathered at the Capitol to demand the Trump administration admit more refugees into the United States (Penny Starr/Breitbart News)\n\nFormer Assistant Secretary of State for Population, Refugees, and Migration in the Obama administration also spoke out against reducing refugee admissions.\n\nFollowing speeches to a small group, the life-jacket-clad protesters tried to climb the steps to the Capitol and were arrested.\n\nThe protestors did not address any of the controversies associated with refugee resettlement, including a recent CNN investigation Breitbart News reported on:\n\nIn an investigative report by CNN, fraudulent refugees from Kenya who posed as persecuted Somalians detail how they and their entire families came to the U.S. and lived on food stamps for years. The level of fraudulent refugees, particularly from Kenya but posing as persecuted populations from other African nations, is at least in the “tens of thousands,” according to CNN’s investigation. An “untold number” of these fraudulent refugees are living in the U.S. after being resettled using IDs and retelling fake stories. In many cases, Africans have bought their way into the U.S. refugee resettlement program. One case described by CNN involves a Kenyan national in his twenties who is currently attempting to buy his way into the U.S. by paying off middlemen that can fraudulently get him classified as a Somali refugee.\n\nIn a protest playbook obtained by Breitbart News, organizers said, “refugees start working as soon as possible, pay taxes, start businesses, purchase home, and become U.S. citizens.”\n\n“Many industries, like hospitality and meatpacking, rely on refugee workers,” the playbook said.\n\nInvestor/lobbyists complain that Trump is reducing the no. of invited refugees from 30K in 2019 to 18K in 2020. These complaints are cheap & easy, but do show how biz fights to maximize $$$ by maximizing the delivery of cheap workers/ consumers/ renters. https://t.co/1OKBENwfUn — Neil Munro (@NeilMunroDC) September 30, 2019\n\nFollow Penny Starr on Twitter", "description": "Protesters gathered at the Capitol to demand that the United States admit 95,000 refugees into the United States in Fiscal Year 2020.", "authors": ["Penny Starr"], "top_image": "https://media.breitbart.com/media/2019/10/Protest-for-Refugees-640x335.jpg", "published_at": "2019-10-17"}