{"pub": "yahoo", "url": "https://news.yahoo.com/saudi-arabia-opens-tourist-visas-172343063.html", "downloaded_at": "2019-10-13 18:43:16.971805+00:00", "title": "Saudi Arabia opens tourist visas to U.S., European visa holders", "language": "en", "text": "RIYADH, Oct 13 (Reuters) - Tourist visas for Saudi Arabia are now available online and on arrival to holidaymakers who already hold a visa from the United States, Britain or the EU's Schengen zone, expanding eligibility beyond an initial list of 49 countries.\n\nThe conservative Muslim kingdom, relatively closed off for decades, launched a new visa regime last month for nationals from countries in Europe, North America and much of Asia to boost foreign tourism and diversify the economy away from oil.\n\nExecutive regulations published over the weekend stipulate that people from other countries who have a tourist or commercial visa from the United States, Britain or European Union nations can follow the same process, rather than applying at a Saudi overseas mission with additional documentation.\n\nUntil now, foreigners travelling to Saudi Arabia had been largely restricted to resident workers and their dependents, business travellers and Muslim pilgrims who are given special visas to visit the holy cities of Mecca and Medina.\n\nThe new visas are valid for up to one year, cost about $120 including a health insurance fee, and allow multiple entries and stays of up to three months.\n\nFollowing the visa announcement, the authorities implemented a public decency code barring immodest dress and public displays of affection, but in a break with precedent said they would allow foreign men and women to rent hotel rooms together without proving they are related.\n\nAlcohol is still banned.\n\nThe Gulf country, which shares borders with Iraq to the north and Yemen to the south, boasts vast tracts of desert but also verdant mountains, pristine beaches and historical sites including five UNESCO World Heritage Sites.\n\n(Reporting by Stephen Kalin; Editing by Edmund Blair)", "description": "Tourist visas for Saudi Arabia are now available online and on arrival to holidaymakers who already hold a visa from the United States, Britain or the EU's Schengen zone, expanding eligibility beyond an initial list of 49 countries.  The conservative Muslim kingdom, relatively closed off for decades", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-13"}