{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7588701/Keyless-car-thieves-steal-60-000-Audi-RS5-minute-outside-family-home.html", "downloaded_at": "2019-10-21 07:37:47.117994+00:00", "title": "Keyless car thieves steal £60,000 Audi RS5 in under a minute from outside family home", "language": "en", "text": "Four thieves were caught on camera stealing a luxury car worth £60,000 in less than a minute from outside a family's home.\n\nThe footage was captured on a doorbell camera outside a house in Rowley Regis, West Midlands, during the middle of the night.\n\nIn the video, four hooded figures can be seen loitering around an Audi RS5 parked on the driveway.\n\nOne of them stands near the front door with one half of a relay system in his hand and covers the camera on the doorbell.\n\nA few seconds later a high-pitched beeping can be heard despite the lens still being obscured.\n\nThe alarm has been triggered as one of the thieves climbs into the driver's seat and tries to start the family car.\n\nThe footage was captured on a doorbell camera outside a house in Rowley Regis, West Midlands, during the middle of the night\n\nFour hooded figures can be seen loitering around an Audi RS5 parked on the driveway as they use a relay system to gain access to it\n\nThe car engine revs up just 30 seconds later and as the thieves pull off the drive they blast the horn in celebration\n\nThe thief who had been covering the camera lens removes his hand as his accomplice uses a flashlight to look around the interior.\n\nThe car engine revs up just 30 seconds later.\n\nTwo of the culprits run off as the other hops into the passenger side.\n\nThe engine roars and in a shocking celebration of triumph one of the thieves blasts the horn before racing off down the road, which is where the video ends.\n\nIt is thought that the thugs gained access to the car by using an amplifier, which can be bought online for as little as £80.\n\nWest Midlands Police has been contacted for comment on the incident.\n\nHigh-tech car thieves working together can steal your keyless car within a few seconds\n\nThe swift and silent technique is so successful that it's one of the major factors behind car thefts in England a Wales hitting a six-year high last year\n\nIt comes after recent figures released show that 109,469 vehicle thefts occurred in England and Wales in 2017 - 12 cars being stolen every hour.\n\nSpeaking previously, David Jamieson, Police and Crime Commissioner for West Midlands Police, said: 'Thefts involving electronic devices are on the up and it's clear that manufacturers could do more to make their vehicles secure.'\n\nHow to protect your vehicle: Everyday items like a drinks can or your fridge can stop the criminals in their tracks Every make and model of car which can start 'keylessly' is susceptible to a relay attack. While this might put drivers on edge, there are easy steps you can take to stop you becoming the next victim of a relay theft. Certain metals are capable of blocking key signals, which means if you store your fob with one of these metals around it, criminals won't be able to pick them up and steal your vehicle. The most simple and most ingenious is a metal can. The aluminum in a drinks can will stop radio signals being transmitted from your key and stop burglars in their tracks. Some experts have suggested keeping your keys in the fridge, as the material on the inside will block signals too. If you're looking for a low-cost option, some people wrap their fobs in tin foil - although this isn't endorsed by security firms. Keeping your keys in a small metal box however can work efficiently. Special faraday pouches — cheap wallets which shield the key's radio signal from being transmitted — are also useful for storing your keys when you're away from home - in motorway service stations and public car parks. Experts also encourage drivers to keep them at least 5m away from their front door, to give thieves the worst chance of being able to relay a signal. But some security specialists advise against hiding your car keys too obscurely in your house — because if serious criminals truly want to steal your car, they will break in and do anything to find the keys. Old-fashioned methods like parking in a well-lit area, using a steering wheel lock and installing a proper tracking device to your vehicle are still highly recommended to keep your car safe.\n\nVehicles that have a keyless system employ a very simple process.\n\nThe fobs emit a short-range 'friendly' radio signal that carries only a few yards.\n\nWhen the associated vehicle is close by (usually within a few metres), the car recognises the signal and unlocks the doors.\n\nThieves can intercept this by using an electrical relay system to gain immediate access to the such keyless cars.\n\nThe swift and silent technique is so successful that it's one of the major factors behind car thefts in England a Wales hitting a six-year high last year.\n\nInsurers paid out around £108million – or £1.2million a day – in claims in the first three months of the year, according to the Association of British Insurers.\n\nThis was up 22 per cent on the same period in 2018 and comes as campaigners and politicians call on car companies to improve security, especially for keyless cars.\n\nSo-called 'relay' theft occurs when two (or more) thieves work together. They use equipment to capture electromagnetic signals emitted by keyfobs.\n\nOne thief stands by the car with a transmitter, while the other stands by the house with another, which picks up the signal from the electronic key, usually kept near the front door on a table or hook.\n\nThis is then relayed to the transmitter by the vehicle, causing it to think the key is in close proximity and prompting it to open. Thieves can then drive the vehicle away thanks to the keyless ignition and quickly replace locks and entry devices.\n\nAny vehicle with keyless entry could be vulnerable to relay theft. These include cars from BMW, Ford, Audi, Land Rover, Volkswagen and Mercedes.\n\nIt is not illegal to sell or own a relay box device and the only way police can arrest someone is under the 'going equipped to steal' law — meaning they would have to catch the thief red-handed with it, or prove an intent to use it for theft.\n\nThe same law applies to other gadgets supposedly designed to help owners who have lost their keys, such as key programmer devices, which tell the car to trust a new key and forget the code for the original one.\n\nBut police sources, security experts and locksmiths specialising in vehicles have all said there is 'no legitimate reason' to be in possession of a relay device.\n\nIf a driver was to lose their key, a relay box wouldn't help them get back into their car, as the devices only work when the key is nearby.\n\nCar manufacturers and service centres would instead use special keys called 'one time use' keys that let them key in a new code for the driver.", "description": "The footage was captured on a doorbell camera outside a house in Rowley Regis, West Midlands, during the middle of the night.  One culprit stands near the door to relay a  signal.", "authors": ["Raven Saunt For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/17/19892014-0-image-a-43_1571414661994.jpg", "published_at": "2019-10-18"}