{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/when-people-ask-you-overly-personal-questions-just-lie", "downloaded_at": "2019-10-30 00:06:37.231673+00:00", "title": "When People Ask You Overly Personal Questions, Just Lie", "language": "en", "text": "Photo: Shutterstock\n\nShow up in public with a pregnant-looking belly and suddenly everyone is all “When are you due?” and “Do you know what you’re having?”, as if the contents of your uterus are somehow their business. You will probably feel pressured to answer politely, but here is another option: lie.\n\nYou can prepare your lies ahead of time, or let the moment inspire you. You can choose to be abruptly rude, or give a subtly uncomfortable answer. Every option is on the table, because seriously: strangers can just fuck off. (You can lie to friends and family members, too, but this is a more delicate situation.)\n\nFor example, here is what Anne Hathaway says when people ask her about baby names:\n\n“They say, ‘Do you know the name?’ And we go, ‘Africa,’ ” Hathaway said with a huge smile, pronouncing the first syllable with a resounding, “Ahh.” “And you make really intense, sincere eye contact and you don’t look away and you don’t blink,” she continued. “And you have to watch them just squirm.”\n\nFor a simpler lie, you can dodge the gender question by saying “Nope, we aren’t finding out” even if you already know. Make up a due date, and for fun it can be surprisingly near or far in the future.\n\nOr the best of all, which I never quite had the guts to use myself, but I wish I did: Just say “Huh? I’m not pregnant.”", "description": "Show up in public with a pregnant-looking belly and suddenly everyone is all “When are you due?” and “Do you know what you’re having?”, as if the contents of your uterus are somehow their business. You will probably feel pressured to answer politely, but here is another option: lie....", "authors": ["Chris Jager", "Ronelle Welton", "Bill Nimorakiotakis"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/yae1ax8myfyccjiic0hg.jpg", "published_at": "2019-10-30"}