{"pub": "yahoo", "url": "https://sg.news.yahoo.com/saudi-arabia-names-foreign-minister-generational-shift-091953956.html", "downloaded_at": "2019-10-24 09:56:55.837041+00:00", "title": "Saudi Arabia names new foreign minister in generational shift", "language": "en", "text": "Saudi Arabia's new Foreign Minister Prince Faisal bin Farhan has more work to do on repairing the kingdom's reputation after the murder of dissident Saudi journalist Jamal Khashoggi inside its Istanbul consulate\n\nSaudi Arabia has appointed a new foreign minister with experience in Western capitals and loyalty to the powerful crown prince, in what observers say is a generational shift being driven by the young ruler.\n\nPrince Faisal bin Farhan -- a one-time adviser to Crown Prince Mohammed bin Salman and currently ambassador to Germany -- will replace Ibrahim al-Assaf who was in the role for less than a year.\n\nAssaf, who was appointed in the aftermath of the murder of dissident Saudi journalist Jamal Khashoggi inside the kingdom's Istanbul consulate, was demoted to minister of state.\n\nWhile Assaf was charged with mending the kingdom's reputation in the immediate aftermath of the scandal, Prince Faisal has more repair work to do and must also contend with the kingdom's dangerously tense relations with Iran.\n\nThe new minister has \"really strong ties with traditional Saudi allies\", said Cinzia Bianco, a Middle East analyst at the European Council on Foreign Relations. \"He is dynamic and proactive.\"\n\nBut analysts also pointed to the 45-year-old prince's background with Saudi Arabia's de facto ruler, as well as his younger brother Prince Khaled, a former ambassador to Washingon he also served as adviser.\n\n\"It is part of a generational shift creating a new class of leaders in Saudi Arabia that are disconnected from the old power brokers, helping MBS to consolidate his power without having to rely on the old guard,\" said Andreas Kreig, a professor at King's College London.\n\n\"This in turn guarantees loyalty and control amid a centralisation of power in the hands of the crown prince. Foreign policy decisions are being made inside the crown prince's office with ministers being executioners not actual decision makers.\"\n\nPrince Mohammed, a self-styled moderniser shaking up the conservative petro-state, has sought to shore up his reputation in the wake of the Khashoggi scandal which tested longstanding alliances with Western powers.\n\n\"A new Saudi political dynasty is appearing,\" tweeted Aziz Alghashian, a Saudi foreign policy expert at the University of Essex.\n\n- Repair work to do -\n\nPrince Faisal, who was appointed as envoy to Berlin earlier this year, \"has really strong ties with traditional Saudi allies, US and even a more European outlook than would be traditionally the case,\" said Bianco.\n\nHe takes office as the kingdom continues to deal with the aftermath of Khashoggi's killing, its worst diplomatic crisis since the September 11, 2001 attacks, in which most of the hijackers were identified as Saudi nationals.\n\n\"The outgoing wasn’t really a foreign policy person. The newly appointed is very smart, very articulate and he has also been very strident in his statements,\" said James Dorsey, a Middle East expert at the S. Rajaratnam School of International Studies in Singapore.\n\n\"MBS needs someone who is much more strident. MBS has a lot of repair to do and the new foreign minister has got what MBS needs.\"\n\nThe kingdom has also been navigating a spike in tensions with its regional arch-rival Iran since attacks on Saudi oil facilities last month that temporarily halved the kingdom's crude output and sent world prices soaring.\n\nYemen's Iran-backed Huthi rebels claimed responsibility, but US officials blamed Tehran itself, charging that the rebels did not have the range or sophistication to target the facilities.\n\nTehran has denied involvement and warned of \"total war\" in the event of any retaliatory attack on its territory.\n\nEarlier this month, Tehran said that an Iranian-flagged oil tanker was hit by two explosions off the coast of Saudi Arabia, sparking new fears of conflict.\n\nAs part of the reshuffle announced overnight, transport minister Nabil al-Amoudi was also replaced, with Saleh bin Nasser al-Jasser installed in the role.\n\nThe change comes after a fire engulfed a new high-speed train station in the western city of Jeddah in September, injuring five people.\n\nAs well, 35 foreigners were killed last week when a bus collided with another heavy vehicle near the Islamic holy city of Medina.", "description": "Saudi Arabia has appointed a new foreign minister with experience in Western capitals and loyalty to the powerful crown prince, in what observers say is a generational shift being driven by the young ruler.  Prince Faisal bin Farhan -- a one-time adviser to Crown Prince Mohammed bin Salman and currently", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/nmvcweAFX.3T_mpyrEkXrw--~B/aD01NDY7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_sg/News/AFP/8362f94cd8737ec672ce73fc568a439a24a8e20a.jpg", "published_at": "2019-10-24"}