{"pub": "realclearpolitics", "url": "https://amgreatness.com/2019/10/19/adam-schiffs-gossip-girl-probe", "downloaded_at": "2019-10-20 23:23:01.459891+00:00", "title": "Adam Schiff’s ‘Gossip Girl’ Probe", "language": "en", "text": "As week four of the impeachment drama draws to a close we are left with enough changing narratives, secret hearings, and meme-worthy tantrums to fill an entire season of “Gossip Girl.” Except, this is Congress, so let’s not insult the writers of “Gossip Girl.”\n\nDespite the fact that support for impeachment is slowly dropping, and 60 percent of voters say they’d rather Congress focus on actual problems facing Americans, Democrats are still hell-bent on making a mockery of the impeachment process.\n\nThey are led by U.S. Representative Adam Schiff (D-Calif.), chairman of the House Intelligence Committee. In ordinary impeachment probes, the inquiry would be led by the House Judiciary Committee. But the Judiciary Committee Chairman Jerry Nadler (D-N.Y.) has bungled key elements and fallen out of favor with House Speaker Nancy Pelosi (D-Calif.).\n\nSo the duty has fallen to Schiff, who is proving himself to be terrifyingly adept at three things: running secret hearings, forcing context-free facts into a pre-set narrative, and burning both the credibility of Congress and the impeachment process to the ground.\n\nAfter claiming for the better part of three weeks that the alleged quid pro quo between Trump and Ukraine was so significant that he “reluctantly” was compelled to begin the impeachment probe—for, you know, the Constitution!—Schiff breezily declared this week that a quid pro quo wasn’t even really necessary for the probe to continue.\n\nOh, OK.\n\nHe then conducted yet another secret hearing and steadfastly refused to share any of the “evidence” with most of his colleagues.\n\nThere are profound problems with conducting an impeachment probe in secret, but chief among them is that it never allows for a full airing of the evidence—either to the rest of the members of the House, who will be compelled to vote on it at some point, or to the public.\n\nRather, the evidence that is released is chosen selectively, in pursuit of one narrative or another.\n\nAnd that is the situation we have currently. Democrats cherry-pick the evidence they think supports their case, and leak to friendly outlets. Republicans, in turn, are left to counter it with their own leaks.\n\nConvict First, Ask Questions Later\n\nBut just as the Democrats leak evidence they claim is “deeply problematic” for Trump, the reports on Schiff’s questioning of former U.S. special representative to Ukraine, Kurt Volker, appears to be equally problematic . . . for Schiff. In fact, it’s worse than that considering he is the standard-bearer for what is supposed to be a somber, fact-based inquiry.\n\nAs the Washington Examiner’s Byron York reported this week, Schiff appeared to press Volker to testify that Ukraine felt pressure from Trump to investigate Hunter Biden’s activities on the board of Ukrainian natural gas company, Burisma, in exchange for military aid—all while Volker repeatedly was trying to testify to the opposite.\n\nThe back-and-forth between Schiff and Volker, laid out by York, is worth quoting at length.\n\nSchiff began to push the quid pro quo allegation. He asked Volker whether he would agree that “no president of the United States should ever ask a foreign leader to help intervene in a U.S. election.”\n\n“I agree with that,” said Volker.\n\n“And that would be particularly egregious if it was done in the context of withholding foreign assistance?” Schiff continued. Volker balked. “We’re getting now into, you know, a conflation of these things that I didn’t think was actually there.” Schiff wanted Volker to agree that “if it’s inappropriate for a president to seek foreign help in a U.S. election, it would be doubly so if a president was doing that at a time when the United States was withholding military support from the country.” Again, Volker did not agree. “I can’t really speak to that,” he said. “My understanding of the security assistance issue is — ” Schiff interrupted. “Why can’t you speak to that, ambassador? You’re a career diplomat. You can understand the enormous leverage that a president would have while withholding military support from an ally at war with Russia. You can understand just how significant that would be, correct?” Volker tried to go along without actually agreeing. “I can understand that that would be significant,” he said. Schiff persisted. “And when that suspension of aid became known to that country, to Ukraine, it would be all the more weighty to consider what the president had asked of them, wouldn’t it?”\n\n“So again, congressman, I don’t believe — ” Volker began.\n\n“It’s a pretty straightforward question,” Schiff said.\n\n“But I don’t believe the Ukrainians were aware that the assistance was being held up — ”\n\n“They became aware of it,” Schiff said.\n\n“They became aware later, but I don’t believe they were aware at the time, so there was no leverage implied,” Volker said.\n\nSchiff continued to press Volker to say yes, the Ukrainians must have felt “tremendous pressure” from Trump to investigate the Bidens. Volker, meanwhile, continued to insist that, actually, he knew the Ukrainians well and had a candid relationship with them, and they never once mentioned any feeling of pressure or the presence of a quid pro quo to him.\n\nFinally, in the face of a witness whose version of events did not line up with the conclusion Schiff had already come to, he had enough. “Ambassador,” Schiff snapped,\n\nI find it remarkable as a career diplomat that you have difficulty acknowledging that when Ukraine learned that their aid had been suspended for unknown reasons, that this wouldn’t add additional urgency to a request by the president of the United States. I find that remarkable.\n\nWhat’s actually remarkable here is how brazen Schiff is in his outright pursuit of his own theory, in the face of testimony that suggests his conclusion just might not be true.\n\nAnd this is where the already-thin veil of credibility crumbles for Schiff.\n\nIt’s one thing for him to claim he is pursuing a sober-minded inquiry to collect the evidence and see where it leads. It is quite another to use the Constitution as an excuse to engage in a nakedly partisan investigation where the outcome has already been predetermined, and subpoenas are being issued not to gather actual facts, but to badger witnesses whose testimony doesn’t support the conclusion at which he has already arrived.\n\nA “Garbage” Process\n\nAll of this, of course, would be easier to assess and discuss if the hearings were conducted in a public and transparent forum—as they were in both the Nixon and Clinton impeachments. And although Schiff has promised transparency, he has yet to deliver.\n\nSome House members are getting fed up with the secrecy. Last week, Reps. Andy Biggs (R-Ariz.), Debbie Lesko (R-Ariz.), Louie Gohmert (R-Texas), and John Ratcliffe (R-Texas) attempted to enter the secure room where the House Intelligence, Oversight, and Foreign Affairs Committees were hearing testimony. According to Gohmert, they were ordered out by capitol police officers, who were taking their orders from committee staff.\n\nLikewise, GOP Conference Chairwoman Liz Cheney (R-Wyo.) reported that Republican members asking to read transcripts of testimony given in the impeachment inquiry were denied access.\n\nGohmert called the process “garbage.”\n\nTheir frustration is not hard to understand. At some point, the full House may have to vote on articles of impeachment. And under the process run by Pelosi and Schiff, a vast majority of members will have to decide whether or not to impeach a duly elected, sitting president on the basis of evidence they have never seen.\n\nBiggs, meanwhile, has offered a House resolution to formally censure Adam Schiff for, among other things, concealing that he met with the White House whistleblower before he or she filed the complaint, and for grossly mischaracterizing President Trump’s remarks to the Ukrainian president in a congressional hearing.\n\nA vote on the censure resolution is likely to occur this week.\n\nBut regardless of whether or not Schiff is censured, the damage he has done to the constitutional integrity of the impeachment process will be lasting.\n\nImpeachment is one of the most solemn obligations the Congress is tasked with, and one that Congress, up until now, has never taken lightly. The opposing parties during the Nixon and Clinton impeachments understood, rightly, that if impeachment was to be turned into a partisan weapon, it would undermine the credibility of the probe itself, risk betraying the enfranchisement of millions of voters, and threaten the confidence and trust Americans placed in both the legislative process and their political parties.\n\nHouse Democrats apparently hold no torch for such institutional or constitutional credibility. Their recklessness undoubtedly will ripple into our politics, fundamentally reshaping the role and legitimacy of Congress for decades to come.\n\nIn the short term, the progress of this probe to date affirms that partisan angling will be prized over sober-minded deliberation, as least as long as Adam Schiff is in charge. Gossip Girl, indeed.", "description": "", "authors": [], "top_image": "https://amgreatness.com/wp-content/uploads/2019/10/GettyImages-1176118972.jpg", "published_at": "2019-10-19"}