{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7556471/Real-Madrid-enter-talks-Tottenham-sign-Christian-Eriksen-January.html", "downloaded_at": "2019-10-10 00:11:46.141417+00:00", "title": "Real Madrid will enter talks with Tottenham 'to sign Christian Eriksen in January", "language": "en", "text": "Real Madrid are set to come back to the negotiating table in a bid to sign wantaway Tottenham star Christian Eriksen in January.\n\nThe Danish midfielder was heavily linked with a move to Los Blancos throughout the summer but a transfer never materialised - with the Spanish giants instead securing the services of Eden Hazard from Chelsea.\n\nBut now the Spanish outfit are reportedly ready to return to talks for the 27-year-old, whose contract will expire at the end of this season.\n\nChristian Eriksen admitted in earlier this summer that he might want 'to try something new'\n\nEriksen plunged his future at Spurs into serious doubt when he gave an interview at the start of the summer, stating that he wanted to 'try something new' after six years in north London.\n\nHe called Real Madrid a 'step up' and said they would have to 'pick up the phone' if they were interested, but Los Blancos decided against the move.\n\nAccording to Marca, Tottenham officials have been making last-ditch moves to agree new terms with Eriksen, but the player has told the club he wants to depart when his current deal ends next July.\n\nAnd now it is thought Spurs supremo Daniel Levy is keen to do whatever it takes to secure a fee for the player he signed from Ajax for a bargain £11.5million in 2013.\n\nReal boss Zinedine Zidane could be tempted by a cut-price deal to sign Eriksen in January\n\nMadrid are permitted to begin pre-contract talks with the Dane over a free transfer next summer from January 1. But they could still submit a bid before the close of the next window as they look to strengthen to put themselves in pole position to win the La Liga crown.\n\nIt's believed that Madrid boss Zinedine Zidane preferred a move for Manchester United midfielder Paul Pogba in the summer, but the Old Trafford side refused to do business with them.\n\nEriksen has struggled for form this season, with Spurs enduring a tough start to the campaign\n\nThe French manager could now be tempted to dip into the market, as while his team currently top La Liga with 18 points, they could still benefit from more creative options in midfield and on the wing - and Eriksen's resume in the Premier League makes him a worthy candidate.\n\nAcross his seven seasons in the English top flight, he has scored 50 goals for Spurs and laid on 61 assists.\n\nHe has also dispatched seven free kicks - the fourth highest number in the history of the competition.", "description": "The Danish midfielder was heavily linked with a move to Los Blancos throughout the summer but a transfer never materialised - with the Spanish giants instead securing the services of Eden Hazard.", "authors": ["Oli Gamp For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/23/19514646-0-image-a-29_1570659753881.jpg", "published_at": "2019-10-09"}