{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7629741/Driver-arrested-ramming-pick-truck-gas-station-window.html", "downloaded_at": "2019-10-30 11:08:43.475499+00:00", "title": "Driver is arrested after ramming pick-up truck through a gas station window", "language": "en", "text": "A man has been arrested after driving a pick-up truck into a gas station - as shocking footage shows him shouting 'give me my money' at staff.\n\nJohn Andrew Gillespie, 33, rammed his vehicle into an Exxon station in Macon, Georgia on Thursday last week.\n\nHe fled the scene, but was later arrested and charged with aggravated assault, two counts of hit and run, one count of criminal damage to property, and possession of methamphetamine.\n\nJohn Andrew Gillespie, 33, rammed his vehicle into an Exxon station in Macon, Georgia on Thursday last week. He is seen shouting at staff: 'Give me my money'\n\nShocking footage shows him shouting at customers before fleeing the area, as his vehicle sits inside the station having smashed through the glass front.\n\nA man videoing the remarkable scene questions what he's doing, saying: 'Hey, you are f****** crazy dude. The cops are coming.'\n\nTo which Gillespie shouts: 'I don't give a f***, give me my god damn money.'\n\nA back and forth ensues between the two, before Gillespie drives back out the station and pulls up next to a gas pump.\n\nThe footage cuts off before he speeds away, but police later caught up with him and made an arrest after he crashed his vehicle.\n\nThe store clerk told officers that Gillespie had been yelling in the parking lot before smashing his truck into the store, according to WGXA News.\n\nWork is now underway to repair the extensive damage to the store, and police continue to investigate the circumstances surround the crash.", "description": "John Andrew Gillespie, 33, rammed his vehicle into an Exxon station in Macon, Georgia on Thursday last week. He was arrested after fleeing the scene and crashing.", "authors": ["James Wood For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/10/20370168-0-image-a-12_1572432711557.jpg", "published_at": "2019-10-30"}