{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/6/leading-off-all-4-division-series-matchups-could-b", "downloaded_at": "2019-10-07 04:08:48.233370+00:00", "title": "LEADING OFF: All 4 Division Series matchups could be decided", "language": "en", "text": "A look at what’s happening around the majors Monday:\n\nREMEMBER ME?\n\nCharlie Morton helped Houston achieve the ultimate prize in 2017, winning Game 7 of the AL Championship Series with a sharp start against the Yankees and then winning Game 7 of the World Series in relief against the Dodgers. This time, he hopes to prevent the Astros from advancing.\n\nSigned by Tampa Bay last winter, Morton starts Game 3 in the best-of-five AL Division Series at Tropicana Field with his team down 2-0 to the Astros. Morton beat Oakland in last week’s AL wild-card matchup.\n\nMorton faced his former team twice during the regular season, winning at home 4-2 on March 29 and losing 15-1 at Houston on Aug. 27.\n\n“For me, there’s really no mystery with the Astros. It’s just kind of they are who they are to me. I mean, I know those guys pretty well, on and off the field,” Morton said. “I’m well aware of the challenges they present. I know what they’re made of. I’m just going to go out there … and try to make pitches and challenge them.”\n\nZack Greinke pitches for Houston, following dominant starts by teammates Justin Verlander and Gerrit Cole in the first two games. Greinke is 8-1 with 3.02 ERA in 10 starts since being acquired by the Astros from Arizona at the trade deadline. In his last start, the right-hander came within two outs of throwing a no-hitter against Seattle.\n\nWAIT AND SEE\n\nThe Braves are one win from reaching the NL Championship Series for the first time since 2001. Who they’ll send to the mound at Busch Stadium trying to wrap it up, they’re not ready to say.\n\n“We really haven’t had a chance - when I get back in there, things will calm down and we’ll talk about that,” manager Brian Snitker said after Atlanta rallied in the ninth inning to beat St. Louis 3-1 on Sunday for a 2-1 lead in the NLDS.\n\nOne possible option is bringing back Dallas Keuchel on short rest after he pitched 4 2/3 innings in series opener Thursday.\n\nDakota Hudson will start Game 4 for the Cardinals. The rookie right-hander is making his postseason debut after going 16-7 with a 3.35 ERA this year.\n\nYANKED\n\nHammered in two games at Yankee Stadium, the Twins try to avoid elimination in the ALDS when Jake Odorizzi (15-7, 3.51 ERA) faces New York.\n\nThe Yankees outscored Minnesota 18-6 in taking a 2-0 lead. If the Twins get swept, they would tie the North American major pro league record of 16 straight postseason losses, set by the NHL’s Chicago Blackhawks from 1975-79. Minnesota’s last 12 postseason defeats have all been against New York.\n\nLuis Severino starts for New York. The 25-year-old All-Star didn’t make his regular-season debut until Sept. 17, spending most of the year rehabbing a lat muscle injury sustained while warming up for his first spring training start.\n\nSeverino joked he doesn’t remember his first career start in the playoffs, when he allowed three runs to the Twins in 2017 while getting just one out in a wild-card game the Yankees rallied. He beat Cleveland in the 2017 ALDS but gave up six runs over three innings in a loss to Boston in the Division Series last year. Overall, he’s 1-2 with a 6.26 ERA in the postseason.\n\nMAXED UP\n\nWashington ace Max Scherzer is set to start Game 4 of the NL Division Series - no more mystery or intrigue.\n\nThe Nationals originally had said Scherzer was expected to pitch Game 3 Sunday night. But during the day, they announced Aníbal Sánchez would make the start - Los Angeles won 10-4 for a 2-1 lead in the matchup.\n\nScherzer was summoned from the bullpen by manager Dave Martinez in Game 2. The three-time Cy Young Award winner struck out all three batters he faced in Washington’s 4-2 victory at Dodger Stadium on Friday night.\n\n“We talked after the game. Throwing Sanchez Game 3 and letting me get an extra day would probably be the best thing for me and for the team,” Scherzer said Sunday. “So that was Davey’s decision, and it’s Davey’s call.”\n\nRich Hill starts for the Dodgers. He overcame knee trouble in September to put himself in position to pitch.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "A look at what's happening around the majors Monday:", "authors": ["The Washington Times Http", "The Associated Press"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/03/rays_athletics_baseball_95869_c0-125-3000-1874_s1770x1032.jpg?f52fad753beb582a85b1710fc9f6c2ec1ddbd99f", "published_at": "2019-10-06"}