{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/strictlys-saffron-barker-covered-bruises-20562417", "downloaded_at": "2019-10-11 20:03:17.652538+00:00", "title": "Strictly's Saffron Barker 'covered in bruises' because of 'painful' new routine", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Strictly Come Dancing stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nStrictly Come Dancing 2019 star Saffron Barker has admitted rehearsing her latest routine has left her \"covered in bruises\".\n\nThe social media star and her professional dance partner AJ Pritchard were elated to make it through to the next week, avoiding the dreaded dance-off.\n\nAJ and Saffron got to choose their dance this week as it's their turn for Couples' Choice, and they decided on a Contemporary dance.\n\nThe song will be the Celine Dion classic 'Because You Loved Me', and it's set to be a romantic performance for the pair - with the song being her nan's favourite tune.\n\n(Image: BBC)\n\nBut the introduction of some lifts in the performance has meant the YouTuber has suffered slightly in training.\n\nSaffron is a little bruised from all the moves, telling It Takes Two host Zoe Ball all about it.\n\nShe said: \"I am covered in bruises, yes, this is the first time we've done lifts together.\n\n(Image: BBC/Guy Levy)\n\n\"It is difficult and a lot of pain!\"\n\nAJ added: \"It is worth it though, I think the beautiful thing about doing a Contemporary for Couples' Choice is it allows us to tell a story.\"\n\nZoe then welled up as Saffron revealed her grandmother Ivy would be there to watch her dance to her favourite song.\n\nSign up for our Strictly updates Love Strictly? Keep on top of all the news on and off the dancefloor with our regular email updates. Sign up using this form to receive our newsletter direct to your inbox, with the big breaking news and regular round-ups.\n\n(Image: BBC)\n\nAJ admitted he hoped to \"perform better\" because of the importance of the song to her family.\n\nSaffron added: \"She cries whenever she hears the song, so when she sees the dancing...\"\n\nShe added of the lifts in store: \"Oh I love the lifts, I feel five years old and I'm like can we just do the lifts again?\"\n\nStrictly Come Dancing continues live on Saturday at 6:40pm on BBC One.", "description": "Strictly Come Dancing's Saffron Barker has suffered during training this week ahead of her next performance", "authors": ["Charlotte Tutton", "Image", "Bbc", "Bbc Guy Levy"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20562462.ece/ALTERNATES/s1200/0_saffron-covered-in-bruise.jpg", "published_at": "2019-10-11"}