{"pub": "dailymail", "url": "https://dailymail.co.uk/money/saving/article-7575733/Raphaels-Bank-shutting-savings-account-money.html", "downloaded_at": "2019-10-16 14:10:04.353328+00:00", "title": "Raphaels Bank shutting savings account: where should I put my money?", "language": "en", "text": "A bank which has been around since 1787 has told its customers it is shuttering its savings division and giving them back their money.\n\nIn a statement on its website, chief executive Mike Redican said all account holders have been given 60 days' notice that the bank will be closing their accounts.\n\nThe bank said the move was 'part of the continued reduction of its banking activities', but that 'all customers will receive their full interest entitlement up to the maturity of their investments.'\n\nRaphaels Bank has been around since 1787. The owner of the bank, Lenlyn Group, has supposedly been trying to sell it off since 2015. It has already sold its loan book and closed down its prepaid card business\n\nAccount holders who have interest due in the future will be paid this in advance.\n\nRaphaels had around £99million of customer deposits in 2019 and at the time of the announcement of the closure has three active accounts, though these cannot be signed up for by new customers.\n\nThey are a 60 day notice account paying one per cent, a six month notice account paying 1.4 per cent and a 'bond account' paying 0.5 per cent.\n\nCustomers with money in those accounts therefore need to find a new home for their money within 60 days.\n\nThe bank put in a statement on its website that it was shuttering its savings arm, and all customers would see their deposits returned to them\n\nThis is Money has asked Raphaels Bank whether money will be sent to customers' nominated accounts, and what those whose nominated accounts are out of date need to do.\n\nIt said: 'Every effort is being made to ensure that there will be no detriment to customers.\n\n'The customer support team, based in Aylesbury, will be available to answer any queries they might have.\n\n'The notice letter contains instructions on how their monies will be repaid and includes a Frequently Asked Questions insert.\n\n'Should the customer have further questions we recommend they call the customer service team using the number provided in the letter who will be very happy to assist.\n\n'The bank, at all times prior, during and after the completion of this process will continue to remain solvent and comply with its regulatory requirements.\n\n'Its regulators, the PRA and FCA, have been notified of the decision to close the division.'\n\nIf you are a customer, it is important to make sure your nominated account details are up to do date.\n\nWhere could you take your savings?\n\nFor those after a good notice account, This is Money last week broke down Investec's Notice Plus offer, which can pay you 1.75 per cent while allowing you easy access to 10 per cent of your savings.\n\nHowever, that account does have a minimum deposit amount of £10,000, which is a higher minimum threshold than both of Raphaels' notice accounts.\n\nThe best rates you can get on an easy-access savings account is 1.46 per cent with Coventry Building Society, though its account comes with a 0.31 per cent bonus rate which expires in March 2021 and limits you to three withdrawals a year.\n\nCurrently, fixed rates are falling - but you can get 2.07 per cent for one year with Al Rayan Bank, and 2.32 per on a two year with the same provider.\n\nBoth bonds have a minimum deposit requirement of £1,000.\n\nIn the case of both Coventry Building Society and Al Rayan Bank, these accounts can be opened and managed online, over the phone, in branch or by post.\n\nIf you have Isa allowance left, you could opt for the best buy easy-access Leeds Building Society account launched yesterday, paying 1.46 per cent.\n\nFor more inspiration, check out the independent This is Money savings tables.", "description": "A bank which has been around since 1787 has told its customers it is shuttering its savings division and giving them back their money.", "authors": ["George Nixon For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/10/19745274-0-image-a-2_1571217055707.jpg", "published_at": "2019-10-16"}