{"pub": "afr", "url": "https://afr.com/policy/economy/what-is-really-driving-monetary-policy-20191015-p530qp", "downloaded_at": "2019-10-15 15:01:02.450930+00:00", "title": "What is really driving monetary policy?", "language": "en", "text": "There is a second plot-line running in parallel to the debate over the economic merits of quantitative easing. How it plays out could determine what form or degree of stimulus is tried in the next downturn.\n\nAccording to some economists, the Reserve Bank hasn’t been doing its job properly. They trace this back to the new Statement on the Conduct of Monetary Policy agreed in 2016, which prioritised fiscal stability over inflation targets. As a consequence, they say, the RBA has not met its inflation targets for the past four years, justified by the concern that rising inflation would put indebted households under strain. However, Dr Stephen Kirchner, program director, trade and investment at the United States Studies Centre, says this now means Australia is in a weak starting place going into a potentially very serious downturn. He points to the success of monetary policy in the US.\n\nGovernment and economists at odds over RBA interest rate cuts. James Davies\n\nDr Andrew Leigh, Labor’s shadow minister for Treasury and charities, has taken up Kirchner’s refrain. In a House Economics Committee hearing in August, Leigh interrogated RBA governor Philip Lowe over the bank’s decision not to cut rates sooner. Leigh proposed that a decision to cut 100 basis points earlier in the cycle could have led to an additional 20,000 Australians in work. “That's a pretty significant cost to the economy if indeed it was a mistake, is it not?” Leigh asked.\n\nLeigh refers in his questioning to a paper by RBA researchers Trent Saunders and Peter Tulip, which argues that the costs of “leaning against the wind”, or “setting interest rates higher than macroeconomic objectives would recommend due to concerns about financial instability” were three to eight times larger than the benefit of avoiding financial crises. The paper says “most of the international research finds that interest rates have too small an effect on the probability of a crisis for this benefit to be worth higher unemployment”.\n\nIn the face of this scrutiny, Lowe has stepped up his insistence that government policy – or a lack of it – is undermining the ability of the RBA to meet its targets. \"Increased spending on infrastructure and fiscal expansion in the current environment is going to be better than further monetary easing,” the governor told the ANU Crawford leadership forum in June. To ensure money is not wasted, he makes the case for an infrastructure investment body at arm's length from government, much like the RBA, but argues that \"governments here and right around the world should have their top drawers full of really good ideas that are shovel-ready in case global growth slows”.", "description": "Economists say the Reserve Bank isn't doing enough to stimulate the economy. But are ideas or ego driving monetary policy?", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5298%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_0%2C$y_109/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/d0e4053fecd40d0909973765621cbca2ceb5dcfe", "published_at": "2019-10-15"}