{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7583089/Sophie-Turner-steals-crafty-look-husband-Joe-Jonass-mobile.html", "downloaded_at": "2019-10-17 09:19:04.291165+00:00", "title": "Sophie Turner steals a crafty look at husband Joe Jonas's mobile", "language": "en", "text": "He's in the middle of the tenth Jonas Brothers concert tour - but Joe Jonas took a break to spend the day with his wife Sophie in LA on Wednesday.\n\nThe couple put on a low-key display as they hung out together, with Sophie, 23, wearing a camel cardigan and jeans as she stole a crafty look at his phone.\n\nShe looked naturally beautiful while Joe, 30, stood close by, as they spent some quality time together.\n\nGame Of PHONES: Sophie Turner stole a crafty look at husband Joe Jonas's mobile as he took a break from his band's tour for an LA date with his love\n\nHe wore a pale pink top with pastel blue writing and black jeans for the outing.\n\nThe Happiness Begins Tour is the ongoing tenth concert tour by the Jonas Brothers, in promotion of their fifth studio album of the same title.\n\nThe tour began on August 7, 2019, in Miami, and is set to conclude on February 22, 2020, in Paris.\n\nBusy couple: The Happiness Begins Tour is the ongoing tenth concert tour by the Jonas Brothers, in promotion of their fifth studio album of the same title\n\nSophie and Joe tied the knot in a quick Vegas wedding back in May, before enjoying a second lavish wedding in France a month later.\n\nHowever, Joe appeared to have forgotten about his recent nuptials when he captioned a recent snap of himself with his brothers as the 'Best. Day. Ever.'\n\nThe enthusiastic admission had the Game Of Thrones actress jokingly leaving the comment: 'Really? The BEST day EVER!? Interesting......'\n\nOops! Joe 30, appeared to have forgotten his stunning nuptials with Sophie, as he took to his Instagram with a snap alongside his brothers Nick and Kevin and wrote 'Best. Day. Ever'\n\n'Interesting': The enthusiastic admission had the Game Of Thrones actress, 23, seeing red, but she was just being playful\n\nJoe appeared to be innocently promoting his limited edition batch of Coors Light, alongside his brothers, with his caption hinting at how much fun he had on set.\n\nHowever, Sophie took it as an opportunity to poke fun at him, as she left a witty comment subtly reminding him of their nuptials.\n\nThe British beauty also shared a throwback snap of her larking around in a pool with Joe in Vegas- which appeared to be from her first shotgun wedding.\n\nSophie captioned the snap: 'Sin city with my angel #tbt.'", "description": "He's in the middle of the tenth Jonas Brothers concert tour - but Joe Jonas took a break to spend the day with his wife Sophie in LA on Wednesday.", "authors": ["Rebecca Davison For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/17/09/19827550-0-image-a-16_1571301909573.jpg", "published_at": "2019-10-17"}