{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7593055/Kris-Jenner-skips-daughter-Kim-Kardashians-birthday-party-attend-Jennifer-Lawrences-wedding.html", "downloaded_at": "2019-10-20 08:19:41.772958+00:00", "title": "Kris Jenner skips daughter Kim Kardashian's birthday party to attend Jennifer Lawrence's wedding", "language": "en", "text": "Kris Jenner was one of the guests at Jennifer Lawrence's star-studded Rhode Island wedding on Saturday.\n\nThe showbiz momager, 63, missed her own daughter Kim Kardashian's 39th birthday party to watch The Hunger Games actress, 29, tie the knot with art dealer Cooke Maroney, 34, at the beautiful Belcourt Castle in Newport.\n\nThe mother-of-six dazzled in a floor-length, black embellished gown as she joined a Hollywood elite of attendees including Amy Schumer, Adele, Sienna Miller, Cameron Diaz and Ashley Olsen.\n\nStepping out: Kris Jenner skipped daughter Kim Kardashian's birthday party to attend Jennifer Lawrence's star-studded Rhode Island wedding on Saturday\n\nLooking a million dollars, Kris turned heads in a stunning long-sleeved black gown which featured a heavily embellished cut-out detail at the top.\n\nThe nude-coloured section of her dress was adorned in dazzling gems in an intricate pattern and incorporated an illusion neckline to give the dress the extra wow factor.\n\nAs ever, Kris' make-up was applied to perfection as she rocked smokey eyes and a rouge lip, while her signature cropped raven locks appeared impeccable.\n\nShe accessorised her look with a smart black clutch bag and added a simple pair of black heels.\n\nGuests: The showbiz momager, 63, missed Kim's 39th birthday party to watch The Hunger Games star, 29, tie the knot with art dealer Cooke Maroney, 34, at Belcourt Castle in Newport\n\nMeanwhile, her partner Corey Gamble, 38, looked dapper in a black blazer and matching black trousers.\n\nThe businessman added a crisp white shirt and donned smart black boots.\n\nWhile the pair were preparing to watch Jennifer become a married woman, Kim was enjoying a birthday dinner with her nearest and dearest.\n\nThe Skims creator was seen getting her make-up done by younger sister Kylie Jenner, before sharing images of her pink and gold themed birthday table.\n\nShowstopping: The mother-of-six dazzled in a floor-length, black embellished gown as she joined a Hollywood elite of attendees including Adele, Sienna Miller and Cameron Diaz\n\nStunning: Looking a million dollars, Kris turned heads in a stunning long-sleeved black gown which featured a heavily embellished cut-out detail at the top\n\nKris wasn't the only fabulously dressed star at the Lawrence/Maroney wedding.\n\nSienna Miller stunned in a red Johanna Ortiz maxi dress which included an off-the-shoulder cut and puff sleeves.\n\nThe actress, 37, was joined by her 28-year-old boyfriend, Lucas Zwirner, looking dapper in a classic dark suit.\n\nAcademy Award winning actress Emma Stone, meanwhile, shimmered in velvet, as she was seen exiting her vehicle at the event.\n\nAll in the details: The nude-coloured section of her dress was adorned in dazzling gems in an intricate pattern and incorporated an illusion neckline to give the dress the extra wow factor\n\nGlamorous: As ever, Kris' make-up was applied to perfection as she rocked smokey eyes and a rouge lip, while her signature cropped raven locks appeared impeccable\n\nWhile like Kris, Ashley Olsen opted for a dark, yet dramatic number.\n\nJennifer has long been a superfan of the Kardashians and even made a cameo in their reality show Keeping Up With The Kardashians in May this year, popping up on Kris' FaceTime.\n\nShe and Kris have formed a sweet friendship over the years, with the momager even helping her ring in her 25th birthday in 2015.\n\nNews broke that Lawrence was engaged to Maroney, a 34-year-old art director, in February, after she was spotted rocking a diamond sparkler on her ring finger while out to dinner in New York City. The pair were first romantically linked last June.\n\nBack in June Oscar-winner opened up on Catt Sandler's podcast about wedding planning.\n\nCelebrations: While the pair were preparing to watch Jennifer become a married woman, Kim was enjoying a birthday dinner with her nearest and dearest\n\nSister fun: The Skims creator was seen getting her make-up done by younger sister Kylie Jenner, before sharing images of her pink and gold themed birthday table\n\n'I definitely wasn't at a place where I was like, \"I'm ready to get married,\"' she recalled. 'I just met Cooke and I wanted to marry him. We wanted to marry each other.\n\n'We wanted to commit fully. He's my best friend so I want to legally bind him to me forever. And fortunately the paperwork exists for such a thing. It's the greatest. You find your favorite person in the planet and you're like you can't leave. So I wanted to take that offer.'\n\nLawrence was understandably very excited to tie the knot with her art gallerist beau.\n\n'He's just the best person I've ever met in my whole life,' Lawrence said during an interview with Entertainment Tonight.\n\n'It was a very, very easy decision,' she said of their decision to wed.\n\nBack at the end of September, she shared her Amazon wedding registry with fans with a list of all things perfect for hosting, cooking, travel and more.\n\nPulling out all the stops: The 29-year-old actress and the art dealer are said to have enlisted the help of celebrity wedding planner Mark Seed in order to throw a fancy party for around 150 friends and family members\n\n'Planning a wedding is so exciting, but it can be overwhelming. For anyone else needing a little inspiration, I thought it would be fun to collaborate with Amazon to share a few of my favorite registry wish-list items. It's so easy, and you can find everything you need all in one place,' she said about her registry.\n\nIt was a big change for Jennifer, who gave fans an insight into her then unremarkable love life in a December 2015 chat with Vogue, telling the publication: 'No one ever asks me out. I am lonely every Saturday night. Guys are so mean to me.'\n\nIn the chat, The Hunger Games star revealed that she hoped to find a suitor whose opinion of her is unaffected by her fame.\n\n'I'm just a girl who wants you to be nice to me,' she told the magazine. 'I am straight as an arrow.\n\n'I feel like I need to meet a guy, with all due respect, who has been living in Baghdad for five years who has no idea who I am.'\n\nLawrence also said that she couldn't 'wait to be married' and 'would absolutely not f*** it up' if she ever foun the right person.", "description": "The showbiz momager, 63, missed her own daughter Kim Kardashian's 39th birthday party to watch The Hunger Games actress, 29, tie the knot with art dealer Cooke Maroney, 34, on Saturday.", "authors": ["Niomi Harris For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/08/19949660-0-image-a-5_1571558091298.jpg", "published_at": "2019-10-20"}