{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7617347/Man-30-brutally-stabbed-Times-Square-date-NYPD-search-suspects.html", "downloaded_at": "2019-10-27 04:04:09.146167+00:00", "title": "Man, 30, brutally stabbed in Times Square while on a date as the NYPD search for suspects", "language": "en", "text": "New York authorities are searching for a suspect who is said to have stabbed a man who was out on a date in Times Square.\n\nThe couple had been walking along West 42nd Street between 7th and 8th Avenue when the man got involved in an argument with the suspect and another person just before 11pm.\n\nThe incident took place right across the street from the Ripley's Believe It or Not Museum. Both the man and his friend wore hoodies, New York Daily News reports.\n\nScroll down for video\n\nThe couple had been walking along West 42nd Street between 7th and 8th Avenue when the man got involved in an argument with two hooded men\n\nThe man in the couple - who is 30 years old - was stabbed in the front and the back of his upper body by the suspect. WLNY reports that the man was also stabbed in his torso.\n\nThe two hooded men fled toward 8th Avenue.\n\nPolice have not made any arrests at the moment.\n\nThe man in the couple - who is 30 years old - was stabbed in the front and the back of his upper body by the suspect\n\n'There was a man stabbed and they were working on him,' said a bystander who witnessed the commotion.\n\n'They were working on him and took him and a woman who was with him in an ambulance.'\n\nThe couple were taken to the Bellevue Hospital where the man is said to be in stable condition.", "description": "The couple had been walking along West 42nd Street between 7th and 8th Avenue when the man got involved in an argument with the suspect and another person just before 11pm.", "authors": ["Matthew Wright For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/21/20225984-0-image-a-56_1572123388595.jpg", "published_at": "2019-10-26"}