{"pub": "cbc", "url": "https://cbc.ca/radio/thenextchapter/why-alix-ohlin-wrote-a-love-story-about-sisterhood-1.5306528", "downloaded_at": "2019-10-04 23:51:21.120268+00:00", "title": "CBC Radio", "language": "en", "text": "Alix Ohlin is a Vancouver-based author whose books include the novel Inside and the short story collection Signs and Wonders.\n\nHer latest novel Dual Citizens tells the story of two sisters, Lark and Robin, whose intense co-dependent bond is cemented by their mother's wayward, selfish behaviour.\n\nDual Citizens is on the Rogers Writers' Trust Fiction Prize shortlist and the 2019 Scotiabank Giller Prize shortlist.\n\nSister sister\n\n\"I have one sister. She is nothing like the sister in the book, which I should clarify from the start! We're very close and we've never been through any of the experiences that I write about in Dual Citizens.\n\nI was interested in writing about the many ways in which women chafe against the categories that they are put into.​​ - Alix Ohlin\n\n\"But I am interested in the bonds between these two sisters, Lark and Robin, and the complexity of this relationship. I was interested in writing about the many ways in which women chafe against the categories that they are put into.\"\n\nAbsentee mother\n\n\"Marianne, the mother in this book, grew up in a Catholic family where she was simply expected to get married and have children. She rebels against that and not necessarily in healthy ways. She winds up having these two daughters and she's not that interested in being their mother. She's more interested in pursuing her own life, probably because motherhood was foisted upon her.\n\n\"Her daughters have a semi-feral childhood where they are forced to raise each other. Because of this, Lark and Robin develop an incredibly tight bond. I was interested in the idea that this relationship is the primary scaffolding of their lives and their identities. It creates an unconventional but enduring container for who they are.\"\n\nThe nature of love\n\n\"I wanted to write a love story about sisters. The sisters in the book are so connected to the other. They are soul companions, and yet they have to find their own way in the world and figure out who they are. What if the true love story of these women's lives is not about meeting boys, losing boys and getting back together with boys? What if it's about their relationship with each other?\n\nWhat if the true love story of these women's lives is not about meeting boys, losing boys and getting back together with boys? - Alix Ohlin\n\n\"The sisters grow up together forming this very tight bond and then this relationship ruptures — partly because they're going off to school and pursuing their own ambitions and romantic relationships. They have different attitudes about the world around them.\n\n\"It's a lonely time for both of them. They're trying to figure out who they are artistically and personally. But it's important for them to have that kind of space separately to figure out who they are. Ultimately, when their lives knit back together, they're able to form a family unit again — but on terms that work better for both of them.\"\n\nAlix Ohlin's comments have been edited for length and clarity.", "description": "Dual Citizens is on the shortlist for the 2019 Scotiabank Giller Prize.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.4988290.1548182154!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/dual-citizens-by-alix-ohlin.jpg", "published_at": "2019-10-04"}