{"pub": "metro", "url": "https://metro.co.uk/2019/10/11/x-factor-celebrity-judge-nicole-scherzinger-can-only-be-filmed-from-left-side-and-were-a-bit-obsessed-10900037", "downloaded_at": "2019-10-11 12:57:41.886713+00:00", "title": "X Factor Celebrity: Nicole Scherzinger only filmed from left side", "language": "en", "text": "Nicole has some very specific diva demands (Picture: REX)\n\nNicole Scherzinger is returning to the X Factor judging panel for its special celebrity edition this year, and at a press conference for the new show she revealed she only likes to be filmed from her left side.\n\nThe former (and maybe future) Pussycat Doll was asked by host Dermot O’Leary which seat she wanted to sit in and she demanded to be sat on the left of Louis Walsh.\n\nNicole is returning to the panel after a two year absence, having last been seen in 2017.\n\nSometimes, youve just got to set your inner diva free (Picture: ITV)\n\n‘This is my good side,’ the singer said, sitting down and making sure that she was facing the audience at the correct angle.\n\nAdvertisement\n\nAdvertisement\n\nThe Don’t Hold Your Breath hitmaker has been a firm favourite on the X Factor since replacing Kelly Rowland in 2012.\n\nInterestingly enough, during her first stint as a regular judge on the show, the triple threat was sat to the right of Tulisa and the left of Gary Barlow.\n\nNicole has been a sporadic feature on The X Factor judging panel since joining full-time in 2012 (Picture: REX)\n\nNicole also revealed the act that she thinks could win the new series, choosing 16-year-old identical twins Max and Harvey due to their social media prowess.\n\n‘I think everybody has a shot at winning right now,’ she said. ‘But if I had to answer like right now then the person that came to mind right now, then it’d be [Max and Harvey]. Only because of social media and everything.’\n\nOther acts competing in the series include former Glee actor Kevin McHale, American chat show icon Ricki Lake and a Love Island supergroup, comprising of Eyal Booker, Zara McDermott, Wes Nelson and Samira Mighty. The winner of the series will receive a record contract.\n\nWhen the series does launch, however, make sure you keep an eye on Nicole’s position at all times…\n\nThe X Factor: Celebrity airs tomorrow at 8.35pm on ITV.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Ricki Lake upstaged by her adorable dog as stars come out for The X Factor Celebrity launch\n\nAdvertisement\n\nAdvertisement\n\nMORE: Sharon Osbourne reveals why she won’t work with Simon Cowell ever again after The X Factor", "description": "Nicole Scherzinger demands to be filmed from only her left side, her 'best side', as she films The X Factor: Celebrity,", "authors": ["George Griffiths"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89413119_1570790167.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-11"}