{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/hollyoaks-jennifer-metcalfe-denies-shell-20754585", "downloaded_at": "2019-10-30 07:54:54.128575+00:00", "title": "Hollyoaks' Jennifer Metcalfe denies she'll be joining I'm A Celebrity cast", "language": "en", "text": "Get the biggest I'm a Celebrity stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nHollyoaks star Jennifer Metcalfe has dashed fans' hopes that we'll be seeing her in the I'm A Celebrity jungle this year.\n\nThe show is expected to kick off sometime next month, and will see presenting duo Ant and Dec reunite in the Aussie jungle after Ant's absence last year.\n\nJennifer, who has played diva Mercedes McQueen in the hit soap for over a decade, has been surrounded by speculation that she'll be heading Down Under for the next series.\n\nHowever the brunette beauty has cleared up the rumours by insisting that it's not something she's involved in.\n\nShe told Mirror Online: \"I'm really not doing that. But I have got a month off in November. I heard I was doing it but I'm not.\"\n\n(Image: Instagram)\n\n(Image: Instagram)\n\nLater she added that she'll be spending her time off potty training her little lad, two year old Daye, who she shares with Geordie Shore's Greg Lake.\n\nThe 36 year-old said excitedly: \"I'm going to potty train my little boy and get him out of the cot!\"\n\nThere are a whole bunch more famous faces rumoured to be taking on the jungle, including Love Island and TOWIE star Olivia Attwood , EastEnders hard man Danny Dyer and broadcasting veteran Richard Madeley.\n\n(Image: Newcastle Chronicle)\n\nThe Sun recently reported that eight contestants had been confirmed, with probably two more to be announced.\n\nThe big names were Kate Garraway, Andrew Whyment, Jacqueline Jossa, James Haskell, Ian Wright, Roman Kemp, Myles Stephenson and Nadine Coyle.\n\nJennifer's not the only star to deny her involvement, as Paul Hollywood's ex and red-headed beauty Summer Monteys-Fullam took to her Instagram story to confirm (again) that she wouldn't be joining the camp.\n\n(Image: ITV)\n\n(Image: Instagram)\n\nJennifer, meanwhile, will be left to answer fans' huge number of questions after a new storyline for her character sees her fall into a coma.\n\nMercedes' fate will be up in the air after a shooting leaves her fighting for her life.\n\nShe told Mirror Online: \"[The injuries are] pretty bad. She ends up in a coma for three weeks which was fantastic.\n\n\"After doing all these epic monologues in front of everybody, I literally go into a coma for three weeks so it's like three blocks of me laid in bed in all day.\n\n\"Way too much Internet shopping...there was nothing else to do, but I got to lay in bed for three weeks.\"", "description": "Jennifer said that she would never be able to keep it a secret and that she wants to spend what free time she has with her two year old boy", "authors": ["Will Twigger", "Image", "Instagram", "Newcastle Chronicle", "Itv"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20754688.ece/ALTERNATES/s1200/2_Jennifer-Metcalfe-with-her-son.jpg", "published_at": "2019-10-30"}