{"pub": "thenextweb", "url": "https://thenextweb.com/security/2019/10/18/windows-users-can-now-use-yubicos-security-keys-to-log-in-to-their-pcs", "downloaded_at": "2019-10-18 06:08:42.379297+00:00", "title": "Windows users can now use Yubico’s security keys to log in to their PCs", "language": "en", "text": "Swedish company Yubico has announced that its hardware security keys can now be used to login to a local Windows OS account.\n\nThe feature, which underwent extensive testing over the past six months, lets you add a second layer of authentication to your Windows accounts, by plugging a USB key into your PC.\n\nTo reiterate, using the security key with your Windows PC will not fully eliminate the need for passwords. Rather, you’ll first enter your password, and then use the YubiKey to complete the login. This way, it’s next to impossible for an attacker to access your system even if they know your password.\n\nIn order to go password-free, Windows users must leverage Hello — the biomteric facial recognition system built into the operating system that employs the same underlying technology as YubiKey to facilitate passwordless logins.\n\nThe ability to secure local accounts using YubiKeys was previously available only for Linux and Mac users. It’s good to see this option become more widely available to PC fans.\n\nThe development also comes days after Google announced a USB-C variant of its Titan Security Key in partnership with Yubico that’s compatible with Android, Chrome OS, macOS, and Windows devices.\n\nWith the need for securing identity gaining momentum in the wake of a string of data breaches, these authentication solutions can go a long way towards safeguarding accounts — online or otherwise — from unauthorized access.\n\nRead next: Moto's foldable Razr might launch next month", "description": "Swedish company Yubico has announced that its hardware security keys can now be used to login to a local Windows OS account.", "authors": ["Ravie Lakshmanan"], "top_image": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2Fyubikey-hed.jpg&signature=d9e3f89b48a6c1e5cee8459f47d256ce", "published_at": "2019-10-18"}