{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/15/white-sox-walk-home-winning-run-lewis-hrs-in-marin", "downloaded_at": "2019-09-16 02:16:02.988955+00:00", "title": "White Sox walk home winning run, Lewis HRs in Mariners' win", "language": "en", "text": "SEATTLE (AP) - Kyle Lewis has walked into the major leagues and made things look easy.\n\nSeems to be rubbing off on the Seattle Mariners.\n\nJosé Ruiz walked Tom Murphy with the bases loaded in the ninth inning after Lewis sparked a five-run rally with his latest home run, and the Mariners beat the Chicago White Sox 11-10 on Sunday for their second straight walk-off win.\n\nLewis hit a three-run home run in the eighth inning to fuel a five-run rally that tied the game, his fourth homer in six big league games. The rookie continued the pressure in the ninth, singling to help load the bases and set up Murphy’s free pass.\n\n“It’s been cool, man, been cool,” Lewis said of his first week. “Just trying to see how things go, get in the flow of it and give it my best shot every day. It’s been a lot of fun.”\n\nThe Mariners batted around twice, scoring five runs in the fourth and eighth innings. The late-inning rally wiped out an eight-run fifth by Chicago that included Wellington Castillo’s grand slam.\n\nThe win came a day after former White Sox catcher Omar Narvaez hit a questioned, game-ending home run for a 2-1 win in 10 innings. There was no question about Lewis’ drive to straightaway center field on Sunday.\n\n“That was kind of the big hit we needed to get us back in the ballgame,” Mariners manager Scott Servais said. “After that, we picked up the momentum and took it from there.”\n\nMallex Smith tied it at 10 with a single that scored pinch-runner Keon Broxton from second base.\n\nRuiz (1-3) gave up a single to Austin Nola, who had four hits, to open the ninth. Lewis singled and right fielder Ryan Cordell bobbled the ball, allowing Nola to move to third. He was replaced by pinch-runner Braden Bishop. After an intentional walk to load the bases, Ruiz walked Tom Murphy on six pitches.\n\n“Tom Murphy did a great job at the end of the game,” Servais said. “He didn’t try to be the hero, just have a good at-bat.”\n\nAustin Adams (2-2) struck out Chicago’s top three batters in the ninth for the win. He got Tim Anderson and Yoan Moncada on three pitches each.\n\nLewis has been a big part of the offense since joining the team last Tuesday from Double-A Arkansas. He became the second major leaguer to hit home runs in his first three games and broke up no-hitters with the first two blasts.\n\nThe 6-foot-4 right fielder, taken 11th overall in the 2016 draft, finished his first week in the majors 8 for 25. He’s the first Mariners player with four home runs and nine RBIs in his first six games.\n\nLewis’ home run and Murphy’s walk wiped away an eight-run fifth inning for Chicago that eventually bloom to a 10-5 lead. It was the biggest inning for the Sox since May 2017. Castillo’s slam was his second of the season and third of his career. He finished with a career-high five RBIs. Adam Engel hit a three-run home run in the inning as well.\n\nChicago’s seven pitchers didn’t fare as well, though, issuing a season-high 11 walks.\n\n“Those are things that we have to certainly clean up in general,” White Sox manager Rick Renteria said. “You see what happens on a major league field. It’s not easy to win on a daily basis no matter who you’re playing. Nobody quits and nobody’s going to feel sorry for them or us or anyone.”\n\nABOUT LAST NIGHT\n\nMajor League Baseball has expressed “regret” over a miscommunication that resulted in Narvaez’s game-ending homer.\n\nNarvaez hit a ball off the top of the wall in the bottom of the 10th inning that was ruled a home run by umpires. The ball did not clear the fence, and had a replay review been conducted, Narvaez would have been awarded a double and the game would have continued tied at 1. There was confusion over which elements of the play Renteria wanted to challenge. There was also concern that Narvaez may have missed home plate.\n\n“In last night’s game there was conversation between the umpires and the White Sox as to the procedure for potentially reviewing two different aspects of the game-ending play,” MLB said in a statement Sunday. “There was then a misinterpretation regarding Chicago’s desire to have any aspect of the play reviewed. We regret that this miscommunication resulted in not reviewing the home run call on the field.”\n\nTRAINER’S ROOM\n\nMariners: OF/DH Domingo Santana (right elbow strain) will be available to the team beginning Tuesday at Pittsburgh. While he’ll be on the lineup card, Servais said he’d probably be used on a spot basis since it’s been several weeks since he’s played.\n\nUP NEXT\n\nWhite Sox: RHP Reynaldo Lopez (9-13, 5.35 ERA) will take the mound at Minnesota on Monday.\n\nMariners: LHP Marco Gonzales (15-11, 4.30 ERA) will seek to extend his career high for victories when Seattle visits Pittsburgh on Tuesday.\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Kyle Lewis has walked into the major leagues and made things look easy.", "authors": ["The Washington Times Http", "Chris Talbott"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/15/white_soxs_mariners_baseball_23943_c0-463-3817-2688_s1770x1032.jpg?6ee84607a137a79bcec1a3b241081b1ba9c51407", "published_at": "2019-09-15"}