{"pub": "breitbart", "url": "https://breitbart.com/news/zimmerman-out-altidore-in-doubt-for-usa-cuba-match-2", "downloaded_at": "2019-10-09 10:49:31.436125+00:00", "title": "Zimmerman out, Altidore in doubt for USA-Cuba match", "language": "en", "text": "Washington (AFP) – Los Angeles FC defender Walker Zimmerman is out and Toronto FC striker Jozy Altidore is questionable for the United States for Friday’s match against Cuba, US Soccer said on Monday.\n\nZimmerman was injured in the 66th minute of LAFC’s 3-1 victory over the Colorado Rapids, which gave the club a final regular-season total of 72 points from their 34 matches, a Major League Soccer record.\n\n“Thank you everyone for your thoughts and prayers. Feeling okay,” Zimmerman tweeted Monday. “So happy to be a part of this @lafc family and a part of history.”\n\nReplacing Zimmerman in the 26-man US training camp for the matches against Cuba and against Canada in Toronto on October 15 will be Atlanta United defender Miles Robinson, who had been set to join the US under-23 squad this week.\n\nAltidore was hurt in the 70th minute of Toronto’s 1-0 home victory over Columbus on Sunday and was set to be evaluated later Monday.\n\nToronto coach Greg Vanney said Altidore, who has scored 11 goals for the Canadian club this season, would require an MRI exam to establish how long he might be out.\n\nThe victory booked Toronto a home MLS playoff match the weekend on October 19 or 20 against DC United.\n\nThe Americans will face Cuba on United’s home pitch as part of the CONCACAF (North American) Nations League, a new competition that will help determine seedings for the final round of 2022 World Cup qualifying.", "description": "Washington (AFP) – Los Angeles FC defender Walker Zimmerman is out and Toronto FC striker Jozy Altidore is questionable for the United States for", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/09/d22a47_united-states-defender-walker-zimmerman-left-was-removed-united-states-640x335.jpg", "published_at": "2019-10-09"}