{"pub": "businessinsider", "url": "https://businessinsider.com/former-y-combinator-partner-decided-to-drop-out-of-law-school-2018-10", "downloaded_at": "2019-09-17 23:24:16.302055+00:00", "title": "A former Y Combinator partner shares the questions he uses to evaluate all risks — including dropping out of law school to start his own business", "language": "en", "text": "A decade ago, Harj Taggar couldn't have predicted what his career would look like today.\n\nTaggar, a former partner at the startup accelerator Y Combinator, is the cofounder and CEO of Triplebyte, a recruiting and technical screening platform for tech companies. Back then, he was a law student in the United Kingdom.\n\nHe had an idea for a business, and was considering moving to Silicon Valley to pursue it. But the prospect of dropping out of law school was intimidating.\n\nSo Taggar evaluated his options using a simple strategy that he still uses and recommends to young professionals today: He got as specific as possible about the risks of dropping out.\n\nTaggar told Business Insider in a 2018 interview, \"What I pushed myself on was, 'OK, what is the big risk here?'\"\n\nHe said he had no real expenses at the time — and also minimal savings. He remembers thinking, \"The worst-case scenario here is, I work on a startup, it doesn't go anywhere, and 12 months later, I re-enroll in law school.\"\n\nSuddenly, that worst-case scenario didn't seem so scary after all. He left law school and moved to the US to work on his startup, Auctomatic, an auction and marketplace management system for sellers.\n\nSoon after, Taggar was accepted into Y Combinator, and his startup received investments from Paul Buchheit, the lead developer of Gmail, as well as the venture capitalists Paul Graham and Chris Sacca. (The business has since shut down.)\n\nA few years later, Taggar became a venture partner at Y Combinator, which in the past decade has launched startups including Airbnb, Dropbox, and Instacart.\n\nIt's OK if you decide not to take the risk — as long as you know exactly why\n\n\"It's easy to avoid taking the leap or doing something because you just have this gut-level feel of 'it's too risky for me to do,'\" Taggar said. He added that he tells people, \"If they have enough curiosity to consider it as an option, but they're afraid of the risk factor, then I'd say be specific. What exactly is the risk?\"\n\nSay you're worried about not having an income while you're building your startup. Taggar called that \"a totally valid concern,\" but added that you can get more specific by asking yourself, \"How long could you go? What would happen if you went six months without being paid a salary?\"\n\nEven if your ultimate answer is \"this just isn't for me,\" Taggar said, that's OK. Maybe you have a mortgage and a new family and it's not the best time to take a risk. The key is to know exactly why you're avoiding that jump.\n\nTaggar said, \"Often people surprise themselves when they write things out and are more specific about the risks and how big the risks actually are for them.\"", "description": "Harj Taggar used a strategy he recommends to young professionals: He got as specific as possible about the risks of dropping out.", "authors": ["Shana Lebowitz", "Sherin Shibu"], "top_image": "https://amp.businessinsider.com/images/5bb7b42f765453626847435c-1920-960.jpg", "published_at": "2019-09-17"}