{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-4554246/North-Korea-boasts-missile-landed-just-7m-target.html", "downloaded_at": "2019-10-05 08:27:39.311025+00:00", "title": "North Korea boasts missile landed just 7m from its target", "language": "en", "text": "North Korea has claimed its latest test missile landed just seven metres from its target in Japanese waters amid some bizarre threats and warnings by Kim Jong-un.\n\nThe ballistic missile launched on Monday travelled 280 miles before landing in the Sea of Japan, which the state called a success.\n\nAs a result, South Korea conducted a join drill with a US supersonic B-1B Lancer bomber, prompting the North's dictator to claim the allied countries were practising dropping nuclear bombs.\n\nKim Jong-un said the reclusive state would develop more powerful weapons to defend North Korea against the United States, and state media quoted him as saying: 'He expressed the conviction that it would make a greater leap forward in this spirit to send a bigger 'gift package to the Yankees' in retaliation for American military provocation'.\n\nScroll down for video\n\nThe ballistic missile which was launched by North Korea on Monday was supposedly a success\n\nThis release from Korean Central News Agency shows the new weapons system being fired\n\nThe North Korean missile is launched which eventually landed just seven metres from its target 280 miles away, the state has claimed\n\nPresident Trump tweeted about North Korea Monday, a day after from his first overseas trip\n\nThe missile launched on Monday was equipped with an advanced automated pre-launch sequence compared with previous versions of the 'Hwasong' rockets, North Korea's name for its Scud-class missiles, KCNA said.\n\nThat indicated the North had launched a modified Scud-class missile, as South Korea's military has said.\n\nThe North's test launch of a short-range ballistic missile landed in the sea off its east coast and was the latest in a fast-paced series of missile tests defying international pressure and threats of more sanctions.\n\nSouth Korea said it had conducted a joint drill with a US supersonic B-1B Lancer bomber on Monday.\n\nDonald Trump has been accused of practicing dropping nuclear bombs\n\nNorth Korea's state media earlier accused the United States of staging a drill to practise dropping nuclear bombs on the Korean peninsula.\n\nThe US Navy said its aircraft carrier strike group, led by the USS Carl Vinson, also planned a drill with another US nuclear carrier, the USS Ronald Reagan, in waters near the Korean peninsula.\n\nA US Navy spokesman in South Korea did not give specific timing for the strike group's planned drill.\n\nNorth Korea calls such drills a preparation for war.\n\nMonday's launch followed two successful tests of medium-to-long-range missiles in as many weeks by the North, which has been conducting such tests at an unprecedented pace in an effort to develop an intercontinental ballistic missile (ICBM) capable of hitting the mainland United States.\n\nSuch launches, and two nuclear tests since January 2016, have been conducted in defiance of US pressure, UN resolutions and the threat of more sanctions.\n\nThey also pose one of the greatest security challenges for US President Donald Trump, who portrayed the latest missile test as an affront to China.\n\n'North Korea has shown great disrespect for their neighbor, China, by shooting off yet another ballistic missile ... but China is trying hard!' Trump said on Twitter.\n\nSouth Korea conducts joint drill with US supersonic B-1B Lancer bomber (file picture) after North Korea's latest ballistic missile test\n\nNorth Korean leader Kim Jong Un supervised the test of a new anti-aircraft weapon system on Monday\n\nJapan has also urged China to play a bigger role in restraining North Korea's nuclear and missile programs.\n\nPrime Minister Shinzo Abe's top national security adviser, Shotaro Yachi, met China's top diplomat, State Councillor Yang Jiechi, for five hours of talks near Tokyo on Monday after the North's latest test.\n\nYachi told Yang that North Korea's actions had reached a new level of provocation.\n\n'Japan and China need to work together to strongly urge North Korea to avoid further provocative actions and obey things like United Nations resolutions,' Yachi was quoted as telling Yang in a statement by Japan's foreign ministry.\n\nA statement from China's foreign ministry after the meeting made no mention of North Korea.\n\nNorth Korea has claimed major advances with its rapid series of launches, claims that outside experts and officials believe may be at least partially true but are difficult to verify independently.\n\nA South Korean military official said the North fired one missile on Monday, clarifying an earlier assessment that there may have been more than one launch.\n\nThe test was aimed at verifying a new type of precision guidance system and the reliability of a new mobile launch vehicle under different operational conditions, KCNA said.\n\nHowever, South Korea's military and experts questioned the claim because the North had technical constraints, such as a lack of satellites, to operate a terminal-stage missile guidance system properly.\n\n'Whenever news of our valuable victory is broadcast recently, the Yankees would be very much worried about it and the gangsters of the south Korean puppet army would be dispirited more and more,' KCNA cited leader Kim as saying.", "description": "The ballistic missile launched on Monday travelled 280 miles before landing in the Sea of Japan, which the state called a success and prompted South Korea to carry out drills.", "authors": ["Gareth Davies For Mailonline"], "top_image": "https://i.dailymail.co.uk/i/pix/2017/05/30/09/40EE163A00000578-0-image-a-10_1496131370123.jpg", "published_at": "2017-05-30"}