{"pub": "fox", "url": "https://foxbusiness.com/politics/us-china-trade-war-beijings-ultimate-goal", "downloaded_at": "2019-10-18 01:15:18.420333+00:00", "title": "US-China trade war: Beijing's ‘ultimate goal’", "language": "en", "text": "China says it's fighting a trade war with the United States for one reason.\n\nContinue Reading Below\n\n“The ultimate goal of the consultations between the two sides is to stop the trade war and cancel all the additional tariffs, which is beneficial to China, to the United States, and to the whole world,” China Ministry of Commerce spokesperson Gao Feng told reporters on Thursday.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\n“We hope that the two sides will continue to work together to advance the negotiations, reach a phased agreement as soon as possible, and make new progress in eliminating tariffs.”\n\nSo far, the U.S. has slapped duties on about $350 billion of Chinese goods and is scheduled to place tariffs on another $150 billion in December.\n\nTrade negotiators from the U.S. and China last week ironed out a framework for the first phase of a trade deal that would see Beijing raise its agricultural purchases to as much as $50 billion annually in addition to reforming intellectual property practices.\n\nIn return, the U.S. agreed not to raise tariffs on $250 billion of Chinese goods from 25 percent to 30 percent on Oct. 15. A decision has not been made as to whether the U.S. will go ahead with the levies scheduled for Dec. 15.\n\nThe trade war has taken a toll on the Chinese economy, and things are expected to get worse before they get better.\n\nChina’s gross-domestic-product grew at a 6.2 percent rate in the second quarter, the weakest in 27 years. Third-quarter GDP, which is due out Thursday evening, is expected to have slowed to 6.1 percent, according to economists surveyed by Refinitiv.\n\nIt’s not just the hard economic data that is being impacted by the trade war. There are also long-term implications as companies including manufacturers of electronics, apparel and electrical equipment are uprooting supply chains and fleeing China for neighboring Vietnam, Taiwan and Thailand in droves in order to avoid the tariffs.\n\n“With more extensive and higher U.S. tariffs activated, we expect stiffer headwind on Chinese exports,\" a team of Hong Kong-based Bank of America Merrill Lynch analysts wrote last month. That will likely thwart capital spending on new factories and equipment even further and \"become the catalyst for policy turnaround,” they added.\n\nThe analysts expect tariffs to remain in place until the end of next year, causing China’s GDP to slow to 5.7 percent.\n\nIt’s not just the Chinese economy that is suffering, though. U.S. GDP slowed to a 2 percent growth rate in the second quarter, down from 3.1 percent in the January-through-March period, and the global economy is expected to weaken as the trade war drags on.\n\n“\"With uncertainty about prospects for several of these countries, a projected slowdown in China and the United States, and prominent downside risks, a much more subdued pace of global activity could well materialize,\" the International Monetary Fund said Tuesday. \"To forestall such an outcome, policies should decisively aim at defusing trade tensions.\"\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nGao says the declining trade figures show “there is no winner in the trade war.”\n\nR.N. White contributed to this report.", "description": "Manufacturers of electronics, apparel and electrical equipment are uprooting supply chains and fleeing China for neighboring Vietnam, Taiwan and Thailand.", "authors": ["Jonathan Garber"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/Trump-Vs-Xi-Trade-War.jpg?ve=1&tl=1", "published_at": "2019-10-17"}