{"pub": "yahoo", "url": "https://news.yahoo.com/comerica-temporarily-close-palm-beach-225500007.html", "downloaded_at": "2019-09-04 08:06:33.843712+00:00", "published_at": "2019-09-02", "title": "Comerica to Temporarily Close Palm Beach County Banking Centers, Offices in Wake of Hurricane Dorian", "language": "en", "text": "DALLAS, Sept. 2, 2019 /PRNewswire/ -- In preparation for Hurricane Dorian, Comerica Incorporated (CMA) has announced precautionary measures to safeguard its customers and colleagues. Beginning September 3, Comerica will temporarily close its Palm Beach County banking centers and offices in Florida, including the following:\n\n\n\nBoca Raton\n\n1675 N. Military Trail\n\nBoca Raton, FL 33486\n\n\n\n1675 N. Military Trail 33486 East Boca\n\n1 S. Federal Highway\n\nBoca Raton, FL 33432\n\n\n\n1 S. Federal Highway 33432 Palm Beach Gardens\n\n2401 PGA Blvd.\n\nSuite 198\n\nWest Palm Beach, FL 33410\n\n\n\n2401 PGA Blvd. Suite 198 33410 Singer Island Bridge Office\n\n155 E. Blue Heron Blvd\n\nRiviera Beach, FL 33404\n\n\n\n155 E. Blue Heron Blvd 33404 Wellington\n\n1037 State Road 7\n\nWest Palm Beach, FL 33414\n\nComerica logo. (PRNewsFoto/Comerica Bank) (PRNewsfoto/Comerica Bank) More\n\n\"Our chief concern is for the safety of our customers and colleagues as they brace for Hurricane Dorian in Florida,\" said Patty Nobles, Florida Market President. \"Therefore, we made the decision to close five Comerica banking centers and offices to allow our colleagues to join their families and finish preparations. Our emergency response teams are closely monitoring Hurricane Dorian and we will reopen our Palm Beach County banking centers and offices as soon as it's safe to do so. As of now, our Naples and Fort Lauderdale locations will be open to serve customers on Tuesday.\"\n\n\n\nComerica customers needing assistance during the shutdown can call the Comerica Contact Center and online and mobile banking will remain available until it is safe for the banking centers and offices to reopen.\n\nCustomers also are encouraged to visit Comerica's social media channels – Facebook and Twitter – for updates.\n\nComerica Incorporated (CMA) is a financial services company headquartered in Dallas, Texas, and strategically aligned by three business segments: The Business Bank, The Retail Bank, and Wealth Management. Comerica focuses on relationships, and helping people and businesses be successful. In addition to Texas, Comerica Bank locations can be found in Arizona, California, Florida and Michigan, with select businesses operating in several other states, as well as in Canada and Mexico.\n\n\n\nCision More\n\nView original content to download multimedia:http://www.prnewswire.com/news-releases/comerica-to-temporarily-close-palm-beach-county-banking-centers-offices-in-wake-of-hurricane-dorian-300910335.html", "description": "DALLAS , Sept. 2, 2019 /PRNewswire/ -- In preparation for Hurricane Dorian, Comerica Incorporated (NYSE: CMA) has announced precautionary measures to safeguard its customers and colleagues. Beginning September ...", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/oALV6_q5nnL4tDczMTgI6w--~B/aD0xMDE7dz00MDA7c209MTthcHBpZD15dGFjaHlvbg--/http://globalfinance.zenfs.com/en_us/Finance/US_AFTP_PRNEWSWIRE_LIVE/Comerica_to_Temporarily_Close_Palm-6b0d0acdfd967c38ae14f7a19e00b9cf"}