{"pub": "dailymail", "url": "https://dailymail.co.uk/health/article-7574227/One-best-decisions-Navy-veteran-got-groundbreaking-penis-transplant.html", "downloaded_at": "2019-10-15 09:43:38.010670+00:00", "title": "'One of the best decisions I ever made': US Navy veteran who got a groundbreaking penis transplant", "language": "en", "text": "Now, 19 months later, the patient has almost regained all sensation\n\nThe complex op in 2018 took 14 hours, involving stitching of every blood vessel\n\nThe US veteran, who chose not to be identified, lost his genitals in 2010\n\nA US Navy veteran who got a groundbreaking penis transplant has said it is 'one of the best decisions I ever made'.\n\nThe unidentified man lost the lower half of his body when a bomb blasted beneath him while he was tending to wounded soldiers in Afghanistan in 2010.\n\nIn the hope of being 'normal' again, three years later he met surgeons at Johns Hopkins Medicine in Baltimore to talk about his genital options after having prosthetic legs fitted.\n\nTwenty five medics, including nine plastic surgeons and two urological surgeons, were involved in his penis transplant on March 26, 2018.\n\nThe man, given a pseudonym of 'Ray', became the first in the world to have a total penis and scrotum transplant from a deceased donor. The donor's testicles were removed for ethical reasons to avoid the risk of the patient having his babies.\n\nThe complex surgery involved transplanting skin, muscles, tendons, nerves, bone, blood vessels, and part of the abdominal wall from a deceased donor.\n\nA year-and-a-half after having the mammoth 14-hour surgery, the patient said he has almost regained full sensation in his new penis, and is able to get an erection and urinate.\n\nThe patient (pictured), who chose not to be identified, lost his genitals and both legs above the knee in Afghanistan in 2010. He has prosthetic legs. He said having the penis transplant a year and a half ago was 'one of the best decisions I ever made'\n\nA team of nine cosmetic and two urological surgeons at Johns Hopkins University in Baltimore performed the first total penis and scrotum transplant in the world on March 26, 2018\n\nThe surgery involved transplanting skin, muscles, tendons, nerves, bone and blood vessels\n\nSpeaking with MIT Technology Review, the veteran said: 'I don’t regret it. It was one of the best decisions I ever made.\n\n'I’m still getting sensation back. It’s pretty close. This is not going to be a quick fix, but I’ve seen improvement over time.'\n\nRay, who is in his mid-30s, was tending to wounded soldiers after an ambush by Taliban fighters in Afghanistan when an IED detonated beneath him.\n\nIt took away his legs and his genitals and it is not clear how he urinated following his injuries.\n\nSpeaking about the traumatic experience to the media for the first time, Ray said he 'remembers everything'.\n\n'I remember thinking a quick thought: \"This isn’t good.\" And then I was on my back,' he said.\n\nIn 2013, Ray met with Dr Richard Redett, a plastic surgeon at Johns Hopkins who decided he may be an ideal candidate for a penile transplant.\n\nHis team of surgeons lead a major program that aims to give penis transplants to 60 soldiers who have been injured.\n\nHowever, Ray's procedure was the first time any team has performed a total penis and scrotum transplant, which is far more complicated.\n\nAfter surpassing the high bar of necessary requirements - he needed to have a urethra and a specific set of blood vessels, Ray decided it was worth waiting for a donor penis.\n\nThe alert finally came in March 2018 that a donor was available in another state. Three surgeons flew from Maryland to retrieve it, before coming back for the 14-hour, 25-medic operation.\n\nRay said: 'This was actually something that could fix me. I could go back to being normal again.'\n\nSurgeons had to stitch nerves, arteries, veins and blood vessels finer than human hairs from the transplant penis to Ray (pictured). It also involved some abdominal wall\n\nThe team said the patients' procedure was 'the most complex to date' because of the scope of his injury. Up until now, surgeons have performed a phalloplasty\n\nIn 2013, the veteran met with a plastic surgeon, Dr Richard Redett (see left) of Johns Hopkins Medicine in Baltimore, who said he was the perfect candidate for a penile transplant\n\nUp until now, surgeons have performed a phalloplasty, which is when the member is made of tissue, blood vessels and nerves taken from a forearm or thigh. A pump causes saline sacks inside the penis to make it 'erect'.\n\nBut these operations tend to carry a high infection risk and the patient doesn't regain natural use of his penis.\n\nA total penis transplant, where a body part or tissue is transferred from one individual to another, is called vascularized composite allotransplantation.\n\nRay was able to have the transplant because he had a urethra and a specific set of blood vessels created for the transplant to work.\n\nSurgeons had to stitch nerves, arteries, veins and blood vessels finer than human hairs from the transplant penis to Ray.\n\nHe was given a new scrotum, but the donor's testicles were removed for ethical reasons. It is not clear if the scrotum is empty or contains prosthetic testes.\n\nHe won't be able to have biological children because his own reproductive tissue was destroyed.\n\nHowever, he takes testosterone to compensate for the loss of his testes and is being treated with another drug, Cialis, to encourage spontaneous erections.\n\nDr W.P. Andrew Lee, the chairman of plastic and reconstructive surgery at Johns Hopkins, told The New York Times they are hopeful Ray will be able to achieve orgasms - but he won't be able to ejaculate because he doesn't have testes.\n\nAfter the surgery, Ray was put on a regimen of immunosuppressive drugs to prevent tissue rejection, which is a concern with any transplant surgery.\n\nUrologist Andre Van der Merwecalls, who performed the first successful penis transplant in the world in 2014, said Ray’s procedure was 'the most complex to date' because of the scope of his injury.\n\nThe veteran's transplant was the fourth in the world and the first involving a scrotum\n\nThere had only been four penis transplants before Ray's - the first was in China in 2006 which was unsuccessful.\n\nThe second was in South Africa in 2014 which was a success. The third was in Massachusetts in 2016, a 64-year-old man who lost his cancer to penis. And the fourth was in Cape Town for a 41-year-old victim of a circumcision gone wrong.\n\nDespite keeping his identity private, and only telling his parents about the loss of his private parts, Ray said he wanted to let other veterans know about their options.\n\nAccording to a report released in 2017, 1,367 male US service members sustained one or more genitourinary (GU) injuries between October 2001 and August 2013.\n\nThe majority of injuries involved the external genitalia including the scrotum, testes, penis and urethra, which can impair several abilities including having sex, fathering children and urinating normally.\n\nAlmost 94 per cent of the sufferers were 35 or younger 'during their peak years of sexual development and reproductive potential,' according to the US Department of Defense's TOUGH (Trauma Outcomes and Urogenital Health) report.\n\nTOUGH say among infantrymen with genital urinary injuries from Iraq and Afghanistan, 502 were injured so severely that a penis transplant might be their only option.", "description": "The US veteran, who chose not to be identified, lost his genitals in 2010. The complex operation in 2018 took 14 hours. Now, 19 months later, the patient has almost regained all sensation.", "authors": ["Vanessa Chalmers Health Reporter For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/09/19730538-0-image-a-3_1571129648035.jpg", "published_at": "2019-10-15"}