{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/fatf-raises-money-laundering-concerns-over-libra-and-stablecoins", "downloaded_at": "2019-10-19 10:46:37.382928+00:00", "title": "FATF Raises Money Laundering Concerns Over Libra and Stablecoins", "language": "en", "text": "Global monetary watchdog, the Financial Action Task Force (FATF), has added its voice to the growing chorus of concerns over Facebook’s Libra and other stablecoins.\n\nMass adoption of such currencies could hinder efforts to detect and stamp out money laundering and terrorist financing, Reuters reported on Oct. 18.\n\nManaging the potential risks of mass adoption\n\nSpeaking to reporters in Paris, FATF president Xiangmin Liu said that both stablecoins — and the companies behind them — would be subject to global standards on cryptocurrencies and traditional financial assets:\n\n“If stablecoins were to become widespread, it could potentially lead to new risks regarding money laundering and terrorist financing […]. It is our job to ensure the new risks in connection with stablecoins will be adequately addressed.”\n\nEverybody hates Libra\n\nStablecoins have existed for several years, although it is only Facebook’s June announcement of Libra that has attracted increased scrutiny as of late.\n\nAuthorities around the globe have raised concerns about Libra, from money-laundering issues to undermining and posing a threat to national currencies. Facebook, in particular, is seen as having the reach and profile to finally bring stablecoins and cryptocurrency into the mainstream with its billions of users worldwide.\n\nEarlier today, a task-force from the G7 group of countries released its full report on the potential impact of global stablecoins.", "description": "FATF has concerns over Libra’s potential use in money-laundering if Facebook’s proposed stablecoin is to become widespread", "authors": ["Jack Martin"], "top_image": "https://images.cointelegraph.com/images/740_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy9kMDhlODQzNDA3MDYzZmNiOGNjMDE4ZGQ1NDRhOGNlMS5qcGc=.jpg", "published_at": "2019-10-18"}