{"pub": "thehill", "url": "https://thehill.com/opinion/criminal-justice/468196-lets-maintain-our-bipartisan-momentum-with-criminal-justice-reform", "downloaded_at": "2019-10-30 23:20:16.654852+00:00", "title": "Let's maintain our bipartisan momentum with criminal justice reform", "language": "en", "text": "Ten months ago, Congress passed the FIRST STEP Act, signaling the arrival of bipartisan criminal justice reform at the federal level. The question for Washington now is: What’s next?\n\nIndividuals and organizations across the political spectrum have united around common themes like justice, fairness, equality, and second chances. They agree that America’s high incarceration and recidivism rates take a toll on families and communities, and that we need to balance personal responsibility with forgiveness and rehabilitation. Solutions to these problems will increase public safety, save taxpayer dollars and restore the lives of both offenders and victims.\n\nThe Council on Criminal Justice has begun the hard work of identifying top priorities for future federal reforms. The council convened its inaugural policy summit in the nation’s capital and circulated draft proposals from its first task force, highlighting the next steps the federal government should take.\n\nADVERTISEMENT\n\nUnveiled by council leaders and the co-chairs of the task force, the preliminary recommendations range from restoring Pell grants for justice-involved individuals to fully constituting the U.S. Sentencing Commission. This is so it can fulfill its duty to make necessary adjustments regarding sentencing standards and conduct a comprehensive review of the U.S. criminal code.\n\nThe council task force also is considering proposals to expand the use of drug, veterans, mental health, and other problem solving and accountability courts, as well as strengthening oversight of the Federal Bureau of Prisons to improve conditions of confinement.\n\nThe past half-century is littered with criminal justice policies and programs that initially seemed like good ideas, but ultimately fell short or even caused harm to individuals and communities. Fortunately, a growing body of research on what works to improve criminal justice outcomes is now available to policymakers as they develop reforms at the federal level.\n\nThe states are already well on their way, with Texas, Georgia, Oregon, Louisiana and others adopting comprehensive bipartisan reform packages in recent years. Continued reform at the federal level, if successfully implemented, will encourage states to deepen their efforts and may spark movement in the few remaining states that have been reluctant to act.\n\nWe know that 97 percent of people in prison will eventually go home. Recidivism — when former inmates commit a new crime and return to prison — has a significant effect on public safety and the viability of our communities.\n\nADVERTISEMENT\n\nResearch has demonstrated that there are proven steps that can reduce recidivism, making all of us safer while increasing the odds that people who return to our communities come back as contributing members of society, working in stable jobs and taking care of their families.\n\nThe passage of the FIRST STEP Act marked a critical milestone in our journey toward a more fair and effective criminal justice system. Let’s maintain our bipartisan momentum — the future of our criminal justice system and our democracy depends on it.\n\nTimothy Head is the executive director of the Faith & Freedom Coalition. Gil Kerlikowske is the former Director of the White House Office of National Drug Control Policy and police chief in Buffalo and Seattle. They both serve on the Board of Directors of the recently-launched Council on Criminal Justice.", "description": "Let’s maintain our bipartisan momentum — the future of our criminal justice system and our democracy depends on it.", "authors": [], "top_image": "https://thehill.com/sites/default/files/prisonerjaildeathpenalty3_getty.jpg", "published_at": "2019-10-30"}