{"pub": "businessinsider", "url": "https://businessinsider.com/blue-apple-beach-house-hotel-review-cartagena", "downloaded_at": "2019-09-14 01:52:06.595177+00:00", "title": "I traveled to Cartagena and the best part of the trip had nothing to do with the popular ancient walled city", "language": "en", "text": "Private plunge pool? Yes please. Blue Apple Beach House\n\nI often daydream about what it would be like to purge my belongings and trade the big city for a sun soaked simpler life on a deserted island, sipping coconuts under a thatched hut as a warm breeze laps my face. But truthfully, I'm just not that rough and tumble.\n\nIn travel, I still aim for a certain sense of luxury, and the closest I've come to marrying those ideals was spending two nights at Blue Apple Beach House. Located on the island of Tierra Bomba, it's a 30 minute speedboat ride from the beating pulse of Cartagena's walled city.\n\nA laid-back retreat, it's where easy-going locals and in-the-know visitors mingle by cerulean-hued infinity pools. A DJ spins tunes, and the kitchen churns out innovative food and drinks.\n\nWith white sand beaches and swaying palms, Blue Apple makes for a popular day trip, and many don't consider devoting nights to staying offshore. Doing so would be a mistake.\n\nKeep reading to see why I was so impressed by Blue Apple Beach House\n\nThere are only five villas, for a true deserted island feel. Blue Apple Beach House\n\nBlue Apple proudly claims it is neither resort, nor hostel. Rather, an immersive destination that's both luxurious and sustainable. The hotel is located near Bocachica on Tierra Bomba, a largely undeveloped area with high unemployment, limited access to education, unpaved roads and scarce running water or electricity. Blue Apple works hard to be respectful of such surroundings.\n\nWhile you won't see any of that when your boat pulls in, it's enough to warrant a strong dose of traveler's guilt. Indulging in a massage and ordering another mimosa while surrounded by poverty can feel unsettling. Blue Apple counters that by creating an experience that supports the local economy. Most Blue Apple employees are area residents, and the hotel subsidizes their English lessons. Only locals are hired to lead activities like snorkeling, dirt bike tours, or massages.\n\nOf course, the walled city of Cartagena shouldn't be missed, and is home to unparalleled food and culture. And while I savored the fiercely fresh ceviche and streets teeming with art and history, I was turned off by squares overrun by tourists, and vendors aggressively hawking tours, t-shirts, and sunglasses. Going out to dinner, I felt surrounded by more North Americans than South.\n\nRetreating to Blue Apple was a welcome respite. ​\n\nWhat it's like to stay overnight\n\nTake a dip in one of two pools flanked by day beds and plush loungers. Blue Apple Beach House\n\nWith just 10 rooms, Blue Apple became impossibly intimate when daytime revelers left on the last boat around 5pm.\n\nThere are standalone bungalows with private plunge pools (my pick), or rooms in a main house with terraces. The private pool came in handy when day trippers got a bit rowdy.\n\nRooms range from $125-$300 a night depending on your choice and season. My rate of $225 ($265 with tax) was more than I typically pay for a hotel, though it's worth noting my hotel for the rest of the week in downtown Cartagena — the lovely Hyatt Regency— was paid for entirely by Chase Sapphire Reserve card points, so splurging for a villa was something I was able to afford.\n\nThe king size bed was super comfy and the private patio was a great spot to read as the sun sets. Blue Apple Beach House\n\nVillas are simple but stylish, with custom linens, handwoven hammocks, and outdoor bathrooms.\n\nBut these are no outhouses. Most bathrooms include an outdoor rain shower made from smooth neutral wood and stone under a thatched awning. The newest villa features a deep soaking tub made from recycled bottles.\n\nDuring my stay, I did share an outdoor shower with a friendly lizard, who was quite polite about the whole thing.\n\nThe outdoor bathroom attached to the villa was my favorite part. Rustic yet luxe at the same time. Blue Apple Beach House\n\nAll rooms have WiFi, air conditioning, a balcony or terrace, minibar, cable TV, and breakfast included, as well as transportation from Cartagena for two people. If you visit for the day, the transfer will not be included.\n\nArtwork was abundant, produced by local artisans and Blue Apple's own artist-in-residence program. Previous participants contributed murals, films, photography, essays, as well as social media content and yoga instruction.\n\nOne of the best parts of bunking were the VIP perks. I was greeted with fresh-squeezed mango juice, and reserved my sunbed of choice every day. One day I took a cabana by the beach, the next, a plush central pool lounger. Each had a placard bearing my name, and I slept in knowing there would be no race to secure it. If you know what you'd like on the day you arrive, ask for it ahead of time. I came on a later boat, and by that time the best options were taken.\n\nThe area in between the pool and beach was my favorite place to sunbathe. Blue Apple Beach House\n\nLike decor, all food was sourced sustainably. Tasty too, which was a good thing considering the island is not well prepared for tourists. Blue Apple is meant to be a place to relax and disconnect. There's no village to explore, or local restaurants to try. As such, expect to take all meals and drinks onsite. Prices are reasonable, but pool drinks add up, and you won't realize it until check out.\n\nFood onsite was tasty — a good thing since there aren't other places to eat while staying here. Blue Apple Beach House\n\nI ate fresh sandwiches for lunch and just-caught fish with delicious coconut rice and beans for dinner. Cocktails served in coconuts with plenty of Colombian rum were at the ready, but standouts were more original, like a concoction of fresh watermelon, ginger and vodka.\n\nMy beloved watermelon cocktail. Emily Hochberg/Business Insider\n\nI indulged in a massage, and truthfully, it was not worth it. While I was happy to put my dollars towards supporting locals, the massage felt more like a light coating of moisturizer. I would skip it next time.\n\nAt night, everyone gathered on the beach as the skies revealed the greatest show I've ever witnessed.\n\nNo filter, sincerely. Emily Hochberg/Business Insider\n\nIn the two nights I stayed there, I bonded with servers who did so much more than just help me secure a coveted daybed. They told me about their lives and we sang along to music together. When it was time to leave, I felt compelled to say goodbye and thank you to each staff member. I've never had that feeling at any other hotel.", "description": "Blue Apple Beach House is an eco-friendly boutique hotel popular for day trips, but staying overnight offers a more authentic feel of Cartagena.", "authors": ["Emily Hochberg"], "top_image": "https://amp.businessinsider.com/images/5d7bfb212e22af24da6acdb4-750-375.jpg", "published_at": "2019-09-13"}