{"pub": "news.com.au", "url": "https://news.com.au/entertainment/tv/radio/kyle-and-jackie-o-extend-their-contracts-with-kiis-fm-for-an-absurd-amount-of-money/news-story/6a7381326d270a5a6e16dcf429d39bb7", "downloaded_at": "2019-10-16 23:14:37.131650+00:00", "title": "Kyle and Jackie O extend contracts with KIIS FM for ‘absurd’ amount", "language": "en", "text": "We give Kyle and Jackie O 60 seconds to reveal what they hate about each other.\n\nWhat Kyle and Jackie O hate about each other\n\nKyle and Jackie O have signed on the dotted line of what’s believed to be the biggest media deal in Australian history.\n\nThe radio hosts have extended their contracts with KIIS FM (which is owned by ARN — Australian Radio Network) in a deal that will see them remain on air at the station until the end of 2024.\n\nNews.com.au understands the new contracts guarantee Kyle and Jackie O between $7-8 million each per year.\n\nThe staggering deal means they will be getting paid more than $39,000 each per three-and-a-half hour radio show.\n\nKyle and Jackie O negotiated their contracts separately and have parity when it comes to their base salaries. However it’s understood both hosts negotiated individual allowances linked to survey and revenue performance.\n\nAs part of that negotiation, news.com.au understands Kyle could pocket almost $50 million from the new deal by the end of 2024.\n\nSpeaking to news.com.au after the announcement, Kyle was uncharacteristically coy about his huge pay day, saying, “I don’t discuss the absurd amount of money I get given to do something I love”.\n\n“Don’t get me wrong, the money’s fantastic, but what really counts for me is the acknowledgment that what Jackie and I have created is one of the most successful shows on earth,” he said.\n\nThe Kyle and Jackie O Show is the number one FM breakfast show in Sydney with an 11.6 per cent audience share. That’s a massive 3.4 per cent more than their nearest FM rivals, WSFM’s Jonesy and Amanda.\n\n“There is no secret to the show’s success,” Kyle told news.com.au. “Ultimately it’s genuine chemistry. I love working with Jackie and that simply can’t be created; it’s either there or it’s not.\n\n“A lot of other stations throw strangers together and scratch their heads when it fails miserably. Radio’s actually really easy, it’s just bad programmers that make it unnecessarily difficult.”\n\nKyle and Jackie O’s radio partnership began in 2000 on the Hot30 which aired nationally on stations owned by Southern Cross Austereo.\n\nThe pair didn’t know each other before their first show and Jackie O was less than impressed when Kyle swore on their first night on air.\n\n“He said the ‘F-word’ as soon as he was on air in the opener,” Jackie O told Osher Gunsberg on his Better Than Yesterday podcast recently. “I didn’t know he was going to do that, but he knew in his head he was going to do that to shock me.”\n\nThings didn’t improve during their second show and afterwards Jackie O called her boss and said, “Look, I don’t know how much longer we’re going to give this, but I don’t think this is going to work”.\n\nBut then something changed.\n\n“He came back the next night and was amazing and we just gelled and it clicked,” Jackie O said.\n\n“Thank god Jeff (their radio boss at the time) gave him a shot because that chemistry didn’t happen immediately, it took us six or eight months to really develop it … but it just kept getting better and better.”\n\nIn 2005, Kyle and Jackie O took over as hosts of the 2Day FM breakfast show in Sydney in a move that was largely orchestrated by Kyle.\n\nAt the time Kyle made the bold prediction that within 12 months he and Jackie O would dethrone Nova’s Merrick and Rosso to become the most listened to FM breakfast show in Sydney.\n\nAnd that’s exactly what happened.\n\nRELATED: Jackie O forced to defend herself over poo jogger rumour\n\nWhat followed over the next decade was a period of unprecedented success with Kyle and Jackie O winning 52 consecutive radio ratings surveys (there are eight radio surveys per year) at 2Day FM.\n\nThe duo then stunned the radio industry at the end of 2013 when they announced they were leaving 2Day FM after contract negotiations broke down.\n\n“They (2Day FM) came with a contract but by then there was a lot of things we had heard that had been said behind the scenes about us, that we were on our way out,” Jackie said on the Better Than Yesterday podcast.\n\n“They were still wanting to sign us, but when you hear things from people that suggest we’re on our last legs, you then start to think, ‘What do we do from here?’\n\n“Kyle called me one night and said, ‘I’ve got an idea. What about we go to Mix FM and we rebrand it as KIIS?’”\n\nJackie assumed Kyle was “in one of his moods” and went along with what he was saying, with the belief he’d have forgotten about it the next day.\n\nBut a month later she received another call from her radio offsider.\n\n“Kyle said, ‘I’ve just gone in and I’ve told them I’m resigning (from 2Day)’,” Jackie O. “He goes, ‘We’re going to Mix, babe’.\n\n“I was furious. I broke down in tears. I said, ‘Kyle, I’ve just signed a mortgage and I have not spoken to one person at Mix. I don’t know what’s going on. Do they even want us or is that a figment of your imagination?\n\n“I was petrified. It gave me no choice, I had to resign as well. I’m not going to stay and do a show without Kyle.”\n\nIn one of the most shocking moves in radio history, Kyle and Jackie O jumped ship to KIIS 106.5 at the start of 2014 and their loyal listeners followed.\n\nWhen the first round of radio ratings were released that year, Kyle and Jackie O were once again the number one FM breakfast show in Sydney.\n\nRELATED: Aussie boss making $459,000 a week\n\nRELATED: CEOs ripped for ridiculous wages\n\n“Thank God for Kyle because he makes these big moves,” Jackie said on the Better Than Yesterday podcast. “He makes big moves and again this one paid off for us.”\n\n2Day FM, the station Kyle and Jackie O left behind, has never recovered. It’s since churned through six breakfast shows in six years with all of them axed due to poor ratings.\n\nSpeaking to news.com.au today, Kyle couldn’t help but have a cheeky dig at his old radio network.\n\n“There’s a lot to be said for how the Australian Radio Network was able to take a successful show like ours from Southern Cross Austereo and actually make it better,” he said. “It’s quite obvious that ARN know how to steer our show’s ship better than the flogs at SCA.”\n\nKyle and Jackie O’s contract news comes just two days before this weekend’s Radio Awards in Brisbane.\n\nAs they are most years, Kyle and Jackie O are nominated for the big award on the night — Best On Air Team FM — and are up against Nova’s Kate, Tim and Marty, WSFM’s Jonesy and Amanda, Fox FM’s Fifi, Fev and Byron, Nova’s Chrissie, Sam and Browny and Triple M’s Kennedy Molloy.", "description": "Kyle and Jackie O have signed on the dotted line of what’s believed to be the biggest media deal in Australian history.", "authors": ["Andrew Bucklow"], "top_image": "https://cdn.newsapi.com.au/image/v1/d6b98f7d3bc1632df52e3570d29542d9?width=650", "published_at": "2019-10-16"}