{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/star-wars-the-rise-of-skywalker-explores-kylos-nakedness-with-rey", "downloaded_at": "2019-10-01 11:46:41.965476+00:00", "title": "Star Wars: The Rise Of Skywalker Explores Kylo's 'Nakedness' With Rey", "language": "en", "text": "Maybe the title is literal... (Image: Disney)\n\nThe door isn’t totally closed, folks. Rey may have physically and metaphorically cut herself off from Kylo Ren at the end of Star Wars: The Last Jedi, but further developing their “complicated relationship” is still a big part of Star Wars: The Rise of Skywalker.\n\nIn an interview with Empire, The Rise of Skywalker co-writer Chris Terrio said the relationship between Rey (Daisy Ridley) and Kylo Ren (Adam Driver) is one of the most interesting parts of the last film. First established in The Force Awakens, their strange ties have become one of the main driving forces behind how they think and what they do.\n\nMuch of it involves Kylo’s vulnerability with Rey, who gets to see a side of him that no one else does. Terrio called it a “nakedness” — fitting, considering he spends a scene in The Last Jedi half-naked.\n\n“Some of the most interesting scenes in The Last Jedi are the conversations between Rey and Ren,” he said. “We’ve tried to pick up that complicated relationship that really has been present ever since the interrogation in Episode VII. When Ren takes off his mask, there’s a nakedness about him with Rey that he doesn’t express to anyone else. Rian [Johnson] developed that in fascinating ways and we’ve been able to develop it even further.”\n\nBoth Driver and Ridley have danced around the bond between Rey and Kylo Ren. Ridley said Rey may be “less inclined to believe” that Kylo is capable of redemption, while Driver noted how their “maybe-bond” could be jeopardy after the shit that Kylo pulled.\n\nThe biggest question hanging in the air for the final film (apart from “What the hell is Palpatine up to?”) is whether Kylo Ren will get redemption in the final movie, with folks divided on whether not he actually could... or should.\n\nEmpire also debuted another new photo from the upcoming film in addition to its new Knights of Ren image.\n\nKylo Ren and some troopers being blown away by some sick tunes from a giant speaker probably. (Image: Disney, Empire)\n\n“The Last Jedi ends with the question in the air: is he going to pursue that relationship more or, when the door of her ship goes up, does that also close that camaraderie?” he told Variety back in May.\n\nStar Wars: The Rise of Skywalker comes out on December 19. Perhaps the Reylos of the world will finally see galactic justice.", "description": "The door isn’t totally closed, folks. Rey may have physically and metaphorically cut herself off from Kylo Ren at the end of Star Wars: The Last Jedi, but further developing their “complicated relationship” is still a big part of Star Wars: The Rise of Skywalker....", "authors": ["Alex Walker", "Zack Zwiezen"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/q0mmepjb2thyoq4a2pwb.jpg", "published_at": "2019-10-01"}