{"pub": "metro", "url": "https://metro.co.uk/2019/10/11/rio-ferdinand-names-daniel-james-manchester-uniteds-influential-player-defends-solskjaer-10904198", "downloaded_at": "2019-10-11 19:59:42.234586+00:00", "title": "Rio Ferdinand names Daniel James as Man Utd's 'most influential' player and defends Solskjaer", "language": "en", "text": "Daniel James was one of three summer arrivals at Manchester United (Picture: Getty)\n\nRio Ferdinand has named Daniel James as Manchester United’s ‘most influential’ player this season and once again leapt to the defence of under-fire manager Ole Gunnar Solskjaer.\n\nThe Red Devils spent close to £150million on Harry Maguire, Aaron Wan-Bissaka and James this summer and it is the Wales international who Ferdinand has singled out for praise.\n\nJames, 21, has already shown glimpses of his immense potential at Old Trafford, scoring three goals in his first four competitive appearances for struggling Manchester United.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\n‘I don’t think they [United] expected what they have got from Daniel James so early on in his Manchester United career,’ Red Devils legend Ferdinand told talkSPORT.\n\nAdvertisement\n\nAdvertisement\n\n‘He’s probably been their most influential player so far, so what does that really say about that squad?\n\n‘You’re buying someone from Swansea who was probably brought in as someone who is going to flourish at a later date.\n\n‘However, he’s been forced to the forefront as their main man in the team at the moment. That really says where Manchester United are at this minute in time.’\n\nFerdinand also says Solskjaer needs at least one more transfer window to build a team capable of bringing back the glory days to Manchester United.\n\nUnited have already lost three Premier League matches this season and currently sit 12th in the table, just two points above the relegation zone.\n\nRio Ferdinand has once again defended manager Ole Gunnar Solskjaer (Picture: Getty)\n\n‘I don’t think this is the time for knee-jerk reactions,’ Ferdinand added.\n\n‘When you’re giving someone millions of pounds to spend money on to affect the squad, it doesn’t seem right to change that right away.\n\n‘It’s just throwing another regime out of the window and starting again and that’s happened far too often in recent years at United because of results and what not.\n\nAdvertisement\n\nAdvertisement\n\n‘There’s been a change in the recruitment, where they’ve brought young, British players into the club, which is a shift from previous years.\n\n‘Time is not something that is afforded to many people in the game, but Ole probably needs another window to get more people in, shuffle the pack and get more out.\n\n‘It’s only then you can really start to judge him in my opinion.’\n\nMORE: Petr Cech praises Chelsea youngsters but warns them they must stay consistent", "description": "Rio Ferdinand has named Daniel James as Manchester United's 'most influential' player this season and once again leapt to the defence of under-fire manager Ole Gunnar Solskjaer. The Red Devils...", "authors": ["Metro Sport Reporter"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-912730684_1570814019.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-11"}