{"pub": "businessinsider", "url": "https://businessinsider.com/wework-ipo-filing-spiritual-phrases-softbank-2019-9", "downloaded_at": "2019-09-23 19:15:46.119526+00:00", "title": "WeWork's biggest investor reportedly urged CEO Adam Neumann to scrap phrases like 'elevate the world's consciousness' in the company's IPO filing", "language": "en", "text": "Softbank, WeWork's biggest investor, did not want WeWork using touchy-feely language in its IPO paperwork, including phrases like \"elevate the world's consciousness,\" CNBC's Alex Sherman reported on Monday.\n\nThe detail comes within a larger report of SoftBank's waning support of WeWork. SoftBank CEO Masayoshi Son once stoked Adam Neumann's eccentricity as a CEO; now, Son believes Neumann has gone too far, CNBC reports.\n\nThe infusion of spirituality into WeWork — in the company's culture and in its IPO filing — has been mocked in the past. The company's dedication in its IPO filing, which spanned a full page and read \"We dedicate this to the energy of We — greater than any one of us but inside each of us\" alongside The We Company logo of a \"We\" inside a circle, was particularly criticized.\n\nSoftBank, which has invested over $10 billion in WeWork, \"urged\" Neumann to scrap the phrase \"elevate the world's consciousness\" from the same filing, but it remained there, CNBC reported.\n\nWeWork declined Business Insider's request for comment on the report.\n\nRead more:WeWork cofounder Rebekah Neumann, cousin of Gwyneth Paltrow, reportedly demanded employees be fired within minutes of meeting them because she disliked their 'energy'\n\nWeWork's mission, as described on its website, also buys into the \"energy of We\": the company calls its coworking spaces \"A place you join as an individual, 'me,' but where you become part of a greater 'we.'\" One of WeWork's listed values on the same webpage is \"together,\" explaining: \"We are in this together. This is a team effort. We always look out for one another. We have empathy, we know we're all human, and know we can't do any of this alone.\"\n\nFormer WeWork executive Richard Markel — who is suing the company — has called the company's culture \"cultish\" to \"a pretty extreme degree\" and described Neumann's cofounders, Miguel McKelvey and Rebekah Neumann, as spiritual leaders of the company as well as executives.\n\nRead more: WeWork CEO Adam Neumann reportedly smoked weed with friends on a private jet to Israel — and the flight crew later found a 'sizable chunk' in a cereal box and recalled the plane\n\nGetty Images\n\nAn uncertain future\n\nAdam Neumann's future at WeWork is uncertain as of Monday: Reuters reported that Neumann has started talks with board directors and investors to discuss his future role, including the possibility of giving up his title as CEO.\n\nThe turmoil surrounding WeWork's delayed IPO, and the antics of CEO Neumann alongside cofounder and spouse Rebekah Neumann, have shoved the company into the spotlight.\n\nThe Wall Street Journal's Eliot Brown published a report on Wednesday that characterized the Neumanns as \"impulsive at times.\" Brown wrote about the Neumanns' lifestyles and management styles, reporting that Adam Neumann smoked weed with friends on a Gulfstream G650 private jet to Israel last summer (and the jet was recalled after the flight crew found a \"sizable chunk\" of marijuana \"stuffed in a cereal box\").\n\nBrown also wrote that Rebekah Neumann demanded that some WeWork employees be fired after meeting them for only a few minutes because she disliked their \"energy.\" Furthermore, she \"pushes to infuse spiritualism in We,\" former employees who worked with her told The Journal.\n\nSoftBank hopes to delay WeWork's IPO; CNBC reported that an imminent IPO would result in SoftBank having to write down its $2 billion investment in WeWork from January.", "description": "SoftBank, which has invested over $10 billion in WeWork, wanted CEO Adam Neumann to scrap the phrase from the company's IPO paperwork.", "authors": ["Rebecca Aydin"], "top_image": "https://amp.businessinsider.com/images/5d88e25e2e22af1989211c07-1920-960.jpg", "published_at": "2019-09-23"}