{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/18/WS5da92317a310cf3e3557141a.html", "downloaded_at": "2019-10-18 03:21:15.492451+00:00", "title": "School trip headscarf row provokes anger in France", "language": "en", "text": "By JULIAN SHEA in London | China Daily Global | Updated: 2019-10-18 10:27\n\nA woman visits a booth selling clothing during the 35th annual meeting of the French Muslim community at Le Bourget, north of Paris, on April 2, 2018. [Photo/IC]\n\nThe French government says there are no plans to impose a ban on Muslim women wearing headscarves when helping out with school activities after a mother on a trip to a regional parliament building in Eastern France was told to remove her hijab.\n\nThe woman, identified only as Fatima E, was at the Bourgogne-Franche-Comte regional parliament building when Julien Odoul of the far-right National Rally party told her to take off her veil.\n\nHis comments provoked a row in the chamber, with speaker Marie-Guite Dufay telling him there was nothing in the laws of the country or the rules of the chamber banning such clothing.\n\n\"I felt rejected in a way I never had been before,\" Fatima told the Collective Against Islamophobia in France, known as the CCIF.\n\n\"They (the children) were really shocked and traumatized … They kept turning round to me, saying, 'But it's (directed) at you! Is it you they're telling to take off your headscarf?'\n\n\" (The politicians) have destroyed all the work I was doing indirectly with this class, where children of immigrant roots often had an attitude of thinking France was against them.\"\n\nFrance is officially a secular state and the wearing of the hijab is banned in schools, government offices and in some public buildings, but in 2013 France's state council ruled that mothers were free to wear whatever they wanted when accompanying children on school outings.\n\nHowever, some politicians argue that as they are taking part in school activities, they should be subject to the same laws the currently prevent girls wearing headscarves in schools, and prevent teachers wearing any religious symbols in the classroom.\n\nAs a result of the incident, the CCIF says a legal complaint was being filed in the city of Dijon over \"violence of a racial nature committed... by persons with public authority\", with a second to follow on Friday alleging \"incitement of racial hatred\".\n\n\"It's not just a question of secularism, but of racism, trying to exclude Muslims from the Republic,\" said the woman's lawyer, Sana Ben Hadj.\n\n\"Without her, this school trip could not have taken place. There were no other parents who could make themselves available.\"\n\nIn another incident, an apology has been made after a nursery school visit to a fire station in Creil, north of Paris, was abandoned when a firefighter incorrectly told one of the mothers helping the group that she needed to remove her headscarf.\n\nFrance's prime minister, Edouard Philippe, has vowed to defend secularism, which he said meant protecting the religious freedom of individuals who can dress as they please on trips, but that view is disputed.\n\nEducation Minister Jean-Michel Blanquer says he accepts mothers are entitled to wear whatever they want on trips but \"the headscarf itself is not desirable\" because of \"what it says about the status of women, what it says about our values\".", "description": "The French government says there are no plans to impose a ban on Muslim women wearing headscarves when helping out with school activities after a mother on a trip to a regional parliament building in Eastern France was told to remove her hijab.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/18/5da92317a310cf3e97a1d9f0.jpeg", "published_at": "2019-10-18"}