{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/30/gareth-bale-boris-johnson-prime-minister-banterpocalyse", "downloaded_at": "2019-10-30 12:09:47.184003+00:00", "title": "Telling Gareth Bale that Johnson is PM took away banterpocalypse’s sole survivor | Marina Hyde", "language": "en", "text": "Why did they do it? What honestly possessed the newspaper journalist who discovered that Gareth Bale didn’t know the identity of the UK prime minister to tell him who it was?\n\nIf you missed this, affable Real Madrid malcontent Gareth Bale gave an interview to the Daily Telegraph this week, in which he revealed: “I don’t even know who the prime minister is any more. I haven’t got a clue.” It was at this point that the interviewer informed him that it was Boris Johnson. BUT WHY, THOUGH? Why was Gareth Bale’s immaculateness taken from him? We had found him – the last pure Briton. He currently lives in Spain, but these are minor details.\n\nSpanish club strike signposts huge attitude change by female footballers Read more\n\nGareth Bale was arguably the last of his kind, our Kung Fu Panda, the sole unknowing survivor of the banterpocalypse that wiped out the innocence of the rest of UK civilisation when Boris Johnson took office. A lot like Last of the Mohicans, only with man-buns. And unlike comparable historical figures – King Kong, Wall-E, various Jedi, Vin Diesel in the Chronicles of Riddick – Gareth didn’t even have survivor guilt or a loathing of his solitude. He simply didn’t know or care why he walked alone. As he told the Telegraph: “I follow the golf, that’s about it. I can tell you who’s No 1 in the world?’”\n\nThank you. Perhaps later. We already knew that Gareth had been nicknamed “the Martian” by some of his Real Madrid teammates, in reference to his remoteness. For Team UK, Bale was the final adult entity to be untainted by the knowledge of what we have become, by the knowledge of the creature that leads us, by the memory of what got us to that previously unthinkable state of affairs, and by the immeasurable psychic burden of all of the above. And yet the Telegraph just went and offered him the fruit of knowledge like it was a touchline water bottle. Naturally, Gareth was never going to be able to distil the latter scale of lapsarian horror into his reply, so when he got told who the prime minister was, he went with: “Well, there we go. I didn’t know that. I thought he was the mayor?”\n\nFacebook Twitter Pinterest SPOILER ALERT: Boris Johnson is prime minister of the UK. He is 55 years old. Photograph: Frank Augstein/AP\n\nClearly, the interviewer is guilty of something vastly bigger than a mere spoiler. For now, the discovery that Gareth was so hermetically sealed prompts me to wonder whether it could have been deliberate – as if he had been chosen for some existentially vital experiment by power unknown. Was this the point of the serial aloofness that has in some ways marked his career? “I look in terms of stuff financially,” he expands of the news, “because [Brexit] affects me in a certain way for investments or money, because things change. But I don’t read most of the nonsense.”\n\nUnderstood. Indeed, some investment firms employ people like Gareth Bale. Well, not exactly like him – but technical analysts, who deliberately seclude themselves from contact with the outside world for long stretches, where they can be safe from exposure to fundamentals (that is, real events). Their sole job is to crunch data and see patterns in numbers, and knowing too much about the fundamentals is an impediment to that. The theory runs that the more you let in the noise and emotion of daily news, the more the purity of your analysis is disturbed and compromised. This, but with Gareth Bale and UK politics.\n\nJohnson could be the shortest-serving PM in 100 years. Bale could have remained ignorant of his tenure in its entirety\n\nThe sense of a ruined experiment was on Tuesday compounded by the news that there will now be a general election in a just a few short (though also extremely long) weeks. If it all goes tits-up for the government’s gamble, Gareth Bale might never have known of the Johnson supremacy. Despite polls suggesting otherwise, the political situation is so exceptionally volatile that an awful lot of things could happen, right down to them staying exactly the same, bar Johnson himself losing his Uxbridge seat.\n\nThe point is: it is more than theoretically conceivable that Johnson could be the shortest-serving prime minister in 100 years, and thus conceivable that Gareth Bale could have remained ignorant of his tenure in its entirety. Before there were smartphones and so on, big news events that happened while you were on holiday felt like they hadn’t truly happened. Clearly they HAD happened, in some philosophical sense or other, but because you hadn’t experienced them unfolding live on the nightly news, they never felt properly real. By way of an example, I will simply never believe the Soviet coup attempt in August 1991 meaningfully occurred, because I was on holiday at the time. I have seen the archive news footage of the tanks on YouTube, but … no. I am unconvinced.\n\nThe Fiver: sign up and get our daily football email.\n\nUltimately, the decision to break the vacuum seal of Gareth Bale has potentially grave implications for our prospects of national healing. We could have done something with his innocence. Anyone with any ambition would have realised the incredibly precious and pure commodity that was an adult mind untainted by the knowledge of Boris Johnson’s prime ministership, and – presumably – of what led us to it. We, as nation rebuilders, could have rolled out the model. A whole army of Gareth Bales could have been cloned with this hideous bit of race memory missing, and a new, more safely unemotional British people could have begun to be assembled. In a strictly scientific sense, we had the chance to put all the tiles back in the bag and pick some new ones – and we blew it. You have to think we deserve everything we don’t get.", "description": "Gareth Bale had been blissfully unaware that Boris Johnson was running the UK – but now the country has blown a prime cloning opportunity to reclaim its lost innocence", "authors": ["Marina Hyde"], "top_image": "https://i.guim.co.uk/img/media/636ca477b72b3ca26dea79bb1e9455f78b60a32e/0_83_3044_1826/master/3044.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctb3BpbmlvbnMucG5n&enable=upscale&s=680258e349d45898edb417fd3d872fff", "published_at": "2019-10-30"}