{"pub": "yahoo", "url": "https://finance.yahoo.com/news/netflix-tests-free-episodes-non-191130473.html", "downloaded_at": "2019-10-02 00:36:34.297772+00:00", "title": "Netflix tests free episodes for non-subscribers as Disney+ launch nears", "language": "en", "text": "Click here to read the full article.\n\nIn just over a month, both Disney+ and Apple TV+ will be widely available, representing the latest serious threats to Netflix’s dominance of the streaming video market. But despite the increased competition, Netflix hasn’t really done much to counter its incoming rivals, but that appears to be changing as the streaming service has begun testing a new feature that is clearly geared toward consumers who have yet to subscribe.\n\nFor a limited time, anyone can watch the pilot of the original series Bard of Blood on Netflix for free. This comes just weeks after Netflix introduced a $3 per month mobile-only plan in India, and serves the dual purpose of attracting an international audience and drawing in consumers who have yet to subscribe to Netflix.\n\nMore from BGR\n\nIt’s unclear if more original content will be made available for non-subscribers, but based on the following statement that the company issued, there is certainly a possibility for more tests like this:\n\nAt Netflix, we try different ways to bring people closer to great stories. We believe many people will find the thrilling story of spy Kabir Anand very appealing and are excited to make the first episode of the series available to everyone for a limited time. In the future, we will consider if we will do this for other films and series.\n\nEmraan Hashmi, the actor who plays Kabir Anand, tweeted out a link to the series where non-subscribers can watch the first episode. As The Next Web notes, Netflix also aired an episode of popular teen drama Elite earlier this month in Mexico and Colombia, so perhaps we’ll see more of this in the months to come.\n\nMission briefing from Agent Kabir Anand:\n\nPreview the first episode of #BardOfBlood without sign up here. https://t.co/LOVifhhBuc\n\n— Emraan Hashmi (@emraanhashmi) September 28, 2019\n\n\n\n\n\nBGR Top Deals:\n\nTrending Right Now:\n\nSee the original version of this article on BGR.com", "description": "In just over a month, both Disney+ and Apple TV+ will be widely available, representing the latest serious threats to Netflix's dominance of the streaming video market. But despite the increased competition, Netflix hasn't really done much to counter its incoming rivals, but that appears to be", "authors": ["Jacob Siegal"], "top_image": "https://s.yimg.com/uu/api/res/1.2/d2wiU9Yk8fzuJhM5Q.6w6Q--~B/aD0xMDY2O3c9MTYwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/us.news.bgr.com/301f11a829fde60d737ee6b95cf26e0f", "published_at": "2019-09-30"}