{"pub": "cnn", "url": "https://cnn.com/2019/10/18/business/bud-light-secret-recipe-stolen/index.html", "downloaded_at": "2019-10-19 11:27:54.854447+00:00", "title": "AB InBev accuses rival of obtaining the secret recipe for Bud Light", "language": "en", "text": "London (CNN Business) Anheuser-Busch InBev has accused rival brewer Miller Coors of obtaining the secret recipes for Bud Light and Michelob Ultra, the latest shot in a long running legal dispute.\n\nThe world's largest brewer claimed Thursday in US court documents that Miller Coors, a subsidiary of, has obtained the \"precise recipes\" for some of its most popular beers, which it considers trade secrets.\n\nThe battle between the brewers started when Anheuser-Busch InBev suggested in advertisements during this year's Super Bowl that corn syrup was being used to make Miller Lite and Coors Lite.\n\nMiller Coors responded in March with a lawsuit that described the ads as \"false and misleading.\"\n\nIn May, a judge orderedto stop using certain language related to corn syrup in its advertising and allowed Miller Coors to proceed with its action. Last month, the court told Anheuser-Busch InBev to stop using the phrase \"no corn syrup\" on its packaging.\n\nThe new legal filing, which is heavily redacted, claims that an employee of the Budweiser brewer sent information including the recipes for Bud Light and Michelob Ultra to an employee of Miller Coors around the time of the Super Bowl.\n\nThe Miller Coors employee had previously worked for AB InBev. He allegedly solicited the recipes via text messages, saying he had been asked by Miller Coors' senior management to provide information about Bud Light, the legal complaint states.\n\nAccording to the court documents, the Budweiser employee printed out screen shots of the recipes, folded them up and removed them from the brewery. The employee then texted photographs of the recipes to the Miller Coors employee.\n\nAnheuser-Busch InBev explains in the court documents that its recipes include specific mixes of hops and barley, as well as the weight and volume of ingredients. It describes the information as \"extremely valuable\" to competitors.\n\nThe brewer of Budweiser is asking for the return of its trade secrets and punitive damages against Miller Coors.\n\n\"Miller Coors respects confidential information and takes any contrary allegations seriously, but if the ingredients are a secret, why did they spend tens of millions of dollars telling the entire world what's in Bud Light?\" Adam Collins, a spokesman for Miller Coors, said in a statement. \"And why are the ingredients printed on Bud Light's packaging in giant letters?\"\n\n\"Anheuser-Busch has lost three major federal rulings in this case and now they are simply trying to distract from the basic fact that they intentionally misled American consumers,\" he added.\n\nRepresentatives for Anheuser-Busch InBev did not immediately respond on Friday when asked to provide further details.", "description": "Anheuser-Busch InBev has accused rival brewer Miller Coors of obtaining the secret recipes for Bud Light and Michelob Ultra, the latest shot in a long running legal dispute.", "authors": ["Charles Riley", "Cnn Business"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/191018072813-ab-inbev-bud-light-recipe-restricted-super-tease.jpg", "published_at": "2019-10-18"}