{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-motor-f1-mexico/hamilton-wins-in-mexico-but-must-wait-for-sixth-title-idUKKBN1X60RG", "downloaded_at": "2019-10-28 09:52:55.440656+00:00", "title": "Hamilton wins in Mexico but must wait for sixth title", "language": "en", "text": "MEXICO CITY (Reuters) - Lewis Hamilton won the Mexican Grand Prix for Mercedes after a first-lap scare on Sunday but the Briton will have to wait another week to wrap up his sixth Formula One world championship.\n\nFormula One F1 - Mexican Grand Prix - Hermanos Rodriguez Circuit, Mexico City, Mexico - October 27, 2019 Mercedes' Lewis Hamilton celebrates after winning the race REUTERS/Carlos Jasso\n\nHamilton’s 10th win of the season, and 83rd of his career, was also a 100th for Mercedes as a constructor.\n\nThe victory stretched his lead over third placed Finnish team mate Valtteri Bottas to 74 points — making the title a mere formality that will surely be secured in Texas next weekend.\n\n“We came here thinking we were on the back foot, knowing it was a difficult race for us, but we pulled through,” said Hamilton, who had not finished on the podium in Mexico for the past two years despite taking his 2017 and 2018 titles there.\n\n“I had quite a bit of damage on my car so the race was quite a bit of a struggle,” said Hamilton, referring to the consequences of an opening lap clash with Red Bull’s Max Verstappen that he described as ‘hair-raising’.\n\n“I don’t mind (not taking the title in Mexico).\n\nBottas now has to win in Austin with a fastest lap to stay in the mathematical reckoning while Hamilton need score only four points — an eighth place — to be sure of the title whatever his team mate does.\n\nFerrari’s Sebastian Vettel was a close second with team mate Charles Leclerc, who started from pole position and set the fastest lap but was undone by a two-stop strategy and a problem pitstop, fourth.\n\nHamilton made his car’s hard tyres last for 48 laps to the finish on a one-stop strategy despite questioning the wisdom of that approach.\n\nWithout regular race engineer Peter ‘Bono’ Bonnington for the first time in seven years, Hamilton suggested he had pitted too early — with chief strategist James Vowles having to reassure him over the radio that the win was possible.\n\nBottas, who crashed heavily in qualifying and started sixth after a lengthy car rebuild, said he could not have done much more on a slow-burning afternoon that was all about tyre management.\n\n“I enjoyed it, considering yesterday. It’s a good result,” he said.\n\nMercedes have already secured the constructors’ title for the sixth year in a row, and are also sure of an unprecedented sixth successive championship double.\n\nMAX CLASH\n\nBoth Mercedes drivers lost out at the start, with Vettel squeezing out Hamilton, who had lined up third behind the two Ferraris but had to take avoiding action.\n\nFour-times champion Vettel apologised to Hamilton, saying he had not seen him in his mirrors and was trying to get into Leclerc’s slipstream for a tow down the straight.\n\nHamilton tracked across the grass runoff, wrestling with the steering wheel to prevent a race-wrecking spin, and returned in fifth place with Bottas losing a place to seventh.\n\nAs Leclerc led Vettel away, Red Bull’s British-born Thai rookie Alexander Albon made the most of the mayhem to catapult himself into third place.\n\nVerstappen, who was stripped of pole on Saturday after failing to slow for warning flags, dropped to the back after contact with Bottas left the 22-year-old limping back to the pits on a wheel rim after a right rear puncture.\n\nThe Dutchman, winner in Mexico for the past two years, carved his way back through the field to sixth at the chequered flag with Albon fifth.\n\n“Lewis was just cruising for most of the second stint up to the point where the pack was arriving, and then I guess he had enough tyres left,” said Vettel of an afternoon on which he overruled the team on strategy and stayed out.\n\n“It was a good race, but here and there maybe with strategy we could have been a bit sharper.”\n\nFormula One F1 - Mexican Grand Prix - Hermanos Rodriguez Circuit, Mexico City, Mexico - October 27, 2019 Mercedes' Lewis Hamilton in action during the race REUTERS/Carlos Jasso\n\nMexican Sergio Perez was seventh for Racing Point, to cheers from the sellout crowd.\n\nAustralian Daniel Ricciardo was eighth for Renault with Frenchman Pierre Gasly ninth for Toro Rosso and German driver Nico Hulkenberg taking the final point for Renault.\n\nRussian Daniil Kvyat finished ninth on the track but was handed a 10-second time penalty after colliding with Hulkenberg and sending him spinning into the wall.", "description": "Lewis Hamilton won the Mexican Grand Prix for Mercedes after a first-lap scare on Sunday but the Briton will have to wait another week to wrap up his sixth Formula One world championship.", "authors": ["Alan Baldwin", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191027&t=2&i=1445619371&w=1200&r=LYNXMPEF9Q0T4", "published_at": "2019-10-28"}