{"pub": "cbc", "url": "https://cbc.ca/sports/tennis/us-open-final-andreescu-williams-heroux-1.5274905", "downloaded_at": "2019-09-08 11:54:40.931826+00:00", "title": "Sports-no-CBC", "language": "en", "text": "Pressure.\n\nThere couldn't have been more pressure on Canada's Bianca Andreescu.\n\nWith tennis legend Serena Williams mounting a memorable comeback in the second set and more than 23,000 fans inside Arthur Ashe Stadium going crazy, the Canadian teenager was feeling the pressure.\n\nIt's exactly where Andreescu wanted to be.\n\nShe plays her best when she's up against it, fearless. Her coach Sylvain Bruneau calls her a warrior and a \"street fighter\" — Andreescu relishes people doubting her.\n\nAnd for a moment, there was doubt.\n\n\"I had some doubts because I've seen her come back before, \" Andreescu said.\n\nWilliams had just won four consecutive second set games to tie it at 5-5. The crowd was whipped into a frenzy, standing and screaming after every point. After dropping the first set 6-3 and falling behind 5-1 in the second set, she suddenly had the look of a champion again.\n\nAndreescu buckled down and brought her best.\n\n\"I just tried to stay as composed as I could,\" Andreescu said.\n\nShe took a deep breath before serving as spectators continued to yell. Finally, Andreescu was able to win a service game, taking a 6-5 lead in the second set and stopping Williams momentum.\n\nShe screamed \"come on\" after moving one game away from the U.S. Open title.\n\nThe pressure shifted back to Williams. This time, it seemed to be too much for the 23-time Grand Slam winner.\n\nAndreescu broke Williams to win the U.S. Open.\n\nWatch highlights from Bianca Andreescu's U.S. Open victory:\n\nBianca Andreescu becomes the first Canadian in history to win a Grand Slam singles title with her straight-set victory over Serena Williams. 1:45\n\nShe's the first Canadian singles player ever to win a Grand Slam title.\n\n\"It's so hard to explain in words. I'm just beyond grateful,\" Andreescu said, beaming during the trophy presentation inside Ashe.\n\n\"I've worked really, really hard. This year has been a dream come true.\"\n\n'An unbelievable match'\n\nWilliams, who has now lost her last four Grand Slam Finals, praised the Canadian tennis star after her first-ever title.\n\n\"Bianca played an unbelievable match,\" she said. \"It was incredible tennis out there.\"\n\nThe two competitors, who played aggressively and with great intensity, have immense respect for one another.\n\n\"Serena is a true legend of the sport,\" Andreescu said. \"She came up to me in the locker room and said things to me I'll cherish for a really, really long time.\"\n\nWhen asked how she handled playing Williams and battling the crowd, Andreescu admitted it wasn't easy.\n\n\"I tried to prepare my best. I'm really proud with how I dealt with everything,\" she said.\n\nAndreescu apologized to the crowd for winning, acknowledging they were all cheering for Williams.\n\nJust before the players step onto the historic Arthur Ashe Court, they see a plaque with the words \"pressure is a privilege\" on it — famous words once said by tennis great Billie Jean King.\n\n\"Bianca plays well under pressure. She goes out and plays hard,\" Williams said. \"She does what she does best and that's hitting winners.\"\n\nThat pressure represents playing in the biggest matches. Rising above it defines champions.\n\nAndreescu is a champion.\n\nA dream come true\n\nAndreescu was overrun with emotion during her post-match press conference when she talked about realizing this moment, talking about playing out this exact scenario in her mind so many times before.\n\n\"This wasn't the only time I've been visualizing playing in the final against Serena Williams,\" she said, stopping to catch her breath.\n\n\"I've been dreaming of this moment for the longest time.\"\n\nIt's been a long journey. Well, maybe not so long. I'm 19.​​ - U.S. Open champion Bianca Andreescu\n\nAndreescu says she's incorporated meditation and visualization as a part of her daily practice for the past couple season.\n\n\"I really believed I could be at this stage. Since then I've been visualizing it every single day. I guess this visualization works.\"\n\nWatch an emotional Andreescu reflect on her historic U.S. Open victory:\n\nBianca Andreescu speaks to the press after her 6-3, 7-5 U.S. Open championship victory over Serena Williams. 1:01\n\nShe said she felt a different pressure waking up on championship morning but immediately started her breathing exercises in advance of her first-ever Grand Slam Final. Andreescu also explained she goes over almost every scenario imaginable before hitting the court.\n\n\"I put myself in situations that can happen in a match and finds ways to deal with that so I'm prepared for anything that comes my way,\" she said.\n\n\"At this level, everyone knows how to play tennis. The thing that separates the best from the rest is your mindset.\"\n\nU.S. Open victory caps meteoric rise\n\nAndreescu began this tennis season ranked 150th in the world. Her rise has been meteoric.\n\nShe hasn't lost a completed match since the beginning of March — a 45-4 record, the best on Tour. She's won 12 consecutive three set matches.\n\nAndreescu is undefeated this season against top-10 ranked players. Including Saturday's U.S. Open championship win, she is a perfect 8-0 against the best tennis players in the world.\n\n\"It's been a long journey. Well, maybe not so long. I'm 19,\" Andreescu said. \"It hasn't been easy, though.\"\n\nShe broke through, winning her first title at the Indian Wells event. Then her stardom rocketed when she captured the Rogers Cup title, winning it all after Williams retired in the championship match.\n\nWatch as Andreescu consoles Williams after Rogers Cup win:\n\nBianca Andreescu and Serena Williams shared an emotional embrace after Williams was forced to retire from the Rogers Cup final due to injury. Andreescu is the first Canadian woman to win the Rogers Cup since Faye Urban in 1969. 2:14\n\nAnd now this — she's made tennis history for Canada with this first Grand Slam win.\n\n\"Last year wasn't an easy period in my life,\" Andreescu said. \"I was going through a lot of injuries. I told myself to never give up. I persevered. I just kept believing in myself.\"\n\nWhat Andreescu has been able to do in one year is nothing short of incredible.\n\n\"It's just crazy what a year can do,\" she said. \"I've dreamt of this moment ever since I was a little kid. But I don't think many people would have actually thought that it would become a reality.\"\n\nHistoric moment in Canadian sports\n\nAndreescu is humble to fault and fearless on the court.\n\nIt's been her goal to inspire young Canadian athletes with her performances and points to athletes before her who have paved the way and inspired her.\n\nShe's hoping her victories can do the same.\n\n\"It's been a goal of mine to inspire many people, especially Canadian athletes,\" Andreescu said.\n\n\"Hopefully, I can be that person for them.\"\n\nTwo years ago Andreescu's goal was to make enough money playing tennis for her parents to be able to travel with her.\n\nNow she's the U.S. Open champion, earning $3.85 million US. Maria, Nicu Andreescu and family dog Coco were in attendance to watch Bianca win.\n\nShe's just getting started.\n\n\"Let's keep this going,\" she said — her last words before lifting the U.S. Open trophy.", "description": "There couldn't have been more pressure on Canada's Bianca Andreescu. With tennis legend Serena Williams mounting a memorable comeback in the second set and more than 23,000 fans inside Arthur Ashe Stadium going crazy, the Canadian teenager was feeling the pressure. It's exactly where Andreescu wanted to be.", "authors": ["Cbc Reporter", "Devin Heroux Reports For Cbc News", "Sports. He Is Now Based In Toronto", "After Working First For The Cbc In Calgary"], "top_image": "https://i.cbc.ca/1.5275072.1567902907!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1173010871.jpg", "published_at": "2019-09-08"}