{"pub": "cbc", "url": "https://cbc.ca/radio/asithappens/they-are-invading-kurdish-politician-defiant-as-turkey-bombs-northern-syria-1.5315053", "downloaded_at": "2019-10-10 00:05:21.470605+00:00", "title": "CBC Radio", "language": "en", "text": "Turkey launched widespread airstrikes Wednesday along the country's border with Syria, in a movement Turkish President Recep Tayyip Erdogan called \"Operation Peace Spring.\"\n\nBut from Salih Muslim's viewpoint, the operation has been anything but peaceful.\n\n\"Suddenly they started to shell all over the border.... All the villages, most of them, they were shelled,\" said Muslim, spokesperson and former co-chair of the Democratic Union Party, a Kurdish political party in northern Syria.\n\n\"We are hearing that some people, civilians, were killed, and some of them were injured,\" he told As It Happens host Carol Off.\n\nSalih Muslim, spokesperson and former co-chair of the Kurdish Democratic Union Party, looks on during a Reuters interview in Berlin in 2013. (Wolfgang Rattay/Reuters)\n\nMuslim spoke to Off from Qamishli, a town on the Turkish-Syrian border that witnesses say was targeted with airstrikes today.\n\nThis early into the attacks, he isn't certain of the numbers of casualties. But he described the scene as intense, with shelling from cannons and airstrikes hitting the region.\n\nHe estimated that around two million people live in the region.\n\nStrikes begin following U.S. withdrawal\n\nThe Turkish strikes began just days after U.S. President Donald Trump announced he would be pulling American troops from the region, abandoning Kurdish forces in the process. The withdrawal was widely criticized in Washington as a betrayal of America's Kurdish allies.\n\nTrump defended the U.S. withdrawal, adding that Turkey must commit to protecting civilians and religious minorities in the area. But today, he condemned the military operation.\n\n\"The United States does not endorse this attack and has made it clear to Turkey that this operation is a bad idea,\" said Trump in a statement.\n\nThe comment didn't do much to assuage Muslim's worries.\n\n\"It doesn't mean anything for us, because I mean, they are shelling. They are invading. I mean, this should be stopped, I think, in any way — by the Americans or otherwise,\" he said.\n\nThe Syrian Democratic Forces is holding thousands of ISIS fighters in several detention facilities in northeastern Syria, and has warned that the incursion might lead to the resurgence of the extremists.\n\nForeign Affairs Minister Chrystia Freeland condemned Turkey's \"military incursion into Syria\" on Wednesday, saying on Twitter that the action \"risks undermining the stability of an already-fragile region.\"\n\nCanada firmly condemns Turkey’s military incursion into Syria today. —@cafreeland\n\n'We just trust our people'\n\nAfter the U.S.'s abrupt pull-out, Muslim says at the moment Kurds can only trust themselves.\n\n\"We just trust our people. We never asked the United States to defend us, or to hold the weapons instead of us. No. We are not expecting such a thing,\" he said.\n\nHe's still open to the possibility of working with other players in the region, including the U.S.\n\n\"If their benefits [align], then we can do it together. And this is what we were doing until now.\"\n\nPeople wave as Turkish soldiers prepare to cross the border into Syria on Wednesday in Akcakale, Turkey. (Burak Kara/Getty Images)\n\nHe even raised the controversial possibility of allying with the Syrian regime led by President Bashar al-Assad. But Muslim said it wouldn't be a decision his party, or the Syrian Democratic Forces, would make lightly.\n\n\"We are looking for our democratic rights to be accepted by the [Syrian] regime. So if they accept it, there is no problem ... Maybe even Assad could be changed,\" he said.\n\n\"They have killed hundreds of thousands of people just not to give democratic rights. So we are not going to make any deal without accepting democracy in Syria.\"\n\nWritten by Jonathan Ore with files from Reuters. Produced by Jeanne Armstrong.\n\n\n\n", "description": "Turkey launched widespread airstrikes Wednesday along their border with Syria, in a movement Turkish President Recep Tayyip Erdogan called \"Operation Peace Spring.\" But from Salih Muslim's viewpoint, the operation has been anything but peaceful.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5315527.1570658108!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/aptopix-turkey-us-syria.jpg", "published_at": "2019-10-09"}