{"pub": "bbc", "url": "https://bbc.com/news/science-environment-50154993", "downloaded_at": "2019-10-23 14:59:02.927228+00:00", "title": "Google claims 'quantum supremacy' for computer", "language": "en", "text": "Image copyright Google\n\nGoogle says an advanced computer has achieved \"quantum supremacy\" for the first time, surpassing the performance of conventional devices.\n\nThe technology giant's Sycamore quantum processor was able to perform a specific task in 200 seconds that would take the world's best supercomputers 10,000 years to complete.\n\nScientists have been working on quantum computers for decades because they promise much faster speeds.\n\nThe result appears in Nature journal.\n\nIn classical computers, the unit of information is called a \"bit\" and can have a value of either 1 or 0. But its equivalent in a quantum system - the qubit (quantum bit) - can be both 1 and 0 at the same time.\n\nThis phenomenon opens the door for multiple calculations to be performed simultaneously. But the qubits need to be synchronised using a quantum effect known as entanglement, which Albert Einstein termed \"spooky action at a distance\".\n\nHowever, scientists have struggled to build working devices with enough qubits to make them competitive with conventional types of computer.\n\nQuantum computers 'one step closer'\n\nQuantum computer 'blueprint' drawn up\n\nD-Wave: A glimpse of future computing?\n\nImage copyright Google\n\nSycamore contains 54 qubits, although one of them did not work, so the device ran on 53 qubits.\n\nIn their Nature paper, John Martinis of Google, in Mountain View, and colleagues set the processor a random sampling problem - where it checks a set of numbers that has a truly random distribution.\n\nSycamore was able to complete the task in three minutes and 20 seconds. By contrast, the researchers claim in their paper that Summit, the world's best supercomputer, would take 10,000 years to complete the task.\n\nHowever, IBM, which has been working on quantum computers of its own, questioned some of Google's figures.\n\n\"We argue that an ideal simulation of the same task can be performed on a classical system in 2.5 days and with far greater fidelity,\" IBM researchers Edwin Pednault, John Gunnels, and Jay Gambetta said in a blog post.\n\nMedia playback is unsupported on your device Media caption What is quantum computing?\n\n\"This is in fact a conservative, worst-case estimate, and we expect that with additional refinements the classical cost of the simulation can be further reduced.\"\n\nThey also queried Google's definition of quantum supremacy and said it had the potential to mislead.\n\n\"First because... by its strictest definition the goal has not been met. But more fundamentally, because quantum computers will never reign 'supreme' over classical computers, but will rather work in concert with them, since each have their unique strengths.\"\n\nFollow Paul on Twitter.", "description": "The company claims a quantum computer has surpassed conventional devices for the first time.", "authors": ["Paul Rincon", "Science Editor", "Bbc News Website"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/7412/production/_109341792_mediaitem109341791.jpg", "published_at": "2019-10-23"}