{"pub": "indiatimes", "url": "https://indiatimes.com/sports/sachin-tendulkar-is-a-legend-beyond-comparison-but-did-you-know-that-the-master-blaster-was-left-out-in-his-first-ever-selection-trials-378642.html", "downloaded_at": "2019-10-26 07:27:57.825315+00:00", "title": "Sachin Is A Legend, But Did You Know He Was Left Out In His First Ever Selection Trials?", "language": "en", "text": "Sachin Is A Legend, But Did You Know He Was Left Out In His First Ever Selection Trials?\n\nSachin Is A Legend, But Did You Know He Was Left Out In His First Ever Selection Trials?\n\nSachin Tendulkar revealed he was not chosen when he appeared for his first selection trials. He added that not being picked only made him work harder.\n\n\"When I was a student, the only thing in my mind was to play for India. My journey started at the age of eleven,\" he said at an event.\n\nBCCL\n\n\"I even remember when I went for my first selection trials, I was not selected by the selectors. They had said that he will need to work hard and improve his game,\" he added.\n\n\"At that time I was disappointed because I thought I had batted well, but the result was not as per expectation and I was not selected. But after that my focus, commitment and capacity to work hard increased further. If you want to realise your dreams, then short-cuts won't help,\" he went on to say.\n\nDon't Miss 375 SHARES 506 SHARES 195 SHARES 3.8 K SHARES 7 K SHARES\n\nBut the man fnished with 15,921 18,426 runs in Tests and ODIs respectively. He also highlighted the importance of his family and coach Ramakant Achrekar in getting where he is.\n\nBCCL\n\n\"For my success in cricket, I owe it to my family -- all the members. I will start with my parents, my brother Ajit and elder brother Nitin, who does not usually come forward, supported me,\" he said.\n\n\"My elder sister, who now resides in Pune after marriage, she supported me. In fact, my sister had presented the first cricket bat to me in my life,\" he added.\n\n\"After marriage (wife) Anjali and (kids) Sara and Arjun and Anjali's parents supported me. My uncle and aunt, many people were there. And of course last but not the least (Ramakant) Achrekar Sir,\" he signed off.\n\nWith Inputs From PTI.", "description": "Sachin Tendulkar revealed he was not chosen when he appeared for his first selection trials. He added that not being picked only made him work harder. \"When I was a student, the only thing in my mind was to play for India. My journey started at the age of eleven,\" he said at an event. Sachin Tendulkar BCCL \"I even remember when I went for my first selection trials, I was not selected by the", "authors": ["Somak Adhikari"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/sachin_tendulkar_1572069443_800x420.jpg", "published_at": "2019-10-26"}