{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/montsion-gloves-crown-agrees-1.5295782", "downloaded_at": "2019-09-25 08:44:27.243531+00:00", "title": "Supervisor ordered purchase of officer's assault gloves, Crown concedes | CBC News", "language": "en", "text": "The Crown in the manslaughter trial of Const. Daniel Montsion has conceded that a member of the officer's unit was ordered by his supervisor to purchase the Oakley assault gloves Montsion wore during the arrest of Abdirahman Abdi.\n\nThe gloves are central to the weapons charge facing the Ottawa police officer in connection with Abdi's 2016 death.\n\nMontsion was wearing the gloves, which have reinforced knuckles, when he punched Abdi in the head during the Ottawa man's arrest on July 24, 2016. Abdi lost vital signs once he was in handcuffs, and died in the hospital the next day.\n\nMontsion has pleaded not guilty to manslaughter, aggravated assault and assault with a weapon.\n\nTwo weeks ago the defence entered receipts into evidence, claiming they prove the Ottawa Police Service (OPS) purchased the gloves for officers on the direct action response team (DART), the unit Montsion was serving with at the time of the arrest.\n\nReceipts for the same style of Oakley gloves worn by Const. Daniel Montsion during the arrest of Abdirahman Abdi, entered into evidence by the Ottawa police officer's defence on Sept. 11, 2019. (Court exhibit)\n\nCrown attorney Philip Perlmutter initially refused to concede that the receipts came from the OPS. But in an agreed statement of facts admitted Tuesday, the Crown and the defence stated that another member of DART, Brad Rogrig, was asked by his supervisor to order the gloves.\n\nThe agreed statement does not solve the mystery of a handwritten note made on a bank statement that was attached to one of the receipts filed by the defence.\n\nThe defence initially suggested the note said \"protective expense,\" but the Crown later submitted it said \"protective eyewear,\" which could suggest the document has nothing to do with the purchase of gloves.\n\nMontsion's defence lawyers claim the handwritten note on the statement reads \"protective expense DART.\" The Crown says it reads \"protective eyewear,\" and say the statement may be unrelated to the purchase of gloves. (Court exhibit )\n\nThe Special Investigations Unit will continue to work with Ottawa police and the City of Ottawa to find any other documents that can clear up the confusion.\n\nTrial winding down\n\nJustice Robert Kelly adjourned the trial until Oct. 21, when the defence will call more evidence from forensic video expert Grant Fredericks. Fredericks is expected to explain his concerns over the reliability of the video evidence in the case.\n\nAfter that, the lawyers will prepare their final submissions.\n\nTypically, the defence would be the first to make closing arguments, but Kelly said he will allow the defence to go second.\n\nThat means the defence will be able to hear the Crown's arguments before making their own.\n\nDefence lawyer Solomon Friedman made the request, arguing \"the Crown theory of liability remains unclear, particularly on excessive force.\"\n\nKelly said he expects the Crown will ask him to make findings about certain facts, and will build their arguments on his conclusions, so he prefers the Crown to go first.\n\n\"I really do think it makes sense in this case,\" Kelly said.\n\nThe lawyers will work during the adjournment to try to set a date for those arguments.", "description": "The Crown in the manslaughter trial of Const. Daniel Montsion has conceded that a member of the officer's unit was ordered by his supervisor to purchase the Oakley assault gloves Montsion wore during the arrest of Abdirahman Abdi.", "authors": [], "top_image": "https://i.cbc.ca/1.4026912.1552944695!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/daniel-montsion.jpg", "published_at": "2019-09-25"}