{"pub": "arynews", "url": "https://arynews.tv/en/pakistan-china-agreed-boosting-mutual-cooperation-fo", "downloaded_at": "2019-10-10 15:06:33.547854+00:00", "title": "Pakistan, China agreed over boosting mutual cooperation: FO", "language": "en", "text": "ISLAMABAD: Pakistan and China have agreed over boosting cooperation in all sectors in prime minister’s meeting with Chinese leaders in his visit, Foreign Office Spokesperson Dr Muhammad Faisal said on Thursday.\n\nAt weekly news briefing in Islamabad spokesperson said that China Pakistan Economic Corridor (CPEC) Authority has been constituted to boost the second phase of the project.\n\nPresident Xi Jinping has supported Pakistan’s stance over Kashmir, the spokesperson said.\n\nWhile commenting on the induction of Rafale fighter jets by India, he said “Anyone gets Rafale or any other fighter jet, Pakistan knows how to defend itself.”\n\nThe spokesperson voicing concerns over the indefinite curfew and blatant human rights violations in Occupied Kashmir, said Pakistan demands lifting of all sorts of restrictions and stoppage of human rights violations in the held valley.\n\nHe said Pakistan stands by the oppressed Kashmiri people. “We are trying to raise the plight of Kashmiri people at every avenue”.\n\nDespite Indian efforts to cover up its brutalities, the plight of the Kashmiri people is being recognized across the world, he said. He pointed out that three US Presidential candidates have added their voice in censuring India on the humanitarian situation in the valley.\n\nReplying a question on Kartarpur corridor, the spokesperson said a formal invitation has been extended to former Indian prime minister Manmohan Singh to attend the inaugural ceremony of the corridor. He said work on Kartarpur corridor is continuing with full speed and it will be completed on time.\n\nDr Faisal responding to a question on the Syrian conflict, said Pakistan appreciates Turkey’s role in finding a viable political solution to the conflict.\n\nHe said Pakistan also recognizes Turkey’s legitimate security concerns in the region. He said Pakistan continues to support the territorial integrity of Syria and hopes that a political solution to the conflict will be reached at the earliest that takes into account the concerns of all the regional stakeholders.\n\nComments\n\ncomments", "description": "Pakistan and China have agreed over boosting cooperation in all sectors in prime minister's meeting with Chinese leaders in his visit, Foreign Office Spokesperson Dr Muhammad Faisal said.", "authors": ["Web Desk"], "top_image": "https://arynews.tv/wp-content/uploads/2019/07/DR-Faisal-FO-spox.jpg", "published_at": "2019-10-10"}