{"pub": "investing.com", "url": "https://ca.investing.com/analysis/fomc-preview-fed-leads-from-behind-on-global-monetary-easing-200431037", "downloaded_at": "2019-09-16 09:25:59.851245+00:00", "title": "FOMC Preview: Fed Leads From Behind On Global Monetary Easing", "language": "en", "text": "The U.S. Federal Reserve is giving new meaning to “leading from behind” as it enables central banks around the world to cut their benchmark rates after it first reversed its own policy of raising rates.\n\nMore than 30 central banks have cut rates so far this year, and the Fed is expected to create more space for them to do so the Federal funds rate at least 0.25 percentage points , to the 1.75-2.00 range. It is the most concerted monetary accommodation cycle since the financial crisis a decade ago.\n\nThe expected Fed cut follows last week to ease monetary policy, even though it has limited leeway to do so. The ECB reduced its bank deposit rate by 10 basis points further into negative territory, to minus 0.5. It also announced the relaunch of its asset purchase program, starting in November with €20 billion a month.\n\nCentral banks in , , , and will also hold policy meetings this week and some of them are likely to cut rates. Australia has cut its rate already to a record low 1% but is likely to cut again this week. Turkey is something of a special case, but its central bank cut its benchmark rate by 325 basis points Friday to 16.5%, after a cut of 425 basis points in July.\n\nCentral banks are seeking to stimulate their slowing economies with monetary accommodation, but they are also under pressure to cut rates to remain competitive in what amounts to a currency war. Switzerland, for instance, which is already in negative territory, has watched the go to a two-year high against the in spite of intervention by the Swiss National Bank.\n\nThe Fed is less interested in competitive devaluatons than in finding the right balance for the U.S. economy. Opinion is sharply divided within the Federal Open Market Committee (FOMC) as to whether further cuts are necessary at this time given that the growth is continuing, is low, and is jerking up to its 2% target.\n\nBut Fed Chair Jerome Powell and his colleagues on the board of governors seem determined to push through one more “insurance” cut—making sure monetary policy is buoyant enough to keep the economy bubbling along and not tip into recession.\n\nIn part, this is an acknowledgment that it read things wrong with its four quarter-point hikes last year. If there was a window for monetary tightening, it closed up pretty quickly.\n\nBritain and Norway, for instance, would sooner raise rates than lower them, given their own situations with inflation and growth. The Bank of England will hold off because it has to keep its tools in place to cope with Brexit, currently scheduled for October 31.\n\nNorges Bank said in June it would raise rates again in September following the 0.25 point hike then, but it has lately been backing off that statement.\n\nThe current downward spiral in benchmark rates creates momentum of its own. The trade war between the U.S. and China is dampening expectations for growth and leaving central banks little choice if they want to support the economy. It even creates pressure on the holdouts at the Fed to get on board with the easing policy.\n\nInvestors will be closely watching how Powell explains the action this week during Wedneday's post-decision, , to see when another cut might be coming. Sentiment in the market has shifted as some of the chiefs at the regional Fed banks have expressed their opposition to further cuts—some with the argument that the Fed needs to keep some tools in case the U.S. does fall into recession.\n\nSo investors are backing off. Fed funds futures, which have been dovish, are suggesting the Fed will pause in October, with the possibility of another cut in December, but maybe not. There is even a small chance policymakers will sit pat at this week’s meeting and not deliver that quarter-point cut, but that is less likely as more central banks cut rates.\n\nAfter all, even if you’re leading from behind, you have to set the pace.", "description": "Market Overview Analysis by Darrell Delamaide/Investing.com covering: USD/CHF, CHF/EUR. Read Darrell Delamaide/Investing.com's latest article on Investing.com Canada.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-16"}