{"pub": "dailymail", "url": "https://thisismoney.co.uk/money/cars/article-7625233/Bristol-proposes-ban-diesel-cars-March-2021.html", "downloaded_at": "2019-10-29 14:37:28.952840+00:00", "title": "Bristol proposes a ban on ALL diesel cars from March 2021", "language": "en", "text": "Bristol City Council has proposed a ban on all diesel vehicles from its city centre as well as a congestion charge zone for older commercial vehicles from 2021 in a bid to reduce air pollution.\n\nIf approved, it would be a landmark ruling, becoming the first UK city to impose an outright ban on diesel passenger cars.\n\nA designated Clean Air Zone would also include a congestion charge affecting non-compliant commercial vehicles such as buses, taxis and lorries having to pay a fee to enter the city centre.\n\nDiesel ban: Bristol City Council is to present its plans for a 'small area' ban on diesel cars in the city centre and a congestion charge zone for buses, taxis and lorries next week\n\nWhile private cars would be included in the 'small area diesel ban' in a designated section of the city, they would escape the wider congestion charge.\n\nBristol City Council had previously consulted on two options earlier this year - a ban on diesel cars during peak hours or a congestion zone for commercial vehicles - but estimated that each option alone would not have cut harmful nitrogen oxide (NO2) levels to legal limits until 2028.\n\nIn order to hit EU air quality targets sooner, a more radical third option being presented is a combination of the two.\n\n'Bristol City Council's Cabinet is being asked to approve an ambitious plan for a Clean Air Zone in the city which will deliver the fastest possible improvement in air quality against targets for nitrogen dioxide (NO2) legal limits,' it said in a statement last night.\n\nIf given the green light, the ban and congestion zone will be implemented from March 2021.\n\nThat would make Bristol the first UK city to impose a small area diesel ban on all vehicles - more extreme measures than have so far been proposed for London's Ultra Low Emission Zone (ULEZ).\n\nEven the latest - and cleanest - diesel cars would not avoid the restriction.\n\nThe plans include the introduction of a vehicle scrappage scheme to help those with diesel cars replace them with petrol or greener hybrid and electric models, it has been confirmed.\n\nThe mayor also promised to improve the public transport network in the city as part of efforts to persuade locals to give up their polluting cars.\n\nCabinet is being asked to approve an ambitious plan for a Clean Air Zone in the city. The plan recommends we become the first city in the UK to introduce a small area diesel ban for all vehicles, plus a charging zone for non-compliant commercial vehicles https://t.co/KaAHR2iMRY pic.twitter.com/ZypZyhvRTQ — Bristol City Council (@BristolCouncil) October 29, 2019\n\nMayor of Bristol, Marvin Rees, said: 'These ambitious plans demonstrate our commitment to tackling air pollution so we meet legal limits within the shortest time, without disproportionally affecting citizens on lower incomes which would happen with a blanket approach to charging vehicles.\n\n'Protecting the most vulnerable people from pollution is central to these plans and we have ensured that all impacts have been carefully considered.\n\n'If approved, mitigation measures will support those most affected, especially those living in the most deprived communities.'\n\nThe plans are due to be presented to the city council's cabinet on Tuesday 5 November.\n\nIf approved, the proposals will then be submitted to the Joint Air Quality Unit - a team setup by the Department for Transport and Department for Environment, Food and Rural Affairs to specifically deliver changes to reduce pollution to meet EU limits.\n\nA thumbs up from the government department would see the ban and congestion charge zone introduced in less than two year's time.\n\nIf given the green light by the government, the extreme measures would be introduced in March 2021 - making Bristol the first UK city to impose a ban on all diesel cars in a specific area\n\nRAC head of roads policy Nicholas Lyes said Bristol City Council's proposals were 'unprecedented'.\n\n'Major routes into, out of, and even around the city – like Temple Way and Brunel Way – would become out of bounds, with diesel vehicles forced onto other roads, which risks causing congestion problems where they don’t exist at the moment,' Lyes warned.\n\n'Bristol has bold plans to improve its public transport system, but major improvements like its mooted rapid transit system or even more park and ride sites are still many years from becoming a reality.\n\n'In the meantime, many drivers are faced with having to use their car for journeys in and around the city simply because there is no affordable, reliable alternatives. This would become more difficult under these plans.'\n\nLyes also said the ban could have a huge impact on those with diesel cars on lease or finance packages that will still be in place when the ban is due to be put in place.\n\nThese drivers could face large financial penalties for attempting to exit their contracts early.\n\n'There will also be drivers of older vehicles who are faced with having to give up their vehicles and switch to something different – which could be extremely costly,' he added.\n\n'The devil will be in the detail, but we are concerned that a scrappage scheme would not prove effective in getting people into cleaner cars, since such schemes are designed to get people into brand-new – and still more costly - vehicles.'\n\nBristol is the sixth biggest city in the UK with a population of around 617,000 people - more than Glasgow, Edinburgh and Leeds.\n\nLocals have been responding to the proposal online, claiming it is no more than a taxation on motorists and will fail to reduce emissions.", "description": "All diesel passenger vehicles will be banned from a 'small area' of the city, while a wider congestion charge zone would be implemented for commercial vehicles, buses and taxis.", "authors": ["Rob Hull For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/10/20318918-0-image-a-39_1572343210604.jpg", "published_at": "2019-10-29"}