{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/arsenal-team-news-latest-ahead-20585442", "downloaded_at": "2019-10-15 15:08:34.222893+00:00", "title": "Arsenal team news latest ahead of tricky Sheffield United clash", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Arsenal FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nArsenal could welcome back two players for their trip to Sheffield United on Monday night, but have one youngster ruled out.\n\nThe Gunners travel to Bramall Lane for a difficult test against Chris Wilder's newly-promoted Blades.\n\nUnai Emery has a fairly clean bill of health among his squad as the international break draws to a close, with Alexandre Lacazette in line for a possible return to action.\n\nThe French forward has been out injured since the North London derby draw with Tottenham at the beginning of September.\n\nHowever Football London report that Lacazette has been training outside for over a week now putting him in contention for the Gunners' next fixture.\n\n(Image: Action Images via Reuters)\n\nEmery is also boosted by the fitness of 19-year-old Emile Smith Rowe, who has recovered from a head injury.\n\nThe winger suffered a concussion in the Carabao Cup win over Nottingham Forest at the end of last month, but did not sustain any other damage and is now available for selection.\n\nSmith Rowe is yet to feature in any of Arsenal's league matches this season, but could be drafted in to replace the injured Reiss Nelson.\n\nPromising youngster Nelson has been ruled out for approximately seven matches after withdrawing from the latest England under-21 squad.\n\n(Image: CameraSport via Getty Images)\n\nNelson has played a part in six matches so far this season, including the 4-0 Europa League win over Standard Liege.\n\nBut it was during that contest that Nelson picked up a knee injury, and scans have since ruled him out for at least a fortnight.\n\nArsenal have four games during that period, including the clash with Sheffield United and their next round of Carabao Cup action with Liverpool .\n\nThey then have three more matches before the next international break, meaning Nelson may not feature for the Gunners until the clash with Southampton on November 23, if he is unable to prove his fitness beforehand.", "description": "The Gunners return to action with Monday's tough visit to Bramall Lane but a key first-teamer could return", "authors": ["Darren Wells", "Image", "Action Images Via Reuters", "Camerasport Via Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20585431.ece/ALTERNATES/s1200/0_Premier-League-Leicester-City-v-Arsenal.jpg", "published_at": "2019-10-15"}