{"pub": "guardian", "url": "https://theguardian.com/sport/blog/2019/sep/21/reece-hodge-high-tackle-peceli-yato-australia-fiji-rugby-world-cup", "downloaded_at": "2019-09-21 14:47:35.346697+00:00", "title": "Where does Reece Hodge’s baffling escape leave high tackle crackdown? | Andy Bull", "language": "en", "text": "The Australia wing caught Fiji’s Peceli Yato in the head with a shoulder and didn’t use his arms, World Rugby’s tackle directives could not be clearer – yet no action was taken\n\nFor 15 minutes the Sapporo Dome sounded as loud as any other ground in the game. And then the rugby started. The volume was ear-splitting in the minutes before kick-off, while the stadium PA was pumping out music, but it fell almost entirely silent in the very second the New Zealander Ben O’Keeffe blew his whistle.\n\nIt was so quiet in the first half that you could clearly hear the players shouting to each other over the murmurs of the 40,000-odd people in the ground. It made it all feel fairly surreal, as if all these happy new fans were still trying to figure out exactly what they were watching. Well if they were, forgive them their confusion, because, judging by the refereeing, a lot the experts out there are pretty baffled, too.\n\nThe match turned in the 25th minute. Till then, Fiji had been so much better, stronger, faster, sharper than Australia that it was not at all clear which of the two teams were supposed to be favourites. It was not just the Japanese who were quiet. The thousands of Australian fans there were dumbstruck, too, you guess, at the way the Wallabies were being shredded in front of them.\n\nAustralia rally to Rugby World Cup win as Fiji count cost of high Hodge tackle Read more\n\nA group of supporters behind the Australian posts eventually struck up a chorus of Waltzing Matilda. Who’ll come a waltzing Matilda with me? The Fijians didn’t need to be invited, they were already dancing dizzy rings down on the field.\n\nIt began when their brick-wall winger Semi Radradra bounced Reece Hodge on to his backside. Hodge, a glutton for punishment, ended up on the other side of the field, where Radradra’s teammate Josua Tuisova hit him harder still.\n\nBut it was the man who scored Fiji’s first try, Peceli Yato, who was doing most of the damage. Yato is an absolute menace, “99.9% muscle” James Haskell once said after playing against him. He doesn’t dance, but charges. He won a penalty, too, by swooping on the loose ball and breaking away down the middle in a mad sprint after Christian Lealiifano had been clattered by Levani Botia.\n\nHodge was having a hell of a day of it. When Yato came at him again, barnstorming down the wing after a nifty short lineout, Hodge decided to throw himself into the road like a despairing lemming. Trouble was, he didn’t make any effort to tackle him, or even try to wrap his arms around him. In the end it was like watching a runaway truck colliding with a telegraph pole. They both came tumbling down.\n\nAustralia 39-21 Fiji: Rugby World Cup 2019 – as it happened Read more\n\nWorld Rugby’s tackle directives could not be any clearer about a collision like this. Hodge did not use his arms, his shoulder collided with Yato’s head, and, since they had both been standing up, there were not really any mitigating circumstances.\n\nDominiko Waqaniburotu, Fiji’s captain, said later he had asked the referee to have the TV match official, Rowan Kitt, take a look at it, and that O’Keeffe reported back that the Englishman had not seen anything. Online, though, one of the men who was involved in developing those new tackle guidelines, the South African sports scientist Ross Tucker, was unequivocal. In his opinion Hodge should have been sent off.\n\nInstead, it was Yato who had to go. He left the field for a head injury assessment on his concussion, which he failed. When he reappeared, it was only so he could lie flat on his back by the side of the field, distraught that it was all over for him. He is certain to miss Fiji’s next game, too, against Uruguay on Wednesday.\n\nYato had been the best player on the pitch till that point, driving Fiji forward with his hard-charging runs through midfield. He had made three carries, two clean breaks, and beaten two defenders, for 81 metres. Now he was gone, the game slowly began to tilt back Australia’s way. Worse still, it was Hodge who scored the very next try, with a fine flying finish in the corner on the overlap.\n\nThere’s no blame on Australia, here. They caught a break and made every use of it. Given the way they tightened up their play in the 20 minutes after half-time, when they settled down to a lot of dirty – and deadly effective – set‑piece work, they may well have won anyway.\n\nThe problem is that what everyone understood to be true from World Rugby’s tackle directives, and what everyone saw play out on the pitch, just didn’t seem to square up with each other. And if the game doesn’t seem to make sense to people who already know and love it, what chance has everyone else got?", "description": "The Australia wing caught Fiji’s Peceli Yato in the head with a shoulder and didn’t use his arms, World Rugby’s tackle directives could not be clearer – yet no action was taken", "authors": ["Andy Bull"], "top_image": "https://i.guim.co.uk/img/media/69da2634924130b1ee0a26bd9a02e67dc3fd4555/0_174_2502_1501/master/2502.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=bcff9bf43da09c6a295bed302fabf1dd", "published_at": "2019-09-21"}