{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/dont-blame-the-classification-board-for-dayz-blame-the-government", "downloaded_at": "2019-10-10 08:35:51.707642+00:00", "title": "Don't Blame The Classification Board For DayZ, Blame The Government", "language": "en", "text": "Games don't get banned all that often, and every time it happens there's a surge of interest in Australia's archaic classification system. That's generally followed by a torrent of abuse against the Classification Board, occasionally Australia itself, and more recently, a bit of public vitriol directly against the members of the board.\n\nBut as was the case when Fallout 3 and Mortal Kombat were completely banned from sale, the same situation applies with DayZ. Rather than directing ire towards the people whose sole job is to enforce the letter of the law, people need to go all the way back to 1995.\n\nThis story has been republished ahead of the Classification Board's appearance at PAX Australia this week, as a primer to the country's history with classification and the issues that need to be resolved going forward.\n\nThe idea of putting boundaries on what content Australians can consume is older than Australia itself. It was first born from the British idea of obscenity, which Chief Justice Cockburn established as a legal precedent back in 1868. Justice Cockburn was overseeing a case where Henry Scott was selling an anti-Catholic pamphlet called The Confessional Unmasked: shewing the depravity of the Romish priesthood, the iniquity of the Confessional, and the questions put to females in confession, and it was the first major case to test obscenity after England passed the Obscene Publications Act in 1857.\n\nChief Justice Cockburn only heard the case on appeal, after the court initially ruled that the pamphlets were designed to expose problems in the Catholic Church. In that judgement, Chief Justice Cockburn overruled the lower court's decision and wrote that obscenity was \"whether the tendency of the matter charged as obscenity is to deprave and corrupt those whose minds are open to such influences, and into whose hands a publication of this sort may fall\".\n\nIn simple terms, the ruling meant the intention of the publication was irrelevant. If any part of a work contravened the act, then the entire work had to be outlawed.\n\nThat rule was called the Hicklin test, and after becoming the standard for obscenity in Britain it was adopted in the United States and re-enforced both through the Comstock Act and the rulings by federal judges, and in 1896, the Supreme Court. Because Australia adopted British common law as the basis for our own system, the legal idea of obscenity took root here, and in some ways, the spirit of that law still exists today.\n\nThe Hicklin test functioned as the rudimentary basis for censorship in Australia for decades and much of the country's early history. An update to the Customs Act in 1917 established the Commonwealth Film Censorship Board, and under the Customs (Cinematograph Films) Regulations of 1926 and Customs (Prohibited Imports) Regulations in 1956 (the latter of which is still in force today) it was the responsibility of Customs officers to search and seize any material deemed too obscene for Australia.\n\nBut it wasn't until 1949 that the current model, and the basis for the problem that Australia has with video games, began. After the Second World War, Tasmania, Queensland and Western Australia signed a deal with the Federal Government that made the censorship of films — the first Australian TV broadcast wasn't until November 5, 1956 — the Commonwealth's responsibility. The rest of the states and territories followed suit, but it was only for films: states were still responsible for classifying, and banning if necessary, literature.\n\nThe clause in the Customs (Cinematograph Films) Regulations 1926 act showing what content can be censored or removed from sale/distribution in Australia. This act has since been replaced with the current classification code. Image: Australian Government Federal Register of Legislation\n\nBy the '70s and '80s, new standards and precedents on obscenity and the censorship of material had changed worldwide. The Hicklin test was thrown out in 1933 when the government attempted to censor Ulysses — which was allowed for sale locally, then banned in 1929, unbanned in 1937, and then restricted in 1941.\n\nStandards began to change thanks to Customs Minister Don Chipp — who later founded the Australian Democrats minor party and coined the phrase \"keep the bastards honest\". A member of the conservative Liberal Government, Chipp had a strong personal objection to the idea of censorship, and began repealing censorship on literature entirely. His reforms allowed the sale of Playboy magazine in Australia for the first time, and Chipp also oversaw the introduction of the R rating for films, which wouldn't be implemented for video games until over four decades later.\n\nBut there was still fragmentation between the states and the federal government on the classification of material. States and territories were still responsible for determining what can be viewed and broadcast in their own borders. In 1983, the Commonwealth and the states met to review the first proposals for Australia's first national classification code, that would see all publications and videotapes given the same classifications regardless of location. Because of the prior agreements, the federal government couldn't introduce a classification system without the agreement of the states.\n\nAs always, progress was slow. The states agreed that classification of videotapes would be voluntary, with the Film Censorship Board (which would later become the Office of Film and Literature Classification in 1996) being responsible for individual classifications. Five categories were agreed upon: G, PG, M, R and X, but off the bat, Queensland and Tasmania indicated that they would not allow the sale of X-classified material. The rest of the Australian states took the same view in 1984, leaving the Northern Territory and Canberra as the only places where X18+ material can be sold, seen or bought today.\n\nAnd that would become the model for the evolution of Australia's classification system, and why it took Australia so long to get an R18+ rating for video games in the first place.\n\nTo comply with Australia's classification system, Bethesda edited all copies of Fallout 3 to make morphine Med-X, a change that exists today in Fallout 76. Image: Fallout 3\n\nThe National Classification Scheme was officially established in 1995, with the federal government, states and territories all passing legislation through their own houses to bring the scheme to life. Under the model, and explained by the Classification Board's then-director during a speech to Monash University in 2009, the Commonwealth takes charge of the classification process, while the states and territories take charge of enforcing any breaches of the guidelines.\n\nThe Classification Board's role, then, is really an advisory one. Rather than being responsible for doling out bans or classifications as they're traditionally seen, their job is simply to review content applications against the guidelines established by the states — and that's where the problem lies.\n\nSyndicate was banned in Australia due to the locational damage and potential dismemberment, decapitation or bisection of bullets, a feature that was common in shooters for around a decade since the release of Kingpin almost a decade earlier. Image: EA\n\nThe problem with DayZ's ban, a game Australians could buy online for almost five years, is best told through the story of Michael Atkinson. Michael Atkinson was the former attorney-general for South Australia and, by virtue of his position, a regular feature at the yearly meetings between the Commonwealth and the states.\n\nAs Mark Serrels retold in 2014, Atkinson saw himself as the last line of defence in a war against corporate interests, an icon of democracy at work.\n\nAnd importantly, he saw himself as right. Video games weren't just a problem for his family, but a problem for the whole nation. During the 2014 state election, Atkinson told ABC's Good Game that gamers were a bigger threat to his family than \"the outlaw motorcycle gangs who also hate me\".\n\nIt was absurd, the worst kind of hyperbole. But as long as he was Attorney-General, Atkinson vowed to use his power to prevent an R18+ classification from becoming a reality.\n\nWe didn't have an R18+ rating for years purely because one person, one single person in South Australia, decided it wasn't in the interests of the nation.\n\nThe Right Side Of History: The Gamers 4 Croydon Story Before the first R18+ game, before Gamers 4 Croydon, South Australian Attorney-General Michael Atkinson knew his stance against adult video games in Australia could not last. His final stand took place in his own electorate of Croydon, a small suburb of Adelaide. Read more\n\nAnd that's the problem we still face with the system today. As the industry discovered in the weeks, months and years after Atkinson's resignation, Australia's classification guidelines are a bit like the board of Nintendo. Everyone has the power to shut something down, and if there isn't unanimous approval, then there's no chance of getting changes over the line.\n\nR18+ games are allowed to be classified in Australia, but the problem now lies with the antiquated guidelines themselves. Medicinal cannabis is a reality in Australia and the push for its legalisation is gaining steam. Yet, as DayZ discovered, the drug is still persona non grata. And as We Happy Few abruptly discovered last year, even trying to make a point about state-sponsored drugs and dystopian societies, like they did with the drug Joy, can fall afoul of the current classification guidelines.\n\nAs it stands, games cannot be rated in Australia if their use is \"detailed or realistic\". And if that drug use is tied to anything that could be considered an incentive or reward, then it doesn't matter if it's a fake drug — that can't be classified in Australia either.\n\nWe Happy Few Developers: The Classification Board 'Made The Best Decision They Could' Following the unanimous overturning of the Classification Board's original RC rating for We Happy Few, Compulsion Games has expressed sympathy for the statutory body. The studio — and Aussie gamers — is glad that the RC rating was overturned, but one We Happy Few producer isn't sure the Board could have ruled any other way. Read more\n\nThe Reasons Why We Happy Few's Ban Was Overturned The Classification Review Board - which operates as a separate body to the Classification Board itself - has finally published the reasoning for its decision to overturn the RC rating for We Happy Few. In its report, the review panel noted that the game \"quickly establishes\" that the hallucinogenic state induced by the drug Joy was \"undesirable\" and that the game's overall quest was to \"avoid the use of the Joy drug\". Read more\n\nThe Classification Board's problem isn't that its members enjoy stopping Australians accessing games or content that most ordinary people know how to access anyway. The Board itself is actually quite diverse by design: the Act requires that the members of the Classification Board contain a mix of ages, professional backgrounds, life experience and academic backgrounds. The Review Board, which is a separate statutory body to the Classification Board itself, has a similar makeup.\n\nThe problem is that both bodies are stuck to the current guidelines, and changing those guidelines is almost impossible.\n\nImage: Supplied\n\nIf you've followed the history of games being banned in Australia, there's been an interesting development over the last few years. It might be a result of more public exposure to games being banned, and it might also just be the changing dynamic of who sits on the board at any given time.\n\nBut in the last couple of years, the Board has been increasingly vocal about what's been refused classification. Reports of games have included notes about things that could be removed, or what the board thinks the game would have been rated if certain elements were removed.\n\nIt's the bureaucratic equivalent of a wink and a nod. Their job is to enforce the letter of the law, but that doesn't mean they don't think it should be changed. They still have to enforce it, and offering more vocal guidance around that is a nice, subtle way of putting a spotlight on how antiquated the current guidelines are.\n\nThe Classification Board is trying to change that. As part of the federal Department of the Communications and the Arts, the board is leading a review into the guidelines for film and video games \"to ensure they reflect contemporary Australian community values\".\n\n\"Ministers agreed that the Australian Government will develop a new set of guidelines for the Classification of Computer Games and guidelines for the Classification of Films and, if necessary, an amended National Classification Code, to be brought forward at a later CAG meeting,\" a joint note from the Council of Attorneys General said.\n\nThat process, which the Classification Board pointed out in their statement on DayZ, is public. It's deliberately public because the Board and the ministers know that community attitudes have changed. Take this remark the board made in their annual report for 2017-18 about the current guidelines:\n\nThe Board is supportive of a review of the Games Guidelines so that the Board may more accurately inform the Australian public about the impact level of classifiable elements within computer games. Additionally, the Board looks forward to receiving research from the Branch about the Australian community’s awareness of, and concerns regarding the growing use of ‘loot boxes’ and other microtransactions in computer games.\n\nAny changes will still take a literal age to go through. That's natural: the state governments aren't going to forgo their power to the Commonwealth, and the Commonwealth isn't asking for it, so don't expect games like DayZ to patch in blunts before Christmas.\n\nThe department is publicly telling people that the old system holding everything back is being set up for change. It's a system that was designed to give state governments more agency and power, even if that power resulted in them having undue influence over the rest of the country.\n\nAnd that's ultimately where the blame should lie. It's the small-minded states' mentality that saw Mortal Kombat banned for years. It's the same mentality that has made games like DayZ and other titles for adults struggle because they couldn't fit within a set of guidelines written almost a decade ago, guidelines that can't be changed without the unanimous approval of several individuals who mostly don't understand why this matters to begin with.\n\nThose state ministers will, in all likelihood, think the current system is fine. But it's not. So when the public consultation kicks off, use that chance to communicate why. Gamers have no problem making their voice heard — now it's our job to make sure the right people are listening.", "description": "Games don't get banned all that often, and every time it happens there's a surge of interest in Australia's archaic classification system. That's generally followed by a torrent of abuse against the Classification Board, occasionally Australia itself, and more recently, a bit of public vitriol directly against the...", "authors": ["Luke Plunkett", "Stephen Totilo", "Alex Walker"], "top_image": "https://edge.alluremedia.com.au/m/k/2019/08/dayz-1.jpg", "published_at": "2019-10-10"}