{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7587351/Thousands-protesters-march-Catalonia-general-strike-set-bring-region-standstill.html", "downloaded_at": "2019-10-18 08:59:34.220121+00:00", "title": "Thousands of protesters march through Catalonia in general strike set to bring region to standstill", "language": "en", "text": "Hundreds of thousands of pro-independence supporters from across Spain's northeastern region of Catalonia are pouring into Barcelona on Friday, as unions called for a general strike.\n\nMany of those walking towards the Catalan capital were waving pro-independence flags on the fifth day of protests following the jailing of nine separatist leaders.\n\nThe strike comes after another night of violence which saw separatists burning barricades and clashing with riot police as 58 people were injured, including a 17-year-old who was hit by a police van.\n\nProtesters in Barcelona set fire to cars and large wheelie bins, overturned metal barriers and threw firecrackers at police, who pushed back with batons and shields.\n\nHundreds of young separatists chanting 'independence' set fire to improvised roadblocks in the centre of the city late in the evening, tossing Molotov cocktails at police, who responded by firing foam and anti-riot rounds.\n\nHundreds of thousands of pro-independence supporters from across Spain's northeastern region of Catalonia are pouring into Barcelona today for a general strike\n\nProtesters burn barricades on a night of violence in Catalonia which saw clashes between separatists and riot police\n\nProtesters in Barcelona set fire to cars and large wheelie bins, overturned metal barriers and threw firecrackers at police\n\nEmergency services said 58 people were injured, including a 17-year-old who was hit by a police van.\n\nAnother 38 people were injured in protests in other Catalan cities, including Lerida and Girona.\n\nPolice have arrested 97 people across Catalonia since the protests began, Interior Minister Fernando Grande-Marlaska said yesterday.\n\nThe fresh clashes came on the eve of a huge protest in the Catalan capital today with hundreds of thousands taking to the streets.\n\nSpain's central authorities said that 46 flights into and out of the region were cancelled today due to the strike called by pro-independence unions.\n\nCatalan demonstrators block Diagonal Avenue during Catalonia's general strike in Barcelona today\n\nRiot police responded with firing foam and anti-riot rounds, pushing back the protesters with batons and shields\n\nEmergency services said 58 people were injured, including a 17-year-old who was hit by a police van\n\nPolice have arrested 97 people across Catalonia since the protests began this week\n\nHundreds of young separatists chanting 'independence' set fire to improvised roadblocks in the centre of the city late in the evening, tossing Molotov cocktails at police\n\nProtesters burn a trash bin as they take to the streets to demonstrate after the Spanish Supreme Court sentenced nine Catalan separatist leaders\n\nPicketers have also blocked the border with France at the major crossing point of La Jonquera.\n\nSeparatists have called the general strike and rally today against the Supreme Court's decision to jail the separatist leaders for their role in a referendum banned by Madrid and a short-lived declaration of independence.\n\nEarlier on Thursday, around 25,000 striking students and their supporters took part in a midday rally outside Barcelona city hall, according to municipal police.\n\n'The actions we have been staging over the past few days testify to the helplessness we feel as the Spanish state continues to reject (independence) and threaten us, while Europe remains silent,' a 23-year-old accountant, who would only give his first name as David, told AFP.\n\nEduard Salinero, a 21-year-old physics student who is in favour of secession, said many people who want Catalonia to remain a part of Spain back the protests 'because they feel it is totally unfair to send our elected politicians to jail'.\n\nAnother 38 people were injured in protests last night in other Catalan cities, including Lerida and Girona\n\nThe fresh clashes came on the eve of a huge protest in the Catalan capital today with tens of thousands taking to the streets\n\nActivists blocked several roads across Catalonia by burning tyres while the commuter rail service in Barcelona was intermittently disrupted due to demonstrators on the tracks, officials said.\n\nSeveral roads and highways were also blocked off due to the mass marches which departed on Wednesday from five Catalan towns heading for Barcelona.\n\nXenia Cabeza, 18, said she was protesting 'because they don't let us vote in a referendum' on secession. She carried a sign that read 'You can't imprison an entire people'.\n\nAnnounced on Monday morning, the verdict has sparked three days of large demonstrations which have turned increasingly violent with separatist activists engaged in nighttime clashes with riot police in Barcelona and elsewhere.\n\nWhile Catalan president Quim Torra has sanctioned and even encouraged civil disobedience, his government is also responsible for the regional police who are charged with controlling demonstrations, putting him in an uncomfortable position.\n\nA car in Estelada (Catalan separatist flag) colours drives as Catalan demonstrators march during Catalonia's general strike in El Masnou, Spain\n\nSpain's central authorities said that 46 flights into and out of the region were cancelled today due to the strike\n\nTorra had not commented on the unrest for days, but overnight he called for an immediate halt to the violent clashes, saying there was 'no reason or justification for burning cars'.\n\nBut just hours later, he pledged in Catalonia's regional parliament to push for a new vote on secession by the end of his term in early 2022.\n\n'We must push forward and not allow ourselves to be intimidated by threats and bans,' he said.\n\nA poll published in July by a public Catalan institute showed support for an independent Catalonia at its lowest level in two years, with 48.3 per cent of people against and 44 per cent in favour.\n\nThe court's decision has thrust the Catalan dispute to the heart of the political debate ahead of Spain's November 10 general election, its fourth in as many years.\n\nAccording to the first poll since Monday's verdict, the ruling Socialists are likely to secure the most votes but again fall short of a majority.\n\nThe main opposition conservative Popular Party, which takes a hard line on Catalan separatists, looks set to make significant gains, it found.\n\nPublished in El Mundo daily, it predicted the Socialists will capture 122 seats in the 350-seat parliament, compared with the 123 it took in the last election in April, while the PP would win 98 seats, up from 66.", "description": "Hundreds of thousands of pro-independence supporters from Spain's northeastern region of Catalonia are pouring into Barcelona today after a night of violence which saw 58 injured.", "authors": ["Jack Newman For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/09/19875862-0-image-a-26_1571388016333.jpg", "published_at": "2019-10-18"}