{"pub": "indiatimes", "url": "https://indiatimes.com/technology/news/donald-trump-prefers-having-home-button-on-iphone-and-people-obviously-reacted-funnily-378643.html", "downloaded_at": "2019-10-26 07:25:45.377966+00:00", "title": "Donald Trump Prefers Having Home Button On iPhone, And People Obviously Reacted Funnily", "language": "en", "text": "With the iPhone X, Apple brought a new design language to Apple's devices by eliminating the home button and bringing Face ID. And the elimination of home button led Apple to create a completely new way to navigate through its phone and the menus.\n\nWhile many people had a tough time switching from a simple home button to gesture touch, they eventually got used to it. But it looks like President Trump is not happy with this.\n\nHis tweet clearly states that he found the home button better than the navigation gestures on the newer iPhones these days.\n\nWhile Trump's favourite 'Tim Apple' didn't really have anything to comment on this, we surely empathise with what Trump's experiencing.\n\nDon't Miss 2 K SHARES 202 SHARES 1.1 K SHARES 3.2 K SHARES\n\nIn case you didn't know, there are three swipe gestures to navigate through the phone -- A swipe from down to up on the centre of the screen would take it users straight to the home screen.\n\nReuters\n\nSwiping at the chin would let you switch between active apps. And swiping the edge will take you back in a particular menu.\n\nThe gestures might seem simple but it takes time to get it right. It isn't as snappy as a physical home button. Even Face ID, with upgrades, isn't as fast as trusty Touch ID.\n\nReuters\n\nLooking at Apple, even Google brought gesture-based navigation with Android Pie 9.0 last year. Even Android users weren't very happy with the navigation gestures as it made the user experience a whole lot slower. So Google worked on it and launched a better, easier set of gestures on the Android 10, which are very similar to iPhone's gestures, but not particularly a bad thing. Still, many Android users prefer using touch capacitive navigation buttons.\n\nTwitter had a gala time reacting to this\n\nSome were really hillarious.\n\nSome became a tad bit political.\n\nTo Trump, all we can say is hang in there, you'll get the gestures right with some practice. Eventually.\n\nHow do you navigate through your phone? Do you prefer gestures? Let us know in the comments below.", "description": "With the iPhone X, Apple brought a new design language to Apple's devices by eliminating the home button and bringing Face ID. And the elimination of home button led to Apple to create a completely new way to navigate through its phone and the menus.", "authors": ["Monit Khanna"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/trump_1572069699_800x420.jpg", "published_at": "2019-10-26"}