{"pub": "reuters", "url": "https://in.reuters.com/article/uk-lebanon-protests/hezbollah-to-speak-on-lebanon-crisis-sp-says-saver-confidence-tested-idINKBN1X410U", "downloaded_at": "2019-10-25 16:52:11.390389+00:00", "title": "Hezbollah to speak on Lebanon crisis, S&P says saver confidence tested", "language": "en", "text": "BEIRUT (Reuters) - Protests paralysed Lebanon for a ninth day on Friday and a global credit ratings agency said the government’s limited capacity to address demonstrator demands could further test depositor confidence and weigh on foreign exchange reserves.\n\nA Druze woman carries a Lebanese flag during an anti-government protest in the mainly Druze town of Hasbaya, Lebanon October 25, 2019. REUTERS/Aziz Taher\n\nDemonstrators waving Lebanese flags blocked roads, with some pitching tents on highways. The crowds were not big, but in earlier protests they have grown in size during the day.\n\nThe leader of the powerful Shi’ite group Hezbollah, an influential player in Prime Minister Saad al-Hariri’s coalition government, is due to address the crisis in a speech later on Friday.\n\nThe protests have cut roadways, closed schools and shut banks nationwide. Emergency reform measures and an offer of dialogue with protest representatives by the president have so far failed to defuse anger or move people from the street.\n\nThey have been overwhelmingly peaceful although late on Thursday scuffles broke out in central Beirut between demonstrators and Hezbollah supporters who entered the crowd, leading the police to intervene, witnesses said.\n\nThe protests have been fuelled by dire economic conditions and anger at the political elite accused of plundering state resources for personal gain, bringing turmoil to the streets of a nation already in deep economic crisis.\n\nAs politicians ponder ways out, the clock is ticking because of financial strains in Lebanon, one of the world’s most heavily indebted states.\n\nExacerbating the economic situation, capital inflows vital to financing the state deficit and imports have been slowing down, generating financial pressures not seen in decades, including the emergence of a black market for dollars.\n\nIn a report issued on Thursday, credit ratings agency Standard & Poor’s placed Lebanon’s ratings on “creditwatch negative”.\n\nIt said this “reflects our view that declining foreign currency inflows could exacerbate fiscal and monetary pressures while limiting the government’s response to pressing societal demands”.\n\nWhile the central bank’s usable foreign currency reserves were sufficient to service government debt in the near term, risks to government creditworthiness have risen, it said.\n\nThere was “at least a one-in-two chance” S&P could lower the government’s ratings following a review within the next three months into how the government responds to current pressures and its effectiveness in restoring depositor confidence.\n\nIt also said that despite reasonably high levels of gross foreign exchange reserves, including gold, of almost $50 billion the imposition of “soft capital controls raise questions about the monetary regime”.\n\n“We understand that banks have imposed restrictions on U.S. dollar withdrawals,” S&P said.\n\nDeposit outflows totalled $2.1 billion for the first eight months of the year. The central bank’s usable foreign exchange reserves are estimated to stand at $19 billion at the end of 2019, it said.\n\nLebanon’s central bank governor and finance minister could not immediately be reached for comment on the S&P report.\n\nBanks are set to remain closed until the situation stabilises out of safety concerns, the banking association said on Thursday. It has been a week since banks last opened.\n\nPresident Michel Aoun suggested on Thursday that a government re-shuffle was on the table. Prime Minister Saad al-Hariri said he “welcomed” the president’s call to “review the government.”\n\nHezbollah has said it is against a change of government.\n\nThere have been no signs of moves towards a reshuffle mooted by Aoun. Al-Akhbar newspaper said on Friday “all indications” were that the initiative would not “certainly lead” to a reshuffle.\n\nSlideshow (8 Images)\n\nThe government this week announced reforms that include a one-time tax on bank profits and cuts to salaries of top officials, saying the measures would narrow the 2020 budget deficit to 0.6%.\n\n“In our view, recent widespread protests suggest that the government’s dual aim of maintaining social stability and implementing reforms to reduce the general government deficit could be difficult to reconcile,” the S&P report said.", "description": "Protests paralysed Lebanon for a ninth day on Friday and a global credit ratings agency said the government's limited capacity to address demonstrator demands could further test depositor confidence and weigh on foreign exchange reserves.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191025&t=2&i=1444841151&w=1200&r=LYNXMPEF9O0U4", "published_at": "2019-10-25"}