{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/18/WS5da8faf9a310cf3e35571283.html", "downloaded_at": "2019-10-18 02:04:30.920769+00:00", "title": "Beijing slams US curbs on diplomats", "language": "en", "text": "By MO JINGXI | China Daily | Updated: 2019-10-18 07:36\n\nForeign Ministry spokesman Geng Shuang. [Photo/IC]\n\nChina urged the United States to correct its mistake and withdraw its decision to impose meeting restrictions on Chinese diplomats.\n\nChina is opposed to the US State Department's decision to impose \"extra requirements and set up artificial obstacles\" for Chinese diplomats conducting normal official activities in the US, Foreign Ministry spokesman Geng Shuang said at a regular news conference in Beijing on Thursday.\n\n\"The Chinese side has lodged solemn representations with the US side,\" Geng said.\n\nThe remarks came after US State Department officials said on Wednesday that Chinese diplomats in the US are now required to give advance notice of any meetings with state, local and municipal officials, as well as meetings at educational and research institutions.\n\nGeng said China always supports US diplomats in their carrying out of normal official activities in China and provides them with necessary convenience.\n\n\"The so-called restrictions on US diplomats in China as claimed by the US side is just baseless,\" he said, and urged the US to provide support and convenience for Chinese diplomats.\n\nThe Chinese embassy in Washington said on Twitter that the \"latest restrictions\" on Chinese diplomats were in violation of the Vienna Convention on Diplomatic Relations of 1961.\n\n\"So far, the Chinese side does not have similar requirements on US diplomats and consular officers in China,\" it said.", "description": "China urged the United States to correct its mistake and withdraw its decision to impose meeting restrictions on Chinese diplomats.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/18/5da915afa310cf3e97a1d1ef.jpeg", "published_at": "2019-10-18"}