{"pub": "bbc", "url": "https://bbc.com/news/health-49877843", "downloaded_at": "2019-10-01 04:30:11.396446+00:00", "title": "'Revolutionary' drug for prostate cancer", "language": "en", "text": "Image copyright Getty Images\n\nOlaparib could become a revolutionary treatment for prostate cancer - the first genetically targeted drug for fighting the disease, say experts.\n\nThe precision medicine is already used by the NHS for ovarian cancer and has been called a game-changer by cancer doctors.\n\nA cancer conference heard how, in trials, it slowed tumour growth in men with advanced prostate cancer.\n\nThis could improve survival for some men, researchers hope.\n\nExperts say it could be made available to patients in the next couple of years.\n\nThe drug, made by AstraZeneca, was fast-tracked to NHS ovarian cancer patients in England, paid for through the Cancer Drugs Fund, in July.\n\nPrecision medicine\n\nOlaparib, also called Lynparza, works by targeting and killing cancer cells with faulty genetic code, while sparing normal cells with healthy DNA.\n\nIt won't work for everyone with prostate cancer, but it is effective for some men with the disease, say researchers.\n\nPatients can be tested to see if they have the genetic errors that the drug can attack - faulty DNA repair genes including BRCA1 and BRCA2.\n\nThis precision approach means the patients most likely to benefit will be treated, sparing them potential side-effects from other drugs that may not work as well for them.\n\nIn the trial, doctors compared olaparib with two other commonly prescribed prostate drugs (hormone treatments called abiraterone and enzalutamide).\n\nIt appeared to delay cancer growth by months, which researchers say should hopefully mean men can survive for longer even when their disease is advanced. They will be monitoring patients to confirm this.\n\nAbout prostate cancer\n\nOne in eight men will be diagnosed with prostate cancer in their lifetime. It mainly affects men over the age of 50 and the risk increases with age.\n\nNot all of these tumours need immediate treatment. If the cancer is at an early stage and not causing symptoms, doctors may instead suggest careful monitoring.\n\nSome cases are more aggressive and need treatment but can be cured if caught early enough.\n\nOther cases may only be diagnosed at a late stage when the cancer has spread and cannot be cured.\n\nAll treatments, including olaparib, can have side-effects.\n\nDoctors can talk advise patients about what might be the best treatment for them.\n\nProf Johann de Bono, from the Institute of Cancer Research, London, who co-led the drug trial, said: \"It's essential that we become smarter in the way we treat prostate cancer, so that every man gets the treatment that will be of greatest benefit for them.\"\n\nDr Matthew Hobbs, from the charity Prostate Cancer UK, said: \"This hugely exciting result represents a revolution in the treatment of prostate cancer. It finally brings prostate cancer medicine into the 21st Century by giving us, for the first time ever, a therapy that makes use of genetic testing of the tumour to work out which men will benefit.\n\n\"This kind of precision medicine approach is already used to treat other cancers, and we hope olaparib will become the first of many treatments for prostate cancer which are based on this sort of detailed understanding of an individual man's tumour.\"\n\nProf Nicholas James from Cancer Research UK said: \"Tailoring cancer treatment according to a tumour's specific genetic faults is a core part of care in breast, lung or skin cancers to name a few, and has helped us give patients the treatments that are most likely to work for them. But with prostate cancer, we've been treating everyone the same way.\n\n\"Matching patients to the most appropriate treatment for their tumour type could radically change the way we treat prostate cancer. In this case, olaparib only slowed the disease down for a few months in a subset of men, but the approach itself is full of possibilities. And if we get to a point where we can tailor treatments in prostate cancer from an early stage, we can give every patient the best chance of being successfully treated.\"", "description": "Olaparib could be a 'transformative' treatment for thousands of men with advanced prostate cancer, say experts.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/10506/production/_109022866_gettyimages-471210626.jpg", "published_at": "2019-09-30"}