{"pub": "news24", "url": "https://sport24.co.za/Motorsport/australia-motogp-qualifying-cancelled-due-to-high-winds-20191026", "downloaded_at": "2019-10-26 06:49:33.222802+00:00", "title": "Australia MotoGP qualifying cancelled due to high winds", "language": "en", "text": "Phillip Island - Qualifying for the Australian MotoGP was cancelled on Saturday as strong winds caused havoc at the coastal circuit, with officials deciding it was too dangerous after Tech3 Racing's Miguel Oliveira was \"blown off\" the track.\n\nPhillip Island, known for its fast corners and long straights, is a favourite among riders, but it is also renowned for notoriously unpredictable weather.\n\nAfter wet and then dry sessions on Friday, the riders had to contend on Saturday with not only more rain but blustery and cold conditions, making it hard to push the pace.\n\nThe winds whipping the circuit were such that 10 in the 22-strong field didn't even set a lap-time in Saturday's third practice session.\n\nFourth practice was then red-flagged when pit board numbers blew onto the track, just minutes after Oliveira lost control and came off his bike in a big crash on the approach to turn one.\n\nMotoGP officials said he was \"blown off the track\", with the Portuguese rider stretchered away. A decision on whether he can continue will be made Sunday morning.\n\nThe rest of the session and subsequent qualifying was called off and later rescheduled for Sunday.\n\nThe new timetable will see Q1 and Q2, weather permitting, held in the morning with the race itself pushed back an hour.\n\nIf qualifying cannot be held, the grid order will be based on the current combined practice results.\n\nThat would put Yamaha's Maverick Vinales, who won in Australia last year and topped all three completed sessions, on pole ahead of Ducati's Andrea Dovizioso and Honda's Cal Crutchlow.\n\nWorld champion Marc Marquez is currently sixth, a place ahead of veteran Italian Valentino Rossi, who will be riding in his 400th Grand Prix on Sunday.", "description": "Qualifying for the Australian MotoGP was called off as strong winds caused havoc at the coastal circuit, with officials deciding it was too dangerous to continue.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9214/222a8b2c650c48d1847cefa97653589a.png", "published_at": "2019-10-26"}