{"pub": "washingtontimes", "title": "Trump administration optimistic for Taliban peace deal despite fighting, U.S. deaths in Afghanistan", "url": "https://washingtontimes.com/news/2019/sep/1/trump-administration-optimistic-for-taliban-peace-", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 07:13:06.541843+00:00", "text": "The Trump administration on Sunday said it’s nearing the finish line on a historic peace deal in Afghanistan even as its negotiating partner, the Taliban, launched a new round of deadly attacks that claimed dozens of lives over the weekend.\n\nThe Taliban assaults — Sunday saw an attack on the city of Puli Khumri, and a day earlier the group mounted a major offensive on the key city of Kunduz — highlight the tight rope the White House must walk in its quest to end America’s longest war. U.S. negotiators both condemned the Taliban’s newest attacks but still stressed that a lasting peace deal is on the horizon.\n\nZalmay Khalilzad, the U.S. special representative for Afghanistan reconciliation, said the looming agreement will ensure that the Taliban never again allows al Qaeda or another terrorist group to use Afghanistan as a base of operations.\n\nIn exchange, the U.S. is expected to significantly reduce its troop presence inside the country.\n\n“We are at the threshold of an agreement that will reduce violence and open the door for Afghans to sit together to negotiate an honorable and sustainable peace and a unified, sovereign Afghanistan that does not threaten the United States, its allies, or any other country,” Mr. Khalilzad tweeted.\n\nTaliban officials also publicly confirmed that the two sides are nearing a final deal.\n\n“We are on the verge of ending the invasion and reaching a peaceful solution for Afghanistan,” said Taliban spokesman Suhail Shaheen.\n\nAt the same time, Mr. Khalilzad warned the Taliban that “violence like this must stop,” though the Taliban likely views the attacks as a negotiating tool that gives them more leverage to extract concessions from the U.S.\n\nMr. Khalilzad was in Kabul on Sunday to brief Afghan government leaders on the progress in Taliban talks. The Washington-backed Afghan government so far has not been a part of negotiations between the U.S. and Taliban.\n\nWhile they haven’t had a seat at the table, the Afghan government and its forces continue to take serious casualties in violent clashes with the Taliban.\n\nIn a statement Sunday, the Afghan Ministry of Interior Affairs said that 20 Afghan security forces personnel were killed during operations in Kunduz, along with at least five civilians.\n\nFifty-six Taliban terrorists were killed during ground operations and airstrikes, the Afghan government said.\n\nOn Sunday, the Taliban launched a fresh offensive on Puli Khumri, capital of the Baghlan province. At least three Taliban fighters, four civilians and two members of the Afghan security forces were killed during gun battles on the outskirts of the city, Afghan officials said.\n\nLocal officials said they fear that the area could soon fall to Taliban control.\n\n“We hear the sound of blasts. The people are so worried,” Safdar Mohsini, the provincial council chief, told The Associated Press. “The Taliban are in residential areas fighting with Afghan security forces. We need reinforcements to arrive as soon as possible.”\n\nRecent fighting also has brought fresh U.S. casualties. Over the weekend, the Pentagon identified Army Sgt. 1st Class Dustin B. Ard of Utah as the latest American killed in that conflict. He died “as a result of wounds sustained while engaged in combat operations in Zabul Province” last week, the Defense Department said in a statement.\n\nTwo other Americans were killed in combat operations in Afghanistan on Aug. 21, the Pentagon said.\n\nThe U.S. currently has about 14,000 troops inside Afghanistan. A major reduction in that number has been a top Taliban demand throughout peace negotiations.\n\nLast week, President Trump said the number will be brought down even though no final deal has yet been reached.\n\n“We have very good negotiations going on with the Taliban, and the Taliban is saying they’re going to do things. We’ll see if that’s so,” the president said last Friday. “We haven’t made a deal yet. But we will be bringing it down to about 8,600 [troops].”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The Trump administration on Sunday said it's nearing the finish line on a historic peace deal in Afghanistan even as its negotiating partner, the Taliban, launched a new round of deadly attacks that claimed dozens of lives over the weekend.", "authors": ["The Washington Times Http", "Ben Wolfgang"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/08/31/Afghanistan_25498.jpg-79f1d_c0-45-1080-674_s1770x1032.jpg?302d698cc296eb8d6fb383a8ad7a5a47ed587c81"}