{"pub": "yahoo", "url": "https://news.yahoo.com/poland-nationalists-underwhelmed-historic-election-132521195.html", "downloaded_at": "2019-10-14 23:36:09.601941+00:00", "title": "Poland’s Nationalists Underwhelmed by Historic Election Win", "language": "en", "text": "(Bloomberg) -- For a party that just achieved their country’s best showing in a parliamentary election since the fall of communism, Poland’s ruling nationalists are unusually glum.\n\nAfter an exit poll announced the historic win late on Sunday, Law & Justice Chairman Jaroslaw Kaczynski sulked in front of party faithful at a standing-room only gathering in central Warsaw.\n\n“We must work harder” and “reach out with the truth to all social groups” because some voters were “were talked into rubbish” narratives, he said. “We attained a lot, but we deserve more.”\n\nInstead of touting the success on Monday, senior ruling party officials all but disappeared from television screens, as if they’d suffered a setback in their plan to cement their makeover of Poland into a country ruled by religious and nativist values.\n\nAnalysts tried to make sense of it: Is Kaczynski suggesting his government must quickly “re-Polonize” a still largely independent and partly foreign-owned media? Is the party’s projected majority in parliament somehow lacking?\n\n“Kaczynski really counted on a bigger majority, which would allow him to override presidential vetos,” said Olgierd Annusewicz, a political scientist at Warsaw University. The result makes next year’s presidential ballot more important, as a defeat there could throw a spanner in plans to complete the revolution, he said.\n\nNo K.O.\n\nOne obvious disappointment for Law & Justice was the Senate: it clinched just 49 of the 100 seats. But losing its majority there will only slow -- not stop -- legislation, as lower house can override amendments. And with more than 99% of the vote counted, the nationalists won 43.8%, giving them a single-party majority.\n\nA knockout victory at the ballot box would have boosted sentiment that four years of work transforming Poland into a rogue from one of the European Union’s most reliable partners, would soon be irreversible. It would have also bolstered Law & Justice’s arguments that voters don’t agree with the bloc’s criticism over democratic standards.\n\nInstead, broadsheet Rzeczpospolita called it “A victory on points,” while daily Dziennik Gazeta Prawna led with: “Direction: No Change.”\n\nNot exactly the revolution Kaczynski had in mind.\n\nTo contact the reporters on this story: Wojciech Moskwa in Warsaw at wmoskwa@bloomberg.net;Marek Strzelecki in Warsaw at mstrzelecki1@bloomberg.net\n\nTo contact the editors responsible for this story: Balazs Penz at bpenz@bloomberg.net, ;Andrea Dudik at adudik@bloomberg.net, Michael Winfrey\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- For a party that just achieved their country’s best showing in a parliamentary election since the fall of communism, Poland’s ruling nationalists are unusually glum.After an exit poll announced the historic win late on Sunday, Law & Justice Chairman Jaroslaw Kaczynski sulked in front of", "authors": ["Wojciech Moskwa", "Marek Strzelecki"], "top_image": "https://s.yimg.com/uu/api/res/1.2/oQKn2zu_QblQ9a1_3BrHZg--~B/aD0xMzkyO3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/2d306809731b7240227c51033597985d", "published_at": "2019-10-14"}