{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/set-life-results-live-winning-20744653", "downloaded_at": "2019-10-28 23:36:33.787552+00:00", "title": "Set For Life results live - winning National Lottery Lotto numbers for Monday", "language": "en", "text": "It's Monday and that means it's time for the National Lottery Set For Life draw, giving you the chance to win £10,000 monthly payouts for the next three decades.\n\nStick with us and we'll bring you the winning numbers from the draw as soon as it is made - when those balls fall, you'll be the first to know. Scroll down to get the results as they come in.\n\nThe new game from the National Lottery is proving a hit, and it's no wonder, with an incredible top prize of £10,000 landing in your bank account every month and this lasting for a whopping 30 years.\n\nLast Thursday a lucky punter scooped the top prize. The National Lottery player matched five lucky numbers and the Life Ball to become the ninth person to win the top prize on the new game.\n\nAndy Carter, Senior Winners’ Advisor at The National Lottery, said on Thursday: “Tonight’s win is fabulous news for Set For Life players as we have another winner tonight! This means we’re celebrating our ninth Set For Life top prize winner.\n\n“All players are urged to check their tickets so the lucky winner can start working through their bucket list dreams as soon as possible. And don’t forget, every time you play any National Lottery game, you help raise around £30M a week for Good Causes.”\n\nSomeone else bagged £10,000 every month for one year by matching just five numbers while 40 people won a single sum of £250 in the game by matching four balls and the 'Life Ball'..\n\nIn case you missed it, the winning numbers from last Thursday's draw - October 24 - were 4, 12, 17, 28, 36 and the life ball was 7.\n\nSet for Life is played on Mondays and Thursdays.\n\nThe National Lottery Set For Life draw will take place at 8pm tonight.\n\nGet those tickets to hand - and good luck.", "description": "The incredible jackpot tonight is £10,000 every month for 30 years - have you made sure to grab your ticket?", "authors": ["Joseph Wilkes"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article14155118.ece/ALTERNATES/s1200/10_Screen-Shot-2019-03-18-at-204216.jpg", "published_at": "2019-10-28"}