{"pub": "thehill", "url": "https://thehill.com/homenews/campaign/462224-warning-signs-flash-for-tillis-in-north-carolina", "downloaded_at": "2019-09-20 22:44:28.789700+00:00", "title": "Warning signs flash for Tillis in North Carolina", "language": "en", "text": "Sen. Thom Tillis Thomas (Thom) Roland TillisTillis trails Democratic Senate challenger by 2 points: poll Kavanaugh impeachment push hits Capitol buzz saw The 13 Republicans needed to pass gun-control legislation MORE (R-N.C.) has been endorsed by President Trump Donald John TrumpMarine unit in Florida reportedly pushing to hold annual ball at Trump property Giuliani clashes with CNN's Cuomo, calls him a 'sellout' and the 'enemy' Giuliani says 'of course' he asked Ukraine to look into Biden seconds after denying it MORE and has the full backing of Republicans’ Senate campaign arm.\n\nSo when he took the stage at one of Trump’s rallies in Fayetteville, N.C., last week, the boos from some in the audience weren’t necessarily how a first-term Republican senator facing a primary challenge would hope to be received.\n\nADVERTISEMENT\n\nThe episode is illustrative of what Democrats and some Republicans say is Tillis’s increasingly apparent vulnerability heading into his 2020 reelection bid.\n\nA Morning Consult survey released in July showed him with the lowest approval rating of any sitting senator — just 33 percent — and multiple polls have him trailing his potential Democratic challengers, including state Sen. Erica Smith and former state Sen. Cal Cunningham.\n\nAt the same time, Tillis is facing a primary challenge from retired Raleigh businessman Garland Tucker, and there are signs that he’s already beginning to take the contest seriously. He unveiled a $2.2 million television and radio ad buy on Monday touting his work with Trump. That ad campaign is slated to run through North Carolina’s March 3 primary.\n\nTillis’s critics say the ad campaign is a sign of growing concern about his standing among the state’s conservative primary voters. One North Carolina Republican official familiar with the Senate race said that many core GOP voters in the state are “disaffected” by Tillis.\n\n“The base is indifferent on him,” the official said. “They don’t love him, but they don’t hate him.”\n\nThe price tag for the ad buy is substantial, accounting for more than half of the $4.3 million in cash on hand Tillis reported at the end of June.\n\n\"You don’t spend half your cash on hand this early on a primary challenger that you’ve been trying to dismiss as not a threat up to this point,” one Democratic official familiar with Senate races said.\n\nTillis’s campaign said that it’s always been their plan to ramp up campaigning after two special House elections in North Carolina’s 3rd and 9th districts concluded. The ad buy, the campaign said, is intended to draw an early contrast between Tillis and his eventual Democratic opponent in the general election.\n\nThe senator’s allies are also quick to dismiss concerns about his record, pointing to his voting record in the Senate — he’s voted in line with Trump’s position 93.3 percent of the time, according to an analysis by the data website FiveThirtyEight — and his past work as a state representative.\n\n“I think [his primary opponents] are going to have to define the issues where Thom Tillis wasn’t far enough on the right because I haven’t found them,” Pat McCrory, a Republican who served as governor while Tillis was Speaker of the North Carolina state House, told The Hill.\n\n“When he was Speaker of the House and I was governor — well, I don’t know what specific issues you can go after him for.”\n\nSeveral Republican officials and operatives said that the criticism of Tillis from the right — and the boos at Trump’s rally last week — stem from his early opposition to Trump’s emergency declaration allowing construction to begin on a wall along the United States' southern border.\n\nTillis, who initially outlined that opposition in an op-ed in The Washington Post, eventually reversed course and voted against a Senate measure disapproving of the declaration. But his chief primary opponent, Tucker, has sought to capitalize on that about-face to cast Tillis as insufficiently conservative, only willing to embrace Trump when convenient.\n\nADVERTISEMENT\n\nTucker began airing television ads attacking Tillis almost immediately after announcing his candidacy in May, knocking the senator for opposing Trump’s plan to cut foreign aid spending and his initial resistance to the emergency declaration.\n\n\"[Republican primary voters] follow politics pretty closely and they’re familiar with Tillis’s record on spending, on immigration, on the flip-flop on the wall,” said Carter Wrenn, a longtime Republican consultant in North Carolina and an adviser to Tucker. “He’s got a problem in that he’s seen as not in step with Republican voters.”\n\nAndrew Romeo, a spokesperson for Tillis’s campaign, dismissed the Tucker campaign’s criticism of the senator, insisting that, as Tillis ramps up his campaign, Republican voters will coalesce behind him.\n\n\"Garland Tucker has spent over a $1 million with false attacks on Senator Tillis in order to cover up for his anti-Trump, pro-swamp record,” Romeo said. “As North Carolinians become aware of the real Garland Tucker, the commitment Senator Tillis has to advancing President Trump's agenda, and the support President Trump has shown for Senator Tillis, primary voters will overwhelmingly support our campaign.”\n\nTillis and his allies have acknowledged that the Senate race is likely to be close — and exceedingly expensive. His first Senate bid against then-Sen. Kay Hagan Kay Ruthven HaganTillis trails Democratic challenger by 7 points in North Carolina poll North Carolina businessman will challenge Tillis in GOP primary Embattled senators fill coffers ahead of 2020 MORE (D-N.C.) in 2014 surpassed $100 million, making it the most expensive Senate race in history at the time.\n\nADVERTISEMENT\n\nPaul Shumaker, an adviser to Tillis’s campaigner, said that he expected the 2020 cycle to “shatter all spending records for North Carolina, if not the nation.”\n\nTillis has raised just more than $3 million this year, according to his most recent federal filings from July. Tucker, meanwhile, has raised far less from outside contributors — just under $190,000 — but has padded his campaign’s finances with nearly $850,000 in loans and donations from his own fortune.\n\nOn the Democratic side, Cunningham has benefited from a strong fundraising start, bringing in more than $520,000 in the two-week period between his June 17 campaign announcement and the Federal Election Commission’s second-quarter fundraising deadline on June 30. He also loaned his campaign an additional $200,000.\n\nDemocrats view flipping Tillis’s seat as crucial to capturing a majority in the Senate. They need to pick up either three or four seats, depending on which party wins the White House in 2020, to gain control of the chamber. And after Colorado and Arizona, where Republican incumbents are facing the battles of their political lives, they see North Carolina as perhaps their best bet.\n\nOn Friday, the Cook Political Report, a nonpartisan election handicapper, moved Tillis's race from the \"likely\" Republican column into the \"lean\" Republican column, noting that he is torn between competing political realities: Many Republicans in the state believe he is not conservative enough, while Democrats see him as too conservative.\n\nRepublicans, meanwhile, are hoping that having Trump on the ticket next year will buoy Tillis and drive voter turnout among the conservative and rural voters that they see as critical to their coalition in the state.\n\n“Ultimately Republican voters come home,” one Republican operative familiar with Senate races told The Hill. “These people are going to turn out in very high intensity for the president and they’re going to vote for Thom Tillis.”\n\nDuring an appearance on a radio show hosted by McCrory on Tuesday, Tillis said that North Carolina is “ground zero” for the GOP’s efforts to hold on to its Senate majority and the White House.\n\n“North Carolina is at the center of the bullseye because the Democrats know that if they defeat me, if they defeat the president, then we’ll have a Democrat president, we’ll have a Democrat majority in the Senate and they will take this country in a direction the likes of which we’ve never seen,” Tillis said.\n\nWhile Tillis’s allies insist that they’re not nervous about his prospects, several political strategists and operatives noted North Carolina’s long history of booting its incumbent senators from office. In fact, Tillis won his first Senate bid in 2014 after narrowly defeating the incumbent Hagan. And Hagan took office after ousting her predecessor, Sen. Elizabeth Dole (R), in 2008.\n\nMcCrory said that it may be Trump’s presence on the ballot that makes all the difference for Tillis.\n\n“I think Trump’s coattails will have a big impact,” McCrory said. But, he added, “Our Senate seats have flipped an awful lot.”\n\nUpdated at 8:18 a.m.", "description": "Sen. Thom Tillis is showing increasing signs of vulnerability heading into his 2020 reelection bid in North Carolina.", "authors": [], "top_image": "https://thehill.com/sites/default/files/tillisthom_052119gn.jpg", "published_at": "2019-09-20"}