{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/stunning-james-bond-island-five-20561658", "downloaded_at": "2019-10-12 15:12:28.177388+00:00", "title": "Stunning James Bond island on sale for £69million", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA beautiful remote Caribbean island which has featured in the James Bond and Pirates of the Caribbean movies has gone on the market for a whopping £69 million.\n\nLittle Pipe Cay, in the Bahamas, is described as the 'crown jewel of the area' and is filled with stunning pristine golden beaches and stretches of palm trees.\n\nThe island, which has been carefully molded over the last 15 years by its current owners, has five fully furnished houses spread across 38 acres for principal and guest use, which boasts nine bedrooms and stunning sea views between them and several locations to moor a super yacht.\n\nThe island, which lies among the beautiful Exuma islands, comes complete with a sea barn, containing boats and water sports equipment, as well as several hundred feet of docking space for small and large boats.\n\n(Image: RightMove)\n\n(Image: RightMove)\n\nBig Major Cay is also only about two miles away from the island, and is home to the world-famous Pig Beach.\n\nNew residents would be moving into a famous neighbourhood – with Johnny Depp, Tyler Perry and Oprah Winfrey being but a few of the celebrities that have their own islands in the Exumas.\n\nThe island has also featured in James Bond films - with Casino Royale amongst the movies to have been shot in the Bahamas.\n\n(Image: Sony Pictures)\n\n(Image: Disney)\n\nLocated around 70 miles from Nassau, and 270 miles from Miami and Palm Beach, Little Pipe Cay is accessed by seaplane from the private Odyssey Terminal on New Providence.\n\nPrivate planes and charter flights can also land at the nearby Staniel Cay – separated from Little Pipe Cay by a short, but beautiful, boat ride through the serene waters that surround the islands.\n\n(Image: RightMove)\n\n(Image: RightMove)\n\n(Image: RightMove)\n\nIf it’s more peace and quiet you’re after, the remote island also has its very own spa and swimming pool.\n\nRightmove’s property expert, Miles Shipside, said: \"It really does look like someone’s very own slice of paradise with its crystal-clear waters and breath-taking panoramic vistas.\n\n\"Little Pipe Cay really is the epitome of luxury.\"", "description": "Little Pipe Cay, in the Bahamas, is filled with pristine golden beaches and stretches of palm trees and includes five nine-bedroom homes with picturesque coastal views", "authors": ["Thomas Amor", "Brendan Mcfadden", "Image", "Rightmove", "Sony Pictures", "Disney"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20561580.ece/ALTERNATES/s1200/0_9-bedroom-detached-house-for-sale-in-The-Bahamas.jpg", "published_at": "2019-10-12"}