{"pub": "nymag", "url": "https://thecut.com/2019/09/plain-english-rita-konig-paint-collection-kitchen.html", "downloaded_at": "2019-09-13 00:57:25.495241+00:00", "published_at": "2019-09-12", "title": "A Dream Duo Takes On the Best Room in the House", "language": "en", "text": "Design Hunting Design editor Wendy Goodman takes you inside the city's most exciting homes and design studios. Interior designer Rita Konig (left) and Plain English co-founder Katie Fontana. Photo: Courtesy of Plain English\n\nPlain English opened its New York showroom in 2018; the place, which features its bespoke cupboards and handsome millwork, somehow manages to evoke a dreamy world where families cook together before sitting down for a delicious home-cooked meal. Recently, when the company designers began considering whom it should enlist to help conceive new shades for its third paint collection, they immediately thought of interior designer (and a former editor at both Domino and T Magazine) Rita Konig. Konig, after all, not only has her own successful design business but also grew up in impeccable British homes designed by her mother, the iconic decorator Nina Campbell. Plain English’s in-house color consultant Kate Shaw with Konig in the company’s Georgian farmhouse kitchen, recently repainted in a feast of new colors.\n\nPhoto: Courtesy of Plain English “I adore using color,” Konig says. “That was one of the things that first attracted me to Plain English — they use color in a very bold way, which I admire.” The cupboard shown here is painted in “Candied Peel.” “The orange-juice–y shade matches beautifully with blue,” Konig says.\n\nThe interior is painted in “Bib + Braces,” a working neutral named after the British term for overalls. “Kate and I each brought bits and pieces of things that we felt spoke to British daily life,” Konig says. Photo: Courtesy of Plain English\n\nThe company’s Georgian farmhouse kitchen in Suffolk, seen here, has a slate-topped work table, hand-painted in “Burnt Toast,” as its centerpiece. It also has large drawers and oversize antique brass drop handles. The Spitalfields cupboards are painted in “Nicotine,” and the interiors are painted in “Silver Polish.” The walls are done in “Flummery,” a shade that Konig describes as a “pale-lemon posset.” Photo: Courtesy of Plain English\n\nThe Mendlesham Ball & Bar chair is painted in glossy “Mouldy Plum,” which Konig says is “the perfect supporting-role color.” Photo: Courtesy of Plain English\n\n“The premise of this collection,” Konig says, “is that you need three or four colors in a kitchen: for the island, the upper cabinets and lower cabinets, and for the stools, if you choose to have stools.” The stools featured here are painted in “Rubbing Brick.” “During the creative process, we were always considering how various shades worked together,” Konig adds. “Kate and I ultimately devised a palette that takes inspiration from historical interiors, natural fabrics, and British comestibles. It was funny: When we first met, we both brought packets of our inspirations — and quickly realized that they were virtually the same.” Photo: Courtesy of Plain English", "description": "The British bespoke-kitchen-design company Plain English teamed up with interior designer Rita Konig to launch a paint collection (the company’s third) meant specifically for the kitchen. Each one of the 12 new colors is more delicious than the last.", "authors": ["Wendy Goodman"], "top_image": "https://pixel.nymag.com/imgs/fashion/daily/2019/09/10/space-of-the-week/1.w1200.h630.jpg"}