{"pub": "yahoo", "url": "https://sg.news.yahoo.com/pleasure-seriously-malaysias-newly-launched-092900607.html", "downloaded_at": "2019-10-24 09:55:34.843477+00:00", "title": "Take pleasure seriously at Malaysia's newly launched Magnum Mansion", "language": "en", "text": "24 Oct – \"Luxurious. Interesting. Pleasure.\" These are the three words each picked by local M-bassadors Amelia Henderson, Azira Shafinaz and Kittie Yiyi to describe the new ice cream unveiled at Magnum Mansion yesterday.\n\nMagnum Mansion made its debut in Malaysia at Sunway Pyramid Shopping Mall yesterday evening, and will be available from 10am to 10pm daily at the mall's Blue Concourse up until Monday, 28 October 2019.\n\nThere are three chambers that make up the Magnum Mansion, curated by the aforementioned M-bassadors. We were among the lucky ones who got to check it out ahead of anyone else in Malaysia. We headed to the first chamber, curated by model-actress Amelia Henderson, where a 270-degree panoramic projection was set up to take visitors on a journey through every layer of the new Magnum Macadamia Salted Caramel.\n\nThese luxuriously-decorated Magnum Macadamia Salted Caramel ice creams do look interesting, like every bite promises full pleasure. More\n\n\"The first thing that you bite into is obviously the Belgian chocolate, where else would I take you to if not Belgium,\" Amelia explained.\n\n\"And then you get the really rich cocoa in there, which reminded me of a rain forest which is so fitting because Magnum uses specifically sustainably-grown cacao. Following that, you taste the Australian Macadamia, which is so rich and delicious. And finally you get to the centre, the salted caramel. So that made me think of the sunset on a beach. So that was the journey that we try to take you guys on inside the room.\"\n\nAmelia Henderson wants everyone to really experience the new ice cream. More\n\nWhen we ask her for one word that best describes the ice cream, the cosmopolitan explorer was quick to answer: \"Luxurious!\"\n\n\"Because it's a luxurious flavour,\" she said, adding that since she often found it difficult to take a break, even just sitting down and having an ice cream at the end of the day is a good way for her to unwind.\n\nAzira Shafinaz enjoying the playlist in her music chamber. More\n\nNext, we entered the Azira Shafinaz-curated chamber. Since she's part of the Malaysian girl group De Fam, it is only fitting that her chamber is music themed. Flooded in a funky, uplifting purple light, the chamber houses several headphones that visitors can put on (they're clean, disinfected by the staff there after every use) to enjoy the playlist that the singer has put together.\n\n\"This is my music chamber, where I personally – inspired by my group actually – well, I love every moment working with them. With groups, I understand that we're gonna have ups and downs but alhamdulillah, it only made us stronger and got us where we are today. That's how I got inspired actually, like usually we're gonna have a different feeling, maybe sad or happy. So there are four different moods [for the playlist]: love, sadness happy and celebration.\"\n\nBefore we put on the headphone to enjoy the four tracks, we again asked Azira for one word to describe the new ice cream and she picked \"interesting\".\n\n\"I don't normally eat salted caramel, just chocolate or vanilla for cupcakes, but then in terms of ice cream, when they asked to try it for the first time, I was quite surprised that it didn't taste that sweet. The salty taste helps balance it too.\"\n\nA look inside Kittie Yiyi's photo chamber. More\n\nStory continues", "description": "De Fam's Azira Shafinaz, Amelia Henderson and Kittie Yiyi are its M-bassadors", "authors": ["Florey Dm"], "top_image": "https://s.yimg.com/uu/api/res/1.2/agKuqtEitDp5T58kCrqWAw--~B/aD03Njg7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/cinema.com.my/a252c8b4087b72a6d1601c6501734249", "published_at": "2019-10-24"}