{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/boris-johnsons-britain-deserves-better-20756575", "downloaded_at": "2019-10-30 12:32:22.300932+00:00", "title": "Boris Johnson's 'Britain Deserves Better' campaign slogan is already backfiring", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nBoris Johnson last night unveiled a new campaign slogan after he finally got his wish and MPs agreed to an election.\n\nBut it could probably use a little more work.\n\nMr Johnson is, after all, an incumbent Prime Minister. And he's leader of the Conservative Party, who have been in power for nine years, since unexpectedly winning the 2010 election.\n\nSo eyebrows were raised when he signed off his first Twitter post after securing the Christmas poll with the hashtag: \"#BritainDeservesBetter\".\n\nWhile that is almost certainly true, it's an unusual admission for a national leader to make when asking people to vote for him.\n\nOf course, the internet did its thing, seizing on the Prime Minister's questionable turn of phrase.\n\nPolitical parties are gearing up for the first December general election in almost a century, after MPs backed Boris Johnson's fourth attempt to go to the polls.\n\nThe Prime Minister has said he is prepared for a \"tough\" battle, while shadow chancellor John McDonnell said he thought Labour would win a majority.\n\nLiberal Democrat leader Jo Swinson insisted the campaign was not a two-horse race between Mr Johnson and Jeremy Corbyn , and that she was standing as a candidate to be prime minister.\n\nThe Government's one-page Bill enabling the election to be held on December 12 will be considered by the House of Lords on Wednesday, but it is unlikely to be held up in the unelected upper chamber.\n\nOnce it receives the royal assent, it will pave the way for Parliament to be dissolved on November 6.", "description": "It seems like an odd thing for the person running the country to say", "authors": ["Mikey Smith", "Image", "Afp Via Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20756564.ece/ALTERNATES/s1200/0_BRITAIN-EU-POLITICS-BREXIT.jpg", "published_at": "2019-10-30"}