{"pub": "cnn", "url": "https://edition.cnn.com/2019/09/04/health/vegetarian-vegan-diet-stroke-heart-disease-risk-intl/index.html", "downloaded_at": "2019-09-22 06:16:29.252382+00:00", "title": "Vegetarians might have higher risk of stroke than meat eaters, study says", "language": "en", "text": "(CNN) Non-meat diets have soared in popularity with many people ditching beef, pork and chicken in pursuit of health and environmental benefits and concerns about animal welfare.\n\nHowever, a new study suggests that vegetarians and vegans may be at a higher risk of stroke than their meat-eating counterparts -- although those who don't eat meat have a lower chance of coronary heart disease, according to the new paper, published in the medical journal the BMJ on Wednesday.\n\n\"It does seem that the lower risk of coronary heart diseases does exceed the higher risk of stroke, if we look at the absolute numbers,\" said lead researcher Tammy Tong, a nutritional epidemiologist at the Nuffield Department of Population Health at the University of Oxford.\n\nThis is the first study to look at the risk of stroke in vegetarians, said Tong. The research found that vegetarians and vegans had a 20% higher risk of stroke than meat-eaters, particularly hemorrhagic stroke -- caused when blood from an artery begins to bleed into the brain. This translates to 3 more cases of stroke per 1,000 people over 10 years.\n\nThe exact reasons for this higher risk found in vegetarians are not clear, said Tong. It is possible that this is due to \"very low cholesterol levels or very low levels of some nutrients,\" she said.\n\n\"There is some evidence which suggests that very low cholesterol levels might be associated with a slightly higher risk of hemorrhagic stroke,\" she said. Similarly, other research points to deficiencies of some nutrients, like vitamin B12, may be linked to a higher risk of stroke, said Tong.\n\nStill, some researchers were skeptical of the stroke finding.\n\nThe research shows that people who cut out meat from their diet are significantly healthier than meat eaters, Dr. Malcolm Finlay, consultant cardiologist at Barts Heart Centre, Queen Mary University of London, told the Science Media Center.\n\nBut he said the study put \"too much weight on a complex statistical method to try and correct for the fact that the vegetarians were very much healthier than meat eaters.\"\n\n\"While this method can say the risk of stroke isn't as low as one might expect it to be in vegetarians considering how much healthier they are in general compared to meat-eaters, their overall risk of a major life-changing cardiovascular event happening still appears much lower,\" said Finlay, who was not involved in the study.\n\nNo significantly higher rate of stroke for pescetarians\n\nTong's research team followed more than 48,000 people in UK with an average age of 45, who were grouped into meat eaters (24,428), pescetarians (7,506), and vegetarians, including vegans (16,254). Participants were tracked on average for 18 years and during the study period there were were 2,820 cases of coronary heart disease and 1,072 cases of stroke.\n\nThe study calculations took into account influential factors, such as smoking or physical activity.\n\nPeople following a pescetarian diet did not have a significantly higher rate of stroke, the study found.\n\nThis could be because fish-eaters' cholesterol levels are not as low as the vegetarians', explained Tong. They are also unlikely to be vitamin B12 deficient, \"because you can get some B12 from fish and other animal products that they do eat,\" she said.\n\nWhereas \"vegetarians and vegans have very low consumption of animal products, the only way they can get B12 is from either supplements or fortified foods,\" she added.\n\nVegetarians have lower risk of heart disease\n\nVegetarians (including vegans) were found to have a 22% lower risk of coronary heart disease than meat eaters by the research team. This equates to 10 fewer cases of coronary heart disease among vegetarians than in meat-eaters per 1,000 people over 10 years.\n\nPescetarians had a 13% lower risk of coronary heart disease than meat-eaters, shows the study.\n\nThe researchers suggest that this finding could be due to vegans, vegetarians and pescatarians having a lower BMI and lower rates of high blood pressure, high blood cholesterol and diabetes.\n\nHeart disease is more common than hemorrhagic stroke, meaning vegetarians had better overall cardiovascular health outcomes despite a higher stroke risk, Stephen Burgess, group leader at the MRC Biostatistics Unit at the University of Cambridge, told the Science Media Center.\n\n\"While the differences observed were small in magnitude, this study suggests that taking up a vegetarian diet may not be universally beneficial for all health outcomes,\" said Burgess, who was not involved in the study.\n\n\"When considering cardiovascular health, switching to a vegetarian diet should not be seen as an end in itself, but should be considered alongside additional dietary and lifestyle changes.\"\n\nMore research needed\n\nthe results may not apply to all vegetarians globally. In an editorial that also published in BMJ, professors Mark Lawrence and Sarah McNaughton from Deakin University in Australia wrote thatthe results may not apply to all vegetarians globally.\n\n\"Participants were all from the United Kingdom where dietary patterns and other lifestyle behaviors are likely to differ from those prevalent in low and middle income countries, where most of the world's vegetarians live,\" wrote Lawrence and McNaughton, who were not involved in the study.\n\nGet CNN Health's weekly newsletter Sign up here to get The Results Are In with Dr. Sanjay Gupta every Tuesday from the CNN Health team.\n\nTracy Parker, senior dietitian at the British Heart Foundation, said the study provided further evidence that plant-based foods can lower risk the of heart disease.\n\n\"However, it also found that vegetarians, including vegans, are at a higher risk of stroke than meat eaters - potentially due to lack of certain nutrients,\" she said in an email. She also was not involved in the research.\n\n\"Whilst this is an interesting finding, this study is observational and doesn't provide us with enough evidence, so more research in this area would be needed.\"\n\nThe study authors also noted that further research was needed and said that the findings were based on a largely white European population.\n\n\"Additional studies in other large scale cohorts with a high proportion of non-meat eaters are needed to confirm the generalizability of these results and assess their relevance for clinical practice and public health,\" Tong said.", "description": "A new study suggests that vegetarians and vegans may be at a higher risk of stroke than their meat-eating counterparts -- although those who don't eat meat have a lower chance of coronary heart disease, according to a new paper published in the medical journal the BMJ on Wednesday.", "authors": ["Nina Avramova"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190904122627-01-vegetarian-diet-stock-super-tease.jpg", "published_at": "2019-09-04"}