{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/16/1930892/0/en/Purpose-Investments-Inc-to-Advise-Purpose-Managed-Duration-Investment-Grade-Bond-Fund-Fund-to-be-Renamed-Purpose-Global-Bond-Class.html", "downloaded_at": "2019-10-16 23:13:11.042511+00:00", "title": "Purpose Investments Inc. to Advise Purpose Managed Duration Investment Grade Bond Fund, Fund to be Renamed Purpose Global Bond Class", "language": "en", "text": "TORONTO, Oct. 16, 2019 (GLOBE NEWSWIRE) -- Purpose Investments Inc. (“Purpose Investments” or “Purpose”) today announced that it will assume the role of investment advisor for Purpose Managed Duration Investment Grade Bond Fund (the “Fund”). The Fund will also be renamed Purpose Global Bond Class to more accurately reflect its mandate and structure. These changes will take effect on or about November 1, 2019.\n\n\n\nThe Fund will maintain its strategic focus on investment grade bonds but expand the scope of its fixed income investments. Going forward, the Fund intends to invest primarily in Purpose Global Bond Fund (“BND”), a fund sub-advised by Neuberger Berman Investment Advisers LLC. BND’s investment objective is to provide stable returns from global fixed income markets.\n\nThe Fund will also maintain its tax-efficient corporate class structure to help investors minimize the impact of taxes on their returns.\n\nThe Fund’s new name, Purpose Global Bond Class, reflects the expanded strategy and the retention of its corporate class structure.\n\nAbout Purpose Investments\n\nPurpose Investments is an asset management company with more than $7.5-billion in assets under management. Purpose Investments has an unrelenting focus on client-centric innovation, and offers a range of managed and quantitative investment products. Purpose Investments is led by well-known entrepreneur Som Seif and is a division of Purpose Financial, an independent technology-driven financial services company.\n\nFor further information please contact:\n\nMatt Padanyi\n\nPurpose Investments Inc.\n\nTel: (877) 789-1517\n\nEmail: info@purposeinvest.com\n\nCommissions, trailing commissions, management fees and expenses all may be associated with investment funds. Please read the prospectus before investing. Mutual funds are not guaranteed, their values change frequently and past performance may not be repeated.\n\nThis press release is for information purposes only and does not constitute an offer to sell or a solicitation to buy the securities referred to herein. This press release is not for dissemination in the United States or for distribution to US news wire services.", "description": "", "authors": ["Purpose Investments Inc."], "top_image": "http://www.globenewswire.com/Attachment/LogoDisplay/468995?filename=468995.jpg&size=1", "published_at": "2019-10-16"}