{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-facebook-disinformation/viral-visuals-driving-social-media-manipulation-on-youtube-instagram-researchers-idUKKBN1WB0EJ", "downloaded_at": "2019-09-26 07:55:51.110258+00:00", "title": "Viral visuals driving social media manipulation on YouTube, Instagram: researchers", "language": "en", "text": "LONDON (Reuters) - The success of viral memes, videos and pictures in spreading online disinformation is fueling organized social media manipulation on Instagram and YouTube, researchers at Oxford University said on Thursday.\n\nFILE PHOTO: Silhouettes of mobile device users are seen next to a screen projection of Youtube logo in this picture illustration taken March 28, 2018. REUTERS/Dado Ruvic/Illustration/File Photo\n\nIn an annual report on disinformation trends, the Oxford Internet Institute’s Computational Propaganda Research Project said Facebook remained the most popular platform for social media manipulation due to its size and global reach.\n\nBut a focus on visual content more likely to be shared online means users of Google’s YouTube video platform and Facebook’s Instagram photo-sharing site are increasingly being targeted with false or misleading messages, said Samantha Bradshaw, one of the report’s authors.\n\n“On Instagram and YouTube it’s about the evolving nature of fake news - now there are fewer text-based websites sharing articles and it’s more about video with quick, consumable content,” she said. “Memes and videos are so easy to consume in an attention-short environment.”\n\nThe report’s findings highlight the challenges faced by Facebook, Google and other social media companies in combating the spread of political and financially-motivated disinformation, as tactics and technologies develop and change.\n\nA Facebook spokesman said showing users accurate information was a “major priority” for the company.\n\n“We’ve developed smarter tools, greater transparency, and stronger partnerships to better identify emerging threats, stop bad actors, and reduce the spread of misinformation on Facebook, Instagram and WhatsApp,” the spokesman said.\n\nYouTube said it had invested in policies, resources and products to tackle misinformation on its site and regularly removes content which violates its terms of use. A spokesman declined to comment on Oxford University’s findings.\n\nBradshaw said the move to target internet users with visual content would make it harder for social media platforms to identify and stamp out manipulated activity.\n\nFacebook and YouTube both came under intense scrutiny over their ability to monitor and police visual content following a mass-shooting in New Zealand in March.\n\nIn that incident, a gunman was able to live-stream the killing of 51 people on Facebook before internet users repeatedly shared and uploaded the video across multiple social media platforms.\n\n“It’s easier to automatically analyze words than it is an image,” Bradshaw said. “And images are often more powerful than words with more potential to go viral.”\n\nThe Oxford University report said that increased awareness of social media manipulation meant such activity had now been identified in 70 countries worldwide, up from 28 in 2017.\n\n“Computational propaganda has become a normal part of the digital public sphere,” the report said. “These techniques will also continue to evolve as new technologies ... are poised to fundamentally reshape society and politics.”", "description": "The success of viral memes, videos and pictures in spreading online disinformation is fueling organized social media manipulation on Instagram and YouTube, researchers at Oxford University said on Thursday.", "authors": ["Jack Stubbs", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190926&t=2&i=1434022785&w=1200&r=LYNXMPEF8P09Q", "published_at": "2019-09-26"}