{"pub": "abcnews", "title": "Sharks, tornadoes and taxes: Cape Cod's had a tough summer", "url": "https://abcnews.go.com/Lifestyle/wireStory/sharks-tornadoes-taxes-cape-cods-tough-summer-65325178", "language": "en", "published_at": "2019-09-01", "downloaded_at": "2019-09-02 06:59:41.685176+00:00", "text": "Between great white sharks, freak tornadoes and new taxes on vacation rentals, Cape Cod businesses have had a challenging summer.\n\nInterested in Shark Attacks? Add Shark Attacks as an interest to stay up to date on the latest Shark Attacks news, video, and analysis from ABC News. Add Interest\n\nLodging and beach visit numbers are down on the famous vacation destination, one year after the region dealt with two shark attacks, including the state's first fatal attack in more than 80 years. Beaches have been closed to swimming for shark sightings so frequently that some news outlets have taken to keeping a running tally (At least 90 times, by one count).\n\nOfficials, who took modest steps to prepare for increased shark activity ahead of this season, are sighing in relief that there hasn't yet been a repeat of last year's attacks. But this summer also threw a curveball in the form of three rare tornadoes that touched down July 23.\n\nWhile relatively weak and short-lived, the EF1 twisters ripped the roof off a hotel and knocked out power to tens of thousands of customers for almost three days. State officials estimate they caused $3.7 million in damage.\n\n\"It's been a roller coaster,\" said Wendy Northcross, CEO of the Cape Cod Chamber of Commerce. \"It rained every weekend in June. Then we had tornadoes in July. But August has been much better. We're looking forward to September. It's almost like a second summer.\"\n\nNorthcross said she expects August numbers to show more of a return to form for the region, which pumps more than $1 billion of tourism dollars into the state economy. But figures from the early summer months haven't been encouraging.\n\nAttendance at the federally managed Cape Cod National Seashore beaches this June were down 10% compared with last June, according to chamber statistics.\n\nHotel occupancy rates were down more than 3% in June and July, compared with the same months last year. And vacation property rentals, which vastly outnumber traditional hotel and motel beds on the Cape, are also down about 2% from prior years, said Carla Hemmings, a rental manager at Cape Cod Oceanview Realty.\n\nShe and other property managers concede shark concerns have turned away some, but they argue the hotel and lodging taxes to which the rentals were subjected for the first time starting July 1 have taken a bigger bite.\n\nNorthcross points out that traffic across the bridges leading to the Cape averaged about 3,500 more vehicles a day in July than they did last July, suggesting more day-trippers were venturing out rather than longer-term vacationers. And while she didn't yet have firm figures, she said, restaurants and retail shops reported brisk business in August.\n\nColette Cummings, owner of Ducks in the Window, says tourist activity along Chatham's charming Main Street has been noticeably lighter this summer, but that didn't seem to hurt her quirky duck-themed shop.\n\n\"There definitely weren't multiple days of craziness and energy like years before,\" she said. \"At the same time, we had very, very few moments where did not have customers in the store. So I can't say it was a bad summer. Given the shark issue, taxes and tornadoes, it could have been a lot worse.\"\n\nGail Knell, co-owner of The Ebb Tide, a restaurant in Dennis Port, is among the many business owners looking forward to fall to recoup losses.\n\nShe said the restaurant, which marked its 60th anniversary this year, had to discard all its food and remove eight fallen trees from the property after the tornadoes knocked out power for two days, costing the business more than $30,000.\n\n\"It was like starting the season from scratch,\" Knell said. \"We'd been going pretty strong. Then that happened.\"\n\nLocal government officials, meanwhile, are urging beachgoers to remain vigilant. After all, last year's fatal attack happened in mid-September, weeks after the traditional Labor Day end of the summer season.\n\nRonald Beaty, a commissioner with Barnstable County, the Cape's regional government, said officials also need to enact shark safety measures that reassure vacationers, or risk turning them away forever. A long-awaited study of possible solutions by a consultant hired by Cape Cod communities is slated to be released sometime in September.\n\n\"The bottom line is that as of this time there is still nothing in place that will actually prevent or mitigate a shark attack on a human at our Cape Cod beaches,\" he said. \"Essentially nothing has changed since last year, at least not yet.\"\n\n———\n\nFollow Philip Marcelo at twitter.com/philmarcelo.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Lifestyle/WireAP_409195c806df4e1884ce406e936ed488_16x9_992.jpg"}