{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7602701/Adam-Driver-star-Matt-Damon-Ben-Affleck-Ridley-Scotts-medieval-drama-Duel.html", "downloaded_at": "2019-10-23 09:13:45.440451+00:00", "title": "Adam Driver to star with Matt Damon and Ben Affleck in Ridley Scott's medieval drama The Last Duel", "language": "en", "text": "He's become one of the most sought after actors in Hollywood.\n\nAnd on Tuesday, Variety reported that Adam Driver is being tipped to join Matt Damon and Ben Affleck in the Ridley Scott period drama The Last Duel.\n\nDriver, 35, is thought to be in negotiations to take on one of the two leading roles, with Damon, 49, as the other lead.\n\nIn demand: Adam Driver is reported to be 'in talks' to star in Ridley Scott's The Last Duel, a drama set in 14th Century France and based on a true story\n\nAffleck, 47, is set to have a supporting role in the film which he and Damon are co-producing through their Pearl Street Films in partnership with Ridley's Scott Free productions.\n\nIt's the first time that Affleck and Damon will be seen on screen together since their breakout film Good Will Hunting in 1997, which won them Oscars for best original screenplay.\n\nAlso already confirmed to join the cast is British actress and Killing Eve star Jodie Comer, 26.\n\nBack together: Driver is set to join Mat Damon and Ben Affleck in the movie which reunites the two friends and stars for the first time since 1997's Good Will Hunting. They're pictured in 2016\n\nFemale lead: Killing Eve star Jodie Comer, 26, has also joined the cast of the film about two medieval knights who took part in the last legally sanctioned duel in France\n\nSet in the late 14th century and based on a true story, The Last Duel revolves around two knights who took part in the last legally sanctioned duel in France.\n\nIt's based on the non-fiction book The Last Duel: A True Story of Crime, Scandal and Trial by Combat in Medieval France by Eric Jager, according to THR.com.\n\nWhen one knight returns from war, he discovers that his friend and fellow knight raped his wife while he was gone.\n\nHe then asks the King of France for permission to engage in a duel to the death with his wife's assailant.\n\nIt's the latest high-profile role for driver who is currently getting rave reviews for his performances in two current movies - Marriage Story with Scarlett Johansson and The Report with Annette Bening.\n\nHe also reprises his role as Kylo Ren in J.J. Abrams' Star Wars: The Rise of Skywalker, for which the first trailer dropped on Monday.", "description": "Set in the late 14th century and based on a true story, The Last Duel revolves around two knights who took part in the last legally sanctioned duel in France.", "authors": ["Rachel Mcgrath For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/00/20061386-0-image-a-12_1571787819447.jpg", "published_at": "2019-10-22"}