{"pub": "investing.com", "url": "https://uk.investing.com/news/stock-market-news/hms-outlet-brand-afound-tweaks-strategy-towards-online-1976540", "downloaded_at": "2019-10-08 16:21:35.442846+00:00", "title": "H&M's outlet brand Afound tweaks strategy towards online", "language": "en", "text": "© Reuters. FILE PHOTO: An H&M sign is seen at the entrance to an H&M store in Palma on the island of Mallorca\n\nSTOCKHOLM (Reuters) - Fashion retailer H&M's (ST: ) newest independent business, outlet brand Afound, will focus more on online expansion and less on physical store expansion than previously planned, it said on Tuesday.\n\nH&M in recent years has launched several separate brands such as Arket and H&M Home to broaden its customer base as its core H&M brand has struggled to adapt to the online shift.\n\nAfound, launched in 2018, sells marked-down clothes from many external brands as well as from its own brands, in stores and online in home market Sweden.\n\n\"I joined the company in May and chose to review the strategy going forward,\" Afound CEO Joanna Hummel told Reuters. \"Now we have clarified that as we move forward, our focus is the marketplace which means that we will have a digital focus.\"\n\n\"This is a conclusion we've drawn after our first year. There's a general market trend, we draw conclusions from how we see that Afound's customers like to shop,\" Hummel said.\n\nProfit at H&M, the world's No. 2 fashion group after Zara owner Inditex (MC: ), has slid for years due to slowing sales at its core brand's physical stores.\n\nIt has said that its newer brands' stores have performed better. The company does not report individual results for the newer brands.\n\nAfound - H&M's first operation to market external brands as something more than a mere add-on to its own ranges - said in June it would enter the Netherlands this year, with an online store as a first step, as part of a long-term strategy to expand in Europe.\n\n\"We will evaluate market by market which role the physical presence is to have for us,\" Hummel said on Tuesday.\n\nShe said no decisions had been made to close existing stores but around 50 central roles in Sweden focused on physical store operations would be cut, reducing staff overall to around 100.\n\nThe strategy shift was first reported on by Swedish online publication Breakit.", "description": "H&M's outlet brand Afound tweaks strategy towards online", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF9719H_L.jpg", "published_at": "2019-10-08"}