{"pub": "heritage", "url": "https://heritage.org/defense/commentary/how-the-air-force-got-its-start-72-years-ago", "downloaded_at": "2019-09-18 23:20:32.318152+00:00", "title": "How the Air Force Got Its Start 72 Years Ago", "language": "en", "text": "Wednesday marks the 72nd birthday of the U.S. Air Force.\n\nProud Air Force members today help keep the peace and provide unmatched capabilities from the air to support America’s national defense needs—from the skies of Afghanistan to the missile silos in North Dakota.\n\nConceived in World War I and born out of the Army Signal Corps two years after the end of World War II, the Air Force was established through the National Security Act on Sept. 18, 1947.\n\nWhile by far the youngest of the four military branches within the Department of Defense, the Air Force crosses the boundaries of, and directly impacts the success of, every other branch and their collective support of the National Military Strategy.\n\nUp until the birth of combat air power, the roles and missions associated with the services were clearly defined. The Army fought on land, and the Navy and Marines concentrated on seaborne and littoral operations. Their collective actions, activities, and interests seldom overlapped.\n\nThat all began to change in World War I.\n\nAircraft showed the ability to see not only over the next hill, but impact an enemy beyond a depth that could be readily imagined by those operating in the other two domains.\n\nThe period between World War I and World War II allowed the services to more fully develop and invest in their respective aviation arms, and by the time World War II began, the clear lines of demarcation were gone.\n\nThe capabilities inherent to the air domain were seemingly boundless and, by the end of the war, the most senior leaders in the Army felt the United States should establish the Air Force as a separate service.\n\nThe Navy, having already replaced its battleships with aircraft carriers as the pillars of their fleets, certainly recognized air power’s potential, and it was equally aware that a new service focused on air power directly threatened that move.\n\nA similar reorganization resulted in the loss of naval aviation in the United Kingdom, and the U.S. Navy in no way wanted to suffer the same fate.\n\nIf that weren’t enough, nuclear weapons could only be delivered from the air, and if the Navy lost its fleet of aircraft, it would likely lose the opportunity to hold the United States’ most powerful weapons in its arsenal.\n\nWith that, the Navy openly fought the move.\n\nThe National Security Act of 1947 did its best to straddle the issue by charging the Air Force with sustained offensive and defensive air combat operations, while the Army and Navy were charged with combat operations in their respective domains.\n\nThe same day the act became law, the Truman administration attempted to quell the Navy’s concerns by issuing an executive order to further clarify the roles and missions, emphasizing the Navy’s control of the air over the ocean. But the angst and uncertainty remained.\n\nIn April 1948, the four service chiefs met in Key West, Florida, to draft the Key West Agreement, which reaffirmed primary service responsibilities and established collateral missions within the three domains that are, in effect, the roles and missions the services have been executing for the past 71 years.\n\nDuring its formative years, the Air Force was organized along the same missions it flew during World War II. Long-range bombers, fighters, and airlift assets would be assembled into four components: Strategic Air Command, Tactical Air Command, Air Defense Command, and the Military Air Transport Service.\n\nThat simple structure would change rapidly as the Air Force took on more missions.\n\nIntercontinental ballistic missiles were introduced into the Air Force arsenal in 1958, and the service’s first intelligence, surveillance, and reconnaissance satellite was placed into orbit in 1959.\n\nWith them came the Defense Department’s competition for preeminence in a fourth domain: space.\n\nOver the next 60 years, the Air Force would certainly launch more satellites into space, but each of the services would establish domain-specific navigation, communications, and intel orbits.\n\nWith few exceptions, the efforts were uncoordinated, and no single service would cede ground or authority to another, recharging an underlying roles-and-missions debate.\n\nThe creation of a fifth branch of service—for space—similar to the creation of the Air Force has caused its share of controversy.\n\nAt the request of the Trump administration, Congress will help the Defense Department to master warfare in a new domain and, before the Air Force celebrates another birthday, Congress will likely establish a new service called the Space Force.\n\nAs in 1947, it’s reassuring to know the Space Force will have an elder sibling there to make those first steps great ones.\n\nHappy birthday, Air Force, and thanks for always keeping the nation first.", "description": "Wednesday marks the 72nd birthday of the U.S. Air Force. \n\nProud Air Force members today help keep the peace and provide unmatched capabilities from the air to support America’s national defense needs—from the skies of Afghanistan to the missile silos in North Dakota.\n\nConceived in World War I and born out of the Army Signal Corps two years after the end of World War II, the Air Force was established through the National Security Act on Sept. 18, 1947.", "authors": ["John Venable", "Senior Research Fellow For Defense Policy", "John", "Jv", "Venable", "A Veteran Of The U.S. Air Force Is A Senior Research Fellow For Defense Policy At Heritage."], "top_image": "https://www.heritage.org/sites/default/files/styles/facebook_optimized/public/images/2019-09/GettyImages-80743689.jpg?itok=N0oPHrcj", "published_at": "2019-09-18"}