{"pub": "huffpost", "url": "https://huffpost.com/entry/voters-dont-care-if-a-candidate-is-vegan_n_5d7bd4e1e4b077dcbd5d870f", "downloaded_at": "2019-09-14 01:38:39.745772+00:00", "title": "Voters Don’t Care If A Candidate Is Vegan", "language": "en", "text": "Heidi Gutman via Getty Images New Jersey Sen. Cory Booker is a vegan. That probably won't impact his electoral chances very much.\n\nCory Booker doesn’t care if you adopt a vegan diet, and there’s little evidence voters care about what he eats.\n\nAt Thursday night’s Democratic presidential debate, moderator Jorge Ramos used climate change as a reason to press the New Jersey senator on his dietary choices. But a HuffPost/YouGov poll conducted earlier this year found nearly three-quarters of registered voters said whether or not a candidate was vegan wouldn’t impact their vote.\n\nSo while Republicans ― and at times, the media ― have made light of Booker’s decision not to consume meat or animal byproducts, there’s little evidence it would help or hamper his chances in his White House quest.\n\nThe HuffPost/YouGov poll found 74% of registered voters said it wouldn’t matter to them if a candidate adhered to a vegan diet, with 12% saying it would make them less likely to support that person and 7% saying it would make them more likely to do so.\n\nThe poll found voters were more likely to care if a candidate was an evangelical Christian (a total of 54% said it would impact their vote one way or the other, with 37% saying it wouldn’t matter), an atheist (again, 54% said it would influence their vote, 37% said it wouldn’t), gay or lesbian (31% to 59%), had smoked marijuana (27% to 66%) or had financial trouble in the past (38% to 41%).\n\n“After the recent fires in the Amazon, some experts suggested that eating less meat is one way to help the environment,” Ramos asked Booker. “You are a vegan since 2014. That’s obviously a personal choice, but President (Donald) Trump and Brazil’s President (Jair) Bolsonaro are concerned that climate change regulations could affect economic growth. So should more Americans ... follow your diet?”\n\n“First of all, I want to say no,” Booker said. “Actually, I want to translate that into Spanish. No.”\n\nRamos was right: Eating less meat, especially less beef, can help combat climate change by reducing carbon emissions. And while Booker has talked about the environmental impact of going vegan, he has not suggested imposing that choice on others.\n\nBooker used the question to instead pitch his proposal for a moratorium on consolidation in the agriculture industry: “Factory farming is destroying and hurting our environment. And you see independent family farmers being pushed out of business because of the kind of incentives we are giving that don’t line up with our values.”\n\nThe poll did find the number of vegans in America remains low: Just 3% of registered voters said they practiced the diet, while 5% said they were vegetarian and 83% said they had never been a vegan or a vegetarian (those who eschew meat but often eat eggs and dairy products).\n\nBut voters also seemed at least somewhat sympathetic to vegans: 71% said they understood why someone would choose such a diet, while 18% said they didn’t.\n\nAriel Edwards-Levy contributed to this story.\n\nThe HuffPost/YouGov poll consisted of 1,000 completed interviews conducted February 21 and 22 among U.S. adults, using a sample selected from YouGov’s opt-in online panel to match the demographics and other characteristics of the adult U.S. population. HuffPost has teamed up with YouGov to conduct daily opinion polls. You can learn more about this project and take part in YouGov’s nationally representative opinion polling. More details on the polls’ methodology are available here. Most surveys report a margin of error that represents some but not all potential survey errors. YouGov’s reports include a model-based margin of error, which rests on a specific set of statistical assumptions about the selected sample rather than the standard methodology for random probability sampling. If these assumptions are wrong, the model-based margin of error may also be inaccurate. Click here for a more detailed explanation of the model-based margin of error.", "description": "Cory Booker was asked about his diet at Thursday’s Democratic presidential debate. Polling shows voters aren’t interested.", "authors": ["Senior Political Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d7bd68f230000e90352ea13.jpeg?cache=ihexgilhe3&ops=1778_1000", "published_at": "2019-09-13"}