{"pub": "cnbc", "url": "https://cnbc.com/select/american-express-green-card-relaunches-with-new-rewards-and-benefits", "downloaded_at": "2019-10-24 13:53:00.608236+00:00", "title": "American Express Green Card relaunches with new benefits and higher annual fee", "language": "en", "text": "American Express announced on Thursday, October 24, the relaunch of the American Express® Green Card, which will now be called Green from AmEx. Starting today, existing and new cardholders can benefit from increased rewards and enhanced perks. Plus, the new cards are made from 70% reclaimed plastic. These changes come 50 years after the Green Card was first introduced and expand on the evolving needs of consumers and the push for more experience-based benefits. The new card was designed for customers who are looking to do business with sustainable and socially responsible brands but also are much more interested in trying out the new restaurant across town or traveling with their friends rather than necessarily buying things, Rachel Stocks, executive vice president of global premium products and benefits at American Express, tells CNBC Select. Below, CNBC Select has the scoop on the revamped card, from new rewards to slightly higher fees.\n\nImproved rewards program\n\nThe Green from AmEx now offers a more robust rewards program compared to the prior version of the card. Cardholders earn 3X Membership Rewards® points on travel, transit and at restaurants worldwide and 1X Membership Rewards® points on all other purchases. Travel and transit purchases include: flights, hotels, tours, car rentals, ride shares, buses, subways, third-party travel websites and purchases at Amextravel.com. Previously, the card only offered 2X Membership Rewards® points per dollar on travel booked at Amextravel.com and 1X Membership Rewards® points per dollar on everything else. New card members can benefit from a welcome bonus of 30,000 Membership Rewards® points after spending $2,000 on eligible purchases in the first three months of membership. Plus as a limited time offer, new cardholders who apply by January 15, 2020 will also receive a $100 statement credit toward any purchases with Away in the first three months of membership. This credit can help to offset the cost of new luggage for upcoming travel during the holidays and new year.\n\nUpdated benefits\n\nNew and current cardholders can take advantage of up to $200 in annual statements, a mobile assistant and updated payment features. CLEAR credit: Receive up to $100 in statement credits per calendar year toward a CLEAR membership, which unlocks frictionless experiences at over 60 locations nationwide, including airports, arenas, stadiums and Hertz rental car locations.\n\nReceive up to $100 in statement credits per calendar year toward a CLEAR membership, which unlocks frictionless experiences at over 60 locations nationwide, including airports, arenas, stadiums and Hertz rental car locations. LoungeBuddy credit: Get up to $100 in statement credits per calendar year toward purchases with LoungeBuddy to relax at airport lounges around the world.\n\nGet up to $100 in statement credits per calendar year toward purchases with LoungeBuddy to relax at airport lounges around the world. Mobile assistant: Within the AmEx app, you can access a mobile assistant to help book flights or hotels, check rewards balances or ask account questions.\n\nWithin the AmEx app, you can access a mobile assistant to help book flights or hotels, check rewards balances or ask account questions. Split the bill and keep the rewards: Now when you charge a group expense to your card to earn all the rewards, you can request payment from friends and other people who owe you directly from the AmEx app. A Venmo or PayPal account is required and enrollment is required.\n\nNow when you charge a group expense to your card to earn all the rewards, you can request payment from friends and other people who owe you directly from the AmEx app. A Venmo or PayPal account is required and enrollment is required. Pay Over Time: This feature allows cardholders to carry a balance with interest on eligible charges, up to a preset limit.\n\nFees\n\nThe Green from AmEx comes with a $150 annual fee (before it was $95). While the annual fee is $55 more, cardholders now receive up to $200 in annual statement credits that more than offset the annual fee. Plus new users can get an additional $100 toward Away purchases within the first three months from account opening. The new annual fee will go into effect for existing cardholders on their next renewal date on or after January 1, 2020. This card no longer charges a 2.7% foreign transaction fee, so it's a better choice for travelers looking to make purchases outside the U.S.\n\nThe card's new look\n\nThe Green from AmEx didn't just get a revamp in terms of benefits and fees, but also a new card design. New cards are made from 70% reclaimed plastic collected from beaches, islands and coastal communities, in partnership with Parley for the Oceans. \"We hope Green from AmEx will serve as a daily reminder to our card members to do their part to back our oceans and consider how they can reduce the use of plastic in their own lives,\" Stocks said in the press release announcing the new card. New cards are shipped out when you're approved for the card. If you're an existing cardholder and want the new card, simply call to request a new card design. For more information about the redesigned card and AmEx's efforts to reduce ocean plastic, visit americanexpress.com/us/campaigns/back-our-oceans. Information about the Green from AmEx has been collected independently by CNBC and has not been reviewed or provided by the issuer of the card prior to publication.\n\nEditorial Note: Opinions, analyses, reviews or recommendations expressed in this article are those of the CNBC Select editorial staff’s alone, and have not been reviewed, approved or otherwise endorsed by any third party.", "description": "The American Express Green Card has new rewards, a revamped card design and a higher annual fee. Find out more about how these new perks improve the credit card offering.", "authors": ["Alexandria White"], "top_image": "https://image.cnbcfm.com/api/v1/image/106198843-15718498128131x1-11.jpg?v=1571853029", "published_at": "2019-10-24"}