{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7571175/Reading-sporting-director-Mark-Bowen-set-appoint-clubs-new-manager.html", "downloaded_at": "2019-10-14 23:33:24.274225+00:00", "title": "Reading sporting director Mark Bowen appoint himself as the club's new manager", "language": "en", "text": "Mark Bowen has been named as Reading's new manager having been involved in the recruitment process himself.\n\nBowen was appointed as Reading's sporting director in August and previously worked for the club as a technical consultant after joining in March.\n\nThe 55-year-old, who has never previously managed a club on a permanent basis, has replaced Jose Gomes, who departed last week.\n\nReading sporting director Mark Bowen has appointed himself as the club's new manager\n\nFollowing Bowen's appointment, chief executive Nigel Howe told the club's official website: 'In the relatively short period of time that Mark has already spent at Reading Football Club, he has commanded respect and admiration from all who have worked alongside him.\n\n'He came in at a critical period last season to help us retain our Championship status and had an immediate impact.\n\n'Mark has two decades of coaching background on his CV, has tasted promotion to the Premier League and spent most of his coaching career in top-flight football.\n\n'He knows this club and the owner and the board believe he is very capable of getting the very best out of a talented group of first team players and achieving the results we all want.'\n\nReading are currently in 22nd place in the Championship having won just two of their eleven league games so far this season.\n\nBowen possesses a vast amount of coaching experience and was caretaker manager of QPR for one game in 2012, taking charge of a 3-1 Premier League defeat to Manchester United along with Eddie Niedzwiecki.\n\nBowen has replaced Jose Gomes, who left the struggling Championship side last week\n\nMore recently, Bowen was assistant manager of Southampton; a position that he also held at Stoke, QPR, Fulham, Manchester City, Blackburn and Birmingham. He also had a lengthy spell as assistant manager of Wales at the start of his coaching career.\n\nAs a player Bowen won the UEFA Cup with Tottenham in 1984 and also represented Norwich, West Ham and Charlton. He was capped by Wales on 41 occasions.", "description": "Mark Bowen has been named as Reading's new manager having been involved in the recruitment process himself.", "authors": ["Jeorge Bird For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/12/19690282-0-image-a-18_1571053972076.jpg", "published_at": "2019-10-14"}