{"pub": "wsj", "url": "https://wsj.com/articles/jetblue-to-take-customer-service-tech-to-the-skies-11569968137?mod=rsswn", "downloaded_at": "2019-10-02 12:46:21.155753+00:00", "published_at": "2019-10-01", "title": "JetBlue to Take Customer-Service Tech to the Skies", "language": "en", "text": "JetBlue Airways Corp.’s partnership with startup Gladly Inc. has shaved time from its customer-service calls, and the airline plans to introduce its software on flights so cabin crew can have a bird’s-eye view of information about customers onboard.\n\nEash Sundaram, JetBlue’s chief digital and technology officer, said the airline could roll out the software to thousands of in-flight crew members next year after testing it with dozens of employees later this year. By looking at in-flight tablets, flight attendants could see, for example, whether a specific passenger boarded the plane after the frustrating experience of missing a different flight and offer them a free drink.\n\nThe software can also prompt crew members to offer complimentary perks or seats with more leg room to frequent fliers who have problems during the flight, such as a broken TV screen.\n\n“That kind of stuff doesn’t exist today,” Mr. Sundaram said, because information about customers is spread across multiple systems and hard to access.\n\nSan Francisco-based Gladly has raised more than $113 million in venture capital from investors including JetBlue Technology Ventures, the airline’s startup investing arm, which is overseen by Mr. Sundaram. Other investors include venture-capital firms Greylock Partners and New Enterprise Associates.\n\nThe in-flight system will build on JetBlue’s use of Gladly software to make booking, changing and boarding flights similar to the customer experience of technology-focused companies such as Uber Technologies Inc. and Amazon.com Inc.\n\n“The challenge is to keep up with the pace of change. Every consumer expects you to be another Facebook, Google, Apple—not an airline,” Mr. Sundaram said, adding that the travel industry has traditionally lagged behind in technology-focused customer experience.\n\nMany airlines are placing an emphasis on improving customer service as a way to differentiate products and services, said Jon Glick, a partner at PricewaterhouseCoopers LLP who focuses on customer experience in the airline, hospitality and retail industries. “Technology and data are the keys to unlocking that for many of these companies,” he said.\n\nA screenshot of Gladly's customer-service software. Photo: JetBlue Airways Corp.\n\nJetBlue has been using Gladly software in its customer-service centers for about three years. The software shows call-center employees a timeline of each customer’s interactions with JetBlue—including by text, email and phone—so that customers don’t have to recap their previous conversations. The software also lets agents see a snapshot of the customer’s loyalty status, favorite seats, upcoming flights and flight status in one tab. Other Gladly customers include luggage brand Tumi, owned by Samsonite International SA, and fabric retailer Jo-Ann Stores Inc.\n\n“The contact center can be an incredibly powerful relationship-building place or it can be the most frustrating place on the planet,” Mr. Sundaram said. “The need for us to be so perfect in dealing with these kinds of issues is much more important for us in terms of getting a customer back on our plane again.”\n\nData from various sources within the company are integrated with Gladly’s software using application programming interfaces, or APIs—pieces of software that enable apps, platforms and systems to connect with each other and share data.\n\nPreviously, JetBlue had five different systems that stored customer data, Mr. Sundaram said. Since 2017, average call times have been cut by about 40%, he said. JetBlue declined to disclose specifics about call length but in general customer-service representatives save between 30 seconds and five minutes on calls, according to Gladly.\n\nJetBlue wouldn’t disclose how much it has invested in Gladly or how much it is paying to use the software, but said all of its 2,500 call-center agents are using the technology. The product costs about $150 per agent per month, Gladly said.\n\nTechnology executives across industries such as travel, hospitality and retail feel a sense of urgency to compete against digital giants that place a premium on customer experience, said Chris Howard, chief of research for Gartner Inc.’s CIO Research group.\n\n“Everybody wants the Amazon experience,” he said. “It removes all the friction out of the process and anticipates what [the customer] wants.”\n\nWrite to Sara Castellanos at sara.castellanos@wsj.com", "description": "JetBlue’s partnership with startup Gladly has shaved time from its customer-service calls, and the airline plans to introduce its software on flights so cabin crew can have a bird’s-eye view of information about customers onboard.", "authors": ["Sara Castellanos", "Sara.Castellanos Wsj.Com"], "top_image": "https://images.wsj.net/im-103821/social"}