{"pub": "yahoo", "url": "https://news.yahoo.com/former-dem-gov-pennsylvania-accuses-122739803.html", "downloaded_at": "2019-09-13 00:57:27.460116+00:00", "published_at": "2019-09-12", "title": "Former Dem Gov Labels Warren ‘Hypocrite’ for Shunning Big Donors after Taking Their Money", "language": "en", "text": "Ed Rendell, the former Democratic governor of Pennsylvania, slammed Senator Elizabeth Warren (D., Mass.) in the pages of the Washington Post on Thursday for touting her commitment to grassroots fundraising after pocketing millions in donations from the wealthiest people in the country.\n\n“I like Elizabeth Warren. I like her a lot. Too bad she’s a hypocrite,” Rendell begins the op-ed.\n\nAfter praising Warren’s ideological commitments and her efforts to increase consumer protections in the financial sector, Rendell takes his fellow Democrat to task for “trying to have it both ways” by claiming independence from high-dollar donors while surreptitiously relying on them.\n\nHe cites a recent New York Times report which revealed that Warren transferred $10.4 million from her senate reelection fund into her presidential campaign fund, $6 million of which came from donations of over $1,000.\n\n“The senator appears to be trying to have it both ways — get the political upside from eschewing donations from higher-level donors and running a grass-roots campaign, while at the same time using money obtained from those donors in 2018,” Rendell writes.\n\nRendell, who is backing Joe Biden in the Democratic primary, goes on to criticize Warren’s characterization of a fundraiser he hosted for Biden in April as “a swanky private fund-raiser for wealthy donors” in a fundraising email she sent the day after the gathering.\n\n“Well, I helped organize that affair, and I thought her attack was extremely hypocritical because nearly 20 of us who attended the Biden fundraiser had also given her $2,000 or more in 2018 at closed-door fundraisers in “swanky” locations,” he writes.\n\nWarren continues to tout her commitment to grassroots fundraising and has not responded to Rendell’s broadside. However, her allies in the media have defended her decision to rely on high-dollar donations as a pragmatic move that will enable her to reform campaign finance laws from within once she wins the presidency.\n\nMore from National Review", "description": "Ed Rendell, the former Democratic governor of Pennsylvania, slammed Senator Elizabeth Warren (D., Mass.) in the pages of the Washington Post on Thursday for touting her commitment to grassroots fundraising after pocketing millions in donations from the wealthiest people in the country.“I like Elizabeth", "authors": ["Jack Crowe"], "top_image": "https://s.yimg.com/uu/api/res/1.2/d9jOcuIlrp8MrRg7E3kk9A--~B/aD01OTc7dz0xMDIzO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/the_national_review_738/b48d3b74e106c67d58611cf8add82446"}