{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7592451/TOWIEs-Yazmin-Oukhellou-puts-busty-display-Nicole-Bass-birthday-night-out.html", "downloaded_at": "2019-10-20 00:32:22.029016+00:00", "title": "TOWIE's Yazmin Oukhellou puts on a VERY busty display for Nicole Bass' birthday night out", "language": "en", "text": "She has been left less than impressed by her ex James 'Lockie' Lock's antics since their split.\n\nYet Yazmin Oukhellou put the drama behind her as she enjoyed a girls' night out at Bagatelle London with Georgia Harrison for Nicole Bass' birthday on Saturday.\n\nThe TOWIE star, 25, set pulses racing as she put on a very busty display in a tiny sheer black mini dress embellished with sequins and a sheer panel.\n\nGlamorous: Yazmin Oukhellou put the drama behind her as she enjoyed a girls' night out at Bagatelle London with Georgia Harrison for Nicole Bass' birthday on Saturday\n\nYazmin cinched in her waist with a black belt which had a diamond V on it and a pair of matching coloured heels.\n\nThe reality star styled her brunette locks into a sleek blow-dried hairdo, she added a slick of glamorous make-up.\n\nMeanwhile Love Island babe Georgia showcased her toned figure in a tiny black patterned jumpsuit and a pair of sparkly barely-there heeled sandals.\n\nBirthday girl Nicole, who turned 27 on Saturday, left nothing to the imagination in a black bra and high-waisted knickers with a sheer mini dress over the top.\n\nBusty: The TOWIE star, 25, set pulses racing as she put on a very busty display in a tiny sheer black mini dress embellished with sequins and a sheer panel\n\nDetails: Yazmin cinched in her waist with a black belt which had a diamond V on it and a pair of matching coloured heels\n\nPals: The reality star styled her brunette locks into a sleek blow-dried hairdo, she added a slick of glamorous make-up\n\nThe TOWIE star appeared in good spirits despite the fact her ex Sam Mucklow sparked engagement with his new girlfriend Shelby Tribble after a cryptic Instagram snap just hours before her night out.\n\nSam, 27, took to the social media platform to share a loved-up snap of himself kissing Shelby on their romantic Barbados getaway, he captioned it: 'Who’s coming to the wedding then?' followed by a bride and groom emoji.\n\nThe reality star's followers and TOWIE co-stars were quick to comment on the post with Congratulations bro Tommy Mallet saying: 'Congratulations bro.'\n\nBirthday girl: Birthday girl Nicole, who turned 27 on Saturday, left nothing to the imagination in a black bra and high-waisted knickers with a sheer mini dress over the top\n\nGirls' night: Meanwhile Love Island babe Georgia showcased her toned figure in a tiny black patterned jumpsuit and a pair of sparkly barely-there heeled sandals\n\nCourtney Green sweetly gushed: 'I'm bridesmaid !!!'\n\nLiam Gastby posted: 'Of course she was gonna say Yes!!!!!! Congrats you two ❤️.'\n\nMailOnline has contacted both Sam and Shelby's representatives for comment.\n\nWhat drama? Nicole appeared in good spirits despite the fact her ex Sam Mucklow sparked engagement with his new girlfriend Shelby Tribble after a cryptic Instagram snap just hours before her night out\n\nEngaged? Her ex Sam, 27, took to the social media platform to share a loved-up snap of himself kissing Shelby on their romantic Barbados getaway, he captioned it: 'Who’s coming to the wedding then?' followed by a bride and groom emoji.\n\nWedding bells? The reality star's followers and TOWIE co-stars were quick to comment on the post (pictured) with Congratulations bro Tommy Mallet saying: 'Congratulations bro'\n\nIt comes after Yazmin's ex James was pictured locking lips with blonde bombshell Ellie McKenzie as the duo put on a passionate display during a recent night out in Essex.\n\nThe star has been left less than impressed by his recent antics, due to the fact she is apparently friends with the girl he was seen snogging.\n\nDuring an upcoming episode of TOWIE, Yazmin is set to reveal to a group of her gal pals that she was left upset after seeing snaps of James with his new love interest.\n\nSweet: Courtney Green sweetly gushed: 'I'm bridesmaid !!!' while Liam Gastby posted: 'Of course she was gonna say Yes!!!!!! Congrats you two ❤️.'\n\nHappier times: Nicole and Sam pictured in happier times before their split\n\nBroaching the topic of James' snog, Courtney Green asks: 'Yaz have you seen those pictures of Locky and that girl online?'\n\nWhile Chloe Meadows chimes in: 'I wasn't going to say it to you, was going to wait until you brought it up.'\n\nYaz candidly admits: 'I did get a little bit upset, not because James is moving on with someone, but this girl was messaging me last week asking me to go for dinner and asking for my boob surgeon.\n\nRaging: It comes after Yazmin's ex James was pictured locking lips with blonde bombshell Ellie McKenzie as the duo put on a passionate display during a recent night out in Essex\n\nHappier times: The star has been left less than impressed by his recent antics, due to the fact she is apparently friends with the girl he was seen snogging (pictured January 2019)\n\nOuch: During an upcoming episode of TOWIE, Yazmin is set to reveal to a group of her gal pals that she was left upset after seeing snaps of James with his new love interest\n\nApparently confused over the girls' intentions, she adds: 'What does she want new boobs for James to look at that look exactly like mine? I don't know what this girl's issue is.'\n\nAttempting to make sense of the situation, Chloe says: 'So you know her?'\n\nYaz replies: 'I know her! I messaged the girl, I maybe said some things I shouldn't have said. But we all know what I'm like. She tried to lie and say it was like a drunken kiss thing that they just met out as a group.'\n\nThe brunette beauty goes on to insist that she is fine with James moving on without her, and even adds that the girl is welcome to her plastic surgeon as well.\n\nNew girl: James Lock was pictured locking lips with blonde bombshell Ellie McKenzie (pictured) as the duo put on a passionate display during a recent night out in Essex\n\nQuestion time: Broaching the topic of James' snog, Courtney Green asks: 'Yaz have you seen those pictures of Locky and that girl online?'\n\nYaz candidly admits: ' I did get a little bit upset, not because James is moving on with someone, but this girl was messaging me last week asking me to go for dinner and asking for my boob surgeon'\n\nElsewhere, James recently slammed claims he’s dating Ellie – and says even his mum disapproved of their passionate kiss.\n\nThe TOWIE star insisted he 'won’t be pursuing Ellie' and 'it was never going to be anything serious' as he jokingly confesses to 'taking anyone with a pulse.'\n\nIn an exclusive interview with MailOnline, James confessed that, 'like many footballers he only attracts a certain type of woman', before quipping he often finds himself lumbered with 'bad b****es!'\n\nConfused: Apparently confused over the girls' intentions, she adds: 'What does she want new boobs for James to look at that look exactly like mine? I don't know what this girls issue is'\n\nBaffled: Attempting to make sense of the situation, Chloe says: 'So you know her?'\n\nJames, who was pictured kissing Ellie outside Hakkasan restaurant in London, believes he was 'setup' and says he had no intention of going public with the brief fling.\n\nHe said: 'Someone set up the photos. Even though I’m on a reality show I’m quite a private person.\n\n'There was a group of us in Hakkasan and I met the girl for a few drinks and it was blown out of proportion.\n\n'It was a nothing thing, it was never going to be anything serious. She’s not someone I was seeing, she’s not my girlfriend, everyone was saying “James’ new girlfriend,” she’s not my new girlfriend. It was something casual.\n\n'There won’t be a second date, I won’t be pursuing her. She’s not a bit of me. I’ve been getting it in the ear from my mum saying she’s not for me!'", "description": "The TOWIE star, 25, set pulses racing as she put on a very busty display in a tiny sheer black mini dress embellished with sequins and a sheer panel.", "authors": ["Olivia Wheeler For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/20/00/19940722-0-image-a-4_1571528553075.jpg", "published_at": "2019-10-19"}