{"pub": "fox", "url": "https://foxnews.com/politics/house-passes-bill-to-make-animal-cruelty-a-felony-in-major-step-to-end-animal-abuse", "downloaded_at": "2019-10-24 02:25:41.951545+00:00", "title": "House passes bill to make animal cruelty a federal felony in 'major step to end animal abuse'", "language": "en", "text": "A bill that makes animal cruelty a federal felony was unanimously passed in the House of Representatives on Tuesday.\n\nThe bipartisan Preventing Animal Cruelty and Torture (PACT) Act, which was introduced by Reps. Ted Deutch, D-Fla., and Vern Buchanan, R-Fla., would outlaw a form of animal abuse known as “crushing,” where people maim and torture animals.\n\nBurning, drowning, suffocating, impaling and other forms of torture would also be banned.\n\nTASERED CALIFORNIA MAN BEAT CAT AGAINST HOOD OF LAGUNA BEACH PATROL CAR, CHARGED WITH ANIMAL CRUELTY: COPS\n\nIn 2010, Congress passed the Animal Crush Video Prohibition Act, which made the creation and distribution of animal crushing videos illegal, according to a news release from Deutch’s office. The office added that the underlying acts of cruelty against animals were not included.\n\nDeutch said The PACT Act closes the loophole by banning certain cases of animal abuse.\n\n\"Today’s vote is a significant milestone in the bipartisan quest to end animal abuse and protect our pets,” Deutch said. “This bill sends a clear message that our society does not accept cruelty against animals.”\n\nHe added, “I’m deeply thankful for all of the advocates who helped us pass this bill, and I look forward to the Senate’s swift passage and the president’s signature.”\n\nVIRGINIA ENACTS 'TOMMIE'S LAW,' MAKING ANIMAL CRUELTY A FELONY\n\nDeutch also tweeted on Tuesday that the legislation “is a major step to end animal abuse and protect our pets.”\n\nBuchanan said, “The torture of innocent animals is abhorrent and should be punished to the fullest extent of the law.”\n\n“Passing the PACT Act sends a strong message that this behavior will not be tolerated,” he added.\n\nIf the bill becomes law, people found guilty of torturing animals would face felony charges, fines and up to seven years in prison.\n\n“Most people are shocked to know that the U.S. does not have a federal animal cruelty law,” Animal Wellness Foundation Director of Federal Affairs Holly Gann said. “Enacting this bill sends a signal that our nation has no tolerance for intentional cruelty toward animals.”\n\nCLICK HERE FOR THE FOX NEWS APP\n\nThe PACT Act would not interfere with local animal cruelty laws or enforcement, lawmakers said.\n\nThe Associated Press contributed to this report.", "description": "A bill that makes animal cruelty a federal felony was unanimously passed in the U.S. House of Representatives on Tuesday.", "authors": ["Talia Kaplan", "Talia Kaplan Is A Reporter For Foxnews.Com. Follow Her On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/PACT-Act-legislation.jpg", "published_at": "2019-10-23"}