{"pub": "cbc", "url": "https://cbc.ca/news/politics/scheer-conservative-platform-unveiled-1.5318850", "downloaded_at": "2019-10-12 00:22:17.241577+00:00", "title": "Scheer unveils Conservative platform promising $69 billion in savings, new revenue over 5 years | CBC News", "language": "en", "text": "Conservative Leader Andrew Scheer unveiled his party's platform today, promising Canadians tax cuts and credits to make life more affordable.\n\nOverall, Scheer is pledging that between today and 2024-25, a Conservative government would spend $49 billion on tax cuts and new programs, but would bring the budget back into balance by raising $69 billion over the same period through new revenue streams and cuts to existing programs and initiatives.\n\nOver the five years, that would mean a reduction in infrastructure spending of just over $18 billion.\n\n\"From students to seniors and everyone in between — if you pay income tax, you will pay less under my government,\" Scheer is quoted as saying in the opening pages of the document.\n\nScheer is the last federal leader of a major party to release his platform — and did so late on a Friday, on the day advance polling opened across the country. Scheer is also the only party leader to release his platform after the completion of the televised debates.\n\nThe Conservative platform, however, was released fully costed by the Parliamentary Budget Officer. The Liberals released their platform, which included PBO costs for most major initiatives, on Sept. 29. The cost of the Liberals' proposed pharmacare program, for example, was one of the initiatives that was not costed.\n\nThe NDP released its uncosted platform in the summer but released the costing of that platform earlier today. The Greens released their platform Sept 16. and followed that up by releasing a costing of most of their major initiatives later that month.\n\nScheer's platform is promising an income tax cut and a series of tax credits that he said would make life more affordable. He also is planning to eliminate the federal carbon tax.\n\n\"Justin Trudeau has spent our way out of having any type of flexibility if there is a downturn,\" Scheer said in Delta, B.C. earlier today.\n\n\"Those massive deficits are weighing down our economy. It means more and more money has to be taken out of our economy ... or by paying higher interest payments on the debt, which is just going to banks and bondholders.\"\n\nCutting spending, raising revenues\n\nAccording to the platform document, the Conservatives would do this by coming up with $6.463 billion in savings and new revenue streams in 2020-21, rising to $20.424 billion annually by the 2024-25 fiscal year. The steps the party would take to save money and boost revenues include:\n\nFreezing hiring in the federal public service — maintaining jobs at 2020-21 levels until the budget is balanced — for a projected saving of $558 million by 2024-25.\n\nReducing operating expenses by cutting the use of consultants, clamping down on travel and hospitality expenses, tightening procurement tools and scaling back on government-owned real estate for a projected saving of $5 billion a year by 2024-25.\n\nEarmarking less money for infrastructure by focusing on projects that are ready for construction for a projected saving of $6.726 billion a year by 2024-25.\n\nCutting corporate welfare payments by $1.5 billion annually.\n\nCancelling planned increases to international assistance to save $726 million annually by 2024-25.\n\nCutting foreign aid by 25 per cent for a saving of $1.5 billion annually.\n\nImposing a three per cent tax on tech giants that operate social media platforms, search engines or online marketplaces in Canada, bringing in an additional $610 million annually by 2024-25.\n\nAllocating $750 million from other as-yet-unnamed government departments to set up a Tax Gap office that would crack down on tax evasion, to bring in a projected additional $3.37 billion a year by 2024-25.\n\nForcing tobacco companies to pay for anti-smoking campaigns to the tune of $58 million a year.\n\nWithdrawing investments from the Asian Infrastructure Investment Bank to save $9 million a year.\n\nRepealing parts of the 2019 federal budget, such as subsidies to companies for the purchase of electric cars and eliminating the Canada Training Credit, for a projected saving of $362 million a year by 2024-25.\n\n\"Its precisely because there are some signs of possible headwinds that we need to get back on track,\" Scheer said. \"We need to turn the ship away from the rocky shoals and back out to clear waters, and that's exactly what this plan does.\"\n\nScheer said that a Conservative government would \"protect core services while we make government more efficient.\"\n\nOn infrastructure, the Conservative leader said he would respect all agreements for projects currently under construction or planned for construction but going forward he would change the priority list.\n\nConservative Leader Andrew Scheer says that, if he's elected, his government would balance the budget within five years. To do that, Conservatives would cut billions in spending and delay some of the Liberal government's infrastructure spending commitments. Scheer unveiled his platform Friday near Delta, B.C. 1:15\n\nThat pledge lines up with an earlier campaign promise to direct infrastructure spending toward projects to reduce commute times, such as the George Massey Tunnel Replacement Project in Vancouver, B.C. and the Ontario Line Yonge Subway Extension in Toronto.\n\nLiberal Leader Justin Trudeau, speaking in Surrey B.C., described the Conservative platform as a return to the austerity seen under former prime minister Stephen Harper.\n\n\"The Conservatives are proposing $53 billion worth of cuts. Deeper cuts than even Doug Ford is putting forward,\" Trudeau said. \"That's why they waited until Friday night, of a long weekend, at the end of the election, before sharing with Canadians their plan to cut services.\"\n\nKevin Page, the former parliamentary budget officer and CEO of the Institute of Fiscal Studies and Democracy, also took issue with the timing of the platform's release, saying that it should have been done before the debates and advance polling began.\n\n'Nefarious'\n\n\"I'm a bit disappointed, particularly on this platform, less on the NDP because they just struggled to get a document out period,\" said Page. \"They [the NDP] probably would have liked to have gotten it out a week ago. They just weren't ready.\n\n\"But this looks more nefarious from the point of view that, 'We don't want to tell people till after the debates, till people start voting, that this is how we get back to balance.'\"\n\nPage said that closing the tax gap is a worthwhile pursuit, one that all the federal parties are pursuing. He said it was a worthy goal but it hasn't been tried in Canada on the scale the Conservative are proposing.\n\n\"They deficit-finance tax cuts right away, they start in the early years. And then they have these spending cuts ramping up in the outer years and one of your big components is infrastructure,\" said Page.\n\n\"The one thing you don't do, in any plan, if you're saying this is about competitiveness and productivity when you are doing this, is go after infrastructure, because its so critical. That truly is an investment.\"\n\nLiberal Leader Justin Trudeau criticized Conservative Leader Andrew Scheer for delaying the release of his party's platform - which he said downplays the party's \"$53 billion worth of cuts\" - to the last day before a long weekend. 0:43\n\nPage said that economists point to infrastructure spending as a useful tool for boosting a nation's long-term productivity and growth rates.\n\n\"Deficit financing tax cuts? That's consumption. If you give me a tax cut I will either spend it or I will just deal with my debt issues with that extra few hundred bucks a year. That provides a temporary boost to the economy, whereas infrastructure definitely is the longer term boost.\"\n\nPage also said that finding $5 billion in savings from operational expenses would be a challenge — that Harper tried to do it but couldn't find the savings. He also said that cutting $1.5 billion from the foreign aid budget was doable but it would give Canada a very different personality on the world stage.", "description": "Conservative Leader Andrew Scheer unveiled his party’s platform today, promising Canadians tax cuts and credits to make life more affordable.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5319156.1570836246!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/fedelxn-conservatives-20191011.jpg", "published_at": "2019-10-11"}