{"pub": "npr", "title": "President William Howard Taft Wanted All Of The U.S. To Have 3 Months Of Vacation", "url": "https://npr.org/2019/08/01/747368652/president-william-howard-taft-wanted-all-of-the-u-s-to-have-3-months-of-vacation", "language": "en", "published_at": "2019-08-01", "downloaded_at": "2019-09-02 07:27:49.814627+00:00", "text": "President William Howard Taft Wanted All Of The U.S. To Have 3 Months Of Vacation\n\nOn July 31, 1910, President William Howard Taft proposed everyone should have three months vacation every year. NPR explains why he suggested this and what the reaction was.\n\nAUDIE CORNISH, HOST:\n\nAll the candidates on the debate stage last night are hustling to get into the White House. Once there, though, many presidents seem like they'd rather be someplace else. So let's spend a moment on one president who got out of the White House more than most chief executives.\n\nARI SHAPIRO, HOST:\n\nIt was William Howard Taft. Back in 1910, exactly 109 years ago yesterday, The New York Times quoted him as saying...\n\nHUGH HAWTHORNE: \"The American people have found out that there is such a thing as exhausting the capital of one's health and constitution.\"\n\nSHAPIRO: That is not the voice of President Taft. It's Hugh Hawthorne, superintendent of the Taft National Historical Site in Cincinnati. Apparently, Taft thought two weeks' annual leave was insufficient. He proposed much more.\n\nHAWTHORNE: Two or three months' vacation after the hard and nervous strain to which one is subjected during the autumn and spring are necessary in order to enable one to continue his work the next year with that energy and effectiveness which it ought to have.\n\nSHAPIRO: I don't know anyone who gets two to three months' vacation, but, Audie, I would happily volunteer.\n\nCORNISH: Yeah, seriously. Jealous.\n\nSHAPIRO: (Laughter).\n\nCORNISH: Hawthorne says that Taft took vacations for a month or so at a time. He liked to go to Lake Erie in Ohio.\n\nHAWTHORNE: It was a lot of golf, a lot of walking on the beach, a little bit of boating - he did like boating.\n\nCORNISH: Sure. Who doesn't like boating?\n\nSHAPIRO: After Taft made his proposal, The New York Times sought reaction from captains of industry, and they found, quote, \"a surprisingly large number were out of town, perhaps taking Taft's words to heart.\" Those the paper reached strongly disagreed with the need for months of vacation.\n\nCORNISH: Taft did not push for any formal legislation. Steve Nesich of Take Back Your Time, a group that advocates for more vacation time, says today the U.S. remains one of these stingiest countries when it comes to paid time off.\n\nSTEVE NESICH: We are among a handful of nations that do not offer federally mandated paid time off, and they're rather obscure places like the Marshall Islands, for instance. It's a real glaring anomaly, globally.\n\nSHAPIRO: So on this first day of August, whether you are on vacation or just wish you were, remember our 27th president, not for getting stuck in the White House bathtub - another claim to fame - but for his brave stance on longer vacations.\n\n(SOUNDBITE OF MUSIC)\n\nUNIDENTIFIED SINGER: (Singing) Who's the president to run that almost weighs a quarter ton? Taft. Six-foot-two, over 330 pounds. Who is the dude with...\n\n[POST-BROADCAST CORRECTION: In a previous version of this story, we stated that President William Howard Taft got stuck in the White House bathtub. Although this is a commonly repeated story, it is actually an urban legend with no evidence to back it up.]\n\nCopyright © 2019 NPR. All rights reserved. Visit our website terms of use and permissions pages at www.npr.org for further information.\n\nNPR transcripts are created on a rush deadline by Verb8tm, Inc., an NPR contractor, and produced using a proprietary transcription process developed with NPR. This text may not be in its final form and may be updated or revised in the future. Accuracy and availability may vary. The authoritative record of NPR’s programming is the audio record.", "description": "On July 31, 1910, President William Howard Taft proposed everyone should have three months vacation every year. NPR explains why he suggested this and what the reaction was.", "authors": [], "top_image": "https://media.npr.org/include/images/facebook-default-wide.jpg?s=1400"}