{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7568465/Paloma-Faith-raises-child-gender-neutral-doesnt-know-theyre-going-become.html", "downloaded_at": "2019-10-13 18:49:38.392105+00:00", "title": "Paloma Faith raises her child gender-neutral as she doesn't know 'who they're going to become'", "language": "en", "text": "Since giving birth to her first child in 2016, Paloma Faith has decided to keep the infant's name and gender a secret.\n\nAnd the singer, 38, opened up on her reasons for doing so in a candid new interview, explaining that she kept the gender hidden as she didn't know 'who they're going to become'.\n\nThe chat also sees Paloma tragically reveal that she's had two miscarriages since welcoming her child.\n\nFrank: Paloma Faith revealed she raises her child, two, gender-neutral as she doesn't know 'who they're going to become'\n\nThe Picking Up The Pieces hitmaker has often raised eyebrows with her and partner Leyman Lahcine's decision not to reveal her two-year-old tot's gender or name to the public.\n\nBut, speaking to The Sunday Times magazine, she shared the exact reason why she made the choice and it's all to do with her child's future.\n\nShe said: 'It's just because I don't want information about [my child] out there, because I don't know who they're going to become. If they want to be in the public eye when they get older, then that's their choice'.\n\nThe star stated that she doesn't feel that gender is 'important' and adds that society puts too much significance to a child's gender which leads to children becoming 'indoctrinated'\n\nHeartbreaking losses: The chat also sees Paloma [pictured with boyfriend Leyman Lahcine] tragically reveal that she's had two miscarriages since welcoming her child\n\nPaloma went on to share that her child plays with unisex toys and what ever they grew up to be, whether gay or transgender for example, she would 'embrace it'.\n\nHowever, heartrendingly, she also admitted that following the birth of her baby, she was 'the most sad I've ever been'.\n\nDiscussing the period of depression she endured following the difficult birth that resulted in an emergency Cesarean, she explained: 'The only time I've been really unwell mentally was post-baby. [I felt] alone.\n\n'Something as really wrong with me sand no one guessed... people were just focused on the baby.'\n\nReason: 'It's just because I don't want information about [my child] out there, because I don't know who they're going to become'\n\nPaloma rose to fame with her hit track Stone Cold Sober 10 years ago, with the singer revealing that at the start of her career she had knocked four years off her age.\n\nShe told how she was inspired to do so as everyone was branding fellow warbler KT Tunstall old at aged just 27, but she was later outed by someone who had found her birth certificate.\n\nBut as she admitted in the interview that she didn't mind ageing, it led her to admit that she wants to 'add 10 years' to her 'ability to have children' after suffering two miscarriages since giving birth.\n\nSad: 'But in terms of fertility... if I could add 10 years to my ability to have children I would. I've already had two miscarriages since my child was born'\n\nAfter stating that being older left her more 'emotionally accomplished' in her ability to cope with 'situations', she said: 'But in terms of fertility... if I could add 10 years to my ability to have children I would. I've already had two miscarriages since my child was born.'\n\nBut throughout all the tough times, she's had her French artist beau Leyman, whom she met seven years ago, by her side, of whom she calls her 'best friend'.\n\nAnd though she says it was love at first sight, the Pennyworth actress reveals they have no plans to get married, explaining that their situation makes it feel as though 'everyday is a choice.'", "description": "Paloma Faith, 38, revealed she raises her child, two, gender-neutral as she doesn't know 'who they're going to become' as the singer opened up about her tragic miscarriages for the first time", "authors": ["Niomi Harris For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/16/19658932-0-image-a-43_1570980736120.jpg", "published_at": "2019-10-13"}