{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/25/WS5db25946a310cf3e3557391c.html", "downloaded_at": "2019-10-25 16:24:01.752583+00:00", "title": "Girls to embrace science as weapon against FGM", "language": "en", "text": "By Edith Mutethya in Nairobi, Kenya | China Daily | Updated: 2019-10-25 10:09\n\nA Kenyan company has joined with a United Nations agency and a research organization to offer a program aimed at inspiring African girls to take up science as part of broader efforts to eradicate female genital mutilation.\n\nSome 3 million girls are made to endure FGM each year in Africa. Many die as result of bleeding, infections and, later, from complications during childbirth, according to the African Medical and Research Foundation, or AMREF.\n\nThe procedure involves the partial or total removal of the external female genitalia for cultural or other non-medical reasons.\n\nAgainst this backdrop, Brands and Beyond is working with the UN Population Fund and AMREF to offer what the partners present as an \"FGM-to-STEM\" program, referring to science, technology, engineering and mathematics.\n\nAMREF estimates that more than 100 million girls and women live with the consequences of the mutilating practice. Although it is banned in an increasing number of countries, the procedures are still carried out in many communities.\n\nFrancis Ngomeli, managing director of Brands and Beyond, said the initiative seeks to rescue girls from FGM, as well as from pathways leading to early marriages and teenage pregnancies. Their studies will empower girls to realize their full potential by embracing the STEM program.\n\nThe program is also aimed at \"demystifying the myth that sciences are just for the boys\", and will provide the education materials required to inspire girls in these fields, Ngomeli said.\n\n\"When girls undergo FGM, most likely they don't resume schooling. Among those who do return to school, more than 60 percent fail to attain the pass mark. This is why introducing the STEM program is a great motivator for these girls,\" Ngomeli said.\n\nHe said that as part of efforts to back the program, parents will be encouraged to see the benefits for their daughters from an education in the sciences.\n\n\"The girls will also be able to address some of the major challenges affecting their communities,\" Ngomeli said.\n\n\"We have already rolled out the program in Kenya, Uganda, Tanzania and Ethiopia and we plan to expand to other FGM-prone African countries.\"", "description": "A Kenyan company has joined with a United Nations agency and a research organization to offer a program aimed at inspiring African girls to take up science as part of broader efforts to eradicate female genital mutilation.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/25/5db2a82ba310cf3e97a2fc83.jpeg", "published_at": "2019-10-25"}