{"pub": "businessinsider", "url": "https://pedestrian.tv/entertainment/not-bhed-good-soyze-mick-merhi-15-minutes", "downloaded_at": "2019-09-30 10:48:41.917940+00:00", "title": "The “Not Bhed, Good Soyze” Guy Has Trademarked The Phrase, Confirms He’s Making Bank", "language": "en", "text": "Thirsting for a PEDESTRIAN.TV peak behind the meme curtain? Well, you’re in damn luck, kid, ’cause our new Facebook Watch series 15 Minutes has finally arrived. It’s time to join comedy queen Nina Oyama as she travels around the country to interview those responsible for some of our generation’s most viral names, faces and phrases.\n\nFirst up, Nina visited Mick Merhi, AKA “not bhed good soyze” guy, to catch up on how he’s been adjusting to online fame in the months following the video’s mammoth success.\n\nView this post on Instagram A post shared by B Cardi (@browncardigan) on May 7, 2019 at 3:00pm PDT\n\nDuring the chin-wag, Merhi spoke about embracing the now-iconic phrase after following advice from his mates to capitalise on, rather the fight, the online buzz.\n\n“I tell people, ‘I can’t wait until it dies out,'” he said, “but everyone’s telling me, ‘It ain’t dying out… like, brother, it ain’t dying out, so you better work with it.'”\n\n“I was like, ‘alright, might as well do it’… trademarked it straight away.”\n\nDespite confirming that he’s made considerable bank from his subsequent business moves, the electrician from Western Sydney remains smart about his spendings. “I just keep it aside for important things.”\n\nAs for his next endeavours, he’s keeping all options open – even Dancing with the Stars. “I want to do some samba or something, I don’t care. I’m a thick bitch but I still like to dance.”\n\nA living legend, I say. I’m this close to starting a petition to get Mick on the next season.\n\nCheck out episode 1 below, and catch a new episode of 15 Minutes every Monday at 7pm from September 30 – only on Facebook Watch.", "description": "In our first episode of '15 Minutes', we meet the \"not bhed, good soyze\" creator to talk about life after viral fame. Only on Facebook Watch.", "authors": ["Louis Hanson"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/09/not-bhed-good-soize.png", "published_at": "2019-09-30"}