{"pub": "abcnews", "url": "https://abcnews.go.com/US/service-dog-lucky-alive-suffocating-owners-car/story?id=66469736", "downloaded_at": "2019-10-24 02:32:43.304120+00:00", "title": "Service dog lucky to be alive after nearly suffocating in owner's car", "language": "en", "text": "A service dog in New Jersey is lucky to be alive after she was nearly strangled by her collar -- to the point of passing out -- and had to be rescued by firefighters.\n\nInterested in Animals? Add Animals as an interest to stay up to date on the latest Animals news, video, and analysis from ABC News. Add Interest\n\nDebbie Mazza was driving in Berlin, New Jersey, recently with her puppy, named Ava, traveling in a crate in the back of her car. Ava’s collar got ensnared on her crate, cutting off her breathing, causing the puppy to pass out, according to ABC News’ Philadelphia station WPVI.\n\nMazza, who was given Ava as a service dog after Mazza lost her daughter to melanoma last year, immediately called 911 for assistance.\n\nWPVI\n\n\"When we walked up to the car we noticed that the dog's paw was entangled in the cage,\" said Chief Michael Kernan with the Berlin Borough Fire Company. \"It was in trouble and it was gasping for breath.\"\n\nKernan, along with two others who responded to Mazza’s call, treated the puppy on the scene.\n\n\"I remember saying to one of them...please don't let her die,\" recalled Mazza.\n\nMazza told WPVI that she is incredibly grateful to the first responders for saving Ava's life.\n\nMazza later took Ava to the Berlin Borough Fire Company so she could thank the firefighters in person, and she brought dinner for the firehouse as a thank you.", "description": "A service dog in New Jersey is lucky to be alive after she was strangled so hard by her collar to the point that she passed out and had to be rescued by firefighters.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/dog-1-abc-er-191023_hpMain_16x9_992.jpg", "published_at": "2019-10-23"}