{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3069443&cloc=joongangdaily|home|newslist1", "downloaded_at": "2019-10-25 16:05:14.450545+00:00", "title": "Juul is pulled from shelves after Health Ministry warning", "language": "en", "text": "Juul’s e-cigarette pods being taken away at a GS25 convenience store in central Seoul on Thursday. Just a day after the Health Ministry strongly advised smokers to quit vaping after the first vaping health scare in Korea was reported earlier this month, liquid e-cigarettes have been taken off shelves. [YONHAP]\n\nRetailers pulled liquid e-cigarettes from their shelves, including Juul Lab’s flavored pods, in a pre-emptive move as concern increases about the safety of the products, in particular the risk they present to teenagers.GS25 announced on Thursday that it will halt the sale of thee Juul’s flavors - mango, vanilla creme and fruit - and KT&G’s Siid Tundra a day after the Health Ministry recommended those who are vaping to immediately stop until it can be determined whether the products are harmful to health.Juul’s menthol and tobacco pods will remain for sale, as it is the case in the United States.GS25 explained that the action is intended to protect public health and safety, in line with guidance from the Korean government and U.S. Food and Drug Administration.“The move is comparable to the measures taken in the United States,” said a spokesperson at GS25.“The sales will be discontinued until the authorities release inspection results. We will comply with the rigid standards in terms of the issues related to public health, fulfilling corporate responsibility,” he said.Since 70 percent of cigarette sales are via convenience stores, the decision could deal a huge blow to the U.S.-based e-cigarette company.Juul stopped selling its creme, fruit, berry and mango pods in the United States after a mysterious vaping-related illness spread across the country. Critics also argued that the flavored products lead to widespread teen vaping.The first case of a vaper in Korea having lung problems possibly related to vaping was reported earlier this month.Emart, the large discount supermarket chain, also suspended the sale of liquid e-cigarettes from Viento and RELX. Juul Labs Korea said that it will sit down with the convenience stores to discuss the issue.“We look forward to continued dialogue with GS25 as we work with our retail and trade partners to lead the industry in responsible practice and to help adult smokers find alternatives to combustible cigarettes,” a spokesperson at Juul Labs Korea said.A GS25 spokesperson said that “the discussion is underway, and we will adjust our actions depending on the new information and the outcome of the probe from the government.”Other convenience stores, including CU and 7-Eleven, said that they are still discussing whether to discontinue the sales of vaping products.Health Minister Park Neung-hoo called on the lawmakers to pass a bill aimed at expanding the definition of a cigarette.BY PARK EUN-JEE [park.eunjee@joongang.co.kr]", "description": "", "authors": [], "top_image": "https://pds.joins.com/jmnet/koreajoongangdaily/_data/photo/2019/10/25193040.jpg", "published_at": "2019-10-25"}