{"pub": "politico", "url": "https://politico.eu/article/germany-to-tighten-hate-speech-law-to-fight-far-right-violence", "downloaded_at": "2019-10-30 16:00:52.855971+00:00", "title": "Germany to tighten hate speech law to fight far-right violence", "language": "en", "text": "Sebastian Kahnert/AFP via Getty Images Germany to tighten hate speech law to fight far-right violence New measures will also include tougher rules on gun ownership and increasing funding for deradicalization programs.\n\nBERLIN — The German government is set to beef up the country's online hate speech law as part of a broader set of measures to crack down on right-wing political violence.\n\n\"We're devastated by the most recent events this year,\" German Justice Minister Christine Lambrecht told a news conference Wednesday, referring to the murder of a regional politician by a suspected neo-Nazi in June as well as a shooting rampage outside a synagogue and kebab shop earlier this month, which was streamed online and left two dead.\n\n\"But we can't just stop at being devastated,\" Lambrecht added.\n\nThe measures approved by Chancellor Angela Merkel's government this morning will further toughen up the country's hate speech law known as NetzDG, which was passed two years ago and is considered one of the strictest in the world.\n\nThe new measures will require social media providers to proactively inform law enforcement about illegal content such as death threats or the incitement of hatred on their platforms; currently, they only have to do so once victims have officially filed charges.\n\nAt the same time, German authorities will be granted more rights to demand that platforms disclose information about users who they suspect of committing crimes, such as incitement of hatred.\n\n\"The same rules apply online as in the analog world,\" Lambrecht said. \"That's what we're enforcing by tightening the NetzDG.\"\n\nOther measures to fight far-right violence approved by Berlin include tougher rules on gun ownership and increasing funding for deradicalization programs. The bill must still be approved by parliament.", "description": "New measures will also include tougher rules on gun ownership and increasing funding for deradicalization programs.", "authors": ["Janosch Delcker"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/GettyImages-1172482634-1200x628.jpg", "published_at": "2019-10-30"}