{"pub": "thinkprogress", "url": "https://thinkprogress.org/call-it-the-trump-heat-wave-the-current-scorcher-is-just-a-taste-of-whats-coming-8fa8f1ad6f0f/", "downloaded_at": "2019-09-04 03:48:06.555489+00:00", "title": "Call it the Trump heat wave: The current scorcher is just a taste of what’s coming", "language": "en", "published_at": "2019-07-19", "text": "Most of the country is entering into the first few hours of a blistering heat wave that will extend well into the weekend.\n\nDangerous combinations of high temperatures and humidity will push the “heat index” (what the temperature “feels like”) past 100 degrees Fahrenheit from the Dakotas down to Texas and across to Maine and Florida, an area encompassing well over half of the country’s population.\n\nBut as countless studies have made clear, the kind of extreme heat waves this country, Europe, and elsewhere have been experiencing this summer and last have been made more intense and more likely thanks to human caused global warming.\n\nEven worse, if we fail to significantly curb emissions of carbon pollution — which is the current plan put forth by President Donald Trump’s climate policies — then these severe and deadly heatwaves will become the normal summer weather over the next few decades.\n\nAdvertisement\n\nIn fact, a peer-reviewed study published this week warns that if we don’t reverse emissions trends quickly and sharply, we will see a rise in unprecedented heat waves that will “break” the National Weather Service’s heat index scale.\n\nThe researchers warn we will face extended scorchers more brutal than the United States has ever experienced before. In several decades, parts of Florida and Texas could experience a heat index for five or more months per year exceeding 100 degrees, “with most of these days even surpassing 105 degrees.”\n\nThe administration’s own studies confirm this. Typical five-day heat waves in the U.S. will be 12 degrees warmer by mid-century alone, according to the U.S. National Climate Assessment (NCA), which the White House itself reviewed and approved last November.\n\nOther studies also show the devastating heat-related impacts the nation and the world face from Trump’s policies of abandoning the Paris climate deal, undoing Obama-era climate rules, and boosting carbon pollution.\n\nAdvertisement\n\nFor instance, America (and much of the world) will start seeing monster “humid heat waves” — where the heat index hits a potentially fatal 131 degrees — every other year by century’s end.\n\nHeat wave records have been breaking at an astonishing rate in recent days around the country and around the globe.\n\nWe know that human-caused (anthropogenic) carbon pollution and global warming is now the leading factor driving such records. A 2016 study in Nature Scientific Reports, led by climatologist Michael Mann, concluded, “In summary, our results suggest that the recent record temperature years are roughly 600 to 130,000 times more likely to have occurred under conditions of anthropogenic [climate change] than in its absence.”\n\nThe extreme heat waves in Europe, Asia, and now the U.S. are driven by “persistent (‘stuck’) extreme weather patterns,” as Mann explained to ThinkProgress in an email. His research and others have shown that “a widely meandering, slowed jetstream” favors these stalled weather extremes and that “this pattern is favored by human-caused climate change, giving us more frequent persistent weather extremes like we are seeing right now.”\n\nSo, what about the future?\n\nThe congressionally-mandated NCA — the “authoritative assessment of the science of climate change, with a focus on the United States” — projects under its “higher emissions” scenario a stunning 8 to 10 degrees Fahrenheit average warming over the interior of this country by late in the century.\n\nPROJECTED CHANGES IN ANNUAL AVERAGE TEMPERATURES (2070–2099) WITH STRONG CLIMATE POLICIES (LEFT) AND WITH President Trump's CURRENT POLICIES (RIGHT). CREDIT: NATIONAL CLIMATE ASSESSMENT\n\nBut the NCA also makes clear that temperature extremes rise at an even faster rate than average temperatures.\n\nFor instance, the average temperature over the country is projected to rise about 9 degrees by late in the century (2071-2100) in the high emissions scenario, which is one where the Paris climate agreement fails and climate action stalls.\n\nAdvertisement\n\nBut, also under this scenario, the temperature of the warmest five-day period during a once-in-a-decade heat wave is projected to rise some 12 degrees just by mid-century (2036–2065). So we’ll soon be suffering through even worse heat waves than we are now seeing — and our children will see even more devastating ones.\n\nThe NCA scientists explain that to achieve the low-emissions scenario, not only does every nation — including the United States — have to meet its Paris climate pledge. But, we all also have to keep ratcheting down the targets “with continually increasing ambition” until global emissions of carbon pollution are near zero by century’s end.\n\nCurrent extreme heat waves — and the droughts and wildfires that accompany them — are already wreaking havoc on this country and the world.\n\nTragically, Trump’s policies will make such heat waves simply the normal climate, bringing with it new monster heat waves and catastrophic impacts.", "description": "", "authors": [], "top_image": "https://thinkprogress.org/wp-content/uploads/2019/07/NOAA-Heat-Index.jpeg?w=1199&h=790&crop=1"}