{"pub": "washingtonpost", "url": "https://washingtonpost.com/national/el-paso-shooting-suspect-indicted-by-grand-jury-on-capital-murder-charge/2019/09/18/71fe3634-d703-11e9-86ac-0f250cc91758_story.html", "downloaded_at": "2019-09-18 23:22:52.442343+00:00", "title": "El Paso shooting suspect indicted by grand jury on capital murder charge", "language": "en", "text": "The man accused of killing 22 people at an El Paso Walmart last month has been indicted by a grand jury on a capital murder charge.\n\nPatrick Crusius, 21, was taken into custody not long after the shooting rampage. Police said he confessed to carrying out the Aug. 3 attack and told them he was targeting “Mexicans.”\n\nCrusius was indicted on one count of capital murder of multiple individuals. According to the indictment, which was filed Thursday and released this week, he “intentionally or knowingly” shot all of the people slain that day. The indictment then names each victim of the attack.\n\n[The lives lost in the El Paso shooting]\n\nJaime Esparza, the El Paso County district attorney, announced the indictment Thursday, but authorities said it would be made available only after it was filed with the district clerk’s office and then the case assigned to a specific court.\n\nCourt officials said the document was available late Tuesday night. They also said that the prosecution and defense teams were present when the case was assigned to a court.\n\n\n\nParents, teachers and students mourn during an Aug. 5 memorial service for Javier Amir Rodriguez, 15, one of the 22 people killed in the shooting rampage in El Paso. (Michael Robinson Chavez/The Washington Post)\n\nEsparza previously said he planned to seek the death penalty in the case, highlighting the loss of life and the shooting’s effect on the El Paso community, something his office reiterated after Crusius was indicted.\n\n“The District Attorney’s Office will continue to work hard to ensure that justice is done and is committed to assisting the victims through the judicial process,” his office said in a statement about the indictment.\n\n[Officials call El Paso shooting domestic terrorism]\n\nCrusius is also expected to face federal charges in the case. Federal officials said a day after the shooting that they were investigating it as domestic terrorism and weighing hate-crimes charges.\n\nJohn F. Bash, U.S. attorney for the Western District of Texas, pledged that authorities would “deliver swift and certain justice” in the case.\n\nInvestigators say Crusius wrote a statement posted online before the massacre vilifying immigrants and complaining of a “Hispanic invasion.” Police said he cooperated and answered questions after being taken into custody but did not express any remorse.\n\nAn attorney for Crusius did not immediately respond to a request for comment Wednesday.\n\nCrusius’s family has decried what it called “the destruction Patrick did” and distanced itself from the sentiments expressed in that rambling online statement.\n\nThe El Paso shooting was followed hours later by a mass killing in Dayton, Ohio, during which a gunman killed nine people in a nightlife district and injured dozens before he was killed.\n\nMoore reported from El Paso.", "description": "The indictment states that Patrick Crusius “intentionally or knowingly” killed 22 people in the rampage last month.", "authors": ["Mark Berman", "National News Reporter", "Robert Moore", "September At Pm", "Mark Berman Covers National News For The Washington Post. He Has Been At The Post Since", "Previously Covered Transportation", "Local News.", "Robert Moore Is A Freelance Journalist Based In El Paso."], "top_image": "https://www.washingtonpost.com/resizer/IBi8lEvH9MSDg2FeaL0Z5fzmRsA=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MOMV5QW2GUI6TP5RQSMIONUUOY.jpg", "published_at": "2019-09-18"}