{"pub": "investing.com", "url": "https://ca.investing.com/news/economy/what-happens-in-canada-now-that-trudeau-seems-headed-for-a-minority-government-1988724", "downloaded_at": "2019-10-22 13:43:38.081388+00:00", "title": "What happens in Canada now that Trudeau seems headed for a minority government", "language": "en", "text": "© Reuters. EXPLAINER-What happens in Canada now that Trudeau seems headed for a minority government\n\nOTTAWA, Oct 22 (Reuters) - Canadian Prime Minister Justin Trudeau retained power in an election on Monday, but his Liberals were reduced to a minority, making governing with the rival New Democrats and other left-leaning parties all but certain.\n\nPreliminary results indicated the Liberals won 156 seats in the 338-seat House of Commons, 14 short of a majority. The NDP was on track to win 24 seats.\n\nThe main opposition Conservatives only won 122 seats. Even if they united with every other party, their numbers would still come up short of those of the Liberals and the New Democrats.\n\nTo govern Canada, Trudeau must show he has the confidence of the House of Commons, the elected lower chamber of Parliament.\n\nThere is almost no chance of a formal coalition, in which the New Democrats would serve in a Trudeau cabinet. Canada has only ever had one coalition: in 1917, during World War I.\n\nMost likely is a deal in which the New Democrats back the Liberals in exchange for Trudeau's committing to some of their priorities. The NDP helped keep Liberal minority governments in power from 1972-1974 and in 2005. lost two cabinet ministers, so he must replace them in a formal ceremony presided over by Governor General Julie Payette, the Canada-based representative of the head of state, Queen Elizabeth.\n\nOnce he has a new cabinet he will convene Parliament. This does not have to happen immediately, as the rules dictate legislators only have to meet once a year.\n\nIn 1979, the Conservatives won a minority of seats in June and did not bring Parliament back till October, the longest such gap in Canadian history.\n\nTrudeau's first formal step will be to outline his plans in the so-called Speech from the Throne. He will be brought down if Parliament rejects the speech, but all indications are that he will put include measures to ensure NDP support.", "description": "What happens in Canada now that Trudeau seems headed for a minority government", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEB9H0QE_L.jpg", "published_at": "2019-10-22"}