{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/15/justice-department-awards-nearly-140m-public-safet", "downloaded_at": "2019-10-16 03:58:16.960257+00:00", "title": "Justice Department awards nearly $140M in public safety grants", "language": "en", "text": "The Justice Department awarded nearly $140 million in public safety funding to Michigan and Texas, the department announced Tuesday.\n\nThe department will dole out $122.2 million to help Michigan fight gun, gang, drug and sexual violence. Separately, $16.5 million will go to the Northern District of Texas to fight gangs and provide services to domestic violence victims.\n\nThe Michigan funds will be used to hire and train more law enforcement officers, purchase body-worn cameras, investigate child exploitation cases and address domestic and sexual violence.\n\nMichigan will also use the grant to school violence prevention programs, inmate reentry services, and improve DNA technology to solve crimes.\n\n“Attorney General William Barr is very pleased to make these resources available to the citizens of Michigan who deserve to know that the Department of Justice is doing everything in its power to secure their communities, safeguard their schools and homes and deliver justice on their behalf,” said Katherine T. Sullivan, principal deputy attorney general.\n\nIn the Northern District of Texas, the funds will help law enforcement tackle domestic and sexual violence.\n\n“The Department of Justice is providing well-deserved funding to local law enforcement in North Texas to help further advance the critical efforts of fighting violent crime and serving the victims of abuse,” Mr. Barr said in a statement.\n\nThe awards were made available by the Justice Department’s Office on Violence Against Women, the Office of Justice Programs and Office of Community Oriented Policing Services.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The Justice Department awarded nearly $140 million in public safety funding to Michigan and Texas, the department announced Tuesday.", "authors": ["The Washington Times Http", "Jeff Mordock"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/06/sept._11_saudi_arabia_lawsuits_99797_c0-140-3354-2096_s1200x700.jpg?8896bfdb0a3e95e097190db3c6bf547699529da8", "published_at": "2019-10-15"}