{"pub": "businessinsider", "url": "https://businessinsider.com/softbank-takes-control-of-wework-in-bailout-deal-neumann-out-2019-10", "downloaded_at": "2019-10-22 13:37:07.457030+00:00", "title": "WSJ: SoftBank, WeWork's largest investor, takes control of the embattled office company, with co-founder Adam Neumann stepping down", "language": "en", "text": "WeWork's largest investor, SoftBank, will take control of WeWork, the Wall Street Journal reported Tuesday. The deal will value WeWork at about $8 billion, far less than the $47 billion valuation from SoftBank's January investment.\n\nWeWork's board of directors had two bailout options from SoftBank and JPMorgan. SoftBank's deal reportedly won out.\n\nThe Japanese investor will provide WeWork co-founder Adam Neumann with almost $1.7 billion. He'll step down from the board, where he's currently the chairman, and will receive a $185 million consulting fee as well as a $500 million credit line, per the Wall Street Journal.\n\nThe embattled office company, whose valuation was as high as $47 billion just a few months ago, was set to run out of money next month.\n\nWeWork had planned to raise billions from going public this fall, but its initial public offering was shelved after investors raised questions about its business model and leadership.\n\nFor more WeWork stories, click here.\n\nSoftBank, WeWork's largest investor, is attempting to rescue the embattled office company with a bailout plan reported Tuesday by the Wall Street Journal.\n\nThe deal will value WeWork at about $8 billion, per the Wall Street Journal, far less than the $47 billion valuation from SoftBank's January investment.\n\nThe Japanese investor will provide WeWork co-founder Adam Neumann with almost $1.7 billion. He'll sell nearly $1 billion of stock to SoftBank. Neumann will step down from the board, where he's currently the chairman, and will receive a $185 million consulting fee as well as a $500 million credit line, per the Wall Street Journal. Neumann will maintain a stake in the company and stay on as a board observer – someone who attends board meetings but does not vote.\n\nSee more: Leaked video reveals Adam Neumann told staff earlier this year that his family had 100% control of WeWork and that even in 300 years his descendants would be in control\n\nSoftBank's $1 billion stock purchase will be part of a larger $3 billion tender offer to other employees and investors.\n\nFull details of the deal are not yet clear. Representatives for SoftBank, WeWork, and Neumann did not immediately respond to requests for comment.\n\nReuters reported on Monday that the company would offer WeWork $5 billion in debt; accelerate a $1.5 billion equity commitment slated for next year; and buy $3 billion worth of stock from investors including Neumann. SoftBank would own between 60% and 80% of WeWork.\n\nWeWork earlier this year was in talks to borrow $6 billion from banks, a deal contingent on raising at least $3 billion in a public float. But after the company released its initial-public-offering filing in mid-August, investors, analysts, and the media highlighted problems with its business model, conflicts of interest, and leadership. Six weeks later, WeWork's board of directors ousted the controversial CEO Neumann and replaced him with two co-CEOs, who shelved the IPO indefinitely.\n\nRead more: Sex, tequila, and a tiger: Employees inside Adam Neumann's WeWork talk about the nonstop party to attain a $100 billion dream and the messy reality that tanked it\n\nCo-CEOs' first weeks in office\n\nAfter taking the co-CEO role on September 24, Artie Minson and Sebastian Gunningham immediately turned their attention to rescuing WeWork. They looked to sell some of WeWork's acquisitions and the company's corporate jet; lay off up to a quarter of the company's workforce; wind down noncore businesses like WeGrow, its educational arm; ax members of Neumann's inner circle; and line up billions in funding.\n\nWeWork's seven-member board tapped the directors Bruce Dunlevie and Lew Frankfort to form a two-man committee to evaluate the plans from SoftBank and JPMorgan, Reuters reported. Dunlevie is a general partner at the WeWork investor Benchmark Capital, while Frankfort was the CEO of the handbag company Coach.\n\nThe pair were advised by the investment bank Perella Weinberg Partners and the law firms Skadden, Arps, Slate, Meagher & Flom and Wilson Sonsini Goodrich & Rosati, Reuters said.\n\nRead more: Inside WeWork's troubled $850 million Lord & Taylor building: A tale of outsize ambition, audacious renovations, and now financial worries", "description": "The Japanese investor will give Adam Neumann $1.7 billion. He'll get a $185 million consulting fee and will step down from the board.", "authors": ["Meghan Morris"], "top_image": "https://image.businessinsider.com/5dae31a8cc4a0a73fc22cbc3?width=1200&format=jpeg", "published_at": "2019-10-22"}