{"pub": "businessinsider", "url": "https://businessinsider.com/vegan-meat-vs-real-meat-companies-future-of-food", "downloaded_at": "2019-09-04 00:33:20.021653+00:00", "title": "Why online-meat-delivery startups and imitation-meat brands are simultaneously thriving in today's food world", "language": "en", "published_at": "2019-09-03", "text": "Beyond Meat\n\nAmericans love their beef. According to a report by the USDA, 2019 beef production is expected to reach 27.2 billion pounds, serving all the hungry diners who can't wait to watch a thinly sliced piece of brisket crisp up on the grill, cut into a tender medallion of steak, or bite into a juicy burger.\n\nHowever, the classic love story between consumers and meat is changing, rewritten and challenged by the entrance and growing popularity of vegan food companies. People are paying more attention to nutrition, as well as how their daily behavior — from what they eat to how they dress— affects the health of the planet.\n\nIt can be easy to view the conflict as a simple matter of meat eaters versus plant eaters, but the reality of this tension is more complex and provides fascinating hints at the future of food.\n\nThe riches of plant potential\n\nBeyond Meat, a plant-based \"meat\" available in more than 30,000 locations, including supermarkets like Safeway and Whole Foods and fast food chains like Carl's, Jr., was created in 2009. By the time of its IPO in May 2019, it was valued at $1.5 billion.\n\nBeyond Meat\n\nBeyond Meat is for the new generation of meat eaters. Today, it's more likely that meat eaters, rather than quit cold turkey and become full-time vegetarians and vegans, employ a balanced approach by choosing more plant-based options when possible. As these options become less expensive and more flavorful, the shift to a majority plant-based diet is getting easier.\n\nBeyond Meat's VP of Marketing Will Schafer says, \"Most consumers seeking plant-based options don't have an aversion to meat per se, but rather the health, environmental, and animal welfare baggage that comes with it. By making meat directly from plants, we can have a positive impact in these three areas, thus enabling consumers to have their burger and eat it, too.\"\n\nThe company says its burger patty requires 99% less water, 93% less land, nearly 50% less energy, and 90% fewer greenhouse gas emissions to produce than a traditional beef burger. So it definitely provides some environmental relief, but skeptics of Beyond Meat and close competitor Impossible Foods still want to know: is it as satisfying to eat as real meat?\n\nBoth do look, cook, and taste like meat. To attain this challenging feat, Beyond Meat studied the molecular structure of beef, breaking it down into four main building blocks: protein, fat, trace minerals, and water. It then went out into the plant world to find these building blocks and \"rebuild meat from the ground up,\" without sacrificing taste or texture. Beyond Meat's ingredient list includes pea protein isolate, rice protein, mung bean protein, potato starch, and beet juice extract. Its products (burgers, sausages, ground beef), are also free of GMOs, soy, and gluten.\n\nDaily Harvest\n\nOther companies easing consumers into a diet with more vegetables are doing so with the promise of flavor, color, and convenience. Their food products may not contain meat, but the startups, many of which are choosing meal delivery as their attack strategy, are hoping that they'll be so delicious you'll forget about the absence of meat.\n\nVeestro and Sakara Life put you on organic, 100% plant-based meal plans, and the best part is that the meals are ready to eat. If you lead an active lifestyle and want food to support your fitness goals, you can try Kettlebell Kitchen. Meanwhile, Splendid Spoon and Daily Harvest focus on smoothies and bowls. Clearly, shoppers have the privilege of choice when it comes to how they want to incorporate more plants into their diets.\n\nButcher shop beef, meet the internet\n\nEven as plant-based meat substitutes and plant-centric food brands flood the market, online-meat-delivery businesses are, somewhat surprisingly, thriving.\n\nBrands like Snake River Farms and ButcherBox ship out dry ice-packed boxes of gourmet, high-quality beef (and pork and chicken) to doorsteps, but they're more than a convenient way to get your month's supply of meat. They emphasize that they use sustainable and humane practices throughout the animal life-cycle, such as giving cattle room to roam, allowing them to eat nutritious, natural diets, and abstaining from the use of antibiotics and added hormones. Their approach to the evolving food system is to sell consumers a more responsible type of meat.\n\nThese online-meat-delivery startups appeal to conscious consumers who don't just eat meat blindly. They read labels and care about where their food came from and how it was produced. James Peisker, cofounder of Porter Road, says that many of his customers once got their meat from local sources that had been pushed out by big box stores and the commodity industry, while others \"have taken a hard look behind the curtain of the commodity meat industry (the animal conditions, the extreme use of hormones and antibiotics) and opted out of eating meat until they found Porter Road.\"\n\nPorter Road/Facebook\n\nThe company has experienced 150% growth year over year, and that's without worrying too much about its position in relation to Beyond Meat and Impossible Foods. Peisker believes \"the buzz around Beyond Meat and Impossible shows that consumers are demanding alternatives to commodity meat — we are all in the same market with very different approaches.\"\n\nHe paints the scale, explaining that, \"On one extreme, you have the commodity meat industry with its abundant problems, and on the other, faux meat. Porter Road sits between these two extremes by providing real meat grown by real farmers in a way that respects the animals, the environment, and produces a superior product.\"\n\nCan meat and plants co-exist in our food system?\n\nWhen I asked Beyond Meat and Porter Road their opinions about the future of food, both brought sustainability into the conversation. Peisker says, \"People should absolutely be concerned about their diet's environmental impact. Our simple rule of thumb is to eat less, but better meat.\" Schafer says, \"Demand for meat is growing, but creating it by running plant matter through an animal is inefficient and unsustainable,\" effectively branding all forms of \"real\" meat consumption as somewhat problematic.\n\nThere will always be a diversity of ways we obtain and consume food, but it wouldn't be too far-fetched to say our relationship to meat has become, and will continue to become, more careful and considerate. While plant-based options still pale in comparison to national meat consumption, we're seeing changes in attitudes towards and behaviors surrounding meat consumption.\n\nLearn more about the companies mentioned in this article:\n\nShop Veestro or read our review\n\nShop Kettlebell Kitchen or read our review\n\nShop Splendid Spoon or read our review\n\nShop Daily Harvest or read our review\n\nShop Snake River Farms or read our review\n\nShop ButcherBox or read our review\n\nShop Porter Road or read our review", "description": "Specialty meat companies and plant-based meat substitutes are becoming more popular. Here's how the two industries are thriving simultaneously.", "authors": ["Connie Chen"], "top_image": "https://amp.businessinsider.com/images/5d24cffda17d6c13dd422662-750-375.jpg"}