{"pub": "politico", "url": "https://politico.com/news/2019/10/08/china-tones-down-expectations-ahead-of-us-trade-war-talks-038713", "downloaded_at": "2019-10-08 12:09:04.065820+00:00", "title": "China tones down expectations ahead of U.S. trade war talks", "language": "en", "text": "But on this occasion, which is the 13th round of talks between the two sides, Liu will not carry the title of “special envoy” for President Xi Jinping, an early indication that the 67-year-old vice-premier has not been given any particular instructions from China’s leader.\n\nA source, who has been briefed on preparations for the trade talks, also told the South China Morning Post on condition of anonymity that the Chinese delegation may cut short their stay in Washington, removing the possible chance of the talks extending into Friday evening as the delegation would be expected to head to the airport instead of departing at some point on Saturday.\n\n“The original plan [for the Chinese delegation] was to leave Washington on [October] 12th, but the departure could be moved ahead to the 11th,” the source said. “There’s not much optimism.”\n\nThe two sides remain at odds over what caused the collapse of talks in May, with the U.S. blaming China for reneging on earlier promises at the last minute, while Beijing accused Washington of trying to infringe on Chinese economic sovereignty.\n\nThe atmosphere for the talks this week is set to be particularly tense after U.S. President Donald Trump said on Monday that anything “bad” in China’s handling of the ongoing unrest in Hong Kong could affect the outcome of the talks. China has forcefully and repeatedly demanded that the US stay out of the country’s internal affairs with regard to how it the handles the anti-government protests in Hong Kong.\n\nIn addition, on Monday the U.S. placed 28 Chinese public security bureaus and technology companies on a trade blacklist over Beijing’s treatment of Uygur Muslims and other predominantly Muslim members of ethnic minority groups in Xinjiang.\n\nTo further complicate the situation, Trump has publicly requested that Beijing investigate the business affairs in China of former U.S. Vice President Joe Biden, a current leading Democratic presidential candidate, and his son Hunter.\n\n“Especially for the U.S. side, domestic politics make it hard for the trade talks to really be immune from other problems,” said Louis Kuijs, the head of Asia Economics at Oxford Economics.\n\nUntil this week, Taoran Notes, a social media account affiliated with the official Economic Daily that is used by Beijing to manage public expectations, had been expressing optimism about the result of the trade talk. But on Tuesday, it wrote that the likely result of the talks was a continuation of “talking while fighting.\"\n\n“Some people may ask, if the U.S. raises tariffs further, is it still necessary to continue the talks … the answer is that it’s as necessary to take countermeasures as to continue the talks,” read commentary from Taoran Notes, hinting that China is ready to retaliate if the U.S. goes ahead with a planned tariff increase set to come into force next week.\n\nThe U.S. is scheduled to increase tariffs on US$250 billion worth of Chinese products from 25 percent to 30 percent on Tuesday, having delayed the implementation from last week to avoid clashing with the 70th anniversary of the founding of People’s Republic of China on October 1.\n\nIn addition, the U.S. is threatening to impose a 15 percent tariff on US$160 billion worth of Chinese-made consumer goods on December 15, after a 15 percent levy on US$115 billion worth of such goods took effect on September 1.\n\nKuijs at Oxford Economics said that the US would probably go ahead with the tariff plan on October 15, which would trigger “some retaliation” from China, although he still expects the two countries to reach a small deal to call off the December tariffs.\n\n“The bar for a small deal does not seem to be very high,” he said.\n\nWhile officially demanding that the U.S. withdraw all punitive tariffs, which now cover virtually all Chinese exports, China is continuing to place new orders for U.S. farm products such as soybeans and pork before the talks to pave the way for a possible mini-deal involving China buying American agricultural and energy products.\n\nIn turn, the U.S. would have to agree to postpone or scale back tariffs, sweeping thornier issues such as an enforcement mechanism, structural changes in Chinese intellectual property protections and government industrial subsidies aside at least in the short term.\n\nTrump, though, has said he prefers a comprehensive deal involving all elements rather than a small agreement on relatively easy issues.\n\n“We’ve come this far. We’re doing well. I would much prefer a big deal and I think that’s what we’re shooting for,” Trump said on Monday.\n\nShen Jianguang, a veteran Chinese economy watcher and now the chief economist at JD Digit, said there was still a good chance for the talks in Washington to produce a tariff truce.\n\n“In previous rounds of talks when there were high expectations, a deal was always out of reach; the expectations for this new round of talks are low, but it doesn’t mean there won’t be anything,” Shen said. “It won’t be a comprehensive deal, but a formal truce is likely as both economies are gradually feeling the pain of the trade war.”\n\n\n\n", "description": "", "authors": [], "top_image": "https://static.politico.com/57/27/08f4fdc44b1eb643abde1db62f37/190905-liu-lighthizer-mnuchin-ap-773.jpg", "published_at": "2019-10-08"}