{"pub": "afr", "url": "https://afr.com/property/residential/aqualand-raises-stake-in-mcgrath-tests-takeover-threshold-20191029-p535b8", "downloaded_at": "2019-10-29 07:45:17.399015+00:00", "title": "Aqualand raises stake in McGrath, tests takeover threshold", "language": "en", "text": "Aqualand also has a director on the McGrath board, Wayne Mo.\n\nBut Aqualand denied it had any intention of taking over McGrath after its recent 3.53 per cent acquisition.\n\nUnder ASX, Corporations Act and ASIC rules, any interests in a listed company of more than 20 per cent would trigger a takeover bid.\n\nAqualand chairman Warwick Smith AO, and Mr Mo, who is chief executive of Aqualand's investment arm, AL Capital, said the new investment was a sign of Aqualand's confidence in the McGrath business.\n\n\"This increased strategic investment demonstrates our continued confidence and support for the turnaround progress driven by the McGrath management team, led by chief executive Geoff Lucas and McGrath’s founder, John McGrath,\" Mr Mo said.\n\n\"A takeover was not part of the strategy to increase our investment,\" Mr Smith said.\n\nMr Lucas welcomed the acquisition and said Aqualand's interests signalled the company's \"transformation plan\" was gaining traction.\n\nHe said the company was seeking new opportunities to grow its business following a slowing down in losses and goodwill write-offs.\n\nAdvertisement\n\nMcGrath struggled through 2018 after The Australian Financial Review revealed the company had been operating at a loss in January 2018, following the cooling of the residential market, falling sales commissions and a weak run on the ASX following its listing in 2015.\n\nThe company's share price closed higher at 24¢ on Tuesday, rising from 21.5¢ on Monday, but still a far cry from its IPO price of $2.10.\n\nThis second purchase in McGrath and recent wins at its Barangaroo Central project shows the depth of Aqualand's capital.\n\nThe company bought out both Grocon and Oxford Properties from the Central project to take a stranglehold on Barangaroo's final development.", "description": "Aqualand remains McGrath's second-largest shareholder after founder John McGrath.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.9888%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_84%2C$y_506/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/df0c3ee080d5cd2db9ec3091832d8cbee82b4f68", "published_at": "2019-10-29"}