{"pub": "news24", "url": "https://sport24.co.za/Rugby/RugbyWorldCup2019/bok-ratings-du-toit-de-allende-drove-diesel-charge-20191027", "downloaded_at": "2019-10-27 12:54:19.612591+00:00", "title": "Bok ratings: Du Toit, De Allende drove diesel charge!", "language": "en", "text": "Cape Town – Seventy-four largely unsatisfactory minutes … yet a vitally clinical, urgent final six that arguably (and decisively) amounted to the Springboks’ best period of the World Cup semi-final against Wales in Yokohama.\n\nIt seemed to say so much about the baseline maturity, spirit and resistance to panic at key times that powers the South African national team of 2019, warts and all.\n\nIn grinding out the 19-16 outcome, there could be little doubt that the better – or should we venture “less bad”? – team eventually prevailed, setting up an appealing repeat next Saturday of the 2007 final between the Boks and Eddie Jones’s currently buzzing England.\n\nThe match was cagey, too often mutually sloppy, lacking in rhythm, and almost always shipyard-like industrial.\n\nBut that is a long-time, fairly common feature of knockout international rugby and the majority of Bok supporters will rightly allow their delirium of reaching the showpiece to comfortably enough over-ride their reservations over the manner in which the knife-edge semi was won.\n\nBesides, as pointed out by Bok legend – and Webb Ellis Cup winner against the men in white 12 years ago – Schalk Burger in the SuperSport studio afterwards: “The pressure is completely on (favourites) England … that will suit us to a tee.”\n\nI found it hard to separate notably in-form Damian de Allende, in the backline, and Pieter-Steph du Toit from the punishing pack for the mantle of premier player against Wales, so it is split …\n\nHere’s how I rated the Boks:\n\nWillie le Roux: 4.5\n\nDangerously erratic … heard that one before at this tournament? Linked well once or twice and showed courage in contact, but also guilty of some poor tactical kicks, jittery handling and leaking a slightly needless (duly goaled) penalty for offside play.\n\nS’bu Nkosi: 5.5\n\nPerhaps understandably, the Cheslin Kolbe replacement didn’t look too sharply-versed in current Bok first-team defensive alignment; was caught out a couple of times. Still, he exhibited good leg drive and chasing commitment.\n\nLukhanyo Am: 7\n\nDesperately little ball-in-hand activity on front foot. But another showing marked by his admirable alertness on defence, vigour over the ball at breakdowns and general willingness to help tidy up situations.\n\nDamian de Allende: 8.5\n\nDan Biggar may have recurring nightmares of De Allende roaring toward his channel. High on confidence at present, and a vital, regular source of go-forward for the Boks. He sucks in defenders like under-couch popcorn to a vacuum cleaner, and his strength and conviction were stunningly to the fore as he swatted off three or four red-jerseyed foes for his 57th-minute lone Bok try.\n\nMakazole Mapimpi: 6.5\n\nGot around the park impressively, looking to contribute. Contested grittily in the air, too, even if not always winning the ball back.\n\nHandre Pollard: 6.5\n\nMany of his best strengths currently muzzled by the box-kick-heavy game plan. Far from flawless or fluid in general play, but his place-kicking was importantly right on the button here (100 percent strike rate) and he produced some fine lead-up play to De Allende’s dot-down, including a once trademark, middle-field bust-through.\n\nFaf de Klerk: 6.5\n\nThe array of mixed feelings about what he brings to the party would not have changed in this one. Made his share of overly frantic, unforced errors and some kicks reeked of pot luck. But then there was the good stuff: a key ankle tap on George North, a clever blindside snipe … and a deft touch-finder late in the game that probably, finally broke the collective Welsh spine.\n\nDuane Vermeulen: 8\n\nCometh hours like these, cometh the combative guy. Vermeulen was positively ferocious as a ball-carrier from start to finish: ask Welsh tighthead Tomas Francis, unceremoniously bowled over and forced to exit nursing a rib issue after poor body positioning in trying to halt “Thor”. Unusually turned over once in contact.\n\nPieter-Steph du Toit: 8.5\n\nThe strong-engine blindside flank was especially vibrant in the first half, as Boks set out their physical stall, covering oceans of space and flattening ball-carriers with his no-nonsense tackles (almost 10 before halftime alone). Mobility barely waned throughout game.\n\nSiya Kolisi: 7\n\nSolid workhorse at close quarters. The Bok captain stuck to his task admirably for 69 minutes, making drive-back challenges, one electric charge, and communicating deftly, I felt, with controversial referee Jerome Graces.\n\nLood de Jager: 7.5\n\nProbably the best lock on the park, and only solidifying his reputation as an excellent World Cup player. Always at the fulcrum of the Bok pack effort … plus sound kick-off receipts and clever reading of play when needed.\n\nEben Etzebeth: 6.5\n\nStill we wait for that true, snarling “Eben of old” at the event. But that didn’t mean he wasn’t influential: helped Bok bossing of scrums, steered some maul drives decently and once held up Leigh Halfpenny to force a Bok scrum feed.\n\nFrans Malherbe: 7\n\nAn increasingly compelling tournament as Bok scrum-time anchor. Bossed his duel there with Wyn Jones and continues to up his work-rate in open play.\n\nBongi Mbonambi: 6\n\nWill be irked that Boks surrendered their first lineout of the tournament on half-hour mark, though his throw didn’t seem hugely to blame. Busy and made his tackles … though penalised for one off the ball.\n\nTendai Mtawarira: 6.5\n\nLess conspicuous than usual in general exchanges, though you couldn’t whinge about his scrummaging in a 48-minute shift.\n\nStandout substitute:\n\nVincent Koch: 7\n\nWhile another reserve, Francois Louw, made a manna-from-heaven steal late on, Koch was perhaps the most consistently hard-grafting of all the impact men. Only added to the scrum mastery, and his blond head popped up in plenty of other places.\n\n*Follow our chief writer on Twitter: @RobHouwing", "description": "Sport24", "authors": ["Rob Houwing", "Chief Writer"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7975/d7af819e5f61430e9cc45b65565e54b8.jpg", "published_at": "2019-10-27"}