{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201910148045/foreign-markets-are-caught-in-dollars-web", "downloaded_at": "2019-10-14 23:16:43.426141+00:00", "title": "Foreign Markets Are Caught in Dollar's Web", "language": "en", "text": "By Paul Vigna\n\nThe capital markets and global economy are caught in a feedback loop amplified by U.S. politics and the U.S. dollar. The question is how long investors will suffer.\n\nThe U.S. is embroiled in a trade war with China, President Trump is under an impeachment inquiry, and the 2020 election already looks as bitter as 2016. Those U.S.-centric issues are causing havoc in the markets, driving investors to havens.\n\nBecause the dollar is one of those havens, it is being driven higher, not lower. That's hurting the very investors trying to avoid the pain spreading by U.S. issues in the first place.\n\nThe trade-weighted U.S. Dollar Index hit a record high in early September of 131.58, and one month later is near that level again.\n\nThe dollar is an asset unlike any other for one reason: its position as the world's reserve currency. That makes it the world's pre-eminent mechanism for world trade and foreign exchange.\n\n\"It sits at the center of everything,\" said Lawrence McDonald, who writes the Bear Traps Report.\n\nBecause of that centrality, when investors are feeling uncertain, they tend to flee to the dollar. Usually that isn't a problem. These aren't usual times, though. Uncertainty is in the air, driven by the U.S. itself.\n\n\"The remarkable strength of the dollar in 2019 fits the narrative we all know: fear of global recession caused by a seemingly endless U.S.-China trade conflict,\" said Nicholas Colas, co-founder of DataTrek Research.\n\nThat dollar strength might give President Trump fits and hurt U.S. multinationals, but it also makes dollar-denominated debt more expensive to service in local markets. And it hurts foreign nations importing goods, which feeds inflation. Because the dollar is so central to the markets, though, foreigners currently don't have a choice.\n\nForeign nations have been issuing dollar-denominated debt for decades. But its growth has reached the point, Mr. McDonald said, where the Federal Reserve can't handle monetary policy the way it used to. \"The problem is, the higher the dollar goes, the more it crushes the global economy,\" he said.\n\nThat exact dynamic was cited by Bank of England Gov. Mark Carney in August as a reason to develop an alternative reserve currency, one that would be multinational and even possibly digital, a sort of multi-government-backed bitcoin.\n\nHe's not alone. There's growing reluctance overseas to remaining beholden to U.S. policies at a time when it's hurting economies back home -- and when the U.S. share of global GDP is shrinking.\n\nMr. Carney's idea of a new reserve currency remains years off, if indeed it ever comes. Investors aren't likely to wait that long, though.\n\nThe possibility of a weak trade deal, Mr. McDonald said, along with all the election and impeachment risks in the U.S., will be enough to convince investors that overseas markets are actually a more certain bet than U.S. markets.\n\n\"An overwhelming balance of uncertainty has sailed across the pond,\" he wrote, \"and we must be prepared for a colossal migration of capital in search of certainty.\"\n\nWrite to Paul Vigna at paul.vigna@wsj.com\n\n(END) Dow Jones Newswires\n\nOctober 14, 2019 18:52 ET (22:52 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-14"}