{"pub": "nytimes", "url": "https://nytimes.com/2019/10/15/opinion/ohio-democratic-debate.html", "downloaded_at": "2019-10-15 23:06:32.480846+00:00", "title": "Opinion | Democrats Should Remember How Obama Won Ohio", "language": "en", "text": "I’ve been saying it was a rough summer in Dayton, but in reality, it’s been a rough 30 years. There was a time when the system worked for Dayton and for other midsize cities in the middle of the country. Communities like ours were engines of opportunity for workers and families. Our cities nurtured the American middle class through good-paying jobs that required little more than a solid work ethic and a strong body.\n\nDayton used to be home to numerous Fortune 500 companies. The jobs they offered attracted immigrants from abroad and migrants from Appalachia and the Jim Crow South. Many of them found a city that was too separate and too unequal — a problem that still plagues us — but there was always opportunity here to make a better life.\n\nLess so today. Our economic and political system is no longer built for places like Dayton, even though most of the country is made up of cities like it. People, power and resources are concentrated into fewer and fewer places on the coasts as cities like ours continue to struggle. Those Fortune 500 companies have relocated or consolidated.\n\nIn cities like Dayton, it is too easy to focus on what we no longer have. It is too easy to be held back by our pasts. Too easy to become bitter as faraway politicians make choices that harm our community. Too easy to just say we want to make America great again.\n\nPolitically, this creates a toxic feedback loop. When voters don’t feel engaged or respected, they fail to vote, or worse, they buy into a dangerous, nationalist ideology. Shortsighted political consultants and party leaders see this and write off our state, further feeding into the frustrations of voters.", "description": "The key to success in the state, and across the country, is empathetic leadership that is honest about the struggles we face.", "authors": ["Nan Whaley"], "top_image": "https://static01.nyt.com/images/2019/10/15/opinion/15Whaley1/merlin_158977074_65e9dd23-7525-4eda-b022-21534eccea4e-facebookJumbo.jpg", "published_at": "2019-10-15"}