{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7568957/Phil-Thompson-saved-life-Tony-Cottee-brain-haemorrhage.html", "downloaded_at": "2019-10-13 23:39:09.377121+00:00", "title": "Phil Thompson saved my life: Tony Cottee on his brain haemorrhage", "language": "en", "text": "Tony Cottee jabs the centre of his forehead. This, he says, is where the pain started.\n\nLike we are now, Cottee was in a hotel this summer when his trauma began, a scare which, but for the intervention of ex Liverpool defender Phil Thompson, could have cost him his life.\n\nThe pair were staying in west London and were filming an advert for Sky the following morning.\n\nTony Cottee had a serious health scare this summer, where he had a brain haemorrhage\n\nThe former West Ham, Everton, and Leicester player was rushed to hospital in an ambulance\n\n'I went to my room at 10pm and within five minutes I was suffering the worst headache I've ever had, and then it spread to my neck,' says the former West Ham, Everton and England striker.\n\n'We'd played golf that day and it was 75°F, so I just passed it off as sunstroke, \"All I need is a good sleep\".' At 2.30am, Cottee began vomiting.\n\n'It wasn't right. The pain in my neck was horrific and my head was ready to explode. I knew I was in trouble. I tossed and turned and then rang Thommo. He came down and was like, \"Flippin' heck, look at you\". My eyes were popping out.\n\n'He went to reception and, I didn't know this until later, paid for a doctor to come to the hotel.'\n\nThompson's decision would prove potentially life-saving. The doctor took one look at him and called an ambulance. He suspected meningitis. The paramedics arrived and asked a dazed Cottee what had happened.\n\n'A doctor has just been in, or at least I think he was a doctor,' he told them. 'He gave me a jab in my backside and left'. He is able to smile about it now.\n\nAfter an MRI scan and further tests at West Middlesex Hospital, Cottee was moved to a private room. Talk of 'quarantine' and the sight of staff wearing protective masks did little to reassure him.\n\nIt was the following morning, however, when his condition was escalated to urgent. A review of the scan had revealed a brain haemorrhage.\n\n'The specialist said: 'We need to get you to Charing Cross Hospital - now'. Next thing, I'm in the ambulance with flashing blue lights,' says the 54-year-old, a dad of three.\n\nHe may have lost his life if it weren't for the intervention of friend and colleague Phil Thompson\n\n'It was frightening. I was rushed in for more tests and scans. When I came back up, my wife and daughter were there with Tony Gale and his partner. I could see in their faces they were scared.\n\n'They said, \"You need a brain operation\". I was thinking, \"Oh my God, this is serious\".' To the relief of Cottee, his family and former team-mate Gale, the specialists later determined that surgery was not necessary. They were confident the bleed had passed and was an isolated incident.\n\n'I was so lucky. It could have caused a stroke, an aneurysm, I could have dropped dead. It was a warning. I'd been doing too much.'\n\nAfter six weeks of rest, Cottee returned to work at Sky.\n\n'The first person I saw was Thommo, I gave him the biggest cuddle. It was an emotional moment - and I never thought I'd say that after hugging Phil Thompson!\n\n'I will forever be thankful to him, he was there when I needed him. If I'd stayed in bed all day and tried to ride through it, without that doctor coming, who knows what would have happened.'\n\nCottee scored 214 goals in the Premier League during a stellar career across multiple clubs\n\nCottee leans forward and taps the table and then his head. 'Touch wood, that's the only serious health scare I've had,' he says. That, he then admits, is not entirely true. He remembers a flight back from Amsterdam with West Ham.\n\n'Bloody hell, that was unbelievable. We'd had a fair few drinks the night before and Steve Walford decided he needed to get off the plane, at 30,000 feet!\n\n'He was 'dehydrated' and started turning the door! We all jumped on him, \"What you doing?!\". That could have brought the whole team down.'\n\nThen there was the time Cottee was shot dead on live television, albeit during the 2018 film Final Score.\n\n'The director was a West Ham fan and asked if I'd star as myself, so I went along not knowing what I'd be doing. They said, \"You're gonna get shot\". I'm like \"What?\". They said, \"Yeah, just pretend you've been killed\". This huge fella came in with a gun and started shooting. He was seriously scary but that actually helped with the acting, I was terrified of him!'\n\nTalk turns to legacy, perhaps a natural consequence when exploring the subject of mortality. Cottee needs no encouragement when we suggest that the advent of the Premier League has impacted on his own place in history.\n\n'My goal tally was scratched to zero in 1992!' he says, and he is right to make the point.\n\n'I scored 78 Premier League goals but it was as if the 136 before that didn't count. I still get great pleasure by saying that, since I've retired, only one player has scored more goals than me - Alan Shearer. But it is frustrating, I watch the 'Premier League 100 Club' and I'm not in it.' Cottee prefers the list that has him 17th of the all-time top-flight scorers.\n\nEach of his goals is documented in scrapbooks Cottee has kept since the age of seven\n\n'I was obsessed with goals, to the point I wasn't a good team player. Some managers would accuse me of that. That's fine, but when we've all played rubbish and I score the only goal to win 1-0, who's a good team player then?\n\n'So when you write this put me in the 100 club! In fact, it's the 300 club. I always include my 13 from Malaysia, which takes me to 306!' Each of those goals is documented in the scrapbooks Cottee has kept since the age of seven.\n\n'That's my dad's fault… he was my Sunday team manager and he started it. Line-ups, newspaper cuttings, and I picked it up. But I made the mistake of doing an interview with John Motson when I was at West Ham. He was absolutely purring over it! You can imagine. I'd drawn little stick men illustrating how the goals were scored. I thought, \"Everyone loves football, we all must be doing this?\". Not so. When I got to training the lads hammered me.'\n\nWest Ham, the boyhood club where he made his debut aged 17, finished third in 1986 with Cottee and Frank McAvennie scoring 46 between them.\n\n'On the pitch we clicked, off it we were very different. Frankie had the champagne and page three girls - I won a Fiat Uno for being young player of the year!\n\n'I didn't go out much at that age but I remember stumbling out of Stringfellows at 2am one night and seeing Frankie. \"Had a good night?\" I asked him. \"Tony, I'm just going in!\".'\n\nCottee joined Everton in 1988 for a British record £2.05million. He got lost on his way to Goodison Park ahead of his debut but knew where the net was when he found the ground, scoring a hat-trick against Newcastle, his first goal after just 34 seconds.\n\n'Where do you go from there?' he says. Six years at Everton brought 99 goals but no trophies and, you sense, frustration. 'Right club, wrong time,' he adds.\n\n'The lowest point was when I'd fallen out with Howard Kendall and he put me in the 'A Team', which isn't as grand it sounds - it's the thirds!\n\n'We played Morecambe and as they came running out I thought, 'He looks familiar'. It was my window cleaner! I thought, \"F***ing hell, how has it come to this?\". But I did score the winner.'\n\nCottee won round Kendall and was first choice by the start of the next season, where a summer trip to Switzerland holds one memory of a manager he grew to admire.\n\nCottee also remembers a scary moment on a flight, and when he was 'shot dead' on TV\n\n'Howard took us to this tiny village at the bottom of a mountain - all it had was the hotel, training pitch, pub and brothel. We'd train and get to the pub for 2pm. That shut at 9pm so we went to the brothel. Most of us just went for a drink…\n\n'Pat Nevin and Andy Hinchcliffe stayed in the hotel one night. I was rooming with Pat. He went down for breakfast the next morning. The only three people there were Howard, Pat and Andy. Pat came back up and said, \"You'll never believe what's happened? I've just had a b******ing from Howard for not going out!\".'\n\nCottee returned to West Ham before a year in Malaysia - 'a great holiday' - and then, at 32, Leicester, where he won his only trophy, the League Cup of 2000.\n\n'You talk about legacy, I'm glad I finally got that trophy. But what happened during the summer, it reminds you that you're not invincible. It brings home what is important in life. My twin boys are 21 now, they never ask me about my football, I'm just their dad. I love that.'", "description": "INTERVIEW BY CRAIG HOPE: Tony Cottee jabs the centre of his forehead. This, he says, is where the pain started. He suffered a brain haemorrhage, and could've died if not for Phil Thompson.", "authors": ["Craig Hope For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/21/19664884-0-image-a-25_1570997676230.jpg", "published_at": "2019-10-13"}