{"pub": "marketwatch", "title": "The chief barrier to a trade-war induced economic shock is the best labor market in years", "url": "https://marketwatch.com/story/the-chief-barrier-to-a-trade-war-induced-economic-shock-is-the-best-labor-market-in-years-2019-08-31?mod=hp_econ", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:08:49.604029+00:00", "text": "Getty Images Happy Labor Day, all right. The strongest U.S. labor market in decades is powering the economy and limiting the damage from a trade war with China.\n\nThe one thing no one really has to worry about right now as Americans celebrate the “Labor Day” holiday is, well, the labor market itself.\n\nJob openings are plentiful. Incomes are rising. And layoffs and unemployment are near a 50-year low.\n\nThe strong labor market has become the bedrock of a U.S. economic expansion that recently entered its 11th year. It’s also the glue holding the economy together as a series of recent convulsions try to tug it apart: A worsening trade war with China, a spreading manufacturing malaise, weaker U.S. exports and faltering global growth.\n\nRead: China trade war drags consumer sentiment down to the lowest level in three years\n\nAlso: Trump faults companies over management as tariffs set to take effect\n\nYet after a decade of economic expansion that’s created tens of millions of new jobs, hiring was bound to slow. The number of jobs created each month this year has dwindled to an average of 165,000 from 223,000 in 2018 — and even those numbers might be exaggerated.\n\nLast week the Labor Department said about 500,000 fewer new jobs were created as of last March compared to the government’s earlier estimates. The agency drew its conclusion after examining the latest tax records. Updated employment figures will be unveiled early next year.\n\nRead: U.S. created 500,000 fewer jobs since 2018 than previously reported\n\nWhatever the case, the pace of hiring each month is unlikely to mimic the 200,000-plus gains that prevailed from 2013 to 2018. It’s not just all the rising economic headwinds, either. Companies simply can’t find enough skilled workers to fill all the open jobs the already have.\n\nIn August, Wall Street forecasts a 163,000 increase in new jobs, similar to the gain in July. The unemployment rate is likely to hold at 3.7%, just a tick above a half-century low. And wage growth is expected to continue to run above 3% a year — good but not great.\n\n“Look for a 160,000 increase in August, with strength led by the services sector, while manufacturing acts as a caboose,” economists at BMO Capital Markets wrote to clients.\n\nIn short, no big cracks in the bedrock of the economy.\n\nRead: Consumer spending surges in July and low inflation paves way for Fed to cut rates\n\nSome of the “soil” above the bedrock, however, is likely to show lots of erosion.\n\nSee: MarketWatch Economic Calendar\n\nTake manufacturing. A closely followed survey of senior industry executives compiled by ISM has fallen for four straight months to a three-year low. Don’t expect much improvement in the ISM’s August survey, either.\n\n“Industrial production continues to flounder amidst the dour global trade environment,” said senior economist Andrew Grantham of CIBC World Markets.\n\nRead: Trump is already painting the Fed as the scapegoat if the economy tanks\n\nThe trade deficit, meanwhile, is forecast to decline in July, but make no mistake. The trade gap is sky-high and will remain so for the foreseeable future regardless of how the spat with China turns out.\n\nSince the U.S. economy is stronger than most other major economies, Americans can afford to buy more imported goods. At the same time, a strong dollar and a weaker global economy have crimped U.S. exports.\n\nThe direction of a more insular American economy less dependent on trade, however, is still mostly determined by what goes on in America itself.\n\nSo long as businesses maintain current employment levels and labor to avoid layoffs, the U.S. economy is likely to skirt the dangers of recession.\n\n", "description": "In economically anxious times, the one thing no one really has to worry about right now as Americans celebrate the “Labor Day” holiday is the labor market...", "authors": ["Jeffry Bartash"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ509_labor__ZG_20190830145710.jpg"}