{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-exxon-mobil-lawsuit/former-exxon-chief-rex-tillerson-testifies-in-climate-change-fraud-trial-idUKKBN1X91KB", "downloaded_at": "2019-10-30 14:32:39.734640+00:00", "title": "Former Exxon chief Rex Tillerson testifies in climate change fraud trial", "language": "en", "text": "NEW YORK (Reuters) - Former Exxon Mobil Corp (XOM.N) Chief Executive Rex Tillerson took the witness stand in Manhattan state court on Wednesday to testify in a closely watched civil lawsuit accusing the company of hiding the true cost of climate change from investors.\n\nFormer Exxon Mobil CEO and former U.S. Secretary of State Rex Tillerson arrives at New York State Supreme Court as an Exxon witness to testify as part of a trial in a lawsuit by New York's attorney general accusing the oil company of misleading investors about the risks of climate change regulations to its business in Manhattan, New York, U.S., October 30, 2019. REUTERS/Mike Segar\n\nThe case, which kicked off last week, is the first of several lawsuits pending against major oil companies related to climate change to go to trial.\n\nThe lawsuit, brought by New York’s attorney general, alleges that Exxon falsely told investors it had properly evaluated the impact of future climate regulations on its business using a “proxy cost” of up to $80 per ton of carbon emissions, but internally used figures as low as $40 per ton or none at all.\n\nIt says Exxon caused investors to lose up to $1.6 billion.\n\nExxon has assailed the claims as false and politically motivated.\n\nIn his opening statement, Theodore Wells, a lawyer for the company, said that after Tillerson became CEO in 2006, the company put in place a “robust system” to manage the risk of increasing climate change. Tillerson served as Exxon CEO from 2006 to 2017, and U.S. secretary of state under President Donald Trump from 2017 to 2018.\n\nWells said the $80 per ton proxy cost represented a “global,” “macro-level” assessment of the cost, while lower figures, known as greenhouse gas or GHG costs, were used for particular capital projects depending on circumstances. He said Exxon never told investors the two numbers were the same.\n\nLast Thursday, just two days after the New York trial began, Massachusetts filed a similar lawsuit accusing Exxon of misleading investors and consumers for decades about the role fossil fuels play in climate change.\n\nBoth Massachusetts and New York began investigating Exxon after news reports in 2015 saying its own scientists had determined that fossil fuel combustion must be reduced to mitigate the impact of climate change.\n\nThose reports, by InsideClimate News and the Los Angeles Times, were based on documents from the 1970s and 1980s. Exxon said the documents were not inconsistent with its public positions.\n\nExxon and other oil companies including BP Plc (BP.L), Chevron Corp (CVX.N) and Royal Dutch Shell Plc (RDSa.L) face lawsuits by cities and counties across the United States seeking funds to pay for seawalls and other infrastructure to guard against rising sea levels brought on by climate change.\n\nThe companies have said in court filings that they cannot be held liable for climate change.", "description": "Former Exxon Mobil Corp Chief Executive Rex Tillerson took the witness stand in Manhattan state court on Wednesday to testify in a closely watched civil lawsuit accusing the company of hiding the true cost of climate change from investors.", "authors": ["Brendan Pierson", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191030&t=2&i=1446533778&w=1200&r=LYNXMPEF9T13Y", "published_at": "2019-10-30"}