{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/cricket/article-6100579/GLENN-McGRATH-Jimmy-Anderson-past-never-beaten.html", "downloaded_at": "2019-10-05 07:16:18.308030+00:00", "title": "GLENN McGRATH: When Jimmy Anderson is past me he will never be beaten", "language": "en", "text": "Jimmy Anderson deserves everything he gets, and even though he is an Englishman I will be delighted for him when he goes past my record and becomes the most prolific fast bowler in Test history.\n\nJimmy stands just six wickets away from my tally of 563 so it is only a matter of time now before he gets there — he should do it this week in the fourth Test at Southampton — and I will be getting in touch with him as soon as he does to say well done.\n\nI have an awful lot of respect for Jimmy. Good luck to him. I believe once he goes past me he will never be beaten.\n\nJimmy Anderson can continue to break record and excite the cricketing world as usually does\n\nRecords are nice and I've been very proud to have taken more wickets than any fast bowler in Test history, but any high is there to be beaten and I will be equally proud of Jimmy when he goes past me because the fast bowlers' union has to stick together, whichever country we come from.\n\nAnderson has been an incredible performer for such a long time and he has played far more Tests, 141, than any fast bowler in history, so his record speaks for itself.\n\nBeing a fast bowler is the toughest job in the game and people do not see the hard work off the field that goes into spending as much time at the top as Jimmy has. We put ourselves through a lot more pain than anyone else.\n\nAnderson celebrates after dismissing India's Hardik Pandya in the third Test at Trent Bridge\n\nSo for Anderson to still be at the top of his game after 15 years in international cricket and with so many overs under his belt just shows his work ethic and his physical and mental strength.\n\nRecovery and preparation are so important and you have to dig so deep and really want it to carry on going at the highest level as Jimmy is doing.\n\nOn his day when conditions are in his favour, and we saw one of those days at Lord's in the second Test against India, he is unplayable and to be at the very top at 36 with all those miles on the clock is incredible.\n\nWhen the ball is swinging he's as good as anyone out there, but when it isn't he comes back towards the pack a little bit. That was certainly the case early in his career but he's developed his skills as he's gone on and become much more effective overseas.\n\nAnderson at full flight can really do some damage and hasn't stopped just yet either\n\nStuart Broad and Anderson are two bowlers who have the ability to take wickets for England\n\nWhen Jimmy plays at home with the Dukes ball he's second to none, but he has had to learn how to operate overseas with the Kookaburra ball that, to me, is not nearly as good to bowl with. It took him a while but he's done that now.\n\nI've always said Jimmy was class, ever since I played against him in what became my last Test series in 2006-07. I noted how he swung the ball both ways conventionally, because it's a real art form. Not many have been able to do that. I can only really think of Wasim Akram, who is another great of the game, who could do that as skilfully.\n\nAnderson just keeps on going. Look at the last Test at Trent Bridge. He bowled just one ball short of 26 overs in the first innings and then 22 in the second.\n\nOnce Jimmy goes past me it will be interesting to see where he wants to set the bar. With the nature of the game these days, and the amount of Twenty20 cricket, I believe no fast bowler will ever go past him.\n\nI'm still very much hoping Test cricket will continue to be held in high regard by all young cricketers but will they be able to play the amount of games necessary and put in the effort required to go past Jimmy? I don't think so.\n\nI hear Trevor Bayliss says Jimmy could play Test cricket until he's 40. Well, I'm not sure how keen he will be on that but there's no reason why he can't go on for some time yet if he still has that passion and drive.\n\nHe looks in fantastic shape, running around like a young fella, and hasn't put on any weight. He is clearly as hungry and strong as ever. The fact that Trevor would even suggest reaching 40 and still playing is a big compliment.\n\nMcGrath rated Anderson ever since they faced each other in the 2006-07 Ashes series\n\nI always wondered if I would know the right time to retire. After that first Ashes Test in Brisbane in 2006 I had no intention of stopping. I was still focused and wanted a thousand international wickets. I was still driven.\n\nThen I went home after that match, went to bed, woke up and it just wasn't important to me any more. It hit me just like that and I retired from Test cricket at the end of that series after 124 games. I knew it was time to hang the boots up.\n\nMaybe that will happen with Jimmy but there's not much sign of it yet. And with the way he's going it will be up to him to decide how long he goes on for. I can't imagine any selector being daft enough to call time on him!\n\nI was fortunate to go out on my terms while still at the top but a lot of people are not so lucky. When the time comes for Jimmy we will all be able to celebrate just how good he was because we won't see his like again.\n\nSo can Anderson get somewhere close to the three great spinners above me in the all-time wickets table? I reckon that once he's knocked my tally off the next goal will be 600 wickets and that would be an incredible feat.\n\nThen you have Anil Kumble on 619 which is feasible but I'm not sure how close Jimmy can get to Shane Warne on 708 or Muttiah Muralitharan on 800. Even someone as great as Anderson will find that a bit of a struggle!\n\nFrom one fast bowler to another, even though you're from England, Jimmy, I salute you. Good on ya mate. I hope there are many more wickets to come.\n\nGlenn McGrath was talking to Sportsmail's Paul Newman", "description": "GLENN McGRATH: Jimmy Anderson deserves everything he gets and even though he is an Englishman I will be delighted for him when he goes past my record for wickets taken.", "authors": ["Glenn Mcgrath For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/i/newpix/2018/08/26/22/4F6C5DB100000578-0-image-a-107_1535317204878.jpg", "published_at": "2018-08-26"}