{"pub": "americanconservative", "url": "https://theamericanconservative.com/larison/most-americans-blame-trump-for-the-crisis-with-iran", "downloaded_at": "2019-10-23 15:54:57.745061+00:00", "title": "Most Americans Blame Trump for the Crisis with Iran", "language": "en", "text": "A survey conducted for the Brookings Institution found that most Americans believe the Trump administration’s decisions to renege on the JCPOA and reimpose sanctions were responsible for the flare-up in tensions between Iran and the U.S. this year:\n\n22% of respondents (31% of Republicans) point to the nature of the Iranian regime as the main factor behind escalation in the Gulf, and only 5% blame the Yemen war. A majority, including a majority of Republicans, blame actions by the Trump administration. https://t.co/AMnOMKAgr9 pic.twitter.com/qdIaaw2Hpj — Brookings FP (@BrookingsFP) October 22, 2019\n\nMost Americans blame Trump for the crisis with Iran, and they correctly identify the causes of the crisis:\n\nA majority, including a majority of Republicans, blame actions by the Trump administration: either the Trump administration’s withdrawal from the Iran nuclear deal (35%) or on the imposition of new sanctions on Tehran (34%). Among Republicans, 40% blame the imposition of new Iran sanctions, while 20% blame the withdrawal from the nuclear deal.\n\nThere is a straight line running from Trump’s provocative actions to the increased tensions and escalation that we have seen in the Persian Gulf. Regardless of political affiliation, most Americans can see that Trump’s Iran policy has made things worse. That’s why most Americans also disapprove of that policy. The survey found that most Americans already disapproved of Trump’s handling of Iran before the September attacks on Saudi oil facilities, and that disapproval increased in the wake of the attacks. Before the attacks, disapproval stood at 51% and after them it went up to 57%. Approval decreased from 44% to 39%. More Americans are beginning to realize that this policy has made war with Iran more likely.\n\nThat is bound to be unpopular because an overwhelming majority of Americans doesn’t want war with Iran. According to the survey, three quarters of respondents say that the U.S. must rely on other means short of war, and there is virtually no change in that view before or after the attacks. When asked a follow-up question about Iranian responsibility for the attacks, there is still very little support for military action. The survey asked, “If sufficient evidence emerges that Iran is responsible, should the U.S. consider a military action in response?” Two-thirds still reject military action even if Iran’s responsibility were confirmed. It is not surprising that most Americans don’t want to go to war for the sake of the Saudis, but it is encouraging to see more proof of just how unpopular that would be.", "description": "", "authors": ["Daniel Larison"], "top_image": "https://www.theamericanconservative.com/wp-content/uploads/2018/09/trump-rouhani.png", "published_at": "2019-10-23"}