{"pub": "businessinsider", "url": "https://businesstimes.com.sg/government-economy/hong-kong-protesters-appeal-to-merkel-before-china-visit ", "downloaded_at": "2019-09-03 23:43:52.607515+00:00", "title": "Hong Kong protesters appeal to Merkel before China visit", "language": "en", "published_at": "2019-09-03", "text": "Hong Kong protest leaders on Wednesday appealed to German Chancellor Angela Merkel to support their push for democracy when she visits China this week.\n\n[BERLIN] Hong Kong protest leaders on Wednesday appealed to German Chancellor Angela Merkel to support their push for democracy when she visits China this week.\n\nProminent movement leader Joshua Wong and others recalled in an open letter published by top-selling Bild daily that Merkel grew up in the communist police state of East Germany.\n\n\"You have first-hand experience of the terrors of a dictatorial government,\" wrote Mr Wong, who was temporarily arrested last week over the protests, and others.\n\n\"The Germans courageously stood at the forefront of the fight against authoritarianism during the 80s,\" they wrote, stressing that they share the same democratic principles.\n\nsentifi.com Market voices on:\n\n\"We hope that you will express your concern about our catastrophic situation and that you will convey our demands to the Chinese government during your stay in China.\"\n\nThey also warned that \"Germany should be on its guard before doing business with China, as China does not comply with international law and has repeatedly broken its promises\".\n\nDr Merkel on Thursday starts a three-day trip to China, a major trade partner of the biggest EU economy, with a large business delegation in tow.\n\nHong Kong has endured dozens of sometimes violent pro-democracy protests triggered by opposition to Chief Executive Carrie Lam's bid to push through a law allowing extraditions to mainland China.\n\nThe protests have evolved into a wider democracy campaign involving clashes between protesters and police, in the biggest challenge to China's rule of Hong Kong since its 1997 handover from the British.\n\nChina has responded by ramping up threats and intimidation, including by warning its security forces could intervene.\n\nThe authors - Wong and the Hongkongers in Germany Concern Group - argued that they face \"a dictatorial regime\" applying violent measures \"with a tendency towards a new massacre such as that in Tiananmen Square.\"\n\nAFP", "description": ": THE BUSINESS TIMES Government & Economy - [BERLIN] Hong Kong protest leaders on Wednesday appealed to German Chancellor Angela Merkel to support their push for democracy when she visits China this week. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/09/04/nz_merkel_040949.jpg?itok=jV2qpklk"}