{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/mlb/the-world-series-showcases-baseballs-best-and-these-starting-rotations-are-worthy-of-the-stage/2019/10/21/eed7fe7a-f435-11e9-8cf0-4cc99f74d127_story.html", "downloaded_at": "2019-10-22 13:23:00.157125+00:00", "title": "The World Series showcases baseball’s best, and these starting rotations are worthy of the stage", "language": "en", "text": "It is Gerrit Cole for the Houston Astros against Max Scherzer of the Washington Nationals, a matchup worthy of the moment. Funny thing: You could argue the opposing pitchers in Game 2 are more intriguing. However you look at it, in this series, start with the starters.\n\n“It’s the best starting pitchers in baseball,” Nationals pitching coach Paul Menhart said. “Arguably, what? Six out of the top 10 in baseball? It’s a pitcher’s and pitching coach’s and a pitching-loving individual’s dream to see these types of matchups.”\n\nAD\n\nAD\n\nThis World Series could tip on a late-inning at-bat off an overmatched reliever — for either side. It could be defined by an offensive MVP candidate in third basemen Anthony Rendon of the Nationals or Alex Bregman of the Astros.\n\nBut its tenor and its credentials are based on starting pitching. You can have the Dodgers and their trio of Clayton Kershaw, Hyun-Jin Ryu and Walker Buehler. (Well, you can take them, but it would have to be at the golf course, because their season ended weeks ago.) I’ll take Houston’s top three of Cole, Justin Verlander and Zack Greinke against the Nats’ top trio of Scherzer, Stephen Strasburg and Patrick Corbin — which, of course, leaves off the right-hander who was last seen taking a no-hitter into the eighth inning, Aníbal Sánchez.\n\nStart your World Series with Cole vs. Scherzer on Tuesday, and have it backed up with Verlander vs. Strasburg on Wednesday? Yes, please.\n\nAD\n\nAD\n\n“If you want to do well against the Nats, you’ve got to beat their starters and then make them make decisions as the game goes on,” Astros Manager A.J. Hinch said Monday. “If you sit back and kind of wait for the bullpen or wait for them to make a decision, you’ll look at Strasburg and Scherzer throwing 120, 130 pitches and you’ll be too deep in the game to make up a difference. Those guys getting 21, 24, 27 outs is a real possibility for them. And that makes it tough either way.”\n\nThe numbers are a little staggering. Cole will win the American League’s Cy Young Award — unless Verlander does. Cole led all of baseball in wins above replacement for pitchers, according to FanGraphs — trailed by Scherzer (fourth), Verlander (fifth), Strasburg (seventh), Greinke (ninth) and Corbin (13th). Cole, Verlander, Greinke and Scherzer rank in the top 10 in ERA, walks plus hits per innings pitched (WHIP) and fielding independent pitching (FIP).\n\n“It says a lot about the state of the game of baseball that your two best rotations are here,” Verlander said.\n\nAD\n\nAD\n\nWhen you get to the World Series, it’s easy to retroactively fit a narrative onto what played out, a bogus game of because-this-then-that. But in this case, two clubs that focused on the acquisition of starting pitching are here because of it, and that’s indisputable.\n\nThe Nationals prioritized starting pitching going back to the days when they made Strasburg the top pick of the draft in 2009. The biggest contracts they have issued in free agency have been to Scherzer (seven years, $210 million) and Corbin (six years, $140 million). Throw in the $175 million extension to Strasburg and the two-year, $19 million deal to Sánchez this year, and Washington has its starters under contracts worth $544 million — which sounds less like a baseball payroll number than a gross domestic product.\n\nThe Astros go about evaluation in almost an entirely different way than the Nats, yet they have ended up prioritizing the same position. Their run to the 2017 World Series title was buoyed by the August addition of Verlander via trade with Detroit, and they rocked baseball by making Greinke the most significant addition at this summer’s trade deadline in a deal with Arizona. In between, they made a trade with Pittsburgh for Cole before the 2018 season.\n\nAD\n\nAD\n\n“I personally am a big fan of starting pitching,” Cole said. “I grew up wanting to become a starting pitcher, and I’m a starting pitcher now. And there are a lot of really good starting pitchers on the other side of the field, guys that kind of emulate the role in terms of longevity, durability, creativeness, tenacity, grit.”\n\nSo, here you have them, the rotations that led the National and American leagues in WAR, that ranked second in each league in innings, that struck out more batters than any other. And in the postseason, they have not deviated — not much, at least.\n\nWe have endured an era in which teams make entire postseason games about matchups — using a reliever for five outs, then another for four, piecing the game together. Yes, the Astros turned to a “bullpen game” for their clinching victory over the New York Yankees in the AL Championship Series, and that remains a possibility later in this series. But these two teams have played 21 postseason games between them. Their starting pitchers have completed at least six innings in 14 of them, at least seven in nine.\n\nAD\n\nAD\n\nThat’s supposed to be hard this time of year.\n\n“It’s going to be really hard, especially against this team,” Menhart said. “They’re very, very disciplined. They don’t chase out of the zone very much. If our guys can make balls look like strikes, like they’ve been doing through the majority of the year, you’ll see that chase number go up. But we’re going to challenge them. We have to.”\n\nThe challenge will be for the hitters, particularly in these first two games here. Cole has allowed hitters a .132 batting average this postseason; Scherzer is at .134. The following night, hitters can lick their chops, because Verlander’s and Strasburg’s numbers shoot all the way up to .205 and .220, respectively. Those four pitchers, over the course of this month, have a 1.97 ERA with 121 strikeouts and just 25 walks (Strasburg has just one) in 87 innings.\n\nAD\n\nAD\n\nSo settle in for this World Series to come. The starters certainly will.\n\nFor more by Barry Svrluga, visit washingtonpost.com/svrluga.\n\nRead more on the Nationals:\n\nAD", "description": "The Nationals and Astros feature several of the best starting pitchers in the majors, and they will all be on display in the Fall Classic.", "authors": ["Barry Svrluga", "Sports Columnist With Beat Writing Experience On Baseball", "Golf", "The Nfl", "College Basketball", "College Football", "Sports Columnist"], "top_image": "https://www.washingtonpost.com/resizer/oeeXv3antmP0Ric3NtOyiWGRz1E=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/27A5GLXUMEI6TDHQJTEZ65GRE4.jpg", "published_at": "2019-10-21"}