{"pub": "japantoday", "url": "https://japantoday.com/category/features/new-products/studio-ghibli-scarves-gloves-and-bags-will-keep-you-warm-this-winter", "downloaded_at": "2019-10-15 23:06:32.992239+00:00", "title": "Studio Ghibli scarves, gloves and bags will keep you warm this winter", "language": "en", "text": "By Oona McGee, SoraNews24\n\nJapan’s Donguri Kyowakoku (“Acorn Republic”) is famous for being the official merchandise retail chain for anime powerhouse Studio Ghibli, and every season they come out with something new and exciting for fans.\n\nNow, as we head into the cooler months of autumn and winter, Donguri Kyowakoku has just announced two new product ranges to keep us cosy until spring, and this year we’ll be cozying up to characters from hit Ghibli films like \"My Neighbour Totoro,\" \"Kiki’s Delivery Service\" and \"Howl’s Moving Castle.\"\n\nThe first collection features a number of large stoles for adults, each retailing for 4,500 yen plus tax.\n\n▼ There’s a gorgeous plaid design featuring Soot Sprites and Totoros out in the snow.\n\nSome of the motifs from \"Howl’s Moving Castle,\" including Turnip-Head the cursed scarecrow, appear on an Argyle Plaid stole, with Howl’s Fire Demon Calcifer doing his best to keep the stole’s wearer nice and warm.\n\nBlack cat Jiji from \"Kiki’s Delivery Service\" turns as white as his feline girlfriend Lily, who’s a little shorter and fluffier than her boyfriend, on this red check design.\n\n▼ The stoles can be worn as a scarf or buttoned up like a long poncho.\n\nRounding off the collection are two furry pouches in honor of Totoro and the Catbus from \"My Neighbour Totoro,\" each with a cuddly tail to help you feel all snug and cozy while you hold it.\n\n▼ Both designs retail for 2,300 yen each.\n\nAdults aren’t the only ones to get all the Ghibli fun this season, as Donguri Kyowakoku will also be releasing a range aimed at children. This collection will keep necks, heads and hands covered with the help of some famous \"My Neighbour Totoro\" characters.\n\n▼ There’s the Hide-and-Seek Soot Sprite Hat for 2,200 yen, which measures 52-56 centimeters in circumference.\n\n▼ The Hide-and-Seek Soot Sprite Scarf for 2,300 yen (13 centimeters by 106 centimeters)\n\nThe Hide-and-Seek Soot Sprite Gloves for 2,000 yen (8 centimeters wide and 19 centimeters long)\n\n▼ There’s also a Catbus Drawstring Purse for 1,600 yen (14 centimeters by 13 centimeters).\n\n▼ And the pièce de résistance, the Catbus Scarf for 2,300 yen (13 centimeters by 98 centimeters).\n\nAll these new items are available to purchase online and in-store at Donguri Kyowakoku branches around the country from this month.\n\nSources: PR Times\n\nRead more stories from SoraNews24.\n\n-- Studio Ghibli anime films get American comic book style update with new glassware collection\n\n-- Studio Ghibli releases line of coasters, makes us reach for our wallets\n\n-- You can now drive Totoro’s Catbus with this awesome new item from the Ghibli specialty shop【Vid】\n\nExternal Link\n\nhttps://soranews24.com/2019/10/10/studio-ghibli-scarves-gloves-and-bags-will-keep-you-warm-this-fall-and-winter/\n\n© SoraNews24", "description": "Japan’s Donguri Kyowakoku (“Acorn Republic”) is famous for being the official merchandise retail chain for anime powerhouse Studio Ghibli, and every season they come out with something new and exciting for fans. Now, as we head into the cooler months of autumn and winter, Donguri Kyowakoku has just announced two new product ranges to keep us cosy…", "authors": [], "top_image": "https://japantoday-asset.scdn3.secure.raxcdn.com/img/store/75/0c/202096a04d8fdd85f2c12e1909714b7445cb/studio-ghibli-japan-anime-merchandise-my-neighbor-totoro-jiji-kikis-delivery-service-howls-moving-castle-catbus-scarf-mittens-fall-autumn-winter-goods-accessories-cute-shop-buy-ranking-h-21.jpg", "published_at": "2019-10-15"}