{"pub": "reuters", "url": "https://reuters.com/article/us-usa-opioid-lawsuits/several-states-wary-of-48-billion-opioid-settlement-proposal-idUSKBN1X315P", "downloaded_at": "2019-10-24 14:14:51.941908+00:00", "title": "Several states wary of $48 billion opioid settlement proposal", "language": "en", "text": "(Reuters) - Several U.S. states that have been ravaged by the opioid epidemic are pushing back on a proposed $48 billion settlement framework that would resolve thousands of lawsuits against five drug companies accused of fueling the addiction crisis.\n\nFILE PHOTO - Cataldo Ambulance medics and EMTs, along with firefighters, revive a man in his 40's who was found unresponsive after overdosing on an opioid in the Boston suburb of Salem, Massachusetts, U.S., August 9, 2017. REUTERS/Brian Snyder\n\nThe proposal would bring an end to all opioid litigation against AmerisourceBergen Corp(ABC.N), Cardinal Health Inc(CAH.N) and McKesson Corp(MCK.N), drugmaker Teva Pharmaceutical Industries Inc(TEVA.TA)(TEVA.N), and Johnson & JohnsonJNJ.J.\n\nThe companies have proposed paying $22.25 billion cash mostly over 18 years, while services and drugs to treat addiction valued at $26 billion by the companies would be provided over the coming decade, mostly by Teva.\n\nOfficials in states such as Ohio, New Hampshire and West Virginia — all hard hit by the deadly drug addition crisis — voiced concerns about the proposal.\n\nJames Boffetti, the associate attorney general for New Hampshire, said in an interview he was troubled that payments were stretched over many years.\n\n“The concern is, I think, the states need money now to create the infrastructure for treatment,” he said.\n\nSmall states fear the money will be divvied up by population rather than need.\n\n“Any global opioid settlement that doesn’t reflect the unique and unprecedented damage imposed on West Virginia through the opioid epidemic should be DOA,” West Virginia Attorney General Patrick Morrisey said on Twitter on Tuesday.\n\nSome 400,000 U.S. overdose deaths between 1997 and 2017 were linked to opioids, according to government data. Roughly 2,600 lawsuits have been brought nationwide by states, local and tribal governments.\n\nThe three distributors in a joint statement said they were committed to finalizing a global settlement and would continue working with the other parties on the details of the framework. Teva declined to comment.\n\nJ&J said in a securities filing on Wednesday the deal would lower third quarter profit by $3 billion.\n\nThe proposal, announced on Monday, was hammered out by the companies and attorneys general in North Carolina, Pennsylvania, Tennessee and Texas.\n\nIt will need broad support among state attorneys general and will have to overcome opposition from the lawyers representing local governments that sued. Those lawyers declined to sign on when presented the proposal last week.\n\nUnder the settlement framework, money for each state would be divvied up, with 15% going to the state treasury, 15% for local governments that filed lawsuits and 70% going to a proposed state fund aimed at addressing the crisis.\n\nBoffetti predicted it would takes weeks for states to determine whether they back the settlement framework.\n\nNorth Carolina’s attorney general, Josh Stein, acknowledged that a detailed term sheet needs to be developed.\n\n“There are a lot of details and mechanics that need to be added to it,” Stein told Reuters in an interview. “That will happen in the coming weeks.”\n\nThe proposal did win a major supporter on Tuesday. Tom Miller of Iowa, the longest-serving attorney general, publicly backed the proposal, calling the framework “an important step in addressing the crisis.”\n\nColorado’s attorney general, Phil Weiser, called it a “very promising development.”\n\nThe lawsuits accuse distributors of failing to flag and halt a rising tide of suspicious orders and drugmakers of overstating the benefits of opioids while downplaying the risks.\n\nThe companies have denied any wrongdoing. Drugmakers say their products carried government-approved labels that warned of the addictive risks of opioids, while distributors argue their role was to make sure medicines prescribed by licensed doctors were available for patients.\n\nThe proposed deal has widened a fault line between attorneys general and local governments.\n\nCities and counties generally hired private attorneys to bring their cases, and attorneys general want to limit the amount of the settlement that goes to pay private lawyers. The attorneys for local governments also generally opposed Teva contributing opioid treatment drugs to the settlement, instead of cash, in part because of concerns that the framework placed an inflated value on those drugs.\n\nFILE PHOTO - A sign is seen on the outside of the courtroom on the first day of a trial of Johnson & Johnson over claims they engaged in deceptive marketing that contributed to the national opioid epidemic in Norman, Oklahoma, U.S. May 28, 2019. REUTERS/Nick Oxford\n\nLast week’s talks failed to reach a global deal, and on Monday, the three wholesale distributors and Teva struck a last-minute $260 million settlement with two Ohio counties, averting the first federal trial over opioids.\n\nNorth Carolina’s Stein said he looked forward to resolving concerns about the proposal and warned that settling lawsuits individually was unsustainable.\n\n“If we proceed on the current path and each county and city brings their case and extracts whatever amount they may be able to get from these companies, the companies will end up bankrupt,” he said. “The opioid crisis is a national problem that demands a national solution.”", "description": "Several U.S. states that have been ravaged by the opioid epidemic are pushing back on a proposed $48 billion settlement framework that would resolve thousands of lawsuits against five drug companies accused of fueling the addiction crisis.", "authors": ["Tom Hals", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191024&t=2&i=1444474529&w=1200&r=LYNXMPEF9N0T0", "published_at": "2019-10-24"}