{"pub": "vice", "url": "https://news.vice.com/en_us/article/43kbkb/he-said-he-was-innocent-for-over-40-years-now-hes-pleading-guilty-just-to-walk-free", "downloaded_at": "2019-10-16 20:50:29.631587+00:00", "title": "He Said He Was Innocent For Over 40 Years. Now He's Pleading Guilty Just to Walk Free.", "language": "en", "text": "Want the best of VICE News straight to your inbox? Sign up here.\n\nA 62-year-old Louisiana man has been locked up in one of the country’s most infamous prisons for 42 years over a deadly armed robbery he said he didn’t commit. Now he’s pleading guilty so he can walk free, his attorneys say.\n\nIn exchange for pleading guilty to manslaughter and three counts of armed robbery, Elvis Brooks leaves prison Wednesday with a felony criminal record that bars him from ever returning to a completely normal life, according to the Innocence Project New Orleans, the organization that pressed for another hearing of his case.\n\nIt wasn’t a deal he sought, either, his attorney Charell Arnold, told VICE News. But pushing to clear him of the charges entirely could’ve taken years, if not a decade.\n\n“I’m not getting any younger. I’d like to get out,” Brooks told NOLA.com.\n\nBrooks was 19 in July 1977, when two armed men robbed a local bar and killed a patron. Brooks had an alibi for that night — and 12 other people to back up his account, according to Arnold. Nonetheless, he was named as the suspect, sentenced to life in prison, and spent much of the next 42 years at the Louisiana State Penitentiary at Angola, the nation’s largest maximum-security prison notorious for being built on the site of a former slave plantation.\n\n“The only reason that Elvis Brooks became a suspect in this case was because he was African-American man who lived in this particular neighborhood,” Arnold, who maintains that he’s innocent, said.\n\nArnold said the witnesses who later identified Brooks as the suspect were merely “white strangers” who saw a robbery and homicide occur in a “dimly lit bar” after drinking all day.\n\n\n\nThe Orleans Parish District Attorney’s Office, meanwhile, has maintained that Brooks was fairly identified in a line-up that year by three separate witnesses, one of whom previously recognized Brooks from around their neighborhood. Additionally, Brooks’ original sentence was held up through several appeals, since he’s been fighting his imprisonment for decades now.\n\n\"Mr. Brooks committed a murder and multiple armed robberies in 1977, and his conviction and sentence were properly attained and affirmed through the course of several appeals,” Orleans Parish District Attorney Leon Cannizzaro said in a statement Tuesday. “We took another look at the case after 42 years, and remain convinced this office did nothing then or now to deprive this defendant of a fair trial.”\n\nInstead, Cannizzaro continued, the district attorney concluded he was “worthy of new sentencing consideration.”\n\nIPNO had asked for a new hearing on Brooks’ case after they found prosecutors and police may have violated the so-called Brady doctrine, which keeps prosecutors from improperly withholding evidence that can help a defendant’s case. Arnold said fingerprints obtained from beer cans allegedly held by the robbers that night didn’t match with Brooks’ prints, but that this information wasn’t disclosed to his attorney.\n\nAdditionally, another armed robbery took place just around the corner from the bar where a man was killed on that July 1977 night, about an hour before the event Brooks was blamed for. Brooks was not identified as a suspect in that other, close crime, however.\n\nBrooks’ case is effectively closed now that he’s taken the plea deal, Arnold said. Having pleaded guilty, he won’t be able to pursue cash through Louisiana’s Innocence Compensation Fund, which is afforded to people who are wrongfully convicted of a crime. The legal group says that it will soon post a fundraiser for him, as it does for many of its clients.\n\n“Because of this, he will be released with a criminal record, he has no ability to seek compensation,” Arnold said. “For all of those 42 years, the state owes him nothing.”\n\nCover: Elvis Brooks before his arrest with his sister, Earline Brooks Colbert. (Photo courtesy of the Innocence Project New Orleans)", "description": "Elvis Brooks had an alibi for the night of the deadly robbery — and 12 other people to back up his account.", "authors": [], "top_image": "https://video-images.vice.com/articles/5da720ac9cbe96000a1964ef/lede/1571235863459-Screen-Shot-2019-10-16-at-102331-AM.png?crop=0.4597xw:0.4138xh;0.2705xw,0.1179xh&resize=1200:*", "published_at": "2019-10-16"}