{"pub": "reuters", "url": "https://ca.reuters.com/article/topNews/idCAKBN1W80AI-OCATP", "downloaded_at": "2019-09-23 07:33:16.731337+00:00", "title": "Canada's Trudeau pushes on with campaign after severe blow from blackface photos", "language": "en", "text": "HAMILTON, Ontario (Reuters) - Canadian Prime Minister Justin Trudeau will forge ahead with his re-election campaign on Monday after blackface photos of him emerged and shifted voter support toward his Conservative rivals.\n\nFILE PHOTO: Canada's Prime Minister Justin Trudeau waves to supporters after speaking at an election campaign stop in Brampton, Ontario, Canada September 22, 2019. REUTERS/Carlos Osori/File Photo\n\nThe ruling Liberals were knocked off course when Time magazine published a picture of him in brown makeup at a 2001 “Arabian Nights” party when he was a 29-year-old teacher. Two other images and a video of him in blackface later surfaced.\n\nAfter two days of apologies, Trudeau has resumed making campaign announcements, and is set to talk about health care in the southwestern Ontario city of Hamilton on Monday.\n\nThe images were at odds with his oft-stated position that he wants to improve the lot of minorities in Canada and prompted international ridicule.\n\n“It’s a body blow,” pollster Frank Graves of EKOS Research said in an interview. “Will the Liberals be able to recover? Who knows? There’s no way of putting lipstick on a pig and making this go away.”\n\nGraves said his polling, which he has yet to publish in detail, shows a shift toward Conservative Party leader Andrew Scheer and away from Trudeau nationally.\n\nConservatives would win 35.5% of the national vote and the Liberals 32.9%, a Nanos Research poll released on Sunday said.\n\nIn Ontario, Canada’s most populous province and a key to any party’s hopes, the scandal has erased the 15-percentage-point lead the Liberals held, Graves said.\n\nLiberal insiders are more optimistic, noting that relatively few voters are bringing up the topic.\n\nTransport Minister Marc Garneau held a town hall on Sunday in Montreal - the biggest city in the powerful province of Quebec - and took just one question on the matter.\n\n“I am very proud to work with Justin Trudeau. I consider him to be the most progressive Prime Minister,” he replied.\n\nAfter taking a day off on Saturday, Trudeau stormed out of the gate on Sunday with two major policy promises: a tax-cut plan and cellphone bill reductions.", "description": "Canadian Prime Minister Justin Trudeau will forge ahead with his re-election campaign on Monday after blackface photos of him emerged and shifted voter support toward his Conservative rivals.", "authors": ["David Ljunggren", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190923&t=2&i=1432831431&w=1200&r=LYNXMPEF8M093-OCATP", "published_at": "2019-09-23"}