{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3069201&cloc=joongangdaily|home|newslist1", "downloaded_at": "2019-10-18 11:39:39.104097+00:00", "title": "Mount Bukhan’s rescuers reach dizzying heights", "language": "en", "text": "From left, Lee Dong-yun, vice head of the special rescue team of the Korea National Park Service, and four members of the rescue team, Choi Suk-jo, Shin Ju-han, Choi Hyeon-gyu and Oh Myung-suk, pose with Insu Peak of Mount Bukhan in the background. [BUKHANSAN NATIONAL PARK]\n\nWhen a hiker fell at Insu Peak on Aug. 3, it took the special rescue team of the Korea National Park Service (KNPS) just four minutes to reach the victim who was located 500 meters (1,640 feet) up a steep slope on Mount Bukhan.The special rescue team’s speed was about 7 to 8 kilometers (4.3 miles to 5 miles) per hour, the same as finishing a 100-meter race in 48 seconds. Choi Hyeon-gyu, one of the rescuers from the team, carried the victim, who was suspected to have broken ribs and both ankles, and Lee Dong-yun, vice head of the special rescue team, supported Choi. The entire process including climbing the mountain, administering first aid, and the flying ambulance’s descent was within 40 minutes.“We need to run at full speed to maximize ‘golden time’ in order to minimize the extent of injuries and the risk to people’s lives,” said Lee Chi-sang, 54, head of the special rescue team.The special rescue team of the KNPS has been in service since May of this year, after the former rescue team, part of the national police, was dismissed in January due to the planned abolition of the conscripted policeman system by 2023.A total of 14 rescuers are actively working on Mount Bukhan and 11 on Mount Dobong, both in Dobong District, northern Seoul, which is twice as many as that of the former rescue team.The special rescue team was called out again on Aug. 12 when a man in his 50s complained of leg pain halfway up the Baegundae Peak of Mount Bukhan. This time, the rescuers ran 900 meters (2953 feet) up the mountain path in less than nine minutes. After receiving first-aid treatment on his calf muscle spasm, the victim climbed down to Doseonsa Temple with the rescue team and was able to return home on his own.The team consists of many professional rescuers each with at least 10 years of hiking-related experience. Choi, one of the rescuers, studied emergency medical services for his undergraduate degree and previously worked at a university hospital’s emergency room. Choi said the sites where he is currently working are more dangerous than those of his former job. “So I have much more responsibility and commitment to protect the victims,” said Choi.Experience also means that when accidents are reported, rescuers can easily predict the locations, better forecast injuries and respond more rapidly. Lee Myung-jong, section chief of Mount Bukhan National Park’s department of disaster and safety, said that the rescue rate has improved by 30 percent.“When accidents occur, hikers usually do the primary work for the rescue,” Lee Dong-yun said. “They open the way [for rescuers who need to run] and arrange the rope for us.”As the leaves begin to change to various shades of red and yellow, the rescuers need to get themselves ready. Autumn is the season for hiking and when most accidents occur. “The most accidents occur in September to October and account for about 20 percent of accidents for the whole year,” Lee Chi-sang said. “We must keep our eyes on the situation.”Last year, about 5,520,000 people visited Mount Bukhan, the most visitors of any of the country’s national parks excluding marine national parks. About 3,240,000 people visited Mount Seorak, and about 3,310,000 people visited Mount Jiri. About 32 percent of all accidents at national parks, excluding Mount Halla, from 2014 until now, occurred at Mount Bukhan.“Accidents mostly occur between noon and 3 p.m.,” Lee Myung-jong said. “It is because people lose some of their stamina and lack concentration after lunch.”According to the Mount Bukhan National Park office, from 2016 to August 2019, 107 accidents took place between noon and 3 p.m., which is more than double the amount that occurred between 9 a.m. and noon. “Most of the accidents are safety related, which people can prevent by just paying a little more attention,” said Lee Dong-yun.While some expressed concerns that the new rescue team would not be able to match the 35 years of know-how of the former national police team, many others say that visitors to Mount Bukhan have nothing to worry about. “The new rescuers reacted very rapidly to the accidents since they are all professional hikers,” said Lee Myung-hee, a member of the North Face Climbing team.“The special rescue team of the KNPS is a group of professionals, and almost all rescuers have hiking-related licenses,” said Lee Yong-dae, former president of the Kolon Alpine School.Lee Myung-jong said he is currently reviewing a plan for expanding the areas to be managed by the special rescue team. Lee also said more people will be hired for the team by end of this year.BY KIM HONG-JOON, CHEA SARAH [chea.sarah@joongang.co.kr]", "description": "", "authors": [], "top_image": "https://pds.joins.com/jmnet/koreajoongangdaily/_data/photo/2019/10/18190838.jpg", "published_at": "2019-10-18"}