{"pub": "yahoo", "url": "https://news.yahoo.com/trumps-latest-conspiracy-theory-kurds-161732528.html", "downloaded_at": "2019-10-14 23:19:07.800152+00:00", "title": "Trump's latest conspiracy theory is that the Kurds released ISIS prisoners to pull the US back into Syria", "language": "en", "text": "Associated Press\n\n\n\n\n\nPresident Donald Trump suggested Kurdish forces intentionally released ISIS prisoners to pull the US back into northeast Syria.\n\nTrump provided no evidence to support this assertion and no US officials have gone on record to confirm this.\n\nThe Kurds bore the brunt of the US-led campaign against ISIS, and are now facing a Turkish military invasion in Syria.\n\nThe White House last Sunday announced the US was withdrawing troops from northeast Syria ahead of the Turkish operation, and Trump has been accused of abandoning the Kurds.\n\nTrump received warnings from many in Washington, including congressional Republicans, that his decision could lead to the resurgence of ISIS in the region.\n\nVisit Business Insider's homepage for more stories.\n\nPresident Donald Trump on Monday suggested that Kurdish forces have deliberately released ISIS prisoners to pull the US back into northern Syria, providing no evidence to support this assertion.\n\nThe baseless allegation is part of a broader trend from Trump, who has a long history of floating conspiracy theories.\n\nTrump, who's faced widespread criticism for pulling US troops out of northeast Syria and abandoning Kurdish forces there, on Monday tweeted: \"Europe had a chance to get their ISIS prisoners, but didn't want the cost. 'Let the USA pay,' they said...Kurds may be releasing some to get us involved. Easily recaptured by Turkey or European Nations from where many came, but they should move quickly.\"\n\nThe president added, \"Big sanctions on Turkey coming! Do people really think we should go to war with NATO Member Turkey? Never ending wars will end!\"\n\nTrump's tweets came after it was reported over the weekend that ISIS-affiliated prisoners had escaped a camp in northern Syria amid a Turkish military operation. Turkey invaded Syria last week following the withdrawal of US troops from the region.\n\nThe White House and Pentagon did not immediately respond to requests for comment from Insider on whether there's any evidence Kurdish forces, who until last week were closely allied with the US, intentionally released prisoners.\n\nLara Seligman of Foreign Policy said a senior US administration official told her there's no evidence the Kurds released ISIS prisoners. \"That has enraged our forces in Syria,\" the official added. \"Incredibly reckless and dishonest thing to say.\"\n\nRead more: The US shared intelligence with Turkey that may have helped it target the Kurds in Syria\n\nTrump's decision to withdraw US forces from northeast Syria, announced last Sunday, has been met with fierce opposition across the political spectrum. Almost as soon as the move was announced, Republicans in Congress began warning that Trump had assured the resurgence of ISIS in the region. There's been bipartisan outcry over Trump's decision, as well as sharp criticism from former Trump administration officials.\n\nThe Kurdish-led Syrian Democratic Forces SDF bore the brunt of the US-led campaign against ISIS, and helped smash its so-called caliphate — at a cost of nearly 11,000 casualties. The Kurds have characterized Trump's Syria retreat as a \"stab in the back.\"\n\nThe Kurds have also been detaining thousands of ISIS fighters, of whom 9,000 are estimated to be from Iraq and Syria and 2,000 from other countries. But the Turkish invasion, which targets the Kurds, has drawn their attention away from ISIS and created a security vacuum. Though Turkey is a fellow NATO member to the US, it views some of the Kurdish forces as terrorists despite their key role in eradicating ISIS.\n\nAmid the rapid Turkish military incursion into Syria and the US withdrawal from the northeast part of the country, the US failed to transfer roughly five dozen \"high value\" ISIS detainees out of the country, The New York Times reported on Sunday. And US officials have said operations to counter ISIS have been stopped amid the Turkish assault.\n\nOver 100,000 people have been displaced by the violence\n\nSince the Turkish invasion, ISIS has claimed responsibility for at least two attacks in Syria, and there have been reports of atrocities committed by Turkish-backed forces. Over 100,000 people have been displaced by the violence so far, according to the UN.\n\nRetired four-star Marine Gen. John Allen, the former commander of US forces in Afghanistan and former special presidential envoy for the Global Coalition to Counter ISIS under the Obama administration, told CNN on Sunday that the escalating crisis in Syria was \"completely foreseeable\" and \"the US greenlighted it.\"\n\nMeanwhile, the SDF on Monday confirmed it had made a deal to join forces with Syrian President Bashar al-Assad, a US adversary, to quell the Turkish assault. The Kurds are also looking toward Russia as a partner, many in Washington were concerned would happen on top of anxieties regarding ISIS.\n\n\"After the Americans abandoned the region and gave the green light for the Turkish attack, we were forced to explore another option, which is talks with Damascus and Moscow to find a way out and thwart these Turkish attacks,\" senior Kurdish official Badran Jia Kurd said. \"This is a preliminary military agreement. The political aspects were not discussed, and these will be discussed at later stages.\"", "description": "The Kurds bore the brunt of the US-led campaign against ISIS, and Trump is now suggesting without evidence that they released ISIS prisoners.", "authors": ["John Haltiwanger"], "top_image": "https://s.yimg.com/uu/api/res/1.2/HQ94S9usnEo.jow4nzB5NA--~B/aD0yNjU4O3c9MzU0NDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-US/business_insider_articles_888/84ddc822852df858f66193f167d79766", "published_at": "2019-10-14"}