{"pub": "yahoo", "url": "https://news.yahoo.com/negative-interest-rates-japan-germany-france-150324580.html", "downloaded_at": "2019-10-13 00:26:53.137411+00:00", "title": "Negative interest rates are coming and they are downright terrifying", "language": "en", "text": "What if I said I wanted to borrow $100 from you and pay you back $99 five years later? Would you do it?\n\nHell no!\n\nAnd yet this is exactly what’s happening right now in the banking systems of Japan, Germany, France, and other European countries.\n\nNegative interest rates — where the lender gets paid back less than they’ve loaned — now add up to 30%, (and counting), of the global tradable bond universe, according to JPMorgan (JPM). You may have seen for instance that Germany just sold the first negative yielding 30-year bond issue.\n\nIn case you’re wondering, yes, this is crazy.\n\n“It’s really unusual and really distorting the global financial system,” says Torsten Slok, chief economist at Deutsche Bank Securities (DB). “I spend all my time talking about it.”\n\nThis is not going to end well\n\nNegative rates are counterintuitive, unprecedented — and to my mind — mind-bendingly insane and downright scary. They are like a parallel universe where everything you’ve ever learned about finance and human behavior is turned upside down.\n\nNegative interest rates could spell serious trouble for the financial markets. Image: Getty More\n\nWorse, negative rates are being normalized by economists, bankers, and commentators.\n\nWorst, I have a funny feeling this will end badly. Negative interest rates have all the hallmarks of serious trouble for the financial markets; an anomaly growing in scale which seemingly came out of nowhere that is under-recognized, poorly understood and dismissed as not consequential. (Flashing red lights here.)\n\nIn the U.S. we aren’t particularly aware of negative rates because they haven’t made their way to our shores ... perhaps yet.\n\nYes, the U.S. ten year Treasury yields 1.59%, not close to 0%, but negative rates seem to be creeping ever closer. For instance, negative interest rates haven’t come to U.S. corporate debt, but Euro-denominated bonds issued by the likes of blue-chips Apple (AAPL), McDonald’s (MCD), and Pepsi (PEP) carry negative yields.\n\nAnd in Europe, it was postulated that negative rates would never fly in the consumer sphere in terms of banks paying back depositors less than they put in their savings accounts, but that’s now changing. Banks in Denmark and Switzerland are now charging customers to hold deposits. And on the flip side, and also in Denmark, mortgages with negative rates are available. That’s right, you get a mortgage from the bank, and the bank essentially pays you each month. A three-year adjustable rate mortgage priced at negative .28% there recently.\n\n“Helt vildt,” as the Danes might say. Translation: “Totally nuts.”\n\nA woman looks at an electronic stock board showing Japan's Nikkei 225 index at a securities firm in Tokyo. More and more government and even some corporate bonds are trading at negative interest yields. (AP Photo/Eugene Hoshiko) More\n\n‘I don’t think the U.S. can resist the pull’\n\nNone of this gives Timothy Duy, an economics professor at the University of Oregon, a warm and fuzzy feeling. “The issue right now is the rest of the world seems to be going deeper and deeper into negative interest rates, and I don’t think the U.S. can resist that pull,” he says.\n\nBy now, if you are like me, your head is swimming with questions:\n\n-How, when, and why did negative rates come about?\n\n-Are negative rates bad?\n\n-How will this end?\n\nLet’s tackle the first couple of questions first. It appears that negative interest rates are a modern phenomenon that was first implemented to spur sluggish economies that couldn’t get traction coming out of the Great Recession. (Yes, brought to you by central bankers.) Denmark’s Nationalbank, (the Danes again) in July 2012 was one of the first, followed by the European Central Bank in 2014, the Bank of Japan, and now much of the rest of Europe.", "description": "“It’s really unusual and really distorting the global financial system,” says Torsten Slok, a chief economist at Deutsche Bank Securities.", "authors": ["Andy Serwer", "Max Zahn"], "top_image": "https://s.yimg.com/uu/api/res/1.2/50luP_8.TMES8v85KwVTzQ--~B/aD0zMzA5O3c9NDk2MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-08/cd7509e0-c5db-11e9-aff7-f5079658320c", "published_at": "2019-08-23"}