{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/just-in-luxury-sports-cars-seized-as-hawks-afu-raid-homes-of-former-ethekwini-mayor-zandile-gumede-and-co-accused-20191010", "downloaded_at": "2019-10-10 06:18:45.877564+00:00", "title": "Luxury sports cars seized as Hawks, AFU raid homes of former eThekwini mayor Zandile Gumede and co-accused", "language": "en", "text": "The Hawks' crime-fighting unit has confirmed that it is raiding the home of former eThekwini mayor Zandile Gumede.\n\nHawks officers and members of the Asset Forfeiture Unit arrived at Gumede's Umhlanga home early on Thursday morning.\n\nGumede and several co-accused are facing fraud and corruption charges related to a municipal solid waste tender worth R208m. The ANC removed her from her position after her arrest.\n\nREAD | 'I will step down' - Zandile Gumede to heed ANC's call to resign as mayor\n\nIt's understood Gumede was not at the Umhlanga home when the officers arrived.\n\nSpeaking to News24, National Prosecuting Authority (NPA) spokesperson Natasha Kara said the asset seizure was implemented on Gumede and her fellow accused in the corruption matter she was arrested for earlier this year.\n\n\"This is simple a seizure of assets. We got an order from the court to seize their assets from the various accused in her corruption matter pending the outcome of the criminal charge. In so far as the state's goes, we believe these are proceeds of crime.\"\n\nREAD | Zandile Gumede met with ANC top six before resignation withdrawal - sources\n\nKara said several properties from all the accused were seized, including upmarket homes in Umhlanga, Amanzimtoti and Zimbali. She said luxury sports cars, such as Porsches and Lamborghinis, were also seized.\n\n\"It is a general process. When we believe an accused owns asset that are proceeds of crime, we get an order from the court to confiscate them and put them under curatorship and the assets stay with the curator.\"\n\nShe added: \"It is not something new or discriminatory. We do this to many accused. This is just a process of the law.\"\n\nKara said the State was confident about their case.\n\n\"We have faith in our case. It should be noted that these assets can be returned depending on the way the case goes.\"\n\nThis is a developing story. More to follow.", "description": "The Hawks' crime-fighting unit has confirmed that it is raiding the home of former eThekwini mayor Zandile Gumede.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9281/b5025b68baf14e139ee063582b91cf52.jpg", "published_at": "2019-10-10"}