{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7615535/In-tweet-President-Trump-laments-loss-iPhone-home-button.html", "downloaded_at": "2019-10-27 04:09:07.070997+00:00", "title": "In tweet, President Trump laments loss of iPhone home button", "language": "en", "text": "President Trump on Friday called out Apple CEO Tim Cook on Twitter for removing the famous home button on iPhones - a change that first went into effect nearly three years ago.\n\n'To Tim: The Button on the IPhone was FAR better than the Swipe!' Trump tweeted on Friday.\n\nWhen Apple removed the home button on some iPhone models starting in 2017, the change upset some of its customers because it forced them to swipe upward, rather than tap a button, to unlock the device or return to its home screen.\n\nTrump, who uses a government-issued iPhone, is among those who do not like the change.\n\nPresident Trump uses his government-issued iPhone while flying aboard Air Force One during a flight to Philadelphia on January 26, 2017\n\nTrump on Friday tweeted that he missed the home button on the older versions of the device, telling Apple CEO Tim Cook that the button was 'FAR better than the Swipe!'\n\nThe tweet was directed at Cook, who has dined with Trump at least twice and has discussed trade issues with the president on multiple occasions.\n\nApple started selling iPhones without home buttons with the introduction of the iPhone X in 2017.\n\nThe company still sells one model - the iPhone 8 - that retains the home button.\n\nApple did not immediately respond to a request for comment.\n\nThe home button had been a fixture on iPhone models since the smartphones were first introduced to the world in 2007.\n\nAll subsequent models including the iPhone 3G (2008); iPhone 3GS (2009); iPhone 4 (2010); iPhone 4s (2011); iPhone 5 (2012); iPhone 5s & iPhone 5c (2013); iPhone 6 and 6 Plus (2014); the iPhone 6s and 6s Plus; the iPhone SE (2016); the iPhone 7 and 7 Plus (2016); and the iPhone 8 and 8 Plus (2017) all had the home button.\n\nIn 2017, Apple stopped outfitting its newer models of iPhone with the home button. CEO Tim Cook is seen above in Cupertino, California, on September 10\n\nThe home button was a fixture on iPhones since Apple rolled out the original model (left) in 2007. It did away with the button in 2017, when it introduced the iPhone X (right)\n\nBut when the Cupertino, California-based company rolled out the iPhone X in November 2017, fans were shocked to discover that the button was missing.\n\nThe button-less phones allowed users to unlock the phone with their face. Since doing away with the button, Apple has made the screen on its iPhone significantly larger.\n\nEach new make and model of the iPhone that has been released since then - the iPhone XS and XS Max; the iPhone XR; and iPhone 11; the iPhone 11 Pro; and the iPhone 11 Pro Max - also do not have the button.\n\nApple still makes iPhone 8 models available for sale.\n\nIn the past, Trump has complained about Apple's design of its flagship product.\n\nIn 2013, then-citizen Trump tweeted: '[Apple] better get a large screen iPhone, and fast, or risk losing even more business. Samsung cannot believe you have not acted! DUMB!'\n\nThat same day, he then tweeted: 'I cannot believe that Apple didn't come out with a larger screen IPhone. Samsung is stealing their business. STEVE JOBS IS SPINNING IN GRAVE.'\n\nIn March 2014, Trump tweeted: 'I wonder if Apple is upset with me for hounding them to produce a large screen iPhone. I hear they will be doing it soon - long overdue.'\n\nTrump has met numerous times with Cook to discuss economics, trade, and manufacturing issues. The two men are seen above at the White House in March\n\nIn years past, Trump has not been shy about letting Apple know what he thinks of its products\n\nIn 2013, Trump said Samsung was 'stealing business' from Apple because the screens on the iPhone were too small\n\nIn March 2014, Trump tweeted: 'I wonder if Apple is upset with me for hounding them to produce a large screen iPhone. I hear they will be doing it soon - long overdue.'\n\nTrump has met Cook numerous times to discuss the company's investments in the United States as well as trade concerns.\n\nTrump said he wants Apple and other manufacturers to move their production from China and other countries to the United States.\n\nThe United States and China are locked in a trade war over US demands that China change its policies on intellectual property protection, technology transfers, industrial subsidies and other trade barriers.\n\nAfter Trump imposed 25 percent tariffs on $250billion of Chinese goods and threatening to tax an additional $300billion worth, China imposed tariffs on $110billion in US imports.\n\nOn Twitter, social media users wondered whether Trump was subtweeting his personal lawyer, Rudy Giuliani.\n\nIt was revealed on Friday that Giuliani butt-dialed a reporter earlier this month, leaving a three-minute voicemail where he's heard discussing foreign business dealings and his need for cash.\n\nOn Friday, NBC News reporter Rich Schapiro detailed in the first-person the October 16 call, which came at 11:07 p.m. and went to voicemail as the journalist was asleep.\n\nThis was the second time Giuliani had left an accidental voicemail on the reporter's phone. On both occasions the reporter had been interviewing Donald Trump's personal lawyer either earlier in the day, or the day before.\n\nIn the most recent call, Guiliani can be heard telling a mystery man, whose voice is also picked up in the message: 'The problem is we need some money. We need a few hundred thousand.'\n\nOn Twitter, some users wondered if the President upgraded his iPhone\n\nTwitter users noted that the iPhone 8 is the last model to use a button, while the latest edition, the iPhone 11, doesn't have one\n\nOther Twitter users wondered if the president wasn't mistakenly talking about a different device\n\nShep McAllister tweeted: 'Is this a Giuliani joke? Does he not use FaceID?'\n\nAnother reference was made to Rudy Giuliani, the President's personal attorney who reportedly butt-dialed a reporter and left messages about needing money\n\n'Is he subtweeting Rudy?' wondered the official Twitter account of Comedy Central's The Daily Show\n\n'Sir, this is Twitter. Not the Apple Genius Bar,' tweeted another Twitter user\n\nA popular meme features Trump yelling comments at a child who is mowing the lawn outside the White House\n\nThe former New York City mayor is emerging as a key figure in the ongoing impeachment inquiry against the President.\n\nGiuliani played a key role in Trump’s dealings with Ukraine, whose government was urged to investigate Joe and Hunter Biden.\n\nTrump’s contacts with Ukraine are now the subject of an investigation by the Democratic-led House of Representatives.\n\n‘Is he subtweeting Rudy?’ wondered the official Twitter account of Comedy Central’s The Daily Show.\n\nShep McAllister tweeted: ‘Is this a Giuliani joke? Does he not use FaceID?’\n\nCameron Atfield tweeted: ‘Rudy’s embarrassment is Tim Cook’s fault? Right.’\n\nOther speculated that Trump must have recently upgraded his phone from an iPhone 8 to an iPhone 11.\n\nJohn Gruber tweeted: ‘Took me 30 seconds to figure this out, but I got it.\n\n‘Trump just switched from an iPhone 8 with a home button to an iPhone 11 without one, and he doesn’t like it.’\n\nOthers mocked Trump by wondering if he was talking about another device with buttons.\n\n‘Sir, this is a TV remote,’ tweeted one Twitter user.\n\nAnother Twitter user wrote: ‘Yet another \"Had to check if this was a parody account\" tweet.\n\n‘It bothers him, Tim. Keep it that way.’\n\nAnother Twitter user wrote: ‘Sir, this is Twitter. Not the Apple Genius Bar.’", "description": "President Trump, who uses a government-issued iPhone, is among those who do not like the change that Apple made on its iPhones beginning with its iPhone X models in 2017. Tim Cook is seen right.", "authors": ["Ariel Zilber For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/19/20222902-0-image-a-35_1572115575359.jpg", "published_at": "2019-10-25"}