{"pub": "rt", "url": "https://rt.com/usa/471884-facebook-news-breitbart-disinfo-fail", "downloaded_at": "2019-10-26 02:12:48.190509+00:00", "title": "Rage over Breitbart’s inclusion in Facebook News overlooks the outrage of letting Facebook curate journalism", "language": "en", "text": "Liberals are foaming with rage over the inclusion of conservative outlet Breitbart in Facebook’s News tab. More alarming is the idea of letting journalists chosen by Facebook determine what is considered “news” to begin with.\n\nFacebook has unveiled its long-awaited News feature, but the social media behemoth is keeping mum on the identities of the approximately 200 publishers who will be getting either “free money” or hefty referral traffic from the new tab. Early reports indicate the participants include the usual mainstream media suspects – the New York Times, Bloomberg, the Washington Post – but also Breitbart.\n\nAlso on rt.com Forget privacy abuses, liberals call to DeleteFacebook after learning Zuckerberg met with conservatives\n\nThe conservative outlet’s inclusion has inflamed liberals already miffed by the revelation that Facebook CEO Mark Zuckerberg was meeting for off-the-record dinner dates with prominent conservatives, including Tucker Carlson of Fox News. For Zuckerberg to elevate Breitbart, once helmed by former Trump adviser Steve Bannon, to the level of a trusted news source? Unthinkable!\n\nPerhaps sensing the growing rage against the platform’s decision, a Facebook spokesperson tried to calm users down, telling Slate that “the number of publishers in the tab will grow over time – and it will be dynamic. If a publisher falls out of eligibility for posting misinformation, or clickbait or scraping content – for example, they will no longer appear in Facebook News.”\n\nAlso on rt.com But China! Cryptos crater as Congress tries to pin Zuckerberg down on ‘too big to fail’ Libra\n\nThat opens a whole other can of worms, however. ABC, also reported to be a Facebook News partner, was recently slammed for claiming footage of a weapons demonstration in Kentucky was actually video of Turkey decimating the US’ Kurdish allies with airstrikes.\n\nAn MSNBC story claiming US President Donald Trump received loans co-signed by Russian billionaires was wholly fake. That’s just the tip of an enormous iceberg of falsehood, wheeled out under the aegis of mainstream news on a daily basis. Is Facebook prepared to kick everyone off as soon as they lie?\n\nThe rage over Breitbart’s inclusion in Facebook News dodges the heart of the matter – that users should not be trusting a company whose founder has referred to users as “dumb f**ks” to select what news they are to consume.\n\nFacebook’s last attempt to weed out “fake news” quickly came to resemble a full frontal assault on alternative media, and many sites saw their traffic drop dramatically when the site changed its algorithms to crowd news out of users’ feeds – especially voices outside the mainstream.\n\nBy Helen Buyniski, RT\n\nLike this story? Share it with a friend!", "description": "Liberals are foaming with rage over the inclusion of conservative outlet Breitbart in Facebook’s News tab. More alarming is the idea of letting journalists chosen by Facebook determine what is considered “news” to begin with.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5db39ed020302758da27d3d8.jpg", "published_at": "2019-10-26"}