{"pub": "fox", "url": "https://foxnews.com/entertainment/joker-star-joaquin-phoenix-does-the-unthinkable-after-accident-with-paramedics-truck-report", "downloaded_at": "2019-10-11 20:05:38.873860+00:00", "title": "‘Joker’ star Joaquin Phoenix does the unthinkable after accident with paramedics’ truck: report", "language": "en", "text": "Joaquin Phoenix hit a parked vehicle and did more than just leave a note, he tracked down the driver to fess up.\n\nThe “Joker” star, 44, reportedly ran his Tesla into the bumper of an unoccupied Los Angeles County Fire Department truck on Tuesday afternoon in West Hollywood, according to TMZ.\n\n'JOKER' STAR JOAQUIN PHOENIX, DIRECTOR TODD PHILLIPS: 'YOU CAN'T BLAME MOVIES FOR A WORLD THAT IS SO F--KED UP'\n\nPhoenix apparently misjudged a right turn he was making and clipped the rear-end of the truck. It was what the “Her” actor did afterward, however, that for some is restoring faith in humanity.\n\nPhoenix pulled over and managed to locate paramedics who were responding to a call and explained the situation, the gossip site reported. Police officers were called to the scene and Phoenix handed over his insurance information before a damage report was taken.\n\nAlthough Phoenix was not cited in the incident, the outlet said the Tesla he was driving sustained the most damage – most of it to the vehicle’s right quarter panel. The emergency vehicle was largely unscathed and only had a minor scratch to the bumper.\n\nPhoenix currently sits atop the box office record books for October film releases. “Joker” earned an estimated $93.5 million from ticket sales in its first weekend in North American theaters. The previous October record-holder was the Spider-Man spinoff \"Venom,\" which opened to $80 million last year.\n\n'JOKER' DIRECTOR BLAMES 'WOKE CULTURE' FOR ABANDONING COMEDIES: 'I DON'T WANT TO OFFEND YOU'\n\nScrutiny over \"Joker's\" violent themes resulted in multiple theater chains banning costumes and authorities in numerous cities stepping up police patrols around theaters, but security concerns did not seem to detract audiences.\n\nThe actor recently walked away from an interview with \"The Telegraph\" after a reporter asked about the potential for the flick to inspire violence.\n\nThe U.K. paper's journalist, Robbie Collin, asked the 44-year-old actor: \"Aren’t you worried that this film might perversely end up inspiring exactly the kind of people it’s about, with potentially tragic results?\"\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nCollin said that Phoenix responded: \"'Why would you…? No… no.'\" He then walked out of the room.\n\nThe outlet reports that over the next hour Phoenix spoke with a Warner Bros. publicist -- the studio behind the film -- \"to get things back on track.\" He eventually returned to the interview, explaining that he panicked because he genuinely hadn't thought about the question before.\n\nFox News’ Mariah Haas and the Associated Press contributed to this report.", "description": "Joaquin Phoenix hit a parked vehicle and did more than just leave a note, he tracked down the driver to confess.", "authors": ["Julius Young", "Julius Is An La Entertainment Reporter For Fox News."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2018/09/rtx4xx06.jpg", "published_at": "2019-10-11"}