{"pub": "npr", "url": "https://npr.org/2019/09/10/759512938/u-s-census-bureau-reports-poverty-rate-down-but-millions-still-poor", "downloaded_at": "2019-09-10 23:27:08.102864+00:00", "title": "U.S. Census Bureau Reports Poverty Rate Down, But Millions Still Poor", "language": "en", "text": "U.S. Census Bureau Reports Poverty Rate Down, But Millions Still Poor\n\nEnlarge this image toggle caption Spencer Platt/Getty Images Spencer Platt/Getty Images\n\nThe U.S. poverty rate declined slightly last year, but finally fell below the 2007 level, right before the Great Recession pushed millions of Americans out of work and into financial distress.\n\nThe improving economy was a key factor in the decline. The U.S. Census Bureau noted in its annual report on income and poverty that there were 2.3 million more full-time, year-round workers last year and that median earnings for all such workers rose by more than three percent.\n\nAmid these positive signs, the bureau reported separately that the number of people in the U.S. who did not have health insurance rose from 25.6 million people in 2017 to 27.5 million in 2018. That included 4.3 million children. Health advocacy groups called the increase extremely troubling and blamed declines in Medicaid coverage, especially for Hispanic children and children under the age of six.\n\nDespite the decline in poverty, the Census Bureau found that 38.1 million people in 2018 were poor. This was 1.4 million fewer poor people than in 2017, but about one in eight Americans still lived below the poverty line — $25,465 for a family with two adults and two children.\n\nMedian household income last year was $63,179, not statistically different from the year before, but equal to the peak level reached in 1999.\n\nThe White House Council of Economic Advisers touted the new figures as a sign that President Trump's economic policies are working.\n\n\"While Americans across the board generally saw improvements, the data show that in many cases those who had been forgotten in the past were lifted up the most,\" the council said in a statement. Children and female-headed households saw some of the biggest declines in poverty.\n\nBut Elise Gould, a senior economist with the Economic Policy Institute, noted some disturbing trends. Although median household income rose for four consecutive years, the rate of growth and the income level has slowed significantly and is slightly below where it was almost two decades ago. \"It's a step in the right direction, but most families barely made up the ground lost\" with the recession, she said.\n\nThere were also huge racial disparities in the figures. The median income for African-American households last year was $41,361, compared with $70,642 for white, non-Hispanic households. The poverty rate for blacks was almost 21 percent compared to about 8 percent for non-Hispanic whites.\n\nAnti-poverty groups noted that the report also showed the importance of government safety-net programs in helping to keep millions of people from falling into poverty. In recent years, the Census Bureau has released a supplemental poverty measure along with the official one, which shows the impact of a range of benefits, including Social Security and tax breaks.\n\nThe 2018 supplemental poverty measure found that Social Security benefits kept more than 27 million people out of poverty last year and that refundable tax credits did the same for almost 8 million people. Supplemental Nutrition Assistance Program benefits, known as food stamps, also kept an estimated three million people from becoming poor.\n\nThese numbers will almost certainly be used by advocacy groups in their efforts to block Trump administration proposals to restrict this aid. Among other things, the president wants to impose new work requirements on those receiving SNAP benefits and Medicaid. The administration is also making it more difficult for immigrants who receive any public assistance from getting green cards.\n\nJared Bernstein, an economist with the liberal-leaning Center on Budget and Policy Priorities, noted the positive signs in the new report, but warned, \"Such gains can demonstrably be reversed by policies hostile to them. It is thus extremely worrisome to consider the actions the Trump administration is taking to reduce government support of poor households, especially those with immigrants.\"\n\nThe Census Bureau also found that there was little change in income inequality last year. The top 20 percent of households received more than half of all income. Woman also still earned 82 cents on the dollar, compared with men, the same as in 2017.", "description": "While the poverty rate finally fell to prerecession levels in 2018, the number of people without health insurance increased, and about one in eight Americans still lived below the poverty line.", "authors": ["Pam Fessler"], "top_image": "https://media.npr.org/assets/img/2019/09/10/gettyimages-1168454861-1-_wide-9ac0262bf9639b1bef570aa498ac9aa537320d83.jpg?s=1400", "published_at": "2019-09-10"}