{"pub": "cbc", "url": "https://cbc.ca/news/canada/ottawa/2-groups-baseball-stadium-lease-1.5296665", "downloaded_at": "2019-09-25 23:30:49.758156+00:00", "title": "2 groups vying for baseball stadium lease | CBC News", "language": "en", "text": "Two \"viable, legitimate\" groups have approached the City of Ottawa about leasing its baseball stadium now that the struggling Champions are in default, councillors learned Wednesday.\n\nOne group includes the Ottawa Sports and Entertainment Group (OSEG), owner of the CFL Redblacks, the USL Fury and OHL 67's, and partner Regan Katz on behalf of the Winnipeg Goldeyes, a successful franchise in the American Association of Independent Professional Baseball.\n\nThe other proposal comes from Rob Lavoie, Rob Abboud and Fred Saghbini.\n\nBoth groups are aware that the city expects them to clear nearly half a million dollars in debt the Champions owe before they can hit the field for the 2020 season, the city said.\n\nWe're trying to minimize our loss and get our money back. - Steve Kanellakos, city manager\n\n\"We're trying to minimize our loss and get our money back. It's been part of the negotiations,\" city manager Steve Kanellakos told councillors.\n\n\"We feel now that we have two viable, legitimate owners' groups who are interested in the team [and] who have the financial means to be able to deal with that outstanding debt.\"\n\nMayor Jim Watson encouraged other interested parties to come forward.\n\n\"I think that it's exciting that there are groups prepared to step up to the plate, excuse the pun, and bid to continue professional baseball in Ottawa,\" said Watson.\n\n$463K debt\n\nChampions owner Miles Wolff was on a repayment plan with the city, but missed his Sept. 4 payment, councillors also learned.\n\nThe city has now found him to be in default and will be cashing a $108,000 letter of credit.\n\nEven with that payment the Champions owe $463,000 for missing rent payments in previous seasons, and for the hourly rate it was being charged during the 2019 season, which ended earlier this month.\n\nCoun. Carol Anne Meehan questioned how any new owner could succeed where others have failed. City officials noted the light rail station at Tremblay will mean fans can now get to games on LRT.\n\nOther councillors were less interested in the business of baseball, and more keen to see staff undertake a grander vision for how else the stadium site could be used.", "description": "Two \"viable, legitimate\" groups have approached the City of Ottawa about leasing its baseball stadium now that the struggling Champions are in default, councillors learned Wednesday.", "authors": [], "top_image": "https://i.cbc.ca/1.5296747.1569429606!/fileImage/httpImage/image.JPG_gen/derivatives/16x9_620/champions-baseball-ottawa-stadium.JPG", "published_at": "2019-09-25"}