{"pub": "washingtonpost", "url": "https://washingtonpost.com/sports/2019/09/04/after-four-years-gruesome-injury-nationals-reliever-aaron-barrett-is-returning-majors", "downloaded_at": "2019-09-04 03:46:34.791069+00:00", "title": "After four years and a gruesome injury, Nationals reliever Aaron Barrett is returning to the majors", "language": "en", "published_at": "2019-09-04", "text": "Aaron Barrett said six months ago that his would be “an amazing comeback story.” The Washington Nationals right-handed reliever has endured the hardest parts of an unbelievable rehab, including one of the most gruesome injuries possible for a pitcher. He spent two years out of baseball. He spent the next two in the minor leagues, clawing back to the place he had dreamed of as a kid, the place he had once been. And then, on Tuesday, Barrett again became everything he said he would be.\n\nThe Nationals called, bringing him back to the major leagues. The team has not announced the transaction and there is not yet an official corresponding 40-man roster move, but it could be righty Austen Williams to the 60-day injured list. When it is official, it will be Barrett’s first trip to the majors since 2015, a culmination of years of work as well as the fruition of a plan built specifically for him by the Nationals this season.\n\n“The totality of the year that he had, his body of work, certainly warranted for this opportunity,” said Doug Harris, the Nationals’ assistant general manager and vice president of player personnel. “We methodically [built him up] throughout the course of the year where we put him in a position to be considered for this.”\n\n[Victor Robles, the 22-year-old rookie, takes charge in the Nationals outfield]\n\nBarrett, 31, got the news Tuesday afternoon, when the Class AA Harrisburg Senators held a ceremony on a tarped-over pitcher’s mound before a team workout. Manager Matt LeCroy spoke. He had coached Barrett in 2013, when Barrett was the Senators’ closer, and he had watched as the pitcher went from rising star to broken man to relentless returner.\n\n“You’ve been an inspiration to me, brother; an inspiration to these coaches and these players,” LeCroy told him. LeCroy choked up. Barrett looked at the ground.\n\n“And it's an honor I got to manage you. But it's more of an honor to tell you you're going back to the big leagues.”\n\nBarrett smiled and ducked as teammates mobbed him. LeCroy knew why. He echoed others in the organization when he said the reliever was highly respected as a person. The manager called the pitcher “the glue” of every clubhouse he had ever been in, someone who helped others.\n\n“To be able to tell him and be able to share that message with him …” LeCroy said, tailing off. “it was real, man.”\n\nThe dream still seemed implausible as recently as this spring training. Barrett spent March trying to make the team that once considered him a key piece of its bullpen.\n\n“Sometimes I need to take a step back and tell myself, ‘Dude, you’re doing it,’ ” Barrett said then of his comeback, holding back tears. “It makes me emotional just thinking about it.”\n\nHe paused.\n\n“I don’t know. It’s crazy.”\n\nA ninth-round draft pick in 2010 out of Mississippi, Barrett first reached the majors in 2014 with his mid-90s fastball and sharp slider. Then-Nationals manager Matt Williams leaned heavily on Barrett, and he posted a 2.66 ERA in 50 games. Barrett appeared in 30 of the team’s first 60 games the next season, but his arm got sore. He couldn’t feel his fingers. An MRI exam showed ulnar collateral ligament damage, and he underwent Tommy John surgery.\n\nLess than a year later, in July 2016, he was throwing a simulated game in Viera, Fla., during his recovery when he broke his arm. The bone snapped in a way that people who were there, such as pitcher Ronald Peña and then-minor league pitching coordinator (and current Nationals pitching coach) Paul Menhart, never forgot. The broken humerus sounded like a “full-on gunshot” or a piece of plywood being kicked in.\n\nMat Latos, a pitcher waiting to throw, vomited. Peña, in line after Latos, didn’t want to pick up a ball. Barrett writhed and howled and bawled and asked why this had to happen to him. The Nationals had video of the incident, and they sent it to manager Dusty Baker, who saved it on a locked hard drive so no one would watch it again.\n\n[Aaron Barrett’s comeback is full of miracles. But he wants one more.]\n\nBarrett retreated. He healed. He spent almost two years away from the game and then, in the spring of 2018, threw his first bullpen. He inched back, making 20 appearances in Class A last year. Finally, in spring training this year, he showed there was enough life left in his arm for hope. The Nationals formulated a plan to build back the strength necessary for the big leagues and, when he went to Harrisburg to start the year, eased him into it.\n\nLeCroy watched and saw solid mechanics. Barrett breezed through his first seven appearances, allowing one run total. He hiccupped in late April, allowing three runs in two innings, but the Nationals had seen what they needed to. LeCroy tested Barrett, needing him to provide honest feedback, and he felt satisfied in May. They initiated the process.\n\nThe Senators started Barrett with one inning. Then they made them high-leverage opportunities at the end of games. Then they stretched him to two innings. They stopped telling him when he’d go in, or how many innings to expect. They warmed him up in the bullpen then never put him in. They did that and then used him the next day. They tried him in back-to-back outings and, at first, his stuff looked shaky the second time out.\n\n“You have to see, okay, can his arm hold up over the course of months?” Harris said. “This was unchartered waters for us in terms of everything he’s been through, so you wanted to see how he stood up.”\n\nThe stuff and the results steadily improved. Barrett surprised LeCroy because, unlike most pitchers, he got stronger as the year went on, as his innings added up. Barrett’s velocity climbed, almost to where it had once been. He developed a change-up, a weapon he never had before, and he used it reliably to get lefties out. His confidence grew. Nationals brass noticed this work and, around July, as Barrett strung together a 20-inning scoreless streak, suspected they would be able to use him.\n\nOn Saturday, in Barrett’s last outing, he allowed two runs in an inning. It gave him a 2.75 ERA in 50 games — a nearly identical stat line to his first season in the majors. The numbers validated his approach, but the moment LeCroy delivered the news showed him it truly worked. He had made it all the way back in a season that defined his entire professional life.\n\n“He was tested a lot, and he never lost faith,” Harris said. “He persevered.”\n\nRead more on the Nationals:\n\nPerspective: The Nats can’t let Anthony Rendon — his bat, his glove, his personality — get away\n\nJuan Soto is improving his defense one step at a time\n\nAnalysis: Sean Doolittle is a great teammate. The Nationals need him to be a great closer, too.\n\nSchedule analysis of National League contenders reveals possible playoff picture for Nationals\n\nBatting practice pitcher Ali Modami is the Nationals’ secret good luck charm", "description": "Barrett underwent Tommy John surgery in 2015, then broke his arm while throwing during his rehab. But he has made it all the way back to the big leagues.", "authors": ["Sam Fortier", "Sports Reporter", "September At Pm", "Sam Fortier Is A Sports Reporter For The Washington Post."], "top_image": "https://www.washingtonpost.com/resizer/QYxD8kF2UQp-APBqaE8j8tJcqVw=/1484x0/d1i4t8bqe7zgj6.cloudfront.net/09-04-2019/t_75797f05c13a4b63be1f2d55113a638f_name_1___1920x1080___30p_00_00_24_01_Still023.jpg"}