{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/zuckerberg-aoc-video-white-supremacy-congress-hearing-ocasio-cortez-a9168666.html", "downloaded_at": "2019-10-24 00:39:31.612799+00:00", "title": "Zuckerberg stumbles over AOC's questions about white supremacy during Congress hearing", "language": "en", "text": "Mark Zuckerberg appeared to stumble when confronted with tough questioning by congresswoman Alexandria Ocasio-Cortez, who asked the Facebook CEO if a right-wing news outlet known for its ties to white supremacist groups is an appropriate fact-checking group to help oversee the social media giant's content.\n\nMs Ocasio-Cortez confronted Mr Zuckerberg during congressional testimony on Wednesday, where the CEO was due to discuss a cryptocurrency favoured by his company. But the Democrat instead chose to grill him about Facebook's decision not to fact check political advertisements, even in cases where messages posted by politicians are clearly wrong.\n\nShe also asked about Mr Zuckerberg's previous admission that he dines regularly with conservatives and right-wing personalities, which he said is part of his strategy to ensure he hears a diverse set of opinions.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\n\"Can you explain why you have named the Daily Caller, a publication well documented with ties to white supremacists as an official fact checker for Facebook?\" Ms Ocasio-Cortez asked.\n\nMr Zuckerberg replied that Facebook does not itself appoint fact checkers on its platform, and instead relies on the International Fact Checking Network (IFCN), a fact checking organisation established by the journalism integrity group Poynter.\n\n\"You would say that white supremacist tied publications meet a rigorous standard for fact checking?\" Ms Ocasio-Cortez responded.\n\nShape Created with Sketch. Facebook birthday: 15 defining moments for the social network Show all 15 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Facebook birthday: 15 defining moments for the social network 1/15 Facebook is born On 4 Feb, 2004, 19-year-old Harvard student Mark Zuckerberg launched a website called 'TheFacebook' from his dorm. Within 24 hours the college social network had more than 1,000 users Wikimedia Commons 2/15 Winklevoss twins sue Zuckerberg Within one week of launching, fellow Harvard students Cameron Winklevoss, Tyler Winklevoss and Divya Narendra accused Zuckerberg of stealing their idea. It would be four years later when the resulting lawsuit was finally settled 3/15 Open for business The social network finally opened it platform to everyone on 26 September, 2006. The move proved the catalyst in supercharging the site's already explosive growth PA 4/15 Billion-dollar bid Yahoo offered $1 billion to buy Facebook in September 2006 but Zuckerberg turned it down. 'I don’t know what I could do with the money,' Zuckerberg reportedly said. 'I’d just start another social networking site' Reuters 5/15 In the money In September 2009, almost five years since the site launched, Facebook turned a profit for the first time Getty Images/iStockphoto 6/15 Taking the lead Facebook overtook MySpace in 2010 to become the world’s most popular social network 7/15 Taking on the tech giants In 2011, Google launched its own social network that it hoped would knock Facebook from its perch. Despite its initial success, Google+ ultimately failed and will be shut down completely in 2019 Getty 8/15 Facebook goes public On 18 May, 2012, Facebook went public. The initial public offering raised $16 billion – the third largest in US history 9/15 Gobbling up the competition Facebook acquired Instagram in April 2012 for $1 billion, consolidating its position as the world's leading social network Reuters 10/15 One billion users On 4 October, 2012, Zuckerberg announced that Facebook had hit 1 billion users. 'If you’re reading this: thank you for giving me and my little team the honour of serving you,' he wrote in a blog post Getty Images 11/15 Expanding its empire In February 2014 Facebook acquired the messaging app WhatsApp for $19.3 billion REUTERS/Dado Ruvic 12/15 Two billion users In June 2017, Facebook passed the 2 billion user milestone REUTERS/Dado Ruvic 13/15 Privacy scandal On 17 March 2018, news broke that UK firm Cambridge Analytica had harvested data from around 87 million Facebook users for the purpose of political profiling in the build up to the 2016 US presidential elections Shutterstock 14/15 Record profits Despite the scandals and subsequent #DeleteFacebook campaign, Facebook posted record profits just before its 15th anniversary, the equivalent of $7.37 from each of its 2.32 billions users iStock/Independent 15/15 Unhappy users A study found that people are happier when they don’t use Facebook, adding to mounting evidence surrounding the impact social media has on mental health Rex Features 1/15 Facebook is born On 4 Feb, 2004, 19-year-old Harvard student Mark Zuckerberg launched a website called 'TheFacebook' from his dorm. Within 24 hours the college social network had more than 1,000 users Wikimedia Commons 2/15 Winklevoss twins sue Zuckerberg Within one week of launching, fellow Harvard students Cameron Winklevoss, Tyler Winklevoss and Divya Narendra accused Zuckerberg of stealing their idea. It would be four years later when the resulting lawsuit was finally settled 3/15 Open for business The social network finally opened it platform to everyone on 26 September, 2006. The move proved the catalyst in supercharging the site's already explosive growth PA 4/15 Billion-dollar bid Yahoo offered $1 billion to buy Facebook in September 2006 but Zuckerberg turned it down. 'I don’t know what I could do with the money,' Zuckerberg reportedly said. 'I’d just start another social networking site' Reuters 5/15 In the money In September 2009, almost five years since the site launched, Facebook turned a profit for the first time Getty Images/iStockphoto 6/15 Taking the lead Facebook overtook MySpace in 2010 to become the world’s most popular social network 7/15 Taking on the tech giants In 2011, Google launched its own social network that it hoped would knock Facebook from its perch. Despite its initial success, Google+ ultimately failed and will be shut down completely in 2019 Getty 8/15 Facebook goes public On 18 May, 2012, Facebook went public. The initial public offering raised $16 billion – the third largest in US history 9/15 Gobbling up the competition Facebook acquired Instagram in April 2012 for $1 billion, consolidating its position as the world's leading social network Reuters 10/15 One billion users On 4 October, 2012, Zuckerberg announced that Facebook had hit 1 billion users. 'If you’re reading this: thank you for giving me and my little team the honour of serving you,' he wrote in a blog post Getty Images 11/15 Expanding its empire In February 2014 Facebook acquired the messaging app WhatsApp for $19.3 billion REUTERS/Dado Ruvic 12/15 Two billion users In June 2017, Facebook passed the 2 billion user milestone REUTERS/Dado Ruvic 13/15 Privacy scandal On 17 March 2018, news broke that UK firm Cambridge Analytica had harvested data from around 87 million Facebook users for the purpose of political profiling in the build up to the 2016 US presidential elections Shutterstock 14/15 Record profits Despite the scandals and subsequent #DeleteFacebook campaign, Facebook posted record profits just before its 15th anniversary, the equivalent of $7.37 from each of its 2.32 billions users iStock/Independent 15/15 Unhappy users A study found that people are happier when they don’t use Facebook, adding to mounting evidence surrounding the impact social media has on mental health Rex Features\n\nAt this point, Mr Zuckerberg turned his head away and stared ahead for a moment, appearing to look for some form of guidance.\n\nHe then responded: \"Congresswoman I would say that we're not the ones assessing that standard, the International Fact Checking Network is the one setting that standard.\n\nThe Independent has reached out to IFCN for comment and clarification.\n\nDuring her five minutes, Ms Ocasio-Cortez also grilled the Facebook CEO on his company's recent declaration that politicians who post political ads with lies would not be fact checks. That decision prompted outrage among politicians, including by leading Democratic presidential contender Elizabeth Warren, who responded by having her campaign post an intentionally false advert to prove the point. Ms Warren has notably called for the breakup of big tech companies like Facebook.\n\n\"Could I pay to to target predominantly black zip codes and pay to advertise to them the incorrect election date?\" Ms Ocasio-Cortez said.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\n\"No, congresswoman, you couldn't,\" Mr Zuckerberg replied, before beginning an explanation about newsworthiness that Ms Ocasio-Cortez cut short.\n\n\"But you said you're not going to fact check my ads,\" she replied.\n\n\"If anyone, including a politician is saying things that can cause, that is calling for violence or could risk imminent physical hard or voter or census suppression ... we will take that content down,\" he said.\n\nShe responded asking that there are, then, certain circumstances.\n\n\"Could I run ads targeting Republicans in primaries saying that they voted for the Green New Deal?\" she then asked.\n\nMr Zuckerberg then said he doesn't know the answer \"off the top of my head\", but that he think she could \"probably\" run those adverts.", "description": "Mark Zuckerberg appeared to stumble when confronted with tough questioning by congresswoman Alexandria Ocasio-Cortez, who asked the Facebook CEO if a right-wing news outlet known for its ties to white supremacist groups is an appropriate fact-checking group to help oversee the social media giant's content.", "authors": ["Clark Mindock"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/23/16/aoc-zuckerberg.jpg", "published_at": "2019-10-23"}