{"pub": "usatoday", "url": "https://usatoday.com/story/travel/2019/10/16/moma-reopens-museum-modern-art-new-york-opens-oct-21/3983343002", "downloaded_at": "2019-10-16 21:18:14.055233+00:00", "title": "'A new MoMA': New York's Museum of Modern Art reopening after $450 million expansion", "language": "en", "text": "CLOSE\n\nNEW YORK — Pushing into the revolving doors of 11 West 53rd Street and emerging into space dominated by white light from a flickering fixture dangling above and permeated by sounds of visitors interacting with art, you know you're at the Museum of Modern Art.\n\nFor four years, the MoMA, which \"reflects the vitality, complexity and unfolding patterns of modern and contemporary art,\" according to its mission statement, has been unfolding a new pattern of its own.\n\nNow, the completed work is ready to be shown off, the newly redone lobby included.\n\nOn Oct. 21, \"a new MoMA\" will open to the public after being closed for four months, with about 40,000 additional square feet of gallery space in Manhattan. Members will have a chance to see the museum early, with a preview Oct. 19.\n\nTo complete the $450 million project, the museum teamed up with architects Diller Scofidio + Renfro in collaboration with Gensler.\n\n\"There are a lot of things to be excited about in this building,\" Sarah Suzuki, director for the opening of the new museum and curator of drawings and prints, told USA TODAY.\n\nOn the whole, the museum, which sees roughly 3 million visitors annually, has expanded by more than 100,000 square feet, according to a release from MoMA.\n\nPlanning a visit to NYC soon? Here are 5 things you should know\n\nWhile the project has been ongoing for years, the museum was operational until June 15, Suzuki said.\n\nAfter a few months spent closed off from the world, it's ready to welcome guests and \"bring people a new experience\" when they walk through the doors, Suzuki said.\n\nMembers of the media tour the newly renovated Museum of Modern Art in New York on Oct. 15, 2019. The artwork will be rotated on a six-month basis, according to MoMA's release. That action will \"constantly renew the presentation.\" (Photo: Jennifer S. Altman, for USA TODAY)\n\nThe renovation includes the additional gallery space, a creativity lab, an expanded ground floor and re-installations of the collection galleries in the fifth-, fourth- and second-floor.\n\n\"There was a pretty thorough renovation of our existing campus and an expansion to the west,\" explained Suzuki.\n\nThere's new gallery space, a new studio for performances and an the upgraded open, double-height lobby. A new dining location, The Carroll and Milton Petrie Terrace Café, will open with the unveiling of the renovations, as well. Other dining options such as Café 2 will reopen as well, while The Modern, a full restaurant, will continue to operate. It remained open through the renovations.\n\nThe collection galleries, Suzuki said, have been re-imagined. On the walls, visitors will find what Suzuki said they like to call \"old friends\" – classics one expects to find at the MoMA such as \"The Starry Night\" by Vincent van Gogh – next to new neighbors.\n\nThe expansion and refresh of the galleries allow more artwork to be displayed in a comprehensive way, split up by period.\n\nMembers of the media tour the newly renovated Museum of Modern Art in New York on Oct. 15, 2019. (Photo: Jennifer S. Altman, for USA TODAY)\n\nThe collection begins in 1890 and follows a chronological backbone. The earliest period housed in the museum is displayed on the fifth floor. As visitors descend, they advance in the modern art timeline to present day while perusing gallery collections, including in the brand-new David Geffen Wing.\n\nThe hope, Suzuki said, is that pieces of art that are a part of the MoMA's cornerstone collection paired with exciting and unfamiliar works will spark inspiration and curiosity.\n\nThe work will be rotated on a six-month basis, according to MoMA's release. That action will \"constantly renew the presentation.\"\n\nIn addition to the renovation, the museum will also reveal several exhibits on Oct. 21 including:\n\nThe art in the inaugural exhibitions is drawn from MoMA's collection of modern and contemporary art.\n\nYou have to see this immersive art: From Chihuly glass to the Museum of Ice Cream\n\nBut the project doesn't stop there, the MoMA Design Store launched a new flagship in the museum.\n\nEmmanuel Plat, direct of merchandising, explained to USA TODAY that with the new store, they expanded into the room below, which used to be for storage. A wall of books occupies two stories in the double-height retail location.\n\nWith the reopening, MoMA has collaborated with brands such as Vans, UNIQLO, IZIPIZI and PLEATS PLEASE to create custom MoMA products.\n\n\"Inspired by Alfred Barr's original vision to be an experimental museum in New York, the real value of this expansion is not just more space, but space that allows us to rethink the experience of art in the Museum,\" said Glenn Lowry, The David Rockefeller director of the MoMA, in a release.\n\nAdmission to the museum costs $25 for adults, $18 for seniors, $14 for students and is free for children 16 and under. The museum will be open from 10 a.m. to 5:30 p.m. Saturdays through Thursdays and closes late on Friday at 9 p.m., during which guests are admitted at no charge for UNIQLO Free Friday Nights.\n\nFollow Morgan Hines on Twitter: @MorganEmHines.\n\nRead or Share this story: https://www.usatoday.com/story/travel/2019/10/16/moma-reopens-museum-modern-art-new-york-opens-oct-21/3983343002/", "description": "On Oct. 21, the MoMA in New York will reopen to the public with more than 40,000 additional square feet of gallery space.", "authors": ["Morgan Hines", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/16/USAT/59b783f2-6ad9-4047-bed5-461d94541ff0-moma_renovation_preview22.jpg?crop=7359,4139,x1,y733&width=3200&height=1680&fit=bounds", "published_at": "2019-10-16"}