{"pub": "dailymail", "url": "https://dailymail.co.uk/sciencetech/article-7614307/Report-SpaceX-conduct-critical-Crew-Dragon-test-week-explosion.html", "downloaded_at": "2019-10-26 00:18:40.250361+00:00", "title": "Report: SpaceX may conduct critical Crew Dragon test next week - the first since an explosion", "language": "en", "text": "SpaceX's Crew Dragon capsule designed to shuttle NASA astronauts to the International Space Station may soon undergo its biggest text since exploding in April.\n\nAccording to a report from CNBC, the company may conduct a static fire test as soon as next week - November 2 - out of NASA's Cape Canaveral station in Florida.\n\nA static fire involves testing a rocket's powerful propulsion system without actually lifting the craft off the ground. They're designed to simulate conditions of a real lift-off.\n\nSpaceX's Crew Dragon capsule may soon undergo its first big safety test since an explosion destroyed the pod in April\n\nFor both SpaceX and NASA, which the company is developing the craft for, the test will mark a significant step after an explosion during tests of Crew Dragon in April that engulfed the empty capsule in fire and smoke.\n\nThe hitch, caused by a leaking component, destroyed the capsule and has contributed to SpaceX's delayed timeline for Crew Dragon.\n\nThose delays recently caught the ire of NASA Administrator, Jim Bridenstine who held a joint conference with SpaceX CEO Elon Musk after maligning the company on Twitter.\n\n'I have been focused on returning to realism when it comes to costs and schedules,' said the NASA Administrator.\n\n'So I was signaling - and I haven't done it just to SpaceX but to all of our contractors - that we need more realism built into the development timelines.'\n\nDespite the setbacks, Musk says Crew Dragon could be cleared to transport its first passengers into space as soon as December.\n\nSpaceX is among the companies looking to pave the way for commercial space flight with its Crew Dragon capsule (the pod rendered at the bottom of the picture) that can fit seven passengers\n\nIn a tweet this month, Musk said that the both the Crew Dragon capsule and the Falcon 9 rocket designed to propel it into space are on pace to finish testing in the next 10 weeks.\n\n'For what it’s worth, the SpaceX schedule, which I’ve just reviewed in depth, shows Falcon & Dragon at the Cape & all testing done in ~10 weeks,' wrote Musk in a tweet.\n\nThe last hurtle before being approved for human flight will be a critical launch trial in which the Crew Dragon's In-Flight Abort functions are tested.\n\nDuring this test, the craft is launched into high-altitude and is tasked with aborting the capsule during high-velocity, which is the most stressful point of the launch.", "description": "SpaceX may conduct a static fire test as soon as next week - November 2 - out of NASA's Cap Canaveral station in Florida. This would be the first major test since in April explosion.", "authors": ["James Pero For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/25/16/8233680-0-image-a-8_1572017824012.jpg", "published_at": "2019-10-25"}