{"pub": "afr", "url": "https://afr.com/technology/mortgage-disrupter-sets-new-funding-record-20191016-p531dg", "downloaded_at": "2019-10-21 02:23:31.341744+00:00", "title": "Mortgage disrupter sets new funding record", "language": "en", "text": "Athena co-founder and chief executive Nathan Walsh told The Australian Financial Review it already had a waiting list of people wanting to take out a new home loan.\n\n\"Home loans for home purchase are 80 per cent of the market. We’re going from targeting 20 per cent with refinancing to now the full segment,\" he said.\n\n\"It's such a big market problem we're trying to solve and to show that the local VC ecosystem can support it is really exciting.\"\n\nBig money\n\nThe business only started refinancing loans at the start of the year, but had already raised more than $40 million in capital. In total it has now raised $115 million, with this latest round valuing the company at $250 million.\n\nThe fintech claims to save borrowers an average of $60,000 over the life of their loan, starting with an online platform that simplifies the application process.\n\nAthena Home Loans co-founders Nathan Walsh and Michael Starkey with the investors in their $70 million raise. Supplied\n\nIts model also cuts out the banks by funding loans directly from alternate sources of capital, such as warehouse lending, or superannuation funds.\n\nAdvertisement\n\nUnlike the big banks, Athena has also passed on each of the three Reserve Bank of Australia (RBA) quarter-point rate cuts in full this year and has a guarantee to never impose a so-called \"loyalty tax\" on customers, by ensuring existing customers never pay more than new customers.\n\nMr Walsh said consumers/ expectations were changing and that one of the most common reasons for customers signing up was their frustration with the loyalty tax imposed by the big banks.\n\n\"People are looking at these moments of truth where the RBA cut rates and for the third time in a row we're passing it on in full, instantly, to both new and existing borrowers and of the 12 largest home lenders in Australia, that's not true of any of them,\" he said.\n\n\"People are saying they want something new in this market.\n\n\"We were really early in taking a stance on a bunch of issues, such as the awareness of the loyalty tax. We're the only ones in the market with an automatic rate match guaranee where existing borrowers will never pay more than a new borrower on a like-for-like loan.\"\n\nLast week the Australian Competition and Consumer Commission announced an inquiry into home loan pricing, with the loyalty tax being a key component of its investigation.\n\nAthena's current owner occupier, principle and interest, rate is 2.84 per cent (a 2.8 per cent comparison rate), while its investor interest-only rate is 3.34 per cent (3.24 per cent comparison rate).\n\nAdvertisement\n\nSince the RBA's last rate cut on October 1, Athena had its biggest influx of new customers, with more than $1 billion worth of applications coming in.\n\nAustralianSuper senior portfolio manger for Australian equities, Shaun Manuell, said Athena's home loan offers made it a good investment for the fund.\n\n\"The fund is increasingly finding attractive opportunities in venture capital, along with the other investments we’re making in smaller-sized Australian companies,\" he said.\n\nAirTree Ventures partner James Cameron said the ability for local funds to complete a round as big as Athena's without offshore investors, was a sign of the increasing maturity of the sector.\n\nIn November last year Athena set a goal of lending $1 billion in its first year and Mr Walsh said the start-up would comfortably achieve. He claimed it was on track to become the country's biggest fintech company.\n\n\"There's a $2.2 trillion deposit pool in Australia and mortgages are to some extent designed around that pool, but the wholesale funding pools of deposits are much larger and growing much faster,\" he said.\n\n\"We talk about the $2.7 trillion in super which is going to increase to $5 trillion and then $10 trillion, or the $17 trillion in bonds at negative interest rates in which high quality mortgages are an attractive asset class.\n\n\"A big part of this as well is that the community expectations are changing very quickly and there's a need for incumbent business models to shift quickly as well.\"", "description": "AustralianSuper has made its first direct investment in a start-up, in the largest capital raise led by local VC funds, for ex-NAB bankers' Athena Home Loans.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.2608%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_366%2C$y_68/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/d794572f555e715546cf40383d48638410e99e10", "published_at": "2019-10-16"}