{"pub": "yahoo", "url": "https://news.yahoo.com/houdini-escape-leaves-canada-divided-094503076.html", "downloaded_at": "2019-10-22 13:30:32.392524+00:00", "title": "A Houdini-Like Escape Leaves Canada Divided", "language": "en", "text": "(Bloomberg) -- Want to receive this post in your inbox every day? Sign up for the Balance of Power newsletter, and follow Bloomberg Politics on Twitter and Facebook for more.Justin Trudeau has hung on, barely.\n\nHe won over Canada’s urban voters to cling to power in a minority parliament — despite losing the popular vote.\n\nAlthough his mandate has been weakened, the result will come as a relief for Trudeau. He entered the campaign wounded by a scandal over his handling of a judicial case and was further rocked by revelations he wore blackface at least three times when he was younger.\n\nA second term will allow him to cement one of the most left-leaning agendas the country has seen in at least a generation — progressive on social issues, willing to run deficits to tackle income disparities, assertive on climate change and fervently internationalist in an era of populist nativism.\n\nBut the result has exposed a deep fault line between rural Canada and its biggest cities, as well as a stark regional split. The Conservatives, traditional champions of the oil sector, finished strongly in the western provinces, while the separatist Bloc Quebecois more than tripled its tally from 2015.\n\nTrudeau will now need to tread carefully after this obvious rebuke, and prepare to ramp up spending to win the support he’ll need as head of a minority government.\n\nGlobal Headlines\n\nDown to the wire | The future of Syria may come down to a meeting between Russian President Vladimir Putin and Turkey’s Recep Tayyip Erdogan today. With the clock ticking on Ankara’s cease-fire for Kurdish fighters to leave northeastern Syria, Putin may press Erdogan to talk with Syrian President Bashar al-Assad to prevent a clash between Syrian and Turkish troops.\n\nLobbying blitz | Huawei’s lobbying spending spiked in the third quarter as the Chinese telecom colossus hired a fundraiser for Trump with deep ties to the Republican leadership to help it fight back against the administration’s blacklisting of the company from the U.S. market. Facebook and Amazon.com also set federal lobbying records as Washington ramps up oversight of the tech giants’ business practices.\n\nShaken ‘oasis’ | A country that regularly tops Latin America’s general prosperity metrics, Chile has been rocked by upheaval over the past four days after a protest over a subway-fare hike morphed into an outpouring of broad discontent over economic inequality. The protests, organized mainly on social media, have killed 11 people and brought cities to a near standstill.\n\nUnfamiliar home | As Hong Kong’s historic pro-democracy protests become more violent, the more than 1 million mainland Chinese who migrated to the city in recent decades are becoming increasingly fearful. Mainlanders eschew Mandarin Chinese, while out in the Cantonese-speaking city, they monitor social media to avoid protesters and regularly flee across the border to escape the weekend chaos.\n\nPrisoner’s dilemma | When NATO jets bombed Serb forces 20 years ago to force them out of Kosovo, Albin Kurti was convicted of terrorism, beaten in jail and packed onto a bus with other political prisoners to be used as a human shield. Now, after his party won this month’s snap elections in the strategically important nation, it will be up to him to try to mend ties with Serbia to open the way for the neighbors to join the European Union.\n\nWhat to Watch\n\nBritish Prime Minister Boris Johnson will find out this evening whether he has a chance of getting his Brexit deal through Parliament ahead of the Oct. 31 deadline with the second reading of his Withdrawal Agreement Bill. House Democrats are looking to significantly advance the impeachment probe of Trump with testimony today from the top U.S. diplomat to Ukraine, William Taylor, who had warned it was “crazy” to withhold military aid to get dirt on the president’s political rivals. Israel may be heading for a third election in less than a year after Prime Minister Benjamin Netanyahu again failed to form a government. Now his centrist rival Benny Gantz will try, but he faces a similarly tough road to mustering a ruling majority. The Khama family has been synonymous with political power in the diamond-producing nation of Botswana, but its role is likely to be diminished after tomorrow’s general election following a split between former president Ian Khama and his successor, Mokgweetsi Masisi.", "description": "(Bloomberg) -- Want to receive this post in your inbox every day? Sign up for the Balance of Power newsletter, and follow Bloomberg Politics on Twitter and Facebook for more.Justin Trudeau has hung on, barely.He won over Canada’s urban voters to cling to power in a minority parliament — despite losing", "authors": ["Josh Wingrove"], "top_image": "https://s.yimg.com/uu/api/res/1.2/VxjMtOn3Wh5eRUtpd6HZHw--~B/aD0xMzg1O3c9MjAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/bloomberg_politics_602/e76b24d3c89cf832d76a05ca51198963", "published_at": "2019-10-22"}