{"pub": "breitbart", "url": "https://breitbart.com/news/england-lose-to-czechs-in-euro-qualifiers-as-ronaldo-nears-700-goals", "downloaded_at": "2019-10-12 00:24:40.872520+00:00", "title": "England lose to Czechs in Euro qualifiers as Ronaldo nears 700 goals", "language": "en", "text": "Paris (AFP) – England missed an opportunity to qualify for Euro 2020 on Friday as they slid to a 2-1 loss in the Czech Republic, while Cristiano Ronaldo scored his 699th goal in a routine Portugal win over Luxembourg.\n\nHarry Kane converted a fifth-minute penalty in Prague after Raheem Sterling was clipped by Lukas Masopust, the Tottenham striker taking his qualifying tally to seven goals.\n\nBut Czech Republic, humbled 5-0 by England in the reverse fixture last March, levelled shortly after as Jakub Brabec bundled in from a corner for his first international goal.\n\nSubstitute Zdenek Ondrasek swept home the winner on his debut for the hosts on 85 minutes, a goal that ended England’s decade-long unbeaten run in qualifying spanning 43 matches.\n\n“I think we have had a lot of credit over the last couple of years and tonight we did not do enough,” England manager Gareth Southgate told ITV.\n\n“Our performance was not good enough, it’s as simple as that. The goals we conceded were typical of the chances we gave away.”\n\nEngland’s last qualifying defeat came ahead of the 2010 World Cup when they lost 1-0 away to Ukraine in October 2009.\n\nSouthgate’s side remain top of Group A on 12 points alongside the Czechs, who have played a game extra. England could still clinch qualification on Monday with victory in Bulgaria if Kosovo fail to beat Montenegro.\n\nWorld champions France claimed a 1-0 win away to Iceland as Olivier Giroud delivered the only goal with a penalty on 66 minutes in Reykjavik.\n\nGiroud has played sparingly for Chelsea this season but the 33-year-old is now just four goals behind Michel Platini (41) for second on France’s list of all-time leading scorers.\n\nFrance are level on 18 points with Turkey atop Group H ahead of Monday’s showdown in Paris, where victory would send Didier Deschamps’ men through to the finals.\n\n“It was very difficult, a really hard match. We needed to take the three points and now we have an important game coming up at home,” said Antoine Griezmann, who was fouled for the penalty.\n\n“We’re going to suffer against Turkey and we’ll need to prepare well for it.”\n\nCenk Tosun popped up with a 90th-minute winner for Turkey as they scraped past Albania 1-0 in Istanbul.\n\nIceland’s first home loss in qualifying since June 2013 dropped the Nordic island nation six points adrift of the top two.\n\nJuventus star Ronaldo grabbed his 94th goal at international level in Portugal’s 3-0 home victory over Luxembourg.\n\nBernardo Silva opened the scoring in Lisbon in the first half before Ronaldo added a second on 65 minutes with a magnificent chip following an error in the visitors’ defence.\n\nGoncalo Guedes added a late third although defending champions Portugal still trail Group B leaders Ukraine by five points.\n\n“We are already thinking about the crucial game with Ukraine, like we did for this one,” said Portugal coach Fernando Santos.\n\n“There are four finals left and this one is over. We want to finish first.”\n\nPortugal next travel to Kiev to face a Ukraine side on the cusp of qualification following a 2-0 home win over Lithuania secured by Atalanta midfielder Ruslan Malinovskyi’s brace.\n\nA goalless draw between Montenegro and Bulgaria eliminated both teams from contention in Group A, while it was a night to remember for Andorra.\n\nThe minnows won their first European qualifier in history after 56 defeats in a row as Marc Vales’ second-half header earned Andorra a 1-0 victory over 10-man Moldova.", "description": "Paris (AFP) – England missed an opportunity to qualify for Euro 2020 on Friday as they slid to a 2-1 loss in the Czech Republic, while Cristiano", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/11/7b0968_zdenek-ondrasek-off-bench-end-england-43-unbeaten-run-in-qualifying-major-640x335.jpg", "published_at": "2019-10-11"}