{"pub": "dailymail", "url": "https://dailymail.co.uk/money/mortgageshome/article-7423403/Would-shared-ownership-plans-buy-1-home-time-work.html", "downloaded_at": "2019-10-22 13:49:17.771637+00:00", "title": "Would shared ownership plans to buy 1% of a home at a time work?", "language": "en", "text": "Homeowners with shared ownership properties may soon be able to buy shares in their homes in increments of just 1 per cent.\n\nA government announcement that the system is set to be tweaked would dramatically change the home ownership scheme, which allows buyers to purchase a portion of a property and pay a subsidised rent on the remaining portion.\n\nUnder shared ownership, buyers can purchase small stakes, for example 25 per cent, and then build them up. At present, if these homeowners want to buy more of their home they can only do so in minimum 10 per cent chunks.\n\nHousing secretary Robert Jenrick has announced proposals to tweak shared ownership rules\n\nHousing secretary Robert Jenrick has announced proposals to change the system so that these homeowners can buy shares in their property in increments of just 1 per cent.\n\nTo buy the home in the first place they must have already purchased a larger stake, however, and there are no plans to let people start from just 1 per cent.\n\nBut the new minister has come in for scrutiny as critics claim his maiden policy announcement does not go far enough and may not be workable in practice.\n\nWe take a look at what is being suggested for shared ownership?\n\nWhat are the shared ownership proposals?\n\nShared ownership allows buyers to buy a portion of their home and pay rent on the remaining portion.\n\nThey can then buy extra shares in the property until they own it outright - at which point they no longer have to pay any rent - in a process known as 'staircasing'.\n\nWhile it varies from provider to provider, at present the system generally only allows for homeowners to buy these shares in 10 per cent chunks, which can be as much as £45,000 at a time dependent on a property's value.\n\nThe Government is now proposing to allow shared ownership homeowners to staircase in 1 per cent portions instead - potentially making it easier and more affordable to build a stake.\n\nRobert Jenrick MP said: 'I am announcing radical changes to shared ownership so we can make it simpler and easier for tens of thousands trying to buy their own home.\n\n'I will be looking at ensuring young people from Cornwall to Cumbria aren't priced out of their home areas and how we can build public support for more house building and better planning.'\n\nWould this work?\n\nKnow the shared ownership risks Though for some it can be a useful way to get onto the property ladder, the shared ownership scheme has several flaws which potential buyers should be aware of. Firstly, all shared ownership properties are sold on a leasehold basis. Not only does that mean you'll have to pay an annual ground rent, but could potentially cause complications when it comes time to sell. You may also have to pay service charges, which aren't capped and can rise without your consent. On top of this, you will have to pay for all your own repairs, despite paying rent, unlike in a normal tenancy. Polly Neate, chief executive of Shelter, said: 'Pinning his hopes on yet another complicated housing scheme is a worrying start for the new housing secretary of state. 'The Government must realise that unworkable schemes, laden down with admin costs, are the wrong priority.'\n\nIf, for example, a family in a £150,000 shared ownership property wanted to staircase at present they would have to pay off £15,000 at a time to increase their stake and decrease their rent – an amount beyond the reach of many.\n\nUnder the new scheme, in theory they only have to pay off 1 per cent at a time, or £1,500,\n\nBut it's not as straightforward as it seems - at present there are several different additional costs that may make staircasing in smaller increments less affordable than it appears.\n\nA shared ownership loan is an equity loan, meaning that as the value of the home rises, the loan does with it.\n\nThis means that a homeowner has to pay a surveyor to produce a valuation report to determine the value of the home every time they staircase.\n\nOn top of this they will also have to pay legal fees.\n\nHousing associations do not take any share of the bill for conveyancers when a homeowner is staircasing.\n\nAccording to Homeowners Alliance, these extra costs typically add an extra £2,000 on top of the price of the shares themselves when staircasing.\n\nFor the example above, this means that every time the family bought an extra 1 per cent share in their house for £1,500 they would have to pay an extra £2,000 in fees. Clearly, that is not economical.\n\nSo far the Ministry of Housing has made no mention of these additional costs, or whether any changes to the existing rules would take these costs into account.\n\nSarah Guershon, mortgage expert at Bankrate, said: 'To those for whom home ownership seems unaffordable, [this policy] is unlikely to make a big enough difference.\n\n'Help to buy and shared ownership properties are in limited supply and, as new builds, often come at a price premium.\n\n'With shared ownership properties in particular, this means that it's possible to end up spending the same amount of money buying a given share of a home, compared to owning a whole non-help to buy property.'", "description": "Housing secretary Robert Jenrick has announced proposals to tweak the system so that homeowners can buy extra shares in their property in increments of just 1%", "authors": ["Will Kirkman For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/09/04/16/18064250-0-image-a-3_1567610712166.jpg", "published_at": "2019-09-16"}