{"pub": "yahoo", "url": "https://finance.yahoo.com/news/saudi-gulf-stocks-fall-attacks-140531267.html", "downloaded_at": "2019-09-15 23:11:28.972540+00:00", "title": "Saudi, Gulf stocks fall after attacks on Aramco oil plants", "language": "en", "text": "By Saeed Azhar and Marwa Rashad\n\nDUBAI/RIYADH (Reuters) - Saudi stocks fell sharply on Sunday, after attacks on two plants at the heart of the kingdom's oil industry a day earlier knocked out more than half of Saudi crude output.\n\nSunday's decline extended a losing spree for Saudi stocks, which in recent weeks have been hit by expensive valuations, weak oil prices and concerns about the economic outlook.\n\nThe drone attacks were carried out by Yemen's Houthi group, its military spokesman said on Al Masirah TV.\n\nThe index opened down 2.3% but later pared some losses.\n\nAt 0914 GMT, the Saudi market was down 1.3%. The index has lost all its gains this year and is down about 18% from its 2019 high of 9,403 points seen in early May.\n\nThe index's earlier gains were fueled by Saudi Arabia's entry into the MSCI and FTSE Russell's emerging market indices, but analysts said that effect had faded in recent weeks.\n\nSaudi Basic Industries (SABIC), the kingdom's biggest petrochemicals firm, was down 2.4% after it said it had curtailed feedback supplies by about 49% following the attacks.\n\nAramco has agreed to buy a 70% stake in SABIC from the state Public Investment Fund in a $69.1 billion deal that is awaiting regulatory approvals.\n\nOther petrochemical companies such as Yanbu National Petrochemicals Co and Kayan also announced significant reductions in feedstock supplies.\n\n\"The stock market has been affected, especially the petchem sector, (as) the efficiency of some major companies will be about 50% in the coming 10 days,\" said Mazen al-Sudairi, head of research at Al Rajhi Capital.\n\nOther Gulf markets also reacted negatively to the attacks, with Kuwait's premier index down 0.4% and Dubai stocks falling 0.5%, although they recovered from sharper intraday losses.\n\nThe attacks come at a bad time for Saudi Arabia, which is preparing for the listing of oil giant Saudi Aramco on the Tadawul bourse in Riyadh later this year.\n\nThe attacks are unlikely to change plans for Aramco’s long-awaited initial public offering but may affect the valuation, risk consultancy Eurasia Group said in a note.\n\n\"The latest attack on Aramco facilities will have only a limited impact on interest in Aramco shares as the first stage of the IPO will be local. The international component of the sale would be more sensitive to geopolitical risks,\" it said.\n\nAramco has hired nine banks as joint global coordinators to lead its IPO, slated to be the world's largest, Reuters reported, citing two sources.\n\n\n\n\n\n(Additional reporting by Dmitry Zhdannikov in London; Editing by Dale Hudson)", "description": "DUBAI/RIYADH (Reuters) - Saudi stocks fell sharply on Sunday, after attacks on two plants at the heart of the kingdom's oil industry a day earlier knocked out more than half of Saudi crude output.  Sunday's decline extended a losing spree for Saudi stocks, which in recent weeks have been hit", "authors": ["Saeed Azhar", "Marwa Rashad"], "top_image": "https://s.yimg.com/uu/api/res/1.2/xl189rF3k42h6oKb12z2RQ--~B/aD0yOTk7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/887bdbd44fd1aaf52819abfd05133f94", "published_at": "2019-09-15"}