{"pub": "cryptocoin", "url": "https://cryptocoin.news/token-news/october-18-2019-paxos-standard-pax-down-0-3-surprising-moves-in-31288", "downloaded_at": "2019-10-18 10:35:52.106847+00:00", "title": "October 18, 2019: Paxos Standard (PAX): Down 0.3%; Surprising Moves In Price And Transfers Added; Price Crosses 20 Day Average", "language": "en", "text": "How Did Paxos Standard’s Price Fare Yesterday?\n\nPaxos Standard’s current price, at the time of this writing, is $1 USD, down by approximately 0.3% from the day prior. The down day for Paxos Standard yesterday was a reversal from the day before it, which puts its price at 0.06% below its 20 day moving average. Over the past two weeks, price has been in an up trend. Traders looking for a range to trade within may wish to note that the Bollinger bands (a price indicator based on recent momentum and volatility) for Paxos Standard imply the currency may oscillate between $0.998237 and $1.003063, based on how price has behaved in the two weeks prior. As we are closer to the bottom of that range, rangebound traders may wish to consider exploring buying opportunities.\n\nTrade Paxos Standard (PAX) and over 500 other cryptos across ten different exchanges — all from one app. Try Quadency.\n\nThe currency’s market cap currently stands at $250 million US dollars.\n\nPaxos Standard’s Surprises of the Day\n\nSince yesterday, Paxos Standard saw anomalous behavior in price and transfers added. It may be worth looking into the causes of this a bit more.\n\nStraight Off the Chain\n\n281,094 transactions amongst holders of Paxos Standard occurred yesterday. As for the number of holders, yesterday saw the number of wallets holding Paxos Standard increase by 161. Our engagement rank, which combines weekly percentage growth in number of holders and number of transfers, has Paxos Standard ranked 1.5 out of the 34 Ethereum tokens we’re tracking.\n\nObserving Paxos Standard’s Richest Wallets\n\nOf the coin’s total money supply, the richest 1,0000 wallets currently own 99.4%. As for the Paxos Standard’s smart contract itself, that owns 0.05% of the total money supply, an amount unchanged from the week prior.\n\nHow Much Development is Occurring?\n\nPaxos Standard hasn’t had any activity on any of its GitHub repos since October 16, 2019 — 2 days prior. Over the past 30 days, we’ve seen open issues across Paxos Standard’s GitHub repositories grow by 0 per day on average, while the number of watchers has grown by 0.07.\n\nWhat’s Going on Social Media?\n\nIn terms of social media presence, Paxos Standard saw its Twitter followers go up by 5 over the past 24 hours. Traders interested in following Paxos Standard has the biggest presence on Twitter, where it has 2,139 users engaged. Use this link to follow Paxos Standard on Twitter.\n\nWhere to Buy\n\nYou can trade Paxos Standard, listed under the symbol PAX, through the following exchanges: Gate, Yobit, Binance, DDEX, Ethfinex.\n\nArticle by SixJupiter", "description": "", "authors": [], "top_image": "https://cryptocoin.news/wp-content/uploads/2019/04/paxos-standard-1.jpg", "published_at": "2019-10-18"}