{"pub": "breitbart", "url": "https://breitbart.com/sports/2019/10/18/adam-silver-china-wanted-rockets-gm-daryl-morey-fired-nba-said-no-chance", "downloaded_at": "2019-10-19 11:14:55.067229+00:00", "title": "Adam Silver: China Wanted Rockets GM Daryl Morey Fired, NBA Said ‘No Chance’", "language": "en", "text": "NBA Commissioner Adam Silver says that China wanted Rockets General Manager Daryl Morey fired over his tweet in support of Hong Kong pro-democracy demonstrators, and the NBA said no.\n\nThe NBA commissioner shared that news with reporters at the Time 100 Health Summit on Thursday.\n\n“We made clear that we were being asked to fire him, by the Chinese government, by the parties we dealt with, government and business,” Silver explained. “We said there’s no chance that’s happening. There’s no chance we’ll even discipline him.”\n\nThe fact that Silver makes a distinction between the “government and business” in a communist-controlled country, shows that the NBA may not have a proper understanding of exactly who and what they’re dealing with in China.\n\nThe NBA-China rift seemed like it was on its way out of the news cycle earlier this week, however, Lakers star LeBron James breathed new life into the controversy by claiming Morey “wasn’t educated” on the Hong Kong issue, and pointing out the “negative” side-effects of free speech.\n\nSilver explained to reporters that the NBA is still feeling the impact of the China controversy.\n\n“The losses have already been substantial,” he said. “Our games are not back on the air in China as we speak, and we’ll see what happens next.\n\n“I don’t know where we go from here. The financial consequences have been and may continue to be fairly dramatic.”\n\nWhile the NBA’s initial response to China drew bipartisan backlash for being too deferential to the Chinese Communist Party, and not supportive enough of an American citizen using free speech in support of democracy, Silver sounded far more resolute in his Thursday comments.\n\n“These American values — we are an American business — travel with us wherever we go,” Silver said. “And one of those values is free expression. We wanted to make sure that everyone understood we were supporting free expression.”\n\nFollow Dylan Gwinn on Twitter @themightygwinn", "description": "NBA Commissioner Adam Silver says that China wanted Rockets General Manager Daryl Morey fired over his tweet in support of Hong Kong", "authors": ["Dylan Gwinn"], "top_image": "https://media.breitbart.com/media/2019/10/gty-andy-lyons-640x480-640x480-R-2-640x335.jpg", "published_at": "2019-10-18"}