{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/sulli-autopsy-rules-out-homicide-20590019", "downloaded_at": "2019-10-16 13:58:01.535781+00:00", "title": "Sulli autopsy rules out murder after K-pop star found dead at home", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nPreliminary autopsy results into the death of K-pop star Sulli have been released.\n\nThe singer and actress - real name Choi Jin-ri - was found dead at the age of 25 on October 14 at her home in Seongnam, Gyeonggi Province, South Korea.\n\nA spokesperson from from Seongnam Sujeong Police has since confirmed that there are no suspicions of homicide in her death.\n\nIn a statement they said: \"No suspicions of homicide, such as external forces or pressure, were discovered as a result of the preliminary autopsy.’\n\nResults from drug and toxicology reports have yet to be published.\n\n(Image: Visual China Group via Getty Ima)\n\nPolice previously said they suspected Sulli's death could be suicide.\n\nA police spokesperson said: \"It seems that Choi was living alone at the house.\n\n\"It looks like she ended her life but we will investigate, open to all possibilities.\"\n\n(Image: WireImage)\n\nSulli's body had been found by her manager at around 3.21pm local time on Monday 14 October.\n\nHe visited the house after being unable to reach the star after their last phone call at 6.30pm on Suday.\n\nSulli was a member of K-pop band f(x) but took a hiatus in 2014 after extreme online abuse.\n\n(Image: WireImage)\n\nHer break was only supposed to last for a year, but she later decided to quit the group and pursue a career in acting instead.\n\nShe rose to fame at the age of 11, playing Princess Seonhwa of Silla in the SBS drama Ballad of Seodong.\n\nShe also starred in films like Fashion King and I AM and TV shows like Hotel del Luna and To the Beautiful You.\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nHer band f(x) enjoyed success with songs like Pinocchio (Danger), Electric Shock and Hot Summer.\n\nEarlier this year, the star has surprised her fans by releasing new music with single Goblin.\n\nShe also returned to the stage to perform at SM Town Theatre in Seoul in June.\n\n* Samaritans (116 123) operates a 24-hour service available every day of the year. If you prefer to write down how you’re feeling, or if you’re worried about being overheard on the phone, you can email Samaritans at jo@samaritans.org", "description": "The 25-year-old singer, real name Choi Jin-ri, was found dead at home earlier this month", "authors": ["Lucy Needham", "Image", "Visual China Group Via Getty Ima", "Wireimage"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20576254.ece/ALTERNATES/s1200/0_Sulli-Attends-Launch-Event-In-Seoul.jpg", "published_at": "2019-10-16"}