{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/12/anibal-sanchez-draws-raves-nationals-win-opener", "downloaded_at": "2019-10-13 00:24:42.157231+00:00", "title": "Sanchez draws raves as Nationals win series opener", "language": "en", "text": "ST. LOUIS | Mike Rizzo, the Washington Nationals general manager, rarely talks to the media on the record after games.\n\nBut he was surrounded by national reporters here late Friday night and was more than happy to discuss a historic outing by veteran pitcher Anibal Sanchez.\n\nThe right-hander from Venezuela did not allow a hit until two outs in the eighth inning and lefty reliever Sean Doolittle came on to get the last four outs as the Nationals beat the St. Louis Cardinals 2-0 in Game 1 of the National League Championship Series.\n\n“When he’s on, he is carving people up and hitting corners,” Rizzo said of Sanchez, who gave uo one hit and one walk with five strikeouts in 8 2/3 innings.\n\nSanchez, with a fastball at about 90 mph, varies speeds with his secondary pitches and was able to paint the corners all night. He became the first pitcher in postseason history with multiple career no-hit bids of at least six innings.\n\nHe had a no-hitter for six innings before it was broken up in Game 1 of the 2013 ALCS when he pitched for the Detroit Tigers. His work with catcher Yan Gomes on Friday was pure art.\n\n“He was in and out, slow and fast and up and down with his pitches. He put on a pitching clinic,” Washington pitching coach Paul Menhart told The Washington Times. “There were very few mistakes. You have to give a lot of credit to Anibal and Yan for a perfect plan executed and they didn’t stray from it.”\n\nSanchez, 35, had not pitched since facing the Los Angeles Dodgers in the NLDS on Sunday.\n\n“I just tried to keep focused on every pitch that I’m going to throw,” he said. “I don’t want to miss any kind of pitch in the middle in the zone against those guys, especially because they know pretty good that they can switch the score like quickly.”\n\nMany people refer to “The Big Three” starting pitchers of the Nationals: Max Scherzer, Stephen Strasburg, and Patrick Corbin.\n\nBut Sanchez is certainly no slouch.\n\n“I mean Anibal’s been, he’s a big part of why we are here, too. He’s pitched unbelievable,” manager Dave Martinez said.\n\nGomes worked well with Sanchez as regular catcher Kurt Suzuki still recovers from getting hit with a pitch Wednesday against the Los Angeles Dodgers.\n\n“Anibal and I had a great game plan going into it,” Gomes said. “We were sticking to it and we were communicating really well in between innings.”\n\nThe Nationals took a 1-0 lead in the second on an RBI double by Gomes to score Howie Kendrick. Washington got an insurance run in the seventh as Kendrick had an RBI single to score Adam Eaton.\n\nThe Nationals, advancing to the NLCS for the first time in five tries, have won 13 of their last 15 games since ending regular-season play with eight wins in a row.\n\nWashington will try to take a 2-0 series lead when Scherzer takes the mound for Game 2 on Saturday at 4:08 p.m. ET.\n\nThe Nationals expect to have key reliever Daniel Hudson, who missed Friday’s game as his wife had their third child, a girl, in Arizona.\n\nHis presence will aid the Nationals’ only weakness — bullpen depth.\n\n“I think our starting pitching is absolutely our biggest strength,” Doolittle said. It certainly was Friday night.\n\nThe series moves to Washington on Monday, with the first pitch in Game 3 at 7:38 ET. Game 4 on Tuesday will start at 8:05 and first pitch for Game 5, if needed, will be Wednesday at 4:08 p.m.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Many people refer to \"The Big Three\" starting pitchers of the Nationals: Max Scherzer, Stephen Strasburg, and Patrick Corbin. But Anibal Sanchez is certainly no slouch.", "authors": ["The Washington Times Http", "David Driver", "Special To The Washington Times"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/11/NLCS_Nationals_Cardinals_Baseball_75358.jpg-ecfea_c0-411-4088-2795_s1200x700.jpg?353f988e0737e9dd7e001efe9ca82c81cbb95437", "published_at": "2019-10-12"}