{"pub": "fox", "url": "https://foxnews.com/entertainment/kim-kardashian-kanye-west-birthday-prison-reform", "downloaded_at": "2019-10-23 23:35:06.494346+00:00", "title": "Kanye West donates $1 million to prison reform charities for Kim Kardashian's birthday", "language": "en", "text": "Kanye West gave a meaningful gift to his wife, Kim Kardashian, for her birthday and she responded: \"This makes my heart so happy!\"\n\nThe \"Jesus Walks\" rapper donated $1 million to prison reform, which Kardashian tweeted about Tuesday.\n\nKIM KARDASHIAN, KIDS BAPTIZED AT ARMENIAN CHURCH AS KANYE WEST CONFIRMS HE 'GOT SAVED' THIS YEAR\n\n\"I got amazing gifts from my whole family and Kanye for me the most amazing bags,\" she wrote on Twitter. \"But he also donated $1 million to my favorites charities that work so hard on prison reform on my behalf from him and the kids.\"\n\nA donation certificate showed the donation was made to Cut 50, Buried Alive Project, Equal Justice Initiative, and Anti-Recidivism Coalition from her husband and the couple's four kids: North, Saint, Chicago, and Psalm.\n\nThe 39-year-old \"Keeping Up With the Kardashians\" star, who is studying to be a lawyer, has met with President Trump multiple times to help get the First Step Act signed into law and advocate on behalf of former inmates Alice Marie Johnson and Matthew Charles, both of whom were released after serving lengthy prison sentences.\n\nKANYE WEST DROPS 'JESUS IS KING' TRAILER: 'WE'RE HERE TO SAVE YOU FROM ETERNAL DAMNATION'\n\nKardashian was recently baptized in Armenia alongside her kids as her husband revealed that he \"got saved\" this year and has been holding weekly Bible studies.\n\nMeanwhile, West has a new IMAX film dropping Friday, \"Jesus Is King,\" following multiple Sunday Service pop-ups around the country.\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nThe film will focus on West's Sunday Service and feature 13 songs from his choir, as well as music from his upcoming (and oft-delayed) album \"Jesus Is King.\"", "description": "Kanye West gave a meaningful gift to his wife, Kim Kardashian, for her birthday and she responded: \"This makes my heart so happy!\"", "authors": ["Caleb Parke", "Caleb Parke Is An Associate Editor For Foxnews.Com. You Can Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/01/Kim-Kardashian-Kanye-West.jpg", "published_at": "2019-10-23"}