{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3069173&cloc=joongangdaily|home|online", "downloaded_at": "2019-10-17 11:59:16.692354+00:00", "title": "K-pop with a kick: Taekwondo takes the stage", "language": "en", "text": "Members of newly-debuted taekwondo K-pop band K-Tigers Zero pose for photos at their gym in Ilsan, Gyeonggi. From top left to bottom right: Oh Hyeong-kun, Park Yi-seul, Kim You-jin, Min_D, Taemi, Chung Yun-ji, Ha Seong-jin, Lee Gang-min, Jang Jun-hee, Kang Gun-woo, Byun Hyun-min and Na Tae-joo. [JEON TAE-GYU]\n\nK-Tigers Zero debuted with the unique concept of being a taekwondo K-pop group, with their debut EP. Their music video “Side Kick,” right, highlights the stylish side of the traditional martial art. Left, K-Tigers Zero members perform their choreography at their gym. [AHN MIN-KI, K-TIGERS E&C]\n\nWhat happens if you mix K-pop choreography and the restrained energy of taekwondo? Ask K-Tigers Zero, a new co-ed K-pop group that made their debut with a five-track EP last month. There have been K-pop groups that highlight their powerful side in the past, but K-Tigers Zero take it to another level.K-Tigers Zero made their official debut on Sept. 19 with EP “Huiroaerak” - which translates to “Happiness, Anger, Sorrow and Joy” - with the lead track “Side Kick.”The K-Tigers Zero are officially the first mixed-gender band to have debuted since the four-member band KARD in 2017, and they are officially the only K-pop taekwondo band.K-Tigers began in 1990 as a taekwondo demonstration team, performing for various events and also taking part in taekwondo competitions at the same time. They had already been an established group of taekwondo masters in the field, but in 2013, they caught the eye of the public with their first K-pop and taekwondo mash-up. Members of K-Tigers took part in making a taekwondo dance version of singer Taeyang’s “Ringa Linga” (2013) and posted it on YouTube.Soon after, the video went viral. The video has been seen over 9 million times as of this year.“We performed a lot as taekwondo demonstrators around the world, and we tried to give some tweaks to the program every now and then,” said Oh Hyeong-kun. “So one day, we tried doing the moves on dance music, then with K-pop music. We felt that we communicated better with the audience when we did so, and the synergy was great. So that’s why we began doing it.”Having made their big debut, the K-Tigers Zero are set to begin a world tour in November, starting with four stops in Korea: Seoul, Busan, Daejeon and Jeonju, North Jeolla. It may not be what they imagined when the 12 members - leader Jang Jun-hee, Oh Hyeong-kun, Na Tae-joo, Lee Gang-min, Ha Seong-jin, Byun Hyun-min, Kang Gun-woo, Taemi, Park Yi-seul, Chung Yun-ji, Min_D and Kim You-jin - began their career in taekwondo, but they are excited about their newest chapter.The Korea JoongAng Daily met with the K-Tigers Zero in October and discussed their journey with them. The following are edited excerpts from the interview.: I really liked listening to music while I was in school - Jun-hee and I both did, because we went to the same school five years ago. Then one day, I was talking to Jun-hee about a song that I was into. And we just said, “Hey, why don’t we do a choreography on this with taekwondo?” We talked about it and we talked to our coach. He said it was a great idea, and we went with it. That’s how that happened.We’ve covered other songs from then on, like “Boy In Luv” (2014, BTS), “Danger” (2014, BTS), “Blood Sweat & Tears” (2016, BTS) and “Overdose” (2014, Exo). I think that was the beginning for what we’re doing now.: I think the female members get to show something that we [as men] can’t. I think there’s powerful sexiness within their femininity, but it’s also very powerful at the same time. And you know, since all the guys are so handsome… (laughs) But I think being here together just brings out more, both for K-pop and taekwondo.: Well our choreography is definitely quite demanding. It requires hard work and muscle energy. But you have to remember that all the female members have been doing this for over 10 years now. There are parts like where we have to do a push-up, get up, get back down and up again. Those moves are hard, but we can still pull them off.: We felt that when we performed K-pop songs by other artists, the audience engaged so much more and it even became more fun for us as well. So because we kept doing it, we felt the desire to have something of our own, not someone else’s. We wanted our very own song that we could sing with our voices, and the members saw eye to eye on that. We’ve established ourselves in taekwondo, so could we do the same in K-pop? That was the initial question.: Right now in Korea, there are three major taekwondo demonstration groups, but they’re all run by the government. We’re the only private institute, but we managed to do so much. Our goal was actually to get to perform at the Blue House [for the president], but we did that as well. We even travel with the Ministry of Foreign Affairs to perform. So everything we’ve done as K-Tigers, we made the most out of what we could within taekwondo. So in a way, we needed a game-changer, and we saw it in the entertainment industry.: We’ve been on tours before, but this will be our first as K-Tigers Zero, as a group with these 12 members. It feels refreshing really. We’ve prepared so much, and we can’t wait to show the audience.: I saw people calling our music a “new genre” and “advanced genre.” I don’t really know how people will take it, but to be called new felt so good. The new genre is also a new start for us, and I really like it. I would also like to hear that we’re the best at our performances, the best performers in the idol industry!: All of us do, actually. When we try something, someone will always say, “How about this?” We then share our thoughts on what others say and talk about it. There are some people who often have ideas like me, Yun-ji or Seong-jin, but nobody takes it for granted. Everyone takes part.And when there’s something we want in our heads but we can’t do it in real life, we just let it go. It would be great if it happens, but if the choreographer says no, then we just let go of it. If there is something that we really want to show, then that’s when we make our voices heard. But most of the time, we figure the choreography out on our own, so we don’t really argue much with the choreographer.Some people are skeptical about your transition from athletes to K-pop idols. Do you see yourself as taking advantage of the entertainment industry?Chung: We were at the top when it came to taekwondo, and now we’ve fused that with K-pop. People either say, “You should just stick with what you’ve been doing” or “We support you.” I think it’s our task, something that we have to solve in the future. We don’t think it’s just about performing or doing certain things, it’s about showing that we’re serious artists with our very own style of music. We’re ready to do that.BY YOON SO-YEON [yoon.soyeon@joongang.co.kr]", "description": "", "authors": [], "top_image": "https://pds.joins.com/jmnet/koreajoongangdaily/_data/photo/2019/10/17203825.jpg", "published_at": "2019-10-17"}