{"pub": "yahoo", "url": "https://news.yahoo.com/china-denounces-thai-politicians-show-062744809.html", "downloaded_at": "2019-10-11 06:57:25.291618+00:00", "title": "China denounces Thai politicians for show of support to Hong Kong activists", "language": "en", "text": "By Panu Wongcha-um and Patpicha Tanakasempipat\n\nBANGKOK, Oct 11 (Reuters) - The Chinese embassy in Bangkok has condemned Thai politicians for showing support to Hong Kong activists amid mass anti-Beijing protests, saying that such move could harm the relationship between the two countries.\n\nThe criticism was echoed by Thailand's army chief, who on Friday spoke of \"hidden agendas\" in meetings between opposition activists.\n\nThe embassy statement, posted on its official Facebook page late on Thursday, came days after Hong Kong pro-democracy activist Joshua Wong posted a picture on social media with prominent Thai opposition figure Thanathorn Juangroongruangkit.\n\n\"Some Thai politicians have contacted the group that wants\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nto separate Hong Kong from China, showing gestures of support,\" the embassy said in a Thai-language statement without naming individuals.\n\n\"This is wrong and irresponsible. China hopes that relevant people will understand the truth about problems in Hong Kong, act carefully and do useful things for the friendship between China and Thailand.\"\n\nWong and Thanathorn met on Oct. 5 at the Open Future Festival in Hong Kong, attending as speakers at the annual event.\n\n\"Under the hard-line authoritarian suppression, we stand in solidarity,\" Wong wrote in a tweet that showed a picture of him standing next to the Thai politician.\n\nThanathorn's Future Forward Party declined to comment when contacted by Reuters on Friday.\n\nThai army chief General Apirat Kongsompong indirectly criticised Thanathorn's meeting with Wong on Friday during a press briefing in which he accused opposition politicians of inappropriate behaviour.\n\n\"Wong came to Thailand countless of times. To meet whom? The meetings had hidden agendas. Were they conspiring, cooking up something together?\" Apirat said.\n\n\"And with the incidents in Hong Kong, someone went, to give moral support, to give encouragement,\" Apirat added, showing the picture of Thanathorn and Wong that was posted on social media, though Thanathorn's body was blacked out.\n\nThailand was run by a military junta for five years after then-army chief General Prayuth Chan-ocha overthrew an elected government.\n\nElections held in July were won by Prayuth's pro-army party in a vote that opposition parties said was organised to ensure continuation of military control of politics.\n\nThe Thai Foreign Ministry declined to comment on the Chinese embassy's statement but referred to a statement in September stating that Thailand regards the situation in Hong Kong as China's internal affairs. (Additional reporting by Panarat Thepgumpanat Editing by David Goodman)", "description": "The Chinese embassy in Bangkok has condemned Thai politicians for showing support to Hong Kong activists amid mass anti-Beijing protests, saying that such move could harm the relationship between the two countries.  The criticism was echoed by Thailand's army chief, who on Friday spoke of \"hidden", "authors": ["Panu Wongcha-Um", "Patpicha Tanakasempipat"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-11"}