{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7595107/Woman-27-left-excruciating-pain-botched-fake-nail-treatment-Sydney-salon.html", "downloaded_at": "2019-10-21 13:12:45.338101+00:00", "title": "Woman, 27, left in excruciating pain after botched fake nail treatment in Sydney salon", "language": "en", "text": "A young woman fears she could be disfigured for life after a botched fake nail treatment left her in agony with a gruesome infection.\n\nShandell Madden is still barely able to use her right hand a month after the 'unsanitary' procedure at a western Sydney salon.\n\nThe 27-year-old spent 16 hours in hospital hooked up to powerful antibiotics and needed 15 visits to her GP to kill the infection.\n\nDoctors were forced to rip off her nail as the infection spread through her nail bed and she fears it will never grow back, leaving her disfigured.\n\nShandell Madden, 27, spent weeks in agonising pain from gruesome infection under her thumbnail from a botched fake nail treatment\n\nMs Madden spent 16 hours in hospital hooked up to powerful antibiotics and needed 15 visits to her GP to kill the infection\n\nThe nail salon then demanded a binder's worth of documents to prove her medical bills and time off work, and only offered a $100 voucher.\n\n'I am so disgusted with the nail salon. For two weeks I was in agonising pain living off pain killers and medication,' she told Daily Mail Australia.\n\n'There were so many sleepless nights and I can't do anything the way I used to, I still can't write or use my dominant hand without being in pain.'\n\nMs Madden said her ordeal began on September 23 when she visited the salon in Mount Druitt to get a full set of acrylic nails installed.\n\nShe said the technician used an electric file to grind down her natural nail but went too deep on the left side and Ms Madden pulled away in pain.\n\nMs Madden said her ordeal began on September 23 when she visited the salon in Mount Druitt to get a full set of acrylic nails installed\n\nHer doctor eventually had to remove her whole thumbnail, exposing a nail bed oozing with yellow pus\n\nThe worker assured her it was fine and continued, putting glue then the fake nail on top of the affected area.\n\n'The doctors believe as she touched the area and the use of unsanitary tools bacteria was sealed under the nail causing an infection,' she said.\n\nMs Madden said after the treatment her thumb was sore but as this sometimes happened after getting acrylic nails she thought nothing of it - but it got worse.\n\n'After a few days of it swelling up and changing colour I visited a doctor who told me I had an infection from the acrylic nail,' she said.\n\n'I was given antibiotics but the pain and finger grew to the point of being unbearable so I ended up in Blacktown Hospital getting my finger drained.'\n\nMs Madden had to take five unpaid days off her job as an admin assistant at a fencing club in Kingswood, plus more hours for doctor's visits since.\n\nHer doctor eventually had to remove her whole thumbnail, exposing a nail bed oozing with yellow pus.\n\nDoctors were forced to rip off her nail as the infection spread through her nail bed and she fears it will never grow back and leave her disfigured.\n\nThe infection spread to several other fingers but the acrylic nails were able to be safely removed and the infection cleared with antibiotics\n\nMs Madden said she wrote to the salon asking for $300 to partially fund her out of pocket costs\n\nThe infection spread to several other fingers but the acrylic nails were able to be safely removed and the infection cleared with antibiotics.\n\n'My thumbnail still isn't growing back and it's still discoloured and swollen and in constant pain,' Ms Madden said.\n\n'The infection is gone and now it's just waiting game to see if it will turn back to normal, or if it ever does.'\n\nMs Madden said she wrote to the salon asking for $300 to partially fund her out of pocket costs.\n\nThis included a $55 refund for the nails, $20 to remove the nails on her other fingers, plus medication and a fraction of her time off work.\n\nShe claims the salon demanded receipts, medical certificates, and pay slips, a letter from her boss, and bank statements to prove her income loss.\n\nAfter some argument about these, she said the salon then said it would only pay what she asked if she promised to stay quiet, which she refused.\n\n'They where rude and did everything they could to scare me off and came up with excuse after excuse,' she said.\n\n'They have been trying to make my life even more miserable.'\n\nThe nail salon then demanded a binder's worth of documents to prove her medical bills and time off work, and only offered a $100 voucher\n\nMessages between the salon's Facebook page and Ms Madden show the shop saying it was not satisfied with the documents she provided.\n\n'It's all up to you to do what ever your (sic) want to do. We cannot stopping (sic) you do thing you wanted,' it continued.\n\nLater, the social media worker told her the manager 'said he (sic) happy to do the refund as you wanted but not work compensation'.\n\n'Or you can have $100 gift voucher as your Xmas gift.'\n\nThe salon did not answer repeated calls and its social media has since been deactivated.", "description": "WARNING: GRAPHIC CONTENT. Shandell Madden, 27, needed 16 hours in hospital and 15 GP visits to clear the infection caused by the 'unsanitary' procedure at a western Sydney salon.", "authors": ["Nic White For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/07/19978374-0-image-a-9_1571638493316.jpg", "published_at": "2019-10-21"}