{"pub": "reuters", "url": "https://in.reuters.com/article/india-stocks/nifty-sensex-rise-tracking-broader-asia-tcs-drops-on-second-quarter-profit-miss-idINKBN1WQ0BN", "downloaded_at": "2019-10-11 05:12:04.819871+00:00", "title": "Nifty, Sensex rise tracking broader Asia; TCS drops on second-quarter profit miss", "language": "en", "text": "BENGALURU (Reuters) - Indian shares rose on Friday, in line with their Asian peers, after U.S. President Donald Trump said he would meet with China’s top trade negotiator, boosting investors’ risk appetite.\n\nA man looks at a screen displaying news of markets update inside the Bombay Stock Exchange (BSE) building in Mumbai, May 23, 2019. REUTERS/Francis Mascarenhas/File Photo\n\nThe broader NSE Nifty rose 1.07% at 11,352.85 as of 0408 GMT, while the benchmark BSE Sensex was up 1.1% at 38,319.84.\n\nMSCI’s broadest index of Asia-Pacific shares outside Japan rose 0.5% after Trump said he would meet with Chinese Vice Premier Liu He, as the White House said trade talks between the two countries on Thursday went “probably better than expected.”\n\nIn the domestic market, banks and metals stocks led gains. The broader Nifty banking index was up 1.6% after being beaten down in previous sessions.\n\nThe metals index jumped 2.87%.\n\n“After a little bit of negativity, fresh build up is helping stocks,” said Anand James, Chief Market Strategist at Geojit Financial Services in Kochi.\n\n“The market believes that at least some of the sectors will see some positivity, especially after the corporate tax rate-cut.”\n\nAmong stocks, miner Vedanta Ltd rose 4.04% to top the Nifty gainers list, while steelmakers Tata Steel and JSW Steel were both up about 3% each.\n\nMeanwhile, Bandhan Bank and Gruh Finance surged 20% each. The two lenders are set to merge next week.\n\nMeanwhile, Tata Consultancy Services was the top loser for the day after its September-quarter profit missed estimates. The stock fell 3% and dragged the Nifty IT index down as much as 1.4% during the session.\n\nTCS’ rival Infosys is set to report its quarterly earnings later in the day.", "description": "Indian shares rose on Friday, in line with their Asian peers, after U.S. President Donald Trump said he would meet with China's top trade negotiator, boosting investors' risk appetite.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191011&t=2&i=1439550954&w=1200&r=LYNXMPEF9A0AE", "published_at": "2019-10-11"}