{"pub": "metro", "url": "https://metro.co.uk/2019/10/07/abc-announces-cast-little-mermaid-live-new-trailer-playing-10877743", "downloaded_at": "2019-10-07 23:31:43.329957+00:00", "title": "ABC announces cast of The Little Mermaid Live with fun new trailer", "language": "en", "text": "To view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nUS TV network ABC just dropped a first look at The Little Mermaid Live! cast in full costume and it looks like viewers are in for a treat.\n\nTo be clear: This latest development is for the live show of The Little Mermaid on ABC due in November, not the live-action remake, which hasn’t even started filming yet.\n\nThis live staging of the show incorporates sets from the Broadway version as well as costumes, plus music from the original film.\n\nThe Little Mermaid Live release ‘meet the cast’ video (Picture: Rex – Disney)\n\nDisney’s Moana star Auli’i Cravalho will voice the underwater princess, while 50-year-old Shaggy will take on the role of her crab best friend Sebastian.\n\nAdvertisement\n\nAdvertisement\n\nQueen Latifah will be playing the villainous Ursula, John Stamos the mischievous Chef Louis and Graham Phillips as the handsome Prince Eric.\n\nSet to the tune of Ariel’s lyrical signature, the trailer ends with Auli’i doing the classic Ariel hair flick while emerging out of the water.\n\nThe Little Mermaid live production cast (Pictures: Getty/Rex/Mega)\n\nThe upcoming live-action remake of The Little Mermaid is still in the very early stages.\n\nHalle Bailey, who was cast as Ariel, recently confessed her role in the upcoming live action remake of The Little Mermaid is a ‘dream come true’.\n\nHalle, who was born the same year the Disney classic was release, has said she was ‘honored’ to have been selected for the role which will see her take on the mermaid Ariel, who sells her voice to a sea witch in return for legs and the chance to fall in love with Prince Eric.\n\nThe 19-year-old singer-turned-actress said: ‘It means so much to me.\n\n‘I feel very honoured and really grateful for the opportunity. Ariel was one of my favourite princesses growing up so it’s a dream come true. I’m very excited and happy,’ she added.\n\nThe Little Mermaid Live! airs 5 November on ABC.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Ben Phillips pulls out of KSI and Logan Paul boxing press conference after ‘stabbing threats’\n\nMORE: Logan Paul blasts KSI for trash-talking him when he was ‘vulnerable’", "description": "A new trailer for The Little Mermaid Live! is sending Disney fans into meltdown with a sneak peek at cast members in their full costumes", "authors": ["James Besanvalle"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_88860575_1570479245.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-07"}