{"pub": "washingtontimes", "url": "https://washingtontimes.com/specials/north-korea-nuclear-threat-assessment-global-respo", "downloaded_at": "2019-09-04 04:17:34.344412+00:00", "published_at": "2019-09-04", "title": "North Korea's nuclear threat: Assessment, global responses and solutions", "language": "en", "text": "Recent Stories\n\nOnly united allies can compel North Korea to keep its promises The North Korean nuclear issue continues to be probably the major security challenge of the Asia Pacific region. After all, it was some 10 years ago that the North Koreans agreed they would abandon all their nuclear programs. And since that time there were efforts to get them to implement that agreement, but today they have essentially said they are no longer interested in denuclearization. Shares\n\nPost-sanctions provocations seen as prelude to another nuke test North Korea recently conducted a test of its new KN-11 submarine-launched ballistic missile, further enhancing its nuclear delivery options amid heightening tensions on the Korean Peninsula and with the larger international community. The SLBM test was quickly followed by the firing of five short-range ballistics missiles into the Sea of Japan. Shares\n\nNuclear summit: Finishing 'strong'? It was on a visit to Prague in 2009 that President Obama fired a shot across the bow of nuclear proliferation. Articulating a somewhat utopian vision of a nuclear-free world, Mr. Obama's first big foreign policy speech focused on \"America's commitment to seek the peace and security of a world without nuclear weapons.\" Shares\n\n'Hyperproliferation' in North Korea After a month of U.S. pleading, China and Russia reluctantly agreed to more United Nations sanctions, punishing North Korea for illegal nuclear and missile tests on Jan. 6 and Feb. 7 — performed despite already being under U.N. sanctions for a decade, since 2006. Shares\n\nMore U.S. defensive measures wise response Does the brutal, provocative and nuclear-armed North Korean regime actually pose a threat to the United States? Shares\n\nThe hidden North Korea-Iran strategic relationship Amid the official attention and publicity given to the Iran Nuclear Agreement and North Korea's new nuclear and missile tests, an important element of these stories has been largely missing: North Korea's strategic collaboration with Iran. Shares\n\nNorth Korea's 'lens' sees 150 years of conflict This summer North Korea will mark the 150th anniversary of a seminal event in the introverted nation's history, namely, the beginning of today's ongoing struggle against U.S. aggression. Shares\n\nNuke tally could double by 2020 On March 9, North Korea's state media released photos of Kim Jong-un inspecting a miniaturized nuclear weapon and modern re-entry body. While experts have believed for some time that the North had miniaturization capabilities, the photos put to rest any doubts from skeptics that such capabilities existed, and signaled to the world, once again, that the North's ambitions for weapons of mass destruction (WMD) are both real and a serious, growing threat. Shares\n\nU.S. applying 'sustained pressure' on North Korea On March 16, President Barack Obama signed an order imposing U.N.-backed \"robust new sanctions\" on North Korea. The move comes amid a series of reprisals from Pyongyang, including the jailing of a 21-year-old American student. Shares\n\nGetting DPRK to Six Party Talks The United States and China share one of the most consequential relationships in the world. Shares\n\nNew U.N. sanctions to severely curtail DPRK weapons programs With each nuclear test and launch using ballistic missile technology, the DPRK improves its capability to carry out a nuclear missile attack, not only in the region but also a continent away Shares\n\nBan on DPRK nuclear test: 'I condemn it unequivocally' The underground nuclear test announced by the Democratic People's Republic of Korea (DPRK) on January 6 is deeply troubling. Shares\n\nU.N. sanctions deserve swift implementation The U.N. Security Council adopted a strong new resolution against North Korea's nuclear and missile programs, recognizing the persistent threat this rogue regime presents to the world. Shares\n\nCongress united on North Korea sanctions For three years the Foreign Affairs Committee I chair has worked with great determination to build support for this North Korea sanctions legislation. I want to thank my Democratic colleagues, especially Ranking Member Engel, for their support. I also thank Senators Corker, Cardin and Gardner for their leadership in the Senate, and for their strong additions, particularly on human rights and cyberattacks by the brutal and hostile North Korean regime. Shares\n\nTurning attention to the 'forgotten maniac' For decades the United States and its allies like Japan and South Korea have faced a complex threat in North Korea. Shares\n\nPeace in Korea would be 'starting point' for a nuclear-free world The spirit of the March First Independence Movement led to the establishment of the Provisional Government of the Republic of Korea, and we eventually realized long-yearned-for independence. Shares\n\nNorth Korea should 'top the agenda' at no-nukes talks We all know the [Conference on Disarmament] can play a catalytic role in furthering disarmament and arms control, thereby improving the international security landscape. Unfortunately however, since 1998, the CD has lost steam Shares\n\nNORTH KOREA NUCLEAR THREAT: Japan implementing new restrictions on North Koreans Japan highly appreciates that the United Nations Security Council unanimously adopted Resolution 2270 regarding North Korea's nuclear test in January and ballistic missile in February Shares\n\nJapan forges ahead in a sea of complexity Japan will host the G-7 Summit in Ise-Shima in May as a nation facing the most complex issues in balancing regional and global powers to keep the peace, while also maintaining strong forward motion with their economy. Shares\n\n'When did America forget that it is America?' Amid the plethora of security threats the world is facing today, North Korea, with its fourth nuclear test on Jan. 6, long-range missile test on Feb. 7 and firing of short range missiles in late March, has been doing all it can in order to ensure that it gets its share of attention. Shares\n\nChina also seeks denuclearization of Korean Peninsula China is a permanent member of the Security Council. We have the obligation and capability to implement all the resolutions passed by the Security Council, including Resolution 2270 concerning the DPRK. Shares\n\nAt the NSS, watch the sidelines for real action Leaders from across the globe will gather in Washington from March 31 to April 1 for the fourth and final Nuclear Security Summit. Shares\n\nIn Putin's chess game with the West, North Korea is a pawn Make no mistake, the Stalinist North Korean regime is no close ally of the Kremlin but simply a pawn in Russia's great geopolitical game with the United States and the West. Shares\n\nCan South Korean-made TV dramas prepare the North for reunification? The U.N. Security Council's resolution 2270, adopted in March with the support of China and Russia, is arguably the toughest sanctions regime enacted against Korea since the war was suspended with the 1953 armistice. Shares\n\nU.N. sanctions on North Korea: Time is running out With his nuclear and missile tests this year, Kim Jong-un has signaled the United States that he is accelerating North Korea's program to develop an intercontinental ballistic missile (ICBM) with a nuclear warhead that could strike the United States. Shares\n\nIs Kim Jong-un a martyr? Western experts believe North Korea will not attack South Korea militarily for three main reasons: The DPRK leadership is not suicidal; the North Korean regime is rational and, therefore, can be deterred by the U.S. conventional military presence and nuclear umbrella in the Republic of Korea; and the Korean People's Army cannot mount a successful military attack without the blessing and backing of its main and sole ally, China, which no longer supports its military provocations and opportunistic behavior. Shares\n\nNK's system of privilege, loyalty and 'human rights denial' Especially since the release of the report by the U.N. Commission of Inquiry on Human Rights in the Democratic People's Republic of Korea (UNCOI) in February 2014, Kim Jong-un's regime has come under increased scrutiny by the international community for its human rights abuses. Shares\n\nNorth Korea's motivations, capabilities and proliferation Recent rhetoric emanating from the North Korean regime has been quite threatening — and may signal a real \"cold spell\" for any outreach the isolated regime will be willing to embrace. But even more troubling are the actions that have been taken since January 2016. A successful underground nuclear test in January and a successful launch of a three-stage ballistic missile with the range to hit the mainland United States (under the cover of a \"satellite launch\") are only the beginning of the threatening behavior. Shares\n\nKim Jong-un's leadership style While he has only been in power for less than four years, some information, albeit highly speculative, is beginning to emerge about Kim Jong-un's leadership style. Shares\n\nCrimes against humanity demand accountability North Korea challenges international peace and security. Its proved human rights abuses demand accountability of those responsible. But are these two imperatives compatible? Shares\n\nMiseries of women, others at DPRK prison camps revealed On March 18, four women defectors of North Korea gave a powerful reminder that as the world turns its attention to North Korea's alarming nuclear activities, women and other North Korean citizens are silently suffering in the clutches of the brutal regime. Shares\n\nLoyal but exploited: North Korea's overseas laborers North Korea's exportation of laborers to foreign countries earns the Kim Jong-un regime part of the hard currency needed to develop its weapons and to keep its elites loyal. Recent studies indicate that at least 50,000 North Korean laborers are officially dispatched overseas, earning the Kim regime between $120 million to $230 million per year. However, recent data from China and Russia indicate that the number of North Korean workers officially dispatched to those countries may have increased dramatically in recent years, with an estimated 47,000 reportedly in Russia in 2015. Shares\n\nSouth Koreans handling 'daily stress' of North's provocations I was in South Korea in mid-February with a fact-finding delegation of experienced policy leaders on Korean Peninsula and Northeast Asia issues sponsored by The Washington Times. Our visit was given a heightened immediacy by the fact that it happened to coincide with a flurry of strategic provocations from the North. Shares\n\nTrilateral security can check North Korea nuclearization The Korean Peninsula has posed a seemingly intractable challenge for the United States for six and a half decades, and North Korea's latest round of provocations has crystalized the danger of a nuclear-armed regime. Beijing and Washington may disagree about the future of Korea, but leaders on both sides of the Pacific agree that such weapons have no place in North Korea. Unfortunately, previous efforts to deter Pyongyang have failed. Successfully prohibiting North Korea from nuclear weaponization requires a new strategy that utilizes a strengthened trilateral alliance between the United States, Republic of Korea and Japan. Shares\n\nAllied coordination needed to counter North Korea North Korea is easy to ridicule. Its portly, rhomboid-haired leader looks like an Austin Powers villain. His over-the-top, bombastic threats sound like Soviet propaganda on steroids. Nighttime satellite photography suggests it can't even power a light bulb. No wonder it's been routinely dismissed as not posing a threat for \"at least several more years.\" Shares\n\nDiscussions could be 'achievable,' 'desirable' to all The North Korean nuclear and missile programs are growing threats to the global community. To date, the international community's response to these programs has been weak and ineffective. Shares\n\nSanctions can work, but new incentives are needed On April 25, Australia will commemorate Anzac Day to pay tribute to those who have served the nation in wars and conflicts from World War I until the present-day \"war on terrorism.\" Shares\n\nParliamentarian global network to build consensus One hundred and fifty current members of parliaments from 50 nations convened in Seoul in February to propose the establishment of an organization without precedent. Shares", "description": "North Korea's nuclear threat: Assessment, global responses and solutions is a Special Report prepared by The Washington Times Advocacy Department.", "authors": ["The Washington Times Http", "Ambassador Christopher Hill", "Larry Moffitt", "Peter Vincent Pry", "Rebeccah L. Heinrichs", "Larry Niksch", "Rodger Baker", "Jenny Town", "John Kerry", "Samantha Power"], "top_image": "https://media.washtimes.com/media/specials/thumbnails/NKthumbnail.jpg"}