{"pub": "breitbart", "url": "https://breitbart.com/news/iraq-military-admits-excessive-force-used-in-deadly-protests", "downloaded_at": "2019-10-07 07:39:17.809503+00:00", "title": "Iraq military admits ‘excessive force’ used in deadly protests", "language": "en", "text": "Baghdad (AFP) – Iraq’s military admitted on Monday that “excessive force” was used in a district of the capital overnight where a mass protest led to clashes that medics and security forces said left 13 people dead.\n\n“Excessive force outside the rules of engagement was used and we have begun to hold accountable those commanding officers who carried out these wrong acts,” the military said in a statement.\n\nIt was the first time since protests broke out on Tuesday that security forces acknowledged using disproportionate measures, while protesters had accused them of firing live rounds directly at them.\n\nHundreds had gathered overnight in Sadr City, a densely populated district in eastern Baghdad where state security forces are rarely seen.\n\nOn videos distributed on social media of the late-night rally, protesters ducked in streets littered with burning tyres as heavy gunfire was heard.\n\nSecurity sources and medics said the clashes left 13 people dead overnight.\n\nIn a statement distributed to journalists on Monday morning, the Iraqi military said Prime Minister Adel Abdel Mahdi had ordered “all army units to withdraw from Sadr City to be replaced with federal police units.”\n\nHe called on all forces to abide by the “rules of engagement” in dealing with rallies, it added.\n\nIn his only address to the protesters last week, Abdel Mahdi had insisted security forces were acting “within international standards” in dealing with demonstrations.", "description": "Baghdad (AFP) – Iraq’s military admitted on Monday that “excessive force” was used in a district of the capital overnight where a", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/07/92dfd5_iraqi-government-has-announced-series-reforms-in-hopes-quelling-anti-government-640x335.jpg", "published_at": "2019-10-07"}