{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/rugbyunion/article-7618647/Mike-Phillips-offers-sympathy-Wales-Rugby-World-Cup-semi-final-exit.html", "downloaded_at": "2019-10-27 12:16:24.353323+00:00", "title": "Mike Phillips offers sympathy to Wales after Rugby World Cup semi-final exit", "language": "en", "text": "Retired scrum-half Mike Phillips admits he felt for Wales after they missed out on the Rugby World Cup final with a 19-16 defeat by South Africa.\n\nAfter Handre Pollard and Dan Biggar had exchanged first-half penalties, a Damian de Allende try was cancelled out by Josh Adams, but Pollard kicked the winning penalty three minutes from time.\n\nPhillips was part of the Wales side that suffered defeat by France in the 2011 Rugby World Cup final, scoring a try in a 9-8 reverse.\n\nWales endured a painful Rugby World Cup semi-final defeat by South Africa in Japan\n\nFormer Wales scrum-half Mike Phillips admitted he had sympathy for the players after the loss\n\nPhillips told ITV: 'It’s so painful, I’ve been there and it still kills me today. It was a poor game to be honest, wasn’t entertaining, lots of kicking.\n\n'Boys right in mix until the end, shame they couldn’t get over the line.'\n\n'They will learn from this experience and move on.'\n\n🗣 \"Congratulations to South Africa. Great for them to be in the final, they deserved to win today.\"@WelshRugbyUnion coach Warren Gatland reflects on a physical encounter against South Africa in the #RWC2019 semi-final.#WALvRSA #WebbEllisCup pic.twitter.com/oHt3TTQRHe — Rugby World Cup (@rugbyworldcup) October 27, 2019\n\nThe @Springboks played poorly to be honest...but ultimately it’s the result that matters. England will be a tough nut to crack... but rather them than the @AllBlacks! #RWC2019 #WALvRSA — Rick Duvenage (@RickDuvenage) October 27, 2019\n\nSome effort considering the strength that we couldn’t put on the pitch. A semi-final is probably a fair reflection of this World Cup. Never quite hit the heights. — George Dugdale (@GeorgeDugdale) October 27, 2019\n\nBryan Habana added: 'From what was a dour first half to a second half that had more to it. The six forwards who came on made a really impact.\n\n'They’ll take this one on the head, enjoy it tonight, preparation will start early tomorrow.'\n\nGareth Thomas: 'I think they’ve put everything the line. It was a tough battle, they couldn’t have done anymore.'", "description": "Retired scrum-half Mike Phillips admits he felt for Wales after they missed out on the Rugby World Cup final with a 19-16 defeat by South Africa.", "authors": ["James Ayles For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/11/20241732-0-image-a-3_1572176005886.jpg", "published_at": "2019-10-27"}