{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7567617/Kym-Marsh-looks-effortlessly-chic-Emilie-Cunliffe-attend-Manchester-Fashion-Festival.html", "downloaded_at": "2019-10-13 08:52:44.503432+00:00", "title": "Kym Marsh looks effortlessly chic as she and Emilie Cunliffe attend the Manchester Fashion Festival", "language": "en", "text": "She's the soap star who never fails to bring the glamour at a showbiz event.\n\nAnd Kym Marsh once again looked effortlessly chic as she attended the Manchester Fashion Festival with daughter Emilie Cunliffe at the city's at Hilton Hotel on Saturday.\n\nThe Coronation Street actress, 43, donned a pink animal print mini dress for the outing, while her girl, 22, looked glam in a semi-sheer black gown.\n\nGlam: Kym Marsh once again looked effortlessly chic as she attended the Manchester Fashion Festival with daughter Emilie Cunliffe at the city's at Hilton Hotel on Saturday\n\nKym teamed her long-sleeved wrapped dress with a simple pair of black heels and a matching clutch bag.\n\nHer brunettes tresses were left to cascade over her shoulders, while she accentuated her features with smokey eyes and a coral lip.\n\nMeanwhile, Emilie sizzled in a high-neck, semi-sheer black lace number, which gave a peek of her black underwear underneath.\n\nShe teamed her look with nude accessories, while her raven tresses were styled into a sleek up 'do.\n\nLooking good: The Coronation Street actress, 43, donned a pink animal print mini dress for the outing, while her girl, 22, looked glam in a semi-sheer black gown\n\nDressed to impress: Meanwhile, Emilie sizzled in a high-neck, semi-sheer black lace number, which gave a peek of her black underwear underneath\n\nTheir outing came as Kym recently revealed that she's preparing to nervously wave off her army boyfriend Scott Ratfliffe as he goes on tour in the Middle East.\n\nThe tar admits that she's laden with 'anxiety' each time she can't get in touch with Scott, who is a major in the Parachute Regiment.\n\nIn an interview with The Sun, she said of Scott, 32: 'There is always anxiety, it is always stressful when he goes away. There may not be an actual war threat currently but there’s always a risk when you’re in these dangerous places.\n\nOn tour: Kym recently revealed that she's preparing to nervously wave off her Army boyfriend Scott Ratfliffe as he goes on tour in the Middle East\n\n'And it can be extra worrying when you aren’t able to communicate for periods of time. If he’s on a base he can get in touch, but there are times when he is out on exercises and I don’t hear from him for three weeks because there is just no signal...\n\n'He always says that it’s the families at home who are the brave ones — they just don’t see themselves as brave at all. But it won’t be easy watching him go away, and I will worry until I see him again.'\n\nWith Manchester-based Kym soon set to depart her Corrie role as Michelle Connor after 13 years on the long-running ITV soap, she plans to spend more time with her hunky beau, as he's often on his base in the south of England.\n\nWorried: The 43-year-old Coronation Street star admits that she's laden with 'anxiety' each time she can't get in touch with Scott, who is a Major in the Parachute Regiment\n\nEarlier this year, Kym stated that she dislikes her her partner being branded her 'toyboy', insisting that the term is 'insulting' to him.\n\nSpeaking in a candid chat to The Sun's Fabulous magazine, the star opened up about falling for Scott after previously stating that she was 'done' with men.\n\nThe couple were introduced by her co-star Anthony Cotton, with the pair building their relationship by talking for hours at a time via FaceTime and texting, before finally coming face-to-face three weeks later.\n\nAfter revealing that she had already 'fallen' for him by the time they met, Kym said of Scott: 'Yeah, it’s love'. 'He has a smile that has the ability to light up any room. He’s got a lovely aura about him. People want to be around him. And I love that he’s not got any idea how fit he is.'\n\nSo in love: Earlier this year, she admitted to being in love with hunky Scott. Pictured in March\n\nBut with an 11-year age gap, the former Hear'Say singer addressed the inevitability of her partner being hailed as her 'toyboy'.\n\n'It’s actually quite insulting to him,' she fumed. 'Because he’s a very intelligent, mature, articulate man who absolutely knows where he wants to be in life.'\n\nKym has been dating Scott since July last year, following her split from Matt Baker, who she had been dating for two years.\n\nThe star was previously married to ex Hollyoaks favourite Jamie Lomas between 2012 and 2014.\n\nBig departure: Kym is soon set to depart her Coronation Street role as Michelle Connor after 13 years on the long-running ITV soap\n\nBefore that she was wed to former EastEnders star Jack Ryder, 37, between 2002 and 2009.\n\nAddressing her failed romances, she shared: 'I’m a huge romantic but I’ve been unlucky in love. My mum and dad have been together since my mum was 18 and the problem with that is that me and my sister are always looking for my dad. And he doesn’t exist because, well, Dad’s Dad!'\n\nMeanwhile, there was recent joy in the soap star's life when she became a grandmother for the first time after daughter Emilie gave birth to a baby boy called Teddy in May.\n\nThe soap actress joined her daughter in the delivery room and served as her birthing partner, which they previously revealed was always going to be the case because they 'do everything together'.\n\nSweet: In May, Kym announced the birth of her grandson as she lauded her daughter Emilie Mae as a 'warrior' after serving as her birthing partner\n\nShe announced the happy news with an adorable black and white picture of the baby's tiny hand in her own palm alongside an emotive caption.\n\nShe penned: 'Last night was a night I will never forget. I became a “Loli” for the first time!!! My beautiful daughter was an absolute warrior and her partner and I were the best birthing team we could be!!!\n\n'I was so honoured to have been a part of bringing him into the world. My beautiful grandson, I love you I will always love you and I promise to help guide you through life as best I can. Welcome to the world “Baby Hoz” #name to follow.'", "description": "The Coronation Street actress, 43, looked chic as she attended the Manchester Fashion Festival with daughter Emilie Cunliffe, 22, at the city's at Hilton Hotel on Saturday.", "authors": ["Niomi Harris", "Ryan Smith For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/13/09/19648962-0-image-a-16_1570954260687.jpg", "published_at": "2019-10-13"}