{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/10/what-it-takes-to-give-a-1949-mercury-the-heart-of-a-tesla", "downloaded_at": "2019-10-11 12:55:02.190971+00:00", "title": "What It Takes To Give A 1949 Mercury The Heart Of A Tesla", "language": "en", "text": "Illustration: Jason Torchinsky\n\nIt came to me in the wide, swishy passenger seat of Jonathan Ward’s 1949 Mercury hot rod. All the right smells were imprinting the moment we rolled through industrial Chatsworth, California. Sun-heated steel from the dash; stretched leather; a vague tinge of nicotine on Ward’s jacket. One thing was missing, though: gasoline. The car wasn’t burning any.\n\nBut when Ward stepped on the go-pedal, the vehicle warped toward the horizon like a hipster hillbilly spaceship.\n\nPhoto: Icon\n\nThere’s a mind-bending weirdness to an art deco desert rat-style car skirting off with the futuristic whirr of a Tesla. But regardless of your stance on old-versus-new, it’s conceptually pretty cool.\n\nWard is hardly the first person to try making a fancy electric car out of an old classic, and this Mercury isn’t even the first EV out of his Icon shop. Icon is known for rebuilding and redressing classic SUVs at the highest level of elegance – such machines fetch six-figure price tags.\n\nLike everything else Icon’s turned out, this electric Mercury’s decorative details are lovely and it certainly feels fast off a stoplight. Dual electric motors and a Tesla Performance 85kWh battery pack will do that. So will its apparent 400 horsepower rating.\n\nWhat’s really interesting about it though: exploring the unique challenges of marrying EV propulsion technology to a 70-year-old car. And more than that, figuring out where EVs fall in the ecosystem of enthusiast collector cars.\n\nEspecially for a shop like Ward’s, which has built its entire brand on selling vehicles that are more like enduring art pieces than tools for transportation.\n\nCan EVs Be Made To Last?\n\nPhoto: Icon\n\n“Traditionally, I’m here to build shit that should last you forever. This should, and still could,” Ward said, gesturing to the only car in his gigantic shop garage with an electric powertrain instead of V8. “But it might mean you’re coming back. If you want to stay up with the latest science, you may be coming back and haemorrhaging more money to evolve with the state of the tech.”\n\nWhat he means is, if you drop a healthy Chevy LS V8 into a car, it’s still going to be relevant and serviceable in a decade. (Probably.) But EV tech is improving a lot more quickly. In fact, components in Ward’s Mercury here has already been updated and upgraded in the time it’s taken to build the thing.\n\n“I haven’t even let the client have it yet... shit, we’ve gone through three generations of [updates] for the battery management system controllers,” he said. “Even the oil cooling system for the motors—two design generational improvements from AMR. And me being the goober that I am, like, I don’t just want to deliver it with what’s already in there. I gain the knowledge that there’s a latest and greatest and I’m like, fuck.” Meaning, he felt compelled to upgrade.\n\nWard mentioned, several times while I was hanging out with him, that he’d been careful to “talk himself out of work” to a lot of folks who’ve asked him to build derelict-style EVs like this (and electric 4x4s, but more on that later) because it’s a huge investment of time and money to drop into uncharted territory.\n\n“Fortunately, the client’s a geek like me too,” Ward said, adding that he’d made it clear this was a guinea pig project.\n\nPhoto: Icon\n\nWard, having established one of the best-known custom car shops in California, now has the enviable problem of keeping up with himself. He’s set a high standard for his wares, and he’s going to have to be able to apply that to electric cars if he wants to maintain his reputation.\n\n“What is the cultural, functional relevance of this,” he said, pointing to the Mercury, “in two years, forget 10. Is it an iPhone 5 now? Is it no longer relevant? Is the capability, refinement, and range so antiquated because the tech is moved along so fucking fast?”\n\nIt was a rhetorical question, of course, because I have no clue. But it was interesting to hear one of the custom car scene’s bigger names admit the same. I can tell you what else is fucking fast though: Ward’s Tesla-powered Mercury.\n\nIt Ain’t Rocket Science, But...\n\nPhoto: Icon\n\nThere’s not a lot of ’49 Mercury left inside this particular frankencar. The body’s as-found, and the interior’s reimagined as-original in aesthetic, but the powertrain and suspension and chassis are bespoke. It’s more an exercise in building an electric driveline and placing the shell of an ancient car around it, rather than doing an EV engine swap on a classic.\n\nThe batteries had to be lifted out of a wrecked Tesla P85D since nobody can buy them off a shelf – another challenge of bringing a custom high-po electric car to life – and squirrelled around the vehicle to help give the vehicle perfectly even four-corner weight distribution, according to Ward.\n\nThat exacerbated the complexities of temperature control.\n\n“I’ve yet to see any of the companies or DIY dudes... no one’s addressing battery thermal management. At best, it’s engine coolant through a 12-volt pump through a clear plastic tube. But, like, Tesla has a dedicated heater network and a dedicated refrigerant-based system, because there’s a sweet spot for battery temperature for safety, longevity, performance, and range. and everyone’s just shitcanning it entirely.”\n\nPhoto: Icon\n\nWard’s learned that keeping various components at certain temperatures has been one of the hardest parts of getting serious performance out of this car. “You can’t just throw a unit in and pump shit through, because the batteries have a different thermal cycle than, say, the controllers,” he told me.\n\n“When people think of EV conversions, including my dumb arse, ‘well shit it can’t be that hard! just a motor, computer, and an energy source! It’s easy!’ Reality is, the [custom EV] industry started with that mentality and at the simplistic form of that, yeah, but if you really want it to be proper, it ain’t this.”\n\nWard went on to detail what he and his team, including an electrical engineering consultant brought on specifically to make this car work, had been thinking about:\n\n“Let’s say you go to Mammoth [Mountain]. And charge up fully at a hotel. And then you go downhill for two and a half hours. Where are those electrons going to go? Like, into a ball of flame? Maybe. And no one’s thinking that through.”\n\nPhoto: Icon\n\n“And, like, transmissions. If I was a smarter man I’d do what 99 per cent of the [EV conversion world]’s doing... you use one or two gears in [the existing] tranny, none of which are the ideal ratio in the first place, and neither is the third member.”\n\n“Any time you go through a tranny, it scavenges so much electrical energy that your efficiency goes to shit, now depending on whatever car it is... suddenly you’re hearing shit that you never heard behind your Coyote V8 or your 454, and that further compounds the complexity. And what’s the point, because, the ideal EV scenario, in my opinion, is transmission-less.”\n\nWe didn’t really spend enough time driving the Mercury to claim a complete shakedown, but I did get to experience Ward’s point about sounds. The steering and other bits made odd squeaks you never would have heard if the car was guzzling air and gas as god intended.\n\nAs for the gearless acceleration, I’m onboard. It’s pretty fascinating the way the car simply swoops up to speed with zero punctuation whatsoever.\n\nPhoto: Icon\n\n“These AMR oil-cooled motors, they’re back to back, I placed them where the tranny was, and then I got this big crazy donkey dick of a driveshaft to a Dana 60 modular aluminium casing to an IRS rear. A friend at Dana helped me find this obscure gearset that got me as close to optimum as possible, so the end result is we’re tranmissionless. Which means more fun when you’re driving, because now you have no shift points, no gears...”\n\nBringing electric vehicle design details to Icon’s level was also a new challenge for Ward and the company. They had to figure out how to make a simple rectangular screen displaying information look cool, which meant utilising yet another company to digitally model a gauge design Icon had mocked up.\n\nBefore I could ask too many questions about that, Ward dove into another engineering wall he’d come up against.\n\nPhoto: Icon\n\n“Steering! Everyone, typically, goes ‘oh that’s no problem, you know there’s this electric [power steering unit] inline with the column motors guys sell, just use that.’ The reality is that the whole EPAS world is brand new and growing, too.”\n\n“So those off-the-shelf solutions, you literally have a knob, a potentiometer, you’re supposed to put on the dash. Because for an electric steering to really give you any proper dynamic feedback, it has to have a different rate, different feedback, different driver feel, when you’re parking versus when you’re doing 100.”\n\n“Well, there’s a knob on the dash that you are manually adjusting. You’re not even networking to a vehicle speed sensor. So, like, that ain’t gonna fly... We did one electric rack, on electric inline... both of them sucked. So, we ended up going with electrohydraulic from an MR2! Which, oddly enough, has been the best solution.”\n\nOnce a car like this finally is buttoned up enough to ship out, it has to be kept alive. “Everything from safety to marketing to permanence and longevity, serviceability. It’s one thing to deliver something with an LS or a Coyote in it [typical car engines] and find a trusted service centre. It’s another thing with EVs,” said Ward. We had moved from inside his garage to a corner of his parking lot behind the dumpsters, something I only mention because that’s how hard it was to find refuge from the sounds of welders and grinders furiously at work within his facility. Icon’s a busy place these days; the market for custom-made six-figure cars is clearly substantial.\n\n“We design all the EVs to be submodular, so in theory, if there’s an issue with one aspect of one system, it’s removable... but at the same time, that rapidity of the design generational improvements concerns me.”\n\nThe Last Inch To Perfection Is The Hardest\n\nPhoto: Icon\n\nWard’s revered as something of a vanguard in the custom car world right now because the things his shop are making really are on another level of magnificence. Retooling an old Land Cruiser or Bronco down to custom-machined switchgear might not make sense objectively, but the Icon execution is exceptional. That’s why Icon is unique, and porting that level of extreme detail-dialling to electric cars is a new deal for the shop.\n\n“The premise, back to my original... idea was, evolving classic transportation in a modern context,” Ward said. “Keep that beauty and style and design that I feel so connected to relevant for myself, then clients, because I needed clients to pull it off, so, I think it would be, negligent to not continue pushing. And, like, is [electric] the future of [transportation]? I don’t know, but I know I want to be part of that exploration, that process, to find out.”\n\nWard certainly feels like the market for EVs is expanding, at least in the short term. “Anyone who’s remotely environmentally aware is seeing the increasing pressures we’re putting on our environment.” In that respect, he thinks “battles with consumers” on electric cars are already won.\n\n“The cool thing I am seeing though, that’s gonna really enable the [electric car] market, is that the demand is exponentially increasing,” Ward says that’s inspiring both cottage industry and big businesses to get onboard.\n\nAs for the appeal of custom machines designed to feel retro: “Even if, god forbid, in 10 years you need a special permit to have a human-driven motorcar, and we’re all on rideshares or apps or autonomous vehicles, I still think, I would actually even argue there’d be an increase in, consumers that are yearning for that visceral man-machine [relationship.]” He leaned down to re-spark his cigarette and added: “I better hope so or I’m fucked.”", "description": "It came to me in the wide, swishy passenger seat of Jonathan Ward’s 1949 Mercury hot rod.  All the right smells were imprinting the moment we rolled through industrial Chatsworth, California. Sun-heated steel from the dash; stretched leather; a vague tinge of nicotine on Ward’s jacket. One thing was missing,...", "authors": ["George Dvorsky", "Tegan Jones"], "top_image": "https://edge.alluremedia.com.au/m/g/2019/10/Screen-Shot-2019-10-11-at-7.19.32-am.png", "published_at": "2019-10-11"}