{"pub": "realclearpolitics", "url": "https://politico.com/story/2019/09/10/health-insurance-rate-1719381", "downloaded_at": "2019-09-10 23:31:49.078338+00:00", "title": "Number of uninsured Americans rises for the first time since Obamacare", "language": "en", "text": "The uninsured rate last year rose as the Trump administration's efforts to undermine the Affordable Care Act took hold. | Joe Raedle/Getty Images Health Care Number of uninsured Americans rises for the first time since Obamacare\n\nThe number of Americans lacking health insurance ticked up slightly last year, marking the first annual increase in the uninsured rate in nearly a decade, the U.S. Census Bureau reported Tuesday.\n\nThe uninsured rate rose from 7.9 percent in 2017 to 8.5 percent last year, amounting to nearly 2 million more uninsured people, as experts said the Trump administration's efforts to undermine the Affordable Care Act were partly to blame.\n\nStory Continued Below\n\nThe Census figures, considered the authority on insurance numbers, showed the first year-to-year increase in the uninsured rate since 2008 to 2009, at the height of the financial crisis and before the ACA became law. Roughly 27.5 million people didn’t have health insurance at any point last year.\n\nThe number of people with health insurance declined even while the economy performed well last year. The poverty rate fell .5 percentage points to 11.8 percent, the lowest rate since 2001. Median household income of $63,179 was virtually unchanged after inflation following three years of statistically significant increases.\n\nStill, the nation’s uninsured rate isn't nearly as high as it was a decade ago, before Obamacare's enactment in 2010. However, the numbers show that insurance gains under the health care law have stalled and are appearing to reverse as the Trump administration focuses on paring back the law's insurance markets and shrinking enrollment in safety net programs like Medicaid and the Children's Health Insurance Program.\n\nIt's unlikely the coverage decline can be attributed to Congress' decision in late 2017 to eliminate Obamacare's penalty for not having health insurance. The penalty — which was never much of an effective motivator to purchase insurance — remained on the books until the start of this year, though it's possible there was confusion about when repeal took effect.\n\nPOLITICO Pulse newsletter Get the latest on the health care fight, every weekday morning — in your inbox. Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nThe Census data confirmed recent warnings from children’s health care experts about an increase in kids lacking coverage. The uninsured rate among people ages 18 and younger increased .6 percentage points to 5.5 percent, or 4.3 million children.\n\nThe children's uninsured rate started to creep up in 2017 after years of decline, according to earlier research from the Georgetown University Center for Children and Families.\n\n\"Prior to the Trump administration assuming office, reducing the number of uninsured children was a national success story,\" said Joan Alker, executive director of the group, which has supported the ACA and other coverage programs. \"Unless things change immediately, this progress is at risk – and our children and their families will pay the price.\"\n\nObamacare supporters said the Census numbers were evidence that the Trump administration's health agenda is harming Americans.\n\n“President Trump’s cruel health care sabotage has left two million more people without health insurance, forced to live in constant fear of an accident or injury that could spell financial ruin for their families,\" House Speaker Nancy Pelosi said in a statement.\n\nTrump's crackdown on immigration also appears to have had an effect. Larger increases in the uninsured rate were seen among Latinos compared to other ethnic groups, as the administration has sought to reduce legal immigration from people receiving public benefits such as Medicaid. Advocates and insurance experts have long warned that the administration's \"public charge\" rule, which was first proposed last year, and other measures would drive immigrants to drop coverage.\n\n“We’ve heard a lot of anecdotal reports and even started to see some data that either immigrant families are declining to renew their coverage or not enrolling,\" said Rachel Garfield of the Kaiser Family Foundation, a nonpartisan research organization.\n\nHHS did not respond to a request for comment. The White House and Trump campaign issued statements highlighting the decline in the poverty rate and positive economic indicators, but neither addressed the higher uninsured rate.\n\nDeclines in public insurance coverage were the sharpest last year, even as the percentage of those covered by Medicare, the health program for seniors, increased. The number of people covered by Medicaid, the health program insuring poor Americans, decreased by .7 percentage points, after seeing significant growth under Obamacare's expansion in recent years.\n\nCensus officials did not attribute a cause for the decline, noting that health coverage rates can change due to a variety of factors, including a healthier economy.However, despite the strong economy, the percentage of people with private health coverage did not change materially, the Census Bureau reported.\n\nBrian Blase, a former White House official who helped steer the administration's efforts to expand cheaper health insurance plans, pointed out the Census found a statistically significant increase in the uninsured rate for people earning more than 400 percent of the federal poverty line. That is the eligibility cutoff for for Obamacare subsidies for those purchasing their own coverage in the law's marketplaces. The finding speaks to the trouble middle-class families face in affording Obamacare plans, Blase said.\n\n\"People above 400 percent of the poverty line, premiums are really expensive for them,\" he said.\n\nThe Trump administration has taken numerous steps to pare back Obamacare coverage. It has issued rules encouraging people to sign up in cheaper health plans that often don't meet Obamacare standards, including protections for preexisting conditions. Trump's health department has also approved the first-everMedicaid work requirements in nine states, with the rules generally applying to low-income adults who gained coverage since 2014 under the Obamacare expansion. However, most of those requirements have not taken effect.\n\nIn Arkansas, the first state where the rules went into effect briefly, the employment conditions led to roughly 18,000 people losing their benefits last year before a federal judge blocked the program. However, the Census found no statistically significant change in the state’s uninsured rate last year.\n\nThe Census estimates found that the uninsured rate declined in three states — New York, South Carolina and Wyoming — and rose in eight states: Alabama, Arizona, Idaho, Michigan, Ohio, Tennessee, Texas and Washington state. Most states saw no statistically significant change.\n\n", "description": "It's the first time the rate has increased since the Great Recession.", "authors": ["Rachana Pradhan"], "top_image": "https://static.politico.com/14/d5/dcb60bcc4213bcc5b860e0020fcf/190910-open-enrollment-gty-773.jpg", "published_at": "2019-09-10"}