{"pub": "mirror", "url": "https://mirror.co.uk/tv/tv-news/sickened-coronation-street-fans-cant-20668155", "downloaded_at": "2019-10-22 13:38:38.621571+00:00", "title": "Sickened Coronation Street fans can't watch Daniel 'bullying' dying wife Sinead", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest soaps stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nSinead Tinker kicked husband Daniel Osbourne out tonight amid \"bullying\" accusations - and Coronation Street viewers struggled to watch.\n\nThe Tinkers and Barlows pulled together to give Sinead a final Christmas day - knowing that she doesn't have long to live.\n\nHowever, Daniel's controlling behaviour over his dying wife and attempts to \"ruin\" the special day became too much.\n\nDespite her obvious agony, Sinead was determined to enjoy herself, but overprotective Daniel caused friction.\n\nAnd the tensions blew over during a heated exchange over the Christmas turkey where Sinead told Daniel to \"stop bullying\" her.\n\n(Image: ITV)\n\n(Image: ITV)\n\nDaniel tried to call an end to the celebrations by insisting Sinead was tired and needed to go to bed.\n\nShaking her head, livid Sinead said: \"Don't you make decisions for me. This is my Christmas, not yours. Stop bullying me.\"\n\nStunned Daniel hit back against the bully allegation, but then put his foot in it again by commenting on Sinead's appearance.\n\n(Image: ITV)\n\nSinead replied: \"I know what I look like. I see myself in the mirror every day. But if I can just get that tiny bit of strength I'm going to use it. And not be confined to bed by you.\"\n\nDaniel really crossed the line when he told dying Sinead she had co consideration for how hard it was for him.\n\n\"Sorry if my imminent death is making you sad,\" said Sinead, who accused her husband of being selfish.\n\n(Image: ITV)\n\nWhen Daniel asked if he should go, he did not expect seething Sinead's response.\n\nWith a stinging reply, she said: \"Too right I'm being serious. We don't need you. I don't need you. Go on, go. Don't bother coming back.\"\n\nAfter giving him a menacing look, Daniel stood up and walked out of the flat as the rest of the family remained in silence.\n\n(Image: ITV)\n\nCorrie viewers took to Twitter after watching the explosive Christmas scenes.\n\nOne viewer said: \"Sinead is right Daniel, you should be making every moment special @itvcorrie not treating her like this\"\n\n\"Why did Daniel have to spoil Sinead’s Christmas,\" added another.\n\nA third said: \"Sinead and Daniel are getting in one last argument. How sad\"\n\n\"No Sinead, please don't do this to Daniel, it will have a lasting memory on him. I don't blame you though,\" said a fourth.\n\n(Image: ITV)\n\n(Image: PA)\n\nDaniel is set to make things even worse when he makes a massive mistake.\n\nWhen Bethany finds heartbroken Daniel crying in the ginnel she tries to comfort him.\n\nThe pair end up in each other's arms and share a passionate kiss - but are caught by a horrified Ken Barlow.\n\nWill Sinead discover her husband cheated on her?\n\n*Coronation Street airs Mondays, Wednesday and Fridays on ITV at 7.30pm and 8.30pm", "description": "Sinead kicked controlling Daniel out of the flat and told him not come back after he ruined the family's pretend Christmas dinner", "authors": ["Kyle O'Sullivan", "Image", "Itv", "Pa"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20668659.ece/ALTERNATES/s1200/0_RLP_MDG_18981JPG.jpg", "published_at": "2019-10-21"}