{"pub": "metro", "url": "https://metro.co.uk/2019/10/12/murdered-mums-unsent-letter-killer-boyfriend-says-still-scare-10907243", "downloaded_at": "2019-10-13 00:20:41.872493+00:00", "title": "Murdered mum’s unsent letter to her killer boyfriend says ‘you still scare me’", "language": "en", "text": "Clare Wood was murdered by George Appleton in 2009 (Picture: PA)\n\nA grieving father has released an unsent letter from his murdered daughter to her killer ex that described how much he terrified her.\n\nClare Wood was 36 when she was strangled and set on fire in her home by obsessive George Appleton on February 2, 2009.\n\nPolice launched a nationwide manhunt before Appleton was found hanging in a derelict pub six days later.\n\nPrior to her killing she repeatedly contacted Greater Manchester Police claiming Appleton had caused criminal damage, harassed, threatened to kill and sexually assaulted her.\n\nThe mother-of-one had a panic alarm installed at her home after filing an allegation of attempted rape against her would-be murderer, and Appleton had even been arrested a week before her death for smashing down her front door.\n\nGreater Manchester Police was found to have mishandled the case by the Independent Police Complaints Commission, which ruled Clare had been let down by ‘individual and systemic’ failures.\n\nAdvertisement\n\nAdvertisement\n\nHer father, Michael Brown, campaigned for the introduction of Clare’s Law because he believed her death would have been preventable had she known about her partner’s violent past.\n\nClare’s Law was introduced after GMP was found to have mishandled the case (Picture: PA)\n\nThe law was introduced in 2014 allowing police to disclose information about a partner’s previous history of violence.\n\nNow, 10 years on, Michael, of South Elmsall, West Yorkshire, has released a handwritten letter from his daughter that reveals her hidden fears.\n\nThe letter was found in the back pages of an empty notebook while former-prison-officer Michael was collecting her belongings.\n\nIt reads: ‘There is no easy way to say this, but I don’t want to be with you, too much has happened.\n\n‘I am so unhappy, I am at the stage where I don’t even like you touching me and that feeling is never going to go.\n\nBelgian princess among 1,300 arrested at Extinction Rebellion protest\n\n‘You still scare me, and I can’t be with someone I am frightened of.\n\n‘Don’t contact me. That’s the way it needs to be. I need to get on with my life. If you have any feeling for me you will let me do this.\n\n‘Don’t use this as an excuse to go off the rails. Bear in mind you were lucky enough not to go to prison again and I did give you a chance and I had to do this by letter because you just won’t listen to me at all.\n\nAdvertisement\n\nAdvertisement\n\n‘I have told you before how I feel and you have chosen to ignore it hoping it will go away, it hasn’t. Each day I feel worse.\n\n‘I have to consider my daughter, also and after all you’ve done, I can’t have you back. It’s not fair on her and she knows I would never be happy with you. She can never trust you either.\n\n‘Take care, I mean it. Clare.’\n\nAppleton had a history of violence and had been in prison (Picture: PA)\n\nMichael, who said his first meeting with his daughter’s killer is etched on his brain, said: ‘She told me she had met this lad, she sounded happy enough.\n\n‘They appeared out of nowhere one day at my house in Batley. I took an instant dislike to him.\n\n‘They had just come from my son’s house and my son asked me what I thought of him and we both had the same opinion. We didn’t like him and want anything to do with him.\n\n‘When I found out he had done time in prison that made me curious. Claire said it was because of some motoring offences.\n\n‘Because of my job I couldn’t be seen to be reporting with ex-cons and I told her not to bring him back. She understood why I said it. I would still visit her and I was there fairly regularly.’\n\nClare ended her relationship with Appleton in October, 2008, after she found he had been texting other women.\n\nAdvertisement\n\nHe said: ‘I was chuffed to bits when I heard she had finished it.\n\n‘Clare came up to us for Christmas – two months before she met her fate – and said George Appleton was making a nuisance of himself. I told her to pack up her things and come back here.’\n\nOn February 5, 2009, Michael received a call from his ex-son-in-law stating he hadn’t heard from Clare.\n\nHe said: ‘It turned out that my daughter had been beaten, strangled and he had set her on fire and they had to use a cherry picker to get her out.’\n\n‘It turns out him being a ‘nuisance’ was actually attempted rape. He was pulled in and let out numerous times by police,’ added Michael.\n\n‘My daughter died because some ‘man’ couldn’t understand the word “no”.\n\n‘Clare didn’t get the protection that one would have expected. You don’t expect to be burying your own child or going to their funeral. That’s not the order of things.’\n\nMichael added: ‘If I had the information I have now back then I would have marched her straight home.\n\n‘The last moments of my daughter’s life were her kicking and screaming trying to get away from Appleton.’\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "Murdered woman Clare Wood's unsent letter to killer boyfriend George Appleton said 'You still scare me'", "authors": ["Chris Caulfield"], "top_image": "https://i0.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_89616134_1570919175.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-12"}