{"pub": "cnn", "url": "https://cnn.com/2019/09/24/health/hot-flashes-link-to-heart-attack-stroke-wellness/index.html", "downloaded_at": "2019-09-24 13:50:46.720707+00:00", "title": "Hot flashes connected to heart attacks and cognitive decline, studies say", "language": "en", "text": "(CNN) If you're one of the 40 million American women between the ages of 45 and 65, there's a chance you could be having a hot flash right now. If your flushes are mild and infrequent, good for you. But if you are often going up in flames, then it could be time to check in with your doctor.\n\nThat's because science is discovering hot flashes are much more than just a sweaty sign of menopause -- their frequency or severity may also be linked to heart problems, stroke and cognitive decline later in a woman's life.\n\nA study presented at the 2019 conference of the North American Menopause Society this week found night sweats were linked to cognitive dysfunction in menopausal women, decreasing the ability to pay attention and perform higher-level thinking tasks.\n\nAnother found a direct link between the frequency and persistence of hot flashes and cardiovascular events later in a woman's life. And here's a startling finding: Another study found there's even a link between childhood trauma and hot flash severity later in life.\n\n\"Having a hot flash is a much more significant event than providers actually appreciated for many years,\" said psychiatry professor Rebecca Thurston, who directs the Women's Biobehavioral Health lab at PittPublic Health.\n\n\"We're starting to link these hot flashes to various different health indices and outcomes, including women's cardiovascular health,\" she said.\n\nHot flashes and your heart\n\nThurston is one of the researchers analyzing the sweltering menopausal journey of more than 3,000 women enrolled in a national multi-site study called Swan, which is a longitudinal look at women's midlife health that started in 1996. Most women entered the program in their mid-40s while they were pre- or early perimenopausal and have been followed for 20 years, into postmenopause.\n\n\"What we found is that women with more frequent hot flashes when they entered into the study in their mid-40s had double the risk of heart attacks, strokes and heart failure later in life,\" said Thurston, who is presenting her findings this week at the North American Menopause Society meeting.\n\nThe results held true even when traditional cardiovascular risk factors, such as smoking, high blood pressure, obesity and diabetes, were ruled out.\n\n\"We also found that women who had more persistent hot flashes over the course of the transition had increased risk for these clinical outcomes of heart attack and stroke, Thurston said. In fact, the study found these women had an 80% greater risk of cardiovascular events over the 20-year period.\n\nAn unusual risk factor\n\nAnother study presented at the conference found a link between a childhood history of sexual, physical or emotional abuse and hot flash frequency in mid-life.\n\n\"We found that women with a history of childhood physical or sexual abuse had more frequent, objectively measured hot flashes during sleep,\" said lead author Mary Carson, a psychology doctoral student at the University of Pittsburgh.\n\nWhen the women were evaluated five years later, the study found those with a history of abuse showed an increase in hot flashes over time, Carson said, \"while women who didn't have this history of abuse showed decrease in hot flashes over time.\"\n\nWe've come a long (hot) way, baby.\n\nNot long ago, little of this knowledge existed. Science is finally starting to dig into why women melt down as a rite of reproductive passage. And that understanding is leading to a change in attitude.\n\n\"We felt that menopausal symptoms, hot flashes specifically, were just benign symptoms that women should just suffer through and that they only lasted a few years,\" Thurston said. \"We've really had this rapid advancement in the understanding of hot flashes just within the past decade.\"\n\nFor example, science now realizes that some 75% of women have hot flashes during their menopausal transition. Frequent moderate to severe hot flashes can often last 7 to 10 years, on average, and less frequent or severe hot flashes can last even longer.\n\nCooling the heat\n\nAccording to the American College of Obstetricians and Gynecologists, estrogen therapy, with or without progestin, is the most effective treatment for the relief of hot flashes and night sweats. After years of fear of hormone replacement therapy, doctors now say that a healthy woman between ages 50 and 60, with normal weight and no family history of breast cancer, could safely use a hormone to assist with their transition.\n\nBut there is no one-size-fits-all in the world of hormone therapy, so be sure to discuss the many options with your gynecologist.\n\nHowever, women who begin therapy more than 10 years from the start of menopause have a higher risk of heart disease, stroke, blood clots and dementia.\n\nThere are many other options. Some antidepressants, such as paroxetine, can be used to treat hot flashes at doses less than what is given for depression.\n\nAn antiseizure medication called gabapentin and a blood pressure medicine called clonidineare can ease sleep problems and hot flashes.\n\nSelective estrogen receptor modulators such as raloxifene act on tissues that respond to estrogen. They may help lessen hot flashes as well as pain during intercourse caused by vaginal dryness.\n\nSome women swear by herbal supplements, such as black cohosh, soy and red clover, but studies on their effectiveness have been mixed. Since there are no federal regulations governing how supplements are manufactured, the Food and Drug Administration warns there's no way to know the quality of the supplement you are taking.\n\n\"Then there's a range of different behavioral approaches, such as cognitive behavior therapy and mindfulness training that can help women manage their hot flashes,\" Thurston said. \"Now, this won't get rid of the hot flash itself, but it can help manage its interference with your life.\"\n\nThe government's Office on Women's Health says yoga, tai chi and acupuncture may help with sleep and mood problems, stress, hot flashes and muscle and joint pain. A 2013 study also found that hypnosis helped decrease hot flashes by 74% in postmenopausal women.\n\nFuture cardio risk?\n\nWhen it comes to the link between hot flashes and future cardiovascular events, will treating the broken internal thermostat reduce a woman's risk? Unfortunately, science doesn't yet know that answer.\n\n\"How I conservatively conceptualize this work right now,\" Thurston said, \"is to consider hot flashes as telling you something about your underlying vascular health.\n\n\"At a minimum, it's a marker. If you're having lots of hot flashes, now is the time to engage in all those things you should be doing to take care of your cardiovascular health at midlife.\"\n\nThat means if you smoke, stop. Get high cholesterol under control. Take care of any high blood pressure with appropriate medication. Keep your weight in check to avoid diabetes. Exercise regularly. And eat a healthy well-balanced diet.\n\nAnd stay tuned. Science is working away on more options to ease the trauma of that scorching, sweaty, excruciating torment some idiot named a hot flash.", "description": "Hot flashes are more than a hot and sweaty torment to be endured, research says. They can a sign of future heart problems to come.", "authors": ["Sandee Lamotte"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190922092028-02-woman-sweating-stock-super-tease.jpg", "published_at": "2019-09-24"}