{"pub": "yahoo", "url": "https://sports.yahoo.com/liverpool-urged-maddison-move-beat-123225151.html", "downloaded_at": "2019-10-08 05:15:26.813077+00:00", "title": "Liverpool urged to make Maddison move and beat Man Utd to Leicester star’s signature", "language": "en", "text": "Liverpool should be looking to beat Manchester United to James Maddison if any transfer scramble is sparked for the Leicester midfielder, says Steve McMahon.\n\nThe Reds got a good look at the 22-year-old midfielder on Saturday, as he netted for the Foxes in a Premier League fixture at Anfield.\n\nHe has already sparked talk of interest from Merseyside, with Jurgen Klopp still in the market for a suitable successor to Philippe Coutinho in the creativity department.\n\nScroll to continue with content Ad\n\nMcMahon believes Maddison could be the perfect choice, with the man looking to earn a first senior England cap during the next international break boasting all of the qualities that would help him slot seamlessly into the fold at Liverpool.\n\nThe former Reds midfielder told Stadium Astro: \"I just wonder, there comes a time and this is no disrespect to Leicester, I wonder if Maddison will make a decision like [Harry] Maguire and think 'do I go for the medals, do I go for the cash'.\n\n“I don’t think he’s going to be at Leicester for a long, long time. I really don’t.\n\n“I think Maddison has another level to go. I think there’s a top team, if it’s not Liverpool then United maybe, they’ll be in for him. He can only get better.\"\n\nJames Maddison Leicester City\n\nOn a player who has enjoyed a meteoric rise to prominence since joining Leicester from Norwich in the summer of 2018, McMahon added: “Jurgen loves up and at them players, 100 per cent, non-stop work rate.\n\n\"He knows his full-backs can create a chance, the space and can go for an overlap.\n\n“I don’t see Maddison sitting on the bench [at a big club]. Say he comes to Liverpool, I’m not telling James Maddison to leave, but if I’m Klopp I would be looking to sign a player.\n\n“He’s young, he’s English, he’s got a lot going for him. He changes the tempo of the game, why wouldn’t he get in Liverpool’s midfield?\n\nStory continues\n\n“Henderson has been getting replaced for ever with Milner, Keita has not come on leaps and bounds, Fabinho is the holding midfield player.\n\n“There’s a position there for him. If he came and he knuckled down, and he got his work ethic sorted, I see no reason why he wouldn’t fit in.”\n\nMaddison recorded seven goals and as many assists for Leicester in the Premier League last season and has already added another two of each during the 2019-20 campaign.", "description": "Former Reds midfielder Steve McMahon believes Jurgen Klopp should be targeting the Foxes star as he would slip seamlessly into the fold at Anfield", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/aa9wvE5zKg3nFeXOjdGDCA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/1o3MG1S.psZZvcMKq.FtTg--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-GB/homerun/uk.goal.com/729eb7509bb39a0716e34db492362c78", "published_at": "2019-10-06"}