{"pub": "yahoo", "url": "https://news.yahoo.com/1-u-arrests-counterterrorism-analyst-180538497.html", "downloaded_at": "2019-10-09 18:42:11.999548+00:00", "title": "UPDATE 1-U.S. arrests counterterrorism analyst over leaks to journalists", "language": "en", "text": "(Updates with more background)\n\nBy Sarah N. Lynch and Andy Sullivan\n\nWASHINGTON, Oct 9 (Reuters) - A counterterrorism analyst with the U.S. Defense Intelligence Agency was arrested on Wednesday over charges he had leaked classified materials about a foreign country's weapons system to two journalists in 2018 and 2019, the U.S. Justice Department said in federal court filings on Wednesday.\n\nInformation that 30-year-old Henry Kyle Frese had passed to a journalist, with whom he was apparently romantically involved, appeared in at least eight different news stories, the Justice Department alleged in an indictment unsealed in the U.S. District Court for the Eastern District of Virginia.\n\nThe Justice Department did not identify the journalists or their news outlets, but said they each worked for a different outlet owned by the same parent company.\n\nThis marks the sixth federal case involving leaks of classified information in a little over two years. A crackdown on leakers was initiated by the Trump administration in 2017 and led by then-Attorney General Jeff Sessions.\n\nThe first case to emerge during the Trump administration involved Reality Winner, a former intelligence analyst who divulged a report about Russian interference in the 2016 election to the Intercept news website.\n\nAnother similar case earlier this year involved former intelligence analyst named Daniel Everette Hale, who was also charged in connection with leaking information to the Intercept related to a U.S. drone strike program.\n\nUntil the criminal case against Winner, no one had been charged with leaking classified information since 2013, said John Demers, the head of the Justice Department's National Security Division, in a press call on Wednesday to announce the charges against Frese.\n\n(Reporting by Sarah N. Lynch and Andy Sullivan; Editing by Chris Reese and Bernadette Baum)", "description": "A counterterrorism analyst with the U.S. Defense Intelligence Agency was arrested on Wednesday over charges he had leaked classified materials about a foreign country's weapons system to two journalists in 2018 and 2019, the U.S. Justice Department said in federal court filings on Wednesday.  Information", "authors": ["Sarah N. Lynch", "Andy Sullivan"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-09"}