{"pub": "cbs", "url": "https://cbsnews.com/news/as-the-us-and-china-clash-nike-walks-a-tightrope", "downloaded_at": "2019-10-25 22:08:06.263486+00:00", "title": "As the U.S. and China clash, Nike walks a tightrope", "language": "en", "text": "Few U.S. companies have had as much success in China as Nike, which has spent years building its brand in the world's most populous nation and largest consumer market. The corollary, of course, is that few corporate players have as much to lose from getting caught up in the rising political tensions between the two countries.\n\nAnd the latest flash point between the U.S. and China — controversy over a tweet by Houston Rockets General Manager Daryl Morey expressing support for pro-democracy protests in Hong Kong — has Nike walking a knife's edge. Vice President Mike Pence on Thursday accused the athletic gear maker of \"checking its social conscience at the door\" for removing Houston Rockets merchandise from its China stores, adding that \"too many American multinational corporations have kowtowed to the lure of China's money and markets.\"\n\nTo be sure, Nike isn't the only big U.S. company to draw fire for its China business. Video game company Activision Blizzard recently faced blowback for suspending a gamer who expressed support for Hong Kong protestors, while Google earlier this month deleted a game from its app store that let users roleplay as the demonstrators. But perhaps none of those companies have as much at stake as Nike, which is battling rival Adidas and domestic Chinese brands for dominance in the People's Republic.\n\nIn a September earnings call, outgoing Nike CEO Mark Parker highlighted China's contribution to the company's bottom line, saying \"we've driven double-digit growth in greater China every quarter for more than five years.\"\n\nNBA's relationship with China frayed over Hong Kong protests\n\nBetween 2015 and 2018, Nike revenues from China doubled to more than $6 billion, a sizable chunk of the company's $36.4 billion in revenue last year. The company now has 20% of the athletic apparel and equipment market in China, putting it neck and neck with Adidas, according to Morningstar estimates. Some of the NBA's most prominent players, including LeBron James, Kyrie Irving, Giannis Antetokounmpo, Kevin Durant and Russell Westbrook, have Nike shoe deals.\n\nNike hasn't publicly responded to Pence's comment, nor discussed its move to yank Rockets merchandise.\n\nJay Sole, an analyst for investment bank UBS, said China is the fastest-growing segment for Nike. The company's China revenues jumped 24% last year, more than triple the company's overall growth rate.\n\nWith so much hinging on China and Beijing cracking down on the NBA over the Morey controversy, Nike had little choice but to pull the Rockets gear, said Morningstar analyst David Swartz.\n\n\"There was no reason to pour gasoline on the fire and make it worse,\" he said. \"They have enormous amounts of money at stake, billions and billions, so they have to be careful.\"\n\n\"It's a totalitarian state and totalitarians don't put up with criticism,\" Swartz added.", "description": "The athletic gear company's surging growth in China puts it in a tough spot — caught in the geopolitical crossfire", "authors": ["Khristopher J. Brooks"], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/10/25/ecaefd63-3f80-4044-8dac-0f4434890892/thumbnail/1200x630/fcbef7e15f751ba530719d9664c26f8b/gettyimages-51302384.jpg", "published_at": "2019-10-25"}