{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/x-factor-stars-judges-who-20647934", "downloaded_at": "2019-10-19 11:26:21.987666+00:00", "title": "X Factor stars and judges who rejected ITV for move to rival BBC", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nFinding fame on the X Factor is a sure-fire way to get your name out there.\n\nBut what happens when ITV's rival broadcasters come knocking?\n\nSome stars and judges who've either found fame on the show, or been given a healthy career boost by it, have gone on to work with the BBC in various projects.\n\nHere's a run down of a few stars who've made the transition...\n\nLittle Mix\n\nLittle Mix made history when they became the first ever group to win the X Factor in 2011.\n\nJade Thirlwall, Perrie Edwards, Jesy Nelson and Leigh-Anne Pinnock all entered the contest as solo artists, but ended up being put together in a band.\n\n(Image: BBC)\n\nThey went on to become one of the most successful acts to ever come out of the show.\n\nEight years on, they're continuing to smash the charts and record sales, sell out stadiums around the world and have a legion of mega loyal fans.\n\nBut now, they've made a move to the BBC.\n\nEarlier this year, Jesy teamed up with the broadcaster to make a hard-hitting and heartbreaking documentary about her mental health battle because of the abuse she'd received from online trolls.\n\nJesy Nelson: Odd One Out saw her reveal that she'd been so damaged by people's vicious comments that she tried to take her own life.\n\nThe BBC Three documentary received a huge response and saw Jesy hailed as an inspiration.\n\n(Image: ITV)\n\nNow, they're continuing their relationship with the broadcaster.\n\nThe girls have just announced that they're making a talent show to rival X Factor.\n\nLittle Mix: The Search, on BBC One, will see them hunt for amazing talent to help create and nurture a new band who'll support them on tour next year.\n\nRylan Clark-Neal\n\nRylan was the underdog of the X Factor when he took part in 2012.\n\nDespite heavy criticism from some of the judges, he finished in fifth place and has gone on to huge success with a number of broadcasters.\n\nAnd he defected to the BBC in 2018.\n\n(Image: Getty)\n\n(Image: PA)\n\nRylan was announced as a regular panelist on Eurovision: You Decide on BBC Two and also took over from Mel Giedroyc as the co-commentator for the Eurovision Song Contest semi-finals, working alongside Scott Mills.\n\nThat same year, he covered for Zoe Ball on her BBC Radio 2 show and took over when she eventually moved to the station's breakfast show.\n\nIn 2019, Rylan acted as spokesperson for the United Kingdom as part of the Eurovision Song Contest 2019.\n\nAnd in September, it was confirmed he'd be the host on the new Ready Steady Cook when it returns to BBC One in 2020.\n\nHe's also been working alongside Zoe Ball as a co-presenter on Strictly Come Dancing spin-off It Takes Two.\n\nCheryl\n\nCheryl herself found fame on an ITV show, having won a place in Girls Aloud on Popstars: The Rivals in 2002.\n\n(Image: BBC/Syco/Thames/Tom Dymond)\n\nAnd just a few years later, in 2008, she became a judge on the X Factor, winning two years in a row with Alexandra Burke and Joe McElderry.\n\nBut in 2019, she moved to the BBC to become a dance captain on rival show The Greatest Dancer.\n\nShe also features as a guest judge on the first ever series of RuPaul's Drag Race UK on BBC Three.\n\nAlexandra Burke\n\nAlexandra became a hit recording artist after winning the X Factor in 2008.\n\nShe went on to forge a successful stage career on London's West End, and it wasn't long before Strictly came knocking.\n\nThe singer took part in the BBC talent show in 2017.\n\n(Image: Rex Features)\n\n(Image: Dave J Hogan/Getty Images)\n\nShe was partnered with professional Gorka Marquez and made it all the way to the final.\n\nOlly Murs\n\nOlly Murs finished as runner-up when he took part in the X Factor in 2009.\n\nIt was big news when he signed up to be a coach on rival show The Voice in 2018, but by then, it had moved from the BBC to ITV.\n\nBut Olly has worked with the BBC as well.\n\n(Image: MCPIX/REX)\n\nIn 2011, he appeared on CBBC's hidden camera show Remote Control Star.\n\nHe also starred in a CBBC show in 2016, called Songs, Stories and Secrets with Olly Murs.\n\nAston Merrygold\n\nAston was a finalist on the X Factor in 2008 with his band JLS, who came second to Alexandra Burke.\n\nThe singer also appeared on the same series of Strictly as Alexandra in 2017.\n\nHe was teamed up with Janette Manrara, and was tipped by the bookies from the very beginning.\n\nFans were left shocked when he was sent home by the judges in week seven, after landing in the bottom two and facing Mollie King and AJ Pritchard in the dance off.\n\n(Image: REX)\n\n(Image: PA)\n\nAston and Janette reunited the following year for the Christmas Special of Strictly.\n\nThey performed a Jive to Cee Lo Green's What Christmas Means To Me and scored a perfect 40.\n\nThey won the festive special.\n\nDo you have a story to sell? Get in touch with us at webcelebs@trinitymirror.com or call us direct 0207 29 33033", "description": "While they may have found fame or propelled themselves to a higher level of stardom on the X Factor, not everyone sticks exclusively with ITV", "authors": ["Vicki Newman", "Image", "Bbc", "Itv", "Getty", "Pa", "Bbc Syco Thames Tom Dymond", "Rex Features", "Dave J Hogan Getty Images", "Mcpix Rex"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20643442.ece/ALTERNATES/s1200/0_LITTLE-MIX.jpg", "published_at": "2019-10-18"}