{"pub": "yahoo", "url": "https://news.yahoo.com/climate-activists-hold-event-mark-132940667.html", "downloaded_at": "2019-09-23 02:30:13.973730+00:00", "title": "Climate activists hold event to mark vanishing Swiss glacier", "language": "en", "text": "Mels, Switzerland (Reuters) - Hundreds of climate activists paid their respects to a Swiss glacier on Sunday that is due to disappear over the next decade, the victim of a warming environment.\n\nThe Pizol glacier, now at less than a tenth of a square km, in the Glarus Alps in eastern Switzerland has been retreating as temperatures climb. Located about 2,600 meters (8530 ft) above sea level, the glacier is due to vanish completely by 2030.\n\n\"I have climbed up here countless times,\" said Matthias Huss glaciologist at ETH Zurich university, addressing the people who joined the march. \"It is like the dying of a good friend.\"\n\nAt roughly 0.06 square km (0.02 square miles), the glacier is just a fraction of its area in 1987 when scientists recorded it at 0.32 square km. Just four years ago, its area was put at 0.1 square km, according to the Global Glacier Change Bulletin.\n\nThe gathering in Switzerland, which has about 1,500 glaciers, mirrors an action in August when activists and others in Iceland commemorated a melted glacier there.\n\nIn Switzerland, climate change activism has been rising, including action this year in which dozens of people were arrested after blocking entrances to Swiss banks some people blame for their role in financing energy projects that are reliant on fossil fuels.\n\nMoreover, the country famous for its direct democracy may soon vote on going climate neutral, after organizers of a petition drive called \"the Glacier Initiative\" collected 120,000 signatures needed to put the measure on the ballot.\n\n\"We can't save the Pizol glacier anymore,\" said Huss. But if people acted now, many of the negative effects of climate change could be contained. \"Let's do everything we can, so that we can show our children and grandchildren a glacier here in Switzerland a hundred years from now.\"\n\n\n\n\n\n(Writing by John Miller, reporting by Michael Shields, Denis Balibouse; editing by David Evans)", "description": "Hundreds of climate activists paid their respects to a Swiss glacier on Sunday that is due to disappear over the next decade, the victim of a warming environment.  The Pizol glacier, now at less than a tenth of a square km, in the Glarus Alps in eastern Switzerland has been retreating as temperatures", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/sDzdpI03hWL0e_HrsLeZmQ--~B/aD0zMDA7dz00NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/reuters.com/8e9c386b8a32add425af15a4cf7e78e9", "published_at": "2019-09-22"}