{"pub": "atlantic", "url": "https://theatlantic.com/international/archive/2019/10/america-policy-syria-deadly-end/600682", "downloaded_at": "2019-10-25 16:01:39.336432+00:00", "title": "The Deadly End of American Policy in Syria", "language": "en", "text": "U.S. allies on the nonviolent side of the conflict have suffered a similar fate. Aid workers, activists, journalists, local administrators, medical workers, proponents of human rights and civil society—all these and more received various forms of U.S. training and backing over the years, and all were targeted regularly. ISIS killed U.S.-backed activists in Syria and even across the border in Turkey as Assad and Russia bombed hospitals run by international nonprofits. Support from the United States, it turned out, was not a blanket of security; these Syrians were not afforded special protection as global citizens of the modern Rome. Instead, they had targets on their backs. No one embodied this better than the activist Raed Fares, who was open about the support he received. Fares traveled regularly to Washington to meet with U.S. officials and lawmakers, but even as the threats against him mounted, he always returned to Syria. He was there in the fall of 2018 as Assad’s forces closed in on his native province of Idlib, well aware by then that his was a lost cause. “I want to die here,” he told me then. He was killed by an assassin’s bullet not long after.\n\nRead: The forever war fought by America’s allies\n\nNow, with Trump having suddenly decided this month to pull American forces out of northern Syria, unleashing a Turkish invasion and chaotic days of violence and displacement, the U.S.-allied Syrians who remain in the country are having to choose whether to press ahead with their own unlikely causes or escape.\n\nKurdish-controlled Syria had been the last bastion for those who cast their lot with the American cause. It was run by a U.S.-backed and Kurdish-led militia called the Syrian Democratic Forces, which had cleared the large swath of northeastern Syria from ISIS, and its security was guaranteed by the presence of some 1,000 U.S. troops. As the SDF sought to stabilize the region and set up a form of self-governance, Western aid groups and their local staffs worked on everything from providing humanitarian assistance and rebuilding infrastructure to clearing unexploded roadside bombs and ordnance from air strikes. But Turkey sees the SDF as an enemy, and Trump ordered the U.S. withdrawal so his Turkish counterpart could invade.\n\nI spoke with one Syrian aid worker who has been coordinating humanitarian projects funded by the U.S. State Department. He was torn between wanting to continue his work while at the same wondering whether he should flee to safety. The hasty U.S. departure has forced the SDF to seek a deal with Assad to ward off further Turkish incursions. Regime troops have already returned to some SDF areas and could soon return to more, putting anyone with U.S. ties at risk. This month, Syria's foreign minister accused anyone who had worked with the SDF of committing crimes against the country, vowing, \"There won’t be any foothold for U.S. agents on Syrian territory.” The aid worker, who asked to remain anonymous to protect his safety, said he believed regime forces would come for him and other NGO staff. Still, he told me, his conscience would not allow him to leave—he was responsible for managing humanitarian aid, and there were those who needed help. “But in the end,” he said, “there might not be another option.”", "description": "Over the course of the long civil war, Syrians who cast their lot with America have often met with grim fates. Those who remain are suddenly scrambling to escape.", "authors": ["Mike Giglio"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/10/RTS2SGGM/facebook.jpg?1571946157", "published_at": "2019-10-25"}