{"pub": "atlantic", "url": "https://theatlantic.com/letters/archive/2019/09/no-more-corporate-judges-readers-respond/598861", "downloaded_at": "2019-09-27 14:59:39.799911+00:00", "title": "Letter: Banning Corporate Lawyers From the Federal Bench Would Be Bad for Diversity", "language": "en", "text": "Tiffany Wright\n\nWashington, D.C.\n\n\n\nEd Williams\n\nArlington, Va.\n\n\n\nAndrea Dargin\n\nNational Chair of the National Black Law Student Association\n\nWashington, D.C.\n\n\n\nPorfirio Gueiros\n\nNational Chair of the National Latina/o Law Student Association\n\nGainesville, Fla.\n\nBrian Fallon and Christopher Kang reply:\n\nIn proposing that Democrats get serious about finally prioritizing professional diversity on the federal bench, we of course do not mean for that to occur at the expense of racial diversity. Contrary to the authors’ speculation, we actually did explore whether these two priorities might be in tension. We are confident that they are not.\n\nOne of us in particular has a strong basis to know: As deputy White House counsel for President Obama, Chris personally identified candidates for judicial vacancies, reviewing thousands of lawyers in the process. As has been widely noted, Chris’s time in this position was a historic period in terms of the number of women, people of color, and openly gay and lesbian lawyers nominated to the federal bench. But he also saw many qualified lawyers of color from public-interest and public-defender backgrounds who were not nominated, due to political opposition.\n\nPresident Trump has nominated the fewest African American and Hispanic judges since Ronald Reagan. The next president absolutely must build upon the Obama administration’s commitment to gender and racial diversity—but she or he must simultaneously set out to conquer the next frontier of underrepresentation by elevating more public defenders and public-interest lawyers.\n\nWe agree with the authors when they observe that the current path to federal judgeships is very costly and requires extensive political networking. But we disagree that the proper response to this reality is to simply content ourselves with a judiciary full of well-connected, former corporate lawyers. Rather, we ought to widen the path to federal judgeships in a way that makes it more accessible to lawyers who have been previously excluded. In addition to greater professional diversity, we should seek to have more judges who graduated from non-Ivy law schools and who did not have a federal clerkship.\n\nWe certainly understand the financial strains on first-generation lawyers who do not come from privileged backgrounds and those who bear the burden of the racial wealth gap, beginning their careers deep in debt. It is for this very reason that our proposal carves out room for lawyers who may have worked at corporate law firms for years as associates, and only puts a moratorium on ones who have chosen to make their careers representing corporate interests, as indicated by their partner status at such firms. As we stated in our Atlantic article, of course partners at corporate law firms can become fair-minded judges, but that legal background is grossly overrepresented in our federal courts. We admit that our proposal would omit many accomplished lawyers—including, but not limited to, many lawyers of color—from consideration in the next Democratic administration. But these individuals are not, in any sense, entitled to a federal judgeship. No one is. There is a closed universe of judicial vacancies—likely fewer than 200 in a president’s term—and it’s time to make space for those lawyers who, by virtue of their decision to spend their careers representing indigent defendants or workers who have suffered discrimination, have been largely excluded over the past few decades.", "description": "Readers push back on a proposal to exclude corporate-law partners from federal judiciary nominations.", "authors": [], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/RTS29BJM/facebook.jpg?1569506017", "published_at": "2019-09-27"}