{"pub": "townhall", "url": "https://townhall.com/columnists/austinbay/2019/10/16/americas-individualsanctions-weapon-economic-and-diplomatic-warfare-power-with-an-information-edge-n2554802", "downloaded_at": "2019-10-16 05:11:16.076191+00:00", "title": "America's Individual-Sanctions Weapon: Economic and Diplomatic Warfare Power With an Information Edge", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nWith the goals of halting human rights abuse and deterring corruption, the U.S. Treasury Department and State Department now routinely impose assorted financial, travel and legal sanctions that target specific \"perpetrators of serious human rights abuse and corruption\" -- individual bad actors and organizations (entities) the thugs and scumbags manipulate.\n\nEarlier this year, I was asked if these types of sanctions \"ever worked.\" I had been discussing operations combining elements of power: diplomatic, information, military and economic (DIME). The Treasury wields economic power; the State Department has diplomatic clout. I thought the question was fair, though I had the impression the questioner thought individual sanctions often amounted to Beltway moral posturing. Noble words, sir, but do the operations ever produce laudable deeds?\n\nBefore I summarize my reply, let's sketch two recent examples of sanctions targeting specific individuals. In March 2019, the Treasury Office of Foreign Assets Control (OFAC) sanctioned six Venezuelan government hacks associated with dictator Nicolas Maduro. In February, the officials obstructed humanitarian aid deliveries into Venezuela. The Trump administration correctly argued that these Maduro henchmen were \"weaponizing\" food deliveries \"in order to control vulnerable Venezuelans.\"\n\nExample two: On Oct. 11, OFAC imposed sanctions on two South Sudanese men, Ashraf Seed Ahmed Al-Cardinal and Kur Ajing Ater. Washington alleges the men and six companies they control have stolen \"critical resources\" from war-torn South Sudan.\n\nAccording to a Reuters report, in Al-Cardinal's case, critical food supplies were part of the scheme. This year, South Sudan's government \"paid millions of dollars to a company owned by Al-Cardinal ostensibly for food.\" Al-Cardinal actually deposited the funds in accounts belonging to senior South Sudanese government bigwigs. Ajing also made payoffs and moved money in scams involving crude oil.\n\nIn a press statement, Secretary of State Mike Pompeo said OFAC had implemented the Global Magnitsky Human Rights Accountability Act and targeted \"perpetrators of serious human rights abuse and corruption.\" (Yes, the quote appears in the first sentence of this column.)\n\nA cop-on-the-beat translation: Both Al-Cardinal and Ajing are connected mobsters who have deep pockets and well-armed bodyguards. They influence South Sudanese politics. They have used -- likely orchestrated -- violence in South Sudan to advance their financial interests. Like Central and South America cartelistas, they have powerful friends in neighboring countries.\n\nTo call South Sudan war-torn understates the tragedy. Since December 2013, when the country's latest civil war began, at some point a third of the population had to flee their homes. African Union mediators have managed to forward last year's peace agreement, but it is months behind in implementation. Negotiations continue, but violence could disrupt the process.\n\nCrooks like Al-Cardinal and Ajing prosper in anarchy. Here's a scenario to ponder: Would perps plot with a rogue militia to disrupt the peace process in order to protect their criminal fiefs or keep government cronies in power for a few more lucrative months?\n\nIt's pure speculation. Except variations on this scenario occur -- far too often.\n\nPompeo's press statement indicated sanctioning Al-Cardinal and Ajing should not be framed as an isolated act but as a demonstration of America's \"commitment to prevent and combat corruption globally.\"\n\nMere words expressing noble intent?\n\nNow for my answer. Twenty years ago, self-serving activists like Samantha Power exaggerated the effectiveness of sanctions. By themselves, these efforts are rarely decisive. America, however, casts a vast, interconnected economic and diplomatic net that can deny perps the fruits of their crimes. Assets in the U.S. can be frozen and seized. U.S. allies often cooperate.\n\nWithin days of the March sanctions, Venezuela began permitting aid deliveries. Information played a role -- charges of starving your own people sting. But individual sanctions may well have had a powerful effect.\n\nAs for South Sudan? Too early to tell. But consider my scenario. Giving Al-Cardinal, Ajing and their cronies second thoughts on staging a massacre may have been a diplomatic objective. Of course, that's merely a guess ...", "description": "With the goals of halting human rights abuse and deterring .10/16/2019 1:09:13AM EST.", "authors": ["Austin Bay", "Matt Vespa", "Julio Rosas", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2017/163/2508c04e-25ea-46fd-ac99-3e0ad6e85730.jpg", "published_at": "2019-10-16"}