{"pub": "breitbart", "url": "https://breitbart.com/news/tesla-comes-when-called-but-can-fray-nerves", "downloaded_at": "2019-10-11 02:27:33.392111+00:00", "title": "Tesla comes when called, but can fray nerves", "language": "en", "text": "San Francisco (AFP) – Roddie Hasan loves his Tesla, but after a fright using a feature that lets him summon the car as he might a dog, he says he will be walking to get it.\n\nThe electric vehicle maker, a contender in the technology race to fully self-driving cars, last month issued a software update that included a “Smart Summon” feature for having Teslas go to owners instead of the other way around.\n\nA smartphone app acts as a remote control, and Tesla advised owners to keep their cars in sight the whole time.\n\nStepping from a pizzeria into a quiet parking lot, Hasan decided to “summon” his Tesla Model 3.\n\nHe watched as the car eased out of its stall and headed in his direction.\n\nAs his Tesla neared an intersection, Hasan noticed a car coming quickly from another direction on what appeared to be a collision course.\n\nHasan jerked his finger from a button on the Tesla smartphone app. The vehicle halted, which he credits to either his action or onboard autopilot capabilities.\n\n“In the end, I do not know if my car stopped by itself or if it’s me who stopped it,” Hasan told AFP.\n\n“I don’t want to try that kind of scenario again, so I’m just going to wait a little bit.”\n\nHe shared video of his Summon feature experiment on Twitter, triggering a flood of comments from Tesla critics and fans, along with some who wondered why didn’t simply walk to his car.\n\nOther manufacturers have added features that allow a vehicle to park itself and return to the owner, but Tesla’s broad rollout may be one of the most ambitious to date.\n\n– Rain and children –\n\nEdmunds.com director of vehicle testing Dan Edmunds was troubled by what he saw in video clips shared online by Hasan and others even though countless cases of Summon working just fine have probably not been similarly put on display.\n\n“I don’t like using members of the public as development engineers,” Hasan said of Tesla owners being de facto testers of the new feature.\n\n“Doing it this way might be fine for a phone app, but for a vehicle that’s going to be coexisting with cars on the highway and pedestrians… it’s unimaginable to me.”\n\nTesla did not respond to an AFP request for comment.\n\nTesla co-founder and chief executive Elon Musk tweeted last week that Smart Summon had been used more than 550,000 times within days of becoming available.\n\nMusk has expressed confidence that next year Tesla would launch a “robo-taxi” platform that would let self-driving vehicles provide people rides on demand.\n\nSmart Summon is considered a step toward Teslas being able to operate without need of human drivers.\n\n“I have kids, so to be able to call the car, when it’s raining outside or you have a bunch of bags, it’s nice to get the car coming to you,” said John Stringer, president of Silicon Valley’s Tesla Owners Club.\n\n“It’s the next closest thing before full self-driving, the car being to make its way through the parking lot.”\n\nThe California-based company’s vehicles boast “autopilot” capabilities, but at a level for use on highways only and with someone in the driver’s seat to take control if needed.\n\n“If I had to choose between the two features, I prefer autopilot; it changed my life on daily basis,” Stringer said.\n\n“When you get home, you’re tired of long day at work, and you still need to unwind after driving for an hour — but now I unwind from day of work in my car.”\n\n– Race against time –\n\nA plan to deploy fully autonomous vehicles on the road next year “does not leave much time, especially given that caution has replaced early optimism for the technology, according to BCG consulting firm automotive specialist Xavier Mosquet.\n\nMajor car companies along with firms such as Uber and Google-owned Waymo have been in a race to field self-driving cars, but it is looking as though the finish line could take a few more years to reach than first thought.\n\nMosquet said challenges in the way included dealing with foul weather and bringing down the cost.\n\nAnd, autonomous cars must also win the trust of regulators and society.", "description": "San Francisco (AFP) – Roddie Hasan loves his Tesla, but after a fright using a feature that lets him summon the car as he might a dog, he says he", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/10/8c1d32_tesla-is-promoting-its-smart-summon-as-prelude-autonomous-driving-as-owners-640x335.jpg", "published_at": "2019-10-10"}