{"pub": "reuters", "url": "https://in.reuters.com/article/uk-japan-economy-report/japan-government-downgrades-economy-view-as-global-slowdown-weighs-idINKBN1WX0WV", "downloaded_at": "2019-10-18 08:54:40.757454+00:00", "title": "Japan government downgrades economy view as global slowdown weighs", "language": "en", "text": "TOKYO (Reuters) - Making its economic assessment for October, Japan’s government described the economy as recovering at a moderate pace, but said exports were showing prolonged weakness, which was a slightly bleaker view than last month.\n\nA man cycles by shipping containers in Tokyo August 28, 2012. REUTERS/Toru Hanai/Files\n\nThe assessment still implied domestic demand remained firm enough to offset risks to Japan’s export-driven economy from a global growth slowdown.\n\nBut the downbeat estimation could lead to calls on the government to swiftly open its purse strings and add pressure to the Bank of Japan to ease monetary policy this month.\n\nIt was the third time this year the government downgraded its view on the economy, having also marked it down in March and May. The last time the government downgraded its assessment by at least three times in a single year was back in 2012, when it became progressively pessimistic for four months in a row.\n\nThe Cabinet Office, which helps coordinate government policy, downgraded its assessment of factory output in October for the first time in five months, saying it had a weak tone.\n\nThe softness in production was largely due to car exports to the United States turning weaker, after growing steadily until the spring, a government official said at a briefing.\n\nThe finance ministry is due to release trade data for September on Monday. The latest reading showed exports dropped for a ninth straight month in August, with U.S.-bound shipments falling due to declines in exports of 3000cc cars and car parts.\n\nThe Cabinet Office left untouched its view on most of the other individual components of the report, offering a generally positive view of domestic demand.\n\nBut it said attention should be paid to consumer sentiment following this month’s sales tax hike, and the economic impact of natural disasters, including a powerful typhoon that struck Japan last week, killing at least 77 people.\n\nJapan’s economy, the world’s third-largest, has grown for the past three quarters, though the pace was slower than initially estimated in April-June as business spending was downgraded, revised data showed last month.\n\nThe government’s assessment on Friday aligned with the BOJ’s which on Tuesday raised its view for one of the country’s nine regions and retained its sanguine view on the rest.\n\nThe central bank last month said it would take a more thorough look at whether heightening overseas risks could derail the fragile economic recovery.", "description": "Making its economic assessment for October, Japan's government described the economy as recovering at a moderate pace, but said exports were showing prolonged weakness, which was a slightly bleaker view than last month.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191018&t=2&i=1442219953&w=1200&r=LYNXMPEF9H0P3", "published_at": "2019-10-18"}