{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/10/win-free-rent-for-a-whole-year", "downloaded_at": "2019-10-18 10:37:00.402255+00:00", "title": "WIN! Free Rent For A Whole Year", "language": "en", "text": "Image: Getty Images\n\nThere's a competition happening in Australia right now that every renter needs to be a part of. For an entire year, Leatherman is shouting one Aussie free rent at their existing property (or $25,000's worth - whichever happens first.)\n\nTo enter, all you need to do is fill out the online entry form which should take you all of 30 seconds. Hop to it, renters!\n\nImagine how much money you'd save if you didn't have to pay rent for a year. You could save up for an overseas holiday, finally upgrade the family car or maybe build towards a house deposit. Alternatively, you could live large for 12 months without budgeting or pinching pennies.\n\nThanks to the multitool maestros at Leatherman, one lucky Aussie will get live out this dream! If you happen to win, the company will pay your rent up to a value of $25,000, which happens to be the Australian rental average. That works out to around $480 a week. Even if your rent is higher than this, that's a pretty big chunk they're taking care of.\n\nApparently, it's all in celebration of the Leatherman Free; a new completely redesigned multi-tool that packs in up to 22 tools in one. Here's the spiel from the company:\n\nLeatherman – the world’s leading multitool – is a huge believer in giving young people a fair go, and the opportunity to follow their passion, just like our founder Tim Leatherman. To celebrate the launch of Leatherman FREE™, we want to support other young individuals to follow their dreams by ridding one Australian millennial from their biggest expense; their rent.\n\nTo enter, all you need to do is click this link and tell Leatherman why you think you deserve free rent in 25 words or less. That's it! As barriers to entry go, they don't get much lower than that. Take a punt and you might just get free rent for an entire year. Imagine it!\n\nThere are also 20 of the aforementioned Leatherman Free multitools up for grabs as runner-up prizes (RRP: $99.95).\n\nYou can check out the terms & conditions here.\n\nFind more great bargains at Lifehacker Coupons.\n\nAs Lifehacker editors we write about stuff we like and think you'll like too. Lifehacker often has affiliate partnerships, so we may get a share of the revenue from your purchase.", "description": "There's a competition happening in Australia right now that every renter needs to be a part of. For an entire year, Leatherman is shouting one Aussie free rent at their existing property (or $25,000's worth - whichever happens first.)  To enter, all you need to do is fill out the online entry form which should take...", "authors": ["Logan Booker", "Hayley Williams"], "top_image": "https://edge.alluremedia.com.au/m/l/2019/10/GettyImages-919387188.jpg", "published_at": "2019-10-18"}