{"pub": "wsj", "url": "https://wsj.com/articles/emmys-kick-off-a-big-week-in-tv-11569157204?mod=rsswn", "downloaded_at": "2019-09-22 13:14:50.576133+00:00", "title": "Emmys Kick Off a Big Week in TV", "language": "en", "text": "Sunday’s Emmy Award show is the year’s biggest night of fanfare for a television industry on a rolling wave of change. For the major broadcast networks, still yoked to the traditional rhythms of the business, more is riding on the days immediately following the Emmys.\n\nBeginning Monday night, the big four broadcasters—ABC, CBS, Fox and NBC—will roll out about 60 new and returning prime-time shows in the space of a week. It’s the official start of the 2019-2020 TV season, as designated by Nielsen in a byzantine system tied to long-standing factors, ranging from the priorities of advertisers, to the looming holiday season, the pro sports calendar, and even autumn’s earlier sunsets.\n\nThe prime-time bottleneck of premiere week seems increasingly outmoded to TV viewers now accustomed to on-demand everything and a year-round flow of shows. Meanwhile, the menu is about to get much longer in coming months as the streaming platforms of Disney , Apple and others media companies launch, offering loads of new programs and libraries of old ones.\n\nSome network schedulers chafe at the narrow launch window they have to work with each fall, when advertising for new cars, big movies and Christmas shopping hits high gear. Cramming most of their premieres into one week accentuates the competition broadcasters face not just from their main network rivals, but also the endless programming alternatives that audiences can summon on-demand.\n\n“The unfortunate thing is we are all screaming in a room full of screaming people,” says Andy Kubitz, ABC’s executive vice president of programming strategy.\n\nNBC’s Emmy-nominated ‘The Good Place’ will have its season premiere this week. Photo: NBC\n\nTo concentrate their efforts, some networks have pared down the number of new shows that they send out to sink or swim in the fall. Still, with broadcasters remaining tied to this seasonal cycle, they’re using premiere week to create a crescendo of marketing and cross-promotion, starting with the Emmys telecast itself.\n\n“It’s a big opportunity to promote the entire business on our air, and do that on the night before premiere week starts,” says Dan Harrison, executive vice president of strategy and scheduling for Fox Entertainment. The Emmy telecast, on Fox this year, rotates annually among the broadcasters.\n\nFox is raising the curtain on its fall season as well as its debut as an independent network. It was carved off when Disney purchased 21st Century Fox’s other major entertainment assets last spring for $71.3 billion. The Fox Network’s parent company, Fox Corp., shares common ownership with Wall Street Journal parent News Corp .\n\nFox’s ‘The Masked singer’ returns Wednesday with a two-hour season premiere. Photo: FOX\n\nFox’s has three new scripted series, including “Prodigal Son,” about a psychologist ( Tom Payne ) who enjoys insights into criminal minds because his father ( Michael Sheen ) was a serial killer. One of Fox’s urgent priorities is keeping afloat its big hit from last year, “The Masked Singer.” The music/mystery competition returns Wednesday with a two-hour season premiere.\n\nA factor in Fox’s premiere-week hustle is the October pre-emption of shows when it airs Major League Baseball playoff games and the World Series. “Post-season baseball is coming up quickly, so we want to get moving and take advantage of higher viewing levels as it’s getting darker earlier around the country,” Mr. Harrison says.\n\nAfter spreading some of its series debuts into October last year, ABC is again focusing its firepower on the first week of the season. “The whole point is to try and build habits” among viewers, says ABC’s Mr. Kubitz.\n\nAmong ABC’s returning series, the new shows aiming for lift-off this week are “Mixed-ish,” the second spin-off in the “Black-ish” franchise; “Emergence,”a family drama fueled by an eerie mystery; and “Stumptown,” starring Cobie Smulders as an Army vet-turned-private eye. Adapted from a graphic novel, the crime show is set not in New York or Los Angeles, but Portland, Ore.\n\nCBS takes a leap into the supernatural with its new series ‘Evil.’ Photo: CBS\n\nCBS, which hasn’t wavered from its strength-in-numbers approach to premiere week, is adding several new sitcoms, including “Bob Hearts Abishola,” an odd-couple courtship story from “The Big Bang Theory” co-creator Chuck Lorre. From its wheelhouse in hour-long procedurals, including the new courtroom drama “All Rise,” CBS is taking a leap into the supernatural with producers Michelle and Robert King. The “Good Wife” and “Good Fight” creators are branching out from legal doings for “Evil,” in which a skeptical psychologist and a Catholic priest-in-training investigate alleged demonic possessions and other “X-Files”-ish stuff.\n\nAt the Emmys, NBC was the only network broadcaster represented in the top series-level categories, for its comedy “The Good Place” and drama “This Is Us.” Those marquee shows make their return in premiere week, along with the network’s latest effort to inject music into a show that isn’t “The Voice.” Following last year’s cancellation of high-school musical drama “Rise,” NBC is trying “Perfect Harmony,” a comedy featuring Bradley Whitford as a music professor leading a small-town church choir.\n\nThe CW, the fifth-largest broadcast network, looks for elbow room by holding its premieres for the week of Oct. 6. To its returning lineup of DC Comics-based shows, the network is adding “Batwoman.” Ruby Rose stars as the vigilante hero (aka Kate Kane ) who also happens to be lesbian. The CW succeeded in making Archie and Jughead sexy with the noir melodrama “Riverdale,” and now the network is reintroducing another character born in the 1930s: “ Nancy Drew, ” starring Kennedy McMann as the teen sleuth, makes its debut after “Riverdale” on Oct. 9.\n\nWrite to John Jurgensen at john.jurgensen@wsj.com", "description": "Jumping off the awards fanfare, major broadcast networks—still tied to a seasonal scheduling cycle—will roll out around 60 prime-time shows in one week", "authors": ["John Jurgensen", "John.Jurgensen Wsj.Com"], "top_image": "https://images.wsj.net/im-109345/social", "published_at": "2019-09-22"}