{"pub": "chinadaily", "url": "https://global.chinadaily.com.cn/a/201910/16/WS5da67aaca310cf3e35570bac.html", "downloaded_at": "2019-10-16 03:58:07.197940+00:00", "title": "Unmanned helicopter program nets first prize in collegiate competition", "language": "en", "text": "By Ma Zhenhuan in Hangzhou | China Daily | Updated: 2019-10-16 10:04\n\nAn unmanned helicopter program from a Tsinghua University team was awarded first prize at the 5th China College Students \"Internet Plus\" Innovation and Entrepreneurship Competition in Hangzhou, Zhejiang province, which was held from Saturday to Tuesday.\n\nOnce in production, this kind of helicopter can be widely applied in sectors such as firefighting and emergency rescue, according to Li Jingyang, leader of the team.\n\nThe second prize was awarded to a team from Zhejiang University, and the university also shared the third prize with a team from the Sepuluh Nopember Institute of Technology of Indonesia and Zhejiang University of Technology.\n\nRiding high on the goals and undertakings outlined in the nation's call to boost innovation and entrepreneurship, this year's gala, which gathered the cleverest brains from Chinese university campuses, lured 4.57 million students from across the nation to showcase their ideas in advanced fields such as artificial intelligence, virtual reality and new materials.\n\nThe myriad research findings have the potential to be transferred from laboratories to the business sector.\n\nZhou Hongyi, CEO of 360 Security Technology and also a member of the jury, showed an appreciation for the student participants.\n\nZhou said investors and incubators could help them improve their business models and inventions to make them viable and successful in the business community.\n\nThe competition was initiated by 12 ministries, including the Ministry of Education, to echo the instructions of the State Council on deepening the innovation and entrepreneurship education reform in Chinese colleges and universities.\n\nThe event has been held for five consecutive years. So far, 9.47 million students and 2.28 million teams have participated in the competition since its inception.\n\n\"The competition has helped create a real Chinese model for innovation and entrepreneurship education among higher education institutions in China,\" Wu Yan, director of the Department of Higher Education at the Ministry of Education, said at a news briefing on Thursday.\n\nHe added that the event has helped incubate a group of high-quality projects, giving intellectual support for the construction of an innovation-driven country.\n\nQin Jirong and Ye Shuning contributed to this story.", "description": "An unmanned helicopter program from a Tsinghua University team was awarded first prize at the 5th China College Students \"Internet Plus\" Innovation and Entrepreneurship Competition in Hangzhou, Zhejiang province, which was held from Saturday to Tuesday.", "authors": [], "top_image": "https://img2.chinadaily.com.cn/images/201910/16/5da67aaca310cf3e97a16cac.jpeg", "published_at": "2019-10-16"}