{"pub": "yahoo", "url": "https://news.yahoo.com/post-mortems-begin-39-victims-083527267.html", "downloaded_at": "2019-10-26 07:47:39.681186+00:00", "title": "Vietnamese may be among UK truck dead as police make three more arrests", "language": "en", "text": "By Peter Nicholls\n\nGRAYS, England (Reuters) - Police investigating the deaths of 39 people in a truck near London said they had arrested three more suspects on Friday on suspicion of human trafficking amid signs that some of the dead may be Vietnamese.\n\nAs forensic experts began the process of identifying the victims, the Vietnamese embassy in London said families from the southeast Asian country had got in touch about missing relatives. There were growing concerns at least 10 of the victims could have been from Vietnam.\n\nHoa Nghiem from Human Rights Space, a civic network based in Vietnam, said that Pham Thi Tra My, 26, had sent a text message to her mother saying she could not breathe at about the time the truck container was en route from Belgium to Britain.\n\n\"I’m sorry, mum and dad. My path abroad was not a success. I love you both so much. I can’t breathe. I'm from Nghen Town, Can Loc District, Ha Tinh, Vietnam ... I am sorry, Mom,\" the message said, according to Hoa who told Reuters it had come from Tra My's family.\n\nShe said Tra My had gone to China and was planning to reach England via France and that the organisation was getting more alerts about possible Vietnamese victims in the refrigerated trunk, which was found in the early hours of Wednesday.\n\nPolice have said they believe the dead were Chinese but Beijing said the nationalities had not yet been confirmed. Chinese and Vietnamese officials are now both working closely with British police, their respective embassies said.\n\n\"We owe it to those who have died to get this investigation right and speculation is not helpful,\" Essex Police's Deputy Chief Constable Pippa Mills told reporters. \"It may in fact hinder our investigation and its progress.\"\n\nShe said they would not give any more details about the identities or nationalities of the victims until the formal identification process was complete.\n\nHer officers were still questioning the 25-year-old truck driver on suspicion of murder following the discovery of the bodies in the back of his truck.\n\nHe has not been formally identified but a source familiar with the investigation named him as Mo Robinson from the Portadown area of Northern Ireland.\n\nOn Friday, police also arrested a man and woman, both aged 38, in Warrington, northwest England, and a 48-year-old man from Northern Ireland at London's Stansted Airport. They are suspected of conspiracy to traffic people and manslaughter.\n\nThe victims - 31 men and eight women - are being moved to a hospital mortuary from a secure location at docks near the industrial estate in Grays about 20 miles (30 km) east of London where the bodies were found.\n\nPost-mortem examinations were beginning to determine how exactly they died while the lengthy process of identifying the deceased was underway.\n\nVietHome, an organisation for the Vietnamese community in Britain, said it had received news from 10 families that their relatives were missing.\n\nFor years, illegal immigrants have attempted to reach Britain stowed away in trucks, often from the European mainland. In 2000, 58 Chinese were found dead in a tomato truck at the port of Dover.\n\n\n\n\n\nBRITAIN 'HAS NOT FULFILLED RESPONSIBILITY'\n\n\"We hope that the British side can as soon as possible confirm and verify the identities of the victims, ascertain what happened and severely punish criminals involved in the case,\" Chinese Foreign Ministry spokeswoman Hua Chunying told a daily news briefing.\n\nChina's Global Times, which is published by the ruling Communist Party's official People's Daily, said in a Friday editorial that Britain should bear some responsibility for the deaths.\n\n\"It is clear that Britain and relevant European countries have not fulfilled their responsibility to protect these people from such a death,\" the widely read tabloid said.\n\nIt added that Britain appeared not to have learned its lesson from the Dover incident two decades ago.\n\nThe police investigation is focussed on the movement of the trailer prior to its arrival at Purfleet docks near Grays little more than an hour before the bodies were found, and on who was behind the suspected human trafficking.\n\nIrish company Global Trailer Rentals said it owned the trailer and had rented it out on Oct. 15. The firm said it was unaware of what it was to be used for.\n\nThe refrigeration unit had travelled to Britain from Zeebrugge in Belgium and the town's chairman, Dirk de Fauw, said he believed the victims died in the trailer before it arrived in the Belgian port.", "description": "Police investigating the deaths of 39 people in a truck near London said they had arrested three more suspects on Friday on suspicion of human trafficking amid signs that some of the dead may be Vietnamese.  As forensic experts began the process of identifying the victims, the Vietnamese embassy in London", "authors": ["Peter Nicholls"], "top_image": "https://s.yimg.com/uu/api/res/1.2/9Os7RxE04cdzu_uJNiyioQ--~B/aD00NjQ7dz03OTk7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-GB/reuters.com/a6e3c8848274e89811224ddbe0596216", "published_at": "2019-10-25"}