{"pub": "businessinsider", "url": "https://businessinsider.com/19-year-old-ceo-raised-32-million-seed-round-from-vc-investors-2019-10", "downloaded_at": "2019-10-17 11:37:31.627561+00:00", "title": "Check out the pitch deck this 19-year-old founder used to raise $3.2 million in seed funding from legendary investors Sequoia Capital", "language": "en", "text": "Evervault, a data privacy management platform, just raised $3.2 million in seed funding from legendary Silicon Valley funds including Sequoia Capital and Kleiner Perkins.\n\nThe company was only founded earlier this year in Dublin, Ireland by 19 year-old entrepreneur Shane Curran.\n\nNow the startup hopes to grow its team of developers after receiving Sequoia's first seed investment outside of the US.\n\nClick here for more BI Prime stories.\n\nLeading US venture capital investor Sequoia Capital has made its first seed investment outside of the United States to back 19-year-old Irish CEO Shane Curran in a $3.2 million round.\n\nCurran, who founded cybersecurity startup Evervault earlier this year, pitched for funding to build out a team of developers for his startup. Kleiner Perkins, Frontline and SV Angel also participated in the round.\n\nEvervault promises secure cloud infrastructure for app developers. It isn't publicly available yet, but would-be customers can join the startup's waitlist. Data breaches from poor security or hacking have become a major problem for businesses of all kinds with millions of passwords and other sensitive information leaked every year. In August, Amazon's widely used AWS cloud service came under scrutiny after a massive breach at credit provider Capital One.\n\nIt's still pretty unusual for Silicon Valley funds to invest in early-stage European firms, let alone an entrepreneur as young as Curran. The 19 year old was studying business and law at University College Dublin, but has put his studies on hold to focus on Evervault.\n\nHe has had a meteoric rise to prominence in the world of tech. He won the 2017 BT Young Scientist & Technology Exhibition for research in cryptography and data privacy while he was still in high school in Dublin. He has regularly spoken at tech conferences which increased his profile and attracted investors.\n\n\"The fundraising process is very time consuming when you're trying to run a business so there's a sense of relief that it's done,\" Curran told Business Insider in an interview. \"Having great investors around you is a real comfort blanket and means we have the support to build out our engineering team in Dublin.\"\n\nEvervault can be integrated into developers' software via an API and could be a key step towards improved data privacy.\n\n\"Shane has a special combination of clear vision, deep thoughtfulness and insatiable curiosity,\" said Stephanie Zhan, partner at Sequoia in a release. \"We are thrilled to partner with Evervault at the seed, to solve for today's massive data breaches and build simple developer tools for data privacy.\"\n\nYou can check out the company's first pitch deck below:", "description": "\"Having great investors around you is a real comfort blanket and means we have the support to build out our engineering team in Dublin.\"", "authors": ["Callum Burroughs"], "top_image": "https://image.businessinsider.com/5da82d30cc4a0a13e104c995?width=1200&format=jpeg", "published_at": "2019-10-17"}