{"pub": "townhall", "url": "https://townhall.com/columnists/bobbarr/2019/09/04/oklahoma-opioid-opinion-a-harbinger-of-dangers-to-come-n2552574", "downloaded_at": "2019-09-04 08:06:23.239676+00:00", "title": "Oklahoma Opioid Opinion a Harbinger of Dangers to Come", "language": "en", "published_at": "2019-09-04", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nAnyone hoping to find consistency in how courts are assigning responsibility for the so-called “opioid crisis” will be sadly disappointed. Last May, a North Dakota judge dismissed a lawsuit against Purdue Pharma that sought to hold the pharmaceutical manufacturer responsible for that state’s opioid problem. Just last week, an Oklahoma judge in a very similar case decided to take the opposite approach and found that another drug manufacturing giant, Johnson & Johnson, was responsible for the state’s high number of individuals using the opioids it manufactured; to the tune of nearly $600 million.\n\nIn each of these lawsuits, the pharmaceutical company was charged under the respective state’s “nuisance” laws, with engaging in “deceptive” marketing practices that in turn caused and contributed to individuals’ opioid addiction.\n\nUsing nuisance laws in this way -- targeting deep-pocketed corporations selling or manufacturing dis-favored products within a state – is a legal maneuver increasingly favored by aggressive state attorneys general to attack everything from cigarettes to firearms.\n\nConsidering the facts in these two most recent opioid cases were very similar, why were the judges’ rulings dramatically different? As Reason’s Jacob Sullum put it, the rulings “pit a simple narrative of the ‘opioid crisis’ with a clear set of villains against a more complicated story that's closer to the truth.” In other words, the two courts had very different concepts of “justice” regardless of the facts presented.\n\nIn North Dakota, both sides of the controversy were argued and weighed, with Judge James Hill holding that the State failed to meet its burden of proof; not that Purdue was completely innocent, but rather the State did not have sufficient evidence to find the company legally responsible. Oklahoma Judge Thad Balkman took a far more policy-based approach. He appeared to essentially ignore the evidence presented by the corporate defendant, including strong evidence showing that abuse of the prescription medication it manufactured was only a small part of the overall opioid death trend. He then went for the multi-hundred-million-dollar pound of corporate flesh.\n\nIn North Dakota, we see judicial reasoning reflective of the objective standard normally expected from courts. The Oklahoma judge’s reasoning reflects something more akin to mob justice; purposed only to slake society’s collective thirst for assigning blame and punishment.\n\nBroadly speaking, the problem with the Oklahoma verdict extends far beyond the opioid setting on which it and its North Dakota counterpart were based.\n\nFor example, as Democrats continue their relentless effort to dismantle the buffer between politics and the judiciary at every level, we face the very real danger that courts are becoming little more than public stockades, where true guilt matters far less than simply finding someone to punish and shame. It is distressing that many of today’s judges appear willing, if not eager, to make decisions reflecting such a philosophy.\n\nDemocrats understand this well, and it is why they have become adept at using our state and federal court systems as political bludgeons to hamper President Trump’s ability to implement the public policies on which he was elected. In this emerging game of judicial brinksmanship, a single federal judge is able to bring to a screeching halt virtually any important national policy move Trump makes.\n\nDemocrat kingmaker George Soros also clearly understands the power inherent in our supposedly impartial judicial system. In recent years, he has devoted significant financial resources to ensure that local prosecutors, state attorneys general and state judges who share his political philosophy are elected to such offices (along with a willingness to thus abuse the powers of those positions).\n\nAt the federal level, Democrats are keenly aware that Trump’s picks for district, appellate and Supreme Court judges are far less likely than those nominated by his Democrat predecessors to view courts as policymaking bodies. It is precisely why Senate Democrats remain so hatefully dedicated to regaining control of the Senate and defeating Trump next year. The Oklahoma judge’s expansive assignment of responsibility to a perhaps unsympathetic corporation for individuals abusing a product is but a small taste of what is to come if the Democrat Party succeeds in its political goals next year.", "description": "Anyone hoping to find consistency in how courts are assigning .09/04/2019 3:55:08AM EST.", "authors": ["Bob Barr", "Beth Baumann", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2014/196/328fa922-aea5-4dc3-8e5c-347e910649ca.jpg"}