{"pub": "vice", "url": "https://vice.com/en_asia/article/3k3mpj/chinese-city-jinan-banning-men-from-exposing-stomachs-beijing-bikini", "downloaded_at": "2019-09-08 11:38:55.043992+00:00", "title": "A Chinese City Is Banning Men From Exposing Their Stomachs", "language": "en", "text": "In 2016, The New York Times published an article discussing a Chinese cultural phenomenon known as the “Beijing bikini”. The tag refers to the not uncommon practice of men rolling up their shirts and exposing their barenaked midriffs—a simple cooling technique that’s been embraced in some of the nation’s balmier climes. But while temperatures soar in parts of China, authorities in the eastern city of Jinan are cracking down on the “uncivilised behaviour” of cropped shirts and exposed bellies—claiming it’s “seriously affecting the image of the city,” The Guardian reports.\n\nJinan City issued a notice stating that anyone caught violating the new guidelines and rocking a Beijing bikini could face punishment, particularly in densely populated areas such as parks, public squares, buses, and business areas. Authorities specifically called out the city's older men, referred to as bang ye or “exposing grandfathers”, who they accused of tarnishing the city's image as well “the perception and feeling of the public”.\n\n\"Urban civilisation is related to everyone,” a spokesperson for the city's civility department said in a recent interview with Beijing Youth Daily. “We also hope that we can start from scratch and jointly maintain the image of the city.” The spokesperson added that “in recent years, as people have become more civil, cases of people being shirtless have decreased,” but said “there are still some incidents that impact the city’s image and its citizens’ feelings.”\n\nThe city’s new regulations also discourage residents from other “unseemly” public behaviours such as taking off shoes to air out feet, bathing in bodies of water, spitting on the ground, and queue jumping. Jinan isn’t the first Chinese city to crack down on the Beijing bikini, though. Earlier this year, authorities in Tianjin, in the country’s northeast, issued guidelines stating that those who show too much skin in public could be hit with fines of up to 200 yuan (about $30 USD), according to Sixth Tone.\n\nMany have welcomed Jinan’s recent decision, with commenters on Weibo agreeing that Beijing bikinis are “too uncivilised” to be permitted in Chinese cities.\n\n“The streets are full of middle-aged men showing their bellies,” wrote one Weibo user. “Those with genuine class will not do this. Women on the street do not wish to see your bodies!”\n\nFollow Gavin on Twitter or Instagram\n\nSign up for our newsletter to get the best of VICE delivered to your inbox daily.", "description": "The so-called \"Beijing bikini\" is a popular way for Chinese men to cool off. But authorities in China have condemned the look as \"uncivilised behaviour\".", "authors": ["Meera Navlakha", "Caleb Quinley"], "top_image": "https://video-images.vice.com/articles/5d22cbb4c24a810008ca8dfa/lede/1562561901932-pjimage-2019-07-08T145806591.jpeg?crop=1xw:1xh;center,center&resize=1200:*", "published_at": "2019-07-08"}