{"pub": "heritage", "url": "https://heritage.org/press/heritage-president-joins-secretary-energy-advisory-board", "downloaded_at": "2019-10-01 00:08:41.764079+00:00", "published_at": "2019-10-01", "title": "Heritage President Joins Secretary of Energy Advisory Board", "language": "en", "text": "WASHINGTON – U.S. Secretary of Energy Rick Perry has selected Heritage Foundation President Kay Coles James to join the Secretary of Energy Advisory Board. The SEAB will meet this week in Chicago.\n\nAs a member of the board, James will “provide insights and recommendations to the secretary of energy on the ongoing department priorities, according to the Department of Energy’s announcement. These include “advancing research in artificial intelligence, enhancing energy security domestically and abroad, fostering innovation by reducing regulatory road blocks, and continuing a record of energy abundance with the Trump administration’s ‘all-of-the-above’ energy policy.’”\n\nJames, who previously served in three presidential administrations, said she was grateful for the opportunity to contribute.\n\n“It’s a tremendous honor to serve on Secretary Perry’s Energy Advisory Board and to bring to the table Heritage’s considerable research into ensuring energy abundance, improving environmental impacts, and reducing regulatory road blocks,” James said. “The right energy policy can ensure America’s families and businesses have safe, reliable, and affordable sources of energy to power our lives and our economy while protecting our environment in the process.”\n\nThe Heritage Foundation’s Index of Economic Freedom offers a guide for how rule of law, limited government, regulatory efficiency, and open markets stimulate economic growth, lead to a cleaner environment, and improve access to affordable energy benefitting all Americans.\n\n“Having Mrs. James’ voice on the board will be critical to advancing policies that open access to markets, eliminate favoritism, and reduce regulatory burdens,” said Nick Loris, deputy director of Heritage’s Roe Institute for Economic Policy Studies and Herbert and Joyce Morgan fellow in energy and environmental policy. “Her commitment to an energy agenda rooted in economic freedom will drive innovation forward benefitting households and businesses across the country.”\n\nThe Trump administration has taken productive steps to open access to energy development and reduce the costly regulatory burdens that yielded no environmental benefit. Specifically, the Department of Energy expedited small-scale natural gas exports and relieved the permitting backlog at the Federal Energy Regulatory Commission. Increasing natural gas exports will create jobs and grow the economy while providing more energy choice to America’s allies.More recently, the department withdrew Obama-era energy-efficiency standards for candle-shaped, globe-shaped, three-way and reflector lightbulbs. This victory for consumer freedom put power back in the hands of families who have different budget constraints, preferences, and needs when buying a lightbulb or a new car.\n\nOther members of the Secretary of Energy Advisory Board include:\n\nScott Campbell, senior strategic advisor at Baker Donelson and president of The Howard Baker Forum\n\nMarvin Fertel, retired president and CEO of the Nuclear Energy Institute\n\nAnkur Jain, founder and CEO of Kairos\n\nSean McGarvey, president of North America’s Building Trades Unions\n\nDr. Thomas Rosenbaum, president of California Institute of Technology\n\nBill Samuels Jr., chairman emeritus of Maker’s Mark Distillery\n\nMichael Whatley, partner at HBW Resources\n\nMore information on the Secretary of Energy Advisory Board can be found here.", "description": "WASHINGTON – U.S. Secretary of Energy Rick Perry has selected Heritage Foundation President Kay Coles James to join the Secretary of Energy Advisory Board. The SEAB will meet this week in Chicago.", "authors": [], "top_image": "https://www.heritage.org/themes/heritage/src/images/bell.png"}