{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7544325/Kyle-Sandilands-returns-Australia-fallout-Virgin-Mary-joke.html", "downloaded_at": "2019-10-07 00:07:21.042915+00:00", "title": "Kyle Sandilands returns to Australia after fallout from Virgin Mary joke", "language": "en", "text": "Kyle Sandilands finally returned to Australia on Monday, after spending three weeks in Los Angeles in the aftermath of his controversial Virgin Mary joke.\n\nThe 48-year-old radio personality landed in Sydney Airport, where he was greeted with a handshake from his longtime friend and manager Bruno Bouchet.\n\nKyle dressed casually in a black T-shirt and shorts as he left the terminal and looked somewhat confused by the media attention.\n\nBack to business! Kyle Sandilands finally returned to Australia on Monday, after spending three weeks in Los Angeles in the aftermath of his controversial Virgin Mary joke\n\nWhen asked about the Virgin Mary incident, Kyle told paparazzi: 'Is it that old news?\n\n'I've been gone for three weeks... pick something else. Good to see you, don't ask me dumb questions.'\n\nOn September 18, Kyle offended thousands of listeners - and attracted 150 formal complaints to media watchdog ACMA - by saying the Virgin Mary wasn't actually a virgin at all.\n\nWarm welcome! The 48-year-old radio personality landed in Sydney Airport, where he was greeted with a handshake from his longtime friend and manager Bruno Bouchet\n\nHe then flew to Los Angeles for a pre-planned trip, and remained there for three weeks as the scandal made headlines.\n\nLast Monday, as The Kyle and Jackie O Show returned to the airwaves following a break during the non-ratings period, Kyle broadcast live from a home studio in LA.\n\nHe issued an eight-minute apology in which he confessed to not understanding 'the gravity' of what he'd said.\n\nWhat are you guys doing here? Kyle dressed casually in a black T-shirt and shorts as he left the terminal and looked somewhat confused by the media attention\n\n'I didn't realise the gravity of it. I upset a lot of people,' he said on air. 'Even friends of mine were like, \"Bro how could you say something so dumb like that?\"'\n\nThe KIIS FM star added that he 'only wanted to make people laugh' and emphasised that the joke was 'not planned' in any way.\n\n'Am I going to quit? No. Am I going to get fired? No. Am I sorry? Absolutely I am sorry because, as I've said, I never intended to purposely upset anyone,' he said.\n\nMoving on! When asked about the Virgin Mary incident, Kyle told paparazzi: 'Is it that old news? I've been gone for three weeks... pick something else'\n\nWhoops! On September 18, Kyle offended thousands of listeners - and attracted 150 formal complaints to media watchdog ACMA - by saying the Virgin Mary wasn't actually a virgin at all\n\n'Obviously I have upset people and I'm sorry for it. There's nothing else I can do. We have all made mistakes in our life and this is just one of the many I have made.'\n\nKyle's co-host Jackie 'O' Henderson and KIIS FM's newsreader Brooklyn Ross also apologised for laughing at his joke.\n\nAt the height of the backlash, Kyle's manager said his friend was 'misunderstood' by the general public.\n\nOverseas: He then flew to Los Angeles for a pre-planned trip, and remained there for three weeks as the scandal made headlines\n\n'Am I sorry? Absolutely I am sorry': Last Monday, Kyle issued an eight-minute apology to listeners while broadcasting from a home studio in LA\n\nOutraged: Religious protesters targeted KIIS FM's headquarters in North Ryde, Sydney on September 30 in response to Kyle's joke about the Virgin Mary being promiscuous\n\n'He's not a bully nor a hateful man,' Bruno told Now To Love.\n\n'[Kyle] hates it when I call him \"a big softy\"... [but] he's one of the most generous, thoughtful and talented people I've ever met.'\n\nKyle will return to the airwaves on Tuesday.\n\n'He's not a bully nor a hateful man': At the height of the backlash, Kyle's manager Bruno (right) said his friend was 'misunderstood' by the general public", "description": "Kyle Sandilands finally returned to Australia on Monday, after spending three weeks in Los Angeles in the aftermath of his controversial Virgin Mary joke.", "authors": ["Joshua Fox For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/23/19374356-0-image-a-41_1570402402396.jpg", "published_at": "2019-10-06"}