{"pub": "cbs", "url": "https://cbsnews.com/news/rowena-chiu-harvey-weinstein-former-assistant-details-alleged-sexual-assault-in-op-ed", "downloaded_at": "2019-10-07 04:07:55.509863+00:00", "title": "Former assistant to Harvey Weinstein details alleged sexual assault in op-ed: \"He liked Chinese girls\"", "language": "en", "text": "Rowena Chiu, Harvey Weinstein's former assistant at Miramax Films, alleged that he attempted to rape her 21 years ago in an op-ed published Saturday by The New York Times. She wrote the disgraced movie mogul told her \"he liked Chinese girls ... because they were discreet\" hours before the alleged assault.\n\n\"You've most likely never heard of me. I'm not an actress,\" Chiu wrote in the op-ed. \"I don't even work in Hollywood anymore. I was one of many ordinary, unfamous women trying to do their jobs who were abused by Harvey.\"\n\nThe former assistant said she earned the position after graduating Oxford University in 1998 with the \"one ambition\" of succeeding in the film business. Chiu, who is originally from England, was hired to assist Weinstein in London on his European productions.\n\nLater on in the year, Chiu was discussing \"potential film productions and scripts\" during a late-night meeting with Weinstein at the Venice Film Festival when she said she was assaulted.\n\n\"After hours of fending off his chitchat, flattery, requests for massages and a bath, ultimately I found myself pushed back against the bed,\" she recalled. \"I'd worn two pairs of tights for protection, and tried to appease him by taking one of them off and letting him massage me, but it hadn't worked. He'd taken off the other pair and I was terrified my underwear would be next. Harvey moved in: 'Please,' he told me, 'just one thrust, and it will all be over.'\"\n\nShe claimed she tried multiple tactics to discourage him, from asking to go back to discussing the scripts to telling Weinstein she had a boyfriend. Eventually, she said, she was able to \"wriggle off the bed and leave,\" because \"Harvey thought there would be another night to play the game and half the fun was the chase.\"\n\n\"Last month, 21 years after Harvey attempted to rape me, I finally stepped out of the shadows to allow the public to know my name,\" writes Rowena Chiu https://t.co/Bl27E3if6n — New York Times Opinion (@nytopinion) October 5, 2019\n\nIn the aftermath of the alleged attempted rape, Chiu said she informed her colleague Zelda Perkins and she confronted Weinstein, \"ensuring that I would never be alone in the same room as my predator again.\"\n\nWhen they returned to England, Chiu said her and Perkins' attempts to report Weinstein to his superiors or the authorities were thwarted: \"The message was always the same: Who would ever believe us over the most powerful man in Hollywood?\"\n\nEventually, Chiu said she and Perkins hired lawyers, were \"pressured into signing a nondisclosure agreement\" and accepted a settlement of £125,000 (about $213,000).\n\nWhile living with the alleged trauma for nearly two decades, Chiu wrote that she attempted suicide twice. She said she lived in \"constant fear\" of Weinstein's \"abuse, control and power,\" suffering \"completely isolated from those around me.\"\n\nChiu said she remained silent out of fear as \"The New York Times\" journalists Jodi Kantor and Megan Twohey started publishing stories about Weinstein's alleged inappropriate behavior beginning in October 2017.\n\nWhile she wasn't prepared to speak out when the journalists went to print two years ago, she agreed to come forward for the first time publicly in their new book, \"She Said: Breaking the Sexual Harassment Story That Helped Ignite a Movement.\"\n\nIn the book, which was released in September, the journalists go into detail about what they uncovered and how difficult it was to get women who said they had been victimized to go public.\n\n\"It is important to me now that I speak up, that I allow my voice, an Asian voice, an assistant's voice, to join the array of voices in the #MeToo movement,\" said Chiu in the op-ed.\n\nWeinstein's lawyer, Donna Rotunno, said Chiu's allegations are false and pushed back at other allegations in the book.\n\n\"This book contains one-sided allegations without having adequately investigated the facts of each situation,\" she wrote, The Associated Press reported. Rotunno said Weinstein and Chiu had \"a six-month physical relationship\" that was consensual. She also said that Weinstein was \"now studying taking legal action\" against Chiu for breaking a nondisclosure agreement.", "description": "She said Weinstein told her \"he liked Chinese girls ... because they were discreet\" hours before the alleged assault", "authors": ["Danielle Garrand"], "top_image": "https://cbsnews2.cbsistatic.com/hub/i/r/2017/10/11/ff290191-fb63-4e44-9d2b-a3205dc7df91/thumbnail/1200x630g3/58b3adbbd758e121fb1a28daacb8c53c/rts1fnvo.jpg", "published_at": "2019-10-07"}