{"pub": "investing.com", "url": "https://au.investing.com/news/economy/trumps-fed-tweets-shown-to-have-significant-effect-on-trading-1961318", "downloaded_at": "2019-09-23 11:56:27.591038+00:00", "title": "Trump’s Fed Tweets Shown to Have ‘Significant’ Effect on Trading", "language": "en", "text": "(Bloomberg) -- Terms of Trade is a daily newsletter that untangles a world embroiled in trade wars. Sign up here.\n\nPresident Donald Trump’s Twitter attacks on the Federal Reserve are prompting investors to bet the central bank will bow to political pressure and lower interest rates, according to a new study.\n\nTrump has frequently used social media to criticize the Fed and Chairman Jerome Powell for running rates higher than he thinks they should be. A review of such tweets and the market response by economists from Duke University and the London Business School found they have a “statistically significant and negative effect” on markets.\n\nThe broadsides knocked a combined 10 basis points off the expected fed funds futures contract, the equivalent to about 0.30 basis points per Tweet, the study found.\n\n“We provide evidence that market participants believe that the Fed will succumb to the political pressure from the President, which poses a significant threat to central bank independence,” Francesco Bianchi, Thilo Kind and Howard Kung said in a study published on Monday by the National Bureau of Economic Research.\n\nThe finding will likely disappoint the Fed, whose officials have long argued they don’t take Trump’s lobbying into account when setting monetary policy and that they act independently of politics.\n\nJust last week, the president accused the Fed of having “No ‘guts,’ no sense, no vision!” despite it just having cut rates for the second time this year.\n\nTrump also recently asked whether Powell or China’s president, Xi Jinping, was “our bigger enemy.” In August, he pointed to Germany’s sale of debt with negative yields to criticize Powell, saying the Fed board “puts us at a disadvantage against our competition.” He’s also questioned “Where did I find this guy Jerome?” despite being the one to nominate him.", "description": "Trump’s Fed Tweets Shown to Have ‘Significant’ Effect on Trading", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/pic0ea327110c323b3783482f03574fa0b3.jpg", "published_at": "2019-09-23"}