{"pub": "arynews", "url": "https://arynews.tv/en/rose-mcgowan-harvey-weinstein-me-too", "downloaded_at": "2019-10-24 06:39:08.650785+00:00", "title": "Rose McGowan sues Harvey Weinstein for 'diabolical' effort to silence her", "language": "en", "text": "LOS ANGELES: US actress Rose McGowan filed a lawsuit on Wednesday (Oct 23) against Harvey Weinstein, his ex-attorneys and a private intelligence agency, alleging they conspired to discredit her when she accused the disgraced movie mogul of rape.\n\n“This case is about a diabolical and illegal effort by one of America’s most powerful men and his representatives to silence sexual assault victims,” the suit filed in Los Angeles federal court states.\n\n“And it is about the courageous women and journalists who persisted to reveal the truth.” McGowan was one of the first women to make public allegations about Weinstein’s abuse, triggering his downfall in 2017 and the emergence of the #MeToo movement that brought down many other public figures.\n\nHer lawsuit targets Weinstein, lawyers David Boies and Lisa Bloom and the private intelligence firm Black Cube. The claims include racketeering, invasion of privacy and fraud.\n\nMcGowan alleges that when Weinstein learned in 2016 that she planned to write about the alleged rape said to have taken place in 1997, he unleashed a team of fixers to ensure her story “never saw the light of day, and – if it did – that no one would believe her.”\n\n“Weinstein’s campaign against McGowan and others involved some of the most powerful forces that money could buy,” according to the suit.\n\n“He enlisted prominent, media-savvy representatives David Boies and Lisa Bloom. He hired the international spy agency, Black Cube.”\n\nThe suit says Weinstein and his team worked in concert for more than a year to try to silence his victims and journalists reporting on the abuses.\n\nBloom’s attorney Eric George said in a statement to AFP on Wednesday that “it is inexcusable that Ms McGowan chose to include my client in her lawsuit.” “Facts matter,” he added.\n\n“There is simply no credible factual or legal basis for her claims against my client. We look forward to our day in court to set the record straight.”\n\nAttorneys for Weinstein and the other defendants in the suit could not immediately be reached for comment.\n\nMcGowan says in her lawsuit that at the time of the alleged rape, she was a budding star with lead roles in two Weinstein-produced films and that she finally ended up agreeing to a settlement as she sought to move on with her career.\n\nYears later, however, she says began working on a memoir – published last year – that included details about the alleged abuse and how Weinstein’s conduct toward her and others “poisoned the film and television industry.”\n\nApart from McGowan, Weinstein has been accused of sexually assaulting dozens of other women during his decades in the entertainment industry.\n\nIn 2018, he was arrested in New York on charges of rape and sexual abuse and is awaiting trial.\n\nHe has denied allegations of non-consensual sex.\n\nComments\n\ncomments", "description": "US actress Rose McGowan filed a lawsuit against Harvey Weinstein, alleging he conspired to discredit her when she accused the disgraced movie mogul of rape.", "authors": [], "top_image": "https://arynews.tv/wp-content/uploads/2019/10/Harvey-Weinstein-Rose-McGowan.jpg", "published_at": "2019-10-24"}