{"pub": "breitbart", "url": "https://breitbart.com/clips/2019/10/13/adam-schiff-whistleblower-may-not-testify-in-impeachment-probe", "downloaded_at": "2019-10-14 00:03:02.951419+00:00", "title": "Adam Schiff: Whistleblower May Not Testify in Impeachment Probe", "language": "en", "text": "On Sunday’s broadcast of CBS’s “Face the Nation,” House Intelligence Committee chairman Rep. Adam Schiff (D-CA) said the whistleblower who triggered the impeachment inquiry against President Donald Trump might not testify.\n\nPartial transcript as follows:\n\nSCHIFF: –the- the Republicans would like nothing better because they view their role as defending the president being the president’s lawyers. If witnesses could tailor their testimony to other witnesses. They would love for one witness to be able to hear what another witness says so that they can know what they can give away and what they can’t give away. There’s a reason why investigations and grand jury proceedings for example, and I think this is analogous to a grand jury proceeding, are done out of the public view initially. Now we may very well call some of the same witnesses or all the same witnesses in public hearings as well. But we want to make sure that we meet the needs of the investigation and not give the president or his legal minions the opportunity to tailor their testimony and in some cases fabricate testimony to suit their interests.\n\nBRENNAN: You’ve been- well, the whistleblower has made these complaints and hand them- handed them over. Why push for this whistleblower to come before Congress? Because a- Republicans are calling for it and some Democrats would like to ask questions too but this information’s already out there. Can’t the committee do its own investigation without risking the identity of this person being–\n\nSCHIFF: We can–\n\nBRENNAN: –public?\n\nSCHIFF: You know and I think initially, before the president started threatening the whistleblower, threatening others calling them traitors and spies and suggesting that you know we used to give the death penalty to traitors and spies and maybe we should think about that again. Yes we were interested in having the whistleblower come forward. Our primary–\n\nBRENNAN: Not anymore?\n\nSCHIFF: Well our primary interest right now is making sure that that person is protected. Indeed, now there’s more than one whistleblower, that they are protected. And given that we already have the call record, we don’t need the whistleblower who wasn’t on the call to tell us what took place during the call. We have the best evidence of that. We do want to make sure that we identify other evidence that is pertinent to the withholding of the military support, the effort to cover this up by hiding this in a classified computer system. We want to make sure that we uncover the full details about the conditionality of either the military aid or that meeting with Ukraine’s president. It may not be necessary to take steps that might reveal the whistleblower’s identity to do that. And we’re going to make sure we protect that whistleblower.", "description": "On Sunday's broadcast of CBS's \"Face the Nation,\" House Intelligence Committee chairman Rep. Adam Schiff (D-CA) said the whistleblower who triggered the | Clips", "authors": ["Pam Key"], "top_image": "https://media.breitbart.com/media/2019/10/adam-schiff-mouth-open-eyes-wide-getty-640x335.jpg", "published_at": "2019-10-13"}