{"pub": "townhall", "url": "https://townhall.com/tipsheet/bethbaumann/2019/09/16/trump-the-new-york-times-is-destroying-lives-with-their-fake-news-n2553184", "downloaded_at": "2019-09-16 23:13:22.920316+00:00", "title": "Trump: The New York Times Is 'Destroying Lives' With Their 'Fake News'", "language": "en", "text": "Over the weekend, the New York Times published an excerpt from a new book about Supreme Court Justice Brett Kavanaugh, where he is accused of sexual misconduct similar to the allegations made by Deborah Ramirez during his confirmation hearings. The Times ended up making a correction on Sunday saying exculpatory information was not included in the excerpt. Specifically, the excerpt failed to mention that the female student in question didn't want to be interviewed and her friends said she didn't recall the incident.\n\nDuring a Q&A with reporters, President Donald Trump was asked about the Times' decision to run the excerpt without including that bit of information.\n\n\"Do you think the New York Times should fire the individuals responsible for claiming that [Supreme Court Justice Brett] Kavanaugh committed sexual misconduct without including exculpatory information?\" the Daily Caller's Amber Athey asked Trump.\n\nTrump blasted the news organization, saying they failed to do any kind of fact checking and, as a result, are destroying lives.\n\n\"The New York Times made another terrible mistake. It's a shame that a thing like that can happen. I see that they're making a big correction today. They just announced there's a correction. But to do that about a Supreme Court justice is a terrible thing I think,\" Trump replied. \"I think false accusation, whatever happened with the New York Times, I mean, I can tell you personally, they never check. They never do– we used to have a thing called fact checking. They don't do fact checking anymore. They used to call and say, 'What about this? What about that?'\"\n\n\"How can they do a thing like that and destroy someone's life?\" Trump asked. \"I mean, they're destroying lives and it's fake news, fake news.\"\n\nTrump is right. Kavanaugh's family is having to endure this smear fest again. And why? Because the Times was careless about the book excerpt they published. They cherrypicked the facts and were called out for it. If it wasn't for The Federalist's Mollie Hemingway, it's highly unlikely that the news outlet would have issued a correction.", "description": "Ouch..09/16/2019 19:12:23PM EST.", "authors": ["Beth Baumann", "Matt Vespa", "Guy Benson", "Timothy Meads"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/252/74c68734-8bbe-432b-872c-f478258b9d32.png", "published_at": "2019-09-16"}