{"pub": "washingtonpost", "url": "https://washingtonpost.com/business/2019/10/14/economists-share-nobel-prize-experimental-approach-solving-poverty", "downloaded_at": "2019-10-14 11:29:36.273611+00:00", "title": "3 share Nobel Prize in economics for ‘experimental approach’ to solving poverty", "language": "en", "text": "Talking to the media about an hour after receiving the news, Duflo said: “It was incredibly humbling, to tell you the truth … The three of us stand for hundreds of researchers” who work on global poverty.\n\nThe Nobel committee credits the researchers with breaking down large questions about poverty into smaller research questions, such as the best interventions for improving child health, and using field experiments to solve them.\n\nAD\n\nAD\n\nIn the 1990s, Kremer launched a number of field experiments in western Kenya to improve educational results. Banerjee and Duflo later performed similar studies, building research methods that “now entirely dominate” development economics, according to the Nobel committee.\n\nThose efforts helped inspire school tutoring programs that have benefited more than 5 million Indian children, for instance, as well as preventive health care subsidies in a number of countries, the committee said.\n\n“In just two decades their new experiment-based approach has transformed development economics, which is now a flourishing field of research,” the Nobel Prize committee said on Twitter. Later, in a news release, the panel noted that, “Due to their work, field experiments have become development economists’ standard method when investigating the effects of measures to alleviate poverty.”\n\nAD\n\nAD\n\nThe three laureates were among the first to attempt to measure the real-world effects of poverty-alleviation efforts in a wide range of areas, including access to credit, preventive health care, and the adoption of new technologies.\n\nThe researchers also found that even small differences in prices can lead to dramatically different health outcomes, particularly in preventive care. Kremer, for instance, discovered that 75 percent of poor parents would give their children deworming pills for parasitic infections when the medication was free, compared with 18 percent when the medicine cost less than $1, according to the Royal Swedish Academy of Sciences.\n\nAfter these findings, the committee said, the World Health Organization recommended that medicine be distributed for free to more than 800 million schoolchildren in areas where more than 20 percent have a certain kind of parasitic worm infection.\n\nAD\n\nAD\n\nSimilar efforts by the researchers have suggested that clear incentives and accountability for teachers could reduce absenteeism, finding that “pupils who had teachers on short-term contracts had significantly better test results,” according to a news release by the committee.\n\nThe researchers also conducted an “initial” study on microcredit programs, or the giving of small loans, to poor households in the Indian city of Hyderabad. Additionally, the panel cited their work in showing that some poor individuals were more likely to adopt temporary subsidies — for agriculture improvements such as artificial fertilizer — rather than if they are permanently on offer.\n\nAsked by a reporter what she would do with the winnings, Duflo said she as a child read about how the first female to win a Nobel Prize, Marie Curie, used her money to buy a gram of the element radium.\n\n“I guess we’ll talk between the three of us and figure out what is our gram of radium,” Duflo said.\n\nAD", "description": "The prize was awarded to Abhijit Banerjee and Esther Duflo of MIT, and Michael Kremer, an economist at Harvard.", "authors": ["Jeff Stein", "Economic Policy Reporter"], "top_image": "https://www.washingtonpost.com/resizer/EjIs262c5T0VXjivkCgJLW7xj4Y=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RVZP2WHONMI6TO362IBG5YGBTE.jpg", "published_at": "2019-10-14"}