{"pub": "theverge", "url": "https://theverge.com/2019/10/7/20902807/apple-mac-os-catalina-now-available-download-itunes-sidecar-ipad-apps", "downloaded_at": "2019-10-07 19:56:19.724188+00:00", "title": "Apple’s macOS Catalina update is coming today", "language": "en", "text": "Apple will today release macOS 10.15 Catalina, the latest major update to the company’s Mac operating system. Catalina marks the end of iTunes as a fixture on Macs, with the app now broken into separate apps for Apple Music, Podcasts, and Apple TV. Everything iTunes did should be available across these new, streamlined apps. Device syncing for iPhones and iPads has been moved to the Finder.\n\nThe new release also introduces support for iPad apps on macOS through what Apple calls Project Catalyst, which could kick off a wave of software coming over from Apple’s tablets to its desktop and laptop computers.\n\nSpeaking of the iPad, Catalina also includes a new Sidecar feature, which allows iPads to be used as secondary displays for your Mac — both wirelessly and when plugged in. Sidecar supports the Apple Pencil, letting you work in the Mac versions of apps like Photoshop while using the stylus. You can also annotate screenshots or PDFs with the Pencil.\n\nOther new additions include the debut of Screen Time on macOS and stricter privacy protections: apps must now ask for permission to access your desktop, documents, iCloud Drive, and external storage. One of my favorite small things in Catalina is Activation Lock. Now, any Macs that have a T2 security chip cannot be erased and reactivated without your Apple ID password. Here’s hoping Activation Lock on Mac becomes the same sort of theft deterrent it has for the iPhone.\n\nThe macOS 10.15 Catalina update is a free download, and it can be installed by clicking on the Apple icon in the upper left corner of your screen, choosing system preferences, and then selecting software update. If you use Apple’s Reminders app a lot, you’ll want to upgrade quickly to ensure everything is properly in sync between iOS 13 and Catalina.", "description": "Apple has begun rolling out macOS 10.15 Catalina, the latest major update to the company’s Mac operating system. Catalina marks the end of iTunes as a fixture on Macs, with the app now broken into separate apps for Apple Music, Podcasts, and Apple TV.", "authors": ["Chris Welch", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/n3hebo8x4YikiWcCSNZ9liZ5_rI=/0x99:2614x1468/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19266656/Screen_Shot_2019_10_07_at_10.49.25_AM.png", "published_at": "2019-10-07"}