{"pub": "guardian", "url": "https://theguardian.com/politics/2019/oct/13/eu-ready-to-grant-brexit-extension-as-johnson-prepares-for-key-summit", "downloaded_at": "2019-10-13 18:36:55.393597+00:00", "title": "EU ready to grant Brexit extension in build-up to key summit", "language": "en", "text": "Jean-Claude Juncker has talked up the prospects of a Brexit extension beyond 31 October as EU officials downplayed the chances of a breakthrough in time for this week’s crunch summit.\n\nAs talks on Johnson’s latest Brexit proposals continued in Brussels, the European commission president said he would back a prolongation of the UK’s membership if it was sought.\n\n“It’s up to the Brits to decide if they will ask for an extension,” Juncker told the Austrian newspaper the Kurier on Sunday. “But if Boris Johnson were to ask for extra time – which probably he won’t – I would consider it unhistoric to refuse such a request.”\n\nJohnson updated his cabinet on Sunday lunchtime about the state of play in negotiations with Brussels before a make-or-break week for his premiership.\n\nQuick guide Why is the Irish border a stumbling block for Brexit? Show Hide Counties and customs Inside the EU, both Ireland and Northern Ireland are part of the single market and customs union so share the same regulations and standards, allowing a soft or invisible border between the two.\n\nBritain’s exit from the EU – taking Northern Ireland with it – risks a return to a hard or policed border. The only way to avoid this post-Brexit is for regulations on both sides to remain more or less the same in key areas including food, animal welfare, medicines and product safety. The 'backstop' in Theresa May's Withdrawal Agreement was intended to address this - stating that if no future trade agreement could be reached between the EU and the UK, then rules and regulations would stay as they are. This has been rejected by Brexit supporters as a 'trap' to keep the UK in the EU's customs union, which would prevent the UK striking its own independent trade deals. There are an estimated 72m road vehicle crossings a year between Northern Ireland and the Republic of Ireland, and about 14% of those crossings are consignments of goods, some of which may cross the border several times before they reach a consumer. Brexit supporters say this can be managed by doing checks on goods away from the border, but critics say it will be difficult to police this without any physical infrastructure like border posts or cameras, which could raise tensions in the divided communities of Ireland. Interactive: A typical hour in the life of the Irish border Photograph: Design Pics Inc/Design Pics RF\n\nThe prime minister is still hoping to make enough progress at a European council meeting on Thursday to be able to hold a Commons vote on his Brexit plans in a rare Saturday sitting next weekend.\n\nAfter presenting what aides called a “final offer” to the EU27 in his party conference speech less than a fortnight ago, Johnson signalled to Dublin that he was ready to make significant concessions on the future status of Northern Ireland.\n\nSince Johnson and the Irish taoiseach met on the Wirral last Thursday, officials have been working on an agreement that would in effect keep Northern Ireland in the UK’s customs territory but apply EU tariff rates at its external border.\n\nThe proposal appears similar to Theresa May’s “new customs partnership”, but for Northern Ireland alone rather than the whole UK.\n\nA dozen British officials led by Johnson’s chief negotiator, David Frost, were in talks with the European commission’s Brexit taskforce on Sunday but sources in Brussels downplayed the possibility of a major breakthrough.\n\n“A Northern Ireland-only backstop as proposed by the EU in February 2018 could be landed by the European council on Thursday – anything else will not,” said one diplomatic source.\n\nEU officials have privately warned that at best a “technical extension” taking the UK’s membership of the bloc beyond 31 October will be necessary to work through the details of Johnson’s new approach to the issue of customs.\n\nSpeaking on Sunday, Ireland's agriculture minister Michael Creed, a senior member of Varadkar’s cabinet, said: There are very significant issues to be addressed here. We are not there yet.”\n\nBrexit is expected to be high on the agenda when the French president, Emmanuel Macron, hosts the German chancellor, Angela Merkel, at a dinner at the Élysée Palace on Sunday evening.\n\nMay’s customs plan was vehemently rejected by Brexiters as impractical. Jacob Rees-Mogg, the then chair of the hardline European Research Group of Tory MPs, described it as “completely cretinous, impractical, bureaucratic and a betrayal of common sense”.\n\nBut Rees-Mogg, who is now leader of the House of Commons, made clear on Sunday he and other leavers were prepared to compromise.\n\n“Boris Johnson is … somebody who even the most arch-Eurosceptic, even a member of the Brexit party, can trust and have confidence in,” he said.\n\nAsked by Sophy Ridge on Sky News if he might have to eat his words on the idea of a customs partnership, Rees-Mogg added: “I don’t know but there’s a line from Churchill saying he’d often had to eat his own words and he found it a very nourishing diet. That is something that happens in politics but it is ultimately a question of trust and about the direction in which we are going.”\n\nNevertheless, government insiders remain cautious about the likelihood of securing an agreement that could be put to the Commons on Saturday – and winning a majority for it.\n\nOne pointed out that Theresa May’s government believed it would win MPs’ support for her deal, when it was put to the Commons for a third time in March – but it was rejected, by a majority of 58.", "description": "Boris Johnson faces crunch week as Brussels downplays chance of progress on Ireland", "authors": ["Heather Stewart", "Daniel Boffey"], "top_image": "https://i.guim.co.uk/img/media/c056718240807049847138986c09a57c350f53ea/0_233_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a56ce405b2e9217549ebf8b870739cb9", "published_at": "2019-10-13"}