{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/5/4k-ultra-hd-reviews-rambo-and-lock", "downloaded_at": "2019-09-06 12:10:48.097924+00:00", "title": "4K Ultra HD reviews: 'Rambo' and 'Lock Up'", "language": "en", "text": "Here’s a look at a pair of classic Sylvester Stallone movies debuting in ultra-high definition.\n\nLock Up (Lionsgate Home Entertainment, rated R, 181 minutes, 1.85:1 aspect ratio, $22.99) — Let’s start with a younger Stallone from 1989 playing mechanic Frank Leone, a prisoner that suffers the payback of an evil administrator only to triumph by sheer determination and compassion.\n\nWith six months until his release at a minimum-security facility, Mr. Leone is transferred in the dead of night and forced to serve hard time at the maximum-security Gateway Prison while Warden Drumgoole (Donald Sutherland at his most vile) makes his life hell.\n\nMr. Stallone has got the best hair in the joint as he faces off against sadistic prison guards and prisoners with grudges, survives a brutal inmate football game, endures solitary confinement and fixes a stubborn 1965 Mustang engine.\n\nDirector John Flynn’s vintage 1980s thriller, complete with a end credits song by “Survivor,” is sort of watching Rocky in the big house and falls between “Cobra” and “Get Carter” in Mr. Stallone’s career highlights.\n\nPop culture movie fans will appreciate appearances by Sonny Landham (Billy Sole in “Predator”) as prison thug Chink Weber and Tom Sizemore (Technical Sgt. Mike Horvath in “Saving Private Ryan”) as prisoner Dallas.\n\nThe 2160p upgrade to the full-screen presentation of a 30-year-old film is special right from the start while watching Mr. Leone admire a collection of old photos and picture frames in a crisp, nearly grain-free visual presentation.\n\nHigh dynamic range tweaks highlight the sickly yellow-green halls of the prison with the occasional blasts of steam or dust in sunlight to add to the facility’s hell-like qualities.\n\nColor also pops when in the prison car shop with orangish-red welding sparks flying, bright red tool chests and a gorgeous restoration of the red pony Ford Mustang.\n\nBest extras: The 4K disc contains all of the bonus content from the 2010 Blu-ray release including two behind-the-scenes featurettes and separate interviews (roughly 2 minutes each) with Mr. Stallone, Mr. Sutherland, Mr. Landham, John Amos (who plays a prison guard) and Darlanne Fluegel (Frank’s wife Melissa).\n\nRambo (Lionsgate Home Entertainment, rated R, 99 minutes, 2.39:1 aspect ratio, $22.99). Now let’s jump to 2008 as Mr. Stallone’s iconic character John Rambo returned to theaters to wreak havoc amid a civil war in Southeast Asia.\n\nTwenty years after his adventures in Afghanistan, the disenchanted warrior lives in Thailand and is called out of retirement to save a group of egotistical Christian missionaries trying to spread the faith but taken prisoner by a sadistic Myanmar army commander.\n\nAfter Rambo delivers a group of mercenaries to attempt a failed rescue, he almost single-handedly wipes out the bad guy and his battalion to save the day in such excessive and brutal violence and gore, it’s often hard to look at the screen.\n\nViewers get two versions of “Rambo” that was directed and written by Mr. Stallone. The 4K disc offers the theatrical release and an extended cut that adds about 8 minutes more to flesh out character development but no extra gore.\n\nThe UHD translation shines with upticks to both clarity and bursts of color yet maintains a certain level of grain expected with the grizzled subject matter.\n\nThat translates to some beautiful panoramic looks at the Myanmar hazy countryside as well as crisp, blue-hued nighttime scenes in the rain with a sweaty, dripping Rambo on a rampage.\n\nAlso, viewers will admire streaks of a setting sun reflected from a still river or some black-and-white flashbacks of Rambo’s life that pop with detail and visually contrast the color scenes.\n\nUnfortunately, that clarity and high dynamic range enhancements also carries over to the visceral violence highlighting blood sprays and human bodies being torn apart by explosions and a large machine gun.\n\nBest extras: The 4K disc offers almost all of the extras found in previous 2008 and 2010 releases.\n\nFirst, listen to a required, solo optional commentary track on the theatrical version of the film with Mr. Stallone. He is bursting with information of the production, and the action hero shines as an intelligent human who knows filmmaking and his subject matter.\n\nNext, an unfettered and honest 90-minute video production diary covering tidbits of almost each day of the 42-day shoot mostly narrated by Mr. Stallone. The director discusses the challenges of the shoot, justifies the violence level and explains some of the history of Myanmar. The diary is one of most thorough I have ever watched.\n\nThe extras also include another 70 minutes of featurettes that cover the production, music, weaponry and the effort to bring Rambo back to the big screen.\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Here's a look at a pair of classic Sylvester Stallone movies -- 'Rambo' and 'Lock Up' -- debuting in ultra-high definition.", "authors": ["The Washington Times Http", "Joseph Szadkowski"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/05/lock-up-rambo_c1-0-899-524_s1770x1032.jpg?bd8c3b18bf52531a96c8cc0aa94d0e6c7d3d483d", "published_at": "2019-09-05"}