{"pub": "reuters", "url": "https://ca.reuters.com/article/businessNews/idCAKBN1WI0YG-OCABS", "downloaded_at": "2019-10-03 10:53:38.131130+00:00", "published_at": "2019-10-03", "title": "Axon boosts encryption, weighs blockchain to tackle body-cam 'deepfakes'", "language": "en", "text": "SAN FRANCISCO (Reuters) - Axon Enterprise Inc, the leading maker of U.S. police body cameras, began shipping new devices last week with security upgrades it says could aid in thwarting and discrediting “deepfake” videos.\n\nFILE PHOTO: The headquarters for Axon Enterprise Inc, formerly Taser International, is seen in Scottsdale, Aizona, U.S., May 17, 2017. REUTERS/Ricardo Arduengo\n\nThe rollout of Axon’s Body 3 camera and its research into data tracking technologies, including blockchain, gives a glimpse into how the camera maker is stepping up in response to lawmaker and public concerns about video tampering.\n\nGrowing access to software for creating deepfakes, or synthetic videos that people struggle to distinguish as made up, has prompted lawmakers to demand high-tech solutions to separate fact from fiction, especially in high-stakes situations in politics and criminal justice.\n\n“Axon recognizes the threat posed by ‘deepfakes’ to cause general mistrust in the integrity of any video, including body-worn camera videos,” the company said in a recent statement to Reuters in response to questions about its technology.\n\nBody-cam video has emerged as crucial evidence of alleged police misconduct, prompting changes in law enforcement tactics globally. Civil liberties groups and defense lawyers have questioned the integrity of some police videos, citing noticeable edits to shorten a scene or adjust a timestamp.\n\nAxon’s Body 3 camera introduces additional security by rendering captured footage inaccessible for playback, download or edit by default without a form of authentication such as a password. The company said it overcame battery life and convenience issues that prevented encryption from being standard earlier.\n\nOther new features include attaching a secure digital signature to videos to help track their provenance. The company declined to elaborate on the measures, saying it needed to protect its intellectual property.\n\nStill, its secrecy about how security features work has drawn frustration from some security researchers who want Axon and other hardware companies to jointly develop public authentication standards.\n\nOn Wednesday, United States Senators Mark Warner, a Democrat, and Marco Rubio, a Republican, said “the threat of deepfakes is real” in letters to YouTube, Facebook and nine other online service providers. The senators also urged the industry to form common strategies to authenticate videos.\n\nShamir Allibhai, chief of executive of Amber, a startup using blockchain to mark smartphone clips as real, said open standards are necessary so that “any party can have unequivocal confidence in and be able to independently verify the veracity” of videos.\n\nAxon declined to answer questions about standardization efforts, adding that it is researching the potential of newer technologies. Those include more secure watermarks on videos and blockchain, which is a nascent digital storage system that spreads content across many computers to reduce the potential for secret edits.\n\nThe havoc manipulated video can create was seen this year with a viral “cheapfake” of House Speaker Nancy Pelosi that was manually slowed down to make her speech seem slurred.\n\nTwo New York criminal defense attorneys challenging evidence from body cameras said although they have not seen any Pelosi-style exploitation yet, they have recently demanded data in several cases from Axon’s current system for tracking video from camera to courtroom to identify possible tampering.\n\nCynthia Conti-Cook, who oversees the Cop Accountability Project at New York’s Legal Aid Society, said that “we’re just starting to articulate what we want and why it’s important to our cases.”", "description": "Axon Enterprise Inc, the leading maker of U.S. police body cameras, began shipping new devices last week with security upgrades it says could aid in thwarting and discrediting \"deepfake\" videos.", "authors": ["Paresh Dave", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191003&t=2&i=1436600845&w=1200&r=LYNXMPEF920QU-OCABS"}