{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201910238857/texas-instruments-blames-trade-tensions-for-disappointing-forecast-chip-makers-fall", "downloaded_at": "2019-10-23 16:35:40.609343+00:00", "title": "Texas Instruments Blames Trade Tensions for Disappointing Forecast, Chip Makers Fall", "language": "en", "text": "By Maria Armental\n\nTexas Instruments Inc. (TXN) blamed jitters around U.S.-China trade tensions for largely disappointing third-quarter results, projecting more challenges in the current quarter.\n\nThe Dallas-based chipmaker, often seen as a bellwether in the sector because of its broad base of customers and range of products, on Tuesday said it expects fourth-quarter profit to fall to a range of 91 cents to $1.09 a share on $3.07 billion to $3.33 billion in revenue, well short of analysts' projected $1.28 a share in profit and $3.57 billion in revenue, according to FactSet.\n\n\"We are at the very end of a long supply chain,\" Chief Financial Officer Rafael Lizardi said in a conference call with analysts. \"And when the ones at the very front pull back, it becomes a traffic jam.\"\n\nMr. Lizardi said the challenges are widespread from what the company has seen. \"But we'll see what other companies will report over time and we'll get a clearer picture,\" he said.\n\nCascend analyst Eric Ross said in a note published Wednesday that his data suggests the poor December-quarter guidance is more a TI-specific issue--losing share in microcontrollers and communications-- rather than an industry issue.\n\n\"This is not our 'opinion' -- this is what we see in the data, and what other companies are saying,\" Mr. Ross wrote, noting that some industry data suggest a recovery is under way.\n\nTI shares, which have been trading near record levels, fell 7% to $119.96 Wednesday, pulling down other chip makers, including Nvidia Corp. (NVDA), Micron Technology Inc. (MU), Intel Corp. (INTC) and Advanced Micro Devices Inc. (AMD).\n\nWednesday's $8.61 decline is on track for the second largest one-day decline on record.\n\nFounded in 1930 as an oil-and-gas company, Texas Instruments took its current name in the 1950s as it shifted into the burgeoning semiconductor business. Today, it is one of the world's largest chip companies.\n\nTI's third-quarter profit fell 9% to $1.43 billion, or $1.49 a share, at the high-end of the company's forecast and ahead of the consensus estimate. But revenue missed Wall Street expectations, falling to $3.77 billion, an 11.5% decline from the comparable period last year.\n\nIt was TI's fourth consecutive quarter of falling revenue since the current semiconductor downcycle began, and the largest percentage decline. And company officials warned it would take time, given the added weight of the trade dispute.\n\n\"Customers are just far more cautious than they were certainly a year ago, but even 90 days ago,\" Mr. Lizardi said, noting many of those customers referred to the trade tensions.\n\nCompany officials said the weakness in the third quarter was broad-based but hit particularly hard automotive and communications, driving a 19% revenue decline in embedded processing, the \"brains\" of many types of electronic equipment.\n\nCredit Suisse analyst John Pitzer said the segment's performance seemed \"demonstrably worse\" than peers and, assuming another sequential decline in the December quarter, more pronounced than in the financial crisis \"when financial markets weren't working properly and companies couldn't actually get funding for inventory.\"\n\nWrite to Maria Armental at maria.armental@wsj.com\n\n(END) Dow Jones Newswires\n\nOctober 23, 2019 12:05 ET (16:05 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-10-23"}