{"pub": "metro", "url": "https://metro.co.uk/2019/10/19/circles-woody-admits-parents-zoe-ball-fatboy-slim-didnt-want-show-10946813", "downloaded_at": "2019-10-19 12:32:23.576833+00:00", "title": "The Circle's Woody admits parents didn't want him on the show", "language": "en", "text": "The star wanted to see what life was like without his famous parents (Picture: Channel 4, Getty)\n\nWoody Cook may not have won The Circle but he’s still classing it as a win – after proving his parents Zoe Ball and Norman Cook wrong.\n\nThe 18-year-old came in fifth in The Circle finale, with Paddy Smyth emerging victorious in a shock win after three weeks in the game of popularity.\n\nWith presenter mum Zoe beaming from the audience, it turns out that initially, the family were dead against their son taking part on the show, and needed some serious talking round.\n\nSpeaking exclusively to Metro.co.uk about it, Woody said: ‘They were like “we spent your whole life hiding you from the tabloids and everything like that, and you’re just willing to throw yourself out there, what are you doing?\n\n“We spent the whole time trying to keep yourself under wraps and you’re just about to throw yourself out there, for a reality show?”\n\nAdvertisement\n\nAdvertisement\n\n‘I was like, trust that it’s not as bad as you think, and my mum knew some of the people who had worked on it last year, and they asked them, and they were like “no it’s actually a really nice show.”’\n\nZoe was there to cheer him on at the finale despite her initial doubts (Picture: PA)\n\nThankfully it paid off, and viewers fell in love with the happy-go-lucky ‘positive vibes at all times’ student who turned detective in a bid to seek out the catfish among the players (with an actually quite impressive success rate.)\n\nIn fact, on the penultimate day in the game, Zoe and Norman Cook – aka DJ Fatboy Slim – appeared in a video together with daughter Nelly to praise him for a job well done.\n\n‘When they sent me that video that went “we were..wr…wr…wrooong!” I was like Yes! You were wrong, weren’t you?,’ Woody laughed.\n\nWoody came in fifh as Paddy Smyth took home the players prize (Picture: PA)\n\n‘Just hearing that, was one of the first times I’d ever heard that in my life. I was so “I told you guys!” and now I’m really happy.\n\n‘It was quite a monumental win. The nation decided I was meant to be on the show and i was just sitting there going “teeheehee”.’\n\nDespite everyone on the series gunning for a potential £100k prize packet at the end of their time on the show, Woody said he’s ultimately glad he didn’t get it.\n\nTo view this video please enable JavaScript, and consider upgrading to a web browser that supports HTML5 video\n\nAs the Players’ winner, Paddy took home £70,000, with theology scholar Tim Wilson, who had formed a tight bond with Woody, taking home the other £30,000 as the Viewers’ champion.\n\nAdvertisement\n\nAdvertisement\n\n‘I think I would’ve felt guilty if I won, because I feel like there were people who definitely, concerning their situations and everything, I come from a family with a bit of cash, and if I won the cash, I don’t know, it just doesn’t mean as much as to someone else who’s actually worked quite hard to win,’ Woody added.\n\nMore: Zoe Ball Zoe Ball is all of us as she reacts to seeing Woody flirt with Richard Madeley The Circle's Woody finally comes clean about his dad being Fatboy Slim Strictly Come Dancing's Rylan Clark-Neal addresses It Takes Two 'bust-up' with Zoe Ball\n\n‘There was one bit where I was like “oh they schemed against me, I’m gutted”, but then at the same time it was like “you know what, i never actually properly wanted to win”.’\n\n‘In the final I realised it was more about that I got to interact with so many people,’ he said. ‘And that’s the real prize.’\n\nThe Circle is available now on Channel 4’s streaming service 4OD.\n\nGot a showbiz story? If you've got a story, video or pictures get in touch with the Metro.co.uk Entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page - we'd love to hear from you.\n\nMORE: Paddy Smyth crowned winner of The Circle 2019 in shock result as contestants meet catfish ‘Sammie’\n\nMORE: What does the winner of The Circle get and how are they decided?\n\nAdvertisement", "description": "Zoe Ball and Fatboy Slim, aka Norman Cook, worried about their son taking part on The Circle, but his charm placed him fifth in the final.", "authors": ["Tilly Pearce"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90613821_1571486721.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-19"}