{"pub": "cbc", "url": "https://cbc.ca/radio/thehouse/how-the-parties-deal-with-fizzles-and-flops-on-the-campaign-trail-1.5282838", "downloaded_at": "2019-09-14 11:16:50.529659+00:00", "title": "CBC Radio", "language": "en", "text": "Although each federal leader set out on Day 1 of the campaign with a specific message in mind, even the best-laid plans can wither in the election cycle.\n\nAnd that's what happened this week, a trio people with extensive experience in campaign management and political messaging told The House.\n\n\"I don't think any party had a really clean launch,\" said Yaroslav Baran, who has worked for the Conservatives.\n\nAccording to Baran, Liberal Leader Justin Trudeau was on the defensive over the SNC-Lavalin affair, which Conservative Leader Andrew Scheer chose to hammer away at, instead of framing his own party's ballot issue.\n\nAs for the New Democrats, the party was \"kind of lost in the shuffle\" and was reeling from some candidate controversies.\n\nOn the very first day of the federal election campaign Justin Trudeau was confronted with a report that the RCMP was looking into possible obstruction of justice around the SNC Lavalin affair. How do campaigns deal with crises during the election? Chris Hall asks former campaign directors Scott Reid, Marcella Munro and Yaroslav Baran. 9:25\n\nAlthough she agreed with that assessment, Marcella Munro, who has worked on NDP campaigns, said NDP Leader Jagmeet Singh's campaign wasn't off to a bad start.\n\n\"They have such low expectations right now, it's pretty hard to get beneath that. They have a significant problem dealing with the Green vote,\" Munro said.\n\nWhether these hiccups in the early days of the campaign will ultimately add up to trouble for any of the leaders remains unclear.\n\n\"I think Canadians can be forgiven for not knowing there's a campaign,\" said Scott Reid, who has experience working on Liberal campaigns.\n\n\"We're still on the,'It's OK to go to the fridge and get a beer' part of this game and it's going to get more interesting from here on in.\"\n\nHassan Guillet was turfed by the Liberals for past comments. (CBC)\n\nQuestionable candidates throw off campaign messaging, strategists say\n\nTwo political strategists say candidates getting booted for racist or homophobic remarks throw campaigns off message.\n\nEach of the political parties has had to drop candidates for a number of reasons so far this election season.\n\nHassan Guillet, a Liberal candidate, was accused of making anti-Semitic remarks. The NDP's Dock Currie allegedly made aggressive comments to pipeline activists. The Conservative's Cameron Ogilvie stepped down over social media posts. And the Greens kicked out Erik Schomann after an Islamaphobic post came to light.\n\nConservative strategist Jenni Byrne and Liberal strategist Rob Silver both said it's part of the risk when you've got at least 338 social media profiles to parse through.\n\n\"There is no perfect process,\" Silver, who is married to a top Trudeau aide, told The House.\n\n\"You can spend an infinite amount of time and an infinite amount of resources and things will slip through the cracks.\"\n\nIn the opening days of the election every party lost at least one candidate because of past indiscretions coming to light. In the age of social media and active third parties how do political parties ensure candidates can withstand the intense scrutiny? Chris Hall talks candidate vetting with former Conservative campaign director Jenni Byrne and longtime Liberal strategist Rob Silver. 7:12\n\nEach day of the campaign the leaders have a set message to communicate, the two explained. Bad apples in the bunch may not throw off the whole campaign, but any day your messaging is being overtaken by scandal is a losing day on the campaign.\n\nByrne said social media has been a game-changer, making it easier for candidates to hide questionable conduct.\n\nSilver agreed but added it can also work against them, saying \"now everybody is a war room. Everybody can do research.\"\n\nBack on Byrne's first national campaign in 2000, the landscape was much different.\n\n\"It was a standard credit check, a criminal background check and a quick Yahoo search at the time,\" she said.\n\nAnd while the bar for kicking someone out of candidacy can vary, Byrne said racism is a line you can't cross.\n\n\"Those are just places where no party is going to defend candidates.\"\n\nUnpacking the first days of the campaign\n\nGreen Party Leader Elizabeth May, left, Conservative Leader Andrew Scheer, centre, and NDP Leader Jagmeet Singh take part during the Maclean's/Citytv National Leaders Debate in Toronto. (Frank Gunn/The Canadian Press)\n\nIt's a safe bet to say the first few days of campaign 2019 didn't unfold exactly as planned.\n\nFog delayed the arrival of Conservative leader Andrew Scheer at his first campaign stop in Trois Rivieres, Que., Green leader Elizabeth May and NDP leader Jagmeet Singh each lost a candidate and Justin Trudeau ran head on into more questions about SNC-Lavalin.\n\nHow did the parties fare in the election kickoff? And what tone did it set for the next five weeks?\n\nVassy Kapelos, host of Power and Politics, and Joel Denis Bellavance, parliamentary bureau chief for La Presse, join Chris Hall for a chat.", "description": "This week on The House: How do the parties deal with crisis during the campaign? And why do candidates with questionable pasts often slip past vetters? We ask strategists from the parties. We examine the broken promise of electoral reform and hear from our In House panel about the federal leaders' debate.", "authors": ["Cbc Radio"], "top_image": "https://i.cbc.ca/1.5280490.1568264423!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/fedelxn-liberals-20190911.jpg", "published_at": "2019-09-14"}