{"pub": "npr", "url": "https://npr.org/sections/health-shots/2016/09/21/494887467/how-a-sixth-sense-helps-simone-biles-fly-and-the-rest-of-us-walk", "downloaded_at": "2019-10-13 23:33:40.489923+00:00", "title": "How A 'Sixth Sense' Helps Simone Biles Fly, And The Rest Of Us Walk", "language": "en", "text": "How A 'Sixth Sense' Helps Simone Biles Fly, And The Rest Of Us Walk\n\nEnlarge this image toggle caption Dmitri Lovetsky/AP Dmitri Lovetsky/AP\n\nA rare genetic disorder is helping scientists understand our mysterious ability to sense where we are in space, known as proprioception.\n\nThis \"sixth sense\" is what dancers and gymnasts rely on to tell them the exact position of their body and limbs at every moment. It also tells them how much force each muscle is exerting.\n\n\"The most beautiful demonstration of proprioception in action is Simone Biles when she is spinning and somersaulting through the air,\" says Carsten Bonnemann, a pediatrician and geneticist at the National institute of Neurological Disorders and Stroke.\n\nScientists have known about proprioception for more than a century. But they didn't realize how much people depend on it until they got a chance to study two young patients with a rare genetic disorder that leaves them completely lacking this sense.\n\nThe results of that study were published Wednesday in the New England Journal of Medicine.\n\nOne of the participants in the study was a 10-year-old girl named Damiana, who lives in San Diego.\n\nShe's \"a happy and bubbly\" kid who has no problems with senses like taste, hearing, sight and smell, Bonnemann says. But Damiana was born with a genetic mutation that left her with a limited sense of touch and no proprioception, he says.\n\nWhen Damiana was younger, her condition baffled doctors, says her mother, Diana Sawyer.\n\n\"She was very late at doing everything,\" Sawyer says. Her daughter didn't start crawling until she was about 18 months old. And she still can walk only a few steps on her own.\n\nDamiana was born with some abnormalities in her feet and hips, Sawyer says. And her spine was curved. But those problems didn't explain why her daughter had so much trouble with precise movements, like fastening a button.\n\nDamiana's condition might have remained a mystery if Bonnemann hadn't seen her a few years ago while holding a clinic in San Diego.\n\nHe was puzzled by her symptoms and ordered a state-of-the-art genetic analysis. It turned up a mutation in a gene called PIEZO2, which allows certain cells to detect mechanical pressure.\n\nUnfortunately, \"I didn't know what PIEZO2 was, really,\" Bonnemann says.\n\nThen one day Bonnemann heard about a colleague at the National Institutes of Health who knew a lot about PIEZO2. \"It turns out he's in the same building, just a floor down,\" Bonnemann says. \"So I sent him an email saying, 'Can you help me?' \"\n\nThe colleague was Alex Chesler from the National Center for Complementary and Integrative Health. Chesler read the email from Bonnemann, \"and 30 seconds later I was up in his office,\" he says.\n\nChesler had spent years studying PIEZO2 in mice. But he'd never had a good way to study its function in people.\n\nSo last year, Bonnemann, Chesler and a team of researchers invited Damiana and another patient with a similar PIEZO2 mutation to the NIH.\n\nThe visit was a revelation. Trying to understand proprioception from mouse experiments had been a bit like trying to understand Beethoven by reading sheet music, Chesler says. \"But when I talked to the patients it was like going to the symphony,\" he says.\n\nThe researchers were able to show that the PIEZO2 gene is involved in certain kinds of touch sensation as well as proprioception. And they learned a lot about what proprioception makes possible by studying what the patients were unable to do.\n\n\"They've never run, they've never jumped,\" Chesler says, \"because those kind of actions really require precise control over your limbs in space.\"\n\nThe scientists also discovered that both patients had found ways to compensate for their lack of body awareness — mostly by closely watching their own limbs as they move.\n\nFor example, the older patient, who is in college, has even learned to walk pretty well — as long as she can see what's she's doing.\n\n\"If you take away her vision, she literally crumples to the ground,\" he says. \"And the same is true for reaching. When she reaches for an object under visual control she is actually quite precise doing that. If we cover her eyes, she gets completely off target.\"\n\nOf course, gymnasts like Simone Biles also rely on vision during a routine, Bonnemann says. But it's the extra information from their \"sixth sense\" that makes a gold-medal performance possible.", "description": "Scientists are finally beginning to understand proprioception, a sense that tells us where our body is in space. Much of what they've learned comes from two girls with a rare genetic disorder.", "authors": ["Jon Hamilton"], "top_image": "https://media.npr.org/assets/img/2016/09/21/simone-biles_wide-eb9dcda909dfe99d9dddc4c9bfdb294408bffd6d.jpg?s=1400", "published_at": "2016-09-21"}