{"pub": "theverge", "url": "https://theverge.com/2019/10/4/20899422/joker-movie-review-todd-phillips-joaquin-phoenix-incel-violence-dc-comics-batman", "downloaded_at": "2019-10-05 13:04:21.341376+00:00", "title": "Love it or hate it, the Joker movie presents a tempting fantasy", "language": "en", "text": "Todd Phillips’ standalone supervillain origin story Joker is arriving in theaters amid so much controversy and concern about the potential for copycat violence that the debate has largely overwhelmed the film itself. It’s been fascinating to watch the discussion around the movie shift from “Do we really need another Joker story so soon after Suicide Squad?” to “Is Joker full of dangerous ideas that will spur its worst fans to murder?” The initial worries around Joker assumed the movie would be unnecessary, its impact negligible. The current questions ascribe it with too much importance, as if it might incite full-blown anarchy just by existing.\n\nAs usual in a case where people leap to extremes, the truth is somewhere in the middle. Joker may make some people who feel marginalized feel more seen and more powerful, and they may act out in response. There are some ugly, self-serving messages in the movie, which is incongruously bent on creating sympathy for Batman’s worst enemy and one of DC Comics’ most notoriously callous mass murderers and atrocity architects. But love it or hate it, the film does spin up a tempting fantasy of persecution and relief, of embracing nihilism as a means of complete escape from a terrible world.\n\nIt’s a self-pitying fantasy, certainly. Phillips and co-writer Scott Silver follow in the footsteps of Joel Schumacher’s 1993 drama Falling Down in portraying the world as a cartoonishly dark and uncaring place, an almost comically vile carnival where the protagonist can’t find a hint of comfort or relief. In a thoroughly immersed performance that’s being seen as a guaranteed awards-season attention magnet, Joaquin Phoenix plays Arthur Fleck, a part-time rent-a-clown working for a seedy talent agency full of exaggerated grotesques. Arthur is mentally ill and coping via meds and court-ordered therapy, which don’t offer comfort or represent caring. He’s devoted to his sick mother Penny (Frances Conroy), who’s encouraged him to see himself as a joyous light in the world, bringing laughter to the people.\n\nThe problem is that he isn’t particularly funny. He’s painfully awkward, the kind of twitchy, social incompetence people shy away from in public because his erratic behavior feels like it could turn dangerous — or at least uncomfortable for them. It’s easy for viewers to empathize with his desire to be loved, without necessarily loving him. When he says he feels invisible, it’s clear why: he’s the kind of person people look away from on the street, out of apathy or active discomfort.\n\nThat tension between sympathy and revulsion is one of the most honest things about Joker, which mostly goes out of its way to make the world awful. While working as a sign-twirler, Arthur is randomly beaten by a handful of kids, who steal his sign and then break it over his head. His boss not only doesn’t believe his story, he demands Arthur pay for the missing sign. The dramatic ironies and injustices compound throughout the film, until it’s clear that Arthur isn’t paranoid, the world really is out to get him. And then he takes violent, irrevocable action.\n\nFor much of its runtime, Joker is a consciously ugly film, visually and emotionally. Arthur starts with close to nothing, and loses it all incrementally, in ways designed to hurt empathetic viewers. Phillips and cinematographer Lawrence Sher (who also DP’d for all three of Phillips’ Hangover movies) give the film a sickeningly grungy, underlit, David Fincher-esque look, especially in Arthur’s squalid home. Everything about the storytelling — the ominous, booming score; the gritty darkness; the invasive sound design — is designed to be oppressive, and to push the audience toward Arthur’s point of view as the primary victim of all the oppression. It’s hypnotic just how horrifying Arthur’s existence is, just as Phoenix’s performance is hypnotic as he spirals from fragile hope into increasingly outsized and confident acts of destruction.\n\nAnd then he escapes it all, by learning not to care — not about how or whether other people see him, not about whether he hurts or frightens or kills them, not about whether his final-act manifesto makes any sort of coherent sense. The important part of Arthur’s story — and the cause for so much of the concern around Joker — is that when he embraces his most nihilistic and destructive impulses, he suddenly earns the praise and attention he’s been lacking. That may not fully motivate him, but it’s meant as a message for the segment of the audience that feels closest to Arthur, those who feel most unseen and unloved: plenty of people agree with you that the world is unfair and ugly, and if you did something about it, they’d back your play.\n\nLike Falling Down — and Martin Scorsese’s Taxi Driver, which Phillips openly emulates and references — Joker suggests that when the leading man loses his mind, it’s an understandable, even natural reaction to an equally mad world. Viewers who aren’t already inclined to see humanity as a seething cesspit may not resonate with that level of cynicism. But to viewers who feel as abused and overlooked as Arthur Fleck, or even who harbor smaller, more rational resentments about society, Joker is a deliberate and fine-tuned provocation and promise: you aren’t alone, the people you hate really are awful, and it would be okay to act against them in any way you want.\n\nPhillips has made it clear that he doesn’t believe Joker is anything as small and dismissible as a mere comic-book movie. But while his film is grimmer and more harrowing than anything in the Marvel Cinematic Universe, it’s offering up a fantasy just as clearly as any superhero wish-fulfillment power trip: the fantasy of being a hero to some, of going from powerlessness to power, of being feared and beloved at the same time. Phillips delivers that message in a self-congratulatory way, largely by setting the film in a world where Arthur has no choice but violence, and no escape but madness. He’s portrayed as a kind of dark truth-teller because he’s learned that the world is a joke and nothing matters.\n\nThat’s a fairly adolescent outlook, which Phillips embraces in the same persecution-complex spirit that recently led him to complain that he had to make Joker because the world is now too sensitive and woke for his previous brand of destructive-bro comedy. But Joker would probably be raising much less social concern if it wasn’t such a technically compelling movie, if its final moments weren’t so outsized and joyous and purposefully insane.\n\nBecause Joker does play — not just to its most put-upon, angry, repressed viewers — but to the entire audience’s darkest hearts. It shows someone suffering when he lets society have its way with him, and freed when he has his way with society. It shows him weeping alone when he plays by the rules, and dancing wildly in public when he decides to break those rules. The story hurts and harms him, but Phillips suggests in the end that everything he went through was necessary to bring him the power and recognition he deserves. It’s a tempting fantasy, crafted with utter conviction.\n\nMany critics and early viewers have responded to Joker with loathing, because that fantasy is so selfish and solipsistic. By dismissing the world as imbalanced at best, outright malicious at worst, Phillips is enabling his viewers’ worst and most destructive impulses. “I just don’t want to feel so bad anymore,” Arthur says plaintively at one point. He’s a relatable kind of villain, harmless and sad — not an Everyman, but an audience avatar for the downtrodden. And then he models a way to not be harmless anymore. That doesn’t necessarily make Joker a call to action, or an invitation to real-life violence. But it does represent a horrifying form of invitation — not just a call to sympathize with the devil, but a full-blown justification for the hell he creates.", "description": "Todd Phillips’ Joker, a new origin story for Batman’s most ruthless villain, turns a persecution complex into a wish-fulfillment power trip. Joaquin Phoenix stars as the man who becomes Joker after a harrowing series of experiences designed to make audiences empathize with him and feel the joys of acting out against society.", "authors": ["Tasha Robinson", "Oct"], "top_image": "https://cdn.vox-cdn.com/thumbor/jZCvPJY-n-8Anmxo8cD0L5jcxdA=/0x430:6000x3571/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/19260681/rev_1_JOK_14104r_High_Res_JPEG.jpeg", "published_at": "2019-10-04"}