{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/protection-will-be-provided-to-shot-whistleblower-kzn-anc-vows-20191028", "downloaded_at": "2019-10-29 00:17:25.363053+00:00", "title": "Protection will be provided to shot whistleblower, KZN ANC vows", "language": "en", "text": "Moerane Commission witness Thabiso Zulu survived an attempt on his life over the weekend. (Jabulani Langa, Daily Sun)\n\nThe ANC in KwaZulu-Natal has vowed that security for a whistleblower and friend of slain ANC Youth League secretary general Sindiso Magaqa will be provided, after he was shot over the weekend.\n\nThabiso Zulu, who has been outspoken on political assassinations in the province, had been lamenting his need for extra security for months before the weekend attempt on his life.\n\nIn a statement released on Monday afternoon, the ANC in the province condemned the shooting of Zulu.\n\n\"The provincial ANC chairman has promised an urgent intervention to deal with this matter and that support and protection will be provided to Zulu.\n\n\"The ANC in the province will be engaging with the relevant authorities to process such an intervention.\"\n\nProvincial chairperson Sihle Zikalala said he was shocked at the attempt on Zulu's life.\n\nHe said the ANC in the province was \"very concerned about the incident and wished Zulu a speedy recovery after he sustained an injury on his arm when he and a friend were attacked by unknown gunmen\".\n\n\"We're very concerned about this situation because we thought that we had now stabilised as a province. We thought we had reached a point where issues of this nature are no longer there,\" said Zikalala.\n\nHe said the attack on Zulu \"undermines the ANC's efforts to bring about stability in the province\".\n\nThree men allegedly fired at Zulu, hitting him in the arm while he was with a friend in Copesville, Pietermaritzburg, on Saturday.\n\nZulu, the former ANCYL regional secretary in the ANC's Harry Gwala Region, had testified at the Moerane Commission about mass corruption and looting in the municipality.\n\nHe had not received protection despite it being recommended by the Public Protector.\n\nThe commission heard that he had tried on numerous times to fight corruption, but \"was let down by police\".", "description": "The ANC in KwaZulu-Natal have vowed that security for a whistleblower and friend of slain ANC Youth League secretary general Sindiso Magaqa will be provided, after he was shot over the weekend.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/7550/a1a4776a23bd4dc3ac32463e7502b842.jpg", "published_at": "2019-10-28"}