{"pub": "news24", "url": "https://city-press.news24.com/Voices/imprisonment-of-kanya-cekeshe-is-a-way-to-kill-a-nations-aspirations-20191014", "downloaded_at": "2019-10-14 23:20:36.538839+00:00", "title": "Imprisonment of Kanya Cekeshe is a way to kill a nation’s aspirations", "language": "en", "text": "Voices Imprisonment of Kanya Cekeshe is a way to kill a nation’s aspirations\n\nOn October 9 2019, after over 22 months in prison, Fees Must Fall activist Kanya Cekeshe made one of his most hopeful appearances for freedom.\n\nHolding the painful title of the longest serving political prisoner from the historic protests that ensued from 2015, he looked a tired figure.\n\nA young man who has had to remain strong for his family, for his peers, and who risked it all for his generation, was closer to redemption but the injustice carried out on his young life is a scar he will carry his whole life.\n\nAs I sat in that court room, listening to one of the finest young black lawyers of our time expose the South African legal system for the incompetent mess it has created, I could not help but wonder what is it that the state gains by sentencing a young person crying for education to prison?\n\nA state that had to be slapped in the face and reminded that it had children, children to whom it preaches education as the key to prosperity yet hides this very key in the highest offices of capital.\n\nI realised then that there are many ways of dying, and there are many ways of killing.\n\nI wondered what is it that the state wanted to achieve.\n\n\n\nWhat was the rationale of providing a lawyer that compelled a young and confused young man to confess to a guilt he knew nothing about?\n\nWhat is it that compelled a state of supposed liberation heroes to condemn a first-time offender, a freedom fighter, to a punishment so harsh?\n\nI realised then that there are many ways of dying, and there are many ways of killing.\n\nSometimes it is a bullet through the heart or a knife through the gut, but death is not always dramatic, it is not always physical.\n\nIt can be slow, starting with the soul, killing hope and eventually turning tomorrow into an impossibility.\n\nIt is no longer life when the future carries nothing but misery and despair.\n\nThis is the kind of death we should not allow, that of the spirit.\n\nWe must remember when Biko told us that the method of death can be a politicising act.\n\nI echo his words and say the refusal to die is a revolutionary act and Kanya Cekeshe is a testament of this.\n\nHe was violated, gratuitously, and his incarceration remains unjustifiable.\n\nThe imprisonment of Kanya Cekeshe serves many other purposes outside of killing a man.\n\nHe was dishonoured and shamed, criminalised for insisting that a black child also deserves to breathe freely in the land of his ancestors.\n\n\n\nHe was alienated from society for saying we too are human.\n\nRegardless of the shacks we come from, the fact that we sometimes sleep with empty stomachs and that our mothers have to beg for us to survive does not make us subservient.\n\nHe languished in an abyss for demanding justice and insisting that the black child have dignity.\n\nBut the imprisonment of Kanya Cekeshe serves many other purposes outside of killing a man.\n\nIt is also a way to kill a nation’s aspirations, to put terror and fear in the heart of the nation so much that imagining a better tomorrow becomes an impossibility.\n\nIt is an old strategy that was used by oppressive regimes to control voices of dissent.\n\nMachiavelli used it, it is the same strategy that was used by Willie Lynch to control slaves from revolting.\n\nIt was one of the most powerful tools of the apartheid regime: punishment as an exhibition, as a method of instilling fear.\n\nThe public lynching of black people in America was meant to instil fear in the public.\n\nIt was a clear message of what would happen to you if you entertained the impulse to fight for freedom.\n\nIt is quite unfortunate that our government that claims to represent the people uses the same tactics that were used by repressive regimes and it does this all under the guise of the rule of law.\n\nThe only reason why Kanya is in prison is precisely because the state wanted to say if you ever stand up and fight for what you believe in, the outcome is imprisonment.\n\nSadly, it seems that it has worked.\n\nHow would it not when the futures of families, of mothers, brothers and sisters are so easily destroyed, by suspensions, expulsions and imprisonment?\n\nThe conditions that forced millions of black students to stand up, put their lives and careers on the line still exist even today.\n\nThe curriculum still remains unchanged, not being of any service to Africa and its developmental needs.\n\nThe distribution of resources perpetuates separate development of institutions of higher learning, culturally, socially and in terms of infrastructure.\n\nWhy did we allow a regime of fear to kill the brightest spark that has ever befallen South Africa post-1994?\n\nThere is no real transformation except for a couple of black people who are used as masks to hide the white face of South Africa’s academia; the fees are even higher than they were before Fees Must Fall.\n\n\n\nThe youth that began the fight has been crushed with fear, and the youth that enters has been warned not to fight, for they carry the hopes of mouths they leave at home.\n\nSo, what was the point of all these sacrifices if we are back where we began?\n\nWhat tangible gains did we achieve except for a couple of us getting national recognition and popularity?\n\nIf we have not made any gains why did we stop fighting?\n\nWhy did we allow a regime of fear to kill the brightest spark that has ever befallen South Africa post-1994?\n\nThese are questions that we all need to ask ourselves.\n\nThese are the questions I am sure Kanya has been asking himself, as the hours trickle away slowly in the dark cells of Leeuwkop Prison.\n\nPambo is an EFF Member of Parliament", "description": "What is it that compelled a state of supposed liberation heroes to condemn a first-time offender, a freedom fighter, to a punishment so harsh?", "authors": ["Vuyani Pambo"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9470/4cb9172b30d74fb49a561cec9a657af6.jpg", "published_at": "2019-10-14"}