{"pub": "businessinsider", "url": "https://businessinsider.com/guide-earning-using-chase-ultimate-rewards-points", "downloaded_at": "2019-10-12 15:19:02.505135+00:00", "title": "5 ways you can use Chase Ultimate Rewards points from cards like the Sapphire Preferred, including the most valuable option: free travel", "language": "en", "text": "Chase Ultimate Rewards points are some of the most flexible rewards points anyone can earn. Not only can you redeem them for gift cards and statement credits, but you can book travel or transfer points 1:1 to popular airline and hotel partners.\n\nYou can earn Ultimate Rewards points with the Chase Sapphire Preferred Card, the Chase Sapphire Reserve, and the Ink Business Preferred Credit Card, among others.\n\nTransferring your Chase points to airlines is often the best deal, but don't forget to check on the pricing of sale fares through the Chase portal.\n\nChase hotel partners also provide excellent value, but you should also check pricing on the same hotels through the Chase portal. Sometimes booking through Chase can save you a ton of points you can use later on.\n\nRead more personal finance coverage.\n\nChase Ultimate Rewards is frequently considered one of the top credit card programs available today, and it's easy to see why. This rewards program, which can be accessed with certain Chase credit cards including the Chase Sapphire Reserve and Ink Business Preferred Credit Card, offers some of the most generous and diverse travel redemption options you can find.\n\nBut cardholders who sign up for Chase credit cards should know they don't have to redeem rewards for travel if they don't want to. There are plenty of ways to cash in your points whether you're a frequent traveler or someone who rarely leaves your hometown, and practically all of them are good ones.\n\nKeep in mind that we're focusing on the rewards and perks that make these credit cards great options, not things like interest rates and late fees, which can far outweigh the value of any rewards.\n\nWhen you're working to earn credit card rewards, it's important to practice financial discipline, like paying your balances off in full each month, making payments on time, and not spending more than you can afford to pay back. Basically, treat your credit card like a debit card.\n\nRead more: The best Chase credit cards\n\nHow to earn Chase Ultimate Rewards points\n\nThe only way to earn rewards in the Chase Ultimate Rewards ecosystem is by signing up for a Chase credit card that operates within this program and using that card. Fortunately, Chase Ultimate Rewards offers some of the best travel credit cards available today, each of which offers a generous sign-up bonus and ongoing rewards based on how much you spend.\n\nHere are the cards that earn Ultimate Rewards points:\n\nChase Sapphire Preferred Card — When you sign up for this card, you'll earn an initial bonus of 60,000 points when you spend $4,000 within three months of account opening. On top of the bonus, you'll earn an unlimited 2x points on travel and dining and 1x points on everything else you buy. A $95 annual fee applies, but the sign-up bonus alone is worth $750 in travel when you use your points to book through Chase.\n\nWhen you sign up for this card, you'll earn an initial bonus of 60,000 points when you spend $4,000 within three months of account opening. On top of the bonus, you'll earn an unlimited 2x points on travel and dining and 1x points on everything else you buy. A $95 annual fee applies, but the sign-up bonus alone is worth $750 in travel when you use your points to book through Chase. Chase Sapphire Reserve — If you want a travel credit card that offers some serious travel benefits in addition to rewards, you could also consider this card If you want a travel credit card that offers some serious travel benefits in addition to rewards, you could also consider this card . The Reserve has a $450 annual fee, but you'll get a Priority Pass Select airport lounge membership , a $300 annual travel credit, up to a $100 credit for Global Entry or TSA PreCheck , and several other perks. You'll also earn an initial 50,000 points when you spend $4,000 on your card within three months, and you'll earn 3x points on travel and dining, and 1x points on all other purchases.\n\nPriority Pass Select airport lounge membership up to a $100 credit for Global Entry or TSA PreCheck Ink Business Preferred Credit Card — This is a great option if you have a small business or a side hustle that would qualify you for a This is a great option if you have a small business or a side hustle that would qualify you for a business credit card . It offers a sign-up bonus of 80,000 points after you spend $5,000 in the first three months. It also earns 3x points on the first $150,000 spent on travel and select business categories each account anniversary year and 1 point per dollar on all other purchases. There's a $95 annual fee.\n\nRead more: Preferred vs. Reserve — How the Chase Sapphire credit cards stack up\n\nAdditionally, some cash-back credit cards like the Chase Freedom and Chase Freedom Unlimited also let you earn Chase Ultimate Rewards points. The same is true of Chase's business cash-back credit cards, the Ink Business Unlimited Credit Card and the Ink Business Cash Credit Card. However, Chase cash-back credit cards with no annual fee do not offer as many redemption options for travel, including transfers to travel partners.\n\nThere is a workaround, however. If you pair a travel credit card like the Chase Sapphire Preferred or Chase Sapphire Reserve with one of their cash-back credit cards, Chase lets you pool all your points in one place for optimal redemptions.\n\nHow Chase lets you redeem your rewards\n\nIf you're considering a Chase credit card that earns Chase Ultimate Rewards points but want to make sure you'll be able to utilize your points, it helps to know all your options ahead of time. Here are the main redemption options you can look forward to:\n\n1. Redeem for statement credits or gift cards (1 cent per point)\n\nFirst off, Chase Ultimate Rewards lets you cash in points for statement credits at a rate of 1 cent per point. This option can be a good one if you don't want to travel or if you want to use your points to cover a splurge purchase of some kind. All you have to do is charge the purchase to your credit card, then redeem your points at a rate of 1 cent each in order to wipe all or part of the charge away.\n\nGift cards are another redemption option Chase offers, and you'll normally get 1 cent per point if you go this route. Sometimes Chase even offers gift cards with a better value for specific retailers, which can be a good deal. It's not unusual to see gift cards for retailers like Home Depot or Petco for 2,250 points per $25 gift card.\n\nRead more: Chase Sapphire Preferred card review\n\n2. Pay for merchandise (point values vary, not a good deal)\n\nIf you prefer to shop directly with your points, you can redeem them for purchases on Amazon.com or with Apple. Generally speaking, you'll get 0.8 cents per point when you use points to shop on Amazon and 1 cent per point when you purchase electronics through Apple.\n\nHowever, this isn't a good deal. Considering you can redeem points for statement credits to cover any purchase you want at a rate of 1 cent per point, you should go that route instead of you're buying merchandise that comes in at a lower redemption rate than that.\n\n3. Book travel through the Chase portal (up to 1.5 cents per point)\n\nYou can also book hotels, airfare, rental condos, activities, and car rentals directly through the Chase portal, which syncs up with and offers the same options as Expedia.com. If you have the Chase Sapphire Reserve card, you get 50% more travel for free when you book with points, thus giving your points 1.5 cents each in value.\n\nWith the Chase Sapphire Preferred, on the other hand, you get 25% more travel for free when you book through the portal, or 1.25 cents per point in value.\n\n4. Transfer points to airline and hotel partners (up to 2 cents per point or more)\n\nSimilar to American Express Membership Rewards, Chase Ultimate Rewards lets you transfer points to a wide range of airline hotel partners. All Chase transfer partners let you move your points at a 1:1 ratio, which is not only valuable but also easy to understand.\n\nCurrent Chase transfer partners include:\n\nAer Lingus\n\nBritish Airways\n\nEmirates\n\nFlying Blue / Air France\n\nIberia\n\nJetBlue\n\nSingapore Airlines KrisFlyer\n\nSouthwest Airlines\n\nUnited MileagePlus\n\nVirgin Atlantic\n\nIHG Rewards\n\nMarriott Bonvoy\n\nWorld of Hyatt\n\n5: Redeem points for experiences (point values vary)\n\nAs if all those options weren't enough, you can also use Chase Ultimate Rewards points to book special \"experiences,\" including one-of-a-kind events hosted by Chase. It's hard to say what your exact point value will be for these redemptions since Chase often sets the \"price.\"\n\nSome examples include VIP dining experiences, sports games with VIP seating, and Broadway-style shows. Point requirements are all over the place from as low as 30,000 points for a single seat at a Broadway show to several hundred thousand points for a VIP package to attend the Sundance Film Festival.\n\nSome lucrative ways to redeem your rewards\n\nWhile the \"best\" way to redeem your points depends on your personal goals, there are plenty of redemptions that can pay off in a big way. Here are some of the best ways to cash in your rewards if your goal is booking epic and unforgettable travel experiences for free:\n\nScore cheap flights through the Chase Ultimate Rewards portal\n\nWhile transferring Chase points to airlines is often the best deal, don't forget that you can also save big by booking flights through the Chase portal. This is especially true when you find a cheap fare online that you can turn around and book through Chase, which partners with Expedia.com. Remember that, when you book through the Chase portal, you can book flights with fewer points when prices are low.\n\nHere's a good example of how this works in practice: Earlier this year, I was trying to find award flights for this upcoming October to Milan, Italy for my family of four and my parents. While I almost booked one-ways on American for 30,000 miles each plus airline taxes and fees, I ultimately found cheap one-ways on Air Portugal for $287.80 each. Since you get 50% more travel for free when you book flights through the Chase portal with points from the Chase Sapphire Reserve, I was able to book six one-way flights worth $1,726.80 total through Chase for just 115,120 Chase Ultimate Rewards points.\n\nThat's an absolute steal and a much better value than using American AAdvantage miles. With the American AAdvantage program, I would have paid 180,000 American miles plus around $100 per person (or $600 for six of us) in airline taxes and fees.\n\nTransfer points 1:1 to Southwest Airlines\n\nIf you're fine with flying economy and mostly travel in the US and to the Caribbean or Mexico, you'll definitely want to consider transferring points 1:1 to Southwest Airlines. This frequent flyer program is fare-based, meaning lower prices mean you can score award flights for fewer points. In fact, you can frequently find one-way flights for as little as 5,000 points during one of Southwest's countless sales.\n\nSouthwest also gives each customer two free checked bags, making it a good choice for families who travel with checked luggage. Finally, the airline has a generous cancellation and rebooking policy that means you can usually reschedule your flight — even at the last minute.\n\nRead more: Southwest Airlines flyers can enjoy over a year's worth of free companion plane tickets — here's how to qualify for a pass\n\nFly cheap economy to Europe with Air France/Flying Blue\n\nAir France/Flying Blue is a truly underutilized Chase Ultimate Rewards partner. This partner lets you fly for cheap to and from Europe from most major cities, and usually for less than you'll pay with other airline programs.\n\nYou can frequently find one-way awards to European cities like Amsterdam and Paris for less than 30,000 miles one-way with this program, making them a solid option to check out if you're dreaming of a European getaway. Best of all, awards are generally plentiful and you can usually find 4 or more economy awards on any given flight.\n\nRead more: How to get an ANA first class flight to Japan using credit card points\n\nTransfer to airline partners to fly business class\n\nUsing airline miles to fly business class makes a lot of sense, and this is particularly true with airlines that have fixed award charts. Fortunately, Chase has several airline partners that make it easy to book premium cabins for a reasonable number of miles.\n\nFor example, you could utilize your Chase points to transfer to any of these airlines for an epic redemption value:\n\nFly business class from the West Coast to Singapore with Singapore Airlines for just 95,000 miles\n\nFly business class from the West Coast to Tahiti on Air France/Flying Blue for just 75,000 miles\n\nBook a Delta One flight to Europe on Virgin Atlantic for just 50,000 miles\n\nThese are just a few of the options to consider, although there are many, many ways to utilize Chase points for profitable transfers to airline partners. Also note that Chase recently added Emirates as an airline transfer partner, so there are more options than ever when it comes to getting outsized value from your points.\n\nBook hotels through the Chase Ultimate Rewards portal\n\nWhile the Chase Ultimate Rewards program partners with IHG Rewards, Marriott Bonvoy, and World of Hyatt, it's important to \"price shop\" awards before you transfer Chase points to these programs. For example, you may find that a Marriott stay that costs 50,000 points will only set you back 12,000 Chase points through the portal. In that case, it makes more sense to book your hotel stay with points through Chase than it does to transfer all those extra points over to book the same room.\n\nHere's a good example of the exact same hotel stay on the same dates with the IHG Rewards program. While you can book the Holiday Inn Jamaica Resort for 50,000 IHG points through IHG.com, the same hotel on the exact same dates will set you back only 14,603 points through Chase Ultimate Rewards with the Chase Sapphire Reserve:\n\nAlso note that the Chase portal lets you book hundreds of thousands of off-brand and boutique hotels and resorts, meaning you can use your points to shop around for a good deal.\n\nBook fun excursions you don't want to pay for\n\nAnother way to use Chase Ultimate Rewards is for fun day trips and excursions you wouldn't normally want to pay for. Think snorkeling trips in the Caribbean, a sunset booze cruise in Hawaii for your anniversary, or a cooking class in Florence, Italy. You can use Chase points to book these experiences and more, and often for less than you think.\n\nRemember that you'll get 25% more travel for free when you use points from the Chase Sapphire Preferred to book travel through the portal, but that this amount goes up to 50% more travel if you have the Chase Sapphire Reserve.\n\nPersonally, I have used Chase points to snorkel with stingrays in Grand Cayman, swim with sharks in Bora Bora, and see some of the world's oldest ruins in destinations like Italy and Greece. I see splurging for excursions as a fun way to treat myself and my family. And they're my points to spend, so why not?", "description": "Chase's Ultimate Rewards program lets you redeem points for cash back or free travel. Here's our guide to earning the points and using them wisely.", "authors": ["Holly Johnson"], "top_image": "https://image.businessinsider.com/5da0cfa74af90908d81f114b?width=1200&format=jpeg", "published_at": "2019-10-12"}