{"pub": "independent", "url": "https://independent.co.uk/sport/cricket/ashes/ashes-2019-england-vs-australia-cricket-trevor-bayliss-jonathan-liew-a9099746.html", "downloaded_at": "2019-09-10 23:34:43.669028+00:00", "title": "England vs Australia: Farewell Trevor Bayliss, the invisible guru who leaves English cricket as he found it", "language": "en", "text": "The greatest trick Trevor Bayliss ever pulled was convincing English cricket that he existed. As the 56-year-old Australian brings his four-year reign as England coach to an end at The Oval this week, there remains a mysterious void at the heart of his legacy, one that goes beyond the question of whether England are a better or worse team than the one he inherited. After four years of riches and hitches and unprecedented turbulence, perhaps the more pertinent issue is whether Bayliss actually changed anything at all.\n\nAfter all, he took over a team fifth in the Test world rankings, and barring a victory in his final game, that is exactly what he will bequeath. He took over an inconsistent side with gaping holes in the batting order, mercurially underperforming all-rounders, a beleaguered captain and a pace attack worryingly reliant on James Anderson and Stuart Broad. A side that could give anyone a game on their own turf, but often looked utterly bereft in foreign conditions. The untrained observer would be forgiven for wondering whether anything has really changed.\n\nIn a way, then, this is partly a philosophical question: a window into the invidious powerlessness of the modern coach, beholden both to the system above him and the players beneath him. Yet even within this framework, Bayliss has always painted himself as custodian rather than insurgent. Even the remarkable World Cup victory, a product of four years’ planning and fine-tuning, is one for which Bayliss was happy to deflect the praise. “It’s an achievement by the players,” he insisted on Tuesday in his final media engagement as coach. “As a coaching staff, we’re lucky enough to be involved with them.”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nIf Bayliss was determined not to associate himself too strongly with England’s greatest triumph, then he was equally set on swerving the blame for their vices. On Bayliss’ watch, scores of over 400 have become commonplace in one-day cricket, and scores of under 100 routine in Test cricket. Defeat at Old Trafford on Sunday sealed a first Ashes failure on home soil for almost two decades. Yet for Bayliss, the problems are more embedded: the relentlessness of the international schedule, the lack of world-class talent coming off the production line in county cricket, which he wants to see reduced from 18 teams to around 10. He rejected the suggestion that the often reckless aggression displayed by England’s Test batsmen was a product of his own coaching ethos.\n\n“It’s not as if it hasn’t been about playing the ball later and not leaving big gaps or not throwing hands at the ball,” he said. “That’s exactly what they’ve been working on. But do they get enough time away from the game to actually work on those things? Does the competition promote circumstances where that can be put into practice? There are the questions that have got to be answered. That gets back to the wickets we play on, the strength of competition.”\n\nShape Created with Sketch. Ashes fourth Test: England player ratings Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Ashes fourth Test: England player ratings 1/11 Rory Burns - 6/10 Offered another example of his admirable application with a first-innings 81, confirming his status as the most prolific opener in the series, only to bag a three-ball duck in the second. AFP/Getty Images 2/11 Joe Denly - 5 Shuffled back up to the top of the order and showed the right kind of resolve as England searched for a draw, holding out for 123 balls. Will be on duty at the Oval but at 33, for how much longer? AFP/Getty Images 3/11 Joe Root - 5 Made a battling 71 on day three then became the first England captain to make three ducks in a series when Pat Cummins bowled him with a snorter on the fourth evening. A second unsuccessful Ashes campaign as skipper. Getty Images 4/11 Jason Roy - 4 Swapped positions with Denly after a torrid time at opener, making 22 and 31. Still looks a long way from proving himself a Test batsman. PA 5/11 Ben Stokes - 4 A crash back to earth after his unforgettable outing at Headingley. Could not produce a third batting miracle of the summer and injured his right shoulder after an expensive stint with the ball. Getty Images 6/11 Jonny Bairstow - 4 Another disappointing return with the bat for a man whose tank might just be empty after a huge workload. Solid with the gloves. Action Images via Reuters 7/11 Jos Buttler - 7 Gave a good account of his battling qualities in each innings in what was easily his best game of the series. Needs a major score soon to silence doubts but this was a start. Getty Images 8/11 Craig Overton - 5 Selected to some surprise ahead of Chris Woakes and Sam Curran, the Somerset man's home debut was a mixed bag. His seamers were only a notch above functional but he dug down for nearly three hours in forlorn pursuit of a draw. AP 9/11 Jofra Archer - 4 Wicketless for the first time in his short Test career in the first innings and down on pace before his juices started flowing midway through the match. Still a huge talent but the quietest of his three outings to date. Action Images via Reuters 10/11 Stuart Broad - 7 Continued his playground bullying of David Warner, dismissing him twice for nought, and took his series wicket tally to 19 with five in the match. No blame attached here. Action Images via Reuters 11/11 Jack Leach - 5 Will forever rue the front-foot no-ball that cost England the best part of 100 runs from Steve Smith's bat, but plugged away and turned in another diligent tail-end defence. Action Images via Reuters 1/11 Rory Burns - 6/10 Offered another example of his admirable application with a first-innings 81, confirming his status as the most prolific opener in the series, only to bag a three-ball duck in the second. AFP/Getty Images 2/11 Joe Denly - 5 Shuffled back up to the top of the order and showed the right kind of resolve as England searched for a draw, holding out for 123 balls. Will be on duty at the Oval but at 33, for how much longer? AFP/Getty Images 3/11 Joe Root - 5 Made a battling 71 on day three then became the first England captain to make three ducks in a series when Pat Cummins bowled him with a snorter on the fourth evening. A second unsuccessful Ashes campaign as skipper. Getty Images 4/11 Jason Roy - 4 Swapped positions with Denly after a torrid time at opener, making 22 and 31. Still looks a long way from proving himself a Test batsman. PA 5/11 Ben Stokes - 4 A crash back to earth after his unforgettable outing at Headingley. Could not produce a third batting miracle of the summer and injured his right shoulder after an expensive stint with the ball. Getty Images 6/11 Jonny Bairstow - 4 Another disappointing return with the bat for a man whose tank might just be empty after a huge workload. Solid with the gloves. Action Images via Reuters 7/11 Jos Buttler - 7 Gave a good account of his battling qualities in each innings in what was easily his best game of the series. Needs a major score soon to silence doubts but this was a start. Getty Images 8/11 Craig Overton - 5 Selected to some surprise ahead of Chris Woakes and Sam Curran, the Somerset man's home debut was a mixed bag. His seamers were only a notch above functional but he dug down for nearly three hours in forlorn pursuit of a draw. AP 9/11 Jofra Archer - 4 Wicketless for the first time in his short Test career in the first innings and down on pace before his juices started flowing midway through the match. Still a huge talent but the quietest of his three outings to date. Action Images via Reuters 10/11 Stuart Broad - 7 Continued his playground bullying of David Warner, dismissing him twice for nought, and took his series wicket tally to 19 with five in the match. No blame attached here. Action Images via Reuters 11/11 Jack Leach - 5 Will forever rue the front-foot no-ball that cost England the best part of 100 runs from Steve Smith's bat, but plugged away and turned in another diligent tail-end defence. Action Images via Reuters\n\nBayliss is right, of course. Blaming him for decisions taken at board level to push county cricket out of the peak summer months, or to reduce funding for high-performance overseas camps, or even for societal or generational shifts, is clearly absurd. And besides, the coach is merely one link in an arcane chain of power that incorporates director, selector and captain, with very little transparency over who is responsible for what.\n\nDespite all this, however, Bayliss still bears a good deal of responsibility for what has happened once players have arrived in camp. It is a shocking indictment of the team culture that of the 29 players given England debuts during his time in charge, not a single one has yet gone on to win 20 caps in any format. Are we to believe there was not a single viable international cricketer among them?\n\nA hard-line view would be that Bayliss inherited a rich talent pool that he did very little to supplement. However, that would be to overlook the development of players like Jason Roy and Adil Rashid in white-ball cricket, of Ben Stokes and Chris Woakes in all formats. Even so, too many players have stagnated in recent years - Jonny Bairstow, Jos Buttler, Joe Root, Moeen Ali - to be entirely coincidental. The fielding, a particular Bayliss focus, has regressed after a strong start. The evidence suggests that there are times when Bayliss’ stubborn hands-off approach could have used a little modification.\n\n“It’s not as if I just let it flow without anything happening,” he argued. “All the coaches, we’re always talking and discussing individuals. There’s different styles of coaches that can have success in different ways. I made a pact with myself to keep doing things the way I’ve done it. It’s been successful over a long period of time, and I’d like to think it’s been reasonably successful in these four years as well.”\n\nAnd of course, he’s right about that too. Because ultimately, you can stack up all the issues with the Bayliss regime - the revolving door of opening batsmen, the serial shuffling of the batting order, the inability to unearth genuine match-winning bowlers or triumph away from home - and lay against them the greatest single day in the history of English cricket. If England’s World Cup success had many fathers - Stokes, Jofra Archer, Eoin Morgan and Andrew Strauss among them - then it would take the most cussed of judges to deny Bayliss his share of the credit. Without his knowledge of the one-day game, without his relentless focus on fielding and fine margins, or his occasional kicks up the backside, it’s easy to envisage how England’s golden summer might have gone badly awry.\n\nHe freely admits that the Test element of the job - a strand he maintains has always been equally as important as the one-day side - didn’t always go to plan. But he backs Root to continue as captain - “I think he’s getting better all the time; sometimes you can only be as good as the players you’ve actually got in the team” - and fancies England to spring a surprise Down Under in a couple of years’ time.\n\nHow does he rate his own time in charge? “I’m a hard marker, so I’ll say five (out of 10),” he said. And weirdly, it seems like a fitting epitaph to a man who in his enigmatic sunhat and shades often appeared to be hiding in plain sight: England’s invisible guru, its umami sage, its immaculate house-sitter who turned up, kept the show on the road, and ultimately left everything pretty much as he found it.", "description": "The greatest trick Trevor Bayliss ever pulled was convincing English cricket that he existed. As the 56-year-old Australian brings his four-year reign as England coach to an end at The Oval this week, there remains a mysterious void at the heart of his legacy, one that goes beyond the question of whether England are a better or worse team than the one he inherited.", "authors": ["Jonathan Liew"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/10/17/Trevor-Bayliss.jpg", "published_at": "2019-09-10"}