{"pub": "yahoo", "url": "https://news.yahoo.com/trump-mounts-last-minute-push-213052039.html", "downloaded_at": "2019-10-12 00:10:49.238603+00:00", "title": "Trump mounts last-minute push to thwart Democratic governor in Louisiana", "language": "en", "text": "President Donald Trump is traveling to Louisiana Friday for an eleventh-hour mission to stop the state's Democratic governor — one of the few statewide Democrats in the Deep South — from winning a second term.\n\nBut unlike his previous election-eve campaign rallies, Trump won’t stump for a specific Republican candidate: In fact, he’ll appear on stage with two Republicans running bitter campaigns against one another. If that has the makings of an awkward spectacle, blame Louisiana’s open primary system. Candidates from both parties, including incumbent Gov. John Bel Edwards, are running in Saturday's primary.\n\nIf Edwards clears a majority — he’s polling near the 50 percent mark — he wins another term outright. If not, Edwards and one of the two Republicans on stage with Trump will face off a month later in a general election.\n\n\"I will be in Louisiana tonight (Love it!) to get Republicans to vote for either of our two great Republican Candidates and force a [runoff] with John Bel Edwards, who has done a really poor job of tax cutting, car insurance cost (worst in USA), & is suspect on your 2nd Amendment!\" Trump tweeted Friday morning ahead of his trip to Lake Charles.\n\nThe two GOP candidates, Rep. Ralph Abraham and self-funding businessman Eddie Rispone, are competing for second place and a one-on-one shot at Edwards in a runoff if the incumbent comes up short of the 50 percent threshold. Republicans believe they will hold Edwards shy of a majority — and that they would have an advantage over Edwards in a runoff.\n\n\n\nBut in the meanwhile, the two Republicans are attacking one another, jockeying for that second-place slot. In the final week, Rispone launched two new attack ads against Abraham hitting his congressional attendance record and painting him as insufficiently supportive of Trump's 2016 candidacy. Abraham, meanwhile, has been airing an ad telling voters, \"Eddie Rispone has been lying to you.\"\n\n\n\nPrivately, Democrats are hoping that Edwards will win outright. Most public and private polling conducted by allies of the various campaigns has shown Edwards falling just short of the 50 percent he needs to clinch reelection outright. But the party is publicly cautious about the possibility of a runoff and expressing optimism that Edwards can win a head-to-head matchup with one of the Republicans.\n\n\n\n\"It's always hard to avoid a runoff in a multi-candidate race,\" said Democratic strategist Scott Arceneaux, a former executive director of the Louisiana Democratic Party. \"Even with an incumbent. The math is difficult. In Louisiana, you have all these other candidates on the ballot that are going to get between 2 or 3 percent that essentially take up space. It's hard, and I think John Bel has done an excellent job of keeping us in a position where he can certainly get there on Saturday. It's one where he's definitely in the game, and I think it's where he could go 51 [percent] or 49.\"\n\nIn their effort to keep Edwards under 50 percent, Republicans have focused their attacks on Edwards' handling of a sexual harassment complaint directed at his former deputy chief of staff, Johnny Anderson. Both the Republican Governors Association and a Republican-funded outside group, Truth in Politics, have aired ads criticizing Edwards for hiring Anderson, who had been accused of harassment in a previous job, and not moving swiftly enough to oust him.\n\nIn response, the Edwards campaign recently released its own ad featuring women, speaking directly into the camera, defending Edwards' record on women.\n\nRepublicans say the late push — including visits from Trump, Vice President Mike Pence and the president's son, Donald Trump Jr. — has momentum on the GOP's side.\n\n\"We're definitely looking at a runoff from our end,\" said Andrew Bautsch, the executive director of the Louisiana Republican Party. \"And that puts the governor in a bad spot from our end because if you look at it, an incumbent has never won going into a runoff in the state of Louisiana.\"\n\nIn fact, Bautsch predicted that, despite polling showing Edwards nearing a majority, he will come up well short. \"We think he's going to be way under the 50 percent mark,\" Bautsch said. \"As of right now our goal is to rally our troops, which we're doing with the president coming in, which we've done all week with the various rallies.\"", "description": "President Donald Trump is traveling to Louisiana Friday for an eleventh-hour mission to stop the state's Democratic governor — one of the few statewide Democrats in the Deep South — from winning a second term.  If that has the makings of an awkward spectacle, blame Louisiana’s open primary system", "authors": ["Daniel Strauss"], "top_image": "https://s.yimg.com/uu/api/res/1.2/qfjICaQRBNvMK0mol1.LRA--~B/aD03NzM7dz0xMTYwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/politico_453/11137b649e2d59b31090ece3b335ac71", "published_at": "2019-10-11"}