{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7563791/Teenage-killers-knifed-aspiring-mechanic-death-youth-centre-jailed-total-32-years.html", "downloaded_at": "2019-10-12 00:49:27.090535+00:00", "title": "Teenage killers who knifed aspiring mechanic to death in youth centre jailed for a total of 32 years", "language": "en", "text": "Florant jailed for at least 18 years and Ukonu given 14 years at the Old Bailey\n\nRishon Florant, 18, denied involvement but co-accused Chibuzo Ukonu identified him as the stabber\n\nWhile inside he fell over a table tennis table and was stabbed repeatedly before dying from a severed femoral artery\n\nHe and his friends had been chased down the street by two hooded men\n\nTwo teenagers have been jailed for killing an aspiring mechanic in a 'shocking and cruel' attack inside a youth centre.\n\nGlendon Spence, 23, and his friends sought refuge at the Marcus Lipton Youth Centre in Brixton, south London, when two hooded teenagers ran at them armed with large knives.\n\nMr Spence tripped and fell by a table tennis table and was set upon by one of the youths in a 'swift and merciless' attack in front of horrified staff and youngsters.\n\nHe suffered a stab wound to his thigh, severing the femoral artery, and was pronounced dead at the scene soon after the attack on the evening of February 21.\n\nRishon Florant, 18, denied but was convicted of murder by an Old Bailey jury while Chibuzo Ukonu, 18, was found guilty of manslaughter. Judge Mark Dennis QC of the Old Bailey ordered Florant to be detained for 18 years, and handed Ukonu 14 years in a young offenders' institute.\n\nGlendon Spence, 23, and his friends sought refuge at the Marcus Lipton Youth Centre in Brixton, south London, when two hooded teenagers arrived armed with large knives and ran at them\n\nHis attackers were driven off by an accomplice in a BMW, the Old Bailey heard.\n\nRishon Florant, 18, of Peterborough Road, Waltham Forest, east London, who was accused of delivering the fatal wound, denied being involved.\n\nBut his co-accused, 18-year-old Chibuzo Ukonu, of Loughton, Essex, identified Florant as the stabber.\n\nHe told jurors he was also at the scene but had no intention to cause any harm to Mr Spence, let alone an intention to kill.\n\nThe jury deliberated for 21 hours to find Florant guilty of murder and Ukonu guilty of manslaughter last month.\n\nJudge Mark Dennis QC ordered Florant to be detained at Her Majesty's pleasure for at least 18 years and handed Ukonu 14 years in a young offenders' institute.\n\nMr Spence tripped and fell by a table tennis table and was set upon by one of the youths in a 'swift and merciless' attack in front of horrified staff and youngsters.\n\nHe told the pair: 'The whole event had taken less than 90 seconds. Glendon Spence died at the scene from heavy bloody loss.\n\n'The exact motive for the attack is unknown, however the attack has all the hallmarks for organised gang violence.\n\n'This was grave offending of the utmost seriousness. The CCTV captured what was a shocking and cruel attack and one which would have horrified or caused great alarm to anyone that witnessed it.\n\n'You are both young men attracted to and engaged in an urban culture that embraces violence.'\n\nEarlier on Friday, the victim's family described their devastation at the loss of Mr Spence, who hoped to become a motor mechanic.\n\nIn a statement, they told of their 'pity' for his killers, taking comfort from their memories of Mr Spence.\n\nThe court heard how Florant had multiple previous convictions for carrying knives dating back to when he was aged 15.\n\nUkonu also had a conviction for carrying a 12-inch combat knife when he was aged 15.\n\nHe told police at the time: 'Not gonna lie, I got something on me. Brixton is a dangerous place.'\n\nHe was also caught possessing cocaine and heroin with intent to supply.\n\nThe court was told how people in the area of Brixton where the murder took place had taken to wearing body vests because of the 'prevalence of knife crime'.\n\nThe fact the stabbing of Mr Spence was targeted on the leg indicated it was a focused attack, the prosecution suggested.\n\nThe court was told how people in the area of Brixton where the murder took place had taken to wearing body vests because of the 'prevalence of knife crime'\n\nFlorant laughed and shouted up to friends in the public gallery as he was sent down.\n\nDCI Richard Vandenbergh, of Scotland Yard, said: 'This was a premeditated and brutal attack and Glendon's death underlines the vile nature of knife crime and the pain it inflicts of communities.\n\n'Glendon was murdered in a youth club - a venue expected to be a place of safety where they can develop their skills and talents.\n\n'The two males who burst in, each armed with large knives, turned that on its head with their actions which were sadly witnessed by so many other people.'\n\nMr Spence's parents said: 'The killing of our fantastic and much loved son Glendon has shattered us as a family. There is no comfort anywhere and it is hard to accept what has happened.\n\n'Our son was talented and he was unable to fulfil his aspirations to be a mechanic, not through any fault of his own but because of the evil act of these two men.\n\n'Glendon did not know the perpetrators and he had no association with them whatsoever.\n\n'Society will not tolerate what his killers did and we hope these sentences will allow them to recognise the evil they inflicted upon him by stabbing him to death for no reason.'", "description": "Glendon Spence, 23, was fatally stabbed in the thigh, severing his femoral artery, after seeking refuge from two attackers in the Marcus Lipton Youth Centre in Brixton, south London.", "authors": ["William Cole For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/18/19600372-0-image-a-2_1570814208591.jpg", "published_at": "2019-10-11"}