{"pub": "nyt", "url": "https://nytimes.com/2019/09/04/opinion/assault-weapon-ban.html", "downloaded_at": "2019-09-05 00:39:38.574376+00:00", "title": "Opinion | That Assault Weapon Ban? It Really Did Work", "language": "en", "published_at": "2019-09-04", "text": "Recent mass shootings have revived demands for meaningful gun control. But many opponents of a renewed federal ban on assault weapons, led by the National Rifle Association, say the earlier ban, from 1994 to 2004, made no difference. Our new research shows otherwise.\n\nWe found that public mass shootings — which we defined as incidents in which a gunman killed at least six people in public — dropped during the decade of the federal ban. Yet, in the 15 years since the ban ended, the trajectory of gun massacres has been sharply upward, largely tracking the growth in ownership of military-style weapons and high-capacity magazines.\n\nUsing the Mother Jones mass shooting database, we identified the number of gun massacres over a 35-year period. (And following the F.B.I.’s approach, we excluded crimes of armed robbery and gang or domestic violence in evaluating public active shooter incidents.) Compared with the decade before its adoption, the federal assault weapon ban in effect from September 1994 through 2004 was associated with a 25 percent drop in gun massacres (from eight to six) and a 40 percent drop in fatalities (from 81 to 49).\n\nThis decline is plausible because assault weapons are semiautomatic firearms designed for rapid fire and combat use, and large-capacity magazines increase the number of rounds that can be fired without reloading. While the gun lobby prevented the ban from being as effective as it could have been and saddled the law with a 10-year sunset provision, the ban did impede the easy access to the type of lethal weaponry that those intent on mass killing have readily available in most of the country today. (Assault weapons are legal in 43 states; large-capacity magazine s, commonly understood as ammunition-feeding devices holding more than 10 rounds, are legal in 41. )", "description": "Since the ban was lifted in 2004, gun massacres involving military-style weapons are way up.", "authors": ["John Donohue", "Theodora Boulouta"], "top_image": "https://static01.nyt.com/images/2019/09/03/opinion/03Donohue1/03Donohue1-facebookJumbo.jpg"}