{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7597981/Kourtney-Kardashian-hits-OK-indulge-Funyuns-road-trip.html", "downloaded_at": "2019-10-22 13:45:00.587868+00:00", "title": "Kourtney Kardashian hits back that it's OK to indulge in Funyuns when on a road trip", "language": "en", "text": "Kourtney Kardashian picked up Funyuns, Pringles, Cheetos when heading to Palm Springs for sister Kim's 39th birthday party.\n\nAnd the 40-year-old beauty revealed her haul when stopping by a convenience store while in a see through white tank top.\n\nBut one of her followers didn't seem too happy with the snacks as she wrote, 'I didn’t know you ate unhealthy.' Soon after the mother-of-three made a reply.\n\nTreats: Kourtney Kardashian picked up Funyuns, Pringles, Cheetos when heading to Palm Springs for sister Kim's 39th birthday party. But one of her followers didn't seem too happy with the snacks as she wrote, 'I didn’t know you ate unhealthy'\n\nKourtney explained she was en route. 'Road trip sooooo,' said the Poosh founder.\n\nActor Jason Kennedy then joked, 'At least the coconut water balances it out …'\n\nKourtney replied: 'Exactly.'\n\nIn the past Kourtney has said: 'A healthy lifestyle requires balance — allowing yourself to hit the snooze button when you really need it, skipping the gym for quality time with friends, and of course cheat days.\n\nHer reason: Kourtney explained she was en route. 'Road trip sooooo,' said the Poosh founder\n\n'Yes, indulging every once in a while is self-care. Whether you follow a strict diet or not, we all deserve days off. No guilt and no boundaries.'\n\nKourtney sported a risque road trip look in a sheer white bodysuit, as she posted a snap from a convenience store on the way.\n\nShe completed the look with some cotton short shorts and a pair of matching white sneakers.\n\nMeanwhile, the birthday girl opted for a chic black leather look as her road trip ensemble.\n\nThose Cheetos did not ruin her body: On Monday the petite wonder shared this image\n\nKim posted a photo of herself walking across the parking lot in a leather jacket over a hoodie with matching leather pants and stilettos.\n\nKourtney also posted some video to her story of the gorgeous SoCal sunset as they hit the road.\n\nShe posted a video earlier as she and Kim visited their local Ulta to see the brand new KKW Beauty display, which is possibly Kim's best gift yet.\n\nShe found Kim strolling the aisle and feigned excitement, saying: 'Woah, it's Kim Kardashian West!'\n\nSoCal sunset: Kourtney also posted some video to her story of the gorgeous SoCal sunset as they hit the road\n\nKim also posted a photo of the display, featuring a life-size photo of herself, captioned: 'Today is the day!!! I’m so excited that @kkwbeauty is now available at all @ultabeauty stores! This is such a dream come true!!'\n\nDespite it being her birthday, Kim also treated all her friends to individual goody bags filled with all her products.\n\nThe 38-year-old was in Palm Springs for the weekend with her best friends and family.\n\n'Ok, so for my birthday, all my besties are opening up [their goody bags],' she said.\n\nKim was surrounded by ten of her closest friends including sisters Kourtney, 40, and Khloe, 35.\n\nFrom mommy: Kris Jenner, 63, wished Kim a happy 39th birthday on Monday\n\nKhloe was in the middle of the group on the floor wearing a Nike crop top and tights.\n\nThe gift bags included various Skims products including bras and socks as well as her fragrances and a Selfish book.\n\n'So we got perfume, everyone got a Selfish book, new slides and socks,' she said.\n\nKim's birthday trip saw her enjoy a special dinner on Saturday night where she got her makeup done by sister Kylie Jenner.\n\nFollowing the home cooked meal, the group played some rounds of Cards Against Humanity.", "description": "Kourtney Kardashian picked up Funyuns, Pringles, Cheetos when heading to Palm Springs for sister Kim's 39th birthday party. But a follower called her 'unhealthy.'", "authors": ["Heidi Parker For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/21/22/20008258-0-image-a-32_1571691846048.jpg", "published_at": "2019-10-21"}