{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7536071/Bittersweet-portrait-parental-pain-PATRICK-MARMION-reviews-Day-Death-Joe-Egg.html", "downloaded_at": "2019-10-05 07:33:55.074235+00:00", "title": "Bittersweet portrait of parental pain: PATRICK MARMION reviews A Day In The Death Of Joe Egg", "language": "en", "text": "A Day In The Death Of Joe Egg (Trafalgar Studios)\n\nVerdict: Timely Peter Nichols tribute\n\nRating:\n\nMacbeth (Festival Theatre, Chichester)\n\nVerdict: Solid Simm, sluggish show\n\nRating:\n\nPeter Nichols wasn't a household name like his contemporary Harold Pinter, but his plays were much more fun.\n\nFollowing his death last month aged 92, there couldn't be a more fitting tribute to the author, whose works included Passion Play and Privates On Parade, than this revival of Joe Egg: a play from 1967 about a Bristol couple struggling to cope with their severely disabled daughter.\n\nStarring Toby Stephens and Claire Skinner, with Patricia Hodge as an interfering mother-in-law, it's a semi-autobiographical story inspired by Nichols and his wife's struggles with their own child.\n\nBut the joy of the play is that it's not agonising or constipated.\n\nToby Stephens and Claire Skinner star in the theatre production A Day In The Death Of Joe Egg\n\nIt heaves with theatricality, and bursts with desperate humour.\n\nCrucially, it reduces the audience to rapt silence on a very sensitive subject.\n\nAttitudes to disability have changed enormously, but what I found remarkable is how the honesty of Nichols' account leaves all that standing.\n\nWords like cripple, vegetable and spastic are strongly taboo, but the playwright challenges their usage.\n\nMore important, the characters are real people, unedited by political correctness — in particular, Stephens's Brian, a beleaguered teacher who deals with the stress of his highly dependent daughter with schoolboy humour.\n\nLarking about, doing silly Goonish voices, is his survival strategy. It's a barnstorming performance that makes Stephens's not always sympathetic character lovable.\n\nAnd the pain of failure, as a parent and husband, is scored on his face.\n\nThe same goes for Skinner's Sheila, who refuses to give up on him, or her daughter.\n\nImprobably, for modern audiences, she fears the child is her comeuppance for her former promiscuity.\n\nBut these were different times; and Skinner's steely performance makes Sheila as close to a saint as this very earthbound play will allow.\n\nAs the meddling mother-in-law, Patricia Hodge is no less adept at emotional displacement.\n\nRather than speak her feelings, she fusses about the place and gossips.\n\nShe may seem like a comic cliché of the period, but Hodge ensures her wittering about department stores is a thoroughly human foible; a means of suppressing her own fears.\n\nThere are equally sharp cameos from Clarence Smith, as wealthy do-gooder Freddie; and Lucy Eaton, as his breezily self-centred wife, who scoffs that a man in tears gives her the creeps.\n\nIt's as though everyone is trapped inside a social straitjacket in Simon Evans's nuanced production, that absolves the characters as much as they condemn themselves.\n\nThe characters also put themselves forward to be judged by the audience, stepping off the stage to explain their fears.\n\nThe challenge is to love and forgive them as much as Nichols does.\n\nFinally, centre stage, it's the pathos and dignity of Storme Toolis as the silent disabled child, that forms the inscrutable emotional core, and guarantees that A Day In The Death Of Joe Egg is still a poignant play that cheers as much as it chastens.\n\nThings have been quiet on the John Simm front.\n\nThe last meaty part the Life On Mars star got his gnashers into was The Master in Dr Who nearly ten years ago.\n\nNow, he's back as Macbeth in Shakespeare's tragedy.\n\nSimm is perhaps a surprising choice for the warlord who slaughters his way to the Scottish throne.\n\nJohn Simm as Macbeth in Shakespeare's tragedy having previously starred in Life On Mars and Dr Who\n\nHe is a comparatively cerebral actor and, though thoughtful, he didn't blow my socks off. He's anxious, expressive, even edgy.\n\nBut he's also measured, introverted and a teeny bit reserved.\n\nThere are moments when we get the full swivel-eyed possession.\n\nAfter the ghost of Banquo comes to haunt his team-building dinner party we get a fabulous explosion of panic-stricken delusion.\n\nBut I wanted more of the disgust and low regard in which he comes to hold the world — and himself.\n\nDervla Kirwan does supply high-quality rocket fuel as Lady Macbeth.\n\nShe's attentive, calculating and ruthless.\n\nBut she's good value, too, when she has her own breakdown; scrubbing invisible blood from her guilty hands.\n\nOtherwise the action creeps, in a petty pace, from scene to scene in Paul Miller's slick production — and it's not a play that performs well in lower gears.\n\nIt needs to eat the road, or else it stalls.\n\nDancing around a thorny subject\n\nMaster Harold And The Boys (National Theatre, Lyttelton)\n\nVerdict: Uneven apartheid drama\n\nRating:\n\nCan a touching, angry and blood- pumping confrontation about race, respect and decency make for a good play if it takes a full hour of meandering boredom to cut to the chase?\n\nThat's the divide in this revival of Athol Fugard's 90-minute play set in 1950s South Africa.\n\nThe 'boys' of the title, Sam and Willie (Lucian Msamati and Hammed Anima-shaun), provide a great dollop of charisma as two black men working in a cafe owned by a white family.\n\nAs they polish cutlery, and work on the quick-step — Sam knows his dance; Willie is soon entering a competition — the family's son, 'Master Harold', hangs around, chatting.\n\nAlas, Harold (Anson Boon) is nothing short of dreadful. Yes, the character is an oblivious brat: first a hollow show-off and later, a menace.\n\nBut the honking travesty, the evening-ruining mess that you can't escape, is his ludicrous attempt at a South African accent, made worse by a fluorescent scream of a performance.\n\nThink the gestures of Pixar's Woody, but with an accent which veers from Dutch to Cockney.\n\nIt's hard to achieve a winning three-hander if one is just punching you, repeatedly, in the face.\n\nIt almost kills what should be a slow simmer of a drama.\n\nTo avoid looking or listening to Harold, I found myself getting lost in the fake rain splattering on the window, or the very real clock, slowly ticking over the cafe counter.\n\nThe rescue comes from Msamati and Animashaun.\n\nTheir performances are rich, warm, and beautifully detailed.\n\nThe looks they cast between each other; the calm diligence with which they carry on as Harold yelps through some lines, are beautiful to behold.\n\nWhen racial tension finally bubbles to the surface, and boils over into full argument, Msamati gives us thumping, nerve-shaking drama.\n\nIt's an affecting display of fury at not just the idiocy of one small racist boy, but the state of the whole racist country.\n\nThe final image, rage over, cafe drifting away, lights dimming, Sam and Willie perfecting their routine, is tremendously touching.\n\nSuch a dreadful shame it takes so long to get there.\n\nLUKE JONES", "description": "PATRICK MARMION: Peter Nichols wasn't a household name like his contemporary Harold Pinter, but his plays were much more fun.", "authors": ["Patrick Marmion For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/01/19278566-0-image-a-147_1570149439763.jpg", "published_at": "2019-10-04"}