{"pub": "nymag", "url": "https://vulture.com/2019/09/the-great-british-baking-show-season-10-episode-3-recap.html", "downloaded_at": "2019-09-13 18:21:08.311309+00:00", "title": "The Great British Baking Show Recap: Proving Grounds", "language": "en", "text": "The Great British Baking Show Bread Week Season 10 Episode 3 Editor’s Rating 5 stars * * * * * « Previous Next Photo: Netflix\n\nEvery GBBS fan knows that Bread Week is essentially the show’s version of the Upside Down. Not only is the episode almost entirely devoted to savory dishes — which is definitely not the reason I watch this show — but it’s often the place where great bakers trip up and okay bakers finally shine. Why, you may ask? Because bread is part science and part intuition. And without both parts, you’re screwed.\n\nTo start off the show’s most topsy-turvy week, Paul and Prue ask the bakers to create tear-and-share loaves, which for most Americans means monkey bread. But not so in this week’s episode. Most of the bakers assume that because this is Bread Week, they need to go straight for savory flavors.\n\nAmelia’s Chorizo Brunch features bread stuffed with pepper, onions, and garlic that she says will give it a kick, a comment that will later prove to be the understatement of the century. Sophisticated Toddler Henry opts for pesto and chicken, which sends Steph — who apparently works THREE part-time jobs — into a bit of a huff because she’s using pesto, too! Or rather “baa-sil” sauce, which is another word for pesto. Michelle and Phil both decide to put pancetta and cheese into their loaves. Priya skips the meat, but joins in on the cheese train with a jalapeño and Red Leicester loaf, as does Rosie, who doesn’t much care for meat and thinks chili and manchego in a brioche-style bread is just the ticket. Michael rounds out the savory group with Keralan Star Bread, an original recipe, with coconut chutney, paprika, and not as much chili as he used last week, thank goodness.\n\nThree bakers dare to take the candied road less traveled, however. Alice decides to create a bread version of baklava, which she thinks originated in Turkey. (Actually the Ottoman Empire, but let’s not split hairs.) Helena and David both make cinnamon rolls, but very, very different takes. David’s fancy cinnamon swirls with brandied fruit are topped with vanilla buttercream, which Paul gags at. (Why are you the way that you are, Paul?) But Helena, who I think has really grown on all of us, makes cinnamon rolls American-style: Drizzled with globs of sugar glaze and toasted pecans. U-S-A! U-S-A-!\n\nUnfortunately for the producers, all the bakers manage to use their time efficiently, meaning there’s very little footage they can cut together to induce a sense of panic. But the panic is still there, inside the soul of each baker who knows fuck-all about bread. Henry’s overpowering chicken and pesto bread sorely disappoints the judges, as does Steph’s Sun-Dried Tomato and Pesto Star that, while beautifully shaped, comes out “bone dry.” David rounds out the group with cinnamon rolls that are too doughy.\n\nHelena, meanwhile, notches another win for America with her over-the-top cinnamon rolls even if they’re a bit overbaked. Alice’s baklava? Great flavor mixture, but overbaked. And Amelia sends Prue into a coughing fit with her Chorizo Brunch. Prue chokes out that it’s still delicious and Paul says everything in the roll could have been much smaller. Priya, Rosie, Phil, and Michelle get positive feedback as well, but who cares because Michael “The Specs” Chakraverty and his out-of-this-world Keralan Star Bread gets THE FIRST PAUL HOLLYWOOD HANDSHAKE OF THE SEASON. Ooh, it’s on now, folks.\n\nMichael pushes his immense joy deep down and manages to play it pretty cool in the aftermath because this is only the first challenge and men are made in the Technical. The manliest Technical of all time, in fact: The bakers are asked to make eight burger baps, which through context clues we learn is what Britons call “buns.” (This is precisely why we had the Revolutionary War, people.) On top of that, they must make veggie burgers, which Paul insists will only account for about 10 percent of the judging process after last week’s Fig-gate.\n\nThe bakers aren’t given much in the way of instructions and must follow their bread-making instincts to create eight perfect buns, which means proving for 30-40 minutes and doing “maths,” as Steph points out. The veggie burgers involve a little mashing and smashing, but nothing too bad. Phil refuses to be emasculated by these meatless atrocities, however, and make his extra chunky … which promptly lands him in the bottom three between Rosie and Amelia. The latter woman attempts to kill Prue again by putting too much chili in her “Scooby-Doo” burgers. (Big patty, small bun.) Henry, David and Steph take the top three spots.\n\nAfter a brief break, the bakers prepare for their five-hour, bread-scoring Showstopper Challenge. A challenge this long is often a mixed bag. It’s great because the best breads take at least two hours to prove, but the drawback is that with five hours, the bakers feel the need to not only create spectacular scoring, but to do so on three to four different types of bread.\n\nThere are so many different types of breads and flavors going on throughout the Showstopper Challenge that it’s hard to keep up with all of them. Instead, we’ll cover the designs: Amelia, Henry, Michelle, Rosie, Priya, and Steph all make some take on animals or plants. David and Alice — two people who studied abroad and never got over it — create travel-inspired loaves while Phill creates a Winners’ Wreath. And Michael makes a Mediterranean Camp Fire loaf, which as someone who lived through last year’s disastrous pita final I find triggering.\n\nEven with 11 contestants in the race this is, unfortunately, one of those episodes where you’re fairly certain who’s going home by the start of the third challenge, and we suspected (correctly) that that person might be Amelia. It’s sad because she had great energy and a very interesting accent and said “sod it off” a lot. But we’re entering Week Four, and while Paul and Prue aren’t demanding “sheer perfection” quite yet, it’s time to be detail-oriented, something Amelia, and Jamie and Dan before her, lacked.\n\nScoring, or cutting delicate lines into pieces of bread at a depth that’s just deep enough to make an impression, is the epitome of being detail-oriented. Phil, Rosie, Steph, and Michael (who gets crowned Star Baker) prove themselves capable of doing that. Alice, Michelle, and Priya also get either the scoring or the flavors right, though it’s time for Priya to Step. Up. As for the rest of the group — David, Henry, and Helena — they’ve all had their moments of brilliance. How all these dynamics will play out for the show’s first-ever DAIRY WEEK, though, is anyone’s guess.", "description": "The show’s most topsy-turvy week gives us a marathon Showstopper and the season’s first Hollywood Handshake. A recap of ‘Bread Week’, episode 3 of The Great British Bake Off season 10, airing on Netflix as The Great British Baking Show Collection 7.", "authors": ["Nikita Richardson"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/13/13-the-great-british-bake-off.w1200.h630.jpg", "published_at": "2019-09-13"}