{"pub": "fox", "url": "https://foxnews.com/us/north-dakota-man-68-assault-9-year-old-boy", "downloaded_at": "2019-10-15 23:04:36.364445+00:00", "title": "North Dakota man, 68, charged with assaulting 9-year-old boy after being hit by snowball: report", "language": "en", "text": "A 68-year-old North Dakota man is accused of shouting profanities and throwing rocks at a group of children in retaliation for being hit with a snowball before pushing a 9-year-old boy into a truck and smashing his face into the ground, according to a report.\n\nDouglas resident Gordon Van Hassel, 68, is charged with felony aggravated assault of a victim under the age of 12, the Grand Forks Herald reported Monday.\n\nAccording to the charges, Van Hassel was walking his dog by a group of children having a snowball fight when he was apparently hit.\n\nVan Hassel later claimed the kids were harassing him, so he chased them, catching the 9-year-old who he allegedly pushed to the ground and repeatedly kicked, KFYR-TV reported.\n\nCHINESE MAN KILLS 8 CHILDREN IN ATTACK ON FIRST DAY OF SCHOOL: POLICE\n\nThe boy later told authorities he was afraid for his life and passed out during the attack, according to the affidavit. An adult reportedly carried the boy home by sled before he was taken to a hospital in Minot.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nThe assault left him in pain and unable to walk on his left leg, according to a Ward County Sheriff’s deputy.\n\nVan Hassel was being held at the Ward County jail. He was scheduled to appear in court for arraignment Thursday. He faces up to 10 years in prison if he’s convicted.", "description": "A 68-year-old North Dakota man is accused of shouting profanities and throwing rocks at a group of children in retaliation for being hit with a snowball before pushing a 9-year-old boy into a truck and smashing his face into the ground.", "authors": ["Bradford Betz", "Bradford Betz Is An Editor For Fox News. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/DAKOTA.jpg", "published_at": "2019-10-15"}