{"pub": "nytimes", "url": "https://nytimes.com/2019/10/11/nyregion/homeless-murders-nyc-hakki-akdeniz.html", "downloaded_at": "2019-10-11 12:34:16.886314+00:00", "title": "‘I Know the Struggle’: Why Pizzas Were Left at Memorials for 4 Homeless Men", "language": "en", "text": "“I was shaking, so nervous,” he said. “It came out no good. I said, ‘Can I make another one?’”\n\nAfter a few failed attempts, the owner hired him — to wash dishes. That night Mr. Akdeniz slept on a bench across from the restaurant, returning early the next day. The next night, he slept in the basement of the pizza shop’s building.\n\nLater that week, the cook gave him a tip. There was a building in Sunnyside, Queens, where the super had an assistant who did odd jobs and lived rent-free in the basement. The assistant was looking for an assistant — same perks. “The boiler room, you can sleep in the corner,” Mr. Akdeniz was told.\n\nA year later, he had saved enough to move into an apartment with a roommate. He got a new job in early 2003 washing dishes at a restaurant on Ninth Avenue in Hell’s Kitchen. On St. Patrick’s Day, the regular pizza maker didn’t show up to work, and Mr. Akdeniz was promoted on the spot.\n\nHe spent five years there, improving his skills. In 2009, he found a tiny pizza shop in the Lower East Side that was for sale. He had saved up $40,000 by then, and the shop — just an oven with a counter in front of it — cost twice that, but the owner agreed to sell, setting up monthly payments.\n\nMr. Akdeniz immediately fell behind in his first month, then his second and third. The man he owed told him, “Pay me, or I’ll put you in the oven.” Little did the man know that, to save money, Mr. Akdeniz was already sleeping under that oven, locked inside the shop every night until another worker opened a padlocked gate the next day.\n\nThen, a breakthrough. Mr. Akdeniz entered a pizza-making contest in 2010 at the Javits Center. To stand out, he threw and spun his pizza dough after setting it on fire. He won first place.", "description": "Hakki Akdeniz built a pizza chain and has 3.5 million followers on Instagram. But he was once homeless, and returned to the streets this week.", "authors": ["Michael Wilson"], "top_image": "https://static01.nyt.com/images/2019/10/10/nyregion/00homelesspizza01/00homelesspizza01-facebookJumbo.jpg", "published_at": "2019-10-11"}