{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/8/streak-stretches-on-twins-take-16th-straight-playo", "downloaded_at": "2019-10-08 09:59:02.520825+00:00", "title": "Streak stretches on: Twins take 16th straight playoff loss", "language": "en", "text": "MINNEAPOLIS (AP) - The night began with Torii Hunter throwing the ceremonial first pitch to Joe Mauer, energizing the over-capacity crowd gathered for the first postseason game at Target Field since 2010, the year the ballpark opened.\n\nThe evening ended in familiar deflation for the Twins, with two more runners left on base to add to the pile and further frustration and bewilderment bedeviling a franchise and fan base that’s been waiting 28 years and counting for another World Series.\n\nFrom Hunter and Mauer to Eddie Rosario and Mitch Garver, the names and styles have changed. But the results have stayed the same as long as the Twins are stuck with the nemesis New York Yankees in the playoffs.\n\n“That’s a good team, man,” Garver said after the 5-1 defeat Monday night gave the Yankees a sweep of the AL Division Series and stretched the longest postseason losing streak in major league history to 16 games.\n\nThirteen of those are thanks to the Yanks.\n\n“They beat us, you know? They pitched better. They hit better,” designated hitter Nelson Cruz said. “Definitely was a shame.”\n\nThe Twins, who became the first 100-win team swept in the Division Series, matched the North American major sports record set by the NHL’s Chicago Blackhawks from 1975-79 for consecutive postseason losses and dropped to 2-16 against the Yankees in the playoffs. Their last playoff win was the 2004 ALDS opener, when Mauer was a rookie catcher who didn’t play because of a knee injury and Hunter was the star center fielder.\n\nOutscored 23-7 in this series, the Twins batted just .218. After hitting a record 307 homers, they went deep four times in the three games, all solo shots. They were 1 for 12 with runners in scoring position and stranded 11 overall in Game 3, falling to 3 for 28 in the series with 25 runners left on. Eddie Rosario went 3 for 4 for the Twins with a homer leading off the eighth, but he accounted for one-third of the hits.\n\nThough a handful of players took part in the 2017 wild-card loss to the Yankees, this Twins team, from the coaching staff down to the bullpen, carried none of the scars of past postseason failures. Garver was one of the most outspoken players prior to the series about the confidence the team took into the series, and rookie manager Rocco Baldelli echoed those sentiments.\n\nIn the end, they wound up with the same fate as their predecessors, as if there were some type of curse in play. Or perhaps they just keep getting stuck with an unlucky draw for their first opponent. Of these five Division Series defeats, in 2003, 2004, 2009, 2010 and 2019, the Yankees have thrown four 100-win teams at the Twins. New York’s average victory total for those five seasons was 101.\n\n“I don’t think anything affected our guys one bit. Our guys were ready to play. They were excited,” Baldelli said, adding: “This was our absolute best effort. Nothing got in the way of it.”\n\nTypifying this long-running lopsided matchup, almost all the could-go-either-way plays went to the Yankees, leaving the Twins largely shaking their heads at all their near misses.\n\nGleyber Torres homered off Twins starter Jake Odorizzi in the second inning, when the ball barely cleared the dark green wall in left-center.\n\nRosario hit what he thought was a homer to start the bottom of the second, stopping to admire the trajectory for a second, but the ball bounced off the 23-foot right field wall for a double. The Twins loaded the bases with nobody out, but Yankees starter Luis Severino escaped with a popup and a pair of strikeouts. Jake Cave went down looking to end the inning, and in the top of the third his ill-advised, no-chance dive for a line drive by Gio Urshela went for a double.\n\nSure enough, with two outs, after Miguel Sanó had just shifted to his left, Brett Gardner chopped a single into the vacated space past the burly third baseman’s outstretched glove for a 2-0 lead. DJ LeMahieu, batting immediately after Urshela, grounded out on a ball that would’ve been primed for a double play.\n\nA few setbacks for the Twins were out of their hands. With runners at first and third, Garver took what appeared to be ball four on a 3-0 pitch by Severino, but plate umpire Gary Cederstrom called it a strike. Garver whiffed to end that inning.\n\nThe Yankees were impeccable in the field. LeMahieu made a slick leaping catch of a sharp line drive by Marwin Gonzalez to end the fourth. Big right fielder Aaron Judge made a jumping catch on the warning track of a smash by Sanó after a double by Luis Arraez in the sixth. Gregorius made a diving snag of fellow shortstop Jorge Polanco’s line drive for the second out of the ninth with two runners on, flashing a wide smile after preventing the tying run from coming to the plate.\n\nWith the Yankees employing an aggressive shift that had him in shallow right field, Torres slid and scooped a sharp grounder by Rosario with two on in the fifth and managed to throw him out to end the inning. In the seventh, Torres made a slick stop on a grounder by Polanco and flipped to reliever Zack Britton covering first.\n\n“We did a really good job in those situations for 162 games, and it seems like it was just a bad time to have three poor games,” Twins first baseman C.J. Cron said. “Our guys battled all year. I’m super proud of them. I’m super proud to be a Minnesota Twin. It’s just a sour taste to an otherwise really good year.”\n\n___\n\nMore AP MLB coverage: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The night began with Torii Hunter throwing the ceremonial first pitch to Joe Mauer, energizing the over-capacity crowd gathered for the first postseason game at Target Field since 2010, the year the ballpark opened.", "authors": ["The Washington Times Http", "Dave Campbell"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/08/alds_yankees_twins_baseball_50817_c0-203-4853-3032_s1770x1032.jpg?f7c478efa5a60354e45360d6f53d57d4286f332d", "published_at": "2019-10-08"}