{"pub": "yahoo", "url": "https://sg.finance.yahoo.com/news/key-factors-impact-williams-companies-205408724.html", "downloaded_at": "2019-10-25 22:40:26.380203+00:00", "title": "Key Factors to Impact Williams Companies' (WMB) Q3 Earnings", "language": "en", "text": "Williams Companies, Inc. WMB is expected to release third-quarter 2019 results after the closing bell on Wednesday, Oct 30. The current Zacks Consensus Estimate for the to-be reported quarter is a profit of 24 on revenues of $2.1 billion.\n\nLet’s delve into the factors that might have influenced the company’s performance in the September quarter.\n\nFactors to Consider This Quarter\n\nWilliams’ ‘Atlantic-Gulf’ and ‘Northeast G&P’ segments — which collectively represents more than 70% of the company’s adjusted EBITDA — are likely to have performed well in third-quarter 2019. The Atlantic-Gulf unit showed year-over-year improvement of $103 million or 22.6% in adjusted EBITDA in the second quarter, while the company’s Northeast G&P business grew by $64 million or 25%.\n\nThanks to the expansion projects around Transco (the country's largest gas transmission system and Williams’ core project) being placed into service in over the past two years and the additional volumes from these takeaway infrastructures on the back of record drilling activity, the company is likely to have experienced continued strength third-quarter in revenues.\n\nIn particular, the completion of the Atlantic Sunrise project – the biggest expansion project in the history of Transco – is likely to have contributed to substantial incremental fee-based revenue and driven EBITDA growth. Our model estimates third-quarter adjusted EBITDA for the unit to be $540 million, 12.5% above the year-ago revenue of $480 million.\n\nOn the other hand, the Northeast G&P unit is expected to reflect the impact of higher volumes triggered by rising natural gas production from Marcellus and Utica shales. As a proof of this, the Zacks Consensus Estimate for third-quarter Northeast G&P adjusted EBITDA is pegged at $338 million, higher than $281 million reported in the year-ago quarter\n\nHowever, Williams’ extensive natural gas exposure raises its sensitivity to the commodity’s price. In particular, lower gas prices in the third quarter is likely to have had an adverse impact on the volumes and distribution growth potential at Williams Partners, the company's largest income generating business segment.\n\nWhat Does Our Model Say?\n\nThe proven Zacks model does not conclusively show that Williams is likely to beat estimates in the third quarter. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the chances of beating estimates. But that’s not the case here.\n\nYou can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\n\nEarnings ESP: Williams has an Earnings ESP of -3.69%.\n\nZacks Rank: Williams sports a Zacks Rank of 3.\n\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nHighlights of Q2 Earnings & Surprise History\n\nIn the last reported quarter, the Tulsa, OK-based energy infrastructure provider beat the consensus mark on strong contribution from its Atlantic-Gulf and Northeast G&P segments. Williams reported adjusted earnings per share of 26 cents that surpassed the Zacks Consensus Estimate by 3 cents and was 52.9% higher than the year-ago profit.\n\nAs far as earnings surprises are concerned, the midstream player has a mixed record, having gone past the Zacks Consensus Estimate twice in the last four reports. This is depicted in the graph below.\n\nWilliams Companies, Inc. (The) Price and EPS Surprise\n\nWilliams Companies, Inc. (The) Price and EPS Surprise More\n\nWilliams Companies, Inc. (The) price-eps-surprise | Williams Companies, Inc. (The) Quote\n\nStocks to Consider\n\nWhile earnings beat looks uncertain for Williams, here are some firms from the energy space you may want to consider on the basis of our model, which shows that they have the right combination of elements to post earnings beat this season:\n\nNational Oilwell Varco, Inc. NOV has an Earnings ESP of +16% and is Zacks #3 Ranked. The company is anticipated to release earnings on Oct 29.\n\nGulfport Energy Corp. GPOR has an Earnings ESP of +3.57% and a Zacks Rank #3. The company is anticipated to release earnings on Oct 31.", "description": "In Q3, Williams Companies (WMB) is expected to gain from additional volumes from the expansion projects around its core Transco pipeline system.", "authors": ["Nilanjan Choudhury"], "top_image": "https://s.yimg.com/uu/api/res/1.2/2qN5b6LkuZzgrqY_6H.gHQ--~B/aD00MDA7dz02MzU7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/8e6a94b5d9a770904a6c3dec63a9ebc0", "published_at": "2019-10-25"}