{"pub": "independent", "url": "https://independent.co.uk/news/world/americas/us-politics/trump-whistleblower-cia-agent-white-house-ukraine-phone-call-spies-a9122256.html", "downloaded_at": "2019-09-26 23:47:09.988803+00:00", "title": "Trump lashes out at 'spies' behind Ukraine complaint as he is accused of cover-up", "language": "en", "text": "Donald Trump has lashed out at staff who said the White House “locked down” details of his phone call with the Ukrainian president – likening them to spies and alluding to possible punishment.\n\nMr Trump was speaking after congress released parts of a whistleblower’s report, in which an unnamed intelligence agent raised fears that the president was abusing his power by pressing for foreign interference in the 2020 election.\n\nThe report claims that White House aides were ordered to “lock down” evidence of a phone call in which Mr Trump pressed the Ukrainian president to dig up dirt on Joe Biden, the frontrunner to be the Democratic candidate next year.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe author of the report says they did not witness most of the claims personally but relied on information from “multiple” government officials.\n\nNancy Pelosi, the speaker of the House of Representatives who this week triggered an impeachment probe against the president that could see him removed from power, accused the White House of a “cover-up”.\n\nShape Created with Sketch. Everyone Trump has fired or forced out Show all 13 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Everyone Trump has fired or forced out 1/13 John Bolton Trump claimed to have fired Bolton, his national security adviser, while Bolton claimed he offered to resign. An anonymous White House source that Bolton's departure came as a result of the national security adviser working too independently of the president AFP/Getty 2/13 Anthony Scaramucci Scaramucci lasted only six days in his role as Trump's communications director before being fired by John Kelly, the incoming chief of staff Getty 3/13 Jeff Sessions Attorney General Sessions was asked to resign after nearly two years of drawing Trump's ire, most notably with regards to the Mueller Probe Getty 4/13 Rex Tillerson Tillerson, Trump's first secretary of state, was fired after a series of clashes with the president over policy Getty 5/13 James Mattis Mattis served as secretary of defense from the beginning of Trump's administration until retiring on 1 January 2019. However, the president later claimed that he had \"essentially fired\" Mattis Getty 6/13 James Comey Comey was fired as director of the FBI early in Trump's presidency after serving in the role for four years prior. His dismissal is widely thought to have been related to the Russia investigation Getty 7/13 Reince Priebus Priebus, Trump's first chief of staff, was forced out after six tumultuous months AFP/Getty 8/13 David Shulkin Veterans affairs secretary Shulkin claims that he was fired, the White House claims that he resigned Getty 9/13 John Kelly Kelly, Trump's second chief of staff, was forced out after 17 months in office. His departure was a confused affair though it is clear that Trump wanted Kelly out AFP/Getty 10/13 Michael Flynn Flynn lasted 24 days as Trump's national security adviser before being fired for lying to the FBI Getty 11/13 Lee Cisna Cisna served as director of citizen and immigration services between October 2017 and June 2019 before being asked to resign amid a major personnel change in the department of homeland security 12/13 Madeline Westerhout Westerhout served as Trump's personal assistant after leaking private information about his family AFP/Getty 13/13 Mira Ricardel Ricardel was forced out of her role as Deputy National Security Advisor after first lady Melania Trump publicly called for her to be fired 1/13 John Bolton Trump claimed to have fired Bolton, his national security adviser, while Bolton claimed he offered to resign. An anonymous White House source that Bolton's departure came as a result of the national security adviser working too independently of the president AFP/Getty 2/13 Anthony Scaramucci Scaramucci lasted only six days in his role as Trump's communications director before being fired by John Kelly, the incoming chief of staff Getty 3/13 Jeff Sessions Attorney General Sessions was asked to resign after nearly two years of drawing Trump's ire, most notably with regards to the Mueller Probe Getty 4/13 Rex Tillerson Tillerson, Trump's first secretary of state, was fired after a series of clashes with the president over policy Getty 5/13 James Mattis Mattis served as secretary of defense from the beginning of Trump's administration until retiring on 1 January 2019. However, the president later claimed that he had \"essentially fired\" Mattis Getty 6/13 James Comey Comey was fired as director of the FBI early in Trump's presidency after serving in the role for four years prior. His dismissal is widely thought to have been related to the Russia investigation Getty 7/13 Reince Priebus Priebus, Trump's first chief of staff, was forced out after six tumultuous months AFP/Getty 8/13 David Shulkin Veterans affairs secretary Shulkin claims that he was fired, the White House claims that he resigned Getty 9/13 John Kelly Kelly, Trump's second chief of staff, was forced out after 17 months in office. His departure was a confused affair though it is clear that Trump wanted Kelly out AFP/Getty 10/13 Michael Flynn Flynn lasted 24 days as Trump's national security adviser before being fired for lying to the FBI Getty 11/13 Lee Cisna Cisna served as director of citizen and immigration services between October 2017 and June 2019 before being asked to resign amid a major personnel change in the department of homeland security 12/13 Madeline Westerhout Westerhout served as Trump's personal assistant after leaking private information about his family AFP/Getty 13/13 Mira Ricardel Ricardel was forced out of her role as Deputy National Security Advisor after first lady Melania Trump publicly called for her to be fired\n\nIn a day of drama on Capitol Hill, Mr Trump’s intelligence chief gave evidence to two congressional committees. Joseph Maguire, acting director of national intelligence, insisted he had done nothing wrong by not immediately giving the whistleblower’s report to congress, or by showing the complaint to the White House.\n\nBut he refused to say whether he had discussed the matter with Mr Trump, saying he could not disclose details of his conversations with the president.\n\nMr Trump later told reporters that he wanted to find a way to stop the impeachment process “maybe legally, through the courts”.\n\nHe also reportedly made a series of ominous comments about the White House staff who provided information to the whistleblower, at a private meeting.\n\nAccording to the New York Times, he said that anyone who provided information was “close to a spy”.\n\nIndependent news email Only the best news in your inbox Independent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\n“I want to know who’s the person who gave the whistleblower the information, because that’s close to a spy,” the president was quoted as saying. “You know what we used to do in the old days when we were smart with spies and treason, right? We used to handle it a little differently than we do now.”\n\nHe reportedly then referred to the media as “scum”.\n\nThe New York Times also reported that the whistleblower is a male CIA officer who was detailed to the White House. The paper said the nature of his complaint suggested that he is familiar with US foreign policy towards Europe with a sophisticated understanding of Ukraine and some legal knowledge – all of which could reassure politicians about the integrity of his report.\n\nThe complaint itself – which the White House had previously tried to avoid giving to congress – alleges that intelligence staff were alarmed at the nature of Mr Trump’s call to the Ukrainian president, Volodymyr Zelensky, and that aides tried to conceal records of it.\n\nWhite House officials “were deeply disturbed by what had transpired in the phone call”, the complaint reads. “They told me that there was already a ‘discussion ongoing’ with White House lawyers about how to treat the call because of the likelihood, in the officials’ retelling, that they had witnessed the president abuse his office for personal gain.”\n\nThey were allegedly “directed” by lawyers to remove the transcript from the computer system where it would normally be stored.\n\nThe complaint says: “Instead, the transcript was loaded into a separate electronic system that is otherwise used to store and handle classified information of an especially sensitive nature. One White House official described this act as an abuse of the electronic system because the call did not contain anything remotely sensitive from a national security perspective.”\n\nIt is also alleged that Mr Trump’s personal lawyer, Rudy Giuliani, the former mayor of New York City, “is a central figure in this effort”, and that the attorney-general, William Barr, “appears to be involved as well”.\n\nMs Pelosi, whose decision to impeach represents a huge gamble for Democrats ahead of next year’s election, condemned what she called a “cover-up”.\n\nShe said Mr Trump had “betrayed his oath of office, our national security and the integrity” of US elections.\n\nThe president himself unleashed a volley of tweets condemning the report and insisting that the whistleblower only had “second-hand information”, even though their description of the Ukraine telephone call tallies with that put out by the White House this week.\n\nMr Giuliani, whose involvement in Ukrainian matters is coming under increasing scrutiny, told The Atlantic that he was doing nothing inappropriate and should be praised, adding: “When this is over, I will be the hero.”\n\nMeanwhile, a former prosecutor general in Ukraine undermined Mr Trump’s repeated claims that Hunter Biden, son of Joe Biden, was involved in corrupt business practices in the former Soviet republic. Yuri Lutsenko told the Washington Post that he had not broken any Ukrainian laws.\n\nMr Trump has also accused Hunter Biden of corruptly taking $1.5bn (£1.2bn) out of China. Mr Biden’s lawyer has said that his client has not actually received anything from his investment in China. The president has not provided any evidence to back his claims.", "description": "Donald Trump has lashed out at staff who said the White House “locked down” details of his phone call with the Ukrainian president – likening them to spies and alluding to possible punishment. Mr Trump was speaking after congress released parts of a whistleblower’s report, in which an unnamed intelligence agent raised fears that the president was abusing his power by pressing", "authors": ["Phil Thomas", "Chris Riotta"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/26/22/president-donald-trump.jpg", "published_at": "2019-09-26"}