{"pub": "fox", "url": "https://foxnews.com/opinion/dan-gainor-elizabeth-warren-draws-most-attention-from-media-and-candidates-in-democratic-debate", "downloaded_at": "2019-10-16 08:29:01.299032+00:00", "title": "Dan Gainor: Elizabeth Warren draws most attention from media and candidates in Democratic debate", "language": "en", "text": "While there was no clear winner in the debate featuring 12 Democratic presidential candidates Tuesday night, it was clear that Sen. Elizabeth Warren of Massachusetts was seen by the moderators and her fellow candidates as the one to beat.\n\nThat point was evident with time allotted to each candidate. Warren had the most with nearly 23 minutes to answer questions – or about equal to what the bottom three candidates mustered, according to The New York Times.\n\nThere were some advantages to that. John Harwood of CNBC proclaimed “this debate crowning Warren the new 2020 front-runner.”\n\nCNN, NYT SLAMMED FOR AVOIDING CHINA DURING PRESIDENTIAL DEBATE: 'THIS IS LITERALLY A JOKE,' 'SHAMEFUL'\n\nBut former CBS News anchor Dan Rather said that “the stage is more crowded than a Times Square subway stop.” And almost everyone on that stage was targeting Warren.\n\nIt didn’t go well for the senator from Massachusetts. The regular attacks often turned her into a whiny scold.\n\nAs CNN anchor John King later explained: “The candidates on the stage clearly thought it was in their best interest to go after Warren.”\n\nFormer CNN commentator Roland Martin said it even better, noting: “How do we know @ewarren is leading? She has a bullseye on her tonight.”\n\nThe Washington Post sold the debate with a headline sounding like it watched a far-more entertaining contest: “Warren faces first sustained attack in raucous debate.” At least it was right about the attacking.\n\nThe New York Times was more accurate in tone about the tedious three-hour marathon: “Warren Draws Fire From All Sides, Reflecting a Shift in Fortunes in Race.”\n\nCNN host Van Jones reflected on the attacks, calling Warren: “Mortal. Mortal. Somebody grabbed the cape and pulled on it.” Jones explained that the “moderates” struck back, “tired of the woke-enomics.”\n\nPBS White House Correspondent Yamiche Alcindor said it was a “BIG MOMENT” when the “Elizabeth Warren attacks begin.” As she described it: “Warren gives a tough stare” after “Mayor Pete Buttigieg says to Warren: Your signature is to have a plan for everything except health care.”\n\nEven far-left Hollywood director Michael Moore wasn’t entirely happy with Warren’s prescriptions for change. He said: “Senator Warren (whom I love) just said she believes in ‘accountable capitalism’. There is no such thing. The only thing capitalism is accountable to is weath [sic] and more wealth for the wealthy. It’s only mission is to economically enslave the citizenry so the rich can get richer.”\n\nBut there was more to the debate than just attacks on Warren. There were also attacks on President Trump. Of course. CNN, which has done as much as any outlet in America to promote impeachment, began the entire debate with 12 questions on the subject – one easy one for each candidate.\n\nThe result was laughably predictable – all the candidates showed that they hate Trump. The Post’s phrasing was a “unified condemnation of Trump.” Like no one saw that coming.\n\nNBC News Correspondent Mike Memoli called the beginning of the debate “a moment of history,” adding that “1 participant may vote on articles of impeachment. 5 participants would sit as jurors in an impeachment trial.”\n\nThis is sure to please the major media that not only hate Trump but have financial interests in the impeachment. Axios reported that news outlets are “building pop-up newsletters, podcasts, and sections solely to cover the day-to-day developments of the impeachment process.” Those include Vox Media, CNN and The New York Times.\n\nSen. Kamala Harris of California scored one of the night’s few applause lines and news outlets went with her extreme narrative backing abortion, after she said: “And it is not an exaggeration to say women will die, poor women, women of color will die, because these Republican legislatures in these various states who are out of touch with America are telling women what to do with our bodies.”\n\nThe debate was also predictably left-wing. Van Jones asked Sen. Amy Klobuchar of Minnesota a scary post-debate question for Democrats: “And I wonder, are you afraid that the party is going in a direction that is just going to get us killed here in the middle of the country?” Klobuchar responded about the party can “come together,” but it’s the kind of comment that will set the left and media worrying.\n\nAdd it to the amazingly quiet crowd. The Root’s Politics Editor Jason Johnson called it “the quietest audience I've ever seen in a debate.” Trump would have called that “low energy.” He’d have been right.\n\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\n\nEven liberals weren’t always happy with all the candidates, especially the newest entrant into the race. Vox Senior Correspondent Zack Beauchamp made fun of the billionaire who just joined the campaign, but who always seems to wear the same tie. “While Tom Steyer wasted an unconscionable amount of money getting on stage and did absolutely nothing to justify his presence here, his tie is pretty good.”\n\nBustle Deputy News Editor Catherine Thompson took her own shot at his debating style: “Tom Steyer is gesticulating and speaking like he’s a ventriloquist’s dummy carved out of wood.”\n\nBut CNN had Steyer’s back. It initially listed him as a “former hedge fund manager.” That wasn’t nice enough to a guy who buys so much TV advertising. So it somehow got changed to “Businessman.”\n\nBecause CNN is neutral. And not in it for the money.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nAnd Washington Post Opinion Writer Elizabeth Bruenig was equally critical of former Texas Rep. Beto O'Rourke after a few candidates were asked about their age. “i mean look. yes, as you get older, your brain gets worse. but that's just a general trend. look at beto. he's very young and his brain is very bad.”\n\nThere was one especially unusual highlight of the debate. Rep. Tulsi Gabbard of Hawaii bashed the “mainstream media” like she was running in the Republican primary. She explained that The “New York Times and CNN have also smeared veterans like myself for calling for an end to this regime change war.” Those news organizations were the two hosts of the debate.\n\nCLICK HERE TO READ MORE BY DAN GAINOR", "description": "While there was no clear winner in the debate featuring 12 Democratic presidential candidates Tuesday night, it was clear that Sen. Elizabeth Warren of Massachusetts was seen by the moderators and her fellow candidates as the one to beat.", "authors": ["Dan Gainor", "Dan Gainor Is The Vice President For Techwatch", "Business", "Culture At The"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/14/694940094001_6094784589001_6094789741001-vs.jpg", "published_at": "2019-10-16"}