{"pub": "investingcom", "url": "https://cryptopotato.com/72-see-bitcoin-price-going-lower-but-it-might-be-positive", "downloaded_at": "2019-09-27 15:07:51.879604+00:00", "title": "72% See Bitcoin Price Going Lower: But It Might Be Positive", "language": "en", "text": "The latest decline in Bitcoin’s price had the community discussing its future once again. Naturally, different polls started to pop up, asking people about their opinion on whether the pain is over or there’s more coming. One of those which got a fair amount of voters has it that we’re going lower. However, it’s perhaps worth noting that almost always when we see a majority of the kind thinking one thing, Bitcoin does the exact opposite. So, is the negative sentiment actually a good thing?\n\n72% Say Bitcoin’s Price Will Go Lower\n\nA recent Twitter poll initiated by early blockchain proponent and popular cryptocurrency commentator Alex Saunders asked people if Bitcoin will go any lower, following the latest declines.\n\n73% of the voters, as of the time of this writing, think that we will see lower prices.\n\nWhile there are 9 more hours left to vote, it is currently clear that the sentiment is fairly negative and that people expect lower prices to come.\n\nThat’s perhaps to be expected. After all, Bitcoin lost upwards of $2,000 in a few short days and we saw major supports being shattered along the way. At the time of this writing, Bitcoin is trading at around $8,000 and is 4% down in the past 24 hours. The entire cryptocurrency market is in the red, as the majority of mid- and large-cap altcoins are also bleeding out.\n\nOne of the things that definitely need noting is that Tether (USDT), the most popular stable coin, has unseated Bitcoin Cash and is currently the fourth-largest cryptocurrency.\n\nIs This A Bad Thing, Though?\n\nCommunity sentiment is undoubtedly something to be considered and not to be disregarded. However, the way it should be interpreted is arguable.\n\nAs properly outlined by one of the commentators in the above poll, if this question was asked before the surge, people would have probably answered that we are going higher.\n\nMoreover, we’ve seen it countless times before – Bitcoin does the exact opposite of what the majority of retail investors tend to believe. For example, before the much-anticipated launch of Bakkt, people thought that this would pump up the price as it provides a regulated solution and a gateway for institutional investors.\n\nAs Cryptopotato reported, however, Bitcoin actually lost a substantial chunk of its value in less than an hour on the date of Bakkt’s launch.\n\nThere’s another recent example when altcoins finally started to get some breathing room and actually caused Bitcoin’s dominance to drop. A lot of people thought that this would mark the beginning of a new, long-awaited altcoin season. Yet, a few days later, we can see a lot of them dropping massively.\n\nIn other words, community sentiment is definitely open to interpretation and it’s not something that should be used as a trading foundation. It’s important to keep what everyone thinks in mind but always do your own thorough research.\n\nBe the first to know about our price analysis, crypto news and trading tips: Follow us on Telegram or subscribe to our weekly newsletter.\n\n", "description": "The latest decline in Bitcoin’s price had the community discussing its future once again. Naturally, different polls started to pop up, asking people", "authors": ["George Georgiev", "View All Posts George Georgiev", "About The Author", "Georgi Georgiev Is A Seasoned Writer With Over Two Years Of Experience Writing About Blockchain", "Cryptocurrencies. Georgi'S Passion For Bitcoin", "Cryptocurrencies Bloomed In Late", "He Hasn'T Looked Back Since. Crypto S Technological", "Economic Implications Are What Interest Him Most", "He Has One Eye Turned To The Market Whenever He S Not Sleeping."], "top_image": "https://cryptopotato.com/wp-content/uploads/2018/12/bitcoin1002-min.jpg", "published_at": "2019-09-27"}