{"pub": "cbs", "url": "https://cbsnews.com/news/heather-gumina-found-dead-california-mothers-remains-found-2-months-after-she-vanished-husband-arrested", "downloaded_at": "2019-09-10 23:27:55.900025+00:00", "title": "California mother found dead 2 months after she vanished; husband arrested", "language": "en", "text": "California authorities say they have found what they believe to be the remains of a missing mother two months after she disappeared. CBS Sacramento reported that the discovery of El Dorado County woman Heather Gumina prompted a homicide investigation by the county sheriff's office, which led to the arrest of her husband.\n\nSheriff office officials say her 44-year-old husband Anthony Gumina was arrested Friday on suspicion of felony domestic violence and first degree murder. Authorities served him with a no bail warrant for domestic violence and a search warrant.\n\nPolice say the human remains were discovered during the search in the Pleasant Valley area east of Sacramento. Gumina and her car were reported missing in July.\n\nHeather Gumina CBS Sacramento\n\nAuthorities say they found her car weeks later in El Dorado County.\n\nCBS Sacramento spoke with Heather Gumina's mother. She says she is waiting for her daughter's autopsy results to be completed.\n\nAnthony Gumina's family spoke out, claiming he is not responsible for his wife's death. Gumina's first cousin, Robert Shawaluk, says he grew up with Gumina.\n\n\"The truth will come out. It will come out. Tony is not the murderer, he's not,\" Shawaluk said. \"Domestic violence is a far away crime from murder. Did they have a rough marriage? Yes. Did he love her? Yes, very much so.\"\n\nThe El Dorado County Sheriff's Office says Heather's remains were found in Pleasant Valley, but won't release exactly where.\n\nAnthony Gumina is not the father of any of her three children, CBS Sacramento reported.", "description": "Discovery of El Dorado County woman Heather Gumina prompted a homicide investigation by the county sheriff's office, which led to the arrest of her husband", "authors": [], "top_image": "https://cbsnews1.cbsistatic.com/hub/i/r/2019/09/10/1713c50e-48af-43a7-be8e-16a5b3f8b602/thumbnail/1200x630/3761da00967c2a50f9841b0beb91f632/heather-gumina-ecso.jpg", "published_at": "2019-09-10"}