{"pub": "independent", "url": "https://independent.co.uk/sport/general/boxing/anthony-joshua-concussion-tyson-fury-trainer-ben-davison-rob-mccracken-a9103771.html", "downloaded_at": "2019-09-13 11:16:39.296342+00:00", "title": "Tyson Fury trainer Ben Davison defends Rob McCracken over Anthony Joshua ‘concussion’ revelation", "language": "en", "text": "Tyson Fury’s trainer Ben Davison has defended Rob McCracken after the storm over his concussion revelation concerning Anthony Joshua.\n\nThe Team GB coach admitted to knowing the former world heavyweight champion was “concussed” after the third round of his fight with Andy Ruiz Jr in June with brain injury charity Headway heavily criticising his revelation.\n\nJoshua persevered despite suffering two knockdowns in the third before eventually being stopped in the seventh by the Mexican-American to lose his world titles in a stunning upset.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nAfter allowing AJ to continue, McCracken has come under fire, but Davison believes every fighter who suffers a knockdown may suffer some form of concussive effect, making the trainer’s job difficult.\n\n“I don’t think the people who have criticised Rob have any knowledge or experience of boxing,” Davison told BBC Sport.\n\nShape Created with Sketch. September top 10 pound-for-pound boxers in the world Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. September top 10 pound-for-pound boxers in the world 1/11 Who is the best pound-for-pound boxer in the world? The ranking of The Independent's 10 best male boxers on the planet. Take a look through to see who comes out on top. AP 2/11 10. Manny Pacquiao (62-7-2) The Filipino looked sensational to outpoint Keith Thurman, flooring the American and rolling back the years at 40 years old to confirm himself as the No 3 welterweight in the world at worst. Considering the illustrious names on his resume, a place inside the top 10 pound-for-pound list and a world class win this year confirms his place here. AP 3/11 9. Juan Francisco Estrada (39-3-0) The two-weight world champion grabbed the lineal super flyweight title against Sor Rungvisai to snatch his pound-for-pound status and the WBC gold. Getty Images 4/11 8. Mikey Garcia (39-1-0) Despite coming up short against Errol Spence in their welterweight bout, Garcia is still a modern great as a four-weight world champion. Getty Images 5/11 7. Gennady Golovkin (38-1-1) Despite suffering the first loss of his career against Canelo Alvarez, Golovkin's stellar career keeps him in our rankings. Getty Images 6/11 6. Errol Spence (25-0-0) After his impressive win over Garcia in which he didn't drop a round, Spence added another big name to his record. Shawn Porter will be next, to unify the belts and perhaps further close the gap between himself and rival Terence Crawford in the P4P standings. Getty Images 7/11 5. Oleksandr Usyk (16-0-0) The undisputed, undefeated, unified cruiserweight world champion moves up in weight, but injury has delayed his debut against Carlos Takam. Getty Images 8/11 4. Naoya Inoue (18-0-0) The man nicknamed the 'monster' destroyed Emmanuel Rodriguez in two rounds to win the IBF world bantamweight title, elevating his status as one of the world's most dangerous fighters. Getty Images 9/11 3. Terence Crawford (35-0-0) Another three-weight world champion, Crawford enters our top three and reaffirmed his place as one of the sport's greats after a knockout win against Amir Khan. Getty Images 10/11 2. Canelo Alvarez (52-1-2) One loss and a whole heap of controversy but Canelo's record is one to be celebrated, a three-weight world champion and still just 28. The biggest star in the sport and an impressive win over Daniel Jacobs cements his standing, arguably has a claim to the throne, but he just misses out here. Getty Images 11/11 1. Vasyl Lomachenko (14-1-0) There can only be one. The king of the amateur game has stepped up to become the king of the professionals. Just 15 fights into his career and despite one career defeat, the current unified lightweight world champion sets records for days. Loma won a world title in his third fight, became a two-weight champion in his seventh, and a three-weight champion in his twelfth fight. The king. Less magic against a brave Luke Campbell, but more brutality, slashing body shots and exquisite balance and movement. Who's next? Commey, Lopez, Davis? Getty Images 1/11 Who is the best pound-for-pound boxer in the world? The ranking of The Independent's 10 best male boxers on the planet. Take a look through to see who comes out on top. AP 2/11 10. Manny Pacquiao (62-7-2) The Filipino looked sensational to outpoint Keith Thurman, flooring the American and rolling back the years at 40 years old to confirm himself as the No 3 welterweight in the world at worst. Considering the illustrious names on his resume, a place inside the top 10 pound-for-pound list and a world class win this year confirms his place here. AP 3/11 9. Juan Francisco Estrada (39-3-0) The two-weight world champion grabbed the lineal super flyweight title against Sor Rungvisai to snatch his pound-for-pound status and the WBC gold. Getty Images 4/11 8. Mikey Garcia (39-1-0) Despite coming up short against Errol Spence in their welterweight bout, Garcia is still a modern great as a four-weight world champion. Getty Images 5/11 7. Gennady Golovkin (38-1-1) Despite suffering the first loss of his career against Canelo Alvarez, Golovkin's stellar career keeps him in our rankings. Getty Images 6/11 6. Errol Spence (25-0-0) After his impressive win over Garcia in which he didn't drop a round, Spence added another big name to his record. Shawn Porter will be next, to unify the belts and perhaps further close the gap between himself and rival Terence Crawford in the P4P standings. Getty Images 7/11 5. Oleksandr Usyk (16-0-0) The undisputed, undefeated, unified cruiserweight world champion moves up in weight, but injury has delayed his debut against Carlos Takam. Getty Images 8/11 4. Naoya Inoue (18-0-0) The man nicknamed the 'monster' destroyed Emmanuel Rodriguez in two rounds to win the IBF world bantamweight title, elevating his status as one of the world's most dangerous fighters. Getty Images 9/11 3. Terence Crawford (35-0-0) Another three-weight world champion, Crawford enters our top three and reaffirmed his place as one of the sport's greats after a knockout win against Amir Khan. Getty Images 10/11 2. Canelo Alvarez (52-1-2) One loss and a whole heap of controversy but Canelo's record is one to be celebrated, a three-weight world champion and still just 28. The biggest star in the sport and an impressive win over Daniel Jacobs cements his standing, arguably has a claim to the throne, but he just misses out here. Getty Images 11/11 1. Vasyl Lomachenko (14-1-0) There can only be one. The king of the amateur game has stepped up to become the king of the professionals. Just 15 fights into his career and despite one career defeat, the current unified lightweight world champion sets records for days. Loma won a world title in his third fight, became a two-weight champion in his seventh, and a three-weight champion in his twelfth fight. The king. Less magic against a brave Luke Campbell, but more brutality, slashing body shots and exquisite balance and movement. Who's next? Commey, Lopez, Davis? Getty Images\n\n“When a fighter goes down I would imagine that has some form of concussive effect every time.\n\n“If Rob is to get pulled up and blamed or criticised then I need criticising too because Tyson got knocked down against Deontay Wilder in round nine and 12 and I allowed it to carry on. So if he is getting criticised I need it as well.”\n\nDavison is training the Gypsy King for his fight against Otto Wallin on Saturday.\n\nShould the Brit emerge victorious, he is set to have another crack at WBC world champion Deontay Wilder, having fought to a draw in last year’s thrilling first fight.", "description": "Tyson Fury’s trainer Ben Davison has defended Rob McCracken after the storm over his concussion revelation concerning Anthony Joshua.", "authors": ["Jack Rathborn"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/12/09/gettyimages-1153145961.jpg", "published_at": "2019-09-13"}