{"pub": "cointelegraph", "url": "https://cointelegraph.com/news/us-sec-halts-ton-launch-over-17b-ico-highest-level-action-yet", "downloaded_at": "2019-10-13 00:15:48.461111+00:00", "title": "US SEC Halts TON Launch Over $1.7B ICO — Highest-Level Action Yet?", "language": "en", "text": "Late Friday, the United States Securities and Exchange Commission (SEC) announced that it is suing two offshore entities, Telegram and its wholly owned subsidiary, TON Issuer, for holding an unregistered token sale.\n\nAccording to the complaint filed in the federal district court in Manhattan on the same day, Telegram sold approximately 2.9 billion crypto tokens, called Grams (GRM) to 171 buyers for a total of $1.7 billion. Around a quarter of that sum, $424.5 million, allegedly belonged to 31 purchasers based in the U.S.\n\nAs a result, the SEC has obtained a temporary restraining order against Telegram and TON, seeking “certain emergency relief,” as well as permanent injunctions, disgorgement with prejudgment interest and civil penalties. Now, the official Telegram channel for TON investors is suggesting that the launch, scheduled for Oct. 31, could be postponed. So, what is happening with the largest private initial coin offering (ICO) in history?\n\nBrief introduction to TON\n\nGRM is a native currency of Telegram Open Network (TON), a blockchain platform aimed at facilitating payments and hosting decentralized applications (DApps) beyond Visa’s scalability levels. The project is developed by Telegram, an open-source encrypted messenger lead by two Russian entrepreneurial brothers, Pavel and Nikolai Durov, who fled their native country. TON will ostensibly be integrated into the app, which boasts over 200 million users worldwide and is widely popular within the blockchain and cryptocurrency community.\n\nAccording to third-party research, TON has the potential to serve as a gateway for crypto assets and related apps to “bank the unbanked” as well as become the first discovery platform for Web 3.0 applications — “akin to the App Store for Web 2.0.”\n\nTON saw one of the most successful ICOs in the industry. In 2018, Telegram raised almost $1.7 billion in two private token sale rounds, held in February and March. According to the documents Pavel Durov filed with the SEC, only those investing a minimum of $1 million were allowed to partake in the TON sale. The offering was limited to accredited investors in order to minimize the scrutiny from U.S. regulators.\n\nIn early October, Telegram published the entire TON source code on Github and announced that the launch of its long-awaited blockchain project would be scheduled for the end of the month. Additionally, the company revealed that all investors had been provided with TON key generation software and were to receive their GRM tokens by Oct. 16.\n\nAdditionally, on Oct. 8, Telegram released the terms of use for its native cryptocurrency wallet, Grams Wallet, which is designed to be paired with TON. The company simultaneously stressed that it has no control over the blockchain. Those terms also distanced the company from regulations, stating “we are not responsible for determining whether taxes apply to any transactions you make using the Services or for collecting, reporting, withholding or remitting any taxes arising from any virtual currency transactions.”\n\nICO troubles: Unsolicited GRM sale in July, SEC’s probe\n\nThe first problems concerning the TON token sale surfaced in July, when Gram Asia — reportedly the largest holder of Telegram‘s Gram tokens in the region — started selling rights to its GRM holdings in partnership with Japan-based crypto exchange Liquid at $4.00 per token, thus tripling the original $1.33 sale price.\n\nApparently, the sale — which TON did not sanction — contradicted the token purchase contract. As a TON investor shared with Cointelegraph at the time, all buyers had explicitly agreed not to let go of their ownership rights prior to the launch and were not allowed to:\n\n“ENTER INTO ANY swap or other AGREEMENT THAT TRANSFERS, in whole or in part, ANY OF THE ECONOMIC CONSEQUENCES OF OWNERSHIP OF THE INVESTMENT CONTRACT represented by this Purchase Agreement or any Tokens.”\n\nNow, just a couple of weeks prior to the TON release, the SEC has stepped in with a restraining order, halting the token offering. The regulator’s complaint alleges that Telegram and its TON subsidiary did not register the sale of the GRM token, which the SEC deems to be a security.\n\nBecause the Securities Act of 1933 requires that all securities be registered with the SEC, the agency considers the sale of GRM tokens “unlawful.” Notably, according to public documents from 2018, Telegram had informed the SEC that both of its $850 million offerings were supposedly made under Rule 506(c) and/or Regulation S under the Securities Act of 1933. Essentially, that means that because GRM tokens were sold only to accredited investors, the offering was not required to be registered with or qualified by the SEC.\n\nHowever, it now seems that the SEC is not convinced. “Telegram committed to deliver Grams to the Initial Purchasers in conjunction with the launch of the TON Blockchain by no later than October 31, 2019 and it plans to sell millions of additional Grams at the same time,” the complaint reads. “As of October 11, 2019, Telegram has not filed a registration statement with the SEC for this planned offering of securities.” Steven Peikin, co-director of the SEC’s division of enforcement, claimed:\n\n“Telegram seeks to obtain the benefits of a public offering without complying with the long-established disclosure responsibilities designed to protect the investing public. We have repeatedly stated that issuers cannot avoid the federal securities laws just by labeling their product a cryptocurrency or a digital token\"\n\nThe agency highlighted that once the GRM tokens are released, by no later than Oct. 31, their purchasers and Telegram “will be able to sell billions of Grams into U.S. markets,” therefore continuing the unregistered token sale. Stephanie Avakian, the other co-director of the SEC’s enforcement division, said:\n\n“Our emergency action today is intended to prevent Telegram from flooding the U.S. markets with digital tokens that we allege were unlawfully sold.”\n\nTelegram’s response\n\nTelegram and TON did not respond to Cointelegraph’s request for comment on the complaint. However, TON Board, a private channel created “by investors and for investors in the Telegram Open Network (TON) as well as for future major holders of Grams,” wrote:\n\n“Due to the increased level of regulatory uncertainty we take a break to analyze new information and adapt our policies. TON Board will be with you again once we have more clarity on the legal status of the TON and Gram as well as permitted type of analysis that may be published on them. We are looking forward to sharing more information with you as soon as it’s possible.”\n\nTON Board has also deleted all previous messages from its channel.\n\nExperts: U.S. regulators are taking on crypto actors with renewed vigor\n\nInternet attorney and cybersecurity law professor Andrew Rossow believes that by putting the brakes on the TON sale, the SEC is showing it will no longer accept token offerings skirting securities regulations. He told Cointelegraph:\n\n“The SEC isn’t playing around. It’s time these companies recognize this. It’s been very upfront and clear for several years now that most tokens offered by these companies qualify as securities and must comply with federal regulations.”\n\nAccording to Rossow, the SEC’s current enforcement action against Telegram is the highest-level action taken to date, and it will potentially jeopardize the company’s ability to continue selling its tokens abroad in other jurisdictions. “This means this is far from over and will have some legal ramifications for Telegram and consequences for its shortcutting,” the legal expert told Cointelegraph, elaborating:\n\n“This current action will do two things—legally establish the standard and seriousness the SEC has for token offerings and force the U.S. courts to now take a clearer stance in the world of digital monies and security offerings.”\n\nThe SEC’s intervention is happening against the backdrop of increasing scrutiny showcased by U.S. regulators, notes Selva Ozelli, international tax attorney and CPA.\n\nAs Ozelli pointed out, on the same day the SEC started its probe into the TON sale, the U.S. Commodity Futures Trading Commission, the Financial Crimes Enforcement Network, and the SEC issued a joint statement to remind people — from both offshore and the U.S. — who are engaged in activities involving digital assets of their Anti-Money Laundering and Countering the Financing of Terrorism obligations under the Bank Secrecy Act. “Such persons need to also comply with U.S. tax laws, since U.S. regulators have jurisdiction over such entities,” Ozelli told Cointelegraph.\n\nIt is yet another piece of evidence of U.S. financial watchdogs attempting to regulate coin issuances for any local markets, Robert W. Wood, a tax lawyer of San Francisco-based Wood LLP, agreed. “On the tax side, there is increasing evidence there too that the IRS is gearing up and pushing harder,” he told Cointelegraph.\n\nThe court has ordered the defendants (TON Issuer and Telegram) to deliver “any opposing papers” no later than Oct. 18. Additionally, its representatives have been summoned to argue its case in court on Oct. 24. Until then, the judge has warned Telegram against any ongoing or future violations, “including but not limited to by delivering Grams to any person or entity or taking any other steps to effect any unregistered offer or sale of Grams.”", "description": "The SEC is suing Telegram over the $1.7 billion ICO, is it the mark a new wave of regulatory scrutiny on the U.S. market?", "authors": ["Stephen O'Neal"], "top_image": "https://images.cointelegraph.com/images/740_aHR0cHM6Ly9zMy5jb2ludGVsZWdyYXBoLmNvbS9zdG9yYWdlL3VwbG9hZHMvdmlldy8zOTczNWFiOTVkZjcwZDAxOTkwODkwYmNlZDljM2EyYy5qcGc=.jpg", "published_at": "2019-10-12"}