{"pub": "nytimes", "title": "Opinion | Why Has Trump’s Exceptional Corruption Gone Unchecked?", "url": "https://nytimes.com/2019/09/02/opinion/trump-corruption-drain-the-swamp.html", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:04:39.387466+00:00", "text": "In a recent MSNBC series, “American Swamp,” for example, stories like the scenarios above are just consecutive segments. Elizabeth Warren and Bernie Sanders talk about a “rigged system” in which Trumpian corruption is only the most extreme manifestation of the distortion of democracy by wealth. Search for the phrase “Donald Trump promised to ‘drain the swamp’ but” and you’ll find dozens of mainstream articles that take seriously the idea that he actually set out to reform politics but, like naïve reformers before him, was dragged down into the fetid tide pool himself.\n\nIt’s certainly true that there’s corruption up and down American public life, and not just in campaign finance and lobbying. It also exists in think tanks, corporate governance, pharmaceutical marketing, higher education, the regulatory system, even philanthropy. The extraordinary concentration of wealth in this new Gilded Age, and the tilt of public policy in its favor, is itself evidence of corruption. It’s also true that Mr. Trump is not singular and that versions of his plunder can be found in more banal form across the spectrum of political vice — like the fact that two Republican members of Congress are under indictment.\n\nBut we shouldn’t lose sight of the profound differences between the two scenarios above, and all the little corruptions that look more like the first case than the case of President Trump. The compromised behavior of legislators who have limited choices about how to raise money is built into the way we’ve structured elections. “Good people trapped in a bad system,” my old boss, former Senator Bill Bradley, used to say, with perhaps more generosity than was merited.\n\nThe key distinction is between systems that invite or encourage corruption — such as by making legislators dependent on donors — and individual acts in which politicians or regulators choose to elevate private interests, or their own, over the public interest. Failing to acknowledge that distinction will make it difficult to build the case against the extreme and unprecedented corruption of Mr. Trump and his allies.\n\nWe should expect and demand that politicians do all they can to avoid the first form of corruption: Pursue a base of small donors, avoid fund-raising events and “call time,” minimize meetings with professional lobbyists, seek out information on all sides of an issue. But that’s easier for some than others. While Alexandria Ocasio-Cortez, nationally famous and in a safe Democratic district, can avoid active fund-raising and devote more time to constituents and committee work, her little-known colleagues from swing districts, facing tough races for re-election, have few alternatives but to attend those fund-raisers in law-firm conference rooms and fancy homes.", "description": "“Drain the swamp” suggests that all political corruption is the same. It isn’t, and the distinctions matter.", "authors": ["Mark Schmitt"], "top_image": "https://static01.nyt.com/images/2019/09/02/opinion/02Schmidt/02Schmidt-facebookJumbo.jpg"}