{"pub": "yahoo", "url": "https://sg.finance.yahoo.com/news/defense-stock-roundup-txt-lmt-144502244.html", "downloaded_at": "2019-10-25 16:47:31.101498+00:00", "title": "Defense Stock Roundup: TXT, LMT, UTX Post Impressive Q3 Earnings", "language": "en", "text": "Following impressive Q3 numbers, the major indices of the Aerospace-Defense space ended in the green over the trailing five trading sessions. Notably, the S&P 500 Aerospace & Defense (Industry) index rose 2%, while the Dow Jones U.S. Aerospace & Defense index gained 3% in the aforementioned time period.\n\nIn the past week, quarterly results from a number of Aerospace-Defense majors namely, Textron Inc. TXT, Lockheed Martin Corp. LMT, The Boeing Company BA , United Technologies, Corp. UTX , Northrop Grumman Corp. NOC, and General Dynamics Corp. GD and Raytheon Company RTN drew investors’ focus.\n\nRecap of Past Week’s Important Stories\n\n1. Textron’s third-quarter 2019 earnings from continuing operations of 95 cents per share surpassed the Zacks Consensus Estimate by 11.8% and also increased 55.7% on a year over year basis. However, quarterly revenues of $3,259 million fell short of the Zacks Consensus Estimate by 2.7%. However, the top line rose 1.8% year over year.\n\n\n\nThe company’s cash inflow from operating activities amounted to $238 million at the end of the third quarter compared with cash inflow of $319 million at the end of the prior-year period.\n\n\n\nTextron slashed its guidance for 2019 (read more: Textron's Q3 Earnings Beat Estimates, Revenues Miss).\n\n\n\n2. Lockheed Martin’s third-quarter 2019 earnings of $5.66 per share surpassed the Zacks Consensus Estimate by 12.5% and improved 10.1% on a year-over-year basis. Its net sales amounted to $15.17 billion, which outshined the Zacks Consensus Estimate by 1.3% and increased 6% year over year.\n\n\n\nLockheed Martin ended the third quarter (on Sep 29, 2019) with $137.4 billion in backlog, up 0.5% from $136.7 billion at the end of second-quarter 2019.\n\n\n\nThe company’s cash from operations at the end of third-quarter 2019 amounted to $5.82 billion compared with $0.92 billion a year ago. For 2019, Lockheed Martin partially raised its financial guidance (read more: Lockheed Martin Beats on Q3 Earnings, Ups '19 EPS View).\n\n\n\n3. Boeing’s adjusted earnings of $1.45 per share for third-quarter 2019 missed the Zacks Consensus Estimate by 28.9% and also declined 59% on a year-over-year basis. Its revenues amounted to $19.98 billion, which surpassed the Zacks Consensus Estimate by 3.3%. The top line however plunged 21% year over year.\n\n\n\nThe company’s backlog at the end of third-quarter 2019 slipped to $470 billion from $474 billion at the end of second-quarter 2019.\n\n\n\nBoeing’s operating cash outflow at the end of the third quarter was $0.26 billion against cash inflow of $12.38 billion at the end of third quarter of 2018 (read more: Boeing Q3 Earnings Miss, Down Y/Y on Lower 737 Deliveries).\n\n\n\n4. United Technologies’ third-quarter 2019 adjusted earnings of $2.21 per share surpassed the Zacks Consensus Estimate of $2.03. The bottom line was also higher than the year-ago figure of $1.93. Its revenues came in at $19,496 million, up 18.1% year over year. The top line also outpaced the consensus estimate of $19,313 million.\n\n\n\nDuring the reported quarter, the company generated $2,490 million cash from operating activities compared with $1,762 million reported a year ago.\n\n\n\nThe company revised 2019 earnings guidance to $8.05-$8.15 per share from $7.90-$8.05 projected earlier (read more: United Technologies Q3 Earnings & Revenues Top, Up Y/Y).\n\n\n\n5. Northrop Grumman’s third-quarter 2019 earnings of $5.49 per share surpassed the Zacks Consensus Estimate by 15.8%. However, the bottom line declined 22.8% on a year over year basis. Its total sales of $8,475 million missed the Zacks Consensus Estimate by 0.83%. However, sales grew 4.8% year over year.\n\n\n\nThe company’s total backlog at the end of third-quarter 2019 was $65 billion.\n\n\n\nIts net cash inflow from operating activities as of Sep 30, 2019 was $1,833 million compared with $1,450 million as of Sep 30, 2018 (read more: Northrop Grumman Beats on Q3 Earnings, Ups '19 EPS View).\n\n\n\n6. General Dynamics’ third-quarter 2019 earnings from continuing operations of $3.14 per share beat the Zacks Consensus Estimate by 2.6% and also improved 10.2% year over year. Its third-quarter revenues of $9,761 million surpassed the Zacks Consensus Estimate by 0.82% and grew 7.3% on a year-over-year basis.\n\n\n\nThe company’s total backlog at the end of third-quarter 2019 was $67.4 billion.\n\n\n\nIn the first nine months of 2019, the company’s cash provided by operating activities was $587 million compared with $1,081 million in the year-ago period (read more: General Dynamics' Q3 Earnings Beat, Revenues Rise Y/Y).\n\n\n\n7. Raytheon’s third-quarter 2019 earnings per share of $3.08 from continuing operations surpassed the Zacks Consensus Estimate by 8.1% and improved a solid 36.9% on a year-over-year basis. Its third-quarter sales of $7,446 million increased 9.4% year over year and exceeded the Zacks Consensus Estimate by 2.6%.\n\n\n\nThe company’s bookings totaled $9,439 million compared with $8,710 million in the year-ago quarter, reflecting an improvement of 8.4%.\n\n\n\nCash flow from operating activities amounted to $1,690 million at the end of third-quarter 2019 compared with $995 million at the end of third-quarter 2018. Raytheon partially raised its financial guidance for 2019 (read more: Raytheon Q3 Earnings Top, Improve Y/Y, EPS View Up).", "description": "Aerospace-Defense market indices reflect strong growth, buoyed by strong quarterly figures reported by majority of the defense players.", "authors": ["Zacks Equity Research"], "top_image": "https://s.yimg.com/uu/api/res/1.2/GiRWZGVnaKtzz0nfXIVisA--~B/aD02MDA7dz05MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-us/zacks.com/bcbf530be3d483045490641e6eb7f104", "published_at": "2019-10-25"}