{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/3/court-puts-new-yorks-flavor-ban-on-hold", "downloaded_at": "2019-10-03 23:37:36.289747+00:00", "published_at": "2019-10-03", "title": "Court puts enforcement of New York’s flavor ban on hold", "language": "en", "text": "ALBANY, N.Y. (AP) - A state appeals court on Thursday temporarily blocked New York from enforcing a new prohibition on sales of flavored e-cigarettes after the vaping industry sued to block the ban.\n\nThe stay comes a day before the state planned to start enforcing 90-day emergency regulations banning the sale of most flavored electronic cigarettes. The decision also follows a state court’s refusal last week to issue a temporary restraining order on the regulations approved in September by Gov. Andrew Cuomo.\n\nNew York’s prohibition covering flavored e-cigarettes and other vaping products except for menthol and tobacco flavors went into effect immediately. Retailers initially had two weeks to remove merchandise from store shelves.\n\nHealth officials issued the regulations in response to worries that vaping may cause illnesses and that its use is growing among teenagers. According to data from the state health department, use among high-school students increased from 10.5% in 2014 to 27.4% in 2018.\n\nCritics including the Vapor Technology Association argued the bans are governmental overreach that will hurt small businesses selling e-cigarettes and adult smokers who say flavors help them quit. Such opponents instead say states should address improper marketing to kids and follow New York’s move to raise the statewide smoking age to 21.\n\n“We continue to stand ready to work with the State of New York and all interested stakeholders on the many real solutions that should be implemented to achieve the twin goals of restricting youth vaping, which already is illegal, and preserving flavored alternatives for adults desperately trying to quit smoking,” said Tony Abboud, Executive Director of the Vapor Technology Association.\n\nBut supporters such as the American Cancer Society’s advocacy group said they’ll continue pushing for New York’s ban on flavored e-cigarettes and for laws to make such restrictions permanent.\n\n“There is no doubt it is an emergency,” said the group’s spokeswoman Julie Hart. “We have to act and do something because our kids are getting addicted to flavored products. The next step is all flavored tobacco.”\n\nNew York Health Commissioner Howard Zucker said the court’s decision won’t deter officials from addressing the “public health emergency.”\n\n“While the court’s ruling temporarily delays our scheduled enforcement of this ban, it will not deter us from using every tool at our disposal to address this crisis,” he said.\n\nGov. Cuomo recently said he would move to expand New York’s flavor ban to include menthol, though the status of such a change is unclear.\n\nThe Centers for Disease Control and Prevention says more than 500 confirmed and probable cases of lung illnesses and nine deaths nationwide have been attributed to vaping.\n\nStates such as Michigan and Rhode Island have moved to ban flavored e-cigarettes. President Donald Trump has also proposed a federal ban .\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "A state appeals court on Thursday temporarily blocked New York from enforcing a new prohibition on sales of flavored e-cigarettes after the vaping industry sued to block the ban.", "authors": ["The Washington Times Http", "Marina Villeneuve"], "top_image": ""}