{"pub": "reuters", "url": "https://reuters.com/article/us-iraq-protests-port/iraqs-umm-qasr-port-operations-halted-by-protesters-officials-idUSKBN1X81R1", "downloaded_at": "2019-10-30 09:04:18.860148+00:00", "title": "Iraq's Umm Qasr port operations halted by protesters: officials", "language": "en", "text": "BASRA, Iraq (Reuters) - Operations were at a complete standstill at Iraq’s Umm Qasr commodities port near Basra on Wednesday after protesters blocked its entrance in the previous day, port officials said.\n\nUmm Qasr receives imports of grain, vegetable oils and sugar shipments that feed a country largely dependent on imported food.\n\nThe port had been operating at only around 20% of the normal level on Tuesday after protesters blocked its entrance, port officials said.\n\n“Protesters have blocked the main entrance to the port. Trucks that carry goods can’t enter or leave the facility,” said one of the officials.\n\nThousands of Iraqis have taken to the streets this week in a second wave of protests against a government and a political elite they say is corrupt and out of touch. The death toll since a broader wave of unrest started on Oct.1 is at least 250.\n\nFurther disruptions to operations could cause financial damage to the country and impact the inflow of commodities, port officials said in a statement.\n\n“Halting the entry of commodities will cause a huge increase in the price of goods and create negative results,” the statement added.\n\nPort officials say they are holding talks with protesters to try to persuade them to allow trucks and shift workers to enter and leave the port so it can resume normal operations.", "description": "Operations were at a complete standstill at Iraq's Umm Qasr commodities port near Basra on Wednesday after protesters blocked its entrance in the previous day, port officials said.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "published_at": "2019-10-30"}