{"pub": "businessinsider", "url": "https://businesstimes.com.sg/technology/us-regulators-block-telegram-from-raising-funds-through-cryptocurrency", "downloaded_at": "2019-10-12 00:34:38.826952+00:00", "title": "US regulators block Telegram from raising funds through cryptocurrency", "language": "en", "text": "US securities regulators won an emergency court order on Friday to block the messaging application Telegram Group from raising funds by selling unregistered cryptocurrency to investors.\n\n[NEW YORK] US securities regulators won an emergency court order on Friday to block the messaging application Telegram Group from raising funds by selling unregistered cryptocurrency to investors.\n\nThe US Securities and Exchange Commission said Telegram sold 2.9 billion digital tokens called \"Grams\" without registering the tokens as securities and disclosing risks to investors.\n\nThe company, whose encrypted messaging program Messenger has some 300 million monthly users worldwide, raised more than US$1.7 billion in funds from US and overseas investors.\n\nThe SEC said in a complaint filed in US District Court in New York that Telegram had planned for the Grams to be delivered to consumers by the end of October.\n\nsentifi.com Market voices on:\n\nPurchasers of the Grams would then be able to resell them on the open market in sales that would be facilitated by Telegram and its affiliates, the SEC said.\n\n\"Defendants plan to sell billions of securities that will quickly come to rest in the hands of US investors without providing those investors important information about their business operations, financial condition, risk factors and management,\" the SEC complaint said.\n\nThe SEC requested an temporary restraining order saying \"once Grams reach the public markets, it will be virtually impossible to unwind the Offering, given that many purchasers' identities will be shrouded in secrecy, and given the variety of unregulated markets where Grams may be sold, including platforms that promise anonymity and encryption capability to mask transactions.\"\n\nThe SEC in the past year has ramped up its efforts to combat companies raising funds through questionable digital currencies, which it said are ripe for potential fraud.\n\nAFP", "description": ": THE BUSINESS TIMES Technology - [NEW YORK] US securities regulators won an emergency court order on Friday to block the messaging application Telegram Group from raising funds by selling unregistered cryptocurrency to investors. . Read more at The Business Times.", "authors": [], "top_image": "https://www.businesstimes.com.sg/sites/default/files/styles/article_img_retina/public/image/2019/10/12/nz_telegram_121044_0.jpg?itok=D_RapqZ8", "published_at": "2019-10-11"}