{"pub": "guardian", "url": "https://theguardian.com/law/2019/sep/24/lady-hale-career-breaking-barriers-judiciary", "downloaded_at": "2019-09-24 13:41:20.674548+00:00", "title": "Lady Hale: a career of breaking barriers in the judiciary", "language": "en", "text": "Lady Hale is the first female head of the supreme court, having taken up the role in October 2017.\n\nShe has long been breaking down barriers in the judiciary, which has struggled to cast off the perception it is an old boys’ club, overwhelmingly white, male and public-school educated.\n\nIn 2003, Hale, who went to a state school in Yorkshire, was appointed as the first female law lord. Her route to the judiciary was not the traditional one of years of practice at the bar.\n\nAfter graduating in law from Girton College, Cambridge, at the top of her class, she joined the University of Manchester law faculty as a junior lecturer. While teaching – and working in a pub – she studied for the bar exams, winning the top results for her year in the bar finals.\n\nWhen the dean of the faculty forced her to choose between practice and academia, she opted for the latter, spending 18 years at Manchester University until 1984. In 1984, she became the first woman and youngest person to be appointed to the Law Commission, redrawing family law, much to the chagrin of the Daily Mail, which accused her and colleagues of “subverting family values”.\n\nShe was appointed a QC – and part-time judge – in 1989 and in 1994 became the first high court judge to have made her career as an academic and public servant rather than as a practising barrister.\n\nHale, who earns £225,000 a year as head of the supreme court, has been outspoken throughout her career about sexism in the judiciary and lack of diversity more broadly.\n\nShe has previously said the court should be ashamed if it does not improve its record on the issue.\n\nHale has criticised the inbuilt bias in choosing judges, and the dependence on “soundings” from judges, as producing a judiciary that is “not only mainly male, overwhelmingly white, but also largely the product of a limited range of educational institutions and social backgrounds”.\n\nUnder new rules, which make retiring at 70 mandatory, Hale, who is 74, would not have been able to preside over the proroguing of parliament case. But she is among the last of the judges who can serve to 75 as she was appointed to the bench before the rules were changed in 1995.", "description": "Supreme court’s first female leader reached position by unusual route and is champion of diversity", "authors": ["Haroon Siddique", "Martin Kettle"], "top_image": "https://i.guim.co.uk/img/media/3156e360e21fb4c79605894967b47f98769aaf23/1180_45_3864_2319/master/3864.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4e69d50d39a436909996e37a4e479c11", "published_at": "2019-09-24"}