{"pub": "yahoo", "url": "https://finance.yahoo.com/news/1-higher-bakken-output-helps-121020294.html", "downloaded_at": "2019-10-30 12:36:04.491588+00:00", "title": "UPDATE 1-Higher Bakken output helps Hess post smaller loss, raise production view", "language": "en", "text": "(Compares with estimates, adds industry background)\n\nOct 30 (Reuters) - Hess Corp reported a smaller-than-expected quarterly loss and raised its full-year production forecast on Wednesday, owing to higher output at the U.S. oil and gas producer's assets in the Bakken shale.\n\nProduction from Bakken rose 38% to 163,000 barrels of oil equivalent per day (boe/d) in the quarter, helping net production, excluding Libya, rise about 4% to 290,000 boe/d.\n\nOil from seven big shale formations, particularly the Permian basin of Texas and New Mexico and the Bakken in North Dakota, have helped the United States become the biggest crude oil producer in the world.\n\nHess cut its capital expenditure by $100 million to $2.7 billion for the full year, while also raising its Bakken net production outlook to about 150,000 boe/d, up from 140,000 boe/d to 145,000 boe/d.\n\nThe company raised its annual net production expectation, excluding Libya, to about 285,000 boe/d, from the prior range of 275,000 boe/d to 280,000 boe/d.\n\nAdjusted net loss was $98 million, or 32 cents per share, in the third quarter ended Sept. 30, compared with a profit of $29 million, or 6 cents per share, a year earlier.\n\nAnalyst on average expected a loss of 33 cents, according to IBES data from Refinitiv.\n\n(Reporting by Shanti S Nair in Bengaluru; Editing by Anil D'Silva and Arun Koyyur)", "description": "Hess Corp reported a smaller-than-expected quarterly loss and raised its full-year production forecast on Wednesday, owing to higher output at the U.S. oil and gas producer's assets in the Bakken shale.  Production from Bakken rose 38% to 163,000 barrels of oil equivalent per day (boe/d) in the quarter", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-30"}