{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-mideast-crisis-baghdadi-afghanistan/afghanistan-says-death-of-is-leader-delivers-big-blow-to-afghan-faction-idUKKBN1X70PT", "downloaded_at": "2019-10-28 09:51:18.335953+00:00", "title": "Afghanistan says death of IS leader delivers big blow to Afghan faction", "language": "en", "text": "KABUL (Reuters) - Afghanistan welcomed the killing of Islamic State leader Abu Bakr al-Baghdadi as a major blow to terrorism that is expected to weaken the South Asian branch of the Middle Eastern militant group.\n\nFILE PHOTO: Iraqi youth watch the news of Islamic State leader Abu Bakr al-Baghdadi death, in Najaf, Iraq October 27, 2019. REUTERS/Alaa al-Marjani/File Photo\n\nThe emergence of an Afghan affiliate of Islamic State emerged in recent years created another enemy for the U.S.-backed government, which has been fighting against the much larger Taliban insurgency since 2001.\n\n“The Afghan government strongly welcomes the U.S. forces’ operation that led to the death of ... Baghdadi,” a spokesman for President Ashraf Ghani said in a post on Twitter.\n\n“The death ... is the biggest blow to this group and to terrorism,” the spokesman, Sediq Sediqqi, said.\n\nBaghdadi, who had led the jihadist group since 2010, killed himself during a raid by U.S. special forces on his hideout in northwest Syria early on Sunday. His death was announced by U.S. President Donald Trump.\n\nThe leadership of Islamic State in Khorasan (ISIS-K), named after an old name for the region that covered much of modern-day Afghanistan and parts of Central Asia, had pledged allegiance to Baghdadi but it was unclear what direct operational links the two groups had.\n\nThe Afghan affiliate first appeared in 2014, in the eastern province of Nangarhar, where it retains a stronghold.\n\nIt announced its formation in January 2015 and has since made inroads in other areas, particularly the north, sometimes bringing it into conflict with the rival Afghan Taliban.\n\nIt has also carried out bloody attacks on civilian targets in Kabul and other cities, but many Afghan officials doubt some of its claims, and the group remains little understood.\n\nAttaullah Khogyani, spokesman for the governor of Nangarhar, said the militant faction had grown weaker recently, and the death of Baghdadi would be a hard blow for it.\n\n“No doubt, Baghdadi’s death will have a deep impact on Daesh’s activities in Afghanistan,” said Khogyani, referring to IS.\n\nThe U.S. military estimates the strength of ISIS-K at 2,000 fighters. Some Afghan officials put the number higher. But Khogyani said numerous members had been killed in clashes or had surrendered over recent months.\n\n“Now we expect an increase in surrenders,” he said.\n\n‘NO MATTER’\n\nAn IS fighter, reached in eastern Afghanistan by telephone, said he suspected news of Baghdadi’s death was fake.\n\n“If the U.S. really killed him, they should show the evidence, show the body,” said the militant, who identified himself as just Shaheen.\n\n“But let’s say he was killed, it wouldn’t matter. Our struggle is not for Baghdadi, our struggle against the infidels is for Allah.”\n\nA spokesman for the Taliban dismissed any suggestion the purported Afghan IS branch had any link with IS in the Middle East. Instead, the group was cooked up by the U.S.-backed Afghan government and U.S.-led NATO forces, Taliban spokesman Zabihullah Mujahid said.\n\n“The Taliban will fight them to the death,” he said.\n\nA satellite view of the reported residence of ISIS leader, Abu Bakr al-Baghdadi, according to the source, near the village of Barisha, Syria, collected on September 28, 2019, is shown in this handout image released on October 27, 2019 by Maxar Technologies. Maxar Technologies/Handout via REUTERS\n\nAfghans have seen for themselves what impact, or lack of one, the death of a militant commander can have on a group.\n\nThe Taliban officially confirmed in July 2015 that their supreme leader, Mullah Mohammad Omar, had been dead for more than two years.\n\nWhile that news brought a brief spell of factional rivalry, the Taliban have since grown stronger and now control more territory than at any time since their ouster from power in 2001.", "description": "Afghanistan welcomed the killing of Islamic State leader Abu Bakr al-Baghdadi as a major blow to terrorism that is expected to weaken the South Asian branch of the Middle Eastern militant group.", "authors": ["Abdul Qadir Sediqi", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191028&t=2&i=1445776842&w=1200&r=LYNXMPEF9R0I3", "published_at": "2019-10-28"}