{"pub": "guardian", "url": "https://theguardian.com/politics/2019/sep/24/gina-miller-the-woman-who-took-on-the-uk-government-and-won-twice", "downloaded_at": "2019-09-24 13:45:24.853845+00:00", "title": "Gina Miller: the woman who took on the UK government and won – twice", "language": "en", "text": "Gina Miller: the woman who took on the UK government and won – twice\n\nEntrepreneur Gina Miller rose to prominence when she challenged the UK government in 2016 over its authority to trigger article 50 without parliamentary approval. When the supreme court ruled in her favour in January 2017, she became a hate figure for many Brexit supporters, subject to intense vitriol.\n\nIn the same month as the judgment, the Metropolitan police revealed it had issued eight “cease and desist” notices to people who had sent Miller threatening messages.\n\nIn July, Rhodri Philipps, the fourth Viscount St Davids, was jailed for 12 weeks for directing “extreme racial abuse” at her and offering money to anyone who would run over and kill Miller.\n\nThe abuse led her to have 24-hour security installed in her home, hire security guards and often conceal her identity in public.\n\nShe was born in British Guiana (now Guyana) to parents of Indian descent. Her father, a barrister, would become the country’s attorney general.\n\nIn her memoir Rise, she wrote: “As a child of the Commonwealth, I had been brought up to believe Great Britain was the promised land, a culture where the rule of law was observed and decency was embedded in the national fabric.”\n\nAged 11, she was sent to England to board at an all-girls school in Eastbourne on the Sussex coast. Owing to currency restrictions in Guyana that meant a shortage of money at home, when 13, she worked as a chambermaid while still at school.\n\nAfter school she studied law at the University of East London but quit after being viciously attacked in the street. After having a child, Lucy-Ann, who suffered brain damage, with her first husband, she went on to study marketing at the University of North London, while a single parent and working.\n\nShe now leads the online wealth manager SCM Direct and the True and Fair foundation charity, both of which she founded, as well as campaigning on Brexit.\n\nIn 2017, she was named the UK’s most influential black person and was also number 26 on the Asian power list of most influential British Asians.\n\nIn September last year, she launched a campaign to “to end the Brexit chaos”.\n\nAhead of her challenge to the proroguing of parliament, formally supported by the former prime minister Sir John Major and the shadow attorney general, Shami Chakrabarti, she described it as “a brazen attempt, of truly historical magnitude, to prevent the executive being held accountable for its conduct before parliament”.", "description": "The businesswoman and Brexit legal campaigner has a long history as a self-starter", "authors": ["Haroon Siddique"], "top_image": "https://i.guim.co.uk/img/media/bb25a705fa1af742f3d98b1587881201a4343dee/152_128_2681_1609/master/2681.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=4ba62185586d39a74147876349070f65", "published_at": "2019-09-24"}