{"pub": "fox", "url": "https://foxnews.com/world/india-police-serial-killer-arrested-cyanide-deaths", "downloaded_at": "2019-10-19 19:05:11.678358+00:00", "title": "India police say 'cunning serial killer' arrested in deaths of 6 family members", "language": "en", "text": "Police in India say six members of a family were killed with cyanide by a church-going relative motivated by greed, according to reports Saturday.\n\nThe police in Kerala are now describing 47-year-old Jolly Joseph as one of India’s most cunning serial killers, who spiked soups, snacks and medicinal drinks with cyanide that she gave her victims over a 14-year period, The New York Times reported.\n\n“I just pray that we can bring my family members justice. You don’t know what it does to me as a daughter, as a sister, to see my loved ones’ remains after so long, taken from their graves,” said Renji Thomas, Joseph’s ex-sister-in-law, according to the paper.\n\nSAMUEL LITTLE MOST PROLIFIC SERIAL KILLER IN US HISTORY, FBI SAYS\n\nThomas is the sister of Roy Thomas, who was married to Joseph in 2011 when he died suddenly after retching violently in a locked bathroom, the paper reported. Joseph said it was a heart attack that killed him.\n\nAuthorities say Joseph has confessed to the six killings, the Times reported.\n\nThe other victims were her father-in-law, her mother-in-law, her husband’s uncle, a 2-year-old niece, and the wife of her current husband.\n\nThe victims' bodies were being exhumed as part of the investigation.\n\nOn Saturday, Joseph's request for bail was rejected by a court in Kerala, Gulf News reported. She has been jailed since her arrest Oct. 5.\n\nNEWBORN INDIAN GIRL FOUND BURIED ALIVE IN CEMETERY: REPORT\n\nTwo accused accomplices were also denied bail.\n\nOne is a jewelry store clerk who police say helped Joseph carry out some of the killings, the Times reported.\n\nThe other is a goldsmith, who is alleged to have provided the cyanide.\n\nPolice believe Joseph acted out of greed, eliminating those who stood in the way of her inheriting valuable property held by the family she married into.\n\nThe case broke open as Joseph and her sister-in-law battled over family property in court and Joseph turned over an autopsy report showing her husband died of cyanide poisoning, the New York Post reported.\n\nCLICK HERE FOR THE FOX NEWS APP\n\nJoseph was able to keep the autopsy findings for years, the paper reported.", "description": "Police in India say six members of a family were killed with cyanide by a church-going relative motivated by greed, according to reports Saturday.", "authors": ["Robert Gearty"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/cyanide-iStock.jpg", "published_at": "2019-10-19"}