{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/frank-lampard-talks-best-mum-20745584", "downloaded_at": "2019-10-28 23:36:01.891333+00:00", "title": "Frank Lampard talks 'best mum' Christine's 'sleepless' nights on 10th anniversary", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Chelsea FC stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nFrank Lampard enthused Christine was the \"best mum\" as they celebrated their 10 year anniversary at Pride of Britain.\n\nThe sports star confessed his wife sacrifices her sleep to dote on their daughter Patricia so he can have a full night's rest.\n\nChristine and Frank enjoyed a night off parenting to ring in the 10th anniversary since they met for the first time at the Pride of Britain Awards in 2009.\n\nSpeaking to the Mirror Online at the Pride of Britain Awards, he said: \"Christine is the best, she's being humble, she's the best mum. She wakes up all the time. I sleep through!\"\n\nChristine was modest when she enthused her 13-month-old daughter was an \"easy\" newborn.\n\n(Image: David Fisher/REX)\n\nThe Loose Women star said her little girl was \"great\" and \"brilliant\" as she fully immerses herself into her mothering role.\n\n\"She's great, she's brilliant,\" Christine said. \"She's 13 months already. She's doing really well. She makes it [parenting] as easy as you can get.\"\n\n(Image: WireImage)\n\nHaving first crossed paths at this very event a decade ago, Christine gushed Pride of Britain was a \"very special evening\" for the couple.\n\nThe mother-of-one noted it was \"extra special\" because she was acting as a judge for the glittering event this year.\n\nShe said: \"We are [excited]. It's always a very special evening for us. I'm a judge this year and it makes it extra special.\"\n\nThe Daily Mirror Pride of Britain Awards, in partnership with TSB, will broadcast on ITV on 5th November at 8pm .\n\nDo you have a story to sell? Get in touch with us at webcelebs@trinitymirror.com or call us direct 0207 29 33033.", "description": "EXCLUSIVE: Chelsea manager Frank Lampard has hailed his wife's sacrifices as they celebrate a decade together", "authors": ["Lily Waddell", "Image", "David Fisher Rex", "Wireimage"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20745611.ece/ALTERNATES/s1200/0_Pride-of-Britain-Awards-London-UK-28-Oct-2019.jpg", "published_at": "2019-10-28"}