{"pub": "investing.com", "url": "https://investing.com/news/economy/imf-sees-thai-growth-rate-at-29-this-year-30-in-2020-1993152", "downloaded_at": "2019-10-08 09:41:43.376645+00:00", "title": "IMF sees Thai growth rate at 2.9% this year, 3.0% in 2020", "language": "en", "text": "By Orathai Sriring\n\nBANGKOK (Reuters) - Thailand's economic growth rate could slow to 2.9% this year and be 3.0% in 2020, reflecting external and domestic headwinds, the International Monetary Fund said.\n\nLast year's growth for Southeast Asia's second-biggest economy was 4.1%.\n\nThe growth projections came in a report released in Washington on Monday about an Article IV consultation in Thailand by the IMF's executive board.\n\nAccording to the report, there are different views among directors on whether Thailand has scope for further policy easing.\n\nThe IMF said it welcomed the August rate cut by the Bank of Thailand - its first since April 2015 - and added that \"going forward, a number of directors saw scope for further monetary easing to help steer inflation back to target\".\n\nIt also said \"many\" other directors considered the current monetary stance to be sufficiently accommodative, and noted that monetary policy should be calibrated based on assessment of financial stability risks.\n\nFor September, Thailand reported an annual inflation rate of 0.32%. The central bank's target range is 1-4%, and it has projected an 0.8% rate for 2019.\n\nRisks to the growth outlook are tilted to the downside stemming from the impact of the global economic slowdown, current trade tensions and weak domestic demand, the IMF said.\n\n\"Directors encouraged an expansionary policy mix to support domestic demand, and structural reforms to promote inclusive and sustainable growth,\" the fund said.\n\nOn Sept. 25, the BOT left its benchmark interest rate unchanged at 1.50% after August's surprise easing. The rate is 25 basis points above the record low.\n\nBOT Governor Veerathai Santiprabhob told Reuters on Friday that the bank was ready to review monetary policy if the global economic condition deteriorated much further.\n\nHe said the central bank planned to further relax rules on capital outflows by the end of the year to help balance flows, as the baht climbed.\n\nThe baht is Asia's best performing currency this year, appreciating nearly 7% against the dollar, driven by the country' hefty current account surplus and foreign inflows.\n\nThe IMF said many directors considered that Thailand's external position remained substantially stronger than warranted by medium-term fundamentals and desirable policies.\n\n\"Directors emphasized the importance of exchange rate flexibility, with foreign exchange intervention limited to avoiding disorderly market conditions,\" it said.\n\nFor the full IMF report, click on https://", "description": "IMF sees Thai growth rate at 2.9% this year, 3.0% in 2020", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF970DE_L.jpg", "published_at": "2019-10-08"}