{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/dog-abandoned-rain-after-giving-20563048", "downloaded_at": "2019-10-12 00:18:34.518801+00:00", "title": "Dog that had just given birth tied up and abandoned in pouring rain without her puppies", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA dog was abandoned in the pouring rain after giving birth - with no sign of her puppies.\n\nThe German Shepherd was dumped and found tied to a gate post before being taken into a dog shelter.\n\nUpset staff at Crowfoot Kennels Dog Rescue in Church Broughton, Derby, said it was clear the dog, which they have named Ellie, had not long given birth.\n\nBut when she was found there was no sign of any puppies, said a spokesman for the kennels.\n\nStaff are now hoping a new owner can be found for Ellie, who can provide her with lots of cuddles, reports Derbyshire Live.\n\n(Image: BURTON MAIL / Crowfoot Kennels Dog Rescue)\n\nA social media post on Crowfoot Kennels' Facebook page said: \"Meet the stunning Ellie, a German Shepherd, who is four years old.\n\n\"Ellie was found tied up to a gate post in the pouring rain.\n\n\"We believe Ellie had just had a litter of puppies which was nowhere to be found.\n\n\"Considering all of this Ellie has bounced back and is recovering really well and is now looking for her forever home.\n\n\"Ellie enjoys her walks and loves having her cuddles.\n\n\"If you think you can give Ellie the cuddles she deserves please get in touch. She seems ok with other dogs.\"\n\nMore details are available by calling 01283 585510.", "description": "Ellie the German Shepherd is now looking for a forever home where she can have lots of cuddles", "authors": ["Helen Kreft", "Richard Castle", "Image", "Burton Mail", "Crowfoot Kennels Dog Rescue"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20563719.ece/ALTERNATES/s1200/0_hk_tem101019dog_01_resultJPG.jpg", "published_at": "2019-10-11"}