{"pub": "nytimes", "url": "https://nytimes.com/2019/09/12/opinion/trump-homeless-california.html", "downloaded_at": "2019-09-13 01:02:19.846002+00:00", "title": "Opinion | Trump’s Vague Plans on Homelessness", "language": "en", "text": "Donald Trump likes speaking in declarative sentences and promising to solve big problems. He revels in the appearance of activity and the development of vague plans.\n\nAnd it is in this spirit that Mr. Trump has turned his attention to homelessness in California.\n\nThere is no question that California is in the throes of a crisis. In the state’s most populous county, Los Angeles, a county report in June found the homeless population had spiked to an estimated 59,000 — a 12 percent increase over June 2018. Last year a United Nations investigation criticized San Francisco and Oakland for “cruel and inhuman treatment” of the homeless, which it called a violation of their human rights. The state’s homeless population was estimated at about 130,000 last year, equal to the entire population of Charleston, S.C.\n\nThe president, who said on Fox News in July that American cities were being plagued by homelessness and he was considering action to “get that whole thing cleaned up,” has now dispatched aides to California on a fact-finding mission. The Washington Post reported that the White House is thinking about sweeping the homeless from the streets of the Golden State and providing them with some kind of housing.\n\nThe basic problem is a housing shortage that has driven rents to levels that are unaffordable even for many people with full-time jobs. The state has taken some modest steps in recent years to allow more construction, while resisting bolder measures. Instead, California is trying to address homelessness by expanding the supply of subsidized housing.", "description": "The president has noticed that people are living on the streets in California. Solutions are unlikely to follow.", "authors": ["The Editorial Board"], "top_image": "https://static01.nyt.com/images/2019/09/12/opinion/12homelessness-sub/12homelessness-sub-facebookJumbo.jpg", "published_at": "2019-09-12"}