{"pub": "politico", "url": "https://politico.com/story/2019/09/10/trump-economy-twitter-1718661", "downloaded_at": "2019-09-10 23:30:35.120218+00:00", "title": "Trump insists everything is fine as economic anxiety surges", "language": "en", "text": "President Donald Trump. | Win McNamee/Getty Images White House Trump insists everything is fine as economic anxiety surges The president’s free-wheeling approach and rapid-fire tweets are driving up uncertainty to historic levels.\n\nThe United States economy is slowing by nearly every major measure, from job creation to business investment.\n\nAnd there‘s one major culprit cited by academics, corporate executives and business owners: a surge in economic uncertainty to historic levels driven largely by President Donald Trump’s itchy Twitter finger and head-spinning approach to trade and fiscal policy.\n\nStory Continued Below\n\nTrump's shoot-from-the-hip style is delivering a new age of uncertainty across much of America and the world — clouding business forecasts, puzzling investors and potentially threatening the president’s own reelection prospects.\n\nEvidence of the confusion and anxiety is piling up. The global Economic Policy Uncertainty Index in June hit its highest level ever, eclipsing periods after the Sept. 11 terrorist attacks and the 2008 financial crisis — two stretches during which U.S. recessions were already underway and employers were slashing jobs.\n\nNow, Trump-related uncertainty dominates talk among corporate executives on earnings calls and during discussions at the U.S. Federal Reserve. Companies are reining in capital spending and slowing their hiring plans, unsure what the unpredictable president might do next and whether it will help tip the U.S. from slowing growth into recession. Taken together, the mosaic of data and anecdotes suggests traits that helped drive Trump into the White House — his promises to rip up trade deals and demolish the status quo — could undermine his own economy and imperil his chances for a second term.\n\n“I‘ve been in the business for 35 years, and I don’t remember a time where uncertainty was at such an extreme level — and that covers a lot of nail-biting periods,” said David Rosenberg, chief economist and strategist at investment firm Gluskin Sheff. “The U.S. economy is going to slow down perceptibly. I would suggest no growth in the fourth quarter. People are going to be surprised by it. It will either be recession or stagnation.”\n\nMorning Money Political intelligence on Washington and Wall Street — weekday mornings, in your inbox. Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nRosenberg suggested some of the current economic growth represents spending by consumers and inventory-building by companies trying to get ahead of pending tariffs. This activity could vanish later in the year.\n\nTrump and other top U.S. officials are making a concerted push to argue all this is nonsense, and that the economy is doing just fine. They are also floating potential tax cuts to give the U.S. new fuel.\n\nThey say the real problem is doom-saying investors, pundits and journalists hyping slowing numbers into a potentially self-fulfilling prophecy of decline.\n\n“The Economy is great. The only thing adding to ‘uncertainty’ is the Fake News!,” Trump tweeted Friday after a Labor Department report showed private sector job growth slowing to around 100,000 in August, still strong but a clear downshift from more than 200,000 per month last year.\n\nOn Monday, Treasury Secretary Steven Mnuchin dismissed talk of a U.S. slowdown while suggesting potential new tax cut proposals, something Trump also discussed ahead of the 2018 midterm election but never produced.\n\n“I think there’s no question the U.S. economy is in very good shape. As we look around the world, there’s no question that China is slowing, Europe is slowing — the U.S. is the bright spot of the world,” Mnuchin told reporters. “And regards to a middle-class tax cut, you know, we’ll be looking at tax cuts 2.0, something that will be something we’ll consider next year. But right now, the economy is in very, very good shape.”\n\nKey data does not support Mnuchin’s argument. In addition to a slower pace of job growth, manufacturing output measured by both the Fed and the Institute for Supply Management show a contracting factory sector slammed by Trump’s trade war with China and concerns that a replacement for the North American Free Trade Agreement negotiated by Trump may not pass Congress this year.\n\nU.S. GDP growth slowed to a 2 percent pace in the second quarter. The Atlanta Fed’s GDPNow estimate predicts 1.5 percent growth in the third quarter, a figure dragged down by a 2.4 percent drop in nonresidential equipment investment.\n\nIt’s not hard to figure out why companies are growing cautious.\n\nTreasury Secretary Steven Mnuchin. | Pablo Martinez Monsivais/AP Photo\n\nBetween May 31 and Sept. 5, the word “uncertainty” came up in over 250 presentations and earnings calls among S&P 500 companies, according to data provided to POLITICO by S&P Global Market Intelligence.\n\nThe U.S. Chamber of Commerce recently said that since June 1, “43 percent of Fortune 500 executives raised or addressed concerns over the impact of tariffs and trade policy tensions in earnings calls.”\n\nThe big risk on their mind is the relationship between the world’s two largest economies: S&P 500 company executives used the words “China” and “trade” in 216 public appearances since July 1, according to data from Refinitiv.\n\nThe commentary from executives often centers on the uncertain outcome of the tariff battle with China — which heats up and cools off with dizzying frequency — as well as a lack of clarity on where exactly the U.S. economy is going.\n\n“Ultimately, to improve the overall capital spending environment, we need to see certainty, certainty on trade policy, certainty on the economic outlook,” George Kurian, CEO of NetApp, Inc., a California-based cloud computing services firm, said on the company’s earnings call last month. “That has caused a spending pause in some of the largest global accounts that are most exposed to it.”\n\nTrump and his free-wheeling ways are not the cause of all of the slowing in the U.S. economy, economists note. Some of it is simply the natural slowing of the business cycle after over 10 years of growth, the longest expansion on record. Some is the fading impact of Trump’s tax cuts, which thus far have not produced the sustained explosion in capital spending predicted by proponents.\n\nAnd some elements of uncertainty have actually faded, including threats of a debt limit breach that plagued the U.S. economy earlier this decade.\n\nBut Trump still plays a big role.\n\n“The biggest threat to the expansion is certainly trade-related uncertainty,” said Jim O’Sullivan, chief U.S. economist at High Frequency Economics. “But you can’t lay everything at Trump’s feet. It’s hard to disentangle his impact from other forces affecting growth and we are not seeing a collapse yet, just slowing trends.”\n\nThe difficulty in measuring exactly how Trump’s Twitter habit and slashing trade wars are impacting markets and the economy has not stopped some from trying.\n\nJPMorgan Chase recently rolled out a “Volfefe Index” — referring to Trump’s famously unfinished 2017 tweet about negative press “covfefe.” Its analysts concluded there was “strong evidence” that Trump’s tweets “have increasingly moved U.S. rates markets immediately after publication” and “played a statistically significant role in elevating implied volatility.” JPMorgan analysts also noted that Trump’s Twitter volume has increased in recent months.\n\nFederal Reserve Chair Jerome Powell. | Manuel Balce Ceneta, File/AP Photo\n\nAt the Fed, a frequent target of Trump’s twitter rage, central bank chairman Jerome Powell and his colleagues are also having to wrestle with Trump’s tweets and the impact of his trade battles as they move to trim interest rates to ward off further slowing.\n\nAccording to Rosenberg, the words “risk” and “uncertainty” appeared an unprecedented 69 times in the latest minutes of the Federal Open Market Committee. “Last time, there were 48 citations. This is more than what we saw at any meeting during the Great Recession as well as 9/11 terrorist attacks and tech wreck nearly two decades ago.”\n\nStill, Powell said last week he was not in the camp seeing an imminent downturn. “We’re not forecasting or expecting a recession,” he said.\n\nAs for the sharp rise in the global Economic Policy Uncertainty index, drawn partly from newspaper coverage of economic events, Trump is not entirely responsible. But he is tied up in much of it. Coverage of trade war impacts in China, Japan and other countries plays a role in the index spiking. So does the UK’s effort to leave the European Union, which Trump encouraged.\n\n“There are a lot of things going in the world that are independent of Trump, but there is no question that uncertainty instigated by this administration is a big part of it,” said Steven J. Davis of the University of Chicago’s Booth School of Business, who helps compile the index. “And part of the job description is to conduct yourself and your policy in ways that instill confidence. They did a reasonable job of that early on with regulatory policy and a miserable job more recently with respect to trade policy.”", "description": "The president’s free-wheeling approach and rapid-fire tweets are driving up uncertainty to historic levels.", "authors": ["Ben White"], "top_image": "https://static.politico.com/a2/90/e174206246c5a19b41b682cd7170/190909-trump-am-gty-773.jpg", "published_at": "2019-09-10"}