{"pub": "huffpost", "url": "https://huffpost.com/entry/hot-pink-red-carpet-emmy-awards-2019_n_5d88001fe4b0849d472b22eb", "downloaded_at": "2019-09-23 02:30:02.663691+00:00", "title": "Stars Turned The Red Carpet Hot Pink At The Emmy Awards 2019", "language": "en", "text": "The red carpet was hot with pink ahead of the 71st annual Emmy Awards ceremony.\n\nA number of celebrities sported striking looks in what coincidentally turned out to be a pink-and-red theme at the Microsoft Theater in Los Angeles on Sunday night.\n\n“Pose” actress MJ Rodriguez stunned in a hot pink gown with a plunging neckline and black bows.\n\nFrazer Harrison via Getty Images Mj Rodriguez attends the 71st Emmy Awards at Microsoft Theater on September 22, 2019 in Los Angeles, California.\n\nOther stars went for ensembles that incorporated both red and pink colors.\n\nTaraji P. Henson arrived on the carpet in a red and pink ensemble with shear lining and a front slit. Mandy Moore opted for a strapless gown with a red train and slit.\n\nSteve Granitz via Getty Images Taraji P. Henson attends the 71st Emmy Awards at Microsoft Theater on September 22, 2019 in Los Angeles, California.\n\nSteve Granitz via Getty Images Mandy Moore attends the 71st Emmy Awards at Microsoft Theater on September 22, 2019 in Los Angeles, California.\n\nMarisa Tomei also apparently got the red-and-pink memo, showing up in a red and pink one-shoulder gown with a slit.\n\nSusan Kelechi Watson stunned in a red-and-pink strapless gown puffed sleeves.\n\nThe “This is Us” actress talked about her engagement to actor Jamie Lincoln Smith on the red carpet by introducing her engagement ring, which she named Marina.\n\nRich Polk via Getty Images Susan Kelechi Watson attends the 71st Emmy Awards at Microsoft Theater on September 22, 2019 in Los Angeles, California.", "description": "Hot pink and red-and-pink ensembles won the night.", "authors": ["Trends Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d880bad2300009105d4ae23.png?cache=jhsb6uei3m&ops=1778_1000", "published_at": "2019-09-23"}