{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-eu/brexit-day-of-reckoning-johnson-battles-further-delay-idUKKBN1WX2M6", "downloaded_at": "2019-10-19 11:25:03.736490+00:00", "title": "Brexit day of reckoning: Johnson battles further delay", "language": "en", "text": "LONDON (Reuters) - Prime Minister Boris Johnson appealed to lawmakers to back his last-minute Brexit deal in an extraordinary sitting of the British parliament on Saturday after his plans were plunged into chaos by his opponents’ moves to derail the legislation.\n\nMore than three years since the United Kingdom voted 52-48% to leave the European project, Johnson sought parliament’s approval for the divorce treaty he struck in Brussels on Thursday.\n\nHe said he was confident he had secured the best possible deal and there was little appetite for further delay.\n\n“If there is one feeling that unites the British public with a growing number of officials in the EU it is a burning desire to get Brexit done,” Johnson said. “Further delay is pointless, expensive and deeply corrosive of public trust.”\n\nOn a day of high drama, lawmakers held the first Saturday sitting since the 1982 Argentine invasion of the Falklands, while thousands of people gathered to march on parliament demanding another referendum on EU membership.\n\nProtesters waving EU flags and carrying signs calling for Brexit to be halted were making their way towards parliament.\n\nIn the chamber, meanwhile, Johnson’s opponents have laid a booby trap that could frustrate his plans, forcing him to send members of parliament home without voting on his deal on Saturday, and imposing a further delay in achieving Brexit.\n\nFormer Conservative lawmaker Oliver Letwin, expelled from the party by Johnson, has proposed that the decision on whether to back a deal be deferred until all the legislation needed to implement it has been passed through parliament.\n\nEven though Johnson believes this can be achieved by Oct. 31, others think it would need a short ‘technical’ delay.\n\nA law passed by Johnson’s opponents obliges him to ask the EU for a Brexit delay until Jan. 31, 2020 unless he has secured approval for his deal by the end of Saturday.\n\nCROSS-PARTY SUPPORT\n\nLetwin’s proposal, which has cross-party support, will be put to a vote on Saturday. If the amendment is approved by parliament, Johnson’s deal would not then be put to a vote on Saturday. The government would then seek to hold a vote on the deal on Tuesday, officials said.\n\n“My aim is to ensure that Boris’s deal succeeds,” said Letwin, kicked out of the Conservative Party for refusing to back Johnson’s plans to leave the EU with or without a deal.\n\nBut Letwin wanted “an insurance policy which prevents the UK from crashing out on 31 October by mistake if something goes wrong during the passage of the implementing legislation”.\n\nOutside parliament, many Britons say they are bored with the whole Brexit argument and just want the process to end. But others demonstrating on Saturday remain angry that Britain is leaving the EU and want that reversed.\n\nHannah Barton, 56, a cider maker from Derbyshire in central England, was draped in the EU flag. “I am incensed that we are not being listened to,” she said.\n\nBritain's Prime Minister Boris Johnson speaks at the House of Commons as parliament discusses Brexit, sitting on a Saturday for the first time since the 1982 Falklands War, in London, Britain, October 19, 2019, in this screen grab taken from video. Parliament TV via REUTERS\n\n“We feel that we are voiceless. This is a national disaster waiting to happen and it is going to destroy the economy.”\n\nJeremy Corbyn, leader of the main opposition Labour Party, backed a second referendum.\n\n“Voting for a deal today won’t end Brexit. It won’t deliver certainty and the people should have the final say,” Corbyn told parliament.\n\nBrexit “Super Saturday” tops a frenetic week which saw Johnson confound his opponents by clinching a new Brexit deal.\n\nIn a divided parliament where he has no majority, Johnson must win the support of 320 lawmakers to pass his deal.\n\nIf he wins, Johnson will go down in history as the leader who delivered a Brexit - for good or bad - that pulls the United Kingdom far out of the EU’s orbit.\n\n‘DO OR DIE’\n\nShould he fail, Johnson will face the humiliation of Brexit unravelling after repeatedly promising that he would get it done - “do or die” - by Oct. 31.\n\nJohnson won the top job by staking his career on getting Brexit done by the latest deadline of Oct. 31 after his predecessor, Theresa May, was forced to delay the departure date. Parliament rejected her deal three times, by margins of between 58 and 230 votes earlier this year.\n\nSlideshow (4 Images)\n\nHe said lawmakers faced the option of either approving the deal or propelling the United Kingdom to a disorderly no-deal exit that could divide the West, hurt global growth and bring renewed violence to Northern Ireland.\n\nTo win, Johnson must persuade enough Brexit-supporting rebels in both his Conservative Party and the opposition Labour Party to back his deal. His Northern Irish allies and the three main opposition parties oppose it.\n\nIn a boost for Johnson, some influential hardline Brexit supporters such as Mark Francois and Iain Duncan Smith said they would support the deal.\n\nSteve Baker, the head of a hardline Brexit faction in the Conservative Party, has told his European Research Group allies they should vote for Johnson’s deal.", "description": "Prime Minister Boris Johnson appealed to lawmakers to back his last-minute Brexit deal in an extraordinary sitting of the British parliament on Saturday after his plans were plunged into chaos by his opponents' moves to derail the legislation.", "authors": ["William James", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191019&t=2&i=1442619301&w=1200&r=LYNXMPEF9I077", "published_at": "2019-10-19"}