{"pub": "scmp", "url": "https://yp.scmp.com/over-to-you/columns/article/114584/face-peer-pressure-more-harmful-beneficial", "downloaded_at": "2019-10-30 02:26:08.765804+00:00", "title": "Face off: Is peer pressure more harmful than beneficial?", "language": "en", "text": "Nemo Yu, 14, Carmel Secondary School\n\nSometimes when we are faced with a decision, it is clear to us what the right thing to do is.\n\nBut at other times, we may struggle to decide whether or not we should do something, although we may not be able to clearly explain why. We may even feel compelled to do something that we know is wrong. What is behind these feelings? Peer pressure.\n\nPeer pressure is an invisible – but powerful – force acting upon us that can do serious damage to our mental health. It has no practical benefits to our daily lives.\n\nPeer pressure can invade our minds. It can prevent us from seeing things or making decisions the way we normally would. It can stop us from thinking critically or acting compassionately.\n\nPeer pressure can cause us to lose our freedom of thought, something which is fundamental to our integrity as an individual.\n\nWe stop thinking about what is right, or what is best for us, and begin focusing on what is most accepted by society. This can make us feel very anxious and uncomfortable.\n\nWhile peer pressure may not be seen as much of a threat to society as a whole, it is a lot more harmful to individuals – and especially young people, as they are often more susceptible to this type of pressure.\n\nCritics say that peer pressure can be beneficial to individuals, as it may be used to push someone to do something good, like recycle or quit smoking.\n\nBut this surely means that by the same token, peer pressure can be used to make someone do something bad, or something they aren’t comfortable with, like trying a cigarette in the first place.\n\nIn conclusion, we can never assume peer pressure is beneficial; it depends entirely on how it is used – and more often than not, it used to make people do things they don’t want to do. As young people still trying to form our identities, peer pressure is a source of stress we simply don’t need in our lives.\n\nPeer pressure is difficult to handle so we asked a psychologist for expert advice on how to deal with it\n\nCheang Kai U, 17, Macau Anglican College\n\nPeer pressure can certainly be beneficial. It can motivate someone to do something that they may not otherwise have had the strength or willpower to do. It can also help them to make a decision based on the input of those in similar circumstances.\n\nMost students form a very close bond with their peers at school and care about what they think.\n\nBecause of this, the words and actions of our peers can have a great impact. For instance, when a student sees one of their peers achieving awards and scholarships because that person works hard to get good grades, it might motivate the student to do the same.\n\nSimilarly, students may be able to convince their friends to make time for volunteer work, which can benefit both society and the individual.\n\nPeer pressure also allows us to better understand our options. Our peers can understand us better than, say, our teachers or parents, because they are of a similar age, and are going through the same experiences as us.\n\nFor example, when considering what to study at university, parents may insist a student study majors that they think may be more lucrative in the future. But peers may think differently because they see first-hand what their friends most enjoy studying, or which subjects they excel in.\n\nRegardless of how good or bad peer advice may be, it makes us more conscious of the choices available to us.\n\nToo often, the positive effects of peer pressure get swept under the carpet while the negative influences are exaggerated. Part of the problem is that when good things happen, such as achieving good grades, it is attributed to a strict upbringing and good teachers – but peers may have played an equally important role. Despite being a subtle influence, peers often motivate people to do things that are beneficial to them.\n\nEdited by Ingrid Piper", "description": "Each week, two of our readers debate a hot topic in a parliamentary-style debate that doesn’t necessarily reflect their personal viewpoint. This week …", "authors": [], "top_image": "https://yp.scmp.com/sites/default/files/styles/900x506/public/images/shutterstock_226347619.jpg", "published_at": "2019-10-29"}