{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7570333/Strictlys-Karen-Hauer-brands-new-beau-David-Webb-rock-doesnt-try-change-her.html", "downloaded_at": "2019-10-14 10:18:30.290147+00:00", "title": "Strictly's Karen Hauer 'wasn't in a good place mentally or physically' after Kevin Clifton divorce", "language": "en", "text": "Strictly Come Dancing's Karen Hauer has admitted she 'wasn't in a good place mentally or physically' following her divorce from Kevin Clifton.\n\nBut despite the breakdown of their marriage, the former couple are now in a good place, with the Venezuelan star, 37, revealing that she has a 'really lovely' friendship with her ex-husband.\n\nKaren is now happier than ever with new beau David Webb, with the dancer describing the opera singer as her 'rock'.\n\nHappy again: Karen Hauer is now happier than ever after finding love again with opera singer David Webb, with the dancer branding him her 'rock'\n\nIn their very first couple's photoshoot and interview with Hello! magazine, Karen revealed just how thrilled she is to have David, 36, in her life, with the couple setting up home together in April this year.\n\nThe couple were first pictured together on Boxing Day 2018, after he spent the festive period with Karen and her family in New York.\n\nAnd it appears that things are going from strength-to-strength as she she revealed just how happy he makes her.\n\nShe said: 'He's my rock. It’s so nice to have someone that understands and accepts me, doesn't judge and doesn't try to change me in any way. Everyone just falls in love with him too, because he has such a beautiful soul.'\n\nDifficult split: The Venezuelan star, 37, star admitted that she 'wasn't in a good place mentally or physically' following her divorce from Kevin Clifton\n\nFriends again: Despite the breakdown of their marriage, the former couple are now in a good place, with Karen revealing that she has a 'really lovely' friendship with her ex-husband\n\nWhile a smitten David, who didn't know who Karen was before they met, describes himself as the 'luckiest man on this earth.'\n\nBut things were not always rosy for Karen as she came through a painful divorce from her fellow dancer Kevin, 37, with the star describing how much the process had taken a toll her life.\n\n'I'd taken a big hit and I was going through a whole explosion of emotions,' she explained. 'My life was completely changing from one day to another. It did affect me mentally and physically – I wasn’t in a good place.'\n\nGushing: 'He's my rock. It’s so nice to have someone that understands and accepts me, doesn't judge and doesn't try to change me in any way'\n\nEmotional period: 'I'd taken a big hit and I was going through a whole explosion of emotions,' she explained. 'My life was completely changing from one day to another'\n\nRead the full interview in this week's Hello! magazine\n\nAnd while Karen has found happiness, so too has her ex, who has moved on with broadcaster Stacey Dooley, 32, whom he was paired with in the previous series of Strictly.\n\nTheir relationship was not without its controversy as she was in a five-year romance with personal trainer Sam Tucknott, 30, when she joined the show.\n\nIt was reported Sam confronted Kevin about his relationship with Stacey in a furious FaceTime call following the demise of their relationship in March.\n\nSam claimed he called Kevin a 'snake' and a 'rat' when he discovered flirty text messages sent to his ex after they separated.\n\nHowever things have now calmed down for the pair, with Stacey recently throwing Kevin a lavish party for his 37th birthday.\n\nTouching on his new romance, Karen said: 'It's nice to see him calm which I had not seen in years. Maybe it takes that bit of trauma to make you both realise this is what we need to do. And at the same time, we haven’t lost one another.'\n\nWith the pair still interacting on a daily basis on the BBC dance show, Karen adds that things are all good between them, stating that she'll 'never lose his friendship' because there's 'love' and 'admiration' between them.\n\nAnd after finding love again after such a traumatic period in her life, Karen be confessed that she wouldn't be opposed to walking down the aisle once more, adding 'never say never'.", "description": "The Strictly star, 37, said she 'wasn't in a good place mentally or physically ' after her divorce from Kevin Clifton and branded new beau David Webb, 36, her 'rock' .", "authors": ["Niomi Harris For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/14/09/19682590-0-image-a-21_1571042298663.jpg", "published_at": "2019-10-14"}