{"pub": "abcnews", "url": "https://abcnews.go.com/US/thirds-birds-north-america-risk-extinction-due-climate/story?id=66184981", "downloaded_at": "2019-10-10 18:24:34.566912+00:00", "title": "Two-thirds of birds in North America at risk of extinction due to climate change: Report", "language": "en", "text": "About two-thirds of the bird species in North America are at an increasing risk of extinction as the temperatures on Earth continue to warm, according to a new report released by the National Audubon Society.\n\nInterested in Climate Change? Add Climate Change as an interest to stay up to date on the latest Climate Change news, video, and analysis from ABC News. Add Interest\n\nAs the global climate changes, birds will be forced to relocate to more favorable homes -- and the shift could help wipe some of them out, according to the report, which was released Thursday.\n\nPeople can type in their zip codes to Audobon's Birds and Climate Visualizer to see how climate change will impact their specific community and local birds.\n\nThe earth has already reached 1 degree Celsius of warming, which has resulted in stronger hurricanes in the East and severe drought in the West, according to the report. If carbon emissions are not neutralized, a rise of 2 degrees Celsius could occur by 2050 and an increase in 3 degrees Celsius could occur by the end of the century.\n\nThe shift, however, is not inevitable. Stabilizing carbon emissions tokeep global temperatures to 1.5 degrees Celsius above pre-industrial levels would benefit most of the vulnerable species and possibly result in nearly 150 species coming off the list of vulnerable to extinction due to climate change, according to the report.\n\nKen Canning/Getty Images\n\nBird populations are widely considered to be an indicator of environmental health by scientists.\n\n\"Birds are important indicator species, because if an ecosystem is broken for birds, it is or soon will be for people too,\" Brooke Bateman, a senior climate scientist for the National Audubon Society, said in a statement.\n\nAudubon scientists combed through 140 million observations recorded by bird watchers and scientists and the latest climate models to project how each species' range will shift as climate change and other human impacts advance throughout North America.\n\nThe report also included climate modeling based on the 2014 Intergovernmental Panel on Climate Change Fifth Assessment Report, on what would happen to species at 1.5, 2 and 3 degrees Celsius of warming, and localized impacts of Earth's changing climate in the form of sea-level rise, urbanization, cropland expansion, extreme weather, fire, heavy rain, drought, false springs and lake level changes.\n\nLarry Keller via Getty Images\n\nA study published in the journal Science in September found that the bird population in the U.S. and Canada has declined more than 29% -- or by nearly 3 billion birds -- in the last 50 years.\n\n\"A lot of people paid attention to last month's report that North America has lost nearly a third of its birds,\" David Yarnold, CEO and president of the National Audubon Society, said in a statement. \"This new data pivots forward and imagines an even more frightening future.\"\n\nThere’s hope in Audubon's new report, Survival by Degrees: 389 Bird Species on the Brink, but first, it’ll break your heart if you care about birds and what they tell us about the ecosystems we share with them. https://t.co/evshGW2zd9 pic.twitter.com/ToEEjBB46F — David Yarnold 🐦🇺🇸 (@david_yarnold) October 10, 2019\n\nRenee Ston, vice president of climate for the National Audubon Society, called on elected officials to treat climate change as a priority going forward.\n\nGetty Images, FILE\n\n\"We already know what we need to do to reduce global warming, and we already have a lot of the tools we need to take those steps,\" Ston said in a statement. \"Now, what we need are more people committed to making sure those solutions are put into practice.\"\n\nSome of the species at risk include the American Goldfinch, American Robin, Baltimore Oriole, Brown Pelican, Hooded Warbler, Northern Pintail, Saltmarsh Sparrow and Scarlet Tanager.\n\nABC News' Stephanie Ebbs contributed to this report.", "description": "About two-thirds of the bird species in North America are at an increasing risk of extinction as the temperatures on Earth continue to warm according to a new study.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/GettyImages-532028122_hpMain_16x9_992.jpg", "published_at": "2019-10-10"}