{"pub": "thehill", "url": "https://thehill.com/policy/international/middle-east-north-africa/467641-white-house-releases-photo-of-trump-and", "downloaded_at": "2019-10-28 00:25:46.115266+00:00", "title": "White House releases photo of Trump, advisers monitoring al-Baghdadi raid in Situation Room", "language": "en", "text": "The White House released a photo of President Trump Donald John Trump Comey: Mueller 'didn't succeed in his mission because there was inadequate transparency' During deposition, official says he made several efforts to advocate for Marie Yovanovitch Bolton looms large as impeachment inquiry accelerates MORE and his advisers in the Situation Room monitoring the U.S. raid on Saturday night that ended with Abu Bakr al-Baghdadi’s death.\n\nPresidential assistant Dan Scavino, Jr. posted the photo on Twitter showing Trump and Vice President Mike Pence Michael (Mike) Richard PenceCompany with ties to Trump's brother awarded million government contract: report Charles Barkley's free speech hypocrisy Attacks on Baltimore 'hurt' Cummings, wife says MORE monitoring the raid in Syria. Trump and Pence were joined by National Security Adviser Robert O’Brien, Defense Secretary Mark Esper Mark EsperRussia calls increased US military presence in Syrian oil fields 'banditry' Pentagon awards billion cloud contract to Microsoft over Amazon Overnight Defense: Pentagon chief says 'mechanized' forces headed to Syria | Troops would protect oil fields | House subpoenas State, OMB officials in impeachment inquiry | Trump keeps up attacks on key diplomat MORE, Chairman of the Joint Chiefs of Staff Mark Milley, and Brigadier Gen. Marcus Evans.\n\nThe president on Sunday morning confirmed the two-hour raid resulted in the death of al-Baghdadi, saying the U.S. brought “the world’s Number One terrorist to justice.”\n\n“The thug who tried so hard to intimidate others spent his last moments in utter fear, in total panic and dread, terrified of the American forces bearing down on him,” Trump said.\n\nADVERTISEMENT\n\nTrump had tweeted Saturday night that something “very big” had happened as reports circulated with rumors of the ISIS leaders death.\n\nSomething very big has just happened! — Donald J. Trump (@realDonaldTrump) October 27, 2019\n\nTrump said on Sunday that he sent the tweet after U.S. forces returned safely from the mission.", "description": "The White House released a photo of President Trump and his advisers in the Situation Room monitoring the U.S. raid on Saturday night that ended with Abu Bakr al-Baghdadi’s death.", "authors": [], "top_image": "https://thehill.com/sites/default/files/trumpsituationroom_102719getty.jpg", "published_at": "2019-10-27"}