{"pub": "americanconservative", "url": "https://cnn.com/2019/10/16/politics/giuliani-counterintelligence-probe/index.html", "downloaded_at": "2019-10-18 02:04:34.154392+00:00", "title": "Federal investigation of Rudy Giuliani includes counterintelligence probe", "language": "en", "text": "(CNN) For months, investigators looking into Rudy Giuliani's business dealings in Ukraine have dug into everything from possible financial entanglements with alleged corrupt Ukrainian figures to counterintelligence concerns raised by some of those business ties, according to people briefed on the matter.\n\nThe counterintelligence part of the investigation indicates that FBI and criminal prosecutors in Manhattan are looking at a broader set of issues related to Giuliani, President Donald Trump's personal attorney, than has been previously reported.\n\nKenneth McCallion, a New York attorney, says that investigators first approached him earlier this year to ask about Giuliani's ties to Lev Parnas and Igor Fruman, two Giuliani associates indicted last week on campaign-finance related charges.\n\nMcCallion says FBI counterintelligence agents in February or March asked questions about some of Giuliani's Ukrainian business dealings.\n\nThe counterintelligence probe hinges in part on whether a foreign influence operation was trying to take advantage of Giuliani's business ties in Ukraine and with wealthy foreigners to make inroads with the White House, according to one person briefed on the matter.\n\nRead More", "description": "For months, investigators looking into Rudy Giuliani's business dealings in Ukraine have dug into everything from possible financial entanglements with alleged corrupt Ukrainian figures to counterintelligence concerns raised by some of those business ties, according to people briefed on the matter.", "authors": ["Evan Perez", "Sara Murray", "Shimon Prokupecz"], "top_image": "https://cdn.cnn.com/cnnnext/dam/assets/190510163655-file-rudy-giuliani-super-tease.jpg", "published_at": "2019-10-16"}