{"pub": "cbc", "url": "https://cbc.ca/news/world/california-wildfires-spread-power-outages-1.5337673", "downloaded_at": "2019-10-28 13:18:58.341304+00:00", "title": "Fires spread as Northern California deals with widespread power outages | CBC News", "language": "en", "text": "As nearly 200,000 people remain under evacuation order from threat of wildfire, some of the millions of people in Northern California on track to get their electricity back may not have power restored before another possible round of shutoffs and debilitating winds.\n\nPacific Gas & Electric Co. has notified more than 1.2 million people they may have their electricity shut off for what could be the third time in a week and the fourth time this month.\n\nMeanwhile, more than 2.4 million people who lost electricity over the weekend were awaiting restoration as hurricane-force winds whipped through the state, fuelling a wildfire in Sonoma County as smaller spot fires cropped up.\n\nFire conditions statewide made California \"a tinderbox,\" said Jonathan Cox, a spokesperson for the California Department of Forestry and Fire Protection. Of the state's 58 counties, 43 were under red-flag warnings for high fire danger Sunday.\n\nState of emergency\n\nGov. Gavin Newsom declared a state of emergency in response to the wildfires, powered by gusts that reached more than 164 km/h.\n\nThe Kincade Fire in Sonoma County that started Wednesday grew to 220 square kilometres, destroyed 94 buildings and was threatening 80,000 buildings, state fire authorities said Sunday night.\n\nWATCH: See footage captured over the weekend of the Kincade Fire\n\nDramatic video shows the wind-driven Kincade Fire burning north of San Francisco as firefighters battle the flames and residents attempt to escape. 1:11\n\nIn the San Francisco Bay Area, two grass fires briefly halted traffic on an interstate bridge. The flames came dangerously close to homes in Vallejo. Another grass fire closed a stretch of interstate that cut through the state capital as smoke obstructed drivers.\n\nIn the south, a wildfire in the Santa Clarita area near Los Angeles destroyed 18 structures. As of Sunday, the Tick Fire was 70 per cent contained.\n\nEarly Monday, a brush fire broke out along the west side of Interstate 405, north of Sunset Boulevard and near the Getty Center in Southern California.\n\nA serious brush fire is burning in the hills north of the Getty Center. Currently the fire is moving west and away from the Getty, and we have activated emergency operations. <br><br>We are preparing to assist emergency responders and will provide updates. <a href=\"https://twitter.com/hashtag/GettyFire?src=hash&ref_src=twsrc%5Etfw\">#GettyFire</a> —@GettyMuseum\n\nThe Los Angeles Fire Department called the fire \"a very dynamic situation due to high winds.\" The department issued mandatory evacuation orders affecting 3,300 homes in western Los Angeles County, according to LAFD Capt. Erik Scott.\n\nLos Angeles Lakers star LeBron James tweeted he had to evacuate his home because of the fires.\n\nMount Saint Mary's University tweeted students at its Chalon campus near the museum were forced to leave and go to another campus, and classes were cancelled for Monday.\n\nThe Getty was designed with fire protection in mind, with thick walls and doors to compartmentalize any flames, and Scott said it wasn't threatened.\n\nScott said at least two structures were burning. No injuries had been reported.\n\nHealdsburg, Calif., is still under an evacuation order. (Stephen Lam/Reuters)\n\nTo prevent power lines from sparking in high winds and setting off more blazes up north, PG&E said Sunday that power is out to 965,000 customers and another 100,000 have lost electricity because of strong gusts, bringing the number of residents impacted by blackouts to nearly 2.7 million.\n\nThe biggest evacuation was in Northern California's Sonoma County, where 180,000 people were told to pack up and leave. Some evacuating early Sunday had done so two years ago, when devastating wildfires swept through Sonoma and Napa and neighbouring counties, killing 44 people.\n\n'I just want to be home'\n\nAt an evacuation centre at Napa Valley College, Francisco Alvarado, 15, said he, two younger brothers and his parents decided to vacate their Calistoga home in advance of evacuation orders. Two years ago, the family had to flee, but in the middle of the night.\n\n\"I'm pretty mad that we have to keep evacuating,\" he said. \"I just want to be home. I'm trying to leave here tomorrow; I want to sleep in my bed.\"\n\nHe said he wasn't sure who, if anyone, to blame for the repeated fires, but said he didn't fault PG&E for turning off the electricity to try to prevent them.\n\nFirefighters discuss how to approach the scene as a home burned near grape vines in Healdsburg over the weekend. (Josh Edelson/AFP/Getty Images)\n\nRosa Schuth of Sebastopol stayed up late packing bags, but didn't think she would need to evacuate because the fires never reached her town in 2017.\n\nShe had been asleep for half an hour when she heard sirens telling residents to go. She got in her car and hopped on a country road that became jammed with evacuees.\n\n\"The wind is really something. It just rages and suddenly it stops, and you see a bird drifting by,\" she said.\n\nWorry over wind\n\nThe fear that the winds could blow embers and spread fire across a major highway prompted authorities to expand evacuation orders that covered parts of Santa Rosa, a city of 175,000 that was devastated by wildfire two years ago.\n\nHundreds of people arrived at the Sonoma County Fairgrounds in Santa Rosa by Sunday. Some came from senior-care facilities. More than 300 people slept inside an auditorium filled with cots and wheeled beds. Scores of others stayed in a separate building with their pets.\n\nThe Tick Fire burning north of Los Angeles has also caused significant damage and forced thousands out of their homes. (Mario Tama/Getty Images)\n\nIn central California, a tree toppled in strong wind Sunday killed a woman and injured a man who was taken to a hospital, officials said.\n\nIn the San Francisco Bay Area, gusts knocked over a nine-metre tree at a farmers' market in Martinez, injuring nine people, including a toddler. Six people left with injuries that were not life-threatening were taken to a hospital, police said.\n\nDuring the 2017 fires, winds up to 144 km/h lasted for about 12 hours. This time, the gusts were stronger and expected to last more than 36 hours, ending Monday night, said Matt Mehle, a meteorologist with the National Weather Service's Monterey office.\n\nParched vegetation from unseasonably hot weather and low humidity was already igniting elsewhere, and firefighters scrambled to keep up.\n\nTwo grass fires shut down a 10-kilometre stretch of Interstate 80, including a bridge between the cities of Crockett and Vallejo, and forced the evacuation of 200 people from California State University Maritime Academy. An ember from one fire possibly sparked the other.\n\nSmoke from another grass fire Sunday forced the closure of a stretch of Interstate 80 running through Sacramento's downtown. Meanwhile, fire officials spotted downed power lines in the area of a small fire that destroyed a building at a tennis club and three other structures in Lafayette, a leafy suburb in the east San Francisco Bay Area.\n\nThe City of Vallejo said the power blackout shut off its pumping station needed to access its well water, prompting an emergency. The city barred residents from watering yards and asked people to limit bathing and flushing toilets, reported the Vallejo Times Herald.", "description": "As nearly 200,000 people remain under evacuation order from threat of wildfire, some of the millions of people in Northern California on track to get their electricity back may not have it restored before another possible round of shutoffs and debilitating winds.", "authors": ["The Associated Press"], "top_image": "https://i.cbc.ca/1.5337693.1572258866!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/1183890100.jpg", "published_at": "2019-10-28"}