{"pub": "businessinsider", "url": "https://businessinsider.com/carli-lloyd-interview-nfl-kicker-shoots-down-critics-2019-9", "downloaded_at": "2019-09-04 00:46:00.541955+00:00", "title": "Carli Lloyd shoots down critics who say she couldn't kick in the NFL", "language": "en", "published_at": "2019-09-03", "text": "Carli Lloyd is confident she has the skill to become an NFL kicker.\n\nAfter video of Lloyd hitting field goals at a joint practice between the Eagles and Ravens went viral on social media, fans were quick to call for her to get a shot in a real game. Just days later, Lloyd revealed that some teams had contacted her with a real interest, even inviting her to join the roster for the final preseason game of the year.\n\nBut while Lloyd had plenty of supporters, there were also doubters — self-appointed kicking experts on Twitter criticized her for taking longer than a two-step approach on the ball, and claimed she might be a liability should one of her kicks get blocked.\n\nRead more: Buffalo Bills kicker Stephen Hauschka offered to help Carli Lloyd make the jump to the NFL and believes she could succeed\n\nSpeaking with Steve Serby at the New York Post, Lloyd shot down critics who didn't believe she'd be able to adjust her game to make it in the NFL.\n\n\"I have spent 15 years breaking down my technique on the soccer field and there is no reason why I can't get the technique down with a two- step field goal,\" Lloyd said. \"I love challenges and this would be a big challenge for me.\"\n\nLloyd conceded that it would take time for her to get used to the game, with regard to both kicking in pads and shortening her approach to two steps as is necessary when kicking against a defensive rush as opposed to in the comfort of a practice field.\n\nBut when it comes to the pressure of kicking in the NFL, Lloyd said that having the game on the line as she lined up a field goal would not be an issue.\n\n\"For the past 15 years I have been placed in pressure situations and that is what I enjoy the most,\" Lloyd said. \"Mentally I have worked on my mindset and know that what I have gone through would prepare me to kick a field goal in a pressure situation.\"\n\nLloyd has played at the height of her sport for more than a decade, and has proven her ability to show up when needed most — in 2015, she put away a hat trick in the opening 16 minutes of the World Cup final against Japan to seal the title for the United States.\n\nLloyd's NFL career won't begin in 2019, as she's still an important part of the USWNT that is already looking towards the Summer Olympics in Tokyo next year. But should Lloyd decide she's ready to dive into a career in the NFL next summer, she's confident she could make the changes necessary to become the first woman to ever suit up for the league.\n\nNevada awards scholarship to freshman kicker Brandon Talton after hitting game-winning 56-yard field goal in upset over Purdue\n\nTom Brady recruited Mark Wahlberg to tryout for the Patriots after he posted a shirtless photo on Instagram\n\nBears head coach Matt Nagy is obsessed with the 'double-doink' as the team searches for a solution at kicker\n\nThe group stage for the Champions League is set, and there is a clear 'group of death'", "description": "Carli Lloyd is serious about taking a shot at the NFL, and in an interview with the New York Post, explained why her doubters are wrong,", "authors": ["Tyler Lauletta"], "top_image": "https://amp.businessinsider.com/images/5d6e62312e22af6f2d1c4395-1920-960.jpg"}