{"pub": "reuters", "url": "https://in.reuters.com/article/vietnam-southchinasea-film-int/vietnam-pulls-dreamworks-abominable-film-over-south-china-sea-map-idINKBN1WT0JR", "downloaded_at": "2019-10-14 11:30:51.102076+00:00", "title": "Vietnam pulls DreamWorks' 'Abominable' film over South China Sea map", "language": "en", "text": "HANOI (Reuters) - Vietnam has pulled DreamWorks’ animated film “Abominable” from cinemas over a scene featuring a map which shows China’s unilaterally declared “nine-dash line” in the South China Sea, state media reported on Monday.\n\nBikers go past an empty space where a promotional poster for the DreamWorks film \"Abominable\" stood before being taken down at a cinema in Hanoi, Vietnam October 14, 2019. REUTERS/Kham\n\nThe U-shaped line is a feature used on Chinese maps to illustrate its claims over vast expanses of the resource-rich South China Sea, including large swathes of what Vietnam regards as its continental shelf, where it has awarded oil concessions.\n\nLast week, sports network ESPN faced criticism of its coverage of a row between the National Basketball Association (NBA) and China after using a map that featured the line.\n\nChina and Vietnam have been locked in a standoff since China dispatched a vessel to conduct an energy survey in waters controlled by Vietnam in early July.\n\n“We will revoke (the film’s licence),” Ta Quang Dong, deputy minister of culture, sports and tourism, was quoted as saying by the Thanh Nien newspaper.\n\nThe ministry is in charge of licensing and censoring foreign films.\n\n“Abominable”, about a Chinese girl who discovers a yeti living on her roof, was jointly produced by Shanghai-based Pearl Studio and Comcast-owned DreamWorks Animation and was first shown in Vietnamese cinemas on Oct. 4.\n\nThe film, which was being marketed in Vietnam as “Everest: The Little Yeti” was removed from cinemas on Sunday after images of the scene with the offending map were shared widely on social media.\n\nA spokeswoman for CJ CGV Vietnam, Vietnam’s largest cinema chain and a unit of South Korea’s CJ CGV, declined to comment.\n\nA receptionist at the state-run National Cinema Center in Hanoi said the culture ministry had issued an order requiring all cinemas to stop showing the film because of the map scene.\n\nCalls to Nguyen Thu Ha, the head of the culture ministry’s cinema department, went unanswered on Monday. The Ministry of Foreign Affairs did not immediately respond to a request for comment.\n\nAt the National Cinema Center in Hanoi, workers could be seen taking down posters for the film late on Monday.\n\n“I’d planned to watch this film but after having heard about that maritime sovereignty issue, I think I shouldn’t,” Hanoi-based student and cinema fan Phan Thi Nhi Ha told Reuters outside the center.\n\nIn August, police broke up a brief protest outside the Chinese embassy in Hanoi over the survey vessel.\n\nVietnam has repeatedly accused the vessel and its escorts of violating its sovereignty and has demanded that China remove its ships from the area.", "description": "Vietnam has pulled DreamWorks' animated film \"Abominable\" from cinemas over a scene featuring a map which shows China's unilaterally declared \"nine-dash line\" in the South China Sea, state media reported on Monday.", "authors": ["Khanh Vu", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191014&t=2&i=1440667365&w=1200&r=LYNXMPEF9D0QD", "published_at": "2019-10-14"}