{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/13/mark-esper-donald-trump-authorizes-deliberate-with", "downloaded_at": "2019-10-13 18:43:19.392418+00:00", "title": "Trump authorizes 'deliberate withdrawal' of all U.S. forces from northern Syria", "language": "en", "text": "The U.S. will begin a “deliberate withdrawal” of all its troops from northern Syria, Defense Secretary Mark Esper said Sunday.\n\nThe Pentagon chief told “Fox News Sunday” that President Trump has authorized the removal of American forces from northern Syria as the Turkish army advances in its assault against the American-backed Syrian Democratic Forces (SDF).\n\n“I’ve talked to President Trump and he is concerned. Last night he directed that we begin a deliberate withdrawal of U.S. forces from the northern part of Syria,” Mr. Esper said. “We want to make sure we do so in a very safe, deliberate manner.”\n\nMr. Trump last week pulled about 50 U.S. special forces from the Turkey-Syria border, essentially allowing the Turkish military assault to go forward.\n\nThe U.S. still has about 1,000 troops in Syria. Mr. Esper’s comments suggest that the troops will remain in the country but will get out of harm’s way as the fighting between Turkey and the SDF intensifies.\n\nThe president on Sunday morning tweeted that it is “very smart” to ensure that American forces are not caught in the middle of a conflict between the Turkish military and the SDF. The SDF was a key U.S. ally in the fight against the Islamic State, but Turkey considers elements of the group to be terrorists.\n\n“Very smart not to be involved in the intense fighting along the Turkish Border, for a change. Those that mistakenly got us into the Middle East Wars are still pushing to fight. They have no idea what a bad decision they have made. Why are they not asking for a Declaration of War?” Mr. Trump said on Twitter.\n\nWhile U.S. troops on the border were in danger when the Turkish assault began, Pentagon officials say the 1,000 American forces elsewhere in Syria face even greater threats. There are increasing signs that the SDF — which has accused Washington of abandoning them — is seeking to make a deal with Syrian dictator Bashar Assad and with Russia.\n\nOfficials say such an agreement could lead to even broader conflict and more danger for U.S. forces.\n\n“It looks like the SDF is cutting a deal with the Syrians and Russians,” Mr. Esper said. “Now what we’re facing is U.S. forces trapped between a Syrian-Russian army moving north to take on the Turkish army that is moving south. It puts us in a terrible position.”\n\nMr. Esper also said it appears Turkey’s ambition inside Syria is growing, and that Ankara now intends to go “further south than originally expected, and go both west and east.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "The U.S. will soon begin a \"deliberate withdrawal\" of all its troops from northern Syria, Defense Secretary Mark Esper said Sunday.", "authors": ["The Washington Times Http", "Ben Wolfgang"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/08/trump_33642_c0-527-6310-4207_s1200x700.jpg?caa0e60844b049821c99d60b2370aa6241b108b9", "published_at": "2019-10-13"}