{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7538349/Elizabeth-Warren-makes-fun-allegations-bondage-sex-sessions-bodybuilding-ex-marine.html", "downloaded_at": "2019-10-05 06:20:18.735026+00:00", "title": "Elizabeth Warren makes fun of allegations she had bondage sex sessions with a bodybuilding ex-marine", "language": "en", "text": "Democrat 2020 presidential hopeful Elizabeth Warren brushed off outlandish allegations she had bondage sessions with a bodybuilding marine that branded her a 'cougar'.\n\nThe 70-year-old Massachusetts senator joked about claims by two right wing conspiracy theorists that she paid for the services of a 25-year-old male escort by tweeting about her college football team - the Houston Cougars.\n\nTrump supporters Jacob Wohl and Jack Burkman held a press conference in Arlington, Virginia, yesterday to announced their latest attack on one of the president's political rivals.\n\nKelvin Whelly, a bodybuilding former US Marine, was paraded in front the media outside Burkman's house, with a sign reading 'Elizabeth Warren Cougar?' behind him.\n\nHe claims he was paid to have sex sessions with 70-year-old Warren, that included bondage and sex toys.\n\nDemocratic presidential candidate Elizabeth Warren at an outdoor rally in San Diego yesterday. In Virginia on the same day, Jacob Wohl and Jack Burkman were holding a press conference in which an ex-marine claimed he was paid to have bondage sessions with Warren\n\nBodybuilder Kelvin Whelly, who said he fought in Afghanistan, (right and left) claimed he worked for Cowboys4Angels when he was hired by Democrat presidential hopeful Elizabeth Warren\n\nWhelly said he met the senator through a male escort website, Cowboys4Angels, and that their first encounter was in August last year in Massachusetts.\n\nThe ex-Marine told the media Warren messaged him saying that he should 'bring toys' and that he should surprise her.\n\nHe went on to claim Warren was into bondage and 'violent' sexual tendencies, with the pair having 'many BDSM sessions' together.\n\nBut he offered no verifiable evidence to back up his story and the Cowboys4Angels chief executive later said, 'this guy never worked for me', after checking his records, according to Rolling Stone.\n\nWarren responded by referencing her college - whose football team is called the Cougars - and called for student debt to be cancelled and free education introduced.\n\nShe wrote of Twitter: 'It's always a good day to be reminded that I got where I am because a great education was available for $50 a semester at the University of Houston (go Cougars!). We need to cancel student debt and make college free for everyone who wants it.'\n\nEx-marine Kelvin Whelly claimed he was paid to have 'many' bondage sex sessions with senator Elizabeth Warren\n\nWarren responded to the claims made by Whelly by tweeting a picture of her college football team - the Houston Cougars\n\nDuring Wohl and Burkman's chaotic press conference, shrieks of laughter could be heard as they addressed the small number of people gathered at the foot of the steps.\n\nOne member of the audience played the Patsy Cline song 'Crazy', as Whelly read a statement about his alleged sordid encounters with Warren.\n\nAs he described using a 'cat of nine tails', Whelly himself began to smirk.\n\nHe claimed he was, 'shocked by the intensity, duration, and shear violence of what senator Warren wanted' during their meetings at hotels.\n\nWhelly also told the audience Warren said she was in an 'open relationship' with her husband and that, 'in my line of work this is a fairly common arrangement'.\n\nHe then removed his shirt to reveal scars on his back which he claimed were caused by bondage session with Warren.\n\nA member of the audience appeared to find his Instagram page and claimed it showed pictures of Whelly's back injuries dated from before the alleged encounters.\n\nBurkman and Wohl previously worked together in a failed attempt to create false sexual harassment allegations against former special counsel Robert Mueller who probed alleged Russian collusion into the 2016 presidential campaign.", "description": "Massachusetts senator Elizabeth Warren hit back at claims by two right wing conspiracy theorists that she paid for the services of a 25-year-old male escort. Kelvin Whelly they had bondage sessions.", "authors": ["Chris Dyer For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/04/17/19306168-0-image-a-33_1570206603396.jpg", "published_at": "2019-10-04"}