{"pub": "politico", "url": "https://politico.com/magazine/story/2019/09/10/jerry-falwell-nightclub-photos-miami-228054", "downloaded_at": "2019-09-10 23:31:04.862510+00:00", "title": "New Photos Emerge of Falwell at Miami Nightclub", "language": "en", "text": "Brandon Ambrosino is a writer living in Delaware. His articles have appeared in the New York Times, Boston Globe and the BBC, among other outlets.\n\nOne day after POLITICO published a piece in which Jerry Falwell Jr. denied visiting a Miami Beach nightclub in July 2014 and alleged that any images showing such were “photo-shopped,” a new trove of photos showing Falwell at the club has been released.\n\nSeth Browarnik, the owner of World Red Eye, a photography company that documents Miami’s bustling nightlife scene, says he was unaware how many photos he had of Falwell until Falwell alleged that his site’s images were manipulated—prompting Browarnik to explore his photo archive to prove otherwise.\n\nStory Continued Below\n\nOn Tuesday, Browarnik published the newly unearthed photos on his website, WorldRedEye.com, along with a strongly worded “rebuke” of Falwell’s claim of photoshopping.\n\n“First things first,” Browarnik told me over the phone, “we didn’t even know [Falwell] was in the photos. Number one! Finding him in the crowd is like a ‘Where’s Waldo?’”\n\nBrowarnik lives high up in a South Beach skyrise, from which he can see the Falwell-owned Miami Hostel. Not that the owners of the flophouse crossed Browarnik’s mind that often. He didn’t even know his company had taken any photos of Liberty University’s first family partying at Wall, a Miami Beach nightclub, until he saw them identified in the piece published by POLITICO yesterday.\n\n“All of a sudden, I scroll down and say, ‘Oh my god!’” Browarnik said.\n\nIt wasn’t an exclamation of excitement as much as indignance. In the article, Jerry Falwell Jr. repeatedly claimed that the photos—which POLITICO obtained from World Red Eye, which World Red Eye has had on their website for five years, and which show Falwell partying at Wall on July 19, 2014—were manipulated. “If the person in the picture is me, it was likely photo-shopped,” Falwell said.\n\nBrowarnik said he felt insulted. “My integrity is everything in this business,” he said.\n\nJerry Falwell Jr. did not immediately respond to a request for comment.\n\nFor the past 21 years, Browarnik has photographed Miami nightlife. Because of his trusted reputation as a photographer, he thought it was important to quickly quash Falwell’s accusation.\n\n“That’s why I have an archive of five million photos,” Browarnik told me. “That’s why we catalog everything.”\n\nWhile reviewing images from the night in question, Browarnik discovered several previously unpublished photos from that evening in which Jerry Falwell Jr. and other members of the Falwell family can be seen—including Jerry’s wife, Becki, sons Trey and Wesley, and Trey’s wife, Sarah. In the images, the Falwells can be seen in the middle of the club’s dance floor while lasers and other light effects reflect around them. In at least two photos, Falwell family members can be seen holding alcohol. (Liberty University is notoriously strict about alcohol consumption, and students can receive demerits for co-ed dancing and be expelled for drinking.)\n\nA zoomed-in crop of the large nightclub dance floor photo at right reveals Jerry Falwell Jr., Becki Falwell and Wesley Falwell, among others. | Seth Browarnik/WorldRedEye.com\n\nBrowarnik told me that while the photographer who took the images of the Falwell family no longer works for his company, they took meticulous notes on the photo subjects, as all of his photographers do. Among those notes: the name Trey Falwell, which accompanied a photo of Sarah and Trey Falwell on World Red Eye’s original post of the images in 2014.\n\n“If we didn’t take [Trey’s] name, it [would have been] non-existent,” Browarnik exclaimed.\n\nIn the statement posted on WorldRedEye.com, Browarnik said he “wholly reject[s] Jerry Falwell Jr.’s baseless allegation … that one of our pictures was ‘photo-shopped’ or manipulated in any fashion.”\n\nThe photos in question came to light in yesterday’s article on Jerry Falwell Jr.’s stewardship of Liberty University. During the reporting of that article, POLITICO contacted World Red Eye to purchase photographs showing Jerry and Trey Falwell at Wall nightclub in Miami.\n\nIn the statement published to his website today, Browarnik admitted to not knowing the reason for POLITICO’s purchase. “I was as surprised as anyone to discover that Mr. Falwell was among the partygoers we photographed on July 19, 2014 at WALL Lounge,” he said.", "description": "Owner of Miami nightlife website finds additional images rebutting Jerry Falwell Jr.’s claims of photoshopping.", "authors": ["William J. Perry", "Brandon Ambrosino"], "top_image": "https://static.politico.com/77/a6/411ff0f7468ea2fe4a86c9ac9201/mag-ambro-falwell-club-773.jpg", "published_at": "2019-09-10"}