{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/11/david-urban-ex-trump-campaign-director-gets-behind", "downloaded_at": "2019-10-11 20:01:58.350829+00:00", "title": "Ex-Trump campaign director gets behind fight to free American jailed in Russia", "language": "en", "text": "David Urban, a former member of President Trump’s election campaign, has stepped up to help fight to free Paul Whelan, a former U.S. Marine jailed in Russia, it emerged Friday.\n\nLobbying disclosure paperwork shows Mr. Urban, Mr. Trump’s former Pennsylvania campaign director, will work in support of securing Mr. Whelan’s release, Axios first reported. An individual familiar with the situation confirmed to The Washington Times that Mr. Urban will take up the cause free of charge.\n\nMr. Whelan, a 49-year-old Michigan native, was arrested in Moscow last December and has been imprisoned ever since. Russian authorities have accused him of spying but have failed so far to produce any evidence publicly to support their claim.\n\nPartnering with Mr. Urban, a confidant to the president with ties to multiple members of his administration, will effectively give Mr. Whelan’s family “one of the best-connected advocates in Trumpworld,” Axios reported.\n\n“We’re grateful Mr. Urban has volunteered to throw his considerable influence and strategic thinking behind the effort to free Paul,” Mr. Whelan’s brother, David, told Axios. “His support means a great deal to us, and we hope it will spur U.S. officials to further prioritize Paul’s release.”\n\nA former member of the Marine Reserves, Mr. Whelan was arrested while in possession of a USB drive containing classified information, according to Russian authorities. He said during a court hearing last month that he was “set up,” and that a longtime acquaintance — an officer of Russian intelligence services — had placed something in his pocket moments before his arrest.\n\n“This case is an absurd provocation. No evidence of crime exists,” the detained American said in a Russia court hearing last month.\n\nThe State Department has repeatedly condemned Moscow over Mr. Whelan’s imprisonment, and Jon Huntsman, the former U.S. ambassador to Russia, called for his release after visiting him behind bars during his last day in the post this month.\n\nHouse and Senate resolutions condemning Russia for detaining Mr. Whelan were introduced on Capitol Hill last month and have garnered the support so far of 20 co-sponsors.\n\nMr. Urban helped organize the Republican National Convention in 2016, in addition to advising Mr. Trump’s presidential election campaign and leading its operations in the Keystone State. He has since become a commentator on CNN.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "David Urban, a former member of President Trump's election campaign, has stepped up to help fight to free Paul Whelan, a former U.S. Marine jailed in Russia, it emerged Friday.", "authors": ["The Washington Times Http", "Andrew Blake"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/05/24/russia_us_spying_44537_c0-0-5000-2916_s1200x700.jpg?940728e6429bb3049c5a51684d5eb8813ef78c36", "published_at": "2019-10-11"}