{"pub": "dailybeast", "url": "https://thedailybeast.com/kanye-wests-pseudo-religious-sunday-service-sparks-walkouts-in-new-york-city", "downloaded_at": "2019-10-01 04:27:46.520010+00:00", "title": "Kanye West’s Pseudo-Religious Sunday Service Sparks Walkouts in New York City", "language": "en", "text": "Kanye West has paraded his Sunday Service through a number of venues and churches across the country over the past few months in an effort to promote his upcoming album Jesus Is King. The experience, set during the typical Sunday morning time that many Christians attend church for praise and worship, is meant to mirror those services. But in New York, West’s latest service missed the spiritual mark and, instead, gave the congregation a deeper look into how the music artist truly views himself.\n\nService was fairly typical at The Greater Allen A.M.E. Cathedral on Sunday in Jamaica, Queens. Apart from church officials feeling the need to put on their “Sunday best” with multiple presentations and a sermon that was handpicked because there was going to be a special guest, everything nothing seemed out of the ordinary. Dedicated church members were in attendance, and the choir sang their usual bouts of gospel.\n\nThen, after the preacher closed his sermon, the podium was moved from the pulpit to the house floor. Many churchgoers recognize the pulpit as a sacred place where few can set foot during service. It’s the altar where people feel closer to God, where baptisms take place, where the pastor experiences their own spiritual revelation and preaches the word of the Gospel. The crowd suddenly swelled, as dozens of first-time guests were spread throughout the audience, waiting for the tardy Kanye West performance to begin.\n\nBut the spectacle didn’t start until Kim Kardashian West, donning a white tank top sans bra and khaki pants, sauntered in through the side door. Other celebrity guests slipped in through the back of the church. For the non-VIPs it remained a standing-room only affair, as droves of people stood in rows behind the pews with no seats left for a clear view. The music director of Sunday Service, Jason White, took to the pulpit and called the rest of the choir toward the front. A hundred singers marched toward the altar and took their places to sing by the pulpit—with their backs to the church congregation—and Sunday Service began.\n\nThe experience was moving, but not for the expected reasons (and possibly why several regular members walked out in the middle of the performance). The choir’s harmonies were awe-inspiring—despite the pre-recorded songs playing alongside their singing. They were enthusiastic, dancing and clapping in rhythm—even if West only accompanied them on a few songs by playing the keyboard, occasionally rapping lyrics from his secular songs that he’s retooled to make religious, or by crooning an off-key solo.\n\nInstead, West’s Sunday Service had the feel of slaves worshipping on a Southern plantation, praising select scripture that’s been provided in order to keep them in line. Greater Allen A.M.E. Cathedral is a predominately black church with roots in African-American rights and equality in worship and society—a far cry from West’s MAGA embrace. Rather than uplifting that history, West’s take on religion was very much based on loving and following Jesus blindly, as many slaves were taught to do to remain subservient and obedient to their masters. (And this from a man who once called slavery “a choice.”)\n\nThe experience also provided its own preacher, Los Angeles-based Adam Tyson. A white pastor, he led a sermon on forgiveness, provided no scripture, and lost the congregation via tone-deaf jokes that fell flat on the mostly black church. (He attempted to make a joke about the Lakers, but New Yorkers could care less.) It came across like an antebellum preacher using his overseer to keep the rest of the slaves blindly obedient.\n\nMeanwhile, West still portrayed the level of egotism that we’ve come to expect from him. Yes, he’s taken a new approach with his supposed passion for Christianity but, attending one of his Sunday Services, one can’t help but notice how he’s both deified himself with these “religious” proceedings, fostering his cult of personality. So many flocked to Greater Allen A.M.E. Cathedral with their Yeezies on, sang along ecstatically to every word, trailed his car until it left the church parking lot, and even followed their leader to the listening party for his delayed-once-again gospel album.\n\nThe concept of “Sunday Service”—enlightening a younger generation through relatable music, a choir dressing to express themselves as individuals, and celebratory dancing—seems inspiring, if it wasn’t a Kanye West Experience. Any sense of self seems lost within Sunday Service, particularly for African-Americans. Instead of a form of spiritual revival, it’s more akin to a high concept musical performance masquerading as religious—and all in the name of profit.", "description": "Yeezus held his infamous “Sunday Service” performance at The Greater Allen A.M.E. Cathedral in Queens, New York, where a number of regular churchgoers walked out mid-performance.", "authors": ["Brooke Leigh Howard", "Breaking News Video Reporter"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569902871/190930-howard-west-tease_sexprs", "published_at": "2019-10-01"}