{"pub": "nymag", "url": "https://vulture.com/2019/09/this-is-us-sad-characters-ranking.html", "downloaded_at": "2019-09-25 04:36:31.047986+00:00", "title": "This Is Us: Which Character Is The Saddest?", "language": "en", "text": "Welcome to the Sadness Vortex. Photo: Ron Batzdorff/NBC\n\nDid you have a great summer full of laughter, joy, and truly immeasurable amounts of fun, while also sweating? Well, it’s time for shorter days, cooler air, and forgetting that happiness ever existed. It’s fall! And the perfect TV show to help you in this seasonal and emotional transition is, of course, the weepiest drama to ever weep: NBC’s This Is Us, a show whose original title could have easily been Everyone Is Sad. Everyone on this show is walking around like their dad died because of a malfunctioning crock pot — which for many characters is a thing that happened!\n\nBut not everyone is the same amount of sad. So ahead of the This Is Us season-four premiere, Vulture took a deep dive into the sadness that is life with the Pearsons to figure out who is just mildly sad, taking on the tragedy that life (and the writers) gave them and getting on with it, and who is so crippled by the laundry list of terrible things that have happened to them that producing a single tear to delicately fall down their cheek has become akin to breathing. (Looking at you, Randall!) It’s time to figure out who is the saddest on This Is Us.\n\n38. Yvette\n\nIs she sad? Frustrated that she continuously has to explain Randall to his own parents? Yes. Sad? No.\n\nBut why? She just seems pretty together. She’s very patient with Rebecca and Jack and she’s also got great style. She does not reek of sadness one bit.\n\nOkay, but is she the saddest? Far from it! Unless we eventually get some tragic backstory about her parents being murdered by a karate instructor or something (twist!), which, honestly, I’ve watched each episode of this show several times and I would not be surprised.\n\n37. Annie Pearson\n\nIs she sad? Mostly no, because she is an innocent child, but sometimes yes, because she is a Pearson.\n\nBut why? For someone who has only been on this earth for a short time, she has suffered loss both great (Grandpa William!) and small (Mr. McGiggles!).\n\nOkay, but is she the saddest? We haven’t met Annie in the future yet, so things could change, but for now, that little kid is the most free of all of us — which speaks volumes of her character, since she repeatedly has to give up her bed for other family members when you know that house has more than three bedrooms!\n\n36. Audio Pearson-Damon\n\nIs he sad? Honestly, what dog isn’t at some point?\n\nBut why? Well, he was left in a dog shelter, so that’s sad. But then he was adopted, so that’s nice! But his human parents are Kate and Toby, which is a real hit-or-miss, depending on the day.\n\nOkay, but is he the saddest? No — he’s the cutest boy in the world!\n\n35. Baby Jack Pearson-Damon\n\nIs he sad? It’s the most dominant family trait, so he doesn’t have much of a chance.\n\nBut why? Baby Jack is over here trying to figure out breathing, meanwhile he has to listen to his mother and grandmother snap at each other all day long. Not cool, ladies.\n\nOkay, but is he the saddest? Not yet!\n\n34. Jae-Won\n\nIs he sad? He wasn’t, but then he met the Pearsons, a.k.a. the Sadness Vortex.\n\nBut why? When we first meet Jae-Won, all we know is that he is into politics, he lives in the K-town section of Philly, and he’s very nice to his Grandma. He is not sad (that we can discern), but then he starts working for Randall Pearson, and he’s sighing on the regular.\n\nOkay, but is he the saddest? No, but as a relatively new addition to the Sadness Vortex, he’s only going to get sadder.\n\n33. Sloane Sandberg\n\nIs she sad? As much as any millennial playwright trying to get her show produced so she can show up her perfect sister.\n\nBut why? Nothing she does is ever good enough for her parents! She has one shot to make her playwright dreams come true and they cast the Manny! She gets sucked into the hellscape that is the Kevin Pearson-Olivia Maine melodrama! You take your pick.\n\nOkay, but is she the saddest? Her play is well received, despite that whole opening-night thing, in which the lead runs away to save his brother mere seconds before the show is about to begin. So that, at least, works out.\n\n32. Shelly Rivas\n\nIs she sad? We haven’t seen Shelly in a while, but I’d guess she’s more angry than sad.\n\nBut why? Her divorce from Miguel in the ’90s was messy, and from the tidbits Miguel drops postdivorce, it doesn’t sound like things ever got easier. And then at some point she had to discover that her ex-best friend and ex-husband were getting married, so that’s cool.\n\nOkay, but is she the saddest? She doesn’t seem that sad when she and Miguel tell their friends they’re splitting up, but I’d prefer some visual confirmation on her recent level of sadness before making a permanent ruling.\n\n31. Janet Malone\n\nIs she sad? She’s awful. Does that count?\n\nBut why? Rebecca’s mother is overbearing, demanding, impossible, and definitely racist. On top of all of that, she does have a hint of sadness to her. Although we haven’t been privy to much of Rebecca’s childhood, we do know that Mr. Malone treated Janet more like a live-in waitress than a wife, and that’s got to take a toll on a person.\n\nOkay, but is she the saddest? If this show tries to make me feel bad for this woman, so help me!\n\n30. The Actual Back of an Egg\n\nIs it sad? If I had to guess, I’d say, yes, a little.\n\nBut why? Because for all its egg life, the front of the egg has gotten all the glory! What does the back get?!\n\nOkay, but is it the saddest? No way! Finally, it gets its due as the titular character in the Off Broadway production of The Back of an Egg, starring the Manny himself, Kevin Pearson.\n\n29. Sophie\n\nIs she sad? Honestly, I’m both worried and proud that she isn’t sadder.\n\nBut why? She’s been burned pretty badly by Kevin, twice: First, when he cheated on her during their marriage, and then again when they tried to make things work 12 years later, but he spiraled and blew everything up once again. That’ll leave a mark.\n\nOkay, but is she the saddest? Oh no she isn’t! She meets a KINDERGARTEN TEACHER who loves Billy Joel and is very kind to her all the time and, as far as I know, is not crippled by the emotional baggage left from his father’s untimely death. Get yours, Sophie!\n\n28. Abe Clarke\n\nIs he sad? Only a normal amount.\n\nBut why? Beth’s dad is diagnosed with cancer when Beth’s a teenager — anyone would be sad!\n\nOkay, but is he the saddest? For a dying guy he’s pretty positive, and regardless of how sick he got, he never stopped encouraging Beth to pursue her dreams. We should all be more like Abe! Okay, now I’m sad. Abe got a raw deal!\n\n27. Beth Pearson\n\nIs she sad? It’s truly a miracle she isn’t sadder after standing so close to the Sadness Vortex for so long.\n\nBut why? Beth has every reason to sad-sack around town: Her dad — her favorite person and biggest fan — died when she was a teenager; her dreams fell apart; her mother was cold … oh, does this sound like I’m describing Kate Pearson? That’s because the two suffer almost the same fate, but Beth! Doesn’t! Wallow!\n\nOkay, but is she the saddest? You don’t have the time to be sad when everyone around you is ugly crying while sliding down a wall.\n\n26. Carol Clarke\n\nIs she sad? Her “I’m a tough but fair principal and a mother who wants her kids to excel” act is a good one, but deep down, she sad.\n\nBut why? Well, the love of her life died from lung cancer and she pushed all of her children away with that aforementioned tough-mom act. She’s lonely!\n\nOkay, but is she the saddest? No — Beth’s mom is resilient and also seems open to suggestions as to how to just relax, lady. When she and Beth have their breakthrough chat in “Our Little Island Girl,” things start to change for Carol.\n\n25. Pilgrim Rick\n\nIs he sad? Oh, you mean the creepy guy who works at a remote motel in the woods on Thanksgiving and enjoys scaring children by grilling them about the Mayflower while wearing a Pilgrim hat? Yeah, I’d say there’s a sadness about him.\n\nBut why? Please see above.\n\nOkay, but is he the saddest? Surprisingly, no. It’s probably because the only two movies he watches all day long are Police Academy 3 and 9 and 1/2 Weeks. Who could be sad after that double feature?\n\n24. Toby’s Parents\n\nAre they sad? I’m lumping them together because those two deserve to be stuck on a ridiculous list with one another for the rest of eternity. And yes, of course they’re sad.\n\nBut why? Toby’s mother suffers from depression and Toby’s father isn’t supportive in any way. Their divorce is awful and they’ve been at each other’s throats ever since. Parents!\n\nOkay, but are they the saddest? I was going to ding them for that time they tried to stop Toby from marrying Kate because they had concerns, but honestly, that might just be good parenting.\n\n23. Olivia Maine\n\nIs she sad? Is Olivia Maine really sad or is she just acting? Because Olivia Maine is a serious thespian!\n\nBut why? Her parents sound horrible based on her Tales of Maine Thanksgivings, but I have zero sympathy for a person who meets a dying man and 15 minutes later is like “How does it feel to be dying?” What a dick!\n\nOkay, but is she the saddest? Her “I’m Finding Myself” Drastic Blonde Bob haircut would like you to think so, but we know better.\n\n22. Madison\n\nIs she sad? Kate’s BFF has a lot of issues and yes, a secret sadness is one of them.\n\nBut why? Seems like she’s had an eating disorder and body dysmorphia most of her life. She’s also pretty annoying, so it doesn’t look like she’s overflowing in the friends department. Oh, and remember that time she was just trying to be a good friend to Kate, who was going into labor prematurely and the Pearson family basically kicked her out? Sometimes the Pearsons are the worst.\n\nOkay, but is she the saddest? She certainly makes me feel sad, but alas, she is not the saddest on this list.\n\n21. Joe the Firefighter\n\nIs he sad? He’s at the “My marriage is falling apart so I think stealing a kid to fix it is a good idea” level of sad.\n\nBut why? His marriage is falling apart and he thinks stealing a kid to fix it is a good idea! He’s just a man who loves his wife! And cigarettes!\n\nOkay, but is he the saddest? The last time we saw him, he and his wife Samantha decided to truly fight for their marriage and for one another, so I feel like things turned around for ol’ Joe.\n\n20. Louie the Dog Pearson\n\nIs he sad? Oh lord, yes.\n\nBut why? When Jack and Rebecca find him wandering the neighborhood, he looks like he’s had a ruff life. (You get it.) He pees on the carpet a lot, which is usually a sign of some underlying issues. Oh, and he almost dies in a fire, is rescued by a very Hot Dad, who then dies, and Louie, being a constant reminder of that death, is rejected by the teenage girl who loved him most.\n\nOkay, but is he the saddest? Poor Louie didn’t ask for any of this! He’s probably fine, though.\n\n19. Tess Pearson\n\nIs she sad? Sometimes!\n\nBut why? Well, she comes out to her family at, like, 10, so that’s tough — trying to figure out who you are at any age is hard, but 10? Adult Tess, although very happy in her dream job as a social worker, is dealing with the impending death of her grandmother (and who knows what else!), so she does have an air of sadness about her in the future as well. Family tradition, really.\n\nOkay, but is she the saddest? No, but honestly if anyone has the right to be, it’s the person who was named after a fan.\n\n18. Stanley Pearson\n\nIs he sad? He’s mostly a monster, but, yes?\n\nBut why? By all accounts, Jack’s dad is awful until his dying day, but in “Vietnam” we learn that he wasn’t always that way — his own father was also an abusive alcoholic and he followed suit. Plus, both of his sons go off to Vietnam and one comes back a complete shell of his former self and the other hates Stanley even more than when he left.\n\nOkay, but is he the saddest? If only that were his problem.\n\n17. Cousin Ricky\n\nIs he sad? Um, have you heard him sing “We Can Always Come Back to This?” because that song is sadness.\n\nBut why? Getting so close to achieving your dreams but not making it is hard.\n\nOkay, but is he the saddest? When Old Ricky and William make amends before William dies, Ricky seems a little sad, but he’s definitely lived a life, you know? Anyway, I’m going to go listen to his song and let a single tear roll down my face and into my coffee, byeeeeee!\n\n16. Zoe Baker\n\nIs she sad? Yes, but she seems fairly well adjusted considering everything she’s been through.\n\nBut why? Her father abused her for years, then her mother abandoned her and she lived with Beth’s family; her emotional baggage has ruined many relationships; she’s a little aimless; and she’s constantly bothered by people asking her about her skin-care routine, I would assume.\n\nOkay, but is she the saddest? Definitely not. She’s sad, but seems to be confronting her issues pretty head-on? And, like, moving forward with her life in a healthy way? When Kevin relapses and lies to her about it, she takes them to couples therapy. When the conversation about kids comes up, she knows she doesn’t want any and she’s straightforward about it with Kevin, rather than angsting. Is she on the wrong show?\n\n15. Miguel’s Kids\n\nAre they sad? I mean, did you see these two sad sacks sitting across from Miguel and Rebecca at the most awkward Thanksgiving dinner on This Is Us? And let me remind you that this show had a Thanksgiving dinner in which a man confronted his mother about lying to him about his birth father for 36 years, so that’s kind of a big title to carry.\n\nBut why? Obviously their parents’ contentious divorce did a number on Andy and Amber, and it’s clear that Andy’s anger and disrespect toward Rebecca at the dinner table is a mask for how much he misses his dad. Still, do not come at the queen, Andy.\n\nOkay, but are they the saddest? No, but once we get a little more backstory on them, who knows?\n\n14. Miguel Rivas\n\nIs he sad? Did you see his face that time Kevin told him he wasn’t allowed to be Pilgrim Rick? And that’s like, the least of it.\n\nBut why? Miguel was bullied as a kid. He goes through a terrible divorce. His children resent him for, like, an enormous amount of time. His best friend dies, and even after ten years of marriage to Rebecca, the Pearsons don’t fully accept him.\n\nOkay, but is he the saddest? He certainly could be, but he sets his sadness and grief aside to constantly help Pearsons of all generations. I mean, that conversation he has with Kevin about being “Jack Pearson’s son?” I can only watch it if I know I have a gallon of ice cream ready in the freezer. Miguel is too good for this world!\n\n13. Dr. K\n\nIs he sad? There are no hard and fast rules for deciding this, but maybe “openly weeping in front of your wife’s gravestone” should be one?\n\nBut why? Dr. K’s dear wife Caroline is dead! And they were married for like 300 years, I think! And he doesn’t want to live without her! Also, his kids are mean!\n\nOkay, but is he the saddest? No way! He rolls into Jack’s funeral at the age of 90 — having survived a car accident in his 80s, need I remind you — and he’s shacked up with that hot widow from the grocery store, still dispensing life advice. What a rebound!\n\n12. Randall Pearson\n\nIs he sad? Randall is tricky because he says things like “A Thanksgiving Dad is a Hot Dad” but he is also king of the single tear.\n\nBut why? Have you been watching this show? He deals with intense abandonment issues from being left at a fire station as a baby, leading to debilitating anxiety attacks because he needs to constantly be the best, be on top of everything, make everyone happy, and be worthy. It’s exhausting just writing about it! Oh, and his dad dies when he’s 17, then he learns his mom has been lying to him about knowing his birth father for his entire life, AND THEN when he finds his birth father, he only gets a few months with him before he dies of stomach cancer. On the plus side, he has a great family, has been successful career-wise, has great abs, and does get some precious time with William. It’s not all bad, and Randall knows it.\n\nOkay, but is he the saddest? No. He may be prone to severe anxiety attacks and is the best crier this world has ever known, but he never seems to live in his sadness for too long, unlike some other Pearsons we know.\n\n11. Marilyn Pearson\n\nIs she sad? Oh, Marilyn.\n\nBut why? We have very little info on Jack’s mom, especially what becomes of her after Jack makes her move out of her abusive husband’s house. (We do know she knits onesies for the Big Three, but what else?) But any time we’ve seen her, things have been dire: She’s in a toxic marriage; she’s not able to keep her sons safe from their father; and then there was the whole Nicky-in-Vietnam thing. Someone needs to protect Marilyn at all costs, is what I’m saying!\n\nOkay, but is she the saddest? My fingers are crossed that Jack gets her out of that house permanently and she spends the final act of her life knitting terrible onesies. Or Terrible Towel Onesies, as it were.\n\n10. The Crockpot\n\nIs it sad? Honestly, so sad.\n\nBut why? First of all, it was 1,000 years old when those kindly old neighbors handed it over to new couple on the block Jack and Rebecca. It was probably like, Please don’t keep me! I will only cause you pain! and that’s no way to live. And then it lasted another 17 years, seemingly bringing joy and piping-hot meat concoctions (redundant, I know) to a nice family, only to completely spiral one evening, burning that family’s home and their memories to the ground in a truly gutting montage, ultimately killing the patriarch. It, too, burns up in that fire, but even that crockpot would agree — it got what it deserved.\n\nOkay, but is it the saddest? Don’t think I didn’t consider it!\n\n9. Jessie\n\nIs he sad? This man.\n\nBut why? For starters, his cocaine addiction ruined his life. Then late in life he meets his great love in William, who runs off without a word when Randall comes knocking, and when they do finally reconnect, William only has months to live. Months!\n\nOkay, but is he the saddest? Perhaps at one point in his life he would’ve taken the title, but not now. Not with this crew. Still, that phone call with Randall after William dies? When he says William “was soft armrests for weary souls to lean on?” That’ll give you a “I don’t think I can hold in my emotions anymore, so I go put a dish in the sink so that no one can see my face and briefly let it out before taking a deep breath and heading back to the party” type of cry, you know?\n\n8. Deja\n\nIs she sad? Yes.\n\nBut why? Tossed into some troubling foster-care situations, having to see her mother put in prison, spending several nights in her mother’s car, and ultimately learning that her mother gave up her parental rights so that Deja could be adopted by Randall and Beth did not make for an easy childhood. Doesn’t knowing that her mom’s nickname for her was “Tater Tot” just kick you in the shins?\n\nOkay, but is she the saddest? She definitely smashed a car with a baseball bat because she was sad, but for now she seems to be turning her sadness into a burgeoning career as a Motivational Speaker For Sad Dads Who Need to Get Their Act Together, which is very impressive for a seventh-grader.\n\n7. Toby Damon\n\nIs he sad? Big time!\n\nBut why? He’s clinically depressed and his mother suffers from the same condition. His parents, both before and after they divorced, are pretty terrible. (Parents on this show are either complete disasters or magical angels — there is no in-between.) His own divorce was not kind to him. His son is born premature and that’s insanely scary. He is not nor ever will be Jack Pearson. Oh, and he’s extra sad in the future (and not wearing his wedding ring!), so who knows what tragedies he has left to suffer. What a cool and fun thing to look forward to!\n\nOkay, but is he the saddest? At least in the present-day timeline, he’s trying his hardest not to be.\n\n6. Jack Pearson\n\nIs he sad? JAAAAAAAAAACK!\n\nBut why? Jack has had some shitty things happen to him: His dad, all the Nicky stuff, the horrors of Vietnam in general. Jack has also done some shitty things: Hidden his alcoholism from his wife, been dismissive of his wife, gotten insanely possessive of his wife even though that musician guy was in no way a threat (let’s be real), bought a house without asking, ran back into a fire, exchanged a really great mustache for a terrible goatee, etc. Because of all of these things, we know that Jack is much sadder than he lets on, even when he’s voguing.\n\nOkay, but is he the saddest? No. He genuinely loves his life despite some of the things he’s suffered … which in turn makes me sadder than I felt just a minute ago. Nobody wins on This Is Us, not even the audience.\n\n5. Kevin Pearson\n\nIs he sad? Did you not see him openly weeping on his one-night stand’s lawn?\n\nBut why? Like his father, Kevin’s adept at hiding how sad he actually is, but when he can’t hide it any longer, hoooo boy. He’s felt left out and ignored his entire life, which made him a grade-A dick a lot of time, and although his guilt isn’t as pronounced as Kate’s, he still feels at fault for not being home the night of the house fire. It certainly doesn’t help that his last conversation with his dad was a fight in which Kevin insulted his entire existence. Real cool, bro. All of this has made his attempts to get sober and not totally fuck up his life extra hard. But he’s trying to make the best of things?\n\nOkay, but is he the saddest? There are sadder people on this show, but Kevin makes me, personally, feel the saddest out of everyone. Kevin gets no respect!\n\n4. Kate Pearson\n\nIs she sad? YEESH.\n\nBut why? Obviously all the Pearsons are sad — that’s why we’re here — but Kate really wallows in it. Look, we know you think you murdered your dad because you were obsessed with your dog and your dad was obsessed with making you happy. We get it. That moment has completely defined Kate’s life up to the time we meet her in the pilot and has totally derailed any plans she had for her life. Not to mention, she already had both body and mommy issues before Jack died. She was walking around with a lot of sadness even before marrying Toby, who is a lot, and she just had a premature baby. So I don’t see it ending any time soon.\n\nOkay, but is she the saddest? Not at the moment, but the mystery surrounding her whereabouts in season three’s flash to the future have me wondering if she’ll be making a last-minute play for the top spot.\n\n3. William Hill\n\nIs he sad? On his deathbed, William tells Randall that people may think his life is sad, but he doesn’t. The two best things in his life were the person at the beginning and the person at the end, and I’m crying again.\n\nBut why? William is the kindest, sweetest soul, but after his mother dies he gets involved with drugs and everything falls apart: He never goes back to Memphis to build a music career, his girlfriend dies giving birth to his son, who he then leaves at a fire station, and it takes years before he gets clean. And then he gets cancer. But! He is reunited with his son and meets his grandchildren before he dies, and he knows how special that is. William makes me unbelievably sad, but he’d probably be offended by that assessment. Rip out my heart and stomp on it, why don’t you?\n\nOkay, but is he the saddest? No, because he finds joy in unexpected places. (Remember how happy he is to drive Randall’s car? And that he talks to the mailman?) But I still think I need to go lie down in the dark for a while.\n\n2. Rebecca Pearson\n\nIs she sad? Have you met her?\n\nBut why? Her parents were awful; her singing career never panned out; she lost a son in childbirth; her angel husband died in a horrifyingly tragic way and now she can never eat candy bars ever again; she kept a secret from her beloved son for 36 years and then had to face the consequences for that; she had to make a tearful apology while wearing a plastic fedora; and oh yes, it seems like eventually she gets dementia. It makes sense that she constantly walks around looking like she wants to curl up in the fetal position and call it a day.\n\nOkay, but is she the saddest? She’s almost the saddest, especially after that speech she gives Randall in 2008 telling him that since Jack died, every single moment of happiness she has is always a little bit sad, which, holy hell, is sad. But Rebecca’s also known great love — twice! So there’s someone who beats her out by the smallest of margins …\n\n1. Nicky Pearson\n\nIs he sad? Hold me, please.\n\nBut why? I didn’t think This Is Us could get sadder, and then they told the story of Jack’s not-so-dead younger brother Nicky. The Vietnam war completely destroys the sensitive, kind Nicky: He’s a shell of a person even before he gets high and accidentally causes an explosion that kills a young Vietnamese boy and forces Jack to cut Nicky out of his life for good. Nicky spends the rest of his days alone, not dealing with his crippling addiction or the guilt that has consumed him. And then his nephews and niece come knocking on his trailer door to inform him that his brother died almost 20 years ago and he’ll never get to mend that relationship. I’m holding out hope that the fact that we see Nicky sitting at Ancient Rebecca’s bedside in the future means things turn around at least a little bit for the guy, but until then, I need to go cry while sitting on the shower floor because I don’t even have the strength to stand up anymore.\n\nOkay, but is he the saddest? Dear lord, I hope so.", "description": "Ahead of the This Is Us season 4 premiere, Vulture took a deep dive into the sadness that is life with the Pearsons to rank every character by how well they’ve dealt with all the tragedy life (and the writers) have thrown at them.", "authors": ["Maggie Fremont"], "top_image": "https://pixel.nymag.com/imgs/daily/vulture/2019/09/24/24-this-is-us.w1200.h630.jpg", "published_at": "2019-09-24"}