{"pub": "yahoo", "url": "https://news.yahoo.com/apple-iphone-11-iphone-11-pro-iphone-11-pro-max-hands-on-220301897.html", "downloaded_at": "2019-09-12 07:32:20.700623+00:00", "title": "Apple’s iPhone 11 lineup is worth it for the camera alone", "language": "en", "text": "Apple’s iPhone 11, iPhone 11 Pro, and iPhone 11 Pro Max are officially here. The phones, which Apple (AAPL) unveiled on Tuesday, will be available on Sept. 20 and cost $699, $999, and $1,099, respectively.\n\nFor its latest generation of smartphones, Apple put much of its focus on its cameras. The iPhone 11 now gets two 12-megapixel cameras equipped with wide-angle and ultra-wide angle lens. The iPhone 11 Pro and 11 Pro Max, meanwhile, gets those same cameras, as well as a third 12-megapixel camera with a telephoto lens.\n\nThere’s more to the new iPhones than their cameras, of course, but after using them for a brief period, I can say that the cameras are likely more than enough to get consumers to trade in their older iPhones.\n\nCamera changes\n\nThe iPhone 11 Pro sports an improved processor and battery on the inside. (Image: Howley) More\n\nLet’s start with the iPhone 11. That phone’s wide angle and ultra-wide angle cameras are all new for Apple. The wide-angle camera isn’t going to be new to most users as far as the kind of shot you’ll be able to take. It’s the standard iPhone camera perspective you’re likely already used to. But the ultra-wide angle lens allows you to capture far more of your subject’s surroundings.\n\nThink about how when you try to take a picture of a subject, but constantly need to back up to try to get it in the frame. Back up too far, and the subject looks, well, far away. With the ultra-wide lens, you can capture your entire subject without having to back up. Apple showed off a few example photos taken with the iPhone 11, and the difference in perspective was impressive to say the least.\n\nThe iPhone 11 Pro and 11 Pro Max both add that third telephoto camera lens, which, like the telephoto camera on the iPhone XS and XS Max, allows you to optically zoom in on your subjects rather than digitally zoom. Optical zoom is far better than digital because it uses actual lenses, while digital zoom uses software tricks, which causes images to look distorted.\n\nPhil Schiller, Senior Vice President of Worldwide Marketing presents the new iPhone 11 Pro at an Apple event at their headquarters in Cupertino, California, U.S. September 10, 2019. REUTERS/Stephen Lam More\n\nApple makes zooming in and out with the three cameras as easy as it was with the iPhone XS and XS Max. You simply tap the 0.5x to zoom out, 1x to go back to the normal wide-angle shot, and 2x to go to the telephoto shot. You can also adjust your zoom level between those levels for a more fine-tuned photo.\n\nAll of those zoom features also work with the Camera app’s video capture feature. What’s more, Apple has added audio zoom that focuses the iPhone’s microphones on whatever you happen to zoom in on.\n\nAs for video quality, the three new iPhones are able to capture video that looks like it was shot with a professional camera. I’m not sure if it was the lighting, or if professional videographers were using the iPhones, but a sample video taken of people running on a beach looked incredible. Whether someone like me can recreate that, however, will remain to be seen until I get my hands on the phones.\n\nThe three cameras on the iPhone 11 Pro and iPhone 11 Pro Max include a wide-angle lens, telephoto lens, and ultra-wide angle lens. (Image: Howley) More", "description": "Apple’s iPhone 11, iPhone 11 Pro, and iPhone 11 Pro Max are officially here, and they're worth it for the cameras alone.", "authors": ["Daniel Howley", "Technology Editor"], "top_image": "https://s.yimg.com/uu/api/res/1.2/XRSkN3lWeKu3AuTgimtyvQ--~B/aD0zNDQ1O3c9NTQ2MTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/05db06c0-d416-11e9-bdf7-6329451a0de3", "published_at": "2019-09-10"}