{"pub": "usatoday", "url": "https://usatoday.com/story/sports/mlb/playoffs/2019/10/26/astros-nationals-world-series-mlb/2461059001", "downloaded_at": "2019-10-26 06:52:07.740531+00:00", "title": "Astros grind out Game 3 win over Nationals to get back into World Series", "language": "en", "text": "CLOSE SportsPulse: This may be the most energetic World Series we've seen in a long time. For both teams, their exuberance on and off the field has been propelled by the joy often seen in Latin baseball culture. USA TODAY\n\nWASHINGTON – So much for home-field advantage.\n\nFor the third time in as many games, the road team emerged victorious in this World Series as the Houston Astros defeated the Washington Nationals 4-1 in Game 3 on Friday.\n\nIn a game filled with opportunities on both sides, the Astros finally came through with the hits that mattered most in clawing their way back into the series. Michael Brantley had a pair of RBI singles and Robinson Chirinos added a solo homer to pace Houston's 11-hit attack.\n\n\"We needed to get our swagger back and I feel like we got it today,\" said Astros shortstop Carlos Correa. \"We’re too talented. We’ve come too far, too deep into the season for us to give up now. It’s the last series of the season, it’s the most important series of the season so we’ve got to go out there and play like it.\"\n\nIn the first of three games in three nights at Nationals Park, both teams were forced to go to their bullpens a bit earlier than they would have preferred.\n\nAstros starter Zack Greinke lasted only 4 ⅔ innings, but Josh James was able to protect a two-run lead with a key strikeout of Ryan Zimmerman on a nasty changeup with two runners on base.\n\n\"A hitter of his stature that’s been doing it for this long, in the World Series – my first ever – it was pretty special,\" James said.\n\nFrom there, relievers Brad Peacock, Will Harris, Joe Smith and Roberto Osuna were able to hold the Nationals scoreless the rest of the way.\n\n\"I think Will Harris won the game for us out of the bullpen. He had a huge five outs,\" Osuna said. \"He did an unbelievable job. I'm very proud of this team.\"\n\nWashington starter Anibal Sanchez was responsible for all four runs in 5 ⅓ innings of work.\n\nAlthough the Nats still have a 2-1 lead in the series, the win gives the Astros a much-needed jolt of momentum entering Game 4. With Houston’s MLB-best offense showing signs of coming out of its recent slumber, this World Series may be just getting started.\n\n\"If we get that game tomorrow,\" Correa said, \"it’s going to get interesting.\"\n\nRobinson Chirinos celebrates after hitting a solo home run in the top of the sixth. (Photo: Erik S. Lesser, EPA-EFE)\n\nMan of the moment\n\nJose Altuve ignited two Astros scoring threats with hard-hit doubles into the left field corner – scoring key runs both times.\n\nHe hit a leadoff double in the third that Juan Soto misplayed, allowing Altuve to advance to third. He came home with the Astros’ second run of the game on Michael Brantley’s single.\n\nThen in the fifth, the 2017 AL MVP scorched another double to left and came home again on a Brantley single.\n\n\"Tonight we went up there and passed the baton to the next guy,\" Altuve said. \"Some big hits tonight. Michael Brantley, (Josh) Reddick, obviously Robinson (Chirinos) with the big homer.\n\n\"We needed all of that.\"\n\nIn the series, Altuve is hitting .400 (6-for-15) with three doubles and three runs and has a 23-game postseason on-base streak dating back to Game 7 of the 2017 World Series.\n\nNeeding a mulligan\n\nAfter going 7-for-21 (.333) with runners in scoring position in the first two games of the World Series, the Nationals found those clutch hits much tougher to deliver in Game 3. They put runners on base in each of the first six innings, but were unable to cash them in when they needed it.\n\n\"Tonight we were a little aggressive outside the strike zone,\" said Nats manager Dave Martinez. \"We took balls I thought we should hit, uncharacteristic of what we've been doing.\"\n\nWashington went 0-for-10 with runners in scoring position while the Astros (3-for-17 in the series entering Game 3) were 4-for-10.\n\nManager’s special\n\nHow cold has Alex Bregman been in the postseason? After going hitless in his first three at-bats in Game 3, Bregman had just four hits in his last 29 at-bats over the course of the ALCS and the World Series.\n\nWith the Astros knocking out Anibal Sanchez in the sixth inning and mounting another threat against reliever Fernando Rodney, Nationals manager Dave Martinez chose to walk Brantley with two outs to load the bases for Bregman.\n\nThe move paid off when he grounded into a force play to end the inning, but Bregman said he's not discouraged.\n\n\"I feel better,\" he said. \"My first at-bat I struck out, but other than that I hit the ball hard every time.\"\n\nDespite his MVP credentials in the regular season – a .296 average, 41 home runs and 112 RBI – Bregman has been a mere shadow of himself in the October spotlight.\n\nYet his mantra won't change from what's worked for him all year: \"Keep getting after it.\"\n\nState of the series\n\nThe Astros know their mission. Only three teams in the DH era (since 1973) have lost the first two games at home and come back to win the World Series. Now that they’ve taken the first small step by winning Game 3, they’ll look to keep their momentum going Saturday night in Game 4.\n\nAstros manager A.J. Hinch announced that Jose Urquidy will start on Saturday night in what will amount to a bullpen game for Houston. The rookie has appeared twice in the postseason, giving up one run in 4⅓ innings.\n\n\"Every game is a 'bullpen game' in the playoffs,\" Hinch quipped.\n\nThe Nationals will counter with left-hander Patrick Corbin, who went five innings in the NLCS clincher against the St. Louis Cardinals in his last start – and pitched a scoreless inning in relief of Max Scherzer in Game 1 of the World Series.", "description": "We've got ourselves a series as the Astros bounced back to win Game 3 in Washington and cut their deficit to 2-1 in the Fall Classic.", "authors": ["Steve Gardner", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/26/USAT/ecfcde1d-ee83-4138-b731-22420205f6d5-EPA_USA_BASEBALL_MLB_WORLD_SERIES.JPG?crop=4125,2320,x0,y128&width=3200&height=1680&fit=bounds", "published_at": "2019-10-26"}