{"pub": "news.com.au", "url": "https://news.com.au/sport/afl/dale-thomas-could-still-play-on-in-2020-after-receiving-some-interest-after-carlton-exit/news-story/3602069aac05876c44b4317a0dc1f564", "downloaded_at": "2019-10-25 21:58:20.025380+00:00", "title": "AFL news: Dale Thomas could play on in 2020 after receiving some interest from rival clubs, Carlton", "language": "en", "text": "AFL: The Tigers have swung the axe ahead of the 2020 AFL season, delisting three players including 2017 Premiership winner Jacob Townsend.\n\nDale Thomas hasn’t given up hope of extending his AFL career into next year after receiving some interest from rival clubs.\n\nThomas was told by Carlton in August he wouldn’t be offered a contract for the 2020 season but the Collingwood premiership player has always left the door ajar to play on at a third club.\n\nWith the trade period finished, clubs now have a better understanding of where their list sits heading into next year and whether they have a need for a player like Thomas.\n\nHe can be signed during the delisted free agency period, which begins on November 1.\n\n“I got a little nibble early but we’ll just see where that finishes up,” Thomas said.\n\nThomas produced some good football this season across halfback, averaging 19 disposals and five marks in 20 games.\n\nThe 32-year-old played 101 games for the Blues across six seasons but it wasn’t all smooth sailing, enduring a number of injuries and at times struggled for form.\n\nHe tore up a lucrative games-based clause in his contract in 2017 that would trigger an extension as speculation about his future intensified when he was dropped mid-season and instead won new deals on merit.\n\nIt means if he doesn’t find a new home for next season, while he’d initially be disappointed, Thomas is content with moving on to the next phase of his life.\n\n“To be completely honest I sort of feel like I’ve been on borrowed time for the last couple of years,” Thomas said on SEN.\n\nMORE NEWS:\n\n“A few years ago my form wasn’t great, my body wasn’t great either and there was a realistic opportunity I could have been delisted. So the club was good enough to put some faith in me and I feel like the last couple of seasons I repaid that one, with what I was able to do on the field and two, what I was able to do off the field in developing some of the younger kids.\n\n“From a personal point of view it’s very disappointing but at the same time I fully understand (not being offered a contract).\n\n“I’ve been lucky enough to craft out a career that lasted 14 years, so in that sense now reflecting, I’m happy with where it all sits but I thought my footy may have been good enough to keep me going.”", "description": "Dale Thomas hasn’t given up hope of extending his AFL career into next year after receiving some interest from rival clubs.", "authors": ["Kate Salemme"], "top_image": "https://cdn.newsapi.com.au/image/v1/6c8d0b2440ca03a04eaa33b03976cc79?width=650", "published_at": "2019-10-24"}