{"pub": "euronews", "url": "https://euronews.com/2019/10/08/physics-nobel-goes-3-scientists-who-shed-light-earth-s-n1063596", "downloaded_at": "2019-10-08 12:52:33.708434+00:00", "title": "Physics Nobel goes to 3 scientists who shed light on 'Earth's place in the cosmos'", "language": "en", "text": "Three scientists on Tuesday won the 2019 Nobel Prizein Physics for their contribution to the understanding of the evolution of the universe and \"Earth's place in the cosmos.\"\n\nOne half of the award was given to Canadian-American James Peebles \"for theoretical discoveries in physical cosmology,\" and the other half jointly to Swiss scientists Michel Mayor and Didier Queloz \"for the discovery of an exoplanet orbiting a solar-type star.\"\n\nThey will share a $918,000 cash award, a gold medal and a diploma. The laureates will receive them at a ceremony in Stockholm on Dec. 10.\n\nFrom left, Canadian-American James Peebles, Swiss scientists Michel Mayor and Didier Queloz. Nobel Committee\n\nOn Monday, two Americans and one British scientist were awarded Nobel Prize for Physiology or Medicine for their discoveries of \"how cells sense and adapt to oxygen availability.\"\n\nThis year, the Nobel week will include an award in chemistry — to be announced Wednesday — two literature laureates, the coveted Nobel Peace Prize and the economics award.\n\nThis year's double-header Literature Prizes will be awarded Thursday and the Peace Prize will be announced on Friday. The economics prize will be awarded on Oct. 14.\n\nThe 2018 literature prize was suspended after a scandal rocked the Swedish Academy. The body plans to award it this year, along with announcing the 2019 laureate.", "description": "One half of the award goes to Canadian-American James Peebles, and the other half jointly to Swiss scientists Michel Mayor and Didier Queloz.", "authors": [], "top_image": "https://static.euronews.com/articles/4217128/1000x563_nbc-nobel_439d552ffd02027c8ce19f9b13a85d7f.jpg", "published_at": "2019-10-08"}