{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/ap/article-7542453/Blais-records-goal-assist-Blues-beat-Stars-3-2.html", "downloaded_at": "2019-10-06 03:17:39.609840+00:00", "title": "Blais records goal, assist as Blues beat Stars 3-2", "language": "en", "text": "ST. LOUIS (AP) - Sammy Blais had a goal and an assist, and his score midway through the third period was the winner as the St. Louis Blues beat the Dallas Stars 3-2 on Saturday night.\n\nJordan Binnington stopped 28 shots as the defending Stanley Cup champions won their first game of the season. The Blues opened the season with a 2-1 overtime loss to the Washington Capitals on Wednesday.\n\nThe Stars have lost their first two games. They dropped their season opener 2-1 at Boston.\n\nCarl Gunnarsson's slap shot from the top of the zone deflected off Blais before hitting Dallas defenseman Taylor Fedun and getting past goalie Ben Bishop. It was Blais' second goal of the season and gave him the first multi-point game of his career.\n\nBishop made 27 saves on 30 shots.\n\nBrayden Schenn tied the game at 2-2 early in the third when he dove to knock in a loose puck. A shot by Jaden Schwartz rebounded off Bishop and sat just shy of the goal line to the right of the goalie. Schenn dived between Bishop and a Dallas defender, pushing the puck into the net.\n\nDallas Stars' Tyler Seguin (91) looks to pass around St. Louis Blues' Colton Parayko (55) during the first period of an NHL hockey game, Saturday, Oct. 5, 2019, in St. Louis. (AP Photo/Bill Boyce)\n\nMiro Heiskanen, the third-overall pick in the 2017 draft, gave Dallas a 2-1 lead in the second. He shot the puck over Binnington's left shoulder about midway through the period for his first goal of the season.\n\nThe Stars got a fortunate bounce to tie the game at 1-all 11 minutes into the first on a short-handed goal. Mattias Janmark had a breakaway down the left side and took a shot that Binnington stopped but allowed to bounce to his left. Schwartz went to swat it out of the crease, but his momentum carried him into the puck and he knocked it into the goal, giving Heiskanen his first goal of the year.\n\nBinnington faced 30 shots.\n\nThe Blues took an early 1-0 lead on David Perron's first goal of the season. Blais carried it through the Dallas zone before crossing the puck to Perron in the right slot. Perron settled the puck and slapped it past Bishop 1:21 into the first.\n\nEarly in the third period, Esa Lindell appeared to give the Stars a 3-1 lead on a power play with what would have been his first goal of the season. The Blues challenged the play and the goal was disallowed because Dallas was ruled offside.\n\nNOTES: Blues RW Robert Thomas was scratched with an upper body injury he suffered in the team's opener against Washington on Wednesday. ... It was Schenn's first game after signing an eight-year contract extension on Friday. ... Stars C Rhett Gardner and RW Nick Caamano each made their NHL debut. ... D Roman Polak was scratched with an upper body injury.\n\nUP NEXT\n\nStars: Play their second of three straight road games Sunday at Detroit.\n\nBlues: Hit the road for the first time this season, opening a four-game trip Monday at Toronto.\n\n___\n\nMore AP NHL: https://apnews.com/NHL and https://twitter.com/AP_Sports\n\nSt. Louis Blues' Vladimir Tarasenko (91), of Russia, reaches for the puck in front of Dallas Stars' Andrej Sekera (5), of Czech Republic, during the second period of an NHL hockey game, Saturday, Oct. 5, 2019, in St. Louis. (AP Photo/Bill Boyce)\n\nDallas Stars' Alexander Radulov (47), of Russia, skates around St. Louis Blues' Jaden Schwartz (17) during the first period of an NHL hockey game, Saturday, Oct. 5, 2019, in St. Louis. (AP Photo/Bill Boyce)\n\nDallas Stars' Radek Faksa (12), of the Czech Republic, reaches for the puck with St. Louis Blues' Jay Bouwmeester (19) during the period of an NHL hockey game, Saturday, Oct. 5, 2019, in St. Louis. (AP Photo/Bill Boyce)\n\nDallas Stars' Esa Lindell (23), of Finland, collides with St. Louis Blues' Robby Fabbri (15) during the second period of an NHL hockey game, Saturday, Oct. 5, 2019, in St. Louis. (AP Photo/Bill Boyce)\n\nSt. Louis Blues' Mackenzie MacEachern (28) reaches for the puck with Dallas Stars' Nick Caamano (17) during the second period of an NHL hockey game, Saturday, Oct. 5, 2019, in St. Louis. (AP Photo/Bill Boyce)", "description": "ST. LOUIS (AP) - Sammy Blais had a goal and an assist, and his score midway through the third period was the winner as the St. Louis Blues beat the Dallas...", "authors": ["Associated Press"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/04/wire-19350608-1570330956-911_636x382.jpg", "published_at": "2019-10-06"}