{"pub": "heritage", "title": "Medicaid Work Requirements Could Help the Poor", "url": "https://heritage.org/medicaid/commentary/medicaid-work-requirements-could-help-the-poor", "language": "en", "published_at": "2019-01-02", "downloaded_at": "2019-09-02 07:19:04.081317+00:00", "text": "More than 12 million nondisabled, working-age Americans are enrolled in Medicaid. They receive medical care that is virtually free, and in most states they are under no obligation to work or seek work.\n\nSounds like a great deal.\n\nUntil you consider how much these “free” benefits may cost a recipient over the course of a lifetime. That could total more than $323,000 in foregone wages for men and over $212,000 for women, according to a study by the Buckeye Institute, an Ohio-based free-market think tank.\n\nUsing Census Bureau data, the study’s authors estimated that nondisabled men on Medicaid work an average of 13 hours per week, compared with 12 hours for women. Some Medicaid recipients, however, already work enough to satisfy a work requirement of 20 hours per week — often working much more. If all nondisabled Medicaid recipients worked as much as these folks already do, men would work 38 hours per week on average, while women would work 34 hours, the analysis found.\n\nMore hours on the job translates to more wages. Over the course of a lifetime, the differences in income accumulate to levels that significantly improve living standards.\n\nThe authors also note that most people who remain in the work force will work their way off Medicaid and experience earnings gains more similar to those who were never eligible for benefits. Male recipients who follow that trajectory will earn nearly $1 million more over the course of a lifetime than those who remain on Medicaid and don’t increase their work efforts. The lifetime difference for women, the authors estimate, would exceed $725,000.\n\nThe reasons for these differences are not far to seek. People who receive income-related benefits have powerful disincentives to work. A job provides income. Too much income results in loss of benefits. These perverse incentives discourage people from pursuing the surest way to escape poverty: a job. Work requirements help break this dynamic, discouraging long-term dependency.\n\nSome beneficiaries, of course, will choose not to comply with work requirements. Arkansas, which last September began requiring recipients to work or look for work, removed nearly 17,000 people from the rolls. (All were eligible to re-enroll on January 1.) The CMS Actuary estimates that the cost of providing Medicaid to a nondisabled, childless adult averaged more than $6,300 in 2016. It hardly seems unreasonable to ask recipients to make at least some effort to work in exchange for such a generous subsidy.\n\nThe report acknowledges that its estimates of the lifetime income effects of work requirements are, as with any economic study, only approximations. Quantifying outcomes requires certain assumptions, like holding Medicaid status, disability status and other factors constant. For most individuals, these characteristics will change over time. But even with that caveat, the authors conclude that establishing work requirements for nondisabled Medicaid recipients “may lead to significant potential economic benefits for these individuals.”\n\nThe Buckeye Institute study comes as many states are considering whether to expand Medicaid eligibility to nondisabled, childless adults. The ACA incentivized states to undertake such expansions.\n\nStates and the federal government share Medicaid costs. The federal government on average bears 57 percent of the costs of providing medical care to the traditional Medicaid populations — the elderly, people with disabilities, pregnant women and families with dependent children. The federal government bears a much greater share of the cost of covering nondisabled adults — 93 percent this year and 90 percent beginning in 2020. As a result, the federal government spent more on Medicaid for nondisabled, childless adults in 2016 than it did on Medicaid-eligible children, on their parents, or on the elderly.\n\nSo far, 37 states have expanded Medicaid eligibility, including three whose voters approved Medicaid expansion ballot initiatives last November. Five expansion states have obtained waivers from the administration to establish work requirements on nondisabled adults. Three others have applications pending.\n\nThese states define work activities to include such things as community service, job search, and education. All of these activities count toward their required 80 hours of monthly work. And all of them, like a job, benefit recipients.\n\nMany conservative critics of Medicaid expansion focus on its cost to taxpayers. That cost is considerable, approaching $72 billion in 2017 and rising to $120 billion in 2026. But they shouldn’t overlook that “free” Medicaid without work requirements imposes significant costs on recipients themselves, a point seldom made in the policy debate.\n\nConservatives worry that letting states establish work requirements will make Medicaid expansion more palatable in the 14 states that have so far resisted it. This is an important political consideration. But with the possible exception of Montana, whose voters last November rejected a proposal to make their expansion permanent, it is unlikely that expansion states will repent their decision. They may, however, consider instating work requirements.\n\nStates that do will encounter stiff opposition from progressives. Their assumption is that work requirements are punitive. They believe that providing able-bodied adults with health coverage and asking nothing in return is an act of compassion. The Buckeye Institute study suggests the opposite.\n\nMedicaid and other welfare programs should be a bridge for non-aged, nondisabled adults, not a destination. It should offer them a way out of poverty, an opportunity to acquire skills and develop habits that increase their earnings and improve their material well-being. The Buckeye Institute study provides empirical evidence that work requirements benefit the poor by nudging them toward the path of self-sufficiency.", "description": "More than 12 million nondisabled, working-age Americans are enrolled in Medicaid. They receive medical care that is virtually free, and in most states they are under no obligation to work or seek work.\n\nSounds like a great deal.", "authors": ["Doug Badger", "Visiting Fellow", "Doug Badger Is A Visiting Fellow In Domestic Policy Studies At The Heritage Foundation."], "top_image": "https://www.heritage.org/sites/default/files/styles/facebook_optimized/public/images/2019-01/GettyImages-185279294.jpg?itok=jdAruWLA"}