{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Food/made-poison-apples-pinterests-top-10-halloween-recipes/story?id=65960915", "downloaded_at": "2019-10-01 09:27:32.959092+00:00", "title": "I made 'poison apples', one of Pinterest's top 10 Halloween recipes of 2019", "language": "en", "text": "Nothing screams fall more than candy apples. This \"poison apples\" recipe made it onto Pinterest's list of its top 10 Halloween recipes of 2019. I made all 10 recipes, including treats like chocolate skulls and cockroach Boston cream donuts.\n\nInterested in Halloween? Add Halloween as an interest to stay up to date on the latest Halloween news, video, and analysis from ABC News. Add Interest\n\nI enjoyed making this recipe and loved the poisonous look, but it's witchful thinking to think the recipe was easy. I'd recommend doubling the amount of caramel you make and getting a second person to be the apple 'dipper' while you stir the candy coating to make sure it doesn't burn.\n\nPoison Apples\n\nRecipe IRL:\n\nABC News\n\nThis was my first time making candy apples, and while I liked how they turned out, making them wasn't without its troubles. The recipe is easy enough, but I felt like the entire time I was sugar-coating, I was at risk of burning in the pot. Right when it got to the consistency I wanted it to, I started to dip the apples in, but I felt like the sugar mixture wasn't deep enough, and I hadn't made enough of the coating using this recipe to make the dipping easy. I had to use a spoon to keep coating the top of the apples to make sure that I got them fully coated.\n\nAbout halfway through the process, I got nervous that the sugar was burning, so I turned off the burner thinking that it'd remain hot enough for the next few minutes to give me enough time to coat the other half of my apples. Instead, the consistency quickly started to turn stickier, and soon, the candy coating started to form strings when I would try to put a finished apple on the parchment, ruining the perfectly coated apples.\n\nWhen I was done, I realized that you could see through my candy coating to the color of the apples, which is unlike the original Pinterest recipe. I couldn't figure out if it was because I didn't put enough blue food dye in (I used food color drops vs. food color gel) or if it needed a second coat. I started to try to coat them again to make them bluer, but all I ended up doing was make the coating stringier and sticker and causing a mess.\n\nIf I wasn't trying to be so perfect with these, I think the recipe would have been pretty straightforward. I'd recommend making double the amount of sugar-coating than the recipe calls for to make it easier to dip the apples and make sure you have enough candy coating for all 12 apples.\n\nI'd also make sure you put in more food dye than the recipe says, to make sure that your blue comes out dark and spooky.\n\nIngredients 2 cups sugar\n\n1/2 cup corn syrup\n\n3/4 cup water\n\n1/2 tsp blue gel food coloring\n\n12 small apples\n\n12 wooden skewers or twigs\n\nparchment papper\n\nvegetable oil\n\nInstructions Wash and dry apples. Remove the stems. Insert wooden skewers (or twigs) into the center of each apple.\n\nIn a saucepan over medium heat add sugar, corn syrup, water and food coloring. Mix ingredients well, until sugar is dissolved. Bring to a boil. Do not stir past this point. Pay attention to avoid burning it, because the blue coloring will prevent you from seeing the caramel color.\n\nPlace parchment paper on a baking sheet and grease with vegetable oil.\n\nAfter 15 to 20 minutes the caramel will be ready. To check, drizzle some of it from a fork - if it hardens when falling, forming strands, it's done.\n\nTurn the heat off and dip the apples, one by one, on the caramel, turning so they get an even coating. Let excess caramel drip off and place the apples on the paper to cool.\n\nDo this carefully as the caramel will be super hot.\n\nRecipe reprinted courtesy of Travel Cook Tell.\n\nHave a faBOOlous Halloween!", "description": "These candy apples are too cute to spook.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/MainImage_HalloweenRecipes_apples_v01_dap_hpMain_16x9_992.jpg", "published_at": "2018-10-29"}