{"pub": "yahoo", "url": "https://news.yahoo.com/lou-dobbs-stands-joe-digenova-191245569.html", "downloaded_at": "2019-10-05 00:00:46.167244+00:00", "title": "Lou Dobbs Stands By as Joe diGenova Trashes His Colleague Chris Wallace", "language": "en", "text": "Days after Fox News anchor Chris Wallace dropped a scoop that two frequent Fox guests—husband-wife lawyer team Joe diGenova and Victoria Toensing—worked “off the books” with Trump lawyer Rudy Giuliani to dig up Ukrainian dirt on Joe Biden, the two attorneys roasted Wallace during a Fox Business Network appearance—and Trump-boosting host Lou Dobbs largely stood by.\n\nAppearing on Thursday night’s broadcast of Lou Dobbs Tonight, the pro-Trump lawyers were asked about the Wallace report as well as the recent revelation that conservative columnist and Hannity regular John Solomon—who is at the center of the Ukraine-Biden mess—emailed them a completed copy of one of his Ukraine stories hours before it was published.\n\nToensing, meanwhile, defended the email, claiming he was just sending them the entire draft for fact-checking purposes because that’s what good journalists do. She also claimed that Solomon is being attacked “relentlessly” because he’s getting “deep into the cases” surrounding Ukraine, something diGenova and Dobbs agreed on.\n\n“Those attacks, it seems, multiplying as this impeachment inquiry gets hotter and hotter,” Dobbs added before pivoting to Wallace’s story, stating he wanted to “get this out of the way.”\n\nNoting that he’d spoken to the Fox News anchor beforehand, Dobbs asked diGenova to respond to the report that the pair were working with Giuliani on Ukraine-Biden and only Trump knew about the plan.\n\n“First of all, I don’t know what ‘off the books’ means,” diGenova insisted. “Chris did not explain it when he made his statement about us and it was clearly designed as a smear to make it sound like we were doing something improper or unethical.”\n\nThe frequent Dobbs guest went on to say that “this may come as a shock to” Wallace but the pair are lawyers and they’ve represented people all over the world, adding that they were once asked by Giuliani to possibly represent Ukrainian whistleblowers but that was the extent of any arrangement.\n\n“We never went to the Ukraine,” he exclaimed. “We never represented anybody. But somebody lied to Chris Wallace and said that we did and we told the president all about it, which is absolutely false.”\n\nToensing, for her part, jumped in to state that Wallace had called the pair and talked to them about it and that she went “off the record” with him, something Dobbs softly noted Wallace had told him about.\n\n“I dealt with journalists for so many years,” she continued. “I always, when I’m explaining something, say this is off the record. If they want something particular they come back. Chris never did that. He never said I am going to accuse you of a crime and violating attorney-client privilege. If he had said that I certainly would have given him a statement.”\n\nDobbs, meanwhile, plainly noted that he appreciated that they had given their statement, adding: “Chris Wallace, I’m sure he appreciates it as well.”\n\n“A particular coincidence of off-the-record and lost opportunities for denials,” Dobbs said with a smile. “And a smear job? Eh, nobody is going to try to smear you guys. You are too bright and too effective. I don’t believe that for a minute.”\n\nWithin a day of the release of Wallace’s bombshell, Fox News appeared to quietly forget about its own scoop, discussing it only a few times on the air Monday and downplaying it on the network’s website. This came in the wake of the New York Times’ Ken Vogel claiming he first broke the diGenova-Toensing angle in May and Giuliani and diGenova offering forceful denials to Wallace’s scoop.\n\nWallace, through a Fox News spokesperson, has said he stands by his reporting.\n\nInterestingly, during a Friday morning appearance on Fox News’ America’s Newsroom, Wallace wasn’t asked about his story nor offered a chance to rebut diGenova’s and Toensing’s fiery attacks on him.\n\nRead more at The Daily Beast.\n\nGot a tip? Send it to The Daily Beast here\n\nGet our top stories in your inbox every day. Sign up now!\n\nDaily Beast Membership: Beast Inside goes deeper on the stories that matter to you. Learn more.", "description": "Days after Fox News anchor Chris Wallace dropped a scoop that two frequent Fox guests—husband-wife lawyer team Joe diGenova and Victoria Toensing—worked “off the books” with Trump lawyer Rudy Giuliani to dig up Ukrainian dirt on Joe Biden, the two attorneys roasted Wallace during a Fox Business Network", "authors": ["Justin Baragona"], "top_image": "https://s.yimg.com/uu/api/res/1.2/3iE.ylKPtoHUEvIp.qnWIA--~B/aD02NTg7dz0xMTcwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en-US/thedailybeast.com/1023b4409df4323f091ee4f46e3328a6", "published_at": "2019-10-04"}