{"pub": "indiatimes", "url": "https://timesofindia.indiatimes.com/blogs/twinkle-twinkle/the-lightly-dented-liberal-darling-trudeau-is-back", "downloaded_at": "2019-10-22 13:28:20.925554+00:00", "title": "The lightly dented liberal darling Trudeau, is back", "language": "en", "text": "However much it may be drooping in other countries, in Canada the liberal flag continues to fly high. After the general election held on Monday, Justin Trudeau is set to become prime minister again. Granted, his Liberal Party has been reduced to a minority government and in a reverse Trump effect the opposition Conservatives have won the popular vote. But the revelation of his youthful penchant for wearing brownface/blackface, a ruling by a federal ethics commissioner that he had broken a conflict of interest law, and other controversies had brought him to the brink of defeat. Against this backdrop, despite the loss of an absolute majority, his acceptance speech was sunnily celebratory – with supporters cheering Bravo, Bravo.\n\nThe acceptance speech and its setting spoke loud how different Canada is from its southern neighbor. It was a grand, flag full, families galore stage where Donald Trump declared in November 2016 that “America will no longer settle for anything less than the best”, to the roar of USA, USA, USA… Everything was in the lower key at today’s Trudeau event, including the crowds. Golly, it was also all bilingual. The songs, the speech. There was English but also French. He said merci to the Canadians who voted in favor of a progressive agenda and getting guns off the street and strong action against climate change. He has already got an ambitious carbon pricing plan going. And of course he has been uncompromisingly pro-immigration in a world where many countries are scapegoating immigration for failing economic engines.\n\nIncidentally the Canadian engine has been doing pretty well under this liberal stewardship. Matthew A Winkler notes that, “Unemployment fell faster than in any developed nation during the 40 months that ended in May, to its lowest level since 1976… The stock and bond markets proved world beaters with the best returns and most stability.” Not only has Canada’s GDP grown 8% since 2015 what really bodes well for the future is that technology is the fastest growing Canadian industry. On balance Trudeau’s first term delivered more than it disappointed. Although in the second term he will need other parties’ support to pass legislation, odds are the liberal agenda will continue to swim strong in Canada.", "description": "However much it may be drooping in other countries, in Canada the liberal flag continues to fly high. After the general election held on Monday, Justin Trudeau is set to become prime minister again. Granted,...", "authors": ["Renuka Bisht"], "top_image": "https://timesofindia.indiatimes.com/blogs/wp-content/uploads/2019/10/33E20538-E6DD-4C2F-B7E3-438B581A0311.jpg", "published_at": "2019-10-22"}