{"pub": "businessinsider", "url": "https://businessinsider.com/fed-policy-impact-not-helping-middle-class-mark-yusko-says-2019-9", "downloaded_at": "2019-09-05 00:07:08.544678+00:00", "title": "'Being boiled like frogs': A Wall Street investment chief unloads on how the Fed's behavior is actually hurting the middle class it's supposed to be helping", "language": "en", "text": "Mark Yusko, the founder and CEO of Morgan Creek Capital Management, describes how the inflationary forces spurred by Federal Reserve easing efforts are actually having the opposite effect of what's intended.\n\nHe also explains how the holders of financial assets benefit from inflation, while those from the lower socioeconomic cohorts — who hold more in cash — aren't getting the same boost.\n\nClick here for more BI Prime stories.\n\nThere's no denying that wealth inequality has exploded within the US over the past few decades.\n\nTechnological advances, exploding college-tuition and healthcare costs, outsourcing, and automation have all combined to leave the poor and middle class even further in the rearview. Meanwhile, the rich grow richer.\n\nIn fact, according to the Economic Policy Institute, a typical CEO made 312 times their employees' median salary in 2017 — and the trend doesn't seem to be slowing.\n\nBut Mark Yusko, the founder and CEO of Morgan Creek Capital Management, who oversees $1.5 billion, looks at the growing disparity as a problem that's been exacerbated by the Federal Reserve. In his mind, the central bank's renewed monetary-easing efforts are making the rich even wealthier, while those of lesser economic means continue to languish.\n\n\"What it's really designed to do is to inflate the value of assets — real assets: real estate, stocks, et cetera,\" he said in \"Off the Chain,\" a digital-assets podcast. \"And the top 1% owns the majority of those assets.\"\n\nWhen the Federal Reserve lowers interest rates and implements quantitative easing, their goal is to increase the money supply, spur inflation, and increase demand. In turn, asset prices rise as a deluge of new capital is suddenly bestowed upon markets.\n\nHowever, this action reduces the value of the US dollar as an increase in supply makes each subsequent dollar printed less valuable — a dynamic known as inflation. It's a phenomenon that helps some immensely and crushes others.\n\n\"The problem is, 49% of people in this country don't own any assets,\" he said. \"So they don't own the assets that are being inflated by this mythical devaluation of our currency.\"\n\nRead more: Ray Dalio sees 'serious problems' stemming from the next recession. Here's why he warns even the Fed might be powerless to save the economy.\n\nThis ultimately creates a real problem for the poor and middle class. Unlike the rich, these lower socioeconomic cohorts don't have the discretionary income necessary to invest in markets. They are then, in turn, unable to benefit from these operations.\n\nIn fact, 20% of the working Americans who participated in a Bankrate survey said they had zero savings, and in the hierarchy of needs, feeding your family definitely comes before making a stock purchase.\n\nBy having most of their assets in cash, the poor and middle class are actually being hurt by the deterioration of purchasing power — and this is precisely why Yusko thinks the Fed stimulus intended to help them is actually having the opposite effect.\n\nConventional political wisdom seems to suggest that the Fed can help these groups by lowering interest rates and applying stimulus. But Yusko says this thinking is antithetical. He thinks the Fed's actions are primarily making the rich even richer.\n\n\"We're being boiled like frogs,\" he said. \"Today, a dollar — 100-plus years, 106 years later — is worth about 3 and a half cents.\"", "description": "Mark Yusko, founder and CEO of Morgan Creek Capital Management, thinks the Fed's easing measures are having the opposite effect of what's intended.", "authors": ["Christopher Competiello"], "top_image": "https://image.businessinsider.com/5d6fd7dd2e22af2ba518fbaa?width=1200&format=jpeg", "published_at": "2019-09-04"}