{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/20/ruth-bader-ginsburg-fires-back-at-suggestion-she-s", "downloaded_at": "2019-09-20 22:56:42.600885+00:00", "title": "Ruth Bader Ginsburg fires back at suggestion she should have retired under Obama", "language": "en", "text": "Supreme Court Justice Ruth Bader Ginsburg on Wednesday fired back at the suggestion that she should have retired when President Barack Obama was still in office.\n\n“It has been suggested by more than one commentator, including some law professors, that I should’ve stepped down during President Obama’s second term,” the liberal justice said during a live sit-down with NPR’s Nina Totenberg at the Moment magazine awards dinner in New York City, the Jewish Telegraphic Agency reported.\n\n“When that suggestion is made I ask the question: Who do you think the president could nominate that could get through the Republican Senate that you would prefer to have on the court than me?” she said to loud applause, JTA reported.\n\nJustice Ginsburg, 86, was recently treated for cancers on her pancreas and lungs and has kept a busy schedule speaking in cities across the country despite completing a three-week course of radiation treatment just last month.\n\nShe said her schedule is what keeps her motivated.\n\n“This is my fourth cancer bout, and I found each time that when I am active I am much better than when I am just lying about feeling sorry for myself,” Justice Ginsburg said, CNBC reported. “The necessity to get up and go is stimulating. And somehow, all these appearances I’ve had since the end of August, whatever my temporary disability is, it stops, and I’m OK for the event.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Supreme Court Justice Ruth Bader Ginsburg on Wednesday fired back at the suggestion that she should have retired while President Barack Obama was in office.", "authors": ["The Washington Times Http", "Jessica Chasmar"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/12/Supreme_Court_Ginsburg_11256.jpg-b1724_c0-229-5472-3419_s1770x1032.jpg?6f9ce78ee1a3a25672569ab4bf84dc3559d8855e", "published_at": "2019-09-20"}