{"pub": "reuters", "url": "https://in.reuters.com/article/us-imo-shipping-oil-graphic/u-s-shipping-sanctions-deal-blow-to-oil-sought-for-new-eco-rules-idINKBN1WQ0V2", "downloaded_at": "2019-10-11 08:17:22.994874+00:00", "title": "U.S. shipping sanctions deal blow to oil sought for new eco-rules", "language": "en", "text": "LONDON/SINGAPORE (Reuters) - Highly sought after types of oil best suited to making cleaner shipping fuel are suddenly finding they are a tougher sell for thirsty East Asian markets, traders say, in an unintended consequence of U.S. sanctions on a Chinese shipping fleet.\n\nFILE PHOTO: Shipping vessels and oil tankers are seen off the eastern coast of Singapore July 22, 2015. REUTERS/Edgar Su/Files/File Photo\n\nWith just over two months until environmental rules are set to mandate the biggest changes to ship power in over a century, certain rare types of West African oil have soared in value but have had to be marked down due to the higher costs of transport.\n\nThe United States imposed sanctions on units of China’s COSCO on Sept. 25 for allegedly ferrying crude out of Iran, putting its vast fleet of oil supertankers off-limits for international companies and sending freight rates soaring.\n\nThe high prices are being shouldered by buyers especially in East Asia, several traders said, and are making the purchase of oil from key far-away export regions like West Africa less attractive just when production of the new fuels should ramp up.\n\n(GRAPHIC: Tanker rates soar after U.S. sanctions on COSCO - here)\n\n“West African (oil) grades are commanding such a high premium as they are they are requisite feedstock for low-sulfur fuel oil (LSFO) barrels,” said Matt Stanley, oil broker at StarFuels in Dubai.\n\n“With the advent of IMO 2020 it is now time for these previously less fashionable grades to shine and for others to become weaker”, he added.\n\nThe International Maritime Organization (IMO) rules effective on Jan. 1, 2020, require ships worldwide to use fuel with a maximum 0.5% sulfur content, in the biggest maritime fuel transition since ships moved from burning coal to oil.\n\nBut only around 1 percent of the world’s crude oil exports are heavy and sweet varieties, ideal for refining into Low-Sulfur Fuel Oil (LSFO), with West Africa providing the lion’s share.\n\nPrice offerings for Angolan Cabinda, Nigerian Forcados and Congolese Djeno — all relatively heavy and sweet — reached all-time highs in recent weeks, but retreated downward again due to the new costs of shipping it as far as markets in East Asia.\n\n(GRAPHIC: Prices for Angolan Cabinda crude oil - here)\n\n“It just didn’t make economic sense,” said one East Asian buyer. “Demand has been there but with freight suddenly up that high, the prices can’t be justified and the cargoes won’t sell until they’re brought down again.”\n\nFlows to East Asia from the top heavy sweet oil exporters Angola, Chad and Cameroon were already down in September to near their lowest monthly levels in years partly due to the sky-high prices, traders said.\n\n(GRAPHIC: Crude oil exports from Angola, Cameroon and Chad to East Asia - here)\n\nWhile there is no indication that the ability of refiners to supply the market with compliant fuels has been undercut by the price pain and lower exports, reserves are not vast.\n\n“The issue is that with 4-7 million tonnes of LSFO in the Greater Singapore area, that is not a huge amount of supply,” said Alan Gelder Vice President Refining, Chemicals and Oil Markets at Energy consultancy Wood Mackenzie.\n\n“It’s probably around the level of several weeks’ worth.”\n\nNot all sellers are suffering, however, as traders said Australia’s Santos far closer to Asia sold a cargo of heavy sweet Van Gogh oil late last week at around $13 a barrel above dated Brent, traders said, up strongly from about $8 last month.", "description": "Highly sought after types of oil best suited to making cleaner shipping fuel are suddenly finding they are a tougher sell for thirsty East Asian markets, traders say, in an unintended consequence of U.S. sanctions on a Chinese shipping fleet.", "authors": ["Noah Browning", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20191011&t=2&i=1439604719&w=1200&r=LYNXMPEF9A0LF", "published_at": "2019-10-11"}