{"pub": "metro", "url": "https://metro.co.uk/2019/10/13/eastenders-spoilers-rainie-brannings-actions-devastate-stuart-highway-10800671", "downloaded_at": "2019-10-13 08:44:51.268776+00:00", "title": "EastEnders spoilers: Rainie's actions devastate Stuart", "language": "en", "text": "Stuart is left devastated by Rainie (Picture: BBC)\n\nRainie Branning (Tanya Franks) has been hellbent on ensuring that she remains in baby Abi’s life in EastEnders, but her drug addiction has resulted in Kathy Beale (Gillian Taylforth) and Max Branning (Jake Wood) making several attempts to prevent her from doing so. However, her actions in the coming episodes prove that Kathy and Max have every right to be concerned — and Stuart Highway (Ricky Champ) is left devastated as a result.\n\nAfter everything that’s transpired over the last couple of weeks, Kathy thinks it might be for the best if she were to supervise Rainie whilst she babysits Abi — something which she later relays to Max.\n\nHowever, Max firmly believes that Rainie should be nowhere near the toddler right now, and thus he makes Kathy promise that she’ll ensure Rainie stays away.\n\nStuart and Rainie confront Kathy (Picture: BBC)\n\nProblems soon arise for the Beale matriarch when Stuart blackmails her — promising to tell everyone about what she did if she doesn’t agree to let Rainie see Abi.\n\nAdvertisement\n\nAdvertisement\n\nAgainst Max’s wishes, Kathy later lets Rainie talk her into taking Abi to the park.\n\nStuart still has doubts about Rainie’s behaviour — something which he discusses with Bex (Jasmine Armfield) — but he’s taken aback when Bex suggests that he simply trusts her.\n\nAfterwards, he heads off to track Rainie down, but he’s left devastated by what he finds.\n\nWhat exactly is it that Rainie’s done this time?\n\nWill Stuart be able to forgive her? Could this be the end of the line for #Stainie?\n\nSay it ain’t so!\n\nOne to watch: Tuesday 15th October at 7:30pm on BBC One.\n\nAdvertisement Advertisement", "description": "Stuart's discovery leaves him reeling — could this be the end of Stainie?", "authors": ["Stephen Patterson"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/18685099-high_res-eastenders-october-december-2019-c4a4_1570007553.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-13"}