{"pub": "cnn", "url": "https://cnn.com/interactive/2018/12/opinions/crystal-ball-2019/index.html", "downloaded_at": "2019-09-22 06:46:23.507979+00:00", "published_at": "2019-09-22", "title": "Crystal Ball: What will happen next year?", "language": "en", "text": "Each December, we ask a group of CNN contributors and commentators for their predictions on some of the big events in the coming year. Some picks are expected, some surprising, and sometimes even our fearless prognosticators admit they have no idea what to pick! See whose prior predictions have come true.\n\n2019 Which film will win the Oscar for best picture in 2019? “Green Book” won the Academy Award for Best Picture. SE Cupp CNN commentator I’ve seen close to no movies (I have a 3-year-old!), but I did get to see “First Man,” and it would certainly get my vote. Jill Filipovic CNN opinion contributor I'm going to bet on “A Star is Born,” even though “BlacKkKlansman” probably deserves it more. James Gagliano CNN law enforcement analyst It continues to rankle me that the stodgy, tradition-oriented Academy still relegates documentary films to their own separate category. But let’s hope there’s a break with tradition this year, and the wonderful documentary on Fred Rogers -- “Won’t You Be My Neighbor” -- wins. Frida Ghitis CNN opinion contributor Crowd-pleasing films such as “Black Panther” or “A Star is Born” could emerge victorious, even if they were not the best movies of the year. But the deserving winner will be “Roma,” a gripping black-and-white reminiscence about a turbulent time in Mexico and the life of a domestic worker. Joey Jackson CNN legal analyst My vote is for “A Star is Born” -- great chemistry between the two stars. And it was full of surprises -- Bradley Cooper, an actor who I thought could act, but not sing, turned out to be able to do both. And Lady Gaga, who I thought could sing, but not act, surprised me with her theatrical chops. Scott Jennings CNN contributor Final three for me are “BlacKkKlansman,” “A Star is Born” and “Black Panther.” While I think “A Star is Born” will win, I’m rooting for Spike Lee’s “BlacKkKlansman.” Roxanne Jones CNN opinion contributor So many great movies this year -- from Spike Lee’s “BlacKkKlansman,” Barry Jenkins’ adaption of the James Baldwin novel, “If Beale Street Could Talk,” and Marvel’s “Black Panther.” I’m going with “Beale Street” for the Oscar win. Confession: I never saw “A Star is Born” -- you can’t top Barbra Streisand and Kris Kristofferson in the 1976 version. Peniel Joseph CNN opinion contributor “Black Panther.” Hollywood makes a statement embracing a film that represented both a cultural movement and historical moment -- one that illustrated the power of film to achieve the universal through the story of black and African diasporic identities. Dean Obeidallah CNN opinion contributor “Black Panther” or “BlacKkKlansman,” neither of which Trump would ever watch. But I think the Spike Lee-directed film “BlacKkKlansman” takes home the statue. Jen Psaki CNN political commentator “A Star is Born.” Raul Reyes CNN opinion contributor Best picture will likely go to “A Star Is Born.” It has everything Academy voters love: a Hollywood storyline, A-list stars, a cinematic legacy and strong box-office performance. Timothy Stanley Historian In a sane world, Best Picture would go to “First Man,” a movie that looks big -- it’s about the Apollo moon mission -- but actually deals with something small and human, one man’s alienation from the world around him. It’s as close to poetry as Hollywood gets. Alice Stewart CNN political commentator My money is on “Black Panther” because it was a high-action blockbuster, and it delivers an important political message: With great power comes great responsibility. In addition, the movie breaks Hollywood barriers that should have been broken many years ago. Holly Thomas CNN opinion contributor Lady Gaga can regurgitate anecdotes until the cows come home, and I’d still be delighted if “A Star Is Born” won. But I suspect “Widows” will sneak round the back and win it. Jeff Yang CNN opinion contributor My heart yearns for Wakanda (“Black Panther”), but the Academy is likely going to go Lady Gaga (“A Star is Born”).\n\n2019 The 2020 race: Which Democrat running for president will lead the polls of Democratic voters at the end of 2019? Which Republican will lead the polls of that party’s voters? SE Cupp CNN commentator Of the 300 people who will run, I imagine Beto O’Rourke will have the best chance of navigating the primary and cutting through with voters. On the other side, I can’t envision a convincing challenger to Trump will emerge (though one can dream). Jill Filipovic CNN opinion contributor I predict Bernie Sanders will lead the polls at the end of 2019, based primarily on name recognition. He will not be the nominee in 2020. And I feel fairly confident in predicting that Trump will be his party's nominee. James Gagliano CNN law enforcement analyst My early money leans toward Beto O’Rourke (who recently met with President Obama to discuss a 2020 run) as a 2019 frontrunner. And I don’t foresee any emergent Republican candidate that could contend with an unleashed, nothing-to-lose Donald Trump in the Republican primary. Frida Ghitis CNN opinion contributor With hordes of lawmakers, governors and businesspeople pondering a run, and Democrats energized for victory, the polls will confound the experts and baffle campaign managers. Familiar names -- Joe Biden and Bernie Sanders -- will lead early, driven largely by name recognition. Late in the year, the horserace will favor Senator Amy Klobuchar, who will lead the pack. On the GOP side, Trump will lead, but he will face a serious challenger. Joey Jackson CNN legal analyst I think Beto O’Rourke will lead the Democratic contenders -- he is inspiring, a visionary and also a man of the people. Meanwhile, Trump, the disruptive and divisive President, will lead the Republicans. Scott Jennings CNN contributor Beto O’Rourke will lead the Democratic pack, and Donald Trump will still lead the Republicans. Roxanne Jones CNN opinion contributor Republican voters will turn on Donald Trump and look to Vice President Mike Pence to run for president. Democrats, angry and eager to take back the Oval, won’t stray too far left from traditional names or politics. Joe Biden will be the guy most Democrats trust to lead and heal the nation -- but his only hope of winning in 2020 is to have a progressive woman, like Kamala Harris, as his running mate. Peniel Joseph CNN opinion contributor Beto O’Rourke will lead the Democrats, since he is the first Democratic candidate since Barack Obama to inspire a belief in civic ideals, social justice and the grand notion that America belongs to all of us. And Donald Trump will lead the Republicans, as he continues to play to his base of nationalists and populists. Jen Psaki CNN political commentator Beto O'Rourke will be ahead for the Democrats, and Donald Trump, assuming he is still in office (which isn’t a sure thing), will be ahead for Republicans. Raul Reyes CNN opinion contributor The Democrat’s frontrunner will be Joe Biden, while the Republican frontrunner will be Donald Trump. But this will be more about name recognition and familiarity than anything else; once the 2020 race is really underway, all bets are off. Timothy Stanley Historian Trump is obviously a shoe-in for the Republican nomination, but the Democratic field remains such a mess that I wouldn’t be surprised if the polls are dominated by a celebrity (Oprah), someone who won’t run (Joe Biden) or the eternal candidacy of Hillary Clinton. Biden, however, will be the most popular because he’s the most realistic populist liberal. Alice Stewart CNN political commentator I will be keeping my eyes on Texas Democrat Beto O’Rourke, who represents the young face that the Democrats want with the strong fundraising ability that they need. He ran a solid race for Senate in 2018, but his policies were too blue for Texas. President Trump has maintained high approval among his base, and I expect him to lead the GOP polls at the end of the year. Holly Thomas CNN opinion contributor In the UK, there is a popular Twitter phenomenon known as “the banter timeline.“ This is the notion that of all the possible courses our future might have taken, the one we are living is so patently ridiculous that the gods must have designed it purely for ”the banter.“ The banter timeline would dictate that the Democrat candidate leading by the end of 2019 would be Hillary Clinton. (Though she wouldn’t necessarily have the best odds of winning.) I suspect the Republicans will prefer to stick with the devil they know -- and choose Trump. Jeff Yang CNN opinion contributor The knives are already out on social media between the various factions of the Democratic Party, and history has shown us that undermining the future candidate (and the process that selects him or her) produces the worst of all possible outcomes. If pressed, I'll say Kamala Harris/Beto O'Rourke looks like our best bet for victory, but it'll depend on who President Pelosi decides to endorse. Either way, GOP frontrunner Mitt Romney will find a way to lose.\n\n2019 Brexit: Will the UK leave the EU in 2019, and if it does, will it be with or without an agreed-upon deal? SE Cupp CNN commentator It’s the law, so I think it will happen regardless of a deal. Jill Filipovic CNN opinion contributor No, they won't leave this year -- they'll either delay and/or re-vote. James Gagliano CNN law enforcement analyst As I understand it, the “divorce” is now compulsory, with the exit date scheduled for March 29. To delay this -- or nullify it -- would require change to British law, along with an agreement from the rest of the EU. So, absent a change in law, I foresee the departure occurring with an agreed-upon final deal to be reached at a later date. Frida Ghitis CNN opinion contributor Prime Minister Theresa May’s efforts to implement a decision she opposes -- pulling the UK out of the European Union -- will fail. Her plan will be rejected and the option of leaving without a deal will seem so scary that Britain will hold a second referendum. After having voted so casually the first time around, frantically checking the implications after voting, Britons will vote to remain and Brexit will be over. Joey Jackson CNN legal analyst The UK will leave, with a deal: That’s what the masses want. And nobody does anything without a deal. Scott Jennings CNN contributor Yes, the UK will leave the EU and there will eventually be a deal struck -- messy as it seems now. Roxanne Jones CNN opinion contributor British Prime Minister Theresa May came to office after the Brexit vote and has been struggling ever since to get a deal that satisfies all parties. As European leaders stand firm on their terms for Brexit, it seems certain Great Britain will leave the EU in 2019 without a deal. Peniel Joseph CNN opinion contributor The UK will stay in the EU. Prime Minister Theresa May averts political disaster by allowing the nation to gracefully come to its senses regarding their place in the world. Dean Obeidallah CNN opinion contributor No deal. The government will collapse, and new elections will delay it all. Jen Psaki CNN political commentator The UK won’t leave without a deal because it will send the country and markets into chaos. But the deadline for a deal is fast approaching in March and one option would be for another referendum vote. Given the trends and demographics in the UK, a vote to stay in the EU is not out of the question. Raul Reyes CNN opinion contributor Yes, the UK will be leaving the EU on March 29, 2019, because it is the law, deal or no deal. With that deadline looming and little progress made so far on major issues like trade and customs, it seems likely -- and unfortunate -- that Britain will exit without a deal in place. Timothy Stanley Historian Right now, it looks like Britain either won’t leave the EU in 2019, or it will leave without a deal. Most likely, though, it will leave without a deal. Alice Stewart CNN political commentator The fact that British Prime Minister Theresa May won a vote of confidence by Conservative Party lawmakers indicates Brexit will happen. May has made it clear she is focused on delivering an orderly exit from the EU, and I expect that to happen. Holly Thomas CNN opinion contributor Answers to this change roughly every 12 hours, but I reckon, despite the daily option tombola, we'll leave the EU with the agreed deal in 2019. Jeff Yang CNN opinion contributor I predict the UK will leave the EU without a deal, followed by Northern Ireland, Scotland and the City of London leaving the UK.\n\n2019 50 years after men first walked on the moon, what will be the year’s biggest space exploration story? SE Cupp CNN commentator Commercial space exploration happening next year -- both SpaceX and Boeing are looking to send NASA astronauts. I’m also available, guys! Jill Filipovic CNN opinion contributor Fingers crossed it's Jeff Bezos launching himself into space. James Gagliano CNN law enforcement analyst 2019 could be the year of the US Space Force, as Pentagon and Trump administration officials remain deeply engaged in discussions on the topic. If the Russians have had one on-and-off since the early 1990s, why can’t we? Frida Ghitis CNN opinion contributor Entrepreneurs Richard Branson and Jeff Bezos, racing to privatize space travel, will send their first tourists into orbit. That will become the top space story of the year. But for those of us who remain earthbound, nothing will beat the thrill of watching the International Space Station streaking gently across the sky. You can do what I do, sign up with NASA for alerts when the ISS flies over your house. Joey Jackson CNN legal analyst SpaceX and/or Boeing will launch NASA astronauts inside commercial space ships. Thereafter, it’ll become accessible to the masses (who have enough money to pay for seats). Scott Jennings CNN contributor Non-astronauts will fly into space -- albeit briefly -- on a commercially purchased ticket. Roxanne Jones CNN opinion contributor A human-led expedition to Mars, comprised of volunteer American citizens, scientists and others from across the globe – and funded by Elon Musk’s SpaceX project. Add my name to the list. This #Trekkie is ready to “seek out new life and new civilizations.” Peniel Joseph CNN opinion contributor In 2019, we will send an unmanned space probe to Mars -- bringing us one step closer to successfully landing astronauts on the red planet. Dean Obeidallah CNN opinion contributor We send NASA astronauts into Trump’s brain to figure out what is going on with him. There is clearly a great deal of space there to explore. Or, perhaps more realistically, commercial flights successfully head into space. Jen Psaki CNN political commentator We will learn a lot more about the climate on Mars, thanks to NASA. Raul Reyes CNN opinion contributor Space tourism -- the race between rich guys Jeff Bezos and Elon Musk to send paying passengers into outer space. Timothy Stanley Historian We’re still dreaming of going to Mars, but my hope for 2019 is that someone finally explores us: an alien who took the wrong turn around Venus. I’d like to hand them the keys to the planet and let them run it for a while, and if they occasionally eat us, it’ll still be an improvement on the current management. Alice Stewart CNN political commentator The most important space story for 2019 concerns progress being made to prioritize the national security issues related to space, in an effort to stay competitive with China and Russia. The establishment of the New Space Command is a step closer to President Trump's desired Space Force, which would ensure the safety of US spacecraft and astronauts in space. I support the idea of the Space Force, but believe it can be accomplished in the current structure of the US military. Holly Thomas CNN opinion contributor Chinese aircraft Chang’e-4 is due to land on the dark side of the moon. I think it's extraordinary that, despite the fact we've gone so much farther afield already, this will be the first time humans have explored the unseen side of our satellite. Jeff Yang CNN opinion contributor Elon Musk's orbital Tesla is going to make a first encounter with intelligent alien life.\n\n2019 What will the Dow Jones end at in 2019? Jill Filipovic CNN opinion contributor It will be down 0.3%, a number I have selected for absolutely no reason. James Gagliano CNN law enforcement analyst Though my enthusiasm for tracking the market summary waned following the evaporation of the vast majority of my 401(k) on that darkest of days of 2008, I am going to predict we'll be somewhere around where we are right now, in the 24,000 range. Frida Ghitis CNN opinion contributor The stock market euphoria that greeted Donald Trump’s election, like many other illusions, is now over. The Dow was already rising nicely in 2016 and the optimism continued in 2017. The party has ended. In 2019, the market will fall in the first part of the year and start recovering in the latter part. Final Dow: 22,500. Joey Jackson CNN legal analyst 25,783 -- market remains strong, with ebbs and flows Scott Jennings CNN contributor Take your Dramamine® and delete your favorite stock ticker from your phone. A flat year is a win at 23,900. Roxanne Jones CNN opinion contributor Expect more dizzying ups and downs in early 2019, as the results of Trump’s trade wars, attacks on tech companies, and other policies unsettle investors. Then, the Dow will slow down considerably and level off around 26,000, as investors pull back and America braces for the 2020 presidential election. Peniel Joseph CNN opinion contributor 22,000. The President’s resumption of trade wars with China and other parts of the world keeps skittish investors on their toes. Dean Obeidallah CNN opinion contributor 26,342, so slightly better than it is today. Jen Psaki CNN political commentator With rising uncertainty in the global marketplace over China and a slowdown in growth, the Dow will go down next year to 23,000. Raul Reyes CNN opinion contributor Dow Jones will end around 21,000 in 2019, due to domestic political instability and growing economic uncertainty over Trump’s trade policies. Alice Stewart CNN political commentator When it comes to the Dow and polling, I follow trends and not daily snapshots. We are ending 2018 close to where we started in January, around 24,800, so I will say we will end 2019 in that rage, around 24,600. Holly Thomas CNN opinion contributor Much like the cult hero of “Legally Blonde,” Elle Woods, I suspect the DJ will “bend and snap.” That is to say: the hugely volatile political landscape internationally in 2019 and new trade arrangements will see everything vulnerable for a while, but it will settle roughly back where it started by Christmas -- hovering around 24,000. Jeff Yang CNN opinion contributor It'll depend on whether stock prices are being calculated in rubles or in renminbi, I guess. For now, closer to 15,000.\n\n2019 What will be the Grammys’ Album of the Year? Country singer Kacey Musgraves took home the Grammy for her album, “Golden Hour.” SE Cupp CNN commentator Cardi B's \"Invasion of Privacy.\" Jill Filipovic CNN opinion contributor It had damn well better be Janelle Monaé. James Gagliano CNN law enforcement analyst “Beerbongs and Bentleys” and “Dirty Computer” are really two of the nominees? Since no music from the 1970s was nominated, I guess the Grammy for Album of the Year goes to “Black Panther” -- only because I enjoyed the movie and because I don't recognize any of the other albums nominated. Frida Ghitis CNN opinion contributor The most striking feature of the Grammy awards will be the dominance of women, who will shine in most categories after last year’s embarrassment. The winner will be the unpretentiously likeable folk singer-songwriter Brandi Carlile, nominated for six Grammys. Best album: “By the Way, I Forgive You.” Joey Jackson CNN legal analyst Cardi B: “Invasion of Privacy.” She’s a rising star who is authentic, fresh, new and raw. Scott Jennings CNN contributor Unless it is on “Kids Place Live” on SiriusXM, I probably haven’t heard it. I will go with “Scorpion” by Drake. Roxanne Jones CNN opinion contributor Cardi B’s “Invasion of Privacy” wins Album of the Year because I love imperfect, confident, self-made women. And as a child of the original hip-hop generation, I always want this beautiful, unapologetically black musical genre to win on the big stage. Peniel Joseph CNN opinion contributor The “Black Panther” album will win. A cultural milestone that dominated 2018 reaps full rewards and recognition across multiple platforms, led by the Pulitzer Prize-winning icon Kendrick Lamar. Dean Obeidallah CNN opinion contributor I’ll go with Drake’s album. Jen Psaki CNN political commentator Cardi B. It is the year of the rapper with a huge number of nominations, and whether you like her or not, she is the most talked-about and fascinating musical artist this year. Raul Reyes CNN opinion contributor The Grammys have not always been inclusive when it comes to women and hip-hop artists. 2019 will be different when Cardi B wins best Album for “Invasion of Privacy.” Timothy Stanley Historian I cannot predict the winner of the Grammys because I don't listen to contemporary music; it all sounds like noise to me, either people shouting at each other or operating industrial machinery. I am amused, though, to see Rick Astley is recording again -- that man really never gives up. I'd give the prize to him. Alice Stewart CNN political commentator I am not a fan of potty-mouth music, so that doesn’t help in my predictions. I would like to see Brandi Carlile’s “By the Way, I Forgive You” album win, but I believe Drake’s “Scorpion” will get the nod in 2019. Holly Thomas CNN opinion contributor The “Black Panther” album is wicked, but I suspect it will be either Janelle Monae’s year or Drake’s. Drake has a lot of nominations though, so perhaps Monae will take best album and he can hoover up the rest. I guess it all comes down to (sorry) God’s Plan. Jeff Yang CNN opinion contributor The Robert Mueller Sessions, Vol. 1-8 would be my pick, but it’ll probably be “Black Panther.” However, anyone but Post Malone is fine by me.\n\n2019 Who will win the World Series? And who will win the MLB’s first regular season London games in June -- the Yankees, the Red Sox, or will there be a split? The Yankees won both games in London. SE Cupp CNN commentator I always have to bet on my Mets -- because by law Mets fans are required to be delusional. But in reality, the Red Sox for the series win and for the London games. Jill Filipovic CNN opinion contributor Let's say Red Sox for both, because even spending almost all of one's adult life in New York can't make a person root for the Yankees. James Gagliano CNN law enforcement analyst I do this every year -- vote with my heart and choose my hometown Atlanta Braves. And since I’m married to a diehard New York Yankees fan – the Yanks over the Sawx in London. Frida Ghitis CNN opinion contributor The Los Angeles Dodgers will win the World Series. The Yankees will win the London series. The Brits will fiercely debate the merits of baseball and conclude with great satisfaction that, while their brush with baseball was not quite a damp squib, cricket remains superior. Joey Jackson CNN legal analyst Yankees & Yankees. They are overdue, and they have the talent to make great things happen. Scott Jennings CNN contributor St. Louis Cardinals ride Paul Goldschmidt’s 40 home runs campaign to the World Series title. Red Sox beat Yanks overseas. Roxanne Jones CNN opinion contributor And the Yankees win -- including in London. No way my team allows the Red Sox, Astros, Dodgers or any other team to ruin our dynasty. Loaded with cash to spend on super star free agents, the Commissioner’s Trophy returns home to New York in 2019. Peniel Joseph CNN opinion contributor Yankees for both, since they have upgraded their pitching and have several important players returning to start their lineup. Dean Obeidallah CNN opinion contributor The NY Mets will turn it around and stun the world in 2019. The Yankees will sweep the London series, beating the Red Sox so badly that some Red Sox players will actually defect to the United Kingdom instead of returning home to face the embarrassment. Jen Psaki CNN political commentator Red Sox in the US, Red Sox in London. The only thing I like about baseball is hot dogs, so I am relying on my baseball-loving husband for his prediction. Raul Reyes CNN opinion contributor The Dodgers are going to win the series because I am from LA, and I believe! Go Dodger Blue! The Red Sox will win the MLB London games. Timothy Stanley Historian I don't follow baseball, but I've lived in Washington, DC, so my team is the Nationals. For London, I think the British would most enjoy a Red Sox win. Alice Stewart CNN political commentator I’m a Braves fan, but I predict the Houston Astros will win the World Series in 2019. They have a strong pitching rotation with Justin Verlander and Gerrit Cole -- and that will help in the coming year. It will be exciting to watch MLB in London and see how folks across the pond respond. I would like to see a split with Yankees and Red Sox each winning a game. Holly Thomas CNN opinion contributor I am terrible on sport, for which I would rather blame traumatic physical education experiences than an inherent disinterest in teamwork (ahem). However, my highly scientific Twitter survey earlier today suggested that the Dodgers are a reasonable shout for the Series, and the Red Sox will win the closely-contested London games. Jeff Yang CNN opinion contributor I'm going to say the Yankees for both. Don't Aaron Judge me.\n\n2019 What will President Trump’s approval rating be at the end of 2019? SE Cupp CNN commentator I’m guessing Democratic investigations will actually help him slightly, so I’ll put him at a 48%. Jill Filipovic CNN opinion contributor Forty percent because a lot of people are terrible. James Gagliano CNN law enforcement analyst Somewhere around the intersection of “piss a third of the country off,” “make a third of the country gleeful” and “leave all of us wondering why no one spellchecks his tweets prior to posting.” Which is to say, I think his approval will be a soft 42%. Frida Ghitis CNN opinion contributor In the months ahead, Americans will learn more about the dealings of the Trump campaign, the Trump presidency and the Trump family. The investigations brewing for the past two years will come to a boil and the Democratic-led House of Representatives will hold public hearings on scandal after scandal. Approval rating: 29%. Joey Jackson CNN legal analyst Thirty-three percent -- he is just too disruptive and divisive. Additionally, he will be impeached by then. Scott Jennings CNN contributor I think it’ll remain close to what it is today, ending at 42%. Roxanne Jones CNN opinion contributor Trump’s approval rating will hover around 35%, unless the President can deflect America's attention from the results of Mueller’s Russia investigation. Trump will be impeached by the House, and even if the mostly-GOP Senate fails to convict, Trump will be disgraced and pressured to resign. Peniel Joseph CNN opinion contributor Forty percent. The President manages to hold onto virtually 100% of his base of support, irrespective of his policies, speeches or actions. Dean Obeidallah CNN opinion contributor That assumes Trump will be President. If he is still President by then, I think it’ll hover at 35%. Jen Psaki CNN political commentator Under 40. How far under 40 depends first on the economy and second on Mueller, but I’d predict just below 30%. Raul Reyes CNN opinion contributor For the President, it is all downhill from here. With the Mueller probe notching more guilty pleas and indictments, and the economy showing signs of weakness, his approval rate will tumble to 33%. Timothy Stanley Historian Trump’s approval rating seems to have a ceiling of 45% and is heavily concentrated in rural areas. I predict it will remain just that. He deserves to poll better given the state of the economy, yet cannot make inroads because his personality and cultural politics alienate half the country. He is the embodiment of polarization. Alice Stewart CNN political commentator Fearing the outcome of the Mueller investigation, I expect President Trump’s approval rating at the end of 2019 will drop to around 40% -- with disapproval of 55%. A strong economy will go a long way to helping the approval rating. Holly Thomas CNN opinion contributor I think the President's approval rating will be 37% -- similar to his lowest point so far (as a pollster average) in December last year. Pressure is mounting on all sides -- from Mueller to clashes with Congress over the border wall to the continued revelations about his seemingly crooked property empire. Jeff Yang CNN opinion contributor I think that it is a safe bet that Donald Trump will set a record for lowest approval before next year is out (and before he is). My prediction: based on Gallup polling dating back to Harry Truman’s presidency, Trump would be the first POTUS in recent history with a sub-20% rating.\n\n2019 Who will win the Super Bowl? The New England Patriots beat the Los Angeles Rams in the lowest-scoring Super Bowl in history. SE Cupp CNN commentator Green Bay Packers -- it’s our year, I can feel it. Jill Filipovic CNN opinion contributor My hometown team, the Seattle Seahawks. James Gagliano CNN law enforcement analyst With my beloved Atlanta Falcons all but eliminated from playoff contention, how many days until pitchers and catchers report? But if I'm to be forced into this, I think it will be the Houston Texans, who beat the Chicago Bears, 35-17. Frida Ghitis CNN opinion contributor The New Orleans Saints will defeat the Kansas City Chiefs. It will be a great match, but with smallish-city teams in the big game, viewership will be at record lows. Joey Jackson CNN legal analyst Los Angeles Rams -- great young quarterback, talented running back and lots of secret weapons. Scott Jennings CNN contributor Los Angeles Rams. Roxanne Jones CNN opinion contributor Coach Sean Payton and his New Orleans Saints will win the Super Bowl in Atlanta. I had sweet dreams of my Philadelphia Eagles repeating this season, but those dreams died long ago. Peniel Joseph CNN opinion contributor Dallas Cowboys. The addition of Amari Cooper, the talent of Ezekial Elliot and the steadiness of Dak Prescott fuel the Cowboys toward a surprisingly deep playoff run and their first Super Bowl victory since 1996. Dean Obeidallah CNN opinion contributor New York Giants. Jen Psaki CNN political commentator New Orleans Saints -- rooting for the over-40 quarterback! Raul Reyes CNN opinion contributor The Super Bowl is in Atlanta, but the championship is going to the City of Angels -- Los Angeles Rams! Timothy Stanley Historian I have no idea who will win the Super Bowl, but I'm a Catholic and I've always liked the name \"Arizona Cardinals.\" It makes me think of a priest on horseback. Alice Stewart CNN political commentator I’m going to go with Drew Brees and the New Orleans Saints. They have had a strong offensive season, and they get bonus points for having “Choppa Style” dance moves to help them celebrate. I also expect Drew Brees to win MVP. Holly Thomas CNN opinion contributor Maroon 5 have already won -- I don’t care how many hits they have, it is absurd that they (probably) got that gig. But if you force me to choose an actual team, I’d say the Saints. Jeff Yang CNN opinion contributor Let’s go with the Kansas City Native Americans.", "description": "CNN contributors and commentators make predictions for some of 2019’s big events.", "authors": [], "top_image": "https://i2.cdn.turner.com/cnnnext/dam/assets/181220132346-20181220-opinion-crystal-ball-card.jpg"}