{"pub": "blastingnews", "url": "https://us.blastingnews.com/opinion/2019/10/syrian-christians-stay-behind-in-wake-of-donald-trumps-removal-of-troops-003002893.html", "downloaded_at": "2019-10-22 13:20:49.023964+00:00", "title": "Syrian Christians stay behind in wake of Donald Trump's removal of troops", "language": "en", "text": "Donald Trump removed the U.S. armed forces from Syria, leaving the Kurds at the mercy of the Turks. Christian's lives are especially at risk in this Muslim nation. Even so, The Christian Post says there are believers in Christ who have decided to stay behind and help. David Curry, president of Open Doors Ministry says those who remain have determined to be salt and light amid the crisis. NPR News quotes Genera George Petraeus as saying the Kurds believe they have no friend but the mountains.\n\nIt seems now that they do have a few allies willing to risk their lives to assist these displaced Syrian Christians.\n\nDonald Trump has caused unnecessary loss of life\n\nDonald Trump's abrupt decision to remove U.S. forces from Syria has resulted in casualties, including women and children. There has been a worldwide outcry against the President of the United States and even from a growing number of Republicans have condemned him.\n\nGenera Petraeus says this action is a betrayal of the Kurds who have assisted American soldiers in the past at the cost of thousands of Kurdish lives. These mountain people have not, however, been completely abandoned. Several Syrian Christians decided to remain behind and help.\n\nChristian organizations such as Preemptive Love Coalition and Open Door, along with local churches, are caring for the people who remained behind and will also help citizens who desire to return.\n\nDon’t miss the latest news! Click on the topic you interest most. We'll keep you updated with all the news you shouldn't miss. Donald Trump\n\nLast Saturday night, the Alliance Church of Qamishi met after three days of bombing by the Turks. They realized they had no choice but to stay and help those displaced by the war. It was decided that only eight families would be leaving the area. These brave individuals face the daunting task of cleaning up the mess that was created by Donald Trump.\n\nSyrian Christians assist the Kurds\n\nUnfortunately, Donald Trump did not heed the sage words of his advisors.\n\nHis actions have shocked the world are allowing the Turkish army to carry out their agenda of ethnic cleansing against the Kurds. Evangelicals, including Pat Robertson and Frankin Graham, have spoken out against the president's decision, saying it will hurt Christians along with others in the area. Thankfully the Christian Syrians decided to bravely remain behind and assist the least of these as is commanded in the Bible in Matthew 25:40.\n\nOn Wednesday, members of Congress denounced Donald Trump's decision in a vote of 354-60. Senate Majority leader Mitch McConnell decried the actions of the president as a \"grave strategic mistake.\" The Kurdish fighters have been U.S. allies and played an important role in the fight against ISIS. The current ceasefire in the area may end soon because Turkish President Recep Tayyip Erdogan has given Kurdish forces until Tuesday to retreat or Turkey will resume its offensive.", "description": "Believers in Christ bravely put themselves in harms way feeling that they have no choice.", "authors": ["Music Crowns", "Zeegee Cecilio", "Ramon Sanchez", "Read More On The Same Topic Cheryl Preston", "Prince Harry", "Meghan Markle Will Take Six Week Sabbatical After African Tour", "General James Mattis Speaks Out", "May Cause Others To Be Honest About Donald Trump", "Kate Middleton Follows In Diana'S Footsteps", "Dons A Tiara For A Really Great Cause"], "top_image": "https://staticr1.blastingcdn.com/media/photogallery/2019/10/20/os/b_1200x630/local-churches-and-christian-organizations-remain-in-syria-to-hep-the-kurds-image-source-pixabay_2342103.jpg", "published_at": "2019-10-20"}