{"pub": "independent", "url": "https://independent.co.uk/travel/news-and-advice/aviation-photography-air-new-zealand-london-heathrow-plane-moon-a9103866.html", "downloaded_at": "2019-09-13 18:16:17.042942+00:00", "title": "Photographers capture planes flying in front of full moon", "language": "en", "text": "Almost 20,000 planes are in the sky at any given time, so seeing an aircraft fly overhead usually isn’t anything to shout about.\n\nNot so with these planes, which were captured flying in front of the moon.\n\nIn the UK, Toby Melville captured an aircraft on its final approach into London Heathrow airport, with the full moon shining in the background.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThen on the other side of the world, a New Zealand-based photographer captured a passenger plane coming in to land at Wellington airport, backlit by the moon.\n\nShape Created with Sketch. Plane brightens skies with beautiful rainbow trail Show all 7 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Plane brightens skies with beautiful rainbow trail 1/7 A passenger plane is pictured brightening the skies over Germany as it leaves behind a rainbow-coloured trail. Nick Beyersdorf / SWNS 2/7 The trail is an aerodynamic contrail - or condensation trail - as opposed to the more common jet contrails that are formed of exhaust fumes. Nick Beyersdorf / SWNS 3/7 Aerodynamic contrails occur when a plane lowers the air pressure as it flies, in turn lowering the air temperature and causing condensation to form on the wings. Getty 4/7 This condensation then trails behind as the plane continues forward. Nick Beyersdorf / SWNS 5/7 In humid conditions, the drop in temperature and pressure is such that the droplets of condensation will freeze at varying sizes. Nick Beyersdorf / SWNS 6/7 When the sunlight shines through these different sized droplets, it will refract at different wavelengths, hence the variety of colours that can be seen. Nick Beyersdorf / SWNS 7/7 Photographer Nick Beyersdorf captured the phenomenon from the ground in Bamberg, Germany. Nick Beyersdorf / SWNS 1/7 A passenger plane is pictured brightening the skies over Germany as it leaves behind a rainbow-coloured trail. Nick Beyersdorf / SWNS 2/7 The trail is an aerodynamic contrail - or condensation trail - as opposed to the more common jet contrails that are formed of exhaust fumes. Nick Beyersdorf / SWNS 3/7 Aerodynamic contrails occur when a plane lowers the air pressure as it flies, in turn lowering the air temperature and causing condensation to form on the wings. Getty 4/7 This condensation then trails behind as the plane continues forward. Nick Beyersdorf / SWNS 5/7 In humid conditions, the drop in temperature and pressure is such that the droplets of condensation will freeze at varying sizes. Nick Beyersdorf / SWNS 6/7 When the sunlight shines through these different sized droplets, it will refract at different wavelengths, hence the variety of colours that can be seen. Nick Beyersdorf / SWNS 7/7 Photographer Nick Beyersdorf captured the phenomenon from the ground in Bamberg, Germany. Nick Beyersdorf / SWNS\n\nAviation snapper Tim Gorman captured Air New Zealand flight NZ5823 as it was flying from Hamilton, on the North Island, further south to capital Wellington.\n\nIn the image, the ATR 72-600 twin-engine plane is seen flying in front of a full moon.\n\nMr Gorman told Newshub that he was “over the moon” with the shot.\n\n“It it was pure luck as I was just getting the moon at twilight and just happen to by chance have the camera on the moon and clicking away as the aircraft went past,\" he said.\n\n“It’s a very hard shot to ever get and is just something you get at the right place at the right time.”\n\nEarlier this week, a photographer captured a rainbow-coloured vapour trail streaming from a Qatar Airways aircraft flying 30,000ft above Brisbane.\n\nThe Boeing 777 jet was flying from its home base of Doha, Qatar, to Auckland in New Zealand when its contrails caught the late winter light.\n\nPhotographer Michael Marston captured the rainbow trail for his site ePixel Aerospace. He called the sight “one of the most spectacular rainbow contrails” he had ever seen.\n\nThe trail is an aerodynamic contrail – short for condensation trail – as opposed to the more common jet contrails that are formed of exhaust fumes.", "description": "Almost 20,000 planes are in the sky at any given time, so seeing an aircraft fly overhead usually isn’t anything to shout about. Not so with these planes, which were captured flying in front of the moon. In the UK, Toby Melville captured an aircraft on its final approach into London Heathrow airport, with the full moon shining in the background. Then on the other side of the", "authors": ["Travel Desk"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/13/17/pri84495282.jpg", "published_at": "2019-09-13"}