{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7619531/Kylie-Jenner-steps-shower-wearing-black-leather-dress-heels-raucous-night-out.html", "downloaded_at": "2019-10-28 00:36:52.877189+00:00", "title": "Kylie Jenner steps into the shower wearing a black leather dress and heels during raucous night out", "language": "en", "text": "She treated fans to a glimpse of her Halloween celebrations on Saturday, when she took to Instagram to share images of herself partying with her famous pals.\n\nBut Kylie Jenner, 22, opted to keep her 149 million followers entertained before the action kicked off, by posting snaps of herself posing in an open communal shower – while wearing a black leather Christian Cowan dress.\n\nThe Keeping Up With The Kardashians star, who teamed the button-down number with a pair of Balenciaga ‘Dance Knife’ pumps, flashed a glimpse of her pert posterior as she posed with her back to the camera.\n\nHell for leather: Kylie Jenner shared shot of herself posing in an open communal shower on Saturday night – while wearing a black leather Christian Cowan dress\n\nShe also posed with one of her shapely legs exposed from the thigh-high split in the gown's skirt as she hammed it up for the camera, later captioning the shots: 'showering you with loooooooks [sic], followed by a string of emojis.\n\nWearing her raven locks in a long wavy style with a centre-parting, the mother-of-one highlighted her good looks with a rich palette of impeccably-applied makeup.\n\nAs the night progressed, the younger sister of Kim Kardashian uploaded footage of herself partying with her friends Sofia Richie, Will.I.Am, and J Balvin.\n\nPose: The star, who teamed the button-down number with a pair of Balenciaga ‘Dance Knife’ pumps, flashed a glimpse of her pert posterior as she posed with her back to the camera\n\nModel Sofia kept things casual in a light turtleneck cropped sweater and a black pair of high-waisted grey trousers.\n\nThe pals spent time backstage at J Balvin's show together, where they were seen swigging tequila straight from the bottle before being joined by musician Will.I.Am.\n\nOf course, with the occasion being Halloween, Kylie soon got into the spirit of things just a few short hours later, sharing the result of her efforts on Instagram.\n\nNight: The mother-of-one enjoyed a night on the town that included a trip to J Balvin's concert\n\nSwig: Kylie and her pal Sofia Richie swigged straight from a bottle of tequila while backstage\n\nShe opted to dress up as Madonna from the MTV Video Music Awards in 2003 as she stepped out with her pal Stassie Karanikolaou, who channelled Britney Spears.\n\nIn keeping with the pop superstars' memorable performance during the awards show, billionaire Kylie leaned in to reenact their headline-making kiss with her friend.\n\nKylie donned an all-black ensemble that included a tight tank top, trousers, and long wrist warmers, while she looked ready for the stage while toting a microphone.\n\nThe man of the moment: Kylie and her friend J Balvin posed backstage ahead of his concert\n\nWhere is the love: The star also shared footage of herself hanging out backstage with Will.I.Am\n\nStassie portrayed Toxic hitmaker Britney by spotting a ruffled white satin miniskirt teamed with a lace bustier and large collection of silver chains.\n\nTo add to the authenticity of the infamous moment, they danced and lip-synched to Madonna's classic Like A Virgin before Kylie went in for a blink-and-you'll-miss-it kiss.\n\nMadonna and Britney's kiss at the 2003 MTV VMAs made huge headlines at the time, overshadowing the smooch the Material Girl also shared with fellow performer Christina Aguilera at the show.\n\nAudiences watching at home missed Madonna and Christina's lip-lock as MTV cameras panned away to get a reaction shot of Britney's ex Justin Timberlake.\n\nCostume: Kylie dressed up as Madonna from the MTV Video Music Awards in 2003, while her pal Stassie Karanikolaou channelled Britney Spears – complete with a kiss", "description": "She treated fans to a glimpse of her Halloween celebrations on Saturday, when she took to Instagram to share images of herself partying with her famous pals.", "authors": ["Ryan Smith For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/19/20252868-0-image-a-31_1572205874281.jpg", "published_at": "2019-10-27"}