{"pub": "yahoo", "url": "https://finance.yahoo.com/news/gold-price-prediction-prices-whipsaw-191142551.html", "downloaded_at": "2019-10-02 00:42:59.977697+00:00", "title": "Gold Price Prediction – Prices Whipsaw Following Weak US ISM Manufacturing Data", "language": "en", "text": "Gold prices whipsawed, initially moving lower but rebounding sharply during the North American trading session following a weaker than expected ISM manufacturing report. The unexpected reading put downward pressure on US interest rates, which in turn weighed on the US dollar. This paved the way for higher gold prices. The dollar had been outperforming most other currencies, despite soft data. This is because data in European and Asia has been even worse than the recent US data.\n\nTrade gold with FXTM\n\n[fx-broker slug=fxtm]\n\nTechnical Analysis\n\nGold prices whipsawed and early was headed to support near the 50-day moving at 1,426. Prices rebounded sharply following the ISM report testing resistance and failing near a horizontal trend line that comes in near 1,487. Additional resistance is seen near the 10-day moving average at 1,502. Short term momentum has turned negative as the fast stochastic generated a crossover sell signal in the middle of the neutral range, and continues to accelerate lower. Medium-term momentum has turned negative again. The MACD histogram is printing in the red with a downward sloping trajectory which points to lower prices for the yellow metal.\n\nManufacturing in the US is Weaker than Expected\n\nThe US ISM manufacturing purchasing managers’ index declined to 47.8 in September, the lowest since June 2009, marking the second consecutive month of contraction. According to the Institute of Supply Management figures below 50, indicate a contraction. The new export orders index was only 41, the lowest level since March 2009, down from the August reading of 43.3, according to the ISM. Exports were the key catalyst and with no agreement between the US and China on the horizon, manufacturing is likely to continue to contract. The ISM employment gauge for the sector showed the lowest reading since January 2016, primarily driven by a lack of demand. New orders, also contracted last month, according to the ISM.\n\nThis article was originally posted on FX Empire\n\nMore From FXEMPIRE:", "description": "Gold prices whipsawed, initially moving lower but rebounding sharply during the North American trading session following a weaker than expected ISM manufacturing report.  The unexpected reading put downward pressure on US interest rates, which in turn weighed on the US dollar.  This paved the way for", "authors": ["David Becker"], "top_image": "https://s.yimg.com/uu/api/res/1.2/m41ZRRbnpCEN0ocaqqYXeA--~B/aD0zNTM7dz04MDA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/fx_empire_176/51ee5cfc1ae5e55fd985e14c88b367c3", "published_at": "2019-10-01"}