{"pub": "marketwatch", "url": "https://marketwatch.com/story/this-us-city-that-trump-loves-to-hate-is-a-tourists-top-pick-for-third-year-running-2019-10-07", "downloaded_at": "2019-10-07 23:31:58.928654+00:00", "title": "This U.S. city that Trump loves to hate is tourists’ top pick for third year running", "language": "en", "text": "Topping New York and New Orleans, and edging out another Midwestern destination in Minneapolis, Chicago was named best big U.S. city by a well-regarded travel magazine Monday.\n\nIt’s the third straight No. 1 ranking from Condé Nast Traveler for a city that President Trump and his family, who developed and operate a hotel and condominium tower along the Chicago River, have ridiculed over its crime rate relative to, for example, New York’s.\n\nYet for the visitors laying down tourism dollars, Chicago was selected as a U.S. favorite by more than 600,000 Condé Nast readers in a survey asking about recent visits.\n\nMarketWatch/Tim Rostan A view from the Nature Boardwalk at Chicago’s 151-year-old Lincoln Park Zoo.\n\nThe magazine’s editors called the city a “world-class destination known for its impressive architecture, first-rate museums, brilliant chefs and massive brewing scene,” adding that it’s full of “some of the most pleasant people you’ll find anywhere.”\n\nIn pinning Minneapolis with its second-place medal, editors praised it for having one of the best park systems in country, a robust culinary scene and “that whole, ‘Minnesota nice’ thing.”\n\nRounding out the list of 10 Best Big Cities: Boston (No. 3), New Orleans (4), Washington, D.C. (5), San Diego, Calif. (6), New York City (7), Pittsburgh, Pa. (8), Honolulu, Hawaii (9), and San Antonio, Texas (10).\n\nFrom the MarketWatch archives (February 2018): Chicago, Porto and Melbourne ‘have it all,’ says Time Out — Chicago, especially\n\nAlso (October 2017): Chicago earns high global ranking as a ‘safe’ city — and here’s why\n\nMeet Minneapolis Minneapolis experiences, and embraces, all four seasons. The city also boasts more than 10 James Beard Award semifinalists and the winner for best chef in the Midwest in 2019.\n\nCharleston, S.C., and Santa Fe, N.M., ranked first and second among smaller cities.\n\nThe “big city” question within a broader survey at the magazine is relatively new, dating just to 2015. New York City won in 2015 and 2016; Chicago has claimed the spot every year since.\n\nRead: What is the most powerful passport in the world?\n\nDespite the city’s well-publicized reputation for gun violence especially during an alarming 2015–16 uptick and particularly in high-gang-concentration areas (the still-high 236 murders reported from Jan. 1 to June 30 represented a 7% decline from the same period last year and the fewest since 2016, police said, while the murder rate has remained higher through recent years in a number of cities, including St. Louis, Baltimore, New Orleans, Memphis and Newark), Chicago tourism has shown few if any signs of slowing down in recent years.\n\nAnnual visitor projections released in early 2019 by tourism lobby Choose Chicago recorded an unprecedented 57.6 million visitors for 2018. That’s a 4.3% jump over 2017’s 55.2 million. Some 26 new hotels have opened in the city within the past four years. The demand for hotel rooms by leisure travelers shot up 14% in the last three years, according to Smith Travel Research data, cited by the city.\n\nOver the summer, Chicago’s Millennium Park sculpture colloquially known as “The Bean,” was vandalized with spray paint. The frequently visited installation by artist Anish Kapoor, officially called “Cloud Gate,” has claimed its rightful place among the city’s most-revered works of public art including the untitled Picasso sculpture in the civic center plaza and the Calder sculpture at Federal Plaza.\n\nDon’t miss: ‘I could live on my Social Security and still save money’: This 66-year-old left Chicago for ‘calming’ Costa Rica — where he now plans to live indefinitely", "description": "Chicago is again named best big U.S. city by the prominent Condé Nast Traveler magazine.", "authors": ["Rachel Koning Beals", "News Editor"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HI199_chicag_ZG_20190424144345.jpg", "published_at": "2019-10-07"}