{"pub": "yahoo", "url": "https://news.yahoo.com/walmart-offers-health-degrees-to-store-associates-113048340.html", "downloaded_at": "2019-09-25 04:40:38.497444+00:00", "title": "Walmart expands workers' college benefits to include health, wellness degrees", "language": "en", "text": "Walmart (WMT), the largest private employer in the U.S., is making a big push to educate its employees for health-related jobs that pay more.\n\nAs the big box retailer moves further into the health services business, Walmart will offer its 1.5 million U.S. associates the opportunity to apply for one of seven health-related bachelor’s degrees, and two career diplomas: Pharmacy technician and optician.\n\nThe new options are part of its exiting $1-a-day college tuition perk, called Live Better U.\n\n“Our presence in thousands of communities gives us a unique opportunity to provide access to affordable healthcare for millions of people and we need expertly trained associates in our to do that,” said Thomas Van Gilder, Walmart’s chief medical officer.\n\n“We believe Live Better U will play a critical role in preparing our 1.5 million associates for future work opportunities at Walmart and in the healthcare field overall, providing needed support in the communities where they live and work,” Van Gilder added.\n\nOriginally, the program offered degrees in business, leadership and management. Now, the new health degrees offered by Live Better U will include bachelor’s in health science, health and wellness, and healthcare management/administration.\n\nThey are offered through Purdue University Global, Southern New Hampshire University, Bellevue University, and Wilmington University. Career diplomas for pharmacy technicians and opticians are offered through Penn Foster.\n\n“These programs are selected to provide an opportunity for our associates as well as access to a higher paying future and to fill a critical need in a growing field,” Van Gilder added.\n\nThe waiting room for the Walmart Health in Dallas, Georgia. More\n\nWalmart currently employs more than 40,000 pharmacy techs and opticians at its 5,000 retail pharmacies, 3,000 vision centers, and 400 hearing centers in the U.S. With 90% of the U.S. population living within 10 miles of a Walmart store, health care presents a growing opportunity for the retailer.\n\nThis month, Walmart opened its first-ever Walmart Health center in Dallas, Georgia that offers health services such as primary care, X-rays, labs and EKG, counseling, dental, optical, and hearing — regardless of insurance coverage.\n\nThe retailer also has 19 Walmart Care Clinics in Texas, South Carolina, and Georgia that offer urgent care services.\n\n“We aim to be a market leader in providing careers in things like healthcare,” said Drew Holler, senior vice president of associate experience for Walmart’s U.S. division.\n\nAt Walmart, pharmacy technicians and opticians earn starting wages that are 15% higher than entry-level roles and can earn more than $22 an hour. They typically start around $13 an hour, and can eventually earn over $22 per hour.\n\nIn 19 states that require licensed opticians, they start at $21.25 an hour and can make up to $36.13 an hour.\n\nGrowing menu of programs\n\nTo date, more than 13,500 Walmart associates have been accepted in at least one of the Live Better U programs, ahead of the company’s expectations.\n\nAlso, Walmart’s extensive range of educational benefits offers discounts on master’s degrees, the ability to finish high school for associates and eligible relatives, and free foreign language learning.\n\nFor the program, Walmart partnered with Guild Education, a firm that helps companies offer education benefits to employees.\n\nDegrees were initially offered from three universities — University of Florida, Brandman, and Bellevue University — mostly because they cater to adult learners. Walmart also added more technology-focused degrees, as the nature of work and retail continue to evolve.\n\nWalmart also now covers 14 technology degrees and certificates under its $1-a-day college program, including cybersecurity, information technology, web applications development, to name a few.", "description": "Starting wages for pharmacy technicians and opticians are about 15% higher than other entry-level roles at Walmart.", "authors": ["Julia La Roche"], "top_image": "https://s.yimg.com/uu/api/res/1.2/97iRDeE8NniEryb6VAs4NQ--~B/aD0yNDAwO3c9MzU5NjtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/61afb920-deaf-11e9-b76b-b5d8225a04d9", "published_at": "2019-09-24"}