{"pub": "foxnews", "url": "https://foxnews.com/us/crew-member-who-survived-dive-boat-fire-files-lawsuit-against-owner-report", "downloaded_at": "2019-09-19 09:39:12.283693+00:00", "title": "Crew member who survived California dive boat fire files lawsuit against owner: report", "language": "en", "text": "A crew member who was on the dive boat that caught fire off the Southern California coast earlier this month reportedly sued the boat’s owner and the dive charter company, claiming the boat was not properly maintained and employees lacked proper training.\n\nThe Pacific Coast Times reported that Ryan Sims, the crew member, claimed he was trapped with other employees when the fire broke out on the boat, called the Conception. He reportedly claimed he was forced to jump from the top deck into the water and broke one of his legs in three places.\n\nAll six crew members were asleep when the boat caught fire, killing 34 people, federal authorities said. The National Transportation Safety Board (NTSB), in a preliminary report, said five crew members were sleeping in their quarters behind the wheelhouse on the second deck and another below deck when the fire broke out in the early hours of Sept. 2.\n\nA lawyer for the company disputed the claim that they were asleep and said earlier that a crew member “checked” the galley area about 45 minutes before the fire broke out. Worldwide Diving Adventures, the dive company, was also named in the lawsuit.\n\nCoast Guard records show the Conception passed its two most recent inspections with no safety violations. Previous customers said the company that owns the vessel, Truth Aquatics, and the captains of its three boats, were very safety conscious.\n\nThe paper said it reached out to lawyers for Truth Aquatics, but did not get an immediate response. Truth Aquatics Inc. filed suit in Los Angeles in federal court under a pre-Civil War provision of maritime law that allows it to limit its liability.\n\nThe suit said the company and owners Glen and Dana Fritzler “used reasonable care to make the Conception seaworthy, and she was, at all relevant times, tight, staunch, and strong, fully and properly manned, equipped and supplied and in all respects seaworthy and fit for the service in which she was engaged.”\n\nAnyone who could make a claim against the company would be served with notice that the firm was asserting it was not liable for damages and victims will have a limited time to challenge that claim.\n\nGET THE FOX NEWS APP\n\nThe time-tested legal maneuver has been successfully employed by owners of the Titanic and countless other crafts, and many maritime law experts said they'd anticipated it.\n\nFox News' Edmund DeMarche, Frank Miles and Samuel Chamberlain contributed to this report", "description": "A crew member who was on the dive boat that caught fire off the Southern California coast earlier this month reportedly sued the boat’s owner and the dive charter company, claiming the boat was not properly maintained and employees lacked proper training.", "authors": [], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/12/694940094001_6085749129001_6085751454001-vs.jpg", "published_at": "2019-09-19"}