{"pub": "scmp", "url": "https://yp.scmp.com/news/hong-kong/article/114373/hong-kong-protests-law-ban-face-masks-public-assemblies-be-enacted", "downloaded_at": "2019-10-05 22:17:13.544719+00:00", "title": "Hong Kong protests: Law to ban face masks at public assemblies to be enacted by government under Emergency Regulations Ordinance", "language": "en", "text": "The Hong Kong government is set to announce on Friday a ban on people wearing masks at public assemblies, sources have told South China Morning Post.\n\nOfficials are planning to impose the ban through legislation under a tough colonial-era emergency law in an attempt to end the street violence during anti-government protests that have been continuing for nearly four months.\n\nChief Executive Carrie Lam Cheng Yuet-ngor would hold a special meeting of her de facto cabinet, the Executive Council, to impose the ban, according to the sources.\n\nWhat are the 'five demands'? What do protesters want?\n\nThe city’s legislature will only be able to amend or repeal the legislation after implementation.\n\nIf approved, the new law would take effect within a short time, one source said, adding: “There’s no point waiting until next week.”\n\nProtesters (with vendetta masks) hold an anti-government rally in Causeway Bay during the 70th anniversary The People’s Republic of China on October 01, 2019. Photo: Felix Wong/SCMP\n\nThe colonial-era Emergency Regulations Ordinance, introduced in 1922, grants the city’s leader the authority to “make any regulations whatsoever which he [or she] may consider desirable in the public interest” in case of “emergency or public danger”.\n\nSince October 1, Lam has been facing mounting pressure to invoke the ordinance.\n\nTalking points: what one other demand could the government concede to, to put an end to the protests?\n\nTwo of Hong Kong’s largest pro-Beijing parties, the Democratic Alliance for the Betterment and Progress of Hong Kong (DAB), and the Federation of Trade Unions (FTU), as well as the Junior Police Officers’ Association (JPOA), have issued separate statements, urging Lam to adopt measures under the ordinance to better tackle the escalating social unrest.\n\nAt least 15 countries in North America and Europe have legislation banning people from wearing masks, including the United States, Canada, Germany and France.", "description": "Source says Carrie Lam's administration will convene a special Executive Council meeting on Friday to discuss legislation.", "authors": [], "top_image": "https://yp.scmp.com/sites/default/files/styles/900x506/public/images/hongkongprotestermasked_samtsang.jpg", "published_at": "2019-10-05"}