{"pub": "cbc", "url": "https://cbc.ca/news/politics/green-party-re-vetting-candidates-abortion-quebec-1.5282892", "downloaded_at": "2019-09-14 01:44:07.132476+00:00", "title": "Elizabeth May says Green party is 're-vetting' candidates after anti-abortion comments come to light | CBC News", "language": "en", "text": "Green Party Leader Elizabeth May says her party is in the process of \"re-vetting\" at least one candidate previously cleared to run for the party following questions about past statements by some candidates on abortion and Quebec nationalism.\n\nSpeaking in an interview with CBC's Power & Politics Friday, May said she is reviewing the candidacy of Mark Vercouteren in the Ontario riding of Chatham-Kent-Leamington after CBC News reported he made anti-abortion statements in two Campaign Life Coalition questionnaires — in one case as recently as the 2018 Ontario provincial election campaign.\n\nMay also said she will retain former NDP MP Pierre Nantel, who jumped to the Greens in August, as a candidate for the party in Longueuil-Saint-Hubert. She said Nantel is a Quebec \"sovereigntist\" — not a separatist — and he's agreed not to fight for Quebec's independence if elected.\n\nA spokesperson for the party initially said Vercouteren didn't remember filling out the questionnaires or writing a 2015 Facebook post in which he asked would-be anti-abortion Conservative voters to consider his candidacy.\n\n\"I personally am pro-life because I could not give more rights to animals and remove rights from potential humans,\" Vercouteren said in the post.\n\nMark Vercouteren is the Green candidate in the southwestern Ontario riding of Chatham-Kent—Leamington. (Mark Vercouteren/Twitter)\n\nWhen asked why Green Party vetters didn't come across Vercouteren's responses to the questionnaires during his vetting, May said she is reviewing the situation.\n\n\"We're doing a re-vetting ... I find that unacceptable. His position within the party is being re-vetted,\" May told Power & Politics host Vassy Kapelos.\n\n\"Someone within the team has assured me they are talking to him to try and figure out how it could happen that he doesn't remember something as recent as 2018. This is an ongoing question and I'm not satisfied with the answers I've got so far but we do give people a chance to explain themselves.\"\n\nMay said the party vets every candidate and it has an \"extensive\" process that includes a questionnaire and a search through social media histories to ensure would-be candidates comply with the party's values.\n\n\"The news cycle goes so very fast. You need to actually realize that, in real life, by the time you actually get someone on the phone and talk to them, the re-vetting can take longer than 24 hours. But we do move very quickly,\" she said.\n\nBefore Vercouteren's anti-abortion positions came to light, May had said all approved Green Party candidates were solidly pro-choice and the party had screened out those who were not.\n\nA request for comment from Vercouteren was not immediately returned.\n\nAnother Green candidate, Macarena Diab, made a few anti-abortion posts on Facebook more than ten years ago.\n\nIn an email to CBC News, Diab said she is now solidly pro-choice.\n\n\"I would appreciate it if you could include in your article all my other posts where I am clearly pro-choice, as far as 2013 actually. I would also appreciate it if you could indicate that I have publicly expressed the fact that I'm pro choice in all my pages,\" she said.\n\nGreen candidate Pierre Nantel is a Quebec 'nationalist'\n\nAs for Nantel, May said she welcomes any sovereigntist who is prepared to put aside separatist views to tackle the more pressing issue of climate change.\n\nNantel said earlier this week in a radio interview that he supported independence for Quebec \"as soon as possible.\"\n\nBut May insisted Nantel doesn't actually want to break up the country and would stay on as a candidate.\n\n\"He is not a separatist. He's a strong Quebecer within the context of Canada,\" she said at her campaign launch in Victoria on Wednesday.\n\nYesterday, in an interview with Radio-Canada, Nantel said, \"Of course I'm a sovereignist, everyone knows, and that's always been the case.\"\n\nMay explained away the contradiction Friday by saying there is a distinction between someone who advocates for Quebec sovereignty and a separatist.\n\n\"Sovereigntism and separatism they are ... it may seem like it's splitting hairs, but a lot of Quebecers are sovereignists — they respect the sovereignty of Quebec. They're not interested in separating. Pierre is not a separatist. He's not interested in breaking up the country,\" May told Power & Politics.\n\nQuebec MP Pierre Nantel (left), joined by Green Party Leader Elizabeth May, announces he will run as a candidate for the Green Party in the riding of Longueuil–Saint-Hubert, in Longueuil, Que. on Monday, August 19, 2019. (CBC)\n\nIn English Canada, both \"sovereigntist\" and \"separatist\" are used to refer to someone who advocates for the formal secession of Quebec from the federation.\n\nAccording to the CBC's language guide, the two terms are used interchangeably in Canada to describe supporters of Quebec independence.\n\nThe Oxford Guide to Canadian English Usage points out that separatist is \"commonly used by those who dislike the idea of Quebec's breaking up,\" while sovereignist (or the more common spelling 'sovereigntist') is \"favoured by those who espouse a sovereign Quebec.\"\n\nMay said she is confident Nantel will not advocate for a separate Quebec in Parliament if he is elected under the Green banner.\n\nA review of the House of Commons Hansard shows many of Nantel's interventions in Parliament were related to his position as the NDP critic for heritage. Many of his questions centred on CBC/Radio-Canada.\n\nIn one of his last interventions in the Commons, Nantel made it clear he considers himself to be a Quebec nationalist, if a \"quiet\" one.\n\n\"There is no denying, however, that, over the past few years, there has been an effort to relegate the sovereignty issue to the dustbin of history, to downplay the importance of acknowledging Quebeckers' quiet nationalism, which concerns me greatly,\" he said in French.\n\n\"I am talking about our national question being turned into a bit of folklore, because, I would remind honourable members, Quebec is a distinct nation. My general impression when it comes to defending the interests of Quebec is that there are not too many Quebec MPs who want to talk about quiet nationalism, an expression that I quite liked and adopted.\"", "description": "Green Party Leader Elizabeth May says her party is in the process of \"re-vetting\" some candidates previously approved to run for the party in the upcoming federal election.", "authors": ["Parliamentary Bureau", "John Paul", "J.P.", "Tasker Is A Reporter In The Cbc'S Parliamentary Bureau In Ottawa. He Can Be Reached At John.Tasker Cbc.Ca.", "Follow J.P. On Twitter"], "top_image": "https://i.cbc.ca/1.5283122.1568402891!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/fedelxn-abortion-20190910.jpg", "published_at": "2019-09-13"}