{"pub": "yahoo", "url": "https://finance.yahoo.com/news/does-target-healthcare-reit-plc-102003609.html", "downloaded_at": "2019-10-23 10:58:12.354132+00:00", "title": "Does Target Healthcare REIT PLC (LON:THRL) Have A Place In Your Dividend Stock Portfolio?", "language": "en", "text": "Dividend paying stocks like Target Healthcare REIT PLC (LON:THRL) tend to be popular with investors, and for good reason - some research suggests a significant amount of all stock market returns come from reinvested dividends. Yet sometimes, investors buy a popular dividend stock because of its yield, and then lose money if the company's dividend doesn't live up to expectations.\n\nIn this case, Target Healthcare REIT likely looks attractive to dividend investors, given its 5.8% dividend yield and six-year payment history. It sure looks interesting on these metrics - but there's always more to the story . Some simple analysis can reduce the risk of holding Target Healthcare REIT for its dividend, and we'll focus on the most important aspects below.\n\nExplore this interactive chart for our latest analysis on Target Healthcare REIT!\n\nLSE:THRL Historical Dividend Yield, October 23rd 2019 More\n\nPayout ratios\n\nCompanies (usually) pay dividends out of their earnings. If a company is paying more than it earns, the dividend might have to be cut. Comparing dividend payments to a company's net profit after tax is a simple way of reality-checking whether a dividend is sustainable. In the last year, Target Healthcare REIT paid out 130% of its profit as dividends. A payout ratio above 100% is definitely an item of concern, unless there are some other circumstances that would justify it.\n\nAnother important check we do is to see if the free cash flow generated is sufficient to pay the dividend. With a cash payout ratio of 130%, Target Healthcare REIT's dividend payments are poorly covered by cash flow. Paying out such a high percentage of cash flow suggests that the dividend was funded from either cash at bank or by borrowing, neither of which is desirable over the long term. As Target Healthcare REIT's dividend was not well covered by either earnings or cash flow, we would be concerned that this dividend could be at risk over the long term.\n\nREITs like Target Healthcare REIT often have different rules governing their distributions, so a higher payout ratio on its own is not unusual.\n\nRemember, you can always get a snapshot of Target Healthcare REIT's latest financial position, by checking our visualisation of its financial health.\n\nDividend Volatility\n\nFrom the perspective of an income investor who wants to earn dividends for many years, there is not much point buying a stock if its dividend is regularly cut or is not reliable. Looking at the data, we can see that Target Healthcare REIT has been paying a dividend for the past six years. It's good to see that Target Healthcare REIT has been paying a dividend for a number of years. However, the dividend has been cut at least once in the past, and we're concerned that what has been cut once, could be cut again. During the past six-year period, the first annual payment was UK£0.065 in 2013, compared to UK£0.067 last year. Its dividends have grown at less than 1% per annum over this time frame.\n\nIt's good to see some dividend growth, but the dividend has been cut at least once, and the size of the cut would eliminate most of the growth, anyway. We're not that enthused by this.\n\nDividend Growth Potential\n\nWith a relatively unstable dividend, it's even more important to see if earnings per share (EPS) are growing. Why take the risk of a dividend getting cut, unless there's a good chance of bigger dividends in future? Strong earnings per share (EPS) growth might encourage our interest in the company despite fluctuating dividends, which is why it's great to see Target Healthcare REIT has grown its earnings per share at 60% per annum over the past five years. The company has been growing its EPS at a very rapid rate, while paying out virtually all of its income as dividends. Generally, a company that is growing rapidly while paying out a majority of its earnings, is seeing its debt burden increase. We'd be conscious of any extra risk added by this practice.\n\nStory continues", "description": "Dividend paying stocks like Target Healthcare REIT PLC (LON:THRL) tend to be popular with investors, and for good...", "authors": ["Simply Wall St"], "top_image": "https://s.yimg.com/uu/api/res/1.2/5Yd.05aPOWFOvPvrE1uZgQ--~B/aD00MzI7dz0xMTk0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/simply_wall_st__316/eff18e6ceb059b23bfb8d83c6420fbeb", "published_at": "2019-10-23"}