{"pub": "reuters", "url": "https://af.reuters.com/article/worldNews/idAFKBN1W91UO", "downloaded_at": "2019-09-24 15:25:52.221664+00:00", "title": "Zimbabwe's capital resumes pumping water temporarily", "language": "en", "text": "HARARE (Reuters) - Zimbabwe’s capital Harare will temporarily resume pumping water at its main water works on Tuesday, an official said, bringing some relief to residents who have endured months without water.\n\nLocals wait for their turn to collect water from a borehole in Warren Park, Harare, Zimbabwe, September 24, 2019. REUTERS/Philimon Bulawayo\n\nMost of Harare’s water and sewer infrastructure is in a state of disrepair leaving the city unable to supply some of its more than 2 million residents.\n\nHarare City Council acting mayor Enock Mupamawonde told reporters on Monday that authorities had shut the Morton Jaffray water works citing shortages of foreign currency to import treatment chemicals.\n\nOn Tuesday he said chemicals had been secured that would last a week.\n\nThe southern African nation is gripped by its worst economic crisis in a decade that has seen inflation soar and citizens endure shortages of foreign exchange and fuel, and electricity cuts that last up to 18 hours.\n\nMupamawonde said the city had bought chemicals from local suppliers and pumping of water would resume after 4 p.m. (1400GMT). Residents would start receiving water on Tuesday just before midnight, he said.\n\n“We are taking this as a buffer period to work around what happens next,” he said at a media briefing, adding that some of the city’s chemical supplies were stuck at the border with South Africa in the south, awaiting payment and clearance.\n\nThe closure of the treatment plant had raised the prospect of an outbreak of water diseases like cholera, a year after Zimbabwe suffered its worst cholera outbreak in a decade, which killed at least 26 people mainly in Harare.\n\nMupamawonde said Harare would continue to face water shortages unless new dams that have been on the cards for more than two decades are built.\n\nThe city would drill more public boreholes and truck portable water to residents as short term solutions, he said.", "description": "Zimbabwe's capital Harare will temporarily resume pumping water at its main water works on Tuesday, an official said, bringing some relief to residents who have endured months without water.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190924&t=2&i=1433364353&w=1200&r=LYNXMPEF8N18W", "published_at": "2019-09-24"}