{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7575305/Anna-Heinrich-leads-arrivals-Curtis-Stones-Christmas-event.html", "downloaded_at": "2019-10-15 15:18:36.421602+00:00", "title": "Anna Heinrich leads arrivals at Curtis Stone's Christmas event", "language": "en", "text": "She's the criminal lawyer and former Bachelor star with an enviable physique.\n\nAnd Anna Heinrich looked sensational as she led the arrivals at Curtis Stone's Christmas launch event for Coles, in Sydney on Tuesday.\n\nThe 32-year-old offered a glimpse of her cleavage and trim pins in a khaki trench coat dress.\n\nServing looks! Anna Heinrich (pictured) showed off her sensational figure in a khaki trench coat dress, as she led the arrivals at Curtis Stone's Christmas event in Sydney on Tuesday\n\nAnna boosted her height with beige strappy heels and added touches of bling in the form of her sparkling wedding rings and hoop earrings.\n\nThe wife of Tim Robards styled her blonde locks into a half-up, half-down do, and opted for natural look makeup.\n\nAnna brought her mother Judy Heinrich along for the occasion, and the trio happily posed for photos at the event venue - Three Blue Ducks.\n\nDetails: The criminal lawyer boosted her height with beige strappy heels and added touches of bling in the form of her sparkling wedding rings and hoop earrings\n\nSwept up: Anna styled her blonde locks into a half-up, half-down do, and opted for natural look makeup\n\nCompany: Anna brought her mother Judy Heinrich (centre) along for the occasion, and the duo posed for a photo with Curtis Stone (left), 43\n\nCheers! The former Bachelor star shared a toast with her mother as they enjoyed a traditional Christmas dinner, prepared by Curtis\n\nChannel Seven's Kylie Gillies cut a chic figure in a green round-neck blouse tucked into a white skirt with thigh split.\n\nThe 52-year-old added green metallic heels, styled her cropped locks in a deep side part and enhanced her eyes with kohl liner.\n\nKylie posed for photos with Nova radio host Michael 'Wippa' Wipfli's wife Lisa, who covered her burgeoning baby bump in an abstract frock with oversize sleeves.\n\nMaking them green with envy: Channel Seven's Kylie Gillies, 52, cut a chic figure in a green round-neck blouse tucked into a white skirt with thigh split and metallic green heels\n\nBeauty: The TV host styled her cropped locks in a deep side part, and enhanced her eyes with kohl liner\n\nFriends: Kylie posed for photos with Nova radio host Michael 'Wippa' Wipfli's wife Lisa (right)\n\nKerri-Anne Kennerley made a statement in a red sheer frock with a floral print.\n\nThe 66-year-old carried her belongings in a Chanel red quilted handbag, added platform heels, styled her platinum locks semi-straight and appeared fresh-faced.\n\nFormer Minister for Foreign Affairs Julie Bishop looked elegant alongside partner David Panton.\n\nSheer-daring! Kerri-Anne Kennerley, 66, made a statement in a red frock with a floral print and keyhole detail at the bust\n\nVa va voom: The Studio 10 host carried her belongings in a quilted red Chanel handbag, and finished off the look with platform heels\n\nPower couple: Former Minister for Foreign Affairs Julie Bishop, 63, posed for photos with partner David Panton (both pictured)\n\nJulie, 63, highlighted her slim figure in a black knee-length frock with zipper detail, teamed with black stilettos and a Chanel clutch.\n\nDavid kept things smart casual in a crisp white dress shirt, light blue jeans, a navy suit jacket and coordinating sneakers.\n\nFormer Real Housewives of Melbourne star Chyka Keebaugh, 50, opted for a tan kimono style top, indigo flares and leopard print heels.\n\nGold bangles tied in nicely, and her beauty look consisted of wavy locks, defined brows, lashings of mascara and a nude lip.\n\nPicture-perfect: Julie looked chic in a black knee-length frock and stilettos, and the duo were later joined by Curtis (right)\n\nIn the wild: Former Real Housewives of Melbourne star Chyka Keebaugh, 50, wore a tan kimono style top, teamed with indigo flares and leopard print heels\n\nSnap-happy: The businesswoman beamed for the camera, while joined by Curtis\n\nOne for the mantelpiece: Chyka looked sensational as she posed in front of Coles signage\n\nRounding off the guest list was former Big Brother star Lisa Clark who showed off her lean legs in a mustard yellow top tucked into high-waisted shorts.\n\nThe 34-year-old added a matching beige jacket, boosted her height with nude heels, and slung a navy shoulder bag across her body.\n\nLisa's tresses fell in tousled waves and her makeup look was natural.\n\nGuests were treated to either a traditional or contemporary Christmas meal prepared by celebrity chef and Coles ambassador Curtis Stone.\n\nLeggy lady: Former Big Brother star Lisa Clark, 34, sported a mustard top tucked into high-waisted shorts and accessorised with a matching jacket and nude heels\n\nHair and makeup: The influencer styled her tresses in tousled waves and her makeup look was natural", "description": "She's the criminal lawyer and former Bachelor star with an enviable physique.", "authors": ["Kristy Johnson For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/14/19743330-0-image-a-137_1571147390824.jpg", "published_at": "2019-10-15"}