{"pub": "breitbart", "url": "https://breitbart.com/news/on-this-day-teddy-roosevelt-becomes-first-president-to-ride-in-plane-3", "downloaded_at": "2019-10-11 12:41:50.886001+00:00", "title": "On This Day: Teddy Roosevelt becomes first president to ride in plane", "language": "en", "text": "Oct. 11 (UPI) — On this date in history:\n\nIn 1811, the first steam-powered ferry in the world, the Juliana, started its run between New York City and Hoboken, N.J.\n\nIn 1868, Thomas Alva Edison filed papers for his first invention: an electrical vote recorder to rapidly tabulate floor votes in the U.S. Congress. Edison’s device was issued U.S. Patent 90,646 on June 1, 1869. Members of Congress rejected the apparatus and it was never utilized.\n\nIn 1906, the San Francisco Board of Education banned Japanese-American students from attending public schools, ordering that instead they were to be taught in racially segregated schools. A compromise was reached in February 1907, allowing the students back into the schools with the Japanese government accepting new immigration restrictions for its citizens wishing to travel to the United States.\n\nIn 1910, President Theodore Roosevelt became the first U.S. president to take flight in an airplane. Piloted by Arch Hoxsey, Roosevelt would stay aloft for 4 minutes in a Wright brothers-built plane at Kinloch Field in St. Louis, Mo.\n\nIn 1947, the United States agreed to the United Nations Partition Plan of Palestine, which recommended the creation of independent Arab and Jewish States with the city of Jerusalem placed under direct trusteeship of the United Nations. The resolution was adopted by the General Assembly on Nov. 29, 1947, though a civil war, which would last nearly six months, erupted the next day between Arabs and Jews, resulting in the partition plan failing to be implemented.\n\nIn 1950, the Federal Communications Commission gave CBS the first license to broadcast color television.\n\nIn 1975, Saturday Night Live premiered on NBC with George Carlin as host and musicians Janis Ian and Billy Preston on the bill.\n\nIn 1984, Kathryn Sullivan, flying into orbit aboard the space shuttle Challenger, became the first American woman to walk in space.\n\nIn 1986, President Ronald Reagan and Soviet leader Mikhail Gorbachev met in Reykjavik, Iceland, to discuss arms control and human rights. While the talks collapsed at the last minute, work would continue, resulting in the 1987 Intermediate-Range Nuclear Forces Treaty between the two nations.\n\nIn 2002, Congress gave U.S. President George W. Bush its backing for using military force against Iraq.\n\nIn 2008, the U.S. State Department removed North Korea from its list of state sponsors of terrorism. In return, North Korea agreed to give international inspectors access to its nuclear facilities and to continue disabling its plutonium processing project.\n\nIn 2013, the Organization for the Prohibition of Chemical Weapons won the Nobel Peace Prize. The United Nations-backed OPCW, which has headquarters in The Hague, Netherlands, was overseeing the destruction of Syria’s chemical weapons stockpile at the time it won the prize.\n\nIn 2018, an American astronaut and a Russian cosmonaut were forced to eject from an aborted launch to the International Space Station and make an emergency landing after a rocket failure.", "description": "Oct. 11 (UPI) — On this date in history: In 1811, the first steam-powered ferry in the world, the Juliana, started its run between New York City and", "authors": [], "top_image": "https://media.breitbart.com/media/2018/06/BB-logo-highres.jpg", "published_at": "2019-10-11"}