{"pub": "reuters", "url": "https://reuters.com/article/us-northkorea-southkorea/north-korea-rejects-offer-for-talks-over-tourism-site-south-korean-ministry-idUSKBN1X80UL", "downloaded_at": "2019-10-29 08:57:25.419027+00:00", "title": "North Korea rejects offer for talks over tourism site: South Korean ministry", "language": "en", "text": "FILE PHOTO: The sun rises at Mount Kumgang resort in North Korea, October 31, 2010. REUTERS/Kim Ho-Young/Korea Pool/File Photo\n\nSEOUL (Reuters) - North Korea has rejected a South Korean offer to hold talks about the future of joint tourism facilities that leader Kim Jong Un recently ordered dismantled, the South’s Unification Ministry said on Tuesday.\n\nKim said last week he wanted the “shabby” and “capitalist” facilities at Mt Kumgang resort removed and rebuilt, in the latest blow to South Korean hopes of reducing tensions between two nations still technically at war.\n\nOn Monday, the Unification Ministry, which handles relations with its northern neighbor, said it had proposed talks with North Korea on how to handle the facilities.\n\nHowever, North Korean officials rejected that idea and said they would only discuss the matter by exchanging documents, the ministry said in a statement on Tuesday.\n\nWhen South Korean tourists were allowed to visit to Mt Kumgang beginning in 1998, several South Korean firms including Hyundai Asan Corp and Ananti Inc, invested in the project.\n\nThe program was suspended in 2008 after a North Korean soldier shot dead a South Korean tourist who had wandered unknowingly into a military area.\n\n“The government will closely cooperate with business operators on the Mt Kumgang tourism issue and draw up countermeasures, on the principle that all issues of inter-Korean relations should be resolved through dialogue and consultation,” the ministry said in the statement.\n\nReopening the site to new South Korean tours has been touted by South Korean President Moon Jae-in as a way to improve relations between the two Koreas, whose 1950-53 war ended in an armistice rather than a peace treaty.\n\nInternational sanctions over North Korea’s nuclear weapons program block most overt investment or financial transactions with the country, however, and Pyongyang has shown increasing frustration with Seoul’s inability to move ahead with any kind of joint economic or tourism plans.", "description": "North Korea has rejected a South Korean offer to hold talks about the future of joint tourism facilities that leader Kim Jong Un recently ordered dismantled, the South's Unification Ministry said on Tuesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191029&t=2&i=1446119414&w=1200&r=LYNXMPEF9S0I9", "published_at": "2019-10-29"}