{"pub": "news24", "url": "https://news24.com/SouthAfrica/Life/dad-dies-in-explosion-on-daughters-wedding-day-in-apparent-suicide-20190917", "downloaded_at": "2019-10-07 06:54:45.959777+00:00", "title": "Dad dies in explosion on daughter’s wedding day in apparent suicide", "language": "en", "text": "A father of three allegedly blew up his own home in an apparent suicide on the day of his daughter’s wedding.\n\nJohn Evans (59), from Pennsylvania in the US, is believed to be responsible for the gas explosion that ripped through his home, Sun UK reports.\n\nPolice were immediately called to the scene after the terrifying blast shook several other homes in the street. Emergency crew later found John’s body in the wreckage and ruled his death a suicide.\n\nAccording to social media, one of John’s three daughters, Lauren, was getting married on the day and police said most of the family were at the wedding when the explosion happened, Metro UK reports.\n\n“This gentleman apparently had some personal issues and we’ve had information from neighbours that would indicate that there’s a great potential here that he would have blown the house up,” police chief Robert Payne told local media.\n\nHe added that police had previously been called to John’s home and knew of his mental health problems, PEOPLE reports.\n\nAccording to neighbours, the house collapsed within two minutes of the explosion.\n\n\"I was devastated. I’ve been here my whole life. I’ve known them my whole life,” neighbour Donna Antolovich told local media.\n\n\"Their daughter was getting married today and they were supposed to be at a wedding.\"\n\nOne of John’s daughters, Ashlee, posted on Facebook hours after the incident asking people to respect the family’s privacy.\n\nSources: Sun UK, Metro UK, PEOPLE", "description": "A father of three allegedly blew up his own home in an apparent suicide on the day of his daughter’s wedding.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9368/6fed31dcb9394438ba798ab9e23e3bb6.jpg", "published_at": "2019-09-17"}