{"pub": "dailymail", "url": "https://dailymail.co.uk/money/cars/article-7434959/VW-launched-electric-conversion-kit-classic-Beetle.html", "downloaded_at": "2019-10-05 07:14:32.079748+00:00", "title": "VW has launched an electric conversion kit for the classic Beetle", "language": "en", "text": "Just when you thought the Volkswagen Beetle had gone for good, it's made a comeback - and it's not like we've ever seen it before.\n\nProduction of the original Bug came to an end in July, when the final example rolled off the Puebla factory assembly line in Mexico.\n\nIt ended a chapter of production that began back in 1938, with a total of 21 million Beetles built throughout the car's history.\n\nHowever, it's taken Volkswagen just a month to prolong the life of its most iconic model, with the availability of a conversion kit that will transform the classic Beetle into a new-age electric car that you can charge at home.\n\ne-Beetle: Owners of Classic VW Bugs can now future-proof their pride and joy by fitting an electric conversion kit\n\nBeetle owners now have the chance to future-proof their vehicles by swapping out the internal-combustion engine and replacing it with a battery and electric motor.\n\nVolkswagen has teamed up with specialist firm eClassics based in Germany to provide the official conversion kit, though vehicles will need to be transported there for it to be installed.\n\nVolkswagen has teamed up with specialist firm eClassics based in Germany to provide the official conversion kit\n\nUK owners will need to arrange for their Beetle to be transported to Germany for the company to fit the zero-emission drivetrain\n\nThis Beetle Cabriolet has been fitted with the conversion kit and will feature and next week's Frankfurt Motor Show\n\nThe company will extract the Beetle's air-cooled flat-four-cylinder engine and replace it with the electric drivetrain from the existing e-up! city car, including the single-speed gearbox.\n\nThis does bulk-up the Beetle's weight somewhat.\n\nA conventional classic Bug tips the scales at around 800kg, while an electrified version measures in at closer to 1,300kg, which is around the same as a Ford Fiesta.\n\nThe company will extract the Beetle's air-cooled flat-four-cylinder engine and replace it with electric power\n\nThe battery pack, electric motor and single-speed gearbox is lifted from the current VW e-Up electric city car\n\nThe conversion does add some weight: A conventional classic Bug tips the scales at around 800kg, while an electrified version measures in at closer to 1,300kg\n\nThe increase in mass means the classic Bug will weigh around the same as a Ford Fiesta supermini\n\nBut despite the added mass it will be far sprightlier to drive that one with a petrol motor.\n\nThe 81bhp electric power source should make the Bug accelerate from a standstill to 50mph in eight seconds and onto a top speed of 93mph.\n\nThe claimed range between charges is 124 miles, and the conversion kit used allows for fast charging at available plug-in points.\n\nThe 81bhp electric power source should make the Bug accelerate from a standstill to 50mph\n\nThe conversion kit can use fast charging. An applicable plug-in point will replenish the battery to 75% capacity in an hour\n\nVolkswagen claims the all-electric car has a top speed of 93mph, though you won't want to drive it at those speeds for too long as the range will quickly disappear\n\nAs one This is Money reader points out, VW might have missed a trick calling it the e-Beetle...\n\nThis means the batteries can be boosted up to 75 per cent capacity in around an hour.\n\nThe removal of the rear-mounted petrol engine from the car also means the Beetle - for the first time ever - offers a usable amount of boot space.\n\nNo price has been revealed for the conversion, with details being withheld until this gorgeous Cabriolet conversion car is presented at the Frankfurt Motor Show next week.\n\nThe claimed range for the converted e-Beetle is 124 miles, says Volkswagen\n\nReplacement of the rear-mounted engine means the classic Beetle now gets a decent about of boot space\n\nNo price has been revealed for the conversion, with details being withheld until it appears in Frankfurt next week\n\nOwners will be able to charge the car from a public charge point or a socket at home\n\nIt has been reported that eClassics and VW will also work together on future electric takes on the legendary Camper and even the 365 sports car and could begin using parts from Volkswagen's upcoming I.D. range of electric vehicles, which promise much longer driving distances and shorter charge times.\n\nThis isn't the first time brands have offered to electrify their iconic models.\n\nJaguar will convert a Jaguar E-Type into an EV for the sum of £350,000. The launch car for the Jaguar Classic project was even used by Harry and Meghan to drive to their wedding reception last year.\n\nThe traditional dials in the cabin will be replaced with ones that show the remaining range available to drivers\n\nWould you want to convert a classic car into an electric vehicle for the future?\n\nIf you happen to have an old Jaguar E-Type laying around (because we all do, right?), you can give Jaguar Classic £350,000 and they'll convert it into an electric model", "description": "Beetle owners now have the chance to future-proof their vehicles by swapping out the internal-combustion engine and replacing it with a battery and electric motor from VW's current e-Up! model.", "authors": ["Rob Hull For Thisismoney.Co.Uk", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/09/06/11/18148262-0-image-a-5_1567766808026.jpg", "published_at": "2019-09-06"}