{"pub": "fox", "url": "https://foxnews.com/politics/trump-minneapolis-minnesota-rally-impeachment-push-security-costs-ilhan-omar", "downloaded_at": "2019-10-11 00:54:58.011053+00:00", "title": "Trump headlines Minneapolis rally amid Dems' impeachment push, tussle over security costs", "language": "en", "text": "President Trump was headlining a rally in Minneapolis on Thursday evening, even after his campaign threatened a lawsuit over the city's effort to recover $530,000 in security costs relating to the event.\n\nThe rally, Trump's first since the House moved toward impeachment over his handling of a July phone call with Ukraine's president, is in a state Trump nearly won in 2016 and has talked frequently of capturing in 2020. But it takes place in a traditionally liberal city and the home turf of a frequent foil, Democratic Rep. Ilhan Omar.\n\nLocal news reports indicated that scores of Trump supporters -- as well as pro-impeachment demonstrators -- lined up hours before the event at the Target Center in downtown Minneapolis began. At the rally, Trump said more than 20,000 people were inside the arena -- and more than 25,000 were outside, out of nearly 100,000 who indicated online that they wanted to attend.\n\nThe dispute over the rally's security costs erupted late Monday when the campaign accused Mayor Jacob Frey, a Trump critic, of trying to sink the rally. Frey called the costs reasonable and said he had a duty to protect taxpayers.\n\nThe campaign said the city sent the security cost estimate to Target Center's operator, AEG Management, which threatened to cancel its contract to host the rally if the costs weren't covered. Its law firm threatened to sue AEG if the rally doesn't proceed.\n\nTrump attacked Frey Tuesday on Twitter, writing: \"Someone please tell the Radical Left Mayor of Minneapolis that he can't price out Free Speech. Probably illegal!\"\n\nHis campaign said the \"bogus security charges\" are an attempt to prevent Minneapolis residents from supporting Trump, and contrasted them with what they said were much smaller charges for a 2009 event by then-President Barack Obama in the same building.\n\n\"The radical leftist mayor of Minneapolis, Jacob Frey, is abusing the power of his office and attempting to extort President Trump's re-election campaign,\" Trump's campaign said in a statement.\n\nLEGAL EXPERTS WEIGH IN AS WHITE HOUSE OBJECTS TO INQUIRY\n\nWhen the rally was announced last month, Frey said Trump's \"message of hatred\" would never be welcome in Minnesota. But, at a news conference Tuesday, he said the city will do all it can to guarantee a \"safe and peaceful week,\" regardless of his political differences with Trump.\n\nFrey stood by the security-cost estimate, saying a Trump political rally would bring \"significant expenses\" not associated with Obama's 2009 event, which was aimed at building support for health-care reform.\n\nLater Tuesday, the Trump campaign said in a statement that the operators of Target Center had backed off canceling the contract, with no agreement by the campaign to pay additional money.\n\nAEG didn't respond to messages seeking comment.\n\nTrump also attacked Frey over Twitter for a policy prohibiting city police officers from wearing their uniforms in support of candidates at political events or in campaign ads. A spokesman for the city's police union has complained about the policy, and the union has been selling \"Cops for Trump\" T-shirts.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nFrey said the police force must be nonpartisan and non-ideological.\n\n\"They're free to express their First Amendment rights but should do so off-duty,\" he said.\n\nFox News' Chad Pergram and The Associated Press contributed to this report.", "description": "President Trump was headlining a rally in Minneapolis on Thursday evening, even after his campaign threatened a lawsuit over the city's effort to recover $530,000 in security costs relating to the event.", "authors": ["Gregg Re", "Gregg Re Is A Lawyer", "Editor Based In Los Angeles. Follow Him On Twitter"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/09/17/694940094001_6086969321001_6086981458001-vs.jpg", "published_at": "2019-10-10"}