{"pub": "yahoo", "url": "https://finance.yahoo.com/news/iconic-amex-green-card-turns-110321503.html", "downloaded_at": "2019-10-26 00:07:25.251982+00:00", "title": "Correction: AmEx Green Card-50 Years story", "language": "en", "text": "In this Wednesday, Oct. 23, 2019, photo the original American Express \"Green Card,\" top, shown with the latest version of the card in New York. For 50 years the \"Green Card\" was everywhere and has been revamped, with a new look and more travel benefits. (AP Photo/Bebeto Matthews)\n\nNEW YORK (AP) — In a story Oct. 24 about American Express' new Green Card, The Associated Press misidentified credit card industry expert Matt Schulz's place of employment.\n\nSchultz works for Comparecards.com, not Creditcards.com.\n\nA corrected version of the story is below:\n\nIconic AmEx 'Green Card' turns 50, gets a needed revamp\n\nAmerican Express' 'Green Card' gets a major revamp as the iconic product turns 50 years old\n\nBy KEN SWEET\n\nAP Business Writer\n\nNEW YORK (AP) — For 50 years, the American Express \"Green Card\" has been the card many people wouldn't leave home without.\n\nLaunched in 1969, the Green Card gave travelers a sense of importance they didn't feel carrying travelers' cheques. For many people, it was their first AmEx card. Over time, however, the Green Card became neglected in favor of its fancier siblings, the Gold and Platinum Cards.\n\nNow, the Green Card is getting a much-needed revamp, with a new look and more travel benefits — and, yes, a higher annual fee.\n\nIn probably the most radical of changes, the card will no longer be a charge card, but function more like a traditional credit card with the ability to revolve a balance and pay over time. This is the final nail in the coffin for American Express' charge card model, which defined the company's image for decades.\n\nAnalysts say change was overdue. While American Express would not share details on how many Green Card customers there are, industry analysts say the card's popularity has been on the decline. Popular credit card review websites generally do not recommend the card in its current iteration, citing its annual fee and lack of benefits.\n\n\"The Green Card is iconic. Often, it was the first product that our card members had with us, and it carried a certain cachet. Now we want to bring it back in a modernized way,\" said Rachel Stocks, executive vice president of global premium products and benefits, in an interview.\n\nAmerican Express sees its typical card user as someone who is relatively well-to-do, likes to travel, dine out and see entertainment. But the expectation is a Green Card user would be doing these activities less frequently than a Platinum Card user. For example the Green Card will come with a new lounge benefit, but it will not provide the unlimited access to airport lounges that Platinum Card users enjoy.\n\nAmerican Express would never describe the new Green Card as its entry level credit card, but that's effectively what it became.\n\nThe Green Card wasn't the first credit card — that achievement belongs to Diners' Club. It wasn't even the first credit card AmEx issued — that distinction belongs to the \"Purple Card,\" a paper version which launched in 1958.\n\nThe Green Card was originally known as \"The Money Card\" — colored to resemble American dollar bills — but has been widely referred to simply \"The American Express Card.\" The Green Card was rolled out a year before the Boeing 747 went into service and international travel was becoming increasingly available to Americans. At the time, American Express' biggest business was travelers' cheques.\n\nThe card was a sold like a ticket to an exclusive club, a club full of traveling businessmen. Advertisements from its launch into the 1970s focused on how customers had to apply for the card, and not everyone would be accepted. It also had an annual fee — six dollars, or roughly $40 in today's dollars.\n\n\"Our card is a prestige instrument used primarily for travel and entertainment ... it is not a 'shoppers card',\" American Express CEO Howard Clark told shareholders in 1969.\n\nThe card, and it's marketing, was a hit. The American Express Card became a symbol for the global traveler and high-level executive. And the Green Card's design was adopted across all of American Express cards.\n\n\"Those who had the card felt like they were just a little more special,\" said Kit Yarrow, a professor of marketing and advertising at Golden Gate State University.\n\nWhile the Green Card may have the history, the Gold Card and the Platinum Card have received much more love from the company.\n\nThat's largely because American Express, which used to dominate the high-end-credit card market, has faced increased competition from rival banks and credit card companies. The company's Platinum Card now competes with JPMorgan Chase's Sapphire Reserve Card, as well as Citigroup's Prestige Card. AmEx has been upping the perks and rewards on the Platinum Card to keep customers, and has done the same for the Gold Card.\n\nStory continues", "description": "In a story Oct. 24 about American Express' new Green Card, The Associated Press misidentified credit card industry expert Matt Schulz's place of employment.  NEW YORK (AP) — For 50 years, the American Express \"Green Card\" has been the card many people wouldn't leave home without", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/nwiOJkAKFqFeGFs4DjXfDQ--~B/aD0zMzUyO3c9Mjk4MztzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/88741bd0b8a8fe49027e805595f8b74b", "published_at": "2019-10-25"}