{"pub": "wsj", "url": "https://wsj.com/articles/weighing-the-sentencing-of-parents-in-the-college-admissions-cheating-scheme-11568155291?mod=rsswn", "downloaded_at": "2019-09-10 23:31:10.057582+00:00", "title": "Weighing the Sentencing of Parents in the College-Admissions Cheating Scheme", "language": "en", "text": "BOSTON—A federal judge prolonged the suspense Tuesday over whether parents who have admitted to cheating to get their children into college will serve time in jail, deciding not to rule following a hearing on sentencing guidelines.\n\nIn a packed courtroom, U.S. District Judge Indira Talwani heard arguments in a legal debate that has pitted federal authorities against one another in the high-profile college admissions case.\n\nFederal probation officials have pegged sentencing guidelines for the parents at zero to six months—a range often resulting in probation—finding there was no direct financial loss to any victims. Prosecutors are arguing that some prison time is the way to send a strong message that admission spots at prestigious U.S. universities can’t be bought and have proposed ways of calculating loss.\n\nThe government is asking for one to 15 months of imprisonment for the 11 parents set to be sentenced in the coming weeks, including actress Felicity Huffman on Friday.\n\n“This was a massive nationwide fraud case fueled through bribery, fraud and corruption,” Assistant U.S. Attorney Eric Rosen told the judge.\n\nFrom WSJ Archives\n\n“Operation Varsity Blues,” announced in March and resulting in criminal charges against 51 people, enraged a public that suspects admission to top U.S. colleges are rigged in favor of the well-connected. Prosecutors suggest every teen admitted through fraud stole an opportunity from a deserving student.\n\nIn a sign of what’s at stake—prison time or none—defense lawyers for the 15 parents who have pleaded guilty and for the 19 who haven’t admitted guilt filled the gallery of Courtroom Nine, spilling into the empty jury box. Other lawyers dialed into a conference line, though none spoke during the hearing.\n\nA more lenient ruling by the judge could prompt more parents to plead guilty, defense lawyers said, while others might decide to try to clear their names at trial, figuring a light punishment is the worst outcome.\n\nJudge Talwani gave no clear sign of how she’ll rule, but she didn’t reschedule Ms. Huffman’s sentencing currently on the calendar for Friday, suggesting a decision could come soon. She asked a series of often technical questions and indicated that a public airing of the legal dispute was a good thing.\n\nTuesday’s hearing represented a public clash that has dogged the largest college-admissions scandal ever prosecuted by the Justice Department: Who are the financial victims, and how should the length of any prison terms be decided?\n\nDetermining appropriate punishments is complex. Sentencing in federal fraud cases are typically calculated based on direct financial impact, either as loss for the victim or gain for the perpetrator. In plea agreements, the government considered the amounts parents paid to admitted scheme mastermind William “Rick” Singer as a proxy for loss, while also taking into account factors such as how actively parents participated or involved their children.\n\nThat means prosecutors are recommending one month of incarceration for Ms. Huffman, a sentence at the low end of the zero-to-six-month range. The “Desperate Housewives” and “American Crime” actress has admitted to paying Mr. Singer $15,000 to fix her daughter’s SAT score.\n\nBut they are asking for substantially more prison time for some other parents, based on the amounts they admitted to shelling out to Mr. Singer.\n\nProsecutors say victims include the affected colleges, including the University of Southern California and Georgetown University, and standardized testing agencies. Colleges have been sued, have had to revamp policies and conduct costly internal investigations, they said.\n\n“All these events I talked about cost money,” Mr. Rosen said. “Money that came out of the victims’ pockets.”\n\nSHARE YOUR THOUGHTS What should the punishment, if any, be for parents who cheated to get their children into college? Join the conversation below.\n\nProbation officials, who prepare influential sentencing recommendations for the court, have so far found that the parents’ conduct caused no clear pecuniary harm, according to a recent memo filed by Mr. Rosen.\n\nIn a filing Monday, the lawyer for one parent who has pleaded guilty called the losses alleged by the government either nonexistent or speculative.\n\nWrite to Jennifer Levitz at jennifer.levitz@wsj.com", "description": "A federal judge prolonged the suspense Tuesday over whether parents who have admitted to cheating to get their children into college will serve time in jail, deciding not to rule following a hearing on sentencing guidelines.", "authors": ["Jennifer Levitz", "Jennifer.Levitz Wsj.Com"], "top_image": "https://images.wsj.net/im-105887/social", "published_at": "2019-09-10"}