{"pub": "dailymail", "url": "https://dailymail.co.uk/money/cardsloans/article-7474427/Credit-card-charges-rocket-time-high-24-7-savers-earn-ultra-low-returns.html", "downloaded_at": "2019-10-05 07:57:32.432003+00:00", "title": "Credit card charges rocket to an all-time high of 24.7%... But savers still earn ultra-low returns", "language": "en", "text": "Banks are charging record-high interest rates on credit cards — while still paying ultra-low returns to savers.\n\nShoppers now pay an average of 24.7 per cent on credit card purchases, the highest figure ever according to the research group Moneyfacts.\n\nIt means a customer who borrowed £1,000, and paid off £100 a month, would be charged £171 in interest overall.\n\nRecord charges: Shoppers now pay an average of 24.7 per cent on credit card purchases, the highest figure ever according to research group Moneyfacts\n\nAverage card rates have surged since the financial crisis struck, climbing from 16 per cent in 2006.\n\nBut at the same time, typical savings rates dropped sharply to all-time lows and barely recovered since.\n\nThe figures come as debt advice charity Stepchange warns of a record number of people seeking help for money problems.\n\nThe relentless hike to credit card charges has come despite the Bank of England slashing base interest rates from 4.75 per cent in 2006 to unprecedented lows.\n\nToday, the Bank rate is just 0.75 per cent. This fall would be expected to force lenders to cut the costs they charge customers, instead of putting card rates up.\n\nBut banks have been much quicker to pass on the pain of the low base rate to their savers.\n\nThe average interest on an easy access savings account has dropped from 3.22 per cent in 2006 to just 0.53 per cent today.\n\nThis would generate a return of just £5.31 a year on a £1,000 nest egg. Higher credit card interest rates may also suggest that the banks are concerned that more customers may struggle to pay back what they owe.\n\nLenders reported an increase in defaults by card borrowers in Bank of England surveys earlier this year.\n\nAnd yesterday, Stepchange said it was contacted by a record 331,337 people seeking help with their debts in the first half of 2019.\n\nmoneymail@dailymail.co.uk", "description": "Average card rates have surged since the financial crisis, climbing from 16 per cent in 2006. But at the same time, typical savings rates dropped sharply to all-time lows and barely recovered since.", "authors": ["James Burton For The Daily Mail", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/09/17/19/18590946-0-image-a-6_1568745536802.jpg", "published_at": "2019-09-17"}