{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/middle_east/fighting-continues-in-syrian-border-town-despite-turkish-agreement-to-halt-offensive/2019/10/18/3b2b03ca-f112-11e9-bb7e-d2026ee0c199_story.html", "downloaded_at": "2019-10-18 10:35:34.579718+00:00", "title": "Fighting continues in Syrian border town despite Turkish agreement to halt offensive", "language": "en", "text": "The Kurdish-led Syrian Democratic Forces “is committed to the cease-fire, but the [Turkish-backed] factions and the Turkish army are targeting SDF positions, especially Ras al-Ayn hospital,” a spokesman for the SDF said.\n\nOn Thursday, after hours of negotiations between Vice President Pence and Turkish President Recep Tayyip Erdogan in Ankara, Pence announced an agreement that appeared to provide Turkey with much of what it aimed for when it launched its offensive into Syria last week, including the withdrawal of Syrian Kurdish groups from territory stretching about 20 miles south of the Turkish border.\n\nAD\n\nAD\n\nThe White House also agreed to refrain from imposing new economic sanctions on Turkey, and to reverse sanctions that were imposed earlier this week, once “a permanent cease-fire was in effect,” Pence said.\n\nPence said Turkey had agreed to pause its offensive for five days while the United States helped facilitate the withdrawal of the SDF. After the completion of the Kurdish withdrawal, Turkey’s military operation, which began Oct. 9, would be “halted entirely,” Pence said.\n\nThe SDF, which partnered with the United States in the fight against the Islamic State, said the agreement was “just the beginning,” Mazloum Kobane Abdi, the group’s commander, said in an interview on Kurdish television.\n\nAD\n\n“We accepted this agreement, and will do whatever it takes to make it work,” he said, but stressed that “the Turkish occupation will not continue”.\n\nAD\n\nPresident Trump hailed the agreement as a victory for all parties involved. “I didn’t know it was going to work out this quickly, I didn’t know it was going to work out this well,” he told reporters Thursday in Texas. Others said the agreement had rewarded Turkey’s military offensive and contained no assurance that Erdogan’s government would withdraw from Syria.\n\n“The Turkish army has seized a great deal of territory in a very short period of time,” James M. Jeffrey, the State Department’s Syria envoy, told reporters on Thursday. “We had no doubt whatsoever that they would not continue seizing territory if we couldn’t get a cease-fire.”\n\nAD\n\n“There’s no doubt that the YPG wishes that they could stay in these areas,” he added, referring to the Syrian Kurdish militias.\n\n“It is our assessment that they had no military ability to hold onto these areas, and therefore, we thought the cease-fire would be much better.” He added that Washington would work with Ankara on addressing humanitarian needs in the zone.\n\nAD\n\nOn Friday, the National Army, a Turkish-backed umbrella group that united Syrian rebel factions ahead of the offensive, denied that there was any fighting or shelling in Ras al-Ayn, despite witness accounts to the contrary.\n\nA civilian near Ras al-Ayn said the bombardment had continued through the night and this morning. “There have been no airstrikes so far, but neither the bombardment nor the clashes have ceased,” Danial, whose name has been changed for security reasons, said in a phone interview. “We are among the few dozens of families that have stayed in the area; but we have our car ready and we may still leave, despite the cease-fire.”\n\nAD\n\nHe said the bulk of town had already emptied. “I don’t think they are going to come back.”\n\nHe added that Turkey’s goal is clear: to empty the area from its inhabitants and then replace them with refugees originally from other parts of Syria.\n\nAD\n\n“We cannot trust any deal that doesn’t make the so-called National Army leave the area. How are we supposed to live with those who conspired against us and stabbed us in the back?”\n\nKareem Fahim in Istanbul contributed to this article.\n\nAD", "description": "Witnesses report shelling and gunfire, though Trump has hailed U.S.-brokered cease-fire deal as a victory for all parties.", "authors": ["Sarah Dadouch", "Correspondent Covering The Middle East", "Asser Khattab"], "top_image": "https://www.washingtonpost.com/resizer/3R5-qlyg1JnvfpeGAmi_HxeA-tw=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/DGGTO4XRRQI6TBUT6SD6IZ4EVI.jpg", "published_at": "2019-10-18"}