{"pub": "indiatimes", "url": "https://indiatimes.com/technology/news/indian-origin-doctor-does-world-s-1st-brain-surgery-that-s-watched-live-on-facebook-by-millions-378874.html", "downloaded_at": "2019-10-30 09:56:45.659628+00:00", "title": "Indian-Origin Doctor Does World's 1st Brain Surgery That's Watched Live On Facebook By Millions", "language": "en", "text": "When it comes to breaking records on social media, you rarely think about watching an operation theatre with live brain surgery going on. But that's exactly what happened.\n\nDoctors in a Texas hospital livestreamed a brain surgery for the first time on social media platform Facebook.\n\nMethodist Dallas Medical Centre\n\nThe patient was 25-year-old Jenna Schardt who was facing neurological issues where she was losing her ability to speak. After doctors scanned her brain, they found that a mass of blood vessels was found in her brain that was causing this problem.\n\nThe procedure was conducted at Methodist Dallas medical centre in Texas. It went on for 45 minutes, and during the whole time, Jenna was awake, as is the case with many brain surgeries. This was done to test the brain function in the area surrounding the lesion they were trying to pull out, without harming crucial cognitive functions.\n\nEven a millimetre error could result in Jenna losing her speech abilities. She was being shown a screen by medical technicians that flashed numbers, colours and animals to keep control of the brain function.\n\nDon't Miss 33.1 K SHARES 3.4 K SHARES 1.3 K SHARES 769 SHARES 732 SHARES\n\nJenna spoke throughout the process, smiling and helping doctors assess the status of body functions.\n\nThe procedure was led by Chief of Neurosurgery, who was sharing his experience during the Facebook Live. He said in a statement, \"We struggled with the idea of doing a Facebook Live brain surgery, but because Jenna was so forthcoming and she wanted to show the rest of the community if you have this problem you can fix it, she was a role model for us and we supported her because of that,\"\n\nMethodist Dallas Medical Centre\n\nThe live video crossed over 45,000 views and over a thousand comments by the time it ended. The video never truly revealed the bloody side due to Facebook's policies, but instead showed Schardt's head surrounded by blue fabric with doctors operating behind it.\n\nThe doctors concluded the video stating that the procedure was 'close to perfection' as they were attaching the skull back. Schardt is currently recovering in the hospital and will be discharged in a few days.", "description": "Doctors in a Texas hospital live to stream a brain surgery for the first time on social media platform Facebook. The patient was 25-year-old Jenna Schardt who was facing neurological issues where she was losing her ability to speak. After doctors scanned her brain, they found that a mass of blood vessels was found in her brain that was causing this problem.", "authors": ["Monit Khanna"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/brain_surgery_1572424190_800x420.jpg", "published_at": "2019-10-30"}