{"pub": "news24", "url": "https://wheels24.co.za/NewModels/review-did-hondas-civic-bridge-the-gap-to-the-corolla-mazda3-20191029", "downloaded_at": "2019-10-29 14:08:51.448948+00:00", "title": "REVIEW | Did Honda's Civic bridge the gap to the Corolla, Mazda3?", "language": "en", "text": "While Toyota and Mazda launched all-new models of their Corolla and Mazda3, respectively, Honda stuck it out by only mildly updating its Civic.\n\nOn the one hand it brings the car closer to the aforementioned. But on the other hand, very little was done to counter the leaps taken over it.\n\nHonda’s Civic is a best-selling product in own right and has, since the 1970s, sold in access of 24 million units to date.\n\nSadly, the Civic’s heydays are effectively over and does the car, in South Africa at least, struggle to roll off showroom floors.\n\nWhile there is very little to suggest that the car’s exterior design is outdated, the interior is in a spot of bother. Overall, we like the Honda Civic, but at the moment it just can’t compete with its rivals.\n\nImage: Charlen Raymond\n\nInterior needs some work\n\nThe Honda’s interior is not an unfamiliar space and is it on par with Honda’s other offerings (CR-V, Jazz). The buttons on the steering wheel, the positioning of the electric window dials on the door, the comfortable seats, it all plays into the Civic’s hands; or favour - if you’re not keen on humanising a car.\n\nWhere the interior does fall short is with regards to its multimedia system. Though the system does get the job done, operating it is not as easy and intuitive as, say for instance, the Mazda3's. The dials and readouts are archaic and does it not have the modern touch its rivals boast with.\n\nThe car is equipped with heated leather seats, but it’s not enough to bring the car in line with its rivals. Especially given that you’re paying R416 700 for this 1.8 Elegance model.\n\nREAD: Corolla, F-Series, Civic - These are the 5 best-selling vehicles of all time!\n\nImage: Charlen Raymond\n\nNon-turbo engine\n\nThe Civic range is fitted with three petrol engines: a turbocharged 2.0-litre in the Civic Type R, a turbocharged 1.5-litre in the two higher-specified Civic sedans, and a naturally-aspirated 1.8-litre for the two bottom-end Civic sedans; including this Elegance model.\n\nThe engine is good for 104kW and 174Nm, and competes well against its rivals. Though not as punchy as the Corolla’s turbocharged 1.2-litre engine or as quiet as Mazda’s 1.5-litre, the Civic’s unit does have redeeming qualities about it. It pulls adequately, can haul the car around when it's loaded, and can do its bit when spirited driving is required.\n\nThe engine is mated with a seven-speed CVT (Continuously Variable Transmission) that’s, if we’re honest, not quite the best on the market. The transmission used in the Civic is eager to chase the redline should you mesh the throttle and it almost always feels as if the clutch is slipping when you pull away quickly.\n\nREAD: What has happened to Honda's fabled Type-R heritage series?\n\nImage: Charlen Raymond\n\nSummary\n\nHonda needs to step up its game if it wants its Civic to compete against rivals in the segment. A nip-and-tuck is not the answer when rivals are bringing in new models. Fair enough, this generation Civic was launched in August 2016 and after three years a little refresh was needed, but perhaps it was not the right move on Honda’s part.\n\nIn a few years’ time, when the new Civic will arrive, Toyota and Mazda will bring updates to their vehicles. The Civic will, for a fleeting moment, be on par with them before all-new models for said rivals are rolled out; leaving it lagging again. It’s a tough spot for Honda to be in, and it will always have a direct impact on the Civic's chances on success.\n\nSo much for being the fourth best-selling vehicle of all time...", "description": "Honda launched a refreshed version of its Civic sedan in South Africa this year, but is it enough to bring the car on par with its rivals? Charlen Raymond finds out.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9510/1315f9ed06da4a2397a9ac695eea74cc.jpg", "published_at": "2019-10-29"}