{"pub": "investing.com", "url": "https://investing.com/news/politics/clinton-email-probe-finds-no-deliberate-mishandling-of-classified-information-1999748", "downloaded_at": "2019-10-20 00:45:58.982944+00:00", "title": "Clinton email probe finds no deliberate mishandling of classified information", "language": "en", "text": "WASHINGTON (Reuters) - A U.S. State Department investigation of Hillary Clinton's use of a private email server while she was secretary of state has found no evidence of deliberate mishandling of classified information by department employees.\n\nThe investigation, the results of which were released on Friday by Republican U.S. Senator Chuck Grassley's office, centered on whether Clinton, who served as the top U.S. diplomat from 2009 to 2013, jeopardized classified information by using a private email server rather than a government one.\n\nClinton turned over roughly 33,000 emails from her private server in 2014, and the State Department probe found \"no persuasive evidence of systemic, deliberate mishandling of classified information.\"\n\nThe investigation did find that Clinton's use of a private server increased the risk of hacking.\n\nThe controversy figured prominently in the 2016 presidential election, which Democrat Clinton lost to Republican President Donald Trump, who suggested during the campaign that Clinton was trying to hide something by using a private network.\n\nThen-FBI Director James Comey announced five months before the November 2016 election that no charges would be filed against Clinton, but he found her actions \"extremely careless.\"\n\nThe FBI reopened the probe just days before the election after some of her emails were found on a laptop belonging to the husband of a close aide. Clinton has said the decision to reopen the probe badly damaged her campaign.\n\nThe State Department investigation found that 38 current or former employees were responsible for 91 separate violations of security protocols involving Clinton's server. Those 38 people were not identified. None of the emails at issue were marked as classified, according to the investigation.\n\nThe State Department found an additional 497 violations for which no individual was found responsible.\n\n\"While there were some instances of classified information being inappropriately introduced into an unclassified system in furtherance of expedience, by and large, the individuals interviewed were aware of security policies and did their best to implement them in their operations,\" the report said.", "description": "Clinton email probe finds no deliberate mishandling of classified information", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF9I009_L.jpg", "published_at": "2019-10-19"}