{"pub": "npr", "url": "https://npr.org/sections/altlatino/2019/07/24/744715957/alt-latino-playlist-songs-that-shout-protest", "downloaded_at": "2019-10-12 16:06:15.610488+00:00", "title": "Alt.Latino Playlist: Songs That Shout Protest", "language": "en", "text": "Alt.Latino Playlist: Songs That Shout Protest\n\nEnlarge this image toggle caption Courtesy of the Artist Courtesy of the Artist\n\nStream: Spotify, Apple Music.\n\nMusic can often be best way to stand up, shout down or even to cry out. That seems to be the theme of the tracks we selected on this week's playlist. Pick a song and be heard.\n\nGaby Moreno, \"Across the Borderline\"\n\nWith \"Across the Borderline,\" Gaby Moreno accomplishes two things: she resurfaces a little known classic written by Ry Cooder, John Hiatt and Jim Dickinson with a heartfelt bilingual performance; she also gives us another peek into Spangled, an upcoming album that names noted arranger Van Dyke Parks as co-author.\n\nWhere Cooder's 1982 original is laced with acoustic Tex Mex guitar, Parks has created an orchestral arrangement so eloquent that it acts as a lush countermelody to the stark pathos of the vocals of Moreno and guest Jackson Browne.\n\nAfter listening to this track and \"The Immigrants\" released earlier, it's very apparent that Moreno is taking another creative giant step toward making her one of the most intriguing artists singing in any language. — Felix Contreras\n\nYouTube\n\nLa Santa Cecilia, \"Winning\"\n\nSongs about social media have to surpass a high bar to avoid becoming the not-a-cell-phone-in-sight meme, but if there's anyone we can trust, it's La Santa Cecilia. Vocalist La Marisoul scrolls through the chaos, from \"maruchan con tapatío\" to \"kids in cages\" to \"#lapinchevanidad.\" La Santa Cecilia is the rare act that earns words like delightful. The very real drain of being Latino and Online IRL is here substituted with a rolling acoustic riff that turns to bubbly power-pop and little chiptune robot sounds and La Marisoul's infectious joy. Just people, living in the moment. — Stefanie Fernández\n\nAngelique Kidjo, \"La Vida Es Un Carnaval (Bomba Estereo Remix)\"\n\nWest African vocalist Angelique Kidjo delivered what will probably be my favorite album of 2019. In a conversation earlier this year with Alt.Latino, she imagines that Celia Cruz would have approved of her reimaginings of Cruz's most beloved songs. Then along comes Simón Mejía and Li Saumet — the creative forces behind Colombia's Bomba Estéreo — with a remix that makes \"La Vida Es Un Carnaval\" dance floor-friendly by adding a slight reggaeton bump to an Afrobeat take on an Afro Cuban anthem. As if that wasn't enough bad assery, the cumbia breakdown about half way through adds another layer of Africa by way of Colombia by way of Cuba and back to Africa.\n\nConfused? Just dance. — Felix Contreras\n\nYouTube\n\nAni Cordero, \"Pan Pan (feat. Émina)\"\n\nThe only thing you need to know about this track is from vocalist/composer Ani Cordero herself:\n\n\"Pan Pan\" was written out of frustration with corruption in Puerto Rico. Puerto Ricans have collectively had enough and will not back down until our voices are heard and respected. We know the history, we know the facts, and we won't go back. Borinquen has awoken and it's beautiful. ¡El pueblo es el que manda ahora!\"\n\nRead the news, learn about the injustice and play this track very loud. Then watch for Ani Cordero's new album in September. — Felix Contreras\n\nYouTube\n\nMariachi Los Camperos, \"El Pasajero\"\n\nMariachi Los Camperos has been the gold standard of the genre for over 60 years. After losing founder Nati Cano in 2014, the band has been on a mission to look to the genre's past to move it forward.\n\nHowever, the story told in \"El Pasajero (The Passerby)\" could be taken as a metaphor for the current moral dilemma on the border these days. At least that's how I'm going to take it.\n\nLook for the full album, De Ayer Para Siempre, on Aug. 23. — Felix Contreras\n\nYouTube\n\nDellafuente, \"Tenamoras (feat. Mala Rodríguez)\"\n\nSpanish rapper Dellafuente's slogan is \"música folklórico atemporal\" — \"timeless folk music.\" His older stuff ranges from straight-up flamenco to straight-up trap and several shades in between, but his best-known recent work with the likes of C. Tangana and Alizzz leaves him a little lost in it. \"Tenamoras,\" by contrast, conjures those words with a güiro-driven, guajiro-inspired rhythm, against a jazz horn sample and trap beat. Very summer goth. — Stefanie Fernández", "description": "Ani Cordero, Gaby Moreno and La Santa Cecilia take on societal ills through their music on this week's playlist.", "authors": ["Felix Contreras", "Stefanie Fernández"], "top_image": "https://media.npr.org/assets/img/2019/07/23/ani-cordero_wide-73e4d00fa672a91d3bf3d6b76aded34139dbdb50.jpg?s=1400", "published_at": "2019-07-24"}