{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/comedian-katherine-ryan-fights-terrifying-20659672", "downloaded_at": "2019-10-20 17:06:02.022640+00:00", "title": "Comedian Katherine Ryan fights off masked man who broke into her home at night", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest celebs stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nComedian Katherine Ryan has spoken of her terror when a masked assailant attempted to rob her home last night.\n\nShe said her boyfriend managed to fight off the masked man and fought him for Katherine's laptop.\n\nKatherine said the laptop contained the scripts for her Netflix series so she was relieved to have got it back - but pointed out it now had blood on it.\n\nOn her Instagram story last night, Katherine, who lives in the UK, posted a photo of police at her house.\n\nShe captioned it: \"Cool to be robbed tonight by a masked man in our home.\"\n\nShe then showed her followers the laptop, which her boyfriend Bobby managed to claw back from the robber.\n\n(Image: Instagram)\n\n\"This is why I love Bobby K because he got in a fight and wrestled back my Netflix series and scripts\", she said.\n\nAt 5:10am, Katherine revealed she still couldn't sleep after the attack.\n\nShe then posted a photo of her jokingly telling off her dogs, branding them \"the worst guard dogs ever\".\n\n(Image: Instagram)\n\nThe small terriers dogs ran around her house and she tells one sleepy pup he was \"asleep at the wheel\".\n\nShe then added that she was going to get a German Shepherd so it could ward off burglars in future.\n\nOn Twitter , Katherine posted a photo of the ring the alleged burglar stole before he was \"tackled into the street\", asking if it could be circulated around pawn shops.\n\n(Image: Instagram)\n\n(Image: Instagram)\n\nKatherine also sarcastically thanked her followers for their support in this tough time, referring to sexually explicit messages she was receiving in her DMs.\n\nShe also took the opportunity to call for more police funding.\n\nIn a now-deleted Instagram story, Katherine reportedly revealed the police put her on hold when she called them even though the attacker was still in her home.\n\n(Image: Twitter)\n\nOne of her followers tweeted: \"Slightly worrying to hear not only that @Kathbum was robbed in her own home, but that the police put her on hold for several minutes while the masked attacker was still on their property...\"\n\nKatherine replied: \"They need more money AND NOW.\"\n\n", "description": "The star revealed she now plans to get a guard dog", "authors": ["Verity Sulway", "Image", "Instagram", "Twitter"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20659763.ece/ALTERNATES/s1200/1_Katherine-Ryan.jpg", "published_at": "2019-10-20"}