{"pub": "foxbusiness", "url": "https://foxbusiness.com/features/hurricane-dorian-continues-north-nova-scotia-winds-crane", "downloaded_at": "2019-09-08 23:26:35.509760+00:00", "title": "Hurricane Dorian continues north through Nova Scotia, winds take down huge crane", "language": "en", "text": "The video gives a small window into the devastating power behind Hurricane Dorian.\n\nContinue Reading Below\n\nTaken on a cellphone, damaging winds from the hurricane take down a massive crane, bringing it crashing down into a building late Saturday afternoon.\n\nThe glimpse of the storm’s power shows a small piece of the storm’s wrath, which left at least 43 people dead in the northwestern Bahamas.\n\nOne week after the storm churned over the islands, people are beginning to sift through their lives, torn apart by the most powerful hurricane to ever hit the region in recorded history.\n\nBy Sunday, the U.S. Coast Guard reported they rescued more than 290 people from the area, the United Nations delivering nearly 15,000 meals to people who need something to eat.\n\nAdvertisement\n\nIt’s only the beginning for many people living on the islands as they start to rebuild a new life.\n\nJackson Blatch, a builder in Marsh Harbour’s Murphy Town neighborhood, is one of many planning to stay.\n\nImage 1 of 5 ▼ Jackson Blatch starts repairs on the roof of his home in Marsh Harbor, Abaco Island, Bahamas, Saturday, Sept. 7, 2019 after Hurricane Dorian hit. (AP Photo/Fernando Llano)\n\n“My plan is to rebuild this island,” he explained.\n\n“I have a lot to offer.”\n\nBlatch, with the help of his son-in-law, believes his work building homes helped keep his from turning to rubble. He reinforced his home with rebar, creating a skeleton that kept his standing.\n\nOthers planning to stay are surviving on donations, hunkering down with other relatives as they assess the damage and decide how they’ll tackle life after Dorian.\n\nInformation from The Associated Press contributed to this report.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS", "description": "Cellphone video shows the wrath of Hurricane Dorian slamming the region with 80 mph winds.", "authors": [], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/AP19250650537012-1.jpg?ve=1&tl=1", "published_at": "2019-09-08"}