{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/15/letters-to-the-editor-unions-not-above-the-law", "downloaded_at": "2019-10-15 23:08:45.620652+00:00", "title": "Unions not above the law", "language": "en", "text": "ANALYSIS/OPINION:\n\nCollusion between government and public-sector unions is nowhere more prevalent than in Washington state. Union leaders use the almost limitless supply of dues dollars at their disposal to fund the campaigns of political candidates — including Supreme Court justices — whom they’re confident will return the favor by representing labor’s interests rather than the interests of the voters.\n\nOccasionally, though, even in a liberal enclave like Washington, the unions get an unpleasant surprise.\n\nIn 2015, the Freedom Foundation, a right-leaning think tank based in Olympia, Washington, made a records request to the University of Washington seeking email communications between faculty and union organizers.\n\nThe university recognized tht the documents in question were a matter of public record and promised to honor the request, but campus officials first contacted the Service Employees International Union (SEIU) and provided an opportunity for the union to prevent disclosure despite believing the records were disclosable.\n\nSEIU responded by filing a lawsuit against both the Freedom Foundation and the university that dragged on in court for four years before finally reaching the Washington State Supreme Court earlier this year. In a ruling that clearly must have shocked SEIU officials confident they were playing with house money, the justices ruled 9-0 that the information must be disclosed.\n\nThe decision in SEIU 925 v. University of Washington, et al. was not only a shot across the bow of unions who believed they’re above the public-disclosure laws that impose transparency and accountability on most other governmental activities, but also a stinging rebuke to the lower courts, whose allegiance to the unions rather than the law was exposed for all to see.\n\nAARON WITHE\n\nNational director, Freedom Foundation\n\nSalem, Ore.\n\nSign up for Daily Opinion Newsletter Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Collusion between government and public-sector unions is nowhere more prevalent than in Washington state. Union leaders use the almost limitless supply of dues dollars at their disposal to fund the campaigns of political candidates — including Supreme Court justices — whom they're confident will return the favor by representing labor's interests rather than the interests of the voters.", "authors": ["The Washington Times Http", "The Washington Times"], "top_image": "", "published_at": "2019-10-15"}