{"pub": "businessinsider", "url": "https://businessinsider.com/airbus-history-boeing-rivalry-2018-4", "downloaded_at": "2019-09-22 00:29:15.735800+00:00", "title": "How Airbus became Boeing's greatest rival", "language": "en", "text": "The Airbus A380 superjumbo. Airbus\n\nAirbus versus Boeing is one of the great rivalries in business today. Like Coca-Cola versus Pepsi, Ford versus GM, McDonald's versus Burger King.\n\nThese days, if you fly, it'll probably be either an Airbus or a Boeing (unless you're on a much smaller regional jet from companies like Embraer or Bombardier).\n\nYou might assume that it was always this way, but that's actually not the case.\n\nJust a few short decades ago, the world of commercial aviation was filled with big names like McDonnell Douglas, BAe, Saab, Lockheed, Fokker, and even Convair, alongside the legacy Boeing.\n\nNow, it's pretty much just the two rivals, locked in battle.\n\nDespite Airbus' prominence, Boeing is a much older and more established company. Founded in 1916, the Boeing Company is now an aerospace and defense juggernaut that is America's largest industrial exporter.\n\nThe company we know today as Airbus can trace its history back to an agreement signed in July 1967 by the French, German, and British governments to strengthen their cooperation in the field of aviation technology.\n\nSee also: Apply here to attend IGNITION: Transportation, an event focused on the future of transportation, in San Francisco on October 22.\n\nIncluded in the agreement is a clause that called for the governments to \"to take appropriate measures for the joint development and production of an airbus.\"\n\nIt was a decision made out of necessity, Richard Aboulafia, an aviation industry analyst for the consulting company Teal Group, told Business Insider.\n\nAt the time, American firms like Boeing, McDonnell Douglas, and Lockheed were growing in strength and influence around the world. European manufacturers, once commercial aviation's leaders in innovation, were feeling the pinch.\n\nTogether they formed a consortium called Airbus to counter the might of America's aviation giants.\n\nThe consortium would be based at the headquarters of Sud Aviation in Toulouse, France where it remains today.\n\nHere's a closer look at how Airbus became Boeing's greatest rival.\n\nThis story was originally published by Benjamin Zhang in April 2018. It was updated by David Slotnick on September 21, 2019.", "description": "The rivalry between Airbus and Boeing started more than 40 years ago, when Airbus launched its very first plane: the A300.", "authors": ["David Slotnick"], "top_image": "https://amp.businessinsider.com/images/570d1e84910584155c8bbf6c-1920-960.jpg", "published_at": "2019-09-21"}