{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-soccer-bulgaria-dermendzhiev/bulgaria-to-name-dermendzhiev-as-new-coach-idUKKBN1X00YZ", "downloaded_at": "2019-10-21 11:31:18.495124+00:00", "title": "Bulgaria to name Dermendzhiev as new coach", "language": "en", "text": "FILE PHOTO: Britain Football Soccer - Arsenal v PFC Ludogorets Razgrad - UEFA Champions League Group Stage - Group A - Emirates Stadium, London, England - 19/10/16 PFC Ludogorets Razgrad coach Georgi Dermendzhiev before the game Action Images via Reuters / Andrew Couldridge Livepic\n\nSOFIA (Reuters) - Former Ludogorets and Levski Sofia boss Georgi Dermendzhiev is set to be appointed as the new head coach of Bulgaria, the vice-president of the Bulgarian Football Union (BFU) said on Monday.\n\nThe 64-year-old Dermendzhiev will replace Krasimir Balakov, who resigned a few days after a 6-0 defeat by England last Monday when some supporters taunted the visitors with Nazi salutes and monkey chants, prompting match officials to halt the game twice. [L3N2733MF]\n\n“Georgi Dermendzhiev is the new head coach of Bulgaria,” BFU vice-president Yordan Letchkov said, adding that Dermendzhiev would sign his contract on Tuesday.\n\nDermendzhiev led Ludogorets to three consecutive Bulgarian league titles between 2015 and 2017. His side became the first Bulgarian team to register a Champions League group stage victory when they beat Switzerland’s Basel in 2014.\n\nWinless Bulgaria are bottom of Group A in the Euro 2020 qualifying stage with three points from seven matches. They host the Czech Republic in their final group match next month.", "description": "Former Ludogorets and Levski Sofia boss Georgi Dermendzhiev is set to be appointed as the new head coach of Bulgaria, the vice-president of the Bulgarian Football Union (BFU) said on Monday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191021&t=2&i=1443301392&w=1200&r=LYNXMPEF9K0M1", "published_at": "2019-10-21"}