{"pub": "businessinsider", "url": "https://businessinsider.com/ford-aircraft-carrier-sails-after-challenging-15-months-of-maintenance-2019-10", "downloaded_at": "2019-10-26 00:09:31.556806+00:00", "title": "The USS Gerald R. Ford is setting sail after a 'challenging' 15 months in the shipyard — here's what's next for this $13 billion aircraft carrier", "language": "en", "text": "The USS Gerald R. Ford has concluded its post-shakedown availability, a 15-month extended maintenance availability at Huntington Ingalls Industries-Newport News Shipbuilding in Norfolk, Virginia.\n\nSailors and shipbuilders readied the propulsion system, advanced arresting gear, and other important systems and fixed over 1,300 discrepancies identified during earlier sea trials.\n\nThe one big problem that remains is the weapons elevators, which the Navy will continue to work on during post-delivery tests and trials over the next 18 months.\n\nThe $13 billion aircraft carrier set sail Friday for sea trials off the Virginia coast in the Atlantic Ocean, where the Navy and shipbuilding engineers will work to determine whether the maintenance carried out during the PSA is satisfactory.\n\nClick here for more BI Prime stories.\n\nThe USS Gerald R Ford is finally setting sail, departing Huntington Ingalls Industries-Newport News Shipbuilding (HII-NNS) in Norfolk, Virginia, after a 15-month extended maintenance availability to get the ship ready for another round of testing and sea trials.\n\nThe Ford (CVN-78) set sail just after 10 a.m. Friday.\n\nThe aircraft carrier's return to sea follows a five-day pierside fast cruise, a training evolution to, according to the Navy, \"bring Ford to life\" and get sailors in the \"right mindset\" before the ship actually gets underway.\n\n\"After a challenging post-shakedown availability at Newport News Shipbuilding, the crew is excited to turn their hardhats in and get Warship 78 back out to sea,\" Capt. J.J. Cummings, the Ford's commanding officer, said in a Navy statement Friday.\n\nA 'challenging' maintenance period\n\nUSS Gerald R Ford. US Navy photo by Mass Communication Specialist 3rd Class Julio Martinez Martinez\n\nThe Ford, an elite first-in-class ship expected to eventually offer the Navy advanced carrier warfighting capabilities, has concluded its post-shakedown availability (PSA), a maintenance availability following preliminary trials to work out problems identified at sea.\n\nThe ship was supposed to return to the fleet in July, but the PSA was extended due to additional maintenance demands, specifically continued problems with the propulsion system, arresting gear, and elevators.\n\nDuring the Ford's PSA, sailors and industry shipbuilders installed combat systems, modified and upgraded the propulsion plant, improved the throttle control system, removed, upgraded, and reinstalled Advanced Arresting Gear components, outfitted galley spaces, and completed 304 berthing spaces.\n\nThe long pole in the tent\n\nUSS Gerald R Ford. U.S. Navy photo by Mass Communication Specialist 2nd Class Ryan Seelbach\n\nWhile the Navy was able to fix the Ford's propulsion system and ready its aircraft recovery systems, the one serious problem the Navy is still working with shipbuilder Huntington Ingalls Industries to resolve is the integration of the electromagnetic Advanced Weapons Elevators.\n\nFour of the eleven elevators have been certified and turned over to the crew. The ones that are operational are a handful of upper-stage elevators and a utility elevator.\n\nThe long pole in the tent, as they have previously been described by Navy officials, remains the lower-stage elevators built to rapidly move ordnance from the internal magazine complexes to the flight deck, a critical capability that directly affects the aircraft sortie rate and the overall lethality of the ship.\n\nWhile all of the elevators were expected to be ready by the end of the PSA, the task has proven to be a far greater challenge than previously anticipated.\n\nOpenly expressing his frustration with this problematic aspect of the Ford's development, Secretary of the Navy Richard Spencer sharply criticized HII Wednesday, accusing the shipbuilder of having \"no idea\" what it is doing with respect to this project.\n\nThe Navy dispatched the Linked and Integrated Fix Team (LIFT), a team of government and industry experts, to the shipyard three months ago to look for answers to the elevator problems.\n\nThe service will continue to work on the Advanced Weapons Elevators over the next 18 months during post-delivery tests and trials off the Virginia coast in the Atlantic Ocean.\n\nA way forward is still in the works\n\nUSS Gerald R Ford. US Department of Defense\n\nDuring the coming sea trials, the Navy will carefully evaluate the work performed during the PSA.\n\nThe Ford's crew and industry shipbuilding engineers will work together to validate systems that were repaired, maintained, or modified during the recent maintenance availability. They will also certify the carrier's fuel systems, conduct relevant aircraft compatibility testing, certify the flight deck, and test the onboard combat systems.\n\nFollowing post-delivery test and trials, CVN-78 will go through full ship shock trials, a planned incremental availability, and deployment workups. The schedule for post-PSA development phases are currently under review.\n\nConstruction of the Ford began in 2005, and the keel was laid down four years later. The ship was launched in late 2013 with an expected initial delivery date of 2015, a date that was pushed back to 2017. At that time, it began sea trials that would inform decisions made during its recent PSA.\n\nThe ship is currently over budget with a total cost of more than $13 billion, making it the most expensive warship ever built. It is also behind schedule, as deployment with full operational capability is expected to be several years late.\n\nThe Navy is, however, taking the lessons learned during the development of the Ford and applying it to future ships in this class.", "description": "The first-in-class ship has wrapped up its post-shakedown availability and is headed into the Atlantic Ocean for another round of tests and trials.", "authors": ["Ryan Pickrell"], "top_image": "https://image.businessinsider.com/5db2eaf1dee01975cb53c6a2?width=1200&format=jpeg", "published_at": "2019-10-25"}