{"pub": "abcnews", "url": "https://abcnews.go.com/US/investigators-slender-man-case-discuss-chilling-interviews-12/story?id=66320806", "downloaded_at": "2019-10-23 15:09:16.055933+00:00", "title": "Investigators in 'Slender Man' case discuss chilling interviews with 12-year-old attempted murderers", "language": "en", "text": "It was a sunny day in Waukesha, Wisconsin, on Saturday, May 31, 2014, and Detectives Michelle Trussoni and Tom Casey were looking forward to a quiet work day.\n\nBut then, just before 10 a.m., a shocking call came over the radio: A passerby had found a 12-year-old girl stabbed and lying on the side of the road.\n\nThat girl was Payton Leutner, who had been stabbed 19 times by her best friends, who were also 12 years old at the time, in the name of a fictional internet character named \"Slender Man.\" For years, questions about the case captivated the country. Should her attempted murderers be held accountable as adults? How did two 12-year-old girls become this dangerous?”\n\nWatch the full story on \"20/20\" Friday, Oct. 25 at 9 p.m. ET on ABC.\n\nWaukesha Police Department\n\nThe investigators who questioned the young attempted murderers spoke for the first time with \"20/20\" about the three vicious plots to kill Leutner and revealed how Slender Man became the object of the girls' obsession and their motivation to kill their friend.\n\nOfficer Dan Klein was the first to respond to the call after a bicyclist had found sixth-grader Payton Leutner lying in the grass at the end of a dead end road.\n\n\"[She] wasn't moving a whole lot. As I approached her I said, 'Hi, I'm Officer Dan. Are you OK?' She said, 'No,'\" Klein said. \"As I got closer, I started to see a little bit more blood, and the closer I got, the more blood I saw.\"\n\nLeutner told Klein it was her best friend Morgan Geyser who attacked her in the woods.\n\nTrussoni said that when Leutner was brought into the emergency room, \"she looked like she was in an extreme amount of pain.\"\n\n\"The look on her face is something that I will never forget,\" Trussoni said.\n\nTrussoni immediately sprang into action to collect information from Leutner in case she died from her injuries. She discovered from Leutner \"that there was another girl there at the time that this happened.\"\n\nCasey went to Geyser's home and spoke to her mother Angie Geyser. He discovered that the two girls had a sleepover the night before with a third friend, Anissa Weier. Neither Weier nor Morgan Geyser were at the home. Police fanned out across Waukesha in an extensive search looking for the two missing 12-year-olds.\n\nCourtesy of the Geyser Family\n\n\"I thought that they were in grave danger and that we may find these girls dead,\" Casey said.\n\nJust before 3 p.m., Morgan Geyser and Anissa Weier were found sitting on the side of the I-94 freeway. They had walked for about five hours, Trussoni said.\n\n\"They were kind of dirty, covered in some stains,\" Trussoni said. \"Their demeanor was very calm. They seemed kind of meek, if you will.\"\n\n\"When they brought the girls back, Payton was actually still in surgery and we did not know if she was going to make it at this point,\" Casey said. \"We didn't know if this was going to be a homicide investigation or what this was going to turn out to be.\"\n\n12-year-olds interrogated by police point to scary story they read about 'Slender Man'\n\nPolice spoke to the two girls in separate rooms for hours. Casey said he remembers Morgan Geyser being \"very calm.\"\n\n\"I mean, she's at a police department and she's covered in blood and…[it's as if] this is like a normal day for her,\" Casey said.\n\n\"I have never gone into an interview so blind as I have in this one,\" Trussoni added. \"I thought that maybe this was all about a boy -- this was a fight about a boy.\"\n\nCourtesy of the Leutner Family\n\nMorgan Geyser asked police what happened to \"Bella,\" the girls' nickname for Leutner. \"Is she dead? … I was just wondering,\" she said.\n\nCasey mentioned that it didn't really seem to concern Morgan Geyser if Leutner was dead or alive.\n\n\"I might as well just say it. We were trying to kill her,\" Geyser said. She explained that they attempted the murder to appease \"whoever Anissa was talking about. She made it seem necessary… This is going to get me arrested, isn't it?\"\n\nMorgan Geyser admitted that she didn't really think about what would happen after stabbing Leutner.\n\n\"I figured that I'd get into trouble eventually, though, because mommy always says that whatever you do catches up to you eventually, and it did,\" Morgan Geyser said.\n\nABC\n\n\"Anissa told me we had to,\" Morgan Geyser insisted in her interview. \"Because she said that he'd kill our families… A man. I didn't know him. But Anissa knew him.\"\n\nWeier explained to the police that she learned about the frightening Slender Man figure on a website that collects horror stories called Creepypasta Wiki.\n\n\"There was one of them called Slender Man… He can be anywhere from 6 feet to 14 feet tall,\" Weier said. \"He's, like I said, a tall guy who constantly wears a suit. He doesn't have a face. His skin is white.\"\n\nWeier said that Slender Man strangles his victims with tendrils protruding from his back and that he targets children \"the most,\" according to what she learned on the website.\n\n\"I actually thought that he was real. Because I saw him,\" Weier said. \"We were like, talking on the bus. I look out the window and I see this...thing standing like this, with tendrils — looks exactly like a tree. There and gone like that.\"\n\n\"I was really scared, knowing that Slender [Man] could easily kill my whole family in three seconds,\" Weier added.\n\nTrussoni said the girls aimed to show Slender Man they were worthy by killing someone.\n\nWeier told police that it was Morgan Geyser who said, \"We have to kill Bella,\" and that it was also Morgan Geyser who \"found out that Slender [Man] has this big mansion in the middle of Nicolet National Park.\"\n\nThe girls told police their plan was to walk to the mansion to be with Slender Man.\n\n\"From where Waukesha is, the Nicolet National Forrest would be approximately [a] four to four-and-a-half hour drive,\" Trussoni said.\n\n\"My thought was, 'Is she doing this for Morgan?'\" Trussoni said of Weier. \"I think Anissa latched onto it because she sees what Morgan is liking and let me go into it full steam ahead.\"\n\nMeanwhile, Morgan Geyser implied that Weier was the one who took the lead in planning the attack.\n\n\"I didn't really understand what we were doing but I really didn't wanna make Anissa mad,\" Morgan Geyser said. \"It's hard enough to make friends. I don't wanna lose someone over something like this.\"\n\n\"It wasn't until we started talking with the girls that we really knew it was two 12-year-old girls that have planned for six months to kill their friend,\" Casey said.\n\nABC\n\n3 plans to murder Payton Leutner\n\n\"You have no idea how difficult it was not to tell anyone,\" Morgan Geyser told police of their murder plot. \"We would all be together. It was a flawless plan, actually.\"\n\nWeier said she and Morgan Geyser talked about their plan to murder Leutner in public sometimes, \"but we made sure we whispered.\"\n\n\"We used code words. Like, for 'knife,' we used 'cracker,'\" Weier said. \"For the killing, we would use words like, 'itch.'\"\n\nThe girls revealed to police that there were three different plans to kill Leutner and that the plan evolved over the course of the sleepover at Morgan Geyser's house.\n\nFirst, Weier said that Morgan Geyser suggested they duct tape Leutner's mouth shut in the middle of the night while she was sleeping so that they could stab her in the neck.\n\nWeier said that their plan changed because they \"were too sleepy and tired\" from going to a local roller skating rink.\n\n\"The morning comes and they wake up and they get up, start playing with Silly Putty and playing with their iPad and playing dress up,\" Trussoni said. \"While Payton is putting on a pink dress — a princess dress — the two start talking and they start devising plan number two.\"\n\nWeier said that while Leutner was dressing up, Morgan Geyser suggested killing her in a bathroom stall at the park, where there was a drain for the blood.\n\nWeier added that Morgan Geyser took a knife from her kitchen. Morgan Geyser claimed it was Weier who took the knife and carried it with her in a bag.\n\n\"There was a lot of deception in Morgan's interview,\" Casey said. \"It seems like Anissa is saying this is what happened but when you listen to Morgan, she always says, 'Well I think that Anissa did it. I think this happened.'\"\n\nAfter asking Morgan Geyser's mother if they could go to the park, all three girls left the house.\n\nABC\n\nThe girls were in the bathroom stall at the park when they decided to try to knock out Leutner before they killed her.\n\n\"From what I read on the computer, it's easier to kill people when they're either asleep or unconscious, and it's also easier if you do not look them in the eyes,\" Weier said. \"I kind of...banged her head up against the concrete.\"\n\nBut the girls lost their nerve to carry out their second plan and left the bathroom. Weier said she was the one who suggested taking Leutner into the nearby woods to kill her.\n\n\"We led her there and tricked her… We said that we were going to go bird watching,\" Morgan Geyser said. \"People who trust you become very gullible, and it was sort of sad.\"\n\nDetective Shelly Fisher said that as they approached the woods, they suggested playing a game of hide-and-seek. Geyser counted and Leutner and Weier hid.\n\n\"She was going to hide one place [and] I was going to hide another. And then Morgan and I were going to be, like, lionesses chasing down a zebra. I was going to tackle her and then Morgan was going to do the stabbing,\" Weier said.\n\n\"So I started walking away, and then, like, when I was 5 feet away, I said, 'Now,'\" Weier said. \"I'm, like…'go ballistic, go crazy, make sure she's down.'\"\n\n\"What did you do next?\" Casey asked Morgan Geyser.\n\n\"I already told you… Stab, stab, stab, stab, stab,\" Morgan Geyser responded. \"It was weird. I felt no remorse. I thought I would… I actually felt nothing.\"\n\n\"It's almost as if they are writing their own story. They're living their own Creepypasta story,\" Trussoni said. \"I mean, you don't often see this with adults, and to have this happen between 12-year-olds is absolutely horrifying.\"\n\nDuring the interrogation, Weier asked police where Leutner's body was, and police revealed she was alive at the hospital.\n\n\"I know she'll never trust me again and that she hates my guts,\" Weier said. Trussoni said that she didn't \"realize the enormity of this.\"\n\nA week after the attack, Fisher went to the hospital to interview Leutner.\n\nABC\n\n\"I asked Payton how [the attack] stopped and she simply said that Morgan just stopped and stared at her. That both her and Anissa for a while just stared at her with this blank stare.\"\n\n\"The last thing she said to me was, 'I trusted you,'\" Morgan Geyser said. \"Then she said that 'I hate you,' and then we lied to her. Anissa said that she'd go get help.\"\n\nPayton Leutner\n\nMorgan Geyser stabbed Leutner 19 times. Weier said she told Leutner to \"lay down and be quiet. You'll lose blood slower.\"\n\n\"She tried to get up. She said that she couldn't see, she couldn't walk and that she couldn't breathe,\" Weier said.\n\n\"They told her they were going to go get her help but Anissa flat-out said, 'No, we weren't getting her help. We wanted her to die,'\" Trussoni said.\n\nAs 12-year-old girls are held accountable for attempted murder, more evidence emerges\n\n\"We were permitted to come to the police station and see Anissa,\" Kristi Weier, Anissa Weier's mom, said. \"I remember her saying, she was 'very, very scared.' That day plays out almost every night in my nightmares.\"\n\nThe girls were charged as adults with attempted first-degree intentional homicide and taken to the West Bend Juvenile Facility.\n\nMichael Sears/Milwaukee Journal-Sentinel via AP, FILE\n\nInvestigators uncovered notebooks with writings and drawings related to Slender Man in Morgan Geyser's locker.\n\nIn her bedroom, David Janisch, a former police officer hired by Morgan Geyser's legal team, found drawings of Slender Man and mutilated dolls that had \"their hands cut off, arms cut off, legs cut off,\" Janisch said.\n\nPolice also found that Morgan Geyser sent Anissa Weier an email instructing her to remember to clean out her browser history.\n\nMorry Gash/AP, FILE\n\n\"In looking through the Geyser home computer, there was literally thousands of internet searches that were done: 'how to get away with murder,' 'what kind of insane am [I]?' She was searching these things ahead of time,\" Casey said.\n\nTrussoni said she \"definitely had a clear sense of who the ringleader -- who was driving this -- was between the two girls. It was definitely Morgan.\"\n\nMorgan Geyser was later diagnosed with early onset schizophrenia, which is extremely uncommon at her age. Her family revealed that her father also has schizophrenia.\n\nMichael Sears/Milwaukee Journal-Sentinel via AP, FILE\n\nBoth girls entered not guilty pleas by reason of mental disease or defect.\n\nAnissa Weier was supposed to go to trial first but took a last-minute plea deal. She pleaded guilty to a lesser charge of attempted second-degree intentional homicide. As part of her deal, a jury would hear her insanity defense and decide whether she was criminally responsible and should be sent to a prison, or not guilty by reason of mental disease or defect and sent to a state mental institution.\n\nIn 2017, a jury found her not guilty by reason of mental disease or defect. She was sentenced to a 25-year commitment in a state institution.\n\nMichael Sears/Milwaukee Journal-Sentinel via AP, FILE\n\nMorgan Geyser's lawyers also cut a deal with prosecutors. She pleaded guilty to attempted first-degree intentional homicide and prosecutors agreed not to challenge her insanity defense. Geyser was sentenced to a 40-year commitment in a state institution.\n\n\"I just want to let Bella and her family know. I'm sorry… I never meant this to happen,\" Geyser said as she cried during her sentencing.\n\nGeyser and Weier are both 17 years old now and being held at the Winnebago Mental Health Institute in Wisconsin.\n\nAngie Geyser's said she believes her daughter no longer poses a danger.\n\n\"Morgan's untreated mental illness is what made her a danger and she is no longer a danger,\" Angie Geyser said. \"Her illness has been treated very successfully.\"", "description": "The investigators who questioned the young attempted murderers spoke for the first time with “20/20” and discussed how they uncovered their three vicious plots.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/slender-mug-1-ht-ay-191016_hpMain_16x9_992.jpg", "published_at": "2019-10-23"}