{"pub": "cbc", "url": "https://cbc.ca/news/politics/singh-liberals-indigenous-grassy-narrows-human-rights-1.5310529", "downloaded_at": "2019-10-05 22:41:57.316489+00:00", "title": "Access Denied", "language": "en", "text": "NDP Leader Jagmeet Singh attacked the Liberals' record on Indigenous issues, saying the government's decision to appeal the latest ruling on compensation for Indigenous children demonstrates the kind of inaction that can be expected if they're re-elected.\n\nThis week the Liberal government announced it would challenge a landmark human rights ruling to compensate apprehended First Nations children harmed by the on-reserve child welfare system and under-funded child and family services.\n\nSingh reacted to the news on Saturday while he was campaigning in Grassy Narrows, an Indigenous community in northern Ontario that has been dealing with mercury poisoning in its water supply for years, and has been under a water advisory since 2013.\n\nHe used the community as an example of the \"the inaction of Conservative and Liberal governments,\" saying compounding examples — Liberal Leader Justin Trudeau saying \"thank you for your donation\" to a protester asking questions about Grassy Narrows at a fundraising event, the remaining 56 listed boil water advisories on reserves and now the appeal of the ruling — prove the Liberals won't fight for Indigenous communities.\n\nOn Friday, the Attorney General of Canada filed an application for a judicial review and for a stay of the ruling with the Federal Court — just over two weeks before the federal election and days before the Oct. 7 deadline for filing an appeal.\n\nOn Sept. 6, the Canadian Human Rights Tribunal ordered the federal government to pay $40,000 — the maximum allowed under the Canadian Human Rights Act — to each child taken from homes and communities under the on-reserve child welfare system from Jan. 1, 2006, to a date to be determined by the tribunal.\n\nThe ruling also directed Ottawa to compensate some of the parents and grandparents of children who were apprehended. The decision could leave the federal government on the hook for billions of dollars in compensation.\n\nNDP Leader Jagmeet Singh is asked how much money he would spend to ensure all communities have safe drinking water. He says he will do 'whatever it takes.' 2:38\n\nTrudeau said he is not challenging the tribunal's conclusion that compensation should be awarded.\n\n\"We need to compensate those who've been harmed, but the question is how to do that,\" Trudeau said. \"Those are conversations that we cannot have during a writ period.\"\n\nBut that's not what his government's application says.\n\nIt calls for an order setting aside the tribunal's decision and dismissing the claim for monetary compensation. In the absence of such an order, the federal government is asking to have the decision put aside and refer the matter back to the tribunal for review in accordance with directions set by the Federal Court.\n\nSingh called the appeal a \"betrayal of reconciliation.\"\n\nLiberals want to build on past progress\n\nCatherine McKenna, a Liberal candidate in Ottawa who serves as environment minister under Trudeau, acknowledged Saturday that there's \"still a lot more work to do.\"\n\nIn the last four years, the Liberals lifted 87 boil water advisories — a large percentage of the total number in Canada — and have committed in their 2019 election platform to eliminate the remaining ones by 2021.\n\nLiberal Leader Justin Trudeau held a town hall in Saskatoon Thursday night 1:25\n\nMcKenna told reporters that electing a Liberal government will see that work continued.\n\n\"We want to continue the progress,\" she said. \"We can't lose the progress we've made.\"\n\nThe NDP are also committing to lift all drinking water advisories by 2021.\n\nBut it's not soon enough for the residents of Grassy Narrows.\n\n\"Why do we have to keep living this way?\" Chrissy Isaacs said. \"It feels like forever.\"\n\nIsaacs, 39, said she was born with mercury in her body and experienced severe mental health problems as a child because of it. As an adult, her legs are starting to go numb, and she's unable to swallow easily. Her children are also showing similar symptoms of mercury poisoning.\n\nShe said there's a double standard between cities and Indigenous communities in Canada.\n\n\"How come in the cities they have clean water?\" she said.\n\nChrissy Isaacs lives in Grassy Narrows. She's felt the effects of mercury poisoning her whole life and is worried about her children's health. (Radio-Canada)\n\nAbout $2 billion has been invested in fixing the water systems in Indigenous communities since 2015, but a report in 2017 by the Parliamentary Budget Officer said Ottawa will need to invest a minimum of $3.2 billion to bring First Nations water systems up to the standards of comparable non-Indigenous communities in order to eliminate boil water advisories.\n\nGrassy Narrows has asked for $19 million to build the mercury treatment centre the government committed to in 2017. That figure caused disputes between the federal government and the community, as Ottawa's analysis found it would cost about $10 million to build the facility. The two numbers took into account different levels of care for patients. The election campaign started with no resolution of that promise.\n\n\"We remain steadfast in our commitment to meeting the specific health needs of Grassy Narrows,\" Indigenous Services Minister Seamus O'Regan said in a statement Saturday.\n\n\"To be clear, funding is not an obstacle in these discussions. Funding will reflect the agreed upon final design that best meets the needs of community members.\"\n\nSingh said the NDP would commit to providing Grassy Narrows with the full amount they asked for.\n\nWhen asked if Indigenous communities would get a blank cheque to deal with water contamination and the issues that stem from it, he responded that it should be a priority.\n\n\"Yes, I'm saying we should do whatever it takes.\"", "description": "NDP Leader Jagmeet Singh attacked the Liberals' record on Indigenous issues, saying the government's decision to appeal the latest ruling on compensation for Indigenous children demonstrates the kind of inaction that can be expected if they're re-elected.", "authors": [], "top_image": "https://i.cbc.ca/1.5310632.1570303062!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/fedelxn-ndp-20191005.jpg", "published_at": "2019-10-05"}