{"pub": "marketwatch", "url": "https://marketwatch.com/story/how-to-make-the-most-of-your-hsa-for-now-and-the-future-2019-05-08", "downloaded_at": "2019-10-14 23:22:24.550636+00:00", "title": "How to make the most of your HSA — for now, and the future", "language": "en", "text": "Robert Farrington thinks his Health Savings Account is as great as a 401(k) plan and individual retirement account when it comes to preparing for retirement, and he is adamant about not spending that money unless absolutely necessary.\n\nWhen his wife broke her knee last year, the couple paid expenses out-of-pocket and left their money in their HSA. Farrington, the founder of the College Investor, a website dedicated to managing student loans, said it made sense — an HSA’s assets will grow significantly more than the amount of money they use to pay for current health bills.\n\nHealth savings accounts are a great way to save for medical bills in the future, experts say. They’ve got triple tax advantages, because the accounts are funded with pretax dollars, grow with interest and investment returns tax-free and can then be withdrawn tax-free when used for qualified health care expenses. Because they’re only available with a high-deductible health insurance plan (more on that later), the health care premiums are less expensive each month and others can help fund the account, including an employer or family member.\n\nBut what if you have medical expenses now?\n\nSee: 10 hidden pitfalls of health savings accounts\n\nAlthough they can be a huge benefit come retirement, HSAs are also handy for unexpected medical expenses. Financial experts typically suggest account holders refrain from using funds in an HSA until they’re ready to retire, when health care costs will amount to hundreds of thousands of dollars. But not everyone can do that.\n\nRobert, a personal finance blogger at Stop Ironing Shirts from Dallas, knows this. He and his wife Hillary have contributed the maximum allowed in an HSA since 2007, but they used some of the money in their account for health expenses up until 2017. Robert had an expensive emergency room visit, and his wife suffered a rare spine injury that required flying out to specialists across the country. The HSA allowed for flight reimbursements and lodging, Robert said. “It was good to have a pot of money available,” he said. “Not everything is covered by health insurance.” The couple, who are currently enjoying early retirement and a career hiatus, are saving health care receipts they may reimburse later on for tax optimization, he added.\n\nRead: Here’s exactly where you should retire — based on what’s important to you\n\nHSAs are also only available to those with a high deductible health plan, which — as the name suggests — comes with higher deductible requirements than traditional health care plans. This means an insurer won’t pay for any expenses until the accountholder or her family have already paid potentially thousands of dollars in medical bills for the year. The minimum annual deductible for an individual with an HDHP in 2020 is $1,400, and $2,800 for families. The most an individual can pay out of pocket before insurance kicks in (which includes copayments and deductibles, but not premiums) is $6,900 for an individual and $13,800 for a family.\n\nRead: Here’s one health-insurance choice that can save you money now and make you even more later\n\nAccount holders can leave an HDHP when the next enrollment period comes up, but they would no longer be allowed to add new contributions to their HSA — just maintain or use down the funds they have.\n\nNot everyone can afford to save for future health care, pay current medical bills and also invest for non-health related retirement needs in a 401(k) or individual retirement account. Similar to the approach of investing in a 401(k), it comes down to a balance. “They are a lifetime and life cycle tool,” said Kevin Robertson, senior vice president and chief revenue officer of HSA Bank, an HSA provider. “As we age, we are going to go through ebbs and flows of our needs surrounding health care.”\n\nInstead of worrying about spending down some HSA contributions before retirement, they should strategize — just as they would with investing in a 401(k) plan, Robertson said. Someone will have a different approach to maximizing savings when they’re single and in their 20s than they will when they’re in their 40s and raising children. An HSA may be a second or third priority compared with putting money toward a down payment for a home one year. Parents may find more money in their budget to save for retirement when their children go off to college or move out of their family home. “I think it is more important to think over the course of my life rather than the next 12 months,” Robertson said.\n\nThe goal, when possible, is to hold off on spending in an HSA as long as possible, as they provide an extra layer of comfort come retirement. Health issues are the top retirement concern for adults over 65, versus running out of money or their lifestyle, a Franklin Templeton annual survey released last month found. Older Americans are worried about medical expenses, and half said they don’t know how they’ll pay for health care in retirement. A couple retiring in 2019 could expect they’ll need $285,000 for health care expenses alone the rest of their lives, not including long-term care. The annual contribution to an HSA is $3,500 for an individual and $7,000 for a family in 2019, but in 2020 it will be $3,550 for an individual and $7,100 for a family. The catch-up contribution for people after 55 will remain an additional $1,000.\n\nAlso see: How a health-savings account can help fund your retirement\n\nUsing HSA funds for current medical bills isn’t bad, said Begonya Klumb, head of the HSA team at Boston-based financial services firm Fidelity Investments. “Everyone’s needs are different,” she said. “There are people who need to use their contributions for current expenses.” The fact that they have an HSA to withdraw from is positive, as they’re spending for health care in a tax-advantaged manner.\n\nFor those who do have extra money to allocate toward retirement savings, they may first want to fund a 401(k) or similar plan, which allows for general spending in retirement, wrote Eileen Baldwin-Shaw, an ERISA consultant at First Western Trust. She suggests meeting the 401(k) match, then contributing to an HSA up to the limit ($3,500 for an individual, and $7,000 for a family HSA in 2019), and if there’s more to spare, hitting the contribution limit in the 401(k).", "description": "Health savings accounts are helpful in retirement, but you may need to use them sooner.", "authors": ["Alessandra Malito"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HT247_doctor_ZG_20191014105938.jpg", "published_at": "2019-05-08"}