{"pub": "cbc", "url": "https://cbc.ca/sports/soccer/cpl/cpl-preview-nigel-reed-edmonton-pacific-1.5282397", "downloaded_at": "2019-09-13 18:23:23.143171+00:00", "title": "Sports-no-CBC", "language": "en", "text": "The days are getting shorter and so in the schedule. Unless you are Cavalry or Forge FC, time is quickly becoming the enemy.\n\nCavalry – the first Canadian Premier League spring season champions – are biding their time. The Calgary-based team can afford to coast, secure in the knowledge they will be contesting the inaugural CPL Championship.\n\nForge are the red-hot favourites to join them. The men from Hamilton are breezing along, riding a nine-match CPL unbeaten run. They have kept the bar consistently high and lead the longer fall season standings with a game in hand.\n\nPredictably, both won again in midweek to widen the gap on the chasing pack. Cavalry beat arch rivals FC Edmonton courtesy of a Nik Ledgerwood penalty – his second successful spot kick is as many games, to reclaim top spot.\n\nA mere 24 hours later, Forge trumped the Cavs with a dominant display in Winnipeg. Anthony Novak opened the scoring with his 5th goal of the season – remarkably 4 of them have come against Valour. Forge eased to a 3-1 victory to regain pole position.\n\nThere can be no argument that Cavalry and Forge are the best two teams in this historic first CPL season. It is almost a foregone conclusion they will dispute the 2019 CPL Championship, but it is not quite a done deal.\n\nThere is still time for a twist in the tale.\n\nPlenty of ground to make up\n\nIt would take a seismic shift in form. Edmonton lies a distant third – nine points behind Forge, but the Eddies must believe they can still bridge the yawning gap. They have seven games remaining and will consider most of them winnable.\n\nFirst they must shake off the disappointment of losing Al Classico. Jeff Paulus's team leads off the weekend action with a trip to Vancouver Island to face Pacific (CBC, CBCSports.ca, Saturday 3 p.m. ET/12 p.m. PT) at Westhills Stadium. The Eddies have won in Langford before and must do so again.\n\nThe last two meetings have swung decisively in favour of FC Edmonton. They won 3-1 on the Island in June and repeated that scoreline on home soil last month. The Eddies found an extra gear to close out the spring season and simply must rediscover that form to have any chance of catching Forge whom they host in early October.\n\nFor Pacific, it's the final match of a three-game home stand. Disappointingly, Michael Silberbauer's men haven't won either of the first two, sharing the spoils with Forge before an underwhelming performance in losing to York9 on Wednesday. PFC must try and give their fans something to shout about before embarking on a daunting road trip to Cavalry and Forge in successive weekends.\n\nEven if Edmonton clicks into gear, the Eddies are going to need some help. They would need Forge's smooth running engine to splutter mightily in the closing weeks – and that doesn't seem likely with Borges, Bekker and company all in harmony.\n\nForge return home to Hamilton on Sunday to face struggling HFX Wanderers. Anything other than a convincing home win would send shockwaves across the CPL but Forge cannot afford to be complacent.\n\nYork9 and Valour wrap up the weekend action at York Lions Stadium. Jim Brennan's team will be in buoyant mood after ending their five-game winless streak, while Rob Gale's Valour have shipped 11 goals in their last two outings. Clearly, there are acres of room for improvement.", "description": "There can be no argument that Cavalry and Forge are the best two teams in this historic first CPL season. It is almost a foregone conclusion they will dispute the 2019 CPL Championship, but as Nigel Reed writes, it is not quite a done deal and there is still time for a twist in the tale.", "authors": [], "top_image": "https://i.cbc.ca/1.5282625.1568391446!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/fc-edmonton.jpg", "published_at": "2019-09-13"}