{"pub": "bbc", "url": "https://bbc.com/news/newsbeat-49755700", "downloaded_at": "2019-09-19 23:10:17.040810+00:00", "title": "Remake The Princess Bride? Inconceivable!", "language": "en", "text": "Image copyright Alamy Image caption Movie remakes: the ultimate poisoned chalice?\n\nAnother week, another set of divided opinions online about, well, almost everything.\n\nBut this week one thing seemed to unite most people - if Twitter is anything to go by, at least.\n\nRemaking the classic 1987 film The Princess Bride is a bad idea. An even worse idea, in fact, than getting involved in a land war in Asia.\n\nThe debate was started by an interview by Variety with Norman Lear, the film's producer.\n\nHe said \"very famous people, whose names I won't use, but they want to redo The Princess Bride.\"\n\nEven that tantalising hint was enough to make many fans reach for the gifs.\n\nAnd in a world where politics seems to divide people - this united them.\n\nSkip Twitter post by @andylassner I will vote for the Presidential candidate who includes not remaking “The Princess Bride” as part of their platform. — andy lassner (@andylassner) September 18, 2019 Report\n\nEven the Dread Pirate Roberts himself - presumably now living like a king in Patagonia - got involved.\n\nImage copyright Alamy Image caption You remade my favourite film... prepare to die.\n\n'\"Not just your average, everyday, run-of-the-mill fairy tale'\n\nIf you've not seen the original 1987 film, you may be asking 'what's it about, and why do fans love it so much?'\n\nThe first question is easy to answer.\n\nWhat's The Princess Bride about? Fencing. Fighting. Torture. Revenge. Giants. Monsters. Chases. Escapes. True love. Miracles.\n\nThe second question, like a Rodent of Unusual Size, is a little harder to tackle - but loved it certainly is, with a solid 8.1/10 rating on IMDb and 97% on Rotten Tomatoes.\n\n\"It's embedded in a period of nostalgia for some people,\" says Dr James Walters is an expert in film at The University of Birmingham.\n\n\"Unlike Disney where you've got animation that can be remade, The Princess Bride has a real live action cast and for a lot of people it's seen as almost a sacrilegious effort to recreate that on screen.\n\n\"I think some of the backlash with The Princess Bride is a backlash against the constant remaking of films. The fan response is that this is one step too far. This is the film that's pushing remakes to the absolute limit.\"\n\nDr Christopher Holliday, who studies film at King's College London agrees.\n\n\"It's got a cult and legendary standing. Audiences like its imperfect status and they want to preserve the original. It's fair game for re-make material but recreating it today might undo its successes\".\n\nImage copyright Alamy Image caption 'I've got my wife to murder, a classic film to ruin. I'm swamped.'\n\n'You mocked me once, never do it again'\n\nRemaking films is nothing new. Here's James again:\n\n\"It's a general feeling for post-millennials that we're re-making and re-hashing things again. But it's always been the case, there were loads of Godzilla, Tarzan and Zorro films. If you think of something like Batman, the 1960's Batman was a reboot of one from the 40's, so it's always been there, we just have more awareness now.\"\n\nBut it does feel like recently a trickle has turned into an avalanche.\n\nThe late Walt Disney may have famously declared, \"you can't top pigs with pigs,\" but his company certainly seems to think you can - as long as you're topping animated pigs with CGI ones, at least.\n\nIn the past year alone we've seen several major remakes, from The Lion King to Dumbo and Aladdin. And it's not just Disney mining the back catalogue.\n\nBut why do film companies keep giving the green light to remakes, reboots and re-imaginings?\n\nJames, who specialises in Hollywood and fantasy films, says the answer is simple. \"Whilst there's still money to be made, remakes will keep happening. That only stops when they're no longer financially viable.\"\n\nImage copyright Disney/Alamy Image caption Disney have released remakes of The Lion King and Aladdin this year.\n\nBut how many more reboots can we stand? Chris thinks it's something we're finally growing tired of.\n\n\"From the audience perspective, there's a sense of raking over old ground. It can seem like remakes are coming from an industry that's bankrupt of original material. We hear a lot about a lack of imagination and laziness.\"\n\n'Drop your sword'\n\nFans will only hope that Hollywood will listen to their pleas not to remake this particular classic. Maybe even replying with a simple, \"as you wish.\"\n\nBut then again, remember Westley's wise words...\n\nLife is pain. Anyone who says differently is selling something.\n\nImage copyright Alamy\n\nFollow Newsbeat on Instagram, Facebook, Twitter and YouTube.\n\nListen to Newsbeat live at 12:45 and 17:45 weekdays - or listen back here.", "description": "In a world of divided opinion, it seems there’s one universal belief. Don’t re-make The Princess Bride.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/C839/production/_108875215_sicilian.jpg", "published_at": "2019-09-19"}