{"pub": "huffpost", "url": "https://huffpost.com/entry/awkwafina-comedy-central-show-premiere-date_n_5d7679a9e4b0fde50c2ad08f", "downloaded_at": "2019-09-09 23:17:41.808653+00:00", "title": "Awkwafina's Comedy Central Show Gets A Premiere Date", "language": "en", "text": "After breaking out in last summer’s comedy blockbusters “Ocean’s 8” and “Crazy Rich Asians” and earning critical acclaim for her dramatic leading role in this summer’s “The Farewell,” Awkwafina is taking her talents to television, creating and starring in a semi-autobiographical comedy series on Comedy Central.\n\n“Awkwafina Is Nora From Queens” will premiere in January 2020, the network announced Monday.\n\nGreenlighted last November and currently in production, the show draws from the actor, comedian and rapper’s life. Awkwafina, whose real name is Nora Lum, grew up in the New York City borough of Queens, raised by her dad and grandmother after her mother died when she was 4 years old.\n\n“Law & Order: SVU” star B.D. Wong plays Awkwafina’s dad in the comedy series, and Lori Tan Chinn of “Orange Is the New Black” plays her grandmother. Comedian and “Saturday Night Live” writer Bowen Yang plays her “more successful” cousin.\n\nThe network also revealed a slate of acclaimed directors for the show’s 10 episodes, including “Russian Doll” co-creator and star Natasha Lyonne and “But I’m a Cheerleader” director Jamie Babbit.\n\nThe show also boasts an all-female team of writers ― a rarity in the world of comedy writing, where many writers rooms are still primarily occupied by men.\n\nAwkwafina has teased bits and pieces of the show on social media, including potential guest stars like “SNL” cast member Melissa Villaseñor.\n\n“This is a show about being raised by my grandma and dad in Queens, living at home and finding purpose. No show tunes, all female writers room, an ode to Queens and the cultural BUFFET of people that helped shape me into the human I am,” ﻿Awkwafina said in February, quipping that the show will also contain “many expired Asian calendars.”", "description": "\"The Farewell,\" \"Crazy Rich Asians\" and \"Ocean's 8\" star's profile is about to rise even higher.", "authors": ["Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d7685833b00002a74d0c3a0.jpeg?cache=qmoid9r9sh&ops=1778_1000", "published_at": "2019-09-09"}