{"pub": "bbc", "url": "https://bbc.com/news/business-49574890", "downloaded_at": "2019-09-04 03:49:15.758858+00:00", "title": "Huawei accuses US of cyber-attacks and threats to staff", "language": "en", "published_at": "2019-09-04", "text": "Image copyright Getty Images\n\nHuawei has accused the US government of \"using every tool at its disposal\" to disrupt its business.\n\nIn a press release on Tuesday, the Chinese tech giant said the US had launched cyber-attacks to infiltrate its networks and was threatening its employees.\n\nThe firm, which was put on a US trade blacklist this year, did not offer evidence for the allegations.\n\nHuawei has become a centrepiece of the trade dispute between the US and China.\n\nIn its press release, Huawei alleged the US had been unlawfully detaining its staff, launching cyber-attacks to infiltrate its internal information systems and that FBI agents were being sent to the homes of its employees to pressure them to collect information on the company.\n\n\"We strongly condemn the malign, concerted effort by the US government to discredit Huawei and curb its leadership position in the industry,\" the firm said.\n\nThere has been no response yet from US officials.\n\nThe Huawei statement was made in response to a Wall Street Journal report that said it had been investigated by the US Department of Justice on the alleged theft of smartphone camera patents. The Chinese tech giant said in its statement the allegations were false.\n\nThe firm has come to symbolize a growing power struggle between the US and China. The world's two largest economies have been fighting a trade war over the past year.\n\nThe US argues Huawei poses a national security risk and put the company on a trade blacklist in May.\n\nWashington has also lobbied its allies to shun Huawei products for fear they could be used by Beijing for surveillance.\n\nHuawei has repeatedly rejected this and says it is independent from the Chinese government.", "description": "The Chinese tech giant, at the heart of a US-China power struggle, gave no evidence for its allegations.", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/16094/production/_108606209_gettyimages-1147413873.jpg"}