{"pub": "reuters", "url": "https://af.reuters.com/article/topNews/idAFKBN1WP1QQ-OZATP", "downloaded_at": "2019-10-10 15:32:25.313416+00:00", "title": "Congo Republic president's adviser awarded oil licenses at heart of Eni probe", "language": "en", "text": "JOHANNESBURG/MILAN (Reuters) - A Congolese presidential advisor played a key role in awarding oil licenses now at the heart of a corruption probe by Italian authorities that has engulfed energy giant Eni SpA and the family of its chief executive.\n\nRepublic of Congo President Denis Sassou Nguesso inspects a guard of honour before meeting Democratic Republic of Congo's President Joseph Kabila at the State House in Kinshasa, Democratic Republic of Congo February 14, 2018. REUTERS/Kenny Katombe\n\nThe advisor, Denis Gokana, headed a committee that awarded licenses to Italy’s Eni and a Congolese partner company he founded, according to government records and confirmed by Gokana via email.\n\nThe Congolese president appointed Gokana in 2013 to head a committee responsible for boosting the role of the country’s private sector in the economy, a role that was disclosed at the time in the official government gazette, a copy of which was reviewed by Reuters.\n\nThis is the first time the role played by a key Congolese official in events at the centre of the Italian corruption probe has been publicly revealed. Gokana, who is special natural resources advisor to Congolese President Denis Sassou Nguesso, denied any wrongdoing.\n\nState-controlled Eni, one of the world’s largest oil companies, disclosed last year that it was under investigation by Milan prosecutors for corruption in Congo Republic. Reuters reported on Sept. 28 that Italian prosecutors were investigating the wife of Eni Chief Executive Claudio Descalzi as part of its corruption probe.\n\nThe inquiry revolves around agreements signed between 2013 and 2015 by Eni’s Congolese subsidiary with local partners and seeks to determine whether certain contracts hid a form of bribe.\n\nEni denies any wrongdoing and said it had no say in the awarding of the licenses or the government’s choice of its local partner - Africa Oil & Gas Corporation (AOGC), the company founded by Gokana. A lawyer for Descalzi’s wife, Marie Magdalena Ingoba, said his client had no comment.\n\nThe Congo investigation comes as Eni faces allegations alongside Royal Dutch Shell that it paid more than $1 billion in bribes to gain control over a Nigerian oil field. Italian authorities have charged Eni, Shell and 13 individuals, including Descalzi, with violating Italy’s international corruption law in an ongoing case in Milan.\n\nShell, Eni, Descalzi and the other individuals have denied any wrongdoing in the Nigeria case. The company has said it is confident the allegations levelled at it by prosecutors would be found groundless.\n\nIn the Congo matter, the fresh detail about the role of the president’s advisor raises questions about Eni’s due diligence into its local partner, said Natasha White, a London-based researcher at anti-corruption campaign group Global Witness. The non-governmental organization identified the ties between Eni and Gokana and shared the findings with Reuters.\n\nA former Eni director told prosecutors that while at the company, he raised concerns to CEO Descalzi about ties between Eni’s Congolese partner company and the president’s advisor, and that the CEO dismissed them, according to a 2015 deposition reviewed by Reuters.\n\nDescalzi “disputed the basis of my remarks and told me my behaviour was paralysing Eni’s commercial activities in the petroleum sector,” former board member Luigi Zingales, a finance professor, told prosecutors.\n\nDescalzi, who has led Eni since 2014, is not a target of the corruption probe related to the company’s Congolese operations, according to Eni and a person familiar with the investigation.\n\nEni, Africa’s biggest foreign oil and gas producer, declined to comment on Zingales’ statements to prosecutors but said it didn’t believe he was in a position to properly assess its governance.\n\nThe company said an audit conducted with the help of external lawyers and consultants found no evidence of corruption in relation to operations in Congo. Eni said its due diligence did identify that its local partner company had been founded by presidential advisor Gokana but concluded that he no longer held an ownership stake or served as a manager.\n\nAsked whether the company was aware that Gokana headed the committee that awarded the licenses, Eni said: “Eni has no evidence of knowledge of any specific of alleged activity rendered by Mr. Gokana for the benefit of Eni in the award processes.”\n\nA Congolese government spokesman did not respond to requests for comment addressed to the president and the government.\n\nFAMILY TIES\n\nCongo Republic, sub-Saharan Africa’s third-largest oil producer by volume, is one of Eni’s key African operations. One area of focus for Italian prosecutors is whether Eni gave away a portion of its rights to extract oil in Congo Republic to companies linked to public officials in order to secure the reissue of oil exploration licences in violation of Italy’s international corruption laws, according to search warrants reviewed by Reuters.\n\n“Eni SpA has ‘gifted’ to companies reporting to Congolese politicians participation shares in oil exploitation licenses,” prosecutors asserted in a search warrant issued last year. The warrant identified Gokana as among several public officials with links to AOGC.\n\nWhen the government in 2013 reallocated four oil extraction licenses, which Eni had previously held, the committee chose AOGC to partner with Eni, according to Gokana and Eni. Those four licenses produced oil worth about $400 million in 2014, according to a Reuters calculation based on pricing data from UK energy analysts S&P Global Platts.\n\nEni told Reuters that its share of the four licenses generated $127 million of gross revenues in 2014, which amounted to $72 million of free cash flow, or less than 1% of Eni’s overall free cash flow.\n\nGokana, in written responses to Reuters, said that the company he founded was the only local entity with the necessary technical and financial capacity to partner with Eni. He said he had been sole shareholder of AOGC but had divested his entire stake after he was appointed head of Congo’s state oil company in January 2005.\n\nItalian prosecutors allege he has retained “very strong links” to AOGC, according to a March 2018 search warrant. The four licenses are among a number of permit allocations involving Eni that Italian authorities are investigating, according to the warrant.\n\nGokana confirmed to Reuters that his cousin had been chairman of the local partner. The cousin, Dieudonne Bantsimba, was listed as AOGC’s chairman on the company’s website as recently as January of this year.\n\nReached by telephone, Bantsimba said he no longer held the role. He declined to say when he stepped down or answer further questions.\n\nEni said that its investigations in Congo “could not (and did not) identify the alleged presence of family ties between Gokana and Bantsimba.” It added “that AOGC had certified to Eni the absence of family ties between any company beneficiaries and public officials.”\n\nAOGC didn’t respond to a request for comment.\n\n“A SORT OF ‘RETROCESSION’”\n\nAnother part of the Italian prosecutors’ corruption probe focuses on what they describe in search warrants as “a sort of ‘retrocession,’” or a form of kickback, involving six individuals, including the wife of Eni CEO Descalzi.\n\nSpecifically, prosecutors are investigating whether the individuals benefited from a deal in which AOGC obtained a stake in a potentially promising offshore oil exploration zone and then transferred it to a British-registered oil exploration company named World Natural Resources Ltd.\n\nIn a Sept. 26 prosecution document related to Ingoba, prosecutors allege WNR’s then-director Alexander Haly was a business partner of Descalzi’s wife.\n\nHaly is chief executive of Monaco-based supply-ship operator Petro Services, part of Amsterdam-based Petroserve Holding BV, according to the company’s web site. Petro Services’ Congo subsidiary won more than $100 million worth of contracts with Eni from 2012 to 2017, according to a 2018 search warrant.\n\nProsecutors, in the September document, allege Petro Services was controlled by Descalzi’s wife via a series of shell companies located in Holland, Luxembourg and Cyprus.\n\nIn its response to Reuters, Eni said contracts won by Petro Services “took place within a competitive framework” and “no Eni director or employee has ever told the company about having an interest in World Natural Resources.”\n\nA spokeswoman for Haly and Petro Services declined to comment. According to British company registration filings, Haly resigned as a WNR director in 2014.\n\nWNR didn’t respond to a request for comment.\n\n‘SIMPLY DISCLOSED’\n\nItalian authorities are also investigating the CEO and his wife in relation to a separate probe into alleged failure to disclose a conflict of interest connected to Eni’s dealings in Congo.\n\nNo charges have been made in either the corruption or the disclosure probe related to Eni’s Congolese operations.\n\nDescalzi, whose term as CEO is up for renewal by shareholders next spring, denied wrongdoing in a written response to Reuters. “Had I known about any such potential situation, I would have simply disclosed,” he said.\n\nDescalzi also referred Reuters to a statement issued by Eni last month in which he said in part: “I am totally certain that I have always behaved lawfully.”", "description": "A Congolese presidential advisor played a key role in awarding oil licenses now at the heart of a corruption probe by Italian authorities that has engulfed energy giant Eni SpA and the family of its chief executive.", "authors": ["Joe Bavier", "Emilio Parodi", "Stephen Jewkes", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191010&t=2&i=1439254605&w=1200&r=LYNXMPEF9915S-OZATP", "published_at": "2019-10-10"}