{"pub": "businessinsider", "url": "https://pedestrian.tv/entertainment/timothee-chalamet-australia-premiere-the-king", "downloaded_at": "2019-09-26 03:59:12.495904+00:00", "title": "Walking Thirst-Trap Timothée Chalamet Is Coming To Oz For The Premiere of His New Movie", "language": "en", "text": "Yesterday, sweet angel Timothée Chalamet hopped on Twitter and teased a little something-something. No words, just emojis, one of which was the Australian flag. Whenever a celebrity does this it usually means they’re coming to Australia but Chalamet didn’t explicitly confirm anything so us mere peasants were left to speculate. And then, I got the email.\n\nTimothée Chalamet is coming to Australia.\n\nChalamet, the star of Netflix’s upcoming historical drama The King, will be in the country for its Australian premiere. He’ll walk the red carpet in Sydney with co-star and co-writer Joel Edgerton, and the director and co-writer David Michôd.\n\nOkay DETAILS: Chalamet will be in Sydney come Thursday, 10 October for the red carpet at The Ritz Cinema, Randwick. I’m not saying you should take a day off work to stand outside The Ritz for Timothée Chalamet… but…\n\nThe King premieres on Netflix November 1, with a theatrical release in October. The film follows Hal (Chalamet), the reluctant heir to the English throne who wants nothing to do with it. In fact, Hal prefers to live among the people and do as the peasants do. But this all changes when Dad carks it and Hal is crowned King Henry V, forcing him to embrace the life he tried so hard to run away from. Now the young king must navigate palace politics, chaos, and the war his father left behind, all while coping with the memories from his past life – including his relationship with his closest friend and mentor, John Malstaff (Edgerton).\n\nIt co-stars Sean Harris, Ben Mendelsohn, Lily-Rose Depp (Chalamet’s actual girlfriend, sorry), and Robert Pattinson.\n\nNovember 1, lock it in.", "description": "Timothée Chalamet is coming to Australia - well, Sydney - for the premiere of his new film The King. The movie will be available on Netflix come Nov 1.", "authors": ["Steffanie Tan"], "top_image": "https://www.pedestrian.tv/content/uploads/2019/09/Angel.png", "published_at": "2019-09-26"}