{"pub": "metro", "url": "https://metro.co.uk/2019/10/30/chelsea-vs-manchester-united-team-news-11014484", "downloaded_at": "2019-10-30 23:17:42.157072+00:00", "title": "Chelsea vs Man Utd team news: Frank Lampard makes six changes, Ole Gunnar Solskjaer selects strong XI", "language": "en", "text": "Manchester United beat Chelsea 4-0 on the opening weekend of the season (Picture: Getty)\n\nChelsea boss Frank Lampard has made six changes to his starting XI for tonight’s Carabao Cup clash against Manchester United at Stamford Bridge.\n\nThe Blues made it seven wins in a row with a 4-2 victory against Burnley at Turf Moor on Saturday but Lampard has used the occasion to rotate his side.\n\nChristian Pulisic struck a hat-trick in Lancashire and the American keeps his place in the side. But it’s all change around him as Callum Hudson-Odoi and Michy Batshuayi come in for Tammy Abraham and Willian.\n\nIn defence, Reece James comes in at right-back while Marc Guehi is making his second start of the season in the middle of defence alongside Kurt Zouma.\n\nJorginho captains the Blues tonight! ⓒ Here's our #CHEMUN team in full… 👊 pic.twitter.com/oMTYGg1MFk — Chelsea FC (@ChelseaFC) October 30, 2019\n\nAdvertisement\n\nAdvertisement\n\nManchester United scraped past Rochdale in the previous round after being the minnows on penalties.\n\nOle Gunnar Solskjaer named a weakened – but strong – side that night and he’s done the same in west London.\n\nSergio Romero comes in for David De Gea in goal, while Brandon Williams and Marcos Rojo come into the defence in what appears to be a back three.\n\nJesse Lingard is the only change in midfield as Anthony Martial drops down to the bench.\n\nMORE: Alan Smith slams Unai Emery as he finally starts Mesut Ozil for Arsenal against Liverpool", "description": "Chelsea boss Frank Lampard has made six changes to his starting XI for tonight's Carabao Cup clash against Manchester United at Stamford Bridge. The Blues made it seven wins in...", "authors": ["Sean Kearns"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/GettyImages-1167408628_1572462940.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-30"}