{"pub": "marketwatch", "url": "https://marketwatch.com/story/how-to-reduce-the-tax-hit-on-soon-to-be-developed-land-2019-09-23", "downloaded_at": "2019-09-23 19:15:53.681196+00:00", "title": "How to reduce the tax hit on a plot of land you plan to develop", "language": "en", "text": "Real estate prices are soaring in many areas, and you might be the lucky owner of highly appreciated land that’s ripe for development. Nice! But if you cash in by subdividing the land, developing the parcels, and selling them off for a hefty profit, it could trigger a whopping income tax bill. Ouch! What can you do? Please keep reading\n\nReal estate ‘dealers’ get hammered with higher tax rates\n\nHere’s the rub: the federal income tax rules generally treat a land developer as a real estate “dealer.” As such, your profit from developing and selling the land is considered profit from selling “inventory.” That means the entire profit--including the portion from any pre-development appreciation in the value of your land-–will be high-taxed ordinary income rather than lower-taxed long-term capital gain. Under today’s rules, the maximum federal rate on an individual’s ordinary income is 37%. You may also owe the 3.8% net investment income tax (NIIT) and state income tax too. So, your combined tax rate could be 50% or even higher Yikes!\n\nIt would be much better if you could arrange to pay lower long-term capital gains tax rates on at least part of the profit. The current maximum federal rate on long-term capital gains is “only” 20%. If you also owe the 3.8% NIIT, the combined maximum federal rate is “only” 23.8%. That’s much better than the 40.8% (37% + 3.8%) combined maximum federal rate on ordinary gains recognized by a real estate “dealer.”\n\nAs I will explain later in this column, today’s relatively reasonable tax rates may be on life support. So, getting your development deal done sooner rather than later is probably a really good idea from a tax perspective. Anyway, onward.\n\nS corporation developer entity strategy can ease the tax pain\n\nThankfully, there is a strategy that allows favorable long-term capital gains tax treatment for all the pre-development appreciation in the value of your land. This assumes you’ve held it for investment rather than as an established dealer in real estate. Understand this: even with this strategy, any profit attributable to subdividing, development, and marketing activities will still be high-taxed ordinary income, because you will be treated as a “dealer” for that part of the process. But if you can manage to pay “only” 23.8% on the bulk of your large profit (the portion from pre-development appreciation), that’s something to celebrate.\n\nExample: The pre-development appreciation in the value of your land is $3 million. If you employ the S corporation developer entity strategy explained below, that part of the profit will be taxed at a federal rate of no more than 23.8% (the 20% maximum federal rate on long-term capital gains plus another 3.8% for the NIIT) under the current tax regime. Say you expect to reap another $2 million of profit from development and marketing activities. That part will be taxed at ordinary federal income tax rates, which can be as high as 40.8% (37% plus 3.8% for the NIIT) under the current tax regime.\n\nWith this dual tax treatment, the maximum federal income tax hit is “only” $1,530,000 [(23.8% x $3 million) + (40.8% x $2 million)]. Without any advance planning, the entire $5 million profit would probably be taxed at the maximum 40.8% ordinary income rate, which would result in a much bigger $2,040,000 hit to your wallet. Which would you rather pay: $1,530,000 or $2,040,000?\n\nWith the preceding background in mind, here’s the drill for paying a smaller tax bill on your land development profit.\n\nStep 1: Establish S corporation to be the developer entity\n\nIf you as an individual are the sole owner of the appreciated land, you can establish a new S corporation owned solely by you to function as the developer entity. If you own the land via a partnership (or via an LLC treated as a partnership for tax purposes), you and the other co-owners can form the S corporation and receive corporate stock in proportion to your ownership interests.\n\nStep 2: Sell the land to the S corporation\n\nNext, sell the appreciated land to the S corporation for a price equal to the land’s pre-development fair market value. If necessary, you can arrange a sale that involves only a little cash and a big installment note owed by the S corporation to you (and the other co-owners, if applicable). The S corporation will pay off the note with cash generated by selling off parcels after development. As long as you have: (1) held the land for investment and (2) owned the land for more than one year, the sale to the S corporation will trigger a long-term capital gain eligible for the 23.8% maximum federal rate.\n\nStep 3: Have the S corporation develop the land and sell it off\n\nAfter buying the land, the S corporation will subdivide and develop the property, market it, and sell it off. The profit from these activities will be ordinary income passed through to you (and the other co-owners, if applicable). If the profit from development and marketing is big, you will probably pay the maximum 40.8% federal rate on that income. However, the average tax rate on your total profit will be lower than 40.8%, because a big part of that total profit will be pre-development appreciation taxed at “only” 23.8%.\n\nSooner rather than later is probably best\n\nAs things currently stand, the federal income tax rates mentioned in this column are locked in through 2025. But if the Democrats take control after the 2020 general election, all bets are off. Jacking up tax rates will probably be the very first thing they do, especially for upper-income folks. So, the sooner you can employ the S corporation developer entity strategy and start selling off lots, the better--from a tax perspective. Unless you are confident that Trump and Co. will remain in charge through 2024.\n\nThe bottom line\n\nThe S corporation developer entity strategy explained here can be a huge tax-saver in the right circumstances. But this is not a good DIY project. Contact your tax pro for assistance, and get the ball rolling sooner rather than later if this idea makes sense for you.", "description": "This strategy could save major tax bucks, but don’t wait too long.", "authors": ["Bill Bischoff"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HR790_constr_ZG_20190920164215.jpg", "published_at": "2019-09-23"}