{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/10/bill-callahan-brings-mix-old-school-patience-redsk", "downloaded_at": "2019-10-11 00:15:58.444869+00:00", "title": "Precise, demanding Callahan brings 'old-school' style to Redskins", "language": "en", "text": "ASHBURN — As a sixth-round rookie two seasons ago, Chase Roullier thought he knew what to expect. Even to an offensive lineman coming out of Wyoming, Bill Callahan had a reputation. There would be discipline and demands, to be sure, but the Redskins’ offensive line coach had a wealth of football knowledge that he could impart to his players. So, what’s a little yelling?\n\nBut then Roullier showed up for rookie mini-camp.\n\nCallahan, knees bent to observe his linemen up close, barked “Go!” at the top of his lungs. As Roullier completed one drill, Callahan quickly moved onto the next. Go. Go. Go.\n\n“It’s hard to fully describe until you’re actually here,” he said, “and you’re experiencing truly what he is.”\n\nWhen he recalls this instance, Roullier’s tone isn’t critical. Instead, he sounds thankful. Those grueling days, he said, taught him right away how tough you have to be to play in the NFL, how fast it moves.\n\n“It’s for good reason,” Roullier said.\n\nOver the past few days, the rest of the Redskins’ roster has started to learn how precise and demanding Callahan can be in lead up to Sunday’s game against the Miami Dolphins. Since replacing Jay Gruden, the 63-year-old interim coach has re-arranged the format of practice. The music that typically plays after the team’s stretch is gone. Players disperse to their drills. They run sprints after practice.\n\nEarlier this week, Callahan admitted taking over the Redskins is “different territory for me.” This isn’t the first time Callahan has been a head coach — he spent two years at the helm of the Oakland Raiders and another four in college at the University of Nebraska — but it has been more than 10 years.\n\nCallahan, though, never stopped thinking about his days as a head coach. He pondered what he could learn from those situations, what he could do differently the next time around. Even as a position coach, Callahan said he’d wonder what he would do if he were the head coach instead.\n\nThe reflection taught him patience.\n\n“I think that just comes with age,” Callahan said. “I’m just more patient, and I think coaching linemen (creates) that patience. … You can improve a player if you just try to find what it is he’s all about. And then try to find that avenue to connect with him and create that relationship so they can be successful.”\n\nCallahan says he’s at the “tail end” of his career. At 63, he’s now the fourth-oldest head coach in the NFL — trailing only Pete Carroll (68), Bruce Arians (67) and Bill Belichick (67).\n\nTo players inside the Redskins’ locker room, Callahan comes off as “old school.”\n\nLinebacker Jon Bostic smiled and started laughing, noting those types of coaches have certain ways of saying things to get a player’s attention.\n\nDefensive lineman Jonathan Allen said Callahan stuck out as a “guy that would fit into Alabama very well,” citing his mentality and work ethic.\n\n“He’s a very passionate, energetic coach who’s going to bring the physicality every day,” Allen said. “That’s the type of team we’re going to be on Sundays.”\n\nIn five-plus seasons, Gruden also stressed the importance of being physical, wanting his teams to dominate inside the trenches. But he went about practice differently, leading to criticisms the coach was too “laid back.”\n\nCritics viewed Gruden’s teams as sloppy, and Washington has committed the second-most penalties this season. Former receiver Pierre Garcon tweeted the Redskins needs a coach who is “accountable and holds everyone responsible.”\n\nCallahan appears to be trying to hold his players to that standard. Roullier said Callahan is making sure players understand where they need to be, adding “extra pressure” to be doing exactly the right thing at all times. “That’s really what he’s trying to change,” he said.\n\nPlayers will have to buy in. As Roullier acknowledged, the Redskins have a mix of young and older players, which means some of the veterans might not have been used to running gassers at the end of practice. Entering the season, the average Redskins player was just 26.1 years old — ranking 20th in the NFL.\n\nBut players will respect their head coach as long as he’s consistent in his approach, Roullier said.\n\nRight tackle Morgan Moses, who credits Callahan for his massive improvement from his first to the second year, said the coach’s attention to detail will make a difference.\n\n“The culture has to change,” Moses said, “but we also have the players in here to do it.”\n\nPart of that change is putting in more work. Typically when practice ends, the offensive line stays on the field for another extra 30 minutes of work, often being the last position group to return to the locker room.\n\nBut with Callahan in charge, every unit now has a “developmental period” to work with their position coaches.\n\nMoses laughed when asked if it was nice to see the other position groups working alongside the offensive line.\n\n“It was, man,” Moses said. “It was. It was. It was.”\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Over the past few days, the rest of the Redskins' roster has started to learn how precise and demanding Callahan can be in lead up to Sunday's game against the Miami Dolphins.", "authors": ["The Washington Times Http", "Matthew Paras"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/07/31/redskins_football_37030_c0-0-4372-2549_s1770x1032.jpg?b33b2e153034d230d36dd0d148d70ecb8f08041e", "published_at": "2019-10-10"}