{"pub": "huffpost", "url": "https://huffpost.com/entry/lawmakers-trump-administration-menstrual-products-migrant-women_n_5d7a9945e4b061a927a51d57", "downloaded_at": "2019-09-12 23:36:10.361862+00:00", "title": "Lawmakers Demand Trump Administration Provide Menstrual Products To Migrant Women", "language": "en", "text": "Lawmakers from the Congressional Hispanic Caucus urged the Trump administration on Thursday to provide adequate sanitary products to detained female migrants following reports that women were “visibly” bleeding through their pants in detention centers.\n\nDemocratic Reps. Raul Ruiz, Linda Sánchez and Joaquin Castro, chair of the CHC and the twin brother of presidential candidate Julián Castro, sent a letter to the Department of Homeland Security on Thursday afternoon demanding that U.S. Customs and Border Protection be stocked with proper menstrual products for migrant girls and women. The letter urges the administration to investigate these reports immediately.\n\n“It is the federal government’s responsibility to uphold the human dignity of all women throughout the detention process,” reads the letter, obtained exclusively by HuffPost.\n\n“All women in detention should have readily available personal hygiene products, such as soap and feminine hygiene products, as well as the ability to properly handle and dispose of them,” the letter continues. “Each woman should have access to a hand washing station and the opportunity to bathe every day in a private and secure manner.”\n\nThe demand comes two weeks after 19 states filed a lawsuit against the Department of Homeland Security that detailed horrifying conditions for young female migrants kept in detention centers near the U.S.-Mexico border. A 26-page investigation included in the lawsuit revealed that migrant teen girls had an extreme lack of access to menstrual products including pads and tampons.\n\nThe girls, interviewed by a civil rights attorney with Washington state Attorney General Bob Ferguson’s office, reported that they were only given one sanitary pad a day while on their periods. After that, the girls were often left to sit in soiled underwear and pants.\n\nAccording to the suit:\n\nAnother girl was detained for ten days and never offered a shower, even though she was on her period and was given only one sanitary pad a day. After a number of days, she summoned her courage and asked for a shower, and was given one. She recalls there was another girl at the facility who was also on her period. They were each given one sanitary pad per day. Although the guards knew they had their periods, they were not offered showers or a change of clothes, even when the other girl visibly bled through her pants. This girl had no choice but to continue to wear her soiled underwear and pants.\n\nRuiz described the treatment of menstruating migrant women as “inhumane” in a call with HuffPost on Thursday afternoon.\n\n“It’s intentionally degrading and cruel to treat menstruating women that way,” he said. “It’s a lack of human decency and a lack of humanity that must be corrected.”\n\nThe lawmakers point out in their letter a lack of feminine hygiene products can lead to health issues including a higher risk of contracting urinary tract infections and toxic shock syndrome. Poor hygiene from a lack of showers and hand washing stations, they added, can also lead to a breakout of infectious diseases like E. coli and norovirus.\n\n“We must continue to adhere to our humanitarian values as a nation by treating children and families with dignity,” the letter concludes. Read the full letter below:", "description": "Members of the Congressional Hispanic Caucus are calling for an investigation following reports that detained migrant women were \"visibly\" bleeding throu...", "authors": ["Women'S Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d7aaabd240000d32678c20a.jpeg?ops=1778_1000", "published_at": "2019-09-12"}