{"pub": "breitbart", "url": "https://breitbart.com/news/study-finds-footballers-3-5-times-more-likely-to-die-from-brain-trauma", "downloaded_at": "2019-10-21 13:17:51.177875+00:00", "title": "Study finds footballers 3.5 times more likely to die from brain trauma", "language": "en", "text": "London (AFP) – A new study carried out by Glasgow University has found former footballers are approximately three-and-a- half times more likely to die from neurodegenerative diseases than the general population.\n\nThe report, released on Monday was commissioned by England’s Football Association and the Professional Footballers’ Association to assess the medical records of 7,676 men who played professional football in Scotland between 1900 and 1976.\n\nTheir records were matched against more than 23,000 individuals from the general population, with the study led by consultant neuropathologist Dr Willie Stewart of Glasgow University.\n\nHis findings report that the “risk ranged from a five-fold increase in Alzheimer’s disease, through an approximately four-fold increase in motor neurone disease, to a two-fold Parkinson’s disease in former professional footballers”.\n\nAlthough footballers had higher risk of death from neurodegenerative disease, they were less likely to die of other common diseases, such as heart disease and some cancers, including lung cancer.\n\nThe study – titled ‘Football’s Influence on Lifelong Health and Dementia Risk’ found that deaths in ex-footballers were lower than expected up to age 70, and higher than expected over that age.\n\nDr Stewart said in a statement: “An important aspect of this work has been the ability to look across a range of health outcomes in former professional footballers. This allows us to build a more complete picture of health in this population.\n\n“Our data show that while former footballers had higher dementia rates, they had lower rates of death due to other major diseases.\n\n“As such, whilst every effort must be made to identify the factors contributing to the increased risk of neurodegenerative disease to allow this risk to be reduced, there are also wider potential health benefits of playing football to be considered.”\n\nEarlier this year, UEFA requested for a change in the game’s laws to reduce the pressure on the medical staff and give doctors more time to assess head injuries off the pitch, so that no concussed player returns to the field of play.\n\n“The whole game must recognise that this is only the start of our understanding and there are many questions that still need to be answered,” said FA chairman Greg Clarke said.\n\n“It is important that the global football family now unites to find the answers and provide a greater understanding of this complex issue. The FA is committed to doing all it can to make that happen.”\n\nOutgoing PFA chief executive Gordon Taylor has been strongly criticised for his lack of action on the subject, in particular by the family of former West Bromwich Albion striker Jeff Astle, whose 2002 death from chronic traumatic encephalopathy (CTE) was linked to repeatedly heading heavy leather footballs.\n\nTaylor said it was now “incumbent on football globally to come together to address this issue in a comprehensive and united manner”.\n\nHe added: “Research must continue to answer more specific questions about what needs to be done to identify and reduce risk factors.”", "description": "London (AFP) – A new study carried out by Glasgow University has found former footballers are approximately three-and-a- half times more likely to", "authors": [], "top_image": "https://media.breitbart.com/media/2019/10/wi/afp/21/8cbbb2_celtic-1967-european-cup-winning-captain-billy-mcneill-died-in-suffering-640x335.jpg", "published_at": "2019-10-21"}