{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-climate-change-mountain-summit-previe/world-unprepared-for-impact-of-climate-change-on-mountain-water-supplies-experts-idUKKBN1X81JZ", "downloaded_at": "2019-10-29 14:23:41.090744+00:00", "title": "World unprepared for impact of climate change on mountain water supplies - experts", "language": "en", "text": "GENEVA (Reuters) - The world faces increased flooding, droughts and possible conflicts due to the effects of climate change on fresh water supplies drawn from mountains but is “woefully unprepared” to tackle these risks, experts said.\n\nFILE PHOTO: People enter the Ice Cave, covered with material to prevent the ice from melting, at the Rhone Glacier at the Furka, Switzerland, August 21, 2019. REUTERS/Denis Balibouse/File Photo\n\nMountain-sourced water supplies, which provide about half of all drinking water worldwide, is becoming more unpredictable as warmer temperatures melt glaciers and change precipitation patterns and river levels, affecting countries unevenly.\n\nIn some areas, such as the Alps, extra water from glaciers has caused flash floods while shrinking snow cover in the Andes has led to droughts in places like Chile.\n\nScientists gathered for a “High Mountain Summit” at the World Meteorological Organization (WMO) in Geneva this week are seeking better cooperation between governments, researchers and space agencies.\n\n“We are woefully underprepared. Our infrastructure was built in the 19th and 20th centuries in the mountains and downstream of the mountains and we don’t have that climate any more,” said John Pomeroy, a professor at Canada’s University of Saskatchewan, who is co-chairing the event.\n\nSwitzerland, the host country, estimates that damage to its infrastructure, including railways, caused by climate change could cost 1 billion Swiss francs ($1 billion) a year. But many poorer countries experiencing similar challenges are unlikely to have funds on that scale to fix problems.\n\n“There are quite some gaps not only in the way our infrastructure has been designed but also the infrastructure we have in place to monitor for change,” said Carolina Adler, executive director of the Mountain Research Initiative at the University of Bern who is the summit’s other chair.\n\nTo cope with the effects of climate change on water systems, dams will have to be redesigned and irrigation systems overhauled, Pomeroy added.\n\nSENSITIVE DATA\n\nUnlike weather data, which U.N. member states have shared voluntarily with the WMO for decades, the pooling of data on water is in its infancy.\n\nOne challenge will be persuading governments to commit to share more information on hydrology. One official described this as “very sensitive”, with some governments deeming this a question of national security.\n\nAdler said cooperation was nonetheless required to avoid tensions — such as those between India and Pakistan over water supplies after New Delhi released water from a dam in August — and to avert conflict.\n\nThe summit is expected to create the Integrated High Mountain Observation and Prediction Project intended to help deal with hazards through early warning systems, according to a draft list of aims seen by Reuters.\n\nIt also urges greater collaboration between space agencies on satellite images of mountain areas.\n\n“We may decide that some communities are located in inherently dangerous situations and need to be moved and migration may be part of this, so these are very serious considerations,” said Pomeroy.", "description": "The world faces increased flooding, droughts and possible conflicts due to the effects of climate change on fresh water supplies drawn from mountains but is \"woefully unprepared\" to tackle these risks, experts said.", "authors": ["Emma Farge", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191029&t=2&i=1446189585&w=1200&r=LYNXMPEF9S125", "published_at": "2019-10-29"}