{"pub": "metro", "url": "https://metro.co.uk/2019/10/23/abducted-toddler-kamille-cupcake-mckinney-found-murdered-in-landfill-site-10969871", "downloaded_at": "2019-10-23 16:04:10.775938+00:00", "title": "Abducted toddler Kamille ‘Cupcake’ McKinney found ‘murdered’ in landfill site", "language": "en", "text": "Birmingham police said they found Kamille McKinney’s remains in a dumpster at a landfill near Warrior, Alabama. Authorities took 39-year-old Patrick Stallworth (pictured upper middle) and his girlfriend Derick Irisha Brown(Pictured upper right) into custody and said they plan to charge them with kidnapping and murder. (Picture: AP/Birmingham police Department)\n\nA three year-old toddler snatched by a stranger from a birthday party at her house has been found murdered and dumped in a landfill site, police say.\n\nKamille ‘Cupcake’ McKinney’s remains were found earlier this week, with Patrick Smith from Birmingham Police Department in Alabama announcing the grim find Tuesday night.\n\nSmith said that police are obtaining murder and kidnapping warrants for two people of interest, who he identified as 39-year-old Patrick Stallworth and his 29-year-old girlfriend, Derick Irisha Brown.\n\nAt the news conference, Smith said: ‘I wish I had all of you gathered here with good news. I wish I could share a high five or some other celebratory salutation, but I cannot.’\n\nAdvertisement\n\nAdvertisement\n\nMcKinney is believed to have been abducted on October 12 by two strangers who lured her away from a birthday party in Birmingham, Alabama.\n\n‘I brought you here today because the Birmingham Police Department, along with the FBI, have located the remains of a three-year-old child who we believe to be Kamille ‘Cupcake’ McKinney,’ Smith said.\n\nPolice had reportedly been sifting through approximately 12 tons of trash collected from the Birmingham area over the past several days during their search for McKinney, according to AL.com.\n\nHitman hires hitman who hires hitman who hires hitman who hires hitman who tells police\n\nBirmingham Mayor Randall Woodfin said: ‘This is a tough moment for this city. This is a tough moment for this family.’\n\nSmith said police took Stallworth and Brown into custody the day after McKinney disappeared from the birthday party at the Tom Brown Village public housing community.\n\nAuthorities also impounded Stallworth’s Toyota SUV after investigators said he was identified on surveillance cameras from a nearby store at the time of the youngster’s abduction. They have yet to offer a possible motive for the suspected murder.\n\nBirmingham Police said Stallworth was seen at a nearby convenience store around the time of the kidnapping. (Picture: Birmingham police department)\n\nThe SUV reportedly matched the description given from other children at the party, who said that a stranger had been offering candy to kids in the area.\n\nEmory Anthony, Stallworth’s attorney, has previously said his client has an alibi for the time police believe McKinney was abducted.\n\nPolice 'solve' 1984 sex murder of teenager...then discover 'killer' is already dead\n\nStallworth was originally charged with seven counts of child pornography after police said they found multiple images on his phone.\n\nAdvertisement\n\nAdvertisement\n\nAuthorities said none of the pictures were of Kamille. He was released on $500,000 bond, but police took him back into custody on Tuesday night.\n\nBrown was held on a bond revocation from a previous kidnapping case involving her children, however her lawyer, Adam Danneman, has said his cliend ‘adamantly denies’ knowing anything about McKinney’s disappearance.", "description": "Kamille 'Cupcake' Mckinney's body was reportedly found in a dumpster at a landfill near Warrior, Alabama.", "authors": ["Jacob Geanous"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/comp-1571834211_1571835291.png?w=1200&h=630&crop=1&quality=90&strip=all&zoom=1&ssl=1", "published_at": "2019-10-23"}