{"pub": "dailymail", "url": "https://dailymail.co.uk/femail/article-7555637/The-five-major-differences-Kate-Middleton-Meghan-Markles-style.html", "downloaded_at": "2019-10-10 18:59:01.514155+00:00", "title": "The five major differences between Kate Middleton and Meghan Markle's style", "language": "en", "text": "There is no denying the influence of the ladies in the British royal family.\n\nLabels see an instant boost in their sales and exposure after Catherine Middleton and Meghan Markle wear their clothes.\n\nThey don't call it the Kate Effect and the Markle Sparkle for nothing!\n\nWhile on royal business, both ladies represent the monarchy with their own very unique styles. FEMAIL reveals the five distinct differences between the fashion choices of the Duchess of Cambridge and the Duchess of Sussex.\n\nOpposites: While on royal business, the Duchess of Cambridge and the Duchess of Sussex represent the monarchy with their own very unique styles\n\nBridal bliss: Their well-defined differences were apparent even when the two women walked down the aisle\n\nVERY DIFFERENT BRIDES\n\nTheir well-defined differences were apparent since they walked down the aisle.\n\nKate stole the show in a long sleeve gown by English designer Sarah Burton, creative director of the luxury fashion house Alexander McQueen.\n\nThe lace appliqué bodice was made by hand and inspired by the Victorian tradition of corsetry; it narrowed at the waist creating a figure flattering hourglass silhouette.\n\nThe future queen's dramatic entrance was made complete with a train that was nearly nine-feet-long.\n\nWhile many hoped Megan would have taken inspiration from the jaw-dropping gowns of her sister-in-law or her late mother-in-law Princess Diana, she tied the knot in a simple, pure white gown by British designer Clare Waight Keller, the artistic director of French fashion house Givenchy.\n\nThe haute couture creation (which was criticized for being ill-fitted) featured a no-frills boat neckline and three-quarter length sleeves.\n\nWhat it lacked in wow-factor, it made up for in sentiment with her cathedral-length veil featuring floral detail representing all 53 countries of the Commonwealth.\n\nJaw-dropping: Kate stole the show in a long sleeve gown by English designer Sarah Burton, creative director of the luxury fashion house Alexander McQueen\n\nBasic: Meghan tied the knot in a simple, pure white gown by British designer Clare Waight Keller, the artistic director of French fashion house Givenchy\n\nUSE OF COLOR\n\nThey say dress for the job you want...\n\nIt's not a coincidence that Queen Elizabeth II steps out in bright colors.\n\nThe 93-year-old's affinity for coats and hats in matching bold hues is a calculated style move so that the crowds of people can see her.\n\nKate seems to be preparing for her future role by regularly stepping out in all colors of the rainbow.\n\nWith a more relaxed and edgy approach to style, Megan favors neutral shades like black, grey, navy and dark green.\n\nWhile muted hues could be what the former actress is most comfortable in, the lack of color could also be her attempt to not draw attention to herself.\n\nFuture queen: Kate seems to be preparing for her soon-to-be role by regularly stepping out in all colors of the rainbow\n\nPrepping for her future role: Kate looks very comfortable in vibrant colors\n\nSoft and subtle: With a more relaxed and edgy approach to style, Megan favors neutral shades like black, grey and dark green\n\nSoft and subtle: While muted hues could be what the former actress is most comfortable in, the lack of color could also be her attempt to not draw attention to herself\n\nPRINTS VS. SOLIDS\n\nWhile Kate shows herself to be much more proper and reserved than Meg, the 37-year-old takes more fashion risks, while still adhering to all the royal rules and codes, without fail.\n\nWhether she's attending a black-tie dinner or dropping her children off at school, the mother-of-three isn't afraid to don wild patterns and prints.\n\nMeg, 38, tends to play is safe in solids, even though she has been known to push back on a few of the many royal rules.\n\nOutside the box: While Kate shows herself to be much more proper and reserved than Meg, the 37-year-old takes more fashion risks\n\nBeyond the basics: Whether she's attending a black-tie dinner or dropping her children off at school, the mother-of-three isn't afraid to don wild patterns and prints\n\nPractical: Meg, 38, tends to play is safe in solids, even though she has been known to push back on a few of the many royal rules\n\nOn trend: The Duchess of Sussex takes a modern approach to her dressing in a black jumpsuit\n\nFeminine: Conservative with her fashion choices, it's no surprise that the Duchess of Cambridge favors ladylike A-line dresses that hit just above the knee\n\nAlways a lady: Kate shows off her legs in A-lines while still adhering to the modest royal hemline dress code\n\nCONSERVATIVE VS. MODERN\n\nMeghan clearly takes a much more modern approach to dressing than Kate.\n\nConservative with her fashion choices, it's no surprise that the Duchess of Cambridge favors ladylike A-line dresses that hit just above the knee.\n\nWhile Meghan, who had her first child 5 months ago, has grown very fond of the shirt dress as of late, wearing at least three during the 10-day royal Africa tour.\n\nThe casual button down frock features a tie-belt that creates the perfect hourglass silhouette.\n\nIt's modest midi-length hemline is practical and conservative, and conforms to the royal dress code.\n\nShirt dresses have become a staple with the fashion set, as the easy breezy garment screams professional and party-ready!\n\nThough conservative, Kate surprises us. She wowed the crowd at the Natural History Museum in London this week looking put-together and on-trend in a pair of olive culottes.\n\nShe teamed the cropped bottoms with a burgundy knit sweater. It was an unexpected ensemble that really worked.\n\nMeg sticks to classics like black pants or blue jeans, that she effortlessly pairs with wardrobe staples, including button down blouses.\n\nTrendy: Meghan clearly takes a much more modern approach to dressing than Kate\n\nFigure flattering: Meghan, who had her first child 5 months ago, has grown very fond of the shirt dress. It's modest midi-length hemline is practical and conservative, and conforms to the royal dress code\n\nAccentuating her shape: The button down frock features a tie-belt that creates the perfect hourglass silhouette\n\nWearing the pants: Kate recently stepped out in an unexpected look that consisted of olive culottes and a burgundy knit, while Meghan sticks to classics like black slacks and button down blouses\n\nA TOUCH OF SPARKLE\n\nMegan generally leans towards delicate pieces of sentimental jewelry.\n\nShe's most often decorating her lobes with small earrings, she wore a Jennifer Meyer 'mummy' necklace to her baby shower in New York and then later a necklace by the same designer featuring three stones commemorating her new family.\n\nIn addition to her wedding bands made from Welsh gold, the Duchess often stacks dainty rings from high and low-end labels, including Brooklyn-based brand Catbird.\n\nKate favors timeless statement pieces.\n\nWhen she's not donning diamond heirlooms from the royal vault, she favors drop earrings and her 12-carat, oval sapphire surrounded by 14 solitaire diamonds engagement ring that once belonged to Princess Diana.\n\nDainty: Megan generally leans towards delicate pieces of sentimental jewelry", "description": "FEMAIL reveals the five distinct differences between the fashion choices of the Duchess of Cambridge, Kate Middleton and the Duchess of Sussex, Meghan Markle.", "authors": ["Pandora Amoratis For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/10/17/19548774-0-image-a-94_1570724419569.jpg", "published_at": "2019-10-10"}