{"pub": "afr", "url": "https://afr.com/companies/retail/coles-brings-touch-of-glass-to-collectables-war-with-woolworths-20191014-p530ei", "downloaded_at": "2019-10-15 08:01:08.631488+00:00", "title": "Coles brings touch of 'glass' to collectables war with Woolworths", "language": "en", "text": "\"We certainly think it will help.\"\n\nChristmas contagion\n\nColes is due to release September quarter sales on October 29. Analysts believe same-store sales fell about 1 per cent in the three months ending September after rising 5.1 per cent in the year-ago period, when Coles launched its highly successful Little Shop miniature plastic groceries promotion.\n\nColes attempted to replicate the success of that promotion, launching Little Shop 2 in mid-July, but the program was largely neutralised by Woolworths' popular Lion King Ooshies promotion, which was quickly followed by Discovery Garden seedling kits.\n\nMr Cain said Coles' new Christmas private label range was designed to reflect the \"tale of two cities\" in supermarkets and meet the needs of budget-conscious shoppers looking for value and wealthier consumers prepared to pay for convenience and premium products.\n\n\"For us it's all about value but even at the premium end they're still below the price you'd see in specialist shops,\" he said, citing Italian panettone ranging from $4 to $25.\n\nThe range of almost 250 new festive season products includes entry level goods to premium items such as Coles Finest melting chocolate pudding, sloe gin mince pies, salmon pastrami and semi-boneless crackling ham.\n\nThe Christmas range reflect Coles' private label \"powerhouse\" strategy, under which the retailer is aiming to lift house brands from about $10 billion in annual sales or 30 per cent of total sales to 40 per cent of sales.\n\nAdvertisement\n\nColes hopes the Christmas range has a \"halo\" effect and boosts sales of private label products year-round.\n\nMr Cain said stimulus in the form of record low interest rates and tax cuts had had no impact on sales of discretionary items in Coles.\n\n\"We wouldn't necessarily expect to [see an impact] – that's the beauty of Coles, of course. It's a resilient business day in day out.\"\n\nColes shares have risen 30 per cent this year, boosted by demand from investors seeking defensive stocks with attractive dividend yields.", "description": "The retailer's latest collectables program is aimed at adults rather than children.", "authors": [], "top_image": "https://static.ffx.io/images/$zoom_0.5431%2C$multiply_0.7554%2C$ratio_1.777778%2C$width_1059%2C$x_1209%2C$y_543/t_crop_custom/e_sharpen:25%2Cq_85%2Cf_auto/1ebb2cf7c99f6a0b372facfe1e8eb3f882e15346", "published_at": "2019-10-14"}