{"pub": "politico", "title": "Why these Democrats want to make a trade deal with Trump", "url": "https://politico.com/story/2019/08/31/democrats-trade-trump-1691486", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-02 07:16:25.771586+00:00", "text": "Rep. Abigail Spanberger. | Win McNamee/Getty Images congress Why these Democrats want to make a trade deal with Trump With trade tensions continuing and 2020 looming, some House Democrats are growing antsy to see congressional action on the deal to replace NAFTA.\n\nBLACKSTONE, Va. — Rep. Abigail Spanberger squinted into the August sun as the farmer beside her laid out how his profits on corn and soybeans are sinking — and how he believes passing President Donald Trump’s new North American trade agreement could help.\n\nSpanberger and other moderate freshman Democrats who flipped Republican districts to hand their party the majority in 2018 could be key to getting a vote on the U.S.-Mexico Canada Agreement this year. And even though that would give Trump a policy victory heading into the 2020 election, members of this group are beginning to put increasing pressure on House Speaker Nancy Pelosi to bring the measure to the floor as they head back from a summer recess spent talking to impatient constituents.\n\nStory Continued Below\n\n“If we’re not seeing progress, if we’re not seeing the implementation documents by October, I think that’s a serious, serious problem,” Spanberger told POLITICO at the tail end of a two-day swing through her district’s rural areas, where she heard from farmers pleading for relief from trade policies that have gutted their profits.\n\nThe issue will crystalize the divide between moderates in the Democratic caucus and progressives who are loath to give Trump a policy win when Congress returns to work in September. Pelosi has bought time by setting up a working group to negotiate possible changes to the agreement to replace NAFTA that the Trump administration struck with Canada and Mexico earlier this year. But Spanberger and others like her are growing increasingly eager to move forward.\n\nOnce the House reconvenes Sept. 9, lawmakers will have just 13 legislative days on Capitol Hill before taking another two-week break — meaning the next several weeks could prove crucial to the pact's fate.\n\nPOLITICO Playbook newsletter Sign up today to receive the #1-rated newsletter in politics Email Sign Up By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nIndustries from big business to farming and auto manufacturing are pressing Congress to pass the deal and provide a shred of certainty amid a volatile trade environment. Trump’s spat with China and off-the-cuff tariff announcements are causing much of the anxiety over trade, but Canada and Mexico are now the United States' biggest trading partners, and locking in the new North American deal could go a long way toward boosting morale among exporters and importers and sparking new investments, supporters say.\n\n“Any good trade deal, I want it passed,” 34-year-old John Shepherd said as he and Spanberger stood on his Virginia farm between the cornfields and the grain bins storing the crop he’s been unable to sell. The USMCA, he said, is “better than what we’ve had.”\n\nFor now, most Democrats, including Pelosi, maintain that the goal is to “get to yes” on the deal, but they still need to see stricter labor and environmental standards and changes to the language surrounding prescription drug pricing.\n\nBut some more moderate Democrats have already begun to speak out in favor of moving forward. Fourteen House Democrats sent a letter to Pelosi just before the summer recess urging continued discussions throughout August “to ensure a vote on a bipartisan agreement by the end of this year.”\n\n“I think that there’s room to move, but we need to see it keep moving,” said Rep. Lizzie Fletcher (D-Texas), a freshman who signed the letter. “The sooner we can work through these things and get to certainty, I think there’s a real benefit to everyone.”\n\n“Once we start getting into September and there doesn’t seem to be a light at the end of the tunnel, that’s going to cause a lot of concern for me,” added Rep. Anthony Brindisi, a freshman who narrowly beat the Republican incumbent in his upstate New York district last year.\n\n“Is this deal perfect? Absolutely not,” Brindisi said in a phone interview. “But we have to move forward before we close off these markets.”\n\nThe politics are tricky for Democrats. Even as some begin to push for a vote, scores of others are vowing to stay opposed until they see sweeping changes. The more than 90-member Congressional Progressive Caucus came out against the current version of the agreement in March, calling the pharmaceutical provisions in particular “very egregious.”\n\nRep. Lizzie Fletcher. | John L. Mone/AP Photo\n\nSome Democrats are also asking for modifications to be written into the core text of the agreement — a tall order, especially given that Mexico has already approved the deal as written.\n\nAnd while Pelosi does not need her entire caucus to back the deal, she is highly unlikely to allow a vote until at least a broad swath of Democrats are on board, legislative aides and political strategists say.\n\n“She doesn’t need a majority of the majority,” said John Michael Gonzalez, a former Democratic House staffer who is now a lobbyist at Peck Madigan Jones. “She could use anything between 80 to 100 votes.”\n\nRepublicans have already sought to pin the blame for any delays squarely on the opposing party. The Senate GOP, for example, posted from its official Twitter account over the August recess calling House Democrats “the final hurdle delaying the benefits of this America-first trade agreement.”\n\nAnd Vice President Mike Pence, who has been traveling the country touting the benefits of the deal, has pinpointed districts led by potentially vulnerable Democrats whom lobbying groups have targeted as possible yes votes. During a trip to central Utah last month in Rep. Ben McAdams’ district, Pence appealed directly to the freshman Democrat, another one of the 40 who flipped his seat in 2018 to give his party the majority.\n\n“Congressman McAdams, who’s in the majority in the Congress today, I’m going to ask you favor,” the vice president said in South Jordan. “When you get back to Washington, D.C., tell Speaker Pelosi to put the USMCA on the floor, and tell her that Utah and America need the USMCA this year.”\n\nThe end of 2019 has become an informal deadline to get the deal approved amid concerns that it will get lost in the noise of the presidential election if it bleeds into 2020. But the campaign itself could add to pressure for action sometime over the fall, as Democrats seek to defend their House majority.\n\n“The strategic premise we’re operating under is if you are a Democrat in a highly competitive district, you are looking for at least one bipartisan vote that you can point to to burnish your independent credentials,” said Phil Cox, a longtime GOP operative who now co-chairs the bipartisan Trade Works for America coalition, which is pushing for passage of the USMCA.\n\nCox’s group, which he co-leads with former Democratic Sen. Heidi Heitkamp, has pulled together a “target list” of nearly 100 members, mostly Democrats, who could be persuaded to support the deal largely because their seats are highly competitive and a vote in favor could help win over constituents.\n\n“It’s very helpful to be able to say, look, I didn’t agree with the president of the other party, I may not like him, but when there were issues that I thought were good for workers and small business and farmers in my district, I crossed the aisle and supported it,” Cox said.\n\nTheir message, in many areas, is starting to break through.\n\n“We have to get to a place where we have certainty through trade agreements,” Spanberger told POLITICO. “USMCA as it’s in its current form would be really good for dairy farmers. It would be good for a lot of our agricultural communities. It’s good for labor.”", "description": "With trade tensions continuing and 2020 looming, some House Democrats are growing antsy to see congressional action on the deal to replace NAFTA.", "authors": ["Megan Cassella"], "top_image": "https://static.politico.com/bc/48/f43712e6440b9a7b614f19e653bf/190830-abigail-spanberger-gty-773.jpg"}