{"pub": "cryptonews", "url": "https://cryptonews.com/news/how-is-htc-s-exodus-1s-cryptophone-different-from-its-exodus-4899.htm", "downloaded_at": "2019-10-21 11:28:58.337500+00:00", "title": "How is HTC’s Exodus 1s Cryptophone Different from its Exodus 1", "language": "en", "text": "Source: HTC\n\nA Taiwanese tech giant, HTC, came out with a new rendition of their blockchain-powered smartphone Exodus 1. Let’s check out what differentiates the two models.\n\nHTC launched its Exodus 1s on October 19th at Berlin’s Lightning conference, but only in Europe and a few other countries. As a reminder, HTC partnered up with Kyber Network (KNC), an Ethereum-based protocol, and gave the Cryptoverse its first native web 3.0 blockchain phone, what it calls a ‘Cryptophone,’ back in December 2018. The company explained that the phone combines the usability of the smartphone with the security of a hardware wallet, and includes the built-in Zion Vault app and the ability to directly swap between more than sixty major cryptocurrencies without leaving the wallet. Also, there’s the support for Bitcoin Cash (BCH) added last month. So what’s the difference between the two versions now on the market?\n\nAvailability\n\nThough the goal of this phone seems to be to boost the crypto adoption, Exodus 1s is not available in all countries in the world, specifically in the U.S. and most of Asia. According to HTC’s blog post, you can buy it in Europe, Taiwan, Saudi Arabia, and the United Arab Emirates for now, while other territories will be announced later. Furthermore, in some areas, as the United Kingdom site currently says for example, both Exodus 1 and 1s models are out of stock.\n\nPrice\n\nExodus 1s is the budget version of Exodus 1, meaning that you can get it for more than half the price. Though some adjustments to the price have been made, given the crypto market’s crash at the end of 2018, Exodus 1 is priced at USD 699. On the other hand, should you go for the 1s, it will cost you EUR 219 (USD 244). You can, of course, pay the equivalent price in crypto instead, with BTC, ETH, LTC, BNB, or BCH. “The EXODUS 1s will provide an opportunity for users who want to dip their toes into the crypto world and harness the powers of blockchain technology at the more accessible price point,” the company says.\n\nNovelties\n\nGood news is that the 1s comes with much-needed buy, sell, send, receive, trade, lend and borrow options, via its hardware wallet, but also the Bitcoin (BTC) full node capability – which is software that allows devices to verify and process blocks in the Bitcoin network, thus allowing you to keep the entire Bitcoin ledger in its memory. To achieve the all-in-one bank goal, the statement says, through the Zion Vault and with the addition of a 400GB micro SD card, which needs to be bought separately, users will be able to natively operate a full Bitcoin node on their Exodus 1s. It will likely drain your battery though, so stay connected to a power source while running the node, and it might be a lot to take for the older chipset, but we’ll have to wait and see how it goes.\n\nSpecs\n\nOther specs are different as well, and some are not particularly impressive, which is fine given that we’re talking about a budget device and that we just need it to work well. Exodus 1s comes with a 5.7 inch HD+ screen (compared to 1’s 6.0 inch Quad HD+), a Snapdragon 435, Android 8.1, a microUSB port, and 4GB of RAM and 64GB of storage, which is a welcomed detail, as is a 3.5 mm audio jack. You can check out the other specs and compare them to Exodus 1’s on HTC’s website.\n\nExodus 1 Exodus 1s 6” display Quad HD 5.7” HD+ display 12MP + 16MP rear camera with high quality zoom 13MP rear camera with PDAF 8MP + 8MP front camera with natural Bokeh 13MP front camera with LED flash light Snapdragon™ 845 Snapdragon™ 435 6GB RAM + 128GB storage 4G RAM + 64GB storage 3500mAh battery QC 3.0 3000mAh battery\n\nWhat do you think of the new Cryptophone?", "description": "A Taiwanese tech giant, HTC, came out with a new rendition of their blockchain-powered smartphone Exodus 1. Let’s check out what differentiates the two models.", "authors": ["Sead Fadilpašić"], "top_image": "https://cimg.co/w/articles/0/5da/d9093a7983.png", "published_at": "2019-10-21"}