{"pub": "guardian", "url": "https://theguardian.com/football/2019/oct/28/southampton-players-donate-wages-to-charity-after-leicester-mauling", "downloaded_at": "2019-10-28 13:17:56.888409+00:00", "title": "Southampton players donate wages to charity after 9-0 mauling by Leicester", "language": "en", "text": "• Home defeat equalled biggest in Premier League history • One day’s salary will be donated to Saints Foundation\n\nSouthampton’s players and coaching staff will each donate one day’s wages to the Saints Foundation, the club have announced,after Friday night’s 9-0 home humiliation to Leicester which equalled the record score in Premier League history.\n\nVardy and Pérez hat-tricks see Leicester smash nine against Southampton Read more\n\nThe club said in a statement: “Southampton Football Club’s first-team players and coaching staff have announced they will be donating their wages from last Friday to Saints Foundation.\n\n“The squad has been in at Staplewood Campus throughout the weekend, working on putting things right for the club’s supporters.\n\n“As the first step towards that, the group has decided that they wish to donate their wages from the day of the Leicester game to Saints Foundation, in order to help the vital work that is conducted by the charity.”\n\nThe Saints Foundation works with children, young people and at-risk adults in the Southampton area to develop their potential and transform lives.\n\nSouthampton are currently bracing themselves for two consecutive trips to face Manchester City within the next six days, in the Carabao Cup on Tuesday and then in the Premier League on Saturday.", "description": "Southampton’s players and coaching staff will each donate one day’s wages to the Saints Foundation", "authors": ["Pa Media"], "top_image": "https://i.guim.co.uk/img/media/95aa338a3b3bd928ee6347c3888c65131fd64215/0_67_3500_2100/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=738ca23e53ff66d7b7aa573230ffd011", "published_at": "2019-10-28"}