{"pub": "yahoo", "url": "https://news.yahoo.com/trump-hasn-t-endorsed-turks-215228781.html", "downloaded_at": "2019-10-07 23:38:29.444543+00:00", "title": "Trump Sows Turkey Chaos as U.S. Denies Endorsing Syria Incursion", "language": "en", "text": "(Bloomberg) -- President Donald Trump hasn’t endorsed a Turkish incursion into Syria, a senior administration official said, deepening confusion around his policy after an uproar from Republicans that he planned to abandon U.S. Kurdish allies.\n\nThe official said Trump has cautioned Turkish President Recep Tayyip Erdogan that he will bear responsibility for Islamic State prisoners in the region, as well as a resurgence of violence if the militants are freed and any harm to civilians in areas Turkey occupies.\n\nThe official briefed reporters on condition of anonymity.\n\nTrump later suggested his move to clear the way for a Turkish invasion was intended in part to pressure European countries including France and Germany that, he said, have refused to accept the return of citizens who joined Islamic State.\n\nTrump said at a meeting with military leaders that he had urged U.S. allies to reclaim their citizens, but they had refused.\n\n“We’re not going to move the fighters to Guantanamo Bay and take care of them for many, many years into the future, that’s not for us,” he said. “Now it’s time for Germany and France and all of the nations where they came from to take them back and they chose no. Maybe they’re going to change their tune now, I don’t know.”\n\nTrump has come under criticism from allies including Republican Senator Lindsey Graham of South Carolina and his former United Nations ambassador, Nikki Haley, for his announcement late Sunday that the U.S. wouldn’t stand in the way of the Turkish incursion.\n\nThe White House statement was read around the world as Trump abandoning U.S. policy that Kurdish allies would be protected from Turkish aggression in exchange for their help in defeating Islamic State.\n\nFormer Vice President Joe Biden, who is among the top Democratic contenders to challenge Trump’s re-election in 2020, said in a statement that “once again, an impulsive and erratic president has abandoned friends of the United States with a late-night tweet.”\n\nAmerican officials didn’t immediately explain the president’s change in position on Syria.\n\nTrump’s order to remove about 50 U.S. troops from a Syria border region Turkey intends to invade doesn’t represent a green light for the incursion, the U.S. official said. The official added that Trump had discussed the decision with officials at the State Department and Pentagon before the White House announcement, and that the agencies should not have been surprised.\n\nThe U.S. had successfully dissuaded Turkey from an invasion for two years, but if Erdogan orders an operation, the U.S. doesn’t want its soldiers endangered or caught in the crossfire, the official said.\n\nI’ve told President Erdogan, I hope he’s going to treat everybody with great respect,” Trump said at the meeting with military leaders. Earlier, he told reporters at the White House: “I have consulted with everybody.”\n\n“I fully understand both sides of it but I campaigned on the fact I was going to bring our soldiers home,” he said.\n\nThe administration official did not say that any U.S. soldiers would be brought home as a result of the withdrawal. The troops moved from the border region, mostly special forces soldiers, would be re-positioned at different U.S. bases in Syria, the official said.\n\n(Updates with more Trump remarks, beginning in fourth paragraph)\n\nTo contact the reporters on this story: Josh Wingrove in Washington at jwingrove4@bloomberg.net;Justin Sink in Washington at jsink1@bloomberg.net\n\nTo contact the editors responsible for this story: Alex Wayne at awayne3@bloomberg.net, John Harney\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- President Donald Trump hasn’t endorsed a Turkish incursion into Syria, a senior administration official said, deepening confusion around his policy after an uproar from Republicans that he planned to abandon U.S. Kurdish allies.The official said Trump has cautioned Turkish President Recep", "authors": ["Josh Wingrove", "Justin Sink"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-07"}