{"pub": "thestreet", "url": "https://realmoneypro.thestreet.com/investing/stocks/there-s-a-bright-side-to-wednesday-s-decline-15113171", "downloaded_at": "2019-10-03 07:06:16.171259+00:00", "published_at": "2019-10-02", "title": "There's a Bright Side to Wednesday's Decline", "language": "en", "text": "There will be some screaming headlines Wednesday night about the drop in the major indexes, but from a trading standpoint, it is probably a positive development.\n\nThe S&P 500 lost about 1.6% and the Dow Jones industrial average took a healthy hit of 1.85%. Breadth was 1,875 gainers to 5,550 decliners, but there was only about 300 stocks making new 12-month lows.\n\nIf you have been paying attention to the underlying action in the market for the last couple weeks, this drop should not come as a major surprise. As has been noted here numerous times, the action in individual stocks has been abysmal, while the indexes have been held up by hope for progress on China trade, friendly central banks and a few other headlines.\n\nThe indexes have been surprisingly sedate, despite some major news flow as well as a major sector rotation and destruction of the IPO market. Many individual stocks are already deep into bear market territory. It is tough for these stocks to bottom, until there is widespread correction action that shifts the mood and causes some real worry and despair.\n\nThe action Wednesday was mainly about the indexes catching up to elements of the market that have already been anticipating a slower economy, difficulty on China trade and the endless political drama. Many fund managers have already moved out of the riskier momentum names, but that action was largely hidden by the indexes.\n\nThis disconnect between the indexes and many individual stocks will make for some interesting trading in the near-term. It is tough for individual stocks to bounce when the indexes are hit, but as we head into earnings season, there will be more focus on the individual merits of stocks.\n\nThere was some stabilization in the worst-hit small caps and biotechnology, but that doesn't mean that it's a good idea to jump in. The indexes are clearly undergoing a correction and that will prevent much counter-trend movement from building.\n\nOut of chaos comes opportunity and we have plenty of chaos in this market right now. Many people have been looking for some corrective action, but few have envisioned it will play out the way it has.\n\nHave a good evening. I'll see you Thursday.", "description": "If you've been paying attention to the underlying action in the market lately, this drop in the indexes should not come as a major surprise.", "authors": ["James", "Rev Shark", "There'S A Bright Side To Wednesday'S Decline", "If You'Ve Been Paying Attention To The Underlying Action In The Market Lately", "This Drop In The Indexes Should Not Come As A Major Surprise.", "Jim Cramer", "Bruce Kamich", "Bob Lang", "Paul Price", "Doug Kass"], "top_image": "http://s.thestreet.com/files/tsc/v2008/photos/contrib/uploads/803abb30-5303-11e8-8b44-5b7c3d917143.png"}