{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7573401/ABC-News-apologizes-errant-video-claimed-Turkish-attack-Syrian-Kurds.html", "downloaded_at": "2019-10-15 08:04:50.073557+00:00", "title": "ABC News apologizes over errant video it claimed was a Turkish attack on Syrian Kurds", "language": "en", "text": "ABC News has acknowledged that a video it aired claiming to show a Turkish attack against Kurds in northern Syria was in fact old footage from a 2017 gun show in Kentucky.\n\nThe clip aired on ABC’s World News Tonight on Sunday and on Monday’s Good Morning America.\n\n‘This video, right here, appearing to show Turkey’s military bombing Kurd civilians in a Syrian border town,’ ABC World News Tonight anchor Tom Llamas said on Sunday’s broadcast.\n\nThe clip, which had the caption ‘SLAUGHTER IN SYRIA’ in the foreground, shows massive explosions and balls of fire light up the night sky as bullet traces whiz by.\n\nAn ABC News segment from Sunday's World News Tonight broadcast included a video that the network now acknowledges was not footage from northern Syria as it claimed. Tom Llamas, the ABC News moderator, is seen on the Sunday broadcast\n\nDuring Sunday's broadcast, ABC News showed footage it claimed was of Turkey's military offensive against Kurds in northern Syria\n\nA side-by-side comparison showed that the video aired by ABC News was not from Syria but was a 2017 clip from a weapons exhibition in Kentucky\n\nThe network acknowledged the error in a statement posted to social media on Monday\n\nABC claimed that the footage was shot on Friday in northern Syria.\n\nBut the news site Gizmodo found that the video is actually from a military gun exhibition that took place in Kentucky in 2017.\n\nThe original video was posted to YouTube under the heading Knob Creek night shoot 2017.\n\nIt refers to the Military Gun Shoot & Military Gun Show, a biannual event held at Knob Creek Gun Range in West Point, Kentucky.\n\nFor a fee, the public can watch weapons fired at night at the event, which is held in April and October.\n\nA side-by-side view of both ABC’s video and the original 2017 video shows that the footage is identical.\n\nABC News apparently used an edited version of the Kentucky footage, which includes shots of the audience using cell phones to record the weapons show.\n\n‘We’ve taken down video that aired on “World News Tonight Sunday” and “Good Morning America” this morning that appeared to be from the Syrian border immediately after questions were raised about its accuracy. ABC News regrets the error,’ the network said in a statement.\n\nABC’s error has already given fodder to conservative critics of the mainstream press, which has been accused of a liberal bias.\n\nPresident Trump, who has made criticism of the media a central theme of his political career, tweeted on Monday: ‘A big scandal at ABC News. They got caught using really gruesome FAKE footage of the Turks bombing in Syria. A real disgrace.\n\nConservatives, led by President Trump, mocked ABC News for the error on Monday\n\nJack Posobiec posted a GIF of a scene from one of the Star Wars films under the caption: 'New footage of Turkish army crossing the Syrian border from ABC'\n\nAnother Twitter user posted a GIF that appears to be from Lord of the Rings under the caption: 'New footage of escaped ISIS fighter ready for battle from ABC'\n\nAnother Twitter user posted a GIF showing an actual turkey attacking a young boy under the caption: 'HEADLINE: Turkey Attacks Kurds...exclusive ABC News embedded reporter'\n\nAnother Twitter user posted an image showing a scene from the Civil War with the caption: 'ABC News \"The Syrian frontline\"'\n\n'No wonder Americans don't trust the mainstream media,' tweeted one Twitter user\n\nAlana Mastrangelo tweeted: 'I can't believe ABC News aired a video from a Kentucky gun range demonstration and passed it off as \"slaughter in Syria\" footage, twice...Actually, I can'\n\n‘Tomorrow they will ask softball questions to Sleepy Joe Biden’s son, Hunter, like why did Ukraine & China pay you millions when you knew nothing? Payoff?’\n\nHunter Biden will break his silence and appear on ABC's 'Good Morning America' Tuesday in an interview where 'no questions were off limits,' the network announced Monday morning.\n\nBiden, the youngest son of former Vice President Joe Biden, spoke with ABC's Amy Robach over the weekend at his home in Los Angeles.\n\nIt's Hunter Biden's first time speaking in public since impeachment proceedings began against President Trump for soliciting Ukraine's help in investigating the Bidens for work Hunter did for a Ukrainian gas company.\n\nTrump is under fire from both Democrats and Republicans for removing American soldiers from the Kurdish-controlled areas of northern Syria, allowing for Turkey to launch a military offensive.\n\nOther conservatives had a field day on Twitter mocking ABC News for its error.\n\nJack Posobiec posted a GIF of a scene from one of the Star Wars films under the caption: 'New footage of Turkish army crossing the Syrian border from ABC.'\n\nAnother Twitter user posted a GIF that appears to be from Lord of the Rings under the caption: 'New footage of escaped ISIS fighter ready for battle from ABC.'\n\nAnother Twitter user posted a GIF showing an actual turkey attacking a young boy under the caption: 'HEADLINE: Turkey Attacks Kurds...exclusive ABC News embedded reporter.'\n\nAnother Twitter user posted an image showing a scene from the Civil War with the caption: 'ABC News \"The Syrian frontline\".'", "description": "'This video, right here, appearing to show Turkey's military bombing Kurd civilians in a Syrian border town,' ABC World News Tonight anchor Tom Llamas said on Sunday's broadcast.", "authors": ["Ariel Zilber For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/03/19719158-0-image-a-2_1571107068821.jpg", "published_at": "2019-10-15"}