{"pub": "yahoo", "url": "https://news.yahoo.com/saudi-arabia-eases-restrictions-women-094151273.html", "downloaded_at": "2019-10-06 11:36:58.647958+00:00", "title": "Saudi Arabia eases restrictions on women taking hotel rooms", "language": "en", "text": "DUBAI, United Arab Emirates (AP) — Saudi Arabia has lifted some restrictions on women traveling in the ultraconservative Muslim kingdom, its tourism authority said Sunday, with new guidelines allowing women to rent hotel rooms without a male guardian's presence, and foreign men and women to share a room without proof of marriage.\n\nThe easing of stringent regulations governing social interactions comes after Riyadh launched its first tourist visa scheme, as part of efforts to open up the country to foreign visitors and diversify its oil-reliant economy.\n\nThe Saudi Commission for Tourism & National Heritage posted the new requirements on Twitter Sunday, confirming a Friday report by the Saudi daily Okaz.\n\nThe commission said women will be allowed to rent hotel rooms with proof of identity — an ID card for Saudi women, residency card for foreign residents living in the kingdom or passport for tourists. The same would be required of foreign couples, without the need for them to present a marriage certificate. Previously women needed permission from a male guardian to rent a hotel room.\n\nWomen will also be allowed to rent hotel rooms without any form of identification if they have a male guardian present who does have proof of identity, it said.\n\nThe move comes amid deep reforms over the past year by Crown Prince Mohammed bin Salman which has lifted a ban on movie theaters in the kingdom and the world's only ban on women driving.\n\nCritics note there are limits to the reforms, and point to last year's killing of Saudi writer Jamal Khashoggi in the Saudi consulate in Istanbul and the reported torture of several detained women's rights activists.\n\nSaudi announced the new tourist visa scheme last week, saying it was aiming to increase tourism to contribute up to 10% of gross domestic product compared to 3% currently. For the launch of its new visa, the country was highlighting five UNESCO World Heritage sites, contemporary art sites and natural sites including the Red Sea, desert and mountains.\n\nPreviously visitor visas were issued only for specific reasons such as for Muslim religious pilgrimages, to visit family or for business.\n\nThe one-year, multiple-entry visa scheme allows for stays of up to 90 days at a time and marks the first time the country is allowing foreigners to visit solely for the purpose of tourism. Citizens of 49 eligible countries can apply online or on arrival, while those from other countries will have to apply at their nearest Saudi embassy or consulate.\n\nAs part of the drive to attract foreign visitors, the kingdom is easing strict dress codes for tourist women, requiring shoulders and knees to be covered in public but not demanding they wear the full-body abaya, according to guidelines posted on its visa information website.", "description": "Saudi Arabia has lifted some restrictions on women traveling in the ultraconservative Muslim kingdom, its tourism authority said Sunday, with new guidelines allowing women to rent hotel rooms without a male guardian's presence, and foreign men and women to share a room without proof of marriage.", "authors": ["Elena Becatoros"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-06"}