{"pub": "businessinsider", "url": "https://gizmodo.com.au/2019/09/sony-will-continue-to-cash-in-on-its-spider-man-rights-with-a-madame-web-movie", "downloaded_at": "2019-09-27 01:31:43.801020+00:00", "title": "Sony Will Continue To Cash In On Its Spider-Man Rights With A Madame Web Movie", "language": "en", "text": "Madame Web doing her thing. (Image: Jamal Campbell, Marvel)\n\nOne of the reasons Sony was willing to part ways with Disney and yank Peter Parker out of the Marvel Cinematic Universe is that the studio holds the film rights to a rather significant chunk of characters who exist within Spider-Man’s orbit. For instance: Miles Morales, Cindy Moon, Venom, Morbius and Madame Web, a clairvoyant mutant who’s now making her way to the big screen.\n\nAccording to the Hollywood Reporter, Sony has tapped Morbius co-writers Matt Sazama and Burk Sharpless to begin penning a script for a feature film focused on Cassandra Webb, a.k.a. Madame Web, a disabled, precognitive psychic who, in Marvel’s comics, is cybernetically tethered to a gargantuan chair that resembles a web.\n\nWhile Madame Web doesn’t typically become physically involved in hero work, her vast array of psionic abilities make her an invaluable ally to a number of Spider-themed heroes who she’s worked with over the years — especially in her role as the guardian of the Web of Life and Destiny, the transdimensional nexus of fate that isn’t just where most Spider-heroes in the multiverse derive their powers from in the comics, but that allows them to travel anywhere in the multiverse.\n\nBecause Madame Web has most often functioned as a kind of mentor to Spider-vigilantes, one imagines that she won’t be the only hero featured in Sony’s film — but given her connections beyond simply her powers, she might end up becoming a rather important piece of the cinematic web the studio’s trying to build.", "description": "One of the reasons Sony was willing to part ways with Disney and yank Peter Parker out of the Marvel Cinematic Universe is that the studio holds the film rights to a rather significant chunk of characters who exist within Spider-Man’s orbit. For instance: Miles Morales, Cindy Moon, Venom, Morbius and Madame Web, a...", "authors": ["Tegan Jones", "Sarah Basford"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/qrssaljvqohc8ntmytw8.jpg", "published_at": "2019-09-27"}