{"pub": "time", "url": "https://time.com/5694959/ellen-degeneres-george-bush-nfl-game", "downloaded_at": "2019-10-08 14:58:53.229381+00:00", "title": "Ellen DeGeneres Defends George W. Bush Friendship", "language": "en", "text": "Talk show host Ellen DeGeneres has defended sitting next to former President George W. Bush at a Dallas Cowboys game on Sunday in a video released Monday night ahead of Tuesday’s broadcast.\n\nDeGeneres faced criticism on Twitter after cameras showed her laughing next to the former Republican President during Sunday’s broadcast of the game. Some argued it was hypocritical for DeGeneres, an out gay women who has supported liberal causes, to socialize with the former Republican President whose record includes the Iraq War and opposition to gay marriage.\n\nDegeneres disagrees. “I’m friends with George Bush,” she said in the video posted Monday night. “In fact, I’m friends with a lot of people who don’t share the same beliefs that I have. We’re all different and I think that we’ve forgotten that that’s okay.”\n\nDeGeneres came out as gay in 1997 and was awarded the Presidential Medal of Freedom in 2017 from then-President Barack Obama for pioneering LGBTQ representation. As President, former President Bush opposed gay marriage and endorsed a constitutional amendment explicitly banning gay marriage while running for reelection in 2004 — although he endorsed civil unions.\n\nThe Brief Newsletter Sign up to receive the top stories you need to know right now. View Sample Sign Up Now\n\nDeGeneres said she and her wife Portia de Rossi were invited to the game by Charlotte Jones, daughter of Cowboys owner Jerry Jones (who donated a million dollars to President Donald Trump’s inauguration committee). They sat in Jones’s box, and DeGeneres ended up seated next to former President Bush.\n\n“During the game they showed a shot of George and me laughing together and so people were upset,” she said. “They thought why is a gay Hollywood liberal sitting next to a conservative Republican president?”\n\n“A lot of people were mad, and they did what people do when they’re mad, they tweet,” she continued. DeGeneres then showed a tweet she said she loved: “Ellen and George Bush together makes me have faith in America again.” The audience cheered; “exactly,” DeGeneres said.\n\n“Just because I don’t agree with someone on everything doesn’t mean that I’m not going to be friends with them,” she said. “When I say be kind to one and other I don’t mean only the people that think the same way that you do, I mean be kind to everyone.”\n\nDeGeneres thanked Charlotte and Jerry Jones for hosting them and “President Bush and Laura for a Sunday afternoon that was so fun.”\n\nSunday wasn’t the first time DeGenres and Bush have appeared together. He was a guest on her talk show in 2017.\n\nEllen has long said she’s not a political comedian and that she tries to keep politics out of her show. However she has spoken up against anti-LGBTQ laws in the past. In 2016, for example, she spoke out against a religious-freedom law in Louisiana that would allow for discrimination based on sexual orientation. In 2019, she supported a boycott of hotels owned by the Sultan of Brunei after the country announced it would issue the death penalty on those convicted for having gay sex.\n\nDeGeneres has also spoke out against President Donald Trump, and told Matt Lauer in 2017 that she would never have the President on her show. “Because I’m not going to change his mind,” DeGeneres said. “He’s against everything that I stand for.” In her video posted on Monday, DeGeneres also made a subtle jab at the President, joking that she celebrated every time “another whistleblower came forward,” adding that she meant the referees at the Cowboys game.\n\nDeGeneres has also faced criticism for defending comedian Kevin Hart, who stepped down from hosting the 2019 Oscars after old anti-gay tweets of his surfaced. ” “I believe in forgiveness. I believe in second chances. And I believe in @KevinHart4real,” she tweeted.\n\nWrite to Madeleine Carlisle at madeleine.carlisle@time.com.", "description": "DeGeneres has defended sitting next to former President George W. Bush at a Dallas Cowboys game in a video segment on her talk show", "authors": ["Madeleine Carlisle"], "top_image": "https://timedotcom.files.wordpress.com/2019/10/ellen-degeneres-george-bush-1.jpg?quality=85&w=1200&h=628&crop=1", "published_at": "2019-10-08"}