{"pub": "independent", "url": "https://independent.co.uk/news/world/middle-east/syria-russia-turkey-kurds-buffer-zone-patrols-a9166896.html", "downloaded_at": "2019-10-22 20:37:43.604113+00:00", "title": "Syria crisis: Russia and Turkey agree to joint patrols of ‘buffer zone’ and withdrawal of Kurdish forces", "language": "en", "text": "Russia and Turkey have struck a deal to jointly police northeastern Syria that they say will end two weeks of bloodshed, just hours before a ceasefire in the area was due to expire.\n\n\n\nAfter a marathon meeting in the Black Sea resort of Sochi, Turkish president Recep Tayyip Erdogan said that the agreement would see Kurdish YPG militia pull back beyond a 30km \"buffer zone\" along the Turkish border.\n\nKurdish forces would also leave the strategic Syrian towns of Tel Rifaat and Manbij under the terms.\n\nRussian foreign minister Sergei Lavrov hailed the deal as one that would end the fighting that has ravished the region for the last two weeks.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe United Nations said that more than 176,000 people have been displaced, including nearly 80,000 children, since Ankara launched its controversial cross-border incursion against Syrian Kurds.\n\nBeginning at noon Wednesday, Russian military police and Syrian border guards will move in to facilitate the removal of YPG members and weapons. A task that will last six days, the deal said.\n\nAt that moment Russian and Turkish forces will begin joint patrols 10km into the buffer-zone area.\n\nThe agreement, if successfully implemented, will likely herald the end of Turkey's incursion in northern Syria. It may also consolidate the Syrian government's hold over northeastern Syria which until two weeks ago had been controlled by Kurdish-led Syrian Democratic Forces.\n\nPresident Vladimir Putin opened the Tuesday press conference saying that Moscow “appreciates” Turkey’s national security concerns but insists “Syria must be free from foreign military presence.”\n\nMr Erdogan outlined the understanding saying: ”The main aim of the operation is to take out PKK/YPG terror organisations from the area and to facilitate the return of Syrian refugees.”\n\n\n\nAnkara regards the YPG as terrorists because of their affiliation with the outlawed Kurdistan Workers Party (PKK), which is waging an insurgency in southeast Turkey.\n\n“This operation also guarantees Syria territorial integrity and political unity. We never had any interest in Syria land and sovereignty,” he added.\n\nThe two presidents met as a five-day cease-fire between Turkish troops and Kurdish fighters in northeastern Syria was set to expire.\n\nIndependent news email Only the best news in your inbox Enter your email address Continue Continue Please enter an email address Email address is invalid Fill out this field Email address is invalid Email already exists. Log in to update your newsletter preferences Register with your social account or click here to log in I would like to receive morning headlines Monday - Friday plus breaking news alerts by email Update newsletter preferences\n\nUnder the earlier US-brokered deal, Kurdish forces were supposed to withdraw from Mr Erdogan’s desired 30km deep buffer zone.\n\n\n\nBut Kurdish commanders accused Ankara of violating the agreement and continuing to fire on their fighters preventing them from pulling back.\n\nTurkey meanwhile accused the Kurds of breaking the truce by leaving 1,300 Syrian Kurdish fighters in the ceasefire area.\n\nTurkey launched its controversial cross border incursion in northeastern Syria earlier this month to repel Kurdish forces who once fought alongside US soldiers against the Islamic State.\n\nPresident Erdogan said it aimed to build a “safe zone” where he also hopes to repatriate some of the 3.5 million Syrian refugees currently living in Turkey.\n\nBut he has faced mounting condemnation for the operation which has displaced hundreds of thousands of people and killed at least 70 civilians according to the Syrian Observatory for Human Rights.\n\nAmnesty International has also accused Turkey and its Syrian rebel allies of likely committing war crimes, including indiscriminate bombing of civilian areas and an execution-style killing of a Kurdish female politician.\n\nTurkey has vehemently denied the allegations and dismissed claims made by Kurdish doctors that it has used chemical weapons or white phosphorus as “flagrant slanders”.\n\nPresident Donald Trump, once a close ally of the Kurds, was accused of green-lighting the operation after announcing US troops would pull back from northern Syria and not intervene in the imminent Turkish attack.\n\n\n\n\n\nHe later ordered most of the 1,000 US troops stationed in the country to completely withdraw. Many of them were pelted with vegetables by angry Kurdish residents as they crossed Syria's border into Iraq on Monday.\n\nFacing the Turkish incursion alone, the Kurds then struck a deal with President Bashar al-Assad to defend the borders.\n\nIt was a massive territorial win for the Assad regime who has deployed government troops to Kurdish-controlled areas for the first time in five years.\n\nUnder Tuesday’s deal, government border guards would assist Russian forces in the YPG withdrawal. There has yet to be any official response from the Kurdish side.\n\nBut the Kurdish Red Crescent issued a desperate plea shortly before the agreement was announced, saying that their “capacity” to meet a mounting humanitarian crisis “had ended’.\n\nThey said five hospitals and clinics were out of service and there there was not enough resources to look after the huge number of newly displaced.\n\n“There are no shelters, not enough food, not enough medicines, not enough drinking water. The water pipeline, which got hit by an airstrike and served more than 500,000 people, is still not functioning. These people have gone a week without a water supply,” the statement added.", "description": "*/", "authors": ["Bel Trew"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/22/19/gettyimages-1177642509.jpg", "published_at": "2019-10-22"}