{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7562413/Kourtney-Kardashian-cuts-glamorous-figure-departing-Delilah-West-Hollywood.html", "downloaded_at": "2019-10-11 13:16:55.573681+00:00", "title": "Kourtney Kardashian cuts a glamorous figure while departing Delilah in West Hollywood", "language": "en", "text": "She's the eldest of the Kardashian clan and boasts an astonishing 82million followers on Instagram.\n\nAnd Kourtney Kardashian cut a glamorous figure as she departed Delilah in West Hollywood on Thursday.\n\nThe reality star, 40, looked nothing short of sensational for the evening, donning a low-cut black dress which she paired with eye-catching cross necklaces.\n\nStunning: Kourtney Kardashian, 40, cut a glamorous figure as she departed Delilah in West Hollywood on Thursday\n\nAdding a touch of glamour to her look with a striking red lip, Kourtney styled her raven tresses into an updo for the evening.\n\nThe Keeping Up With The Kardashians star also sported a gold circle necklace with a cross in the centre and she also sported glittering cross-shaped earrings.\n\nMaking her way to a waiting car, Kourtney departed the popular venue with a male companion.\n\nThe businesswoman's outing comes after she was caught off-guard when some money went missing from her wallet in a sneak peek clip from Keeping Up With The Kardashians.\n\nBeaut: The reality star looked nothing short of sensational for the evening, donning a low-cut black dress which she paired with eye-catching cross necklaces\n\nThe eldest sister in the Kardashian clan was enjoying a casual conversation with younger sister Khloe, 35, when her assistant Megan became the barer of bad news.\n\nMegan told the mother-of-three: 'Kourt? So, we discovered that there was cash missing from your wallet. So, I don't know if you spent it out the other night?'\n\nKourtney insisted that she only gave a $20 bill to a valet and that she had thrown a bunch of hundred dollar bills into her bag.\n\nMegan replied: 'There's no hundreds there right now.'\n\nRadiant: Adding a touch of glamour to her look with a striking red lip, Kourtney styled her raven tresses into an updo for the evening\n\nStyle: The Keeping Up With The Kardashians star also sported a gold circle necklace with a cross in the centre and she also sported glittering cross-shaped earrings\n\nHomeward bound: The Keeping Up With The Kardashians star left the popular venue with a male companion\n\nSurprise: The businesswoman's outing comes after she was caught off-guard as some money went missing from her wallet in a sneak peek clip from Keeping Up With The Kardashians\n\nKhloe tried to play devil's advocate as she said: 'Is there any chance that you could have lost the money or do you think it fell or...'\n\nKourtney, however, was sure that the money was in the bag. She said: 'It was definitely there. You know when you just know? Like, I know for a fact.'\n\nUnfortunately this wasn't the first instance of something missing as Kourtney said: 'The fact that money is missing from my wallet, definitely doesn't feel like a coincidence. We had an iPad missing in the house too.'\n\nShock: The eldest sister in the Kardashian clan was enjoying a casual conversation with younger sister Khloe, 35, when her assistant Megan became the barer of bad news\n\nMissing: Megan told the mother-of-three: 'Kourt? So, we discovered that there was cash missing from your wallet. So, I don't know if you spent it out the other night?'\n\nShe went on to say that it is within the realm of reason to believe that these items had been taken as she constantly has people around leaving her to question her inner circle.\n\nKourtney said: 'You know, I have people in and out of my house all day. People that I trust. Something just isn't right.'\n\nKeeping Up With The Kardashians airs Sunday nights at 9pm on E!", "description": "The reality star, 40, looked nothing short of sensational as she departed Delilah in West Hollywood on Thursday.", "authors": ["Sean O'Grady For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/11/11/19581878-0-image-a-34_1570788142653.jpg", "published_at": "2019-10-11"}