{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/2019092610289/us-tax-compliance-holds-flat-at-86-update", "downloaded_at": "2019-09-26 23:45:53.445619+00:00", "title": "U.S. Tax Compliance Holds Flat at 86% — Update", "language": "en", "text": "By Richard Rubin\n\nWASHINGTON -- Americans pay about 86% of their federal taxes, leaving a $ 381 billion annual gap between taxes owed and taxes collected, according to an Internal Revenue Service study released Thursday.\n\nThe government's first report on the \"tax gap\" since 2016 shows tax compliance holding steady as the IRS shrinks. However, the study covers tax years 2011 through 2013, and the IRS has reduced audits and staffing considerably since then.\n\nIn those years, taxpayers paid 83.6% of the taxes they owed voluntarily and a total of 85.8% after IRS enforcement efforts. Those are about equal to the previous study, which covered tax years 2008 through 2010 and was updated with the same methodology used for the new analysis.\n\n\"Voluntary compliance is the bedrock of our tax system, and it's important it is holding steady,\" Charles Rettig, the IRS commissioner, said in a statement.\n\nFederal budget deficits in those years averaged more than $1 trillion as the country came out of the financial crisis, so even full compliance wouldn't have eliminated that.\n\nAchieving 100% compliance isn't realistic, and getting there would require a much more intrusive government to monitor income and collect payments.\n\nStill, tax compliance scholars point to a variety of forces that drive taxpayer behavior and say the government could do more to boost voluntary payments and pursue those who owe.\n\n\"There's an array of factors that motivate people to comply, ranging from their moral concerns to their fear of potentially going to jail, at an extreme,\" said Leandra Lederman, an Indiana University law professor who studies tax compliance.\n\nAmong the largest drivers of tax compliance are third-party information reporting and withholding.\n\nWage earners know that the IRS has a Form W-2 showing how much money they made and a year's worth of withheld taxes. There's little incentive to cheat when it can be caught so easily. For income with substantial information reporting and withholding, the IRS says just 1% of income is underreported.\n\nAt the other extreme, owners of cash businesses know that the IRS has little if any independent information about their revenue and expenses. For that and other income without information reporting, 55% is misreported, according to the IRS.\n\nEnforcement matters, too. Audits collect money directly and deter taxpayers from cheating.\n\nBut today's IRS employs fewer people and audits fewer taxpayers than it used to. That is the result of Congress giving the tax agency more responsibilities while cutting its budget or leaving it flat.\n\nIn fiscal 2018, the tax agency had 73,519 employees, down 22% from 2011. That same year, the IRS audited just 0.59% of individual tax returns, marking the seventh straight decline in that figure and the lowest rate since 2002.\n\n\"If the IRS is perceived as toothless by people who have a lot of opportunity to evade, you would predict less compliance,\" Ms. Lederman said.\n\nWrite to Richard Rubin at richard.rubin@wsj.com\n\n(END) Dow Jones Newswires\n\nSeptember 26, 2019 17:08 ET (21:08 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-09-26"}