{"pub": "yahoo", "url": "https://sports.yahoo.com/cowboys-looking-finalise-prescott-extension-002425150.html", "downloaded_at": "2019-09-07 14:10:29.619013+00:00", "title": "Cowboys looking to finalise Prescott extension by Sunday", "language": "en", "text": "The Dallas Cowboys are hoping to reach a contract agreement with quarterback Dak Prescott by Sunday.\n\nThis has been an offseason of big-money contract negotiations between the Cowboys and some of their young stars.\n\nRunning back Ezekiel Elliott ended his preseason holdout earlier this week after signing a six-year, $90million extension. Dallas also signed right tackle La'el Collins to a five-year extension this week, and inked linebacker Jaylon Smith to a five-year, $64.5m deal.\n\nScroll to continue with content Ad\n\nBut negotiations with Prescott appeared to hit a snag in August, after reports the two-time NFL Pro Bowler had turned down a $30m per year offer from the team and was seeking a record annual figure of $40m. A subsequent report shot down that sum as false.\n\nCowboys executive vice president Stephen Jones said he is hoping the two sides can reach a deal by Sunday's opener against the New York Giants.\n\n\"I'd say the dialogue has been good, and we're still holding out hope we can figure out how to come up with a deal by the game on Sunday,\" Jones told Dallas radio station 105.3 The Fan on Friday.\n\nJones also said the Cowboys are having \"very limited\" negotiations with wide receiver Amari Cooper, \"for a range of reasons that will eventually get worked out.\"\n\nUnlike some other teams that do not conduct negotiations once the NFL season begins, Jones said talks will continue with Prescott if no deal is reached by Sunday.\n\n\"We're open for business,\" Jones said. \"I know sometimes the players don't care to do that. But we can obviously juggle that and do that. We would be fine with doing that.\n\nStory continues\n\n\"It's really up to the player and their representatives to determine what their deadlines are and their timelines. It doesn't seem to bother us, and I don't know that we've given those type of deadlines or timelines.\"", "description": "Could the Dallas Cowboys' contract talks with quarterback Dak Prescott be nearing a deal?", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/v6S0bLGtlRW6cwGhkaRsbg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjA-/https://s.yimg.com/uu/api/res/1.2/HlTAdGDV.oAfZo3v_15kww--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-GB/homerun/omnisport.uk/d47982306567cdeefb0f15b5c5719b90", "published_at": "2019-09-07"}