{"pub": "yahoo", "url": "https://yahoo.com/entertainment/jersey-shore-ronnie-ortiz-magros-010003136.html", "downloaded_at": "2019-09-20 02:29:20.761467+00:00", "title": "Jersey Shore: Ronnie Ortiz-Magro's On-Off Girlfriend Jen Harley Claims He Went 'MIA' for a Week", "language": "en", "text": "More drama was brewing between Ronnie Ortiz-Magro and his on-off girlfriend Jen Harley on Thursday’s episode of Jersey Shore: Family Vacation.\n\nThe episode opened in Las Vegas, where the cast had convened to support Vinny Guadagnino at his Chippendales debut in April. But Ronnie’s evasive, isolating behavior immediately began raising eyebrows amongst the roomies.\n\n“He’s put us through so much that every time he’s quiet, he’s buried in his phone, we’re all like, ‘Oh my God, what’s going on with him and Jen?’ ” Vinny wondered. (The two have a well-documented history of alleged abuse on both sides.)\n\n“Clearly, Ron has a pattern of keeping a lot of stuff quiet and not opening up and then kind of waiting to explode and everything comes out,” he continued. “It’s all or nothing with him.”\n\nJen Harley; Ronnie Ortiz-Magro | Gabe Ginsberg/Getty Images; Jamie McCarthy/Getty Images More\n\nPauly “DJ Pauly D” DelVecchio was also concerned that things were about to get ugly.\n\n“If you were ever curious about the ingredients for a Ron-page, they are: a pissy look on your face, check; buried in your phone, check; disheveled hair, check; storming off to the bathroom, check. Tick, tick, tick. That’s a ticking time bomb to a Ron-page.”\n\nRELATED: Jersey Shore‘s Angelina Pivarnick Suing FDNY Supervisor for Allegedly Sexually Harassing Her\n\nThey headed out to brunch the morning of Vinny’s premiere, and while Ronnie was in the bathroom, Angelina Pivarnick got a message from none other than Jen herself.\n\n“All of a sudden my phone is blowing up and it’s Jen,” she said. “And those text messages are f—ing insane. ‘Ron went to Cabo, went MIA, been texting me crazy s— all hours of the night, stayed longer, blocked me from everything. He just went completely whack.’ “\n\n“Like, what is really going on right now? I don’t know if he’s sober or not,” Angelina wondered of Ronnie, who at the time had just completed a 30-day stint in rehab. “I don’t know who the f— is lying at this point, and I’m very scared.”\n\nAngelina Pivarnick | Jim Spellman/FilmMagic More\n\nRELATED: Why Jersey Shore‘s Ronnie Ortiz-Magro Checked Into Rehab — I Was ‘Tired of the Chaos in My Life’\n\nEveryone else was equally confused.\n\n“To me it’s weird that Ron’s baby mama Jen is reaching out to our family, our friends, instead of reaching out just to him,” said Pauly. “She’s going around [his] back and talking to the girls. Sometimes I just wish Ronnie would be honest with us about what’s going on.”", "description": "Jersey Shore: Jen Harley Claims Ronnie Ortiz-Magro Went 'MIA' for a Week", "authors": ["Aurelie Corinthios"], "top_image": "https://s.yimg.com/uu/api/res/1.2/LuOTkm7ZpyDRxkkkAVWgQQ--~B/aD02MzA7dz0xMjAwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/people_218/10b0d554cb9808674e78eb8e94a84854", "published_at": "2019-09-20"}