{"pub": "reuters", "title": "Explainer: Ex-Google engineer faces severe penalties in self-driving trade secrets case", "url": "https://reuters.com/article/us-autonomous-uber-levandowski-law-expla/explainer-ex-google-engineer-faces-severe-penalties-in-self-driving-trade-secrets-case-idUSKCN1VH2AU", "language": "en", "published_at": "2019-08-28", "downloaded_at": "2019-09-02 07:06:44.802947+00:00", "text": "(Reuters) - U.S. prosecutors on Tuesday brought a criminal case against a former high-ranking Google engineer, alleging he stole confidential technology from the company’s self-driving car unit before joining rival Uber Technologies Inc (UBER.N).\n\nThe U.S. Department of Justice said Anthony Levandowski, who worked for Google parent company Alphabet Inc’s (GOOGL.O) Waymo unit, downloaded thousands of files from Waymo servers as he was leaving the company in 2015, attempting to take dozens of “trade secrets” with him.\n\nIn 2016, Levandowski, a pioneer in the industry, founded a self-driving truck company that was acquired by Uber.\n\nLevandowski’s alleged conduct was at the center of a lawsuit Waymo brought against Uber in 2017, which ended with Uber paying a settlement of about $245 million.\n\nLawyers for Levandowski said their client was innocent and did not steal anything from Waymo.\n\nThe following explains how trade secrets cases work, Levandowski’s potential defenses, and the amount of jail time he could face if convicted.\n\nWhat is a trade secret?\n\nUnder U.S. law, a trade secret is economically valuable information or technology that the owner has taken reasonable steps to keep hidden from rivals. A frequently cited example is the recipe for Coca-Cola.\n\nOnce an invention is the subject of a patent, it is no longer considered a trade secret because patent applications are publicly available documents.\n\nA company with a cutting-edge technology will sometimes claim the invention is a trade secret rather than file for patent protection. Patents eventually expire and make the invention part of the public domain, but trade secret protection can last indefinitely, or at least as long as the information remains confidential.\n\nAre civil disputes over trade secrets common?\n\nIt is quite common for companies to sue rivals for alleged trade secrets theft. In 2017, there were more than 1,100 such civil cases filed in U.S. federal courts, according to litigation analytics company Lex Machina.\n\nFormer Google and Uber engineer Anthony Levandowski leaves the federal court after his arraignment hearing in San Jose, California, U.S. August 27, 2019. REUTERS/Stephen Lam\n\nOccasionally, an alleged theft will be subject of both a civil lawsuit and a criminal prosecution.\n\nIn one such example, U.S. prosecutors earlier this year unsealed an indictment charging units of China’s Huawei Technologies Co Ltd with conspiring to steal T-Mobile US Inc (TMUS.O) trade secrets. T-Mobile brought a civil lawsuit years earlier making identical claims.\n\nAre criminal trade secrets prosecutions also common?\n\nCriminal cases involving trade secrets theft are less common than civil ones, but have been increasing in recent years, legal experts said.\n\nThe FBI had 67 pending investigations relating to theft of trade secrets as of October 2018, according to a U.S. government report.\n\nCriminal prosecutions often focus on trade secrets that involve national security and recently have targeted Chinese nationals who worked in the United States. Prosecutors also feel pressure to act in high-profile domestic cases involving important technology, legal experts said.\n\nIn both civil and criminal cases, frequently companies or prosecutors claim that an employee was planning to leave and improperly downloaded documents containing trade secrets, later providing them to their new company.\n\nWhat are Levandowski’s potential defenses?\n\nTo prevail, prosecutors need to prove beyond a reasonable doubt that the Waymo files at issue actually contained trade secrets. Prosecutors also need to show that these trade secrets were improperly acquired and disclosed by Levandowski.\n\nLevandowski could argue that the Waymo’s designs did not qualify as trade secrets because the company did not take reasonable steps to safeguard them or because they were widely known.\n\nLevandowski could also argue that he lacked the intent to steal anything.\n\nLevandowski’s lawyers foreshadowed such a defense in their statement, saying the downloads occurred when he was authorized to use the information and that “none of these supposedly secret files ever went to Uber or to any other company.”\n\nFormer Google and Uber engineer Anthony Levandowski walks to an awaiting vehicle after his arraignment hearing at the federal court in San Jose, California, U.S. August 27, 2019. REUTERS/Stephen Lam\n\nCould Levandowski face jail time if convicted?\n\nYes. He faces up to 10 years, but defendants typically do not receive the maximum sentence. Levandowski would likely face a shorter sentence if he agreed to plead guilty rather than defend himself at a trial.", "description": "U.S. prosecutors on Tuesday brought a criminal case against a former high-ranking Google engineer, alleging he stole confidential technology from the company's self-driving car unit before joining rival Uber Technologies Inc .", "authors": ["Jan", "Min Read"], "top_image": "https://s2.reutersmedia.net/resources/r/?m=02&d=20190828&t=2&i=1423478422&w=1200&r=LYNXNPEF7R05B"}