{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7552353/Cyclist-left-dead-hit-run-Taro-launched-online-appeal-woman-saved-him.html", "downloaded_at": "2019-10-09 02:18:50.976304+00:00", "title": "Cyclist left for dead in hit and run in Taro has launched online appeal to find woman who saved him", "language": "en", "text": "A cyclist who owes his life to a woman who stopped to help him as he laying dying in a drain now wants to find his 'angel' and thank her.\n\nTrevor Simmons was left lying on the side of the road unconscious after he was hit from behind on the New England Highway at Taro, near Newcastle.\n\nThe car that hit him quickly took off, and Mr Simmons, 66, lay in the drain on the side of the road for about an hour before an unknown woman he calls his 'angel of mercy' stopped to help.\n\nA cyclist who was badly injured in a hit-and-run accident has turned to social media to find the 'angel of mercy' (pictured in red top) who spotted him on the side of the road an hour after the crash and ran to his rescue\n\nDespite multiple attempts in the past to locate the woman and say thank you, Mr Simmons has never come close to even learning her name.\n\nOn the one year anniversary of the accident, Mr Simmons has launched a social media campaign to track her down and give her the praise and thanks she deserves.\n\n'I would like to be able to find her to thank her for caring enough to stop, calling the ambulance and looking after me and staying with me till the paramedics arrived,' he wrote in a post shared to Facebook on Wednesday.\n\nThe crash, on October 9 last year, snapped his carbon fibre bike into pieces and left him badly scratched up with a head injury and a fractured left hip.\n\nCyclist Trevor Simmons has been searching for the woman (pictured) for a year, but has never come close to even learning her name\n\n'Huge amount of skin lost off my backside, now major bruising is coming out, skin off both shoulders, skin off both elbows, lacerations to the face,' he told the Newcastle Herald at the time.\n\n'[The crash] smashed my glasses, smashed my helmet, chipped my front teeth.\n\n'To snap three members of that bike completely in half, it's hit with a lot of force.'\n\nMr Simmons was hospitalised for nearly three days after the accident, and said he could not understand why he was left for dead.\n\n'No matter how I rationalise how it happened, I can't imagine why anyone would walk away from it,' he said.", "description": "A Newcastle cyclist who owes his life to a woman (pictured) who stopped to help him as he laying dying in a drain wants to find his 'angel' and thank her.", "authors": ["Hannah Moore For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/01/19468600-0-image-a-21_1570580543224.jpg", "published_at": "2019-10-09"}