{"pub": "businessinsider", "url": "https://businessinsider.com/expectations-of-andrew-yang-have-doubled-since-last-debate-2019-9", "downloaded_at": "2019-09-15 10:56:31.818792+00:00", "title": "Expectations of Andrew Yang have doubled since the last debate, according to a new poll", "language": "en", "text": "Entrepreneur Andrew Yang may not be a frontrunner in the 2020 presidential race, or even close, but Americans' expectations of him are rising fast.\n\nAccording to a new Insider poll, confidence in Yang's debate performance has doubled among both self-reported Democratic voters and the general population. The poll asked over a thousand American adults to select up to three candidates they think will perform best at Thursday's Democratic primary debate hosted by NBC. More than one in ten respondents chose Yang.\n\nThe number — 15.2% to be exact — may not be as large as his more established rivals, but it's nearly double the 7.7% of respondents who had confidence in Yang prior to the last debates in July, indicating that Yang is capturing viewers and winning them over. No other Democratic candidate saw their expectations increase quite like Yang.\n\nPart of this could owe to the fact that candidates like Yang have much to gain from the debates, while frontrunners such as former Vice President Joe Biden who are ill-suited for the format have only to lose.\n\nAmong Democrats, confidence in Yang more than doubled from 6.7% to 13.7%. Proportionally speaking, it's the most significant boost any candidate has received through the course of our debate polling.\n\nRead more: Debates are great for candidates like Andrew Yang but bad for candidates like Joe Biden\n\nEach time, we asked respondents to select up to a quarter of candidates who they thought world perform well.\n\nPreviously, they were able to select up to five out of 20; this round, they were able to select up to three out of ten. Setting aside Biden, who has seen expectations erode precipitously, most other candidates are still where they were back in June when it comes to expectations.\n\nData as of Aug. 16. Business Insider\n\nYang, whose campaign is largely predicated on his Freedom Dividend — a universal basic income program that would provide $1,000 per month to every adult in America — has expressed frustration with the way his candidacy has been treated by the establishment, accusing NBC of cutting his mic off during the first debates in June.\n\nThe hiccup didn't go unnoticed by viewers: Out of nine complaints received by the Federal Communications Commission (FCC) and obtained by Insider following the debates, two called out Yang's mic issues. Later, his campaign said CNN ran a graphic that excluded Yang in favor of lower-polling rivals.\n\nDespite ardent support from his base, most Americans polled by Insider have never heard of Yang.\n\nWhile his name recognition has steadily increased through the course of Insider's polling, only 37% of respondents had heard of him in our most recent poll. That number is higher for Democratic voters, 52% of whom say they've heard of Yang. But even among Democrats, he's less well known than some contenders who are polling behind him, such as former Rep. Beto O'Rourke.\n\nYang has a long, uphill battle to wage — but if he continues to build momentum, he could become a candidate to watch.\n\nSurveyMonkey Audience polls from a national sample balanced by census data of age and gender. Respondents are incentivized to complete surveys through charitable contributions. Generally speaking, digital polling tends to skew toward people with access to the internet. Total 1,090 respondents collected September 6 to September 7, 2019, a margin of error plus or minus 3.07 percentage points with a 95% confidence level.\n\nRead more:\n\nPOWER RANKING: Here's who has the best chance of becoming the 2020 Democratic presidential nominee\n\nDebates are great for candidates like Andrew Yang but bad for candidates like Joe Biden\n\nAndrew Yang's campaign blasted the DNC for not allowing him to use 2 polls from same source for fall Democratic debates\n\nAndrew Yang says the US needs to change the way it measures the economy. Experts aren't convinced.", "description": "Andrew Yang is lesser known than his 2020 rivals, but an Insider poll found Democrats have doubled their expectations of him on the debate stage.", "authors": ["Angela Wang", "Walt Hickey"], "top_image": "https://amp.businessinsider.com/images/5d796f1e2e22af016501f7b6-2732-1366.jpg", "published_at": "2019-09-12"}