{"pub": "washingtonpost", "url": "https://washingtonpost.com/politics/2019/10/25/three-years-later-evaluating-laws-trump-said-hed-pass-his-first-days", "downloaded_at": "2019-10-25 22:09:16.146575+00:00", "title": "Three years later, evaluating the 10 laws Trump said he’d pass in his first 100 days", "language": "en", "text": "Three years ago Thursday, Trump tweeted out the 10 proposed pieces of legislation included in the “contract.”\n\nMy contract with the American voter will restore honesty, accountability & CHANGE to Washington! #DrainTheSwamp pic.twitter.com/sbVwctT1Sj — Donald J. Trump (@realDonaldTrump) October 25, 2016\n\nFor the first two years of Trump’s presidency, his party enjoyed unified control of Washington. Despite that — and despite Trump’s reelection campaign refrain of “promises made, promises kept” — almost none of his proposed 100-day legislative agenda has seen the light of day, even 1,000 days into his presidency.\n\nAD\n\nHere’s where each proposed law stands.\n\nMiddle Class Tax Relief and Simplification Act\n\nAn economic plan designed to grow the economy 4% per year and create at least 25 million new jobs through massive tax reduction and simplification, in combination with trade reform, regulatory relief and lifting the restrictions on American energy. The largest tax reductions are for the middle class. A middle-class family with two children will get a 35% tax cut. The current number of brackets will be reduced from seven to three, and tax forms will likewise be greatly simplified. The business rate will be lowered from 35% to 15%, and the trillions of dollars of American corporate money overseas can now be brought back at a 10% rate.\n\nStatus: Passed in part. Trump did sign into law the Tax Cuts and Jobs Act in December 2017. But it only loosely resembled the description above.\n\nAD\n\nThe largest tax rate reductions in the law, according to analysis by the Joint Committee on Taxation, went to those making $1 million a year or more. Well, really, the biggest reductions were for corporations, though not to 15 percent — and, unlike for individuals, the corporate cuts are permanent. Off-shored profits got a 15.5 percent tax rate on returning to the United States. (A lot of that repatriated money was used to buy back stock.) The number of tax brackets remained unchanged.\n\nAD\n\nTrump’s frequent prediction that the tax cuts would spur 4 percent annual growth remains unfulfilled. Critics’ predictions that the deficit would spike, however, have been borne out.\n\nThis was the closest Trump got to enacting promised legislation. It came more than 300 days into Trump’s presidency.\n\nEnd the Offshoring Act\n\nEstablishes tariffs to discourage companies from laying off their workers in order to relocate in other countries and ship their products back to the U.S. tax-free.\n\nStatus: Not passed. Trump has acted unilaterally to impose tariffs on foreign countries but generally in an effort to affect trade negotiations. For a while, congressional Republicans flirted with a border-adjustment tax that would target some of Trump’s goals, but it was eventually dropped.\n\nAD\n\nAmerican Energy and Infrastructure Act\n\nLeverages public-private partnerships, and private investments through tax incentives, to spur $1 trillion in infrastructure investment over ten years. It is revenue neutral.\n\nStatus: Not passed. Despite numerous weeks ostensibly dedicated to infrastructure, there’s been no significant new infrastructure legislation proposed by the White House or passed by Congress.\n\nAD\n\nSchool Choice and Education Opportunity Act\n\nRedirects education dollars to give parents the right to send their kid to the public, private, charter, magnet, religious or home school of their choice. Ends Common Core and brings education supervision to local communities. It expands vocational and technical education, and makes two- and four-year college more affordable.\n\nStatus: Not passed. Common Core, a boogeyman of conservative media in the years leading up to 2016, has faded from the spotlight. Trump hasn’t proposed any legislation curtailing it, though he did sign an executive order to mandate that the secretary of education assess possible federal overreach in curriculum development.\n\nThere has also been no legislation passed that would bolster nonpublic education. He signed an executive order on vocational education in July 2018.\n\nRepeal and Replace Obamacare Act\n\nFully repeals Obamacare and replaces it with Health Savings Accounts, the ability to purchase health insurance across state lines and lets states manage Medicaid funds. Reforms will also include cutting the red tape at the FDA: there are over 4,000 drugs awaiting approval, and we especially want to speed the approval of life-saving medications.\n\nStatus: Not passed. House Republicans spent much of 2017 trying to figure out legislation that could replace Obamacare, without success. A vote that summer that would have ended the Affordable Care Act (as Obamacare is officially known) failed in the Senate when then-Arizona Sen. John McCain voted against it. The individual mandate component of Obamacare was repealed in the Tax Cut and Jobs Act.\n\nAD\n\nAD\n\nTrump did have some success in speeding drug approval times, though not through legislation.\n\nAffordable Childcare and Eldercare Act\n\nAllows Americans to deduct childcare and eldercare from their taxes, incentivizes employers to provide on-site childcare services and creates tax-free dependent care savings accounts for both young and elderly dependents, with matching contributions for low-income families.\n\nStatus: Not passed. The tax bill did increase the child tax credit (thanks to the advocacy of two Republican senators) but none of the other components of this proposed legislation have been enacted.\n\nEnd Illegal Immigration Act\n\nFully-funds the construction of a wall on our southern border with the full understanding that the country of Mexico will be reimbursing the United States for the full cost of such wall; establishes a two-year mandatory minimum federal prison sentence for illegally re-entering the U.S. after a previous deportation, and a five-year mandatory minimum federal prison sentence for illegally re-entering for those with felony convictions, multiple misdemeanor convictions or two or more prior deportations; also reforms visa rules to enhance penalties for overstaying and to ensure open jobs are offered to American workers first.\n\nStatus: Not passed. Trump’s efforts to get full funding for a wall on the border with Mexico resulted in a dramatic fight late last year, as the president allowed the government to shut down in lieu of signing a funding bill that didn’t include the wall. Eventually, Trump declared a national emergency, allowing him (after some legal fights) to move Defense Department spending to wall construction.\n\nAD\n\nHis administration has also enacted other reforms aimed at discouraging immigration into the United States from Mexico, including revisions to the asylum process. The criminal statutes described in his “contract” have not been enacted, though some new restrictions did pass the House in 2017.\n\nAD\n\nRestoring Community Safety Act\n\nReduces surging crime, drugs and violence by creating a task force on violent crime and increasing funding for programs that train and assist local police; increases resources for federal law enforcement agencies and federal prosecutors to dismantle criminal gangs and put violent offenders behind bars.\n\nStatus: Not passed. A task force on violent crime was created, but by executive order. Trump’s proposed budgets have included cuts to Justice Department grant programs.\n\nRestoring National Security Act\n\nRebuilds our military by eliminating the defense sequester and expanding military investment; provides veterans with the ability to receive public VA treatment or attend the private doctor of their choice; protects our vital infrastructure from cyber-attack; establishes new screening procedures for immigration to ensure those who are admitted to our country support our people and our values.\n\nStatus: Passed in part. In August 2018, the John S. McCain National Defense Authorization Act became law, increasing military funding. (The sequester overall ended with a spending bill passed in July.) While Trump regularly touts the passage of a VA Choice bill, it was initially passed under President Barack Obama.\n\nAD\n\nThe screening procedures for immigration are still under consideration but, as with so many other goals of Trump’s, are not being enacted legislatively.\n\nClean Up Corruption in Washington Act\n\nEnacts new ethics reforms to drain the swamp and reduce the corrupting influence of special interests on our politics.\n\nStatus: Not passed. This has not been a big focus of Trump’s presidency.\n\nAD\n\nSo how does Trump argue that he’s kept the promises he made? By reframing the promises he focuses on. Take a pair of tweets from last month in which Trump walked through his various reasons that his presidency has been a success.\n\n“All time best unemployment numbers, especially for Blacks, Hispanics, Asians & Women. More people working today than ever before. Rebuilt Military & Choice for Vets,” he wrote. “Became Number 1 in World & Independent in Energy. Will soon have record number of Judges, 2 SC Justices. Done more than any President in first 2 1/2 years...”\n\nThe military and choice for veterans were part of his 10 proposed bills. The others are successes that Trump seems to be highlighting mostly because he can.\n\nAD", "description": "A look back at Trump's closing argument from 2016.", "authors": ["Philip Bump", "National Correspondent Focused Largely On The Numbers Behind Politics"], "top_image": "https://www.washingtonpost.com/resizer/PWJDZhNO5WLBOXtLifq4kA3_28U=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/MV6W6UEH3MI6THLT4K5GXPY3TM.jpg", "published_at": "2019-10-25"}