{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7554211/Hessy-humpback-whales-32ft-carcass-hauled-Thames.html", "downloaded_at": "2019-10-09 12:54:44.992729+00:00", "title": "Hessy the humpback whale's 32ft carcass is hauled from Thames", "language": "en", "text": "Advertisement\n\nThe 32ft carcass of a humpback whale spotted swimming in the River Thames is now being dissected by scientists amid reports it died after becoming malnourished due to a lack of feeding.\n\nThe magnificent animal, nicknamed Hessy, had been travelling back and forth over a stretch of five miles after it was first sighted near Dartford Bridge in Kent on Sunday, but was found dead at around 5pm yesterday.\n\nTwo Port of London Authority boats and one RNLI lifeboat were deployed to recover the carcass at around 6.30pm and tow it to shore, before it was kept overnight and then winched onto a trailer this morning on its way to dissection.\n\nThe magnificent animal, nicknamed Hessy, had been travelling back and forth over a stretch of five miles after it was first sighted near Dartford Bridge in Kent on Sunday, but was found dead at around 5pm yesterday. It is seen this morning being loaded onto a trailer at Gravesend on its way for dissection by the Zoological Society of London\n\nTwo Port of London Authority boats and one RNLI lifeboat were deployed to recover the carcass at around 6.30pm and tow it to shore, before it was kept overnight and then winched onto a trailer this morning on its way to dissection\n\nA spokesman for the Port of London authority described the recovery operation last night. He said: ‘We managed to secure the whale to the larger of the boats, the Kew, and then began dragging it. The whale was so big and heavy that the Kew was only able to do one and a half miles an hour'\n\nA spokesman for the Port of London authority said the whale was found underneath the Dartford Crossing. He told MailOnline: ‘We had two Port of London patrol boats – the Kew and the East Haven – plus an RNLI life boat.\n\n‘We managed to secure the whale to the larger of the boats, the Kew, and then began dragging it. The whale was so big and heavy that the Kew was only able to do one and a half miles an hour.\n\n‘It took us four hours to take it to the Port of London authority facility in Gravesend. It was kept there overnight and ZSL (Zoological Society of London) came and picked it up in the morning.'\n\nRare sightings of the whale had delighted onlookers and whale watchers, who flocked to the banks of the Thames to catch a glimpse of the elusive animal.\n\nExperts say it is likely the juvenile whale made a navigational error and swam up the Thames from the North Sea last week on a spring tide when the water level was at its highest.\n\nLucy Babey, head of science at ORCA, believes it may have become disorientated after not getting enough food.\n\n'From the photographs and reports, it looks like the whale was malnourished and didn't have many fat reserves on it, so it clearly hadn't been feeding properly,' she told MailOnline.\n\n'These animals need big fat reserves for their long migrations when they can travel tens of thousands of miles, and to keep warm in cold water.\n\n'It was clearly in poor nutritional health, which meant it was disoriented and made a navigational error. It would have died anyway even if it was not in the Thames.\n\n‘Why it hadn’t been feeding properly is what we’ll find out in the autopsy.’\n\nRare sightings of the whale had delighted onlookers and whale watchers, who flocked to the banks of the Thames to catch a glimpse of the elusive animal\n\nBenny the beluga whale rose to national fame when he was spotted in the River Thames last year.\n\nExperts believe the juvenile whale made a navigational error and swam up the Thames from the North Sea last week on a spring tide when the water level is at its highest\n\nThe whale has signs of 'historic entanglement' scarring on its dorsal fin but looks unharmed apart from that\n\nAnother humpback whale which entered the Thames 10 years ago is known to have died of starvation.\n\nThe exact cause of Hessy's death will be determined following analysis from the Cetacean Strandings Investigations Programme at London Zoo.\n\nIt is the fifth humpback whale to be recorded stranded in the UK by the programme.", "description": "The magnificent animal, nicknamed Hessy, had been travelling back and forth over a stretch of five miles  after it was first sighted near Dartford Bridge in Kent on Sunday.", "authors": ["Rory Tingle For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/09/13/19489658-0-image-a-73_1570623061635.jpg", "published_at": "2019-10-09"}