{"pub": "reuters", "url": "https://reuters.com/article/us-usa-china-muslims-pompeo/pompeo-says-orwells-1984-coming-to-life-in-chinas-xinjiang-region-idUSKBN1WQ27U", "downloaded_at": "2019-10-11 20:17:12.760480+00:00", "title": "Pompeo says Orwell's '1984' coming to life in China's Xinjiang region", "language": "en", "text": "WASHINGTON (Reuters) - U.S. Secretary of State Mike Pompeo on Friday likened China’s treatment of more than one million Uighur Muslims to George Orwell’s “1984” novel, saying the Communist Party was detaining and abusing them in internment camps.\n\nSpeaking at an American Association of Christian Counselors event in Nashville, Tennessee, Pompeo also said he wished the National Basketball Association (NBA) had acknowledged the situation in the Xinjiang region.\n\nNBA has been grappling with the backlash from a tweet by Rockets General Manager Daryl Morey last weekend in support of Hong Kong anti-government protests. Morey deleted his tweet but\n\nChinese state media has characterized it as the latest example of West meddling in China’s affairs.\n\n“The Chinese Communist Party is detaining and abusing more than one million Uighur Muslims in internment camps in Xinjiang, the western region of China,” Pompeo said. “The pages of George Orwell’s 1984 are coming to life there. I wish the NBA would acknowledge that.”\n\nThe China market is estimated to be worth more than $4 billion for the NBA.\n\nChina has been widely condemned for setting up complexes in remote Xinjiang that it describes as “vocational training centers” to stamp out extremism and give people new skills. The United Nations says at least 1 million ethnic Uighurs and other Muslims have been detained.\n\n(This story changes “province” to “region” in second paragraph.)", "description": "U.S. Secretary of State Mike Pompeo on Friday likened China's treatment of more than one million Uighur Muslims to George Orwell's \"1984\" novel, saying the Communist Party was detaining and abusing them in internment camps.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191011&t=2&i=1439789303&w=1200&r=LYNXMPEF9A1NM", "published_at": "2019-10-11"}