{"pub": "fox", "url": "https://foxnews.com/opinion/steve-hilton-democrats-impeachment-push-on-trump-is-about-undoing-a-populist-revolution-not-principle", "downloaded_at": "2019-10-21 14:54:16.203272+00:00", "title": "Steve Hilton: Democrats' impeachment push on Trump is about undoing a populist revolution, not principle", "language": "en", "text": "From the beginning, it was obvious that for the Democrats, impeachment is partisan politics dressed up as principle. Nancy Pelosi told us that herself the day she kicked off the process.\n\n\"What's more serious is that he [President Trump] can't win,\" Pelosi said.\n\nBut last week, another aspect was revealed, and it shows us what the stakes are in this fight. Day after day on Capitol Hill, we saw a parade of bureaucrats stepping out of the shadows to attack President Trump. Ladies and gentlemen, we present to you, \"Trump Wars: The System Strikes Back.\"\n\nMIKE POMPEO ACCUSES ADAM SCHIFF OF RUNNING 'KANGAROO COURT,' PUTTING AMERICA'S SAFETY AT RISK\n\nThe establishment state media, of course, couldn't stop fawning over these saintly servants of the people.\n\nCNN \"New Day\": Career diplomats are showing up, helping shape a better understanding of the president's Ukraine scandal.\n\nAndrea Mitchell, NBC News chief foreign affairs correspondent: The others are career ambassadors: Mike McKinley, 37-year veteran ...\n\nRep. Hakeem Jeffries, D-N.Y.: You have career diplomats and others stepping forward to tell the truth.\n\nAshley Parker, MSNBC political analyst: I mean, what we're seeing here is -- you're seeing career civil servants whose loyalty is to the institution, to democracy.\n\nNo, it's not. Their loyalty is to their bureaucratic establishment agenda. I've seen this firsthand.\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nThe idea that career civil servants are high-minded, politically neutral oracles of wisdom is a joke. They think Trump is deplorable. They think you're deplorable, and they think any challenge to their globalist establishment ideology is deplorable.\n\nFrom day one, the career civil servants have knocked, blocked and plotted against this president. This week, they went after EU Amb. Gordon Sondland because he was reportedly rude to the Europeans over trade.\n\nMike Pompeo's former aide bleated about \"the utilization of ambassadors overseas to advance a domestic political objective.\" Yes, that's how it's supposed to work. The elected politicians are supposed to be in charge, not the unaccountable bureaucrats.\n\nThe idea that career civil servants are high-minded, politically neutral oracles of wisdom is a joke. They think Trump is deplorable.\n\nAnd of course, the swamp is defending its own, in this case, Swamp King Joe Biden, by arguing that overseas corruption by Democrats shouldn't be investigated.\n\n\"We've never had a president in the whole history of the United States going back to 1789, who invited one of our strongest adversaries, in this case, China, to intervene and interfere in our election,\" Nicholas Burns, former NATO ambassador, told CNN. \"He [Trump] should be impeached by the House. There should be an inquiry by the Democrats and the Republicans. I don't think he's fit for office, based on what he said on China and also on Ukraine.\n\nOh, for goodness sake. I don't recall him and the rest of the arrogant ruling class giving a monkey's --- about foreign interference when its establishment candidates like Hillary Clinton doing it or when they themselves do it, leaving the public sector to work for lobbyists and for foreign companies and foreign governments like James Mattis has just done.\n\nMy God. James Mattis preening in his penguin suit last week, basking in the approval of the ruling class while he cashes in on his public service by selling out America. He's working for a swamp lobbyist that boasts about shipping American manufacturing overseas and selling American defense companies to the highest foreign bidder.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nSo yes, after this week, we can now see the full picture on impeachment for the Democrats -- partisan politics for the ruling class and overturning the populist revolution.\n\nThey must not win.\n\nAdapted from Steve Hilton's monologue from \"The Next Revolution\" on Oct. 20, 2019.\n\nCLICK HERE TO READ MORE FROM STEVE HILTON", "description": "The idea that career civil servants are high-minded, politically neutral oracles of wisdom is a joke. They think Trump is deplorable.", "authors": ["Steve Hilton", "Steve Hilton Is Host Of"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/21/694940094001_6096337443001_6096337705001-vs.jpg", "published_at": "2019-10-21"}