{"pub": "cbs", "url": "https://secure-fly.cbsnews.com/news/amber-guyger-trial-threats-against-officer-who-shot-neighbor-lead-to-increased-security-dallas-police-say", "downloaded_at": "2019-09-27 14:59:09.382303+00:00", "title": "Dallas officer who fatally shot her neighbor gets extra security after receiving threats", "language": "en", "text": "Dallas -- Four Texas officers carrying handguns wait in the dim early morning light for a petite 31-year-old woman to arrive. When Amber Guyger emerges from a black SUV, she is guarded by men with dark suits and close-cropped hair. The armed officers join them, forming a perimeter around Guyger as she walks toward a side door of the yet-to open Dallas courthouse.\n\nThe tension is palpable in Dallas as the white former police officer is on trial for murder in the fatal shooting last September of her unarmed black neighbor, Botham Jean.\n\nDallas Police Association President Mike Mata says the intense media attention and controversy around Jean's death have led to threats that prompted them to pay for additional private security for Guyger and her attorneys. He declined to discuss the threats.\n\nAmber Guyger, who is charged in the killing of Botham Jean in his own home, arrives on the first day of the trial in Dallas, Texas, U.S., September 23, 2019. Jeremy Lock / REUTERS\n\nThe concern about police safety follows an attack three years ago that left five Dallas officers dead. A man angry over the killing of black men by police across the nation, opened fire at the end of a protest, in the deadliest incident against U.S. law enforcement since 9/11.\n\nAs Guyger prepares to testify at her trial, there also is anxiety that if she is acquitted it could spark unrest in Dallas like in Ferguson, Missouri, where no charges were filed against a white policeman who killed Michael Brown in 2014, and protests spawned the \"Black Lives Matter\" movement.\n\n\"There's definitely that kind of foreboding sense of a storm coming,\" said Changa Higgins, a community activist. \"If this trial doesn't get the kind of outcome that people want, and that they really need to have hope, then we may see the same type of reaction that we've seen historically around the country when people lose hope, and feel like they have nothing to lose and they can't look to the justice system to get justice.\"\n\nThe basic facts of the unusual shooting are not in dispute. Guyger walked up to Jean's apartment -- which was on the fourth floor, directly above hers on the third -- and found the door unlocked. She was off duty but still dressed in her police uniform after a long shift when she shot Jean with her service weapon. Guyger was later arrested , fired and charged with murder.\n\nGuyger's lawyer's have called the killing a \"tragic, but innocent\" mistake and say she fired in self-defense after confusing Jean's apartment with her own and mistaking the 26-year-old accountant from the Caribbean nation of St. Lucia for a burglar. Lead investigator David Armstrong said the layout of Guyger's apartment complex could be confusing. \"There were no clear obvious visual signs showing what level you were on,\" he said.\n\nArmstrong testified that Guyger lived directly below Jean and going to the wrong apartment was not uncommon, according to other residents.\n\nThe part of Armstrong's testimony the judge blocked was his view that Guyger acted reasonably and did not commit a crime. That's because that's an opinion.\n\nProsecutors have questioned how she could have missed numerous signs that she was at the wrong apartment.\n\nDallas Police Officer Amber Guyger (L) faces a manslaughter charge for allegedly killing Botham Jean (R) after mistaking his home for her own. Kaufman County, Texas, Jail / AP\n\nDallas police have limited the time off scheduled for officers during the trial, which overlaps the Texas State Fair, but declined to comment further on security preparations. Mayor Eric Johnson said through a spokesman that it would be inappropriate for him to discuss the case while the trial is ongoing. In January, a judge issued a gag order, barring the lawyers involved from speaking about the case in publicly.\n\nA jury will have to decide whether Guyger committed murder, a lesser offense such as manslaughter or criminally negligent homicide, or no crime at all. Even before the jurors were sworn in Monday, the strain of the case was visible.\n\nInside the courthouse, a crush of people passed through two security screenings before gathering outside the room where the trial is being held. Members of Guyger's and Jean's families were allowed in first, but reporters and activists jostled for the few remaining seats, with many being turned away. At various points, a sheriff's deputy raised his voice to tell people not to push.\n\nThe Dallas County Sheriff's Department, which handles security within the courtroom, has brought on additional officers for the trial. A department spokesman, Raul Reyna, declined to elaborate on their security procedures.\n\nThe county Fire Marshals oversee security in the rest of the court building. They are having four officers come in early and four stay late during the trial, said Fire Marshal Robert De Los Santos, who likewise would not give more detail on how the courthouse is secured.\n\nDe Los Santos said there have been other cases where his officers have taken similar precautions. But the Dallas Police Association president said Guyger's trial is the first they've had to hire security for their lawyers or an officer.\n\nThere have been other police shootings \"but it has never reached the level of this,\" said Mata.", "description": "Dallas Police Association president says the controversy around fatal shooting have led to threats that prompted them to pay for additional private security for Amber Guyger", "authors": [], "top_image": "https://cbsnews3.cbsistatic.com/hub/i/r/2019/09/27/2a34551b-22bb-44fd-b0f1-a038dfb94ed4/thumbnail/1200x630/0821d38fac5a835f87796815c9412f2e/guyger-security-2019-09-23t000000z-1748183105-rc181f4d39f0-rtrmadp-3-texas-crime-amber-guyger.jpg", "published_at": "2019-09-27"}