{"pub": "dailymail", "url": "https://thisismoney.co.uk/news/article-7616341/Speed-limit-drop-60mph-40mph-M257-No-Deal-preparations.html", "downloaded_at": "2019-10-28 09:51:32.211846+00:00", "title": "Speed limit will drop from 60mph to 40mph on M257 as part of No Deal preparations", "language": "en", "text": "brexit countdown_bg Created with Sketch.\n\nSpeed limits are to be introduced on the motorway approach to a cross-Channel port to prevent delays in the case of a no-deal Brexit at the end of October.\n\nThe contingency arrangements will see speed limits cut from 60mph to 40mph on the M275 in Portsmouth, Hampshire, from Monday October 28 as part of plans to avoid congestion at Portsmouth International Port.\n\nSimilar measures were introduced in March ahead of the previous proposed date for the UK to leave the European Union but were later reversed after an extension to membership was granted.\n\nA Portsmouth City Council spokesman said: 'The Hampshire Local Resilience Forum (LRF) has been preparing for a reasonable worst-case scenario in the event of a no-deal, with a particular focus on any potential traffic congestion at Portsmouth International Port arising from a change to customs requirements.\n\n'With the possibility of the UK leaving the EU without a deal next week, and the latest national planning assumptions suggesting that up to 70 per cent of HGVs would not be 'border ready' on day one of a no-deal, the contingency arrangements are now being implemented.'\n\nThe contingency arrangements will see speed limits cut from 60mph to 40mph on the M275 in Portsmouth, Hampshire, (pictured) from Monday October 28\n\nNeil Odin, chairman of the LRF strategic coordinating group and chief fire officer for Hampshire Fire and Rescue Service and Isle of Wight Fire and Rescue Service, said: 'Our role within the LRF is to plan for the reasonable worst-case scenario set out in the Government's contingency planning assumptions.\n\n'For many months now, we have been working extremely hard to identify what that is and look at the ways we can mitigate and manage the risks that are likely to arise.'\n\nHe continued: 'Portsmouth International Port's close proximity to the motorway means there is only capacity for 13 lorries before reaching the main roundabout. Without any contingencies in place to prevent queuing, as our reasonable worst-case suggests, this will impact on the road network and beyond.\n\n'Our focus is to keep the port operating, keep the freight going in and out of the UK and enable the population of Portsmouth and Hampshire South to continue to go about their daily lives.'\n\nNeil Odin, chairman of the LRF strategic coordinating group and chief fire officer for Hampshire Fire and Rescue Service and Isle of Wight Fire and Rescue Service, (pictured) said without any contingencies roads in the area would suffer\n\nChecking and holding facilities are being set up on the A31 between Winchester and Alresford and at Tipner on the outskirts of Portsmouth to process HGVs ahead of arriving at the port, with a further section of the A303 to be used as a back-up.\n\nIt comes as it was revealed on Monday that Michael Gove had triggered No Deal Brexit contingency planning after MPs voted to force the Government to request a delay to Article 50.\n\nThe Chancellor of the Duchy of Lancaster insisted that the UK would leave the EU by October 31 despite the setback.\n\nBut he said he would begin Operation Yellowhammer – the Government's preparations for a departure without a deal.\n\nHundreds of civil servants were on Sunday night moved from their regular duties to join the operations.\n\nA Cabinet Office spokesman said: 'We have now entered the final, most intensive stage of the Government's preparations for leaving the EU without a deal.\n\n'This makes sure we will have done everything possible to prepare for leaving the EU without a deal on October 31. Operation Yellowhammer is a cross-government programme of work to ensure that Government is ready.\n\n'It ensures that we are prepared to mitigate impacts of even the potential reasonable worst-case scenario if on October 31 the UK leaves the EU without a deal.'\n\nIsle of Wight Fire and Rescue Service, whose fire chief Neil Odin has said speed limit contingencies need to be in place\n\nAsked on Sunday if he could guarantee that the UK would leave the EU by Halloween, Mr Gove said: 'Yes, that's our determined policy. We know that the EU want us to leave, we know that we have a deal that allows us to leave.'\n\nBut this morning, a senior Government minister slammed Speaker John Bercow for giving 'unprecedented' powers to Remainer MPs - as he admited it will be 'very difficult' for Britain to leave the European Union in five days' time.\n\nBusiness Minister Kwasi Kwarteng blamed Mr Bercow for allowing opposition MPs the opportunity to pass the Benn Act, which demanded Brexit be delayed if a deal had not been ratified by October 19.\n\nThe Prime Minister last week complied with the stipulations of the law by sending a letter to Brussels requesting an extension.", "description": "The contingency arrangements will see speed limits cut from 60mph to 40mph on the M275 in Portsmouth, Hampshire, from Monday October 28.", "authors": ["James Wood For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/12/20214426-0-image-a-24_1572090759265.jpg", "published_at": "2019-10-26"}