{"pub": "yahoo", "url": "https://yahoo.com/lifestyle/meghan-markle-wants-sure-her-152000371.html", "downloaded_at": "2019-10-30 12:11:13.469802+00:00", "title": "Meghan Markle \"Wants to Make Sure Her Boys Are Safe,\" Says Her Close Friend", "language": "en", "text": "Meghan Markle \"Wants to Make Sure Her Boys Are Safe,\" Says Her Close Friend\n\nView photos Photo credit: JEREMY SELWYN - Getty Images More\n\nFrom Country Living\n\nMeghan Markle \"has a lot on her plate,\" according to her close friend and makeup artist, Daniel Martin.\n\nIn a new interview on CBS This Morning, Martin opened up about the pressure the Duchess of Sussex is under, following the airing of the documentary, Harry & Meghan: An African Journey.\n\nMartin also made it clear that Meghan's priorities are the two men in her life, Harry and Archie.\n\nDuchess Meghan has had a busy week, with the broadcast of the documentary all about her royal tour of south Africa with Prince Harry, and multiple appearances for the One Young World Summit.\n\nDuring an interview with ITV's Tom Bradby for Harry & Meghan: An African Journey, Meghan revealed, \"Any woman, especially when they're pregnant, you're really vulnerable. So, that was made really challenging.\" She continued, \"And, then when you have a newborn, and especially as a woman, it's a lot. So, you add this on top of just trying to be a new mom or trying to be a newlywed.\"\n\nAnd according to Daniel Martin, who was responsible for creating Meghan's iconic wedding makeup look, the Duchess of Sussex, \"has a lot on her plate\" right now. During an appearance on CBS This Morning, Martin opened up about how the royal is dealing with the added pressure and media scrutiny.\n\nIn the revealing new documentary #HarryandMeghan, the royal couple share the personal struggles & emotional pain they've been hiding.\n\n\n\nMeghan Markle's close friend & makeup artist Daniel Martin is joined by @TinaBrownLM to provide new insight into the life of the Duchess: pic.twitter.com/NIC3MPLY1V\n\n\n\n— CBS This Morning (@CBSThisMorning) October 24, 2019\n\nWhen asked if he thinks Meghan is a \"weak person,\" Martin firmly replied, \"Not at all.\" He continued, \"I feel like she has a lot on her plate and I feel like she just wants to make sure her boys are safe. I know her, she's gonna totally take care of this. It's just understanding the ways about it.\"\n\nYou Might Also Like", "description": "The duchess' makeup artist, Daniel Martin, also revealed that Meghan \"has a lot on her plate.\"", "authors": ["Amy Mackelden"], "top_image": "https://s.yimg.com/uu/api/res/1.2/ob0W56IgUwRwiTxMzBM99w--~B/aD03MjU7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/country_living_105/e09a3695b1891ef50c8114122e45c35a", "published_at": "2019-10-29"}