{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-england-oxfordshire-49666391", "downloaded_at": "2019-09-12 07:18:46.549142+00:00", "title": "School sorry for GCSE suicide note exercise", "language": "en", "text": "Image caption J. B. Priestley's play, which was adapted by the BBC in 2015, is a GCSE set text\n\nA school that asked pupils to pen a mock suicide note has apologised after a parent complained.\n\nGCSE English students at Cheney School in Headington, Oxford, were set the task as part of studying J.B. Priestley's An Inspector Calls.\n\nOne mother branded the exercise - which invited teenagers to adopt the persona of a young woman in 1912 - a \"massive fail\".\n\nIn a statement, the school said it was \"very sorry for any distress caused\".\n\n'No warning'\n\nThe mum, who asked not to be named, said she felt \"uncomfortable and uneasy\" and \"genuinely shocked\" when her child told her about the writing task.\n\n\"The actual assignment was 'imagine you are a young woman in 1912 writing a suicide letter to those who care about you'\", she said.\n\n\"[There was] no warning, no support, no encouragement.\"\n\nThe woman, who has a relative who attempted suicide, wrote a concerned letter to the school's Head of English.\n\nSpeaking to the BBC, she added: \"I genuinely feel it could be done well to raise awareness of teen mental health and suicide, but this was a massive fail.\n\n\"It is a tumultuous time for them as teenagers.\"\n\nImage copyright Google Image caption The group at Cheney School was studying An Inspector Calls\n\nThe events of the 1945 play, which is a GCSE set text, are set in motion after the character of Eva Smith dies.\n\nShe leaves behind a letter and a diary, but is never seen in the play.\n\nIn a statement, the school said the suicide note exercise was part of a \"wider topic on social responsibility\".\n\nIt said it was \"delivered sensitively\" and students who found it distressing \"could excuse themselves from the lesson\".\n\nThe writing task has since been reviewed and \"adjusted accordingly\", it said, but stated that the curriculum had to address \"many difficult issues\".\n\n\"We will always look to reflect on our teaching and learning practice to make improvements,\" it added.", "description": "A mother called the decision to ask pupils to carry out the task a \"massive fail\".", "authors": [], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/D5E3/production/_108755745_mediaitem108752331.jpg", "published_at": "2019-09-11"}