{"pub": "wsj", "url": "https://wsj.com/articles/appraising-inherited-or-donated-artwork-11568167200?mod=rsswn", "downloaded_at": "2019-09-11 14:00:36.901556+00:00", "title": "Appraising Inherited or Donated Artwork", "language": "en", "text": "People who inherit artwork, or donate a piece to a museum or other nonprofit face a common goal: Don’t run afoul of the Internal Revenue Service.\n\nEasier said than done, unfortunately. Because without a purchase price to guide them, tax filers can find themselves embroiled in a debate with the IRS about the value of inherited or donated work.\n\nSo how can taxpayers avoid that costly debate? While there’s no guaranteed path, lawyers and art experts say there are a few things taxpayers should know about reporting the value of art to the IRS:\n\n• When donating art worth $5,000 or more, tax filers must hire an appraiser to value the pieces and attach the appraiser’s name to their tax returns. If the pieces are valued at $20,000 or more, the appraisal itself must be attached to the return.\n\n• For inherited pieces, an appraisal must be included with the estate-tax return if the work or collection is valued at more than $3,000.\n\n• To get the most accurate estimate of artwork, tax filers should hire an appraiser experienced in valuing the specific pieces in question, whether they be paintings, drawings, prints, textiles, rare manuscripts, antiquities or any other of the myriad categories of art. The appraisal should include multiple high-resolution images of the pieces, which will be needed if the IRS decides to take a closer look. The cost of an appraisal generally ranges from $150 to $600 an hour, according to Alex J. Rosenberg, a Manhattan-based appraiser and past president of the American Society of Appraisers.\n\n• If donated or inherited artwork is estimated to be valued at $50,000 or more, the tax filer’s appraisal will get an automatic review by a group of IRS appraisers known as the Art Appraisal Services. Sometimes appraisals—for instance, those involving objects about which there may be questions regarding authenticity, condition or some other complicating variable—are forwarded for additional review to the IRS Commissioner’s Art Advisory Panel, a group of 16 or 17 outside art and antique dealers, museum curators, scholars and art advisers. The panel’s recommendations go back to the Art Appraisal Services and are included in the IRS’s determination of what the taxpayer may owe.\n\n• If either the Art Appraisal Services or the Art Advisory Panel find that valuations have been under- or overstated, the taxpayer may be subject to additional tax liability, interest on that amount and possible penalties. According to the IRS, 55% to 65% of the valuations submitted annually to the Art Advisory Panel result in adjustments.\n\n• Taxpayers and appraisers determine valuation based on the fair market value of an object as of a certain day—for instance, when the owner dies or when it is donated to a museum. The Art Appraisal Services unit and the Art Advisory Panel, however, may use comparable sales information beyond that date. That can be up to a year or more later to determine value. (The groups’ assessments of appraisals usually take place three or four years after filings are submitted).\n\n• For taxpayers who want to dispute the findings of either the Art Appraisal Services or the Art Advisory Panel, there is an appeals process and, finally, Tax Court.\n\nMr. Grant is a writer in Amherst, Mass. You can email him at reports@wsj.com.", "description": "Failure to correctly determine the fair market value of inherited or donated art can lead to costly dealings with the IRS.", "authors": ["Daniel Grant", "Brian J. O Connor", "Glenn Ruffenach", "Kevin Mcallister"], "top_image": "https://si.wsj.net/public/resources/images/JR-AA115_WEARTP_SOC_20190909140137.jpg", "published_at": "2019-09-11"}