{"pub": "telegraph", "url": "https://secure.telegraph.co.uk/football/2019/10/15/gareth-southgate-england-made-bigger-statement-racism-team-has", "downloaded_at": "2019-10-15 23:09:54.136532+00:00", "title": "Gareth Southgate: England made a bigger statement on racism than any team has ever has done in international football", "language": "en", "text": "Gareth Southgate claims England “made a bigger statement than any team has done in international football” after invoking the Uefa protocols due to the sickening racial abuse suffered during the Euro 2020 qualifier away to Bulgaria.\n\nThe England manager added that his team had made the world “aware” that it was an issue they were not prepared to accept as the match was stopped twice in the first half after formal complaints were made to Croatian referee Ivan Bebek.\n\nSouthgate said England were “very clear” with Uefa and the Bulgarian authorities at half-time that they were prepared to take further action and would have expected to walk off had they heard more abuse in the second half.\n\nAt one stage, Southgate explained, he had turned to his assistant Steve Holland and said he did not expect the game to be completed. “We were sat [there] 10 minutes from half-time, Steve and myself, saying, ‘I don’t think we are going to finish this game’. We knew that if we came off the pitch, we probably wouldn’t be going back on and we were very clear, as a group at half-time, that if anything happened in the second half, we would discuss this with the referee and he was also clear that everyone was going off.”", "description": "Gareth Southgate claims England “made a bigger statement than any team has done in international football” after invoking the Uefa protocols due to the sickening racial abuse suffered during the Euro 2020 qualifier away to Bulgaria.", "authors": ["Jason Burt", "Chief Football Correspondent", "Paul Hayward"], "top_image": "https://www.telegraph.co.uk/content/dam/football/2019/10/15/TELEMMGLPICT000213041044-xlarge_trans_NvBQzQNjv4BqF9BD_fYQB0teZOF4IslN2TSn4mbJSlWY2OEDy_ToFOc.jpeg?imwidth=1200", "published_at": "2019-10-15"}