{"pub": "investingcom", "url": "https://investing.com/analysis/stocks-stage-late-rally-despite-feds-caution-toward-further-rate-cuts-200465999", "downloaded_at": "2019-09-19 09:43:34.595314+00:00", "title": "Stocks Stage Late Rally Despite Fed’s Caution Toward Further Rate Cuts", "language": "en", "text": "Stocks Stage Late Rally Despite Fed’s Caution Toward Further Rate Cuts\n\nMatthew WellerStock Markets 1 hour ago (Sep 19, 2019 03:49AM ET) By\n\nwww.investing.com/analysis/stocks-stage-late-rally-despite-feds-caution-toward-further-rate-cuts-200465999 Stocks Stage Late Rally Despite Fed’s Caution Toward Further Rate Cuts By By Matthew Weller | 1 hour ago (Sep 19, 2019 03:49AM ET)\n\nFollow Daily % Candles (From Asia Open) As expected, the Federal Reserve opted to cut interest rates 0.25% to the 1.75-2.00% range today. In its accompanying economic projections, most Fed policymakers projected that the central bank was done cutting interest rates for the year, though Fed Chairman Powell did hint at the potential for further balance sheet expansion depending on how conditions evolve. FX: The pound and US dollar were the strongest major currencies today, while the and brought up the rear. Commodities: Oil dropped another -2% today as President Trump seemingly opted for “a diplomatic response” (including additional sanctions) on Iran rather than a military response. Gold fell nearly -1%. A couple of the major altcoins surged today, with both (ETH, +2%) and (XRP, +10%) seeing noteworthy rises. Cryptocurrency benchmark remains mired around the 10,200 area. US Cash Indices % Change US indices closed mixed after a late rally as Fed Chairman Powell moderated the hawkish tone of the central bank’s statement. Energy (XLE (NYSE: )) once again brought up the rear among the major sectors; Financials (XLF) led the way to the topside. Stocks on the move: FedEx (NYSE: ) dumped -13% after cutting its outlook for 2020 and warning on risks to the global economy. McDermott International (MDR) collapsed -63% after announcing that it engaged a turnaround consulting firm. Recent IPO Chewy Inc (CHWY) slumped -6% after reporting a larger-than-expected loss Economic Calendar Original Post\n\nStocks Stage Late Rally Despite Fed’s Caution Toward Further Rate Cuts", "description": "Stocks Analysis by Matthew Weller covering: AUD/USD, NZD/USD, FedEx Corporation, Energy Select Sector SPDR. Read Matthew Weller's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-19"}