{"pub": "dailymail", "url": "https://dailymail.co.uk/money/meandmymoney/article-7515445/Bass-guitarist-Bruce-Foxton-sticks-Jam-hits-safer-playing-stock-market.html", "downloaded_at": "2019-10-05 06:46:36.846861+00:00", "title": "Bass guitarist Bruce Foxton sticks to Jam hits - as it's safer than playing the stock market", "language": "en", "text": "That's entertainment: Bruce Foxton, the Jam's bassist still loves playing the band's hits\n\nMusic star Bruce Foxton made more money last year than he ever did when he was playing in The Jam in the late 1970s and early 1980s.\n\nThe legendary bass guitarist, now 64, says he was paid just £150 a week when he signed a record deal for The Jam, along with Paul Weller.\n\nThe band, he says, went on to earn silly money: tens of thousands of pounds for five or six minutes of their time.\n\nNowadays, he spends most of the year on tour with bandmate Russell Hastings in From The Jam, playing songs by The Jam – except in February when they both take a month-long holiday in Barbados to relax and play golf.\n\nTheir UK From The Jam tour starts on October 10. Tickets are available at: fromthejamofficial.com/tour.\n\nWhat did your parents teach you about money?\n\nTo respect it. I came from a working class family. My dad sold coal door-to-door before becoming a painter and decorator for Woking council. My mum worked in a bakery and then a sports shop.\n\nI never wanted for anything when I was growing up. My parents were careful with money and always tried to do their best for us. They worked hard and had to make sacrifices to take us on holiday.\n\nOccasionally Dad would put things on the 'never never'. I remember him buying a radiogram – a radio and a record player – on hire purchase and my mum hitting the roof about it. But in the end, that radiogram came in handy – we enjoyed it a lot.\n\nHave you ever struggled to make ends meet?\n\nNo. After I left school at 15, I got an apprenticeship as a printer earning rubbish money: a fiver a week. But I was living at home and I never had to struggle like I know my parents did. Even after I joined The Jam I carried on working as a printer to keep my wages coming in.\n\nOverall the company was great about it, but their patience did wear a bit thin. I would be out with the band all night, come in late for work and they'd then have words with me. I did that for about six months until The Jam got signed. I think I started making about £150 a week back then. I was 20 at the time. It was amazing.\n\nBut when I told my mum I was going to stop being a printer and go off with The Jam, she wasn't keen. I had only just finished my five-year apprenticeship and qualified. I told her: 'I'll just give it six months and see what happens.' I kept my printer's union card right up until 1980. I treated it like a lucky mascot.\n\nThe Jam (Rick Buckler, Paul Weller and Bruce Foxton) performing in Hammersmith in 1977\n\nHave you ever been paid silly money?\n\nYes. There was one gig several years ago in Hong Kong. We were supposed to play some songs in the interval of a rugby tournament. But the live TV programme overran and in the end we only played one and a half songs.\n\nJam songs are short so it only took us five or six minutes to do that and we earned a five-figure sum. We had a good time on that trip.\n\nWhat was the best year of your financial life?\n\nThe past year probably. The audiences at our tours just keep getting bigger. I think that's down to what we do on stage. People still want to hear those great Jam songs played live.\n\nWhat is the most expensive thing you bought for fun?\n\nIt was a convertible Jaguar XK Portfolio in British racing green. My friends rib me because I never take it out except on special occasions and when the weather is good. I bought it new in 2010 for £68,000 and I've only done 7,000 miles. Sometimes when I get in it, I have to familiarise myself with the controls again.\n\nHolidaying in Barbados: Foxton & Russell Hastings like to go there every winter for a month\n\nThe best money decision you have made?\n\nBuying my home. It's a four-bedroom Grade II-listed 500-year-old cottage in Surrey. I bought it six years ago and it's probably gone up about 20 per cent in value since then. I love living there because the house is in a really quiet location in the countryside.\n\nI'm out on the road making a racket for a lot of the year. When I come home, it's nice to be somewhere so peaceful and quiet.\n\nDo you save into a pension?\n\nI used to. I took out a lump sum recently to pay some of my mortgage off. I think it's a good way to save for retirement if you can afford it.\n\nDo you invest directly in the stock market?\n\nNo. I don't understand it well enough. I'm a 'play it safe' person. It's a big gamble in my opinion. I'd rather get a lower return on my money and take fewer risks.\n\nWhat is the one little luxury you treat yourself to?\n\nHolidaying in Barbados. I like to go out every winter for a month. I love the sun and listening to the sound of the Caribbean sea lapping on the shore. Russell [Hastings, guitarist in From The Jam] and his family come too.\n\nWe stay in separate villas, play a bit of golf – badly – and just relax.\n\nIf you were Chancellor what would you do?\n\nReduce income tax rates for everyone. I think they're too high at the moment.\n\nHigher earners should carry on paying a bit more than lower earners, but I think all taxpayers should pay less.\n\nDo you donate money to charity?\n\nYes, particularly cancer charities. I lost my brother, mother and father to cancer so it's important for me to donate a little money every now and again to cancer charities.\n\nWhat is your number one financial priority?\n\nTo pay the mortgage. Pure and simple.", "description": "Music star Bruce Foxton made more money last year than he ever did when he was playing in The Jam in the late 1970s and early 1980s.", "authors": ["Donna Ferguson For Mail On Sunday", "Some Links In This Article May Be Affiliate Links. If You Click On Them We May Earn A Small Commission. That Helps Us Fund This Is Money", "Keep It Free To Use. We Do Not Write Articles To Promote Products. We Do Not Allow Any Commercial Relationship To Affect Our Editorial Independence."], "top_image": "https://i.dailymail.co.uk/1s/2019/09/28/20/19051694-0-image-a-143_1569697703363.jpg", "published_at": "2019-09-28"}