{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7624873/Pride-Britain-2019-Corries-Sally-Lindsay-takes-dramatic-tumble.html", "downloaded_at": "2019-10-29 08:03:35.635361+00:00", "title": "Pride Of Britain 2019: Corrie's Sally Lindsay takes a dramatic tumble", "language": "en", "text": "Advertisement\n\nMonday evening was a night of the stars, with a legion of celebrities making a dazzling appearance at the annual Pride Of Britain Awards in London.\n\nAnd while the glitzy guests made a stunning red carpet appearance before watching the heartwarming show, it seemed some of the celebrities - including Corrie's Sally Lindsay, Ferne McCann and Emily Atack - were all partied out by the end of the evening as they departed in bleary-eyed style.\n\nThe soap veteran, 46, suffered a mishap as she departed the venue when she took a dramatic stumble before the I'm A Celeb stunners headed out having appeared to party up a storm.\n\nOops! Coronation Street's Sally Lindsay took a fall as she led the stars in leaving the Daily Mirror Pride Of Britain Awards on Monday evening\n\nSally was leading the stars departing the bash, with the Corrie stunner, 46, suffering a fall as she left which culminated in a security guard and two fellow revellers helping her up.\n\nFar from being annoyed at the mishap, she was in peals of laughter as she was assisted and then was seen hugging and greeting football legend and TV personality Chris Kamara.\n\nMore than 100 of the UK's biggest stars came together at the Daily Mirror Pride Of Britain Awards to honour the nation's unsung heroes on the landmark 20th anniversary of the event. The awards recognise and celebrate ordinary people up and down the country doing extraordinary things.\n\nHosted by Carol Vorderman, celebrities and public figures including Prince Charles, Robert Downey Jr, Sir Ben Kingsley, Dua Lipa, Ant & Dec, Chris Pratt, Michael Sheen, Adam Lambert, Christine Lampard, Sir Michael Caine, Jonathan Ross, Suranne Jones, and the judges and casts of Strictly Come Dancing and X Factor honoured this year's awe-inspiring winners.\n\nCarol Vorderman said: 'Pride of Britain is such a huge part of my life, it's hard to believe it's 20 years since we first started. In that time, it has found a place at the heart of British life, and the winners represent the very best of us. I never fail to be humbled by them, and this year's are no different.'\n\nOh no! Ferne McCann and Emily Atack were equally wild as they headed out of the bash", "description": "The soap veteran, 46, suffered a mishap as she departed the venue when she took a dramatic stumble before the I'm A Celeb stunners headed out having appeared to party up a storm", "authors": ["Ciara Farmer For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/29/07/20314140-0-image-a-22_1572335155544.jpg", "published_at": "2019-10-29"}