{"pub": "cbc", "url": "https://cbc.ca/sports/olympics/summer/trackandfield/the-buzzer-mens-100m-preview-1.5298483", "downloaded_at": "2019-09-26 20:55:40.396693+00:00", "title": "Sports-no-CBC", "language": "en", "text": "For the first time since the 2007 track and field world championships, a major men's 100-metre event will be run without Usain Bolt.\n\nThe Jamaican legend owned this race for nearly a decade. With the exception of the 2011 worlds, where he was DQ'd for a false start in the final, Bolt won every 100m title in the Olympics and world championships from 2008 through 2016 (and also every 200 and 4x100). The winning streak didn't end until his final meet — the 2017 worlds in London, where he finished third in the 100 and went down with an injury while running the anchor leg of the relay. Right up until the end, Bolt was must-see TV.\n\nBut even with the greatest sprinter of all time out of the picture, the men's 100 remains the marquee event of this year's world championships, which open Friday in Doha and feature the 100 heats on Day 1.\n\nAs always, there's a great cast of characters battling for the title of World's Fastest Man. It includes two American favourites who have been clouded by either doping or doping-adjacent controversies, and two Canadian medal contenders — one you know, the other you should know more about.\n\nHere's the info you need to get ready for track's most interesting event:\n\nThe favourites\n\nJustin Gatlin is the defending champ. The American defeated Bolt at the last worlds, in 2017, to win his second 100m world title. It came an incredible 12 years after his first, which is both impressive and problematic. The gap hints at both Gatlin's advanced age today (37) and the fact that he served a four-year ban between 2006 and 2010 after failing a doping test for the second time. He also served a one-year ban for a positive test in 2001 before going on to win his only Olympic gold medal in 2004.\n\nEven though he's ancient by sprinting standards, Gatlin is still very fast. Of all the men he'll face at the world championships, only two have run a faster 100 this year than the 9.87 he put down in June at a Diamond League meet in California.\n\nAfter taking silver behind Gatlin (and ahead of Bolt) in 2017, Christian Coleman is the clear favourite to win this time. In that same June race where Gatlin ran his 9.87, Coleman laid down a 9.81 to beat him. That's the world's fastest time this year, and the 23-year-old American owns three of the top five. He also had the top time in both 2017 and '18. Coleman is the best 100m sprinter in the world — now he just needs to prove it by winning his first major title.\n\nIf that happens, though, it won't be without controversy. Coleman missed three drug tests over a 12-month span, which is supposed to count as a positive test and result in a lengthy suspension. But the U.S. Anti-Doping Agency decided to give him a pass on a technicality related to the date on which one of the tests occurred, allowing him to compete in Doha. Coleman has never failed a drug test, and he insists he's clean, but a lot of track fans (especially outside the U.S.) will raise an eyebrow if he wins.\n\nAmericans Christian Coleman, left, and Justin Gatlin are expected to battle it out for gold. (Submitted by IAAF)\n\nThe Canadians\n\nYou know Andre De Grasse. At the 2016 Olympics, he became the most famous Canadian sprinter since Donovan Bailey when he went toe-to-toe with Bolt and came away with three medals — silver in the 200, bronze in the 100 and 4x100. But De Grasse has fallen on hard times since then. Hamstring injuries ruined his 2017 and '18 seasons, and although he's looked better this year, he still hasn't recaptured his 2016 magic. Eleven men have bettered his season-best time of 9.97.\n\nYou may not know Aaron Brown, but he looks just as good as De Grasse right now. Brown has beaten him in the Canadian championship final two years in a row, and this year his top time of 9.96 (in the Canadian final) is slightly faster than De Grasse's. However, that's Brown's only sub-10-second race of the year. De Grasse has three. Both guys have a shot at a medal at the world championships — just don't count on it.\n\nDespite following similar paths in their careers, Canada's Andre De Grasse and American Christian Coleman have yet to race each other professionally in the 100 metres.. CBC Sports' Anson Henry sets up the much-anticipated 100-metre showdown at the upcoming track and field worlds. 1:38\n\nThe darkhorses\n\nIt's a shame Noah Lyles decided to focus on the 200 metres, because only Coleman has run a faster 100 than Lyles this year. A showdown between the two young Americans would have been great to see. Maybe next year: Lyles plans to go for the 100-200 double at the Tokyo Olympics.\n\nWith Lyles out, Divine Oduduru might have the best chance to break up the Coleman-Gatlin 1-2 finish a lot of people are expecting. The Nigerian's top 2019 time of 9.86 seconds matches Lyles', and it's faster than Gatlin's. He also ran a 9.94.\n\nCravon Gillespie (9.93) and Michael Rodgers (9.97) give the U.S. two more podium threats. Britain's Zharnel Hughes has four sub-10 races under his belt this year, including a 9.95. South Africa's Akani Simbine has gone under 10 three times, and Ivory Coast's Arthur Cissé has done it twice. Jamaica's Yohan Blake is still kicking around eight years after stealing the world title when Bolt DQ'd. He's 29 now, but still spry enough to run three sub-10s this year.\n\nThe schedule\n\nThe preliminary round (kind of a play-in game for sprinters on the bubble) is Friday at 9:35 a.m. ET. Then the big guys come in for the heats starting at 11:05 a.m. ET. The semis and final are Saturday at 11:45 a.m. ET and 3:15 p.m. ET, respectively. The final will be shown live on the CBC TV network, and CBCSports.ca is streaming everything live here. You can add the full streaming schedule to your calendar here.\n\nThis is an excerpt from The Buzzer, the CBC Sports daily newsletter. Stay up to speed on what's happening in sports by subscribing below.", "description": "Here's what you need to know to get ready for the marquee event of the track and field world championships.", "authors": [], "top_image": "https://i.cbc.ca/1.5249642.1569522351!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/coleman-christian-081619.jpg", "published_at": "2019-09-26"}