{"pub": "npr", "url": "https://npr.org/2019/10/29/774339834/can-dolly-parton-heal-america", "downloaded_at": "2019-10-29 23:56:02.660682+00:00", "title": "Can Dolly Parton Heal America?", "language": "en", "text": "Can Dolly Parton Heal America?\n\nEnlarge this image toggle caption Christine de Carvalho/WNYC Christine de Carvalho/WNYC\n\nCan Dolly Parton heal America? That's the question posed by a new podcast from WNYC, Dolly Parton's America, hosted by Radiolab's Jad Abumrad. It's not as far-fetched as you might think.\n\nThe public radio host saw something in the iconic country singer — the way she's composed of contradictions — that seemed somehow revelatory of the country as a whole. Dolly's concert-attending fan base is composed of people we don't think of having a lot in common these days.\n\n\"You've got evangelical church ladies standing next to men in drag — Dolly is massive in the LGBTQ community — standing next to guys in trucker hats,\" Abumrad says. \"All of these different communities, on either side of the 'culture wars,' all standing together, shoulder-to-shoulder, singing the same song.\"\n\nNPR's Ari Shapiro spoke to Abumrad about reexamining Dolly's cultural legacy, including her overlooked musical genius, her ability to exist as a container for so many ideas about America and her unexpected rejection of the label \"feminist.\" Hear the story in the audio player above and read on for an edited transcript of their conversation.\n\nAri Shapiro: To talk for a minute about Dolly, the person and the musician, rather than Dolly, the metaphor and the symbol: You, in the very first episode, talk about the way she is perceived, the jokes about her appearance — the jokes she makes herself. And then you pivot to the argument that she is among the best songwriters of the 20th century. One expert tells you that, if she were alive at a different time, she would have been like Mozart. How do you reconcile those two aspects of Dolly Parton, the genius and the punchline?\n\nJad Abumrad: I don't quite know how to reconcile them. But it does strike you when you look back at 1960s Dolly and 1970s Dolly, and you look at the number of songs that she's writing — I mean, to say she was prolific doesn't even capture it. She is writing No. 1 song after No. 1 song. Some of the greatest songs in pop music, they're falling out of her head.\n\nShe told me in one interview — she wasn't sure if this was true — but she may have written \"I Will Always Love You\" and \"Jolene\" on the same night. \"I Will Always Love You\" is a song that hit No. 1 in three consecutive decades [and] almost did it a fourth time. \"Jolene\" is a song that was translated into, I think, 40 different languages, and there are 200 different covers. And that happened on the same night?\n\nSo why does somebody who can do that need to be a caricature, need to be a parody? Is it just the reality of existing as a woman in America and in Nashville at that time?\n\nYeah, I think so. I mean, that's certainly what she said to me. If you consider Dolly in 1967, when she really hits the scene as the \"girl singer\" on The Porter Wagoner Show — at that time, there were no lead roles for women. I mean, the female singer was sort of a decorative aspect of the male show, and that didn't leave a lot of place for someone like Dolly, so she perhaps had to sort of play the male game for a while. But I think she would tell you, as she famously says, that it's just what made her comfortable. It's just how she wanted to look.\n\nThe first episode of the podcast has already sparked a vigorous discussion about feminism, and what it means to call yourself a feminist. Because in your conversations with Dolly, she really bristled at that label.\n\nShe shot that right down.\n\nHer quote to you was, \"I think of myself as a woman in business. I love men.\" Even though her actions and her song lyrics and her life are embraced by so many feminists, right?\n\nYeah. That was a real surprise to me. She is talked about openly as one of the great feminist figures of our time, and so I just figured she thought of herself that way. But clearly she has a complicated relationship to that term, as do many people who grew up in places in America that aren't the coasts. So yeah, it was interesting to see the ways in which she very much walks the walk, but doesn't quite want to talk the talk, because she knows how that might be perceived by certain segments of her audience.\n\nHow many hours did you spend with her? She gave you a lot of access.\n\nI think we counted 12, over two years.\n\nAnd this is a woman who has been interviewed hundreds of times, or thousands of times, over decades. Did you feel, going into those conversations, like there were a lot of questions she had never been asked?\n\nThere was a moment when we began to ask her questions about some of her early music, which no one ever asks her about, and her songwriting, which very few people ask her about. 1960s Dolly is just an ocean of pain in her songs — mostly witnessing the female pain around her, I think, in her community growing up.\n\nShe described that early music to you as \"sad-ass songs.\" They address death, miscarriages, abandonment, things like that.\n\nIt's a really interesting, almost musical form of journalism that you're seeing in that early work. And I think when she saw that we were taking her really, really seriously as a songwriter and as a person who is one of the great creative spirits of the last 60 years, she was willing to answer almost any question.\n\nThe series seems to present this big question of whether Dolly can heal the divide in our nation — whether there is some kind of secret sauce in Dolly Parton that can solve the problems that face America today. Did you feel like you came away with an answer to that question?\n\nNo, that's sort of the question that never resolves for me. The image that runs through the entire series is what it is like to be at a Dolly concert. The fact that that space even exists in America right now is heartening to me. [Now,] to argue the other side — I mean, are these people really talking to each other? Are they arguing about politics and coming to some new understanding? Probably not. But they're in the same space, and they're been deeply polite in her presence. That feels like something to me.\n\nDoes she feel like she's created that, or just like she's fortunate to be in it? Does it feel precarious to her — did you get a sense of that?\n\nI mean, she's so deeply apolitical, at least in what she says, that I think she protects that space by choosing not to speak on certain topics. And I don't think she's avoiding something so much as she's sort of putting her foot down in a different spot.", "description": "NPR's Ari Shapiro talks to WNYC's Jad Abumrad about his new podcast which explores the life and legacy of the prolific songwriter and her ability to bridge the divide in America.", "authors": ["Ari Shapiro", "Kat Lonsdorf"], "top_image": "https://media.npr.org/assets/img/2019/10/29/dolly-parton-standalone-image_c-christine-de-carvalho_wide-aca569f902b3b009f48f4cee2e7660ff8dd563e7.jpg?s=1400", "published_at": "2019-10-29"}