{"pub": "yahoo", "url": "https://sg.news.yahoo.com/ghosn-wants-case-dismissed-over-prosecutor-misconduct-015717257.html", "downloaded_at": "2019-10-24 04:31:18.201112+00:00", "title": "Ghosn wants case dismissed over 'prosecutor misconduct'", "language": "en", "text": "Ghosn is out on bail in Tokyo, awaiting trial on four charges of financial misconduct Ghosn left his Tokyo detention centre after winning bail on April 25 to prepare his defence against multiple charges of financial misconduct\n\nEx-Nissan chief Carlos Ghosn on Thursday urged a Tokyo court to dismiss the case against him, accusing Japanese prosecutors of a \"pervasive pattern of illegal misconduct\".\n\nThe claims, made in two filings to the Tokyo District Court, allege prosecutors colluded with Nissan and effectively subcontracted out their investigation to employees of the automaker who were trying to oust Ghosn.\n\n\"The court filings demonstrate that the prosecutors' case, which was politically motivated and poisoned from the start, is fundamentally flawed and contradicted by the evidentiary record,\" Ghosn's lawyers said in a statement.\n\nGhosn is out on bail in Tokyo, awaiting trial on four charges of financial misconduct. He denies any wrongdoing and laid out his defence again Thursday.\n\nBut he and his lawyers argue the entire case against him is \"fundamentally flawed\".\n\nThe filings allege the creation of a \"secret task force\" at Nissan created to \"drum up allegations of wrongdoing by Mr. Ghosn as a pretext to remove him\".\n\nThey formalise claims Ghosn has made previously -- that the allegations against him stem from resentment within Nissan over his plans to more closely integrate the firm with its alliance partner, French automaker Renault.\n\nAlong with Mitsubishi Motors, Nissan and Renault form a leading auto alliance, but relations inside the partnership have been tense at times.\n\nGhosn's legal team claim the opposition to further integration of the car firms drew in even government officials from the Ministry of Economy, Trade and Industry (METI).\n\n\"The prosecution against him resulted from unlawful collusion between the prosecutors, government officials at METI, and executives at Nissan,\" Ghosn's legal team said in a statement.\n\n\"Their goal: to oust Mr. Ghosn in order to prevent him from further integrating Nissan and Renault, which threatened the autonomy of one of Japan's industry flagships.\"", "description": "Ex-Nissan chief Carlos Ghosn on Thursday urged a Tokyo court to dismiss the case against him, accusing Japanese prosecutors of a \"pervasive pattern of illegal misconduct\".  The claims, made in two filings to the Tokyo District Court, allege prosecutors colluded with Nissan and effectively subcontracted", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/rPjzJHPa5_L3dY5WhGFpEw--~B/aD01NDg7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_sg/News/AFP/2a0109cc22006455a856ba7c2e82df1ded38eaf4.jpg", "published_at": "2019-10-24"}