{"pub": "yahoo", "url": "https://sports.yahoo.com/week-1-fantasy-wrap-tom-brady-and-pats-look-unstoppable-050359327.html", "downloaded_at": "2019-09-09 08:36:13.942447+00:00", "title": "Week 1 Fantasy Wrap: Tom Brady and Pats look unstoppable", "language": "en", "text": "Tom Brady exploded for a big game Sunday night. (Getty Images)\n\nThe Patriots entered with an improved defense and dominated the Steelers, 33-3, and will be welcoming Antonio Brown to the team this week. Tom Brady didn’t look 42 years old, ripping off 9.5 YPA with a 3:0 TD:INT ratio, showing good rapport with Phillip Dorsett (who looked great but will now be counting on injuries to be relevant again) on two long scores while taking just one sack against last year’s league-leaders. Brady’s ADP is going to look silly in hindsight at the end of the year … Ben Roethlisberger, conversely, looked like he missed Brown and reverted to Bad Ben on the road. Consider this a mulligan for the Steelers’ offense, which should get back on track at home next week before traveling to San Francisco for what should be a high-scoring game.\n\nScroll to continue with content Ad\n\nDonte Moncrief turned 10 targets into just seven yards and couldn’t secure the ball, while JuJu Smith-Schuster hobbled off late (hopefully it’s not serious) … Sony Michel had a night to forget (15 carries for 14 yards), but he’s going to score an awful lot of touchdowns this season if he can stay healthy … Rex Burkhead is clearly ahead of rookie Damien Harris for now, and the Patriots’ next five games are @Mia, NYJ, @Buf, @Was, and NYG, and did I mention they now get Antonio Brown? ... The Steelers showed little interest in competing Sunday night, kicking a field goal down 20-0 from the one-yard line, although I suppose they did avoid a shutout.\n\nAtlanta Falcons @ Minnesota Vikings\n\nStory continues\n\nKirk Cousins attempted just 10 passes, so thankfully he stole a goal-line rushing score. Still, in a home matchup against the defense that allowed the most fantasy points to quarterbacks last season, Cousins didn’t even reach 100 passing yards, and it’s a game plan Minnesota wants to use weekly … Dalvin Cook looked terrific and only health will prevent him from finishing as a top-10 overall fantasy player (backup Alexander Mattison looked plenty capable of stepping in if need be ... Austin Hooper secured all nine of his targets, while Stefon Diggs continued his career trend of not producing while playing injured … Julio Jones has now scored nine touchdowns over his last 10 games after scoring just three over his previous 23 contests.\n\nWashington Redskins @ Philadelphia Eagles\n\nCarson Wentz’s deep ball sure seemed like a perfect fit with DeSean Jackson, and they wasted no time proving it on the field, although the Eagles’ running game could be an even bigger headache than fantasy gamers anticipated if 36 year old Darren Sproles is going to see that much work. It’s unlikely the 5-foot-6 back will hold up long at his age, but Jordan Howard and Miles Sanders really disappointed in this favorable setup … What a play by Vernon Davis … Two days after being named 2018 offensive team MVP, Adrian Peterson received the first healthy scratch of his career. Derrius Guice is going to be matchup-dependent, but it sure will help if this passing attack actually has life … Many in Survivor leagues were sweating with Philadelphia down 20-7 at halftime (despite Jonathan Allen leaving early), but the Eagles smartly went for two up 27-20 (and ran a QB sneak on fourth-and-short from their own 35-yard line at another point).\n\nBuffalo Bills @ New York Jets\n\nDespite Josh Allen committing four turnovers by halftime (and losing the TO margin -3 on the road), the Bills pulled off a nice comeback victory, while Devin Singletary clearly earned more work … Le’Veon Bell saw the majority of touches in New York’s backfield and was the recipient of this nice two-point conversion … Jamison Crowder saw a whopping 17 targets but somehow turned 14 catches into fewer than 100 yards. His value depends greatly on your format being PPR or not.\n\nBaltimore Ravens @ Miami Dolphins\n\nLamar Jackson had a monster game despite attempting just 20 passes and rushing for only six yards, as he tossed five TDs effortlessly. This Miami team is in deep trouble and in full tank mode, but it’s hard not to be impressed with the rapport Jackson had with Marquise Brown, who’s going to be awfully popular in FAAB bids this week … Baltimore is ruthless, first faking a punt up 35-3 in the first half and later going for it and throwing on fourth down up 52-10 with less than 10 minutes left, helping the Ravens score a franchise-record 59 points … Ryan Fitzpatrick set an NFL record by starting (and throwing a TD) for his eighth different team, while DeVante Parker provided Miami’s lone highlight of the day.\n\nKansas City Chiefs @ Jacksonville Jaguars\n\nDespite losing Tyreek Hill early to injury and playing on the road against one of the league’s best defenses, Patrick Mahomes threw for a career-high 312 first-half yards with a bum ankle, finishing with a 3:0 TD:INT ratio. He’s going to rewrite the record books and only health can prevent back-to-back MVP awards … Sammy Watkins looked great and made me feel dumb for fading him in drafts, especially with Hill set to miss time, which is definitely going to help … Oddly, LeSean McCoy finished with the better efficiency, yet Damien Williams got the goal-line score (he had another GL carry as well). Much bigger games are ahead for Williams … Tough break for Nick Foles, although it did result in Gardner Minshew II and his mustache entering our lives (and with an 11.0 YPA, he’s going to be an extremely hot FAAB commodity in Superflex leagues), which was a win … Leonard Fournette lost the first fumble of his career, while DJ Chark Jr. wasted no time having his coming out party, as the sleeper is now wide awake.\n\nTennessee Titans @ Cleveland Browns\n\nWhat a disaster for the Browns, who already had a shaky offensive line and then watched their left tackle get ejected (the Browns committed five personal fouls before halftime) shortly before his backup got hurt. Tennessee has a physical defense and deserves some credit, but this was an ugly start at home for a team that entered with a lot of hype (myself fully included). Maybe Todd Monken had his play-calling duties removed last year for a reason. This marked the worst loss of Baker Mayfield’s career (college included) … Able to use more moves finally, Myles Garrett recorded two sacks, while Odell Beckham Jr. wore a $350K watch during the game … I’m already offering Corey Davis straight up for A.J. Brown in dynasty leagues … Last year’s top two finishers in YPC after contact, Nick Chubb and Derrick Henry, had very different Week 1s, as the former had a quiet game and saw a rookie steal a goal-line TD on his first career carry while the latter had a monstrous performance that included a 75-yard touchdown catch. You’d prefer a better QB situation, but with that offensive line, Henry could easily return first-round fantasy value this year, even in PPR leagues. He’s a beast.\n\nLos Angeles Rams @ Carolina Panthers\n\nThe Rams scored 30 points despite Jared Goff getting just 4.8 YPA, which is a troubling trend from last season when he got 7.6 YPA with a 10:9 TD:INT ratio on the road compared to 9.0 and 22:3 at home … Speaking of splits, Christian McCaffrey has now totaled 1,339 yards with nine touchdowns over his last nine home games. He also had a one-yard score vultured by Alex Amrah, but it’s hard to complain with this kind of usage (it was the only carry by another RB on the day for Carolina) … Todd Gurley looked fine but saw just three more carries and most importantly lost goal-line work to Malcolm Brown, who looks like one of the bigger steals at the end of drafts.\n\nCincinnati Bengals @ Seattle Seahawks\n\nTyler Lockett naturally saw neither more volume (two targets) nor TD regression (he secured one catch for a 44-yard score), while D.K. Metcalf is going to be a handful for defensive backs … Andy Dalton threw for 418 yards in Seattle without A.J. Green and with a shaky O line, so he deserves a ton of credit. Let’s hope John Ross can somehow stay healthy now. He’s probably faster than me … Russell Wilson managed another two TD passes on just 20 attempts, as extreme efficiency (9.8 YPA) and throwing into the end zone as much as any QB in the league will help stave off some of that regression … Marvin Lewis may be gone, but the Bengals remain as cowardly as ever, punting on fourth-and-seven down one point at midfield with 3:30 left.\n\nIndianapolis Colts @ Los Angeles Chargers\n\nAustin Ekeler erupted for 154 scrimmage yards and three touchdowns against last season’s No. 4 ranked run defense DVOA (although Justin Jackson looked mighty impressive as well, and Melvin Gordon looks likely to return from his holdout around Weeks 6-8), while Marlon Mack ran for 174 yards and a TD despite the Colts playing mostly from behind after being the most game-script dependent back in football last year — go figure ... Adam Vinatieri missed an extra point and two field goals in a game for the first time in his 24-year career.\n\nSan Francisco 49ers @ Tampa Bay Buccaneers\n\nWhile the score approached the high over/under, this was an ugly offensive game, to put it mildly, as there were three pick-sixes to go along with four touchdowns called back by penalty in the first half alone (two when George Kittle scored) ... Kwon Alexander dropped the easiest interception you’ll ever see before getting ejected during his revenge game, while O.J. Howard lost a fumble and turned a drop into a pick … Jameis Winston got just 5.4 YPA with one touchdown against a secondary that was gashed for the most touchdowns on the road last season, albeit a defense with a much-improved pass rush. Winston looked incredibly shaky (he threw more interceptions Sunday than the 49ers had all of last year), although getting a healthy Mike Evans (who was clearly playing sick) back will help … The 49ers’ receiver situation appears to be a mess, while Tevin Coleman’s injury opens the door some for Matt Breida.\n\nDetroit Lions @ Arizona Cardinals\n\nA troubling start to the Air Raid era turned into an 18-point fourth quarter comeback, although ultimately the game resulted in a tie. Kyler Murray took five sacks, had four passes batted down, got just 5.7 YPA and managed a meager 13 rushing yards during his debut, as T.J. Hockenson took the early lead in the ROY race. Detroit’s new-look defense deserves some credit here, but the Cardinals’ season could be a long one … Kerryon Johnson managed just 3.1 YPC and saw only two targets against an Arizona defense that allowed the most fantasy points to running backs last season.\n\nNew York Giants @ Dallas Cowboys\n\nEvan Engram went for 14-11-116-1 and could be in store for a huge season, while Dak Prescott continues to perform as a fantasy QB1 since Dallas acquired Amari Cooper … Saquon Barkley didn’t fumble once during his rookie campaign but did so during the Giants’ first offensive play from scrimmage Sunday (and then ran for 59 yards on the next play) … Michael Gallup carried over his impressive preseason by securing all seven targets for 158 yards, and it’s clear he’s an emerging star (certainly better news for those who’ve rostered Prescott than Cooper). Gallup is going to go down as one of the biggest WR profits on draft day, and thanks in part to having a new offensive coordinator, this Dallas team has legit Super Bowl upside.\n\nFollow the Yahoo fantasy football crew on Twitter: Andy Behrens, Dalton Del Don, Brad Evans, Matt Harmon, Liz Loza, Scott Pianowski and Tank Williams\n\nListen to the Yahoo Fantasy Football Podcast", "description": "Dalton Del Don talks the Patriots dominance and recaps Week 1's fantasy action.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/.v7qMH6lFIFjuOXtGeZSkw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/GH9JSipW2CWSvyO_tvimDQ--~B/aD0yODM5O3c9NDI1ODtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/c949d8b0-d2be-11e9-8f87-a04f35370d95", "published_at": "2019-09-09"}