{"pub": "npr", "url": "https://npr.org/2019/09/26/764724904/npr-pbs-newshour-marist-poll-americans-split-on-house-impeachment-inquiry", "downloaded_at": "2019-09-26 20:50:43.827367+00:00", "title": "Poll: Americans Split on House Impeachment Inquiry", "language": "en", "text": "Poll: Americans Split on House Impeachment Inquiry\n\nEnlarge this image toggle caption Andrew Caballero-Reynolds/AFP/Getty Images Andrew Caballero-Reynolds/AFP/Getty Images\n\nAmericans are split, 49%-46%, on whether they approve of Democrats' impeachment inquiry into President Trump, and independents at this point are not on board, a new NPR/PBS NewsHour/Marist Poll finds.\n\nBut the pollsters warn that the new developments could change public opinion quickly, especially with 7 in 10 saying they are paying attention to the news.\n\n\"Democrats in the House have work to do to convince people of the usefulness of their case,\" said Lee Miringoff, director of the Marist Institute for Public Opinion, which conducted the survey of 864 Americans. The poll was conducted Wednesday night with live phone interviewers. That was one day after House Speaker Nancy Pelosi announced the impeachment inquiry, but before a whistleblower complaint about the president's call with the Ukrainian leader was released to the public.\n\nMiringoff added that while \"independents still need to be convinced,\" the next few days are going to be crucial for both Democrats and Republicans, who will be making their cases about the validity of the inquiry.\n\n\"It's very important,\" Miringoff said, \"because this is sort of like we are in the middle of a potential storm here.\"\n\nAmericans are also split on whether the impeachment inquiry is a serious matter (50%) or just politics (48%) and whether it's worth going through with if the Senate doesn't convict and Trump gets to stay in office. By a 2-point margin, 49%-47%, they say it's not worth it.\n\nImportant for Democrats, half of independents disapprove (50%) of the impeachment inquiry and don't think it's worth it if the Senate doesn't convict (52%). People who live in the suburbs, whom Democrats relied on for support in the 2018 midterms to take back the House, are largely split on each of those questions.\n\nOn the impeachment inquiry, 48% of those living in the suburbs approve, while 49% disapprove. And on whether it's worth it, they divide evenly, 49%-49%.\n\nFamiliar fissures also emerge by party, gender, education and place. Democrats; women, especially college-educated women; and people who live in big cities are in favor of the impeachment inquiry. Republicans, people who live in rural areas, and men largely are not.\n\nLoading...\n\nDon't see the graphic above? Click here\n\nOverall, 71% say they have been paying very close or fairly close attention to the news about the House impeachment inquiry into Trump. More Republicans (80%) said they've at least followed the news on this fairly closely than Democrats (70%) or independents (64%).\n\nBut overwhelmingly, people want to hear more, with three-quarters of Americans, including a majority of Republicans, saying the whistleblower should testify before Congress.\n\nA majority also think there needs to be investigation into the Ukraine call and the president asking about the Bidens, with 54% of voters calling it a very serious matter.\n\nThis is going to be a long fight between the two parties, waging a messaging war to try to win over persuadable voters. And right now, independents are saying they don't approve of the job Trump is doing (52%), but they disapprove of House Speaker Nancy Pelosi more (62%).\n\nWhat's more, the president's base is more behind him than Pelosi's is behind her — 90% of Republicans approve of Trump's job, as opposed to 74% of Democrats saying the same about Pelosi.\n\nTrump's overall approval rating is about where it's been – 44%, but Pelosi comes off worse at 39%.\n\nViewed worst of all of the leaders in Washington, however, is Mitch McConnell. Just a 32% approve of the job he is doing, including just 56% of Republicans.\n\nSo it's pretty clear whose party the GOP is.\n\nMethodology: The poll of 864 Americans was conducted with live telephone callers the night of Sept. 25. The survey has a margin of error of +/- 5 percentage points.", "description": "Independents at this point say they are not on board with the impeachment inquiry. But with more revelations coming out, the pollsters warn, that could change.", "authors": ["Domenico Montanaro"], "top_image": "https://media.npr.org/assets/img/2019/09/26/gettyimages-1171378890_wide-529abe0d4ade1be8ccc7c161b80a1d0830e79952.jpg?s=1400", "published_at": "2019-09-26"}