{"pub": "yahoo", "url": "https://sports.yahoo.com/bianca-andreescu-u-open-winner-001636916.html", "downloaded_at": "2019-09-09 08:35:37.622845+00:00", "title": "Bianca Andreescu: U.S. Open winner with big future", "language": "en", "text": "NEW YORK — Bianca Andreescu had the U.S. Open trophy in her hands and one thought going through her mind.\n\nDon’t mess it up.\n\nScroll to continue with content Ad\n\nFor the first time in two weeks in Flushing Meadows, the 19-year-old looked confused on the court.\n\n“I was so clueless out there,” she recalled with a laugh.\n\nThis moment, with more than 20,000 people watching inside Arthur Ashe Stadium and who knows how many more clapping along back home in Canada, was too important to get wrong. So before Andreescu hoisted the hardware she earned Saturday with her 6-3, 7-5 victory over Serena Williams, she leaned toward a tournament official and asked which side was the front.\n\n“I just wanted to make sure so I didn’t look like an idiot,” Andreescu said.\n\nChances are, she’ll do fine in the future. With her game – and her guts – Canada’s first Grand Slam singles champion could have many more opportunities to win major titles.\n\nJust ask Williams’ coach, Patrick Mouratoglou, who referred to Andreescu as a “future No. 1.”\n\n“With her character and mindset, for sure she’s going to win several Grand Slams,” Mouratoglou said.\n\nWilliams has won 23 of them, one shy of the record, and with all that experience and the home-court advantage, many people considered Andreescu’s victory an upset.\n\nTruth is, it’s never a surprise when she wins.\n\nShe hasn’t been on the short end of a completed match in six months, losing only when she had to stop playing in one match because of a shoulder injury. Andreescu is 34-4 this year with one major and two other prestigious tournament titles, a record that compared to Rafael Nadal’s as he prepared to play in the men’s final.\n\nStory continues\n\n“I don’t think I’ve lost a match since March, so my confidence is skyrocketing right now,” said Andreescu, who will rise to No. 5 in the rankings. “I just don’t want to take anything for granted because there’s going to be weeks where you’re going to lose, so right now I’m just on cloud nine and hopefully I can just keep the momentum going.”\n\nShe couldn’t even get into main draw of the U.S. Open last year after losing in qualifying. But Andreescu thought she could be headed for big things right from the start of this season, when she reached the final of her first event in New Zealand. Then she won the title in Indian Wells in March, before the shoulder injuries that forced her to miss most of the spring and summer seasons.\n\nAndreescu said she didn’t have much faith in herself during those times, relying on her parents and her team to keep her spirits up.\n\n“Also, I mean, it’s part of life going through situations like that,” Andreescu said. “It’s not always going to be butterflies and rainbows, so I just tried to embrace it as much as I could. I tried to learn different things about myself and just about how I can get better as a player and as a person, and I really believed that there were going to be good times ahead, because I think when you believe in that then all those tough times are worth it.”\n\nAndreescu finally was able to return to the WTA Tour in time for her home tournament last month in Toronto, where she won the title when Williams had to stop playing in the final because of back spasms. But she had to go the distance to beat Williams on Saturday, playing through a deafening crowd during Williams’ second-set comeback that Andreescu felt was even louder than the ones at the Toronto Raptors’ playoff games she attended this spring on their way to the NBA title.\n\n“We The North” – the Raptors’ slogan – has given way to “She The North.”\n\nAndreescu played “mostly fearless for a big part of the match. A big, big part of the match,” said Sylvain Bruneau, her coach.\n\n“She could have been a little bit intimidated for many reasons. Serena, the stadium, the world is watching.”\n\nBut Andreescu wasn’t, even though she was playing in only her fourth Grand Slam tournament.\n\nBruneau also was confused during another award presentation later Saturday night, when the coach of the winning player is given a replica trophy. As he posed for pictures with Andreescu, someone had to tell him to turn the trophy around because he had the wrong side facing forward.\n\n“I’m not used to this,” he said.\n\n“Well, get used to it,” Andreescu responded.", "description": "With her game and her guts, Canada's first Grand Slam singles champion could have many more opportunities to win major titles.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/R9KQC_h8sPLdj6OcM1R.6g--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjEuMDY2NjY2NjY2NjY2Nw--/https://s.yimg.com/uu/api/res/1.2/DdCgdV7RwpyuCaUQb30MFg--~B/aD04NDg7dz0xNTA2O3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/peter_king_on_nbc_sports_543/4ad0146f832dc48626aa95bb381c83ad", "published_at": "2019-09-09"}