{"pub": "guardian", "url": "https://theguardian.com/technology/askjack/2019/sep/12/can-i-still-use-my-chromebook-now-it-is-no-longer-supported", "downloaded_at": "2019-09-12 11:36:58.575972+00:00", "title": "Can I still use my Chromebook now it is no longer supported?", "language": "en", "text": "Bill’s Acer Chromebook C720 will not receive further updates. It works well so can he still use it?\n\nCan I still use my Chromebook now it is no longer supported?\n\nI have recently got the message that my Acer Chromebook C720 will not be receiving any further updates as Google no longer supports Chromebooks older than six years. I use mine for surfing the internet, email and creating documents, which I send as email attachments. The machine still works as well as when I first bought it, and I’m reluctant to dump it for a new one. I understand that I can install a new operating system myself but I really can’t be bothered. The reason I bought a Chromebook in the first place was because of ease of use, simplicity and reliability. What are the risks if I just continue to use it without receiving any more updates? Bill\n\nThere is no way to assess the risk because it depends partly on what you use your Chromebook for, and how careful you are. Nowadays, most attacks require some kind of user assistance. This can mean, among other things, installing fake Android apps with hidden features, installing bogus Chrome extensions, visiting malicious websites, falling for phishing attacks, falling for man-in-the-middle attacks and failing to install essential security updates.\n\nYou will inevitably miss essential security updates to the Chrome browser. However, we can’t know in advance what sort of holes might appear in Chrome, or whether they might be exploited in unpatched Chromebooks, though Chrome OS’s security record is very good indeed.\n\nWe also can’t know how long it will be before your obsolete version of Chrome is unable to cope with new web technologies or when websites will refuse to work with it.\n\nFor schools and companies that use Chromebooks, Google spells out further potential problems. “Business and education customers using devices that have passed their AUE [Auto Update Expiration] date should not expect that they can manage their devices as expected using the Google Admin console or leverage new management features released,” it says.\n\nEither way, simple web browsing may not be much riskier than usual, and there are ways to make it safer. But I’d have second thoughts if you use your machine for financial operations without two-factor authentication, or if your email is full of private medical and financial information, passwords, and so on. The risks might be low but the stakes would be higher.\n\nA new Chromebook is cheaper than getting £50,000 siphoned from your bank account.\n\nChromebook updates\n\nFacebook Twitter Pinterest Even Google’s top-end Pixelbook Chromebooks have a finite update life. Photograph: Samuel Gibbs/The Guardian\n\nGoogle launched Chromebooks in 2011 but the early models were pretty dire, few people bought them, and their relatively short life (about four years) didn’t matter very much. Chromebooks have changed a lot since then, getting a more Windowsy look-and-feel, touchscreen support and access to Google Play with the ability to run Android apps. I assume this means Google has to test all the old Chromebooks and Chromeboxes – probably about 150 devices – to make sure they run new versions of Chrome OS. It would be time-consuming, expensive and ultimately impossible for Google to support all Chrome OS devices forever.\n\nIn 2016, Google introduced an End Of Life (EOL) policy that offered support for five years. About a year later, it changed the name to something that didn’t imply planned obsolescence – Auto Update Expiration (AUE) – and extended support for new Chromebooks to 6.5 years.\n\nThis is a reasonable lifespan compared to laptops running Windows or macOS. Some people run their laptops for longer, but usually they are paying more in wasted time than it would cost them to buy a new machine. (Of course, that’s assuming they have the money available.)\n\nThe key point is that the AUE period starts when the manufacturer launches a Chromebook platform, not when you buy it. You can buy a brand new Chromebook for a knock-down price, but if it’s based on a three-year-old platform, it will only be supported for three and a half, not for six and a half years.\n\nIn theory, Chromebook manufacturers could keep shipping the same platform for five or more years. Their outdated specifications ought to warn off potential buyers but typical Chromebook users probably aren’t following industry hardware trends. Every buyer should therefore check Google’s AUE page for end-of-support dates.\n\nIn fact, the AUE date should be shown prominently in Chromebook adverts. If I was going to spend £1,699.99 on a Google Pixelbook or £1,738 on a Google Pixel Slate, I’d certainly want to know that they go out of support in June 2024, according to Google’s AUE page.\n\nC720 options\n\nFacebook Twitter Pinterest Effortless updates are one of the selling points of Chromebooks, but options are available if you want to run other operating systems. Photograph: Bloomberg/Bloomberg via Getty Images\n\nMost Chromebooks are cheap and relatively underpowered so I’d expect them to be slow after six and a half years. JavaScript-bloated webpages keep getting bigger, while Chrome batters low-end chips and guzzles memory by spawning more processes than you have tabs open.\n\nHowever, your Acer Chromebook C720 probably has a dual-core 1.4GHz Celeron 2955U laptop processor, which is a Core design rather than a cheap Atom-based or ARM chip. It’s probably not far behind a Celeron N4000, though it will run hotter and use about twice as much electricity. You could repurpose it to run Neverware’s CloudReady, a Linux such as GalliumOS, or possibly even Microsoft Windows. I know you don’t want to do this but other users might.\n\nCloudReady works much like a Chromebook but it is really intended to rescue old Windows and Mac laptops. Neverware’s compatibility list does not include any Chromebooks, that I can see. However, you can get it to run by opening the case, removing the Chromebook’s “write protect” screw and flashing the firmware.\n\nBrian, an Ask Jack reader, said he used MrChromebox’s Firmware Utility Script to convert his unsupported Acer C710 Chromebook to UEFI. After booting from a USB thumb drive, he said: “I installed Cloudware and there appears to be no difference to the Chrome OS. Google transferred all my bookmarks and automatically installed apps and extensions, by my use of the same account details.”\n\nThe C720 is on the list of supported Chromebooks but readers should check first.\n\nWarning: this kind of thing can “brick” your Chromebook. You may be able to rescue it but you do this stuff entirely at your own risk.\n\nMitigating problems\n\nChromebooks were originally designed to do everything online so you should have very little personal information on your device. The C720 has a full-sized SD card slot so you should already be storing backups of your essential files on this easily removable form of storage. If you only plug the card in when you need it, you should have very little to lose.\n\nYou can minimise the amount of information stored on your Chromebook by using the privacy settings and turning off features such as saving web passwords and auto-filling web forms. You could even browse in guest mode, which basically means starting as a new user every time. The drawback is that you will have to log in to each website every time and it will not save your settings.\n\nChrome OS has had more than 50 security vulnerabilities. However, Google has a standing offer of $150,000 (£120,000) for anyone who can “compromise a Chromebook or Chromebox with device persistence in guest mode (ie guest to guest persistence with interim reboot, delivered via a webpage)”. No one has collected it so that approach should be relatively safe.\n\nIf you do pick up some form of malware, you can reset your Chromebook to factory condition by using the Powerwash feature at the bottom of the “show advanced settings …” page. Of course, this removes all your files and settings so you may not want to do it very often but it’s nice to have the option.\n\nHave you got a question? Email it to Ask.Jack@theguardian.com\n\nThis article contains affiliate links, which means we may earn a small commission if a reader clicks through and makes a purchase. All our journalism is independent and is in no way influenced by any advertiser or commercial initiative. By clicking on an affiliate link, you accept that third-party cookies will be set. More information.", "description": "Bill’s Acer Chromebook C720 will not receive further updates. It works well so can he still use it?", "authors": ["Jack Schofield"], "top_image": "https://i.guim.co.uk/img/media/8daa137f8ed2e074282418f1dec7c7b6d83c1ae4/0_0_1573_944/master/1573.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=95074a18a677a4dbf633252e2b9fd38f", "published_at": "2019-09-12"}