{"pub": "politico", "url": "https://politico.com/news/2019/10/28/susan-collins-senate-impeachment-060344", "downloaded_at": "2019-10-29 00:18:42.345224+00:00", "title": "House impeachment vote scrambles Senate Republicans' Trump defense", "language": "en", "text": "“I would think it’s still important,” Hawley said. “It’s not just the lack of initial authorization... the closed-door sessions, the denial of subpoena rights to the minority, the denial of access to the president’s counsel. All of that stuff is historically atypical.”\n\nSen. Deb Fischer (R-Neb.) disagreed, arguing that Republicans got what they wanted and should declare victory.\n\n“I’m glad the House has responded, and they're going to have transparent proceedings,” Fischer said. “We’ve seen what we’ve wanted to see.”\n\nThe conflict underscores how Senate Republicans have struggled to unite on a response to the House’s fast-moving impeachment inquiry into President Donald Trump, which centers on his alleged efforts to withhold military aide to Ukraine without securing an investigation into his political rivals like Joe Biden.\n\nIn fact, Senate Majority Leader Mitch McConnell never committed to a floor vote on the measure in the first place.\n\nThe resolution, introduced last week by Sen. Lindsey Graham (R-S.C.) and McConnell, came after Trump complained that Republicans were not doing enough to defend him on impeachment.\n\nThe nonbinding Senate resolution would call for the House to hold a vote to open the impeachment inquiry, provide Trump with “due process” and give House Republicans subpoena power.\n\nThe measure now has support from 50 of the 53 Senate Republicans, with Sens. Mitt Romney (R-Utah), Susan Collins (R-Maine) and Lisa Murkowski (R-Alaska) the holdouts.\n\nAnd Trump has been positively ebullient about the new defense effort.\n\n....in the basement of the United States Capitol! They cannot win at the ballot box. Their sham for the past 3 years continues. The good news is that the American People get it, which will be proven once again on November 3, 2020! — Donald J. Trump (@realDonaldTrump) October 25, 2019\n\n\"I appreciate the support of [Graham and McConnell] and their Great Senate Republican colleagues, on the resolution condemning the Do Nothing Democrats for their Witch Hunt Impeachment inquiry, behind closed doors....in the basement of the United States Capitol!” Trump tweeted on Friday after Graham introduced the resolution.\n\nRepublicans have focused their impeachment complaints on the House’s impeachment process, lambasting closed-door hearings and the leaking of testimony from key witnesses. But the planned House vote this week — which signals a move into a more public phase — could put those complaints to rest.\n\nGraham, a close Trump apply, credited himself and his colleagues for “making the House [Democrats’] position untenable.\n\n“There is no doubt in my mind that the overwhelming response House Democrats heard from the American people and Senate Republicans in support of my resolution forced their hand,” Graham said in a statement after Speaker Nancy Pelosi announced this week’s vote.\n\nBut McConnell never promised to hold a vote of his own.\n\nThe Kentucky Republican notably referred the resolution to the Senate Rules Committee rather than bringing it directly to the floor.\n\nWhile that follows the Senate’s regular order process, it also could be shelved there for weeks before it sees a committee vote. After that, the resolution could be tied up on the Senate floor if Democrats force procedural votes, which seems likely. And while a vote on the Senate resolution could show the president that Republicans are standing up for him, it also could take limited floor time away from other priorities like funding the government and confirming more judicial nominees.\n\nSenate Rules Committee Chairman Roy Blunt (R-Mo.) said whether his committee takes action on the Senate resolution depends on how Pelosi’s move this week plays out.\n\n“I read her letter and it could mean not very much or maybe it will be more than ‘we’re just going to formalize the unfair way we’ve been doing things,’” he said. “It does mean we should see what she says.”\n\nGraham’s resolution had an uncertain launch at first, as more than a dozen Republicans didn’t initially co-sponsor the resolution. But support quickly built within the GOP on Thursday and Friday, so that only the three Republicans have not endorsed it.\n\n“I read her letter and it could mean not very much or maybe it will be more than ‘we’re just going to formalize the unfair way we’ve been doing things.' It does mean we should see what she says.” - Senate Rules Committee Chairman Roy Blunt (R-Mo.)\n\nAnd Collins said Monday that she did not plan to co-sponsor the resolution. She added that she has not yet decided on whether she would vote for it if it came to the floor.\n\n“I have been critical of the House not holding a vote to authorize the inquiry, but the House determines its own procedures,” Collins said. “Just as I don’t like it when House members try to tell us to abolish the filibuster, I’m not sure it’s productive for the Senate to try to dictate to the House how to conduct the inquiry.”\n\nRomney said in an interview Monday that he would look at the resolution but noted that may no longer be necessary.\n\n“From the beginning I've been reluctant to weigh in on process, and it looks like Speaker Pelosi has scheduled a vote so that may be overtaken by events,\" Romney said.\n\nSeveral senators reiterated that the decision to bring the resolution up to a vote rests with McConnell.\n\n“I think it’s going to be entirely up to the leader at this point,” said Senate Majority Whip John Thune (R-S.D.).\n\n“If you’d asked me this morning I’d say yes,” said Sen. Chuck Grassley (R-Iowa) on whether the Senate should vote on the Graham-McConnell resolution. “Now with Pelosi announcing that they’re going to take a vote in the House I think that may factor in... That’s something.”", "description": "", "authors": ["-", "Senate Rules Committee Chairman Roy Blunt", "R-Mo."], "top_image": "https://static.politico.com/ad/ee/ed2d97c2449780b415f8f9af93b7/191028-collins-gty-773.jpg", "published_at": "2019-10-28"}