{"pub": "breitbart", "url": "https://breitbart.com/europe/2019/10/08/rape-suspects-quickly-arrested-swedish-police-unusually-publish-photos", "downloaded_at": "2019-10-08 16:22:54.917482+00:00", "title": "Rape Suspects Quickly Arrested After Swedish Police Publish Photos", "language": "en", "text": "In a rare move, Swedish police published photos of two suspects in an assault rape case leading to both men being quickly arrested following a flood of tips from the public.\n\nThe two men, aged 21 and 26, are suspected of having assaulted and raped a 30-year-old woman named Anna [not her real name]. The attack took place in the Folkets park in the multicultural southern city of Malmö over the summer, Swedish newspaper Aftonbladet reports.\n\nThe pair were caught on CCTV leaving the park. In a move the newspaper described as “unusual”, police published the photographs in the media, leading to useful information, according to police spokesman Calle Persson.\n\n“The tips were so good that if they had not come in themselves, it would have been only a matter of time before we had arrested them,” Persson said.\n\nThe two men turned themselves in at a police station shortly after their photographs were published, recognising themselves in the photos.\n\n“Sometimes people do this when they are wanted. Some want to tell their version and some may want to avoid us coming to them and picking them up,” Persson said.\n\nLeft Furious After Swedish Public TV Admits Migrants Commit Majority of Rapes Ahead of Election https://t.co/y8TOuqwOZq — Breitbart London (@BreitbartLondon) August 23, 2018\n\nThe alleged rape attack occurred on June 6th when the victim was with her friends in the park celebrating Sweden’s National Day. She briefly left her friends and was approached by two men who took her behind a bush and raped her.\n\n“If DNA traces have been secured at the crime scene, a tip-off can tie the men to the crime,” Officer Persson said. “It’s one of the most serious crimes — partly with regards to the scale of punishment and from a moral perspective. We take it very seriously,” he added.\n\nSex attacks are a problem across Sweden. In August, police in the city of Uppsala warning women to avoid certain areas entirely when walking alone at night following four rapes in just four days.\n\nAssault rapes, such as the case in which the two men in Malmö are suspects, are where the victim and perpetrator are previously unknown to each other before the sex attack. According to figures released by Swedish broadcaster SVT last year, assault rapes are overwhelmingly committed by migrant-background individuals.\n\nThe broadcaster claimed as many as eight out of ten assault rapes were perpetrated by migrants, half of whom had lived in Sweden less than a year before their attack.", "description": "In a rare move, Swedish police published photos of suspects in a rape case leading to both men being arrested following a flood of tips.", "authors": ["Chris Tomlinson"], "top_image": "https://media.breitbart.com/media/2016/11/Police-secure-the-area-where-two-immigra.jpg", "published_at": "2019-10-08"}