{"pub": "news24", "url": "https://news24.com/SouthAfrica/News/another-north-west-municipality-placed-under-administration-council-dissolved-20191024", "downloaded_at": "2019-10-25 00:43:59.629103+00:00", "title": "Another North West municipality placed under administration, council dissolved", "language": "en", "text": "Yet another North West municipality has been placed under administration.\n\n\n\nOn Thursday, North West Premier Job Mokgoro announced that the province's executive council (exco) had dissolved the entire council of the Mamusa Municipality in Schweizer-Reineke.\n\nIt was among 15 in the province that have been placed under administration, the SABC previously reported.\n\nFifteen out of 22 municipalities have all been placed under administration due to a number of factors, including the mismanagement of funds, maladministration and councillors neglecting their legislative duties.\n\nWithout a council to perform its legislative duties, it is now up to the IEC to decide on a date when an election for a new council will be held in Mamusa.\n\nMokgoro said the exco had previously resolved to invoke section 139(1)(c) at the municipality - which has already been under administration following a section 139(1)(b) intervention - as there were no signs of improvement.\n\nALSO READ: Reports of dissolution of North West municipalities 'fictitious and baseless' - ANC interim provincial committee\n\nMokgoro's spokesperson, Vuyisile Ngesi, said in a statement on Thursday that the municipality was accused of maladministration, financial mismanagement and councillors who neglected their legislative duties.\n\nNgesi said in some instances, some councillors at Mamusa allegedly dictated who should get tenders and neglected their duties with regards to service delivery.\n\n\"The municipality is unable to render services and is on the brink of collapse. It is up to the exco and premier to decide whether the current administrator remains at the helm or if there will be a new administrator. For now, there are no councillors in Mamusa,\" he added.\n\nThe authority to dissolve the entire Mamusa council had been granted and agreed to by the National Council of Provinces following a request from North West Cooperative Governance, Human Settlements and Traditional Affairs MEC Mothibedi Kegakilwe, Mokgoro said.\n\n\"We further received concurrence from the minister of cooperative governance and traditional affairs [Nkosana Dlamini-Zuma] that we should dissolve the council of the Mamusa local municipality. As per the legal requirements, we have also informed the North West provincial legislature of the decision and the processes followed in reaching the decision.\n\n\"Therefore, legally from today, the council of the Mamusa local municipality has ceased to exist and we will be announcing the appointment of an administrator to take care of that municipality until a new council is elected,\" said Mokgoro.", "description": "Fifteen out of 22 municipalities are battling to survive on their own after being placed under administration.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/8202/4e8204145281440999cce921467c3fe2.jpg", "published_at": "2019-10-24"}