{"pub": "politico", "url": "https://politico.com/news/2019/10/02/trump-live-tweets-pelosi-press-briefing-020412", "downloaded_at": "2019-10-03 09:37:27.449032+00:00", "published_at": "2019-10-02", "title": "Trump live-tweets Pelosi during her press briefing", "language": "en", "text": "“When the president says that he can’t do anything as he has the threat of impeachment or a consideration of impeachment, I hope he doesn’t mean he doesn’t want to work together to lower the cost of prescription drugs,” Pelosi said. “I think we can work with the administration on prescription drugs, I hope so, and infrastructure, I hope so, clean government, that’s more of a challenge.\"\n\nPOLITICO NEWSLETTERS Playbook PM Sign up for our must-read newsletter on what’s driving the afternoon in Washington. Sign Up Loading By signing up you agree to receive email newsletters or alerts from POLITICO. You can unsubscribe at any time.\n\nThe House speaker was joined by House Intelligence Chairman Adam Schiff (D-Calif)., who said he was “deeply concerned” with efforts by Secretary of State Mike Pompeo to potentially interfere with the probe into the president's attempts to pressure Ukraine to investigate Joe Biden and his son, Hunter.\n\nSchiff has been subjected to Trump’s ridicule since the launch of the investigation, which he continued to display on Wednesday.\n\n“Adam Schiff should only be so lucky to have the brains, honor and strength of Secretary of State Mike Pompeo,” Trump wrote in a follow-up tweet during the briefing. “For a lowlife like Schiff, who completely fabricated my words and read them to Congress as though they were said by me, to demean a First in Class at West Point, is SAD!”\n\nThe two top Democrats at the news conference shut down the notion that Trump’s actions were unworthy of impeachment, and said that they are moving forward with the investigation in a timely and deliberate manner.\n\n“We have a responsibility to uphold our oath of office to support and defend the Constitution of the United States. We also have a responsibility to get the job done for the American people,” Pelosi said. \"So is the president saying, 'If you question my actions, I can’t agree on any subject,’ then the ball is in his court on that.”", "description": "", "authors": [], "top_image": "https://static.politico.com/50/10/b8ee4433412db8b7cb335f36a639/191002-donald-trump-gty-2-773.jpg"}