{"pub": "thehill", "url": "https://thehill.com/policy/international/468065-turkey-rips-two-house-resolutions-summons-us-ambassador", "downloaded_at": "2019-10-30 14:25:26.038384+00:00", "title": "Turkey rips two House resolutions, summons US ambassador", "language": "en", "text": "Turkey's government on Wednesday knocked two resolutions passed by the House this week after U.S. lawmakers voted to punish Turkey over its invasion of northern Syria and to recognize the killing of Armenians within the Ottoman Empire as a genocide.\n\nIn a statement to members of the nation's ruling party, Turkish President Recep Tayyip Erdoğan said that Turkey \"strongly condemns\" the resolution passed Tuesday to sanction Turkey's government over its assault against Syrian Kurdish forces, which is unlikely to see progress in the GOP-held Senate despite Republican support in the House, according to The Associated Press.\n\nADVERTISEMENT\n\nA second resolution recognizing as genocide the 1915–1917 killings of Armenians by the Ottoman Empire would also be ignored by Turkey's government, he reportedly added.\n\n“We are saddened that a slander against our country is being accepted by a country’s parliament,” Erdoğan reportedly said of the genocide resolution, adding: “We would consider this accusation the biggest insult towards our nation.\"\n\nThe Turkish foreign ministry also attacked the U.S. over the Armenian genocide, saying in a statement: “Undoubtedly, this resolution will negatively affect the image of the U.S. before the public opinion of Turkey,\" according to the AP.\n\nAnkara also summoned U.S. Ambassador to Turkey David Satterfield over the two resolutions, while the situation indicates a broader breakdown of relations between the two countries amid Turkey's armed invasion of Kurdish-held lands in Syria.\n\nThe invasion has been heavily criticized by U.S. lawmakers, who have accused the Trump administration of abandoning the United States' Kurdish allies by withdrawing military forces from the region earlier this month, a move that was condemned in rare bipartisan fashion in the House.", "description": "Turkey's government on Wednesday knocked two resolutions passed by the House this week after U.S.", "authors": [], "top_image": "https://thehill.com/sites/default/files/erdogan_10132018getty.jpg", "published_at": "2019-10-30"}