{"pub": "independent", "url": "https://independent.co.uk/voices/letters/no-deal-brexit-david-cameron-operation-yellowhammer-boris-johnson-a9105441.html", "downloaded_at": "2019-09-15 00:25:32.437234+00:00", "title": "David Cameron’s mistake has harmed us all – it’s time for a Final Say", "language": "en", "text": "I refer to the article about David Cameron not being to blame for the Brexit crisis and the division it has caused.\n\nThis may be correct with respect to arranging it, but if Cameron had any idea of what negotiations are like in the real world, the referendum should not have been unconditionally binding, but subject to a confirmation referendum when the terms of divorce and follow-on arrangement with the EU compared to the current ones, and expectations of the future benefits and risks, were properly understood. So, no rhetoric and politically and racially charged assumptions and accusations.\n\nIn business, a negotiation team receives a mandate to negotiate and then has to return to its managers (the public in this case) to get confirmation of the original decision. The Independent has rightly campaigned for this and I travelled to London in March to participate in the march as I feel strongly and have vested interests through marriage. The UK is about to enter a period of self-harm and it make me sad.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nName supplied\n\nNorway\n\nThe most depressing element of the extracts from David Cameron’s almost apology for Brexit in his apology for a book is that it clearly shows us that Westminster is being run like the sixth-form common room of an exclusive private school for exceptionally privileged, out of touch, spoiled boys.\n\nAmanda Baker\n\nEdinburgh\n\nShape Created with Sketch. UK news in pictures Show all 50 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. UK news in pictures 1/50 14 September 2019 A surfer at Bournemouth beach. Some parts of the UK will experience balmy temperatures of 25C this weekend, with the south east of England likely to see the best weather PA 2/50 13 September 2019 Activists from PETA stage a demonstration outside a venue during London Fashion Week in London, Britain Reuters 3/50 12 September 2019 Australia's Marnus Labuschagne attempts to stop a boundary in the fifth Test Action Images via Reuters 4/50 11 September 2019 Storm clouds gather over the pier just off the North East coast at South Shields PA 5/50 10 September 2019 The peloton rides past the Angel of the North during stage four of the Tour of Britain from Gateshead to Kendal PA 6/50 9 September 2019 A penny farthing cyclist rides past St. John's, Smith Square, Westminster, London PA 7/50 8 September 2019 Australia celebrate the wicket of England's Craig Overton, which meant they won the fourth test and retained the Ashes Action Images via Reuters 8/50 7 September 2019 Manchester City celebrate after Caroline Weir scored during their Women's Super League match against Manchester United at Etihad Stadium. The WSL attendance record was smashed with 31,213 people watching the first Manchester derby of Women’s Super League era – nearly six times the previous WSL record Getty 9/50 6 September 2019 A bull bumps into a plain clothes police officer (left) while being walked by Prime Minister Boris Johnson during his visit to Darnford Farm in Banchory near Aberdeen. It coincided with the publication of Lord Bew's review and an announcement of extra funding for Scottish farmers PA 10/50 5 September 2019 First Minister Nicola Sturgeon cuts the hair of David Torrance MSP raising £1000 for the charity Maggie's Centre in Kirkcaldy at the Scottish Parliament in Edinburgh PA 11/50 4 September 2019 Australia's David Warner looks dejected after being dismissed by England's Stuart Broad during day one of the fourth Ashes Test at Old Trafford in Manchester Getty 12/50 3 September 2019 Anti Brexit demonstrators attend a protest at Parliament Square. Lawmakers returned from their summer recess Tuesday for a pivotal day in British politics as they challenged Prime Minister Boris Johnson's insistence that the UK leave the European Union on 31 October, even without a withdrawal agreement to cushion the economic blow AP 13/50 2 September 2019 Set building begins on Waterloo Place in Edinburgh ahead of filming for Fast and Furious 9 PA 14/50 1 September 2019 Members of the Royal Southern Yacht Club and the Island Sailing Club take part during the annual cricket match between the clubs, which takes place on the Bramble Bank sandbank in the middle of the Solent at low tide PA 15/50 31 August 2019 Anti-Brexit protesters demonstrate at Whitehall in London SWNS 16/50 30 August 2019 One of the iconic 'Girl with Balloon' artworks by anonymous street artist Banksy is carried near one of the original locations the artwork appeared at on the Southbank in London AP 17/50 29 August 2019 The sun rises over the sculpture \"The Couple\" by artist Sean Henry, at Newbiggin-by-the-sea in Northumberland PA 18/50 28 August 2019 A person wearing a Boris Johnson 'head' digs a grave at the foot of a tombstone during a protest organised by Avaaz and Best for Britain, outside Downing Street in London PA 19/50 27 August 2019 Nat Lofthouse statue is covered in flags at the University of Bolton Stadium, Bolton Action Images via Reuters 20/50 26 August 2019 Performers take part in Notting Hill Carnival. Nearly one million people were expected to attend Sunday and Monday's carnival to celebrate Caribbean culture AFP/Getty 21/50 25 August 2019 A competitor swims in the World Bog Snorkelling Championships in Llanwryd Wells, Powys Reuters 22/50 24 August 2019 People flock to Bournemouth beach as a heatwave spells potentially record high temperatures for the bank holiday weekend PA 23/50 23 August 2019 Fans of Bury FC deliver a symbolic coffin to the club's home at Gigg Lane as the continuation of their membership to the football league lies in doubt. The club will lose their membership at midnight if they don't find a buyer or prove that they have the means to pay off their debts PA 24/50 22 August 2019 Labour Leader Jeremy Corbyn and Shadow DEFRA Secretary Sue Hayman during a visit to Rakefoot Farm, Castlerigg, Keswick where they are highlighting the danger of a No Deal Brexit to sheep farmers PA 25/50 21 August 2019 Festival goers walk along the towpath of the River Thames as they arrive for the Reading Festival at Richfield Avenue PA 26/50 20 August 2019 Police officers gather to pay their respects at the scene near Ufton Lane, where Thames Valley Police officer PC Andrew Harper, 28, died on Thursday. Jed Foster, 20, has appeared at Reading Magristrates' Court where denied any involvement with the murder PA 27/50 19 August 2019 A fire that broke out at the site of Village Bakery on Coed Aben Road, Wrexham Industrial Estate in Wales Jord_wxm29/Twitter/PA 28/50 18 August 2019 England fielders crowd Pat Cummins as he see's out the final over during day five of the second Ashes Test match against Australia at Lord's Cricket Ground. The test ended in a draw Getty 29/50 17 August 2019 Glew (centre) and Monroe Adams (right) pose for a selfie with a member of the public outside DragWorld London 2019, Europe's largest drag convention, featuring drag stars from the US and UK during a two-day event at Olympia, London PA 30/50 16 August 2019 A grey seal with fishing net tangled around its neck amongst the colony on the beach at Horsey in Norfolk, as RSPCA data show the number of animals affected by plastic litter is at an all-time high, with incidents increasing by 22% in just four years PA 31/50 15 August 2019 A flock of sheep are herded past government buildings in London by members of Farmers for a People's Vote, a campaign group PA 32/50 14 August 2019 Swedish climate activist Greta Thunberg speaks during a press conference at the Mayflower Marina in Plymouth, southwest England, on August 14, 2019, ahead of her journey across the Atlantic to New York, aboard the Malizia II IMOCA class sailing yacht, where she will attend the UN Climate Action Summit next month. - A year after her school strike made her a figurehead for climate activists, Greta Thunberg believes her uncompromising message about global warming is getting through -- even if action remains thin on the ground. The 16-year-old Swede, who sets sail for New York this week to take her message to the United States, has been a target for abuse but sees that as proof she is having an effect AFP/Getty 33/50 12 August 2019 A hare runs on a moor near Ripon, North Yorkshire PA 34/50 11 August 2019 Britain’s Jamie Chadwick wins first-ever W Series title. She pocketed a prize of £410,000 and, having been signed as a development driver for Williams, she keeps up her hopes of making it into Formula One Getty 35/50 10 August 2019 People gather on the beach as a raft carrying people dressed as clowns heads to shore during the annual Whitby Regatta in Whitby, England. At over 170 years old, the Whitby Regatta is thought to be the oldest sea regatta on the northeast coast of England and draws thousands of visitors each year Getty 36/50 9 August 2019 Burryman Andrew Taylor, gets a nip of whisky using a straw, from resident Mary Hamblin, 82, as he parades through the town of South Queensferry, near Edinburgh, encased in burrs. The parade takes place on the second Friday of August each year and although the exact meaning of this tradition has been lost through the years it is thought to have begun in the 17th Century. The tradition is believed to bring good luck to the towns people if they give him whisky offered through a straw or a donation of money PA 37/50 8 August 2019 A mosque is seen amongst residential housing from the air during a mass take off at the annual Bristol hot air balloon festival in Bristol Reuters 38/50 7 August 2019 An Asiatic lioness eats meat during feeding time ahead of World Lion Day at London Zoo Reuters 39/50 6 August 2019 Beer enthusiasts taste beer and ale during The Great British Beer Festival at Kensington Olympia in west London. The Great British Beer Festival, organised by the Campaign for Real Ale (CAMRA), brings hundreds of real ales, international beers and real ciders and perries under one roof AFP/Getty 40/50 5 August 2019 Australia's Nathan Lyon celebrates after taking the wicket of England's Joe Root during day five of the first Ashes test at Edgbaston. The hosts were on the end of a thumping, as Australia won the first test by 251 runs Getty 41/50 4 August 2019 Franky Zapata stands on his jet-powered \"flyboard\" prior to landing on St. Margaret's Bay in Dover, during his attempt to fly across the 35-kilometre (22-mile) Channel crossing. The Frenchman achieved his aim today, on his second attempt, after having spent years developing the jet-powered hoverboard AFP/Getty 42/50 3 August 2019 A Cricket fan wears a Donald Trump inflatable, during day three of the first Ashes test cricket match between England and Australia at Edgbaston in Birmingham AP 43/50 2 August 2019 An RAF Chinook helicopter flies in sandbags to help repair the dam at Toddbrook Reservoir which was damaged in heavy rainfall PA 44/50 1 August 2019 Stuart Broad celebrates after taking the wicket of David Warner during day one of the first Ashes test between England and Australia at Edgbaston. England fans celebrated the loss of David Warner and Cameron Bancroft dismissals by waving sandpaper after they both faced bans for their roles in the Sandpaper scandal last year. Australia were all out for 284 after Steve Smith frustrated the hosts with a total of 144. He helped drag his side from 122-8 Getty 45/50 31 July 2019 A collapsed bridge near Grinton, North Yorkshire, after parts of the region had up to 82.2mm of rain in 24 hours on Tuesday PA 46/50 30 July 2019 Acrobats Beren d'Amico, Louis Gift and Charlie Wheeller, from Barely Methodical Troupe perform a routine on Calton Hill in Edinburgh as they bring their debut show Bromance to the Edinburgh Fringe PA 47/50 29 July 2019 Theresa the robotic waitress at The Tea Terrace's Cobham branch in Surrey. Theresa represents the 6th Generation of robotic waitresses which were first launched in Japan a few years ago. The robot comes with autonomous navigation; automatic obstacle avoidance, voice conversation, and automatic dish delivery. It integrates core technologies in automatic control, multi-sensor perceptual collision avoidance and route planning PA 48/50 28 July 2019 Competitors during the World Stinging Nettle Eating Championship at The Bottle Inn in Marshwood. Competitors are served 2-foot long stalks of stinging nettles from which they pluck and eat as many leaves as possible Getty 49/50 27 July 2019 A woman in character as La Muerte from film The Book of Life, during the MCM Manchester Comic Con which see thousands of sci-fi fans, gamers, comic collectors, movie buffs and anime enthusiasts visit Manchester Central PA 50/50 26 July 2019 England's Jonny Bairstow takes the catch to dismiss Ireland's William Porterfield during their test march at Lord's. Ireland were bowled out for 38 in their second innings in just 15.4 overs - the second lowest total in Test match history Action Images via Reuters 1/50 14 September 2019 A surfer at Bournemouth beach. Some parts of the UK will experience balmy temperatures of 25C this weekend, with the south east of England likely to see the best weather PA 2/50 13 September 2019 Activists from PETA stage a demonstration outside a venue during London Fashion Week in London, Britain Reuters 3/50 12 September 2019 Australia's Marnus Labuschagne attempts to stop a boundary in the fifth Test Action Images via Reuters 4/50 11 September 2019 Storm clouds gather over the pier just off the North East coast at South Shields PA 5/50 10 September 2019 The peloton rides past the Angel of the North during stage four of the Tour of Britain from Gateshead to Kendal PA 6/50 9 September 2019 A penny farthing cyclist rides past St. John's, Smith Square, Westminster, London PA 7/50 8 September 2019 Australia celebrate the wicket of England's Craig Overton, which meant they won the fourth test and retained the Ashes Action Images via Reuters 8/50 7 September 2019 Manchester City celebrate after Caroline Weir scored during their Women's Super League match against Manchester United at Etihad Stadium. The WSL attendance record was smashed with 31,213 people watching the first Manchester derby of Women’s Super League era – nearly six times the previous WSL record Getty 9/50 6 September 2019 A bull bumps into a plain clothes police officer (left) while being walked by Prime Minister Boris Johnson during his visit to Darnford Farm in Banchory near Aberdeen. It coincided with the publication of Lord Bew's review and an announcement of extra funding for Scottish farmers PA 10/50 5 September 2019 First Minister Nicola Sturgeon cuts the hair of David Torrance MSP raising £1000 for the charity Maggie's Centre in Kirkcaldy at the Scottish Parliament in Edinburgh PA 11/50 4 September 2019 Australia's David Warner looks dejected after being dismissed by England's Stuart Broad during day one of the fourth Ashes Test at Old Trafford in Manchester Getty 12/50 3 September 2019 Anti Brexit demonstrators attend a protest at Parliament Square. Lawmakers returned from their summer recess Tuesday for a pivotal day in British politics as they challenged Prime Minister Boris Johnson's insistence that the UK leave the European Union on 31 October, even without a withdrawal agreement to cushion the economic blow AP 13/50 2 September 2019 Set building begins on Waterloo Place in Edinburgh ahead of filming for Fast and Furious 9 PA 14/50 1 September 2019 Members of the Royal Southern Yacht Club and the Island Sailing Club take part during the annual cricket match between the clubs, which takes place on the Bramble Bank sandbank in the middle of the Solent at low tide PA 15/50 31 August 2019 Anti-Brexit protesters demonstrate at Whitehall in London SWNS 16/50 30 August 2019 One of the iconic 'Girl with Balloon' artworks by anonymous street artist Banksy is carried near one of the original locations the artwork appeared at on the Southbank in London AP 17/50 29 August 2019 The sun rises over the sculpture \"The Couple\" by artist Sean Henry, at Newbiggin-by-the-sea in Northumberland PA 18/50 28 August 2019 A person wearing a Boris Johnson 'head' digs a grave at the foot of a tombstone during a protest organised by Avaaz and Best for Britain, outside Downing Street in London PA 19/50 27 August 2019 Nat Lofthouse statue is covered in flags at the University of Bolton Stadium, Bolton Action Images via Reuters 20/50 26 August 2019 Performers take part in Notting Hill Carnival. Nearly one million people were expected to attend Sunday and Monday's carnival to celebrate Caribbean culture AFP/Getty 21/50 25 August 2019 A competitor swims in the World Bog Snorkelling Championships in Llanwryd Wells, Powys Reuters 22/50 24 August 2019 People flock to Bournemouth beach as a heatwave spells potentially record high temperatures for the bank holiday weekend PA 23/50 23 August 2019 Fans of Bury FC deliver a symbolic coffin to the club's home at Gigg Lane as the continuation of their membership to the football league lies in doubt. The club will lose their membership at midnight if they don't find a buyer or prove that they have the means to pay off their debts PA 24/50 22 August 2019 Labour Leader Jeremy Corbyn and Shadow DEFRA Secretary Sue Hayman during a visit to Rakefoot Farm, Castlerigg, Keswick where they are highlighting the danger of a No Deal Brexit to sheep farmers PA 25/50 21 August 2019 Festival goers walk along the towpath of the River Thames as they arrive for the Reading Festival at Richfield Avenue PA 26/50 20 August 2019 Police officers gather to pay their respects at the scene near Ufton Lane, where Thames Valley Police officer PC Andrew Harper, 28, died on Thursday. Jed Foster, 20, has appeared at Reading Magristrates' Court where denied any involvement with the murder PA 27/50 19 August 2019 A fire that broke out at the site of Village Bakery on Coed Aben Road, Wrexham Industrial Estate in Wales Jord_wxm29/Twitter/PA 28/50 18 August 2019 England fielders crowd Pat Cummins as he see's out the final over during day five of the second Ashes Test match against Australia at Lord's Cricket Ground. The test ended in a draw Getty 29/50 17 August 2019 Glew (centre) and Monroe Adams (right) pose for a selfie with a member of the public outside DragWorld London 2019, Europe's largest drag convention, featuring drag stars from the US and UK during a two-day event at Olympia, London PA 30/50 16 August 2019 A grey seal with fishing net tangled around its neck amongst the colony on the beach at Horsey in Norfolk, as RSPCA data show the number of animals affected by plastic litter is at an all-time high, with incidents increasing by 22% in just four years PA 31/50 15 August 2019 A flock of sheep are herded past government buildings in London by members of Farmers for a People's Vote, a campaign group PA 32/50 14 August 2019 Swedish climate activist Greta Thunberg speaks during a press conference at the Mayflower Marina in Plymouth, southwest England, on August 14, 2019, ahead of her journey across the Atlantic to New York, aboard the Malizia II IMOCA class sailing yacht, where she will attend the UN Climate Action Summit next month. - A year after her school strike made her a figurehead for climate activists, Greta Thunberg believes her uncompromising message about global warming is getting through -- even if action remains thin on the ground. The 16-year-old Swede, who sets sail for New York this week to take her message to the United States, has been a target for abuse but sees that as proof she is having an effect AFP/Getty 33/50 12 August 2019 A hare runs on a moor near Ripon, North Yorkshire PA 34/50 11 August 2019 Britain’s Jamie Chadwick wins first-ever W Series title. She pocketed a prize of £410,000 and, having been signed as a development driver for Williams, she keeps up her hopes of making it into Formula One Getty 35/50 10 August 2019 People gather on the beach as a raft carrying people dressed as clowns heads to shore during the annual Whitby Regatta in Whitby, England. At over 170 years old, the Whitby Regatta is thought to be the oldest sea regatta on the northeast coast of England and draws thousands of visitors each year Getty 36/50 9 August 2019 Burryman Andrew Taylor, gets a nip of whisky using a straw, from resident Mary Hamblin, 82, as he parades through the town of South Queensferry, near Edinburgh, encased in burrs. The parade takes place on the second Friday of August each year and although the exact meaning of this tradition has been lost through the years it is thought to have begun in the 17th Century. The tradition is believed to bring good luck to the towns people if they give him whisky offered through a straw or a donation of money PA 37/50 8 August 2019 A mosque is seen amongst residential housing from the air during a mass take off at the annual Bristol hot air balloon festival in Bristol Reuters 38/50 7 August 2019 An Asiatic lioness eats meat during feeding time ahead of World Lion Day at London Zoo Reuters 39/50 6 August 2019 Beer enthusiasts taste beer and ale during The Great British Beer Festival at Kensington Olympia in west London. The Great British Beer Festival, organised by the Campaign for Real Ale (CAMRA), brings hundreds of real ales, international beers and real ciders and perries under one roof AFP/Getty 40/50 5 August 2019 Australia's Nathan Lyon celebrates after taking the wicket of England's Joe Root during day five of the first Ashes test at Edgbaston. The hosts were on the end of a thumping, as Australia won the first test by 251 runs Getty 41/50 4 August 2019 Franky Zapata stands on his jet-powered \"flyboard\" prior to landing on St. Margaret's Bay in Dover, during his attempt to fly across the 35-kilometre (22-mile) Channel crossing. The Frenchman achieved his aim today, on his second attempt, after having spent years developing the jet-powered hoverboard AFP/Getty 42/50 3 August 2019 A Cricket fan wears a Donald Trump inflatable, during day three of the first Ashes test cricket match between England and Australia at Edgbaston in Birmingham AP 43/50 2 August 2019 An RAF Chinook helicopter flies in sandbags to help repair the dam at Toddbrook Reservoir which was damaged in heavy rainfall PA 44/50 1 August 2019 Stuart Broad celebrates after taking the wicket of David Warner during day one of the first Ashes test between England and Australia at Edgbaston. England fans celebrated the loss of David Warner and Cameron Bancroft dismissals by waving sandpaper after they both faced bans for their roles in the Sandpaper scandal last year. Australia were all out for 284 after Steve Smith frustrated the hosts with a total of 144. He helped drag his side from 122-8 Getty 45/50 31 July 2019 A collapsed bridge near Grinton, North Yorkshire, after parts of the region had up to 82.2mm of rain in 24 hours on Tuesday PA 46/50 30 July 2019 Acrobats Beren d'Amico, Louis Gift and Charlie Wheeller, from Barely Methodical Troupe perform a routine on Calton Hill in Edinburgh as they bring their debut show Bromance to the Edinburgh Fringe PA 47/50 29 July 2019 Theresa the robotic waitress at The Tea Terrace's Cobham branch in Surrey. Theresa represents the 6th Generation of robotic waitresses which were first launched in Japan a few years ago. The robot comes with autonomous navigation; automatic obstacle avoidance, voice conversation, and automatic dish delivery. It integrates core technologies in automatic control, multi-sensor perceptual collision avoidance and route planning PA 48/50 28 July 2019 Competitors during the World Stinging Nettle Eating Championship at The Bottle Inn in Marshwood. Competitors are served 2-foot long stalks of stinging nettles from which they pluck and eat as many leaves as possible Getty 49/50 27 July 2019 A woman in character as La Muerte from film The Book of Life, during the MCM Manchester Comic Con which see thousands of sci-fi fans, gamers, comic collectors, movie buffs and anime enthusiasts visit Manchester Central PA 50/50 26 July 2019 England's Jonny Bairstow takes the catch to dismiss Ireland's William Porterfield during their test march at Lord's. Ireland were bowled out for 38 in their second innings in just 15.4 overs - the second lowest total in Test match history Action Images via Reuters\n\nNot all bad\n\nProminent MPs are saying the Yellowhammer report is the worst case scenario, suggesting Brexit is going to be bad but not that bad!\n\nMy question is simply, when is it going to be good, when will my children reap the benefit of leaving the EU and what will the benefits be?\n\nJehangir Sarosh\n\nBushey\n\nThe will of the people\n\nQuite how on earth you can claim to be democrats is beyond my obviously simple mind. There is no democratic way to remain in the European Union at this point in our history; there is no democratic way to reverse the result of the referendum.\n\nThe basis of government in this country is ultimately the majority view of the people. They chose one word by a majority.\n\nYour policy to completely ignore that word, as though it had never existed, is an utter disgrace; to think members of our parliament are conspiring to deny, dishonour, disrespect the majority vote of the people is quite beyond the pale.\n\nI realise you’re not – which makes it all the more scandalous – but you really should be thoroughly ashamed of yourselves. My father did not serve his country, nor did my uncle die for his country, for this.\n\nNeil Coppendale​\n\nShoreham-by-Sea\n\nParents have the right to try\n\nMary Dejevsky’s article about Tafida Raqeeb was spot on: parents should have the right to make decisions about treatment for their children. If they are denied this right, it could affect them for the rest of their lives. They have to feel they have done everything possible for their child, even if the outcome is not what they would want.\n\nThe elder of my two sons was born with profound disabilities. At the age of 24 he was allowed to dehydrate whilst in respite care, leading to renal failure. After ten days, the very sympathetic consultant told us that this could not be reversed, and advised us that it would be the fairest thing for him if the treatment was discontinued. He died 36 hours later. The night before he died I had a “wobble”. A friend visited him in hospital and remarked how well he looked, and this led me to have a “what if” moment. The hospital staff were very understanding and called the consultant, who assured me this was not possible. We accepted this, but if I hadn’t felt I had done everything possible for my son, I might have wondered if the outcome could have been different.\n\nDiane Graham\n\nWatford\n\nA taxing issue\n\nTwo letters to your publication propound the myth that the government has a fixed amount of money to spend into the economy. Tim Baines and Rhiannon Cutler warn that the withdrawal of the unjustified subsidy to private education will reduce the tax take. Jennifer Walley believes that prolonging healthy lives will put a burden on future generations.\n\nIt is time the public were told the truth: that taxes do not fund public expenditure. The government, as monopoly issuer of our currency, can buy anything for sale in sterling, including idle labour. It merely credits bank accounts. Its only constraint is the real resources available: land, labour and capital goods.\n\nWe had the same real resources before and after the great financial crash!\n\nTaxes have to be paid in sterling which extinguishes some of that new money. There is no pot of tax receipts. Nor is there any need for the government to borrow in its own currency by selling bonds. If the government tries to save by taxing more than it spends it merely shifts debt to the private sector and shrinks the economy.\n\nThe monetarist snakeoil salesmen will call public expenditure “printing money” and scaremonger about Zimbabwe-style hyperinflation – whilst the UK, EU, US and Japan, mostly with huge and growing debt, try to prevent deflation by reducing interest rates. Please tell them to go away.\n\nCarol Wilcox\n\nChristchurch", "description": "I refer to the article about David Cameron not being to blame for the Brexit crisis and the division it has caused.", "authors": [], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/13/21/AFP-1K978P.jpg", "published_at": "2019-09-14"}