{"pub": "techcrunch", "url": "https://techcrunch.com/2019/10/21/rocket-lab-aims-to-deliver-small-satellites-to-the-moon-and-beyond", "downloaded_at": "2019-10-21 13:09:53.409615+00:00", "title": "Rocket Lab aims to deliver small satellites to the Moon and beyond – TechCrunch", "language": "en", "text": "Rocket Lab kicked off the International Astronautical Congress with the news that it’ll begin offering small satellite delivery service to orbits beyond low Earth orbit, where it currently operates – including delivering payloads all the way to the Moon. The longer-range service will be provided via its Photon spacecraft, which it’ll pair with a new additional stage to add range to the vehicle. The company expects to be able to begin serving customers with this new combined, longer range spacecraft possibly as early as Q4 2020.\n\nThis will extends significantly the launch startup’s effective operating range, which since it began serving customers last year has been entirely focused on the LEO range (from between around 200 miles and 1,200 miles above the surface of the Earth). Rocket Lab CEO and founder Peter Beck said in a press release announcing the news that this is in response to additional inbound interest in reaching these orbits, from both government and private sector clients.\n\nBeck notes that this demand will only grow as we look to put more investment into human exploration and infrastructure establishing on and around the Moon (NASA’s Artemis program will involve both an Lunar Gateway orbital station with international cooperation and eventually establishment of a base on the Moon’s surface). Small satellites, he argues, will be instrumental in providing low-risk advance scouting and establishing the necessary advance infrastructure for establishing a larger, more permanent presence.\n\nThere’s existing demand, he says, too, with a lot of research equipment and “full satellites” already “on shelves” just waiting for a ride to deeper space than is currently available. In other words, Rocket Lab is very eager to point out that this move isn’t just predicting future demand, but addressing a current unmet need that already exists in the market.\n\nPhoton, the spacecraft Rocket Lab will use to accomplish this goal, is a an evolved version of the Kick Stage of Electron . Combining it with Electron will provide Rocket Lab’s customers with a “complete solution” for missions anywhere from LEO, to further out Earth orbits, all the way to covering anything between here and the Moon, the company says.", "description": "Rocket Lab kicked off the International Astronautical Congress with the news that it’ll begin offering small satellite delivery service to orbits beyond low Earth orbit, where it currently operates – including delivering payloads all the way to the Moon. The longer-range service will be provided via its Photon spacecraft, which it’ll pair with a new […]", "authors": [], "top_image": "https://techcrunch.com/wp-content/uploads/2019/05/rocket-lab-photon.jpg?w=654", "published_at": "2019-10-21"}