{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/the_americas/why-political-turmoil-is-erupting-across-latin-america/2019/10/10/a459cc96-eab9-11e9-a329-7378fbfa1b63_story.html", "downloaded_at": "2019-10-11 00:21:40.327348+00:00", "title": "Why political turmoil is erupting across Latin America", "language": "en", "text": "“Wherever you look, there’s a lot of uncertainty and turmoil,” said Michael Shifter, head of the Inter-American Dialogue, a think tank based in Washington.\n\nThe crises follow a decade of remarkable success: a sustained burst of growth, the expansion of the middle class (now around one-third of the population), and the consolidation of democracy in a region once known for military dictators and Marxist rebels.\n\nAD\n\nAD\n\nSo why the wave of turmoil now?\n\nThe crises, while different from country to country, have some common threads. The economy in much of Latin America has slowed. Democratic institutions remain weak. The public is far less tolerant of corruption and poor services. And polarization is rising.\n\nThe upheaval matters well beyond Latin America. The region is home to the No. 1 U.S. trading partner, Mexico. It’s a principal source of migrants and drugs.\n\nAD\n\nHere are some of the factors driving the unrest.\n\nEconomies have stalled\n\n“We’re seeing a serious downturn in economic growth just about everywhere” in Latin America, said Jorge Castañeda, a former Mexican foreign minister.\n\nAD\n\nThe first decade of this century featured an unusual spurt of growth for the region. Its economies, on average, expanded more than 4 percent per year from 2004 to 2011, driven in part by high commodity prices. But then came the bust. In 2019, growth is expected to be just 0.6 percent, according to the International Monetary Fund.\n\nA decade ago, Ecuador was riding high thanks to a boom in global oil prices. But it was hit hard by the drop in prices starting in 2014. As Moreno has cut spending, groups that led street demonstrations in the 1990s and early 2000s — indigenous peoples and labor unions — have remobilized.\n\nEcuador and Argentina both show the challenges of stabilizing economies after the departure of big-spending populist leaders. Moreno and his Argentine counterpart, Mauricio Macri, imposed tough austerity programs to tackle the countries’ large debts. Now Moreno is facing the greatest threat yet to his presidency, and Macri is expected to lose reelection this month.\n\nAD\n\nAD\n\nBy far the biggest disaster in the region is Venezuela. Its economy has shrunk by more than half since 2013 because of plunging oil prices and mismanagement by ­socialist leaders. That’s prompted around 5 million people — more than 10 percent of the population — to flee.\n\nInstitutions are weak\n\nThe economic slowdown is straining a region where “political institutions are weak, parties are weak, judiciaries are weak,” said Kenneth M. Roberts, director of the Latin American Studies Program at Cornell University.\n\nMany countries lack strong, independent regulators and justice systems, allowing corruption to flourish in political campaigns and government contracting. Peru’s past four presidents have all been ordered to be detained on corruption charges. (Each has denied wrongdoing.)\n\nWith weak institutions, George Mason University political scientist Jo-Marie Burt said, it becomes more difficult to address problems. In some countries, “there’s an inability to process social conflict through normal political channels. So you wind up getting street protests” or the dissolution of congress.\n\nIn Peru, the traditional party system has collapsed. Congress is dominated by a party loyal to former authoritarian ruler Alberto Fujimori and his daughter Keiko, who are detained on corruption charges. President Martín Vizcarra has emerged as an anti-corruption crusader, but has only a tiny party behind him. His relations with Congress often look more like hand-to-hand combat than parliamentary give-and-take.\n\nAD\n\nAD\n\nOn Sept. 30, Vizcarra dissolved Congress. It responded by attempting to suspend him, in Peru’s biggest political crisis in decades. So far, he’s prevailed.\n\nPolitical polarization is exacerbating the problems in Peru and other countries.\n\n“There is a sense that overwhelming action must be taken to defeat the other side,” said Ivan Briscoe, the program director for Latin America at the International Crisis Group. “What you see, in the case of Peru, is basically a battle between two institutions.”\n\nPeople are frustrated\n\nLatin American citizens have become increasingly frustrated with corruption — taking to the streets in recent years to press for the ouster of governments in Brazil and Guatemala.\n\nCitizens are more aware than ever of government abuse, thanks to more independent judges, a freer press, and the rise of civic groups and social media. And sometimes U.S. prosecutors lend a hand.\n\nIn Haiti, the anti-government protests were sparked by government efforts to end fuel subsidies. But they’re increasingly focused on inflation and what demonstrators call corruption involving President Jovenel Moïse. He’s denied the accusations. Haiti, perennially the poorest country in the hemisphere, has suffered chronic instability.\n\nAD\n\nAD\n\nHundreds of miles to the west, Honduras’s president, Juan Orlando Hernández, is also fighting corruption allegations. He has already endured months of protests over proposals that his critics say would privatize health and educational services. Then, last week, his brother Tony went on trial in federal court in New York, accused of shipping cocaine to the United States. (He pleaded not guilty.)\n\nWitnesses have testified that the president received more than $1 million for his 2013 reelection campaign from drug traffickers in exchange for protecting them from prosecution. Hernández denies the allegations; he has not been charged. Honduras’s opposition has demanded he resign.\n\nThe vast amounts of drug money washing through Latin America have intensified corruption, fueling violence and political instability in countries from Colombia to Mexico.\n\nAD\n\nAD", "description": "From Ecuador to Honduras to Haiti to Peru, the region has been hit by a wave of unrest.", "authors": ["Mary Beth Sheridan", "Correspondent Covering Mexico", "Central America"], "top_image": "https://www.washingtonpost.com/resizer/-CBiFi1TZk3xMJuGBgfETfDz0hQ=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/YGMEP3XLTAI6TBOAQWQJRZD3G4.jpg", "published_at": "2019-10-10"}