{"pub": "morningstar", "url": "https://morningstar.com/news/dow-jones/201909293091/rio-tinto-ends-plans-for-canada-iron-ore-unit-sale-ipo-source", "downloaded_at": "2019-09-30 04:04:34.346240+00:00", "title": "Rio Tinto Ends Plans for Canada Iron-Ore Unit Sale, IPO -Source", "language": "en", "text": "By Rhiannon Hoyle\n\nSYDNEY--Rio Tinto PLC (RIO.LN) has scrubbed plans for a sale or initial public offering of its Canadian iron-ore unit, following a yearslong effort to unload the business, according to a person familiar with the matter.\n\nRio Tinto has been shopping around its 59% stake in Iron Ore Co. of Canada on-and-off since 2013, but hasn't been able to find an agreeable price with potential suitors as iron-ore prices have waxed and waned.\n\nGlobal miners including Rio Tinto have spent several years selling or spinning off assets in a bid to reduce debt and lift shareholder returns by focusing on only their most profitable or promising operations. Iron-ore prices this year surged to their highest value since early 2014 on concerns over a shortfall, but have since eased and are widely forecast to edge lower over the coming year.\n\nExecutives at Rio Tinto, which in Australia runs one of the world's biggest iron-ore operations globally, had previously said they were under no pressure to offload the Canadian business. \"I want to clean up the portfolio as quickly as I can but, at the same time, there will not be a fire sale,\" Chief Executive Jean-Sebastien Jacques had said in 2017 of his strategy to sell assets.\n\nThe decision to tell bankers to stop working on the process for a sale or IPO for the Canadian unit was earlier reported by Bloomberg.\n\nIron Ore Co. of Canada produces iron-ore concentrate and pellets from mining operations and processing facilities in Newfoundland and Labrador. It also runs port facilities in Quebec.\n\nThe business is a joint venture between Rio Tinto, Mitsubishi Corp., which owns 26%, and the Labrador Iron Ore Royalty Income Corp., which owns 15%.\n\nIt recorded net earnings of $166 million for Rio Tinto in 2018, down from $235 million the year earlier. Its operations had been suspended for two months during the year amid labor negotiations.\n\nWrite to Rhiannon Hoyle at rhiannon.hoyle@wsj.com\n\n(END) Dow Jones Newswires\n\nSeptember 29, 2019 22:36 ET (02:36 GMT)\n\nCopyright (c) 2019 Dow Jones & Company, Inc.", "description": "", "authors": [], "top_image": "https://morningstar.com/assets/img/30241a1.png", "published_at": "2019-09-30"}