{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/football/article-7566597/USA-links-Arsenal-Womens-boss-Joe-Montemurro-not-distract-players-says-Jill-Roord.html", "downloaded_at": "2019-10-13 00:30:44.771092+00:00", "title": "USA links to Arsenal Women's boss Joe Montemurro will not distract players, says Jill Roord", "language": "en", "text": "Joe Montemurro’s links with the USA job have not been a distraction, midfielder Jill Roord insists as Arsenal prepare to face Chelsea at Kingsmeadow on Sunday.\n\nMontemurro, who in May guided the FA Women’s Super League outfit to their first league title for seven years, has been courted to succeed departing Jill Ellis at the four-time world champions – although his current employers are thought to have blocked the approach.\n\nRoord, who joined Arsenal’s growing Dutch contingent in a summer move from Bayern Munich, admits it’s inevitable Montemurro is head-hunted given his English success.\n\nJoe Montemurro’s links with the USA job have not been a distraction, says midfielder Jill Roord\n\n‘Definitely, it’s the same with players,’ she said.\n\n‘If you do great then you’re always going to be linked to big clubs so it makes sense. But it hasn’t been a distraction.’\n\nWith the FA WSL title to defend and a return to the Champions League after five years, the manager’s tasks in hand aren’t easy.\n\nMontemurro guided Arsenal to their first league title for seven years in May\n\n‘We are definitely capable of winning titles but when it comes to winning back-to-back titles, it comes down to the little things,’ the 22-year-old Roord added.\n\n‘You must really be a team, you must want to fight for each other and have a hunger to win every game. This Arsenal team definitely has that.’\n\nThe 2018/19 champions are unbeaten in all competitions since the start of the season in September and Roord says she is relishing the fear much of the top-flight has for her north London team’s attacking qualities.\n\nBut not all women’s football is reaping the rewards of the World Cup boom, she says.\n\nThe United States are on the lookout for a replacement for iconic manager Jill Ellis\n\n‘I think the interest in [women’s football] in Germany is going down,’ she commented.\n\n‘In Germany and in Holland, you have two or three big games. In England you have to give 100 per cent and be focused in every game.’", "description": "Joe Montemurro's links with the USA job have not been a distraction, midfielder Jill Roord insists as Arsenal prepare to face Chelsea at Kingsmeadow on Sunday.", "authors": ["Claire Bloomfield For The Mail On Sunday"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/12/20/19634722-0-image-a-9_1570910181077.jpg", "published_at": "2019-10-12"}