{"pub": "yahoo", "url": "https://news.yahoo.com/brexit-deal-pathway-could-require-103600667.html", "downloaded_at": "2019-10-12 13:04:37.000706+00:00", "title": "Brexit deal 'pathway' could require compromise on customs and consent", "language": "en", "text": "The “pathway” to a Brexit deal sighted by Boris Johnson and Leo Varadkar in The Wirral on Thursday is thought to involve concessions from both sides on the issues of customs and Northern Irish consent for new arrangements.\n\nNorthern Ireland Secretary Julian Smith last night indicated that a compromise deal could involve the removal of any veto on post-Brexit regulatory arrangements for the Unionist community - something which could cost Mr Johnson the support of the DUP in the Commons.\n\nAnd it is believed that a deal would also require movement on customs, either through the UK accepting that Northern Ireland should remain to some degree part of the EU’s customs union or Brussels and Dublin dropping concerns about the threat of an open border to the integrity of the single market.\n\nBut both London and Dublin were playing their cards close to their chests as EU ambassadors met in Brussels to hear details of the leaders’ discussions.\n\nEven cabinet ministers had not been briefed by Friday lunchtime on the precise terms of changes discussed by Mr Johnson and Mr Varadkar at the Thornton Manor Hotel, which are known only to a handful of people intimately involved in the talks.\n\nAnd Mr Johnson himself gave away no clues in a video released on social media, in which he sought to frame the issue as a “failure of democracy” on the part of a parliament which had not delivered on the “will of the people” as expressed in the 2016 referendum.\n\nEducation secretary Gavin Williamson told BBC Radio 4’s Today: “\"These are confidential negotiations, and the only way you are going to see an agreement emerge is by ensuring people have space to carry on those negotiations.”\n\nJulian Smith told the BBC’s The View that there were \"a range of options\" for finding consent for the plans.\n\n\"The key thing is we have to have regard to the Good Friday Agreement and have regard to the need to have a cross-community approach to how we resolve this,\" said the Northern Ireland Secretary.\n\nFormer shadow Northern Ireland secretary Owen Smith told The Independent that this indicated Mr Johnson was ready to amend proposals to make regulatory alignment between Northern Ireland and the Republic dependent on four-yearly approval by the devolved executive and assembly in Belfast.\n\nDublin fears this would effectively give the DUP the power to block any arrangements which treat Northern Ireland differently from mainland Britain.\n\nThe Labour MP said this could be dealt with by requiring cross-community support from both Unionist and Republican for any veto or by barring the use of a “petition of concern” by the DUP to block constitutional change with a simple majority.\n\nBut he warned: “Even if it is very hard for either side of the community on its own to change the parameters of the new arrangement, you would still be left with the problem that every few years you spark a massive constitutional ruck in Northern Ireland. Anyone with a scintilla of historical knowledge knows that is not a good idea.”\n\nProfessor Anand Menon, director of the UK in a Changing Europe thinktank, said that a customs compromise could be based around a scaled-down version of Theresa May’s 2018 “new customs partnership” plan.\n\nUnder this arrangement, the UK could collect tariffs on behalf of the EU on goods passing between Northern Ireland and mainland Britain, with businesses in the North entitled to rebates if the UK tariff is lower.\n\nBut Brussels gave short shrift to the idea when it was put forward by Mr Johnson’s predecessor and could be expected to take a similar line if he put forward his own variant, said Prof Menon.\n\n“The alternative might be allowing Northern Ireland in some way to remain in the EU customs union, which the DUP regards as anathema,” said Prof Menon. “Johnson has made keeping the UK in a single customs territory a central part of his definition of sovereignty, so it’s difficult to see how he rows back on that.”\n\nMr Varadkar appeared to signal on Thursday that Dublin may be ready to shift from its position that the North must remain in the EU customs union.\n\nAsked if this was still a red line, he replied: “It remains our position that there cannot be a hard border between North and South. And we must continue to have a situation whereby the all-island economy can continue to deepen and function well.”", "description": "The “pathway” to a Brexit deal sighted by Boris Johnson and Leo Varadkar in The Wirral on Thursday is thought to involve concessions from both sides on the issues of customs and Northern Irish consent for new arrangements.Northern Ireland Secretary Julian Smith last night indicated that a compromise", "authors": ["Andrew Woodcock"], "top_image": "https://s.yimg.com/uu/api/res/1.2/rh6GgBUwfZ7DCoAR7qH6Tg--~B/aD0zODE7dz01MjY7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/the_independent_577/b02cb9a982b98807abfb524f635c4d9d", "published_at": "2019-10-11"}