{"pub": "reuters", "url": "https://reuters.com/article/us-usa-iran-un-johnson-trump/trump-upbeat-on-johnsons-idea-of-new-iran-deal-idUSKBN1W8245", "downloaded_at": "2019-09-23 19:20:31.321359+00:00", "title": "Trump upbeat on Johnson's idea of new Iran deal", "language": "en", "text": "U.S. President Donald Trump's participates in a bilateral meeting with Pakistan's Prime Minister Imran Khan on the sidelines of the annual United Nations General Assembly in New York City, New York, U.S., September 23, 2019. REUTERS/Jonathan Ernst\n\nNEW YORK (Reuters) - U.S. President Donald Trump responded positively to British Prime Minister Boris Johnson’s idea of creating a new nuclear deal with Iran, saying that he respected Johnson and was not surprised he had floated the idea.\n\n“He does want a new deal because the other deal was ready to expire - very short number of years left,” Trump said, referring to the 2015 nuclear deal that Iran struck with major powers and that the U.S. president abandoned last year.\n\nUnder that agreement, Iran committed to limit its nuclear program in return for relief from U.S. and other sanctions that had crippled its economy.\n\nTrump reimposed U.S. sanctions last year. In May, he tightened them further and sought to drive Iranian oil exports to zero. He has criticized the earlier deal, negotiated under then-U.S. President Barack Obama, for “sunset” clauses under which some of its provisions expired as well as for its failure to address Iran’s missile program and regional activities.\n\n“I respect Boris a lot and I am not surprised at all that he was the first one to come out and say that,” Trump said of Johnson’s comment that “whatever your objections to the old nuclear deal with Iran, it’s time now to move forward and do a new deal.”\n\nIn fact, others including French President Emmanuel Macron., have spoken about the possibility of a new deal with Iran for more than a year.", "description": "U.S. President Donald Trump responded positively to British Prime Minister Boris Johnson's idea of creating a new nuclear deal with Iran, saying that he respected Johnson and was not surprised he had floated the idea.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190923&t=2&i=1433055340&w=1200&r=LYNXMPEF8M1SX", "published_at": "2019-09-23"}