{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/30/california-qb-chase-garbers-out-indefinitely-with-", "downloaded_at": "2019-10-01 04:28:36.680642+00:00", "title": "California QB Chase Garbers out indefinitely with injury", "language": "en", "text": "BERKELEY, Calif. (AP) - California will be without starting quarterback Chase Garbers indefinitely because of an apparent shoulder injury he suffered in Friday’s loss to Arizona State.\n\nGarbers was scrambling when he fell on his throwing arm late in the second quarter against the Sun Devils. After being taken to the locker room for examination, Garbers emerged in the second half wearing a splint.\n\nCoach Justin Wilcox declined on Monday to say what the nature or severity of Garbers injury is, saying only that it is an upper body injury.\n\n“That’s kind of all we can say about it,” Wilcox said. “I understand the interest. There’s only so much we can say. He’ll be back hopefully as fast as humanly possible.”\n\nA redshirt sophomore who split time as a starter in 2018, Garbers was coming off his best game with the Golden Bears after throwing for a career-best 357 yards and four touchdowns in a win at Mississippi on Sept. 21.\n\nGarbers led Cal on an early scoring driving against Arizona State and was 9 of 12 for 177 yards and a touchdown before getting hurt.\n\n“I thought he was really coming into his own,” Wilcox said. “Even in that game, he finished 9 of 12 and two of (the incompletions) were dropped. So you feel for him. He puts a ton of time in this too. But it’s part of it. It’ll be next man up.”\n\nDevon Modster, a transfer from UCLA who struggled in the second half after replacing Garbers, will start Saturday against at No. 13 Oregon. Modster was 5 of 14 for 23 yards and an interception in the end zone against Arizona State. Afterward, he called his performance terrible.\n\n“I definitely think he can play better,” Wilcox said. “We have confidence in Devon and the rest of the guys to step up to the challenge.”\n\nModster completed 51 of 79 attempts for 671 yards and four touchdowns during one season with UCLA. He was forced to sit out Cal’s first three games this season because of transfer rules and wasn’t eligible until Sept. 21.\n\nWilcox expects the Bears to make subtle schematic changes with Modster at quarterback.\n\n“It’s not like you make a wholesale change to the offense but there’s certain things that Devon does that maybe we lean a little bit more on,” Wilcox said. “But a lot of the structure will look similar.”\n\nThe loss to the Sun Devils knocked the Golden Bears out of the Top 25. Cal’s No. 15 ranking was its highest in a decade.\n\n__\n\nMore AP college football: https://apnews.com/Collegefootball and https://twitter.com/AP_Top25\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "California will be without starting quarterback Chase Garbers indefinitely because of an apparent shoulder injury he suffered in Friday's loss to Arizona State.", "authors": ["The Washington Times Http", "Michael Wagaman"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/30/arizona_state_california_football_85881_c0-142-3400-2124_s1770x1032.jpg?c52a0096a216a79ba5fcf65096afe65401717e03", "published_at": "2019-09-30"}