{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/4/brady-enters-20th-season-still-looking-to-earn-pat", "downloaded_at": "2019-09-04 23:48:12.384096+00:00", "published_at": "2019-09-04", "title": "Brady enters 20th season still looking to earn Pats' trust", "language": "en", "text": "FOXBOROUGH, Mass. (AP) - Even in his 20th NFL season and 18th as the opening-day starter at quarterback for the New England Patriots, Tom Brady is still awed by the responsibility he bears.\n\n“I think it’s a great privilege when a team trusts you to be the quarterback and they put the ball in your hands,” Brady said Wednesday. “It’s a great show of trust that they have in you, and I think you have to earn it every day. With that trust comes a lot of responsibility, and that’s a big responsibility I take with me.”\n\nBrady will begin another quest to make NFL history Sunday night at home when the Super Bowl champions entertain the Pittsburgh Steelers in the regular-season opener. If Brady starts all 16 games for the Patriots this year, he would be the first NFL quarterback to do so at 42 years of age.\n\n“I love being available to the team,” he said. “That’s been something I feel like is a very important part of my job. I can’t help the team if I’m not out there, and I work pretty hard to make sure I am. So many great players have played this game, and to still be doing it is something I treasure.”\n\nIn an expansive news conference at Gillette Stadium, Brady touched upon several nostalgic topics, including his transition from a young player learning the ropes to the veteran that guided younger players in a similar manner.\n\n“I was a young player once, too, and I had a lot of older players that I worked with,” he said. “I had some great mentors, people that really taught me how to play the position. It was great at a young age to have John Friesz and Drew (Bledsoe), and then to have Damon Huard, and Vinny (Testaverde) and to have Doug (Flutie). And then all of a sudden it flipped, and it went from Matt Cassel to Brian (Hoyer) to Jimmy (Garoppolo) . I played with so many great guys over the years.”\n\nHe also said he knows the past will have no bearing upon the outcome of his meeting with the Steelers, against whom he is 11-3, including three playoff wins. But the last matchup was a 17-10 New England loss at Heinz Field on Dec. 16.\n\n“We’ve had a great rivalry against those guys and have played a lot of meaningful games,” Brady said. “We played at their stadium quite a bit the last few years, so it’s good to get them here.”\n\nThere have been significant changes in the offense Brady will command Sunday. In addition to the retirement of star tight end Rob Gronkowski, Brady will have two new starters along the offensive line in left tackle Isaiah Wynn and center Ted Karras, replacing free-agency departure Trent Brown and the injured David Andrews, respectively.\n\nThe Patriots have also rebuilt the receiving corps, but Brady has had minimal preseason practice time with Josh Gordon, recently reinstated from a suspension, and Demaryius Thomas, recovering from an Achilles tendon injury. Super Bowl MVP Julian Edelman also missed most of training camp with a broken thumb.\n\n“It’s a challenging thing, and that’s why it’s not always as fluid as you would hope it to be,” Brady said. “We’re going to try to work as hard as we can, as we always do. I don’t think this team ever feels like we’re a finished product. I don’t think we finish many practices and coach Belichick says, ‘Man, we got this all figured out.’”\n\n___\n\nMore AP NFL: https://apnews.com/tag/NFL and https://twitter.com/AP_NFL\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Even in his 20th NFL season and 18th as the opening-day starter at quarterback for the New England Patriots, Tom Brady is still awed by the responsibility he bears.", "authors": ["The Washington Times Http", "Mark Farinella"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/04/patriots_football_10232_c0-188-4500-2811_s1770x1032.jpg?1e8d05f7a13fd989ef8544294f16a79f64765c4e"}