{"pub": "businessinsider", "url": "https://businessinsider.com.au/jfk-customs-searches-million-mail-packages-drugs-counterfeit-2019-9", "downloaded_at": "2019-09-23 17:16:35.124288+00:00", "title": "JFK is America's largest mail room. Here's how customs searches 1 million mail packages a day for drugs and counterfeit goods.", "language": "en", "text": "Customs and Border Protection officers at JFK airport search 1 million mail packages a day for illegal drugs, food, animals and counterfeit goods.\n\nJFK deals with roughly 60% of all international packages entering the country.\n\nWe followed two units searching for drugs and counterfeit items.\n\nVisit Business Insider’s homepage for more stories.\n\nFollowing is a transcription of the video.\n\nNarrator: About 1 million packages arrive at John F. Kennedy International Airport every day. And just like travellers have to go through customs, so do international packages. The US Customs and Border Protection, or CBP, is tasked with screening all of them. They’re looking for anything that isn’t legally allowed in the US; certain foods, animals, drugs, and counterfeit goods.\n\nJFK is one of nine international mail facilities in the US. It’s essentially the country’s biggest mail room, dealing with roughly 60% of all international packages entering the country.\n\nFirst, the packages are taken off arriving passenger or cargo planes and transported to the US Postal Service’s mail room on site. They’re sorted and then taken to the CBP mail facility next door for inspection. CBP uses a three-tiered strategy to efficiently search each of these packages; intelligence gathering, nonintrusive inspection, and hand inspection. We followed two units searching for drugs and counterfeit items.\n\nBefore a package ever lands in the US, CBP gathers intelligence on the sender, the container, and the aircraft. They will check with law-enforcement partners like Homeland Security, the DEA, and the FBI to see if there’s anything of interest. This is how CBP narrows down a million packages to ones that will get flagged for further inspection.\n\nOnce a suspicious package is pulled, it goes to the CBP inspection area. This is where human CBP officers get a little help. Here, a four-legged officer, like Alex, will search hundreds of packages in 20-minute runs. These dogs are trained to sniff out seven different drugs.\n\nMichael Lake: The drugs that they are trained for are hash, marijuana, cocaine, heroin, methamphetamine, ecstasy, as well as fentanyl.\n\nNarrator: If Alex finds something, he’ll notify his handler by sitting or lying down. If he’s right, he gets his chew toy.\n\nLake: This is the game that they work for. All right, it’s good play. Here’s a good boy, good boy.\n\nNarrator: And if Alex or one of his furry friends comes in contact with a drug, officers have the antidote Narcan on hand. Nearby, CBP officers are using another nonintrusive search tool: X-rays.\n\nNathanial Needham: When I first started this, I would literally open up everything ’cause I couldn’t tell what the image was. But eventually, after you do thousands of parcels, opening them up and comparing them to image, now you start getting good. You can identify, oh, that’s this, oh, that’s this. We can let that go because of this.\n\nNarrator: If they see something on an X-ray monitor that looks suspicious, officers will isolate the package.\n\nNeedham: Can we pull that one, actually?\n\nNarrator: Isolated packages go through an intrusive search. Officers will cut them open to hand-search for drugs or counterfeit goods.\n\nNeedham: I always got taught, basically, expect a package to be something that’s going to your mum, so that if it is good, it’s coming back to your mum the same way that it’s supposed to be.\n\nThis is common. It’s, like, from back home. It’s pills, certain kind of vitamins, and they get them from their little pharmacy. I’m pretty sure that this right here is actually a steroid.\n\nProducer: Is that allowed?\n\nNeedham: No. The worst part is you don’t know what’s in these capsules.\n\nNarrator: If the officer finds drugs, the package is sent to Murielle.\n\nMurielle Lodvil: That’s 4,000-plus pills here.\n\nNarrator: But if he finds a counterfeit good, it’s sent to Steve. We’ll start with Murielle.\n\nLodvil: The strangest areas that we find drugs concealed are radio speakers or even car bumpers. For some reason, they love to place cocaine in car bumpers. It’s crazy, where we even find drugs in Play-Dohs. Also books, children books. In between the lining of the pages, you’ll find drugs there.\n\nNarrator: Murielle tests the drugs with a spectrometer called a Gemini. Using lasers, the machine can pierce through packaging and tell what drug is inside.\n\nLodvil: Right now, I’m gonna test this particular package. It’s telling me that it’s ketamine. It’s used for horse tranquilizer and also painkillers.\n\nNarrator: Murielle will label the drugs based on where they fall among the DEA’s drug schedules, Schedule V being a drug with the lowest potential for abuse or dependence, like Robitussin, and Schedule I being a drug with the highest potential for abuse, like ecstasy.\n\nLodvil: We have the GBL coming from the Netherlands, and someone in New York is receiving it. Steroid, a Schedule III, coming from Hong Kong. Then we have the carisoprodol coming from India. And then we have the tramadol coming from Singapore.\n\nNarrator: Any scheduled drugs will be seized.\n\nLodvil: There is no day that we come to work that we don’t find anything. Every day is a sense of importance because of the fact that we taking out those particular drugs from the street.\n\nNarrator: The narcotics unit had over 7,600 seizures in 2018, including 246 pounds of cocaine and over 360 pounds of ecstasy.\n\nNow, back to Steve. He’s the one that gets all the counterfeit goods. That’s anything that infringes on a company’s intellectual property rights, or IPR. Think fake Air Jordans, Gucci purses, or Rolex watches. Companies like Louis Vuitton and Gucci train Steve on the telltale signs for spotting a fake. While most of the tips are kept top secret to protect the brand, there are a few things that Steve could share with us.\n\nSteve Nethersole: The first, when it comes in, is the country of origin. These high-end manufacturers here, Louis Vuitton, Gucci, they’re coming from France, Italy, Spain. The watch is coming from Switzerland. When it’s coming from China, bing, that’s your No. 1 red flag. Then you look at the dilapidated boxes, so that’s two red flags there. A third thing is commingling. The high-end manufacturers never commingle their products, like, in other words, a Gucci inside a Fendi or a Louis Vuitton. These people will stuff watches, a wallet, inside a handbag. And so, they will never commingle their products. They are so precise.\n\nSome of the things I could say, like, some of the manufacturers, they don’t put any of this in it, the filler, inside it. They would never do that. We’ll look at the smell. Sometimes it smells like petroleum. It’s not real leather. We look at the stitching. We look at the symmetry of the logos by the manufacturer, the zippers. This one here is a Coach bag with a Michael Kors zipper. This coat has “Burbelly” on the buttons instead of Burberry, so these are the comical things that we find when you look at it up close, and you could pick it right out.\n\nNarrator: Counterfeit goods make up an estimated trillion-dollar industry that’s even been linked to terrorist groups around the world. In 2018, CBP had over 1,800 IPR seizures. And if all those counterfeit goods had gone on to sell at their suggested retail price, they’d total an estimated $US54 million. So, where do all these seized goods end up anyway?\n\nWell, most of the narcotics and counterfeit goods will be sent to a top-secret incinerator to be destroyed. Some of the drugs will go under further testing, while some of the counterfeit goods may be donated if the offended company allows it. But, in some cases, if the illegal goods are part of a greater investigation, CBP officers will actually put that package back in the mail. Then, they will track it all the way to the person it was sent to. This is known as a “controlled shipment.”\n\nLodvil: I’m the one who opened that package, and now I’m involved in this controlled delivery. Now I get to finish the story. All right, now we go out. We knocked on your door, you open. Hello, we noticed that you’ve ordered, you know, this particular package. It’s MDMA. What’s the story behind it? So then, we listen.\n\nNarrator: But whether they’re up against fake Guccis or dangerous amounts of fentanyl, CBP stands guard at the country’s busiest mail facility.\n\nLake: This is where it comes. You don’t see it all the time coming across the border in trucks and big bundles, like the TV will have you see. This is where it’s all coming from, and it hits the street and it destroys lives. So, in our way, if we can stop it here, it’s one less tragic story, probably, that we’re gonna have to hear about.\n\nBusiness Insider Emails & Alerts Site highlights each day to your inbox. Email Address Join\n\nFollow Business Insider Australia on Facebook, Twitter, LinkedIn, and Instagram.", "description": "", "authors": ["Abnarishkin", "Steve Cameron"], "top_image": "https://static.businessinsider.com/image/5d82a8c22e22af17aa17ba47", "published_at": "2019-09-23"}