{"pub": "yahoo", "url": "https://news.yahoo.com/halloween-2019-golden-girls-costume-152851428.html", "downloaded_at": "2019-10-05 22:58:48.168610+00:00", "title": "Halloween: 'Golden Girls' costume is the perfect group look", "language": "en", "text": "Calling all Blanches, Roses, Sophias and Dorothys: A new Halloween costume will have you grabbing you girls and thanking them for being a friend.\n\nTarget now has \"Golden Girls\" Halloween costumes from the brand Toynk, and they'll help you channel your inner Miami retiree this season. Available on Target's website for about $70 each, you can choose which \"Golden Girl\" suits your personality best.\n\nThe Rose costume features her signature pearls, while the Sophia look comes with a floral print dress and her glasses with an attached chain. The Blanche look features a fiery red sleeveless V-neck jumpsuit with a floral blazer, and the Dorothy costume features a black and white patterned blazer with a white shirt, wide-leg black pants and a gold lame scarf. At the time of publication, the Dorothy costume was the only one of the foursome left in stock.\n\nYou can also buy a set of all four wigs or you can purchase them individually.\n\nIf you prefer DIY over store-bought, you can easily recreate the ladies' looks.\n\nA pair of round glasses with a glasses chain and a floral dress instantly transforms you into a Sophia; a colorful dress, a strong blazer and a Southern accent turns you into a Blanche; a white button-down paired with black pants and a blazer will have you feeling like a Dorothy; and a blue dress, a necklace and red lips will put you in a Rose mood. As the finishing touch, you'll need some short, blonde and gray wigs.\n\n'Golden Girls'-inspired cereal: This exists now and it's flying off the shelves\n\nThe \"Golden Girls\" aren't the only pop culture icons being made into costumes this Halloween.\n\nYandy – the online retailer that faced backlash last fall for its provocative \"Handmaid's Tale\" costume – is bringing an updated sexy version of Mister Rogers to Halloween.\n\nThe brand's \"Nicest Neighbor Costume\" is here to give your childhood favorite a major twist, with a nod to the TV icon's famous red sweater paired with gray cutoff booty shorts.\n\nMister Rogers: Halloween costume gets sexy with red sweater, booty shorts\n\nYandy also listed a \"College Scandal Costume\" for nearly $70, referencing the admissions bribery scandal that has put actresses Felicity Huffman and Lori Loughlin in the headlines.\n\nThe sexy rendition includes a prison-orange crop top that says \"Inmate,\" with \"Mom of the Year\" crossed out. \"Yandy University\" is printed along the high-waist pants.\n\n\"Oops, you can't always trust those motherly instincts. Turns out fame and intelligence don't go hand in hand!\" Yandy's description says. \"Bribe your way to the admissions office and score the ultimate scholarly achievement (the best mom award!).\"\n\nCollege admissions scandal gets a sexy Halloween costume that you have to see to believe\n\nSee our full coverage of entertainment news.\n\nContributing: Cydney Henderson, Sonja Haller\n\nThis article originally appeared on USA TODAY: Halloween: 'Golden Girls' costume at Target is flying off the shelves", "description": "Calling all Blanches, Roses, Sophias and Dorothys: There's a new \"Golden Girls\" Halloween costume on the market.", "authors": ["Anika Reed", "Usa Today"], "top_image": "https://s.yimg.com/uu/api/res/1.2/uOn3z3pZcxr9vF1pK4DP9w--~B/aD0xMDgwO3c9MTkyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://d.yimg.com/hd/cp-video-transcode/1009217/a0c5dfd6-c73c-4830-a62b-cbe98d6951b7/9ecbfe4d-d1b6-53c8-ab41-8918ec861b03/data_3_0.jpg?s=d10c4879a3121870481dfa8380ed892f&c=2ea042e1cccbae1d5a8fddeae084ed1b&a=tripleplay4us&mr=0", "published_at": "2019-10-04"}