{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/1/nicklas-backstrom-hopes-play-capitals-life", "downloaded_at": "2019-10-02 02:28:58.237858+00:00", "title": "Perennially 'underrated' Backstrom hopes to be a Capital for life", "language": "en", "text": "This period of Washington Capitals hockey will be referred to as “the Alex Ovechkin era,” and for good reason. But historians could choose to put two names on the bill instead of one.\n\nNicklas Backstrom will embark on his 13th year in the NHL when the Capitals open their season Wednesday at the St. Louis Blues. It’s the final year of a 10-year contract the center signed in 2010, and he hasn’t equivocated about his hope that he and Ovechkin finish their careers with the club that drafted them.\n\n“We’re very fortunate to be (able) to spend all our careers so far with the same team. Hopefully we both will stay that way, too,” Backstrom told The Washington Times. “I love the city. I love the fans. D.C. is like family to me. It’s home for me.”\n\nBut Backstrom’s future here is unsettled. Goalie Braden Holtby is also entering the final year of his deal, and the Capitals are airtight up against the salary cap as it is. When training camp started, general manager Brian MacLellan said he hadn’t yet discussed an extension with Backstrom’s agent. Difficult decisions are coming.\n\nTeammates find it hard to imagine a Capitals team without Ovechkin and Backstrom at the core of the roster.\n\n“For me, I played against them since Day 1, since I got in the league, and they’ve been probably the most dynamic duo you can think of over the last 10 years,” forward Carl Hagelin said. “When you think Washington Capitals, you think Alex Ovechkin and you think Nicklas Backstrom.”\n\nGrowing up together\n\nOvechkin and Backstrom maintained a friendship while also pushing each other to improve; Backstrom once said Ovechkin is “the guy I’ve yelled at the most” in his career. Before and after winning the Stanley Cup, a bond endured.\n\n“We’ve been together since Day 1 and the chemistry that we have on the ice is tremendous, and I hope he’s going to stay,” Ovechkin said at preseason media day.\n\nLater that day, Backstrom joked, “He took me under his wing, and then when we got older I took him under my wing.”\n\nAfter a strong junior career with Brynäs IF in his homeland of Sweden, Backstrom arrived in Washington two years after Ovechkin as the fourth overall draft pick in 2006. As a Capitals youngster, Backstrom said Ovechkin would pick him up on his drive into town for home games, and they’d often hang out at night.\n\nIn a way, they grew up together in the District. Now both are married with kids: Ovechkin with 1-year-old son Sergei, Backstrom with 6-year-old daughter Haley and 3-year-old son Vince.\n\n“We were spending more time together off the ice here in D.C. when we both didn’t have kids and we were single, that’s for sure,” Backstrom recalled. “Now the situation is a little different. We got our own things to worry about.”\n\nTheir off-ice friendship helped their on-ice chemistry when Backstrom started centering Ovechkin’s line during his rookie season. Of Backstrom’s franchise-record 642 career assists, 248 of them — a remarkable 38.6% — set up Ovechkin goals.\n\nOther milestones are within the Swede’s reach this season. He’s just five games away from playing his 900th in a Capitals sweater and 27 points from 900 for his career, following in Ovechkin’s steps.\n\nTeammates credit Backstrom’s vision and hockey IQ as the strongest part of his game, and in a constantly changing NHL, attributes like those have helped Backstrom keep beating opponents and tally 50 assists for six straight years.\n\n“I have no scientific explanation for it,” Washington defenseman Nick Jensen said. “It’s just the way some guys are and Backstrom is probably one of the best guys I’ve ever seen at it, with the way he thinks about the game and the way he processes the game out there. It’s on a different level than most guys.”\n\nGetting his due\n\nEach year, the NHL Players Association conducts a poll, asking active players their opinions on everything from the league’s best goalie to the arena with the worst ice. Backstrom received the moniker of “most underrated player in the league” in 2017-18. A year later, he was second place in the same category, but his vote share rose to 11.4 %.\n\nThis puzzles teammates like Nic Dowd.\n\n“He’s been in the league for 12, 13, 14 years yet he’s still underrated, which makes no sense,” Dowd said. “I think a little bit of it has to do with the fact that he plays with such elite players in (Evgeny) Kuznetsov, Ovechkin, (T.J.) Oshie, guys that he’s surrounded by all the time … People say, ‘Oh yeah, he’s underrated,’ because he’s surrounded by superstars and he himself is a superstar.”\n\n“(Backstrom) kind of stays underneath the radar in terms of seeking out different opportunities, whether it’s commercials or publicity,” coach Todd Reirden added. “He likes to kind of fly under the radar, so I think some of this stuff is a little bit to his personality.”\n\nThat’s fine by Backstrom, who never sought much attention in the first place.\n\n“I don’t need to go out and ‘flash’ about things,” he said. “I like to go out, do my job and do the best I can. That’s my personality.”\n\nWashington’s younger centers learn a lot by watching Backstrom. Dowd praised his defensive awareness; in turn, Backstrom credited center Sergei Fedorov, his mentor early in his Capitals career.\n\n“He just took so much pride in being a two-way player and he was so good defensively, with his stick, positioning, everything,” Backstrom said. “So just watching him out there, he was always strong with the puck, making smart plays. Nothing fancy, just a real solid player.”\n\nIt’s a given that, when the puck drops, Backstrom wants to put the distraction of his expiring contract out of mind. How will he put the blinders on?\n\n“The key is just to think about the team,” he said. “We want to make the playoffs. That’s gonna be — it’s always been my mindset. I’m not gonna change that. I mean, I know I don’t have a contract next year, but you just gotta put that aside and think about what we do as a team, how we develop as a team. That’s what we gotta do.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "Nicklas Backstrom will embark on his 13th year in the NHL when the Capitals open their season Wednesday at the St. Louis Blues. He hopes he and Alex Ovechkin both finish their careers with the club that drafted them.", "authors": ["The Washington Times Http", "Adam Zielonka"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/29/Capitals_Hurricanes_Hockey_40068.jpg-f8281_c0-119-2856-1784_s1770x1032.jpg?ca57bb3c4cd767e494cfc31cf99976c98cf589b5", "published_at": "2019-10-01"}