{"pub": "bbc", "url": "https://bbc.co.uk/news/uk-politics-50142367", "downloaded_at": "2019-10-22 13:31:21.677568+00:00", "title": "PM to pull Brexit bill if timetable not approved", "language": "en", "text": "Media playback is unsupported on your device Media caption Johnson: \"Get Brexit done and move our country on\"\n\nThe government will abandon its Brexit bill if MPs vote down its three-day timetable to get it through Parliament.\n\nA No 10 source said if the programme was rejected and the EU confirmed a delay to the 31 October exit, it would instead push for a general election.\n\nThe source told the BBC: \"We won't waste further months with this Parliament.\"\n\nBut opposition MPs called the threat to pull the bill \"childish blackmail\".\n\nThe Withdrawal Agreement Bill was published on Monday night and MPs are now debating it in the Commons.\n\nThey will vote at around 19:00 BST on the proposed timetable.\n\nBoris Johnson agreed his new plan with EU leaders last week, but has repeatedly pledged to leave the EU by the end of October, with or without a deal.\n\nOpening the debate in the Commons, Mr Johnson told MPs that giving the deal - and the programme motion - their backing would \"get Brexit done and move our country on\".\n\nBut the decision to curtail the scrutiny of the bill to three days has sparked anger from opposition MPs.\n\nThe Liberal Democrats' spokesman for Brexit, Tom Brake, said: \"The Tory government's threat to pull the Withdrawal Agreement Bill, if they lose the vote on their rushed timetable, is childish blackmail.\n\n\"MPs shouldn't be bullied into voting in favour of this ridiculously short timetable.\"\n\nWhat is in the Withdrawal Agreement Bill?\n\nThe 110-page document will give legal effect to the withdrawal deal negotiated by Mr Johnson.\n\nHis plan ditches the backstop - the controversial measure designed to prevent a return to physical checks on the Irish border.\n\nInstead it essentially draws a new customs border in the Irish Sea, as goods which could travel onwards to Ireland will have to pay a duty tax.\n\nIt also will see the whole of the UK leave the EU customs union, meaning it could strike trade deals with other countries in the future.\n\nThe WAB will also turn any agreed transition period into law, fulfil requirements on the rights of EU citizens in the UK after Brexit, and allow ministers to make \"divorce payments\" to the EU foreseen under the current deal.\n\nBut MPs will be able to vote on amendments - changes or add-ons - to the bill.\n\nIf the government cannot get the bill through Parliament, the default legal position is for the UK to leave without a deal on 31 October, but that will change if the EU grants an extension.", "description": "No 10 will push for an election if MPs rule out passing the bill in three days and the EU grants a Brexit delay.", "authors": [], "top_image": "https://ichef.bbci.co.uk/images/ic/1024x576/p07rqg9m.jpg", "published_at": "2019-10-22"}