{"pub": "abcnews", "url": "https://abcnews.go.com/Politics/meghan-mccain-honors-slain-isis-hostage-kayla-mueller/story?id=66583254", "downloaded_at": "2019-10-28 23:33:39.971564+00:00", "title": "Meghan McCain honors slain ISIS hostage Kayla Mueller following al-Baghdadi death: 'All of our hearts should be with the...family'", "language": "en", "text": "\"The View\" co-host Meghan McCain took a moment on Monday to honor slain humanitarian worker and ISIS hostage Kayla Mueller during a discussion on the show about the U.S. special operations raid in Syria over the weekend that led to the death of ISIS leader and founder Abu Bakr al-Baghdadi.\n\nMueller was a Doctors Without Borders volunteer and Arizona native who was kidnapped by ISIS on Aug. 3, 2013, after she crossed into Syrian border for a humanitarian mission. U.S. officials confirmed that she died in February 2015 while in ISIS custody.\n\nMueller Family\n\nPresident Donald Trump mentioned Mueller during his announcement of al-Baghdadi's death on Sunday, calling her a \"beautiful young woman\" who died while trying to \"help people.\"\n\nMcCain honored Mueller's sacrifices on Monday.\n\n\"I want to talk about Kayla Mueller who was a woman from Prescott, Arizona, who was a Doctors Without Borders volunteer who was taken by al-Baghdadi, tortured, kept in solitary confinement, raped over and over and over again,\" McCain said.\n\n\"[She] had the opportunity to leave and didn't, and [therefore] saved other women,\" she added. \"She's a very big name, I think, nationally, and in Arizona in particular, and I think today we honor her. We honor her family.\"\n\nMueller's parents, Marsha and Carl Mueller said in an interview on Sunday that they once traveled to Irbil, Syria, where they met Umm Sayyaf, the wife of ISIS militant Abu Sayyaf, and others who had made contact with their daughter.\n\n\"We learned from women that were ransomed out by their governments that...she was held in many cold, dark places. She was raped by al-Baghdadi, we know that to be a fact,\" Carl Mueller said. \"She was murdered by him or someone in his organization. That's what we're pursuing and that's what we hope that President Trump will help us with.\"\n\nABC News\n\nOn Monday, McCain said al-Baghdadi is \"the worst of the worst of the worst kind of scum on the planet.\"\n\n\"I hope he's burning in hell with Osama bin Laden. I don't care if that's un-[politically correct] to say this morning,\" McCain said. \"I don't care. It's our life or the others.\"\n\nMcCain also recalled the moment in which she heard of former al-Qaida leader Osama bin Laden's death in 2011. \"I was on a plane and the plane applauded, and...I was crying and elated, and I remember wanting to go on the streets and there was a bunch of people,\" she said.\n\n\"I wanted to celebrate yesterday, and there was not this feeling of celebration in the way that we should take these wins because it's a win for America,\" said McCain of al-Baghdadi's death. \"It's a win for democracy, and it's a win for freedom and it's a win for people who don't believe in torture and raping young women who are just volunteering with Doctors Without Borders overseas.\"\n\n\"I really think, at this moment, all of our hearts should be with the Mueller family today.\"\n\nEvery episode of ABC's award-winning talk show \"The View\" is now available as a podcast! Listen and subscribe for free on Apple Podcasts, Google Podcasts, TuneIn, Spotify, Stitcher or the ABC News app.", "description": "", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/meghan-mccain-abc-jef-191028_hpMain_16x9_992.jpg", "published_at": "2019-10-28"}