{"pub": "independent", "url": "https://independent.co.uk/life-style/food-and-drink/features/pophams-bakery-hackney-pasta-pastries-restaurant-review-bakery-a9168246.html", "downloaded_at": "2019-10-25 23:49:22.902236+00:00", "title": "Popham’s Bakery, Hackney: Where pastries and pasta unite", "language": "en", "text": "At Pophams’s new outpost on Richmond Road, in east London, you could eat happily from breakfast until night without consuming anything much more complicated than flour, eggs and water.\n\nIt’s almost as if they are on a mission to prove that, while customers might claim allegiance to “meat” or “vegetables”, what we really crave is glutinous starch, made with care, loaded with interesting flavours and served with generosity. On the evidence, they might be right.\n\nIt started out as a bakery in Canonbury before expanding to this, the second proper venue, earlier this year, on the site of what used to be Rawduck. (There is a Pophams stall at the Arcade Food Theatre, but we don’t need to discuss that...) I liked Rawduck, which was part of the Duck Soup group, but it was rarely full, and the large grey room could feel echoey.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nPophams is a less risky proposition, and has worked to make the space more cosy by installing a bakery counter at one end and piling sacks of flour high along the walls. The kitchen is still open, with chairs along a counter as well as the tables, but the effect is of a more bustling and less brutalist restaurant. It’s known for its pastries, which include passion fruit and mango custard danishes and a Marmite and cheese onion schlossberger, as well as more traditional croissants and pain aux chocolats.\n\nAt lunchtime, the menu expands into toasties and tartines, and at the weekends it becomes more unusual, to cater to the experimental brunchers of E8 with tonka bean creme brulee and peanut butter, jam and banana.\n\nThis part of Hackney is not short of artisan bakeries. Next to London Fields station there is the E5 Bakehouse, and nearby are Dusty Knuckle, and Violet.\n\nPopham’s twist is to serve pasta in the evenings between Wednesday and Sunday, with the same attention to detail and big flavours as the pastries.\n\nThere are just three starters and five pastas. It would take an iron will not to order the lot. We rattle through chunky, briny giarraffa olives and a pointless roasted celeriac carpaccio, lingering on the springy sourdough, which is served with a balsamic butter that begs to be mopped up out of the dish.\n\nThe pastas all look gorgeous, as you’d expect from a bakery with a firm handle on the photo-friendliness of its pastries. Nduja scarpinocc, a northern Italian chassis with a fiery Calabrese interior, resembles a sheet of glossy-yellow sweets coming off a production line, dotted with pale mint broad beans.\n\nBright little tomatoes sit in a heap of cappellacci dei briganti, a shape I have not encountered before, named because they look like little bandit hats.\n\nBest of all were cylindrical cappelletti, filled with molten taleggio and sprinkled with hazelnuts for texture and half-grapes for sweetness, which cuts through the cheese oozing from each capsule.\n\nWe gobble them down and summon another portion. “Lots of people re-order that one,” says our waitress, who has an American accent and an appealing easy-breezy competence.\n\nFirst minor gripe: a vegetable would be nice. Just one. A salad? For show, if nothing else. Second minor gripe: wines by the bottle start at £28, which detracts from the all-day flour-theme-park jollity.\n\nMajor gripe: a trip to the loo entails a walk out of the restaurant, across a long brightly lit lobby, up two flights of stairs and round some corners, as if you are breaking into someone’s flat. I don’t know if this is a temporary measure, but if it’s boring for youngish, fittish diners, it will be very tedious for anyone less mobile. Loos shouldn’t need lifts.\n\nPudding arrives, a fig leaf pannacotta and a “yeasted semifreddo”, which sounds more exciting than it is, perhaps because by this point we are loosening our belts and rocking back in our chairs.\n\nThe bill is £40 a head, not the cheapest meal in town, but hardly unreasonable considering the gluttony. Besides, you can’t run a place like this without keeping an eye on the dough.\n\nWould I go again? Yes\n\nShould you go? Yes\n\nCan you take your parents? Yes, if they are adventurous toilet-users\n\nPophams Bakery – Hackney 197-205 Richmond Rd, London E8 3NJ; open daily; pophamsbakery.com", "description": "At Pophams’s new outpost on Richmond Road, in east London, you could eat happily from breakfast until night without consuming anything much more complicated than flour, eggs and water. It’s almost as if they are on a mission to prove that, while customers might claim allegiance to “meat” or “vegetables”, what we really crave is glutinous starch, made with care, loaded with", "authors": ["Ed Cumming"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/10/24/12/pophams-hackney-interior.jpg", "published_at": "2019-10-24"}