{"pub": "reuters", "url": "https://ca.reuters.com/article/topNews/idCAKBN1X20NE-OCATP", "downloaded_at": "2019-10-23 09:00:12.762084+00:00", "title": "Exclusive: Datsun brand set to go as Nissan rolls back Ghosn's expansionist strategy - sources", "language": "en", "text": "YOKOHAMA, Japan (Reuters) - Nissan Motor Co Ltd is likely to axe its Datsun brand, drop some unprofitable products and close a number of assembly lines worldwide as it seeks to boost profits by getting smaller, two company sources with direct knowledge of the matter said.\n\nFILE PHOTO: A worker walks near a Datsun logo at a Nissan Indonesia factory in Purwakarta, Indonesia West Java province, May 8, 2014. REUTERS/Beawiharta\n\nKnown internally as the “performance recovery plan”, the proposed steps mark a sharp break with Nissan’s strategy under ousted leader Carlos Ghosn, who pursued ambitious vehicle sales targets in the United States and other major markets.\n\nThe plan is the Yokohama-based automaker’s latest attempt to pull itself out of crisis after Ghosn was arrested for financial misconduct - charges he denies. The scandal has further strained an already dysfunctional alliance with Renault SA and thrown Nissan into disarray as it finds itself on course to book its lowest operating profit in 11 years.\n\nThe sources said Nissan will likely kill loss-making variants for the Titan full-size pickup. Unprofitable variants include the single-cab and diesel versions.\n\nA planned shuttering of underutilized production lines will most probably hit plants in emerging markets building Datsun and other small cars hardest, they added.\n\n“We need to chart a recovery but the rot goes deep,” one of the sources said of the many problems facing Nissan.\n\nThe second source said all markets with factories except China were being looked at for possible reductions in production capacity. That source also said, however, that there were no plans to close an entire plant or withdraw completely from any country.\n\nIn the United States, one of Nissan’s biggest markets, the plan calls for fresh efforts to weed out the practice of buying market share by selling vehicles to rental car and other fleet operators at heavy discounts - a practice which destroyed profitability and undermined Nissan’s brand image.\n\n“We’re trying to clean up what had happened in the past,” one of the sources said, adding that under Ghosn, Nissan sought to meet sales objectives at any cost, including “practically giving away cars” to fleet customers.\n\nA team led by Jun Seki, a senior vice president and incoming vice chief operating officer, is expected to unveil the wide-ranging plan this month though some aspects are still being finalised, said the sources, who were not authorized to speak to media and declined to be identified.\n\nNissan declined to comment.\n\nSeki is part of a new management team that will see Makoto Uchida, Nissan’s head of China operations, take the helm - an appointment that is expected to take effect by Jan. 1.\n\nThe new steps follow plans unveiled in July to cut headcount by 12,500 globally by early 2023 and which also flagged cuts to production capacity. At the time, then-CEO Hiroto Saikawa said 14 facilities would be affected.\n\nEMERGING MARKET WOES\n\nOverall, the plan’s aim is to free up resources to focus more on the United States and China, the sources said.\n\nTo that end it will roll back an aggressive expansionist strategy Ghosn set in motion under a five-year plan called Power 88 which aimed to raise profit margins and global market share to 8 percent by fiscal 2016 - goals which were never achieved.\n\nThe Datsun brand - revived for emerging markets under Ghosn after being phased out in the 1980s - will likely bear the brunt of the restructuring. The models are manufactured in Indonesia, India and Russia.\n\nThe sources said problems emerged after Nissan began deploying the no-frills cars in 2014 in small markets such as Indonesia, India, Russia and South Africa where it also sells vehicles under its mainstay Nissan brand.\n\nIn Indonesia, for example, after a relatively good start, Datsun cars soon began eating into Nissan sales.\n\n“We ended up pushing two mainstream brands in a market where you have a one or two percent market share. You cannot do that,” one of the sources said, adding that there had been similar outcomes in India, South Africa and Russia.\n\nIn its bigger markets, a steady supply of new or significantly redesigned models – starting with the redesigned Altima which was launched in the United States late last year – is expected to help Nissan reset the way it prices its vehicles.\n\n“Still, it takes about a year to get any sort of tangible results,” one of the sources said, adding that until then the Japanese automaker would continue to see sales by volume fall in the U.S. market.", "description": "Nissan Motor Co Ltd is likely to axe its Datsun brand, drop some unprofitable products and close a number of assembly lines worldwide as it seeks to boost profits by getting smaller, two company sources with direct knowledge of the matter said.", "authors": ["Norihiko Shirouzu", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191023&t=2&i=1444019595&w=1200&r=LYNXMPEF9M0GT-OCATP", "published_at": "2019-10-23"}