{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7586397/Love-Island-Phoebe-scared-embarrassing-parents-coming-out.html", "downloaded_at": "2019-10-18 04:50:24.134532+00:00", "title": "Love Island: Phoebe was 'scared of embarrassing her parents' by coming out", "language": "en", "text": "Phoebe Thompson sent shockwaves through the villa when she chose to couple up with Cassie Lansdell on Love Island Australia earlier this week.\n\nAnd while viewers were surprised by the show's first same-sex pairing, they weren't half as shocked as Phoebe's parents, who had no idea she was attracted to women.\n\nSpeaking on The Kyle and Jackie O Show on Friday, the 28-year-old admitted that she'd never had a conversation about her sexuality with her mother and father.\n\n'That was really scary for me': Love Island's Phoebe Thompson was 'scared of embarrassing her parents' by coming out on the show, after her surprise coupling with Cassie Lansdell\n\n'That was really scary for me, I had a lot of anxiety around that,' she said.\n\n'I just want to make it clear, I've never been in another relationship with another woman but that doesn't mean I haven't been intimate with a woman.'\n\nRadio host Kyle Sandilands then asked Phoebe if she had spoken with her parents about her sexuality since being kicked off the show.\n\n'Yeah, I have spoken to my mum and she's fine with it. She said, \"I think it would be easier to date girls, go for it,\"' Phoebe said.\n\n'I was scared I had embarrassed her but she said no. She said I came across as the most genuine [on Love Island] and was nice to everyone.'\n\nPhoebe's relationship with Cassie barely lasted 24 hours, as they decided to part ways shortly after coupling up.\n\nSecret: Speaking on The Kyle and Jackie O Show on Friday, Phoebe (left) said she'd never had a conversation about her sexuality with her parents before coupling up with Cassie (right)\n\nSpeaking to Daily Mail Australia on Thursday, Phoebe blamed their break-up on the 'pressure' to be intimate in the villa.\n\n'We both felt a lot of pressure. Neither of us had ever been in a relationship with a woman before,' she said.\n\n'I think, as soon as we coupled up, all the boys were just sort of staring at us, waiting for something to happen. It was just too much pressure.'", "description": "Phoebe Thompson sent shockwaves through the villa when she chose to couple up with Cassie Lansdell on Love Island Australia earlier this week.", "authors": ["Tom Place For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/18/01/19864450-0-image-a-81_1571358219184.jpg", "published_at": "2019-10-18"}