{"pub": "news24", "url": "https://fin24.com/Companies/ICT/govt-in-talks-with-strategic-equity-partners-for-saa-ramaphosa-confirms-20191014", "downloaded_at": "2019-10-14 23:33:12.371148+00:00", "title": "Govt in talks with strategic equity partners for SAA, Ramaphosa confirms", "language": "en", "text": "Government is currently engaged in talks with potential strategic equity partners for South African Airways, President Cyril Ramaphosa has said.\n\nThe president was speaking at the Financial Times Africa Summit, in London, on Monday. He delivered the opening address at the summit, which is a gathering of investors and business people.\n\nDuring a question and answer session, he shared more on government's position on private sector participation in state-owned enterprises (SOEs), like the national carrier.\n\n\"We have put on record we are open to participation of the private sector with regard to some of our SOEs,\" he said. \"We are talking to a few interested parties when it comes to SAA, for instance,\" he added.\n\nBloomberg previously reported that Ethiopian Airlines Group would consider buying a stake in SAA. The two airlines are already partners through the Star Alliance.\n\nEthiopian Airlines this year received the African Champion of the Year Award at the Africa CEO Forum which took place in Kigali, Rwanda, just a few weeks after the fatal Boeing 737 MAX 8 crash.\n\nEthiopian Airlines has successfully established intra-African partnerships across 40 countries on the continent. This is a stark contrast to SAA, which is in a dire financial position.\n\n\n\nThe state airline requires R21.7bn to fund its three-year turnaround plan. It recently received a R5.5bn capital injection from Treasury, Fin24 previously reported.\n\nPart of the R5.5bn capital allocation will be used to repay a R3.5bn working capital facility and the remaining R2bn will be used to meet the airline's working capital requirements, board members told Parliament's portfolio committee in September.\n\n\n\nSAA still requires an additional R2bn by December 2019, to fund working capital for 2019/20 and the airline is in discussion with lenders to make available funding, Fin24 previously reported.\n\nSAA's financial statements for the 2018/19 year could not be tabled before Parliament on time. According to a letter from Public Enterprises Minister Pravin Gordhan to Parliament, airlines SAA and SA Express are both facing \"serious financial challenges\" and are unable to meet going concerns. He said financial statements would be tabled once the going concern challenges are addressed.", "description": "Government is open to partnerships with the private sector when it comes to fixing state-owned enterprises and is currently in talks with parties interested in SAA.", "authors": ["Lameez Omarjee"], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9003/191e9d5b28bb434daedf7862df543e64.jpg", "published_at": "2019-10-14"}