{"pub": "guardian", "url": "https://theguardian.com/books/2019/sep/30/who-dares-wins-britain-1979-1982-dominic-sandbrook-review", "downloaded_at": "2019-09-30 10:46:46.333999+00:00", "title": "Who Dares Wins: Britain, 1979-1982 by Dominic Sandbrook – review", "language": "en", "text": "Who is writing to whom? “I watched it on Match of the Day but without knowing the result. At first, it was agony seeing the near misses – almost as bad for me watching as for you playing! But at least I only had the tension for half an hour before getting the result I was longing for…” Give in? It’s from Margaret Thatcher’s handwritten letter congratulating Liverpool captain Emlyn Hughes on a victory over Manchester United in February 1978. Hard to know what’s more incredible – that the Tory leader was an avid football fan or that she should have displayed a fondness for anything Liverpudlian at all.\n\nIt’s the sort of surprise that keeps ambushing the reader during Who Dares Wins, Dominic Sandbrook’s long, painstaking and pretty enjoyable haul through Britain in the first three years of the Thatcher government. This is the first big contemporary account of an era I can remember living through (I was 15 in 1979) and you may feel a nice balance of piquancy and poignancy in having those years brought to life by the historian’s magic wand. What’s more, there’s a clear arc to the narrative, from the grim-and-bear-it years of 1979-80 to the turning-point summer of 1982, when victory in the Falklands enhanced Thatcher’s image as “Britannia incarnate” and rescued her government from near ignominy.\n\nOr did it? The reality was more complicated, says Sandbrook. Even before the Argentinian invasion the Tories had been on an upswing, inflation was falling, business improving, and their approval rate was more than 30%. This contrasts with the opening sections of the book, which lay out the sorry state of Britain at the turn of the 80s – economic decline, unemployment, inflation, violence in Northern Ireland, strikes, riots, and a general sense that our days of being “Great” were long gone. The received wisdom is that Thatcher set about destroying British industry by hammering the unions, instituting cash controls – monetarism – and plunging the country into recession. But, as Sandbrook argues, coal, steel and car-making had been in steep decline for years, and the recession would have happened even under Labour. Similarly, the right to buy, the Tories’ controversial sale of council houses, predated Thatcher by at least a decade; her twist on the policy was to make it law.\n\nMrs Thatcher enjoyed watching snooker, though leisure was not something she understood\n\nIf Who Dares Wins were only a rehearsal of the political scene it would be a tough read. Instead, it leavens the load by ranging over the sights, sounds and smells of an era that looks almost quaint 40 years on. Hard to credit, for instance, how awful restaurant food was back then, not to mention the state of the office worker’s sandwich. Marks & Spencer changed the game with its triangular-packed sarnies in 1980, a year after its breakthrough ready-meal chicken kiev (£1.99 for a two-pack). Wine bars proliferated, and with them a music to match their new clientele’s aspirations – Spandau Ballet, Duran Duran and all their be-frilled confrères. Sandbrook is especially good on sport, not just the headline-grabbers of Ovett-Coe, Botham’s Ashes and the boycotted Moscow Olympics but the quieter revolution of snooker, the first televised sport watched by more women than men. Women playing snooker, though, was still resisted in a time when private clubs were exempt from the Sex Discrimination Act.\n\nThatcher enjoyed watching snooker, too – in the end this book’s diffuse pathways all lead back to her – though leisure was not something she understood. She lived to work. Sandbrook is ungratifyingly even-handed in his portrait of her, alive to the flaws in her character and sharp in confounding the popular myths. For example, Thatcherism is closely bound up with an age dependent on credit, yet she herself was puritanical to a fault and disapproved of borrowing – she never owned a credit card. There is an omission, however, and a glaring one, when Sandbrook describes her as “remarkably sympathetic” to her minister Cecil Parkinson after the scandal of his affair broke in 1983, but fails to mention how unsympathetic she was to Sara Keays, the secretary Parkinson made pregnant and publicly abandoned. But then she was never much of a champion for women.\n\nIf the book does have an undeclared villain it’s one from the opposite end of the political spectrum: Tony Benn. The case against him is meticulously rendered by Sandbrook and includes duplicity, opportunism, vanity, “sectarian intolerance” and “ruthless pursuit of internal feuds”. The surprise, to me, was that the last two charges were voiced by his one-time colleague Michael Foot.\n\nHovering over Who Dares Wins, I’m afraid, is the old line about those who fail to learn from history being doomed to repeat it. 1979-82 was an era of crises in transport and infrastructure, a Labour party hamstrung by internal strife, a government fronted by the most divisive leader in years, a people bitterly disunited and a nation staring disaster in the face. Remind you of anything?\n\n• Who Dares Wins: Britain, 1979-1982 by Dominic Sandbrook is published by Allen Lane (£35). To order a copy go to guardianbookshop.com or call 0330 333 6846. Free UK p&p over £15, online orders only. Phone orders min p&p of £1.99", "description": "The historian’s appraisal of the country in the early years of the Thatcher government is even-handed and enjoyable", "authors": ["Anthony Quinn"], "top_image": "https://i.guim.co.uk/img/media/a1f9b7511377ee97c5846715bdd1b153fe89dd57/0_70_3500_2101/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=c99f7ab821c899df162d2e0c0a61432e", "published_at": "2019-09-30"}