{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7629381/Lily-Allen-seen-NYC-saying-shell-stay-Brexit.html", "downloaded_at": "2019-10-30 08:42:52.895617+00:00", "title": "Lily Allen seen in NYC after saying she'll stay there until Brexit", "language": "en", "text": "Lily Allen has vowed to stay with Stranger Things star David Harbour, 44, in New York City until after Brexit.\n\nAnd with Boris Johnson now extending the deadline until 31 January 2020, the London-based singer will be residing in the US for longer than expected.\n\nThe 34-year-old star looked perfectly at home in the Big Apple, strolling along while chatting on the phone.\n\nMaking herself at home: Lily Allen stepped out in New York City on Tuesday after vowing to stay in the US until after Brexit\n\nLily wrapped up in a black coat and grey leggings, pushing her hair back from her face with a white and black headband.\n\nIt seems she's been fitting in perfectly stateside, revealing she had received not one, but three compliments on her nail art while riding the subway.\n\n'I’ve been congratulated on my nails 3 times on this NY subway trip so far. Nothing on my shiny forehead yet. @naominailsnyc', she enthused.\n\nThe London-based star had previously said she was going to stay with David in America until October 31 when the UK was due to leave the European Union.\n\nShe told her social media followers: 'Leaving UK till after Brexit. Good Luck Kids. Also what's the most annoying engagement baiting question caption you've read? LMK in the comments'.\n\nCasual: The 34-year-old singer looked perfectly at home in the Big Apple, strolling along in a black coat and a pair of grey leggings\n\nFunky: She's been fitting in perfectly, revealing she had received not one, but three compliments on her nail art while riding the subway\n\nHer romance with David appears to be getting serious and the pair have made a number of public appearances together over the past few weeks.\n\nHe has also met Lily's children Marnie, six, and Ethel, seven, after they flew out to visit her during their half term break.\n\nThe actor shared a sweet snap of the pair dressed up during their visit to Disneyland alongside the Smile singer's daughters.\n\nThe actor, best known for playing Jim Hopper in hit Neflix show Stranger Things, dressed as the Beast from Beauty And The Beast, showing off his playful side.\n\nHe posted: 'The prince, princess and the parking lot. That seven dwarves mine ride is the best one in the whole damn park. Go on, fight me. #magic #disney #rulebreakers'.\n\nBeauty And The Beast: Her boyfriend David shared a sweet snap of the pair dressed up during their visit to Disneyland alongside Lily's daughters Marnie, six, and Ethel, seven\n\nLily's little girls - who she shares with her ex-husband Sam Cooper - also enjoyed a road trip to Space Center Houston in Texas with Lily and David.\n\nThe mother-of-two uploaded some sweet snaps as she spent some quality time with her daughters over the weekend.\n\nLily separated from ex-husband Sam in 2015 after about four years marriage, finalising their divorce in 2018.\n\nThey share joint custody of their two daughters Ethel, seven, and Marnie, six, and remain 'really friendly' to this day.\n\nDuring an interview on Loose Women back in 2018, she said: '[Our custody agreement] wasn't really something we discussed, we're both really friendly, our kids go to school equidistant between our houses, so it works.'\n\nHalf term fun: Lily's little girls - who she shares with her ex-husband Sam Cooper - have flown out to visit her and they enjoyed a road trip to Space Center Houston in Texas\n\nSmitten: Her romance with David appears to be getting serious and the pair have made a number of public appearances together over the past few weeks. They are pictured watching the New York Knicks v New Orleans Pelicans game at Madison Square Garden last week\n\nFollowing their separation, the songstress was in a relationship with grime DJ MC Meridian Dan, real name Daniel Lawrence London.\n\nThe pair first started dating three years ago, but Lily told How To Fail podcast host Elizabeth Day they had split in December 2018.\n\nShe said at the time: 'I'm single, for the first time since I was about 15. I've just come back from a tour in America, which is where I was when things went wrong with Sam, and the same thing happened in my current relationship.\n\n'I mean, I didn't take lots of drugs and have lots of sex with other people. I just became very lost.'\n\nDavid is believed to have split from Fantastic Beasts star Alison Sudol earlier this year after a year and a half of dating.\n\nEx-husband: Lily separated from husband Sam Cooper in 2015 after about four years marriage, finalising their divorce in 2018 (pictured in June 2014)", "description": "Lily Allen has vowed to stay with Stranger Things star David Harbour, 44, in New York City until after Brexit. The 34-year-old star lookedat home in the Big Apple, strolling along and chatting on the phone.", "authors": ["Kate Thomas For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/30/08/20364248-0-image-a-4_1572423211914.jpg", "published_at": "2019-10-30"}