{"pub": "townhall", "title": "Trump Refocuses Investors On Fed Policy Response With New Trade War Threats", "url": "https://finance.townhall.com/columnists/politicalcalculations/2019/08/26/trump-refocuses-investors-on-fed-policy-response-with-new-trade-war-threats-n2552180", "language": "en", "published_at": "2019-08-26", "downloaded_at": "2019-09-02 07:19:02.956582+00:00", "text": "Friday, 23 August 2019 saw some of the most interesting investor reactions to new information that we've seen this year. The day started with China's announcement it would impose larger tariffs on U.S. goods, which sent stock prices lower. Then, Federal Reserve chair Jerome Powell spoke at the Fed's annual retreat at Jackson Hole Wyoming, where he gave the impression the Fed saw the U.S. economy as being strong enough where investors shouldn't expect much in the way of more rate cuts in the weeks ahead, which caused stock prices to rebound somewhat, up to where they were close to flat on the day.\n\nAnd then, President Donald Trump reacted to both of these events, where suddenly, investors were forced to consider the possibility that the Fed could be compelled to cut interest rates in the U.S. more dramatically before the end of 2019 to address the fallout from escalations in the U.S.-China trade war.\n\nThese dynamics compelled investors to shift their forward-looking attention from being split between 2019-Q4 and 2020-Q1 to instead be more tightly focused on 2019-Q4, sending stock prices significantly lower, with the S&P 500 (Index: SPX) closing the day down by 2.6%.\n\nBut that was last week. Looking ahead, we find that the short term echo of the stock market volatility that kicked up a month earlier should start affecting the accuracy of our dividend futures-based forecasting model by the end of the week ahead, similar to what we last observed in December 2018.\n\nNow, as then, the volatility we're observing in stock prices is being principally driven by investors resetting their forward-looking time horizon from one point of time to others. In December 2018, the timing of those shifts proved to be very difficult to anticipate, where the random onset of new information directly drove those changes.\n\nWe anticipate the current market environment will be similarly chaotic in the weeks ahead, where we are curious to assess how well our 'standard' model might predict the future for stock prices without adjustment to compensate for the echo effect (as we do when we present redzone forecasts), where we'll be testing different techniques to compensate for the short term echo in our model's projections behind the scenes.\n\nMeanwhile, to see what we mean for how new information causes investors to change how far forward in time they're looking in making their current day investment decisions, here are the major market-moving headlines we sampled from the past week.\n\nFor a week that was as unbalanced as the third week of August 2019 was, Barry Ritholtz has a remarkably balanced list of 5 positives and 5 negatives he found in the week's economics and market-related news. Do check it out to get a bigger picture of what was in the week's news than the headlines we highlighted above.", "description": "Friday, 23 August 2019 saw some of the most interesting .09/02/2019 3:19:02AM EST.", "authors": ["Political", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/233/c5343740-3748-4f2b-a5c6-2fd5c5bd516f.png"}