{"pub": "vice", "url": "https://vice.com/en_us/article/evjkka/autocorrect-is-for-cowards", "downloaded_at": "2019-10-21 13:12:45.674909+00:00", "title": "Autocorrect Is for Cowards", "language": "en", "text": "Follow me, if you will, back to a time before the smartphone. Unless you had a Blackberry—in which case, honestly, stop reading now—texting required more thought and effort. We had to get creative and walk up a hill both ways to communicate simple sentiments like ‘c u soon,’ or ‘meet @ 711’ or ‘i lik ur hairct :).’ Today, the T9 text input system is nothing but a distant cultural memory, and it’s so much easier to keep in touch with people it’s not even funny. But somewhere down the line, we lost a little freedom; the freedom to spell badly. The freedom to type “omw” without seeming too enthusiastic. I’m talking about the freedom that came before autocorrect.\n\nThe concept of autocorrect was created by a Microsoft engineer in the 1990s and introduced to Apple in 2005. Both engineers spoke with Wired about their respective programs, the former in a 2014 profile and the latter in a 2018 op-ed, and sheepishly poked fun at the humorous mistakes that autocorrect is known for producing. But my main beef with autocorrect isn’t that it’s prone to amusing little errors (“Oh no, I meant to text my mom about pencils but my phone changed it to penis! Also, it’s 2011 so this is still a viable joke format!”). My issue with autocorrect is that it makes us lazy. Sometimes typos can be communicative in their own right! In the words of my editor, Rachel: “It’s killing the vernacular.” Are we so afraid of making mistakes that we’re willing to sacrifice linguistic innovation?\n\nHow else would I have weirded out my roommate, who was looking forward to celebrating Yom Kippur?\n\nNow my friend knows, in no uncertain terms, that she's in for a treat for referring me to a dentist.\n\nDoesn't my excitement re: the Shawn Mendes origin story just LEAP off the screen?\n\nTyping sans autocorrect allows me to convey my emotions more clearly. I can spell my boyfriend’s name a bunch of different ways when I tell my friends I’m ditching them to watch The Sopranos with him. I can keyboard mash when someone sends me a picture of Bella Hadid looking iconic without worrying about accidentally sending a random string of words instead. That Spongebob meme wHeRe YoU tYpE lIkE tHiS was a cakewalk for me. Maybe I just like to live life a little dangerously, but I think there’s something nice about a text typed with vigor, dashed off in the heat of the moment, with the misspellings to prove it.\n\nSkeptics, sadly, abound.\n\nOf course, I have received literal gasps of horror after telling people about my autocorrect policy. I’m also pretty sure I’ve never actually converted anyone to my point of view. But like all great iconoclasts and free-speech activists, I remain resolute in my beliefs. Because of my autocorrect-free lifestyle, I will never, ever be “On my way!” ( ed. note: you can turn this off in settings, Katie.) (Author’s note: idGaf!!!!11!!) unless it’s on my own terms. I suggest you free your mind and do the same.\n\nSign up for our newsletter to get the best of VICE delivered to your inbox daily.\n\nFollow Katie Way on Twitter .", "description": "Once you open your mind to the possibilities that a life without autocorrect brings, I promise you won’t miss the safety net.", "authors": [], "top_image": "https://video-images.vice.com/articles/5daa2a78fbf646000a3810d9/lede/1571433665392-Untitled-design.jpeg?crop=1xw:0.9204545454545454xh;center,center&resize=1200:*", "published_at": "2019-10-18"}