{"pub": "cnn", "url": "https://cnn.com/travel/article/baby-seat-map-scli-intl/index.html", "downloaded_at": "2019-09-30 02:18:04.112353+00:00", "title": "Airline introduces baby seat map to allow passengers to avoid infants", "language": "en", "text": "(CNN) — Every traveler has their pet peeves, but crying babies are almost guaranteed to grate.\n\nNow Japan Airlines has revealed a new tool that lets you dodge infants when you book your seat.\n\n\"Passengers traveling with children between 8 days and 2 years old who select their seats on the JAL website will have a child icon displayed on their seats on the seat selection screen,\" reads the airline's website.\n\nThe move will be a boon for travelers who like to avoid babies. Japan Airlines\n\n\"This lets other passengers know a child may be sitting there.\"\n\nAnd one Twitter user praised the feature following a recent flight.\n\n\"Thank you, @JAL_Official_jp for warnings me about where babies plan to scream and yell during a 13 hour trip,\" wrote Rahat Ahmed.\n\n\"This really ought to be mandatory across the board.\"\n\nBefore babyphobes get too excited, Japan Airlines cautions that the baby map will not display child icons in certain situations.\n\nIt only works for bookings made through the JAL website, for example, and icons will not display if there is a change in aircraft.\n\nIf you are taking a small child on your trip, JAL offers a number of services to make your experience better.\n\nThe airline provides a number of strollers for rent in the airport, and will accept baby strollers as checked baggage for free.\n\nPassengers traveling with infants also enjoy priority boarding, and offers hot water for bottles as well as diaper changing facilities on board.", "description": "Every traveler has their pet peeves, but crying babies are almost guaranteed to grate.", "authors": [], "top_image": "https://dynaimage.cdn.cnn.com/cnn/w_1200/http%3A%2F%2Fcdn.cnn.com%2Fcnnnext%2Fdam%2Fassets%2F190926094944-02-japan-airlines-file-super-tease.jpg", "published_at": "2019-09-26"}