{"pub": "washingtonpost", "url": "https://washingtonpost.com/opinions/2019/10/04/nickelback-became-famous-despite-being-horrible-just-like-trump/?tid=pm_pop", "downloaded_at": "2019-10-04 16:58:17.751070+00:00", "title": "The Nickelback joke Trump doesn’t get", "language": "en", "text": "The conceit is simple. The “Photograph” music video shows Nickelback frontman Chad Kroeger walking down an empty street, holding a framed image of Kroeger and his producer up to the camera. Trump’s riff on an existing meme replaces that image with a Tucker Carlson “scoop” circulating on right-wing media.\n\nTrump’s display sent the Internet into fits, partly because it seemed to crystallize the complete craziness of the president’s current impeachment-inspired frenzy. This Ukraine scandal is all so serious, and yet at the end of day it’s all so silly: The commander in chief’s tenure is under existential threat, and his response is to send out a dumb clip of Kroeger preparing to ask “what the hell is on Joey’s head?”\n\nAD\n\nAD\n\nDumb or dumber, the meme bears demystifying. It illuminates a basic truth about our president.\n\nPeople in the meme-generating depths of the Web did not make Nickelback memes because they liked Nickelback. They made Nickelback memes because they did not like Nickelback, and because Nickelback was everywhere anyway. The music was barely musical; it was a crummy commodity foisted upon the citizenry by people trying to sell us stuff. The record industry shoved “Photograph” in our face the same way Kroeger thrusts the frame toward his audience, as if commanding us to care.\n\nSo this begat Nickelbacking, a relative of Rickrolling that involves, basically, calling someone on the phone and playing Nickelback. It begat a Facebook page setting up a contest for likes between Nickelback and a pickle. (The pickle won.) It begat the “Photograph” bit, which struck at the emptiness at the song’s center. You could replace that picture with anything at all, because it all meant nothing.\n\nAD\n\nAD\n\nNickelback didn’t exactly become famous for being famous. It became famous for being famous despite being horrible. That makes Trump the Nickelback president. He was elevated to the top of society despite being utterly deplorable, and also because he was utterly deplorable.\n\nBut there’s more to it. The initial transformation of Nickelback from anodyne top-40ers to detested webwide phenom actually spawned an intelligent critique and is an excellent example of what Dale Beran, author of “It Came from Something Awful: How a Toxic Troll Army Accidentally Memed Donald Trump into Office,” argues that memes are all about. Disenchanted netizens spent their time dumpster-diving for societal detritus and mushing it back together to mock the world that created it, or at least to underscore its meaninglessness.\n\nTrump, however, wasn’t sharing Nickelback because he’s a nihilist, or because he’s addicted to irony, or because he gets it at all. He was sharing Nickelback because he doesn’t get it.\n\nAD\n\nAD\n\nThere’s something known to those who grew up online as a “cursed boomer meme.” These memes are cursed because they are, basically, bad: occasionally indecipherable and almost never achieving the effect they intend. They’re boomer memes because they come from that crowd-of-a-certain-age that seems to have stumbled onto the Internet and now keeps bumping into things.\n\nMany of these memes are variations on formats popular among millennials, but warped to the edges of recognition by some soon-to-be grandfather who has recently discovered the wonders of Photoshop: “Orange man is a scary monster,” a sign reads in front of a flannel-clad student at a table, “CHANGE MY DIAPER.” Some are originals, borrowing only the conventions of meme-making — macros with the white “Impact” font, say, or excessive collaging — to build something bafflingly new. Most of all, they’re deadly earnest, which is sort of the opposite of what memes are supposed to be.\n\nIt’s not that the president loves memes, though he does. It’s that he loves these cursed memes in particular. Because as much as Trump is the Nickelback president, or the post-truth president, or the reality TV president, or the 140-character president, he is, above all, the cursed boomer president.\n\nAD\n\nAD\n\nTrump is full of the emptiness in the “Photograph” frame. He is more commodity than man, and his every absurd action makes a mockery of the culture that created him. The problem is, unlike the Web-dwellers who originated so much of the vernacular he has adopted for his own — whether they’re his friends on 4chan, or his foes on Twitter, or a mix of both on Reddit or anywhere else — he doesn’t know there’s anything funny about it.\n\nThe Nickelback meme’s appearance on a Wednesday afternoon dramatized a contortion that is a constant in today’s America. Trump is dangerous, but he’s also ridiculous — a peril and a parody at the same time.\n\nRead more:\n\nMichael Gerson: Trump’s anti-impeachment rhetoric has already gone too far\n\nThe Post’s View: Trump’s tweets distract from the Ukraine matter, but we can’t ignore them\n\nGreg Sargent: Trump has placed himself above the law. His latest eruption confirms it.\n\nJennifer Rubin: When Trump’s not lying, he sounds crazy\n\nDana Milbank: Finally, a president with the guts to stand up to Canada\n\nAD", "description": "And what a meme tells us about the 45th president.", "authors": ["Molly Roberts", "Editorial Writer Covering Technology", "Editorial Writer"], "top_image": "https://www.washingtonpost.com/resizer/GBc2Zc8ugb4lepnv7AQYDw2z3Zo=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/RJHSCNA7ARBPXCMAQDGUQRXKQM", "published_at": "2019-10-04"}