{"pub": "guardian", "url": "https://theguardian.com/world/2019/oct/30/chile-protests-president-sebastian-pinera-protest-unrest", "downloaded_at": "2019-10-30 16:01:54.988476+00:00", "title": "Chilean president cancels Apec and climate summits amid wave of unrest", "language": "en", "text": "Sebastián Piñera confirms he will not hold summits in November and December, as government struggles with massive protests\n\nChile’s embattled president has cancelled the Apec trade summit in November and the Cop 25 climate summit in December, as his government struggles with the largest wave of political unrest since the end of the Pinochet dictatorship.\n\nHow Pinochet's economic model led to the current crisis engulfing Chile Read more\n\nSebastián Piñera made the announcement on Wednesday after 12 days of massive demonstrations and in which millions have taken to the street in protest over economic inequality.\n\n“This has been a very difficult decision, a decision that causes us a lot of pain, because we fully understand the importance of Apec and Cop 25 for Chile and for the world,” Piñera said in a brief statement from La Moneda palace in Santiago.\n\nPiñera’s decision risks further disrupting the faltering international effort to address the climate crisis, with major emitting countries so far failing to enact sufficient measures to avoid dangerous levels of global heating.\n\nThe Chile climate talks were expected to focus on the rapidly deteriorating condition of the world’s oceans, as well as spur momentum going into a fresh round of national pledges on emissions cuts next year.\n\nThe Apec summit was scheduled to bring together 20 world leaders, including Donald Trump and the Chinese president, Xi Jinping, on 16 and 17 November. The Cop 25 programme was due to run between 2 and 13 December.\n\nMore details soon …", "description": "Sebastián Piñera confirms he will not hold summits in November and December, as government struggles with massive protests", "authors": ["Staff", "Agencies In Santiago"], "top_image": "https://i.guim.co.uk/img/media/f3cc1031752d8e154e08cd90203620d83a42107b/0_264_4560_2736/master/4560.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=1ce8fa74a659436a0888c570e8002a69", "published_at": "2019-10-30"}