{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/racing/article-7620273/Forest-Bihan-wins-Aintree-Virgin-Bet-Monets-Garden-Old-Roan-Limited-Handicap-Chase.html", "downloaded_at": "2019-10-28 13:44:18.364001+00:00", "title": "Forest Bihan wins Aintree Virgin Bet Monet's Garden Old Roan Limited Handicap Chase", "language": "en", "text": "Forest Bihan on Sunday dented some major reputations at Aintree to continue the excellent form of trainer Brian Ellison by landing the Virgin Bet Monet's Garden Old Roan Limited Handicap Chase.\n\nThe eight-year-old produced the superior change of gear in the straight, quickening up smartly to leave the well-backed Kalashnikov struggling in his wake, while Ryanair Chase hero Frodon shaped as though the run was needed back in third.\n\nEllison said: 'I'm over the moon with him. Brian gave him a great ride and everything went well.\n\nForest Bihan (front) won the Virgin Bet Monet's Garden Old Roan Limited Handicap Chase\n\n'We ran him at Kelso a few weeks ago (finished third) and he improved loads for that. He hadn't won over two and a half(miles) before, but Brian said the ground was pretty soft today and he seemed to stay well, so he'll definitely get it on good ground.'\n\nMeanwhile, Aidan O'Brien expects to saddle a strong team in Friday's rescheduled Vertem Futurity Trophy at Newcastle.\n\nAsked whether he intends to run the same five horses that he had intended to at the weather-hit Doncaster on Saturday, O'Brien told Racing TV's Luck On Sunday programme: 'That's what we're thinking at the moment.\n\n'I think it'll be fine. Obviously Newcastle is a very good track and if the horsesare well we'll look forward to running them there.'", "description": "Forest Bihan on Sunday dented some major reputations at Aintree to continue the excellent form of trainer Brian Ellison by landing the Virgin Bet Monet's Garden Old Roan Limited Handicap Chase.", "authors": ["Sam Turner For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/28/00/20260852-0-image-a-6_1572221553703.jpg", "published_at": "2019-10-28"}