{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7531803/Bec-Hewitt-debuts-new-hairstyle-rare-family-outing-Lleyton-children.html", "downloaded_at": "2019-10-05 05:47:38.167083+00:00", "title": "Bec Hewitt debuts new hairstyle during rare family outing Lleyton and children", "language": "en", "text": "Bec Hewitt debuted a brand new hairstyle in Melbourne on Tuesday afternoon.\n\nDuring a family day out with husband Lleyton and their three children, the 36-year-old star oozed sophistication with her sleek new brunette do'.\n\nThe former Home and Away star ditched her long blonde locks for the fresh style.\n\nCrossing over the dark side! Bec Hewitt debuted her new brown short hair during a rare family outing with her husband Lleyton and their three children in Melbourne on Tuesday\n\nBig change: Her new do' (left) is a big change for Bec, who has rocked longer blonde locks for years (right)\n\nBec's silky long bob was parted down the middle and straightened for the outing.\n\nThe star dressed casually in skinny blue jeans, a comfortable grey t-shirt and designer black trainers while running errands with her brood.\n\nRetired professional tennis player Lleyton, 38, led the family during their day out.\n\nMother and daughter! After ditching the blonde, Bec's silky long bob was parted down the middle and straightened for the outing. Pictured: Bec with youngest daughter Ava, eight\n\nThe couple were joined by children Mia, 13, Cruz, ten, and little Ava, eight.\n\nDespite being just 13-years-old, Mia is almost reaching the same height as her famous mother now.\n\nLast year, Bec spoke about the close bond she shares with her eldest daughter.\n\nThe former soap actress revealed she was constantly learning from Mia, who she described as being wise 'beyond her years'.\n\nClose bond! Bec, 36, and retired Australian professional tennis player Lleyton, 38, were joined by their three children Mia (left), 13, Cruz (centre), ten, and little Ava (right), eight\n\nGrowing up! Despite being just 13, Mia is almost reaching the same height as her mother now\n\n'I'm a real believer that our kids are here to teach us as much as we teach them,' she wrote on Instagram, marking her daughter's thirteenth birthday.\n\n'I am always learning from Mia! How to be patient, how to be positive and how to be a better person.'\n\nBec concluded: '[Mia] is wise beyond her years! Such a kind, gentle, intelligent, calm yet bubbly person to be around!'\n\n'I am always learning from Mia': Last year, Bec spoke about the close bond she shares with her eldest daughter\n\nBec and Lleyton, who are now back living in Melbourne after several years in the Bahamas, tied the knot in lavish ceremony in July 2005.\n\nAt the time, she was a major TV star but has since turned her back on the spotlight to focus on raising her family.\n\nDespite endless tabloid rumours suggesting their relationship is in 'crisis', it is believed the Hewitts are happily married.", "description": "Bec Hewitt debuted a brand new hairstyle in Melbourne on Tuesday afternoon.", "authors": ["Joshua Fox For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/03/02/19234554-0-image-a-75_1570067532466.jpg", "published_at": "2019-10-03"}