{"pub": "wsj", "url": "https://wsj.com/articles/warren-and-sanders-compete-in-side-primary-in-new-york-11569193200?mod=rsswn", "downloaded_at": "2019-09-22 23:11:13.410490+00:00", "title": "Warren and Sanders Compete in Side Primary in New York", "language": "en", "text": "Sen. Elizabeth Warren ’s rally in Washington Square Park last week was a show of force in her competition with Vermont Sen. Bernie Sanders for the votes of New York progressives, a side contest in the larger Democratic presidential primary.\n\nMs. Warren drew 20,000 people to the Monday night event, where she was introduced by Working Families Party National Director Maurice Mitchell. The progressive party backed Mr. Sanders in 2016, but announced its endorsement of his rival from Massachusetts that day.\n\nSome 20,000 people came to the Monday night event in Washington Square Park.\n\nBut Mr. Sanders still has a core of support, including thousands of volunteers who backed his 2016 campaign. They include the Democratic Socialists of America’s New York branch and the New York Progressive Action Network, both of which are organizing for the senator.\n\n“Until there’s a closing of ranks later on in the primary, they’re just going to have to organize against each other, essentially,” said New York state Sen. Julia Salazar, a Democrat and DSA member from Brooklyn.\n\nShe prefers Mr. Sanders to Ms. Warren because of Mr. Sanders’s housing platform, and because she saw him as more committed to upend capitalist power structures than Ms. Warren. She said the WFP has previously based endorsements on a political calculus rather than ideology, and was puzzled by its decision. Some progressives were much harsher on Twitter .\n\nThere are clearly still supporters of Mr. Sanders in the party: WFP leaders said Ms. Warren won roughly 61% of its weighted vote, and 80% listed Ms. Warren and Mr. Sanders as their top picks. A Siena College Research Institute poll last week showed Ms. Warren slightly ahead of Mr. Sanders among New York Democrats surveyed.\n\nNew York Senate Majority Leader Andrea Stewart-Cousins spoke at the annual Business Council of New York State meeting. Photo: Patrick Renzi/The Business Council\n\nMr. Mitchell, in his speech, said Ms. Warren won after an inclusive process that involved members and state chapters. “Elizabeth Warren has proposed a host of solutions that meet the full scale of the crises we face,” he said.\n\nThe split has also ensnared New York’s elected officials, many of whom are still sitting on the fence. While Ms. Warren’s campaign announced nine additional endorsements last week, there were other politicians like New York City Public Advocate Jumaane Williams who attended her speech but weren’t ready to commit.\n\nSHARE YOUR THOUGHTS Who do you think would be a stronger Democratic nominee, Elizabeth Warren or Bernie Sanders? Join the conversation below.\n\nMr. Williams, a former delegate for Mr. Sanders who won his office with WFP backing in a crowded special election, said the WFP endorsement of Ms. Warren was “huge” because the party intersected with most of the state’s progressive organizations.\n\n“I actually think it’s a good problem to have. The last time we only had one person who was championing these ideas,” he said in an interview. “There should be a very strong debate, as long as we agree that we’re going to come together at the end.”\n\nBUSINESS OUTREACH: State Senate Majority Leader Andrea Stewart-Cousins made her first trip to the Business Council of New York state’s annual meeting last week bearing a message of outreach.\n\nThe group, which represents employers around the state, has traditionally backed Republicans. Its leaders long warned that if the GOP lost control of the state Senate, an all-Democrat government would advance policies they had long resisted.\n\n“I get it,” Ms. Stewart-Cousins, of Yonkers, said at an opening reception. “But I hope that you get that we’re not against business. We understand that our viability, our status as New York depends on your success.”\n\nShe mentioned legislative action that made permanent the state’s 2% cap on property tax increases, a major Business Council priority that had previously been championed by Senate Republicans. No GOP senators attended this year’s conference, held at an island resort in Lake George, N.Y.\n\nDemocrats this year passed bills strengthening tenant protections, making it easier to bring sexual-harassment claims against businesses and granting labor protections to farmworkers. And Amazon.com Inc. scrapped plans for a headquarters campus in Queens in part because of opposition from Ms. Stewart-Cousins’ deputy, Sen. Mike Gianaris. An aide to Democratic Gov. Andrew Cuomo, who has been endorsed by the group, brought this up at the conference on Thursday as he laid out the governor’s priorities.\n\nBut the business council’s president, Heather Briccetti, said Ms. Stewart-Cousins’ speech resonated, and the senator received a standing ovation.\n\n“I am excited, frankly, about engaging you in ways you never would have believed you would be able to engage with Democrats,” Ms. Stewart-Cousins said. “And I’m going to give you an opportunity to get used to it.”\n\nTHE QUESTION: Which New York town doubled in population on Sunday?\n\n— Know the answer? Leave a comment!\n\nTHE LAST ANSWER: New York last held its presidential and legislative primaries on the same day in 1972, when South Dakota Sen. George McGovern bested his rivals before winning the Democratic Party nomination. (He lost to Richard Nixon. )\n\nNew York last concluded its legislative session before Memorial Day in 1970, when lawmakers adjourned on April 20, according to the Red Book, an almanac of New York political information.\n\nWrite to Jimmy Vielkind at Jimmy.Vielkind@wsj.com", "description": "Elizabeth Warren’s rally in Washington Square Park last week was a show of force in her competition with Bernie Sanders for the votes of New York progressives, a side contest in the larger Democratic presidential primary.", "authors": ["Jimmy Vielkind", "Jimmy.Vielkind Wsj.Com"], "top_image": "https://images.wsj.net/im-109294/social", "published_at": "2019-09-22"}