{"pub": "businessinsider", "url": "https://businessinsider.com/e-scooter-riders-where-to-ride-what-rules-to-follow-2019-9", "downloaded_at": "2019-09-26 16:45:28.586963+00:00", "title": "E-scooter riders are confused about where to ride and what regulations to follow", "language": "en", "text": "Following is a transcript of the video.\n\nIt seems like e-scooters have been popping up everywhere in the last few years. Companies like Bird, Lime, and Ojo have placed their e-scooters in over 100 cities and towns around the world. And they're even more popular in the US than bike-sharing programs, according to the National Association of City Transportation Officials. But, while those bike-sharing programs seem to have it all figured out, dock-less e-scooters have hit some speed bumps along the way.\n\nThe e-scooter premise is simple. You use an app to find and unlock a scooter near you, ride it where you need to go, and then leave it there for the next person. The company takes care of charging the battery and making sure the scooters are where they need to be. Pricing varies, but generally there is an initial unlocking fee along with a per-minute fee. Some other additional fees are possible, like if you venture outside the scooter's \"home zone.\" The scooters are designed to tackle transportation and congestion issues in towns and cities.\n\nSure, the scooters are a form of shared mobility and are convenient and affordable, but that doesn't mean they're perfect. Pedestrians, cars, bikes, pretty much everyone is trying to adapt to sharing the roads and sidewalks, while riders are confused about where to use them and what regulations to follow. Sidewalk, bike lane, or road? With traffic or against it? And then there's the question of parking. Without designated docking stations for e-scooters, they can end up in a pile, obstructing sidewalks and crosswalks. It's not so much the scooters themselves that are to blame, but the people behind the handlebars who choose to ignore the rules.\n\nThese aren't problems that can be easily ignored. And parking issues aren't the biggest concern when it comes to e-scooters.\n\nTarak Trivedi: There are definite dangers, including death. I mean, we've seen a number of deaths already since they've been introduced.\n\nThat's UCLA Health emergency physician Tarak Trivedi. After seeing so many patients with scooter-related injuries, he decided to study them and publish the results.\n\nTrivedi: So, anecdotally, some of the stories that I've heard are: I fell off. I don't know how. The break didn't work appropriately. The accelerator got stuck. There was a pothole in the road that I missed. I was riding, and the sidewalk was a little bit uneven, and I sort of just tipped over. Hit by cars, of course, intoxication and not paying attention.\n\nThe Associated Press reported there were 11 deaths linked to e-scooters from the start of 2018 through June of 2019. But that's a rough estimate, since there's no official data available. And that's not including the 1,500 injuries also reported in that same time period.\n\nTrivedi: Overall, we found 249 emergency-department visits that were associated with an electric-scooter use of some sort. Some other results that we found interesting were that almost no one was wearing a helmet. Approximately 30% of our injured patients actually had some sort of fracture, and 40% of them had some sort of head injury. Those stats are kind of alarming. They should make helmets a requirement, right? There's a lot of arguments inside of required, mandatory-helmet laws. On one hand, we know that helmets protect the skull and brain. However, some cyclists and cyclist-advocacy organizations argue against mandatory-helmet laws, saying that it makes people less likely to use bicycles in general.\n\nAnd the same applies to e-scooters. Which means local governments have to do all they can to keep riders safe. And in some cities, that means no e-scooters at all. New York City, for example, has yet to install an e-scooter program because of safety and infrastructure concerns. But just across the Hudson River, in the 1-square-mile city of Hoboken, New Jersey, e-scooters are everywhere. Hoboken has pilot e-scooter programs with both Lime and Ojo in hopes of addressing their lack of street space and parking demands.\n\nRyan Sharp: The benefit of doing a pilot program for six months is that it gives the city an opportunity to test out the model of e-scooter sharing. To put out surveys to the public, to get their feedback, and to collect data to see how popular or how much ridership is happening through this program.\n\nPilot programs help these cities learn what works, what doesn't, and where they can make improvements, like setting safety standards and better educating scooter riders.\n\nSharp: Some of the major rules that everybody has to follow includes no riding on sidewalks, you must ride in the direction of traffic. There's an age requirement, you must be 18 years or older to ride. Only one rider per scooter, so no tandem riding.\n\nRules are posted on the scooters on signs around the city and reinforced in the app itself. It's in the scooter company's best interest to comply with all the local laws. As the vehicles become more widespread, cities like Washington, DC, and Atlanta are imposing strict restrictions on their usage or banning them completely. Some of these policies may be the result of rider misuse, like breaking local laws and leaving scooters in all the wrong places.\n\nBut at least they're better for the environment, right? Not quite. In fact, compared to other transport options, e-scooters are not as green and eco-friendly as you might think. A study published in the journal Environmental Research Letters found that a lot of greenhouse gasses are created when manufacturing and transporting the scooters. In fact, scooters typically emit more greenhouse gasses than buses with high ridership and electric bikes. But it doesn't look like they're going to go away anytime soon. They're convenient, easy, and, we have to admit, fun.\n\nSo how do you keep everyone safe and not infuriate local residents with sky-high piles of scooters? It's a shared responsibility between the riders, pedestrians, companies, and local governments. Towns and cities need to make sure they designate where scooters should be ridden and keep them safe for everyone.\n\nIn Hoboken, local police are enforcing scooter rules through citations and suspending or even terminating accounts. Meanwhile, companies need to make sure that they are enforcing the rules and that the scooters are not disruptive to local residents. As for the riders, they need to understand and acknowledge they are operating a moving vehicle. Trivedi: A number of people also came in intoxicated. About 10% of our riders were actually under the legal age; they were under 18 years of age.\n\nIt's clear changes need to be made to make e-scooters safer and less disruptive. We don't really think about it now, but before 1915, stop signs for cars didn't exist, and the US had no uniform approach to street safety until the mid-1920s. Hopefully, it won't take that long to solve the issues e-scooters present. And if you're riding one, consider wearing a helmet. Follow all the local rules, and maybe stick to areas without many pedestrians or cars. Don't leave it in the middle of the sidewalk. And don't forget to enjoy the ride. It, like, doesn't, whoa!", "description": "Companies like Bird, Lime, and Ojo have placed e-scooters in over 100 cities and towns around the world. But they also pose concerns for rider safety.", "authors": ["Alexandra Appolonia"], "top_image": "https://amp.businessinsider.com/images/5d84fc7d2e22af0ebf169db5-1920-960.jpg", "published_at": "2019-09-26"}