{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/18/don-lemon-pulls-no-punches-with-dems-on-lewandowsk", "downloaded_at": "2019-09-18 23:26:35.602710+00:00", "title": "Don Lemon pulls no punches with Dems on Lewandowski testimony: 'This was bad'", "language": "en", "text": "CNN’s Don Lemon pulled no punches Tuesday evening with Rep. Jamie Raskin while discussing House Judiciary Democrats’ “impeachment hearing.”\n\nThe “CNN Tonight” host told the Maryland Democrat that his colleagues are “too close to the forest” and can’t see that Corey Lewandowski, President Trump’s former campaign manager, made them look ridiculous.\n\n“They make you look bad, they make Democrats, or maybe Democrats are making themselves look bad. It was bad. You guys had — this was bad,” Mr. Trump said. “This was bad.”\n\nMr. Lewandowski’s testimony was laced with jokes — he called California Rep. Eric Swalwell “President Swalwell” in reference to his failed presidential campaign — and punctuated with defenses of Mr. Trump.\n\n“The president didn’t ask me to do anything illegal,” Mr. Lewandowski said at one point.\n\nMr. Lemon told his guest, a member of the committee, that Democrats who defend the hearing’s execution are essentially wearing blinders.\n\n“You don’t see it,” the CNN host said. “Just as an observer, you’re getting played big time,” Lemon replied. “When you’re getting played, you got to readjust, right? If you’re going to be a player, you got to play, right?”\n\nMr. Raskin insisted that cross-examination by consultant attorney Barry Berke was “devastating” for Lewandowski.\n\n“We are the party of the Constitution and the rule of law now,” he added. “We are trying to stand by the rules and be fair and [Republicans] are the chaos party.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "CNN's Don Lemon pulled no punches Tuesday evening with Rep. Jamie Raskin while discussing House Judiciary Democrats' \"impeachment hearing.\"", "authors": ["The Washington Times Http", "Douglas"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/18/Don_Lemon__091819_c31-0-842-473_s1770x1032.jpg?d7e4b6d9e305ff8cc5f99d76545dee97a6b79280", "published_at": "2019-09-18"}