{"pub": "washingtonpost", "url": "https://washingtonpost.com/nation/2019/10/12/sheriff-hopeful-admitted-an-ad-that-he-wore-blackface-hes-not-apologizing", "downloaded_at": "2019-10-12 15:12:44.346151+00:00", "title": "A sheriff hopeful admitted in an ad that he wore blackface. He’s not apologizing.", "language": "en", "text": "A South Carolina sheriff candidate is fessing up to something that has tarnished many politicians: sporting blackface.\n\nCraig Stivender, 36, released a campaign ad Tuesday in which he outlines the importance of transparency.\n\n“I want to tell you some things that politicians would try to hide, things that my opponents may try to use to tarnish my integrity,” the Republican candidate said in an television ad that began with aerial shots of the Palmetto State’s waters and woods and with slow-motion shots of Stivender shooting a gun and hugging people.\n\nThe South Carolina native whose family has been in Colleton County for more than 200 years provided more detail about what he meant by that statement.\n\nSitting in a rocking chair and looking directly in the camera, Stivender revealed that he received a ticket as a 16-year-old for not having a driver’s license and that he is married for the second time. He also said he’s lost his temper at work as a police officer and that he was reprimanded for his actions. He even admits to being responsible for some fender benders.\n\nBut the most shocking disclosure was his admission that he wore blackface 10 years ago at a law enforcement Halloween party. The video included an image of Stivender with darkened skin in a turquoise shirt, with studs in his ear and a gold chain around his neck. He was standing next to a black woman.\n\nStivender said he dressed as Demetrius Edward “Big Meech” Flenory, one of the leaders of the Detroit-based Black Mafia Family who was sentenced to 30 years in prison for drug trafficking and money laundering.\n\n“If I’m a police officer, the exact opposite would be a gang member,” Stivender said. “So that’s what I picked.”\n\nPoliticians on the left and right of the political spectrum have had to make public apologies for past acts of blackface, a historically racist form of theater in which a nonblack person paints themselves dark as a means to ridicule and mock black people.\n\nEarlier in the year, Democratic Virginia Gov. Ralph Northam’s old medical school yearbook surfaced, showing on Northam’s yearbook page a person in blackface next to another person dressed as a Ku Klux Klan member. He initially took blame and then later said he wasn’t in the photo. Northam, who was elected with great help from black voter turnout, met with black leaders and vowed to complete the rest of his term focused on racial equity.\n\nIn August, Alabama Gov. Kay Ivey, a Republican, apologized to her state for a blackface skit she participated in 52 years ago. She has since faced calls for her resignation but has stayed in office.\n\nAcross the northern border, Canadian Prime Minister Justin Trudeau apologized for multiple images that surfaced last month of him in blackface and brownface. He has admitted that he didn’t know any better at the time the incidents occurred and has moved his talking points to other issues as he faces a reelection campaign.\n\nStivender said he understands the disappointment of those “who may be upset” but argued that honesty was most important to his nascent campaign.\n\n“That was a different time,” he said. “Today we understand that type of costume is troubling to many.”\n\nHe told ABC News 4 — based in Mount Pleasant, S.C. — that he didn’t know what blackface was 10 years ago and that it wasn’t his intention to offend anyone. He didn’t apologize for his action when reporter Kate Mosso asked if he would.\n\nStivender’s campaign said in an email that it stands behind previous statements and that the campaign has received mostly positive attention from the local community.\n\nThat attention, according to conservative and liberal political strategists, could be a toss-up with voters.\n\nMatt Moore, the state’s former GOP chairman and a partner at political consulting firm First Tuesday Strategies in Columbia, S.C., called Stivender’s ad a “train wreck” and said Stivender’s claim that he didn’t mean to offend and didn’t know about blackface 10 years ago is a “joke.”\n\nMoore noted that had an opponent uncovered Stivender’s past, it probably would have been a one-day story, instead of being the central issue of his campaign.\n\nMoore said the low-country region of South Carolina has a distorted history surrounding race, and Colleton County needs a sheriff who can build bridges and move the community forward.\n\nBut it’s important to understand the context of Colleton County before completely judging the sheriff’s ignorance, said longtime political consultant Wesley Donehue of South Carolina-based Push Digital. His firm counts Sen. Marco Rubio (R-Fla.) and the National Republican Senatorial Committee among its clients.\n\nDonehue spent part of his childhood in the county. He has never met Stivender, but he did say the sheriff hopeful’s description about the past decade is correct, pointing to the fun that was made of interracial couples in the area and his own grandfather being buried in a Confederate uniform not long ago.\n\n“Colleton is really stuck a decade or two behind everybody else,” he said about the county of nearly 38,000. “The beauty of the Internet is it breaks down the barrier and people in those areas are starting to wise up.”\n\nStill, Donehue believes the county’s black population is owed a personal apology.\n\n“He’s running for a top law enforcement position. He has a moral obligation, especially to the minority community, to explain why he did this,” Donehue said, pointing to strained relations between law enforcement and communities of color.\n\nThe county, which once was home to many cotton plantations, is about 60 percent white and 37 percent black, according to census data. Its Latino population is a little over 3 percent. Most of Colleton County voters cast their ballots for President Trump in 2016; he took nearly 53 percent of its votes.\n\nThree Democrats, one of whom is black, and another Republican are also running for Colleton County sheriff.\n\nMoore said the best action for Stivender to take would be to drop out because the state doesn’t need anymore embarrassing sheriffs.\n\nAt least 11 of South Carolina’s sheriffs in its 46 counties have been accused of breaking laws, according to the Post and Courier.\n\n“If he really didn’t know [about blackface], do voters really want someone who is incapable of Googling to find out,” Moore asked.\n\nRead more:\n\nAlabama’s Republican governor apologizes for wearing blackface in college, refuses to resign\n\nA Belgian festival has long featured a ‘savage’ in blackface. Is it time for the U.N. to stop honoring it?\n\nVirginia Republicans thought calling Ralph Northam ‘Gov. Blackface’ would help them. That’s changed.", "description": "Colleton County sheriff hopeful Craig Stivender has an interesting campaign strategy: admit to sporting blackface before anyone else outs him. Political strategists weigh in about whether this will be an effective strategy.", "authors": ["Lateshia Beachum", "October At Am", "Lateshia Beachum Is A General Assignment Reporter For The Washington Post. She Previously Worked For The Center For Public Integrity."], "top_image": "https://www.washingtonpost.com/resizer/3VAXKm7IEQyExM3GfQaqcKOwzwQ=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/25IQAT2HGZHZDNG7TC6IQMAOVM.png", "published_at": "2019-10-12"}