{"pub": "indiatimes", "url": "https://timesofindia.indiatimes.com/blogs/generals-jottings/syria-shows-us-global-war-on-terror-is-a-myth", "downloaded_at": "2019-10-21 02:23:24.640194+00:00", "title": "Syria shows us global war on terror is a myth", "language": "en", "text": "On October 6, the White House released a statement informing that “Turkey will soon be moving forward with its long-planned operation into northern Syria. The United States Armed Forces will not support or be involved in the operation, and United States forces, having defeated the ISIS territorial “Caliphate,” will no longer be in the immediate area.” It further went on to say, “Turkey will now be responsible for all ISIS fighters in the area captured over the last two years in the wake of the defeat of the territorial “Caliphate” by the United States.”\n\nTurkey immediately launched an offensive into northern Syria, but their objective was not the securing of ISIS fighters held prisoner, but the Kurdish-led Syrian Democratic Force (SDF). As Turkish forces, backed by artillery and airstrikes, advanced into Syria, there were reports of hundreds of ISIS fighters fleeing from their detention camps. The situation in Syria is a stark reminder of why the so-called global war on terror has been more about national interests and less about fighting terrorism.\n\nAs civil war erupted in Syria in 2011, multiple groups of rebels emerged. In the initial years of the war, the most successful group was the al-Qaeda linked al-Nusra Front, which, in December 2012, had been designated by the United States as a foreign terrorist organisation. However, this did not stop the American government from supplying weapons to al-Nusra, in their attempt to oust Bashar al-Assad from power.\n\nIn an article published in Global Research on October 2, 2016, Abu Al Ezz, a unit commander of al-Nusra, was quoted as saying, “Yes, the US supports the opposition [in Syria], but not directly. They support the countries that support us… when Jabhat Al-Nusra was besieged, we had officers from Turkey, Qatar, Saudi Arabia, Israel and America here… Experts in the use of satellites, rockets, reconnaissance and thermal security cameras.”\n\nIn June 2014, ISIS fighters captured the town of Mosul and proclaimed a ‘caliphate’, which at its peak, controlled approximately 100,000 square km of area cutting across Syria and Iraq. To fight the ISIS in northern Syria, the Kurdish People’s Protection Unit, or YPG, took a lead role in forming the SDF in 2015. The SDF was America’s staunchest ally in its fight against the ISIS and had a significant role in driving the ISIS out of its major strongholds, including Raqqa, the Syrian capital of the Islamic State. Kurdish fighters also led the assault on Baghouz, the capture of which in 2019 marked the end of ISIS territorial rule.\n\nTurkey had always been opposed to the US arming of Kurdish rebels that had ties to the Kurdistan Workers’ Party (PKK), which had been waging an insurgency in Turkey. Trump’s pullout from Syria provided the opportunity for President Erdogan to unleash his military against the SDF. After losing 11,000 fighters in the battle against ISIS, the SDF today stands completely isolated. In the powerplay currently underway in Syria, there is minimal concern among the involved parties that this could provide an opportunity for a revival of the ISIS.\n\nA similar situation is being witnessed in Yemen. The Saudi-backed coalition’s fight against the Houthis is largely an extension of the proxy conflict between Iran and Saudi Arabia for influence in the region. In this situation, the al-Qaeda has positioned itself as a part of the larger “Sunni” front and managed to obtain weapons and money from both UAE and Saudi Arabia. In January 2019, a CNN investigation had revealed that “Saudi Arabia and its coalition partners have transferred American-made weapons to al Qaeda-linked fighters, hardline Salafi militias, and other factions waging war in Yemen, in violation of their agreements with the United States.”\n\nIn an address at the United Nations in July 2018, Rina Mitra (special secretary, internal security) had rued the lack of international collaboration in fighting terrorism. This is an unfortunate reality and is unlikely to change because geopolitics will always trump the lip-service paid to tackling the menace of terrorism. India will have to fight its own battles against the terror emanating from Pakistan.", "description": "On October 6, the White House released a statement informing that “Turkey will soon be moving forward with its long-planned operation into northern Syria. The United States Armed Forces will not support or be involved...", "authors": ["Lt Gen Ds Hooda"], "top_image": "https://timesofindia.indiatimes.com/blogs/wp-content/uploads/2019/05/Photograph_of_Lt_Gen_DS_Hooda-1.jpg", "published_at": "2019-10-21"}