{"pub": "dailymail", "url": "https://dailymail.co.uk/wires/afp/article-7550687/Mozambique-says-army-killed-9-jihadists-restive-north.html", "downloaded_at": "2019-10-08 15:03:09.973831+00:00", "title": "Mozambique says army killed 9 jihadists in restive north", "language": "en", "text": "The jihadists have burnt homes and killed more than 300 people\n\nMozambican soldiers killed nine \"evildoers\" in the volatile north ahead of general elections next week, the government has said, in the first ever official confirmation of an attack on jihadists.\n\nSuspected Islamists have conducted a slew of attacks on remote villages in Mozambique's gas-rich, Muslim-majority Cabo Delgado province since October 2017.\n\nMore than 300 people have been killed and sometimes beheaded, prompting President Filipe Nyusi to promise a crackdown on the assailants.\n\nSecurity forces have been patrolling the region since the start of the attacks.\n\n\"Security forces (engaged in)... a fight against evildoers that resulted in the slaughter of nine of them,\" on Saturday, the defence ministry said in a statement.\n\nSources at the scene told AFP army troops descended at night on a jihadist base in the forests around the village of Mitope, around 400 kilometres (248 miles) from the provincial capital Pemba.\n\n\"It is presumed to be the largest base of insurgent operations in the region,\" said a local source.\n\n\"We thought it was an insurgent attack on the district but saw that it was something different because there was a helicopter hovering,\" said another resident.\n\nA local official told AFP a Russian national, \"who was part of the government troop contingent\", was also killed during the attack.\n\nBut Russia denied any military presence on the ground.\n\n\"As far as Mozambique is concerned, there are no Russian soldiers there,\" Kremlin spokesman Dmitri Peskov told reporters on Tuesday.\n\nNyusi visited Russia in August and signed energy and security agreements with his counterpart Vladimir Putin -- who has been looking to expand his influence in Africa.\n\nThe identity of the militants remains unclear and their motives unknown.\n\nWhile the Islamic State has claimed responsibility for some of the attacks, analysts have expressed doubt over the claim.\n\nSome have attributed the violence to a group known in Arabic as Ahlu Sunnah Wa-Jama -- although it is usually referred to as \"Al-Shabaab\" despite having no known link to the Somali jihadist group of the same name.\n\nMozambicans head to the polls on October 15.\n\nNyusi's Frelimo party has dominated power for more than four decades and he is widely expected to secure a second term.", "description": "Mozambican soldiers killed nine", "authors": [], "top_image": "https://i.dailymail.co.uk/1s/2019/10/08/15/wire-19447064-1570545463-68_636x382.jpg", "published_at": "2019-10-08"}