{"pub": "guardian", "url": "https://theguardian.com/lifeandstyle/2019/oct/27/fancy-dress-is-great-role-play-as-long-as-you-are-under-10-halloween-eva-wiseman", "downloaded_at": "2019-10-27 11:57:28.279308+00:00", "title": "Fancy dress is great role play – as long as you’re under 10 | Eva Wiseman", "language": "en", "text": "Every year Halloween bursts through the slats of Britain’s door and insists it’s a thing. “I am a thing!” it whines. “Ask America!” Out of politeness, perhaps, we invite it in, with its cantilevered cleavage and bleeding eyes, and we compliment its meaty perfume and listen to its suggestions on how to construct a sexy Amazon warehouse worker costume using only objects that can be delivered next-day on Prime. Though Halloween has a lot to answer for, it would be unfair to rest all blame for the rise of fancy dress on its shoulders – the rise, and fall, and zombie-stripper-like rise. Fancy dress refuses to die.\n\nWhich is odd because, of course, it should have faded away many times, swept into the bin of the British past like Gentleman’s Relish or coatigans, most memorably after, haha, the pictures of Prince Harry as a Nazi. In 2005, he wore a German desert uniform and a swastika armband to a friend’s birthday party in Wiltshire, which had the fancy dress theme “colonial and native”. Imagine even writing the words on your Paperless Post. Dragging your fingers from key to key as a voice inside you screamed: “BUT ARE YOU SURE?”\n\nSince then adults have screwed up fancy dress so many times, and with such comic ignorance, that recent revelations – that Justin Trudeau wore blackface not once, or twice, but three times, revealing it to be his signature look; and that Atlantic Records boss Ben Cook (who is white) resigned after being reprimanded for attending a “musical icons” party as a member of Run-DMC – are surely mere drops in the fancy dress ocean. Right now, a boy from Eton is humming as he lays out his Grenfell costume on the bed, and a woman in Bray is perfecting her hair before she debuts her Sexy Anne Frank.\n\nWhen else do you get to have sex in your mother's wedding dress?\n\nShow me an adult’s costume party and I will show you a room of rich people in trouble. Out of 30, at least one will expose their extreme politics through an ill-advised accessory, at least five will be wearing 3D versions of the masks they’ve been hiding behind for the last 20 years, thus revealing the flimsiness of their identity – and the rest will be merrily performing a sexuality they formed in front of Eurotrash one Friday night in 1994. One man will be extremely scary, misunderstanding the boundaries between fun and psychopathy. One woman will be extremely naked, misunderstanding the boundaries between knickers and arse. And so gender will be defined in this town for another year. The party themes are telling, their casual “isms”, whether race or sex, revealing more about the party-thrower than any music playlist. Sexualised animals will roam the live-work space with a raspberry beer, free of the true sex characteristics of their species, such as barbed penises or the inclination to eat their lover’s head after mating.\n\nBut I get it. Largely. I’ve put the time in, from a distance. Made in Chelsea, my primary anthropological source for the evolution of fancy dress, rotated around a series of extravagant costume parties designed to provide a theatre for the themed drama within. You get a whole new understanding of class when a drink’s thrown over someone dressed as a swan, and when else do you get to have sex in your mother’s wedding dress?\n\nThough I came of age in the time of ironic 70s disco nights, I was never tempted, perhaps because my daily outfits were often mistaken for fancy dress. Returning to London after college, I met people who’d graduated from university with honours in cultural appropriation through the application of bindis. Their legendary themed parties dripped over whole weekends into their 20s, into fields, and nightclubs and someone’s mum’s house, where wealthy blonde law graduates and trainee doctors would gather for another opportunity to get off with a stranger covered in blood.\n\nAt Halloween they unsheath their costumes again, either squeezing into the glittery memories of their past or designing a cutting piece of topical cultural commentary assembled off the internet. This year, expect to see Inspector WAG, Naughty Activist, Greased Piglet, Brexit Bad Boy, The Death of Print Media, Plastic Wasteman, and The Only Person That Came To Work In Costume. And, on the one hand, let them have their fun. On the other, for Christ’s sake, you know? It’s like five pints or a pill – if the only way you can work up the courage to dance or flirt or truly express your feelings on the future is by dressing up as a Love Island casualty then, love, I urge you to talk to someone.\n\nGiven the opportunity I would ban fancy dress for the over-10s. Standing in line waiting for my kid to have her face painted this weekend, the requests ahead of us bounced gloriously from “magic unicorn with talking powers” to “Elsa skeleton”. The subtext for kids’ costumes is political in a way that adults will never understand, but there is no expectation that a fancy hat will release them from the heavy anchor of humanity. They just want to be a pirate for a bit.\n\nEmail Eva at e.wiseman@observer.co.uk or follow her on Twitter@EvaWiseman", "description": "This Halloween expect to see Naughty Activist, Brexit Bad Boy – and zombie strippers that, just like fancy dress, refuse to die", "authors": ["Eva Wiseman"], "top_image": "https://i.guim.co.uk/img/media/34a782187602313989bef73bbd5120d646cda5ea/19_180_3790_2275/master/3790.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tb3BpbmlvbnMucG5n&enable=upscale&s=0c42a92dbadf982397ed454a37377ff2", "published_at": "2019-10-27"}