{"pub": "fox", "url": "https://foxbusiness.com/sports/everlast-first-ever-pro-transgender-boxer-new-ad-campaign", "downloaded_at": "2019-10-01 11:44:17.846245+00:00", "title": "Everlast features first-ever professional transgender boxer in new ad campaign", "language": "en", "text": "Patricio Manuel, the first-ever professional transgender boxer, signed a deal with Everlast to be a part of an ad campaign featuring the sport’s “new crop of trailblazers.”\n\nContinue Reading Below\n\nEverlast, one of the top boxing gear companies, featured Manuel in a four-minute YouTube video. In it, Manuel discusses the difficult decision on whether to continue fighting professionally as a female or transition to male.\n\n“A lot of people in boxing who I talked to, they would come to me and say, ‘You could have been one of the greatest female world champions, though you would throw it all away to be yourself.’ And I’d tell them, that’s how bad I felt living that lie,” Manuel said.\n\nManuel added: “If it meant that much to me to risk the love of my life, boxing, then they knew that it was something that was valid. No one just throws away a possible chance at going to the Olympics or becoming a world champion because this is something they’re half-in about.”\n\nManuel became the first transgender boxer to compete at the professional level in December. Manuel won the fight against Hugo Aguilar but has not competed since.\n\nCLICK TO READ MORE ON FOX BUSINESS\n\nThe Everlast campaign also features an amputee fighter and an immigrant family of amateur boxers, according to People.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nBoxing legends Jack Dempsey and Sugar Ray Robinson had previously been featured in Everlast campaigns.", "description": "The first-ever professional transgender boxer is part of a famous brand's ad campaign.", "authors": ["Ryan Gaydos"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/10/0/0/Patricio-Manuel-EVERLAST.jpg?ve=1&tl=1", "published_at": "2019-10-01"}