{"pub": "investingcom", "url": "https://investing.com/news/stock-market-news/futures-down-after-saudi-attacks-spark-rush-for-safety-1978629", "downloaded_at": "2019-09-16 13:08:36.139681+00:00", "title": "Futures down after Saudi attacks spark rush for safety", "language": "en", "text": "By Medha Singh\n\n(Reuters) - U.S. stock index futures slipped on Monday after the weekend attack on Saudi Arabian oil facilities knocked out 5% of the world's supply, sparking concerns over global economic growth and heightening tensions in the Middle East.\n\nOil prices soared as much as 20% after the attack on the world's biggest oil exporter, before easing off their peaks as U.S. President Donald Trump authorized the use of the country's emergency oil stockpile to ensure stable supplies.\n\nShares of energy companies soared, with the S&P 500-listed Devon Energy Corp (N: ), Marathon Oil Corp (O: ), Concho Resources Inc (N: ) and Apache Corp (N: ) up between 8.3% and 10.7%. Oil majors Exxon Mobil Corp (N: ) and Chevron Corp (N: ) advanced more than 3%.\n\nIn contrast, shares of airlines and cruise-liners dropped in anticipation of higher fuel costs. American Airlines Group Inc (O: ), Delta Air Lines Inc (N: ) and Carnival Corp (N: ) fell about 3%.\n\nAdding to the downbeat mood, data from China showed growth in industrial production in the world's second-largest economy was at its weakest 17-1/2 years in August.\n\nInvestors' flight to safety lifted prices of gold, Japanese yen and sent the U.S. benchmark 10-year Treasury bond yields ( ) down sharply from their multi-week highs.\n\nInterest-rate sensitive bank such as Bank of America Corp (N: ), Citigroup Inc (N: ), JPMorgan Chase & Co (N: ), Goldman Sachs (N: ) and Morgan Stanley (N: ) were down between 1.2% and 2%.\n\nThis week's centerpiece is the Federal Reserve's monetary policy decision on Wednesday where traders see a near 80% chance of a quarter-point interest rate cut, the second reduction in rates this year.\n\nHints on whether the central bank will keep easing its monetary policy will be crucial in determining how far Wall Street's strong rally will last.\n\nCooling trade tensions between the United States and China last week has brought the benchmark S&P 500 ( ) less than 1% below its record high.\n\nAt 7:04 a.m. ET, were down 113 points, or 0.42%. S&P 500 e-minis were down 12.5 points, or 0.42% and were down 50 points, or 0.63%.\n\nAmong other movers, General Motors Co (N: ) fell 2.9% after the United Auto Workers (UAW) went on strike just after midnight Sunday and about 48,000 hourly workers at its facilities are headed for the picket lines in the morning.", "description": "Futures down after Saudi attacks spark rush for safety", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/trkd-images/LYNXMPEF8F0RZ_L.jpg", "published_at": "2019-09-16"}