{"pub": "cnbc", "url": "https://cnbc.com/2019/09/25/juul-ceo-kevin-burns-to-step-down-replaced-by-former-altria-exec-kc-crosthwaite.html", "downloaded_at": "2019-09-25 13:39:13.607181+00:00", "title": "Juul CEO Kevin Burns to step down, replaced by former Altria exec K.C. Crosthwaite", "language": "en", "text": "Kevin Burns has resigned as Juul's CEO and will be replaced by former Altria executive K.C. Crosthwaite, the embattled e-cigarette company announced Wednesday.\n\nAltria invested $12.8 billion for a 35% stake in Juul late last year, placing a huge bet on the vaping company. Tobacco giant Altria's shares are down nearly 18% this year.\n\nCrosthwaite will continue \"a broad review of the company's practices and policies to ensure alignment with its aim of responsible leadership within the industry,\" Juul said in a press release.\n\nThe company also announced it will suspend all broadcast, print and digital product advertising in the U.S. It will not lobby the Trump administration on its impending policy to remove flavored e-cigarettes from the market and will comply with the final policy when effective.\n\nBurns joined Juul in December 2017 while it was growing rapidly and becoming the best-selling e-cigarette brand in the U.S. Parents and teachers were warning that Juul's devices were incredibly popular among teenagers.\n\nFederal survey data in 2018 showed an enormous spike in teen vaping, prompting the Food and Drug Administration to demand that Juul and other companies fix what the agency called an \"epidemic.\" Juul said it would stop selling fruity flavors in stores and shutter its social media accounts.\n\nThose efforts did not appear to stem teens' appetites for e-cigarettes. A new federal survey showed another increase in teen vaping, with more than a quarter of high school students using e-cigarettes. An outbreak of a mysterious lung disease has thrown the industry — and Juul — into the spotlight.\n\nCrosthwaite was Altria's chief growth officer, where he oversaw the company's expansion into heated tobacco products. He was involved in Altria's work in submitting its main product, iQOS, for FDA review and successfully getting it cleared for sale in the U.S. Juul and all e-cigarette makers will need to subject their devices to the same FDA review process next spring.\n\nAlso Wednesday, said it has called off merger discussions with Altria.", "description": "The embattled vaping company also announces it will suspend much of its advertising in the U.S.", "authors": ["Angelica Lavito"], "top_image": "https://image.cnbcfm.com/api/v1/image/106014197-1562859258539carl-juul-factory-bin-040-11515815.jpg?v=1562859351", "published_at": "2019-09-25"}