{"pub": "indiatimes", "url": "https://indiatimes.com/trending/wtf/zomato-food-delivery-guy-steals-pune-woman-pet-dog-377414.html", "downloaded_at": "2019-10-09 10:42:43.469996+00:00", "title": "Zomato Delivery Guy Comes To Drop Off Order, Walks Away With Customer's Pet Dog In Pune", "language": "en", "text": "Zomato Delivery Guy Comes To Drop Off Order, Walks Away With Customer's Pet Dog In Pune\n\nZomato Delivery Guy Comes To Drop Off Order, Walks Away With Customer's Pet Dog In Pune\n\nUp until now, we wouldn't have had any reason to fear food delivery guys. They, more often than not, focus on delivering the order on time, collect cash and leave. But this incident might give you reason to worry.\n\nIn a bizarre incident, a Zomato delivery guy kidnapped a customer's pet Beagle. The Pune couple who lost their pooch, took to social media to express their anger.\n\n@ZomatoIN @zomatocare@Rashmibansal #doglovers help @PETA #missingdog kidnapped by Zomato delivery guy Tushar Mobile number 08669582131on 7thOct from Poona at Karve Road,Deccan. pic.twitter.com/qLHnzEpwyT — Vandana Shah (@Vandy4PM) October 8, 2019\n\nVandana Shah posted about the bizarre incident, which she said, happened on Monday around noon, when she found that her dog Dottu had gone missing from Karve Road.\n\nCCTV footage shows the dog ‘Dottu’ was last seen playing inside the premises of her home-cum-factory complex.\n\n@zomatocare@zomato.in tx. Pls call. Tushar your delivery boy will kill our dottu.hes switched off his number. we are at Poona police station#missingdog@rashmibansal@petaindia pic.twitter.com/wdHZuVKFDt — Vandana Shah (@Vandy4PM) October 8, 2019\n\nDon't Miss 41.9 K SHARES 13.4 K SHARES 1.5 K SHARES 7.2 K SHARES 3.9 K SHARES\n\nWhen Dottu remained untraceable for several hours, Shah began searching for it in the neighborhood and found out from a local eatery that a delivery man who worked there, was seen carrying the dog.\n\nThe couple later rushed to the police to lodge a complaint against the delivery guy.\n\nVandana also got hold of a picture of her dog with a man, who turned out to be food delivery personnel of Zomato, who was identified as Tushar.\n\n\"We took his contact number and asked him about Dottu. Tushar confessed to having picked him up but when we asked him to return the dog, he started making up excuses and said that he had sent him to his village,\" Vandana was quoted as saying, by ANI.\n\n@ZomatoIN @zomatocare@Rashmibansal #doglovers help @PETA #missingdog kidnapped by Zomato delivery guy Tushar Mobile number 08669582131on 7thOct from Poona at Karve Road,Deccan. pic.twitter.com/qLHnzEpwyT — Vandana Shah (@Vandy4PM) October 8, 2019\n\n\"We also offered him money in exchange for our beagle but he kept on giving us evasive answers and for the last few hours, he has switched off his cell phone,\" she added.\n\nShe complained about the incident to Zomato’s customer care service, who reassured her that it was \"unacceptable.\"\n\nMiffed by the incident Shah uninstalled Zomato app, she is still waiting action as her pet is still not been traced.", "description": "Up until now we wouldn't have had any reason to fear food delivery guys, they more often than not focus on delivering the order on time, collect cash and leave'. But this incident might give you reason to worry. In a bizarre incident, a food delivery guy with Zomato kidnapped a customer's pet Beagle. The Pune couple who lost their pooch took to social media to express their anger.", "authors": ["Kc Archana"], "top_image": "https://media.indiatimes.in/media/facebook/2019/Oct/puppy_1570609899_800x420.jpg", "published_at": "2019-10-09"}