{"pub": "reuters", "title": "Germany's Scholz raises pressure on Merkel to think big on climate protection", "url": "https://in.reuters.com/article/germany-climate/germanys-scholz-raises-pressure-on-merkel-to-think-big-on-climate-protection-idINKCN1VN1WD?il=0", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:11:36.333302+00:00", "text": "BERLIN (Reuters) - German Finance Minister Olaf Scholz on Monday urged Chancellor Angela Merkel’s conservatives to support far-reaching steps on climate protection, warning that failure to do so would raise questions over their coalition’s right to rule.\n\nFILE PHOTO: German Vice Chancellor and Finance Minister Olaf Scholz looks on during the \"Open Door Day\" of the Federal Ministry of Finance in Berlin, Germany, August 17, 2019. REUTERS/Annegret Hilse\n\nSenior members of Scholz’s co-ruling, centre-left Social Democrats (SPD) and the heads of Merkel’s CDU/CSU conservative bloc were due to meet behind closed doors on Monday to prepare a comprehensive package of climate protection measures that are likely to burden the federal budget massively.\n\nA senior government official told Reuters last month that the Finance Ministry was toying with the idea of issuing new debt in the form of “green bonds” which could help finance the costly climate protection package.\n\n“We need a big leap in climate policy if, as a government, we want to continue to have the authority to lead the country,” Scholz, deputy SPD leader, said in an interview with Der Spiegel magazine.\n\n“Thinking small on climate protection does not help. We have to get away from a policy where we do not dare to do the right thing just because we are too anxious about possible reactions.”\n\nThe coalition partners held off a surge in far-right support in two state elections in eastern Germany on Sunday, averting an immediate crisis for the ruling alliance.\n\nBut the populist Alternative for Germany (AfD) came second in both Saxony and Brandenburg as it harnessed voter anger over refugees, the planned closure of coal mines in the formerly communist east and the government’s policy in general.\n\nThe climate protection package is likely to include a pricing mechanism for carbon emissions and payouts for low-income families to cushion the effects of the new measures.\n\nThe so-called climate cabinet, including Merkel, Scholz, Environment Minister Svenja Schulze and Economy Minister Peter Altmaier, is expected seal the package and decide if the new measures can be financed without new debt on Sept. 20.\n\nAs the economy teeters on the brink of recession and borrowing costs have turned into premiums, SPD parliamentary leader Rolf Muetzenich joined the growing chorus of voices who want Berlin to bury its self-imposed balanced budget rule.\n\n“We should take advantage of the opportunities offered by a long period of low interest rates,” Muetzenich said in an interview with Frankfurter Allgemeine Sonntagszeitung.\n\nThe government should therefore take on new debt to increase public investment in climate protection, infrastructure and digitisation, he added.\n\nA spokeswoman for the SPD parliamentary group said that Muetzenich discussed all relevant topics with Scholz on a regular basis, including budget issues.\n\nA Finance Ministry spokesman declined to comment.\n\nIn a further sign of shifting opinions, the ministry on Monday confirmed a Reuters report from last week that said Scholz had chosen an outspoken critic of Germany’s balanced budget goal as his new deputy for parliamentary affairs.\n\nSarah Ryglewski, 36, is a member of the SPD’s left wing and belongs to a group of lawmakers who in an open letter sharply criticised the government’s insistence on the self-imposed policy goal of not taking on new debt.", "description": "German Finance Minister Olaf Scholz on Monday urged Chancellor Angela Merkel's conservatives to support far-reaching steps on climate protection, warning that failure to do so would raise questions over their coalition's right to rule.", "authors": ["Michael Nienaber", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190902&t=2&i=1425476415&w=1200&r=LYNXNPEF811HN"}