{"pub": "yahoo", "url": "https://news.yahoo.com/trial-begins-honduran-presidents-brother-drug-charges-205317628.html", "downloaded_at": "2019-10-03 08:38:02.795684+00:00", "published_at": "2019-10-03", "title": "US prosecutor says Honduran president took fortune in drug bribes", "language": "en", "text": "Honduran President Juan Orlando Hernandez, seen in this file photo from June 2019, has dismissed the accusation as 'absurd' (AFP Photo/ORLANDO SIERRA)\n\nNew York (AFP) - Honduran President Juan Orlando Hernandez took millions of dollars in bribes from drug lords including jailed Mexican kingpin Joaquin \"El Chapo\" Guzman, a US prosecutor said Wednesday at the opening of his brother's trial.\n\nThe president's brother, Juan Antonio Hernandez -- a former Honduran congressman also known as Tony -- was arrested at a Miami airport in November 2018 for conspiring to import cocaine into the United States, weapons offenses and making false statements.\n\n\"The defendant was protected by the current president, who has received millions of dollars in bribes from drug traffickers like 'El Chapo' Guzman, who personally delivered one million dollars to the defendant for his brother,\" prosecutor Jason Richman said.\n\nPresident Hernandez dismissed the accusation as \"absurd.\"\n\nIt \"is 100% false, absurd and ridiculous... this is less serious than Alice in Wonderland,\" he wrote on Twitter.\n\nRichman said that Tony Hernandez belonged to \"a state-sponsored organization that distributed cocaine for years\" in the US, with the goal of making millions of dollars, adding that corrupt \"mayors, congressmen, military generals (and) police chiefs protected his organization.\"\n\nThe charges run to four counts. If convicted, he faces from five years to life in prison.\n\nThe US government alleges that Hernandez, who served as a member of the Honduran Congress from 2014 to 2018, worked from 2004 to 2016 with others in Colombia, Honduras and Mexico to import cocaine into the US via plane, boat and submarine.\n\nThe prosecution also says Hernandez was involved in at least two murders of rival drug traffickers in 2011 and 2013.\n\nSome of the cocaine he was transporting was labeled with his initials \"TH,\" according to US Attorney Geoffrey Berman.\n\nDefense attorney Omar Malone said Hernandez was the target of violent criminals because his brother's administration authorized the extradition of drug traffickers to the US.\n\nHe also referenced the cordial relationship between Honduras and the US, which saw the country's president shake hands with his US counterpart Donald Trump at the United Nations General Assembly in New York.\n\nThe president of Honduras has interacted with the United States like any other president of any other country,\" Malone said.\n\nTony Hernandez, 41, wore a blue suit and appeared calm during the selection process of 12 jurors and six alternates. For security reasons the jurors will only be identified with numbers, as is typical for major drug-trafficking trials.\n\nThe judge estimates the trial will last between 10 and 12 business days.\n\nHernandez's trial comes after Guzman, the 62-year-old former co-leader of Mexico's feared Sinaloa drug cartel, was convicted in February of smuggling hundreds of tons of cocaine, heroin, methamphetamines and marijuana into the United States.\n\nHe has been jailed for life, a sentence he is appealing.\n\n- Honduran trafficking allegations -\n\nUS prosecutors have aggressively pursued current or former Honduran public officials and their relatives over drug-trafficking allegations.\n\nThe prosecution also claims that several candidates from Honduras's ruling National Party accepted campaign funding from Hernandez, including former president Porfirio Lobo and the current president, who was elected first in 2013 and again in contested elections in 2017.\n\nThe Manhattan prosecutor's office filed a motion in August alleging that President Hernandez received at least $1.5 million in drug money from one of the prosecution's cooperating witnesses for his first campaign, and $40,000 for the second.\n\nPresident Hernandez and Lobo have both rejected the accusations, and neither has been formally charged by the US judicial system.\n\nAfter massive demonstrations demanding his resignation, Hernandez told the UN General Assembly last week that there is a smear campaign against him led by former drug lords furious for having been extradited to the US -- an idea echoed by his brother's attorney.\n\nThe prosecution plans to call as witnesses five former drug lords imprisoned in the US who claim they were Tony Hernandez's accomplices.\n\nOne witness is a former cartel leader who claimed during the 2017 trial of Fabio Lobo, Porfirio Lobo's son, to have bribed Hernandez during his congressional tenure.\n\nFabio Lobo was sentenced to 24 years in a US prison for conspiring to smuggle cocaine.", "description": "Honduran President Juan Orlando Hernandez took millions of dollars in bribes from drug lords including jailed Mexican kingpin Joaquin \"El Chapo\" Guzman, a US prosecutor said Wednesday at the opening of his brother's trial.  The president's brother, Juan Antonio Hernandez -- a former", "authors": ["Laura Bonilla"], "top_image": "https://s.yimg.com/uu/api/res/1.2/5WT.8PTK2v7Obt6cbj1T2A--~B/aD00NTg7dz03Njg7c209MTthcHBpZD15dGFjaHlvbg--/http://media.zenfs.com/en_us/News/afp.com/1a25231d45996b953f193c778bab792b8ee1d769.jpg"}