{"pub": "mirror", "url": "https://mirror.co.uk/travel/news/uk-airports-worst-security-queue-20578857", "downloaded_at": "2019-10-14 23:29:19.102352+00:00", "title": "UK airports with the worst security queue waiting times - and the best ones too", "language": "en", "text": "Get the biggest Weekly Travel stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAnyone who's travelled by plane will know the pain of facing those long and tedious airport security queues.\n\nAlthough there are some tricks to cut down your waiting time, during peak travel seasons it can take up a chunk of that precious airport time, when you could be hitting the duty free shops or tucking into a hearty meal before your flight.\n\nNow, new research by Which? Travel has revealed the UK airports which have some of the worst security waiting time by surveying over 4,000 passengers to provide an estimate of how long they waited.\n\nThe biggest culprit? Manchester Airport, which had the longest average security queue waiting times of any large UK airport.\n\nIn fact, according to the report all three of the airport's terminals had worse waiting times than rival airports, with an average 16 minutes per passenger.\n\nMeanwhile, London Stansted came a close second with an average waiting time of 13.7 minutes, while London Luton took the third spot with 11.7 minutes.\n\n(Image: Getty Images)\n\nAs for small airports? Belfast International took the top spot with the longest average waiting time of 22 minutes.\n\nOn the flip side, London Gatwick's South Terminal and London Heathrow's Terminal 5 had some of the shortest wait times at 8.6 minutes for larger airports, while Southampton and London Southend both shared an average wait time of 5.2 minutes, the shortest for the smaller airports.\n\n(You can check out the full lists below).\n\n(Image: Alamy Stock Photo)\n\nRory Boland, Which? Travel Editor, said: \"Never-ending queues through security are a pain at the best of times, but if you are left waiting for hours on end you could find your flight has left without you.\n\n\"To add insult to injury, if this happens you are unlikely to qualify for compensation as the time it takes to get through security is out of the airline’s control.\n\n\"Airlines will rarely delay a flight due to long queues at security so it’s important to arrive at the airport in plenty of time, especially if you are flying from Manchester or Belfast.\"\n\nLarge airports with the longest waiting times at security\n\nManchester Airport T1 - 22 minutes Manchester Airport T2 - 15.5 minutes Manchester Airport T3 - 15.5 minutes London Stansted - 13.7 minutes London Luton - 11.7 minutes Birmingham - 10.6 minutes Edinburgh - 10.5 minutes Heathrow T3 - 10.3 minutes Heathrow T2 - 9.6 minutes Heathrow T4 - 9.4 minutes Gatwick North - 8.7 minutes Gatwick South and Heathrow T5- 8.6 minutes\n\nSmall airports with the longest waiting times at security", "description": "UK airports with the worst security waiting times have been unveiled for 2019 by Which? Travel", "authors": ["Julie Delahaye", "Image", "Getty Images Istockphoto", "Getty Images", "Alamy Stock Photo"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article13999405.ece/ALTERNATES/s1200/3_Information-sign-showing-way-to-departures-and-security-at-Heathrow-Airport-in-London.jpg", "published_at": "2019-10-14"}