{"pub": "npr", "title": "Pieces Of Missing Japanese F-35 Fighter Jet Found; Pilot Still Missing After Crash", "url": "https://npr.org/2019/04/10/711693546/pieces-of-missing-japanese-f-35-fighter-jet-found-pilot-still-missing-after-cras", "language": "en", "published_at": "2019-04-10", "downloaded_at": "2019-09-02 07:31:28.524349+00:00", "text": "Pieces Of Missing Japanese F-35 Fighter Jet Found; Pilot Still Missing After Crash\n\nEnlarge this image toggle caption Ross D. Franklin/AP Ross D. Franklin/AP\n\nJapan's military has confirmed that one of its F-35A jet fighters has crashed in the Pacific Ocean during a training exercise. National broadcaster NHK reports that search crews have recovered part of the plane's tail.\n\nAs of midday Wednesday in Japan, the plane's pilot, reportedly in his 40s, was still missing. It is not clear whether he ejected before the plane crashed. NHK quotes Defense Minister Takeshi Iwaya as saying that the military is focusing on rescuing the pilot and investigating the cause of the crash. He added that the U.S. military is assisting with the search.\n\nThe crash has raised concerns both about the safety of the F-35, which Japan plans to adopt as the mainstay of its air force, and the possible intelligence windfall that any foreign government could score, in the event that they could beat Japanese or U.S. search crews to the missing plane's wreckage.\n\nThe plane took off from Misawa airbase in northeast Japan's Aomori prefecture around 7 p.m. for a combat training exercise with three other jets. There were no signs of any problem until a half-hour later, when the pilot communicated that he was calling off the mission. The plane then disappeared from the radar, roughly 80 miles east of Misawa.\n\nMisawa is home to both U.S. and Japanese air forces. It is also reportedly a center for the allies to collect signals intelligence. It is home to Japan's first squadron of F-35A fighters, which began operations just last month.\n\nThe Reuters news agency reports that the F-35 was less than a year old. It is made by Lockheed Martin, but the crashed plane is the first to be assembled in Japan by Mitsubishi Heavy Industries in Nagoya, Japan. The F-35 went into service, for the U.S. Marine Corps, in 2015. Two have now crashed in the years since.\n\nJapan has grounded its 12 remaining F-35As at Misawa, as well as other military flights.\n\nThe so-called \"fifth generation\" fighter plane costs about $100 million, and Japan plans to buy about 150 more of them from the U.S., more than any other customer.\n\nThe purchase affects the balance of payments between the U.S. and Japan, as the U.S. pushes its main allies, including South Korea and Germany, to shoulder more defense costs, including the basing of U.S. troops on their soil.\n\nFor Japan, the F-35 purchase is part of Prime Minister Shinzo Abe's strategy to build up its military, to cast off its postwar constitutional limitations, to make it more independent of its U.S. allies, and to deter China in long-simmering territorial disputes in the East China Sea.\n\nChina is developing its own fifth-generation stealth fighters and is expected to deploy more of them than Japan, even with its purchase of F-35s, over the next decade and beyond.\n\nWhile there are no indications that anyone other than Japan and the U.S. are trying to recover the crashed F-35, the concern that it might fall into foreign hands, such as Russia's or China's, is a reminder that U.S. \"forward deployed\" forces in the western Pacific operate in a crowded region, where chance encounters and competition with other major powers is a constant condition.", "description": "Japan's military reported on Tuesday that it lost an F-35 stealth jet off the coast of Japan, in the Pacific. Pieces of the plane have been located and a search for the pilot is ongoing.", "authors": ["Anthony Kuhn"], "top_image": "https://media.npr.org/assets/img/2019/04/10/ap_17355748457171f35a_wide-89f2ef3212e6a8db936955d4cdd019ef890c5225.jpg?s=1400"}