{"pub": "yahoo", "url": "https://news.yahoo.com/hong-kong-stocks-fall-weak-083059166.html", "downloaded_at": "2019-10-18 08:52:59.277267+00:00", "title": "Hong Kong stocks fall on weak China growth data", "language": "en", "text": "* HK->Shanghai Connect daily quota used -1.8%, Shanghai->HK daily quota used 1.9%\n\n* HSI -0.5%, HSCE -0.5%, CSI300 -1.4%\n\n* FTSE China A50 -1.5%\n\nOct 18 (Reuters) - Hong Kong stocks weakened on Friday, tracking broader losses in other Asian markets following downbeat China growth data, but made weekly gains on hopes more measures would be taken to support the island city's economy amid months-long protests.\n\n** The Hang Seng index fell 0.5% to end at 26,719.58, while the China Enterprises Index lost 0.5% to close at 10,540.04.\n\n** For the week, HSI was up 1.6%, while HSCE climbed 0.8%.\n\n** China's third-quarter economic growth slowed more than expected and to its weakest pace in almost three decades as the bruising U.S. trade war hit factory production, boosting the case for Beijing to roll out fresh support.\n\n** Though expectations of more stimulus amid Hong Kong protests helped underpin the market in the past week.\n\n** Nine major banks in Hong Kong have agreed to adopt a number of measures to support small and medium enterprises in the city, the central bank said on Wednesday, following its move to cut banks' capital buffer to support the faltering economy on Tuesday.\n\n** Hong Kong is preparing for a weekend of demonstrations, including a human chain at major subway lines on Friday and a democracy march on Sunday, the latest moves in more than four months of anti-government protests.\n\n** Markets were also keeping an eye on the progress of a proposed Sino-U.S. trade deal.\n\n** China hopes to reach a phased agreement in the trade dispute with the United States and cancel tariffs as soon as possible, the commerce ministry said on Thursday, adding that trade wars had no winners.\n\n** Around the region, MSCI's Asia ex-Japan stock index was weaker by 0.24%, while Japan's Nikkei index closed up 0.18%.\n\n** The yuan was quoted at 7.0833 per U.S. dollar at 0816 GMT, 0.09% weaker than the previous close of 7.0772.\n\n** At close, China's A-shares were trading at a premium of 28.64% over Hong Kong-listed H-shares. (Reporting by the Shanghai Newsroom; Editing by Rashmi Aich)", "description": "Hong Kong stocks weakened on Friday, tracking broader losses in other Asian markets following downbeat China growth data, but made weekly gains on hopes more measures would be taken to support the island city's economy amid months-long protests.  ** The Hang Seng index fell 0.5% to end at 26,719.58", "authors": [], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-18"}