{"pub": "yahoo", "url": "https://news.yahoo.com/washington-examiner-top-editor-defends-142451391.html", "downloaded_at": "2019-10-27 04:06:25.196451+00:00", "title": "Washington Examiner Top Editor Defends Release of Kellyanne Conway Audio: No Excuse for ‘Abusing’ Reporters", "language": "en", "text": "On Thursday, the Washington Examiner released audio of presidential counselor Kellyanne Conway berating a reporter.\n\nExaminer editor-in-chief Hugo Gordon said that even “off the record conversations … are not, and never have been, blanked coverage to shield people who pull a bait and switch, peremptorily enter the conversation, and then spend ten minutes abusing, bullying and threatening a reporter.”\n\nIn his defense of releasing the full conversation, Gordon added, “Other organizations may agree to be played for saps, but the Washington Examiner won’t.”\n\nAlso Read: Kellyanne Conway Asks Reporter 'What's Your Ethnicity?' When Questioned About Trump Tweets\n\nThe audio and an article outlining the context of the conversation dropped Thursday after Conway, according to the piece, took issue with a Tuesday write-up that mentioned her husband George Conway, a conservative lawyer who frequently publicly criticizes her boss, President Trump.\n\nIn the call, which reporter Caitlin Yilek says was initiated by Conway’s assistant without mention of the fact that Conway herself would take over once the assistant established the chat was off-record, the top White House aide says, “So I just am wondering why in God’s earth you would need to mention anything about George Conway’s tweets in an article that talks about me as possibly being chief of staff. Other than it looks to me like there’s no original reporting here, you just read Twitter and other people’s stuff, which I guess is why you don’t pick up the phone when people call from the White House because, if it’s not on Twitter or it’s not on cable TV, it’s not real.”\n\nAlso Read: Kellyanne Conway Chides George Conway Over Trump Criticism: 'Air Grievances Like That in Private'\n\nIn her own statement posted to Twitter, Conway pushed back on the description of how the call came to be, writing she “grabbed the phone from a colleague” and “did NOT indicate the call was off-the-record, but the reporter certainly thought it was.”\n\nIn the call, Conway sarcastically told Yilek the reporter is “really going places,” and said, “Let me tell you something, from a powerful woman. Don’t pull the crap where you’re trying to undercut another woman based on who she’s married to. He gets his power through me, if you haven’t noticed. Not the other way around. And if these are the quote standards unquote at the Washington Examiner, then yes I’d be happy to talk to your editor. But I’ve known your editor since before you were born.”\n\nAlso Read: President Trump Rips 'Mr Kellyanne Conway' as a 'Husband From Hell,' 'Stone Cold Loser'\n\nIn her statement on the call and its release, Conway said part of her job duties includes engaging with reporters to “answer substantive questions about the business of the White House,” but she has been “subjected to personal questions which seem gossipy, inappropriate and irrelevant.”\n\nShe continued, “I’ve previously noted that it is unusual — especially in Washington and especially in Republican politics — for a man to gain newfound fame and power through his wife, following his own storied, decades-long career as a respected and outstanding litigator in New York, which I have long admired. Like every couple I know, George and I disagree on many big things and agree on many big things. Exactly none of it affects my position as Counselor to the President. Exactly none of it is anyone’s business.”\n\nA representative for the Examiner did not immediately return a request for further comment.\n\nRead original story Washington Examiner Top Editor Defends Release of Kellyanne Conway Audio: No Excuse for ‘Abusing’ Reporters At TheWrap", "description": "On Thursday, the Washington Examiner released audio of presidential counselor Kellyanne Conway berating a reporter.Examiner editor-in-chief Hugo Gordon said that even “off the record conversations … are not, and never have been, blanked coverage to shield people who pull a bait and switch, peremptorily", "authors": ["Lindsey Ellefson"], "top_image": "https://s.yimg.com/uu/api/res/1.2/.wyn2ZM783od18EDUI1VlQ--~B/aD00MDA7dz02MTg7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/thewrap.com/97efaf1fea0a2da98b5f3124ba6c819e", "published_at": "2019-10-25"}