{"pub": "metro", "url": "https://metro.co.uk/2019/10/26/rugby-world-cup-final-england-beats-new-zealand-semi-final-10987087", "downloaded_at": "2019-10-26 11:14:28.395776+00:00", "title": "When is the 2019 Rugby World Cup Final as England beats New Zealand?", "language": "en", "text": "The Rugby World Cup will no-doubt be a tense match for viewers back home (Picture:REUTERS)\n\nThe Rugby World Cup gripped viewers at home in Great Britain this morning as England took on the All Blacks in a tense match over in Japan and went on to win the game in one of their greatest ever performances on a rugby pitch.\n\nToday’s semi-final game between England and New Zealand was to determine who will play in the Rugby World Cup Final, with Wales due to take on South Africa in another semi-final match tomorrow, Sunday 27 October.\n\nAfter a nail-biting match, England went on to win 19-7, meaning that they will go on to play in the final.\n\nNew Zealand have won the Rugby World Cup three times before and haven’t been beaten in eight years until today, holding the most winning titles in the competition. England last won the cup in 2003 when they beat Australia over in Sydney.\n\nAdvertisement\n\nAdvertisement\n\nSo, when is the Rugby World Cup Final and how can you watch it?\n\nWhen is the Rugby World Cup Final?\n\nThe Rugby World Cup will be played next Saturday, 2 November 2019, at the International Stadium Yokohama in Yokohama City, Japan.\n\nThe teams playing in the final will be decided this weekend. England will go up against whichever team wins the match tomorrow between Wales and South Africa.\n\nThe Rugby World Cup Final kicks off at 6pm local time in Japan, which will be 9am GMT in the UK.\n\nThose wishing to watch the final in the UK can tune in to see it live just before 9am on ITV.\n\nMORE: Rugby World Cup draw: The path to the final for England and Wales\n\nMORE: Eddie Jones explains George Ford selection for England’s Rugby World Cup semi-final against New Zealand", "description": "The Rugby World Cup gripped Great Britain this morning as England took on the All Blacks in a tense match over in Japan and went on to win.", "authors": ["Rachael Martin"], "top_image": "https://i2.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRI_92528804_1572084846.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-26"}