{"pub": "yahoo", "url": "https://news.yahoo.com/wisconsin-brothers-charged-operating-counterfeit-124126810.html", "downloaded_at": "2019-09-18 05:13:59.467813+00:00", "title": "Wisconsin brothers charged with operating counterfeit vaping cartridge operation", "language": "en", "text": "MILWAUKEE – Two Wisconsin brothers were charged Monday in a massive counterfeit THC vaping cartridge operation.\n\nTyler T. Huffhines, 20, and Jacob D. Huffhines, 23, of Paddock Lake, face numerous charges including possession of THC with the intent to deliver, maintaining a drug trafficking place, identity theft, possession of a firearm by a felon and cocaine possession.\n\nThey're being held in the Kenosha County Jail on $500,000 bail each and are ordered to appear for a preliminary hearing Sept. 26.\n\nAccording to the criminal complaint:\n\nTyler Huffhines admitted starting his THC vape cartridge business on Jan. 28, 2018, the same day he took a picture of his business to post on Instagram. He told detectives that he didn't smoke marijuana but saw a good business opportunity by purchasing THC vape cartridges in California for $2.50 each where they are legal and bringing them back to Wisconsin to sell for $15 apiece.\n\nBrothers Tyler and Jacob Huffhines of Kenosha County, Wisconsin, were arrested Monday, Sept. 16, 2019, on suspicion of ties to a major THC operation. More\n\nTyler Huffhines admitted he figured out he could boost profits by buying empty vape cartridges and jars of liquid THC and paying 10 workers to fill them. Initially, he paid his workers $20 an hour to fill vape cartridges but then realized if he changed his business model to pay them 30 cents per cartridge, it would increase their productivity and he could save more money.\n\n\"You invest more, you make more. No risk, no reward,\" Tyler Huffhines told detectives, according to the complaint.\n\nHe said he flew to California during the Labor Day weekend with $300,000 in cash to buy liquid THC. Plus he posted photos on Snapchat of himself flying in first class and mentioning that he was in California.\n\nEmployees working out of a condo in the Village of Bristol that Tyler Huffhines acquired in early August for the operation cranked out 3,000 to 5,000 counterfeit vaping cartridges each day. They were packaged in boxes with labeling that included candy-like names and wording suggesting the THC content was minimal.\n\nVaping lung illness: What we know about the recent spate of cases and deaths\n\nCBD craze: Spiked vapes and emergency room visits reveal dark side of CBD craze\n\nInstead, the cartridges contained as much as 1,000 mg of THC – more than 150 times what the label indicated, authorities said.\n\nTyler Huffhines told detectives he sold 100 THC cartridges at a time for $15 each, earning $500 to $800. He said he recently decided to change his minimum sale to 500 cartridges.\n\nThe criminal complaint does not reveal to whom Tyler Huffhines sold the cartridges, which sell on the street for around $35 each.\n\nBefore acquiring the condo, the cartridges were filled in hotel rooms. Tyler Huffhines leased the condo and registered for utilities in the name and Social Security number of a Las Vegas man who confirmed to authorities that he didn't authorize anyone to use his name and Social Security number.\n\nTyler Huffhines told detectives that he didn't know the man whose identity was used for the condo but got the man's name and personal information by paying \"some guys in California\" about $2,000.\n\nDuring the investigation, detectives discovered numerous photos and videos Tyler Huffhines posted on Snapchat showing garbage cans, plastic totes and boxes filled with THC cartridges as well as dozens of pound bags of marijuana bud.\n\nDuring searches of the condo and the home where the brothers lived with their mother, authorities found loaded guns, cocaine, 31,200 cartridges each filled with around 1 gram of THC, 98,000 unfilled cartridges, roughly 12½ gallons of refined liquid THC in 57 glass jars, 18½ pounds of marijuana, and three money counting machines.\n\nThe huge counterfeit THC vaping cartridge operation, believed to be one of the largest of its kind in the nation, came to light after the parents of a high school student contacted police.", "description": "Tyler and Jacob Huffhines ran an operation that cranked out 3,000 to 5,000 counterfeit vaping cartridges each day, authorities say.", "authors": ["Meg Jones", "Milwaukee Journal Sentinel"], "top_image": "https://s.yimg.com/uu/api/res/1.2/T6pTbtm3IVus94CMZJmtLg--~B/aD0xNzIxO3c9Mjk3NTtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en-us/usa_today_news_641/28c22f1aee9c264db93183feedaf0acd", "published_at": "2019-09-17"}