{"pub": "businessinsider", "url": "https://businessinsider.com/whistle-is-buying-elisabeth-murdochs-mobile-studio-vertical-networks-2019-10", "downloaded_at": "2019-10-03 23:35:26.463224+00:00", "published_at": "2019-10-03", "title": "Whistle is buying media mogul Elisabeth Murdoch's mobile-content studio, Vertical Networks", "language": "en", "text": "Digital entertainment startup Whistle, which is known for its sports programming, is buying Elisabeth Murdoch's mobile-content studio, Vertical Networks, to double down on lifestyle and entertainment brands that can be monetized across platforms.\n\nAfter the acquisition, Whistle will look to build on Vertical Networks properties like Brother with new revenue streams, such as brand partnership deals, merchandising, or consumer products.\n\nThe deal comes after Whistle acquired digital studio, New Form, in January to beef up its lifestyle and entertainment production.\n\nClick here for more BI Prime stories.\n\nAs more media companies look to diversify their revenue and content offerings, digital-entertainment startup Whistle — which has been known mainly for sports programming — is buying Elisabeth Murdoch's mobile-content studio, Vertical Networks, to double down on lifestyle and entertainment brands that can be monetized across platforms.\n\nVertical Networks, founded by Murdoch in 2016, is best known for Snapchat shows, like \"Phone Swap,\" and its popular Discover channel, Brother. Vertical Networks, a purveyor of mobile video, also counts Snap as one of its investors.\n\nWhistle creates and distributes content across digital platforms from YouTube and Snapchat to the soon-to-launch Quibi. Much of its programming has been tied to sports and features inspiring young athletes.\n\nThrough the pact with Vertical Networks, Whistle aims to expand in lifestyle and entertainment, and monetize its properties in more ways.\n\nIt will look to build bigger brands out of Vertical Networks properties, like Brother, an irreverent media brand for young men, with new revenue streams such as brand partnerships, merchandising, or consumer products. It's done that with some of its own shows, including \"No Days Off,\" which generates ad dollars on platforms like YouTube and Snapchat, and makes money from merch.\n\n\"We think this rounds out the content offering that we're able to bring to market, both for the audience and then ultimately for ways in which we're able to monetize that content,\" Michael Cohen, president of Whistle, told Business Insider.\n\nThe agreement comes at a time when more digital media companies are combining in an effort to become profitable. Just this week, Vice Media announced that it would acquire Refinery29. New York Magazine also sold to Vox Media earlier this month.\n\nDigital media companies have also been looking to diversify their revenue and find new ways to scale in today's fragmented viewing environment.\n\nFormer Vertical Networks CEO Jesus Chavez, who joined the company from Mitú last year and was an exec at Univision, will not be joining Whistle. Jordan Hill, a finance and operations exec at Vertical Networks, will oversee the company as senior vice president and general manager, and report to Cohen.\n\nThe pact with Vertical Networks deepens Whistle's bench of high-profile investors.\n\nThe deal with Vertical Networks deepens Whistle's ties to Snapchat, which Whistle has 12 shows on. On top of adopting Vertical Networks' slate of Snapchat shows, Snap will become an investor in Whistle, as part of the all-stock transaction.\n\nMurdoch will also take a stake in Whistle. Her exit from Vertical Networks follows the announcement of her new production and development company, Sisters, with Stacey Snider and Jane Featherstone.\n\nVertical Networks is Whistle's second acquisition of 2019. It bought digital entertainment studio, New Form, in January, to beef up its production of lifestyle and entertainment content, Variety reported. The pact brought in investors like Discovery, ITV, Ron Howard, and Brian Grazer, among others.\n\n\"Those [deals] help us open up more doors; help us move our business plan a lot faster,\" Cohen said. \"Continuing to partner with the companies that have absolutely amazing investors that see our vision and are excited about it is something we're excited for in the future.\"\n\nWhistle wouldn't disclose the value of the latest deal.\n\nIt has raised more than $100 million in funding to date. Cohen said Whistle is on track to double its revenue year-over-year in 2019 to more than $60 million, including the acquisition of New Form. Whistle is not currently profitable.", "description": "Vertical Networks could help Whistle, known for sports content, expand in lifestyle and entertainment, and monetize its properties in more ways.", "authors": ["Ashley Rodriguez"], "top_image": "https://image.businessinsider.com/5d956a9851823d176060cba0?width=1200&format=jpeg"}