{"pub": "cryptocoin", "url": "https://cryptocoin.news/token-news/october-25-2019-0x-zrx-up-0-2-31542", "downloaded_at": "2019-10-25 16:02:24.966369+00:00", "title": "October 25, 2019: 0x (ZRX): Up 0.2%", "language": "en", "text": "How Did 0x’s Price Fare Yesterday?\n\n0x is up by approximately 0.2% from the previous day, with its price currently hovering around $0.2951 USD. The past 24 hours mark a reversal in price from the day prior; it should be noted, though, that price is still in a unclear trend, and is currently 2.99% above its 20 day moving average. Staying above this level may be critical to sustain short-term momentum. Traders looking for a range to trade within may wish to note that the Bollinger bands (a price indicator based on recent momentum and volatility) for 0x imply the currency may oscillate between $0.248288 and $0.324762, based on how price has behaved in the two weeks prior. Price’s current proximity to the top of the range may make shorting an attractive opportunity to traders interested in trading the range.\n\nTrade 0x (ZRX) and over 500 other cryptos across ten different exchanges — all from one app. Try Quadency.\n\nThe currency’s market cap currently stands at $180 million US dollars.\n\nStraight Off the Chain\n\nYesterday saw 1,134 transfers amongst holders of 0x. As for the number of holders, yesterday saw the number of wallets holding 0x increase by 0. Our engagement rank, which combines weekly percentage growth in number of holders and number of transfers, has 0x ranked 2 out of the 41 Ethereum tokens we’re tracking.\n\nObserving 0x’s Richest Wallets\n\nOf the coin’s total money supply, the richest 1,0000 wallets currently own 89.37%. Drilling down to just exchanges, the top 1,000 wallets that are exchanges control 4.99% of the currency’s money supply. In terms of growth rates, the share of total supply of the richest 1,000 wallets has grown by -0.06% over the past week. For the exchange wallets within the richest 1,000 wallets, their share has grown by 0.17%. As for the 0x’s smart contract itself, that owns 0.01% of the total money supply, an amount unchanged from the week prior.\n\nHow Much Development is Occurring?\n\nIn terms of how active the software development team working on 0x is, it may be worth observing that the last time any work pertaining to code was done on their GitHub code repository was on October 24, 2019, or approximately 1 days before. Over the past 30 days, we’ve seen open issues across 0x’s GitHub repositories grow by 0.67 per day on average, while the number of watchers has grown by 1.37.\n\nThe Latest on 0x and Social Media\n\nTraders interested in following 0x has the biggest presence on Twitter, where it has 151,308 users engaged. You can follow 0x on Twitter here.\n\nWhere to Buy\n\nYou can trade 0x, listed under the symbol ZRX, through the following exchanges: Gate, Yobit, Binance, DDEX, Ethfinex.\n\nArticle by SixJupiter", "description": "", "authors": [], "top_image": "https://cryptocoin.news/wp-content/uploads/2019/04/0x.jpg", "published_at": "2019-10-25"}