{"pub": "yahoo", "url": "https://sports.yahoo.com/patriots-knew-wanted-tomlinson-back-232534091.html", "downloaded_at": "2019-10-25 23:47:42.309698+00:00", "title": "Patriots knew they wanted Tomlinson back before Gordon went on IR", "language": "en", "text": "FOXBORO -- Phillip Dorsett stood in front of his locker just a few feet away from the stall Josh Gordon used to call his own. Though the microphones were pointed in his direction, Dorsett had just as many answers about his friend as the reporters asking him questions.\n\nWhich is to say, not many.\n\n\"I mean,\" Dorsett started. \"I think everybody was surprised. I don't really know the situation so...\"\n\nScroll to continue with content Ad\n\nGordon was placed on injured reserve late Wednesday, effectively ending his season with the Patriots. But because Gordon is healthy enough to return this season, the expectation is that he'll be released off of IR and eligible to land with another team.\n\nAs Dorsett alluded, he wasn't the only one in the Patriots locker room surprised by the roster move. You can include Eric Tomlinson in that group as well.\n\nTomlinson actually might not have been surprised that there was a move made to clear a roster spot. But he was a little taken aback by the timing of the move itself.\n\nMy understanding is that Tomlinson was told early on Wednesday that he'd be released. The Patriots informed him at the time that they hoped to get him back after figuring out a way to open up a spot on the 53-man roster. By midday Wednesday, the team had released a statement saying Tomlinson had been let go.\n\nTomlinson was originally signed on Oct. 15 to help give the Patriots some depth at the tight end and fullback positions. At 6-foot-6, Tomlinson doesn't have a classic fullback build, but it's a role he got some experience with while playing with the Jets -- he spent 2016-18 in Jersey -- and it gives him some added versatility for Bill Belichick.\n\nStory continues\n\nThat the Patriots wanted to keep working with Tomlinson made sense. He can play a couple of different positions, and he was trusted enough on Monday to start in New England's 12-personnel package. He played 38 total snaps in his Patriots debut.\n\nBut the fact that Gordon was placed on IR and Tomlinson was brought back to One Patriot Place as quickly as he was came as a bit of a surprise to the 27-year-old.\n\nPatriots trade Michael Bennett to Cowboys\n\nTomlinson missed Wednesday's walkthrough -- a walkthrough attended by Josh Gordon -- but was back in the building later that day. It was Gordon who was lopped off the roster in order to make room for Mohamed Sanu. Tomlinson was never officially released despite being told he would be.\n\nEven if he expected to be back with the Patriots eventually, it was a whirlwind day.\n\nIt's been a hectic last few weeks for Tomlinson, in fact. He was signed on a Tuesday, practiced with the Patriots, then flew back to Houston to be with his wife for the delivery of their first child. On Wednesday, Leslie Stone was born. Later that day, Tomlinson was back on a plane to eventually make his way back to Foxboro. He was back at practice Thursday and ready to go for Monday night's game against his old team.\n\nTomlinson's busy day on Wednesday of this week though -- being told he was off the team, then brought back once the decision was made to place Gordon on IR -- leaves us with some questions.\n\nWhy wasn't Gordon placed on IR to begin with? What happened between Wednesday's walkthrough and the end of the day to land Gordon on IR? Why, in essence, was Tomlinson's wait so short? (Technically, it was a non-existent wait since he was never officially removed from the roster.)\n\nTomlinson wasn't told why things shook out the way they did with Gordon. Dorsett didn't have any answers. So we'll continue to try to ascertain what we can.\n\nClick here to download the new MyTeams App by NBC Sports! Receive comprehensive coverage of your teams and stream the Celtics easily on your device.\n\nPatriots knew they wanted Tomlinson back before Gordon went on IR originally appeared on NBC Sports Boston", "description": "Eric Tomlinson's brief, whirlwind Patriots career took another crazy turn this week when he was announced as being released but was then able to stick around when Josh Gordon was placed on injured reserve.", "authors": ["Phil Perry"], "top_image": "https://s.yimg.com/ny/api/res/1.2/6XlZUY_.CwxhUFS.7JQGWg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD03MjUuODQzMjkzNDkyNjk1OQ--/https://s.yimg.com/uu/api/res/1.2/rL1TNLzG9i3Uufpe_Wyx8Q--~B/aD00Mjc7dz03NTM7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en/csnne.com/5135e6db59d12ba03d0750fc97fe8e40", "published_at": "2019-10-24"}