{"pub": "investingcom", "url": "https://investing.com/analysis/stocks-to-watch-fslr-hiiq-snap-spwr-terp-200465565", "downloaded_at": "2019-09-18 12:54:21.856148+00:00", "title": "Stocks To Watch: FSLR, HIIQ, SNAP, SPWR, TERP", "language": "en", "text": "First Solar (FSLR)\n\nFirst Solar (NASDAQ: ) broke out of a 6-week base pattern on Tuesday and jumped 2.38, or 4%, to 65.82, on 1.15 million shares. The entire solar group looks like it’s going to go higher. FSLR looks like it’s headed to 69-70, then take out 75, and make it to 80.\n\nHealth Insurance Innovations (HIIQ)\n\nHealth Insurance Innovations Inc (NASDAQ: ) popped and I put a swing on it. On Tuesday, it ran 1.14, or 6%, to 20.91, on 869,749 shares traded. It’s in a 5-wave decline, broke out, pulled back, and it’s above the 50-day, double-top, and declining tops line. I’m looking for 25, 28, and 34 going forward.\n\nSnap (SNAP)\n\nSnap (NYSE: ) may have broken out. It took out the declining topsline and lateral price resistance. On Tuesday, it was up 1.07, or 7% to 16.83, on 40 million shares. If it can get up through 17.20, then we should see something around 18 1/2, and perhaps something higher down the road.\n\nSunPower Corporation (SPWR)\n\nSunPower (NASDAQ: ) exploded 1.56, or 12%, to 14.50, on 7.3 million shares on Tuesday. I would estimate midchannel target 16, and then 20 going forward.\n\nTerraForm Power (TERP): Swing Trade\n\nTerraForm Power (NASDAQ: ) broke out of a four-week flag on Tuesday, and popped 68 cents, or 4%, to 17.58, on 945,325 shares traded. It looks like it’s going higher. It’s a really nice pattern since the Dec lows at 10, and change. Now, it’s above 17 1/2. Targeting 18 1/2 and 20.\n\nStocks on the long side\n\nAvadel Pharmaceuticals (AVDL), Enphase Energy, Inc. (ENPH), First Solar, Inc. (NASDAQ: ), Health Insurance Innovations, Inc. (HIIQ), HUYA Inc. (HUYA), Pier 1 Imports, Inc. (PIR), SolarEdge Technologies, Inc. (SEDG), Snap Inc . (NYSE: ), SunPower Corporation (SPWR), StoneCo Ltd. (STNE), TerraForm Power, Inc. (TERP), and TherapeuticsMD, Inc. (TXMD).\n\nWatch video here...", "description": "Stocks Analysis by Harry Boxer covering: SunPower Corporation, First Solar Inc, Health Insurance Innovations Inc, TerraForm Power Inc. Read Harry Boxer's latest article on Investing.com", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-09-18"}