{"pub": "abcnews", "url": "https://abcnews.go.com/US/wireStory/maine-track-legal-marijuana-sales-spring-2020-66092395", "downloaded_at": "2019-10-07 00:14:58.112941+00:00", "title": "Maine on track for legal marijuana sales by spring 2020", "language": "en", "text": "Maine marijuana enthusiasts will probably be able to purchase their preferred products in retail stores by March 2020 after years of waiting.\n\nVoters approved legal adult-use marijuana at the polls in November 2016, and the road to legal sales has been long and bumpy.\n\nBut a key act passed by the Legislature is now in effect, and that means the Maine Office of Marijuana Policy is in a position to complete final adoption of marijuana rules, said David Heidrich, an office spokesman.\n\nThe act made tweaks to Maine's Marijuana Legalization Act that were necessary for the marijuana office to adopt the rules, which it is expected to do within two months. That means it will likely be able to accept applications for retail marijuana sales by the end of 2019, Heidrich said.\n\nThe state will need time to process the applications, and retailers will also need local approvals, but the state is projecting revenue from marijuana sales by March 15, Heidrich said. How swiftly the applications are approved might depend on how complete they are, he said.\n\n\"We won't know until we get applications. It's possible we get applications from someone who has all their ducks in a row and has a municipality lined up that's poised to give them local authorization,\" Heidrich said.\n\nMaine's rollout of legal marijuana has been beset with hiccups, such as a squabble over the hiring of a key consultant, and was also slowed by former Gov. Paul LePage's opposition to legalization.\n\nHowever, the result has been a process that will ultimately protect public health and safety, said Scott Gagnon, who led a drive against legalization and has since played a role on a state marijuana commission.\n\n\"From a public health perspective it has been a slower pace, a more deliberative pace than has happened in some states,\" Gagnon said. \"I think that's been good.\"\n\nDavid Boyer, an independent marijuana industry consultant in Maine, said that it's \"disappointing that adults still don't have a place to purchase legal cannabis in Maine,\" but that the finish line is in sight.\n\n———\n\nThis story has been corrected to show that David Boyer no longer works for the Marijuana Policy project, he works as an independent consultant.", "description": "Get breaking national and world news, broadcast video coverage, and exclusive interviews. Find the top news online at ABC news.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/US/WireAP_23a26f0d16c04d7cb9ed8fe54bf53842_16x9_992.jpg", "published_at": "2019-10-07"}