{"pub": "news24", "url": "https://parent24.com/Lifestyle/watch-little-girls-emotional-reaction-as-dad-returns-home-cancer-free-20191007", "downloaded_at": "2019-10-07 20:27:13.159209+00:00", "title": "WATCH: Little girl’s emotional reaction as dad returns home cancer-free", "language": "en", "text": "WATCH: Little girl’s emotional reaction as dad returns home cancer-free\n\nThis young girl couldn’t hold back the tears when her dad surprised her with an early homecoming from hospital.\n\nThis young girl couldn’t hold back the tears when her dad surprised her with an early homecoming from hospital.\n\nChris Dickson from Lancashire, England, was diagnosed with bladder cancer six years ago.\n\nHe underwent chemotherapy and opted for a cystectomy – the removal of the bladder along with other vital organs such as the prostate – when doctors detected two more tumours, The Sun reported.\n\nThe nine-hour long operation required the 43-year-old to spend two weeks in hospital during recovery – or so he thought.\n\nNine days after his surgery Chris and his wife Sharon decided to surprise their daughter Maisy with an early homecoming when she got back from school.\n\nThe eight-year-old was told by her mom to check her phone for a Snapchat update from her dad which was a picture of him lying on a couch. “Come and give me a hug,” he titled the snap.\n\nIt was at this moment that an emotional Maisy ran into the room and to her surprise, her dad was lying on the sofa, Metro reported.\n\nChris filmed the tear-jerking experience, in which he can be seen shedding a tear or two as he tries to console his daughter.\n\n“I wasn't expecting that response,” he wrote in a caption in the shared Facebook post.\n\nAccording to DailyMail, the little girl had never spent a night away from her dad before his surgery.\n\n\n\n“I have never been away from my daughter for even a night. She flew down the stairs and screamed when she saw me. She completely broke down, I had never seen her like that before,” explained Chris.\n\n“I broke down as well, I had never ever felt anyone show so much love towards me,” he added.\n\nSources: Facebook, Metro, The Sun, DailyMail", "description": "This young girl couldn’t hold back the tears when her dad surprised her with an early homecoming from hospital.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9441/befba870d0894e90a291c52d76a59188.png", "published_at": "2019-10-07"}