{"pub": "guardian", "url": "https://theguardian.com/football/2019/sep/18/erling-braut-haaland-red-bull-salzburg-champions-league-hat-trick", "downloaded_at": "2019-09-18 09:05:54.954660+00:00", "title": "Erling Braut Haaland, the Norwegian ‘beast’ ripping up the record books | Marcus Christenson", "language": "en", "text": "The 19-year-old son of Alfie Håland scored a hat-trick on his Champions League debut on Tuesday and has 17 goals in nine games for Red Bull Salzburg this season\n\n“This year I’ve only grown five centimetres,” Erling Braut Haaland said in an interview in November 2017, a statement which, understandably, led the journalist to query the “only” part. “Well, last year I grew 11-12 centimetres,” came the reply from the then 17-year-old.\n\nNo wonder they called him “the manchild” at Molde, where he had his breakthrough that year. “He must have put on 10-12 kilos since he arrived here at the start of the year,” said his then manager, Ole Gunnar Solskjær, before adding “it’s all muscles of course – as well as a lot of confidence”.\n\nChampions League roundup: Håland makes history in Salzburg romp as Barça are held Read more\n\nHaaland, son of the former Manchester City and Leeds United midfielder Alfie Håland and born in Yorkshire, was not always destined for success. “The first time he turned up at Molde I didn’t think he was all that,” Ruben Gabrielsen, a former teammate, told Nettavisen recently. “But then he developed in a way I’ve never seen in my whole life. He is stronger than he looks and he is a lot quicker than he looks – he is a beast.”\n\nA beast is not a bad description. Just ask the Genk defenders who felt the force of the now 19-year-old Red Bull Salzburg striker on Tuesday as he scored a hat-trick on his Champions League debut, a feat not achieved since Wayne Rooney in 2004. The first goal arrived after 102 seconds, the Norwegian rifling a low shot underneath Gaëtan Coucke in the Genk goal. The second was scored with his left foot and the third was an opportunistic stab past Coucke from inside the six-yard box.\n\nThe game finished 6-2 and afterwards Haaland’s teammate Maximilian Wöber could hardly contain his glee, saying: “He is phenomenal. With his height, to be so nimble and have such command of the ball. It’s really hard to play against him in training – you just have to foul him. Once again he proved why he’s definitely going to become one of the best strikers in the world.”\n\nIt may sound a ridiculous statement, but this is one extremely talented and hard-working young man. His career is being meticulously planned by his father and, almost inevitably, Mino Raiola and he has already changed his name from Håland to Haaland, one suspects to make it more international. “One step ahead,” he said with a smile when asked about it.\n\nWithout my upbringing in Bryne I would not be where I am today Erling Braut Haaland\n\nOne step ahead indeed. He arrived at Molde in January 2017 after 16 games and no goals for Bryne in the second tier. Then he got to work. Along with the centimetres and the kilos came the goals. He scored four in 20 games in 2017 before hitting 12 in 25 appearances the following year, including a remarkable four-goal haul against league leaders Brann in July. Before the game Brann had conceded five goals in 14 games but Haaland took only 20 minutes to destroy that defence.\n\nHis decision to join Salzburg in January 2019 raised eyebrows as he had offers from Juventus and Bayer Leverkusen among others. Salzburg had to pay around £8m but that already seems like one of the deals of the decade.\n\n“I was obviously flattered by Juventus being interested,” he said in January, before adding “but I thought that it was to early to go there. Salzburg was the club that suited me the best and they were the ones who wanted me the most. I also think it was very important to look at how important a part I was going to play for the club I joined. There is more of a chance of playing here.”\n\nHaaland has a remarkable 17 goals in nine games for Salzburg this season and in May he scored nine goals in an Under-20 World Cup game against Honduras. Afterwards he said that he should have got 10 and no one was quite sure whether he was joking.\n\nFacebook Twitter Pinterest Erling Braut Haaland celebrates one of his nine goals against Honduras at the Under-20 World Cup in May. Photograph: Alex Livesey/Fifa via Getty Images\n\nLike many talented 19-year-olds he does want to become the best player on the planet but he is taking one step at the time. “That’s the dream yes, but a dream I share with a million other young players in the world,” he said this year. “First of all I got to become better than my dad and he had 181 Premier League games so that is one aim for example: to get more games there than him.”\n\nManchester United are one of several clubs who have been linked with Haaland, who has praised Solskjær for the role the manager played in his development, but considering his father’s City past and that the midfielder’s career was ended by a Roy Keane tackle that may be an unlikely destination. Haaland is a Leeds fan, having been born in the city, and has said he would like to win the Premier League with the club, although they will have to improve drastically for Haaland to contemplate a move to Elland Road (and he has played for Norway’s senior side so there is no chance of him declaring for the country of his birth).\n\nFor now, though, he is fully focused on Red Bull Salzburg. “It is not right to talk about other clubs when you are with a team and they are paying your wages,” Alfie Håland said recently. “You have to focus on your current club and give everything for them.”\n\nThe Fiver: sign up and get our daily football email.\n\nFor Haaland that means Austrian Bundesliga games against LASK, Rapid Vienna and Austria Vienna before the next Champions League game, against Liverpool at Anfield on 2 October. And the chances of this latest success going to his head appear remote. His Salzburg manager, Jesse Marsch, praised Haaland after the game against Genk, saying what a genuine and down-to-earth person he is. “He is a great player but even more important for me is that he’s a great young man,” the American said. “He shows up every day, he works hard and takes nothing for granted. He gives everything for his teammates every day and does it with a smile.”\n\nAccording to Haaland his approach to life and football stems from his early years in Norway. “Without my upbringing in Bryne I would not be where I am today,” he said recently. “We have a special environment there. It has always contributed towards me not thinking that I am not something special. I have always been humble, worked hard and not thought much about other things.”\n\nHumble yet devastating, Haaland could become one of the best in the world. For many players a Champions League hat-trick would be the pinnacle of their careers but for this young man it is probably just the start.", "description": "The 19-year-old son of Alfie Håland scored a hat-trick on his Champions League debut on Tuesday and has 17 goals in nine games for Red Bull Salzburg this season", "authors": ["Marcus Christenson"], "top_image": "https://i.guim.co.uk/img/media/54a6ac5aefb5770316ed459408daa60a8b612b30/377_341_1283_770/master/1283.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=d7bc92f31d9f2bc9c7b3de42892bc230", "published_at": "2019-09-18"}