{"pub": "nymag", "url": "https://nymag.com/strategist/2019/09/kitchenaid-professional-stand-mixer-sale-amazon.html", "downloaded_at": "2019-09-25 23:26:56.230396+00:00", "title": "KitchenAid Bowl-Lift Professional Stand Mixer on Sale 2019", "language": "en", "text": "1 item in this article Photo: Courtesy of the Retailer\n\nKitchenAid is to stand mixers as Kleenex is to a tissue or ChapStick is to lip balm. It’s the standard, the one brand that professional chefs and home bakers agree is the best — and this KitchenAid stand mixer is particularly nice. It’s a bowl-lift mixer, which are sturdier, and usually more expensive, than tilt-head ones, because there are fewer moving parts. And that heavy-duty construction comes in handy when you’re trying to knead dough or whip up large batches of batter. (In fact, the manufacturer claims this stand mixer is big and powerful enough to make 10 dozen cookies at once.) And right now, this professional-grade stand mixer is the cheapest we’ve ever seen: just $260, or 38 percent off the list price of $416. We like the classic fire-engine red, but if that’s little too flashy for your taste or kitchen, it’s also available in silver and black, for the same low price.\n\nKitchenAid 6-Quart Bowl-Lift Professional Stand Mixer $260 (was $416, now 38% off) $260 at Amazon Buy\n\nget the strategist newsletter Actually good deals, smart shopping advice, and exclusive discounts. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nThe Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.", "description": "The KitchenAid KP26M9XCOB 6-Quart Bowl-Lift Professional Stand Mixer is on sale at Amazon for just $260, 38 percent off the list price of $416, in Onyx Black, Empire Red, and Contour Silver. It’s the cheapest we’ve ever seen.", "authors": ["The Editors"], "top_image": "https://pixel.nymag.com/imgs/daily/strategist/2019/09/25/25-kitchenaid-DOD.w1200.h630.jpg", "published_at": "2019-09-25"}