{"pub": "fox", "url": "https://foxbusiness.com/markets/peter-schiff-china-russia-buying-gold-because-they-can-read-the-writing-on-the-wall", "downloaded_at": "2019-09-09 23:19:08.194422+00:00", "title": "Peter Schiff: China, Russia buying gold because 'they can read the writing on the wall'", "language": "en", "text": "China and Russia have been stockpiling gold, helping to propel the precious metal to its highest level in more than six years.\n\nContinue Reading Below\n\nThe People’s Bank of China has added about 100 tons of gold to its reserves since December. Russia has bought 106 tons of the precious metal this year.\n\n“They can read the writing on the wall,” Euro Pacific Capital CEO Peter Schiff told FOX Business, adding that the two countries are “preparing for the world where the dollar is no longer the reserve currency.”\n\nChina’s gold reserves now stand at more than 1,950 tons, Bloomberg says. Russia has more than 2,200 tons, and has the fifth-largest stockpile by country.\n\nBeijing’s gold purchases, which amount to 100 tons since December, come as it has been less aggressively buying Treasurys amid the U.S-China trade war. In June, China fell behind Japan as the world’s largest holder of U.S. debt, a title it had held since May 2017.\n\nAdvertisement\n\nMeanwhile, Russia has more than quadrupled its reserves over the past decade amid its promise to break its reliance on the U.S. dollar. Russia’s central bank has bought 106 tons so far this year, according to Bloomberg.\n\nTrade war uncertainty and worries about the health of the global economy have helped propel gold prices to their highest level in six years. The precious metal is up almost 18 percent this year and last month hit $1,550 an ounce for the first time since April 2013.\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\n“Prices of precious metals look set to remain elevated, but their recent rally looks overdone,” wrote commodities analysts at the London-based Capital Economics. The firm sees gold hovering around $1,500 an ounce for the rest of the year.", "description": "China and Russia are loading up on gold.", "authors": ["Jonathan Garber"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/gold-iStock.jpg?ve=1&tl=1", "published_at": "2019-09-09"}