{"pub": "businessinsider", "url": "https://businessinsider.com/a-sociologist-says-cars-are-weapons-of-mass-destruction-2019-9", "downloaded_at": "2019-09-12 23:40:59.953191+00:00", "title": "A sociologist thinks cars are a 'weapon of mass destruction' and likens driving to a drug addiction", "language": "en", "text": "Klaus Gietinger is actively leading a campaign against cars. Nine years ago, the German author, filmmaker, and sociologist published his first book on the topic, appropriately naming it: \"The car-hating book\". This year, his newest addition, \"Why the car has no future, but we can still make progress\", is yet another plea to abolish the four-wheeled vehicles once and for all.\n\n\"The car is a weapon of mass destruction\", explains Gietinger in an interview with Business Insider. \"Every year, 1.35 million people die due to road traffic injuries,\" he says, quoting a recent report by the World Health Organization (WHO). This makes it the eighth most frequent cause of death worldwide. As a comparison, almost 22,000 people died worldwide in 2017 because of terrorism, according to IHS Markit.\n\nRead more: These are the 10 best cars to buy if you care about the planet\n\nThis is not even considering the environmental pollution that cars are causing. \"Cars not only kill people on the road, but they also make a significant contribution to CO2 emissions,\" the author explains.\n\nCars contribute largely to CO2 emissions, which ultimately causes a lot of pollution. REUTERS/Stringer\n\nThe United States Environmental Protection Agency agrees with Gietinger: Transport is the only sector that has not reduced its greenhouse gas emissions since 1990 and has even seen an increase since. In 2017, the greenhouse gas emissions from the transportation sector accounted for about 28.9% of total US emissions— officially making it the largest contributor to greenhouse gas emissions in the country. \"Our industry is designed to grow excessively,\" says Gietinger. \"But the earth is not excessive, it is finite.\"\n\n\"The car industry is a drug cartel\"\n\nSo why, despite all these disadvantages to having a car, do so many people still drive them? \"The car industry is a drug cartel,\" says the sociologist. \"Driving a car is a kind of drug. By simply pressing down on the accelerator, you can reach a high speed. This action intoxicates you\". This is why Gietinger calls those who consider themselves car fans, \"junkies\".\n\nBut whoever lives in rural areas might disagree with the author. Without a car, people living outside of cities wouldn't be able to go to work, see friends or go shopping. But Gietinger turns this argument around, saying: \"Cars are the reason why people in rural areas are dependent on cars.\"\n\nDying from road traffic injuries is the 8th most common death worldwide, according to WHO. Nick Beer/Shutterstock\n\n\"Motorization has led to us to drive further and faster,\" says the sociologist. \"But, humans actually always lived in close proximity to things. In the past, everything was close at hand: A corner shop, a pub, a cinema, a swimming pool,\" he says. \"Today you have to go there by car.\"\n\nA shift in public transportation\n\nIn some cases, the car industry even contributed to a change in public transportation. In the US, General Motors bought the tram networks in some cities in the first half of the 20th century and then had them shut down or replaced by buses. \"The USA had the largest railway network in the world,\" says Gietinger. \"Now not even half of it is left.\"\n\n\"Bad transport connections can be changed,\" says Gietinger. \"We need better public transport and a railway network.\" New inventions could also help switch out cars for more environmentally friendly alternatives: \"You can cover more distance in less time with an e-bike. If you have an e-bike and a train station nearby, you no longer need a car.\"\n\nRead more: The 14 cars that are most likely to last 200,000 miles\n\nCars also take up a lot of valuable space in the city. According to a report by \"Die Zeit\", a car driving at a speed of 31 miles per hour, with an additional safe distance to another car of 1500 square ft take up quite a lot of space. An average car that is parked still needs 145 square ft just by standing still. To compare, a pedestrian does not even occupy one square foot.\n\nIntroducing e-cars won't necessarily fix the increasing traffic problem in large cities. Reuters\n\nThe more cars, the more jobs\n\nHowever, the car industry in America also provides many jobs. The Alliance of Automobile Manufacturers estimates that the car industry supports a total of 9.9 million American jobs— making up 5.1% of private-sector employment.\n\nThere are even more people working indirectly for the automotive industry, for example in car workshops and driving schools, in logistics, in the insurance industry or in advertising. There are around 430,000 people employed directly or indirectly in the American public transport industry, which is worth about $71 billion.\n\nHowever, Gietinger points out that a conversion to a more climate-friendly economy will also create jobs, whether this means expanding public transport or working on renewable energies.\n\nBut the sociologist still isn't convinced of electric vehicles: \"Autonomous cars will allow people to work and do much more while on the road. This means that people will drive even more and, as a result, traffic will get worse. E-cars won't solve the space problem in the city either. Finally, their benefits for the environment are controversial anyway.\"\n\nGietinger points out that a conversion to a more climate-friendly economy will also create jobs too. REUTERS/ Mike Segar\n\nWeaning off the drug\n\nGietinger does not want to ban cars, but he wants to make them less attractive. He proposes two ways of doing this: making parking spaces in the city much more expensive and creating more space for pedestrians and cyclists. He also proposes speed limits be reduced in order to limit the \"intoxicating effects\" of driving. The maximum speed should be 62 miles per hour on the motorway, 40 miles per hour on a country road and 19 miles per hour in the city, according to Gietinger.\n\nRead more: 10 new cars that will lose the least amount of value in 5 years\n\nBut how does he intend to \"wean\" people off the drug and convince them to abolish their cars completely? \"We must make it clear to people that we don't have much time left,\" says Gietinger. The sociologist hopes that movements like \"Fridays for Future\" or Extinction Rebellion will lead to a change in consciousness.\n\nBut although the consequences of climate change are already being felt, this has had little effect on consumer behavior so far. According to Statista, more than 272 million cars are registered in America — 79 million more than in 1990. Other industries, like the aviation industry, still have a long way to go.\n\n\"This is a difficult process,\" admits Gietinger. \"The car industry and the junkies will resist. The aim is to break this resistance.\"", "description": "The sociologist, Klaus Gietinger, believes the car industry is like a 'drug cartel' and calls car fans 'junkies'.", "authors": ["Sophia Ankel", "Cornelia Meyer", "Business Insider Deutschland"], "top_image": "https://amp.businessinsider.com/images/5d726d072e22af17aa25a238-2560-1280.jpg", "published_at": "2019-09-10"}