{"pub": "mirror", "url": "https://mirror.co.uk/tech/tinder-hack-lets-you-see-20717087", "downloaded_at": "2019-10-25 00:49:32.333508+00:00", "title": "Tinder hack lets you see who has liked you - without paying for upgrade", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nWhen it comes to finding love, or at least finding a fling, it's now easier than ever to discover like-minded individuals thanks to dating apps.\n\nTinder, Bumble, Hinge and Plenty of Fish connect you with single strangers in your area - or even further afield.\n\nBut have you ever felt like you might have missed your perfect match?\n\nWell, it turns out some apps limit the amount of matches you see, unless you pay to upgrade your account.\n\nBut NottinghamshireLive have shared a sneaky way to get around paying a subscription fee for Tinder users.\n\n(Image: Getty Images)\n\nIf you don't want to buy Tinder Gold, don't worry, you don't need to.\n\nYou can see more of your potential matches, simply by logging into the desktop app.\n\nWhen you sign into the site, there's a section where Tinder invites you to buy a Gold membership, which blurs out the faces of people who have liked you.\n\nBut you can easily unblur the images on Google Chrome.\n\n(Image: Leicestershire Live)\n\nTo try the trick for yourself, you have to start by right clicking on an image and then selecting 'inspect' from the menu that pops up.\n\nOnce clicked, a box should show up on the right-hand side of the Chrome screen, filled with confusing looking code. Don't panic.\n\nInstead right-click the picture again and press 'inspect' once more.\n\nThe white box of code at the side, should still show code, but somewhere amongst it you should be able to see the word 'blur'.\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8 Cancel Play now\n\nIf you delete the word 'blur' from the code and hit enter, you should now be able to see the person who liked your profile.\n\nHowever the hack only lets you see the other person's photo and name - you can't go to their profile or match with them this way.\n\nBut if you really like the look of them, you could always sign up for the Gold subscription, which should actually allow you to view their profile and more.\n\nGood luck Tindering! May the dating odds be ever in your favour.", "description": "If you've ever missed a potential Tinder match, there's a sneaky way you can go back and take a look for free", "authors": ["Courtney Pochin", "Christopher Harper", "Image", "Getty", "Getty Images", "Leicestershire Live"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article13401805.ece/ALTERNATES/s1200/4_Woman-using-dating-app-and-swiping-user-photos.jpg", "published_at": "2019-10-24"}