{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/public-safety/teen-stabbed-on-metro-train-near-capitol-south-has-died/2019/10/12/a73b1958-ed0a-11e9-9c6d-436a0df4f31d_story.html", "downloaded_at": "2019-10-12 17:48:34.031460+00:00", "title": "Teen stabbed on Metro train near Capitol South has died", "language": "en", "text": "A 15-year-old boy who was stabbed Friday afternoon while riding a Metro train died Saturday morning, District police said.\n\nPolice said a 15-year-old girl who was arrested after the attack was charged Saturday with first-degree murder.\n\nThe victim was identified as Jaquar McNair of Southeast Washington. He is the 10th child between the ages of 11 and 17 to be killed in the District this year, and the 136th homicide victim.\n\nThe assailant was not named and it was not clear Saturday whether authorities planned to prosecute her as an adult.\n\nMcNair was riding an Orange line train toward the Capitol South station when he was stabbed about 12:37 p.m., police said. He stumbled toward the fare gates apparently bleeding from the neck as three Metro employees tried to help him.\n\nPolice said the stabbing stemmed from a dispute between the boy and girl but did not provide further details. District schools had the day off Friday.\n\nWhile McNair was rushed to a hospital, U.S. Capitol Police found and arrested the girl several blocks from the Metro station, D.C. police said. She was identified only as a resident of Northwest Washington, and was charged with assault with intent to kill. The charge was amended to murder on Saturday.\n\nMcNair was the sixth person killed in the District since Wednesday. On Friday when the stabbing occurred, Mayor Muriel E. Bowser (D) and Police Chief Peter Newsham were announcing an anti-crime initiative, which includes adding extra police officers and stepping up social services in six high-crime areas of the city.\n\nNewsham said targeting certain areas of the city had helped reduce homicides by 44 percent in those communities, along with significant reductions in shootings and other types of crime.\n\nRead more:\n\nLocal newsletters: Local headlines (8 a.m.) | Afternoon Buzz (4 p.m.)\n\nLike PostLocal on Facebook | Follow @postlocal on Twitter | Latest local news", "description": "Jaquar McNair, 15, is the tenth child killed in Washington this year.", "authors": ["Tom Jackman", "Reporter Covering Criminal Justice Locally", "October At Pm"], "top_image": "https://www.washingtonpost.com/resizer/tnmyb0wLoEdRo0VumbdiR_7bpqo=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TKITEBHMJUI6THDNINVA35HTDU.jpg", "published_at": "2019-10-12"}