{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7615593/Lindy-Klim-shares-thoughts-horse-racing-protesters.html", "downloaded_at": "2019-10-26 02:18:39.631754+00:00", "title": "Lindy Klim shares her thoughts on horse racing protesters", "language": "en", "text": "She is a fashionista who knows how to turn heads on the red carpet.\n\nAnd Lindy Klim, 42, has shared her thoughts on horse racing protesters and their right to demonstrate their feelings ahead of the Melbourne Cup.\n\nIn an interview with Who magazine on Thursday, the mother-of-four explained that activists can protest the races - 'just as long nobody throws paint on me – then that’s a problem'.\n\n'They can protest, just as long as nobody throws paint on me!' Fashionista Lindy Klim (pictured) said protesters have the right to demonstrate their feelings over horse racing\n\nShe said: 'I don’t promote animal cruelty or anything like that, but I do think these animals are very well looked after and very well cared for.'\n\n'Obviously people have their own opinions and they’re allowed to have their own opinions.\n\n'I’m not going to stop anyone from having their own beliefs or whatever. They can protest, just as long nobody throws paint on me – then that’s a problem,' Lindy quipped.\n\nOutspoken: 'I don’t promote animal cruelty or anything like that, but I do think these animals are very well looked after and very well cared for'\n\nThis comes after she spoke about her positive relationship with her ex-husband, champion swimmer Michael Klim.\n\nThe Balinese Princess told Stellar: 'The relationship Michael and I have is incredible.'\n\nShe explained they have an open dialogue about raising their children - daughters Stella, 13, and Frankie, eight, and 11-year-old son Rocco - which took them four years to develop and achieve.\n\nBlended family: This comes after Lindy spoke about her positive relationship with her ex-husband, champion swimmer Michael Klim, after marrying British property developer Adam Ellis in 2018. Pictured: Adam, Lindy, Michael with Rocco, Frankie and Stella\n\nShe told the publication: 'We are always going to have difficult moments that come up, but at least we can speak about it as adults and we can just not have the anger behind it anymore.'\n\nHer husband, British property developer Adam Ellis also spoke fondly about his relationship with the Milk Skincare entrepreneur, saying they often hang out and go to the gym together.\n\n'Compared to how it could have gone so wrong, it's incredible... it's bizarre even to us,' he said.", "description": "She is a fashionista who knows how to turn heads on the red carpet.", "authors": ["Alisha Buaya For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/26/01/20203990-0-image-a-25_1572050466239.jpg", "published_at": "2019-10-26"}