{"pub": "independent", "url": "https://independent.co.uk/voices/brexit-general-election-no-deal-boris-johnson-vote-a9097386.html", "downloaded_at": "2019-09-09 23:24:54.157639+00:00", "title": "Brexit: Remainers have nothing to fear from a general election", "language": "en", "text": "On Monday, a further showdown will take place in parliament with Boris Johnson bellowing at Jeremy Corbyn that he is “frit” of a general election. In truth, the House of Commons is not scared of an election but deeply worried that if they give consent in principle, they hand a very practical power back to the prime minister: the right to determine the date of the election. There is no guarantee that it would take place before 31 October.\n\nHaving lost any trust he ever enjoyed, Johnson may yet find himself imprisoned in office, with MPs insisting that he follows the law parliament is about to agree and goes to Brussels to avert no deal by requesting an extension of Article 50.\n\nDuring this period, Johnson will holler and scream that the Labour Party, and Remainers generally, are simply running scared of the public. Meanwhile, Brexiteers will attempt to scare people about the prospect of a Corbyn premiership. On both counts they are wrong. Remainers have nothing to fear from an election so long as we work together; and because we will work together, the country has nothing to fear from Corbyn.\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nThe present polling gives Johnson an ebbing lead, but a lead nonetheless. It is likely he will strike a deal with Nigel Farage in any snap election. Perhaps Farage’s non-aggression pact in which the Brexit Party does little campaigning in swathes of the south, and the Tories do even less than usual in the north. The question for the Remain parties is how to respond.\n\nFirst, Labour has to decide – clearly and unequivocally – that it is a Remain party. After three torturous years, it is nearly there. Save for a rump of outriders, Labour is now clear that it would hold another referendum, placing whatever “deal” a new administration could exact from Brussels (in all likelihood something extremely similar to that Theresa May brought back), or Remain. They cannot hedge. Even in Leave constituencies the majority of Labour voters support Remain and expect Labour to do the same.\n\nShape Created with Sketch. Protesters take to streets after Boris Johnson suspends parliament Show all 11 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. Protesters take to streets after Boris Johnson suspends parliament 1/11 Anti Brexit protesters march on Whitehall EPA 2/11 Many of the protesters carried placards AP 3/11 A demonstrator wears a Boris Johnson mask during a London rally AFP/Getty Images 4/11 An anti-Brexit demonstrator wields an EU flag during a London rally. AFP/Getty Images 5/11 The protesters also marched to Trafalgar Square, where they blocked traffic AP 6/11 John McDonnell addressed crowds in Whitehall. PA 7/11 A small group of Brexit supporters attempted to stage a counter protest in central London. AP 8/11 Three people were arrested in London, including a woman who sat on the road near Trafalgar Square. AP 9/11 In Oxford, locals and students gathered outside Balliol College, Boris Johnson's alma mater, to protest. PA 10/11 Thousands of people gather in central Glasgow to protest against the prime minister. AFP/Getty Images 11/11 Jeremy Corbyn spoke to protesters in central Glasgow. Getty 1/11 Anti Brexit protesters march on Whitehall EPA 2/11 Many of the protesters carried placards AP 3/11 A demonstrator wears a Boris Johnson mask during a London rally AFP/Getty Images 4/11 An anti-Brexit demonstrator wields an EU flag during a London rally. AFP/Getty Images 5/11 The protesters also marched to Trafalgar Square, where they blocked traffic AP 6/11 John McDonnell addressed crowds in Whitehall. PA 7/11 A small group of Brexit supporters attempted to stage a counter protest in central London. AP 8/11 Three people were arrested in London, including a woman who sat on the road near Trafalgar Square. AP 9/11 In Oxford, locals and students gathered outside Balliol College, Boris Johnson's alma mater, to protest. PA 10/11 Thousands of people gather in central Glasgow to protest against the prime minister. AFP/Getty Images 11/11 Jeremy Corbyn spoke to protesters in central Glasgow. Getty\n\nFrom those decisions flow the possibility of a real Remain alliance, attracting the confidence of Liberal Democrats and Greens. The numbers do not add up for an overall majority for any of the Remain parties. While in usual times we may complain about the backroom dealing of coalitions, at times of crisis coalitions can lead to improved results with parties forced to abandon their idealism in favour of pragmatism.\n\nLabour will have to unshackle itself from instinctive tribalism during this election, ensuring both those parties really get something back in return for any co-operation – tacit or explicit – they offer. At Best For Britain, we are creating the most sophisticated tactical voting tool in the country. Whether political parties are mean-spirited or open-minded, voters are smart: they will use tactical voting to establish how they can stop Brexit.\n\nThe likely outcome is another hung parliament: the third to appear from the four elections of the last decade. With the SNP in the ascendant again in Scotland, and the Liberal Democrats making substantial progress against the Conservatives, Labour could be the largest party but short of a majority. This would be a benign outcome for the country, since those two parties would both strengthen Labour’s pro-European backbone, and curb the worst excesses of Corbynism.\n\nDepending on the relative strength of the parties, the prospect of a partnership government might even embolden Labour MPs to do more than clip Corbyn’s wings. They could yet evict him in favour of a more unifying figure. The Liberal Democrats’ clarity in 2010 that they could not entertain talks with Gordon Brown is a reminder of how brutal political reality can be.\n\nWhoever is in No 10, the objective should be a joint administration whose primary purpose would be to hold a people’s vote, and to rebuild Britain’s position in Europe. It is likely that once the referendum legislation is agreed, the poll has been held and – with public consent – Article 50 revoked, a further general election would be necessary. Much as voters are fatigued, Brexit has so dominated political debate that any mandate secured in its shadow will feel inadequate once the country has moved on.\n\nProgressives should use the opportunity of working together on Europe to agree clear social reforms that a new government could make – reforming taxation on wealth; boosting funding to the NHS and schools; proceeding with big infrastructure projects such as HS2 and HS3; and preparing the workforce for the fourth industrial revolution. There is a genuine chance that out of the rubble of Brexit, British politics can be rebuilt and realigned. Whether the election comes this week, or in a few weeks, I say bring it on.\n\nLord Malloch-Brown is chairman of Best for Britain, a former Labour minister and the former deputy secretary-general of the United Nations", "description": "On Monday, a further showdown will take place in parliament with Boris Johnson bellowing at Jeremy Corbyn that he is “frit” of a general election. In truth, the House of Commons is not scared of an election but deeply worried that if they give consent in principle, they hand a very practical power back to the prime minister: the right to determine the date of the election.", "authors": ["Mark Malloch-Brown"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/08/29/09/remain-voters.jpg", "published_at": "2019-09-09"}