{"pub": "politico", "url": "https://politico.eu/article/eu-mulls-new-laws-on-cats-and-dogs", "downloaded_at": "2019-10-30 15:58:51.569252+00:00", "title": "Pet project: EU mulls new laws on cats and dogs", "language": "en", "text": "A man is holding a dog at the central pedestrian shopping street on March in Bernburg, Germany. | Carsten Koall/Getty Images Pet project: EU mulls new laws on cats and dogs Brussels is identifying animal smuggling as a big problem.\n\nThe EU is moving toward new legislation to clamp down on the \"massive issue\" of cats and dogs being illegally traded across the bloc, including online pet trafficking.\n\nThe new push builds off the back of a study published by the European Commission in 2015 that said up to 200,000 puppies are estimated to be brought into Germany and Austria each year illegally, but \"no reliable information\" is available on the extent of the problem. The illegal pet trade, which centers more on trade in dogs than cats, disrupts the single market and endangers public and animal health, the report said.\n\nVeterinary experts from the EU's national capitals are now contemplating a set of draft animal welfare conclusions, seen by POLITICO, which urge the Commission to create new laws \"covering all animal species kept in the context of an economic activity for which specific animal welfare legislation does not exist at present.\"\n\nAn EU diplomat said the illegal trading of dogs and cats was “a massive issue” which “the EU wants to do something about.” The new rules could cover “how you mitigate all these pet factories, where they’re just produced for profit [and] there’s no security as far as the health certificates of the dogs.”\n\nAnimal welfare advocates welcomed the proposal. “It’s huge. We’ve been pushing for dogs and cats to be part of EU animal welfare specific laws now for more than a decade,\" said Joe Moran, senior political adviser at Eurogroup for Animals.\n\nMoran said the EU should also draw up common standards for legal pet breeding across the bloc.\n\nThere is a growing consensus in Brussels on tackling the issue of illegal pet trading, particularly online. A recent six-month European Commission monitoring initiative by 17 EU countries concluded that \"e-commerce controls today need to be strengthened.\" And 24 countries' chief veterinary officers expressed their strong support for more EU regulation to protect traded dogs and cats, in a recent Council survey.\n\nA diplomat from the Finnish presidency of the Council of the EU, which aims to present a finished version of the proposals to agriculture ministers in December, said: “The Council conclusions are not supposed to be that detailed. If the Commission decides to go further and to prepare new legislation, first they have to assess the situation and then try to figure out what to do, so there’s a lot of work to do.”", "description": "Brussels is identifying animal smuggling as a big problem.", "authors": ["Eddy Wax"], "top_image": "https://www.politico.eu/wp-content/uploads/2019/10/GettyImages-1133306756-1200x628.jpg", "published_at": "2019-10-30"}