{"pub": "abcnews", "url": "https://abcnews.go.com/GMA/Family/kids-lemonade-stand-raises-77000-cincinnati-childrens-hospital/story?id=65961705", "downloaded_at": "2019-10-01 09:27:00.920942+00:00", "title": "Kids' lemonade stand raises more than $77,000 for Cincinnati children's hospital after picture goes viral", "language": "en", "text": "The old saying goes when life gives you lemons – make lemonade. But for two Cincinnati families, the saying is more along the lines of when life gives you lemons – make lemonade, put your lemonade stand on Instagram and end up raising over $77,000 for a children’s hospital.\n\nBest friends Hillary Weidner and Amanda Zerbe each have three children who are the same age. Weidner has three girls: Beatrice, Poppy and Louise. Zerbe has three boys: Jack, Briggs and Charlie.\n\nCourtesy Hillary Weidner\n\nOver Labor Day weekend, 5-year-old Briggs told his mom he wanted to have a lemonade stand. The Zerbes set up the lemonade and the Weidner girls came to help their friends sell some cups.\n\nWeidner says the lemonade stand was set up for around 45 minutes and raked in $148 thanks to the help of their generous neighbors. The families decided they would give the money to the Cincinnati Children’s Hospital to not only teach their kids the importance of giving back, but also for a stronger personal connection.\n\nWeidner told \"Good Morning America\" that her oldest, Beatrice, was born with a rare liver disease and was placed on a list to receive a liver transplant. Thankfully, after several tests, the Weidners found out that Hillary was a perfect match. Hillary and Beatrice underwent a 12-hour side-by-side surgery at Cincinnati Children’s Hospital, where they were able to successfully remove a piece of Hillary’s liver and place it inside her daughter Beatrice.\n\n\"It was a crazy, traumatic, amazing experience,\" Weidner said. \"We owe so much to the hospital.\"\n\nCourtesy Hillary Weidner\n\nWeidner says Cincinnati Children’s Hospital has a research center where they are working to grow organs in their labs in hopes of being able to help the nearly 100,000 people who are on the organ donor waitlist. The families wanted to give the money toward advancements in science to help people waiting for organs – like Beatrice once was.\n\n\"People with Bea’s condition die waiting for organs,\" Weidner said. \"We are so fortunate that we had a match and could do that, but that’s not the case with every family.\"\n\nWeidner and Zerbe wanted to teach a lesson in giving to their kids, so they made a giant check and brought it with them to give to the hospital. Weidner snapped a photo and posted it to her Instagram and flippantly asked anyone who wanted to match the children’s donation to send her a Venmo and she would make sure the money was donated.\n\nCourtesy Hillary Weidner\n\nShe had no idea how many people would take her up on the request.\n\nThe picture of their children’s lemonade stand went viral and the donations began pouring in faster than lemonade was being poured into cups. Weidner quickly had hundreds then thousands in her Venmo account. Her post even caught the attention of some famous faces.\n\n\"Andy Cohen and Anderson Cooper are coming to Cincinnati and we have tickets, so I pinged them on my Instagram story asking if they wanted some lemonade,\" Weidner said. \"Andy then mentioned it on his Sirius XM show and pledged $5,000 to our cause on behalf of him and Anderson.\"\n\nThe total keeps climbing but as of today, their $148 has turned into over $77,000.\n\nWeidner says she thinks the lemonade stand donations have taken off because people want to be a part of something good in the world.\n\nCourtesy Hillary Weidner\n\n\"The news can be so negative. There are shootings, deaths, car accidents. We wanted to show that there are good people out there,\" Weidner said.\n\nNot only did Weidner and Zerbe want to highlight the good in the world, they also wanted to teach a valuable lesson to their children.\n\n\"Our job as parents of little kids is to raise a generation of givers,\" Weidner said. \"This was our teeny way of showing them that they can raise money for people who need it more than they do. We hope that when they’re older they will look back on this and feel excited and empowered.\"\n\nWeidner says the families will plan on having more lemonade stands in the future, even if they aren’t as lucrative.\n\n\"We would love to do an annual lemonade stand,\" Weidner said. \"Even if it only raises $50 this will be something that we continue and we want it ingrained in them that giving back is good and they can do something powerful.\"\n\nWeidner encourages people who would like to donate to Cincinnati Children's Hospital to send money through her Venmo account @hillary-weidner.", "description": "When life gives you lemons – make lemonade, put your lemonade stand on Instagram and end up raising over $77,000 for a children’s hospital.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/GMA/lemonadestand-HT-ER-190930_hpMain_16x9_992.jpg", "published_at": "2019-10-01"}