{"pub": "nyt", "url": "https://nytimes.com/2019/09/19/us/politics/intelligence-whistle-blower-complaint-trump.html", "downloaded_at": "2019-09-19 23:06:36.894346+00:00", "title": "Whistle-Blower’s Complaint Is Said to Involve Multiple Acts by Trump", "language": "en", "text": "Mr. Schiff has been locked in the standoff with Mr. Maguire over the complaint for nearly a week. He said Mr. Maguire told him that he had been instructed not to give the complaint to Congress, and that the complaint addressed privileged information — meaning the president or people close to him were involved.\n\nMr. Schiff has said that none of the previous directors of national intelligence, a position created in 2004, had ever refused to provide a whistle-blower complaint to Congress. The House Intelligence Committee issued a subpoena last week to compel Mr. Maguire to appear before the panel. He briefly refused but relented on Wednesday, and is now scheduled to appear before the committee in an open hearing next week.\n\nSenator Mark Warner of Virginia, the top Democrat on the Senate intelligence panel, said on Thursday that he and the committee’s Republican chairman, Senator Richard Burr of North Carolina, also expected both the inspector general and acting director to brief them early next week and “clear this issue up.”\n\nMr. Maguire and Mr. Atkinson are at odds over how the complaint should be handled. Mr. Atkinson has indicated the matter should be investigated, and alerted the House and Senate Intelligence committees , while Mr. Maguire, the acting director of national intelligence, says the complaint does not fall within the agencies ’ purview because it does not involve a member of the intelligence community — a network of 17 agencies that does not include the White House.\n\n[Read a pair of letters from the Office of the Director of National Intelligence about the complaint.]\n\nThe inspector general of the intelligence community “determined that this complaint is both credible and urgent, and that it should be transmitted to Congress under the clear letter of the law,” Mr. Schiff, Democrat of California, said in a statement on Wednesday evening.\n\nSenator Angus King, an independent who caucuses with the Democrats, said the law is “very clear” that the whistle-blower complaint must be handed over to Congress.\n\n“The Inspector General determines what level of concern it is,” said Mr. King, a member of the Senate Intelligence Committee. “Once the determination is made,” he added, the director of national intelligence “has a ministerial responsibility to share that with Congress. It is not discretionary.”", "description": "The complaint goes beyond a commitment that President Trump was said to have made to a world leader.", "authors": ["Matthew Rosenberg", "Nicholas Fandos", "Eileen Sullivan", "Julian E. Barnes"], "top_image": "https://static01.nyt.com/images/2019/09/19/us/politics/19dc-whistleblower-promo1/19dc-prexy-facebookJumbo.jpg", "published_at": "2019-09-19"}