{"pub": "indiatimes", "url": "https://prime.economictimes.indiatimes.com/news/71367163/technology-and-startups/fall-of-a-unicorn-can-shopclues-find-a-white-knight-to-claw-back-lost-turf-from-flipkart-and-amazon", "downloaded_at": "2019-10-12 13:01:27.933711+00:00", "title": "Fall of a unicorn: Can ShopClues find a white knight to claw back lost turf from Flipkart and Amazon?", "language": "en", "text": "Three years since its headline-grabbing fundraise, ShopClues’ journey has changed course for the worse. The online shopping platform, run by Gurugram-based Clues Network, has of late been surviving on bridge rounds, with its existing backers throwing in a lifeline. But with a large base of upwardly-mobile customers and a huge data trove on their buying habits, ShopClues has reasons to be optimistic, as India’s tier II market remains underpenetrated.\n\nShopClues holds a meeting of its sellers; courtesy of ShopClues via Facebook\n\nBut for that, ShopClues’ prospective white knight will have to take on its liabilities, pay off the USD7.7 million venture debt, and give its founders a small exit. If that doesn’t happen, ShopClues would resemble the Greek mythological character Sisyphus who rolls a giant boulder uphill, only to watch it come rolling down. ( Graphics by Mohammad Arshad) As an online retailer that set up shop in 2011 and signed up more than half-a-million merchant partners over the next five years, ShopClues used to be the unicorn everyone envied. Having raised an undisclosed sum from Singapore’s sovereign wealth fund GIC, valuing the company at around USD1.1 billion in 2016, there was no stopping this e-tailer and uphill wasBut for that, ShopClues’ prospective white knight will have to take on its liabilities, pay off the USD7.7 million venture debt, and give its founders a small exit. If that doesn’t happen, ShopClues would resemble the Greek mythological character Sisyphus who rolls a giant boulder uphill, only to watch it come rolling down. ( Graphics by Mohammad Arshad)\n\nAs an online retailer that set up shop in 2011 and signed up more than half-a-million merchant partners over the next five years, ShopClues used to be the unicorn everyone envied. Having raised an undisclosed sum from Singapore’s sovereign wealth fund GIC, valuing the company at around USD1.1 billion in 2016, there was no stopping this e-tailer and uphill was But for that, ShopClues’ prospective white knight will have to take on its liabilities, pay off the USD7.7 million venture debt, and give its founders a small exit. If that doesn’t happen, ShopClues would resemble the Greek mythological character Sisyphus who rolls a giant boulder uphill, only to watch it come rolling down. ( Graphics by Mohammad Arshad)", "description": "Three years since its headline-grabbing fundraise, ShopClues’ journey has changed course for the worse. The online shopping platform, run by Gurugram-based Clues Network, has of late been surviving on bridge rounds, with its existing backers throwing in a lifeline. But with a large base of upwardly-mobile customers and a huge data trove on their buying habits, ShopClues has reasons to be optimistic, as India’s tier II market remains underpenetrated.", "authors": ["Et Prime"], "top_image": "https://etimg.etb2bimg.com/thumb/342979/71367163.cms?width=800&height=435&overlay=etprime", "published_at": "2019-09-30"}