{"pub": "telegraph", "url": "https://telegraph.co.uk/football/2019/10/22/chelsea-defender-fikayo-tomori-reveals-extra-support-place-bulgaria", "downloaded_at": "2019-10-23 09:02:51.295251+00:00", "title": "Chelsea defender Fikayo Tomori reveals extra support in place after Bulgaria racism fall-out", "language": "en", "text": "Fikayo Tomori has confirmed that he and his new England team-mates have been offered expert support to try to ensure there are no lasting effects from the racist abuse they suffered in Bulgaria last week.\n\nChelsea defender Tomori was called up to the England squad for the first time for the Euro 2020 qualifiers against Czech Republic and Bulgaria, and witnessed the shocking racist abuse in Sofia from the substitutes bench.\n\nIt was a difficult introduction to senior international football for Tomori, but the 21 year-old is confident that the right provisions are in place for him and the rest of the England squad.\n\nSpeaking for the first time since he was part of the England squad that almost abandoned their game against Bulgaria due to racism, Tomori said: “Obviously it was a difficult experience. What we wanted to do was just play our football, to win the game and that’s what we did. When stuff like that happens you have to try and block it out even though it is so blatant.\n\n“We just wanted to go out there, play our game and win the game. The manager spoke to us after and said there was help there if needed. It’s just one of those things that happened.", "description": "Fikayo Tomori has confirmed that he and his new England team-mates have been offered expert support to try to ensure there are no lasting effects from the racist abuse they suffered in Bulgaria last week.", "authors": ["Matt Law", "Football News Correspondent", "Sam Dean", "Ipek Tugcu"], "top_image": "https://www.telegraph.co.uk/content/dam/football/2019/10/22/TELEMMGLPICT000213788246-xlarge_trans_NvBQzQNjv4BqF9BD_fYQB0teZOF4IslN2WclioocPp7CdIUOTtw1IRI.jpeg?imwidth=1200", "published_at": "2019-10-22"}