{"pub": "yahoo", "url": "https://news.yahoo.com/johnson-challenge-queen-fire-him-001723083.html", "downloaded_at": "2019-10-06 03:11:28.106205+00:00", "title": "Johnson to Challenge the Queen to Fire Him, Sunday Times Reports", "language": "en", "text": "(Bloomberg) -- U.K. Prime Minister Boris Johnson is prepared to challenge Queen Elizabeth II to dismiss him rather than resign as he attempts to push through Brexit by the Oct. 31 deadline, the Sunday Times reported, citing senior aides.\n\nJohnson would not step aside if his Brexit proposals were rejected by the European Union, and even if members of the U.K. Parliament declare no confidence in his government and agree to a caretaker prime minister to replace him, according to the report.\n\nFailure to reach a deal would set the U.K. on a course for constitutional showdown with few precedents: Johnson has promised to pull the country out of the EU on Oct. 31 whether the talks succeed, while Parliament has already legislated to prevent him from taking U.K. out of the European bloc without a withdrawal agreement.\n\n“Unless the police turn up at the doors of 10 Downing Street with a warrant for the prime minister’s arrest, he won’t be leaving,” one senior Conservative said in the report.\n\nThe last time a British monarch fired a prime minister was in 1834, it said.\n\nTo contact the reporter on this story: Dominic Lau in Hong Kong at dlau92@bloomberg.net\n\nTo contact the editors responsible for this story: Shamim Adam at sadam2@bloomberg.net, Linus Chua, Naoto Hosoda\n\nFor more articles like this, please visit us at bloomberg.com\n\n©2019 Bloomberg L.P.", "description": "(Bloomberg) -- U.K. Prime Minister Boris Johnson is prepared to challenge Queen Elizabeth II to dismiss him rather than resign as he attempts to push through Brexit by the Oct. 31 deadline, the Sunday Times reported, citing senior aides.Johnson would not step aside if his Brexit proposals were rejected", "authors": ["Dominic Lau"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-06"}