{"pub": "investing.com", "url": "https://ph.investing.com/news/commodities-news/oil-recovers-from-2week-low-uschina-trade-war-caps-gains-59402", "downloaded_at": "2019-09-30 00:50:55.039687+00:00", "title": "Oil recovers from 2-week low; U.S.-China trade war caps gains", "language": "en", "text": "Oil recovers from 2-week low; U.S.-China trade war caps gains\n\nCommodities 10 minutes ago (Sep 30, 2019 08:40)\n\n© Reuters. Oil recovers from 2-week low; U.S.-China trade war caps gains By Colin Packham\n\nSYDNEY, Sept 30 (Reuters) - Oil prices edged higher on\n\nMonday, rebounding from a two-week low in the previous session,\n\nalthough gains were checked by concerns about the outlook for\n\nthe global economy.\n\nU.S. West Texas Intermediate (WTI) crude futures rose\n\n14 cents, or 0.3% to $56.05 a barrel. WTI fell to $54.75 a\n\nbarrel on Friday, its lowest since Sept. 13, when prices closed\n\ndown 0.9%.\n\nBrent crude futures rose 21 cents, or 0.3%, to\n\n$62.12 a barrel, having dipped as low as $60.76 a barrel on\n\nFriday when prices fell 1.3%.\n\nSaudi Arabia's crown prince warned in an interview broadcast\n\non Sunday that oil prices could spike to \"unimaginably high\n\nnumbers\" if the world does not come together to deter Iran, but\n\nsaid he would prefer a political solution to a military one.\n\nYemen's Houthi movement said on Saturday it had carried out\n\na major attack near the border with the southern Saudi region of\n\nNajran and captured many troops and vehicles, but there was no\n\nimmediate confirmation from Saudi Arabian authorities.\n\nStill, oil remains under pressure as traders weigh the\n\nimpact on the global economy of a prolonged trade war between\n\nthe U.S. and China.\n\n\"With Saudi oil production mostly back online, the focus\n\nshifts again to the trade war narrative and consequential demand\n\ndevastation, which is getting intensified by the U.S.\n\nadministration's possible capital clampdown as they investigate\n\nthe efficacy of capping U.S. investment flows into China,\" said\n\nStephen Innes, market strategist, SPI Asset Management.\n\nU.S. President Donald Trump's administration is considering\n\ndelisting Chinese companies from U.S. stock exchanges, three\n\nsources said, in what would be a radical escalation of\n\nU.S.-China trade tensions.\n\nOil recovers from 2-week low; U.S.-China trade war caps gains", "description": "Oil recovers from 2-week low; U.S.-China trade war caps gains", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/news/LYNXNPEC0L0NV_L.jpg", "published_at": "2019-09-30"}