{"pub": "mirror", "url": "https://mirror.co.uk/news/us-news/girl-10-killed-shes-thrown-20574816", "downloaded_at": "2019-10-14 10:12:37.588460+00:00", "title": "Girl, 10, killed as she's thrown from 'extreme' fair ride in front of family", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA 10-year-old schoolgirl died after she was thrown from a high-speed spinning amusement ride in front of horrified family members.\n\nWitnesses described a distressing scene as the girl lay motionless on the ground after being \"ejected\" from a ride called Xtreme at a local fair.\n\nFamily members were distraught as they waited for help and the girl was airlifted to a hospital, where she was pronounced dead a short time after arriving.\n\nThe ride was shut down after the incident and amid an ongoing investigation, but the community festival continued with a partial schedule despite the tragedy and outrage amongst parents.\n\n(Image: ABC7)\n\nThe incident happened at the Deerfield Township Harvest Festival in Rosenhayn, New Jersey, on Saturday evening.\n\nWitnesses told local media that it appeared the girl was thrown or \"ejected\" from the ride and her family members were distraught at the scene.\n\nWitness Jessica Estrada Plasencia told 6 ABC: \"I have a seven-year-old and just seeing the little girl, it's so heartbreaking.\n\n\"You would think your kids would be safe. I know you ride at your own risk, but they are there to make sure your kids are secure, to make sure kids aren't going to fall off a ride.\"\n\nAllison McChesney, another witness, told CBS Philly: “It was just everyone running when I walked up to it. It was something you would never want to see.\"\n\n(Image: ABC7)\n\nThe Wisdom Super Sizzler ride hovers a few feet off the ground and has rotating arms with cars that spin passengers in a horizontal circle at high speeds.\n\nThe one involved in Saturday's tragedy had passed a recent inspection by state authorities, it was reported.\n\nAn industry analyst told CBS Philly at least 13 people have been killed or seriously injured on that type of ride in the US since 2000.\n\nKen Martin said people have been thrown off that type of ride in the past and claimed it \"goes too fast\" and there have been \"problems with lap bars\".\n\nHe added: “I myself wouldn’t feel comfortable putting the kids on those rides.\"\n\n(Image: ABC7)\n\nSaturday's incident happened at about 6.20pm and the girl was pronounced dead about an hour later after being airlifted to hospital.\n\nRides continued to operate after the incident, but some parents told local media the fair should have been shut down.\n\nWitness Amber Worley told the Inquirer a young girl approached her “crying her eyes out” after seeing the girl ejected from the ride.\n\nSkelly's Amusements, the firm that operates rides at the festival, said in a statement: \"We are absolutely heartbroken. Words cannot express our feelings and we extend our deepest sympathies to the individual’s family and loved ones.\n\n\"We ask that you keep them in your thoughts.\n\n\"We are fully cooperating with the investigation being conducted by the State Police and the Carnival and Amusement Ride unit within the Department of Community Affairs.\"\n\nThe 63-year-old, family-run company was told it could resume operating rides when the four-day festival reopened for its final day on Sunday, but it decided not to.\n\nThe Harvest Festival cancelled Sunday's parade but allowed all other events to continue \"to offer a place for the community to come together in wake of this tragedy\".\n\nPolice said the girl was \"ejected\" from the ride and officers continue to investigate the cause of the incident.", "description": "Witnesses described a distressing scene as the girl lay motionless on the ground as her distraught family waited for help at the Deerfield Township Harvest Festival in Rosenhayn, New Jersey", "authors": ["Chris Kitching", "Image"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20575173.ece/ALTERNATES/s1200/0_FAMILY-members-have-been-left-distraught-after-a-10-year-old-girl-died-from-being-thrown-from-a-ca.jpg", "published_at": "2019-10-14"}