{"pub": "guardian", "url": "https://theguardian.com/uk-news/2019/oct/14/paedophile-richard-huckle-found-dead-in-prison", "downloaded_at": "2019-10-14 11:28:41.775954+00:00", "title": "Paedophile Richard Huckle 'murdered' in prison", "language": "en", "text": "Huckle, who abused up to 200 babies and children, found dead at Full Sutton jail in Yorkshire\n\nOne of Britain’s worst predatory paedophiles, who targeted, groomed and abused up to 200 Malaysian babies and children and shared images of his crimes on the dark web, has been murdered in jail, a source has said.\n\nRichard Huckle, a photographer from Ashford in Kent, received 22 life sentences after admitting an “unprecedented and exceptional” 71 offences against children aged between six months and 12 years from 2006 to 2014. The 33-year-old, who was ordered to serve a minimum of 25 years, was found dead at Full Sutton prison in North Yorkshire on Sunday, the Guardian understands.\n\nA Prison Service spokesman said: “HMP Full Sutton prisoner Richard Huckle died on 13 October. It would be inappropriate to comment further while a police investigation is ongoing.”\n\nHuckle posed as an English teacher and philanthropist in poor Christian communities in Kuala Lumpur. Some of the 23 children identified in the charges were abused for years, including one from the age of three until 10.\n\nHe originally faced 91 charges but investigators believed the number of his victims was much higher, having found a ledger and scorecard on his computer in which Huckle awarded himself marks for different kinds of abuse of 191 girls and boys.\n\nHis catalogue of abuse stretched back to when he was 19 and on a gap year teaching in south-east Asia. He was 30 when he was jailed in 2016.\n\nSentencing Huckle, Judge Peter Rook QC, told him: “Your offending behaviour became entrenched in your everyday life. Your life revolved around your sexual activities with young children. Your distorted beliefs in respect of children are deep-seated. Your self-delusion knows no bounds.”\n\nFull Sutton is a maximum security jail with capacity for about 558 male category A and B inmates.\n\nIn 2011, the child killer Colin Hatch was strangled with ligatures torn from bed sheets at the prison. His killer, 36-year-old Damien Fowkes, was jailed for manslaughter.\n\n\n\n", "description": "Huckle, who abused up to 200 babies and children, found dead at Full Sutton jail in Yorkshire", "authors": ["Haroon Siddique"], "top_image": "https://i.guim.co.uk/img/media/7fd33243e8f3a4a425500ff5f1acf6552b449376/0_717_1596_957/master/1596.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=50e05323909e1e5ba96d93945e36c4d6", "published_at": "2019-10-14"}