{"pub": "townhall", "title": "Dale Earnhardt Jr. and Family Reportedly Doing Fine After Plane Crash in Tennessee", "url": "https://townhall.com/entertainment/cortneyobrien/2019/08/15/dale-earnhardt-jr-and-wife-doing-fine-after-plane-crash-in-tennessee-n2551789", "language": "en", "published_at": "2019-08-15", "downloaded_at": "2019-09-02 07:04:42.220079+00:00", "text": "Former NASCAR star Dale Earnhardt Jr., his wife Amy and their infant daughter Isla Rose were involved in a plane crash in Bristol, TN on Thursday at Elizabethton Municipal Airport when the athlete's jet ran off the end of the runway. He was taken to the Johnson City Medical Center to be treated for minor injuries.\n\nThe aircraft was reportedly still burning for quite some time.\n\nPHOTO of #NASCAR's @DaleJr plane at crash site at the end of the #Elizabethton airport. He was heading to @BMSupdates pic.twitter.com/Gt9O2JKab4 — Jerry Jordan (@JerryJordan_KTT) August 15, 2019\n\nTo bring comfort to panicked fans, Earnhardt's sister Kelley noted on Twitter that all is well.\n\nI can confirm Dale, Amy & Isla along with his two pilots were involved in a crash in Bristol TN this afternoon. Everyone is safe and has been taken to the hospital for further evaluation. We have no further information at this time. Thank you for your understanding. — Kelley Earnhardt (@EarnhardtKelley) August 15, 2019\n\nThe NTSB is currently investigating the crash.\n\nNTSB investigating today's crash of a Cessna 680 business jet in Elizabethton, TN. — NTSB_Newsroom (@NTSB_Newsroom) August 15, 2019\n\nEarnhardt Jr., who raced competitively for almost two decades, retired from NASCAR last year after suffering a series of concussions. He won 26 races in his career and was named NASCAR’s Most Popular Driver 15 times. In recent months he's been in the NBC booth playing the role of broadcaster.\n\nEarnhardt Jr.'s father, Dale Earnhardt, died after his car slammed into the wall while racing at the Daytona 500 back in 2001.", "description": "Former NASCAR star Dale Earnhardt Jr., his wife Amy and .09/02/2019 3:04:38AM EST.", "authors": ["Cortney O'Brien", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/264/d6e606a3-6297-4cfa-a3f7-7df64c4b89fa.jpg"}