{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/26/leading-off-felix-farewell-brennaman-calls-it-a-da", "downloaded_at": "2019-09-26 05:23:25.690251+00:00", "title": "LEADING OFF: Felix farewell, Brennaman calls it a day", "language": "en", "text": "A look at what’s happening around the majors Thursday:\n\nFAREWELL TO THE KING\n\nFelix Hernandez starts for Seattle in what well could be his last game for the Mariners. A sea of yellow-shirted fans in the “King’s Court” will rise in unison and chant as he takes the mound, and when he gets to two strikes on any hitter, and will cheer deliriously anytime No. 34 can record a strikeout against playoff-chasing Oakland.\n\nAfter 15 seasons and more time spent on the injured list than on the mound in recent years, there may not be many suitors for a 33-year-old pitcher with decreased velocity and more than 2,700 career innings on his right arm. Hernandez is 1-7 in 14 starts this season with a 6.51 ERA.\n\nThe face of the franchise for so long, his contract with the Mariners expires after the season and both sides seem ready to go their own way.\n\n“I don’t want to retire yet,” Hernandez said after his last start. “I think I can go out there and compete against anybody. It was a tough year with my shoulder. But if I get healthy, I can compete.”\n\nREST UP\n\nThe NL East champion Braves have shut down Ronald Acuña Jr. for the remainder of the regular season after the All-Star outfielder made an early exit this week because of tightness in his left hip. Atlanta manager Brian Snitker said the decision is largely precautionary, and Acuña can continue to throw and hit while sitting out the final four games.\n\nAcuña has 41 homers, 101 RBIs and 37 stolen bases. He’s also scored a NL-high 127 runs. The Braves start the NL Division Series on Oct. 3 at SunTrust Park - their opponent hasn’t been determined yet.\n\nCALLING IT A DAY\n\nReds broadcaster Marty Brennaman wraps up his long career in the booth when Cincinnati hosts Milwaukee at Great American Ball Park. He’s retiring after this season, his 46th with the Reds.\n\nThe 77-year-old broadcaster known for his pull-no-punch descriptions and his “this one belongs to the Reds” sign-off isn’t going on the season-ending road trip to Pittsburgh.\n\n“Thursday will be the hardest day of my life, I think,” Brennaman said earlier this week, “I think that will be a tough one.”\n\nCHECK HIM\n\nThe Cardinals will see how pitcher Michael Wacha is feeling, a day after he was pulled from a start at Arizona in the second inning because of tightness in his right shoulder. Manager Mike Shildt said more would be known during an off day for the NL Central leaders.\n\nWacha has pitched well recently, but is 0-3 in 10 starts since rejoining the rotation in early August.\n\nThe Cardinals host the Cubs this weekend, trying to hold their 1 1/2-game division lead over Milwaukee.\n\nLAST DANCE?\n\nHard-throwing Zack Wheeler (11-7, 3.99 ERA) makes what could be his final appearance for the Mets when he starts at home against Miami. The 29-year-old righty can become a free agent after the season.\n\nWheeler was a premier prospect when New York acquired him from the San Francisco Giants for Carlos Beltran in July 2011 and has spent his entire major league career with the Mets, missing two full seasons following Tommy John surgery. But he’s bounced back to win 23 games and throw nearly 370 innings over the past two years.\n\n“Everybody wants this guy, I’m sure,” manager Mickey Callaway said. “So we’ll see what happens.”\n\n___\n\nMore AP MLB: https://apnews.com/MLB and https://twitter.com/AP_Sports\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "A look at what's happening around the majors Thursday:", "authors": ["The Washington Times Http", "The Associated Press"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/09/26/mariners_orioles_baseball_18324_c0-97-2333-1457_s1770x1032.jpg?fff7e0ac793adb7554da80709978c76b501424ba", "published_at": "2019-09-26"}