{"pub": "guardian", "url": "https://theguardian.com/society/2019/sep/15/how-safe-is-vaping-e-cigarettes-deaths-bans", "downloaded_at": "2019-09-15 09:22:07.366440+00:00", "title": "After six deaths in the US and bans around the world – is vaping safe?", "language": "en", "text": "In politically fractious times, vaping has achieved the impossible. It has morphed into a common enemy for those at opposite ends of the political spectrum.\n\nMichael Bloomberg, the former mayor of New York, pledged that his foundation will spend $160m fighting youth vaping, while Donald Trump has unveiled plans for a ban on flavoured e-cigarettes to protect, as he put it, “innocent children”.\n\nThe president’s announcement came after the deaths of six people in the US who had used vape pens and e-cigarettes. At least a further 450 people have been hospitalised for lung diseases related to vaping, with many complaining of shortness of breath, coughing, chest pain, fatigue, vomiting and fevers.\n\nBut Trump’s position has itself sparked alarm among some health campaigners.\n\n“In the US every day, almost 2,500 children under 18 years of age try their first cigarette, more than 400 of them will become daily smokers,” said Deborah Arnott, chief executive of Action on Smoking and Health. “Half of all long-term smokers will ultimately die from smoking, amounting to 480,000 Americans a year. Children in the US commonly start by smoking menthol cigarettes, so why is the Trump administration leaving menthol cigarettes legal, while banning all flavours in e-cigarettes?”\n\nScientists from Yale and Duke universities have one answer. In 2018 they set out to establish whether the chemicals used to make the flavours – everything from creme brulee to mint – remained stable in e-cigarette liquids or underwent reactions.\n\nTheir work was important. As the scientists explained in an introduction to the study, published in the journal Nicotine & Tobacco Research, “vaping electronic cigarettes is increasingly popular with youth, driven by the wide range of available flavours”.\n\nAlthough its findings were largely ignored outside scientific circles, the study is now being revisited given the events in the US, which have alarmed millions of parents. Today some 1.5 million teenagers use e-cigarettes in the US, something that prompted former head of the Food and Drug Administration Dr Scott Gottlieb to label the phenomenon an epidemic.\n\nSven-Eric Jordt, one of the authors of the 2018 flavours study, told the Observer that their work had confirmed that “the liquids vaporised by e-cigarettes are chemically unstable and form new chemicals that irritate the airways and may have other toxic effects”.\n\nE-cigarette liquids supposedly contain far fewer chemicals – as little as a handful – than traditional cigarettes and are therefore deemed safer. But the flavours study raises as many questions as it answers – not least how many chemicals are in e-cigarettes.\n\nJordt continued: “We observed that these chemicals, when mixed during manufacturing, quickly undergo chemical reactions producing many more chemicals. For example, we observed that flavour chemicals (vanilla, fruit flavour) and the vapour carrier chemicals (propylene glycol, glycerin) react to produce chemicals named acetals.\n\n“This occurs at normal room temperature already, and we found that these compounds are enriched in the vapour and inhaled by users. This was unexpected and raised concerns since nothing is known about the inhalational safety of these compounds. In toxicological tests, we found that these compounds are strong irritants and we are currently researching whether they may harm cells in the lung.”\n\nFacebook Twitter Pinterest The array of flavoured liquids sold by vape shops has been key to attracting e-cigarette smokers. Photograph: Mark Ralston/Getty\n\nThe flavours study, which found toxic levels of chemicals in some flavours, was just one of many published in the past two years that raised questions about the health risks associated with e-cigarettes.\n\nIn the past three months, studies have suggested that exposure to nicotine-free e-cigarettes harms the cardiovascular system of healthy young adults; that daily e-cigarette use is associated with increased risk of myocardial infarction; that vapour from e-cigarettes may impair the cells lining the lungs; and that vaping may hamper the lungs’ ability to fend off infections.\n\nBut a plethora of reports have also made the case for vaping, especially when compared with the health risks associated with smoking. Many of these studies are funded by e-cigarette firms and should be viewed with caution, according to Elliott Reichardt, a research associate at the University of Calgary, who, in a report for the Conversation, observed: “It is telling that studies published by the e-cigarette and tobacco industry are approximately 90 times more likely to find that e-cigarettes cause no harm than those published without such conflicts of interest.”\n\nIt’s no wonder that vapers are confused.\n\nOutside a vape shop in central London last Wednesday, Eve explained that she started vaping in order to stop smoking. “I generally feel better while vaping than smoking cigarettes,” she said, adding that it was cheaper and did not leave a lingering smell. Now, though, she worries that she is vaping more than she would have originally smoked and has growing “concerns about its safety” after reading recent reports.\n\nHarry said he had begun using e-cigarettes to replace smoking but gave them up after health concerns in the US made him think again: “I started having some pain when breathing and I thought it is better to be safe and just stop.”\n\nOne of the shop’s assistants insisted they had no worries about the safety of vaping. Another stressed: “I’d rather be vaping for five years than smoking for five years. If I wasn’t vaping, I’d be smoking and that’s a lot more harmful.”\n\nThis is the line pushed by the industry in the UK as it seeks to distance itself from mounting concern in America where vaping, freed from heavy advertising restrictions, has been heavily marketed at young people.\n\nElectronic cigarettes are just as harmful as regular cigarettes, and any claim otherwise is equivalent to saying a heart attack is less harmful than cancer Israel Cancer Association\n\n“In the UK, we are proud to be a standard bearer for a consumer-driven industry which has already helped millions of people across the world stop smoking,” said Dan Marchant, a spokesman for the UK Vaping Industry Association. “We will continue to work with the public health community in the UK to spread the facts about vaping, which Public Health England [PHE] continue to advise is 95% less harmful than smoking and is the most effective way for the UK’s remaining seven million smokers to quit.”\n\nThe 95% claim was controversial when it was made in 2015. Not only were there concerns about how the figure was determined, but one of the authors of a crucial paper used to make it was a consultant to an e-cigarette distributor.\n\nNevertheless, Professor John Britton, director of the UK Centre for Tobacco & Alcohol Studies, supports the PHE position: “PHE has promoted electronic cigarettes as a health reduction strategy. The most recent figures on children aged 11 to 16 show continued linear decline in smoking. Although people are experimenting with e-cigarettes, it’s certainly not making them smokers.\n\n“Adult rates are falling by around 0.9% per year on average – twice as fast as the US and about three times as fast as Australia, where electronic cigarettes are prohibited.\n\n“If you buy decent stuff from a reputable supplier we can’t guarantee that it is safe but we can guarantee it’s an awful lot safer than smoking. I think PHE has got it absolutely right and we should carry on like this.”\n\nBut Britton admits he has concerns about flavours.\n\n“Most of the harm in vapour, it seems to me, comes from flavours. It would be reasonable to say ‘let’s have no flavours’, but a lot of smokers say they can’t tolerate inhaling straight nicotine vapour. For many vapers who were smokers, flavour is a key part of the success of moving on to vaping. I think there is a case for trying to limit the number of flavours available. There are thousands and thousands of them and I can’t believe we need quite so many.”\n\nBut PHE’s position on e-cigarettes is at odds with other countries’ health authorities.\n\n“Electronic cigarettes are just as harmful as regular cigarettes, and any claim otherwise is equivalent to the claim that a heart attack is less harmful than cancer,” the Israel Cancer Association declared in July.\n\nIndia is pushing for a ban on e-cigarettes while Denmark’s health authority said last week that everyone should avoid e-cigarettes, “but particularly children, youth and women who are pregnant or nursing”.\n\nRespected transnational health bodies are also more vocal about their concerns. In May, the European Respiratory Society Tobacco Control Committee issued a highly critical statement about e-cigarettes headlined: “E-cigs … are harmful and do not help smokers to quit”.\n\nAnd back at home, PHE’s position bewilders some health experts.\n\n“Most of the tobacco control community is taking it [vaping] cautiously,” said Simon Capewell, professor of clinical epidemiology at the University of Liverpool. “But the UK is offering a bizarre national experiment. There is huge enthusiasm driven by clinicians who are dealing with patients crippled by bronchitis and cancer and who believe that anything that can get addicted smokers to stop is a good idea. The problem is that the evidence for cessation is not that good – it’s no better than cold turkey or nicotine patches.”\n\nCapewell, and Martin McKee, professor of European public health at the London School of Hygiene and Tropical Medicine, are two of the most vocal critics of PHE’s position on e-cigarettes, regularly wading into a debate riven with acrimony.\n\nWhat is the tobacco industry doing? Buying up electronic cigarette companies as fast as it can and pushing vaping very hard Professor Simon Capewell\n\n“Unfortunately, it’s all black and white, with no shades of grey,” Capewell said. “People like myself are accused of wanting to kill smokers, of ignoring the evidence.”\n\nPart of the problem, Capewell believes, is that currently science lacks robust evidence: “It’s a fairly new activity, so there is a shortage of information on long-term effectiveness and long-term harm. In the public health world, in that situation we normally adopt a cautionary principle. This has been learned the hard way with the magic insulation material called asbestos and the magic drug for feeling sick when pregnant that was Thalidomide.”\n\nBut fears that the UK is storing up problems for the future by fostering a US-style teen vaping epidemic are misplaced, according to Arnott.\n\n“The 2019 Ash survey finds that in the UK youth vaping is nowhere near epidemic levels, with regular vaping remaining rare, and that young people vape mainly just to give it a try, not because they like the flavours or think it’s cool.”\n\nAnd yet even the most recent Ash survey found that the percentage of 11- to 18-year-olds who are vaping increased from 3.4% in 2018 to almost 5% in 2019.\n\nAdmittedly, these were occasional vapers, but the entrance to the UK of the American e-cigarette brand Juul in 2018 – whose sleek and shiny products, complete with USB charging ports, have been compared to iPods – threatens to be a game-changer.\n\nJuul is huge in the US where the company finds itself in the invidious position of being prosecuted by the state of North Carolina and subject to a congressional committee investigation.\n\nIn court documents outlining the case against Juul, North Carolina observes that e-cigarette usage between 2017 and 2018 increased by 78% among US high school pupils and claims: “Juul has played a central role in fostering the epidemic of e-cigarette use among youth. Over the past year, Juul’s share of the e-cigarette market has risen from 24% to 75% and its brand name is so well-known that it has become a verb.”\n\nFacebook Twitter Pinterest The vaping industry pushes the line that smoking real cigarettes is far more harmful than puffing e-cigarettes. Photograph: Jon Cartwright/Getty\n\nAccording to North Carolina’s lawyers, Juul “deliberately designed the flavours, the look, and even the chemical composition of the e-cigarettes, to appeal to youthful audiences, including minors …. To further ease new smokers into the habit, Juul manipulated the chemical content of its e-cigarettes to make the vapour less harsh on the throats of young and inexperienced smokers ….\n\n“Juul has consciously chosen social media platforms and marketing channels that are known to attract minors, has used models who look like teenagers or very young adults, and has sought out and paid youth-oriented sponsors and influencers popular among teenagers to spread the popularity of Juul’s youth-focused brand identity among the young.”\n\nSuch tactics may seem familiar: seemingly lifted straight from big tobacco’s playbook. But perhaps this should not be surprising. Altria, owner of the Marlboro cigarette brand in the US, has a 35% stake in Juul.\n\nA spokesman said: “Juul Labs has never marketed to youth. Our mission is to improve the lives of adult smokers by eliminating cigarettes and we remain adamant that no underage person or non-nicotine user should use our product – it is not intended for them and is antithetical to our mission.”\n\nCapewell points out that big tobacco has a five-decade track record of “saying one thing and doing the other” and, therefore, the public should be especially suspicious of e-cigarette firms owned by conventional cigarette firms.\n\n“What is the tobacco industry doing?” Capewell asked. “Buying up electronic cigarette companies as fast as they can and pushing vaping very hard. If vaping was a fantastic way to stop smoking, they’d be cutting their own throats.”\n\nBritton, though, is concerned that the backlash against e-cigarettes will be to the detriment of UK smokers.\n\nThe day the US unveiled its flavour ban, tobacco stocks went up. As analysts at Cowen Equity Research asked in a note shared with investors, “Flavour ban coming, boon for cigarettes?”\n\n“Tobacco cigarettes cost the smoker one day of life for every four days they smoke,” Britton said. “It is by far in a way the most lethal legal product on the market. It’s inconceivable that e-cigarettes are as harmful as that.\n\n“There will be cases of disease caused by vaping but, at the moment, 100,000 people a year die from tobacco. It’s not going to be 100,000.”\n\nAdditional reporting by Tali Fraser", "description": "In Britain, e-cigarettes are seen as central to the fight against smoking, but many experts believe the evidence is contradictory", "authors": ["Jamie Doward"], "top_image": "https://i.guim.co.uk/img/media/b605efea59b63ca26f934ca087c0e889604f3978/0_0_5616_3370/master/5616.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdG8tZGVmYXVsdC5wbmc&enable=upscale&s=b81bad709b9cecfae360788225dfe2b9", "published_at": "2019-09-15"}