{"pub": "breitbart", "url": "https://breitbart.com/entertainment/2019/10/22/hillary-clinton-fuels-2020-buzz-with-beyonce-quote-about-taking-power", "downloaded_at": "2019-10-23 08:48:47.673642+00:00", "title": "Hillary Clinton Fuels 2020 Buzz with Beyoncé Quote About Taking Power", "language": "en", "text": "Hillary Clinton on Tuesday kicked up more 2020 buzz after posting a quote from pop megastar Beyoncé about the need to take power, praising the sentiment and adding, “Beyoncé speaks the truth.”\n\nThe failed presidential candidate posted the quote from the “Halo” singer on Instagram on Tuesday. It read, “Power’s not given to you. You have to take it.”\n\n“@Beyonce speaks the truth,” Clinton wrote as her caption alongside the hashtag #GutsyWomen — an homage to her latest children’s book.\n\nClinton’s comment was met with a load of backlash from commenters.\n\n“Or in your case, buy it,” one user wrote.\n\n“This seems to be contradicting the principles of democracy!” another reminded the failed Trump challenger.\n\n“And you have stolen yours,” another commented. “Corruption is your power.”\n\nHowever, there were also many users who praised Clinton for essentially courting Beyoncé’s fan base, which refers to itself as the “Beyhive.”\n\n“Take that White House, Hillary!!” one wrote, with another adding, “I hope Beyoncé is the first woman president.”\n\nThe post also fueled speculation surrounding the possibility of a 2020 run, which Clinton has teased in recent weeks. Earlier this month, President Trump tweeted that “Crooked Hillary” should join the race “to try and steal it away from Uber Left Elizabeth Warren” as long as she explains “all of her high crimes and misdemeanors including how & why she deleted 33,000 Emails AFTER getting ‘C’ Subpoena!”\n\nClinton replied, “Don’t tempt me. Do your job.”\n\nDon’t tempt me. Do your job. — Hillary Clinton (@HillaryClinton) October 8, 2019\n\nHer recent remarks on PBS NewsHour furthered speculation. Clinton told the outlet that she could “obviously” beat Trump “again.”\n\n“Maybe there does need to be a rematch. I mean, obviously, I can beat him again,” she said. “But, just seriously, I don’t understand. I don’t think anybody understands what motivates him, other than personal grievance, other than seeking adulation.”\n\nPolitical commentator and former Bill Clinton adviser Dick Morris said this week that there is a chance the former secretary of state will launch another presidential bid.\n\n“I think it’s always possible that Hillary runs,” Morris said during an appearance on The Cats Roundtable on Sunday. “You know, John, there’s a test you can do at home. Just put your fingers on her wrist, and if you feel a pulse, you know she’s going to run.”\n\nThis is far from the first time Clinton has tried to use the Grammy-winning singer to boost her political and cultural status. Clinton made an appearance at Jay-Z’s “get-out-the-vote rally” in Cleveland, Ohio, in 2016, where Beyoncé delivered a passionate speech in support of the then-Democrat nominee.\n\n“We have to vote. The world looks to us as a progressive country that leads change. Eight years ago, I was so inspired that my nephew, a young black child, could grow up knowing his dreams could be realized by witnessing a black president in office,” Beyoncé said. “And now, we have the opportunity to create more change. I want my daughter to grow up seeing a woman lead our country and know that her possibilities are limitless.”\n\n“We have to think about the future of our daughters, of our sons, and vote for someone who cares for them as much as we do,” she added. “And that is why, ‘I’m with her.'”", "description": "Hillary Clinton on Tuesday kicked up more 2020 buzz after posting a quote from pop megastar Beyoncé about the need to take power.", "authors": ["Hannah Bleau"], "top_image": "https://media.breitbart.com/media/2019/10/Beyoncehillary1-640x335.jpg", "published_at": "2019-10-22"}