{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7600555/Scarlett-Moffatt-claims-Namibian-tribe-praised-strong-body.html", "downloaded_at": "2019-10-22 14:04:11.432438+00:00", "title": "Scarlett Moffatt claims Namibian tribe praised her 'strong' body", "language": "en", "text": "Scarlett Moffatt has said she's never felt happier in her skin than when she moved into a tribal village in Namibia to film new TV show, The British Tribe Next Door.\n\nThe 29-year-old Gogglebox star appeared on This Morning on Tuesday and said the people she met there embraced her body shape and called her 'strong.'\n\nShe said: 'I honestly have never felt no judgement at all, my friends there kept saying we wish we had your rolls of fat.\n\nScroll down for video\n\n'We wish we had your rolls of fat': Scarlett Moffatt told This Morning on Tuesday a Namibian tribe praised her 'strong' body after she moved into a tribal village for a new TV show\n\nScarlett's family home from County Durham home was recreated in Namibia for The British Tribe Next Door and members of the tribe moved in to experience what Scarlett's life was like\n\n'Candithico [Scarlett's BFF in Namibia,] was saying you look strong and it looks like your dad's cattle are healthy.\n\n'I've never felt so not judged and happy to be in my own skin. just feel like all my day is consumed with how I look. It's not a thing there. The most amazing thing is they all said I looked beautiful.'\n\nScarlett has said that filming the show has made a difference to how she feels about herself.\n\nConfident: Scarlett is finally feeling happy within her skin and looked lovely in a floral dress (left) after admitting in 2017 she was miserable when she was slim (pictured in 2017 - right)\n\nShe said: 'We went there in May and we're still having more meals together [as a family].\n\n'It doesn't sound like a big thing but I'm getting the tops of my arms out sometimes on show.'\n\nIn the Channel 4 programme, which airs on Tuesday, Scarlett lives alongside the Himba community in a Namibian tribal village.\n\nAnd they in turn move into her County Durham family home.\n\nKind words: Scarlett was told her body looks 'strong' and was told 'it looks like your dad's cattle are healthy' as the tribe complimented her body shape\n\nShe said: 'I've never felt so not judged and happy to be in my own skin. just feel like all my day is consumed with how I look. It's not a thing there'\n\nWhile they didn't travel to County Durham, an exact replica of the home was built in a remote corner of Africa, so the two families could live side-by-side.\n\nTwenty thousand of their possessions, from beds to scatter cushions where transported from their home to Africa.\n\nThe home looked so similar that Scarlett said: 'When I watch it, it looks crazy! That is my mam and dad's house exactly how it is.\n\n'Sometimes I would wake up of a morning and forgot I was in Namibia and see a herd of goats in the garden.\n\nPainstaking: Twenty thousand of their possessions, from beds to scatter cushions where transported from their home to Africa\n\nScarlett said: 'It's such an amazing experience, with my family we haven't done anything all together since Gogglebox'\n\n'It's such an amazing experience, with my family we haven't done anything all together since Gogglebox.'\n\nScarlett admitted that doing the show has made her want to focus more on her own family.\n\nShe said: 'My best friend out there asked why we have so many things. I think maybe because I'm a bit big headed I assumed they would love the house.\n\n'I don't do any cleaning, but my mam taught her best friend about the washing machine, she said you're just lazy you're letting the machines do all the work.\n\n'They found us very isolated and I know we would say oh we're very independent.\n\n'Candithico said to me and my little sister, \"Why do you let your nan sleep in a room on her own\"?'\n\n'I think we're like the Dounty Durham Von Trapps and spend a lot of time together, and being there has made me realise we don't.'\n\nThe British Tribe Next Door is in on C4 at 9.15pm on Tuesday.", "description": "Scarlett Moffatt has said she's never felt happier in her skin than when she moved into a tribal village in Namibia to film new TV show, The British Tribe Next Door.", "authors": ["Rebecca Davison For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/22/14/20038130-0-image-a-56_1571752677765.jpg", "published_at": "2019-10-22"}