{"pub": "yahoo", "url": "https://news.yahoo.com/see-10-warthog-could-wipe-074000653.html", "downloaded_at": "2019-09-18 05:10:39.770617+00:00", "title": "See This A-10 Warthog? It Could Wipe Out Iran's Swarm Boats in a War", "language": "en", "text": "Key Point: Defeating swarms with A-10 Warthogs isn’t exactly revolutionary but that isn’t so much a problem. The plane isn’t a high-tech laser, but it doesn’t need to be.\n\nIt doesn’t necessarily take the resources of a major nation-state to challenge U.S. Navy warships. China for instance is building up a large navy and invests in long-range, ship-killing missiles. Iran can’t build a large navy but it does invest in swarms of small missile boats.\n\nLike a swarm of insects, a swarm of boats can pose a threat as a larger, far more expensive warship might not be able to swat them all — and a single missile with enough punch can be devastating.\n\nSo the U.S. military is practicing with ways to defeat such a potential threat with tank-killing A-10 Warthogs.\n\nOn Feb. 6, 2017, the low- and slow-flying Warthogs together with Canadian CF-18 Hornets carried out simulated attacks on dozens of boats in Florida’s Choctawatchee Bay. The planes didn’t drop any ordnance, however, as the boats were being piloted by local captains hired by the Air Force.\n\nThese were simply mock attack runs. An Air Force news release also noted that the civilian sailors practiced “realistic swarm attack formation maneuvers” with mocked-up machine guns fitted to their boats.\n\nThe 1980s-vintage Warthogs — built around a 30-millimeter rotary cannon and capable of carrying a variety of bombs and missiles — did fire inert rounds on unmanned boats at a different time during the exercise. The munitions expended during that other phase of the exercise also included delta-wing AGM-65 Maverick missiles and 500-pound laser-guided bombs.\n\n“We evaluate precision guided munitions against realistic targets with realistic enemy defenses,” Lt. Col. Sean Neitzke of the 86th Fighter Weapons Squadron said.\n\nRead the original article.", "description": "At least that is the plan.", "authors": ["Robert Beckhusen"], "top_image": "https://s.yimg.com/uu/api/res/1.2/mYvU19OWmrFL54wWaeNCGA--~B/aD05MDc7dz0xNDQwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/https://media.zenfs.com/en/the_national_interest_705/d248d76f593d928bafbd9858a21d5e0d", "published_at": "2019-09-16"}