{"pub": "investing.com", "url": "https://investing.com/news/economic-indicators/norway-delivers-rate-hike-most-economists-werent-expecting-1981499", "downloaded_at": "2019-09-19 23:50:41.904742+00:00", "title": "Norway Delivers Rate Hike Most Economists Weren't Expecting", "language": "en", "text": "(Bloomberg) -- Norway’s central bank broke further away from the pack, delivering its fourth interest-rate increase in a year in an effort to cool an economy stoked by oil investments.\n\nNorges Bank raised its benchmark rate by a quarter of a percentage point to 1.50% on Thursday, the highest level in almost five years. Four of the six biggest Nordic banks had expected the move, but most other forecasters didn’t.\n\nThe krone rose as much as 0.5% against the euro but pared most of those gains as Norges Bank signaled it was unlikely to deliver more tightening for now.\n\n“The executive board’s current assessment of the outlook and balance of risks suggests that the policy rate will most likely remain at this level in the coming period,” Governor Oystein Olsen said in a statement.\n\nDubbed by local economists as one of the “last hawks,” Norges Bank has stood out for its commitment to tightening as both the European Central Bank and the Federal Reserve deliver more stimulus. Fed Chairman Jerome Powell on Wednesday pointed to the fallout of a global trade war as something that should give monetary policy makers pause.\n\nOlsen presented Norway’s rate decision on a day full of central bank announcements. Moments earlier, the Swiss National Bank had kept its main rate at a record low of minus 0.75%, following a cut by the Fed late on Wednesday.\n\nNorway’s decision shows that “the rate path is marginally lower from June and signals that Norges Bank is basically done hiking rates,” said Joachim Bernhardsen, an analyst at Nordea in Oslo, said in a note to clients. “However, they maintain a small hiking bias indicating that a hike is more likely than a cut next year.”\n\nThe Norwegian economy has so far proved resilient. That’s allowed the government, which is backed by the world’s largest sovereign-wealth fund, to provide the kind of stimulus that most other European nations can only dream of. Norway will spend the equivalent of almost 8% of GDP this year to plug a budget shortfall. Against that backdrop, unemployment has stayed below 4% and inflation is above target.\n\nOlsen has avoided unconventional policies, such as negative rates and asset purchases, and instead opted for a strategy he calls “leaning against the wind” to fight financial imbalances. Recent gains in the price of oil and a persistently weak Norwegian krone underpin the central bank’s commitment to tightening.\n\n(Adds economist comment.)", "description": "Norway Delivers Rate Hike Most Economists Weren't Expecting", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/content/pic6a497c954c40fbe7bd3f69996e3135a0.jpg", "published_at": "2019-09-19"}