{"pub": "mirror", "url": "https://mirror.co.uk/sport/football/news/breaking-david-de-gea-comes-20587426", "downloaded_at": "2019-10-15 23:08:25.879588+00:00", "title": "David de Gea injured for Spain in huge blow for Man Utd ahead of Liverpool clash", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest football stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nDavid de Gea has suffered an injury in Spain's Euro 2020 qualifier with Sweden in what could be a huge blow for Manchester United.\n\nThe Red Devils shot-stopper was clearing the ball when he appeared to pull his groin, and immediately dropped to the ground in clear pain.\n\nDe Gea was able to walk off the pitch and was replaced by Chelsea keeper Kepa Arrizabalaga, but will be in a race to get fit ahead of the weekend when Manchester United play host to bitter rivals Liverpool in the Premier League.\n\nSpain boss Robert Moreno confirmed De Gea had played through the pain before having to make way on Tuesday night.\n\n\"He had pain in the abductor muscle but he received treatment at half-time and wanted to keep playing,\" said Moreno. \"He gave us his word, but in the end he couldn't continue.\"\n\n(Image: Anders Wiklund/TT/EPA-EFE/REX)\n\n(Image: Sky Sports)\n\nDe Gea was making his first start for Moreno and his 41st for his country.\n\nThe United stopper has been playing second fiddle to Kepa throughout 2019, with Luis Enrique's successor having preferred the Basque in every game since stepping up to be head coach.\n\nHowever, Kepa's late error in Norway on Saturday night - giving away an injury time penalty in the 1-1 draw - saw De Gea promoted back to the lineup in Stockholm.\n\nDe Gea was in a contract stand-off at Manchester United for some time but last month penned a new deal until 2023.\n\n\"Now my future is fixed, all I want is to help this team achieve what I believe we can and win trophies again, together,\" said the Spaniard upon signing.\n\n(Image: SkySports)\n\n(Image: TT News Agency/AFP via Getty Ima)\n\n\"It has been a privilege to spend eight years at this great club.\"\n\nDe Gea was signed by Sir Alex Ferguson and won the Premier League title in 2013.", "description": "The Manchester United shot-stopper walked off the pitch with what appeared to be a groin injury", "authors": ["Jake Polden", "Image", "Anders Wiklund Tt Epa-Efe Rex", "Sky Sports", "Skysports", "Tt News Agency Afp Via Getty Ima"], "top_image": "https://i2-prod.mirror.co.uk/article20587418.ece/ALTERNATES/s1200/0_DeGea.jpg", "published_at": "2019-10-15"}