{"pub": "vice", "url": "https://vice.com/en_us/article/wjw43z/we-talked-to-hearthstone-pro-players-who-are-quitting-the-game-in-protest", "downloaded_at": "2019-10-09 22:08:49.877312+00:00", "title": "We Talked to 'Hearthstone' Pro Players Who Are Quitting the Game In Protest", "language": "en", "text": "Ever since Blizzard suspended Hearthstone pro Chung “Blitzchung” Ng Wai on Tuesday for speaking up in support of Hong Kong’s ongoing political protests, the company has been quiet. But the esports machine keep grinding, and yesterday, the previously scheduled American Collegiate Hearthstone Championship was underway. During the tournament’s stream, as team American University was about to lose, they held up a sign saying “Free Hong Kong, Boycott Blizz.” The camera cut away, and the casters pretended like nothing happened.\n\n“I have 15,000 rounds of Hearthstone, I’m done,” 19-year-old college student Casey Chambers, one of the three American University team members on the stream, told me this afternoon on Discord. “The game we lost last night was my last game of Hearthstone ever.”\n\nAll three on the stream—Casey, 19-year-old Corwin Dark, and another player who wanted to go by their online handle, TJammer—felt the same about Blizzard’s response to Blitzchung.\n\n“When we met for practice that day before the tournament, we were all thinking the same thing: that we wanted to do something,” said Dark. “Because, obviously, we were the first thing on Blizzard's stream after they made the decision. If we did nothing, we were missing a pretty big opportunity.”\n\nCombined with the NBA’s ongoing controversy with China, what started as a ban of one player has sparked a larger backlash against Blizzard. It’s prompted several prominent U.S. senators to (sometimes cynically) weigh in, and opened the door to larger, more probing questions about American and Chinese business relationships. A small group of Blizzard employees reportedly held a small protest at work.\n\nThe trio’s original plan was to bring up the Hong Kong protests when American University won the match, but they had a backup plan, in case things went sour. Which they did.\n\n“We liked that because it would force Blizzard to either pan away from our camera, or cut our camera off, which they did a little bit during the match,” said Dark.\n\nNone of them have heard from Blizzard about what happened, though at some point, the company will have to talk; on Thursday, they’re supposed to continue forward in the tournament. Either way, they don’t plan to continue playing in the tournament, but they do want Blizzard to make the decision to kick them out and ban them because of their protest.\n\n“Us getting banned is probably the correct decision,” said Chambers. “But what's so disconcerting about the Blitzchung situation is that it wasn't just a fine, it wasn't just a one week suspension from Grandmasters. It was ‘You're gone, everything you've earned up until now is gone, and oh by the way the two casters who just happened to be on the stream while his protest took place are also fired.’”\n\nWhen Blizzard penalized Blitzchung, it didn’t just ban him from Hearthstone competition for an entire year, but took away their $3,000 in winnings and fired two casters who, caught surprised by Blitzchung’s decision, attempted to hide under their desks during the protest.\n\n“It was clearly designed to send a message to somebody,” said Dark.\n\nDark, who claimed to have been following the Hong Kong protests since the start, said he wakes up and checks the Hong Kong subreddit every morning for updates on their progress.\n\n\"We were the first thing on Blizzard's stream after they made the decision. If we did nothing, we were missing a pretty big opportunity.”\n\n“I honestly have been feeling guilty in the weeks and months leading up to this because I haven't been super active,” said Chambers, who said a recent local protest in support of Hong Kong conflicted with a school event. “I think this was the opportunity of a lifetime, and there was no way I was going to let this go past.”\n\nNeither expected much from their protest, let alone for it to blow up. When Dark went to sleep, a single reddit post had roughly 30 upvotes. Nothing. When he woke up a few hours later, a friend messaged, letting him know they were the number one post on Hearthstone’s reddit, a place, like many other Blizzard communities, that’s been utterly thrown into chaos.\n\nTo some degree, the group understands the position Blizzard is in.\n\n“We understand that Blizzard doesn't want political messaging,” said Chambers.\n\n“I think what I'd like to see from Blizzard, personally, and I think Casey would echo this,” said Dark, “is they need to clearly delineate that their role as a game maker will not include censoring the speech of casters.”\n\nSuch a stance would probably be tough for Blizzard, as it tried to figure out where to draw the line. What political speech is appropriate? How much political speech is too much? Whose speech is OK? There's a reason game companies have notoriously tried to distance themselves from \"politics.\" And notably, part of the criticism against the company’s disproportionate response to this situation has been their ongoing tolerance of homophobia and racism among its players.\n\nOne place to start, the two agreed, was reinstating Blitzchung into competitive Hearthstone.\n\n“If they really do make amends, genuinely, then I'd love to go back to playing Hearthstone with my friends and enjoying the game,” said Dark. “But if it's a superficial response? There's a lot of other games out there.”\n\nChambers joked about transitioning to God’s Unchained, a rival card battling game that quickly pounced on the Blitzchung news and offered to match his winnings and a guaranteed spot in the company’s upcoming $500,000 tournament, attaching the hashtag #freegaming.\n\n“My God's Unchained career starts tomorrow, I guess,” he joked.\n\nSeriously?\n\n“On the record,\" he said, “yes. [laughs]”\n\nFollow Patrick on Twitter. If you work at Blizzard and want to reach out anonymously, drop an email: patrick.klepek@vice.com. He's also available privately on Signal.", "description": "A trio of college students decided to hold up a \"Free Hong Kong, Boycott Blizz\" sign when they realized Blizzard would have no choice but to show it.", "authors": [], "top_image": "https://video-images.vice.com/articles/5d9e309cc94537000a157832/lede/1570648404408-Image-2019-10-09-at-21250-PM.png?crop=0.9954814042405283xw:1xh;center,center&resize=1200:*", "published_at": "2019-10-09"}