{"pub": "yahoo", "url": "https://news.yahoo.com/has-the-oil-market-been-wrong-this-whole-time-morning-brief-101926179.html", "downloaded_at": "2019-10-07 04:42:42.649754+00:00", "title": "Has the oil market been wrong this whole time?: Morning Brief", "language": "en", "text": "Monday, September 16, 2019\n\nGet the Morning Brief sent directly to your inbox every Monday to Friday by 6:30 a.m. ET. Subscribe\n\n‘The market has been persistently mispricing oil’\n\nOil prices (CL=F) are surging after an attack on Saudi Arabia’s oil infrastructure disrupted about half of the Kingdom’s supply.\n\nFor energy traders and market experts, the hot question isn’t so much about the magnitude of the current disruption in supply. Rather, has the risk of a supply disruption been underpriced? In other words, have markets been too complacent about the geopolitical tensions in the region?\n\n“No matter whether it takes Saudi Arabia 5 days or a lot longer to get oil back into production, there is but one rational takeaway from this weekend’s drone attacks on the Kingdom’s infrastructure — that infrastructure is highly vulnerable to attack, and the market has been persistently mispricing oil,” Citi commodities expert Ed Morse wrote on Sunday.\n\nMorse argues that oil “should have been a good $10 a barrel higher than it has been for months.”\n\nThis weekend’s drone strikes hit Saudi Arabia's Abqaiq processing facility and Khurais oil field.\n\n“Abqaiq is the single most important facility in Saudi's oil industry, while Khurais is the second biggest oil field,” S&P Global Platts analyst Paul Hicklin said. Remember, Saudi Arabia is the biggest oil player among the OPEC nations. Oil exports drive the country’s economy.\n\n“Abqaia’s vulnerability means it is one of the most heavily guarded places on Earth and it has long been thought that it was safe in most circumstances short of war with Iran,” energy analyst John Kemp said.\n\n“Abqaiq has always been a much greater source of risk for the oil market than Strait of Hormuz,” Kemp added. “But until the last 48 hours it was assumed to be a high consequence low probability danger so was largely discounted. That won’t be possible any more.”\n\nPresident Trump has already said that his administration is “locked and loaded” suggesting that the U.S. is prepared to intervene with a military response. It’s unclear what’s next in this unfolding saga. What’s clear is all’s not well and a range of destabilizing events could come. And that uncertainty comes at a price.\n\nBy Sam Ro, managing editor. Follow him at @SamRo\n\nWhat to watch today\n\nEconomy\n\nEmpire Manufacturing, September (4.0 expected, 4.8 in August)\n\nFrom Yahoo Finance\n\nYahoo Finance will have experts on all of our live shows today to discuss the attack on Saudi Arabia’s oil infrastructure throughout the day starting at 9 a.m. ET.\n\nHBO series \"Big Little Lies\" star Shailene Woodley will appear on YFi AM, which begins at 10 a.m. ET.\n\nRead more\n\nTop News\n\nFILE - This Feb. 19, 2013, file photo shows OxyContin pills arranged for a photo at a pharmacy in Montpelier, Vt. Reports emerging about a possible financial settlement in 2019 with Purdue Pharma, the company that has come to symbolize the nation’s opioid epidemic, suggests the settlement amount won’t come anywhere near what the national crisis has cost. (AP Photo/Toby Talbot, File) More\n\nOxyContin maker Purdue Pharma files for bankruptcy [Yahoo Finance UK]\n\nChina’s economy slows again, adding pressure for policy response [Bloomberg]\n\nPound weakens as Johnson signals he will reject Brexit extension [Yahoo Finance UK]\n\nAuto workers strike against GM in contract dispute [AP]\n\nYAHOO FINANCE HIGHLIGHTS\n\nApple and Disney split, while AT&T gets it from all sides\n\nThis South Carolina court ruling could give Amazon 'significant additional tax liabilities'\n\nScaramucci to Republicans: Take Trump out 'and put a relief pitcher in'\n\nFollow Yahoo Finance on Twitter, Facebook, Instagram, Flipboard, SmartNews, LinkedIn, YouTube, and reddit.", "description": "Top news and what to watch in the markets on Monday, September 16, 2019.", "authors": ["Sam Ro", "Managing Editor"], "top_image": "https://s.yimg.com/uu/api/res/1.2/xkI0ZjJCb57AMwLpG_h4oQ--~B/aD0xNDM2O3c9MjAyMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2019-09/b11dd690-d865-11e9-bff7-4d554866d56d", "published_at": "2019-09-16"}