{"pub": "fox", "url": "https://foxnews.com/opinion/hillary-trump-2020-best-way-defeat-president-doug-schoen", "downloaded_at": "2019-10-15 09:43:06.005256+00:00", "title": "Doug Schoen: Hillary vs. Trump in 2020? If Clinton is serious, here's best way for her to defeat the president", "language": "en", "text": "After months out of the limelight, Hillary Clinton has reentered the public sphere, leading to a great deal of speculation about whether the former Democratic presidential candidate is seriously considering a rematch against President Trump in 2020.\n\nThe speculation surrounding whether Clinton would mount another presidential run has even caught the attention of President Trump, who took to Twitter on Wednesday to bash both Clinton and Massachusetts Sen. Elizabeth Warren, the current Democratic frontrunner.\n\n“I think that Crooked Hillary Clinton should enter the race to try and steal it away from Uber Left Elizabeth Warren,” Trump tweeted. “Only one condition. The Crooked one must explain all of her high crimes and misdemeanors including how & why she deleted 33,000 Emails AFTER getting ‘C’ Subpoena!”\n\nMICHAEL GOODWIN: HILLARY CLINTON NEEDS TO RUN FOR PRESIDENT AGAIN — OR GET OVER IT ALREADY\n\n“Don’t tempt me. Do your job,” Clinton responded.\n\nTrump and Clinton’s latest Twitter exchange comes just a few weeks after she blasted the president in an interview with CBS, calling him a “corrupt human tornado.”\n\n“I believe that, look there were many funny things that happened in my election that will not happen again. And I'm hoping that both the public and press understand the way Trump plays the game,” Clinton said.\n\nIn my view, Clinton entering the 2020 race would do the party an enormous disservice. Further, given that there are still currently 19 Democratic candidates vying for the nomination, Clinton’s ability to re-clinch the nomination is a long shot at best.\n\nCLICK HERE TO SIGN UP FOR OUR OPINION NEWSLETTER\n\nHowever, if the former secretary of state has genuine ambitions to enter the Democratic primary race, the best way she could do so is not by blasting Trump or by being divisive.\n\nRather, Clinton needs to rise above the field and present a worldview that is unifying, and can bring together the two factions of the Democratic Party.\n\nIf Clinton is hoping to break through the deadlocked primary and make another run for the presidency, her best way in would be by presenting big ideas on climate, the economy, health care, and job creation.\n\nUltimately, the Democratic Party very well may be deadlocked, as nearly 20 candidates are seeking the party’s nomination.\n\nThus, if Clinton is hoping to break through the deadlocked primary and make another run for the presidency, her best way in would be by presenting big ideas on climate, the economy, health care, and job creation.\n\nWhile some are arguing that there is a path for Clinton in the 2020 race, support for her third run is mixed, even within her own party.\n\nA Rasmussen poll released this month showed that even though Clinton is running even with President Trump, most Democrats don’t want her to get into the race.\n\nWhile Trump and Clinton both garner 45 percent of the vote in this hypothetical match-up, 71 percent of all voters don’t think Clinton should run again.\n\nMoreover, 59 percent of Democrats don’t think that Clinton should enter the race for their party’s nomination, compared to 74 percent of independents and 80 percent of Republicans who believe that Clinton should stay out of the 2020 contest.\n\nUltimately, whether Clinton is seriously weighing another presidential run or is just bashing Trump as a way to promote her book, she is still speaking as one of the most prominent Democratic politicians in the country. Thus, Clinton should not waste her media time and influence on taunting the president.\n\nRather, Clinton should seize on this moment to contribute to a unifying, inclusive Democratic narrative which entails bold plans for tackling climate change, making the economy work for everyone, and fixing the broken health care system.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nTo be sure, even when she is out of the running for president, Hillary Clinton is still one of the most prominent voices in the Democratic Party today.\n\nHowever, it remains to be seen whether Clinton will use her power to move the party closer to the White House, or whether she will merely use it to tease the president as he faulters.\n\nCLICK HERE TO READ MORE BY DOUG SCHOEN", "description": "Even when she is out of the running for president, Hillary Clinton is still one of the most prominent voices in the Democratic Party.", "authors": ["Douglas Schoen", "Douglas E. Schoen Is A Fox News Contributor. He Has More Than Years Experience As A Pollster", "Political Consultant. His New Book Is"], "top_image": "https://media2.foxnews.com/BrightCove/694940094001/2019/10/09/694940094001_6093520306001_6093516479001-vs.jpg", "published_at": "2019-10-14"}