{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/22/us-highway-deaths-fall-in-2018-for-second-straight", "downloaded_at": "2019-10-22 13:22:50.065747+00:00", "title": "US highway deaths fall in 2018 for second straight year", "language": "en", "text": "DETROIT (AP) - The U.S. government’s road safety agency says traffic deaths fell by a small amount for the second straight year.\n\nThe National Highway Traffic Safety Administration attributed the 2.4% drop partially to technology in newer vehicles that can prevent crashes. A total of 36,560 people died on the nation’s roads in 2018, the latest full-year statistics available.\n\nThe agency says the downward trend is continuing into 2019. First-half estimates show fatalities down 3.4%.\n\n“This is encouraging news, but still far too many perished or were injured, and nearly all crashes are preventable, so much more work remains to be done to make America’s roads safer for everyone,” Transportation Secretary Elaine Chao, whose department oversees NHTSA, said in a statement.\n\nBut pedestrian deaths rose 3.4%, and the number of people killed on bicycles and other pedaled vehicles went up 6.3%. People killed in large-truck crashes rose just under 1%.\n\nThe overall declines in 2017 and 2018 came after two years of large increases blamed on people driving more as the economy improved.\n\nNHTSA said alcohol-impaired fatalities dropped 3.6% in 2018, while fatalities attributed to speeding fell 5.7%. Motorcycle deaths declined 4.7%, the agency said.\n\nMost of the pedestrian deaths, 76%, and half the bicyclist deaths occurred after dark, and the some pedestrians and cyclists had some alcohol in their systems. Seventy-four percent of the pedestrian deaths occurred outside of intersections, the agency reported.\n\nNHTSA said in a statement that it’s studying changes in its five-star crash assessment program and will consider new technologies related to pedestrian and bicyclist safety. It’s also working with the Federal Highway Administration to reduce bicycle and pedestrian deaths.\n\nSign up for Daily Newsletters Manage Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "The U.S. government's road safety agency says traffic deaths fell by a small amount for the second straight year.", "authors": ["The Washington Times Http"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/22/fatal_crashes_34242_c0-85-3372-2052_s1200x700.jpg?e1048fa44acd7aef00b7f27617c041bd387c5a1e", "published_at": "2019-10-22"}