{"pub": "washingtonpost", "url": "https://washingtonpost.com/nation/2019/09/24/disabled-man-dies-van-after-caretaker-falls-asleep-kratom", "downloaded_at": "2019-09-24 13:36:55.730122+00:00", "title": "‘This poor guy baked’: Disabled man died after caretaker took kratom and fell asleep in hot van, police say", "language": "en", "text": "\n\nJoshua Russell, 26, faces felony aggravated manslaughter charges in the death of 35-year-old John Lapointe.\n\nJohn Lapointe loved going for van rides.\n\nThe 35-year-old, who had Down syndrome, took pleasure from small joys like that, his family wrote in his obituary. Born hearing-impaired and nonverbal, he also loved puzzles, blocks, music, magazines and watching Barney cartoons on his tablet. “He had a mischievous side to his nature,” they recalled, “and was happy to think he had gotten something over on you.”\n\nTragically, the ride that Lapointe took in his assisted-living facility’s minivan on May 9 would be his last. According to the Pinellas County, Fla., Sheriff’s Office, his caretaker, 26-year-old Joshua Russell, took kratom, a legal herbal supplement whose effects have been compared to opiates, and fell asleep in the front seat while parked in front of his home in Seminole, Fla. The developmentally disabled man, who authorities say had the cognitive ability of a 1-year-old, was trapped in the back as the 2006 Toyota Sienna grew hotter and hotter under the beating Florida sun.\n\n“There was nothing he could do,” Pinellas County Sheriff Bob Gualtieri said at a Friday news conference. “He couldn’t try and wake up Russell. He couldn’t do anything to help himself.”\n\nEventually, Lapointe died.\n\nOn Friday, Russell was arrested and charged with one count of aggravated manslaughter of a disabled adult. Gualtieri said the felony charge came after the Pinellas-Pasco Medical Examiner’s Office determined that Lapointe died of hyperthermia, with investigators estimating that the temperature inside the van reached 125 degrees.\n\n“Let’s just call it what it is,” Gualtieri said. “This poor guy baked in that car.\"\n\nThe case is bringing added scrutiny to kratom, which has been banned in a few states but remains legal in Florida and is easily purchased online and at gas stations and head shops. Russell, who worked at the group home in Seminole where Lapointe lived, had driven the developmentally disabled man to a 1 p.m. doctor’s appointment on May 9, a typically hot spring day in the Tampa Bay Area. On the way back, he decided to stop at his own house and walk his dog, Gualtieri said. The 26-year-old reportedly told detectives that he had also taken the opportunity to “parachute” two packages of kratom by wrapping them in toilet paper and swallowing them.\n\nRussell told police that he took the kratom “to feel awake and alert,” Gualtieri said. But it had the opposite effect: As he started driving back to the assisted-living facility, he began to feel nauseated and tired. The controversial plant, which is native to Southeast Asia, produces a feeling of euphoria that some users have compared to taking opiates. Advocates contend it’s a safer alternative for people suffering from chronic pain or struggling with opioid addictions. But the Food and Drug Administration has warned consumers to stay away, saying there’s no evidence to back those claims and the supplement can be addictive and even deadly.\n\n[What it’s like to be high on kratom, according to the people who use it]\n\nAccording to authorities, Russell said that because he didn’t think he could safely drive any farther, he turned around and headed back home. He parked the minivan in his driveway and reclined his seat to take a nap while leaving Lapointe buckled in the back seat, with just one window cracked.\n\nThat afternoon, the temperature at nearby St. Pete-Clearwater International Airport reached a high of 88 degrees. The air conditioning in the Toyota didn’t work well, Russell reportedly told police, so he turned off the minivan’s engine to keep it from overheating. Two or three hours later, he woke up, covered in sweat. When he turned around to look in the back of the van, Lapointe was slumped over and not breathing.\n\nAfter unsuccessfully trying to perform CPR, Russell went back into his house and got a gun, Gualtieri said. He called his mother, who worked for the same assisted-living facility, and told her he was going to kill himself, then started driving off with Lapointe’s body still in the back seat.\n\nRussell’s mother persuaded him to pull over, and she called 911. When deputies arrived around 5:35 p.m. on May 9, paramedics had already pronounced the developmentally disabled man dead, and the caretaker had run off. He again threatened to kill himself when they found him a short time later, and was arrested for carrying a concealed firearm.\n\nIt took several months for authorities to definitively conclude Russell was to blame for leaving Lapointe in the hot car, and to charge him with manslaughter. Records show he was released Saturday after being booked into the Pinellas County Jail on $50,000 bond, and entered a plea of not guilty on Monday. His attorney could not immediately be reached for comment early Tuesday morning. He has also pleaded not guilty to the weapons charge.\n\nGualtieri said on Friday he couldn’t explain how Russell had survived spending hours in the sweltering minivan when Lapointe didn’t, or if the developmentally disabled man had physical ailments that made him particularly susceptible to the heat. He said the incident raised concerns about the widespread availability of kratom.\n\n[Kratom is hailed as a natural pain remedy, assailed as an addictive killer. The U.S. wants to treat it like heroin.]\n\nIn 2016, the Drug Enforcement Administration attempted to ban kratom and “got all kinds of flak for it,” Gualtieri said. As The Washington Post’s Christopher Ingraham reported at the time, the agency announced the drug would be temporarily placed on Schedule 1 of the Controlled Substances Act “to avoid an imminent hazard to the public safety,” only to backtrack weeks later amid public outcry. Nine senators and 51 U.S. representatives were among those who expressed opposition to the ban, and researchers argued it would hamper their efforts to study the drug in an attempt to develop a nonaddictive painkiller.\n\nTypically, ground kratom powder is consumed in teas, though it can also be swallowed and comes in capsule form. Though a few states have banned its sale, it remains largely unregulated in most of the country, including Florida. At Friday’s news conference, Gualtieri predicted that as the supplement becomes more popular, there will be “more of an opportunity for bad situations.”\n\nBut he wasn’t calling for a ban, he said, noting that consuming other legal substances like alcohol could also have negative consequences.\n\n“What I am calling for is people to realize that the license to use it isn’t the license to do stupid stuff like this,” he said.", "description": "John Lapointe, 35, had Down syndrome and was nonverbal.", "authors": ["Antonia Noori Farzan", "Reporter For The Morning Mix", "September At Am", "Antonia Noori Farzan Is A Reporter On The Washington Post'S Morning Mix Team. She Previously Worked At The Phoenix New Times."], "top_image": "https://www.washingtonpost.com/resizer/j8ffcvJjuc54al_nwJWOKjQgNjE=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/IGDFGMCZEFHDTEV2TBTQKMWGX4.png", "published_at": "2019-09-24"}