{"pub": "townhall", "url": "https://townhall.com/tipsheet/katiepavlich/2019/09/24/trump-campaign-thank-you-democrats-with-impeachment-nonsense-you-just-gave-potus-a-landslide-victory-in-2020-n2553625", "downloaded_at": "2019-09-25 04:35:58.546658+00:00", "title": "Trump Campaign Celebrates Impeachment: Thank You Democrats, You Just Re-elected POTUS With a Landslide", "language": "en", "text": "The Trump campaign is celebrating House Speaker Nancy Pelosi's announcement Tuesday evening to open an \"impeachment inquiry\" into President Trump.\n\n\"Democrats can't beat President Trump on his policies or his stellar record of accomplishment, so they're trying to turn a Joe Biden scandal into a Trump problem. The misguided Democrat impeachment strategy is meant to appease their rabid, extreme, leftist base, but will only serve to embolden and energize President Trump's supporters and create a landslide victory for the President,\" the Trump campaign released in a statement.\n\nDemocrats have officially paved the way for a @realDonaldTrump landslide victory. The witch-hunt continues...\n\n\n\nOur campaign statement: pic.twitter.com/h3Y9sVCx04 — Brad Parscale (@parscale) September 24, 2019\n\nAnd they've already released this ad:\n\n“We can’t beat him in 2020 so we must impeach him”. - Democrats\n\n\n\n?? https://t.co/nTclrBic9z — Brad Parscale (@parscale) September 24, 2019\n\nThis appears to be the case:\n\nSwing state impeachment polling from OnMessage, the firm with the best record in recent years for winning swing states:https://t.co/yXoQhBQGei — Ben Domenech (@bdomenech) September 24, 2019\n\nGood luck, Democrats.\n\nIn the meantime, tomorrow the White House will release an unreacted transcript of a phone call between President Trump and Ukrainian President Volodymyr Zelensky, which apparently pushed Democrats over the edge.", "description": ".09/25/2019 0:33:58AM EST.", "authors": ["Katie Pavlich", "Beth Baumann"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2019/256/176da027-e190-47f2-a5a3-ed0974377d9f.png", "published_at": "2019-09-24"}