{"pub": "marketwatch", "url": "https://marketwatch.com/story/risks-of-us-corporate-debt-bubble-may-be-overstated-2019-09-04", "downloaded_at": "2019-09-04 23:48:13.493212+00:00", "published_at": "2019-09-04", "title": "Risks of U.S. corporate debt bubble may be ‘overstated’", "language": "en", "text": "U.S. corporate debt, while still running high, has little chance of unleashing instability in the financial system, according to a new IHS Markit report.\n\nRobust corporate profitability, scant unemployment and low interest rates are just a few of the factors helping to tame risks tied to the boom in corporate borrowing.\n\n“Against the backdrop of a slowing domestic economy and stretched asset valuations, many pundits are positing that the next shoe to drop may be in the U.S. corporate debt and leveraged loan markets,” wrote Michael Ryan, IHS Markit associate director, in a report Wednesday.\n\n“However, a supply-side ﬁnancial analysis reveals the macro-ﬁnancial picture looks adequately contained, with liquidity, interest expenses, and debt coverage all within reasonable levels.”\n\nThis chart shows a drop in U.S. corporate leverage in several sectors over the past five years, notably in media and entertainment.\n\nIHS Markit Tracking corporate leverage\n\nIHS found “pockets of risk” in automotive manufacturing, consumer services and retail that “show more potential for restructuring.” But in terms of the bigger picture, a still-expanding U.S. economy and ample flow of credit likely means that corporate borrowers should have little trouble refinancing their debts, particularly if the Federal Reserve sets out on a sustained path of rate cuts.\n\n“The system remains secure, reinforced by high corporate proﬁtability, exceptional employment conditions, low interest rates (now falling), and tame inﬂationary pressures,” Ryan wrote.\n\nCheck out: A leveraged-lending bust could hit economy quicker than subprime blowup, says ex-FDIC boss Sheila Bair\n\nNew York Fed President John Williams said Wednesday at a Euromoney conference that keeping the economic expansion on track was a priority, but he was noncommittal about what the central bank should do at its next policy meeting later this month.\n\nDovish speeches by senior Fed officials on Wednesday helped drop the policy-sensitive two-year U.S. Treasury note yield TMUBMUSD02Y, -4.39% to its lowest point since September 2017.\n\nMeanwhile, U.S. stocks finished higher, with the Dow Jones Industrial Average DJIA, -1.83% gaining more than 230 points, after the Fed’s Beige Book survey showed the U.S. economy has expanded at a modest pace.\n\nApple Inc. AAPL, -2.48% also returned to the bond market on Wednesday to borrow $7 billion at ultralow rates, after a nearly two-year hiatus. Its long 30-year bond was priced to yield less than 3%.\n\nCheck out: Here are five things to know about Apple’s $7 billion bond deal", "description": "The likelihood of U.S. corporate defaults rippling through the financial system are slim, says IHS Markit’s Michael Ryan, particularly if the Federal Reserve...", "authors": ["Joy Wiltermuth", "Markets Reporter"], "top_image": "http://s.marketwatch.com/public/resources/MWimages/MW-HQ714_Bubble_ZG_20190904183640.jpg"}