{"pub": "heritage", "url": "https://heritage.org/education/commentary/tired-the-teachers-strike-remember-charter-schools-are-option", "downloaded_at": "2019-10-30 23:17:02.182092+00:00", "title": "Tired of the Teachers Strike? Remember That Charter Schools Are an Option", "language": "en", "text": "The teachers’ union strike has put some 300,000 Chicago children and families in limbo. With traditional schools open but no teachers present, few families have sent students to district schools, and most are scrambling to find help while parents continue to work.\n\nThe union demands for more money are no surprise, but the special-interest group also wants to cap charter-school enrollment in Chicago — an idea that parents and voters should oppose.\n\nThe Illinois Network of Charter Schools (INCS) says that one out of every four Chicago high school students attends a charter school.\n\nCharter schools, public schools where families can choose to send their children instead of to an assigned district school, have remained open during the strike. Though some Chicago charters are unionized, differences in their contracts have allowed charters to keep students in school, saving families from having to make other arrangements to meet work and family commitments.\n\nAccording to the Chicago Sun-Times, “patience will run out” for working parents in the city as family members report they will “start getting angry” as the strike drags on. Such news should sound familiar: Parents in Oklahoma and West Virginia expressed similar frustrations in recent years during teacher strikes in those states.\n\nMore than 120 charter schools operate in Chicago, and these schools enroll more minority students and children from low-income families. According to University of Chicago researchers, more Chicago charter school students enroll in college and complete at least four semesters than district school students. A RAND study found that Chicago charter students were more likely to finish high school and also found higher rates of college enrollment compared to district students.\n\nCharter school enrollment is growing statewide and had seen steady increases in Chicago until 2016, right around the time the union forced a moratorium on new charter schools in the city. CPS enrollment has dropped from 400,000 to 360,000 over the last decade. As a consequence, local news reports that “vacant school buildings litter Chicago neighborhoods after mass school closings,” and taxpayers have remained on the hook for the vacant facilities.\n\nSome 38 buildings sat empty in December 2018. For the remaining buildings, “it’s not clear if the district plans to sell them.” As these buildings remain vacant, charter schools in Chicago continue to seek space to operate.\n\nConditions such as this are common in cities that have persistently low-performing district schools and expanding charter-school enrollment. As Heritage Foundation research has found, Tucson, Ariz., district enrollment decreased by 14,000 students between 2000-2001 and 2015-2016, and district officials actively tried to block charter schools from buying or leasing vacant or underused facilities. District school achievement is average overall, but Tucson is home to one of the nation’s highest-achieving charter high schools. In Washington, D.C., where charter school students account for nearly half of all District public-school students, charter-school officials and parents are regularly at odds with traditional school administrators over the use of empty traditional school facilities.\n\nINCS responded to the union strike in Chicago by saying, “If the [Chicago Teachers Union] were sincere about doing what’s best for children, it would work towards a reasonable resolution and make sure that students remain in school learning.” The association “[recognizes] the contributions and needs of teachers,” but is choosing to put student needs first.\n\nCharters take the high ground with this statement. As charter schools are open during the strike, these institutions offer evidence that taxpayers should support them. When charter schools cite the need for more space, charter operators can point to CPS’s empty buildings.\n\nUnfortunately, teachers in Chicago’s Passages Charter School chose to strike and called for higher pay. These striking teachers, who have since settled on a new contract, undermined the value that charter schools bring to students and families, especially during union demonstrations in district schools. And remember that CTU demand to stop charter-school growth in Chicago?", "description": "The teachers’ union strike has put some 300,000 Chicago children and families in limbo. With traditional schools open but no teachers present, few families have sent students to district schools, and most are scrambling to find help while parents continue to work.", "authors": ["Jonathan Butcher", "Senior Policy Analyst", "Center For Education Policy", "Jonathan Is A Senior Policy Analyst In Heritage'S Center For Education Policy."], "top_image": "https://www.heritage.org/sites/default/files/styles/facebook_optimized/public/images/2019-10/GettyImages-1178202541.jpg?itok=zBV9zrre", "published_at": "2019-10-30"}