{"pub": "rt", "url": "https://rt.com/sport/471967-conor-mcgregor-islam-makhachev-ufc", "downloaded_at": "2019-10-27 11:58:16.255925+00:00", "title": "‘Another Dagestani who will smash your face’: Khabib teammate Makhachev responds to Conor McGregor's ‘water boy’ jibe", "language": "en", "text": "Russian UFC lightweight Islam Makhachev has responded to Conor McGregor’s jibe that he is just a “water boy” after a match-up between the pair was touted by Abdulmanap Nurmagomedov, the father and trainer of Khabib.\n\nMcGregor used a trip to Moscow this week to announce his plans for a 2020 octagon return, starting with a January 18 bout in Las Vegas, moving onto to a meeting with the winner of the Nate Diaz versus Jorge Masvidal ‘BMF’ bout and then culminating in a rematch with lightweight champ Khabib in Moscow.\n\nAlso on rt.com 'We will settle it, once and for all': Conor McGregor announces UFC return and vows to face Khabib Nurmagomedov again (VIDEO)\n\nBut McGregor’s ideal scenario did not seem to play out well with Nurmagomedov Sr, who instead suggested that he should meet Khabib's Dagestani teammate Makhachev, who stands 7-1 in the UFC.\n\n“Give Conor to Islam Makhachev, I have a different plan for what to do with him!” Abdulmanap wrote on Instagram.\n\n\"It will be one round on the ground, the second round in a mixed style, and the third round we’ll beat him standing up,” he added.\n\nREAD MORE:‘I have a different plan for Conor’: Khabib’s father speaks out after McGregor spews insults on Moscow visit\n\nThe Notorious dismissed that notion in a scathing tweet, referring to Makhachev, 28, as a “water boy” and “convicted steroid cheat.”\n\nTo Abdulmanap..\n\nI respect your training methods and what you have done.\n\nBut I laugh at water boy and team nutritionist Islam Makhachev as an opponent.\n\nI do not engage in sport combat with convicted steroid cheats.\n\nIt is your son Abdul! Your middle son.\n\nI already got your eldest. — Conor McGregor (@TheNotoriousMMA) October 26, 2019\n\nMakhachev has previously come to the attention of the anti-doping authorities, but was found to be “without fault or negligence” by USADA back in 2016 over a sample that tested positive for an extremely low level of meldonium, which he had taken prior to it being added to the list of banned substances.\n\nConor McGregor press conference: Watch former UFC champion address the media in Moscow during Russia visit\n\nMakhachev responded to McGregor’s goading on Saturday by referring to the charge the Irishman is facing for an alleged assault on a man in a Dublin pub earlier this year, also vowing that he would “smash his face” sould they meet in the octagon.\n\n“Yes, you more likely take fight with old man rather than another Dagestani smash your face,” Makhachev tweeted.\n\nYes, you more likely take fight with old man rather than another Dagestani smash your face https://t.co/j1TKgXeeqm — Makhachev Islam (@MAKHACHEVMMA) October 26, 2019\n\nIn reality, Makhachev appears an unlikely octagon opponent for McGregor, who is tipped to face either Donald 'Cowboy' Cerrone or Justin Gaethje on his planned January return.\n\nMcGregor’s promotional trip to Russia proved predictably eventful, as he was mobbed by fans at various media events but also had a bottle thrown at him by a disgruntled Dagestani man.", "description": "Russian UFC lightweight Islam Makhachev has responded to Conor McGregor’s jibe that he is just a “water boy” after a match-up between the pair was touted by Abdulmanap Nurmagomedov, the father and trainer of Khabib.", "authors": [], "top_image": "https://cdni.rt.com/files/2019.10/article/5db574f085f5404e500ea06a.jpg", "published_at": "2019-10-27"}