{"pub": "washingtonpost", "url": "https://washingtonpost.com/local/virginia-politics/this-va-house-race-should-be-an-easy-pickup-for-democrats-its-not-shaping-up-that-way/2019/10/18/5de310a8-da22-11e9-ac63-3016711543fe_story.html", "downloaded_at": "2019-10-19 10:59:36.440562+00:00", "title": "This Va. House race should be an easy pickup for Democrats. It’s not shaping up that way.", "language": "en", "text": "But his political fortunes changed overnight when federal judges approved a new Virginia electoral map earlier this year, saying the old one was racially gerrymandered. His district went from a 12 percent edge for Republicans to a 15 percent edge for Democrats. It looks like an easy flip from red to blue.\n\nAD\n\nYet the way the race is playing out shows a difficult path ahead for Democrats, who need to turn two GOP seats in both the House of Delegates and the state Senate to take full control of the legislature. All 140 seats in the House and Senate are on the Nov. 5 ballot.\n\nAD\n\nThe party almost failed to secure an opponent to run against Jones. Only one candidate raised his hand — real estate broker Clinton Jenkins — and his state paperwork was late, so initially he didn’t qualify for the ballot. Over the summer, Jenkins raised about $60,000, mostly from big party donors — one-tenth the amount Jones had on hand.\n\n“It’s almost as if Democrats are making a halfhearted effort to challenge Chris Jones,” said Christopher Newport University political analyst Quentin Kidd. “My gut tells me it’s because of his position in the community.”\n\nAD\n\nDemocrats across Virginia are nationalizing races, reminding voters of what they call dysfunction in Washington and bringing in outside money and organizers to rally support.\n\nJones is doing the opposite.\n\nAs a pharmacist, and son of a pharmacist, Jones has personal connections to his constituents. His career in municipal government — which is nonpartisan — made him familiar throughout the sprawling city, a patchwork of rural villages, strip-mall suburbs and an ailing industrial downtown. Now, as chairman of the Virginia House Appropriations Committee, Jones controls the state’s purse strings as much as any one person can.\n\nAD\n\nIf Jones does lose, it will be at least partly because he never truly represented his entire hometown in the statehouse. The poorest sections — low-income black neighborhoods that didn’t even have indoor toilets when Jones was a young City Council member — had been carved out and added to a district in the neighboring city of Chesapeake.\n\nAD\n\nThe new map restores those neighborhoods to the Suffolk district. Jenkins, 57, who is African American, grew up in that part of town — literally across the railroad tracks from the white side. He said he remembers having to use the outdoor privy in cold weather as a young child.\n\n“He may have the money,” Jenkins said of Jones, “but I’ve got the people.”\n\nIn that case, the trick is figuring out how to get them all to show up and vote.\n\n'I know he can be beat'\n\nSuffolk is, geographically, the largest city in Virginia, sprawling across 400 square miles. But it’s really a collection of very different communities. Old downtown Suffolk, where Jenkins grew up, runs alongside the Great Dismal Swamp and about 14 miles from the North Carolina line. It’s surrounded by farms and crisscrossed by railroads that wind past peanut-processing factories.\n\nAD\n\nAD\n\nJenkins was born in Philadelphia. His father left when he was about 4 years old, and his mother moved the family to Suffolk. They had little money.\n\n“I remember the days I couldn’t wait to get to school because that was my meal,” he said. “That breakfast, that lunch. . . . And then on Fridays the cafeteria workers would slip you a bag with food.”\n\nJenkins played football in high school, then joined the Army. He spent years pursuing a college degree and moving among jobs for military contractors, he said. He got married, had four kids and wound up back in Suffolk, investing in real estate and selling it.\n\nHe has been active with neighborhood civic groups, and through them joined a local Democratic committee. His wife, Karen, won a seat last fall on the city school board, but Jenkins himself has never won elective office. He ran for the City Council and came in third out of three candidates.\n\nAD\n\nAD\n\nChallenging Jones is not something Jenkins envisioned. “I had no desire to run for this position — had no desire,” he said. Others in the community approached him, he said.\n\nAfter his stumble in getting on the ballot — he blamed it on a mix-up with an email to the state — Jenkins got off to a significant head start with campaign signs, which he and volunteers have plastered all over downtown and along some of the major roads. His headquarters on the first floor of a ramshackle Victorian house is festooned with signs and flags.\n\nTold that the numbers in the new district appear to give him good odds of winning, Jenkins seemed taken aback.\n\n“You think so?” he said, then gathered himself. “I know he can be beat. I’m just hoping he takes it for granted and lets me go about my way and do my thing.”\n\nAD\n\nHe is pressing Jones on some issues — crying foul about a TV ad in which Jones takes credit for leading the effort to pass Medicaid expansion in 2018. Republicans fought against expansion for years, and Jones voted against it several times — though he did help broker the deal with Gov. Ralph Northam (D) that finally passed it.\n\nAD\n\nJenkins said his opponent focuses on big business and doesn’t understand why working people need better transit to get to jobs in far-flung parts of Hampton Roads, or why East Suffolk neighborhoods need help with huge drainage ditches that attract mosquitoes and snakes. He said Jones has joined other Republicans in opposing gun restrictions that would stem the tide of violence.\n\nAnd Jones has been “selective about who he wants to serve,” Jenkins said, noting that Jones led the Republican effort to draw legislative districts in 2011 — the plan that federal judges struck down this year as racially gerrymandered.\n\nEven though the downtown neighborhoods were carved out of the Suffolk district before Jones took office, Jenkins charged that he had the power to put them back. Jones responded that the Justice Department under President Barack Obama approved his map, and that it would not have allowed him to pull the black precincts out of the neighboring majority-black district.\n\nAD\n\nAD\n\nJenkins appears strong in those African American neighborhoods, where many people know him and his mother.\n\n“I’m being called to give people a voice, an opportunity to sit at the table,” he said.\n\nIn the Lake Kennedy subdivision one weekday morning, an elderly man driving a pickup stopped when he saw Jenkins. “I’m voting for you!” he shouted from the window.\n\nJenkins approached one house and called to resident Gloria Whitfield through her screen door. “Can I count on you?” he said.\n\n“Go ahead, boy, you know I got you,” she replied.\n\nDeacon Eddie Hicks, 84, has worked on several civic groups with Jenkins. He has also known Jones for decades and calls him “a good man.”\n\nAD\n\n“But it’s time for this man now,” he said, nodding to Jenkins.\n\nJenkins hasn’t lined up all the leaders in the black community, though. Several pastors have endorsed Jones. And though Jenkins urged a reporter to call City Council member Curtis Milteer for a reference, Milteer said in an interview that he’s not committed.\n\nAD\n\n“I’m not involved in that race,” said Milteer, 88, who is African American and has served on the council for 39 years. Jenkins “has run for several offices and never won, so I don’t know what the outcome of this thing will be,” he said.\n\nAnd Jones? “A fine young man,” he said.\n\nJenkins said there’s one argument that will drive people to vote for him: Jones is a member of the same party as President Trump.\n\n“This is about not allowing the current president’s policies to filter into this area,” Jenkins said.\n\nReaching across the aisle\n\nJones himself is careful to soften the partisan line. He points out that he spent time in the GOP wilderness, losing top committee spots because he broke with his party to support tax increases under former governors Mark R. Warner (D) and Robert F. McDonnell (R).\n\n“There are not many of me left, those who reach across the aisle to get things done,” he said.\n\nAD\n\nMary Hill, 59, went to high school with Jones. She remembers his father’s drugstore, which opened in the village of Chuckatuck in 1961, at the height of the civil rights movement. That drugstore served farmers and watermen, black and white. It had no separate bathrooms, no separate lunch counter, recalled Hill, who harvests oysters in the black community of Hobson. “We never thought about race,” she said.\n\nAlthough she is a lifelong Democrat, Hill said she will vote for Jones. “I vote for who is going to represent the people, and he has always represented the people,” she said.\n\nJones has drawn howls from Democrats because he’s been highlighting his 2018 vote to expand Medicaid to about 400,000 low-income residents, something he had voted against for years.\n\nJones is among the first Republicans to actually run on the issue, and said his role as a pharmacist has made him understand the need to expand health care coverage.\n\n“I never was a hard ‘no.’ I always said you have to fix it before you expand it,” he said. That entailed creating work incentives for recipients.\n\nJones also has a unique perspective on the gun safety issue that flared up this year following the May 31 mass shooting in Virginia Beach, in which a gunman killed 12 people at a municipal building.\n\nJones bought a gun long ago, after the first time his pharmacy was robbed. In 1987, it was held up again, this time by a white, middle-class mother named Sue Kennon who was addicted to prescription drugs. As she pointed a gun at him, Jones drew a pistol from under the counter and shot her in the shoulder.\n\nKennon begged him to kill her, saying she wanted to die. Instead, he called the police. In the years since, the two have stayed in regular contact through letters, calls and visits. She served 15 years in prison, got two college degrees and had a successful career working for the state corrections system.\n\n“I don’t think anybody could ask for any more help to get over the hump of feeling like you don’t belong in society,” Kennon said of Jones in an interview. Now 69 and retired, Kennon said she and Jones still meet occasionally for lunch.\n\n“It’s all about forgiveness,” she said.\n\nJones says he favors several gun safety measures proposed by Democrats, including closing the gun-show loophole for background checks, banning “bump stock” devices that make weapons fire faster, requiring gun owners to report lost or stolen weapons and some type of “red flag” law that would allow authorities to separate a dangerous person from firearms.\n\nHowever, when Northam called a special legislative session in July to take up gun control measures, Jones voted with the Republican majority to adjourn after 90 minutes without debating any bills. All measures were referred to a state crime commission for further study.\n\nJones has been campaigning in the new parts of his district, attending black churches and community meetings. Most of the faces in his TV ads and campaign mailers are African American.\n\n“People want me to say I’m endorsing Clinton over Chris because of race or because he needs our votes on that side of town, but I’m voting what helps our community the most,” said Chavez Mabry, 53, a local teacher and organizer of the Suffolk Business Men Group for African American leaders. “This is not a national stage, this is a local stage. If he was Donald Trump, I wouldn’t be voting for him, but he’s Chris Jones, and I support Chris Jones because I know what he continues to do for our community.”\n\nStill, Jones knows that change is in the air.\n\nDemocrats have begun stepping up their support for Jenkins, with former Gov. Terry McAuliffe hosting a fundraiser for him in Northern Virginia last week . The Virginia House Democratic Caucus pumped more than $155,000 into Jenkins’s campaign in September.\n\nLast month, Jones sold Bennett’s Creek Pharmacy, a casualty of Medicare reimbursement policies and private insurance practices that have made the climate tough for independent pharmacists.\n\nFor two weeks, people around town have been hugging him when they see him. “It’s like losing a member of your family,” he said.\n\nThe pharmacy is mostly empty, with “going out of business” signs on the windows. Jones still works out of his office in the back. The experience has given him an air of fatalism.\n\nSpeaking recently to the local Rotary Club, Jones grew emotional about both the pharmacy and his political career.", "description": "Powerful Republican and novice Democrat square off in a Nov. 5 election that could determine control of state legislature", "authors": ["Gregory S. Schneider", "Reporter Covering Virginia The Richmond Bureau"], "top_image": "https://www.washingtonpost.com/resizer/Ap7qCRPuS4yuFxuZ5GL1tpaSRKY=/1440x0/smart/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/WMFU4JHCD4I6TDOIJGHKXQJJUA.jpg", "published_at": "2019-10-18"}