{"pub": "dailymail", "url": "https://dailymail.co.uk/sport/sportsnews/article-7605341/Leicester-boss-Brendan-Rodgers-lauds-fans-tributes-chairman-Vichai-Srivaddhanaprabha.html", "downloaded_at": "2019-10-23 17:22:18.179421+00:00", "title": "Leicester boss Brendan Rodgers lauds fans after tributes to chairman Vichai Srivaddhanaprabha", "language": "en", "text": "Leicester boss Brendan Rodgers has paid tribute to the club's fans for marking the anniversary of the death of former Foxes chairman Vichai Srivaddhanaprabha.\n\nSrivaddhanaprabha was one of five people killed in a helicopter crash outside the King Power Stadium last year and thousands of Foxes supporters held a march to the ground in his honour before Saturday's home win against Burnley.\n\n'It was a great day off the field, of course, the supporters were amazing,' Rodgers told a press conference before Friday's Premier League game at Southampton.\n\nLeicester supporters came together and paid tribute to Vichai Srivaddhanaprabha\n\nBrendan Rodgers was full of praise for the fans on the one-year anniversary of the tragic crash\n\nBoth sides came together for an immaculately observed minute of silence before kick-off\n\nFive passengers including Srivaddhanaprabha were killed in the helicopter crash last year\n\n'There was obviously a march beforehand and that spirit came into the stadium. From everyone, it was very touching in how they continued to support Khun Vichai.\n\n'Everyone at the club was proud of the day, how it went and there will be more celebration of his life later this week.'\n\nLeicester have won three of their last four league games and sit third in the table, two points behind second-placed Manchester City.\n\nTheir only league defeats this season came at Manchester United and Liverpool.\n\n'The players have been absolutely brilliant, they've shown a lot of qualities and a real resilience,' Rodgers said.\n\nLeicester beat Burnley 2-1 on Saturday and the fans held up specially made scarfs\n\nFloral tributes left for Leicester City's late owner were laid outside the stadium\n\n'For me, the nice thing is that we can improve. After Burnley we were happy with the three points and elements of the game, but there were elements we can improve on.'\n\nRodgers confirmed James Maddison is fully fit and available after recovering from illness and an ankle injury.\n\nThe 22-year-old midfielder pulled out of England's recent Euro qualifiers and was substituted in the second half against Burnley.\n\n'He's fine,' Rodgers said. 'He's been good in training up until now. He didn't do much in the weeks after the Tottenham game.\n\n'He only had a few days, so he lasted the game (against Burnley) very well.\n\nJames Maddison is back to fitness and ready to take on Southampton on Friday\n\n'He wasn't quite up to match fitness, but he got a good period of the time in and he'll be fit and ready for Friday.'\n\nSouthampton are one place above the bottom three and will be bidding for their first league win in four under German boss Ralph Hasenhuttl.\n\n'He came in and made an impact,' Rodgers added. 'They like to be aggressive in the press at home and they've got some talented players.\n\n'I also saw Ralph's teams at RB Leipzig and they're dangerous to play against.'", "description": "Leicester boss Brendan Rodgers has paid tribute to the club's fans for marking the anniversary of the death of former Foxes chairman Vichai Srivaddhanaprabha.", "authors": ["Press Association Reporter"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/23/16/20089068-0-image-a-88_1571843503091.jpg", "published_at": "2019-10-23"}