{"pub": "businessinsider", "url": "https://businessinsider.com/how-to-start-a-youtube-channel-money-career-benji-travis-2019-9", "downloaded_at": "2019-09-25 23:36:04.131240+00:00", "title": "How to start a YouTube career without spending tons of money, according to a creator with millions of subscribers", "language": "en", "text": "Entrepreneur Benji Travis and wife Judy, the popular beauty vlogger behind the channel \"itsjudytime,\" film videos for YouTube.\n\nWhat started out as a hobby with no professional equipment or experience has led to a decade-long career online for this Seattle-based family.\n\nBenji shares tips on how to grow an audience online on the YouTube channel \"Video Influencers,\" which he runs with a fellow creator Sean Cannell.\n\nSpeaking to Business Insider, Benji said that starting a YouTube channel doesn't require any fancy equipment and he broke down four basic steps to start an online career.\n\nClick here for more BI Prime stories.\n\nIf there's one piece of advice an aspiring YouTube creator needs, it's to just start.\n\nBenji Travis, who has been on YouTube for over a decade, told Business Insider that a creator doesn't need fancy equipment to be success. He said his wife Judy Travis, who is popular in the beauty-vlogger community, filmed her first few YouTube video with a camera that cost less than $50, propped on a stack of shoe boxes.\n\nJudy, known as \"itsjudytime\" online, was the first in their family to start a channel, and since then the family has grown to help run over five YouTube channels.\n\n\"She didn't have anything fancy at the beginning,\" he said. \"In fact, she had no experience.\"\n\nAfter successfully growing an audience 11 years ago sharing makeup and beauty tutorials on Judy's channel, the Travis family launched a daily-vlog channel in 2011, \"itsJudysLife.\" Both of the YouTube channels have over one million subscribers.\n\nBenji uses his platforms to share tips for growing a successful career online. He is the coauthor of the book \"YouTube Secrets: The Ultimate Guide to Growing Your Following and Making Money as a Video Influencer,\" with Sean Cannell. They run the YouTube channel \"Video Influencers,\" which has 530,000 subscribers, sharing similar tips.\n\nRead more: A rising YouTube star with 1.6 million subscribers uses her iPhone and a $30 app to make her video\n\nHere are four steps Benji said anyone can follow when they are starting out online:\n\nBenji and his wife vlog their daily lives on their YouTube channel “ItsJudysLife.” Benji Travis\n\n1. Choose a passion to share beyond wanting to make money.\n\nWhen starting a new YouTube channel, it's best to choose a specific topic or theme within your content that you are passionate about sharing. Being passionate about the topic, rather than just sharing it with the goal of making money, will allow your content to build a genuine following.\n\n\"You need a passion for what you're doing,\" Benji said. \"It's got to be beyond just wanting to make money.\"\n\nWhat value do you want your content to provide? Is it to teach someone a new skill? Help them figure out a problem? Or make them laugh? The desire to help someone and provide value will drive your content and should be at the heart of why you are doing it, he said.\n\nJudy knew a lot about makeup and beauty, and decided to share her tips online before making money on YouTube was even a possibility. Her message outweighed any equipment or editing, he said.\n\n2. Skip the fancy equipment and just start.\n\nBenji said once you narrow down what you want to film, it's best to get started right away. Start with your iPhone or smartphone device, which likely has a good quality camera built-in.\n\nTypical DSLR cameras, which you will see some professional YouTube creators using, can cost anywhere between mid-hundreds to thousands of dollars. This doesn't count the additional equipment you'll need like a tripod.\n\nBut you don't need that.\n\nYouTube phenomenon Jennelle Eliana, who gained 1.6 million subscribers within a month of posting her first video, previously told Business Insider that she only users her iPhone X and the $29.99 LumaFusion app to edit her videos.\n\n\"There have been a lot of conspiracies that I have a whole team behind me, but I literally just film and edit on my phone,\" she told Business Insider.\n\nBenji says skip the fancy equipment and use your smartphone. Benji Travis\n\n3. Pay attention to lighting, which will enhance your video quality.\n\n\"The more lighting you have the better,\" he said.\n\nTips for free lighting:\n\nUse natural light from a window. Face the window and place the camera in front of the light shining onto you.\n\nConsider filming outside if the light is better.\n\nGather lights from around your house and place them behind the camera. Point the lights so that they are shining onto you.\n\nPaying attention to the way your video is lit will enhance your video quality overall.\n\n4. Hacks for using what you already own to record your audio.\n\nIf you are going to spend money on anything, Benji recommends purchasing an external microphone, like a lapel microphone which will plug directly into an iPhone, he said. These range between $20 to $30 on Amazon.\n\n\"What you're seeing nowadays is people using their Airpods as their microphone,\" he said. \"You can use your AirPods as a microphone and it will capture better audio than what your phone can. That's one little hack that a lot of people don't think about.\"\n\nAn Airpod, or other wireless headphone with a built-in microphone, can lay on your lap and record better audio than the phone in front of you. Or, Benji recommends plugging in headphones with an external microphone into your phone in front of you, similar to using a lapel mic.\n\nFor more on how influencers are profiting from their success online, according to industry professionals and creators, check out these Business Insider Prime posts:", "description": "Benji Travis, who has been on YouTube for over a decade, says you don't need fancy equipment or a ton of money to start a YouTube channel.", "authors": ["Amanda Perelli"], "top_image": "https://image.businessinsider.com/5d83c72d2e22af303009c827?width=1200&format=jpeg", "published_at": "2019-09-25"}