{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/boris-johnson-ducks-appearance-before-20709284", "downloaded_at": "2019-10-24 00:38:29.377464+00:00", "title": "Boris Johnson ducks appearance before key commons committee for the third time", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nBoris Johnson has been slammed for \"unacceptable\" decision to cancel an appearance before a Commons super committee for the third time.\n\nThe Prime Minister told the Liaison Committee - which is made up of the heads of all the other commons committees - that he would not attend Thursday's session in a hastily - scribbled note the night before.\n\nHe insisted that he would keep his promise to attend and instead he asked if he could attend “5-6 months after I became PM so that my appearance takes place after roughly the same period in office as Gordon Brown, David Cameron and Theresa May \".\n\nHe did not appear on 11th September despite suggesting that date himself and reassuring the committee that he would keep the commitment.\n\nThe Chair of the Committee Sarah Wollaston tweeted a picture of the Prime Minister's cancellation and her response.\n\nShe commented: \"Appalling that the PM is refusing to answer detailed questions from select committee chairs on behalf of the public, cancelling again at very short notice rather than face scrutiny.\"\n\nThe chair of the key committee said it was the third time the PM had cancelled an appearance.\n\nIt comes after the Supreme Court ruled his decision to suspended parliament to avoid scrutiny over Brexit was \"unlawful\".\n\nMr Johnson has only faced two PMQs sessions since he entered Number 10 because of the suspension.\n\nIn his note Mr Johnson said told the Totnes MP: \"I promised I will come to the Liaison Committee and I will keep that promise but I am afraid I must now focus on delivering Brexit in the difficult circumstances in which we now find ourselves, and believe I would be of greater value if I could postpone to a fixed date nearer 5 or 6 months after I became PM, so that my appearance takes place after roughly the same period in office as Godon Brown, David Cameron and Theresa May.\n\n\"I do hope you will understand.\"", "description": "The Prime Minister has been slammed for the \"unacceptable\" decision", "authors": ["Nicola Bartlett", "Image", "Afp Via Getty Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20705862.ece/ALTERNATES/s1200/1_BRITAIN-EU-POLITICS-BREXIT.jpg", "published_at": "2019-10-23"}