{"pub": "nytimes", "url": "https://nytimes.com/2019/10/15/world/middleeast/kurds-syria-turkey.html", "downloaded_at": "2019-10-15 11:22:44.443278+00:00", "title": "Kurdish Militia Fights Back on Syrian Border", "language": "en", "text": "Since the Kurdish authorities asked the government of President Bashar al-Assad for assistance, thousands of Syrian Army troops have flooded into northern Syria for the first time since the government lost control of the region several years ago.\n\nBut Syrian government troops have stayed clear of the border region near Ras al-Ain, where Kurdish troops fight on alone. Instead, government forces have deployed to other strategic positions, such as the western cities of Manbij, to help alleviate pressure on Kurdish fighters on the front line.\n\nThe last-minute alliance comes at great cost to the Kurdish authorities, who are effectively giving up self-rule.\n\n\n\nSyrian Kurdish militias established a system of self-rule in northern Syria in 2012, when the chaos of the Syrian civil war gave them the chance to create a sliver of autonomous territory free of central government influence.\n\nThe fighters greatly expanded their territory after they partnered with an international military coalition, led by the United States, to push the Islamic State from the area.\n\nAfter the Kurdish-led fighters captured ISIS territory, they assumed responsibility for its governance, eventually controlling roughly a quarter of the Syrian landmass. They have also been guarding thousands of ISIS fighters and their families, hundreds of whom fled a detention camp in Ras al-Ain after Turkish-led forces bombed the surrounding area.\n\n\n\nThe Kurds’ control of the land in Syria enraged Turkey, since the militia is an offshoot of a guerrilla group that has waged a decades-long insurgency against the Turkish state. Turkey has long pressed the United States to abandon its alliance with Kurdish fighters so Turkish troops could enter Syria and force the Kurds from territory close to the border.\n\nWashington rebuffed Turkey’s requests for several years, maintaining a de facto peacekeeping presence along the border near Ras al-Ain, the town at the center of the fighting on Friday. But that changed last week, when Mr. Trump made a sudden decision to withdraw troops — first from that particular area, and later from all of northern Syria.\n\nCarlotta Gall reported from Ceylanpinar, and Patrick Kingsley from Istanbul.", "description": "Kurdish-led forces sought to retake a strategic border town captured by Turkish troops.", "authors": ["Carlotta Gall", "Patrick Kingsley"], "top_image": "https://static01.nyt.com/images/2019/10/15/world/15syria1/15syria1-facebookJumbo.jpg", "published_at": "2019-10-15"}