{"pub": "huffpost", "url": "https://huffpost.com/entry/taylor-swift-cancels-australia-horse-race-melbourne-cup_n_5d87f788e4b070d468ce9697", "downloaded_at": "2019-09-23 01:33:06.801116+00:00", "title": "Taylor Swift Cancels Australia Horse Race Gig Amid Animal Activist Uproar", "language": "en", "text": "Taylor Swift has canceled a November performance at Australia’s Melbourne Cup horse racing event that had drawn outcry from animal rights activists.\n\nAfter the Victoria Racing Club, the event’s organizer, announced Swift’s participation on Sept. 12, various animal rights groups, including the Coalition for the Protection of Racehorses, campaigned for the singer to say “#NupToTheCup” and pull out of the event.\n\nIn a statement on Saturday, VRC announced that Swift would no longer be able to perform at the Nov. 5 event, citing recent scheduling changes. The statement read, in part:\n\nMichael Gudinski from Mushroom Events said, “Regrettably, Taylor is no longer able to make it to this year’s Melbourne Cup. Changes to her Asian promo schedule have made it logistically impossible for her to be here. To all of Taylor’s fans, we hope to see Taylor in Australia in 2020.”\n\nSwift was slated to perform two of her latest hits at the event. She did not have any other public appearances in Australia scheduled.\n\nPrior to the announcement that Swift would not be performing at the race, a Change.org petition urging her to cancel her appearance had garnered more than 6,000 signatures.\n\n“Taylor Swift is endorsing animal abuse by performing at this event where horses are being killed for gambling profits and entertainment,” the petition reads in part.\n\nSwift has not acknowledged the activists, but her cancellation was applauded by the Coalition for the Protection of Racehorses:\n\nProtests against the Melbourne Cup, a major racing event in Australia, have mounted in recent years after the deaths of several horses.\n\nLast year, The Cliffsofmoher, an Irish horse, was euthanized on the racetrack after breaking a shoulder during the race. The death, the sixth at the event since 2013, prompted widespread outrage.", "description": "The pop singer has canceled her performance at the Melbourne Cup races, with the event organizer citing a scheduling conflict.", "authors": ["Trends Reporter"], "top_image": "https://img.huffingtonpost.com/asset/5d87fc222300009705d4ae0c.jpeg?cache=z5vxfowcau&ops=1778_1000", "published_at": "2019-09-23"}