{"pub": "yahoo", "url": "https://sports.yahoo.com/kentucky-lb-kash-daniel-says-he-wasnt-trying-to-injure-florida-qb-kyle-trask-in-a-pile-175329790.html", "downloaded_at": "2019-09-20 05:12:32.083921+00:00", "title": "Kentucky LB Kash Daniel denies that he tried to injure Florida QB Kyle Trask", "language": "en", "text": "Kentucky linebacker Kash Daniel celebrates his sack during the first half of the Citrus Bowl between the Kentucky Wildcats and the Penn State Nittany Lions on Jan. 1, 2019, at Camping World Stadium in Orlando, Florida. (Getty Images)\n\nKentucky linebacker Kash Daniel wants you to know he was not trying to purposely injure Florida quarterback Kyle Trask’s ankle during the Gators’ win Saturday night.\n\nDaniel was in the pile when Trask was stopped short of the goal line on a two-point conversion in the fourth quarter. You can see Daniel, No. 56, appear to do something that makes Trask upset enough to react in the manner that he did.\n\nScroll to continue with content Ad\n\nMaybe I'm just a big ol homer, but the Skycam angle makes it pretty clear to my eyes that @TateCasey84 was correct and @UKFootball's #56 Kash Daniels was working @GatorsFB's Kyle Trask's ankle - released it when he realized the ref was on top of them pic.twitter.com/06asJVQYi5 — libgator (@lib_gator) September 15, 2019\n\nHere’s a different angle of the play via the cameras of Kentucky TV station WYMT on the sideline. In that video, it sure looks like Daniel is appearing to try something that resembles a wrestling move to (presumably) Trask’s foot with both of his hands on the shoe.\n\nDaniel’s explanation\n\nDaniel said after Kentucky’s practice Wednesday that he wasn’t trying to hurt Trask and that he was previously the victim of a dirty play himself and that colors the way that he plays on the field.\n\nStory continues\n\nHere’s Daniel’s side of the story in full. Trask was in the game after Feleipe Franks suffered a season-ending lower leg injury when he crumpled awkwardly during a tackle.\n\n“Do I talk a lot of crap? Absolutely. Do I bump a dude here and there to get underneath his skin and talk while I’m doing it? Absolutely. That’s part of my game and what I do. But am I out there to deliberately hurt somebody? Absolutely not, I’ve kept my mouth shut about it I’ve been biting my tongue as long as I can because that’s actually something that I actually hold close to me. I’m a victim of a dirty play and if you don’t believe me I’ve got a plate and seven screws in my right ankle to prove that. I’ve got a scar running halfway down my leg.\n\n“So I’m not out there to hurt anybody. My hand that I had surgery on — this one got stepped on as it was going down — this surgically repaired hand has two screws in it and if enough weight’s on it, still hurts like a you know what.\n\n“My hand’s caught underneath here, instantly gets stepped on. I’m trying to move s--- around, I pull my hand out of there last second because I just pulled it out, there was — I got it stuck underneath a lineman’s leg with all that weight on it. Then I pulled it free from that, kept moving stuff, kept hitting legs and stuff and finally it came through. Maybe he felt something weird, I don’t know, but I’m not out there to twist nobody’s ankle or hurt nobody. End of story.”\n\nAnd here’s a GIF of the play in question in case you didn’t hit play on the video above. You make the call if what you see on that video matches Daniel’s side of the events.\n\nIs Kash Daniel twisting Kyle Trask's ankle? (via WYMT)\n\nFlorida coach Dan Mullen said Monday it’s up to the SEC to decide if it sees something to contradict Daniel’s explanation and determine if the play was worth disciplining.\n\nFlorida plays Tennessee on Saturday while Kentucky travels to Mississippi State. The Gators’ game will be Trask’s first college start.\n\n– – – – – – –\n\nNick Bromberg is a writer for Yahoo Sports.\n\nMore from Yahoo Sports:", "description": "Daniel said he was simply trying to get his hands out of the pile after video emerged of Daniel looking like he was doing something to Trask's leg.", "authors": [], "top_image": "https://s.yimg.com/ny/api/res/1.2/dWevp_4xJyAcCGTbU95JEA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyODA7aD04NTMuMzMzMzMzMzMzMzMzNA--/https://s.yimg.com/uu/api/res/1.2/mf4KMbtbfUCQOWpmbLp9rw--~B/aD0zMDAwO3c9NDUwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-images/2019-09/fac7d370-db05-11e9-96f5-5aadb2f99377", "published_at": "2019-09-19"}