{"pub": "reuters", "url": "https://reuters.com/article/us-usa-china-huawei-tech/huawei-phones-lose-access-to-install-googles-apps-bloomberg-idUSKBN1WH0JM", "downloaded_at": "2019-10-02 12:54:36.646096+00:00", "published_at": "2019-10-02", "title": "Huawei phones lose access to install Google's apps - Bloomberg", "language": "en", "text": "(Reuters) - Huawei Technologies Co Ltd’s newly launched Mate 30 devices have lost their access to manually install Google’s Android apps, Bloomberg reported on Tuesday.\n\nFILE PHOTO: A new Huawei Mate 30 smartphone is pictured at the Convention Center in Munich, Germany September 19, 2019. REUTERS/Michael Dalder/File Photo\n\nAccording to the report, security researcher John Wu published a blog post bit.ly/2p5d2Cu Tuesday that explained how users of Huawei's Mate 30 Pro were able to manually download and install Google apps, despite a U.S. blacklisting that prohibits the Chinese company from using American components and software.\n\nBut in the wake of the revelations, the Mate 30 devices, made to work on new 5G mobile networks, lost their clearance to manually install Android apps, as reported by a number of smartphone experts, Bloomberg said.\n\nThe Mate 30 is Huawei’s first major flagship smartphone launched last month, since U.S. President Donald Trump’s administration effectively blacklisted the company in mid-May, alleging it is involved in activities that compromise U.S. national security, a charge the company denies.\n\nWu wrote in the post a widespread method to install Google Services on newly released Huawei devices relies on undocumented Huawei specific mobile device management application programming interface, or MDM APIs.\n\n“Although this “backdoor” requires user interaction to be enabled, the installer app, which is signed with a special certificate from Huawei, was granted privileges nowhere to be found on standard Android systems,” he wrote.\n\n“The system framework in Huawei’s operating system has a “backdoor” that allows permitted apps to flag some user apps as system apps despite the fact that it does not actually exist on any read-only partitions,” Wu said.\n\nThis process let the Mate 30 phones to run popular apps like Google Maps and Gmail that otherwise would not be permitted, Bloomberg reported bloom.bg/2mSwsKg.\n\nAn easy-to-use app enabling the installation of Google apps and services on the Mate 30 Pro, called LZPlay, had emerged alongside the device’s release, however it has disappeared after Wu’s posting. Only Google is able to make that change through its SafetyNet anti-abuse check, the report said.\n\nGoogle and Huawei did not immediately respond to a request for comment from Reuters.", "description": "Huawei Technologies Co Ltd's newly launched Mate 30 devices have lost their access to manually install Google's Android apps, Bloomberg reported on Tuesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191002&t=2&i=1436153203&w=1200&r=LYNXMPEF910F9"}