{"pub": "yahoo", "url": "https://finance.yahoo.com/news/wealth-tax-takes-center-stage-020329055.html", "downloaded_at": "2019-10-16 21:22:25.141271+00:00", "title": "Wealth tax takes center stage at Democratic debate", "language": "en", "text": "Most 2020 Democrats agree that, in order to address income and wealth inequality in the U.S., the richest Americans need to pay more in taxes – but not everyone thinks a wealth tax is the best, or only, solution.\n\nA wealth tax targets the value of accumulated assets owned by rich Americans as opposed to their income and payrolls.\n\nMassachusetts Sen. Elizabeth Warren, who has released a proposal, said during the debate on Tuesday it is one of the only ways to ensure the country can make investments in the next generation.\n\n“Billionaires are making their money off their accumulated wealth and it just keeps growing,” she explained.\n\nIndependent Vermont Sen. Bernie Sanders – who has put forth a more aggressive wealth tax proposal – said on Tuesday that the U.S. cannot afford “to continue this level of income and wealth inequality” and “cannot afford a billionaire class whose greed and corruption has been at war with the working families of this country for 45 years.”\n\nAs the only billionaire on stage, Tom Steyer claimed he was one of the first 2020 candidates to propose a wealth tax and added that he would undo the Republican tax cuts for the rich.\n\nSouth Bend, Indiana, Mayor Pete Buttigieg said he is “all for a wealth tax.”\n\nFormer Texas lawmaker Beto O’Rourke said a wealth tax “is part of the solution” to address income inequality.\n\nFormer Housing Secretary Julián Castro also said a wealth tax is part of the answer, but also said he supported an inheritance tax, raising the top marginal tax rate, alongside investments in things like health care and affordable housing.\n\nMinnesota Sen. Amy Klobuchar said a wealth tax “could work” and that she is “open to it.” She also said she would repeal significant portions of the Tax Cuts and Jobs Act that helped the rich – including the corporate tax rate cut.\n\nOn the flip side, entrepreneur Andrew Yang said that while a wealth tax “makes sense in principle,” it has been tried in a number of countries belonging to the Organization for Economic Cooperation and Development (OECD) – like Germany and Denmark – which have since repealed it because it was hard to implement and generated less revenue than anticipated. Yang added the U.S. should learn from their experiences, and advocated for a value-added tax (VAT).\n\nFormer Vice President Joe Biden did not say he supported a wealth tax, but instead said he would raise the capital gains tax and eliminate loopholes in the tax code.\n\nCalifornia Sen. Kamala Harris said she would close the wealth gap using her LIFT the Middle Class Act, which provides working families with a tax credit. New Jersey Sen. Cory Booker said he would implement “fair taxes for the richest.”\n\nCLICK HERE TO READ MORE ON FOX BUSINESS\n\nRelated Articles", "description": "Here’s where the candidates stand.", "authors": ["Brittany De Lea"], "top_image": "https://s.yimg.com/cv/apiv2/social/images/yahoo_default_logo.png", "published_at": "2019-10-16"}