{"pub": "businessinsider", "url": "https://kotaku.com.au/2019/10/dragon-age-4-bioware-ea-dont-expect-until-2022", "downloaded_at": "2019-10-30 02:25:29.634378+00:00", "title": "Don't Expect Dragon Age 4 Until 2022 Sometime", "language": "en", "text": "The cancellation of NBA Live again wasn't the only sad nugget in EA's latest earnings call overnight. There was also a snippet about Dragon Age 4, namely that we shouldn't expect to hear anything about it for quite a while.\n\nTowards the end of the company's earnings call, an analyst asked EA's board for guidance on what Bioware was doing over the next couple of years and their pipeline post-Anthem. EA's chief operating officer and chief financial officer, Blake Jorgensen, said Dragon Age 4 \"probably comes after fiscal 2022\", but stressed that EA doesn't usually give multi-year guidance on future games in development, for obvious reasons.\n\nOnce Again, EA Cancels Its NBA Game EA Sports’ NBA Live 20, which had the honour of being officially delayed before it was even officially announced, has now been cancelled. It’s the fourth time in ten years that EA has not released an annual entry in its flagship basketball game on a home console. Read more\n\nIt's worth noting that EA operates on the US fiscal year here, so fiscal 2022 refers to the period between April 1, 2021 and March 31, 2022.\n\nAs an added bonus, they dropped a nice figure about The Old Republic. The game is on the verge of cracking $US1 billion in revenue to date from Bioware's ongoing MMO, which everyone seems to forget. The next Battlefield also wouldn't launch until fiscal 2022, primarily because EA was concerned that the install base of the new consoles wouldn't be high enough if the game launched sometime in 2020-2021.\n\nOther notes from the earning call worth noting included:\n\nThe Old Republic, Bioware's ongoing MMO, is about to crack $US1 billion in revenue to date;\n\nAnother Star Wars game may be released in fiscal 2022, potentially beforehand;\n\nMedal of Honor VR is still in development, but not due until fiscal 2021;\n\nStar Wars: Battlefront 1 and 2 have sold more than 33 million units combined;\n\nCurrent expectations for Jedi: Fallen Order is around 6 to 8 million units;\n\nTitanfall 3 \"could be a separate title in the future\" but EA wants to keep Respawn \"hyper-focused\" on Apex Legends.\n\nWork is also ongoing with a partner to port Apex Legends to mobiles, although that's not liable to pop up until next year when EA can get the game approved in China as well.", "description": "The cancellation of NBA Live again wasn't the only sad nugget in EA's latest earnings call overnight. There was also a snippet about Dragon Age 4, namely that we shouldn't expect to hear anything about it for quite a while....", "authors": ["Nathan Grayson", "Jason Schreier"], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/c_lfill,w_1200,h_628,q_90/q86u9cepecnhpocmcyz0.jpg", "published_at": "2019-10-30"}