{"pub": "telegraph", "url": "https://telegraph.co.uk/news/2019/10/08/justin-trudeau-accused-always-wearing-mask-rival-raises-blackface", "downloaded_at": "2019-10-08 04:09:53.555035+00:00", "title": "Justin Trudeau accused of 'always wearing a mask' as rival raises blackface row in leadership debate", "language": "en", "text": "Justin Trudeau has been accused of betraying Canadian voters, in a leadership debate in which he was mocked by his five rivals for being untrustworthy and superficial.\n\nWith two weeks before Canada votes for its next prime minister, Mr Trudeau, 47, and his Liberal Party are tied in a dead heat with his Conservative rival, Andrew Scheer, 40.\n\nThe two-hour debate — the only one to be held in English, the language spoken by two-thirds of Canada’s 38 million population — has traditionally been regarded as an important way of winning the minds of voters.\n\nImmediately obvious was how young the candidates were, compared to the septuagenarian crowd south of the border.\n\nMr Trudeau’s sunshine image has been battered by a gruelling electoral campaign. First he was accused of violating ethics rules when he tried to pressure his former justice minister and attorney general to drop criminal charges against a Quebec-based company. Then a series of embarrassing photos emerged of him in blackface at parties in his younger years.\n\n“He can’t even remember how many times he put blackface on, because the fact of the matter is he’s always wearing a mask,” said Mr Scheer.", "description": "Justin Trudeau has been accused of betraying Canadian voters, in a leadership debate in which he was mocked by his five rivals for being untrustworthy and superficial.", "authors": ["Harriet Alexander", "William Hague", "Judith Woods"], "top_image": "https://www.telegraph.co.uk/content/dam/news/2019/10/08/TELEMMGLPICT000212366705-xlarge_trans_NvBQzQNjv4BqNJjoeBT78QIaYdkJdEY4CnGTJFJS74MYhNY6w3GNbO8.jpeg?imwidth=1200", "published_at": "2019-10-08"}