{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/asia_pacific/chinas-communist-party-has-one-more-reason-to-celebrate--a-year-longer-in-power-than-the-soviet-union/2019/09/28/993bb832-dfc0-11e9-be7f-4cc85017c36f_story.html", "downloaded_at": "2019-09-29 23:31:25.610205+00:00", "title": "China’s Communist Party has one more reason to celebrate — a year longer in power than the U.S.S.R.", "language": "en", "text": "\n\nXi Jinping has proved himself to be a fervent disciple of Mao and has made the perpetuation of Communist Party leadership his top priority. (Xie Huanchi/Xinhua News Agency/Getty Images)\n\nThe Soviet Union disintegrated, Xi Jinping said when he became the leader of the Chinese Communist Party seven years ago, because its leaders changed their ideals and beliefs too quickly and too radically.\n\n“It’s a profound lesson for us!” he said in a speech to cadres in December 2012.\n\nAnd one that Xi has assiduously put into action as China moves toward a milestone on Tuesday — a huge military parade and other events to mark seven decades since the Chinese Communist Party established the People’s Republic of China.\n\nHe learned from the Soviets not to denounce the party’s elder statesman and not to try any kind of political opening.\n\nThe Chinese Communist Party will reach a moment the U.S.S.R. did not: 70 years in power — one more than the Soviet Union lasted.\n\n“They have now surpassed the Soviet Union, and that really matters to these guys,” said Randal Phillips, a former CIA station chief in Beijing. “They have been paranoid ever since the Soviet Union fell, so to endure for longer means a lot to them.”\n\nThe parade will be a manifestation of what Xi sees as China’s proper status: a strong and proud country that is not beholden to the capitalist West.\n\n[China can’t control the weather for its big bash. But it’s trying.]\n\nColumns of tanks and intercontinental ballistic missiles will rumble through the streets, and fighter jets and 70,000 doves will adorn the skies. Soldiers will cover exactly one meter with every two goose-steps. More than 300,000 civilians will accompany the floats in the parade.\n\nXi has ushered the Communist Party to this moment by becoming, as Richard McGregor, the author of a book on the party, puts it, the “reddest leader of his generation.” Xi is a die-hard follower of Mao Zedong, the Communist Party and the communist canon, and a “true believer” in the party’s right to rule China, McGregor said.\n\nWhen he became China’s top leader at the end of 2012, many analysts and Western governments thought that Xi would be a reformer like his father, Xi Zhongxun, who was a peer of Mao’s.\n\nInstead, Xi has proved himself to be much more a disciple of Mao — and therefore of Mao’s inspiration, Stalin — than a follower of his father’s approach. And he has made the perpetuation of Communist Party leadership his top priority.\n\n\n\nPeople at a 70th anniversary exhibition take pictures in front of portraits of Chinese leaders, including, from left, Mao Zedong, the first head of the communist Chinese state and longtime party chairman, Deng Xiaoping, Jiang Zemin, Hu Jintao and President Xi Jinping. (Wang Zhao/AFP/Getty Images)\n\nHe constantly espouses the importance of “loyalty to the center” — the leaders in Beijing — and “staying true to the original aspiration of the party.”\n\n“Xi Jinping has reinvigorated ideology to an extent we have not seen since the Cultural Revolution,” John Garnaut, an Australian analyst of China, said in a speech to Australian officials. “In Xi’s view . . . the cost of straying too far from the Maoist and Stalinist path is dynastic decay and eventually collapse.”\n\nIn recent weeks, Xi has been very obviously trying to walk in Mao’s footsteps, carrying out guidance tours on farms and in factories in interior provinces. At every turn, he has been talking of the need to continue the “struggle.”\n\nIn a bombastic speech at a Communist Party school recently, Xi impressed that message on the young officials. China’s great rejuvenation could not be achieved without a “great struggle” to achieve a “great dream,” Xi said, calling on the cadres to use their “combat spirit” to tackle the many challenges facing the country.\n\n[Paramount and paranoid: China’s Xi faces a crisis of confidence]\n\nChina is richer and stronger than ever before. Its gross domestic product per capita has risen from about $200 at the republic’s founding in 1949 to more than $10,000 per head now. The party likes to say that it has lifted 750 million people out of poverty. China now accounts for one-third of global sales of luxury goods.\n\nXi has channeled resources into modernizing the military, including building China’s first aircraft carrier, and the space program. After landing a lunar rover on the dark side of the Moon this year, China hopes to send a probe to Mars next year.\n\nHe has also launched an expansionist and aggressive foreign policy centered on his $1 trillion “Belt and Road” infrastructure initiative.\n\nChina is now the world’s ­second-largest economy and could overtake the United States for top spot as soon as next year.\n\nBut its trajectory has been far from smooth — massive famine, political chaos and the repression of the Cultural Revolution.\n\nThe Xi family experienced this firsthand. Xi’s father was purged, and Xi was sent to the countryside, forced to dig trenches and wear a metal dunce cap. But he has said that rather than turning him against Mao, the experience was formative for him as a Communist Party cadre.\n\nMao was “70 percent right, 30 percent wrong” in the way he led, Xi has said.\n\n\n\nChinese President Xi Jinping arrives for the closing session of the National People’s Congress at the Great Hall of the People in Beijing in 2018. (Nicolas Asfouri/AFP/Getty Images)\n\nA second period in the republic’s history came with the “reform and opening” era led by Deng Xiaoping, which sparked China’s astonishing economic transformation. But it also involved the crackdown on pro-democracy demonstrators who massed in Tiananmen Square and around the country in 1989, resulting in hundreds and perhaps thousands of deaths.\n\n“This anniversary is the first chance that Xi has had to really explicitly tie himself to the legacy of the Chinese Communist Party’s foundation of the People’s Republic,” said Rana Mitter, professor of Chinese history at the University of Oxford.\n\nTo achieve this vision of a strong and confident China, Xi has elevated himself to the same political level as Mao and Deng, adding his name into the constitution and removing presidential term limits so he can theoretically serve indefinitely — undoing an initiative designed by Deng to ensure that China did not return to the kind of personality cult of the Mao era.\n\nTo stamp out dissent, the party has cracked down on lawyers, human rights activists and other members of civil society. It has overseen a sweeping campaign to forcibly assimilate ethnic minorities, detaining about 1 million Uighurs in re-education camps in Xinjiang. Xi has steered an anti-corruption campaign so extensive that it has led to the arrest of more than 1.5 million people.\n\n[How China seeks to suppress memories of Tiananmen]\n\n“The history of the People’s Republic of China is one of aspiration, destruction, ambition, confidence and anxiety,” said Klaus Mühlhahn, professor of Chinese history at the Free University of Berlin.\n\n“I think a lot of Chinese policy is driven by fear,” he said. “This fear of losing power, of a development similar to what happened in the Soviet Union, shapes much of the policy and thinking.”\n\nThat anxiety and fear are only increasing as the party faces new and significant challenges.\n\nFor starters, Xi is locked in a protracted trade war with the United States that coincides with the most rapid cooling in economic growth in a generation. Premier Li Keqiang recently said it would be difficult for China, which enjoyed double-digit growth just over a decade ago, to maintain 6 percent growth.\n\nBut Tao Wenzhao, a political analyst at the state-affiliated Chinese Academy of Social Sciences, said that the trade war would not influence the celebration.\n\n“If there was no trade war, we would still be celebrating,” he said. “Competition has become the new normal. We see it in every area.”\n\nAnother problem: Hong Kong. The protests there against the mainland’s efforts to exert control over the former British colony are set to come to a head on Tuesday, with a huge counter-rally planned to coincide with the parade.\n\nAs the anniversary nears, the party is doing its best to make sure the 1.4 billion people of China feel proud and remain loyal.\n\n“Over the past 70 years, China’s success boils down to the Communist Party’s leadership,” it said in a 49-page white paper published Friday hailing the achievements of the past seven decades, and particularly of the past seven years, since Xi took the reins.\n\n“The Chinese nation has risen and become prosperous, and is becoming strong, closer to the goal of national rejuvenation than ever before,” it said. “China’s development path will look on brighter and brighter prospects as time moves on.”\n\nRead more\n\nChina loves its pork. But prices are rising and that could be a problem.\n\nChina celebrates ‘very happy lives’ in Xinjiang amid major crackdowns\n\nXi’s China seeks to put state stamp on faith\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "description": "President Xi Jinping ushered the country to its 70-year milestone by emulating Mao, not Soviet reformers.", "authors": ["Anna Fifield", "Beijing Bureau Chief.", "September At Am"], "top_image": "https://www.washingtonpost.com/resizer/tD6jdhyQ9OG-lh6yxNz54FZN3xM=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/2SE23HHBNQI6TPT7JTEFAF6DN4.jpg", "published_at": "2019-09-28"}