{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7539873/PETER-OBORNE-Men-terror-NEVER-allowed-exploit-Brexit.html", "downloaded_at": "2019-10-05 07:28:30.127031+00:00", "title": "PETER OBORNE: Men of terror must NEVER be allowed to exploit Brexit", "language": "en", "text": "The poet Seamus Heaney, in his Nobel Prize acceptance speech, described it as ‘one of the most harrowing moments in the whole history of the harrowing of the heart in Northern Ireland’.\n\nHe was referring to the Kingsmill massacre of January 1976, when textile workers were travelling home on a minibus that was flagged down in the darkness by a man flashing a light.\n\nThe one Catholic among them was identified and told to run away, while ten of the remaining 11 Protestants were shot dead by an IRA gang.\n\nThe Irish border is still haunted by countless tragedies such as Kingsmill, but, thankfully, those years of violence and lawlessness ended in 1998, writes PETER OBORNE\n\nThis horrific atrocity happened in South Armagh — one of the areas that is now at the centre of the Brexit debate, as it is adjacent to the Northern Ireland/Republic of Ireland border.\n\nDespite Prime Minister Boris Johnson this week devising what he says is a ‘genuine attempt to bridge the chasm’, with a plan to keep Northern Ireland within the EU’s single market for goods while leaving the customs union, he has never visited the borderlands.\n\nFor my part, I recently went to this area of the United Kingdom whose future holds the key to Johnson’s attempts to strike a deal that will enable us to leave the EU on October 31.\n\nThe Irish border is still haunted by countless tragedies such as Kingsmill, but, thankfully, those years of violence and lawlessness ended in 1998.\n\nNow, as I found, the border area is peaceful. People can travel between north and south with ease. There are two reasons for this transformation. Firstly, the creation of the European single market, which was championed by Margaret Thatcher in the Eighties.\n\nOnce the Irish Republic and Northern Ireland became part of the same trade network, there was no longer any need for customs checks. Smugglers who organised huge illegal trading operations —often with the connivance of terrorists — disappeared.\n\nSorry Tory story for poor Rory Ten years ago, in the wake of the MPs’ expenses scandal, David Cameron issued an invitation for people from a wide spectrum of professions to put themselves forward to be Tory parliamentary candidates. What a damning indictment of the Tory high command, then, that Rory Stewart has this week decided to quit Parliament Believing that former diplomat Rory Stewart would make a great MP, I urged him to apply. He was duly elected to represent Penrith and The Border. I am delighted I might have played a small role in his decision to enter politics. He has been a force for civility and decency, and brought to the Commons the perspective of a well-travelled life, which is too rare these days. What a damning indictment of the Tory high command, then, that Rory Stewart has this week decided to quit Parliament.\n\nSecondly, the Good Friday Agreement, signed in 1998. As a result, the IRA laid down their weapons and the British Army withdrew.\n\nNow, though, dark clouds threaten again. The problem is that Britain’s departure from the EU’s customs union means there would be different regulatory systems in the Republic and Northern Ireland. This would inevitably entail a return to border customs checks. In turn, this would undoubtedly lead to a return of those smuggling gangs.\n\nNever forget the smugglers’ links with the men of terror who, since 1998, have put their efforts into commercial criminal activities, rather than killing Protestants.\n\nThe folk I met in Bessbrook, South Armagh, are convinced that customs checkpoints would become targets for the men of violence. Everyone I spoke to expressed the same fears.\n\nFor example, I asked an elderly man I met in the street walking his dog what the return of a hard border would mean.\n\nHe replied: ‘An absolute disaster.’ He told me his name was Alan Black — and that he was the sole survivor of the Kingsmill massacre. He and his ten Protestant friends had been ordered off their minibus, lined up and shot.\n\nAlan was shot 18 times — ‘they hit me in the head, but the bullet didn’t penetrate my skull’. He played dead and miraculously survived. He told me: ‘You’re going to get the hard men coming out of the woodwork and trying to attack the border posts — which means sending police to protect them and the Army to protect the police.’\n\nHis chilling warning is a stark reminder that we must not take the Irish border question lightly. If the Government gets Brexit wrong, it would mean a return of the horror and violence that disfigured these beautiful lands for the past three decades of the 20th century.\n\nHere is the dilemma.\n\nPeople who voted for Brexit understandably feel that the knotty Irish question should not prevent Britain leaving the EU.\n\nBut people who live in places such as Bessbrook fear that Brexit threatens mayhem.\n\nIt is against this bloody background that Boris Johnson believes he has found a solution.He has accepted the need for border customs checks. But he assures us that his proposal would not require any physical infrastructure of the kind the men of violence could target.\n\nThere is a good chance the PM’s plan will prevail. Several Labour MPs will support it. Many of the 21 Tories stripped of the party whip will do so, too.\n\nCrucially, for the arithmetic of Commons votes, the Democratic Unionist Party (DUP) has also welcomed Johnson’s proposals.\n\nThis means he has a fighting chance of securing a parliamentary majority for his deal. If that was achieved, Brussels would have to consent. On the assumption that all those hurdles are jumped, Britain would leave the EU in 26 days’ time.\n\nBut the biggest obstacle is to persuade the Irish government.\n\nHere is the biggest threat to Brexit. The Taoiseach (Prime Minister) Leo Varadkar welcomed Johnson’s claim that there would be no new physical border infrastructure, but tellingly said he didn’t understand ‘how we can have Northern Ireland and the Republic of Ireland in separate customs unions and somehow avoid there being tariffs and checks and customs posts’. Meanwhile, Aodhan Connolly, director of the Northern Ireland Retail Consortium, said Johnson’s plans would lead to ‘complexity, delays, tariffs, VAT and cost rises’. He added: ‘These proposals are unworkable and unpalatable.’\n\nJust as forceful were the words of the Independent MP for North Down, Sylvia Hermon. She told the Commons this week: ‘What people in Northern Ireland really want, all of them, is to continue to enjoy the peace and stability delivered by the Belfast/Good Friday Agreement.’\n\nAs the widow of the former Chief Constable of the Royal Ulster Constabulary, Sir Jack Hermon, she was closer than most to the terrible effects of the Troubles.\n\nMy worry is that not enough people understand the depths of these legitimate worries. Boris Johnson has said that failure to reach an agreement with Brussels would be because of ‘technical’ disagreements. But the truth is that the problem of the Irish border is much more than that.\n\nThe history of Britain and Ireland has been marred by almost 1,000 years of tragic interaction. This cannot be forgotten.\n\nTo his great credit, the Prime Minister has made it clear he is ready to negotiate and make concessions. Of late, there has been a welcome new graciousness in his language.\n\nThat’s why, contrary to the views of many commentators, I believe a deal may be struck and Britain will leave the EU at the end of the month. But I remain certain of one thing: any deal must be true not just to the letter but to the spirit of the Good Friday Agreement.\n\nAnd it must quell the profound worries of British citizens such as IRA victim Alan Black who fear, on the basis of long and terrible personal experience, that Brexit risks an end to peace and, unforgivably, a return to violence.", "description": "The folk I met in Bessbrook, South Armagh, are convinced that customs checkpoints would become targets for the men of violence. Everyone I spoke to expressed the same fears.", "authors": ["Peter Oborne For The Daily Mail"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/05/00/19319506-0-image-a-8_1570232268839.jpg", "published_at": "2019-10-04"}