{"pub": "news.com.au", "url": "https://realestate.com.au/news/the-block-2019-biggest-block-yet-was-too-big-and-too-ambitious/?rsf=syn:news:nca:news:spa:strap", "downloaded_at": "2019-10-25 00:35:48.349585+00:00", "title": "The Block 2019: ‘biggest Block yet’ was ‘too big and too ambitious’", "language": "en", "text": "Twelve weeks into the 2019 season of The Block and the cracks are well and truly on show.\n\nBickering between contestants, tight budgets and the enormous build are getting to some as the finish date draws closer.\n\nDubbed the “biggest Block yet” on all promotions for the show, popular Hipages tradie Matt Menichelli from Elevate Building Group reveals the size of the project took a toll on all those involved.\n\nRELATED: The Block 2019: Behind the scenes as relationships sour\n\nThe Block 2019: What it’s like to be a tradie on The Block\n\nThe Block 2019: When Mitch and Mark knew they had nailed it\n\n“It is commonly acknowledged it was too big and too ambitious,” Mr Menichelli said.\n\n“The effect it took on trades and contestants, a lot of trades dropped out along the way as it was too much.\n\n“Any standard job would be a walk in the park for them, but this was different; sometimes working 90-100 hours a week.”\n\nHe said this season of The Block was definitely the biggest one he had worked on.\n\n“It was also the most labour intensive from a builder’s point of view,” he said.\n\nMr Menichelli said it was difficult because the biggest challenge each week was just to finish.\n\nHe said they would have loved to have more time to focus on the fixtures and fittings and put more feature pieces in.\n\n“It was a bit of a juggling act,” he said.\n\nIn last night’s episode Tess and Luke seemed to be struggling the most, with Tess saying: “I just want to go home”.\n\nMr Menichelli, who is their builder, said they were between a rock and a hard place financially and mentally.\n\nHe said they were trying to juggle whether they tried to do a really good room to get a win or scrimp and save just to finish the competition.\n\n“In conjunction with a lack of sleep, it was all taking its toll, but that is the nature of the competition,” he said.\n\nMORE: The Block 2019: Failed St Kilda auction warning sign for The Oslo\n\nMelbourne suburbs buyers should target: John McGrath’s top five\n\nDonvale dream garage: Custom pad a rev-head’s dream\n\ntessa.hayward@news.com.au", "description": "It was dubbed the “biggest Block yet” but it’s “commonly acknowledged” the juggernaut reno show sanded off more than it could sweep away, with one tradie taking us behind the scenes.", "authors": ["Tessa Hayward"], "top_image": "https://www.realestate.com.au/blog/wp-content/uploads/2019/10/23110344/capi_744b4860af860a82409fc7397ae6b3b8_853081a79a1c46b5d0b35d930effbe80.jpeg", "published_at": "2019-10-23"}