{"pub": "abcnews", "url": "https://abcnews.go.com/Sports/penn-state-football-coach-blasts-alumni-letter-criticized/story?id=66159335", "downloaded_at": "2019-10-09 18:38:25.601878+00:00", "title": "Penn State football coach blasts alumni letter that criticized player's hair", "language": "en", "text": "After a Penn State player received a critical letter from a Nittany Lion alum, the team's coach denounced the remarks and took the opportunity to boast about the player's character as a student, athlete and person.\n\n\"Jonathan Sutherland is one of the most respected players in our program,\" Franklin said at his weekly news conference, according to ESPN. \"He's the ultimate example of what our program is all about. He's a captain, he's a dean's list honor student, he's confident, he's articulate, he's intelligent, he's thoughtful, he's caring and he's committed.\"\n\nFranklin continued, \"He's got two of the most supportive parents, and I would be so blessed if my daughters would marry someone with his character and integrity one day.\"\n\nSutherland shared a photo on Twitter Tuesday of the letter he received from Dave Petersen, who critiqued his dreadlocks, appearance and demeanor.\n\nIn the letter, Petersen wrote, \"Though the athletes of today are certainly superior to those in my days; we miss the clean cut young men and women from those days. Watching the Idaho game on TV we couldn't help but notice your -- well -- awful hair.\"\n\n\"Surely there must be mirrors in the locker room! Don't you have parents or [a] girlfriend who've told you those shoulder length dreadlocks look disgusting and are certainly not attractive,\" the Johnstown, Pennsylvania, resident wrote.\n\nIn the same tweet, Sutherland penned his own response to Petersen that took the high road and encouraged others to embrace what makes them different.\n\nIcon Sportswire via AP, FILE\n\n\"Although the message was indeed rude, ignorant, and judging, I've taken no personal offense to it because personally, I must respect you as a person before I respect your opinion,\" the sophomore safety said. \"At the end of the day without an apology needed, I forgive this individual because I'm nowhere close to being perfect and I expect God to forgive me for all the wrong I've done in my life.\"\n\nSutherland, 21, cited Colossians 3:13 -- \"Bear with each other and forgive one another if any of you has a grievance against someone\" -- to further point to forgiveness and thanked everyone who reached out to show him support.\n\n\"Let this be one of the many examples to us that in the year 2019, people of different cultures, religions and ethnicities are still being discriminated against and it needs to stop,\" he wrote.\n\nOne of Sutherland's teammates, C.J. Holmes, 21, shared a photo of the letter and said \"these messages cannot be tolerated\" calling it \"extremely inappropriate, racially biased and selfish.\"\n\nmy teammate got this in the mail today, and tbh Im at a lost for words.. I also have locs, Tats, and NFL dreams too, these messages can not be tolerated, this was extremely inappropriate, racially biased, and selfish to feel like you even have a right to send this message #WeAre pic.twitter.com/DPTp9Km9yt — ㅤ (@CjHo1mes) October 7, 2019\n\nSince the national public attention and backlash to his letter, Petersen spoke with The Tribune-Democrat and said that a racist message \"was not the intent at all.\"\n\n\"I would just like to see the coaches get the guys cleaned up and not looking like Florida State and Miami guys,\" he told the Tribune-Democrat.\n\nHe added that his letter, \"wasn't threatening or anything. I was just disgruntled about some of the hairdos that we're seeing. You think of Penn State as a bunch of clean-cut guys. And you do see so many who are clean cut. But the tattoos and the hair -- there are a lot of guys with hair coming down their backs and it just looks awful. And it's the same for the NFL and NBA, too.\"\n\nPaul Sancya/AP, FILE\n\nThe university strongly condemned the letter's message in a reply on Twitter and a university spokesperson told ESPN that school officials stand behind their student-athletes.\n\n\"At Penn State we strive to create an atmosphere that promotes inclusivity and respect,\" the spokesperson said. \"The well-being of students, faculty and staff members is the university's priority. As part of this, Penn State provides a range of assistance and resources for students and employees, and we encourage any community member who needs support to reach out.\"", "description": "Penn State football player Jonathan Sutherland received a letter from an alum of the school who was critical of his appearance and dreadlocks.", "authors": ["Abc News"], "top_image": "https://s.abcnews.com/images/Sports/sutherland-ap-ps-191008_hpMain_16x9_992.jpg", "published_at": "2019-10-09"}