{"pub": "thenextweb", "url": "https://thenextweb.com/plugged/2019/10/14/huaweis-foldable-mate-x-will-reportedly-launch-this-october-in-china", "downloaded_at": "2019-10-14 23:18:29.065031+00:00", "title": "Huawei’s foldable Mate X will reportedly launch this October in China", "language": "en", "text": "Foldable phones feel like the future, but the path there isn’t easy – just ask Samsung. That phone’s early woes almost certainly influenced Huawei to delay the release of its own foldable device. The Mate X was originally slated to be released in June, but with all of the issues plaguing the Galaxy Fold – not to mention the US blacklist – we’ve heard little about when the device would eventually hit the markets.\n\nApparently, that might be quite soon. A report from cnBeta suggests the Mate X will arrive in China in limited quantities by the end of this month. It will likely go out in a small batch to quell any potential early issues – which the Mate X seems particularly at risk for, considering its design. Whereas the Galaxy Fold hides the screen when folded, the Mate X keeps it as exposed to the elements as ever. Given a plastic screen, it’s hard to imagine the phone being able to take much of a beating.\n\nStill, I certainly prefer the idea of having a larger screen when folded. Who knows, maybe Huawei will surprise us with a more durable protective material.\n\nCorroborating the report of an October launch is the fact it appears some have already gotten their hands on retail units (or at least retail packaging):\n\nMate X unboxing reveal similar carrying case as Huawei-Gentlemonster smart glasses.#HuaweiMateX pic.twitter.com/XFuzeClyNM — Teme (特米) (@RODENT950) October 13, 2019\n\nGiven new Huawei devices are unable to run Google Play Services, the company might not even bother to bring such an experimental device outside of China, but if we want foldable phones to get better, Samsung needs some legitimate competition. Hopefully the Mate X can provide that.\n\nVia Android Central\n\nFor more gear, gadget, and hardware news and reviews, follow Plugged on Twitter and Flipboard.", "description": "", "authors": ["Napier Lopez", "October"], "top_image": "https://img-cdn.tnwcdn.com/image/plugged?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F06%2FMate-X.jpg&signature=2dd98f218be00ea314281f0b6c9215a5", "published_at": "2019-10-14"}