{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/06/warrens-plan-does-not-prevent-biden-scenario", "downloaded_at": "2019-10-07 00:14:41.360951+00:00", "title": "Warren’s Anti-Corruption Plan Does Not Prevent Hunter Biden Scenario", "language": "en", "text": "An anti-corruption plan put forth by Sen. Elizabeth Warren (D-MA) in the 2020 Democrat presidential primary would not prevent a scenario where a sitting vice president’s child is allowed to serve on the board of a foreign corporation, as former Vice President Joe Biden’s son did.\n\nReleased last month, Warren’s plan to “End Washington Corruption” seeks to end a series of loopholes where presidents, vice presidents, lawmakers, and their family members have been able to effectively sell influence to line their pockets — a scheme that the Clintons were famously accused of with the Clinton Global Foundation, and one which Biden and his son, Hunter Biden, are now accused.\n\nIn April 2014, as Breitbart News’ Haris Alic has reported, Hunter Biden was appointed to serve on the board of Ukrainian oil company Burisma despite having no qualifications do to so. At the same time, Biden led the Obama administration’s response to Russia’s invasion of Crimea, pushing billions of dollars in U.S. taxpayer aid to the Ukrainian government. Some of that money allegedly filtered out to Burisma, the corporation of which Biden’s son was a board member.\n\nWhen asked last month whether her anti-corruption plan would prevent a case where a sitting vice president’s child could serve on the board of a foreign corporation, Warren evaded the question, saying “I don’t know.”\n\n“I’d have to go back and look at the details on the plan,” Warren said.\n\nA review of Warren’s anti-corruption plan, though, reveals that there is no explicit language preventing another case where a sitting vice president’s child can serve on the board of a corporation, let alone a foreign corporation.\n\nThe closest Warren’s plan comes to dealing with a Hunter Biden scenario is banning lawmakers and their staff from serving on the boards of corporations, domestic and foreign.\n\n“My plan bans members of Congress and senior congressional staff from serving on corporate boards — whether or not they’re paid to do so,” the plan states.\n\nWhile Warren’s plan would mandate presidential transition team members to disclose their involvement with corporations, foreign governments, and other potential conflicts of interest, this portion of the plan does not extend to members of an administration who later involve themselves in potential conflicts of interest.\n\n“It also strengthens ethics requirements for presidential transition teams to ensure that those who are shaping our government disclose any conflicts of interest and comply with the highest ethical standards,” the plan reads.\n\nThough the Hunter Biden question was asked of Warren almost two weeks ago, her campaign has yet to follow up on whether they would revise their anti-corruption plan to include banning the family members of sitting vice presidents from serving on the boards of foreign corporations.\n\nJohn Binder is a reporter for Breitbart News. Follow him on Twitter at @JxhnBinder.", "description": "Warren's anti-corruption plan would not prevent a scenario where a vice president's child serves on the board of a foreign corporation.", "authors": ["John Binder"], "top_image": "https://media.breitbart.com/media/2019/10/GettyImages-1179052357-640x335.png", "published_at": "2019-10-06"}