{"pub": "nymag", "url": "https://nymag.com/strategist/article/best-10-year-wedding-anniversary-gifts.html", "downloaded_at": "2019-09-12 23:37:31.948187+00:00", "title": "The Best 10-Year Wedding Anniversary Gifts", "language": "en", "text": "17 items in this article 1 item on sale! Photo: Courtesy of the retailers\n\nA decade of marriage is nothing to sneeze at. By now you can probably communicate wordlessly and you’ve surely found even more things to love about each other since your wedding day. So to celebrate your anniversary, you’ll want to choose a gift that shows how much you still appreciate your husband or wife.\n\nBut if you’ve been buying gifts in accordance with the traditional anniversary guidelines, you might be stumped by the prescribed ten-year options: tin or aluminum. Since we’re not ones to shy away from a shopping puzzle here at the Strategist, we’ve taken it upon ourselves to find the best gifts (the lion’s share culled from our archive of expert-approved products) made from these less than romantic materials — for all types of couples.\n\nFor the couple who likes to cook\n\nAll-Clad 4212 Stainless Steel 2-Quart Saucier Sure the exterior of this chef-recommended pan is stainless steel, but it’s the inner aluminum core that ensures it heats up evenly. Tony Cacace, executive chef of Oro Restaurant, tells us “It will handle everything from oatmeal and black-rice porridge for breakfast to risotto for dinner and ice-cream bases for dessert.” $145 at Amazon Buy $145 at Amazon Buy\n\nFor the (discerning) couple who likes to cook\n\nFor the couple who likes to cook outdoors\n\nGSI Outdoors Halulite Ketalist II Cookset If you and your partner enjoy camping, this set of insulated aluminum cookware lets you enjoy some of your favorite meals from the comfort of your tent. $35 at REI Buy\n\nFor the couple who likes to bake\n\nNordic Ware Crown Bundt Pan This elegant aluminum bundt pan will create impressive-looking cakes for special occasion baking, and it’s pretty enough to keep on display. $40 at Food52 Buy\n\nFor the couple who likes to eat\n\nFor the couple who likes to eat dessert\n\nLouis Sherry Orchid 12-Piece Chocolate Truffle Tin Even after you finish these chocolate truffles (flavors include “Strawberry Romanoff” and “Sicilian Orange”) you’ll want to keep the classic box around for storing trinkets. $12 at Nordstrom Buy\n\nFor the couple who likes to eat dessert (and hot sauce)\n\nFor the couple who likes to share a cuppa\n\nFor the couple into umami\n\nBlack Tie Mercantile Bela Portuguese Sardines 4-Flavor Variety If you think no meal is complete without a bit of the “fifth taste,” you’ll love adding these sardines (in flavors like tomato sauce and lemon-flavored olive oil) to sandwiches, pizzas, and more. $23 at Amazon Buy $23 at Amazon Buy\n\nFor the hygge couple\n\nMuji Tin Candle — Green Log Fire According to Strategist beauty writer Rio Viera-Newton these candles “smell wintry and the right kind of smoky and woody,” and are a dupe for the much more expensive Diptyque Feu de Bois. $6 at Muji Buy\n\nFor the couple into status scents\n\nLe Labo Labdanum 18 Solid Perfume Branch out from Santal 33 with this highly portable, spill proof solid perfume (available in a bunch of Le Labo’s sophisticated scents) that’s a favorite of writer Kaitlin Phillips. “Massaging a pea-size amount of it onto your wrists is as innocuous as quickly applying hand lotion,” she tells us. “You won’t get any tsks from fellow passenger ladies on the subway.” We’re not 100 percent sure the sleek metallic case is made from tin, so opt for one of the brand’s candles if you want to play it safe. $94 at Saks Fifth Avenue Buy\n\nFor the couple who subscribe to the Criterion Channel\n\nAnker Nebula Capsule Smart Wi-Fi Mini Projector In an ode to the portable projector that she and her husband use for watching streaming media on a 120-inch display, writer Rachel Rosenblit says, “this aluminum cube lets me pretend I’m at the movies.” Her exact model is no longer available but this one (which is the size of a soda can) gets rave reviews on Amazon and is also, appropriately, made from aluminum. $300 at Amazon Buy $300 at Amazon Buy\n\nFor the couple who bikes to work\n\nDahon 2019 Mariner 20 In. Folding Bike $645 (was $700, now 8% off) Thanks to its lightweight aluminum frame and compact folding design, this Dahon bike is perfect for commuting. Biking experts we consulted say it can accommodate riders under five feet tall, over 6 feet, and everywhere in between.” $645 at Amazon Buy $645 at Amazon Buy\n\nFor the couple who needs a vacation\n\nAway Travel The Bigger Carry-On Aluminum Edition Frequent flyers agree Away makes some of the best rolling luggage around — and they’re worth the price. “My suitcases get beat to hell so I don’t mind paying a bit more for one that will last,” says writer and photographer Nicholas Gill. “It’s sturdy but light, and has a USB charger so I can charge my phone just enough to order an Uber.” This shiny aluminum model will stand out on the baggage carousel. $495 at Away Travel Buy\n\nFor the vanlife couple\n\nAirstream Trailer Cooler t’s technically made from an upcycled steel barrel, but this Airstream cooler has the same tin-can aesthetic as its namesake trailer. $695 at Airstream Supply Company Buy\n\nget the strategist newsletter Actually good deals, smart shopping advice, and exclusive discounts. Email Terms & Privacy Notice By submitting your email, you agree to our Terms and Privacy Notice and to receive email correspondence from us.\n\nThe Strategist is designed to surface the most useful, expert recommendations for things to buy across the vast e-commerce landscape. Some of our latest conquests include the best acne treatments, rolling luggage, pillows for side sleepers, natural anxiety remedies, and bath towels. We update links when possible, but note that deals can expire and all prices are subject to change.", "description": "We found tin and aluminum gifts (traditionally given for the ten-year anniversary) including fancy olive oil and sardines, All-Clad pans, Away luggage, Louis Sherry truffles, Lamy fountain pens, an Airstream cooler, and more.", "authors": ["The Editors"], "top_image": "https://pixel.nymag.com/imgs/daily/strategist/2019/09/12/10-year-anniversary-gifts/tenth-anniversary-gifts.w1200.h630.jpg", "published_at": "2019-09-12"}