{"pub": "reuters", "url": "https://reuters.com/article/us-syria-security-turkey-usa-russia/we-werent-warned-about-u-s-plan-to-pull-troops-from-syria-northeast-kremlin-idUSKBN1WN0YJ", "downloaded_at": "2019-10-08 12:54:51.276730+00:00", "title": "We weren't warned about U.S. plan to pull troops from Syria northeast: Kremlin", "language": "en", "text": "FILE PHOTO: Kremlin spokesman Dmitry Peskov attends a meeting, dedicated to the upcoming televised phone-in of Russian President Vladimir Putin with citizens, in Moscow, Russia June 19, 2019. Sputnik/Alexei Nikolsky/Kremlin via REUTERS\n\nMOSCOW (Reuters) - Russia was not informed in advance by the United States or by Turkey about U.S. plans to pull troops back from Syria’s northeast border region ahead of a Turkish military operation, the Kremlin said on Tuesday.\n\nRussia, a close ally of Syrian President Bashar al-Assad, has emerged as a leading power broker in Syria over more than eight years of civil war and has said that Syria’s territorial integrity must be respected by all outside powers.\n\nTurkey said earlier on Tuesday that it had finished preparing for a military operation in northeast Syria after Washington began withdrawing its troops.\n\nKremlin spokesman Dmitry Peskov said Moscow had not been given advance warning.\n\n“No, no one notified (us),” he told reporters on a conference call.\n\nHe added that it remained to be seen, however, how many U.S. troops would actually be withdrawn. He noted what he said were past U.S. statements about troop withdrawals that had not led to concrete action.\n\n“We are very closely watching the situation,” he said.", "description": "Russia was not informed in advance by the United States or by Turkey about U.S. plans to pull troops back from Syria's northeast border region ahead of a Turkish military operation, the Kremlin said on Tuesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s1.reutersmedia.net/resources/r/?m=02&d=20191008&t=2&i=1438408227&w=1200&r=LYNXMPEF970K1", "published_at": "2019-10-08"}