{"pub": "thenextweb", "url": "https://thenextweb.com/artificial-intelligence/2019/10/10/watch-this-ai-cop-car-fight-an-ai-jeep", "downloaded_at": "2019-10-11 00:16:04.880856+00:00", "title": "Watch this AI cop car fight an AI Jeep", "language": "en", "text": "A machine learning developer named Sebastian Schuchmann recently developed a pair of neural networks. At first, they were like siblings, learning their way in a strange new world together with only one another for company. Then he forced them to fight for the amusement of his YouTube subscribers.\n\nThe networks, represented as a police cruiser and a green Jeep in a video game world, were created in Unity3D. Shuchmann, in a response to the video on his YouTube page, said:\n\nThe Unity guys have a Machine Learning Framework called ML-Agents, which I use for most of my stuff. It implements algorithms like PPO (this is the same stuff OpenAI uses). I am currently in the process of moving more of my training over in the cloud to speed up the production time.. but of course this comes at a cost.\n\nEach neural network was built to use reinforcement learning to complete a specific task. In this case, the police car has to stop the Jeep from crossing a white line. If it succeeds it’s rewarded, if it fails it’s punished. The adverse is true for the Jeep.\n\nYour mind probably isn’t blown after watching that – the cars mostly sort of get lost and go in circles with the occasional brief spat of movement that makes sense. But this is an excellent representation of how reinforcement learning works. Machines, under the current AI paradigm, figure things out using brute force. Early in the video the cars just sit there motionless, later they’re almost playing the game.\n\nGiven enough time, these cars would probably exhibit superhuman tactics as they continued to optimize their networks to achieve their goal. Some AI experts fear this kind of ‘open-ended’ learning situation could result in a doomsday scenario.\n\nBut, for now, this is just a really cool way to gain insight into how machines ‘think’ using today’s machine learning systems. You can check out Shuchmann’s other videos here.\n\nVisit out our Artificial Intelligence section for more news and analysis from the world of AI.", "description": "", "authors": ["Tristan Greene"], "top_image": "https://img-cdn.tnwcdn.com/image/tnw?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2019%2F10%2Faifight.jpg&signature=e0b8f7ecf33866905969f670bbc256e7", "published_at": "2019-10-10"}