{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/sep/13/editorials-from-around-new-england", "downloaded_at": "2019-09-13 20:09:44.246536+00:00", "title": "Editorials from around New England", "language": "en", "text": "Editorials from around New England:\n\nCONNECTICUT\n\nUrgent steps needed, vaping is killing people\n\nThe Day\n\nSept. 12\n\nA suspicion that romaine or canteloupe or ground beef poses a threat to public health puts all hands on deck at restaurants and supermarkets to remove the suspect food. Get it off the market first and then ask questions.\n\nThe same strategy ought to be applied immediately to vaping devices, which have been linked to nearly 500 cases of lung illness in 33 states, including apparently six deaths. Many victims are young, many have vaped concoctions that include THC or other substances found in marijuana. No single manufacturer is linked to all incidents and no one cause has yet been identified.\n\nThere is a way to stop the poisoning at once. The Day joins the federal Centers for Disease Control and Prevention in urging people of all ages to suspend their use of vaping devices at least until it is determined what is causing this outbreak. And we welcome the statements - at last - of the president and the secretary of Health and Human Services on Wednesday that the Food and Drug Administration would “in the coming weeks” have a plan to remove flavored e-cigarettes and nicotine pods from the market. Even faster would be for the manufacturers to pull their products off market, as farmers and meat packers have had to do more than once.\n\nThe seriousness of the growing threat finally got a reaction after months of inaction by the Food and Drug Administration, perhaps because President and Mrs. Trump, as parents of a teenager, are concerned. Both were present at a White House announcement of the FDA plan to ban flavored vaping devices, which particularly appeal to adolescents. Also there were HHS Secretary Alex M. Azar II and Dr. Ned Sharpless, the acting Food and Drug Administration commissioner. The ban would include mint and menthol, despite manufacturers’ contention that those are not “flavors.”\n\nThat is an overdue first step. If, as the makers have argued, the primary purpose of e-cigarettes is to help nicotine-addicted adults quit smoking tobacco, then why mango? It’s because fruity and sweet flavors appeal to teens and 20-somethings, who often begin their nicotine exposure with the very devices claimed to help adults stop. Growth in the number of young people vaping has been explosive. The New York Times reported the HHS secretary as saying that 5 million minors, mostly of high school age, said they had recently used e-cigarettes. About one-quarter of high school students reported vaping within the last 30 days in this year’s annual survey, up from 20 percent last year and 11 percent the year before.\n\nThe FDA’s handling of the whole question of whether vaping is safe for any age has been lackluster from the start. The agency has faced much criticism for lightly regulating the sale of nicotine devices even to adults, given the chemical’s addictive qualities and its potential to harm even when not paired with tobacco.\n\nOn Monday the agency did send a stern warning to Juul Labs, the highest-profile commercial maker of e-cigarettes, ordering the company to stop claiming that its products are less harmful than regular cigarettes. The company had been promoting them as “safe” at schools and summer camps.\n\nSchools and summer camps? Come on. Who is minding the store? The FDA rebuke of Juul is too little, too late.\n\nWhile e-cigarettes do seem effective in getting some people off cigarettes, their makers clearly intend them not as a maintenance medication but as a recreational device that creates a need and then fills it. Let’s call it what it is: a profitmaking product they are loathe to lose.\n\nSome states have gone ahead of the FDA, with Michigan becoming the first to ban flavored vaping devices, and New York, Massachusetts and California considering it. And this week former New York City-Mayor Michael Bloomberg said Bloomberg Philanthropies would pledge $160 million to end teen vaping. The Campaign for Tobacco-Free Kids will coordinate the effort to get rid of flavored nicotine products.\n\nThe FDA has sufficient grounds to ban the flavors right now and it should make haste. Its subsequent task should be to adequately examine the safety of any vaping at any age. The agency’s mandate is to protect the public from consumption and exposure to unsafe food and drugs. It needs to make up for time wasted.\n\nOnline: https://bit.ly/2lTOM4D\n\n___\n\nMAINE\n\nSome defenders of Indian mascot still hanging on\n\nKennebec Journal/Morning Sentinel/CentralMaine.com\n\nSept. 13\n\nItems that read “Skowhegan Indians” are still selling in town, the Morning Sentinel reported this week, as are shirts that say “Indian Outlaw” - an apparent reference to the state law passed earlier this year banning public schools from using depictions of Native Americans in mascots, logos or nicknames.\n\nIt is disappointing to see that some folks are not yet prepared to move on from the old mascot. But it is not unexpected - if everyone in the Skowhegan school district had taken to heart the testimony showing how such mascots are hurtful and reductive, then it would have been changed long ago.\n\nThat there are a few people still upset with the loss of the Indians mascot, however, should not take away from the progress made in the last few years. The people arguing against Native American mascots - led by representatives of Maine’s four tribes, in particularly Maulian Dana, ambassador of the Penobscot Nation - made their case again and again, telling hard truths, sincerely and precisely, to crowds that weren’t always ready to hear it.\n\nIn doing so, they changed minds. Eventually, enough people were willing to do the right thing.\n\nThe SAD 54 school board did the right thing in March, voting 14-9 to “respectfully retire” the mascot and accompanying imagery.\n\nIt wasn’t “outsiders” who made that decision, as mascot supporters say, but local elected officials. They voted not to wipe away the memories of Skowhegan alumni, or to give into political correctness, but to end a practice that is offensive and damaging to American Indians.\n\nIn April, the Maine Legislature did the right thing, too, by passing - easily - the law to prohibit the use of Native American imagery at public schools and colleges. Skowhegan was until the school board’s vote the last school to hold on to its Indian mascot, so the state law had little practical effect.\n\nStill, the law sends a clear message that the arguments made by the tribal representatives and their supporters are valid and genuine, and that the state of Maine and its institutions take them seriously.\n\nYou can’t make everyone listen. You can’t force people to change their minds or to take the arguments against Indian mascots at face value.\n\nAnd people in Skowhegan have every right to buy and wear “Indians” gear, just as a business has every right to sell it.\n\nNow, wearing such a t-shirt is a thumb in the eye of everyone who took this debate seriously. And one would think the owner of the store selling the gear, who is also a school board member, would think twice about picking this particular scab.\n\nBut no law can stop them; despite what the shirt says, they are not “outlaws,” just people who for whatever reason cannot appreciate those shirts are genuinely hurtful to a lot of people.\n\nWhat the law can do is say that our public institutions will not condone mascots that are dismissive of Native American cultures, their history, and their presence in our communities to this day.\n\nNow that the use of these damaging mascots in an official capacity is a thing of the past, the best we can hope for is that the stragglers will eventually open their minds. The best we can do is keep telling the hard truths.\n\nOnline: https://bit.ly/2lOwLVu\n\n___\n\nMASSACHUSETTS\n\nHOV lanes aren’t solving any problems\n\nThe Newburyport Daily News\n\nSept. 13\n\nMassachusetts Transportation Secretary Stephanie Pollack expressed surprise earlier this week that the high-occupancy vehicle lanes on the state highways outside Boston aren’t doing anything to reduce traffic congestion.\n\n“I was shocked to find out that there is a closed Twitter group for people who use your carpool lane where they tweet at each other and say, ‘There’s no cops, it’s OK for single cars to use it,’” Pollack said at a meeting of the Baker administration’s Local Government Advisory Commission. “And we think as much as 80 or 90 percent of the traffic is actually just individual people in cars and it’s not functioning as a carpool lane.”\n\nThat’s not news to the tens of thousands of North Shore and Merrimack Valley drivers idling in the clotted traffic on Interstate 93 outside Boston. Looking to their left, before Mass Highway suspended the HOV rules on I-93 last spring, commuters could see the solo drivers slipping into the lanes supposed to be reserved for autos with a driver and one or more passengers. The annoyance is lessened just a tad by seeing the offending cars slow to a crawl up ahead; the HOV lanes in these parts don’t actually get you into the city that much faster.\n\nAnd that’s the problem with HOV lanes: They don’t really work. When people break the rules, as is happening now, traffic slows to a crawl. When the HOV lanes are filled with cars with two or more passengers, traffic in the regular lanes is eased - but only for a short time because the easier the commute, the more likely people are to use their cars. “If some high-capacity vehicles are diverted out of general purpose lanes, that provides a more open lane, and that more open lane will be filled with additional traffic,” Dan Allison wrote for the civic affairs group Strong Towns in 2017. “The HOV lane itself, being more open than adjacent lanes, will create additional traffic. Drivers respond to their perception of crowding and delay. If they see more space, they will drive more. It’s induced demand, simple as that.\n\n“So an HOV lane increases overall traffic.”\n\nIf the Baker administration wants to make life easier for North of Boston travelers, instead of reworking the HOV lanes, it should intensify efforts to upgrade the commuter rail system, which in its current state is so scattershot and unreliable that it essentially forces people into their cars.\n\nOnline: https://bit.ly/2kyWr8x\n\n___\n\nNEW HAMPSHIRE\n\nNH continues to lead in fight to clean up PFAS\n\nFoster’s Daily Democrat\n\nSept. 9\n\nThe state of New Hampshire continues to be a leader in a nation slowly coming to grips with threats posed by PFAS contamination.\n\nThis past week, Gov. Chris Sununu signed two pieces of legislation into law Tuesday to ban the carcinogenic chemicals used in firefighting foams and flame suppression on household furniture during a ceremony at the town Fire Department Tuesday morning.\n\nBanning these dangerous chemicals, dubbed “forever chemicals” because they do not break down and dissipate naturally, must happen as government agencies clean up the toxic footprints they have left behind.\n\nPFAS are man-made chemicals used in products worldwide since the 1950s, including firefighting foam, non-stick cookware and water-repellent fabrics. They also have a range of applications in the aerospace, aviation, automotive and electronics industries, among others.\n\nNew Hampshire has also been at the forefront with the state, city of Portsmouth and Air Force working together to install carbon filtration systems to remove PFAS from groundwater at Pease International Tradeport. In relatively fast order, the Air Force oversaw the development and piloting of a filtration system that is showing the ability to remove PFAS from ground- and drinking water to non-detect levels.\n\nThis followed the contamination of the city of Portsmouth’s Haven well at the tradeport with PFAS believed to have come from firefighting foams. Thousands of people at the tradeport, including two daycares there, were exposed to the chemicals.\n\nThe state Department of Environmental Services and area lawmakers also have worked aggressively to make sure chemicals from the Coakley landfill in Greenland and North Hampton, which include PFAS and 1,4-dioxane are no longer allowed to seep untreated from the Superfund cleanup site.\n\nPFAS exposure can increase cancer risks, lower birth weights, harm liver, thyroid and pancreas functions and increase cholesterol levels, according to the Agency for Toxic Substances and Disease Registry.\n\nThe list of progress New Hampshire has made is extensive. The state earlier this summer lowered its drinking water standards for PFOA and PFOS to 12 and 15 parts per trillion, respectively, down from 70 ppt, the level the U.S. Environmental Protection Agency is clinging to despite mounting evidence of the harm caused by PFAS.\n\nNo level of a cancer-causing chemical in drinking water should be acceptable. Banning the substances and cleaning them up is an obligation of the government. The government, however, should not be solely responsible for the cleanup of these contaminants as it is the taxpayers, the people exposed to them, that fund the government.\n\nIn that area, New Hampshire is yet again at the forefront in the battle against PFAS contamination. New Hampshire earlier this year became the second state to sue the makers and distributors of PFAS chemicals. Among the companies being sued are 3M, DuPont Co., Chemours Company, Chemguard Inc., Tyco Fire Products, Buckeye Fire Equipment, Kidde-Fenwal Inc. and National Fire Foam Inc.\n\nThese companies made and distributed these chemicals, but did not inform users of them or the general public of their risk and long-lasting impact on people and the environment.\n\nBusinesses cannot operate in a way that harms the environment without making amends. Those that put the “forever chemicals” into our environment and harmed people must be held accountable.\n\nIt remains a long road until the environment is free of PFAS contamination, but, thankfully, the leaders of New Hampshire have been willing to fight for what is right.\n\nOnline: https://bit.ly/2lNAjYc\n\n___\n\nRHODE ISLAND\n\nAn underpass at Kennedy Plaza\n\nThe Providence Journal Sept. 11\n\nPlans for Kennedy Plaza seem to come and go with greater rapidity than national security advisers to President Trump.\n\nThe latest is a proposal by the Rhode Island Department of Transportation - unveiled last week before the Providence Foundation’s board of directors - that would create an underpass beneath Washington Street and connect Burnside Park with Kennedy Plaza to form one large public space.\n\nThe administration of Gov. Gina Raimondo has been working on the plan for months with the Rhode Island Public Transit Authority and the City of Providence.\n\nWe like the idea of removing the chaos from Kennedy Plaza.\n\nBut the notion of a tunnel under the plaza surely fills many taxpayers with trepidation.\n\nThe DOT says this can all be achieved through a $35-million bond approved by voters in 2014 to create a new transit hub in Providence.\n\nNagging questions come to mind:\n\nIs this even legal under the language of the bond authorization? No one envisioned this project in 2014, and voters were not asked about this scheme.\n\nTunnel projects notoriously run into problems and go over budget. Will $35 million get the job done? Remember, this is the DOT that brought in a pedestrian bridge, initially estimated to cost $2 million, for $22 million. (Meanwhile, state officials developed the vapors over investing $23 million toward a stadium that would have saved Triple-A baseball in Rhode Island, instead of letting Worcester grab this prized amenity and economic engine.)\n\nIs the spongy land under the downtown suitable for such an underpass?\n\nIt takes buses a significant length of roadway to get underground and return to the surface. How will that work in the confines of Kennedy Plaza?\n\nDoes an underpass increase the potential for unwanted activity, such as crime?\n\nAre there other, less expensive ways to get the buses out of Kennedy Plaza?\n\nIs this really the best way to stretch public dollars to provide public transportation, or is this another make-work project for the Laborers’ Union, which has significant clout in the Raimondo administration?\n\nOne of the cheerleaders for the plan is former Mayor Joseph Paolino, a real-estate developer whose company owns the 100 Westminster St. tower right on the plaza. He has long complained about the seedy activity around the buses, arguing they mar the center of the city and drive away investment.\n\nMr. Paolino argued that “maybe” by getting the new Kennedy Plaza project done “we could get somebody to buy the Superman building and save the building.” The big problem seems to be, though, that the owner has been unwilling to sell or renovate the building without a large infusion of state money.\n\nThe grassroots group Rhode Island Transit Riders has raised concerns, arguing that they see the project as a way to appease business interests and real-estate developers rather than serve commuters.\n\nThe project seems to be on a fast track. DOT Director Peter Alviti said a request for proposals will probably go out this fall, with a finished project possible next year. Since the voters already approved the bond, their representatives in the legislature will evidently have no say.\n\nOfficials say they will reach out to the public for its views about the plan. It seems like a good idea to hear from those who are not part of the inner circle on this project.\n\nOnline: https://bit.ly/2lQF2YS\n\n___\n\nVERMONT\n\nKnock, knock. Don’t answer\n\nThe Rutland Herald\n\nSept. 12\n\nAs if we did not have enough things to worry about. How about high-tech neighborhood watches that actually infringe on our civil liberties?\n\nRing, a video doorbell sold by Amazon, is the latest infiltration into Americans’ everyday lives. While it offers customers convenience and a sense of security, it’s also attracting scrutiny.\n\nAnd rightly so.\n\nAmazon is proving it is becoming Big Brother, or in more modern nomenclature, a Black Mirror.\n\nThe company already dominates how we shop; its Web Services arm is the backbone of numerous internet companies; and its Prime Video and Music services are angling to become primary ways that we watch and listen to media.\n\nNow Ring cameras are stoking fears that Amazon is further encroaching on people’s privacy as Ring turns neighborhoods into surveillance operations for police, and profits from the false perception that crime is on the rise. The company’s social media app, where users can share the surveillance their devices record, has been shown to exacerbate racial stereotypes and profiling.\n\nThe agreements with more than 400 law enforcement agencies across the country, including one in Chittenden County, raised eyebrows among more traditional home-security organizations and privacy organizations who say a web of self-surveillance poses some untested privacy concerns.\n\nPartnerships give police a direct portal through which they can request video from Ring users in the event of an active nearby crime investigation. Ring users are not required to give video to police and their identities are kept secret, but Amazon has been coaching police on how to more successfully get video from Ring users without a warrant, according to Vice. Ring users who are victims of a crime, of course, may choose to share video with police of their own accord.\n\nThese partnerships also give police departments discounts on Ring products, which they can extend to their communities. While on the surface, that could seem like a plus for citizens, it raises issues of competitive fairness and what role private companies should play in the public justice system.\n\nThe Washington Post reported last month that Massachusetts Democratic Sen. Edward Markey has requested details on the company’s agreements with police departments, citing “serious privacy and civil liberty concerns” that he said could violate peoples’ rights.\n\n“The integration of Ring’s network of cameras with law enforcement offices could easily create a surveillance network that places dangerous burdens on people of color and feeds racial anxieties in local communities,” the senator wrote in his letter. He also raised alarms about Amazon’s development of facial recognition technology.\n\nIvan Spector, president of the Virginia-based home surveillance trade organization The Monitoring Association, originally put out a statement stating that the app lacks transparency and later put out a new statement.\n\n“Over the course of the past week, TMA has followed up on some of the recent reporting regarding Ring and its law enforcement partnerships. Based on our findings, we believe that the reports contain numerous inaccuracies and we regret that our earlier statement was premature and wish to retract it,” he said. “It has become apparent that Ring has not only been partnering with police departments in a transparent manner but has also been providing hardware specifically to low-income neighborhoods in an effort to reduce crime in neighborhoods.”\n\nAcquired by Amazon for $839 million last year, Ring sells Wi-Fi products that integrate with its social media app called Neighbors, where users can post videos of suspicious activity and crimes outside their front doors, as well as view posts from other people within a 5-mile radius.\n\nRing’s low-cost security devices are part of the fastest-growing segment of smart devices, with shipments expected to grow about 21% every year through 2023, according to the market research firm IDC. Ring says it has “millions of users” worldwide, but wouldn’t provide a specific number.\n\nFor full access to Ring’s capabilities, on top of device costs users pay a subscription fee that ranges from $30 (video saving and sharing) to $100 (professional monitoring) annually.\n\nMany Americans would argue that price is worth it for the peace of mind, and say the technology is “cool” and “useful.” Already, our phones and other devices we have inside our homes (Alexa, for example) are always listening and helping us to make choices or decisions, even before we ask a question.\n\nThis technology is creepy, especially Ring. It has the potential to be used as a weapon - not a tool.\n\nConvenience, it would appear, has a cost. And it’s our privacy.\n\nOnline: https://bit.ly/2kbVkLw\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC.", "description": "Editorials from around New England:", "authors": ["The Washington Times Http", "The Associated Press"], "top_image": "", "published_at": "2019-09-13"}