{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/movies/2019/10/06/joaquin-phoenix-joker-leans-into-batman-connections-spoilers/3857451002", "downloaded_at": "2019-10-07 00:18:37.780664+00:00", "title": "Spoilers! Joaquin Phoenix's 'Joker' has definite Batman leanings, and that's a bad thing", "language": "en", "text": "CLOSE Joaquin Phoenix plays Arthur Fleck, a clown-for-hire and stand-up comic in 'Joker.' WARNER BROS. PICTURES\n\nSpoiler alert! Key plot points and the ending of the new movie \"Joker\" are revealed here, so beware if you haven't seen it yet.\n\nTodd Phillips’ dark character study “Joker” promised to be something truly different for a comic book movie, focusing on the sort of villainous origin story that audiences had never seen before. Until it turns into a quasi-Batman tale and the Joaquin Phoenix showcase heads down a bleak alley we’ve visited so many times before.\n\n“Joker” turns the clock back on Batman’s archnemesis to track the path that would lead a troubled man – in this case, cackling Gotham City outcast Arthur Fleck – to becoming a face-painted psycho. And it does all that and more, showing Arthur/Joker as the symbol of fed-up Gothamites ready to revolt.\n\nSpoilers! The 5 most shocking 'Joker' moments that everyone will be talking about\n\nRanked: Every big-screen Joker (including Joaquin Phoenix)\n\nArthur Fleck (Joaquin Phoenix) goes down a bad path that involves garish face paint and green hair in \"Joker.\" (Photo: NIKO TAVERNISE)\n\nThe Joker is needed, but not really that old Dark Knight. It’s not called “Batman: Joker.” Or “Batman: The Wonder Years.” You have Joaquin, you have Joker. That’s all you need guys. So why is Bruce Wayne standing there again, over the bodies of his dead parents, at the end of yet another movie, the first stop on the road to becoming a superhero?\n\nLike other Bat-adjacent projects over the years, it’s almost like they can’t help themselves, as if imagining a Gotham City without the fan-favorite Caped Crusader playing some role would be the highest form of sacrilege.\n\nFox’s recent “Gotham” TV series also was meant to show the city in its pre-Batman years, focusing on cop Jim Gordon (Ben McKenzie) and his efforts dealing with a corrupt town full of familiar colorful criminals. However, the series ended up being just as much about young Bruce Wayne (David Mazouz). The final shot of the entire five-season series? Mazouz in a Batsuit.\n\n'It's shaky ground as an actor': Joaquin Phoenix charts an unpredictable path as 'Joker'\n\nReview: Joaquin Phoenix's 'Joker' questions if there's empathy for the devil\n\nHallelujah for small favors, because “Joker” doesn’t have a brooding vigilante running around in a cape and cowl or hanging off gargoyles on tall buildings. The guy in the garish face paint and green hair definitely gets the spotlight. Make no mistake, though: Batman’s there even when he’s not exactly Batman.\n\nEarly on, the very wealthy Thomas Wayne (Brett Cullen) is introduced as a mayoral candidate who wants to clean up Gotham. He and Arthur wouldn’t otherwise have anything to do with one another until Arthur finds out his mom Penny (Frances Conroy) has been writing mysterious letters to Thomas about taking care of her and “his son.” Arthur investigates and finds his birth certificate, which lists Thomas Wayne as his father.\n\nArthur Fleck (Joaquin Phoenix) cares for his mom Penny (Frances Conroy) in \"Joker.\" (Photo: NIKO TAVERNISE)\n\nHis psychological mindset wasn’t great in the first place, with Arthur murdering three Wall Street types who beat him up on the subway and his idol Murray Franklin (Robert De Niro) making fun of Arthur on his late-night show. But he starts to go really off the rails, going to Wayne Manor and interacting with young boy Bruce Wayne (Dante Pereira-Olson) – and getting rebuffed by protective butler Alfred (Douglas Hodge) – before ultimately confronting Thomas himself. The elder Wayne punches Arthur in the nose after telling him about Penny's own delusions and that Arthur was actually adopted.\n\nOn a quest for the truth, Arthur goes to Arkham State Hospital and finds evidence of being abused as a child, with Penny being committed for child endangerment and diagnosed with narcissistic personality disorder. Arthur finds adoption records, too, and though his real parentage is still left a bit of a mystery, he's driven to kill his mom as his mental state unwinds.\n\nWhile the mere idea of the Joker being a Bat-bro is intriguing in a sense, it just creates connections that don’t really need to be there. However, it’s not the most egregiously unnecessary Easter egg in “Joker.” That comes in the film’s fiery finale.\n\nArthur goes full Joker, getting invited on Murray’s late-night show as a guest while throngs of people in clown masks descend on city hall. Instead of killing himself as he planned, Joker admits to the subway murders that created the \"Kill the Rich\" movement and shoots his comedy idol in the head on live television. That leads to riots in the streets, a night full of Gotham burning and Arthur escaping police custody and posing victoriously on the hood of a squad car with his acolytes cheering.\n\nWhile all this is going down, though, the Waynes leave a night at the movies and take a shortcut down a dark alley to escape the rancor. They’re accosted by one of Joker's followers, a man with a clown mask who shoots the parents and leaves the boy alive – the beginnings of Batman’s origin that first appeared on a comic page 80 years.\n\nLet’s give the movie one bit of credit: Having a theater with “Zorro: The Gay Blade” on the marquee – a twist on “The Mark of Zorro” from the comics – is clever with this Gotham being based on New York circa 1981. But it’s the same tragic incident we see included in Tim Burton’s 1989 “Batman,” Christopher Nolan’s 2005 “Batman Begins,” Zack Snyder’s 2016 “Batman v Superman: Dawn of Justice,” the first episode of “Gotham” and umpteen times in various comics, cartoons and video games to boot. It’s pretty safe to say at this point if a Wayne shows up in a Batman project, the Grim Reaper’s not far behind.\n\nBruce Wayne (Gus Lewis, left) mourns his parents (Linus Roache and Sara Stewart) in \"Batman Begins.\" Their deaths also factor into the new \"Joker.\" (Photo: DAVID JAMES/WARNER BROS.)\n\nAgain, worth a reminder: This isn’t a Batman movie. It’s “Joker.\" Aren't we supposed to follow the origins of the Dark Knight’s greatest foe, not Bats himself? The scene ties into Gotham’s anti-rich sentiment stoked by Joker’s actions, but it’s not like the villain pulled the trigger himself. (That was Jack Nicholson in “Batman.”) Instead, it’ll just get fans aflutter online that this – of course! – foreshadows a meeting between Phoenix and a certain debuting superhero star who became famous for playing a sparkly vampire.\n\nA cynic might believe that’s what Warner Bros. wants – the Caped Crusader is their sacred cash Bat-cow, after all. However, it’s difficult to put on a happy face for one more disturbing, pointless murder in a movie that’s brutal enough already. And disappointingly, it’s a broken promise that treads familiar bloody asphalt instead of being actually groundbreaking.\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/movies/2019/10/06/joaquin-phoenix-joker-leans-into-batman-connections-spoilers/3857451002/", "description": "Joaquin Phoenix's 'Joker' promised a different spin on Batman's foe. Instead, it leans into all-too-familiar Dark Knight connections. Spoilers ahead!", "authors": ["Brian Truitt", "Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/09/27/PNDN/2fc3101a-3818-4362-9e23-fff6a5597543-BUR1Ttab_08-30-2019_Daily_1_A012__2019_08_29_IMG_Film_-_Fall_Preview__2_1_5FP6QIDD_L1410755268_IMG_Film_-_Fall_Preview__2_1_5FP6QIDD.jpg?crop=4019,2261,x0,y204&width=3200&height=1680&fit=bounds", "published_at": "2019-10-06"}