{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7578689/Forget-lawnmowers-Herd-hungry-GOATS-used-clear-weeds-Belgrave-Station-Melbourne.html", "downloaded_at": "2019-10-16 14:11:47.761035+00:00", "title": "Forget lawnmowers: Herd of hungry GOATS to be used to clear weeds at Belgrave Station in Melbourne", "language": "en", "text": "A herd of hungry goats will be used to clear out-of-control weeds, berries and grass at a Melbourne train station.\n\nMetro Trains hired six goats from grazing company GrazeAway on Wednesday to eat away overgrown greenery near Belgrave Station.\n\nThe living lawnmowers will clear foliage too difficult to uproot by humans without using chemical herbicides, which kill native trees.\n\nGrazeAway goats have been hired to clear excess foliage near Belgrave Station (pictured: goats clearing a site in Wesburn, Victoria)\n\nUp to 30 goats will eventually be deployed at the half-hectare site within the next few months.\n\nMetro's chief operating officer Catherine Baxter told the Herald Sun they had a responsibility to look after the train network in an environmentally friendly way.\n\n'By bringing in goats for weed control, we can allow our native bush to flourish while reducing the need for herbicides, and improve the amenity of the area,' she said.\n\nThe goats will be fenced-off and will be provided with water, shelter and vet care.\n\nGoats have also been hired by EastLink and Melbourne Water to solve problems with unwanted foliage.\n\nGrazeAway owner Colin Arnold, who has been running the business for 16 years, said he has seen a significant increase in the demand to hire goats as lawnmowers.", "description": "Metro Trains hired six goats from grazing company GrazeAway on Wednesday to eat away overgrown greenery near Belgrave Station in Melbourne.", "authors": ["Paula Ahillon For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/16/09/19777408-0-image-a-15_1571213549835.jpg", "published_at": "2019-10-16"}