{"pub": "cbc", "url": "https://cbc.ca/sports/golf/golf-rebecca-lee-bentham-mackenzie-tour-1.5270895", "downloaded_at": "2019-09-04 23:48:15.867678+00:00", "published_at": "2019-09-04", "title": "Sports-no-CBC", "language": "en", "text": "Coming off a three-year break from elite competition, Rebecca Lee-Bentham is finding ways to keep golf interesting.\n\nShe'll be the only woman in the field when the Mackenzie Investments Open tees off at Montreal's Elm Ridge Country Club's North Course on Thursday. It's not the first time that Lee-Bentham has played against an elite male field, so the Golf Journalists Association of Canada's 2013 female professional of the year knows what challenges the rain-soaked course will present.\n\n\"I'm getting no rolls so it's all in my carry and I don't carry the ball very far,\" said Lee-Bentham. \"It's hard because we're playing the same tees. We're playing at 7,000 yards and I usually play at, I think 6,600 is the average in the LPGA. So when you add all that it is difficult because I'm hitting a lot longer clubs to the holes.\"\n\nLee-Bentham has excelled against men before. She was on the men's golf team at Toronto's Northview Heights Secondary School with Albin Choi, Richard Jung and Daniel Kim, all of them now on pro tours. Lee-Bentham proudly notes that she won the regional high school championship while at Northview Heights.\n\nPlayed against men in May\n\nThe 27-year-old from Markham, Ont., also finished 10th at the Bermuda Grey Goose World Par 3 Championships in May, holding a first-round lead against a predominantly male field that included PGA Tour-winner Chip Beck, among others.\n\n\"Whenever I go out for a fun game it's 95 per cent men,\" said Lee-Bentham. \"I'm always surrounded by them anyway. Yes it's different because the Mackenzie Investment Open is a different environment where they're all tour pros but I'm trying to focus more on playing the golf course rather than focus on how long they're hitting it past me.\"\n\nChoi has total confidence in Lee-Bentham, who he believes has the skills to surprise people.\n\n\"I think she's going to do a lot better than what people think,\" said Choi. \"The toughest part about playing in a men's event is obviously just the yardage, the golf course is longer.\n\n\"But she's going to just be hitting some longer clubs into the greens. She's going to do a lot better than people expect.\"\n\nThis year has been a welcome return to competition for Lee-Bentham, who retired as a player in 2016. She had been working as a golf coach and spending more time with her family and, in her own words, growing as a person. This season has she has decided to play occasionally in elite competitions.\n\n\"My perspective on golf changed. Just seeing golf as a small part of life, it's not everything,\" said Lee-Bentham. \"Before it was all of nothing. I put a lot of pressure on myself. I really cared about my performance and results. I put that in front of happiness.\"\n\nThe Mackenzie Investments Open is the penultimate stop on the third-tier Canadian golf tour. The Mackenzie Tour's season wraps up next week at the Canada Life Championship at Highland Country Club in London, Ont.", "description": "Rebecca Lee-Bentham will be the only woman in the field when the Mackenzie Investments Open tees off at Montreal's Elm Ridge Country Club's North Course on Thursday.", "authors": [], "top_image": "https://i.cbc.ca/1.5270903.1567638719!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/glf-19th-hole-lee-bentham-20190904.jpg"}