{"pub": "businessinsider", "url": "https://businessinsider.co.za/titanic-secrets-facts-2018-4-2", "downloaded_at": "2019-09-15 07:46:34.691524+00:00", "title": "42 secrets you never knew about the Titanic and the people aboard it", "language": "en", "text": "The Titanic sank on April 15, 1912 - 107 years ago.\n\nThe wreck was discovered 34 years ago on September 1, 1985.\n\nWhile there have been many movies, books, and research about the ship, you might be surprised to hear these secrets of the Titanic and those onboard.\n\nFrom a cellist who wasn't declared officially dead until 2000 to the divorces that the sinking ended up causing, the Titanic affected the world in a multitude of unexpected ways.\n\nVisit Business Insider SA's homepage for more stories.\n\nOne hundred and six years ago, one of the most famous - and deadliest - disasters took place.\n\nOn April 15, 1912, at 2:20 a.m., what was deemed one of the most luxurious and safe ships ever built, hit an iceberg and sank off the coast of Newfoundland, taking more than 1,500 lives. The ship, the world's largest passenger ship at the time, was on its maiden voyage, headed from Southampton, England, to New York City.\n\nIt would take 73 years for the ship's wreckage to be found. Dr. Robert Ballard and scientist Jean-Louis Miche located the remains of the Titanic on September 1, 1985.\n\nWhile the tragedy has inspired myriad movies, books, and articles, the ship and its passengers still hold secrets and little-known facts that might surprise you.\n\nKeep reading to remember the Titanic and those onboard, and learn more about those affected by the tragedy.\n\nActress Dorothy Gibson, who was aboard the Titanic and survived, starred in a film called \"Saved From the Titanic,\" which was released just one month after the ship sank.\n\nAmerican silent film actress Dorothy Gibson was one of the approximately 700 survivors of the collision.\n\nUpon arriving in New York City unscathed, she immediately began filming \"Saved From the Titanic,\" the first film to depict the events of the sinking. It was released in May 1912, a month after the crash. She is famous for wearing the same clothes and shoes in the movie as she had worn during the actual sinking.\n\nWhile the film was successful, it only exists in memories now. The only known print of the film was destroyed in a fire.\n\nAnother survivor, Lawrence Beesley, tried to crash the filming of the 1958 film \"A Night to Remember\" because he wanted to symbolically go down with the ship.\n\nAccording to IMDB, Beesley was on the set of \"A Night to Remember,\" which is considered the most accurate of all Titanic films. He allegedly tried to jump into the scene depicting the ship's sinking, in order to symbolically go down with the ship. Legend has it that director Roy Ward Baker refused, as it would have been a union violation and could have halted filming.\n\nBeesley was a survivor from the second class, and wrote a memoir about his experience entitled \"The Loss of the SS Titanic.\"\n\nThe 700 third-class passengers had to share two bathtubs.\n\nEven though, by all accounts, the third-class accommodations on the Titanic were much better than those on an average ship, they were still pretty rough. The total amount of third-class passengers ranged from 700 to 1,000, and they all had to share two bathtubs.\n\nOne of the ship's musicians wasn't officially declared dead until 2000.\n\nRoger Bricoux was the Titanic's cello player and just 21 years old when he perished during the ship's sinking.\n\nBut Bricoux wasn't officially declared dead until 2000, though all of the musicians died on April 15, 1912. The French army even called him a deserter when he failed to show up to serve in World War I. The Association Française du Titanic (French Association of the Titanic) worked to clear his name and officially put Bricoux to rest, but didn't succeed until 88 years after the Titanic sank.\n\nThe ship's band played music right until the very end to try and calm passengers.\n\nThey have been called heroes, and apparently played music for more than two hours after hitting the iceberg.\n\nThe ship's lookouts had to rely on their eyesight alone — the ship's binoculars were locked inside a cabinet that no one could find the key to.\n\nThe ship's lookouts, Frederick Fleet and Reginald Lee, didn't have access to binoculars during the journey, and therefore couldn't see very far.\n\nThe ship's second officer was replaced at the last minute, and forgot to hand off the key to the locker that housed the ship's binoculars.\n\nThe key resurfaced at auction in 2010, where it was sold for over $130,000.\n\nIt is likely that the crew didn't spot the iceberg in time because they didn't have binoculars.\n\nAccording to the official 1912 inquiry findings, only 37 seconds elapsed between actually seeing the iceberg, calling downstairs, and deciding what course of action to take.\n\nAt the memorial of Frederick Fleet — one of the lookouts — a prankster left a pair of binoculars with a note reading \"Sorry for bringing these 100 years too late.\"\n\nFleet was the lookout who called out the now-famous words, \"Iceberg, right ahead.\" He survived the sinking, but tragically went on to commit suicide in 1965, after the death of his wife.\n\nOn the centennial anniversary of the Titanic's sinking, a prankster removed a memorial wreath from his gravestone, and replaced it with a pair of binoculars and a note apologising for the lateness of the binoculars.\n\nThe Titanic was plagued by tragedy from the start. Eight people alone died during the ship's construction.\n\nEight men died during the construction of the ship, but only five of the names are known: Samuel Scott, John Kelly, William Clarke, James Dobbin, and Robert Murphy. A plaque memorialising the eight men in Belfast was unveiled in 2012.\n\nThe richest man aboard was John Jacob Astor IV, who was widely believed to have been the richest man in the world at the time of his death.\n\nAstor was not just the richest man on the Titanic, but widely believed to be the richest man in the world at the time of his death. He was worth an estimated $150 million, or $3.5 billion in today's dollars.\n\nAstor was on the ship returning home from a months-long honeymoon with his new wife, Madeleine Talmage Force, who, at 18 years of age, was 28 years younger than him. The extended honeymoon was actually a way to escape society's gossip - Astor had just been divorced within two years of his new marriage, which was relatively unheard of back then.\n\nAstor's body was one of the few that was recovered in the Atlantic Ocean after the ship went down. Among other possessions, he was found with $2,440 in his pocket (roughly $60,000 today).\n\nMultiple newspapers mistakenly reported that the crash caused no fatalities, including the Daily Mail, the Belfast Telegraph, and The World.\n\nIn the race to publish a headline about the disaster, numerous newspapers gave families and loved ones false hope about the sinking of the Titanic. The World reported no fatalities, the Daily Mail declared \"no lives lost,\" and the Belfast Telegraph claimed \"no danger of loss of life.\"\n\nAmerican newspapers were able to take advantage of the time difference, and their headlines were more accurate. The New York Times, for example, ran the headline \"Titanic Sinks Four Hours After Hitting Iceberg; 866 Rescued by Carpathia, Probably 1,250 Perish; Ismay Safe, Mrs. Astor Maybe, Noted Names Missing.\"\n\nA woman who survived the Titanic's sinking later survived the sinking of another ship: the Britannic.\n\nDepending on how you look at it, stewardess and nurse Violet Jessop is the luckiest - or unluckiest - woman alive. She survived the sinking of both the Titanic and the Britannic.\n\nJessop was just 25 when she survived the sinking of the Titanic. She was instructed to get into a lifeboat while the ship was going down to show women that the boats were safe.\n\nUndeterred by this maritime tragedy, Jessop began working on the Britannica (dubbed the Titanic 2 by the media), until it came across a mine that had been planted by a German U-boat in 1916. That ship also sank, and Jessop escaped again, but this time with a serious head injury that would affect her her whole life.\n\nIt is rumoured that a few men dressed up as women to get a spot on a lifeboat.\n\nFor one couple, these rumours even caused divorce.\n\nDickinson and Helen Bishop were granted a divorce in 1916, four years after the Titanic went down. Helen claimed that her husband was cruel and a drunk, but their relationship was also plagued by rumours that Dickinson had dressed up as a woman in order to escape the ship. In his official testimony during the US Senate Inquiry regarding the Titanic, he claimed that there had been no official order allowing only women and children to get on lifeboats.\n\nBishop's not the only man to have been accused of disguising himself as a woman - J. Bruce Ismay, William Carter, and William T. Sloper were all dogged by the same rumours throughout their lives.\n\nEvery single engineer aboard the Titanic perished — they all stayed behind to keep the ship's power running until the very end.\n\nThe Titanic's lights only went out when she finally went under, due to the tireless efforts of the ship's engineers, who stayed behind to keep the electricity and pumps running while the ship sank. They also kept the radio running, which put out distress signals until minutes before the ship sank. Not one of the 25 engineers survived.\n\nThe Navratil brothers were known as the \"Titanic orphans.\" They were the only two children from the ship to be rescued without a parent or guardian.\n\nThe Navratil brothers Edmond and Michel were just two and four years old, respectively, when the Titanic sank. They were with their father, Michel Sr., who had kidnapped them. Separated from their mother, he decided to take them to America in the hopes that his estranged wife would follow, and that they could start a new life in the New World.\n\nTheir father put them on a lifeboat, and was never seen again.\n\nThe two spoke no English, so they were taken in by a French-speaking survivor, Margaret Hays, until the authorities could locate their mother. Said mother found them a month after the disaster, thanks to their faces being plastered all over newspapers the world over.\n\nOne of the most beloved quotes from the 1997 film is based on a true story.\n\nIn the movie, Benjamin Guggenheim refuses a life vest and states \"We are dressed in our best and are prepared to go down as gentlemen.\"\n\nWhile it seems almost too cinematic to be true, the real Benjamin Guggenheim was actually prepared to go down like a gentleman, according to multiple reports. A New York Times article published in April 1912 reported that he had asked a steward to tell his wife in New York City \"I've done my best in doing my duty.\"\n\nWatch the scene based on Guggenheim's final moments here.\n\nThere were at least 13 couples who chose to celebrate their honeymoon on the Titanic.\n\nAccording to \"Titanic Love Stories,\" there were at least 13 couples celebrating their honeymoons on the ship.\n\nA novella called \"Futility\" that was published 14 years before the Titanic set sail seemed to have predicted the disaster.\n\n\"Futility,\" a novella written by American author Morgan Robertson, was published in 1898, 14 years before the Titanic set sail. It centered around the sinking of a fictional ship called the Titan.\n\nAccording to TIME, there's an eerie number of similarities between the ship's sinking in \"Futility\" and the Titanic IRL.\n\nFirst, the ship names are just two letters off (Titan vs Titanic). They were also said to be almost the same size, and both sank in April, due to an iceberg. Both ships had been described as unsinkable, and, sadly, both had just over the legally required amount of lifeboats, which were nowhere near enough.\n\nThe author was accused of being a psychic, but he explained that the uncanny similarities were simply a product of his extensive knowledge, saying \"I know what I'm writing about, that's all.\"\n\nThe SS Californian is infamous for having been near the Titanic when it sank, but not coming to its aid until it was too late. Three years after the Titanic, the Californian sank too.\n\nMultiple bad judgment calls led to the Californian not helping the Titanic: the ship's radio was allegedly shut off for the night when the Titanic hit the iceberg, and when the captain was awakened by the flares the Titanic had been setting off, he assumed that they were just fireworks. By the time the SOS messages finally came through, it was too late.\n\nHowever, the Californian wasn't long for this world either - it sank on November 1915, torpedoed by a German submarine during WW1.\n\nOnly one woman actually went down with the ship and survived, Rhoda Mary Abott.\n\nAbott was on the deck until the very end with her two sons, and all three went into the water with the ship. Tragically, her two sons were washed away by the ocean, but Abott was eventually pulled into a lifeboat that was rescued by the Carpathia.\n\nThe movie ended up costing more to produce than it cost to build the Titanic, which was the largest and most luxurious ship at the time, even when adjusted for inflation.\n\nThe Titanic was estimated to have cost around $7.5 million in 1912, which, according to the US Department of Labor's inflation calculator, would be around $190 million.\n\nThe 1997 blockbuster's budget was $200 million, which, in 2018, would amount to $360 million today.\n\nAnd though it was the biggest ship in the world, it still took 73 years to find its wreckage.\n\nThe Titanic's bow was discovered in 1985, allegedly during a secret Cold War Navy mission.\n\nWhen the wreck was found, it finally confirmed reports that the ship had, in fact, broken in two. This was a long disputed issue.\n\nThere were at least 15 witnesses who swore on the record that they had seen the Titanic break into two pieces before completely sinking beneath the waves. But they were ignored - the official US inquiry stated that the ship sank intact.\n\nHow the Titanic sank was disputed for 73 years until it was finally found on the ocean floor, broken in two.\n\nThe whole wreck could be gone by 2030.\n\nScientists think the whole wreck could vanish by 2030, thanks to bacteria eating away at it.\n\nDuring one of the expeditions to view the wreckage, a bowler hat was discovered inside a passenger's closet, right where he left it.\n\nJames Cameron, director/writer/producer/editor of \"Titanic,\" wrote about his experiences touring the ship's wreckage for National Geographic. He shared that \"in Henry Harper's D Deck cabin, his bowler hat remains in the ruins of his closet, right where he left it.\"\n\nOne of the ship's cooks, Charles Joughin, was able to survive much longer in the cold water than others because of the copious amounts of whiskey he had drank.\n\nJoughin is briefly but memorably portrayed in \"Titanic\" as chugging a flask of alcohol before entering the water. This is based on reality - according to reports, Joughin grabbed two bottles of whiskey as the ship went down.\n\nJoughin reported that he survived in the frigid northern Atlantic for at least two hours - most people died from hypothermia within 15 minutes.\n\nJoughin had had a busy night. The last dinner served on the Titanic (to first-class passengers) was a whopping 10 courses.\n\nAccording to NPR, the menu included \"oysters, filet mignon, poached salmon, chicken Lyonnaise, foie gras, roasted pigeon, lamb with mint sauce, and Punch Romaine, a palate-cleansing ice flavored with oranges and drenched in Champagne.\"\n\nAnd that's just for first class - the ship's cooks had to prepare food for second- and third-class passengers, plus the crew, too.\n\nWhile many people believed the Titanic was unsinkable, not everyone did. A passenger, Charles Melville Hays, predicted an \"appalling disaster.\" He perished in the water.\n\nHays was president of the Grand Trunk and Grand Trunk Pacific Railway Companies, which would later become the Canadian National Railway, and was thus well-versed in the technological advancements happening in the field of transportation.\n\nAccording to a survivor, Colonel Archibald Gracie, Hays pondered if continuing to build bigger and faster ships was wise. According to Gracie, Hays said \"the White Star, the Cunard, and Hamburg-American Lines are devoting their attention and ingenuity in vying with one another to attain the supremacy in luxurious ships and in making speed records. The time will come soon when this will be checked by some appalling disaster.\"\n\nAnd an appalling disaster it was. Over 1,500 people died — though only four of those were women from the first class.\n\nJust four women from first class died during the disaster. While still tragic, compare that to the 89 third-class women who died - or the 387 men.\n\nOne of those four women was Ann Elizabeth Isham, who perished because she refused to leave her dog behind.\n\nIsham reportedly jumped out of a lifeboat once she realised that she couldn't take her Great Dane with her. It's been speculated that a woman found in the water with her arms wrapped around her large dog was Isham, though it's impossible to know for sure.\n\nOf the 1,500+ who perished, only 300 were recovered. One of the bodies recovered was called the \"Unknown Child,\" and wasn't identified until almost 100 years later.\n\nA child's body was recovered from the water five days after the Titanic went down. Rescuers were so moved by the little boy that they buried him in a grave memorialising the 1,000 or so children that passed away.\n\nThe body was misidentified three times before he was finally identified as Sidney Goodwin when his shoes were donated to a museum and DNA tested.\n\nGoodwin's tomb, marked with a headstone that says \"unknown child,\" has remained untouched. His family stated \"The tombstone of the unknown child represents all of the children who perished on the Titanic, and we left it that way.\"\n\nThe last remaining survivor passed away in 2009 — she was just two months old when the ship sank.\n\nMillvina Dean was just two months old when she was wrapped in a sack and lowered into a lifeboat. She was the last living survivor of the Titanic and passed away in 2009, at age 97.\n\nOne of the most famous survivors was the \"Unsinkable\" Molly Brown. She later ran for US Senate.\n\nAfter the sinking of the Titanic, Brown became a full-fledged activist. She was a vocal supporter of the suffrage movement, worked with the Red Cross during World War I, and even ran for Senate, though she didn't win.\n\nOf the approximately 700 survivors, only one was Japanese. When he returned home, he was ridiculed and ostracised for not going down with the ship.\n\nHosono was originally called the \"Lucky Japanese Boy,\" by American media, but he was soon labelled a coward for getting on a lifeboat, which many considered primarily for women and children. He was called dishonorable in his home country, and was accused of dressing up as a woman in order to gain access to a boat (there's no proof of this).\n\nAfter \"Titanic\" was released in 1997, Hosono's family published a letter he had written to his wife describing the sinking of the ship - explaining he had been ready to die until a crew-member called out for two more people, and he hopped in with another man.\n\nA lifeboat drill that was supposed to take place the day of the sinking was canceled by the ship's captain.\n\nAccording to a survivor's testimony, it was completely out of the ordinary for a Sunday to pass without a lifeboat drill. April 14, 1912, was the last Sunday the Titanic would ever see, and the day of the sinking (technically, the Titanic sank on April 15 at 2 a.m.).\n\nIt's unclear why the drill never happened, and if it would have helped with getting people onto to the boats, but it definitely wouldn't have hurt.\n\nWhile it's impossible to know for sure, a ship spotted an iceberg with a streak of red paint going along its side soon after the crash. This is believed to be the iceberg that sank the ship.\n\nThis photo was taken on April 15, 1912, the morning after the Titanic crashed, from a ship called the SS Prinz Adalbert. The photographer hadn't even heard about the Titanic sinking yet, he just noticed that it appeared to show signs of collision, including a streak of red paint.\n\nThe hangar used to build the Titanic is now a filming location — HBO's hit show \"Game of Thrones\" has shot there before.\n\nPart of Titanic Studios incorporates Paint Hall, where construction on the Titanic took place. It was first used in 2007 for the filming of \"City of Ember,\" and has been part of multiple TV show and movies since then, including \"Game of Thrones.\"\n\nThe ship's profile, which features four smokestacks, makes it one of the most recognisable ships in history. But the fourth smokestack served no purpose, other than aesthetics.\n\nThe Titanic had four smokestacks (or funnels), but only three actually carried smoke from the furnaces. The fourth was said to be for ventilation and aesthetic purposes only.\n\nA lucky few bought tickets, but never boarded the ship, such as Milton Hershey, J.P. Morgan, and Guglielmo Marconi.\n\nDays after the ship went down, newspapers began compiling lists of people who had bought tickets but never boarded the Titanic - they called them the \"Just Missed It Club.\"\n\nThose that narrowly escaped disaster included Milton Hershey, who decided to take an earlier ship home with his wife, J. Pierpont Morgan (founder of General Electric and US Steel), who ended up staying at a French spa, and Guglielmo Marconi, (an inventor) who also caught an earlier ship.\n\nThe ship was carrying 15,000 bottles of beer, 1,000 bottles of wine, 850 bottles of liquor, and 8,000 cigars.\n\nIn addition to all that alcohol and tobacco, there were 75,000 pounds (34,000 kg) of fresh meat, 7,500 pounds (3,400kg) of bacon, 36,000 oranges, 1,000 loaves of bread, and 40,000 fresh eggs on board.\n\nJames Cameron's \"Titanic\" isn't the only movie about the ship. A Nazi propaganda film was shot depicting the events from a German perspective.\n\nThe Nazi re-telling of the sinking of the Titanic attempted to blame the British for the sinking of the Titanic by pushing the ship to continue at full speed, despite the warnings of a (fictional) German First Officer who ostensibly was the only person aboard who cared about human life.\n\nThe behind-the-scenes scandal of this movie is almost unbelievable. Before being murdered in prison for speaking against the Nazi regime, the director demanded a full-size ocean liner that he could film on - and the Nazis provided the SS Cap Arcona (their version of a luxury ocean liner). Tragically, the Cap Arcona ended up being used as a floating concentration camp, and was sank, resulting in 2,750 casualties.\n\nReceive a daily email with all our latest news: click here.\n\nAlso from Business Insider South Africa:", "description": "The Titanic is one of the most famous disasters in history. But the ship still has secrets that you've probably never heard before.", "authors": [], "top_image": "http://cdn.24.co.za/files/Cms/General/d/9281/4731338c8d28428caa507ec9b8ae4c1e.jpg", "published_at": "2018-04-02"}