{"pub": "metro", "url": "https://metro.co.uk/2019/10/15/prince-harry-kate-middleton-whizz-pakistan-reception-colourful-tuk-tuk-10924013", "downloaded_at": "2019-10-15 16:26:43.333226+00:00", "title": "Prince Harry and Kate Middleton whizz to Pakistan reception in colourful tuk tuk", "language": "en", "text": "Kate Middleton and Prince William arrive at the National Monument (Picture: Getty/EPA/REX/PA)\n\nThe Duke and Duchess of Cambridge travelled in style on the second day of their royal tour of Pakistan.\n\nThe pair emerged from a colourful tuk tuk outside Islamabad’s National Monument, as they attended a reception celebrating the Commonwealth country’s relationship with the UK.\n\nKate Middleton donned a glittering emerald dress designed by Jenny Packham while Prince William wore a sherwani by Karachi-based designer Naushemian.\n\nThe duke will speak at the event hosted by British High Commissioner for Pakistan Thomas Drew, where the pair will meet influential people from business, creative industries and Government.\n\nThe couple’s five day tour has been called the ‘most complex’ to date as they visited Pakistan amid political volatility and increased security concerns.\n\nKate and William thank their driver as they attend a reception hosted by the British High Commissioner (Picture: Getty Images)\n\nThe duchess wore a sparkling emerald dress designed by Jenny Packham (Picture: Getty Images)\n\nPakistan is embroiled in a period of tension with its neighbour India over the disputed region of Kashmir.\n\nAdvertisement\n\nAdvertisement\n\nSkirmishes on the de-facto-border between ‘Indian-administered Kashmir’ and ‘Pakistan-administered Kashmir’ have been on the rise, leading to both troop and civilian casualties.\n\nWilliam and Kate are due to travel more than 1,000 km throughout Pakistan, visiting Islamabad, the city of Lahore, the mountainous northern countryside and the border regions to the west.\n\nPrecise details of their engagements will only be released day by day due to ‘security considerations’, the couple’s communication secretary said.\n\nThey visit Pakistan at a time of serious political tensions with neighbouring India (Picture: Getty Images)\n\nSecurity has been tightened and details of their schedule will only be released day by day (Picture: PA)\n\nAs they went to meet President Arif Alvi and Prime Minister Imran Khan earlier today, authorities deployed more than 1,000 police and paramilitary forces for their protection and set up checkpoints and roadblocks in parts of the capital.\n\nAlvi said he ‘commended’ the couple for raising ‘awareness about mental health, climate change and poverty alleviation’.\n\nThis morning Harry and Kate were seen squeezing into tiny chairs as they talked to pupils at a nursery in Islamabad.\n\nGot a story for Metro.co.uk? Get in touch with our news team by emailing us at webnews@metro.co.uk. For more stories like this, check our news page.", "description": "The Duke and Duchess of Cambridge attended a British High Commission hosted event in Islamabad, Pakistan as part of a five day royal tour.", "authors": ["James Hockaday"], "top_image": "https://i1.wp.com/metro.co.uk/wp-content/uploads/2019/10/PRC_90011814_1571156041.jpg?quality=90&strip=all&w=1200&h=630&crop=1&zoom=1&ssl=1", "published_at": "2019-10-15"}