{"pub": "arstechnica", "url": "https://arstechnica.com/gaming/2019/10/sony-confirms-the-playstation-5-is-coming-in-2020-reveals-new-hardware-details", "downloaded_at": "2019-10-09 00:16:35.999243+00:00", "title": "Sony confirms the PlayStation 5 is coming in 2020, reveals new hardware details", "language": "en", "text": "Sony representatives have revealed substantial new details about the company's upcoming PlayStation 5 console in an interview with Wired. New features and improvements will include sophisticated haptics in the controller, hardware ray tracing, and a UI that lets users see in-game information before launching a game. Additionally, Sony confirmed that the console will be called the PlayStation 5 and that it will launch before the holidays in 2020.\n\nMark Cerny, the architect of the PlayStation 4, has returned as chief architect for the PlayStation 5. Earlier this year, he sat down with Wired to demonstrate Sony's work to eliminate load times with extremely fast solid-state drives and improved software stacks and I/O to accompany them. In that demonstration, a fast-travel load in Spider-Man went from 19 seconds on current PS4 hardware to less than one second on new hardware.\n\nToday's interview touched on SSDs again, expanding upon the previous discussion to highlight additional benefits of the next-generation SSD—something that Microsoft has said it will include in its own next-generation console as well, also due in late 2020.\n\nCerny pointed out that game developers often duplicate data at multiple points on a disc or in a hard drive installation in order to make it easily accessible on traditional drives. In one example, an art asset that occurs repeatedly throughout an open-world city might be stored hundreds of times on the hard drive so it can quickly be loaded from any point in the game. Cerny says this new storage solution could allow developers to end that practice, either making room for more assets in the same installation size or freeing that space up on users' drives.\n\nAnd since games are getting quite large (Red Dead Redemption 2 took up nearly 100GB; The Elder Scrolls Online is even larger), the PlayStation 5 will use 100GB optical discs. It will support the 4K Blu-ray disc format.\n\nThe above-mentioned SSD implementation means that players will be able to jump into specific points in a game very quickly. And that home screen is seeing some changes that synergize with that capability. According to the interview, the home screen will be able to show in-game data from a game even if that game is not running and will facilitate the player opening the game directly to any part of it based on what data is presented.\n\nTo invent some examples that demonstrate how this could work: in a multiplayer shooter like Call of Duty, the player may see that there's a double-XP event for the Nuketown map and launch right into a Nuketown match from the home screen rather than having to go through all the introductory menus. Or the player could see a list of their available quests in an open-world RPG like Fallout 4 and opt to launch the game directly into a conversation with the in-game quest-giver.\n\nSony will also make it possible for developers to identify specific chunks of a game that can be installed or removed as needed. For instance, you could delete just the single-player mode from your drive to free up space if you're done playing it but you want to continue with multiplayer.\n\nA substantial portion of the Wired article focuses on the controller, though it does not go into too much detail about its design or layout other than to say it closely resembles the existing DualShock 4 controller that is packaged with the PlayStation 4. The emphasis of all this controller talk is on haptic feedback, a more sophisticated relative of rumble technology. This is the same technology that provides realistic feedback on a Mac trackpad click and that Nintendo offers a version of in the Nintendo Switch's joycons—a feature that players and critics have shared a lot of appreciation for since the Switch launch.\n\nThe article's author describes several simulated surfaces and experiences that use haptic feedback, such as a car driving with wheels on one side on the dirt and the other on pavement—he writes that he can feel both surfaces through the controller's haptics. He also notes that the controller's triggers (dubbed L2 and R2 on the DualShock 4) can provide variable resistance to simulate the drawing of a bow-string, among other things.\n\nAs is often the case with proprietary technologies in consoles, developer adoption may depend on whether both major competing consoles—Microsoft's Project Scarlett and Sony's PlayStation 5—support them. For example, the PlayStation 4's DualShock 4 controller has a touchpad that provided some interesting gameplay and input possibilities in some first-party Sony games and other early releases on the console, but over the years it has been used less, in part because most games are developed cross-platform, and Microsoft's controller does not have the same capability.\n\nThe SSD improvements, too, require active planning by the developers in terms of how data is stored and delivered from the disk in their games. That one is more likely to see widespread use, though, because the player and developer benefits are clear, and both consoles will include the feature.\n\nSony skipped E3 this year, so these articles have been our main source of information about the upcoming console. But expect to learn a whole lot more about both Sony and Microsoft's new consoles sometime next spring or summer.", "description": "An interview with architect Mark Cerny includes new hardware and software details.", "authors": ["Samuel Axon"], "top_image": "https://cdn.arstechnica.net/wp-content/uploads/2019/10/DSC00318-980x551-760x380.jpg", "published_at": "2019-10-08"}