{"pub": "investing.com", "url": "https://za.investing.com/analysis/rand-waits-on-brexit-and-trade-war-200431430", "downloaded_at": "2019-10-22 13:43:54.528277+00:00", "title": "Rand waits on Brexit and Trade War", "language": "en", "text": "Another topsy turvy week from the as we saw the market testing up above the R15/$ level, before breaking down lower again to sub R14.80...\n\nIt was a week of news and action, with the markets playing some games.\n\nToday's review will be a slightly shortened one, but there will still be plenty to review let's get into it!\n\nKey Moments (14-18 Oct 2019)\n\nHere were some of the big headlines of the week:\n\ndeal - finally, after years of backwards and forwards, it seemed there was going to be a deal between the EU and UK again\n\n- finally, after years of backwards and forwards, it seemed there was going to be a deal between the EU and UK again - it seemed to be the month for deals with the interim trade deal between the US and China being cheered by the markets, with hopefully more good news to follow.\n\nLoad shedding - it hardly seems possible, but Eskom is back to its bad old ways with blackouts day and night for businesses and homes.\n\n- it hardly seems possible, but Eskom is back to its bad old ways with blackouts day and night for businesses and homes. Turkey ceasefire - tensions temporarily lift in the East, as Turkey agrees to a ceasefire for a time in Cyria\n\nIt was a week of much news, and perhaps none bigger than the US-China interim trade deal which actually emerged the previous Friday. It was cheered by markets as a hope sprung that a complete solution was on the way.\n\nHowever, as the week went on this quickly changed, US Treasury Secretary Steven Mnuchin warned that if China failed to agree on a deal with the US soon, a new round of tariffs would likely kick in on the 15th of December. The fictitious tentative truce seems to be on the edge again as Chinese officials want the US to scrap the hikes scheduled for December before phase one of the trade deal is ironed out.\n\nSo it is a question of how much longer it will be all smiles with a 'deal' having been secured.\n\nThe bottom line is that it will just be China who cracks first, with a smaller, weaker and more desperate economy and people. The cracks are showing fast in China, with worse-than-expected Chinese import and export data out during the week showing the trouble brewing.\n\nAnd then it was much of the same over in the UK with Brexit as Borris Johnson came out with the much-awaited news that a deal had been secured between him and the EU, however, what followed was that it was going to be necessary for the UK MPs to vote on it before it would go into effect.\n\nThis is a problem with many PMs saying they will oppose the deal, and that it is \"worse than anything Theresa May ever put on the table\".\n\nThis will be one which plays out over the next few days as we rumble toward the October 31 deadline. Boris Johnson is not giving up on it for anything - regardless of whether MPs vote nay or not.\n\n(only for more to happen over the weekend which changed everything)\n\nIn amongst all of this, the did some bumps and bounces around the China news, breaking R15/$ again before pulling back down to sub R14.80 on Thursday with the Brexit deal triggering a nice move:\n\nIn other news:\n\nOver in Syria, tensions have been heating up with Trump opposing the invasion from Turkey's forces into Syrian territory, and eventually, on Thursday, Turkey agreed to a ceasefire. This should allow the evacuation of some US allies out of the area while the ceasefire goes on, and generally relax the tensions temporarily.\n\nSA' s favourite problem child Eskom was back in the news again...for the wrong reasons. Seemingly out of nowhere, stage 2 load shedding was implemented to stop a complete system collapse. It is said that the load shedding was caused as a result of the broken coal conveyor belt at Medupi plant - with bulldozers now being used to transport some of the coal in desperation to get some power being generated... these are some of the cracks showing of years of lack of maintenance, and too shows how SA lives on the edge of load shedding at all times.\n\nAnd it doesn't get easier for Eskom when government funding (tax) is way down, as Momentum Investments predicted a R50bn tax revenue shortfall. How one can budget for as much as a loss as that, who knows...! But somehow, Tito Mboweni is going to have to describe how he is going to turn the ship around at his 2019 mid-term budget.\n\nRamaphosa remains positive as he said \"I think Moody's will be happy\" with the plan to deal with Eskom's debt which will be announced very shortly. Many will be waiting with bated breath in view of the news...none more so than Saffers waiting for Moody's views on the plans...\n\nSAA is the other problem, and Ramaphosa also confirmed that the government was in talks with strategic equity partners to see what can be done - perhaps another stake in the company being bought by Ethiopian Airlines group. This would be an excellent turn of events, as Ethiopian Airlines is a massive African airline and has won awards in Africa for their flights. It may just be the shake-up SAA needs.\n\nAs for the markets, we saw the ended off the week with a quiet finish, trading in a fairly tight band around R14.80 as everyone awaited Brexit news.\n\nThe Week Ahead (21-25 Oct 2019)\n\nAnd over the weekend, the Brexit news came...\n\nThe MPs voted against the new deal and then to get Boris Johnson to request an extension of the October 31 deadline from the EU...\n\n(it seems to just be a game of 1 step forward, 2 steps back!)\n\nSo keep your eyes on this as we head into the new week, as clarity on this or the Trade War will be on good triggers for market movements.\n\nThe has made a quiet start to the week, trading just under R14.80, but there is plenty of events around:\n\nSA interest rates, Eskom's load shedding situation, and Moody's looming locally, while internationally the will be making a call on interest rates this week.\n\nPlenty to watch, and surely action ahead.\n\nThe question is - can the extend its gains?\n\nWe have some key levels this next week to watch, which could make this week a watershed one.\n\nLook forward to sharing my outlook with you.\n\nTo your success~\n\nJames Paynter\n\nLearn more by clicking here", "description": "Forex Analysis by Dynamic Outcomes Rand Forecasting Service (James Paynter) covering: USD/ZAR. Read Dynamic Outcomes Rand Forecasting Service (James Paynter)'s latest article on Investing.com South Africa.", "authors": [], "top_image": "https://i-invdn-com.akamaized.net/redesign/images/seo/investingcom_analysis_og.jpg", "published_at": "2019-10-22"}