{"pub": "nationalreview", "url": "https://boingboing.net/2019/04/04/bald-eagles-are-taking-trash-f.html", "downloaded_at": "2019-10-05 06:26:26.749636+00:00", "title": "Bald eagles are taking trash from a Seattle landfill and dumping it into suburban yards", "language": "en", "text": "Bald eagles are taking trash from a Seattle landfill and dumping it into suburban yards\n\nIt is raining trash in the suburbs of Seattle. Or, rather, bald eagles – around 200 of them – are dropping trash into people's yards every day, and the suburbanites are not happy.\n\nThe trash – including a blood-filled biohazard container that landed in one lucky resident's yard – is coming from a nearby landfill that takes in two tons of fresh trash a day. The bald eagles pick out the juicy morsels of food found in the landfill, and then discard the junk that they don't want in the nearby neighborhoods.\n\nAccording to Popular Mechanics:\n\nThe main issue is the open-air landfill in the area, the Cedar Hills Regional Landfill in King County. That landfill was supposed to have been closed years ago, but a proposed expansion has kept it open. In fact, that expansion is meant to keep the landfill exposed until 2040... Many of the residents want the county to cancel the proposed expansion and finally close the landfill. In the meantime the residents are hoping to implement some sort of anti-eagle measures at the landfill, although it’s not entirely clear what those would look like. There’s something almost poetic about the American national bird reminding people that the trash they throw in a landfill doesn’t simply disappear. In a way, these birds are a visceral demonstration of the usually hidden consequences of extreme consumption. We create too much trash, and that much trash creates consequences. That could mean eagles dropping biohazard containers in your front lawn, or it could mean nearly 20 tons of plastic washing up on one of the most remote beaches in the world.\n\nImage: by Carl Chapman from Phoenix, usa - Eagle Shots, CC BY 2.0, Link", "description": "It is raining trash in the suburbs of Seattle. Or, rather, bald eagles – around 200 of them – are dropping trash into people's yards every day, and the suburbanites are not happy. The trash – including a blood-filled biohazard container that landed in one lucky resident's yard – is coming from a nearby landfill…", "authors": [], "top_image": "https://i0.wp.com/media.boingboing.net/wp-content/uploads/2019/04/eagle.jpg?fit=700%2C463&ssl=1", "published_at": "2019-04-04"}