{"pub": "thehill", "url": "https://thehill.com/latino/466212-man-dies-by-apparent-suicide-while-in-ice-custody", "downloaded_at": "2019-10-17 01:48:48.447826+00:00", "title": "Man dies by apparent suicide while in ICE custody", "language": "en", "text": "A Cuban man who was being detained by Immigration and Customs Enforcement (ICE) in Louisiana died Tuesday of an apparent suicide.\n\nRoylan Hernandez-Diaz, 43, was pronounced dead on Tuesday afternoon by medical personnel at the Richwood Correctional Center in Richwood, La., according to an ICE statement.\n\nThe statement listed Hernandez-Diaz's preliminary cause of death as self-inflicted strangulation but said the case remains under investigation.\n\nADVERTISEMENT\n\nBuzzFeed News reported that Hernandez-Diaz was an asylum-seeker. An ICE spokesman told The Hill that he does \"not dispute\" that Hernandez-Diaz was seeking asylum. The ICE statement said his \"claim for an immigration benefit\" had not been decided in court at the time of his death.\n\nHernandez-Diaz entered ICE custody in May after he was found to be inadmissible to the U.S. at the Paso Del Norte Port of Entry in El Paso, Texas, the statement said.\n\nHe is the second person to die in ICE custody this month.\n\n\"ICE is firmly committed to the health and welfare of all those in its custody and is undertaking a comprehensive agency-wide review of this incident, as it does in all such cases,\" the agency said in a statement. \"Fatalities in ICE custody, statistically, are exceedingly rare and occur at a fraction of the rate of the U.S. detained population as a whole.\"\n\nHernandez-Diaz's wife, Yarelis Gutierrez, 43, told BuzzFeed that her husband said he was planning to participate over a hunger strike.\n\n\"He told me he was going to participate in a hunger strike because of the abuse he endured in detention,\" Gutierrez told the news outlet. \"He never said he was going to hurt or kill himself. This is all news to me and I don't believe it's true.\"\n\nHernandez-Diaz's death was first reported by Telemundo.", "description": "A Cuban man who was being detained by Immigration and Customs Enforcement (ICE) in Louisiana died Tuesday of an apparent suicide.", "authors": [], "top_image": "https://thehill.com/sites/default/files/ice_detention_center_0.jpg", "published_at": "2019-10-17"}