{"pub": "washingtontimes", "url": "https://washingtontimes.com/news/2019/oct/7/tofurky-sues-over-truth-labeling-fake-meat-makers-", "downloaded_at": "2019-10-08 02:16:03.982987+00:00", "title": "States beef up laws on 'misleading' food labels as fake meat, milk sales soar", "language": "en", "text": "Arkansas farmer David Hillman was intrigued when he ran across a product at the grocery store called “cauliflower rice,” until he realized it wasn’t really rice. Then he was steamed.\n\n“I looked at the label, and it wasn’t rice at all. It was cauliflower,” said Mr. Hillman, a Republican state legislator who grows rice at his farm in Almyra. “And I thought, ‘Well, how can they get by with this?’”\n\nHis bill requiring “truth in labeling” for edible agricultural products was approved in March as the ranching and farming industries sought to protect their brands from being confused with the many plant-based items cropping up on supermarket shelves.\n\nThe American Civil Liberties Union has another word for it: censorship.\n\nACLU attorneys were in federal court Monday on behalf of Tofurky seeking to block the Arkansas law, which prohibits fake beef, poultry, pork and rice makers from adopting labels with terms associated with the real stuff.\n\nThat would include Tofurky favorites such as “sausages,” “brats” and “roasts,” even though CEO Jaime Athos insisted that consumers opt for such foods “not because they are confused or misled, but because they are savvy and educated about the health and environmental consequences of eating animal products.”\n\n“Phrases like ‘veggie burger’ are well-established in common vernacular and help consumers choose a plant-based alternative that works best for their favorite dishes,” he said. “We hope to block this unconstitutional law from being enforced so that consumers can continue to have access to familiar plant-based products in Arkansas, and ultimately across the United States.”\n\nArkansas is one of eight agricultural states to enact laws against “misleading” labels on synthetic and plant-based foods in the absence of national rules on the growing cornucopia of faux meat and dairy products.\n\nSales of plant-based meat and milks grew by 17% last year, outpacing total retail food sales, which increased by 2%. The fake meats accounted for $684 million in sales, while the “milks” made from almonds, cashews, soy beans and more reached $1.8 billion, according to the Good Food Institute, a trade association for the industry.\n\n“Sooner or later, the FDA and the USDA are going to have to come out with standards,” said Mr. Hillman. “That was an impetus behind this bill. If enough states would call attention to this problem, they would have to do something.”\n\nThe trend is expected to heat up as fast-food chains introduce their own meatless patties. Burger King is selling the Impossible Whopper, and McDonald’s is test-marketing its Garden Gourmet Incredible Burger in Germany.\n\n“Label censorship will result in misleading labels and fewer options for consumers,” said the Good Food Institute, a plaintiff in the Arkansas case.\n\nColin Woodall, CEO of the National Cattlemen’s Beef Association, argued that the meatless products are piggybacking off years of branding and advertising by ranchers, citing, for example, Beyond Meat’s “Beyond Beef” products, or other non-meat items labeled “beefy.”\n\n“We do not believe any of these plant-based products should use the term ‘beef’ at all,” Mr. Woodall said. “Beef is something that has been associated with us for millennia, and what they’re trying to do is replicate or imitate without coming up with their own nomenclature.”\n\nChanging common food names has happened before. U.S. farmers rebranded the “alligator pear” as the “avocado,” sending sales soaring, although backers of plant-based foods call it unrealistic to demand that the industry create new terms for commonplace items such as “hamburgers” and “hot dogs.”\n\n“No one knows what a ‘veggie disc’ is, and to force our client to use such a label is absurd and unconstitutional,” said Brian Hauss, staff attorney for the ACLU’s Speech, Privacy and Technology Project. “This law is creating consumer confusion and censoring businesses from communicating truthfully about their products.”\n\nThe Arkansas bill has been blasted as an effort by the Farm Bureau and cattlemens associations to beat back competition, but Mr. Hillman insisted it’s just common sense. His bill had virtually no opposition as it rolled through the state General Assembly. It passed the Senate by a vote of 31-3 and the House by a vote of 87-4.\n\n“Burger King is now selling meatless hamburgers. They’re very upfront about it, they say exactly what it is, there’s no meat, and I say, more power to them. If that’s what the public wants, that’s what we’re going to give them,” Mr. Hillman said. “But don’t sell one thing and call it something else. Don’t sell a Cadillac and call it a Chevrolet.”\n\nIn its response, the Arkansas attorney general’s office argued that the request for a preliminary injunction is unnecessary given that the state has opted not to enforce the law until the legal battle is resolved. It also said the case is unlikely to succeed on the merits.\n\n“As an initial matter, Tofurky’s misleading commercial speech is not protected by the First Amendment,” said the brief.\n\nOther states approving truth in labeling laws are Louisiana, Mississippi, Missouri, Oklahoma, North Dakota, South Dakota and Wyoming. In February, the ACLU reached a settlement with Missouri officials after challenging the state law.\n\nMr. Hillman said the Arkansas legislation, Act 501, is the most innocuous of the state laws because it doesn’t include faux dairy products and imposes fines of $1,000 per violation, but no criminal penalties.\n\n“It was probably the uncontroversial thing that I have done,” said Mr. Hillman. “I don’t want to punish anybody. I just want people to label their stuff right.”\n\nSign up for Daily Newsletters\n\nCopyright © 2019 The Washington Times, LLC. Click here for reprint permission.", "description": "ACLU attorneys were in federal court Monday on behalf of Tofurky seeking to block the Arkansas law, which prohibits fake beef, poultry, pork and rice makers from adopting labels with terms associated with the real stuff.", "authors": ["The Washington Times Http", "Valerie Richardson"], "top_image": "https://twt-thumbs.washtimes.com/media/image/2019/10/07/AP_19213410709874_c0-147-4736-2908_s1770x1032.jpg?28a54e37e2fa0b030511a55368b9968be16d3422", "published_at": "2019-10-07"}