{"pub": "bbc", "url": "https://bbc.com/news/uk-england-london-49636149", "downloaded_at": "2019-09-13 18:13:28.545342+00:00", "title": "'Why I'm using a drone to stop Heathrow flights'", "language": "en", "text": "Image caption Sylvia Dell will be flying a drone during the protests\n\nEnvironmental protesters are trying to use drones to bring flights to a halt at the UK's biggest airport, Heathrow, from Friday. Why are they taking this drastic step, and who will it affect?\n\n\"I find the whole prospect of potentially going to prison terrifying,\" Sylvia Dell tells the BBC's Victoria Derbyshire programme, regarding the threat she could soon face.\n\n\"But this issue is too important.\"\n\nMs Dell says she has already been arrested for taking part in previous climate change protests.\n\nNow the retiree intends to fly a lightweight, toy drone within the three-mile (5km) no-fly zone surrounding Heathrow Airport, in a protest known as Heathrow Pause.\n\nThe aim is to bring attention to the environmental damage the planned third Heathrow runway could cause.\n\nMs Dell describes its construction as \"sheer lunacy\".\n\nShe decided to take action when one of her sons, aged 27, explained how angry he was that previous generations had done little to tackle global warming, and she remains resolute in her view that what she describes as \"civil disobedience\" can bring about change.\n\n'Criminal activity'\n\nThe protests began on 13 September, but could stretch further.\n\nHeathrow Pause said the airport would be given an hour's notice before all of the drone flights, which are planned at regular intervals to ensure \"no aircraft flights will take place\".\n\nThe Met Police has said it will \"do everything in its power to stop and prevent any such criminal activity\" and that the consequences of flying the drones are \"potentially very severe\".\n\nBut Ms Dell disputes this, saying she believes it is \"perfectly safe\" to fly the toy drones at head height, as planned, although she has no formal experience of piloting one.\n\nImage copyright PA Image caption Heathrow Pause said the drones would not be flown on flight paths\n\nHeathrow Airport has described the campaigners' plans in a statement as \"criminal and counterproductive\".\n\n\"We agree with the need to act on climate change\", it said, adding: \"This is a global issue that requires constructive engagement and action.\"\n\nMs Dell has said previous meetings with the Heathrow Aviation Authority, in her view, have proved ineffective.\n\nShe now wants the government to listen and take action - something she hopes these protests will achieve.\n\nArrests over Heathrow Airport drone protests\n\nThe Heathrow Pause organisers say the protests have been timed to disrupt mostly frequent flyers and those flying for business reasons.\n\nBut for some it may prove a step too far.\n\nDespite sharing many of the same coordinators, the Extinction Rebellion group - from which Heathrow Pause is an offshoot - has said it is not backing the demonstration - although it does not condemn it.\n\nIt said in a statement: \"It is clear that people in the movement have had different views around this proposed action and that tension has arisen from figuring out the most effective way to tell the truth about the climate and ecological emergency we face.\"\n\nImage caption Mussirah Moossun believes the protests will undermine the group's message\n\nOne holiday-maker, Mussirah Moossun, told the BBC the actions of the campaigners were \"selfish\".\n\nShe is due to fly to Turkey to go on holiday with her mother, who has recently been ill.\n\n\"It feels like disrupting people in this way is a really negative way of making a point,\" she said.\n\n\"I do understand people are really passionate about their cause, but some people have to travel for really serious reasons.\"\n\nMs Moossun believes the protests \"will annoy people more than it will make them understand the message\".\n\n\"It will cause frustration when you want people to be positive about your cause,\" she added.\n\n\"I think the fact that Extinction Rebellion have distanced themselves from the protest really means they need to re-examine their tactics.\"\n\nImage caption Morgan Perry fears a loss of earnings if the protests disrupt his flight\n\nMorgan Perry, from Cardiff, also faces disruption.\n\nHe works for a tech firm and was due to fly back to Heathrow from San Francisco on Friday. Being unable to would mean missing work, and a loss of earnings.\n\nHe said he cares about protecting the environment, but has little alternative but to fly to get to places like the US.\n\n\"I've seen the protests from similar groups over the summer and I understand what the protest is trying to do, but from what I can see it doesn't lead to much change,\" he explained.\n\n\"These groups need to lobby corporations and governments instead.\"\n\nImage caption Jonathan Fishwick is taking part because he believes the planet is in \"deep, deep trouble\"\n\nJonathan Fishwick, a window cleaner by trade, is set to fly a drone in the protests. He said he understood the group's actions may seem unnecessarily disruptive to some.\n\nBut he believes strongly in the need \"to do what I think is right, and not what is popular\".\n\n\"Our planet is heating up so fast that we won't be able to grow enough food - and history tells us when the food system collapses, society collapses,\" he said.\n\n\"For me personally this is about my conscience. It's so important for me to get the message out that we are in deep, deep trouble.\"\n\nBoth he and Ms Dell said they were fully aware they could go to prison for taking part. Both said they found that prospect \"terrifying\".\n\nBut for Ms Dell the risk has made her more determined.\n\n\"We're the fire alarm waking the public up [to the danger],\" she said.\n\n\"If we get sent to prison, then what sort of world are we truly inhabiting?\"\n\nFollow the BBC's Victoria Derbyshire programme on Facebook and Twitter - and see more of our stories here.", "description": "Sylvia Dell says highlighting the issue of climate change is worth the risk of going to prison.", "authors": ["Catrin Nye", "Victoria Derbyshire Programme"], "top_image": "https://ichef.bbci.co.uk/news/1024/branded_news/12F1A/production/_108749577_sylviadell2.jpg", "published_at": "2019-09-13"}