{"pub": "wsj", "url": "https://wsj.com/articles/behind-the-auto-workers-strike-11568754001?mod=rsswn", "downloaded_at": "2019-09-17 23:28:22.657646+00:00", "title": "Behind the Auto Workers Strike", "language": "en", "text": "Unions blame declining membership on greedy corporations, but they should take a look in the mirror—and at the United Auto Workers strike at General Motors for an exhibit in self-destructive labor leadership.\n\nGM’s four-year labor agreement expired on Saturday, but unlike in past negotiations the union hasn’t agreed to a short-term extension. While the UAW is also haggling with Fiat Chrysler and Ford, GM is the first strike target because it is the most profitable. The UAW wants GM to make concessions that will become a model for contracts with the other two.\n\nThe UAW last went on strike at GM in 2007 not long before GM and Chrysler received a federal bailout, and let’s hope history doesn’t repeat. Car makers want to prepare for a future economic downturn while UAW leaders are honking their horns to distract members from a federal corruption probe.\n\nGM last year made $11 billion in profit and paid workers $10,750 each in profit-sharing payments. The average hourly employee earns $90,000 annually and pays a mere 3% of health costs compared to an average of 30% in private industry. No wonder union workers don’t believe Bernie Sanders ’s claim that they’ll pay less under Medicare for All. They won’t.\n\nBut Detroit’s good times aren’t certain to continue. Ford’s credit rating last week was downgraded to junk amid plunging sales in China and Europe. A long industry upswing in the U.S. fueled by dealer incentives, low interest rates and rising wages has stalled. Trade uncertainty hurts too.\n\nAuto makers have also been ordered by Beijing, Brussels and Sacramento to manufacture more electric cars that are crimping profits and sucking up capital. Hence GM announced last year that it is ending production at four factories and cutting 2,800 jobs.\n\nBut GM says it has offered the union new investment at eight current plants, 5,400 more jobs, annual wage increases over the next four years, an $8,000 ratification bonus per worker, sweeter profit-sharing formula and no change in health contributions. Laid-off workers will be able to transfer to GM’s other plants.\n\nUAW leaders have rejected this offer but are vague about what they want beyond a faster phase-out of a two-tier wage structure and fewer temporary workers. Their main goal seems to be to rally workers, especially newer hires with less loyalty to the union, as they try to staunch a membership decline amid the spiraling corruption investigation.\n\nThe Justice Department has charged several former UAW officials for conspiring to embezzle worker dues and training funds to spend on lavish personal expenses including private villas, designer clothes, golf clubs, spa visits and sports cars. Last week the feds indicted Region 5 Director Vance Pearson, who has advised the union’s negotiations with GM.\n\nThe Detroit Free Press has identified UAW President Gary Jones as “UAW Official A” in the latest complaint, and agents recently searched his home. Messrs. Jones and Pearson say they have done nothing wrong, though other union officials have been found guilty, including the union’s former negotiator with Fiat Chrysler. These are the union “stakeholders” that Elizabeth Warren wants on corporate boards.\n\nThe UAW lost 35,000 members last year amid media reports of the corruption probe even as auto employment increased by 20,000—much of which occurred at non-unionized manufacturers with pay comparable to nearby UAW plants. Michigan, Wisconsin and Kentucky have also enacted right-to-work laws that allow workers to opt out of unions.\n\nSo now UAW leaders are trying to justify the 2011 dues increase they claimed was to support a worker strike fund. Workers will still lose between 60% and 80% of their pay while on strike, though GM has time to negotiate as it sits on 11 weeks of car inventory.\n\nDemocratic presidential candidates including Mr. Sanders, Ms. Warren, Kamala Harris and Joe Biden have made statements supporting striking workers but ignore the corruption probe. Perhaps the UAW figures that even if its demands drive auto makers back into trouble, the politicians will bail them out again.", "description": "Is the union trying to distract from a federal corruption probe?", "authors": ["The Editorial Board"], "top_image": "https://images.wsj.net/im-107997/social", "published_at": "2019-09-17"}