{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7619687/IS-spokesman-killed-fresh-north-Syria-raid-SDF-official.html", "downloaded_at": "2019-10-28 00:39:29.755324+00:00", "title": "New US-led assault in Syria 'kills ISIS spokesman'", "language": "en", "text": "The Islamic State group's spokesman was killed Sunday in northern Syria, a top Kurdish official said, hours after the jihadists' leader Abu Bakr al-Baghdadi was announced dead.\n\nThe official with the Kurdish-led Syrian Democratic Forces -- who asked not to be named because he is not authorised to speak on the issue -- said IS spokesman Abu Hassan al-Muhajir had been killed, after SDF chief Mazloum Abdi said he had been 'targeted' in a fresh raid.\n\n'Al-Muhajir, the right-hand of Baghdadi and the spokesman for IS, was targeted in the village of Ain al-Baydah near Jarablus, in a coordinated operation between SDF intelligence and the US army,' Abdi said on Twitter.\n\nFirefighters extinguish the flames of a burning truck at the spot where Abu Hassan al-Muhajir, the Islamic State group's spokesman was reportedly killed in a raid in the northern Syrian village of Ayn al-Bayda near Jarablus on Sunday\n\nAn AFP correspondent in Ain al-Baydah, which is controlled by Turkey-backed Syrian rebels, said two vehicles where hit by airstrikes: a small pick-up truck and a larger truck carrying a small metal container.\n\nHe saw two corpses lying outside the first vehicle while a third charred body was in the metal container.\n\nHe could not identify who was behind the strikes or if they were carried out by warplanes or a drone.\n\nThe Britain-based Syrian Observatory for Human Rights confirmed the death of al-Muhajir, saying he was among five IS members who were killed in a US-led operation backed by the SDF.\n\nIn a later post on Twitter, SDF spokesman Mustefa Bali said: 'We believe ISIS spox. Al-Muhajir was in Jarablus to facilitate Baghdadi's entry to Euphrates Shield area,' referring to a zone in northern Syria controlled by Turkey's Syria proxies.\n\n'The two US-led operations have effectively disabled top ISIS leadership who were hiding' in northwest Syria.\n\n'More still remain hiding in the same area,' Bali said.\n\nEarlier on Sunday, Trump said Baghdadi was killed, dying 'like a dog,' in a daring, nighttime raid by US special forces deep in northwest Syria.\n\nTrump said that US forces killed a 'large number' of IS militants during the raid, which culminated in Baghdadi cornered in a tunnel, where he detonated a suicide vest.\n\nThe operation to kill Baghdadi took place near a small village in northwestern Syria called Barisha, more than a 100 kilometres west of Ain al-Baydah.\n\nThe IS 'caliphate' was eradicated in March, nearly five years after it was proclaimed by Baghdadi, largely reducing the jihadist militants to scattered sleeper cells.\n\nAt the time, the IS spokesman came out of months of silence to spur on his troops.\n\nHe had not delivered a speech since March.", "description": "The Islamic State group's spokesman was killed Sunday in northern Syria, a top Kurdish official said, hours after the jihadists' leader Abu Bakr al-Baghdadi.", "authors": ["Joe Middleton For Mailonline"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/27/20/wire-20254648-1572208104-276_636x382.jpg", "published_at": "2019-10-27"}