{"pub": "reuters", "url": "https://reuters.com/article/us-usa-trump-nationalsecurity/short-list-to-replace-bolton-includes-some-familiar-white-house-faces-idUSKCN1VW2LF", "downloaded_at": "2019-09-12 11:51:54.862557+00:00", "title": "Short list to replace Bolton includes some familiar White House faces", "language": "en", "text": "WASHINGTON (Reuters) - President Donald Trump’s short list for the post of national security adviser is made up of reliable conservatives with solid ties to key Trump administration stalwarts, including, according to several sources, the vice president’s foreign policy chief.\n\nMike Pence’s national security adviser, retired General Keith Kellogg, is part of a group that also includes the State Department’s Iran envoy, Brian Hook, and former deputy White House national security adviser Rick Waddell.\n\n“Those are the names the president mentioned to me,” Republican Senator Lindsey Graham, a Trump confidant, said on Fox News Channel’s “Special Report.”\n\nAfter 17 months of John Bolton, a bureaucratic infighter with an abrasive personality, Trump wants someone he can work with easily, people inside and outside the White House said. He and Bolton differed on a range of foreign policy issues, from Iran to North Korea to Afghanistan.\n\nTrump is also said to be considering his presidential envoy for hostage affairs, Robert O’Brien, who has a long history in Republican foreign policy circles, sources familiar with the discussions said.\n\nThe sources said Steve Biegun, who is the U.S. envoy to North Korea, was also a candidate for the position, which abruptly came open when Trump fired Bolton on Tuesday.\n\nU.S. Ambassador to Germany Richard Grenell was a potential candidate although Trump has said he likes the job Grenell is doing as ambassador, a source familiar with the situation said.\n\nGrenell was traveling to Washington on Wednesday for a long-planned trip expected to include a visit to the White House, said a source familiar with his plans.\n\nTrump told reporters in the Oval Office on Wednesday that he was looking at five people who “I consider highly qualified, good people that I’ve gotten to know over the last three years.”\n\nHe said he would have an announcement about who he wants for the job next week. The position does not need to be confirmed by the Senate.\n\nKellogg has served in the Trump administration from the outset. He was executive secretary of the National Security Council until Bolton took over the office 17 months ago, when he moved over to become Pence’s national security adviser.\n\nA source close to the White House said Secretary of State Mike Pompeo, an increasingly influential figure in the administration, likes Kellogg, who has been active in the effort to force Venezuelan President Nicolas Maduro to step down.\n\nHook is also liked by Pompeo but he was just appointed to play an increased role in a Middle East peace initiative run by senior Trump adviser and son-in-law Jared Kushner.\n\nSlideshow (3 Images)\n\nHook and Kushner aide Avi Berkowitz are absorbing the duties of Mideast envoy Jason Greenblatt when he leaves the White House later this year.\n\nOne source said Hook might be better placed to continue in that role, however.\n\nWaddell was deputy White House national security adviser for a year when retired General H.R. McMaster had the top job, and was well-liked within the White House, said a source familiar with the matter.", "description": "President Donald Trump's short list for the post of national security adviser is made up of reliable conservatives with solid ties to key Trump administration stalwarts, including, according to several sources, the vice president's foreign policy chief.", "authors": ["Steve Holland", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190911&t=2&i=1428798747&w=1200&r=LYNXNPEF8A1PR", "published_at": "2019-09-11"}