{"pub": "telegraph", "url": "https://telegraph.co.uk/recommended/home/best-electric-heater-portable-use-around-house", "downloaded_at": "2019-10-05 14:49:23.762451+00:00", "title": "The best electric heaters for portable use around the house", "language": "en", "text": "The summer of 2019 saw heat records broken as parts of the country scalded in 39C heat – but as any Briton knows, a summer heatwave is only ever a fleeting thing. To keep things warm as the weather turns, you'll most probably need heating and, if your central heating doesn't quite cut it – or if you're in an area with no gas heating – then a portable electric heater (sometimes known as a space heater) is worth considering.\n\n\"Portable heaters are great for situations where heating has failed in your house,\" explains Rob Bennett, technical service manager at Pimlico Plumbers. \"They are also great for camping and outdoors, when the cold hits.\"\n\nIn the home, you might consider using an electric heater if only requiring short, targeted warmth. For example, if you're having a quick shower before leaving the house in the morning, you can use one in the bathroom rather than switching on the whole house's central heating. Or, if you have a small outside summer house that doubles as an office, a portable heater means you don't have to worry about connecting the space to your central heating system.\n\nConversely, portable heaters are \"not so great for a constant heating source in a large area where heat disperses quickly,\" Bennett warns, because they struggle to fill the space.", "description": "The summer of 2019 saw heat records broken as parts of the country scalded in 39C heat – but as any Briton knows, a summer heatwave is only ever a fleeting thing.", "authors": ["Tomé Morrissy-Swan"], "top_image": "https://www.telegraph.co.uk/content/dam/recommended/2018/11/07/Best-portable-heaters-xlarge_trans_NvBQzQNjv4BqqVzuuqpFlyLIwiB6NTmJwfSVWeZ_vEN7c6bHu2jJnT8.png", "published_at": "2018-11-07"}