{"pub": "fox", "url": "https://foxnews.com/food-drink/kanye-west-chick-fil-a-closed-on-sunday", "downloaded_at": "2019-10-03 23:30:07.537875+00:00", "published_at": "2019-10-03", "title": "Kanye West references Chick-fil-A repeatedly in new song ‘Closed on Sunday’", "language": "en", "text": "Kanye West has apparently moved on from McDonald’s and Burger King to another beloved fast-food chain — Chick-fil-A.\n\nCHICK-FIL-A NAMED CLEANEST FAST-FOOD RESTAURANT, BUT HAS SLOWEST DRIVE-THRU, NEW STUDIES SAY\n\nThe rapper-turned-gospel singer has been reportedly hosting listening parties for his upcoming religious-themed album, “Jesus is King,” where a certain song has stood out for its repeated reference to the beloved American fast-food chain.\n\nThe song, “Closed on Sundays,” reportedly has the lyrics “Closed on Sunday, you my Chick-fil-A,” according to a recording shared on Twitter. The song goes on to urge listeners to “Follow Jesus, listen and obey.”\n\nCLICK HERE FOR THE ALL-NEW FOXBUSINESS.COM\n\nIn addition to his documented love of fast food, the born-again Christian has been very vocal about his religious views recently, holding church services and reportedly declaring he is moving away from secular music to focus on gospel.\n\nChick-fil-A did not respond to Fox News’ request for comment, but the chain being featured in a Christian-themed song is fitting as the restaurant has always been strong in its faith.\n\nCLICK HERE TO SIGN UP FOR OUR LIFESTYLE NEWSLETTER\n\n\"Closing our business on Sunday, the Lord's Day, is our way of honoring God and showing our loyalty to Him,\" Chick-fil-A's founder, Truett Cathy, wrote in his book, “Eat Mor Chikin: Inspire More People,” Business Insider reported.", "description": "Kanye West has apparently moved on from McDonald’s and Burger King.", "authors": ["Alexandra Deabler", "Alexandra Deabler Is A Lifestyle Writer", "Editor For Fox News."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/kanye-west-sunday-service-kim-kardashian.jpg"}