{"pub": "townhall", "url": "https://townhall.com/columnists/jackiegingrichcushman/2019/10/24/we-should-take-heed-of-germanys-utter-failure-even-if-they-didnt-n2555269", "downloaded_at": "2019-10-25 23:46:14.788695+00:00", "title": "We Should Take Heed of Germany's Utter Failure, Even if They Didn't", "language": "en", "text": "The opinions expressed by columnists are their own and do not represent the views of Townhall.com.\n\nGerman Chancellor Angela Merkel acknowledged that more should have been done to make immigration and refugee assimilation successful. \"Germany's attempt to create a multicultural society has 'utterly failed,'\" she told members of the Christian Democratic Union party in a speech in 2010, Reuters reported at the time.\n\nSome blamed Merkel's shift in tone to pressure from her political right. Whatever the reason, those of us who live across the pond would be wise to give her message the deliberation it deserves.\n\nMerkel didn't say that immigrants are bad or that Germany shouldn't accept refugees; she said the current experience in Germany of \"allowing people of different cultural backgrounds to live side by side without integrating had not worked,\" Reuters reporter Sabine Siebold wrote.\n\nMerkel first took office as chancellor in 2005. Until last year, she was also the head of the Christian Democratic Union party. For over a decade, Merkel was often \"the decider\" -- the European leader who took point on many issues, from immigration to the financial crisis. Faced with a declining German population, Merkel championed immigration and opening German borders to refugees.\n\nIn 2015, when the European Union required refugees to return to the country in which they had registered upon entry into the union, Merkel began allowing Syrian refugees who had already registered in another EU country to enter Germany and stay there.\n\nSoon after, Merkel opened Germany's border with Hungary and allowed thousands of refugees to pass through. Merkel promised to spend $6.8 billion for housing, care and training for the refugees. Based on her actions in 2015, she must have either given into Germany's failings or decided that they were not failing all that badly.\n\n\"This crisis will change our nation,\" Merkel said in an address to her nation that year. \"But I think we are up for the challenge.\"\n\n\"This (multicultural) approach has failed, utterly failed,\" Merkel said, according to Reuters. Siebold continues, \"(Merkel) said too little had been required of immigrants in the past and repeated her usual line that they should learn German in order to get by in school and have opportunities on the labor market.\" Today there are still assimilation issues, but not only in Germany. The same is true for enclaves in our country.\n\nMerkel stressed that it is important for immigrants to integrate into society and adopt the culture and values of their host country. If migrants are preparing and planning to return to their home country, then, possibly, distinctly separate communities makes sense -- temporarily. But to move into a community permanently is different. Either the immigrants change to fit into the current culture and ethos, or they bring their culture, values and beliefs and reject those of the home country. The best result happens when both grow together, taking the best of both and creating a better future together.\n\nIn our country, the debate about immigration and asylum has become politically charged. While we want to be welcoming, we have to agree on what those who enter our country as guests will be required to do. And whether they are required to adhere to the rule of law.\n\nThis gets to the core of the issue: What are our values as Americans and what values do we want immigrants and refugees to adopt as they move into our country? Or are we willing to accept them no matter what their values?\n\nFirst, what are our values as Americans? In 1998, according to a Wall Street Journal/NBC News poll, the values of hard work, commitment to religion, patriotism and children/family were supported by strong majorities in America.\n\nLast August, a different Wall Street Journal/ NBC News poll showed very different results. Hard work remained on top, at 89%, but from there the differences reflect a seismic shift of values -- one that was driven by the responses of those under 50.\n\nThe other top values were tolerance for others at 80%, financial security at 79% and self-fulfillment at 64%. Of the key American values from two decades earlier, patriotism came in at 61%; religion at 48%; and having children at 43%.\n\nThe pollsters then asked about \"changes in American society and the country becoming more diverse and tolerant of different lifestyles, languages, cultures and race,\" and whether these changes are a step forward, a step backward, or \"some of both.\" The answers were 40% for \"a step forward,\" 14% for \"a step back,\" and 43% for \"some of both.\"\n\nWhile the media often frames issues as yes or no, the reality is more often encapsulated in the majority response above and in Merkel's confession of failure in Germany. In our country, immigrants also make up about 15% of our population. To avoid Germany's utter failure, we should heed Merkel's advice, even if she didn't, that shared values and culture are critical.", "description": "German Chancellor Angela Merkel acknowledged that more should have been .10/25/2019 19:46:15PM EST.", "authors": ["Jackie Gingrich Cushman", "Bronson Stocking", "Matt Vespa"], "top_image": "https://media.townhall.com/townhall/reu/s1280x720/2018/308/22605031-17c4-4859-adb4-975d33c08d95.jpg", "published_at": "2019-10-24"}