{"pub": "dailymail", "url": "https://dailymail.co.uk/tvshowbiz/article-7577209/Supergirls-Odette-Annable-separates-husband-David-nearly-decade-marriage.html", "downloaded_at": "2019-10-15 23:10:28.571612+00:00", "title": "Supergirl's Odette Annable separates from husband David after nearly a decade of marriage", "language": "en", "text": "Supergirl's Odette Annable has split with her actor husband David.\n\nThe 34-year-old talent and Brothers And Sisters star, who is 40, announced their separation via a statement to People on Tuesday.\n\n'It's with heavy hearts that we have come to the mutual decision to separate at this time,' they told the publication.\n\nEnd of the road: Actors Odette and David Annable have split after nearly a decade of marriage\n\nTheir statement went on to talk about their three-year-old daughter Charlie, telling the public she remains their 'primary concern.'\n\n'Our daughter is our primary concern,' the couple said. 'We remain committed to co-parenting her together.'\n\nThe closed their statement by asking the public to 'respect [the] family's privacy at this time.'\n\nThe couple last appeared together on social media in July when he shared a thowback of Odette while pregnant.\n\nPriorities: Their statement went on to talk about their three-year-old daughter Charlie, telling the public she remains their 'primary concern'\n\nBetter times: The couple last appeared together on social media in July when he shared a thowback of Odette while pregnant\n\nOdette and David wed in 2010 during an intimate ceremony in the eclectic Ventura County enclave of Ojai, California.\n\nA month ago David announced he was parring back his use of social media, talking about the 'anxiety' and 'depression' the platforms provoked.\n\n'Turns out all of the articles and science about how Instagram can cause depression and anxiety is real,' Dave told followers.\n\n'I'm saying goodbye to all of the vacations I'm not on, all of that time I've spent mindlessly scrolling, all of the anxiety that can come with follows/unfollows/likes and unfortunately SO much more.'\n\nAt the time of the post he signaled he was only following a single person. Now, David appears to follow zero accounts.\n\nWhen it was good: Odette and David wed in 2010 during an intimate ceremony in the eclectic Ventura County enclave of Ojai, California\n\nStepping away: A month ago David announced he was parring back his use of social media, talking about the 'anxiety' and 'depression' the platforms provoked\n\nUnfollower? At the time of the post he signaled he was only following a single person. Now, David appears to follow zero accounts.\n\nJust back in June, the pair talked to Us Weekly about how they 'keep their romance alive.'\n\nOpening up to the magazine, they revealed they 'enjoy nothing more than dropping her off at her grandparents so we could have a night alone.'\n\nThey didn't ignore how 'lucky' they are to have family to support them, telling Us: 'It’s important and we’re very lucky to have family and wonderful in-laws that are close and just want to spend time with her, so we took them up on that.'\n\nOfficial divorce filings have yet to happen, meaning any custody arrangement for the couple appears up in the air at this point.", "description": "'It's with heavy hearts that we have come to the mutual decision to separate at this time,' the married couple of nine-years told the publication. They are parents to three-year-old Charlie.", "authors": ["Kelvera For Dailymail.Com"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/15/22/19760954-0-image-a-113_1571175639848.jpg", "published_at": "2019-10-15"}