{"pub": "bbc", "url": "https://bbc.co.uk/news/world-latin-america-49574900", "downloaded_at": "2019-09-05 02:12:03.895199+00:00", "title": "Hurricane Dorian: Scale of Bahamas devastation emerges", "language": "en", "published_at": "2019-09-04", "text": "Media playback is unsupported on your device Media caption Aerials show scale of destruction in the Bahamas caused by Hurricane Dorian\n\nRescuers have begun to reach areas of the northern Bahamas devastated by Hurricane Dorian, with aerial images showing a trail of destruction.\n\nPM Hubert Minnis said some areas had been \"decimated\" as the death toll rose to at least 20.\n\nThe hurricane made landfall on 1 September and battered the Abaco Islands and Grand Bahama, in the north of the archipelago, for two days.\n\nDorian has moved off north and still threatens the eastern US seaboard.\n\nForecasters have warned it could make landfall on the coast of South or North Carolina on Thursday.\n\nAlthough the hurricane has weakened to a category two storm with maximum sustained winds of 105mph (165km/h), it has grown larger in area.\n\nMedia playback is unsupported on your device Media caption Residents in the Bahamas say 'it's total devastation'\n\nWhat is the damage to the Abacos and Grand Bahama?\n\nMr Minnis said the Bahamas was facing \"one of the greatest national crises in our country's history\".\n\nLate on Wednesday, the country's health minister, Duane Sands, confirmed that the death toll had risen from seven to at least 20.\n\nLia Head-Rigby, who runs a relief group and overflew the Abacos, previously said her representatives had told her there were \"a lot more dead\".\n\n\"It's total devastation. It's decimated. Apocalyptic,\" she told the Associated Press (AP) news agency.\n\nAerial images over the Abacos, including the port town of Marsh Harbour, showed mile upon mile of destruction, with roofs torn off, scattered debris, overturned cars, shipping containers and boats, and high water levels.\n\n\"There's nothing left in most of Marsh Harbour,\" said Alicia Cook, who evacuated from the area. \"People are starting to panic: pillaging, looting... it's just no way everyone's going to get out.\"\n\nBob Cornea also spoke to the BBC in the capital Nassau after being evacuated from Marsh Harbour. He said he and his wife took shelter on the second storey of their son's house.\n\n\"Water was up to my neck. It stayed like that for two or three hours... My son... he got us out and we got over to safety.\n\n\"We've been through all kinds of hurricanes, all kinds of storms: never anything that bad. I mean, it was like we were standing in the middle of the ocean. That's what it looked like. Waves, the water just crashing in over us. Horrifying. Absolutely horrifying.\"\n\nOpposition leader Philip Brave Davis described the scenes from a flight over the islands as a \"horrible sight\".\n\nParts of the Bahamas received up to 35in (89cm) of rain.\n\nInteractive See extent of flooding in Abaco Islands caused by Hurricane Dorian After Dorian Before Dorian\n\nThe situation on Grand Bahama is less clear, as Dorian only moved on late on Tuesday after nearly two days of pummelling, cutting many communication lines.\n\nMost rescue work was being done on an ad hoc basis by locals using boats and jet skis, but it was being hampered by flooded roads, fallen trees and submerged debris.\n\nRescue teams were \"beginning to get on the ground\", National Security Minister Marvin Dames said on Wednesday, according to AP.\n\nMedia playback is unsupported on your device Media caption Watch BBC Weather's forecast amid concerns for Florida, Georgia and Carolinas\n\nMr Minnis said: \"Our priority at this time is search, rescue and recovery. It will take all of us as a caring community - government, church, businesses and individuals - to help restore the lives of our people.\"\n\nPeople have taken to social media to post lists of those they have lost contact with during the storm.\n\nThe International Red Cross fears 45% of homes on Grand Bahama and the Abacos - some 13,000 properties - have been severely damaged or destroyed.\n\nSome 60,000 people will need food aid and clean water, UN officials say.\n\nA map from the Finnish satellite company ICEYE showed the extent of the flooding on Grand Bahama:\n\nWill Dorian hit the US?\n\nAt 18:00 GMT, the National Hurricane Center said Dorian was located about 115 miles (185km) east of Jacksonville in Florida and about 180 miles south of Charleston, South Carolina.\n\nThe storm - moving at 9mph (15km/h) - would travel parallel to the Florida and Georgia coasts through Wednesday night, then \"near or over\" the coasts of the Carolinas through Thursday and Friday, it said.\n\nThe NHC warned there was a danger of life-threatening storm surges for coastal communities north of Port Canaveral in Florida all the way to the North Carolina-Virginia border.\n\nDorian is expected to weaken over the next few days but will remain a powerful hurricane.\n\nMedia playback is unsupported on your device Media caption Hurricane Dorian rips into Bahamas\n\nIs climate change making hurricanes worse?\n\nScientists cannot say whether climate change is increasing the number of hurricanes, but the ones that do happen are likely to be more powerful and more destructive because of our warming climate, says BBC Weather's Tomasz Schafernaker.\n\nHere's why:\n\nAn increase in sea surface temperatures strengthens the wind speeds within storms and also raises the amount of precipitation a hurricane will dump\n\nSea levels are expected to increase by one to four feet over the next century, bringing the potential of far worse damage from sea surges and coastal flooding during storms\n\nMedia playback is unsupported on your device Media caption Hurricanes and climate change\n\nUse our guide to see how these deadly storms form, their devastating effects and how they are measured:\n\nHurricanes A guide to the world's deadliest storms Hurricanes are violent storms that can bring devastation to coastal areas, threatening lives, homes and businesses. Hurricanes develop from thunderstorms, fuelled by warm, moist air as they cross sub-tropical waters.\n\nWarm air rises into the storm. Air swirls in to fill the low pressure in the storm, sucking air in and upwards, reinforcing the low pressure. The storm rotates due to the spin of the earth and energy from the warm ocean increases wind speeds as it builds. When winds reach 119km/h (74mph), it is known as a hurricane - in the Atlantic and Eastern Pacific - or a typhoon in the Western Pacific. \"Everybody has a plan until they get punched in the face. Well, we're about to get punched in the face.\"\n\nFlorida Mayor Bob Buckhorn, ahead of Hurricane Irma (2017) The central eye of calmer weather is surrounded by a wall of rainstorms.\n\nThis eyewall has the fastest winds below it and violent currents of air rising through it. A mound of water piles up below the eye which is unleashed as the storm reaches land.\n\nThese storm surges can cause more damage from flooding than the winds. \"Urgent warning about the rapid rise of water on the SW FL coast with the passage of #Irma's eye. MOVE AWAY FROM THE WATER!\"\n\nTweet from the National Hurricane Center The size of hurricanes is mainly measured by the Saffir-Simpson scale - other scales are used in Asia Pacific and Australia. Winds 119-153km/h\n\nSome minor flooding, little structural damage.\n\nStorm surge +1.2m-1.5m Winds 154-177km/h\n\nRoofs and trees could be damaged.\n\nStorm surge +1.8m-2.4m Winds 178-208km/h\n\nHouses suffer damage, severe flooding\n\nStorm surge +2.7m-3.7m Hurricane Sandy (2012) caused $71bn damage in the Caribbean and New York Winds 209-251km/h\n\nSome roofs destroyed and major structural damage to houses.\n\nStorm surge +4m-5.5m Hurricane Ike (2008) hit Caribbean islands and Louisiana and was blamed for at least 195 deaths Winds 252km/h+\n\nSerious damage to buildings, severe flooding further inland.\n\nStorm surge +5.5m Hurricane Irma (2017) caused devastation in Caribbean islands, leaving thousands homeless \"For everyone thinking they can ride this storm out, I have news for you: that will be one of the biggest mistakes you can make in your life.\"\n\nMayor of New Orleans Ray Nagin ahead of Hurricane Gustav, 2008 Click arrow to proceed Loading ... Swipe to progress Go back to start\n\nHow have you been affected by Hurricane Dorian? Share your experiences by emailing haveyoursay@bbc.co.uk.\n\nPlease include a contact number if you are willing to speak to a BBC journalist. You can also contact us in the following ways:", "description": "Aerial images show a trail of destruction, as the death toll rises to at least 20.", "authors": [], "top_image": "https://ichef.bbci.co.uk/images/ic/1024x576/p07mcyx7.jpg"}