{"pub": "mirror", "url": "https://mirror.co.uk/news/politics/extinction-rebellion-right-shock-everyone-20637712", "downloaded_at": "2019-10-16 23:15:32.868581+00:00", "title": "'Extinction Rebellion are right to shock everyone into change - I should know'", "language": "en", "text": "Get the biggest politics stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nHundreds of Extinction Rebellion protesters defied a ban threatening them with arrest to meet in Trafalgar Square as the group launched a legal bid in the courts.\n\nMore than 500 people descended on the landmark spot despite any assembly of more than two people linked to the XR Autumn Uprising action now being illegal in London.\n\nLawyers for the group lodged a request with the High Court for an urgent judicial review of the decision.\n\nAnd more than 100 high-profile supporters such as Jude Law, Benedict Cumberbatch and Sir Bob Geldof voiced support despite saying they felt complicit in the climate crisis.\n\nTheir letter states: “The industries we are part of have huge carbon footprints... life on earth is dying.”\n\nHere, Labour peer Peter Hain explains why the protesters stand on the shoulders of past giants who did so much to bring change...\n\n(Image: PA)\n\nLondon’s City airport ­blockaded. Westminster jammed up by Extinction Rebellion. Protesters ­gluing themselves to floors, roads and planes.\n\nDespite more than 1,000 arrests in London last week, Tory Lord Forsyth attacked the police for being too soft.\n\n“I ate in a restaurant last night where there was only one occupied table,” he moaned.\n\nHome Office Minister Baroness Williams was especially piqued at having “to step over protesters” to get into her ministerial office. Others fulminated about “a lawless mob” intent on causing chaos.\n\nTo me, it sounded like a scratchy old gramophone record.\n\nOne hundred years ago, exactly the same sort of outrage by male Lords and MPs was levelled at the ­Suffragettes who chained ­themselves to Parliament’s railings and caused ­pandemonium.\n\nWhen Emily Wilding Davison suffered fatal injuries under the King’s horse at the 1913 Derby, racegoers in top hats were furious that their afternoon had been spoiled by her desperate protest for women to have the vote.\n\nFifty years ago, I faced similar condemnation for leading ­demonstrators to invade rugby and cricket pitches and stop all-white South African sports tours at Twickenham, Lords and other grounds across Britain.\n\n“Hain the Pain” was one of the more pleasant charges levelled at me.\n\n“It would be a mercy for humanity if this unpleasant little creep were to be dropped into a sewerage tank. Up to his ankles. Head first,” thundered Sunday Express editor Sir John Junor.\n\nIn August 1972, I landed up in the Old Bailey on a four-week trial for conspiracy to disrupt those racist South African sports tours.\n\nBut the jury refused to convict me – to the evident fury of Judge Bernard Gillis, who wanted me to go to prison.\n\nTwo hundred years ago, the Tolpuddle Martyrs were arrested, tried and deported to Australia for the offence of forming a Friendly Society to provide help when they were poorly.\n\nThe martyrs were denounced as treasonable, lawless traitors, threatening the very future of England’s “green and pleasant land”.\n\n(Image: Birmingham Post and Mail)\n\nWorkers then had no rights. They weren’t allowed to join a trade union or to strike.\n\nIn 1911, at ­Tonypandy in the Rhondda Valley, Winston Churchill sent soldiers in to subdue striking Welsh coal miners.\n\nIn the 19th century Chartists demanding the vote for working-class men were also shot at and beaten up by police and soldiers.\n\nEach of these groups shares an honourable heritage with the Extinction Rebellion ­demonstrators.\n\nA just cause, such as votes for women, votes for working-class men, better wages and conditions for workers, and the fundamental sporting principle that teams should be chosen on merit not on skin colour... All were causes angrily denounced in the newspapers, by politicians and judges. All were also causes won only after struggle and protest, sometimes confrontational and bitter.\n\nThe establishment resisted the right of women to vote, suppressing and imprisoning suffragettes, forcing them into hunger strikes.\n\nBut today the idea of denying women the vote is preposterous. The suffragettes are saluted. Emily Davison has a special commemorative plaque in ­Par­­­l­­iament marking where she hid on census night to give her address as the House of Commons.\n\nCaptaining the Springboks in the current Rugby World Cup is Siya Kolisi – a black man who, when we disrupted the all-white Springboks under Apartheid, would have been banned from representing\n\nhis country.\n\nThe other day I went to join Extinction Rebellion protesters occupying Whitehall outside 10 Downing Street.\n\nThere, I found decent, caring people, straight from Middle Britain – many mothers and fathers, ­grandmothers and grandfathers, singing about saving the planet, their numbers swelled by thousands of ­youngsters.\n\nFar from being a threat to civilisation, they want to save human civilisation by demanding that our ­Government triggers a climate change emergency now.\n\nTheir prophet is Sir David ­Attenborough, who has shocked us all with his TV programmes about plastic gumming up the oceans, melting Arctic icebergs triggering rising sea levels to engulf coastal communities, and the decimation of the Amazon rainforest, the lungs of the earth.\n\nThe world’s 50 biggest oil companies are planning to flood us with an additional seven million oil barrels a day over the next decade – an increase of more than a third and ­equivalent to the percentage decrease in emissions scientists say is necessary to keep global warming at a safe level.\n\nIt has taken Extinction Rebellion protesters and the disruption of London to force us all to confront some bitter home truths.\n\nAnd that’s something else they share in common with suffragettes, early trade unionists and anti-sports apartheid protesters: shocking everyone to change.", "description": "Disruptive climate change protesters have much in common with suffragettes and anti-sports apartheid protesters, writes Labour peer Peter Hain", "authors": ["Peter Hain", "Image", "Amer Ghazzal", "Barcroft Media", "Pa", "Birmingham Post", "Mail"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20637068.ece/ALTERNATES/s1200/0_Extinction-Rebellion-Protest-Vigil-London-Britain.jpg", "published_at": "2019-10-16"}