{"pub": "businessinsider", "url": "https://lifehacker.com.au/2019/09/how-to-watch-the-rugby-world-cup-in-australia", "downloaded_at": "2019-09-21 03:42:18.937844+00:00", "title": "How To Watch The Rugby World Cup In Australia", "language": "en", "text": "Image: Getty\n\nAfter four long years, the Rugby World Cup tournament is back! Back! BACK! Over one-and-a-half gruelling months, the 20 best teams in the world will collide in 48 action-packed matches to determine a single, uncontested champion. Will the mighty All Blacks reign supreme once again? Will Australia claim its first victory of this century? Will host country Japan surprise everyone and take out the cup?\n\nHere's how to watch all the action from the 2019 tournament in Australia - live, online and free.\n\nWhen is the 2019 Rugby World Cup?\n\nThe 2019 Rugby World Cup takes place between 20 September-2 November. In other words, you have around six weeks of world-class rugby to sink your teeth into. As our Kiwi cousins would say, that's choice bro!\n\nWhere is the Rugby World Cup being held?\n\nThis year's Rugby World Cup is being held in Japan. This works out favourably for people watching in Australia - the similar time zone means you don't need to set your alarm at some ungodly hour. Instead, all matches will either take place in the early afternoon or the 'prime time' evening window.\n\nWhen is the 2019 Rugby World Cup final?\n\nThe Rugby World Cup Final is slated to take place on Saturday, 2 November. In Australia, kickoff will commence at 8pm (AEST).\n\nWhat channel is the 2019 Rugby World Cup on?\n\nChannel 10 will be broadcasting select Rugby World Cup matches live on free-to-air TV. You can also catch some games on the 10Play streaming app.\n\nBelow you will find a detailed compariso\n\nHow To Watch The 2019 Rugby World Cup Online\n\nUnfortunately, Channel 10's free 10Play app does not be streaming every Rugby World Cup game live. To see the whole tournament, you're going to have to pay for a dedicated online service.\n\nOne of the best options is Foxtel's Kayo Sports. Kayo Sports will be streaming every game of the Rugby World Cup live. You will also get all the analysis, commentary and review shows that comes with Fox Sports.\n\nKayo is pretty easy to set up on your TV - simply plug in your laptop via HDMI or beam through a Google Chromecast. (If that's too much trouble, you can also watch it on you phone or tablet.)\n\nYou can currently sign up for a free two week Kayo trial. After that, prices start at $25 per month.\n\nOther options\n\nThe subreddit r/rugby is a great community for banter and potentially for updates on the state of play. It's usually pretty quick to the news cycle which is also beneficial. Click here!", "description": "After four long years, the Rugby World Cup tournament is back! Back! BACK! Over one-and-a-half gruelling months, the 20 best teams in the world will collide in 48 action-packed matches to determine a single, uncontested champion. Will the mighty All Blacks reign supreme once again? Will Australia claim its first...", "authors": ["Chris Jager", "Sarah Basford"], "top_image": "https://edge.alluremedia.com.au/m/l/2019/09/Rugby-World-Cup.jpg", "published_at": "2019-09-21"}