{"pub": "cnbc", "url": "https://cnbc.com/2019/10/07/bloomberg-businessweek-wealth-number-ranking-shows-inequality.html", "downloaded_at": "2019-10-07 23:32:23.040855+00:00", "title": "This chart ranks everyone (even you) by their wealth, and it's a snapshot of inequality", "language": "en", "text": "There is massive income inequality in the in the U.S. and in the world, and everyone from political candidates to billionaires are talking about it.\n\nA recent global wealth ranking Bloomberg Businessweek put a fine point on it. The ranking gives everyone in the world a \"wealth number,\" from -2 (the world's poorest) to 11 (the world's wealthiest).\n\nOnly two people get an 11: Jeff Bezos and Bill Gates. Scoring 11 on the Businessweek ranking means you have $100 billion or more.\n\nThere are just 150 people who have a wealth number of 10, a bracket that's entry level net worth is $10 billion (up to just under $100 billion). Elon Musk scores a 10, for example. Individuals with a wealth number 10 can afford to buy a sports team in a major market, the chart says, for context.\n\nCompared to those very small numbers of very rich people, there are 1.3 billion people who have a wealth number of 4, a bracket that's entry level net worth is $10,000 (up to just under $100,000). These individuals are generally, in a \"median American family headed by someone who has no college education,\" the chart says, and can afford a new car, the chart estimates.\n\nAt the other end of the scale, 1.5 billion adults reside in the brackets -2 through 2, meaning they have a net worth of less than $1,000, including people with a negative net worth. This population would generally be subsistence farmers and can afford \"very little,\" the chart says. \"So you're either poor—or a rich person on a bad day, with liabilities exceeding your assets,\" according to Businessweek.\n\nYou can find your own net worth number on the chart.\n\nImage credit: Bloomberg. Data sources: Credit Suisse Global Wealth Report 2018 for worth numbers -2 through 8. Bloomberg Billionaires Index for 9-11. Federal Reserve, Financial Samurai, Bloomberg Reporting, Bloomberg Billionaires Index.\n\nOne caveat: The numbers of people who are grouped in each net worth number are estimates, because the data used, from both the Bloomberg Billionaires Index and the Credit Suisse Global Wealth Report, are not exact, Businessweek says. (For example, Bloomberg data says there are 2,800 billionaires while Credit Suisse says there are 1,600.)\n\n\"The purchasing power figures are likewise intended to be illustrative, not hard data. For example, we say a 4 can afford a new car. The point isn't that new cars cost $10,000 to $99,999 (although that's the right order of magnitude). It's that you probably need to be a 4 to afford a new car,\" Bloomberg Businessweek says in the accompanying story. \"Although, of course, there are 1s, 2s, and 3s who will stretch to buy one.\"\n\nWhat is clear from the chart is how extreme wealth inequality is.\n\nIndeed, in 2018, the world's wealthiest 26 individuals had the same amount of wealth as the poorest half of the population, according to an Oxfam report published in January. That's down from the 43 wealthiest people the year before.\n\nDuring the same period, the wealth of the world's billionaires increased by $900 billion ($2.5 billion per day), while the wealth of the poorest half of the population (3.8 billion people) fell by 11%, the Oxfam report found.\n\nEven some of the billionaires at the top of Businessweek's ranking see a problem with such extreme wealth concentration.\n\nFacebook CEO and founder Mark Zuckerberg — who, with a net worth of $69.8 billion, according to Bloomberg, would be a No. 10 — was asked Thursday about his thoughts on Sen. Bernie Sanders comment that billionaires should not exist. Zuckerberg said, \"I don't know if I have an exact threshold on what amount of money someone should have but at some level no one deserves to have that much money.\"\n\n\"I think if you do something that is good, you get rewarded, but I do think some of the wealth that can be accumulated is unreasonable,\" Zuckerberg said. (Zuckerberg and his wife, priscilla Chan, have pledged to give away 99% of their Facebook shares through their non-profit, the Chan Zuckerberg Initiative.)\n\nBill and Melinda Gates have also said their own wealth is an undo privilege. \"No, it's not fair that we have so much wealth when billions of others have so little,\" said Melinda, in the Bill and Melinda Gates Foundation's 2018 annual letter. \"And it's not fair that our wealth opens doors that are closed to most people.\"\n\nOctogenarian and multi-billionaire Warren Buffett says the economy has overwhelmingly financially rewarded people, like him, who are at the top. Buffett is worth $82.2 billion, and would also be a wealth No. 10 on the chart.\n\n\"The real problem, in my view, is — this has been — the prosperity has been unbelievable for the extremely rich people,\" he said on PBS Newshour in 2017. It \"has been disproportionately rewarding to the people on top.\"\n\nThe Gates and Buffett have pledged to give away more than half of their wealth through The Giving Pledge, a public commitment Buffet and Bill Gates founded and launched in August 2010.\n\nAnd according to billionaire hedge fund guru Ray Dalio, the wealth inequality that exists in the U.S. may have dire consequences. Dalio has a net worth of $16.6 billion according to Bloomberg, and would therefore be a No. 10.\n\nCurrent wealth inequality is unsustainable and capitalism needs to be reformed, Dalio says. \"We're at a juncture. We can do it together, or we will do it in conflict, that there will be a conflict between the rich and the poor,\" Dalio said on CBS' \"60 Minutes\" in July.\n\nSee also:\n\nBillionaire Ray Dalio: U.S. economy must change or there will be 'conflict' between the rich and poor\n\nBillionaire Warren Buffett says 'the real problem' with the US economy is people like him\n\nBill Gates: Taxes on rich should be 'much higher' but capitalism still works — here's why", "description": "This Bloomberg Businessweek ranking ascribes all people in the world a \"wealth number\" from -2 to 11 based on their net worth. The highest ranking includes only two people: Jeff Bezos and Bill Gates. And you can find your own number to see how you stack up.", "authors": ["Catherine Clifford"], "top_image": "https://image.cnbcfm.com/api/v1/image/106165620-1570219411123gettyimages-1171215140.jpeg?v=1570219415", "published_at": "2019-10-07"}