{"pub": "foxbusiness", "url": "https://foxbusiness.com/politics/secret-150-page-china-trade-agreement-is-ready-to-go-expert-claims", "downloaded_at": "2019-09-12 07:11:41.923982+00:00", "title": "Trump delays new tariffs; Expert claims secret China agreement is ready to go", "language": "en", "text": "President Trump announced late Wednesday that he will delay the increased tariffs on China by two weeks next month.\n\nContinue Reading Below\n\nIn a tweet, the president wrote, \"At the request of the Vice Premier of China, Liu He, and due to the fact that the People's Republic of China will be celebrating their 70th Anniversary.....on October 1st, we have agreed, as a gesture of goodwill, to move the increased Tariffs on 250 Billion Dollars worth of goods (25% to 30%), from October 1st to October 15th.\"\n\nJust an hour before the tweets, Hudson Institute's Michael Pillsbury was calling the China trade negotiations \"a significant success\" for President Trump in light of China now exempting import tariffs on 16 U.S. products.\n\nPillsbury said the Chinese have conceded on more than just that, but the president is \"wise not to draw attention to the Chinese concessions.\"\n\nAdvertisement\n\nHe mentioned the president is doing something smart, also, by keeping tight-lipped on other negotiating discussions.\n\n\"He's got a secret, 150-page agreement with the Chinese.\" Michael Pillsbury, American Director of the Center on Chinese Strategy, Hudson Institute\n\nPillsbury said China agreed to \"almost everything\" in the agreement up until May 2 when they reneged on some provisions of the deal.\n\n\"China has not leaked that agreement,\" Pillsbury told FOX Business' Elizabeth MacDonald during \"The Evening Edit.\" \"Neither have we.\"\n\nThat seemed to be in alignment with what White House Trade Adviser Peter Navarro told Neil Cavuto on Fox News' \"Your World\" Wednesday afternoon.\n\n\"I've got two rules when it comes to these negotiations,\" Navarro said. \"The first is the White House has a rule that we negotiate behind closed doors, nothing leaks to the press. The second rule is the Navarro rule which is to say that if you hear anything about these negotiations from unnamed government sources, it's probably fake news, so I've got nothing to say about what's going to happen. I got nothing to speculate on.\"\n\n\"We negotiate behind closed doors.\" Peter Navarro, White House Trade Adviser\n\nPillsbury remains hopeful that if China comes back in October and agrees to the deal, it will be a \"huge breakthrough.\"\n\n\"I'm not sure [China will] do that, but the framework and the draft 150 pages is already there,\" Pillsbury said. \"It's just that our media and China's media have never seen it.\"\n\n\"So they're not aware of what President Trump, I think correctly, called the granddaddy of all deals.\" Michael Pillsbury, American Director of the Center on Chinese Strategy, Hudson Institute\n\nThe White House referred FOX Business to the office of the U.S. Trade Representative for comment about the status of the 150-page agreement, but those requests were not answered at the time of this publishing.\n\nPillsbury claims Huawei CEO Ren Zhengfei told The New York Times he's willing to negotiate with the Department of Justice and cease activities Trump objects to, which Pillsbury called \"a pretty big deal.\"\n\nCLICK TO READ MORE ON FOX BUSINESS\n\n\"Secondly, China has had this experiment in Shanghai for several years called the Free Trade Zone, behaving with an open market the way President Trump wants all of China to do,\" Pillsbury said.\n\n\"China announced just a few days ago they're going to open more of these free trade zones all around China.\" Michael Pillsbury, American Director of the Center on Chinese Strategy, Hudson Institute\n\nPillsbury also noted China has eased their insults of the president as well.", "description": "President Trump reportedly called it the \"granddaddy of all deals.\"", "authors": ["Blair Shiff"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/09/0/0/Trumo-Xi-JinPing-iStock.jpg?ve=1&tl=1", "published_at": "2019-09-11"}