{"pub": "dailymail", "url": "https://dailymail.co.uk/news/article-7544033/Corporate-worker-spent-1000-week-ice-leaving-homeless-selling-drugs-support-habit.html", "downloaded_at": "2019-10-07 00:22:07.515098+00:00", "title": "Corporate worker spent $1000 a week on ice, leaving her homeless and selling drugs to support habit", "language": "en", "text": "A 29-year-old former corporate worker and 'high-functioning addict' has revealed how she spent $1000 a week on ice before becoming homeless.\n\nTahlia Adams said she was using ice for a decade but was able to complete a business degree, work full-time in senior finance roles and maintain a stable relationship.\n\n'Nobody in my daily life would have ever thought that I was using ice. Nobody,' she told the ABC.\n\nMs Adams would take a hit before work, during her lunch break and when she got home in the evening.\n\nTahlia Adams said she was using ice for a decade but was able to complete a business degree, work full-time in senior finance roles and maintain a stable relationship\n\n'People think that an ice user is somebody who's crazy, like the crazy homeless person. Or the people who are stealing cars, or robbing old people,' she said.\n\nWhile Ms Adams was able to function while dependent on ice, she admitted it was impossible to maintain her lifestyle.\n\nEventually she lost her house and her partner while she was 'still hooked on ice'.\n\nOut of options, the 29-year-old started to sell drugs in a bid to support herself and get out of the situation she was in.\n\n'And it just was the worst mistake of my life, because now, my life's changed forever,' she said.\n\nIn 2017, Ms Adams was arrested in Queensland - where police aren't able to move ice addicts to rehabilitation facilities.\n\nMs Adam would take a hit before work, during her lunch break and when she got home in the evening (stock image)\n\nMs Adams ended up serving a jail sentence but believes treatment would have been a better option for her.\n\nShe admits her 'destructive' behaviour during her encounter with police led to further charges.\n\nIt's now been three months since Ms Adams was released from jail and she remains in recovery.\n\nShe said recovery is 'great' but she wishes she made better decisions earlier on as her former addiction affects 'every part' of her life.\n\nMs Adams said she is struggling to get a job or car insurance and her life is 'changed forever' from her mistakes.", "description": "Tahlia Adams said she was using ice for a decade but was able to complete a business degree, work full-time in senior finance roles and maintain a stable relationship.", "authors": ["Zoe Zaczek For Daily Mail Australia"], "top_image": "https://i.dailymail.co.uk/1s/2019/10/06/22/19372344-0-image-a-9_1570398359063.jpg", "published_at": "2019-10-06"}