{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-britain-boe-tenreyro/uk-could-benefit-from-higher-inflation-target-boes-tenreyro-idUKKBN1WN1AU", "downloaded_at": "2019-10-08 12:54:59.162833+00:00", "title": "UK could benefit from higher inflation target - BoE's Tenreyro", "language": "en", "text": "FRANKFURT (Reuters) - Britain could have benefited from a higher inflation target than the 2% level first set in 2003, though any change now would carry costs, Bank of England policymaker Silvana Tenreyro said on Tuesday.\n\nFILE PHOTO: The Bank of England is seen in the financial district during rainy weather in London, Britain, September 23, 2018. Picture taken September 23, 2018.\n\nLong-term market interest rates have fallen globally since the 2008-09 financial crisis and are now close to zero in many advanced economies, giving central banks little scope to cut short-term rates to boost the economy in a future downturn.\n\nInstead, officials have turned to a mix of asset purchases and negative bank deposit rates in a bid to boost demand - policies whose effectiveness and side-effects are disputed in the countries where they have been implemented.\n\nTenreyro, an external member of the BoE’s Monetary Policy Committee, said at a European Central Bank conference that Britain’s inflation target reflected a pre-crisis world of much higher average interest rates.\n\n“Conventional monetary policy is more likely to run up against the (zero lower bound) constraint,” she said\n\n“If we were starting over, a lower equilibrium rate of interest might suggest that a slightly higher inflation target could have been helpful to avoid running against the effective lower bound so often. But there are obviously costs to changing the framework now,” she added when asked how things should change.\n\nBoE officials rarely comment on the appropriateness of the central bank’s 2% inflation target, which is set by the country’s finance minister.\n\nWhen the BoE gained independence to set interest rates in 1997, the then finance minister, Gordon Brown, ordered it to target a 2.5% rate of retail price inflation (RPI).\n\nIn 2003, Brown changed the targeted measure to consumer price inflation, and cut the target inflation rate to 2%, as the CPI rate was typically lower than RPI.\n\nTenreyro also stressed the importance of the BoE’s flexible approach to inflation targeting, which allows it to ignore inflation overshoots that it expects to be temporary, for example those triggered by falls in sterling in 2009 and 2016.", "description": "Britain could have benefited from a higher inflation target than the 2% level first set in 2003, though any change now would carry costs, Bank of England policymaker Silvana Tenreyro said on Tuesday.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20191008&t=2&i=1438430481&w=1200&r=LYNXMPEF970SK", "published_at": "2019-10-08"}