{"pub": "nationalreview", "url": "https://gizmodo.com/scientists-partially-revive-disembodied-pig-brains-rai-1834111182?utm_source=gizmodo_twitter&utm_medium=socialflow&utm_campaign=socialflow_gizmodo_twitter", "downloaded_at": "2019-10-05 05:59:08.350269+00:00", "title": "Scientists Partially Revive Disembodied Pig Brains, Raising Huge Questions", "language": "en", "text": "Image: AP\n\nResearchers from Yale have developed a system capable of restoring some functionality to the brains of decapitated pigs for at least 10 hours after death. The achievement has tremendous scientific potential, but it raises some serious ethical and philosophical concerns.\n\n\n\nDeveloped by neuroscientist Nenad Sestan and his colleagues from Yale University, the system was shown to restore circulation and some cellular functionality to intact pig brains removed from the skull. The brains were hooked up to the system, known as BrainEx, four hours after death was declared and after severe oxygen starvation, or anoxia, had set in. The system pumped synthetic blood and other compounds into the disembodied organ, restoring partial functionality for a period of six hours. This research was published today in Nature.\n\nAdvertisement\n\nImportantly, the brains did not exhibit signs of consciousness or awareness, and the researchers took extra precautions to ensure that didn’t happen. The pig heads were acquired from a nearby food processing plant, so no pigs were deliberately killed for the experiment. The researchers also took extra efforts to consult with and receive approval from multiple ethics bodies, including the Institutional Animal Care and Use Committee at Yale University and the Neuroethics Working Group of the U.S. National Institutes of Health (NIH). What’s more, bioethicist Stephen Latham from the Interdisciplinary Center for Bioethics at Yale contributed to, and is a listed author of, the new study.\n\nThe ability to restore partial functionality to a mammalian brain after death could result in a new model for studying brains and new medical interventions for diseases or conditions in which the brain is starved of oxygen, including strokes. At the same time, however, the new achievement is straining our notion of death and when it should be declared—a development with implications ranging from animal experimentation through to human organ donation.\n\nImage: Stefano G. Daniele & Zvonimir Vrselja; Sestan Laboratory; Yale School of Medicine\n\nIf much of this sounds familiar, you’re probably thinking of an MIT Technology Review report from last year in which certain details of this experiment were leaked to the public. At a press conference held yesterday, Sestan said someone disclosed this information to the MIT publication following a confidential, closed-door consultation with scientists and bioethicists. A claim made in the MIT Technology Review article that a pig brain had been kept “alive” for 36 hours was dismissed by Sestan, who said such an effort would have gone far beyond the scope of the experiment (importantly, Sestain didn’t deny that a pig brain had been hooked up to the system for 36 hours). The new study is now our first opportunity to review the experiment and see what was actually done and why.\n\n\n\nAdvertisement\n\nAs it stands, neuroscientists can only sustain brain cells in the lab for a few weeks. Needless to say, studying clumps of cells in a petri dish is a far cry from being able to study a whole brain. Same goes for thin slices of brain tissue, which make for poor approximations of a functional, cohesive brain. Consequently, scientists have struggled to understand the various processes that happen in the brain after death, such as the capacity of the brain to retain certain functions like circulation, and the rate of cellular death.\n\nThe purpose of the BrainEx experiment was to “better understand how brain cells react to circulatory arrest” and “test whether some cellular functions can be restored in the brain after death,” explained Sestan at yesterday’s press conference. This effort, he said, could put neuroscientists in a better position to understand and potentially treat “stroke and other disorders in the brain that cause cells to die.” Latham chimed in, saying the experiment could conceivably lead to new ways of preserving organs other than the brain, or even “reverse the post-mortem decomposition of those organs,” he said. Finally, the experiment could result in new ways of studying post-mortem brains in the laboratory, claimed the scientists.\n\nAdvertisement\n\nMammalian brains need lots of oxygen. Interrupted periods of oxygen-enriching blood flow, even for short periods, cause neurons to die, resulting in serious brain damage. Anoxia, as this physiological process is called, also sets in after death. The new study was designed to assess the severity of this damage post-mortem, and whether certain brain functionality can be partially restored in the immediate hours after death is declared.\n\nTo test this possibility, Sestan and his team developed a system that provides blood flow to the brain at normal body temperature. The custom-designed device mimicked natural organ systems inside the body, pumping a protective solution designed to promote recovery from prolonged anoxia. This artificial blood supply was delivered to isolated pig brains, preventing some of the decay typically associated with death. The BrainEx system took over six years to develop.\n\nAdvertisement\n\nA total of 32 pig brains were tested during the experiment. Pigs were used because their brains are relatively large and structurally similar to ours. The brains were removed from the skulls and hooked up to the BrainEx device four hours after death (so these brains experienced four hours of anoxia). The brains remained on the system for six hours as the researchers carefully monitored for activity. Remarkably, the six hours of synthetic blood perfusions resulted in a restoration of cellular functionality, along with the prevention of swelling and other factors responsible for cellular damage and death. It even sparked some synaptic activity. In addition to reducing cellular death, BrainEx preserved circulatory function in major arteries and small blood vessels. The experiment could have gone on longer, but the study protocols required the researchers to stop at this stage.\n\nImportantly, no higher level functionality was detected to indicate the presence of consciousness, awareness, or perception. An EEG device did not detect the signals associated with consciousness, namely low-amplitude waves in the alpha range (8-12 Hz) and beta range (13-30 Hz). No evidence emerged to suggest wide scale, full function in the pigs’ brains. To be safe, however, the researchers used neuronal activity blockers to prevent conscious awareness from arising during the experiment. As the researchers admitted during the press conference, however, these neural blockers may have influenced the results, preventing them from detecting the presence of awareness or perception. That said, the scientists were confident the BrainEx system isn’t capable of reviving consciousness.\n\nAdvertisement\n\n“I want to make it clear that consciousness was never detected in the course of research,” said Sestan. “It was never a goal of the research to induce consciousness in the brains.” That said, his team “was prepared to induce anesthesia, lower the temperature of the brains,” and do whatever was required to “cease any activity should it occur,” he said. This is “not a living brain, but a cellularly active brain,” he added, saying scientists still don’t have the knowledge “to restore normal brain function—that was not the goal, nor did we achieve that.”\n\nThis experiment shows that, under the right conditions, a large, disembodied, intact mammalian “brain possesses an underappreciated capacity for restoration of microcirculation and molecular and cellular activity after a prolonged post-mortem interval,” concluded the researchers in the study.\n\nAdvertisement\n\nThe degree to which this system could be used to preserve the brain even further is not clear. Its use, for example, to restore cryopreserved brains or revive individuals in a brain dead, vegetative stage, is completely speculative at this stage. As noted, however, the system could be used to help stroke patients or to treat other forms of brain damage, but such a prospect remains far in the future, if it were to be possible at all. For the next stage of the research, the scientists would like to test the brains for longer durations.\n\n“This study adds to a growing awareness that death is not a precipitous event but a gradual process. Over time this could potentially lead to challenges to the legal concept of brain death as a valid definition of death.”\n\nAdvertisement\n\nBioethicist Kerry Bowman from the University of Toronto, who was not involved in the new work, said this is a highly significant study from an ethical point of view, though he said the current study breached no existing ethical protocols.\n\n“The definition of death in many western nations turns on the concept of an irreversible loss of all brain function. This study challenges that very concept,” Bowman wrote to Gizmodo in an email. “Although there was no EEG activity detected, or evidence of consciousness, this could possibly be reflective of the study design. This study adds to a growing awareness that death is not a precipitous event but a gradual process. Over time this could potentially lead to challenges to the legal concept of brain death as a valid definition of death.”\n\nAdvertisement\n\nExisting animal research ethics protocols may be increasingly inadequate, said Bowman, as nonhuman animals could potentially be kept in an undefined realm between life and death. What’s more, recent neuroscience research with EEG and fMRI suggests that decoding some neural activity of living people is possible to the point of reconstructing images, he said, and that some of this decoding could eventually be done post-mortem.\n\nIn an associated commentary published by Nature, Duke University law and philosophy professor Nita Farahany and her two co-authors said the new research upends two major assumptions about death and its immediate effects on the brain:\n\nFirst, that neural activity and consciousness are irretrievably lost within seconds to minutes of interrupting blood flow in mammalian brains. Second, that, unless circulation is quickly restored, there is a largely irreversible progression towards cell death and the death of the organism...Even with all the unknowns, the discovery that mammalian brains can be made to seem ‘slightly alive’, hours after the animals had been killed, has implications that ethicists, regulators and society more broadly must now think through....In our view, new guidelines are needed for studies involving the preservation or restoration of whole brains, because animals used for such research could end up in a grey area—not alive, but not completely dead.\n\nAdvertisement\n\nFarahany and her co-authors made several proposals, including the use of techniques other than EEG to detect signs of conscious awareness, the creation of an agreed-upon list of species deemed appropriate or inappropriate for this type of research, the continued use of neuronal activity blockers and anesthetics during these experiments until more is known, and the determination of an appropriate length of time a brain should be allowed to run on the BrainEx system.\n\nIn a second comment piece published by Nature, bioethicists Stuart Youngner and Insoo Hyun from Case Western Reserve University School of Medicine said the new study is challenging the long-held assumption that big brains are hopelessly damaged in the few minutes following death.\n\nAdvertisement\n\n“It also raises the possibility that researchers could get better at salvaging a person’s brain even after the heart and lungs have stopped working,” wrote Youngner and Hyun. “Advances following on from the BrainEx study could exacerbate tensions between efforts to save the lives of individuals and attempts to obtain organs to donate to others,” adding that, “In our view, as the science of brain resuscitation progresses, some efforts to save or restore people’s brains might seem increasingly reasonable—and some decisions to forego such attempts in favour of procuring organs for transplantation might seem less so.”\n\nClearly, this pig brain study is provoking some serious questions, particularly those involving our conceptions of death. During the press conference, the BrainEx scientists were quick to downplay the broader philosophical implications of their research, saying the system isn’t remotely close to being capable of fully restoring brain function. That may very well be the case, but this research is laying the groundwork for more substantive breakthroughs in this area. It’s therefore critical that we discuss these important issues now as we get increasingly better at keeping brains alive.\n\nAdvertisement\n\n[Nature]", "description": "Researchers from Yale have developed a system capable of restoring some functionality to the brains of decapitated pigs for at least 10 hours after death. The achievement has tremendous scientific potential, but it raises some serious ethical and philosophical concerns.", "authors": ["George Dvorsky", "About The Author", "George Is A Senior Staff Reporter At Gizmodo."], "top_image": "https://i.kinja-img.com/gawker-media/image/upload/s--0R7eKHvF--/c_fill,fl_progressive,g_center,h_900,q_80,w_1600/jocs07wstagqeydpuugs.jpg", "published_at": "2019-04-17"}