{"pub": "reuters", "url": "https://uk.reuters.com/article/uk-brazil-oil-spill/mysterious-oil-spill-contaminates-beaches-across-swathe-of-brazilian-coast-idUKKBN1WD028", "downloaded_at": "2019-09-28 02:05:34.216362+00:00", "title": "Mysterious oil spill contaminates beaches across swathe of Brazilian coast", "language": "en", "text": "An oil spill is seen on Praia do Paiva beach in Cabo de Santo Agostinho, Pernambuco state, Brazil September 27, 2019. REUTERS/Diego Nigro\n\nSAO PAULO (Reuters) - An oil spill has contaminated beaches and coastline across eight Brazilian states, the country’s environment agency said on Friday, although authorities are still stumped as to its origin.\n\nEnvironmental agency Ibama said that beaches along a 3,000-kilometer (1,860-mile) coastline of Brazil’s Northeast region had been hit by the spill. It said some oil-coated birds and sea turtles had been washed up and were being treated.\n\nThe area is a popular tourism destination for locals and foreigners, with a large number of Spanish and Portuguese visitors frequenting resorts spread along the coast.\n\nAlthough there is extensive oil exploration activity offshore Brazil, authorities have ruled out that as the source of the spill.\n\nState-controlled oil company Petróleo Brasileiro SA said it had performed laboratory analysis of the oil and determined, by observing its molecules, that “the organic compounds of the material found are not compatible with that of the oils produced and marketed by the company.”\n\nThe next nearest oil exploration areas are Venezuela and the Gulf of Mexico, but there has been no reported issues from those regions.\n\nIbama said it was also checking if there had been problems with tankers in the surrounding area.", "description": "An oil spill has contaminated beaches and coastline across eight Brazilian states, the country's environment agency said on Friday, although authorities are still stumped as to its origin.", "authors": ["Marcelo Teixeira", "Min Read"], "top_image": "https://s3.reutersmedia.net/resources/r/?m=02&d=20190928&t=2&i=1434730963&w=1200&r=LYNXMPEF8R037", "published_at": "2019-09-28"}