{"pub": "mirror", "url": "https://mirror.co.uk/sport/formula-1/sebastian-vettel-pole-japanese-grand-20569123", "downloaded_at": "2019-10-13 03:49:51.333085+00:00", "title": "Sebastian Vettel on pole for Japanese Grand Prix after qualifying delayed by Typhoon Hagibis", "language": "en", "text": "The video will start in 8 Cancel\n\nClick to play Tap to play\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nSebastian Vettel put his Ferrari on pole position for the Japanese Grand Prix after qualifying was held back until Sunday because of Typhoon Hagibis.\n\nThe four-time world champion saw off team-mate Charles Leclerc by 0.189 seconds on a sunny, but windy day at Suzuka.\n\nChampionship leader Lewis Hamilton will start back in fourth, with his Mercedes team-mate Valtteri Bottas third on the grid.\n\nRobert Kubica crashed out of qualifying, with Kevin Magnussen also crashing in the same spot.\n\nKubica lost control of his Williams through the final corner and smashed into the barrier.\n\n(Image: REUTERS)\n\nThe Pole walked away unscathed from the incident. The session was immediately red-flagged to retrieve Kubica's car and clear debris from the track.\n\nMoments after the session resumed following Kubica's accident, Magnussen crashed at the same bend.\n\nMagnussen sustained damage to his Haas, but, unlike Kubica, was able to make it back to the pits.\n\nThe red flags were issued for a second time, leading to a further delay.\n\n(Image: XPB Images/Press Association Images)\n\nJapanese Grand Prix Final Positions after Qualifying: 1 Sebastian Vettel (Ger) Ferrari 1min 27.064secs, 2 Charles Leclerc (Mon) Ferrari 1:27.253, 3 Valtteri Bottas (Fin) Mercedes GP 1:27.293, 4 Lewis Hamilton (Gbr) Mercedes GP 1:27.302, 5 Max Verstappen (Ned) Red Bull 1:27.851, 6 Alexander Albon (Tha) Red Bull 1:27.851, 7 Carlos Sainz (Spa) McLaren 1:28.304, 8 Lando Norris (Gbr) McLaren 1:28.464, 9 Pierre Gasly (Fra) Scuderia Toro Rosso 1:28.836, 10 Romain Grosjean (Fra) Haas F1 1:29.341, 11 Antonio Giovinazzi (Ita) Alfa Romeo Racing 1:29.254, 12 Lance Stroll (Can) Racing Point 1:29.345, 13 Kimi Raikkonen (Fin) Alfa Romeo Racing 1:29.358, 14 Daniil Kvyat (Rus) Scuderia Toro Rosso 1:29.563, 15 Nico Hulkenberg (Ger) Renault 1:30.112, 16 Daniel Ricciardo (Aus) Renault 1:29.822, 17 Sergio Perez (Mex) Racing Point 1:30.344, 18 George Russell (Gbr) Williams 1:30.364, 19 Kevin Magnussen (Den) Haas F1 No Time Set, 20 Robert Kubica (Pol) Williams No Time Set", "description": "Lewis Hamilton back in fourth, as Robert Kubica and Kevin Magnussen both crashed at same bend in Suzuka", "authors": ["Gareth Bicknell", "Image", "Reuters", "Xpb Images Press Association Images"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20569115.ece/ALTERNATES/s1200/0_Formula-One-F1-Japanese-Grand-Prix.jpg", "published_at": "2019-10-13"}