{"pub": "axios", "url": "https://axios.com/trump-china-investigate-joe-biden-f7d034bf-91ea-4ede-a879-6b86c36e719a.html", "downloaded_at": "2019-10-06 12:22:52.581968+00:00", "title": "Trump says China should investigate Bidens", "language": "en", "text": "REPORTER: What exactly did you hope Zelensky would do about the Bidens after your phone call?\n\nTRUMP: Well I would think if they were honest about it, they'd start a major investigation into the Bidens. It's a very simple answer. They should investigate the Bidens. Because how does a company newly formed and all these companies — by the way, likewise, China should start an investigation into the Bidens. Because what happened in China is just about as bad as what happened with Ukraine. So I would say that President Zelensky, if it were me, I would recommend that they start an investigation into the Bidens. Because nobody has any doubt that they weren't crooked. That was a crooked deal 100%.\n\nWhy it matters: It's another instance of the president publicly calling for a foreign power to investigate one of his top political rivals. Trump is currently in the throes of an impeachment inquiry for doing exactly that with Ukrainian President Volodymyr Zelensky — something he admitted to but continues to argue is perfectly appropriate.\n\nAt a press conference on Wednesday, Trump refused to answer a question from a reporter about what exactly he was asking Zelensky to do about the Bidens. On Thursday, Trump told reporters: ”If they were honest, they would start a major investigation.\"\n\nContext: Hunter Biden's business dealings in Ukraine have gotten plenty of press attention, but Trump and Rudy Giuliani have also promoted allegations that the former vice president's son made \"millions\" in China by leveraging his father's name.\n\nIn December 2013, Hunter Biden and one of his daughters accompanied Joe Biden to China on a diplomatic trip, according to the Washington Post Fact Checker. During the trip, Hunter helped organize a handshake between his father and business partner Jonathan Li, who was the CEO of a Chinese investment firm.\n\n12 days later, Hunter Biden joined the board of a private-equity fund created by Li and another of Biden's business partners called BHR. A lawyer for Hunter Biden tells the Post that the board \"did not directly invest, but instead advised those who did.\"\n\nThe lawyer told the Post: \"To date, Mr. Biden has not received any return or compensation on account of this investment or his position on the board of directors. The characterization of Mr. Biden as owning a $1.5 billion private equity firm funded by the Chinese, or suggesting that Mr. Biden has earned millions of dollars from the firm is a gross misrepresentation of Mr. Biden's role with BHR.\"\n\nGo deeper ... Fact check: What Joe and Hunter Biden actually did in Ukraine", "description": "It's another instance of Trump publicly calling for a foreign power to investigate one of his political rivals.", "authors": [], "top_image": "https://images.axios.com/Ivshmri84gOaz4lPH9I2gueoxrk=/0x0:1920x1080/1920x1080/2019/10/03/1570113698619.jpg", "published_at": "2019-10-03"}