{"pub": "thehill", "url": "https://thehill.com/homenews/campaign/464903-small-dollar-donors-reshape-democratic-race", "downloaded_at": "2019-10-09 00:49:14.136505+00:00", "title": "Small-dollar donors reshape Democratic race", "language": "en", "text": "Sens. Bernie Sanders Bernie SandersLobbyists pan Sanders proposal to end corporate donations for party conventions Klobuchar pulls in nearly million in third quarter, campaign says Democratic candidates' polling and fundraising numbers don't quite match up MORE (I-Vt.) and Elizabeth Warren Elizabeth Ann Warren40 state attorneys general to take part in Facebook antitrust probe: report Overnight Health Care — Presented by Coalition Against Surprise Medical Billing — Buttigieg unveils aggressive plan to lower drug prices | Supreme Court abortion case poses major test for Trump picks | Trump takes heat from right over vaping crackdown On The Money: Judge tosses Trump lawsuit over NY tax return subpoena | US, Japan sign trade deals | Trump faces narrowing window for trade deals | NBA sparks anger with apology to China MORE (D-Mass.) have reshaped the traditional model for financing presidential campaigns, using vast networks of small donors to propel themselves to the top ranks of Democratic fundraisers.\n\nThat reality became clear in recent days after the two leading progressive candidates announced third-quarter fundraising hauls that trounced those of their top rivals.\n\nADVERTISEMENT\n\nThey have eschewed the high-dollar fundraising circuit since early on in their campaigns, a bet once considered risky given the outsize influence wealthy donors and bundlers have long held in presidential politics, but one that appears to have paid off.\n\nSanders’s campaign announced last week that it had raised $25.3 million in the past three months, the highest quarterly total reported of any Democratic presidential hopeful to date. Warren’s campaign trails him only narrowly, with a $24.6 million quarterly haul.\n\nThe staggering fundraising figures reflect the sway that progressives hold in the Democratic primary contest and their determination to nominate one of their own after President Trump Donald John TrumpTrump campaign slams Minneapolis mayor, Target Center for 'attempting to extort' them with rally security fees Susan Rice calls Trump decision to pull troops from Syria 'batshit crazy' Ex-Trump officials met with Zelensky campaign aides at Trump hotel earlier this year: report MORE’s victory over a more moderate Democrat, Hillary Clinton Hillary Diane Rodham ClintonPoll: Trump gains among independents against Biden, Warren Hillary Clinton calls Trump's Syria pullout a 'sickening betrayal' of allies Where are questions of economic and political inequality in the Democratic debates? MORE, in 2016.\n\n“We lost in 2016 partly because the Democratic establishment and Democratic establishment money nominated a losing candidate,” said Jonathan Tasini, a national surrogate for Sanders’s 2016 presidential campaign.\n\n“Now, jump forward several years, all those voters understand you can’t nominate the same kind of candidate. But to have an alternative, you have to put your money where your mouth is.”\n\nWhether small-dollar contributions are enough on their own to fund a campaign capable of going head to head with Trump’s cash-flush operation in 2020 remains an open question. The president, together with the Republican National Committee, raised $125 million in the past three months alone.\n\nIn a nod to that reality, Warren has already signaled that she may not stick to her ban on high-dollar fundraisers if she wins the Democratic nomination, asserting in an interview on MSNBC earlier this year that Democrats should not pursue a policy of “unilateral disarmament” when it comes to raising money for the general election.\n\n“We gotta go into these fights and we gotta be willing to win these fights,” she said at the time.\n\nSanders, on the other hand, appears poised to stick to his grassroots fundraising pledge. Faiz Shakir, his campaign manager, said last week that Sanders was “the only candidate 100 percent funded by grassroots donations – both in the primary and in the general.”\n\nBut Rufus Gifford, the finance director for former President Obama’s 2012 reelection campaign, said that the eventual nominee will likely have to turn to big-ticket events and joint fundraisers with the Democratic National Committee (DNC) if they hope to compete in the general election.\n\n“Whoever is the presumptive nominee, at that point, will start raising money with the DNC, which means that the ticket prices for events get much higher and the audience that you’re going to get much larger,” Gifford said. “I don’t see how you close the door to high-dollar fundraising in the general.”\n\nFor now, Sanders’s and Warren’s third-quarter hauls more than a year out from Election Day are, for the most part, on par with those of past Democratic presidential hopefuls.\n\nDuring the same period in 2007, then-Sen. Barack Obama Barack Hussein ObamaTrump's former ISIS envoy slams Syria decision: 'Donald Trump is not a Commander-in-Chief' Where are questions of economic and political inequality in the Democratic debates? Rep. Joe Kennedy has history on his side in Senate bid MORE (D-Ill.), raised $20.6 million. And in the third quarter of 2015, as Clinton pursued the Democratic nomination, she reported raising $29.4 million, federal campaign finance filings show.\n\nObama, in particular, touted strong support from small-dollar donors. But what sets Warren and Sanders apart is their avoidance of big-ticket fundraisers altogether.\n\nOne benefit to leaning on small donors is that they can continue to give month after month, unlike those who contribute the maximum amount of $2,800 per election at once, leaving candidates with a steadier stream of cash flowing into their campaigns. Sanders’s campaign boasted last week that 99.9 percent of its donors have not yet hit the contribution limit and can donate again.\n\n“We’re talking about $10 or $20 donations. We’re not talking about maxing out,” said Charles Chamberlain, chairman of the progressive political action committee Democracy for America. “It’s something that people do repeatedly throughout the year, many, many, many times.”\n\nADVERTISEMENT\n\nThe small-dollar strategy stands in contrast with that of former Vice President Joe Biden Joe BidenA dozen House Democrats call on EU ambassador to resign amid Ukraine scandal Ex-Trump officials met with Zelensky campaign aides at Trump hotel earlier this year: report Overnight Health Care — Presented by Coalition Against Surprise Medical Billing — Buttigieg unveils aggressive plan to lower drug prices | Supreme Court abortion case poses major test for Trump picks | Trump takes heat from right over vaping crackdown MORE and other top-tier candidates, who have been less reluctant to attend high-dollar fundraisers. In the third quarter alone, Biden held more than 40 fundraisers and donor events.\n\nAnd while his campaign has touted strong grassroots support, Biden’s average donation size was $44, his campaign said, notably higher than that of Sanders and Warren. He ultimately finished the quarter with a $15.2 million fundraising total, down from about $22 million in the second quarter of the year.\n\nTwo other top-tier fundraisers who have courted traditional donors, Sen. Kamala Harris Kamala Devi HarrisDemocratic candidates' polling and fundraising numbers don't quite match up 2020 Democrats hit Trump's planned Syria withdrawal Harris pitches six months of paid family, medical leave MORE (D-Calif.) and South Bend, Ind., Mayor Pete Buttigieg Peter (Pete) Paul ButtigiegOvernight Health Care — Presented by Coalition Against Surprise Medical Billing — Buttigieg unveils aggressive plan to lower drug prices | Supreme Court abortion case poses major test for Trump picks | Trump takes heat from right over vaping crackdown Democratic candidates' polling and fundraising numbers don't quite match up Democratic strategist on Harris slump: 'She's coming across as a typical politician' MORE, also reported raising less than in the second quarter. Harris pulled in $11.6 million over the past three months, down from $11.8 million in the second quarter, while Buttigieg raised $19.1 million, after topping the field with $24.8 million in the previous quarter.\n\nBiden’s allies downplayed concerns about his fundraising numbers, arguing that he had been off the campaign trail for years before launching his presidential bid and has not had the time to build out a network of small donors to the same degree as Warren or Sanders.\n\n“The bottom line is, Biden has not developed to the extent that Bernie Sanders has a network of online contributors who are willing to send him $10 a month,” said Dick Harpootlian, a prominent Biden supporter and donor in South Carolina. “He’s only been doing it for six months. Bernie’s been doing it for years.”\n\nWhat’s more, Harpootlian said, many traditional donors who have sat on the sidelines while the primary plays out are poised to weigh in soon, especially as Biden faces increasingly aggressive attacks from Trump, who is now facing an impeachment inquiry for his efforts to pressure foreign governments to investigate Biden and his family.\n\n“More people who haven’t weighed in are weighing in now, because of Trump focusing so heavily on Biden,” Harpootlian said. “We’re going to have a hell of a quarter this next quarter.”", "description": "Sens. Bernie Sanders (I-Vt.) and Elizabeth Warren (D-Mass.) have reshaped the traditional model for financing presidential campaigns, using vast networks of small donors to propel themselves to the top ranks of Democratic fundraisers.", "authors": [], "top_image": "https://thehill.com/sites/default/files/sandersbernie_warrenelizabeth_083019getty.jpg", "published_at": "2019-10-08"}