{"pub": "independent", "url": "https://independent.co.uk/arts-entertainment/films/news/mickey-rourke-robert-de-niro-irishman-angel-heart-netflix-a9110091.html", "downloaded_at": "2019-09-18 12:50:12.348554+00:00", "title": "Mickey Rourke’s feud with Robert De Niro ‘stopped him from getting role in The Irishman’", "language": "en", "text": "Mickey Rourke has clamed that Robert De Niro stopped him from getting a role in new Scorsese film The Irishman.\n\nThe actor said they first fell out on the set of Alan Parker’s 1987 thriller Angel Heart, and have been feuding ever since.\n\n“Marty Scorsese wanted to meet me for a movie with Al Pacino, Joe Pesci and Robert De Niro,” Rourke told Italian TV show Live – Non è la D’Urso, referencing the new Netflix gangster film. “The casting person told my manager that Robert De Niro said he refused to work with me in a movie.”\n\nWe’ll tell you what’s true. You can form your own view. From 15p €0.18 $0.18 USD 0.27 a day, more exclusives, analysis and extras.\n\nRourke added that he’s “upset” because he “needed the money”.\n\nAccording to the Wrestler star, he “looked up” to De Niro like Marlon Brando and Al Pacino back in the 1980s, but changed his view after De Niro allegedly told him on the Angel Heart set: “I think it’s better if we don’t talk.”\n\nShape Created with Sketch. The 37 best actors who have never won an Oscar Show all 37 left Created with Sketch. right Created with Sketch. Shape Created with Sketch. The 37 best actors who have never won an Oscar 1/37 Jake Gyllenhaal Jake Gyllenhaal has been nominated for one Oscar – for Brokeback Mountain. And while his performance in that film was certainly worthy of the accolade, you could argue the actor deserved nominations just as much for Nightcrawler, Nocturnal Naimals, Stronger, Prisoners, Enemy, and Donnie Darko. Getty 2/37 Pam Grier Pam Grier was not only robbed of an Oscar for Quentin Tarantino’s classic thriller Jackie Brown, she was robbed of a nomination full stop. Conversely, her co-star Robert Forster picked up a Supporting Actor nomination. Certainly, an oversight from the Academy. Miramax Films 3/37 Jim Carrey Jim Carrey has been nominated for more Grammy Awards than Oscars, having picked up a nomination for \"Best Spoken Word Album for Children\" in 2006 for A Series of Unfortunate Events. The academy, sadly, has never given Carrey a fair chance, despite winning over the world in the likes of Eternal Sunshine of the Spotless Mind, Man on the Moon and The Truman Show. Getty Images 4/37 Jessica Chastain Chastain has the aura of an Oscar winner. Somewhere down the line, surely one her roles won her an Oscar? Yet, despite nominations for The Help and Zero Dark, plus stand-out leading roles in films such as Molly’s Game, the actor still does not have a statuette. Getty Images 5/37 James Dean Of James Dean’s three credited film roles, two were nominated for Oscars – Giant and East of Eden (Rebel Without a Cause was not nominated). Only one of his films, Eden, was released before his tragic passing in 1955. Magnum Photos 6/37 John Goodman The Academy members should hang their heads in shame for never nominating John Goodman, one of the finest ever character actors, for an award. Considering his brilliant performances in Raising Arizona (1987), Barton Fink (1991), The Big Lebowski (1998), O Brother, Where Art Thou? (2000), and Inside Llewyn Davis (2013) – and those are just his collaborations with the Coen Brothers – he must be wondering what he has to do to be acknowledged by the Academy. Getty Images 7/37 Salma Hayek Salma Hayek’s career highlight, Frida, came within inches of bringing her an Oscar. Yet, it was not to be – the actor was beaten by Nicole Kidman in The Hours, and Hayak has since been ignored by the Academy. Getty Images 8/37 Michelle Pfeiffer Michelle Pfeiffer was one of the most popular actors working in the 1980s and 1990s, nabbing Oscar nominations for Dangerous Liaisons (1988), The Fabulous Baker Boys (1989) and Love Field (1992). However, as the ceremonies came and went, no victory followed. Getty 9/37 Rosario Dawson That Rosario Dawson has become more associated with Superheroes than awards is a tragedy. Her roles in Rent, 25th Hour and Sin City have won her praise from critics and fans alike, but there’s still not an Oscar or Golden Globe mention on her IMDB page. Getty Images 10/37 Angela Lansbury You'd think that Angela Lansbury, having won five Tony Awards and six Golden Globes, would have at least one Oscar at home. Not so. Despite her three nominations – for Gaslight (1944), The Picture of Dorian Gray (1945) and The Manchurian Candidate (1962) – the Dame is yet to triumph at the Academy Awards. Getty Images 11/37 Oscar Isaac Oscar Isaac, his many fans argue, was robbed of an Oscar nomination for Inside Llewyn Davis. The critically acclaimed Coen brothers film failed to make the Best Picture cut, and poor Isaac, who played the eponymous struggling folk singer to perfection, was left without a nod. He was also overlooked for Ex Machina and A Most Violent Year. Getty Images 12/37 Robin Wright The Princess Bride, Forrest Gump, Moneyball: Robin Wright has consistently left critics and audiences impressed. And while no Oscars have followed, her work on the TV series House of Card has earned her seven primetime Emmy award nominations. AFP/Getty Images 13/37 Bradley Cooper Bradley Cooper’s directorial debut, A Star is Born, had won acclaim across the board and looked set for Oscars glory (with a Best Actor award almost within grasp). However, Rami Malek stole victory away from him at the last moment. Perhaps the best run of his career came between 2013 and 2015, when he was nominated for three consecutive acting Oscars: Silver Linings Playbook, American Hustle and American Sniper. Rex Features 14/37 Joaquin Phoenix You would be forgiven for presuming Joaquin Phoenix has an Oscar statuette somewhere at home. Yet the star of The Master, Walk the Line and Gladiator – all for which he was nominated – has no such award lying around. Instead, Phoenix will have to make do with a Golden Globe, a Grammy (for his work on the Walk the Line soundtrack) and a People’s Choice Award. Getty 15/37 Angela Bassett Angela Bassett has had one of the most prolific careers in Hollywood history, starring in dozens of TV shows and films. Her roles in What's Love Got to Do with It (1993), Malcolm X (1992) and Music of the Heart (1999) won awards elsewhere – but not with the Academy. Neilson Barnard/Getty Images 16/37 Sigourney Weaver Sigourney Weaver on the set of the original Alien film in 1979 Corbis 17/37 David Oyelowo Despite playing multiple roles that seem like certain Oscar winners, David Oyelowo has never even been nominated for an award. His role as Martin Luther King Jr in 2014’s Selma has gone down as one of the biggest snubs in recent history and was one of many incidents that led to the #OscarsSoWhite movement. Getty 18/37 Marilyn Monroe One of the most iconic actors of all time, Marilyn Monroe never received an Oscar nomination. Gentlemen Prefer Blondes (1953), How to Marry a Millionaire (1953) and Some Like It Hot (1959) may have gone down as classics, but Monroe never stood out enough for the Academy. Rex 19/37 Steve Buscemi The Big Lebowski, Fargo, Reservoir Dogs, Miller's Crossing, Con Air, Armageddon, Big Fish, The Death of Stalin and Barton Fink... just several films Steve Buscemi was not nominated for an Oscar for. In fact, Buscemi has never been nominated for an Academy Award. Getty Images 20/37 Woody Harrelson Three Oscar nominations for Woody Harrelson, and three loses for Woody Harrelson – Larry Flynt in The People vs Larry Flynt (1996), The Messenger (2009) and Three Billboards Outside Ebbing, Missouri (2017). But, like that widely shared Zombieland GIF, Harrelson will be wiping away the tears with a wedge of dollar bills, his films having made more than $3 billion at the box office worldwide. Frederick M Brown/Getty Images 21/37 Mia Farrow Mia Farrow may have starred in the classics Rosemary’s Baby, Broadway Danny Rose and The Purple Rose of Cairo, but not a single nomination followed. Surprising for someone who has won three Baftas and a Golden Globe. Getty 22/37 Idris Elba While many people suspected Idris Elba would score an Oscar nomination for Beasts of No Nation, the Academy’s hatred for Netflix proved too strong (Bafta and the Globes nominated him instead). Even other prime Oscar-bait – Molly’s Game, Mandela: Long Walk to Freedom, Second Coming – failed to land Elba any nominations. No wonder, perhaps, that the actor has stuck primarily to multi-million-dollar blockbusters. Getty Images 23/37 Edward Norton Having had acclaimed roles in American History X, Fight Club and Birdman, Edward Norton will no doubt go down as one of America’s most talented actors. Unfortunately, the actor has no Oscars to show it. AFP/Getty Images 24/37 Scarlett Johansson By starring in both Lost in Translation and Girl with a Pearl Earring, Scarlett Johansson shot herself slightly in the foot in 2003. For the two roles, she landed double Leading Actress nominations at Bafta (winning for Translation) and two Globes nominations. The Oscars? Not one. And despite standout roles in Lucy, Under the Skin, Match Pint, A Love Song for Bobby Long, she still has never been nominated for an Oscar. Getty 25/37 Samuel L Jackson Samuel L Jackson is one of the most prolific actors working in Hollywood and has one Oscar nomination – for Pulp Fiction (1995). Considering he’s ranked as the highest all-time box office star, having made over $12 billion worldwide, the Avengers actor’s probably not all that upset. GettySamuel L Jackson poses at a portrait session during day three of the 13th annual Dubai International Film Festival 26/37 Michelle Williams With four Oscar nominations under her belt, Michelle Williams somehow still has no statuette placed on her mantelpiece. Her closest call came in 2016, when she starred in Manchester By the Sea, when she was up against the supreme Viola Davis, who went on to win the award for Fences. Getty Images 27/37 Annette Bening Few actors can attest to being as hardworking as Annette Bening. Revered for her work onstage, she also won acclaim for Oscar-nominated on-screen roles in The Grifters (1990), American Beauty (1999) and The Kids Are Alright (2010). That she was completely overlooked for 20th Century Women in 2017 was a glaring oversight. Getty Images 28/37 Kirk Douglas Kirk Douglas was a leading man in Hollywood’s Golden Age, his roles in Spartacus, Lust for Life and Champion inspiring a generation of actors after him. Still, the actor never won a competitive Oscar – only an honorary one in 1996, for his 50 years in the creative industry. 29/37 Irene Dunne Irene Dunne – nominated five times – is one of the few recipients of the Kennedy Centre Honours for her service to the performing arts. Yet her performances in Cimarron (1931), Theodora Goes Wild (1936), The Awful Truth (1937), Love Affair (1939) and I Remember Mama (1948) all went unrewarded by the Academy. Getty Images 30/37 Arthur Kennedy One of the world’s most accomplished character actors, Arthur Kennedy was best known for his supporting roles in films such as Champion (1949), Trial (1955), Peyton Place (1957) and Some Came Running (1958), all of which won him Oscar nods. And despite a leading actor nomination in 1951 for Lights Out, Kennedy still couldn’t manage a win. United Artists 31/37 Albert Finney One of Britain’s premiere Shakespearean actors, Albert Finney was nominated five times across almost four decades, for Tom Jones (1963), Murder on the Orient Express (1974), The Dresser (1983), Under the Volcano (1984) and Erin Brockovich (2000). Rex 32/37 Deborah Kerr Six-time nominee Dame Deborah Kerr famously failed to win for the musical The King and I – losing to Ingrid Bergman in Anastasia. Thankfully, the Academy realised their error years later, awarding Kerr an honorary award and calling her “a dedicated actress whose motion picture career has always stood for perfection, discipline and elegance\". Getty Images 33/37 Thelma Ritter Another actor with six nominations and no wins. Even a role in 1950s All About Eve, which would win Best Picture, couldn’t push Thelma Ritter to victory. She went on to be nominated four more times that decade, for The Mating Season (1951, With a Song in My Heart (1952), Pickup on South Street (1953), and Pillow Talk (1959). 20th Century Fox 34/37 Glenn Close Another much-nominated actor without a win, Glenn's most recent Close shave came at the 2019 Oscars, when she was nominated for The Wife. She has previously been nominated six time, including roles in The World According to Garp (1982). Fatal Attraction (1987), and Dangerous Liaisons (1988) . Dave M. Benett 35/37 Amy Adams Amy Adams comes just behind Close, with six nominations (including The Fighter, The Master and American Hustle). None of those were for Arrival, the sci-fi film that saw Adams pick up Bafta, Golden Globe and Screen Actors Guild nominations. Unfortunately, that same year, she was competing against herself in Nocturnal Animals, which likely split the Oscars vote. AFP/Getty Images 36/37 Richard Burton Richard Burton holds the record for second-most Oscar nominations without a win (seven to Peter O’Toole’s eight). While Burton’s performance in Who's Afraid of Virginia Woolf? is often heralded as his best, the actor lost out to Paul Scofield in A Man for All Seasons. Getty Images 37/37 Peter O'Toole Peter O'Toole is the Oscar’s most-nominated actor without a win, with eight nods in total. Although the actor did not take home a trophy for Lawrence of Arabia, The Lion in Winter and Goodbye, Mr Chips, O'Toole was awarded an honorary Oscar in 2002. Getty 1/37 Jake Gyllenhaal Jake Gyllenhaal has been nominated for one Oscar – for Brokeback Mountain. And while his performance in that film was certainly worthy of the accolade, you could argue the actor deserved nominations just as much for Nightcrawler, Nocturnal Naimals, Stronger, Prisoners, Enemy, and Donnie Darko. Getty 2/37 Pam Grier Pam Grier was not only robbed of an Oscar for Quentin Tarantino’s classic thriller Jackie Brown, she was robbed of a nomination full stop. Conversely, her co-star Robert Forster picked up a Supporting Actor nomination. Certainly, an oversight from the Academy. Miramax Films 3/37 Jim Carrey Jim Carrey has been nominated for more Grammy Awards than Oscars, having picked up a nomination for \"Best Spoken Word Album for Children\" in 2006 for A Series of Unfortunate Events. The academy, sadly, has never given Carrey a fair chance, despite winning over the world in the likes of Eternal Sunshine of the Spotless Mind, Man on the Moon and The Truman Show. Getty Images 4/37 Jessica Chastain Chastain has the aura of an Oscar winner. Somewhere down the line, surely one her roles won her an Oscar? Yet, despite nominations for The Help and Zero Dark, plus stand-out leading roles in films such as Molly’s Game, the actor still does not have a statuette. Getty Images 5/37 James Dean Of James Dean’s three credited film roles, two were nominated for Oscars – Giant and East of Eden (Rebel Without a Cause was not nominated). Only one of his films, Eden, was released before his tragic passing in 1955. Magnum Photos 6/37 John Goodman The Academy members should hang their heads in shame for never nominating John Goodman, one of the finest ever character actors, for an award. Considering his brilliant performances in Raising Arizona (1987), Barton Fink (1991), The Big Lebowski (1998), O Brother, Where Art Thou? (2000), and Inside Llewyn Davis (2013) – and those are just his collaborations with the Coen Brothers – he must be wondering what he has to do to be acknowledged by the Academy. Getty Images 7/37 Salma Hayek Salma Hayek’s career highlight, Frida, came within inches of bringing her an Oscar. Yet, it was not to be – the actor was beaten by Nicole Kidman in The Hours, and Hayak has since been ignored by the Academy. Getty Images 8/37 Michelle Pfeiffer Michelle Pfeiffer was one of the most popular actors working in the 1980s and 1990s, nabbing Oscar nominations for Dangerous Liaisons (1988), The Fabulous Baker Boys (1989) and Love Field (1992). However, as the ceremonies came and went, no victory followed. Getty 9/37 Rosario Dawson That Rosario Dawson has become more associated with Superheroes than awards is a tragedy. Her roles in Rent, 25th Hour and Sin City have won her praise from critics and fans alike, but there’s still not an Oscar or Golden Globe mention on her IMDB page. Getty Images 10/37 Angela Lansbury You'd think that Angela Lansbury, having won five Tony Awards and six Golden Globes, would have at least one Oscar at home. Not so. Despite her three nominations – for Gaslight (1944), The Picture of Dorian Gray (1945) and The Manchurian Candidate (1962) – the Dame is yet to triumph at the Academy Awards. Getty Images 11/37 Oscar Isaac Oscar Isaac, his many fans argue, was robbed of an Oscar nomination for Inside Llewyn Davis. The critically acclaimed Coen brothers film failed to make the Best Picture cut, and poor Isaac, who played the eponymous struggling folk singer to perfection, was left without a nod. He was also overlooked for Ex Machina and A Most Violent Year. Getty Images 12/37 Robin Wright The Princess Bride, Forrest Gump, Moneyball: Robin Wright has consistently left critics and audiences impressed. And while no Oscars have followed, her work on the TV series House of Card has earned her seven primetime Emmy award nominations. AFP/Getty Images 13/37 Bradley Cooper Bradley Cooper’s directorial debut, A Star is Born, had won acclaim across the board and looked set for Oscars glory (with a Best Actor award almost within grasp). However, Rami Malek stole victory away from him at the last moment. Perhaps the best run of his career came between 2013 and 2015, when he was nominated for three consecutive acting Oscars: Silver Linings Playbook, American Hustle and American Sniper. Rex Features 14/37 Joaquin Phoenix You would be forgiven for presuming Joaquin Phoenix has an Oscar statuette somewhere at home. Yet the star of The Master, Walk the Line and Gladiator – all for which he was nominated – has no such award lying around. Instead, Phoenix will have to make do with a Golden Globe, a Grammy (for his work on the Walk the Line soundtrack) and a People’s Choice Award. Getty 15/37 Angela Bassett Angela Bassett has had one of the most prolific careers in Hollywood history, starring in dozens of TV shows and films. Her roles in What's Love Got to Do with It (1993), Malcolm X (1992) and Music of the Heart (1999) won awards elsewhere – but not with the Academy. Neilson Barnard/Getty Images 16/37 Sigourney Weaver Sigourney Weaver on the set of the original Alien film in 1979 Corbis 17/37 David Oyelowo Despite playing multiple roles that seem like certain Oscar winners, David Oyelowo has never even been nominated for an award. His role as Martin Luther King Jr in 2014’s Selma has gone down as one of the biggest snubs in recent history and was one of many incidents that led to the #OscarsSoWhite movement. Getty 18/37 Marilyn Monroe One of the most iconic actors of all time, Marilyn Monroe never received an Oscar nomination. Gentlemen Prefer Blondes (1953), How to Marry a Millionaire (1953) and Some Like It Hot (1959) may have gone down as classics, but Monroe never stood out enough for the Academy. Rex 19/37 Steve Buscemi The Big Lebowski, Fargo, Reservoir Dogs, Miller's Crossing, Con Air, Armageddon, Big Fish, The Death of Stalin and Barton Fink... just several films Steve Buscemi was not nominated for an Oscar for. In fact, Buscemi has never been nominated for an Academy Award. Getty Images 20/37 Woody Harrelson Three Oscar nominations for Woody Harrelson, and three loses for Woody Harrelson – Larry Flynt in The People vs Larry Flynt (1996), The Messenger (2009) and Three Billboards Outside Ebbing, Missouri (2017). But, like that widely shared Zombieland GIF, Harrelson will be wiping away the tears with a wedge of dollar bills, his films having made more than $3 billion at the box office worldwide. Frederick M Brown/Getty Images 21/37 Mia Farrow Mia Farrow may have starred in the classics Rosemary’s Baby, Broadway Danny Rose and The Purple Rose of Cairo, but not a single nomination followed. Surprising for someone who has won three Baftas and a Golden Globe. Getty 22/37 Idris Elba While many people suspected Idris Elba would score an Oscar nomination for Beasts of No Nation, the Academy’s hatred for Netflix proved too strong (Bafta and the Globes nominated him instead). Even other prime Oscar-bait – Molly’s Game, Mandela: Long Walk to Freedom, Second Coming – failed to land Elba any nominations. No wonder, perhaps, that the actor has stuck primarily to multi-million-dollar blockbusters. Getty Images 23/37 Edward Norton Having had acclaimed roles in American History X, Fight Club and Birdman, Edward Norton will no doubt go down as one of America’s most talented actors. Unfortunately, the actor has no Oscars to show it. AFP/Getty Images 24/37 Scarlett Johansson By starring in both Lost in Translation and Girl with a Pearl Earring, Scarlett Johansson shot herself slightly in the foot in 2003. For the two roles, she landed double Leading Actress nominations at Bafta (winning for Translation) and two Globes nominations. The Oscars? Not one. And despite standout roles in Lucy, Under the Skin, Match Pint, A Love Song for Bobby Long, she still has never been nominated for an Oscar. Getty 25/37 Samuel L Jackson Samuel L Jackson is one of the most prolific actors working in Hollywood and has one Oscar nomination – for Pulp Fiction (1995). Considering he’s ranked as the highest all-time box office star, having made over $12 billion worldwide, the Avengers actor’s probably not all that upset. GettySamuel L Jackson poses at a portrait session during day three of the 13th annual Dubai International Film Festival 26/37 Michelle Williams With four Oscar nominations under her belt, Michelle Williams somehow still has no statuette placed on her mantelpiece. Her closest call came in 2016, when she starred in Manchester By the Sea, when she was up against the supreme Viola Davis, who went on to win the award for Fences. Getty Images 27/37 Annette Bening Few actors can attest to being as hardworking as Annette Bening. Revered for her work onstage, she also won acclaim for Oscar-nominated on-screen roles in The Grifters (1990), American Beauty (1999) and The Kids Are Alright (2010). That she was completely overlooked for 20th Century Women in 2017 was a glaring oversight. Getty Images 28/37 Kirk Douglas Kirk Douglas was a leading man in Hollywood’s Golden Age, his roles in Spartacus, Lust for Life and Champion inspiring a generation of actors after him. Still, the actor never won a competitive Oscar – only an honorary one in 1996, for his 50 years in the creative industry. 29/37 Irene Dunne Irene Dunne – nominated five times – is one of the few recipients of the Kennedy Centre Honours for her service to the performing arts. Yet her performances in Cimarron (1931), Theodora Goes Wild (1936), The Awful Truth (1937), Love Affair (1939) and I Remember Mama (1948) all went unrewarded by the Academy. Getty Images 30/37 Arthur Kennedy One of the world’s most accomplished character actors, Arthur Kennedy was best known for his supporting roles in films such as Champion (1949), Trial (1955), Peyton Place (1957) and Some Came Running (1958), all of which won him Oscar nods. And despite a leading actor nomination in 1951 for Lights Out, Kennedy still couldn’t manage a win. United Artists 31/37 Albert Finney One of Britain’s premiere Shakespearean actors, Albert Finney was nominated five times across almost four decades, for Tom Jones (1963), Murder on the Orient Express (1974), The Dresser (1983), Under the Volcano (1984) and Erin Brockovich (2000). Rex 32/37 Deborah Kerr Six-time nominee Dame Deborah Kerr famously failed to win for the musical The King and I – losing to Ingrid Bergman in Anastasia. Thankfully, the Academy realised their error years later, awarding Kerr an honorary award and calling her “a dedicated actress whose motion picture career has always stood for perfection, discipline and elegance\". Getty Images 33/37 Thelma Ritter Another actor with six nominations and no wins. Even a role in 1950s All About Eve, which would win Best Picture, couldn’t push Thelma Ritter to victory. She went on to be nominated four more times that decade, for The Mating Season (1951, With a Song in My Heart (1952), Pickup on South Street (1953), and Pillow Talk (1959). 20th Century Fox 34/37 Glenn Close Another much-nominated actor without a win, Glenn's most recent Close shave came at the 2019 Oscars, when she was nominated for The Wife. She has previously been nominated six time, including roles in The World According to Garp (1982). Fatal Attraction (1987), and Dangerous Liaisons (1988) . Dave M. Benett 35/37 Amy Adams Amy Adams comes just behind Close, with six nominations (including The Fighter, The Master and American Hustle). None of those were for Arrival, the sci-fi film that saw Adams pick up Bafta, Golden Globe and Screen Actors Guild nominations. Unfortunately, that same year, she was competing against herself in Nocturnal Animals, which likely split the Oscars vote. AFP/Getty Images 36/37 Richard Burton Richard Burton holds the record for second-most Oscar nominations without a win (seven to Peter O’Toole’s eight). While Burton’s performance in Who's Afraid of Virginia Woolf? is often heralded as his best, the actor lost out to Paul Scofield in A Man for All Seasons. Getty Images 37/37 Peter O'Toole Peter O'Toole is the Oscar’s most-nominated actor without a win, with eight nods in total. Although the actor did not take home a trophy for Lawrence of Arabia, The Lion in Winter and Goodbye, Mr Chips, O'Toole was awarded an honorary Oscar in 2002. Getty\n\n“Now I don’t look up to him no more; I look through him,” Rourke said. “I came up from the s**t. He doesn’t know that life. I lived that f**king life, so every time I look him in the face I look right through his a**hole.”\n\nDe Niro's reps have been contacted for comment.\n\nBased on Charles Brandt’s book I Heard You Paint Houses, The Irishman marks the ninth collaboration between De Niro and Scorsese.\n\nIn it, De Niro plays former hitman Frank Sheeran as both an 80-year-old and a 24-year old – and it was this task that caused the film to become the most expensive Scorsese has ever worked on.\n\nThe film’s limited theatrical run will start on 1 November before its Netflix premiere on 27 November.", "description": "Mickey Rourke has clamed that Robert De Niro stopped him from getting a role in new Scorsese film The Irishman.", "authors": ["Jacob Stolworthy"], "top_image": "https://static.independent.co.uk/s3fs-public/thumbnails/image/2019/09/18/11/mickey-rourke.jpg", "published_at": "2019-09-18"}