{"pub": "euronews", "url": "https://euronews.com/2015/02/07/werner-herzog-s-latest-film-brings-hollywood-a-listers-to-berlin", "downloaded_at": "2019-10-09 19:15:29.853291+00:00", "title": "Werner Herzog's latest film brings Hollywood A-listers to Berlin", "language": "en", "text": "The red carpet in Berlin was awash with stars from the film industry on Friday night (February 6).\n\nI just love that he is still making movies with such passion and verve.\n\nNicole Kidman, James Franco and Damien Lewis were on hand to promote director Werner Herzog’s latest offering, ‘Queen of the Desert.’\n\nThe 72-year-old director seemed happy with the vibe on set.\n\n“They (the team) are all wonderful professionals. They prepared every detail, which always makes work easy,” Herzog told euronews.\n\nNicole Kidman was equally enthusiastic about the German filmmaker.\n\n“I just love that he is still making movies with such passion and verve. I mean, he was out there in the desert, he doesn’t use special effects, it’s all about: ‘We go and we conquer’ and I am like, ‘OK Werner I’ll follow you’,” she told our correspondent.\n\nIn ‘Queen of the Desert’, Kidman plays the role of secret service operative Gertrude Bell who, in the 1920s, played a decisive role in rearranging the political order in the Middle East.\n\nShe has since been nicknamed the ‘Female Lawrence of Arabia’.\n\nHerzog has never won the Berlinale’s top ‘Golden Bear’ award, but our correspondent Wolfgang Spindler thinks he is in with a good chance this year:\n\n“Werner Herzog may take home the Golden Bear this time. His chances are high with this film and its top-class cast. And Nicole Kidman’s lead role could prove to be the trump card he needs. We’ll see!”", "description": "Nicole Kidman, Damien Lewis and James Franco take to the red carpet at the Berlinale to promote Werner Herzog's latest offering, 'Queen of the Desert'.", "authors": [], "top_image": "https://static.euronews.com/articles/298558/1000x563_298558.jpg", "published_at": "2015-02-07"}