{"pub": "mirror", "url": "https://mirror.co.uk/news/us-news/dad-sons-dancing-video-celebrate-20582763", "downloaded_at": "2019-10-15 09:43:30.372096+00:00", "title": "Dad and son's dancing video to celebrate toddler being cancer free goes viral", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA joyous video showing a dad and son celebrating the toddler being cancer-free for 11 months has touched the hearts of thousands of people around the world.\n\nThe clip features two-year-old Kristian Thomas giggling away with Kenny, 35, as they dance to song by rapper Lil Mama.\n\nKristian was diagnosed with leukaemia in June 2018 and after five rounds of chemotherapy he was declared cancer free.\n\nThe video which was uploaded on Kenny's Instagram page is captioned: \"Father Son chemistry...11 Months Cancer Free!! If we can do it you can do it!! Live Free!! Drop a heart for Father Son Vibes!!!\"\n\n(Image: kennyclutch/Instagram)\n\nKenny's account also features other videos of him and his son dancing including a clip where they are joined by Josilyne, Kristian's mum while dancing to September by Earth, Wind and Fire.\n\nKenny, 35, a choreographer and dance studio owner from New Jersey, started recording videos with his son to distract him while he underwent chemotherapy for his cancer.\n\nHe told PIX 11 : \"I've been doing these videos and people have been loving them since the first one that I did.\n\n\"I figure why...be the dad that's grieving and complaining about his son being in the hospital and his family being in the hospital all day?\n\n(Image: kennyclutch/Instagram)\n\n(Image: kennyclutch/Instagram)\n\n\"Why don't I change things up a little bit and let's show people how to be positive in this situation?\"\n\nKristian is Kenny and Josilyne's fourth child and was born with Down syndrome, a genetic disorder that occurs when a person is born with an extra chromosome.\n\nAll babies with Down syndrome will experience some learning difficulties which can range from mild to severe and there are health problems associated with the condition including heart defects and obesity.\n\n(Image: kennyclutch/Instagram)\n\n(Image: kennyclutch/Instagram)\n\nAfter he was born Kristian was found to have a rare blood disorder often found in children with Down syndrome and his parents were warned it could develop into leukaemia.\n\nAt the age of one Kristian was diagnosed with acute megakaryoblastic leukaemia\n\nNext month will mark a year since Kristian was declared cancer free.", "description": "The clip features two-year-old Kristian Thomas, from New Jersey, giggling away with Kenny, 35, while they dance to song by rapper Lil Mama", "authors": ["Lorraine King", "Image", "Kennyclutch Instagram"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20582652.ece/ALTERNATES/s1200/1_Devoted-dad-and-his-two-year-old-battling-leukemia-dance-together-in-viral-video-to-celebrate-the-to.jpg", "published_at": "2019-10-15"}