{"pub": "usatoday", "url": "https://usatoday.com/story/news/pr/2019/04/30/usa-today-network-wins-11-national-headliner-awards/3626820002", "downloaded_at": "2019-10-05 13:30:59.138959+00:00", "title": "USA TODAY Network Wins 11 National Headliner Awards", "language": "en", "text": "USA TODAY NETWORK journalists earned 11 wins last week in the 85th National Headliner Awards, one of the oldest and largest annual contests recognizing journalistic merit in the communications industry.\n\nFirst place in a news series in daily newspapers in the top 20 market went to Laura Trujillo, Alia Dastagir and Anne Godlasky for USA TODAY's “Surviving Suicide” project. “This was a bold, meaningful, effective and helpful series about an issue the country continues to struggle with. Laura Trujillo wrote a brave and painful remembrance of her mother's suicide, as well as her own rape, and USA cushioned the story with those of others, and offered meaningful ways to deal with the issue. Beautifully done,” said the judges.\n\nFirst place in the category of health writing was won by Alison Young and Laura Ungar for USA TODAY’s “Deadly Deliveries” investigation, which has led to new standards proposed by the nation's largest hospital accreditation group. “The United States is the most dangerous place in the developed world to deliver a baby. It's hard to get your head around that. USA Today took a deeper dive at why this is the case. The writing is compelling, the examples and numbers strong, and the need for continued change and oversight obvious,” said the judges.\n\nJohn Fauber, Matt Wynn and Kristina Fiore of the Milwaukee Journal Sentinel earned second place in that category for their “Bad Medicine” reporting on how doctors who lose their licenses in one state can still practice in other states.\n\nRochelle Riley of The Detroit Free Press won first place in the category for local columns category. Her winning work included her column calling for former Michigan State President Lou Anna Simon to resign in the wake of the Larry Nassar scandal, her piece on the Aretha Franklin funeral, and her profile of a Detroit high school girl who overcame a troubled childhood to succeed and win a local science fair. The judges stated, “‘She brought joy to heartbreak — and joy won.’ That's how Rochelle Riley described Aretha Franklin in covering the singer's funeral. And Riley used an uncommonly strong writing voice to call on Michigan State President Lou Anna Simon to resign after the Larry Nassar scandal. And Riley's touching piece on a Detroit student's rise from a chaotic upbringing to academic achievement was outstanding. Great work, Rochelle; we loved it.”\n\nRick Barrett of the Milwaukee Journal Sentinel came in first place for business news coverage for his reporting on the crisis facing Wisconsin dairy farmers. “Hundreds of Wisconsin dairy farms are going under as a glut of milk on the market collapses prices and profits. Rick Barrett's in-depth and insightful reporting puts human face on a crisis that is punching Wisconsin farmers in the gut,” said the judges.\n\nDetroit Free Press reporters Eric D. Lawrence and Kristi Tanner and USA TODAY reporter Nathan Bomey came in second for business news coverage for their “Death on Foot” reporting on why pedestrian deaths are up 46% in the past decade.\n\nJames E. Causey of the Milwaukee Journal Sentinel won second for news series in newspapers not in top 20 media market for his \"Cultivating a Community\" special report, which looked at how fruits and vegetables become powerful weapons for saving young boys in Milwaukee's poorest ZIP code.\n\nSecond place for best political coverage second place went to the Tennessean staff for its “Mayor Barry Scandal” reporting on the events leading up to Mayor Megan Barry’s resignation.\n\nThe Desert Sun’s Ian James won third for environmental writing for his work on the “Poisoned Cities, Deadly Border” investigation of pollution on the border and its effects on people's health.\n\nAndrew Ford took third for best online video 3-10 minutes for his coverage for Asbury Park Press of a man who was beaten by police.\n\nCoverage of the devastating Carr Fire earned Redding Record Searchlight third place for spot news in daily newspapers of all sizes.\n\n“We are so proud of our journalists whose work was honored at the National Headliner Awards for tackling a variety of important issues and making an impact in communities across the country,” said Nicole Carroll, editor in chief, USA TODAY.\n\nThe Press Club of Atlantic City, which founded the National Headliners Awards in 1934, announced the 2019 Print, Photography and Online winners for the 85th annual content on Monday. Congratulations to all of our journalists who were recognized!\n\nRead or Share this story: https://www.usatoday.com/story/news/pr/2019/04/30/usa-today-network-wins-11-national-headliner-awards/3626820002/", "description": "USA TODAY NETWORK journalists receive multiple honors in 85th National Headliner Awards.", "authors": ["Staff", "Usa Today Network Pressroom", "Published P.M. Et April"], "top_image": "https://www.gannett-cdn.com/presto/2019/04/30/USAT/2c135fde-c839-489a-bd3c-9506bbcb9b76-National_Headliner_Awards_Logo.png?crop=476,268,x1,y68&width=3200&height=1680&fit=bounds", "published_at": "2019-04-30"}