{"pub": "foxnews", "title": "Lockheed Martin CEO Hewson: No veteran should be left behind by today’s economy. Here’s how to make it happen", "url": "https://foxnews.com/opinion/lockheed-martin-ceo-hewson-veteran-left-behind-economy", "language": "en", "published_at": "2019-08-31", "downloaded_at": "2019-09-03 00:04:33.437120+00:00", "text": "Labor Day is a holiday dedicated to America’s workers – the men and women who drive our economy and make our nation a global economic leader.\n\nIt is also a time when government and business leaders should reflect on the ways our country can ensure U.S. workers and industry will continue to compete and excel in the decades ahead.\n\nOne of the ways we can come together to strengthen our nation’s workforce is to create multiple pathways for career success for every worker. This means we must open up apprenticeships, internships, and job-training so workers can gain the skills and abilities they need to fill the jobs that will define the 21st century.\n\n‘TEAM PATRIOT’ BANDS TOGETHER WOUNDED VETS TO SERVE OTHERS THROUGH DISASTER RELIEF: ‘IT’S A NEW LIFE FOR ME’\n\nNo group is more deserving of this national focus than our nation’s veterans.\n\nOur men and women in uniform come from every background and every corner of our country. But they stand united by our nation’s highest ideals and a willingness to serve in harm’s way to protect our security, freedom, and way of life.\n\nAnd when their term of service is over, it is our turn to serve them by helping them pursue their dream jobs. Yet, according to a 2018 survey by Edelman, nearly half of veterans reported difficulty finding a job in their desired field after leaving the military.\n\nFortunately, America’s businesses and corporations have a powerful new tool to help ensure no member of our Armed Forces is left behind by the modern economy.\n\nAt Lockheed Martin, we are deeply proud of the impact veterans have had on our business. More than 22 percent of our workforce is currently made up of veterans and active military reservists. These men and women bring discipline, focus, and leadership that make our teams stronger and our company more competitive.\n\nIn 2017, Congress passed and the president signed the Veterans Apprenticeship and Labor Opportunity Reform (VALOR) Act. This legislation allows veterans to use the benefits from the GI Bill to take advantage of registered apprenticeship programs at American companies.\n\nOf course, in order to make the most of the VALOR Act, America’s business leaders and their companies must have meaningful workforce development programs and ensure they are creating opportunities and pathways for military veterans.\n\nAt Lockheed Martin, we are deeply proud of the impact veterans have had on our business. More than 22 percent of our workforce is currently made up of veterans and active military reservists. These men and women bring discipline, focus, and leadership that make our teams stronger and our company more competitive.\n\nThat is why we are proud to be one of the first companies to qualify some of our most important apprenticeship programs under the VALOR Act. This means that our eligible veteran apprentices can now take advantage of the financial support offered through their GI Bill benefits and use it for monthly housing allowances, stipends for books and supplies, and more.\n\nCLICK HERE TO GET THE OPINION NEWSLETTER\n\nAt this moment in our history, our nation faces a growing “skills gap” – a shortage of workers with strong skills in science, technology, engineering, and math. To keep pace, government, industry, and academia will have to come together to find innovative ways to educate and train, or in some cases re-train, workers.\n\nWe know that through structured apprenticeships, internships, and on-the-job training programs, U.S. workers can acquire the skills companies like ours need. Such initiatives will be required even more as the global economy expands and technology advances rapidly.\n\nThe VALOR Act will be critical in this national effort.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\nBy giving veterans new paths to build on the valuable skills they acquired in the Armed Forces as well as learn new technologies, we can strengthen our entire nation.\n\nI challenge my fellow CEOs, America’s business leaders, to join this national effort and create new and meaningful workforce development programs. Together, we can ensure the “American Dream” is made attainable for the men and women who make our nation great.", "description": "America’s businesses and corporations have a powerful new tool to help ensure no member of our Armed Forces is left behind by the modern economy.", "authors": ["Marillyn Hewson", "Marillyn A. Hewson Is Chairman", "President", "Ceo Of Lockheed Martin."], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/07/ContentBroker_contentid-48195beb776e43ffafee7654ce7be956.png"}