{"pub": "atlantic", "url": "https://theatlantic.com/politics/archive/2019/09/former-sanders-supporters-are-voting-warren/598285", "downloaded_at": "2019-09-18 23:20:13.319996+00:00", "title": "Why Ex–Sanders Supporters Are Backing Warren", "language": "en", "text": "Mitchell’s reasoning echoed the sentiments of other progressive voters I’ve spoken with recently. They have affection for Sanders and appreciate what he’s done for the movement, as roughly one dozen voters explained to me this week. But Warren, they argued, is proffering a kinder, gentler version of progressivism—one that is rooted in her experience, simple to understand, and compelling enough to attract a broad swath of voters.\n\n“She’s everything Bernie is—but a bit more electable,” said Joe Piluso, a 71-year-old former Sanders supporter and former social-services worker living in San Diego.\n\nIn the 2020 presidential primary, Sanders and Warren have set their sights on combatting income inequality, and both are supported by small-dollar donors and grassroots organizing. They’re closely aligned at the policy level: Both have campaigned on progressive policies such as free college, the Green New Deal, and some version of Medicare for All. But the two senators have taken very different tacks when it comes to working with the Democratic establishment. Sanders, who’s always operated as an insurgent figure, still refuses to join the Democratic Party, while Warren has more closely toed the party line. Sanders is a self-described democratic socialist, while Warren insists that she is “capitalist to my bones.”\n\nFor many of the voters I spoke with for this story, their preference for Warren boils down to one core conclusion: She’s likable. I heard the same thing in July at Netroots Nation, an annual convention for progressive activists, where the cardigan-wearing former public-school teacher was the clear 2020 favorite. “I really feel like she would throw herself in front of a bus for us,” one attendee told me at the time. “There’s nobody who’s more earnest.”\n\nBarbara Helmick, the director of programs at DC Vote, an organization advocating for Washington, D.C., statehood, told me this week that she feels a connection to Warren. “There’s a level of warmth and confidence and just such true passion that it really inspires me in a way that none of the other candidates do,” Helmick said. Sanders, by contrast, has developed a reputation as the prickly grandfather of the progressive movement, constantly finger-wagging and shouting himself hoarse. “He’s very strong and didactic and opinionated,” said Linda Day, a 78-year-old retiree from Houston. But while she supported Sanders in 2016, she now views him as a “polarizing figure.”\n\nVoters argued that Warren is a more skilled communicator. She “has such a sharp ability to break complex policy positions into really understandable terms,” Helmick said. Sanders’s message isn’t as accessible, Piluso echoed. And Warren’s supporters view her as more of a collaborator, someone who can work with other lawmakers to accomplish progressive goals. In our conversations, many voters cited her work helping to establish the Consumer Financial Protection Bureau, an agency that Warren proposed creating in 2007, as evidence of her effectiveness. “What I like about Warren is her plans are basically Bernie’s,” Day said, “but I think she’s the person to get it done.” As a “bona fide member” of the Democratic establishment, Warren is in a better position than Sanders “to fundamentally shift the party’s consensus on what’s truly desirable and possible in terms of policy, and to get other Democrats on board with enacting real reforms,” Kelly Baker, a 41-year-old writer from Memphis, Tennessee, wrote to me in an email.", "description": "The senator from Massachusetts, they argue, is proffering a gentler version of progressivism that is simple to understand and compelling enough to attract a broad swath of voters.", "authors": ["Elaine Godfrey"], "top_image": "https://cdn.theatlantic.com/assets/media/img/mt/2019/09/AP_19212018280881_toned/facebook.jpg?1568827376", "published_at": "2019-09-18"}