{"pub": "foxnews", "url": "https://foxnews.com/us/artist-brings-900-pound-opioid-spoon-to-johnson-johnsons-doorstep", "downloaded_at": "2019-09-20 05:11:29.986387+00:00", "title": "Artist brings 800-pound opioid spoon to Johnson & Johnson's doorstep", "language": "en", "text": "A Boston-based artist dropped off an 800-pound bent spoon in front of Johnson & Johnson's New Jersey headquarters on Wednesday, his way of spotlighting the company's role in the opioid crisis.\n\nDomenic Esposito wheeled the 10-foot-long, four-foot-tall aluminum utensil to the company's doorstep, forcing those trying to enter the building to walk around it.\n\nThe handle was etched with \"J&J.\"\n\nPURDUE PHARMA'S SACKLER FAMILY USED HIDDEN ACCOUNTS TO TRANSFER $1B: COURT DOCS\n\n“My mom would call me in this panic voice that she found a spoon in the house,” Esposito told NJ.com of his brother's 12-year battle with addiction.\n\nEsposito kept the giant spoon on the premises until New Brunswick police asked him to move it to a public space nearby. He said he wanted to start a conversation about prescription painkillers.\n\n\"Even as a group we are not totally against opioids: For example, their use for acute cancer patients or for after an operation,\" he said, according to Patch. \"Yes, there is a use for them in society but our society has also been handing them out like candy for the past 20 years. Opiate painkillers are very dangerous drugs and should be treated as such.\"\n\nJohnson & Johnson's role in the opioid crisis came to a head last month when an Oklahoma judge found it helped fuel the state's epidemic and ordered the consumer products giant to pay $572 million.\n\nCLICK HERE TO GET THE FOX NEWS APP\n\n\"Johnson & Johnson did not cause the opioid crisis in Oklahoma or elsewhere,\" the company's vice president, Ernie Knewitz, told NJ.com in a statement about the protest.\n\nHe added that drug production is regulated by the Food and Drug Administration and U.S. Drug Enforcement Agency. Johnson & Johnson did not immediately respond to Fox News for comment.\n\nEsposito told the newspaper he delivered three other spoons to pharmaceutical companies and government offices.", "description": "A Boston-based artist dropped off an 800-pound bent spoon in front of Johnson & Johnson's New Jersey headquarters Wednesday to highlight the company's role in the opioid crisis.", "authors": ["Louis Casiano"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/AP19261553844378.jpg", "published_at": "2019-09-20"}