{"pub": "joongang", "url": "https://koreajoongangdaily.joins.com/news/article/article.aspx?aid=3068786&cloc=joongangdaily|home|newslist2", "downloaded_at": "2019-10-07 12:13:45.525223+00:00", "title": "Arrest warrant filed in relation to Burning Sun", "language": "en", "text": "Prosecutors on Monday said they filed a pretrial detention warrant for a senior police officer who allegedly pulled strings to keep K-pop celebrities out of trouble.The suspect, a 49-year-old senior superintendent only identified by the surname Yun, is accused of abusing his power to dismiss complaints against K-pop singers and their business partners who operated nightclubs in the Gangnam District area of southern Seoul.Those celebrities allegedly include Seungri, 28, a former member of the popular boy band Big Bang, and solo artist Jung Joon-young, 30, who rose to fame on the auditioning show “Superstar K” in 2012.The most notable of the establishments was Burning Sun, a nightclub that was revealed earlier this year to be a hotbed of prostitution, drug use and police protection.As well as the suspicions that Yun abused his authority to protect the K-pop stars, prosecutors said they also pressed charges that he received bribes, destroyed evidence and violated the country’s Financial Investment Services and Capital Markets Act.Prosecutors believe Yun received tens of millions of won in bribes from a 45-year-old man surnamed Jeong, who previously led a printing material company named Nokwon C&I. Jeong is known to have introduced Yun to Seungri, whose real name is Lee Seung-hyun. In 2016 when the Suseo Police Precinct in Gangnam District investigated Jeong on suspicions of embezzlement, Yun is believed to have interfered, leading police to send the case to the prosecution with a recommendation that Jeong not be indicted.In July 2017, Yun was dispatched to the Blue House for a year, working under the supervision of President Moon Jae-in’s then-senior secretary for civil affairs, Cho Kuk, who’s now the justice minister. The Seoul Central District Prosecutors’ Office that’s currently investigating the Burning Sun scandal is also probing a litany of allegations surrounding Cho and his family.Co-Link Private Equity, an investment company in which Cho’s family heavily invested in, is the largest shareholder of WFM, a secondary battery company. In 2014, WFM invested in Cubes, which later changed its name to the current Nokwon C&I. Yun is known to have purchased 50 million won ($41,800) worth of Cubes stock.BY LEE SUNG-EUN, YONHAP [lee.sungeun@joongang.co.kr]", "description": "", "authors": [], "top_image": "http://static.joins.com/joongang_15re/profile_koreajoongangdaily_200.png", "published_at": "2019-10-07"}