{"pub": "npr", "url": "https://npr.org/2019/09/04/755221033/families-not-just-students-feel-the-weight-of-the-student-loan-crisis", "downloaded_at": "2019-09-04 23:40:39.244250+00:00", "title": "Families, Not Just Students, Feel The Weight Of The Student Loan Crisis", "language": "en", "published_at": "2019-09-04", "text": "Families, Not Just Students, Feel The Weight Of The Student Loan Crisis\n\nEnlarge this image Delphine Lee/ NPR Delphine Lee/ NPR\n\nFor many college students settling into their dorms this month, the path to campus — and paying for college — started long ago. And it likely involved their families.\n\nThe pressure to send kids to college, coupled with the realities of tuition, has fundamentally changed the experience of being middle class in America, says Caitlin Zaloom, an anthropologist and associate professor at New York University. It's changed the way that middle class parents raise their children, she adds, and shaped family dynamics along the way.\n\nZaloom interviewed dozens of families taking out student loans for her new book, Indebted: How Families Make College Work at Any Cost. She defines those families as middle class because they make too much to qualify for federal aid — but too little to pay the full cost of a degree at most colleges. For many, the burden of student debt raises big questions about what a degree is for.\n\nThis conversation has been edited for length and clarity.\n\nHow would you describe the world of student debt?\n\nFamilies have really been transformed by debt, and really by the problem of dreaming about sending a kid to college and trying very hard to pay for it — oftentimes from the very earliest moments of a child's life. I think what we don't take account of, nearly enough, is what that experience is like — [what] the experience of trying to give a kid a shot by sending them [to] college means for most middle class families.That's the thing that I think that we need to be focusing on.\n\nYou argue in the book that the idea of going to college is pervasive in American life.\n\nIt is pervasive. That message is coming at families from every direction: that being a success in America depends upon the ability to get into college, to get an education and to graduate. But that itself depends on the ability to pay, which thrusts us right into the paradox of it all — which is that on the one hand, young adults and the parents who support them have this very clear goal about getting a college education. On the other hand, that is going to cost them dearly.\n\nAnd this affects people of different races differently?\n\nAbsolutely. It it does not affect everyone the same way at all. And too often we focus on big aggregate numbers that lump everybody together. The $1.5 trillion of outstanding debt, the average of $30,000 for undergraduate borrowers ... Those numbers put everyone together in the same group. But of course and predictably, women and people of color bear the burden more than more than their white, male peers. They graduate with more debt. Takes them longer to pay it off. They're more likely to go into default. All of the downsides of debt are visited on the people who can bear it the least.\n\nIs there any light at the end of the tunnel?\n\nParents and students are totally committed to higher education. They are so committed to college and they are so committed to getting an education to realize their kid's potential, to become citizens of the world, to make the world a better place. All of that commitment is at the heart of the book.\n\nThe problem is that today, we have a system that does not support the commitment that already exists at the heart of family life. So what I would do about it, first and foremost. is to start funding the public higher education systems in this country so that they could actually be a reasonable low-cost or free-tuition option for families.\n\nWe have 50 state university systems in this country and public higher education has been a core value for Americans for many, many, many, many, many decades.\n\nBut what we've seen over decades, too, is that state legislatures have consistently defunded public education systems in this country. They have to get their operational funds somewhere, and they've been raising tuition to do it.\n\nOne of the things I really loved about the book is that it is it's so family centered and doesn't just focus on students.\n\nAnd in fact, Indebted starts with the parents — at the moment that children are born. Precisely because so much of the conversation has been about the student and their futures after graduation. And of course that is extremely important, but I think that we're really missing an important part of the picture, which is that the pressure to pay for college, and the necessity of getting a child to college to give them a shot, really transforms family life. It really transforms the relationships between parents and their kids as they're growing up, all the way to school, and sometimes long after they've graduated from college.\n\nIt's also worth noting that in some cases families are taking on student loan debt on directly. One loan you write about in the book is a federal loan called the Parent PLUS. What did you learn about their experiences?\n\nMore and more parents are taking out [Parent Plus loans], where they can borrow up to the cost of attendance. The Parent Plus loans themselves ... are much more likely to be taken out by families who don't have as much income, and who don't have as much wealth — which is also disproportionately people of color. That borrowing is going up and up as the as the need is increasing.\n\nInside families, there's an enormous amount of pressure. I think of Parent Plus loans as being a kind of tip-of-the-iceberg phenomenon. So as you see Parent Plus loans going up, what you can also know is that parents are doing pretty much everything to not take out that loan. They don't want to take out a loan.\n\nSo that means that their incomes are maxed out, likely they have they have taken what they can from any retirement savings, and they are plowing all of that into helping their kids got an education. And if this is true for those families who are most stressed — which is what we see with the Parent Plus loans — it is also true for families across the board.\n\nThere is a story in your book about Kimberly, a student who comes into your office, worried about \"selling out\" by taking a corporate job that challenged her ethics — but would help her pay back her loans.\n\nShe was concerned that having a job that would pay her enough to start chipping away at her loans would mean compromising what she wanted to do. And it did, in fact. It really changed the course of her life. But it also meant compromising what she thought her education was for.\n\nSo her mother, who was a waitress when her three kids were young, had taught Kimberly and her siblings that college was their way forward. It was going to be the way that they had a life that was better than hers. And so, when she got to this moment where she was about to graduate — an incredibly smart, vibrant person with everything going for her — what she saw was a job that would help her pay down her loans, but which would absolutely compromise what her and her mother had talked about — as far as launching into a world to which her mother never had access.\n\nAnd the flip side of that is — she was probably making more than her mom made as a waitress.\n\nYes, that's absolutely right. When we focus only on income, we lose a lot of the picture about what is going on inside families and their experiences. Sure — she was making money that her mother certainly did not make when she was a waitress.\n\nSo Kimberly was already on a path to make more than her mother — but that wasn't really what she wanted. She wanted economic stability, of course — that is essential. But she also had aspirations beyond that as well.\n\nThat aspiration, that desire to be different than your parents and to do better than them — not just economically, but also in terms of living a life as you intend. That is an American inheritance that all of the parents in Indebted wanted to give to their children.\n\nOf course, not everyone has access to that at all, but I think that it's something that is very important to recognize and to hold on to — the idea that we all should be able to live our lives as we intend, to be independent and not simply to do what corporations want us to to do in order to make money.\n\nIt also raises questions about what higher education is for.\n\nThat's right. I think we really need to be asking ourselves the question: What is higher ed for? To question the notion that higher ed is only for making money. I think that when we think about college education in that restricted way, we are really losing the most important part of the picture for families. They told me again and again that what they wanted for their children was something more. Of course they want stability. We all want some basic stability. [But] it's a much bigger picture than just making an income.\n\nNPR's Clare Lombardo produced this story for the web.", "description": "A new book looks at how the struggle to pay for college has transformed the experience of the American middle class.", "authors": ["Elissa Nadworny"], "top_image": "https://media.npr.org/assets/img/2019/09/03/indebted-final_wide-fdf346b2b9dac2c3c4c258b3791ade3ca2ec7c87.jpg?s=1400"}