{"pub": "mirror", "url": "https://mirror.co.uk/news/uk-news/wife-arrested-nagging-husband-clean-20638218", "downloaded_at": "2019-10-17 01:48:10.756451+00:00", "title": "Wife arrested for 'nagging' husband to clean the house speaks out for first time", "language": "en", "text": "Get the biggest daily news stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nA woman who was arrested for 'nagging' her husband to clean the house has broken her silence.\n\nValerie Neal, formerly Sanders, has admitted to asking her bodybuilder ex, Michael, to vacuum more, however she insists her behaviour was legal.\n\nThe 59-year-old was arrested and spent 17 hours in a prison cell, before being charged over controlling behaviour last April.\n\nMs Neal, from Catterick, North Yorkshire, later accepted a two-year restraining order against her husband, who subsequently dropped the case.\n\n(Image: Facebook)\n\n(Image: Facebook)\n\nShe now says she wishes she had her day in court to prove she did nothing more than ask him to help out around the house.\n\nThe divorcee, whose decree nisi was granted last month, told Mail Online : \"All I ever asked my husband to do was vacuum the house, make me a cup of tea and wipe marks off the patio doors.\n\n\"If that’s nagging, I’ll hold my hands up to it. But asking your husband to vacuum is not, in my eyes, a criminal offence.\n\n(Image: Facebook)\n\n(Image: Facebook)\n\n\"I appreciate our marriage was on the rocks but for Mike to treat me the way he did, after all the love and care I put into the relationship, was devastating.\"\n\nThe outgoing mother, who is now in a new relationship, said she was drawn to Mr Sanders despite his 'timid' personality.\n\nMs Neal, who has two children from previous relationships, said she started to resent her husband for his unwillingness to tidy up.\n\n(Image: Facebook)\n\nThe cleaning business owner said she hated returning home from work and having to do more vacuuming.\n\nThings escalated when Mr Sanders resigned from his gym job in 2018 and stopped eating and sleeping, Ms Neal said.\n\nAfter her husband told a Job Centre employee about his troubles, the matter was passed to the police and Ms Neal was arrested.\n\nMichael gave an interview to a newspaper in June.\n\nAfter the trial collapsed he told the paper Valerie said he was training too much, that she wanted him to clean every day and would not eat the food he cooked from Aldi or Lidl.\n\n(Image: Facebook)\n\nHe said: \"I know people might say the nagging is just married life, but this is not married life to me.\n\n\"I think it was controlling, but I’m not sure if she should have gone to court or not. That was not my decision.\"\n\nCoercive and controlling behaviour - which carries a maximum sentence of five years - is a much discussed crime with the overwhelming majority of prosecutions being against men (97 per cent in England and Wales in 2016).\n\nCertainly, such offences are difficult to prosecute. Since the law came into force in December 2015, 7,034 people have been arrested but only 1,157 charged and just 235 convicted.", "description": "Valerie Neal, formerly Sanders, admitted to 'nagging' her husband but denied committing a criminal offence", "authors": ["Matthew Dresch", "Image", "Facebook"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article17263568.ece/ALTERNATES/s1200/1_Cleaner-58-is-arrested-and-locked-in-cells-for-17-hours-accused-of-controlling-behaviour-after-tel.jpg", "published_at": "2019-10-17"}