{"pub": "breitbart", "url": "https://breitbart.com/politics/2019/10/21/left-wing-website-urges-louis-vuitton-boycott-after-trump-visits-texas-factory", "downloaded_at": "2019-10-22 13:36:59.130862+00:00", "title": "Website Urges Louis Vuitton Boycott After Trump Visits Texas Factory", "language": "en", "text": "A left-wing group that specializes in launching boycotts of businesses with ties to President Donald Trump is now targeting Louis Vuitton because the fashion company allowed President Donald Trump and others in his administration to visit its new handbag factory in Texas on Thursday.\n\nIn an alphabetized list of companies it recommends consumers boycott, the Grab Your Wallet website gives the reason for targeting Louis Vuitton as being because “French businessman and chairman of LVMH Bernard Arnault did a photo op with the Trump administration workshop in Texas.”\n\nThe Business of Fashion (BOF) website reported on the boycott effort:\n\nThe group organized shortly before the 2016 election after recordings emerged of Trump disparaging women on the set of Access Hollywood. Grab Your Wallet had an early win when its call for consumers to boycott Ivanka Trump’s fashion line and stores that carried it appeared to contribute to a decline in sales. Trump closed her brand last year. Most brands on Grab Your Wallet’s list were targeted for financial ties to Trump, including SoulCycle and the Hudson Yards mall in Manhattan. Stephen Ross, the developer of Hudson Yards and chairman of Equinox-owned SoulCycle, held a fundraiser for Trump in August. LVMH is the first owner of consumer brands to make the list that is not financially involved with the Trump family or administration. It’s unlikely that the boycott will have a massive effect on the luxury behemoth; LVMH owns companies like Sephora, Céline, Givenchy, and Dior just to name a few, and saw record profits of €6.4 billion in 2018. Louis Vuitton is expected to net €12 billion in sales this year.\n\nBut Shannon Coulter, one of Grab Your Wallet’s founders, told BOF that people hate Trump more than they care about Americans being employed.\n\n“Creating jobs is not an excuse to ignore morally repugnant behavior,” Coulter said in the BOF report. “Businesses are willing to look the other way in order to work with the Trump administration, but it’s a worrisome trend.”\n\nIvanka Trump, Trump’s daughter and an adviser to the president; Department of Labor Secretary Eugene Scalia; and Commerce Secretary Wilbur Ross also attended the opening.\n\n“The French luxury house opened the factory as part of a commitment it made to the Trump Administration to create more manufacturing jobs in the US,” BOF reported. “In 2018, Louis Vuitton signed the Pledge to America’s Workers, a Trump initiative that was also signed by Google, Amazon, and Ford.”\n\nSome of the other businesses targeted for boycott because of association with the Trump administration include AT&T; Bank of America, Merrill Lynch; BP; Hobby Lobby; L.L. Bean; NASCAR; New Balance; Shell Oil; and WWE.\n\nWegmans grocery chain is also on the list because it sells Trump wine products.\n\nFollow Penny Starr on Twitter.", "description": "A left-wing group is urging consumers to boycott Louis Vuitton products after President Trump visited a new factory in Texas last week.", "authors": ["Penny Starr"], "top_image": "https://media.breitbart.com/media/2019/10/Trump-Louis-Vuitton-640x335.jpg", "published_at": "2019-10-21"}