{"pub": "dailybeast", "url": "https://thedailybeast.com/mike-pompeo-pushed-out-his-own-ukraine-representative-kurt-volker-to-quiet-a-growing-scandal", "downloaded_at": "2019-10-02 02:28:15.704846+00:00", "title": "Pompeo Pushed Out His Own Ukraine Rep to Squash a Growing Scandal", "language": "en", "text": "When President Donald Trump’s personal attorney Rudy Giuliani appeared on cable news programs last week, he deflected questions about his work in Ukraine and instead hammered home one talking point over and over again: The State Department knew he was trying to dig up dirt on 2020 presidential candidate Joe Biden and his son Hunter.\n\nGiuliani waved his phone on air, flashing text messages between himself and State Department representatives, saying it was the department that connected him to a close adviser to Ukrainian President Volodymyr Zelensky. Giuliani’s on-air appearances threw the department into a tizzy, forcing Secretary of State Mike Pompeo to try to quell a bubbling internal crisis of confidence, according to three senior U.S. officials. For Pompeo, to solve the problem meant to find someone to blame, and there was only one individual who fit the mold, according to those same sources: former U.S. representative for Ukraine negotiations Kurt Volker.\n\nVolker resigned on Friday. But despite his resignation, the State Department has scrambled to correct course, according to these same U.S. officials, especially after news that Pompeo was on the now-infamous call between President Trump and Zelensky in July. Pompeo had previously denied knowing about it on national television. On top of that, three congressional committees subpoenaed Pompeo for documents related to Trump and Giuliani’s work in Ukraine and demanded that five current and former department officials appear for depositions.\n\nIn response, Pompeo tried a time-tested Trump White House strategy: stonewalling Congress. The secretary said Tuesday that Congress was “bullying” career officials and suggested they would not appear for questioning. (The State Department’s inspector general is currently investigating members of Pompeo’s department for pushing career officials out of their posts for perceived political bias.)\n\nThe State Department did not respond to a request for comment for this story.\n\nPompeo’s plan appears to have backfired. Despite the secretary’s efforts to block several of his current and former officials from speaking to Congress, Volker is set to go to Capitol Hill on Thursday with the backing of a cadre of current and former diplomats. Some of those diplomats spoke to The Daily Beast and requested anonymity because they feared reprisals from Pompeo and other Trump administration officials.\n\n“ I think Kurt definitely felt like he was being pushed out. He really believed in the job and was committed to helping Ukraine work toward a better future. ” — Senior U.S. official who requested anonymity\n\nNow the department is bracing for impact. Current and former State Department officials who spoke to The Daily Beast, some of who are close Volker, said he was forced out of his post. Volker’s interview with Congress could lay bare details of Pompeo’s involvement in the Trump-Giuliani Ukraine saga.\n\n“I think Kurt definitely felt like he was being pushed out,” said one senior U.S. official. “He really believed in the job and was committed to helping Ukraine work toward a better future.”\n\nU.S. Ambassador to Ukraine Marie Yovanovitch is also set to sit for questioning with congressional investigators next week. Yovanovitch was abruptly recalled from her position in May following public criticism by Giuliani for her work in the country. And on Wednesday the State Department’s inspector general is headed to Capitol Hill for an urgent briefing with Congress. It’s unclear exactly what the briefing will entail, but Democratic aides told The Daily Beast the State IG said it wanted to meet about documents it obtained from the Office of the Legal Adviser at the department.\n\nThe beginning of the end for Volker started when Giuliani outed the Ukraine negotiator’s text messages on national television, officials say. The next day, the State Department got word that major U.S. media outlets were scrutinizing the negotiator’s work and relationships in Ukraine. As the public began to learn more about Volker, Pompeo became convinced that scapegoating his representative would leave the department in a better place politically, especially with Congress ratcheting up its investigation into Giuliani and Trump’s efforts, according to two senior U.S. officials.\n\nOne individual familiar with Pompeo’s thinking told The Daily Beast that “it was decision time, I think, for Pompeo.” “It was clear this wasn’t going away, and something had to be done.”\n\nSeveral U.S. officials told The Daily Beast the former Ukraine negotiator expressed openly that he was not ready to leave his position.\n\n“Volker was the easier guy to let go,” said one former State Department official. “He was never supposed to be in a permanent position and he didn’t hold as much weight internationally as some of the ambassadors. But just because it is an easy choice doesn’t mean it is the right choice.”\n\nNow that Volker is set to appear on Capitol Hill, officials are coming forward, telling The Daily Beast he should never have been let go in the first place. Four current and former State Department officials told The Daily Beast they were worried about how the U.S. would continue to engage internationally on Ukraine without Volker in place.\n\n“Ukraine policy has gone from being an office of one to a national level political scandal, and I don’t think there is an easy way to conduct the state of affairs in that atmosphere,” said another former State Department official. “There’s just a lot happening, and now we’re left without a day to day policy champion because Kurt is gone.”\n\n“ Sondland seems like the guy everyone should be looking at. ” — Diplomat who requested anonymity\n\nSeveral officials said they trusted Volker over other U.S. ambassadors in Europe, including the Ambassador to the European Union Gordon Sondland, on engaging with officials in countries like Germany, France, and the United Kingdom on Ukraine policy.\n\nSondland, who donated $1 million to Trump’s inaugural committee, was also involved in conversations with Giuliani about his efforts to investigate the Bidens in Ukraine. Giuliani told The Daily Beast last week that he worked with Volker first before taking part in several conference calls with Sondland. Volker’s resignation raised questions among officials about Sondland and why the ambassador did not face a similar fate.\n\n“Sondland seems like the guy everyone should be looking at,” one diplomat told The Daily Beast. “He was more involved than Volker and has the president’s ear. He follows orders from the White House in a way Volker didn’t.”", "description": "“Volker was the easier guy to let go,” said one former State Department official. “But just because it is an easy choice doesn’t mean it is the right choice.”", "authors": ["Erin Banco", "National Security Reporter"], "top_image": "https://img.thedailybeast.com/image/upload/c_crop,d_placeholder_euli9k,h_1687,w_3000,x_0,y_0/dpr_2.0/c_limit,w_740/fl_lossy,q_auto/v1569977689/100101-banco-pompeo-tease_kcg0ju", "published_at": "2019-10-02"}