{"pub": "cbc", "url": "https://cbc.ca/news/canada/london/king-s-university-college-student-madelaine-coelho-winner-2019-global-undergraduate-awards-1.5287637", "downloaded_at": "2019-09-23 17:16:35.200246+00:00", "title": "King's College student wins international prize for thesis about rape culture and Twitter | CBC News", "language": "en", "text": "A student from King's University College has won an international gold medal for her honours undergraduate thesis about rape culture and Twitter. Madelaine Coelho has been named the Global Winner in the social sciences category of the 2019 Global Undergraduate Awards.\n\nCoelho was among 3,500 students who submitted papers from institutions in 50 countries.\n\nHer paper is titled \"Rape Myths in Digital Spaces: An Analysis of High-Profile Sexual Assault Cases on Twitter.\"\n\nCohelo joined London Morning host Rebecca Zandbergen to discuss the motivation for her research and her findings.\n\nTell us a little bit more about why you wanted to look into this?\n\nSexual assault is such a pervasive issue. Forty-six thousand sexual assaults happen in Canada every year. To put that in context, there is 10,300 serious injuries due to motor vehicle collisions just in 2016. So sexual assault is really an amplified issue and 39 percent of Canadian adult women report having at least one experience of sexual assault since the age of 16. So, it's a very widespread issue and something I can say I have personal experience with, so it's something that really needs to be addressed.\n\nWhat exactly were you trying to find out?\n\nI was trying to find out how rape myths are expressed in online spaces. Social media has become so popular and such a place for news now that I wanted to see how rape myths are spread and how they're communicated online.\n\nHow do you define a rape myth? Give me some examples?\n\nA rape myth is a stereotyped and false belief about sexual assaults, rapists or rape victims. Unfortunately, they often excuse the crime and blame the victim. So an example would be that women lie or make up stories about being sexually assaulted. However the number of false reports for sexual assault is actually very low and it's consistent with a number of false reports for other crimes in Canada. In fact, sexual assault actually carries such a stigma that many women prefer not to report.\n\nYou looked at two rape cases that got a lot of press: Steubenville, 2012 and the Stanford rape case against Brock Turner. Remind us what those stories were about.\n\nIn the Steubenville rape case in 2012 in Ohio, a young woman was sexually assaulted over the evening. This one got a lot of traction because the digital hacktivist group Anonymous also exposed some evidence. There were two perpetrators and it gained a lot of controversy in the town because these two people were football stars and there was a lot of cover up happening in the town and in the school. With the Stanford rape case, a varsity swimmer on the Stanford swim team was convicted of sexual assault of a young woman in California and it also gained a lot of press. Unfortunately, though, he only got three months. He was up for 14 years.\n\nSo you looked at what was happening on Twitter in the conversations around both of those cases. What were you expecting to find?\n\nI was expecting to see something a lot more negative. I was expecting to see a lot of rape myths and a lot of victim-blaming tweets or perpetrator-excusing tweets. What I ended up finding, though, was actually the opposite, which was a lot easier I think for me to read. I was looking at over 10,000 tweets. I think it would be hard to read just constant rape myths.\n\nSo you found the opposite. What was the opposite? What sorts of tweets were circulating?\n\nI found a lot of victim supported tweets, and a lot of tweets resisting encountering rape culture. So they used these high profile sexual assault cases to actually fight back about the rape myth they saw in society or they saw the media use. This is not to say that there are no rape myths but rather that it's a good opportunity for Twitter users to express their resistance online. So, like, a common instance of this was that people often corrected media headlines within the Brock Turner case. So after Brock Turner was charged, some headlines read 'Olympic hopeful and varsity athlete Brock Turner sentenced to six months'. So the users corrected this tweet to what it actually should have said which was: 'Convicted rapist Brock Turner sentenced to six months'.\n\nHow did you make sure that you were categorizing them correctly, that this was not a rape myth and was in opposition to a rape myth? Was there some sort of algorithm you used?\n\nYes, actually I went through qualitatively and looked at every single tweet. But additionally what I used was, I made a coding scheme based on extensive literature on rape myths, and with consensus from my professor Dr. Jordan Fairbairn. And we found very precise kind of categories for each type of tweet we saw, each type of myth we saw. So actually, I went over about a thousand tweets first and then made the coding scheme and then went back and coded accordingly.\n\nWhat do you think it is about Twitter that there is this comfort level in in speaking out against rape myths?\n\nI think that Twitter has always had this blog-like environment where users just discuss their everyday thoughts and unsolicited opinions. I think it's a little bit more casual in that way. But additionally Twitter has always welcomed social movements. The 'been raped never reported' movement was popular during the Steubenville rape case back in 2012. It's always kind of been a place to counter and to resist. Whether that's mainstream culture or whether that's popular culture, and I think that it's an opportunity especially for youth users to work within these spaces because there's so much freedom there, and it allows you to express yourself pretty concisely in 140 characters or less.\n\nI wonder if you will do more research, or if you're curious to know if what happens on Twitter is representative of what happens in the real world?\n\nI actually do not know exactly. It's one of the things I'm looking into. Because if you look at a lot of media reports media reports it is the subtle rape myth. And even within the law and within education systems and curriculum there are still these rape myths that are kind of permeate within these spaces. So I think it's important for us not just to look at social media but also to look around to see and say: Are we making sure we're being accurate and representative and victim-supported and victim-centric in our responses to sexual assault?\n\nOK, Madeline Coelho, congratulations on your win and thanks for speaking to us.\n\nThank you. Thank you so much.", "description": "A student from King’s University College has won an international gold medal for her honours undergraduate thesis about rape culture and Twitter. Madelaine Coelho has been named the Global Winner in the social sciences category of the 2019 Global Undergraduate Awards.", "authors": ["Cbc News"], "top_image": "https://i.cbc.ca/1.5287640.1568761356!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/madelaine-coelho.jpg", "published_at": "2019-09-17"}