{"pub": "cbc", "url": "https://cbc.ca/sports/soccer/mls/mls-playoffs-east-semifinal-atlanta-philadelphia-1.5334442", "downloaded_at": "2019-10-25 23:55:00.693277+00:00", "title": "CBC Sports", "language": "en", "text": "With a salary of $3.8 million US in 2019, Spanish playmaker Alejandro Pozuelo is looking like a bargain for Toronto FC. But Toronto-born fullback Richie Laryea, at the MLS-minimum $56,250, is a downright steal.\n\nBoth are making their mark at different ends of TFC's salary scale.\n\nPozuelo, proving again he is New York City FC's kryptonite, scored both goals in TFC's dramatic 2-1 win over top-seeded NYCFC in the Eastern Conference semifinal Wednesday. Laryea, meanwhile, triggered the winning penalty with a marauding run off the bench.\n\nAfter missing the playoffs last season, Toronto is now one win away from its third MLS Cup final in four years. TFC lost to Seattle in a penalty shootout in 2016 and beat the Sounders in 2017.\n\nFourth-seeded Toronto advances to play at No. 2 Atlanta, the defending MLS champion which defeated No. 3 Philadelphia 2-0 in the other Eastern semifinal on Thursday, on Oct. 30.\n\nToronto lost 2-0 at Atlanta on May 8 and won 3-2 at BMO Field on June 26 — thanks to a Pozuelo penalty kick in stoppage time. The spot kick came after Laryea, driving towards goal, was fouled in the box.\n\nPozuelo, 28, and Laryea, 24, are both newcomers to Toronto this season.\n\nPozuelo arrived in March to much fanfare as a designated player — in the wake of off-season exits by Sebastian Giovinco and Victor Vazquez — after protracted exit negotiations with his Belgian club KRC Genk. Laryea, originally drafted by Orlando, signed later that month with Toronto issuing a two-paragraph release.\n\nTheir salaries reflect the hype, or lack thereof.\n\n2017 Champs vs. 2018 Champs. A spot in the 2019 <a href=\"https://twitter.com/hashtag/MLSCup?src=hash&ref_src=twsrc%5Etfw\">#MLSCup</a> Final on the line.<a href=\"https://twitter.com/hashtag/TheyWillSeeRed?src=hash&ref_src=twsrc%5Etfw\">#TheyWillSeeRed</a> | <a href=\"https://twitter.com/hashtag/MLSCupPlayoffs?src=hash&ref_src=twsrc%5Etfw\">#MLSCupPlayoffs</a> <a href=\"https://t.co/IPMIyoJ41i\">pic.twitter.com/IPMIyoJ41i</a> —@TorontoFC\n\nPozuelo is the seventh highest-paid player in MLS, according to the MLS Players Association. Teammates Michael Bradley and Jozy Altidore rank No. 2 and 3 at $6.5 million and $6.3 million, respectively.\n\nLaryea is the lowest-paid TFC player, No. 32 on the club list.\n\nPozuelo landed with a bang, scoring two goals and adding an assist in a 4-0 win over New York City FC on March 29.\n\n\"I think today we showed we have a good team,\" he said in his post-game interview Wednesday.\n\nToronto has converted Laryea, a former midfielder, into a fullback. Working hard off the field to learn the position, he has pushed Brazil's Auro for a starting job.\n\nLaryea draws praise from Bradley\n\nLaryea has a competitive streak that makes him a welcome presence when push comes to shove. And with the ball at his feet, he can cause havoc.\n\n\"His ability to move with the ball, to put guys on the wrong foot, to go by guys, that part is special,\" said Bradley. \"And he continues to make big plays for us whether it's as a sub or a starter. I'm so happy for him, so proud of him.\"\n\nLaryea was introduced in the 78th minute Wednesday at Citi Field.\n\n\"I just came in looking to bring a spark and help change the game, because the guys fought really hard for 80 minutes before I came in,\" he said.\n\nHe did just that, helped by Pozuelo. The Spaniard spotted him streaking down the right flank and fed him a pass that left two NYCFC defenders in no-man's land. Laryea then danced around fullback Ronald Matarrita and accelerated into the New York penalty box where Matarrita caught up with him as he made the turn towards goal and chopped him down to trigger the decisive penalty.\n\nWATCH | Pozuelo leads TFC into conference final:\n\nAlejandro Pozuelo scored both of Toronto FC's goals as the Reds beat NYCFC 2-1. 1:40\n\nMoved farther forward in the playoffs due to Altidore's quad strain, the slick Spaniard has pulled the strings up front. Not a conventional No. 9, he serves more like a basketball centre when pushed up front — he can turn and strike himself or bring someone else into the play while drawing defensive attention.\n\n\"He was great on the night,\" said coach Greg Vanney. \"He held up the ball for us, he brought people into the play. He moved around, he fought for things. He helped lead us defensively.\"\n\nPozuelo led the team with 12 goals and 12 assists during the regular season, with three of those coming against NYCFC. Wednesday made it five.\n\nPozuelo did dip slightly in form during the regular season, due perhaps to his extended campaign in Europe and North America combined with Toronto moving him around the field.\n\nHis favourite position is in the middle, slightly behind the striker, where he can move around the field and work his magic. His recent role has allowed him to do much of that.\n\nPozuelo is quick to praise Laryea.\n\n\"An amazing player,\" he said. \"When he comes to the pitch, he always give the maximum. We know he has a lot of good quality. He helps the team a lot. For me, he is one of the best players on this team.\"", "description": "Fourth-seeded Toronto advances to play at No. 2 Atlanta, the defending MLS champion which defeated No. 3 Philadelphia 2-0 in the other Eastern semifinal on Thursday.", "authors": [], "top_image": "https://i.cbc.ca/1.5334760.1571969694!/cpImage/httpImage/image.jpg_gen/derivatives/16x9_620/mls-toronto-fc-nycfc-soccer.jpg", "published_at": "2019-10-25"}