{"pub": "townhall", "title": "Strawberries: Spring's Healthiest Fruit", "url": "https://townhall.com/health/magnesium/2015/04/10/strawberries-springs-healthiest-fruit-n11360", "language": "en", "published_at": "2015-04-10", "downloaded_at": "2019-09-02 07:22:15.616628+00:00", "text": "Want to lower your risk for heart disease, stroke, heart attack, cancer, type 2 diabetes, high blood pressure, obesity , osteoporosis, arthritis and kidney stones? Of course you do. How about doing all of that without taking a single medication—prescription, over-the-counter, or any other type? Yes? Then say hello to the star of springtime—fresh strawberries, that beautiful, healthful, delicious superfood.\n\nHow strawberries each day keep the doctor away\n\nAsians call the strawberry the \"queen of fruits” because it’s loaded with health benefits. Ancient Roman physicians prescribed strawberries for many ailments, from fevers to kidney stones, as did French physicians as far back as the 14th century. With all due respect to apples, bananas and oranges, they fall short of the strawberry's many powers. So feast your eyes on these health benefits, then feast on some of these springtime beauties.The strawberry's anthocyanins stimulate the burning of stored fat. A report inshowed that animals fed a high-fat diet plus anthocyanins gained 24 percent less weight than the animals eating the high-fat diet with no anthocyanins.The same report showed that anthocyanins also boost short term memory by 100 percent in eight weeks.One cup of strawberries contains only 54 calories and a healthy dose of fiber In a Harvard School of Public Health study, women who ate 16 or more strawberries per week were 14 percent less likely to have elevated levels of C-reactive protein (CRP), which signals inflammation in the body.Antioxidant flavonoids, which also play a role in the strawberry's color and flavor, lower the risk for heart disease.\n\nMy rules for strawberries and all fruits\n\nStrawberries contain potassium, vitamin K and magnesium, all-important for bone health Studies show freeze-dried strawberry powder may help prevent human esophageal cancer.Strawberries are rich in biotin, which helps build strong hair and nails. They also contain the antioxidant ellagic acid, which protects the elastic fibers in our skin to prevent sagging.The nitrate in strawberries promotes blood flow and oxygen in our body, which is great for weight loss.Eating three or more servings of strawberries may reduce the risk of macular degeneration.Brush your teeth for five minutes with mashed, ripe strawberries. Rinse thoroughly and brush again with baking soda or your regular toothpaste. The acid in the strawberries will lead to a brighter smile. Before you rush out to shop, please remember that the strawberry is the gift that keeps on giving—IF, and it's a big IF—you play by the rules. Which rules, you ask? Mine. And they should be yours, too.: Eat organic only. Industrial strawberries are among the dirtiest of all crops, treated with any of nearly 60 different pesticides. You might as well go lick a sidewalk.: Eatgenetically modified (GMO) anything. GMO fruits and veggies are forbidden in many parts of Europe, Asia, Australia, New Zealand, even Russia. Smart people worldwide are saying \"NO.\" There's good reason why.\n\nMost cans are lined with carcinogenic BPA (plastic)\n\nAntioxidants and water-soluble nutrients such as vitamins C and B are stripped by processing\n\nFat-soluble nutrients such as vitamins A and E and the carotenoids may be forced out of the cells where they belong by preservation treatments. Vitamin C, for example, decreases by 10–90% during the canning of various C-rich vegetables.\n\nEnjoying strawberries: easy as pie\n\n: Eat whole, fresh fruits only and avoid fruit juice. Juice is not fruit and comes loaded with almost the same amount of sugar as a can of sugar-sweetened soft drink. And dried fruits—the same. Loaded with sugars. Further, juice has no healthful fiber, which has loads of health benefits, one of which is \"chewing resistance\"—which slows your body's intake of natural sugars, preventing harmful sugar spikes.: Eat no canned fruit, because:: Eat flash-frozen fruits in moderation, and only if your favorite fruit is out of season. These are not as healthful as fresh, but are less degraded than canned or old fruits.: Don't fall for the recent labeling claims that say something like, “Only five pieces of fresh fruit contain five servings of fruit. Understood? Good.If you're a pie person, you already know recipes for strawberry pie, so you don't need one from me. If you're not a pie person, there's no better time to become one. You'll find a million recipes online, in newspapers and magazines. Grab one and give it a go. Other ideas:\n\nBlend one and one-half cup of strawberries with 12 ounces of milk (almond, rice, cashew or whole dairy) or organic yogurt.Whatever kind of salad you usually make, throw in some sliced strawberries. Especially yummy if you're using grilled chicken breast as an ingredient.: Slice, eat.: Chopped strawberries, balsamic vinegar, honey, fresh basil and lemon zest combine brilliantly to top any meat or fish dish.", "description": "Want to lower your risk for heart disease, stroke, heart .09/02/2019 3:22:14AM EST.", "authors": ["Beth Baumann"], "top_image": "https://media.townhall.com/_townhall/resources/images/thog.png"}