{"pub": "fox", "url": "https://foxnews.com/entertainment/sharon-osbourne-reveals-facelift-the-talk-season-10-premiere", "downloaded_at": "2019-09-10 02:19:33.968672+00:00", "title": "Sharon Osbourne reveals new facelift on season 10 premiere of 'The Talk'", "language": "en", "text": "Sharon Osbourne returned to season 10 of \"The Talk\" with a new look.\n\nOn Monday's episode of the CBS morning show, the 66-year-old co-host proudly revealed the results of a recent facelift, while explaining to the audience what her operation entailed.\n\n“It was five weeks today that I had my operation,” Osbourne said. “I had my neck done, my jowls. … He kind of pulled it from the top of my head and put an elastic band in it. But everything was just lifted up. So it looks more refreshed.”\n\nSHARON OSBOURNE SAYS SHE WILL 'HAVE A NEW FACE' AFTER NEXT PLASTIC SURGERY: 'YOU'LL LIKE THE NEW ONE'\n\nShe went on to tell her fellow co-hosts that she felt \"OK,\" but admitted that she was still in \"a little bit of pain.\"\n\n\"But you can’t complain when you wanted to do it so it's fine,\" added Osbourne.\n\nSHARON OSBOURNE DISCUSSES BEING THE 'STABILITY' HER GRANDDAUGHTERS NEED FOLLOWING DIVORCE OF HER SON, JACK\n\nThe British author and TV personality first revealed her plans to go under the knife back in May. “My next surgery’s booked,” she said at the time during an episode of \"The Talk.\"\n\n“I’m having it in August so when we come back to film in September, I will have a new face,\" continued Osbourne, which prompted co-host Carrie Ann Inaba to reply: \"But I like this face.\"\n\nGET THE FOX NEWS APP\n\n“You’re just used to it, you’ll like the new one,\" Osbourne told her.\n\nOsbourne has been candid about her cosmetic procedures, writing in her 2013 book \"Unbreakable\" that “there’s not much I haven’t had tweaked, stretched, peeled, lasered, veneered, enhanced or removed altogether.\"\n\nMonday's episode of \"The Talk\" also marked Marie Osmond's debut as a co-host. The 59-year-old star replaced Sara Gilbert's spot on the show. Gilbert, who created \"The Talk\" in 2010 and was a co-host for nine seasons, announced her decision to leave in April.", "description": "Sharon Osbourne returned to season 10 of \"The Talk\" with a new look.", "authors": ["Mariah Haas"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/09/sharon-osbourne.jpg", "published_at": "2019-09-09"}