{"pub": "reuters", "url": "https://in.reuters.com/article/india-fuel-demand/indias-september-fuel-demand-slips-to-its-lowest-in-over-two-years-idINKBN1WV0YH", "downloaded_at": "2019-10-16 14:10:59.331806+00:00", "title": "India's September fuel demand slips to its lowest in over two years", "language": "en", "text": "(Reuters) - India’s fuel demand fell to its lowest in more than two years in September, data from the Petroleum Planning and Analysis Cell (PPAC) showed.\n\nA worker checks a 500 Indian rupee note as a man fills diesel in containers at a fuel station in Kolkata, August 14, 2018. REUTERS/Rupak De Chowdhuri/Files\n\nConsumption of fuel, a proxy for oil demand, totaled 16.01 million tonnes - its lowest since July 2017 - down about 0.3% compared with the same month last year.\n\nMeanwhile, consumption of diesel, which is widely used for transportation as well as for irrigation needs in India, slipped more than 3% year-over-year to 5.83 million tonnes, its lowest since January 2017.\n\nSales of gasoline, or petrol, were 6.3% higher from a year earlier at 2.37 million tonnes.\n\nCooking gas or liquefied petroleum gas (LPG) sales increased nearly 6% to 2.18 million tonnes, while naphtha sales slumped 26% to 0.84 million tonnes.\n\nSales of bitumen, used for making roads, were 7.3% lower, while fuel oil use edged lower 3.8% in September.\n\nDOMESTIC SALES (in million tonnes):\n\n2019 2019 2019 2019 2018 2018 2018 2018\n\nPRODUCTS SEPT AUG JULY JUNE SEPT AUG JULY JUNE\n\nDiesel 5.83 6.12 6.84 7.45 6.03 6.19 6.61 7.34\n\nPetrol 2.37 2.57 2.52 2.64 2.23 2.36 2.32 2.38\n\nLPG 2.18 2.40 2.22 1.79 2.06 2.12 2.03 1.93\n\nNaphtha 0.84 1.33 1.37 0.93 1.14 1.11 1.30 1.09\n\nJet Fuel 0.67 0.68 0.66 0.65 0.68 0.69 0.68 0.67\n\nKerosene 0.18 0.23 0.20 0.26 0.28 0.31 0.29 0.31\n\nFuel Oil 0.53 0.50 0.57 0.48 0.55 0.60 0.51 0.55\n\nBitumen 0.34 0.26 0.41 0.55 0.37 0.21 0.29 0.56\n\nTotal 16.01 17.26 17.63 17.59 16.07 16.63 17.09 18.08\n\nNOTE: Total figures may not tally because not all items are included in the table, and numbers are rounded. The numbers for previous months may have been revised.", "description": "India's fuel demand fell to its lowest in more than two years in September, data from the Petroleum Planning and Analysis Cell (PPAC) showed.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20191016&t=2&i=1441414705&w=1200&r=LYNXMPEF9F0MZ", "published_at": "2019-10-16"}