{"pub": "businessinsider", "url": "https://businessinsider.com/real-life-succession-drama-redstones-battle-viacom-cbs-authority-2019-9", "downloaded_at": "2019-09-22 23:13:20.325603+00:00", "title": "Meet the dramatic mogul-families that 'Succession' draws inspiration from, including the Trumps, Murdochs, and Redstones", "language": "en", "text": "Sumner Redstone's tumultuous legal and executive battles have played out like a storyline that still seems to be in the possible future for the Roy family. As the mogul aged into his 90s and reportedly lost some of his basic abilities, lawsuits broke out among his former partners, fellow board members, and even his daughter, as a future without him at the helm came more into focus.\n\nAn ongoing legal battle over Redstone's capabilities began when his former companion, Manuela Herzer, moved to claim control of his health care decisions in 2015, reportedly claiming he had become \"a living ghost.\" Investors were alarmed by the characterization given by Herzer, who Redstone apparently lavished with tens of millions of dollars in gifts before she was escorted from his Los Angeles home in 2015.\n\nIn October 2016, Redstone sued Herzer and his other former girlfriend Sydney Holland in Los Angeles Superior Court, citing charges including elder financial abuse, fraud, distress, and not acting in his best interest. The suits were later settled before trial.\n\nIn February 2016, 92-year-old Redstone gave up his chairmanships of CBS and Viacom after a court-ordered examination by a geriatric psychiatrist.\n\nBy December 2018, Redstone was formally ruled incapacitated by Los Angeles County Superior Court and given a guardian to protect his legal interests.\n\nIn 2018, Shari's profile as a power player began to rise after she filed a lawsuit on May 29, 2018, that alleged CBS inappropriately tried to strip her of control after a motion by CBS CEO Leslie Moonves.\n\nShe later found a major victory in August 2019, when the boards of CBS and Viacom announced a $12 billion deal that would reunite the companies with Shari as chairwoman of the new entity, ViacomCBS Inc.\n\nThe fight over Sumner's mental state reached a verdict in March 2019 that has so far gone unseen in \"Succession\" as the CBS Board of Directors paid $1.25 million to settle accusations it improperly compensating an incapacitated Redstone for at least two years.\n\nFortune writes that responsibility for the Redstones' drama falls squarely with Sumner, who \" stubbornly refused to put his house in order— scoffing at succession plans, appointing pliant boards, and running his $40 billion enterprise like a family grocery store.\"\n\nIn season one of \"Succession,\" a major storyline was founder Logan Roy's declining health and capabilities and their effect on the company. After suffering a stroke, Roy exhibited bizarre behavior while he attempted to continue to run Waystar — he slapped his grandson, peed on the floor of his adult son's office, and tried to grope his daughter. The incidents eventually led to a failed attempt to ouster Roy by his own son.", "description": "The billionaire family's power battles in \"Succession\" have drawn hypotheses about the show's inspiration, based on several real-life parallels.", "authors": ["Ellen Cranley"], "top_image": "https://amp.businessinsider.com/images/5d87c5a22e22af019f153a82-2732-1366.jpg", "published_at": "2019-09-22"}