{"pub": "fox", "url": "https://foxbusiness.com/lifestyle/southwest-to-offer-3-day-deal-amid-turmultous-time", "downloaded_at": "2019-10-02 00:36:08.941340+00:00", "title": "Southwest offers $49 fare deal despite loss of 737 MAX", "language": "en", "text": "Southwest Airlines is holding a three-day sale with fares as low as $49 to lure in customers after canceling hundreds of flights per day following the worldwide grounding of Boeing's 737 MAX.\n\nContinue Reading Below\n\nThe company, which flies only Boeing 737 jetliners, said on Tuesday that one-way fares under $50 for certain U.S. destinations will be accompanied by one-way trips under $100 to some international spots.\n\nTicker Security Last Change Change % LUV SOUTHWEST AIRLINES CO. 53.37 -0.64 -1.19%\n\nThe offers will be valid until midnight on Oct. 3, with $49 one-way nonstop flights between Las Vegas and San Diego and $79 one-way nonstop flights between Atlanta and Dallas, among others.\n\nCustomers may also take advantage of $69 one-way flights between Fort Lauderdale and Nassau, Bahamas; $119 one-way flights between Houston and Belize, and $134 one-way flights between Atlanta and Turks and Caicos, among others.\n\nSouthwest has had to drop 180 flights a day from its schedule because of the March grounding of the 737 MAX, which forced it to sideline 34 planes. The Dallas-based carrier has also delayed hiring new pilots.\n\nThe Max was sidelined after crashes in Indonesia and Ethiopia killed 346 people, and regulators focused on new anti-stall software that attempted to force at least one of the planes lower during takeoff because it received incorrect data.\n\nGET FOX BUSINESS ON THE GO BY CLICKING HERE\n\nSouthwest is the nation's largest domestic air carrier, according to the U.S. Department of Transportation's most recent data.\n\nSouthwest operates more than 4,000 weekday departures in peak travel seasons through a network of 101 destinations in the United States and 10 additional countries.\n\nThe Associated Press contributed to this report.", "description": "Southwest has had to drop 180 flights a day from its schedule because of the March grounding of Boeing's 737 MAX, which forced it to sideline 34 planes.", "authors": ["Daniella Genovese"], "top_image": "https://a57.foxnews.com/static.foxbusiness.com/foxbusiness.com/content/uploads/2019/04/0/0/iStock-Southwest.jpg?ve=1&tl=1", "published_at": "2019-10-01"}