{"pub": "cbc", "title": "PPC candidates to decide who attends debate by holding target shooting competition | CBC News", "url": "https://cbc.ca/news/canada/saskatoon/ppc-people-s-party-canada-gun-range-shootout-1.5268078", "language": "en", "published_at": "2019-09-02", "downloaded_at": "2019-09-03 00:56:01.787035+00:00", "text": "Two People's Party of Canada candidates in Saskatchewan are solving an impasse with a shootout at a gun range.\n\nThe Great Saskatoon Chamber of Commerce has invited one candidate from each party to a pre-election debate on Sept. 10 but when it came time to decide who would represent the PPC, Guto Pentaedo and Mark Friesen both thought they would represent the party well.\n\nPentaedo is PPC candidate for Saskatoon-University and Friesen is the candidate for Saskatoon-Grasswood.\n\nFriesen said he and Penteado also considered a bean bag toss or a potato sack race but they got excited about the idea of a shootout at the range because it speaks to the PPC's pro-gun policies.\n\n\"We're both pro-gun advocates,\" Friesen said. \"We believe in responsible gun ownership and rightful gun ownership and we're both hunters and we both have our own guns and we both have our licences.\"\n\nThe shootout will take place on Tuesday at 4 p.m. and will be streamed live on Facebook.\n\nWhoever has the best score will be declared the winner and attend the debate.\n\nSome commenters online joked about putting the faces of rival political party leaders on the targets, but Friesen said the gun range has strict rules about such behaviour. It's not allowed.\n\n\"We're responsible gun owners and with that comes responsibility at the gun range,\" Friesen said.\n\n'Guns don't kill people'\n\nPenteado said his views are \"totally aligned\" with the PPC in terms of gun control.\n\n\"We want to simplify gun policies,\" he said. \"We also want more safety courses available around Saskatchewan, around Canada, and more promotion about the good side of guns as a sport because all we see is very bad news about mass shootings and this is a very bad image for gun owners and the guns themselves.\"\n\nPenteado said the PPC is \"totally against\" gun violence. He firmly believes mass shootings are not about the guns.\n\n\"Guns don't kill people; what kills people is people. We need somebody to pull the trigger,\" he said.\n\n\"It's just like cars. When we have a car accident, we never blame the car, we blame the driver. Why are we blaming the gun, the object, when we have a mass shooting?\"\n\nGuto Penteado, left, and Mark Friesen are both pro-gun advocates and candidates for the People's Party of Canada in Saskatoon. (Guto Penteado/Facebook)\n\nBut Charles Smith, an associate professor of political studies at St. Thomas More College at the University of Saskatchewan, doesn't find that argument persuasive.\n\n\"All the evidence and research would suggest that having guns available and accessible leads to more violence,\" Smith said.\n\n'False divide between rural and urban'\n\nSmith said he thinks the event is insensitive, especially in light of the recent mass shooting in Texas.\n\n\"Bringing it into the political realm and suggesting this is a way to settle disputes reinforces the message that guns and violence are normal,\" he said. \"That's not a message that political parties should be sending in 2019 given all the gun violence we're witnessing in our society.\"\n\nSmith also thinks the event is gendered and racialized, and creates a false divide between rural and urban people.\n\n\"It plays to a stereotype in a very reactionary way,\" Smith said. \"It's very male . It doesn't speak for the entire rural population.\"\n\n'We're proud to be rednecks'\n\nOverall, Pentaedo said the reaction online has been positive, though there have been some people who have been mean-spirited and called them \"rednecks.\"\n\n\"We are rednecks, and we're proud to be rednecks,\" he said.\n\nPentaedo was born in Brazil and came to Canada 17 years ago. In Brazil, he was raised on a farm and learned hunting and target practice from his dad.\n\nHe found a similar culture in Saskatchewan.\n\n\"We live in the countryside, we love the nature, we love the interaction with animals and everything like that,\" he said. I'm referring to the good connotations about rednecks. We're not stupid. We're good rednecks.\"\n\nSuggesting this is a way to settle disputes reinforces the message that guns and violence are normal. ​​​ - Charles Smith, associate professor of political studies at St. Thomas More College at the University of Saskatchewan\n\nWhile Penteado said both he and Friesen would represent the party well at the debate, at the gun range, Friesen has the advantage.\n\nPenteado had surgery on his right eye last month — the eye he uses for shooting — and while he does go hunting, he generally doesn't do target practice. But he's still looking forward to it.\n\n\"I think we're going to have fun, and we're going to decide in a very healthy way.\"", "description": "Two candidates for the People's Party of Canada are solving a dilemma over which one of them will attend a debate on behalf of the party by holding a shootout at a Saskatchewan gun range. But some people think the event is insensitive, especially in light of the recent mass shooting in Texas.", "authors": ["Ashleigh Mattern Is A Web Writer", "Reporter With Cbc Saskatoon", "Cbc Saskatchewan", "Cbc North", "An Associate Producer With Saskatoon Morning. She Has Been Working As A Journalist Since", "Joined Cbc In Email", "Ashleigh.Mattern Cbc.Ca"], "top_image": "https://i.cbc.ca/1.5268086.1567454161!/fileImage/httpImage/image.jpg_gen/derivatives/16x9_620/ppc-shootout-mark-friesen-vs-guto-penteado.jpg"}