{"pub": "usatoday", "url": "https://usatoday.com/story/entertainment/celebrities/2019/10/16/rosario-dawson-talks-cory-booker-wonder-woman-kevin-smith-zombieland/3957054002", "downloaded_at": "2019-10-16 23:16:26.183010+00:00", "title": "Rosario Dawson loves working with Kevin Smith, opens up about boyfriend Cory Booker", "language": "en", "text": "CLOSE Rosario Dawson and boyfriend Cory Booker make rare public appearance at the world premiere in Los Angeles of sequel “Zombieland: Double Tap,” which lands 10 years after 2009 hit “Zombieland.” (Oct. 11) AP\n\nNEW YORK – Rosario Dawson is even busier than usual these days.\n\nThe actress, known for her roles in \"Sin City,\" \"Rent\" and five of Marvel's Netflix series (including \"Jessica Jones\" and \"Luke Cage\"), squeezes in a moment to eat between panels and comic book signings at New York Comic Con, where she launched several projects, and she's in two films opening this week.\n\nDawson, 40, plays Nevada in \"Zombieland: Double Tap\" (in theaters Friday), a sequel to the 2009 cult classic. She and her boyfriend, presidential hopeful Sen. Cory Booker, attended the premiere together last week, even sharing a kiss on the red carpet.\n\nHe's excited about the sequel and rewatched the first movie before the premiere, Dawson says. \"He was like, 'I just want to be caught up.' ... (He tried) to get information out of me, but I wouldn't tell him anything.\"\n\nThe couple confirmed in March that they're dating. Dawson and Booker are usually very private in their personal lives but have been more open about their relationship.\n\nHe's alive! How tragic 'Zombieland' victim Bill Murray ended up in the sequel\n\n'Jay and Silent Bob Reboot': What to know before you go\n\nRosario Dawson signs autographs during New York Comic Con at the Jacob K. Javits Convention Center on Oct. 4, 2019, in New York. (Photo: CHARLES SYKES/INVISION/AP)\n\nDawson has a cameo in director Kevin Smith's new film, \"Jay and Silent Bob Reboot,\" which hits theaters this week via Fathom Events. (She appeared in Smith's \"Clerks II\" but isn't reprising that role; she plays a new character.)\n\n\"I'm so happy for him,\" Dawson says. \"Kevin actually initiated filming on the exact year anniversary of his heart attack. ... I'm so grateful that he's still with us and still creating, and now he's talking about doing a 'Clerks III.' I just love working with him.\"\n\nShe has an animated film coming this month: Dawson again lends her voice to Diana Prince/Wonder Woman in \"Wonder Woman: Bloodlines\" (available in digital HD, arrives Oct. 22 on Blu-ray), her first solo animated movie.\n\nShe voiced Wonder Woman in several digitally released DC Comics animated movies, including \"Justice League Dark\" and \"Reign of the Supermen.\"\n\n\"To have a character like (Wonder Woman) that's been shared and loved and evolved over generations ... someone powerful and dynamic and interesting that we can all look up to and be inspired by – and to be a part of that storytelling – it's just an honor,\" she says.\n\nCory Booker and Rosario Dawson walked the \"Zombieland: Double Tap\" carpet hand in hand. (Photo: JON KOPALOFF/FILMMAGIC)\n\nDawson notes that movies featuring characters such as Wonder Woman are important, too.\n\n\"We continue to retake a look at these stories that we've had for so many years and go, 'but I want more from this, and I want to look at it really from the lens of society now,' \" she says.\n\nDawson is more than the voice of Wonder Woman; she's a lifelong comic book fan.\n\n\"My grandmother used to collect all the old comics,\" she says. \"I'm so upset she got rid of them. She had like the No. 1 Superman, she had all the number ones and was really obsessed with it.\"\n\nDawson's uncle, Gustavo Vazquez, became a comic book artist who has worked for Marvel and DC.\n\nRosario Dawson discusses \"Wonder Woman: Bloodlines\" at New York Comic Con on Oct. 4. (Photo: BEN GABBE/GETTY IMAGES)\n\nBooker has spoken often of how he's a big Batman fan. Who are some of Dawson's favorites? Aside from Wonder Woman, \"I always loved the Joker and Harley Quinn, personally, growing up,\" Dawson says.\n\nShe's especially proud of the growing diversity and inclusion in comic books and superhero movies and shows.\n\n\"I'm just grateful that (comic books) are getting the respect and care and space that (they) deserve,\" she says. \"Because it's been a hugely impactful genre in my life – things I've gotten to work on or act in and voice but also just indulge in and escape with and enjoy with my family for many years.\"\n\nRead or Share this story: https://www.usatoday.com/story/entertainment/celebrities/2019/10/16/rosario-dawson-talks-cory-booker-wonder-woman-kevin-smith-zombieland/3957054002/", "description": "Rosario Dawson chats about her latest films (including \"Zombieland 2\"), her relationship with Cory Booker and what it's like working with Kevin Smith.", "authors": ["Felecia Wellington Radel", "Published P.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/presto/2019/10/13/USAT/fe4c29a3-426b-41ac-b4bb-cca6c54539ef-GTY_1180705888.JPG?crop=4196,2361,x0,y0&width=3200&height=1680&fit=bounds", "published_at": "2019-10-16"}