{"pub": "reuters", "url": "https://reuters.com/article/us-afghanistan-election-system-explainer/explainer-how-afghanistan-will-elect-a-president-and-potential-peace-maker-idUSKBN1WB0IV", "downloaded_at": "2019-09-26 07:54:04.213896+00:00", "title": "Explainer: How Afghanistan will elect a president and potential peace maker", "language": "en", "text": "KABUL (Reuters) - Afghanistan will soon choose its next president. Whoever emerges victor will be key to the war-ravaged nation’s search for peace, but must beat more than a dozen other candidates and possibly face a run-off if no one gets a majority in round one.\n\nA billboard depicting Afghanistan's presidential candidate Ashraf Ghani is displayed in Kabul, Afghanistan September 25, 2019. REUTERS/Mohammad Ismail\n\nEighteen candidates are officially vying to lead the country, although some have informally dropped out. Of the rest, contenders include incumbent President Ashraf Ghani, his 2014 rival and uneasy partner in government Chief Executive Abdullah Abdullah and former warlord Gulbuddin Hekmatyar.\n\nRoughly 9.6 million people, about a third of them women, have registered to vote in 5,373 polling centers. Yet about one in twelve of those centers may not open because of security threats.\n\nThe Taliban insurgents, who control swathes of the country, have warned people against participating in the elections.\n\nTo protect voters, Afghan forces supported by NATO troops mission have been monitoring election stations across the country from Sept. 22.\n\nCampaigning, which lasts 60 days, ends two days before the vote.\n\nTo win the presidency after the initial polling, the leading candidate will need more than half of all votes. Otherwise, they face a run-off with the runner-up while the remaining candidates are forced to drop out.\n\nIf there is a second round, it is set to take place within two weeks of the first round results announcement.\n\nPreliminary results of the presidential elections are set to be announced Oct. 19, with the declaration of the final presidential result intended for Nov. 7, although long delays are the norm in Afghanistan since the return to democracy.\n\nTransmission of results will be slower from rural and remote parts of the country but steps are being taken to ensure that all results get declared together, election officials say.\n\nRelated Coverage Factbox: Old rivals square up again as an uncertain Afghanistan votes\n\nInternational observers will track the polls but will not be physically present at the stations because of the danger of insurgent attacks. Domestic observers, appointed by different candidates, will be present.\n\nIf a candidate dies during the voting or before results are announced, the election must be held again.\n\nCandidates must be Muslim, at least 40 years old and only hold Afghan nationality. They cannot have been convicted by a court of crimes against humanity, criminal acts or deprivation of civil rights.", "description": "Afghanistan will soon choose its next president. Whoever emerges victor will be key to the war-ravaged nation's search for peace, but must beat more than a dozen other candidates and possibly face a run-off if no one gets a majority in round one.", "authors": ["Reuters Editorial", "Min Read"], "top_image": "https://s4.reutersmedia.net/resources/r/?m=02&d=20190926&t=2&i=1434030532&w=1200&r=LYNXMPEF8P0BY", "published_at": "2019-09-26"}