{"pub": "yahoo", "url": "https://finance.yahoo.com/news/5g-stocks-biggest-winners-150925226.html", "downloaded_at": "2019-09-19 23:18:21.415637+00:00", "title": "Which 5G Stocks will Be the Biggest Winners?", "language": "en", "text": "When it comes to 5G stocks, I prefer a simple, elegant approach that has already proven itself in every other tech boom since the 1980s.\n\nThere will be a lot of winners in the race to 5G. For example, one stock that could be up big in the years ahead is Nokia (NYSE:NOK), one of the key makers of the hardware critical to the technology.\n\nBut as 5G takes the world by storm and ushers in a new technological revolution, there’s about to be a WAY bigger opportunity than we could capture by simply buying Nokia stock. The infographic below shows how 5G compares to 4G… how that compared to 3G… and so on.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nWhich 5G Stocks Will Be the Biggest Winners? More\n\nThose Nokia flip-phones had their heyday back at 1G and 2G. Then 3G was what allowed Apple (NASDAQ:AAPL) to take the world by storm with the iPhone. 4G made social media and streaming movies possible – you’re welcome, Facebook (NASDAQ:FB) and Netflix (NASDAQ:NFLX).\n\nAs you see, 5G is much bigger. The speeds are so much faster that you could think of 5G as the fuel of the future.\n\nSo what’s the engine? Microchips. Every company that sells you a 5G device first needs someone to supply the chips. 5G chips will send and receive massive amounts of data… and that’s where I’d invest.\n\nBut actually, chipmakers are not just 5G stocks. They’re almost always the secret to getting rich with new technologies. Just look at the personal computer (PC) revolution, for example.\n\nDuring the rise of PCs in the ’80s and ’90s, chipmakers went up by almost unfathomable amounts. Intel (NASDAQ:INTC), which supplied the much-needed chips for computer processing speed, shot up by an astounding 7,951% from 1985 to 2000:\n\nWhich 5G Stocks Will Be the Biggest Winners? More\n\nThen, during the explosive growth of the internet in the 1990s, Cisco Systems (NASDAQ:CSCO), which manufactures the vital processing chips for internet routers, soared an impressive 4,988%:\n\nWhich 5G Stocks Will Be the Biggest Winners? More\n\nThen came smartphones and 4G in the 2010s. As you see below, chipmakers led all other industries during the 4G build out. Semiconductors returned 237% – more than twice what mobile phones themselves delivered.\n\nWhich 5G Stocks Will Be the Biggest Winners? More\n\nKeep in mind, these were returns from the broad sectors. But just look at how well these individual chip companies did during the smartphone build out:\n\nBroadcom (NASDAQ: AVGO ), a chipmaker based in San Diego, California, handed early investors 1,482% during the smartphone build out.\n\n(NASDAQ: ), a chipmaker based in San Diego, California, handed early investors 1,482% during the smartphone build out. Skyworks Solutions (NASDAQ: SWKS ), another chipmaker based in Woburn, Massachusetts, returned 503% to early investors.\n\n(NASDAQ: ), another chipmaker based in Woburn, Massachusetts, returned 503% to early investors. NVIDIA (NASDAQ: NVDA ), based in the heart of Silicon Valley, gained 1,030%!\n\n(NASDAQ: ), based in the heart of Silicon Valley, gained 1,030%! Micron Technology (NASDAQ:MU) from Boise, Idaho, gained 260%, and NXP Semiconductors (NASDAQ:NXPI) from the Netherlands returned 845%.\n\nIt’s also worth pointing out that Apple — the world’s biggest, wealthiest company and one of the leaders in smartphones — returned roughly 582% over that same period. The difference is why you need chipmakers when a tech revolution occurs. That’s true of 5G, too, and I tell you exactly which chipmaker I recommend now (and why) in my new special report, The 5G Chip That Will Spark a $53 Trillion Revolution.\n\nBy investing in chipmakers, you’re investing in every laptop, tablet, car, smartphone, and any other electronic device of the day. In fact, each one has multiple chips inside! For example, one chipmaker supplied FIVE chips for every iPhone X. So, for every phone Apple sold, this company sold five chips.", "description": "When it comes to 5G stocks, I prefer a simple, elegant approach that has already proven itself in every other tech boom since the 1980s.There will be a lot of winners in the race to 5G. For example, one stock that could be up big in the years ahead is Nokia (NYSE:NOK), one of the key makers of the hardware", "authors": ["Matt Mccall"], "top_image": "https://s.yimg.com/uu/api/res/1.2/2OhsNMIU0Tr21ANg73Qkew--~B/aD0zMDk7dz01NTA7c209MTthcHBpZD15dGFjaHlvbg--/https://media.zenfs.com/en-US/investorplace_417/d1952c69975e7ec45dd4182c7dd44375", "published_at": "2019-09-19"}