{"pub": "fox", "url": "https://foxnews.com/sports/sam-darnold-jets-patriots-seeing-ghosts", "downloaded_at": "2019-10-22 13:36:45.930839+00:00", "title": "Sam Darnold's performance vs. Patriots gets spooky in Jets blowout loss: 'I'm seeing ghosts'", "language": "en", "text": "New York Jets quarterback Sam Darnold had one of the worst performances of his short career Monday against the New England Patriots, and to make matters worse was caught on microphone admitting to his struggles.\n\nDarnold was mic’d up for ESPN during the 33-0 loss to the Patriots. He was heard saying on the mic that he was “seeing ghosts.” Darnold must have been haunted enough as he threw four interceptions, failed to throw a touchdown pass and only had 86 passing yards in the blowout.\n\nDOLPHINS TO PUNISH SAFETY BOBBY MCCAIN FOR ALLEGED SPITTING INCIDENT WITH BILLS FANS: REPORT\n\n“I just gotta see the field a lot better,” the second-year quarterback from USC told reporters after the game. “That's kinda what that means. It was a rough day out there, rough night out there, and obviously I gotta be better and learn from the mistakes. But we will get better.”\n\nPatriots defensive end Kyle Van Noy appeared to enjoy Darnold’s comment on the field when he learned of it.\n\n“He did? Ooh, man, that's the boogie man,” he said. “It's real.”\n\nNEW YORK GIANTS' PAT SHURMUR EVISCERATED OVER PLAY-CALLING IN LOSS TO ARIZONA CARDINALS\n\nHe added: “That's crazy for him to say that. That makes it real, you know what I'm saying? That's crazy. ... I think it's just a testament to how well we're playing, to be honest. And we played really well tonight.”\n\nThe Jets could not get anything going against the Patriots. The team had 154 total yards on only one less drive than the Patriots had (13 vs. 14). New York also turned the ball over six times.\n\nThe Jets fall to 1-5 on the season and the Patriots improve to 7-0.\n\nCLICK HERE FOR MORE SPORTS COVERAGE ON FOXNEWS.COM\n\nNew England has now beaten New York eight straight times and 16 out of the last 18 times dating back to Oct. 9, 2011.", "description": "New York Jets quarterback Sam Darnold had one of his worst performances of his short career Monday against the New England Patriots and was caught admitting to his struggles.", "authors": ["Ryan Gaydos", "Ryan Gaydos Is A Sports Reporter For Foxnews.Com", "Foxbusiness.Com. Follow Him On Twitter"], "top_image": "https://static.foxnews.com/foxnews.com/content/uploads/2019/10/NFL-Sam-Darnold5.jpg", "published_at": "2019-10-22"}