{"pub": "washingtonpost", "url": "https://washingtonpost.com/world/europe/the-rebel-alliance-teamed-up-to-thwart-boris-johnsons-plans-can-it-stay-united-to-steerbrexit/2019/09/10/2a5ee6fa-d3f9-11e9-8924-1db7dac797fb_story.html", "downloaded_at": "2019-09-10 23:29:02.905282+00:00", "title": "The ‘rebel alliance’ teamed up to thwart Boris Johnson’s plans. Can it stay united to steer Brexit?", "language": "en", "text": "\n\nJeremy Corbyn, opposition Labour party leader, speaks to trade unions in Brighton, England, on Tuesday. (Ben Stansall/AFP/Getty Images)\n\nJeremy Corbyn had demanded an election dozens of times, insisting his Labour Party was eager, as he put it in July, to “let the people decide their future.”\n\nBut when British Prime Minister Boris Johnson dangled the prospect of a new vote last week, the leader of the country’s largest opposition party overcame temptation and batted it away, likening it to “an offer of an apple to Snow White from the Wicked Queen.”\n\nEvery other British opposition party joined him, forming a united front that led to two humiliating defeats for the prime minister — and a scrambled picture of where Britain goes next with Brexit.\n\nThe story of British politics in recent days has been dominated by Johnson’s stumbles, including an unbroken record of losses on key parliamentary votes, along with purges, defections and even family rejections.\n\nBut analysts say it all would have turned out very differently had the so-called “rebel alliance” — a motley crew of opposition parties and moderate members of Johnson’s own Conservative Party — not hung together to thwart his plans for a possible no-deal exit from the European Union.\n\n[A chaotic final night for Parliament leaves Johnson with bleak choices on the path to Brexit]\n\nFor parties and politicians unaccustomed to teaming up, the coordination has been a shock.\n\nThere has been “very little experience, if any, of close cooperation between opposition parties,” said Tom Brake, Brexit point person for the pro-E.U. Liberal Democrats and a member of Parliament since 1997. “The cooperation we’ve seen on Brexit is really the first example of that for many decades.”\n\nNow, with Brexit and a possible election still in the balance, the question is how far the cooperation will go. In particular, analysts wonder whether Johnson opponents can demonstrate unity in backing something they are all for, instead of just blocking proposals they oppose.\n\n“The opposition has managed to be united in frustrating the government,” said Bronwen Maddox, director of the London-based Institute for Government. “But the things that are not agreed are even more important.”\n\nMost critical of all: what to do about Brexit and whether to form a pact in the next election, which is still expected later this year.\n\nAnd on those questions, Johnson opponents have far less common ground.\n\n[Boris Johnson has four options to escape his Brexit mess. One of them is to go to jail.]\n\nAlthough they all fear or loathe the idea of a no-deal exit, they have vastly different ideas about what shape Britain’s exit should take — or whether the country should leave at all.\n\nSome — including a cross-party group created on Tuesday called “MPs for a Deal” — want Britain to quickly come to terms with the E.U. on a soft exit along the lines of the one negotiated by former prime minister Theresa May.\n\nOthers, including Labour’s Corbyn, advocate a second referendum, potentially without the party taking a stand on whether voters should back “leave” or “remain.”\n\nThe Liberal Democrats, meanwhile, have proposed canceling Britain’s plans for an exit by taking back the Article 50 withdrawal letter announcing the U.K.’s plan to leave.\n\n\n\nJo Swinson, leader of the Liberal Democrats, speaks in the House of Commons last week. (Jessica Taylor/Parliament/EPA-EFE/Shutterstock)\n\nWith Parliament suspended and lawmakers heading back to their districts, the anti-Johnson comity of recent days was already giving way to the contest for votes.\n\n“We are the strongest ‘remain’ party,” said the Liberal Democrats’ Brake. “The Labour Party’s policy is so nuanced that nobody knows what it is.”\n\n[He defied Boris Johnson. Now the prime minister’s party is gunning for his seat, with Brexit on the line.]\n\nThe parties that cooperated in recent days will, in many cases, be vying for the same set of voters: Britons who backed remain, or who wanted to leave but don’t like the idea of crashing out without a deal.\n\nIn Britain’s first-past-the-post voting system, that means parties such as Labour and the Liberal Democrats could end up both losing to the Conservatives, even in areas that voted “remain,” if they divide the pro-E.U. vote.\n\nForming a pact in which parties agree on where to compete, and where to stand down, “can make a huge difference,” Maddox said.\n\nThere’s a similar dynamic at play on the anti-E.U. side, with the nascent Brexit Party offering Johnson’s Tories a deal that could unite the “leave” vote. Johnson has so far been cool to the idea, but analysts say it could deliver him the majority he has sought.\n\nBrake said that if the Conservatives and the Brexit Party make a deal, then “opposition parties need to look seriously at how they would respond to that.”\n\nElection cooperation would come with peril. Corbyn, who is unapologetic about left-wing views that include nationalization of the rail and energy sectors, is anathema to many of the pro-business voters of the Liberal Democrats.\n\nIn Scotland, Labour and the Scottish National Party have been able to work together to oppose the Tories on Brexit, despite the fact that they disagree over whether Scotland should be independent — and maintain a bitter rivalry.\n\n“We’ve reached the point where any action that can be taken to stop a no-deal Brexit has to be taken,” said Carol Monaghan, an SNP lawmaker who won a longtime Labour seat in Glasgow in 2015. “Even Labour is finally coming to that realization.”\n\nAs long as a no-deal Brexit is on the table, at least some level of cooperation appears likely to persist. In the wee hours of Tuesday morning, the opposition parties united to beat back Johnson’s second attempt to deliver an election, with Corbyn and others arguing that it represented a backdoor path to no-deal.\n\nAnd they stuck around for hours afterward to protest the government’s plan to suspend Parliament until mid-October. Opposition lawmakers attempted to halt that suspension, waving placards that read “Silenced,” shouting “Shame! Shame!” at Conservative members and trying to physically block Speaker John Bercow from leaving his chair.\n\nBercow, who on Monday afternoon had dramatically announced plans to step down from the job, made clear he appreciated the rebellious mood. He called the decision to bar the doors of Parliament amid the political crisis of Brexit “an act of executive fiat.”\n\nAcross the opposition benches, lawmakers cheered.\n\nRead more\n\nBoris Johnson’s statements about the state of Brexit negotiations bear little relationship to reality, E.U. officials say\n\n‘The Trumpization of U.K. politics’: Boris Johnson is busting political norms\n\nWho is British House of Commons Speaker John Bercow? And why does his resignation matter?\n\nToday’s coverage from Post correspondents around the world\n\nLike Washington Post World on Facebook and stay updated on foreign news", "description": "The British leader has been outmaneuvered by once-fractious rivals who are now working together.", "authors": ["Griff Witte", "Roaming America After Years Overseas In Europe", "The Middle East", "South Asia", "Karla Adam", "London Correspondent Covering The United Kingdom", "September At Pm"], "top_image": "https://www.washingtonpost.com/resizer/E9ijmJBlcMeAcuDnhbpeCs1ue98=/1484x0/arc-anglerfish-washpost-prod-washpost.s3.amazonaws.com/public/TD5UDRGUAAI6TE2DIDNVPT3KXU.jpg", "published_at": "2019-09-10"}