{"pub": "yahoo", "url": "https://news.yahoo.com/no-butts-no-boors-rugby-fans-learn-ropes-131528599.html", "downloaded_at": "2019-10-05 01:35:25.526162+00:00", "title": "No butts, no boors: Rugby fans learn the ropes in polite Japan", "language": "en", "text": "Rugby fans pose prior to the Japan 2019 Rugby World Cup Pool A match between Ireland and Russia at the Kobe Misaki Stadium in Kobe\n\nNo phone calls on the train, no smoking on the streets, and don't pack your Vicks inhaler: that's the message for rugby fans in Japan for the World Cup.\n\nJapan has rolled out the welcome mat for rugby fans, stocking up on beer and relaxing tattoo taboos, but there are still some faux pas that visitors from around the world would do well to avoid.\n\n- Public decorum -\n\nJapanese society is unfailingly polite and reserved. Loud conversations are rare even in the street, and virtually non-existent in enclosed spaces like trains and restaurants.\n\nSigns on trains remind riders to avoid using their phones or playing music loud enough to be heard from their headphones.\n\nSo eyebrows were raised when a video began circulating online of French fans seated on the floor of a subway carriage, passing a crowdsurfing friend over their heads.\n\n\"I was watching them with a smile at first, but it escalated gradually and they were bumping other people,\" wrote the Japanese Twitter user who posted the video, since viewed over two million times.\n\n\"Their feet hit my camera and the lens cover flew away. So I changed carriages.\"\n\nBut the incident has proved the exception rather than the rule, and while some Twitter users worried whether it was a sign of things to come ahead of next year's Olympics, others brushed it off.\n\n\"Please be generous to cheerful foreigners. The Rugby World Cup is a special festival,\" wrote one.\n\n- Littering -\n\nJapan is among the cleanest countries in the world, with spotless streets even in the sprawling capital of Tokyo, with 16 million residents.\n\nBut paradoxically, the country has almost no trash cans, with Japanese carrying their litter around with them until they can dispose of it at home.\n\nThat has left some visitors bemused.\n\n\"It was a surprise. They've got beautiful clean places, but I don't know how they do it with no bins,\" Irish fan Alan Parker told AFP at a Tokyo fanzone.\n\n\"So you just have to carry your stuff with a plastic bag.\"\n\nBut all is not lost if you're a visitor with litter to unload. Most of the convenience stores that can be found every few hundred metres in cities like Tokyo have rubbish bins inside.\n\n- Smoking in public -\n\nJapan has long been considered a rare smoker's paradise, one of the last places in the developed world to allow smoking in restaurants and bars.\n\nBut the smoking rate has been falling, and local governments have cracked down on public smoking.\n\nMany of Tokyo's streets are designated no-smoking zones, with regular signs warning of fines for lighting up.\n\nInstead, smokers must hunt for small areas set aside for the purpose, generally partially screened and set back from the street.\n\nBut some visitors confessed they were bending the rules.\n\n\"I smoke in the streets,\" said Mark Clifford, 48, an Australian watching a game at a Tokyo pub.\n\n\"It's the World Cup, there are a lot of foreigners, so they have to be tolerant. Especially if they want us to have a good image of their country.\"\n\n- Drugs -\n\nJapan has zero tolerance rules on recreational drugs, and there have been no moves towards loosening restrictions on marijuana as seen in some countries.\n\nSo far there has been little sign of trouble, though two Irish rugby fans were arrested on suspicion of heroin possession in Tokyo last week.\n\nThe country also bans a wide variety of over-the-counter medication from Vicks inhalers and allergy pills and some painkillers.\n\nAnd bringing in prescription medication can require a special import licence.\n\nThe rules are strictly enforced and in 2015 an American executive for Toyota was arrested for allegedly importing the painkiller oxycodone for knee pain.\n\nIn the run-up to the World Cup, the British embassy in Tokyo released a series of videos warning visitors about the rules.\n\n\"Don't get arrested or get deported for smuggling... nasal spray,\" one warns.", "description": "No phone calls on the train, no smoking on the streets, and don't pack your Vicks inhaler: that's the message for rugby fans in Japan for the World Cup.  Japan has rolled out the welcome mat for rugby fans, stocking up on beer and relaxing tattoo taboos, but there are still some faux pas that", "authors": [], "top_image": "https://s.yimg.com/uu/api/res/1.2/kLZGIBolf70iK8Q0JS8YNA--~B/aD0xOTI0O3c9Mjg4NTtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_US/News/US-AFPRelax/000_1l08eq.0d93e103851.original.jpg", "published_at": "2019-10-04"}