{"pub": "thehill", "url": "https://thehill.com/opinion/national-security/465320-reducing-nsc-staff-places-trump-on-right-side-of", "downloaded_at": "2019-10-11 19:47:33.736735+00:00", "title": "Reducing NSC staff places Trump on right side of history", "language": "en", "text": "The downsizing of the National Security Council (NSC) staff by President Trump Donald John TrumpDemocratic 2020 hopefuls tout LGBTQ plans at town hall Trump defends Syria move at rally: 'Bring our troops back home' Pompeo adviser resigning: report MORE and national security adviser Robert C. O’Brien is a policy initiative that is long overdue. The NSC staff should not be confused with the National Security Council itself, which is defined by statute to include the president and the vice president along with the Secretaries of State, Defense and Treasury. The chairman of the Joint Chiefs of Staff and the director of national intelligence also attend NSC meetings as advisers to the principals.\n\nThe NSC staff, however, is composed of individuals who are assigned to support the president and the Council in their deliberations. In recent years, the staff has expanded its purview to include coordinating interactions among the various cabinet departments and agencies. The latter, especially under the Obama administration, has been the justification for much of the staff’s growth in recent years.\n\nWhen the NSC was formed during the Truman administration, the staff assigned to support it was approximately a dozen people, all of whom had other jobs within the White House. During the Eisenhower administration the staff grew to around 50 people because of Eisenhower’s preference for a highly structured staffing process that he brought with him from his time in the Army. President Kennedy slashed the staff back to approximately 20 and maintained a flat, hub-and-spoke national security decision-making process. Lyndon Johnson continued that model while overseeing U.S.-Soviet relations and the Vietnam War.\n\nADVERTISEMENT\n\nDuring the Nixon and Ford administrations, the NSC staff doubled to 40 people under Henry Kissinger’s leadership and pursued a greatly expanded analytical agenda, including formulation of a portfolio of several hundred national security study memorandums covering everything from arms control to oceans policy. The George H.W. Bush administration handled the end of the Cold War and the first Gulf War with a staff of 50. Bill Clinton William (Bill) Jefferson ClintonHouse Democrats subpoena Rick Perry in impeachment inquiry House Democrat breaks from party, says House should vote to start impeachment inquiry Why impeach Trump? Follow the polls MORE, in the “End of History” post-Cold War era, doubled the size of the NSC staff to just shy of 100 and began to consolidate more foreign policy decision-making within the White House complex.\n\nThe second Bush administration expanded the NSC staff to 136. Under the Obama administration, the NSC staff ballooned to nearly 200 people, many of them temporary detailees from executive departments and agencies.\n\nIn its original incarnation, the NSC staff existed to facilitate the meetings and recommendations of the National Security Council, which is to say its statutory members when they convened to provide advice to the president on national security issues. As such, the original NSC staff, to include the national security adviser, were not involved in the formulation of policy, but rather provided options and staff support to statutory decision-makers.\n\nThis began to change subtly during the Kennedy and Johnson administrations as they dealt with the Cold War and the challenge of Vietnam. The shift became pronounced during the Nixon administration, when Kissinger became national security adviser and emerged as a major voice within the administration, and even a decision-maker. While President Reagan sought to diminish the influence of the national security adviser, he did begin to augment the NSC staff to aid him in policy development, as well as to bypass difficult cabinet leaders — a decision that led to several problems, including the Iran-Contra scandal.\n\nGeorge H.W. Bush and Brent Scowcroft re-established the national security adviser’s role as an honest broker but retained staff functions that aided the president in policy development. Clinton, Bush II and Obama accelerated the transformation of the NSC staff into a miniaturized version of the State, Defense and Treasury departments resident within the White House complex. This was done through the growth in the number of directorates within the NSC staff.\n\nADVERTISEMENT\n\nThe Cold War NSC staff had begun with a focus on regional issues. To this end, the regional directorates (European, Russian, Asian and Western Hemisphere Affairs) were created. Other regions were added as complexity was recognized (East Asian, African, Near East and Northern Africa, and Central Asian Affairs). However, “functional” directorates such as Defense Policy and Strategy, International Economics and International Arms Control soon emerged during the 1960s to provide support to NSC principals in their work.\n\nAs time passed, more specific — and more politically focused — functional directorates were added in support of administration political agendas. Clinton created a “Multilateral and Humanitarian” directorate. Bush II, not surprisingly, created a “Combating Terrorism” directorate and Obama stood up a “Democracy, Human Rights and International Organizations” directorate. In addition, more technically focused directorates such as Cyber Security and Intelligence Programs were created. Lastly, the Bush II team created purely war-focused organizations in the Iraq and Afghanistan directorates. Each of these was generally headed by a senior director, who was supported by a staff.\n\nThe role of the overall NSC staff also evolved. Whereas in the beginning its function was to administratively support the National Security Council in its deliberations, after Kennedy was inaugurated, the staff began to provide policy support to the president himself, taking on foreign policy roles that in the past had been reserved to the secretaries of State and War/Navy/Defense. In addition, as the role of the national security adviser expanded, the NSC staff also grew to support him or her as well.\n\nLastly, during the Obama administration, the catchphrase for the role of the NSC staff was “management of the inter-agency process,” which is to say, facilitating communications and coordinating actions among the various executive departments and agencies. However, the Obama administration apparently undercut itself by filling its NSC staff ranks with relatively inexperienced staff members. These individuals, according to such luminaries as former Secretary of Defense Robert Gates, often caused problems by inappropriately inserting themselves into the chain of command, to include attempts to directly “coordinate” four-star generals in the field in Afghanistan.\n\nHence, the move by President Trump and his new national security adviser O’Brien to shrink the size of the NSC staff should be observed correctly as a return to its historic roots in supporting the president and the National Security Council in their efforts to deliberate the nation’s security interests, rather than a less capable version of established executive agencies and departments.\n\nThe expansions of the NSC staff during the Clinton and Obama administrations need to be reversed. The detailees from the various executive departments and agencies should be returned to their parent organizations to resume important work there and avoid issues associated with bifurcated bureaucratic loyalties. The number of directorates should be reduced and streamlined to reflect regional areas of concern, to include space and focused functional issues such as defense strategy, counterterrorism and emerging technologies.\n\nThe NSC staff — which should be around 100, even in a complex world characterized by growing great-power competition — can return to its proper role of staffing the principal members of the Council itself and help the nation’s executive branch return to its historical form of cabinet-led policy creation and implementation.\n\nJerry Hendrix is vice president of Telemus Group and a retired Navy officer with experience in strategy, force structure planning, carrier strike group operations and anti-submarine warfare. He has held posts with senior staffs including the Chief of Naval Operations Executive Panel, the secretary of Defense’s Office of Force Development, and the Office of Net Assessment.", "description": "The NSC staff, expanded greatly during the Clinton and Obama administrations, should number about 100 people.", "authors": [], "top_image": "https://thehill.com/sites/default/files/obrienrobert_and_trump_10102019_1.jpg", "published_at": "2019-10-11"}