{"pub": "usatoday", "url": "https://usatoday.com/story/sports/mlb/2019/10/20/savages-in-the-box-go-bust-with-slew-of-strikeouts/40347343", "downloaded_at": "2019-10-20 05:14:46.485071+00:00", "title": "Savages in the box go bust with slew of strikeouts", "language": "en", "text": "HOUSTON (AP) — A record-setting season by Savages in the Box ended with a slew of strikeouts and another October bust for the New York Yankees.\n\nFor the first time since the 1910s, the 27-time champions have gone through an entire calendar decade without even making it to a World Series.\n\nAn AL Championship Series of missed opportunities ended when Aroldis Chapman allowed José Altuve's pennant-winning, two-run homer in the ninth inning Saturday night that gave the Houston Astros a 6-4 win and the pennant in six games.\n\n\"It will serve us well going forward when we get to the top of the mountain,\" Yankees manager Aaron Boone said.\n\nAltuve became only the second player to eliminate the Yankees in the postseason with a walk-off homer, the first since Bill Mazeroski's homer off Bill Terry won Game 7 of the 1960 World Series for Pittsburgh.\n\nAfter a regular season with 306 homers, the Yankees got two more to overcome a 3-0, first-inning deficit, a solo shot by Gio Urshela and DJ LeMahieu's two-run drive off Roberto Osuna in the ninth.\n\nBut after talking all year about how important it was to gain home-field advantage, the Yankees showed what a slight let-up in the last 10 days of the regular season meant. Houston finished with 107 wins and the Yankees 103, giving the Astros hosting rights for the first two games of the ALCS and the last two.\n\nAnd so after losing Game 7 at Minute Maid Park two years ago, the Yankees lost their fourth straight ALCS since their last World Series title in 2009.\n\nNew York went 1 for 6 with runners in scoring position, finishing 6 for 35 (.171) in the series with 42 runners left on base — that after leading the majors with a .294 RISP during the season. The Yankees lived and died by the homer, scoring 16 of their 21 runs in the series on 10 long balls. They struck out 11 times in Game 6, raising their series total to 64.\n\nNew York has gone longer between World Series seasons, but the 2010s are the first decade since their first championship in 1923 that the Yankees didn't even get a chance to win a title.\n\nBoone, whose Game 7 homer lifted the Yankees over Boston in Game 7 of the 2003 ALCS, has avoided saying whether anything short of a title was a failure.\n\n\"I know as an organization myself, our players, we're chasing a championship and we're doing everything we can. We want to be champions. So that's the goal. That's the focus,\" Boone said.\n\n\"Putting a label, success, fail, all that, I don't really have time for it, honestly,\" he said. \"I'm proud to go compete with those guys every day. I reject it a little bit but I don't really get caught up in the question, either.\"\n\n___\n\nMore AP baseball: https://apnews.com/tag/MLBbaseball\n\nCopyright 2019 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed.", "description": "A record-setting season by Savages in the Box ended with a slew of strikeouts and another October bust for the New York Yankees", "authors": ["Published A.M. Et Oct."], "top_image": "https://www.gannett-cdn.com/-mm-/0b78a9a46c788639ff6fb470fb72eede24a0047f/c=0-245-4701-2889/local/-/media/2019/10/20/USATODAY/usatsports/07c8dbc75a3c433ba660f82f871d04bd.jpg?width=3200&height=1680&fit=crop", "published_at": "2019-10-20"}