{"pub": "financialpost", "url": "https://globenewswire.com/news-release/2019/10/22/1933314/0/en/Positive-gold-recovery-tests-on-Pershing-Manitou-Project.html", "downloaded_at": "2019-10-22 14:01:55.091517+00:00", "title": "Positive gold recovery tests on Pershing-Manitou Project", "language": "en", "text": "ROUYN-NORANDA, Quebec, Oct. 22, 2019 (GLOBE NEWSWIRE) -- Pershimex Resources Corporation (\"Pershimex\" or \"the Company\") (TSX Venture: PRO) announces that it has received the results of its various mineral tests recently undertaken on the Pershing-Manitou project, Courville property. The results of the cyanide tests returned higher than expected gold concentrations. In fact, previous sampling campaigns had returned gold values in the order of 1 g/t, while the new results were 10 times higher. This difference is mainly due to the nugget effect present in this type of environment. Cyanide tests were carried out to find out the different parameters of the ore, including its gold content. The Company's objective is to transport approximately two thousand tons of material from the former Pershing-Manitou mine to a custom milling plant. The cyanidation tests were carried out by the CTRI (Centre Technologique des Résidus Industriels) in Rouyn-Noranda. In conjunction with these tests, the Company sent samples for environmental characterization to URSTM (Unité de Recherche et Service en Technologie Minérale) in Rouyn-Noranda. The results confirmed that the ore is not an acid generator, thus admissible in a custom milling plant and its tailings pound.\n\n\n\nThe results of the cyanide tests are very encouraging with a 95% gold recovery rate combined with low reagent consumption. The average gold content obtained by the Company in the various tests is 10 g/t. The tests were carried out on a series of systematic samples from material extracted from the former Pershing-Manitou mine by the former operator. These results confirm the presence of gold in proportions equal to that described in the work reports made by the Pershing-Manitou Gold Mines company in the late 1940s. Further work is being carried out to confirm in depth these results obtained on the surface.\n\nRobert Gagnon, President and CEO of the Company, said: \"The positive results of the various mineral tests carried out confirm the relevance of our vision. We want to take advantage of the increase in the price of gold and value our properties by leveraging available and easily accessible resources. With the excellent results obtained, the Company confirms that it will go ahead to ship the ore to the custom milling plant. »\n\nPershimex Resources Corporation - Quick Overview\n\nStrategic positioning in Abitibi-Témiscamingue with more than 800 claims.\n\nOwns 100% of the rights to the Courville property.\n\nPartnership with Dundee Precious Metals on the Malartic property;\n\nThis press release was prepared by Robert Gagnon, geologist, president of Pershimex, a qualified person under Regulation 43-101.\n\nFor more information, please contact:\n\nRobert Gagnon, President Jacques Levesque, CFO Phone: (819) 825-2303 Phone: (819) 797-4354\n\n\n\nWarning\n\nThe TSX Venture Exchange and its regulatory services provider (as is attributed to this term in the policies of the TSX Venture Exchange) assume no responsibility for the relevance or accuracy of the information contained in the this press release.\n\nThe facts set out in this press release that are not historical facts are \"forward-looking statements\" and readers are cautioned that these statements are not a guarantee of success and that future developments and results may differ from those projected in these forward-looking statements.", "description": "", "authors": ["Pershimex Resources Corporation Inc."], "top_image": "http://www.globenewswire.com/Attachment/LogoDisplay/530029?filename=530029.jpg&size=1", "published_at": "2019-10-22"}