{"pub": "nationalreview", "url": "https://nationalreview.com/2019/10/china-nba-twitter-dispute-league-abases-itself", "downloaded_at": "2019-10-07 23:31:49.040356+00:00", "title": "China-NBA Twitter Dispute: League Abases Itself and America", "language": "en", "text": "Outside the NBA Store in New York City (Brendan McDermid/Reuters)\n\nChina’s authoritarianism is creeping into American life through corporate power. To hell with that.\n\nOn Friday, Daryl Morey, the general manager of the NBA’s Houston Rockets tweeted an image that said, “Fight for Freedom. Stand with Hong Kong.” Within a few hours, it had been deleted. The damage had been done. Several behemoth Chinese corporations and state institutions announced that they were suspending business with the Houston Rockets. Tencent, the NBA’s largest partner outside the U.S, has a lucrative contract to broadcast NBA games; it will no longer broadcast the Rockets because of Morey’s tweet. The Rockets are one of the most popular franchises in China for the obvious reason that Yao Ming made his career there; he heads the Chinese Basketball Association, which also cut ties with the Rockets.\n\nAdvertisement\n\nAdvertisement\n\nBy the end of the weekend, the entire NBA was in damage-control mode, profusely and absurdly abasing themselves. The NBA said that Morey’s statement was “regrettable.” And in a statement in Chinese, they further elaborated on their “disappointment” in him. The Rockets have considered firing Morey anyway. League commissioner Adam Silver has tried to officially stand behind the league’s own freedom-of-expression policy. “I think as a values-based organization that I want to make it clear . . . that Daryl Morey is supported in terms of his ability to exercise his freedom of expression.”\n\nPlayers were dragooned into the controversy. “We apologize. You know, we love China. We love playing there,” said James Harden. “For both of us individually, we go there once or twice a year. They show us the most important love.”\n\nAdvertisement\n\nThe first thing to say about this is that the NBA’s utterly craven reaction starkly contrasted with their boldness in pulling an All Star game from Charlotte, N.C., over transgender issues. NBA players were similar dragooned into that controversy. “I recognize this was a tough decision for the NBA, but I respect the choice. Discrimination of any kind cannot be allowed,” said Stephen Curry. Carmelo Anthony said, “Believe it or not, we’re always put in tough situations. Some things you can talk about, some things you can’t talk about. I think the NBA has to decide where that line is and when to cross it.”\n\nThe NBA’s hypocrisy is just the same as that of Apple’s Tim Cook, who also threatens boycotts and blockades of states that allow religious freedom, while saying nothing about religious freedom in China. But it’s really even worse than that. The NBA runs a training program right in the heart of China’s Xinjiang province, where Muslims are being sent en masse into reeducation camps.\n\nChinese outlets were reveling in their power. China Daily editorialized:\n\nLet’s hope the incident with Morey and the Houston Rockets will teach other companies a lesson: The big Chinese market is open to the world, but those who challenge China’s core interests and hurt Chinese people’s feelings cannot make any profit from it.\n\nIn America, you can buy a Volkswagen and criticize Angela Merkel. You can turn around and sell financial products back to German buyers who hate president Donald Trump. But free trade with China has certain conditions attached.\n\nAnd the conditions have an insidious effect. There are layers of self-censorship and self-abasement that extend into America. The NBA doesn’t just abase itself in order to keep its access to China’s lucrative markets. The reporters who cover the NBA are afraid to criticize the league and its president. ESPN reporter Adrian Wojnarowski, who followed the controversy over the 2017 All Star game in Charlotte, has been studiously silent on this controversy. ESPN, his Disney-owned parent company, which editorialized extensively in favor of the NBA’s anti-North Carolina protest, is running only the most pro forma news coverage of the NBA controversy.\n\nAdvertisement\n\nMost of what is called political correctness in America is not actually enforced by the government directly. It is instead enforced by corporations who design their workplace-education policies and, increasingly, their hiring guidance based on the fear of litigation risk. By doing so assiduously, corporations also seek to curry favor with the political class and receive a moral indulgence for their rank profiteering. But it’s interesting to see how quickly and easily a Communist Party command structure, when joined to the profit motive, can inspire Americans such as Daryl Morey, whose employers grant them “freedom of expression,” to voluntarily go through a public ideological struggle session, as if there were two legitimate sides in the protests over civil rights in Hong Kong.\n\n2/ I have always appreciated the significant support our Chinese fans and sponsors have provided and I would hope that those who are upset will know that offending or misunderstanding them was not my intention. My tweets are my own and in no way represent the Rockets or the NBA. — Daryl Morey (@dmorey) October 7, 2019\n\nAdvertisement\n\nThis event is starkly clarifying. And it should give conservatives and progressives pause, because China’s model of imposing Xi Jinping thought is a direct and equal threat to us. If Chinese authoritarianism is able to spread into American life through corporate power, because corporations are set up to serve shareholders and have trouble thinking ethically beyond that, then perhaps it is the duty of the state to interrupt the exchange mechanism through which this corruption proceeds. If China is forcing American corporations to impose Xi Jinping thought, maybe it’s time to choose. No more basketball camps in the shadow of concentration camps. No more enrichment of Chinese culture, if the price is our freedom and our integrity. To hell with Chairman Xi, and to hell with every business venture that makes others too afraid to say likewise.\n\nAdvertisement", "description": "If China is forcing American corporations to impose Xi Jinping thought, maybe it’s time to choose. No more basketball camps in the shadow of concentration camps. No more enrichment of Chinese culture, if the price is our freedom and our integrity.", "authors": ["Michael Brendan Dougherty", "Andrew C. Mccarthy", "Matthew Continetti", "Brian Stewart", "David French", "George Will", "Kyle Smith", "Rich Lowry", "Jonah Goldberg", "John Mccormack"], "top_image": "https://i2.wp.com/www.nationalreview.com/wp-content/uploads/2019/10/nba-store-manhattan.jpg?fit=1200%2C700&ssl=1", "published_at": "2019-10-07"}