{"pub": "guardian", "url": "https://theguardian.com/sport/2019/oct/03/dina-asher-smith-sets-sights-on-being-all-time-great-after-doha-200m-triumph", "downloaded_at": "2019-10-03 23:27:17.845817+00:00", "published_at": "2019-10-03", "title": "Dina Asher-Smith sets sights on being all-time great after Doha 200m triumph", "language": "en", "text": "Dina Asher-Smith has set her sights on becoming one of the greatest athletes of all time after her stunning 200m world championship gold medal in Doha.\n\nSpeaking after having only two hours’ sleep following her first global title, the 23-year-old immediately set her sights on the Olympic Games in Tokyo next year – and vowed not to let success go to her head.\n\n“I’m an athlete and a competitor and I want to see how fast I can go, and if I can push myself into being one of the best athletes of all time,” said Asher-Smith, who also won 100m silver on Sunday night.\n\nDina Asher-Smith’s short sprint from an ice cream bribe to a gold medal | Tumaini Carayol Read more\n\n“But I’m going to approach the Olympics as though I haven’t won here. Every year I assess my races – where I can improve or get a bit stronger or quicker to keep pushing where I can go as an athlete. I think that’s how you keep being great irrespective of your results.”\n\nAsher-Smith said she had not responded to the hundreds of tweets and messages she had received since winning the 200m in a British record time because she did not want to jeopardise the British 4x100m women’s chances of winning a medal this weekend. But she did admit to enjoying a congratulations video sent by the Great British Bake Off star Mary Berry, which the athlete described as “so cool”.\n\nShe also paid tribute to her coach, John Blackie, who has guided her career since she was eight. “He is like a second dad to me,” Asher-Smith said.\n\n“His intelligence and patience is what gets us through. He knows me so well and understands my moods. He has known me since I was eight and he’s had such a part to play in who I am as a woman today.”\n\nMeanwhile Seb Coe has predicted that Asher-Smith will become the “poster child” for the British team at next year’s Olympics providing she keeps her focus. Coe, president of the International Association of Athletics Federations, said: “It’s only a short time in your career where you know you will probably win – and the rest of the field know that – and she looks like she has entered that period.\n\nSign up to The Recap, our weekly email of editors’ picks.\n\n“Careers can sometimes be brutally short but if she can combine a world championship win with an Olympic title it puts her in the top handful of performers.\n\n“There are athletes who love the championships environment. They are trout going up stream. She looks like she is really enjoying it.”\n\nWhen asked what advice he would give her, Coe was clear. “Don’t screw around with too many variables, do what you are doing, don’t introduce new things. If it is working let it be. Keep the continuity. She is going into the next season as the poster child of our Games next year. I cannot think of anybody else who will so easily fit that bill.”\n\nHowever, Coe said Asher-Smith had to be careful not to get distracted by the celebrity circuit. “She will have to be buried away in training and get that balance,” he said. “She has a heightened awareness of what she can do in the sport. We have chatted about that on various occasions.\n\n“I hope for her own self she is a little bit selfish and doesn’t feel a responsibility to go to everything. She will figure it out, she is smart.”", "description": "Dina Asher-Smith has set her sights on becoming one of the greatest athletes of all time after her 200m world championship gold medal in Doha", "authors": ["Sean Ingle"], "top_image": "https://i.guim.co.uk/img/media/89b5230581434c282cc13977229830b51fe76f75/0_123_3500_2099/master/3500.jpg?width=1200&height=630&quality=85&auto=format&fit=crop&overlay-align=bottom%2Cleft&overlay-width=100p&overlay-base64=L2ltZy9zdGF0aWMvb3ZlcmxheXMvdGctZGVmYXVsdC5wbmc&enable=upscale&s=a82d7089514ff12c60cd2da77bfc5f22"}