{"pub": "yahoo", "url": "https://news.yahoo.com/gop-ohio-governors-gun-plan-192339400.html", "downloaded_at": "2019-10-07 20:10:36.980844+00:00", "title": "GOP Ohio governor's gun plan doesn't include 'red-flag' law", "language": "en", "text": "FILE - In this Jan. 14, 2019 file photo, Ohio Governor Mike DeWine speaks during a public inauguration ceremony at the Ohio Statehouse, in Columbus, Ohio. DeWine is ready to share specifics of his plan to curb gun violence through proposed changes expected to face pushback from fellow Republicans who control the Legislature. After a shooter in Dayton killed nine people in August, DeWine advocated requiring background checks for nearly all gun sales and allowing courts to restrict firearms access for people perceived as threats. He was expected to unveil details of his proposal Monday, Oct. 7 joined by Dayton Mayor Nan Whaley, a Democrat. (AP Photo/John Minchillo, Pool)\n\nCOLUMBUS, Ohio (AP) — Republican Gov. Mike DeWine's new proposals to address Ohio gun violence in the wake of the Dayton mass shooting don't include background-check requirements for gun sales or a so-called \"red-flag\" law to restrict firearms for people perceived as threats, despite his earlier support of those ideas.\n\nInstead, his administration detailed new legislative proposals Monday intended to increase background checks and ensure people don't have firearms if a court has deemed those people a danger.\n\nDeWine says his team consulted with lots of people and worked to produce proposals that he believes will get results, protect people's rights, and be able to pass the Republican-led Legislature.\n\nAdvocates from the anti-violence group Everytown for Gun Safety criticized DeWine, saying he abandoned his earlier proposals and offered legislation that lacks needed changes.", "description": "Republican Gov. Mike DeWine's new proposals to address Ohio gun violence in the wake of the Dayton mass shooting don't include background-check requirements for gun sales or a so-called \"red-flag\" law to restrict firearms for people perceived as threats, despite his earlier support", "authors": ["Kantele Franko"], "top_image": "https://s.yimg.com/uu/api/res/1.2/VyfZoeBk68DmaZ0vG5YjCA--~B/aD0yMjI3O3c9MzM0MDtzbT0xO2FwcGlkPXl0YWNoeW9u/https://media.zenfs.com/en/ap.org/b83deb7da0277f7ed163bc4bafc7e5e6", "published_at": "2019-10-07"}