{"pub": "aljazeera", "url": "https://aljazeera.com/news/2019/10/cheetah-fundraiser-save-world-fastest-animal-191021070226216.html", "downloaded_at": "2019-10-21 07:37:15.109879+00:00", "title": "Cheetah fundraiser to save the world's fastest animal", "language": "en", "text": "A California wildlife centre is planning a fundraiser for construction of a safe-house for the world's decreasing population of cheetahs.\n\nWild Wonders conservation and education centre in Bonsall has scheduled the November 2 event to benefit the Cheetah Conservation Fund in Africa, the San Diego Union-Tribune reported Sunday.\n\nProceeds will go towards construction of a facility in the Republic of Somaliland to care for cheetah cubs seized from smugglers, said Wild Wonders founder Jackie Navarro.\n\nThree cubs die for every one that is illegally smuggled to collectors. There are fewer than 7,100 cheetahs worldwide, about half the number from 10 years ago, according to the Cheetah Conservation Fund.\n\n\"The problem has grown to drastic proportions. Something has to be done,\" Navarro said.\n\nWild Wonders conducts more than 1,000 wildlife conservation programmes at schools throughout the western United States and Canada. Since 2007, the centre 76km (47 miles) north of San Diego has raised a trio of captive-bred cheetahs that have helped raise more than $100,000 for cheetah conservation, Navarro said.\n\nCheetahs are the fastest land animal. In the early 1900s, as farmable land expanded across Africa, farmers began killing cheetahs that hunted their goats and other livestock. Cheetahs also became a fashionable pet for the rich in Saudi Arabia and the United Arab Emirates.\n\nWhile the purchase and ownership of cheetahs has been banned in most Gulf states, lax enforcement, political corruption, porous borders and the poverty that drives smuggling operations have allowed the illegal trade to flourish, Navarro said.", "description": "Farmers in Africa began killing cheetahs that hunted their goats and other livestock during the 1990s.", "authors": [], "top_image": "https://www.aljazeera.com/mritems/Images/2019/10/21/b064eace582445a9ad4090813a7b6f0d_18.jpg", "published_at": "2019-10-21"}