{"pub": "npr", "url": "https://npr.org/2019/10/01/766020131/perus-president-dismisses-lawmakers-lawmakers-dismiss-peru-s-president", "downloaded_at": "2019-10-02 00:33:16.979190+00:00", "title": "Peru's President Dismisses Lawmakers; Lawmakers Dismiss Peru's President", "language": "en", "text": "Peru's President Dismisses Lawmakers; Lawmakers Dismiss Peru's President\n\nEnlarge this image toggle caption Rodrigo Abd/AP Rodrigo Abd/AP\n\nFor years, politicians at the highest rungs of power in Peru have warily circled one another, occasionally exchanging blows in the shadow of a corruption scandal that has roiled the country and its eastern neighbor Brazil. Now, that unease has erupted into an outright showdown between Peruvian President Martín Vizcarra and opposition lawmakers.\n\nIn a dramatic move Monday, Vizcarra dismissed Peru's entire legislature and called for new elections to replace its members, declaring in a televised address that \"we have done all we could\" to overcome the chamber's intransigence. He alleges that the principal opposition party — Popular Force, which is led by Keiko Fujimori, a Peruvian political scion and jailed former presidential candidate — has been stonewalling his anti-corruption reforms in order to line its members' pockets.\n\n\"This exceptional measure will permit the citizenry to finally express themselves and define, at the polls and through their participation, the future of our country,\" Vizcarra explained during his message to the country, according to a BBC translation.\n\nShortly afterward, the lawmakers responded to their own dismissal by dismissing Vizcarra, suspending him from office and swearing in his vice president, Mercedes Aráoz, as Peru's new leader. A majority voted to suspend Vizcarra for a year, condemning his move as an unconstitutional coup attempt and the act of a \"dictator.\"\n\nEnlarge this image toggle caption Andres Valle/AP Andres Valle/AP\n\nThe chaotic hours since then have seen dozens of opposition politicians holed up in the congressional chamber in Lima, refusing to budge in protest, and thousands of protesters gathered outside to loudly support the president's decision. The commanders of the country's security forces have also lined up behind Vizcarra, with the leaders of the navy, army, air force and police making their allegiances clear in a photograph circulated on Twitter by the president.\n\nIn the image, the commanders flank Vizcarra, the group seated at the same table in the presidential palace to display \"their full support for the constitutional order.\"\n\nNeither side has shown any indication of backing down from its claim to power.\n\nThe roots of this showdown run long — and they don't end at Peru's borders. Much of the controversy is connected with Odebrecht, a Brazilian construction conglomerate mired in a massive bribery scandal.\n\nFujimori was arrested last October during an investigation into claims that her Popular Force party accepted and sought to conceal donations from Odebrecht during her failed presidential bid in 2011. Fujimori, daughter of former Peruvian strongman Alberto Fujimori, still awaits trial on the allegations that she says are unfounded and politically motivated.\n\nVizcarra's four immediate predecessors in the presidential palace also have found themselves entangled in the extensive bribery scandal around Odebrecht. It already brought down Pedro Pablo Kuczynski, who resigned the presidency last year amid allegations that he accepted illegal payments from the firm and sought to buy votes to prevent his impeachment. He was succeeded by Vizcarra.\n\nFormer Presidents Ollanta Humala, Alan García and Alejandro Toledo have also been accused of accepting illegal funds from Odebrecht to varying degrees,. Toledo was arrested in the U.S. earlier this year and faces extradition back to Peru; García, meanwhile, killed himself as authorities closed in on him several months before that.\n\nWith so many of his predecessors under investigators' microscope, it made sense that Vizcarra vowed to conduct a \"head-on\" campaign against government graft. But to Vizcarra's critics, Monday's move to dissolve the legislature smacked of yet another controversial leader from Peru's past: Keiko Fujimori's father, Alberto.\n\nThe authoritarian leader dissolved the country's Congress in 1992, early in an iron-fisted tenure that would last until his ouster in 2000 — and would lead to his conviction on human rights crimes in 2009. The elder Fujimori was ultimately given a medical pardon by Kuczynski in 2017. In October 2018, the country's Supreme Court reversed the pardon, and Fujimori was eventually returned to prison.\n\nVizcarra says his own dissolution of Congress was justified partly because opposition lawmakers had refused his attempt to call a new election. If Vizcarra gets his way — a big \"if,\" given the tempest in Lima — the new legislative elections would be held in late January.", "description": "Martín Vizcarra called for new elections after dissolving Congress for blocking his anti-corruption efforts. But the lawmakers, who suspended him in turn, have no intention of going quietly.", "authors": ["Colin Dwyer"], "top_image": "https://media.npr.org/assets/img/2019/10/01/ap_19274142612241_wide-d46b204dc90adee328c49fa19c01ef9debe3d614.jpg?s=1400", "published_at": "2019-10-01"}