{"pub": "yahoo", "url": "https://yahoo.com/entertainment/alec-baldwin-doesn-apos-t-004804739.html", "downloaded_at": "2019-10-18 11:08:28.123486+00:00", "title": "Alec Baldwin Doesn't Think Anyone Involved in College Admissions Scandal Should Go to Jail", "language": "en", "text": "Alec Baldwin is feeling for his friends Felicity Huffman and William H. Macy.\n\nThe actor took to Twitter on Thursday to express his opinion on the college admissions scandal, after Huffman turned herself in to federal prison on Tuesday to begin her 14-day sentence, after pleading guilty to charges of mail fraud and honest services mail fraud back in April.\n\n\"I don’t think anyone involved in the college fraud cases should go to prison,\" Baldwin wrote. \"That includes past cases as well. Community service, fines, yes. But prison time, no. My heart goes out to Felicity, Bill Macy and their family.\"\n\nI don’t think anyone involved in the college fraud cases should go to prison. That includes past cases as well.\n\nCommunity service, fines, yes.\n\nBut prison time, no.\n\nMy heart goes out to Felicity, Bill Macy and their family. — HABFoundation (@ABFalecbaldwin) October 16, 2019\n\nA source close to Huffman's family told ET on Tuesday that Macy drove her to the Federal Correctional Institution in Dublin, California, where she began her sentence. \"Felicity was resigned to the fact she has to pay her dues to society. She is looking forward to putting this all behind her,\" the source added. \"Bill drove her there and dropped her off. Bill is supporting her and standing by her. He’s a rock and very supportive. She has a lot of family and friend support around her.\"\n\nLast month, the 56-year-old actress received her sentence -- 14 days behind bars, one year of supervised release, a $30,000 fine and 250 hours of community service working one-on-one with children -- for her role in the college admissions scandal.\n\nHuffman has admitted to paying $15,000 to help get her eldest daughter, 19-year-old Sophia, into an elite college by cheating on the SAT. During her sentencing on Sept. 13, Huffman cried and told the judge that she took full responsibility for her actions and was prepared for whatever sentencing was handed down. The actress also apologized to her husband as well as her daughters, 19-year-old Sophia and 17-year-old Georgia, and said she betrayed them all.\n\nIn a statement after the sentencing, Huffman -- who formally pleaded guilty to charges of mail fraud and honest services mail fraud back in April -- said she accepted the court's decision.\n\n\"I accept the court’s decision today without reservation,\" the statement read. \"I have always been prepared to accept whatever punishment Judge Talwani imposed. I broke the law. I have admitted that and I pleaded guilty to this crime. There are no excuses or justifications for my actions. Period. I would like to apologize again to my daughter, my husband, my family and the educational community for my actions. And I especially want to apologize to the students who work hard every day to get into college, and to their parents who make tremendous sacrifices supporting their children.\"\n\n\"I have learned a lot over the last six months about my flaws as a person,\" Huffman's statement continued. \"My goal now is to serve the sentence that the court has given me. I look forward to doing my community service hours and making a positive impact on my community. I also plan to continue making contributions wherever I can well after those service hours are completed. I can promise you that in the months and years to come that I will try and live a more honest life, serve as a better role model for my daughters and family and continue to contribute my time and energies wherever I am needed. My hope now is that my family, my friends and my community will forgive me for my actions.\"\n\nSee more about the actress' jail time in the video below.\n\nRELATED CONTENT:\n\nWhy Felicity Huffman Won't Serve All of Her 14-Day Prison Sentence\n\nWhat Felicity Huffman Can Expect in Prison: Bad Food, Kitchen Duty and a Roommate (Exclusive)\n\nA Guide to the College Admissions Scandal Involving Felicity Huffman and Lori Loughlin\n\nRelated Articles:", "description": "\"My heart goes out to Felicity, Bill Macy and their family.\"", "authors": ["Meredith B. Kile"], "top_image": "https://s.yimg.com/uu/api/res/1.2/Y5A3wtcF9uFWyJwVmzBImg--~B/aD03MjA7dz0xMjgwO3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en-US/homerun/etonline.tv/3118da25e87609a6a5b7a11088b3e863", "published_at": "2019-10-18"}