{"pub": "mirror", "url": "https://mirror.co.uk/3am/celebrity-news/inside-anna-vakilis-boozy-shoe-20542142", "downloaded_at": "2019-10-09 07:47:43.441885+00:00", "title": "Inside Anna Vakili's boozy shoe launch as she parties with Love Island pals", "language": "en", "text": "The video will start in 8 Cancel\n\nGet the biggest Daily Love Island stories by email Subscribe Thank you for subscribing We have more newsletters Show me See our privacy notice Could not subscribe, try again later Invalid Email\n\nAnna Vakili and her lookalike sister Mandi threw one epic party for the launch of their joint shoe collection.\n\nJoining them at Tuesday night's exclusive bash were many of Anna's former Love Island co-stars.\n\nWhile Maura Higgins was missing and Anna later revealed Molly-Mae Hague had a prior engagement, the Vakilli sisters were joined by their usual girl gang.\n\nAmber Gill, Yewande Biala and Amy Hart all turned out in their finery to get the party started.\n\n(Image: Instagram)\n\n(Image: Instagram)\n\n(Image: Instagram)\n\nAnd after they were treated to slap up meal the free bar opened and the ladies began to let loose.\n\nLove Island champ Amber was first to hit the dance floor as she showed off her moves in a tiny red midi dress and black stilettos.\n\nWoman of the hour Anna soon joined her in a thigh skimming pink number.\n\n(Image: Instagram)\n\n(Image: Instagram)\n\nHer sister Mandi stood out from the pack in an eye-catching lemon yellow suit worn over white lingerie.\n\nAt one point Mandi lifted her blazer to flash her transparent bodysuit to the camera as she danced.\n\n(Image: Instagram)\n\n(Image: Instagram)\n\nAmy Hart and Yewande Biala also got in on the action as they supped the many cocktails on offer.\n\nThe Islanders looked delighted to be back in each others company as they celebrated another one of their cast bagging themselves a lucrative fashion deal.\n\n(Image: Instagram)\n\nAfter leaving the villa, many of the stars have gone on to officially promote high street and online retailers.\n\nWhile grid girl Maura Higgins has landed roles on This Morning and the next series of Dancing on Ice.\n\nDespite their shared bond, Anna revealed last week that she no longer talks to keeps in contact with Maura.\n\n(Image: Phil Lewis/WENN.com)\n\nShe told the Sun Online: I haven't spoke to Maura. I haven't spoke to her and I don't speak to Curtis.\"\n\nWhen pressed for who she is still speaking to, Anna coyly responded: \"Let me tell you that WhatsApp group is not active at all because there are loads of people in there who don't like each other.\n\n'I can't say, I think it's obvious from watching Love Island who doesn't like each other. \"", "description": "Anna Vakili and her sister Mandi threw one epic party to celebrate their Simmi shoes collection", "authors": ["Lucy Needham", "Image", "Instagram", "Phil Lewis Wenn.Com"], "top_image": "https://i2-prod.mirror.co.uk/incoming/article20542264.ece/ALTERNATES/s1200/0_simmi-shoes.jpg", "published_at": "2019-10-09"}